{"id":"2412.11286","title":"Detecting Daily Living Gait Amid Huntington's Disease Chorea using a\n  Foundation Deep Learning Model","authors":"Dafna Schwartz, Lori Quinn, Nora E. Fritz, Lisa M. Muratori, Jeffery\n  M. Hausdorff, Ran Gilad Bachrach","authorsParsed":[["Schwartz","Dafna",""],["Quinn","Lori",""],["Fritz","Nora E.",""],["Muratori","Lisa M.",""],["Hausdorff","Jeffery M.",""],["Bachrach","Ran Gilad",""]],"versions":[{"version":"v1","created":"Sun, 15 Dec 2024 19:19:39 GMT"}],"updateDate":"2024-12-17","timestamp":1734290379000,"abstract":"  Wearable sensors offer a non-invasive way to collect physical activity (PA)\ndata, with walking as a key component. Existing models often struggle to detect\ngait bouts in individuals with neurodegenerative diseases (NDDs) involving\ninvoluntary movements. We developed J-Net, a deep learning model inspired by\nU-Net, which uses a pre-trained self-supervised foundation model fine-tuned\nwith Huntington`s disease (HD) in-lab data and paired with a segmentation head\nfor gait detection. J-Net processes wrist-worn accelerometer data to detect\ngait during daily living. We evaluated J-Net on in-lab and daily-living data\nfrom HD, Parkinson`s disease (PD), and controls. J-Net achieved a 10-percentage\npoint improvement in ROC-AUC for HD over existing methods, reaching 0.97 for\nin-lab data. In daily-living environments, J-Net estimates showed no\nsignificant differences in median daily walking time between HD and controls (p\n= 0.23), in contrast to other models, which indicated counterintuitive results\n(p < 0.005). Walking time measured by J-Net correlated with the UHDRS-TMS\nclinical severity score (r=-0.52; p=0.02), confirming its clinical relevance.\nFine-tuning J-Net on PD data also improved gait detection over current methods.\nJ-Net`s architecture effectively addresses the challenges of gait detection in\nsevere chorea and offers robust performance in daily living. The dataset and\nJ-Net model are publicly available, providing a resource for further research\ninto NDD-related gait impairments.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"mh3ClrYFF2wf8M2afRBY6ce27BhT8xYvd4KV3zeRRQw","pdfSize":"2502256"}