{"id":"2412.17685","title":"A Reproducible Method for Mapping Electricity Transmission\n  Infrastructure for Space Weather Risk Assessment","authors":"Edward J. Oughton, Evan Alexander Peters, Dennies Bor, Noah Rivera, C.\n  Trevor Gaunt, Robert Weigel","authorsParsed":[["Oughton","Edward J.",""],["Peters","Evan Alexander",""],["Bor","Dennies",""],["Rivera","Noah",""],["Gaunt","C. Trevor",""],["Weigel","Robert",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 16:11:18 GMT"}],"updateDate":"2024-12-24","timestamp":1734970278000,"abstract":"  Space weather impact assessment is constrained by the lack of available asset\ninformation to undertake modeling of Geomagnetically Induced Currents (GICs) in\nExtra High Voltage electricity infrastructure networks. The U.S. National Space\nWeather Strategy and Action Plan identifies underutilized data as a central\nissue for improving risk assessment, motivating this research. Accurate GIC\nprediction is generally not possible without information on the electrical\ncircuit, therefore we define a reproducible method based on open-source data,\nwhich enables risk analysts to collect their own substation component data.\nThis process converts OpenStreetMap (OSM) substation locations to\nhigh-resolution, component-level mapping of electricity transmission assets by\nutilizing an innovative web-browser platform to facilitate component\nannotation. As a case study example, we convert an initial 1,313 high-voltage\n(>115 kV) substations to 52,273 substation components via Google Earth APIs\nutilizing low-altitude, satellite, and Streetview imagery. We find that a total\nof 41,642 substation components (79.6%) connect to the highest substation\nvoltage levels (>345 kV) and are possibly susceptible to GIC, with a total of\n7,949 transformers identified. Compared to the initial OSM baseline, we provide\nnew detailed insights on voltage levels, line capacities, and substation\nconfigurations. Two validation workshops were undertaken to align the method\nand data with GIC assessment needs. The approach ensures consistency and rapid\nscalability, enabling users to quickly count components via a flexible\nweb-browser application.\n","subjects":["Physics/Geophysics","Computer Science/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_YcSz3Nqr_zR0Et1QZTIza8elcsTgzMVVSxjqsj-W9w","pdfSize":"6924632"}