{"id":"2412.03740","title":"Exploring the Role of AI-Powered Chatbots for Teens and Young Adults\n  with ASD or Social Anxiety","authors":"Dilan Mian","authorsParsed":[["Mian","Dilan",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 22:10:58 GMT"}],"updateDate":"2024-12-06","timestamp":1733350258000,"abstract":"  The world can be a complex and difficult place to navigate. People with\nHigh-Functioning Autistic Spectrum Disorder as well as general social\nineptitude often face navigation challenges that individuals of other\ndemographics simply do not themselves. This can become even more pronounced\nwith people of that specific group when they are in their teenage years and\nearly adulthood (that being the usual age range of college students). When they\nare at such a vulnerable age, they can be far more susceptible to the struggles\nof becoming comfortable and content with social interactions as well as having\nstrong relationships (outside their immediate family). Concerning this, the\nrapid emergence of artificial intelligence chatbots has led to many of them\nbeing used to benefit people of different ages and demographics with easy\naccessibility. With this, if there is anything that people with\nHigh-Functioning ASD and social ineptitude want when it comes to guidance\ntowards self-improvement, surely easy accessibility would be one. What are the\npotential benefits and limitations of using a Mindstudio AI-powered chatbot to\nprovide mental health support for teens and young adults with the\naforementioned conditions? What could be done with a tool like this to help\nthose individuals navigate ethical dilemmas within different social\nenvironments to reduce existing social tensions? This paper addresses these\nqueries and offers insights to inform future discussions on the subject.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"wLUZRsn0kGqr_eADMcM5BSenoFRg6XBNfN_gv1hueMg","pdfSize":"1749296"}