{"id":"2412.03744","title":"A novel approach to differential expression analysis of co-occurrence\n  networks for small-sampled microbiome data","authors":"Nandini Gadhia, Michalis Smyrnakis, Po-Yu Liu, Damer Blake, Melanie\n  Hay, Anh Nguyen, Dominic Richards, Dong Xia, Ritesh Krishna","authorsParsed":[["Gadhia","Nandini",""],["Smyrnakis","Michalis",""],["Liu","Po-Yu",""],["Blake","Damer",""],["Hay","Melanie",""],["Nguyen","Anh",""],["Richards","Dominic",""],["Xia","Dong",""],["Krishna","Ritesh",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 22:24:36 GMT"}],"updateDate":"2024-12-06","timestamp":1733351076000,"abstract":"  Graph-based machine learning methods are useful tools in the identification\nand prediction of variation in genetic data. In particular, the comprehension\nof phenotypic effects at the cellular level is an accelerating research area in\npharmacogenomics. In this article, a novel graph theoretic approach is proposed\nto infer a co-occurrence network from 16S microbiome data. The approach is\nspecialised to handle datasets containing a small number of samples. Small\ndatasets exacerbate the significant challenges faced by biological data, which\nexhibit properties such as sparsity, compositionality, and complexity of\ninteractions. Methodologies are also proposed to enrich and statistically\nfilter the inferred networks. The utility of the proposed method lies in that\nit extracts an informative network from small sampled data that is not only\nfeature-rich, but also biologically meaningful and statistically significant.\nAlthough specialised for small data sets, which are abundant, it can be\ngenerally applied to any small-sampled dataset, and can also be extended to\nintegrate multi-omics data. The proposed methodology is tested on a data set of\nchickens vaccinated against and challenged by the protozoan parasite Eimeria\ntenella. The raw genetic reads are processed, and networks inferred to describe\nthe ecosystems of the chicken intestines under three different stages of\ndisease progression. Analysis of the expression of network features derive\nbiologically intuitive conclusions from purely statistical methods. For\nexample, there is a clear evolution in the distribution of node features in\nline with the progression of the disease. The distributions also reveal\nclusters of species interacting mutualistically and parasitically, as expected.\nMoreover, a specific sub-network is found to persist through all experimental\nconditions, representative of a persistent microbiome.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DSzKjB1z6eJjpnfklVA0Gv392v3AMvKZRh5L7ENUL9Y","pdfSize":"1033042"}