{
  "id": "2412.01347",
  "title": "Redefining the dielectric response of nanoconfined liquids: insights\n  from water",
  "authors": "Jon Zubeltzu, Fernando Bresme, Matthew Dawber, Marivi Fernandez-Serra,\n  and Emilio Artacho",
  "authorsParsed": [
    [
      "Zubeltzu",
      "Jon",
      ""
    ],
    [
      "Bresme",
      "Fernando",
      ""
    ],
    [
      "Dawber",
      "Matthew",
      ""
    ],
    [
      "Fernandez-Serra",
      "Marivi",
      ""
    ],
    [
      "Artacho",
      "Emilio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 10:18:14 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733134694000,
  "abstract": "  Recent experiments show that the relative dielectric constant $\\epsilon$ of\nwater confined to a film of nanometric thickness reaches a strikingly low value\nof 2.1, barely above the bulk's 1.8 value for the purely electronic response.\nWe argue that $\\epsilon$ is not a well-defined measure for dielectric\nproperties at sub-nanometer scales due to the ambiguous definition of\nconfinement width. Instead we propose the 2D polarisability $\\alpha_{\\perp}$ as\nthe appropriate, well-defined response function whose magnitude can be directly\nobtained from both measurements and computations. Our molecular-dynamics\ncomputations based on density-functional theory and empirical force fields\nreproduce the previously reported low dielectric response of confined water,\nand importantly predict a very significant reduction, $\\sim 30$\\%, of the\nelectronic response as compared with the bulk's, contrary to what is widely\nassumed, highlighting the importance of electronic degrees of freedom to\ninterpret the dielectric response of polar fluids under nanoconfinement\nrconditions.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "D4fLaWwfMmqhvnivX3nJ4_Nr4Lb9AtZq4UIKxIC2Zsc",
  "pdfSize": "2411214"
}