{"id":"2412.19346","title":"Semi-Supervised Learning from Small Annotated Data and Large Unlabeled\n  Data for Fine-grained PICO Entity Recognition","authors":"Fangyi Chen, Gongbo Zhang, Yilu Fang, Yifan Peng, Chunhua Weng","authorsParsed":[["Chen","Fangyi",""],["Zhang","Gongbo",""],["Fang","Yilu",""],["Peng","Yifan",""],["Weng","Chunhua",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 20:24:35 GMT"}],"updateDate":"2024-12-30","timestamp":1735244675000,"abstract":"  Objective: Extracting PICO elements -- Participants, Intervention,\nComparison, and Outcomes -- from clinical trial literature is essential for\nclinical evidence retrieval, appraisal, and synthesis. Existing approaches do\nnot distinguish the attributes of PICO entities. This study aims to develop a\nnamed entity recognition (NER) model to extract PICO entities with fine\ngranularities.\n  Materials and Methods: Using a corpus of 2,511 abstracts with PICO mentions\nfrom 4 public datasets, we developed a semi-supervised method to facilitate the\ntraining of a NER model, FinePICO, by combining limited annotated data of PICO\nentities and abundant unlabeled data. For evaluation, we divided the entire\ndataset into two subsets: a smaller group with annotations and a larger group\nwithout annotations. We then established the theoretical lower and upper\nperformance bounds based on the performance of supervised learning models\ntrained solely on the small, annotated subset and on the entire set with\ncomplete annotations, respectively. Finally, we evaluated FinePICO on both the\nsmaller annotated subset and the larger, initially unannotated subset. We\nmeasured the performance of FinePICO using precision, recall, and F1.\n  Results: Our method achieved precision/recall/F1 of 0.567/0.636/0.60,\nrespectively, using a small set of annotated samples, outperforming the\nbaseline model (F1: 0.437) by more than 16\\%. The model demonstrates\ngeneralizability to a different PICO framework and to another corpus, which\nconsistently outperforms the benchmark in diverse experimental settings\n(p-value \\textless0.001).\n  Conclusion: This study contributes a generalizable and effective\nsemi-supervised approach to named entity recognition leveraging large unlabeled\ndata together with small, annotated data. It also initially supports\nfine-grained PICO extraction.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"hJmNTw92bBQ2SP_I4s8E6bDvcgzYLdKGYVy8sJHlMOE","pdfSize":"1612722"}