{
  "id": "2412.09235",
  "title": "A semiconcavity approach to stability of entropic plans and exponential\n  convergence of Sinkhorn's algorithm",
  "authors": "Alberto Chiarini, Giovanni Conforti, Giacomo Greco, Luca Tamanini",
  "authorsParsed": [
    [
      "Chiarini",
      "Alberto",
      ""
    ],
    [
      "Conforti",
      "Giovanni",
      ""
    ],
    [
      "Greco",
      "Giacomo",
      ""
    ],
    [
      "Tamanini",
      "Luca",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 12:45:31 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734007531000,
  "abstract": "  We study stability of optimizers and convergence of Sinkhorn's algorithm in\nthe framework of entropic optimal transport. We show entropic stability for\noptimal plans in terms of the Wasserstein distance between their marginals\nunder a semiconcavity assumption on the sum of the cost and one of the two\nentropic potentials. When employed in the analysis of Sinkhorn's algorithm,\nthis result gives a natural sufficient condition for its exponential\nconvergence, which does not require the ground cost to be bounded. By\ncontrolling from above the Hessians of Sinkhorn potentials in examples of\ninterest, we obtain new exponential convergence results. For instance, for the\nfirst time we obtain exponential convergence for log-concave marginals and\nquadratic costs for all values of the regularization parameter. Moreover, the\nconvergence rate has a linear dependence on the regularization: this behavior\nis sharp and had only been previously obtained for compact distributions\narXiv:2407.01202. Other interesting new applications include subspace elastic\ncosts [Cuturi et al. PMLR 202(2023)], weakly log-concave marginals, marginals\nwith light tails, where, under reinforced assumptions, we manage to improve the\nrates obtained in arXiv:2311.04041, the case of unbounded Lipschitz costs, and\ncompact Riemannian manifolds.\n",
  "subjects": [
    "Mathematics/Probability",
    "Mathematics/Optimization and Control",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zcD9e6aQ6EoQZO2HZFdlfOZwpwWBg98EIuaLS8OJFvQ",
  "pdfSize": "466377"
}