{"id":"2412.04566","title":"Global well-posedness and scattering for mass-critical inhomogeneous NLS\n  when $d\\ge3$","authors":"Xuan Liu, Changxing Miao, Jiqiang Zheng","authorsParsed":[["Liu","Xuan",""],["Miao","Changxing",""],["Zheng","Jiqiang",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 19:17:36 GMT"}],"updateDate":"2024-12-09","timestamp":1733426256000,"abstract":"  We prove global well-posedness and scattering for solutions to the\nmass-critical inhomogeneous nonlinear Schr\\\"odinger equation\n$i\\partial_{t}u+\\Delta u=\\pm |x|^{-b}|u|^{\\frac{4-2b}{d}}u$ for large\n$L^2(\\mathbb{R} ^d)$ initial data with $d\\ge3,0<b<\\min \\left\\{ 2,\\frac{d}{2}\n\\right\\}$; in the focusing case, we require that the mass is strictly less than\nthat of the ground state.\n  Compared with the classical Schr\\\"odinger case ($b=0$, Dodson, J. Amer. Math.\nSoc. (2012), Adv. Math. (2015)), the main differences for the inhomogeneous\ncase ($b>0$) are that the presence of the inhomogeneity $|x|^{-b}$ creates a\nnontrivial singularity at the origin, and breaks the translation symmetry as\nwell as the Galilean invariance of the equation, which makes the establishment\nof the profile decomposition and long time Strichartz estimates more difficult.\nTo overcome these difficulties, we perform the concentration\ncompactness/rigidity methods of [Kenig and Merle, Invent. Math. (2006)] in the\nLorentz space framework, and reduces the problem to the exclusion of almost\nperiodic solutions. The exclusion of these solutions will utilize fractional\nestimates and long time Strichartz estimates in Lorentz spaces.\n  In our study, we obseve that the decay of the inhomogeneity $|x|^{-b}$ at\ninfinity prevents the concentration of the almost periodic solution at infinity\nin either physical or frequency space. Therefore, we can use classical Morawetz\nestimates, rather than interaction Morawetz estimates, to exclude the existence\nof the quasi-soliton.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"v8wqMxTgNS6XoPRFsjmrFdWp8YpOxtwhztmrYNQhOg0","pdfSize":"456153"}