{"id":"2412.10114","title":"Large trion binding energy in monolayer WS$_2$ via strain-enhanced\n  electron-phonon coupling","authors":"Yunus Waheed, Sumitra Shit, Jithin T Surendran, Indrajeet D Prasad,\n  Kenji Watanabe, Takashi Taniguchi, and Santosh Kumar","authorsParsed":[["Waheed","Yunus",""],["Shit","Sumitra",""],["Surendran","Jithin T",""],["Prasad","Indrajeet D",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Kumar","Santosh",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 12:55:49 GMT"}],"updateDate":"2024-12-16","timestamp":1734094549000,"abstract":"  Transition metal dichalcogenides and related layered materials in their\nmonolayer and a few layers thicknesses regime provide a promising\noptoelectronic platform for exploring the excitonic- and many-body physics.\nStrain engineering has emerged as a potent technique for tuning the excitonic\nproperties favorable for exciton-based devices. We have investigated the\neffects of nanoparticle-induced local strain on the optical properties of\nexciton, $X^0$, and trion, $X^\\text{-}$, in monolayer WS$_2$. Biaxial tensile\nstrain up to 2.0% was quantified and verified by monitoring the changes in\nthree prominent Raman modes of WS$_2$: E${^1_{2g}}$($\\Gamma$), A$_{1g}$, and\n2LA(M). We obtained a remarkable increase of 34 meV in $X^\\text{-}$ binding\nenergy with an average tuning rate of 17.5 $\\pm$ 2.5 meV/% strain across all\nthe samples irrespective of the surrounding dielectric environment of monolayer\nWS$_2$ and the sample preparation conditions. At the highest tensile strain of\n$\\approx$2%, we have achieved the largest binding energy $\\approx$100 meV for\n$X^\\text{-}$, leading to its enhanced emission intensity and thermal stability.\nBy investigating strain-induced linewidth broadening and deformation potentials\nof both $X^0$ and $X^\\text{-}$ emission, we elucidate that the increase in\n$X^\\text{-}$ binding energy is due to strain-enhanced electron-phonon coupling.\nThis work holds relevance for future $X^\\text{-}$-based\nnano-opto-electro-mechanical systems and devices.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QnMDpEVM2jn3og5PPAkrhls1VwuBG4ViWoR69suyAKI","pdfSize":"4482698"}