{
  "id": "2412.16588",
  "title": "Kernel Methods for the Approximation of the Eigenfunctions of the\n  Koopman Operator",
  "authors": "Jonghyeon Lee, Boumediene Hamzi, Boya Hou, Houman Owhadi, Gabriele\n  Santin, Umesh Vaidya",
  "authorsParsed": [
    [
      "Lee",
      "Jonghyeon",
      ""
    ],
    [
      "Hamzi",
      "Boumediene",
      ""
    ],
    [
      "Hou",
      "Boya",
      ""
    ],
    [
      "Owhadi",
      "Houman",
      ""
    ],
    [
      "Santin",
      "Gabriele",
      ""
    ],
    [
      "Vaidya",
      "Umesh",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 11:25:51 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734780351000,
  "abstract": "  The Koopman operator provides a linear framework to study nonlinear dynamical\nsystems. Its spectra offer valuable insights into system dynamics, but the\noperator can exhibit both discrete and continuous spectra, complicating direct\ncomputations. In this paper, we introduce a kernel-based method to construct\nthe principal eigenfunctions of the Koopman operator without explicitly\ncomputing the operator itself. These principal eigenfunctions are associated\nwith the equilibrium dynamics, and their eigenvalues match those of the\nlinearization of the nonlinear system at the equilibrium point. We exploit the\nstructure of the principal eigenfunctions by decomposing them into linear and\nnonlinear components. The linear part corresponds to the left eigenvector of\nthe system's linearization at the equilibrium, while the nonlinear part is\nobtained by solving a partial differential equation (PDE) using kernel methods.\nOur approach avoids common issues such as spectral pollution and spurious\neigenvalues, which can arise in previous methods. We demonstrate the\neffectiveness of our algorithm through numerical examples.\n",
  "subjects": [
    "Mathematics/Dynamical Systems",
    "Computer Science/Numerical Analysis",
    "Mathematics/Numerical Analysis",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "O6nW9WOIAPuxnGOOSswYXviYt2Nbu0yKUIPfHliDojo",
  "pdfSize": "662426"
}