{"id":"2412.05662","title":"Probing massive neutrinos and modified gravity with redshift-space\n  morphologies and anisotropies of large-scale structure","authors":"Wei Liu, Liang Wu, Francisco Villaescusa-Navarro, Marco Baldi,\n  Georgios Valogiannis, and Wenjuan Fang","authorsParsed":[["Liu","Wei",""],["Wu","Liang",""],["Villaescusa-Navarro","Francisco",""],["Baldi","Marco",""],["Valogiannis","Georgios",""],["Fang","Wenjuan",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 14:19:02 GMT"}],"updateDate":"2024-12-10","timestamp":1733581142000,"abstract":"  Strong degeneracy exists between some modified gravity (MG) models and\nmassive neutrinos because the enhanced structure growth produced by modified\ngravity can be suppressed due to the free-streaming massive neutrinos. Previous\nworks showed this degeneracy can be broken with non-Gaussian or velocity\ninformation. Therefore in this work, we focus on the large-scale structure\n(LSS) in redshift space and investigate for the first time the possibility of\nusing the non-Gaussian information and velocity information captured by the 3D\nscalar Minkowski functionals (MFs) and the 3D Minkowski tensors (MTs) to break\nthis degeneracy. Based on the Quijote and Quijote-MG simulations, we find the\nimprints on redshift space LSS left by the Hu-Sawicki $f(R)$ gravity can be\ndiscriminated from those left by massive neutrinos with these statistics. With\nthe Fisher information formalism, we first show how the MTs extract information\nwith their perpendicular and parallel elements for both low- and high-density\nregions; then we compare constraints from the power spectrum monopole and MFs\nin real space with those in redshift space, and investigate how the\nconstraining power is further improved with anisotropies captured by the\nquadrupole and hexadecapole of the power spectrum and the MTs; finally, we\ncombine the power spectrum multipoles with MFs plus MTs and find the\nconstraints from the power spectrum multipoles on $\\Omega_{\\mathrm{m}}, h,\n\\sigma_8$, $M_\\nu$, and $f_{R_0}$ can be improved, because they are\ncomplemented with non-Gaussian information, by a factor of 3.4, 3.0, 3.3, 3.3,\nand 1.9 on small scales ($k_{\\rm{max}}=0.5~h\\rm{Mpc}^{-1},\\\nR_G=5~h^{-1}\\rm{Mpc}$), and 2.8, 2.2, 3.4, 3.4, and 1.5 on large scales\n($k_{\\rm{max}}=0.25~h\\rm{Mpc}^{-1},\\ R_G=10~h^{-1}\\rm{Mpc}$).\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3pcvdwpqNrsiGZb5bIBBDxUJnaAfWi-om7_JYTXvAYo","pdfSize":"5488465"}