{
  "id": "2412.02442",
  "title": "The fabulous world of GKP codes",
  "authors": "Jonathan Conrad",
  "authorsParsed": [
    [
      "Conrad",
      "Jonathan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 13:27:37 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733232457000,
  "abstract": "  Quantum error correction is an essential ingredient in the development of\nquantum technologies. Its subject is to investigate ways to embed quantum\nHilbert spaces into a physical system such that this subspace is robust against\nsmall imperfections in the physical systems. This task is exceedingly complex:\nfor one, this is due to the vast diversity of possible physical systems with\ndifferent structure to use. For another, every physical setting also comes with\nits own imperfections that need to be protected against. Bred by the complexity\nof a technological ambition, research on quantum error correction has developed\ninto a large field of research that ranges from engineering of small systems\nwith a single photon to the creation of macroscopic topological phases of\nmatter and models of complex emergent physics. A quintessential tool in quantum\nerror correction is the stabilizer formalism, which tames quantum systems by\nenforcing symmetries. A Gottesman-Kitaev-Preskill (GKP) code is a stabilizer\ncode that creates a logical subspace within an infinite dimensional Hilbert\nspace by endowing it with translational symmetries. While in practice the\ninfinitude of the Hilbert space, as well as the infinitude of the translational\nsymmetry group are considered as obstacles for implementation, in theory these\nare precisely the features that make the theory of GKP codes particularly rich,\nwell behaved and well-connected to fascinating topics in mathematics. The\npurpose of this thesis is to explore these connections: to understand the\ncoding theoretic and practical properties of GKP codes, utilizing its rich\nmathematical foundation, and to provide a foundation for future research. Along\nthis journey we discover -- through the looking glass of GKP codes -- how\nquantum error correction fits into a fabulous mathematical world and formulate\na series of dreams about possible directions of research.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Physics/Mathematical Physics",
    "Mathematics/Mathematical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "XRggUP2VItj_GXmVerRZwPxfryayfDp6pnmED5f78Jc",
  "pdfSize": "8428795"
}