{
  "id": "2412.07576",
  "title": "Band Offsets at \\beta/{\\gamma}-$\\mathrm{Ga}_{2}\\mathrm{O}_{3}$ Interface",
  "authors": "Huan Liu, Ilja Makkonen, Calliope Bazioti, Junlei Zhao, Alexander\n  Azarov, Andrej Kuznetsov, Flyura Djurabekova",
  "authorsParsed": [
    [
      "Liu",
      "Huan",
      ""
    ],
    [
      "Makkonen",
      "Ilja",
      ""
    ],
    [
      "Bazioti",
      "Calliope",
      ""
    ],
    [
      "Zhao",
      "Junlei",
      ""
    ],
    [
      "Azarov",
      "Alexander",
      ""
    ],
    [
      "Kuznetsov",
      "Andrej",
      ""
    ],
    [
      "Djurabekova",
      "Flyura",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 15:10:17 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733843417000,
  "abstract": "  Ultrawide bandgap semiconductor gallium oxide (Ga2O3) and its polymorphs have\nrecently attracted increasing attention across physics, materials science, and\nelectronics communities. In particular, the self-organized formation of the\nbeta/gamma-Ga2O3 double polymorph structures was demonstrated recently [A.\nAzarov et al., Nat. Commun. 14, 4855 (2023)], paving the way for prospective\napplications of such structures in electronics. Consequently, determining the\nconduction band offset in such structures is crucial since it dictates the\nbehavior of conduction electrons at the interface and, consequently, the\npotential functionality of such interfaces. Thus, in this work, we calculate\nthe band offsets at the beta/gamma-Ga2O3 interface using density functional\ntheory in correlation with the data provided by the experimental atomistic\ninterface analysis. Specifically, to unravel the strain state of the\nbeta/gamma-Ga2O3 interface, nanoscale strain maps were recorded using\nhigh-resolution transmission electron microscopy. In its turn, theoretically,\nlineup potential and vacuum alignment methods were used to analyze the band\noffsets, with and without strain, at the beta/gamma-Ga2O3 interface.\nAltogether, the collected results suggest that the band offsets between the\nbeta and gamma phases are likely not exceeding a few hundred meV, remaining\nhighly sensitive to the strain state at the interface. At this end, we conclude\nthat even though the formation of a two-dimensional electron gas (2DEG) at the\nbeta/gamma interface is theoretically possible, the gradual strain\nrelaxation--if it occurs as a function of the distance from the\ninterface--poses a significant challenge, as it may shift the 2DEG localization\nor even reduce the overall probability of its formation.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "l7ix6TKdAKoYVABrSdKN_-mlTD53t_J9sToSo4ok41M",
  "pdfSize": "17864828"
}