{
  "id": "2412.12759",
  "title": "Versatile Ordering Network: An Attention-based Neural Network for\n  Ordering Across Scales and Quality Metrics",
  "authors": "Zehua Yu, Weihan Zhang, Sihan Pan, Jun Tao",
  "authorsParsed": [
    [
      "Yu",
      "Zehua",
      ""
    ],
    [
      "Zhang",
      "Weihan",
      ""
    ],
    [
      "Pan",
      "Sihan",
      ""
    ],
    [
      "Tao",
      "Jun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 10:24:29 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 18 Dec 2024 09:34:58 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734431069000,
  "abstract": "  Ordering has been extensively studied in many visualization applications,\nsuch as axis and matrix reordering, for the simple reason that the order will\ngreatly impact the perceived pattern of data. Many quality metrics concerning\ndata pattern, perception, and aesthetics are proposed, and respective\noptimization algorithms are developed. However, the optimization problems\nrelated to ordering are often difficult to solve (e.g., TSP is NP-complete),\nand developing specialized optimization algorithms is costly. In this paper, we\npropose Versatile Ordering Network (VON), which automatically learns the\nstrategy to order given a quality metric. VON uses the quality metric to\nevaluate its solutions, and leverages reinforcement learning with a greedy\nrollout baseline to improve itself. This keeps the metric transparent and\nallows VON to optimize over different metrics. Additionally, VON uses the\nattention mechanism to collect information across scales and reposition the\ndata points with respect to the current context. This allows VONs to deal with\ndata points following different distributions. We examine the effectiveness of\nVON under different usage scenarios and metrics. The results demonstrate that\nVON can produce comparable results to specialized solvers. The code is\navailable at https://github.com/sysuvis/VON.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "XYNO2MRYN8Gtr7Gtod0x8BFXqG5kSw4hPFz_PU5RKlQ",
  "pdfSize": "33822610"
}