{"id":"2412.03581","title":"A Survey on E-Commerce Learning to Rank","authors":"Md. Ahsanul Kabir, Mohammad Al Hasan, Aritra Mandal, Daniel Tunkelang,\n  Zhe Wu","authorsParsed":[["Kabir","Md. Ahsanul",""],["Hasan","Mohammad Al",""],["Mandal","Aritra",""],["Tunkelang","Daniel",""],["Wu","Zhe",""]],"versions":[{"version":"v1","created":"Tue, 19 Nov 2024 01:12:51 GMT"}],"updateDate":"2024-12-06","timestamp":1731978771000,"abstract":"  In e-commerce, ranking the search results based on users' preference is the\nmost important task. Commercial e-commerce platforms, such as, Amazon, Alibaba,\neBay, Walmart, etc. perform extensive and relentless research to perfect their\nsearch result ranking algorithms because the quality of ranking drives a user's\ndecision to purchase or not to purchase an item, directly affecting the\nprofitability of the e-commerce platform. In such a commercial platforms, for\noptimizing search result ranking numerous features are considered, which emerge\nfrom relevance, personalization, seller's reputation and paid promotion. To\nmaintain their competitive advantage in the market, the platforms do no publish\ntheir core ranking algorithms, so it is difficult to know which of the\nalgorithms or which of the features is the most effective for finding the most\noptimal search result ranking in e-commerce. No extensive surveys of ranking to\nrank in the e-commerce domain is also not yet published. In this work, we\nsurvey the existing e-commerce learning to rank algorithms. Besides, we also\ncompare these algorithms based on query relevance criterion on a large\nreal-life e-commerce dataset and provide a quantitative analysis. To the best\nof our knowledge this is the first such survey which include an experimental\ncomparison among various learning to rank algorithms.\n","subjects":["Computer Science/Information Retrieval","Computer Science/Artificial Intelligence","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Bn-ZbmvYYB28E6LvrP5wZwzsGKfMORnSMBzcN30gwAQ","pdfSize":"1195846"}