{
  "id": "2412.07732",
  "title": "Streamlined Swift Allocation Strategies for Radio Stripe Networks",
  "authors": "Filipe Concei\\c{c}\\~ao, Marco Gomes, Vitor Silva, Rui Dinis",
  "authorsParsed": [
    [
      "Conceição",
      "Filipe",
      ""
    ],
    [
      "Gomes",
      "Marco",
      ""
    ],
    [
      "Silva",
      "Vitor",
      ""
    ],
    [
      "Dinis",
      "Rui",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 18:30:02 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733855402000,
  "abstract": "  This paper proposes the use of an access point (AP) selection scheme to\nimprove the total uplink (UL) spectral efficiency (SE) of a radio stripe (RS)\nnetwork. This scheme optimizes the allocation matrix between the total number\nof APs' antennas and users' equipment (UEs) while considering two\nstate-of-the-art and two newly proposed equalization approaches: centralized\nmaximum ratio combining (CMRC), centralized optimal sequence linear processing\n(COSLP), sequential MRC (SMRC), and parallel MRC (PMRC). The optimization\nproblem is solved through a low-complexity and adaptive genetic algorithm (GA)\nwhich aims to output an efficient solution for the AP-UE association matrix. We\nevaluate the proposed schemes in several network scenarios in terms of SE\nperformance, convergence speed, computational complexity, and fronthaul\nsignalling capacity requirements. The COSLP exhibits the best SE performance at\nthe expense of high computational complexity and fronthaul signalling. The SMRC\nand PMRC are efficient solutions alternatives to the CMRC, improving its\ncomputational complexity and convergence speed. Additionally, we assess the\nadaptability of the MRC schemes for two different instances of network change:\nwhen a new randomly located UE must connect to the RS network and when a random\nUE is removed from it. We have found that in some cases, by reusing the\nallocation matrix from the original instance as an initial solution, the SMRC\nand/or the PMRC can significantly boost the optimization performance of the\nGA-based AP selection scheme.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "GercjJZSgE1M7cx2ph73KNKgHUJ-Ativjqm3ynzpWxU",
  "pdfSize": "8719636"
}