{"id":"2412.07083","title":"M87: a cosmic laboratory for deciphering black hole accretion and jet\n  formation","authors":"Kazuhiro Hada, Keiichi Asada, Masanori Nakamura and Motoki Kino","authorsParsed":[["Hada","Kazuhiro",""],["Asada","Keiichi",""],["Nakamura","Masanori",""],["Kino","Motoki",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 00:49:42 GMT"}],"updateDate":"2024-12-11","timestamp":1733791782000,"abstract":"  Over the past decades, there has been significant progress in our\nunderstanding of accreting supermassive black holes (SMBHs) that drive active\ngalactic nuclei (AGNs), both from observational and theoretical perspectives.\nAs an iconic target for this area of study, the nearby giant elliptical galaxy\nM87 has received special attention thanks to its proximity, large mass of the\ncentral black hole and bright emission across the entire electromagnetic\nspectrum from radio to very-high-energy gamma rays. In particular, recent\nglobal millimeter-very-long-baseline-interferometer observations towards this\nnucleus have provided the first-ever opportunity to image the\nevent-horizon-scale structure of an AGN, opening a new era of black hole\nastrophysics. On large scales, M87 exhibits a spectacular jet propagating far\nbeyond the host galaxy, maintaining its narrowly collimated shape over seven\norders of magnitude in distance. Elucidating the generation and propagation, as\nwell as the internal structure, of powerful relativistic jets remains a\nlongstanding challenge in radio-loud AGNs. M87 offers a privileged opportunity\nto examine such a jet with unprecedented detail. In this review, we provide a\ncomprehensive overview of the observational knowledge accumulated about the M87\nblack hole across various wavelengths. We cover both accretion and ejection\nprocesses at spatial scales ranging from outside the Bondi radius down to the\nevent horizon. By compiling these observations and relevant theoretical\nstudies, we aim to highlight our current understanding of accretion and jet\nphysics for this specific object.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gUPFPLR1dVG_QgHWsg4F76VUm6cNM39wLTz9SBOStSU","pdfSize":"13336433"}