{"id":"2412.17608","title":"Interplay between dressed and strong-axial-field states in\n  Nitrogen-Vacancy centers for quantum sensing and computation","authors":"G. Zanelli, E. Moreva, E. Bernardi, E. Losero, S. Ditalia Tchernij, J.\n  Forneris, \\v{Z}. Pastuovi\\'c, P. Traina, I. P. Degiovanni, M. Genovese","authorsParsed":[["Zanelli","G.",""],["Moreva","E.",""],["Bernardi","E.",""],["Losero","E.",""],["Tchernij","S. Ditalia",""],["Forneris","J.",""],["Pastuović","Ž.",""],["Traina","P.",""],["Degiovanni","I. P.",""],["Genovese","M.",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 14:28:19 GMT"},{"version":"v2","created":"Fri, 21 Feb 2025 16:15:10 GMT"}],"updateDate":"2025-02-24","timestamp":1734964099000,"abstract":"  The Nitrogen-Vacancy (NV) center in diamond is an intriguing electronic spin\nsystem with applications in quantum radiometry, sensing and computation. In\nthose experiments, a bias magnetic field is commonly applied along the NV\nsymmetry axis to eliminate the triplet ground state manifold's degeneracy\n(S=1). In this configuration, the eigenvectors of the NV spin's projection\nalong its axis are called strong-axial field states. Conversely, in some\nexperiments a weak magnetic field is applied orthogonal to the NV symmetry\naxis, leading to eigenstates that are balanced linear superpositions of\nstrong-axial field states, referred to as dressed states. The latter are\nsensitive to environmental magnetic noise at the second order, allowing to\nperform magnetic field protected measurements while providing increased\ncoherence times. However, if a small axial magnetic field is added in this\nregime, the linear superposition of strong-axial field states becomes\nunbalanced. This paper presents a comprehensive study of Free Induction Decay\n(FID) measurements performed on a NV center ensemble in the presence of strain\nand weak orthogonal magnetic field, as a function of a small magnetic field\napplied along the NV symmetry axis. The simultaneous detection of dressed\nstates and unbalanced superpositions of strong-axial field states in a single\nFID measurement is shown, gaining insight about coherence time, nuclear spin\nand the interplay between temperature and magnetic field sensitivity. The\ndiscussion concludes by describing how the simultaneous presence of\nmagnetically-sensitive and -insensitive states opens up appealing possibilities\nfor both sensing and quantum computation applications.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XGnZiNcY6EJB3bTEojJkAQhoECEaZpV8O6UG-Yb_R5M","pdfSize":"2623805"}