{
  "id": "2412.18848",
  "title": "Machine Learning-Based Detection of Pump-and-Dump Schemes in Real-Time",
  "authors": "Manuel Bolz, Kevin Br\\\"undler, Liam Kane, Panagiotis Patsias, Liam\n  Tessendorf, Krzysztof Gogol, Taehoon Kim, Claudio Tessone",
  "authorsParsed": [
    [
      "Bolz",
      "Manuel",
      ""
    ],
    [
      "Bründler",
      "Kevin",
      ""
    ],
    [
      "Kane",
      "Liam",
      ""
    ],
    [
      "Patsias",
      "Panagiotis",
      ""
    ],
    [
      "Tessendorf",
      "Liam",
      ""
    ],
    [
      "Gogol",
      "Krzysztof",
      ""
    ],
    [
      "Kim",
      "Taehoon",
      ""
    ],
    [
      "Tessone",
      "Claudio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 09:23:36 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735118616000,
  "abstract": "  Cryptocurrency markets often face manipulation through prevalent\npump-and-dump (P&D) schemes, where self-organized Telegram groups, some\nexceeding two million members, artificially inflate target cryptocurrency\nprices. These groups sell premium access to inside information, worsening\ninformation asymmetry and financial risks for subscribers and all investors.\nThis paper presents a real-time prediction pipeline to forecast target coins\nand alert investors to possible P&D schemes. In a Poloniex case study, the\nmodel accurately identified the target coin among the top five from 50 random\ncoins in 24 out of 43 (55.81%) P&D events. The pipeline uses advanced natural\nlanguage processing (NLP) to classify Telegram messages, identifying 2,079 past\npump events and detecting new ones in real-time. Our analysis also evaluates\nthe susceptibility of token standards - ERC-20, ERC-721, BRC-20, Inscriptions,\nand Runes - to manipulation and identifies exchanges commonly involved in P&D\nschemes.\n",
  "subjects": [
    "Computer Science/Computational Engineering, Finance, and Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "gadxspyjZqfMQ4nTjja2Vgeeb6Smyt_4dFvcyk3eKRc",
  "pdfSize": "1968859"
}