{
  "id": "2412.07429",
  "title": "Optimizing Alignment with Less: Leveraging Data Augmentation for\n  Personalized Evaluation",
  "authors": "Javad Seraj, Mohammad Mahdi Mohajeri, Mohammad Javad Dousti, Majid\n  Nili Ahmadabadi",
  "authorsParsed": [
    [
      "Seraj",
      "Javad",
      ""
    ],
    [
      "Mohajeri",
      "Mohammad Mahdi",
      ""
    ],
    [
      "Dousti",
      "Mohammad Javad",
      ""
    ],
    [
      "Ahmadabadi",
      "Majid Nili",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 11:40:11 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733830811000,
  "abstract": "  Automatic evaluation by large language models (LLMs) is a prominent topic\ntoday; however, judgment and evaluation tasks are often subjective and\ninfluenced by various factors, making adaptation challenging. While many\nstudies demonstrate the capabilities of state-of-the-art proprietary LLMs in\ncomparison to human evaluators, they often struggle to adapt to reference\nevaluators over time, a requirement for achieving personalized judgment.\nAdditionally, numerous works have attempted to apply open LLMs as judges or\nevaluators, but these efforts frequently overlook the limitations of working\nwith scarce data. Personalized judgment is inherently associated with limited\ndata scenarios, which are common in many real-world problems. Our work aims to\npresent a data augmentation technique to select a more effective sample from\nlimited data in order to align an open LLM with human preference. Our work\nachieves approximately 7% improvements in Pearson correlation with a reference\njudge over the baseline,and 30% improvement over the base model\n(Llama3.1-8B-Instruct) in the mathematical reasoning evaluation task.\ndemonstrating that augmenting selecting more effective preference data enables\nour approach to surpass baseline methods.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "524l9sIigwH1J-b_jFFSeLdwb-xJhbuyodiI4PYs1iM",
  "pdfSize": "2968071"
}