{
  "id": "2412.14872",
  "title": "Theoretical Proof that Generated Text in the Corpus Leads to the\n  Collapse of Auto-regressive Language Models",
  "authors": "Lecheng Wang, Xianjie Shi, Ge Li, Jia Li, Xuanming Zhang, Yihong Dong,\n  Wenpin Jiao, Hong Mei",
  "authorsParsed": [
    [
      "Wang",
      "Lecheng",
      ""
    ],
    [
      "Shi",
      "Xianjie",
      ""
    ],
    [
      "Li",
      "Ge",
      ""
    ],
    [
      "Li",
      "Jia",
      ""
    ],
    [
      "Zhang",
      "Xuanming",
      ""
    ],
    [
      "Dong",
      "Yihong",
      ""
    ],
    [
      "Jiao",
      "Wenpin",
      ""
    ],
    [
      "Mei",
      "Hong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 14:11:15 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 11 Feb 2025 12:25:11 GMT"
    }
  ],
  "updateDate": "2025-02-12",
  "timestamp": 1734617475000,
  "abstract": "  Auto-regressive language models (LMs) have been widely used to generate text\non the World Wide Web. The generated text is often collected into the training\ncorpus of the next generations of LMs. Previous work experimentally found that\nLMs collapse when trained on recursively generated text. This paper presents\ntheoretical proof that once a corpus (such as the World Wide Web) begins to\nincorporate generated text, and the training text of each LM is sampled from\nthis corpus, then no matter how small the amount of text generated by each LM\nthat enters the corpus is, after a sufficient amount of time, LM collapse is\nbound to occur. Our proof is validated by a series of experiments showing that\nthe collapsed LMs perform no better than an untrained LM with randomly\ninitialized parameters. By proving the existence of LM collapse, we express our\nconcerns about the current situation in which an increasing amount of generated\ntext may be used in LM training. The source code is available in the online\ndata warehouse: https://github.com/wanglc02/generated-data\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "jM1_1gG3z5Wu1ba_23TtcqAvqT3-Bl-L0GG7RsWWM7s",
  "pdfSize": "1708411"
}