{
  "id": "2412.10385",
  "title": "Contextual Combinatorial Beam Management via Online Probing for Multiple\n  Access mmWave Wireless Networks",
  "authors": "Zhizhen Li, Xuanhao Luo, Mingzhe Chen, Chenhan Xu, Shiwen Mao, Yuchen\n  Liu",
  "authorsParsed": [
    [
      "Li",
      "Zhizhen",
      ""
    ],
    [
      "Luo",
      "Xuanhao",
      ""
    ],
    [
      "Chen",
      "Mingzhe",
      ""
    ],
    [
      "Xu",
      "Chenhan",
      ""
    ],
    [
      "Mao",
      "Shiwen",
      ""
    ],
    [
      "Liu",
      "Yuchen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 29 Nov 2024 02:58:23 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1732849103000,
  "abstract": "  Due to the exponential increase in wireless devices and a diversification of\nnetwork services, unprecedented challenges, such as managing heterogeneous data\ntraffic and massive access demands, have arisen in next-generation wireless\nnetworks. To address these challenges, there is a pressing need for the\nevolution of multiple access schemes with advanced transceivers.\nMillimeter-wave (mmWave) communication emerges as a promising solution by\noffering substantial bandwidth and accommodating massive connectivities.\nNevertheless, the inherent signaling directionality and susceptibility to\nblockages pose significant challenges for deploying multiple transceivers with\nnarrow antenna beams. Consequently, beam management becomes imperative for\npractical network implementations to identify and track the optimal transceiver\nbeam pairs, ensuring maximum received power and maintaining high-quality access\nservice. In this context, we propose a Contextual Combinatorial Beam Management\n(CCBM) framework tailored for mmWave wireless networks. By leveraging advanced\nonline probing techniques and integrating predicted contextual information,\nsuch as dynamic link qualities in spatial-temporal domain, CCBM aims to jointly\noptimize transceiver pairing and beam selection while balancing the network\nload. This approach not only facilitates multiple access effectively but also\nenhances bandwidth utilization and reduces computational overheads for\nreal-time applications. Theoretical analysis establishes the asymptotically\noptimality of the proposed approach, complemented by extensive evaluation\nresults showcasing the superiority of our framework over other state-of-the-art\nschemes in multiple dimensions.\n",
  "subjects": [
    "Computer Science/Networking and Internet Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-esHVMQNE4bfEHAsQzqVzX3sX2VCBTUqQWpxZXV1ZFg",
  "pdfSize": "3041643"
}