{
  "id": "2412.02889",
  "title": "Deep-Learning Based Docking Methods: Fair Comparisons to Conventional\n  Docking Workflows",
  "authors": "Ajay N. Jain, Ann E. Cleves, W. Patrick Walters",
  "authorsParsed": [
    [
      "Jain",
      "Ajay N.",
      ""
    ],
    [
      "Cleves",
      "Ann E.",
      ""
    ],
    [
      "Walters",
      "W. Patrick",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 22:47:47 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 9 Dec 2024 18:37:17 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733266067000,
  "abstract": "  The diffusion learning method, DiffDock, for docking small-molecule ligands\ninto protein binding sites was recently introduced. Results included\ncomparisons to more conventional docking approaches, with DiffDock showing\nsuperior performance. Here, we employ a fully automatic workflow using the\nSurflex-Dock methods to generate a fair baseline for conventional docking\napproaches. Results were generated for the common and expected situation where\na binding site location is known and also for the condition of an unknown\nbinding site. For the known binding site condition, Surflex-Dock success rates\nat 2.0 Angstroms RMSD far exceeded those for DiffDock (Top-1/Top-5 success\nrates, respectively, were 68/81% compared with 45/51%). Glide performed with\nsimilar success rates (67/73%) to Surflex-Dock for the known binding site\ncondition, and results for AutoDock Vina and Gnina followed this pattern. For\nthe unknown binding site condition, using an automated method to identify\nmultiple binding pockets, Surflex-Dock success rates again exceeded those of\nDiffDock, but by a somewhat lesser margin. DiffDock made use of roughly 17,000\nco-crystal structures for learning (98% of PDBBind version 2020, pre-2019\nstructures) for a training set in order to predict on 363 test cases (2% of\nPDBBind 2020) from 2019 forward. DiffDock's performance was inextricably linked\nwith the presence of near-neighbor cases of close to identical protein-ligand\ncomplexes in the training set for over half of the test set cases. DiffDock\nexhibited a 40 percentage point difference on near-neighbor cases (two-thirds\nof all test cases) compared with cases with no near-neighbor training case.\nDiffDock has apparently encoded a type of table-lookup during its learning\nprocess, rendering meaningful applications beyond its reach. Further, it does\nnot perform even close to competitively with a competently run modern docking\nworkflow.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Quantitative Biology/Biomolecules"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "QNiI-OSI-vIVyzt5_Fcx3NxNyjinsKDIYAAM1E74Yos",
  "pdfSize": "1497963"
}