{
  "id": "2412.11203",
  "title": "Task-Oriented Dialog Systems for the Senegalese Wolof Language",
  "authors": "Derguene Mbaye and Moussa Diallo",
  "authorsParsed": [
    [
      "Mbaye",
      "Derguene",
      ""
    ],
    [
      "Diallo",
      "Moussa",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 14:35:49 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734273349000,
  "abstract": "  In recent years, we are seeing considerable interest in conversational agents\nwith the rise of large language models (LLMs). Although they offer considerable\nadvantages, LLMs also present significant risks, such as hallucination, which\nhinder their widespread deployment in industry. Moreover, low-resource\nlanguages such as African ones are still underrepresented in these systems\nlimiting their performance in these languages. In this paper, we illustrate a\nmore classical approach based on modular architectures of Task-oriented Dialog\nSystems (ToDS) offering better control over outputs. We propose a chatbot\ngeneration engine based on the Rasa framework and a robust methodology for\nprojecting annotations onto the Wolof language using an in-house machine\ntranslation system. After evaluating a generated chatbot trained on the Amazon\nMassive dataset, our Wolof Intent Classifier performs similarly to the one\nobtained for French, which is a resource-rich language. We also show that this\napproach is extensible to other low-resource languages, thanks to the intent\nclassifier's language-agnostic pipeline, simplifying the design of chatbots in\nthese languages.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "_PgbPvBEV7CxvS9UjsfWCBUgy1myGfbMw1ILxzd7o2g",
  "pdfSize": "768042"
}