{
  "id": "2412.17512",
  "title": "BEE: Metric-Adapted Explanations via Baseline Exploration-Exploitation",
  "authors": "Oren Barkan, Yehonatan Elisha, Jonathan Weill, Noam Koenigstein",
  "authorsParsed": [
    [
      "Barkan",
      "Oren",
      ""
    ],
    [
      "Elisha",
      "Yehonatan",
      ""
    ],
    [
      "Weill",
      "Jonathan",
      ""
    ],
    [
      "Koenigstein",
      "Noam",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 12:19:03 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734956343000,
  "abstract": "  Two prominent challenges in explainability research involve 1) the nuanced\nevaluation of explanations and 2) the modeling of missing information through\nbaseline representations. The existing literature introduces diverse evaluation\nmetrics, each scrutinizing the quality of explanations through distinct lenses.\nAdditionally, various baseline representations have been proposed, each\nmodeling the notion of missingness differently. Yet, a consensus on the\nultimate evaluation metric and baseline representation remains elusive. This\nwork acknowledges the diversity in explanation metrics and baselines,\ndemonstrating that different metrics exhibit preferences for distinct\nexplanation maps resulting from the utilization of different baseline\nrepresentations and distributions. To address the diversity in metrics and\naccommodate the variety of baseline representations in a unified manner, we\npropose Baseline Exploration-Exploitation (BEE) - a path-integration method\nthat introduces randomness to the integration process by modeling the baseline\nas a learned random tensor. This tensor follows a learned mixture of baseline\ndistributions optimized through a contextual exploration-exploitation procedure\nto enhance performance on the specific metric of interest. By resampling the\nbaseline from the learned distribution, BEE generates a comprehensive set of\nexplanation maps, facilitating the selection of the best-performing explanation\nmap in this broad set for the given metric. Extensive evaluations across\nvarious model architectures showcase the superior performance of BEE in\ncomparison to state-of-the-art explanation methods on a variety of objective\nevaluation metrics.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "N1r8S0iml1ZgszCQVCA2dz7WbtrHj18QkG8jJ4QeoTM",
  "pdfSize": "5402273"
}