{
  "id": "2412.06816",
  "title": "Autonomy in the Real-World: Autonomous Trajectory Planning for Asteroid\n  Reconnaissance via Stochastic Optimization",
  "authors": "Kazuya Echigo, Abhishek Cauligi, Saptarshi Bandyopadhyay, Dan Scharf,\n  Gregory Lantoine, Beh\\c{c}et A\\c{c}{\\i}kme\\c{s}e, Issa Nesnas",
  "authorsParsed": [
    [
      "Echigo",
      "Kazuya",
      ""
    ],
    [
      "Cauligi",
      "Abhishek",
      ""
    ],
    [
      "Bandyopadhyay",
      "Saptarshi",
      ""
    ],
    [
      "Scharf",
      "Dan",
      ""
    ],
    [
      "Lantoine",
      "Gregory",
      ""
    ],
    [
      "Açıkmeşe",
      "Behçet",
      ""
    ],
    [
      "Nesnas",
      "Issa",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 00:52:14 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733187134000,
  "abstract": "  This paper presents the development and evaluation of an optimization-based\nautonomous trajectory planning algorithm for the asteroid reconnaissance phase\nof a deep-space exploration mission. The reconnaissance phase is a low-altitude\nflyby to collect detailed information around a potential landing site. Although\nsuch autonomous deep-space exploration missions have garnered considerable\ninterest recently, state-of-the-practice in trajectory design involves a\ntime-intensive ground-based open-loop process that forward propagates multiple\ntrajectories with a range of initial conditions and parameters to account for\nuncertainties in spacecraft knowledge and actuation. In this work, we introduce\na stochastic trajectory optimization-based approach to generate trajectories\nthat satisfy both the mission and spacecraft safety constraints during the\nreconnaissance phase of the Deep-space Autonomous Robotic Explorer (DARE)\nmission concept, which seeks to travel to and explore a near-Earth object\nautonomously, with minimal ground intervention. We first use the\nMulti-Spacecraft Concept and Autonomy Tool (MuSCAT) simulation framework to\nrigorously validate the underlying modeling assumptions for our trajectory\nplanner and then propose a method to transform this stochastic optimal control\nproblem into a deterministic one tailored for use with an off-the-shelf\nnonlinear solver. Finally, we demonstrate the efficacy of our proposed\nalgorithmic approach through extensive numerical experiments and show that it\noutperforms the state-of-the-practice benchmark used for representative\nmissions.\n",
  "subjects": [
    "Physics/Space Physics",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control",
    "Mathematics/Optimization and Control",
    "Mathematics/Statistics Theory",
    "Statistics/Statistics Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "lmzR6V2sXE6SoOa1t2N2oIc-cpy7mduUDPk5DRmvuYg",
  "pdfSize": "4193310"
}