{"id":"2412.17056","title":"The HalluRAG Dataset: Detecting Closed-Domain Hallucinations in RAG\n  Applications Using an LLM's Internal States","authors":"Fabian Ridder and Malte Schilling","authorsParsed":[["Ridder","Fabian",""],["Schilling","Malte",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 15:08:24 GMT"}],"updateDate":"2024-12-24","timestamp":1734880104000,"abstract":"  Detecting hallucinations in large language models (LLMs) is critical for\nenhancing their reliability and trustworthiness. Most research focuses on\nhallucinations as deviations from information seen during training. However,\nthe opaque nature of an LLM's parametric knowledge complicates the\nunderstanding of why generated texts appear ungrounded: The LLM might not have\npicked up the necessary knowledge from large and often inaccessible datasets,\nor the information might have been changed or contradicted during further\ntraining. Our focus is on hallucinations involving information not used in\ntraining, which we determine by using recency to ensure the information emerged\nafter a cut-off date. This study investigates these hallucinations by detecting\nthem at sentence level using different internal states of various LLMs. We\npresent HalluRAG, a dataset designed to train classifiers on these\nhallucinations. Depending on the model and quantization, MLPs trained on\nHalluRAG detect hallucinations with test accuracies ranging up to 75 %, with\nMistral-7B-Instruct-v0.1 achieving the highest test accuracies. Our results\nshow that IAVs detect hallucinations as effectively as CEVs and reveal that\nanswerable and unanswerable prompts are encoded differently as separate\nclassifiers for these categories improved accuracy. However, HalluRAG showed\nsome limited generalizability, advocating for more diversity in datasets on\nhallucinations.\n","subjects":["Computer Science/Computation and Language","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"nplUC2gxk3GWOKZ0RX-IxfFNvqU9D0u9YejwZQvdWGQ","pdfSize":"816246"}