{
  "id": "2412.19298",
  "title": "Transformation of the trapped flux in a SC disc under electromagnetic\n  exposure",
  "authors": "V. V. Chabanenko, I. Abaloszewa, V. F. Rusakov, O. I. Kuchuk, O. M.\n  Chumak, A. Nabia{\\l}ek, A. Abaloszew, A. Filippov, R. Pu\\'zniak",
  "authorsParsed": [
    [
      "Chabanenko",
      "V. V.",
      ""
    ],
    [
      "Abaloszewa",
      "I.",
      ""
    ],
    [
      "Rusakov",
      "V. F.",
      ""
    ],
    [
      "Kuchuk",
      "O. I.",
      ""
    ],
    [
      "Chumak",
      "O. M.",
      ""
    ],
    [
      "Nabiałek",
      "A.",
      ""
    ],
    [
      "Abaloszew",
      "A.",
      ""
    ],
    [
      "Filippov",
      "A.",
      ""
    ],
    [
      "Puźniak",
      "R.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 17:45:19 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735235119000,
  "abstract": "  Superconducting permanent magnets (SCs) with trapped magnetic flux are used\nin technical devices (motors, generators, etc.). These magnets endure repeated\nmagnetic \"shocks\" during operation, which can affect their performance. In this\nwork, we investigated the dynamic behavior of magnetic induction in the trapped\nflux in an SC disk when exposed to stepwise changes in the external magnetic\nfield, simulating these operational shocks. Our results reveal a direct\ncorrelation between the stepwise changes in the magnetic field and the trapped\nflux response, with each increase or decrease in the field inducing a\ncorresponding 40-50% change in trapped flux for a 600 G field step at\ntemperature of 5 K. The magnitude of these changes depends on the external\nparameters and their dynamics could lead to additional energy dissipation and\npotential heating, which may affect the reliability of SC magnets in\napplications. A scaling analysis of the induction flux profiles, revealing\nroughness exponents in the range of 0.435 to 0.475 was performed as well, and\nwe determined the Hausdorff dimension of the surface structure.\n",
  "subjects": [
    "Condensed Matter/Superconductivity"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "OjZQM6D7hPaf9RkbJi0xGl3qzu_TMfbC8VgNi0lP2yI",
  "pdfSize": "2901179"
}