{"id":"2412.02485","title":"Controlling the interaction of tightly focused 10-PW class lasers with\n  multicomponent plasma via target parameters: optimization of\n  electron-positron pair and $\\gamma$-photon sources","authors":"A. V. Bashinov, E. S. Efimenko, A. A. Muraviev, E. A. Panova, V. D.\n  Volokitin, I. B. Meyerov, A. V. Kim","authorsParsed":[["Bashinov","A. V.",""],["Efimenko","E. S.",""],["Muraviev","A. A.",""],["Panova","E. A.",""],["Volokitin","V. D.",""],["Meyerov","I. B.",""],["Kim","A. V.",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 14:48:15 GMT"}],"updateDate":"2024-12-04","timestamp":1733237295000,"abstract":"  The interaction of multipetawatt lasers with plasma is a complex\nmultiparameter problem, providing a wide field for fundamental research and\nopening up great opportunities for creating unique sources of high-energy\nelectrons and positrons, dense pair plasma, and $\\gamma$-photons. However, to\nachieve high efficiency of such a source, it is necessary to use targets with\noptimized parameters, primarily density and size, for the given laser\nparameters. With the use of 3D QED-PIC modeling it is shown that, when targets\nwhose size is comparable with the laser wavelength are irradiated by laser\nbeams with a total power of several tens of PW, the total initial number of\ntarget electrons may be regarded to be the similarity parameter of laser-plasma\ninteraction. In practice, this can significantly simplify the selection of the\ntargets needed for controlling the interaction and, accordingly, for achieving\nthe specified parameters of the developed electron-positron plasma and\n$\\gamma$-photon sources. Based on the similarity parameter, various\nlaser-plasma interaction modes are identified, the necessary conditions for\ntheir launch are determined, and the properties of the pair particle and\n$\\gamma$-photon source are revealed. Moreover, qualitative estimates of the\nquantitative and energy characteristics of such a source are obtained, allowing\nit to be optimized for various laser beam configurations.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"UmsJ6SYHNwwefaXWrv3J1Wv-BR_CiFdY3DsAAV-uzxk","pdfSize":"2374935"}