{
  "id": "2412.20134",
  "title": "Primary scalar hair in Gauss-Bonnet black holes with Thurston horizons",
  "authors": "Luis Guajardo and Julio Oliva",
  "authorsParsed": [
    [
      "Guajardo",
      "Luis",
      ""
    ],
    [
      "Oliva",
      "Julio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 12:42:36 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 28 Jan 2025 17:10:47 GMT"
    }
  ],
  "updateDate": "2025-01-29",
  "timestamp": 1735389756000,
  "abstract": "  In this work, we construct novel asymptotically locally AdS$_5$ black hole\nsolutions of Einstein-Gauss-Bonnet theory at the Chern-Simons point, supported\nby a scalar field that generates primary hair. The strength of the scalar field\nis governed by an independent integration constant; when this constant\nvanishes, the spacetime reduces to a black hole geometry devoid of hair. The\nexistence of these solutions is intrinsically tied to the horizon metric, which\nis modeled by three non-trivial Thurston geometries: Nil, Solv, and\n$SL(2,\\mathbb{R})$. The quadratic part of the scalar field action corresponds\nto a conformally coupled scalar in five dimensions -an invariance of the matter\nsector that is explicitly broken by the introduction of a quartic\nself-interaction. These black holes are characterized by two distinct\nparameters: the horizon radius and the temperature. Notably, there exists a\nstraight line in this parameter space along which the horizon geometry exhibits\nenhanced isometries, corresponding to solutions previously reported in JHEP 02,\n014 (2014). Away from this line, for a fixed horizon radius and temperatures\nabove or below a critical value, the metric's isometries undergo spontaneous\nbreaking. Employing the Regge-Teitelboim approach, we compute the mass and\nentropy of these solutions, both of which vanish. Despite this, only one of the\nintegration constants can be interpreted as hair, as the other modifies the\nlocal geometry at the conformal boundary. Finally, for Solv horizon geometries,\nwe extend these hairy solutions to six dimensions.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory",
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ZPTmLeLs0fxps_8-r62NUOvf2gJwFL7iDqUY_SaIJS8",
  "pdfSize": "181921"
}