{
  "id": "2412.09118",
  "title": "An Algorithm-Centered Approach To Model Streaming Data",
  "authors": "Fabian Hinder, Valerie Vaquet, David Komnick, Barbara Hammer",
  "authorsParsed": [
    [
      "Hinder",
      "Fabian",
      ""
    ],
    [
      "Vaquet",
      "Valerie",
      ""
    ],
    [
      "Komnick",
      "David",
      ""
    ],
    [
      "Hammer",
      "Barbara",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 09:52:37 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733997157000,
  "abstract": "  Besides the classical offline setup of machine learning, stream learning\nconstitutes a well-established setup where data arrives over time in\npotentially non-stationary environments. Concept drift, the phenomenon that the\nunderlying distribution changes over time poses a significant challenge. Yet,\ndespite high practical relevance, there is little to no foundational theory for\nlearning in the drifting setup comparable to classical statistical learning\ntheory in the offline setting. This can be attributed to the lack of an\nunderlying object comparable to a probability distribution as in the classical\nsetup. While there exist approaches to transfer ideas to the streaming setup,\nthese start from a data perspective rather than an algorithmic one. In this\nwork, we suggest a new model of data over time that is aimed at the algorithm's\nperspective. Instead of defining the setup using time points, we utilize a\nwindow-based approach that resembles the inner workings of most stream learning\nalgorithms. We compare our framework to others from the literature on a\ntheoretical basis, showing that in many cases both model the same situation.\nFurthermore, we perform a numerical evaluation and showcase an application in\nthe domain of critical infrastructure.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "P4hhYZvZVVBUfx3g4F2lKgdQE7KAIjJ8bQyALi1fmy8",
  "pdfSize": "787539"
}