{"id":"2412.09395","title":"Radial evolution of a density structure within a solar wind magnetic\n  sector boundary","authors":"Etienne Berriot, Pascal D\\'emoulin, Olga Alexandrova, Arnaud\n  Zaslavsky, Milan Maksimovic, and Georgios Nicolaou","authorsParsed":[["Berriot","Etienne",""],["Démoulin","Pascal",""],["Alexandrova","Olga",""],["Zaslavsky","Arnaud",""],["Maksimovic","Milan",""],["Nicolaou","Georgios",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 16:00:12 GMT"},{"version":"v2","created":"Thu, 6 Feb 2025 09:34:03 GMT"}],"updateDate":"2025-02-07","timestamp":1734019212000,"abstract":"  This study focuses on a radial alignment between Parker Solar Probe (PSP) and\nSolar Orbiter (SolO) on the 29$^{\\text{th}}$ of April 2021 (during a solar\nminimum), when the two spacecraft were respectively located at $\\sim 0.075$ and\n$\\sim 0.9$~au from the Sun. A previous study of this alignment allowed the\nidentification of the same density enhancement (with a time scale of\n$\\sim$1.5~h), and substructures ($\\sim$20-30~min timescale), passing first by\nPSP, and then SolO after a $\\sim 138$~h propagation time in the inner\nheliosphere. We show here that this structure belongs to the large scale\nheliospheric magnetic sector boundary. In this region, the density is dominated\nby radial gradients, whereas the magnetic field reversal is consistent with\nlongitudinal gradients in the Carrington reference frame. We estimate the\ndensity structure radial size to remain of the order L$_R \\sim 10^6$~km, while\nits longitudinal and latitudinal sizes, are estimated to expand from\nL$_{\\varphi, \\theta} \\sim 10^4$-$10^5$~km in the high solar corona, to\nL$_{\\varphi, \\theta} \\sim 10^5$-$10^6$~km at PSP, and L$_{\\varphi, \\theta} \\sim\n10^6$-$10^7$~km at SolO. This implies a strong evolution of the structure's\naspect ratio during the propagation, due to the plasma's nearly spherical\nexpansion. The structure's shape is therefore inferred to evolve from elongated\nin the radial direction at $\\sim$2-3 solar radii (high corona), to sizes of\nnearly the same order in all directions at PSP, and then becoming elongated in\nthe directions transverse to the radial at SolO. Measurements are not\nconcordant with local reconnection of open solar wind field lines, so we\npropose that the structure has been generated through interchange reconnection\nnear the tip of a coronal streamer.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ujvIti0GeZv3I_ymCTjy8mJsPz9tKpjttq1Mee1MPKQ","pdfSize":"5440047"}