{
  "id": "2412.13120",
  "title": "Empirical Analysis of Pull Requests for Google Summer of Code",
  "authors": "Saheed Popoola",
  "authorsParsed": [
    [
      "Popoola",
      "Saheed",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 17:42:43 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 14 Jan 2025 18:55:03 GMT"
    }
  ],
  "updateDate": "2025-01-15",
  "timestamp": 1734457363000,
  "abstract": "  Internship and industry-affiliated capstone projects are popular ways to\nexpose students to real world experiences and bridge the gap between academic\ntraining and industry requirements. However, these two approaches often require\nactive industry collaboration, and many students struggle to find industry\nplacements. Open-source contributions are a crucial alternative to gain real\nworld experience, earn publicly verifiable contribution with real-world impact,\nand learn from experienced open-source contributors. The Google Summer of Code\n(GSoC) is a global initiative that matches students or new contributors with\nexperienced mentors to work on open-source projects. The program aims to\nintroduce the students to open-source development, help them gain valuable\nskills under the guidance of mentors, and hopefully encourage them to continue\ncontributing to open-source projects. The realization of the program objectives\nwill provide a continuous pool of talented new contributors necessary for\nmaintaining open-source projects. This study presents an empirical analysis of\npull requests created by interns during the GSoC program. We extracted and\nanalyzed 17,232 pull requests from 2,456 interns across 1,937 open-source\nprojects. The results show most tasks involve both code-intensive activities\nlike adding new features and fixing bugs, as well as non-code tasks like\nupdating documentation and restructuring the codebase. Feedback from reviewers\ncovers code functionality and programming logic, testing coverage, error\nhandling, code readability, and adherence to best practices. Finally, we\ndiscuss the implications of these results for software engineering education.\n",
  "subjects": [
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "EfKJ-1cuTvhYZBdORK2Cc3wPXjhGXAsBI2zIKLHjyww",
  "pdfSize": "238510"
}