{"id":"2412.09832","title":"Multivariate Time Series Clustering for Environmental State\n  Characterization of Ground-Based Gravitational-Wave Detectors","authors":"Rutuja Gurav, Isaac Kelly, Pooyan Goodarzi, Anamaria Effler, Barry\n  Barish, Evangelos Papalexakis, Jonathan Richardson","authorsParsed":[["Gurav","Rutuja",""],["Kelly","Isaac",""],["Goodarzi","Pooyan",""],["Effler","Anamaria",""],["Barish","Barry",""],["Papalexakis","Evangelos",""],["Richardson","Jonathan",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 03:51:39 GMT"}],"updateDate":"2024-12-16","timestamp":1734061899000,"abstract":"  Gravitational-wave observatories like LIGO are large-scale, terrestrial\ninstruments housed in infrastructure that spans a multi-kilometer geographic\narea and which must be actively controlled to maintain operational stability\nfor long observation periods. Despite exquisite seismic isolation, they remain\nsusceptible to seismic noise and other terrestrial disturbances that can couple\nundesirable vibrations into the instrumental infrastructure, potentially\nleading to control instabilities or noise artifacts in the detector output. It\nis, therefore, critical to characterize the seismic state of these\nobservatories to identify a set of temporal patterns that can inform the\ndetector operators in day-to-day monitoring and diagnostics. On a day-to-day\nbasis, the operators monitor several seismically relevant data streams to\ndiagnose operational instabilities and sources of noise using some simple\nempirically-determined thresholds. It can be untenable for a human operator to\nmonitor multiple data streams in this manual fashion and thus a distillation of\nthese data-streams into a more human-friendly format is sought. In this paper,\nwe present an end-to-end machine learning pipeline for features-based\nmultivariate time series clustering to achieve this goal and to provide\nactionable insights to the detector operators by correlating found clusters\nwith events of interest in the detector.\n","subjects":["Computer Science/Machine Learning","Astrophysics/Instrumentation and Methods for Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"YUGR4prd7SiaZNAQIv1s7DXG32SYC_JMHE6qLvabf2E","pdfSize":"3970304"}