{
  "id": "2412.07783",
  "title": "Swin fMRI Transformer Predicts Early Neurodevelopmental Outcomes from\n  Neonatal fMRI",
  "authors": "Patrick Styll, Dowon Kim and Jiook Cha",
  "authorsParsed": [
    [
      "Styll",
      "Patrick",
      ""
    ],
    [
      "Kim",
      "Dowon",
      ""
    ],
    [
      "Cha",
      "Jiook",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 25 Nov 2024 12:20:07 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 12 Jan 2025 15:18:16 GMT"
    },
    {
      "version": "v3",
      "created": "Thu, 30 Jan 2025 10:33:33 GMT"
    }
  ],
  "updateDate": "2025-01-31",
  "timestamp": 1732537207000,
  "abstract": "  Brain development in the first few months of human life is a critical phase\ncharacterized by rapid structural growth and functional organization.\nAccurately predicting developmental outcomes during this time is crucial for\nidentifying delays and enabling timely interventions. This study introduces the\nSwiFT (Swin 4D fMRI Transformer) model, designed to predict Bayley-III\ncomposite scores using neonatal fMRI from the Developing Human Connectome\nProject (dHCP). To enhance predictive accuracy, we apply dimensionality\nreduction via group independent component analysis (ICA) and pretrain SwiFT on\nlarge adult fMRI datasets to address the challenges of limited neonatal data.\nOur analysis shows that SwiFT significantly outperforms baseline models in\npredicting cognitive, motor, and language outcomes, leveraging both\nsingle-label and multi-label prediction strategies. The model's attention-based\narchitecture processes spatiotemporal data end-to-end, delivering superior\npredictive performance. Additionally, we use Integrated Gradients with\nSmoothgrad sQuare (IG-SQ) to interpret predictions, identifying neural spatial\nrepresentations linked to early cognitive and behavioral development. These\nfindings underscore the potential of Transformer models to advance\nneurodevelopmental research and clinical practice.\n",
  "subjects": [
    "Quantitative Biology/Neurons and Cognition",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "niCioPy6xvo8mOh9GfQEw42X36baSND8cMm-yZHTRWI",
  "pdfSize": "1963499"
}