{"id":"2412.12188","title":"Predicting Internet Connectivity in Schools: A Feasibility Study\n  Leveraging Multi-modal Data and Location Encoders in Low-Resource Settings","authors":"Kelsey Doerksen and Casper Fibaek and Rochelle Schneider and Do-Hyung\n  Kim and Isabelle Tingzon","authorsParsed":[["Doerksen","Kelsey",""],["Fibaek","Casper",""],["Schneider","Rochelle",""],["Kim","Do-Hyung",""],["Tingzon","Isabelle",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 20:20:29 GMT"}],"updateDate":"2024-12-18","timestamp":1734121229000,"abstract":"  Internet connectivity in schools is critical to provide students with the\ndigital literary skills necessary to compete in modern economies. In order for\ngovernments to effectively implement digital infrastructure development in\nschools, accurate internet connectivity information is required. However,\ntraditional survey-based methods can exceed the financial and capacity limits\nof governments. Open-source Earth Observation (EO) datasets have unlocked our\nability to observe and understand socio-economic conditions on Earth from\nspace, and in combination with Machine Learning (ML), can provide the tools to\ncircumvent costly ground-based survey methods to support infrastructure\ndevelopment. In this paper, we present our work on school internet connectivity\nprediction using EO and ML. We detail the creation of our multi-modal,\nfreely-available satellite imagery and survey information dataset, leverage the\nlatest geographically-aware location encoders, and introduce the first results\nof using the new European Space Agency phi-lab geographically-aware\nfoundational model to predict internet connectivity in Botswana and Rwanda. We\nfind that ML with EO and ground-based auxiliary data yields the best\nperformance in both countries, for accuracy, F1 score, and False Positive\nrates, and highlight the challenges of internet connectivity prediction from\nspace with a case study in Kigali, Rwanda. Our work showcases a practical\napproach to support data-driven digital infrastructure development in\nlow-resource settings, leveraging freely available information, and provide\ncleaned and labelled datasets for future studies to the community through a\nunique collaboration between UNICEF and the European Space Agency phi-lab.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Artificial Intelligence","Computer Science/Computer Vision and Pattern Recognition","Computer Science/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cxMnrEBoMW-g4R8bJsva_j12qQaZbXehGR1y8WtpFdw","pdfSize":"13909023"}