{"id":"2412.08174","title":"Can Graph Neural Networks Learn Language with Extremely Weak Text\n  Supervision?","authors":"Zihao Li, Lecheng Zheng, Bowen Jin, Dongqi Fu, Baoyu Jing, Yikun Ban,\n  Jingrui He, Jiawei Han","authorsParsed":[["Li","Zihao",""],["Zheng","Lecheng",""],["Jin","Bowen",""],["Fu","Dongqi",""],["Jing","Baoyu",""],["Ban","Yikun",""],["He","Jingrui",""],["Han","Jiawei",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 08:03:35 GMT"},{"version":"v2","created":"Sun, 15 Dec 2024 20:54:47 GMT"}],"updateDate":"2024-12-17","timestamp":1733904215000,"abstract":"  While great success has been achieved in building vision models with\nContrastive Language-Image Pre-training (CLIP) over Internet-scale image-text\npairs, building transferable Graph Neural Networks (GNNs) with CLIP pipeline is\nchallenging because of three fundamental issues: the scarcity of labeled data\nand text supervision, different levels of downstream tasks, and the conceptual\ngaps between domains. In this work, to address these issues, we leverage\nmulti-modal prompt learning to effectively adapt pre-trained GNN to downstream\ntasks and data, given only a few semantically labeled samples, each with\nextremely weak text supervision. Our new paradigm embeds the graphs directly in\nthe same space as the Large Language Models (LLMs) by learning both graph\nprompts and text prompts simultaneously. To accomplish this, we improve\nstate-of-the-art graph prompt method, and then propose the first graph-language\nmulti-modal prompt learning approach for exploiting the knowledge in\npre-trained models. Notably, due to the insufficient supervision for\nfine-tuning, in our paradigm, the pre-trained GNN and the LLM are kept frozen,\nso the learnable parameters are much fewer than fine-tuning any pre-trained\nmodel. Through extensive experiments on real-world datasets, we demonstrate the\nsuperior performance of our paradigm in few-shot, multi-task-level, and\ncross-domain settings. Moreover, we build the first CLIP-style zero-shot\nclassification prototype that can generalize GNNs to unseen classes with\nextremely weak text supervision.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"_bBfQcysSAbhHpkdPc992setVwchC48T9Npwu8tu-Gk","pdfSize":"3109430"}