{
  "id": "2412.01029",
  "title": "Deep Learning Based Near-Field User Localization with Beam Squint in\n  Wideband XL-MIMO Systems",
  "authors": "Hao Lei, Jiayi Zhang, Huahua Xiao, Derrick Wing Kwan Ng, and Bo Ai",
  "authorsParsed": [
    [
      "Lei",
      "Hao",
      ""
    ],
    [
      "Zhang",
      "Jiayi",
      ""
    ],
    [
      "Xiao",
      "Huahua",
      ""
    ],
    [
      "Ng",
      "Derrick Wing Kwan",
      ""
    ],
    [
      "Ai",
      "Bo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 01:22:59 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733102579000,
  "abstract": "  Extremely large-scale multiple-input multiple-output (XL-MIMO) is gaining\nattention as a prominent technology for enabling the sixth-generation (6G)\nwireless networks. However, the vast antenna array and the huge bandwidth\nintroduce a non-negligible beam squint effect, causing beams of different\nfrequencies to focus at different locations. One approach to cope with this is\nto employ true-time-delay lines (TTDs)-based beamforming to control the range\nand trajectory of near-field beam squint, known as the near-field controllable\nbeam squint (CBS) effect. In this paper, we investigate the user localization\nin near-field wideband XL-MIMO systems under the beam squint effect and spatial\nnon-stationary properties. Firstly, we derive the expressions for Cram\\'er-Rao\nBounds (CRBs) for characterizing the performance of estimating both angle and\ndistance. This analysis aims to assess the potential of leveraging CBS for\nprecise user localization. Secondly, a user localization scheme combining CBS\nand beam training is proposed. Specifically, we organize multiple subcarriers\ninto groups, directing beams from different groups to distinct angles or\ndistances through the CBS to obtain the estimates of users' angles and\ndistances. Furthermore, we design a user localization scheme based on a\nconvolutional neural network model, namely ConvNeXt. This scheme utilizes the\ninputs and outputs of the CBS-based scheme to generate high-precision estimates\nof angle and distance. More importantly, our proposed ConvNeXt-based user\nlocalization scheme achieves centimeter-level accuracy in localization\nestimates.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing",
    "Computer Science/Information Theory",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "1AhFZXr54Txn_MhekG1KH6nw4agppqJoX46jyPKu9fY",
  "pdfSize": "2183337"
}