{"id":"2412.06740","title":"Convolution goes higher-order: a biologically inspired mechanism\n  empowers image classification","authors":"Simone Azeglio, Olivier Marre, Peter Neri, Ulisse Ferrari","authorsParsed":[["Azeglio","Simone",""],["Marre","Olivier",""],["Neri","Peter",""],["Ferrari","Ulisse",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 18:33:09 GMT"}],"updateDate":"2024-12-10","timestamp":1733769189000,"abstract":"  We propose a novel approach to image classification inspired by complex\nnonlinear biological visual processing, whereby classical convolutional neural\nnetworks (CNNs) are equipped with learnable higher-order convolutions. Our\nmodel incorporates a Volterra-like expansion of the convolution operator,\ncapturing multiplicative interactions akin to those observed in early and\nadvanced stages of biological visual processing. We evaluated this approach on\nsynthetic datasets by measuring sensitivity to testing higher-order\ncorrelations and performance in standard benchmarks (MNIST, FashionMNIST,\nCIFAR10, CIFAR100 and Imagenette). Our architecture outperforms traditional CNN\nbaselines, and achieves optimal performance with expansions up to 3rd/4th\norder, aligning remarkably well with the distribution of pixel intensities in\nnatural images. Through systematic perturbation analysis, we validate this\nalignment by isolating the contributions of specific image statistics to model\nperformance, demonstrating how different orders of convolution process distinct\naspects of visual information. Furthermore, Representational Similarity\nAnalysis reveals distinct geometries across network layers, indicating\nqualitatively different modes of visual information processing. Our work\nbridges neuroscience and deep learning, offering a path towards more effective,\nbiologically inspired computer vision models. It provides insights into visual\ninformation processing and lays the groundwork for neural networks that better\ncapture complex visual patterns, particularly in resource-constrained\nscenarios.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Sd77OvnNmWLLAyiHsDKawiHJpSyRA2yGeItGqniJDLA","pdfSize":"13464294"}