{
  "id": "2412.13301",
  "title": "Dark Matter Escaping Direct Detection Runs into Higgs Mass Hierarchy\n  Problem",
  "authors": "Praveen Bharadwaj, Ranjeet Kumar, Hemant Kumar Prajapati, Rahul\n  Srivastava, Sushant Yadav",
  "authorsParsed": [
    [
      "Bharadwaj",
      "Praveen",
      ""
    ],
    [
      "Kumar",
      "Ranjeet",
      ""
    ],
    [
      "Prajapati",
      "Hemant Kumar",
      ""
    ],
    [
      "Srivastava",
      "Rahul",
      ""
    ],
    [
      "Yadav",
      "Sushant",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 20:04:31 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734465871000,
  "abstract": "  The current generation of Dark Matter Direct Detection Experiments has ruled\nout a large region of parameter space for dark matter, particularly in the ($10\n- 1000$) GeV mass range. However, due to very low event rates, searching for\ndark matter in the heavy mass range, $\\mathcal{O}$(TeV), is a daunting task\nrequiring even larger volume detectors and long exposure times. We show that\nfor a broad class of dark matter models of the type that these experiments are\nsearching, including some of the most popular candidates, the heavy dark matter\nmass range can be ruled out in its entirety once we take into account the large\ncorrections to Higgs mass imparted by such heavy dark matter. We show that such\na limit is applicable to all types of dark matter i.e. scalar, vector, and\nfermionic, provided they couple directly with Higgs. By taking some simple and\nwell studied dark matter models we show that the latest LZ limits can\ncompletely rule out such a dark matter except in a narrow range around $M_h/2$\nmass.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology",
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Physics/High Energy Physics - Experiment"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "CGTUtq5fhn9dMR5p3Fm1KzWPb72VhS16lghPA2v1MO0",
  "pdfSize": "3419833"
}