{"id":"2412.08708","title":"SLOW IV: Not all that is Close will Merge in the End. Superclusters and\n  their Lagrangian collapse regions","authors":"B. A. Seidel, K. Dolag, R.-S. Remus, J. G. Sorce, E.\n  Hern\\'andez-Mart\\'inez, I. Khabibullin, N. Aghanim","authorsParsed":[["Seidel","B. A.",""],["Dolag","K.",""],["Remus","R. -S.",""],["Sorce","J. G.",""],["Hernández-Martínez","E.",""],["Khabibullin","I.",""],["Aghanim","N.",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 19:00:01 GMT"}],"updateDate":"2024-12-13","timestamp":1733943601000,"abstract":"  Superclusters are the most massive structures in the universe. To what degree\nthey are actually bound against an accelerating expansion of the background is\nof significant cosmological and astrophysical interest. In this study, we\nintroduce a cross matched set of superclusters from the SLOW constrained\nsimulations of the local (z<0.05) universe. Identifying the superclusters\nprovides estimates on the efficacy of the constraints in reproducing the local\nlarge-scale structure accurately. The simulated counterparts can help\nidentifying possible future observational targets containing interesting\nfeatures such as bridges between pre-merging and merging galaxy clusters and\ncollapsing filaments and provide comparisons for current observations. By\ndetermining the collapse volumes for the superclusters we further elucidate the\ndynamics of cluster-cluster interactions in those regions. Using catalogs of\nlocal superclusters and the most massive simulated clusters, we search for\ncounterparts of supercluster members of six regions. We evaluate the\nsignificance of these detections by comparing their geometries to supercluster\nregions in random simulations. We then run an N-body version of the simulation\ninto the far future and determine which of the member clusters are\ngravitationally bound to the host superclusters. Furthermore we compute masses\nand density contrasts for the collapse regions. We demonstrate the SLOW\nsimulation of the local universe to accurately reproduce local supercluster\nregions in mass of their members and three-dimensional geometrical arrangement.\nWe furthermore find the bound regions of the local superclusters consistent in\nsize and density contrast with previous theoretical studies. This will allow to\nconnect future numerical zoom-in studies of the clusters to the large scale\nenvironments and specifically the supercluster environments these local galaxy\nclusters evolve in.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"6pIuDgtgRkXF-1ylH7mbIjssVOcbAnJcn78a0hr5ccc","pdfSize":"23386616"}