{
  "id": "2412.06648",
  "title": "Resolved convection in hydrogen-rich atmospheres",
  "authors": "Jacob T. Seeley and Robin D. Wordsworth",
  "authorsParsed": [
    [
      "Seeley",
      "Jacob T.",
      ""
    ],
    [
      "Wordsworth",
      "Robin D.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 16:41:13 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733762473000,
  "abstract": "  In hydrogen-rich atmospheres with low mean molecular weight (MMW), an air\nparcel containing a higher-molecular-weight condensible can be negatively\nbuoyant even if its temperature is higher than the surrounding environment.\nThis should fundamentally alter the dynamics of moist convection, but the\nlow-MMW regime has previously been explored primarily via one-dimensional\ntheories that cannot capture the complexity of moist turbulence. Here, we use a\nthree-dimensional cloud-resolving model to simulate moist convection in\natmospheres with a wide range of background MMW, and confirm that a humidity\nthreshold for buoyancy reversal first derived by Guillot (1995) coincides with\nan abrupt change in tropospheric structure. Crossing the \"Guillot threshold\" in\nnear-surface humidity causes the dry (subcloud) boundary layer to collapse and\nbe replaced by a very cloudy layer with a temperature lapse rate that exceeds\nthe dry adiabatic rate. Simulations with reduced surface moisture availability\nin the lower atmosphere feature a deeper dry subcloud layer, which allows the\nsuperadiabatic cloud layer to remain aloft. Our simulations support a\npotentially observable systematic trend toward increased cloudiness for\natmospheres with near-surface moisture concentrations above the Guillot\nthreshold. This should apply to \\ce{H2O} and potentially to other condensible\nspecies on hotter worlds. We also find evidence for episodic convective\nactivity and associated variability in cloud cover in some of our low-MMW\nsimulations, which should be investigated further with global-scale\nsimulations.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "M3G8c-TCUmvh62oB_mNko19s6LiiCMJpCrC4iVBwNt8",
  "pdfSize": "1438566"
}