{"id":"2412.15328","title":"Deep view of the intracluster light in the Coma cluster of galaxies","authors":"Yolanda Jim\\'enez-Teja, Javier Rom\\'an, Kim HyeongHan, Jose M.\n  V\\'ilchez, Renato A. Dupke, Paulo Afr\\^anio Augusto Lopes, Robert Michael\n  Rich, Osmin Caceres, and Chester Li","authorsParsed":[["Jiménez-Teja","Yolanda",""],["Román","Javier",""],["HyeongHan","Kim",""],["Vílchez","Jose M.",""],["Dupke","Renato A.",""],["Lopes","Paulo Afrânio Augusto",""],["Rich","Robert Michael",""],["Caceres","Osmin",""],["Li","Chester",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 19:00:02 GMT"}],"updateDate":"2025-02-19","timestamp":1734634802000,"abstract":"  Detection and study of the intracluster light in rich clusters of galaxies\nhas been a problem of long standing challenge and interest. Using the lowest\nsurface brightness images of the Coma cluster of galaxies in the g and r bands,\nfrom the Halos and Environment of Nearby Galaxies (HERON) Coma Cluster Project,\nwe obtained the most extensive image of intracluster light (ICL) in a single\ncluster to date, spreading over 1.5 Mpc from the cluster core. The\nunprecedented wealth of spectroscopic data made publicly available by the Dark\nEnergy Spectroscopic Instrument (DESI) Early Data Release, complemented with a\ncompilation from the NASA/IPAC Extragalactic Database and the literature,\nenabled the identification of 2,157 galaxy members within Coma, from which 42\ndistinct groups were identified. The synergy between these high-quality data\nallowed us to: 1) calculate ICL fractions of $19.9\\pm0.5$\\% and $19.6\\pm0.6$\\%\nin the g and r bands, respectively, consistent with a dynamically active\ncluster, 2) unveil Coma's faintest tidal features, and 3) provide a\ncomprehensive picture of the dynamics and interactions within this complex\nsystem. Our findings indicate that the ICL connects several of these groups in\na filamentous network, from which we infer the ongoing dynamical processes. In\nparticular, we identified a faint stellar bridge linking the core of Coma with\nthe galaxy NGC 4839, providing compelling evidence that this galaxy has already\ntraversed the central region of the cluster.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ZUmSu3MLxv7Lnf2NGzBOnnnUz589b4IL4myjGxsW250","pdfSize":"13471526"}