{"id":"2412.04040","title":"The physical and chemical structure of Sagittarius B2, VIII. Full\n  molecular line survey of hot cores","authors":"T. M\\\"oller, P. Schilke, \\'A. S\\'anchez-Monge, A. Schmiedeke","authorsParsed":[["Möller","T.",""],["Schilke","P.",""],["Sánchez-Monge","Á.",""],["Schmiedeke","A.",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 10:28:19 GMT"},{"version":"v2","created":"Mon, 23 Dec 2024 11:08:44 GMT"}],"updateDate":"2025-01-15","timestamp":1733394499000,"abstract":"  The giant molecular cloud complex Sagittarius B2 (Sgr~B2) in the central\nmolecular zone of our Galaxy hosts several high-mass star formation sites, with\nSgr~B2(M) and Sgr~B2(N) being the main centers of activity. This analysis aims\nto comprehensively model each core spectrum, considering molecular lines, dust\nattenuation, and free-free emission interactions. We describe the molecular\ncontent analysis of each hot core and identify the chemical composition of\ndetected sources. Using ALMA's high sensitivity, we aim to characterize the hot\ncore population in Sgr~B2(M) and N, gaining a better understanding of the\ndifferent evolutionary phases of star formation processes in this complex. We\nconducted an unbiased ALMA spectral line survey of 47 sources in band 6\n(211-275 GHz). Chemical composition and column densities were derived using\nXCLASS, assuming local thermodynamic equilibrium. Quantitative descriptions for\neach molecule were determined, considering all emission and absorption features\nacross the spectral range. Temperature and velocity distributions were\nanalyzed, and derived abundances were compared with other spectral line\nsurveys. We identified 65 isotopologs from 41 different molecules, ranging from\nlight molecules to complex organic compounds, originating from various\nenvironments. Most sources in the Sgr~B2 complex were assigned different\nevolutionary phases of high-mass star formation. Sgr~B2(N) hot cores show more\ncomplex molecules such as CH$_3$OH, CH$_3$OCHO, and CH$_3$OCH$_3$, while M\ncores contain lighter molecules such as SO$_2$, SO, and NO. Some sulfur-bearing\nmolecules are more abundant in N than in M. The derived molecular abundances\ncan be used for comparison and to constrain astrochemical models. Inner sources\nin both regions were generally more developed than outer sources, with some\nexceptions.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"70_qjb576ElIFW0rnuRbkIx0Ddu7V6oVW-N4IUY5SKQ","pdfSize":"21167170"}