{"id":"2412.07789","title":"Dynamic data summarization for hierarchical spatial clustering","authors":"Kayumov Abduaziz, Min Sik Kim, Ji Sun Shin","authorsParsed":[["Abduaziz","Kayumov",""],["Kim","Min Sik",""],["Shin","Ji Sun",""]],"versions":[{"version":"v1","created":"Tue, 26 Nov 2024 06:36:43 GMT"}],"updateDate":"2024-12-12","timestamp":1732603003000,"abstract":"  Hierarchical Density-Based Spatial Clustering of Applications with Noise\n(HDBSCAN) finds meaningful patterns in spatial data by considering density and\nspatial proximity. As the clustering algorithm is inherently designed for\nstatic applications, so have recent studies focused on accelerating the\nalgorithm for static applications using approximate or parallel methods.\nHowever, much less attention has been given to dynamic environments, where even\na single point insertion or deletion can require recomputing the clustering\nhierarchy from scratch due to the need of maintaining the minimum spanning tree\n(MST) over a complete graph. This paper addresses the challenge of enhancing\nthe clustering algorithm for dynamic data. We present an exact algorithm that\nmaintains density information and updates the clustering hierarchy of HDBSCAN\nduring point insertions and deletions. Considering the hardness of adapting the\nexact algorithm to dynamic data involving modern workloads, we propose an\nonline-offline framework. The online component efficiently summarizes dynamic\ndata using a tree structure, called Bubble-tree, while the offline step\nperforms the static clustering. Experimental results demonstrate that the data\nsummarization adapts well to fully dynamic environments, providing compression\nquality on par with existing techniques while significantly improving runtime\nperformance of the clustering algorithm in dynamic data workloads.\n","subjects":["Computer Science/Databases","Computer Science/Data Structures and Algorithms","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"aF2OKdr6fUEDGPO0gSZBAi6DGJpsOS1MCl1sGWpfliY","pdfSize":"4158032"}