{
  "id": "2412.10192",
  "title": "From CO$_2$- to H$_2$O-dominated atmospheres and back -- How mixed\n  outgassing changes the volatile distribution in magma oceans around M dwarf\n  stars",
  "authors": "Ludmila Carone, Rory Barnes, Lena Noack, Katy L. Chubb, Patrick Barth,\n  Bertram Bitsch, Alexander Thamm, Alexander Balduin, Rodolfo Garcia and\n  Christiane Helling",
  "authorsParsed": [
    [
      "Carone",
      "Ludmila",
      ""
    ],
    [
      "Barnes",
      "Rory",
      ""
    ],
    [
      "Noack",
      "Lena",
      ""
    ],
    [
      "Chubb",
      "Katy L.",
      ""
    ],
    [
      "Barth",
      "Patrick",
      ""
    ],
    [
      "Bitsch",
      "Bertram",
      ""
    ],
    [
      "Thamm",
      "Alexander",
      ""
    ],
    [
      "Balduin",
      "Alexander",
      ""
    ],
    [
      "Garcia",
      "Rodolfo",
      ""
    ],
    [
      "Helling",
      "Christiane",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 15:03:11 GMT"
    }
  ],
  "updateDate": "2025-01-29",
  "timestamp": 1734102191000,
  "abstract": "  We investigate the impact of CO$_2$ on TRAPPIST-1 e, f and g during the magma\nocean stage. These potentially habitable rocky planets are currently the most\naccessible for astronomical observations. A constraint on the volatile budget\nduring the magma ocean stage is a link to planet formation and also needed to\njudge their habitability. We perform simulations with 1-100 terrestrial oceans\n(TO) of H$_2$O with and without CO$_2$ and for albedos 0 and 0.75. The CO$_2$\nmass is scaled with initial H$_2$O by a constant factor between 0.1 and 1.\n  The magma ocean state of rocky planets begins with a CO$_2$-dominated\natmosphere but can evolve into a H$_2$O dominated state, depending on initial\nconditions. For less than 10 TO initial H$_2$O, the atmosphere tends to\ndesiccate and the evolution may end with a CO$_2$ dominated atmosphere.\nOtherwise, the final state is a thick (>1000 bar) H$_2$O-CO$_2$ atmosphere.\nComplete atmosphere desiccation with less than 10 TO initial H$_2$O can be\nsignificantly delayed for TRAPPIST-1e and f, when H$_2$O has to diffuse through\na CO$_2$ atmosphere to reach the upper atmosphere, where XUV photolysis occurs.\nAs a consequence of CO$_2$ diffusion-limited water loss, the time of mantle\nsolidification for TRAPPIST-1 e, f, and g can be significantly extended\ncompared to a pure H$_2$O evolution by up to 40 Myrs for albedo 0.75 and by up\nto 200 Mrys for albedo 0. The addition of CO$_2$ further results in a higher\nwater content in the melt during the magma ocean stage. Our compositional model\nadjusted for the measured metallicity of TRAPPIST-1 yields for the dry inner\nplanets (b, c, d) an iron fraction of 27 wt-%. For TRAPPIST-1 e, this iron\nfraction would be compatible with a (partly) desiccated evolution scenario and\na CO$_2$ atmosphere with surface pressures of a few 100 bar. A comparative\nstudy between TRAPPIST-1 e and the inner planets may yield the most insights\nabout formation and evolution scenarios.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "-0HxZTIcw1EW4Lb9KE3xPQhgh7rvmZWgchIi6CdKtYA",
  "pdfSize": "4004690"
}