{"id":"2412.14207","title":"A Comprehensive Review on Traffic Datasets and Simulators for Autonomous\n  Vehicles","authors":"Supriya Sarker, Brent Maples, and Weizi Li","authorsParsed":[["Sarker","Supriya",""],["Maples","Brent",""],["Li","Weizi",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 07:43:23 GMT"}],"updateDate":"2024-12-20","timestamp":1734421403000,"abstract":"  Autonomous driving has rapidly developed and shown promising performance due\nto recent advances in hardware and deep learning techniques. High-quality\ndatasets are fundamental for developing reliable autonomous driving algorithms.\nPrevious dataset surveys either focused on a limited number or lacked detailed\ninvestigation of dataset characteristics. Besides, we analyze the annotation\nprocesses, existing labeling tools, and the annotation quality of datasets,\nshowing the importance of establishing a standard annotation pipeline. On the\nother hand, we thoroughly analyze the impact of geographical and adversarial\nenvironmental conditions on the performance of autonomous driving systems.\nMoreover, we exhibit the data distribution of several vital datasets and\ndiscuss their pros and cons accordingly.\n  Additionally, this paper provides a comprehensive analysis of publicly\navailable traffic simulators. In addition to informing about traffic datasets,\nit is also the goal of this paper to provide context and information on the\ncurrent capabilities of traffic simulators for their specific contributions to\nautonomous vehicle simulation and development. Furthermore, this paper\ndiscusses future directions and the increasing importance of synthetic data\ngeneration in simulators to enhance the training and creation of effective\nsimulations. Finally, we discuss the current challenges and the development\ntrend of future autonomous driving datasets.\n","subjects":["Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9I6NdPX8Ykl2F8XfmkYOLVpu0PKZVkg4Eje0El5X86s","pdfSize":"968885"}