{"id":"2412.02006","title":"Unveiling Interpretability in Self-Supervised Speech Representations for\n  Parkinson's Diagnosis","authors":"David Gimeno-G\\'omez and Catarina Botelho and Anna Pompili and Alberto\n  Abad and Carlos-D. Mart\\'inez-Hinarejos","authorsParsed":[["Gimeno-Gómez","David",""],["Botelho","Catarina",""],["Pompili","Anna",""],["Abad","Alberto",""],["Martínez-Hinarejos","Carlos-D.",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 22:23:43 GMT"},{"version":"v2","created":"Mon, 10 Feb 2025 13:25:26 GMT"}],"updateDate":"2025-02-11","timestamp":1733178223000,"abstract":"  Recent works in pathological speech analysis have increasingly relied on\npowerful self-supervised speech representations, leading to promising results.\nHowever, the complex, black-box nature of these embeddings and the limited\nresearch on their interpretability significantly restrict their adoption for\nclinical diagnosis. To address this gap, we propose a novel, interpretable\nframework specifically designed to support Parkinson's Disease (PD) diagnosis.\nThrough the design of simple yet effective cross-attention mechanisms for both\nembedding- and temporal-level analysis, the proposed framework offers\ninterpretability from two distinct but complementary perspectives. Experimental\nfindings across five well-established speech benchmarks for PD detection\ndemonstrate the framework's capability to identify meaningful speech patterns\nwithin self-supervised representations for a wide range of assessment tasks.\nFine-grained temporal analyses further underscore its potential to enhance the\ninterpretability of deep-learning pathological speech models, paving the way\nfor the development of more transparent, trustworthy, and clinically applicable\ncomputer-assisted diagnosis systems in this domain. Moreover, in terms of\nclassification accuracy, our method achieves results competitive with\nstate-of-the-art approaches, while also demonstrating robustness in\ncross-lingual scenarios when applied to spontaneous speech production.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ACaUlFNxrdE-pR49uE_vknzNIcy3ZX44eDtULfVnUO4","pdfSize":"1966509"}