{
  "id": "2412.00935",
  "title": "Structured light and induced vorticity in superconductors II: Quantum\n  Print with Laguerre-Gaussian beam",
  "authors": "Tien-Tien Yeh, Hennadii Yerzhakov, Logan Bishop-Van Horn, Srinivas\n  Raghu, Alexander Balatsky",
  "authorsParsed": [
    [
      "Yeh",
      "Tien-Tien",
      ""
    ],
    [
      "Yerzhakov",
      "Hennadii",
      ""
    ],
    [
      "Horn",
      "Logan Bishop-Van",
      ""
    ],
    [
      "Raghu",
      "Srinivas",
      ""
    ],
    [
      "Balatsky",
      "Alexander",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 19:00:03 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 6 Jan 2025 01:44:00 GMT"
    }
  ],
  "updateDate": "2025-01-07",
  "timestamp": 1733079603000,
  "abstract": "  Challenge to control the quantum states of matter via light have been at the\nforefront of modern research on driven quantum matter. We explore the\nimprinting effects of structured light on superconductors, demonstrating how\nthe quantum numbers of light-specifically spin angular momentum, orbital\nangular momentum, and radial order-can be transferred to the superconducting\norder parameter and control vortex dynamics. Using Laguerre-Gaussian beams, we\nshow that by tuning the quantum numbers and the amplitude of the electric\nfield, it is possible to manipulate a variety of vortex behaviors, including\nbreathing vortex pairs, braiding vortex pairs, vortex droplets, supervortices,\nand swirling 2D vortex rings. More complex structure of vortex-clusters, such\nas vortex-flake structures, and standing wave motions, also emerge under\nspecific quantum numbers. These results demonstrate the ability to control SC\nvortex motion and phase structures through structured light, offering potential\napplications in quantum fluids and optical control of superconducting states.\nOur findings present a diagram that links light's quantum numbers to the\nresulting SC vortex behaviors, highlighting the capacity of light to transfer\nits symmetry onto superconducting condensates. We point that this approach\nrepresents the extension of the printing to quantum printing by light in a\ncoherent state of electrons.\n",
  "subjects": [
    "Condensed Matter/Superconductivity"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "TOOUcqNk1koj0k5rZk9y0w2xLaEuQnIFGKaZ4SxY2b0",
  "pdfSize": "22041066"
}