{
  "id": "2412.03628",
  "title": "Effect of Simulated Space Conditions on functional Connectivity",
  "authors": "Parshuram N Aarotale, Jaydip Desai",
  "authorsParsed": [
    [
      "Aarotale",
      "Parshuram N",
      ""
    ],
    [
      "Desai",
      "Jaydip",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 17:23:45 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733333025000,
  "abstract": "  Long duration spaceflight missions can affect the cognitive and behavioral\nactivities of astronauts due to changes in gravity. The microgravity\nsignificantly impacts the central nervous system physiology which causes the\ndegradation in the performance and lead to potential risk in the space\nexploration. The aim of this study was to evaluate functional connectivity at\nsimulated space conditions using an unloading harness system to mimic the\nbody-weight distribution related to Earth, Mars, and International Space\nStation. A unity model with six directional arrows to imagine six different\nmotor imagery tasks associated with arms and legs were designed for the Oculus\nRift S virtual reality headset for testing. An Electroencephalogram (EEG) and\nfunctional near infrared spectroscopy (fNIRS) signals were recorded from 10\nparticipants in the distributed weight conditions related to Earth, Mars, and\nInternational Space station using the g.Nautilus fNIRS system at sampling rate\nof 500 Hz. The magnitude squared coherence were estimated from left vs right\nhemisphere of the brain that represents functional connectivity. The EEG\ncoherence was the higher which shows the strong functional connectivity and\nfNIRS coherence was lower shows weak functional connectivity between left vs\nright hemisphere of the brain, during all the tasks and trials irrespective of\nthe simulated space conditions. Further analysis of functional connectivity\nneeded between the intra-regions of the brain.\n",
  "subjects": [
    "Quantitative Biology/Neurons and Cognition",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "1LN9WGko7VQELa7X5OMWQm_YtIOnZSzHcbeZ4cJbRkU",
  "pdfSize": "843673"
}