{"id":"2412.00012","title":"The Femininomenon of Inequality: A Data-Driven Analysis and Cluster\n  Profiling in Indonesia","authors":"J. S. Muthmaina","authorsParsed":[["Muthmaina","J. S.",""]],"versions":[{"version":"v1","created":"Wed, 13 Nov 2024 23:45:58 GMT"}],"updateDate":"2024-12-03","timestamp":1731541558000,"abstract":"  This study addresses the persistent challenges of Workplace Gender Equality\n(WGE) in Indonesia, examining regional disparities in gender empowerment and\ninequality through the Gender Empowerment Index (IDG) and Gender Inequality\nIndex (IKG). Despite Indonesia's economic growth and incremental progress in\ngender equality, as indicated by improvements in the IDG and IKG scores from\n2018 to 2023, substantial regional differences remain. Utilizing k-means\nclustering, the study identifies two distinct clusters of regions with\ncontrasting gender profiles. Cluster 0 includes regions like DKI Jakarta and\nCentral Java, characterized by higher gender empowerment and lower inequality,\nwhile Cluster 1 comprises areas such as Papua and North Maluku, where gender\ndisparities are more pronounced. The analysis reveals that local socio-economic\nconditions and governance frameworks play a critical role in shaping regional\ngender dynamics. Correlation analyses further demonstrate that higher\nempowerment is generally associated with lower inequality and greater female\nrepresentation in professional roles. These findings underscore the importance\nof targeted, region-specific interventions to promote WGE, addressing both\nstructural and cultural barriers. The insights provided by this study aim to\nguide policymakers in developing tailored strategies to foster gender equality\nand enhance women's participation in the workforce across Indonesia's diverse\nregions.\n","subjects":["Computer Science/Computers and Society","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Un4jDwLwPDKdSsARbssvUd70FRJ2bfaR6uskI8FQf5I","pdfSize":"2631484"}