{"id":"2412.03549","title":"Quantifying the Critical Micelle Concentration of Nonionic and Ionic\n  Surfactants by Self-Consistent Field Theory","authors":"Chao Duan, Mu Wang, Ahmad Ghobadi, David M. Eike, Rui Wang","authorsParsed":[["Duan","Chao",""],["Wang","Mu",""],["Ghobadi","Ahmad",""],["Eike","David M.",""],["Wang","Rui",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 18:47:10 GMT"}],"updateDate":"2024-12-05","timestamp":1733338030000,"abstract":"  Quantifying the critical micelle concentration (CMC) and understanding its\nrelationship with both the intrinsic molecular structures and environmental\nconditions are crucial for the rational design of surfactants. Here, we develop\na self-consistent field theory which unifies the study of CMC, micellar\nstructure and kinetic pathway of micellization in one framework. The long-range\nelectrostatic interactions are accurately treated, which not only makes the\ntheory applicable to both nonionic and ionic surfactants but also enables us to\ncapture a variety of salt effects. The effectiveness and versatility of the\ntheory is verified by applying it to three types of commonly used surfactants.\nFor polyoxyethylene alkyl ethers (C$_m$E$_n$) surfactants, we predict a wide\nspan of CMC from $10^{-6}$ to $10^{-2}$M as the composition parameters $m$ and\n$n$ are adjusted. For the ionic sodium dodecyl sulfate (SDS) surfactant, we\nshow the decrease of CMC as salt concentration increases, and capture both the\nspecific cation effect and the specific anion effect. Furthermore, for sodium\nlauryl ether sulfate (SLES) surfactants, we find a non-monotonic dependence of\nboth the CMC and micelle size on the number of oxyethylene groups. Our\ntheoretical predictions of CMC are in quantitative agreement with experimental\ndata reported in literature for all the three types of surfactants.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Statistical Mechanics","Physics/Chemical Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hQoZv0VAOzbEdoqWLRcZYJhviGTDdtGqu1RIJYQ-pN8","pdfSize":"2312342"}