{"id":"2412.03249","title":"MLQM: Machine Learning Approach for Accelerating Optimal Qubit Mapping","authors":"Wenjie Sun, Xiaoyu Li, Lianhui Yu, Zhigang Wang, Geng Chen, Guowu Yang","authorsParsed":[["Sun","Wenjie",""],["Li","Xiaoyu",""],["Yu","Lianhui",""],["Wang","Zhigang",""],["Chen","Geng",""],["Yang","Guowu",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 11:49:09 GMT"}],"updateDate":"2024-12-05","timestamp":1733312949000,"abstract":"  Quantum circuit mapping is a critical process in quantum computing that\ninvolves adapting logical quantum circuits to adhere to hardware constraints,\nthereby generating physically executable quantum circuits. Current quantum\ncircuit mapping techniques, such as solver-based methods, often encounter\nchallenges related to slow solving speeds due to factors like redundant search\niterations. Regarding this issue, we propose a machine learning approach for\naccelerating optimal qubit mapping (MLQM). First, the method proposes a global\nsearch space pruning scheme based on prior knowledge and machine learning,\nwhich in turn improves the solution efficiency. Second, to address the limited\navailability of effective samples in the learning task, MLQM introduces a novel\ndata augmentation and refinement scheme, this scheme enhances the size and\ndiversity of the quantum circuit dataset by exploiting gate allocation and\nqubit rearrangement. Finally, MLQM also further improves the solution\nefficiency by pruning the local search space, which is achieved through an\nadaptive dynamic adjustment mechanism of the solver variables. Compared to\nstate-of-the-art qubit mapping approaches, MLQM achieves optimal qubit mapping\nwith an average solving speed-up ratio of 1.79 and demonstrates an average\nadvantage of 22% in terms of space complexity.\n","subjects":["Physics/Quantum Physics","Computer Science/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PptuWsQdLdCRqq0HcqUZ290sh1XIug7pHGbSpOY7GnI","pdfSize":"5828996"}