{"id":"2412.00581","title":"Dynamics Modeling using Visual Terrain Features for High-Speed\n  Autonomous Off-Road Driving","authors":"Jason Gibson, Anoushka Alavilli, Erica Tevere, Evangelos A. Theodorou,\n  and Patrick Spieler","authorsParsed":[["Gibson","Jason",""],["Alavilli","Anoushka",""],["Tevere","Erica",""],["Theodorou","Evangelos A.",""],["Spieler","Patrick",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 20:42:26 GMT"}],"updateDate":"2024-12-03","timestamp":1732999346000,"abstract":"  Rapid autonomous traversal of unstructured terrain is essential for scenarios\nsuch as disaster response, search and rescue, or planetary exploration. As a\nvehicle navigates at the limit of its capabilities over extreme terrain, its\ndynamics can change suddenly and dramatically. For example, high-speed and\nvarying terrain can affect parameters such as traction, tire slip, and rolling\nresistance. To achieve effective planning in such environments, it is crucial\nto have a dynamics model that can accurately anticipate these conditions. In\nthis work, we present a hybrid model that predicts the changing dynamics\ninduced by the terrain as a function of visual inputs. We leverage a\npre-trained visual foundation model (VFM) DINOv2, which provides rich features\nthat encode fine-grained semantic information. To use this dynamics model for\nplanning, we propose an end-to-end training architecture for a projection\ndistance independent feature encoder that compresses the information from the\nVFM, enabling the creation of a lightweight map of the environment at runtime.\nWe validate our architecture on an extensive dataset (hundreds of kilometers of\naggressive off-road driving) collected across multiple locations as part of the\nDARPA Robotic Autonomy in Complex Environments with Resiliency (RACER) program.\nhttps://www.youtube.com/watch?v=dycTXxEosMk\n","subjects":["Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HRZjSDP3mAMqfhmXOVJqLV94pyrQkH932RrtjHKZXZ0","pdfSize":"11405026"}