{
  "id": "2412.12649",
  "title": "ClustEm4Ano: Clustering Text Embeddings of Nominal Textual Attributes\n  for Microdata Anonymization",
  "authors": "Robert Aufschl\\\"ager, Sebastian Wilhelm, Michael Heigl and Martin\n  Schramm",
  "authorsParsed": [
    [
      "Aufschläger",
      "Robert",
      ""
    ],
    [
      "Wilhelm",
      "Sebastian",
      ""
    ],
    [
      "Heigl",
      "Michael",
      ""
    ],
    [
      "Schramm",
      "Martin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 08:16:04 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734423364000,
  "abstract": "  This work introduces ClustEm4Ano, an anonymization pipeline that can be used\nfor generalization and suppression-based anonymization of nominal textual\ntabular data. It automatically generates value generalization hierarchies\n(VGHs) that, in turn, can be used to generalize attributes in\nquasi-identifiers. The pipeline leverages embeddings to generate semantically\nclose value generalizations through iterative clustering. We applied KMeans and\nHierarchical Agglomerative Clustering on $13$ different predefined text\nembeddings (both open and closed-source (via APIs)). Our approach is\nexperimentally tested on a well-known benchmark dataset for anonymization: The\nUCI Machine Learning Repository's Adult dataset. ClustEm4Ano supports\nanonymization procedures by offering more possibilities compared to using\narbitrarily chosen VGHs. Experiments demonstrate that these VGHs can outperform\nmanually constructed ones in terms of downstream efficacy (especially for small\n$k$-anonymity ($2 \\leq k \\leq 30$)) and therefore can foster the quality of\nanonymized datasets. Our implementation is made public.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "81stOZgLzGKuGQymq7HRZtokeOkoeZQtB3eXPIFghoI",
  "pdfSize": "2731819"
}