{
  "id": "2412.12485",
  "title": "Rydberg Atomic Receiver: Next Frontier of Wireless Communications",
  "authors": "Mingyao Cui, Qunsong Zeng, Kaibin Huang",
  "authorsParsed": [
    [
      "Cui",
      "Mingyao",
      ""
    ],
    [
      "Zeng",
      "Qunsong",
      ""
    ],
    [
      "Huang",
      "Kaibin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 02:41:37 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734403297000,
  "abstract": "  The advancement of Rydberg Atomic REceiver (RARE) is driving a paradigm shift\nin electromagnetic (EM) wave measurement. RAREs utilize the electron transition\nphenomenon of highly-excited atoms to interact with EM waves, thereby enabling\nwireless signal detection. Operating at the quantum scale, such new receivers\nhave the potential to breakthrough the sensitivity limit of classical\nreceivers, sparking a revolution in physical-layer wireless communications. The\nobjective of this paper is to offer insights into RARE-aided communication\nsystems. We first provide a comprehensive introduction to the fundamental\nprinciples of RAREs. Then, a thorough comparison between RAREs and classical\nreceivers is conducted in terms of the antenna size, sensitivity, coverage, and\nbandwidth. Subsequently, we overview the state-of-the-art design in RARE-aided\nwireless communications, exploring the latest progresses in frequency-division\nmultiplexing, multiple-input-multiple-output, wireless sensing, and quantum\nmany-body techniques. Finally, we highlight several wireless-communication\nrelated open problems as important research directions.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing",
    "Computer Science/Networking and Internet Architecture",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "SxtQDzfdo61teHBfk68Agmvkjrh5cerbCvY9VSjBE0g",
  "pdfSize": "1445596"
}