{
  "id": "2412.05096",
  "title": "Approaches to studying virus pangenome variation graphs",
  "authors": "Tim Downing",
  "authorsParsed": [
    [
      "Downing",
      "Tim",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 14:50:41 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733496641000,
  "abstract": "  Pangenome variation graphs (PVGs) allow for the representation of genetic\ndiversity in a more nuanced way than traditional reference-based approaches.\nHere we focus on how PVGs are a powerful tool for studying genetic variation in\nviruses, offering insights into the complexities of viral quasispecies,\nmutation rates, and population dynamics. PVGs allow for the representation of\ngenetic diversity in a more nuanced way than traditional reference-based\napproaches. PVGs originated in human genomics and hold great promise for viral\ngenomics. Previous work has been constrained by small sample sizes and\ngene-centric methods, PVGs enable a more comprehensive approach to studying\nviral diversity. Large viral genome collections should be used to make PVGs,\nwhich offer significant advantages: we outline accessible tools to achieve\nthis. This spans PVG construction, PVG file formats, PVG manipulation and\nanalysis, PVG visualisation, measuring PVG openness, and mapping reads to PVGs.\nAdditionally, the development of PVG-specific formats for mutation\nrepresentation and personalised PVGs that reflect specific research questions\nwill further enhance PVG applications. Although challenges remain, particularly\nin managing nested variants and optimising error detection, PVGs offer a\npromising direction for viral population genomics. These advances will enable\nmore accurate and comprehensive detection of viral mutations, contributing to a\ndeeper understanding of viral evolution and genotype-phenotype associations.\n",
  "subjects": [
    "Quantitative Biology/Genomics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "ctESRacKGm1Ux1rtCnNbxjheyTFt0Vi7Z8A_JS49hBg",
  "pdfSize": "2150075"
}