{
  "id": "2412.09803",
  "title": "deepNoC: A deep learning system to assign the number of contributors to\n  a short tandem repeat DNA profile",
  "authors": "Duncan Taylor and Melissa A. Humphries",
  "authorsParsed": [
    [
      "Taylor",
      "Duncan",
      ""
    ],
    [
      "Humphries",
      "Melissa A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 02:42:56 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734057776000,
  "abstract": "  A common task in forensic biology is to interpret and evaluate short tandem\nrepeat DNA profiles. The first step in these interpretations is to assign a\nnumber of contributors to the profiles, a task that is most often performed\nmanually by a scientist using their knowledge of DNA profile behaviour. Studies\nusing constructed DNA profiles have shown that as DNA profiles become more\ncomplex, and the number of DNA-donating individuals increases, the ability for\nscientists to assign the target number. There have been a number of machine\nlearning algorithms developed that seek to assign the number of contributors to\na DNA profile, however due to practical limitations in being able to generate\nDNA profiles in a laboratory, the algorithms have been based on summaries of\nthe available information. In this work we develop an analysis pipeline that\nsimulates the electrophoretic signal of an STR profile, allowing virtually\nunlimited, pre-labelled training material to be generated. We show that by\nsimulating 100 000 profiles and training a number of contributors estimation\ntool using a deep neural network architecture (in an algorithm named deepNoC)\nthat a high level of performance is achieved (89% for 1 to 10 contributors).\nThe trained network can then have fine-tuning training performed with only a\nfew hundred profiles in order to achieve the same accuracy within a specific\nlaboratory. We also build into deepNoC secondary outputs that provide a level\nof explainability to a user of algorithm, and show how they can be displayed in\nan intuitive manner.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Quantitative Biology/Quantitative Methods"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-HgIYkg__A8SK8d_WA8cnjSJvfuwpnOQ3S2dsx1aEKs",
  "pdfSize": "1077780"
}