{
  "id": "2412.11240",
  "title": "Revisiting altermagnetism in RuO2: a study of laser-pulse induced charge\n  dynamics by time-domain terahertz spectroscopy",
  "authors": "David T. Plouff, Laura Scheuer, Shreya Shrestha, Weipeng Wu, Nawsher\n  J. Parvez, Subhash Bhatt, Xinhao Wang, Lars Gundlach, M. Benjamin\n  Jungfleisch, and John Q. Xiao",
  "authorsParsed": [
    [
      "Plouff",
      "David T.",
      ""
    ],
    [
      "Scheuer",
      "Laura",
      ""
    ],
    [
      "Shrestha",
      "Shreya",
      ""
    ],
    [
      "Wu",
      "Weipeng",
      ""
    ],
    [
      "Parvez",
      "Nawsher J.",
      ""
    ],
    [
      "Bhatt",
      "Subhash",
      ""
    ],
    [
      "Wang",
      "Xinhao",
      ""
    ],
    [
      "Gundlach",
      "Lars",
      ""
    ],
    [
      "Jungfleisch",
      "M. Benjamin",
      ""
    ],
    [
      "Xiao",
      "John Q.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 16:45:15 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734281115000,
  "abstract": "  Altermagnets are a recently discovered class of magnetic material with great\npotential for applications in the field of spintronics, owing to their\nnon-relativistic spin-splitting and simultaneous antiferromagnetic order. One\nof the most studied candidates for altermagnetic materials is rutile structured\nRuO2. However, it has recently come under significant scrutiny as evidence\nemerged for its lack of any magnetic order. In this work, we study bilayers of\nepitaxial RuO2 and ferromagnetic permalloy (Fe19Ni81) by time-domain terahertz\nspectroscopy, probing for three possible mechanisms of laser-induced charge\ndynamics: the inverse spin Hall effect (ISHE), electrical anisotropic\nconductivity (EAC), and inverse altermagnetic spin-splitting effect (IASSE). We\nexamine films of four common RuO2 layer orientations: (001), (100), (110), and\n(101). If RuO2 is altermagnetic, then the (100) and (101) oriented samples are\nexpected to produce anisotropic emission from the IASSE, however, our results\ndo not indicate the presence of IASSE for either as-deposited or field annealed\nsamples. The THz emission from all samples is instead consistent with charge\ndynamics induced by only the relativistic ISHE and the non-relativistic and\nnon-magnetic EAC, casting further doubt on the existence of altermagnetism in\nRuO2. In addition, we find that in the (101) oriented RuO2 sample, the\ncombination of ISHE and EAC emission mechanisms produces THz emission which is\ntunable between linear and elliptical polarization by modulation of the\nexternal magnetic field.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "yMPwnVUFJASgZOhWFPml0kVTbUEM7NSJ8XlzvhLY-fU",
  "pdfSize": "3911424"
}