{
  "id": "2412.08458",
  "title": "Heavy Tail Robust Estimation and Inference for Average Treatment Effects",
  "authors": "Jonathan B. Hill and Saraswata Chaudhuri",
  "authorsParsed": [
    [
      "Hill",
      "Jonathan B.",
      ""
    ],
    [
      "Chaudhuri",
      "Saraswata",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 15:24:40 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733930680000,
  "abstract": "  We study the probability tail properties of Inverse Probability Weighting\n(IPW) estimators of the Average Treatment Effect (ATE) when there is limited\noverlap between the covariate distributions of the treatment and control\ngroups. Under unconfoundedness of treatment assignment conditional on\ncovariates, such limited overlap is manifested in the propensity score for\ncertain units being very close (but not equal) to 0 or 1. This renders IPW\nestimators possibly heavy tailed, and with a slower than sqrt(n) rate of\nconvergence. Trimming or truncation is ultimately based on the covariates,\nignoring important information about the inverse probability weighted random\nvariable Z that identifies ATE by E[Z]= ATE. We propose a tail-trimmed IPW\nestimator whose performance is robust to limited overlap. In terms of the\npropensity score, which is generally unknown, we plug-in its parametric\nestimator in the infeasible Z, and then negligibly trim the resulting feasible\nZ adaptively by its large values. Trimming leads to bias if Z has an asymmetric\ndistribution and an infinite variance, hence we estimate and remove the bias\nusing important improvements on existing theory and methods. Our estimator\nsidesteps dimensionality, bias and poor correspondence properties associated\nwith trimming by the covariates or propensity score. Monte Carlo experiments\ndemonstrate that trimming by the covariates or the propensity score requires\nthe removal of a substantial portion of the sample to render a low bias and\nclose to normal estimator, while our estimator has low bias and mean-squared\nerror, and is close to normal, based on the removal of very few sample\nextremes.\n",
  "subjects": [
    "Statistics/Methodology",
    "Mathematics/Statistics Theory",
    "Statistics/Statistics Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "L4kANQ0N_KkbLu16nCf6W7smcHFNre6rxcAcNwyQAzU",
  "pdfSize": "641217"
}