{
  "id": "2412.03654",
  "title": "Entanglement asymmetry in periodically driven quantum systems",
  "authors": "Tista Banerjee, Suchetan Das, and K. Sengupta",
  "authorsParsed": [
    [
      "Banerjee",
      "Tista",
      ""
    ],
    [
      "Das",
      "Suchetan",
      ""
    ],
    [
      "Sengupta",
      "K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 19:00:01 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 19 Dec 2024 08:50:04 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1733338801000,
  "abstract": "  We study the dynamics of entanglement asymmetry in periodically driven\nquantum systems. Using a periodically driven XY chain as a model for a driven\nintegrable quantum system, we provide semi-analytic results for the behavior of\nthe dynamics of the entanglement asymmetry, $\\Delta S$, as a function of the\ndrive frequency. Our analysis identifies special drive frequencies at which the\ndriven XY chain exhibits dynamic symmetry restoration and displays quantum\nMpemba effect over a long timescale; we identify an emergent approximate\nsymmetry in its Floquet Hamiltonian which plays a crucial role for realization\nof both these phenomena. We follow these results by numerical computation of\n$\\Delta S$ for the non-integrable driven Rydberg atom chain and obtain similar\nemergent-symmetry-induced symmetry restoration and quantum Mpemba effect in the\nprethermal regime for such a system. Finally, we provide an exact analytic\ncomputation of the entanglement asymmetry for a periodically driven conformal\nfield theory (CFT) on a strip. Such a driven CFT, depending on the drive\namplitude and frequency, exhibits two distinct phases, heating and non-heating,\nthat are separated by a critical line. Our results show that for $m$ cycles of\na periodic drive with time period $T$, $\\Delta S \\sim \\ln mT$ [$\\ln (\\ln mT)$]\nin the heating phase [on the critical line] for a generic CFT; in contrast, in\nthe non-heating phase, $\\Delta S$ displays small amplitude oscillations around\nit's initial value as a function of $mT$. We provide a phase diagram for the\nbehavior of $\\Delta S$ for such driven CFTs as a function of the drive\nfrequency and amplitude.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Condensed Matter/Strongly Correlated Electrons",
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "yYauDiL_QBb91W5rFDSWlUpOPuFE4A3ZJr4hsUh2p7Y",
  "pdfSize": "844226"
}