{"id":"2412.07833","title":"Discovery of a Ly{\\alpha} blob photo-ionised by a super-cluster of\n  massive stars associated to a z = 3.49 galaxy","authors":"S. Zarattini, J. M. Rodr\\'iguez Espinosa, C. Mu\\~noz-Tu\\~non, J. M.\n  Mas-Hesse, and P. Harrabal Haro","authorsParsed":[["Zarattini","S.",""],["Espinosa","J. M. Rodríguez",""],["Muñoz-Tuñon","C.",""],["Mas-Hesse","J. M.",""],["Haro","P. Harrabal",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 19:00:01 GMT"}],"updateDate":"2025-01-15","timestamp":1733857201000,"abstract":"  We report the discovery and characterisation of a Lya blob close to a galaxy\nat redshift z=3.49. We present our analysis to check whether the companion\ngalaxy could be the source of the ionised photons responsible for the Lya\nemission from the blob. We use images obtained from the 10.4 m GTC telescope\nthat are part of the SHARDS project. The blob is only visible in the F551W17\nfilter, centred around the Lya line at the redshift of the galaxy. We measure\nthe luminosity of the blob with a two-step procedure. First, we describe the\nradial surface brightness (SB) profile of the galaxy using a Sersic function.\nWe then remove this model from the SB profile of the blob and measure the\nluminosity of the blob alone. We also estimate the Lya continuum of the galaxy\nusing an ACS image from the HST in the filter F606W, that is wider than the\nSHARDS one and centred at about the same wavelength. In this image the galaxy\nis visible, but the blob is not detected, since its Lya emission is diluted in\nthe larger wavelength range of the F606W filter. We find that the Lya\nluminosity of the blob is 1.0x1043 erg s-1, in agreement with other Lya blobs\nreported in the literature. The luminosity of the galaxy in the same filter is\n2.9x1042 erg s-1. The luminosity within the HST/ACS image is Lcont=1.1x1043 erg\ns-1. With these values we are able to estimate the Lya equivalent width (EW),\nthat is found to be 111 {\\AA} (rest-frame). This value suggests that a\nsuper-cluster of massive (1-2x107 Msun) and young (2-4 Myr) stars could be\nresponsible for the ionisation of the blob. We also use two other methods to\nestimate the luminosity of the galaxy and the blob, both supporting our\nconclusions. It is worth noting that the Lya blob is spatially decoupled from\nthe galaxy by 5.7 kpc. This misalignment could suggest the presence of an\nionised cone of escaping material, as found in nearby galaxies such as M82.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YT3nxLIGK6IYgdloYL5-qCPrYJ1jZ9jpE3WFIG_j5VM","pdfSize":"1474697"}