{"id":"2412.01783","title":"Transfer Learning for Control Systems via Neural Simulation Relations","authors":"Alireza Nadali, Bingzhuo Zhong, Ashutosh Trivedi, Majid Zamani","authorsParsed":[["Nadali","Alireza",""],["Zhong","Bingzhuo",""],["Trivedi","Ashutosh",""],["Zamani","Majid",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 18:34:35 GMT"}],"updateDate":"2024-12-03","timestamp":1733164475000,"abstract":"  Transfer learning is an umbrella term for machine learning approaches that\nleverage knowledge gained from solving one problem (the source domain) to\nimprove speed, efficiency, and data requirements in solving a different but\nrelated problem (the target domain). The performance of the transferred model\nin the target domain is typically measured via some notion of loss function in\nthe target domain. This paper focuses on effectively transferring control logic\nfrom a source control system to a target control system while providing\napproximately similar behavioral guarantees in both domains. However, in the\nabsence of a complete characterization of behavioral specifications, this\nproblem cannot be captured in terms of loss functions. To overcome this\nchallenge, we use (approximate) simulation relations to characterize\nobservational equivalence between the behaviors of two systems.\n  Simulation relations ensure that the outputs of both systems, equipped with\ntheir corresponding controllers, remain close to each other over time, and\ntheir closeness can be quantified {\\it a priori}. By parameterizing simulation\nrelations with neural networks, we introduce the notion of \\emph{neural\nsimulation relations}, which provides a data-driven approach to transfer any\nsynthesized controller, regardless of the specification of interest, along with\nits proof of correctness. Compared with prior approaches, our method eliminates\nthe need for a closed-loop mathematical model and specific requirements for\nboth the source and target systems. We also introduce validity conditions that,\nwhen satisfied, guarantee the closeness of the outputs of two systems equipped\nwith their corresponding controllers, thus eliminating the need for post-facto\nverification. We demonstrate the effectiveness of our approach through case\nstudies involving a vehicle and a double inverted pendulum.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computer Science/Machine Learning","Computer Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"-kiqJ9Dkd4tq-GVOWhdAVmvpyH34l6Mu0kgWrl6WM4U","pdfSize":"1635579"}