{
  "id": "2412.04996",
  "title": "Radiative Back-Reaction on Charged Particle Motion in the Dipole\n  Magnetosphere of Neutron Stars",
  "authors": "Zden\\v{e}k Stuchl\\'ik, Jaroslav Vrba, Martin Kolo\\v{s} and Arman\n  Tursunov",
  "authorsParsed": [
    [
      "Stuchlík",
      "Zdeněk",
      ""
    ],
    [
      "Vrba",
      "Jaroslav",
      ""
    ],
    [
      "Kološ",
      "Martin",
      ""
    ],
    [
      "Tursunov",
      "Arman",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 12:46:02 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733489162000,
  "abstract": "  The motion of charged particles under the Lorentz force in the magnetosphere\nof neutron stars, represented by a dipole field in the Schwarzschild spacetime,\ncan be determined by an effective potential, whose local extrema govern\ncircular orbits both in and off the equatorial plane, which coincides with the\nsymmetry plane of the dipole field. In this work, we provide a detailed\ndescription of the properties of these \"conservative\" circular orbits and,\nusing the approximation represented by the Landau-Lifshitz equation, examine\nthe role of the radiative back-reaction force that influences the motion of\ncharged particles following both the in and off equatorial circular orbits, as\nwell as the chaotic orbits confined to belts centered around the circular\norbits. To provide clear insight into these dynamics, we compare particle\nmotion with and without the back-reaction force. We demonstrate that, in the\ncase of an attractive Lorentz force, the back-reaction leads to the charged\nparticles falling onto the neutron star's surface in all scenarios considered.\nFor the repulsive Lorentz force, in combination with the back-reaction force,\nwe observe a widening of stable equatorial circular orbits; the off-equatorial\norbits shift toward the equatorial plane and subsequently widen if they are\nsufficiently close to the plane. Otherwise, the off-equatorial orbits evolve\ntoward the neutron star surface. The critical latitude, which separates orbital\nwidening from falling onto the surface, is determined numerically as a function\nof the electromagnetic interaction's intensity.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2SSvw0c9JIv2UEAzDT3VRJHWe8Prd9r_MjtTbeNRirQ",
  "pdfSize": "4701371"
}