{"id":"2412.11597","title":"Transition dynamics of electricity asset-owning firms","authors":"Anton Pichler","authorsParsed":[["Pichler","Anton",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 09:36:15 GMT"}],"updateDate":"2024-12-17","timestamp":1734341775000,"abstract":"  Despite dramatic growth and cost improvements in renewables, existing energy\ncompanies exhibit significant inertia in adapting to the evolving technological\nlandscape. This study examines technology transition patterns by analyzing over\n140,000 investments in power assets over more than two decades, focusing on how\nfirms expand existing technology holdings and adopt new technologies. Building\non our comprehensive micro-level dataset, we provide a number of quantitative\nmetrics on global investment dynamism and the evolution of technology\nportfolios. We find that only about 10\\% of firms experience capacity changes\nin a given year, and that technology portfolios of firms are highly\nconcentrated and persistent in time. We also identify a small subset of\nfrequently investing firms that tend to be large and are key drivers of global\ntechnology-specific capacity expansion. Technology transitions within companies\nare extremely rare. Less than 3% of the more than 8,400 fossil fuel-dominated\nfirms have substantially transformed their portfolios to a renewable focus and\nfirms fully transitioning to renewables are, up-to-date, virtually\nnon-existent. Notably, firms divesting into renewables do not exhibit very\ncharacteristic technology-transition patterns but rather follow idiosyncratic\ntransition pathways. Our results quantify the complex technology diffusion\ndynamics and the diverse corporate responses to a changing technology\nlandscape, highlighting the challenge of designing general policies aimed at\nfostering technological transitions at the level of firms.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TPxTfBn46VlDhFryLnPwjICdnnfI-iM0z5jNFDxt4Ck","pdfSize":"516777"}