{"id":"2412.04999","title":"'Debunk-It-Yourself': Health Professionals' Strategies for Responding to\n  Misinformation on TikTok","authors":"Filipo Sharevski and Jennifer Vander Loop and Amy Devine and Peter\n  Jachim and Sanchari Das","authorsParsed":[["Sharevski","Filipo",""],["Loop","Jennifer Vander",""],["Devine","Amy",""],["Jachim","Peter",""],["Das","Sanchari",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 12:52:18 GMT"}],"updateDate":"2024-12-09","timestamp":1733489538000,"abstract":"  Misinformation is \"sticky\" in nature, requiring a considerable effort to undo\nits influence. One such effort is debunking or exposing the falsity of\ninformation. As an abundance of misinformation is on social media, platforms do\nbear some debunking responsibility in order to preserve their trustworthiness\nas information providers. A subject of interpretation, platforms poorly meet\nthis responsibility and allow dangerous health misinformation to influence many\nof their users. This open route to harm did not sit well with health\nprofessional users, who recently decided to take the debunking into their own\nhands. To study this individual debunking effort - which we call\n'Debunk-It-Yourself (DIY)' - we conducted an exploratory survey n=14 health\nprofessionals who wage a misinformation counter-influence campaign through\nvideos on TikTok. We focused on two topics, nutrition and mental health, which\nare the ones most often subjected to misinformation on the platform. Our\nthematic analysis reveals that the counterinfluence follows a common process of\ninitiation, selection, creation, and \"stitching\" or duetting a debunking video\nwith a misinformation video. The 'Debunk-It-Yourself' effort was underpinned by\nthree unique aspects: (i) it targets trending misinformation claims perceived\nto be of direct harm to people's health; (ii) it offers a symmetric response to\nthe misinformation; and (iii) it is strictly based on scientific evidence and\nclaimed clinical experience. Contrasting the 'Debunk-It-Yourself' effort with\nthe one TikTok and other platforms (reluctantly) put in moderation, we offer\nrecommendations for a structured response against the misinformation's\ninfluence by the users themselves.\n","subjects":["Computer Science/Cryptography and Security","Computer Science/Computers and Society","Computer Science/Human-Computer Interaction","Computer Science/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9kKQPXZGiP56W4uKKLLdfLaj1dGQUIT1j5gEUtV45bw","pdfSize":"1016532"}