{"id":"2412.11476","title":"Vertical Federated Unlearning via Backdoor Certification","authors":"Mengde Han, Tianqing Zhu, Lefeng Zhang, Huan Huo, Wanlei Zhou","authorsParsed":[["Han","Mengde",""],["Zhu","Tianqing",""],["Zhang","Lefeng",""],["Huo","Huan",""],["Zhou","Wanlei",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 06:40:25 GMT"}],"updateDate":"2024-12-17","timestamp":1734331225000,"abstract":"  Vertical Federated Learning (VFL) offers a novel paradigm in machine\nlearning, enabling distinct entities to train models cooperatively while\nmaintaining data privacy. This method is particularly pertinent when entities\npossess datasets with identical sample identifiers but diverse attributes.\nRecent privacy regulations emphasize an individual's \\emph{right to be\nforgotten}, which necessitates the ability for models to unlearn specific\ntraining data. The primary challenge is to develop a mechanism to eliminate the\ninfluence of a specific client from a model without erasing all relevant data\nfrom other clients. Our research investigates the removal of a single client's\ncontribution within the VFL framework. We introduce an innovative modification\nto traditional VFL by employing a mechanism that inverts the typical learning\ntrajectory with the objective of extracting specific data contributions. This\napproach seeks to optimize model performance using gradient ascent, guided by a\npre-defined constrained model. We also introduce a backdoor mechanism to verify\nthe effectiveness of the unlearning procedure. Our method avoids fully\naccessing the initial training data and avoids storing parameter updates.\nEmpirical evidence shows that the results align closely with those achieved by\nretraining from scratch. Utilizing gradient ascent, our unlearning approach\naddresses key challenges in VFL, laying the groundwork for future advancements\nin this domain. All the code and implementations related to this paper are\npublicly available at https://github.com/mengde-han/VFL-unlearn.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nYYs2My0ui7IfbPgUiV5GHKC8N5oOWRYK3eElhwC8Ao","pdfSize":"12020445"}