{
  "id": "2412.08899",
  "title": "M\\textbf{\\textit{O}}enes family materials with Dirac nodal loop, strong\n  light-harvesting ability, long carrier lifetime and conduction-band valley\n  spin splitting",
  "authors": "Luo Yan, Junchi Liu, Yu-Feng Ding, Jiafang Wu, Bao-Tian Wang, and\n  Liujiang Zhou",
  "authorsParsed": [
    [
      "Yan",
      "Luo",
      ""
    ],
    [
      "Liu",
      "Junchi",
      ""
    ],
    [
      "Ding",
      "Yu-Feng",
      ""
    ],
    [
      "Wu",
      "Jiafang",
      ""
    ],
    [
      "Wang",
      "Bao-Tian",
      ""
    ],
    [
      "Zhou",
      "Liujiang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 03:24:45 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733973885000,
  "abstract": "  M\\textbf{\\textit{O}}enes, as emerging MXenes-like materials, also have wide\nstructural spaces and various chemical and physical properties. Using\nfirst-principles and high-throughput calculations, we have built an online\nlibrary (\\url{https://moenes.online}) for M\\textbf{\\textit{O}}enes family\nmaterials from basic summaries, mechanical, phonon and electron aspects, based\non their structural diversities from 2 stoichiometric ratios, 11\nearly-transition metals, 4 typical functional groups and 4 oxygen group\nelements. Compared to MXenes, the main advantage of M\\textbf{\\textit{O}}enes at\npresent is that we have discovered 14 direct semiconductors, which greatly\nincreases the number of direct semiconductors and the range of band gap values\nin the MXenes family. Among them, 1T-Ti$_{2}$\\textit{\\textbf{O}}F$_{2}$\n(\\textbf{\\textit{O}}=O, S, Se) reveal tunable semiconducting features and\nstrong light-harvesting ability ranging from the ultraviolet to the\nnear-infrared region. Besides, 2H- and 1T-Y$_{2}$TeO$_{2}$ have a long carrier\nlifetime of 2.38 and 1.24 ns, originating from their spatially distinguished\nVBM and CBM states and long dephasing times. In addition, 2H-Zr$_{2}$O(O)$_{2}$\nshows spin-valley coupling phenomena, and the valley spin splitting is apparent\nand robust in its conduction band ($\\sim$85 meV). Therefore,\nM\\textbf{\\textit{O}}enes have a wealth of physical properties, not limited to\nthose reported here, and future studies of these emerging\nM\\textbf{\\textit{O}}enes are appealing.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "qrRpAzHih0tiDZ1TDhpDIwM7vtagAIeuypN7uQhA7C4",
  "pdfSize": "4082567"
}