{
  "id": "2412.16727",
  "title": "Fundamental thresholds for computational and erasure errors via the\n  coherent information",
  "authors": "Luis Colmenarez, Seyong Kim, Markus M\\\"uller",
  "authorsParsed": [
    [
      "Colmenarez",
      "Luis",
      ""
    ],
    [
      "Kim",
      "Seyong",
      ""
    ],
    [
      "Müller",
      "Markus",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 18:30:30 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734805830000,
  "abstract": "  Quantum error correcting (QEC) codes protect quantum information against\nenvironmental noise. Computational errors caused by the environment change the\nquantum state within the qubit subspace, whereas quantum erasures correspond to\nthe loss of qubits at known positions. Correcting either type of error involves\ndifferent correction mechanisms, which makes studying the interplay between\nerasure and computational errors particularly challenging. In this work, we\npropose a framework based on the coherent information (CI) of the mixed-state\ndensity operator associated to noisy QEC codes, for treating both types of\nerrors together. We show how to rigorously derive different families of\nstatistical mechanics mappings for generic stabilizer QEC codes in the presence\nof both types of errors. We observe that the erasure errors enter as a\nclassical average over fully depolarizing channels. Further, we show that\ncomputing the CI for erasure errors only can be done efficiently upon sampling\nover erasure configurations. We then test our approach on the 2D toric and\ncolor codes and compute optimal thresholds for erasure errors only, finding a\n$50\\%$ threshold for both codes. This strengthens the notion that both codes\nshare the same optimal thresholds. When considering both computational and\nerasure errors, the CI of small-size codes yields thresholds in very accurate\nagreement with established results that have been obtained in the thermodynamic\nlimit. We thereby further establish the CI as a practical tool for studying\noptimal thresholds under realistic noise and as a means for uncovering new\nrelations between QEC codes and statistical physics models.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Condensed Matter/Disordered Systems and Neural Networks",
    "Condensed Matter/Statistical Mechanics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "JuC7ZxSU3TRjHfmHFAjPD75H1m1wjMPG57_VLhVPA74",
  "pdfSize": "1850118"
}