{
  "id": "2412.09964",
  "title": "Assessing high-order effects in feature importance via predictability\n  decomposition",
  "authors": "Marlis Ontivero-Ortega, Luca Faes, Jesus M Cortes, Daniele Marinazzo,\n  Sebastiano Stramaglia",
  "authorsParsed": [
    [
      "Ontivero-Ortega",
      "Marlis",
      ""
    ],
    [
      "Faes",
      "Luca",
      ""
    ],
    [
      "Cortes",
      "Jesus M",
      ""
    ],
    [
      "Marinazzo",
      "Daniele",
      ""
    ],
    [
      "Stramaglia",
      "Sebastiano",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 08:47:16 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734079636000,
  "abstract": "  Leveraging the large body of work devoted in recent years to describe\nredundancy and synergy in multivariate interactions among random variables, we\npropose a novel approach to quantify cooperative effects in feature importance,\none of the most used techniques for explainable artificial intelligence. In\nparticular, we propose an adaptive version of a well-known metric of feature\nimportance, named Leave One Covariate Out (LOCO), to disentangle high-order\neffects involving a given input feature in regression problems. LOCO is the\nreduction of the prediction error when the feature under consideration is added\nto the set of all the features used for regression. Instead of calculating the\nLOCO using all the features at hand, as in its standard version, our method\nsearches for the multiplet of features that maximize LOCO and for the one that\nminimize it. This provides a decomposition of the LOCO as the sum of a two-body\ncomponent and higher-order components (redundant and synergistic), also\nhighlighting the features that contribute to building these high-order effects\nalongside the driving feature. We report the application to proton/pion\ndiscrimination from simulated detector measures by GEANT.\n",
  "subjects": [
    "Physics/Data Analysis, Statistics and Probability",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "VEEgGY1LuWioTL2CqJa4p3P_gotwpw-PEnGdEgGlvVU",
  "pdfSize": "383237"
}