{
  "id": "2412.20250",
  "title": "Recommender Engine Driven Client Selection in Federated Brain Tumor\n  Segmentation",
  "authors": "Muhammad Irfan Khan, Elina Kontio, Suleiman A. Khan, and Mojtaba\n  Jafaritadi",
  "authorsParsed": [
    [
      "Khan",
      "Muhammad Irfan",
      ""
    ],
    [
      "Kontio",
      "Elina",
      ""
    ],
    [
      "Khan",
      "Suleiman A.",
      ""
    ],
    [
      "Jafaritadi",
      "Mojtaba",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 19:49:02 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735415342000,
  "abstract": "  This study presents a robust and efficient client selection protocol designed\nto optimize the Federated Learning (FL) process for the Federated Tumor\nSegmentation Challenge (FeTS 2024). In the evolving landscape of FL, the\njudicious selection of collaborators emerges as a critical determinant for the\nsuccess and efficiency of collective learning endeavors, particularly in\ndomains requiring high precision. This work introduces a recommender engine\nframework based on non-negative matrix factorization (NNMF) and a hybrid\naggregation approach that blends content-based and collaborative filtering.\nThis method intelligently analyzes historical performance, expertise, and other\nrelevant metrics to identify the most suitable collaborators. This approach not\nonly addresses the cold start problem where new or inactive collaborators pose\nselection challenges due to limited data but also significantly improves the\nprecision and efficiency of the FL process. Additionally, we propose harmonic\nsimilarity weight aggregation (HSimAgg) for adaptive aggregation of model\nparameters. We utilized a dataset comprising 1,251 multi-parametric magnetic\nresonance imaging (mpMRI) scans from individuals diagnosed with glioblastoma\n(GBM) for training purposes and an additional 219 mpMRI scans for external\nevaluations. Our federated tumor segmentation approach achieved dice scores of\n0.7298, 0.7424, and 0.8218 for enhancing tumor (ET), tumor core (TC), and whole\ntumor (WT) segmentation tasks respectively on the external validation set. In\nconclusion, this research demonstrates that selecting collaborators with\nexpertise aligned to specific tasks, like brain tumor segmentation, improves\nthe effectiveness of FL networks.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "4FtGAdGVMRgB_cQa-f6_PzQMR01f7wjks5eURyvGaRk",
  "pdfSize": "373362"
}