{"id":"2412.11106","title":"Unpaired Multi-Domain Histopathology Virtual Staining using Dual Path\n  Prompted Inversion","authors":"Bing Xiong, Yue Peng, RanRan Zhang, Fuqiang Chen, JiaYe He, Wenjian\n  Qin","authorsParsed":[["Xiong","Bing",""],["Peng","Yue",""],["Zhang","RanRan",""],["Chen","Fuqiang",""],["He","JiaYe",""],["Qin","Wenjian",""]],"versions":[{"version":"v1","created":"Sun, 15 Dec 2024 08:09:56 GMT"}],"updateDate":"2024-12-17","timestamp":1734250196000,"abstract":"  Virtual staining leverages computer-aided techniques to transfer the style of\nhistochemically stained tissue samples to other staining types. In virtual\nstaining of pathological images, maintaining strict structural consistency is\ncrucial, as these images emphasize structural integrity more than natural\nimages. Even slight structural alterations can lead to deviations in diagnostic\nsemantic information. Furthermore, the unpaired characteristic of virtual\nstaining data may compromise the preservation of pathological diagnostic\ncontent. To address these challenges, we propose a dual-path inversion virtual\nstaining method using prompt learning, which optimizes visual prompts to\ncontrol content and style, while preserving complete pathological diagnostic\ncontent. Our proposed inversion technique comprises two key components: (1)\nDual Path Prompted Strategy, we utilize a feature adapter function to generate\nreference images for inversion, providing style templates for input image\ninversion, called Style Target Path. We utilize the inversion of the input\nimage as the Structural Target path, employing visual prompt images to maintain\nstructural consistency in this path while preserving style information from the\nstyle Target path. During the deterministic sampling process, we achieve\ncomplete content-style disentanglement through a plug-and-play embedding visual\nprompt approach. (2) StainPrompt Optimization, where we only optimize the null\nvisual prompt as ``operator'' for dual path inversion, rather than fine-tune\npre-trained model. We optimize null visual prompt for structual and style\ntrajectory around pivotal noise on each timestep, ensuring accurate dual-path\ninversion reconstruction. Extensive evaluations on publicly available\nmulti-domain unpaired staining datasets demonstrate high structural consistency\nand accurate style transfer results.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nlBVBRpiwW4n7Li6h-DeGNlt2PzA_EQpPR39BrNx5zE","pdfSize":"13712615"}