{"id":"2412.10126","title":"Exploration of optimal hyperfine transitions for spin-wave storage in\n  $^{167}$Er$^{3+}$:Y$_2$SiO$_5$","authors":"K. Matsuura, S. Yasui, R. Kaji, H. Sasakura, T. Tawara, and S. Adachi","authorsParsed":[["Matsuura","K.",""],["Yasui","S.",""],["Kaji","R.",""],["Sasakura","H.",""],["Tawara","T.",""],["Adachi","S.",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 13:13:08 GMT"},{"version":"v2","created":"Wed, 12 Feb 2025 23:52:57 GMT"}],"updateDate":"2025-02-14","timestamp":1734095588000,"abstract":"  The dependence of the magnetic fluctuations and the spin coherence time\n$T_2^{\\rm hyp}$ of the lowest Stark states $^4I_{15/2}\\ (Z_1)$ in\n$^{167}$Er$^{3+}$:Y$_2$SiO$_5$ under zero magnetic field on Er concentration is\nnumerically investigated in the range of 10 to 10$^6$ parts per million (ppm).\nThe magnetic fluctuations surrounding the target Er electron generated by the\ndipole-dipole interaction due to two components, Y ions in host crystal and\ndoped Er ions, are calculated by Monte-Carlo method. The former magnetic\nfluctuation is constant, while the latter depends on Er concentration. Due to\nthese two components, the Er-concentration dependence of $T_2^{\\rm hyp}$ at the\nzero first-order Zeeman (ZEFOZ) points saturates for crystals with Er\nconcentration below 10 ppm and no extension of the $T_2^{\\rm hyp}$ is expected\nwithout an external magnetic field. Under a magnetic field, the longest\n$T_2^{\\rm hyp}$ at a particular ZEFOZ point is expected to be over 150 s (90 s)\nfor site 1 (site 2), which is $\\sim 10^5$ times longer than that at zero field\nfor 10-ppm $^{167}$Er$^{3+}$:Y$_2$SiO$_5$. Interestingly, the ZEFOZ points\nunder a magnetic field appear almost along the one direction for site 1 and\nalmost in one plane for site 2 in optical frame $(D_1, D_2, b)$. The experiment\nfavors this trend in the position of the ZEFOZ points which can be explained on\nthe basis of the anisotropy of the effective spin Hamiltonian parameters.\nFinally, the tolerance of the ZEFOZ point at each site with the longest\n$T_2^{\\rm hyp}$ against the errors in the applied magnetic field vector is\nevaluated numerically.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"P-47_Yl28kH_ydVsw_8VHbfj9vyzqp7wj9T0iGl6ObM","pdfSize":"8197631"}