{
  "id": "2412.12498",
  "title": "Hierarchical Control of Emotion Rendering in Speech Synthesis",
  "authors": "Sho Inoue, Kun Zhou, Shuai Wang, Haizhou Li",
  "authorsParsed": [
    [
      "Inoue",
      "Sho",
      ""
    ],
    [
      "Zhou",
      "Kun",
      ""
    ],
    [
      "Wang",
      "Shuai",
      ""
    ],
    [
      "Li",
      "Haizhou",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 03:02:05 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 10 Jan 2025 13:21:57 GMT"
    }
  ],
  "updateDate": "2025-01-13",
  "timestamp": 1734404525000,
  "abstract": "  Emotional text-to-speech synthesis (TTS) aims to generate realistic emotional\nspeech from input text. However, quantitatively controlling multi-level emotion\nrendering remains challenging. In this paper, we propose a diffusion-based\nemotional TTS framework with a novel approach for emotion intensity modeling to\nfacilitate fine-grained control over emotion rendering at the phoneme, word,\nand utterance levels. We introduce a hierarchical emotion distribution (ED)\nextractor that captures a quantifiable ED embedding across different speech\nsegment levels. Additionally, we explore various acoustic features and assess\ntheir impact on emotion intensity modeling. During TTS training, the\nhierarchical ED embedding effectively captures the variance in emotion\nintensity from the reference audio and correlates it with linguistic and\nspeaker information. The TTS model not only generates emotional speech during\ninference, but also quantitatively controls the emotion rendering over the\nspeech constituents. Both objective and subjective evaluations demonstrate the\neffectiveness of our framework in terms of speech quality, emotional\nexpressiveness, and hierarchical emotion control.\n",
  "subjects": [
    "Computer Science/Sound",
    "Electrical Engineering and Systems Science/Audio and Speech Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "bqsOK3p83Cc5doByIxXNPFxzZKIvusua2HXDhquG9IU",
  "pdfSize": "3506062"
}