{
  "id": "2412.09562",
  "title": "Identification of structures driving trailing-edge noise. Part II --\n  Numerical investigation",
  "authors": "Zhenyang Yuan and Simon Demange and Kilian Oberleithner and Andr\\'e V.\n  G. Cavalieri and Ardeshir Hanifi",
  "authorsParsed": [
    [
      "Yuan",
      "Zhenyang",
      ""
    ],
    [
      "Demange",
      "Simon",
      ""
    ],
    [
      "Oberleithner",
      "Kilian",
      ""
    ],
    [
      "Cavalieri",
      "André V. G.",
      ""
    ],
    [
      "Hanifi",
      "Ardeshir",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 18:47:43 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734029263000,
  "abstract": "  The aim of the present work is to investigate the mechanisms of broadband\ntrailing-edge noise generation to improve prediction tools and control\nstrategies. We focus on a NACA 0012 airfoil at 3 degrees angle of attack and\nchord Reynolds number Re = 200,000. A high-fidelity wall-resolved compressible\nimplicit large eddy simulation (LES) is performed to collect data for our\nanalysis. The simulation is designed in close alignment with the experiment\ndescribed in detail in the companion paper (Demange et al. 2024b). Zig-zag\ngeometrical tripping elements, added to generate a turbulent boundary layer,\nare meshed to closely follow the experimental setup. A large spanwise domain is\nused in the simulation to include propagative acoustic waves with low\nwavenumbers. An in-depth comparison with experiments is conducted showing good\nagreement in terms of mean flow statistics, acoustic and hydrodynamic spectra,\nand coherence lengths. Furthermore, a strong correlation is found between the\nradiated acoustics and spanwise-coherent structures. To investigate the\ncorrelation for higher wavenumbers, spectral proper orthogonal decomposition\n(SPOD) is applied to the spanwise Fourier-transformed LES dataset. The analysis\nof all SPOD modes for the leading spanwise wavenumbers reveals\nstreamwise-travelling wavepackets as the source of the radiated acoustics. This\nfinding, confirming observations from experiments in the companion paper, leads\nto a new understanding of the turbulent structures driving the trailing-edge\nnoise. By performing extended SPOD based on the acoustic region, we confirm the\nlow rank nature of the acoustics, and a reduced-order model based on acoustic\nextended SPOD is proposed for the far-field acoustic reconstruction.\n",
  "subjects": [
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "hNru9Hly9ukLe5UPLMZgLsxXkAkDu_9F3L85u9jyqpQ",
  "pdfSize": "36644688"
}