{
  "id": "2412.09985",
  "title": "Switchable Chern insulator, isospin competitions and charge density\n  waves in rhombohedral graphene moire superlattices",
  "authors": "Jian Zheng, Size Wu, Kai Liu, Bosai Lyu, Shuhan Liu, Yating Sha,\n  Zhengxian Li, Kenji Watanabe, Takashi Taniguchi, Jinfeng Jia, Zhiwen Shi,\n  Guorui Chen",
  "authorsParsed": [
    [
      "Zheng",
      "Jian",
      ""
    ],
    [
      "Wu",
      "Size",
      ""
    ],
    [
      "Liu",
      "Kai",
      ""
    ],
    [
      "Lyu",
      "Bosai",
      ""
    ],
    [
      "Liu",
      "Shuhan",
      ""
    ],
    [
      "Sha",
      "Yating",
      ""
    ],
    [
      "Li",
      "Zhengxian",
      ""
    ],
    [
      "Watanabe",
      "Kenji",
      ""
    ],
    [
      "Taniguchi",
      "Takashi",
      ""
    ],
    [
      "Jia",
      "Jinfeng",
      ""
    ],
    [
      "Shi",
      "Zhiwen",
      ""
    ],
    [
      "Chen",
      "Guorui",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 09:11:06 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734081066000,
  "abstract": "  Graphene-based moire superlattices provide a versatile platform for exploring\nnovel correlated and topological electronic states, driven by enhanced Coulomb\ninteractions within flat bands. The intrinsic tunability of graphene s multiple\ndegrees of freedom enables precise control over these complex quantum phases.\nIn this study, we observe a range of competing phases and their transitions in\nrhombohedrally stacked hexalayer graphene on hexagonal boron nitride (r-6G/hBN)\nmoire superlattices. When electrons are polarized away from the moire\nsuperlattice, we firstly identify a Chern insulator with reversible Chern\nnumbers at v = 1 (one electron per moire cell), attributed to the competition\nbetween bulk and edge magnetizations.Then, we detect transitions between three\ndistinct insulating states at v = 2, driven by vertical displacement field D\nand vertical magnetic field B. These insulating phases are distinguished as\nspin-antiferromagnetic, spin-polarized, and valley-polarized insulators, based\non their responses to parallel and perpendicular magnetic fields. When\nelectrons are polarized toward the moire superlattice, in a device with large\ntwist angle, insulating states appear at v = 1/3 and 2/3 at zero magnetic\nfield, and v = 1/2 in a magnetic field. Our findings reveal a rich interplay of\ncharge, isospin, topology and magnetic field in rhombohedral graphene moire\nsuperlattices.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "iKWh60jpleacBEMoNf5ORGLXHa2X3w5lFazAXNL_iOg",
  "pdfSize": "1183900"
}