{"id":"2412.00104","title":"Differential learning kinetics govern the transition from memorization\n  to generalization during in-context learning","authors":"Alex Nguyen, Gautam Reddy","authorsParsed":[["Nguyen","Alex",""],["Reddy","Gautam",""]],"versions":[{"version":"v1","created":"Wed, 27 Nov 2024 22:12:29 GMT"},{"version":"v2","created":"Thu, 12 Dec 2024 16:10:51 GMT"}],"updateDate":"2024-12-13","timestamp":1732745549000,"abstract":"  Transformers exhibit in-context learning (ICL): the ability to use novel\ninformation presented in the context without additional weight updates. Recent\nwork shows that ICL emerges when models are trained on a sufficiently diverse\nset of tasks and the transition from memorization to generalization is sharp\nwith increasing task diversity. One interpretation is that a network's limited\ncapacity to memorize favors generalization. Here, we examine the mechanistic\nunderpinnings of this transition using a small transformer applied to a\nsynthetic ICL task. Using theory and experiment, we show that the sub-circuits\nthat memorize and generalize can be viewed as largely independent. The relative\nrates at which these sub-circuits learn explains the transition from\nmemorization to generalization, rather than capacity constraints. We uncover a\nmemorization scaling law, which determines the task diversity threshold at\nwhich the network generalizes. The theory quantitatively explains a variety of\nother ICL-related phenomena, including the long-tailed distribution of when ICL\nis acquired, the bimodal behavior of solutions close to the task diversity\nthreshold, the influence of contextual and data distributional statistics on\nICL, and the transient nature of ICL.\n","subjects":["Computer Science/Machine Learning","Condensed Matter/Disordered Systems and Neural Networks","Computer Science/Artificial Intelligence","Computer Science/Neural and Evolutionary Computing","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pq8n6I5CcnxNYlH0OdOJXcl4vZqdE930tuwiZdTGc44","pdfSize":"6376456"}