{"id":"2412.07058","title":"Random regular graph states are complex at almost any depth","authors":"Soumik Ghosh, Dominik Hangleiter, Jonas Helsen","authorsParsed":[["Ghosh","Soumik",""],["Hangleiter","Dominik",""],["Helsen","Jonas",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 23:44:09 GMT"}],"updateDate":"2024-12-11","timestamp":1733787849000,"abstract":"  Graph states are fundamental objects in the theory of quantum information due\nto their simple classical description and rich entanglement structure. They are\nalso intimately related to IQP circuits, which have applications in quantum\npseudorandomness and quantum advantage. For us, they are a toy model to\nunderstand the relation between circuit connectivity, entanglement structure\nand computational complexity. In the worst case, a strict dichotomy in the\ncomputational universality of such graph states appears as a function of the\ndegree $d$ of a regular graph state [GDH+23]. In this paper, we initiate the\nstudy of the average-case complexity of simulating random graph states of\nvarying degree when measured in random product bases and give distinct evidence\nthat a similar complexity-theoretic dichotomy exists in the average case.\nSpecifically, we consider random $d$-regular graph states and prove three\ndistinct results: First, we exhibit two families of IQP circuits of depth $d$\nand show that they anticoncentrate for any $2 < d = o(n)$ when measured in a\nrandom $X$-$Y$-plane product basis. This implies anticoncentration for random\nconstant-regular graph states. Second, in the regime $d = \\Theta(n^c)$ with $c\n\\in (0,1)$, we prove that random $d$-regular graph states contain polynomially\nlarge grid graphs as induced subgraphs with high probability. This implies that\nthey are universal resource states for measurement-based computation. Third, in\nthe regime of high degree ($d\\sim n/2$), we show that random graph states are\nnot sufficiently entangled to be trivially classically simulable, unlike Haar\nrandom states. Proving the three results requires different techniques--the\nanalysis of a classical statistical-mechanics model using Krawtchouck\npolynomials, graph theoretic analysis using the switching method, and analysis\nof the ranks of submatrices of random adjacency matrices, respectively.\n","subjects":["Physics/Quantum Physics","Computer Science/Computational Complexity","Mathematics/Combinatorics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"i8U7MJeKTo7jWsMI5DN9-geXYmKB3te1KBH2H4J8Uyk","pdfSize":"1114497"}