{
  "id": "2412.13943",
  "title": "On Explaining Knowledge Distillation: Measuring and Visualising the\n  Knowledge Transfer Process",
  "authors": "Gereziher Adhane and Mohammad Mahdi Dehshibi and Dennis Vetter and\n  David Masip and Gemma Roig",
  "authorsParsed": [
    [
      "Adhane",
      "Gereziher",
      ""
    ],
    [
      "Dehshibi",
      "Mohammad Mahdi",
      ""
    ],
    [
      "Vetter",
      "Dennis",
      ""
    ],
    [
      "Masip",
      "David",
      ""
    ],
    [
      "Roig",
      "Gemma",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 15:25:36 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734535536000,
  "abstract": "  Knowledge distillation (KD) remains challenging due to the opaque nature of\nthe knowledge transfer process from a Teacher to a Student, making it difficult\nto address certain issues related to KD. To address this, we proposed UniCAM, a\nnovel gradient-based visual explanation method, which effectively interprets\nthe knowledge learned during KD. Our experimental results demonstrate that with\nthe guidance of the Teacher's knowledge, the Student model becomes more\nefficient, learning more relevant features while discarding those that are not\nrelevant. We refer to the features learned with the Teacher's guidance as\ndistilled features and the features irrelevant to the task and ignored by the\nStudent as residual features. Distilled features focus on key aspects of the\ninput, such as textures and parts of objects. In contrast, residual features\ndemonstrate more diffused attention, often targeting irrelevant areas,\nincluding the backgrounds of the target objects. In addition, we proposed two\nnovel metrics: the feature similarity score (FSS) and the relevance score (RS),\nwhich quantify the relevance of the distilled knowledge. Experiments on the\nCIFAR10, ASIRRA, and Plant Disease datasets demonstrate that UniCAM and the two\nmetrics offer valuable insights to explain the KD process.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "L_eSvPd6i8pfMH3MVABN7viT0u2Xs2_3lc8uiwhPnFQ",
  "pdfSize": "3899665"
}