{
  "id": "2412.17046",
  "title": "A central tidal disruption event candidate in high redshift quasar SDSS\n  J000118.70+003314.0",
  "authors": "Ying Gu, Xue-Guang Zhang, Xing-Qian Chen, Xing Yang, En-Wei Liang",
  "authorsParsed": [
    [
      "Gu",
      "Ying",
      ""
    ],
    [
      "Zhang",
      "Xue-Guang",
      ""
    ],
    [
      "Chen",
      "Xing-Qian",
      ""
    ],
    [
      "Yang",
      "Xing",
      ""
    ],
    [
      "Liang",
      "En-Wei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 14:57:46 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734879466000,
  "abstract": "  We report a high-redshift ($z=1.404$) tidal disruption event (TDE) candidate\nin SDSS J000118.70+003314.0 (SDSS J0001), which is a quasar with apparent broad\nMg~{\\sc ii} emission line. The long-term variability in its nine-year\nphotometric $ugriz$-band light curves, obtained from the SDSS Stripe82 and the\nPHOTOOBJALL databases, can be described by the conventional TDE model. Our\nresults suggest that the TDE is a main-sequence star with mass of\n$1.905_{-0.009}^{+0.023}{\\rm M_\\odot}$ tidally disrupted by a black hole (BH)\nwith mass {$6.5_{-2.6}^{+3.5}\\times10^7{\\rm M_\\odot}$}. The BH mass is about\n7.5 times smaller than the virial BH mass derived from the broad Mg~{\\sc ii}\nemission line, which can be explained by non-virial dynamic properties of broad\nemission lines from TDEs debris. Furthermore, we examine the probability that\nthe event results from intrinsic variability of quasars, which is about\n$0.009\\%$, through applications of the DRW/CAR process. Alternative\nexplanations for the event are also discussed, such as the scenarios of dust\nobscurations, microlensing and accretion. Our results provide clues to support\nthat TDEs could be detectable in broad line quasars as well as in quiescent\ngalaxies, and to indicate the variability of some active galactic nuclei may be\npartly attributed to central TDEs.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "7Iij5gkTS9RJSHx8HifWQ3ksv3GRV2BZw-LhN3QQ5ao",
  "pdfSize": "2875367"
}