{
  "id": "2412.00894",
  "title": "CAPA: Continuous-Aperture Arrays for Revolutionizing 6G Wireless\n  Communications",
  "authors": "Yuanwei Liu, Chongjun Ouyang, Zhaolin Wang, Jiaqi Xu, Xidong Mu, and\n  Zhiguo Ding",
  "authorsParsed": [
    [
      "Liu",
      "Yuanwei",
      ""
    ],
    [
      "Ouyang",
      "Chongjun",
      ""
    ],
    [
      "Wang",
      "Zhaolin",
      ""
    ],
    [
      "Xu",
      "Jiaqi",
      ""
    ],
    [
      "Mu",
      "Xidong",
      ""
    ],
    [
      "Ding",
      "Zhiguo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 17:09:58 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733072998000,
  "abstract": "  In this paper, a novel continuous-aperture array (CAPA)-based wireless\ncommunication architecture is proposed, which relies on an electrically large\naperture with a continuous current distribution. First, an existing prototype\nof CAPA is reviewed, followed by the potential benefits and key motivations for\nemploying CAPAs in wireless communications. Then, three practical hardware\nimplementation approaches for CAPAs are introduced based on electronic,\noptical, and acoustic materials. Furthermore, several beamforming approaches\nare proposed to optimize the continuous current distributions of CAPAs, which\nare fundamentally different from those used for conventional spatially discrete\narrays (SPDAs). Numerical results are provided to demonstrate their key\nfeatures in low complexity and near-optimality. Based on these proposed\napproaches, the performance gains of CAPAs over SPDAs are revealed in terms of\nchannel capacity as well as diversity-multiplexing gains. Finally, several open\nresearch problems in CAPA are highlighted.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "S2RdTYUDlKz3vFvPoOxPt2wJ9o-LQgRJGf5dZdFuWIU",
  "pdfSize": "1242911"
}