{
  "id": "2412.19951",
  "title": "Validation of Subject-Specific Knee Models from In Vivo Measurements",
  "authors": "Thor E. Andreassen, Donald R. Hume, Landon D. Hamilton, Stormy L.\n  Hegg, Sean E. Higinbotham, Kevin B. Shelburne",
  "authorsParsed": [
    [
      "Andreassen",
      "Thor E.",
      ""
    ],
    [
      "Hume",
      "Donald R.",
      ""
    ],
    [
      "Hamilton",
      "Landon D.",
      ""
    ],
    [
      "Hegg",
      "Stormy L.",
      ""
    ],
    [
      "Higinbotham",
      "Sean E.",
      ""
    ],
    [
      "Shelburne",
      "Kevin B.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 23:19:40 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735341580000,
  "abstract": "  Calibration to experimental data is vital when developing subject-specific\nmodels towards developing digital twins. Yet, to date, subject-specific models\nare largely based on cadaveric testing, as in vivo data to calibrate against\nhas been difficult to obtain until recently. To support our overall goal of\nbuilding subject-specific models of the living knee, we aimed to show that\nsubject-specific computational models built and calibrated using in vivo\nmeasurements would have accuracy comparable to models built using in vitro\nmeasurements. Two knee specimens were imaged using a combination of computed\ntomography (CT), and surface scans. Knee laxity measurements were made with a\ncustom apparatus used for the living knee and from a robotic knee simulator.\nModels of the knees were built using the CT geometry and surface scans, and\nthen calibrated with either laxity data from the robotic knee simulator or from\nthe knee laxity apparatus. Model performance was compared by simulation of\npassive flexion, knee laxity and a clinically relevant pivot shift. Performance\nwas similar with differences during simulated anterior-posterior laxity tests\nof less than 2.5 mm. Additionally, model predictions of a pivot shift were\nsimilar with differences less than 3 deg or 3 mm for rotations and\ntranslations, respectively. Still, differences in the predicted ligament loads\nand calibrated material properties emerged, highlighting a need for methods to\ninclude ligament load as part of the underlying calibration process. Overall,\nthe results showed that currently available methods of measuring knee laxity in\nvivo are sufficient to calibrate models comparable with existing in vitro\ntechniques, and the workflows described here may provide a basis for modeling\nthe living knee. The models, data, and code are publicly available.\n",
  "subjects": [
    "Quantitative Biology/Quantitative Methods",
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "cfM9zI6NcYO0qik-dPFdWCkVQsKo3oiSm-5xwVoJKPI",
  "pdfSize": "2271773"
}