{
  "id": "2412.04282",
  "title": "Learnable Infinite Taylor Gaussian for Dynamic View Rendering",
  "authors": "Bingbing Hu, Yanyan Li, Rui Xie, Bo Xu, Haoye Dong, Junfeng Yao, Gim\n  Hee Lee",
  "authorsParsed": [
    [
      "Hu",
      "Bingbing",
      ""
    ],
    [
      "Li",
      "Yanyan",
      ""
    ],
    [
      "Xie",
      "Rui",
      ""
    ],
    [
      "Xu",
      "Bo",
      ""
    ],
    [
      "Dong",
      "Haoye",
      ""
    ],
    [
      "Yao",
      "Junfeng",
      ""
    ],
    [
      "Lee",
      "Gim Hee",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 16:03:37 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733414617000,
  "abstract": "  Capturing the temporal evolution of Gaussian properties such as position,\nrotation, and scale is a challenging task due to the vast number of\ntime-varying parameters and the limited photometric data available, which\ngenerally results in convergence issues, making it difficult to find an optimal\nsolution. While feeding all inputs into an end-to-end neural network can\neffectively model complex temporal dynamics, this approach lacks explicit\nsupervision and struggles to generate high-quality transformation fields. On\nthe other hand, using time-conditioned polynomial functions to model Gaussian\ntrajectories and orientations provides a more explicit and interpretable\nsolution, but requires significant handcrafted effort and lacks\ngeneralizability across diverse scenes. To overcome these limitations, this\npaper introduces a novel approach based on a learnable infinite Taylor Formula\nto model the temporal evolution of Gaussians. This method offers both the\nflexibility of an implicit network-based approach and the interpretability of\nexplicit polynomial functions, allowing for more robust and generalizable\nmodeling of Gaussian dynamics across various dynamic scenes. Extensive\nexperiments on dynamic novel view rendering tasks are conducted on public\ndatasets, demonstrating that the proposed method achieves state-of-the-art\nperformance in this domain. More information is available on our project\npage(https://ellisonking.github.io/TaylorGaussian).\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "CMuBTqgyQRY6_kT98_mXjdpvoeZm2TsUtcUr938xf7U",
  "pdfSize": "61372752"
}