{
  "id": "2412.01330",
  "title": "The \"LLM World of Words\" English free association norms generated by\n  large language models",
  "authors": "Katherine Abramski, Riccardo Improta, Giulio Rossetti, Massimo Stella",
  "authorsParsed": [
    [
      "Abramski",
      "Katherine",
      ""
    ],
    [
      "Improta",
      "Riccardo",
      ""
    ],
    [
      "Rossetti",
      "Giulio",
      ""
    ],
    [
      "Stella",
      "Massimo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 09:54:14 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733133254000,
  "abstract": "  Free associations have been extensively used in cognitive psychology and\nlinguistics for studying how conceptual knowledge is organized. Recently, the\npotential of applying a similar approach for investigating the knowledge\nencoded in LLMs has emerged, specifically as a method for investigating LLM\nbiases. However, the absence of large-scale LLM-generated free association\nnorms that are comparable with human-generated norms is an obstacle to this new\nresearch direction. To address this limitation, we create a new dataset of\nLLM-generated free association norms modeled after the \"Small World of Words\"\n(SWOW) human-generated norms consisting of approximately 12,000 cue words. We\nprompt three LLMs, namely Mistral, Llama3, and Haiku, with the same cues as\nthose in the SWOW norms to generate three novel comparable datasets, the \"LLM\nWorld of Words\" (LWOW). Using both SWOW and LWOW norms, we construct cognitive\nnetwork models of semantic memory that represent the conceptual knowledge\npossessed by humans and LLMs. We demonstrate how these datasets can be used for\ninvestigating implicit biases in humans and LLMs, such as the harmful gender\nstereotypes that are prevalent both in society and LLM outputs.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "halz1fZhs6fxCDQXvAafdqLGN9qoy1YZ02WlzqHvfAk",
  "pdfSize": "808518"
}