{
  "id": "2412.08982",
  "title": "FlexScatter: Predictive Scheduling and Adaptive Rateless Coding for\n  Wi-Fi Backscatter Communications in Dynamic Traffic Conditions",
  "authors": "Xin He, Jingwen Xie, Aohua Zhang, Weiwei Jiang, Yujun Zhu, Tad\n  Matsumoto",
  "authorsParsed": [
    [
      "He",
      "Xin",
      ""
    ],
    [
      "Xie",
      "Jingwen",
      ""
    ],
    [
      "Zhang",
      "Aohua",
      ""
    ],
    [
      "Jiang",
      "Weiwei",
      ""
    ],
    [
      "Zhu",
      "Yujun",
      ""
    ],
    [
      "Matsumoto",
      "Tad",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 06:32:11 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733985131000,
  "abstract": "  The potential of Wi-Fi backscatter communications systems is immense, yet\nchallenges such as signal instability and energy constraints impose performance\nlimits. This paper introduces FlexScatter, a Wi-Fi backscatter system using a\ndesigned scheduling strategy based on excitation prediction and rateless coding\nto enhance system performance. Initially, a Wi-Fi traffic prediction model is\nconstructed by analyzing the variability of the excitation source. Then, an\nadaptive transmission scheduling algorithm is proposed to address the low\nenergy consumption demands of backscatter tags, adjusting the transmission\nstrategy according to predictive analytics and taming channel conditions.\nFurthermore, leveraging the benefits of low-density parity-check (LDPC) and\nfountain codes, a novel coding and decoding algorithm is developed, which is\ntailored for dynamic channel conditions. Experimental validation shows that\nFlexScatter reduces bit error rates (BER) by up to 30%, improves energy\nefficiency by 7%, and increases overall system utility by 11%, compared to\nconventional methods. FlexScatter's ability to balance energy consumption and\ncommunication efficiency makes it a robust solution for future IoT applications\nthat rely on unpredictable Wi-Fi traffic.\n",
  "subjects": [
    "Computer Science/Networking and Internet Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "3FMQVk3K9t5Zb5FN1bdyBrJz-EL1b6-5x6ZX_G3O0UQ",
  "pdfSize": "941414"
}