{
  "id": "2412.12418",
  "title": "Entropy as a Design Principle in the Photosystem II Supercomplex",
  "authors": "Johanna L. Hall, Shiun-Jr Yang, David T. Limmer, and Graham R. Fleming",
  "authorsParsed": [
    [
      "Hall",
      "Johanna L.",
      ""
    ],
    [
      "Yang",
      "Shiun-Jr",
      ""
    ],
    [
      "Limmer",
      "David T.",
      ""
    ],
    [
      "Fleming",
      "Graham R.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 23:58:48 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734393528000,
  "abstract": "  Photosystem II (PSII) can achieve near-unity quantum efficiency of light\nharvesting in ideal conditions and can dissipate excess light energy as heat to\nprevent formation of reactive oxygen species under light stress. Understanding\nhow this pigment-protein complex accomplishes these opposing goals is a topic\nof great interest that has so far been explored primarily through the lens of\nthe system energetics. Despite PSII's known flat energy landscape, a thorough\nconsideration of the entropic effects on energy transfer in PSII is lacking. In\nthis work, we aim to discern the free energetic design principles underlying\nthe PSII energy transfer network. To accomplish this goal, we employ a\nstructure-based rate matrix and compute the free energy terms in time following\na specific initial excitation to discern how entropy and enthalpy drive\nensemble system dynamics. We find that the interplay between the entropy and\nenthalpy components differs among each protein subunit, which allows each\nsubunit to fulfill a unique role in the energy transfer network. This\nindividuality ensures PSII can accomplish efficient energy trapping in the RC,\neffective NPQ in the periphery, and robust energy trapping in the other-monomer\nRC if the same-monomer RC is closed. We also show that entropy, in particular,\nis a dynamically tunable feature of the PSII free energy landscape accomplished\nthrough regulation of LHCII binding. These findings help rationalize natural\nphotosynthesis and provide design principles for novel, more efficient solar\nenergy harvesting technologies.\n",
  "subjects": [
    "Physics/Chemical Physics",
    "Quantitative Biology/Biomolecules"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ieBWwB54JF7OLa2CNCEL1NJ0o9NWYnWpmHdNqOc_wgQ",
  "pdfSize": "4379207"
}