{"id":"2412.19723","title":"OS-Genesis: Automating GUI Agent Trajectory Construction via Reverse\n  Task Synthesis","authors":"Qiushi Sun, Kanzhi Cheng, Zichen Ding, Chuanyang Jin, Yian Wang,\n  Fangzhi Xu, Zhenyu Wu, Chengyou Jia, Liheng Chen, Zhoumianze Liu, Ben Kao,\n  Guohao Li, Junxian He, Yu Qiao, Zhiyong Wu","authorsParsed":[["Sun","Qiushi",""],["Cheng","Kanzhi",""],["Ding","Zichen",""],["Jin","Chuanyang",""],["Wang","Yian",""],["Xu","Fangzhi",""],["Wu","Zhenyu",""],["Jia","Chengyou",""],["Chen","Liheng",""],["Liu","Zhoumianze",""],["Kao","Ben",""],["Li","Guohao",""],["He","Junxian",""],["Qiao","Yu",""],["Wu","Zhiyong",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 16:21:58 GMT"}],"updateDate":"2024-12-30","timestamp":1735316518000,"abstract":"  Graphical User Interface (GUI) agents powered by Vision-Language Models\n(VLMs) have demonstrated human-like computer control capability. Despite their\nutility in advancing digital automation, a critical bottleneck persists:\ncollecting high-quality trajectory data for training. Common practices for\ncollecting such data rely on human supervision or synthetic data generation\nthrough executing pre-defined tasks, which are either resource-intensive or\nunable to guarantee data quality. Moreover, these methods suffer from limited\ndata diversity and significant gaps between synthetic data and real-world\nenvironments. To address these challenges, we propose OS-Genesis, a novel GUI\ndata synthesis pipeline that reverses the conventional trajectory collection\nprocess. Instead of relying on pre-defined tasks, OS-Genesis enables agents\nfirst to perceive environments and perform step-wise interactions, then\nretrospectively derive high-quality tasks to enable trajectory-level\nexploration. A trajectory reward model is then employed to ensure the quality\nof the generated trajectories. We demonstrate that training GUI agents with\nOS-Genesis significantly improves their performance on highly challenging\nonline benchmarks. In-depth analysis further validates OS-Genesis's efficiency\nand its superior data quality and diversity compared to existing synthesis\nmethods. Our codes, data, and checkpoints are available at\n\\href{https://qiushisun.github.io/OS-Genesis-Home/}{OS-Genesis Homepage}.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Computation and Language","Computer Science/Computer Vision and Pattern Recognition","Computer Science/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mwe8sjhDJpDHXVG4aloXTRd0XhDuq0bbtbZl5qd9RFg","pdfSize":"3223625"}