{
  "id": "2412.07425",
  "title": "Quantum correlations and metrological advantage among Unruh-DeWitt\n  detectors in de Sitter spacetime",
  "authors": "Samira Elghaayda and Asad Ali and M. Y. Abd-Rabbou and Mostafa Mansour\n  and Saif Al-Kuwari",
  "authorsParsed": [
    [
      "Elghaayda",
      "Samira",
      ""
    ],
    [
      "Ali",
      "Asad",
      ""
    ],
    [
      "Abd-Rabbou",
      "M. Y.",
      ""
    ],
    [
      "Mansour",
      "Mostafa",
      ""
    ],
    [
      "Al-Kuwari",
      "Saif",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 11:26:38 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733829998000,
  "abstract": "  A long-standing debate on Gibbons-Hawking (GH) decoherence centers on its\nunclear thermal nature. In this work, we investigate the robustness of quantum\nFisher information (QFI) and local quantum uncertainty (LQU) in the presence of\nGH decoherence, using free-falling Unruh-DeWitt (UDW) detectors in de Sitter\nspacetime (dS-ST). The UDW detectors interact with a massless scalar field in\ndS-ST and are modeled as open quantum systems, with the field acting as the\nenvironment for which we use a master equation to describe their evolution. Our\nanalysis investigates the roles of energy spacing, GH temperature, initial\nstate preparation, and various de Sitter-invariant vacuum sectors on the\noptimization of QFI and LQU. We find that the optimal values of QFI and LQU\ndepend on the selected de Sitter-invariant vacuum sector and increase with\nlarger energy spacing. Our findings reveal that QFI exhibits resilience to GH\ndecoherence, maintaining a pronounced local peak across a wider range of\nparameters. This robustness can be further enhanced through strategic initial\nstate preparation and increased energy spacing, resulting in a higher maximum\nQFI value even under significant environmental decoherence. Our results\nunderscore the critical role of GH thermality in governing QFI and LQU,\noffering valuable insights for advances in relativistic quantum metrology\n(RQM).\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zYLxh1vwSAMCIpnDJIAGmN3uqp2lSjSWfmlI0yu6uEY",
  "pdfSize": "875688"
}