{"id":"2412.03210","title":"Parametric PerceptNet: A bio-inspired deep-net trained for Image Quality\n  Assessment","authors":"Jorge Vila-Tom\\'as, Pablo Hern\\'andez-C\\'amara, Valero Laparra,\n  Jes\\'us Malo","authorsParsed":[["Vila-Tomás","Jorge",""],["Hernández-Cámara","Pablo",""],["Laparra","Valero",""],["Malo","Jesús",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 10:55:44 GMT"},{"version":"v2","created":"Mon, 17 Feb 2025 11:53:44 GMT"}],"updateDate":"2025-02-18","timestamp":1733309744000,"abstract":"  Human vision models are at the core of image processing. For instance,\nclassical approaches to the problem of image quality are based on models that\ninclude knowledge about human vision. However, nowadays, deep learning\napproaches have obtained competitive results by simply approaching this problem\nas regression of human decisions, and training an standard network on\nhuman-rated datasets. These approaches have the advantages of being easily\nadaptable to a particular problem and they fit very efficiently when data is\navailable. However, mainly due to the excess of parameters, they have the\nproblems of lack of interpretability, and over-fitting. Here we propose a\nvision model that combines the best of both worlds by using a parametric neural\nnetwork architecture. We parameterize the layers to have bioplausible\nfunctionality, and provide a set of bioplausible parameters. We analyzed\ndifferent versions of the model and compared it with the non-parametric\nversion. The parametric models achieve a three orders of magnitude reduction in\nthe number of parameters without suffering in regression performance.\nFurthermore, we show that the parametric models behave better during training\nand are easier to interpret as vision models. Interestingly, we find that, even\ninitialized with bioplausible trained for regression using human rated\ndatasets, which we call the feature-spreading problem. This suggests that the\ndeep learning approach is inherently flawed, and emphasizes the need to\nevaluate and train models beyond regression.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mKqZZUCKA441kDCTB5i2MxK7Q1EWPiCMdvbjmsIvtz4","pdfSize":"7543482"}