{"id":"2412.11721","title":"Infrared properties of Planetary Nebulae with PG1159 central stars","authors":"C. Muthumariappan, K. Khushbu, V. Kerni","authorsParsed":[["Muthumariappan","C.",""],["Khushbu","K.",""],["Kerni","V.",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 12:44:42 GMT"},{"version":"v2","created":"Wed, 18 Dec 2024 05:33:15 GMT"}],"updateDate":"2024-12-19","timestamp":1734353082000,"abstract":"  We study the properties of 26 PNe with PG1159-type central stars known till\ndate and compare them with the properties of PNe having [WR], $wels$ and\nhydrogen-rich central stars published earlier. We use archival photometric\nmeasurements of $2MASS$ for near-IR analysis and $WISE$ and $IRAS$ data for\nmid- and far-IR analysis and derive the IR properties of PG1159-PNe. We analyze\nthe IR colour-colour diagrams of PG1159-PNe and compare them with the other\nthree groups of PNe. Similar to the [WR]-PNe, many PG1159-PNe also show large\namount of near-IR emission from the hot-dust component but their AGB dust is\nrelatively cooler. We also report here the dust colour temperatures, dust\nmasses, dust-to-gas mass ratios, IR luminosities and IR excess of PG1159-PNe\nand plot them against their surface H$\\beta$ brightness (age) and compare them\nwith the distribution of other groups of PNe. The IR luminosity and dust\ntemperature show strong correlation with surface H$\\beta$ brightness, however,\nthe dust-to-gas mass ratio and IR excess do not show any trend. While the mean\ndust mass has a lower value for PG1159-PNe, in compared to other groups, the\naverage dust-to-gas mass ratio is found to be marginally larger for PG1159-PNe.\nAn analysis of the number distribution of different groups of PNe against\nsurface H$\\beta$ brightness shows that a) younger [WR]-, $wels$- and normal-PNe\nhave a similar distribution indicating that they all have evolved from the AGB\nin a similar way, b) while there is an overlap of surface H$\\beta$ brightness\nbetween [WR]- and PG1159-PNe, showing an evolutionary connection between them,\nthere exists a significant gap between the values derived for $wels$- and\nPG1159-PNe.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"U86BhXwbt87PdF6jwAoIPu62zV5MUIYfItDaL1ftUUM","pdfSize":"452625"}