{"id":"2412.01732","title":"Quasi-optimal sampling from Gibbs states via non-commutative optimal\n  transport metrics","authors":"\\'Angela Capel, Paul Gondolf, Jan Kochanowski, Cambyse Rouz\\'e","authorsParsed":[["Capel","Ángela",""],["Gondolf","Paul",""],["Kochanowski","Jan",""],["Rouzé","Cambyse",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 17:25:24 GMT"}],"updateDate":"2024-12-03","timestamp":1733160324000,"abstract":"  We study the problem of sampling from and preparing quantum Gibbs states of\nlocal commuting Hamiltonians on hypercubic lattices of arbitrary dimension. We\nprove that any such Gibbs state which satisfies a clustering condition that we\ncoin decay of matrix-valued quantum conditional mutual information (MCMI) can\nbe quasi-optimally prepared on a quantum computer. We do this by controlling\nthe mixing time of the corresponding Davies evolution in a normalized quantum\nWasserstein distance of order one. To the best of our knowledge, this is the\nfirst time that such a non-commutative transport metric has been used in the\nstudy of quantum dynamics, and the first time quasi-rapid mixing is implied by\nsolely an explicit clustering condition. Our result is based on a weak\napproximate tensorization and a weak modified logarithmic Sobolev inequality\nfor such systems, as well as a new general weak transport cost inequality. If\nwe furthermore assume a constraint on the local gap of the thermalizing\ndynamics, we obtain rapid mixing in trace distance for interactions beyond the\nrange of two, thereby extending the state-of-the-art results that only cover\nthe nearest neighbor case. We conclude by showing that systems that admit\neffective local Hamiltonians, like quantum CSS codes at high temperature,\nsatisfy this MCMI decay and can thus be efficiently prepared and sampled from.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Statistical Mechanics","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"koxp_O5P7jOIqH0ZYJhwqplFzyKqEPbEB_WhTiGXzQM","pdfSize":"920220"}