{
  "id": "2412.11226",
  "title": "Non-equilibrium dynamics in geometrically frustrated spin glass\n  Bi$_2$Fe$_3$GaO$_9$ with a Cairo lattice",
  "authors": "Desislava Mihaylova, Xinglong Chen, Daniel Phelan, Stephan Rosenkranz,\n  Yu Li",
  "authorsParsed": [
    [
      "Mihaylova",
      "Desislava",
      ""
    ],
    [
      "Chen",
      "Xinglong",
      ""
    ],
    [
      "Phelan",
      "Daniel",
      ""
    ],
    [
      "Rosenkranz",
      "Stephan",
      ""
    ],
    [
      "Li",
      "Yu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 15:49:00 GMT"
    }
  ],
  "updateDate": "2024-12-22",
  "timestamp": 1734277740000,
  "abstract": "  We have explored the relaxation process of the spin glass phase in\nBi$_2$Fe$_3$GaO$_9$, a geometrically frustrated magnet with a unique structure\nconsisting of pentagonal building blocks known as the Cairo lattice. Using dc\nmagnetization measurements on single crystals, we estimate the relaxation time\nacross various temperatures and fields. Our results indicate that the\nrelaxation time of Bi$_2$Fe$_3$GaO$_9$ follows the Arrhenius law as a function\nof temperature but remains relatively constant as the applied magnetic field\nvaries. Further, through a carefully designed protocol, we observe significant\nrejuvenation and memory effects. Remarkably, the memory effects in\nBi$_2$Fe$_3$GaO$_9$ are found to be more similar to those observed in classical\nspin glasses rather than in spin jamming systems, both in terms of the\nmagnitude of the memory effect and the value of the exponent that describes the\nrelaxation behavior. Our findings suggest that Bi$_2$Fe$_3$GaO$_9$ provides an\nexcellent platform for investigating the time-dependent evolution of underlying\nmagnetism using neutron scattering, paving the way for future research.\n",
  "subjects": [
    "Condensed Matter/Disordered Systems and Neural Networks",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SgWqp-I_Tp2u_H1PbqTQ7QTFw7Q-pNt9ve8tpQmhGHA",
  "pdfSize": "759209"
}