{
  "id": "2412.14244",
  "title": "Blinded Mock Data Challenge for Gravitational-Wave Cosmology-I:\n  Assessing the Robustness of Methods Using Binary Black Holes Mass Spectrum",
  "authors": "Aman Agarwal, Ulyana Dupletsa, Konstantin Leyde, Suvodip Mukherjee,\n  Benoit Revenu, Juan Esteban Rivera, Antonio Enea Romano, Mohit Raj Sah,\n  Sergio Vallejo-Pena, Adrian Avendano, Freija Beirnaert, Gergely Dalya, Miguel\n  Cifuentes Espitia, Christos Karathanasis, Santiago Moreno-Gonzalez, Lucas\n  Quiceno, Federico Stachurski, Juan Garcia-Bellido, Rachel Gray, Nicola\n  Tamanini, Cezary Turski",
  "authorsParsed": [
    [
      "Agarwal",
      "Aman",
      ""
    ],
    [
      "Dupletsa",
      "Ulyana",
      ""
    ],
    [
      "Leyde",
      "Konstantin",
      ""
    ],
    [
      "Mukherjee",
      "Suvodip",
      ""
    ],
    [
      "Revenu",
      "Benoit",
      ""
    ],
    [
      "Rivera",
      "Juan Esteban",
      ""
    ],
    [
      "Romano",
      "Antonio Enea",
      ""
    ],
    [
      "Sah",
      "Mohit Raj",
      ""
    ],
    [
      "Vallejo-Pena",
      "Sergio",
      ""
    ],
    [
      "Avendano",
      "Adrian",
      ""
    ],
    [
      "Beirnaert",
      "Freija",
      ""
    ],
    [
      "Dalya",
      "Gergely",
      ""
    ],
    [
      "Espitia",
      "Miguel Cifuentes",
      ""
    ],
    [
      "Karathanasis",
      "Christos",
      ""
    ],
    [
      "Moreno-Gonzalez",
      "Santiago",
      ""
    ],
    [
      "Quiceno",
      "Lucas",
      ""
    ],
    [
      "Stachurski",
      "Federico",
      ""
    ],
    [
      "Garcia-Bellido",
      "Juan",
      ""
    ],
    [
      "Gray",
      "Rachel",
      ""
    ],
    [
      "Tamanini",
      "Nicola",
      ""
    ],
    [
      "Turski",
      "Cezary",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 19:00:01 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734548401000,
  "abstract": "  Gravitational Wave (GW) sources are standard sirens that provide an\nindependent way to map the cosmic expansion history by combining with an\nindependent redshift measurement either from an electromagnetic counterpart for\na bright siren or using different statistical techniques for dark sirens. In\nthis analysis, we perform the first Blinded Mock Data Challenge (Blinded-MDC)\nto test the robustness in inferring the value of Hubble constant $H_0$ for a\ndark siren technique which depends on astrophysical mass distribution of Binary\nBlack Holes (BBHs). We have considered different analysis setups for the\nBlinded-MDC to test both statistical and systematic uncertainties and\ndemonstrate the capabilities in inferring $H_0$ with detector sensitivity as\nper the fourth observation run of LIGO-Virgo-KAGRA. We find that when the\nastrophysical population of BBHs matches with the underlying assumption of the\nmodel, a cosmological pipeline can recover the injected parameters using the\nobserved mass distribution. However, when the mock mass distribution of the\nastrophysical population depends slightly on redshift and one is ignorant about\nit in analyzing the data, it can cause a systematic discrepancy in the inferred\nvalue of $H_0$ by about $1.5\\sigma$, above the statistical fluctuations due to\nnoise and a limited number of events. The discrepancy in $H_0$ is arising due\nto astrophysical mis-modeling, and in the future, elaborate studies will be\nrequired to mitigate systematic uncertainties due to unknown astrophysical\npopulations of BBHs. This MDC framework sets the road map for inspecting the\nprecision and accuracy of standard siren cosmology and provides the first\ninsight into the robustness of the population-dependent cosmology inference in\na blinded analysis setup.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "ELf4-pW0Q4URFl6-BDCmluOHLVIsKxqqfzszMCxWShE",
  "pdfSize": "17335687"
}