{
  "id": "2412.10161",
  "title": "Data Integration with Fusion Searchlight: Classifying Brain States from\n  Resting-state fMRI",
  "authors": "Simon Wein, Marco Riebel, Lisa-Marie Brunner, Caroline Nothdurfter,\n  Rainer Rupprecht, Jens V. Schwarzbach",
  "authorsParsed": [
    [
      "Wein",
      "Simon",
      ""
    ],
    [
      "Riebel",
      "Marco",
      ""
    ],
    [
      "Brunner",
      "Lisa-Marie",
      ""
    ],
    [
      "Nothdurfter",
      "Caroline",
      ""
    ],
    [
      "Rupprecht",
      "Rainer",
      ""
    ],
    [
      "Schwarzbach",
      "Jens V.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 14:24:52 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734099892000,
  "abstract": "  Spontaneous neural activity observed in resting-state fMRI is characterized\nby complex spatio-temporal dynamics. Different measures related to local and\nglobal brain connectivity and fluctuations in low-frequency amplitudes can\nquantify individual aspects of these neural dynamics. Even though such measures\nare derived from the same functional signals, they are often evaluated\nseparately, neglecting their interrelations and potentially reducing the\nanalysis sensitivity. In our study, we present a fusion searchlight (FuSL)\nframework to combine the complementary information contained in different\nresting-state fMRI metrics and demonstrate how this can improve the decoding of\nbrain states. Moreover, we show how explainable AI allows us to reconstruct the\ndifferential impact of each metric on the decoding, which additionally\nincreases spatial specificity of searchlight analysis. In general, this\nframework can be adapted to combine information derived from different imaging\nmodalities or experimental conditions, offering a versatile and interpretable\ntool for data fusion in neuroimaging.\n",
  "subjects": [
    "Quantitative Biology/Neurons and Cognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jh4qH8ZKcc_ID3YqgXYbZP2hGoUBcUEpVTRn0ICe07A",
  "pdfSize": "9576136"
}