{"id":"2412.02945","title":"Detection of Multiple Influential Observations on Model Selection","authors":"Dongliang Zhang, Masoud Asgharian, Martin A. Lindquist","authorsParsed":[["Zhang","Dongliang",""],["Asgharian","Masoud",""],["Lindquist","Martin A.",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 01:22:18 GMT"}],"updateDate":"2024-12-05","timestamp":1733275338000,"abstract":"  Outlying observations are frequently encountered in a wide spectrum of\nscientific domains, posing significant challenges for the generalizability of\nstatistical models and the reproducibility of downstream analysis. These\nobservations can be identified through influential diagnosis, which refers to\nthe detection of observations that are unduly influential on diverse facets of\nstatistical inference. To date, methods for identifying observations\ninfluencing the choice of a stochastically selected submodel have been\nunderdeveloped, especially in the high-dimensional setting where the number of\npredictors p exceeds the sample size n. Recently we proposed an improved\ndiagnostic measure to handle this setting. However, its distributional\nproperties and approximations have not yet been explored. To address this\nshortcoming, the notion of exchangeability is revived, and used to determine\nthe exact finite- and large-sample distributions of our assessment metric. This\nforms the foundation for the introduction of both parametric and non-parametric\napproaches for its approximation and the establishment of thresholds for\ndiagnosis. The resulting framework is extended to logistic regression models,\nfollowed by a simulation study conducted to assess the performance of various\ndetection procedures. Finally the framework is applied to data from an fMRI\nstudy of thermal pain, with the goal of identifying outlying subjects that\ncould distort the formulation of statistical models using functional brain\nactivity in predicting physical pain ratings. Both linear and logistic\nregression models are used to demonstrate the benefits of detection and compare\nthe performances of different detection procedures. In particular, two\nadditional influential observations are identified, which are not discovered by\nprevious studies.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5U0ipQM57OFE3i3VI8E5lv6CzhOvCTGNd0_2bAMaWA0","pdfSize":"6431044"}