{
  "id": "2412.06187",
  "title": "Investigating lower limit of metallicity for Galactic thin disk",
  "authors": "Guozhen Hu, Zhengyi Shao, Erbil Gugercinoglu, Wenyuan Cui",
  "authorsParsed": [
    [
      "Hu",
      "Guozhen",
      ""
    ],
    [
      "Shao",
      "Zhengyi",
      ""
    ],
    [
      "Gugercinoglu",
      "Erbil",
      ""
    ],
    [
      "Cui",
      "Wenyuan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 03:53:27 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733716407000,
  "abstract": "  We explore the metal-poor regime of the Galactic disk on the distribution of\nstars in the [$\\alpha$/M]-$V_{\\phi}$ plane, to identify the most metal-poor\nthin disk (MPTnD) stars belonging to the low-$\\alpha$ sequence. Chemical\nabundances and velocities of sample stars are either taken or derived from\nAPOGEE DR17 and Gaia DR3 catalogs. We find the existence of a well-separated\nextension of the kinematically thin disk stars in the metallicity range of -1.2\n$<$[M/H]$<$ -0.8 dex. Based on two-by-two distributions of [Mg/Mn], [Al/Fe] and\n[C+N/Fe], we further confirmed 56 high-possibility metal-poor thin disk\n(HP-MPTnD) giant stars and suggested the lower metallicity limit of the thin\ndisk below -0.95 dex. A comparative analysis of HP-MPTnD sample with other\nGalactic components revealed its chemo-dynamical similarities with canonical\nthin disk stars. These low-$\\alpha$ metal-poor stars are predominantly located\nin the outer disk region and formed in the early stage of the formation of thin\ndisk. Their existence provides compelling support for the two-infall model of\nthe Milky way's disk formation. Moreover, these stars impose observational\nconstraints on the timing and metallicity of the second gas infall event.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "jIj7AGqetqojLdk3kSis65ceFU9L3zJkI0M_N8w1FXo",
  "pdfSize": "5332682"
}