{
  "id": "2412.17026",
  "title": "In-Memory Massive MIMO Linear Detector Circuit with Extremely High\n  Energy Efficiency and Strong Memristive Conductance Deviation Robustness",
  "authors": "Jia-Hui Bi, Shaoshi Yang, Ping Zhang, Sheng Chen",
  "authorsParsed": [
    [
      "Bi",
      "Jia-Hui",
      ""
    ],
    [
      "Yang",
      "Shaoshi",
      ""
    ],
    [
      "Zhang",
      "Ping",
      ""
    ],
    [
      "Chen",
      "Sheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 14:04:42 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734876282000,
  "abstract": "  The memristive crossbar array (MCA) has been successfully applied to\naccelerate matrix computations of signal detection in massive multiple-input\nmultiple-output (MIMO) systems. However, the unique property of massive MIMO\nchannel matrix makes the detection performance of existing MCA-based detectors\nsensitive to conductance deviations of memristive devices, and the conductance\ndeviations are difficult to be avoided. In this paper, we propose an MCA-based\ndetector circuit, which is robust to conductance deviations, to compute massive\nMIMO zero forcing and minimum mean-square error algorithms. The proposed\ndetector circuit comprises an MCA-based matrix computing module, utilized for\nprocessing the small-scale fading coefficient matrix, and amplifier circuits\nbased on operational amplifiers (OAs), utilized for processing the large-scale\nfading coefficient matrix. We investigate the impacts of the open-loop gain of\nOAs, conductance mapping scheme, and conductance deviation level on detection\nperformance and demonstrate the performance superiority of the proposed\ndetector circuit over the conventional MCA-based detector circuit. The energy\nefficiency of the proposed detector circuit surpasses that of a traditional\ndigital processor by several tens to several hundreds of times.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "hCd8rK0V2XQpgnW80lx2zjEP7uEE76AZLq52aExxphQ",
  "pdfSize": "1092273"
}