{
  "id": "2412.06487",
  "title": "Improving text-conditioned latent diffusion for cancer pathology",
  "authors": "Aakash Madhav Rao, Debayan Gupta",
  "authorsParsed": [
    [
      "Rao",
      "Aakash Madhav",
      ""
    ],
    [
      "Gupta",
      "Debayan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 13:38:19 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733751499000,
  "abstract": "  The development of generative models in the past decade has allowed for\nhyperrealistic data synthesis. While potentially beneficial, this synthetic\ndata generation process has been relatively underexplored in cancer\nhistopathology. One algorithm for synthesising a realistic image is diffusion;\nit iteratively converts an image to noise and learns the recovery process from\nthis noise [Wang and Vastola, 2023]. While effective, it is highly\ncomputationally expensive for high-resolution images, rendering it infeasible\nfor histopathology. The development of Variational Autoencoders (VAEs) has\nallowed us to learn the representation of complex high-resolution images in a\nlatent space. A vital by-product of this is the ability to compress\nhigh-resolution images to space and recover them lossless. The marriage of\ndiffusion and VAEs allows us to carry out diffusion in the latent space of an\nautoencoder, enabling us to leverage the realistic generative capabilities of\ndiffusion while maintaining reasonable computational requirements. Rombach et\nal. [2021b] and Yellapragada et al. [2023] build foundational models for this\ntask, paving the way to generate realistic histopathology images. In this\npaper, we discuss the pitfalls of current methods, namely [Yellapragada et al.,\n2023] and resolve critical errors while proposing improvements along the way.\nOur methods achieve an FID score of 21.11, beating its SOTA counterparts in\n[Yellapragada et al., 2023] by 1.2 FID, while presenting a train-time GPU\nmemory usage reduction of 7%.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "YOb11Y9eqGBMRPDIQvUltrjH_YKM7DMLLKlxrfS8hSU",
  "pdfSize": "1651379"
}