{
  "id": "2412.06763",
  "title": "New Ionization Models and the Shocking Nitrogen Excess at z > 5",
  "authors": "Sophia R. Flury, Karla Z. Arellano-C\\'ordova, Edward C. Moran, Alaina\n  Einsig",
  "authorsParsed": [
    [
      "Flury",
      "Sophia R.",
      ""
    ],
    [
      "Arellano-Córdova",
      "Karla Z.",
      ""
    ],
    [
      "Moran",
      "Edward C.",
      ""
    ],
    [
      "Einsig",
      "Alaina",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 18:52:54 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733770374000,
  "abstract": "  The new era of galaxy evolution studies hearkened in by JWST has led to the\ndiscovery of z > 5 galaxies exhibiting excess nitrogen with log(N/O)~1 dex or\nmore than expected from log(N/O) vs 12+log(O/H) trends in the local Universe. A\nvariety of novel enrichment pathways have been presented to explain the\napparent nitrogen excess, invoking a wide range of processes from very massive\nstars to stripped binaries to fine-tuned star-formation histories. However,\nunderstanding the excitation mechanism responsible for the observed nebular\nemission is necessary to accurately infer chemical abundances. As of yet, the\nionization sources of these galaxies have not been thoroughly explored, with\nradiative shocks left out of the picture. We present a suite of homogeneous\nexcitation models for star-forming galaxies, active galactic nuclei, and\nradiative shocks, with which we explore possible explanations for the apparent\nnitrogen excess. We propose new BPT-style diagnostics to classify galaxies at z\n> 5, finding that, when combined with O iii] 1660,66 and He ii 1640, N iii]\n1747-54 / C iii] 1907,09 best selects shock-dominated galaxies while N iv]\n1483,86 / C iii] 1907,09 best distinguishes between active black holes and star\nforming galaxies. From our diagnostics, we find that slow/intermediate\nradiative shocks (v = 75-150 km/s) are most consistent with observed UV\nemission line flux ratios in nitrogen-bright galaxies. Accounting for the\neffects of shocks can bring nitrogen estimates into better agreement with\nabundance patterns observed in the local Universe and may be attributable to\nWolf Rayet populations actively enriching these galaxies with nitrogen and\npossibly driving winds responsible for these shocks.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "8uiZafaY-Hq0fkB-IWOiwzXfBKGyxri8eMoIz2MTkpE",
  "pdfSize": "1556623"
}