{
  "id": "2412.17402",
  "title": "Magnetic helicity fluxes in dynamos from rotating inhomogeneous\n  turbulence",
  "authors": "Axel Brandenburg, Ethan T. Vishniac",
  "authorsParsed": [
    [
      "Brandenburg",
      "Axel",
      ""
    ],
    [
      "Vishniac",
      "Ethan T.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 09:07:32 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734944852000,
  "abstract": "  We analyze direct numerical simulations of large-scale dynamos in\ninhomogeneous nonhelically-driven rotating turbulence with and without shear.\nThe forcing is modulated so that the turbulent intensity peaks in the middle of\nthe computational box and drops to nearly zero at the two ends above and below\nthe midplane. A large-scale dynamo is driven by an $\\alpha$ effect of opposite\nsigns between the two hemispheres. In the presence of shear, the hemispheric\nmagnetic helicity flux from small-scale fields becomes important and can even\novercompensate for the magnetic helicity transferred by the $\\alpha$ effect\nbetween large and small scales. This effect has not previously been observed in\nnon-shearing simulations. Our numerical simulations show that the hemispheric\nmagnetic helicity fluxes are nearly independent of the magnetic Reynolds\nnumber, but those between large and small scales, and the consequent dynamo\neffect, are still found to decrease with increasing Reynolds number -- just\nlike in nonshearing dynamos. However, in contrast to nonshearing dynamos, where\nthe generated mean magnetic field declines with increasing magnetic Reynolds\nnumber, it is now found to remain independent of it. This suggests that\ncatastrophic dynamo quenching is alleviated by the shear-induced hemispheric\nsmall-scale magnetic helicity fluxes that can even overcompensate the fluxes\nbetween large and small scales and thereby cause resistive contributions.\n",
  "subjects": [
    "Physics/Plasma Physics",
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/Solar and Stellar Astrophysics",
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "MX5zEIiSxfl2JWmYaJe5s97xWwilTHFkExD6MuWN9ts",
  "pdfSize": "4761525"
}