{"id":"2412.19863","title":"Boosting Perovskite Solar Cell Stability: Dual Protection with Ultrathin\n  Plasma Polymer Passivation Layers","authors":"Mahmoud Nabil, Lidia Contreras-Bernal, Gloria P. Moreno-Martinez, Jose\n  Obrero-Perez, Javier Castillo-Seoane, Juan A. Anta, Gerko Oskam, Paul Pistor,\n  Ana Borr\\'as, Juan R. Sanchez-Valencia, Angel Barranco","authorsParsed":[["Nabil","Mahmoud",""],["Contreras-Bernal","Lidia",""],["Moreno-Martinez","Gloria P.",""],["Obrero-Perez","Jose",""],["Castillo-Seoane","Javier",""],["Anta","Juan A.",""],["Oskam","Gerko",""],["Pistor","Paul",""],["Borrás","Ana",""],["Sanchez-Valencia","Juan R.",""],["Barranco","Angel",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 11:16:08 GMT"}],"updateDate":"2024-12-31","timestamp":1735211768000,"abstract":"  Metal halide perovskite solar cells (MHPSCs) hold great promise related to\ntheir high efficiency and low fabrication costs, but their long-term stability\nunder environmental conditions remains a major challenge. In this study, we\ndemonstrate an effective protection strategy to enhance the stability of MHPSCs\nthrough the incorporation of a double passivation layer based on an\nadamantane-based plasma polymer (ADA) at both the electron transport layer\n(ETL)/perovskite and perovskite/hole transport layer (HTL) interfaces. Our\nresults show that the implemented ADA deposition technique is compatible with\ndelicate substrates such as perovskites thin films, as their optical,\nmorphological and optoelectronic properties are unaltered upon ADA deposition.\nAt the same time, it provides effective protection to the perovskite material\nin high humidity environments. The ADA-double passivation not only reduces the\nformation of mobile ionic defects that cause additional recombination, but also\nsignificantly reduces humidity-induced degradation and mitigates the\nphotocatalytic degradation caused by TiO2 under UV exposure. Stability tests\nperformed under 100% relative humidity and continuous AM 1.5G illumination\n(ISOS-L-1) show that ADA dual passivated devices retained 80% of their initial\nefficiency after 4000 minutes, while reference samples dropped to 30%. The\nenhanced performance of ADA-passivated cells is attributed to protective nature\nof the plasma polymer layer resulting in a preservation of photocurrent and the\nprevention of new recombination routes. This dual passivation strategy offers a\npromising route to improve the environmental stability of PSCs and extend their\noperational lifetime.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"SiN8u67Y1fsPP5O0N8cBzPDToGRFWX5NNftVXdA990s","pdfSize":"1306720"}