{
  "id": "2412.11088",
  "title": "Seeing the Forest and the Trees: Solving Visual Graph and Tree Based\n  Data Structure Problems using Large Multimodal Models",
  "authors": "Sebastian Gutierrez, Irene Hou, Jihye Lee, Kenneth Angelikas, Owen\n  Man, Sophia Mettille, James Prather, Paul Denny, Stephen MacNeil",
  "authorsParsed": [
    [
      "Gutierrez",
      "Sebastian",
      ""
    ],
    [
      "Hou",
      "Irene",
      ""
    ],
    [
      "Lee",
      "Jihye",
      ""
    ],
    [
      "Angelikas",
      "Kenneth",
      ""
    ],
    [
      "Man",
      "Owen",
      ""
    ],
    [
      "Mettille",
      "Sophia",
      ""
    ],
    [
      "Prather",
      "James",
      ""
    ],
    [
      "Denny",
      "Paul",
      ""
    ],
    [
      "MacNeil",
      "Stephen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 07:15:19 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734246919000,
  "abstract": "  Recent advancements in generative AI systems have raised concerns about\nacademic integrity among educators. Beyond excelling at solving programming\nproblems and text-based multiple-choice questions, recent research has also\nfound that large multimodal models (LMMs) can solve Parsons problems based only\non an image. However, such problems are still inherently text-based and rely on\nthe capabilities of the models to convert the images of code blocks to their\ncorresponding text. In this paper, we further investigate the capabilities of\nLMMs to solve graph and tree data structure problems based only on images. To\nachieve this, we computationally construct and evaluate a novel benchmark\ndataset comprising 9,072 samples of diverse graph and tree data structure tasks\nto assess the performance of the GPT-4o, GPT-4v, Gemini 1.5 Pro, Gemini 1.5\nFlash, Gemini 1.0 Pro Vision, and Claude 3 model families. GPT-4o and Gemini\n1.5 Flash performed best on trees and graphs respectively. GPT-4o achieved\n87.6% accuracy on tree samples, while Gemini 1.5 Flash, achieved 56.2% accuracy\non graph samples. Our findings highlight the influence of structural and visual\nvariations on model performance. This research not only introduces an LMM\nbenchmark to facilitate replication and further exploration but also\nunderscores the potential of LMMs in solving complex computing problems, with\nimportant implications for pedagogy and assessment practices.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "37USAbB9HLYw2jlzU8G73I0NorNQt9YjXnuwNxq9X4A",
  "pdfSize": "11091100"
}