{"id":"2412.17053","title":"DR-Encoder: Encode Low-rank Gradients with Random Prior for Large\n  Language Models Differentially Privately","authors":"Huiwen Wu, Deyi Zhang, Xiaohan Li, Xiaogang Xu, Jiafei Wu, Zhe Liu","authorsParsed":[["Wu","Huiwen",""],["Zhang","Deyi",""],["Li","Xiaohan",""],["Xu","Xiaogang",""],["Wu","Jiafei",""],["Liu","Zhe",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 15:06:09 GMT"}],"updateDate":"2024-12-24","timestamp":1734879969000,"abstract":"  The emergence of the Large Language Model (LLM) has shown their superiority\nin a wide range of disciplines, including language understanding and\ntranslation, relational logic reasoning, and even partial differential\nequations solving. The transformer is the pervasive backbone architecture for\nthe foundation model construction. It is vital to research how to adjust the\nTransformer architecture to achieve an end-to-end privacy guarantee in LLM\nfine-tuning. In this paper, we investigate three potential information leakage\nduring a federated fine-tuning procedure for LLM (FedLLM). Based on the\npotential information leakage, we provide an end-to-end privacy guarantee\nsolution for FedLLM by inserting two-stage randomness. The first stage is to\ntrain a gradient auto-encoder with a Gaussian random prior based on the\nstatistical information of the gradients generated by local clients. The second\nstage is to fine-tune the overall LLM with a differential privacy guarantee by\nadopting appropriate Gaussian noises. We show the efficiency and accuracy gains\nof our proposed method with several foundation models and two popular\nevaluation benchmarks. Furthermore, we present a comprehensive privacy analysis\nwith Gaussian Differential Privacy (GDP) and Renyi Differential Privacy (RDP).\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"CdRUc4OtfU68tjkd7cLHxKkz0Jwm4TuCr2MgJv6UjhQ","pdfSize":"4773361"}