{
  "id": "2412.03203",
  "title": "A Foundation for Synthetic Stone Duality",
  "authors": "Felix Cherubini, Thierry Coquand, Freek Geerligs and Hugo Moeneclaey",
  "authorsParsed": [
    [
      "Cherubini",
      "Felix",
      ""
    ],
    [
      "Coquand",
      "Thierry",
      ""
    ],
    [
      "Geerligs",
      "Freek",
      ""
    ],
    [
      "Moeneclaey",
      "Hugo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 10:42:13 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733308933000,
  "abstract": "  The language of homotopy type theory has proved to be appropriate as an\ninternal language for various higher toposes, for example with Synthetic\nAlgebraic Geometry for the Zariski topos. In this paper we apply such\ntechniques to the higher topos corresponding to the light condensed sets of\nDustin Clausen and Peter Scholze. This seems to be an appropriate setting to\ndevelop synthetic topology, similar to the work of Mart\\'in Escard\\'o. To\nreason internally about light condensed sets, we use homotopy type theory\nextended with 4 axioms. Our axioms are strong enough to prove Markov's\nprinciple, LLPO and the negation of WLPO. We also define a type of open\npropositions, inducing a topology on any type. This leads to a synthetic\ntopological study of (second countable) Stone and compact Hausdorff spaces.\nIndeed all functions are continuous in the sense that they respect this induced\ntopology, and this topology is as expected for these classes of types. For\nexample, any map from the unit interval to itself is continuous in the usual\nepsilon-delta sense. We also use the synthetic homotopy theory given by the\nhigher types of homotopy type theory to define and work with cohomology. As an\napplication, we prove Brouwer's fixed-point theorem internally.\n",
  "subjects": [
    "Mathematics/Logic"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "kdmn4TeG782jK2oECnC8_QUISz5TRt1zut4xURO3POc",
  "pdfSize": "332041"
}