{
  "id": "2412.04780",
  "title": "Anomaly Detection and Classification in Knowledge Graphs",
  "authors": "Asara Senaratne, Peter Christen, Pouya Omran, Graham Williams",
  "authorsParsed": [
    [
      "Senaratne",
      "Asara",
      ""
    ],
    [
      "Christen",
      "Peter",
      ""
    ],
    [
      "Omran",
      "Pouya",
      ""
    ],
    [
      "Williams",
      "Graham",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 05:03:10 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733461390000,
  "abstract": "  Anomalies such as redundant, inconsistent, contradictory, and deficient\nvalues in a Knowledge Graph (KG) are unavoidable, as these graphs are often\ncurated manually, or extracted using machine learning and natural language\nprocessing techniques. Therefore, anomaly detection is a task that can enhance\nthe quality of KGs. In this paper, we propose SEKA (SEeking Knowledge graph\nAnomalies), an unsupervised approach for the detection of abnormal triples and\nentities in KGs. SEKA can help improve the correctness of a KG whilst retaining\nits coverage. We propose an adaption of the Path Rank Algorithm (PRA), named\nthe Corroborative Path Rank Algorithm (CPRA), which is an efficient adaptation\nof PRA that is customized to detect anomalies in KGs. Furthermore, we also\npresent TAXO (TAXOnomy of anomaly types in KGs), a taxonomy of possible anomaly\ntypes that can occur in a KG. This taxonomy provides a classification of the\nanomalies discovered by SEKA with an extensive discussion of possible data\nquality issues in a KG. We evaluate both approaches using the four real-world\nKGs YAGO-1, KBpedia, Wikidata, and DSKG to demonstrate the ability of SEKA and\nTAXO to outperform the baselines.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "kwm1BQGPiJcSy19Yhy-eBoC--ACA6mcvEjW5sCpXxQk",
  "pdfSize": "342419"
}