{
  "id": "2412.03629",
  "title": "DiffuPT: Class Imbalance Mitigation for Glaucoma Detection via Diffusion\n  Based Generation and Model Pretraining",
  "authors": "Youssof Nawar, Nouran Soliman, Moustafa Wassel, Mohamed ElHabebe, Noha\n  Adly, Marwan Torki, Ahmed Elmassry, and Islam Ahmed",
  "authorsParsed": [
    [
      "Nawar",
      "Youssof",
      ""
    ],
    [
      "Soliman",
      "Nouran",
      ""
    ],
    [
      "Wassel",
      "Moustafa",
      ""
    ],
    [
      "ElHabebe",
      "Mohamed",
      ""
    ],
    [
      "Adly",
      "Noha",
      ""
    ],
    [
      "Torki",
      "Marwan",
      ""
    ],
    [
      "Elmassry",
      "Ahmed",
      ""
    ],
    [
      "Ahmed",
      "Islam",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 17:39:44 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733333984000,
  "abstract": "  Glaucoma is a progressive optic neuropathy characterized by structural damage\nto the optic nerve head and functional changes in the visual field. Detecting\nglaucoma early is crucial to preventing loss of eyesight. However, medical\ndatasets often suffer from class imbalances, making detection more difficult\nfor deep-learning algorithms. We use a generative-based framework to enhance\nglaucoma diagnosis, specifically addressing class imbalance through synthetic\ndata generation. In addition, we collected the largest national dataset for\nglaucoma detection to support our study. The imbalance between normal and\nglaucomatous cases leads to performance degradation of classifier models. By\ncombining our proposed framework leveraging diffusion models with a pretraining\napproach, we created a more robust classifier training process. This training\nprocess results in a better-performing classifier. The proposed approach shows\npromising results in improving the harmonic mean (sensitivity and specificity)\nand AUC for the roc for the glaucoma classifier. We report an improvement in\nthe harmonic mean metric from 89.09% to 92.59% on the test set of our national\ndataset. We examine our method against other methods to overcome imbalance\nthrough extensive experiments. We report similar improvements on the AIROGS\ndataset. This study highlights that diffusion-based generation can be of great\nimportance in tackling class imbalances in medical datasets to improve\ndiagnostic performance.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Quantitative Biology/Quantitative Methods"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xDzM51wLWcxHp0xzmsMOSaDesm5GnkZJSb-Smwhzumw",
  "pdfSize": "13286008"
}