{"id":"2412.13501","title":"GUI Agents: A Survey","authors":"Dang Nguyen, Jian Chen, Yu Wang, Gang Wu, Namyong Park, Zhengmian Hu,\n  Hanjia Lyu, Junda Wu, Ryan Aponte, Yu Xia, Xintong Li, Jing Shi, Hongjie\n  Chen, Viet Dac Lai, Zhouhang Xie, Sungchul Kim, Ruiyi Zhang, Tong Yu, Mehrab\n  Tanjim, Nesreen K. Ahmed, Puneet Mathur, Seunghyun Yoon, Lina Yao, Branislav\n  Kveton, Thien Huu Nguyen, Trung Bui, Tianyi Zhou, Ryan A. Rossi, Franck\n  Dernoncourt","authorsParsed":[["Nguyen","Dang",""],["Chen","Jian",""],["Wang","Yu",""],["Wu","Gang",""],["Park","Namyong",""],["Hu","Zhengmian",""],["Lyu","Hanjia",""],["Wu","Junda",""],["Aponte","Ryan",""],["Xia","Yu",""],["Li","Xintong",""],["Shi","Jing",""],["Chen","Hongjie",""],["Lai","Viet Dac",""],["Xie","Zhouhang",""],["Kim","Sungchul",""],["Zhang","Ruiyi",""],["Yu","Tong",""],["Tanjim","Mehrab",""],["Ahmed","Nesreen K.",""],["Mathur","Puneet",""],["Yoon","Seunghyun",""],["Yao","Lina",""],["Kveton","Branislav",""],["Nguyen","Thien Huu",""],["Bui","Trung",""],["Zhou","Tianyi",""],["Rossi","Ryan A.",""],["Dernoncourt","Franck",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 04:48:28 GMT"}],"updateDate":"2024-12-19","timestamp":1734497308000,"abstract":"  Graphical User Interface (GUI) agents, powered by Large Foundation Models,\nhave emerged as a transformative approach to automating human-computer\ninteraction. These agents autonomously interact with digital systems or\nsoftware applications via GUIs, emulating human actions such as clicking,\ntyping, and navigating visual elements across diverse platforms. Motivated by\nthe growing interest and fundamental importance of GUI agents, we provide a\ncomprehensive survey that categorizes their benchmarks, evaluation metrics,\narchitectures, and training methods. We propose a unified framework that\ndelineates their perception, reasoning, planning, and acting capabilities.\nFurthermore, we identify important open challenges and discuss key future\ndirections. Finally, this work serves as a basis for practitioners and\nresearchers to gain an intuitive understanding of current progress, techniques,\nbenchmarks, and critical open problems that remain to be addressed.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"x4LhfiLb3iXnzcvhoyZ3Ta2NkE6dECN9dDy0Fw3E67Q","pdfSize":"377671"}