{
  "id": "2412.12171",
  "title": "AI Adoption to Combat Financial Crime: Study on Natural Language\n  Processing in Adverse Media Screening of Financial Services in English and\n  Bangla multilingual interpretation",
  "authors": "Soumita Roy",
  "authorsParsed": [
    [
      "Roy",
      "Soumita",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 07:17:05 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1733987825000,
  "abstract": "  This document explores the potential of employing Artificial Intelligence\n(AI), specifically Natural Language Processing (NLP), to strengthen the\ndetection and prevention of financial crimes within the Mobile Financial\nServices(MFS) of Bangladesh with multilingual scenario. The analysis focuses on\nthe utilization of NLP for adverse media screening, a vital aspect of\ncompliance with anti-money laundering (AML) and combating financial terrorism\n(CFT) regulations. Additionally, it investigates the overall reception and\nobstacles related to the integration of AI in Bangladeshi banks. This report\nmeasures the effectiveness of NLP is promising with an accuracy around 94\\%.\nNLP algorithms display substantial promise in accurately identifying adverse\nmedia content linked to financial crimes. The lack of progress in this aspect\nis visible in Bangladesh, whereas globally the technology is already being used\nto increase effectiveness and efficiency. Hence, it is clear there is an issue\nwith the acceptance of AI in Bangladesh. Some AML \\& CFT concerns are already\nbeing addressed by AI technology. For example, Image Recognition OCR technology\nare being used in KYC procedures. Primary hindrances to AI integration involve\na lack of technical expertise, high expenses, and uncertainties surrounding\nregulations. This investigation underscores the potential of AI-driven NLP\nsolutions in fortifying efforts to prevent financial crimes in Bangladesh.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "N7s0M1aSKqtwNLQiLV54XpNEmMIb4McCpwX1ar5bjck",
  "pdfSize": "219803"
}