{
  "id": "2412.04990",
  "title": "ETLNet: An Efficient TCN-BiLSTM Network for Road Anomaly Detection Using\n  Smartphone Sensors",
  "authors": "Mohd Faiz Ansari and Rakshit Sandilya and Mohammed Javed and David\n  Doermann",
  "authorsParsed": [
    [
      "Ansari",
      "Mohd Faiz",
      ""
    ],
    [
      "Sandilya",
      "Rakshit",
      ""
    ],
    [
      "Javed",
      "Mohammed",
      ""
    ],
    [
      "Doermann",
      "David",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 12:27:07 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733488027000,
  "abstract": "  Road anomalies can be defined as irregularities on the road surface or in the\nsurface itself. Some may be intentional (such as speedbumps), accidental (such\nas materials falling off a truck), or the result of roads' excessive use or low\nor no maintenance, such as potholes. Despite their varying origins, these\nirregularities often harm vehicles substantially. Speed bumps are intentionally\nplaced for safety but are dangerous due to their non-standard shape, size, and\nlack of proper markings. Potholes are unintentional and can also cause severe\ndamage. To address the detection of these anomalies, we need an automated road\nmonitoring system. Today, various systems exist that use visual information to\ntrack these anomalies. Still, due to poor lighting conditions and improper or\nmissing markings, they may go undetected and have severe consequences for\npublic transport, automated vehicles, etc. In this paper, the Enhanced\nTemporal-BiLSTM Network (ETLNet) is introduced as a novel approach that\nintegrates two Temporal Convolutional Network (TCN) layers with a Bidirectional\nLong Short-Term Memory (BiLSTM) layer. This combination is tailored to detect\nanomalies effectively irrespective of lighting conditions, as it depends not on\nvisuals but smartphone inertial sensor data. Our methodology employs\naccelerometer and gyroscope sensors, typically in smartphones, to gather data\non road conditions. Empirical evaluations demonstrate that the ETLNet model\nmaintains an F1-score for detecting speed bumps of 99.3%. The ETLNet model's\nrobustness and efficiency significantly advance automated road surface\nmonitoring technologies.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "0oO_Y8RmMKtersgv_nQvQky7bSngcGLeyA4xOH7ILv4",
  "pdfSize": "828400"
}