{"id":"2412.13595","title":"Cool-Core Destruction in Merging Clusters with AGN Feedback and\n  Radiative Cooling","authors":"Shuang-Shuang Chen, Hsiang-Yi Karen Yang, Hsi-Yu Schive, John ZuHone,\n  Massimo Gaspari","authorsParsed":[["Chen","Shuang-Shuang",""],["Yang","Hsiang-Yi Karen",""],["Schive","Hsi-Yu",""],["ZuHone","John",""],["Gaspari","Massimo",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 08:18:56 GMT"}],"updateDate":"2024-12-19","timestamp":1734509936000,"abstract":"  The origin of cool-core (CC) and non-cool-core (NCC) dichotomy of galaxy\nclusters remains uncertain. Previous simulations have found that cluster\nmergers are effective in destroying CCs but fail to prevent overcooling in\ncluster cores when radiative cooling is included. Feedback from active galactic\nnuclei (AGN) is a promising mechanism for balancing cooling in CCs; however,\nthe role of AGN feedback in CC/NCC transitions remains elusive. In this work,\nwe perform three-dimensional binary cluster merger simulations incorporating\nAGN feedback and radiative cooling, aiming to investigate the heating effects\nfrom mergers and AGN feedback on CC destruction. We vary the mass ratio and\nimpact parameter to examine the entropy evolution of different merger\nscenarios. We find that AGN feedback is essential in regulating the merging\nclusters, and that CC destruction depends on the merger parameters. Our results\nsuggest three scenarios regarding CC/NCC transitions: (1) CCs are preserved in\nminor mergers or mergers that do not trigger sufficient heating, in which cases\nAGN feedback is crucial for preventing the cooling catastrophe; (2) CCs are\ntransformed into NCCs by major mergers during the first core passage, and AGN\nfeedback is subdominant; (3) in major mergers with a large impact parameter,\nmergers and AGN feedback operate in concert to destroy the CCs.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"xfjbhIESrTZ8SxHtFsa-5mH_17doawlsu-paPEQnNw4","pdfSize":"4256522"}