{
  "id": "2412.09893",
  "title": "Mass-transferring binary stars as progenitors of interacting\n  hydrogen-free supernovae",
  "authors": "Andrea Ercolino, Harim Jin, Norbert Langer, Luc Dessart",
  "authorsParsed": [
    [
      "Ercolino",
      "Andrea",
      ""
    ],
    [
      "Jin",
      "Harim",
      ""
    ],
    [
      "Langer",
      "Norbert",
      ""
    ],
    [
      "Dessart",
      "Luc",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 06:26:28 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 23 Jan 2025 12:55:33 GMT"
    }
  ],
  "updateDate": "2025-01-24",
  "timestamp": 1734071188000,
  "abstract": "  Stripped-envelope supernovae (SNe) are H-poor transients produced at the end\nof the life of massive stars that previously lost their H-rich envelope. Their\nprogenitors are thought to be donor stars in mass-transferring binary systems,\nwhich were stripped of their H-rich envelopes some $10^6$yr before core\ncollapse. A subset of the stripped-envelope SNe exhibit spectral and\nphotometric features indicative of interaction between their ejecta and nearby\ncircumstellar material (CSM). We examine whether mass transfer during, or\nshortly before, core collapse in massive binary systems can produce the CSM\ninferred from the observations of interacting H-poor SNe. We select 44 models\nfrom a comprehensive grid of detailed binary evolution models in which the mass\ndonors are H-free and explode while transferring mass to a main-sequence\ncompanion. We find that in these models, mass transfer starts less than\n$\\sim20$kyr before, and often continues until the core collapse of the donor\nstar. Up to $0.8M_\\odot$ of H-free material are removed from the donor star\nduring this phase, which may produce a He-rich circumbinary material. We\nexplore plausible assumptions for its spatial distribution at the time of\nexplosion. When assuming that the CSM accumulates in a circumbinary disk, we\nfind qualitative agreement with the supernova and CSM properties inferred from\nobserved Type Ibn SNe, and to a lesser extent with constraints from Type Icn\nSNe. We find that our mass transferring stripped envelope SN progenitor models\nmay produce up to $\\sim$10% of all stripped envelope supernovae. The binary\nchannel proposed in this work can qualitatively account for the observed key\nproperties and rate of interacting H-poor SNe. Models for the evolution of the\ncircumbinary material and the spectral evolution of exploding progenitors from\nthis channel are needed to further test its significance.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FCis6ODOhsh42TCvYxm-7HwJg_IbLfVBfb_8FlRxZPE",
  "pdfSize": "2073992"
}