{
  "id": "2412.09678",
  "title": "A comprehensive study of ALPs from $B$-decays",
  "authors": "Deepanshu Bisht, Sabyasachi Chakraborty, Atanu Samanta",
  "authorsParsed": [
    [
      "Bisht",
      "Deepanshu",
      ""
    ],
    [
      "Chakraborty",
      "Sabyasachi",
      ""
    ],
    [
      "Samanta",
      "Atanu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 19:00:10 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734030010000,
  "abstract": "  We present a comprehensive study of axion-like particles (ALPs) through\nflavor changing neutral current processes, such as $B\\to K a$ followed by\nhadronic decays. Our generic framework encompasses different ultraviolet\nscenarios similar to KSVZ, DFSZ and Flaxion etc. Starting from the effective\nLagrangian written at the high scale, we compute the anomalous dimension\nmatrix, taking into account all one-loop and relevant two-loop contributions.\nThe latter is most important for the KSVZ and heavy QCD axion scenarios. We\nrecognized that such two-loop diagrams can have both ultraviolet (UV) and\ninfrared (IR) divergences. We show explicitly that UV divergences cancel by\ninserting appropriate counterterms, which are new operators involving the axion\nfield and required to be present at the UV itself, to renormalize the theory.\nOn the other hand, the cancellation of IR divergences is subtle and\ndemonstrated through matching with the effective theory at the electroweak\nscale. We also utilize chiral perturbation theory and vector meson dominance\nframework to compute the decay and branching fractions of the ALP pertaining to\nour framework. We find that for KSVZ-like scenario, axion decay constant, $f_a\n\\lesssim 1$ TeV can be ruled out. The bound becomes stronger for the DFSZ and\nFlaxion-like models, reaching upto $10^2$ TeV and $10^3$ TeV respectively. We\nalso provide projections on the parameter space based on 3 ab$^{-1}$ data from\nBelle II.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology",
    "Physics/High Energy Physics - Experiment"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "1SRdjlf654qURu6JmVQhiVxmi-XQIHJ9DPuP89DUWnE",
  "pdfSize": "3399929"
}