{"id":"2412.01716","title":"Extreme-ultraviolet spatiotemporal vortices via high harmonic generation","authors":"Rodrigo Martin-Hernandez, Guan Gui, Luis Plaja, Henry K. Kapteyn,\n  Margaret M. Murnane, Chen-Ting Liao, Miguel A. Porras, Carlos\n  Hernandez-Garcia","authorsParsed":[["Martin-Hernandez","Rodrigo",""],["Gui","Guan",""],["Plaja","Luis",""],["Kapteyn","Henry K.",""],["Murnane","Margaret M.",""],["Liao","Chen-Ting",""],["Porras","Miguel A.",""],["Hernandez-Garcia","Carlos",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 17:07:32 GMT"}],"updateDate":"2024-12-03","timestamp":1733159252000,"abstract":"  Spatiotemporal optical vortices (STOV) are space-time structured light pulses\nwith a unique topology that couples spatial and temporal domains and carry\ntransverse orbital angular momentum (OAM). Up to now, their generation has been\nlimited to the visible and infrared regions of the spectrum. During the last\ndecade, it was shown that through the process of high-order harmonic generation\n(HHG) it is possible to up-convert spatial optical vortices that carry\nlongitudinal OAM from the near-infrared into the extreme-ultraviolet (EUV),\nthereby producing vortices with distinct femtosecond and attosecond structure.\nIn this work we demonstrate theoretically and experimentally the generation of\nEUV spatiotemporal and spatiospectral vortices using near infrared STOV driving\nlaser pulses. We use analytical expressions for focused STOVs to perform\nmacroscopic calculations of HHG that are directly compared to the experimental\nresults. As STOV beams are not eigenmodes of propagation, we characterize the\nhighly-charged EUV STOVs both in the near and far fields, to show that they\nrepresent conjugated spatiotemporal and spatiospectral vortex pairs. Our work\nprovides high-frequency light beams topologically coupled at the\nnanometer/attosecond scales domains with transverse OAM, that could be suitable\nto explore electronic dynamics in magnetic materials, chiral media, and\nnanostructures.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wZu5UwHpYqDowdnZzoV-CAh46OsUgmudyjfDGgw6m4s","pdfSize":"4014176"}