{"id":"2412.00577","title":"Turing Representational Similarity Analysis (RSA): A Flexible Method for\n  Measuring Alignment Between Human and Artificial Intelligence","authors":"Mattson Ogg, Ritwik Bose, Jamie Scharf, Christopher Ratto, Michael\n  Wolmetz","authorsParsed":[["Ogg","Mattson",""],["Bose","Ritwik",""],["Scharf","Jamie",""],["Ratto","Christopher",""],["Wolmetz","Michael",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 20:24:52 GMT"}],"updateDate":"2024-12-03","timestamp":1732998292000,"abstract":"  As we consider entrusting Large Language Models (LLMs) with key societal and\ndecision-making roles, measuring their alignment with human cognition becomes\ncritical. This requires methods that can assess how these systems represent\ninformation and facilitate comparisons to human understanding across diverse\ntasks. To meet this need, we developed Turing Representational Similarity\nAnalysis (RSA), a method that uses pairwise similarity ratings to quantify\nalignment between AIs and humans. We tested this approach on semantic alignment\nacross text and image modalities, measuring how different Large Language and\nVision Language Model (LLM and VLM) similarity judgments aligned with human\nresponses at both group and individual levels. GPT-4o showed the strongest\nalignment with human performance among the models we tested, particularly when\nleveraging its text processing capabilities rather than image processing,\nregardless of the input modality. However, no model we studied adequately\ncaptured the inter-individual variability observed among human participants.\nThis method helped uncover certain hyperparameters and prompts that could steer\nmodel behavior to have more or less human-like qualities at an inter-individual\nor group level. Turing RSA enables the efficient and flexible quantification of\nhuman-AI alignment and complements existing accuracy-based benchmark tasks. We\ndemonstrate its utility across multiple modalities (words, sentences, images)\nfor understanding how LLMs encode knowledge and for examining representational\nalignment with human cognition.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AobU6mJ8693DxJSVbnvrbBIKt-4NeBJ5HBBpmxJ_BeA","pdfSize":"12237129"}