{
  "id": "2412.04000",
  "title": "IF-MDM: Implicit Face Motion Diffusion Model for High-Fidelity Realtime\n  Talking Head Generation",
  "authors": "Sejong Yang, Seoung Wug Oh, Yang Zhou, Seon Joo Kim",
  "authorsParsed": [
    [
      "Yang",
      "Sejong",
      ""
    ],
    [
      "Oh",
      "Seoung Wug",
      ""
    ],
    [
      "Zhou",
      "Yang",
      ""
    ],
    [
      "Kim",
      "Seon Joo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 09:20:48 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 10 Dec 2024 07:43:08 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733390448000,
  "abstract": "  We introduce a novel approach for high-resolution talking head generation\nfrom a single image and audio input. Prior methods using explicit face models,\nlike 3D morphable models (3DMM) and facial landmarks, often fall short in\ngenerating high-fidelity videos due to their lack of appearance-aware motion\nrepresentation. While generative approaches such as video diffusion models\nachieve high video quality, their slow processing speeds limit practical\napplication. Our proposed model, Implicit Face Motion Diffusion Model (IF-MDM),\nemploys implicit motion to encode human faces into appearance-aware compressed\nfacial latents, enhancing video generation. Although implicit motion lacks the\nspatial disentanglement of explicit models, which complicates alignment with\nsubtle lip movements, we introduce motion statistics to help capture\nfine-grained motion information. Additionally, our model provides motion\ncontrollability to optimize the trade-off between motion intensity and visual\nquality during inference. IF-MDM supports real-time generation of 512x512\nresolution videos at up to 45 frames per second (fps). Extensive evaluations\ndemonstrate its superior performance over existing diffusion and explicit face\nmodels. The code will be released publicly, available alongside supplementary\nmaterials. The video results can be found on\nhttps://bit.ly/ifmdm_supplementary.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "JM6-tefDSNvMluaJGilJCdzgwp8yYnckG6dK-K3fENk",
  "pdfSize": "2403633"
}