{
  "id": "2412.12200",
  "title": "On the Field Theoretical Description of an Alternative Model to\n  Generalized Chaplygin Gas and its Thermodynamic Behaviour",
  "authors": "Tamal Mukhopadhyay, Banadipa Chakraborty, Ujjal Debnath and Anirudh\n  Pradhan",
  "authorsParsed": [
    [
      "Mukhopadhyay",
      "Tamal",
      ""
    ],
    [
      "Chakraborty",
      "Banadipa",
      ""
    ],
    [
      "Debnath",
      "Ujjal",
      ""
    ],
    [
      "Pradhan",
      "Anirudh",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 23:19:56 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734218396000,
  "abstract": "  This paper aims to study a newly proposed fluid description of dark energy in\nthe context of late-time accelerated expansion of the universe. We examine the\nprobable origin of the proposed equation of state in correspondence with some\nvastly discussed scalar field models of dark energy and reconstruct the field\nparameters like scalar field $\\phi$ and scalar potential $V(\\phi)$, analyzing\ntheir behavior in the evolution of the universe. The study also incorporates an\nanalysis of fundamental energy conditions: Null Energy Condition (NEC),\nDominant Energy Condition (DEC), and Strong Energy Condition (SEC), to assess\nthe physical consistency and cosmological implications of the model. We perform\na detailed stability analysis and investigate the evolutionary dynamics of the\nproposed fluid model from a thermodynamic perspective. Additionally, the model\nis analyzed using some of the latest observational datasets, such as Cosmic\nChronometers (CC), Baryon Acoustic Oscillation (BAO), and Supernova Type-Ia\n(using Pantheon+SH0ES compilation and Union 2.1), to determine its viability\nand consistency with observations. The results suggest that the model offers a\nrobust description of dark energy dynamics while maintaining agreement with\ncurrent observational data.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "hK_PIB8xoYpUPqjMMFbMA7ZlwZ7kRpF8Lhh4YXt0dW0",
  "pdfSize": "4564172"
}