{
  "id": "2412.04872",
  "title": "Orbital torque switching of room temperature two-dimensional van der\n  Waals ferromagnet Fe3GaTe2",
  "authors": "Delin Zhang, Heshuang Wei, Jinyu Duan, Jiali Chen, Dongdong Yue, Yuhe\n  Yang, Jinlong Gou, Junxin Yan, Kun Zhai, Ping Wang, Shuai Hu, Zhiyan Jia, Wei\n  Jiang, Wenhong Wang, Yue Li, Yong Jiang",
  "authorsParsed": [
    [
      "Zhang",
      "Delin",
      ""
    ],
    [
      "Wei",
      "Heshuang",
      ""
    ],
    [
      "Duan",
      "Jinyu",
      ""
    ],
    [
      "Chen",
      "Jiali",
      ""
    ],
    [
      "Yue",
      "Dongdong",
      ""
    ],
    [
      "Yang",
      "Yuhe",
      ""
    ],
    [
      "Gou",
      "Jinlong",
      ""
    ],
    [
      "Yan",
      "Junxin",
      ""
    ],
    [
      "Zhai",
      "Kun",
      ""
    ],
    [
      "Wang",
      "Ping",
      ""
    ],
    [
      "Hu",
      "Shuai",
      ""
    ],
    [
      "Jia",
      "Zhiyan",
      ""
    ],
    [
      "Jiang",
      "Wei",
      ""
    ],
    [
      "Wang",
      "Wenhong",
      ""
    ],
    [
      "Li",
      "Yue",
      ""
    ],
    [
      "Jiang",
      "Yong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 09:07:06 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733476026000,
  "abstract": "  Efficiently manipulating the magnetization of van der Waals ferromagnets has\nattracted considerable interest in developing room-temperature two-dimensional\nmaterial-based memory and logic devices. Here, taking advantage of the unique\nproperties of the van der Waals ferromagnet as well as promising\ncharacteristics of the orbital Hall effect, we demonstrate the room-temperature\nmagnetization switching of van der Waals ferromagnet Fe3GaTe2 through the\norbital torque generated by the orbital Hall material, Titanium (Ti). The\nswitching current density is estimated to be around 1.6 x 10^6 A/cm^2,\ncomparable to that achieved in Fe3GaTe2 using spin-orbit torque from spin Hall\nmaterials. The efficient magnetization switching arises from the combined\neffects of the large orbital Hall conductivity of Ti and the strong spin-orbit\ncorrelation of the Fe3GaTe2, as confirmed through theoretical calculations. Our\nfindings advance the understanding of orbital torque switching and pave the way\nfor exploring material-based orbitronic devices.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "BgX-ZrNSwm6zK4UvAydjZJdTVDFshmz0uW9FrrcFwC0",
  "pdfSize": "1932552"
}