{
  "id": "2412.15022",
  "title": "Quantum SWAP gate realized with CZ and iSWAP gates in a superconducting\n  architecture",
  "authors": "Christian Kri\\v{z}an, Janka Bizn\\'arov\\'a, Liangyu Chen, Emil Hogedal,\n  Amr Osman, Christopher W. Warren, Sandoko Kosen, Hang-Xi Li, Tahereh Abad,\n  Anuj Aggarwal, Marco Caputo, Jorge Fern\\'andez-Pend\\'as, Akshay Gaikwad, Leif\n  Gr\\\"onberg, Andreas Nylander, Robert Rehammar, Marcus Rommel, Olga I.\n  Yuzephovich, Anton Frisk Kockum, Joonas Govenius, Giovanna Tancredi, Jonas\n  Bylander",
  "authorsParsed": [
    [
      "Križan",
      "Christian",
      ""
    ],
    [
      "Biznárová",
      "Janka",
      ""
    ],
    [
      "Chen",
      "Liangyu",
      ""
    ],
    [
      "Hogedal",
      "Emil",
      ""
    ],
    [
      "Osman",
      "Amr",
      ""
    ],
    [
      "Warren",
      "Christopher W.",
      ""
    ],
    [
      "Kosen",
      "Sandoko",
      ""
    ],
    [
      "Li",
      "Hang-Xi",
      ""
    ],
    [
      "Abad",
      "Tahereh",
      ""
    ],
    [
      "Aggarwal",
      "Anuj",
      ""
    ],
    [
      "Caputo",
      "Marco",
      ""
    ],
    [
      "Fernández-Pendás",
      "Jorge",
      ""
    ],
    [
      "Gaikwad",
      "Akshay",
      ""
    ],
    [
      "Grönberg",
      "Leif",
      ""
    ],
    [
      "Nylander",
      "Andreas",
      ""
    ],
    [
      "Rehammar",
      "Robert",
      ""
    ],
    [
      "Rommel",
      "Marcus",
      ""
    ],
    [
      "Yuzephovich",
      "Olga I.",
      ""
    ],
    [
      "Kockum",
      "Anton Frisk",
      ""
    ],
    [
      "Govenius",
      "Joonas",
      ""
    ],
    [
      "Tancredi",
      "Giovanna",
      ""
    ],
    [
      "Bylander",
      "Jonas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 16:32:36 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734625956000,
  "abstract": "  It is advantageous for any quantum processor to support different classes of\ntwo-qubit quantum logic gates when compiling quantum circuits, a property that\nis typically not seen with existing platforms. In particular, access to a gate\nset that includes support for the CZ-type, the iSWAP-type, and the SWAP-type\nfamilies of gates, renders conversions between these gate families unnecessary\nduring compilation as any two-qubit Clifford gate can be executed using at most\none two-qubit gate from this set, plus additional single-qubit gates. We\nexperimentally demonstrate that a SWAP gate can be decomposed into one iSWAP\ngate followed by one CZ gate, affirming a more efficient compilation strategy\nover the conventional approach that relies on three iSWAP or three CZ gates to\nreplace a SWAP gate. Our implementation makes use of a superconducting quantum\nprocessor design based on fixed-frequency transmon qubits coupled together by a\nparametrically modulated tunable transmon coupler, extending this platform's\nnative gate set so that any two-qubit Clifford unitary matrix can be realized\nusing no more than two two-qubit gates and single-qubit gates.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "rxVLES2tAaZt63GTTFDRaZThgrw1u-LQSjIFXRfNGsA",
  "pdfSize": "6123548"
}