{
  "id": "2412.05091",
  "title": "Designing a Secure, Scalable, and Cost-Effective Cloud Storage Solution:\n  A Novel Approach to Data Management using NextCloud, TrueNAS, and QEMU/KVM",
  "authors": "Prakash Aryan, Sujala Deepak Shetty",
  "authorsParsed": [
    [
      "Aryan",
      "Prakash",
      ""
    ],
    [
      "Shetty",
      "Sujala Deepak",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 14:48:44 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733496524000,
  "abstract": "  This paper presents a novel approach to cloud storage challenges by\nintegrating NextCloud, TrueNAS, and QEMU/KVM. Our research demonstrates how\nthis combination creates a robust, flexible, and economical cloud storage\nsystem suitable for various applications. We detail the architecture,\nhighlighting TrueNAS's ZFS-based storage, QEMU/KVM's virtualization, and\nNextCloud's user interface. Extensive testing showssuperior data integrity and\nprotection compared to traditional solutions. Performance benchmarks reveal\nhigh read/write speeds(up to 1.22 GB/s for sequential reads and 620 MB/s for\nwrites) and also efficient small file handling. We demonstrate the solution's\nscalability under increasing workloads. Security analysis showcases effective\njail isolation techniques in TrueNAS. Cost analysis indicates potential 50%\nreduction in total ownership cost over five years compared to commercial\nalternatives. This research contributes a practical, high-performance,\ncost-effective alternative to proprietary solutions, paving new ways for\norganizations to implement secure, scalable cloud storage while maintaining\ndata control. Future work will focus on improving automated scaling and\nintegration with emerging technologies like containerization and serverless\ncomputing.\n",
  "subjects": [
    "Computer Science/Databases",
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "aomFa5825vtWU0pWC-BaiKppgoqOWdBmwbdbeKXnR7Y",
  "pdfSize": "230490"
}