{
  "id": "2412.04095",
  "title": "HyperFLINT: Hypernetwork-based Flow Estimation and Temporal\n  Interpolation for Scientific Ensemble Visualization",
  "authors": "Hamid Gadirov, Qi Wu, David Bauer, Kwan-Liu Ma, Jos Roerdink, Steffen\n  Frey",
  "authorsParsed": [
    [
      "Gadirov",
      "Hamid",
      ""
    ],
    [
      "Wu",
      "Qi",
      ""
    ],
    [
      "Bauer",
      "David",
      ""
    ],
    [
      "Ma",
      "Kwan-Liu",
      ""
    ],
    [
      "Roerdink",
      "Jos",
      ""
    ],
    [
      "Frey",
      "Steffen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 12:01:20 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733400080000,
  "abstract": "  We present HyperFLINT (Hypernetwork-based FLow estimation and temporal\nINTerpolation), a novel deep learning-based approach for estimating flow\nfields, temporally interpolating scalar fields, and facilitating parameter\nspace exploration in spatio-temporal scientific ensemble data. This work\naddresses the critical need to explicitly incorporate ensemble parameters into\nthe learning process, as traditional methods often neglect these, limiting\ntheir ability to adapt to diverse simulation settings and provide meaningful\ninsights into the data dynamics. HyperFLINT introduces a hypernetwork to\naccount for simulation parameters, enabling it to generate accurate\ninterpolations and flow fields for each timestep by dynamically adapting to\nvarying conditions, thereby outperforming existing parameter-agnostic\napproaches. The architecture features modular neural blocks with convolutional\nand deconvolutional layers, supported by a hypernetwork that generates weights\nfor the main network, allowing the model to better capture intricate simulation\ndynamics. A series of experiments demonstrates HyperFLINT's significantly\nimproved performance in flow field estimation and temporal interpolation, as\nwell as its potential in enabling parameter space exploration, offering\nvaluable insights into complex scientific ensembles.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Graphics",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "M-zvNFeWt7ss0eP_TSFVlogKJsj3UcLudg3HWVy7aZc",
  "pdfSize": "48730664"
}