{
  "id": "2412.13708",
  "title": "JoVALE: Detecting Human Actions in Video Using Audiovisual and Language\n  Contexts",
  "authors": "Taein Son, Soo Won Seo, Jisong Kim, Seok Hwan Lee, Jun Won Choi",
  "authorsParsed": [
    [
      "Son",
      "Taein",
      ""
    ],
    [
      "Seo",
      "Soo Won",
      ""
    ],
    [
      "Kim",
      "Jisong",
      ""
    ],
    [
      "Lee",
      "Seok Hwan",
      ""
    ],
    [
      "Choi",
      "Jun Won",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 10:51:31 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 3 Feb 2025 12:27:21 GMT"
    }
  ],
  "updateDate": "2025-02-04",
  "timestamp": 1734519091000,
  "abstract": "  Video Action Detection (VAD) entails localizing and categorizing action\ninstances within videos, which inherently consist of diverse information\nsources such as audio, visual cues, and surrounding scene contexts. Leveraging\nthis multi-modal information effectively for VAD poses a significant challenge,\nas the model must identify action-relevant cues with precision. In this study,\nwe introduce a novel multi-modal VAD architecture, referred to as the Joint\nActor-centric Visual, Audio, Language Encoder (JoVALE). JoVALE is the first VAD\nmethod to integrate audio and visual features with scene descriptive context\nsourced from large-capacity image captioning models. At the heart of JoVALE is\nthe actor-centric aggregation of audio, visual, and scene descriptive\ninformation, enabling adaptive integration of crucial features for recognizing\neach actor's actions. We have developed a Transformer-based architecture, the\nActor-centric Multi-modal Fusion Network, specifically designed to capture the\ndynamic interactions among actors and their multi-modal contexts. Our\nevaluation on three prominent VAD benchmarks, including AVA, UCF101-24, and\nJHMDB51-21, demonstrates that incorporating multi-modal information\nsignificantly enhances performance, setting new state-of-the-art performances\nin the field.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ndZAaimBbLge0mHbxwhzFpDIkOJZjAIp1jrZxJIKcAE",
  "pdfSize": "1944963"
}