{
  "id": "2412.14175",
  "title": "BiTSA: Leveraging Time Series Foundation Model for Building Energy\n  Analytics",
  "authors": "Xiachong Lin, Arian Prabowo, Imran Razzak, Hao Xue, Matthew Amos, Sam\n  Behrens, Flora D. Salim",
  "authorsParsed": [
    [
      "Lin",
      "Xiachong",
      ""
    ],
    [
      "Prabowo",
      "Arian",
      ""
    ],
    [
      "Razzak",
      "Imran",
      ""
    ],
    [
      "Xue",
      "Hao",
      ""
    ],
    [
      "Amos",
      "Matthew",
      ""
    ],
    [
      "Behrens",
      "Sam",
      ""
    ],
    [
      "Salim",
      "Flora D.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 20 Nov 2024 23:49:06 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1732146546000,
  "abstract": "  Incorporating AI technologies into digital infrastructure offers\ntransformative potential for energy management, particularly in enhancing\nenergy efficiency and supporting net-zero objectives. However, the complexity\nof IoT-generated datasets often poses a significant challenge, hindering the\ntranslation of research insights into practical, real-world applications. This\npaper presents the design of an interactive visualization tool, BiTSA. The tool\nenables building managers to interpret complex energy data quickly and take\nimmediate, data-driven actions based on real-time insights. By integrating\nadvanced forecasting models with an intuitive visual interface, our solution\nfacilitates proactive decision-making, optimizes energy consumption, and\npromotes sustainable building management practices. BiTSA will empower building\nmanagers to optimize energy consumption, control demand-side energy usage, and\nachieve sustainability goals.\n",
  "subjects": [
    "Computer Science/Computational Engineering, Finance, and Science",
    "Computer Science/Computers and Society",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "XKPNin0C6GOoL1KreF2jVMFQzQxOMgwZMeDIg9zLeIk",
  "pdfSize": "1184107"
}