{
  "id": "2412.09643",
  "title": "Charge management system based on disturbance observer sliding mode\n  control for space inertial sensors",
  "authors": "Fangchao Yang, Wei Hong, Yujie Zhao",
  "authorsParsed": [
    [
      "Yang",
      "Fangchao",
      ""
    ],
    [
      "Hong",
      "Wei",
      ""
    ],
    [
      "Zhao",
      "Yujie",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 10:09:38 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1733825378000,
  "abstract": "  Precision space inertial sensors are imperative for Earth geodesy missions,\ngravitational wave observations, and fundamental physics experiments in space.\nIn these missions, free-falling test masses(TMs) are susceptible to parasitic\nelectrostatic forces and torques, with significant contributions from the\ninteraction between stray electric fields and TM charge. These effects can make\nup a sizable fraction of the noise budget. Thus, a charge management\nsystem(CMS) is essential in high-precise space-based missions. However, the\noperating environment for space charge control is full of uncertainties and\ndisturbances. TM charge tracking precision is negatively affected by many\nphysical parameters such as external charging rate, quantum yield, UV light\npower, etc. Those parameters are rarely measured and supposed to vary because\nof changes in solar activity, temperature, aging of electronic components and\nso on. The unpredictability and variability of these parameters affects the CMS\nperformance in long-term space missions and must be evaluated or eliminated.\nThis paper presents a simple physics-based model of the discharging process\nwith high charging/discharging rate based on the geometry of inertial sensors.\nAfter that, a disturbance observer sliding mode control (DOSMC) is proposed for\nthe CMS with parametric uncertainties and unknown disturbance to maintain the\nTM charge below a certain level and improve its robustness. The simulation\nresults show that the DOSMC is able to force the system trajectory coincides\nwith the sliding line, which depends neither on the parameters or disturbances.\nIn this way, the DOSMC can effectively ignore the parameter perturbation and\nexternal disturbances. The control precision can reach 0.1 mV, which is\nsuperior to that of a classic proportional-integral-derivative controller and\nconventional sliding mode control.\n",
  "subjects": [
    "Physics/Instrumentation and Detectors"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ncoka44DShXl4_8xgMQreTpFp1z_i_RZgAbGN-tA0cs",
  "pdfSize": "2047411"
}