{
  "id": "2412.05024",
  "title": "Talking Like One of Us: Effects of Using Regional Language in a Humanoid\n  Social Robot",
  "authors": "Thomas Sievers, Nele Russwinkel",
  "authorsParsed": [
    [
      "Sievers",
      "Thomas",
      ""
    ],
    [
      "Russwinkel",
      "Nele",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 13:21:57 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733491317000,
  "abstract": "  Social robots are becoming more and more perceptible in public service\nsettings. For engaging people in a natural environment a smooth social\ninteraction as well as acceptance by the users are important issues for future\nsuccessful Human-Robot Interaction (HRI). The type of verbal communication has\na special significance here. In this paper we investigate the effects of spoken\nlanguage varieties of a non-standard/regional language compared to standard\nlanguage. More precisely we compare a human dialog with a humanoid social robot\nPepper where the robot on the one hand is answering in High German and on the\nother hand in Low German, a regional language that is understood and partly\nstill spoken in the northern parts of Germany. The content of what the robot\nsays remains the same in both variants. We are interested in the effects that\nthese two different ways of robot talk have on human interlocutors who are more\nor less familiar with Low German in terms of perceived warmth, competence and\npossible discomfort in conversation against a background of cultural identity.\nTo measure these factors we use the Robotic Social Attributes Scale (RoSAS) on\n17 participants with an age ranging from 19 to 61. Our results show that\nsignificantly higher warmth is perceived in the Low German version of the\nconversation.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-fI7xSnWyFmQROnTuqGsKxtCWRdYqilgpgCSIupPPDE",
  "pdfSize": "634233"
}