{
  "id": "2412.09785",
  "title": "Gate-tunable spin Hall effect in trilayer graphene/group-IV\n  monochalcogenide van der Waals heterostructures",
  "authors": "Haozhe Yang, Zhendong Chi, Garen Avedissian, Eoin Dolan, Muthumalai\n  Karuppasamy, Beatriz Mart\\'in-Garc\\'ia, Marco Gobbi, Zdenek Sofer, Luis E.\n  Hueso, F\\`elix Casanova",
  "authorsParsed": [
    [
      "Yang",
      "Haozhe",
      ""
    ],
    [
      "Chi",
      "Zhendong",
      ""
    ],
    [
      "Avedissian",
      "Garen",
      ""
    ],
    [
      "Dolan",
      "Eoin",
      ""
    ],
    [
      "Karuppasamy",
      "Muthumalai",
      ""
    ],
    [
      "Martín-García",
      "Beatriz",
      ""
    ],
    [
      "Gobbi",
      "Marco",
      ""
    ],
    [
      "Sofer",
      "Zdenek",
      ""
    ],
    [
      "Hueso",
      "Luis E.",
      ""
    ],
    [
      "Casanova",
      "Fèlix",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 01:52:38 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734054758000,
  "abstract": "  Spintronic devices require materials that facilitate effective spin\ntransport, generation, and detection. In this regard, graphene emerges as an\nideal candidate for long-distance spin transport owing to its minimal\nspin-orbit coupling, which, however, limits its capacity for effective spin\nmanipulation. This problem can be overcome by putting spin-orbit coupling\nmaterials in close contact to graphene leading to spin-orbit proximity and,\nconsequently, efficient spin-to-charge conversion through mechanisms such as\nthe spin Hall effect. Here, we report and quantify the gate-dependent spin Hall\neffect in trilayer graphene proximitized with tin sulfide (SnS), a group-IV\nmonochalcogenide which has recently been predicted to be a viable alternative\nto transition-metal dichalcogenides for inducing strong spin-orbit coupling in\ngraphene. The spin Hall angle exhibits a maximum around the charge neutrality\npoint of graphene up to room temperature. Our findings expand the library of\nmaterials that induce spin-orbit coupling in graphene to a new class, group-IV\nmonochalcogenides, thereby highlighting the potential of two-dimensional\nmaterials to pave the way for the development of innovative spin-based devices\nand future technological applications.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "HacmBeeW3jrc6TUh9uHegbJ-uA7-sGixIgXeUmzfjD4",
  "pdfSize": "1733715"
}