{"id":"2412.04703","title":"Transformers Struggle to Learn to Search","authors":"Abulhair Saparov, Srushti Pawar, Shreyas Pimpalgaonkar, Nitish Joshi,\n  Richard Yuanzhe Pang, Vishakh Padmakumar, Seyed Mehran Kazemi, Najoung Kim,\n  He He","authorsParsed":[["Saparov","Abulhair",""],["Pawar","Srushti",""],["Pimpalgaonkar","Shreyas",""],["Joshi","Nitish",""],["Pang","Richard Yuanzhe",""],["Padmakumar","Vishakh",""],["Kazemi","Seyed Mehran",""],["Kim","Najoung",""],["He","He",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 01:29:24 GMT"}],"updateDate":"2024-12-09","timestamp":1733448564000,"abstract":"  Search is an ability foundational in many important tasks, and recent studies\nhave shown that large language models (LLMs) struggle to perform search\nrobustly. It is unknown whether this inability is due to a lack of data,\ninsufficient model parameters, or fundamental limitations of the transformer\narchitecture. In this work, we use the foundational graph connectivity problem\nas a testbed to generate effectively limitless high-coverage data to train\nsmall transformers and test whether they can learn to perform search. We find\nthat, when given the right training distribution, the transformer is able to\nlearn to search.\n  We analyze the algorithm that the transformer has learned through a novel\nmechanistic interpretability technique that enables us to extract the\ncomputation graph from the trained model. We find that for each vertex in the\ninput graph, transformers compute the set of vertices reachable from that\nvertex. Each layer then progressively expands these sets, allowing the model to\nsearch over a number of vertices exponential in the number of layers.\n  However, we find that as the input graph size increases, the transformer has\ngreater difficulty in learning the task. This difficulty is not resolved even\nas the number of parameters is increased, suggesting that increasing model\nscale will not lead to robust search abilities. We also find that performing\nsearch in-context (i.e., chain-of-thought) does not resolve this inability to\nlearn to search on larger graphs.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0HEd0s-xqn5gR3h4_EY3TXEqhDvZkIUcHA-UjJ4DtT0","pdfSize":"3699425"}