{"id":"2412.06051","title":"Layer Dependent Thermal Transport Properties of One- to Three-Layer\n  Magnetic Fe:MoS2","authors":"Elham Easy, Mengqi Fang, Mingxing Li, Eui-Hyeok Yang, and Xian Zhang","authorsParsed":[["Easy","Elham",""],["Fang","Mengqi",""],["Li","Mingxing",""],["Yang","Eui-Hyeok",""],["Zhang","Xian",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 20:14:17 GMT"}],"updateDate":"2024-12-10","timestamp":1733688857000,"abstract":"  Two-Dimensional (2D) transition metal dichalcogenides (TMDs) have been the\nsubject of extensive attention thanks to their unique properties and atomically\nthin structure. Because of its unprecedented room-temperature magnetic\nproperties, iron-doped MoS2 (Fe:MoS2) is considered the next-generation quantum\nand magnetic material. It is essential to understand Fe:MoS2's thermal behavior\nsince temperature and thermal load/activation are crucial for their magnetic\nproperties and the current nano and quantum devices have been severely limited\nby thermal management. In this work, Fe:MoS2 is synthesized by doping Fe atoms\ninto MoS2 using the chemical vapor deposition (CVD) synthesis and a refined\nversion of opto-thermal Raman technique is used to study the thermal transport\nproperties of Fe:MoS2 in the forms of single (1L), bilayer (2L), and tri-layer\n(3L). In the Opto-thermal Raman technique, a laser is focused on the center of\na thin film and used to measure the peak position of a Raman-active mode. The\nlateral thermal conductivity of 1-3L of Fe:MoS2 and the interfacial thermal\nconductance between Fe:MoS2 and the substrate were obtained by analyzing the\ntemperature-dependent and power-dependent Raman measurement, laser power\nabsorption coefficient, and laser spot sizes. We also characterized Fe:MoS2's\nthermal transport at high temperature, and calculated Fe:MoS2's thermal\ntransport by density theory function. These findings will shed light on the\nthermal management and thermoelectric designs for Fe:MoS2 based nano and\nquantum electronic devices.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ngnASnVGJEyCH3S8xCMjstKeEExinImTlVfgL1tW1Vo","pdfSize":"653395"}