{
  "id": "2412.12612",
  "title": "Auto-Cypher: Improving LLMs on Cypher generation via LLM-supervised\n  generation-verification framework",
  "authors": "Aman Tiwari, Shiva Krishna Reddy Malay, Vikas Yadav, Masoud Hashemi,\n  Sathwik Tejaswi Madhusudhan",
  "authorsParsed": [
    [
      "Tiwari",
      "Aman",
      ""
    ],
    [
      "Malay",
      "Shiva Krishna Reddy",
      ""
    ],
    [
      "Yadav",
      "Vikas",
      ""
    ],
    [
      "Hashemi",
      "Masoud",
      ""
    ],
    [
      "Madhusudhan",
      "Sathwik Tejaswi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 07:21:25 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 24 Jan 2025 05:52:51 GMT"
    }
  ],
  "updateDate": "2025-01-27",
  "timestamp": 1734420085000,
  "abstract": "  Graph databases like Neo4j are gaining popularity for handling complex,\ninterconnected data, over traditional relational databases in modeling and\nquerying relationships. While translating natural language into SQL queries is\nwell-researched, generating Cypher queries for Neo4j remains relatively\nunderexplored. In this work, we present an automated, LLM-Supervised, pipeline\nto generate high-quality synthetic data for Text2Cypher. Our Cypher data\ngeneration pipeline introduces LLM-As-Database-Filler, a novel strategy for\nensuring Cypher query correctness, thus resulting in high quality generations.\nUsing our pipeline, we generate high quality Text2Cypher data - SynthCypher\ncontaining 29.8k instances across various domains and queries with varying\ncomplexities. Training open-source LLMs like LLaMa-3.1-8B, Mistral-7B, and\nQWEN-7B on SynthCypher results in performance gains of up to 40% on the\nText2Cypher test split and 30% on the SPIDER benchmark, adapted for graph\ndatabases.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Information Retrieval",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "IWJ15aYmsf5C6jnT4eMIwSpLUA0R5CzTIuKsC4wS9as",
  "pdfSize": "997081"
}