{"id":"2412.12434","title":"Circuit-Theoretic Joint Parameter-State Estimation of Utility-Scale\n  Photovoltaic, Battery, and Grid Systems","authors":"Peng Sang and Amritanshu Pandey","authorsParsed":[["Sang","Peng",""],["Pandey","Amritanshu",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 00:51:04 GMT"}],"updateDate":"2024-12-18","timestamp":1734396664000,"abstract":"  Solar PV and battery storage systems have become integral to modern power\ngrids. Therefore, bulk grid models in real-time operation must include their\nphysical behavior accurately for analysis and optimization. AC state estimation\nis critical to building real-time bulk power systems models. However, current\nACSE techniques do not include detailed physics and measurements for battery\nand PV systems. This results in sub-optimal estimation results and subsequent\nless accurate bulk grid models for real-time operation.\n  To address these challenges, we formulate a circuit-theoretic AC state\nestimator with accurate PV and battery systems physics and corresponding\nmeasurements. First, we propose an aggregated equivalent circuit model of the\nsolar PV, battery, and traditional grid components. Next, we add measurements\nfrom PV and battery systems to the traditional measurement set to facilitate\naccurate estimation of the overall grid model. Finally, we develop a\ncircuit-theoretic joint parameter-state estimation algorithm that can\naccurately estimate grid, PV, and battery system states and is robust against\nerroneous parameters. To demonstrate the efficacy of the proposed framework, we\nestimate the states of 10k node transmission networks with hundreds of\nbattery+PV-tied systems. We compare the accuracy against the estimation of\nstand-alone grid, battery, and PV systems.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computer Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CIcore2CCHlhCFAycN8kg7y_xWhXn-VyiJeLUO-0WBQ","pdfSize":"4291539"}