{
  "id": "2412.07574",
  "title": "Optically tuned soliton dynamics in Bose-Einstein condensates within\n  dark traps",
  "authors": "Erwan C\\'elanie, Laurent Delisle, and Amine Jaouadi",
  "authorsParsed": [
    [
      "Célanie",
      "Erwan",
      ""
    ],
    [
      "Delisle",
      "Laurent",
      ""
    ],
    [
      "Jaouadi",
      "Amine",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 15:07:35 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733843255000,
  "abstract": "  This study investigates the formation and dynamics of solitons in\nBose-Einstein condensates (BECs) within dark traps generated by two crossed\nLaguerre-Gaussian (LG) beams with varying azimuthal indices $\\ell$. As the\nindex $\\ell$ increases, the potential transitions from a harmonic trap when\n$\\ell = 1$ to a square-well potential for larger values of $\\ell$. This\ntransition allows us to study a range of soliton dynamics under different\nconfinement conditions while maintaining the same BEC volume. Through the\nderivation of the Gross-Pitaevskii equation (GPE) and under these specific\nconditions in both one-dimensional (1D) and two-dimensional (2D)\nconfigurations, we explore the dynamics of solitons across multiple scenarios.\nThe study examines two primary methods for solitons generation: the temporal\nmodulation of the scattering length and the implementation of an initial\npotential barrier that is subsequently removed. The results indicate that the\ntrap shape plays a critical role in the generation and interaction dynamics of\nsolitons. In harmonic traps, solitons exhibit a behavior different from those\nobserved in anharmonic traps, where the dynamics is significantly influenced by\nthe azimuthal index of the trap. The ability to control soliton dynamics in\nBECs holds significant promise for applications in quantum technologies,\nprecision sensing, and the exploration of fundamental quantum phenomena.\n",
  "subjects": [
    "Condensed Matter/Quantum Gases",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "TbA_4qDazUkyezjOjV9FZi-JdDxZWt9CFywq2o2qPug",
  "pdfSize": "23324782"
}