{"id":"2412.17796","title":"Investigating Prosodic Signatures via Speech Pre-Trained Models for\n  Audio Deepfake Source Attribution","authors":"Orchid Chetia Phukan, Drishti Singh, Swarup Ranjan Behera, Arun Balaji\n  Buduru and Rajesh Sharma","authorsParsed":[["Phukan","Orchid Chetia",""],["Singh","Drishti",""],["Behera","Swarup Ranjan",""],["Buduru","Arun Balaji",""],["Sharma","Rajesh",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 18:53:15 GMT"}],"updateDate":"2024-12-24","timestamp":1734979995000,"abstract":"  In this work, we investigate various state-of-the-art (SOTA) speech\npre-trained models (PTMs) for their capability to capture prosodic signatures\nof the generative sources for audio deepfake source attribution (ADSD). These\nprosodic characteristics can be considered one of major signatures for ADSD,\nwhich is unique to each source. So better is the PTM at capturing prosodic\nsigns better the ADSD performance. We consider various SOTA PTMs that have\nshown top performance in different prosodic tasks for our experiments on\nbenchmark datasets, ASVSpoof 2019 and CFAD. x-vector (speaker recognition PTM)\nattains the highest performance in comparison to all the PTMs considered\ndespite consisting lowest model parameters. This higher performance can be due\nto its speaker recognition pre-training that enables it for capturing unique\nprosodic characteristics of the sources in a better way. Further, motivated\nfrom tasks such as audio deepfake detection and speech recognition, where\nfusion of PTMs representations lead to improved performance, we explore the\nsame and propose FINDER for effective fusion of such representations. With\nfusion of Whisper and x-vector representations through FINDER, we achieved the\ntopmost performance in comparison to all the individual PTMs as well as\nbaseline fusion techniques and attaining SOTA performance.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computer Science/Sound"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"448RplZH9ZCUcgi8bT7P4eIe4ii3VHa0Paa-LH-pqbw","pdfSize":"2363694"}