{"id":"2412.11823","title":"Advancements and Challenges in Bangla Question Answering Models: A\n  Comprehensive Review","authors":"Md Iftekhar Islam Tashik, Abdullah Khondoker, Enam Ahmed Taufik,\n  Antara Firoz Parsa, S M Ishtiak Mahmud","authorsParsed":[["Tashik","Md Iftekhar Islam",""],["Khondoker","Abdullah",""],["Taufik","Enam Ahmed",""],["Parsa","Antara Firoz",""],["Mahmud","S M Ishtiak",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 14:42:26 GMT"}],"updateDate":"2024-12-17","timestamp":1734360146000,"abstract":"  The domain of Natural Language Processing (NLP) has experienced notable\nprogress in the evolution of Bangla Question Answering (QA) systems. This paper\npresents a comprehensive review of seven research articles that contribute to\nthe progress in this domain. These research studies explore different aspects\nof creating question-answering systems for the Bangla language. They cover\nareas like collecting data, preparing it for analysis, designing models,\nconducting experiments, and interpreting results. The papers introduce\ninnovative methods like using LSTM-based models with attention mechanisms,\ncontext-based QA systems, and deep learning techniques based on prior\nknowledge. However, despite the progress made, several challenges remain,\nincluding the lack of well-annotated data, the absence of high-quality reading\ncomprehension datasets, and difficulties in understanding the meaning of words\nin context. Bangla QA models' precision and applicability are constrained by\nthese challenges. This review emphasizes the significance of these research\ncontributions by highlighting the developments achieved in creating Bangla QA\nsystems as well as the ongoing effort required to get past roadblocks and\nimprove the performance of these systems for actual language comprehension\ntasks.\n","subjects":["Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"jtxXyD0xT4nOfAcRDQv3YXvJbmMdBcje-_DioF1ekvg","pdfSize":"279477"}