{"id":"2412.04037","title":"INFP: Audio-Driven Interactive Head Generation in Dyadic Conversations","authors":"Yongming Zhu, Longhao Zhang, Zhengkun Rong, Tianshu Hu, Shuang Liang,\n  Zhipeng Ge","authorsParsed":[["Zhu","Yongming",""],["Zhang","Longhao",""],["Rong","Zhengkun",""],["Hu","Tianshu",""],["Liang","Shuang",""],["Ge","Zhipeng",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 10:20:34 GMT"}],"updateDate":"2024-12-06","timestamp":1733394034000,"abstract":"  Imagine having a conversation with a socially intelligent agent. It can\nattentively listen to your words and offer visual and linguistic feedback\npromptly. This seamless interaction allows for multiple rounds of conversation\nto flow smoothly and naturally. In pursuit of actualizing it, we propose INFP,\na novel audio-driven head generation framework for dyadic interaction. Unlike\nprevious head generation works that only focus on single-sided communication,\nor require manual role assignment and explicit role switching, our model drives\nthe agent portrait dynamically alternates between speaking and listening state,\nguided by the input dyadic audio. Specifically, INFP comprises a Motion-Based\nHead Imitation stage and an Audio-Guided Motion Generation stage. The first\nstage learns to project facial communicative behaviors from real-life\nconversation videos into a low-dimensional motion latent space, and use the\nmotion latent codes to animate a static image. The second stage learns the\nmapping from the input dyadic audio to motion latent codes through denoising,\nleading to the audio-driven head generation in interactive scenarios. To\nfacilitate this line of research, we introduce DyConv, a large scale dataset of\nrich dyadic conversations collected from the Internet. Extensive experiments\nand visualizations demonstrate superior performance and effectiveness of our\nmethod. Project Page: https://grisoon.github.io/INFP/.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"SmhUdYEnZ3y0F5hsF9wAslmriaqtJ1ES7UdpC-BZiwQ","pdfSize":"19757019"}