{"id":"2412.04119","title":"GRAF: Graph Retrieval Augmented by Facts for Romanian Legal Multi-Choice\n  Question Answering","authors":"Cristian-George Cr\\u{a}ciun, R\\u{a}zvan-Alexandru Sm\\u{a}du,\n  Dumitru-Clementin Cercel, Mihaela-Claudia Cercel","authorsParsed":[["Crăciun","Cristian-George",""],["Smădu","Răzvan-Alexandru",""],["Cercel","Dumitru-Clementin",""],["Cercel","Mihaela-Claudia",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 12:37:27 GMT"},{"version":"v2","created":"Thu, 19 Dec 2024 21:11:00 GMT"}],"updateDate":"2024-12-23","timestamp":1733402247000,"abstract":"  Pre-trained Language Models (PLMs) have shown remarkable performances in\nrecent years, setting a new paradigm for NLP research and industry. The legal\ndomain has received some attention from the NLP community partly due to its\ntextual nature. Some tasks from this domain are represented by\nquestion-answering (QA) tasks. This work explores the legal domain\nMultiple-Choice QA (MCQA) for a low-resource language. The contribution of this\nwork is multi-fold. We first introduce JuRO, the first openly available\nRomanian legal MCQA dataset, comprising three different examinations and a\nnumber of 10,836 total questions. Along with this dataset, we introduce CROL,\nan organized corpus of laws that has a total of 93 distinct documents with\ntheir modifications from 763 time spans, that we leveraged in this work for\nInformation Retrieval (IR) techniques. Moreover, we are the first to propose\nLaw-RoG, a Knowledge Graph (KG) for the Romanian language, and this KG is\nderived from the aforementioned corpus. Lastly, we propose a novel approach for\nMCQA, Graph Retrieval Augmented by Facts (GRAF), which achieves competitive\nresults with generally accepted SOTA methods and even exceeds them in most\nsettings.\n","subjects":["Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"W_exB3HD_MVEy8B_DIx2hNL5p7pRKmecOgcu0vJd7oc","pdfSize":"2753058"}