{
  "id": "2412.16040",
  "title": "An Experimental Study Of Netflix Use and the Effects of Autoplay on\n  Watching Behaviors",
  "authors": "Brennan Schaffner, Yaretzi Ulloa, Riya Sahni, Jiatong Li, Ava Kim\n  Cohen, Natasha Messier, Lan Gao, Marshini Chetty",
  "authorsParsed": [
    [
      "Schaffner",
      "Brennan",
      ""
    ],
    [
      "Ulloa",
      "Yaretzi",
      ""
    ],
    [
      "Sahni",
      "Riya",
      ""
    ],
    [
      "Li",
      "Jiatong",
      ""
    ],
    [
      "Cohen",
      "Ava Kim",
      ""
    ],
    [
      "Messier",
      "Natasha",
      ""
    ],
    [
      "Gao",
      "Lan",
      ""
    ],
    [
      "Chetty",
      "Marshini",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 16:40:29 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734712829000,
  "abstract": "  Prior work on dark patterns, or manipulative online interfaces, suggests they\nhave potentially detrimental effects on user autonomy. Dark pattern features,\nlike those designed for attention capture, can potentially extend platform\nsessions beyond that users would have otherwise intended. Existing research,\nhowever, has not formally measured the quantitative effects of these features\non user engagement in subscription video-on-demand platforms (SVODs). In this\nwork, we conducted an experimental study with 76 Netflix users in the US to\nanalyze the impact of a specific attention capture feature, autoplay, on key\nviewing metrics. We found that disabling autoplay on Netflix significantly\nreduced key content consumption aggregates, including average daily watching\nand average session length, partly filling the evidentiary gap regarding the\nempirical effects of dark pattern interfaces. We paired the experimental\nanalysis with users' perceptions of autoplay and their viewing behaviors,\nfinding that participants were split on whether the effects of autoplay\noutweigh its benefits, albeit without knowledge of the study findings. Our\nfindings strengthen the broader argument that manipulative interface designs\ncan and do affect users in potentially damaging ways, highlighting the\ncontinued need for considering user well-being and varied preferences in\ninterface design.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "zQSXcQZHr9Tkssi9zaUBb6RGn6eX-bhGDW7DsVMVhvo",
  "pdfSize": "1332677"
}