{"id":"2412.16711","title":"From Pixels to Gigapixels: Bridging Local Inductive Bias and Long-Range\n  Dependencies with Pixel-Mamba","authors":"Zhongwei Qiu, Hanqing Chao, Tiancheng Lin, Wanxing Chang, Zijiang\n  Yang, Wenpei Jiao, Yixuan Shen, Yunshuo Zhang, Yelin Yang, Wenbin Liu, Hui\n  Jiang, Yun Bian, Ke Yan, Dakai Jin, Le Lu","authorsParsed":[["Qiu","Zhongwei",""],["Chao","Hanqing",""],["Lin","Tiancheng",""],["Chang","Wanxing",""],["Yang","Zijiang",""],["Jiao","Wenpei",""],["Shen","Yixuan",""],["Zhang","Yunshuo",""],["Yang","Yelin",""],["Liu","Wenbin",""],["Jiang","Hui",""],["Bian","Yun",""],["Yan","Ke",""],["Jin","Dakai",""],["Lu","Le",""]],"versions":[{"version":"v1","created":"Sat, 21 Dec 2024 17:45:27 GMT"}],"updateDate":"2024-12-24","timestamp":1734803127000,"abstract":"  Histopathology plays a critical role in medical diagnostics, with whole slide\nimages (WSIs) offering valuable insights that directly influence clinical\ndecision-making. However, the large size and complexity of WSIs may pose\nsignificant challenges for deep learning models, in both computational\nefficiency and effective representation learning. In this work, we introduce\nPixel-Mamba, a novel deep learning architecture designed to efficiently handle\ngigapixel WSIs. Pixel-Mamba leverages the Mamba module, a state-space model\n(SSM) with linear memory complexity, and incorporates local inductive biases\nthrough progressively expanding tokens, akin to convolutional neural networks.\nThis enables Pixel-Mamba to hierarchically combine both local and global\ninformation while efficiently addressing computational challenges. Remarkably,\nPixel-Mamba achieves or even surpasses the quantitative performance of\nstate-of-the-art (SOTA) foundation models that were pretrained on millions of\nWSIs or WSI-text pairs, in a range of tumor staging and survival analysis\ntasks, {\\bf even without requiring any pathology-specific pretraining}.\nExtensive experiments demonstrate the efficacy of Pixel-Mamba as a powerful and\nefficient framework for end-to-end WSI analysis.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ryFmZUtBksOADWx4v4aowQ9UrJ7JsWKpNaITUh3Dhts","pdfSize":"1131575"}