{"id":"2412.18048","title":"Fair Knowledge Tracing in Second Language Acquisition","authors":"Weitao Tang and Guanliang Chen and Shuaishuai Zu and Jiangyi Luo","authorsParsed":[["Tang","Weitao",""],["Chen","Guanliang",""],["Zu","Shuaishuai",""],["Luo","Jiangyi",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 23:47:40 GMT"}],"updateDate":"2024-12-25","timestamp":1734997660000,"abstract":"  In second-language acquisition, predictive modeling aids educators in\nimplementing diverse teaching strategies, attracting significant research\nattention. However, while model accuracy is widely explored, model fairness\nremains under-examined. Model fairness ensures equitable treatment of groups,\npreventing unintentional biases based on attributes such as gender, ethnicity,\nor economic background. A fair model should produce impartial outcomes that do\nnot systematically disadvantage any group.\n  This study evaluates the fairness of two predictive models using the Duolingo\ndataset's en\\_es (English learners speaking Spanish), es\\_en (Spanish learners\nspeaking English), and fr\\_en (French learners speaking English) tracks. We\nanalyze: 1. Algorithmic fairness across platforms (iOS, Android, Web). 2.\nAlgorithmic fairness between developed and developing countries.\n  Key findings include: 1. Deep learning outperforms machine learning in\nsecond-language knowledge tracing due to improved accuracy and fairness. 2.\nBoth models favor mobile users over non-mobile users. 3. Machine learning\nexhibits stronger bias against developing countries compared to deep learning.\n4. Deep learning strikes a better balance of fairness and accuracy in the\nen\\_es and es\\_en tracks, while machine learning is more suitable for fr\\_en.\n  This study highlights the importance of addressing fairness in predictive\nmodels to ensure equitable educational strategies across platforms and regions.\n","subjects":["Computer Science/Human-Computer Interaction","Computer Science/Artificial Intelligence","Computer Science/Computers and Society","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"M_KKT3F7oeS9piiA2DgMoRs0-b7fjRqaXFtdJOUYWyg","pdfSize":"8888704"}