{
  "id": "2412.01001",
  "title": "Chemical Complexity and Prevalence of Life in the Universe: A New Method\n  for the Estimation of Key Terms of Drake Equation",
  "authors": "Lukasz Lamza",
  "authorsParsed": [
    [
      "Lamza",
      "Lukasz",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 23:26:34 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733095594000,
  "abstract": "  I describe a new method of estimating the prevalence of life in the Universe,\nbased on the fact that more chemically complex environments are more rare. The\npaper makes three main claims: (1) There is a statistically significant\n(inverse) relationship between chemical complexity (quantified as the number of\ndifferent types of molecules present in a given environment) and mass fraction\nfor the successively smaller environments in the hierarchy of cosmic matter\n(extragalactic medium, interstellar clouds, dense cores, planetary systems,\ntheir icy fraction etc.) that is well described by a logarithmic law. (2)\nMinimal chemical complexity of life can be roughly defined, based on existing\nstudies in vitro and in silico, both bottom-up (designing increasingly complex\nchemical systems) and top-down (simplifying minimal organisms). (3) Thus, one\ncan estimate the fraction of the total mass density of the Universe that\nresides in reservoirs of chemical complexity estimated as being minimal for\nlife. This is then translated, through simple statistical models of planetary\nsystems, into the number of planets in a single Milky Way-sized galaxy that\nhave, on their surface, reservoirs of biogenic chemical complexity. Two best\nmodels give the estimates of 1.6 (more complex minimal life) and 1.3e4\n(slightly less complex minimal life) as the predicted upper bound for the\nnumber of instances of life per our Galaxy.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "3H0KIdW36T-1N5g7OKCSaKNiO3wNP-OVZ6h6bl5q79E",
  "pdfSize": "378073"
}