{"id":"2412.09963","title":"Phase behavior of hard sheared cube family","authors":"Kaustav Chakraborty and Sumitava Kundu and Avisek Das","authorsParsed":[["Chakraborty","Kaustav",""],["Kundu","Sumitava",""],["Das","Avisek",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 08:44:03 GMT"}],"updateDate":"2024-12-16","timestamp":1734079443000,"abstract":"  A sheared cube is made out of a cube by giving a shear to the body in one\ndirection keeping one of the faces fixed. We investigate here the thermodynamic\nphase behavior of a family of such regular hard sheared cubes, each of the\nmembers of the family having a distinct angle made by the faces with the\nperpendicular on the fixed face. Hard particle Monte Carlo (HPMC) has been\nperformed with these anisotropic building blocks resulting entropy-driven self\nassembly. Thereby computational evidence of discrete plastic crystal phase has\nbeen found in crystal. The discrete plastic crystal phase is known to form\nthrough the spontaneous self-assembly of certain polyhedra. Throughout the\nentire solid regime particle orientations exhibit strong specific correlations\nbefore melting into a liquid, without any evidence of freely rotating plastic\ncrystal at lower density solid. It has been thoroughly observed that\ngeometrical attributes of the shapes don't determine any of the properties that\ndesignate this orientational disorder phase reported here. We also find that\nparticle's rotational symmetric axes and one of the rotational symmetric axes\nof the unit cell of the crystal have a strong relationship in their alignment\nin space. These results, achieved with shapes having crystallographic point\ngroup symmetry, are investigated as being consistent with the phenomenology of\ndiscrete plastic crystal phase established in earlier works with hard particles\nhaving non-crystallographic point group symmetry.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kgeNpyCgQUi6gKxtE3Dz8IxGNClUbkIkdG5kH8tsfJ8","pdfSize":"22789695"}