{"id":"2412.14605","title":"Averaging antisymmetric infinitesimal bialgebra and perm bialgebras","authors":"Bo Hou and Zhanpeng Cui","authorsParsed":[["Hou","Bo",""],["Cui","Zhanpeng",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 07:53:24 GMT"}],"updateDate":"2024-12-20","timestamp":1734594804000,"abstract":"  We establish a bialgebra theory for averaging algebras, called averaging\nantisymmetric infinitesimal bialgebras by generalizing the study of\nantisymmetric infinitesimal bialgebras to the context of averaging algebras.\nThey are characterized by double constructions of averaging Frobenius algebras\nas well as matched pairs of averaging algebras. Antisymmetric solutions of the\nYang-Baxter equation in averaging algebras provide averaging antisymmetric\ninfinitesimal bialgebras. The notions of an $\\mathcal{O}$-operator of an\naveraging algebra and an averaging dendriform algebra are introduced to\nconstruct antisymmetric solutions of the Yang-Baxter equation in an averaging\nalgebra and hence averaging antisymmetric infinitesimal bialgebras. Moreover,\nwe introduce the notion of factorizable averaging antisymmetric infinitesimal\nbialgebras and show that a factorizable averaging antisymmetric infinitesimal\nbialgebra leads to a factorization of the underlying averaging algebra. We\nestablish a one-to-one correspondence between factorizable averaging\nantisymmetric infinitesimal bialgebras and symmetric averaging Frobenius\nalgebras with a Rota-Baxter operator of nonzero weight. Finally, we apply the\nstudy of averaging antisymmetric infinitesimal bialgebras to perm bialgebras,\nextending the construction of perm algebras from commutative averaging algebras\nto the context of bialgebras, which is consistent with the well constructed\ntheory of perm bialgebras.\n","subjects":["Mathematics/Rings and Algebras","Mathematics/Quantum Algebra"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"WYhxtbt8VHJrqkst5_U-uJCMRtaqNTqzSBVKtm7HJoI","pdfSize":"354524"}