{
  "id": "2412.03433",
  "title": "Genetic Algorithm Based System for Path Planning with Unmanned Aerial\n  Vehicles Swarms in Cell-Grid Environments",
  "authors": "Alejandro Puente-Castro, Enrique Fernandez-Blanco, Daniel Rivero",
  "authorsParsed": [
    [
      "Puente-Castro",
      "Alejandro",
      ""
    ],
    [
      "Fernandez-Blanco",
      "Enrique",
      ""
    ],
    [
      "Rivero",
      "Daniel",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 16:24:41 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733329481000,
  "abstract": "  Path Planning methods for autonomously controlling swarms of unmanned aerial\nvehicles (UAVs) are gaining momentum due to their operational advantages. An\nincreasing number of scenarios now require autonomous control of multiple UAVs,\nas autonomous operation can significantly reduce labor costs. Additionally,\nobtaining optimal flight paths can lower energy consumption, thereby extending\nbattery life for other critical operations. Many of these scenarios, however,\ninvolve obstacles such as power lines and trees, which complicate Path\nPlanning. This paper presents an evolutionary computation-based system\nemploying genetic algorithms to address this problem in environments with\nobstacles. The proposed approach aims to ensure complete coverage of areas with\nfixed obstacles, such as in field exploration tasks, while minimizing flight\ntime regardless of map size or the number of UAVs in the swarm. No specific\ngoal points or prior information beyond the provided map is required. The\nexperiments conducted in this study used five maps of varying sizes and\nobstacle densities, as well as a control map without obstacles, with different\nnumbers of UAVs. The results demonstrate that this method can determine optimal\npaths for all UAVs during full map traversal, thus minimizing resource\nconsumption. A comparative analysis with other state-of-the-art approach is\npresented to highlight the advantages and potential limitations of the proposed\nmethod.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "1BG04HPYi8SRCxlViF9-97-xJ7VCNSPYC-kLb2gXTok",
  "pdfSize": "338793"
}