{"id":"2412.15616","title":"Microservices-Based Framework for Predictive Analytics and Real-time\n  Performance Enhancement in Travel Reservation Systems","authors":"Biman Barua and M. Shamim Kaiser","authorsParsed":[["Barua","Biman",""],["Kaiser","M. Shamim",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 07:19:42 GMT"}],"updateDate":"2024-12-23","timestamp":1734679182000,"abstract":"  The paper presents a framework of microservices-based architecture dedicated\nto enhancing the performance of real-time travel reservation systems using the\npower of predictive analytics. Traditional monolithic systems are bad at\nscaling and performing with high loads, causing backup resources to be\nunderutilized along with delays. To overcome the above-stated problems, we\nadopt a modularization approach in decoupling system components into\nindependent services that can grow or shrink according to demand. Our framework\nalso includes real-time predictive analytics, through machine learning models,\nthat optimize forecasting customer demand, dynamic pricing, as well as system\nperformance. With an experimental evaluation applying the approach, we could\nshow that the framework impacts metrics of performance such as response time,\nthroughput, transaction rate of success, and prediction accuracy compared to\ntheir conventional counterparts. Not only does the microservices approach\nimprove scalability and fault tolerance like a usual architecture, but it also\nbrings along timely and accurate predictions, which imply a greater customer\nsatisfaction and efficiency of operation. The integration of real-time\nanalytics would lead to more intelligent decision-making, thereby improving the\nresponse of the system along with the reliability it holds. A scalable,\nefficient framework is offered by such a system to address the modern\nchallenges imposed by any form of travel reservation system while considering\nother complex, data-driven industries as future applications. Future work will\nbe an investigation of advanced AI models and edge processing to further\nimprove the performance and robustness of the systems employed.\n","subjects":["Computer Science/Information Theory","Computer Science/Artificial Intelligence","Computer Science/Computational Engineering, Finance, and Science","Computer Science/Machine Learning","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ivBkIO612-wTOn1zjJdMcrtxl4cPSMQ9bJ1-OXzUylk","pdfSize":"769838"}