{"id":"2412.03501","title":"Non-stoichiometric and Subnano-heterogeneous Ln-incorporated UO2: its\n  defect chemistry and thermal oxidation","authors":"Juejing Liu, Shinhyo Bang, Natalie S. Yaw, Sam Karcher, Emma C.\n  Kindall, Arjen van Veelen, Steven Conradson, Nicolas Clavier, John McCloy,\n  Nicolas Dacheux, Xiaofeng Guo","authorsParsed":[["Liu","Juejing",""],["Bang","Shinhyo",""],["Yaw","Natalie S.",""],["Karcher","Sam",""],["Kindall","Emma C.",""],["van Veelen","Arjen",""],["Conradson","Steven",""],["Clavier","Nicolas",""],["McCloy","John",""],["Dacheux","Nicolas",""],["Guo","Xiaofeng",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 17:44:25 GMT"}],"updateDate":"2024-12-05","timestamp":1733334265000,"abstract":"  The defect chemistry and thermal oxidation of lanthanide (Ln)\nincorporated-UO2 are critical for understanding and predicting their behavior\nas enhanced fuels, mixed oxide (MOX) fuels, spent nuclear fuels (SNF), and\nparticles for safeguard purposes. In this study, we independently controlled\nthe Ln type (Ce4+, Nd3+, and Gd3+) and the preparation condition (reduced and\nnonreduced) to investigate their correlations to the generated non-equilibrated\ndefects correspondingly. From early to late lanthanides: Ce and U formed\nclose-to-ideal solid solutions in Fm-3m and oxidized to (Ce, U)4O9, Nd and U\nmixing under the reducing condition formed solid solutions with oxygen\nvacancies aggregating near Nd, and the mixing of smaller Gd with U resulted in\nshort-range subnano-domain segregations with Ia-3 region embedded in the global\nFm-3m matrix. Both trivalent Ln-incorporated UO2 oxidized to a mixture of (Ln,\nU)4O9 and (Ln, U)3O8. From these signature defect structures resulting from\nboth Ln type and preparation condition, we proposed kinetic model and\nthermodynamic hypothesis for explaining the oxidation resistance of (Ln, U)O2.\nAlthough originated from f-block oxides, the discovery of long-range disorder\nshort-range ordering may be not uncommon in other metal oxide systems, which\ncan strongly influence their functionalities and properties.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3-5so0SFGfWhP_8yIdqdlbxUm3NK8Rm_Y5Db42FACyI","pdfSize":"2049581"}