{"id":"2412.13695","title":"Optical aberrations in autonomous driving: Physics-informed\n  parameterized temperature scaling for neural network uncertainty calibration","authors":"Dominik Werner Wolf and Alexander Braun and Markus Ulrich","authorsParsed":[["Wolf","Dominik Werner",""],["Braun","Alexander",""],["Ulrich","Markus",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 10:36:46 GMT"}],"updateDate":"2024-12-19","timestamp":1734518206000,"abstract":"  'A trustworthy representation of uncertainty is desirable and should be\nconsidered as a key feature of any machine learning method' (Huellermeier and\nWaegeman, 2021). This conclusion of Huellermeier et al. underpins the\nimportance of calibrated uncertainties. Since AI-based algorithms are heavily\nimpacted by dataset shifts, the automotive industry needs to safeguard its\nsystem against all possible contingencies. One important but often neglected\ndataset shift is caused by optical aberrations induced by the windshield. For\nthe verification of the perception system performance, requirements on the AI\nperformance need to be translated into optical metrics by a bijective mapping\n(Braun, 2023). Given this bijective mapping it is evident that the optical\nsystem characteristics add additional information about the magnitude of the\ndataset shift. As a consequence, we propose to incorporate a physical inductive\nbias into the neural network calibration architecture to enhance the robustness\nand the trustworthiness of the AI target application, which we demonstrate by\nusing a semantic segmentation task as an example. By utilizing the Zernike\ncoefficient vector of the optical system as a physical prior we can\nsignificantly reduce the mean expected calibration error in case of optical\naberrations. As a result, we pave the way for a trustworthy uncertainty\nrepresentation and for a holistic verification strategy of the perception\nchain.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"chs5dbhM1ptcrJ47MWBxFbGZ89GVS9dT1Oq34ouLmm0","pdfSize":"14451965"}