{
  "id": "2412.19994",
  "title": "From Generalist to Specialist: A Survey of Large Language Models for\n  Chemistry",
  "authors": "Yang Han, Ziping Wan, Lu Chen, Kai Yu and Xin Chen",
  "authorsParsed": [
    [
      "Han",
      "Yang",
      ""
    ],
    [
      "Wan",
      "Ziping",
      ""
    ],
    [
      "Chen",
      "Lu",
      ""
    ],
    [
      "Yu",
      "Kai",
      ""
    ],
    [
      "Chen",
      "Xin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 03:40:25 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735357225000,
  "abstract": "  Large Language Models (LLMs) have significantly transformed our daily life\nand established a new paradigm in natural language processing (NLP). However,\nthe predominant pretraining of LLMs on extensive web-based texts remains\ninsufficient for advanced scientific discovery, particularly in chemistry. The\nscarcity of specialized chemistry data, coupled with the complexity of\nmulti-modal data such as 2D graph, 3D structure and spectrum, present distinct\nchallenges. Although several studies have reviewed Pretrained Language Models\n(PLMs) in chemistry, there is a conspicuous absence of a systematic survey\nspecifically focused on chemistry-oriented LLMs. In this paper, we outline\nmethodologies for incorporating domain-specific chemistry knowledge and\nmulti-modal information into LLMs, we also conceptualize chemistry LLMs as\nagents using chemistry tools and investigate their potential to accelerate\nscientific research. Additionally, we conclude the existing benchmarks to\nevaluate chemistry ability of LLMs. Finally, we critically examine the current\nchallenges and identify promising directions for future research. Through this\ncomprehensive survey, we aim to assist researchers in staying at the forefront\nof developments in chemistry LLMs and to inspire innovative applications in the\nfield.\n",
  "subjects": [
    "Physics/Chemical Physics",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "PoyUD2b58Ku7mSnDbt-Nc6vOkBzHsvqKbZhROL0ZXek",
  "pdfSize": "6873825"
}