{"id":"2412.17653","title":"Effect of time-dependent sinusoidal electric field on the onset of\n  electroconvection in a viscoelastic fluid layer","authors":"C. Rudresha, C. Balaji, V. Vidya Shree, S. Maruthamanikandan","authorsParsed":[["Rudresha","C.",""],["Balaji","C.",""],["Shree","V. Vidya",""],["Maruthamanikandan","S.",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 15:30:53 GMT"},{"version":"v2","created":"Mon, 30 Dec 2024 16:33:37 GMT"}],"updateDate":"2024-12-31","timestamp":1734967853000,"abstract":"  Time-periodic electric field modulation of a viscoelastic dielectric fluid\nlayer heated from below and cooled from above is examined using an Oldroyd-B\ntype liquid. On the basis of small amplitudes of modulation, the regular\nperturbation method can be used to calculate the threshold for correction of\nthe critical Rayleigh number. The dielectric constant is assumed to be a linear\nfunction of temperature. We show that electric field modulation frequency,\nelectrical, Prandtl number, and viscoelastic parameters are related to the\nshift in the critical Rayleigh number and the possibility of subcritical\nconvection for low-frequency modulation of the electric field. Rayleigh number,\nwavenumber, and frequency stability are determined based on free-free\nisothermal boundary conditions. The dielectrophoretic force is only\ndestabilizing when an electrical field is modulated at a low frequency because\nit is associated with an unmodulated layer of dielectric fluid. As a result of\nthe stress relaxation parameter in a sinusoidal electric field, the system is\ndestabilized at low frequencies and stabilized at moderate and high\nfrequencies. The effect of strain retardation on mechanical anisotropy is\ncompletely opposite. The stability characteristics are illustrated through\ngraphs showing the numerical values of parameters.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TUdh5N_3Qu2Pl2HhOwDn3R4BllxaQOSQntzfG9RXCnI","pdfSize":"573613"}