{
  "id": "2412.09840",
  "title": "LAVA: Lifetime-Aware VM Allocation with Learned Distributions and\n  Adaptation to Mispredictions",
  "authors": "Jianheng Ling, Pratik Worah, Yawen Wang, Yunchuan Kong, Chunlei Wang,\n  Clifford Stein, Diwakar Gupta, Jason Behmer, Logan A. Bush, Prakash Ramanan,\n  Rajesh Kumar, Thomas Chestna, Yajing Liu, Ying Liu, Ye Zhao, Kathryn S.\n  McKinley, Meeyoung Park, Martin Maas",
  "authorsParsed": [
    [
      "Ling",
      "Jianheng",
      ""
    ],
    [
      "Worah",
      "Pratik",
      ""
    ],
    [
      "Wang",
      "Yawen",
      ""
    ],
    [
      "Kong",
      "Yunchuan",
      ""
    ],
    [
      "Wang",
      "Chunlei",
      ""
    ],
    [
      "Stein",
      "Clifford",
      ""
    ],
    [
      "Gupta",
      "Diwakar",
      ""
    ],
    [
      "Behmer",
      "Jason",
      ""
    ],
    [
      "Bush",
      "Logan A.",
      ""
    ],
    [
      "Ramanan",
      "Prakash",
      ""
    ],
    [
      "Kumar",
      "Rajesh",
      ""
    ],
    [
      "Chestna",
      "Thomas",
      ""
    ],
    [
      "Liu",
      "Yajing",
      ""
    ],
    [
      "Liu",
      "Ying",
      ""
    ],
    [
      "Zhao",
      "Ye",
      ""
    ],
    [
      "McKinley",
      "Kathryn S.",
      ""
    ],
    [
      "Park",
      "Meeyoung",
      ""
    ],
    [
      "Maas",
      "Martin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 04:19:28 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734063568000,
  "abstract": "  Scheduling virtual machines (VMs) to hosts in cloud data centers dictates\nefficiency and is an NP-hard problem with incomplete information. Prior work\nimproved VM scheduling with predicted VM lifetimes. Our work further improves\nlifetime-aware scheduling using repredictions with lifetime distributions vs.\none-shot prediction. The approach repredicts and adjusts VM and host lifetimes\nwhen incorrect predictions emerge. We also present novel approaches for\ndefragmentation and regular system maintenance, which are essential to our data\ncenter reliability and optimizations, and are unexplored in prior work. We show\nthat repredictions deliver a fundamental advance in effectiveness over one-shot\nprediction.\n  We call our novel combination of distribution-based lifetime predictions and\nscheduling algorithms Lifetime Aware VM Allocation (LAVA). LAVA improves\nresource stranding and the number of empty hosts, which are critical for large\nVM scheduling, cloud system updates, and reducing dynamic energy consumption.\nOur approach runs in production within Google's hyperscale cloud data centers,\nwhere it improves efficiency by decreasing stranded compute and memory\nresources by ~3% and ~2% respectively, and increases availability for large VMs\nand cloud system updates by increasing empty hosts by 2.3-9.2 pp in production.\nWe also show a reduction in VM migrations for host defragmentation and\nmaintenance. In addition to our fleet-wide production deployment, we perform\nsimulation studies to characterize the design space and show that our algorithm\nsignificantly outperforms the state of the art lifetime-based scheduling\napproach.\n",
  "subjects": [
    "Computer Science/Distributed, Parallel, and Cluster Computing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "9KRgWOI6c1z_wA3aYvwvYbrs9qScJEAF987dkPkF_DE",
  "pdfSize": "1542969"
}