{
  "id": "2412.06859",
  "title": "Generating floorplans for various building functionalities via latent\n  diffusion model",
  "authors": "Mohamed R. Ibrahim, Josef Musil, Irene Gallou",
  "authorsParsed": [
    [
      "Ibrahim",
      "Mohamed R.",
      ""
    ],
    [
      "Musil",
      "Josef",
      ""
    ],
    [
      "Gallou",
      "Irene",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 01:34:22 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733708062000,
  "abstract": "  In the domain of architectural design, the foundational essence of creativity\nand human intelligence lies in the mastery of solving floorplans, a skill\ndemanding distinctive expertise and years of experience. Traditionally, the\narchitectural design process of creating floorplans often requires substantial\nmanual labour and architectural expertise. Even when relying on parametric\ndesign approaches, the process is limited based on the designer's ability to\nbuild a complex set of parameters to iteratively explore design alternatives.\nAs a result, these approaches hinder creativity and limit discovery of an\noptimal solution. Here, we present a generative latent diffusion model that\nlearns to generate floorplans for various building types based on building\nfootprints and design briefs. The introduced model learns from the complexity\nof the inter-connections between diverse building types and the mutations of\narchitectural designs. By harnessing the power of latent diffusion models, this\nresearch surpasses conventional limitations in the design process. The model's\nability to learn from diverse building types means that it cannot only\nreplicate existing designs but also produce entirely new configurations that\nfuse design elements in unexpected ways. This innovation introduces a new\ndimension of creativity into architectural design, allowing architects, urban\nplanners and even individuals without specialised expertise to explore\nuncharted territories of form and function with speed and cost-effectiveness.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "JkWpdYYf0Oplo83OvEu0yyCgHpf3fj4uWM6GHrokTrM",
  "pdfSize": "11900486"
}