{
  "id": "2412.03887",
  "title": "MOANA: Multi-Radar Dataset for Maritime Odometry and Autonomous\n  Navigation Application",
  "authors": "Hyesu Jang, Wooseong Yang, Hanguen Kim, Dongje Lee, Yongjin Kim,\n  Jinbum Park, Minsoo Jeon, Jaeseong Koh, Yejin Kang, Minwoo Jung, Sangwoo\n  Jung, Chng Zhen Hao, Wong Yu Hin, Chew Yihang, and Ayoung Kim",
  "authorsParsed": [
    [
      "Jang",
      "Hyesu",
      ""
    ],
    [
      "Yang",
      "Wooseong",
      ""
    ],
    [
      "Kim",
      "Hanguen",
      ""
    ],
    [
      "Lee",
      "Dongje",
      ""
    ],
    [
      "Kim",
      "Yongjin",
      ""
    ],
    [
      "Park",
      "Jinbum",
      ""
    ],
    [
      "Jeon",
      "Minsoo",
      ""
    ],
    [
      "Koh",
      "Jaeseong",
      ""
    ],
    [
      "Kang",
      "Yejin",
      ""
    ],
    [
      "Jung",
      "Minwoo",
      ""
    ],
    [
      "Jung",
      "Sangwoo",
      ""
    ],
    [
      "Hao",
      "Chng Zhen",
      ""
    ],
    [
      "Hin",
      "Wong Yu",
      ""
    ],
    [
      "Yihang",
      "Chew",
      ""
    ],
    [
      "Kim",
      "Ayoung",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 05:40:40 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 10 Dec 2024 09:48:23 GMT"
    },
    {
      "version": "v3",
      "created": "Mon, 16 Dec 2024 04:21:55 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1733377240000,
  "abstract": "  Maritime environmental sensing requires overcoming challenges from complex\nconditions such as harsh weather, platform perturbations, large dynamic\nobjects, and the requirement for long detection ranges. While cameras and LiDAR\nare commonly used in ground vehicle navigation, their applicability in maritime\nsettings is limited by range constraints and hardware maintenance issues. Radar\nsensors, however, offer robust long-range detection capabilities and resilience\nto physical contamination from weather and saline conditions, making it a\npowerful sensor for maritime navigation. Among various radar types, X-band\nradar (e.g., marine radar) is widely employed for maritime vessel navigation,\nproviding effective long-range detection essential for situational awareness\nand collision avoidance. Nevertheless, it exhibits limitations during berthing\noperations where close-range object detection is critical. To address this\nshortcoming, we incorporate W-band radar (e.g., Navtech imaging radar), which\nexcels in detecting nearby objects with a higher update rate. We present a\ncomprehensive maritime sensor dataset featuring multi-range detection\ncapabilities. This dataset integrates short-range LiDAR data, medium-range\nW-band radar data, and long-range X-band radar data into a unified framework.\nAdditionally, it includes object labels for oceanic object detection usage,\nderived from radar and stereo camera images. The dataset comprises seven\nsequences collected from diverse regions with varying levels of estimation\ndifficulty, ranging from easy to challenging, and includes common locations\nsuitable for global localization tasks. This dataset serves as a valuable\nresource for advancing research in place recognition, odometry estimation,\nSLAM, object detection, and dynamic object elimination within maritime\nenvironments. Dataset can be found in following link:\nhttps://sites.google.com/view/rpmmoana\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "2UNGtWuTCmz4YuH_Cd48GUC9zKQqxLZe748pEGjeecM",
  "pdfSize": "16076198"
}