{"id":"2412.08960","title":"Magnetic polarisability of octet baryons near the physical quark-mass\n  point","authors":"Thomas Kabelitz, Waseem Kamleh, Derek Leinweber","authorsParsed":[["Kabelitz","Thomas",""],["Kamleh","Waseem",""],["Leinweber","Derek",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 05:46:46 GMT"}],"updateDate":"2024-12-13","timestamp":1733982406000,"abstract":"  The magnetic polarisabilities of octet baryons are calculated close to the\nphysical quark-mass point using the background field method in lattice QCD.\nThis first calculation draws on the identification and elimination of\nexceptional configurations that have hindered previous attempts. The origin of\nthe exceptional configuration problem lies in the use of a Wilson-type fermion\naction on electro-quenched gauge field configurations, where the\ndynamical-fermion gauge-field generation algorithm the electric charges of the\nquarks. Changes in the fermion determinant that would suppress some gauge\nfields in the background magnetic field are neglected, leaving improbable gauge\nfields that generate large additive mass renormalisations which manifest as\nsignificant outliers in correlation-function distributions. An algorithm for\nthe systematic identification and removal of these exceptional configurations\nis described. We find the light up and down quarks to be problematic,\nparticularly the up quark with its larger electric charge. The heavier mass of\nthe strange quark protects the hyperon correlation functions to some extent.\nHowever, these also benefit from the removal of exceptional configurations. In\nmany cases, the magnetic polarisability is calculated with good precision. We\nfind our results to be in accord with the behaviour anticipated by chiral\nperturbation theory.\n","subjects":["Physics/High Energy Physics - Lattice","Physics/High Energy Physics - Phenomenology","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lRCI9kfJqoEPDvrjk_DP994qowS2dDe2E5YEpS9RnVk","pdfSize":"26742304"}