{
  "id": "2412.17527",
  "title": "Enhancing Cancer Diagnosis with Explainable & Trustworthy Deep Learning\n  Models",
  "authors": "Badaru I. Olumuyiwa, The Anh Han and Zia U. Shamszaman",
  "authorsParsed": [
    [
      "Olumuyiwa",
      "Badaru I.",
      ""
    ],
    [
      "Han",
      "The Anh",
      ""
    ],
    [
      "Shamszaman",
      "Zia U.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 12:50:47 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734958247000,
  "abstract": "  This research presents an innovative approach to cancer diagnosis and\nprediction using explainable Artificial Intelligence (XAI) and deep learning\ntechniques. With cancer causing nearly 10 million deaths globally in 2020,\nearly and accurate diagnosis is crucial. Traditional methods often face\nchallenges in cost, accuracy, and efficiency. Our study develops an AI model\nthat provides precise outcomes and clear insights into its decision-making\nprocess, addressing the \"black box\" problem of deep learning models. By\nemploying XAI techniques, we enhance interpretability and transparency,\nbuilding trust among healthcare professionals and patients. Our approach\nleverages neural networks to analyse extensive datasets, identifying patterns\nfor cancer detection. This model has the potential to revolutionise diagnosis\nby improving accuracy, accessibility, and clarity in medical decision-making,\npossibly leading to earlier detection and more personalised treatment\nstrategies. Furthermore, it could democratise access to high-quality\ndiagnostics, particularly in resource-limited settings, contributing to global\nhealth equity. The model's applications extend beyond cancer diagnosis,\npotentially transforming various aspects of medical decision-making and saving\nmillions of lives worldwide.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "OxMFf44oron1lMx-bt2tX8UZlQGJtwbR39XM8pTakz0",
  "pdfSize": "2607148"
}