{"id":"2412.05176","title":"Who Sets the Agenda on Social Media? Ideology and Polarization in Online\n  Debates","authors":"Edoardo Loru, Alessandro Galeazzi, Anita Bonetti, Emanuele Sangiorgio,\n  Niccol\\`o Di Marco, Matteo Cinelli, Andrea Baronchelli, Walter Quattrociocchi","authorsParsed":[["Loru","Edoardo",""],["Galeazzi","Alessandro",""],["Bonetti","Anita",""],["Sangiorgio","Emanuele",""],["Di Marco","Niccolò",""],["Cinelli","Matteo",""],["Baronchelli","Andrea",""],["Quattrociocchi","Walter",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 16:48:22 GMT"}],"updateDate":"2024-12-09","timestamp":1733503702000,"abstract":"  The abundance of information on social media has reshaped public discussions,\nshifting attention to the mechanisms that drive online discourse. This study\nanalyzes large-scale Twitter (now X) data from three global debates -- Climate\nChange, COVID-19, and the Russo-Ukrainian War -- to investigate the structural\ndynamics of engagement. Our findings reveal that discussions are not primarily\nshaped by specific categories of actors, such as media or activists, but by\nshared ideological alignment. Users consistently form polarized communities,\nwhere their ideological stance in one debate predicts their positions in\nothers. This polarization transcends individual topics, reflecting a broader\npattern of ideological divides. Furthermore, the influence of individual actors\nwithin these communities appears secondary to the reinforcing effects of\nselective exposure and shared narratives. Overall, our results underscore that\nideological alignment, rather than actor prominence, plays a central role in\nstructuring online discourse and shaping the spread of information in polarized\nenvironments.\n","subjects":["Computer Science/Social and Information Networks","Computer Science/Computers and Society","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"F7JF4tuFI_B93r4SzE20f2qaK8lawcC-RZh4VKj9CyE","pdfSize":"1234538"}