{"id":"2412.17767","title":"ResearchTown: Simulator of Human Research Community","authors":"Haofei Yu, Zhaochen Hong, Zirui Cheng, Kunlun Zhu, Keyang Xuan, Jinwei\n  Yao, Tao Feng, Jiaxuan You","authorsParsed":[["Yu","Haofei",""],["Hong","Zhaochen",""],["Cheng","Zirui",""],["Zhu","Kunlun",""],["Xuan","Keyang",""],["Yao","Jinwei",""],["Feng","Tao",""],["You","Jiaxuan",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 18:26:53 GMT"}],"updateDate":"2024-12-24","timestamp":1734978413000,"abstract":"  Large Language Models (LLMs) have demonstrated remarkable potential in\nscientific domains, yet a fundamental question remains unanswered: Can we\nsimulate human research communities with LLMs? Addressing this question can\ndeepen our understanding of the processes behind idea brainstorming and inspire\nthe automatic discovery of novel scientific insights. In this work, we propose\nResearchTown, a multi-agent framework for research community simulation. Within\nthis framework, the human research community is simplified and modeled as an\nagent-data graph, where researchers and papers are represented as agent-type\nand data-type nodes, respectively, and connected based on their collaboration\nrelationships. We also introduce TextGNN, a text-based inference framework that\nmodels various research activities (e.g., paper reading, paper writing, and\nreview writing) as special forms of a unified message-passing process on the\nagent-data graph. To evaluate the quality of the research simulation, we\npresent ResearchBench, a benchmark that uses a node-masking prediction task for\nscalable and objective assessment based on similarity. Our experiments reveal\nthree key findings: (1) ResearchTown can provide a realistic simulation of\ncollaborative research activities, including paper writing and review writing;\n(2) ResearchTown can maintain robust simulation with multiple researchers and\ndiverse papers; (3) ResearchTown can generate interdisciplinary research ideas\nthat potentially inspire novel research directions.\n","subjects":["Computer Science/Computation and Language","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bCoaVtkvUZw8plNVteo5vzKXg7wCCotQo84R-o0VzHg","pdfSize":"735833"}