{
  "id": "2412.03858",
  "title": "Un-evaluated Solutions May Be Valuable in Expensive Optimization",
  "authors": "Hao Hao, Xiaoqun Zhang, Aimin Zhou",
  "authorsParsed": [
    [
      "Hao",
      "Hao",
      ""
    ],
    [
      "Zhang",
      "Xiaoqun",
      ""
    ],
    [
      "Zhou",
      "Aimin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 04:06:30 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733371590000,
  "abstract": "  Expensive optimization problems (EOPs) are prevalent in real-world\napplications, where the evaluation of a single solution requires a significant\namount of resources. In our study of surrogate-assisted evolutionary algorithms\n(SAEAs) in EOPs, we discovered an intriguing phenomenon. Because only a limited\nnumber of solutions are evaluated in each iteration, relying solely on these\nevaluated solutions for evolution can lead to reduced disparity in successive\npopulations. This, in turn, hampers the reproduction operators' ability to\ngenerate superior solutions, thereby reducing the algorithm's convergence\nspeed. To address this issue, we propose a strategic approach that incorporates\nhigh-quality, un-evaluated solutions predicted by surrogate models during the\nselection phase. This approach aims to improve the distribution of evaluated\nsolutions, thereby generating a superior next generation of solutions. This\nwork details specific implementations of this concept across various\nreproduction operators and validates its effectiveness using multiple surrogate\nmodels. Experimental results demonstrate that the proposed strategy\nsignificantly enhances the performance of surrogate-assisted evolutionary\nalgorithms. Compared to mainstream SAEAs and Bayesian optimization algorithms,\nour approach incorporating the un-evaluated solution strategy shows a marked\nimprovement.\n",
  "subjects": [
    "Computer Science/Neural and Evolutionary Computing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fYZKjojVTjBn4cczdc_OSBIRjY1hggfYIsvp9H_PLjo",
  "pdfSize": "803929"
}