{
  "id": "2412.12568",
  "title": "Two-dimensional imaging of electromagnetic fields via light sheet\n  fluorescence imaging with Rydberg atoms",
  "authors": "Noah Schlossberger, Tate McDonald, Kevin Su, Rajavardhan Talashila,\n  Robert Behary, Charles L. Patrick, Daniel Hammerland, Eugeniy E. Mikhailov,\n  Seth Aubin, Irina Novikova, Christopher L. Holloway, and Nikunjkumar\n  Prajapati",
  "authorsParsed": [
    [
      "Schlossberger",
      "Noah",
      ""
    ],
    [
      "McDonald",
      "Tate",
      ""
    ],
    [
      "Su",
      "Kevin",
      ""
    ],
    [
      "Talashila",
      "Rajavardhan",
      ""
    ],
    [
      "Behary",
      "Robert",
      ""
    ],
    [
      "Patrick",
      "Charles L.",
      ""
    ],
    [
      "Hammerland",
      "Daniel",
      ""
    ],
    [
      "Mikhailov",
      "Eugeniy E.",
      ""
    ],
    [
      "Aubin",
      "Seth",
      ""
    ],
    [
      "Novikova",
      "Irina",
      ""
    ],
    [
      "Holloway",
      "Christopher L.",
      ""
    ],
    [
      "Prajapati",
      "Nikunjkumar",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 05:52:41 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 18 Dec 2024 04:35:01 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734414761000,
  "abstract": "  The ability to image electromagnetic fields holds key scientific and\nindustrial applications, including electromagnetic compatibility, diagnostics\nof high-frequency devices, and experimental scientific work involving field\ninteractions. Generally electric and magnetic field measurements require\nconductive elements which significantly distort the field. However,\nelectromagnetic fields can be measured without altering the field via the shift\nthey induce on Rydberg states of alkali atoms in atomic vapor, which are highly\nsensitive to electric fields. Previous field measurements using Rydberg atoms\nutilized electromagnetically induced transparency to read out the shift on the\nstates induced by the fields, but did not provide spatial resolution. In this\nwork, we demonstrate that electromagnetically induced transparency can be\nspatially resolved by imaging the fluorescence of the atoms. We demonstrate\nthat this can be used to image $\\sim$ V/cm scale electric fields in the DC-GHz\nrange and $\\sim$ mT scale static magnetic fields, with minimal distortion to\nthe fields. We also demonstrate the ability to image $\\sim$ 5 mV/cm scale\nfields for resonant microwave radiation and measure standing waves generated by\nthe partial reflection of the vapor cell walls in this regime. With additional\nprocessing techniques like lock-in detection, we predict that our sensitivities\ncould reach down to nV/cm levels. We perform this field imaging with a spatial\nresolution of 160 $\\mu$m, limited by our imaging system, and estimate the\nfundamental resolution limitation to be 5 $\\mu$m.\n",
  "subjects": [
    "Physics/Atomic Physics",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-LuY0J15HkHgXXVwBBBzFi3S_9_2580YsRUzVO8Zmoc",
  "pdfSize": "12451683"
}