{
  "id": "2412.08972",
  "title": "RuleArena: A Benchmark for Rule-Guided Reasoning with LLMs in Real-World\n  Scenarios",
  "authors": "Ruiwen Zhou, Wenyue Hua, Liangming Pan, Sitao Cheng, Xiaobao Wu, En\n  Yu, William Yang Wang",
  "authorsParsed": [
    [
      "Zhou",
      "Ruiwen",
      ""
    ],
    [
      "Hua",
      "Wenyue",
      ""
    ],
    [
      "Pan",
      "Liangming",
      ""
    ],
    [
      "Cheng",
      "Sitao",
      ""
    ],
    [
      "Wu",
      "Xiaobao",
      ""
    ],
    [
      "Yu",
      "En",
      ""
    ],
    [
      "Wang",
      "William Yang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 06:08:46 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733983726000,
  "abstract": "  This paper introduces RuleArena, a novel and challenging benchmark designed\nto evaluate the ability of large language models (LLMs) to follow complex,\nreal-world rules in reasoning. Covering three practical domains -- airline\nbaggage fees, NBA transactions, and tax regulations -- RuleArena assesses LLMs'\nproficiency in handling intricate natural language instructions that demand\nlong-context understanding, logical reasoning, and accurate mathematical\ncomputation. Two key attributes distinguish RuleArena from traditional\nrule-based reasoning benchmarks: (1) it extends beyond standard first-order\nlogic representations, and (2) it is grounded in authentic, practical\nscenarios, providing insights into the suitability and reliability of LLMs for\nreal-world applications. Our findings reveal several notable limitations in\nLLMs: (1) they struggle to identify and apply the appropriate rules, frequently\nbecoming confused by similar but distinct regulations, (2) they cannot\nconsistently perform accurate mathematical computations, even when they\ncorrectly identify the relevant rules, and (3) in general, they perform poorly\nin the benchmark. These results highlight significant challenges in advancing\nLLMs' rule-guided reasoning capabilities in real-life applications.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "bb0Ju4jyeBX4hKxVA2aEcZvphzsVVyIMTO0kxsuReuo",
  "pdfSize": "948112"
}