{
  "id": "2412.13953",
  "title": "Towards privacy-preserving cooperative control via encrypted distributed\n  optimization",
  "authors": "Philipp Binfet, Janis Adamek, Nils Schl\\\"uter, and Moritz Schulze\n  Darup",
  "authorsParsed": [
    [
      "Binfet",
      "Philipp",
      ""
    ],
    [
      "Adamek",
      "Janis",
      ""
    ],
    [
      "Schlüter",
      "Nils",
      ""
    ],
    [
      "Darup",
      "Moritz Schulze",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 15:32:45 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734535965000,
  "abstract": "  Cooperative control is crucial for the effective operation of dynamical\nmulti-agent systems. Especially for distributed control schemes, it is\nessential to exchange data between the agents. This becomes a privacy threat if\nthe data is sensitive. Encrypted control has shown the potential to address\nthis risk and ensure confidentiality. However, existing approaches mainly focus\non cloud-based control and distributed schemes are restrictive.\n  In this paper, we present a novel privacy-preserving cooperative control\nscheme based on encrypted distributed optimization. More precisely, we focus on\na secure distributed solution of a general consensus problem, which has\nmanifold applications in cooperative control, by means of the alternating\ndirection method of multipliers (ADMM). As a unique feature of our approach, we\nexplicitly take into account the common situation that local decision variables\ncontain copies of quantities associated with neighboring agents and ensure the\nneighbor's privacy. We show the effectiveness of our method based on a\nnumerical case study dealing with the formation of mobile robots.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "dgcZgY-u5l_v3E95--s97UhQFsxD0GnyiKIIN2nHalM",
  "pdfSize": "919279"
}