{"id":"2412.04713","title":"States Violating Both Locality and Noncontextuality Inequalities in\n  Quantum Theory","authors":"Yuichiro Kitajima","authorsParsed":[["Kitajima","Yuichiro",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 02:06:00 GMT"}],"updateDate":"2024-12-09","timestamp":1733450760000,"abstract":"  The CHSH inequality is an inequality used to test locality in quantum theory\nand is recognized as one of Bell's inequalities. In contrast, the KCBS\ninequality is employed to test noncontextuality in quantum theory. While\ncertain quantum states are known to violate these inequalities individually, it\nwas previously assumed that no state could violate both inequalities\nsimultaneously. This assumption is encapsulated in the concept of the `monogamy\nrelation.' It describes a trade-off between nonlocality and contextuality: the\nviolation of one inequality typically excludes the possibility of violating the\nother. However, Xue et al. demonstrated that simultaneous violations of both\nthe CHSH and KCBS inequalities are possible with specific choices of\nobservables. This discovery challenges the universal validity of the monogamy\nrelation. It also suggests that the relationship between contextuality and\nnonlocality is more complex than previously understood. They further showed\nthat numerous scenarios exist where both the CHSH inequality and a\ncontextuality inequality involving more than five observables are violated.\nHowever, the number of such scenarios is finite.\n  Building on this, we present two main results. The first is that there are\ninfinitely many scenarios in which both the CHSH inequality and a contextuality\ninequality involving an odd number of observables are violated. This finding\nreveals the existence of infinitely many scenarios where the monogamy relation\nbetween the CHSH inequality and the noncontextuality inequality no longer\nholds. The second is that certain quantum states violate both the KCBS\ninequality and a nonlocality inequality distinct from the CHSH inequality.\nThese insights deepen our understanding of the complex relationship between\nnonlocality and contextuality, and open avenues for exploring state-dependent\ninequalities and their physical implications.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OoyYMftTl3hFdfTukiGglbd4gLR7ov52e-5CyAKowpE","pdfSize":"194011"}