{
  "id": "2412.08707",
  "title": "Holographic dual of Bures metric and subregion complexity",
  "authors": "Marius Gerbershagen, Juan Hernandez, Mikhail Khramtsov, Maria Knysh",
  "authorsParsed": [
    [
      "Gerbershagen",
      "Marius",
      ""
    ],
    [
      "Hernandez",
      "Juan",
      ""
    ],
    [
      "Khramtsov",
      "Mikhail",
      ""
    ],
    [
      "Knysh",
      "Maria",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 19:00:01 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733943601000,
  "abstract": "  Within the AdS/CFT correspondence, computational complexity for reduced\ndensity matrices of holographic conformal field theories has been conjectured\nto be related to certain geometric observables in the dual gravity theory. We\nstudy this conjecture from both the gravity and field theory point of view.\nSpecifically, we consider a measure of complexity associated to the Bures\nmetric on the space of density matrices. We compute this complexity measure for\nmixed states associated to single intervals in descendant states of the vacuum\nin 2d CFTs. Moreover, we derive from first principles a geometric observable\ndual to the Bures metric which is localized in the entanglement wedge of the\nAdS spacetime associated to the quantum circuit on the boundary. Finally, we\ncompare the Bures metric complexity measure with holographic subregion\ncomplexity within the ``complexity=volume'' paradigm for perturbatively small\ntransformations of the vacuum. While there is no exact agreement between these\ntwo quantities, we find striking similarities as we vary the target state and\ninterval size, suggesting that these quantities are closely related.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "CfnXT4el90pedIqJkVWdz3NIvm5cxjuW4ZzP8mXm5s4",
  "pdfSize": "864891"
}