{"id":"2412.01656","title":"STLGame: Signal Temporal Logic Games in Adversarial Multi-Agent Systems","authors":"Shuo Yang, Hongrui Zheng, Cristian-Ioan Vasile, George Pappas, Rahul\n  Mangharam","authorsParsed":[["Yang","Shuo",""],["Zheng","Hongrui",""],["Vasile","Cristian-Ioan",""],["Pappas","George",""],["Mangharam","Rahul",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 16:05:18 GMT"}],"updateDate":"2024-12-03","timestamp":1733155518000,"abstract":"  We study how to synthesize a robust and safe policy for autonomous systems\nunder signal temporal logic (STL) tasks in adversarial settings against unknown\ndynamic agents. To ensure the worst-case STL satisfaction, we propose STLGame,\na framework that models the multi-agent system as a two-player zero-sum game,\nwhere the ego agents try to maximize the STL satisfaction and other agents\nminimize it. STLGame aims to find a Nash equilibrium policy profile, which is\nthe best case in terms of robustness against unseen opponent policies, by using\nthe fictitious self-play (FSP) framework. FSP iteratively converges to a Nash\nprofile, even in games set in continuous state-action spaces. We propose a\ngradient-based method with differentiable STL formulas, which is crucial in\ncontinuous settings to approximate the best responses at each iteration of FSP.\nWe show this key aspect experimentally by comparing with reinforcement\nlearning-based methods to find the best response. Experiments on two standard\ndynamical system benchmarks, Ackermann steering vehicles and autonomous drones,\ndemonstrate that our converged policy is almost unexploitable and robust to\nvarious unseen opponents' policies. All code and additional experimental\nresults can be found on our project website:\nhttps://sites.google.com/view/stlgame\n","subjects":["Computer Science/Robotics","Computer Science/Multiagent Systems","Computer Science/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"oGH0at0nqHAMa9qjg2FyA2tGbXWYyToW8pbZK2Kp_ck","pdfSize":"666154"}