{"id":"2412.16567","title":"Federal Learning Framework for Quality Evaluation of Blastomere Cleavage","authors":"Jung-Hua Wang, Huai-Wen Chang, Rong-Yu Wu, Ting-Yuan Wang, Ming-Jer\n  Chen, Yu-Chiao Yi","authorsParsed":[["Wang","Jung-Hua",""],["Chang","Huai-Wen",""],["Wu","Rong-Yu",""],["Wang","Ting-Yuan",""],["Chen","Ming-Jer",""],["Yi","Yu-Chiao",""]],"versions":[{"version":"v1","created":"Sat, 21 Dec 2024 10:20:56 GMT"}],"updateDate":"2025-01-09","timestamp":1734776456000,"abstract":"  This study addresses the issue of leveraging federated learning to improve\ndata privacy and performance in IVF embryo selection. The EM\n(Expectation-Maximization) algorithm is incorporated into deep learning models\nto form a federated learning framework for quality evaluation of blastomere\ncleavage using two-dimensional images. The framework comprises a server site\nand several client sites characterized in that each is locally trained with an\nEM algorithm. Upon the completion of the local EM training, a separate 5-mode\nmixture distribution is generated for each client, the clients' distribution\nstatics are then uploaded to the server site and aggregated therein to produce\na global (sharing) 5-mode distribution. During the inference phase, each client\nuses image classifiers and an instance segmentor, assisted by the global 5-mode\ndistribution acting as a calibrator to (1) identify the absolute cleavage\ntiming of blastomere, i.e., tPNa, tPNf, t2, t3, t4, t5, t6, t7, and t8, (2)\ntrack the cleavage process of blastomeres to detect the irregular cleavage\npatterns, and (3) assess the symmetry degree of blastomeres. Experimental\nresults show that the proposed method outperforms commercial Time-Lapse\nIncubators in reducing the average error of timing prediction by twofold. The\nproposed facilitate frameworks the adaptability and scalability of classifiers\nand segmentor to data variability associated with patients in different\nlocations or countries.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8YdtJ2gK2GunG1FJoQORP7fka_oDm6v-y7MpFAHRMxU","pdfSize":"1026507"}