{"id":"2412.07492","title":"Cogwheel phase cycling in population-detected optical coherent\n  multidimensional spectroscopy","authors":"Ajay Jayachandran, Stefan Mueller, Tobias Brixner","authorsParsed":[["Jayachandran","Ajay",""],["Mueller","Stefan",""],["Brixner","Tobias",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 13:18:23 GMT"}],"updateDate":"2024-12-11","timestamp":1733836703000,"abstract":"  An integral procedure in every coherent multidimensional spectroscopy\nexperiment is to suppress undesired background signals. For that purpose, one\ncan employ a particular phase-matching geometry or phase cycling, a procedure\nthat was adapted from nuclear magnetic resonance (NMR) spectroscopy. In optical\nmultidimensional spectroscopy, phase cycling has been usually carried out in a\n\"nested\" fashion, where pulse phases are incremented sequentially with linearly\nspaced increments. Another phase-cycling approach which was developed for NMR\nspectroscopy is \"cogwheel phase cycling,\" where all pulse phases are varied\nsimultaneously in increments defined by so-called \"winding numbers\". Here we\nexplore the concept of cogwheel phase cycling in the context of\npopulation-based coherent multidimensional spectroscopy. We derive selection\nrules for resolving and extracting fourth-order and higher-order nonlinear\nsignals by cogwheel phase cycling and describe how to perform a numerical\nsearch for the winding numbers for various population-detected 2D spectroscopy\nexperiments. We also provide an expression for a numerical search for nested\nphase-cycling schemes and predict the most economical schemes of both\napproaches for a wide range of nonlinear signals. The signal selectivity of the\ntechnique is demonstrated experimentally by acquiring rephasing and\nnonrephasing fourth-order signals of a laser dye by both phase-cycling\napproaches. We find that individual nonlinear signal contributions are, in most\ncases, captured with fewer steps by cogwheel phase cycling compared to nested\nphase cycling.\n","subjects":["Physics/Optics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IjIVqYJhBrsPqbWUgoZ9xqzEqy130xqKrbfLOD2izy0","pdfSize":"6230176"}