{"id":"2412.17627","title":"Critical, compensation and hysteresis behaviors studies in the\n  ferrimagnetic Blume-Capel model with mixed half-integer spin-(3/2, 7/2):\n  Exact recursion relations calculations","authors":"M. Kake, S. I. V. Hontinfinde, M. Karimou, R. Houenou, E. Albayrak, R.\n  A. A. Yessoufou, A. Kpadonou","authorsParsed":[["Kake","M.",""],["Hontinfinde","S. I. V.",""],["Karimou","M.",""],["Houenou","R.",""],["Albayrak","E.",""],["Yessoufou","R. A. A.",""],["Kpadonou","A.",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 14:58:48 GMT"},{"version":"v2","created":"Mon, 30 Dec 2024 16:35:19 GMT"}],"updateDate":"2024-12-31","timestamp":1734965928000,"abstract":"  The exact recursion relations are used to study the mixed half-integer\nspin-(3/2, 7/2) Blume-Capel Ising ferrimagnetic system on the Bethe lattice.\nGround-state phase diagrams are computed in the $({D_{A}}/{q|J|},\n{D_{B}}/{q|J|})$ plane to reveal different possible ground states of the model.\nUsing the thermal changes of the order-parameters, interesting temperature\ndependent phase diagrams are constructed in the ($D_{A}/|J|$, $kT/|J|$),\n($D_{B}/|J|$, $kT/|J|$) planes as well as in the ($D/|J|$, $kT/|J|$) plane\nwhere $D=D_A=D_B$. It is revealed that the system exhibits first- and\nsecond-order phase transitions and compensation temperatures for specific model\nparameter values. Under the constraint of an external magnetic field, the model\nalso produces multi-hysteresis behaviors as single, double and triple\nhysteresis cycles. Particularly, the impacts of the ferrimagnetic coupling $J$\non the remanent magnetization and the coercitive fields for selected values of\nthe other physical parameters of the system are pointed out. Our numerical\nresults are qualitatively consistent with those reported in the literature.\n","subjects":["Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"E2jB099DMYRTe_RWtG7BI24N3cQDYOkpxrW609K5Lns","pdfSize":"771062"}