{
  "id": "2412.13638",
  "title": "A Constraint Embedding Approach for Dynamics Modeling of Parallel\n  Kinematic Manipulators with Hybrid Limbs",
  "authors": "Andreas Mueller",
  "authorsParsed": [
    [
      "Mueller",
      "Andreas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 09:09:53 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734512993000,
  "abstract": "  Parallel kinematic manipulators (PKM) are characterized by closed kinematic\nloops, due to the parallel arrangement of limbs but also due to the existence\nof kinematic loops within the limbs. Moreover, many PKM are built with limbs\nconstructed by serially combining kinematic loops. Such limbs are called\nhybrid, which form a particular class of complex limbs. Design and model-based\ncontrol requires accurate dynamic PKM models desirably without model\nsimplifications. Dynamics modeling then necessitates kinematic relations of all\nmembers of the PKM, in contrast to the standard kinematics modeling of PKM,\nwhere only the forward and inverse kinematics solution for the manipulator\n(relating input and output motions) are computed. This becomes more involved\nfor PKM with hybrid limbs. In this paper a modular modeling approach is\nemployed, where limbs are treated separately, and the individual dynamic\nequations of motions (EOM) are subsequently assembled to the overall model. Key\nto the kinematic modeling is the constraint resolution for the individual loops\nwithin the limbs. This local constraint resolution is a special case of the\ngeneral \\emph{constraint embedding} technique. The proposed method finally\nallows for a systematic modeling of general PKM. The method is demonstrated for\nthe IRSBot-2, where each limb comprises two independent loops.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Mathematics/Dynamical Systems",
    "Mathematics/Group Theory",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xmVaASlck9rWk454fUYPwcwssZ83kAENaMaV39moQqg",
  "pdfSize": "8410182"
}