{
  "id": "2412.07977",
  "title": "Thinking Fast and Laterally: Multi-Agentic Approach for Reasoning about\n  Uncertain Emerging Events",
  "authors": "Stefan Dernbach, Alejandro Michel, Khushbu Agarwal, Christopher\n  Brissette, Geetika Gupta, and Sutanay Choudhury",
  "authorsParsed": [
    [
      "Dernbach",
      "Stefan",
      ""
    ],
    [
      "Michel",
      "Alejandro",
      ""
    ],
    [
      "Agarwal",
      "Khushbu",
      ""
    ],
    [
      "Brissette",
      "Christopher",
      ""
    ],
    [
      "Gupta",
      "Geetika",
      ""
    ],
    [
      "Choudhury",
      "Sutanay",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 23:29:11 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733873351000,
  "abstract": "  This paper introduces lateral thinking to implement System-2 reasoning\ncapabilities in AI systems, focusing on anticipatory and causal reasoning under\nuncertainty. We present a framework for systematic generation and modeling of\nlateral thinking queries and evaluation datasets. We introduce Streaming\nAgentic Lateral Thinking (SALT), a multi-agent framework designed to process\ncomplex, low-specificity queries in streaming data environments. SALT\nimplements lateral thinking-inspired System-2 reasoning through a dynamic\ncommunication structure between specialized agents. Our key insight is that\nlateral information flow across long-distance agent interactions, combined with\nfine-grained belief management, yields richer information contexts and enhanced\nreasoning. Preliminary quantitative and qualitative evaluations indicate SALT's\npotential to outperform single-agent systems in handling complex lateral\nreasoning tasks in a streaming environment.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "K77juJA_m6VqUVRcYf971V0c9evIgxRnt0Rfftg3EG4",
  "pdfSize": "1157258"
}