{
  "id": "2412.05516",
  "title": "Measuring Consumer Sensitivity to Audio Advertising: A Long-Run Field\n  Experiment on Pandora Internet Radio",
  "authors": "Ali Goli, Jason Huang, David Reiley, Nickolai M. Riabov",
  "authorsParsed": [
    [
      "Goli",
      "Ali",
      ""
    ],
    [
      "Huang",
      "Jason",
      ""
    ],
    [
      "Reiley",
      "David",
      ""
    ],
    [
      "Riabov",
      "Nickolai M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 03:12:39 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733541159000,
  "abstract": "  A randomized experiment with almost 35 million Pandora listeners enables us\nto measure the sensitivity of consumers to advertising, an important topic of\nstudy in the era of ad-supported digital content provision. The experiment\nrandomized listeners into nine treatment groups, each of which received a\ndifferent level of audio advertising interrupting their music listening, with\nthe highest treatment group receiving more than twice as many ads as the lowest\ntreatment group. By maintaining consistent treatment assignment for 21 months,\nwe measure long-run demand effects and find ad-load sensitivity three times\ngreater than what we would have obtained from a month-long experiment. We show\nthe negative impact on the number of hours listened, days listened, and\nprobability of listening at all in the final month. Using an experimental\ndesign that separately varies the number of commercial interruptions per hour\nand the number of ads per commercial interruption, we find that listeners\nprimarily respond to the total number of ads per hour, with a slight preference\nfor more frequent but shorter ad breaks. Lastly, we find that increased ad load\nled to an increase in the number of paid ad-free subscriptions to Pandora.\nImportantly, we show that observational methods often lead to biased or even\ndirectionally incorrect estimates of these effects, highlighting the value of\nexperimental data.\n",
  "subjects": [
    "Economics/General Economics",
    "Quantitative Finance/Economics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "7mZbf8HNpGcLwnepnGzFyQFdSZ3NPw54wdCMejShaz0",
  "pdfSize": "744212"
}