{
  "id": "2412.17865",
  "title": "Underwater Acoustic Reconfigurable Intelligent Surfaces: from Principle\n  to Practice",
  "authors": "Yu Luo, Lina Pu, Junming Diao, Chun-Hung Liu, Aijun Song",
  "authorsParsed": [
    [
      "Luo",
      "Yu",
      ""
    ],
    [
      "Pu",
      "Lina",
      ""
    ],
    [
      "Diao",
      "Junming",
      ""
    ],
    [
      "Liu",
      "Chun-Hung",
      ""
    ],
    [
      "Song",
      "Aijun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 03:02:00 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734750120000,
  "abstract": "  This article explores the potential of underwater acoustic reconfigurable\nintelligent surfaces (UA-RIS) for facilitating long-range and eco-friendly\ncommunication in marine environments. Unlike radio frequency-based RIS\n(RF-RIS), which have been extensively investigated in terrestrial contexts,\nUA-RIS is an emerging field of study. The distinct characteristics of acoustic\nwaves, including their slow propagation speed and potential for noise pollution\naffecting marine life, necessitate a fundamentally different approach to the\narchitecture and design principles of UA-RIS compared to RF-RIS. Currently,\nthere is a scarcity of real systems and experimental data to validate the\nfeasibility of UA-RIS in practical applications. To fill this gap, this article\npresents field tests conducted with a prototype UA-RIS consisting of 24\nacoustic elements. The results demonstrate that the developed prototype can\neffectively reflect acoustic waves to any specified directions through passive\nbeamforming, thereby substantially extending the range and data rate of\nunderwater communication systems.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "QtmVA3J-ikT9VLFZxAVtzsSljaNdNKaxHTHXhSRIKPc",
  "pdfSize": "2401665"
}