{"id":"2412.12190","title":"iMoT: Inertial Motion Transformer for Inertial Navigation","authors":"Son Minh Nguyen, Linh Duy Tran, Duc Viet Le, Paul J.M Havinga","authorsParsed":[["Nguyen","Son Minh",""],["Tran","Linh Duy",""],["Le","Duc Viet",""],["Havinga","Paul J. M",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 22:52:47 GMT"}],"updateDate":"2025-01-14","timestamp":1734130367000,"abstract":"  We propose iMoT, an innovative Transformer-based inertial odometry method\nthat retrieves cross-modal information from motion and rotation modalities for\naccurate positional estimation. Unlike prior work, during the encoding of the\nmotion context, we introduce Progressive Series Decoupler at the beginning of\neach encoder layer to stand out critical motion events inherent in acceleration\nand angular velocity signals. To better aggregate cross-modal interactions, we\npresent Adaptive Positional Encoding, which dynamically modifies positional\nembeddings for temporal discrepancies between different modalities. During\ndecoding, we introduce a small set of learnable query motion particles as\npriors to model motion uncertainties within velocity segments. Each query\nmotion particle is intended to draw cross-modal features dedicated to a\nspecific motion mode, all taken together allowing the model to refine its\nunderstanding of motion dynamics effectively. Lastly, we design a dynamic\nscoring mechanism to stabilize iMoT's optimization by considering all aligned\nmotion particles at the final decoding step, ensuring robust and accurate\nvelocity segment estimation. Extensive evaluations on various inertial datasets\ndemonstrate that iMoT significantly outperforms state-of-the-art methods in\ndelivering superior robustness and accuracy in trajectory reconstruction.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"8q_SOVtFt6ylHhhU2-UXsuWwNhzSlS_XmGQZJ8uHMxg","pdfSize":"2605907"}