{
  "id": "2412.11372",
  "title": "High-efficiency On-chip Quantum Photon Source in Modal Phase-matched\n  Lithium Niobate Nanowaveguide",
  "authors": "Xiao-Xu Fang, Hao-Yang Du, Xiuquan Zhang, Lei Wang, Feng Chen, He Lu",
  "authorsParsed": [
    [
      "Fang",
      "Xiao-Xu",
      ""
    ],
    [
      "Du",
      "Hao-Yang",
      ""
    ],
    [
      "Zhang",
      "Xiuquan",
      ""
    ],
    [
      "Wang",
      "Lei",
      ""
    ],
    [
      "Chen",
      "Feng",
      ""
    ],
    [
      "Lu",
      "He",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 01:58:52 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734314332000,
  "abstract": "  Thin-film lithium niobate on insulator~(LNOI) emerges as a promising platform\nfor integrated quantum photon source, enabling scalable on-chip quantum\ninformation processing. The most popular technique to overcome the phase\nmismatching between interacting waves in waveguide is periodic poling, which is\nintrinsically sensitive to poling uniformity. Here, we report an alternative\nstrategy to offset the phase mismatching of spontaneous parametric\ndown-conversion~(SPDC) process, so-called modal phase matching, in a straight\nwaveguide fabricated on a dual-layer LNOI. The dual-layer LNOI consists of two\n300~nm lithium niobates with opposite directions, which significantly enhances\nthe spatial overlap between fundamental and high-order modes and thus enables\nefficient SPDC. This dual-layer waveguide generates photon pairs with pair\ngeneration rate of 41.77~GHz/mW, which exhibits excellent signal-to-noise\nperformance with coincidence-to-accidental ratio up to 58298$\\pm$1297.\nMoreover, we observe a heralded single-photon source with second-order\nautocorrelation $g_{H}^{(2)}(0)<0.2$ and heralded rate exceeding 100~kHz. Our\nresults provide an experiment-friendly approach for efficient generation of\nquantum photon sources and benefit the on-chip quantum information processing\nbased on LNOI.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UgBNXMXbsKU51Kijj_RQmCIW5O7m325yDJCrZKwwht8",
  "pdfSize": "6291813"
}