{
  "id": "2412.01778",
  "title": "HackSynth: LLM Agent and Evaluation Framework for Autonomous Penetration\n  Testing",
  "authors": "Lajos Muzsai, David Imolai, Andr\\'as Luk\\'acs",
  "authorsParsed": [
    [
      "Muzsai",
      "Lajos",
      ""
    ],
    [
      "Imolai",
      "David",
      ""
    ],
    [
      "Lukács",
      "András",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 18:28:18 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733164098000,
  "abstract": "  We introduce HackSynth, a novel Large Language Model (LLM)-based agent\ncapable of autonomous penetration testing. HackSynth's dual-module architecture\nincludes a Planner and a Summarizer, which enable it to generate commands and\nprocess feedback iteratively. To benchmark HackSynth, we propose two new\nCapture The Flag (CTF)-based benchmark sets utilizing the popular platforms\nPicoCTF and OverTheWire. These benchmarks include two hundred challenges across\ndiverse domains and difficulties, providing a standardized framework for\nevaluating LLM-based penetration testing agents. Based on these benchmarks,\nextensive experiments are presented, analyzing the core parameters of\nHackSynth, including creativity (temperature and top-p) and token utilization.\nMultiple open source and proprietary LLMs were used to measure the agent's\ncapabilities. The experiments show that the agent performed best with the\nGPT-4o model, better than what the GPT-4o's system card suggests. We also\ndiscuss the safety and predictability of HackSynth's actions. Our findings\nindicate the potential of LLM-based agents in advancing autonomous penetration\ntesting and the importance of robust safeguards. HackSynth and the benchmarks\nare publicly available to foster research on autonomous cybersecurity\nsolutions.\n",
  "subjects": [
    "Computer Science/Cryptography and Security",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "Qsre-2gZo6EjOs9D1KHVFWTIQJq516gkvFyM8lNme5k",
  "pdfSize": "1035896"
}