{
  "id": "2412.11403",
  "title": "Formulations and scalability of neural network surrogates in nonlinear\n  optimization problems",
  "authors": "Robert B. Parker, Oscar Dowson, Nicole LoGiudice, Manuel Garcia,\n  Russell Bent",
  "authorsParsed": [
    [
      "Parker",
      "Robert B.",
      ""
    ],
    [
      "Dowson",
      "Oscar",
      ""
    ],
    [
      "LoGiudice",
      "Nicole",
      ""
    ],
    [
      "Garcia",
      "Manuel",
      ""
    ],
    [
      "Bent",
      "Russell",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 03:09:06 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734318546000,
  "abstract": "  We compare full-space, reduced-space, and gray-box formulations for\nrepresenting trained neural networks in nonlinear constrained optimization\nproblems. We test these formulations on a transient stability-constrained,\nsecurity-constrained alternating current optimal power flow (SCOPF) problem\nwhere the transient stability criteria are represented by a trained neural\nnetwork surrogate. Optimization problems are implemented in JuMP and trained\nneural networks are embedded using a new Julia package: MathOptAI.jl. To study\nthe bottlenecks of the three formulations, we use neural networks with up to\n590 million trained parameters. The full-space formulation is bottlenecked by\nthe linear solver used by the optimization algorithm, while the reduced-space\nformulation is bottlenecked by the algebraic modeling environment and\nderivative computations. The gray-box formulation is the most scalable and is\ncapable of solving with the largest neural networks tested. It is bottlenecked\nby evaluation of the neural network's outputs and their derivatives, which may\nbe accelerated with a graphics processing unit (GPU). Leveraging the gray-box\nformulation and GPU acceleration, we solve our test problem with our largest\nneural network surrogate in 2.5$\\times$ the time required for a simpler SCOPF\nproblem without the stability constraint.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "dWaqsSaEmzzax_Bvh-Sqkpd5KY9Wb2q5KbL12r0uGtU",
  "pdfSize": "166585"
}