{
  "id": "2412.03191",
  "title": "Soft Adaptive Feet for Legged Robots: An Open-Source Model for\n  Locomotion Simulation",
  "authors": "Matteo Crotti, Luca Rossini, Balint K. Hodossy, Anna Pace, Giorgio\n  Grioli, Antonio Bicchi, Manuel G. Catalano",
  "authorsParsed": [
    [
      "Crotti",
      "Matteo",
      ""
    ],
    [
      "Rossini",
      "Luca",
      ""
    ],
    [
      "Hodossy",
      "Balint K.",
      ""
    ],
    [
      "Pace",
      "Anna",
      ""
    ],
    [
      "Grioli",
      "Giorgio",
      ""
    ],
    [
      "Bicchi",
      "Antonio",
      ""
    ],
    [
      "Catalano",
      "Manuel G.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 10:23:27 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 7 Jan 2025 15:04:47 GMT"
    }
  ],
  "updateDate": "2025-01-08",
  "timestamp": 1733307807000,
  "abstract": "  In recent years, artificial feet based on soft robotics and under-actuation\nprinciples emerged to improve mobility on challenging terrains. This paper\npresents the application of the MuJoCo physics engine to realize a digital twin\nof an adaptive soft foot developed for use with legged robots. We release the\nMuJoCo soft foot digital twin as open source to allow users and researchers to\nexplore new approaches to locomotion. The work includes the system modeling\ntechniques along with the kinematic and dynamic attributes involved. Validation\nis conducted through a rigorous comparison with bench tests on a physical\nprototype, replicating these experiments in simulation. Results are evaluated\nbased on sole deformation and contact forces during foot-obstacle interaction.\nThe foot model is subsequently integrated into simulations of the humanoid\nrobot COMAN+, replacing its original flat feet. Results show an improvement in\nthe robot's ability to negotiate small obstacles without altering its control\nstrategy. Ultimately, this study offers a comprehensive modeling approach for\nadaptive soft feet, supported by qualitative comparisons of bipedal locomotion\nwith state of the art robotic feet.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "99oCdr3Z0BtToETm2TAg-5Mb08xHk8X27ZERaY259FI",
  "pdfSize": "2510724"
}