{"id":"2412.13908","title":"Memorizing SAM: 3D Medical Segment Anything Model with Memorizing\n  Transformer","authors":"Xinyuan Shao, Yiqing Shen, and Mathias Unberath","authorsParsed":[["Shao","Xinyuan",""],["Shen","Yiqing",""],["Unberath","Mathias",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 14:51:25 GMT"}],"updateDate":"2024-12-19","timestamp":1734533485000,"abstract":"  Segment Anything Models (SAMs) have gained increasing attention in medical\nimage analysis due to their zero-shot generalization capability in segmenting\nobjects of unseen classes and domains when provided with appropriate user\nprompts. Addressing this performance gap is important to fully leverage the\npre-trained weights of SAMs, particularly in the domain of volumetric medical\nimage segmentation, where accuracy is important but well-annotated 3D medical\ndata for fine-tuning is limited. In this work, we investigate whether\nintroducing the memory mechanism as a plug-in, specifically the ability to\nmemorize and recall internal representations of past inputs, can improve the\nperformance of SAM with limited computation cost. To this end, we propose\nMemorizing SAM, a novel 3D SAM architecture incorporating a memory Transformer\nas a plug-in. Unlike conventional memorizing Transformers that save the\ninternal representation during training or inference, our Memorizing SAM\nutilizes existing highly accurate internal representation as the memory source\nto ensure the quality of memory. We evaluate the performance of Memorizing SAM\nin 33 categories from the TotalSegmentator dataset, which indicates that\nMemorizing SAM can outperform state-of-the-art 3D SAM variant i.e., FastSAM3D\nwith an average Dice increase of 11.36% at the cost of only 4.38 millisecond\nincrease in inference time. The source code is publicly available at\nhttps://github.com/swedfr/memorizingSAM\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EDT3M0OrbKHZhqYyQ5D4x_f-pIO5lvqWzjBsryWLYAs","pdfSize":"6530728"}