{
  "id": "2412.07780",
  "title": "A Taxonomy of Systemic Risks from General-Purpose AI",
  "authors": "Risto Uuk, Carlos Ignacio Gutierrez, Daniel Guppy, Lode Lauwaert,\n  Atoosa Kasirzadeh, Lucia Velasco, Peter Slattery, Carina Prunkl",
  "authorsParsed": [
    [
      "Uuk",
      "Risto",
      ""
    ],
    [
      "Gutierrez",
      "Carlos Ignacio",
      ""
    ],
    [
      "Guppy",
      "Daniel",
      ""
    ],
    [
      "Lauwaert",
      "Lode",
      ""
    ],
    [
      "Kasirzadeh",
      "Atoosa",
      ""
    ],
    [
      "Velasco",
      "Lucia",
      ""
    ],
    [
      "Slattery",
      "Peter",
      ""
    ],
    [
      "Prunkl",
      "Carina",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 24 Nov 2024 22:16:18 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1732486578000,
  "abstract": "  Through a systematic review of academic literature, we propose a taxonomy of\nsystemic risks associated with artificial intelligence (AI), in particular\ngeneral-purpose AI. Following the EU AI Act's definition, we consider systemic\nrisks as large-scale threats that can affect entire societies or economies.\nStarting with an initial pool of 1,781 documents, we analyzed 86 selected\npapers to identify 13 categories of systemic risks and 50 contributing sources.\nOur findings reveal a complex landscape of potential threats, ranging from\nenvironmental harm and structural discrimination to governance failures and\nloss of control. Key sources of systemic risk emerge from knowledge gaps,\nchallenges in recognizing harm, and the unpredictable trajectory of AI\ndevelopment. The taxonomy provides a snapshot of current academic literature on\nsystemic risks. This paper contributes to AI safety research by providing a\nstructured groundwork for understanding and addressing the potential\nlarge-scale negative societal impacts of general-purpose AI. The taxonomy can\ninform policymakers in risk prioritization and regulatory development.\n",
  "subjects": [
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xy6M38HtayGKoOfbvcgC0djPv9VF8mPZ2Ajw7CKj1Js",
  "pdfSize": "490148"
}