{"id":"2412.12800","title":"Breaking the Programming Language Barrier: Multilingual Prompting to\n  Empower Non-Native English Learners","authors":"James Prather, Brent N. Reeves, Paul Denny, Juho Leinonen, Stephen\n  MacNeil, Andrew Luxton-Reilly, Jo\\~ao Orvalho, Amin Alipour, Ali Alfageeh,\n  Thezyrie Amarouche, Bailey Kimmel, Jared Wright, Musa Blake, Gweneth Barbre","authorsParsed":[["Prather","James",""],["Reeves","Brent N.",""],["Denny","Paul",""],["Leinonen","Juho",""],["MacNeil","Stephen",""],["Luxton-Reilly","Andrew",""],["Orvalho","João",""],["Alipour","Amin",""],["Alfageeh","Ali",""],["Amarouche","Thezyrie",""],["Kimmel","Bailey",""],["Wright","Jared",""],["Blake","Musa",""],["Barbre","Gweneth",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 11:06:02 GMT"}],"updateDate":"2024-12-18","timestamp":1734433562000,"abstract":"  Non-native English speakers (NNES) face multiple barriers to learning\nprogramming. These barriers can be obvious, such as the fact that programming\nlanguage syntax and instruction are often in English, or more subtle, such as\nbeing afraid to ask for help in a classroom full of native English speakers.\nHowever, these barriers are frustrating because many NNES students know more\nabout programming than they can articulate in English. Advances in generative\nAI (GenAI) have the potential to break down these barriers because state of the\nart models can support interactions in multiple languages. Moreover, recent\nwork has shown that GenAI can be highly accurate at code generation and\nexplanation. In this paper, we provide the first exploration of NNES students\nprompting in their native languages (Arabic, Chinese, and Portuguese) to\ngenerate code to solve programming problems. Our results show that students are\nable to successfully use their native language to solve programming problems,\nbut not without some difficulty specifying programming terminology and\nconcepts. We discuss the challenges they faced, the implications for practice\nin the short term, and how this might transform computing education globally in\nthe long term.\n","subjects":["Computer Science/Computers and Society","Computer Science/Artificial Intelligence","Computer Science/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NaAtEd48zQNXbVitS6SAwDmeKvM710EaDCXAhg_QxkA","pdfSize":"580630"}