{
  "id": "2412.10997",
  "title": "Mask Enhanced Deeply Supervised Prostate Cancer Detection on B-mode\n  Micro-Ultrasound",
  "authors": "Lichun Zhang, Steve Ran Zhou, Moon Hyung Choi, Jeong Hoon Lee,\n  Shengtian Sang, Adam Kinnaird, Wayne G. Brisbane, Giovanni Lughezzani, Davide\n  Maffei, Vittorio Fasulo, Patrick Albers, Sulaiman Vesal, Wei Shao, Ahmed N.\n  El Kaffas, Richard E. Fan, Geoffrey A. Sonn, Mirabela Rusu",
  "authorsParsed": [
    [
      "Zhang",
      "Lichun",
      ""
    ],
    [
      "Zhou",
      "Steve Ran",
      ""
    ],
    [
      "Choi",
      "Moon Hyung",
      ""
    ],
    [
      "Lee",
      "Jeong Hoon",
      ""
    ],
    [
      "Sang",
      "Shengtian",
      ""
    ],
    [
      "Kinnaird",
      "Adam",
      ""
    ],
    [
      "Brisbane",
      "Wayne G.",
      ""
    ],
    [
      "Lughezzani",
      "Giovanni",
      ""
    ],
    [
      "Maffei",
      "Davide",
      ""
    ],
    [
      "Fasulo",
      "Vittorio",
      ""
    ],
    [
      "Albers",
      "Patrick",
      ""
    ],
    [
      "Vesal",
      "Sulaiman",
      ""
    ],
    [
      "Shao",
      "Wei",
      ""
    ],
    [
      "Kaffas",
      "Ahmed N. El",
      ""
    ],
    [
      "Fan",
      "Richard E.",
      ""
    ],
    [
      "Sonn",
      "Geoffrey A.",
      ""
    ],
    [
      "Rusu",
      "Mirabela",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 23:40:53 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734219653000,
  "abstract": "  Prostate cancer is a leading cause of cancer-related deaths among men. The\nrecent development of high frequency, micro-ultrasound imaging offers improved\nresolution compared to conventional ultrasound and potentially a better ability\nto differentiate clinically significant cancer from normal tissue. However, the\nfeatures of prostate cancer remain subtle, with ambiguous borders with normal\ntissue and large variations in appearance, making it challenging for both\nmachine learning and humans to localize it on micro-ultrasound images.\n  We propose a novel Mask Enhanced Deeply-supervised Micro-US network, termed\nMedMusNet, to automatically and more accurately segment prostate cancer to be\nused as potential targets for biopsy procedures. MedMusNet leverages predicted\nmasks of prostate cancer to enforce the learned features layer-wisely within\nthe network, reducing the influence of noise and improving overall consistency\nacross frames.\n  MedMusNet successfully detected 76% of clinically significant cancer with a\nDice Similarity Coefficient of 0.365, significantly outperforming the baseline\nSwin-M2F in specificity and accuracy (Wilcoxon test, Bonferroni correction,\np-value<0.05). While the lesion-level and patient-level analyses showed\nimproved performance compared to human experts and different baseline, the\nimprovements did not reach statistical significance, likely on account of the\nsmall cohort.\n  We have presented a novel approach to automatically detect and segment\nclinically significant prostate cancer on B-mode micro-ultrasound images. Our\nMedMusNet model outperformed other models, surpassing even human experts. These\npreliminary results suggest the potential for aiding urologists in prostate\ncancer diagnosis via biopsy and treatment decision-making.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "5RsiokcZFpgbmxRMPX7PmscB9Sl_KlLWH4ehk47jMn0",
  "pdfSize": "5240817"
}