{
  "id": "2412.18355",
  "title": "Addressing Spatial-Temporal Data Heterogeneity in Federated Continual\n  Learning via Tail Anchor",
  "authors": "Hao Yu, Xin Yang, Le Zhang, Hanlin Gu, Tianrui Li, Lixin Fan, Qiang\n  Yang",
  "authorsParsed": [
    [
      "Yu",
      "Hao",
      ""
    ],
    [
      "Yang",
      "Xin",
      ""
    ],
    [
      "Zhang",
      "Le",
      ""
    ],
    [
      "Gu",
      "Hanlin",
      ""
    ],
    [
      "Li",
      "Tianrui",
      ""
    ],
    [
      "Fan",
      "Lixin",
      ""
    ],
    [
      "Yang",
      "Qiang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 11:35:40 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735040140000,
  "abstract": "  Federated continual learning (FCL) allows each client to continually update\nits knowledge from task streams, enhancing the applicability of federated\nlearning in real-world scenarios. However, FCL needs to address not only\nspatial data heterogeneity between clients but also temporal data heterogeneity\nbetween tasks. In this paper, empirical experiments demonstrate that such\ninput-level heterogeneity significantly affects the model's internal parameters\nand outputs, leading to severe spatial-temporal catastrophic forgetting of\nlocal and previous knowledge. To this end, we propose Federated Tail Anchor\n(FedTA) to mix trainable Tail Anchor with the frozen output features to adjust\ntheir position in the feature space, thereby overcoming parameter-forgetting\nand output-forgetting. Moreover, three novel components are also included in\nFedTA: Input Enhancement for improving the performance of pre-trained models on\ndownstream tasks; Selective Input Knowledge Fusion for fusion of heterogeneous\nlocal knowledge on the server side; and Best Global Prototype Selection for\nfinding the best anchor point for each class in the feature space. Extensive\nexperiments demonstrate that FedTA not only outperforms existing FCL methods\nbut also effectively preserves the relative positions of features, remaining\nunaffected by spatial and temporal changes.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "1RyRXLJmWIdiWltNJaB4L9eE1P9_y37uICBod2w5OHc",
  "pdfSize": "2731913"
}