{
  "id": "2412.14197",
  "title": "Advancing Vehicle Plate Recognition: Multitasking Visual Language Models\n  with VehiclePaliGemma",
  "authors": "Nouar AlDahoul, Myles Joshua Toledo Tan, Raghava Reddy Tera, Hezerul\n  Abdul Karim, Chee How Lim, Manish Kumar Mishra, Yasir Zaki",
  "authorsParsed": [
    [
      "AlDahoul",
      "Nouar",
      ""
    ],
    [
      "Tan",
      "Myles Joshua Toledo",
      ""
    ],
    [
      "Tera",
      "Raghava Reddy",
      ""
    ],
    [
      "Karim",
      "Hezerul Abdul",
      ""
    ],
    [
      "Lim",
      "Chee How",
      ""
    ],
    [
      "Mishra",
      "Manish Kumar",
      ""
    ],
    [
      "Zaki",
      "Yasir",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 16:22:10 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734193330000,
  "abstract": "  License plate recognition (LPR) involves automated systems that utilize\ncameras and computer vision to read vehicle license plates. Such plates\ncollected through LPR can then be compared against databases to identify stolen\nvehicles, uninsured drivers, crime suspects, and more. The LPR system plays a\nsignificant role in saving time for institutions such as the police force. In\nthe past, LPR relied heavily on Optical Character Recognition (OCR), which has\nbeen widely explored to recognize characters in images. Usually, collected\nplate images suffer from various limitations, including noise, blurring,\nweather conditions, and close characters, making the recognition complex.\nExisting LPR methods still require significant improvement, especially for\ndistorted images. To fill this gap, we propose utilizing visual language models\n(VLMs) such as OpenAI GPT4o, Google Gemini 1.5, Google PaliGemma (Pathways\nLanguage and Image model + Gemma model), Meta Llama 3.2, Anthropic Claude 3.5\nSonnet, LLaVA, NVIDIA VILA, and moondream2 to recognize such unclear plates\nwith close characters. This paper evaluates the VLM's capability to address the\naforementioned problems. Additionally, we introduce ``VehiclePaliGemma'', a\nfine-tuned Open-sourced PaliGemma VLM designed to recognize plates under\nchallenging conditions. We compared our proposed VehiclePaliGemma with\nstate-of-the-art methods and other VLMs using a dataset of Malaysian license\nplates collected under complex conditions. The results indicate that\nVehiclePaliGemma achieved superior performance with an accuracy of 87.6\\%.\nMoreover, it is able to predict the car's plate at a speed of 7 frames per\nsecond using A100-80GB GPU. Finally, we explored the multitasking capability of\nVehiclePaliGemma model to accurately identify plates containing multiple cars\nof various models and colors, with plates positioned and oriented in different\ndirections.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "1DCDTDRD7VMbzzSERSX428jpCykiUv46yDN34gGHczQ",
  "pdfSize": "20637687"
}