{
  "id": "2412.01331",
  "title": "Exploring Long-Term Prediction of Type 2 Diabetes Microvascular\n  Complications",
  "authors": "Elizabeth Remfry, Rafael Henkin, Michael R Barnes, Aakanksha Naik",
  "authorsParsed": [
    [
      "Remfry",
      "Elizabeth",
      ""
    ],
    [
      "Henkin",
      "Rafael",
      ""
    ],
    [
      "Barnes",
      "Michael R",
      ""
    ],
    [
      "Naik",
      "Aakanksha",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 09:54:51 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733133291000,
  "abstract": "  Electronic healthcare records (EHR) contain a huge wealth of data that can\nsupport the prediction of clinical outcomes. EHR data is often stored and\nanalysed using clinical codes (ICD10, SNOMED), however these can differ across\nregistries and healthcare providers. Integrating data across systems involves\nmapping between different clinical ontologies requiring domain expertise, and\nat times resulting in data loss. To overcome this, code-agnostic models have\nbeen proposed. We assess the effectiveness of a code-agnostic representation\napproach on the task of long-term microvascular complication prediction for\nindividuals living with Type 2 Diabetes. Our method encodes individual EHRs as\ntext using fine-tuned, pretrained clinical language models. Leveraging\nlarge-scale EHR data from the UK, we employ a multi-label approach to\nsimultaneously predict the risk of microvascular complications across 1-, 5-,\nand 10-year windows. We demonstrate that a code-agnostic approach outperforms a\ncode-based model and illustrate that performance is better with longer\nprediction windows but is biased to the first occurring complication. Overall,\nwe highlight that context length is vitally important for model performance.\nThis study highlights the possibility of including data from across different\nclinical ontologies and is a starting point for generalisable clinical models.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "uOeMMGUcwiYi7YgWZtZaP05qw0rs_jhyqfTkGHFhaYI",
  "pdfSize": "751803"
}