{"id":"2412.14362","title":"A Fully Adaptive Radau Method for the Efficient Solution of Stiff\n  Ordinary Differential Equations at Low Tolerances","authors":"Shreyas Ekanathan, Oscar Smith, Christopher Rackauckas","authorsParsed":[["Ekanathan","Shreyas",""],["Smith","Oscar",""],["Rackauckas","Christopher",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 22:00:25 GMT"}],"updateDate":"2024-12-20","timestamp":1734559225000,"abstract":"  Radau IIA methods, specifically the adaptive order radau method in Fortran\ndue to Hairer, are known to be state-of-the-art for the high-accuracy solution\nof highly stiff ordinary differential equations (ODEs). However, the\ntraditional implementation was specialized to a specific range of tolerance, in\nparticular only supporting 5th, 9th, and 13th order versions of the tableau and\nonly derived in double precision floating point, thus limiting the ability to\nbe truly general purpose for highly accurate scenarios. To alleviate these\nconstraints, we implement an adaptive-time adaptive-order Radau method which\ncan derive the coefficients for the Radau IIA embedded tableau to any order on\nthe fly to any precision. Additionally, our Julia-based implementation includes\nmany modernizations to improve performance, including improvements to the order\nadaptation scheme and improved linear algebra integrations. In a head-to-head\nbenchmark against the classic Fortran implementation, we demonstrate our\nimplementation is approximately 2x across a range of stiff ODEs. We benchmark\nour algorithm against several well-reputed numerical integrators for stiff ODEs\nand find state-of-the-art performance on several test problems, with a\n1.5-times speed-up over common numerical integrators for stiff ODEs when low\nerror tolerance is required. The newly implemented method is distributed in\nopen source software for free usage on stiff ODEs.\n","subjects":["Mathematics/Numerical Analysis","Computer Science/Mathematical Software","Computer Science/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"j3HDeG0cg1UUeYFZnhwj5SrpDOyEHH-o8ltR15-_F6Q","pdfSize":"515508"}