{"id":"2412.13855","title":"Breaching 1.5{\\deg}C: Give me the odds","authors":"J. Eduardo Vera-Vald\\'es and Olivia Kvist","authorsParsed":[["Vera-Valdés","J. Eduardo",""],["Kvist","Olivia",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 13:51:46 GMT"}],"updateDate":"2024-12-19","timestamp":1734529906000,"abstract":"  Climate change communication is crucial to raising awareness and motivating\naction. In the context of breaching the limits set out by the Paris Agreement,\nwe argue that climate scientists should move away from point estimates and\ntowards reporting probabilities. Reporting probabilities will provide\npolicymakers with a range of possible outcomes and will allow them to make\ninformed timely decisions. To achieve this goal, we propose a method to\ncalculate the probability of breaching the limits set out by the Paris\nAgreement. The method can be summarized as predicting future temperatures under\ndifferent scenarios and calculating the number of possible outcomes that breach\nthe limits as a proportion of the total number of outcomes. The probabilities\ncan be computed for different time horizons and can be updated as new data\nbecome available. As an illustration, we performed a simulation study to\ninvestigate the probability of breaching the limits in a statistical model. Our\nresults show that the probability of breaching the 1.5{\\deg}C limit is already\ngreater than zero for 2024. Moreover, the probability of breaching the limit is\ngreater than 99% by 2042 if no action is taken to reduce greenhouse gas\nemissions. Our methodology is simple to implement and can easily be extended to\nmore complex models of the climate system. We encourage climate model\ndevelopers to include the probabilities of breaching the limits in their\nreports.\n","subjects":["Statistics/Applications","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"4O573YL1cAbKRHnTlgpLlwfo3CDdXy33MEZ_szfyqMY","pdfSize":"890919"}