{
  "id": "2412.05249",
  "title": "An Information Theoretic Analysis of Ghost Modulation",
  "authors": "Daniel Harman, Ashton Palacios, Philip Lundrigan, Willie K. Harrison",
  "authorsParsed": [
    [
      "Harman",
      "Daniel",
      ""
    ],
    [
      "Palacios",
      "Ashton",
      ""
    ],
    [
      "Lundrigan",
      "Philip",
      ""
    ],
    [
      "Harrison",
      "Willie K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 18:28:46 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733509726000,
  "abstract": "  Side channels have become an essential component of many modern\ninformation-theoretic schemes. The emerging field of cross technology\ncommunications (CTC) provides practical methods for creating intentional side\nchannels between existing communications technologies. This paper describes a\ntheoretical foundation for one such, recently proposed, CTC scheme: Ghost\nModulation (GM). Designed to modulate a low-data-rate message atop an existing\nnetwork stream, GM is particularly suited for transmitting identification or\ncovert information. The implementation only requires firmware updates to\nexisting hardware, making it a cost-effective solution. However, GM provides an\ninteresting technical challenge due to a highly asymmetric binary crossover\nerasure channel (BCEC) that results from packet drops and network delays. In\nthis work, we provide a mathematical description of the signal and channel\nmodels for GM. A heuristic decision rule based on maximum-likelihood principles\nfor simplified channel models is proposed. We describe an algorithm for GM\npacket acquisition and timing synchronization, supported by simulation results.\nSeveral well known short block codes are applied, and bit error rate (BER)\nresults are presented.\n",
  "subjects": [
    "Computer Science/Information Theory",
    "Electrical Engineering and Systems Science/Signal Processing",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "4EphVse2Tu8kOp_aXO2RX05bI952eXWF79Owc2Iam38",
  "pdfSize": "465411"
}