{
  "id": "2412.17392",
  "title": "TSformer: A Non-autoregressive Spatial-temporal Transformers for 30-day\n  Ocean Eddy-Resolving Forecasting",
  "authors": "Guosong Wang, Min Hou, Mingyue Qin, Xinrong Wu, Zhigang Gao, Guofang\n  Chao, Xiaoshuang Zhang",
  "authorsParsed": [
    [
      "Wang",
      "Guosong",
      ""
    ],
    [
      "Hou",
      "Min",
      ""
    ],
    [
      "Qin",
      "Mingyue",
      ""
    ],
    [
      "Wu",
      "Xinrong",
      ""
    ],
    [
      "Gao",
      "Zhigang",
      ""
    ],
    [
      "Chao",
      "Guofang",
      ""
    ],
    [
      "Zhang",
      "Xiaoshuang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 08:44:58 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734943498000,
  "abstract": "  Ocean forecasting is critical for various applications and is essential for\nunderstanding air-sea interactions, which contribute to mitigating the impacts\nof extreme events. State-of-the-art ocean numerical forecasting systems can\noffer lead times of up to 10 days with a spatial resolution of 10 kilometers,\nalthough they are computationally expensive. While data-driven forecasting\nmodels have demonstrated considerable potential and speed, they often primarily\nfocus on spatial variations while neglecting temporal dynamics. This paper\npresents TSformer, a novel non-autoregressive spatiotemporal transformer\ndesigned for medium-range ocean eddy-resolving forecasting, enabling forecasts\nof up to 30 days in advance. We introduce an innovative hierarchical U-Net\nencoder-decoder architecture based on 3D Swin Transformer blocks, which extends\nthe scope of local attention computation from spatial to spatiotemporal\ncontexts to reduce accumulation errors. TSformer is trained on 28 years of\nhomogeneous, high-dimensional 3D ocean reanalysis datasets, supplemented by\nthree 2D remote sensing datasets for surface forcing. Based on the\nnear-real-time operational forecast results from 2023, comparative performance\nassessments against in situ profiles and satellite observation data indicate\nthat, TSformer exhibits forecast performance comparable to leading numerical\nocean forecasting models while being orders of magnitude faster. Unlike\nautoregressive models, TSformer maintains 3D consistency in physical motion,\nensuring long-term coherence and stability in extended forecasts. Furthermore,\nthe TSformer model, which incorporates surface auxiliary observational data,\neffectively simulates the vertical cooling and mixing effects induced by Super\nTyphoon Saola.\n",
  "subjects": [
    "Physics/Atmospheric and Oceanic Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "CCgBxiSuuTqU9yobhxlCBD5T9vGCliMyOcsqE82jPkg",
  "pdfSize": "2699673"
}