{"id":"2412.17511","title":"Integrated differential analysis of multi-omics data using a joint\n  mixture model: idiffomix","authors":"Koyel Majumdar, Florence Jaffr\\'ezic, Andrea Rau, Isobel Claire\n  Gormley and Thomas Brendan Murphy","authorsParsed":[["Majumdar","Koyel",""],["Jaffrézic","Florence",""],["Rau","Andrea",""],["Gormley","Isobel Claire",""],["Murphy","Thomas Brendan",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 12:16:51 GMT"}],"updateDate":"2024-12-24","timestamp":1734956211000,"abstract":"  Gene expression and DNA methylation are two interconnected biological\nprocesses and understanding their relationship is important in advancing\nunderstanding in diverse areas, including disease pathogenesis, environmental\nadaptation, developmental biology, and therapeutic responses. Differential\nanalysis, including the identification of differentially methylated\ncytosine-guanine dinucleotide (CpG) sites (DMCs) and differentially expressed\ngenes (DEGs) between two conditions, such as healthy and affected samples, can\naid understanding of biological processes and disease progression. Typically,\ngene expression and DNA methylation data are analysed independently to identify\nDMCs and DEGs which are further analysed to explore relationships between them.\nSuch approaches ignore the inherent dependencies and biological structure\nwithin these related data.\n  A joint mixture model is proposed that integrates information from the two\ndata types at the modelling stage to capture their inherent dependency\nstructure, enabling simultaneous identification of DMCs and DEGs. The model\nleverages a joint likelihood function that accounts for the nested structure in\nthe data, with parameter estimation performed using an expectation-maximisation\nalgorithm.\n  Performance of the proposed method, idiffomix, is assessed through a thorough\nsimulation study and application to a publicly available breast cancer dataset.\nSeveral genes, identified as non-differentially expressed when the data types\nwere modelled independently, had high likelihood of being differentially\nexpressed when associated methylation data were integrated into the analysis.\nThe idiffomix approach highlights the advantage of an integrated analysis via a\njoint mixture model over independent analyses of the two data types;\ngenome-wide and cross-omics information is simultaneously utilised providing a\nmore comprehensive view.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oQ5ztGezAQa9dH2tneX6Kb0Sor-8ih_VsfgUrI6tt8Q","pdfSize":"917005"}