{
  "id": "2412.02019",
  "title": "Deep-inelastic scattering with collider neutrinos at the LHC and beyond",
  "authors": "Toni M\\\"akel\\\"a",
  "authorsParsed": [
    [
      "Mäkelä",
      "Toni",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 22:43:52 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733179432000,
  "abstract": "  Proton-proton collisions at the LHC generate high-intensity collimated beams\nof forward neutrinos up to TeV energies. Their recent observations and the\ninitiation of a novel LHC neutrino program motivate investigations of this\npreviously unexploited beam. The kinematic region for neutrino deep-inelastic\nscattering measurements at the LHC overlaps with that of the Electron-Ion\nCollider. The effect of the LHC $\\nu$DIS data on parton distribution functions\n(PDFs) is assessed by generating projections for the Run 3 LHC experiments, and\nfor select proposed detectors at the HL-LHC. Estimating their impact in global\n(n)PDF analyses reveals a significant reduction of PDF uncertainties,\nparticularly for strange and valence quarks. Furthermore, the effect of\nneutrino flux uncertainties is examined by parametrizing the correlations\nbetween a broad selection of neutrino production predictions in forward hadron\ndecays. This allows determination of the highest achievable precision for\nneutrino observations, and constraining physics within and beyond the Standard\nModel. This is demonstrated by setting bounds on effective theory operators,\nand discussing the prospects for an experimental confirmation of the enhanced\nstrangeness scenario proposed to resolve the cosmic ray muon puzzle, using LHC\ndata. Moreover, there is promise for a first measurement of neutrino tridents\nwith a statistical significance exceeding 5$\\sigma$.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "QtLQAlujEwYMnm6KwYeMRzgfVqp7gChR6i8vMltmdvo",
  "pdfSize": "496682"
}