{
  "id": "2412.02318",
  "title": "Design of thermal meta-structures made of functionally graded materials\n  using isogeometric density-based topology optimization",
  "authors": "Chintan Jansari, St\\'ephane P.A. Bordas, Marco Montemurro, Elena\n  Atroshchenko",
  "authorsParsed": [
    [
      "Jansari",
      "Chintan",
      ""
    ],
    [
      "Bordas",
      "Stéphane P. A.",
      ""
    ],
    [
      "Montemurro",
      "Marco",
      ""
    ],
    [
      "Atroshchenko",
      "Elena",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 09:33:09 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733218389000,
  "abstract": "  The thermal conductivity of Functionally Graded Materials (FGMs) can be\nefficiently designed through topology optimization to obtain thermal\nmeta-structures that actively steer the heat flow. Compared to conventional\nanalytical design methods, topology optimization allows handling arbitrary\ngeometries, boundary conditions and design requirements; and producing\nalternate designs for non-unique problems. Additionally, as far as the design\nof meta-structures is concerned, topology optimization does not need\nintuition-based coordinate transformation or the form invariance of governing\nequations, as in the case of transformation thermotics. We explore isogeometric\ndensity-based topology optimization in the continuous setting, which perfectly\naligns with FGMs. In this formulation, the density field, geometry and solution\nof the governing equations are parameterized using non-uniform rational basis\nspline entities. Accordingly, the heat conduction problem is solved using\nIsogeometric Analysis. We design various 2D & 3D thermal meta-structures under\ndifferent design scenarios to showcase the effectiveness and versatility of our\napproach. We also design thermal meta-structures based on architected cellular\nmaterials, a special class of FGMs, using their empirical material laws\ncalculated via numerical homogenization.\n",
  "subjects": [
    "Computer Science/Computational Engineering, Finance, and Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "CtDKtJvstzSlQMCGEYokC4ZiLjmyOXjVCsG-Q1-bQpo",
  "pdfSize": "32907950"
}