{
  "id": "2412.12248",
  "title": "Physics-informed Transformers for Electronic Quantum States",
  "authors": "Jo\\~ao Augusto Sobral, Michael Perle, Mathias S. Scheurer",
  "authorsParsed": [
    [
      "Sobral",
      "João Augusto",
      ""
    ],
    [
      "Perle",
      "Michael",
      ""
    ],
    [
      "Scheurer",
      "Mathias S.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 19:00:00 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734375600000,
  "abstract": "  Neural-network-based variational quantum states in general, and more recently\nautoregressive models in particular, have proven to be powerful tools to\ndescribe complex many-body wave functions. However, their performance crucially\ndepends on the computational basis chosen and they often lack physical\ninterpretability. To mitigate these issues, we here propose a modified\nvariational Monte-Carlo framework which leverages prior physical information to\nconstruct a computational second-quantized basis containing a reference state\nthat serves as a rough approximation to the true ground state. In this basis, a\nTransformer is used to parametrize and autoregressively sample the corrections\nto the reference state, giving rise to a more interpretable and computationally\nefficient representation of the ground state. We demonstrate this approach\nusing a non-sparse fermionic model featuring a metal-insulator transition and\nemploying Hartree-Fock and a strong-coupling limit to define physics-informed\nbases. We also show that the Transformer's hidden representation captures the\nnatural energetic order of the different basis states. This work paves the way\nfor more efficient and interpretable neural quantum-state representations.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons",
    "Condensed Matter/Disordered Systems and Neural Networks",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "j8O2aN57bifXad7Hckgtsy7tavhzfPjMZ_RcArRuKT4",
  "pdfSize": "3501685"
}