{
  "id": "2412.00479",
  "title": "Beyond time delays: How web scraping distorts measures of online news\n  consumption",
  "authors": "Roberto Ulloa, Frank Mangold, Felix Schmidt, Judith Gilsbach,\n  Sebastian Stier",
  "authorsParsed": [
    [
      "Ulloa",
      "Roberto",
      ""
    ],
    [
      "Mangold",
      "Frank",
      ""
    ],
    [
      "Schmidt",
      "Felix",
      ""
    ],
    [
      "Gilsbach",
      "Judith",
      ""
    ],
    [
      "Stier",
      "Sebastian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 13:36:48 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732973808000,
  "abstract": "  As the exploration of digital behavioral data revolutionizes communication\nresearch, understanding the nuances of data collection methodologies becomes\nincreasingly pertinent. This study focuses on one prominent data collection\napproach, web scraping, and more specifically, its application in the growing\nfield of research relying on web browsing data. We investigate discrepancies\nbetween content obtained directly during user interaction with a website\n(in-situ) and content scraped using the URLs of participants' logged visits\n(ex-situ) with various time delays (0, 30, 60, and 90 days). We find\nsubstantial disparities between the methodologies, uncovering that errors are\nnot uniformly distributed across news categories regardless of classification\nmethod (domain, URL, or content analysis). These biases compromise the\nprecision of measurements used in existing literature. The ex-situ collection\nenvironment is the primary source of the discrepancies (~33.8%), while the time\ndelays in the scraping process play a smaller role (adding ~6.5 percentage\npoints in 90 days). Our research emphasizes the need for data collection\nmethods that capture web content directly in the user's environment. However,\nacknowledging its complexities, we further explore strategies to mitigate\nbiases in web-scraped browsing histories, offering recommendations for\nresearchers who rely on this method and laying the groundwork for developing\nerror-correction frameworks.\n",
  "subjects": [
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "RcyVqEWhY2f6eW-gQ8JQSnACgGT7DVFUi3cX4w932V4",
  "pdfSize": "786981"
}