{
  "id": "2412.02698",
  "title": "Scaling BERT Models for Turkish Automatic Punctuation and Capitalization\n  Correction",
  "authors": "Abdulkader Saoud, Mahmut Alomeyr, Himmet Toprak Kesgin, Mehmet Fatih\n  Amasyali",
  "authorsParsed": [
    [
      "Saoud",
      "Abdulkader",
      ""
    ],
    [
      "Alomeyr",
      "Mahmut",
      ""
    ],
    [
      "Kesgin",
      "Himmet Toprak",
      ""
    ],
    [
      "Amasyali",
      "Mehmet Fatih",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 18:59:51 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733252391000,
  "abstract": "  This paper investigates the effectiveness of BERT based models for automated\npunctuation and capitalization corrections in Turkish texts across five\ndistinct model sizes. The models are designated as Tiny, Mini, Small, Medium,\nand Base. The design and capabilities of each model are tailored to address the\nspecific challenges of the Turkish language, with a focus on optimizing\nperformance while minimizing computational overhead. The study presents a\nsystematic comparison of the performance metrics precision, recall, and F1\nscore of each model, offering insights into their applicability in diverse\noperational contexts. The results demonstrate a significant improvement in text\nreadability and accuracy as model size increases, with the Base model achieving\nthe highest correction precision. This research provides a comprehensive guide\nfor selecting the appropriate model size based on specific user needs and\ncomputational resources, establishing a framework for deploying these models in\nreal-world applications to enhance the quality of written Turkish.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jYpLB7nVMJ1XnvnjE19d1lRVhAUmwJOail_ZBl5-9cs",
  "pdfSize": "313480"
}