{"id":"2412.07973","title":"The Benefits of the Virtual Observatory to Underserved Communities","authors":"G. Bruce Berriman","authorsParsed":[["Berriman","G. Bruce",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 23:21:38 GMT"}],"updateDate":"2024-12-12","timestamp":1733872898000,"abstract":"  The Virtual Observatory (VO) is a global ecosystem of interoperating services\nthat connect worldwide data archives. The VO is implemented in all major\nastronomy archives through common interfaces developed by the 22 members of the\nInternational Virtual Observatory Alliance (IVOA). It was founded in 2002, and\nthe newest members, the SKA Observatory and the Kazakhstan Virtual Observatory,\njoined in 2022. The VO offers access to data on FAIR principles and from its\ninception has supported Open Science. The VO acts as a democratizing influence\nin astronomy: it provides equal access to worldwide public data sets to\nunderserved communities as well as to large data centers, and it enables\ninternational participation in scientific research and education. Thus,\nastronomers from many different communities are positioned to participate in\nthe big science questions emerging in astronomy in the 2020s, such as\ninterpreting transient sources that will be measured in forthcoming missions\nsuch as Rubin. In addition, the IVOA has signed an MoU with the IAU Office of\nAstronomy for Development (OAD). Under this MoU, IVOA members participated in\n\"Astronomy from Archival Data,\" which involved educational activities for\nundergraduate and post-graduate students organized by Dr. Priya Hasan. The IVOA\nplans to participate in future such educational events. The presentation\ndescribes how new communities may participate in Virtual Observatory science\nand educational activities, including practices for developing VO-compliant\ndata centers and archives and education and training for developers and end\nusers.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"i5VzHNSo9AZ2j3OjFgjUU87Rseiac8QOaceDzQemW-E","pdfSize":"77756"}