{
  "id": "2412.02132",
  "title": "Dynamics of spontaneous scalarization of black holes with nonlinear\n  electromagnetic fields in anti-de Sitter spacetime",
  "authors": "Ke-Tai Wu, Zi-Jun Zhong, Yi Li, Chong-Ye Chen, Cheng-Yong Zhang, Chao\n  Niu and Peng Liu",
  "authorsParsed": [
    [
      "Wu",
      "Ke-Tai",
      ""
    ],
    [
      "Zhong",
      "Zi-Jun",
      ""
    ],
    [
      "Li",
      "Yi",
      ""
    ],
    [
      "Chen",
      "Chong-Ye",
      ""
    ],
    [
      "Zhang",
      "Cheng-Yong",
      ""
    ],
    [
      "Niu",
      "Chao",
      ""
    ],
    [
      "Liu",
      "Peng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 03:38:51 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733197131000,
  "abstract": "  We investigate spontaneous scalarization in the Einstein-Born-Infeld-Scalar\n(EBIS) model with asymptotically AdS boundary conditions, revealing novel\ndynamical critical phenomena in black hole evolution. Through numerical\nanalysis, we discover a distinctive ``flip\" phenomenon where the scalar field\nexhibits critical transitions between different stable configurations. These\ntransitions manifest in two forms: a single flip under variations in initial\nperturbation amplitude or scalar-electromagnetic coupling, and a double flip\nwhen varying black hole charge. Near critical points, the system displays\nuniversal relaxation behavior characterized by logarithmic scaling of\nrelaxation time, $\\tau \\propto \\ln |p - p_s|$, where $p_s$ denotes the critical\ninitial amplitude. We demonstrate that these transitions arise from the\nsystem's approach to unstable AdS-Born-Infeld black hole configurations, which\nserve as separatrices between distinct stable phases. The Born-Infeld parameter\nplays a crucial role in this dynamics, with scalar hair vanishing in the strong\nnonlinearity limit. These results reveal fundamental aspects of black hole\nphase transitions in theories with nonlinear electromagnetic couplings and\nprovide new insights into critical phenomena in gravitational systems.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory",
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Cq6BjaH1K7eKpWodcYNoTw-UQxtWz6S5WJ7U6yUo-Jw",
  "pdfSize": "2388167"
}