{"id":"2412.10227","title":"Tunable Josephson voltage source for quantum circuits","authors":"J.-L. Smirr (1), P. Manset (2), \\c{C}. \\\"O. Girit (1 and 2) ((1) JEIP,\n  PSL University, CNRS, Coll\\`ege de France, (2) Quantronics Group, SPEC,\n  Universit\\'e Paris Saclay, CEA, CNRS)","authorsParsed":[["Smirr","J. -L.","","1 and 2"],["Manset","P.","","1 and 2"],["Girit","Ç. Ö.","","1 and 2"]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 15:58:47 GMT"}],"updateDate":"2024-12-16","timestamp":1734105527000,"abstract":"  Noisy voltage sources can be a limiting factor for fundamental physics\nexperiments as well as for device applications in quantum information,\nmesoscopic circuits, magnetometry, and other fields. The best commercial DC\nvoltage sources can be programmed to approximately six digits and have\nintrinsic noise in the microvolt range. On the other hand the noise level in\nmetrological Josephson-junction based voltage standards is sub-femtovolt.\nAlthough such voltage standards can be considered \"noiseless,\" they are\ngenerally not designed for continuous tuning of the output voltage nor for\nsupplying current to a load at cryogenic temperatures. We propose a Josephson\neffect based voltage source, as opposed to a voltage standard, operating in the\n30-160 uV range which can supply over 100 nA of current to loads at\nmilli-Kelvin temperatures. We describe the operating principle, the sample\ndesign, and the calibration procedure to obtain continuous tunability. We show\ncurrent-voltage characteristics of the device, demonstrate how the voltage can\nbe adjusted without DC control connections to room-temperature electronics, and\nshowcase an experiment coupling the source to a mesoscopic load, a small\nJosephson junction. Finally we characterize the performance of our source by\nmeasuring the voltage noise at the load, 50 pV RMS, which is attributed to\nparasitic resistances in the cabling. This work establishes the use of the\nJosephson effect for voltage biasing extremely sensitive quantum devices.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JMZhaFJO-eiyg4e4yU2giNFdtC9QEaUx72iWG-liJTE","pdfSize":"8311088"}