{
  "id": "2412.17551",
  "title": "No quantum advantage for violating fixed-order inequalities?",
  "authors": "Veronika Baumann, \\\"Amin Baumeler, and Eleftherios-Ermis Tselentis",
  "authorsParsed": [
    [
      "Baumann",
      "Veronika",
      ""
    ],
    [
      "Baumeler",
      "Ämin",
      ""
    ],
    [
      "Tselentis",
      "Eleftherios-Ermis",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 13:19:13 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 13 Feb 2025 14:55:21 GMT"
    }
  ],
  "updateDate": "2025-02-14",
  "timestamp": 1734959953000,
  "abstract": "  In standard quantum theory, the causal relations between operations are\nfixed. One can relax this notion by allowing for dynamical arrangements, where\noperations may influence the causal relations of future operations, as\ncertified by violation of fixed-order inequalities, e.g., the k-cycle\ninequalities. Another, non-causal, departure further relaxes these limitations,\nand is certified by violations of causal inequalities. In this paper, we\nexplore the interplay between dynamic and indefinite causality. We study the\nk-cycle inequalities and show that the quantum switch violates these\ninequalities without exploiting its indefinite nature. We further introduce\nnon-adaptive strategies, which effectively remove the dynamical aspect of any\nprocess, and show that the k-cycle inequalities become ovel causal\ninequalities; violating k-cycle inequalities under the restriction of\nnon-adaptive strategies requires non-causal setups. The quantum switch is known\nto be incapable of violating causal inequalities, and it is believed that a\ndevice-independent certification of its causal indefiniteness requires extended\nsetups incorporating spacelike separation. This work reopens the possibility\nfor a device-independent certification of the quantum switch in isolation via\nfixed-order inequalities instead of causal inequalities. The inequalities we\nstudy here, however, turn out to be unsuitable for such a device-independent\ncertification.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "OFhOmA6fl0CzbVmYbtPosDsmYgVK9oUw7iyok695fTY",
  "pdfSize": "441184"
}