{"id":"2412.18148","title":"Are We in the AI-Generated Text World Already? Quantifying and\n  Monitoring AIGT on Social Media","authors":"Zhen Sun, Zongmin Zhang, Xinyue Shen, Ziyi Zhang, Yule Liu, Michael\n  Backes, Yang Zhang, Xinlei He","authorsParsed":[["Sun","Zhen",""],["Zhang","Zongmin",""],["Shen","Xinyue",""],["Zhang","Ziyi",""],["Liu","Yule",""],["Backes","Michael",""],["Zhang","Yang",""],["He","Xinlei",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 04:04:54 GMT"},{"version":"v2","created":"Sat, 22 Feb 2025 08:09:40 GMT"}],"updateDate":"2025-02-25","timestamp":1735013094000,"abstract":"  Social media platforms are experiencing a growing presence of AI-Generated\nTexts (AIGTs). However, the misuse of AIGTs could have profound implications\nfor public opinion, such as spreading misinformation and manipulating\nnarratives. Despite its importance, it remains unclear how prevalent AIGTs are\non social media. To address this gap, this paper aims to quantify and monitor\nthe AIGTs on online social media platforms. We first collect a dataset (SM-D)\nwith around 2.4M posts from 3 major social media platforms: Medium, Quora, and\nReddit. Then, we construct a diverse dataset (AIGTBench) to train and evaluate\nAIGT detectors. AIGTBench combines popular open-source datasets and our AIGT\ndatasets generated from social media texts by 12 LLMs, serving as a benchmark\nfor evaluating mainstream detectors. With this setup, we identify the\nbest-performing detector (OSM-Det). We then apply OSM-Det to SM-D to track\nAIGTs across social media platforms from January 2022 to October 2024, using\nthe AI Attribution Rate (AAR) as the metric. Specifically, Medium and Quora\nexhibit marked increases in AAR, rising from 1.77% to 37.03% and 2.06% to\n38.95%, respectively. In contrast, Reddit shows slower growth, with AAR\nincreasing from 1.31% to 2.45% over the same period. Our further analysis\nindicates that AIGTs on social media differ from human-written texts across\nseveral dimensions, including linguistic patterns, topic distributions,\nengagement levels, and the follower distribution of authors. We envision our\nanalysis and findings on AIGTs in social media can shed light on future\nresearch in this domain.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Computation and Language","Computer Science/Cryptography and Security","Computer Science/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"c6-5yp6HYW4nLbQHumHlkNpk-LN2TUT_3p01FTkba0M","pdfSize":"17450055"}