{
  "id": "2412.09737",
  "title": "ALMA/SCUBA-2 COSMOS Survey: Properties of X-ray- and SED-selected AGNs\n  in Bright Submillimeter Galaxies",
  "authors": "Ryosuke Uematsu, Yoshihiro Ueda, David M. Alexander, A. M. Swinbank,\n  Ian Smail, Carolina Andonie, Chian-Chou Chen, Ugne Dudzeviciute, Soh\n  Ikarashi, Kotaro Kohno, Yuichi Matsuda, Annagrazia Puglisi, Hideki Umehata,\n  Wei-Hao Wang",
  "authorsParsed": [
    [
      "Uematsu",
      "Ryosuke",
      ""
    ],
    [
      "Ueda",
      "Yoshihiro",
      ""
    ],
    [
      "Alexander",
      "David M.",
      ""
    ],
    [
      "Swinbank",
      "A. M.",
      ""
    ],
    [
      "Smail",
      "Ian",
      ""
    ],
    [
      "Andonie",
      "Carolina",
      ""
    ],
    [
      "Chen",
      "Chian-Chou",
      ""
    ],
    [
      "Dudzeviciute",
      "Ugne",
      ""
    ],
    [
      "Ikarashi",
      "Soh",
      ""
    ],
    [
      "Kohno",
      "Kotaro",
      ""
    ],
    [
      "Matsuda",
      "Yuichi",
      ""
    ],
    [
      "Puglisi",
      "Annagrazia",
      ""
    ],
    [
      "Umehata",
      "Hideki",
      ""
    ],
    [
      "Wang",
      "Wei-Hao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 21:59:31 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 15 Jan 2025 07:50:09 GMT"
    }
  ],
  "updateDate": "2025-01-16",
  "timestamp": 1734040771000,
  "abstract": "  We investigate the properties of active galactic nuclei (AGNs) in the\nbrightest submillimeter galaxies (SMGs) in the COSMOS field. We utilize the\nbright sample of ALMA/SCUBA-2 COSMOS Survey (AS2COSMOS), which consists of 260\nSMGs with $S_{\\mathrm{870}\\, \\mu \\mathrm{m}}=0.7\\text{--}19.2\\,\\mathrm{mJy}$ at\n$z=0\\text{--}6$. We perform optical to millimeter spectral energy distribution\n(SED) modeling for the whole sample. We identify 24 AGN-host galaxies from the\nSEDs. Supplemented by 23 X-ray detected AGNs (X-ray AGNs), we construct an\noverall sample of 40 AGN-host galaxies. The X-ray luminosity upper bounds\nindicate that the X-ray undetected SED-identified AGNs are likely to be nearly\nCompton thick or have unusually suppressed X-ray emission. From visual\nclassification, we identify $25^{+6}_{-5}$\\% of the SMGs without AGNs as major\nmerger candidates. This fraction is almost consistent with the general galaxy\npopulation at $z\\sim2$, suggesting that major mergers are not necessarily\nrequired for the enhanced star formation in SMGs. We also identify\n$47^{+16}_{-15}$\\% of the AGN hosts as major merger candidates, which is about\ntwice as high as that in the SMGs without AGNs. This suggests that major\nmergers play a key role in triggering AGN activity in bright SMGs.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "RVteGGfSD0uBVBgkeo18I5y1JPsGrCMYmn6QDptRk7w",
  "pdfSize": "25055634"
}