{"id":"2412.02170","title":"Remarks on strong phase shifts in weak nonleptonic baryon decays","authors":"Hong-Jian Wang, Pei-Rong Li, Xiao-Rui Lyu, Jusak Tandean, Hai-Bo Li","authorsParsed":[["Wang","Hong-Jian",""],["Li","Pei-Rong",""],["Lyu","Xiao-Rui",""],["Tandean","Jusak",""],["Li","Hai-Bo",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 04:57:07 GMT"},{"version":"v2","created":"Tue, 25 Feb 2025 08:44:19 GMT"}],"updateDate":"2025-02-26","timestamp":1733201827000,"abstract":"  A sizable strong-interaction phase shift in weak two-body nonleptonic baryon\ndecay would enhance the possibility of discovering charge-conjugation parity\n($CP$) violation in the baryon sector, which might help in the quest for\nunderstanding the matter-antimatter asymmetry in the universe. Over the past 60\nyears, empirical analyses involving different types of instruments, including\nfixed-target experiments and $e^+e^-$ colliders, have indicated that the phase\nshifts in nonleptonic hyperon decays are relatively small, below order ten\ndegrees in size. A large phase shift, however, has been observed by BESIII in\nthe decay of a charmed baryon into a hyperon and kaon, $\\Lambda_c^+\\to\n\\Xi^0K^+$. In various experimental and theoretical studies on hyperon,\ncharmed-baryon, and bottomed-baryon decays, different conventions have been\nadopted for defining the strong phases. It is important to be aware of this\nsituation when obtaining global averages from different measurements and\napplying the results to future investigations on $CP$ violation among baryons.\nThis paper gives an overview of the conventions employed in the literature for\nthe strong phases and suggests a unified parameterization form applicable to\nthe different alternatives. Numerical results under the unified\nparameterization form are also provided, which can serve as useful inputs to\nfurther pursuits of baryon $CP$ violation.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mK13b6dIdjHHr3wjOwBxgEFaV2quEyHDtwPCVBurI4o","pdfSize":"267476"}