{"id":"2412.01949","title":"Identifying Key Nodes for the Influence Spread using a Machine Learning\n  Approach","authors":"Mateusz Stolarski, Adam Pir\\'og, Piotr Br\\'odka","authorsParsed":[["Stolarski","Mateusz",""],["Piróg","Adam",""],["Bródka","Piotr",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 20:17:44 GMT"}],"updateDate":"2024-12-04","timestamp":1733170664000,"abstract":"  The identification of key nodes in complex networks is an important topic in\nmany network science areas. It is vital to a variety of real-world\napplications, including viral marketing, epidemic spreading and influence\nmaximization. In recent years, machine learning algorithms have proven to\noutperform the conventional, centrality-based methods in accuracy and\nconsistency, but this approach still requires further refinement. What\ninformation about the influencers can be extracted from the network? How can we\nprecisely obtain the labels required for training? Can these models generalize\nwell? In this paper, we answer these questions by presenting an enhanced\nmachine learning-based framework for the influence spread problem. We focus on\nidentifying key nodes for the Independent Cascade model, which is a popular\nreference method. Our main contribution is an improved process of obtaining the\nlabels required for training by introducing 'Smart Bins' and proving their\nadvantage over known methods. Next, we show that our methodology allows ML\nmodels to not only predict the influence of a given node, but to also determine\nother characteristics of the spreading process-which is another novelty to the\nrelevant literature. Finally, we extensively test our framework and its ability\nto generalize beyond complex networks of different types and sizes, gaining\nimportant insight into the properties of these methods.\n","subjects":["Computer Science/Social and Information Networks","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RYkguGPYMis6p8vS-gV9v9edfP_5Fil3bYwFirGGOJA","pdfSize":"675417"}