{
  "id": "2412.01924",
  "title": "Overscreened spin-$\\frac{1}{2}$ Kondo impurity and Shiba state at the\n  edge of a one-dimensional spin-1 superconducting wire",
  "authors": "Pradip Kattel, Abay Zhakenov, and Natan Andrei",
  "authorsParsed": [
    [
      "Kattel",
      "Pradip",
      ""
    ],
    [
      "Zhakenov",
      "Abay",
      ""
    ],
    [
      "Andrei",
      "Natan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 19:20:11 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733167211000,
  "abstract": "  We consider a model describing a system where the superconductivity competes\nwith the overscreened Kondo effect. The model consists of a single\nspin$-\\frac{1}{2}$ quantum impurity at the edge of a quantum wire where\nspin$-1$ bulk fermions interact attractively, generating a (superconducting)\nmass gap. The competition between the Kondo screening and the superconductivity\nleads to a rich phase structure. We find that for strong Kondo coupling, there\nis a regime of phase space where the Kondo phase is stable with the impurity\n\\textit{overscreened} by a multiparticle Kondo effect, and a Kondo scale is\ndynamically generated. When the bulk and boundary interaction strength are\ncomparable, we find that a midgap state appears in the spectrum and screens the\nimpurity, while in the ground state, the impurity is unscreened. This midgap\nstate is akin to the Yu-Shiba-Rushinov (YSR) states that exist in the entire\nphase space in the BCS superconductor. Moreover, when the bulk superconducting\ninteraction strength is stronger than the boundary Kondo interaction strength,\nthe impurity can no longer be screened. Further, between the Kondo and YSR\nphases, we find a novel phase where, while the Kondo cloud overscreens the\nimpurity, a boundary excitation exists that has vanishing energy in the\nthermodynamic limit. Similar phase diagrams that result from competition\nbetween different mechanisms were found for other models, too: the dissipative\nKondo system, where dissipation competes with screening; the Kondo impurity\ncoupled to spin-1/2 attractively interacting fermions where condensation\ncompetes with screening; and the XXX-Kondo model, where the lattice cutoff and\nthe bulk spin interaction compete with screening.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons",
    "Physics/High Energy Physics - Theory",
    "Physics/Mathematical Physics",
    "Mathematics/Mathematical Physics",
    "Nonlinear Sciences/Exactly Solvable and Integrable Systems",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "JvgBM1ozAyQKLmaPqHH2At0jvyvJlPFyDwKjI4ZisI0",
  "pdfSize": "710791"
}