{"id":"2412.16832","title":"RealisID: Scale-Robust and Fine-Controllable Identity Customization via\n  Local and Global Complementation","authors":"Zhaoyang Sun and Fei Du and Weihua Chen and Fan Wang and Yaxiong Chen\n  and Yi Rong and Shengwu Xiong","authorsParsed":[["Sun","Zhaoyang",""],["Du","Fei",""],["Chen","Weihua",""],["Wang","Fan",""],["Chen","Yaxiong",""],["Rong","Yi",""],["Xiong","Shengwu",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 02:36:25 GMT"}],"updateDate":"2024-12-24","timestamp":1734834985000,"abstract":"  Recently, the success of text-to-image synthesis has greatly advanced the\ndevelopment of identity customization techniques, whose main goal is to produce\nrealistic identity-specific photographs based on text prompts and reference\nface images. However, it is difficult for existing identity customization\nmethods to simultaneously meet the various requirements of different real-world\napplications, including the identity fidelity of small face, the control of\nface location, pose and expression, as well as the customization of multiple\npersons. To this end, we propose a scale-robust and fine-controllable method,\nnamely RealisID, which learns different control capabilities through the\ncooperation between a pair of local and global branches. Specifically, by using\ncropping and up-sampling operations to filter out face-irrelevant information,\nthe local branch concentrates the fine control of facial details and the\nscale-robust identity fidelity within the face region. Meanwhile, the global\nbranch manages the overall harmony of the entire image. It also controls the\nface location by taking the location guidance as input. As a result, RealisID\ncan benefit from the complementarity of these two branches. Finally, by\nimplementing our branches with two different variants of ControlNet, our method\ncan be easily extended to handle multi-person customization, even only trained\non single-person datasets. Extensive experiments and ablation studies indicate\nthe effectiveness of RealisID and verify its ability in fulfilling all the\nrequirements mentioned above.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"qeQ5J6tKwFIMQNcBZUUd-uVm0oyXAk5snAqtNrnBsiM","pdfSize":"23655984"}