{
  "id": "2412.06286",
  "title": "No Annotations for Object Detection in Art through Stable Diffusion",
  "authors": "Patrick Ramos, Nicolas Gonthier, Selina Khan, Yuta Nakashima, Noa\n  Garcia",
  "authorsParsed": [
    [
      "Ramos",
      "Patrick",
      ""
    ],
    [
      "Gonthier",
      "Nicolas",
      ""
    ],
    [
      "Khan",
      "Selina",
      ""
    ],
    [
      "Nakashima",
      "Yuta",
      ""
    ],
    [
      "Garcia",
      "Noa",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 08:16:24 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 18 Dec 2024 02:44:01 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1733732184000,
  "abstract": "  Object detection in art is a valuable tool for the digital humanities, as it\nallows for faster identification of objects in artistic and historical images\ncompared to humans. However, annotating such images poses significant\nchallenges due to the need for specialized domain expertise. We present NADA\n(no annotations for detection in art), a pipeline that leverages diffusion\nmodels' art-related knowledge for object detection in paintings without the\nneed for full bounding box supervision. Our method, which supports both\nweakly-supervised and zero-shot scenarios and does not require any fine-tuning\nof its pretrained components, consists of a class proposer based on large\nvision-language models and a class-conditioned detector based on Stable\nDiffusion. NADA is evaluated on two artwork datasets, ArtDL 2.0 and IconArt,\noutperforming prior work in weakly-supervised detection, while being the first\nwork for zero-shot object detection in art. Code is available at\nhttps://github.com/patrick-john-ramos/nada\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Z7-tey2U-t2QL8Y1IvmBgbDRX_FHCKhHt41OClvbQeU",
  "pdfSize": "2133310"
}