{
  "id": "2412.09055",
  "title": "Hyperbolic-constraint Point Cloud Reconstruction from Single RGB-D\n  Images",
  "authors": "Wenrui Li, Zhe Yang, Wei Han, Hengyu Man, Xingtao Wang, Xiaopeng Fan",
  "authorsParsed": [
    [
      "Li",
      "Wenrui",
      ""
    ],
    [
      "Yang",
      "Zhe",
      ""
    ],
    [
      "Han",
      "Wei",
      ""
    ],
    [
      "Man",
      "Hengyu",
      ""
    ],
    [
      "Wang",
      "Xingtao",
      ""
    ],
    [
      "Fan",
      "Xiaopeng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 08:27:39 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733992059000,
  "abstract": "  Reconstructing desired objects and scenes has long been a primary goal in 3D\ncomputer vision. Single-view point cloud reconstruction has become a popular\ntechnique due to its low cost and accurate results. However, single-view\nreconstruction methods often rely on expensive CAD models and complex geometric\npriors. Effectively utilizing prior knowledge about the data remains a\nchallenge. In this paper, we introduce hyperbolic space to 3D point cloud\nreconstruction, enabling the model to represent and understand complex\nhierarchical structures in point clouds with low distortion. We build upon\nprevious methods by proposing a hyperbolic Chamfer distance and a regularized\ntriplet loss to enhance the relationship between partial and complete point\nclouds. Additionally, we design adaptive boundary conditions to improve the\nmodel's understanding and reconstruction of 3D structures. Our model\noutperforms most existing models, and ablation studies demonstrate the\nsignificance of our model and its components. Experimental results show that\nour method significantly improves feature extraction capabilities. Our model\nachieves outstanding performance in 3D reconstruction tasks.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ciZ88RWugi-gMgW6CGxKFHSSwz9OSuwNSaFtv3WnxFA",
  "pdfSize": "1015084"
}