{"id":"2412.18548","title":"Unveiling the Emission Mechanisms of Blazar PKS 1510-089: II. Jet-BLR\n  Connection and Black Hole Mass Estimation","authors":"Alfredo Amador-Portes and Vahram Chavushyan and V\\'ictor M.\n  Pati\\~no-\\'Alvarez and Jos\\'e Ram\\'on-Vald\\'es","authorsParsed":[["Amador-Portes","Alfredo",""],["Chavushyan","Vahram",""],["Patiño-Álvarez","Víctor M.",""],["Ramón-Valdés","José",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 16:58:31 GMT"}],"updateDate":"2024-12-25","timestamp":1735059511000,"abstract":"  The flat spectrum radio quasar PKS 1510-089 is one of the most active blazars\nacross the entire electromagnetic spectrum, displaying periods of flaring\nactivity. This study explores its spectral variability over a decade. By\nemploying the non-thermal dominance parameter, we analyze the H$\\beta$ and\n$\\lambda5100\\text{ \\AA}$ continuum light curves, as well as the full width at\nhalf maximum of the H$\\beta$ emission line, to identify whether the primary\nsource of the continuum emission is the accretion disk or the jet during\nactivity periods. Our results shows an anti-correlation between the full width\nat half maximum and the luminosity of the H$\\beta$ emission line across all\ndatasets. This indicates, that variations in H$\\beta$ luminosity consistently\nreflects the canonical broad-line region, irrespective of whether the primary\nionizing source is the accretion disk or the jet. The anti-correlation\npersisted when comparing the full width at half maximum of H$\\beta$ against the\nluminosity at $\\lambda5100\\text{ \\AA}$ in the disk dominance regime. These\nfindings, along with the observation that flaring events in the\n$\\lambda5100\\text{ \\AA}$ continuum, attributed to the jet, coincide with flares\nin the H$\\beta$ emission line, suggest that the base of the jet is located\nwithin the broad-line region. Based on the 219 spectra within the disk\ndominance regime, we estimated a mean black hole mass of\n$M_{BH}=2.85\\pm0.37\\times10^{8}\\: M_{\\odot}$.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lGy3fZLZgWU5AR-uL7WcBGPFgu-K5dvsZU3zPT09PB4","pdfSize":"1872811"}