{
  "id": "2412.12570",
  "title": "A Simplified Analytical Approach for Determining Eclipses of Satellites\n  Occulted by a Celestial Body",
  "authors": "Vladislav Zubko and Andrey Belyaev",
  "authorsParsed": [
    [
      "Zubko",
      "Vladislav",
      ""
    ],
    [
      "Belyaev",
      "Andrey",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 06:02:19 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734415339000,
  "abstract": "  The primary objective of this paper is to construct an analytical model for\ndetermining the total duration of eclipse events of satellites. The approach\nassumes that the trace formed in the orbital plane, cutting body shadow under\nthe classical conical shadow model, can be described as an ellipse. This allows\nfor the derivation of its parameters through the use of classical orbital\nelements and solar position in the body-centric frame. Consequently, the\nproblem of identifying satellite occultation events is simplified to searching\nfor points of intersection between two ellipses: the satellite orbit and the\nshadow. The developed model has been demonstrated to be applicable for a wide\nrange of inclinations, with the exception of cases where the orbital plane of\nthe satellite motion coincides with that of the sun in the body-centric frame.\nIt is shown that the shadow function constructed under the aforementioned\nassumptions can be simplified in the cylindrical shadow model. Several\nsimplifications to the proposed model are presented in the study. The paper\nalso considers extending the model to account for non-spherical shapes of\ncelestial bodies, i.e., bodies with oblateness, and presents an algorithm that\naccounts for changes in eclipse duration due to the heliocentric motion of\nthese celestial bodies. The model has been validated through numerous tests\nwith a numerical algorithm and satellite real data, as well as with other\nanalytical models.\n",
  "subjects": [
    "Astrophysics/Instrumentation and Methods for Astrophysics",
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "f-g2KI4toB771U-SiL7aNrzTt75MnQDVsCwaZsMluaU",
  "pdfSize": "2536217"
}