{
  "id": "2412.10857",
  "title": "Robust Persian Digit Recognition in Noisy Environments Using Hybrid\n  CNN-BiGRU Model",
  "authors": "Ali Nasr-Esfahani, Mehdi Bekrani, Roozbeh Rajabi",
  "authorsParsed": [
    [
      "Nasr-Esfahani",
      "Ali",
      ""
    ],
    [
      "Bekrani",
      "Mehdi",
      ""
    ],
    [
      "Rajabi",
      "Roozbeh",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 15:11:42 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 11 Feb 2025 07:01:26 GMT"
    }
  ],
  "updateDate": "2025-02-12",
  "timestamp": 1734189102000,
  "abstract": "  Artificial intelligence (AI) has significantly advanced speech recognition\napplications. However, many existing neural network-based methods struggle with\nnoise, reducing accuracy in real-world environments. This study addresses\nisolated spoken Persian digit recognition (zero to nine) under noisy\nconditions, particularly for phonetically similar numbers. A hybrid model\ncombining residual convolutional neural networks and bidirectional gated\nrecurrent units (BiGRU) is proposed, utilizing word units instead of phoneme\nunits for speaker-independent recognition. The FARSDIGIT1 dataset, augmented\nwith various approaches, is processed using Mel-Frequency Cepstral Coefficients\n(MFCC) for feature extraction. Experimental results demonstrate the model's\neffectiveness, achieving 98.53%, 96.10%, and 95.92% accuracy on training,\nvalidation, and test sets, respectively. In noisy conditions, the proposed\napproach improves recognition by 26.88% over phoneme unit-based LSTM models and\nsurpasses the Mel-scale Two Dimension Root Cepstrum Coefficients (MTDRCC)\nfeature extraction technique along with MLP model (MTDRCC+MLP) by 7.61%.\n",
  "subjects": [
    "Computer Science/Sound",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Electrical Engineering and Systems Science/Audio and Speech Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "V9iayD39Y2YlARV7Rh1bx25hrTyA45QfC97LaKyQE-k",
  "pdfSize": "2429810"
}