{
  "id": "2412.03880",
  "title": "Transferring self-supervised pre-trained models for SHM data anomaly\n  detection with scarce labeled data",
  "authors": "Mingyuan Zhou, Xudong Jian, Ye Xia, Zhilu Lai",
  "authorsParsed": [
    [
      "Zhou",
      "Mingyuan",
      ""
    ],
    [
      "Jian",
      "Xudong",
      ""
    ],
    [
      "Xia",
      "Ye",
      ""
    ],
    [
      "Lai",
      "Zhilu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 05:25:30 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733376330000,
  "abstract": "  Structural health monitoring (SHM) has experienced significant advancements\nin recent decades, accumulating massive monitoring data. Data anomalies\ninevitably exist in monitoring data, posing significant challenges to their\neffective utilization. Recently, deep learning has emerged as an efficient and\neffective approach for anomaly detection in bridge SHM. Despite its progress,\nmany deep learning models require large amounts of labeled data for training.\nThe process of labeling data, however, is labor-intensive, time-consuming, and\noften impractical for large-scale SHM datasets. To address these challenges,\nthis work explores the use of self-supervised learning (SSL), an emerging\nparadigm that combines unsupervised pre-training and supervised fine-tuning.\nThe SSL-based framework aims to learn from only a very small quantity of\nlabeled data by fine-tuning, while making the best use of the vast amount of\nunlabeled SHM data by pre-training. Mainstream SSL methods are compared and\nvalidated on the SHM data of two in-service bridges. Comparative analysis\ndemonstrates that SSL techniques boost data anomaly detection performance,\nachieving increased F1 scores compared to conventional supervised training,\nespecially given a very limited amount of labeled data. This work manifests the\neffectiveness and superiority of SSL techniques on large-scale SHM data,\nproviding an efficient tool for preliminary anomaly detection with scarce label\ninformation.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Computational Engineering, Finance, and Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8TOS9ukEHU4t03l9K8hK-aT_Vycwq1XQoJRUINRdQ8s",
  "pdfSize": "4908391"
}