{"id":"2412.14138","title":"Cooperative polymer dynamics at the crossover between the unentangled\n  and the entangled regimes: theoretical predictions of scattering and linear\n  shear relaxation for polyethylene melts","authors":"M. G. Guenza","authorsParsed":[["Guenza","M. G.",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 18:33:50 GMT"}],"updateDate":"2024-12-19","timestamp":1734546830000,"abstract":"  The dynamics of polymer melts at the crossover between unentagled and\nentangled regimes is formalized here through an extension of the Cooperative\nDynamics Generalized Langevin Equation (CDGLE) (\\textit{J. Chem. Phys.}\n110,7574 (1999)), by including the constraint to the dynamics due to\nentanglements through an effective inter-monomer potential that confines the\nmotion of the chains. As one polymer chain in a melt interpenetrates with a\n$\\sqrt{N}$ other chains, with $N$ the degree of chain polymerization, their\ndynamics is coupled through their potential of mean-force, leading to chains'\ncooperative motion and center-of-mass subdiffusive dynamics. When increasing\nthe degree of polymerization, the extended CDGLE approach describes the\ndynamical behavior of unentangled to weakly entangled systems undergoing\ncooperative dynamics. By direct comparison of the CDGLE with data of Neutron\nSpin Echo (NSE) experiments on polyethylene melts we find that the cooperative\ndynamics in entangled systems are confined in the region delimited by\nentanglements. We extend the CDGLE to describe linear dynamical mechanical\nmeasurements and use it to calculate shear relaxation for the polyethylene\nsamples investigated by NSE. The effects of cooperative dynamics, local\nflexibility, and entanglements in the shear relaxation are discussed. It is\nnoteworthy that the theoretical approach describes with accuracy the crossover\nfrom unentangled to entangled-global dynamics for polyethylene melts of\nincreasing chain length, covering the regimes of unentangled and weakly\nentangled (up to $13$ entanglements) dynamics in one approach.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"dIpw489f0q8-qm8EWws6y6JqNrcfxQ52Ej9OoB1gsHE","pdfSize":"22309975"}