{"id":"2412.15617","title":"Simulating Three-Flavor Neutrino Oscillations on an NMR Quantum\n  Processor","authors":"Gayatri Singh and Arvind and Kavita Dorai","authorsParsed":[["Singh","Gayatri",""],["Arvind","",""],["Dorai","Kavita",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 07:22:11 GMT"}],"updateDate":"2024-12-23","timestamp":1734679331000,"abstract":"  Neutrino oscillations can be efficiently simulated on a quantum computer\nusing the Pontecorvo-Maki-Nakagawa-Sakata (PMNS) theory in close analogy to the\nphysical processes realized in experiments. We simulate three-flavor neutrino\noscillations on a two-qubit NMR quantum information processor. The three-flavor\nneutrino states were encoded into the two-qubit system, leaving one redundant\nbasis state (representing an unphysical sterile neutrino). We simulated the\nneutrino oscillations in different scenarios, including propagation in vacuum\nand through surrounding matter, and both with and without a CP violating phase\n$\\delta$ at a Deep Underground Neutrino Experiment (DUNE) baseline distance of\nL = 1285 km. The oscillation probabilities were obtained after unitarily time\nevolving the initial flavor state and and comparisons were performed between\ndifferent scenarios. Further, we design and implement an optimized quantum\ncircuit encoding all four parameters (three mixing\nangles-$\\theta_{12},\\theta_{23},\\theta_{13}$ and one complex phase $\\delta$) to\nimplement the PMNS unitary matrix, which relates the flavor and mass\neigenstates. The interaction with matter is considered as a perturbation to the\nvacuum Hamiltonian, and the same quantum circuit is employed with an\napproximation of two mixing angles ($\\theta_{12}$ and $\\theta_{13}$ ) and mass\neigenvalues. Our experimental results match well with numerical simulations and\nhighlight the potential of quantum computers for exploring the physics of\nneutrino oscillations.\n","subjects":["Physics/Quantum Physics","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"chKnDQsJBfVzQyVGABXycaEYrEzD18C73dJ0Uxu01mE","pdfSize":"1945977"}