{"id":"2412.19854","title":"Semi-Classical Spin Hydrodynamics in Flat and Curved Spacetime:\n  Covariance, Linear Waves, and Bjorken Background","authors":"Annamaria Chiarini, Julia Sammet, and Masoud Shokri","authorsParsed":[["Chiarini","Annamaria",""],["Sammet","Julia",""],["Shokri","Masoud",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 20:01:10 GMT"}],"updateDate":"2024-12-31","timestamp":1735156870000,"abstract":"  We explore various aspects of semi-classical spin hydrodynamics, where\nhydrodynamic currents are derived from an expansion in the reduced Planck\nconstant $\\hbar$, incorporating both flat and curved spacetimes. After\nestablishing covariant definitions for angular momentum currents, we\ndemonstrate that the conservation of the energy-momentum tensor requires\nmodifications involving the Riemann curvature and the spin tensors. We also\nrevise pseudo-gauge transformations to ensure their applicability in curved\nspacetimes. Key assumptions for semi-classical spin hydrodynamics are\nintroduced, enabling studies without explicitly invoking quantum kinetic\ntheory. We derive and analyze the linearized semi-classical spin hydrodynamic\nequations, proving that spin and fluid modes decouple in the linear regime. As\na concrete example, we study the ideal-spin approximation in a dissipative\nfluid with shear viscosity. This analysis confirms our general result: the\ndamping of spin waves is governed solely by spin relaxation time coefficients,\nindependent of linear fluid perturbations. We also examine the Gibbs stability\ncriterion and reveal its limitations at first order in $\\hbar$, signaling the\ninherent anisotropy of the equilibrium state, which remains unaddressed in\ncurrent semi-classical spin hydrodynamics formulations. Finally, within a\nconformal Bjorken flow background and using the slow-roll approximation\nattractor for the fluid sector, we show that the relaxation of the spin\npotential is governed by spin relaxation time coefficients, mirroring the\ndamping behavior of spin waves in the linear regime.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Q5y6tWyU8DGR_68ZfLKROIHS_quhtANgCDprJqSiFOo","pdfSize":"779847"}