{"id":"2412.17098","title":"DreamOmni: Unified Image Generation and Editing","authors":"Bin Xia, Yuechen Zhang, Jingyao Li, Chengyao Wang, Yitong Wang,\n  Xinglong Wu, Bei Yu, and Jiaya Jia","authorsParsed":[["Xia","Bin",""],["Zhang","Yuechen",""],["Li","Jingyao",""],["Wang","Chengyao",""],["Wang","Yitong",""],["Wu","Xinglong",""],["Yu","Bei",""],["Jia","Jiaya",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 17:17:28 GMT"}],"updateDate":"2024-12-24","timestamp":1734887848000,"abstract":"  Currently, the success of large language models (LLMs) illustrates that a\nunified multitasking approach can significantly enhance model usability,\nstreamline deployment, and foster synergistic benefits across different tasks.\nHowever, in computer vision, while text-to-image (T2I) models have\nsignificantly improved generation quality through scaling up, their framework\ndesign did not initially consider how to unify with downstream tasks, such as\nvarious types of editing. To address this, we introduce DreamOmni, a unified\nmodel for image generation and editing. We begin by analyzing existing\nframeworks and the requirements of downstream tasks, proposing a unified\nframework that integrates both T2I models and various editing tasks.\nFurthermore, another key challenge is the efficient creation of high-quality\nediting data, particularly for instruction-based and drag-based editing. To\nthis end, we develop a synthetic data pipeline using sticker-like elements to\nsynthesize accurate, high-quality datasets efficiently, which enables editing\ndata scaling up for unified model training. For training, DreamOmni jointly\ntrains T2I generation and downstream tasks. T2I training enhances the model's\nunderstanding of specific concepts and improves generation quality, while\nediting training helps the model grasp the nuances of the editing task. This\ncollaboration significantly boosts editing performance. Extensive experiments\nconfirm the effectiveness of DreamOmni. The code and model will be released.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3jqOvRnTIZKhgZf5hgN-o0Zu3xoDZVEt52cw4wSFoHE","pdfSize":"28960489"}