{
  "id": "2412.12122",
  "title": "Inverse design of potential metastructures inspired from Indian medieval\n  architectural elements",
  "authors": "Bishakh Bhattacharya, Tanuj Gupta, Arun Kumar Sharma, Ankur Dwivedi,\n  Vivek Gupta, Subhadeep Sahana, Suryansh Pathak, Ashish Awasthi",
  "authorsParsed": [
    [
      "Bhattacharya",
      "Bishakh",
      ""
    ],
    [
      "Gupta",
      "Tanuj",
      ""
    ],
    [
      "Sharma",
      "Arun Kumar",
      ""
    ],
    [
      "Dwivedi",
      "Ankur",
      ""
    ],
    [
      "Gupta",
      "Vivek",
      ""
    ],
    [
      "Sahana",
      "Subhadeep",
      ""
    ],
    [
      "Pathak",
      "Suryansh",
      ""
    ],
    [
      "Awasthi",
      "Ashish",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 12:02:11 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 22 Dec 2024 13:10:48 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1733227331000,
  "abstract": "  In this study, we immerse in the intricate world of patterns, examining the\nstructural details of Indian medieval architecture for the discovery of motifs\nwith great application potential from the mechanical metastructure perspective.\nThe motifs that specifically engrossed us are derived from the tomb of\nI'timad-ud-Daula, situated in the city of Agra, close to the Taj Mahal. In an\nexploratory study, we designed nine interlaced metastructures inspired from the\ntomb's motifs. We fabricated the metastructures using additive manufacturing\nand studied their vibration characteristics experimentally and numerically. We\nalso investigated bandgap modulation with metallic inserts in honeycomb\ninterlaced metastructures. The comprehensive study of these metastructure\npanels reveals their high performance in controlling elastic wave propagation\nand generating suitable frequency bandgaps, hence having potential applications\nas waveguides for noise and vibration control. Finally, we developed a novel\nAI-based model trained on numerical datasets for the inverse design of\nmetastructures with a desired bandgap.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zRIoqIotFXq6q3apkfhPJb4vLdEs5zpmvDo8LM8w4ek",
  "pdfSize": "7328410"
}