{"id":"2412.15447","title":"LiHi-GS: LiDAR-Supervised Gaussian Splatting for Highway Driving Scene\n  Reconstruction","authors":"Pou-Chun Kung, Xianling Zhang, Katherine A. Skinner, Nikita Jaipuria","authorsParsed":[["Kung","Pou-Chun",""],["Zhang","Xianling",""],["Skinner","Katherine A.",""],["Jaipuria","Nikita",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 22:59:55 GMT"},{"version":"v2","created":"Thu, 26 Dec 2024 16:37:43 GMT"}],"updateDate":"2024-12-30","timestamp":1734649195000,"abstract":"  Photorealistic 3D scene reconstruction plays an important role in autonomous\ndriving, enabling the generation of novel data from existing datasets to\nsimulate safety-critical scenarios and expand training data without additional\nacquisition costs. Gaussian Splatting (GS) facilitates real-time,\nphotorealistic rendering with an explicit 3D Gaussian representation of the\nscene, providing faster processing and more intuitive scene editing than the\nimplicit Neural Radiance Fields (NeRFs). While extensive GS research has\nyielded promising advancements in autonomous driving applications, they\noverlook two critical aspects: First, existing methods mainly focus on\nlow-speed and feature-rich urban scenes and ignore the fact that highway\nscenarios play a significant role in autonomous driving. Second, while LiDARs\nare commonplace in autonomous driving platforms, existing methods learn\nprimarily from images and use LiDAR only for initial estimates or without\nprecise sensor modeling, thus missing out on leveraging the rich depth\ninformation LiDAR offers and limiting the ability to synthesize LiDAR data. In\nthis paper, we propose a novel GS method for dynamic scene synthesis and\nediting with improved scene reconstruction through LiDAR supervision and\nsupport for LiDAR rendering. Unlike prior works that are tested mostly on urban\ndatasets, to the best of our knowledge, we are the first to focus on the more\nchallenging and highly relevant highway scenes for autonomous driving, with\nsparse sensor views and monotone backgrounds. Visit our project page at:\nhttps://umautobots.github.io/lihi_gs\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"NxRadRX2lwPld62rPjla0aXKl0EEYmxjVa55jVLYO94","pdfSize":"36914182"}