{
  "id": "2412.16800",
  "title": "The time-relaxation limit for weak solutions to the quantum\n  hydrodynamics system",
  "authors": "Paolo Antonelli, Pierangelo Marcati, Hao Zheng",
  "authorsParsed": [
    [
      "Antonelli",
      "Paolo",
      ""
    ],
    [
      "Marcati",
      "Pierangelo",
      ""
    ],
    [
      "Zheng",
      "Hao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 23:07:11 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734822431000,
  "abstract": "  This paper analyzes weak solutions of the quantum hydrodynamics (QHD) system\nwith a collisional term posed on the one-dimensional torus. The main goal of\nour analysis is to rigorously prove the time-relaxation limit towards solutions\nto the quantum drift-diffusion (QDD) equation. The existence of global in time,\nfinite energy weak solutions can be proved by straightforwardly exploiting the\npolar factorization and wave function lifting tools previously developed by the\nauthors. However, the sole energy bounds are not sufficient to show compactness\nand then pass to the limit. For this reason, we consider a class of more\nregular weak solutions (termed GCP solutions), determined by the finiteness of\na functional involving the chemical potential associated with the system. For\nsolutions in this class and bounded away from vacuum, we prove the\ntime-relaxation limit and provide an explicit convergence rate. Our analysis\nexploits compactness tools and does not require the existence (and smoothness)\nof solutions to the limiting equations or the well-preparedness of the initial\ndata. As a by-product of our analysis, we also establish the existence of\nglobal in time $H^2$ solutions to a nonlinear Schr\\\"odinger-Langevin equation\nand construct solutions to the QDD equation as strong limits of GCP solutions\nto the QHD system.\n",
  "subjects": [
    "Mathematics/Analysis of PDEs"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "NPqnOh4VwGAC4fniO4YKQeZYnt8BwC11STn-UVJLzgU",
  "pdfSize": "518952"
}