{"id":"2412.20026","title":"Neutrino mass ordering sensitivities at DUNE, HK and KNO in presence of\n  scalar NSI","authors":"Moon Moon Devi, Dharitree Bezboruah, Abinash Medhi, Arnab Sarker,\n  Debajyoti Dutta","authorsParsed":[["Devi","Moon Moon",""],["Bezboruah","Dharitree",""],["Medhi","Abinash",""],["Sarker","Arnab",""],["Dutta","Debajyoti",""]],"versions":[{"version":"v1","created":"Sat, 28 Dec 2024 05:12:59 GMT"}],"updateDate":"2024-12-31","timestamp":1735362779000,"abstract":"  The limitations of the Standard Model in explaining neutrino masses and\nneutrino mixing lead to the exploration of frameworks beyond the Standard Model\n(BSM). The possibility of neutrinos interacting with fermions via a scalar\nmediator is one of the interesting prospects. The study of neutrino\nnon-standard interactions (NSI) is a well-motivated phenomenological scenario\nto explore new physics beyond the Standard Model. These new interactions may\nalter the standard neutrino oscillation probabilities, potentially leading to\nobservable effects in experiments. It also allows for the exploration of\nabsolute neutrino masses via oscillation experiments. It can modify the\noscillation probabilities, which in turn can affect the physics sensitivities\nin long-baseline experiments. The linear scaling of the effects of scalar NSI\nwith matter density also motivates its exploration in long-baseline (LBL)\nexperiments. We will present our study on the impact of a scalar-mediated NSI\non the mass ordering (MO) sensitivities of three long-baseline neutrino\nexperiments, i.e., DUNE, HK and KNO. We study the impact on MO sensitivities at\nthese experiments assuming that scalar NSI parameters are present in nature and\nare known from other non-LBL experiments. The presence of scalar NSI can\nnotably impact the MO sensitivities of these experiments. Furthermore, we\nanalyze the potential synergy by combining data from DUNE with HK and HK+KNO,\nthereby exploring a broader parameter space.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LsLl5iGBrGsjjWE1p2qqycEAo_To-YLtuPlAugQCwrY","pdfSize":"751549"}