{
  "id": "2412.14740",
  "title": "Recovering semipermeable barriers from reflected Brownian motion",
  "authors": "Alexander Van Werde, Jaron Sanders",
  "authorsParsed": [
    [
      "Van Werde",
      "Alexander",
      ""
    ],
    [
      "Sanders",
      "Jaron",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 11:15:28 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734606928000,
  "abstract": "  We study the recovery of one-dimensional semipermeable barriers for a\nstochastic process in a planar domain. The considered process acts like\nBrownian motion when away from the barriers and is reflected upon contact until\na sufficient but random amount of interaction has occurred, determined by the\npermeability, after which it passes through. Given a sequence of samples, we\nwonder when one can determine the location and shape of the barriers.\n  This paper identifies several different recovery regimes, determined by the\navailable observation period and the time between samples, with qualitatively\ndifferent behavior. The observation period $T$ dictates if the full barriers or\nonly certain pieces can be recovered, and the sampling rate significantly\ninfluences the convergence rate as $T\\to \\infty$. This rate turns out\npolynomial for fixed-frequency data, but exponentially fast in a high-frequency\nregime.\n  Further, the environment's impact on the difficulty of the problem is\nquantified using interpretable parameters in the recovery guarantees, and is\nfound to also be regime-dependent. For instance, the curvature of the barriers\naffects the convergence rate for fixed-frequency data, but becomes irrelevant\nwhen $T\\to \\infty$ with high-frequency data.\n  The results are accompanied by explicit algorithms, and we conclude by\nillustrating the application to real-life data.\n",
  "subjects": [
    "Mathematics/Probability",
    "Mathematics/Statistics Theory",
    "Statistics/Statistics Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "K0plXv2vg_t5vTsYvyzxk3kZRYSknTSs-Wb9iv-SpXA",
  "pdfSize": "5604829"
}