{
  "id": "2412.07342",
  "title": "A unified framework on the original energy laws of three effective\n  classes of Runge-Kutta methods for phase field crystal type models",
  "authors": "Xuping Wang, Xuan Zhao, Hong-lin Liao",
  "authorsParsed": [
    [
      "Wang",
      "Xuping",
      ""
    ],
    [
      "Zhao",
      "Xuan",
      ""
    ],
    [
      "Liao",
      "Hong-lin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 09:34:23 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733823263000,
  "abstract": "  The main theoretical obstacle to establish the original energy dissipation\nlaws of Runge-Kutta methods for phase-field equations is to verify the maximum\nnorm boundedness of the stage solutions without assuming global Lipschitz\ncontinuity of the nonlinear bulk. We present a unified theoretical framework\nfor the energy stability of three effective classes of Runge-Kutta methods,\nincluding the additive implicit-explicit Runge-Kutta, explicit exponential\nRunge-Kutta and corrected integrating factor Runge-Kutta methods, for the\nSwift-Hohenberg and phase field crystal models. By the standard discrete energy\nargument, it is proven that the three classes of Runge-Kutta methods preserve\nthe original energy dissipation laws if the associated differentiation matrices\nare positive definite. Our main tools include the differential form with the\nassociated differentiation matrix, the discrete orthogonal convolution kernels\nand the principle of mathematical induction. Many existing Runge-Kutta methods\nin the literature are revisited by evaluating the lower bound on the minimum\neigenvalues of the associated differentiation matrices. Our theoretical\napproach paves a new way for the internal nonlinear stability of Runge-Kutta\nmethods for dissipative semilinear parabolic problems.\n",
  "subjects": [
    "Mathematics/Numerical Analysis",
    "Computer Science/Numerical Analysis"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "GoV5wzEztg5bUJ35gL1SbjnCNJ6TnZD3IkqLeWmd_WQ",
  "pdfSize": "798236"
}