{
  "id": "2412.16839",
  "title": "Human-Guided Image Generation for Expanding Small-Scale Training Image\n  Datasets",
  "authors": "Changjian Chen, Fei Lv, Yalong Guan, Pengcheng Wang, Shengjie Yu,\n  Yifan Zhang, and Zhuo Tang",
  "authorsParsed": [
    [
      "Chen",
      "Changjian",
      ""
    ],
    [
      "Lv",
      "Fei",
      ""
    ],
    [
      "Guan",
      "Yalong",
      ""
    ],
    [
      "Wang",
      "Pengcheng",
      ""
    ],
    [
      "Yu",
      "Shengjie",
      ""
    ],
    [
      "Zhang",
      "Yifan",
      ""
    ],
    [
      "Tang",
      "Zhuo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 03:15:39 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 24 Dec 2024 01:53:54 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734837339000,
  "abstract": "  The performance of computer vision models in certain real-world applications\n(e.g., rare wildlife observation) is limited by the small number of available\nimages. Expanding datasets using pre-trained generative models is an effective\nway to address this limitation. However, since the automatic generation process\nis uncontrollable, the generated images are usually limited in diversity, and\nsome of them are undesired. In this paper, we propose a human-guided image\ngeneration method for more controllable dataset expansion. We develop a\nmulti-modal projection method with theoretical guarantees to facilitate the\nexploration of both the original and generated images. Based on the\nexploration, users refine the prompts and re-generate images for better\nperformance. Since directly refining the prompts is challenging for novice\nusers, we develop a sample-level prompt refinement method to make it easier.\nWith this method, users only need to provide sample-level feedback (e.g., which\nsamples are undesired) to obtain better prompts. The effectiveness of our\nmethod is demonstrated through the quantitative evaluation of the multi-modal\nprojection method, improved model performance in the case study for both\nclassification and object detection tasks, and positive feedback from the\nexperts.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "I4NkJ4s07L_0-UvD4pLgvl472o1ZKa1QbL7zY60Ch-g",
  "pdfSize": "12537649"
}