{"id":"2412.05048","title":"FAST: A software suite for automatic weather and optical turbulence\n  forecast on ground-based telescope sites","authors":"A. Turchi, E. Masciadri, L. Fini","authorsParsed":[["Turchi","A.",""],["Masciadri","E.",""],["Fini","L.",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 13:57:09 GMT"}],"updateDate":"2024-12-09","timestamp":1733493429000,"abstract":"  In this contribution we present the FAST, which is a comprehensive software\nsuite that aims to streamline and automatically manage the forecast of\natmospheric and astroclimatic parameters (provided respectively by Meso-Nh and\nAstro-Meso-Nh models) on large ground-based telescope installations. The\nforecast of the aforementioned parameters is becoming crucial for the operation\nof the large telescope installations which possess atmospheric-sensitive\nequipment equipped with Adaptive Optics (AO) systems. FAST performs\nautomatically all the steps of an atmosphere forecast process: initialisation\nand forcing data, atmospheric simulation, postprocessing and managing of the\noutputs.The role of such service is useful both in optimizing beforehand AO\ninstruments to the next atmospheric conditions and in planning telescope\nobservations (especially in \"service mode\") in order to maximize the scientific\noutput. FAST was applied first to the ALTA Center project, which provides\nforecasts for the LBT telescope. Then it was extended to the more recent\nproject FATE that is a similar forecast system applied to the VLT. Since its\nfirst version FAST evolved and it has has been modified to fit with the\ndifferent technical specifications of the different projects gaining in\nmodularity. It is now able to provide forecasts on different timescales (from\ndays to hours before) and to provide forecast during night and day time. After\nseveral years of continuous development we can say that FAST reached full\nmaturity and it is now ready for applications to other projects/sites.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6U5lqzF-eVkIQu-jjxt-noS4VHZQi_5PnjtTOO7ig08","pdfSize":"490754"}