{"id":"2412.05728","title":"Integrating YOLO11 and Convolution Block Attention Module for\n  Multi-Season Segmentation of Tree Trunks and Branches in Commercial Apple\n  Orchards","authors":"Ranjan Sapkota, Manoj Karkee","authorsParsed":[["Sapkota","Ranjan",""],["Karkee","Manoj",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 19:36:22 GMT"}],"updateDate":"2024-12-10","timestamp":1733600182000,"abstract":"  In this study, we developed a customized instance segmentation model by\nintegrating the Convolutional Block Attention Module (CBAM) with the YOLO11\narchitecture. This model, trained on a mixed dataset of dormant and canopy\nseason apple orchard images, aimed to enhance the segmentation of tree trunks\nand branches under varying seasonal conditions throughout the year. The model\nwas individually validated across dormant and canopy season images after\ntraining the YOLO11-CBAM on the mixed dataset collected over the two seasons.\nAdditional testing of the model during pre-bloom, flower bloom, fruit thinning,\nand harvest season was performed. The highest recall and precision metrics were\nobserved in the YOLO11x-seg-CBAM and YOLO11m-seg-CBAM respectively.\nParticularly, YOLO11m-seg with CBAM showed the highest precision of 0.83 as\nperformed for the Trunk class in training, while without the CBAM, YOLO11m-seg\nachieved 0.80 precision score for the Trunk class. Likewise, for branch class,\nYOLO11m-seg with CBAM achieved the highest precision score value of 0.75 while\nwithout the CBAM, the YOLO11m-seg achieved a precision of 0.73. For dormant\nseason validation, YOLO11x-seg exhibited the highest precision at 0.91. Canopy\nseason validation highlighted YOLO11s-seg with superior precision across all\nclasses, achieving 0.516 for Branch, and 0.64 for Trunk. The modeling approach,\ntrained on two season datasets as dormant and canopy season images,\ndemonstrated the potential of the YOLO11-CBAM integration to effectively detect\nand segment tree trunks and branches year-round across all seasonal variations.\nKeywords: YOLOv11, YOLOv11 Tree Detection, YOLOv11 Branch Detection and\nSegmentation, Machine Vision, Deep Learning, Machine Learning\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"byAP5q-jAN6XtotNr8DzA7QGEr7xOOHMr6VpxVgPdak","pdfSize":"29134210"}