{
  "id": "2412.01041",
  "title": "LiDAR SLAMMOT based on Confidence-guided Data Association",
  "authors": "Susu Fang and Hao Li",
  "authorsParsed": [
    [
      "Fang",
      "Susu",
      ""
    ],
    [
      "Li",
      "Hao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 01:54:41 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733104481000,
  "abstract": "  In the field of autonomous driving or robotics, simultaneous localization and\nmapping (SLAM) and multi-object tracking (MOT) are two fundamental problems and\nare generally applied separately. Solutions to SLAM and MOT usually rely on\ncertain assumptions, such as the static environment assumption for SLAM and the\naccurate ego-vehicle pose assumption for MOT. But in complex dynamic\nenvironments, it is difficult or even impossible to meet these assumptions.\nTherefore, the SLAMMOT, i.e., simultaneous localization, mapping, and moving\nobject tracking, integrated system of SLAM and object tracking, has emerged for\nautonomous vehicles in dynamic environments. However, many conventional SLAMMOT\nsolutions directly perform data association on the predictions and detections\nfor object tracking, but ignore their quality. In practice, inaccurate\npredictions caused by continuous multi-frame missed detections in temporary\nocclusion scenarios, may degrade the performance of tracking, thereby affecting\nSLAMMOT. To address this challenge, this paper presents a LiDAR SLAMMOT based\non confidence-guided data association (Conf SLAMMOT) method, which tightly\ncouples the LiDAR SLAM and the confidence-guided data association based\nmulti-object tracking into a graph optimization backend for estimating the\nstate of the ego-vehicle and objects simultaneously. The confidence of\nprediction and detection are applied in the factor graph-based multi-object\ntracking for its data association, which not only avoids the performance\ndegradation caused by incorrect initial assignments in some filter-based\nmethods but also handles issues such as continuous missed detection in tracking\nwhile also improving the overall performance of SLAMMOT. Various comparative\nexperiments demonstrate the superior advantages of Conf SLAMMOT, especially in\nscenes with some missed detections.\n",
  "subjects": [
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ipwEgWOGXOUnvt8MaiJ36xsOzpM-TAzAClP9rlXBn_4",
  "pdfSize": "5548770"
}