{"id":"2412.18733","title":"Intra- and Inter-modal Context Interaction Modeling for Conversational\n  Speech Synthesis","authors":"Zhenqi Jia, Rui Liu","authorsParsed":[["Jia","Zhenqi",""],["Liu","Rui",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 01:35:59 GMT"}],"updateDate":"2024-12-30","timestamp":1735090559000,"abstract":"  Conversational Speech Synthesis (CSS) aims to effectively take the multimodal\ndialogue history (MDH) to generate speech with appropriate conversational\nprosody for target utterance. The key challenge of CSS is to model the\ninteraction between the MDH and the target utterance. Note that text and speech\nmodalities in MDH have their own unique influences, and they complement each\nother to produce a comprehensive impact on the target utterance. Previous works\ndid not explicitly model such intra-modal and inter-modal interactions. To\naddress this issue, we propose a new intra-modal and inter-modal context\ninteraction scheme-based CSS system, termed III-CSS. Specifically, in the\ntraining phase, we combine the MDH with the text and speech modalities in the\ntarget utterance to obtain four modal combinations, including Historical\nText-Next Text, Historical Speech-Next Speech, Historical Text-Next Speech, and\nHistorical Speech-Next Text. Then, we design two contrastive learning-based\nintra-modal and two inter-modal interaction modules to deeply learn the\nintra-modal and inter-modal context interaction. In the inference phase, we\ntake MDH and adopt trained interaction modules to fully infer the speech\nprosody of the target utterance's text content. Subjective and objective\nexperiments on the DailyTalk dataset show that III-CSS outperforms the advanced\nbaselines in terms of prosody expressiveness. Code and speech samples are\navailable at https://github.com/AI-S2-Lab/I3CSS.\n","subjects":["Computer Science/Computation and Language","Computer Science/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LZg7j4iqwJtIB0EzCF1xVI2wrPtwVDN0KKTOjeViwsk","pdfSize":"2988138"}