{
  "id": "2412.00372",
  "title": "2-Factor Retrieval for Improved Human-AI Decision Making in Radiology",
  "authors": "Jim Solomon, Laleh Jalilian, Alexander Vilesov, Meryl Mathew, Tristan\n  Grogan, Arash Bedayat, Achuta Kadambi",
  "authorsParsed": [
    [
      "Solomon",
      "Jim",
      ""
    ],
    [
      "Jalilian",
      "Laleh",
      ""
    ],
    [
      "Vilesov",
      "Alexander",
      ""
    ],
    [
      "Mathew",
      "Meryl",
      ""
    ],
    [
      "Grogan",
      "Tristan",
      ""
    ],
    [
      "Bedayat",
      "Arash",
      ""
    ],
    [
      "Kadambi",
      "Achuta",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 06:44:42 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732949082000,
  "abstract": "  Human-machine teaming in medical AI requires us to understand to what degree\na trained clinician should weigh AI predictions. While previous work has shown\nthe potential of AI assistance at improving clinical predictions, existing\nclinical decision support systems either provide no explainability of their\npredictions or use techniques like saliency and Shapley values, which do not\nallow for physician-based verification. To address this gap, this study\ncompares previously used explainable AI techniques with a newly proposed\ntechnique termed '2-factor retrieval (2FR)', which is a combination of\ninterface design and search retrieval that returns similarly labeled data\nwithout processing this data. This results in a 2-factor security blanket\nwhere: (a) correct images need to be retrieved by the AI; and (b) humans should\nassociate the retrieved images with the current pathology under test. We find\nthat when tested on chest X-ray diagnoses, 2FR leads to increases in clinician\naccuracy, with particular improvements when clinicians are radiologists and\nhave low confidence in their decision. Our results highlight the importance of\nunderstanding how different modes of human-AI decision making may impact\nclinician accuracy in clinical decision support systems.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "gdX-ovDOOErPjepat7AvM4BX0_BYDlyT-nkpHOWb2so",
  "pdfSize": "4993543"
}