{"id":"2412.17780","title":"PepTune: De Novo Generation of Therapeutic Peptides with\n  Multi-Objective-Guided Discrete Diffusion","authors":"Sophia Tang, Yinuo Zhang, Pranam Chatterjee","authorsParsed":[["Tang","Sophia",""],["Zhang","Yinuo",""],["Chatterjee","Pranam",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 18:38:49 GMT"},{"version":"v2","created":"Mon, 30 Dec 2024 16:41:00 GMT"},{"version":"v3","created":"Wed, 1 Jan 2025 15:34:56 GMT"}],"updateDate":"2025-01-03","timestamp":1734979129000,"abstract":"  Peptide therapeutics, a major class of medicines, have achieved remarkable\nsuccess across diseases such as diabetes and cancer, with landmark examples\nsuch as GLP-1 receptor agonists revolutionizing the treatment of type-2\ndiabetes and obesity. Despite their success, designing peptides that satisfy\nmultiple conflicting objectives, such as target binding affinity, solubility,\nand membrane permeability, remains a major challenge. Classical drug\ndevelopment and structure-based design are ineffective for such tasks, as they\nfail to optimize global functional properties critical for therapeutic\nefficacy. Existing generative frameworks are largely limited to continuous\nspaces, unconditioned outputs, or single-objective guidance, making them\nunsuitable for discrete sequence optimization across multiple properties. To\naddress this, we present PepTune, a multi-objective discrete diffusion model\nfor the simultaneous generation and optimization of therapeutic peptide SMILES.\nBuilt on the Masked Discrete Language Model (MDLM) framework, PepTune ensures\nvalid peptide structures with state-dependent masking schedules and\npenalty-based objectives. To guide the diffusion process, we propose a Monte\nCarlo Tree Search (MCTS)-based strategy that balances exploration and\nexploitation to iteratively refine Pareto-optimal sequences. MCTS integrates\nclassifier-based rewards with search-tree expansion, overcoming gradient\nestimation challenges and data sparsity inherent to discrete spaces. Using\nPepTune, we generate diverse, chemically-modified peptides optimized for\nmultiple therapeutic properties, including target binding affinity, membrane\npermeability, solubility, hemolysis, and non-fouling characteristics on various\ndisease-relevant targets. In total, our results demonstrate that MCTS-guided\ndiscrete diffusion is a powerful and modular approach for multi-objective\nsequence design in discrete state spaces.\n","subjects":["Quantitative Biology/Biomolecules","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"zPK-lzuWKgtl1_BCmQE3F36yzwrca5f98hgNtZnbs_o","pdfSize":"51611519"}