{
  "id": "2412.01982",
  "title": "Pooling Solvent Mixtures for Solvation Free Energy Predictions",
  "authors": "Roel J. Leenhouts, Nathan Morgan, Emad Al Ibrahim, William H. Green,\n  Florence H. Vermeire",
  "authorsParsed": [
    [
      "Leenhouts",
      "Roel J.",
      ""
    ],
    [
      "Morgan",
      "Nathan",
      ""
    ],
    [
      "Ibrahim",
      "Emad Al",
      ""
    ],
    [
      "Green",
      "William H.",
      ""
    ],
    [
      "Vermeire",
      "Florence H.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 21:20:24 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 11 Dec 2024 13:38:29 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733174424000,
  "abstract": "  Solvation free energy is an important design parameter in reaction kinetics\nand separation processes, making it a critical property to predict during\nprocess development. In previous research, directed message passing neural\nnetworks (D-MPNN) have successfully been used to predict solvation free\nenergies and enthalpies in organic solvents. However, solvent mixtures provide\ngreater flexibility for optimizing solvent interactions than monosolvents. This\nwork aims to extend our previous models to mixtures. To handle mixtures in a\npermutation invariant manner we propose a pooling function; MolPool. With this\npooling function, the machine learning models can learn and predict properties\nfor an arbitrary number of molecules. The novel SolProp-mix software that\napplies MolPool to D-MPNN was compared to state-of-the-art architectures for\npredicting mixture properties and validated with our new database of COSMOtherm\ncalculations; BinarySolv-QM. To improve predictions towards experimental\naccuracy, the network was then fine-tuned on experimental data in monosolvents.\nTo demonstrate the benefit of this transfer learning methodology, experimental\ndatasets of solvation free energies in binary (BinarySolv-Exp) and ternary\n(TernarySolv-Exp) solvent mixtures were compiled from data on vapor-liquid\nequilibria and activity coefficients. The neural network performed better than\nCOSMOtherm calculations with an MAE of 0.25 kcal/mol and an RMSE of 0.37\nkcal/mol for non-aqueous mixed solvents. Additionally, the ability to capture\ntrends for a varying mixture composition was validated successfully. Our\nmodel's ability to accurately predict mixture properties from the combination\nof in silico data and pure component experimental data is promising given the\nscarcity of experimental data for mixtures in many fields.\n",
  "subjects": [
    "Physics/Chemical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "JU3-UHVSOY3W6GJV__NeKAA2Ucw6K7Ip35BIxma9gK0",
  "pdfSize": "10260044"
}