{
  "id": "2412.04014",
  "title": "(Blind) Users Really Do Heed Aural Telephone Scam Warnings",
  "authors": "Filipo Sharevski and Jennifer Vander Loop and Bill Evans and Alexander\n  Ponticello",
  "authorsParsed": [
    [
      "Sharevski",
      "Filipo",
      ""
    ],
    [
      "Loop",
      "Jennifer Vander",
      ""
    ],
    [
      "Evans",
      "Bill",
      ""
    ],
    [
      "Ponticello",
      "Alexander",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 09:47:38 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733392058000,
  "abstract": "  This paper reports on a study exploring how two groups of individuals,\nlegally blind (n=36) and sighted ones (n=36), react to aural telephone scam\nwarnings in naturalistic settings. As spoofing a CallerID is trivial,\ncommunicating the context of an incoming call instead offers a better\npossibility to warn a receiver about a potential scam. Usually, such warnings\nare visual in nature and fail to cater to users with visual disabilities. To\naddress this exclusion, we developed an aural variant of telephone scam\nwarnings and tested them in three conditions: baseline (no warning), short\nwarning, and contextual warning that preceded the scam's content. We tested the\ntwo most common scam scenarios: fraud (interest rate reduction) and identity\ntheft (social security number) by cold-calling participants and recording their\naction, and debriefing and obtaining consent afterward. Only two participants\n\"pressed one\" as the scam demanded, both from the legally blind group that\nheard the contextual warning for the social security scenario. Upon close\ninspection, we learned that one of them did so because of accessibility issues\nwith their screen reader and the other did so intentionally because the warning\nconvinced them to waste the scammer's time, so they don't scam vulnerable\npeople. Both the legally blind and the sighted participants found the\ncontextual warnings as powerful usable security cues that, together with\nSTIR/SHAKEN indicators like \"Scam Likely\", would provide robust protection\nagainst any type of scam. We also discussed the potential privacy implications\nof the contextual warnings and collected recommendations for usably accessible\nimplementation.\n",
  "subjects": [
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "CHquhxXJQnEuAlT2cvoaBXyP4G21dNVY8jK0FWrQ47A",
  "pdfSize": "443046"
}