{"id":"2412.20631","title":"Slow Perception: Let's Perceive Geometric Figures Step-by-step","authors":"Haoran Wei, Youyang Yin, Yumeng Li, Jia Wang, Liang Zhao, Jianjian\n  Sun, Zheng Ge, Xiangyu Zhang, Daxin Jiang","authorsParsed":[["Wei","Haoran",""],["Yin","Youyang",""],["Li","Yumeng",""],["Wang","Jia",""],["Zhao","Liang",""],["Sun","Jianjian",""],["Ge","Zheng",""],["Zhang","Xiangyu",""],["Jiang","Daxin",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 00:40:35 GMT"},{"version":"v2","created":"Sun, 26 Jan 2025 23:16:36 GMT"}],"updateDate":"2025-01-28","timestamp":1735519235000,"abstract":"  Recently, \"visual o1\" began to enter people's vision, with expectations that\nthis slow-thinking design can solve visual reasoning tasks, especially\ngeometric math problems. However, the reality is that current LVLMs (Large\nVision Language Models) can hardly even accurately copy a geometric figure, let\nalone truly understand the complex inherent logic and spatial relationships\nwithin geometric shapes. We believe accurate copying (strong perception) is the\nfirst step to visual o1. Accordingly, we introduce the concept of \"slow\nperception\" (SP), which guides the model to gradually perceive basic point-line\ncombinations, as our humans, reconstruct complex geometric structures\nprogressively. There are two-fold stages in SP: a) perception decomposition.\nPerception is not instantaneous. In this stage, complex geometric figures are\nbroken down into basic simple units to unify geometry representation. b)\nperception flow, which acknowledges that accurately tracing a line is not an\neasy task. This stage aims to avoid \"long visual jumps\" in regressing line\nsegments by using a proposed \"perceptual ruler\" to trace each line\nstroke-by-stroke. Surprisingly, such a human-like perception manner enjoys an\ninference time scaling law -- the slower, the better. Researchers strive to\nspeed up the model's perception in the past, but we slow it down again,\nallowing the model to read the image step-by-step and carefully.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"LUMMGhCAR7M6g8wHkgr78BrOv-ea7c-HBSneG8HUXr8","pdfSize":"1061474"}