{"id":"2412.14659","title":"Influence of ICME-driven Magnetic Cloud-like and Sheath Region induced\n  Geomagnetic Storms in causing anomalous responses of the Low-latitude\n  Ionosphere: A Case Study","authors":"Sumanjit Chakraborty, Dibyendu Chakrabarty, Anil K. Yadav, Gopi K.\n  Seemala","authorsParsed":[["Chakraborty","Sumanjit",""],["Chakrabarty","Dibyendu",""],["Yadav","Anil K.",""],["Seemala","Gopi K.",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 09:09:46 GMT"}],"updateDate":"2024-12-20","timestamp":1734599386000,"abstract":"  This work shows an anomalously enhanced response of the low-latitude\nionosphere over the Indian sector under weak geomagnetic conditions (October\n31, 2021) in comparison to a stronger event (November 04, 2021) under the\ninfluence of an Interplanetary Coronal Mass Ejection (ICME)-driven Magnetic\nCloud (MC)-like and sheath regions respectively. The investigation is based on\nmeasurements of the Total Electron Content (TEC) from Ahmedabad\n(23.06$^\\circ$N, 72.54$^\\circ$E, geographic; dip angle: 35.20$^\\circ$), a\nlocation near the northern crest of the Equatorial Ionization Anomaly (EIA)\nover the Indian region. During the weaker event, the observed TEC from the\nGeostationary Earth Orbit (GEO) satellites of Navigation with Indian\nConstellation (NavIC), showed diurnal maximum enhancements of about 20 TECU\nover quiet-time variations, as compared to the stronger event where no such\nenhancements are present. It is shown that storm intensity (SYM-H) or magnitude\nof the southward Interplanetary Magnetic Field (IMF) alone is unable to\ndetermine the ionospheric impacts of this space weather event. However, it is\nthe non-fluctuating southward IMF and the corresponding penetration electric\nfields, for a sufficient interval of time, in tandem with the poleward neutral\nwind variations, that determines the strengthening of low-latitude\nelectrodynamics of this anomalous event of October 31, 2021. Therefore, the\npresent investigation highlights a case for further investigations of the\nimportant roles played by non-fluctuating penetration electric fields in\ndetermining a higher response of the low-latitude ionosphere even if the\ngeomagnetic storm intensities are significantly low.\n","subjects":["Physics/Space Physics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics","Physics/Atmospheric and Oceanic Physics","Physics/Geophysics","Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iKcNGOUXEiBmi_N3n4In_l4Hscj1p2xSUEzAlqGa-s4","pdfSize":"2989846"}