{"id":"2412.07848","title":"Diffeomorphism Invariance Breaking in Gravity and Cosmological Evolution","authors":"Ufuk Aydemir and Mahmut Elbistan","authorsParsed":[["Aydemir","Ufuk",""],["Elbistan","Mahmut",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 19:00:12 GMT"},{"version":"v2","created":"Wed, 25 Dec 2024 13:47:06 GMT"}],"updateDate":"2024-12-30","timestamp":1733857212000,"abstract":"  Breaking diffeomorphism invariance has been motivated in the literature in\nseveral contexts, including emergent General Relativity (GR). For this to be an\nadmissible possibility, GR augmented with minor violations of general\ncovariance must yield only slight deviations from the outcomes of GR. In this\npaper, the cosmological evolution of the scale factor in gravity with\nexplicitly broken general covariance is investigated in the (modified)\nFriedmann-Lema\\^{\\i}tre-Robertson-Walker (FLRW) spacetime. The model augments\nthe GR Lagrangian with all of the diffeomorphism-breaking (but Lorentz\ninvariant) terms in the leading order, the terms involving two derivatives. The\nmagnitudes of (minor) violations are kept general modulo the conditions for a\nhealthy linearized version of the model. The analytic solutions of the scale\nfactor in the full non-linear theory for the single-component universes are\nattempted; the radiation and vacuum solutions are found analytically, whereas\nthe matter solution is worked out numerically since an analytic solution does\nnot exist in the required form. It is observed that the solutions smoothly\nconnect to those of GR in the limit of vanishing symmetry-breaking. The more\nrealistic, two-component, and three-component universes are numerically\nstudied, and no sign of unhealthy behavior is observed: minor diffeomorphism\nviolating modifications to GR do not cause instabilities in the evolution of\nthe scale factor.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BO1eIhmQp592vaGO-ICCnFx382CM90QuuKbPMh-lwnQ","pdfSize":"2520609"}