{
  "id": "2412.18787",
  "title": "Non-Fermi liquid transport and strong mass enhancement near the nematic\n  quantum critical point in FeSe$_x$Te$_{1-x}$ thin films",
  "authors": "Yuki Sato, Soma Nagahama, Ilya Belopolski, Ryutaro Yoshimi, Minoru\n  Kawamura, Atsushi Tsukazaki, Akiyoshi Yamada, Masashi Tokunaga, Naoya\n  Kanazawa, Kei S. Takahashi, Yoshichika Onuki, Masashi Kawasaki, and Yoshinori\n  Tokura",
  "authorsParsed": [
    [
      "Sato",
      "Yuki",
      ""
    ],
    [
      "Nagahama",
      "Soma",
      ""
    ],
    [
      "Belopolski",
      "Ilya",
      ""
    ],
    [
      "Yoshimi",
      "Ryutaro",
      ""
    ],
    [
      "Kawamura",
      "Minoru",
      ""
    ],
    [
      "Tsukazaki",
      "Atsushi",
      ""
    ],
    [
      "Yamada",
      "Akiyoshi",
      ""
    ],
    [
      "Tokunaga",
      "Masashi",
      ""
    ],
    [
      "Kanazawa",
      "Naoya",
      ""
    ],
    [
      "Takahashi",
      "Kei S.",
      ""
    ],
    [
      "Onuki",
      "Yoshichika",
      ""
    ],
    [
      "Kawasaki",
      "Masashi",
      ""
    ],
    [
      "Tokura",
      "Yoshinori",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 05:39:36 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 17 Jan 2025 01:06:48 GMT"
    }
  ],
  "updateDate": "2025-01-20",
  "timestamp": 1735105176000,
  "abstract": "  Unconventional superconductivity is often accompanied by non-Fermi liquid\n(NFL) behavior, which emerges near a quantum critical point (QCP) - a point\nwhere an electronic ordered phase is terminated at absolute zero under\nnon-thermal parameters. While nematic orders, characterized by broken\nrotational symmetry, are sometimes found in unconventional superconductors, the\nrole of nematic fluctuations in driving NFL transport behavior remains unclear.\nHere, we investigated electrical and thermoelectric transport properties in\nFeSe$_x$Te$_{1-x}$ thin films and observed hallmark NFL behavior:\ntemperature-linear resistivity and logarithmic divergence of thermoelectricity\nat low temperatures. Notably, the thermoelectricity peaks sharply at the\nnematic QCP ($x$ = 0.45), highlighting the dominant role of nematic\nfluctuations in the NFL transport. Furthermore, we found that the pair-breaking\nmechanisms in the superconducting phase crosses over from orbital- to\nPauli-limited effects, indicating the mass enhancement near the nematic\ncritical regime. These findings reveal the profound impact of nematic\nfluctuations on both normal-state transport and superconducting properties.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons",
    "Condensed Matter/Superconductivity"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "DKcfxjEw8WWC6M5y4_BDCfAP-FZFuznoDqqQib5ewSA",
  "pdfSize": "1784417"
}