{"id":"2412.06239","title":"Unseen Attack Detection in Software-Defined Networking Using a\n  BERT-Based Large Language Model","authors":"Mohammed N. Swileh (1), Shengli Zhang (1) ((1) College of Electronics\n  and Information Engineering, Shenzhen University, Shenzhen, China)","authorsParsed":[["Swileh","Mohammed N.",""],["Zhang","Shengli",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 06:27:20 GMT"}],"updateDate":"2024-12-10","timestamp":1733725640000,"abstract":"  Software defined networking (SDN) represents a transformative shift in\nnetwork architecture by decoupling the control plane from the data plane,\nenabling centralized and flexible management of network resources. However,\nthis architectural shift introduces significant security challenges, as SDN's\ncentralized control becomes an attractive target for various types of attacks.\nWhile current research has yielded valuable insights into attack detection in\nSDN, critical gaps remain. Addressing challenges in feature selection,\nbroadening the scope beyond DDoS attacks, strengthening attack decisions based\non multi flow analysis, and building models capable of detecting unseen attacks\nthat they have not been explicitly trained on are essential steps toward\nadvancing security in SDN. In this paper, we introduce a novel approach that\nleverages Natural Language Processing (NLP) and the pre trained BERT base model\nto enhance attack detection in SDN. Our approach transforms network flow data\ninto a format interpretable by language models, allowing BERT to capture\nintricate patterns and relationships within network traffic. By using Random\nForest for feature selection, we optimize model performance and reduce\ncomputational overhead, ensuring accurate detection. Attack decisions are made\nbased on several flows, providing stronger and more reliable detection of\nmalicious traffic. Furthermore, our approach is specifically designed to detect\npreviously unseen attacks, offering a solution for identifying threats that the\nmodel was not explicitly trained on. To rigorously evaluate our approach, we\nconducted experiments in two scenarios: one focused on detecting known attacks,\nachieving 99.96% accuracy, and another on detecting unseen attacks, where our\nmodel achieved 99.96% accuracy, demonstrating the robustness of our approach in\ndetecting evolving threats to improve the security of SDN networks.\n","subjects":["Computer Science/Cryptography and Security","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KRcx4qwdji9nHIpgJ7N5qtmvddhc4GuovcR89giAT3Y","pdfSize":"1169333"}