{
  "id": "2412.15852",
  "title": "Multi-phase HI clouds in the Small Magellanic Cloud halo",
  "authors": "F. Buckland-Willis, M.A. Miville-Deschenes, A. Marchal, J.R. Dawson,\n  H. Denes, E.M. Di Teodoro, J.M. Dickey, S.J. Gibson, I.P. Kemp, C. Lynn, Y.K.\n  Ma, N.M. McClure-Griffiths, C.E. Murray, N.M. Pingel, S. Stanimirovic, J. Th.\n  Van Loon",
  "authorsParsed": [
    [
      "Buckland-Willis",
      "F.",
      ""
    ],
    [
      "Miville-Deschenes",
      "M. A.",
      ""
    ],
    [
      "Marchal",
      "A.",
      ""
    ],
    [
      "Dawson",
      "J. R.",
      ""
    ],
    [
      "Denes",
      "H.",
      ""
    ],
    [
      "Di Teodoro",
      "E. M.",
      ""
    ],
    [
      "Dickey",
      "J. M.",
      ""
    ],
    [
      "Gibson",
      "S. J.",
      ""
    ],
    [
      "Kemp",
      "I. P.",
      ""
    ],
    [
      "Lynn",
      "C.",
      ""
    ],
    [
      "Ma",
      "Y. K.",
      ""
    ],
    [
      "McClure-Griffiths",
      "N. M.",
      ""
    ],
    [
      "Murray",
      "C. E.",
      ""
    ],
    [
      "Pingel",
      "N. M.",
      ""
    ],
    [
      "Stanimirovic",
      "S.",
      ""
    ],
    [
      "Van Loon",
      "J. Th.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 12:48:18 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734698898000,
  "abstract": "  Context. The Galactic ASKAP collaboration (GASKAP) is undertaking an HI\nemission survey of the 21cm line to map the Magellanic system and the Galactic\nplane with the Australian Square Kilometre Array Pathfinder (ASKAP). One of the\nfirst areas observed in the Pilot Phase I of the survey was the Small\nMagellanic Cloud (SMC). Previous surveys of the SMC have uncovered new\nstructures in the periphery of the SMC, along relatively low column density\nlines of sight. Aims. In this work we aimed to uncover the phase distribution\nof three distinct structures in the periphery of the SMC. This work will add to\nthe constraints we have on the existence and survival of the cold neutral\nmedium (CNM) in the SMC. Methods. We used ROHSA, a Gaussian decomposition\nalgorithm, to model the emission across each cloud and classify the HI emission\ninto their respective phases based on the linewidths of the fitted Gaussians.\nWe created maps of velocity and column density of each phase of the HI across\nthese three clouds. We measured the HI mass and CNM number density for each\ncloud. We also compared the HI results across the different phases with other\ngas tracers. Results. We find that in two clouds, the ends of each cloud are\nalmost completely CNM dominated. Analysis of these two clouds indicates they\nare experiencing a compressive force from the direction of the SMC main body.\nIn the third cloud we find a uniform CNM distribution along one wall of what is\nlikely a supershell structure. Comparison with previous measurements of CO\nclumps in two of the clouds show the CO and HI are co-moving within a few km/s\nin regions of high HI column density, particularly when considering just the\nCNM.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "A5_lbUj4rpmNEiqxTB7oBONCpaVI9D5GHn4Z_U9ymoY",
  "pdfSize": "2846037"
}