{
  "id": "2412.07004",
  "title": "Optimizing for a Near Single-Mode Type-0 Optical Parametric Amplifier in\n  Nanophotonics",
  "authors": "Shivam Mundhra, Elina Sendonaris, Robert M. Gray, James Williams,\n  Alireza Marandi",
  "authorsParsed": [
    [
      "Mundhra",
      "Shivam",
      ""
    ],
    [
      "Sendonaris",
      "Elina",
      ""
    ],
    [
      "Gray",
      "Robert M.",
      ""
    ],
    [
      "Williams",
      "James",
      ""
    ],
    [
      "Marandi",
      "Alireza",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 21:18:56 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 11 Dec 2024 02:23:03 GMT"
    },
    {
      "version": "v3",
      "created": "Mon, 6 Jan 2025 17:33:11 GMT"
    }
  ],
  "updateDate": "2025-01-07",
  "timestamp": 1733779136000,
  "abstract": "  Thin-film lithium niobate (TFLN) has recently emerged as a promising platform\nfor integrated nonlinear photonics, enabling the use of optical parametric\namplifiers (OPAs) for applications in quantum information processing, precision\nmetrology, and ultrafast optical signal processing. However, OPA waveguide\ndesigns have not yet achieved the phase-matching conditions for type-0\noperation in a single spectro-temporal mode, limiting their use. We optimize\nthe waveguide dimensions, poling pattern, pump wavelength, and pump pulse\nduration for high spectral purity, a metric for single-mode fidelity. We\nnumerically demonstrate a nanophotonic OPA with a spectral purity of 0.982 in a\nTFLN waveguide. Through semi-classical simulations, we further demonstrate that\nin the optical parametric regime, where vacuum fluctuations at the input of the\nOPA can saturate the gain and deplete the pump, the macroscopic output of such\na single-mode OPA can be utilized for an ultra-fast quantum random number\ngenerator. These results demonstrate a promising direction for integrated OPAs\nin a wide range of ultrafast quantum nanophotonics applications.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UP8Z0VhKpwHUIsUJmOHexr2zmSxV8Zx8S9kagtiUsKE",
  "pdfSize": "3637699"
}