{
  "id": "2412.16824",
  "title": "Ion-Scale Solitary Structures in the Solar Wind Observed by Solar\n  Orbiter and Parker Solar Probe",
  "authors": "Yufei Yang (Imperial College London, UK), Timothy S. Horbury (Imperial\n  College London, UK), Domenico Trotta (Imperial College London, UK, European\n  Space Agency (ESA), Paris, France), Lorenzo Matteini (Imperial College\n  London, UK), Joseph Wang (Imperial College London, UK), Andrey Fedorov\n  (Institut de Recherche en Astrophysique et Plan\\'etologie, CNRS, Universit\\'e\n  de Toulouse, CNES, Toulouse, France), Philippe Louarn (Institut de Recherche\n  en Astrophysique et Plan\\'etologie, CNRS, Universit\\'e de Toulouse, CNES,\n  Toulouse, France), Stuart Bale (Physics Department, University of California,\n  Berkeley, CA, USA, Space Sciences Laboratory, University of California,\n  Berkeley, CA, USA), Marc Pulupa (Space Sciences Laboratory, University of\n  California, Berkeley, USA), Davin E. Larson (Space Sciences Laboratory,\n  University of California, Berkeley, USA), Michael Stevens\n  (Harvard-Smithsonian Center for Astrophysics, Cambridge, MA, USA), Milan\n  Maksimovic (CNRS D\\'el\\'egation \\^Ile-de-France Ouest et Nord, Meudon,\n  France), Yuri Khotyaintsev (Swedish Institute of Space Physics, Uppsala,\n  Sweden), Andrea Larosa (Consiglio Nazionale delle Ricerche, Bari, Italy)",
  "authorsParsed": [
    [
      "Yang",
      "Yufei",
      "",
      "Imperial College London, UK"
    ],
    [
      "Horbury",
      "Timothy S.",
      "",
      "Imperial\n  College London, UK"
    ],
    [
      "Trotta",
      "Domenico",
      "",
      "Imperial College London, UK, European\n  Space Agency"
    ],
    [
      "Matteini",
      "Lorenzo",
      "",
      "Imperial College\n  London, UK"
    ],
    [
      "Wang",
      "Joseph",
      "",
      "Imperial College London, UK"
    ],
    [
      "Fedorov",
      "Andrey",
      "",
      "Institut de Recherche en Astrophysique et Planétologie, CNRS, Université\n  de Toulouse, CNES, Toulouse, France"
    ],
    [
      "Louarn",
      "Philippe",
      "",
      "Institut de Recherche\n  en Astrophysique et Planétologie, CNRS, Université de Toulouse, CNES,\n  Toulouse, France"
    ],
    [
      "Bale",
      "Stuart",
      "",
      "Physics Department, University of California,\n  Berkeley, CA, USA, Space Sciences Laboratory, University of California,\n  Berkeley, CA, USA"
    ],
    [
      "Pulupa",
      "Marc",
      "",
      "Space Sciences Laboratory, University of\n  California, Berkeley, USA"
    ],
    [
      "Larson",
      "Davin E.",
      "",
      "Space Sciences Laboratory,\n  University of California, Berkeley, USA"
    ],
    [
      "Stevens",
      "Michael",
      "",
      "Harvard-Smithsonian Center for Astrophysics, Cambridge, MA, USA"
    ],
    [
      "Maksimovic",
      "Milan",
      "",
      "CNRS Délégation Île-de-France Ouest et Nord, Meudon,\n  France"
    ],
    [
      "Khotyaintsev",
      "Yuri",
      "",
      "Swedish Institute of Space Physics, Uppsala,\n  Sweden"
    ],
    [
      "Larosa",
      "Andrea",
      "",
      "Consiglio Nazionale delle Ricerche, Bari, Italy"
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 02:06:22 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734833182000,
  "abstract": "  We investigate a class of ion-scale magnetic solitary structures in the solar\nwind, characterized by distinct magnetic field enhancements and bipolar\nrotations over spatial scales of several proton inertial lengths. Previously\ntentatively identified as Alfv\\'enic solitons, these structures are revisited\nusing high-resolution data from the Solar Orbiter and Parker Solar Probe\nmissions. Using a machine learning-based method, we identified nearly a\nthousand such structures, providing new insights into their evolution and\nphysical properties. Statistical analysis shows that these structures are more\nabundant closer to the Sun, with occurrence rates peaking around 30-40 solar\nradii and declining at greater distances, suggesting that they decay.\nHigh-cadence measurements reveal that these structures are predominantly found\nin low-beta environments, with consistent fluctuations in density, velocity,\nand magnetic field. Magnetic field enhancements are often accompanied by plasma\ndensity drops, which, under near pressure balance, limit field increases. This\nleads to small fractional field enhancements near the Sun (approximately 0.01\nat 20 solar radii), making detection challenging. Magnetic field variance\nanalysis indicates that these structures are primarily oblique to the local\nmagnetic field. Alfv\\'enic velocity-magnetic field correlations suggest that\nmost of these structures propagate sunward in the plasma frame, distinguishing\nthem from typical solar wind fluctuations. We compare these findings with\nprevious studies, discussing possible generation mechanisms and their\nimplications for the turbulent cascade in the near-Sun Alfv\\'enic solar wind.\nFurther high-resolution observations and simulations are needed to fully\nunderstand their origins and impacts.\n",
  "subjects": [
    "Physics/Space Physics",
    "Astrophysics/Solar and Stellar Astrophysics",
    "Physics/Plasma Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "3HCat7cN7GY-SWcvd8WrZn2VelzYPKDWA6l8_LvOQjA",
  "pdfSize": "2049096"
}