{
  "id": "2412.13216",
  "title": "On the Time-Frequency Localization Characteristics of the Delay-Doppler\n  Plane Orthogonal Pulse",
  "authors": "Akram Shafie, Jinhong Yuan, Nan Yang, and Hai Lin",
  "authorsParsed": [
    [
      "Shafie",
      "Akram",
      ""
    ],
    [
      "Yuan",
      "Jinhong",
      ""
    ],
    [
      "Yang",
      "Nan",
      ""
    ],
    [
      "Lin",
      "Hai",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 18:00:04 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734199204000,
  "abstract": "  In this work, we study the time-frequency (TF) localization characteristics\nof the prototype pulse of orthogonal delay-Doppler (DD) division multiplexing\nmodulation, namely, the DD plane orthogonal pulse (DDOP). The TF localization\ncharacteristics examine how concentrated or spread out the energy of a pulse is\nin the joint TF domain, the time domain (TD), and the frequency domain (FD). We\nfirst derive the TF localization metrics of the DDOP, including its TF area,\nits time and frequency dispersions, and its direction parameter. Based on these\nresults, we demonstrate that the DDOP exhibits a high energy spread in the TD,\nFD, and the joint TF domain, while adhering to the Heisenberg uncertainty\nprinciple. Thereafter, we discuss the potential advantages brought by the\nenergy spread of the DDOP, especially with regard to harnessing both time and\nfrequency diversities and enabling fine-resolution sensing. Subsequently, we\nexamine the relationships between the time and frequency dispersions of the\nDDOP and those of the envelope functions of DDOP's TD and FD representations,\npaving the way for simplified determination of the TF localization metrics for\nmore generalized variants of the DDOP and the pulses used in other DD domain\nmodulation schemes. Finally, using numerical results, we validate our analysis\nand find further insights.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UqgrwaEps8xPEBblY9NhuIboUPylv7t0rnytjVmXfNI",
  "pdfSize": "1357368"
}