{"id":"2412.00940","title":"Control of sphalerite-chalcopyrite phase transition in CdSnAs2 for\n  n-type thermoelectrics with high power factor","authors":"Shoki Kishida, Norihiko. L. Okamoto, Ryoji Katsube, Akira Nagaoka,\n  Yoshitaro Nose","authorsParsed":[["Kishida","Shoki",""],["Okamoto","Norihiko. L.",""],["Katsube","Ryoji",""],["Nagaoka","Akira",""],["Nose","Yoshitaro",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 19:11:12 GMT"}],"updateDate":"2024-12-03","timestamp":1733080272000,"abstract":"  Practical applications of thermoelectric (TE) materials are constrained by\nless developments of high-performance n-type materials compared to their p-type\ncounterparts. Chalcopyrite CdSnAs2 is a promising n-type semiconductor for\nthermoelectrics from its narrow bandgap around 0.2 eV and exceptionally high\nelectron mobility. In this study, we investigated the crystal growth,\nmicrostructure, and thermoelectric properties of CdSnAs2. Contrary to\nconventional theory of unidirectional melt growth, CdSnAs2 samples at higher\ncooling rates exhibited better crystallinity, while some cracks were observed\nin samples cooled more slowly. Thermal analyses clarified that a phase\ntransition from sphalerite to chalcopyrite occurred after solidification in the\ncase of slow cooling, leading to dislocations and cracks due to the lattice\nmismatch between phases. The analysis at rapid cooling suggested that\nsupercooling lowers the solidification temperature and produces an appropriate\nmicrostructure. Consequently, the sample grown at the highest cooling rate (7.6\nK/min) achieved an ultrahigh power factor of 3.18 mW/mK^2 at 600 K and a peak\nzT of 0.62 at 682 K. In the power factor, CdSnAs2 surpasses conventional binary\nn-type TE materials such as SnSe and PbTe, proving that CdSnAs2 is a high\npotential candidate for mid-temperature TE applications.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"yb1xF8FF3WN2Kywi0Rjp-QsPbehnh8SV4m9sgTEFuSI","pdfSize":"1375530"}