{
  "id": "2412.06205",
  "title": "Applying Machine Learning Tools for Urban Resilience Against Floods",
  "authors": "Mahla Ardebili Pour and Mohammad B. Ghiasi and Ali Karkehabadi",
  "authorsParsed": [
    [
      "Pour",
      "Mahla Ardebili",
      ""
    ],
    [
      "Ghiasi",
      "Mohammad B.",
      ""
    ],
    [
      "Karkehabadi",
      "Ali",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 04:56:33 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733720193000,
  "abstract": "  Floods are among the most prevalent and destructive natural disasters, often\nleading to severe social and economic impacts in urban areas due to the high\nconcentration of assets and population density. In Iran, particularly in\nTehran, recurring flood events underscore the urgent need for robust urban\nresilience strategies. This paper explores flood resilience models to identify\nthe most effective approach for District 6 in Tehran. Through an extensive\nliterature review, various resilience models were analyzed, with the Climate\nDisaster Resilience Index (CDRI) emerging as the most suitable model for this\ndistrict due to its comprehensive resilience dimensions: Physical, Social,\nEconomic, Organizational, and Natural Health resilience. Although the CDRI\nmodel provides a structured approach to resilience measurement, it remains a\nstatic model focused on spatial characteristics and lacks temporal\nadaptability. An extensive literature review enhances the CDRI model by\nintegrating data from 2013 to 2022 in three-year intervals and applying machine\nlearning techniques to predict resilience dimensions for 2025. This integration\nenables a dynamic resilience model that can accommodate temporal changes,\nproviding a more adaptable and data driven foundation for urban flood\nresilience planning. By employing artificial intelligence to reflect evolving\nurban conditions, this model offers valuable insights for policymakers and\nurban planners to enhance flood resilience in Tehrans critical District 6.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "_9S6vLvFx32PKEwLv0kg8PnFzytqYn9pfadJ_yDjWv8",
  "pdfSize": "595704"
}