{
  "id": "2412.01499",
  "title": "Quantum microwaves: stabilizing squeezed light by phase locking",
  "authors": "Lukas Danner, Florian H\\\"ohe, Ciprian Padurariu, Joachim Ankerhold and\n  Bj\\\"orn Kubala",
  "authorsParsed": [
    [
      "Danner",
      "Lukas",
      ""
    ],
    [
      "Höhe",
      "Florian",
      ""
    ],
    [
      "Padurariu",
      "Ciprian",
      ""
    ],
    [
      "Ankerhold",
      "Joachim",
      ""
    ],
    [
      "Kubala",
      "Björn",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 13:51:26 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733147486000,
  "abstract": "  Bright sources of quantum microwave light are an important building block for\nvarious quantum technological applications. Josephson junctions coupled to\nmicrowave cavities are a particularly versatile and simple source for\nmicrowaves with quantum characteristics, such as different types of squeezing.\nDue to the inherent nonlinearity of the system, a pure dc-voltage bias can lead\nto the emission of correlated pairs of photons into a stripline resonator.\nHowever, a drawback of this method is that it suffers from bias voltage noise,\nwhich disturbs the phase of the junction and consequently destroys the\ncoherence of the photons, severely limiting its applications. Here we describe\nhow adding a small ac reference signal either to the dc-bias or directly into\nthe cavity can stabilize the system and counteract the sensitivity to noise. We\nfirst consider the injection locking of a single-mode device, before turning to\nthe more technologically relevant locking of two-mode squeezed states, where\nphase locking preserves the entanglement between photons. Finally, we describe\nlocking by directly injecting a microwave into the cavity, which breaks the\nsymmetry of the squeezing ellipse. In all cases, locking can mitigate the\neffects of voltage noise, and enable the use of squeezed states in quantum\ntechnological applications.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "BBukAAI95MZkcXXFi75qYFWO8bomj6CtJZnjXWgohI0",
  "pdfSize": "4157570"
}