{
  "id": "2412.14935",
  "title": "Effective Method with Compression for Distributed and Federated\n  Cocoercive Variational Inequalities",
  "authors": "Daniil Medyakov, Gleb Molodtsov, Aleksandr Beznosikov",
  "authorsParsed": [
    [
      "Medyakov",
      "Daniil",
      ""
    ],
    [
      "Molodtsov",
      "Gleb",
      ""
    ],
    [
      "Beznosikov",
      "Aleksandr",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 15:11:52 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734621112000,
  "abstract": "  Variational inequalities as an effective tool for solving applied problems,\nincluding machine learning tasks, have been attracting more and more attention\nfrom researchers in recent years. The use of variational inequalities covers a\nwide range of areas - from reinforcement learning and generative models to\ntraditional applications in economics and game theory. At the same time, it is\nimpossible to imagine the modern world of machine learning without distributed\noptimization approaches that can significantly speed up the training process on\nlarge amounts of data. However, faced with the high costs of communication\nbetween devices in a computing network, the scientific community is striving to\ndevelop approaches that make computations cheap and stable. In this paper, we\ninvestigate the compression technique of transmitted information and its\napplication to the distributed variational inequalities problem. In particular,\nwe present a method based on advanced techniques originally developed for\nminimization problems. For the new method, we provide an exhaustive theoretical\nconvergence analysis for cocoersive strongly monotone variational inequalities.\nWe conduct experiments that emphasize the high performance of the presented\ntechnique and confirm its practical applicability.\n",
  "subjects": [
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jjcsu1fBg9onyqq3UVxJM0Kz8lct9cb5hlqgseFTOz4",
  "pdfSize": "515448"
}