{"id":"2412.15936","title":"Constraining neutron star properties through parity-violating electron\n  scattering experiments and relativistic point coupling interactions","authors":"P.S. Koliogiannis, E. Yuksel, N. Paar","authorsParsed":[["Koliogiannis","P. S.",""],["Yuksel","E.",""],["Paar","N.",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 14:29:22 GMT"}],"updateDate":"2024-12-23","timestamp":1734704962000,"abstract":"  Parity-violating electron scattering experiments on $\\rm ^{48}Ca$ (CREX) and\n$\\rm ^{208}Pb$ (PREX-II) offer valuable insight into the isovector properties\nof finite nuclei, providing constraints for the density dependence of the\nnuclear equation of state, which is crucial for understanding astrophysical\nphenomena. In this work, we establish functional dependencies between the\nproperties of finite nuclei - such as weak charge form factors and neutron skin\nthickness - and the bulk properties of neutron stars, including tidal\ndeformability from binary neutron star mergers and neutron star radii. The\ndependencies are formulated by introducing a family of $\\beta$-equilibrated\nequations of state based on relativistic energy density functionals with point\ncoupling interactions. The charge minus the weak form factors derived from CREX\nand PREX-II measurements, combined with the observational constraints on tidal\ndeformability from the GW170817 event, are used to constrain the symmetry\nenergy and neutron star radii. Notably, the energy density expanded up to the\nfourth order in symmetry energy yields larger radii compared to calculations\nlimited to the second order term. However, the results reveal a discrepancy\nbetween the constraints provided by the CREX and PREX-II experiments. For a\nmore quantitative assessment, higher precision parity-violating electron\nscattering data and neutron star observations are required.\n","subjects":["Physics/Nuclear Theory","Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics","Physics/Nuclear Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ElcCuPAU7vxe_YlAd0qx1LSugMj-etegiuRAZWrImDE","pdfSize":"1012213"}