{"id":"2412.02204","title":"Reverberation Mapping of Two Variable Active Galactic Nuclei: Probing\n  the Distinct Characteristics of the Inner and Outer Broad-line Regions","authors":"Hai-Cheng Feng, Sha-Sha Li, J. M. Bai, H. T. Liu, Kai-Xing Lu, Yu-Xuan\n  Pang, Mouyuan Sun, Jian-Guo Wang, Yerong Xu, Yang-Wei Zhang, Shuying Zhou","authorsParsed":[["Feng","Hai-Cheng",""],["Li","Sha-Sha",""],["Bai","J. M.",""],["Liu","H. T.",""],["Lu","Kai-Xing",""],["Pang","Yu-Xuan",""],["Sun","Mouyuan",""],["Wang","Jian-Guo",""],["Xu","Yerong",""],["Zhang","Yang-Wei",""],["Zhou","Shuying",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 06:45:35 GMT"}],"updateDate":"2024-12-04","timestamp":1733208335000,"abstract":"  Current reverberation mapping (RM) studies primarily focus on single emission\nlines, particularly the \\hb\\ line, which may not fully reveal the geometry and\nkinematic properties of the broad-line region (BLR). To overcome this\nlimitation, we conducted multiline RM observations on two highly variable\nactive galactic nuclei (AGNs), KUG 1141+371 and UGC 3374, using the Lijiang 2.4\nm telescope. Our goal was to investigate the detailed structure of different\nregions within the BLR. We measured the time lags of multiple broad emission\nlines (\\ha, \\hb, \\hg, \\hei, and \\heii) and found clear evidence of radial\nionization stratification in the BLRs of both AGNs. Velocity-resolved RM\nanalysis revealed distinct geometry and kinematics between the inner and outer\nregions of the BLRs. Assuming that velocity-resolved lags reflect the\nkinematics of BLR, our observations indicate that: (1) in KUG 1141+371, the\ninner BLR exhibits outflow signatures, while the outer region is consistent\nwith virialized motion; (2) in UGC 3374, the inner region displays virial\nmotion, while the outer region shows inflow. Furthermore, we detected\n``breathing\" behavior in the outer BLR regions of both AGN, while the inner BLR\nregions show ``anti-breathing\", which may be linked to intrinsic BLR\nproperties. We discuss these findings in the context of various BLR formation\nmodels, highlighting importance of long-term, multiline RM campaigns in\nunderstanding of BLR structure and evolution. Additionally, our results suggest\nthat the observed stratification in BLR geometry and kinematics may contribute\nto the scatter in black hole mass estimates and the rapid changes in\nvelocity-resolved RM signatures reported in recent studies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TDas2cPPWqRqHTTAJWxAQfqa0uYL9CkVjS0Rh1vv38M","pdfSize":"1630107"}