{"id":"2412.03262","title":"Difficulties of two exploding white dwarfs to account for type Ia\n  supernovae with bimodal nebular emission profiles","authors":"Jessica Braudo, Noam Soker (Technion, Israel)","authorsParsed":[["Braudo","Jessica","","Technion, Israel"],["Soker","Noam","","Technion, Israel"]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 12:07:33 GMT"},{"version":"v2","created":"Fri, 6 Dec 2024 14:42:36 GMT"}],"updateDate":"2024-12-09","timestamp":1733314053000,"abstract":"  We use a simple dynamical scheme to simulate the ejecta of type Ia supernova\n(SN Ia) scenarios with two exploding white dwarfs (WDs) and find that the\nvelocity distribution of the ejecta has difficulties accounting for bimodal\nemission line profiles with a large separation between the two emission peaks.\nThe essence of the dynamical code is in including the fact that the ejecta does\nnot leave the system instantaneously. We find that the final separation\nvelocity between the centers of masses of the two WDs' ejecta is ~80% of the\npre-explosion WDs' orbital velocity, i.e., we find separation velocities of\n4200-5400 km/s for two WDs of masses M1=M2=0.94 Mo. The lower separation\nvelocities we find challenge scenarios with two exploding WDs to explain\nbimodal emission line profiles with observed velocity separations of up to\n~7000 km/s. Only the mass in the ejecta of one WD with an explosion velocity\nlower than the separation velocity contributes to one peak of the bimodal\nprofile; this is the inner ejecta. We find the inner ejecta to be only <15% of\nthe ejecta mass in energetic explosions. Less energetic explosions yield higher\ninner mass but lower separation velocities. We encourage searching for\nalternative explanations of bimodal line profiles.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MUYn8WPQVQ_M_Vvktx4QutjyllIJSKwmKDiCtNMPrKk","pdfSize":"7965867"}