{"id":"2412.01628","title":"Near-Optimal Resilient Labeling Schemes","authors":"Keren Censor-Hillel and Einav Huberman","authorsParsed":[["Censor-Hillel","Keren",""],["Huberman","Einav",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 15:45:35 GMT"}],"updateDate":"2024-12-03","timestamp":1733154335000,"abstract":"  Labeling schemes are a prevalent paradigm in various computing settings. In\nsuch schemes, an oracle is given an input graph and produces a label for each\nof its nodes, enabling the labels to be used for various tasks. Fundamental\nexamples in distributed settings include distance labeling schemes, proof\nlabeling schemes, advice schemes, and more. This paper addresses the question\nof what happens in a labeling scheme if some labels are erased, e.g., due to\ncommunication loss with the oracle or hardware errors. We adapt the notion of\nresilient proof-labeling schemes of Fischer, Oshman, Shamir [OPODIS 2021] and\nconsider resiliency in general labeling schemes. A resilient labeling scheme\nconsists of two parts -- a transformation of any given labeling to a new one,\nexecuted by the oracle, and a distributed algorithm in which the nodes can\nrestore their original labels given the new ones, despite some label erasures.\n  Our contribution is a resilient labeling scheme that can handle $F$ such\nerasures. Given a labeling of $\\ell$ bits per node, it produces new labels with\nmultiplicative and additive overheads of $O(1)$ and $O(\\log(F))$, respectively.\nThe running time of the distributed reconstruction algorithm is $O(F+(\\ell\\cdot\nF)/\\log{n})$ in the \\textsf{Congest} model.\n  This improves upon what can be deduced from the work of Bick, Kol, and Oshman\n[SODA 2022], for non-constant values of $F$. It is not hard to show that the\nrunning time of our distributed algorithm is optimal, making our construction\nnear-optimal, up to the additive overhead in the label size.\n","subjects":["Computer Science/Data Structures and Algorithms","Computer Science/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"u_tgdK_Nk3pvBeMKDslUMoCUn-hxw0oFPDyEQuRkwmg","pdfSize":"963931"}