{
  "id": "2412.02739",
  "title": "Effective Field Theory and In-In Correlators",
  "authors": "Daniel Green and Guanhao Sun",
  "authorsParsed": [
    [
      "Green",
      "Daniel",
      ""
    ],
    [
      "Sun",
      "Guanhao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 19:00:00 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 27 Jan 2025 23:49:48 GMT"
    }
  ],
  "updateDate": "2025-01-29",
  "timestamp": 1733252400000,
  "abstract": "  The predictions of inflation are usually defined in terms of equal time in-in\ncorrelation functions in an accelerating cosmological background. These same\nobservables exist for quantum field theory in other spacetimes, including flat\nspace. In this paper, we will explore how the Wilsonian renormalization group\n(RG) and effective field theory (EFT) apply to these observables in both flat\nand de Sitter space. Specifically, we show that matching the short- and\nlong-distance calculations requires additional terms localized at the time of\nthe measurement that are not captured by the effective action of the EFT. These\nadditional terms only correct the local and semi-local terms in the EFT\ncorrelators. In flat space, we give an explicit demonstration by matching in-in\ncorrelators of light scalars interacting with a heavy field with the EFT\nresult. We then show how these additional terms arise generically via exact RG.\nWe also compare these explicit results in flat space with the corresponding\ntheory in de Sitter and show that the local terms typically redshift away. Our\nresults are closely related to momentum space entanglement that arises from\ntracing over short-wavelength modes.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory",
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Physics/High Energy Physics - Phenomenology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Y6V4UfwaaPV-1mVmZsuGONiWVtYYcYXn09p9Fe5qg9o",
  "pdfSize": "682936"
}