{"id":"2412.11253","title":"Are Expressive Models Truly Necessary for Offline RL?","authors":"Guan Wang, Haoyi Niu, Jianxiong Li, Li Jiang, Jianming Hu, Xianyuan\n  Zhan","authorsParsed":[["Wang","Guan",""],["Niu","Haoyi",""],["Li","Jianxiong",""],["Jiang","Li",""],["Hu","Jianming",""],["Zhan","Xianyuan",""]],"versions":[{"version":"v1","created":"Sun, 15 Dec 2024 17:33:56 GMT"}],"updateDate":"2024-12-17","timestamp":1734284036000,"abstract":"  Among various branches of offline reinforcement learning (RL) methods,\ngoal-conditioned supervised learning (GCSL) has gained increasing popularity as\nit formulates the offline RL problem as a sequential modeling task, therefore\nbypassing the notoriously difficult credit assignment challenge of value\nlearning in conventional RL paradigm. Sequential modeling, however, requires\ncapturing accurate dynamics across long horizons in trajectory data to ensure\nreasonable policy performance. To meet this requirement, leveraging large,\nexpressive models has become a popular choice in recent literature, which,\nhowever, comes at the cost of significantly increased computation and inference\nlatency. Contradictory yet promising, we reveal that lightweight models as\nsimple as shallow 2-layer MLPs, can also enjoy accurate dynamics consistency\nand significantly reduced sequential modeling errors against large expressive\nmodels by adopting a simple recursive planning scheme: recursively planning\ncoarse-grained future sub-goals based on current and target information, and\nthen executes the action with a goal-conditioned policy learned from data\nrela-beled with these sub-goal ground truths. We term our method Recursive\nSkip-Step Planning (RSP). Simple yet effective, RSP enjoys great efficiency\nimprovements thanks to its lightweight structure, and substantially outperforms\nexisting methods, reaching new SOTA performances on the D4RL benchmark,\nespecially in multi-stage long-horizon tasks.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ay1zI6pO5Uc2itZvqVOL91rQ3x20dNIRN0b5DBXqs7Q","pdfSize":"991348"}