{"id":"2412.07785","title":"Gold diamond Nanocomposites Efficiently Generate Hydrated Electrons upon\n  Absorption of Visible Light","authors":"Silvia Orlanducci, Giuseppe Ammirati, Alessandro Bellucci, Daniele\n  Catone, Lionel C. Gontard, Faustino Martelli, Roberto Matassa, Alessandra\n  Paladini, Francesco Toschi, Stefano Turchini, Patrick O'Keeffe","authorsParsed":[["Orlanducci","Silvia",""],["Ammirati","Giuseppe",""],["Bellucci","Alessandro",""],["Catone","Daniele",""],["Gontard","Lionel C.",""],["Martelli","Faustino",""],["Matassa","Roberto",""],["Paladini","Alessandra",""],["Toschi","Francesco",""],["Turchini","Stefano",""],["O'Keeffe","Patrick",""]],"versions":[{"version":"v1","created":"Mon, 25 Nov 2024 17:43:27 GMT"}],"updateDate":"2024-12-12","timestamp":1732556607000,"abstract":"  An efficient source of hydrated electrons generated by visible light has the\npotential to have a major impact on solar homogeneous catalysis. Diamond has\npotentially a high capability of emitting hydrated electrons, but only using\nultraviolet light (lambda<225 nm). In this work, we demonstrate the efficient\nabsorption of visible light by nanocomposites consisting of detonation\nnanodiamonds and gold nanoparticles (AuNP@DNDs), which subsequently emit\nelectrons into the aqueous environment in which they are suspended. This has\nbeen done by exciting the AuNP@DND with visible laser light and monitoring the\nappearance and intensity of the transient absorption of hydrated electrons\ncentered at around 720 nm. We suggest that this mechanism is made possible by\nthe plasmonic enhancement of visible absorption by sp2-hybridized islands on\nthe DND surface. Optimization of this process could lead to important\nbreakthroughs in solar photocatalysis of energy-intensive reactions such as N2\nand CO2 reduction as well as providing a non-toxic source of hydrated electrons\nfor applications in wastewater management and nanomedicine.\n","subjects":["Physics/Optics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lA7YhkS9VBd6GpvpMhqhccXwZKtfm8TvZz248-xug6o","pdfSize":"1680474"}