{"id":"2412.16099","title":"Engineering high-Q superconducting tantalum microwave coplanar waveguide\n  resonators for compact coherent quantum circuits","authors":"Shima Poorgholam-Khanjari, Valentino Seferai, Paniz Foshat, Calum\n  Rose, Hua Feng, Robert H. Hadfield, Martin Weides, and Kaveh Delfanazari","authorsParsed":[["Poorgholam-Khanjari","Shima",""],["Seferai","Valentino",""],["Foshat","Paniz",""],["Rose","Calum",""],["Feng","Hua",""],["Hadfield","Robert H.",""],["Weides","Martin",""],["Delfanazari","Kaveh",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 17:41:59 GMT"}],"updateDate":"2024-12-23","timestamp":1734716519000,"abstract":"  Tantalum (Ta) has recently received considerable attention in manufacturing\nrobust superconducting quantum circuits. Ta offers low microwave loss, high\nkinetic inductance compared to aluminium (Al) and niobium (Nb), and good\ncompatibility with complementary metal-oxide-semiconductor (CMOS) technology,\nwhich is essential for quantum computing applications. Here, we demonstrate the\nfabrication engineering of thickness-dependent high quality factor (high-Q_i)\nTa superconducting microwave coplanar waveguide resonators. All films are\ndeposited on high-resistivity silicon substrates at room temperature without\nadditional substrate heating. Before Ta deposition, a niobium (Nb) seed layer\nis used to ensure a body-centred cubic lattice ({\\alpha}-Ta) formation. We\nfurther engineer the kinetic inductance (L_K) resonators by varying Ta film\nthicknesses. High L_K is a key advantage for applications because it\nfacilitates the realisation of high-impedance, compact quantum circuits with\nenhanced coupling to qubits. The maximum internal quality factor Q_i of ~ 3.6 *\n10^6 is achieved at the high power regime for 100 nm Ta, while the highest\nkinetic inductance is obtained to be 0.6 pH/sq for the thinnest film, which is\n40 nm. This combination of high Q_i and high L_K highlights the potential of Ta\nmicrowave circuits for high-fidelity operations of compact quantum circuits.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Superconductivity","Computer Science/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hWvE3vg_4cT6k6cmQYL2-sg4LtB9aoti0AiuT6ksS2w","pdfSize":"1643152"}