{
  "id": "2412.00340",
  "title": "Theoretical Studies on Sodium Storage Mechanism in Hard Carbon Anodes of\n  Sodium-Ion Batteries: Molecular Simulations Based on Machine Learning Force\n  Fields",
  "authors": "Zhaoming Wang, Guanghui Shi, Guanghui Wang, Man Wang, Xiao Wang, Feng\n  Ding",
  "authorsParsed": [
    [
      "Wang",
      "Zhaoming",
      ""
    ],
    [
      "Shi",
      "Guanghui",
      ""
    ],
    [
      "Wang",
      "Guanghui",
      ""
    ],
    [
      "Wang",
      "Man",
      ""
    ],
    [
      "Wang",
      "Xiao",
      ""
    ],
    [
      "Ding",
      "Feng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 03:45:27 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 3 Dec 2024 06:20:19 GMT"
    },
    {
      "version": "v3",
      "created": "Wed, 4 Dec 2024 02:56:47 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1732938327000,
  "abstract": "  Sodium-ion batteries (SIBs) have garnered significant attention in recent\nyears as a promising alternative to lithium-ion batteries (LIBs) due to their\nlow cost, abundant sodium resources, and excellent cycling performance. Hard\ncarbon materials, characterized by their high specific capacity, outstanding\ncycling stability, and low cost, have emerged as potential candidates for SIB\nanodes. However, the sodium storage mechanism in hard carbon anodes remains\nhighly complex, especially in disordered structures, and is yet to be fully\nunderstood. To address this, we employed relative machine learning force fields\n(MLFFs) in conjunction with multiscale simulation techniques to systematically\ninvestigate the sodium storage behavior in hard carbon. By integrating\nsimulations, this study provides a detailed exploration of sodium adsorption,\nintercalation, and filling mechanisms. High-precision, large-scale simulations\nreveal the dynamic behavior and distribution patterns of sodium ions in hard\ncarbon. The findings not only deepen our understanding of sodium storage\nmechanisms in hard carbon anodes, but also offer a theoretical foundation for\noptimizing future SIB designs, while introducing novel simulation methodologies\nand technical frameworks to enhance battery performance.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "blDI6NnuMcQWaEDPvN3TwfPMFq5tXo6wZd1OqF_OEy0",
  "pdfSize": "1016353"
}