{"id":"2412.17238","title":"Modality-Aware Shot Relating and Comparing for Video Scene Detection","authors":"Jiawei Tan, Hongxing Wang, Kang Dang, Jiaxin Li, Zhilong Ou","authorsParsed":[["Tan","Jiawei",""],["Wang","Hongxing",""],["Dang","Kang",""],["Li","Jiaxin",""],["Ou","Zhilong",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 03:17:21 GMT"}],"updateDate":"2024-12-24","timestamp":1734923841000,"abstract":"  Video scene detection involves assessing whether each shot and its\nsurroundings belong to the same scene. Achieving this requires meticulously\ncorrelating multi-modal cues, $\\it{e.g.}$ visual entity and place modalities,\namong shots and comparing semantic changes around each shot. However, most\nmethods treat multi-modal semantics equally and do not examine contextual\ndifferences between the two sides of a shot, leading to sub-optimal detection\nperformance. In this paper, we propose the $\\bf{M}$odality-$\\bf{A}$ware\n$\\bf{S}$hot $\\bf{R}$elating and $\\bf{C}$omparing approach (MASRC), which\nenables relating shots per their own characteristics of visual entity and place\nmodalities, as well as comparing multi-shots similarities to have scene changes\nexplicitly encoded. Specifically, to fully harness the potential of visual\nentity and place modalities in modeling shot relations, we mine long-term shot\ncorrelations from entity semantics while simultaneously revealing short-term\nshot correlations from place semantics. In this way, we can learn distinctive\nshot features that consolidate coherence within scenes and amplify\ndistinguishability across scenes. Once equipped with distinctive shot features,\nwe further encode the relations between preceding and succeeding shots of each\ntarget shot by similarity convolution, aiding in the identification of scene\nending shots. We validate the broad applicability of the proposed components in\nMASRC. Extensive experimental results on public benchmark datasets demonstrate\nthat the proposed MASRC significantly advances video scene detection.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Multimedia"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"owlNUGyHw1p9sazBJCI1-xyHsxU1U_oJdk9AqhIDm8k","pdfSize":"2833394"}