{
  "id": "2412.05113",
  "title": "Enhancing fidelity in teleportation of a two-qubit state via a quantum\n  communication channel formed by spin-1/2 Ising-Heisenberg trimer chains due\n  to a magnetic field",
  "authors": "Jozef Strecka, Fadwa Benabdallah, Mohammed Daoud",
  "authorsParsed": [
    [
      "Strecka",
      "Jozef",
      ""
    ],
    [
      "Benabdallah",
      "Fadwa",
      ""
    ],
    [
      "Daoud",
      "Mohammed",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 15:14:19 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 9 Dec 2024 07:17:01 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733498059000,
  "abstract": "  We demonstrate that two independent spin-1/2 Ising-Heisenberg trimer chains\nprovide an effective platform for the quantum teleportation of any entangled\ntwo-qubit state through the quantum communication channel formed by two\nHeisenberg dimers. The reliability of this quantum channel is assessed by\ncomparing the concurrences, which quantify a strength of the bipartite\nentanglement of the initial input state and the readout output state.\nAdditionally, we rigorously calculate quantities fidelity and average fidelity\nto evaluate the quality of the teleportation protocol depending on temperature\nand magnetic field. It is evidenced that the efficiency of quantum\nteleportation of arbitrary entangled two-qubit state through this quantum\ncommunication channel can be significantly enhanced by moderate magnetic\nfields. This enhancement can be attributed to the magnetic-field-driven\ntransition from a quantum antiferromagnetic phase to a quantum ferrimagnetic\nphase, which supports realization of a fully entangled quantum channel suitable\nfor efficient quantum teleportation. The polymeric trimer chains Cu3(P2O6OH)2\nare proposed as an experimental resource of this quantum communication channel,\nwhich provides an efficient platform for realization of the quantum\nteleportation up to moderate temperatures 40 K and extremely high magnetic\nfields 80 T.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Condensed Matter/Statistical Mechanics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Ex60ts6gRjOU0Ae6m1FOH0f4N4zVufKoZozeoG42If0",
  "pdfSize": "6646421"
}