{
  "id": "2412.08646",
  "title": "StreamChat: Chatting with Streaming Video",
  "authors": "Jihao Liu, Zhiding Yu, Shiyi Lan, Shihao Wang, Rongyao Fang, Jan\n  Kautz, Hongsheng Li, Jose M. Alvare",
  "authorsParsed": [
    [
      "Liu",
      "Jihao",
      ""
    ],
    [
      "Yu",
      "Zhiding",
      ""
    ],
    [
      "Lan",
      "Shiyi",
      ""
    ],
    [
      "Wang",
      "Shihao",
      ""
    ],
    [
      "Fang",
      "Rongyao",
      ""
    ],
    [
      "Kautz",
      "Jan",
      ""
    ],
    [
      "Li",
      "Hongsheng",
      ""
    ],
    [
      "Alvare",
      "Jose M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 18:59:54 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733943594000,
  "abstract": "  This paper presents StreamChat, a novel approach that enhances the\ninteraction capabilities of Large Multimodal Models (LMMs) with streaming video\ncontent. In streaming interaction scenarios, existing methods rely solely on\nvisual information available at the moment a question is posed, resulting in\nsignificant delays as the model remains unaware of subsequent changes in the\nstreaming video. StreamChat addresses this limitation by innovatively updating\nthe visual context at each decoding step, ensuring that the model utilizes\nup-to-date video content throughout the decoding process. Additionally, we\nintroduce a flexible and efficient crossattention-based architecture to process\ndynamic streaming inputs while maintaining inference efficiency for streaming\ninteractions. Furthermore, we construct a new dense instruction dataset to\nfacilitate the training of streaming interaction models, complemented by a\nparallel 3D-RoPE mechanism that encodes the relative temporal information of\nvisual and text tokens. Experimental results demonstrate that StreamChat\nachieves competitive performance on established image and video benchmarks and\nexhibits superior capabilities in streaming interaction scenarios compared to\nstate-of-the-art video LMM.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "DcxDobbecbhNLjh1cW_MSVUghqr8CllUkLcCPTVUkTY",
  "pdfSize": "1750873"
}