{"id":"2412.16552","title":"Diffusion Prior Interpolation for Flexibility Real-World Face\n  Super-Resolution","authors":"Jiarui Yang, Tao Dai, Yufei Zhu, Naiqi Li, Jinmin Li, Shutao Xia","authorsParsed":[["Yang","Jiarui",""],["Dai","Tao",""],["Zhu","Yufei",""],["Li","Naiqi",""],["Li","Jinmin",""],["Xia","Shutao",""]],"versions":[{"version":"v1","created":"Sat, 21 Dec 2024 09:28:44 GMT"}],"updateDate":"2024-12-24","timestamp":1734773324000,"abstract":"  Diffusion models represent the state-of-the-art in generative modeling. Due\nto their high training costs, many works leverage pre-trained diffusion models'\npowerful representations for downstream tasks, such as face super-resolution\n(FSR), through fine-tuning or prior-based methods. However, relying solely on\npriors without supervised training makes it challenging to meet the pixel-level\naccuracy requirements of discrimination task. Although prior-based methods can\nachieve high fidelity and high-quality results, ensuring consistency remains a\nsignificant challenge. In this paper, we propose a masking strategy with strong\nand weak constraints and iterative refinement for real-world FSR, termed\nDiffusion Prior Interpolation (DPI). We introduce conditions and constraints on\nconsistency by masking different sampling stages based on the structural\ncharacteristics of the face. Furthermore, we propose a condition Corrector\n(CRT) to establish a reciprocal posterior sampling process, enhancing FSR\nperformance by mutual refinement of conditions and samples. DPI can balance\nconsistency and diversity and can be seamlessly integrated into pre-trained\nmodels. In extensive experiments conducted on synthetic and real datasets,\nalong with consistency validation in face recognition, DPI demonstrates\nsuperiority over SOTA FSR methods. The code is available at\n\\url{https://github.com/JerryYann/DPI}.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qYc1UZHEO9uB7BG_aFY1gQ_CNJKRl4ENarf0AIeAkBY","pdfSize":"6456441"}