{
  "id": "2412.20866",
  "title": "An Infrastructure for Systematically Collecting Smart Contract Lineages\n  for Analyses",
  "authors": "Fatou Ndiaye Mbodji, Vinny Adjibi, Gervais Mendy, Moustapha Awwalou\n  Diouf, Jacques Klein, and Tegawende Bissyande",
  "authorsParsed": [
    [
      "Mbodji",
      "Fatou Ndiaye",
      ""
    ],
    [
      "Adjibi",
      "Vinny",
      ""
    ],
    [
      "Mendy",
      "Gervais",
      ""
    ],
    [
      "Diouf",
      "Moustapha Awwalou",
      ""
    ],
    [
      "Klein",
      "Jacques",
      ""
    ],
    [
      "Bissyande",
      "Tegawende",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 11:10:22 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735557022000,
  "abstract": "  Tracking the evolution of smart contracts is a significant challenge,\nimpeding on the advancement of research on smart contract analysis. Indeed, due\nto the inherent immutability of the underlying blockchain technology, each\nsmart contract update results in a deployment at a new address, breaking the\nlinks between versions. Existing platforms like Etherscan lack the capability\nto trace the predecessor-successor relationships within a smart contract\nlineage, further hindering empirical research on contract evolution.\n  We address this challenge for the research community towards building a\nreliable dataset of linked versions for various smart contracts, i.e.,\nlineages: we introduce SCLineage, an automated infrastructure that accurately\nidentifies and collects smart contract lineages by leveraging proxy contracts.\nWe present SCLineageSet, an up-to-date, open-source dataset that facilitates\nextensive research on smart contract evolution. We illustrate the applicability\nof our proposal in software engineering research through a case study that\nexplores the evaluation of Locality-Sensitive Hashing (LSH) for forming\ncontract lineages. This example underscores how SCLineage provides valuable\ninsights for future research in the field.\n",
  "subjects": [
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "dzY3jmiAfsIHXOX6X1NQut4MEGNtnG_w_fqjj36ppBc",
  "pdfSize": "398582"
}