{"id":"2412.17025","title":"Amplifier-Enhanced Memristive Massive MIMO Linear Detector Circuit: An\n  Ultra-Energy-Efficient and Robust-to-Conductance-Error Design","authors":"Jia-Hui Bi, Shaoshi Yang, Ping Zhang, Sheng Chen","authorsParsed":[["Bi","Jia-Hui",""],["Yang","Shaoshi",""],["Zhang","Ping",""],["Chen","Sheng",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 14:03:51 GMT"}],"updateDate":"2024-12-24","timestamp":1734876231000,"abstract":"  The emerging analog matrix computing technology based on memristive crossbar\narray (MCA) constitutes a revolutionary new computational paradigm applicable\nto a wide range of domains. Despite the proven applicability of MCA for massive\nmultiple-input multiple-output (MIMO) detection, existing schemes do not take\ninto account the unique characteristics of massive MIMO channel matrix. This\noversight makes their computational accuracy highly sensitive to conductance\nerrors of memristive devices, which is unacceptable for massive MIMO receivers.\nIn this paper, we propose an MCA-based circuit design for massive MIMO zero\nforcing and minimum mean-square error detectors. Unlike the existing MCA-based\ndetectors, we decompose the channel matrix into the product of small-scale and\nlarge-scale fading coefficient matrices, thus employing an MCA-based matrix\ncomputing module and amplifier circuits to process the two matrices separately.\nWe present two conductance mapping schemes which are crucial but have been\noverlooked in all prior studies on MCA-based detector circuits. The proposed\ndetector circuit exhibits significantly superior performance to the\nconventional MCA-based detector circuit, while only incurring negligible\nadditional power consumption. Our proposed detector circuit maintains its\nadvantage in energy efficiency over traditional digital approach by tens to\nhundreds of times.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_sUITas6jie6Z_TnHXB_jNVLBk2enMzC5hAFG30RNNo","pdfSize":"1034273"}