{
  "id": "2412.02488",
  "title": "Room-temperature van der Waals magnetoresistive memories with data\n  writing by orbital current in the Weyl semimetal TaIrTe4",
  "authors": "Dong Li, Xing-Yu Liu, Zhen-Cun Pan, An-Qi Wang, Jiantian Zhang, Peng\n  Yu, Zhi-Min Liao",
  "authorsParsed": [
    [
      "Li",
      "Dong",
      ""
    ],
    [
      "Liu",
      "Xing-Yu",
      ""
    ],
    [
      "Pan",
      "Zhen-Cun",
      ""
    ],
    [
      "Wang",
      "An-Qi",
      ""
    ],
    [
      "Zhang",
      "Jiantian",
      ""
    ],
    [
      "Yu",
      "Peng",
      ""
    ],
    [
      "Liao",
      "Zhi-Min",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 14:57:05 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733237825000,
  "abstract": "  Current-induced out of plane magnetization has been utilized for field-free\nswitching of ferromagnets with perpendicular magnetic anisotropy. Identifying\nsystems capable of energy-efficiently converting charge currents into out of\nplane orbit- or spin-polarized currents is crucial for advancing magnetic\nmemory technologies. Here we introduce the Berry curvature dipole as a key\nevaluation factor, directly measurable through nonlinear Hall effects. In the\nWeyl semimetal TaIrTe4 used in our experiments, applying a current parallel to\nthe Berry curvature dipole results in out of plane orbital magnetization, which\ngoverns the field-free perpendicular magnetization switching in\nTaIrTe4/Fe3GaTe2 heterostructures. Notably, all-electric control of van der\nWaals magnetoresistive memory at room temperature has been achieved with a low\ncritical current density 2x10^6A/cm2 for data writing. Our findings reveal the\nconnection between nonlinear Hall effects and field-free magnetization\nswitching, highlighting the potential of the Berry curvature dipole in\nadvancing orbitronics.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "BnInVvCcTs5ndvL3jgshv4bi9jEugBxsTsrwS5DMuPw",
  "pdfSize": "3141569"
}