{"id":"2412.05642","title":"Deciphering Galactic Halos: A Detailed Review of Star Formation in NGC\n  5128 (Cen A)","authors":"Mahdi Abdollahi, Sima Taefi Aghdam, Atefeh Javadi, Seyed Azim Hashemi,\n  Jacco Th. van Loon, Habib Khosroshahi, Roya Hamedani Golshan, Elham Saremi,\n  Maryam Saberi","authorsParsed":[["Abdollahi","Mahdi",""],["Aghdam","Sima Taefi",""],["Javadi","Atefeh",""],["Hashemi","Seyed Azim",""],["van Loon","Jacco Th.",""],["Khosroshahi","Habib",""],["Golshan","Roya Hamedani",""],["Saremi","Elham",""],["Saberi","Maryam",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 12:54:00 GMT"}],"updateDate":"2024-12-10","timestamp":1733576040000,"abstract":"  NGC 5128 (Centaurus A), the closest giant elliptical galaxy outside the Local\nGroup to the Milky Way, is one of the brightest extragalactic radio sources. It\nis distinguished by a prominent dust lane and powerful jets, driven by a\nsupermassive black hole at its core. Using previously identified long-period\nvariable (LPV) stars from the literature, this study aims to reconstruct the\nstar formation history (SFH) of two distinct regions in the halo of NGC 5128.\nThese regions reveal remarkably similar SFHs, despite being located about 28\nkpc apart on opposite sides of the galaxy's center. In Field 1, star formation\nrates (SFRs) show notable increases at approximately 800 Myr and 3.8 Gyr ago.\nField 2 exhibits similar peaks at these times, along with an additional rise\naround 6.3 Gyr ago. The increase in SFR around 800 Myr ago is consistent with\nearlier research suggesting a merger event. Since no LPV catalog exists for the\ncentral region of NGC 5128, we focused our investigation on its outer regions,\nwhich has provided new insights into the complex evolutionary history of this\ncornerstone galaxy. The SFH traced by LPVs supports a scenario in which\nmultiple events of nuclear activity have triggered episodic, jet-induced star\nformation.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0wGFDr6IbdGl7wp2e-TCERUtQPON9SDOSpmemE4l4uY","pdfSize":"4114085"}