{"id":"2412.20674","title":"Blockchain-Empowered Cyber-Secure Federated Learning for Trustworthy\n  Edge Computing","authors":"Ervin Moore and Ahmed Imteaj and Md Zarif Hossain and Shabnam Rezapour\n  and M. Hadi Amini","authorsParsed":[["Moore","Ervin",""],["Imteaj","Ahmed",""],["Hossain","Md Zarif",""],["Rezapour","Shabnam",""],["Amini","M. Hadi",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 02:58:18 GMT"}],"updateDate":"2024-12-31","timestamp":1735527498000,"abstract":"  Federated Learning (FL) is a privacy-preserving distributed machine learning\nscheme, where each participant data remains on the participating devices and\nonly the local model generated utilizing the local computational power is\ntransmitted throughout the database. However, the distributed computational\nnature of FL creates the necessity to develop a mechanism that can remotely\ntrigger any network agents, track their activities, and prevent threats to the\noverall process posed by malicious participants. Particularly, the FL paradigm\nmay become vulnerable due to an active attack from the network participants,\ncalled a poisonous attack. In such an attack, the malicious participant acts as\na benign agent capable of affecting the global model quality by uploading an\nobfuscated poisoned local model update to the server. This paper presents a\ncross-device FL model that ensures trustworthiness, fairness, and authenticity\nin the underlying FL training process. We leverage trustworthiness by\nconstructing a reputation-based trust model based on contributions of agents\ntoward model convergence. We ensure fairness by identifying and removing\nmalicious agents from the training process through an outlier detection\ntechnique. Further, we establish authenticity by generating a token for each\nparticipating device through a distributed sensing mechanism and storing that\nunique token in a blockchain smart contract. Further, we insert the trust\nscores of all agents into a blockchain and validate their reputations using\nvarious consensus mechanisms that consider the computational task.\n","subjects":["Computer Science/Distributed, Parallel, and Cluster Computing","Computer Science/Cryptography and Security","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"viHuDc5De9Ria-OSuG1gnmEwIEb1xJV6mDYt-lg1Z44","pdfSize":"2084588"}