{"id":"2412.11124","title":"Combating Multimodal LLM Hallucination via Bottom-Up Holistic Reasoning","authors":"Shengqiong Wu, Hao Fei, Liangming Pan, William Yang Wang, Shuicheng\n  Yan, Tat-Seng Chua","authorsParsed":[["Wu","Shengqiong",""],["Fei","Hao",""],["Pan","Liangming",""],["Wang","William Yang",""],["Yan","Shuicheng",""],["Chua","Tat-Seng",""]],"versions":[{"version":"v1","created":"Sun, 15 Dec 2024 09:10:46 GMT"},{"version":"v2","created":"Sat, 21 Dec 2024 05:26:14 GMT"}],"updateDate":"2024-12-24","timestamp":1734253846000,"abstract":"  Recent advancements in multimodal large language models (MLLMs) have shown\nunprecedented capabilities in advancing various vision-language tasks. However,\nMLLMs face significant challenges with hallucinations, and misleading outputs\nthat do not align with the input data. While existing efforts are paid to\ncombat MLLM hallucinations, several pivotal challenges are still unsolved.\nFirst, while current approaches aggressively focus on addressing errors at the\nperception level, another important type at the cognition level requiring\nfactual commonsense can be overlooked. In addition, existing methods might fall\nshort in finding a more effective way to represent visual input, which is yet a\nkey bottleneck that triggers visual hallucinations. Moreover, MLLMs can\nfrequently be misled by faulty textual inputs and cause hallucinations, while\nunfortunately, this type of issue has long been overlooked by existing studies.\nInspired by human intuition in handling hallucinations, this paper introduces a\nnovel bottom-up reasoning framework. Our framework systematically addresses\npotential issues in both visual and textual inputs by verifying and integrating\nperception-level information with cognition-level commonsense knowledge,\nensuring more reliable outputs. Extensive experiments demonstrate significant\nimprovements in multiple hallucination benchmarks after integrating MLLMs with\nthe proposed framework. In-depth analyses reveal the great potential of our\nmethods in addressing perception- and cognition-level hallucinations.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"J1qHASZJgH7j4AyiqZSNAMflQtOjgmjMkLoRniND7vc","pdfSize":"920250"}