{
  "id": "2412.12039",
  "title": "Can LLM Prompting Serve as a Proxy for Static Analysis in Vulnerability\n  Detection",
  "authors": "Ira Ceka, Feitong Qiao, Anik Dey, Aastha Valecha, Gail Kaiser,\n  Baishakhi Ray",
  "authorsParsed": [
    [
      "Ceka",
      "Ira",
      ""
    ],
    [
      "Qiao",
      "Feitong",
      ""
    ],
    [
      "Dey",
      "Anik",
      ""
    ],
    [
      "Valecha",
      "Aastha",
      ""
    ],
    [
      "Kaiser",
      "Gail",
      ""
    ],
    [
      "Ray",
      "Baishakhi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 18:08:14 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 18 Jan 2025 01:19:05 GMT"
    }
  ],
  "updateDate": "2025-01-22",
  "timestamp": 1734372494000,
  "abstract": "  Despite their remarkable success, large language models (LLMs) have shown\nlimited ability on applied tasks such as vulnerability detection. We\ninvestigate various prompting strategies for vulnerability detection and, as\npart of this exploration, propose a prompting strategy that integrates natural\nlanguage descriptions of vulnerabilities with a contrastive chain-of-thought\nreasoning approach, augmented using contrastive samples from a synthetic\ndataset. Our study highlights the potential of LLMs to detect vulnerabilities\nby integrating natural language descriptions, contrastive reasoning, and\nsynthetic examples into a comprehensive prompting framework. Our results show\nthat this approach can enhance LLM understanding of vulnerabilities. On a\nhigh-quality vulnerability detection dataset such as SVEN, our prompting\nstrategies can improve accuracies, F1-scores, and pairwise accuracies by 23%,\n11%, and 14%, respectively.\n",
  "subjects": [
    "Computer Science/Cryptography and Security",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language",
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "e5WSGekswy15QOVWvQCWoP6ak67npvYCScsRVT3QceE",
  "pdfSize": "937767"
}