{"id":"2412.16615","title":"Large Language Model Can Be a Foundation for Hidden Rationale-Based\n  Retrieval","authors":"Luo Ji, Feixiang Guo, Teng Chen, Qingqing Gu, Xiaoyu Wang, Ningyuan\n  Xi, Yihong Wang, Peng Yu, Yue Zhao, Hongyang Lei, Zhonglin Jiang, Yong Chen","authorsParsed":[["Ji","Luo",""],["Guo","Feixiang",""],["Chen","Teng",""],["Gu","Qingqing",""],["Wang","Xiaoyu",""],["Xi","Ningyuan",""],["Wang","Yihong",""],["Yu","Peng",""],["Zhao","Yue",""],["Lei","Hongyang",""],["Jiang","Zhonglin",""],["Chen","Yong",""]],"versions":[{"version":"v1","created":"Sat, 21 Dec 2024 13:19:15 GMT"}],"updateDate":"2024-12-24","timestamp":1734787155000,"abstract":"  Despite the recent advancement in Retrieval-Augmented Generation (RAG)\nsystems, most retrieval methodologies are often developed for factual\nretrieval, which assumes query and positive documents are semantically similar.\nIn this paper, we instead propose and study a more challenging type of\nretrieval task, called hidden rationale retrieval, in which query and document\nare not similar but can be inferred by reasoning chains, logic relationships,\nor empirical experiences. To address such problems, an instruction-tuned Large\nlanguage model (LLM) with a cross-encoder architecture could be a reasonable\nchoice. To further strengthen pioneering LLM-based retrievers, we design a\nspecial instruction that transforms the retrieval task into a generative task\nby prompting LLM to answer a binary-choice question. The model can be\nfine-tuned with direct preference optimization (DPO). The framework is also\noptimized for computational efficiency with no performance degradation. We name\nthis retrieval framework by RaHoRe and verify its zero-shot and fine-tuned\nperformance superiority on Emotional Support Conversation (ESC), compared with\nprevious retrieval works. Our study suggests the potential to employ LLM as a\nfoundation for a wider scope of retrieval tasks. Our codes, models, and\ndatasets are available on https://github.com/flyfree5/LaHoRe.\n","subjects":["Computer Science/Information Retrieval","Computer Science/Computation and Language","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"EwhfewJMN3cbuhf49zTgQkGS7aW98IHhXQXCiZucveg","pdfSize":"559640"}