{"id":"2412.16738","title":"KKANs: Kurkova-Kolmogorov-Arnold Networks and Their Learning Dynamics","authors":"Juan Diego Toscano, Li-Lian Wang, George Em Karniadakis","authorsParsed":[["Toscano","Juan Diego",""],["Wang","Li-Lian",""],["Karniadakis","George Em",""]],"versions":[{"version":"v1","created":"Sat, 21 Dec 2024 19:01:38 GMT"}],"updateDate":"2024-12-24","timestamp":1734807698000,"abstract":"  Inspired by the Kolmogorov-Arnold representation theorem and Kurkova's\nprinciple of using approximate representations, we propose the\nKurkova-Kolmogorov-Arnold Network (KKAN), a new two-block architecture that\ncombines robust multi-layer perceptron (MLP) based inner functions with\nflexible linear combinations of basis functions as outer functions. We first\nprove that KKAN is a universal approximator, and then we demonstrate its\nversatility across scientific machine-learning applications, including function\nregression, physics-informed machine learning (PIML), and operator-learning\nframeworks. The benchmark results show that KKANs outperform MLPs and the\noriginal Kolmogorov-Arnold Networks (KANs) in function approximation and\noperator learning tasks and achieve performance comparable to fully optimized\nMLPs for PIML. To better understand the behavior of the new representation\nmodels, we analyze their geometric complexity and learning dynamics using\ninformation bottleneck theory, identifying three universal learning stages,\nfitting, transition, and diffusion, across all types of architectures. We find\na strong correlation between geometric complexity and signal-to-noise ratio\n(SNR), with optimal generalization achieved during the diffusion stage.\nAdditionally, we propose self-scaled residual-based attention weights to\nmaintain high SNR dynamically, ensuring uniform convergence and prolonged\nlearning.\n","subjects":["Computer Science/Machine Learning","Computer Science/Numerical Analysis","Mathematics/Numerical Analysis","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"T1LfjBWSUPt6woahFDkEE9-Qcm7hUAlSkbUBBBJEm-4","pdfSize":"11765149"}