{"id":"2412.01333","title":"Can Large Language Models Serve as Evaluators for Code Summarization?","authors":"Yang Wu, Yao Wan, Zhaoyang Chu, Wenting Zhao, Ye Liu, Hongyu Zhang,\n  Xuanhua Shi, Philip S. Yu","authorsParsed":[["Wu","Yang",""],["Wan","Yao",""],["Chu","Zhaoyang",""],["Zhao","Wenting",""],["Liu","Ye",""],["Zhang","Hongyu",""],["Shi","Xuanhua",""],["Yu","Philip S.",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 09:56:18 GMT"}],"updateDate":"2024-12-03","timestamp":1733133378000,"abstract":"  Code summarization facilitates program comprehension and software maintenance\nby converting code snippets into natural-language descriptions. Over the years,\nnumerous methods have been developed for this task, but a key challenge\nremains: effectively evaluating the quality of generated summaries. While human\nevaluation is effective for assessing code summary quality, it is\nlabor-intensive and difficult to scale. Commonly used automatic metrics, such\nas BLEU, ROUGE-L, METEOR, and BERTScore, often fail to align closely with human\njudgments. In this paper, we explore the potential of Large Language Models\n(LLMs) for evaluating code summarization. We propose CODERPE (Role-Player for\nCode Summarization Evaluation), a novel method that leverages role-player\nprompting to assess the quality of generated summaries. Specifically, we prompt\nan LLM agent to play diverse roles, such as code reviewer, code author, code\neditor, and system analyst. Each role evaluates the quality of code summaries\nacross key dimensions, including coherence, consistency, fluency, and\nrelevance. We further explore the robustness of LLMs as evaluators by employing\nvarious prompting strategies, including chain-of-thought reasoning, in-context\nlearning, and tailored rating form designs. The results demonstrate that LLMs\nserve as effective evaluators for code summarization methods. Notably, our\nLLM-based evaluator, CODERPE , achieves an 81.59% Spearman correlation with\nhuman evaluations, outperforming the existing BERTScore metric by 17.27%.\n","subjects":["Computer Science/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"y8uRmWADzzpusvIA2DUnPVdRXkEQYM2E8QP0iJxQDSo","pdfSize":"957508"}