{"id":"2412.10694","title":"Grasp What You Want: Embodied Dexterous Grasping System Driven by Your\n  Voice","authors":"Junliang Li, Kai Ye, Haolan Kang, Mingxuan Liang, Yuhang Wu, Zhenhua\n  Liu, Huiping Zhuang, Rui Huang, Yongquan Chen","authorsParsed":[["Li","Junliang",""],["Ye","Kai",""],["Kang","Haolan",""],["Liang","Mingxuan",""],["Wu","Yuhang",""],["Liu","Zhenhua",""],["Zhuang","Huiping",""],["Huang","Rui",""],["Chen","Yongquan",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 05:54:32 GMT"}],"updateDate":"2024-12-17","timestamp":1734155672000,"abstract":"  In recent years, as robotics has advanced, human-robot collaboration has\ngained increasing importance. However, current robots struggle to fully and\naccurately interpret human intentions from voice commands alone. Traditional\ngripper and suction systems often fail to interact naturally with humans, lack\nadvanced manipulation capabilities, and are not adaptable to diverse tasks,\nespecially in unstructured environments. This paper introduces the Embodied\nDexterous Grasping System (EDGS), designed to tackle object grasping in\ncluttered environments for human-robot interaction. We propose a novel approach\nto semantic-object alignment using a Vision-Language Model (VLM) that fuses\nvoice commands and visual information, significantly enhancing the alignment of\nmulti-dimensional attributes of target objects in complex scenarios. Inspired\nby human hand-object interactions, we develop a robust, precise, and efficient\ngrasping strategy, incorporating principles like the thumb-object axis,\nmulti-finger wrapping, and fingertip interaction with an object's contact\nmechanics. We also design experiments to assess Referring Expression\nRepresentation Enrichment (RERE) in referring expression segmentation,\ndemonstrating that our system accurately detects and matches referring\nexpressions. Extensive experiments confirm that EDGS can effectively handle\ncomplex grasping tasks, achieving stability and high success rates,\nhighlighting its potential for further development in the field of Embodied AI.\n","subjects":["Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Jn58iC2eC9Ma4JZiZneFta3kVCO8vdXFXHYNirGgD0E","pdfSize":"34619257"}