{"id":"2412.20924","title":"HisynSeg: Weakly-Supervised Histopathological Image Segmentation via\n  Image-Mixing Synthesis and Consistency Regularization","authors":"Zijie Fang, Yifeng Wang, Peizhang Xie, Zhi Wang, Yongbing Zhang","authorsParsed":[["Fang","Zijie",""],["Wang","Yifeng",""],["Xie","Peizhang",""],["Wang","Zhi",""],["Zhang","Yongbing",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 13:10:48 GMT"}],"updateDate":"2024-12-31","timestamp":1735564248000,"abstract":"  Tissue semantic segmentation is one of the key tasks in computational\npathology. To avoid the expensive and laborious acquisition of pixel-level\nannotations, a wide range of studies attempt to adopt the class activation map\n(CAM), a weakly-supervised learning scheme, to achieve pixel-level tissue\nsegmentation. However, CAM-based methods are prone to suffer from\nunder-activation and over-activation issues, leading to poor segmentation\nperformance. To address this problem, we propose a novel weakly-supervised\nsemantic segmentation framework for histopathological images based on\nimage-mixing synthesis and consistency regularization, dubbed HisynSeg.\nSpecifically, synthesized histopathological images with pixel-level masks are\ngenerated for fully-supervised model training, where two synthesis strategies\nare proposed based on Mosaic transformation and B\\'ezier mask generation.\nBesides, an image filtering module is developed to guarantee the authenticity\nof the synthesized images. In order to further avoid the model overfitting to\nthe occasional synthesis artifacts, we additionally propose a novel\nself-supervised consistency regularization, which enables the real images\nwithout segmentation masks to supervise the training of the segmentation model.\nBy integrating the proposed techniques, the HisynSeg framework successfully\ntransforms the weakly-supervised semantic segmentation problem into a\nfully-supervised one, greatly improving the segmentation accuracy. Experimental\nresults on three datasets prove that the proposed method achieves a\nstate-of-the-art performance. Code is available at\nhttps://github.com/Vison307/HisynSeg.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"l4x6bzRSis06tG9s1fvRabvFsaf1KJY5nVRbqvjVIn0","pdfSize":"19232772"}