{
  "id": "2412.20657",
  "title": "Diffgrasp: Whole-Body Grasping Synthesis Guided by Object Motion Using a\n  Diffusion Model",
  "authors": "Yonghao Zhang, Qiang He, Yanguang Wan, Yinda Zhang, Xiaoming Deng,\n  Cuixia Ma, Hongan Wang",
  "authorsParsed": [
    [
      "Zhang",
      "Yonghao",
      ""
    ],
    [
      "He",
      "Qiang",
      ""
    ],
    [
      "Wan",
      "Yanguang",
      ""
    ],
    [
      "Zhang",
      "Yinda",
      ""
    ],
    [
      "Deng",
      "Xiaoming",
      ""
    ],
    [
      "Ma",
      "Cuixia",
      ""
    ],
    [
      "Wang",
      "Hongan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 02:21:43 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735525303000,
  "abstract": "  Generating high-quality whole-body human object interaction motion sequences\nis becoming increasingly important in various fields such as animation, VR/AR,\nand robotics. The main challenge of this task lies in determining the level of\ninvolvement of each hand given the complex shapes of objects in different sizes\nand their different motion trajectories, while ensuring strong grasping realism\nand guaranteeing the coordination of movement in all body parts. Contrasting\nwith existing work, which either generates human interaction motion sequences\nwithout detailed hand grasping poses or only models a static grasping pose, we\npropose a simple yet effective framework that jointly models the relationship\nbetween the body, hands, and the given object motion sequences within a single\ndiffusion model. To guide our network in perceiving the object's spatial\nposition and learning more natural grasping poses, we introduce novel\ncontact-aware losses and incorporate a data-driven, carefully designed\nguidance. Experimental results demonstrate that our approach outperforms the\nstate-of-the-art method and generates plausible whole-body motion sequences.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "KeRwT1sDr8yqU3t33pRvCxr94hMErRcZTFF7IgI0SEA",
  "pdfSize": "35158885"
}