{
  "id": "2412.03917",
  "title": "Observational Properties of 155 $\\beta$ Cephei pulsating variable stars",
  "authors": "Xiang-dong Shi, Sheng-bang Qian, Li-ying Zhu, Lin-jia Li, Er-gang\n  Zhao, Wen-xu Lin",
  "authorsParsed": [
    [
      "Shi",
      "Xiang-dong",
      ""
    ],
    [
      "Qian",
      "Sheng-bang",
      ""
    ],
    [
      "Zhu",
      "Li-ying",
      ""
    ],
    [
      "Li",
      "Lin-jia",
      ""
    ],
    [
      "Zhao",
      "Er-gang",
      ""
    ],
    [
      "Lin",
      "Wen-xu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 06:42:23 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733380943000,
  "abstract": "  $\\beta$ Cephei pulsating variable (BCEP) stars are the most massive pulsating\nvariable stars in the main sequence, exhibiting both p- and g-mode pulsations.\nIn this study, we identified 155 BCEP stars or candidates using data from TESS\nand Gaia, of which 83 were first confirmed as BCEP stars. They have visual\nmagnitudes ranging from 8 to 12 mag and effective temperatures between\napproximately 20,000 and 30,000 K, while the parallaxes of most targets are\nbetween 0.2 and 0.6 mas. The study indicates that these BCEP stars have\npulsation periods ranging from 0.06 to 0.31 days, with amplitudes ranging from\n0.1 to 55.8 mmag in the TESS band. Additionally, the number of BCEP stars\nincreases as the pulsation amplitude decreases. These targets align with the\ndistribution region of BCEP stars in the luminosity-period (L-P) and\ntemperature-period (T-P) diagrams. We have updated the L-P relation of BCEP\nstars. The Hertzsprung-Russell (H-R) diagram indicates that these targets are\nin the main-sequence evolutionary phase, with masses ranging from 7 to 20\n$M_{\\odot}$ and luminosities between 2800 and 71,000 $L_{\\odot}$. They are\nalmost in the theoretical instability region of BCEP stars but as previously\nreported, this region at the low-mass end (red) is not filled. The distribution\nof the pulsation constant indicates that the dominant pulsation periods of BCEP\nstars consist mainly of low-order p-mode pulsations with a high proportion of\nradial fundamental modes. These BCEP stars are excellent objects for enhancing\nour understanding of the structure and evolution of massive stars through\nasteroseismology.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "cmpi3jwmKrzAuVhwoa3BGw5LkwnqPuSizkU4_sSiJ5o",
  "pdfSize": "8021235"
}