{
  "id": "2412.11623",
  "title": "Interaction-induced phase transitions and critical phases in\n  nonreciprocal non-Hermitian quasicrystals",
  "authors": "Yalun Zhang and Longwen Zhou",
  "authorsParsed": [
    [
      "Zhang",
      "Yalun",
      ""
    ],
    [
      "Zhou",
      "Longwen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 10:09:33 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 19 Dec 2024 02:36:34 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734343773000,
  "abstract": "  Non-Hermitian phenomena, such as exceptional points, non-Hermitian skin\neffects, and topologically nontrivial phases, have attracted continued\nattention. In this work, we reveal how interactions and nonreciprocal hopping\ncould collectively influence the behavior of two interacting bosons on\nquasiperiodic lattices. Focusing on the Bose-Hubbard model with\nAubry-Andr\\'e-Harper quasiperiodic modulations and hopping asymmetry, we\ndiscover that the interaction could enlarge the localization transition point\nof the noninteracting system into a critical phase, in which localized doublons\nformed by bosonic pairs can coexist with delocalized states. Under the open\nboundary condition, the bosonic doublons could further show non-Hermitian skin\neffects, realizing doublon condensation at the edges, and their direction of\nskin-localization can be flexibly tuned by the hopping parameters. A framework\nis developed to characterize the spectral, localization, and topological\ntransitions accompanying these phenomena. Our work advances the understanding\nof localization and topological phases in non-Hermitian systems, particularly\nin relation to multiparticle interactions.\n",
  "subjects": [
    "Condensed Matter/Disordered Systems and Neural Networks",
    "Condensed Matter/Quantum Gases",
    "Condensed Matter/Statistical Mechanics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Q2KpAxfKPVizUGPV0nNzle2KWIoICVMzN8cTL8Vvlew",
  "pdfSize": "5888257"
}