{"id":"2412.21132","title":"DeepF-fNet: a physics-informed neural network for vibration isolation\n  optimization","authors":"A. Tollardo, F. Cadini, M. Giglio, L. Lomazzi","authorsParsed":[["Tollardo","A.",""],["Cadini","F.",""],["Giglio","M.",""],["Lomazzi","L.",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 18:08:55 GMT"}],"updateDate":"2024-12-31","timestamp":1735582135000,"abstract":"  Structural optimization is essential for designing safe, efficient, and\ndurable components with minimal material usage. Traditional methods for\nvibration control often rely on active systems to mitigate unpredictable\nvibrations, which may lead to resonance and potential structural failure.\nHowever, these methods face significant challenges when addressing the\nnonlinear inverse eigenvalue problems required for optimizing structures\nsubjected to a wide range of frequencies. As a result, no existing approach has\neffectively addressed the need for real-time vibration suppression within this\ncontext, particularly in high-performance environments such as automotive\nnoise, vibration and harshness, where computational efficiency is crucial.\n  This study introduces DeepF-fNet, a novel neural network framework designed\nto replace traditional active systems in vibration-based structural\noptimization. Leveraging DeepONets within the context of physics-informed\nneural networks, DeepF-fNet integrates both data and the governing physical\nlaws. This enables rapid identification of optimal parameters to suppress\ncritical vibrations at specific frequencies, offering a more efficient and\nreal-time alternative to conventional methods.\n  The proposed framework is validated through a case study involving a locally\nresonant metamaterial used to isolate structures from user-defined frequency\nranges. The results demonstrate that DeepF-fNet outperforms traditional genetic\nalgorithms in terms of computational speed while achieving comparable results,\nmaking it a promising tool for vibration-sensitive applications. By replacing\nactive systems with machine learning techniques, DeepF-fNet paves the way for\nmore efficient and cost-effective structural optimization in real-world\nscenarios.\n","subjects":["Physics/Computational Physics","Computer Science/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NmscQ0YE6hp_dNulzzwH37oRkyRmWEYM3J2fLWzbr8c","pdfSize":"1355529"}