{
  "id": "2412.08896",
  "title": "LV-CadeNet: Long View Feature Convolution-Attention Fusion\n  Encoder-Decoder Network for Clinical MEG Spike Detection",
  "authors": "Kuntao Xiao, Xiongfei Wang, Pengfei Teng, Yi Sun, Wanli Yang, Liang\n  Zhang, Hanyang Dong, Guoming Luan, and Shurong Sheng",
  "authorsParsed": [
    [
      "Xiao",
      "Kuntao",
      ""
    ],
    [
      "Wang",
      "Xiongfei",
      ""
    ],
    [
      "Teng",
      "Pengfei",
      ""
    ],
    [
      "Sun",
      "Yi",
      ""
    ],
    [
      "Yang",
      "Wanli",
      ""
    ],
    [
      "Zhang",
      "Liang",
      ""
    ],
    [
      "Dong",
      "Hanyang",
      ""
    ],
    [
      "Luan",
      "Guoming",
      ""
    ],
    [
      "Sheng",
      "Shurong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 03:19:44 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733973584000,
  "abstract": "  It is widely acknowledged that the epileptic foci can be pinpointed by source\nlocalizing interictal epileptic discharges (IEDs) via Magnetoencephalography\n(MEG). However, manual detection of IEDs, which appear as spikes in MEG data,\nis extremely labor intensive and requires considerable professional expertise,\nlimiting the broader adoption of MEG technology. Numerous studies have focused\non automatic detection of MEG spikes to overcome this challenge, but these\nefforts often validate their models on synthetic datasets with balanced\npositive and negative samples. In contrast, clinical MEG data is highly\nimbalanced, raising doubts on the real-world efficacy of these models. To\naddress this issue, we introduce LV-CadeNet, a Long View feature\nConvolution-Attention fusion Encoder-Decoder Network, designed for automatic\nMEG spike detection in real-world clinical scenarios. Beyond addressing the\ndisparity between training data distribution and clinical test data through\nsemi-supervised learning, our approach also mimics human specialists by\nconstructing long view morphological input data. Moreover, we propose an\nadvanced convolution-attention module to extract temporal and spatial features\nfrom the input data. LV-CadeNet significantly improves the accuracy of MEG\nspike detection, boosting it from 42.31\\% to 54.88\\% on a novel clinical\ndataset sourced from Sanbo Brain Hospital Capital Medical University. This\ndataset, characterized by a highly imbalanced distribution of positive and\nnegative samples, accurately represents real-world clinical scenarios.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "Lw77_RCKRfAjN3NTXsfrrQE323_SpDv2RpmBg8k12y8",
  "pdfSize": "6540288"
}