{"id":"2412.11681","title":"Fast-staged CNN Model for Accurate pulmonary diseases and Lung cancer\n  detection","authors":"Abdelbaki Souid, Mohamed Hamroun, Soufiene Ben Othman, Hedi Sakli,\n  Naceur Abdelkarim","authorsParsed":[["Souid","Abdelbaki",""],["Hamroun","Mohamed",""],["Othman","Soufiene Ben",""],["Sakli","Hedi",""],["Abdelkarim","Naceur",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 11:47:07 GMT"}],"updateDate":"2024-12-17","timestamp":1734349627000,"abstract":"  Pulmonary pathologies are a significant global health concern, often leading\nto fatal outcomes if not diagnosed and treated promptly. Chest radiography\nserves as a primary diagnostic tool, but the availability of experienced\nradiologists remains limited. Advances in Artificial Intelligence (AI) and\nmachine learning, particularly in computer vision, offer promising solutions to\naddress this challenge.\n  This research evaluates a deep learning model designed to detect lung cancer,\nspecifically pulmonary nodules, along with eight other lung pathologies, using\nchest radiographs. The study leverages diverse datasets comprising over 135,120\nfrontal chest radiographs to train a Convolutional Neural Network (CNN). A\ntwo-stage classification system, utilizing ensemble methods and transfer\nlearning, is employed to first triage images into Normal or Abnormal categories\nand then identify specific pathologies, including lung nodules.\n  The deep learning model achieves notable results in nodule classification,\nwith a top-performing accuracy of 77%, a sensitivity of 0.713, a specificity of\n0.776 during external validation, and an AUC score of 0.888. Despite these\nsuccesses, some misclassifications were observed, primarily false negatives.\n  In conclusion, the model demonstrates robust potential for generalization\nacross diverse patient populations, attributed to the geographic diversity of\nthe training dataset. Future work could focus on integrating ETL data\ndistribution strategies and expanding the dataset with additional nodule-type\nsamples to further enhance diagnostic accuracy.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Artificial Intelligence","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"V-bVGgXnzEoFpRuzRXDp6bUQFC9p7BZJ0nn7vihCBIA","pdfSize":"1160354"}