{"id":"2412.11939","title":"SEAGraph: Unveiling the Whole Story of Paper Review Comments","authors":"Jianxiang Yu, Jiaqi Tan, Zichen Ding, Jiapeng Zhu, Jiahao Li, Yao\n  Cheng, Qier Cui, Yunshi Lan, Xiang Li","authorsParsed":[["Yu","Jianxiang",""],["Tan","Jiaqi",""],["Ding","Zichen",""],["Zhu","Jiapeng",""],["Li","Jiahao",""],["Cheng","Yao",""],["Cui","Qier",""],["Lan","Yunshi",""],["Li","Xiang",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 16:24:36 GMT"}],"updateDate":"2024-12-17","timestamp":1734366276000,"abstract":"  Peer review, as a cornerstone of scientific research, ensures the integrity\nand quality of scholarly work by providing authors with objective feedback for\nrefinement. However, in the traditional peer review process, authors often\nreceive vague or insufficiently detailed feedback, which provides limited\nassistance and leads to a more time-consuming review cycle. If authors can\nidentify some specific weaknesses in their paper, they can not only address the\nreviewer's concerns but also improve their work. This raises the critical\nquestion of how to enhance authors' comprehension of review comments. In this\npaper, we present SEAGraph, a novel framework developed to clarify review\ncomments by uncovering the underlying intentions behind them. We construct two\ntypes of graphs for each paper: the semantic mind graph, which captures the\nauthor's thought process, and the hierarchical background graph, which\ndelineates the research domains related to the paper. A retrieval method is\nthen designed to extract relevant content from both graphs, facilitating\ncoherent explanations for the review comments. Extensive experiments show that\nSEAGraph excels in review comment understanding tasks, offering significant\nbenefits to authors.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"STvOdNvS2b6XQ3L30We0hxzwfePTBAEIluu364gfOAM","pdfSize":"1309883"}