{
  "id": "2412.05574",
  "title": "Rate-Distortion Optimized Skip Coding of Region Adaptive Hierarchical\n  Transform Coefficients for MPEG G-PCC",
  "authors": "Zehan Wang, Yuxuan Wei, Hui Yuan, Wei Zhang and Peng Li",
  "authorsParsed": [
    [
      "Wang",
      "Zehan",
      ""
    ],
    [
      "Wei",
      "Yuxuan",
      ""
    ],
    [
      "Yuan",
      "Hui",
      ""
    ],
    [
      "Zhang",
      "Wei",
      ""
    ],
    [
      "Li",
      "Peng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 07:43:44 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733557424000,
  "abstract": "  Three-dimensional (3D) point clouds are becoming more and more popular for\nrepresenting 3D objects and scenes. Due to limited network bandwidth, efficient\ncompression of 3D point clouds is crucial. To tackle this challenge, the Moving\nPicture Experts Group (MPEG) is actively developing the Geometry-based Point\nCloud Compression (G-PCC) standard, incorporating innovative methods to\noptimize compression, such as the Region-Adaptive Hierarchical Transform (RAHT)\nnestled within a layer-by-layer octree-tree structure. Nevertheless, a notable\nproblem still exists in RAHT, i.e., the proportion of zero residuals in the\nlast few RAHT layers leads to unnecessary bitrate consumption. To address this\nproblem, we propose an adaptive skip coding method for RAHT, which adaptively\ndetermines whether to encode the residuals of the last several layers or not,\nthereby improving the coding efficiency. In addition, we propose a\nrate-distortion cost calculation method associated with an adaptive Lagrange\nmultiplier. Experimental results demonstrate that the proposed method achieves\naverage Bj{\\o}ntegaard rate improvements of -3.50%, -5.56%, and -4.18% for the\nLuma, Cb, and Cr components, respectively, on dynamic point clouds, when\ncompared with the state-of-the-art G-PCC reference software under the common\ntest conditions recommended by MPEG.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "DcgwrSo3PDuDZvdvydMZK0JPDlp28NtaXfACkDiVlpA",
  "pdfSize": "3367610"
}