{"id":"2412.06725","title":"Harmonic Mean Density Fusion in Distributed Tracking: Performance and\n  Comparison","authors":"Nikhil Sharma, Ratnasingham Tharmarasa, Thiagalingam Kirubarajan","authorsParsed":[["Sharma","Nikhil",""],["Tharmarasa","Ratnasingham",""],["Kirubarajan","Thiagalingam",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 18:14:53 GMT"}],"updateDate":"2024-12-10","timestamp":1733768093000,"abstract":"  A distributed sensor fusion architecture is preferred in a real\ntarget-tracking scenario as compared to a centralized scheme since it provides\nmany practical advantages in terms of computation load, communication\nbandwidth, fault-tolerance, and scalability. In multi-sensor target-tracking\nliterature, such systems are better known by the pseudonym - track fusion,\nsince processed tracks are fused instead of raw measurements. A fundamental\nproblem, however, in such systems is the presence of unknown correlations\nbetween the tracks, which renders a standard Kalman filter (naive fusion)\nuseless.\n  A widely accepted solution is covariance intersection (CI) which provides\nnear-optimal estimates but at the cost of a conservative covariance. Thus, the\nestimates are pessimistic, which might result in a delayed error convergence.\nAlso, fusion of Gaussian mixture densities is an active area of research where\nstandard methods of track fusion cannot be used. In this article, harmonic mean\ndensity (HMD) based fusion is discussed, which seems to handle both of these\nissues. We present insights on HMD fusion and prove that the method is a result\nof minimizing average Pearson divergence. This article also provides an\nalternative and easy implementation based on an importance-sampling-like method\nwithout the requirement of a proposal density. Similarity of HMD with inverse\ncovariance intersection is an interesting find, and has been discussed in\ndetail.\n  Results based on a real-world multi-target multi-sensor scenario show that\nthe proposed approach converges quickly than existing track fusion algorithms\nwhile also being consistent, as evident from the normalized estimation-error\nsquared (NEES) plots.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computer Science/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HesItlqtgsc3YMJp_IT-3vb7VfgWbnqonKipPvnUFXs","pdfSize":"2276549"}