{"id":"2412.01605","title":"Medchain: Bridging the Gap Between LLM Agents and Clinical Practice\n  through Interactive Sequential Benchmarking","authors":"Jie Liu, Wenxuan Wang, Zizhan Ma, Guolin Huang, Yihang SU, Kao-Jung\n  Chang, Wenting Chen, Haoliang Li, Linlin Shen, Michael Lyu","authorsParsed":[["Liu","Jie",""],["Wang","Wenxuan",""],["Ma","Zizhan",""],["Huang","Guolin",""],["SU","Yihang",""],["Chang","Kao-Jung",""],["Chen","Wenting",""],["Li","Haoliang",""],["Shen","Linlin",""],["Lyu","Michael",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 15:25:02 GMT"}],"updateDate":"2024-12-03","timestamp":1733153102000,"abstract":"  Clinical decision making (CDM) is a complex, dynamic process crucial to\nhealthcare delivery, yet it remains a significant challenge for artificial\nintelligence systems. While Large Language Model (LLM)-based agents have been\ntested on general medical knowledge using licensing exams and knowledge\nquestion-answering tasks, their performance in the CDM in real-world scenarios\nis limited due to the lack of comprehensive testing datasets that mirror actual\nmedical practice. To address this gap, we present MedChain, a dataset of 12,163\nclinical cases that covers five key stages of clinical workflow. MedChain\ndistinguishes itself from existing benchmarks with three key features of\nreal-world clinical practice: personalization, interactivity, and\nsequentiality. Further, to tackle real-world CDM challenges, we also propose\nMedChain-Agent, an AI system that integrates a feedback mechanism and a\nMCase-RAG module to learn from previous cases and adapt its responses.\nMedChain-Agent demonstrates remarkable adaptability in gathering information\ndynamically and handling sequential clinical tasks, significantly outperforming\nexisting approaches. The relevant dataset and code will be released upon\nacceptance of this paper.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dbBtj0zw1OmNmDNehznr0tRSW4KqS5gcMiLYraXQFXk","pdfSize":"8800313"}