{
  "id": "2412.13036",
  "title": "Open-Set Heterogeneous Domain Adaptation: Theoretical Analysis and\n  Algorithm",
  "authors": "Thai-Hoang Pham, Yuanlong Wang, Changchang Yin, Xueru Zhang, Ping\n  Zhang",
  "authorsParsed": [
    [
      "Pham",
      "Thai-Hoang",
      ""
    ],
    [
      "Wang",
      "Yuanlong",
      ""
    ],
    [
      "Yin",
      "Changchang",
      ""
    ],
    [
      "Zhang",
      "Xueru",
      ""
    ],
    [
      "Zhang",
      "Ping",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 15:59:52 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734451192000,
  "abstract": "  Domain adaptation (DA) tackles the issue of distribution shift by learning a\nmodel from a source domain that generalizes to a target domain. However, most\nexisting DA methods are designed for scenarios where the source and target\ndomain data lie within the same feature space, which limits their applicability\nin real-world situations. Recently, heterogeneous DA (HeDA) methods have been\nintroduced to address the challenges posed by heterogeneous feature space\nbetween source and target domains. Despite their successes, current HeDA\ntechniques fall short when there is a mismatch in both feature and label\nspaces. To address this, this paper explores a new DA scenario called open-set\nHeDA (OSHeDA). In OSHeDA, the model must not only handle heterogeneity in\nfeature space but also identify samples belonging to novel classes. To tackle\nthis challenge, we first develop a novel theoretical framework that constructs\nlearning bounds for prediction error on target domain. Guided by this\nframework, we propose a new DA method called Representation Learning for OSHeDA\n(RL-OSHeDA). This method is designed to simultaneously transfer knowledge\nbetween heterogeneous data sources and identify novel classes. Experiments\nacross text, image, and clinical data demonstrate the effectiveness of our\nalgorithm. Model implementation is available at\n\\url{https://github.com/pth1993/OSHeDA}.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "mW0OXn8SQmyCMYz-PxsidCfc3EpUkJyi1Pm9GzyxkH4",
  "pdfSize": "1527425"
}