{
  "id": "2412.18366",
  "title": "Nested Holography",
  "authors": "Kostas Filippas",
  "authorsParsed": [
    [
      "Filippas",
      "Kostas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 11:48:54 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735040934000,
  "abstract": "  Recently, we introduced a symmetry on the structure of angular momentum which\ninterchanges internal and external degrees of freedom. The spin-orbit duality\nis a holographic map that projects a massive theory in four-dimensional flat\nspacetime onto the three-dimensional $\\mathbb{S}^2\\times\\mathbb{R}$ null\ninfinity. This cylinder has radius $R\\sim1/m$ and, quantum-mechanically, its\nvacuum state is a fuzzy sphere. Progress shows that, first, this duality\nrealizes the Hopf map, a fact manifest on the superparticle. Secondly, the bulk\nPoincar\\`e group transforms into the conformal group on the cylinder. In fact,\nthe general version of the duality yields that the dual symmetries include the\nBMS group, as is appropriate at null infinity. As an example, the Landau levels\nin $\\mathbb{R}^3$ are shown to match those of a Dirac monopole on the dual\n$\\mathbb{S}^2$, in the thermodynamic limit. This dual system is actually\nidentified with a three-dimensional critical Ising model. The map is then\nrealized on $N_f$ massive fermions in flat space which, indeed, are the\nhologram of $2N_f$ massless fermions on the cylinder. However, the dual space\nis really the conformal class of $\\mathbb{S}^2\\times\\mathbb{R}$, naturally\nenclosing the universal cover of a conformally compactified AdS$_4$ spacetime.\nWe argue that, in the absence of interactions, the massless fermions on the\nconformal boundary are in turn dual to $N_f$ massive fermions in AdS$_4$. For\nfree fermions, all path integrals $-$the ones in $\\mathbb{R}^4$ and\n$\\mathbb{S}^2\\times\\mathbb{R}$ and AdS$_4-$ are shown to match. Hence, AdS/CFT\nduality emerges into a larger context, where one holography nests inside the\nother, suggesting a complete holographic bridge between fields in flat space\nand the AdS superstring.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "rK4sYciSKgRx3mUCkN9InkR5EswIv_NLTvqRr8SVjFw",
  "pdfSize": "2702748"
}