{
  "id": "2412.18316",
  "title": "Data-Driven Self-Supervised Graph Representation Learning",
  "authors": "Ahmed E. Samy, Zekarias T. Kefatoa and Sarunas Girdzijauskasa",
  "authorsParsed": [
    [
      "Samy",
      "Ahmed E.",
      ""
    ],
    [
      "Kefatoa",
      "Zekarias T.",
      ""
    ],
    [
      "Girdzijauskasa",
      "Sarunas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 10:04:19 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735034659000,
  "abstract": "  Self-supervised graph representation learning (SSGRL) is a representation\nlearning paradigm used to reduce or avoid manual labeling. An essential part of\nSSGRL is graph data augmentation. Existing methods usually rely on heuristics\ncommonly identified through trial and error and are effective only within some\napplication domains. Also, it is not clear why one heuristic is better than\nanother. Moreover, recent studies have argued against some techniques (e.g.,\ndropout: that can change the properties of molecular graphs or destroy relevant\nsignals for graph-based document classification tasks).\n  In this study, we propose a novel data-driven SSGRL approach that\nautomatically learns a suitable graph augmentation from the signal encoded in\nthe graph (i.e., the nodes' predictive feature and topological information). We\npropose two complementary approaches that produce learnable feature and\ntopological augmentations. The former learns multi-view augmentation of node\nfeatures, and the latter learns a high-order view of the topology. Moreover,\nthe augmentations are jointly learned with the representation. Our approach is\ngeneral that it can be applied to homogeneous and heterogeneous graphs. We\nperform extensive experiments on node classification (using nine homogeneous\nand heterogeneous datasets) and graph property prediction (using another eight\ndatasets). The results show that the proposed method matches or outperforms the\nSOTA SSGRL baselines and performs similarly to semi-supervised methods. The\nanonymised source code is available at https://github.com/AhmedESamy/dsgrl/\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "vVhCmP6uXYbUS0oNnhsoF6w4v57hk24V6eGBZwIqF50",
  "pdfSize": "491760"
}