{
  "id": "2412.05345",
  "title": "Osteoporosis Prediction from Hand X-ray Images Using\n  Segmentation-for-Classification and Self-Supervised Learning",
  "authors": "Ung Hwang, Chang-Hun Lee, Kijung Yoon",
  "authorsParsed": [
    [
      "Hwang",
      "Ung",
      ""
    ],
    [
      "Lee",
      "Chang-Hun",
      ""
    ],
    [
      "Yoon",
      "Kijung",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 13:47:29 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733492849000,
  "abstract": "  Osteoporosis is a widespread and chronic metabolic bone disease that often\nremains undiagnosed and untreated due to limited access to bone mineral density\n(BMD) tests like Dual-energy X-ray absorptiometry (DXA). In response to this\nchallenge, current advancements are pivoting towards detecting osteoporosis by\nexamining alternative indicators from peripheral bone areas, with the goal of\nincreasing screening rates without added expenses or time. In this paper, we\npresent a method to predict osteoporosis using hand and wrist X-ray images,\nwhich are both widely accessible and affordable, though their link to DXA-based\ndata is not thoroughly explored. We employ a sophisticated image segmentation\nmodel that utilizes a mixture of probabilistic U-Net decoders, specifically\ndesigned to capture predictive uncertainty in the segmentation of the ulna,\nradius, and metacarpal bones. This model is formulated as an optimal transport\n(OT) problem, enabling it to handle the inherent uncertainties in image\nsegmentation more effectively. Further, we adopt a self-supervised learning\n(SSL) approach to extract meaningful representations without the need for\nexplicit labels, and move on to classify osteoporosis in a supervised manner.\nOur method is evaluated on a dataset with 192 individuals, cross-referencing\ntheir verified osteoporosis conditions against the standard DXA test. With a\nnotable classification score, this integration of uncertainty-aware\nsegmentation and self-supervised learning represents a pioneering effort in\nleveraging vision-based techniques for the early detection of osteoporosis from\nperipheral skeletal sites.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "H2l1pXKeB3GgIfkp8NdwGIEvT6QU3IfxSPR9V1sOinM",
  "pdfSize": "1864045"
}