{
  "id": "2412.15843",
  "title": "Rethinking Hardware Impairments in Multi-User Systems: Can FAS Make a\n  Difference?",
  "authors": "Junteng Yao, Tuo Wu, Liaoshi Zhou, Ming Jin, Cunhua Pan, Maged\n  Elkashlan, Fumiyuki Adachi, George K. Karagiannidis, Naofal Al-Dhahir, Chau\n  Yuen",
  "authorsParsed": [
    [
      "Yao",
      "Junteng",
      ""
    ],
    [
      "Wu",
      "Tuo",
      ""
    ],
    [
      "Zhou",
      "Liaoshi",
      ""
    ],
    [
      "Jin",
      "Ming",
      ""
    ],
    [
      "Pan",
      "Cunhua",
      ""
    ],
    [
      "Elkashlan",
      "Maged",
      ""
    ],
    [
      "Adachi",
      "Fumiyuki",
      ""
    ],
    [
      "Karagiannidis",
      "George K.",
      ""
    ],
    [
      "Al-Dhahir",
      "Naofal",
      ""
    ],
    [
      "Yuen",
      "Chau",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 12:34:58 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734698098000,
  "abstract": "  In this paper, we analyze the role of fluid antenna systems (FAS) in\nmulti-user systems with hardware impairments (HIs). Specifically, we\ninvestigate a scenario where a base station (BS) equipped with multiple fluid\nantennas communicates with multiple users (CUs), each equipped with a single\nfluid antenna. Our objective is to maximize the minimum communication rate\namong all users by jointly optimizing the BS's transmit beamforming, the\npositions of its transmit fluid antennas, and the positions of the CUs' receive\nfluid antennas. To address this non-convex problem, we propose a block\ncoordinate descent (BCD) algorithm integrating semidefinite relaxation (SDR),\nrank-one constraint relaxation (SRCR), successive convex approximation (SCA),\nand majorization-minimization (MM). Simulation results demonstrate that FAS\nsignificantly enhances system performance and robustness, with notable gains\nwhen both the BS and CUs are equipped with fluid antennas. Even under low\ntransmit power conditions, deploying FAS at the BS alone yields substantial\nperformance gains. However, the effectiveness of FAS depends on the\navailability of sufficient movement space, as space constraints may limit its\nbenefits compared to fixed antenna strategies. Our findings highlight the\npotential of FAS to mitigate HIs and enhance multi-user system performance,\nwhile emphasizing the need for practical deployment considerations.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "B1OdKd_GI5qoesphikBJtXtT37dlzzI5FMHv_bgH9B8",
  "pdfSize": "652530"
}