{
  "id": "2412.01784",
  "title": "Noise Injection Reveals Hidden Capabilities of Sandbagging Language\n  Models",
  "authors": "Cameron Tice, Philipp Alexander Kreer, Nathan Helm-Burger, Prithviraj\n  Singh Shahani, Fedor Ryzhenkov, Jacob Haimes, Felix Hofst\\\"atter, Teun van\n  der Weij",
  "authorsParsed": [
    [
      "Tice",
      "Cameron",
      ""
    ],
    [
      "Kreer",
      "Philipp Alexander",
      ""
    ],
    [
      "Helm-Burger",
      "Nathan",
      ""
    ],
    [
      "Shahani",
      "Prithviraj Singh",
      ""
    ],
    [
      "Ryzhenkov",
      "Fedor",
      ""
    ],
    [
      "Haimes",
      "Jacob",
      ""
    ],
    [
      "Hofstätter",
      "Felix",
      ""
    ],
    [
      "van der Weij",
      "Teun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 18:34:51 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733164491000,
  "abstract": "  Capability evaluations play a critical role in ensuring the safe deployment\nof frontier AI systems, but this role may be undermined by intentional\nunderperformance or ``sandbagging.'' We present a novel model-agnostic method\nfor detecting sandbagging behavior using noise injection. Our approach is\nfounded on the observation that introducing Gaussian noise into the weights of\nmodels either prompted or fine-tuned to sandbag can considerably improve their\nperformance. We test this technique across a range of model sizes and\nmultiple-choice question benchmarks (MMLU, AI2, WMDP). Our results demonstrate\nthat noise injected sandbagging models show performance improvements compared\nto standard models. Leveraging this effect, we develop a classifier that\nconsistently identifies sandbagging behavior. Our unsupervised technique can be\nimmediately implemented by frontier labs or regulatory bodies with access to\nweights to improve the trustworthiness of capability evaluations.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mrAnP98mgDoMcqVXnKvlab2_IN-Th_c_OVPbhUKWsIU",
  "pdfSize": "552796"
}