{
  "id": "2412.11572",
  "title": "DB-PAISA: Discovery-Based Privacy-Agile IoT Sensing+Actuation",
  "authors": "Isita Bagayatkar, Youngil Kim, Gene Tsudik",
  "authorsParsed": [
    [
      "Bagayatkar",
      "Isita",
      ""
    ],
    [
      "Kim",
      "Youngil",
      ""
    ],
    [
      "Tsudik",
      "Gene",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 08:57:24 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734339444000,
  "abstract": "  Internet of Things (IoT) devices are becoming increasingly commonplace in\nnumerous public and semi-private settings. Currently, most such devices lack\nmechanisms to facilitate their discovery by casual (nearby) users who are not\nowners or operators. However, these users are potentially being sensed, and/or\nactuated upon, by these devices, without their knowledge or consent. This\nnaturally triggers privacy, security, and safety issues.\n  To address this problem, some recent work explored device transparency in the\nIoT ecosystem. The intuitive approach is for each device to periodically and\nsecurely broadcast (announce) its presence and capabilities to all nearby\nusers. While effective, when no new users are present, this push-based approach\ngenerates a substantial amount of unnecessary network traffic and needlessly\ninterferes with normal device operation.\n  In this work, we construct DB-PAISA which addresses these issues via a\npull-based method, whereby devices reveal their presence and capabilities only\nupon explicit user request. Each device guarantees a secure timely response\n(even if fully compromised by malware) based on a small active Root-of-Trust\n(RoT). DB-PAISA requires no hardware modifications and is suitable for a range\nof current IoT devices. To demonstrate its feasibility and practicality, we\nbuilt a fully functional and publicly available prototype. It is implemented\natop a commodity MCU (NXP LCP55S69) and operates in tandem with a\nsmartphone-based app. Using this prototype, we evaluate energy consumption and\nother performance factors.\n",
  "subjects": [
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "k5Dx51TH2I85Zo1txPP8kqeV4TUvgRn0uUu-Hlk3RS8",
  "pdfSize": "7447927"
}