{
  "id": "2412.18935",
  "title": "Label-free SERS Discrimination of Proline from Hydroxylated Proline at\n  Single-molecule Level Assisted by a Deep Learning Model",
  "authors": "Yingqi Zhao, Kuo Zhan, Pei-Lin Xin, Zuyan Chen, Shuai Li, Francesco De\n  Angelis, Jianan Huang",
  "authorsParsed": [
    [
      "Zhao",
      "Yingqi",
      ""
    ],
    [
      "Zhan",
      "Kuo",
      ""
    ],
    [
      "Xin",
      "Pei-Lin",
      ""
    ],
    [
      "Chen",
      "Zuyan",
      ""
    ],
    [
      "Li",
      "Shuai",
      ""
    ],
    [
      "De Angelis",
      "Francesco",
      ""
    ],
    [
      "Huang",
      "Jianan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 15:46:52 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735141612000,
  "abstract": "  Discriminating the low-abundance hydroxylated proline from hydroxylated\nproline is crucial for monitoring diseases and eval-uating therapeutic outcomes\nthat require single-molecule sensors. While the plasmonic nanopore sensor can\ndetect the hydrox-ylation with single-molecule sensitivity by surface enhanced\nRaman spectroscopy (SERS), it suffers from intrinsic fluctuations of\nsingle-molecule signals as well as strong interference from citrates. Here, we\nused the occurrence frequency histogram of the single-molecule SERS peaks to\nextract overall dataset spectral features, overcome the signal fluctuations and\ninvestigate the citrate-replaced plasmonic nanopore sensors for clean and\ndistinguishable signals of proline and hydroxylated proline. By ligand exchange\nof the citrates by analyte molecules, the representative peaks of citrates\ndecreased with incubation time, prov-ing occupation of the plasmonic hot spot\nby the analytes. As a result, the discrimination of the single-molecule SERS\nsignals of proline and hydroxylated proline was possible with the convolutional\nneural network model with 96.6% accuracy.\n",
  "subjects": [
    "Physics/Chemical Physics",
    "Computer Science/Machine Learning",
    "Physics/Biological Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_dnugX1B9-u5n0Lajg2iAl-tVlw6-NhmiBVDMUpLjJY",
  "pdfSize": "897413"
}