{"id":"2412.15373","title":"Granger Causality Detection with Kolmogorov-Arnold Networks","authors":"Hongyu Lin, Mohan Ren, Paolo Barucca, Tomaso Aste","authorsParsed":[["Lin","Hongyu",""],["Ren","Mohan",""],["Barucca","Paolo",""],["Aste","Tomaso",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 20:10:34 GMT"}],"updateDate":"2024-12-23","timestamp":1734639034000,"abstract":"  Discovering causal relationships in time series data is central in many\nscientific areas, ranging from economics to climate science. Granger causality\nis a powerful tool for causality detection. However, its original formulation\nis limited by its linear form and only recently nonlinear machine-learning\ngeneralizations have been introduced. This study contributes to the definition\nof neural Granger causality models by investigating the application of\nKolmogorov-Arnold networks (KANs) in Granger causality detection and comparing\ntheir capabilities against multilayer perceptrons (MLP). In this work, we\ndevelop a framework called Granger Causality KAN (GC-KAN) along with a tailored\ntraining approach designed specifically for Granger causality detection. We\ntest this framework on both Vector Autoregressive (VAR) models and chaotic\nLorenz-96 systems, analysing the ability of KANs to sparsify input features by\nidentifying Granger causal relationships, providing a concise yet accurate\nmodel for Granger causality detection. Our findings show the potential of KANs\nto outperform MLPs in discerning interpretable Granger causal relationships,\nparticularly for the ability of identifying sparse Granger causality patterns\nin high-dimensional settings, and more generally, the potential of AI in\ncausality discovery for the dynamical laws in physical systems.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"dbS_ApMx-QDsCFQcLB77kJa0xUwkXd21A8HcflvTzD4","pdfSize":"433017"}