{"id":"2412.04077","title":"SoRA: Singular Value Decomposed Low-Rank Adaptation for Domain\n  Generalizable Representation Learning","authors":"Seokju Yun, Seunghye Chae, Dongheon Lee, Youngmin Ro","authorsParsed":[["Yun","Seokju",""],["Chae","Seunghye",""],["Lee","Dongheon",""],["Ro","Youngmin",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 11:17:57 GMT"}],"updateDate":"2024-12-06","timestamp":1733397477000,"abstract":"  Domain generalization (DG) aims to adapt a model using one or multiple source\ndomains to ensure robust performance in unseen target domains. Recently,\nParameter-Efficient Fine-Tuning (PEFT) of foundation models has shown promising\nresults in the context of DG problem. Nevertheless, existing PEFT methods still\nstruggle to strike a balance between preserving generalizable components of the\npre-trained model and learning task-specific features. To gain insights into\nthe distribution of generalizable components, we begin by analyzing the\npre-trained weights through the lens of singular value decomposition. Building\non these insights, we introduce Singular Value Decomposed Low-Rank Adaptation\n(SoRA), an approach that selectively tunes minor singular components while\nkeeping the residual parts frozen. SoRA effectively retains the generalization\nability of the pre-trained model while efficiently acquiring task-specific\nskills. Furthermore, we freeze domain-generalizable blocks and employ an\nannealing weight decay strategy, thereby achieving an optimal balance in the\ndelicate trade-off between generalizability and discriminability. SoRA attains\nstate-of-the-art results on multiple benchmarks that span both domain\ngeneralized semantic segmentation to domain generalized object detection. In\naddition, our methods introduce no additional inference overhead or\nregularization loss, maintain compatibility with any backbone or head, and are\ndesigned to be versatile, allowing easy integration into a wide range of tasks.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nfJBOruZPnoMSrKoVoBQ8XypLMkS2pb7ZlD3hS9Orj8","pdfSize":"39989431"}