{"id":"2412.14597","title":"Revisiting Near-Infrared Features of Kilonovae: The Importance of\n  Gadolinium","authors":"Salma Rahmouni, Masaomi Tanaka, Nanae Domoto, Daiji Kato, Kenta\n  Hotokezaka, Wako Aoki, Teruyuki Hirano, Takayuki Kotani, Masayuki Kuzuhara,\n  Motohide Tamura","authorsParsed":[["Rahmouni","Salma",""],["Tanaka","Masaomi",""],["Domoto","Nanae",""],["Kato","Daiji",""],["Hotokezaka","Kenta",""],["Aoki","Wako",""],["Hirano","Teruyuki",""],["Kotani","Takayuki",""],["Kuzuhara","Masayuki",""],["Tamura","Motohide",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 07:37:08 GMT"}],"updateDate":"2024-12-20","timestamp":1734593828000,"abstract":"  The observation of the kilonova AT2017gfo and investigations of its light\ncurves and spectra confirmed that neutron star mergers are sites of r-process\nnucleosynthesis. However, the identification of elements responsible for the\nspectral features is still challenging, particularly at the near-infrared\nwavelengths. In this study, we systematically searched for all possible\nnear-infrared transitions of heavy elements using experimentally calibrated\nenergy levels. Our analysis reveals that most candidate elements with strong\nabsorption lines are lanthanides (Z=57-71) and actinides (Z=89-103). This is\ndue to their complex structures leading to many low-lying energy levels, which\nresults in strong transitions in the near-infrared range. Domoto et al. (2022)\nhave shown that La III and Ce III can explain the absorption features at\n$\\lambda\\sim$ 12,000 - 15,000 A. While our results confirm that these two\nelements show strong infrared features, we additionally identify Gd III as the\nnext most promising species. Due to its unique atomic structure involving the\nhalf-filled 4f and the outer 5d orbitals, Gd III has one of the lowest-lying\nenergy levels, between which relatively strong transitions occur. We also find\nabsorption lines caused by Gd III in the near-infrared spectrum of a chemically\npeculiar star HR 465, which supports their emergence in kilonova spectra. By\nperforming radiative transfer simulations, we confirm that Gd III lines affect\nthe feature at $\\sim$ 12,000 A previously attributed to La III. Future\nspace-based time-series observations of kilonova spectra will allow the\nidentification of Gd III lines.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics","Physics/Atomic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"D-1uFseWzDeGy_LrPXgKWVCiyZ23ptcvUcuS9lEN1HU","pdfSize":"2831289"}