{
  "id": "2412.08941",
  "title": "Optimized Gradient Clipping for Noisy Label Learning",
  "authors": "Xichen Ye, Yifan Wu, Weizhong Zhang, Xiaoqiang Li, Yifan Chen, and\n  Cheng Jin",
  "authorsParsed": [
    [
      "Ye",
      "Xichen",
      ""
    ],
    [
      "Wu",
      "Yifan",
      ""
    ],
    [
      "Zhang",
      "Weizhong",
      ""
    ],
    [
      "Li",
      "Xiaoqiang",
      ""
    ],
    [
      "Chen",
      "Yifan",
      ""
    ],
    [
      "Jin",
      "Cheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 05:08:05 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 18 Dec 2024 07:26:20 GMT"
    },
    {
      "version": "v3",
      "created": "Thu, 19 Dec 2024 15:59:19 GMT"
    },
    {
      "version": "v4",
      "created": "Sun, 22 Dec 2024 13:47:27 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1733980085000,
  "abstract": "  Previous research has shown that constraining the gradient of loss function\nwith respect to model-predicted probabilities can enhance the model robustness\nagainst noisy labels. These methods typically specify a fixed optimal threshold\nfor gradient clipping through validation data to obtain the desired robustness\nagainst noise. However, this common practice overlooks the dynamic distribution\nof gradients from both clean and noisy-labeled samples at different stages of\ntraining, significantly limiting the model capability to adapt to the variable\nnature of gradients throughout the training process. To address this issue, we\npropose a simple yet effective approach called Optimized Gradient Clipping\n(OGC), which dynamically adjusts the clipping threshold based on the ratio of\nnoise gradients to clean gradients after clipping, estimated by modeling the\ndistributions of clean and noisy samples. This approach allows us to modify the\nclipping threshold at each training step, effectively controlling the influence\nof noise gradients. Additionally, we provide statistical analysis to certify\nthe noise-tolerance ability of OGC. Our extensive experiments across various\ntypes of label noise, including symmetric, asymmetric, instance-dependent, and\nreal-world noise, demonstrate the effectiveness of our approach.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "T25GYO_UIEs3TDN2j7Kidlf96sQshdZFUKjvw9BfgBE",
  "pdfSize": "870712"
}