{"id":"2412.05581","title":"Hamiltonian formalism for Bose excitations in a plasma with a\n  non-Abelian interaction II: Plasmon - hard particle scattering","authors":"Yu.A. Markov, M.A. Markova","authorsParsed":[["Markov","Yu. A.",""],["Markova","M. A.",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 08:16:00 GMT"},{"version":"v2","created":"Wed, 25 Dec 2024 10:16:28 GMT"}],"updateDate":"2024-12-30","timestamp":1733559360000,"abstract":"  It is shown that the Hamiltonian formalism proposed previously in [1] to\ndescribe the nonlinear dynamics of only {\\it soft} fermionic and bosonic\nexcitations contains much more information than initially assumed. In this\npaper, we have demonstrated in detail that it also proved to be very\nappropriate and powerful in describing a wide range of other physical\nphenomena, including the scattering of colorless plasmons off {\\it hard}\nthermal (or external) color-charged particles moving in hot quark-gluon plasma.\nA generalization of the Poisson superbracket including both anticommuting\nvariables for hard modes and normal variables of the soft Bose field, is\npresented for the case of a continuous medium. The corresponding Hamilton\nequations are defined, and the most general form of the third- and fourth-order\ninteraction Hamiltonians is written out in terms of the normal boson field\nvariables and hard momentum modes of the quark-gluon plasma. The canonical\ntransformations involving both bosonic and hard mode degrees of freedom of the\nsystem under consideration, are discussed. The canonicity conditions for these\ntransformations based on the Poisson superbracket, are derived. The most\ngeneral structure of canonical transformations in the form of integro-power\nseries up to sixth order in a new normal field variable and a new hard mode\nvariable, is presented. For the hard momentum mode of quark-gluon plasma\nexcitations, an ansatz separating the color and momentum degrees of freedom, is\nproposed. The question of approximation of the total effective scattering\namplitude when the momenta of hard excitations are much larger than those of\nsoft excitations of the plasma, is considered.\n","subjects":["Physics/High Energy Physics - Theory","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EL5VBa8gQgOPGnKjwfHTdnpSjE0IiGP9iJc959UyTvY","pdfSize":"833998"}