{
  "id": "2412.01769",
  "title": "Commit0: Library Generation from Scratch",
  "authors": "Wenting Zhao, Nan Jiang, Celine Lee, Justin T Chiu, Claire Cardie,\n  Matthias Gall\\'e, Alexander M Rush",
  "authorsParsed": [
    [
      "Zhao",
      "Wenting",
      ""
    ],
    [
      "Jiang",
      "Nan",
      ""
    ],
    [
      "Lee",
      "Celine",
      ""
    ],
    [
      "Chiu",
      "Justin T",
      ""
    ],
    [
      "Cardie",
      "Claire",
      ""
    ],
    [
      "Gallé",
      "Matthias",
      ""
    ],
    [
      "Rush",
      "Alexander M",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 18:11:30 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733163090000,
  "abstract": "  With the goal of benchmarking generative systems beyond expert software\ndevelopment ability, we introduce Commit0, a benchmark that challenges AI\nagents to write libraries from scratch. Agents are provided with a\nspecification document outlining the library's API as well as a suite of\ninteractive unit tests, with the goal of producing an implementation of this\nAPI accordingly. The implementation is validated through running these unit\ntests. As a benchmark, Commit0 is designed to move beyond static one-shot code\ngeneration towards agents that must process long-form natural language\nspecifications, adapt to multi-stage feedback, and generate code with complex\ndependencies. Commit0 also offers an interactive environment where models\nreceive static analysis and execution feedback on the code they generate. Our\nexperiments demonstrate that while current agents can pass some unit tests,\nnone can yet fully reproduce full libraries. Results also show that interactive\nfeedback is quite useful for models to generate code that passes more unit\ntests, validating the benchmarks that facilitate its use.\n",
  "subjects": [
    "Computer Science/Software Engineering",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_47_gwF5ct55ty-Ty5eanvpXbdVXUFk5EIBeNm_tEes",
  "pdfSize": "837585"
}