{"id":"2412.17414","title":"Spatio-Temporal Electromagnetic Kernel Learning for Channel Prediction","authors":"Jinke Li, Jieao Zhu and Linglong Dai","authorsParsed":[["Li","Jinke",""],["Zhu","Jieao",""],["Dai","Linglong",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 09:24:34 GMT"}],"updateDate":"2024-12-24","timestamp":1734945874000,"abstract":"  Accurate channel prediction is essential for addressing channel aging caused\nby user mobility. However, the actual channel variations over time are highly\ncomplex in high-mobility scenarios, which makes it difficult for existing\npredictors to obtain future channels accurately. The low accuracy of channel\npredictors leads to difficulties in supporting reliable communication. To\novercome this challenge, we propose a channel predictor based on\nspatio-temporal electromagnetic (EM) kernel learning (STEM-KL). Specifically,\ninspired by recent advancements in EM information theory (EIT), the STEM kernel\nfunction is derived. The velocity and the concentration kernel parameters are\ndesigned to reflect the time-varying propagation of the wireless signal. We\nobtain the parameters through kernel learning. Then, the future channels are\npredicted by computing their Bayesian posterior, with the STEM kernel acting as\nthe prior. To further improve the stability and model expressibility, we\npropose a grid-based EM mixed kernel learning (GEM-KL) scheme. We design the\nmixed kernel to be a convex combination of multiple sub-kernels, where each of\nthe sub-kernel corresponds to a grid point in the set of pre-selected\nparameters. This approach transforms non-convex STEM kernel learning problem\ninto a convex grid-based problem that can be easily solved by weight\noptimization. Finally, simulation results verify that the proposed STEM-KL and\nGEM-KL schemes can achieve more accurate channel prediction. This indicates\nthat EIT can improve the performance of wireless system efficiently.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computer Science/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"BSd7DFAwxDj81zE9YvELqjc3AJBaS0DuK61yHa7uRyg","pdfSize":"747981"}