{"id":"2412.07806","title":"Diagnosis and Severity Assessment of Ulcerative Colitis using Self\n  Supervised Learning","authors":"Venkat Margapuri","authorsParsed":[["Margapuri","Venkat",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 19:51:06 GMT"}],"updateDate":"2024-12-12","timestamp":1733773866000,"abstract":"  Ulcerative Colitis (UC) is an incurable inflammatory bowel disease that leads\nto ulcers along the large intestine and rectum. The increase in the prevalence\nof UC coupled with gastrointestinal physician shortages stresses the healthcare\nsystem and limits the care UC patients receive. A colonoscopy is performed to\ndiagnose UC and assess its severity based on the Mayo Endoscopic Score (MES).\nThe MES ranges between zero and three, wherein zero indicates no inflammation\nand three indicates that the inflammation is markedly high. Artificial\nIntelligence (AI)-based neural network models, such as convolutional neural\nnetworks (CNNs) are capable of analyzing colonoscopies to diagnose and\ndetermine the severity of UC by modeling colonoscopy analysis as a multi-class\nclassification problem. Prior research for AI-based UC diagnosis relies on\nsupervised learning approaches that require large annotated datasets to train\nthe CNNs. However, creating such datasets necessitates that domain experts\ninvest a significant amount of time, rendering the process expensive and\nchallenging. To address the challenge, this research employs self-supervised\nlearning (SSL) frameworks that can efficiently train on unannotated datasets to\nanalyze colonoscopies and, aid in diagnosing UC and its severity. A comparative\nanalysis with supervised learning models shows that SSL frameworks, such as\nSwAV and SparK outperform supervised learning models on the LIMUC dataset, the\nlargest publicly available annotated dataset of colonoscopy images for UC.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Artificial Intelligence","Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KaluNm_pDpP9s6Wvw0hZpCpEtVe9m_7T0h_eeDdInps","pdfSize":"885767"}