{
  "id": "2412.12941",
  "title": "Physics Playground: Insights from a Qualitative-Quantitative Study about\n  VR-Based Learning",
  "authors": "Elena Battipede, Antonella Giangualano, Paolo Boffi, Monica Clerici,\n  Alessandro Calvi, Luca Cassenti, Roberto Cialini, Tristan Lieven Annemie Van\n  Den Weghe, Loredana Addimando, Pier Luca Lanzi, Alberto Gallace",
  "authorsParsed": [
    [
      "Battipede",
      "Elena",
      ""
    ],
    [
      "Giangualano",
      "Antonella",
      ""
    ],
    [
      "Boffi",
      "Paolo",
      ""
    ],
    [
      "Clerici",
      "Monica",
      ""
    ],
    [
      "Calvi",
      "Alessandro",
      ""
    ],
    [
      "Cassenti",
      "Luca",
      ""
    ],
    [
      "Cialini",
      "Roberto",
      ""
    ],
    [
      "Weghe",
      "Tristan Lieven Annemie Van Den",
      ""
    ],
    [
      "Addimando",
      "Loredana",
      ""
    ],
    [
      "Lanzi",
      "Pier Luca",
      ""
    ],
    [
      "Gallace",
      "Alberto",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 14:19:29 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734445169000,
  "abstract": "  Physics Playground is an immersive Virtual Reality (VR) application designed\nfor educational purposes, featuring a virtual laboratory where users interact\nwith various physics phenomena through guided experiments. This study aims to\nevaluate the application's design and educational content to facilitate its\nintegration into classroom settings. A quantitative data collection\ninvestigated learning outcomes, related confidence, user experience, and\nperceived cognitive load, through a 2x2 within-between subjects setup, with\nparticipants divided into two conditions (VR vs. slideshow) and knowledge\nlevels assessed twice (pre- and post-tests). A qualitative approach included\ninterviews and a focus group to explore education experts' opinions on the\noverall experience and didactic content. Results showed an improvement in\nphysics knowledge and confidence after the learning experience compared to\nbaseline, regardless of the condition. Despite comparable perceived cognitive\nload, slideshow learning was slightly more effective in enhancing physics\nknowledge. However, both qualitative and quantitative results highlighted the\nimmersive advantage of VR in enhancing user satisfaction. This approach pointed\nout limitations and advantages of VR-based learning, but more research is\nneeded to understand how it can be implemented into broader teaching\nstrategies.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Physics/Physics Education"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "54PNOd7phsNiAtLqRcfR43TnsZBjJKV5u55C1G3czv0",
  "pdfSize": "396002"
}