{
  "id": "2412.19328",
  "title": "Resolving the Ambiguity of Complete-to-Partial Point Cloud Registration\n  for Image-Guided Liver Surgery with Patches-to-Partial Matching",
  "authors": "Zixin Yang, Jon S. Heiselman, Cheng Han, Kelly Merrell, Richard Simon,\n  Cristian. A. Linte",
  "authorsParsed": [
    [
      "Yang",
      "Zixin",
      ""
    ],
    [
      "Heiselman",
      "Jon S.",
      ""
    ],
    [
      "Han",
      "Cheng",
      ""
    ],
    [
      "Merrell",
      "Kelly",
      ""
    ],
    [
      "Simon",
      "Richard",
      ""
    ],
    [
      "Linte",
      "Cristian. A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 18:58:29 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735239509000,
  "abstract": "  In image-guided liver surgery, the initial rigid alignment between\npreoperative and intraoperative data, often represented as point clouds, is\ncrucial for providing sub-surface information from preoperative CT/MRI images\nto the surgeon during the procedure. Currently, this alignment is typically\nperformed using semi-automatic methods, which, while effective to some extent,\nare prone to errors that demand manual correction. Point cloud\ncorrespondence-based registration methods are promising to serve as a fully\nautomatic solution. However, they may struggle in scenarios with limited\nintraoperative surface visibility, a common challenge in liver surgery,\nparticularly in laparoscopic procedures, which we refer to as\ncomplete-to-partial ambiguity. We first illustrate this ambiguity by evaluating\nthe performance of state-of-the-art learning-based point cloud registration\nmethods on our carefully constructed in silico and in vitro datasets. Then, we\npropose a patches-to-partial matching strategy as a plug-and-play module to\nresolve the ambiguity, which can be seamlessly integrated into learning-based\nregistration methods without disrupting their end-to-end structure. It has\nproven effective and efficient in improving registration performance for cases\nwith limited intraoperative visibility. The constructed benchmark and the\nproposed module establish a solid foundation for advancing applications of\npoint cloud correspondence-based registration methods in image-guided liver\nsurgery.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "69lxFfW_DSx4R8ItZlCNecRg3B_iUI6F_EVVtm1AQZg",
  "pdfSize": "4742296"
}