{
  "id": "2412.10459",
  "title": "Conformal Prediction on Quantifying Uncertainty of Dynamic Systems",
  "authors": "Aoming Liang, Qi Liu, Lei Xu, Fahad Sohrab, Weicheng Cui, Changhui\n  Song, Moncef Gabbouj",
  "authorsParsed": [
    [
      "Liang",
      "Aoming",
      ""
    ],
    [
      "Liu",
      "Qi",
      ""
    ],
    [
      "Xu",
      "Lei",
      ""
    ],
    [
      "Sohrab",
      "Fahad",
      ""
    ],
    [
      "Cui",
      "Weicheng",
      ""
    ],
    [
      "Song",
      "Changhui",
      ""
    ],
    [
      "Gabbouj",
      "Moncef",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 10:45:02 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 17 Dec 2024 11:35:02 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734000302000,
  "abstract": "  Numerous studies have focused on learning and understanding the dynamics of\nphysical systems from video data, such as spatial intelligence. Artificial\nintelligence requires quantitative assessments of the uncertainty of the model\nto ensure reliability. However, there is still a relative lack of systematic\nassessment of the uncertainties, particularly the uncertainties of the physical\ndata. Our motivation is to introduce conformal prediction into the uncertainty\nassessment of dynamical systems, providing a method supported by theoretical\nguarantees. This paper uses the conformal prediction method to assess\nuncertainties with benchmark operator learning methods. We have also compared\nthe Monte Carlo Dropout and Ensemble methods in the partial differential\nequations dataset, effectively evaluating uncertainty through straight\nroll-outs, making it ideal for time-series tasks.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "4V9Lg1iuG8HkhfmdMUHITr-SjgaSg0jR90jqfH6xf4w",
  "pdfSize": "5662465"
}