{
  "id": "2412.04711",
  "title": "Cell-Free Full-Duplex Communication -- An Overview",
  "authors": "Diluka Galappaththige, Mohammadali Mohammadi, Hien Quoc Ngo, Michail\n  Matthaiou, Chintha Tellambura",
  "authorsParsed": [
    [
      "Galappaththige",
      "Diluka",
      ""
    ],
    [
      "Mohammadi",
      "Mohammadali",
      ""
    ],
    [
      "Ngo",
      "Hien Quoc",
      ""
    ],
    [
      "Matthaiou",
      "Michail",
      ""
    ],
    [
      "Tellambura",
      "Chintha",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 01:56:42 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733450202000,
  "abstract": "  Cell-free (CF) architecture and full-duplex (FD) communication are leading\ncandidates for next-generation wireless networks. The CF framework removes cell\nboundaries in traditional cell-based systems, thereby mitigating inter-cell\ninterference and improving coverage probability. In contrast, FD communication\nallows simultaneous transmission and reception on the same frequency-time\nresources, effectively doubling the spectral efficiency (SE). The integration\nof these technologies, known as CF FD communication, leverages the advantages\nof both approaches to enhance the spectral and energy efficiency in wireless\nnetworks. CF FD communication is particularly promising due to the low-power\nand cost-effective FD-enabled access points (APs), which are ideal for\nshort-range transmissions between APs and users. Despite its potential, a\ncomprehensive survey or tutorial on CF FD communication has been notably\nabsent. This paper aims to address this gap in the literature. It begins with\nan overview of FD communication fundamentals, self-interference cancellation\ntechniques, and CF technology principles, including their implications for\ncurrent wireless networks. The discussion then moves to the integration and\ncompatibility of CF and FD technologies, focusing on channel estimation,\nperformance analysis, and resource allocation in CF FD massive multiple-input\nmultiple-output (mMIMO) networks, supported by an extensive literature review\nand case studies.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "y4SyVUj88D0HtQjusrrwsjnVpDiUXa29n9nArQbX1m0",
  "pdfSize": "1602474"
}