{
  "id": "2412.21144",
  "title": "1/5 and 1/3 magnetization plateaux in the spin 1/2 chain system YbAlO3",
  "authors": "P. Mokhtari, S. Galeski, U. Stockert, S. E. Nikitin, R. Wawrzynczak,\n  R. Kuechler, M. Brando, L. Vasylechko, O. A. Starykh, and E. Hassinger",
  "authorsParsed": [
    [
      "Mokhtari",
      "P.",
      ""
    ],
    [
      "Galeski",
      "S.",
      ""
    ],
    [
      "Stockert",
      "U.",
      ""
    ],
    [
      "Nikitin",
      "S. E.",
      ""
    ],
    [
      "Wawrzynczak",
      "R.",
      ""
    ],
    [
      "Kuechler",
      "R.",
      ""
    ],
    [
      "Brando",
      "M.",
      ""
    ],
    [
      "Vasylechko",
      "L.",
      ""
    ],
    [
      "Starykh",
      "O. A.",
      ""
    ],
    [
      "Hassinger",
      "E.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 18:22:57 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735582977000,
  "abstract": "  Quasi-one-dimensional magnets can host an ordered longitudinal spin-density\nwave state (LSDW) in magnetic field at low temperature, when longitudinal\ncorrelations are strengthened by Ising anisotropies. In the S = 1/2 Heisenberg\nantiferromagnet YbAlO3 this happens via Ising-like interchain interactions.\nHere, we report the first experimental observation of magnetization plateaux at\n1/5 and 1/3 of the saturation value via thermal transport and magnetostriction\nmeasurements in YbAlO3. We present a phenomenological theory of the plateau\nstates that describes them as islands of commensurability within an otherwise\nincommensurate LSDW phase and explains their relative positions within the LSDW\nphase and their relative extent in a magnetic field. Notably, the plateaux are\nstabilised by ferromagnetic interchain interactions in YbAlO3 and consistently\nare absent in other quasi-1D magnets such as BaCo2V2O8 with antiferromagnetic\ninterchain interactions. We also report a sharp, step-like increase of the\nmagnetostriction coefficient, indicating a phase transition of unknown origin\nin the high-field phase just below the saturation.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "rc1akr_P-4sLBS0H6yhTEHusCXEL7iI_qKXDM2KY8Vs",
  "pdfSize": "778437"
}