{"id":"2412.14973","title":"Reciprocity-aware adaptive tile low-rank factorization for large-scale\n  3D multidimensional deconvolution","authors":"Fuqiang Chen, Matteo Ravasi, David Keyes","authorsParsed":[["Chen","Fuqiang",""],["Ravasi","Matteo",""],["Keyes","David",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 15:48:47 GMT"}],"updateDate":"2024-12-20","timestamp":1734623327000,"abstract":"  Low-rank regularization is an effective technique for addressing ill-posed\ninverse problems when the unknown variable exhibits low-rank characteristics.\nHowever, global low-rank assumptions do not always hold for seismic wavefields;\nin many practical situations, local low-rank features are instead more commonly\nobserved. To leverage this insight, we propose partitioning the unknown\nvariable into tiles, each represented via low-rank factorization.\n  We apply this framework to regularize multidimensional deconvolution in the\nfrequency domain, considering two key factors. First, the unknown variable,\nreferred to as the Green's function, must maintain symmetry according to the\nreciprocity principle of wave propagation. To ensure symmetry within the\ntile-based low-rank framework, diagonal tiles are formulated as the product of\na low-rank factor and its transpose if numerically rank-deficient. Otherwise,\nthey are represented by preconditioned dense forms. Symmetry in off-diagonal\nelements is achieved by parameterizing sub-diagonal tiles as the product of two\ndistinct low-rank factors, with the corresponding super-diagonal tiles set as\ntheir transposes.\n  Second, the rank of the Green's function varies with frequency; in other\nwords, the Green's function has different ranks at different frequencies. To\ndetermine the numerical rank and optimal tile size for each frequency, we first\nsolve the multidimensional deconvolution problem using a benchmark solver.\nBased on these results, we estimate the optimal tile size and numerical rank\nfor our proposed solver.\n","subjects":["Physics/Geophysics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"9Ohhif2N_QQhixx0lsJwxFtsF2MzMtCXDAEQi8UH4m8","pdfSize":"26757706"}