{"id":"2412.16020","title":"Dimension-8 operators in $W^+W^-$ production via gluon fusion","authors":"Daniel Gillies, Andrea Banfi, Adam Martin, Matthew A. Lim","authorsParsed":[["Gillies","Daniel",""],["Banfi","Andrea",""],["Martin","Adam",""],["Lim","Matthew A.",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 16:10:03 GMT"}],"updateDate":"2024-12-23","timestamp":1734711003000,"abstract":"  We investigate the impact of dimension-8 operators on $W^+W^-$ production at\nthe LHC for the incoming gluon-gluon channel. To this end, we have identified\nall dimension-8 CP-even operators contributing to the process in question, and\ncomputed the corresponding tree-level helicity amplitudes for fully-leptonic\ndecays of the $W$ bosons. These are implemented in the program MCFM-RE, which\nautomatically incorporates the effect of a jet-veto to reduce the otherwise\noverwhelming $t\\bar t$ background. We find that, unless we break the hierarchy\nof the effective field theory (EFT), the interference of the dimension-8\noperators with the Standard Model is negligible across the considered\ndistributions. This justifies including the square of dimension-6 operators\nwhen performing EFT fits with this channel. We then present new constraints on\nCP-even and CP-odd dimension-6 operators within the EFT regime. Lastly, we\npostulate a scenario in which the hierarchy of the EFT is broken, justified by\nthe strong constraints on dimension-6 operators from existing on-shell Higgs\ndata. In this scenario, we discuss the constraints that can be reasonably set\non CP-even dimension-8 operators with current and future data. We remark that\nthe effect of the jet-veto on the ability to constrain new physics in the\n$W^+W^-$ channel is quite dramatic and must be properly taken into account.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"G65flC2RZC-L6mfFjX6R3VMuRq5tM8tdjuab-jrsYR8","pdfSize":"1612523"}