{
  "id": "2412.19169",
  "title": "Accelerating Stochastic Gravitational Wave Backgrounds Parameter\n  Estimation in Pulsar Timing Arrays with Flow Matching",
  "authors": "Bo Liang, Chang Liu, Tianyu Zhao, Minghui Du, Manjia Liang, Ruijun\n  Shi, Hong Guo, Yuxiang Xu, Li-e Qiang, Peng Xu, Wei-Liang Qian, Ziren Luo",
  "authorsParsed": [
    [
      "Liang",
      "Bo",
      ""
    ],
    [
      "Liu",
      "Chang",
      ""
    ],
    [
      "Zhao",
      "Tianyu",
      ""
    ],
    [
      "Du",
      "Minghui",
      ""
    ],
    [
      "Liang",
      "Manjia",
      ""
    ],
    [
      "Shi",
      "Ruijun",
      ""
    ],
    [
      "Guo",
      "Hong",
      ""
    ],
    [
      "Xu",
      "Yuxiang",
      ""
    ],
    [
      "Qiang",
      "Li-e",
      ""
    ],
    [
      "Xu",
      "Peng",
      ""
    ],
    [
      "Qian",
      "Wei-Liang",
      ""
    ],
    [
      "Luo",
      "Ziren",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 11:02:11 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735210931000,
  "abstract": "  Pulsar timing arrays (PTAs) are essential tools for detecting the stochastic\ngravitational wave background (SGWB), but their analysis faces significant\ncomputational challenges. Traditional methods like Markov-chain Monte Carlo\n(MCMC) struggle with high-dimensional parameter spaces where noise parameters\noften dominate, while existing deep learning approaches fail to model the\nHellings-Downs (HD) correlation or are validated only on synthetic datasets. We\npropose a flow-matching-based continuous normalizing flow (CNF) for efficient\nand accurate PTA parameter estimation. By focusing on the 10 most contributive\npulsars from the NANOGrav 15-year dataset, our method achieves posteriors\nconsistent with MCMC, with a Jensen-Shannon divergence below \\(10^{-2}\\) nat,\nwhile reducing sampling time from 50 hours to 4 minutes. Powered by a versatile\nembedding network and a reweighting loss function, our approach prioritizes the\nSGWB parameters and scales effectively for future datasets. It enables precise\nreconstruction of SGWB and opens new avenues for exploring vast observational\ndata and uncovering potential new physics, offering a transformative tool for\nadvancing gravitational wave astronomy.\n",
  "subjects": [
    "Astrophysics/Instrumentation and Methods for Astrophysics",
    "Physics/General Relativity and Quantum Cosmology",
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "H2IWsLz0pGqm0R03Zy9i_7lnyMxyaeDEja2OPrGc2D4",
  "pdfSize": "1336057"
}