{
  "id": "2412.02128",
  "title": "Quantum phase diagram and non-abelian Moore-Read state in double twisted\n  bilayer graphene",
  "authors": "Sen Niu, Yang Peng, and D. N. Sheng",
  "authorsParsed": [
    [
      "Niu",
      "Sen",
      ""
    ],
    [
      "Peng",
      "Yang",
      ""
    ],
    [
      "Sheng",
      "D. N.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 03:34:15 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733196855000,
  "abstract": "  Experimental realizations of Abelian fractional Chern insulators (FCIs) have\ndemonstrated the potentials of moir\\'e systems in synthesizing exotic quantum\nphases. Remarkably, twisted multilayer graphene system may also host\nnon-Abelian states competing with charge density wave under Coulomb\ninteraction. Here, through larger scale exact diagonalization simulations, we\nmap out the quantum phase diagram for $\\nu=1/2$ system with electrons occupying\nthe lowest moir\\`e band of the double twisted bilayer graphene. By increasing\nthe system size, we find the ground state has six-fold near degeneracy and with\na finite spectral gap separating the ground states from excited states across a\nbroad range of parameters. Further computation of many-body Chern number\nestablish the topological order of the state, and we rule out possibility of\ncharge density wave orders based on featureless density structure factor.\nFurthermore, we inspect the particle-cut entanglement spectrum to identify the\ntopological state as a non-Abelian Moore-Read state. Combining all the above\nevidences we conclude that Moore-Read ground state dominates the quantum phase\ndiagram for the double twisted bilayer graphene system for a broad range of\ncoupling strength with realistic Coulomb interaction.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "djgbuRFeslP8_R9q3lv_9r5oFc4VP4gN1FrMOVrHaaM",
  "pdfSize": "2188607"
}