{
  "id": "2412.04414",
  "title": "Emergent unitary designs for encoded qubits from coherent errors and\n  syndrome measurements",
  "authors": "Zihan Cheng, Eric Huang, Vedika Khemani, Michael J. Gullans, Matteo\n  Ippoliti",
  "authorsParsed": [
    [
      "Cheng",
      "Zihan",
      ""
    ],
    [
      "Huang",
      "Eric",
      ""
    ],
    [
      "Khemani",
      "Vedika",
      ""
    ],
    [
      "Gullans",
      "Michael J.",
      ""
    ],
    [
      "Ippoliti",
      "Matteo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 18:36:14 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733423774000,
  "abstract": "  Unitary $k$-designs are distributions of unitary gates that match the Haar\ndistribution up to its $k$-th statistical moment. They are a crucial resource\nfor randomized quantum protocols. However, their implementation on encoded\nlogical qubits is nontrivial due to the need for magic gates, which can require\na large resource overhead. In this work, we propose an efficient approach to\ngenerate unitary designs for encoded qubits in surface codes by applying local\nunitary rotations (\"coherent errors\") on the physical qubits followed by\nsyndrome measurement and error correction. We prove that under some conditions\non the coherent errors (notably including all single-qubit unitaries) and on\nthe error correcting code, this process induces a unitary transformation of the\nlogical subspace. We numerically show that the ensemble of logical unitaries\n(indexed by the random syndrome outcomes) converges to a unitary design in the\nthermodynamic limit, provided the density or strength of coherent errors is\nabove a finite threshold. This \"unitary design\" phase transition coincides with\nthe code's coherent error threshold under optimal decoding. Furthermore, we\npropose a classical algorithm to simulate the protocol based on a \"staircase\"\nimplementation of the surface code encoder and decoder circuits. This enables a\nmapping to a 1+1D monitored circuit, where we observe an entanglement phase\ntransition (and thus a classical complexity phase transition of the decoding\nalgorithm) coinciding with the aforementioned unitary design phase transition.\nOur results provide a practical way to realize unitary designs on encoded\nqubits, with applications including quantum state tomography and benchmarking\nin error correcting codes.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "05NssGoxy-ncEF8IvmATOCatulQja9AjPUi6vvY5t1E",
  "pdfSize": "3095916"
}