{"id":"2412.11667","title":"Security and Fairness in Multi-Party Quantum Secret Sharing Protocol","authors":"Alessio Di Santo, Walter Tiberti, and Dajana Cassioli","authorsParsed":[["Di Santo","Alessio",""],["Tiberti","Walter",""],["Cassioli","Dajana",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 11:18:52 GMT"}],"updateDate":"2025-02-06","timestamp":1734347932000,"abstract":"  Quantum secret sharing (QSS) is a cryptographic protocol that leverages\nquantum mechanics to distribute a secret among multiple parties. With respect\nto the classical counterpart, in QSS the secret is encoded into quantum states\nand shared by a dealer such that only an authorized subsets of participants,\ni.e., the players, can reconstruct it. Several state-of-the-art studies aim to\ntranspose classical Secret Sharing into the quantum realm, while maintaining\ntheir reliance on traditional network topologies (e.g., star, ring,\nfully-connected) and require that all the n players calculate the secret. These\nstudies exploit the Greenberger-Horne-Zeilinger (GHZ) state, which is a type of\nmaximally entangled quantum state involving three or more qubits. However, none\nof these works account for redundancy, enhanced security/privacy features or\nauthentication mechanisms able to fingerprint players. To address these gaps,\nin this paper we introduce a new concept of QSS which leans on a generic\ndistributed quantum-network, based on a threshold scheme, where all the players\ncollaborate also to the routing of quantum information among them. The dealer,\nby exploiting a custom flexible weighting system, takes advantage of a newly\ndefined quantum Dijkstra algorithm to select the most suitable subset of t\nplayers, out of the entire set on n players, to involve in the computation. To\nfingerprint and authenticate users, CRYSTAL-Kyber primitives are adopted, while\nalso protecting each player's privacy by hiding their identities. We show the\neffectiveness and performance of the proposed protocol by testing it against\nthe main classical and quantum attacks, thereby improving the state-of-the-art\nsecurity measures.\n","subjects":["Physics/Quantum Physics","Computer Science/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"axd7ONxki7oo-l4pNZtm1amfJXaZZ54QEmscnYQ99yw","pdfSize":"664569"}