{"id":"2412.18354","title":"The Thousand Brains Project: A New Paradigm for Sensorimotor\n  Intelligence","authors":"Viviane Clay, Niels Leadholm, Jeff Hawkins","authorsParsed":[["Clay","Viviane",""],["Leadholm","Niels",""],["Hawkins","Jeff",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 11:32:37 GMT"}],"updateDate":"2024-12-25","timestamp":1735039957000,"abstract":"  Artificial intelligence has advanced rapidly in the last decade, driven\nprimarily by progress in the scale of deep-learning systems. Despite these\nadvances, the creation of intelligent systems that can operate effectively in\ndiverse, real-world environments remains a significant challenge. In this white\npaper, we outline the Thousand Brains Project, an ongoing research effort to\ndevelop an alternative, complementary form of AI, derived from the operating\nprinciples of the neocortex. We present an early version of a thousand-brains\nsystem, a sensorimotor agent that is uniquely suited to quickly learn a wide\nrange of tasks and eventually implement any capabilities the human neocortex\nhas. Core to its design is the use of a repeating computational unit, the\nlearning module, modeled on the cortical columns found in mammalian brains.\nEach learning module operates as a semi-independent unit that can model entire\nobjects, represents information through spatially structured reference frames,\nand both estimates and is able to effect movement in the world. Learning is a\nquick, associative process, similar to Hebbian learning in the brain, and\nleverages inductive biases around the spatial structure of the world to enable\nrapid and continual learning. Multiple learning modules can interact with one\nanother both hierarchically and non-hierarchically via a \"cortical messaging\nprotocol\" (CMP), creating more abstract representations and supporting\nmultimodal integration. We outline the key principles motivating the design of\nthousand-brains systems and provide details about the implementation of Monty,\nour first instantiation of such a system. Code can be found at\nhttps://github.com/thousandbrainsproject/tbp.monty, along with more detailed\ndocumentation at https://thousandbrainsproject.readme.io/.\n","subjects":["Computer Science/Artificial Intelligence","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"a92qLMPHPnBthZa0e0gcV86FTSeMbFOWH8V4Gg74Xj4","pdfSize":"18969706"}