{
  "id": "2412.14708",
  "title": "Creation of AI-driven Smart Spaces for Enhanced Indoor Environments -- A\n  Survey",
  "authors": "Ayg\\\"un Varol, Naser Hossein Motlagh, Mirka Leino, Sasu Tarkoma,\n  Johanna Virkki",
  "authorsParsed": [
    [
      "Varol",
      "Aygün",
      ""
    ],
    [
      "Motlagh",
      "Naser Hossein",
      ""
    ],
    [
      "Leino",
      "Mirka",
      ""
    ],
    [
      "Tarkoma",
      "Sasu",
      ""
    ],
    [
      "Virkki",
      "Johanna",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 10:20:34 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734603634000,
  "abstract": "  Smart spaces are ubiquitous computing environments that integrate diverse\nsensing and communication technologies to enhance space functionality, optimize\nenergy utilization, and improve user comfort and well-being. The integration of\nemerging AI methodologies into these environments facilitates the formation of\nAI-driven smart spaces, which further enhance functionalities of the spaces by\nenabling advanced applications such as personalized comfort settings,\ninteractive living spaces, and automatization of the space systems, all\nresulting in enhanced indoor experiences of the users. In this paper, we\npresent a systematic survey of existing research on the foundational components\nof AI-driven smart spaces, including sensor technologies, data communication\nprotocols, sensor network management and maintenance strategies, as well as the\ndata collection, processing and analytics. Given the pivotal role of AI in\nestablishing AI-powered smart spaces, we explore the opportunities and\nchallenges associated with traditional machine learning (ML) approaches, such\nas deep learning (DL), and emerging methodologies including large language\nmodels (LLMs). Finally, we provide key insights necessary for the development\nof AI-driven smart spaces, propose future research directions, and sheds light\non the path forward.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Distributed, Parallel, and Cluster Computing",
    "Computer Science/Emerging Technologies",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FXB5sobz04RQGcdb33fE7xOKvBZaTmv6u49ul1fDDuQ",
  "pdfSize": "1485329"
}