{"id":"2412.15312","title":"PCA-Featured Transformer for Jamming Detection in 5G UAV Networks","authors":"Joseanne Viana, Hamed Farkhari, Pedro Sebastiao, Victor P Gil Jimenez,\n  Lester Ho","authorsParsed":[["Viana","Joseanne",""],["Farkhari","Hamed",""],["Sebastiao","Pedro",""],["Jimenez","Victor P Gil",""],["Ho","Lester",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 16:13:04 GMT"}],"updateDate":"2024-12-23","timestamp":1734624784000,"abstract":"  Jamming attacks pose a threat to Unmanned Aerial Vehicle (UAV) wireless\ncommunication systems, potentially disrupting essential services and\ncompromising network reliability. Current detection approaches struggle with\nsophisticated artificial intelligence (AI) jamming techniques that adapt their\npatterns while existing machine learning solutions often require extensive\nfeature engineering and fail to capture complex temporal dependencies in attack\nsignatures. Furthermore, 5G networks using either Time Division Duplex (TDD) or\nFrequency Division Duplex (FDD) methods can face service degradation from\nintentional interference sources. To address these challenges, we present a\nnovel transformer-based deep learning framework for jamming detection with\nPrincipal Component Analysis (PCA) added features. Our architecture leverages\nthe transformer's self-attention mechanism to capture complex temporal\ndependencies and spatial correlations in wireless signal characteristics,\nenabling more robust jamming detection techniques. The U-shaped model\nincorporates a modified transformer encoder that processes signal features\nincluding received signal strength indicator (RSSI) and signal-to-noise ratio\n(SINR) measurements, alongside a specialized positional encoding scheme that\naccounts for the periodic nature of wireless signals. In addition, we propose a\nbatch size scheduler and implement chunking techniques to optimize training\nconvergence for time series data. These advancements contribute to achieving up\nto a ten times improvement in training speed within the advanced U-shaped\nencoder-decoder model introduced. Simulation results demonstrate that our\napproach achieves a detection accuracy of 90.33 \\% in Line-of-Sight (LoS) and\n84.35 % in non-Line-of-Sight (NLoS) and outperforms machine learning methods\nand existing deep learning solutions such as the XGBoost (XGB) classifier in\napproximately 4%.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WAkpqqJMr6sPksHVWU-08u93CX3Qps8l12-gtfL8NQ4","pdfSize":"359133"}