{"id":"2412.08715","title":"On the Use of Letters of Recommendation in Astronomy and Astrophysics\n  Graduate Admissions","authors":"Darcy Barron, Rachel Bezanson, Laura Blecha, Laura Chomiuk, Lia\n  Corrales, Vera Gluscevic, Kristen McQuinn, Anne Medling, Noel Richardson,\n  Ryan Trainor, and Jessica Werk","authorsParsed":[["Barron","Darcy",""],["Bezanson","Rachel",""],["Blecha","Laura",""],["Chomiuk","Laura",""],["Corrales","Lia",""],["Gluscevic","Vera",""],["McQuinn","Kristen",""],["Medling","Anne",""],["Richardson","Noel",""],["Trainor","Ryan",""],["Werk","Jessica",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 19:00:03 GMT"}],"updateDate":"2024-12-13","timestamp":1733943603000,"abstract":"  Letters of recommendation are a common tool used in graduate admissions. Most\nadmissions systems require three letters for each applicant, burdening both\nletter writers and admissions committees with a heavy work load that may not be\ntime well-spent. Most applicants do not have three research advisors who can\ncomment meaningfully on research readiness, adding a large number of letters\nthat are not useful. Ideally, letters of recommendation will showcase the\nstudents' promise for a research career, but in practice, the letters often do\nnot fulfill this purpose.\n  As a group of early and mid-career faculty who write dozens of letters every\nyear for promising undergraduates, we are concerned and overburdened by the\ninefficiencies of the current system. In this open letter to the AAS Graduate\nAdmissions Task Force, we offer an alternative to the current use of letters of\nrecommendation: a portfolio submitted by the student, which highlights e.g., a\npaper, plot, or presentation that represents their past work and readiness for\ngrad school, uploaded to a centralized system used by astronomy and\nastrophysics PhD programs. While we argue that we could eliminate letters in\nthis new paradigm, it may instead be advisable to limit the number of letters\nof recommendation to one per applicant.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1ugW203qlXI_Lh7GByCplKxnYmsVcR8OCKPj_1kwj7E","pdfSize":"464979"}