{"id":"2412.16962","title":"Construction, Transformation and Structures of 2x2 Space-Filling Curves","authors":"Zuguang Gu","authorsParsed":[["Gu","Zuguang",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 10:45:33 GMT"},{"version":"v2","created":"Sun, 5 Jan 2025 23:01:22 GMT"},{"version":"v3","created":"Mon, 13 Jan 2025 20:38:32 GMT"},{"version":"v4","created":"Sat, 18 Jan 2025 08:36:37 GMT"},{"version":"v5","created":"Thu, 30 Jan 2025 10:50:28 GMT"},{"version":"v6","created":"Fri, 21 Feb 2025 08:58:20 GMT"}],"updateDate":"2025-02-24","timestamp":1734864333000,"abstract":"  The 2x2 space-filling curve is a type of generalized space-filling curve\ncharacterized by a basic unit is in a \"U-shape\" that traverses a 2x2 grid. In\nthis work, we propose a universal framework for constructing general 2x2 curves\nwhere self-similarity is not strictly required. The construction is based on a\nnovel set of grammars that define the expansion of curves from level 0 (a\nsingle point) to level 1 (units in U-shapes), which ultimately determines all\n$36 \\times 2^k$ possible forms of curves on any level $k$ initialized from\nsingle points. We further developed an encoding system in which each unique\nform of the curve is associated with a specific combination of an initial seed\nand a sequence of codes that sufficiently describes both the global and local\nstructures of the curve. We demonstrated that this encoding system is a\npowerful tool for studying 2x2 curves and we established comprehensive\ntheoretical foundations from the following three key perspectives: 1) We\nprovided a deterministic encoding for any unit on any level and position on the\ncurve, enabling the study of curve generation across arbitrary parts on the\ncurve and ranges of iterations; 2) We gave deterministic encodings for various\ncurve transformations, including rotations, reflections and reversals; 3) We\nprovided deterministic forms of families of curves exhibiting specific\nstructures, including homogeneous curves, curves with identical shapes,\npartially identical shapes, and with completely distinct shapes. We also\nexplored families of recursive curves, subunit identically or differently\nshaped curves, completely non-recursive curves, symmetric curves and closed\ncurves. Finally, we proposed a method to calculate the location of any point on\nthe curve arithmetically, within a time complexity linear to the level of the\ncurve.\n","subjects":["Computer Science/Computational Geometry","Mathematics/Combinatorics","Mathematics/General Topology"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Fem3hZvgqcS01_1_EgjITaEQF6SNfjczGG4QB5BbfI4","pdfSize":"1725253"}