{"id":"2412.14731","title":"Ground State Phases and Topological Excitations of Spin-1 Bose-Einstein\n  Condensate in Twisted Optical Lattices","authors":"Tian-Tian Li, Ze-Hong Guo, Xiao-Ning Wang, and Qizhong Zhu","authorsParsed":[["Li","Tian-Tian",""],["Guo","Ze-Hong",""],["Wang","Xiao-Ning",""],["Zhu","Qizhong",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 10:57:06 GMT"}],"updateDate":"2024-12-20","timestamp":1734605826000,"abstract":"  Recently, the simulation of moir\\'e physics using cold atom platforms has\ngained significant attention. These platforms provide an opportunity to explore\nnovel aspects of moir\\'e physics that go beyond the limits of traditional\ncondensed matter systems. Building on recent experimental advancements in\ncreating twisted bilayer spin-dependent optical lattices for pseudospin-1/2\nBose gases, we extend this concept to a trilayer optical lattice for spin-1\nBose gases. Unlike conventional moir\\'e patterns, which are typically induced\nby interlayer tunneling or interspin coupling, the moir\\'e pattern in this\ntrilayer system arises from inter-species atomic interactions. We investigate\nthe ground state of Bose-Einstein condensates loaded in this spin-1 twisted\noptical lattice under both ferromagnetic and antiferromagnetic interactions. We\nfind that the ground state forms a periodic pattern of distinct phases in the\nhomogeneous case, including ferromagnetic, antiferromagnetic, polar, and broken\naxial symmetry phases. Additionally, by quenching the optical lattice potential\nstrength, we examine the quench dynamics of the system above the ground state\nand observe the emergence of topological excitations such as vortex pairs. This\nstudy provides a pathway for exploring the rich physics of spin-1 twisted\noptical lattices and expands our understanding of moir\\'e systems in synthetic\nquantum platforms.\n","subjects":["Condensed Matter/Quantum Gases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7QGHw_IRSsDyk9iRFFrE5NYhciF2ldTxKngSfFcRcwM","pdfSize":"12450417"}