{
  "id": "2412.16253",
  "title": "Interactive Scene Authoring with Specialized Generative Primitives",
  "authors": "Cl\\'ement Jambon (1), Changwoon Choi (2), Dongsu Zhang (2), Olga\n  Sorkine-Hornung (1), Young Min Kim (2) ((1) ETH Zurich, (2) Seoul National\n  University)",
  "authorsParsed": [
    [
      "Jambon",
      "Clément",
      ""
    ],
    [
      "Choi",
      "Changwoon",
      ""
    ],
    [
      "Zhang",
      "Dongsu",
      ""
    ],
    [
      "Sorkine-Hornung",
      "Olga",
      ""
    ],
    [
      "Kim",
      "Young Min",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 04:39:50 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734669590000,
  "abstract": "  Generating high-quality 3D digital assets often requires expert knowledge of\ncomplex design tools. We introduce Specialized Generative Primitives, a\ngenerative framework that allows non-expert users to author high-quality 3D\nscenes in a seamless, lightweight, and controllable manner. Each primitive is\nan efficient generative model that captures the distribution of a single\nexemplar from the real world. With our framework, users capture a video of an\nenvironment, which we turn into a high-quality and explicit appearance model\nthanks to 3D Gaussian Splatting. Users then select regions of interest guided\nby semantically-aware features. To create a generative primitive, we adapt\nGenerative Cellular Automata to single-exemplar training and controllable\ngeneration. We decouple the generative task from the appearance model by\noperating on sparse voxels and we recover a high-quality output with a\nsubsequent sparse patch consistency step. Each primitive can be trained within\n10 minutes and used to author new scenes interactively in a fully compositional\nmanner. We showcase interactive sessions where various primitives are extracted\nfrom real-world scenes and controlled to create 3D assets and scenes in a few\nminutes. We also demonstrate additional capabilities of our primitives:\nhandling various 3D representations to control generation, transferring\nappearances, and editing geometries.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Graphics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "aROHogd9r4XlwlJIZVxnw8Q5DtR_3xWOJTBgKMvstHM",
  "pdfSize": "44554974"
}