{
  "id": "2412.08679",
  "title": "COST INTERACT Whitepaper on Signal Processing for Communications,\n  Localization, and Intergrated Sensing and Communication",
  "authors": "Alister Burr, Ana Garcia Armada, Carsten Smeenk, Yang Miao",
  "authorsParsed": [
    [
      "Burr",
      "Alister",
      ""
    ],
    [
      "Armada",
      "Ana Garcia",
      ""
    ],
    [
      "Smeenk",
      "Carsten",
      ""
    ],
    [
      "Miao",
      "Yang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 17:12:40 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733937160000,
  "abstract": "  The upcoming next generation of wireless communication is anticipated to\nrevolutionize the conventional functionalities of the network by adding sensing\nand localization capabilities, low-power communication, wireless brain computer\ninteractions, massive robotics and autonomous systems connection. Furthermore,\nthe key performance indicators expected for the 6G of mobile communications\npromise challenging operating conditions, such as user data rates of 1 Tbps,\nend-to-end latency of less than 1 ms, and vehicle speeds of 1000 km per hour.\nThis evolution needs new techniques, not only to improve communications, but\nalso to provide localization and sensing with an efficient use of the radio\nresources. The goal of INTERACT Working Group 2 is to design novel physical\nlayer technologies that can meet these KPI, by combining the data information\nfrom statistical learning with the theoretical knowledge of the transmitted\nsignal structure. Waveforms and coding, advanced multiple-input multiple-output\nand all the required signal processing, in sub-6-GHz, millimeter-wave bands and\nupper-mid-band, are considered while aiming at designing these new\ncommunications, positioning and localization techniques. This White Paper\nsummarizes our main approaches and contributions.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "X836BYp9E-RdllQAAl7UET25FlL2zPn2VSoFYGv86Ok",
  "pdfSize": "61171576"
}