{
  "id": "2412.18068",
  "title": "Competing electronic ground states in the heavy-fermion superconductor\n  CeRh2As2",
  "authors": "Joanna B{\\l}awat, Grzegorz Chajewski, Daniel Gnida, John Singleton,\n  Oscar Ayala Valenzuela, Dariusz Kaczorowski, Ross D. McDonald",
  "authorsParsed": [
    [
      "Bławat",
      "Joanna",
      ""
    ],
    [
      "Chajewski",
      "Grzegorz",
      ""
    ],
    [
      "Gnida",
      "Daniel",
      ""
    ],
    [
      "Singleton",
      "John",
      ""
    ],
    [
      "Valenzuela",
      "Oscar Ayala",
      ""
    ],
    [
      "Kaczorowski",
      "Dariusz",
      ""
    ],
    [
      "McDonald",
      "Ross D.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 00:53:04 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735001584000,
  "abstract": "  CeRh2As2 is rare among superconductors, in that magnetic field tunes it\nbetween two distinct superconducting phases. Combined with a lack of local\ninversion symmetry and an upper critical field exceeding the Pauli paramagnetic\nlimit, this excitingly suggests triplet multicomponent superconductivity.\nPreceding the superconducting onset, f-electron correlations cause long-range\norder, attributed both to local antiferromagnetism and itinerant (quadrupole)\ndensity-waves. Magnetic field provides a significant perturbation of the\nf-electron and may reveal the nature of the many-body correlations. Thus, we\nreport comprehensive magnetization and magnetotransport studies on\nmicrostructured devices in fields of up to 73 T. Applied along the c-axis,\nfield causes a low-temperature valence transition at {\\mu}0H ~ 24 T. By\ncontrast, in-plane fields produce a cascade of phase transitions; the\nfield-induced in-plane conductivity anisotropy and lack of accompanying\nmagnetic features, plus the closed-dome nature of the overall phase boundary is\nconsistent with a hierarchy of field-induced density-wave states.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "CwZXcJisbXxXKU5vJxzdan2iXlIaKUK2aWMn_2mjAOQ",
  "pdfSize": "1221438"
}