{
  "id": "2412.15966",
  "title": "Monkey Transfer Learning Can Improve Human Pose Estimation",
  "authors": "Bradley Scott, Clarisse de Vries, Aiden Durrant, Nir Oren, Edward\n  Chadwick, Dimitra Blana",
  "authorsParsed": [
    [
      "Scott",
      "Bradley",
      ""
    ],
    [
      "de Vries",
      "Clarisse",
      ""
    ],
    [
      "Durrant",
      "Aiden",
      ""
    ],
    [
      "Oren",
      "Nir",
      ""
    ],
    [
      "Chadwick",
      "Edward",
      ""
    ],
    [
      "Blana",
      "Dimitra",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 15:06:15 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734707175000,
  "abstract": "  In this study, we investigated whether transfer learning from macaque monkeys\ncould improve human pose estimation. Current state-of-the-art pose estimation\ntechniques, often employing deep neural networks, can match human annotation in\nnon-clinical datasets. However, they underperform in novel situations, limiting\ntheir generalisability to clinical populations with pathological movement\npatterns. Clinical datasets are not widely available for AI training due to\nethical challenges and a lack of data collection. We observe that data from\nother species may be able to bridge this gap by exposing the network to a\nbroader range of motion cues. We found that utilising data from other species\nand undertaking transfer learning improved human pose estimation in terms of\nprecision and recall compared to the benchmark, which was trained on humans\nonly. Compared to the benchmark, fewer human training examples were needed for\nthe transfer learning approach (1,000 vs 19,185). These results suggest that\nmacaque pose estimation can improve human pose estimation in clinical\nsituations. Future work should further explore the utility of pose estimation\ntrained with monkey data in clinical populations.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "CVm3gyfsQl-VOetkTfLpWi8IxjlzdxUsLiHKsM4SMZk",
  "pdfSize": "220440"
}