{"id":"2412.19682","title":"A Hybrid Technique for Plant Disease Identification and Localisation in\n  Real-time","authors":"Mahendra Kumar Gohil, Anirudha Bhattacharjee, Rwik Rana, Kishan Lal,\n  Samir Kumar Biswas, Nachiketa Tiwari and Bishakh Bhattacharya","authorsParsed":[["Gohil","Mahendra Kumar",""],["Bhattacharjee","Anirudha",""],["Rana","Rwik",""],["Lal","Kishan",""],["Biswas","Samir Kumar",""],["Tiwari","Nachiketa",""],["Bhattacharya","Bishakh",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 15:20:45 GMT"}],"updateDate":"2024-12-30","timestamp":1735312845000,"abstract":"  Over the past decade, several image-processing methods and algorithms have\nbeen proposed for identifying plant diseases based on visual data. DNN (Deep\nNeural Networks) have recently become popular for this task. Both traditional\nimage processing and DNN-based methods encounter significant performance issues\nin real-time detection owing to computational limitations and a broad spectrum\nof plant disease features. This article proposes a novel technique for\nidentifying and localising plant disease based on the Quad-Tree decomposition\nof an image and feature learning simultaneously. The proposed algorithm\nsignificantly improves accuracy and faster convergence in high-resolution\nimages with relatively low computational load. Hence it is ideal for deploying\nthe algorithm in a standalone processor in a remotely operated image\nacquisition and disease detection system, ideally mounted on drones and robots\nworking on large agricultural fields. The technique proposed in this article is\nhybrid as it exploits the advantages of traditional image processing methods\nand DNN-based models at different scales, resulting in faster inference. The F1\nscore is approximately 0.80 for four disease classes corresponding to potato\nand tomato crops.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NdJJafbbPsVlGgTSUUADDkxAF1cU2WfJ1djVYf-VRHo","pdfSize":"23132604"}