{"id":"2412.00007","title":"Anthropogenic actinides in seawater and biota from the west coast of\n  Sweden","authors":"Mercedes L\\'opez Lora, Elena Chamizo, Mats Eriksson","authorsParsed":[["Lora","Mercedes López",""],["Chamizo","Elena",""],["Eriksson","Mats",""]],"versions":[{"version":"v1","created":"Tue, 12 Nov 2024 16:35:17 GMT"}],"updateDate":"2024-12-03","timestamp":1731429317000,"abstract":"  The assessment of the origin of the anthropogenic contamination in marine\nregions impacted by other sources than global fallout is a challenge. This is\nthe case of the west coast of Sweden, influenced by the liquid effluents\nreleased by the European Nuclear Reprocessing Plants through North Sea currents\nand by Baltic Sea local and regional sources, among others. This work focused\non the study of anthropogenic actinides (${}^{236}$U, ${}^{237}$Np and\n${}^{239,240}$Pu) in seawater and biota from a region close to Gothenburg where\nradioactive wastes with an unknown composition were dumped in 1964. To this\naim, a radiochemical procedure for the sequential extraction of U, Np and Pu\nfrom biota samples and the subsequent analysis of ${}^{236}$U, ${}^{237}$Np,\n${}^{239}$Pu and ${}^{240}$Pu by Accelerator Mass Spectrometry was developed.\nThe method was validated through the study of two reference materials provided\nby the International Atomic Energy Agency (IAEA): IAEA-446 (Baltic Sea seaweed)\nand IAEA-437 (Mediterranean Sea mussels). The ${}^{233}$U$/{}^{236}$U atom\nratio was also studied in the seawater samples. The obtained results indicate\nthat the North Sea currents and global fallout are the major sources for\n${}^{236}$U, ${}^{237}$Np and ${}^{239,240}$Pu to the studied area, with any\nclear evidence of other local sources. Complementary, information on the\nConcentrations Factors (CF) in biota was obtained, for which the available\ninformation is very scarce. For seaweed, CF values of $(4.1 \\pm 1.1) \\times\n10^{3}$, $88 \\pm 51$ and $70 \\pm 20$ have been obtained for Pu, Np and U,\nrespectively. Lower CF values of $(3.6 \\pm 1.2) \\times 10^{2}$, $37 \\pm 15$ and\n$15.1 \\pm 5.2$ for Pu, Np and U, respectively, have been obtained for mussels.\n","subjects":["Physics/Geophysics","Physics/Nuclear Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Q0O7VsT1s259oQyDLZtCYG2BWEVwN0IHxbXiIBw-UR8","pdfSize":"710791"}