{
  "id": "2412.09233",
  "title": "High-Speed Time Series Prediction with a GHz-rate Photonic Spiking\n  Neural Network built with a single VCSEL",
  "authors": "Dafydd Owen-Newns (1), Lina Jaurigue (2), Josh Robertson (1), Andrew\n  Adair (1), Jonnel Anthony Jaurigue (2), Kathy L\\\"udge (2), Antonio Hurtado\n  (1) ((1) University of Strathclyde, (2) Technische Universit\\\"at Ilmenau)",
  "authorsParsed": [
    [
      "Owen-Newns",
      "Dafydd",
      "",
      "University of Strathclyde"
    ],
    [
      "Jaurigue",
      "Lina",
      "",
      "Technische Universit채t Ilmenau"
    ],
    [
      "Robertson",
      "Josh",
      "",
      "University of Strathclyde"
    ],
    [
      "Adair",
      "Andrew",
      "",
      "University of Strathclyde"
    ],
    [
      "Jaurigue",
      "Jonnel Anthony",
      "",
      "Technische Universit채t Ilmenau"
    ],
    [
      "L체dge",
      "Kathy",
      "",
      "Technische Universit채t Ilmenau"
    ],
    [
      "Hurtado",
      "Antonio",
      "",
      "University of Strathclyde"
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 12:43:49 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734007429000,
  "abstract": "  Photonic technologies hold significant potential for creating innovative,\nhigh-speed, efficient and hardware-friendly neuromorphic computing platforms.\nNeuromorphic photonic methods leveraging ubiquitous, technologically mature and\ncost-effective Vertical-Cavity Surface Emitting Lasers (VCSELs) are of notable\ninterest. VCSELs have demonstrated the capability to replicate neuronal optical\nspiking responses at ultrafast rates. These characteristics have triggered\nresearch into applying these key-enabling devices in spike-based photonic\ncomputing. Here, a GHz-rate photonic Spiking Neural Network (p-SNN) using a\nsingle VCSEL is reported, and its application to a complex time-series\nprediction task is demonstrated for the first time. The VCSEL p-SNN combined\nwith a technique to induce network memory, is applied to perform\nmulti-step-ahead predictions of a chaotic time-series. By providing the\nfeedforward p-SNN with only two temporally separated inputs excellent accuracy\nis experimentally demonstrated over a range of prediction horizons. VCSEL-based\np-SNNs therefore offer ultrafast, efficient operation in complex predictive\ntasks whilst enabling hardware implementations. The inherent attributes and\nperformance of VCSEL p-SNNs hold great promise for use in future light-enabled\nneuromorphic computing hardware.\n",
  "subjects": [
    "Physics/Computational Physics",
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "XqFb6kLwV26lT-G8_O5DlAgYXCli6V8LhLWK_7NbBxg",
  "pdfSize": "2058948"
}