{
  "id": "2412.16817",
  "title": "A Graph Neural Network Surrogate Model for Multi-Objective\n  Fluid-Acoustic Shape Optimization",
  "authors": "Farnoosh Hadizadeh, Wrik Mallik, and Rajeev K. Jaiman",
  "authorsParsed": [
    [
      "Hadizadeh",
      "Farnoosh",
      ""
    ],
    [
      "Mallik",
      "Wrik",
      ""
    ],
    [
      "Jaiman",
      "Rajeev K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 01:40:51 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734831651000,
  "abstract": "  This article presents a graph neural network (GNN) based surrogate modeling\napproach for fluid-acoustic shape optimization. The GNN model transforms\nmesh-based simulations into a computational graph, enabling global prediction\nof pressure and velocity flow fields around solid boundaries. We employ signed\ndistance functions to implicitly represent geometries on unstructured nodes\nrepresented by the graph neural network. The trained graph neural network is\nemployed here to predict the flow field around various airfoil shapes. The\nmedian relative error in the prediction of pressure and velocity for 300 test\ncases is 1-2\\%. The predicted flow field is employed to extract the fluid force\ncoefficients and the velocity profile of the boundary layer. The boundary layer\nvelocity profile is then used to predict the flow field and noise levels,\nallowing the direct integration of the coupled fluid-acoustic analysis in the\nshape optimization algorithm. The fluid-acoustic shape optimization is extended\nto multi-objective shape optimization by minimizing trailing edge noise while\nmaximizing the aerodynamic performance of airfoil surfaces. The results show\nthat the overall sound pressure level of the optimized airfoil decreases by\n13.9\\% (15.82 dBA), and the lift coefficient increases by 7.2\\%, for a fixed\nset of operating conditions. The proposed GNN-based integrated surrogate\nmodeling with the shape optimization algorithm exhibits a computational\nspeed-up of three orders of magnitude compared to while maintaining reasonable\naccuracy compared to full-order online optimization applications. The GNN-based\nsurrogate model offers an efficient computational framework for fluid-acoustic\nshape optimization via adaptive morphing of structures.\n",
  "subjects": [
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "lxYrjtHh7CkEUMStzXbhAfCBivdyr2-XAtDdr3Mq0wg",
  "pdfSize": "2509486"
}