{
  "id": "2412.21015",
  "title": "MapQaTor: A System for Efficient Annotation of Map Query Datasets",
  "authors": "Mahir Labib Dihan, Mohammed Eunus Ali, Md Rizwan Parvez",
  "authorsParsed": [
    [
      "Dihan",
      "Mahir Labib",
      ""
    ],
    [
      "Ali",
      "Mohammed Eunus",
      ""
    ],
    [
      "Parvez",
      "Md Rizwan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 15:33:19 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735572799000,
  "abstract": "  Mapping and navigation services like Google Maps, Apple Maps, Openstreet\nMaps, are essential for accessing various location-based data, yet they often\nstruggle to handle natural language geospatial queries. Recent advancements in\nLarge Language Models (LLMs) show promise in question answering (QA), but\ncreating reliable geospatial QA datasets from map services remains challenging.\nWe introduce MapQaTor, a web application that streamlines the creation of\nreproducible, traceable map-based QA datasets. With its plug-and-play\narchitecture, MapQaTor enables seamless integration with any maps API, allowing\nusers to gather and visualize data from diverse sources with minimal setup. By\ncaching API responses, the platform ensures consistent ground truth, enhancing\nthe reliability of the data even as real-world information evolves. MapQaTor\ncentralizes data retrieval, annotation, and visualization within a single\nplatform, offering a unique opportunity to evaluate the current state of\nLLM-based geospatial reasoning while advancing their capabilities for improved\ngeospatial understanding. Evaluation metrics show that, MapQaTor speeds up the\nannotation process by at least 30 times compared to manual methods,\nunderscoring its potential for developing geospatial resources, such as complex\nmap reasoning datasets. The website is live at: https://mapqator.github.io/ and\na demo video is available at: https://youtu.be/7_aV9Wmhs6Q.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Sv_l-Cl1oiBUWlsQ06ZLEyenwCIDF2B-UUbAQhWjieI",
  "pdfSize": "5479426"
}