{"id":"2412.13088","title":"Taming Multi-Domain, -Fidelity Data: Towards Foundation Models for\n  Atomistic Scale Simulations","authors":"Tomoya Shiota, Kenji Ishihara, Tuan Minh Do, Toshio Mori, Wataru\n  Mizukami","authorsParsed":[["Shiota","Tomoya",""],["Ishihara","Kenji",""],["Do","Tuan Minh",""],["Mori","Toshio",""],["Mizukami","Wataru",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 16:59:03 GMT"}],"updateDate":"2024-12-18","timestamp":1734454743000,"abstract":"  Machine learning interatomic potentials (MLIPs) are changing atomistic\nsimulations in chemistry and materials science. Yet, building a single,\nuniversal MLIP -- capable of accurately modeling both molecular and crystalline\nsystems -- remains challenging. A central obstacle lies in integrating the\ndiverse datasets generated under different computational conditions. This\ndifficulty creates an accessibility barrier, allowing only institutions with\nsubstantial computational resources -- those able to perform costly\nrecalculations to standardize data -- to contribute meaningfully to the\nadvancement of universal MLIPs. Here, we present Total Energy Alignment (TEA),\nan approach that enables the seamless integration of heterogeneous quantum\nchemical datasets almost without redundant calculations. Using TEA, we have\ntrained MACE-Osaka24, the first open-source neural network potential model\nbased on a unified dataset covering both molecular and crystalline systems,\nutilizing the MACE architecture developed by Batatia et al. This universal\nmodel shows strong performance across diverse chemical systems, exhibiting\ncomparable or improved accuracy in predicting organic reaction barriers\ncompared to specialized models, while effectively maintaining state-of-the-art\naccuracy for inorganic systems. Our method democratizes the development of\nuniversal MLIPs, enabling researchers across academia and industry to\ncontribute to and benefit from high-accuracy potential energy surface models,\nregardless of their computational resources. This advancement paves the way for\naccelerated discovery in chemistry and materials science through genuinely\nfoundation models for chemistry.\n","subjects":["Physics/Chemical Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gCRjOgmGIGniE6XIimOJlefu7ztrsrwIdHCq3xBM-Ok","pdfSize":"3048311"}