{"id":"2412.15817","title":"Imaging the transition from diffusive to Landauer resistivity dipoles","authors":"David K\\\"ampfer, Serhii Kovalchuk, Jonathan K. Hofmann, Timofey\n  Balashov, Vasily Cherepanov, Bert Voigtl\\\"ander, Ireneusz Morawski, F. Stefan\n  Tautz, and Felix L\\\"upke","authorsParsed":[["Kämpfer","David",""],["Kovalchuk","Serhii",""],["Hofmann","Jonathan K.",""],["Balashov","Timofey",""],["Cherepanov","Vasily",""],["Voigtländer","Bert",""],["Morawski","Ireneusz",""],["Tautz","F. Stefan",""],["Lüpke","Felix",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 11:58:42 GMT"},{"version":"v2","created":"Fri, 17 Jan 2025 10:08:45 GMT"}],"updateDate":"2025-01-20","timestamp":1734695922000,"abstract":"  A point-like defect in a uniform current-carrying conductor induces a dipole\nin the electrochemical potential, which counteracts the original transport\nfield. If the mean free path of the carriers is much smaller than the size of\nthe defect, the dipole results from the purely diffusive motion of the carriers\naround the defect. In the opposite limit, ballistic carriers scatter from the\ndefect $-$ for this situation Rolf Landauer postulated the emergence of a\nresidual resistivity dipole (RRD) that is independent of the defect size and\nthus imposes a fundamental limit on the resistance of the parent conductor in\nthe presence of defects. Here, we study resistivity dipoles around holes of\ndifferent sizes in two-dimensional Bi films on Si(111). Using scanning\ntunneling potentiometry to image the dipoles in real space, we find a\ntransition from linear to constant scaling behavior for small hole sizes,\nmanifesting the transition from diffusive to Landauer dipoles. The extracted\nparameters of the transition allow us to estimate the Fermi wave vector and the\ncarrier mean free path in our Bi films.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-IUhqufoiVAFd6cThrBCdzHrn-mPoYW4eQNDeurIBBo","pdfSize":"9120169"}