{"id":"2412.10030","title":"A Relativistic Tensorial Model for Fractional Interaction between Dark\n  Matter and Gravity","authors":"Francesco Benetti, Andrea Lapi, Samuele Silveravalle, Stefano\n  Liberati, Balakrishna S. Haridasu, Yacer Boumechta, Minahil Adil Butt, Carlo\n  Baccigalupi","authorsParsed":[["Benetti","Francesco",""],["Lapi","Andrea",""],["Silveravalle","Samuele",""],["Liberati","Stefano",""],["Haridasu","Balakrishna S.",""],["Boumechta","Yacer",""],["Butt","Minahil Adil",""],["Baccigalupi","Carlo",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 10:42:53 GMT"}],"updateDate":"2024-12-16","timestamp":1734086573000,"abstract":"  In a series of recent papers it was shown that several aspects of Dark Matter\n(DM) phenomenology, such as the velocity profiles of individual dwarfs and\nspiral galaxies, the scaling relations observed in the latter, and the pressure\nand density profiles of galaxy clusters, can be explained by assuming the DM\ncomponent in virialized halos to feel a non-local fractional interaction\nmediated by gravity. Motivated by the remarkable success of this model, in a\nrecent work we have looked for a general relativistic extension, proposing a\ntheory, dubbed Relativistic Scalar Fractional Gravity or RSFG, in which the\ntrace of the DM stress-energy tensor couples to the scalar curvature via a\nnon-local operator constructed with a fractional power of the d'Alembertian. In\nthis work we construct an extension of that model in which also a non-local\ncoupling between the Ricci tensor and the DM stress energy tensor is present.\nIn the action we encode the normalization between these scalar and tensorial\nterm into two operators $F_0(\\Box)$ and $F_2(\\Box)$, and we derive the general\nfield equations. We then take the weak field limit of the latter, showing that\nthey reduce to general relativity sourced by an effective stress energy tensor,\nfeaturing a non local isotropic pressure and anisotropic stress, even if one\nstarts with the assumption of a pressureless DM fluid. Finally, after having\nworked out the lensing theory in our setup, we test particularly interesting\nrealizations of our framework against the measured convergence profiles of the\nindividual and stacked clusters of the CLASH sample, finding remarkable\nconsistency with the data.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"qVJqUU4srq7YFxxuU9n_pVa21tUIqmsH95YFyMW5gZU","pdfSize":"1347320"}