{"id":"2412.13599","title":"Unlocking the Potential of Weakly Labeled Data: A Co-Evolutionary\n  Learning Framework for Abnormality Detection and Report Generation","authors":"Jinghan Sun, Dong Wei, Zhe Xu, Donghuan Lu, Hong Liu, Hong Wang,\n  Sotirios A. Tsaftaris, Steven McDonagh, Yefeng Zheng, Liansheng Wang","authorsParsed":[["Sun","Jinghan",""],["Wei","Dong",""],["Xu","Zhe",""],["Lu","Donghuan",""],["Liu","Hong",""],["Wang","Hong",""],["Tsaftaris","Sotirios A.",""],["McDonagh","Steven",""],["Zheng","Yefeng",""],["Wang","Liansheng",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 08:31:26 GMT"}],"updateDate":"2024-12-19","timestamp":1734510686000,"abstract":"  Anatomical abnormality detection and report generation of chest X-ray (CXR)\nare two essential tasks in clinical practice. The former aims at localizing and\ncharacterizing cardiopulmonary radiological findings in CXRs, while the latter\nsummarizes the findings in a detailed report for further diagnosis and\ntreatment. Existing methods often focused on either task separately, ignoring\ntheir correlation. This work proposes a co-evolutionary abnormality detection\nand report generation (CoE-DG) framework. The framework utilizes both fully\nlabeled (with bounding box annotations and clinical reports) and weakly labeled\n(with reports only) data to achieve mutual promotion between the abnormality\ndetection and report generation tasks. Specifically, we introduce a\nbi-directional information interaction strategy with generator-guided\ninformation propagation (GIP) and detector-guided information propagation\n(DIP). For semi-supervised abnormality detection, GIP takes the informative\nfeature extracted by the generator as an auxiliary input to the detector and\nuses the generator's prediction to refine the detector's pseudo labels. We\nfurther propose an intra-image-modal self-adaptive non-maximum suppression\nmodule (SA-NMS). This module dynamically rectifies pseudo detection labels\ngenerated by the teacher detection model with high-confidence predictions by\nthe student.Inversely, for report generation, DIP takes the abnormalities'\ncategories and locations predicted by the detector as input and guidance for\nthe generator to improve the generated reports.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9iockUngS5QsNBVzQ_c5zRax5bc4a5dUSbr2TSfGmbU","pdfSize":"1965574"}