{
  "id": "2412.03582",
  "title": "Exploring Non-Linear Effects of Built Environment on Travel Using an\n  Integrated Machine Learning and Inferential Modeling Approach: A Three-Wave\n  Repeated Cross-Sectional Study",
  "authors": "Niaz Mahmud Zafri and Ming Zhang",
  "authorsParsed": [
    [
      "Zafri",
      "Niaz Mahmud",
      ""
    ],
    [
      "Zhang",
      "Ming",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 19 Nov 2024 04:23:14 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1731990194000,
  "abstract": "  This study investigates the dynamic relationship between the built\nenvironment and travel in Austin, Texas, over a 20-year period. Using three\nwaves of household travel surveys from 1997, 2006, and 2017, the research\nemploys a repeated cross-sectional approach to address the limitations of\ntraditional longitudinal and cross-sectional studies. Methodologically, it\nintegrates machine learning and inferential modeling to uncover non-linear\nrelationships and threshold effects of built environment characteristics on\ntravel. Findings reveal that the built environment serves as a sustainable tool\nfor managing travel in the long term, contributing 50% or more to the total\nfeature importance in predicting individual travel-surpassing the combined\neffects of personal and household characteristics. Increased transit\naccessibility, local and regional destination accessibility, population and\nemployment density, and diversity significantly reduce travel, particularly\nwithin their identified thresholds, though the magnitude of their influence\nvaries across time periods. These findings highlight the potential of smart\ngrowth policies-such as expanding transit accessibility, promoting high-density\nand mixed-use development, and discouraging single-use development and\nperipheral sprawl-as effective strategies to reduce car dependency and manage\ntravel demand.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Machine Learning",
    "Statistics/Applications"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "y3T-mujIjbl4aT0DF3dvcZSsChtTRusJfNeznZlo1Sc",
  "pdfSize": "1405712"
}