{"id":"2412.10419","title":"Personalized and Sequential Text-to-Image Generation","authors":"Ofir Nabati, Guy Tennenholtz, ChihWei Hsu, Moonkyung Ryu, Deepak\n  Ramachandran, Yinlam Chow, Xiang Li, Craig Boutilier","authorsParsed":[["Nabati","Ofir",""],["Tennenholtz","Guy",""],["Hsu","ChihWei",""],["Ryu","Moonkyung",""],["Ramachandran","Deepak",""],["Chow","Yinlam",""],["Li","Xiang",""],["Boutilier","Craig",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 01:47:40 GMT"}],"updateDate":"2024-12-17","timestamp":1733795260000,"abstract":"  We address the problem of personalized, interactive text-to-image (T2I)\ngeneration, designing a reinforcement learning (RL) agent which iteratively\nimproves a set of generated images for a user through a sequence of prompt\nexpansions. Using human raters, we create a novel dataset of sequential\npreferences, which we leverage, together with large-scale open-source\n(non-sequential) datasets. We construct user-preference and user-choice models\nusing an EM strategy and identify varying user preference types. We then\nleverage a large multimodal language model (LMM) and a value-based RL approach\nto suggest a personalized and diverse slate of prompt expansions to the user.\nOur Personalized And Sequential Text-to-image Agent (PASTA) extends T2I models\nwith personalized multi-turn capabilities, fostering collaborative co-creation\nand addressing uncertainty or underspecification in a user's intent. We\nevaluate PASTA using human raters, showing significant improvement compared to\nbaseline methods. We also release our sequential rater dataset and simulated\nuser-rater interactions to support future research in personalized, multi-turn\nT2I generation.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence","Computer Science/Computation and Language","Computer Science/Machine Learning","Computer Science/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hX9HtybG7f0-4crH4EnM-YDDcWEcnDrkfoE-swwpUMM","pdfSize":"42416042"}