{
  "id": "2412.04624",
  "title": "The lithium-rich giant stars puzzle: New observational trends for a\n  general-mass-loss scenario",
  "authors": "R. de la Reza",
  "authorsParsed": [
    [
      "de la Reza",
      "R.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 21:38:46 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733434726000,
  "abstract": "  The existence of one percent of lithium-rich giant stars among normal,\nlithium-poor giant stars continues to be poorly explained. By merging two\ncatalogues, one containing 10,535 lithium-rich giant stars with lithium\nabundances ranging from 1.5 to 4.9 dex, and the other detecting infrared\nsources, we have found 421 clump giant stars and 196 first-ascending giant\nstars with infrared excesses indicating stellar mass losses. The clump stars\nare the most lithium-rich. Approximately 5.8 percent of these stars\nepisodically lose mass in periods of approximately 10^4 years or less, while\nthe remaining stars ceased their mass loss and maintained their lithium for\nnearly 10^7 years. We propose a scenario in which all giant stars with masses\nbelow two solar masses undergo prompt lithium enrichment with mass-ejection\nepisodes. We suggest that mass loss results from internal angular-momentum\ntransport. It is possible that a transitory instability, perhaps of magnetic\norigin, rapidly transports the nuclear material responsible for the lithium\nenrichment to the stellar surface and triggers shell ejections. Additionally,\nthe strong mass loss in some lithium-rich stars during their evolution\nactivates their chromospheres, as observed in ultraviolet spectra. Furthermore,\nintense episodical mass losses in these stages led to the observable formation\nof complex organic and inorganic particles, as detected in near-infrared\nspectra. In contrast to first-ascending giant stars, helium flashes during the\nclump can contribute to additional lithium enrichment alongside the\naforementioned process. The combination of these two lithium sources may\nexplain the much higher observed lithium abundances in clump stars, as well as\ntheir observed infrared excesses. If our scenario based on a universal and\nrapid lithium enrichment episode process is correct, it could explain the\nrarity of lithium-rich giant stars.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "IPlLBCFsrnhLCoADcVZtFy_jlAtckxMkmCJmaM42mzY",
  "pdfSize": "620455"
}