{
  "id": "2412.01973",
  "title": "MPBD-LSTM: A Predictive Model for Colorectal Liver Metastases Using Time\n  Series Multi-phase Contrast-Enhanced CT Scans",
  "authors": "Xueyang Li, Han Xiao, Weixiang Weng, Xiaowei Xu, Yiyu Shi",
  "authorsParsed": [
    [
      "Li",
      "Xueyang",
      ""
    ],
    [
      "Xiao",
      "Han",
      ""
    ],
    [
      "Weng",
      "Weixiang",
      ""
    ],
    [
      "Xu",
      "Xiaowei",
      ""
    ],
    [
      "Shi",
      "Yiyu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 21:02:11 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733173331000,
  "abstract": "  Colorectal cancer is a prevalent form of cancer, and many patients develop\ncolorectal cancer liver metastasis (CRLM) as a result. Early detection of CRLM\nis critical for improving survival rates. Radiologists usually rely on a series\nof multi-phase contrast-enhanced computed tomography (CECT) scans done during\nfollow-up visits to perform early detection of the potential CRLM. These scans\nform unique five-dimensional data (time, phase, and axial, sagittal, and\ncoronal planes in 3D CT). Most of the existing deep learning models can readily\nhandle four-dimensional data (e.g., time-series 3D CT images) and it is not\nclear how well they can be extended to handle the additional dimension of\nphase. In this paper, we build a dataset of time-series CECT scans to aid in\nthe early diagnosis of CRLM, and build upon state-of-the-art deep learning\ntechniques to evaluate how to best predict CRLM. Our experimental results show\nthat a multi-plane architecture based on 3D bi-directional LSTM, which we call\nMPBD-LSTM, works best, achieving an area under curve (AUC) of 0.79. On the\nother hand, analysis of the results shows that there is still great room for\nfurther improvement.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "DtvlZr1VYK-cJu-uUudMH61X4nTnXasXjut4A9k1pN8",
  "pdfSize": "1138643"
}