{"id":"2412.14653","title":"Generation and Acceleration of Isolated-Attosecond Electron Bunch in a\n  Hollow-Channel Plasma Wakefield","authors":"Liang-Qi Zhang, Mei-Yu Si, Tong-Pu Yu, Yuan-Jie Bi and Yong-Sheng\n  Huang","authorsParsed":[["Zhang","Liang-Qi",""],["Si","Mei-Yu",""],["Yu","Tong-Pu",""],["Bi","Yuan-Jie",""],["Huang","Yong-Sheng",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 09:04:19 GMT"}],"updateDate":"2024-12-20","timestamp":1734599059000,"abstract":"  We propose a novel scheme for generating and accelerating simultaneously a\ndozen-GeV isolated attosecond electron bunch from an electron beam-driven\nhollow-channel plasma target. During the beam-target interaction, transverse\noscillations of plasma electrons are induced, and subsequently, a radiative\nwakefield is generated. Meanwhile, a large number of plasma electrons of close\nto the speed of light are injected transversely from the position of the weaker\nradiative wakefield (e.g., the half-periodic node of the radiative wakefield)\nand converge towards the center of the hollow channel, forming an isolated\nattosecond electron bunch. Then, the attosecond electron bunch is significantly\naccelerated to high energies by the radiative wakefield. It is demonstrated\ntheoretically and numerically that this scheme can efficiently generate an\nisolated attosecond electron bunch with a charge of more than 2 nC, a peak\nenergy up to 13 GeV of more than 2 times that of the driving electron beam, a\npeak divergence angle of less than 5 mmrad, a duration of 276 as, and an energy\nconversion efficiency of 36.7% as well as a high stability as compared with the\nlaser-beam drive case. Such an isolated attosecond electron bunch in the range\nof GeV would provide critical applications in ultrafast physics and high energy\nphysics, etc.\n","subjects":["Physics/Plasma Physics","Physics/Accelerator Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8FzesM5CQE5VlBpvHDMpb-IVJuNXegWI7pnm5Tw_9UY","pdfSize":"3485148"}