{
  "id": "2412.06166",
  "title": "MVD: A Multi-Lingual Software Vulnerability Detection Framework",
  "authors": "Boyu Zhang, Triet H. M. Le, M. Ali Babar",
  "authorsParsed": [
    [
      "Zhang",
      "Boyu",
      ""
    ],
    [
      "Le",
      "Triet H. M.",
      ""
    ],
    [
      "Babar",
      "M. Ali",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 02:58:10 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733713090000,
  "abstract": "  Software vulnerabilities can result in catastrophic cyberattacks that\nincreasingly threaten business operations. Consequently, ensuring the safety of\nsoftware systems has become a paramount concern for both private and public\nsectors. Recent literature has witnessed increasing exploration of\nlearning-based approaches for software vulnerability detection. However, a key\nlimitation of these techniques is their primary focus on a single programming\nlanguage, such as C/C++, which poses constraints considering the polyglot\nnature of modern software projects. Further, there appears to be an oversight\nin harnessing the synergies of vulnerability knowledge across varied languages,\npotentially underutilizing the full capabilities of these methods. To address\nthe aforementioned issues, we introduce MVD - an innovative multi-lingual\nvulnerability detection framework. This framework acquires the ability to\ndetect vulnerabilities across multiple languages by concurrently learning from\nvulnerability data of various languages, which are curated by our specialized\npipeline. We also incorporate incremental learning to enable the detection\ncapability of MVD to be extended to new languages, thus augmenting its\npractical utility. Extensive experiments on our curated dataset of more than\n11K real-world multi-lingual vulnerabilities substantiate that our framework\nsignificantly surpasses state-of-the-art methods in multi-lingual vulnerability\ndetection by 83.7% to 193.6% in PR-AUC. The results also demonstrate that MVD\ndetects vulnerabilities well for new languages without compromising the\ndetection performance of previously trained languages, even when training data\nfor the older languages is unavailable. Overall, our findings motivate and pave\nthe way for the prediction of multi-lingual vulnerabilities in modern software\nsystems.\n",
  "subjects": [
    "Computer Science/Software Engineering",
    "Computer Science/Cryptography and Security",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "YoLQXg3BgCHLpGB2qqR1WagO4_xF_RsLpxZArJaEuyU",
  "pdfSize": "523167"
}