{"id":"2412.03751","title":"MOGLI: Model for Multiphase Gas using Multifluid hydrodynamics","authors":"Hitesh Kishore Das, Max Gronke, Rainer Weinberger","authorsParsed":[["Das","Hitesh Kishore",""],["Gronke","Max",""],["Weinberger","Rainer",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 22:44:04 GMT"}],"updateDate":"2024-12-06","timestamp":1733352244000,"abstract":"  Multiphase gas, with hot ($\\sim10^6$K) and cold ($\\sim10^4$K) gas, is\nubiquitous in astrophysical media across a wide range of scales. However,\nsimulating multiphase gas has been a long-standing challenge, due to the large\nseparation between the size of cold gas structures and the scales at which such\ngas impacts the evolution of associated systems. In this study, we introduce a\nnew subgrid framework for such multiphase gas, MOGLI: Model for Multiphase Gas\nusing Multifluid hydrodynamics, in multifluid AREPO. We develop this approach\nbased on first principles and theoretical results from previous studies with\nresolved small-scale simulations, leading to a minimal number of free\nparameters in the formulation. We divide the interactions in the model into\nthree sources: drag, turbulent mixing and cold gas growth. As part of the\nmodel, we also include two methods for estimating the local turbulent\nvelocities, one using the Kolmogorov scaling, and the other using the local\nvelocity gradients. We verify the different components of the framework through\nextensive comparison with benchmark single-fluid simulations across different\nsimulation parameters, such as how resolved the cold gas is initially, the\nturbulent Mach number, spatial resolution, and random initialisation of\nturbulence. We test the complete scheme and a reduced version, with and without\ncold gas growth. We find a very good qualitative and quantitative agreement\nacross the different simulation parameters and diagnostics for both local\nturbulent velocity estimation methods. We also reproduce behaviour like the\ncold gas survival criteria as an emergent property. We discuss the applications\nand possible extensions of MOGLI and demonstrate its capability by running a\nsimulation which would be computationally prohibitive to run as a resolved\nsingle-fluid simulation.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xWAurPkphtJcujfLJ9O0yJYjJK_9eYpSu2rDoaeuepE","pdfSize":"12260541"}