{
  "id": "2412.03161",
  "title": "Physics-Informed Deep Inverse Operator Networks for Solving PDE Inverse\n  Problems",
  "authors": "Sung Woong Cho, Hwijae Son",
  "authorsParsed": [
    [
      "Cho",
      "Sung Woong",
      ""
    ],
    [
      "Son",
      "Hwijae",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 09:38:58 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 7 Feb 2025 09:56:51 GMT"
    }
  ],
  "updateDate": "2025-02-10",
  "timestamp": 1733305138000,
  "abstract": "  Inverse problems involving partial differential equations (PDEs) can be seen\nas discovering a mapping from measurement data to unknown quantities, often\nframed within an operator learning approach. However, existing methods\ntypically rely on large amounts of labeled training data, which is impractical\nfor most real-world applications. Moreover, these supervised models may fail to\ncapture the underlying physical principles accurately. To address these\nlimitations, we propose a novel architecture called Physics-Informed Deep\nInverse Operator Networks (PI-DIONs), which can learn the solution operator of\nPDE-based inverse problems without labeled training data. We extend the\nstability estimates established in the inverse problem literature to the\noperator learning framework, thereby providing a robust theoretical foundation\nfor our method. These estimates guarantee that the proposed model, trained on a\nfinite sample and grid, generalizes effectively across the entire domain and\nfunction space. Extensive experiments are conducted to demonstrate that\nPI-DIONs can effectively and accurately learn the solution operators of the\ninverse problems without the need for labeled data.\n",
  "subjects": [
    "Mathematics/Numerical Analysis",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Numerical Analysis"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "9U67b77NaUMo-pt1JwTtWClUfwSKvult3k5icJXRm2k",
  "pdfSize": "2176391"
}