{
  "id": "2412.15943",
  "title": "Extraordinary oxidation behavior of W-Zr thin-film metallic glasses: A\n  route for tailoring functional properties of W-Zr-O films",
  "authors": "Petr Zeman, Michaela \\v{C}erven\\'a, Ji\\v{r}\\'i Hou\\v{s}ka, Stanislav\n  Haviar, Ji\\v{r}\\'i Rezek, \\v{S}\\'arka Zuzjakov\\'a",
  "authorsParsed": [
    [
      "Zeman",
      "Petr",
      ""
    ],
    [
      "Červená",
      "Michaela",
      ""
    ],
    [
      "Houška",
      "Jiří",
      ""
    ],
    [
      "Haviar",
      "Stanislav",
      ""
    ],
    [
      "Rezek",
      "Jiří",
      ""
    ],
    [
      "Zuzjaková",
      "Šárka",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 14:37:18 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734705438000,
  "abstract": "  The oxidation behavior of W-Zr thin-film metallic glasses (TFMGs) with 32, 48\nand 61 at.% Zr, prepared by dc magnetron co-sputtering, was comprehensively\nstudied after annealing in synthetic air. The study focuses on the effect of\nthe annealing temperature (up to 600{\\deg}C) on the oxidation process, oxygen\nsaturation, structure evolution, and their subsequent impact on electrical,\noptical and mechanical properties. The findings reveal that controlled\noxidation transforms W-Zr TFMGs into amorphous ceramic W-Zr-O films with\nsubstoichiometric compositions. This is a consequence of an oxidation process\nthat does not proceed through the formation of a stoichiometric oxide layer on\nthe surface of W-Zr TFMGs, acting as a diffusion barrier against fast\noxidation, but leads to a gradual incorporation of oxygen across the film\nvolume due to thermodynamics factors. Higher Zr content accelerates the oxygen\nincorporation and its depth uniformity in the films. As a result, the\nmechanical properties are significantly enhanced achieving hardness values of\nup to 17.5 GPa at approximately 50% oxygen saturation. Simultaneously, the\nelectrical and optical properties are finely tuned with the resistivity and the\nextinction coefficient (measured at 550 nm) ranging from 1.7 to 95.7x10-4\nOhm.cm and 0.28 to 1.06, respectively.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "x2iYQrJyg9D5qHOQpP99IzncY6F84HWCCn9vX3DROak",
  "pdfSize": "1661991"
}