{"id":"2407.18109","title":"Design, manufacture and metrology of additively manufactured, metal and\n  ceramic lightweight circular mirror prototypes","authors":"Greg Lister (1), Rhys Tuck (1), Younes Chahid (1), Katherine Morris\n  (1), Richard Kotlewski (1), Scott McPhee (1), Cyril Bourgenot (2), Ken Parkin\n  (2), Mat Beardsley (3), Marta Civitani (4), Gabriele Vecchi (4), Carolyn\n  Atkins (1), (1 - UK ATC, 2 - Durham University, 3 - RAL Space, 4 - INAF\n  Brera)","authorsParsed":[["Lister","Greg",""],["Tuck","Rhys",""],["Chahid","Younes",""],["Morris","Katherine",""],["Kotlewski","Richard",""],["McPhee","Scott",""],["Bourgenot","Cyril",""],["Parkin","Ken",""],["Beardsley","Mat",""],["Civitani","Marta",""],["Vecchi","Gabriele",""],["Atkins","Carolyn",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 15:15:14 GMT"}],"updateDate":"2024-07-26","timestamp":1721920514000,"abstract":"  Spaced-based mirrors are a developing use-case for Additive Manufacturing\n(AM), the process that builds a part layer-by-layer. The increased geometric\nfreedom results in novel and advantageous designs previously unachievable.\nConventionally, mirror fabrication uses subtractive (milling & turning),\nformative (casting) and fabricative (bonding) manufacturing methods; however,\nan additive method can simplify an assembly by consolidating individual\ncomponents into one, and incorporating lattice structures and function\noptimised geometries to reduce the mass of components, which are beneficial to\nspace-based instrumentation as mass and volume are constrained. Attention must\nbe given to the printability of the design - build orientation and powder/resin\nremoval from lattices and internal cavities are challenges when designing for\nAM.\n  This paper will describe the design, manufacture and metrology of mirror\nprototypes from the Active Deployable Optical Telescope (ADOT) 6U CubeSat\nproject. The AM mirror is 52mm in diameter, 10mm deep, with a convex 100mm\nradius of curvature reflective surface and deploys telescopically on three\nbooms. The objectives of the designs were to combine the boom mounting features\ninto the mirror and to lightweight both prototypes by 50% and 70% using\ninternal, thin-walled lattices. Four final lattice designs were downselected\nthrough simulation and prototype validation. Prototypes were printed in the\naluminium alloy AlSi10Mg using powder bed fusion and fused silica using\nstereolithography. Aluminium mirrors were single point diamond turned and had\nsurface roughness measurements taken. Fused silica designs were adapted from\nthe aluminium designs and have completed printing.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sT-q_S9MyMTKlahdmWlTkG2n9m-FRBue0DBk3d0ax3g","pdfSize":"43404183","objectId":"0xc3476c4113fe509869a8f53e5127371728ae9a1268004ab031bda9bed88848a3","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
