{"id":"2407.08138","title":"How Do Developers Structure Unit Test Cases? An Empirical Study from the\n  \"AAA\" Perspective","authors":"Chenhao Wei, Lu Xiao, Tingting Yu, Sunny Wong, Abigail Clune","authorsParsed":[["Wei","Chenhao",""],["Xiao","Lu",""],["Yu","Tingting",""],["Wong","Sunny",""],["Clune","Abigail",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 02:33:02 GMT"}],"updateDate":"2024-07-12","timestamp":1720665182000,"abstract":"  The AAA pattern, i.e. arrange, act, and assert, provides a unified structure\nfor unit test cases, which benefits comprehension and maintenance. However,\nthere is little understanding regarding whether and how common real-life\ndevelopers structure unit test cases following AAA in practice. In particular,\nare there recurring anti-patterns that deviate from the AAA structure and merit\nrefactoring? And, if test cases follow the AAA structure, could they contain\ndesign flaws in the A blocks? If we propose refactoring to fix the design of\ntest cases following the AAA, how do developers receive the proposals? Do they\nfavor refactoring? If not, what are their considerations? This study presents\nan empirical study on 435 real-life unit test cases randomly selected from four\nopen-source projects. Overall, the majority (71.5%) of test cases follow the\nAAA structure. And, we observed three recurring anti-patterns that deviate from\nthe AAA structure, as well as four design flaws that may reside inside of the A\nblocks. Each issue type has its drawbacks and merits corresponding refactoring\nresolutions. We sent a total of 18 refactoring proposals as issue tickets for\nfixing these problems. We received 78% positive feedback favoring the\nrefactoring. From the rejections, we learned that return-on-investment is a key\nconsideration for developers. The findings provide insights for practitioners\nto structure unit test cases with AAA in mind, and for researchers to develop\nrelated techniques for enforcing AAA in test cases.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"1PAeMhOwMeQkKQiQcPrI9C6jujusynxJjXXe2mfpSSQ","pdfSize":"1075941","objectId":"0x371273478919188297f8ae10ee1eb566838f3f248bf51abe3502742286804b33","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
