{"id":"2407.14095","title":"People use fast, goal-directed simulation to reason about novel games","authors":"Cedegao E. Zhang, Katherine M. Collins, Lionel Wong, Adrian Weller,\n  Joshua B. Tenenbaum","authorsParsed":[["Zhang","Cedegao E.",""],["Collins","Katherine M.",""],["Wong","Lionel",""],["Weller","Adrian",""],["Tenenbaum","Joshua B.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 07:59:04 GMT"}],"updateDate":"2024-07-22","timestamp":1721375944000,"abstract":"  We can evaluate features of problems and their potential solutions well\nbefore we can effectively solve them. When considering a game we have never\nplayed, for instance, we might infer whether it is likely to be challenging,\nfair, or fun simply from hearing the game rules, prior to deciding whether to\ninvest time in learning the game or trying to play it well. Many studies of\ngame play have focused on optimality and expertise, characterizing how people\nand computational models play based on moderate to extensive search and after\nplaying a game dozens (if not thousands or millions) of times. Here, we study\nhow people reason about a range of simple but novel connect-n style board\ngames. We ask people to judge how fair and how fun the games are from very\nlittle experience: just thinking about the game for a minute or so, before they\nhave ever actually played with anyone else, and we propose a resource-limited\nmodel that captures their judgments using only a small number of partial game\nsimulations and almost no lookahead search.\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Artificial Intelligence","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CuA6Sm4yTQPrDxRZStY3qtJZyKIPrumSxAa7GZXEmKA","pdfSize":"1018558","objectId":"0x359465642d1430b4b6935bbd8a68289ebb5b3102c685deb1cd16addc69d2bdfc","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
