{"id":"2407.02336","title":"Mining Constraints from Reference Process Models for Detecting\n  Best-Practice Violations in Event Log","authors":"Adrian Rebmann, Timotheus Kampik, Carl Corea, Han van der Aa","authorsParsed":[["Rebmann","Adrian",""],["Kampik","Timotheus",""],["Corea","Carl",""],["van der Aa","Han",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 15:05:37 GMT"}],"updateDate":"2024-07-03","timestamp":1719932737000,"abstract":"  Detecting undesired process behavior is one of the main tasks of process\nmining and various conformance-checking techniques have been developed to this\nend. These techniques typically require a normative process model as input,\nspecifically designed for the processes to be analyzed. Such models are rarely\navailable, though, and their creation involves considerable manual\neffort.However, reference process models serve as best-practice templates for\norganizational processes in a plethora of domains, containing valuable\nknowledge about general behavioral relations in well-engineered processes.\nThese general models can thus mitigate the need for dedicated models by\nproviding a basis to check for undesired behavior. Still, finding a perfectly\nmatching reference model for a real-life event log is unrealistic because\norganizational needs can vary, despite similarities in process execution.\nFurthermore, event logs may encompass behavior related to different reference\nmodels, making traditional conformance checking impractical as it requires\naligning process executions to individual models. To still use reference models\nfor conformance checking, we propose a framework for mining declarative\nbest-practice constraints from a reference model collection, automatically\nselecting constraints that are relevant for a given event log, and checking for\nbest-practice violations. We demonstrate the capability of our framework to\ndetect best-practice violations through an evaluation based on real-world\nprocess model collections and event logs.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DvKgoTY5HPEbY15K9uPa879MJYKc87WLn46sE2FfZuI","pdfSize":"727499","objectId":"0x965c2da37f67808212418bfcb86c5fd02d1e24f43403c0e556238efff577c339","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
