{"id":"2407.19327","title":"Polyp segmentation in colonoscopy images using DeepLabV3++","authors":"Al Mohimanul Islam, Sadia Shakiba Bhuiyan, Mysun Mashira, Md. Rayhan\n  Ahmed, Salekul Islam and Swakkhar Shatabda","authorsParsed":[["Islam","Al Mohimanul",""],["Bhuiyan","Sadia Shakiba",""],["Mashira","Mysun",""],["Ahmed","Md. Rayhan",""],["Islam","Salekul",""],["Shatabda","Swakkhar",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 19:24:55 GMT"}],"updateDate":"2024-07-30","timestamp":1722108295000,"abstract":"  Segmenting polyps in colonoscopy images is essential for the early\nidentification and diagnosis of colorectal cancer, a significant cause of\nworldwide cancer deaths. Prior deep learning based models such as Attention\nbased variation, UNet variations and Transformer-derived networks have had\nnotable success in capturing intricate features and complex polyp shapes. In\nthis study, we have introduced the DeepLabv3++ model which is an enhanced\nversion of the DeepLabv3+ architecture. It is designed to improve the precision\nand robustness of polyp segmentation in colonoscopy images. We have utilized\nThe proposed model incorporates diverse separable convolutional layers and\nattention mechanisms within the MSPP block, enhancing its capacity to capture\nmulti-scale and directional features. Additionally, the redesigned decoder\nfurther transforms the extracted features from the encoder into a more\nmeaningful segmentation map. Our model was evaluated on three public datasets\n(CVC-ColonDB, CVC-ClinicDB, Kvasir-SEG) achieving Dice coefficient scores of\n96.20%, 96.54%, and 96.08%, respectively. The experimental analysis shows that\nDeepLabV3++ outperforms several state-of-the-art models in polyp segmentation\ntasks. Furthermore, compared to the baseline DeepLabV3+ model, our DeepLabV3++\nwith its MSPP module and redesigned decoder architecture, significantly reduced\nsegmentation errors (e.g., false positives/negatives) across small, medium, and\nlarge polyps. This improvement in polyp delineation is crucial for accurate\nclinical decision-making in colonoscopy.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bDpKNRLQ1xvYbt0BKVqAMSL3ct_AHwwlFw2PeMnD9b4","pdfSize":"6006776","objectId":"0xd29c4383b0220fd3290636bc8aa91ae9682f78ab0ad4fd9e38b08d6171e1d0bc","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
