{"id":"2407.19181","title":"Loop-string-hadron approach to SU(3) lattice Yang-Mills theory: Gauge\n  invariant Hilbert space of a trivalent vertex","authors":"Saurabh V. Kadam, Aahiri Naskar, Indrakshi Raychowdhury and Jesse R.\n  Stryker","authorsParsed":[["Kadam","Saurabh V.",""],["Naskar","Aahiri",""],["Raychowdhury","Indrakshi",""],["Stryker","Jesse R.",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 05:43:01 GMT"}],"updateDate":"2024-07-30","timestamp":1722058981000,"abstract":"  The construction of gauge invariant states of SU(3) lattice gauge theories\nhas garnered new interest in recent years, but implementing them is complicated\nby the need for SU(3) Clebsch-Gordon coefficients. In the loop-string-hadron\n(LSH) approach to lattice gauge theories, the elementary excitations are\nstrictly gauge invariant, and constructing the basis requires no knowledge of\nClebsch-Gordon coefficients. Originally developed for SU(2), the LSH\nformulation was recently generalized to SU(3), but limited to one spatial\ndimension. In this work, we generalize the LSH approach to constructing the\nbasis of SU(3) gauge invariant states at a trivalent vertex - the essential\nbuilding block to multidimensional space. A direct generalization from the\nSU(2) vertex yields a legitimate basis; however, in certain sectors of the\nHilbert space, the naive LSH basis vectors so defined suffer from being\nnonorthogonal. The issues with orthogonality are directly related to the\n`missing label' or `outer multiplicity' problem associated with SU(3) tensor\nproducts, and may also be phrased in terms of Littlewood-Richardson\ncoefficients or the need for a `seventh Casimir' operator. The states that are\nunaffected by the problem are orthonormalized in closed form. For the sectors\nthat are afflicted, we discuss the nonorthogonal bases and their\northogonalization. A few candidates for seventh Casimir operators are readily\nconstructed from the suite of LSH gauge-singlet operators. The diagonalization\nof a seventh Casimir represents one prescriptive solution towards obtaining a\ncomplete orthonormal basis, but a closed-form general solution remains to be\nfound.\n","subjects":["Physics/High Energy Physics - Lattice"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VnmI723domBPKIZsEV1UbNdTTSghNeCDCxonFujJOpM","pdfSize":"810080","objectId":"0xb52c7d2af9ed9de3f7e3190429b920071175ff7ae27a931536c49402f81b257d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
