{"id":"2407.16463","title":"Advances in Land Surface Model-based Forecasting: A comparative study of\n  LSTM, Gradient Boosting, and Feedforward Neural Network Models as prognostic\n  state emulators","authors":"Marieke Wesselkamp, Matthew Chantry, Ewan Pinnington, Margarita\n  Choulga, Souhail Boussetta, Maria Kalweit, Joschka Boedecker, Carsten F.\n  Dormann, Florian Pappenberger, Gianpaolo Balsamo","authorsParsed":[["Wesselkamp","Marieke",""],["Chantry","Matthew",""],["Pinnington","Ewan",""],["Choulga","Margarita",""],["Boussetta","Souhail",""],["Kalweit","Maria",""],["Boedecker","Joschka",""],["Dormann","Carsten F.",""],["Pappenberger","Florian",""],["Balsamo","Gianpaolo",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 13:26:05 GMT"}],"updateDate":"2024-07-24","timestamp":1721741165000,"abstract":"  Most useful weather prediction for the public is near the surface. The\nprocesses that are most relevant for near-surface weather prediction are also\nthose that are most interactive and exhibit positive feedback or have key role\nin energy partitioning. Land surface models (LSMs) consider these processes\ntogether with surface heterogeneity and forecast water, carbon and energy\nfluxes, and coupled with an atmospheric model provide boundary and initial\nconditions. This numerical parametrization of atmospheric boundaries being\ncomputationally expensive, statistical surrogate models are increasingly used\nto accelerated progress in experimental research. We evaluated the efficiency\nof three surrogate models in speeding up experimental research by simulating\nland surface processes, which are integral to forecasting water, carbon, and\nenergy fluxes in coupled atmospheric models. Specifically, we compared the\nperformance of a Long-Short Term Memory (LSTM) encoder-decoder network, extreme\ngradient boosting, and a feed-forward neural network within a physics-informed\nmulti-objective framework. This framework emulates key states of the ECMWF's\nIntegrated Forecasting System (IFS) land surface scheme, ECLand, across\ncontinental and global scales. Our findings indicate that while all models on\naverage demonstrate high accuracy over the forecast period, the LSTM network\nexcels in continental long-range predictions when carefully tuned, the XGB\nscores consistently high across tasks and the MLP provides an excellent\nimplementation-time-accuracy trade-off. The runtime reduction achieved by the\nemulators in comparison to the full numerical models are significant, offering\na faster, yet reliable alternative for conducting numerical experiments on land\nsurfaces.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9_BBHSJyIBuaj5I1bXkqYOq36492xRlj2BR7mI6OVkw","pdfSize":"39585931","objectId":"0x112613267e056906dca2200fe7e6bc7afe034ee56b1faca9a5b97d190b8d6261","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
