{"id":"2407.00763","title":"Time Index Modulation-Driven Standalone RIS Mechanism for Symbiotic\n  Radio","authors":"M. Ertug Pihtili, Mehmet C. Ilter, Ertugrul Basar","authorsParsed":[["Pihtili","M. Ertug",""],["Ilter","Mehmet C.",""],["Basar","Ertugrul",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 16:52:22 GMT"}],"updateDate":"2024-07-02","timestamp":1719766342000,"abstract":"  The rising demand for energy and spectrum resources in next-generation\nInternet-of-things (IoT) systems accounts for innovative modes of information\nand power transfer. One potential solution is to harness the active\ntransmission capability of devices to facilitate data transmission and wireless\nenergy harvesting (WEH) for backscatter communication so as to form a symbiotic\nradio (SR) environment in a mutualistic manner. Additionally, incorporating\nreconfigurable intelligent surfaces (RISs) into the SR environment can provide\nan additional link and enhance the reliability of backscatter communication,\nthereby reinforcing the symbiotic relationships between active and passive\ndevices. This paper proposes a novel SR system where a standalone RIS sustains\nits functions through WEH based on a low-power RIS structure and establishes\nmutualistic symbiosis by utilizing a signal conveyed by the primary transmitter\n(PTx) to assist ongoing transmissions and convey information to the primary\nreceiver (PRx). The PTx employs time index modulation (TIM) to transmit\ninformation to the PRx and power to the RIS and energy harvester (EH). A\nlog-likelihood ratio (LLR)-based detector is presented to address challenges in\nthe TIM scheme. Finally, the performance of the proposed scheme is investigated\nin terms of harvested direct current (DC) power at the RIS and EH, as well as\nthe bit error rate (BER) at the PRx.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Iru3upzDElrWyPl6tpuD432aBBcSYq6BR_xg0U9eAkg","pdfSize":"1348394","objectId":"0xe17761c62dbe2889114c2dc170cfacce666847b41ef01f469b211bf9222e31b7","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
