{"id":"2407.07339","title":"TDML -- A Trustworthy Distributed Machine Learning Framework","authors":"Zhen Wang, Qin Wang, Guangsheng Yu and Shiping Chen","authorsParsed":[["Wang","Zhen",""],["Wang","Qin",""],["Yu","Guangsheng",""],["Chen","Shiping",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 03:22:28 GMT"}],"updateDate":"2024-07-11","timestamp":1720581748000,"abstract":"  Recent years have witnessed a surge in deep learning research, marked by the\nintroduction of expansive generative models like OpenAI's SORA and GPT, Meta\nAI's LLAMA series, and Google's FLAN, BART, and Gemini models. However, the\nrapid advancement of large models (LM) has intensified the demand for computing\nresources, particularly GPUs, which are crucial for their parallel processing\ncapabilities. This demand is exacerbated by limited GPU availability due to\nsupply chain delays and monopolistic acquisition by major tech firms.\nDistributed Machine Learning (DML) methods, such as Federated Learning (FL),\nmitigate these challenges by partitioning data and models across multiple\nservers, though implementing optimizations like tensor and pipeline parallelism\nremains complex. Blockchain technology emerges as a promising solution,\nensuring data integrity, scalability, and trust in distributed computing\nenvironments, but still lacks guidance on building practical DML systems. In\nthis paper, we propose a \\textit{trustworthy distributed machine learning}\n(TDML) framework that leverages blockchain to coordinate remote trainers and\nvalidate workloads, achieving privacy, transparency, and efficient model\ntraining across public remote computing resources. Experimental validation\ndemonstrates TDML's efficacy in overcoming performance limitations and\nmalicious node detection, positioning it as a robust solution for scalable and\nsecure distributed machine learning.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"EgNsKxM7QZ_fUIEFKL97Q-LFSdjOlSxhotqfAb7iXCQ","pdfSize":"1853195","objectId":"0xf7f37a36d847988fa2a001bf559e951e81a28eea9fc3f547dc860e38bf7d0b34","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
