{"id":"2407.19927","title":"Minimum Time Consensus of Multi-agent System under Fuel Constraints","authors":"Akansha Rautela, Deepak Patil, Ameer Mulla and Indra Narayan Kar","authorsParsed":[["Rautela","Akansha",""],["Patil","Deepak",""],["Mulla","Ameer",""],["Kar","Indra Narayan",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 12:01:52 GMT"}],"updateDate":"2024-07-30","timestamp":1722254512000,"abstract":"  This work addresses the problem of finding a consensus point in the state\nspace ($\\mathbb{R}^2$) for a multi-agent system that is comprised of $N$\nidentical double integrator agents. It is assumed that each agent operates\nunder constrained control input (i.e., $|u_i(t)| \\leq 1$ $\\forall i = 1, \\hdots\nN$). Further, a fixed fuel budget is also assumed i.e., the total amount of\ncumulative input that can be expended is limited by $\\int_0^{t_f}|u(t)|dt \\le\n\\beta$. First, the attainable set $\\mathcal{A}(t,x_0,\\beta)$ at time $t$, which\nis the set of all states that an agent can attain starting from initial\nconditions $x_0$ under the fuel budget constraints at time $t$ is computed for\nevery agent. This attainable set is a convex set for all $t\\ge0$. Then the\nminimum time to consensus is the minimum time $\\bar{t}$ at which attainable\nsets of all agents intersect, and the consensus point is the point of\nintersection. A closed-form expression for the minimum time consensus point is\nprovided for the case of three agents. Then, using Helly's theorem, the\nintersection will be non-empty at a time when all the $N \\choose 3$ triplets of\nagents have non-empty intersection. The computation of minimum time consensus\nfor all $N \\choose 3$ triplets is performed independently and can be\ndistributed among all the $N$ agents. Finally, the overall minimum time to\nconsensus is given by the triplet that has the highest minimum time to\nconsensus. Further, the intersection of all the attainable sets of this triplet\ngives the minimum time consensus point for all $N$ agents.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"lcUGJCDbfiXobYPgQ3gyVoFsTAu3sBCzXnMblt0ULkQ","pdfSize":"463028","objectId":"0x6b5bb746a486a20e11c9b0017f8a8f44597d706792930c70ba006cc8727ef624","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
