{"id":"2407.05754","title":"Can We Benefit from Reconfigurable Intelligent Surfaces in Upper\n  Mid-Band 6G Networks? A Critical Look for Promising Use Cases","authors":"Ferdi Kara, \\\"Ozlem Tu\\u{g}fe Demir, Emil Bj\\\"ornson","authorsParsed":[["Kara","Ferdi",""],["Demir","Özlem Tuğfe",""],["Björnson","Emil",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 09:05:37 GMT"}],"updateDate":"2024-07-09","timestamp":1720429537000,"abstract":"  The upper mid-band frequencies (i.e., 7-24,GHz) are regarded as the golden\nbands for the sixth-generation (6G) wireless communication systems, combining\ngood coverage, much new spectrum, and many antennas in compact form factors.\nThe first 6G networks will most likely use this band. There is much prior work\non channel modeling, coexistence, and possible implementation scenarios in\nthese bands. On the other hand, the use of reconfigurable intelligent surfaces\n(RISs) has not yet been examined in these bands, even if this transformative\ntechnology has generally garnered considerable attention in recent years for\nits ability to enhance spectral efficiency, coverage, and reliability of\nwireless channels. There are significant frequency-specific challenges related\nto RIS deployment, use cases, number of required elements, channel estimation,\nand control. These are previously unaddressed for the upper mid-band. In this\npaper, we aim to bridge this gap by exploring various use cases, including\nRIS-assisted fixed wireless access (FWA), enhanced capacity in mobile\ncommunications, and increased reliability at the cell edge. We identify the\nconditions under which RIS can provide major benefits and optimal strategies\nfor deploying RIS to enhance the performance of 6G upper mid-band communication\nsystems.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"Vkd8_JStsTqMtqyxIt0X6m5odVoPjT8Vs4kRjFkFA_0","pdfSize":"2999446"}
