{"id":"2407.03486","title":"Celeb-FBI: A Benchmark Dataset on Human Full Body Images and Age,\n  Gender, Height and Weight Estimation using Deep Learning Approach","authors":"Pronay Debnath, Usafa Akther Rifa, Busra Kamal Rafa, Ali Haider\n  Talukder Akib, Md. Aminur Rahman","authorsParsed":[["Debnath","Pronay",""],["Rifa","Usafa Akther",""],["Rafa","Busra Kamal",""],["Akib","Ali Haider Talukder",""],["Rahman","Md. Aminur",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 20:16:47 GMT"}],"updateDate":"2024-07-08","timestamp":1720037807000,"abstract":"  The scarcity of comprehensive datasets in surveillance, identification, image\nretrieval systems, and healthcare poses a significant challenge for researchers\nin exploring new methodologies and advancing knowledge in these respective\nfields. Furthermore, the need for full-body image datasets with detailed\nattributes like height, weight, age, and gender is particularly significant in\nareas such as fashion industry analytics, ergonomic design assessment, virtual\nreality avatar creation, and sports performance analysis. To address this gap,\nwe have created the 'Celeb-FBI' dataset which contains 7,211 full-body images\nof individuals accompanied by detailed information on their height, age,\nweight, and gender. Following the dataset creation, we proceed with the\npreprocessing stages, including image cleaning, scaling, and the application of\nSynthetic Minority Oversampling Technique (SMOTE). Subsequently, utilizing this\nprepared dataset, we employed three deep learning approaches: Convolutional\nNeural Network (CNN), 50-layer ResNet, and 16-layer VGG, which are used for\nestimating height, weight, age, and gender from human full-body images. From\nthe results obtained, ResNet-50 performed best for the system with an accuracy\nrate of 79.18% for age, 95.43% for gender, 85.60% for height and 81.91% for\nweight.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xF_ILOV5p0iPtNIZLSdhIS4VWq1YUsW8rBdoIo9SV4Y","pdfSize":"1867834"}
