{"id":"2407.01081","title":"CVLUE: A New Benchmark Dataset for Chinese Vision-Language Understanding\n  Evaluation","authors":"Yuxuan Wang, Yijun Liu, Fei Yu, Chen Huang, Kexin Li, Zhiguo Wan,\n  Wanxiang Che","authorsParsed":[["Wang","Yuxuan",""],["Liu","Yijun",""],["Yu","Fei",""],["Huang","Chen",""],["Li","Kexin",""],["Wan","Zhiguo",""],["Che","Wanxiang",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:35:37 GMT"}],"updateDate":"2024-07-02","timestamp":1719822937000,"abstract":"  Despite the rapid development of Chinese vision-language models (VLMs), most\nexisting Chinese vision-language (VL) datasets are constructed on\nWestern-centric images from existing English VL datasets. The cultural bias in\nthe images makes these datasets unsuitable for evaluating VLMs in Chinese\nculture. To remedy this issue, we present a new Chinese Vision- Language\nUnderstanding Evaluation (CVLUE) benchmark dataset, where the selection of\nobject categories and images is entirely driven by Chinese native speakers,\nensuring that the source images are representative of Chinese culture. The\nbenchmark contains four distinct VL tasks ranging from image-text retrieval to\nvisual question answering, visual grounding and visual dialogue. We present a\ndetailed statistical analysis of CVLUE and provide a baseline performance\nanalysis with several open-source multilingual VLMs on CVLUE and its English\ncounterparts to reveal their performance gap between English and Chinese. Our\nin-depth category-level analysis reveals a lack of Chinese cultural knowledge\nin existing VLMs. We also find that fine-tuning on Chinese culture-related VL\ndatasets effectively enhances VLMs' understanding of Chinese culture.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Nmo5Z8IH7h1dtyVsEI-E_M_u2gRbGO9gyin0d7hndck","pdfSize":"13302626","objectId":"0x352eab11ee0a348a86029998939aa4d89bd5fa0e082b8944c8b7df4fe1b12bf1","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
