{"id":"2407.03728","title":"Measuring Orthogonality in Representations of Generative Models","authors":"Robin C. Geyer, Alessandro Torcinovich, Jo\\~ao B. Carvalho, Alexander\n  Meyer, Joachim M. Buhmann","authorsParsed":[["Geyer","Robin C.",""],["Torcinovich","Alessandro",""],["Carvalho","João B.",""],["Meyer","Alexander",""],["Buhmann","Joachim M.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 08:21:54 GMT"}],"updateDate":"2024-07-08","timestamp":1720081314000,"abstract":"  In unsupervised representation learning, models aim to distill essential\nfeatures from high-dimensional data into lower-dimensional learned\nrepresentations, guided by inductive biases. Understanding the characteristics\nthat make a good representation remains a topic of ongoing research.\nDisentanglement of independent generative processes has long been credited with\nproducing high-quality representations. However, focusing solely on\nrepresentations that adhere to the stringent requirements of most\ndisentanglement metrics, may result in overlooking many high-quality\nrepresentations, well suited for various downstream tasks. These metrics often\ndemand that generative factors be encoded in distinct, single dimensions\naligned with the canonical basis of the representation space.\n  Motivated by these observations, we propose two novel metrics:\nImportance-Weighted Orthogonality (IWO) and Importance-Weighted Rank (IWR).\nThese metrics evaluate the mutual orthogonality and rank of generative factor\nsubspaces. Throughout extensive experiments on common downstream tasks, over\nseveral benchmark datasets and models, IWO and IWR consistently show stronger\ncorrelations with downstream task performance than traditional disentanglement\nmetrics. Our findings suggest that representation quality is closer related to\nthe orthogonality of independent generative processes rather than their\ndisentanglement, offering a new direction for evaluating and improving\nunsupervised learning models.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HfaXwmhb8v0f7zlUmq8_7wbqXytUzqjZaLpgWnQaf2w","pdfSize":"2477750"}
