{"id":"2407.00939","title":"Modified CMA-ES Algorithm for Multi-Modal Optimization: Incorporating\n  Niching Strategies and Dynamic Adaptation Mechanism","authors":"Wathsala Karunarathne, Indu Bala, Dikshit Chauhan, Matthew Roughan and\n  Lewis Mitchell","authorsParsed":[["Karunarathne","Wathsala",""],["Bala","Indu",""],["Chauhan","Dikshit",""],["Roughan","Matthew",""],["Mitchell","Lewis",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 03:41:39 GMT"}],"updateDate":"2024-07-02","timestamp":1719805299000,"abstract":"  This study modifies the Covariance Matrix Adaptation Evolution Strategy\n(CMA-ES) algorithm for multi-modal optimization problems. The enhancements\nfocus on addressing the challenges of multiple global minima, improving the\nalgorithm's ability to maintain diversity and explore complex fitness\nlandscapes. We incorporate niching strategies and dynamic adaptation mechanisms\nto refine the algorithm's performance in identifying and optimizing multiple\nglobal optima. The algorithm generates a population of candidate solutions by\nsampling from a multivariate normal distribution centered around the current\nmean vector, with the spread determined by the step size and covariance matrix.\nEach solution's fitness is evaluated as a weighted sum of its contributions to\nall global minima, maintaining population diversity and preventing premature\nconvergence. We implemented the algorithm on 8 tunable composite functions for\nthe GECCO 2024 Competition on Benchmarking Niching Methods for Multi-Modal\nOptimization (MMO), adhering to the competition's benchmarking framework. The\nresults are presenting in many ways such as Peak Ratio, F1 score on various\ndimensions. They demonstrate the algorithm's robustness and effectiveness in\nhandling both global optimization and MMO- specific challenges, providing a\ncomprehensive solution for complex multi-modal optimization problems.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MnbZqIQh6vo7Us3-Gzux0VOM8OEqzVn-wGoDbgntUwo","pdfSize":"866349","objectId":"0x2dc82e04ab3d0cc3a521c4df0aa3955e8ffceeb4099af27cf718a8a305390b90","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
