{"id":"2407.12272","title":"Assessing the Feasibility, and Efficacy of Virtual Reality Navigational\n  Training for Older Adults","authors":"Tong Bill Xu, Armin Mostafavi, Walter R. Boot, Sara Czaja, Saleh\n  Kalantari","authorsParsed":[["Xu","Tong Bill",""],["Mostafavi","Armin",""],["Boot","Walter R.",""],["Czaja","Sara",""],["Kalantari","Saleh",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 02:40:32 GMT"}],"updateDate":"2024-07-18","timestamp":1721184032000,"abstract":"  Objective. Evaluate the feasibility of Virtual Reality (VR) wayfinding\ntraining with aging adults, and examine the impact of the training on\nwayfinding performance. Design. Design involved wayfinding tasks in a study\nwith three groups: active VR training, passive video training, and no training,\nassigned randomly. The training featured 5 tasks in a digital version of a real\nbuilding. Post-training assessments had 10 tasks in this building, half\nfamiliar from training and half new. The study was double-blinded, with each\nintervention lasting 10 minutes. Participants. A convenience sample of 49\nparticipants; inclusion criteria: age >58, unfamiliar with the building;\nexclusion criteria: mobility or vision impairments, history of motion sickness,\nor medical implants. Outcomes. Time spent and Distance traveled on each\nwayfinding task with a fixed 10-min limit. Results. Participants in VR group\nreported moderate usability (63.82, SD=14.55) with respect to the training\nintervention and high Self Location (3.71, SD=0.94). There were no differences\nin task performance among the groups in the similar tasks. In the new tasks,\ncompared to the control condition, Time spent on tasks was marginally\nsignificantly reduced in the VR group; Distance traveled to finish tasks was\nalso reduced in the VR group, and marginally significantly reduced in the Video\ntraining group. No differences were found between VR and Video conditions. No\nadverse effects were reported during or post intervention. Conclusions. This\nstudy provides preliminary evidence that VR training can effectively improve\nwayfinding performance in older adults with no reported adverse effect.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BpkG3I2NCQDHoMMe94lp3D0AUDXbZfiESrXV7uxnXNg","pdfSize":"2983901","objectId":"0xd2eff93c2a756f5e4cb39de84440170f7d89da25994e83548a7ff132f727cc16","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
