{"id":"2407.09974","title":"To what extent is ChatGPT useful for language teacher lesson plan\n  creation?","authors":"Alex Dornburg and Kristin Davin","authorsParsed":[["Dornburg","Alex",""],["Davin","Kristin",""]],"versions":[{"version":"v1","created":"Thu, 25 Apr 2024 12:00:03 GMT"}],"updateDate":"2024-07-16","timestamp":1714046403000,"abstract":"  The advent of generative AI models holds tremendous potential for aiding\nteachers in the generation of pedagogical materials. However, numerous\nknowledge gaps concerning the behavior of these models obfuscate the generation\nof research-informed guidance for their effective usage. Here we assess trends\nin prompt specificity, variability, and weaknesses in foreign language teacher\nlesson plans generated by zero-shot prompting in ChatGPT. Iterating a series of\nprompts that increased in complexity, we found that output lesson plans were\ngenerally high quality, though additional context and specificity to a prompt\ndid not guarantee a concomitant increase in quality. Additionally, we observed\nextreme cases of variability in outputs generated by the same prompt. In many\ncases, this variability reflected a conflict between 20th century versus 21st\ncentury pedagogical practices. These results suggest that the training of\ngenerative AI models on classic texts concerning pedagogical practices may\nrepresent a currently underexplored topic with the potential to bias generated\ncontent towards teaching practices that have been long refuted by research.\nCollectively, our results offer immediate translational implications for\npracticing and training foreign language teachers on the use of AI tools. More\nbroadly, these findings reveal the existence of generative AI output trends\nthat have implications for the generation of pedagogical materials across a\ndiversity of content areas.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_YhmBMNlV37vGpuFpXdyY9Wn6UYY4WXS9i0KSd198gc","pdfSize":"593261","objectId":"0x6b56f51504fc396eaaba10d8538e3ce5cc11138b14a587e26295882e22af66df","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
