{"id":"2407.02798","title":"Game-Based Discovery: Harnessing Mini-Games within Primary Games for\n  Scientific Data Collection and Problem Solving","authors":"Abhishek Phadke, Mamta Yadav and Stanislav Ustymenko","authorsParsed":[["Phadke","Abhishek",""],["Yadav","Mamta",""],["Ustymenko","Stanislav",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 03:58:22 GMT"}],"updateDate":"2024-07-04","timestamp":1719979102000,"abstract":"  In the popular video game Batman: Arkham Knight, produced by Rocksteady\nStudios and released in 2015, the primary protagonist of the game is Batman, a\nvigilante dressed as a bat, fighting crime from the shadows in the fictitious\ncity of Gotham. The game involves a real-world player who takes up the role of\nBatman to solve a peculiar side mission wherein they have to reconstruct the\nclean DNA sequence of a human and separate it from mutant DNA to manufacture an\nantidote to cure the villain. Although this is undoubtedly a fascinating part\nof the game, one that was absent in previous Batman games, it showcases an\ninteresting notion of using mini-games embedded within primary games to achieve\na particular real-world research objective. Although the DNA data used in this\ncase was not real, there are multiple such instances in video games where\nmini-games have been used for an underlying motive besides entertainment. Based\non popular case studies incorporating a similar method, this study\ncharacterizes the methodology of designing mini-games within primary games for\nresearch purposes into a descriptive framework, highlighting the process's\nadvantages and limitations. It is concluded that these mini-games not only\nfacilitate a deeper understanding of complex scientific concepts but also\naccelerate data processing and analysis by leveraging crowd-sourced human\nintuition and pattern recognition capabilities. This paper argues for\nstrategically incorporating miniaturized, gamified elements into established\nvideo games that are mainly intended for recreational purposes.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"zIYx4nK4mCeUxbtiH_ePdgwZOGvV6nFidvm1uBIISdE","pdfSize":"1250862","objectId":"0xc1b968d66b33f9a1be757d4c9d1429af5a7d71f827f82c2cf1d6308a156529da","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
