{"id":"2407.08143","title":"CommSense: A Wearable Sensing Computational Framework for Evaluating\n  Patient-Clinician Interactions","authors":"Zhiyuan Wang, Nusayer Hassan, Virginia LeBaron, Tabor E. Flickinger,\n  David Ling, James Edwards, Congyu Wu, Mehdi Boukhechba and Laura E. Barnes","authorsParsed":[["Wang","Zhiyuan",""],["Hassan","Nusayer",""],["LeBaron","Virginia",""],["Flickinger","Tabor E.",""],["Ling","David",""],["Edwards","James",""],["Wu","Congyu",""],["Boukhechba","Mehdi",""],["Barnes","Laura E.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 02:50:13 GMT"}],"updateDate":"2024-07-12","timestamp":1720666213000,"abstract":"  Quality patient-provider communication is critical to improve clinical care\nand patient outcomes. While progress has been made with communication skills\ntraining for clinicians, significant gaps exist in how to best monitor,\nmeasure, and evaluate the implementation of communication skills in the actual\nclinical setting. Advancements in ubiquitous technology and natural language\nprocessing make it possible to realize more objective, real-time assessment of\nclinical interactions and in turn provide more timely feedback to clinicians\nabout their communication effectiveness. In this paper, we propose CommSense, a\ncomputational sensing framework that combines smartwatch audio and transcripts\nwith natural language processing methods to measure selected ``best-practice''\ncommunication metrics captured by wearable devices in the context of palliative\ncare interactions, including understanding, empathy, presence, emotion, and\nclarity. We conducted a pilot study involving N=40 clinician participants, to\ntest the technical feasibility and acceptability of CommSense in a simulated\nclinical setting. Our findings demonstrate that CommSense effectively captures\nmost communication metrics and is well-received by both practicing clinicians\nand student trainees. Our study also highlights the potential for digital\ntechnology to enhance communication skills training for healthcare providers\nand students, ultimately resulting in more equitable delivery of healthcare and\naccessible, lower cost tools for training with the potential to improve patient\noutcomes.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"rB4QgOSXbHohxe7LqfyB4bp6iFEVa9WQ_1d1IRxX4BE","pdfSize":"1107408","objectId":"0x7bf9b00cbda2e0a37bf63aaeebcf0b803dfca4dd1b8509e76530a7dffc1b2561","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
