{"id":"2407.05835","title":"Clustering of conditional mutual information and quantum Markov\n  structure at arbitrary temperatures","authors":"Tomotaka Kuwahara","authorsParsed":[["Kuwahara","Tomotaka",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 11:30:12 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 08:20:47 GMT"}],"updateDate":"2024-07-23","timestamp":1720438212000,"abstract":"  Recent investigations have unveiled exotic quantum phases that elude\ncharacterization by simple bipartite correlation functions. In these phases,\nlong-range entanglement arising from tripartite correlations plays a central\nrole. Consequently, the study of multipartite correlations has become a focal\npoint in modern physics. In these, Conditional Mutual Information (CMI) is one\nof the most well-established information-theoretic measures, adept at\nencapsulating the essence of various exotic phases, including topologically\nordered ones. Within the realm of quantum many-body physics, it has been a\nlong-sought goal to establish a quantum analog to the Hammersley-Clifford\ntheorem that bridges the two concepts of the Gibbs state and the Markov\nnetwork. This theorem posits that the correlation length of CMI remains\nshort-range across all thermal equilibrium quantum phases. In this work, we\ndemonstrate that CMI exhibits exponential decay concerning distance, with its\ncorrelation length increasing polynomially with the inverse temperature. While\nthis clustering theorem has previously been established for high temperatures\ndevoid of thermal phase transitions, it has remained elusive at low\ntemperatures, where genuine long-range entanglement is corroborated to exist by\nthe quantum topological order. Our findings unveil that, even at low\ntemperatures, a broad class of tripartite entanglement cannot manifest in the\nlong-range regime. To achieve the proof, we establish a comprehensive formalism\nfor analyzing the locality of effective Hamiltonians on subsystems, commonly\nknown as the `entanglement Hamiltonian' or `Hamiltonian of mean force.' As one\noutcome of our analyses, we enhance the prior clustering theorem concerning\nbipartite entanglement. In essence, this means that we investigate genuine\nbipartite entanglement that extends beyond the limitations of the Positive\nPartial Transpose (PPT) class.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Quantum Gases","Condensed Matter/Statistical Mechanics","Physics/High Energy Physics - Theory","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CEo7mloTkhVK_KuxWv9_vWjhewZ52ms8e03Ktbbthd8","pdfSize":"4940993"}
