{"id":"2407.10014","title":"Identification of Average Causal Effects in Confounded Additive Noise\n  Models","authors":"Muhammad Qasim Elahi, Mahsa Ghasemi, Murat Kocaoglu","authorsParsed":[["Elahi","Muhammad Qasim",""],["Ghasemi","Mahsa",""],["Kocaoglu","Murat",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 21:46:57 GMT"}],"updateDate":"2024-07-16","timestamp":1720907217000,"abstract":"  Additive noise models (ANMs) are an important setting studied in causal\ninference. Most of the existing works on ANMs assume causal sufficiency, i.e.,\nthere are no unobserved confounders. This paper focuses on confounded ANMs,\nwhere a set of treatment variables and a target variable are affected by an\nunobserved confounder that follows a multivariate Gaussian distribution. We\nintroduce a novel approach for estimating the average causal effects (ACEs) of\nany subset of the treatment variables on the outcome and demonstrate that a\nsmall set of interventional distributions is sufficient to estimate all of\nthem. In addition, we propose a randomized algorithm that further reduces the\nnumber of required interventions to poly-logarithmic in the number of nodes.\nFinally, we demonstrate that these interventions are also sufficient to recover\nthe causal structure between the observed variables. This establishes that a\npoly-logarithmic number of interventions is sufficient to infer the causal\neffects of any subset of treatments on the outcome in confounded ANMs with high\nprobability, even when the causal structure between treatments is unknown. The\nsimulation results indicate that our method can accurately estimate all ACEs in\nthe finite-sample regime. We also demonstrate the practical significance of our\nalgorithm by evaluating it on semi-synthetic data.\n","subjects":["Statistics/Methodology","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iCcGOsq1WUnApq9sO_T_7KC-GNBwCgr6KnQgEQo4QQI","pdfSize":"2578619","objectId":"0xa3a53db4918c6b0395d7afddee66a1f8470ca36b6fca9cd6aab695136c01ccdc","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
