{"id":"2407.18766","title":"Secrecy Performance Analysis of Integrated RF-UWOC IoT Networks Enabled\n  by UAV and Underwater-RIS","authors":"Abrar Bin Sarawar, A. S. M. Badrudduza, Md. Ibrahim, Imran Shafique\n  Ansari, Heejung Yu","authorsParsed":[["Sarawar","Abrar Bin",""],["Badrudduza","A. S. M.",""],["Ibrahim","Md.",""],["Ansari","Imran Shafique",""],["Yu","Heejung",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 14:23:43 GMT"}],"updateDate":"2024-07-29","timestamp":1722003823000,"abstract":"  In the sixth-generation (6G) Internet of Things (IoT) networks, the use of\nUAV-mounted base stations and reconfigurable intelligent surfaces (RIS) has\nbeen considered to enhance coverage, flexibility, and security in\nnon-terrestrial networks (NTNs). In addition to aerial networks enabled by NTN\ntechnologies, the integration of underwater networks with 6G IoT can be\nconsidered one of the most innovative challenges in future IoT. Along with such\ntrends in IoT, this study investigates the secrecy performance of IoT networks\nthat integrate radio frequency (RF) UAV-based NTNs and underwater optical\nwireless communication (UOWC) links with an RIS. Considering three potential\neavesdropping scenarios (RF signal, UOWC signal, and both), we derive\nclosed-form expressions for secrecy performance metrics, including average\nsecrecy capacity, secrecy outage probability, probability of strictly positive\nsecrecy capacity, and effective secrecy throughput. Extensive numerical\nanalyses and Monte Carlo simulations elucidate the impact of system parameters\nsuch as fading severity, the number of RIS reflecting elements, underwater\nturbulence, pointing errors, and detection techniques on system security. The\nfindings offer comprehensive design guidelines for developing such a network\naiming to enhance secrecy performance and ensure secure communication in\ndiverse and challenging environments.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TrCXwlEoG00Rl7FIj6yrisntBgBvIuLD2wxIA5X-eG4","pdfSize":"1377177","objectId":"0xcf387bff01a0689698ebd5b87c5c2d3bbad846b0bcdb03d0c40650c5675f42e0","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
