{"id":"2407.12281","title":"Turning Generative Models Degenerate: The Power of Data Poisoning\n  Attacks","authors":"Shuli Jiang, Swanand Ravindra Kadhe, Yi Zhou, Farhan Ahmed, Ling Cai,\n  Nathalie Baracaldo","authorsParsed":[["Jiang","Shuli",""],["Kadhe","Swanand Ravindra",""],["Zhou","Yi",""],["Ahmed","Farhan",""],["Cai","Ling",""],["Baracaldo","Nathalie",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 03:02:15 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 05:52:35 GMT"}],"updateDate":"2024-07-19","timestamp":1721185335000,"abstract":"  The increasing use of large language models (LLMs) trained by third parties\nraises significant security concerns. In particular, malicious actors can\nintroduce backdoors through poisoning attacks to generate undesirable outputs.\nWhile such attacks have been extensively studied in image domains and\nclassification tasks, they remain underexplored for natural language generation\n(NLG) tasks. To address this gap, we conduct an investigation of various\npoisoning techniques targeting the LLM's fine-tuning phase via prefix-tuning, a\nParameter Efficient Fine-Tuning (PEFT) method. We assess their effectiveness\nacross two generative tasks: text summarization and text completion; and we\nalso introduce new metrics to quantify the success and stealthiness of such NLG\npoisoning attacks. Through our experiments, we find that the prefix-tuning\nhyperparameters and trigger designs are the most crucial factors to influence\nattack success and stealthiness. Moreover, we demonstrate that existing popular\ndefenses are ineffective against our poisoning attacks. Our study presents the\nfirst systematic approach to understanding poisoning attacks targeting NLG\ntasks during fine-tuning via PEFT across a wide range of triggers and attack\nsettings. We hope our findings will aid the AI security community in developing\neffective defenses against such threats.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"UjW3MtN19HYwVEYjbIte3jjlqpHzKGEWJxh-hq6sxpY","pdfSize":"3896673","objectId":"0xcd1120a2a5caadc88e4b0ee1a1b169193071097093f6748492606db456996524","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
