{"id":"2407.11716","title":"No Questions Asked: Effects of Transparency on Stablecoin Liquidity\n  During the Collapse of Silicon Valley Bank","authors":"Walter Hernandez Cruz, Jiahua Xu, Paolo Tasca, and Carlo Campajola","authorsParsed":[["Cruz","Walter Hernandez",""],["Xu","Jiahua",""],["Tasca","Paolo",""],["Campajola","Carlo",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 13:33:57 GMT"}],"updateDate":"2024-07-17","timestamp":1721136837000,"abstract":"  Fiat-pegged stablecoins are by nature exposed to spillover effects during\nmarket turmoil in Traditional Finance (TradFi). We observe a difference in\nTradFi market shocks impact between various stablecoins, in particular, USD\nCoin (USDC) and Tether USDT (USDT), the former with a higher reporting\nfrequency and transparency than the latter. We investigate this, using top USDC\nand USDT liquidity pools in Uniswap, by adapting the Marginal Cost of Immediacy\n(MCI) measure to Uniswap's Automated Market Maker, and then conducting\nDifference-in-Differences analysis on MCI and Total Value Locked (TVL) in USD,\nas well as measuring liquidity concentration across different providers.\nResults show that the Silicon Valley Bank (SVB) event reduced USDC's TVL\ndominance over USDT, increased USDT's liquidity cost relative to USDC, and\nliquidity provision remained concentrated with pool-specific trends. These\nfindings reveal a flight-to-safety behavior and counterintuitive effects of\nstablecoin transparency: USDC's frequent and detailed disclosures led to swift\nmarket reactions, while USDT's opacity and less frequent reporting provided a\nsafety net against immediate impacts.\n","subjects":["Quantitative Finance/Trading and Market Microstructure","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"a6ANTNyqCfYN2Zu6icGXK7LklCSSJtHcv9TdNiYQVbE","pdfSize":"801906","objectId":"0x43e8b54eee56f7cf9ea41c503d692bb379d6e0f826e347fa11855bdc5b04bb01","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
