{"id":"2407.15031","title":"Schedulability Analysis in Time-Sensitive Networking: A Systematic\n  Literature Review","authors":"Zitong Wang, Feng Luo, Yunpeng Li, Haotian Gan, and Lei Zhu","authorsParsed":[["Wang","Zitong",""],["Luo","Feng",""],["Li","Yunpeng",""],["Gan","Haotian",""],["Zhu","Lei",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 01:49:20 GMT"}],"updateDate":"2024-07-23","timestamp":1721526560000,"abstract":"  Time-Sensitive Networking (TSN) is a set of standards that provide\nlow-latency, high-reliability guarantees for the transmission of traffic in\nnetworks, and it is becoming an accepted solution for complex time-critical\nsystems such as those in industrial automation and the automotive. In\ntime-critical systems, it is essential to verify the timing predictability of\nthe system, and the application of scheduling mechanisms in TSN can also bring\nabout changes in system timing. Therefore, schedulability analysis techniques\ncan be used to verify that the system is scheduled according to the scheduling\nmechanism and meets the timing requirements. In this paper, we provide a clear\noverview of the state-of-the-art works on the topic of schedulability analysis\nin TSN in an attempt to clarify the purpose of schedulability analysis,\ncategorize the methods of schedulability analysis and compare their respective\nstrengths and weaknesses, point out the scheduling mechanisms under analyzing\nand the corresponding traffic classes, clarify the network scenarios\nconstructed during the evaluation and list the challenges and directions still\nneeding to be worked on in schedulability analysis in TSN. To this end, we\nconducted a systematic literature review and finally identified 123 relevant\nresearch papers published in major conferences and journals in the past 15\nyears. Based on a comprehensive review of the relevant literature, we have\nidentified several key findings and emphasized the future challenges in\nschedulability analysis for TSN.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"u04wvsJsb83Xydp9NafDSMr4Z6o5BK4h7mbd8v7PK38","pdfSize":"20643160","objectId":"0xa20c55cf0e1a3d9ea4568a0f39270da3e7bd7fc04070d090e025168ed208f14e","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
