{"id":"2407.19847","title":"Brain-inspired polymer dendrite networks for morphology-dependent\n  computing hardware","authors":"Scholaert Corentin, Coffinier Yannick, Pecqueur S\\'ebastien, Alibart\n  Fabien","authorsParsed":[["Corentin","Scholaert",""],["Yannick","Coffinier",""],["Sébastien","Pecqueur",""],["Fabien","Alibart",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 09:58:01 GMT"}],"updateDate":"2024-07-30","timestamp":1722247081000,"abstract":"  Variability has always been a challenge to mitigate in electronics. This\nespecially holds true for organic semiconductors, where reproducibility and\nlong-term stability concerns hinder industrialization. By relying on a\nbio-inspired computing paradigm, we show that AC-electropolymerization is a\npowerful platform for the development of morphology-dependent computing\nhardware. Our findings reveal that electropolymerized polymer dendrite networks\nexhibit a complex relationship between structure and operation that allows them\nto implement nearly linear to nonlinear functions depending on the complexity\nof their structure. Moreover, dendritic networks can integrate a limitless\nnumber of inputs from their environment, for which their unique morphologies\ninduce specific patterns in the dynamic encoding of the network's output. We\ndemonstrate that this property can be used to our advantage in the context of\nin materio computing to discriminate between different spatiotemporal inputs.\nThese results show how, due to its inherent stochasticity,\nelectropolymerization is a pivotal technique for the bottom-up implementation\nof computationally powerful objects. We anticipate this study will help\nshifting the negative perception of variability in the material science\ncommunity and promote the electropolymerization framework as a foundation for\nthe development of a new generation of hardware defined by its topological\nrichness.\n","subjects":["Computing Research Repository/Emerging Technologies","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vtVtWQLJzeZZUiFL6cp3uyVQsPvNHuj5T2ZssJn17E8","pdfSize":"9491374","objectId":"0xe8e5e0037bb2908126c3c925a0d4b0aa6d189cf19b157bb620d2353654080bee","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
