{"id":"2407.21065","title":"LawLLM: Law Large Language Model for the US Legal System","authors":"Dong Shu, Haoran Zhao, Xukun Liu, David Demeter, Mengnan Du, Yongfeng\n  Zhang","authorsParsed":[["Shu","Dong",""],["Zhao","Haoran",""],["Liu","Xukun",""],["Demeter","David",""],["Du","Mengnan",""],["Zhang","Yongfeng",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 21:51:30 GMT"}],"updateDate":"2024-08-01","timestamp":1722117090000,"abstract":"  In the rapidly evolving field of legal analytics, finding relevant cases and\naccurately predicting judicial outcomes are challenging because of the\ncomplexity of legal language, which often includes specialized terminology,\ncomplex syntax, and historical context. Moreover, the subtle distinctions\nbetween similar and precedent cases require a deep understanding of legal\nknowledge. Researchers often conflate these concepts, making it difficult to\ndevelop specialized techniques to effectively address these nuanced tasks. In\nthis paper, we introduce the Law Large Language Model (LawLLM), a multi-task\nmodel specifically designed for the US legal domain to address these\nchallenges. LawLLM excels at Similar Case Retrieval (SCR), Precedent Case\nRecommendation (PCR), and Legal Judgment Prediction (LJP). By clearly\ndistinguishing between precedent and similar cases, we provide essential\nclarity, guiding future research in developing specialized strategies for these\ntasks. We propose customized data preprocessing techniques for each task that\ntransform raw legal data into a trainable format. Furthermore, we also use\ntechniques such as in-context learning (ICL) and advanced information retrieval\nmethods in LawLLM. The evaluation results demonstrate that LawLLM consistently\noutperforms existing baselines in both zero-shot and few-shot scenarios,\noffering unparalleled multi-task capabilities and filling critical gaps in the\nlegal domain.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jmnG9URXbMSCIB1KpWS6AIa3XcFxT99uZoGwSkw2Ztw","pdfSize":"777909","objectId":"0xabe472abcc4ed7416dc071b9417afdb87415d94c481bea7370f861b7f1ae1eff","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
