{"id":"2407.19133","title":"Network-Based Epidemic Control Through Optimal Travel and Quarantine\n  Management","authors":"Mahtab Talaei, Apostolos I. Rikos, Alex Olshevsky, Laura F. White,\n  Ioannis Ch. Paschalidis","authorsParsed":[["Talaei","Mahtab",""],["Rikos","Apostolos I.",""],["Olshevsky","Alex",""],["White","Laura F.",""],["Paschalidis","Ioannis Ch.",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 00:42:19 GMT"}],"updateDate":"2024-07-30","timestamp":1722040939000,"abstract":"  Motivated by the swift global transmission of infectious diseases, we present\na comprehensive framework for network-based epidemic control. Our aim is to\ncurb epidemics using two different approaches. In the first approach, we\nintroduce an optimization strategy that optimally reduces travel rates. We\nanalyze the convergence of this strategy and show that it hinges on the network\nstructure to minimize infection spread. In the second approach, we expand the\nclassic SIR model by incorporating and optimizing quarantined states to\nstrategically contain the epidemic. We show that this problem reduces to the\nproblem of matrix balancing. We establish a link between optimization\nconstraints and the epidemic's reproduction number, highlighting the\nrelationship between network structure and disease dynamics. We demonstrate\nthat applying augmented primal-dual gradient dynamics to the optimal quarantine\nproblem ensures exponential convergence to the KKT point. We conclude by\nvalidating our approaches using simulation studies that leverage public data\nfrom counties in the state of Massachusetts.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fA4LyvHf1Z6HfbZ9uHDYb4qtshUXqZSTjbeOD1MkV9w","pdfSize":"1594786","objectId":"0x7c0369cb15ec662339c1ff288446d511b166fb724059d682377c41c5c95613e6","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
