{"id":"2407.10797","title":"Hierarchical search method for gravitational waves from stellar-mass\n  binary black holes in noisy space-based detector data","authors":"Yao Fu, Yan Wang, and Soumya D. Mohanty","authorsParsed":[["Fu","Yao",""],["Wang","Yan",""],["Mohanty","Soumya D.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 15:14:49 GMT"}],"updateDate":"2024-07-16","timestamp":1721056489000,"abstract":"  Future space-based laser interferometric detectors, such as LISA, will be\nable to detect gravitational waves (GWs) generated during the inspiral phase of\nstellar-mass binary black holes (SmBBHs). The detection and characterization of\nGWs from SmBBHs poses a formidable data analysis challenge, arising from the\nlarge number of wave cycles that make the search extremely sensitive to\nmismatches in signal and template parameters in a likelihood-based approach.\nThis makes the search for the maximum of the likelihood function over the\nsignal parameter space an extremely difficult task. We present a data analysis\nmethod that addresses this problem using both algorithmic innovations and\nhardware acceleration driven by GPUs. The method follows a hierarchical\napproach in which a semi-coherent $\\mathcal{F}$-statistic is computed with\ndifferent numbers of frequency domain partitions at different stages, with\nmultiple particle swarm optimization (PSO) runs used in each stage for global\noptimization. An important step in the method is the judicious partitioning of\nthe parameter space at each stage to improve the convergence probability of PSO\nand avoid premature convergence to noise-induced secondary maxima. The\nhierarchy of stages confines the semi-coherent searches to progressively\nsmaller parameter ranges, with the final stage performing a search for the\nglobal maximum of the fully-coherent $\\mathcal{F}$-statistic. We test our\nmethod on 2.5 years of a single LISA TDI combination and find that for an\ninjected SmBBH signal with a SNR between $\\approx 11$ and $\\approx 14$, the\nmethod can estimate (i) the chirp mass with a relative error of $\\lesssim\n0.01\\%$, (ii) the time of coalescence within $\\approx 100$ sec, (iii) the sky\nlocation within $\\approx 0.2$ ${\\rm deg}^2$, and (iv) orbital eccentricity at a\nfiducial signal frequency of 10 mHz with a relative error of $\\lesssim 1\\%$.\n(abr.)\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lrNy9cUDfPSb4OvOZ3RqJLEQdJ-jGXPKKhrcdddD8Ek","pdfSize":"1091501","objectId":"0x1062984f6b7c7af44cd0f09daf6c6bf39906ea172cc57a0fb763ff8481c200b5","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
