{"id":"2407.09482","title":"Can the \"basis vectors\", describing the internal spaces of fermion and\n  boson fields with the Clifford odd (for fermion) and Clifford even (for\n  boson) objects, explain interactions among fields, with gravitons included?","authors":"Norma Susana Manko\\v{c} Bor\\v{s}tnik (Department of Physics,\n  University of Ljubljana, Ljubljana, Slovenia)","authorsParsed":[["Borštnik","Norma Susana Mankoč","","Department of Physics,\n  University of Ljubljana, Ljubljana, Slovenia"]],"versions":[{"version":"v1","created":"Fri, 10 May 2024 13:45:43 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 13:28:36 GMT"}],"updateDate":"2024-07-17","timestamp":1715348743000,"abstract":"  The Clifford odd and even \"basis vectors\", describing the internal spaces of\nfermion and boson fields, respectively, offer in even-dimensional spaces, like\nin $d=(13+1)$, the description of quarks and leptons and antiquarks and\nantileptons appearing in families, as well as of all the corresponding gauge\nfields: photons, weak bosons, gluons, Higgs's scalars and the gravitons, which\nnot only explain all the assumptions of the standard model, and makes several\npredictions, but also explains the existence of the graviton gauge fields.\nAnalysing the properties of fermion and boson fields concerning how they\nmanifest in $d=(3+1)$, assuming space in $d=(3+1)$ flat, while all the fields\nhave non-zero momenta only in $d=(3+1)$, this article illustrates that\nscattering of fermion and boson fields, with gravitons included, represented by\nthe Feynman diagrams, are determined by the algebraic products of the\ncorresponding \"basis vectors\" of fields, contributing to scattering. There are\ntwo kinds of boson gauge fields appearing in this theory, both contribute when\ndescribing scattering. We illustrate, assuming that the internal space, which\nmanifests in $d=(3+1)$ origin in $d=(5+1)$, and in $d=(13+1)$, the annihilation\nof an electron and positron into two photons, and the scattering of an electron\nand positron into two muons. The theory offers an elegant and promising\nillustration of the interaction among fermion and boson second quantised\nfields.\n","subjects":["Physics/General Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"O303C6xBa4dqVIumu2L5vIOQPao1nTDzRqj7_LerD7E","pdfSize":"672582","objectId":"0x331b817d266042aede690da3fdb4e51397271d76d85a716327a842397f881c16","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
