{"id":"2407.12119","title":"Graph Neural Network-Based Track Finding in the LHCb Vertex Detector","authors":"Anthony Correia, Fotis I. Giasemis, Nabil Garroum, Vladimir Vava\n  Gligorov, Bertrand Granado","authorsParsed":[["Correia","Anthony",""],["Giasemis","Fotis I.",""],["Garroum","Nabil",""],["Gligorov","Vladimir Vava",""],["Granado","Bertrand",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 19:05:38 GMT"},{"version":"v2","created":"Mon, 9 Sep 2024 09:18:07 GMT"}],"updateDate":"2024-09-10","timestamp":1721156738000,"abstract":"  The next decade will see an order of magnitude increase in data collected by\nhigh-energy physics experiments, driven by the High-Luminosity LHC (HL-LHC).\nThe reconstruction of charged particle trajectories (tracks) has always been a\ncritical part of offline data processing pipelines. The complexity of HL-LHC\ndata will however increasingly mandate track finding in all stages of an\nexperiment's real-time processing. This paper presents a GNN-based\ntrack-finding pipeline tailored for the Run 3 LHCb experiment's vertex detector\nand benchmarks its physics performance and computational cost against existing\nclassical algorithms on GPU architectures. A novelty of our work compared to\nexisting GNN tracking pipelines is batched execution, in which the GPU\nevaluates the pipeline on hundreds of events in parallel. We evaluate the\nimpact of neural-network quantisation on physics and computational performance,\nand comment on the outlook for GNN tracking algorithms for other parts of the\nLHCb track-finding pipeline.\n","subjects":["Physics/Instrumentation and Detectors","Physics/High Energy Physics - Experiment","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"94giaZdHBVyTY2Bb2LKiFr4T37CAZX4xzkUCPWr6o8U","pdfSize":"895834","objectId":"0x892b8bdd6dbac3942459996ae8391ab3a983e3e22f382fda7e4238bea8d965a8","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
