{"id":"2407.21466","title":"Nonlinearity-induced dynamical self-organized twisted-bilayer lattices\n  in Bose-Einstein condensates","authors":"Rui Tian, Yue Zhang, Tianhao Wu, Min Liu, Yong-Chang Zhang, Shuai Li,\n  Bo Liu","authorsParsed":[["Tian","Rui",""],["Zhang","Yue",""],["Wu","Tianhao",""],["Liu","Min",""],["Zhang","Yong-Chang",""],["Li","Shuai",""],["Liu","Bo",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 09:25:39 GMT"}],"updateDate":"2024-08-01","timestamp":1722417939000,"abstract":"  Creating crystal bilayers twisted with respect to each other would lead to\nlarge periodic supercell structures, which can support a wide range of novel\nelectron correlated phenomena, where the full understanding is still under\ndebate. Here, we propose a new scheme to realize a nonlinearity-induced\ndynamical self-organized twisted-bilayer lattice in an atomic Bose-Einstein\ncondensate (BEC). The key idea here is to utilize the nonlinear effect from the\nintrinsic atomic interactions to couple different layers and induce a dynamical\nself-organized supercell structure, dramatically distinct from the conventional\nwisdom to achieve the static twisted-bilayer lattices. To illustrate that, we\nstudy the dynamics of a two-component BEC and show that the nonlinear\ninteraction effect naturally emerged in the Gross-Pitaevskii equation of\ninteracting bosonic ultracold atoms can dynamically induce both periodic\n(commensurable) and aperiodic (incommensurable) moir\\'{e} structures. One of\nthe interesting moir\\'{e} phenomena, i.e., the flat-band physics, is shown\nthrough investigating the dynamics of the wave packet of BEC. Our proposal can\nbe implemented using available state-of-the-art experimental techniques and\nreveal a profound connection between the nonlinearity and twistronics in cold\natom quantum simulators.\n","subjects":["Condensed Matter/Quantum Gases","Condensed Matter/Mesoscale and Nanoscale Physics","Nonlinear Sciences/Pattern Formation and Solitons","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"k-YzhH6xZznqliELz4Jn_qZlSt9vzVwnD2Yoe22MN-w","pdfSize":"6614001","objectId":"0x41060f69031e91686dbbf25fa7dcae9118ff1a97d2ad9ae0cc29b5435707d769","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
