{"id":"2407.12802","title":"SimClone: Detecting Tabular Data Clones using Value Similarity","authors":"Xu Yang, Gopi Krishnan Rajbahadur, Dayi Lin, Shaowei Wang, Zhen Ming\n  (Jack) Jiang","authorsParsed":[["Yang","Xu","","Jack"],["Rajbahadur","Gopi Krishnan","","Jack"],["Lin","Dayi","","Jack"],["Wang","Shaowei","","Jack"],["Ming","Zhen","","Jack"],["Jiang","",""]],"versions":[{"version":"v1","created":"Mon, 24 Jun 2024 04:16:32 GMT"}],"updateDate":"2024-07-19","timestamp":1719202592000,"abstract":"  Data clones are defined as multiple copies of the same data among datasets.\nPresence of data clones between datasets can cause issues such as difficulties\nin managing data assets and data license violations when using datasets with\nclones to build AI software. However, detecting data clones is not trivial.\nMajority of the prior studies in this area rely on structural information to\ndetect data clones (e.g., font size, column header). However, tabular datasets\nused to build AI software are typically stored without any structural\ninformation. In this paper, we propose a novel method called SimClone for data\nclone detection in tabular datasets without relying on structural information.\nSimClone method utilizes value similarities for data clone detection. We also\npropose a visualization approach as a part of our SimClone method to help\nlocate the exact position of the cloned data between a dataset pair. Our\nresults show that our SimClone outperforms the current state-of-the-art method\nby at least 20\\% in terms of both F1-score and AUC. In addition, SimClone's\nvisualization component helps identify the exact location of the data clone in\na dataset with a Precision@10 value of 0.80 in the top 20 true positive\npredictions.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"R9oFFJizbOclnn3Z00xHIgb-S8wmwNWv6bsWM-I1QRc","pdfSize":"2463989","objectId":"0x834af5ba63a48365704b8df183c93bb263b34b70b9eaebc5cecabf674e33329b","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
