{"id":"2407.11561","title":"Imitation learning with artificial neural networks for demand response\n  with a heuristic control approach for heat pumps","authors":"Thomas Dengiz, Max Kleinebrahm","authorsParsed":[["Dengiz","Thomas",""],["Kleinebrahm","Max",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 10:08:32 GMT"}],"updateDate":"2024-07-17","timestamp":1721124512000,"abstract":"  The flexibility of electrical heating devices can help address the issues\narising from the growing presence of unpredictable renewable energy sources in\nthe energy system. In particular, heat pumps offer an effective solution by\nemploying smart control methods that adjust the heat pump's power output in\nreaction to demand response signals. This paper combines imitation learning\nbased on an artificial neural network with an intelligent control approach for\nheat pumps. We train the model using the output data of an optimization problem\nto determine the optimal operation schedule of a heat pump. The objective is to\nminimize the electricity cost with a time-variable electricity tariff while\nkeeping the building temperature within acceptable boundaries. We evaluate our\ndeveloped novel method, PSC-ANN, on various multi-family buildings with\ndiffering insulation levels that utilize an underfloor heating system as\nthermal storage. The results show that PSC-ANN outperforms a positively\nevaluated intelligent control approach from the literature and a conventional\ncontrol approach. Further, our experiments reveal that a trained imitation\nlearning model for a specific building is also applicable to other similar\nbuildings without the need to train it again with new data. Our developed\napproach also reduces the execution time compared to optimally solving the\ncorresponding optimization problem. PSC-ANN can be integrated into multiple\nbuildings, enabling them to better utilize renewable energy sources by\nadjusting their electricity consumption in response to volatile external\nsignals.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gVlK9bkymAskxJ1nkaF2Z7EMn87470c8vfgW2PrOctU","pdfSize":"1375048","objectId":"0x5322676f92fff5b79c9fab2d26a37ac30dacbd066c9eca72ec90b26e58f9d3d2","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
