{"id":"2407.16702","title":"Diffeomorphism Invariance and General Relativity","authors":"Max Heitmann","authorsParsed":[["Heitmann","Max",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 10:25:24 GMT"}],"updateDate":"2024-07-25","timestamp":1720347924000,"abstract":"  Diffeomorphism invariance is often considered to be a hallmark of the theory\nof general relativity (GR). But closer analysis reveals that this cannot be\nwhat makes GR distinctive. The concept of diffeomorphism invariance can be\ndefined in two ways: under the first definition (diff-invariance$_1$), both GR\nand all other classical spacetime theories turn out to be diffeomorphism\ninvariant, while under the second (diff-invariance$_2$), neither do. Confusion\nabout the matter can be traced to two sources. First, GR is sometimes\nerroneously thought to embody a \"general principle of relativity,\" which\nasserts the relativity of all states of motion, and from which it would follow\nthat GR must be diff-invariant$_2$. But GR embodies no such principle, and is\neasily seen to violate diff-invariance$_2$. Second, GR is unique among\nspacetime theories in requiring a general-covariant formulation, whereas other\nclassical spacetime theories are typically formulated with respect to a\npreferred class of global coordinate systems in which their dynamical equations\nsimplify. This makes GR's diffeomorphism invariance (in the sense of\ndiff-invariance$_1$) manifest, while in other spacetime theories it lies latent\n-- at least in their familiar formulations. I trace this difference back to the\nfact that the spacetime structure is inhomogeneous within the models of GR, and\nmutable across its models. I offer a formal criterion for when a spacetime\ntheory possesses immutable spacetime structure, and using this criterion I\nprove that a theory possesses a preferred class of coordinate systems\napplicable across its models if and only if it possesses immutable spacetime\nstructure.\n","subjects":["Physics/General Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3JSErf5UN6m4Vzj7mJ2ZoaHYk3WntP8qZiYat2WkgLU","pdfSize":"167968","objectId":"0x3394cb48f07c79ce7b0bac9d0802ff126b7236145cd536b0e8fb1f9700da34ae","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
