{"id":"2407.16880","title":"Achieving Heisenberg scaling by probe-ancilla interaction in quantum\n  metrology","authors":"Jingyi Fan, Shengshi Pang","authorsParsed":[["Fan","Jingyi",""],["Pang","Shengshi",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 23:11:50 GMT"}],"updateDate":"2024-07-25","timestamp":1721776310000,"abstract":"  The Heisenberg scaling is an ultimate precision limit of parameter estimation\nallowed by the principles of quantum mechanics, with no counterpart in the\nclassical realm, and has been a long-pursued goal in quantum metrology. It has\nbeen known that interactions between the probes can help reach the Heisenberg\nscaling without entanglement. In this work, we show that interactions between\nthe probes and the additional dimensions of an ancillary system may also\nincrease the precision of parameter estimation to surpass the standard quantum\nlimit and attain the Heisenberg scaling without entanglement, if the\nmeasurement scheme is properly designed. The quantum Fisher information\nexhibits periodic patterns over the evolution time, implying the existence of\noptimal time points for measurements that can maximize the quantum Fisher\ninformation. By implementing optimizations over the Hamiltonian, the initial\nstates of the probes and the ancillary system, the interaction strength and the\ntime points for measurements, our protocol achieves the Heisenberg scaling for\nthe parameter of the probe Hamiltonian, in terms of both evolution time and\nprobe number. Our protocol features in two aspects: (i) the Heisenberg scaling\ncan be achieved by a product state of the probes, (ii) mere local measurement\non the ancilla is sufficient, both of which reduce the quantum resources and\nthe implementation complexity to achieve the Heisenberg scaling.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"pQkS_xd2SFSF6Rk0av-Zdh635qD3EV1L0QFstQX-4ls","pdfSize":"522708","objectId":"0xb3dcf87b16ca5f264f595a4a8f8ae36cc5414e5302c93be4a6f29827d98341bd","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
