{"id":"2407.04881","title":"Coupled Stochastic-Statistical Equations for Filtering Multiscale\n  Turbulent Systems","authors":"Di Qi and Jian-Guo Liu","authorsParsed":[["Qi","Di",""],["Liu","Jian-Guo",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 22:26:58 GMT"}],"updateDate":"2024-07-09","timestamp":1720218418000,"abstract":"  We present a new strategy for filtering high-dimensional multiscale systems\ncharacterized by high-order non-Gaussian statistics using observations from\nleading-order moments. A closed stochastic-statistical modeling framework\nsuitable for systematic theoretical analysis and efficient numerical\nsimulations is designed. Optimal filtering solutions are derived based on the\nexplicit coupling structures of stochastic and statistical equations subject to\nlinear operators, which satisfy an infinite-dimensional Kalman-Bucy filter with\nconditional Gaussian dynamics. To facilitate practical implementation, we\ndevelop a finite-dimensional stochastic filter model that approximates the\noptimal filter solution. We prove that this approximating filter effectively\ncaptures key non-Gaussian features, demonstrating consistent statistics with\nthe optimal filter first in its analysis step update, then at the long-time\nlimit guaranteeing stable convergence to the optimal filter. Finally, we build\na practical ensemble filter algorithm based on the approximating filtering\nmodel, which enables accurate recovery of the true model statistics. The\nproposed modeling and filtering strategies are applicable to a wide range\nchallenging problems in science and engineering, particularly for statistical\nprediction and uncertainty quantification of multiscale turbulent states.\n","subjects":["Physics/Mathematical Physics","Mathematics/Mathematical Physics","Mathematics/Statistics Theory","Nonlinear Sciences/Chaotic Dynamics","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uxMRUbegPYFrIBGC-Avrx3dcLrdC4E9Kth8yp8mSfXo","pdfSize":"556023"}
