{"id":"2407.09446","title":"Neutron-quark stars: Discerning viable alternatives for the\n  higher-density part of the equation of state of compact stars","authors":"Sudipta Hensh, Yong-Jia Huang, Toru Kojo, Luca Baiotti, Kentaro\n  Takami, Shigehiro Nagataki, and Hajime Sotani","authorsParsed":[["Hensh","Sudipta",""],["Huang","Yong-Jia",""],["Kojo","Toru",""],["Baiotti","Luca",""],["Takami","Kentaro",""],["Nagataki","Shigehiro",""],["Sotani","Hajime",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 17:31:44 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 12:10:03 GMT"}],"updateDate":"2024-08-05","timestamp":1720805504000,"abstract":"  By taking into account the latest observations and theoretical constraints,\nwe investigate the merger and post-merger of binary neutron stars (NSs) with\ngeneral-relativistic numerical simulations employing hadronic and hybrid\nequations of state (EOSs). We name our hybrid stars neutron-quark stars (NQS),\nbecause the transition from hadrons to quarks starts at a density lower than\nthe central density of $\\sim 1 M_{\\odot}$ stars. We address two viable\nscenarios for the transition to quark matter: a crossover or a strong\nfirst-order phase transition (1PT). We find that a crossover transition is in\nprinciple observable when both the inspiral and post-merger signals are\ndetected because the post-merger gravitational-wave (GW) main frequency $f_2$\nis generally lower than that of hadronic models with the same tidal\ndeformability ($\\Lambda$). Since it is viable according to current\nmulti-messenger constraints, we also highlight the possibility of an EOS with a\nstrong 1PT that takes place at 1.8 times the nuclear saturation density, with a\nstiff quark EOS after the transition. It is the first time that mergers of\nbinary NQSs with a deconfined quark-matter core are studied numerically in full\ngeneral relativity. In this case, although ($\\Lambda$, compactness) lies\nsignificantly outside the hadronic relation, ($\\Lambda$, $f_2$) is close to the\nrelation valid for hadronic EOSs. We also point out a linear correlation, valid\nwithin the observational constraints and not sensitive to the presence of a\nhadron-quark transition, between the emitted energy in GWs and their frequency.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology","Physics/Nuclear Theory"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"pFgvsSvlWoVBBlrusER5vzB-1ny2eXVtTW0yyz9lpAs","pdfSize":"1341673","objectId":"0xada37d4ce14757d7a6071f3ef080362e78da79ccd147003e2f42c54941df2e93","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
