{"id":"2407.00145","title":"Co-evolving networks for opinion and social dynamics in agent-based\n  models","authors":"Nata\\v{s}a Djurdjevac Conrad, Nhu Quang Vu and S\\\"oren Nagel","authorsParsed":[["Conrad","Nataša Djurdjevac",""],["Vu","Nhu Quang",""],["Nagel","Sören",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 16:22:18 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 10:27:57 GMT"}],"updateDate":"2024-09-20","timestamp":1719591738000,"abstract":"  The rise of digital social media has strengthened the coevolution of public\nopinions and social interactions, that shape social structures and collective\noutcomes in increasingly complex ways. Existing literature often explores this\ninterplay as a one-directional influence, focusing on how opinions determine\nsocial ties within adaptive networks. However, this perspective overlooks the\nintrinsic dynamics driving social interactions, which can significantly\ninfluence how opinions form and evolve. In this work, we address this gap, by\nintroducing the co-evolving opinion and social dynamics using stochastic\nagent-based models. Agents' mobility in a social space is governed by both\ntheir social and opinion similarity with others. Similarly, the dynamics of\nopinion formation is driven by the opinions of agents in their social vicinity.\nWe analyze the underlying social and opinion interaction networks and explore\nthe mechanisms influencing the appearance of emerging phenomena, like echo\nchambers and opinion consensus. To illustrate the model's potential for\nreal-world analysis, we apply it to General Social Survey data on political\nidentity and public opinion regarding governmental issues. Our findings\nhighlight the model's strength in capturing the coevolution of social\nconnections and individual opinions over time.\n","subjects":["Physics/Physics and Society","Mathematics/Dynamical Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"r_vEGst_FyKgqS75tWS3NXGQqmBL0DdMLoTN_gaxq2o","pdfSize":"25865553","objectId":"0xfbca8d5d396b051061b7a9d93e407a4fc4715b53e9ca114baa6be0f49a4cd409","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
