{"id":"2407.03053","title":"Visible, Near-, and Mid-infrared Computational Spectrometer Enabled by\n  Single-Spinning Film Encoder","authors":"Junren Wen, Weiming Shi, Cheng Gao, Yujie Liu, Shuaibo Feng, Yu Shao,\n  Haiqi Gao, Yuchuan Shao, Yueguang Zhang, Weidong Shen, Chenying Yang","authorsParsed":[["Wen","Junren",""],["Shi","Weiming",""],["Gao","Cheng",""],["Liu","Yujie",""],["Feng","Shuaibo",""],["Shao","Yu",""],["Gao","Haiqi",""],["Shao","Yuchuan",""],["Zhang","Yueguang",""],["Shen","Weidong",""],["Yang","Chenying",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 12:22:57 GMT"}],"updateDate":"2024-07-04","timestamp":1720009377000,"abstract":"  Computational spectrometers are pivotal in enabling low-cost, in-situ and\nrapid spectral analysis, with potential applications in chemistry, biology, and\nenvironmental science. However, filter-based spectral encoding approaches\ntypically use filter arrays, complicating the manufacturing process and\nhindering device consistency. By capitalizing on the polarization separation\neffect under oblique incidence (PSEOI), we pioneer the use of a single filter\nfor highly efficient spectral encoding, and propose a novel computational\nspectrometer spanning visible to mid-infrared wavelengths by combining the\nSingle-Spinning Film Encoder (SSFE) with deep learning-based reconstruction\nalgorithm. The particle swarm optimization (PSO) method is employed to optimize\nthe film configuration of SSFE, achieving low-correlation and high-complexity\nspectral responses under different polarizations and spinning angles, thereby\nenhancing both spectral resolution and accuracy of reconstruction across\ndiverse spectral ranges. Spectral resolutions up to 0.5 nm, 2 nm, 10 nm can be\nrealized for single-peak narrowband spectra, and 3 nm, 6 nm, 20 nm for\ndual-peak narrowband spectra, over the visible, near-, and mid-infrared\nwavelength ranges, respectively. Moreover, the proposed spectrometer\ndemonstrates an overall 81.38% precision for the classification of 220 chemical\ncompounds, confirming its robustness and precision in practical scenarios,\nalong with the capability for compact, cost-effective spectroscopic solutions.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"34YgooXLAUNYQD5VkpdEAp0dWYVxnNJUmysM5nLsIQE","pdfSize":"2887687"}
