{"id":"2407.10959","title":"A unified theory and statistical learning approach for traffic conflict\n  detection","authors":"Yiru Jiao, Simeon C. Calvert, Sander van Cranenburgh, Hans van Lint","authorsParsed":[["Jiao","Yiru",""],["Calvert","Simeon C.",""],["van Cranenburgh","Sander",""],["van Lint","Hans",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:55:36 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 15:21:16 GMT"},{"version":"v3","created":"Wed, 4 Sep 2024 09:11:56 GMT"}],"updateDate":"2024-09-05","timestamp":1721066136000,"abstract":"  This study proposes a unified theory and statistical learning approach for\ntraffic conflict detection, addressing the long-existing call for a consistent\nand comprehensive methodology to evaluate the collision risk emerging in road\nuser interactions. The proposed theory assumes context-dependent probabilistic\ncollision risk and frames conflict detection as assessing this risk by\nstatistical learning of extreme events in daily interactions. Experiments using\nreal-world trajectory data are conducted for demonstration. Firstly, a unified\nmetric for indicating conflicts is trained with lane-changing interactions on\nGerman highways. This metric and other existing metrics are then applied to\nnear-crash events from the 100-Car Naturalistic Driving Study in the U.S. for\nperformance comparison. Results of the experiments show that the trained metric\nprovides effective collision warnings, generalises across distinct datasets and\ntraffic environments, covers a broad range of conflict types, and delivers a\nlong-tailed distribution of conflict intensity. Reflecting on these results,\nthe proposed theory ensures consistent evaluation by a generic formulation that\nencompasses varying assumptions of traffic conflicts; the statistical learning\napproach then enables a comprehensive consideration of influencing factors such\nas motion states of road users, environment conditions, and participant\ncharacteristics. Therefore, the theory and learning approach jointly provide an\nexplainable and adaptable methodology for conflict detection among different\nroad users and across various interaction scenarios. This promises to reduce\naccidents and improve overall traffic safety, by enhanced safety assessment of\ntraffic infrastructures, more effective collision warning systems for\nautonomous driving, and a deeper understanding of road user behaviour in\ndifferent traffic conditions.\n","subjects":["Computing Research Repository/Robotics","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"D773qCsFmBfVLEKLCi4bfXnRILoX0zDu_pEWOvwL2Fs","pdfSize":"1344896","objectId":"0xf6a8d0cb7d8eb7899d928833f2558dec2ed796a738ab9b50ec15c76346a1a3ea","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
