{"id":"2407.12716","title":"Stein's method and general clocks: diffusion approximation of the\n  $G/G/1$ workload","authors":"Anton Braverman and Ziv Scully","authorsParsed":[["Braverman","Anton",""],["Scully","Ziv",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 16:37:48 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 18:23:10 GMT"}],"updateDate":"2024-08-01","timestamp":1721234268000,"abstract":"  We begin developing the theory of the generator comparison approach of\nStein's method for continuous-time Markov processes where jumps are driven by\nclocks having general distributions, as opposed to exponential distributions.\nThis paper handles models with a single general clock.\n  Using the workload process in the $G/G/1$ queueing system as a driving\nexample, we develop two variants of the generator comparison approach for\nmodels with a single general clock: the original, which we call the limiting\napproach, and the recently proposed prelimit approach. The approaches are duals\nof one another, yielding distinct bounds on the diffusion approximation error\nof the steady-state workload.\n  We also contribute to the theory of heavy-traffic approximations for the\n$G/G/1$ system. Under some assumptions on the interarrival time distribution,\nthe prelimit approach allows us to bound the diffusion approximation error in\nterms of $G/G/1$ model primitives. For example, when the interarrival time has\na nonincreasing hazard rate that is bounded from above, we show that the\ndiffusion approximation error of the expected workload is bounded in terms of\nthe first three moments of the interarrival and service-time distributions, as\nwell as the upper bound on the interarrival hazard rate.\n","subjects":["Mathematics/Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZO5KB5vZ92eHDdHtyx8Anu8MQ8Nqd-xobVHaqMhhNYU","pdfSize":"431343","objectId":"0x597407ceb5a51e655ec38f05e95bae7ddf8fc2ad914645fccc94759c2ca1e259","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
