{"id":"2407.11828","title":"Vibravox: A Dataset of French Speech Captured with Body-conduction Audio\n  Sensors","authors":"Julien Hauret and Malo Olivier and Thomas Joubaud and Christophe\n  Langrenne and Sarah Poir\\'ee and V\\'eronique Zimpfer and \\'Eric Bavu","authorsParsed":[["Hauret","Julien",""],["Olivier","Malo",""],["Joubaud","Thomas",""],["Langrenne","Christophe",""],["Poirée","Sarah",""],["Zimpfer","Véronique",""],["Bavu","Éric",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:16:10 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 08:09:01 GMT"}],"updateDate":"2024-07-18","timestamp":1721142970000,"abstract":"  Vibravox is a dataset compliant with the General Data Protection Regulation\n(GDPR) containing audio recordings using five different body-conduction audio\nsensors : two in-ear microphones, two bone conduction vibration pickups and a\nlaryngophone. The data set also includes audio data from an airborne microphone\nused as a reference. The Vibravox corpus contains 38 hours of speech samples\nand physiological sounds recorded by 188 participants under different acoustic\nconditions imposed by an high order ambisonics 3D spatializer. Annotations\nabout the recording conditions and linguistic transcriptions are also included\nin the corpus. We conducted a series of experiments on various speech-related\ntasks, including speech recognition, speech enhancement and speaker\nverification. These experiments were carried out using state-of-the-art models\nto evaluate and compare their performances on signals captured by the different\naudio sensors offered by the Vibravox dataset, with the aim of gaining a better\ngrasp of their individual characteristics.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"crb6pdjNhAMtrR3Gv-Bfp0Q1ToAP4J5avn8kqWk56GU","pdfSize":"15079886","objectId":"0x77a416584dc64a0e9391c8f965e7c4761095b690c68a474f795ffa6d637efa6f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
