{"id":"2407.02884","title":"Complex Event Recognition with Symbolic Register Transducers: Extended\n  Technical Report","authors":"Elias Alevizos, Alexander Artikis, Georgios Paliouras","authorsParsed":[["Alevizos","Elias",""],["Artikis","Alexander",""],["Paliouras","Georgios",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 07:59:13 GMT"}],"updateDate":"2024-07-04","timestamp":1719993553000,"abstract":"  We present a system for Complex Event Recognition (CER) based on automata.\nWhile multiple such systems have been described in the literature, they\ntypically suffer from a lack of clear and denotational semantics, a limitation\nwhich often leads to confusion with respect to their expressive power. In order\nto address this issue, our system is based on an automaton model which is a\ncombination of symbolic and register automata. We extend previous work on these\ntypes of automata, in order to construct a formalism with clear semantics and a\ncorresponding automaton model whose properties can be formally investigated. We\ncall such automata Symbolic Register Transducers (SRT). We show that SRT are\nclosed under various operators, but are not in general closed under complement\nand they are not determinizable. However, they are closed under these\noperations when a window operator, quintessential in Complex Event Recognition,\nis used. We show how SRT can be used in CER in order to detect patterns upon\nstreams of events, using our framework that provides declarative and\ncompositional semantics, and that allows for a systematic treatment of such\nautomata. For SRT to work in pattern detection, we allow them to mark events\nfrom the input stream as belonging to a complex event or not, hence the name\n\"transducers\". We also present an implementation of SRT which can perform CER.\nWe compare our SRT-based CER engine against other state-of-the-art CER systems\nand show that it is both more expressive and more efficient.\n","subjects":["Computing Research Repository/Formal Languages and Automata Theory","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TFyuKK3rMPvu7WB1NHw9Y8FPipVpoiZEkAjM3KJ6Scc","pdfSize":"1583470","objectId":"0x24fee87a250fd783260a440c3ec83a4539b1d76a5ffa252164e82ab782baf02a","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
