{"id":"2407.08177","title":"Data-Driven Linearization of Dynamical Systems","authors":"George Haller, B\\'alint Kasz\\'as","authorsParsed":[["Haller","George",""],["Kaszás","Bálint",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 04:44:28 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 14:33:32 GMT"}],"updateDate":"2024-08-06","timestamp":1720673068000,"abstract":"  Dynamic Mode Decomposition (DMD) and its variants, such as extended DMD\n(EDMD), are broadly used to fit simple linear models to dynamical systems known\nfrom observable data. As DMD methods work well in several situations but\nperform poorly in others, a clarification of the assumptions under which DMD is\napplicable is desirable. Upon closer inspection, existing interpretations of\nDMD methods based on the Koopman operator are not quite satisfactory: they\njustify DMD under assumptions that hold only with probability zero for generic\nobservables. Here, we give a justification for DMD as a local, leading-order\nreduced model for the dominant system dynamics under conditions that hold with\nprobability one for generic observables and non-degenerate observational data.\nWe achieve this for autonomous and for periodically forced systems of finite or\ninfinite dimensions by constructing linearizing transformations for their\ndominant dynamics within attracting slow spectral submanifolds (SSMs). Our\narguments also lead to a new algorithm, data-driven linearization (DDL), which\nis a higher-order, systematic linearization of the observable dynamics within\nslow SSMs. We show by examples how DDL outperforms DMD and EDMD on numerical\nand experimental data.\n","subjects":["Mathematics/Dynamical Systems","Nonlinear Sciences/Chaotic Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_qwgd0ruHVhGlX7BynMxzylM33GDKkefQaf6RU3-ips","pdfSize":"4222354","objectId":"0x7f646c598b5e32acfa97793ff7e6a9c31a1133c65328b1cdd0727f04ac040507","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
