{"id":"2407.09877","title":"Model-free Distortion Canceling and Control of Quantum Devices","authors":"Ahmed F. Fouad, Akram Youssry, Ahmed El-Rafei, Sherif Hammad","authorsParsed":[["Fouad","Ahmed F.",""],["Youssry","Akram",""],["El-Rafei","Ahmed",""],["Hammad","Sherif",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 12:54:57 GMT"}],"updateDate":"2024-07-16","timestamp":1720875297000,"abstract":"  Quantum devices need precise control to achieve their full capability. In\nthis work, we address the problem of controlling closed quantum systems,\ntackling two main issues. First, in practice the control signals are usually\nsubject to unknown classical distortions that could arise from the device\nfabrication, material properties and/or instruments generating those signals.\nSecond, in most cases modeling the system is very difficult or not even viable\ndue to uncertainties in the relations between some variables and\ninaccessibility to some measurements inside the system. In this paper, we\nintroduce a general model-free control approach based on deep reinforcement\nlearning (DRL), that can work for any closed quantum system. We train a deep\nneural network (NN), using the REINFORCE policy gradient algorithm to control\nthe state probability distribution of a closed quantum system as it evolves,\nand drive it to different target distributions. We present a novel controller\narchitecture that comprises multiple NNs. This enables accommodating as many\ndifferent target state distributions as desired, without increasing the\ncomplexity of the NN or its training process. The used DRL algorithm works\nwhether the control problem can be modeled as a Markov decision process (MDP)\nor a partially observed MDP. Our method is valid whether the control signals\nare discrete- or continuous-valued. We verified our method through numerical\nsimulations based on a photonic waveguide array chip. We trained a controller\nto generate sequences of different target output distributions of the chip with\nfidelity higher than 99%, where the controller showed superior performance in\ncanceling the classical signal distortions.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1p6jVmAbxCfDnUPX1NWIS5JlqmZxtF2JK5kQoZ4HyOA","pdfSize":"761518","objectId":"0x4500f71c443d32611f48bf0252fbbe4cf18f4e4a6df189e2e496f29417ac1045","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
