{"id":"2407.00527","title":"Assessing the Value of Coupling Thermal Energy Storage with Air-Source\n  Heat Pumps for Residential Space Heating in U.S. Cities","authors":"An T. Pham, Bryan Kinzer, Ritvik Jain, Rohini Bala Chandran, Michael\n  T. Craig","authorsParsed":[["Pham","An T.",""],["Kinzer","Bryan",""],["Jain","Ritvik",""],["Chandran","Rohini Bala",""],["Craig","Michael T.",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 20:14:53 GMT"}],"updateDate":"2024-07-02","timestamp":1719692093000,"abstract":"  Widespread air source heat pump (ASHP) adoption faces several challenges that\non-site thermal energy storage (TES), particularly thermochemical salt hydrate\nTES, can mitigate. No techno-economic analyses for salt-hydrate-based TES in\nresidential applications exist. We quantify the residential space heating value\nof four salt hydrate TES materials - MgSO4, MgCl2, K2CO3, and SrBr2 - coupled\nwith ASHPs across 4,800 representative households in 12 U.S. cities by\nembedding salt-hydrate-specific Ragone plots into a techno-economic model of\ncoupled ASHP-TES operations. In Detroit, salt hydrate TES is projected to\nreduce household annual electricity costs by up to $\\$$241 (8$\\%$). Cost\nsavings from TES can differ by over an order of magnitude between households\nand salt hydrates. We identify the most promising salt in this study, SrBr2,\ndue to its high energy density and low humidification parasitic load.\nBreak-even capital costs of SrBr2-based TES range from $\\$$13/kWh to\n$\\$$17/kWh, making it the only salt hydrate studied to reach and exceed the\nU.S. Department of Energy's $\\$$15/kWh TES cost target. Sensitivities highlight\nthe importance of variable TES sizing and efficiency losses in the value of\nTES.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gCI7-Ik7iFI93rppnLV3S1ZbiT2QbYRHhEapEAwJ5Ps","pdfSize":"6606005","objectId":"0x980a3a51339e8bdbbc84c38a0f7d471c4d8e01abb72039e442991b20fe1ddd58","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
