{"id":"2407.20541","title":"Rapid Geological CO2 Storage Forecast and Optimization: A Data-driven\n  Dynamic Mode Decomposition Model Order Reduction Approach","authors":"Dimitrios Voulanas, Eduardo Gildin","authorsParsed":[["Voulanas","Dimitrios",""],["Gildin","Eduardo",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 04:50:03 GMT"}],"updateDate":"2024-07-31","timestamp":1722315003000,"abstract":"  DMDc and DMDspc successfully expedite the reconstruction and forecasting of\nCO2 fluid flow with acceptable accuracy margins, aiding in the rapid\noptimization of geological CO2 storage forecast and its optimization. DMDc and\nDMDspc models were trained with weekly, monthly, and yearly ECLIPSE 300\nsimulation pressure and CO2 saturation fields. The domain of interest is a\nlarge scale highly heterogeneous offshore reservoir model with over 100000\ncells. Snapshot reconstruction significantly reduced simulation times from\nseveral hours to mere minutes. DMDspc reduced the number of DMD modes for\npressure without losing accuracy while sometimes even improving accuracy. Two\noperation cases were considered: 1. CO2 injection, 2. CO2 injection and water\nproduction for pressure maintenance. For pressure, DMDspc achieved a slightly\nhigher than DMDc average error by removing several modes. On the other hand,\nDMDspc showed limited success in reducing modes for CO2 saturation. The\nforecast performance of DMD models was evaluated using percent change error,\nmean absolute error, and Pearson R correlation coefficient metrics. Almost all\nDMD pressure models managed to successfully forecast pressure fields while a\nsmaller number of DMD models managed to forecast CO2 saturation. While forecast\nerrors have a considerable range, especially for saturation, only DMD models\nwith errors below 5% PCE for pressure or 0.01 MAE for saturation were\nconsidered acceptable for geological CO2 storage optimization. Optimized CO2\ninjection and water production amounts were consistent across selected DMD\nmodels and all time scales. The DMDspc monitored cells approach, which only\nreconstructs the monitored during optimization cells, reduced even further\noptimization time while providing consistent results with the optimization that\nused full snapshot reconstruction.\n","subjects":["Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LFE8S7sWa7hvXVblwFdXthY-SFXsuSs3aHSdP_bX9FQ","pdfSize":"3098966","objectId":"0x63283961af62bbfa4a738327956810f51d04106f27cc1d504ef496ce68691ac1","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
