{"id":"2407.00114","title":"OmniJARVIS: Unified Vision-Language-Action Tokenization Enables\n  Open-World Instruction Following Agents","authors":"Zihao Wang, Shaofei Cai, Zhancun Mu, Haowei Lin, Ceyao Zhang, Xuejie\n  Liu, Qing Li, Anji Liu, Xiaojian Ma, Yitao Liang","authorsParsed":[["Wang","Zihao",""],["Cai","Shaofei",""],["Mu","Zhancun",""],["Lin","Haowei",""],["Zhang","Ceyao",""],["Liu","Xuejie",""],["Li","Qing",""],["Liu","Anji",""],["Ma","Xiaojian",""],["Liang","Yitao",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 13:46:11 GMT"}],"updateDate":"2024-07-02","timestamp":1719495971000,"abstract":"  We present OmniJARVIS, a novel Vision-Language-Action (VLA) model for\nopen-world instruction-following agents in open-world Minecraft. Compared to\nprior works that either emit textual goals to separate controllers or produce\nthe control command directly, OmniJARVIS seeks a different path to ensure both\nstrong reasoning and efficient decision-making capabilities via unified\ntokenization of multimodal interaction data. First, we introduce a\nself-supervised approach to learn a behavior encoder that produces discretized\ntokens for behavior trajectories $\\tau$ = {$o_0$, $a_0$, $\\dots$} and an\nimitation learning (IL) policy decoder conditioned on these tokens. These\nadditional behavior tokens will be augmented to the vocabulary of pretrained\nMultimodal Language Models (MLMs). With this encoder, we then pack long-term\nmultimodal interactions involving task instructions, memories, thoughts,\nobservations, textual responses, behavior trajectories, etc. into unified token\nsequences and model them with autoregressive transformers. Thanks to the\nsemantically meaningful behavior tokens, the resulting VLA model, OmniJARVIS,\ncan reason (by producing chain-of-thoughts), plan, answer questions, and act\n(by producing behavior tokens for the IL policy decoder). OmniJARVIS\ndemonstrates excellent performances on a comprehensive collection of atomic,\nprogrammatic, and open-ended tasks in open-world Minecraft. Our analysis\nfurther unveils the crucial design principles in interaction data formation,\nunified tokenization, and its scaling potentials.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZiNBVngTgNdp0f-0rrDv3oqeC9lAsDbTzJq3QvNYXTs","pdfSize":"5075823","objectId":"0xfe349e69c177e2d5dbe89d161a53b79db4193b2d5a62959c3ed7e92e1073aeba","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
