{"id":"2407.16006","title":"ImPress: Securing DRAM Against Data-Disturbance Errors via Implicit\n  Row-Press Mitigation","authors":"Moinuddin Qureshi, Anish Saxena, Aamer Jaleel","authorsParsed":[["Qureshi","Moinuddin",""],["Saxena","Anish",""],["Jaleel","Aamer",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 19:20:14 GMT"}],"updateDate":"2024-07-24","timestamp":1721676014000,"abstract":"  DRAM cells are susceptible to Data-Disturbance Errors (DDE), which can be\nexploited by an attacker to compromise system security. Rowhammer is a\nwell-known DDE vulnerability that occurs when a row is repeatedly activated.\nRowhammer can be mitigated by tracking aggressor rows inside DRAM (in-DRAM) or\nat the Memory Controller (MC). Row-Press (RP) is a new DDE vulnerability that\noccurs when a row is kept open for a long time. RP significantly reduces the\nnumber of activations required to induce an error, thus breaking existing RH\nsolutions. Prior work on Explicit Row-Press mitigation, ExPress, requires the\nmemory controller to limit the maximum row-open-time, and redesign existing\nRowhammer solutions with reduced Rowhammer threshold. Unfortunately, ExPress\nincurs significant performance and storage overheads, and being a memory\ncontroller-based solution, it is incompatible with in-DRAM trackers. In this\npaper, we propose Implicit Row-Press mitigation (ImPress), which does not\nrestrict row-open-time, is compatible with memory controller-based and in-DRAM\nsolutions and does not reduce the tolerated Rowhammer threshold. ImPress treats\na row open for a specified time as equivalent to an activation. We design\nImPress by developing a Unified Charge-Loss Model, which combines the net\neffect of both Rowhammer and Row-Press for arbitrary patterns. We analyze both\ncontroller-based (Graphene and PARA) and in-DRAM trackers (Mithril and MINT).\nWe show that ImPress makes Rowhammer solutions resilient to Row-Press\ntransparently, without affecting the Rowhammer threshold.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gzeGx6WgIGq73ymkIrl481whvlQqZUx9nMh-ISHubGA","pdfSize":"1436122","objectId":"0xf3a5da15f6f8432e9e49fde3f6442b691149f30e19d9094ce73a4818768db9a9","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
