{"id":"2407.07663","title":"Turing patterns on discrete topologies: from networks to higher-order\n  structures","authors":"Riccardo Muolo, Lorenzo Giambagli, Hiroya Nakao, Duccio Fanelli,\n  Timoteo Carletti","authorsParsed":[["Muolo","Riccardo",""],["Giambagli","Lorenzo",""],["Nakao","Hiroya",""],["Fanelli","Duccio",""],["Carletti","Timoteo",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 13:43:56 GMT"}],"updateDate":"2024-07-11","timestamp":1720619036000,"abstract":"  Nature is a blossoming of regular structures, signature of self-organization\nof the underlying microscopic interacting agents. Turing theory of pattern\nformation is one of the most studied mechanisms to address such phenomena and\nhas been applied to a widespread gallery of disciplines. Turing himself used a\nspatial discretization of the hosting support to eventually deal with a set of\nODEs. Such an idea contained the seeds of the theory on discrete support, which\nhas been fully acknowledged with the birth of network science in the early\n2000s. This approach allows us to tackle several settings not displaying a\ntrivial continuous embedding, such as multiplex, temporal networks, and,\nrecently, higher-order structures. This line of research has been mostly\nconfined within the network science community, despite its inherent potential\nto transcend the conventional boundaries of the PDE-based approach to Turing\npatterns. Moreover, network topology allows for novel dynamics to be generated\nvia a universal formalism that can be readily extended to account for\nhigher-order structures. The interplay between continuous and discrete settings\ncan pave the way for further developments in the field.\n","subjects":["Nonlinear Sciences/Pattern Formation and Solitons","Condensed Matter/Statistical Mechanics","Physics/Mathematical Physics","Mathematics/Dynamical Systems","Mathematics/Mathematical Physics","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ESrSwjzzlt8TV3hv4IocGYAMT1lIE5g-NXsOjbvjcFI","pdfSize":"1449101","objectId":"0xf2ef37825463d41d27053b34e97e397ef5649cedb8245ee7538facc01d8615e5","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
