{"id":"2407.10025","title":"Badminton Birdie-Like Aerodynamic Alignment of Drifting Dust Grains by\n  Subsonic Gaseous Flows in Protoplanetary Disks","authors":"Zhe-Yu Daniel Lin, Zhi-Yun Li, Haifeng Yang, Leslie W. Looney, Ian W.\n  Stephens, Manuel Fern\\'andez-L\\'opez, Rachel E. Harrison","authorsParsed":[["Lin","Zhe-Yu Daniel",""],["Li","Zhi-Yun",""],["Yang","Haifeng",""],["Looney","Leslie W.",""],["Stephens","Ian W.",""],["Fernández-López","Manuel",""],["Harrison","Rachel E.",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 23:03:13 GMT"}],"updateDate":"2024-07-16","timestamp":1720911793000,"abstract":"  Recent (sub)millimeter polarization observations of protoplanetary disks\nreveal toroidally aligned, effectively prolate dust grains large enough (at\nleast ~100 $\\mu$m) to efficiently scatter millimeter light. The alignment\nmechanism for these grains remains unclear. We explore the possibility that gas\ndrag aligns grains through gas-dust relative motion when the grain's center of\nmass is offset from its geometric center, analogous to a badminton birdie's\nalignment in flight. A simple grain model of two non-identical spheres\nillustrates how a grain undergoes damped oscillations from flow-induced\nrestoring torques which align its geometric center in the flow direction\nrelative to its center of mass. Assuming specular reflection and subsonic flow,\nwe derive an analytical equation of motion for spheroids where the center of\nmass can be shifted away from the spheroid's geometric center. We show that a\nprolate or an oblate grain can be aligned with the long axis parallel to the\ngas flow when the center of mass is shifted along that axis. Both scenarios can\nexplain the required effectively prolate grains inferred from observations.\nApplication to a simple disk model shows that the alignment timescales are\nshorter than or comparable to the orbital time. The grain alignment direction\nin a disk depends on the disk (sub-)structure and grain Stokes number (St) with\nazimuthal alignment for large St grains in sub-Keplerian smooth gas disks and\nfor small St grains near the gas pressure extrema, such as rings and gaps.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"K3Ia8KeIhtfimkttd0G0_HB83cPSLl_I9yd5vQNQVLg","pdfSize":"3315612","objectId":"0x959de0e4017bf5313fc7686faed5b5bea47e035fc46fbe85c037103210ed522e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
