{"id":"2407.15249","title":"Hurricane Evacuation Analysis with Large-scale Mobile Device Location\n  Data during Hurricane Ian","authors":"Luyu Liu, Xiaojian Zhang, Shangkun Jiang, Xilei Zhao","authorsParsed":[["Liu","Luyu",""],["Zhang","Xiaojian",""],["Jiang","Shangkun",""],["Zhao","Xilei",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 19:27:50 GMT"}],"updateDate":"2024-07-23","timestamp":1721590070000,"abstract":"  Hurricane Ian is the deadliest and costliest hurricane in Florida's history,\nwith 2.5 million people ordered to evacuate. As we witness increasingly severe\nhurricanes in the context of climate change, mobile device location data offers\nan unprecedented opportunity to study hurricane evacuation behaviors. With a\nterabyte-level GPS dataset, we introduce a holistic hurricane evacuation\nbehavior algorithm with a case study of Ian: we infer evacuees' departure time\nand categorize them into different behavioral groups, including self,\nvoluntary, mandatory, shadow and in-zone evacuees. Results show the landfall\narea (Fort Myers, Lee County) had lower out-of-zone but higher overall\nevacuation rate, while the predicted landfall area (Tampa, Hillsborough County)\nhad the opposite, suggesting the effects of delayed evacuation order.\nOut-of-zone evacuation rates would increase from shore to inland.\nSpatiotemporal analysis identified three evacuation waves: during formation,\nbefore landfall, and after landfall. These insights are valuable for enhancing\nfuture disaster planning and management.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Emerging Technologies","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"hlj02M0ZQmGNYbSGl4Zd-G2NrcaNO8qZ0ox4mVxbLKg","pdfSize":"2722574","objectId":"0x47973c115119f619a4e5557eea6a446b3590362aeacbfe771d940073dd4ad41a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
