{"id":"2407.13533","title":"VeriQR: A Robustness Verification Tool for Quantum Machine Learning\n  Models","authors":"Yanling Lin, Ji Guan, Wang Fang, Mingsheng Ying and Zhaofeng Su","authorsParsed":[["Lin","Yanling",""],["Guan","Ji",""],["Fang","Wang",""],["Ying","Mingsheng",""],["Su","Zhaofeng",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 14:06:02 GMT"}],"updateDate":"2024-07-19","timestamp":1721311562000,"abstract":"  Adversarial noise attacks present a significant threat to quantum machine\nlearning (QML) models, similar to their classical counterparts. This is\nespecially true in the current Noisy Intermediate-Scale Quantum era, where\nnoise is unavoidable. Therefore, it is essential to ensure the robustness of\nQML models before their deployment. To address this challenge, we introduce\n\\textit{VeriQR}, the first tool designed specifically for formally verifying\nand improving the robustness of QML models, to the best of our knowledge. This\ntool mimics real-world quantum hardware's noisy impacts by incorporating random\nnoise to formally validate a QML model's robustness. \\textit{VeriQR} supports\nexact (sound and complete) algorithms for both local and global robustness\nverification. For enhanced efficiency, it implements an under-approximate\n(complete) algorithm and a tensor network-based algorithm to verify local and\nglobal robustness, respectively. As a formal verification tool, \\textit{VeriQR}\ncan detect adversarial examples and utilize them for further analysis and to\nenhance the local robustness through adversarial training, as demonstrated by\nexperiments on real-world quantum machine learning models. Moreover, it permits\nusers to incorporate customized noise. Based on this feature, we assess\n\\textit{VeriQR} using various real-world examples, and experimental outcomes\nconfirm that the addition of specific quantum noise can enhance the global\nrobustness of QML models. These processes are made accessible through a\nuser-friendly graphical interface provided by \\textit{VeriQR}, catering to\ngeneral users without requiring a deep understanding of the counter-intuitive\nprobabilistic nature of quantum computing.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KfkTVlk8P5pAPLTD-oCfz0rlwxLERbAoi5cZsrGKIzY","pdfSize":"1648318","objectId":"0x2cce51f89fa09f111aed8dfe519cfde237b36898cab0f04e0deb0c23e61a82d2","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
