{"id":"2407.11296","title":"Modeling Foreground Spatial Variations in 21 cm Gaussian Process\n  Component Separation","authors":"Kangning Diao, Richard D.P. Grumitt, Yi Mao","authorsParsed":[["Diao","Kangning",""],["Grumitt","Richard D. P.",""],["Mao","Yi",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 00:57:41 GMT"}],"updateDate":"2024-07-17","timestamp":1721091461000,"abstract":"  Gaussian processes (GPs) have been extensively utilized as nonparametric\nmodels for component separation in 21 cm data analyses. This exploits the\ndistinct spectral behavior of the cosmological and foreground signals, which\nare modeled through the GP covariance kernel. Previous approaches have employed\na global GP kernel along all lines of sight (LoS). In this work, we study\nBayesian approaches that allow for spatial variations in foreground kernel\nparameters, testing them against simulated HI intensity mapping observations.\nWe consider a no-pooling (NP) model, which treats each LoS independently by\nfitting for separate covariance kernels, and a hierarchical Gaussian Process\n(HGP) model that allows for variation in kernel parameters between different\nLoS, regularized through a global hyperprior. We find that accounting for\nspatial variations in the GP kernel parameters results in a significant\nimprovement in cosmological signal recovery, achieving up to a 30% reduction in\nthe standard deviation of the residual distribution and improved model\npredictive performance. Allowing for spatial variations in GP kernel parameters\nalso improves the recovery of the HI power spectra and wavelet scattering\ntransform coefficients. Whilst the NP model achieves superior recovery as\nmeasured by the residual distribution, it demands extensive computational\nresources, faces formidable convergence challenges, and is prone to\noverfitting. Conversely, the HGP model strikes a balance between the accuracy\nand robustness of the signal recovery. Further improvements to the HGP model\nwill require more physically motivated modeling of foreground spatial\nvariations.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XXUY3dgTEaJ8Sal9NMmS91qyZcjmhJrOLJ0jc8ggJ64","pdfSize":"2695487","objectId":"0x4c3ffa4d86c15e52099921bc970cf5971959404166ec98199a5054267eacc0d6","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
