{"id":"2407.16214","title":"Diff-Shadow: Global-guided Diffusion Model for Shadow Removal","authors":"Jinting Luo, Ru Li, Chengzhi Jiang, Mingyan Han, Xiaoming Zhang, Ting\n  Jiang, Haoqiang Fan, Shuaicheng Liu","authorsParsed":[["Luo","Jinting",""],["Li","Ru",""],["Jiang","Chengzhi",""],["Han","Mingyan",""],["Zhang","Xiaoming",""],["Jiang","Ting",""],["Fan","Haoqiang",""],["Liu","Shuaicheng",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 06:42:55 GMT"}],"updateDate":"2024-07-24","timestamp":1721716975000,"abstract":"  We propose Diff-Shadow, a global-guided diffusion model for high-quality\nshadow removal. Previous transformer-based approaches can utilize global\ninformation to relate shadow and non-shadow regions but are limited in their\nsynthesis ability and recover images with obvious boundaries. In contrast,\ndiffusion-based methods can generate better content but ignore global\ninformation, resulting in inconsistent illumination. In this work, we combine\nthe advantages of diffusion models and global guidance to realize shadow-free\nrestoration. Specifically, we propose a parallel UNets architecture: 1) the\nlocal branch performs the patch-based noise estimation in the diffusion\nprocess, and 2) the global branch recovers the low-resolution shadow-free\nimages. A Reweight Cross Attention (RCA) module is designed to integrate global\ncontextural information of non-shadow regions into the local branch. We further\ndesign a Global-guided Sampling Strategy (GSS) that mitigates patch boundary\nissues and ensures consistent illumination across shaded and unshaded regions\nin the recovered image. Comprehensive experiments on three publicly standard\ndatasets ISTD, ISTD+, and SRD have demonstrated the effectiveness of\nDiff-Shadow. Compared to state-of-the-art methods, our method achieves a\nsignificant improvement in terms of PSNR, increasing from 32.33dB to 33.69dB on\nthe SRD dataset. Codes will be released.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"iSvuZpvMOxAuH2hfIt5Pr5p8lLPz6102OvzRWD6y_Mg","pdfSize":"5152799","objectId":"0xd4753e6d21252232287c38dafefaa7e33a815e68415652e91ee88f55cfd709b2","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
