{"id":"2407.08599","title":"Goodness of fit of relational event models","authors":"Martina Boschi and Ernst-Jan Camiel Wit","authorsParsed":[["Boschi","Martina",""],["Wit","Ernst-Jan Camiel",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 15:25:41 GMT"}],"updateDate":"2024-07-12","timestamp":1720711541000,"abstract":"  A type of dynamic network involves temporally ordered interactions between\nactors, where past network configurations may influence future ones. The\nrelational event model can be used to identify the underlying dynamics that\ndrive interactions among system components. Despite the rapid development of\nthis model over the past 15 years, an ongoing area of research revolves around\nevaluating the goodness of fit of this model, especially when it incorporates\ntime-varying and random effects. Current methodologies often rely on comparing\nobserved and simulated events using specific statistics, but this can be\ncomputationally intensive, and requires various assumptions.\n  We propose an additive mixed-effect relational event model estimated via\ncase-control sampling, and introduce a versatile framework for testing the\ngoodness of fit of such models using weighted martingale residuals. Our focus\nis on a Kolmogorov-Smirnov type test designed to assess if covariates are\naccurately modeled. Our approach can be easily extended to evaluate whether\nother features of network dynamics have been appropriately incorporated into\nthe model. We assess the goodness of fit of various relational event models\nusing synthetic data to evaluate the test's power and coverage. Furthermore, we\napply the method to a social study involving 57,791 emails sent by 159\nemployees of a Polish manufacturing company in 2010.\n  The method is implemented in the R package mgcv.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UJ6NNwXR0CHoJnHvp5t0em6EkcAff3ylGTpEDsEhgi8","pdfSize":"2653893","objectId":"0x98e03c231cabd8c0c87f851b8a347079da5921cf4e384465b6ea276eb71856e4","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
