{"id":"2407.18320","title":"Solving physics-based initial value problems with unsupervised machine\n  learning","authors":"Jack Griffiths, Steven A. Wrathmall and Simon A. Gardiner","authorsParsed":[["Griffiths","Jack",""],["Wrathmall","Steven A.",""],["Gardiner","Simon A.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 18:21:26 GMT"}],"updateDate":"2024-07-29","timestamp":1721931686000,"abstract":"  Initial value problems -- a system of ordinary differential equations and\ncorresponding initial conditions -- can be used to describe many physical\nphenomena including those arise in classical mechanics. We have developed a\nnovel approach to solve physics-based initial value problems using unsupervised\nmachine learning. We propose a deep learning framework that models the dynamics\nof a variety of mechanical systems through neural networks. Our framework is\nflexible, allowing us to solve non-linear, coupled, and chaotic dynamical\nsystems. We demonstrate the effectiveness of our approach on systems including\na free particle, a particle in a gravitational field, a classical pendulum, and\nthe H\\'enon--Heiles system (a pair of coupled harmonic oscillators with a\nnon-linear perturbation, used in celestial mechanics). Our results show that\ndeep neural networks can successfully approximate solutions to these problems,\nproducing trajectories which conserve physical properties such as energy and\nthose with stationary action. We note that probabilistic activation functions,\nas defined in this paper, are required to learn any solutions of initial value\nproblems in their strictest sense, and we introduce coupled neural networks to\nlearn solutions of coupled systems.\n","subjects":["Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"s20kymukfX3tAuxhRKE84k-2UrGdideOrdH2qCHuk0g","pdfSize":"3367968","objectId":"0xa9bfedc80d55f6ac867268c49f6ab0a047081b201ed29a40001d0e653a7f795f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
