{"id":"2407.01673","title":"Singular Excitement Beyond the Horizon of a Rotating Black Hole","authors":"Sijia Wang, Mar\\'ia Rosa Preciado-Rivas, Massimilano Spadafora, Robert\n  B. Mann","authorsParsed":[["Wang","Sijia",""],["Preciado-Rivas","María Rosa",""],["Spadafora","Massimilano",""],["Mann","Robert B.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-08","timestamp":1719856801000,"abstract":"  Previous studies have shown that an Unruh-DeWitt (UDW) detector, when coupled\nlinearly to a massless scalar field and permitted to fall radially into certain\nblack holes, will exhibit non-monotonicity in its transition properties near\nthe horizon. Specifically, the transition probability of a detector freely\nfalling into a (3+1)-dimensional Schawrzschild black hole, when considering the\nUnruh and Hartle-Hawking vacuum states, was shown to possess a local extremum\nat horizon crossing [K.K. Ng et al., New J. Phys. 24 (2022) 103018]. The\ntransition rate of a detector falling into a static (2+1)-dimensional\nBa\\~nados-Teitelboim-Zanelli (BTZ) black hole, for the Hartle-Hawking state,\nwas also found to have multiple local extrema near the horizon under certain\nparameter settings [M.R. Preciado-Rivas et al., arXiv:2402.14908v1]. These\ndiscoveries are of interest, as they suggest that the event horizon of a black\nhole may be distinguishable to a local probe when QFT effects are included. In\nthis paper, we explore the problem of a UDW detector falling freely into a\nrotating BTZ black hole. We numerically compute the detector's transition rate\nfor different values of black hole mass, black hole angular momentum, detector\nenergy gap, and field boundary conditions at infinity. Our results lead to a\nmore generalized description of the behaviour of particle detectors in BTZ\nblack hole spacetime, from which the previous non-rotating BTZ case can be\nretrieved in the limit as angular momentum vanishes.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VMV-PXlr_bJOvCJCVpPsmiJ-pvi1gTOUHfBrbvIVWHQ","pdfSize":"1419921","objectId":"0x1bdaa99c18bc149a8d5288bfefa1445cc64c88c4c118e9f163dc2d6c4f37337d","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
