{"id":"2407.14615","title":"The Simons Observatory: A Minimum-Cost Matching Algorithm for Pairing\n  Measured Resonances with Designed Detectors","authors":"Jack Lashner, Kaiwen Zheng, Kevin T. Crowley, Nicholas Galitzki,\n  Kathleen Harrington, Hironobu Nakata, Max Silva-Feaver","authorsParsed":[["Lashner","Jack",""],["Zheng","Kaiwen",""],["Crowley","Kevin T.",""],["Galitzki","Nicholas",""],["Harrington","Kathleen",""],["Nakata","Hironobu",""],["Silva-Feaver","Max",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 18:14:04 GMT"}],"updateDate":"2024-07-23","timestamp":1721412844000,"abstract":"  The Simons Observatory (SO) is a ground-based cosmic microwave background\nexperiment currently being deployed to Cerro Toco in the Atacama Desert of\nChile. The initial deployment of SO, consisting of three 0.46m-diameter\nsmall-aperture telescopes and one 6m-primary large-aperture telescope, will\nfield over 60,000 transition-edge sensors that will observe at frequencies\nbetween 30 GHz and 280 GHz. SO will read out its detectors using\nSuperconducting Quantum Interference Device (SQUID) microwave-frequency\nmultiplexing $\\mu$mux, a form of frequency division multiplexing where an\nRF-SQUID couples each TES bolometer to a superconducting resonator tuned to a\nunique frequency. Resonator frequencies are spaced roughly every 2 MHz between\n4 and 6 GHz, allowing for multiplexing factors on the order of 1000. One\nchallenge of $\\mu$mux is matching each tracked resonator with its corresponding\nphysical detector. Variations in resonator fabrication, and frequency shifts\nbetween cooldowns caused by trapped flux can cause the measured resonance\nfrequencies to deviate significantly from their designed values. In this study,\nwe introduce a method for pairing measured and designed resonators by\nconstructing a bipartite graph based on the two resonator sets, and assigning\nedge weights based on measured resonator and detector properties such as\nresonance frequency, detector pointing, and assigned bias lines. Finding the\nminimum-cost matching for a given set of edge weights is a well-studied problem\nthat can be solved very quickly, and this matching tells us the best assignment\nof measured resonators to designed detectors for our input parameters. We will\npresent results based on the first on-sky measurements from SAT1, the first SO\nMF small-aperture telescope.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SSAH3DZpfDsnBp8hKcCFGGVcUwrcuBoukZYxiKdGhtA","pdfSize":"1181105","objectId":"0x4fcc3a17eba52f2c74b958cb3d9753411042f3c1c29474ad07c6f17ba0209ce6","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
