{"id":"2407.06835","title":"A flexible model for Record Linkage","authors":"Kayan\\'e Robach, St\\'ephanie van der Pas, Mark van de Wiel and Michel\n  H. Hof","authorsParsed":[["Robach","Kayané",""],["van der Pas","Stéphanie",""],["van de Wiel","Mark",""],["Hof","Michel H.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 13:13:24 GMT"}],"updateDate":"2024-07-10","timestamp":1720530804000,"abstract":"  Combining data from various sources empowers researchers to explore\ninnovative questions, for example those raised by conducting healthcare\nmonitoring studies. However, the lack of a unique identifier often poses\nchallenges. Record linkage procedures determine whether pairs of observations\ncollected on different occasions belong to the same individual using partially\nidentifying variables (e.g. birth year, postal code). Existing methodologies\ntypically involve a compromise between computational efficiency and accuracy.\nTraditional approaches simplify this task by condensing information, yet they\nneglect dependencies among linkage decisions and disregard the one-to-one\nrelationship required to establish coherent links. Modern approaches offer a\ncomprehensive representation of the data generation process, at the expense of\ncomputational overhead and reduced flexibility. We propose a flexible method,\nthat adapts to varying data complexities, addressing registration errors and\naccommodating changes of the identifying information over time. Our approach\nbalances accuracy and scalability, estimating the linkage using a Stochastic\nExpectation Maximisation algorithm on a latent variable model. We illustrate\nthe ability of our methodology to connect observations using large real data\napplications and demonstrate the robustness of our model to the linking\nvariables quality in a simulation study. The proposed algorithm FlexRL is\nimplemented and available in an open source R package.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0POL-lqQTVhQ5YsfmOc-miKaOFL2_vWCaUXGVztbo14","pdfSize":"507058"}
