{"id":"2407.16102","title":"Augmented Efficiency: Reducing Memory Footprint and Accelerating\n  Inference for 3D Semantic Segmentation through Hybrid Vision","authors":"Aditya Krishnan, Jayneel Vora, Prasant Mohapatra","authorsParsed":[["Krishnan","Aditya",""],["Vora","Jayneel",""],["Mohapatra","Prasant",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 00:04:10 GMT"}],"updateDate":"2024-07-24","timestamp":1721693050000,"abstract":"  Semantic segmentation has emerged as a pivotal area of study in computer\nvision, offering profound implications for scene understanding and elevating\nhuman-machine interactions across various domains. While 2D semantic\nsegmentation has witnessed significant strides in the form of lightweight,\nhigh-precision models, transitioning to 3D semantic segmentation poses distinct\nchallenges. Our research focuses on achieving efficiency and lightweight design\nfor 3D semantic segmentation models, similar to those achieved for 2D models.\nSuch a design impacts applications of 3D semantic segmentation where memory and\nlatency are of concern. This paper introduces a novel approach to 3D semantic\nsegmentation, distinguished by incorporating a hybrid blend of 2D and 3D\ncomputer vision techniques, enabling a streamlined, efficient process.\n  We conduct 2D semantic segmentation on RGB images linked to 3D point clouds\nand extend the results to 3D using an extrusion technique for specific class\nlabels, reducing the point cloud subspace. We perform rigorous evaluations with\nthe DeepViewAgg model on the complete point cloud as our baseline by measuring\nthe Intersection over Union (IoU) accuracy, inference time latency, and memory\nconsumption. This model serves as the current state-of-the-art 3D semantic\nsegmentation model on the KITTI-360 dataset. We can achieve heightened accuracy\noutcomes, surpassing the baseline for 6 out of the 15 classes while maintaining\na marginal 1% deviation below the baseline for the remaining class labels. Our\nsegmentation approach demonstrates a 1.347x speedup and about a 43% reduced\nmemory usage compared to the baseline.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2-fR2xZI3vR3d7wyDMMCsI6KyOweevHYSGeBeaiE0Ik","pdfSize":"2648826","objectId":"0xcf249bd6559140dece152437b39b1ef9f5b35e0f768d6ae2d15a5e0630d4d2e7","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
