{"id":"2407.21062","title":"Hybrid Heuristic Algorithms for Adiabatic Quantum Machine Learning\n  Models","authors":"Bahram Alidaee, Haibo Wang, Lutfu Sua, and Wade Liu","authorsParsed":[["Alidaee","Bahram",""],["Wang","Haibo",""],["Sua","Lutfu",""],["Liu","Wade",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 19:31:58 GMT"}],"updateDate":"2024-08-01","timestamp":1722022318000,"abstract":"  The recent developments of adiabatic quantum machine learning (AQML) methods\nand applications based on the quadratic unconstrained binary optimization\n(QUBO) model have received attention from academics and practitioners.\nTraditional machine learning methods such as support vector machines, balanced\nk-means clustering, linear regression, Decision Tree Splitting, Restricted\nBoltzmann Machines, and Deep Belief Networks can be transformed into a QUBO\nmodel. The training of adiabatic quantum machine learning models is the\nbottleneck for computation. Heuristics-based quantum annealing solvers such as\nSimulated Annealing and Multiple Start Tabu Search (MSTS) are implemented to\nspeed up the training of AQML based on the QUBO model. The main purpose of this\npaper is to present a hybrid heuristic embedding an r-flip strategy to solve\nlarge-scale QUBO with an improved solution and shorter computing time compared\nto the state-of-the-art MSTS method. The results of the substantial\ncomputational experiments are reported to compare an r-flip strategy embedded\nhybrid heuristic and a multiple start tabu search algorithm on a set of\nbenchmark instances and three large-scale QUBO instances. The r-flip strategy\nembedded algorithm provides very high-quality solutions within the CPU time\nlimits of 60 and 600 seconds.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ELIkDAOaH-op4444CNNX9_p1FyDivplvvh3h48ZG3Ho","pdfSize":"591826","objectId":"0x4e47f8eb8b5878591885ad10252dd1030bc3383d5b2269f59ae1433de565a098","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
