{"id":"2407.11838","title":"Adaptive Resolution Force Probe Simulations: Coarse Graining in the\n  Ideal Gas Approximation","authors":"Marco Oestereich, J\\\"urgen Gauss, and Gregor Diezemann","authorsParsed":[["Oestereich","Marco",""],["Gauss","Jürgen",""],["Diezemann","Gregor",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:23:34 GMT"}],"updateDate":"2024-07-17","timestamp":1721143414000,"abstract":"  The unfolding of molecular complexes or biomolecules under the influence of\nexternal mechanical forces can routinely be simulated with atomistic\nresolution. To obtain a match of the characteristic time scales with those of\nexperimental force spectroscopy, often coarse graining procedures are employed.\nHere, building on a previous study, we apply the adaptice resolution scheme\n(AdResS) to force probe molecular dynamics (FPMD) simulations using two model\nsystems as examples. One system is the previously investigated calix[4]arene\ndimer that shows reversible one-step unfolding and the other example is\nprovided by a small peptide, a $\\beta$-alanine octamer in methanol solvent. The\nmechanical unfolding of this peptide proceeds via a metastable intermediate and\ntherefore represents a first step towards a complex unfolding pathway. In\naddition to increasing the complexity of the relevant conformational changes we\nstudy the impact of the methodology used for coarse graining. Apart from a\nstandard technique, the iterative Boltzmann inversion method, we apply an ideal\ngas approximation and therefore we replace the solvent by a non-interacting\nsystem of spherical particles. In all cases we find excellent agreement between\nthe results of FPMD simulations performed fully atomistically and the AdResS\nsimulations also in the case of fast pulling. This holds for all details of the\nunfolding pathways like the distributions of the characteristic forces and also\nthe sequence of hydrogen-bond opening in case of the $\\beta$-alanine octamer.\nTherefore, the methodology is very well suited to simulate the mechanical\nunfolding of systems of experimental relevance also in the presence of protic\nsolvents.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ov_nOpch_1xveB6P3TijzpfOJStu2HJk0ONjz0sj_5g","pdfSize":"3519962","objectId":"0x52014239a61e1374beba34dbdc0a87319c50151be00559a6e01a583a9d5817d8","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
