{"id":"2407.20387","title":"Two-Phase Segmentation Approach for Accurate Left Ventricle Segmentation\n  in Cardiac MRI using Machine Learning","authors":"Maria Tamoor, Abbas Raza Ali, Philemon Philip, Ruqqayia Adil, Rabia\n  Shahid, Asma Naseer","authorsParsed":[["Tamoor","Maria",""],["Ali","Abbas Raza",""],["Philip","Philemon",""],["Adil","Ruqqayia",""],["Shahid","Rabia",""],["Naseer","Asma",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 19:26:24 GMT"}],"updateDate":"2024-07-31","timestamp":1722281184000,"abstract":"  Accurate segmentation of the Left Ventricle (LV) holds substantial importance\ndue to its implications in disease detection, regional analysis, and the\ndevelopment of complex models for cardiac surgical planning. CMR is a golden\nstandard for diagnosis of serveral cardiac diseases. LV in CMR comprises of\nthree distinct sections: Basal, Mid-Ventricle, and Apical. This research\nfocuses on the precise segmentation of the LV from Cardiac MRI (CMR) scans,\njoining with the capabilities of Machine Learning (ML). The central challenge\nin this research revolves around the absence of a set of parameters applicable\nto all three types of LV slices. Parameters optimized for basal slices often\nfall short when applied to mid-ventricular and apical slices, and vice versa.\nTo handle this issue, a new method is proposed to enhance LV segmentation. The\nproposed method involves using distinct sets of parameters for each type of\nslice, resulting in a two-phase segmentation approach. The initial phase\ncategorizes images into three groups based on the type of LV slice, while the\nsecond phase aims to segment CMR images using parameters derived from the\npreceding phase. A publicly available dataset (Automated Cardiac Diagnosis\nChallenge (ACDC)) is used. 10-Fold Cross Validation is used and it achieved a\nmean score of 0.9228. Comprehensive testing indicates that the best parameter\nset for a particular type of slice does not perform adequately for the other\nslice types. All results show that the proposed approach fills a critical void\nin parameter standardization through a two-phase segmentation model for the LV,\naiming to not only improve the accuracy of cardiac image analysis but also\ncontribute advancements to the field of LV segmentation.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"RvNa3TU_qDEE-XvSHzI4PgXmSHx7xmFsK0U1A1dzREU","pdfSize":"994801","objectId":"0x381144818aac4c29f2979b58c934e931f66c5e1f5cae8b8a931835c9ea49fd2f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
