{"id":"2407.09562","title":"Edge AI-Enabled Chicken Health Detection Based on Enhanced FCOS-Lite and\n  Knowledge Distillation","authors":"Qiang Tong, Jinrui Wang, Wenshuang Yang, Songtao Wu, Wenqi Zhang, Chen\n  Sun, Kuanhong Xu","authorsParsed":[["Tong","Qiang",""],["Wang","Jinrui",""],["Yang","Wenshuang",""],["Wu","Songtao",""],["Zhang","Wenqi",""],["Sun","Chen",""],["Xu","Kuanhong",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 10:21:07 GMT"}],"updateDate":"2024-07-16","timestamp":1720002067000,"abstract":"  The utilization of AIoT technology has become a crucial trend in modern\npoultry management, offering the potential to optimize farming operations and\nreduce human workloads. This paper presents a real-time and compact edge-AI\nenabled detector designed to identify chickens and their healthy statuses using\nframes captured by a lightweight and intelligent camera equipped with an\nedge-AI enabled CMOS sensor. To ensure efficient deployment of the proposed\ncompact detector within the memory-constrained edge-AI enabled CMOS sensor, we\nemploy a FCOS-Lite detector leveraging MobileNet as the backbone. To mitigate\nthe issue of reduced accuracy in compact edge-AI detectors without incurring\nadditional inference costs, we propose a gradient weighting loss function as\nclassification loss and introduce CIOU loss function as localization loss.\nAdditionally, we propose a knowledge distillation scheme to transfer valuable\ninformation from a large teacher detector to the proposed FCOS-Lite detector,\nthereby enhancing its performance while preserving a compact model size.\nExperimental results demonstrate the proposed edge-AI enabled detector achieves\ncommendable performance metrics, including a mean average precision (mAP) of\n95.1$\\%$ and an F1-score of 94.2$\\%$, etc. Notably, the proposed detector can\nbe efficiently deployed and operates at a speed exceeding 20 FPS on the edge-AI\nenabled CMOS sensor, achieved through int8 quantization. That meets practical\ndemands for automated poultry health monitoring using lightweight intelligent\ncameras with low power consumption and minimal bandwidth costs.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"hEDHHie6v29UdjlCuQ59JxOPvkDplqBe11iBshvsnCo","pdfSize":"24249938","objectId":"0xb25081d4acf03c2e711672f118a3201016e9b8769bd927683d607ccc9ffcd31d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
