{"id":"2407.10105","title":"Hierarchical Multi-modal Transformer for Cross-modal Long Document\n  Classification","authors":"Tengfei Liu, Yongli Hu, Junbin Gao, Yanfeng Sun, Baocai Yin","authorsParsed":[["Liu","Tengfei",""],["Hu","Yongli",""],["Gao","Junbin",""],["Sun","Yanfeng",""],["Yin","Baocai",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 07:12:25 GMT"}],"updateDate":"2024-07-16","timestamp":1720941145000,"abstract":"  Long Document Classification (LDC) has gained significant attention recently.\nHowever, multi-modal data in long documents such as texts and images are not\nbeing effectively utilized. Prior studies in this area have attempted to\nintegrate texts and images in document-related tasks, but they have only\nfocused on short text sequences and images of pages. How to classify long\ndocuments with hierarchical structure texts and embedding images is a new\nproblem and faces multi-modal representation difficulties. In this paper, we\npropose a novel approach called Hierarchical Multi-modal Transformer (HMT) for\ncross-modal long document classification. The HMT conducts multi-modal feature\ninteraction and fusion between images and texts in a hierarchical manner. Our\napproach uses a multi-modal transformer and a dynamic multi-scale multi-modal\ntransformer to model the complex relationships between image features, and the\nsection and sentence features. Furthermore, we introduce a new interaction\nstrategy called the dynamic mask transfer module to integrate these two\ntransformers by propagating features between them. To validate our approach, we\nconduct cross-modal LDC experiments on two newly created and two publicly\navailable multi-modal long document datasets, and the results show that the\nproposed HMT outperforms state-of-the-art single-modality and multi-modality\nmethods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9pWqmbz3BVhv84SnFDauZUfn1sFeiHHzYfQoXjg5HgY","pdfSize":"7119903","objectId":"0x8872c0b264eadb5f7674c4f987f558f74028835a30f5d30e149310cdf645008a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
