{"id":"2407.08948","title":"Symmetry Awareness Encoded Deep Learning Framework for Brain Imaging\n  Analysis","authors":"Yang Ma, Dongang Wang, Peilin Liu, Lynette Masters, Michael Barnett,\n  Weidong Cai, Chenyu Wang","authorsParsed":[["Ma","Yang",""],["Wang","Dongang",""],["Liu","Peilin",""],["Masters","Lynette",""],["Barnett","Michael",""],["Cai","Weidong",""],["Wang","Chenyu",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 03:08:15 GMT"}],"updateDate":"2024-07-15","timestamp":1720753695000,"abstract":"  The heterogeneity of neurological conditions, ranging from structural\nanomalies to functional impairments, presents a significant challenge in\nmedical imaging analysis tasks. Moreover, the limited availability of\nwell-annotated datasets constrains the development of robust analysis models.\nAgainst this backdrop, this study introduces a novel approach leveraging the\ninherent anatomical symmetrical features of the human brain to enhance the\nsubsequent detection and segmentation analysis for brain diseases. A novel\nSymmetry-Aware Cross-Attention (SACA) module is proposed to encode symmetrical\nfeatures of left and right hemispheres, and a proxy task to detect symmetrical\nfeatures as the Symmetry-Aware Head (SAH) is proposed, which guides the\npretraining of the whole network on a vast 3D brain imaging dataset comprising\nboth healthy and diseased brain images across various MRI and CT. Through\nmeticulous experimentation on downstream tasks, including both classification\nand segmentation for brain diseases, our model demonstrates superior\nperformance over state-of-the-art methodologies, particularly highlighting the\nsignificance of symmetry-aware learning. Our findings advocate for the\neffectiveness of incorporating symmetry awareness into pretraining and set a\nnew benchmark for medical imaging analysis, promising significant strides\ntoward accurate and efficient diagnostic processes. Code is available at\nhttps://github.com/bitMyron/sa-swin.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"23gUL7gCTDBi7aRj4KwUgmAPVshp2UweIWqwy-tMGis","pdfSize":"1948881","objectId":"0xa42db93b65c38939084d58fca2dc443b0fda67a47352f803823dcf018daeeee3","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
