{"id":"2407.20670","title":"Transferability of Photometric Redshifts Determined using Machine\n  Learning","authors":"Lara Janiurek, Martin A. Hendry and Fiona C. Speirits","authorsParsed":[["Janiurek","Lara",""],["Hendry","Martin A.",""],["Speirits","Fiona C.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 09:07:41 GMT"}],"updateDate":"2024-07-31","timestamp":1722330461000,"abstract":"  In this work the random forest algorithm GALPRO is implemented to generate\nphotometric redshift posteriors, and its performance when trained and then\napplied to data from another survey is investigated. The algorithm is initially\ncalibrated using a truth dataset compiled from the DESI Legacy survey. We find\nthat the testing and training datasets must have very similar redshift\ndistributions, with the range of their photometric data overlapping by at least\n90% in the appropriate photometric bands in order for the training data to be\napplicable to the testing data. Then GALPRO is again trained using the DESI\ndataset and then applied to a sample drawn from the PanSTARRS survey, to\nexplore whether GALPRO can be first trained using a trusted dataset and then\napplied to an entirely new survey, albeit one that uses a different magnitude\nsystem for its photometric bands, thus requiring careful conversion of the\nmeasured magnitudes for the new survey before GALPRO can be applied. The\nresults of this further test indicate that GALPRO does not produce accurate\nphotometric redshift posteriors for the new survey, even where the distribution\nof redshifts for the two datasets overlaps by over 90%. Hence, we conclude that\nthe photometric redshifts generated by GALPRO are not suitable for generating\nestimates of photometric redshifts and their posterior distribution functions\nwhen applied to an entirely new survey, particularly one that uses a different\nmagnitude system. However, our results demonstrate that GALPRO is a useful tool\nfor inferring photometric redshift estimates in the case where a spectroscopic\ngalaxy survey is nearly complete, but is missing some spectroscopic redshift\nvalues.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HP6XqiCxdvCy5jdQNyUyMbrKSbV6ErhB72dNT6CiDPk","pdfSize":"942292","objectId":"0x2e9bed7939f2bf461de09d833fe24d938c6dbec7bb70c5c8102a71b014d5630e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
