{"id":"2407.09789","title":"Convex space learning for tabular synthetic data generation","authors":"Manjunath Mahendra, Chaithra Umesh, Saptarshi Bej, Kristian Schultz,\n  Olaf Wolkenhauer","authorsParsed":[["Mahendra","Manjunath",""],["Umesh","Chaithra",""],["Bej","Saptarshi",""],["Schultz","Kristian",""],["Wolkenhauer","Olaf",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 07:07:35 GMT"}],"updateDate":"2024-07-16","timestamp":1720854455000,"abstract":"  Generating synthetic samples from the convex space of the minority class is a\npopular oversampling approach for imbalanced classification problems. Recently,\ndeep-learning approaches have been successfully applied to modeling the convex\nspace of minority samples. Beyond oversampling, learning the convex space of\nneighborhoods in training data has not been used to generate entire tabular\ndatasets. In this paper, we introduce a deep learning architecture\n(NextConvGeN) with a generator and discriminator component that can generate\nsynthetic samples by learning to model the convex space of tabular data. The\ngenerator takes data neighborhoods as input and creates synthetic samples\nwithin the convex space of that neighborhood. Thereafter, the discriminator\ntries to classify these synthetic samples against a randomly sampled batch of\ndata from the rest of the data space. We compared our proposed model with five\nstate-of-the-art tabular generative models across ten publicly available\ndatasets from the biomedical domain. Our analysis reveals that synthetic\nsamples generated by NextConvGeN can better preserve classification and\nclustering performance across real and synthetic data than other synthetic data\ngeneration models. Synthetic data generation by deep learning of the convex\nspace produces high scores for popular utility measures. We further compared\nhow diverse synthetic data generation strategies perform in the privacy-utility\nspectrum and produced critical arguments on the necessity of high utility\nmodels. Our research on deep learning of the convex space of tabular data opens\nup opportunities in clinical research, machine learning model development,\ndecision support systems, and clinical data sharing.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"G7lwfsyY80lTv6pkip8hKOeE6H1YA5aBeb4SfCIi9JA","pdfSize":"948748","objectId":"0x27a1eac3e71c276086bdd27a6b328c37370637ed3877e2a6e731bb4c20a87119","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
