{"id":"2407.09128","title":"Nonequilibrium Thermodynamics of Non-Ideal Reaction-Diffusion Systems:\n  Implications for Active Self-Organization","authors":"Francesco Avanzini, Timur Aslyamov, \\'Etienne Fodor, Massimiliano\n  Esposito","authorsParsed":[["Avanzini","Francesco",""],["Aslyamov","Timur",""],["Fodor","Étienne",""],["Esposito","Massimiliano",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 09:48:46 GMT"}],"updateDate":"2024-07-15","timestamp":1720777726000,"abstract":"  We develop a framework describing the dynamics and thermodynamics of open\nnon-ideal reaction-diffusion systems, which embodies Flory-Huggins theories of\nmixtures and chemical reaction network theories. Our theory elucidates the\nmechanisms underpinning the emergence of self-organized dissipative structures\nin these systems. It evaluates the dissipation needed to sustain and control\nthem, discriminating the contributions from each reaction and diffusion process\nwith spatial resolution. It also reveals the role of the reaction network in\npowering and shaping these structures. We identify particular classes of\nnetworks in which diffusion processes always equilibrate within the structures,\nwhile dissipation occurs solely due to chemical reactions. The spatial\nconfigurations resulting from these processes can be derived by minimizing a\nkinetic potential, contrasting with the minimization of the thermodynamic free\nenergy in passive systems. This framework opens the way to investigating the\nenergetic cost of phenomena such as liquid-liquid phase separation,\ncoacervation, and the formation of biomolecular condensates.\n","subjects":["Quantitative Biology/Molecular Networks","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LihpHUAlQty-L-E9kz2j409YVvnWiD-Hl8PkA4noE_U","pdfSize":"5367189","objectId":"0xccef20d71f6048f7c71c8f26598f10cbd9fbe9779a08aa60cb9202f836f6eb12","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
