{"id":"2407.17751","title":"Record nighttime electric power generation at a density of 350 mW/m$^2$\n  via radiative cooling","authors":"Sid Assawaworrarit, Ming Zhou, Lingling Fan, and Shanhui Fan","authorsParsed":[["Assawaworrarit","Sid",""],["Zhou","Ming",""],["Fan","Lingling",""],["Fan","Shanhui",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 04:01:42 GMT"}],"updateDate":"2024-07-26","timestamp":1721880102000,"abstract":"  The coldness of the universe is a thermodynamic resource that has largely\nremained untapped for renewable energy generation. Recently, a growing interest\nin this area has led to a number of studies with the aim to realize the\npotential of tapping this vast resource for energy generation. While the\ntheoretical calculation based on thermodynamic principles places an upper limit\nin the power density at the level of 6000 mW/m$^2$, most experimental\ndemonstrations so far result in much lower power density at the level of tens\nof mW/m$^2$. Here we demonstrate, through design optimization involving the\ntailoring of the thermal radiation spectrum, the minimization of parasitic heat\nleakage, and the maximum conversion of heat to electricity, an energy\ngeneration system harvesting electricity from the thermal radiation of the\nambient heat to the cold universe that achieves a sustained power density of\n350 mW/m$^2$. We further demonstrate a power density at the 1000 mW/m$^2$ level\nusing an additional heat source or heat storage that provides access to heat at\na temperature above ambient. Our work here shows that the coldness of the\nuniverse can be harvested to generate renewable energy at the power density\nlevel that approaches the established bound.\n","subjects":["Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"eBzdk1L2Dqo-SY5va-Iu5l1Tne6nKtdaBzRSTdmUwYk","pdfSize":"869836","objectId":"0x6047c97af9c4f5786c0ed557437885c15bc5b9809c0e622b81c8dffb5b4beaf6","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
