{"id":"2407.16390","title":"Spatial Reuse in IEEE 802.11bn Coordinated Multi-AP WLANs: A Throughput\n  Analysis","authors":"David Nunez, Francesc Wilhelmi, Lorenzo Galati-Giordano, Giovanni\n  Geraci, Boris Bellalta","authorsParsed":[["Nunez","David",""],["Wilhelmi","Francesc",""],["Galati-Giordano","Lorenzo",""],["Geraci","Giovanni",""],["Bellalta","Boris",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 11:24:52 GMT"}],"updateDate":"2024-07-24","timestamp":1721733892000,"abstract":"  IEEE 802.11 networks continuously adapt to meet the stringent requirements of\nemerging applications like cloud gaming, eXtended Reality (XR), and video\nstreaming services, which require high throughput, low latency, and high\nreliability. To address these challenges, Coordinated Spatial Reuse (C-SR) can\npotentially contribute to optimizing spectrum resource utilization. This\nmechanism is expected to enable a higher number of simultaneous transmissions,\nthereby boosting spectral efficiency in dense environments and increasing the\noverall network performance. In this paper, we focus on the performance\nanalysis of C-SR in Wi-Fi 8 networks. In particular, we consider an\nimplementation of C-SR where channel access and inter-Access Point (AP)\ncommunication are performed over-the-air using the Distributed Coordination\nFunction (DCF). For such a purpose, we leverage the well-known Bianchi's\nthroughput model and extend it to support multi-AP transmissions via C-SR.\nNumerical results in a WLAN network that consists of four APs show C-SR\nthroughput gains ranging from 54% to 280% depending on the inter-AP distance\nand the position of the stations in the area.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zV8ERThHyY1qGO4FOmTTionamZqdi03eKdV8VuDd5NQ","pdfSize":"780136","objectId":"0x08a7b62a555f4bbe24a46d6750d0e097356ec153962fe7890ac3db7c66100d46","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
