{"id":"2407.19124","title":"ReactCA: A Cellular Automaton for Predicting Phase Evolution in\n  Solid-State Reactions","authors":"Max C. Gallant (1,2), Matthew J. McDermott (1), Bryant Li (1,2),\n  Kristin A. Persson (1,2) ((1) Materials Sciences Division, Lawrence Berkeley\n  National Laboratory, (2) Department of Materials Science and Engineering,\n  University of California, Berkeley)","authorsParsed":[["Gallant","Max C.",""],["McDermott","Matthew J.",""],["Li","Bryant",""],["Persson","Kristin A.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 23:44:07 GMT"}],"updateDate":"2024-07-30","timestamp":1722037447000,"abstract":"  New computational tools for solid-state synthesis recipe design are needed in\norder to accelerate the experimental realization of novel functional materials\nproposed by high-throughput materials discovery workflows. This work\ncontributes a cellular automaton simulation framework (ReactCA) for predicting\nthe time-dependent evolution of intermediate and product phases during\nsolid-state reactions as a function of precursor choice and amount, reaction\natmosphere, and heating profile. The simulation captures rudimentary kinetic\neffects, the effects of reactant particle spatial distribution, particle\nmelting and reaction atmosphere. It achieves conservation of mass using a\nstochastic, asynchronous evolution rule and estimates reaction rates using\ndensity functional theory data from the Materials Project [1] and machine\nlearning estimators for the the melting point [2] and the vibrational entropy\ncomponent of the Gibbs free energy [3]. The resulting simulation framework\nallows for the prediction of the likely outcome of a reaction recipe before any\nexperiments are performed. We analyze five experimental solid-state recipes for\nBaTiO$_3$, CaZrN$_2$ and YMnO$_3$ found in the literature to illustrate the\nperformance of the model in capturing reaction pathways as a function of\ntemperature, reaction selectivity and the effect of precursor choice. Our\napproach allows for straightforward comparison of predicted mass fractions of\nintermediates and products with experimental results. This simulation framework\npresents a step toward $\\textit{in silico}$ synthesis recipe design and an\neasier way to optimize existing recipes, aid in the identification of\nintermediates and identify effective recipes for yet unrealized inorganic\nsolids.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tptB-_0UN-VzFGShlcMCqpaoHE2Te3JoC2SnFnfrrbc","pdfSize":"4125549","objectId":"0x7d591e8d9a31b2b47017e17cfc0e2ddc4dcc3fa66b392238c724093b73321938","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
