{"id":"2407.03013","title":"Disentangling heterogeneity and disorder during ultrafast surface\n  melting of orbital order","authors":"Maurizio Monti, Khalid M. Siddiqui, Daniel Perez-Salinas, Naman\n  Agarwal, Martin Bremholm, Xiang Li, Dharmalingam Prabhakaran, Xin Liu, Danylo\n  Babich, Mathias Sander, Yunpei Deng, Henrik T. Lemke, Roman Mankowsky,\n  Xuerong Liu, Simon E. Wall","authorsParsed":[["Monti","Maurizio",""],["Siddiqui","Khalid M.",""],["Perez-Salinas","Daniel",""],["Agarwal","Naman",""],["Bremholm","Martin",""],["Li","Xiang",""],["Prabhakaran","Dharmalingam",""],["Liu","Xin",""],["Babich","Danylo",""],["Sander","Mathias",""],["Deng","Yunpei",""],["Lemke","Henrik T.",""],["Mankowsky","Roman",""],["Liu","Xuerong",""],["Wall","Simon E.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 11:12:16 GMT"}],"updateDate":"2024-07-04","timestamp":1720005136000,"abstract":"  Understanding how light modifies long-range order is key to improve our\nability to control material functionality on an ultrafast timescale. Transient\nspatial heterogeneity has been proposed in many materials, but isolating the\ndynamics of different regions experimentally has been challenging. Here we\naddress this issue and measure the dynamics of orbital order melting in the\nlayered manganite, La0.5Sr1.5MnO4, and isolate the surface dynamics from the\nbulk for the first time. Bulk measurements show orbital order is rapidly\nsuppressed, but the correlation length surprisingly increases. However, the\nsurface dynamics, show a stronger suppression and a significant decrease in\ncorrelation length. By isolating the surface changes, we find that light\npreferentially melts a less ordered surface and the loss of long-range order is\nlikely driven by the formation of local and disordered polarons. Melting the\ndisordered surface effectively increases the average correlation of the bulk\nprobed volume, resolving the contradictory response. These results show that\nsurface scattering methods are necessary to understand both surface and bulk\ndynamics in heterogeneous materials.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qd_LTZDI-vl-hW9lXoAdhFYB9sx6Kvcl7-PidKR4EVs","pdfSize":"2068067"}
