{"id":"2407.07718","title":"High-Performance Sorting-Based k-mer Counting in Distributed Memory with\n  Flexible Hybrid Parallelism","authors":"Yifan Li and Giulia Guidi","authorsParsed":[["Li","Yifan",""],["Guidi","Giulia",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 14:50:00 GMT"}],"updateDate":"2024-07-11","timestamp":1720623000000,"abstract":"  In generating large quantities of DNA data, high-throughput sequencing\ntechnologies require advanced bioinformatics infrastructures for efficient data\nanalysis. k-mer counting, the process of quantifying the frequency of\nfixed-length k DNA subsequences, is a fundamental step in various\nbioinformatics pipelines, including genome assembly and protein prediction. Due\nto the growing volume of data, the scaling of the counting process is critical.\nIn the literature, distributed memory software uses hash tables, which exhibit\npoor cache friendliness and consume excessive memory. They often also lack\nsupport for flexible parallelism, which makes integration into existing\nbioinformatics pipelines difficult. In this work, we propose HySortK, a highly\nefficient sorting-based distributed memory k-mer counter. HySortK reduces the\ncommunication volume through a carefully designed communication scheme and\ndomain-specific optimization strategies. Furthermore, we introduce an abstract\ntask layer for flexible hybrid parallelism to address load imbalances in\ndifferent scenarios. HySortK achieves a 2-10x speedup compared to the GPU\nbaseline on 4 and 8 nodes. Compared to state-of-the-art CPU software, HySortK\nachieves up to 2x speedup while reducing peak memory usage by 30% on 16 nodes.\nFinally, we integrated HySortK into an existing genome assembly pipeline and\nachieved up to 1.8x speedup, proving its flexibility and practicality in\nreal-world scenarios.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Quantitative Biology/Genomics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pA4pPOOT9FJOAYbGOHr1_C4IYB50CYrKPTFM6gRMDnw","pdfSize":"1111058","objectId":"0x975da2c3ad63a6e669df8ea11afddddf63f49fe6de9d01657e593a05039b72d9","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
