{"id":"2407.11440","title":"End-user Comprehension of Transfer Risks in Smart Contracts","authors":"Yustynn Panicker, Ezekiel Soremekun, Sumei Sun and Sudipta\n  Chattopadhyay","authorsParsed":[["Panicker","Yustynn",""],["Soremekun","Ezekiel",""],["Sun","Sumei",""],["Chattopadhyay","Sudipta",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 07:18:45 GMT"}],"updateDate":"2024-07-17","timestamp":1721114325000,"abstract":"  Smart contracts are increasingly used in critical use cases (e.g., financial\ntransactions). Thus, it is pertinent to ensure that end-users understand the\ntransfer risks in smart contracts. To address this, we investigate end-user\ncomprehension of risks in the most popular Ethereum smart contract (i.e., USD\nTether (USDT)) and their prevalence in the top ERC-20 smart contracts. We focus\non five transfer risks with severe impact on transfer outcomes and user\nobjectives, including users being blacklisted, contract being paused, and\ncontract being arbitrarily upgraded. Firstly, we conducted a user study\ninvestigating end-user comprehension of smart contract transfer risks with 110\nparticipants and USDT/MetaMask. Secondly, we performed manual and automated\nsource code analysis of the next top (78) ERC-20 smart contracts (after USDT)\nto identify the prevalence of these risks. Results show that end-users do not\ncomprehend real risks: most (up to 71.8% of) users believe contract upgrade and\nblacklisting are highly severe/surprising. More importantly, twice as many\nusers find it easier to discover successful outcomes than risky outcomes using\nthe USDT/MetaMask UI flow. These results hold regardless of the self-rated\nprogramming and Web3 proficiency of participants. Furthermore, our source code\nanalysis demonstrates that the examined risks are prevalent in up to 19.2% of\nthe top ERC-20 contracts. Additionally, we discovered (three) other risks with\nup to 25.6% prevalence in these contracts. This study informs the need to\nprovide explainable smart contracts, understandable UI and relevant information\nfor risky outcomes.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vp2BLzAOKgA7Lk2SXoBuCRb9DaNugMcpCkwMK1M8E6M","pdfSize":"1896369","objectId":"0x0721384c93ed64cbe78d786d05cb282cc37f7a29a5d872698e6d28a68f884d7b","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
