{"id":"2407.05027","title":"Listen-While-Talking: Toward dApp-based Real-Time Spectrum Sharing in\n  O-RAN","authors":"Rajeev Gangula, Andrea Lacava, Michele Polese, Salvatore D'Oro,\n  Leonardo Bonati, Florian Kaltenberger, Pedram Johari, Tommaso Melodia","authorsParsed":[["Gangula","Rajeev",""],["Lacava","Andrea",""],["Polese","Michele",""],["D'Oro","Salvatore",""],["Bonati","Leonardo",""],["Kaltenberger","Florian",""],["Johari","Pedram",""],["Melodia","Tommaso",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 09:43:40 GMT"}],"updateDate":"2024-07-09","timestamp":1720259020000,"abstract":"  This demo paper presents a dApp-based real-time spectrum sharing scenario\nwhere a 5th generation (5G) base station implementing the NR stack adapts its\ntransmission and reception strategies based on the incumbent priority users in\nthe Citizen Broadband Radio Service (CBRS) band. The dApp is responsible for\nobtaining relevant measurements from the Next Generation Node Base (gNB),\nrunning the spectrum sensing inference, and configuring the gNB with a control\naction upon detecting the primary incumbent user transmissions. This approach\nis built on dApps, which extend the O-RAN framework to the real-time and user\nplane domains. Thus, it avoids the need of dedicated Spectrum Access Systems\n(SASs) in the CBRS band. The demonstration setup is based on the open-source 5G\nOpenAirInterface (OAI) framework, where we have implemented a dApp interfaced\nwith a gNB and communicating with a Commercial Off-the-Shelf (COTS) User\nEquipment (UE) in an over-the-air wireless environment. When an incumbent user\nhas active transmission, the dApp will detect and inform the primary user\npresence to the gNB. The dApps will also enforce a control policy that adapts\nthe scheduling and transmission policy of the Radio Access Network (RAN). This\ndemo provides valuable insights into the potential of using dApp-based spectrum\nsensing with O-RAN architecture in next generation cellular networks.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_cB4HFWEV6m5XYP6hoVzOuBbQu0aimvDZx6I62ZFSHc","pdfSize":"1340760"}
