{"id":"2407.09730","title":"Formation of S-bearing complex organic molecules in interstellar clouds\n  via ice reactions with C2H2, HS, and atomic H","authors":"Julia C. Santos, Joan Enrique-Romero, Thanja Lamberts, Harold\n  Linnartz, and Ko-Ju Chuang","authorsParsed":[["Santos","Julia C.",""],["Enrique-Romero","Joan",""],["Lamberts","Thanja",""],["Linnartz","Harold",""],["Chuang","Ko-Ju",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 00:28:00 GMT"}],"updateDate":"2024-07-16","timestamp":1720830480000,"abstract":"  The chemical network governing interstellar sulfur has been the topic of\nunrelenting discussion for the past decades due to the conspicuous discrepancy\nbetween its expected and observed abundances in different interstellar\nenvironments. More recently, the astronomical detections of CH3CH2SH and CH2CS\nhighlighted the importance of interstellar formation routes for sulfur-bearing\norganic molecules with two carbon atoms. In this work, we perform a laboratory\ninvestigation of the solid-state chemistry resulting from the interaction\nbetween C2H2 molecules and SH radicals -- both thought to be present in\ninterstellar icy mantles -- at 10 K. Reflection absorption infrared\nspectroscopy and quadrupole mass spectrometry combined with\ntemperature-programmed desorption experiments are employed as analytical\ntechniques. We confirm that SH radicals can kick-start a sulfur reaction\nnetwork under interstellar cloud conditions and identify at least six\nsulfurated products: CH3CH2SH, CH2CHSH, HSCH2CH2SH, H2S2, and tentatively\nCH3CHS and CH2CS. Complementarily, we utilize computational calculations to\npinpoint the reaction routes that play a role in the chemical network behind\nour experimental results. The main sulfur-bearing organic molecule formed under\nour experimental conditions is CH3CH2SH and its formation yield increases with\nthe ratios of H to other reactants. It serves as a sink to the sulfur budget\nwithin the network, being formed at the expense of the other unsaturated\nproducts. The astrophysical implications of the chemical network proposed here\nare discussed.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TPMGLKdf-6EU4D0apJHtYsQYxyhoa4yIlMdhG7XQjX8","pdfSize":"753851","objectId":"0xb72674bd2217656123bb5be56fa3263cf4c925399136b28ff8165aaaa86ef396","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
