{"id":"2407.16482","title":"BONES: a Benchmark fOr Neural Estimation of Shapley values","authors":"Davide Napolitano, Luca Cagliero","authorsParsed":[["Napolitano","Davide",""],["Cagliero","Luca",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 13:53:22 GMT"}],"updateDate":"2024-07-24","timestamp":1721742802000,"abstract":"  Shapley Values are concepts established for eXplainable AI. They are used to\nexplain black-box predictive models by quantifying the features' contributions\nto the model's outcomes. Since computing the exact Shapley Values is known to\nbe computationally intractable on real-world datasets, neural estimators have\nemerged as alternative, more scalable approaches to get approximated Shapley\nValues estimates. However, experiments with neural estimators are currently\nhard to replicate as algorithm implementations, explainer evaluators, and\nresults visualizations are neither standardized nor promptly usable. To bridge\nthis gap, we present BONES, a new benchmark focused on neural estimation of\nShapley Value. It provides researchers with a suite of state-of-the-art neural\nand traditional estimators, a set of commonly used benchmark datasets, ad hoc\nmodules for training black-box models, as well as specific functions to easily\ncompute the most popular evaluation metrics and visualize results. The purpose\nis to simplify XAI model usage, evaluation, and comparison. In this paper, we\nshowcase BONES results and visualizations for XAI model benchmarking on both\ntabular and image data. The open-source library is available at the following\nlink: https://github.com/DavideNapolitano/BONES.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yblNI97B-JUjVvg6TxhE_9V4F_QRfklZxebEZQJlQc4","pdfSize":"714676","objectId":"0x2a2c2fda34401f2cde8d744b7532d499446ba7540e3e7fa8032ade938722edd3","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
