{"id":"2407.08063","title":"Electrical manipulation of inter-valley trions in twisted MoSe$_2$\n  homobilayers at room temperature","authors":"B\\'arbara L. T. Rosa, Paulo E. Faria Junior, Alisson R. Cadore, Yuhui\n  Yang, Aris Koulas-Simos, Chirag C. Palekar, Sefaattin Tongay, Jaroslav Fabian\n  and Stephan Reitzenstein","authorsParsed":[["Rosa","Bárbara L. T.",""],["Junior","Paulo E. Faria",""],["Cadore","Alisson R.",""],["Yang","Yuhui",""],["Koulas-Simos","Aris",""],["Palekar","Chirag C.",""],["Tongay","Sefaattin",""],["Fabian","Jaroslav",""],["Reitzenstein","Stephan",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 21:53:43 GMT"}],"updateDate":"2024-07-12","timestamp":1720648423000,"abstract":"  The impressive physics and applications of intra- and interlayer excitons in\na transition metal dichalcogenide twisted-bilayer make these systems compelling\nplatforms for exploring the manipulation of their optoelectronic properties\nthrough electrical fields. This work studies the electrical control of excitons\nin twisted MoSe$_2$ homobilayer devices at room temperature. Gate-dependent\nmicro-photoluminescence spectroscopy reveals an energy tunability of several\nmeVs originating from the emission of excitonic complexes. Furthermore, it\ninvestigates the twist-angle dependence of valley properties by fabricating\ndevices with distinct stacking angles. Strengthened by density functional\ntheory calculations, the results suggest that, depending on the rotation angle,\nthe conduction band minima and hybridized states at the Q-point promote the\nformation of inter-valley trions involving the Q-and K-points in the conduction\nband and the K-point in the valence band. Besides exploring the charge-carrier\nmanipulation in twisted homobilayers, our findings open new avenues for\nengineering multifunctional optoelectronic devices based on ultrathin\nsemiconducting systems.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ZYpyt_jFu2wGxPsVx9Qq1EBajgSH5KGT4qDHiaNKc5g","pdfSize":"2425521","objectId":"0xaf1a589000d234dde0ae08c53e789b890bc3d684f3cc51bfdc8cea8496bb7e63","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
