{"id":"2407.15154","title":"Fine-grained Gender Control in Machine Translation with Large Language\n  Models","authors":"Minwoo Lee, Hyukhun Koh, Minsung Kim, Kyomin Jung","authorsParsed":[["Lee","Minwoo",""],["Koh","Hyukhun",""],["Kim","Minsung",""],["Jung","Kyomin",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 13:15:00 GMT"}],"updateDate":"2024-07-23","timestamp":1721567700000,"abstract":"  In machine translation, the problem of ambiguously gendered input has been\npointed out, where the gender of an entity is not available in the source\nsentence. To address this ambiguity issue, the task of controlled translation\nthat takes the gender of the ambiguous entity as additional input have been\nproposed. However, most existing works have only considered a simplified setup\nof one target gender for input. In this paper, we tackle controlled translation\nin a more realistic setting of inputs with multiple entities and propose\nGender-of-Entity (GoE) prompting method for LLMs. Our proposed method instructs\nthe model with fine-grained entity-level gender information to translate with\ncorrect gender inflections. By utilizing four evaluation benchmarks, we\ninvestigate the controlled translation capability of LLMs in multiple\ndimensions and find that LLMs reach state-of-the-art performance in controlled\ntranslation. Furthermore, we discover an emergence of gender interference\nphenomenon when controlling the gender of multiple entities. Finally, we\naddress the limitations of existing gender accuracy evaluation metrics and\npropose leveraging LLMs as an evaluator for gender inflection in machine\ntranslation.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NVtg4N3SGxSkBhDFX2IOUpuC4kac7rT4xYiFXFjwpYQ","pdfSize":"1856633","objectId":"0xe8722ce16607034f99450130c2db0b9656d76cf512bdc9a7d6e9925aab9cb5f8","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
