{"id":"2407.08255","title":"GraphMamba: An Efficient Graph Structure Learning Vision Mamba for\n  Hyperspectral Image Classification","authors":"Aitao Yang, Min Li, Yao Ding, Leyuan Fang, Yaoming Cai, Yujie He","authorsParsed":[["Yang","Aitao",""],["Li","Min",""],["Ding","Yao",""],["Fang","Leyuan",""],["Cai","Yaoming",""],["He","Yujie",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 07:56:08 GMT"}],"updateDate":"2024-07-12","timestamp":1720684568000,"abstract":"  Efficient extraction of spectral sequences and geospatial information has\nalways been a hot topic in hyperspectral image classification. In terms of\nspectral sequence feature capture, RNN and Transformer have become mainstream\nclassification frameworks due to their long-range feature capture capabilities.\nIn terms of spatial information aggregation, CNN enhances the receptive field\nto retain integrated spatial information as much as possible. However, the\nspectral feature-capturing architectures exhibit low computational efficiency,\nand CNNs lack the flexibility to perceive spatial contextual information. To\naddress these issues, this paper proposes GraphMamba--an efficient graph\nstructure learning vision Mamba classification framework that fully considers\nHSI characteristics to achieve deep spatial-spectral information mining.\nSpecifically, we propose a novel hyperspectral visual GraphMamba processing\nparadigm (HVGM) that preserves spatial-spectral features by constructing\nspatial-spectral cubes and utilizes linear spectral encoding to enhance the\noperability of subsequent tasks. The core components of GraphMamba include the\nHyperMamba module for improving computational efficiency and the SpectralGCN\nmodule for adaptive spatial context awareness. The HyperMamba mitigates clutter\ninterference by employing the global mask (GM) and introduces a parallel\ntraining inference architecture to alleviate computational bottlenecks. The\nSpatialGCN incorporates weighted multi-hop aggregation (WMA) spatial encoding\nto focus on highly correlated spatial structural features, thus flexibly\naggregating contextual information while mitigating spatial noise interference.\nExtensive experiments were conducted on three different scales of real HSI\ndatasets, and compared with the state-of-the-art classification frameworks,\nGraphMamba achieved optimal performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_rflOwDQMyqA6gap9eZs0zzGfT4CXy8LXiRDhQbuqZg","pdfSize":"5072129","objectId":"0x430ca1df0b1b867d27d0c97494aa6fa5928e6c45cc399830353a44360447de2e","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
