{"id":"2407.16209","title":"VidyaRANG: Conversational Learning Based Platform powered by Large\n  Language Model","authors":"Chitranshu Harbola and Anupam Purwar","authorsParsed":[["Harbola","Chitranshu",""],["Purwar","Anupam",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 06:30:35 GMT"}],"updateDate":"2024-07-24","timestamp":1721716235000,"abstract":"  Providing authoritative information tailored to a student's specific doubt is\na hurdle in this era where search engines return an overwhelming number of\narticle links. Large Language Models such as GPTs fail to provide answers to\nquestions that were derived from sensitive confidential information. This\ninformation which is specific to some organisations is not available to LLMs\ndue to privacy constraints. This is where knowledge-augmented retrieval\ntechniques become particularly useful. The proposed platform is designed to\ncater to the needs of learners from divergent fields. Today, the most common\nformat of learning is video and books, which our proposed platform allows\nlearners to interact and ask questions. This increases learners' focus time\nexponentially by restricting access to pertinent content and, at the same time\nallowing personalized access and freedom to gain in-depth knowledge.\nInstructor's roles and responsibilities are significantly simplified allowing\nthem to train a larger audience. To preserve privacy, instructors can grant\ncourse access to specific individuals, enabling personalized conversation on\nthe provided content. This work includes an extensive spectrum of software\ndevelopment and product management skills, which also circumscribe knowledge of\ncloud computing for running Large Language Models and maintaining the\napplication. For Frontend development, which is responsible for user\ninteraction and user experience, Streamlit and React framework have been\nutilized. To improve security and privacy, the server is routed to a domain\nwith an SSL certificate, and all the API key/s are stored securely on an AWS\nEC2 instance, to enhance user experience, web connectivity to an Android\nStudio-based mobile app has been established, and in-process to publish the app\non play store, thus addressing all major software engineering disciplines\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pwHrYPAqT0bbuz32fYNckGBpxRP-OBeOrpdBl4VvA8g","pdfSize":"1725119","objectId":"0xa6f511f337e1ae9913485ff268290555982b5c28b0e66c991bc5c1bd0af492b6","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
