{"id":"2407.11979","title":"Interpret3C: Interpretable Student Clustering Through Individualized\n  Feature Selection","authors":"Isadora Salles, Paola Mejia-Domenzain, Vinitra Swamy, Julian\n  Blackwell, Tanja K\\\"aser","authorsParsed":[["Salles","Isadora",""],["Mejia-Domenzain","Paola",""],["Swamy","Vinitra",""],["Blackwell","Julian",""],["Käser","Tanja",""]],"versions":[{"version":"v1","created":"Tue, 28 May 2024 15:32:05 GMT"}],"updateDate":"2024-07-18","timestamp":1716910325000,"abstract":"  Clustering in education, particularly in large-scale online environments like\nMOOCs, is essential for understanding and adapting to diverse student needs.\nHowever, the effectiveness of clustering depends on its interpretability, which\nbecomes challenging with high-dimensional data. Existing clustering approaches\noften neglect individual differences in feature importance and rely on a\nhomogenized feature set. Addressing this gap, we introduce Interpret3C\n(Interpretable Conditional Computation Clustering), a novel clustering pipeline\nthat incorporates interpretable neural networks (NNs) in an unsupervised\nlearning context. This method leverages adaptive gating in NNs to select\nfeatures for each student. Then, clustering is performed using the most\nrelevant features per student, enhancing clusters' relevance and\ninterpretability. We use Interpret3C to analyze the behavioral clusters\nconsidering individual feature importances in a MOOC with over 5,000 students.\nThis research contributes to the field by offering a scalable, robust\nclustering methodology and an educational case study that respects individual\nstudent differences and improves interpretability for high-dimensional data.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-7fROlEUEp8nVeIikHjaVF1_VW4EsxMJ__FdJnQSRAo","pdfSize":"1019327","objectId":"0x47d12c34789e4b2ca0aac33562a823b098c641a5b781ce6023deec7db0d8e454","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
