{"id":"2407.14744","title":"A Comprehensive Review of Few-shot Action Recognition","authors":"Yuyang Wanyan, Xiaoshan Yang, Weiming Dong, Changsheng Xu","authorsParsed":[["Wanyan","Yuyang",""],["Yang","Xiaoshan",""],["Dong","Weiming",""],["Xu","Changsheng",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 03:53:32 GMT"}],"updateDate":"2024-07-23","timestamp":1721447612000,"abstract":"  Few-shot action recognition aims to address the high cost and impracticality\nof manually labeling complex and variable video data in action recognition. It\nrequires accurately classifying human actions in videos using only a few\nlabeled examples per class. Compared to few-shot learning in image scenarios,\nfew-shot action recognition is more challenging due to the intrinsic complexity\nof video data. Recognizing actions involves modeling intricate temporal\nsequences and extracting rich semantic information, which goes beyond mere\nhuman and object identification in each frame. Furthermore, the issue of\nintra-class variance becomes particularly pronounced with limited video\nsamples, complicating the learning of representative features for novel action\ncategories. To overcome these challenges, numerous approaches have driven\nsignificant advancements in few-shot action recognition, which underscores the\nneed for a comprehensive survey. Unlike early surveys that focus on few-shot\nimage or text classification, we deeply consider the unique challenges of\nfew-shot action recognition. In this survey, we review a wide variety of recent\nmethods and summarize the general framework. Additionally, the survey presents\nthe commonly used benchmarks and discusses relevant advanced topics and\npromising future directions. We hope this survey can serve as a valuable\nresource for researchers, offering essential guidance to newcomers and\nstimulating seasoned researchers with fresh insights.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"MOWlZGu6ZA0ro7pejQM9Dy2vJ09Mi7OtQJ3NvxMzgmw","pdfSize":"4097280","objectId":"0xfbb53f926f484911aeffa8c599b60627cd19f83546da0c2615f6ada94ac55cdd","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
