{"id":"2407.15854","title":"Decoding Digital Influence: The Role of Social Media Behavior in\n  Scientific Stratification Through Logistic Attribution Method","authors":"Yang Yue","authorsParsed":[["Yue","Yang",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 02:01:40 GMT"}],"updateDate":"2024-07-24","timestamp":1721700100000,"abstract":"  Scientific social stratification is a classic theme in the sociology of\nscience. The deep integration of social media has bridged the gap between\nscientometrics and sociology of science. This study comprehensively analyzes\nthe impact of social media on scientific stratification and mobility, delving\ninto the complex interplay between academic status and social media activity in\nthe digital age. [Research Method] Innovatively, this paper employs An\nExplainable Logistic Attribution Analysis from a meso-level perspective to\nexplore the correlation between social media behaviors and scientific social\nstratification. It examines the impact of scientists' use of social media in\nthe digital age on scientific stratification and mobility, uniquely combining\nstatistical methods with machine learning. This fusion effectively integrates\nhypothesis testing with a substantive interpretation of the contribution of\nindependent variables to the model. [Research Conclusion] Empirical evidence\ndemonstrates that social media promotes stratification and mobility within the\nscientific community, revealing a nuanced and non-linear facilitation\nmechanism. Social media activities positively impact scientists' status within\nthe scientific social hierarchy to a certain extent, but beyond a specific\nthreshold, this impact turns negative. It shows that the advent of social media\nhas opened new channels for academic influence, transcending the limitations of\ntraditional academic publishing, and prompting changes in scientific\nstratification. Additionally, the study acknowledges the limitations of its\nexperimental design and suggests future research directions.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Digital Libraries","Statistics/Methodology","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5-SR5nGp5DjEqEqi4CnHCS5CPp13_iW10g9uS7FG1is","pdfSize":"1005515","objectId":"0x37603a8b6cdc1de89c56e92dddd03da9b3766de7267afdfa13e0067bd03ac884","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
