{"id":"2407.14294","title":"Towards a universal analytical model for Population III star formation:\n  interplay between feedback and fragmentation","authors":"Boyuan Liu, James Gurian, Kohei Inayoshi, Shingo Hirano, Takashi\n  Hosokawa, Volker Bromm, Naoki Yoshida","authorsParsed":[["Liu","Boyuan",""],["Gurian","James",""],["Inayoshi","Kohei",""],["Hirano","Shingo",""],["Hosokawa","Takashi",""],["Bromm","Volker",""],["Yoshida","Naoki",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:25:59 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 12:10:02 GMT"}],"updateDate":"2024-09-04","timestamp":1721395559000,"abstract":"  JWST has brought us new insights into Cosmic Dawn with tentative detection of\nthe unique signatures of metal-free Population III (Pop III) stars, such as\nstrong HeII emission, extremely blue UV spectrum, and enhanced nitrogen\nabundance. Self-consistent theoretical predictions of the formation rates,\nsites, and masses of Pop III stars are crucial for interpreting the\nobservations, but are challenging due to complex physical processes operating\nover the large range of length scales involved. One solution is to combine\nanalytical models for the small-scale star formation process with cosmological\nsimulations that capture the large-scale physics such as structure formation,\nradiation backgrounds, and baryon-dark matter streaming motion that regulate\nthe conditions of Pop III star formation. We build an analytical model to\npredict the final masses of Pop III stars/clusters from the properties of\nstar-forming clouds, based on the key results of small-scale star formation\nsimulations and stellar evolution models. Our model for the first time\nconsiders the interplay between feedback and fragmentation and covers different\nmodes of Pop III star formation ranging from ordinary small ($\\sim 10-2000\\ \\rm\nM_\\odot$) clusters in molecular-cooling clouds to massive ($\\gtrsim 10^{4}\\ \\rm\nM_\\odot$) clusters containing supermassive ($\\sim 10^{4}-3\\times 10^{5}\\ \\rm\nM_\\odot$) stars under violent collapse of atomic-cooling clouds. As an example,\nthe model is applied to the Pop III star-forming clouds in the progenitors of\ntypical haloes hosting high-$z$ luminous quasars, which shows that formation of\nPop III massive clusters is common ($\\sim 20-70\\%$) in such biased\n($\\sim4\\sigma$) regions, and the resulting heavy black hole seeds from\nsupermassive stars can account for a significant fraction of observed luminous\n($\\gtrsim 10^{46}\\ \\rm erg\\ s^{-1}$) quasars at $z\\sim 6$.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"km7j1XQmV-Bs9f0Uqe9tLMDFC-Uw1khga6JxYaZvAc0","pdfSize":"2437560","objectId":"0xb21bd42ee94f99bdee00b598f2745067b4a01b0e0574a7f73b89e5c6341da0c6","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
