{"id":"2407.17856","title":"MDS-ED: Multimodal Decision Support in the Emergency Department -- a\n  Benchmark Dataset for Diagnoses and Deterioration Prediction in Emergency\n  Medicine","authors":"Juan Miguel Lopez Alcaraz, Hjalmar Bouma, Nils Strodthoff","authorsParsed":[["Alcaraz","Juan Miguel Lopez",""],["Bouma","Hjalmar",""],["Strodthoff","Nils",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 08:21:46 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 08:18:27 GMT"}],"updateDate":"2024-07-29","timestamp":1721895706000,"abstract":"  Background: Benchmarking medical decision support algorithms often struggles\ndue to limited access to datasets, narrow prediction tasks, and restricted\ninput modalities. These limitations affect their clinical relevance and\nperformance in high-stakes areas like emergency care, complicating replication,\nvalidation, and improvement of benchmarks.\n  Methods: We introduce a dataset based on MIMIC-IV, benchmarking protocol, and\ninitial results for evaluating multimodal decision support in the emergency\ndepartment (ED). We use diverse data modalities from the first 1.5 hours of\npatient arrival, including demographics, biometrics, vital signs, lab values,\nand electrocardiogram waveforms. We analyze 1443 clinical labels across two\ncontexts: predicting diagnoses with ICD-10 codes and forecasting patient\ndeterioration.\n  Results: Our multimodal diagnostic model achieves an AUROC score over 0.8 in\na statistically significant manner for 357 out of 1428 conditions, including\ncardiac issues like myocardial infarction and non-cardiac conditions such as\nrenal disease and diabetes. The deterioration model scores above 0.8 in a\nstatistically significant manner for 13 out of 15 targets, including critical\nevents like cardiac arrest and mechanical ventilation, ICU admission as well as\nshort- and long-term mortality. Incorporating raw waveform data significantly\nimproves model performance, which represents one of the first robust\ndemonstrations of this effect.\n  Conclusions: This study highlights the uniqueness of our dataset, which\nencompasses a wide range of clinical tasks and utilizes a comprehensive set of\nfeatures collected early during the emergency after arriving at the ED. The\nstrong performance, as evidenced by high AUROC scores across diagnostic and\ndeterioration targets, underscores the potential of our approach to\nrevolutionize decision-making in acute and emergency medicine.\n","subjects":["Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HY-08yxy3e3C0qVR-3LmQw8aZU-qunVvDINbiGqPaGw","pdfSize":"2680169","objectId":"0x7131e9b503a48020c7df271b435535ff12863dae959014b5cfc6f806b9b1ed9e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
