{"id":"2407.20041","title":"Counterfactual rewards promote collective transport using individually\n  controlled swarm microrobots","authors":"Veit-Lorenz Heuthe, Emanuele Panizon, Hongri Gu, Clemens Bechinger","authorsParsed":[["Heuthe","Veit-Lorenz",""],["Panizon","Emanuele",""],["Gu","Hongri",""],["Bechinger","Clemens",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 14:26:46 GMT"}],"updateDate":"2024-07-30","timestamp":1722263206000,"abstract":"  Swarm robots offer fascinating opportunities to perform complex tasks beyond\nthe capabilities of individual machines. Just as a swarm of ants collectively\nmoves a large object, similar functions can emerge within a group of robots\nthrough individual strategies based on local sensing. However, realizing\ncollective functions with individually controlled microrobots is particularly\nchallenging due to their micrometer size, large number of degrees of freedom,\nstrong thermal noise relative to the propulsion speed, complex physical\ncoupling between neighboring microrobots, and surface collisions. Here, we\nimplement Multi-Agent Reinforcement Learning (MARL) to generate a control\nstrategy for up to 200 microrobots whose motions are individually controlled by\nlaser spots. During the learning process, we employ so-called counterfactual\nrewards that automatically assign credit to the individual microrobots, which\nallows for fast and unbiased training. With the help of this efficient reward\nscheme, swarm microrobots learn to collectively transport a large cargo object\nto an arbitrary position and orientation, similar to ant swarms. We demonstrate\nthat this flexible and versatile swarm robotic system is robust to variations\nin group size, the presence of malfunctioning units, and environmental noise.\nSuch control strategies can potentially enable complex and automated assembly\nof mobile micromachines, programmable drug delivery capsules, and other\nadvanced lab-on-a-chip applications.\n","subjects":["Computing Research Repository/Robotics","Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LxoVkUWKv7GI13txJzAD9mmZE6OCdkf2RNnlkryYIP4","pdfSize":"3652556","objectId":"0xd27ef88f2dce6cf768d62ff19ff258c9462eab12c0d6c62b3421542f3569a159","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
