{"id":"2407.20824","title":"DyGKT: Dynamic Graph Learning for Knowledge Tracing","authors":"Ke Cheng, Linzhi Peng, Pengyang Wang, Junchen Ye, Leilei Sun and Bowen\n  Du","authorsParsed":[["Cheng","Ke",""],["Peng","Linzhi",""],["Wang","Pengyang",""],["Ye","Junchen",""],["Sun","Leilei",""],["Du","Bowen",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 13:43:32 GMT"}],"updateDate":"2024-07-31","timestamp":1722347012000,"abstract":"  Knowledge Tracing aims to assess student learning states by predicting their\nperformance in answering questions. Different from the existing research which\nutilizes fixed-length learning sequence to obtain the student states and\nregards KT as a static problem, this work is motivated by three dynamical\ncharacteristics: 1) The scales of students answering records are constantly\ngrowing; 2) The semantics of time intervals between the records vary; 3) The\nrelationships between students, questions and concepts are evolving. The three\ndynamical characteristics above contain the great potential to revolutionize\nthe existing knowledge tracing methods. Along this line, we propose a Dynamic\nGraph-based Knowledge Tracing model, namely DyGKT. In particular, a\ncontinuous-time dynamic question-answering graph for knowledge tracing is\nconstructed to deal with the infinitely growing answering behaviors, and it is\nworth mentioning that it is the first time dynamic graph learning technology is\nused in this field. Then, a dual time encoder is proposed to capture long-term\nand short-term semantics among the different time intervals. Finally, a\nmultiset indicator is utilized to model the evolving relationships between\nstudents, questions, and concepts via the graph structural feature. Numerous\nexperiments are conducted on five real-world datasets, and the results\ndemonstrate the superiority of our model. All the used resources are publicly\navailable at https://github.com/PengLinzhi/DyGKT.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ARrUsSWnd4XPu6RLMtfK4XiEKVsGQQU7b1OLP_H_px4","pdfSize":"5600886","objectId":"0x36b9741064e07ae056c7203fe57d0460b6d958e1b0435abd2b333e76e39caa67","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
