{"id":"2407.05956","title":"Untangling the Furball: A Practice Mapping Approach to the Analysis of\n  Multimodal Interactions in Social Networks","authors":"Axel Bruns, Kateryna Kasianenko, Vishnu Padinjaredath Suresh, Ehsan\n  Dehghan, Laura Vodden","authorsParsed":[["Bruns","Axel",""],["Kasianenko","Kateryna",""],["Suresh","Vishnu Padinjaredath",""],["Dehghan","Ehsan",""],["Vodden","Laura",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 13:53:50 GMT"}],"updateDate":"2024-07-09","timestamp":1720446830000,"abstract":"  This article introduces the analytical approach of practice mapping, using\nvector embeddings of network actions and interactions to map commonalities and\ndisjunctures in the practices of social media users, as a framework for\nmethodological advancement beyond the limitations of conventional network\nanalysis and visualisation. In particular, the methodological framework we\noutline here has the potential to incorporate multiple distinct modes of\ninteraction into a single practice map, can be further enriched with\naccount-level attributes such as information gleaned from textual analysis,\nprofile information, available demographic details, and other features, and can\nbe applied even to a cross-platform analysis of communicative patterns and\npractices.\n  The article presents practice mapping as an analytical framework and outlines\nits key methodological considerations. Given its prominence in past social\nmedia research, we draw on examples and data from the platform formerly known\nas Twitter in order to enable experienced scholars to translate their\napproaches to a practice mapping paradigm more easily, but point out how data\nfrom other platforms may be used in equivalent ways in practice mapping\nstudies. We illustrate the utility of the approach by applying it to a dataset\nwhere the application of conventional network analysis and visualisation\napproaches has produced few meaningful insights.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"X96g9ZDOjGBim09xM7YCOlSM3W5736l_BSt-43XmxSE","pdfSize":"1683145"}
