{"id":"2407.15986","title":"Gemini Planet Imager Observations of a Resolved Low-Inclination Debris\n  Disk Around HD 156623","authors":"Briley L. Lewis, Michael P. Fitzgerald, Thomas M. Esposito, Pauline\n  Arriaga, Ronald Lopez, Katie A. Crotts, Gaspard Duchene, Katherine B.\n  Follette, Justin Hom, Paul Kalas, Brenda C. Matthews, Maxwell\n  Millar-Blanchaer, David J. Wilner, Johan Mazoyer, Bruce Macintosh","authorsParsed":[["Lewis","Briley L.",""],["Fitzgerald","Michael P.",""],["Esposito","Thomas M.",""],["Arriaga","Pauline",""],["Lopez","Ronald",""],["Crotts","Katie A.",""],["Duchene","Gaspard",""],["Follette","Katherine B.",""],["Hom","Justin",""],["Kalas","Paul",""],["Matthews","Brenda C.",""],["Millar-Blanchaer","Maxwell",""],["Wilner","David J.",""],["Mazoyer","Johan",""],["Macintosh","Bruce",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:52:10 GMT"}],"updateDate":"2024-07-24","timestamp":1721674330000,"abstract":"  The 16 Myr-old A0V star HD 156623 in the Scorpius--Centaurus association\nhosts a high-fractional-luminosity debris disk, recently resolved in scattered\nlight for the first time by the Gemini Planet Imager (GPI) in polarized\nintensity. We present new analysis of the GPI H-band polarimetric detection of\nthe HD 156623 debris disk, with particular interest in its unique morphology.\nThis debris disk lacks a visible inner clearing, unlike the majority of\nlow-inclination disks in the GPI sample and in Sco-Cen, and it is known to\ncontain CO gas, positioning it as a candidate ``hybrid'' or ``shielded'' disk.\nWe use radiative transfer models to constrain the geometric parameters of the\ndisk based on scattered light data and thermal models to constrain the\nunresolved inner radius based on the system's spectral energy distribution\n(SED). We also compute a measurement of the polarized scattering phase\nfunction, adding to the existing sample of empirical phase function\nmeasurements. We find that HD 156623's debris disk inner radius is constrained\nto less than 26.6 AU from scattered light imagery and less than 13.4 AU from\nSED modeling at a 99.7% confidence interval, and suggest that gas drag may play\na role in retaining sub-blowout size dust grains so close to the star.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"axFXInwvjQA4h_8PePOQeT1jtC2fxsOzllqpeRvA5i8","pdfSize":"10877419","objectId":"0x26201d7d99a5bd13f21c55bf9cf61e37615f8efcc95a1296dec9b767e8788f5f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
