{"id":"2407.16008","title":"Boosting Reward Model with Preference-Conditional Multi-Aspect Synthetic\n  Data Generation","authors":"Jiaming Shen, Ran Xu, Yennie Jun, Zhen Qin, Tianqi Liu, Carl Yang, Yi\n  Liang, Simon Baumgartner, Michael Bendersky","authorsParsed":[["Shen","Jiaming",""],["Xu","Ran",""],["Jun","Yennie",""],["Qin","Zhen",""],["Liu","Tianqi",""],["Yang","Carl",""],["Liang","Yi",""],["Baumgartner","Simon",""],["Bendersky","Michael",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 19:21:55 GMT"}],"updateDate":"2024-07-24","timestamp":1721676115000,"abstract":"  Reward models (RMs) are crucial for aligning large language models (LLMs)\nwith human preferences. They are trained using preference datasets where each\nexample consists of one input prompt, two responses, and a preference label. As\ncurating a high-quality human labeled preference dataset is both time-consuming\nand expensive, people often rely on existing powerful LLMs for preference label\ngeneration. This can potentially introduce noise and impede RM training. In\nthis work, we present RMBoost, a novel synthetic preference data generation\nparadigm to boost reward model quality. Unlike traditional methods, which\ngenerate two responses before obtaining the preference label, RMBoost first\ngenerates one response and selects a preference label, followed by generating\nthe second more (or less) preferred response conditioned on the pre-selected\npreference label and the first response. This approach offers two main\nadvantages. First, RMBoost reduces labeling noise since preference pairs are\nconstructed intentionally. Second, RMBoost facilitates the creation of more\ndiverse responses by incorporating various quality aspects (e.g., helpfulness,\nrelevance, completeness) into the prompts. We conduct extensive experiments\nacross three diverse datasets and demonstrate that RMBoost outperforms other\nsynthetic preference data generation techniques and significantly boosts the\nperformance of four distinct reward models.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ny5bip9OwOHg87ZrC0xaaqZTc-k4E8UcHEZzwf0g0uk","pdfSize":"1190795","objectId":"0x9d257e64cc24a2331981de6e1ec989d60f83b2f1584839d5d5c6cb19389822e3","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
