{"id":"2407.03763","title":"Segregation at prior austenite grain boundaries: the competition between\n  boron and hydrogen","authors":"Guillaume Hachet, Ali Tehranchi, Hao Shi, Manoj Prabhakar, Shaolou\n  Wei, Katja Angenendt, Stefan Zaefferer, Baptiste Gault, Binhan Sun, Dirk\n  Ponge, Dierk Raabe","authorsParsed":[["Hachet","Guillaume",""],["Tehranchi","Ali",""],["Shi","Hao",""],["Prabhakar","Manoj",""],["Wei","Shaolou",""],["Angenendt","Katja",""],["Zaefferer","Stefan",""],["Gault","Baptiste",""],["Sun","Binhan",""],["Ponge","Dirk",""],["Raabe","Dierk",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 09:18:18 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 07:07:05 GMT"}],"updateDate":"2024-09-16","timestamp":1720084698000,"abstract":"  The interaction between boron and hydrogen at grain boundaries has been\ninvestigated experimentally and numerically in boron-doped and boron-free\nmartensitic steels using thermal desorption spectrometry (TDS) and ab initio\ncalculations. The calculations show that boron and hydrogen are attracted to\ngrain boundaries but boron can repel hydrogen. This behavior has also been\nobserved using TDS measurements, with the disappearance of one peak when boron\nis incorporated into the microstructure. Additionally, the microstructure of\nboth steels has been studied through electron backscattered diffraction,\nelectron channeling contrast imaging, synchrotron X-ray measurements, and atom\nprobe tomography. While they have a similar grain size, grain boundary\ndistribution, and dislocation densities, a pronounced boron segregation into\nPAGBs is observed for boron-doped steels. Then, the equilibrium hydrogen\nconcentration in different trapping sites has been evaluated using the\nLangmuir-McLean approximation. This thermodynamic model shows that the\ndistribution of hydrogen is identical for all traps when the total hydrogen\nconcentration is low for boron-free steel. However, when it increases, traps of\nthe lowest segregation energies (mostly PAGBs) are firstly saturated, which\npromotes failure initiation at this defect type. This finding partially\nexplains why PAGBs are the weakest microstructure feature when martensitic\nsteels are exposed to hydrogen-containing environments.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VCTG2TxewR-M4I8X5jIlHdh41zBAPtvbw5mcqwepDHg","pdfSize":"11218225"}
