{"id":"2407.11974","title":"Explainable AI Enhances Glaucoma Referrals, Yet the Human-AI Team Still\n  Falls Short of the AI Alone","authors":"Catalina Gomez, Ruolin Wang, Katharina Breininger, Corinne Casey,\n  Chris Bradley, Mitchell Pavlak, Alex Pham, Jithin Yohannan, Mathias Unberath","authorsParsed":[["Gomez","Catalina",""],["Wang","Ruolin",""],["Breininger","Katharina",""],["Casey","Corinne",""],["Bradley","Chris",""],["Pavlak","Mitchell",""],["Pham","Alex",""],["Yohannan","Jithin",""],["Unberath","Mathias",""]],"versions":[{"version":"v1","created":"Fri, 24 May 2024 03:01:20 GMT"}],"updateDate":"2024-07-18","timestamp":1716519680000,"abstract":"  Primary care providers are vital for initial triage and referrals to\nspecialty care. In glaucoma, asymptomatic and fast progression can lead to\nvision loss, necessitating timely referrals to specialists. However, primary\neye care providers may not identify urgent cases, potentially delaying care.\nArtificial Intelligence (AI) offering explanations could enhance their referral\ndecisions. We investigate how various AI explanations help providers\ndistinguish between patients needing immediate or non-urgent specialist\nreferrals. We built explainable AI algorithms to predict glaucoma surgery needs\nfrom routine eyecare data as a proxy for identifying high-risk patients. We\nincorporated intrinsic and post-hoc explainability and conducted an online\nstudy with optometrists to assess human-AI team performance, measuring referral\naccuracy and analyzing interactions with AI, including agreement rates, task\ntime, and user experience perceptions. AI support enhanced referral accuracy\namong 87 participants (59.9%/50.8% with/without AI), though Human-AI teams\nunderperformed compared to AI alone. Participants believed they included AI\nadvice more when using the intrinsic model, and perceived it more useful and\npromising. Without explanations, deviations from AI recommendations increased.\nAI support did not increase workload, confidence, and trust, but reduced\nchallenges. On a separate test set, our black-box and intrinsic models achieved\nan accuracy of 77% and 71%, respectively, in predicting surgical outcomes. We\nidentify opportunities of human-AI teaming for glaucoma management in primary\neye care, noting that while AI enhances referral accuracy, it also shows a\nperformance gap compared to AI alone, even with explanations. Human involvement\nremains essential in medical decision making, underscoring the need for future\nresearch to optimize collaboration, ensuring positive experiences and safe AI\nuse.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7krHuTHUOMCGWukQQ20EyTtPfgHsDRVYcMcKoYhQDuU","pdfSize":"1000601","objectId":"0x44fc4ac27a8fb6821d1360275f9e68b263e929ae7c50e4299278523653ccb796","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
