{"id":"2407.01851","title":"Meerkat: Audio-Visual Large Language Model for Grounding in Space and\n  Time","authors":"Sanjoy Chowdhury, Sayan Nag, Subhrajyoti Dasgupta, Jun Chen, Mohamed\n  Elhoseiny, Ruohan Gao, Dinesh Manocha","authorsParsed":[["Chowdhury","Sanjoy",""],["Nag","Sayan",""],["Dasgupta","Subhrajyoti",""],["Chen","Jun",""],["Elhoseiny","Mohamed",""],["Gao","Ruohan",""],["Manocha","Dinesh",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 23:32:25 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 07:01:30 GMT"}],"updateDate":"2024-07-04","timestamp":1719876745000,"abstract":"  Leveraging Large Language Models' remarkable proficiency in text-based tasks,\nrecent works on Multi-modal LLMs (MLLMs) extend them to other modalities like\nvision and audio. However, the progress in these directions has been mostly\nfocused on tasks that only require a coarse-grained understanding of the\naudio-visual semantics. We present Meerkat, an audio-visual LLM equipped with a\nfine-grained understanding of image and audio both spatially and temporally.\nWith a new modality alignment module based on optimal transport and a\ncross-attention module that enforces audio-visual consistency, Meerkat can\ntackle challenging tasks such as audio referred image grounding, image guided\naudio temporal localization, and audio-visual fact-checking. Moreover, we\ncarefully curate a large dataset AVFIT that comprises 3M instruction tuning\nsamples collected from open-source datasets, and introduce MeerkatBench that\nunifies five challenging audio-visual tasks. We achieve state-of-the-art\nperformance on all these downstream tasks with a relative improvement of up to\n37.12%.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MH2h6UrROF3i_W9h6-oB014ytWNblfP2izXPKjcsPkQ","pdfSize":"15836801","objectId":"0x2cec026f478737d0e4975e048487c677ee8f64ba232fc27743281b21e6cae835","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
