{"id":"2407.13825","title":"The Impact of $\\texttt{CLEAN}$ing on Strong Gravitational Lens Modelling","authors":"Jacob Maresca and Simon Dye","authorsParsed":[["Maresca","Jacob",""],["Dye","Simon",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 18:00:04 GMT"}],"updateDate":"2024-07-22","timestamp":1721325604000,"abstract":"  We present a comparison of image and uv-plane galaxy-galaxy strong lensing\nmodelling results for simulated ALMA observations with different antenna\nconfigurations and on-source integration times. Image-plane modelling is\ncarried out via use of the $\\texttt{CLEAN}$ algorithm, and we explore the\neffects of different visibility weighting schemes on the inferred lens model\nparameters. We find that direct modelling of the visibility data consistently\noutperforms image-plane modelling for both the naturally and Briggs-weighted\nimages. We also find that the modelling of images created with Briggs weighting\ngenerally produces more accurate results than those obtained by modelling\nimages constructed with natural weighting. We explain this by quantifying the\nsuppression of information due to $\\texttt{CLEAN}$ing on scales at which the\nmodelling is sensitive, and how this differs between Briggs and natural\nweighting. At higher resolutions, the differences between the lens modelling\ntechniques are much less pronounced and overall, modelling errors are\nsignificantly reduced. We also find that time-binning the visibilities by up to\na factor of three makes no significant difference to the inferred lens\nparameters when directly modelling in the uv-plane. This work provides some\nguidance on navigating the many choices faced when modelling strong lens\ninterferometric imaging data.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vWq7tRc7S24K4MwmBzkmQfGhsiRUH6C7FA8mxGoLU44","pdfSize":"4067700","objectId":"0x4c178631992c9bcd9d78add25c340bda3853145f50599c85f80ba4e8ad3b66ac","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
