{"id":"2407.21483","title":"eSPARQL: Representing and Reconciling Agnostic and Atheistic Beliefs in\n  RDF-star Knowledge Graphs","authors":"Xinyi Pan and Daniel Hern\\'andez and Philipp Seifer and Ralf L\\\"ammel\n  and Steffen Staab","authorsParsed":[["Pan","Xinyi",""],["Hernández","Daniel",""],["Seifer","Philipp",""],["Lämmel","Ralf",""],["Staab","Steffen",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 09:48:27 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 14:22:58 GMT"},{"version":"v3","created":"Tue, 6 Aug 2024 12:34:16 GMT"}],"updateDate":"2024-08-07","timestamp":1722419307000,"abstract":"  Over the past few years, we have seen the emergence of large knowledge graphs\ncombining information from multiple sources. Sometimes, this information is\nprovided in the form of assertions about other assertions, defining contexts\nwhere assertions are valid. A recent extension to RDF which admits statements\nover statements, called RDF-star, is in revision to become a W3C standard.\nHowever, there is no proposal for a semantics of these RDF-star statements nor\na built-in facility to operate over them. In this paper, we propose a query\nlanguage for epistemic RDF-star metadata based on a four-valued logic, called\neSPARQL. Our proposed query language extends SPARQL-star, the query language\nfor RDF-star, with a new type of FROM clause to facilitate operating with\nmultiple and sometimes conflicting beliefs. We show that the proposed query\nlanguage can express four use case queries, including the following features:\n(i) querying the belief of an individual, (ii) the aggregating of beliefs,\n(iii) querying who is conflicting with somebody, and (iv) beliefs about beliefs\n(i.e., nesting of beliefs).\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PyjJSQS74pbDuJB8JPRhYt5EXbdfLi7ChlEndwn--EA","pdfSize":"301535","objectId":"0x5a1f30b6e19d7cb62ef4a56451da2d9e6f85a4ffe0718df87a2bb5b856d95ced","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
