{"id":"2407.12269","title":"UTG: Towards a Unified View of Snapshot and Event Based Models for\n  Temporal Graphs","authors":"Shenyang Huang, Farimah Poursafaei, Reihaneh Rabbany, Guillaume\n  Rabusseau, Emanuele Rossi","authorsParsed":[["Huang","Shenyang",""],["Poursafaei","Farimah",""],["Rabbany","Reihaneh",""],["Rabusseau","Guillaume",""],["Rossi","Emanuele",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 02:35:24 GMT"}],"updateDate":"2024-07-18","timestamp":1721183724000,"abstract":"  Temporal graphs have gained increasing importance due to their ability to\nmodel dynamically evolving relationships. These graphs can be represented\nthrough either a stream of edge events or a sequence of graph snapshots. Until\nnow, the development of machine learning methods for both types has occurred\nlargely in isolation, resulting in limited experimental comparison and\ntheoretical crosspollination between the two. In this paper, we introduce\nUnified Temporal Graph (UTG), a framework that unifies snapshot-based and\nevent-based machine learning models under a single umbrella, enabling models\ndeveloped for one representation to be applied effectively to datasets of the\nother. We also propose a novel UTG training procedure to boost the performance\nof snapshot-based models in the streaming setting. We comprehensively evaluate\nboth snapshot and event-based models across both types of temporal graphs on\nthe temporal link prediction task. Our main findings are threefold: first, when\ncombined with UTG training, snapshotbased models can perform competitively with\nevent-based models such as TGN and GraphMixer even on event datasets. Second,\nsnapshot-based models are at least an order of magnitude faster than most\nevent-based models during inference. Third, while event-based methods such as\nNAT and DyGFormer outperforms snapshotbased methods on both types of temporal\ngraphs, this is because they leverage joint neighborhood structural features\nthus emphasizing the potential to incorporate these features into\nsnapshot-based models as well. These findings highlight the importance of\ncomparing model architectures independent of the data format and suggest the\npotential of combining the efficiency of snapshot-based models with the\nperformance of event-based models in the future.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"3ndd53jeg4rZTX5J8aXqEFEf4mPIukRh7gg8Xyl-lb8","pdfSize":"799920","objectId":"0xc54f76db718f76ec16ff420eca2d17062bd050c31864255457f2eff4a8afb2f5","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
