{"id":"2407.17938","title":"Analyzing Brain Tumor Connectomics using Graphs and Persistent Homology","authors":"Debanjali Bhattacharya, Ninad Aithal, Manish Jayswal and Neelam Sinha","authorsParsed":[["Bhattacharya","Debanjali",""],["Aithal","Ninad",""],["Jayswal","Manish",""],["Sinha","Neelam",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 10:55:19 GMT"}],"updateDate":"2024-07-26","timestamp":1721904919000,"abstract":"  Recent advances in molecular and genetic research have identified a diverse\nrange of brain tumor sub-types, shedding light on differences in their\nmolecular mechanisms, heterogeneity, and origins. The present study performs\nwhole-brain connectome analysis using diffusionweighted images. To achieve\nthis, both graph theory and persistent homology - a prominent approach in\ntopological data analysis are employed in order to quantify changes in the\nstructural connectivity of the wholebrain connectome in subjects with brain\ntumors. Probabilistic tractography is used to map the number of streamlines\nconnecting 84 distinct brain regions, as delineated by the Desikan-Killiany\natlas from FreeSurfer. These streamline mappings form the connectome matrix, on\nwhich persistent homology based analysis and graph theoretical analysis are\nexecuted to evaluate the discriminatory power between tumor sub-types that\ninclude meningioma and glioma. A detailed statistical analysis is conducted on\npersistent homology-derived topological features and graphical features to\nidentify the brain regions where differences between study groups are\nstatistically significant (p < 0.05). For classification purpose, graph-based\nlocal features are utilized, achieving a highest accuracy of 88%. In\nclassifying tumor sub-types, an accuracy of 80% is attained. The findings\nobtained from this study underscore the potential of persistent homology and\ngraph theoretical analysis of the whole-brain connectome in detecting\nalterations in structural connectivity patterns specific to different types of\nbrain tumors.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Computer Vision and Pattern Recognition","Mathematics/Algebraic Topology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"7aaat1yAT5HlV6O0aFPI06mc87MY3jkLW6vfj9rrXpI","pdfSize":"22767307","objectId":"0x6b6c938aede0353f738e26be528a1656d13b180d4c6e638c6937a370e0416770","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
