{"id":"2407.13913","title":"Efficient and Device-Independent Active Quantum State Certification","authors":"Michael Antesberger, Mariana M. E. Schmid, Huan Cao, Borivoje Daki\\'c,\n  Lee A. Rozema, Philip Walther","authorsParsed":[["Antesberger","Michael",""],["Schmid","Mariana M. E.",""],["Cao","Huan",""],["Dakić","Borivoje",""],["Rozema","Lee A.",""],["Walther","Philip",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 21:54:13 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 18:24:51 GMT"}],"updateDate":"2024-07-26","timestamp":1721339653000,"abstract":"  Entangled quantum states are essential ingredients for many quantum\ntechnologies, but they must be validated before they are used. As a full\ncharacterization is prohibitively resource-intensive, recent work has focused\non developing methods to efficiently extract a few parameters of interest, in a\nso-called verification framework. Most existing approaches are based on\npreparing an ensemble of nominally identical and independent (IID) quantum\nstates, and then measuring each copy of the ensemble. However, this leaves no\nstates left for the intended quantum tasks and the IID assumptions do not\nalways hold experimentally. To overcome these challenges, we experimentally\nimplement quantum state certification (QSC), which measures only a subset of\nthe ensemble, certifying the fidelity of the remaining states. We use active\noptical switches to randomly sample from sources of two-photon Bell states and\nthree-photon GHZ states, reporting statistically-sound fidelities in real time\nwithout destroying the entire ensemble. Additionally, our QSC protocol removes\nthe assumption that the states are identical, is device-independent, and can\nachieve close $N^{-1}$ scaling, in the number of states measured $N$.\nAltogether, these benefits make our QSC protocol suitable for benchmarking\nlarge-scale quantum computing devices and deployed quantum communication setups\nrelying on entanglement in both standard and adversarial situations.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"w1mJYy-xWBGsfmZOR4LlPc0dJ_yr7KSsr7YAzwNzo1g","pdfSize":"2148451","objectId":"0x058624730e9ef42c4f77b2bd7afec2c7d2e2c5a3316bfb1852c5d70f8c7ba72d","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
