{"id":"2407.01705","title":"Optimized Learning for X-Ray Image Classification for Multi-Class\n  Disease Diagnoses with Accelerated Computing Strategies","authors":"Sebastian A. Cruz Romero, Ivanelyz Rivera de Jesus, Dariana J. Troche\n  Quinones, Wilson Rivera Gallego","authorsParsed":[["Romero","Sebastian A. Cruz",""],["de Jesus","Ivanelyz Rivera",""],["Quinones","Dariana J. Troche",""],["Gallego","Wilson Rivera",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:31:30 GMT"}],"updateDate":"2024-07-03","timestamp":1719858690000,"abstract":"  X-ray image-based disease diagnosis lies in ensuring the precision of\nidentifying afflictions within the sample, a task fraught with challenges\nstemming from the occurrence of false positives and false negatives. False\npositives introduce the risk of erroneously identifying non-existent\nconditions, leading to misdiagnosis and a decline in patient care quality.\nConversely, false negatives pose the threat of overlooking genuine\nabnormalities, potentially causing delays in treatment and interventions,\nthereby resulting in adverse patient outcomes. The urgency to overcome these\nchallenges compels ongoing efforts to elevate the precision and reliability of\nX-ray image analysis algorithms within the computational framework. This study\nintroduces modified pre-trained ResNet models tailored for multi-class disease\ndiagnosis of X-ray images, incorporating advanced optimization strategies to\nreduce the execution runtime of training and inference tasks. The primary\nobjective is to achieve tangible performance improvements through accelerated\nimplementations of PyTorch, CUDA, Mixed- Precision Training, and Learning Rate\nScheduler. While outcomes demonstrate substantial improvements in execution\nruntimes between normal training and CUDA-accelerated training, negligible\ndifferences emerge between various training optimization modalities. This\nresearch marks a significant advancement in optimizing computational approaches\nto reduce training execution time for larger models. Additionally, we explore\nthe potential of effective parallel data processing using MPI4Py for the\ndistribution of gradient descent optimization across multiple nodes and\nleverage multiprocessing to expedite data preprocessing for larger datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"awb9g8jvkxOYM0ttZMMFMc5LMOuvgDUIGcIcKTxQLPk","pdfSize":"3551134","objectId":"0x9a8a6183d13a2cf1088da4bab235511a4d8eb1531b8e836251800849267fa80d","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
