{"id":"2407.13579","title":"Towards Zero-Shot Multimodal Machine Translation","authors":"Matthieu Futeral and Cordelia Schmid and Beno\\^it Sagot and Rachel\n  Bawden","authorsParsed":[["Futeral","Matthieu",""],["Schmid","Cordelia",""],["Sagot","Benoît",""],["Bawden","Rachel",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 15:20:31 GMT"}],"updateDate":"2024-07-19","timestamp":1721316031000,"abstract":"  Current multimodal machine translation (MMT) systems rely on fully supervised\ndata (i.e models are trained on sentences with their translations and\naccompanying images). However, this type of data is costly to collect, limiting\nthe extension of MMT to other language pairs for which such data does not\nexist. In this work, we propose a method to bypass the need for fully\nsupervised data to train MMT systems, using multimodal English data only. Our\nmethod, called ZeroMMT, consists in adapting a strong text-only machine\ntranslation (MT) model by training it on a mixture of two objectives: visually\nconditioned masked language modelling and the Kullback-Leibler divergence\nbetween the original and new MMT outputs. We evaluate on standard MMT\nbenchmarks and the recently released CoMMuTE, a contrastive benchmark aiming to\nevaluate how well models use images to disambiguate English sentences. We\nobtain disambiguation performance close to state-of-the-art MMT models trained\nadditionally on fully supervised examples. To prove that our method generalizes\nto languages with no fully supervised training data available, we extend the\nCoMMuTE evaluation dataset to three new languages: Arabic, Russian and Chinese.\nWe further show that we can control the trade-off between disambiguation\ncapabilities and translation fidelity at inference time using classifier-free\nguidance and without any additional data. Our code, data and trained models are\npublicly accessible.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"8DPdMLFqrWFOCvF62mKkvoBl3gtT2w4t2l4B-nrtZnE","pdfSize":"4599556","objectId":"0xa20923bbf5e161a51251c323218caf330ad2269757d8c23edb4a7619cdbae9fe","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
