{"id":"2407.20007","title":"Rosetta Statements: Lowering the Barrier for Semantic Parsing and\n  Increasing the Cognitive Interoperability of Knowledge Graphs","authors":"Lars Vogt, Marcel Konrad, Kheir Eddine Farfar, Manuel Prinz, Allard\n  Oelen","authorsParsed":[["Vogt","Lars",""],["Konrad","Marcel",""],["Farfar","Kheir Eddine",""],["Prinz","Manuel",""],["Oelen","Allard",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:41:34 GMT"}],"updateDate":"2024-07-30","timestamp":1722260494000,"abstract":"  Machines need data and metadata to be machine-actionable and FAIR (findable,\naccessible, interoperable, reusable) to manage increasing data volumes.\nKnowledge graphs and ontologies are key to this, but their use is hampered by\nhigh access barriers due to required prior knowledge in semantics and data\nmodelling. The Rosetta Statement approach proposes modeling English natural\nlanguage statements instead of a mind-independent reality. We propose a\nmetamodel for creating semantic schema patterns for simple statement types. The\napproach supports versioning of statements and provides a detailed editing\nhistory. Each Rosetta Statement pattern has a dynamic label for displaying\nstatements as natural language sentences. Implemented in the Open Research\nKnowledge Graph (ORKG) as a use case, this approach allows domain experts to\ndefine data schema patterns without needing semantic knowledge. Future plans\ninclude combining Rosetta Statements with semantic units to organize ORKG into\nmeaningful subgraphs, improving usability. A search interface for querying\nstatements without needing SPARQL or Cypher knowledge is also planned, along\nwith tools for data entry and display using Large Language Models and NLP. The\nRosetta Statement metamodel supports a two-step knowledge graph construction\nprocedure. Domain experts can model semantic content without support from\nontology engineers, lowering entry barriers and increasing cognitive\ninteroperability. The second level involves developing semantic graph patterns\nfor reasoning, requiring collaboration with ontology engineers.\n","subjects":["Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wfqLoRJoar8alLQXR6oaEKfcUnj1dk-pK3OjjSidPkQ","pdfSize":"2035417","objectId":"0xb8929ae5b4f3f7d335ec150381ff9fe0959e8959423b0e459f56553c6df500d3","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
