{"id":"2407.10946","title":"Corrected Thermodynamics and Stability of Magnetic charged AdS Black\n  Holes surrounded by Quintessence","authors":"Dhruba Jyoti Gogoi, Yassine Sekhmani, Shyamalee Bora, Javlon\n  Rayimbaev, Jyatsnasree Bora and Ratbay Myrzakulov","authorsParsed":[["Gogoi","Dhruba Jyoti",""],["Sekhmani","Yassine",""],["Bora","Shyamalee",""],["Rayimbaev","Javlon",""],["Bora","Jyatsnasree",""],["Myrzakulov","Ratbay",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:44:30 GMT"}],"updateDate":"2024-07-16","timestamp":1721065470000,"abstract":"  In this study, we explore the corrected thermodynamics of non-linear magnetic\ncharged anti-de Sitter (AdS) black holes surrounded by quintessence,\nincorporating thermal fluctuations and deriving the corrected thermodynamic\npotentials. We analyze the effects of corrections due to thermal fluctuations\non various thermodynamic potentials, including enthalpy, Helmholtz free energy,\nand Gibbs free energy. Our results show significant impacts on smaller black\nholes, with first-order corrections destabilizing them, while second-order\ncorrections enhance stability with increasing parameter values. The specific\nheat analysis further elucidates the stability criteria, indicating that the\nlarge black holes ensure stability against phase transitions. However, the\nthermal fluctuations do not affect the physical limitation points as well as\nthe second-order phase transition points of the black hole. Our findings\nhighlight the intricate role of thermal fluctuations in black hole\nthermodynamics and their influence on stability, providing deeper insights into\nthe behaviour of black holes under corrected thermodynamic conditions.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fti6yPelNFsok77KS0Km_4prdaRXKU8CGnVHInge3MA","pdfSize":"801064","objectId":"0x84bc11463e74b2f0cd7ed03eed763af05a26af2bb956e901835461db5eb26e15","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
