{"id":"2407.16224","title":"OutfitAnyone: Ultra-high Quality Virtual Try-On for Any Clothing and Any\n  Person","authors":"Ke Sun, Jian Cao, Qi Wang, Linrui Tian, Xindi Zhang, Lian Zhuo, Bang\n  Zhang, Liefeng Bo, Wenbo Zhou, Weiming Zhang, Daiheng Gao","authorsParsed":[["Sun","Ke",""],["Cao","Jian",""],["Wang","Qi",""],["Tian","Linrui",""],["Zhang","Xindi",""],["Zhuo","Lian",""],["Zhang","Bang",""],["Bo","Liefeng",""],["Zhou","Wenbo",""],["Zhang","Weiming",""],["Gao","Daiheng",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 07:04:42 GMT"}],"updateDate":"2024-07-24","timestamp":1721718282000,"abstract":"  Virtual Try-On (VTON) has become a transformative technology, empowering\nusers to experiment with fashion without ever having to physically try on\nclothing. However, existing methods often struggle with generating\nhigh-fidelity and detail-consistent results. While diffusion models, such as\nStable Diffusion series, have shown their capability in creating high-quality\nand photorealistic images, they encounter formidable challenges in conditional\ngeneration scenarios like VTON. Specifically, these models struggle to maintain\na balance between control and consistency when generating images for virtual\nclothing trials. OutfitAnyone addresses these limitations by leveraging a\ntwo-stream conditional diffusion model, enabling it to adeptly handle garment\ndeformation for more lifelike results. It distinguishes itself with\nscalability-modulating factors such as pose, body shape and broad\napplicability, extending from anime to in-the-wild images. OutfitAnyone's\nperformance in diverse scenarios underscores its utility and readiness for\nreal-world deployment. For more details and animated results, please see\n\\url{https://humanaigc.github.io/outfit-anyone/}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"qXaY1bJVUR413YVhfttE8IQc0UzTh4jzqfEuZS2iE0Y","pdfSize":"45871715","objectId":"0x9cad2446712c1fd3860f083beaac75c0840effa50d910e053a1451269638daa2","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
