{"id":"2407.02632","title":"STL: Still Tricky Logic (for System Validation, Even When Showing Your\n  Work)","authors":"Isabelle Hurley, Rohan Paleja, Ashley Suh, Jaime D. Pe\\~na, Ho Chit\n  Siu","authorsParsed":[["Hurley","Isabelle",""],["Paleja","Rohan",""],["Suh","Ashley",""],["Peña","Jaime D.",""],["Siu","Ho Chit",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 19:51:06 GMT"}],"updateDate":"2024-07-04","timestamp":1719949866000,"abstract":"  As learned control policies become increasingly common in autonomous systems,\nthere is increasing need to ensure that they are interpretable and can be\nchecked by human stakeholders. Formal specifications have been proposed as ways\nto produce human-interpretable policies for autonomous systems that can still\nbe learned from examples. Previous work showed that despite claims of\ninterpretability, humans are unable to use formal specifications presented in a\nvariety of ways to validate even simple robot behaviors. This work uses active\nlearning, a standard pedagogical method, to attempt to improve humans' ability\nto validate policies in signal temporal logic (STL). Results show that overall\nvalidation accuracy is not high, at $65\\% \\pm 15\\%$ (mean $\\pm$ standard\ndeviation), and that the three conditions of no active learning, active\nlearning, and active learning with feedback do not significantly differ from\neach other. Our results suggest that the utility of formal specifications for\nhuman interpretability is still unsupported but point to other avenues of\ndevelopment which may enable improvements in system validation.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Formal Languages and Automata Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"oeCzE_6sc92-eGH3cqmX-P20XzT4jJFl9Pc4PfdzbvI","pdfSize":"2479924","objectId":"0xc6754b6d150d45841143cf8bf43cc0a12def8e1aba3e97942cff03d741e38915","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
