{"id":"2407.17804","title":"Bayesian Spatiotemporal Wombling","authors":"Aritra Halder, Didong Li and Sudipto Banerjee","authorsParsed":[["Halder","Aritra",""],["Li","Didong",""],["Banerjee","Sudipto",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 06:22:34 GMT"}],"updateDate":"2024-07-26","timestamp":1721888554000,"abstract":"  Stochastic process models for spatiotemporal data underlying random fields\nfind substantial utility in a range of scientific disciplines. Subsequent to\npredictive inference on the values of the random field (or spatial surface\nindexed continuously over time) at arbitrary space-time coordinates, scientific\ninterest often turns to gleaning information regarding zones of rapid\nspatial-temporal change. We develop Bayesian modeling and inference for\ndirectional rates of change along a given surface. These surfaces, which\ndemarcate regions of rapid change, are referred to as ``wombling'' surface\nboundaries. Existing methods for studying such changes have often been\nassociated with curves and are not easily extendable to surfaces resulting from\ncurves evolving over time. Our current contribution devises a fully model-based\ninferential framework for analyzing differential behavior in spatiotemporal\nresponses by formalizing the notion of a ``wombling'' surface boundary using\nconventional multi-linear vector analytic frameworks and geometry followed by\nposterior predictive computations using triangulated surface approximations. We\nillustrate our methodology with comprehensive simulation experiments followed\nby multiple applications in environmental and climate science; pollutant\nanalysis in environmental health; and brain imaging.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fyzKPgrdEZihqqOoxVXaeGx5qgk-9Mw-0ssU_rMbazQ","pdfSize":"148147223","objectId":"0x0474ed5982e015afcef471e43629a1492b46fc7647fd44d54b9c760c164124ae","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
