{"id":"2407.08752","title":"From Modular to End-to-End Speaker Diarization","authors":"Federico Landini","authorsParsed":[["Landini","Federico",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 15:09:39 GMT"}],"updateDate":"2024-07-15","timestamp":1719500979000,"abstract":"  Speaker diarization is usually referred to as the task that determines ``who\nspoke when'' in a recording. Until a few years ago, all competitive approaches\nwere modular. Systems based on this framework reached state-of-the-art\nperformance in most scenarios but had major difficulties dealing with\noverlapped speech. More recently, the advent of end-to-end models, capable of\ndealing with all aspects of speaker diarization with a single model and better\nperforming regarding overlapped speech, has brought high levels of attention.\n  This thesis is framed during a period of co-existence of these two trends. We\ndescribe a system based on a Bayesian hidden Markov model used to cluster\nx-vectors (speaker embeddings obtained with a neural network), known as VBx,\nwhich has shown remarkable performance on different datasets and challenges. We\ncomment on its advantages and limitations and evaluate results on different\nrelevant corpora. Then, we move towards end-to-end neural diarization (EEND)\nmethods. Due to the need for large training sets for training these models and\nthe lack of manually annotated diarization data in sufficient quantities, the\ncompromise solution consists in generating training data artificially. We\ndescribe an approach for generating synthetic data which resembles real\nconversations in terms of speaker turns and overlaps. We show how this method\ngenerating ``simulated conversations'' allows for better performance than using\na previously proposed method for creating ``simulated mixtures'' when training\nthe popular EEND with encoder-decoder attractors (EEND-EDA). We also propose a\nnew EEND-based model, which we call DiaPer, and show that it can perform better\nthan EEND-EDA, especially when dealing with many speakers and handling\noverlapped speech. Finally, we compare both VBx-based and DiaPer systems on a\nwide variety of corpora and comment on the advantages of each technique.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Sound"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"0Ho8GCZ2mO_bTUbhedOLgn-uVBj_9ob5dS82eap7XxQ","pdfSize":"5539323","objectId":"0xb14773a82171475a40a63e678d59eeb5322d32c997f6350b79c14f91bb6117da","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
