{"id":"2407.18716","title":"ChatSchema: A pipeline of extracting structured information with Large\n  Multimodal Models based on schema","authors":"Fei Wang and Yuewen Zheng and Qin Li and Jingyi Wu and Pengfei Li and\n  Luxia Zhang","authorsParsed":[["Wang","Fei",""],["Zheng","Yuewen",""],["Li","Qin",""],["Wu","Jingyi",""],["Li","Pengfei",""],["Zhang","Luxia",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 13:05:24 GMT"}],"updateDate":"2024-07-29","timestamp":1721999124000,"abstract":"  Objective: This study introduces ChatSchema, an effective method for\nextracting and structuring information from unstructured data in medical paper\nreports using a combination of Large Multimodal Models (LMMs) and Optical\nCharacter Recognition (OCR) based on the schema. By integrating predefined\nschema, we intend to enable LMMs to directly extract and standardize\ninformation according to the schema specifications, facilitating further data\nentry. Method: Our approach involves a two-stage process, including\nclassification and extraction for categorizing report scenarios and structuring\ninformation. We established and annotated a dataset to verify the effectiveness\nof ChatSchema, and evaluated key extraction using precision, recall, F1-score,\nand accuracy metrics. Based on key extraction, we further assessed value\nextraction. We conducted ablation studies on two LMMs to illustrate the\nimprovement of structured information extraction with different input modals\nand methods. Result: We analyzed 100 medical reports from Peking University\nFirst Hospital and established a ground truth dataset with 2,945 key-value\npairs. We evaluated ChatSchema using GPT-4o and Gemini 1.5 Pro and found a\nhigher overall performance of GPT-4o. The results are as follows: For the\nresult of key extraction, key-precision was 98.6%, key-recall was 98.5%,\nkey-F1-score was 98.6%. For the result of value extraction based on correct key\nextraction, the overall accuracy was 97.2%, precision was 95.8%, recall was\n95.8%, and F1-score was 95.8%. An ablation study demonstrated that ChatSchema\nachieved significantly higher overall accuracy and overall F1-score of\nkey-value extraction, compared to the Baseline, with increases of 26.9% overall\naccuracy and 27.4% overall F1-score, respectively.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nS2-Dnvqz9-j1hBXq_YMLEmdwm8TSGJxyIbBbLQt-fU","pdfSize":"1632406","objectId":"0x2d8c0ffb76908c0dff092962cc6f1f7cb7b8d1c801d6139e9023afd5184b8194","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
