{"id":"2407.03060","title":"Effect of Lyman-$\\alpha$ Radiative Transfer on Intensity Mapping Power\n  Spectra","authors":"Maja Lujan Niemeyer","authorsParsed":[["Niemeyer","Maja Lujan",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 12:32:58 GMT"}],"updateDate":"2024-07-04","timestamp":1720009978000,"abstract":"  Clustering of Lyman-$\\alpha$ (Ly$\\alpha$) emitting galaxies (LAEs) is a\nuseful probe of cosmology. However, Ly$\\alpha$ radiative transfer (RT) effects,\nsuch as absorption, line shift, and line broadening, and their dependence on\nthe large-scale density and velocity fields can modify the measured LAE\nclustering and line intensity mapping (LIM) statistics. We explore the effect\nof RT on the Ly$\\alpha$ LIM power spectrum in two ways: using an analytic\ndescription based on linear approximations and using lognormal mocks. The\nqualitative effect of intergalactic Ly$\\alpha$ absorption on the LIM auto- and\ncross-power spectrum is a scale-dependent, reduced effective bias, reduced mean\nintensity, and modified redshift-space distortions. The linear absorption model\ndoes not describe the results of the lognormal simulations well. The random\nline shift suppresses the redshift-space power spectrum similar to the\nFingers-of-God effect. In cross-correlation of LAEs or Ly$\\alpha$ intensity\nwith a non-Ly$\\alpha$ tracer, the Ly$\\alpha$ line shift leads to a phase shift\nof the complex power spectrum, i.e. a cosine damping of the real part. Line\nbroadening from RT suppresses the LIM power spectra in the same way as limited\nspectral resolution. We study the impact of Ly$\\alpha$ RT effects on the\nHobby-Eberly Telescope Dark Energy Experiment (HETDEX) LAE and LIM power\nspectra using lognormal mocks. We find that even small amounts of IGM\nabsorption will significantly change the measured LAE auto-power spectrum and\nthe LAE-intensity cross-power spectrum. Therefore, HETDEX will be able to\nconstrain Ly$\\alpha$ RT effects.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2xCfTMLLFNIpZ1b_La6tw29eOFcqron7dmgshopDa6o","pdfSize":"868836"}
