{"id":"2407.12910","title":"Detecting low-mass haloes with strong gravitational lensing II:\n  constraints on the density profiles of two detected subhaloes","authors":"Giulia Despali, Felix M. Heinze, Christopher D. Fassnacht, Simona\n  Vegetti, Cristiana Spingola, Ralf Klessen","authorsParsed":[["Despali","Giulia",""],["Heinze","Felix M.",""],["Fassnacht","Christopher D.",""],["Vegetti","Simona",""],["Spingola","Cristiana",""],["Klessen","Ralf",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-19","timestamp":1721239201000,"abstract":"  Strong gravitational lensing can detect the presence of low-mass haloes and\nsubhaloes through their effect on the surface brightness of lensed arcs. We\ncarry out an extended analysis of the density profiles and mass distributions\nof two detected subhaloes, intending to determine if their properties are\nconsistent with the predictions of the cold dark matter (CDM) model. We analyse\ntwo gravitational lensing systems in which the presence of two low-mass\nsubhaloes has been previously reported: SDSSJ0946+1006 and JVASB1938+66. We\nmodel these detections assuming four different models for their density\nprofiles and compare our results with predictions from the IllustrisTNG50-1\nsimulation. We find that the detected subhaloes are well-modelled by steep\ninner density slopes, close to or steeper than isothermal. The NFW profile thus\nneeds extremely high concentrations to reproduce the observed properties, which\nare outliers of the CDM predictions. We also find a characteristic radius\nwithin which the best-fitting density profiles predict the same enclosed mass.\nWe conclude that the lens modelling can constrain this quantity more robustly\nthan the inner slope. We find that the diversity of subhalo profiles in TNG50,\nconsistent with tidally stripping and baryonic effects, is able to match the\nobserved steep inner slopes, somewhat alleviating the tension reported by\nprevious works even if the detections are not well fit by the typical subhalo.\nHowever, while we find simulated analogues of the detection in B1938+666, the\nstellar content required by simulations to explain the central density of the\ndetection in J0946+1006 is in tension with the upper limit in luminosity\nestimated from the observations. New detections will increase our statistical\nsample and help us reveal more about the density profiles of these objects and\nthe dark matter content of the Universe.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"dvJGm046lZtJrk_QsHImZVD9tReMgyitaE2zpVk0jCI","pdfSize":"5370830","objectId":"0xf8d23d4980df4b9c59e265d93193fdc13617ae28ee6ed1482dc2be39f9d4dc85","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
