{"id":"2407.10202","title":"Sensitivity Analysis and Monte Carlo Based Uncertainty Quantification of\n  the In-process Modal Parameters in Milling","authors":"M. Hashemitaheri, T.T. Le, T. Khan, H. Cherukuri","authorsParsed":[["Hashemitaheri","M.",""],["Le","T. T.",""],["Khan","T.",""],["Cherukuri","H.",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 13:47:19 GMT"}],"updateDate":"2024-07-16","timestamp":1720964839000,"abstract":"  The material removal rates during milling operations are affected by the\nselection of the cutting depth and spindle speed. Poor selection of these\nparameters can result in chatter or suboptimal material removal rates.\nStability Lobe Diagrams (SLDs) are the well-known approach to selecting\nappropriate chatter-free values for these parameters. The Physics-based\nstability lobe diagram is usually generated using the structural dynamics and\nthe cutting parameters. However, since the machine dynamics are measured in the\nstatic state of the machine (zero speed), the generated SLD is not reliable as\nthe machine behavior may vary during the cutting operations. Besides, measuring\nstructural dynamics parameters under cutting conditions is difficult and needs\nnew equipment. This study proposes a new approach to determining in-process\nstructural dynamics parameters based on a multivariate Newton-Raphson method.\nThe physics-based model is combined with empirical records to extract reliable\nstructural dynamics parameters inversely. Some examples based on synthetic data\nare presented to illustrate this inverse approach. Also, the performance of the\nalgorithm is evaluated on an empirical data set and its ability to improve the\nstability boundary is verified. Furthermore, the sensitivity analysis is\nperformed to quantify the exposure of the SLD to the changes in each structural\ndynamics parameter.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Mathematics/Dynamical Systems"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"JMXmpBtpysdbu6yCWJDtWd9MLpqZwh0P4yunTkZbJi4","pdfSize":"1265322","objectId":"0x1bbbd804982268ccc1de2f1b2c28f3979fe61396d9fdf7b41341961a533e7b2c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
