{"id":"2407.16743","title":"A high-efficiency plug-and-play superconducting qubit network","authors":"Michael Mollenhauer, Abdullah Irfan, Xi Cao, Supriya Mandal, and\n  Wolfgang Pfaff","authorsParsed":[["Mollenhauer","Michael",""],["Irfan","Abdullah",""],["Cao","Xi",""],["Mandal","Supriya",""],["Pfaff","Wolfgang",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:58:59 GMT"}],"updateDate":"2024-07-25","timestamp":1721757539000,"abstract":"  Modular architectures are a promising approach to scale quantum devices to\nthe point of fault tolerance and utility. Modularity is particularly appealing\nfor superconducting qubits, as monolithically manufactured devices are limited\nin both system size and quality. Constructing complex quantum systems as\nnetworks of interchangeable modules can overcome this challenge through\n`Lego-like' assembly, reconfiguration, and expansion, in a spirit similar to\nmodern classical computers. First prototypical superconducting quantum device\nnetworks have been demonstrated. Interfaces that simultaneously permit\ninterchangeability and high-fidelity operations remain a crucial challenge,\nhowever. Here, we demonstrate a high-efficiency interconnect based on a\ndetachable cable between superconducting qubit devices. We overcome the\ninevitable loss in a detachable connection through a fast pump scheme, enabling\ninter-module SWAP efficiencies at the 99%-level in less than 100 ns. We use\nthis scheme to generate high-fidelity entanglement and operate a distributed\nlogical dual-rail qubit. At the observed ~1% error rate, operations through the\ninterconnect are at the threshold for fault-tolerance. These results introduce\na modular architecture for scaling quantum processors with reconfigurable and\nexpandable networks.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"d5F8crpkcqWSy4Xby4OzWQlFLtiynlKGQ0yh_-u6R9k","pdfSize":"2445381","objectId":"0x5e35c39dc1e19dfec38802754c835a4bfbf3366b9c4353c7ba77f5dec455d8af","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
