{"id":"2407.18701","title":"Designing Phase Sensitive Probes of Monopole Superconducting Order","authors":"Grayson R. Frazier, Junjia Zhang, Junyi Zhang, Xinyu Sun, Yi Li","authorsParsed":[["Frazier","Grayson R.",""],["Zhang","Junjia",""],["Zhang","Junyi",""],["Sun","Xinyu",""],["Li","Yi",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 12:34:38 GMT"}],"updateDate":"2024-07-29","timestamp":1721997278000,"abstract":"  Distinct from familiar $s$-, $p$-, or $d$-wave pairings, the monopole\nsuperconducting order represents a novel class of pairing order arising from\nnontrivial monopole charge of the Cooper pair. In the weak-coupling regime,\nthis order can emerge when pairing occurs between Fermi surfaces with different\nChern numbers in, for example, doped Weyl semimetal systems. However, the phase\nof monopole pairing order is not well-defined over an entire Fermi surface,\nmaking it challenging to design experiments sensitive to both its symmetry and\ntopology. To address this, we propose a scheme based on symmetry and\ntopological principles to identify this elusive pairing order through a set of\nphase-sensitive Josephson experiments. By examining the discrepancy between\nglobal and local angular momentum of the pairing order, we can unveil the\nmonopole charge of the pairing order. We demonstrate the proposed probe of\nmonopole pairing order through analytic and numerical studies of Josephson\ncoupling in models of monopole superconductor junctions. This work opens a\npromising avenue to uncover the unique topological properties of monopole\npairing orders and to distinguish them from known pairing orders based on\nspherical harmonic symmetry.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"i6I-Sl_ale7PPr9PQnboFhPmMqiJYmIxMkNaduaO_VE","pdfSize":"4806211","objectId":"0x4e5e35880cbf4594aa7119035ae7a8df0588dbf53e2bae2666fe9da314b37f6f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
