{"id":"2407.15229","title":"The Hitchhiker's Guide to Human Alignment with *PO","authors":"Kian Ahrabian, Xihui Lin, Barun Patra, Vishrav Chaudhary, Alon\n  Benhaim, Jay Pujara, Xia Song","authorsParsed":[["Ahrabian","Kian",""],["Lin","Xihui",""],["Patra","Barun",""],["Chaudhary","Vishrav",""],["Benhaim","Alon",""],["Pujara","Jay",""],["Song","Xia",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 17:35:20 GMT"}],"updateDate":"2024-07-23","timestamp":1721583320000,"abstract":"  With the growing utilization of large language models (LLMs) across domains,\nalignment towards human preferences has become one of the most critical aspects\nof training models. At the forefront of state-of-the-art human alignment\nmethods are preference optimization methods (*PO). However, prior research has\noften concentrated on identifying the best-performing method, typically\ninvolving a grid search over hyperparameters, which can be impractical for\ngeneral practitioners. In this paper, we aim to identify the algorithm that,\nwhile being performant, is simultaneously more robust to varying\nhyperparameters, thereby increasing the likelihood of achieving better results.\nWe focus on a realistic out-of-distribution (OOD) scenario that mirrors\nreal-world applications of human alignment, offering practical insights into\nthe strengths and weaknesses of these methods. Furthermore, to better\nunderstand the shortcomings of generations from the different methods, we\nanalyze the model generations through the lens of KL divergence of the SFT\nmodel and the response length statistics. Our analysis reveals that the widely\nadopted DPO method consistently produces lengthy responses of inferior quality\nthat are very close to the SFT responses. Motivated by these findings, we\npropose an embarrassingly simple extension to the DPO algorithm, LN-DPO,\nresulting in more concise responses without sacrificing quality compared to the\npolicy obtained by vanilla DPO.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WFWmh-o1iLwo7PwDa_UM8OuvmXvKJIHKKAV6tXuUof4","pdfSize":"2089499","objectId":"0xe54f172a50068adc0ee8904b5a894c78adcbaa23a1bab7a9a50ce55b7e920414","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
