{"id":"2407.06553","title":"Gravitational orbital Hall effect of vortex light in Lense-Thirring\n  metric","authors":"Wei-Si Qiu and Dan-Dan Lian and Peng-Ming Zhang","authorsParsed":[["Qiu","Wei-Si",""],["Lian","Dan-Dan",""],["Zhang","Peng-Ming",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 05:18:30 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 08:24:26 GMT"}],"updateDate":"2024-08-12","timestamp":1720502310000,"abstract":"  Vortex light, characterized by an intrinsic orbital angular momentum (OAM)\naligned with its propagation direction, is described through vortex\nelectromagnetic waves. Similar to the gravitational spin Hall effect (SHE),\nvortex light is expected to exhibit intrinsic OAM-dependent trajectories and\ndeviations from the null geodesic plane when propagating through a\ngravitational field, a phenomenon termed the gravitational orbital Hall effect\n(OHE). In this work, we model the vortex light as vortex Laguerre-Gaussian\nelectromagnetic wave packets and analyze its motion by solving covariant\nMaxwell equations within the Lense-Thirring metric. Our findings reveal that\nthe trajectory of vortex light with an intrinsic OAM deviates from the null\ngeodesic in two ways. It deviates both perpendicular to, and within, the null\ngeodesic plane. This behavior contrasts with the gravitational SHE, where\nspin-polarized light primarily deviates perpendicular to the null geodesic\nplane. Moreover, the relationship between the deviation and intrinsic OAM\ndiffers significantly from that between the deviation and spin. These results\nsuggest a unique interaction between intrinsic OAM and gravity, distinct from\nthe spin-gravity coupling, indicating that the gravitational OHE of light might\nnot be precisely predicted by merely substituting spin with intrinsic OAM in\nthe gravitational SHE of light.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4x9yE4-MZgT0Q3gGwe47z4-EA3CJrDxT7XsQ-6WIQrk","pdfSize":"587152"}
