{"id":"2407.14357","title":"Interior Object Geometry via Fitted Frames","authors":"Stephen M. Pizer, Zhiyuan Liu, Junjie Zhao, Nicholas Tapp-Hughes,\n  James Damon, Miaomiao Zhang, JS Marron, Jared Vicory","authorsParsed":[["Pizer","Stephen M.",""],["Liu","Zhiyuan",""],["Zhao","Junjie",""],["Tapp-Hughes","Nicholas",""],["Damon","James",""],["Zhang","Miaomiao",""],["Marron","JS",""],["Vicory","Jared",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 14:38:47 GMT"}],"updateDate":"2024-07-22","timestamp":1721399927000,"abstract":"  We describe a representation targeted for anatomic objects which is designed\nto enable strong locational correspondence within object populations and thus\nto provide powerful object statistics. The method generates fitted frames on\nthe boundary and in the interior of objects and produces alignment-free\ngeometric features from them. It accomplishes this by understanding an object\nas the diffeomorphic deformation of an ellipsoid and using a skeletal\nrepresentation fitted throughout the deformation to produce a model of the\ntarget object, where the object is provided initially in the form of a boundary\nmesh. Via classification performance on hippocampi shape between individuals\nwith a disorder vs. others, we compare our method to two state-of-the-art\nmethods for producing object representations that are intended to capture\ngeometric correspondence across a population of objects and to yield geometric\nfeatures useful for statistics, and we show improved classification performance\nby this new representation, which we call the evolutionary s-rep. The geometric\nfeatures that are derived from each of the representations, especially via\nfitted frames, is discussed.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"clHkjR3mAIY6qTiJaCjro9iP2f7pMjjcnWlUVJU5Mqk","pdfSize":"817709","objectId":"0x69c2f92ddc1089d26d5064974a158ee7f62823d588446263e482573c137a3c6a","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
