{"id":"2407.13512","title":"MIR laser CEP estimation using machine learning concepts in bulk high\n  harmonic generation","authors":"Bal\\'azs Nagyill\\'es, Gergely N. Nagy, B\\'alint Kiss, Eric Cormier,\n  P\\'eter F\\\"oldi, Katalin Varj\\'u, Subhendu Kahaly, Mousumi Upadhyay Kahaly,\n  Zsolt Diveki","authorsParsed":[["Nagyillés","Balázs",""],["Nagy","Gergely N.",""],["Kiss","Bálint",""],["Cormier","Eric",""],["Földi","Péter",""],["Varjú","Katalin",""],["Kahaly","Subhendu",""],["Kahaly","Mousumi Upadhyay",""],["Diveki","Zsolt",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 13:43:01 GMT"}],"updateDate":"2024-07-19","timestamp":1721310181000,"abstract":"  Monitoring the carrier-envelope phase (CEP) is of paramount importance for\nexperiments involving few cycle intense laser fields. Common measurement\ntechniques include f-2f interferometry or stereo-ATI setups. These approaches\nare adequate, but are challenging to implement on demand, at different\nlocations as additional metrology tools, in intense few cycle laser-matter\ninteraction experiments, such as those prevalent in sophisticated user\nbeamlines. In addition there are inherent difficulties for CEP measured at\nnon-conventional laser wavelengths (like e.g. mid infrared) and measurements\nabove 10 kHz laser repetition rates, on single shot basis. Here we demonstrate\nboth by simulations and by experiments a machine learning (ML) driven method\nfor CEP estimation in the mid infrared, which is readily generalizable for any\nlaser wavelength and possibly up to MHz repetition rates. The concept relies on\nthe observation of the spectrum of high harmonic generation (HHG) in bulk\nmaterial and the use of ML techniques to estimate the CEP of the laser. Once\nthe ML model is trained, the method provides a way for cheap and compact\nreal-time CEP tagging. This technique can complement the otherwise\nsophisticated monitoring of CEP, and is able to capture the complex correlation\nbetween the CEP and the observable HHG spectra.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"yGgvRQLn_oayEWnQV13psJQ_2PWj_9O9vv7YoY8V2WE","pdfSize":"1630935","objectId":"0xbee96404070e1cbf5e701839069e0f7c8fa02dd883f92ebaacf7e207c84e22b3","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
