{"id":"2407.12404","title":"Analyzing the Generalization and Reliability of Steering Vectors","authors":"Daniel Tan, David Chanin, Aengus Lynch, Dimitrios Kanoulas, Brooks\n  Paige, Adria Garriga-Alonso, Robert Kirk","authorsParsed":[["Tan","Daniel",""],["Chanin","David",""],["Lynch","Aengus",""],["Kanoulas","Dimitrios",""],["Paige","Brooks",""],["Garriga-Alonso","Adria",""],["Kirk","Robert",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 08:32:03 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 08:28:31 GMT"}],"updateDate":"2024-07-23","timestamp":1721205123000,"abstract":"  Steering vectors (SVs) are a new approach to efficiently adjust language\nmodel behaviour at inference time by intervening on intermediate model\nactivations. They have shown promise in terms of improving both capabilities\nand model alignment. However, the reliability and generalisation properties of\nthis approach are unknown. In this work, we rigorously investigate these\nproperties, and show that steering vectors have substantial limitations both\nin- and out-of-distribution. In-distribution, steerability is highly variable\nacross different inputs. Depending on the concept, spurious biases can\nsubstantially contribute to how effective steering is for each input,\npresenting a challenge for the widespread use of steering vectors.\nOut-of-distribution, while steering vectors often generalise well, for several\nconcepts they are brittle to reasonable changes in the prompt, resulting in\nthem failing to generalise well. Overall, our findings show that while steering\ncan work well in the right circumstances, there remain many technical\ndifficulties of applying steering vectors to guide models' behaviour at scale.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uKHdGWyji4LZS-mUkrHAdEoi-p1yvRED3JzWplMNZo4","pdfSize":"1120382","objectId":"0xdbcde522905f395a40e433b858ae76c25cc72c7e922c05dbbb0488b71986f679","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
