{"id":"2407.02269","title":"IFTT-PIN: A Self-Calibrating PIN-Entry Method","authors":"Kathryn McConkey, Talha Enes Ayranci, Mohamed Khamis, Jonathan Grizou","authorsParsed":[["McConkey","Kathryn",""],["Ayranci","Talha Enes",""],["Khamis","Mohamed",""],["Grizou","Jonathan",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 13:58:28 GMT"}],"updateDate":"2024-07-03","timestamp":1719928708000,"abstract":"  Personalising an interface to the needs and preferences of a user often\nincurs additional interaction steps. In this paper, we demonstrate a novel\nmethod that enables the personalising of an interface without the need for\nexplicit calibration procedures, via a process we call self-calibration. A\nsecond-order effect of self-calibration is that an outside observer cannot\neasily infer what a user is trying to achieve because they cannot interpret the\nuser's actions. To explore this security angle, we developed IFTT-PIN (If This\nThen PIN) as the first self-calibrating PIN-entry method. When using IFTT-PIN,\nusers are free to choose any button for any meaning without ever explicitly\ncommunicating their choice to the machine. IFTT-PIN infers both the user's PIN\nand their preferred button mapping at the same time. This paper presents the\nconcept, implementation, and interactive demonstrations of IFTT-PIN, as well as\nan evaluation against shoulder surfing attacks. Our study (N=24) shows that by\nadding self-calibration to an existing PIN entry method, IFTT-PIN statistically\nsignificantly decreased PIN attack decoding rate by ca. 8.5 times (p=1.1e-9),\nwhile only decreasing the PIN entry encoding rate by ca. 1.4 times (p=0.02),\nleading to a positive security-usability trade-off. IFTT-PIN's entry rate\nsignificantly improved 21 days after first exposure (p=3.6e-6) to the method,\nsuggesting self-calibrating interfaces are memorable despite using an initially\nundefined user interface. Self-calibration methods might lead to novel\nopportunities for interaction that are more inclusive and versatile, a\npotentially interesting challenge for the community. A short introductory video\nis available at https://youtu.be/pP5sfniNRns.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"a3h2jg4VBNoVmIV_4Qk6-qUeE7uXVwCEcF85_VpCibE","pdfSize":"930530","objectId":"0x717409c757ecba6297a58116fbabc7f25fd10eee581b6b7768bd9ebc588b9711","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
