{"id":"2407.19227","title":"Non-Homogeneous Generalized Fractional Skellam Process","authors":"Kartik Tathe and Sayan Ghosh","authorsParsed":[["Tathe","Kartik",""],["Ghosh","Sayan",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 10:21:42 GMT"}],"updateDate":"2024-07-30","timestamp":1722075702000,"abstract":"  This paper introduces the Non-homogeneous Generalized Skellam process (NGSP)\nand its fractional version NGFSP by time changing it with an independent\ninverse stable subordinator. We study distributional properties for NGSP and\nNGFSP including probability generating function, probability mass function\n(p.m.f.), factorial moments, mean, variance, covariance and correlation\nstructure. Then we investigate the long and short range dependence structures\nfor NGSP and NGFSP, and obtain the governing state differential equations of\nthese processes along with their increment processes. We obtain recurrence\nrelations satisfied by the state probabilities of Non-homogeneous Generalized\nCounting process (NGCP), NGSP and NGFSP. The weighted sum representations for\nthese processes are provided. We further obtain martingale characterization and\narrival time distribution for NGSP and NGFSP. An alternative version of NGFSP\nwith a closed-form p.m.f. is introduced along with a discussion of its\ndistributional and asymptotic properties. In addition, we study the running\naverage processes of GCP and GSP which are of independent interest. The p.m.f.\nof NGSP and the simulated sample paths of GFSP, NGFSP and related processes are\nplotted. Finally, we discuss an application to a high-frequency financial data\nset pointing out the advantages of our model compared to existing ones.\n","subjects":["Mathematics/Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"V-b-raBgTjw-HPo7eEsGtvLm_A5gomDjeoyeor_LiTc","pdfSize":"451519","objectId":"0xe31e88eb47cc5da54d6f70695a3efae19f10c72dc9e5fa26e1934014076bde5f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
