{"id":"2407.18156","title":"Dipolar ordering transitions in many-body quantum optics: Analytical\n  diagrammatic approach to equilibrium quantum spins","authors":"Benedikt Schneider, Ruben Burkard, Beatriz Olmos, Igor Lesanovsky,\n  Bj\\\"orn Sbierski","authorsParsed":[["Schneider","Benedikt",""],["Burkard","Ruben",""],["Olmos","Beatriz",""],["Lesanovsky","Igor",""],["Sbierski","Björn",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 16:08:20 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 12:59:49 GMT"}],"updateDate":"2024-08-19","timestamp":1721923700000,"abstract":"  Quantum spin models with a large number of interaction partners per spin are\nfrequently used to describe modern many-body quantum optical systems like\narrays of Rydberg atoms, atom-cavity systems or trapped ion crystals. For\ntheoretical analysis the mean-field (MF) ansatz is routinely applied. However,\nbesides special cases of all-to-all or strong long range interactions, the MF\nansatz provides only approximate results. Here we present a systematic\ncorrection to MF theory based on diagrammatic perturbation theory for quantum\nspin correlators in thermal equilibrium. Our analytic results are universally\napplicable for any lattice geometry and spin-length S. We provide pre-computed\nand easy-to-use building blocks for Ising, Heisenberg and transverse field\nIsing models in the symmetry-unbroken regime. We showcase the quality and\nsimplicity of the method by computing magnetic phase boundaries and excitations\ngaps. We also treat the Dicke-Ising model of ground-state superradiance where\nwe show that corrections to the MF phase boundary vanish.\n","subjects":["Condensed Matter/Quantum Gases","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"fPsPaLocJV2hboTZJzhSidqJiiDOdVlRLQ860Ujsw9I","pdfSize":"817933","objectId":"0xe8d4057372879447a0a4b531cf21f319b9468fcaf150ebe971ba076e439aefb7","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
