{"id":"2407.04566","title":"Suitability of Common Ingestible Antennas for Multiplexed\n  Gastrointestinal Biosensing","authors":"Erdem Cil, Icaro V. Soares, Domitille Schanne, Ronan Sauleau, Denys\n  Nikolayev","authorsParsed":[["Cil","Erdem",""],["Soares","Icaro V.",""],["Schanne","Domitille",""],["Sauleau","Ronan",""],["Nikolayev","Denys",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 14:59:05 GMT"}],"updateDate":"2024-07-08","timestamp":1720191545000,"abstract":"  Ingestible sensor devices, which are increasingly used for internal health\nmonitoring, rely on antennas to perform sensing functions and simultaneously to\ncommunicate with external devices. Despite the development of various\ningestible antennas, there has been no comprehensive comparison of their\nperformance as biosensors. This paper addresses this gap by examining and\ncomparing the suitability of three common types of ingestible antennas --\ndipole, patch, and loop -- as biosensors for distinguishing gastrointestinal\ntissues (stomach, small intestine, and large intestine) based on their\nelectromagnetic properties. The antennas studied in this work conform to the\ninner surface of biocompatible polylactic acid capsules with varying shell\nthicknesses and operate in the 433 MHz Industrial, Scientific, and Medical\nband. The comparison is performed in gastrointestinal tissues using several\nantenna parameters: 1) Sensing Capability: Changes in the phase of the\nreflection coefficient in the tissues are selected as the sensing parameter. 2)\nRobustness: The frequency interval (f_i) in which the antennas are matched\n(|S11| < -10 dB) in all the tissues and the maximum change in the center\nfrequency (f_c) in different tissues are examined. 3) Radiation Performance:\nThe gain and radiation efficiency of the antennas are examined. The effect of\nshell thickness on gain and radiation efficiency at 434 MHz is presented.\nAdditionally, the radiation efficiency at various frequencies allocated for\nmedical communications is compared with the theoretical maximum achievable\nefficiencies. These comprehensive data provide valuable information for making\nengineering decisions when designing multiplexed biosensor antennas for\ningestible applications.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"t4iO_AkrQRI-A1Gc8uUBN1B9-PIHKe69KwmXpg0U5y0","pdfSize":"2611223"}
