{"id":"2407.13840","title":"Semi-Supervised Contrastive Learning of Musical Representations","authors":"Julien Guinot, Elio Quinton, Gy\\\"orgy Fazekas","authorsParsed":[["Guinot","Julien",""],["Quinton","Elio",""],["Fazekas","György",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 18:21:40 GMT"}],"updateDate":"2024-07-22","timestamp":1721326900000,"abstract":"  Despite the success of contrastive learning in Music Information Retrieval,\nthe inherent ambiguity of contrastive self-supervision presents a challenge.\nRelying solely on augmentation chains and self-supervised positive sampling\nstrategies can lead to a pretraining objective that does not capture key\nmusical information for downstream tasks. We introduce semi-supervised\ncontrastive learning (SemiSupCon), a simple method for leveraging musically\ninformed labeled data (supervision signals) in the contrastive learning of\nmusical representations. Our approach introduces musically relevant supervision\nsignals into self-supervised contrastive learning by combining supervised and\nself-supervised contrastive objectives in a simpler framework than previous\napproaches. This framework improves downstream performance and robustness to\naudio corruptions on a range of downstream MIR tasks with moderate amounts of\nlabeled data. Our approach enables shaping the learned similarity metric\nthrough the choice of labeled data that (1) infuses the representations with\nmusical domain knowledge and (2) improves out-of-domain performance with\nminimal general downstream performance loss. We show strong transfer learning\nperformance on musically related yet not trivially similar tasks - such as\npitch and key estimation. Additionally, our approach shows performance\nimprovement on automatic tagging over self-supervised approaches with only 5\\%\nof available labels included in pretraining.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MAriFvjudIVMlz0B8v5BBQEkaKYD11p0eWKyE8odHfw","pdfSize":"4842190","objectId":"0xc936bf802f6a7e4183598ba7dafedb2f02c30b2c4c252bcdd4013c9ad7951246","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
