{"id":"2407.03445","title":"Submillimeter and Mid-Infrared Variability of Young Stellar Objects in\n  the M17SWex Intermediate-Mass Star-Forming Region","authors":"Geumsook Park, Doug Johnstone, Carlos Contreras Pena, Jeong-Eun Lee,\n  Sheng-Yuan Liu, Gregory Herczeg, Steve Mairs, Zhiwei Chen, Jennifer Hatchell,\n  Kee-Tae Kim, Mi-Ryang Kim, Keping Qiu, Yao-Te Wang, Xu Zhang, The JCMT\n  Transient Team","authorsParsed":[["Park","Geumsook",""],["Johnstone","Doug",""],["Pena","Carlos Contreras",""],["Lee","Jeong-Eun",""],["Liu","Sheng-Yuan",""],["Herczeg","Gregory",""],["Mairs","Steve",""],["Chen","Zhiwei",""],["Hatchell","Jennifer",""],["Kim","Kee-Tae",""],["Kim","Mi-Ryang",""],["Qiu","Keping",""],["Wang","Yao-Te",""],["Zhang","Xu",""],["Team","The JCMT Transient",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:44:18 GMT"}],"updateDate":"2024-07-08","timestamp":1720032258000,"abstract":"  We present a comprehensive analysis of young stellar object (YSO) variability\nwithin the M17 Southwest Extension (M17 SWex), using 3.5 years of monitoring\ndata from the JCMT Transient Survey at sub-millimeter (sub-mm) and 9 years from\nthe NEOWISE mission at mid-infrared (mid-IR). Our study encompasses\nobservations of 147 bright sub-mm peaks identified within our deep JCMT\nco-added map as well as 156 YSOs in NEOWISE W1 and 179 in W2 that were\npreviously identified in Spitzer surveys. We find three robust sub-mm\nvariables: two are candidate YSOs and one is a likely extragalactic source. At\nmid-IR wavelengths, our analysis reveals secular and stochastic variability in\n47 YSOs, with the highest fraction of secular variability occurring at the\nearliest evolutionary stage. This is similar to what has previously been\nobserved for low-mass YSO variability within the Gould Belt. However, we\nobserve less overall variability in M17SWex at both the sub-mm and mid-IR. We\nsuspect that this lower fraction is due to the greater distance to M17 SWex.\nOur findings showcase the utility of multi-wavelength observations to better\ncapture the complex variability phenomena inherent to star formation processes\nand demonstrate the importance of years-long monitoring of a diverse selection\nof star-forming environments.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xjf11jf03gqPyeLR-K-lGGhJnz_UoU58TVIpSLXmHUw","pdfSize":"12688710"}
