{"id":"2407.00124","title":"Stable Machine-Learning Parameterization of Subgrid Processes with Real\n  Geography and Full-physics Emulation","authors":"Zeyuan Hu, Akshay Subramaniam, Zhiming Kuang, Jerry Lin, Sungduk Yu,\n  Walter M. Hannah, Noah D. Brenowitz, Josh Romero, Michael S. Pritchard","authorsParsed":[["Hu","Zeyuan",""],["Subramaniam","Akshay",""],["Kuang","Zhiming",""],["Lin","Jerry",""],["Yu","Sungduk",""],["Hannah","Walter M.",""],["Brenowitz","Noah D.",""],["Romero","Josh",""],["Pritchard","Michael S.",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 00:01:02 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 19:04:48 GMT"},{"version":"v3","created":"Mon, 5 Aug 2024 18:35:49 GMT"}],"updateDate":"2024-08-08","timestamp":1719532862000,"abstract":"  Modern climate projections often suffer from inadequate spatial and temporal\nresolution due to computational limitations, resulting in inaccurate\nrepresentations of sub-grid processes. A promising technique to address this is\nthe Multiscale Modeling Framework (MMF), which embeds a kilometer-resolution\ncloud-resolving model within each atmospheric column of a host climate model to\nreplace traditional convection and cloud parameterizations. Machine learning\n(ML) offers a unique opportunity to make MMF more accessible by emulating the\nembedded cloud-resolving model and reducing its substantial computational cost.\nAlthough many studies have demonstrated proof-of-concept success of achieving\nstable hybrid simulations, it remains a challenge to achieve near\noperational-level success with real geography and comprehensive variable\nemulation that includes, for example, explicit cloud condensate coupling. In\nthis study, we present a stable hybrid model capable of integrating for at\nleast 5 years with near operational-level complexity, including real geography,\nseasonality, explicit cloud condensate predictions, and land coupling. Our\nmodel demonstrates skillful online performance in metrics such as 5-year zonal\nmean biases compared to previous MMF emulation studies. The monthly error\nagainst reference MMF simulations with the same initial condition approaches\nthe fundamental predictability limit. Key factors contributing to our online\nperformance include an expressive U-Net architecture, additional input features\nthat include large-scale forcings and convection memory, and physical\nthermodynamic constraints for microphysics. With microphysical constraints\nmitigating unrealistic cloud formation, our work is the first to demonstrate\nrealistic multi-year cloud condensate climatology under the MMF framework. Our\nwork showcases ML parameterization's potential for operational-level climate\nsimulations.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6NCNWnU9C4qHn4Df8i1bGfeU-ZMHyFyhB8d2XmAlJHk","pdfSize":"3608615","objectId":"0xcaee458e031347607b0805d8af47272f4ad8c6620e5fcb0919b67de1dea6e585","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
