{"id":"2407.11195","title":"Optimizing Nurse Scheduling: A Supply Chain Approach for Healthcare\n  Institutions","authors":"Jubin Thomas","authorsParsed":[["Thomas","Jubin",""]],"versions":[{"version":"v1","created":"Wed, 29 May 2024 15:37:51 GMT"}],"updateDate":"2024-07-17","timestamp":1716997071000,"abstract":"  When managing an organization, planners often encounter numerous challenging\nscenarios. In such instances, relying solely on intuition or managerial\nexperience may not suffice, necessitating a quantitative approach. This demand\nis further accentuated in the era of big data, where the sheer scale and\ncomplexity of constraints pose significant challenges. Therefore, the aim of\nthis study is to provide a foundational framework for addressing personnel\nscheduling, a critical issue in organizational management. Specifically, we\nfocus on optimizing shift assignments for staff, a task fraught with\ncomplexities due to factors such as contractual obligations and mandated rest\nperiods. Moreover, the current landscape is characterized by frequent employee\nshortages across various industries, with many organizations lacking efficient\nand dependable management tools to address them. Therefore, our attention is\nparticularly drawn to the nurse rostering problem, a personnel scheduling\nchallenge prevalent in healthcare settings. These issues are characterized by a\nmultitude of variables, given that a single healthcare facility may employ\nhundreds of nurses, alongside stringent constraints such as the need for\nadequate staffing levels and rest periods postnight shifts. Furthermore, the\nongoing COVID19 pandemic has exacerbated staffing challenges in healthcare\ninstitutions, underlining the importance of accurately assessing staffing needs\nand optimizing shift allocations for effective operation amidst crisis\nsituations.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"P0AfUb2t_amyOmI33UjvBXkZdGQRKJK0p4ABq5o932g","pdfSize":"439588","objectId":"0x7008e2fbf73ef9d00b1ac29d5c951113404a7125cf63351b7a355972ac35b9b6","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
