{"id":"2407.13166","title":"Using LLMs to Investigate Correlations of Conversational Follow-up\n  Queries with User Satisfaction","authors":"Hyunwoo Kim, Yoonseo Choi, Taehyun Yang, Honggu Lee, Chaneon Park,\n  Yongju Lee, Jin Young Kim, Juho Kim","authorsParsed":[["Kim","Hyunwoo",""],["Choi","Yoonseo",""],["Yang","Taehyun",""],["Lee","Honggu",""],["Park","Chaneon",""],["Lee","Yongju",""],["Kim","Jin Young",""],["Kim","Juho",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 05:10:35 GMT"}],"updateDate":"2024-07-19","timestamp":1721279435000,"abstract":"  With large language models (LLMs), conversational search engines shift how\nusers retrieve information from the web by enabling natural conversations to\nexpress their search intents over multiple turns. Users' natural conversation\nembodies rich but implicit signals of users' search intents and evaluation of\nsearch results to understand user experience with the system. However, it is\nunderexplored how and why users ask follow-up queries to continue conversations\nwith conversational search engines and how the follow-up queries signal users'\nsatisfaction. From qualitative analysis of 250 conversational turns from an\nin-lab user evaluation of Naver Cue:, a commercial conversational search\nengine, we propose a taxonomy of 18 users' follow-up query patterns from\nconversational search, comprising two major axes: (1) users' motivations behind\ncontinuing conversations (N = 7) and (2) actions of follow-up queries (N = 11).\nCompared to the existing literature on query reformulations, we uncovered a new\nset of motivations and actions behind follow-up queries, including asking for\nsubjective opinions or providing natural language feedback on the engine's\nresponses. To analyze conversational search logs with our taxonomy in a\nscalable and efficient manner, we built an LLM-powered classifier (73%\naccuracy). With our classifier, we analyzed 2,061 conversational tuples\ncollected from real-world usage logs of Cue: and examined how the conversation\npatterns from our taxonomy correlates with satisfaction. Our initial findings\nsuggest some signals of dissatisfactions, such as Clarifying Queries, Excluding\nCondition, and Substituting Condition with follow-up queries. We envision our\napproach could contribute to automated evaluation of conversation search\nexperience by providing satisfaction signals and grounds for realistic user\nsimulations.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-AqlBgPyHGp8RnIW2egBosaX-OlqVHEp6Y552J-cIdM","pdfSize":"5154246","objectId":"0xacb7c9cb911d3d5d4a84aba9e357040b293257a2be85ed0e1dfa0507815f7dcd","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
