{"id":"2407.04127","title":"Biometric Authentication Based on Enhanced Remote Photoplethysmography\n  Signal Morphology","authors":"Zhaodong Sun, Xiaobai Li, Jukka Komulainen, Guoying Zhao","authorsParsed":[["Sun","Zhaodong",""],["Li","Xiaobai",""],["Komulainen","Jukka",""],["Zhao","Guoying",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 19:00:34 GMT"}],"updateDate":"2024-07-08","timestamp":1720119634000,"abstract":"  Remote photoplethysmography (rPPG) is a non-contact method for measuring\ncardiac signals from facial videos, offering a convenient alternative to\ncontact photoplethysmography (cPPG) obtained from contact sensors. Recent\nstudies have shown that each individual possesses a unique cPPG signal\nmorphology that can be utilized as a biometric identifier, which has inspired\nus to utilize the morphology of rPPG signals extracted from facial videos for\nperson authentication. Since the facial appearance and rPPG are mixed in the\nfacial videos, we first de-identify facial videos to remove facial appearance\nwhile preserving the rPPG information, which protects facial privacy and\nguarantees that only rPPG is used for authentication. The de-identified videos\nare fed into an rPPG model to get the rPPG signal morphology for\nauthentication. In the first training stage, unsupervised rPPG training is\nperformed to get coarse rPPG signals. In the second training stage, an\nrPPG-cPPG hybrid training is performed by incorporating external cPPG datasets\nto achieve rPPG biometric authentication and enhance rPPG signal morphology.\nOur approach needs only de-identified facial videos with subject IDs to train\nrPPG authentication models. The experimental results demonstrate that rPPG\nsignal morphology hidden in facial videos can be used for biometric\nauthentication. The code is available at\nhttps://github.com/zhaodongsun/rppg_biometrics.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Image and Video Processing","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_yauGVueJej6sWpE56vHsmTg_GLu2iHcpyDzla6WIQo","pdfSize":"3231980"}
