{"id":"2407.16424","title":"ESOD: Efficient Small Object Detection on High-Resolution Images","authors":"Kai Liu, Zhihang Fu, Sheng Jin, Ze Chen, Fan Zhou, Rongxin Jiang,\n  Yaowu Chen, Jieping Ye","authorsParsed":[["Liu","Kai",""],["Fu","Zhihang",""],["Jin","Sheng",""],["Chen","Ze",""],["Zhou","Fan",""],["Jiang","Rongxin",""],["Chen","Yaowu",""],["Ye","Jieping",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 12:21:23 GMT"}],"updateDate":"2024-07-24","timestamp":1721737283000,"abstract":"  Enlarging input images is a straightforward and effective approach to promote\nsmall object detection. However, simple image enlargement is significantly\nexpensive on both computations and GPU memory. In fact, small objects are\nusually sparsely distributed and locally clustered. Therefore, massive feature\nextraction computations are wasted on the non-target background area of images.\nRecent works have tried to pick out target-containing regions using an extra\nnetwork and perform conventional object detection, but the newly introduced\ncomputation limits their final performance. In this paper, we propose to reuse\nthe detector's backbone to conduct feature-level object-seeking and\npatch-slicing, which can avoid redundant feature extraction and reduce the\ncomputation cost. Incorporating a sparse detection head, we are able to detect\nsmall objects on high-resolution inputs (e.g., 1080P or larger) for superior\nperformance. The resulting Efficient Small Object Detection (ESOD) approach is\na generic framework, which can be applied to both CNN- and ViT-based detectors\nto save the computation and GPU memory costs. Extensive experiments demonstrate\nthe efficacy and efficiency of our method. In particular, our method\nconsistently surpasses the SOTA detectors by a large margin (e.g., 8% gains on\nAP) on the representative VisDrone, UAVDT, and TinyPerson datasets. Code will\nbe made public soon.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SIHpUDZHP04B1b-92gg3rPCkfAmC74VGtisB77w_co4","pdfSize":"3785951","objectId":"0xefec0e6761ee408037883254ff9a652c2564488105d35816d2350fd631f06229","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
