{"id":"2407.13032","title":"Agent-E: From Autonomous Web Navigation to Foundational Design\n  Principles in Agentic Systems","authors":"Tamer Abuelsaad and Deepak Akkil and Prasenjit Dey and Ashish Jagmohan\n  and Aditya Vempaty and Ravi Kokku","authorsParsed":[["Abuelsaad","Tamer",""],["Akkil","Deepak",""],["Dey","Prasenjit",""],["Jagmohan","Ashish",""],["Vempaty","Aditya",""],["Kokku","Ravi",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 21:44:28 GMT"}],"updateDate":"2024-07-19","timestamp":1721252668000,"abstract":"  AI Agents are changing the way work gets done, both in consumer and\nenterprise domains. However, the design patterns and architectures to build\nhighly capable agents or multi-agent systems are still developing, and the\nunderstanding of the implication of various design choices and algorithms is\nstill evolving. In this paper, we present our work on building a novel web\nagent, Agent-E \\footnote{Our code is available at\n\\url{https://github.com/EmergenceAI/Agent-E}}. Agent-E introduces numerous\narchitectural improvements over prior state-of-the-art web agents such as\nhierarchical architecture, flexible DOM distillation and denoising method, and\nthe concept of \\textit{change observation} to guide the agent towards more\naccurate performance. We first present the results of an evaluation of Agent-E\non WebVoyager benchmark dataset and show that Agent-E beats other SOTA text and\nmulti-modal web agents on this benchmark in most categories by 10-30\\%. We then\nsynthesize our learnings from the development of Agent-E into general design\nprinciples for developing agentic systems. These include the use of\ndomain-specific primitive skills, the importance of distillation and de-noising\nof environmental observations, the advantages of a hierarchical architecture,\nand the role of agentic self-improvement to enhance agent efficiency and\nefficacy as the agent gathers experience.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wYRHIFKfZkIXZ5N7qWM_JbEfd5-bp8eDFsNJwmQIw4U","pdfSize":"5000572","objectId":"0x5c2757efe9b4791e162cbe3e6624d1089b504ff20db6bb3600fa09f7a9306824","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
