{"id":"2407.11833","title":"LoFTI: Localization and Factuality Transfer to Indian Locales","authors":"Sona Elza Simon (1), Soumen Kumar Mondal (1), Abhishek Singhania (2),\n  Sayambhu Sen (2) and Preethi Jyothi (1) ((1) Indian Institute of Technology\n  Bombay, (2) Amazon Alexa)","authorsParsed":[["Simon","Sona Elza",""],["Mondal","Soumen Kumar",""],["Singhania","Abhishek",""],["Sen","Sayambhu",""],["Jyothi","Preethi",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:20:43 GMT"}],"updateDate":"2024-07-17","timestamp":1721143243000,"abstract":"  Large language models (LLMs) encode vast amounts of world knowledge acquired\nvia training on large web-scale datasets crawled from the internet. However,\nthese datasets typically exhibit a geographical bias towards English-speaking\nWestern countries. This results in LLMs producing biased or hallucinated\nresponses to queries that require answers localized to other geographical\nregions. In this work, we introduce a new benchmark named LoFTI (Localization\nand Factuality Transfer to Indian Locales) that can be used to evaluate an\nLLM's localization and factual text transfer capabilities. LoFTI consists of\nfactual statements about entities in source and target locations; the source\nlocations are spread across the globe and the target locations are all within\nIndia with varying degrees of hyperlocality (country, states, cities). The\nentities span a wide variety of categories. We use LoFTI to evaluate Mixtral,\nGPT-4 and two other Mixtral-based approaches well-suited to the task of\nlocalized factual transfer. We demonstrate that LoFTI is a high-quality\nevaluation benchmark and all the models, including GPT-4, produce skewed\nresults across varying levels of hyperlocality.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"tXWyVI5XP1Fs-vV_tdr3twoTY4jgGEuxR3XAK_CN5aw","pdfSize":"1342904","objectId":"0x6103b32ae418ff69c18a9d38b20c071524ebd0829f91469fb38b9cb5ae58b4f8","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
