{"id":"2407.12062","title":"Enhancing Multistep Brent Oil Price Forecasting with a Multi-Aspect\n  Metaheuristic Optimization Approach and Ensemble Deep Learning Models","authors":"Mohammed Alruqimi and Luca Di Persio","authorsParsed":[["Alruqimi","Mohammed",""],["Di Persio","Luca",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 22:27:14 GMT"}],"updateDate":"2024-07-18","timestamp":1721082434000,"abstract":"  Accurate crude oil price forecasting is crucial for various economic\nactivities, including energy trading, risk management, and investment planning.\nAlthough deep learning models have emerged as powerful tools for crude oil\nprice forecasting, achieving accurate forecasts remains challenging. Deep\nlearning models' performance is heavily influenced by hyperparameters tuning,\nand they are expected to perform differently under various circumstances.\nFurthermore, price volatility is also sensitive to external factors such as\nworld events. To address these limitations, we propose a hybrid approach\ncombining metaheuristic optimisation and an ensemble of five popular neural\nnetwork architectures used in time series forecasting. Unlike existing methods\nthat apply metaheuristics to optimise hyperparameters within the neural network\narchitecture, we exploit the GWO metaheuristic optimiser at four levels:\nfeature selection, data preparation, model training, and forecast blending. The\nproposed approach has been evaluated for forecasting three-ahead days using\nreal-world Brent crude oil price data, and the obtained results demonstrate\nthat the proposed approach improves the forecasting performance measured using\nvarious benchmarks, achieving 0.000127 of MSE.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yh0l__OqrJz2oSptzsYUGk9yVr3pSjFDAYi6g95NF0U","pdfSize":"846690","objectId":"0x606cc3525a7e0f8b9a4ab8ff5612876455bddd041740aa3c6462f03345763547","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
