{"id":"2407.05133","title":"Control Density Function for Robust Safety and Convergence","authors":"Joseph Moyalan, Sriram S. K. S Narayanan, and Umesh Vaidya","authorsParsed":[["Moyalan","Joseph",""],["Narayanan","Sriram S. K. S",""],["Vaidya","Umesh",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 16:59:06 GMT"}],"updateDate":"2024-07-09","timestamp":1720285146000,"abstract":"  We introduce a novel approach for safe control design based on the density\nfunction. A control density function (CDF) is introduced to synthesize a safe\ncontroller for a nonlinear dynamic system. The CDF can be viewed as a dual to\nthe control barrier function (CBF), a popular approach used for safe control\ndesign. While the safety certificate using the barrier function is based on the\nnotion of invariance, the dual certificate involving the density function has a\nphysical interpretation of occupancy. This occupancy-based physical\ninterpretation is instrumental in providing an analytical construction of\ndensity function used for safe control synthesis. The safe control design\nproblem is formulated using the density function as a quadratic programming\n(QP) problem. In contrast to the QP proposed for control synthesis using CBF,\nthe proposed CDF-based QP can combine both the safety and convergence\nconditions to target state into single constraints. Further, we consider\nrobustness against uncertainty in system dynamics and the initial condition and\nprovide theoretical results for robust navigation using the CDF. Finally, we\npresent simulation results for safe navigation with single integrator and\ndouble-gyre fluid flow-field examples, followed by robust navigation using the\nbicycle model and autonomous lane-keeping examples.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"W-htMy2f3rpuuplbknEp2AJllY1hCKMkIEvC12RFlXw","pdfSize":"1485720"}
