{"id":"2407.16939","title":"Early screening of potential breakthrough technologies with enhanced\n  interpretability: A patent-specific hierarchical attention network model","authors":"Jaewoong Choi, Janghyeok Yoon, Changyong Lee","authorsParsed":[["Choi","Jaewoong",""],["Yoon","Janghyeok",""],["Lee","Changyong",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 02:17:10 GMT"}],"updateDate":"2024-07-25","timestamp":1721787430000,"abstract":"  Despite the usefulness of machine learning approaches for the early screening\nof potential breakthrough technologies, their practicality is often hindered by\nopaque models. To address this, we propose an interpretable machine learning\napproach to predicting future citation counts from patent texts using a\npatent-specific hierarchical attention network (PatentHAN) model. Central to\nthis approach are (1) a patent-specific pre-trained language model, capturing\nthe meanings of technical words in patent claims, (2) a hierarchical network\nstructure, enabling detailed analysis at the claim level, and (3) a claim-wise\nself-attention mechanism, revealing pivotal claims during the screening\nprocess. A case study of 35,376 pharmaceutical patents demonstrates the\neffectiveness of our approach in early screening of potential breakthrough\ntechnologies while ensuring interpretability. Furthermore, we conduct\nadditional analyses using different language models and claim types to examine\nthe robustness of the approach. It is expected that the proposed approach will\nenhance expert-machine collaboration in identifying breakthrough technologies,\nproviding new insight derived from text mining into technological value.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4nrISgPWcMdKhfuWcx9NlVakCdCdSKb0vGp4Yjm67ng","pdfSize":"587952","objectId":"0xf05162b90f954fa7d8753f203ab835ef63db703005093aefed38730b72d624a2","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
