{"id":"2407.04957","title":"Mechanism of magnetic phase transition in correlated magnetic metal:\n  insight into itinerant ferromagnet Fe$_{3-\\delta}$GeTe$_2$","authors":"Yuanji Xu, Yuechao Wang, Xintao Jin, Haifeng Liu, Yu Liu, Haifeng\n  Song, Fuyang Tian","authorsParsed":[["Xu","Yuanji",""],["Wang","Yuechao",""],["Jin","Xintao",""],["Liu","Haifeng",""],["Liu","Yu",""],["Song","Haifeng",""],["Tian","Fuyang",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 04:45:22 GMT"}],"updateDate":"2024-07-09","timestamp":1720241122000,"abstract":"  Developing a comprehensive magnetic theory of correlated itinerant magnets is\na challenging task due to the difficulty in reconciling both local moments and\nitinerant electrons. In this work, we investigate the microscopic process of\nmagnetic phase transition in ferromagnet metal Fe$_{3-\\delta}$GeTe$_2$. A new\nparadigm is proposed to describe the magnetic phase transition in correlated\nmetallic ferromagnets, where Hund's coupling dominates the spectral weight\ntransfer between different spin channels, rather than spin-splitting as\ndescribed by the Stoner model. We recognize that our theory should be universal\nfor itinerant magnets. Additionally, we reveal an efficient way to achieve\nnovel quantum states from various competing orders in multi-site crystal\nstructures. Our research shows that Fe1 are proximate to Mott physics, while\nFe2 exhibit Hund physics due to their distinct atomic environments. These\ncompeting orders work together to produce heavy fermion behavior within\nferromagnetic long-range order through well-defined quasiparticle bands, which\nare promoted by Hund's coupling and further hybridized with relative itinerant\nbands. The complex interactions of competing orders drive correlated magnetic\nmetal to a new frontier for discovering outstanding quantum states and exotic\nphenomena in condensed matter physics.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3LWlM5BQ1i3mvF5uoSZ_imDr7nGMPr--YkmbTl-RsDc","pdfSize":"5225931"}
