{"id":"2407.07065","title":"Distribution System Reconfiguration to Mitigate Load Altering Attacks\n  via Stackelberg Games","authors":"Sajjad Maleki, Subhash Lakshminarayana, Charalambos Konstantinou, E.\n  Veronica Belmaga","authorsParsed":[["Maleki","Sajjad",""],["Lakshminarayana","Subhash",""],["Konstantinou","Charalambos",""],["Belmaga","E. Veronica",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 17:41:01 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 11:46:08 GMT"},{"version":"v3","created":"Thu, 8 Aug 2024 09:07:18 GMT"}],"updateDate":"2024-08-09","timestamp":1720546861000,"abstract":"  The integration of IoT-controllable devices in power systems (such as smart\nelectric vehicle charging stations, heat pumps, etc.), despite their apparent\nbenefits, raises novel cybersecurity concerns. These vulnerabilities in these\ndevices can be leveraged to launch load-altering attacks (LAAs) that can\npotentially compromise power system safety. In this paper, we analyze the\nimpact of LAAs on the voltage profile of distribution systems. We derive\nclosed-form expressions to quantify the attack impact. Using the insights\nderived from this analysis, we propose a method to mitigate LAAs based on\nreconfiguring the distribution system as a reactive defense approach. We study\noptimal defense strategies using a non-cooperative sequential game theory\napproach that is robust to LAAs. The proposed solution takes the potential\nerrors in the attack localization into account. Our results show that attacks\nlaunched on the deepest nodes in the distribution network result in the highest\ndetrimental impact on the grid voltage profile. Furthermore, the proposed\ngame-theoretic strategy successfully mitigates the effect of the attack while\nensuring minimum system reconfiguration.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"AZ9sPNX_pEs8zM5eSEIEyJUTWicrQX3jJ_lT3hgEJbo","pdfSize":"481676"}
