{"id":"2407.21698","title":"Long-Term Energy Management for Microgrid with Hybrid Hydrogen-Battery\n  Energy Storage: A Prediction-Free Coordinated Optimization Framework","authors":"Ning Qi, Kaidi Huang, Zhiyuan Fan and Bolun Xu","authorsParsed":[["Qi","Ning",""],["Huang","Kaidi",""],["Fan","Zhiyuan",""],["Xu","Bolun",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:44:07 GMT"}],"updateDate":"2024-08-01","timestamp":1722440647000,"abstract":"  This paper studies the long-term energy management of a microgrid\ncoordinating hybrid hydrogen-battery energy storage. We develop an approximate\nsemi-empirical hydrogen storage model to accurately capture the power-dependent\nefficiency of hydrogen storage. We introduce a prediction-free two-stage\ncoordinated optimization framework, which generates the annual state-of-charge\n(SoC) reference for hydrogen storage offline. During online operation, it\nupdates the SoC reference online using kernel regression and makes operation\ndecisions based on the proposed adaptive virtual-queue-based online convex\noptimization (OCO) algorithm. We innovatively incorporate penalty terms for\nlong-term pattern tracking and expert-tracking for step size updates. We\nprovide theoretical proof to show that the proposed OCO algorithm achieves a\nsublinear bound of dynamic regret without using prediction information.\nNumerical studies based on the Elia and North China datasets show that the\nproposed framework significantly outperforms the existing online optimization\napproaches by reducing the operational costs and loss of load by around 30% and\n80%, respectively. These benefits can be further enhanced with optimized\nsettings for the penalty coefficient and step size of OCO, as well as more\nhistorical references.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RLwebLag5CqqQFOD3er3gTgCroqQKwVr_3qxPiqL_-A","pdfSize":"2646529","objectId":"0xb5a9deda98cc9846b62de1379bc5cece7dcc769947c77be09cc4dbf3ccddf58d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
