{"id":"2407.03518","title":"Improving LLM Abilities in Idiomatic Translation","authors":"Sundesh Donthi, Maximilian Spencer, Om Patel, Joon Doh, Eid Rodan","authorsParsed":[["Donthi","Sundesh",""],["Spencer","Maximilian",""],["Patel","Om",""],["Doh","Joon",""],["Rodan","Eid",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 21:34:26 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 07:17:34 GMT"}],"updateDate":"2024-07-17","timestamp":1720042466000,"abstract":"  For large language models (LLMs) like NLLB and GPT, translating idioms\nremains a challenge. Our goal is to enhance translation fidelity by improving\nLLM processing of idiomatic language while preserving the original linguistic\nstyle. This has a significant social impact, as it preserves cultural nuances\nand ensures translated texts retain their intent and emotional resonance,\nfostering better cross-cultural communication. Previous work has utilized\nknowledge bases like IdiomKB by providing the LLM with the meaning of an idiom\nto use in translation. Although this method yielded better results than a\ndirect translation, it is still limited in its ability to preserve idiomatic\nwriting style across languages. In this research, we expand upon the knowledge\nbase to find corresponding idioms in the target language. Our research performs\ntranslations using two methods: The first method employs the\nSentenceTransformers model to semantically generate cosine similarity scores\nbetween the meanings of the original and target language idioms, selecting the\nbest idiom (Cosine Similarity method). The second method uses an LLM to find a\ncorresponding idiom in the target language for use in the translation\n(LLM-generated idiom method). As a baseline, we performed a direct translation\nwithout providing additional information. Human evaluations on the English ->\nChinese, and Chinese -> English show the Cosine Similarity Lookup method\nout-performed others in all GPT4o translations. To further build upon IdiomKB,\nwe developed a low-resource Urdu dataset containing Urdu idioms and their\ntranslations. Despite dataset limitations, the Cosine Similarity Lookup method\nshows promise, potentially overcoming language barriers and enabling the\nexploration of diverse literary works in Chinese and Urdu.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"4PGq588YJa-gvAOBOcmRBKn4FxeDQmLVroXdj9PB9U8","pdfSize":"294894"}
