{"id":"2407.18722","title":"Neurosymbolic AI for Enhancing Instructability in Generative AI","authors":"Amit Sheth, Vishal Pallagani, Kaushik Roy","authorsParsed":[["Sheth","Amit",""],["Pallagani","Vishal",""],["Roy","Kaushik",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 13:15:50 GMT"}],"updateDate":"2024-07-29","timestamp":1721999750000,"abstract":"  Generative AI, especially via Large Language Models (LLMs), has transformed\ncontent creation across text, images, and music, showcasing capabilities in\nfollowing instructions through prompting, largely facilitated by instruction\ntuning. Instruction tuning is a supervised fine-tuning method where LLMs are\ntrained on datasets formatted with specific tasks and corresponding\ninstructions. This method systematically enhances the model's ability to\ncomprehend and execute the provided directives. Despite these advancements,\nLLMs still face challenges in consistently interpreting complex, multi-step\ninstructions and generalizing them to novel tasks, which are essential for\nbroader applicability in real-world scenarios. This article explores why\nneurosymbolic AI offers a better path to enhance the instructability of LLMs.\nWe explore the use a symbolic task planner to decompose high-level instructions\ninto structured tasks, a neural semantic parser to ground these tasks into\nexecutable actions, and a neuro-symbolic executor to implement these actions\nwhile dynamically maintaining an explicit representation of state. We also seek\nto show that neurosymbolic approach enhances the reliability and\ncontext-awareness of task execution, enabling LLMs to dynamically interpret and\nrespond to a wider range of instructional contexts with greater precision and\nflexibility.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FeHU_ntsEErEnCoTAcCRJvK8b-Y7ePKeLIJHfOx9PMA","pdfSize":"1299367","objectId":"0x9fa517c69ee1634221edaed93246116bfd9870c18b909b4d78c4ff9cb60cc17a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
