{"id":"2407.05113","title":"Emergent Mesoscale Correlations in Active Solids with Noisy Chiral\n  Dynamics","authors":"Amir Shee, Silke Henkes, Cristi\\'an Huepe","authorsParsed":[["Shee","Amir",""],["Henkes","Silke",""],["Huepe","Cristián",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 15:44:44 GMT"}],"updateDate":"2024-07-09","timestamp":1720280684000,"abstract":"  We present the linear response theory for an elastic solid composed of active\nBrownian particles with intrinsic individual chirality, deriving both a normal\nmode formulation and a continuum elastic formulation. Using this theory, we\ncompute analytically the velocity correlations and energy spectra under\ndifferent conditions, showing an excellent agreement with simulations. We\ngenerate the corresponding phase diagram, identifying chiral and achiral\ndisordered regimes (for high chirality or noise levels), as well as chiral and\nachiral states with mesoscopic-range order (for low chirality and noise). The\nchiral ordered states display mesoscopic spatial correlations and oscillating\ntime correlations, but no wave propagation. In the high chirality regime, we\nfind a peak in the elastic energy spectrum that leads to a non-monotonic\nbehavior with increasing noise strength that is consistent with the emergence\nof the `hammering' state recently identified in chiral glasses. Finally, we\nshow numerically that our theory, despite its linear response nature, can be\napplied beyond the idealized homogeneous solid assumed in our derivations.\nIndeed, by increasing the level of activity, we show that it remains a good\napproximation of the system dynamics until just below the melting transition.\nIn addition, we show that there is still an excellent agreement between our\nanalytical results and simulations when we extend our results to heterogeneous\nsolids composed of mixtures of active particles with different intrinsic\nchirality and noise levels. Our work provides a thorough analytical and\nnumerical description of the emergent states in a densely packed system of\nchiral self-propelled Brownian disks, thus allowing a detailed understanding of\nthe phases and dynamics identified in a minimal chiral active systems.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2RkXW5YgOXWj1oFm_J79Nj4pp4S0v12UzXBTRO090oE","pdfSize":"15186283"}
