{"id":"2407.04044","title":"The role of the thermal properties of electrons on the dispersion\n  properties of Alfv\\'en waves in space plasmas","authors":"Nicol\\'as Villarroel-Sep\\'ulveda, Pablo S. Moya, Rodrigo A. L\\'opez\n  and Daniel Verscharen","authorsParsed":[["Villarroel-Sepúlveda","Nicolás",""],["Moya","Pablo S.",""],["López","Rodrigo A.",""],["Verscharen","Daniel",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 16:37:30 GMT"}],"updateDate":"2024-07-08","timestamp":1720111050000,"abstract":"  Context. The transition from left-hand to right-hand polarized Alfv\\'en waves\ndepends on the wavenumber, the ratio of kinetic to magnetic pressure $\\beta$,\ntemperature anisotropy, and ion composition of the plasma. Along with the\ntemperature anisotropy, the electron-to-proton temperature ratio $T_e/T_p$ is\nof great relevance for the characterization of the thermal properties of a\nplasma. This ratio varies significantly between different space plasma\nenvironments. Thus, studying how variations on this ratio affect the\npolarisation properties of electromagnetic waves becomes highly relevant for\nour understanding of the dynamics of space plasmas. Aim. We present an\nextensive study on the effect of the thermal properties of electrons on the\nbehaviour and characteristics of Alfv\\'enic waves in fully kinetic linear\ntheory, as well as on the transition from electromagnetic ion-cyclotron (EMIC)\nto kinetic Alfv\\'en waves (KAW). Method. We solve the fully kinetic dispersion\nrelation for oblique electromagnetic waves of the Alfv\\'en branch in a\nhomogenous Maxwellian electron-proton plasma. We quantify the effect of the\nthermal properties of electrons by varying the electron-to-proton temperature\nratio for different configurations of the propagation angle, $\\beta_p=8\\pi\nnkT_p/B^2$, and wavenumber. Results. We show that the temperature ratio\n$T_e/T_p$ has strong and non-trivial effects on the polarisation of the\nAlfv\\'enic modes, especially at kinetic scales and $\\beta_e+\\beta_p>0.5$. We\nconclude that electron inertia plays an important role in the kinetic scale\nphysics of the KAW in the warm plasma regime, and thus cannot be excluded in\nhybrid models for computer simulations.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qoBeqDKQBlO4afcyepIf_DJfLOF5jy6ewgH4OC-YrAE","pdfSize":"4903479"}
