{"id":"2407.04486","title":"Variational and Explanatory Neural Networks for Encoding Cancer Profiles\n  and Predicting Drug Responses","authors":"Tianshu Feng, Rohan Gnanaolivu, Abolfazl Safikhani, Yuanhang Liu, Jun\n  Jiang, Nicholas Chia, Alexander Partin, Priyanka Vasanthakumari, Yitan Zhu,\n  Chen Wang","authorsParsed":[["Feng","Tianshu",""],["Gnanaolivu","Rohan",""],["Safikhani","Abolfazl",""],["Liu","Yuanhang",""],["Jiang","Jun",""],["Chia","Nicholas",""],["Partin","Alexander",""],["Vasanthakumari","Priyanka",""],["Zhu","Yitan",""],["Wang","Chen",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 13:13:02 GMT"}],"updateDate":"2024-07-08","timestamp":1720185182000,"abstract":"  Human cancers present a significant public health challenge and require the\ndiscovery of novel drugs through translational research. Transcriptomics\nprofiling data that describes molecular activities in tumors and cancer cell\nlines are widely utilized for predicting anti-cancer drug responses. However,\nexisting AI models face challenges due to noise in transcriptomics data and\nlack of biological interpretability. To overcome these limitations, we\nintroduce VETE (Variational and Explanatory Transcriptomics Encoder), a novel\nneural network framework that incorporates a variational component to mitigate\nnoise effects and integrates traceable gene ontology into the neural network\narchitecture for encoding cancer transcriptomics data. Key innovations include\na local interpretability-guided method for identifying ontology paths, a\nvisualization tool to elucidate biological mechanisms of drug responses, and\nthe application of centralized large scale hyperparameter optimization. VETE\ndemonstrated robust accuracy in cancer cell line classification and drug\nresponse prediction. Additionally, it provided traceable biological\nexplanations for both tasks and offers insights into the mechanisms underlying\nits predictions. VETE bridges the gap between AI-driven predictions and\nbiologically meaningful insights in cancer research, which represents a\npromising advancement in the field.\n","subjects":["Quantitative Biology/Quantitative Methods","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NLOPFTn3VcuDFLSj8kvu2Um0lAA1wA0wYZcubgAWlEU","pdfSize":"2121997"}
