{"id":"2407.18352","title":"HPAC-ML: A Programming Model for Embedding ML Surrogates in Scientific\n  Applications","authors":"Zane Fink, Konstantinos Parasyris, Praneet Rathi, Giorgis\n  Georgakoudis, Harshitha Menon, Peer-Timo Bremer","authorsParsed":[["Fink","Zane",""],["Parasyris","Konstantinos",""],["Rathi","Praneet",""],["Georgakoudis","Giorgis",""],["Menon","Harshitha",""],["Bremer","Peer-Timo",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 19:38:52 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 21:11:53 GMT"}],"updateDate":"2024-08-28","timestamp":1721936332000,"abstract":"  Recent advancements in Machine Learning (ML) have substantially improved its\npredictive and computational abilities, offering promising opportunities for\nsurrogate modeling in scientific applications. By accurately approximating\ncomplex functions with low computational cost, ML-based surrogates can\naccelerate scientific applications by replacing computationally intensive\ncomponents with faster model inference. However, integrating ML models into\nthese applications remains a significant challenge, hindering the widespread\nadoption of ML surrogates as an approximation technique in modern scientific\ncomputing.\n  We propose an easy-to-use directive-based programming model that enables\ndevelopers to seamlessly describe the use of ML models in scientific\napplications. The runtime support, as instructed by the programming model,\nperforms data assimilation using the original algorithm and can replace the\nalgorithm with model inference. Our evaluation across five benchmarks, testing\nover 5000 ML models, shows up to 83.6x speed improvements with minimal accuracy\nloss (as low as 0.01 RMSE).\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MM3lfwbUqrFhb5MIhOR5PgFiSRXQ9JOZN5nFeqmBoEk","pdfSize":"1178789","objectId":"0x86f2803225c41797cfbe86245e652073d844cfaa2756b55683efab8bca7c1569","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
