{"id":"2407.09861","title":"Towards Systematic Monolingual NLP Surveys: GenA of Greek NLP","authors":"Juli Bakagianni, Kanella Pouli, Maria Gavriilidou, John Pavlopoulos","authorsParsed":[["Bakagianni","Juli",""],["Pouli","Kanella",""],["Gavriilidou","Maria",""],["Pavlopoulos","John",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 12:01:52 GMT"}],"updateDate":"2024-07-16","timestamp":1720872112000,"abstract":"  Natural Language Processing (NLP) research has traditionally been\npredominantly focused on English, driven by the availability of resources, the\nsize of the research community, and market demands. Recently, there has been a\nnoticeable shift towards multilingualism in NLP, recognizing the need for\ninclusivity and effectiveness across diverse languages and cultures.\nMonolingual surveys have the potential to complement the broader trend towards\nmultilingualism in NLP by providing foundational insights and resources\nnecessary for effectively addressing the linguistic diversity of global\ncommunication. However, monolingual NLP surveys are extremely rare in\nliterature. This study fills the gap by introducing a method for creating\nsystematic and comprehensive monolingual NLP surveys. Characterized by a\nstructured search protocol, it can be used to select publications and organize\nthem through a taxonomy of NLP tasks. We include a classification of Language\nResources (LRs), according to their availability, and datasets, according to\ntheir annotation, to highlight publicly-available and machine-actionable LRs.\nBy applying our method, we conducted a systematic literature review of Greek\nNLP from 2012 to 2022, providing a comprehensive overview of the current state\nand challenges of Greek NLP research. We discuss the progress of Greek NLP and\noutline encountered Greek LRs, classified by availability and usability. As we\nshow, our proposed method helps avoid common pitfalls, such as data leakage and\ncontamination, and to assess language support per NLP task. We consider this\nsystematic literature review of Greek NLP an application of our method that\nshowcases the benefits of a monolingual NLP survey. Similar applications could\nbe regard the myriads of languages whose progress in NLP lags behind that of\nwell-supported languages.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fN56-s2q9Oy3wgbbsc3W6xUMfNKPlUVeHuaQV7iYn9U","pdfSize":"1767239","objectId":"0x359680df24d4b78d723dbe1a5ea50371358ee7dd7428b4932a1159cde8083a49","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
