{"id":"2407.10352","title":"Signature of Orbital Driven Finite Momentum Pairing in a 3D Ising\n  Superconductor","authors":"F. Z. Yang, H. D. Zhang, Saswata Mandal, F. Y. Meng, G. Fabbris, A.\n  Said, P. Mercado Lozano, A. Rajapitamahuni, E. Vescovo, C. Nelson, S. Lin, Y.\n  Park, E. M. Clements, T. Z. Ward, H.-N. Lee, H. C. Lei, C. X. Liu, H. Miao","authorsParsed":[["Yang","F. Z.",""],["Zhang","H. D.",""],["Mandal","Saswata",""],["Meng","F. Y.",""],["Fabbris","G.",""],["Said","A.",""],["Lozano","P. Mercado",""],["Rajapitamahuni","A.",""],["Vescovo","E.",""],["Nelson","C.",""],["Lin","S.",""],["Park","Y.",""],["Clements","E. M.",""],["Ward","T. Z.",""],["Lee","H. -N.",""],["Lei","H. C.",""],["Liu","C. X.",""],["Miao","H.",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 22:52:02 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 01:54:52 GMT"}],"updateDate":"2024-07-30","timestamp":1720997522000,"abstract":"  The finite momentum superconducting pairing states (FMPs), where Cooper pairs\ncarry non-zero momentum, are believed to give rise to exotic physical phenomena\nincluding the pseudogap phase of cuprate high-Tc superconductors and Majorana\nfermions in topological superconductivity. FMPs can emerge in intertwined\nelectronic liquids with strong spin-spin interactions or be induced by lifting\nthe spin degeneracy under magnetic field as originally proposed by\nFulde-Ferrell and Larkin-Ovchinnikov. In quantum materials with strong\nIsing-type spin-orbit coupling, such as the 2D transition metal dichalcogenides\n(TMDs), the spin degree of freedom is frozen enabling novel orbital driven FMPs\nvia magnetoelectric effect. While evidence of orbital driven FMPs has been\nrevealed in bilayer TMDs, its realization in 3D bulk materials remains an\nunresolved challenge. Here we report experimental signatures of FMP in a\nlocally noncentrosymmetric bulk superconductor 4Hb-TaS2. Using hard X-ray\ndiffraction and angle-resolved photoemission spectroscopy, we reveal unusual 2D\nchiral charge density wave (CDW) and weak interlayer hopping in 4Hb-TaS2. Below\nthe superconducting transition temperature, the upper critical field, Hc2,\nlinearly increases via decreasing temperature, and well exceeds the Pauli\nlimit, thus establishing the dominant orbital pair-breaking mechanism.\nRemarkably, we discover a field-induced superconductivity-to-superconductivity\ntransition that breaks continuous rotational symmetry of the s-wave uniform\npairing in the Bardeen-Cooper-Schrieffer theory down to the six-fold rotation\nsymmetry. Combining with a Ginzburg-Landau free energy analysis that\nincorporates magnetoelectric effect, our observations provide strong evidence\nof orbital driven FMP in the 3D quantum heterostructure 4Hb-TaS2.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"J8nJzyPa4x6I-w9BH60M-opAVCrDyk6O87H1TzSdhMo","pdfSize":"3612548","objectId":"0x8575a59f7125034037553ba69ff83d4f3b70a983ab398b5fb863ae8e10b6da52","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
