{"id":"2407.07766","title":"An investigation of the Online Payment and Banking System Apps in\n  Bangladesh","authors":"Shahriar Hasan Mickey and Muhammad Nur Yanhaona","authorsParsed":[["Mickey","Shahriar Hasan",""],["Yanhaona","Muhammad Nur",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:43:45 GMT"}],"updateDate":"2024-07-11","timestamp":1720626225000,"abstract":"  Presently, Bangladesh is expending substantial efforts to digitize its\nnational infrastructure, with a significant emphasis on achieving this goal\nthrough mobile applications that facilitate online payments and banking system\nadvancements. Despite the lack of knowledge about the security level of these\nsystems, they are currently in frequent use without much consideration. To\nobserve whether they follow the minimum global set standards, we choose to\nconduct static and dynamic analysis of the applications using available\nopen-source analyzers and open-source tools. This allows us to attempt to\nextract sensitive information, if possible, and determine whether the\napplications adhere to the standards of MASVS set by OWASP. We show how we\nanalyzed 17 .apks and a SDK using open source scanner and discover security\nflaws to the applications, such as weaknesses related to data storage,\nvulnerable cryptographic elements, insecure network communications, and unsafe\nutilization of WebViews, detected by the scanner. These outputs demonstrate the\nneed for extensive manual analysis of the application through source code\nreview and dynamic analysis. We further implement reverse engineering and\ndynamic approach to verify the outputs and expose some applications do not\ncomply with the standard method of network communication. Moreover, we attempt\nto verify the rest of the potential vulnerabilities in the next phase of our\nongoing investigation.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Hardware Architecture","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"05sTMs9guZLYfXAqX24JTyLCvYuC1S8JZA4Wyao-RXk","pdfSize":"594081","objectId":"0x1f74873578a55ca63a35c8ee8f5d905e8c3df8494ece54a8f0f74dfdb7838a31","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
