{"id":"2407.07611","title":"Physics-Informed Geometric Operators to Support Surrogate, Dimension\n  Reduction and Generative Models for Engineering Design","authors":"Shahroz Khan, Zahid Masood, Muhammad Usama, Konstantinos Kostas,\n  Panagiotis Kaklis, Wei (Wayne) Chen","authorsParsed":[["Khan","Shahroz","","Wayne"],["Masood","Zahid","","Wayne"],["Usama","Muhammad","","Wayne"],["Kostas","Konstantinos","","Wayne"],["Kaklis","Panagiotis","","Wayne"],["Wei","","","Wayne"],["Chen","",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 12:50:43 GMT"}],"updateDate":"2024-07-11","timestamp":1720615843000,"abstract":"  In this work, we propose a set of physics-informed geometric operators (GOs)\nto enrich the geometric data provided for training surrogate/discriminative\nmodels, dimension reduction, and generative models, typically employed for\nperformance prediction, dimension reduction, and creating data-driven\nparameterisations, respectively. However, as both the input and output streams\nof these models consist of low-level shape representations, they often fail to\ncapture shape characteristics essential for performance analyses. Therefore,\nthe proposed GOs exploit the differential and integral properties of\nshapes--accessed through Fourier descriptors, curvature integrals, geometric\nmoments, and their invariants--to infuse high-level intrinsic geometric\ninformation and physics into the feature vector used for training, even when\nemploying simple model architectures or low-level parametric descriptions. We\nshowed that for surrogate modelling, along with the inclusion of the notion of\nphysics, GOs enact regularisation to reduce over-fitting and enhance\ngeneralisation to new, unseen designs. Furthermore, through extensive\nexperimentation, we demonstrate that for dimension reduction and generative\nmodels, incorporating the proposed GOs enriches the training data with compact\nglobal and local geometric features. This significantly enhances the quality of\nthe resulting latent space, thereby facilitating the generation of valid and\ndiverse designs. Lastly, we also show that GOs can enable learning parametric\nsensitivities to a great extent. Consequently, these enhancements accelerate\nthe convergence rate of shape optimisers towards optimal solutions.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"23fuCRry9dLOu3ibIMpwqLmjVMkLzT4afkP-j2pp0-s","pdfSize":"31312796","objectId":"0x8c47bd4367a9cff9516426e2d375e56ea9baee704ecdd0bab8596a52383722f7","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
