{"id":"2407.11946","title":"Hierarchical Separable Video Transformer for Snapshot Compressive\n  Imaging","authors":"Ping Wang, Yulun Zhang, Lishun Wang, and Xin Yuan","authorsParsed":[["Wang","Ping",""],["Zhang","Yulun",""],["Wang","Lishun",""],["Yuan","Xin",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 17:35:59 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 08:07:58 GMT"}],"updateDate":"2024-07-18","timestamp":1721151359000,"abstract":"  Transformers have achieved the state-of-the-art performance on solving the\ninverse problem of Snapshot Compressive Imaging (SCI) for video, whose\nill-posedness is rooted in the mixed degradation of spatial masking and\ntemporal aliasing. However, previous Transformers lack an insight into the\ndegradation and thus have limited performance and efficiency. In this work, we\ntailor an efficient reconstruction architecture without temporal aggregation in\nearly layers and Hierarchical Separable Video Transformer (HiSViT) as building\nblock. HiSViT is built by multiple groups of Cross-Scale Separable Multi-head\nSelf-Attention (CSS-MSA) and Gated Self-Modulated Feed-Forward Network\n(GSM-FFN) with dense connections, each of which is conducted within a separate\nchannel portions at a different scale, for multi-scale interactions and\nlong-range modeling. By separating spatial operations from temporal ones,\nCSS-MSA introduces an inductive bias of paying more attention within frames\ninstead of between frames while saving computational overheads. GSM-FFN further\nenhances the locality via gated mechanism and factorized spatial-temporal\nconvolutions. Extensive experiments demonstrate that our method outperforms\nprevious methods by $\\!>\\!0.5$ dB with comparable or fewer parameters and\ncomplexity. The source codes and pretrained models are released at\nhttps://github.com/pwangcs/HiSViT.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ds8VIt9a7wXyqQGzGy1tCvccCJ8yAFIBeh1R63ZMaug","pdfSize":"9343955","objectId":"0xb85f0752d149a4eb2cff6e77923ec8da91dce8724059e01dbe754d7ea8c38937","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
