{"id":"2407.08272","title":"PowerYOLO: Mixed Precision Model for Hardware Efficient Object Detection\n  with Event Data","authors":"Dominika Przewlocka-Rus, Tomasz Kryjak, Marek Gorgon","authorsParsed":[["Przewlocka-Rus","Dominika",""],["Kryjak","Tomasz",""],["Gorgon","Marek",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 08:17:35 GMT"}],"updateDate":"2024-07-12","timestamp":1720685855000,"abstract":"  The performance of object detection systems in automotive solutions must be\nas high as possible, with minimal response time and, due to the often\nbattery-powered operation, low energy consumption. When designing such\nsolutions, we therefore face challenges typical for embedded vision systems:\nthe problem of fitting algorithms of high memory and computational complexity\ninto small low-power devices. In this paper we propose PowerYOLO - a mixed\nprecision solution, which targets three essential elements of such application.\nFirst, we propose a system based on a Dynamic Vision Sensor (DVS), a novel\nsensor, that offers low power requirements and operates well in conditions with\nvariable illumination. It is these features that may make event cameras a\npreferential choice over frame cameras in some applications. Second, to ensure\nhigh accuracy and low memory and computational complexity, we propose to use\n4-bit width Powers-of-Two (PoT) quantisation for convolution weights of the\nYOLO detector, with all other parameters quantised linearly. Finally, we\nembrace from PoT scheme and replace multiplication with bit-shifting to\nincrease the efficiency of hardware acceleration of such solution, with a\nspecial convolution-batch normalisation fusion scheme. The use of specific\nsensor with PoT quantisation and special batch normalisation fusion leads to a\nunique system with almost 8x reduction in memory complexity and vast\ncomputational simplifications, with relation to a standard approach. This\nefficient system achieves high accuracy of mAP 0.301 on the GEN1 DVS dataset,\nmarking the new state-of-the-art for such compressed model.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RtrWtRrLHGvJJW0LGIRYp3ZvdzD3kCCk9uvWFtM66bM","pdfSize":"1477802","objectId":"0xcd9562b419c6020b275a5fa912eff9681b218c8aaab6e4033e899ed0d0a1a264","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
