{"id":"2407.01972","title":"MeMemo: On-device Retrieval Augmentation for Private and Personalized\n  Text Generation","authors":"Zijie J. Wang, Duen Horng Chau","authorsParsed":[["Wang","Zijie J.",""],["Chau","Duen Horng",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 06:08:55 GMT"}],"updateDate":"2024-07-03","timestamp":1719900535000,"abstract":"  Retrieval-augmented text generation (RAG) addresses the common limitations of\nlarge language models (LLMs), such as hallucination, by retrieving information\nfrom an updatable external knowledge base. However, existing approaches often\nrequire dedicated backend servers for data storage and retrieval, thereby\nlimiting their applicability in use cases that require strict data privacy,\nsuch as personal finance, education, and medicine. To address the pressing need\nfor client-side dense retrieval, we introduce MeMemo, the first open-source\nJavaScript toolkit that adapts the state-of-the-art approximate nearest\nneighbor search technique HNSW to browser environments. Developed with modern\nand native Web technologies, such as IndexedDB and Web Workers, our toolkit\nleverages client-side hardware capabilities to enable researchers and\ndevelopers to efficiently search through millions of high-dimensional vectors\nin the browser. MeMemo enables exciting new design and research opportunities,\nsuch as private and personalized content creation and interactive prototyping,\nas demonstrated in our example application RAG Playground. Reflecting on our\nwork, we discuss the opportunities and challenges for on-device dense\nretrieval. MeMemo is available at https://github.com/poloclub/mememo.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jjgbt1QVbF4ZI9OQVDTKuBY0vcj-cv70FgZbM6lUs1Y","pdfSize":"1323988","objectId":"0xb272ed533853f90a64c5b5e82412446794dfdb359c94972a789ef0291044b882","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
