{"id":"2407.14046","title":"Kinetic Inductance Parametric Converter","authors":"M. Khalifa, P. Feldmann, and J. Salfi","authorsParsed":[["Khalifa","M.",""],["Feldmann","P.",""],["Salfi","J.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 05:56:08 GMT"}],"updateDate":"2024-08-13","timestamp":1721368568000,"abstract":"  Parametric converters are parametric amplifiers that mix two spatially\nseparate nondegenerate modes and are commonly used for amplifying and squeezing\nmicrowave signals in quantum computing and sensing. In Josephson parametric\nconverters, the strong localized nonlinearity of the Josephson Junction limits\nthe amplification and squeezing, as well as the dynamic range, in current\ndevices. In contrast, a weak distributed nonlinearity can provide higher gain\nand dynamic range, when implemented as a kinetic inductance (KI) nanowire of a\ndirty superconductor, and has additional benefits such as resilience to\nmagnetic field, higher-temperature operation, and simplified fabrication. Here,\nwe propose, demonstrate, and analyze the performance of a KI parametric\nconverter that relies on the weak distributed nonlinearity of a KI nanowire.\nThe device utilizes three-wave mixing induced by a DC current bias. We\ndemonstrate its operation as a nondegenerate parametric amplifier with high\nphase-sensitive gain, reaching two-mode amplification and deamplification of\n$\\sim$30 dB for two resonances separated by 0.8 GHz, in excellent agreement\nwith our theory of the device. We observe a dynamic range of -108~dBm at 30 dB\ngain. Our device can significantly broaden applications of quantum-limited\nsignal processing devices including phase-preserving amplification and two-mode\nsqueezing.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0QRxcvxZlOh1UC9SHINAON7quVRKFqRjamIsuhi74l4","pdfSize":"1050939","objectId":"0xeea3330c71257913b1e2508c4ca5a715176b9ac73adb4bfbb40f2b6210f84459","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
