{"id":"2407.04076","title":"Natively neuromorphic LMU architecture for encoding-free SNN-based HAR\n  on commercial edge devices","authors":"Vittorio Fra, Benedetto Leto, Andrea Pignata, Enrico Macii, Gianvito\n  Urgese","authorsParsed":[["Fra","Vittorio",""],["Leto","Benedetto",""],["Pignata","Andrea",""],["Macii","Enrico",""],["Urgese","Gianvito",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 17:35:12 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 14:59:06 GMT"}],"updateDate":"2024-07-25","timestamp":1720114512000,"abstract":"  Neuromorphic models take inspiration from the human brain by adopting\nbio-plausible neuron models to build alternatives to traditional Machine\nLearning (ML) and Deep Learning (DL) solutions. The scarce availability of\ndedicated hardware able to actualize the emulation of brain-inspired\ncomputation, which is otherwise only simulated, yet still hinders the wide\nadoption of neuromorphic computing for edge devices and embedded systems. With\nthis premise, we adopt the perspective of neuromorphic computing for\nconventional hardware and we present the L2MU, a natively neuromorphic Legendre\nMemory Unit (LMU) which entirely relies on Leaky Integrate-and-Fire (LIF)\nneurons. Specifically, the original recurrent architecture of LMU has been\nredesigned by modelling every constituent element with neural populations made\nof LIF or Current-Based (CuBa) LIF neurons. To couple neuromorphic computing\nand off-the-shelf edge devices, we equipped the L2MU with an input module for\nthe conversion of real values into spikes, which makes it an encoding-free\nimplementation of a Recurrent Spiking Neural Network (RSNN) able to directly\nwork with raw sensor signals on non-dedicated hardware. As a use case to\nvalidate our network, we selected the task of Human Activity Recognition (HAR).\nWe benchmarked our L2MU on smartwatch signals from hand-oriented activities,\ndeploying it on three different commercial edge devices in compressed versions\ntoo. The reported results remark the possibility of considering neuromorphic\nmodels not only in an exclusive relationship with dedicated hardware but also\nas a suitable choice to work with common sensors and devices.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"giyHaygJ2gAs2bz64OonMx6Xqos1SZfXMutb8gv1NbM","pdfSize":"2098495"}
