{"id":"2407.14027","title":"Daytime turbulence strength profile measurement at Kodaikanal\n  Observatory","authors":"Saraswathi Kalyani Subramanian and Sridharan Rengaswamy and Prasanna\n  Gajanan Deshmukh and Binukumar G. Nair and Mahesh Babu S","authorsParsed":[["Subramanian","Saraswathi Kalyani",""],["Rengaswamy","Sridharan",""],["Deshmukh","Prasanna Gajanan",""],["Nair","Binukumar G.",""],["S","Mahesh Babu",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 04:52:48 GMT"}],"updateDate":"2024-07-22","timestamp":1721364768000,"abstract":"  The Indian Institute of Astrophysics (IIA) is developing a Multi-Conjugate\nAdaptive Optics (MCAO) system for the Kodaikanal Tower Telescope (KTT). In this\ncontext, we have measured the daytime turbulence strength profile at the\nKodaikanal Observatory. The first method based on wavefront sensor (WFS)\nimages, called S-DIMM+ (Solar-Differential Image Motion Monitor+), was used to\nestimate the higher altitude turbulence up to a height of 5 - 6 km. The second\nmethod used balloon-borne temperature sensors to measure the near-Earth\nturbulence up to 350 m. We also carried out simulations to validate the\nperformance of our system. We report the first-ever daytime turbulence strength\nprofile measurements at the observatory. We have identified the presence of a\nstrong turbulence layer about 3 km above the observatory. The measured\nnear-Earth turbulence matches the trend that is expected from the model for\ndaytime component of turbulence and gives an integrated $r_0$ of about 4 cm at\n500 nm. This is consistent with earlier seeing measurements. This shows that a\nlow-cost setup with a small telescope and a simple array of temperature sensors\ncan be used for estimating the turbulence strength profile at the site.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"gR-bze4ymQwRd8Bh-zZJJylNL3IQTKvW3JbwNUJQ11c","pdfSize":"20071461","objectId":"0x67c403debc985f39c4b768266bfc5f6318defc2a771f55744fb764297b34e126","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
