{"id":"2407.06472","title":"Optimizing Electric Carsharing System Operations and Battery Management:\n  Integrating V2G, B2G and Battery Swapping Strategies","authors":"Shuang Yang, Gon\\c{c}alo Homem de Almeida Correia, Jianjun Wu, Huijun\n  Sun","authorsParsed":[["Yang","Shuang",""],["Correia","Gonçalo Homem de Almeida",""],["Wu","Jianjun",""],["Sun","Huijun",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 00:31:44 GMT"}],"updateDate":"2024-07-10","timestamp":1720485104000,"abstract":"  Shared electric vehicles (SEVs) have emerged as a promising solution to\ncontribute to sustainable urban mobility. However, ensuring the efficient\noperation and effective battery management of SEV systems remains a complex\nchallenge. This challenge stems from factors such as slow plug-in charging, the\npotential role of SEVs in balancing grid load pressure, and the optimization of\nSEV operations to ensure their economic viability. To tackle these challenges,\nthis paper introduces an integrated strategy for optimizing various aspects of\nSEV systems, encompassing strategies like Vehicle-to-Grid (V2G),\nBattery-to-Grid (B2G), and battery swapping. This approach is built on a\nspace-time-energy network model that facilitates the optimization of battery\ncharging and discharging scheduling, SEV operations like relocations and\nbattery swapping, battery swapping station selection and the number of\nbatteries. The objective of this approach is to maximize profits while\naddressing operational constraints and the complexities of energy management\nwithin SEV systems. Given the substantial complexity that arises with\nlarge-problem scales, the paper introduces a column generation-based heuristic\nalgorithm. Extensive experimental validation is conducted, including\nsensitivity analysis on different charging speeds and fleet sizes. The results\nilluminate the impact of varying charging rates and fleet sizes on performance\nindicators. Notably, it is observed that battery swapping is particularly\neffective as an auxiliary charging method when the number of vehicles is\nlimited. Conversely, in scenarios with a large fleet, the necessity for battery\nswapping diminishes. Moreover, results show the effectiveness of V2G and B2G\ntechnologies in grid load balancing.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uiueqitErq3kyK36CCQR1Flp_6VRXAleRXGz0PC909g","pdfSize":"2368778"}
