{"id":"2407.04781","title":"A new observable for holographic cosmology","authors":"Joydeep Chakravarty, Alexander Maloney, Keivan Namjou, Simon F. Ross","authorsParsed":[["Chakravarty","Joydeep",""],["Maloney","Alexander",""],["Namjou","Keivan",""],["Ross","Simon F.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 18:00:06 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 01:02:44 GMT"}],"updateDate":"2024-07-24","timestamp":1720202406000,"abstract":"  The double-cone geometry is a saddle of the gravitational path integral,\nwhich explains the chaotic statistics of the spectrum of black hole\nmicrostates. This geometry is the usual AdS-Schwarzschild black hole, but with\na periodic identification of the time coordinate; the resulting singularity at\nthe black hole horizon is regulated by making the geometry slightly complex.\nHere, we consider generalizations of the double-cone geometry which include the\nLorentzian cosmology that sits between the event horizon and the black hole\nsingularity. We analyze this in two and three dimensions, where the cosmology\nhas compact spatial sections and big bang/crunch singularities. These\nsingularities are regulated in the same way by slightly complexifying the\nmetric. We show that this is possible while satisfying the Kontsevich-Segal\ncriterion, implying that these geometries can be interpreted as perturbatively\nstable saddle points in general relativity. This procedure leads to a novel\ndescription of the cosmology in terms of standard observables in the dual\nboundary CFT. In three dimensions, the cosmological solution gives a new\ncontribution to the two-point function of the density of states in the boundary\nCFT. Unlike the usual double cone, it describes correlations between black hole\nmicrostates with different masses, and in a limit describes correlations\nbetween the statistics of heavy states and states near the BTZ threshold.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"t2J-ibAQwY1DbZlE8LbH0dQDMq_0oUXqOha8rcWPf_I","pdfSize":"380278"}
