{"id":"2407.06096","title":"Muzzle-Based Cattle Identification System Using Artificial Intelligence\n  (AI)","authors":"Hasan Zohirul Islam, Safayet Khan, Sanjib Kumar Paul, Sheikh Imtiaz\n  Rahi, Fahim Hossain Sifat, Md. Mahadi Hasan Sany, Md. Shahjahan Ali Sarker,\n  Tareq Anam, Ismail Hossain Polas","authorsParsed":[["Islam","Hasan Zohirul",""],["Khan","Safayet",""],["Paul","Sanjib Kumar",""],["Rahi","Sheikh Imtiaz",""],["Sifat","Fahim Hossain",""],["Sany","Md. Mahadi Hasan",""],["Sarker","Md. Shahjahan Ali",""],["Anam","Tareq",""],["Polas","Ismail Hossain",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 16:36:55 GMT"}],"updateDate":"2024-07-09","timestamp":1720456615000,"abstract":"  Absence of tamper-proof cattle identification technology was a significant\nproblem preventing insurance companies from providing livestock insurance. This\nlack of technology had devastating financial consequences for marginal farmers\nas they did not have the opportunity to claim compensation for any unexpected\nevents such as the accidental death of cattle in Bangladesh. Using machine\nlearning and deep learning algorithms, we have solved the bottleneck of cattle\nidentification by developing and introducing a muzzle-based cattle\nidentification system. The uniqueness of cattle muzzles has been scientifically\nestablished, which resembles human fingerprints. This is the fundamental\npremise that prompted us to develop a cattle identification system that\nextracts the uniqueness of cattle muzzles. For this purpose, we collected\n32,374 images from 826 cattle. Contrast-limited adaptive histogram equalization\n(CLAHE) with sharpening filters was applied in the preprocessing steps to\nremove noise from images. We used the YOLO algorithm for cattle muzzle\ndetection in the image and the FaceNet architecture to learn unified embeddings\nfrom muzzle images using squared $L_2$ distances. Our system performs with an\naccuracy of $96.489\\%$, $F_1$ score of $97.334\\%$, and a true positive rate\n(tpr) of $87.993\\%$ at a remarkably low false positive rate (fpr) of $0.098\\%$.\nThis reliable and efficient system for identifying cattle can significantly\nadvance livestock insurance and precision farming.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"aXB0_fJii220-ojZq0g6qPp7FffFZ2r8Fs6MY5SgOtk","pdfSize":"22980560"}
