{"id":"2407.21087","title":"Plant and insect proteins support optimal bone growth and development;\n  Evidences from a pre-clinical model","authors":"Gal Becker, Jerome Nicolas Janssen, Rotem Kalev-Altman, Dana Meilich,\n  Astar Shitrit, Svetlana Penn, Ram Reifen and Efrat Monsonego Ornan","authorsParsed":[["Becker","Gal",""],["Janssen","Jerome Nicolas",""],["Kalev-Altman","Rotem",""],["Meilich","Dana",""],["Shitrit","Astar",""],["Penn","Svetlana",""],["Reifen","Ram",""],["Ornan","Efrat Monsonego",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 15:03:54 GMT"}],"updateDate":"2024-08-01","timestamp":1722351834000,"abstract":"  By 2050, the global population will exceed 9 billion, demanding a 70%\nincrease in food production. Animal proteins alone may not suffice and\ncontribute to global warming. Alternative proteins such as legumes, algae, and\ninsects are being explored, but their health impacts are largely unknown. For\nthis, three-week-old rats were fed diets containing 20% protein from various\nsources for six weeks. A casein-based control diet was compared to soy isolate,\nspirulina powder, chickpea isolate, chickpea flour, and fly larvae powder.\nExcept for spirulina, alternative protein groups showed comparable growth\npatterns to the casein group. Morphological and mechanical tests of femur bones\nmatched growth patterns. Caecal 16S analysis highlighted the impact on gut\nmicrobiota diversity. Chickpea flour showed significantly lower\n$\\alpha$-diversity compared with casein and chickpea isolate groups while\nchickpea flour, had the greatest distinction in $\\beta$-diversity. Alternative\nprotein sources supported optimal growth, but quality and health implications\nrequire further exploration.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"d93ms_9Fpm6UOwEJBgu_xP4rM31fOVRzUe35rY-raiM","pdfSize":"5003122","objectId":"0x7853b8ec13ccf4570e905719b63ff0d77be1181f66333c4d7efa49e01fcf1c27","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
