{"id":"2407.11044","title":"Generalizing soft actor-critic algorithms to discrete action spaces","authors":"Le Zhang, Yong Gu, Xin Zhao, Yanshuo Zhang, Shu Zhao, Yifei Jin,\n  Xinxin Wu","authorsParsed":[["Zhang","Le",""],["Gu","Yong",""],["Zhao","Xin",""],["Zhang","Yanshuo",""],["Zhao","Shu",""],["Jin","Yifei",""],["Wu","Xinxin",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 03:20:45 GMT"}],"updateDate":"2024-07-17","timestamp":1720408845000,"abstract":"  ATARI is a suite of video games used by reinforcement learning (RL)\nresearchers to test the effectiveness of the learning algorithm. Receiving only\nthe raw pixels and the game score, the agent learns to develop sophisticated\nstrategies, even to the comparable level of a professional human games tester.\nIdeally, we also want an agent requiring very few interactions with the\nenvironment. Previous competitive model-free algorithms for the task use the\nvalued-based Rainbow algorithm without any policy head. In this paper, we\nchange it by proposing a practical discrete variant of the soft actor-critic\n(SAC) algorithm. The new variant enables off-policy learning using policy heads\nfor discrete domains. By incorporating it into the advanced Rainbow variant,\ni.e., the ``bigger, better, faster'' (BBF), the resulting SAC-BBF improves the\nprevious state-of-the-art interquartile mean (IQM) from 1.045 to 1.088, and it\nachieves these results using only replay ratio (RR) 2. By using lower RR 2, the\ntraining time of SAC-BBF is strictly one-third of the time required for BBF to\nachieve an IQM of 1.045 using RR 8. As a value of IQM greater than one\nindicates super-human performance, SAC-BBF is also the only model-free\nalgorithm with a super-human level using only RR 2. The code is publicly\navailable on GitHub at https://github.com/lezhang-thu/bigger-better-faster-SAC.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cbBaJ9CrD4hBizWX2JXEasmwdpfY4ka5BDj0DMl-NRQ","pdfSize":"671919","objectId":"0x4cb9041ce8f65d56501062c3550ec865439ea206032cff098018f94b22099765","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
