{"id":"2407.12715","title":"Effects of dynamic power electronic load models on power systems\n  analysis using ZIP-E loads","authors":"Gabriel E. Colon-Reyes, Reid Dye, Claire Tomlin, Duncan Callaway","authorsParsed":[["Colon-Reyes","Gabriel E.",""],["Dye","Reid",""],["Tomlin","Claire",""],["Callaway","Duncan",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 16:37:12 GMT"}],"updateDate":"2024-07-18","timestamp":1721234232000,"abstract":"  Power grids are seeing more devices connected at the load level in the form\nof power electronics: e.g., data centers, electric vehicle chargers, and\nbattery storage facilities. Therefore it is necessary to perform power system\nanalyses with load models that capture these loads' behavior, which has\nhistorically not been done. To this end, we propose ZIP-E loads, a composite\nload model that has a ZIP load with a dynamic power electronic, or E, load\nmodel. We perform small signal and transient analysis of the IEEE WSCC 9 Bus\ntest case with ZIP and ZIP-E load models. For small signals, we conclude that\nZIP loads destabalize networks significantly faster than corresponding ZIP-E\nloads. In stable cases, transient results showed significantly larger\noscillations for ZIP loads. Further, we find that a higher network loading\ncondition is correlated with a higher sensitivity to load model choice. These\nresults suggests that the constant power portion of the ZIP load has a large\ndestabilizing effect and can generally overestimate instability, and that\nattention should be drawn to load model choice if operating near a stability\nboundary.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"gYbUdJmvYq_o_uqphFbcpMvThs18-Rz9Z0WvZXJ7XnQ","pdfSize":"753871","objectId":"0x4ef5fcebf39eb3758eed9a5890072c604663626bd01b1d68f07ebff86aebed60","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
