{"id":"2407.06987","title":"Stochastic excitation of waves in magnetic stars -- I. Scaling laws for\n  the modes amplitudes","authors":"Le\\\"ila Bessila, St\\'ephane Mathis","authorsParsed":[["Bessila","Leïla",""],["Mathis","Stéphane",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 16:00:32 GMT"}],"updateDate":"2024-07-11","timestamp":1720540832000,"abstract":"  Stellar oscillations are key to unravelling stars' properties, such as their\nmass, radius and age. Amplitudes of acoustic modes in solar-like stars are\nintrinsically linked to their convective turbulent excitation source, which in\nturn is influenced by magnetism. In the observations of the Sun and stars, the\namplitude of the modes is modulated following their magnetic activity cycles:\nthe higher the magnetic field, the lower the modes' amplitudes. When the\nmagnetic field is strong, it can even inhibit the acoustic modes, which are not\ndetected in a majority of solar-like stars presenting a strong magnetic\nactivity. Magnetic fields are known to freeze convection when stronger than a\ncritical value: an \"on-off\" approach is used in the literature. In this work,\nwe investigate the impact of magnetic fields on the stochastic excitation of\nacoustic modes. First, we generalise the forced wave equation formalism,\nincluding the effects of magnetic fields. Second, we assess how convection is\naffected by magnetic fields using results from Magnetic Mixing-Length Theory.\nWe provide the source terms of stochastic excitation, including a new magnetic\nsource term and the Reynolds stresses. We provide scaling laws for the\namplitudes of the modes, taking into account both the driving and the damping.\nThose scalings are based on the inverse Alfv\\'en dimensionless parameter: the\ndamping increases with the magnetic field and reaches a saturation threshold\nwhen the magnetic field is strong. The driving of the modes diminishes when the\nmagnetic field becomes stronger, the turbulent convection being weaker. As\nexpected from the observations, we find that a higher magnetic field diminishes\nthe resulting modes amplitudes. Evaluating the inverse Alfv\\'en number in\nstellar models provides a means to estimate the expected amplitudes of acoustic\nmodes in magnetic active solar-type stars.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GkV-Dtb9YQKvcSI40E-ISaCnfTn2nA_HLDo0ZFcW4Bk","pdfSize":"2127646"}
