{"id":"2407.10197","title":"Multiple data sources and domain generalization learning method for road\n  surface defect classification","authors":"Linh Trinh, Ali Anwar, Siegfried Mercelis","authorsParsed":[["Trinh","Linh",""],["Anwar","Ali",""],["Mercelis","Siegfried",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 13:37:47 GMT"}],"updateDate":"2024-07-16","timestamp":1720964267000,"abstract":"  Roads are an essential mode of transportation, and maintaining them is\ncritical to economic growth and citizen well-being. With the continued\nadvancement of AI, road surface inspection based on camera images has recently\nbeen extensively researched and can be performed automatically. However,\nbecause almost all of the deep learning methods for detecting road surface\ndefects were optimized for a specific dataset, they are difficult to apply to a\nnew, previously unseen dataset. Furthermore, there is a lack of research on\ntraining an efficient model using multiple data sources. In this paper, we\npropose a method for classifying road surface defects using camera images. In\nour method, we propose a scheme for dealing with the invariance of multiple\ndata sources while training a model on multiple data sources. Furthermore, we\npresent a domain generalization training algorithm for developing a generalized\nmodel that can work with new, completely unseen data sources without requiring\nmodel updates. We validate our method using an experiment with six data sources\ncorresponding to six countries from the RDD2022 dataset. The results show that\nour method can efficiently classify road surface defects on previously unseen\ndata.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"poGeQqXiQscw_jVzcfhF_vmGG6N3UxI4M8KEoM5Cmf8","pdfSize":"385448","objectId":"0xd9f9f7cf01efe4568c4f74b7c91c46d1210195327519e371c45efb572f4a0b26","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
