{"id":"2407.01343","title":"Coordination Failure in Cooperative Offline MARL","authors":"Callum Rhys Tilbury, Claude Formanek, Louise Beyers, Jonathan P.\n  Shock, Arnu Pretorius","authorsParsed":[["Tilbury","Callum Rhys",""],["Formanek","Claude",""],["Beyers","Louise",""],["Shock","Jonathan P.",""],["Pretorius","Arnu",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 14:51:29 GMT"}],"updateDate":"2024-07-02","timestamp":1719845489000,"abstract":"  Offline multi-agent reinforcement learning (MARL) leverages static datasets\nof experience to learn optimal multi-agent control. However, learning from\nstatic data presents several unique challenges to overcome. In this paper, we\nfocus on coordination failure and investigate the role of joint actions in\nmulti-agent policy gradients with offline data, focusing on a common setting we\nrefer to as the 'Best Response Under Data' (BRUD) approach. By using two-player\npolynomial games as an analytical tool, we demonstrate a simple yet overlooked\nfailure mode of BRUD-based algorithms, which can lead to catastrophic\ncoordination failure in the offline setting. Building on these insights, we\npropose an approach to mitigate such failure, by prioritising samples from the\ndataset based on joint-action similarity during policy learning and demonstrate\nits effectiveness in detailed experiments. More generally, however, we argue\nthat prioritised dataset sampling is a promising area for innovation in offline\nMARL that can be combined with other effective approaches such as critic and\npolicy regularisation. Importantly, our work shows how insights drawn from\nsimplified, tractable games can lead to useful, theoretically grounded insights\nthat transfer to more complex contexts. A core dimension of offering is an\ninteractive notebook, from which almost all of our results can be reproduced,\nin a browser.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9EPsiFQ5czMYaCDchzls2bb1f4aiI5cV_4Zq-BPHHCI","pdfSize":"1666170","objectId":"0x736b1782add5398f3aaa23947ecc55f8e34b3448cacba75d3625a5b0dd7a2a1b","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
