{"id":"2407.14954","title":"Emergent electromagnetism","authors":"Erick I. Duque","authorsParsed":[["Duque","Erick I.",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 18:14:37 GMT"}],"updateDate":"2024-07-23","timestamp":1721499277000,"abstract":"  We introduce the concept of emergent electric field. This is distinguished\nfrom the fundamental one in that the emergent electric field directly appears\nin observations through the Lorentz force, while the latter enters the phase\nspace as the canonical momentum of the electromagnetic field. In Hamiltonian\nclassical electromagnetism this concept naturally appears after introducing the\ntopological $\\theta$ term. Furthermore, we show that in the spherically\nsymmetric model the concept of emergent electric field allows us to formulate a\nmodified theory of electromagnetism that is otherwise impossible. The relation\nbetween the fundamental and the emergent electric fields is derived from the\nimposition of general covariance of the electromagnetic strength tensor, which\nis a nontrivial task in the canonical formulation the modified theory is based\non. We couple this theory to emergent modified gravity, where a similar\ndistinction between spacetime and gravity is made such that the spacetime,\nwhich defines the observable geometry, is an emergent field composed of the\nfundamental gravitational field. In this more encompassing emergent field\ntheory coupling gravity and electromagnetism, we show that the spherically\nsymmetric model contains a nonsingular black hole solution where not only\nmodified gravity but also modified electromagnetism is crucial for a robust\nsingularity resolution and to avoid the existence of (super)extermal black\nholes.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hRE6V8dNoL5r18XBYDh5fNo6j7JLNA9yvTMRMLCzveY","pdfSize":"614690","objectId":"0xc690f5671413fcbcd4af1f6c7094968bdb1d766be3eb9eee55504628ae532d05","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
