{"id":"2407.05536","title":"Effective Many-body Interactions in Reduced-Dimensionality Spaces\n  Through Neural Network Models","authors":"Senwei Liang, Karol Kowalski, Chao Yang, Nicholas P. Bauman","authorsParsed":[["Liang","Senwei",""],["Kowalski","Karol",""],["Yang","Chao",""],["Bauman","Nicholas P.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 00:56:24 GMT"}],"updateDate":"2024-07-09","timestamp":1720400184000,"abstract":"  Accurately describing properties of challenging problems in physical sciences\noften requires complex mathematical models that are unmanageable to tackle\nhead-on. Therefore, developing reduced dimensionality representations that\nencapsulate complex correlation effects in many-body systems is crucial to\nadvance the understanding of these complicated problems. However, a numerical\nevaluation of these predictive models can still be associated with a\nsignificant computational overhead. To address this challenge, in this paper,\nwe discuss a combined framework that integrates recent advances in the\ndevelopment of active-space representations of coupled cluster (CC) downfolded\nHamiltonians with neural network approaches. The primary objective of this\neffort is to train neural networks to eliminate the computationally expensive\nsteps required for evaluating hundreds or thousands of Hugenholtz diagrams,\nwhich correspond to multidimensional tensor contractions necessary for\nevaluating a many-body form of downfolded/effective Hamiltonians. Using small\nmolecular systems (the H2O and HF molecules) as examples, we demonstrate that\ntraining neural networks employing effective Hamiltonians for a few nuclear\ngeometries of molecules can accurately interpolate/ extrapolate their forms to\nother geometrical configurations characterized by different intensities of\ncorrelation effects. We also discuss differences between effective interactions\nthat define CC downfolded Hamiltonians with those of bare Hamiltonians defined\nby Coulomb interactions in the active spaces.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bcP2dXtnQqyY7xG9w5l7W63h4euooUhcxAt-eBDFeIM","pdfSize":"1787231"}
