{"id":"2407.00305","title":"Student-AI Interaction: A Case Study of CS1 students","authors":"Matin Amoozadeh, Daye Nam, Daniel Prol, Ali Alfageeh, James Prather,\n  Michael Hilton, Sruti Srinivasa Ragavan, Mohammad Amin Alipour","authorsParsed":[["Amoozadeh","Matin",""],["Nam","Daye",""],["Prol","Daniel",""],["Alfageeh","Ali",""],["Prather","James",""],["Hilton","Michael",""],["Ragavan","Sruti Srinivasa",""],["Alipour","Mohammad Amin",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 04:12:45 GMT"}],"updateDate":"2024-07-02","timestamp":1719634365000,"abstract":"  The new capabilities of generative artificial intelligence tools Generative\nAI, such as ChatGPT, allow users to interact with the system in intuitive ways,\nsuch as simple conversations, and receive (mostly) good-quality answers. These\nsystems can support students' learning objectives by providing accessible\nexplanations and examples even with vague queries. At the same time, they can\nencourage undesired help-seeking behaviors by providing solutions to the\nstudents' homework. Therefore, it is important to better understand how\nstudents approach such tools and the potential issues such approaches might\npresent for the learners. In this paper, we present a case study for\nunderstanding student-AI collaboration to solve programming tasks in the CS1\nintroductory programming course. To this end, we recruited a gender-balanced\nmajority non-white set of 15 CS1 students at a large public university in the\nUS. We observed them solving programming tasks. We used a mixed-method approach\nto study their interactions as they tackled Python programming tasks, focusing\non when and why they used ChatGPT for problem-solving. We analyze and classify\nthe questions submitted by the 15 participants to ChatGPT. Additionally, we\nanalyzed user interaction patterns, their reactions to ChatGPT's responses, and\nthe potential impacts of Generative AI on their perception of self-efficacy.\nOur results suggest that in about a third of the cases, the student attempted\nto complete the task by submitting the full description of the tasks to ChatGPT\nwithout making any effort on their own. We also observed that few students\nverified their solutions. We discuss the results and their potential\nimplications.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rO8BOVhF60JvccTuZUx0sD129b5-0NgNR1bMTjr5rqI","pdfSize":"837828","objectId":"0xd535060e39d674858091c1226ecf8bfc8563650c64ef9ef93f44880d2c965c7e","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
