{"id":"2407.14578","title":"Star-Disk Collisions: Implications for QPEs and Other Transients Near\n  Supermassive Black Holes","authors":"Philippe Z. Yao, Eliot Quataert, Yan-Fei Jiang, Wenbin Lu, Christopher\n  J. White","authorsParsed":[["Yao","Philippe Z.",""],["Quataert","Eliot",""],["Jiang","Yan-Fei",""],["Lu","Wenbin",""],["White","Christopher J.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-23","timestamp":1721412000000,"abstract":"  We use Athena++ to study the hydrodynamics of repeated star-accretion disk\ncollisions close to supermassive black holes, and discuss their implications\nfor the origin of quasi-periodic eruptions (QPEs) and other repeating nuclear\ntransients. We quantify the impact of the collisions on the stellar structure,\nthe amount of stripped stellar debris, and the debris' orbital properties. We\nprovide simple fitting functions for the stellar mass-loss per collision; the\nmass-loss is much larger after repeated collisions due to the dilute stellar\natmosphere shock-heated in earlier collisions. The lifetime of the QPE-emitting\nphase set by stellar mass-loss in star-disk collision models for QPEs is thus\nat most ~100 years; it is shortest for eRO-QPE2, of order a few decades. The\nmass of the stripped stellar debris per collision and its orbital properties\nimply that currently observed QPEs are not powered by direct star-disk\ncollisions but rather by collisions between the stellar debris liberated in\nprevious collisions and the accretion disk (`circularization shocks'). We\ndiscuss how the hydrodynamics of this interaction can explain the diverse\ntiming properties of QPEs including the regular timing of GSN 069 and eRO-QPE2\nand the large flare-to-flare timing variations observed in eRO-QPE1. QPEs with\nrecurrence times of many days, if observed, may have more regular timing.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OjrfOZAcgf2ivUap2Pr-xzoZIDdXicE-ZDktOoNoYX8","pdfSize":"4096186","objectId":"0x9a34f9b274f46e3f0a3e08b43a6d46dbf234bec521feb50fa80b0efa07f587a1","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
