{"id":"2407.08985","title":"Hybrid Reconfigurable Intelligent Surface Enabled Over the Air Index\n  Modulation","authors":"Emre Arslan, Ali Tugberk Dogukan, Fatih Kilinc, Ertugrul Basar","authorsParsed":[["Arslan","Emre",""],["Dogukan","Ali Tugberk",""],["Kilinc","Fatih",""],["Basar","Ertugrul",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 04:40:37 GMT"}],"updateDate":"2024-07-15","timestamp":1720759237000,"abstract":"  Users' desire for enhanced performance drive the inevitable technological\nprogress on vertical applications in wireless communication systems. To meet\nthese demands, researchers vigorously investigate potential 6G and beyond\ntechnologies and solutions. Reconfigurable intelligent surfaces (RISs) have\nrisen in popularity and attracted the attention of academia as well as industry\nand seem to be a promising candidate for 6G technology. RISs are reflective\nmetamaterials with many configurable elements consisting of pin diodes that\nhave the ability to manipulate the impinging signals' properties, hence,\nenabling some sort of virtual control over the wireless channel. In this paper,\nwe propose a novel over-the-air index modulation (IM) scheme through the use of\na hybrid RIS with active and passive partitions to convey additional IM bits\nover-the-air. In addition we propose another modified scheme that allows the\ntransmission for even more IM bits but at the expense of certain trade-offs.\nFirst, we present the system model for both of the proposed schemes.\nFurthermore, comprehensive computer simulation results are provided and\ndiscussed presenting the superior bit error rate (BER) performance and\nadditional benefits of the proposed systems compared to similar benchmarks.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6ZRcBp9GHqVtVda1mabgrtzDnYEitAt57bpyoSBgInA","pdfSize":"978428","objectId":"0x523538f768579594ab8b76d66de719405ce60718695798aae7e918c28464aef6","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
