{"id":"2407.11535","title":"Tidal Disruption of Stars by Supermassive Black Holes and Naked\n  Singularities with Scalar Hair","authors":"Eduardo Andre and Alexander Tsirulev","authorsParsed":[["Andre","Eduardo",""],["Tsirulev","Alexander",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 09:33:16 GMT"}],"updateDate":"2024-07-17","timestamp":1721122396000,"abstract":"  In this paper we study tidal forces near strongly gravitating objects at the\ncenters of galaxies. In our approach, dark matter surrounding the centers of\ngalaxies is modeled by a nonlinear scalar field. We focus on static,\nasymptotically flat, spherically symmetric black holes and naked singularities\nsupported by a real self-gravitating scalar field minimally coupled to gravity.\nWe consider the influence of dark matter on the tidal forces caused by the\ncentral objects and some features of the motion of matter near these\nconfigurations. It turns out, first, that the event horizon radius of a scalar\nfield black hole can be arbitrarily small as well as the radius of the\ninnermost stable circular orbit, and tidal forces near this orbit can be very\nlarge. Second, we show that if strongly gravitating objects in the centers of\ngalaxies are naked singularities, then bright flares (tidal disruption events)\nin the nuclei of galaxies can be explained in different way. In the vicinity of\na scalar field naked singularity, baryonic matter is concentrated in the\ngravitational potential well forming a \"gray shell\" consisting of cold\ncompressed matter. In this case, the flares are caused by the collisions of\nstars with this shell.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"T3D95gL2-2wccaqSM0gPnjJhao5iXN7t_yCnR8QmweI","pdfSize":"488021","objectId":"0xedf33e87c759d38d203874e6494fabb80cde315b508dd8091a2e9f6cc3038cc7","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
