{"id":"2407.02207","title":"Global calibration of large-scale photonic integrated circuits","authors":"Jin-Hao Zheng, Qin-Qin Wang, Lan-Tian Feng, Yu-Yang Ding, Xiao-Ye Xu,\n  Xi-Feng Ren, Chuan-Feng Li and Guang-Can Guo","authorsParsed":[["Zheng","Jin-Hao",""],["Wang","Qin-Qin",""],["Feng","Lan-Tian",""],["Ding","Yu-Yang",""],["Xu","Xiao-Ye",""],["Ren","Xi-Feng",""],["Li","Chuan-Feng",""],["Guo","Guang-Can",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 12:14:02 GMT"}],"updateDate":"2024-07-03","timestamp":1719922442000,"abstract":"  The advancing maturity of photonic integrated circuit (PIC) fabrication\ntechnology enables the high integration of an increasing number of optical\ncomponents onto a single chip. With the incremental circuit complexity, the\ncalibration of active phase shifters in a large-scale PIC becomes a crucially\nimportant issue. The traditional one-by-one calibration techniques encounter\nsignificant hurdles with the propagation of calibration errors, and achieving\nthe decoupling of all phase shifters for independent calibration is not\nstraightforward. To address this issue, we propose a machine-learning approach\nfor globally calibrating the large-scale PIC. Our method utilizes a custom\nnetwork to simultaneously learn the nonlinear phase-current relations for all\nthermo-optic phase shifters on the PIC by minimizing the negative likelihood of\nthe measurement datasets. Moreover, the reflectivities of all static\nbeamsplitter components can also be synchronizedly extracted using this\ncalibration method. As an example, a quantum walk PIC with a circuit depth of\n12 is calibrated, and a programmable discrete-time quantum walk is\nexperimentally demonstrated. These results will greatly benefit the\napplications of large-scale PICs in photonic quantum information processing.\n","subjects":["Physics/Quantum Physics","Physics/Applied Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"oufmWm2w50v1QVAS98ToF2M_jeiFoSU8I3EpGN2ryz8","pdfSize":"2773899","objectId":"0xd1045aa268609d833dde3e880ce8edd2faf057781cb43c07e6888bbba0dc2495","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
