{"id":"2407.09645","title":"Hamilton-Jacobi Reachability in Reinforcement Learning: A Survey","authors":"Milan Ganai, Sicun Gao, Sylvia Herbert","authorsParsed":[["Ganai","Milan",""],["Gao","Sicun",""],["Herbert","Sylvia",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 19:04:39 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 19:45:41 GMT"}],"updateDate":"2024-08-23","timestamp":1720811079000,"abstract":"  Recent literature has proposed approaches that learn control policies with\nhigh performance while maintaining safety guarantees. Synthesizing\nHamilton-Jacobi (HJ) reachable sets has become an effective tool for verifying\nsafety and supervising the training of reinforcement learning-based control\npolicies for complex, high-dimensional systems. Previously, HJ reachability was\nrestricted to verifying low-dimensional dynamical systems primarily because the\ncomputational complexity of the dynamic programming approach it relied on grows\nexponentially with the number of system states. In recent years, a litany of\nproposed methods addresses this limitation by computing the reachability value\nfunction simultaneously with learning control policies to scale HJ reachability\nanalysis while still maintaining a reliable estimate of the true reachable set.\nThese HJ reachability approximations are used to improve the safety, and even\nreward performance, of learned control policies and can solve challenging tasks\nsuch as those with dynamic obstacles and/or with lidar-based or vision-based\nobservations. In this survey paper, we review the recent developments in the\nfield of HJ reachability estimation in reinforcement learning that would\nprovide a foundational basis for further research into reliability in\nhigh-dimensional systems.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Machine Learning","Computing Research Repository/Robotics","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IeUA_BpOq26bK89Qp-OD82bET_0LdhYM7KPCg2oDnGk","pdfSize":"3047350","objectId":"0x133446e81528de2e4122da6ff6232ff3fc49ef86038fb853d5b87fa4cf6ce11e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
