{"id":"2407.04268","title":"NeuFair: Neural Network Fairness Repair with Dropout","authors":"Vishnu Asutosh Dasu, Ashish Kumar, Saeid Tizpaz-Niari, Gang Tan","authorsParsed":[["Dasu","Vishnu Asutosh",""],["Kumar","Ashish",""],["Tizpaz-Niari","Saeid",""],["Tan","Gang",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 05:45:34 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 17:10:14 GMT"},{"version":"v3","created":"Mon, 2 Sep 2024 17:13:22 GMT"}],"updateDate":"2024-09-04","timestamp":1720158334000,"abstract":"  This paper investigates neuron dropout as a post-processing bias mitigation\nfor deep neural networks (DNNs). Neural-driven software solutions are\nincreasingly applied in socially critical domains with significant fairness\nimplications. While neural networks are exceptionally good at finding\nstatistical patterns from data, they may encode and amplify existing biases\nfrom the historical data. Existing bias mitigation algorithms often require\nmodifying the input dataset or the learning algorithms. We posit that the\nprevalent dropout methods that prevent over-fitting during training by randomly\ndropping neurons may be an effective and less intrusive approach to improve the\nfairness of pre-trained DNNs. However, finding the ideal set of neurons to drop\nis a combinatorial problem. We propose NeuFair, a family of post-processing\nrandomized algorithms that mitigate unfairness in pre-trained DNNs via dropouts\nduring inference after training. Our randomized search is guided by an\nobjective to minimize discrimination while maintaining the model's utility. We\nshow that our design of randomized algorithms is effective and efficient in\nimproving fairness (up to 69%) with minimal or no model performance\ndegradation. We provide intuitive explanations of these phenomena and carefully\nexamine the influence of various hyperparameters of search algorithms on the\nresults. Finally, we empirically and conceptually compare NeuFair to different\nstate-of-the-art bias mitigators.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yxYfvsk7MGD1V6kq2yRuNEgh88cQz-Uz60odPhLHW1M","pdfSize":"2415554"}
