{"id":"2407.00778","title":"Influence of fluid rheology on multistability in the unstable flow of\n  polymer solutions through pore constriction arrays","authors":"Emily Y. Chen and Sujit S. Datta","authorsParsed":[["Chen","Emily Y.",""],["Datta","Sujit S.",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 17:42:31 GMT"}],"updateDate":"2024-07-02","timestamp":1719769351000,"abstract":"  Diverse chemical, energy, environmental, and industrial processes involve the\nflow of polymer solutions in porous media. The accumulation and dissipation of\nelastic stresses as the polymers are transported through the tortuous, confined\npore space can lead to the development of an elastic flow instability above a\nthreshold flow rate. This flow instability can generate complex flows with\nstrong spatiotemporal fluctuations, despite the low Reynolds number\n($\\mathrm{Re} \\ll 1$); for example, in 1D ordered arrays of pore constrictions,\nthis unstable flow can be multistable, with distinct pores exhibiting distinct\nunstable flow states. Here, we examine how this multistability is influenced by\nfluid rheology. Through experiments using diverse polymer solutions having\nsystematic variations in fluid shear-thinning or elasticity, in pore\nconstriction arrays of varying geometries, we show that the onset of\nmultistability can be described using a single dimensionless parameter. This\nparameter, the streamwise Deborah number, compares the stress relaxation time\nof the polymer solution to the time required for the fluid to be advected\nbetween pore constrictions. Our work thus helps to deepen understanding of the\ninfluence of fluid rheology on elastic instabilities, helping to establish\nguidelines for the rational design of polymeric fluids with desirable flow\nbehaviors.\n","subjects":["Physics/Fluid Dynamics","Condensed Matter/Materials Science","Condensed Matter/Soft Condensed Matter","Nonlinear Sciences/Chaotic Dynamics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Plit-Kx9aL7V0rpxkcML5VBg9PDjP5NDN1Ce0EZzPtc","pdfSize":"2842740","objectId":"0xc733a076bb7170ab40a8c839da411b55cf12264bc04afa05f711d717e8026e7e","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
