{"id":"2407.02741","title":"18 GHz Solidly Mounted Resonator in Scandium Aluminum Nitride on\n  SiO2/Ta2O5 Bragg Reflector","authors":"Omar Barrera, Nishanth Ravi, Kapil Saha, Supratik Dasgupta, Joshua\n  Campbell, Jack Kramer, Eugene Kwon, Tzu-Hsuan Hsu, Sinwoo Cho, Ian Anderson,\n  Pietro Simeoni, Jue Hou, Matteo Rinaldi, Mark S. Goorsky, Ruochen Lu","authorsParsed":[["Barrera","Omar",""],["Ravi","Nishanth",""],["Saha","Kapil",""],["Dasgupta","Supratik",""],["Campbell","Joshua",""],["Kramer","Jack",""],["Kwon","Eugene",""],["Hsu","Tzu-Hsuan",""],["Cho","Sinwoo",""],["Anderson","Ian",""],["Simeoni","Pietro",""],["Hou","Jue",""],["Rinaldi","Matteo",""],["Goorsky","Mark S.",""],["Lu","Ruochen",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 01:26:54 GMT"},{"version":"v2","created":"Sat, 7 Sep 2024 16:41:53 GMT"}],"updateDate":"2024-09-10","timestamp":1719970014000,"abstract":"  This work reports an acoustic solidly mounted resonator (SMR) at 18.64 GHz,\namong the highest operating frequencies reported. The device is built in\nscandium aluminum nitride (ScAlN) on top of silicon dioxide (SiO2) and tantalum\npentoxide (Ta2O5) Bragg reflectors on silicon (Si) wafer. The stack is analyzed\nwith X-ray reflectivity (XRR) and high-resolution X-ray diffraction (HRXRD).\nThe resonator shows a coupling coefficient (k2) of 2.0%, high series quality\nfactor (Qs) of 156, shunt quality factor (Qp) of 142, and maximum Bode quality\nfactor (Qmax) of 210. The third-order harmonics at 59.64 GHz is also observed\nwith k2 around 0.6% and Q around 40. Upon further development, the reported\nacoustic resonator platform can enable various front-end signal-processing\nfunctions, e.g., filters and oscillators, at future frequency range 3 (FR3)\nbands.\n","subjects":["Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Y0oVSr3MDuAFT-7F2SOffNriARHQhPlO-WPiaWLjD9k","pdfSize":"1018461","objectId":"0x947e6b7fdae801d7eacfa0502612f7e40326ae2ba69d454a7af7be22b5ba2c05","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
