{"id":"2407.07515","title":"The deep oxygen abundance in Solar System Giant Planets, with a new\n  derivation for Saturn","authors":"Thibault Cavali\\'e, Jonathan Lunine, Olivier Mousis, Ricardo Hueso","authorsParsed":[["Cavalié","Thibault",""],["Lunine","Jonathan",""],["Mousis","Olivier",""],["Hueso","Ricardo",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 10:08:51 GMT"}],"updateDate":"2024-07-11","timestamp":1720606131000,"abstract":"  Deep elemental composition is a challenging measurement to achieve in the\ngiant planets of the solar system. Yet, knowledge of the deep composition\noffers important insights in the internal structure of these planets, their\nevolutionary history and their formation scenarios. A key element whose deep\nabundance is difficult to obtain is oxygen, because of its propensity for being\nin condensed phases such as rocks and ices. In the atmospheres of the giant\nplanets, oxygen is largely stored in water molecules that condense below the\nobservable levels. At atmospheric levels that can be investigated with remote\nsensing, water abundance can modify the observed meteorology, and\nmeteorological phenomena can distribute water through the atmosphere in complex\nways that are not well understood and that encompass deeper portions of the\natmosphere. The deep oxygen abundance provides constraints on the connection\nbetween atmosphere and interior and on the processes by which other elements\nwere trapped, making its determination an important element to understand giant\nplanets. In this paper, we review the current constraints on the deep oxygen\nabundance of the giant planets, as derived from observations and thermochemical\nmodels.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qN6dxVpAcP8DAnCEz6e5gR8KE0t7kKkF3vM4iNFWLv4","pdfSize":"193611","objectId":"0x02514f533dcb4cf69d4589dc3d1565914f3a0537a6932fb227a439d6903359eb","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
