{"id":"2407.05201","title":"Optimal input excitations for suppressing nonlinear instabilities in\n  multimode fibers","authors":"Kabish Wisal, Chun-Wei Chen, Zeyu Kuang, Owen D. Miller, Hui Cao and\n  A. Douglas Stone","authorsParsed":[["Wisal","Kabish",""],["Chen","Chun-Wei",""],["Kuang","Zeyu",""],["Miller","Owen D.",""],["Cao","Hui",""],["Stone","A. Douglas",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 22:38:59 GMT"}],"updateDate":"2024-07-09","timestamp":1720305539000,"abstract":"  Wavefront shaping has become a powerful tool for manipulating light\npropagation in various complex media undergoing linear scattering. Controlling\nnonlinear optical interactions with spatial degrees of freedom is a relatively\nrecent but growing area of research. A wavefront-shaping-based approach can be\nused to suppress nonlinear stimulated Brillouin scattering (SBS) and transverse\nmode instability (TMI), which are the two main limitations to power scaling in\nhigh-power narrowband fiber amplifiers. Here we formulate both SBS and TMI\nsuppression as optimization problems with respect to coherent multimode input\nexcitation in a given multimode fiber. We develop an efficient method for\nfinding the globally optimal input excitation for SBS and TMI suppression using\nlinear programming. We theoretically show that optimally exciting a standard\nmultimode fiber leads to roughly an order of magnitude enhancement in output\npower limited by SBS and TMI, compared to fundamental-mode-only excitation. We\nfind that the optimal mode content is robust to small perturbations and our\napproach works even in the presence of mode dependent loss and gain. Optimal\nmode content can be excited in real experiments using spatial light modulators,\ncreating a novel platform for instability-free ultrahigh-power fiber lasers.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"HH9FX1h037k54xhm4BAgNltdNtlC0s5j5CyFEnZmU6Y","pdfSize":"2376221"}
