{"id":"2407.06106","title":"Bridging abstract dialectical argumentation and Boolean gene regulation","authors":"Eugenio Azpeitia, Stan Mu\\~noz Guti\\'errez, David A. Rosenblueth,\n  Octavio Zapata","authorsParsed":[["Azpeitia","Eugenio",""],["Gutiérrez","Stan Muñoz",""],["Rosenblueth","David A.",""],["Zapata","Octavio",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 16:44:36 GMT"}],"updateDate":"2024-07-09","timestamp":1720457076000,"abstract":"  This paper leans on two similar areas so far detached from each other. On the\none hand, Dung's pioneering contributions to abstract argumentation, almost\nthirty years ago, gave rise to a plethora of successors, including abstract\ndialectical frameworks (ADFs). On the other hand, Boolean networks (BNs),\ndevised as models of gene regulation, have been successful for studying the\nbehavior of molecular processes within cells. ADFs and BNs are similar to each\nother: both can be viewed as functions from vectors of bits to vectors of bits.\nAs soon as similarities emerge between these two formalisms, however,\ndifferences appear. For example, conflict-freedom is prominent in argumentation\n(where we are interested in a self-consistent, i.e., conflict-free, set of\nbeliefs) but absent in BNs. By contrast, asynchrony (where only one gene is\nupdated at a time) is conspicuous in BNs and lacking in argumentation. Finally,\nwhile a monotonicity-based notion occurs in signed reasoning of both\nargumentation and gene regulation, a different, derivative-based notion only\nappears in the BN literature. To identify common mathematical structure between\nboth formalisms, these differences need clarification. This contribution is a\npartial review of both these areas, where we cover enough ground to exhibit\ntheir more evident similarities, to then reconcile some of their apparent\ndifferences. We highlight a range of avenues of research resulting from ironing\nout discrepancies between these two fields. Unveiling their common concerns\nshould enable these two areas to cross-fertilize so as to transfer ideas and\nresults between each other.\n","subjects":["Computing Research Repository/Logic in Computer Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"f0jxxCxYNY-r-ydroUYph13yEbzSTStGXHS7dD28l_Y","pdfSize":"668469"}
