{"id":"2407.17374","title":"Co-designing an AI Impact Assessment Report Template with AI\n  Practitioners and AI Compliance Experts","authors":"Edyta Bogucka, Marios Constantinides, Sanja \\v{S}\\'cepanovi\\'c,\n  Daniele Quercia","authorsParsed":[["Bogucka","Edyta",""],["Constantinides","Marios",""],["Šćepanović","Sanja",""],["Quercia","Daniele",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 15:53:04 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 22:11:48 GMT"}],"updateDate":"2024-08-05","timestamp":1721836384000,"abstract":"  In the evolving landscape of AI regulation, it is crucial for companies to\nconduct impact assessments and document their compliance through comprehensive\nreports. However, current reports lack grounding in regulations and often focus\non specific aspects like privacy in relation to AI systems, without addressing\nthe real-world uses of these systems. Moreover, there is no systematic effort\nto design and evaluate these reports with both AI practitioners and AI\ncompliance experts. To address this gap, we conducted an iterative co-design\nprocess with 14 AI practitioners and 6 AI compliance experts and proposed a\ntemplate for impact assessment reports grounded in the EU AI Act, NIST's AI\nRisk Management Framework, and ISO 42001 AI Management System. We evaluated the\ntemplate by producing an impact assessment report for an AI-based meeting\ncompanion at a major tech company. A user study with 8 AI practitioners from\nthe same company and 5 AI compliance experts from industry and academia\nrevealed that our template effectively provides necessary information for\nimpact assessments and documents the broad impacts of AI systems. Participants\nenvisioned using the template not only at the pre-deployment stage for\ncompliance but also as a tool to guide the design stage of AI uses.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RgZ3jl_-ZKQU_kaSGYdu98_DmUuFppJs5xP4qMTImS0","pdfSize":"13752614","objectId":"0xa7ee4119898cdb26d205fd59824a089d260facc3e0908fcca1f46dbc9a98f5e8","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
