{"id":"2407.15217","title":"Prediction of the treatment effect of FLASH radiotherapy with Circular\n  Electron-Positron Collider (CEPC) synchrotron radiation","authors":"Junyu Zhang, Xiangyu Wu, and Pengyuan Qi and Jike Wang","authorsParsed":[["Zhang","Junyu",""],["Wu","Xiangyu",""],["Qi","Pengyuan",""],["Wang","Jike",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 17:04:42 GMT"}],"updateDate":"2024-07-23","timestamp":1721581482000,"abstract":"  The Circular Electron-Positron Collider (CEPC) can also work as a powerful\nand excellent synchrotron light source, which can generate high-quality\nsynchrotron radiation. This synchrotron radiation has potential advantages in\nthe medical field, with a broad spectrum, with energies ranging from visible\nlight to x-rays used in conventional radiotherapy, up to several MeV. FLASH\nradiotherapy is one of the most advanced radiotherapy modalities. It is a\nradiotherapy method that uses ultra-high dose rate irradiation to achieve the\ntreatment dose in an instant; the ultra-high dose rate used is generally\ngreater than 40 Gy/s, and this type of radiotherapy can protect normal tissues\nwell. In this paper, the treatment effect of CEPC synchrotron radiation for\nFLASH radiotherapy was evaluated by simulation. First, Geant4 simulation was\nused to build a synchrotron radiation radiotherapy beamline station, and then\nthe dose rate that CEPC can produce was calculated. Then, a physicochemical\nmodel of radiotherapy response kinetics was established, and a large number of\nradiotherapy experimental data were comprehensively used to fit and determine\nthe functional relationship between the treatment effect, dose rate and dose.\nFinally, the macroscopic treatment effect of FLASH radiotherapy was predicted\nusing CEPC synchrotron radiation light through the dose rate and the\nabove-mentioned functional relationship. The results show that CEPC synchrotron\nradiation beam is one of the best beams for FLASH radiotherapy.\n","subjects":["Physics/Medical Physics","Physics/Accelerator Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JFyZmLYidA1eNKPUxLugXCT46Ahj8rQ7rMctN4eg2aY","pdfSize":"11472301","objectId":"0xe5382b964a43ecba0d4aa3f78625aee4d17bd5c799d69bafe376cedc2cacc31e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
