{"id":"2407.17410","title":"Strong Balmer break objects at z ~ 7-10 uncovered with JWST","authors":"A. Kuruvanthodi, D. Schaerer, R. Marques-Chaves, D. Korber, A. Weibel,\n  P. Oesch, G. Roberts-Borsani","authorsParsed":[["Kuruvanthodi","A.",""],["Schaerer","D.",""],["Marques-Chaves","R.",""],["Korber","D.",""],["Weibel","A.",""],["Oesch","P.",""],["Roberts-Borsani","G.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 16:44:37 GMT"}],"updateDate":"2024-07-25","timestamp":1721839477000,"abstract":"  We report the discovery of robust spectroscopically confirmed Balmer break\n(BB) galaxies and candidates, with secure spectroscopic redshifts $7.1 \\le z\n\\le 9.6$ from publicly available JWST extra-galactic photometric and\nspectroscopic surveys. To do so, we used dedicated filters probing the Balmer\nbreak and inspected the objects with NIRSpec spectroscopy. We recover the\npreviously known objects with strong Balmer breaks and reveal 10-11 new objects\nwith clear BBs, thus tripling the number of spectroscopically confirmed\ngalaxies with a BB at z >7. Approximately half of them show a pure BB and no\nsigns of recent star formation, whereas the other half shows BB and emission\nlines, indicating most likely galaxies whose star formation ceased earlier and\nhas restarted recently. Overall we find that ~10-20% of all galaxies from our\nsample show signatures of an evolved stellar population. Furthermore, we find\nthat the strength of the BB does not strongly depend on the rest-optical\nbrightness of these sources. In short, our work confirms that photometry alone\nhas the potential to measure BB strengths and to identify evolved stellar\npopulations at high redshift and that such objects may be more frequent than\npreviously thought.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PBlqQe6MMqV50TxoTXJylOuMVHdntDJVhCF-3gqlERY","pdfSize":"3343065","objectId":"0xf2f09b491bc22145b3f2089bc6ddd8cde58b05a5476f60dd5acb2d07f76359f0","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
