{"id":"2407.07501","title":"Electronic Correlation and Pseudogap-like Behavior of High-Temperature\n  Superconductor La3Ni2O7","authors":"Yidian Li, Xian Du, Yantao Cao, Cuiying Pei, Mingxin Zhang, Wenxuan\n  Zhao, Kaiyi Zhai, Runzhe Xu, Zhongkai Liu, Zhiwei Li, Jinkui Zhao, Gang Li,\n  Yanpeng Qi, Hanjie Guo, Yulin Chen, and Lexian Yang","authorsParsed":[["Li","Yidian",""],["Du","Xian",""],["Cao","Yantao",""],["Pei","Cuiying",""],["Zhang","Mingxin",""],["Zhao","Wenxuan",""],["Zhai","Kaiyi",""],["Xu","Runzhe",""],["Liu","Zhongkai",""],["Li","Zhiwei",""],["Zhao","Jinkui",""],["Li","Gang",""],["Qi","Yanpeng",""],["Guo","Hanjie",""],["Chen","Yulin",""],["Yang","Lexian",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 09:39:21 GMT"}],"updateDate":"2024-07-11","timestamp":1720604361000,"abstract":"  High-temperature superconductivity (HTSC) remains one of the most challenging\nand fascinating mysteries in condensed matter physics. Recently,\nsuperconductivity with transition temperature exceeding liquid-nitrogen\ntemperature is discovered in La3Ni2O7 at high pressure, which provides a new\nplatform to explore the unconventional HTSC. In this work, using\nhigh-resolution angle-resolved photoemission spectroscopy and ab-initio\ncalculation, we systematically investigate the electronic structures of\nLa3Ni2O7 at ambient pressure. Our experiments are in nice agreement with\nab-initio calculations after considering an orbital-dependent band\nrenormalization effect. The strong electron correlation effect pushes a flat\nband of d_(z^2 ) orbital component below the Fermi level (EF), which is\npredicted to locate right at EF under high pressure. Moreover, the d_(x^2-y^2 )\nband shows a pseudogap-like behavior with suppressed spectral weight and\ndiminished quasiparticle peak near EF. Our findings provide important insights\ninto the electronic structure of La3Ni2O7, which will shed light on the\nunderstanding of the unconventional superconductivity in nickelates.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"K35zw3tMf_zxwtVSh2y9NN9TIxCV1CcuT0dwBP5KdD0","pdfSize":"437171","objectId":"0x5affc12b23e7fffff98561963072493bbdfbf047922b6c207400773f7594ddf0","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
