{"id":"2407.01728","title":"Early stages of gap opening by planets in protoplanetary discs","authors":"Amelia J. Cordwell, Roman R. Rafikov","authorsParsed":[["Cordwell","Amelia J.",""],["Rafikov","Roman R.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 19:01:20 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 16:50:51 GMT"}],"updateDate":"2024-09-04","timestamp":1719860480000,"abstract":"  Annular substructures in protoplanetary discs, ubiquitous in sub-mm\nobservations, can be caused by gravitational coupling between a disc and its\nembedded planets. Planetary density waves inject angular momentum into the disc\nleading to gap opening only after travelling some distance and steepening into\nshocks (in the absence of linear damping); no angular momentum is deposited in\nthe planetary coorbital region, where the wave has not shocked yet. Despite\nthat, simulations show mass evacuation from the coorbital region even in\ninviscid discs, leading to smooth, double-trough gap profiles. Here we consider\nthe early, time-dependent stages of planetary gap opening in inviscid discs. We\nfind that an often-overlooked contribution to the angular momentum balance\ncaused by the time-variability of the specific angular momentum of the disc\nfluid (caused, in turn, by the time-variability of the radial pressure support)\nplays a key role in gap opening. Focusing on the regime of shallow gaps with\ndepths of $\\lesssim 20\\%$, we demonstrate analytically that early gap opening\nis a self-similar process, with the amplitude of the planet-driven perturbation\ngrowing linearly in time and the radial gap profile that can be computed\nsemi-analytically. We show that mass indeed gets evacuated from the coorbital\nregion even in inviscid discs. This evolution pattern holds even in viscous\ndiscs over a limited period of time. These results are found to be in excellent\nagreement with 2D numerical simulations. Our simple gap evolution solutions can\nbe used in studies of dust dynamics near planets and for interpreting\nprotoplanetary disc observations.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"CjY8vgNzpoEScKdl-azPuraTjFEWIeEKo-UswohpNxI","pdfSize":"1336339","objectId":"0x7c27e7989dba59949c3577092222a07681131c1198e6afe63d756213cb2dac45","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
