{"id":"2407.14352","title":"Vision-Based Power Line Cables and Pylons Detection for Low Flying\n  Aircraft","authors":"Jakub Gwizda{\\l}a, Doruk Oner, Soumava Kumar Roy, Mian Akbar Shah, Ad\n  Eberhard, Ivan Egorov, Philipp Kr\\\"usi, Grigory Yakushev, Pascal Fua","authorsParsed":[["Gwizdała","Jakub",""],["Oner","Doruk",""],["Roy","Soumava Kumar",""],["Shah","Mian Akbar",""],["Eberhard","Ad",""],["Egorov","Ivan",""],["Krüsi","Philipp",""],["Yakushev","Grigory",""],["Fua","Pascal",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 14:34:25 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 11:20:59 GMT"},{"version":"v3","created":"Tue, 30 Jul 2024 09:01:26 GMT"}],"updateDate":"2024-07-31","timestamp":1721399665000,"abstract":"  Power lines are dangerous for low-flying aircraft, especially in\nlow-visibility conditions. Thus, a vision-based system able to analyze the\naircraft's surroundings and to provide the pilots with a \"second pair of eyes\"\ncan contribute to enhancing their safety. To this end, we have developed a deep\nlearning approach to jointly detect power line cables and pylons from images\ncaptured at distances of several hundred meters by aircraft-mounted cameras. In\ndoing so, we have combined a modern convolutional architecture with transfer\nlearning and a loss function adapted to curvilinear structure delineation. We\nuse a single network for both detection tasks and demonstrated its performance\non two benchmarking datasets. We have integrated it within an onboard system\nand run it in flight, and have demonstrated with our experiments that it\noutperforms the prior distant cable detection method on both datasets, while\nalso successfully detecting pylons, given their annotations are available for\nthe data.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wwY0-JYz4X8es5dSgg8BHv9HuQBUZ6zZSS6_S0lEnks","pdfSize":"2093825","objectId":"0xef2f981319ab2c6ced8f3a3ff05f06980ccc8886a5c91bda8011418aa53b9704","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
