{"id":"2407.18847","title":"Enhancing material property prediction with ensemble deep graph\n  convolutional networks","authors":"Chowdhury Mohammad Abid Rahman, Ghadendra Bhandari, Nasser M\n  Nasrabadi, Aldo H. Romero and Prashnna K. Gyawali","authorsParsed":[["Rahman","Chowdhury Mohammad Abid",""],["Bhandari","Ghadendra",""],["Nasrabadi","Nasser M",""],["Romero","Aldo H.",""],["Gyawali","Prashnna K.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 16:12:06 GMT"}],"updateDate":"2024-07-29","timestamp":1722010326000,"abstract":"  Machine learning (ML) models have emerged as powerful tools for accelerating\nmaterials discovery and design by enabling accurate predictions of properties\nfrom compositional and structural data. These capabilities are vital for\ndeveloping advanced technologies across fields such as energy, electronics, and\nbiomedicine, potentially reducing the time and resources needed for new\nmaterial exploration and promoting rapid innovation cycles. Recent efforts have\nfocused on employing advanced ML algorithms, including deep learning - based\ngraph neural network, for property prediction. Additionally, ensemble models\nhave proven to enhance the generalizability and robustness of ML and DL.\nHowever, the use of such ensemble strategies in deep graph networks for\nmaterial property prediction remains underexplored. Our research provides an\nin-depth evaluation of ensemble strategies in deep learning - based graph\nneural network, specifically targeting material property prediction tasks. By\ntesting the Crystal Graph Convolutional Neural Network (CGCNN) and its\nmultitask version, MT-CGCNN, we demonstrated that ensemble techniques,\nespecially prediction averaging, substantially improve precision beyond\ntraditional metrics for key properties like formation energy per atom ($\\Delta\nE^{f}$), band gap ($E_{g}$) and density ($\\rho$) in 33,990 stable inorganic\nmaterials. These findings support the broader application of ensemble methods\nto enhance predictive accuracy in the field.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qJqyKGSu06dfZiXYEmL4AU5pEeHgG7aBK5oD590l48I","pdfSize":"11657585","objectId":"0x359a83d1e9f43e0919bfb2a665f7cc22b030e35eeb34ac623f13da56ab1ff975","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
