{"id":"2407.04900","title":"Closing the Gaps: Optimality of Sample Average Approximation for\n  Data-Driven Newsvendor Problems","authors":"Jiameng Lyu, Shilin Yuan, Bingkun Zhou, Yuan Zhou","authorsParsed":[["Lyu","Jiameng",""],["Yuan","Shilin",""],["Zhou","Bingkun",""],["Zhou","Yuan",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 00:30:06 GMT"}],"updateDate":"2024-07-09","timestamp":1720225806000,"abstract":"  We study the regret performance of Sample Average Approximation (SAA) for\ndata-driven newsvendor problems with general convex inventory costs. In\nliterature, the optimality of SAA has not been fully established under both\n\\alpha-global strong convexity and (\\alpha,\\beta)-local strong convexity\n(\\alpha-strongly convex within the \\beta-neighborhood of the optimal quantity)\nconditions. This paper closes the gaps between regret upper and lower bounds\nfor both conditions. Under the (\\alpha,\\beta)-local strong convexity condition,\nwe prove the optimal regret bound of \\Theta(\\log T/\\alpha + 1/ (\\alpha\\beta))\nfor SAA. This upper bound result demonstrates that the regret performance of\nSAA is only influenced by \\alpha and not by \\beta in the long run, enhancing\nour understanding about how local properties affect the long-term regret\nperformance of decision-making strategies. Under the \\alpha-global strong\nconvexity condition, we demonstrate that the worst-case regret of any\ndata-driven method is lower bounded by \\Omega(\\log T/\\alpha), which is the\nfirst lower bound result that matches the existing upper bound with respect to\nboth parameter \\alpha and time horizon T. Along the way, we propose to analyze\nthe SAA regret via a new gradient approximation technique, as well as a new\nclass of smooth inverted-hat-shaped hard problem instances that might be of\nindependent interest for the lower bounds of broader data-driven problems.\n","subjects":["Computing Research Repository/Machine Learning","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"8i21rh-ifM1lDQFxQJpNkeF-SXaZTIFzXnweeDklfh0","pdfSize":"1186699"}
