{"id":"2407.03789","title":"Preliminary results of the Single Event Effect testing for the ULTRASAT\n  sensors","authors":"Vlad Dumitru Berlea and Arooj Asif and Merlin F. Barschke and David\n  Berge and Juan Maria Haces Crespo and Gianluca Giavitto and Shashank Kumar\n  and Andrea Porelli and Nicola de Simone and Jason Watson and Steven Worm and\n  Francesco Zappon and Adi Birman and Shay Alfassi and Amos Feningstein and Eli\n  Waxman and Udi Netzer and Tuvia Liran and Ofer Lapid and Viktor M. Algranatti\n  and Yossi Schvartzvald","authorsParsed":[["Berlea","Vlad Dumitru",""],["Asif","Arooj",""],["Barschke","Merlin F.",""],["Berge","David",""],["Crespo","Juan Maria Haces",""],["Giavitto","Gianluca",""],["Kumar","Shashank",""],["Porelli","Andrea",""],["de Simone","Nicola",""],["Watson","Jason",""],["Worm","Steven",""],["Zappon","Francesco",""],["Birman","Adi",""],["Alfassi","Shay",""],["Feningstein","Amos",""],["Waxman","Eli",""],["Netzer","Udi",""],["Liran","Tuvia",""],["Lapid","Ofer",""],["Algranatti","Viktor M.",""],["Schvartzvald","Yossi",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 09:54:41 GMT"}],"updateDate":"2024-07-08","timestamp":1720086881000,"abstract":"  ULTRASAT (ULtra-violet TRansient Astronomy SATellite) is a wide-angle space\ntelescope that will perform a deep time-resolved all-sky survey in the\nnear-ultraviolet (NUV) spectrum. The science objectives are the detection of\ncounterparts to short-lived transient astronomical events such as gravitational\nwave sources and supernovae. The mission is led by the Weizmann Institute of\nScience and is planned for launch in 2026 in collaboration with the Israeli\nSpace Agency and NASA. DESY will provide the UV camera, composed by the\ndetector assembly located in the telescope focal plane and the remote\nelectronics unit. The camera is composed out of four back-metallized CMOS Image\nSensors (CIS) manufactured in the 4T, dual gain Tower process. As part of the\nradiation qualification of the camera, Single Event Effect (SEE) testing has\nbeen performed by irradiating the sensor with heavy ions at the RADEF,\nJyvaskyla facility. Preliminary results of both Single Event Upset (SEU) and\nSingle Event Latch-up (SEL) occurrence rate in the sensor are presented.\nAdditionally, an in-orbit SEE rate simulation has been performed in order to\ngain preliminary knowledge about the expected effect of SEE on the mission.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iTmtIylJKl5OgM0HWhQ0C1UEnM4iu075qsppaYVlOPw","pdfSize":"446444"}
