{"id":"2407.20763","title":"Toward Wireless Localization Using Multiple Reconfigurable Intelligent\n  Surfaces","authors":"Fuhai Wang, Tiebin Mi, Chun Wang, Rujing Xiong, Zhengyu Wang, Robert\n  Caiming Qiu","authorsParsed":[["Wang","Fuhai",""],["Mi","Tiebin",""],["Wang","Chun",""],["Xiong","Rujing",""],["Wang","Zhengyu",""],["Qiu","Robert Caiming",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 12:08:16 GMT"}],"updateDate":"2024-07-31","timestamp":1722341296000,"abstract":"  This paper investigates the capabilities and effectiveness of backward\nsensing centered on reconfigurable intelligent surfaces (RISs). We demonstrate\nthat the direction of arrival (DoA) estimation of incident waves in the\nfar-field regime can be accomplished using a single RIS by leveraging\nconfigurational diversity. Furthermore, we identify that the spatial diversity\nachieved through deploying multiple RISs enables accurate localization of\nmultiple power sources. Physically accurate and mathematically concise models\nare introduced to characterize forward signal aggregations via RISs. By\nemploying linearized approximations inherent in the far-field region, the\nmeasurement process for various configurations can be expressed as a system of\nlinear equations. The mathematical essence of backward sensing lies in solving\nthis system. A theoretical framework for determining key performance indicators\nis established through condition number analysis of the sensing operators. In\nthe context of localization using multiple RISs, we examine relationships among\nthe rank of sensing operators, the size of the region of interest (RoI), and\nthe number of elements and measurements. For DoA estimations, we provide an\nupper bound for the relative error of the least squares reconstruction\nalgorithm. These quantitative analyses offer essential insights for system\ndesign and optimization. Numerical experiments validate our findings. To\ndemonstrate the practicality of our proposed RIS-centric sensing approach, we\ndevelop a proof-of-concept prototype using universal software radio peripherals\n(USRP) and employ a magnitude-only reconstruction algorithm tailored for this\nsystem. To our knowledge, this represents the first trial of its kind.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"G_QWVqIbVCHPElFZG_5v8n-Qlxk7ekpfVwM8eT-4R5k","pdfSize":"6426911","objectId":"0xe2617742d884f0bf81e976c1f724696d7ccc9c631035851996c434ec8d5bac85","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
