{"id":"2407.05331","title":"Channel Characterization of IRS-assisted Resonant Beam Communication\n  Systems","authors":"Wen Fang, Wen Chen, Qingqing Wu, Xusheng Zhu, Qiong Wu, Nan Cheng","authorsParsed":[["Fang","Wen",""],["Chen","Wen",""],["Wu","Qingqing",""],["Zhu","Xusheng",""],["Wu","Qiong",""],["Cheng","Nan",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 11:15:22 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 04:32:36 GMT"}],"updateDate":"2024-08-16","timestamp":1720350922000,"abstract":"  To meet the growing demand for data traffic, spectrum-rich optical wireless\ncommunication (OWC) has emerged as a key technological driver for the\ndevelopment of 6G. The resonant beam communication (RBC) system, which employs\nspatially separated laser cavities as the transmitter and receiver, is a\nhigh-speed OWC technology capable of self-alignment without tracking. However,\nits transmission through the air is susceptible to losses caused by\nobstructions. In this paper, we propose an intelligent reflecting surface (IRS)\nassisted RBC system with the optical frequency doubling method, where the\nresonant beam in frequency-fundamental and frequency-doubled is transmitted\nthrough both direct line-of-sight (LoS) and IRS-assisted channels to maintain\nsteady-state oscillation and enable communication without echo-interference,\nrespectively. Then, we establish the channel model based on Fresnel diffraction\ntheory under the near-field optical propagation to analyze the transmission\nloss and frequency-doubled power analytically. Furthermore, communication power\ncan be maximized by dynamically controlling the beam-splitting ratio between\nthe two channels according to the loss levels encountered over air. Numerical\nresults validate that the IRS-assisted channel can compensate for the losses in\nthe obstructed LoS channel and misaligned receivers, ensuring that\ncommunication performance reaches an optimal value with dynamic ratio\nadjustments.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mMctkhYwZLgAmkY-xkNofF_JkJaw5vzjXDh-6Q9VFYc","pdfSize":"1296666"}
