{"id":"2407.11024","title":"A mathematical framework of intelligence and consciousness based on\n  Riemannian Geometry","authors":"Meng Lu","authorsParsed":[["Lu","Meng",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 04:17:56 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 06:38:23 GMT"},{"version":"v3","created":"Fri, 30 Aug 2024 07:38:41 GMT"}],"updateDate":"2024-09-02","timestamp":1719893876000,"abstract":"  Understanding intelligence is a central pursuit in neuroscience, cognitive\nscience, and artificial intelligence. Intelligence encompasses learning,\nproblem-solving, creativity, and even consciousness. Recent advancements in\ngeometric analysis have revealed new insights into high-dimensional information\nrepresentation and organisation, exposing intrinsic data structures and dynamic\nprocesses within neural and artificial systems. However, a comprehensive\nframework that unifies the static and dynamic aspects of intelligence is still\nlacking. This manuscript proposes a mathematical framework based on Riemannian\ngeometry to describe the structure and dynamics of intelligence and\nconsciousness. Intelligence elements are conceptualised as tokens embedded in a\nhigh-dimensional space. The learned token embeddings capture the\ninterconnections of tokens across various scenarios and tasks, forming\nmanifolds in the intelligence space. Thought flow is depicted as the sequential\nactivation of tokens along geodesics within these manifolds. During the\nnavigation of geodesics, consciousness, as a self-referential process,\nperceives the thought flow, evaluates it against predictions, and provides\nfeedback through prediction errors, adjusting the geodesic: non-zero prediction\nerrors, such as learning, lead to the restructuring of the curved manifolds,\nthus changing the geodesic of thought flow. This dynamic interaction integrates\nnew information, evolves the geometry and facilitates learning. The geometry of\nintelligence guides consciousness, and consciousness structures the geometry of\nintelligence. By integrating geometric concepts, this proposed theory offers a\nunified, mathematically framework for describing the structure and dynamics of\nintelligence and consciousness. Applicable to biological and artificial\nintelligence, this framework may pave the way for future research and empirical\nvalidation.\n","subjects":["Computing Research Repository/Artificial Intelligence","Mathematics/Differential Geometry"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QnwZpWvvcrh-gE-7HBYnLkM-uy8rkcthG6CwF29LB4Y","pdfSize":"544361","objectId":"0x08e1314234727b2d9ef7ada178f299bc9d06187392bdd01bb25fa93c7d751088","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
