{"id":"2407.16539","title":"Enhancing Encrypted Internet Traffic Classification Through Advanced\n  Data Augmentation Techniques","authors":"Yehonatan Zion, Porat Aharon, Ran Dubin, Amit Dvir, Chen Hajaj","authorsParsed":[["Zion","Yehonatan",""],["Aharon","Porat",""],["Dubin","Ran",""],["Dvir","Amit",""],["Hajaj","Chen",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:49:17 GMT"}],"updateDate":"2024-07-24","timestamp":1721746157000,"abstract":"  The increasing popularity of online services has made Internet Traffic\nClassification a critical field of study. However, the rapid development of\ninternet protocols and encryption limits usable data availability. This paper\naddresses the challenges of classifying encrypted internet traffic, focusing on\nthe scarcity of open-source datasets and limitations of existing ones. We\npropose two Data Augmentation (DA) techniques to synthetically generate data\nbased on real samples: Average augmentation and MTU augmentation. Both\naugmentations are aimed to improve the performance of the classifier, each from\na different perspective: The Average augmentation aims to increase dataset size\nby generating new synthetic samples, while the MTU augmentation enhances\nclassifier robustness to varying Maximum Transmission Units (MTUs). Our\nexperiments, conducted on two well-known academic datasets and a commercial\ndataset, demonstrate the effectiveness of these approaches in improving model\nperformance and mitigating constraints associated with limited and homogeneous\ndatasets. Our findings underscore the potential of data augmentation in\naddressing the challenges of modern internet traffic classification.\nSpecifically, we show that our augmentation techniques significantly enhance\nencrypted traffic classification models. This improvement can positively impact\nuser Quality of Experience (QoE) by more accurately classifying traffic as\nvideo streaming (e.g., YouTube) or chat (e.g., Google Chat). Additionally, it\ncan enhance Quality of Service (QoS) for file downloading activities (e.g.,\nGoogle Docs).\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"kOPYfc3pYlmB-008do3K4ZIkxB1i1tpF4vf0sNlYAKQ","pdfSize":"290295","objectId":"0x4f652e055d2e026e8be4f6a858e35c7be256a2ab3677c65a2ad9ec9761e1438d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
