{"id":"2407.01295","title":"Formal Verification of Object Detection","authors":"Avraham Raviv, Yizhak Y. Elboher, Michelle Aluf-Medina, Yael Leibovich\n  Weiss, Omer Cohen, Roy Assa, Guy Katz and Hillel Kugler","authorsParsed":[["Raviv","Avraham",""],["Elboher","Yizhak Y.",""],["Aluf-Medina","Michelle",""],["Weiss","Yael Leibovich",""],["Cohen","Omer",""],["Assa","Roy",""],["Katz","Guy",""],["Kugler","Hillel",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:47:54 GMT"},{"version":"v2","created":"Mon, 8 Jul 2024 12:56:26 GMT"},{"version":"v3","created":"Wed, 10 Jul 2024 07:33:58 GMT"},{"version":"v4","created":"Mon, 15 Jul 2024 09:41:06 GMT"}],"updateDate":"2024-07-16","timestamp":1719841674000,"abstract":"  Deep Neural Networks (DNNs) are ubiquitous in real-world applications, yet\nthey remain vulnerable to errors and adversarial attacks. This work tackles the\nchallenge of applying formal verification to ensure the safety of computer\nvision models, extending verification beyond image classification to object\ndetection. We propose a general formulation for certifying the robustness of\nobject detection models using formal verification and outline implementation\nstrategies compatible with state-of-the-art verification tools. Our approach\nenables the application of these tools, originally designed for verifying\nclassification models, to object detection. We define various attacks for\nobject detection, illustrating the diverse ways adversarial inputs can\ncompromise neural network outputs. Our experiments, conducted on several common\ndatasets and networks, reveal potential errors in object detection models,\nhighlighting system vulnerabilities and emphasizing the need for expanding\nformal verification to these new domains. This work paves the way for further\nresearch in integrating formal verification across a broader range of computer\nvision applications.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"y5g28bWFfHfxIzrY8KB8dmi8JuwAE7iaqWxu5L9_4tE","pdfSize":"5072457","objectId":"0x499b498fc8606f8e86784ef2534045d26bdf4d82b33d73ae99ee7bbbcb8f20ee","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
