{"id":"2407.07155","title":"Across the soft gamma-ray regime: utilizing simultaneous detections in\n  the Compton Spectrometer and Imager (COSI) and the Background and Transient\n  Observer (BTO) to understand astrophysical transients","authors":"Hannah C. Gulick, Eliza Neights, Samer Al Nussirat, Claire Tianyi\n  Chen, Kaylie Ching, Cassandra Dove, Alyson Joens, Carolyn Kierans, Hubert\n  Liu, Israel Martinez, Tomas Mician, Shunsaku Nagasawa, Shreya Nandyala,\n  Isabel Schmidtke, Derek Shah, Andreas Zoglauer, Kazuhiro Nakasawa, Tadayuki\n  Takahashi, Juan-Carlos Martinez Oliveros, John A. Tomsick","authorsParsed":[["Gulick","Hannah C.",""],["Neights","Eliza",""],["Nussirat","Samer Al",""],["Chen","Claire Tianyi",""],["Ching","Kaylie",""],["Dove","Cassandra",""],["Joens","Alyson",""],["Kierans","Carolyn",""],["Liu","Hubert",""],["Martinez","Israel",""],["Mician","Tomas",""],["Nagasawa","Shunsaku",""],["Nandyala","Shreya",""],["Schmidtke","Isabel",""],["Shah","Derek",""],["Zoglauer","Andreas",""],["Nakasawa","Kazuhiro",""],["Takahashi","Tadayuki",""],["Oliveros","Juan-Carlos Martinez",""],["Tomsick","John A.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 18:00:07 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 22:49:15 GMT"}],"updateDate":"2024-08-30","timestamp":1720548007000,"abstract":"  The Compton Spectrometer and Imager (COSI) is a NASA funded Small Explorer\n(SMEX) mission slated to launch in 2027. COSI will house a wide-field gamma-ray\ntelescope designed to survey the entire sky in the 0.2--5 MeV range. Using\ngermanium detectors, the instrument will provide imaging, spectroscopy, and\npolarimetry of astrophysical sources with excellent energy resolution and\ndegree-scale localization capabilities. In addition to the main instrument,\nCOSI will fly with a student collaboration project known as the Background and\nTransient Observer (BTO). BTO will extend the COSI bandpass to energies lower\nthan 200 keV, thus enabling spectral analysis across the shared band of 30\nkeV--2 MeV range. The BTO instrument will consist of two NaI scintillators and\nstudent-designed readout electronics. Using spectral information from both the\nCOSI and BTO instruments, physics such as the energy peak turnover in gamma-ray\nbursts, the characteristics of magnetar flares, and the event frequency of a\nrange of transient phenomena will be constrained. In this paper, we present the\nexpected science returnables from BTO and comment on the shared returnables\nfrom the COSI and BTO missions. We include simulations of gamma-ray bursts,\nmagnetar giant flares, and terrestrial gamma-ray flashes using BTO's spectral\nresponse. Additionally, we estimate BTO's gamma-ray burst detection rate and\nfind that BTO will detect ~150 gamma-ray bursts per year, with most of these\nevents being long bursts.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"V31nYdkWmj-qFaYThxYKh5cZTGqEOiQNGJOUMFl1KFU","pdfSize":"1163913"}
