{"id":"2407.19945","title":"Julian Hirniak, an early proponent of periodic chemical reaction","authors":"Niklas Manz, Yurij Holovatch, John Tyson","authorsParsed":[["Manz","Niklas",""],["Holovatch","Yurij",""],["Tyson","John",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 12:27:36 GMT"}],"updateDate":"2024-07-30","timestamp":1722256056000,"abstract":"  In this article we present and discuss the work and scientific legacy of\nJulian Hirniak, the Ukrainian chemist and physicist who published two articles\nin 1908 and 1911 about periodic chemical reactions. Over the last 110+ years,\nhis theoretical work has often been cited favorably in connection with Alfred\nLotka's theoretical model of an oscillating reaction system. Other authors have\npointed out thermodynamic problems in Hirniak's reaction scheme. Based on\nEnglish translations of his 1908 Ukrainian and 1911 German articles, we show\nthat Hirniak's claim (that a cycle of inter-conversions of three chemical\nisomers in a closed reaction vessel can show damped periodic behavior) violates\nthe \\textit{Principle of Detailed Balance} (i.e., the Second Law of\nThermodynamics), and that Hirniak was aware of this Principle. We also discuss\nhis results in relation to Lotka's first model of damped oscillations in an\nopen system of chemical reactions involving an auto-catalytic reaction\noperating far from equilibrium. Taking hints from both Hirniak and Lotka, we\nshow that the mundane case of a kinase enzyme catalyzing the phosphorylation of\na sugar can satisfy Hirniak's conditions for damped oscillations to its steady\nstate flux (i.e., the Michaelis--Menten rate law), but that the oscillations\nare so highly damped as to be unobservable. Finally, we examine historical and\nfactual misunderstandings related to Julian Hirniak and his publications.\n","subjects":["Physics/History and Philosophy of Physics","Condensed Matter/Statistical Mechanics","Physics/Biological Physics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"JBbZ7HLYCjqw68zXATCUDwsNZUp680Kg7azVsfZHIgw","pdfSize":"78051113","objectId":"0x05d4aa3fc5565013e57b0ee439380b360bd18d86ebd8552b562451005880fcc1","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
