{"id":"2407.20103","title":"What Can Interactive Visualization do for Participatory Budgeting in\n  Chicago?","authors":"Alex Kale, Danni Liu, Maria Gabriela Ayala, Harper Schwab, Andrew\n  McNutt","authorsParsed":[["Kale","Alex",""],["Liu","Danni",""],["Ayala","Maria Gabriela",""],["Schwab","Harper",""],["McNutt","Andrew",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:31:29 GMT"}],"updateDate":"2024-07-30","timestamp":1722267089000,"abstract":"  Participatory budgeting (PB) is a democratic approach to allocating municipal\nspending that has been adopted in many places in recent years, including in\nChicago. Current PB voting resembles a ballot where residents are asked which\nmunicipal projects, such as school improvements and road repairs, to fund with\na limited budget. In this work, we ask how interactive visualization can\nbenefit PB by conducting a design probe-based interview study (N=13) with\npolicy workers and academics with expertise in PB, urban planning, and civic\nHCI. Our probe explores how graphical elicitation of voter preferences and a\ndashboard of voting statistics can be incorporated into a realistic PB tool.\nThrough qualitative analysis, we find that visualization creates opportunities\nfor city government to set expectations about budget constraints while also\ngranting their constituents greater freedom to articulate a wider range of\npreferences. However, using visualization to provide transparency about PB\nrequires efforts to mitigate potential access barriers and mistrust. We call\nfor more visualization professionals to help build civic capacity by working in\nand studying political systems.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BG1zzJMHUv909LZLXqqModlkubsE_umyPJQkbDq6rgI","pdfSize":"8381103","objectId":"0x919db7224891392cabdead196e3f15a4ab856af7fcf3edf7a3cb1d78d26d3c5e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
