{"id":"2407.10040","title":"Lean-STaR: Learning to Interleave Thinking and Proving","authors":"Haohan Lin, Zhiqing Sun, Yiming Yang, Sean Welleck","authorsParsed":[["Lin","Haohan",""],["Sun","Zhiqing",""],["Yang","Yiming",""],["Welleck","Sean",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 01:43:07 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 04:53:11 GMT"},{"version":"v3","created":"Thu, 8 Aug 2024 23:42:46 GMT"}],"updateDate":"2024-08-12","timestamp":1720921387000,"abstract":"  Traditional language model-based theorem proving assumes that by training on\na sufficient amount of formal proof data, a model will learn to prove theorems.\nOur key observation is that a wealth of informal information that is not\npresent in formal proofs can be useful for learning to prove theorems. For\ninstance, humans think through steps of a proof, but this thought process is\nnot visible in the resulting code. We present Lean-STaR, a framework for\ntraining language models to produce informal thoughts prior to each step of a\nproof, thereby boosting the model's theorem-proving capabilities. Lean-STaR\nuses retrospective ground-truth tactics to generate synthetic thoughts for\ntraining the language model. At inference time, the trained model directly\ngenerates the thoughts prior to the prediction of the tactics in each proof\nstep. Building on the self-taught reasoner framework, we then apply expert\niteration to further fine-tune the model on the correct proofs it samples and\nverifies using the Lean solver. Lean-STaR achieves state-of-the-art results on\nthe miniF2F-test benchmark within the Lean theorem proving environment,\nsignificantly outperforming base models ($\\boldsymbol{43.4\\% \\rightarrow\n46.3\\%,}$ Pass@64). We also analyze the impact of the augmented thoughts on\nvarious aspects of the theorem proving process, providing insights into their\neffectiveness.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xBKcBXOUYACYMMbIE730oh6iMfJjEgmfo3-TH2nHFmM","pdfSize":"4029906","objectId":"0x188a563bde3581da49f99b08ce504670d0ae9da0fe19ee6cfd97df26a26eae38","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
