{"id":"2407.03132","title":"Speaker- and Text-Independent Estimation of Articulatory Movements and\n  Phoneme Alignments from Speech","authors":"Tobias Weise, Philipp Klumpp, Kubilay Can Demir, Paula Andrea\n  P\\'erez-Toro, Maria Schuster, Elmar Noeth, Bjoern Heismann, Andreas Maier,\n  Seung Hee Yang","authorsParsed":[["Weise","Tobias",""],["Klumpp","Philipp",""],["Demir","Kubilay Can",""],["Pérez-Toro","Paula Andrea",""],["Schuster","Maria",""],["Noeth","Elmar",""],["Heismann","Bjoern",""],["Maier","Andreas",""],["Yang","Seung Hee",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 14:13:04 GMT"}],"updateDate":"2024-07-04","timestamp":1720015984000,"abstract":"  This paper introduces a novel combination of two tasks, previously treated\nseparately: acoustic-to-articulatory speech inversion (AAI) and\nphoneme-to-articulatory (PTA) motion estimation. We refer to this joint task as\nacoustic phoneme-to-articulatory speech inversion (APTAI) and explore two\ndifferent approaches, both working speaker- and text-independently during\ninference. We use a multi-task learning setup, with the end-to-end goal of\ntaking raw speech as input and estimating the corresponding articulatory\nmovements, phoneme sequence, and phoneme alignment. While both proposed\napproaches share these same requirements, they differ in their way of achieving\nphoneme-related predictions: one is based on frame classification, the other on\na two-staged training procedure and forced alignment. We reach competitive\nperformance of 0.73 mean correlation for the AAI task and achieve up to\napproximately 87% frame overlap compared to a state-of-the-art text-dependent\nphoneme force aligner.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0VUhzobJW9JXhrDUEcWvwCqcljwJuGyO9KatmgU_qhg","pdfSize":"1279252"}
