{"id":"2407.15652","title":"Utilizing probabilistic entanglement between sensors in quantum networks","authors":"Emily A. Van Milligen, Christos N. Gagatsos, Eneet Kaur, Don Towsley,\n  Saikat Guha","authorsParsed":[["Van Milligen","Emily A.",""],["Gagatsos","Christos N.",""],["Kaur","Eneet",""],["Towsley","Don",""],["Guha","Saikat",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:12:30 GMT"}],"updateDate":"2024-07-23","timestamp":1721657550000,"abstract":"  One of the most promising applications of quantum networks is entanglement\nassisted sensing. The field of quantum metrology exploits quantum correlations\nto improve the precision bound for applications such as precision timekeeping,\nfield sensing, and biological imaging. When measuring multiple spatially\ndistributed parameters, current literature focuses on quantum entanglement in\nthe discrete variable case, and quantum squeezing in the continuous variable\ncase, distributed amongst all of the sensors in a given network. However, it\ncan be difficult to ensure all sensors pre-share entanglement of sufficiently\nhigh fidelity. This work probes the space between fully entangled and fully\nclassical sensing networks by modeling a star network with probabilistic\nentanglement generation that is attempting to estimate the average of local\nparameters. The quantum Fisher information is used to determine which protocols\nbest utilize entanglement as a resource for different network conditions. It is\nshown that without entanglement distillation there is a threshold fidelity\nbelow which classical sensing is preferable. For a network with a given number\nof sensors and links characterized by a certain initial fidelity and\nprobability of success, this work outlines when and how to use entanglement,\nwhen to store it, and when it needs to be distilled.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8doviaTAOygjb3VJzr71gNut7OYgWNlEMXr5TqnGE4c","pdfSize":"7564261","objectId":"0x6d84ea3adbece6cd956907d230c35a95e67d70b01312c5c678ea50903d8219b4","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
