{"id":"2407.15263","title":"Crystalline forsterite to 160 GPa: the striking metastability of one of\n  Universe's most abundant minerals","authors":"Barbara Lavina, Minta C. Akin, Yue Meng, Vitali Prakapenka","authorsParsed":[["Lavina","Barbara",""],["Akin","Minta C.",""],["Meng","Yue",""],["Prakapenka","Vitali",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 20:34:31 GMT"}],"updateDate":"2024-07-23","timestamp":1721594071000,"abstract":"  Among Universe's most consequential events are large impacts generating\nrapidly-evolving extreme pressures and temperatures. Crystalline and amorphous\nforms of (Mg, Fe)2SiO4 are abundant and widespread, within planets and in\nspace. The behavior of these minerals is expected to deviate form thermodynamic\nequilibrium in many of the processes that are critical to the formation and\nevolution of planets, particularly shock events. To further the understanding\nof the behavior of the silicate under extreme conditions, we statically\ncompressed a crystal of forsterite up to 160.5 GPa, far beyond the compound's\nstability field, and probed its long-range ordering with synchrotron\nmicrodiffraction. We found that forsterite retains long-range ordering up to\nthe highest pressure reached. Forsterite III, emerging at about 58 GPa,\npersists in compression to 160.5 GPa and in decompression down to about 13 GPa,\nfor a rare combined occurrence of a metastable phase of nearly 150 GPa. These\nobservations dispute earlier reports of pressure-induced amorphization and are\na unique testimony of the resilience of the crystalline state in quasi\nhydrostatic compression. We confirm that highly disordered forsterite can be\nobtained from the decompression of forsterite III as suggested from the\nsubstantial loss of long-range ordering observed at 7 GPa after further\ndecompression. Such kinetic pathway may explain how synthetic olivine glass\nhave been obtained in shock experiments and could be a mechanism of generation\nof amorphous forsterite in cosmic dust. The 120 GPa Hugoniot discontinuity\nfinds no correspondence in our data, marking a departure from the parallelism\nbetween static \"cold compression\" and dynamic compression.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Condensed Matter/Materials Science","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"02SYxQGeLXOM4LoYnlZLOrck_tgPkQzdxyll42K6D00","pdfSize":"16370383","objectId":"0x3f5d48c10dbed9331772dfe30b5762a631b0315bb5a43f81e6aded5fde91c638","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
