{"id":"2407.17779","title":"DAC: 2D-3D Retrieval with Noisy Labels via Divide-and-Conquer Alignment\n  and Correction","authors":"Chaofan Gan, Yuanpeng Tu, Yuxi Li, Weiyao Lin","authorsParsed":[["Gan","Chaofan",""],["Tu","Yuanpeng",""],["Li","Yuxi",""],["Lin","Weiyao",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 05:18:18 GMT"}],"updateDate":"2024-07-26","timestamp":1721884698000,"abstract":"  With the recent burst of 2D and 3D data, cross-modal retrieval has attracted\nincreasing attention recently. However, manual labeling by non-experts will\ninevitably introduce corrupted annotations given ambiguous 2D/3D content.\nThough previous works have addressed this issue by designing a naive division\nstrategy with hand-crafted thresholds, their performance generally exhibits\ngreat sensitivity to the threshold value. Besides, they fail to fully utilize\nthe valuable supervisory signals within each divided subset. To tackle this\nproblem, we propose a Divide-and-conquer 2D-3D cross-modal Alignment and\nCorrection framework (DAC), which comprises Multimodal Dynamic Division (MDD)\nand Adaptive Alignment and Correction (AAC). Specifically, the former performs\naccurate sample division by adaptive credibility modeling for each sample based\non the compensation information within multimodal loss distribution. Then in\nAAC, samples in distinct subsets are exploited with different alignment\nstrategies to fully enhance the semantic compactness and meanwhile alleviate\nover-fitting to noisy labels, where a self-correction strategy is introduced to\nimprove the quality of representation. Moreover. To evaluate the effectiveness\nin real-world scenarios, we introduce a challenging noisy benchmark, namely\nObjaverse-N200, which comprises 200k-level samples annotated with 1156\nrealistic noisy labels. Extensive experiments on both traditional and the newly\nproposed benchmarks demonstrate the generality and superiority of our DAC,\nwhere DAC outperforms state-of-the-art models by a large margin. (i.e., with\n+5.9% gain on ModelNet40 and +5.8% on Objaverse-N200).\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jzD-_2hf-yNHHHbexW-MUdU7kPuQMdRlp_wgzJSr2P4","pdfSize":"10684289","objectId":"0xe0a4c3360db68faa0eac2a187254b74635a230a9a34d52767f203befc2db0067","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
