{"id":"2407.13908","title":"Construction and Hedging of Equity Index Options Portfolios","authors":"Maciej Wysocki, Robert \\'Slepaczuk","authorsParsed":[["Wysocki","Maciej",""],["Ślepaczuk","Robert",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 21:49:04 GMT"}],"updateDate":"2024-07-22","timestamp":1721339344000,"abstract":"  This research presents a comprehensive evaluation of systematic index\noption-writing strategies, focusing on S&P500 index options. We compare the\nperformance of hedging strategies using the Black-Scholes-Merton (BSM) model\nand the Variance-Gamma (VG) model, emphasizing varying moneyness levels and\ndifferent sizing methods based on delta and the VIX Index. The study employs\n1-minute data of S&P500 index options and index quotes spanning from 2018 to\n2023. The analysis benchmarks hedged strategies against buy-and-hold and naked\noption-writing strategies, with a focus on risk-adjusted performance metrics\nincluding transaction costs. Portfolio delta approximations are derived using\nimplied volatility for the BSM model and market-calibrated parameters for the\nVG model. Key findings reveal that systematic option-writing strategies can\npotentially yield superior returns compared to buy-and-hold benchmarks. The BSM\nmodel generally provided better hedging outcomes than the VG model, although\nthe VG model showed profitability in certain naked strategies as a tool for\nposition sizing. In terms of rehedging frequency, we found that intraday\nhedging in 130-minute intervals provided both reliable protection against\nadverse market movements and a satisfactory returns profile.\n","subjects":["Quantitative Finance/Portfolio Management","Quantitative Finance/Risk Management","Quantitative Finance/Trading and Market Microstructure"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"1bDJYuNPJhCdqJZs0YN-k0eKrSFnqwBaRe6YrH2rbXk","pdfSize":"2425598","objectId":"0x69181af03d230640e7577ce5fa9fdf049ec47c636f07a3909f5aff030bed7fc0","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
