{"id":"2407.18585","title":"Enhanced Piezoelectricity in Sustainable-by-design Chitosan\n  Nanocomposite Elastomers for Prosthetics, Robotics, and Circular Electronics","authors":"Jacopo Nicoletti, Leonardo Puppulin, Julie Routurier, Saimir Frroku,\n  Nouha Loudhaief, Claudia Crestini, Alvise Perosa, Maurizio Selva, Matteo\n  Gigli, Domenico De Fazio, Giovanni Antonio Salvatore","authorsParsed":[["Nicoletti","Jacopo",""],["Puppulin","Leonardo",""],["Routurier","Julie",""],["Frroku","Saimir",""],["Loudhaief","Nouha",""],["Crestini","Claudia",""],["Perosa","Alvise",""],["Selva","Maurizio",""],["Gigli","Matteo",""],["De Fazio","Domenico",""],["Salvatore","Giovanni Antonio",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 08:10:30 GMT"}],"updateDate":"2024-07-29","timestamp":1721981430000,"abstract":"  Piezoelectricity, the generation of electric charge in response to mechanical\nstress, is a key property in both natural and synthetic materials. This study\nsignificantly boosts the piezoelectric response of chitosan, a biodegradable\nbiopolymer, by integrating chitin/chitosan nanocrystals into natural\nchitosan-based thin film elastomers. The resulting materials achieve d$_{33}$\nvalues of 15-19 pmV$^{-1}$, a marked improvement over the 5-9 pmV$^{-1}$\nobserved in pure chitosan films thanks to increased crystallinity from the\nnanocrystals. We utilize piezoresponse force microscopy (PFM) to accurately\nmeasure the d$_{33}$ coefficient, employing an engineered extraction method\nthat eliminates the electrostatic contribution, which can overestimate the\npiezoelectric response. The resulting chitosan elastomers exhibit elastic\ndeformation up to 40\\% strain and a Young's modulus of approximately 100 MPa,\nsimilar to soft tissues. These properties, along with the fact that the\nemployed materials can be entirely crafted from upcycled biowaste, make these\nelastomers ideal for prosthetics, wearable devices, energy harvesters, and\nsustainable transducers. Our findings underscore the potential of\nchitosan-based piezoelectric materials for advanced applications in\nbiotechnology, soft robotics, and the green Internet of Things.\n","subjects":["Condensed Matter/Other Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TysgYmpzezWKT2tiR2_s_ByJWr6RGLkeIOJ6qzIq57I","pdfSize":"3522155","objectId":"0x3e7eba79f07c54647ed48afba6ce76f6ec060888770bacd10a5e6daadae14432","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
