{"id":"2407.21502","title":"Interpretable correlator Transformer for image-like quantum matter data","authors":"Abhinav Suresh, Henning Schl\\\"omer, Baran Hashemi, Annabelle Bohrdt","authorsParsed":[["Suresh","Abhinav",""],["Schlömer","Henning",""],["Hashemi","Baran",""],["Bohrdt","Annabelle",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 10:19:03 GMT"}],"updateDate":"2024-08-01","timestamp":1722421143000,"abstract":"  Due to their inherent capabilities of capturing non-local dependencies,\nTransformer neural networks have quickly been established as the paradigmatic\narchitecture for large language models and image processing. Next to these\ntraditional applications, machine learning methods have also been demonstrated\nto be versatile tools in the analysis of image-like data of quantum phases of\nmatter, e.g. given snapshots of many-body wave functions obtained in ultracold\natom experiments. While local correlation structures in image-like data of\nphysical systems can reliably be detected, identifying phases of matter\ncharacterized by global, non-local structures with interpretable machine\nlearning methods remains a challenge. Here, we introduce the correlator\nTransformer (CoTra), which classifies different phases of matter while at the\nsame time yielding full interpretability in terms of physical correlation\nfunctions. The network's underlying structure is a tailored attention\nmechanism, which learns efficient ways to weigh local and non-local\ncorrelations for a successful classification. We demonstrate the versatility of\nthe CoTra by detecting local order in the Heisenberg antiferromagnet, and show\nthat local gauge constraints in one- and two-dimensional lattice gauge theories\ncan be identified. Furthermore, we establish that the CoTra reliably detects\nnon-local structures in images of correlated fermions in momentum space (Cooper\npairs) and that it can distinguish percolating from non-percolating images.\n","subjects":["Condensed Matter/Quantum Gases","Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EklasFjRS93jfZky74Lbp1adXA80coQpF3bLbN0P0Ro","pdfSize":"5440746","objectId":"0xe7afc295f5eaaa956fe4f8ba0dc0e17d524655e919f0fff1255524b59746f6de","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
