{"id":"2407.16470","title":"Machine Translation Hallucination Detection for Low and High Resource\n  Languages using Large Language Models","authors":"Kenza Benkirane, Laura Gongas, Shahar Pelles, Naomi Fuchs, Joshua\n  Darmon, Pontus Stenetorp, David Ifeoluwa Adelani, Eduardo S\\'anchez","authorsParsed":[["Benkirane","Kenza",""],["Gongas","Laura",""],["Pelles","Shahar",""],["Fuchs","Naomi",""],["Darmon","Joshua",""],["Stenetorp","Pontus",""],["Adelani","David Ifeoluwa",""],["Sánchez","Eduardo",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 13:40:54 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 16:31:39 GMT"}],"updateDate":"2024-07-26","timestamp":1721742054000,"abstract":"  Recent advancements in massively multilingual machine translation systems\nhave significantly enhanced translation accuracy; however, even the best\nperforming systems still generate hallucinations, severely impacting user\ntrust. Detecting hallucinations in Machine Translation (MT) remains a critical\nchallenge, particularly since existing methods excel with High-Resource\nLanguages (HRLs) but exhibit substantial limitations when applied to\nLow-Resource Languages (LRLs). This paper evaluates hallucination detection\napproaches using Large Language Models (LLMs) and semantic similarity within\nmassively multilingual embeddings. Our study spans 16 language directions,\ncovering HRLs, LRLs, with diverse scripts. We find that the choice of model is\nessential for performance. On average, for HRLs, Llama3-70B outperforms the\nprevious state of the art by as much as 0.16 MCC (Matthews Correlation\nCoefficient). However, for LRLs we observe that Claude Sonnet outperforms other\nLLMs on average by 0.03 MCC. The key takeaway from our study is that LLMs can\nachieve performance comparable or even better than previously proposed models,\ndespite not being explicitly trained for any machine translation task. However,\ntheir advantage is less significant for LRLs.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"GPN-JKGLAVYFoYBzozN9yK_kPdz3c7OAGmhNj-X_EMg","pdfSize":"1533521","objectId":"0xb0ad4886ce37c51320e8a194c92d3c137a7f172d090856ff8a14baa3058fca47","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
