{"id":"2407.13539","title":"The separatrix operational space of next-step fusion experiments: From\n  ASDEX Upgrade data to SPARC scenarios","authors":"Thomas Eich, Thomas Body, Michael Faitsch, Ondrej Grover, Marco Andres\n  Miller, Peter Manz, Tom Looby, Adam Qingyang Kuang, Andreas Redl, Matt\n  Reinke, Alex J. Creely, Devon Battaglia, Jon Hillesheim, Mike Wigram, Jerry\n  W. Hughes, the ASDEX Upgrade team","authorsParsed":[["Eich","Thomas",""],["Body","Thomas",""],["Faitsch","Michael",""],["Grover","Ondrej",""],["Miller","Marco Andres",""],["Manz","Peter",""],["Looby","Tom",""],["Kuang","Adam Qingyang",""],["Redl","Andreas",""],["Reinke","Matt",""],["Creely","Alex J.",""],["Battaglia","Devon",""],["Hillesheim","Jon",""],["Wigram","Mike",""],["Hughes","Jerry W.",""],["team","the ASDEX Upgrade",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 14:14:54 GMT"}],"updateDate":"2024-07-19","timestamp":1721312094000,"abstract":"  Fusion power plants require ELM-free, detached operation to prevent divertor\ndamage and erosion. The separatrix operational space (SepOS) is proposed as a\ntool for identifying access to the type-I ELM-free quasi-continuous exhaust\nregime. In this work, we recast the SepOS framework using simple parameters and\npresent dedicated ASDEX Upgrade discharges to demonstrate how to interpret its\nresults. Analyzing an extended ASDEX Upgrade database consisting of 6688\nindividual measurements, we show that SepOS accurately describes how the H-mode\nboundary varies with plasma current and magnetic field strength. We then\nintroduce a normalized SepOS framework and LH minimum scaling and show that\nnormalized boundaries across multiple machines are nearly identical, suggesting\nthat the normalized SepOS can be used to translate results between different\nmachines. The LH minimum density predicted by SepOS is found to closely match\nan experimentally determined multi-machine scaling, which provides a further\nindirect validation of SepOS across multiple devices. Finally, we demonstrate\nhow SepOS can be used predictively, identifying a viable QCE operational point\nfor SPARC, at a separatrix density of 4e20/m3, a separatrix temperature of\n156eV and an alpha-t of 0.7 - a value solidly within the QCE operational space\non ASDEX Upgrade. This demonstrates how SepOS provides a concise, intuitive\nmethod for scoping ELM-free operation on next-step devices.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IeSI164_q7Xx4dSSu-6j_tCmRXV0xxlVfdG4esVt6-Y","pdfSize":"2578183","objectId":"0xf07cc9fc1c6e38452008bf215be088fdd1ad1f124e27dfcfbb476efbb4cc41c5","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
