{"id":"2407.20135","title":"Trade-offs in Reliability and Performance Using Selective Beamforming\n  for Ultra-Massive MIMO","authors":"Anis Hamadouche and Mathini Sellathurai","authorsParsed":[["Hamadouche","Anis",""],["Sellathurai","Mathini",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 16:02:23 GMT"}],"updateDate":"2024-07-30","timestamp":1722268943000,"abstract":"  This paper addresses the optimisation challenges in Ultra-Massive MIMO\ncommunication systems, focusing on array selection and beamforming in dynamic\nand diverse operational contexts. We introduce a novel array selection\ncriterion that incorporates antenna health information into the optimisation\nprocess, distinguishing our approach from traditional methods. Our methodology\nemploys dual proximal-gradient ascent to effectively tackle the constrained\nnon-convex and non-smooth nature of sparse array selection problems. A central\nfeature of our strategy is the implementation of proportional fairness among\ncommunication users, aligning with system resource limitations while ensuring\nminimum rate requirements for all users. This approach not only enhances system\nefficiency and responsiveness but also ensures equitable resource distribution.\nExtensive simulations validate the effectiveness of the proposed solutions in\noptimising Ultra-Massive MIMO system performance, demonstrating their\napplicability in complex communication scenarios. Our findings reveal key\ntrade-offs influenced by the sparsity promotion weight ({\\gamma}). As {\\gamma}\nincreases, spectral efficiency (SE) and communication rate (Ri) decrease, while\nbeamforming matrix density (BMD) reduces and antenna reliability (RL)\nsignificantly improves. These results highlight the critical balance between\nperformance and reliability, essential for the practical deployment of\nUltra-Massive MIMO systems. This work advances the field by providing\ninnovative solutions and new insights into array selection and beamforming\noptimization, setting a foundation for future research in Ultra-Massive MIMO\ncommunication systems.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SmQ4PFkUeUJqb1I7mbmCI1B8FvrZd4zn6vQEH2ouv_Y","pdfSize":"395576","objectId":"0x6bddbe2cba2f57229deb4cb144e5a8f67f3a31f5e2ff7d7cb2f3b9716d35a733","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
