{"id":"2407.13005","title":"MC-BLOS: Determination of the Line-of-Sight Component of Magnetic Fields\n  Associated with Molecular Clouds","authors":"Mehrnoosh Tahani, John Ming Ngo, Jennifer Glover, Ryan Clairmont,\n  Gabriel Munoz Zarazua, Ren\\'e Plume","authorsParsed":[["Tahani","Mehrnoosh",""],["Ngo","John Ming",""],["Glover","Jennifer",""],["Clairmont","Ryan",""],["Zarazua","Gabriel Munoz",""],["Plume","René",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 20:50:01 GMT"}],"updateDate":"2024-07-19","timestamp":1721249401000,"abstract":"  In recent years a number of surveys and telescopes have observed the\nplane-of-sky component of magnetic fields associated with molecular clouds.\nHowever, observations of their line-of-sight magnetic field remain limited. To\naddress this issue, Tahani et al. (2018) developed a technique based on Faraday\nrotation. The technique incorporates an ON-OFF approach to identify the\nrotation measure induced by the magnetic fields associated with the cloud. The\nupcoming abundance of Faraday rotation observations from the Square Kilometer\nArray and its pathfinders necessitates robustly-tested software to\nautomatically obtain line-of-sight magnetic fields of molecular clouds. We\ndeveloped software, called MC-BLOS (Molecular Cloud Line-of-Sight Magnetic\nField), to carry out the technique in an automated manner. The software's input\nare Faraday rotation of point sources (extra-galactic sources or pulsars),\nextinction or column density maps, chemical evolution code results, and a\ntext/CSV file, which allows the user to specify the cloud name or other\nparameters pertaining to the technique. For each cloud, the software invokes a\nset of predefined initial parameters such as density, temperature, and\nsurrounding boundary, which the user can modify. The software then runs the\ntechnique automatically, outputting line-of-sight magnetic field maps and\ntables (including uncertainties) at the end of the process. This automated\napproach significantly reduces analysis time compared to manual methods. We\nhave tested the software on previously-published clouds, and the results are\nconsistent within the reported uncertainty range. This software will facilitate\nthe analysis of forthcoming Faraday rotation observations, enabling a better\nunderstanding of the role of magnetic fields in molecular cloud dynamics and\nstar formation.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7P-qEkmfnuMveGfSQ-CWAeFV5xcJogRyDDJbhjFp-bA","pdfSize":"1203048","objectId":"0xc7185f40aa542334904be947687ebbe75697209af270e46ca4c404a75253641e","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
