{"id":"2407.01180","title":"Deploying AI-Based Applications with Serverless Computing in 6G\n  Networks: An Experimental Study","authors":"Marc Michalke, Chukwuemeka Muonagor and Admela Jukan","authorsParsed":[["Michalke","Marc",""],["Muonagor","Chukwuemeka",""],["Jukan","Admela",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 11:08:25 GMT"}],"updateDate":"2024-07-02","timestamp":1719832105000,"abstract":"  Future 6G networks are expected to heavily utilize machine learning\ncapabilities in a wide variety of applications with features and benefits for\nboth, the end user and the provider. While the options for utilizing these\ntechnologies are almost endless, from the perspective of network architecture\nand standardized service, the deployment decisions on where to execute the\nAI-tasks are critical, especially when considering the dynamic and\nheterogeneous nature of processing and connectivity capability of 6G networks.\nOn the other hand, conceptual and standardization work is still in its infancy,\nas to how to categorizes ML applications in 6G landscapes; some of them are\npart of network management functions, some target the inference itself, while\nmany others emphasize model training. It is likely that future mobile services\nmay all be in the AI domain, or combined with AI. This work makes a case for\nthe serverless computing paradigm to be used to this end. We first provide an\noverview of different machine learning applications that are expected to be\nrelevant in 6G networks. We then create a set of general requirements for\nsoftware engineering solutions executing these workloads from them and propose\nand implement a high-level edge-focused architecture to execute such tasks. We\nthen map the ML-serverless paradigm to the case study of 6G architecture and\ntest the resulting performance experimentally for a machine learning\napplication against a setup created in a more traditional, cloud-based manner.\nOur results show that, while there is a trade-off in predictability of the\nresponse times and the accuracy, the achieved median accuracy in a 6G setup\nremains the same, while the median response time decreases by around 25%\ncompared to the cloud setup.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LPH_OjfDkAFpWfVkc37FxCxUsTPJ1WFKaoS8eMFUsPQ","pdfSize":"5137715","objectId":"0x29451e6c12d929ac5c61f98a10352442e6524e96c4407aca4c9a327262e548a1","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
