{"id":"2407.05519","title":"GitHub Marketplace for Automation and Innovation in Software Production","authors":"SK Golam Saroar, Waseefa Ahmed, Elmira Onagh, Maleknaz Nayebi","authorsParsed":[["Saroar","SK Golam",""],["Ahmed","Waseefa",""],["Onagh","Elmira",""],["Nayebi","Maleknaz",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 23:55:15 GMT"}],"updateDate":"2024-07-09","timestamp":1720396515000,"abstract":"  GitHub, renowned for facilitating collaborative code version control and\nsoftware production in software teams, expanded its services in 2017 by\nintroducing GitHub Marketplace. This online platform hosts automation tools to\nassist developers with the production of their GitHub-hosted projects, and it\nhas become a valuable source of information on the tools used in the Open\nSource Software (OSS) community. In this exploratory study, we introduce GitHub\nMarketplace as a software marketplace by comprehensively exploring the\nplatform's characteristics, features, and policies and identifying common\nthemes in production automation. Further, we explore popular tools among\npractitioners and researchers and highlight disparities in the approach to\nthese tools between industry and academia. We adopted the conceptual framework\nof software app stores from previous studies to examine 8,318 automated\nproduction tools (440 Apps and 7,878 Actions) across 32 categories on GitHub\nMarketplace. We explored and described the policies of this marketplace as a\nunique platform where developers share production tools for the use of other\ndevelopers. Furthermore, we systematically mapped 515 research papers published\nfrom 2000 to 2021 and compared open-source academic production tools with those\navailable in the marketplace. We found that although some of the automation\ntopics in literature are widely used in practice, they have yet to align with\nthe state of practice for automated production. We discovered that\npractitioners often use automation tools for tasks like \"Continuous\nIntegration\" and \"Utilities,\" while researchers tend to focus more on \"Code\nQuality\" and \"Testing\". Our study illuminates the landscape of open-source\ntools for automation production in industry and research.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jy6GCP93acTgjfpHtUf86ZYVFLNji3ZF_f479rewM_I","pdfSize":"1880544"}
