{"id":"2407.07560","title":"Instrumentation and Analysis of Native ML Pipelines via Logical Query\n  Plans","authors":"Stefan Grafberger","authorsParsed":[["Grafberger","Stefan",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 11:35:02 GMT"}],"updateDate":"2024-09-04","timestamp":1720611302000,"abstract":"  Machine Learning (ML) is increasingly used to automate impactful decisions,\nwhich leads to concerns regarding their correctness, reliability, and fairness.\nWe envision highly-automated software platforms to assist data scientists with\ndeveloping, validating, monitoring, and analysing their ML pipelines. In\ncontrast to existing work, our key idea is to extract \"logical query plans\"\nfrom ML pipeline code relying on popular libraries. Based on these plans, we\nautomatically infer pipeline semantics and instrument and rewrite the ML\npipelines to enable diverse use cases without requiring data scientists to\nmanually annotate or rewrite their code.\n  First, we developed such an abstract ML pipeline representation together with\nmachinery to extract it from Python code. Next, we used this representation to\nefficiently instrument static ML pipelines and apply provenance tracking, which\nenables lightweight screening for common data preparation issues. Finally, we\nbuilt machinery to automatically rewrite ML pipelines to perform more advanced\nwhat-if analyses and proposed using multi-query optimisation for the resulting\nworkloads. In future work, we aim to interactively assist data scientists as\nthey work on their ML pipelines.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Machine Learning","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-D4KGqz_AvKVH4SrwGm7glDrO7gt6ULOMOUIhCCuS-U","pdfSize":"1783327","objectId":"0xd63657ccdb94095e2850b0a0016bf530ac6ecc629b79846e1033c99d116bd91e","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
