{"id":"2407.04080","title":"Find the haystacks, then look for needles: The rate of strongly lensed\n  transients in galaxy-galaxy strong gravitational lenses","authors":"Ana Sainz de Murieta, Thomas E. Collett, Mark R. Magee, Justin D. R.\n  Pierel, Wolfgang J. R. Enzi, Martine Lokken, Alex Gagliano and Dan\n  Ryczanowski","authorsParsed":[["de Murieta","Ana Sainz",""],["Collett","Thomas E.",""],["Magee","Mark R.",""],["Pierel","Justin D. R.",""],["Enzi","Wolfgang J. R.",""],["Lokken","Martine",""],["Gagliano","Alex",""],["Ryczanowski","Dan",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 17:41:49 GMT"}],"updateDate":"2024-07-08","timestamp":1720114909000,"abstract":"  The time delay between appearances of multiple images of a gravitationally\nlensed supernova (glSN) is sensitive to the Hubble constant, $H_0$. As well as\ntime delays, a lensed host galaxy is needed to enable precise inference of\n$H_0$. In this work we investigate the connection between discoverable lensed\ntransients and their host galaxies. We find that LSST will discover 88 glSNe\nper year, of which $54\\%$ will also have a strongly lensed host. The rates can\nchange by approximately 30 percent uncertainty depending primarily on the\nchoice of unlensed SN population and uncertainties in the redshift evolution of\nthe deflector population, but the fraction of glSNe with a lensed host is\nconsistently around a half. LSST will discover 20 glSNe per year in systems\nthat could plausibly have been identified by Euclid as galaxy-galaxy lenses\nbefore the discovery of the glSN. Such systems have preferentially longer time\ndelays and therefore are well suited for cosmography. We define a golden sample\nof glSNe Ia with time delays over 10 days, image separations greater than 0.8\narcseconds, and a multiply imaged host. For this golden sample, we find $91\\%$\noccur in systems that should already be discoverable as galaxy-galaxy lenses in\nEuclid. For cosmology with glSNe, monitoring Euclid lenses is a plausible\nalternative to searching the entire LSST alert stream.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rZJnPo8f4RBBf66GS7h1NqiFG2H2at3_I9P1bEGE9OY","pdfSize":"977219"}
