{"id":"2407.21094","title":"Probing beyond local-type non-Gaussianity with kSZ tomography","authors":"Peter Adshead and Avery J. Tishue","authorsParsed":[["Adshead","Peter",""],["Tishue","Avery J.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-08-01","timestamp":1722362400000,"abstract":"  Non-Gaussianity of the primordial curvature perturbations may arise from a\nvariety of well motivated early Universe scenarios. In particular, inflationary\ntheories with additional light degrees of freedom can generate a bispectrum\nthat is peaked in the squeezed limit. While the presence of an additional\nmassless scalar can produce local-type primordial non-Gaussianity, in general\nthe squeezed limit of the bispectrum depends on the mass of the new degree of\nfreedom, and can deviate from the local shape. The resulting bispectrum leaves\na distinct imprint on the amplitude and scale-dependence of the galaxy bias,\nwhich for massive fields can differ from the $k^{-2}$ scaling from local type\nnon-Gaussianity, providing an observational window into the physics of the\nearly Universe. In this work we demonstrate that kinematic Sunyaev-Zeldovich\ntomography with next generation cosmological surveys will offer significant\nadditional constraining power for both the shape and amplitude of\nscale-dependent bias arising from primordial non-Gaussianity beyond the local\ntype. We show that this improved constraining power is robust to various\nobstacles such as the optical depth degeneracy, photometric redshift errors,\nand uncertainty in the galaxy bias model. With CMB S4 and the Large Synoptic\nSurvey Telescope, we forecast that compared to the galaxy survey alone the\naddition of kSZ tomography will offer a roughly factor of two reduction in the\nmeasurement uncertainty of the amplitude $f_{NL}$ of primordial non-Gaussianity\nwell beyond the local (massless) limit. We find that kSZ tomography extends the\nrange of masses for which order unity constraints on $f_{NL}$ are achievable,\nas well as extending the range of masses for which the late time probes of the\nmatter power spectrum outperform the sensitivity of the CMB itself.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Gv5hJnVwIANtP8TEudpcDAgcVY5VgHUCcpHZpEx6Wu8","pdfSize":"2024438","objectId":"0xd6e02b9f02c4cbc5cdf7ae9cb614373a13865ea88515f6f1874caa6d7a70b945","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
