{"id":"2407.04322","title":"2D BAO vs 3D BAO: solving the Hubble tension with alternative\n  cosmological models","authors":"Sowmaydeep Dwivedi, Marcus H\\\"og{\\aa}s","authorsParsed":[["Dwivedi","Sowmaydeep",""],["Högås","Marcus",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 07:48:09 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 12:18:45 GMT"}],"updateDate":"2024-09-02","timestamp":1720165689000,"abstract":"  Ordinary 3D Baryon Acoustic Oscillations (BAO) data are model-dependent,\nrequiring the assumption of a cosmological model to calculate comoving\ndistances during data reduction. Throughout the present-day literature, the\nassumed model is $\\Lambda$CDM. However, this assumption can be inadequate when\nanalyzing alternative cosmologies, potentially biasing the Hubble constant\n($H_0$) low, thus contributing to the Hubble tension. To address this issue, we\nuse model-independent 2D BAO data and compare the results to those obtained\nusing 3D BAO data. As a concrete example, we investigate the cosmological\nmodels provided by bimetric gravity, a modified theory of gravity that\ntransitions from a negative cosmological constant in the early universe to a\npositive one in the late universe. By combining 2D BAO data with cosmic\nmicrowave background and type Ia supernovae data, we find that the inverse\ndistance ladder in this theory yields a Hubble constant of $H_0 = (71.0 \\pm\n0.9) \\, \\mathrm{km/s/Mpc}$, consistent with the SH0ES local distance ladder\nmeasurement of $H_0 = (73.0 \\pm 1.0) \\, \\mathrm{km/s/Mpc}$. Replacing 2D BAO\nwith 3D BAO results in $H_0 = (68.6 \\pm 0.5) \\, \\mathrm{km/s/Mpc}$ from the\ninverse distance ladder. We conclude that the choice of BAO data significantly\nimpacts the Hubble tension, with ordinary 3D BAO data exacerbating the tension,\nwhile 2D BAO data provides results consistent with the local distance ladder.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2HfQdYdVRbnqXS44x9m_gc7H-BrFVoxqlMQodzDH6As","pdfSize":"2668310"}
