{"id":"2407.01947","title":"Description of molecular chirality and its analysis with high harmonic\n  generation","authors":"Akihito Kato and Nobuhiko Yokoshi","authorsParsed":[["Kato","Akihito",""],["Yokoshi","Nobuhiko",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 04:38:52 GMT"},{"version":"v2","created":"Sat, 31 Aug 2024 00:27:21 GMT"}],"updateDate":"2024-09-04","timestamp":1719895132000,"abstract":"  To clarify the microscopic origin of chirality-induced optical effect, we\ndevelop an analytical method that extracts the chiral part of the Hamiltonian\nof molecular electronic states. We demonstrate this method in a model chiral\nmolecule consisting of two helically stacked $N$-sided regular polygons, and\ncompare it with numerical calculation for chiral discrimination via\nhigh-harmonic generation (HHG) of the same molecule. The discrimination signal\nhere is the Kuhn $g$ factor, the difference between the harmonic intensity from\nthe bicircular laser field and that from its reflected laser field normalized\nby their average. The $g$ factor is a pseudoscalar quantity that reflects the\nchirality of the molecule. As a result, we find that the $g$ factor becomes\nlarge over a wide range of harmonic orders making HHG suitable for chiral\ndiscrimination. We further find that, to increase the difference of harmonic\nintensity from the above two fields, the unnormalized $g$ factor, the increase\nof capacity to generate the longitudinal dipole moment is more advantageous\nthan maximizing the transverse-to-longitudinal conversion efficiency via the\noptimization of molecular chirality. We speculate this criteria may be extended\nto other optical and current-induced processes relevant to the chiral molecules\nand materials.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"T3EKd_N6StKgXeqG6o2sKGI_A-tl0saW3YO_YMDveaE","pdfSize":"999747","objectId":"0x83e74c13820d014cfdc491c91d2c9d7fe1dca96bf9a41ce83b8100dd7639fbbd","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
