{"id":"2407.08099","title":"How does Burrows' Delta work on medieval Chinese poetic texts?","authors":"Boris Orekhov","authorsParsed":[["Orekhov","Boris",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 00:07:14 GMT"}],"updateDate":"2024-07-12","timestamp":1720656434000,"abstract":"  Burrows' Delta was introduced in 2002 and has proven to be an effective tool\nfor author attribution. Despite the fact that these are different languages,\nthey mostly belong to the same grammatical type and use the same graphic\nprinciple to convey speech in writing: a phonemic alphabet with word separation\nusing spaces. The question I want to address in this article is how well this\nattribution method works with texts in a language with a different grammatical\nstructure and a script based on different principles. There are fewer studies\nanalyzing the effectiveness of the Delta method on Chinese texts than on texts\nin European languages. I believe that such a low level of attention to Delta\nfrom sinologists is due to the structure of the scientific field dedicated to\nmedieval Chinese poetry. Clustering based on intertextual distances worked\nflawlessly. Delta produced results where clustering showed that the samples of\none author were most similar to each other, and Delta never confused different\npoets. Despite the fact that I used an unconventional approach and applied the\nDelta method to a language poorly suited for it, the method demonstrated its\neffectiveness. Tang dynasty poets are correctly identified using Delta, and the\nempirical pattern observed for authors writing in European standard languages\nhas been confirmed once again.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jqxC42JbBntFIHw-Ib1PFVZPobxEQBnHOojynGjcW-0","pdfSize":"695072","objectId":"0x8f76a748f047a33a1f5b9767fcf7521976b1c32dc8df09f686eecd3fb4bfe183","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
