{"id":"2407.02633","title":"HOIMotion: Forecasting Human Motion During Human-Object Interactions\n  Using Egocentric 3D Object Bounding Boxes","authors":"Zhiming Hu, Zheming Yin, Daniel Haeufle, Syn Schmitt, Andreas Bulling","authorsParsed":[["Hu","Zhiming",""],["Yin","Zheming",""],["Haeufle","Daniel",""],["Schmitt","Syn",""],["Bulling","Andreas",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 19:58:35 GMT"}],"updateDate":"2024-07-04","timestamp":1719950315000,"abstract":"  We present HOIMotion - a novel approach for human motion forecasting during\nhuman-object interactions that integrates information about past body poses and\negocentric 3D object bounding boxes. Human motion forecasting is important in\nmany augmented reality applications but most existing methods have only used\npast body poses to predict future motion. HOIMotion first uses an\nencoder-residual graph convolutional network (GCN) and multi-layer perceptrons\nto extract features from body poses and egocentric 3D object bounding boxes,\nrespectively. Our method then fuses pose and object features into a novel\npose-object graph and uses a residual-decoder GCN to forecast future body\nmotion. We extensively evaluate our method on the Aria digital twin (ADT) and\nMoGaze datasets and show that HOIMotion consistently outperforms\nstate-of-the-art methods by a large margin of up to 8.7% on ADT and 7.2% on\nMoGaze in terms of mean per joint position error. Complementing these\nevaluations, we report a human study (N=20) that shows that the improvements\nachieved by our method result in forecasted poses being perceived as both more\nprecise and more realistic than those of existing methods. Taken together,\nthese results reveal the significant information content available in\negocentric 3D object bounding boxes for human motion forecasting and the\neffectiveness of our method in exploiting this information.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"A-RFNzUyCKR6sPEH1vZXFHXG6T43BsZ0rhtBQW35O4I","pdfSize":"3718721","objectId":"0x329cdc68eb15d3c20b258cc3074379cdb6fc8dd8d03de5bc1fc885af99652731","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
