{"id":"2407.08653","title":"An infrared census of R Coronae Borealis Stars II -- Spectroscopic\n  classifications and implications for the rate of low-mass white dwarf mergers","authors":"Viraj R. Karambelkar, Mansi M. Kasliwal, Patrick Tisserand, Shreya\n  Anand, Michael C. B. Ashley, Lars Bildsten, Geoffrey C. Clayton, Courtney C.\n  Crawford, Kishalay De, Nicholas Earley, Matthew J. Hankins, Xander Hall,\n  Astrid Lamberts, Ryan M. Lau, Dan McKenna, Anna Moore, Eran O. Ofek, Roger M.\n  Smith, Roberto Soria, Jamie Soon, and Tony Travouillon","authorsParsed":[["Karambelkar","Viraj R.",""],["Kasliwal","Mansi M.",""],["Tisserand","Patrick",""],["Anand","Shreya",""],["Ashley","Michael C. B.",""],["Bildsten","Lars",""],["Clayton","Geoffrey C.",""],["Crawford","Courtney C.",""],["De","Kishalay",""],["Earley","Nicholas",""],["Hankins","Matthew J.",""],["Hall","Xander",""],["Lamberts","Astrid",""],["Lau","Ryan M.",""],["McKenna","Dan",""],["Moore","Anna",""],["Ofek","Eran O.",""],["Smith","Roger M.",""],["Soria","Roberto",""],["Soon","Jamie",""],["Travouillon","Tony",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 16:33:23 GMT"}],"updateDate":"2024-07-12","timestamp":1720715603000,"abstract":"  We present results from a systematic infrared (IR) census of R Coronae\nBorealis (RCB) stars in the Milky Way, using data from the Palomar Gattini IR\n(PGIR) survey. R Coronae Borealis stars are dusty, erratic variable stars\npresumably formed from the merger of a He-core and a CO-core white dwarf (WD).\nPGIR is a 30 cm $J$-band telescope with a 25 deg$^{2}$ camera that surveys\n18000 deg$^{2}$ of the northern sky ($\\delta>-28^{o}$) at a cadence of 2 days.\nUsing PGIR J-band lightcurves for $\\sim$60 million stars together with mid-IR\ncolors from WISE, we selected a sample of 530 candidate RCB stars. We obtained\nnear-IR spectra for these candidates and identified 53 RCB stars in our sample.\nAccounting for our selection criteria, we find that there are a total of\n$\\approx350^{+150}_{-100}$ RCB stars in the Milky Way. Assuming typical RCB\nlifetimes, this corresponds to an RCB formation rate of 0.8 - 5 $\\times$\n10$^{-3}$ yr$^{-1}$, consistent with observational and theoretical estimates of\nthe He-CO WD merger rate. We searched for quasi-periodic pulsations in the PGIR\nlightcurves of RCB stars and present pulsation periods for 16 RCB stars. We\nalso examined high-cadenced TESS lightcurves for RCB and the chemically\nsimilar, but dustless hydrogen-deficient carbon (dLHdC) stars. We find that\ndLHdC stars show variations on timescales shorter than RCB stars, suggesting\nthat they may have lower masses than RCB stars. Finally, we identified 3 new\nspectroscopically confirmed and 12 candidate Galactic DY Per type stars -\nbelieved to be colder cousins of RCB stars - doubling the sample of Galactic DY\nPer type stars.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8KXaPKbUjMuc9sRNAaeL17H1WkJ_ewFseX0fCdM1STQ","pdfSize":"10102792","objectId":"0xb450160567f90f70f8eb32e860a811f3d0e172cd141b24b5d182b5764f4ccc49","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
