{"id":"2407.21151","title":"Private Collaborative Edge Inference via Over-the-Air Computation","authors":"Selim F. Yilmaz, Burak Hasircioglu, Li Qiao and Deniz Gunduz","authorsParsed":[["Yilmaz","Selim F.",""],["Hasircioglu","Burak",""],["Qiao","Li",""],["Gunduz","Deniz",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 19:28:28 GMT"}],"updateDate":"2024-08-01","timestamp":1722367708000,"abstract":"  We consider collaborative inference at the wireless edge, where each client's\nmodel is trained independently on their local datasets. Clients are queried in\nparallel to make an accurate decision collaboratively. In addition to\nmaximizing the inference accuracy, we also want to ensure the privacy of local\nmodels. To this end, we leverage the superposition property of the multiple\naccess channel to implement bandwidth-efficient multi-user inference methods.\nSpecifically, we propose different methods for ensemble and multi-view\nclassification that exploit over-the-air computation. We show that these\nschemes perform better than their orthogonal counterparts with statistically\nsignificant differences while using fewer resources and providing privacy\nguarantees. We also provide experimental results verifying the benefits of the\nproposed over-the-air multi-user inference approach and perform an ablation\nstudy to demonstrate the effectiveness of our design choices. We share the\nsource code of the framework publicly on Github to facilitate further research\nand reproducibility.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Cryptography and Security","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7qVYSwcvmoE1vUFNIT214-sykxZMYr0X9qPTQm8O1ys","pdfSize":"938231","objectId":"0x1f80a80e605dfefdc71fc4fa575a20f632a1b1d9a92d9db124a6a669abf89f24","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
