{"id":"2407.07128","title":"Modularity aided consistent attributed graph clustering via coarsening","authors":"Samarth Bhatia (1), Yukti Makhija (1), Manoj Kumar (1), Sandeep Kumar\n  (1) ((1) Indian Institute of Technology, Delhi)","authorsParsed":[["Bhatia","Samarth","","Indian Institute of Technology, Delhi"],["Makhija","Yukti","","Indian Institute of Technology, Delhi"],["Kumar","Manoj","","Indian Institute of Technology, Delhi"],["Kumar","Sandeep","","Indian Institute of Technology, Delhi"]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 10:42:19 GMT"}],"updateDate":"2024-07-11","timestamp":1720521739000,"abstract":"  Graph clustering is an important unsupervised learning technique for\npartitioning graphs with attributes and detecting communities. However, current\nmethods struggle to accurately capture true community structures and\nintra-cluster relations, be computationally efficient, and identify smaller\ncommunities. We address these challenges by integrating coarsening and\nmodularity maximization, effectively leveraging both adjacency and node\nfeatures to enhance clustering accuracy. We propose a loss function\nincorporating log-determinant, smoothness, and modularity components using a\nblock majorization-minimization technique, resulting in superior clustering\noutcomes. The method is theoretically consistent under the Degree-Corrected\nStochastic Block Model (DC-SBM), ensuring asymptotic error-free performance and\ncomplete label recovery. Our provably convergent and time-efficient algorithm\nseamlessly integrates with graph neural networks (GNNs) and variational graph\nautoencoders (VGAEs) to learn enhanced node features and deliver exceptional\nclustering performance. Extensive experiments on benchmark datasets demonstrate\nits superiority over existing state-of-the-art methods for both attributed and\nnon-attributed graphs.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Social and Information Networks","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"j_F6jYG4okMe0bJSjy_o9asqgZfobeNJcBpIGruRmmA","pdfSize":"3388338"}
