{"id":"2407.19282","title":"A self-supervised and adversarial approach to hyperspectral demosaicking\n  and RGB reconstruction in surgical imaging","authors":"Peichao Li, Oscar MacCormac, Jonathan Shapey, Tom Vercauteren","authorsParsed":[["Li","Peichao",""],["MacCormac","Oscar",""],["Shapey","Jonathan",""],["Vercauteren","Tom",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 15:29:35 GMT"}],"updateDate":"2024-07-30","timestamp":1722094175000,"abstract":"  Hyperspectral imaging holds promises in surgical imaging by offering\nbiological tissue differentiation capabilities with detailed information that\nis invisible to the naked eye. For intra-operative guidance, real-time spectral\ndata capture and display is mandated. Snapshot mosaic hyperspectral cameras are\ncurrently seen as the most suitable technology given this requirement. However,\nsnapshot mosaic imaging requires a demosaicking algorithm to fully restore the\nspatial and spectral details in the images. Modern demosaicking approaches\ntypically rely on synthetic datasets to develop supervised learning methods, as\nit is practically impossible to simultaneously capture both snapshot and\nhigh-resolution spectral images of the exact same surgical scene. In this work,\nwe present a self-supervised demosaicking and RGB reconstruction method that\ndoes not depend on paired high-resolution data as ground truth. We leverage\nunpaired standard high-resolution surgical microscopy images, which only\nprovide RGB data but can be collected during routine surgeries. Adversarial\nlearning complemented by self-supervised approaches are used to drive our\nhyperspectral-based RGB reconstruction into resembling surgical microscopy\nimages and increasing the spatial resolution of our demosaicking. The spatial\nand spectral fidelity of the reconstructed hyperspectral images have been\nevaluated quantitatively. Moreover, a user study was conducted to evaluate the\nRGB visualisation generated from these spectral images. Both spatial detail and\ncolour accuracy were assessed by neurosurgical experts. Our proposed\nself-supervised demosaicking method demonstrates improved results compared to\nexisting methods, demonstrating its potential for seamless integration into\nintra-operative workflows.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xcH8qriP6FX1cHadlbnDeXac-mBFXXLKFELc3Df2caY","pdfSize":"20185476","objectId":"0x26af6e5558dfb51b6bc074ffa5c127e218007dcb89fa50da185558fd32799c5d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
