{"id":"2407.14018","title":"Energy efficient coherent quantum control of nitrogen vacancy (NV) spin\n  with nanoscale magnets","authors":"Md Fahim F Chowdhury, Adi Jung, Lea La Spina, Ausrine Bartasyte,\n  Samuel Margueron, Jayasimha Atulasimha","authorsParsed":[["Chowdhury","Md Fahim F",""],["Jung","Adi",""],["La Spina","Lea",""],["Bartasyte","Ausrine",""],["Margueron","Samuel",""],["Atulasimha","Jayasimha",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 04:37:44 GMT"}],"updateDate":"2024-07-22","timestamp":1721363864000,"abstract":"  We investigate coherent quantum control of a nitrogen vacancy (NV) center in\ndiamond with microwave fields generated from a nanoscale magnet that is\nproximal to the NV center. Our results show remarkable coherent control with\nhigh contrast Rabi oscillations using nearfield microwaves from shape\nanisotropic nanomagnets of lateral dimensions down to 200 nm x 180 nm, driven\nremotely by surface acoustic wave (SAW) excitation that is at least 400 times\nand potentially 4 orders of magnitude more energy efficient than generating\nmicrowaves with an antenna. Furthermore, we show that varying the acoustic\npower driving such nanomagnets can achieve control over Rabi frequency. We also\nreport spin-lattice relaxation time T1 is 103 +/-0.5 micro-seconds, the\nspin-spin relaxation time T2 is 1.23+/-0.29 micro-seconds, and the Ramsey\ncoherence time T2* is 218+/-27 nanoseconds measured using microwave pulses\ngenerated by such nanomagnets. The use of the nanoscale magnets to implement\nhighly localized and energy efficient coherent quantum control can replace\nthermally noisy microwave circuits and demonstrate a path to scalable quantum\ncomputing and sensing with NV-defects in diamond and other spin qubits.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ml3jJ4VMPTU2g-4QpGXZkAM_pU_nU6E4G1Slig11ayk","pdfSize":"4861433","objectId":"0xcf1b20209648a9775fc05fcd2b20f345c27df47a4bfa59f2e82315ef718ea9e6","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
