{"id":"2407.09643","title":"PEPSI Investigation, Retrieval, and Atlas of Numerous Giant Atmospheres\n  (PIRANGA). I. The Ubiquity of Fe I Emission and Inversions in Ultra Hot\n  Jupiter Atmospheres","authors":"Sydney Petz, Marshall C. Johnson, Anusha Pai Asnodkar, Alison Duck, Ji\n  Wang, Ilya Ilyin, Klaus G. Strassmeier","authorsParsed":[["Petz","Sydney",""],["Johnson","Marshall C.",""],["Asnodkar","Anusha Pai",""],["Duck","Alison",""],["Wang","Ji",""],["Ilyin","Ilya",""],["Strassmeier","Klaus G.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 19:04:09 GMT"}],"updateDate":"2024-07-16","timestamp":1720811049000,"abstract":"  We present high-resolution optical emission spectroscopy observations of the\nultra hot Jupiters (UHJs) TOI-1431 b and TOI-1518 b using the PEPSI\nspectrograph on the LBT. We detect emission lines from Fe I with a significance\nof 5.40$\\sigma$ and 7.85$\\sigma$ for TOI 1431 b and TOI-1518 b, respectively.\nWe also detect Cr I emission from TOI-1431 b at $4.23\\sigma$. For TOI-1518 b,\nwe tentatively detect Ni I, Fe I, and Mg I, as well as possibly CaH, at\nsignificance levels ranging from $3-4\\sigma$. Detection of emission lines\nindicates that both planets possess temperature inversions in their\natmospheres, providing further evidence of the ubiquity of stratospheres among\nUHJs. By analyzing the population of hot Jupiters, we compare models that\npredict the distribution of planets in the temperature-gravity space, and find\na recent global circulation model suite from Roth et al. (2024) provides a\nreasonable match, if TiO is not included in the models. The ubiquity of strong\nFe I emission lines among UHJs, together with the paucity of detections of TiO,\nsuggest that atomic iron is the dominant optical opacity source in their\natmospheres and can be responsible for the inversions.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8CrPmZ5h2Vv9skEeWlIfYYJRAIEUKTk3PDLwxIlpE2Q","pdfSize":"1806615","objectId":"0x98682836d250bfcc6181d584ea9660555b29345247330c2bb160690e9a27f60b","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
