{"id":"2407.21343","title":"MIST: A Simple and Scalable End-To-End 3D Medical Imaging Segmentation\n  Framework","authors":"Adrian Celaya, Evan Lim, Rachel Glenn, Brayden Mi, Alex Balsells,\n  Tucker Netherton, Caroline Chung, Beatrice Riviere, David Fuentes","authorsParsed":[["Celaya","Adrian",""],["Lim","Evan",""],["Glenn","Rachel",""],["Mi","Brayden",""],["Balsells","Alex",""],["Netherton","Tucker",""],["Chung","Caroline",""],["Riviere","Beatrice",""],["Fuentes","David",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 05:17:31 GMT"}],"updateDate":"2024-08-01","timestamp":1722403051000,"abstract":"  Medical imaging segmentation is a highly active area of research, with deep\nlearning-based methods achieving state-of-the-art results in several\nbenchmarks. However, the lack of standardized tools for training, testing, and\nevaluating new methods makes the comparison of methods difficult. To address\nthis, we introduce the Medical Imaging Segmentation Toolkit (MIST), a simple,\nmodular, and end-to-end medical imaging segmentation framework designed to\nfacilitate consistent training, testing, and evaluation of deep learning-based\nmedical imaging segmentation methods. MIST standardizes data analysis,\npreprocessing, and evaluation pipelines, accommodating multiple architectures\nand loss functions. This standardization ensures reproducible and fair\ncomparisons across different methods. We detail MIST's data format\nrequirements, pipelines, and auxiliary features and demonstrate its efficacy\nusing the BraTS Adult Glioma Post-Treatment Challenge dataset. Our results\nhighlight MIST's ability to produce accurate segmentation masks and its\nscalability across multiple GPUs, showcasing its potential as a powerful tool\nfor future medical imaging research and development.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"h0hxJY1yanUQPzFyBl553ENTCObDTvUd80v4xEt-UN0","pdfSize":"484940","objectId":"0x6c934c04551bd562572db499d7e9e20354a1282681652309ee6ae87bb8fcd596","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
