{"id":"2407.12296","title":"A foundation model approach to guide antimicrobial peptide design in the\n  era of artificial intelligence driven scientific discovery","authors":"Jike Wang, Jianwen Feng, Yu Kang, Peichen Pan, Jingxuan Ge, Yan Wang,\n  Mingyang Wang, Zhenxing Wu, Xingcai Zhang, Jiameng Yu, Xujun Zhang, Tianyue\n  Wang, Lirong Wen, Guangning Yan, Yafeng Deng, Hui Shi, Chang-Yu Hsieh, Zhihui\n  Jiang, Tingjun Hou","authorsParsed":[["Wang","Jike",""],["Feng","Jianwen",""],["Kang","Yu",""],["Pan","Peichen",""],["Ge","Jingxuan",""],["Wang","Yan",""],["Wang","Mingyang",""],["Wu","Zhenxing",""],["Zhang","Xingcai",""],["Yu","Jiameng",""],["Zhang","Xujun",""],["Wang","Tianyue",""],["Wen","Lirong",""],["Yan","Guangning",""],["Deng","Yafeng",""],["Shi","Hui",""],["Hsieh","Chang-Yu",""],["Jiang","Zhihui",""],["Hou","Tingjun",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 03:36:33 GMT"}],"updateDate":"2024-07-18","timestamp":1721187393000,"abstract":"  We propose AMP-Designer, an LLM-based foundation model approach for the rapid\ndesign of novel antimicrobial peptides (AMPs) with multiple desired properties.\nWithin 11 days, AMP-Designer enables de novo design of 18 novel candidates with\nbroad-spectrum potency against Gram-negative bacteria. Subsequent in vitro\nvalidation experiments demonstrate that almost all in silico recommended\ncandidates exhibit notable antibacterial activity, yielding a 94.4% positive\nrate. Two of these candidates exhibit exceptional activity, minimal\nhemotoxicity, substantial stability in human plasma, and a low propensity of\ninducing antibiotic resistance as observed in murine lung infection\nexperiments, showcasing their significant efficacy in reducing bacterial load\nby approximately one hundredfold. The entire process, from in silico design to\nin vitro and in vivo validation, is completed within a timeframe of 48 days.\nMoreover, AMP-Designer demonstrates its remarkable capability in designing\nspecific AMPs to target strains with extremely limited labeled datasets. The\nmost outstanding candidate against Propionibacterium acnes suggested by\nAMP-Designer exhibits an in vitro minimum inhibitory concentration value of 2.0\n$\\mu$g/ml. Through the integration of advanced machine learning methodologies\nsuch as contrastive prompt tuning, knowledge distillation, and reinforcement\nlearning within the AMP-Designer framework, the process of designing AMPs\ndemonstrates exceptional efficiency. This efficiency remains conspicuous even\nin the face of challenges posed by constraints arising from a scarcity of\nlabeled data. These findings highlight the tremendous potential of AMP-Designer\nas a promising approach in combating the global health threat of antibiotic\nresistance.\n","subjects":["Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZgmFAzNqBBUCn1Lr4uAKlDdkXC__RsnqhxWf0GhyIP0","pdfSize":"2409903","objectId":"0xd0da6366af267cad104baf0cc842282a8ab3c3c99865c6a3891bbeab2c4555fb","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
