{"id":"2407.09592","title":"Toward Regulatory Compliance: A few-shot Learning Approach to Extract\n  Processing Activities","authors":"Pragyan KC, Rambod Ghandiparsi, Rocky Slavin, Sepideh Ghanavati,\n  Travis Breaux, Mitra Bokaei Hosseini","authorsParsed":[["KC","Pragyan",""],["Ghandiparsi","Rambod",""],["Slavin","Rocky",""],["Ghanavati","Sepideh",""],["Breaux","Travis",""],["Hosseini","Mitra Bokaei",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 17:56:18 GMT"}],"updateDate":"2024-08-07","timestamp":1720806978000,"abstract":"  The widespread use of mobile applications has driven the growth of the\nindustry, with companies relying heavily on user data for services like\ntargeted advertising and personalized offerings. In this context, privacy\nregulations such as the General Data Protection Regulation (GDPR) play a\ncrucial role. One of the GDPR requirements is the maintenance of a Record of\nProcessing Activities (RoPA) by companies. RoPA encompasses various details,\nincluding the description of data processing activities, their purposes, types\nof data involved, and other relevant external entities. Small app-developing\ncompanies face challenges in meeting such compliance requirements due to\nresource limitations and tight timelines. To aid these developers and prevent\nfines, we propose a method to generate segments of RoPA from user-authored\nusage scenarios using large language models (LLMs). Our method employs few-shot\nlearning with GPT-3.5 Turbo to summarize usage scenarios and generate RoPA\nsegments. We evaluate different factors that can affect few-shot learning\nperformance consistency for our summarization task, including the number of\nexamples in few-shot learning prompts, repetition, and order permutation of\nexamples in the prompts. Our findings highlight the significant influence of\nthe number of examples in prompts on summarization F1 scores, while\ndemonstrating negligible variability in F1 scores across multiple prompt\nrepetitions. Our prompts achieve successful summarization of processing\nactivities with an average 70% ROUGE-L F1 score. Finally, we discuss avenues\nfor improving results through manual evaluation of the generated summaries.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"H4t7uhommFHr_RaMQ7aUankpd1cyhBTWYxP4Li3RLWw","pdfSize":"2183174","objectId":"0x61cfb4ec09a3ea03f6f6cbd1d3246d584e0a63381ebccda7264af573d2820989","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
