{"id":"2407.06738","title":"Failure Transparency in Stateful Dataflow Systems (Technical Report)","authors":"Aleksey Veresov (1), Jonas Spenger (1), Paris Carbone (1 and 2),\n  Philipp Haller (1) ((1) KTH Royal Institute of Technology, (2) RISE Research\n  Institutes of Sweden)","authorsParsed":[["Veresov","Aleksey","","1 and 2"],["Spenger","Jonas","","1 and 2"],["Carbone","Paris","","1 and 2"],["Haller","Philipp",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 10:32:26 GMT"}],"updateDate":"2024-07-10","timestamp":1720521146000,"abstract":"  Failure transparency enables users to reason about distributed systems at a\nhigher level of abstraction, where complex failure-handling logic is hidden.\nThis is especially true for stateful dataflow systems, which are the backbone\nof many cloud applications. In particular, this paper focuses on proving\nfailure transparency in Apache Flink, a popular stateful dataflow system. Even\nthough failure transparency is a critical aspect of Apache Flink, to date it\nhas not been formally proven. Showing that the failure transparency mechanism\nis correct, however, is challenging due to the complexity of the mechanism\nitself. Nevertheless, this complexity can be effectively hidden behind a\nfailure transparent programming interface. To show that Apache Flink is failure\ntransparent, we model it in small-step operational semantics. Next, we provide\na novel definition of failure transparency based on observational\nexplainability, a concept which relates executions according to their\nobservations. Finally, we provide a formal proof of failure transparency for\nthe implementation model; i.e., we prove that the failure-free model correctly\nabstracts from the failure-related details of the implementation model. We also\nshow liveness of the implementation model under a fair execution assumption.\nThese results are a first step towards a verified stack for stateful dataflow\nsystems.\n","subjects":["Computing Research Repository/Programming Languages","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qllapDDLTXsEsRJSw29X7U7cbJDUJPQw3oej993gjqM","pdfSize":"1069354"}
