{"id":"2407.10322","title":"Building Collaborative Learning: Exploring Social Annotation in\n  Introductory Programming","authors":"Francisco Gomes de Oliveira Neto, Felix Dobslaw","authorsParsed":[["Neto","Francisco Gomes de Oliveira",""],["Dobslaw","Felix",""]],"versions":[{"version":"v1","created":"Mon, 17 Jun 2024 08:59:41 GMT"}],"updateDate":"2024-07-16","timestamp":1718614781000,"abstract":"  The increasing demand for software engineering education presents learning\nchallenges in courses due to the diverse range of topics that require practical\napplications, such as programming or software design, all of which are\nsupported by group work and interaction. Social Annotation (SA) is an approach\nto teaching that can enhance collaborative learning among students. In SA, both\nstudents and teachers utilize platforms like Feedback Fruits, Perusall, and\nDiigo to collaboratively annotate and discuss course materials. This approach\nencourages students to share their thoughts and answers with their peers,\nfostering a more interactive learning environment. We share our experience of\nimplementing social annotation via Perusall as a preparatory tool for lectures\nin an introductory programming course aimed at undergraduate students in\nSoftware Engineering. We report the impact of Perusall on the examination\nresults of 112 students. Our results show that 81% of students engaged in\nmeaningful social annotation successfully passed the course. Notably, the\nproportion of students passing the exam tends to rise as they complete more\nPerusall assignments. In contrast, only 56% of students who did not participate\nin Perusall discussions managed to pass the exam. We did not enforce mandatory\nPerusall participation in the course. Yet, the feedback from our course\nevaluation questionnaire reveals that most students ranked Perusall among their\nfavorite components of the course and that their interest in the subject has\nincreased.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1lhBcoWie7NIQENhv82xNL8L5iFVFk8oh3qLbrM2tfE","pdfSize":"1054549","objectId":"0xefc283ee8cd458f1bdd74c9ac3dd07cd43c77345ce2af2d1d0e3635b5a4b9459","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
