{"id":"2407.15708","title":"SwinSF: Image Reconstruction from Spatial-Temporal Spike Streams","authors":"Liangyan Jiang, Chuang Zhu, Yanxu Chen","authorsParsed":[["Jiang","Liangyan",""],["Zhu","Chuang",""],["Chen","Yanxu",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:17:39 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 16:55:08 GMT"}],"updateDate":"2024-07-25","timestamp":1721661459000,"abstract":"  The spike camera, with its high temporal resolution, low latency, and high\ndynamic range, addresses high-speed imaging challenges like motion blur. It\ncaptures photons at each pixel independently, creating binary spike streams\nrich in temporal information but challenging for image reconstruction. Current\nalgorithms, both traditional and deep learning-based, still need to be improved\nin the utilization of the rich temporal detail and the restoration of the\ndetails of the reconstructed image. To overcome this, we introduce Swin\nSpikeformer (SwinSF), a novel model for dynamic scene reconstruction from spike\nstreams. SwinSF is composed of Spike Feature Extraction, Spatial-Temporal\nFeature Extraction, and Final Reconstruction Module. It combines shifted window\nself-attention and proposed temporal spike attention, ensuring a comprehensive\nfeature extraction that encapsulates both spatial and temporal dynamics,\nleading to a more robust and accurate reconstruction of spike streams.\nFurthermore, we build a new synthesized dataset for spike image reconstruction\nwhich matches the resolution of the latest spike camera, ensuring its relevance\nand applicability to the latest developments in spike camera imaging.\nExperimental results demonstrate that the proposed network SwinSF sets a new\nbenchmark, achieving state-of-the-art performance across a series of datasets,\nincluding both real-world and synthesized data across various resolutions. Our\ncodes and proposed dataset will be available soon.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"z57_9f8kD2gLe5phiIoCA8zKxziNfiz3r_s45Pf2Tfs","pdfSize":"26632246","objectId":"0x478b4e331f3065bce1e397276df94881f1f569a91d01bf3562851d63edd17a95","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
