{"id":"2407.01232","title":"The relationship between parameters and effects in transcranial\n  ultrasonic stimulation","authors":"Tulika Nandi (1,2), Benjamin R. Kop (1), Kim Butts Pauly (3),\n  Charlotte J. Stagg (4,5), Lennart Verhagen (1) ((1) Donders Institute for\n  Brain Cognition and Behaviour, Radboud University, Nijmegen, The Netherlands,\n  (2) Department of Human Movement Sciences, Vrije Universiteit Amsterdam,\n  Amsterdam, The Netherlands, (3) Department of Radiology, Stanford University,\n  Stanford, CA, USA, (4) Wellcome Centre for Integrative Neuroimaging, FMRIB,\n  Nuffield Department of Clinical Neurosciences, University of Oxford, Oxford,\n  UK, (5) Medical Research Council Brain Network Dynamics Unit, Nuffield\n  Department of Clinical Neurosciences, University of Oxford, Oxford, UK)","authorsParsed":[["Nandi","Tulika",""],["Kop","Benjamin R.",""],["Pauly","Kim Butts",""],["Stagg","Charlotte J.",""],["Verhagen","Lennart",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 12:23:35 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 06:47:04 GMT"}],"updateDate":"2024-07-04","timestamp":1719836615000,"abstract":"  Transcranial ultrasonic stimulation (TUS) is rapidly gaining traction for\nnon-invasive human neuromodulation, with a pressing need to establish protocols\nthat maximise neuromodulatory efficacy. In this review, we aggregate and\nexamine empirical evidence for the relationship between tunable TUS parameters\nand in vitro and in vivo outcomes. Based on this multiscale approach, TUS\nresearchers can make better informed decisions about optimal parameter\nsettings. Importantly, we also discuss the challenges involved in extrapolating\nresults from prior empirical work to future interventions, including the\ntranslation of protocols between models and the complex interaction between TUS\nprotocols and the brain. A synthesis of the empirical evidence suggests that\nlarger effects will be observed at lower frequencies within the sub-MHz range,\nhigher intensities and pressures than commonly administered thus far, and\nlonger pulses and pulse train durations. Nevertheless, we emphasise the need\nfor cautious interpretation of empirical data from different experimental\nparadigms when basing protocols on prior work as we advance towards refined TUS\nparameters for human neuromodulation.\n","subjects":["Physics/Biological Physics","Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kBYF1TlzGeL7txCY-qQxDqUQ2JqAWcKR6GTjNgHSBfM","pdfSize":"798662","objectId":"0xdc59997e2c8be18ddfbcb5b0cfcb2aa374d0b0d036f2a12a4b8642bf1b262399","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
