{"id":"2407.17906","title":"Hierarchical Object Detection and Recognition Framework for Practical\n  Plant Disease Diagnosis","authors":"Kohei Iwano, Shogo Shibuya, Satoshi Kagiwada, Hitoshi Iyatomi","authorsParsed":[["Iwano","Kohei",""],["Shibuya","Shogo",""],["Kagiwada","Satoshi",""],["Iyatomi","Hitoshi",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 09:51:14 GMT"}],"updateDate":"2024-07-26","timestamp":1721901074000,"abstract":"  Recently, object detection methods (OD; e.g., YOLO-based models) have been\nwidely utilized in plant disease diagnosis. These methods demonstrate\nrobustness to distance variations and excel at detecting small lesions compared\nto classification methods (CL; e.g., CNN models). However, there are issues\nsuch as low diagnostic performance for hard-to-detect diseases and high\nlabeling costs. Additionally, since healthy cases cannot be explicitly trained,\nthere is a risk of false positives. We propose the Hierarchical object\ndetection and recognition framework (HODRF), a sophisticated and highly\nintegrated two-stage system that combines the strengths of both OD and CL for\nplant disease diagnosis. In the first stage, HODRF uses OD to identify regions\nof interest (ROIs) without specifying the disease. In the second stage, CL\ndiagnoses diseases surrounding the ROIs. HODRF offers several advantages: (1)\nSince OD detects only one type of ROI, HODRF can detect diseases with limited\ntraining images by leveraging its ability to identify other lesions. (2) While\nOD over-detects healthy cases, HODRF significantly reduces these errors by\nusing CL in the second stage. (3) CL's accuracy improves in HODRF as it\nidentifies diagnostic targets given as ROIs, making it less vulnerable to size\nchanges. (4) HODRF benefits from CL's lower annotation costs, allowing it to\nlearn from a larger number of images. We implemented HODRF using YOLOv7 for OD\nand EfficientNetV2 for CL and evaluated its performance on a large-scale\ndataset (4 crops, 20 diseased and healthy classes, 281K images). HODRF\noutperformed YOLOv7 alone by 5.8 to 21.5 points on healthy data and 0.6 to 7.5\npoints on macro F1 scores, and it improved macro F1 by 1.1 to 7.2 points over\nEfficientNetV2.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SZKSiZatGl6YHKGaeDhu94UEkXBXRmarevmpff7Ntfo","pdfSize":"4472578","objectId":"0xeb344a527cc47def13b32f123c2338a7f173d6b1b67b4ea4c2945e3509b671b3","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
