{"id":"2407.20919","title":"System size dependence of energy loss and correlations of heavy mesons\n  at LHC energies","authors":"Jiaxing Zhao, Joerg Aichelin, Pol Bernard Gossiaux, and Klaus Werner","authorsParsed":[["Zhao","Jiaxing",""],["Aichelin","Joerg",""],["Gossiaux","Pol Bernard",""],["Werner","Klaus",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 15:58:10 GMT"}],"updateDate":"2024-07-31","timestamp":1722355090000,"abstract":"  We study the system size dependence of heavy quark (HQ) observables at a\ncenter of mass energy of $\\sqrt{s_{\\rm NN}}=5.02$ TeV to explore whether it can\nprovide further constraints on the physical processes which are involved:\nenergy loss of HQs in the quark gluon plasma (QGP), hadronization and hadronic\nrescattering. We use the EPOS4HQ approach to study p-p and 0-10\\% central O-O,\nAr-Ar, Kr-Kr and Pb-Pb reactions and investigate in detail the momentum change\nof heavy quarks from creation until their detection as part of a hadron as well\nas the enhancement of heavy baryon production at low $p_T$. We investigate\nfurthermore the origin and the system size dependence of the azimuthal\ncorrelations between the heavy quark $Q$ and the heavy antiquark $\\bar Q$ and\nhow one can bypass the problem that correlations are washed out due to the\ncombinatorial background. We conclude that a systematic study of the system\nsize dependence of the momentum loss allows to separate the momentum loss due\nto the passage through the QGP from the momentum change due to hadronization\nand the $Q\\bar Q$ correlations allow to gain inside into the different pQCD\nprocesses in which the heavy quarks are created.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GluTiOaBNsspHoUMdcR2pWKhoFTOQDZZa7HYhl5H6Is","pdfSize":"22951649","objectId":"0x6bbe576eb0bdbffb16577a481d6141c9980f6428dad7e43e086875ed0028c625","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
