{"id":"2407.10588","title":"METIS high-contrast imaging: from final design to manufacturing and\n  testing","authors":"Olivier Absil, Matthew Kenworthy, Christian Delacroix, Gilles Orban de\n  Xivry, Lorenzo K\\\"onig, Prashant Pathak, David Doelman, Emiel Por, Frans\n  Snik, Joost van den Born, Faustine Cantalloube, Alexis Carlotti, Benjamin\n  Courtney-Barrer, Pontus Forsberg, Mikael Karlsson, Thomas Bertram, Roy van\n  Boekel, Dennis Dolkens, Markus Feldt, Adrian M. Glauser, Eric Pantin, Sascha\n  P. Quanz, Felix Bettonvil, Bernhard Brandl","authorsParsed":[["Absil","Olivier",""],["Kenworthy","Matthew",""],["Delacroix","Christian",""],["de Xivry","Gilles Orban",""],["König","Lorenzo",""],["Pathak","Prashant",""],["Doelman","David",""],["Por","Emiel",""],["Snik","Frans",""],["Born","Joost van den",""],["Cantalloube","Faustine",""],["Carlotti","Alexis",""],["Courtney-Barrer","Benjamin",""],["Forsberg","Pontus",""],["Karlsson","Mikael",""],["Bertram","Thomas",""],["van Boekel","Roy",""],["Dolkens","Dennis",""],["Feldt","Markus",""],["Glauser","Adrian M.",""],["Pantin","Eric",""],["Quanz","Sascha P.",""],["Bettonvil","Felix",""],["Brandl","Bernhard",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 10:12:38 GMT"}],"updateDate":"2024-07-16","timestamp":1721038358000,"abstract":"  The Mid-infrared ELT Imager and Spectrograph (METIS) is one of the\nfirst-generation scientific instruments for the ELT, built under the\nsupervision of ESO by a consortium of research institutes across and beyond\nEurope. Designed to cover the 3 to 13 $\\mu$m wavelength range, METIS had its\nfinal design reviewed in Fall 2022, and has then entered in earnest its\nmanufacture, assembly, integration, and test (MAIT) phase. Here, we present the\nfinal design of the METIS high-contrast imaging (HCI) modes. We detail the\nimplementation of the two main coronagraphic solutions selected for METIS,\nnamely the vortex coronagraph and the apodizing phase plate, including their\ncombination with the high-resolution integral field spectrograph of METIS, and\nbriefly describe their respective backup plans (Lyot coronagraph and shaped\npupil plate). We then describe the status of the MAIT phase for HCI modes,\nincluding a review of the final design of individual components such as the\nvortex phase masks, the grayscale ring apodizer, and the apodizing phase\nplates, as well as a description of their on-going performance tests and of our\nplans for system-level integration and tests. Using end-to-end simulations, we\npredict the performance that will be reached on sky by the METIS HCI modes in\npresence of various environmental and instrumental disturbances, including\nnon-common path aberrations and water vapor seeing, and discuss our strategy to\nmitigate these various effects. We finally illustrate with mock observations\nand data processing that METIS should be capable of directly imaging temperate\nrocky planets around the nearest stars.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9qaoTzlTNKuW5qwKsuXjG3rK4SznTuSpa08UgUMbCTw","pdfSize":"10098050","objectId":"0x323f3892188df1a7f3bbe6850bb4351be102a747bbe5561ee79cc1ad90a5c568","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
