{"id":"2407.17425","title":"Media Manipulations in the Coverage of Events of the Ukrainian\n  Revolution of Dignity: Historical, Linguistic, and Psychological Approaches","authors":"Ivan Khoma, Solomia Fedushko, and Zoryana Kunch","authorsParsed":[["Khoma","Ivan",""],["Fedushko","Solomia",""],["Kunch","Zoryana",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 09:46:27 GMT"}],"updateDate":"2024-07-25","timestamp":1720518387000,"abstract":"  This article examines the use of manipulation in the coverage of events of\nthe Ukrainian Revolution of Dignity in the mass media, namely in the content of\nthe online newspaper Ukrainian Truth (Ukrainska pravda), online newspaper High\nCastle (Vysokyi Zamok), and online newspaper ZIK during the public protest,\nnamely during the Ukrainian Revolution of Dignity. Contents of these online\nnewspapers the historical, linguistic, and psychological approaches are used.\nAlso media manipulations in the coverage of events of the Ukrainian Revolution\nof Dignity are studied. Internet resources that cover news are analyzed.\nCurrent and most popular Internet resources are identified. The content of\nonline newspapers is analyzed and statistically processed. Internet content of\nnewspapers by the level of significance of data (very significant data,\nsignificant data and insignificant data) is classified. The algorithm of\ndetection of the media manipulations in the highlighting the course of the\nUkrainian revolutions based on historical, linguistic, and psychological\napproaches is designed. Methods of counteracting information attacks in online\nnewspapers are developed.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HLtm7rYAn3h21Xn8yjc2vs6TwKn_Vlox46vW6NH3jl4","pdfSize":"884433","objectId":"0x9ce315e511dd65a9b65df2b8de505b5cf3fad421bbce208a0bf191f8d6a09b2c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
