{"id":"2407.18233","title":"One-point Statistics in various cosmic environments in the presence of\n  massive neutrinos","authors":"Mohadese Khoshtinat, Hossein Hatamnia, Shant Baghram","authorsParsed":[["Khoshtinat","Mohadese",""],["Hatamnia","Hossein",""],["Baghram","Shant",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 17:51:01 GMT"}],"updateDate":"2024-07-26","timestamp":1721929861000,"abstract":"  Studying the structures (halos and galaxies) within the cosmic environments\n(void, sheet, filament, and node) where they reside is an ongoing attempt in\ncosmological studies. The link between the properties of structures and the\ncosmic environments may help to unravel the nature of the dark sector of the\nUniverse. In this paper, we study the cosmic web environments from the spatial\npattern perspective in the context of $ \\Lambda $CDM and $ \\nu \\Lambda $CDM as\nan example of an extension to the vanilla model. To do this, we use the T-web\nclassification method and classify the cosmic environments for the catalogues\nfrom the gevolution N-body simulations for $ \\Lambda $CDM and $ \\nu \\Lambda\n$CDM cosmology. Then, we compute the first nearest neighbour cumulative\ndistribution function, spherical contact cumulative distribution function, and\n$ J$-function for every cosmic environment. In the context of the standard\nmodel, the results indicate that these functions can differentiate the various\ncosmic environments. In association with distinguishing between extensions of\nthe standard model of cosmologies, these functions within the cosmic\nenvironment seem beneficial as a complementary probe.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tqCYKgDZJkNvXDb9BawzWddhjIxtNyKhAPupvt7J9o8","pdfSize":"1320476","objectId":"0xe013426a7fe2741a41e3533e31ed0d5648054f49c0d0ab7011e2b77fbf5553f0","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
