{"id":"2407.20216","title":"Tetrahedral grids in Monte Carlo radiative transfer","authors":"Arno Lauwers, Maarten Baes, Peter Camps, Bert Vander Meulen","authorsParsed":[["Lauwers","Arno",""],["Baes","Maarten",""],["Camps","Peter",""],["Meulen","Bert Vander",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 17:50:24 GMT"}],"updateDate":"2024-07-30","timestamp":1722275424000,"abstract":"  Context. 3D numerical simulations of radiative transfer are crucial for\nunderstanding complex astrophysical objects. For Monte Carlo radiative\ntransfer, the spatial grid design is critical yet complex. Common grids include\nhierarchical octree and unstructured Voronoi grids, each with its own strengths\nand weaknesses. Tetrahedral grids, widely used in ray-tracing graphics, are a\npotential alternative. Aims. We explore the possibilities, advantages, and\nlimitations of tetrahedral grids for Monte Carlo radiative transfer, comparing\ntheir performance with other grid structures. Method. We integrated a\ntetrahedral grid structure, using the TetGen library, into the SKIRT Monte\nCarlo radiative transfer code. Tetrahedral grids can be imported or adaptively\nconstructed and refined within SKIRT. We implemented an efficient grid\ntraversal method using Pl\\\"ucker coordinates and Pl\\\"ucker products. Results.\nWe validated the tetrahedral grid construction and traversal algorithm with 2D\nradiative transfer benchmarks. In a simple 3D model, we compared the\nperformance of tetrahedral, octree, and Voronoi grids. The octree grid\noutperformed the others in traversal speed, while the tetrahedral grid had the\nlowest grid quality. Overall, tetrahedral grids performed worse than octree and\nVoronoi grids. Conclusion. While tetrahedral grids may not be ideal for most\nastrophysical simulations, they offer a viable unstructured alternative to\nVoronoi grids for specific applications, such as post-processing hydrodynamical\nsimulations on tetrahedral or unstructured grids.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JCRQ70WtVvXLPS6JacLiJA47ctOQkIt04sQwebS_stE","pdfSize":"1942999","objectId":"0xce8580695bdaeaf0339a6cd82ebbb429b86dbc129373c78959c4a59767b8c19c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
