{"id":"2407.00153","title":"MIDIS. Near-infrared rest-frame morphology of massive galaxies at\n  $3<z<5.5$ in the Hubble eXtreme Deep Field","authors":"L. Costantin, S. Gillman, L. A. Boogaard, P. G. P\\'erez-Gonz\\'alez, E.\n  Iani, P. Rinaldi, J. Melinder, A. Crespo G\\'omez, L. Colina, T. R. Greve, G.\n  \\\"Ostlin, G. Wright, A. Alonso-Herrero, J. \\'Alvarez-M\\'arquez, M.\n  Annunziatella, A. Bik., K. I. Caputi, D. Dicken, A. Eckart, J. Hjorth, O.\n  Ilbert, I. Jermann, A. Labiano, D. Langeroodi, F. Pei{\\ss}ker, J. P. Pye, T.\n  V. Tikkanen, P. P. van der Werf, F. Walter, M. Ward, M. G\\\"udel and T. K.\n  Henning","authorsParsed":[["Costantin","L.",""],["Gillman","S.",""],["Boogaard","L. A.",""],["Pérez-González","P. G.",""],["Iani","E.",""],["Rinaldi","P.",""],["Melinder","J.",""],["Gómez","A. Crespo",""],["Colina","L.",""],["Greve","T. R.",""],["Östlin","G.",""],["Wright","G.",""],["Alonso-Herrero","A.",""],["Álvarez-Márquez","J.",""],["Annunziatella","M.",""],["Bik.","A.",""],["Caputi","K. I.",""],["Dicken","D.",""],["Eckart","A.",""],["Hjorth","J.",""],["Ilbert","O.",""],["Jermann","I.",""],["Labiano","A.",""],["Langeroodi","D.",""],["Peißker","F.",""],["Pye","J. P.",""],["Tikkanen","T. V.",""],["van der Werf","P. P.",""],["Walter","F.",""],["Ward","M.",""],["Güdel","M.",""],["Henning","T. K.",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 18:00:01 GMT"}],"updateDate":"2024-07-02","timestamp":1719597601000,"abstract":"  Thanks to decades of observations using HST, the structure of galaxies at\nredshift $z>2$ has been widely studied in the rest-frame ultraviolet regime,\nwhich traces recent star formation from young stellar populations. But, we\nstill have little information about the spatial distribution of the older, more\nevolved, stellar populations, constrained by the rest-frame infrared portion of\ngalaxies' spectral energy distribution. We present the morphological\ncharacterization of a sample of 21 massive galaxies\n($\\log(M_{\\star}/M_{\\odot})>9.5$) at redshift $3<z<5.5$. These galaxies are\nobserved as part of the GTO program MIDIS with the Mid-Infrared Instrument\n(MIRI) onboard JWST. The deep MIRI 5.6~$\\mu$m imaging allows us to characterize\nfor the first time the rest-frame near-infrared structure of galaxies beyond\ncosmic noon, at higher redshifts than possible with NIRCam, tracing their older\nstellar populations. We derive the galaxies' non-parametric morphology and\nmodel the galaxies' light distribution with a S\\'ersic component. We find that\nat $z>3$ massive galaxies show a smooth distribution of their rest-infrared\nlight, strongly supporting the increasing number of regular disk galaxies\nalready in place at early epochs. On the contrary, the ultraviolet structure\nobtained from HST observations is generally more irregular, catching the most\nrecent episodes of star formation. Importantly, we find a segregation of\nmorphologies across cosmic time, having massive galaxies at redshift $z>4$\nlater-type morphologies compared to $z\\sim3$ galaxies. These findings suggest a\ntransition phase in galaxy assembly and central mass build up already taking\nplace at $z\\sim3-4$. MIRI provides unique information about the structure of\nthe mature stellar population of high-redshift galaxies, unveiling that massive\ngalaxies beyond cosmic noon are prevalently compact disk galaxies with smooth\nmass distribution.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8IlGwPns50tbB0PmALW0qCyZKTwxAf6X-MADv1OH42U","pdfSize":"582440","objectId":"0x8f4b58d4ab4e3d8677b57fe77d01be45d53b9dd1ee91f02eb452719127e34351","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
