{"id":"2407.16132","title":"Users Feel Guilty: Measurement of Illegal Software Installation Guide\n  Videos on YouTube for Malware Distribution","authors":"Rei Yamagishi, Shota Fujii, Tatsuya Mori","authorsParsed":[["Yamagishi","Rei",""],["Fujii","Shota",""],["Mori","Tatsuya",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 02:32:52 GMT"}],"updateDate":"2024-07-24","timestamp":1721701972000,"abstract":"  This study introduces and examines a sophisticated malware distribution\ntechnique that exploits popular video sharing platforms. In this attack, threat\nactors distribute malware through deceptive content that promises free versions\nof premium software and game cheats. Throughout this paper, we call this attack\nMalTube. MalTube is particularly insidious because it exploits the guilt\nfeelings of users for engaging in potentially illegal activity, making them\nless likely to report the infection or ask for a help. To investigate this\nemerging threat, we developed video platform exploitation reconnaissance VIPER,\na novel monitoring system designed to detect, monitor, and analyze MalTube\nactivity at scale. Over a four-month data collection period, VIPER processed\nand analyzed 14,363 videos, 8,671 associated channels, and 1,269 unique fully\nqualified domain names associated with malware downloads. Our findings reveal\nthat MalTube attackers primarily target young gamers, using the lure of free\nsoftware and game cheats as infection vectors. The attackers employ various\nsophisticated social engineering techniques to maximize user engagement and\nensure successful malware propagation. These techniques include the strategic\nuse of platform-specific features such as trending keywords, emoticons, and\neye-catching thumbnails. These tactics closely mimic legitimate content\ncreation strategies while providing detailed instructions for malware\ninfection. Based on our in-depth analysis, we propose a set of robust detection\nand mitigation strategies that exploit the invariant characteristics of MalTube\nvideos, offering the potential for automated threat detection and prevention.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"hRuxziVqBsw3YpOc8TUIr-A0DXnz2391gWjgqfbsA44","pdfSize":"1167716","objectId":"0x23d3ac31fd345fcddb0cf2fb4c930651736bb839b66bb720fd3736079c7c920c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
