{"id":"2407.16608","title":"Deep Bayesian segmentation for colon polyps: Well-calibrated predictions\n  in medical imaging","authors":"Daniela L. Ramos, Hector J. Hortua","authorsParsed":[["Ramos","Daniela L.",""],["Hortua","Hector J.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 16:13:27 GMT"}],"updateDate":"2024-07-24","timestamp":1721751207000,"abstract":"  Colorectal polyps are generally benign alterations that, if not identified\npromptly and managed successfully, can progress to cancer and cause\naffectations on the colon mucosa, known as adenocarcinoma. Today advances in\nDeep Learning have demonstrated the ability to achieve significant performance\nin image classification and detection in medical diagnosis applications.\nNevertheless, these models are prone to overfitting, and making decisions based\nonly on point estimations may provide incorrect predictions. Thus, to obtain a\nmore informed decision, we must consider point estimations along with their\nreliable uncertainty quantification. In this paper, we built different Bayesian\nneural network approaches based on the flexibility of posterior distribution to\ndevelop semantic segmentation of colorectal polyp images. We found that these\nmodels not only provide state-of-the-art performance on the segmentation of\nthis medical dataset but also, yield accurate uncertainty estimates. We applied\nmultiplicative normalized flows(MNF) and reparameterization trick on the UNET,\nFPN, and LINKNET architectures tested with multiple backbones in deterministic\nand Bayesian versions. We report that the FPN + EfficientnetB7 architecture\nwith MNF is the most promising option given its IOU of 0.94 and Expected\nCalibration Error (ECE) of 0.004, combined with its superiority in identifying\ndifficult-to-detect colorectal polyps, which is effective in clinical areas\nwhere early detection prevents the development of colon cancer.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NfhTGYJ4L2zU6m1gOojzdpp0pbX8y3jo9hUQt5E01RM","pdfSize":"7875692","objectId":"0xf76a318bf7131821154d7b91828581f0ce4ed03a8e122f047c66651aa7bcf3a5","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
