{"id":"2407.10296","title":"Modern Information Technologies in Scientific Research and Educational\n  Activities","authors":"Kyrylo Malakhov, Vadislav Kaverinskiy, Liliia Ivanova, Oleksandr\n  Romanyuk, Oksana Romaniuk, Svitlana Voinova, Sergii Kotlyk, Oksana Sokolova","authorsParsed":[["Malakhov","Kyrylo",""],["Kaverinskiy","Vadislav",""],["Ivanova","Liliia",""],["Romanyuk","Oleksandr",""],["Romaniuk","Oksana",""],["Voinova","Svitlana",""],["Kotlyk","Sergii",""],["Sokolova","Oksana",""]],"versions":[{"version":"v1","created":"Sat, 4 May 2024 14:24:47 GMT"}],"updateDate":"2024-07-16","timestamp":1714832687000,"abstract":"  The monograph summarizes and analyzes the current state of scientific\nresearch in the field of interactive artificial intelligence systems, text\ngeneration systems, diagnostics of the competitiveness of specialists, in the\nareas of correct color rendering in image formation, informatization of the\nwork of graduate students, accessible technology for creating three-dimensional\n3D models. The monograph will be useful both to specialists and employees of\ncompanies working in the IT field, as well as teachers, masters, students and\ngraduate students of higher educational institutions, as well as anyone\ninterested in issues related to information technology. The monograph was\ncompiled based on the results of the 16-th international scientific and\npractical conference Information technologies and automation - 2023, which took\nplace in October 2023 at Odessa National University of Technology.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"IyG3YlcKEQmSPruyFs3AbwRRYLxpFsfb70jZ8wpm7XM","pdfSize":"26213288","objectId":"0x410a9a7ddf78dbab628e70f26b34e775623b97ddfa6be351fb08ccb35f745cd4","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
