{"id":"2407.07896","title":"Pentagonal Photonic Crystal Mirrors: Scalable Lightsails with Enhanced\n  Acceleration via Neural Topology Optimization","authors":"L. Norder, S. Yin, M. J. de Jong, F. Stallone, H. Aydogmus, P. M.\n  Sberna, M. A. Bessa and R. A. Norte","authorsParsed":[["Norder","L.",""],["Yin","S.",""],["de Jong","M. J.",""],["Stallone","F.",""],["Aydogmus","H.",""],["Sberna","P. M.",""],["Bessa","M. A.",""],["Norte","R. A.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 17:59:55 GMT"}],"updateDate":"2024-07-11","timestamp":1720634395000,"abstract":"  The Starshot Breakthrough Initiative aims to send one-gram microchip probes\nto Alpha Centauri within 20 years, using gram-scale lightsails propelled by\nlaser-based radiation pressure, reaching velocities nearing a fifth of light\nspeed. This mission requires lightsail materials that challenge the\nfundamentals of nanotechnology, requiring innovations in optics, material\nscience and structural engineering. Unlike the microchip payload, which must be\nminimized in every dimension, such lightsails need meter-scale dimensions with\nnanoscale thickness and billions of nanoscale holes to enhance reflectivity and\nreduce mass. Our study employs neural topology optimization, revealing a novel\npentagonal lattice-based photonic crystal (PhC) reflector. The optimized\ndesigns shorten acceleration times, therefore lowering launch costs\nsignificantly. Crucially, these designs also enable lightsail material\nfabrication with orders-of-magnitude reduction in costs. We have fabricated a\n60 x 60 mm$^2$, 200nm thick, single-layer reflector perforated with over a\nbillion nanoscale features; the highest aspect-ratio nanophotonic element to\ndate. We achieve this with nearly 9,000 times cost reduction per m$^2$.\nStarshot lightsails will have several stringent requirements but will\nultimately be driven by costs to build at scale. Here we highlight challenges\nand possible solutions in developing lightsail materials - showcasing the\npotential of scaling nanophotonics for cost-effective next-generation space\nexploration.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics","Computing Research Repository/Machine Learning","Physics/Applied Physics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2a30Fg166iD129zpKNSz-NgDJ3mLRTstNjGJNIhl1sM","pdfSize":"20534373","objectId":"0x6a9c5b1fb830d2739df137765380231e6444a2fd1a8fded19d43838f0222fd41","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
