{"id":"2407.08317","title":"Inference procedures in sequential trial emulation with survival\n  outcomes: comparing confidence intervals based on the sandwich variance\n  estimator, bootstrap and jackknife","authors":"Juliette M. Limozin, Shaun R. Seaman, Li Su","authorsParsed":[["Limozin","Juliette M.",""],["Seaman","Shaun R.",""],["Su","Li",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 09:07:34 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 08:16:08 GMT"}],"updateDate":"2024-07-15","timestamp":1720688854000,"abstract":"  Sequential trial emulation (STE) is an approach to estimating causal\ntreatment effects by emulating a sequence of target trials from observational\ndata. In STE, inverse probability weighting is commonly utilised to address\ntime-varying confounding and/or dependent censoring. Then structural models for\npotential outcomes are applied to the weighted data to estimate treatment\neffects. For inference, the simple sandwich variance estimator is popular but\nconservative, while nonparametric bootstrap is computationally expensive, and a\nmore efficient alternative, linearised estimating function (LEF) bootstrap, has\nnot been adapted to STE. We evaluated the performance of various methods for\nconstructing confidence intervals (CIs) of marginal risk differences in STE\nwith survival outcomes by comparing the coverage of CIs based on\nnonparametric/LEF bootstrap, jackknife, and the sandwich variance estimator\nthrough simulations. LEF bootstrap CIs demonstrated the best coverage with\nsmall/moderate sample sizes, low event rates and low treatment prevalence,\nwhich were the motivating scenarios for STE. They were less affected by\ntreatment group imbalance and faster to compute than nonparametric bootstrap\nCIs. With large sample sizes and medium/high event rates, the\nsandwich-variance-estimator-based CIs had the best coverage and were the\nfastest to compute. These findings offer guidance in constructing CIs in causal\nsurvival analysis using STE.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZgakWRZOjMhyj-rNkjAv-5h-FTzwSt2U2TQvXP5GuUU","pdfSize":"14852680","objectId":"0xd5822f5bd4161c38f5c3879a1494b262ac73437b19769d4d47a82eff6923d24e","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
