{"id":"2407.10365","title":"Implications of scattering for CMB foreground emission modelling","authors":"Jia-Rui Li, Jacques Delabrouille, Yi-Fu Cai, Dongdong Zhang","authorsParsed":[["Li","Jia-Rui",""],["Delabrouille","Jacques",""],["Cai","Yi-Fu",""],["Zhang","Dongdong",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 00:08:43 GMT"}],"updateDate":"2024-07-25","timestamp":1721002123000,"abstract":"  Context. The extreme precision and accuracy of forthcoming observations of\nCMB temperature and polarization anisotropies, aiming to detect the tiny\nsignatures of primordial gravitational waves or of light relic particles beyond\nthe standard three light neutrinos, requires commensurate precision in the\nmodelling of foreground Galactic emission that contaminates CMB observations.\n  Aims. We evaluate the impact of second-order effects in Galactic foreground\nemission due to Thomson scattering off interstellar free electrons and to\nRayleigh scattering off interstellar dust particles.\n  Methods. We use existing sky survey data and models of the distribution of\nfree electrons and dust within the Milky Way to estimate the amplitude and\npower spectra of the emission originating from radiation scattered either by\nfree electrons or by dust grains at CMB frequencies.\n  Results. Both processes generate corrections to the total emission that are\nsmall compared to direct emission, and are small enough not to pose problems\nfor current-generation observations.\n  Conclusions. However, B-modes generated by Thomson scattering of incoming\nradiation by interstellar free electrons at CMB frequencies are within an order\nof magnitude of the sensitivity of the most advanced forthcoming CMB\ntelescopes, and might require more precise evaluation in the future.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"yUXq8M7X-gnuuUhHd4RvdpnTXEt1UB-3E5Zp9BjEo2c","pdfSize":"3134226","objectId":"0xe113c3326a90fe5ef28379127915d949861fe5e604c1bf2af174b6baf99b3f63","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
