{"id":"2407.20864","title":"Mechanisms for a Spring Peak in East Asian Cyclone Activity","authors":"Satoru Okajima, Hisashi Nakamura, Akira Kuwano-Yoshida, Rhys Parfitt","authorsParsed":[["Okajima","Satoru",""],["Nakamura","Hisashi",""],["Kuwano-Yoshida","Akira",""],["Parfitt","Rhys",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 14:39:52 GMT"}],"updateDate":"2024-07-31","timestamp":1722350392000,"abstract":"  The frequency of extratropical cyclones in East Asia, including those\ntraveling along the Kuroshio off the south coast of Japan, maximizes\nclimatologically in spring in harmony with local enhancement of precipitation.\nThe springtime cyclone activity is of great socioeconomic importance for East\nAsian countries. However, mechanisms for the spring peak in the East Asian\ncyclone activity have been poorly understood. This study aims to unravel the\nmechanisms, focusing particularly on favorable conditions for relevant\ncyclogenesis. Through a composite analysis based on atmospheric reanalysis\ndata, we show that cyclogenesis enhanced around the East China Sea under\nanomalously strengthened cyclonic wind shear and temperature gradient, in\naddition to enhanced moisture flux from the south, is important for the spring\npeak in the cyclone activity in East Asia. In spring, climatologically\nstrengthened cyclonic shear north of the low-level jet axis and associated\nfrequent atmospheric frontogenesis in southern China and the East China Sea\nserve as favorable background conditions for low-level cyclogenesis. We also\ndemonstrate that climatologically enhanced diabatic heating around East Asia is\npivotal in strengthening of the low-level jet through a set of linear\nbaroclinic model experiments. Our findings suggest the importance of the\nseasonal evolution of diabatic heating in East Asia for that of the climate\nsystem around East Asia from winter to spring, encompassing the spring peak in\nthe cyclone activity and climatological precipitation.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"QVDuCPILOHkIHDS01Im_qhBkSauq4PxXvF2ms0z2sxc","pdfSize":"5380535","objectId":"0x4baed0652bf870cd42d58e1c89fd17cfd73b8086823464a0b6c027f7f45b1f7d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
