{"id":"2407.13191","title":"Water drop impact on thin viscous oil layers","authors":"Surjit Bharatsingh, Piyush Sahu, Gaurav Salwan, Dileep Mampallil","authorsParsed":[["Bharatsingh","Surjit",""],["Sahu","Piyush",""],["Salwan","Gaurav",""],["Mampallil","Dileep",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 06:01:38 GMT"}],"updateDate":"2024-07-19","timestamp":1721282498000,"abstract":"  We conducted experimental investigations into the short-term and long-term\nimpact dynamics of pure water drops on silicone oil-coated surfaces. Our\nobservations revealed distinct phases: initially, rapid maximal spreading\nfollowed by retraction, subsequent oscillations characterized by a relatively\nstable contact angle, and a final phase involved the gradual spreading of the\ndrop on the underlying solid surface due to the rupturing of the oil layer. The\nmaximal spreading radius follows $We^{1/4}$ scaling, where $We$ is the Weber\nnumber, independent of the viscosity of the underlying oil layer. By\nintroducing fluorescent tracer particles in the oil, we noted that the drop\nexpanded over the oil layer during the initial spreading without displacing\noil. Subsequently, as the oscillations dampen, the drop ruptures the oil layer,\ninitiating a dewetting process and spreads over the solid surface, leaving a\ntiny oil droplet under the water drop. Upon completion of this dewetting\nprocess, the onset time for the drop spreading nonlinearly increased with the\noil layer thickness as $\\sim d_o^2$, which we attribute to the dewetting\ndynamics. Our findings unveil intriguing dynamics of water drops impacting on\noil-coated surfaces.\n","subjects":["Physics/Fluid Dynamics","Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JUKbgbtE9_kKEVWugxz9VLN3RXqIW-5JzkjEYdJ0Cc0","pdfSize":"1977227","objectId":"0x49d8d710a34bf730eba70fef6165f68d11ce9362028d7e700e08d76d648105e5","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
