{"id":"2407.09797","title":"ScaleRAFT: Cross-Scale Recurrent All-Pairs Field Transforms for 3D\n  Motion Estimation","authors":"Han Ling and Quansen Sun","authorsParsed":[["Ling","Han",""],["Sun","Quansen",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 07:58:48 GMT"}],"updateDate":"2024-07-16","timestamp":1720857528000,"abstract":"  In this paper, we study the problem of estimating the 3D motion of dense\npixels from continuous image pairs. Most previous methods are based on mature\noptical flow baselines and depth values, projecting the 2D motion on pixel\nplanes into 3D space, and further optimizing the results by combining\ndepth-motion-branch and other sub-modules. This stacked framework cannot\nleverage the complementarity between optical flow and other modules nor escape\nthe dependence on accurate depth information. To address the above challenges,\nwe propose a normalized scene flow framework, ScaleRAFT, based on cross-scale\nmatching. Its core feature is directly matching objects between two frames in\n3D scale space, i.e. matching features at the correct location and scale.\nUnlike previous methods, ScaleRAFT integrates optical flow and deep motion\nestimation into a unified architecture, allowing the optical flow pipeline and\ndeep motion estimation to promote each other mutually. Moreover, ScaleRAFT\nestimates motion in the depth direction based on feature matching, breaking\naway from the dependence on accurate depth information. Experimentally, our\nmethod has achieved the best foreground performance so far in motion estimation\ntasks in driving scenarios, and has significantly improved various downstream\n3D tasks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"gXQPNoj3Jftz06kK1difo9fNxw68aLWYzYQmQzTGyw8","pdfSize":"3470630","objectId":"0xa1b84ec03747dcf436fea9e5793a00a46e18c00b2455555d81e93bf87effe50e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
