{"id":"2407.08790","title":"Large Models of What? Mistaking Engineering Achievements for Human\n  Linguistic Agency","authors":"Abeba Birhane and Marek McGann","authorsParsed":[["Birhane","Abeba",""],["McGann","Marek",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 18:06:01 GMT"}],"updateDate":"2024-07-15","timestamp":1720721161000,"abstract":"  In this paper we argue that key, often sensational and misleading, claims\nregarding linguistic capabilities of Large Language Models (LLMs) are based on\nat least two unfounded assumptions; the assumption of language completeness and\nthe assumption of data completeness. Language completeness assumes that a\ndistinct and complete thing such as `a natural language' exists, the essential\ncharacteristics of which can be effectively and comprehensively modelled by an\nLLM. The assumption of data completeness relies on the belief that a language\ncan be quantified and wholly captured by data. Work within the enactive\napproach to cognitive science makes clear that, rather than a distinct and\ncomplete thing, language is a means or way of acting. Languaging is not the\nkind of thing that can admit of a complete or comprehensive modelling. From an\nenactive perspective we identify three key characteristics of enacted language;\nembodiment, participation, and precariousness, that are absent in LLMs, and\nlikely incompatible in principle with current architectures. We argue that\nthese absences imply that LLMs are not now and cannot in their present form be\nlinguistic agents the way humans are. We illustrate the point in particular\nthrough the phenomenon of `algospeak', a recently described pattern of high\nstakes human language activity in heavily controlled online environments. On\nthe basis of these points, we conclude that sensational and misleading claims\nabout LLM agency and capabilities emerge from a deep misconception of both what\nhuman language is and what LLMs are.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"v6IgYuPwqxhz47bfC5G9e3G_htBO5h9P1V969unTtzU","pdfSize":"577958","objectId":"0x8a60fd25a2c892a274f127d05a001a9a724722a02bea6bc2511698913300f323","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
