{"id":"2407.05055","title":"Metagenomic analysis revealed significant changes in cattle rectum\n  microbiome and antimicrobial resistome under fescue toxicosis","authors":"Yihang Zhou","authorsParsed":[["Zhou","Yihang",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 11:58:18 GMT"}],"updateDate":"2024-07-09","timestamp":1720267098000,"abstract":"  Fescue toxicity causes reduced growth and reproductive issues in cattle\ngrazing endophyte-infected tall fescue. To characterize the gut microbiota and\nits response to fescue toxicosis, we collected fecal samples before and after a\n30-days toxic fescue seeds supplementation from eight Angus Simmental pregnant\ncows and heifers. We sequenced the 16 metagenomes using the whole-genome\nshotgun approach and generated 157 Gbp of metagenomic sequences. Through de\nnovo assembly and annotation, we obtained a 13.1 Gbp reference contig assembly\nand identified 22 million microbial genes for cattle rectum microbiota. We\ndiscovered a significant reduction of microbial diversity after toxic seed\ntreatment (P<0.01), suggesting dysbiosis of the microbiome. Six bacterial\nfamilies and 31 species are significantly increased in the fecal microbiota\n(P-adj<0.05), including members of the top abundant rumen core taxa. This\nglobal elevation of rumen microbes in the rectum microbiota suggests a\npotential impairment of rumen microbiota under fescue toxicosis. Among these,\nRuminococcaceae bacterium P7, an important species accounting for ~2% of rumen\nmicrobiota, was the most impacted with a 16-fold increase from 0.17% to 2.8% in\nfeces (P<0.01). We hypothesized that rumen Ruminococcaceae bacterium P7\nre-adapted to the large intestine environment under toxic fescue stress,\ncausing this dramatic increase in abundance. Functional enrichment analysis\nrevealed that the overrepresented pathways shifted from energy metabolism to\nantimicrobial resistance and DNA replication. In conclusion, we discovered\ndramatic microbiota alterations in composition, abundance, and functional\ncapacities under fescue toxicosis, and our results suggest Ruminococcaceae\nbacterium P7 as a potential biomarker for fescue toxicosis management.\n","subjects":["Quantitative Biology/Genomics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FfswRPp5FWnI8crK5P6zCpyR3Gg8QD1FJS9Wpj_zr5A","pdfSize":"3781281"}
