{"id":"2407.16982","title":"Diffree: Text-Guided Shape Free Object Inpainting with Diffusion Model","authors":"Lirui Zhao, Tianshuo Yang, Wenqi Shao, Yuxin Zhang, Yu Qiao, Ping Luo,\n  Kaipeng Zhang, Rongrong Ji","authorsParsed":[["Zhao","Lirui",""],["Yang","Tianshuo",""],["Shao","Wenqi",""],["Zhang","Yuxin",""],["Qiao","Yu",""],["Luo","Ping",""],["Zhang","Kaipeng",""],["Ji","Rongrong",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 03:58:58 GMT"}],"updateDate":"2024-07-25","timestamp":1721793538000,"abstract":"  This paper addresses an important problem of object addition for images with\nonly text guidance. It is challenging because the new object must be integrated\nseamlessly into the image with consistent visual context, such as lighting,\ntexture, and spatial location. While existing text-guided image inpainting\nmethods can add objects, they either fail to preserve the background\nconsistency or involve cumbersome human intervention in specifying bounding\nboxes or user-scribbled masks. To tackle this challenge, we introduce Diffree,\na Text-to-Image (T2I) model that facilitates text-guided object addition with\nonly text control. To this end, we curate OABench, an exquisite synthetic\ndataset by removing objects with advanced image inpainting techniques. OABench\ncomprises 74K real-world tuples of an original image, an inpainted image with\nthe object removed, an object mask, and object descriptions. Trained on OABench\nusing the Stable Diffusion model with an additional mask prediction module,\nDiffree uniquely predicts the position of the new object and achieves object\naddition with guidance from only text. Extensive experiments demonstrate that\nDiffree excels in adding new objects with a high success rate while maintaining\nbackground consistency, spatial appropriateness, and object relevance and\nquality.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oEUFT0AjblzmDE_rB_StFTRZiptVkdNy-xIOlYeEeYs","pdfSize":"7322748","objectId":"0xba6b9824368bbeee72bd85034993db821bb1191ef850a8366de6b7a70d83f40f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
