{"id":"2407.16274","title":"Comparative Analysis of AES, Blowfish, Twofish, Salsa20, and ChaCha20\n  for Image Encryption","authors":"Rebwar Khalid Muhammed, Ribwar Rashid Aziz, Alla Ahmad Hassan, Aso\n  Mohammed Aladdin, Shaida Jumaah Saydah, Tarik Ahmed. Rashid, Bryar Ahmad\n  Hassan","authorsParsed":[["Muhammed","Rebwar Khalid",""],["Aziz","Ribwar Rashid",""],["Hassan","Alla Ahmad",""],["Aladdin","Aso Mohammed",""],["Saydah","Shaida Jumaah",""],["Rashid","Tarik Ahmed.",""],["Hassan","Bryar Ahmad",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 08:26:05 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 11:04:49 GMT"}],"updateDate":"2024-07-29","timestamp":1721723165000,"abstract":"  Nowadays, cybersecurity has grown into a more significant and difficult\nscientific issue. The recog-nition of threats and attacks meant for knowledge\nand safety on the internet is growing harder to detect. Since cybersecurity\nguarantees the privacy and security of data sent via the Internet, it is\nessential, while also providing protection against malicious attacks. Encrypt\nhas grown into an an-swer that has become an essential element of information\nsecurity systems. To ensure the security of shared data, including text,\nimages, or videos, it is essential to employ various methods and strategies.\nThis study delves into the prevalent cryptographic methods and algorithms\nutilized for prevention and stream encryption, examining their encoding\ntechniques such as advanced encryp-tion standard (AES), Blowfish, Twofish,\nSalsa20, and ChaCha20. The primary objective of this re-search is to identify\nthe optimal times and throughputs (speeds) for data encryption and decryption\nprocesses. The methodology of this study involved selecting five distinct types\nof images to com-pare the outcomes of the techniques evaluated in this\nresearch. The assessment focused on pro-cessing time and speed parameters,\nexamining visual encoding and decoding using Java as the pri-mary platform. A\ncomparative analysis of several symmetric key ciphers was performed, focusing\non handling large datasets. Despite this limitation, comparing different images\nhelped evaluate the techniques' novelty. The results showed that ChaCha20 had\nthe best average time for both encryp-tion and decryption, being over 50%\nfaster than some other algorithms. However, the Twofish algo-rithm had lower\nthroughput during testing. The paper concludes with findings and suggestions\nfor future improvements.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ruJehJna95kvLqyd_VAaN_YdGQqgJBQKYCU64YlngSs","pdfSize":"887326","objectId":"0x2275bdedf1c1fd2e6f7989bc073db35843aaeca38026c32a990a6499d07cc9c7","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
