{"id":"2407.12991","title":"Concrete Shielding Requirements for PET Facilities","authors":"Victor Steiner, Aviv Malki, Tzafrir Ben Yehuda, Murray Moinester","authorsParsed":[["Steiner","Victor",""],["Malki","Aviv",""],["Yehuda","Tzafrir Ben",""],["Moinester","Murray",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 20:16:53 GMT"}],"updateDate":"2024-07-19","timestamp":1721247413000,"abstract":"  This study aims to determine the protective concrete shielding thickness\nrequirements in concrete walls of positron emission tomography (PET) and\ncomputed tomography (CT) facilities. Consider the most commonly used PET\nradiotracer, the radioisotope F18, which emits two back-to-back 511 keV\nphotons. Photon transmission measurements were carried out through an Israeli\nB30 strength ordinary concrete wall (3 meter high, 20 cm thick) using photons\nemitted from an F18 source into a cone having a 24 degree FWHM dose aperture\nangle. The source, positioned 3 meters from the wall, yielded a 0.64 m beam\ndisk radius on the wall. Our measurement setup roughly simulates radiation\nemitted from a patient injected with F18. Dose rates were measured by an\nAtomtex Radiation Survey Meter, positioned at distances 0.05 to 3 meters from\nthe far side of the wall. For a wide-beam, thick-shielding setup, there is a\nbuildup effect, as photons having reduced energies may reach the detector from\nCompton scattering in the wall. In concrete, the Compton scattering cross\nsection accounts for 99% of the total interaction cross section. The buildup\nfactor B accounts for the increase of observed radiation transmission through\nshielding material due to scattered radiation. We measured a narrow-beam\ntransmission coefficient T=3.0 +- 0.9 %, consistent with the theoretical value\n2% calculated from NIST photon attenuation data without buildup. We measured a\nwide-beam transmission coefficient of 8.6 +- 1.8%; in good agreement with two\navailable wide-beam Monte Carlo (MC) simulations. We confirm by experiment,\ncomplementing MC simulations, that for a 20 cm thick concrete wall, due to\nbuildup, about four times thicker shielding is required to achieve a designated\nlevel of radiation protection, compared to that calculated using narrow-beam,\nthin-shielding transmission coefficients.\n","subjects":["Physics/Medical Physics","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fjArfgqZTR5HrzHPoW9RqqTw6-vMt4bRV417Wpfromg","pdfSize":"555551","objectId":"0x6ac5e36f22b96852de3eb60b7eca1ace54655b2b32ce5747b6f2d6fd04d21c6f","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
