{"id":"2407.12071","title":"Observation of quantum effects on radiation reaction in strong fields","authors":"E. E. Los, E. Gerstmayr, C. Arran, M. J. V. Streeter, C. Colgan, C. C.\n  Cobo, B. Kettle, T. G. Blackburn, N. Bourgeois, L. Calvin, J. Carderelli, N.\n  Cavanagh, S.J.D. Dann A. Di Piazza, R. Fitzgarrald, A. Ilderton, C. H.\n  Keitel, M. Marklund, P. McKenna, C. D. Murphy, Z. Najmudin, P. Parsons, P. P.\n  Rajeev, D. R. Symes, M. Tamburini, A. G. R. Thomas, J. C. Wood, M. Zepf, G.\n  Sarri, C. P. Ridgers, S. P. D Mangles","authorsParsed":[["Los","E. E.",""],["Gerstmayr","E.",""],["Arran","C.",""],["Streeter","M. J. V.",""],["Colgan","C.",""],["Cobo","C. C.",""],["Kettle","B.",""],["Blackburn","T. G.",""],["Bourgeois","N.",""],["Calvin","L.",""],["Carderelli","J.",""],["Cavanagh","N.",""],["Di Piazza","S. J. D. Dann A.",""],["Fitzgarrald","R.",""],["Ilderton","A.",""],["Keitel","C. H.",""],["Marklund","M.",""],["McKenna","P.",""],["Murphy","C. D.",""],["Najmudin","Z.",""],["Parsons","P.",""],["Rajeev","P. P.",""],["Symes","D. R.",""],["Tamburini","M.",""],["Thomas","A. G. R.",""],["Wood","J. C.",""],["Zepf","M.",""],["Sarri","G.",""],["Ridgers","C. P.",""],["Mangles","S. P. D",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 12:53:04 GMT"}],"updateDate":"2024-07-18","timestamp":1721134384000,"abstract":"  Radiation reaction describes the effective force experienced by an\naccelerated charge due to radiation emission. Quantum effects dominate charge\ndynamics and radiation production[1][2] for charges accelerated by fields with\nstrengths approaching the Schwinger field,\n$\\mathbf{E_{sch}=}$\\textbf{\\SI[detect-weight]{1.3e18}{\\volt\\per\\metre}[3]. Such\nfields exist in extreme astrophysical environments such as pulsar\nmagnetospheres[4], may be accessed by high-power laser systems[5-7], dense\nparticle beams interacting with plasma[8], crystals[9], and at the interaction\npoint of next generation particle colliders[10]. Classical radiation reaction\ntheories do not limit the frequency of radiation emitted by accelerating\ncharges and omit stochastic effects inherent in photon emission[11], thus\ndemanding a quantum treatment. Two quantum radiation reaction models, the\nquantum-continuous[12] and quantum-stochastic[13] models, correct the former\nissue, while only the quantum-stochastic model incorporates stochasticity[12].\nSuch models are of fundamental importance, providing insight into the effect of\nthe electron self-force on its dynamics in electromagnetic fields. The\ndifficulty of accessing conditions where quantum effects dominate inhibited\nprevious efforts to observe quantum radiation reaction in charged particle\ndynamics with high significance. We report the first direct, high significance\n$(>5{\\sigma})$ observation of strong-field radiation reaction on charged\nparticles. Furthermore, we obtain strong evidence favouring the quantum\nradiation reaction models, which perform equivalently, over the classical\nmodel. Robust model comparison was facilitated by a novel Bayesian framework\nwhich inferred collision parameters. This framework has widespread utility for\nexperiments where parameters governing lepton-laser collisions cannot be\ndirectly measured, including those using conventional accelerators.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pDmasc-8rTaj9OG4SvFMykGWXeek0x9VtoHZoskrWHg","pdfSize":"5024903","objectId":"0xcce8f092ebe78e0afecf070d6d109e94f7b115bc6337c998d9257de403817ac8","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
