{"id":"2407.12508","title":"MERLIN: Multimodal Embedding Refinement via LLM-based Iterative\n  Navigation for Text-Video Retrieval-Rerank Pipeline","authors":"Donghoon Han, Eunhwan Park, Gisang Lee, Adam Lee and Nojun Kwak","authorsParsed":[["Han","Donghoon",""],["Park","Eunhwan",""],["Lee","Gisang",""],["Lee","Adam",""],["Kwak","Nojun",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 11:45:02 GMT"}],"updateDate":"2024-07-18","timestamp":1721216702000,"abstract":"  The rapid expansion of multimedia content has made accurately retrieving\nrelevant videos from large collections increasingly challenging. Recent\nadvancements in text-video retrieval have focused on cross-modal interactions,\nlarge-scale foundation model training, and probabilistic modeling, yet often\nneglect the crucial user perspective, leading to discrepancies between user\nqueries and the content retrieved. To address this, we introduce MERLIN\n(Multimodal Embedding Refinement via LLM-based Iterative Navigation), a novel,\ntraining-free pipeline that leverages Large Language Models (LLMs) for\niterative feedback learning. MERLIN refines query embeddings from a user\nperspective, enhancing alignment between queries and video content through a\ndynamic question answering process. Experimental results on datasets like\nMSR-VTT, MSVD, and ActivityNet demonstrate that MERLIN substantially improves\nRecall@1, outperforming existing systems and confirming the benefits of\nintegrating LLMs into multimodal retrieval systems for more responsive and\ncontext-aware multimedia retrieval.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"v4ccoP0-cjxBF8a_at-foVAXJRsAFq5JvXIM0eG6zRA","pdfSize":"5685037","objectId":"0x1c2d22a4715590b7b55b51bfe522e4985fd7ca87c0968fcf4086ea88d3b57319","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
