{"id":"2407.15671","title":"Problems in AI, their roots in philosophy, and implications for science\n  and society","authors":"Max Velthoven, Eric Marcus","authorsParsed":[["Velthoven","Max",""],["Marcus","Eric",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:38:54 GMT"}],"updateDate":"2024-07-23","timestamp":1721659134000,"abstract":"  Artificial Intelligence (AI) is one of today's most relevant emergent\ntechnologies. In view thereof, this paper proposes that more attention should\nbe paid to the philosophical aspects of AI technology and its use. It is argued\nthat this deficit is generally combined with philosophical misconceptions about\nthe growth of knowledge. To identify these misconceptions, reference is made to\nthe ideas of the philosopher of science Karl Popper and the physicist David\nDeutsch. The works of both thinkers aim against mistaken theories of knowledge,\nsuch as inductivism, empiricism, and instrumentalism. This paper shows that\nthese theories bear similarities to how current AI technology operates. It also\nshows that these theories are very much alive in the (public) discourse on AI,\noften called Bayesianism. In line with Popper and Deutsch, it is proposed that\nall these theories are based on mistaken philosophies of knowledge. This\nincludes an analysis of the implications of these mistaken philosophies for the\nuse of AI in science and society, including some of the likely problem\nsituations that will arise. This paper finally provides a realistic outlook on\nArtificial General Intelligence (AGI) and three propositions on A(G)I and\nphilosophy (i.e., epistemology).\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Emerging Technologies","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"m8y7h5UQ62j_Aw6HNOZ-cyylzLcFYDiLp85b2_V4SYs","pdfSize":"390646","objectId":"0x63f176364089acffaac2f0809aba572274257e53bb8a6290b24133fc0bc8ec7b","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
