{"id":"2407.16719","title":"A Brief Discussion on the Philosophical Principles and Development\n  Directions of Data Circulation","authors":"Zhi Li, Lei Zhang, Junyi Xin, Jianfei He, Yan Li, Zhenjun Ma, Qi Sun","authorsParsed":[["Li","Zhi",""],["Zhang","Lei",""],["Xin","Junyi",""],["He","Jianfei",""],["Li","Yan",""],["Ma","Zhenjun",""],["Sun","Qi",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 08:19:02 GMT"}],"updateDate":"2024-07-25","timestamp":1721722742000,"abstract":"  The data circulation is a complex scenario involving a large number of\nparticipants and different types of requirements, which not only has to comply\nwith the laws and regulations, but also faces multiple challenges in technical\nand business areas. In order to systematically and comprehensively address\nthese issues, it is essential to have a comprehensive and profound\nunderstanding of 'data circulation'.\n  The traditional analysis method tends to proceed based on the traditional\ncirculation model of commodities, that is, tangible objects, which has some\ndefects and shortcomings, and tends to be a formalized approach, which is faced\nnumerous challenges in practice. This paper analyzes the circulation of data\nwith a philosophical approach, obtains the new explication of data and\nexecuting entity, and provides a new definition of the concepts of data\nutilization and data key stakeholders (objects). At the same time, it puts\nforward the idea of ``data alienation'', and constructs a new interpretive\nframework of ``data circulation''.\n  Based on the framework of this interpretation, it is clearly proposed that\n``data alienation'' is the core of ``data circulation'', benefit distribution\nis the driving force, and legal compliance is the foundation, and further\ndiscussed the three modes of ``data circulation''. It further discusses the\nthree modes of ``data circulation''. It is pointed out that ``data\ncirculation'' is different from traditional ``commodity circulation''. To\nachieve ``data circulation'',a comprehensive information infrastructure needs\nto be established. from a theoretical point of view, it lays a solid foundation\nfor the development of ``data circulation''.\n","subjects":["Computing Research Repository/Other Computer Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"bOQ-P9P335DMZD6_AVEY7OWp_-55KsCC4SWLoLK0Vr8","pdfSize":"867186","objectId":"0xfe45d0e8e2dab4e3c66b569144f2cfd59c91342b869ac76c3748cec845e77239","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
