{"id":"2407.06739","title":"Grids of stellar models with rotation VIII: Models from 1.7 to 500\n  $M_\\odot$ at metallicity $Z = 10^{-5}$","authors":"Yves Sibony, Kendall G. Shepherd, Norhasliza Yusof, Raphael Hirschi,\n  Caitlan Chambers, Sophie Tsiatsiou, Devesh Nandal, Luca Sciarini, Facundo D.\n  Moyano, J\\'er\\^ome B\\'etrisey, Ga\\\"el Buldgen, Cyril Georgy, Sylvia\n  Ekstr\\\"om, Patrick Eggenberger, Georges Meynet","authorsParsed":[["Sibony","Yves",""],["Shepherd","Kendall G.",""],["Yusof","Norhasliza",""],["Hirschi","Raphael",""],["Chambers","Caitlan",""],["Tsiatsiou","Sophie",""],["Nandal","Devesh",""],["Sciarini","Luca",""],["Moyano","Facundo D.",""],["Bétrisey","Jérôme",""],["Buldgen","Gaël",""],["Georgy","Cyril",""],["Ekström","Sylvia",""],["Eggenberger","Patrick",""],["Meynet","Georges",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 10:35:51 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 05:14:32 GMT"}],"updateDate":"2024-07-12","timestamp":1720521351000,"abstract":"  Grids of stellar evolution models with rotation using the Geneva stellar\nevolution code (Genec) have been published for a wide range of metallicities.\nWe introduce the last remaining grid of Genec models, with a metallicity of\n$Z=10^{-5}$. We study the impact of this extremely metal-poor initial\ncomposition on various aspects of stellar evolution, and compare it to the\nresults from previous grids at other metallicities. We provide electronic\ntables that can be used to interpolate between stellar evolution tracks and for\npopulation synthesis. Using the same physics as in the previous papers of this\nseries, we computed a grid of stellar evolution models with Genec spanning\nmasses between 1.7 and 500 $M_\\odot$, with and without rotation, at a\nmetallicity of $Z=10^{-5}$. Due to the extremely low metallicity of the models,\nmass-loss processes are negligible for all except the most massive stars. For\nmost properties (such as evolutionary tracks in the Hertzsprung-Russell\ndiagram, lifetimes, and final fates), the present models fit neatly between\nthose previously computed at surrounding metallicities. However, specific to\nthis metallicity is the very large production of primary nitrogen in moderately\nrotating stars, which is linked to the interplay between the hydrogen- and\nhelium-burning regions. The stars in the present grid are interesting\ncandidates as sources of nitrogen-enrichment in the early Universe. Indeed,\nthey may have formed very early on from material previously enriched by the\nmassive short-lived Population III stars, and as such constitute a very\nimportant piece in the puzzle that is the history of the Universe.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gpXIeCeD3O5AWKtvjhQeFFffWcmk8alTvzV3c_J58yo","pdfSize":"12709255"}
