{"id":"2407.00848","title":"Ego-to-Exo: Interfacing Third Person Visuals from Egocentric Views in\n  Real-time for Improved ROV Teleoperation","authors":"Adnan Abdullah, Ruo Chen, Ioannis Rekleitis, and Md Jahidul Islam","authorsParsed":[["Abdullah","Adnan",""],["Chen","Ruo",""],["Rekleitis","Ioannis",""],["Islam","Md Jahidul",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 22:53:44 GMT"},{"version":"v2","created":"Sun, 28 Jul 2024 00:15:18 GMT"}],"updateDate":"2024-07-30","timestamp":1719788024000,"abstract":"  Underwater ROVs (Remotely Operated Vehicles) are unmanned submersible\nvehicles designed for exploring and operating in the depths of the ocean.\nDespite using high-end cameras, typical teleoperation engines based on\nfirst-person (egocentric) views limit a surface operator's ability to maneuver\nthe ROV in complex deep-water missions. In this paper, we present an\ninteractive teleoperation interface that enhances the operational capabilities\nvia increased situational awareness. This is accomplished by (i) offering\non-demand \"third\"-person (exocentric) visuals from past egocentric views, and\n(ii) facilitating enhanced peripheral information with augmented ROV pose\ninformation in real-time. We achieve this by integrating a 3D geometry-based\nEgo-to-Exo view synthesis algorithm into a monocular SLAM system for accurate\ntrajectory estimation. The proposed closed-form solution only uses past\negocentric views from the ROV and a SLAM backbone for pose estimation, which\nmakes it portable to existing ROV platforms. Unlike data-driven solutions, it\nis invariant to applications and waterbody-specific scenes. We validate the\ngeometric accuracy of the proposed framework through extensive experiments of\n2-DOF indoor navigation and 6-DOF underwater cave exploration in challenging\nlow-light conditions. A subjective evaluation on 15 human teleoperators further\nconfirms the effectiveness of the integrated features for improved\nteleoperation. We demonstrate the benefits of dynamic Ego-to-Exo view\ngeneration and real-time pose rendering for remote ROV teleoperation by\nfollowing navigation guides such as cavelines inside underwater caves. This new\nway of interactive ROV teleoperation opens up promising opportunities for\nfuture research in subsea telerobotics.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8VH59Dotwa7XvaskuKb2e172nFR7Mbofx9nCoclAVvc","pdfSize":"5795314","objectId":"0x5e12a7f7692cdcf447195135831c648e36b4cb7f5bd9f40f499f3845015b768d","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
