{"id":"2407.12154","title":"Cyberbullying Detection: Exploring Datasets, Technologies, and\n  Approaches on Social Media Platforms","authors":"Adamu Gaston Philipo, Doreen Sebastian Sarwatt, Jianguo Ding, Mahmoud\n  Daneshmand, Huansheng Ning","authorsParsed":[["Philipo","Adamu Gaston",""],["Sarwatt","Doreen Sebastian",""],["Ding","Jianguo",""],["Daneshmand","Mahmoud",""],["Ning","Huansheng",""]],"versions":[{"version":"v1","created":"Wed, 22 May 2024 04:58:20 GMT"}],"updateDate":"2024-07-18","timestamp":1716353900000,"abstract":"  Cyberbullying has been a significant challenge in the digital era world,\ngiven the huge number of people, especially adolescents, who use social media\nplatforms to communicate and share information. Some individuals exploit these\nplatforms to embarrass others through direct messages, electronic mail, speech,\nand public posts. This behavior has direct psychological and physical impacts\non victims of bullying. While several studies have been conducted in this field\nand various solutions proposed to detect, prevent, and monitor cyberbullying\ninstances on social media platforms, the problem continues. Therefore, it is\nnecessary to conduct intensive studies and provide effective solutions to\naddress the situation. These solutions should be based on detection,\nprevention, and prediction criteria methods. This paper presents a\ncomprehensive systematic review of studies conducted on cyberbullying\ndetection. It explores existing studies, proposed solutions, identified gaps,\ndatasets, technologies, approaches, challenges, and recommendations, and then\nproposes effective solutions to address research gaps in future studies.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tZTgMaP1Ix7J2nbGkOVo_vKHkWzz7sTmPW0Dl1HpPJ8","pdfSize":"750362","objectId":"0xe659a63fd44f37c86e2932a2ef9bb7b10bac5a1112917bd49c07c2e90c49f0e0","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
