{"id":"2407.21615","title":"Between the AI and Me: Analysing Listeners' Perspectives on AI- and\n  Human-Composed Progressive Metal Music","authors":"Pedro Sarmento, Jackson Loth, Mathieu Barthet","authorsParsed":[["Sarmento","Pedro",""],["Loth","Jackson",""],["Barthet","Mathieu",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:03:45 GMT"}],"updateDate":"2024-08-01","timestamp":1722434625000,"abstract":"  Generative AI models have recently blossomed, significantly impacting\nartistic and musical traditions. Research investigating how humans interact\nwith and deem these models is therefore crucial. Through a listening and\nreflection study, we explore participants' perspectives on AI- vs\nhuman-generated progressive metal, in symbolic format, using rock music as a\ncontrol group. AI-generated examples were produced by ProgGP, a\nTransformer-based model. We propose a mixed methods approach to assess the\neffects of generation type (human vs. AI), genre (progressive metal vs. rock),\nand curation process (random vs. cherry-picked). This combines quantitative\nfeedback on genre congruence, preference, creativity, consistency, playability,\nhumanness, and repeatability, and qualitative feedback to provide insights into\nlisteners' experiences. A total of 32 progressive metal fans completed the\nstudy. Our findings validate the use of fine-tuning to achieve genre-specific\nspecialization in AI music generation, as listeners could distinguish between\nAI-generated rock and progressive metal. Despite some AI-generated excerpts\nreceiving similar ratings to human music, listeners exhibited a preference for\nhuman compositions. Thematic analysis identified key features for genre and AI\nvs. human distinctions. Finally, we consider the ethical implications of our\nwork in promoting musical data diversity within MIR research by focusing on an\nunder-explored genre.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"wC4yuCf3Y0DitjcRmDeKjO5Wnwgb6g0sX-a1MFCQmzQ","pdfSize":"970179","objectId":"0xccc4f2c363aadf8d8c298b4e4c8e43f3f0782cda3e5a663f9283156e2a762a48","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
