{"id":"2407.08792","title":"ProxyGPT: Enabling Anonymous Queries in AI Chatbots with (Un)Trustworthy\n  Browser Proxies","authors":"Dzung Pham, Jade Sheffey, Chau Minh Pham, Amir Houmansadr","authorsParsed":[["Pham","Dzung",""],["Sheffey","Jade",""],["Pham","Chau Minh",""],["Houmansadr","Amir",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 18:08:04 GMT"}],"updateDate":"2024-07-15","timestamp":1720721284000,"abstract":"  AI-powered chatbots (ChatGPT, Claude, etc.) require users to create an\naccount using their email and phone number, thereby linking their personally\nidentifiable information to their conversational data and usage patterns. As\nthese chatbots are increasingly being used for tasks involving sensitive\ninformation, privacy concerns have been raised about how chatbot providers\nhandle user data. To address these concerns, we present ProxyGPT, a\nprivacy-enhancing system that enables anonymous queries in popular chatbot\nplatforms. ProxyGPT leverages volunteer proxies to submit user queries on their\nbehalf, thus providing network-level anonymity for chatbot users. The system is\ndesigned to support key security properties such as content integrity via\nTLS-backed data provenance, end-to-end encryption, and anonymous payment, while\nalso ensuring usability and sustainability. We provide a thorough analysis of\nthe privacy, security, and integrity of our system and identify various future\nresearch directions, particularly in the area of private chatbot query\nsynthesis. Our human evaluation shows that ProxyGPT offers users a greater\nsense of privacy compared to traditional AI chatbots, especially in scenarios\nwhere users are hesitant to share their identity with chatbot providers.\nAlthough our proof-of-concept has higher latency than popular chatbots, our\nhuman interview participants consider this to be an acceptable trade-off for\nanonymity. To the best of our knowledge, ProxyGPT is the first comprehensive\nproxy-based solution for privacy-preserving AI chatbots. Our codebase is\navailable at https://github.com/dzungvpham/proxygpt.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"CEOWO6RKtKiCCZoikxaxrJa8l-C4SGtK2i0t83KSNiQ","pdfSize":"1373216","objectId":"0x6afc5584411b543f69876afa107fa858e84e661d6fb672232d9f662a7ccbb706","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
