{"id":"2407.06754","title":"Threats and Defenses in Federated Learning Life Cycle: A Comprehensive\n  Survey and Challenges","authors":"Yanli Li, Zhongliang Guo, Nan Yang, Huaming Chen, Dong Yuan, Weiping\n  Ding","authorsParsed":[["Li","Yanli",""],["Guo","Zhongliang",""],["Yang","Nan",""],["Chen","Huaming",""],["Yuan","Dong",""],["Ding","Weiping",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 11:05:45 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 11:50:03 GMT"}],"updateDate":"2024-07-12","timestamp":1720523145000,"abstract":"  Federated Learning (FL) offers innovative solutions for privacy-preserving\ncollaborative machine learning (ML). Despite its promising potential, FL is\nvulnerable to various attacks due to its distributed nature, affecting the\nentire life cycle of FL services. These threats can harm the model's utility or\ncompromise participants' privacy, either directly or indirectly. In response,\nnumerous defense frameworks have been proposed, demonstrating effectiveness in\nspecific settings and scenarios. To provide a clear understanding of the\ncurrent research landscape, this paper reviews the most representative and\nstate-of-the-art threats and defense frameworks throughout the FL service life\ncycle. We start by identifying FL threats that harm utility and privacy,\nincluding those with potential or direct impacts. Then, we dive into the\ndefense frameworks, analyze the relationship between threats and defenses, and\ncompare the trade-offs among different defense strategies. Finally, we\nsummarize current research bottlenecks and offer insights into future research\ndirections to conclude this survey. We hope this survey sheds light on\ntrustworthy FL research and contributes to the FL community.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"GEQAga4Ka_oANS_rqA43cXQJyVwBjw6sudTXZ4PA4zs","pdfSize":"1930454"}
