{"id":"2407.21709","title":"Influences of $\\delta$B Contribution and Parallel Inertial Term of\n  Energetic Particles on MHD-Kinetic Hybrid Simulations: A Case Study of the\n  1/1 Internal Kink Mode","authors":"H.X.Zhang, H.W. Zhang, Z.W. Ma, C. Liu","authorsParsed":[["Zhang","H. X.",""],["Zhang","H. W.",""],["Ma","Z. W.",""],["Liu","C.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:58:55 GMT"}],"updateDate":"2024-08-01","timestamp":1722441535000,"abstract":"  The magnetohydrodynamic-kinetic (MHD-kinetic) hybrid model [Park et. al.,\n1992] has been widely applied in studying energetic particles (EPs) problems in\nfusion plasmas for past decades. The pressure-coupling scheme or the\ncurrent-coupling scheme is adopted in this model. However, two noteworthy\nissues arise in the model application: firstly, the coupled term introduced in\nthe pressure-coupling scheme, $\\left( \\nabla \\cdot \\mathbf{P}_{\\mathrm{h}}\n\\right)_{\\bot}$, is often simplified by $\\nabla \\cdot \\mathbf{P}_{\\mathrm{h}}$,\nwhich is equivalent to neglecting the parallel inertial term of EPs; secondly,\nbesides the $\\delta f $ contribution caused by changing in the EP distribution\nfunction, the magnetic field perturbation (the $\\delta \\mathbf{B} $\ncontribution) generated during development of the instabilities should also be\nconsidered, but it is often ignored in existing hybrid simulations. In this\npaper, we derive the analytical formulations under these two coupling schemes\nand then numerically study the representative case of the linear stability of\nthe m/n=1/1 internal kink mode (IKM) [Fu et. al., 2006] by using the CLT-K\ncode. It is found that the approximated models can still yield reasonable\nresults when EPs are isotopically distributed. But it fails completely in cases\nwith anisotropic EP distributions. In addition, we further investigate the\ninfluence of EP's orbit width on the stability of IKM and verify the\nequivalence between pressure-coupling scheme and the current-coupling scheme.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nqz0BQi2U8d_5DxXHc3ctMQCtPRgHtqPXsUuLjT4gDI","pdfSize":"28020013","objectId":"0xfecf08d912751503fd6574aa1fb3396a92dc8c969475c2f594ae109fb66fcd09","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
