{"id":"2407.12474","title":"Leveraging the Mahalanobis Distance to enhance Unsupervised Brain MRI\n  Anomaly Detection","authors":"Finn Behrendt, Debayan Bhattacharya, Robin Mieling, Lennart Maack,\n  Julia Kr\\\"uger, Roland Opfer, Alexander Schlaefer","authorsParsed":[["Behrendt","Finn",""],["Bhattacharya","Debayan",""],["Mieling","Robin",""],["Maack","Lennart",""],["Krüger","Julia",""],["Opfer","Roland",""],["Schlaefer","Alexander",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 11:02:31 GMT"}],"updateDate":"2024-07-18","timestamp":1721214151000,"abstract":"  Unsupervised Anomaly Detection (UAD) methods rely on healthy data\ndistributions to identify anomalies as outliers. In brain MRI, a common\napproach is reconstruction-based UAD, where generative models reconstruct\nhealthy brain MRIs, and anomalies are detected as deviations between input and\nreconstruction. However, this method is sensitive to imperfect reconstructions,\nleading to false positives that impede the segmentation. To address this\nlimitation, we construct multiple reconstructions with probabilistic diffusion\nmodels. We then analyze the resulting distribution of these reconstructions\nusing the Mahalanobis distance to identify anomalies as outliers. By leveraging\ninformation about normal variations and covariance of individual pixels within\nthis distribution, we effectively refine anomaly scoring, leading to improved\nsegmentation. Our experimental results demonstrate substantial performance\nimprovements across various data sets. Specifically, compared to relying solely\non single reconstructions, our approach achieves relative improvements of\n15.9%, 35.4%, 48.0%, and 4.7% in terms of AUPRC for the BRATS21, ATLAS, MSLUB\nand WMH data sets, respectively.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"T_6u8m98Xp62NfLP-AgcmNRr3slhtAnBMAuSDixnFQ4","pdfSize":"3487430","objectId":"0x154e19eee13889e670b1f5963bed0ac9c4ae6fc4c937ae504132d6c1006b8643","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
