{"id":"2407.21644","title":"Relaxation Fluctuations of Correlation Functions: Spin and Random Matrix\n  Models","authors":"Tanay Pathak","authorsParsed":[["Pathak","Tanay",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:45:46 GMT"}],"updateDate":"2024-08-01","timestamp":1722437146000,"abstract":"  Spectral statistics and correlations are the usual way to study the presence\nor absence of quantum chaos in quantum systems. We present our investigation on\nthe study of the fluctuation average and variance of certain correlation\nfunctions as a diagnostic measure of quantum chaos and to possibly characterize\nquantum systems based on it. These quantities are related to eigenvector\ndistribution and eigenvector correlation. Using the Random Matrix Theory\ncertain analytical expressions of these quantities, for the Gaussian orthogonal\nensemble case, were calculated before. So as a first step, we study these\nquantities for the Gaussian unitary ensemble case numerically, and deduce\ncertain analytical results for the same. We then carry out our investigations\nin physical system, such as the mixed-field Ising model. For this model, we\nfind that although the eigenvalue statistics follow the behaviour of\ncorresponding random matrices, the fluctuation average and variance of these\ncorrelation functions deviate from the expected random matrix theory behaviour.\nWe then turn our focus on the Rosenzweig-Porter model of the Gaussian\nOrthogonal Ensemble and Gaussian Unitary Ensemble types. By using the\nfluctuation average and variance of these correlations, we identify the three\ndistinct phases of these models: the ergodic, the fractal, and the localized\nphases. We provide an alternative way to study and distinguish the three phases\nand firmly establish the use of these correlation fluctuations as an\nalternative way to characterize quantum chaos.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Disordered Systems and Neural Networks","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_RDSvMyqW-OZqblFmxIaOMKouOKUnqkSHs2AvUtxwAU","pdfSize":"1180411","objectId":"0x0e106dcc6b4edc4bf01a9f37868242e67838fc08e51ce4470bd0ee9610052a9e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
