{"id":"2407.12455","title":"Optimizing one dimensional superconducting diodes: Interplay of Rashba\n  spin-orbit coupling and magnetic fields","authors":"Sayak Bhowmik, Dibyendu Samanta, Ashis K. Nandy, Arijit Saha and\n  Sudeep Kumar Ghosh","authorsParsed":[["Bhowmik","Sayak",""],["Samanta","Dibyendu",""],["Nandy","Ashis K.",""],["Saha","Arijit",""],["Ghosh","Sudeep Kumar",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 10:03:37 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 15:53:11 GMT"}],"updateDate":"2024-07-25","timestamp":1721210617000,"abstract":"  The superconducting diode effect (SDE) refers to the non-reciprocal nature of\nthe critical current (maximum current that a superconductor can withstand\nbefore turning into a normal metal) of a superconducting device. Here, we\ninvestigate SDE in helical superconductors with broken inversion and\ntime-reversal symmetry, focusing on a prototypical Rashba nanowire device\nproximitized by an s-wave superconductor and subjected to external magnetic\nfields. Using a self-consistent Bogoliubov-de Gennes mean-field formalism, we\nanalyze the interplay between linear and higher-order spin-orbit coupling\n(SOC), bulk supercurrents, and external magnetic fields. Our results\ndemonstrate that Rashba nanowires with only linear SOC can achieve incredibly\nlarge diode efficiencies > 45% through the interplay of longitudinal and\ntransverse magnetic fields. Notably, higher-order SOC introduces qualitatively\ndifferent behavior, enabling finite diode efficiency even in the absence of a\nlongitudinal Zeeman field due to inherent energy dispersion asymmetry. We\npresent a comprehensive phase diagram of the device elucidating the emergent\nFulde-Ferrell-Larkin-Ovchinnikov (FFLO) superconducting state and demonstrate\nthat proximitized Rashba nanowires offer a versatile, practical platform for\nSDE, with potential realizations in existing material systems. These results\nprovide crucial insights for optimizing SDE in nanoscale superconducting\ndevices, paving the way for next-generation dissipationless quantum\nelectronics.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fYW-OAlN8zLfl4-XoHXsFtwIRCC3TJTnklMNMzEsGZ0","pdfSize":"2689379","objectId":"0x8efb7aea5b88ed13fd3692590f01370277fcf02466f2512d261e7fad5a0266aa","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
