{"id":"2407.16501","title":"A rectangular loop interferometer for scalar optical computations and\n  controlled generation of higher-order vector vortex modes using spin-orbit\n  interaction of light","authors":"Ram Nandan Kumar, Gaurav Verma, Subhasish Dutta Gupta, Nirmalya Ghosh,\n  and Ayan Banerjee","authorsParsed":[["Kumar","Ram Nandan",""],["Verma","Gaurav",""],["Gupta","Subhasish Dutta",""],["Ghosh","Nirmalya",""],["Banerjee","Ayan",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:15:42 GMT"}],"updateDate":"2024-07-24","timestamp":1721744142000,"abstract":"  We have developed a rectangular loop interferometer (RLI) that confines light\nin a rectangular path and facilitates various interesting applications. Such a\ndevice can yield the sum of numerous geometric series converging to different\nvalues between zero and one by the use of simple intra-cavity beam splitters -\nboth polarization-independent and dependent. Losses - principally due to\nalignment issues of the beam in the RLI - limit the average accuracy of the\nseries sum value to be between 90 - 98\\% with the computation speed determined\nby the bandwidth of the detectors. In addition, with a circularly polarized\ninput Gaussian beam, and a combination of half-wave plate and q-plate inserted\ninto the interferometer path, the device can generate a vortex beam that\ncarries orbital angular momentum (OAM) of all orders of topological charge. The\nOAM is generated due to the spin-orbit interaction of light, and the\ntopological charge increases with each successive pass of the beam inside the\ninterferometer. However, experimentally, only the third order of OAM could be\nmeasured since projecting out individual orders entailed a slight misalignment\nof the interferometer, which caused higher orders to go out of resonance.\nFurthermore, with input linear polarization, the device can generate a vector\nbeam bearing a superposition of polarization states resembling the multipole\nexpansion of a charge distribution. Even here, experimentally, we were able to\nquantify the polarization distribution up to the third order using a Stokes\nvector analysis of the vector beam, with the size of the polarization\nsingularity region increasing as the polarization states evolve inside the\ninterferometer. Our work demonstrates the ubiquitous nature of loop\ninterferometers in modifying the scalar and vector properties of light to\ngenerate simple mathematical results and other complex but useful applications.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KazKCGwaUBaejqeLB2Wisnl1-oGtb_DRArslT80lFBI","pdfSize":"17158244","objectId":"0xac619a4a5d08b265c34d83d41485f33bfd4a2a20b2cd0903ec995b865eabc79a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
