{"id":"2407.12900","title":"Top Quark Mass Extractions from Energy Correlators: A Feasibility Study","authors":"Jack Holguin, Ian Moult, Aditya Pathak, Massimiliano Procura, Robert\n  Sch\\\"ofbeck, Dennis Schwarz","authorsParsed":[["Holguin","Jack",""],["Moult","Ian",""],["Pathak","Aditya",""],["Procura","Massimiliano",""],["Schöfbeck","Robert",""],["Schwarz","Dennis",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-19","timestamp":1721239200000,"abstract":"  In a recent article, we proposed an energy correlator-based method to achieve\na precision top quark mass extraction from jet substructure, using the\n$W$-boson mass as a standard candle. In this paper, we perform an extensive\nevent generator simulation study of this proposal, testing both its\nexperimental viability, as well as its sensitivity to different subprocesses in\nthe top quark production and decay. On the experimental side, we show that\nuncertainties in the jet energy scale, constituent energy scale, and tracking\nefficiency have a minimal effect. On the theoretical side, we find that our\nobservable isolates the perturbative decay of the top quark, while\nnonperturbative physics, such as the modelling of color reconnection, and\nunderlying event, have a negligible impact on the distribution. We conclude\nthat our proposed measurement is resilient to the experimental and theoretical\naspects of the hadron collider environment, with variations in model parameters\nconsistently leading to $\\lesssim 100~$MeV shifts in the measured top mass. Our\nresults motivate precision theoretical calculations of the energy correlator on\ntop decays, both analytic and using parton shower generators, and further\nexploration of the experimental measurement.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4_crLsn0dJ52PugOzU2Qlf0gqr-MR8X92eclG4nMimg","pdfSize":"3063899","objectId":"0xc05a2b901821bf1c67e76ce9e3cfe373dd8c534f19a5b4831b267cc86d632ac4","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
