{"id":"2407.06686","title":"MRI Volume-Based Robust Brain Age Estimation Using Weight-Shared Spatial\n  Attention in 3D CNNs","authors":"Vamshi Krishna Kancharla, Neelam Sinha","authorsParsed":[["Kancharla","Vamshi Krishna",""],["Sinha","Neelam",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 09:00:21 GMT"}],"updateDate":"2024-07-10","timestamp":1720515621000,"abstract":"  Important applications of advancements in machine learning, are in the area\nof healthcare, more so for neurological disorder detection. A crucial step\ntowards understanding the neurological status, is to estimate the brain age\nusing structural MRI volumes, in order to measure its deviation from\nchronological age. Factors that contribute to brain age are best captured using\na data-driven approach, such as deep learning. However, it places a huge demand\non the availability of diverse datasets. In this work, we propose a robust\nbrain age estimation paradigm that utilizes a 3D CNN model, by-passing the need\nfor model-retraining across datasets. The proposed model consists of seven 3D\nCNN layers, with a shared spatial attention layer incorporated at each CNN\nlayer followed by five dense layers. The novelty of the proposed method lies in\nthe idea of spatial attention module, with shared weights across the CNN\nlayers. This weight sharing ensures directed attention to specific brain\nregions, for localizing age-related features within the data, lending\nrobustness.\n  The proposed model, trained on ADNI dataset comprising 516 T1 weighted MRI\nvolumes of healthy subjects, resulted in Mean Absolute Error (MAE) of 1.662\nyears, which is an improvement of 1.688 years over the state-of-the-art (SOTA)\nmodel, based on disjoint test samples from the same repository. To illustrate\ngeneralizability, the same pipeline was utilized on volumes from a publicly\navailable source called OASIS3. From OASIS3, MRI volumes 890 healthy subjects\nwere utilized resulting in MAE of 2.265 years. Due to diversity in acquisitions\nacross multiple sites, races and genetic factors, traditional CNN models are\nnot guaranteed to prioritize brain regions crucial for age estimation. In\ncontrast, the proposed weight-shared spatial attention module, directs\nattention on specific regions, required for the estimation.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"uoouVm0sFiRv4XzYqE4oC3e7vEVjEYqXd_9mmXK_2CY","pdfSize":"835959"}
