{"id":"2407.09868","title":"Separation of Sodium Signals Between Mono- and Bi-Exponential T2 Decays\n  via Multi-TE Single-Quantum Sodium (23Na) MRI","authors":"Yongxian Qian (1), Ying-Chia Lin (1), Xingye Chen (1,2), Tiejun Zhao\n  (3), Karthik Lakshmanan (1), Yulin Ge (1), Yvonne W. Lui (1,4), and Fernando\n  E. Boada (1,5) ((1) Bernard and Irene Schwartz Center for Biomedical Imaging,\n  Department of Radiology, New York University Grossman School of Medicine, New\n  York, NY, USA, (2) Vilcek Institute of Graduate Biomedical Sciences, NYU\n  Grossman School of Medicine, New York, NY, USA, (3) Siemens Medical Solutions\n  USA, New York, NY, USA, (4) Department of Radiology, NYU Langone Health, New\n  York, NY, USA, (5) Now at Department of Radiology, Stanford University,\n  Stanford, CA, USA)","authorsParsed":[["Qian","Yongxian",""],["Lin","Ying-Chia",""],["Chen","Xingye",""],["Zhao","Tiejun",""],["Lakshmanan","Karthik",""],["Ge","Yulin",""],["Lui","Yvonne W.",""],["Boada","Fernando E.",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 12:39:41 GMT"}],"updateDate":"2024-07-16","timestamp":1720874381000,"abstract":"  Purpose. It is a long standing pursuit in sodium (23Na) MRI to separate\nsignals between mono and bi exponential T2 decays in the human brain, due to\nlack of clinically translational solutions under the restriction of\nintrinsically low signal to noise ratio (SNR). Here we propose a new technique\ncalled multi TE single quantum (MSQ) sodium MRI to address the challenge.\nMethods. We exploit an intrinsic difference in T2 decay between mono and bi\nexponential sodium signals by acquiring SQ images at multiple TEs and\nperforming voxel based matrix inversions on these SQ images. The MSQ method was\nthen investigated on numerical models, agar phantoms, and human brains for the\nfeasibility on clinical scanners at 3T. Results. The whole brain T2* spectrum\nof FID signals from the study subjects showed sparse peaks (2 to 4 peaks),\nsuggesting a global set of T2* values (T2*fr, T2*bs, T2*bl) applicable to the\nseparation. The simulations indicated a small impact (3.9 to 5.6 percent) of\nT2* variation on accuracy of the separation, and the phantom experiments showed\na high accuracy of the separation, 95.8 percent for mono T2 sodium and 72.5 to\n80.4 percent for biT2 sodium. The human studies demonstrated feasibility of the\nseparation and potentials of highlighting abnormal brain regions in the biT2\nsodium images. Conclusion. The MSQ technique has been shown, via the numerical\nsimulations, phantom experiments, and human brain studies, to be able to\nseparate mono and bi T2 sodium signals using a two TE sampling scheme and a\nglobal set of T2* values. However, MSQ has limitations and requires cautions in\npractice. Keywords. sodium MRI, single quantum MRI, triple quantum MRI,\nneuroimaging, neurodegeneration\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"w06NVlvKCqku6N79GHy8T7x4Lhld8ueO8l0lPrU_aDg","pdfSize":"2812427","objectId":"0x51c80d0bc432ed801cb2999e05b0bc314bddb8881b56a2b1233a19f4124389ba","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
