{"id":"2407.09019","title":"Heterogeneous Subgraph Network with Prompt Learning for Interpretable\n  Depression Detection on Social Media","authors":"Chen Chen,Mingwei Li,Fenghuan Li,Haopeng Chen,Yuankun Lin","authorsParsed":[["Chen","Chen",""],["Li","Mingwei",""],["Li","Fenghuan",""],["Chen","Haopeng",""],["Lin","Yuankun",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 06:20:59 GMT"}],"updateDate":"2024-07-15","timestamp":1720765259000,"abstract":"  Massive social media data can reflect people's authentic thoughts, emotions,\ncommunication, etc., and therefore can be analyzed for early detection of\nmental health problems such as depression. Existing works about early\ndepression detection on social media lacked interpretability and neglected the\nheterogeneity of social media data. Furthermore, they overlooked the global\ninteraction among users. To address these issues, we develop a novel method\nthat leverages a Heterogeneous Subgraph Network with Prompt Learning(HSNPL) and\ncontrastive learning mechanisms. Specifically, prompt learning is employed to\nmap users' implicit psychological symbols with excellent interpretability while\ndeep semantic and diverse behavioral features are incorporated by a\nheterogeneous information network. Then, the heterogeneous graph network with a\ndual attention mechanism is constructed to model the relationships among\nheterogeneous social information at the feature level. Furthermore, the\nheterogeneous subgraph network integrating subgraph attention and\nself-supervised contrastive learning is developed to explore complicated\ninteractions among users and groups at the user level. Extensive experimental\nresults demonstrate that our proposed method significantly outperforms\nstate-of-the-art methods for depression detection on social media.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IGnssq_lslWkmO5tJ6scFBiaFHl5urfL3bsthhYEd04","pdfSize":"8207278","objectId":"0xb3d33ef3acce30725b97779574016d44461a2ca5136b03829d96f4d7c6f40ad0","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
