{"id":"2407.12410","title":"Proximity-based Self-Federated Learning","authors":"Davide Domini, Gianluca Aguzzi, Nicolas Farabegoli, Mirko Viroli,\n  Lukas Esterle","authorsParsed":[["Domini","Davide",""],["Aguzzi","Gianluca",""],["Farabegoli","Nicolas",""],["Viroli","Mirko",""],["Esterle","Lukas",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 08:44:45 GMT"}],"updateDate":"2024-07-18","timestamp":1721205885000,"abstract":"  In recent advancements in machine learning, federated learning allows a\nnetwork of distributed clients to collaboratively develop a global model\nwithout needing to share their local data. This technique aims to safeguard\nprivacy, countering the vulnerabilities of conventional centralized learning\nmethods. Traditional federated learning approaches often rely on a central\nserver to coordinate model training across clients, aiming to replicate the\nsame model uniformly across all nodes. However, these methods overlook the\nsignificance of geographical and local data variances in vast networks,\npotentially affecting model effectiveness and applicability. Moreover, relying\non a central server might become a bottleneck in large networks, such as the\nones promoted by edge computing. Our paper introduces a novel,\nfully-distributed federated learning strategy called proximity-based\nself-federated learning that enables the self-organised creation of multiple\nfederations of clients based on their geographic proximity and data\ndistribution without exchanging raw data. Indeed, unlike traditional\nalgorithms, our approach encourages clients to share and adjust their models\nwith neighbouring nodes based on geographic proximity and model accuracy. This\nmethod not only addresses the limitations posed by diverse data distributions\nbut also enhances the model's adaptability to different regional\ncharacteristics creating specialized models for each federation. We demonstrate\nthe efficacy of our approach through simulations on well-known datasets,\nshowcasing its effectiveness over the conventional centralized federated\nlearning framework.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nG1PTk7LpMpLr8hszaSfM7I4PxSK-RGNuCFx7PVMCzw","pdfSize":"1029845","objectId":"0x5535f9f19a171c01c33eda4bc65774d406b5abe49cdb2c2763ba5a05667aa202","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
