{"id":"2407.16850","title":"Covering a Graph with Dense Subgraph Families, via Triangle-Rich Sets","authors":"Sabyasachi Basu, Daniel Paul-Pena, Kun Qian, C. Seshadhri, Edward W\n  Huang, Karthik Subbian","authorsParsed":[["Basu","Sabyasachi",""],["Paul-Pena","Daniel",""],["Qian","Kun",""],["Seshadhri","C.",""],["Huang","Edward W",""],["Subbian","Karthik",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 21:26:37 GMT"}],"updateDate":"2024-07-25","timestamp":1721769997000,"abstract":"  Graphs are a fundamental data structure used to represent relationships in\ndomains as diverse as the social sciences, bioinformatics, cybersecurity, the\nInternet, and more. One of the central observations in network science is that\nreal-world graphs are globally sparse, yet contains numerous \"pockets\" of high\nedge density. A fundamental task in graph mining is to discover these dense\nsubgraphs. Most common formulations of the problem involve finding a single (or\na few) \"optimally\" dense subsets. But in most real applications, one does not\ncare for the optimality. Instead, we want to find a large collection of dense\nsubsets that covers a significant fraction of the input graph.\n  We give a mathematical formulation of this problem, using a new definition of\nregularly triangle-rich (RTR) families. These families capture the notion of\ndense subgraphs that contain many triangles and have degrees comparable to the\nsubgraph size. We design a provable algorithm, RTRExtractor, that can discover\nRTR families that approximately cover any RTR set. The algorithm is efficient\nand is inspired by recent results that use triangle counts for community\ntesting and clustering.\n  We show that RTRExtractor has excellent behavior on a large variety of\nreal-world datasets. It is able to process graphs with hundreds of millions of\nedges within minutes. Across many datasets, RTRExtractor achieves high coverage\nusing high edge density datasets. For example, the output covers a quarter of\nthe vertices with subgraphs of edge density more than (say) $0.5$, for datasets\nwith 10M+ edges. We show an example of how the output of RTRExtractor\ncorrelates with meaningful sets of similar vertices in a citation network,\ndemonstrating the utility of RTRExtractor for unsupervised graph discovery\ntasks.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Z9yWREJWh7yuCeElCE367F_K42ouSREwaMhEhQvCpgY","pdfSize":"787623","objectId":"0x539811a7214e07883fb2b629d33ed2a88118eccb8e69538aad79b8225c086864","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
