{"id":"2407.20693","title":"Boosting Audio Visual Question Answering via Key Semantic-Aware Cues","authors":"Guangyao Li, Henghui Du, and Di Hu","authorsParsed":[["Li","Guangyao",""],["Du","Henghui",""],["Hu","Di",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 09:41:37 GMT"}],"updateDate":"2024-07-31","timestamp":1722332497000,"abstract":"  The Audio Visual Question Answering (AVQA) task aims to answer questions\nrelated to various visual objects, sounds, and their interactions in videos.\nSuch naturally multimodal videos contain rich and complex dynamic audio-visual\ncomponents, with only a portion of them closely related to the given questions.\nHence, effectively perceiving audio-visual cues relevant to the given questions\nis crucial for correctly answering them. In this paper, we propose a\nTemporal-Spatial Perception Model (TSPM), which aims to empower the model to\nperceive key visual and auditory cues related to the questions. Specifically,\nconsidering the challenge of aligning non-declarative questions and visual\nrepresentations into the same semantic space using visual-language pretrained\nmodels, we construct declarative sentence prompts derived from the question\ntemplate, to assist the temporal perception module in better identifying\ncritical segments relevant to the questions. Subsequently, a spatial perception\nmodule is designed to merge visual tokens from selected segments to highlight\nkey latent targets, followed by cross-modal interaction with audio to perceive\npotential sound-aware areas. Finally, the significant temporal-spatial cues\nfrom these modules are integrated to answer the question. Extensive experiments\non multiple AVQA benchmarks demonstrate that our framework excels not only in\nunderstanding audio-visual scenes but also in answering complex questions\neffectively. Code is available at https://github.com/GeWu-Lab/TSPM.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"xgFUqVYTYuThk7uil7qK1DJlYkVoNuZTwvbUJfTyKrc","pdfSize":"1371333","objectId":"0xad619d195095c0ba920c60c6b78955c2e8f136b2b793091c382c1efe91c14581","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
