{"id":"2407.07040","title":"Garment suggestion based on comfort extracted from physiological and\n  emotional parameters","authors":"Hyo Jung (Julie) Chang (Department of Hospitality and Retail\n  Management, Texas Tech University, Lubbock, Texas, USA), Mohammad Abu Nasir\n  Rakib (Department of Computer Science and Engineering, University of Texas at\n  Arlington, Arlington, Texas, USA), Kamrul H Foysal (Department of Electrical\n  and Computer Engineering, Texas Tech University, Lubbock, Texas, USA), Jo\n  Woon Chong (Department of Electrical and Computer Engineering, Texas Tech\n  University, Lubbock, Texas, USA)","authorsParsed":[["Jung","Hyo","","Julie"],["Chang","","","Department of Hospitality and Retail\n  Management, Texas Tech University, Lubbock, Texas, USA"],["Rakib","Mohammad Abu Nasir","","Department of Computer Science and Engineering, University of Texas at\n  Arlington, Arlington, Texas, USA"],["Foysal","Kamrul H","","Department of Electrical\n  and Computer Engineering, Texas Tech University, Lubbock, Texas, USA"],["Chong","Jo Woon","","Department of Electrical and Computer Engineering, Texas Tech\n  University, Lubbock, Texas, USA"]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 17:02:33 GMT"}],"updateDate":"2024-07-10","timestamp":1720544553000,"abstract":"  The purpose of the study was to find the true comfort of the wearer by\nconceptualizing, formulating, and proving the relation between physiological\nand emotional parameters with clothing fit and fabric. A mixed-method research\ndesign was used, and the findings showed that physiological indicators such as\nheart rate are closely linked with user comfort. However, a significant change\nin emotional response indicated a definite relationship between different\nfabric and fit types. The research was conducted to discover the relation\nbetween true comfort parameters and clothing, which is unique to the field. The\nfindings help us understand how fabric types and clothing fit types can affect\nphysiological and emotional responses, providing the consumer with satisfactory\nclothing with the suitable properties needed.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"c01SU1ZhaovAandu_INOCg7iDbmFvddiWyOfhy4kn-k","pdfSize":"845855"}
