{"id":"2407.00568","title":"Divide And Conquer: Learning Chaotic Dynamical Systems With Multistep\n  Penalty Neural Ordinary Differential Equations","authors":"Dibyajyoti Chakraborty, Seung Whan Chung, Troy Arcomano, Romit Maulik","authorsParsed":[["Chakraborty","Dibyajyoti",""],["Chung","Seung Whan",""],["Arcomano","Troy",""],["Maulik","Romit",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 02:50:28 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 02:54:49 GMT"},{"version":"v3","created":"Wed, 11 Sep 2024 04:25:39 GMT"}],"updateDate":"2024-09-12","timestamp":1719715828000,"abstract":"  Forecasting high-dimensional dynamical systems is a fundamental challenge in\nvarious fields, such as geosciences and engineering. Neural Ordinary\nDifferential Equations (NODEs), which combine the power of neural networks and\nnumerical solvers, have emerged as a promising algorithm for forecasting\ncomplex nonlinear dynamical systems. However, classical techniques used for\nNODE training are ineffective for learning chaotic dynamical systems. In this\nwork, we propose a novel NODE-training approach that allows for robust learning\nof chaotic dynamical systems. Our method addresses the challenges of\nnon-convexity and exploding gradients associated with underlying chaotic\ndynamics. Training data trajectories from such systems are split into multiple,\nnon-overlapping time windows. In addition to the deviation from the training\ndata, the optimization loss term further penalizes the discontinuities of the\npredicted trajectory between the time windows. The window size is selected\nbased on the fastest Lyapunov time scale of the system. Multi-step penalty(MP)\nmethod is first demonstrated on Lorenz equation, to illustrate how it improves\nthe loss landscape and thereby accelerates the optimization convergence. MP\nmethod can optimize chaotic systems in a manner similar to least-squares\nshadowing with significantly lower computational costs. Our proposed algorithm,\ndenoted the Multistep Penalty NODE, is applied to chaotic systems such as the\nKuramoto-Sivashinsky equation, the two-dimensional Kolmogorov flow, and ERA5\nreanalysis data for the atmosphere. It is observed that MP-NODE provide viable\nperformance for such chaotic systems, not only for short-term trajectory\npredictions but also for invariant statistics that are hallmarks of the chaotic\nnature of these dynamics.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"aK6YQNkqDS8JjmRS1Ea2XWa6XVvNnarWbMG1ux3kRSM","pdfSize":"2717317","objectId":"0xce02038f2af093ebf658271d666e988cb0902f8061856e371febb1320a449826","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
