{"id":"2407.04422","title":"Global analysis of fragmentation functions to charged hadrons with\n  high-precision data from the LHC","authors":"Jun Gao, ChongYang Liu, XiaoMin Shen, Hongxi Xing, Yuxiang Zhao","authorsParsed":[["Gao","Jun",""],["Liu","ChongYang",""],["Shen","XiaoMin",""],["Xing","Hongxi",""],["Zhao","Yuxiang",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 03:57:04 GMT"}],"updateDate":"2024-07-08","timestamp":1719806224000,"abstract":"  Fragmentation functions (FFs) are essential non-perturbative QCD inputs for\npredicting hadron production cross sections in high energy scatterings. In this\nstudy, we present a joint determination of FFs for light charged hadrons\nthrough a global analysis at next-to-leading order (NLO) in QCD. Our analysis\nincorporates a wide range of precision measurements from the LHC, as well as\ndata from electron-positron collisions and semi-inclusive deep inelastic\nscatterings. By including measurements of jet fragmentation at the LHC in our\nglobal analysis, we are able to impose strong constraints on the gluon FFs. A\ncareful selection of hadron kinematics is applied to ensure the validity of\nfactorization and perturbative calculations of QCD. In addition, we introduce\nseveral methodological advances in fitting, resulting in a flexible\nparametrization form and the inclusion of theoretical uncertainties from\nperturbative calculations. Our best-fit predictions show very good agreement\nwith the global data, with $\\chi^2/N_{pt}\\sim 0.90$. We also generate a large\nnumber of Hessian error sets to estimate uncertainties and correlations of the\nextracted FFs. FFs to charged pions (kaons and protons) are well constrained\nfor momentum fractions down to 0.01 (0.1). Total momentum of partons carried by\nlight charged hadrons are determined precisely. Their values for $u$, $d$\nquarks and gluon saturate at about 50\\% for a lower cut of the momentum\nfraction of 0.01. Pulls from individual datasets and impact of various choices\nof the analysis are also studied in details. Additionally, we present an update\nof the FMNLO program used for calculating hadron production cross sections. Our\nFFs, including the error sets (denoted as NPC23), are publicly available in the\nform of LHAPDF6 grids.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment","Physics/Nuclear Experiment","Physics/Nuclear Theory"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"_NCVmukwNa968Xcc_kjkw642JXBveZlOMFt8kjSA5go","pdfSize":"4219424"}
