{"id":"2407.02112","title":"A Data-Centric Perspective on Evaluating Machine Learning Models for\n  Tabular Data","authors":"Andrej Tschalzev, Sascha Marton, Stefan L\\\"udtke, Christian Bartelt,\n  Heiner Stuckenschmidt","authorsParsed":[["Tschalzev","Andrej",""],["Marton","Sascha",""],["Lüdtke","Stefan",""],["Bartelt","Christian",""],["Stuckenschmidt","Heiner",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 09:54:39 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 09:43:12 GMT"}],"updateDate":"2024-08-27","timestamp":1719914079000,"abstract":"  Tabular data is prevalent in real-world machine learning applications, and\nnew models for supervised learning of tabular data are frequently proposed.\nComparative studies assessing the performance of models typically consist of\nmodel-centric evaluation setups with overly standardized data preprocessing.\nThis paper demonstrates that such model-centric evaluations are biased, as\nreal-world modeling pipelines often require dataset-specific preprocessing and\nfeature engineering. Therefore, we propose a data-centric evaluation framework.\nWe select 10 relevant datasets from Kaggle competitions and implement\nexpert-level preprocessing pipelines for each dataset. We conduct experiments\nwith different preprocessing pipelines and hyperparameter optimization (HPO)\nregimes to quantify the impact of model selection, HPO, feature engineering,\nand test-time adaptation. Our main findings are: 1. After dataset-specific\nfeature engineering, model rankings change considerably, performance\ndifferences decrease, and the importance of model selection reduces. 2. Recent\nmodels, despite their measurable progress, still significantly benefit from\nmanual feature engineering. This holds true for both tree-based models and\nneural networks. 3. While tabular data is typically considered static, samples\nare often collected over time, and adapting to distribution shifts can be\nimportant even in supposedly static data. These insights suggest that research\nefforts should be directed toward a data-centric perspective, acknowledging\nthat tabular data requires feature engineering and often exhibits temporal\ncharacteristics. Our framework is available under:\nhttps://github.com/atschalz/dc_tabeval.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kLiGqFnYJWi8XuMa03OcyNUQlwNRKnFKnPkZsiKRDpI","pdfSize":"654850","objectId":"0xa9bd81da760ae519ead5c5ce79ee7c6aed576eb38a64fdb02333916fe8d7dc47","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
