{"id":"2407.10753","title":"OPEN: Object-wise Position Embedding for Multi-view 3D Object Detection","authors":"Jinghua Hou, Tong Wang, Xiaoqing Ye, Zhe Liu, Shi Gong, Xiao Tan,\n  Errui Ding, Jingdong Wang, Xiang Bai","authorsParsed":[["Hou","Jinghua",""],["Wang","Tong",""],["Ye","Xiaoqing",""],["Liu","Zhe",""],["Gong","Shi",""],["Tan","Xiao",""],["Ding","Errui",""],["Wang","Jingdong",""],["Bai","Xiang",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 14:29:15 GMT"}],"updateDate":"2024-07-16","timestamp":1721053755000,"abstract":"  Accurate depth information is crucial for enhancing the performance of\nmulti-view 3D object detection. Despite the success of some existing multi-view\n3D detectors utilizing pixel-wise depth supervision, they overlook two\nsignificant phenomena: 1) the depth supervision obtained from LiDAR points is\nusually distributed on the surface of the object, which is not so friendly to\nexisting DETR-based 3D detectors due to the lack of the depth of 3D object\ncenter; 2) for distant objects, fine-grained depth estimation of the whole\nobject is more challenging. Therefore, we argue that the object-wise depth (or\n3D center of the object) is essential for accurate detection. In this paper, we\npropose a new multi-view 3D object detector named OPEN, whose main idea is to\neffectively inject object-wise depth information into the network through our\nproposed object-wise position embedding. Specifically, we first employ an\nobject-wise depth encoder, which takes the pixel-wise depth map as a prior, to\naccurately estimate the object-wise depth. Then, we utilize the proposed\nobject-wise position embedding to encode the object-wise depth information into\nthe transformer decoder, thereby producing 3D object-aware features for final\ndetection. Extensive experiments verify the effectiveness of our proposed\nmethod. Furthermore, OPEN achieves a new state-of-the-art performance with\n64.4% NDS and 56.7% mAP on the nuScenes test benchmark.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZmIdmL95cRiRUTMubthgII9m2YCF22lqaDgcVwHEbAo","pdfSize":"3813514","objectId":"0xc41f5304910fcaee0966a255af76166a7d0d5566c2550e9848ccf4331012b20d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
