{"id":"2407.20585","title":"A UAV-Enabled Time-Sensitive Data Collection Scheme for Grassland\n  Monitoring Edge Networks","authors":"Dongbin Jiao, Zihao Wang, Wen Fan, Weibo Yang, Peng Yang, Zhanhuan\n  Shang, and Shi Yan","authorsParsed":[["Jiao","Dongbin",""],["Wang","Zihao",""],["Fan","Wen",""],["Yang","Weibo",""],["Yang","Peng",""],["Shang","Zhanhuan",""],["Yan","Shi",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 06:40:37 GMT"},{"version":"v2","created":"Sat, 10 Aug 2024 04:49:08 GMT"}],"updateDate":"2024-08-13","timestamp":1722321637000,"abstract":"  Grassland monitoring is essential for the sustainable development of\ngrassland resources. Traditional Internet of Things (IoT) devices generate\ncritical ecological data, making data loss unacceptable, but the harsh\nenvironment complicates data collection. Unmanned Aerial Vehicle (UAV) and\nmobile edge computing (MEC) offer efficient data collection solutions,\nenhancing performance on resource-limited mobile devices. In this context, this\npaper is the first to investigate a UAV-enabled time-sensitive data collection\nproblem (TSDCMP) within grassland monitoring edge networks (GMENs). Unlike many\nexisting data collection scenarios, this problem has three key challenges.\nFirst, the total amount of data collected depends significantly on the data\ncollection duration and arrival time of UAV at each access point (AP). Second,\nthe volume of data at different APs varies among regions due to differences in\nmonitoring objects and vegetation coverage. Third, the service requests time\nand locations from APs are often not adjacent topologically. To address these\nissues, We formulate the TSDCMP for UAV-enabled GMENs as a mixed-integer\nprogramming model in a single trip. This model considers constraints such as\nthe limited energy of UAV, the coupled routing and time scheduling, and the\nstate of APs and UAV arrival time. Subsequently, we propose a novel cooperative\nheuristic algorithm based on temporal-spatial correlations (CHTSC) that\nintegrates a modified dynamic programming (MDP) into an iterated local search\nto solve the TSDCMP for UAV-enabled GMENs. This approach fully takes into\naccount the temporal and spatial relationships between consecutive service\nrequests from APs. Systematic simulation studies demonstrate that the\nmixed-integer programming model effectively represents the TSDCMP within\nUAV-enabled GMENs.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SOyiNlZnRaSs2Ovt7rt6CxtqWvhWOEYO1p_HEZXcyIE","pdfSize":"3162014","objectId":"0xf05090fb180d5eef0b054ffc148daee1993a6fbbcb7b6c860b61ac24cba5f596","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
