{"id":"2407.04281","title":"WOMD-Reasoning: A Large-Scale Language Dataset for Interaction and\n  Driving Intentions Reasoning","authors":"Yiheng Li, Chongjian Ge, Chenran Li, Chenfeng Xu, Masayoshi Tomizuka,\n  Chen Tang, Mingyu Ding, Wei Zhan","authorsParsed":[["Li","Yiheng",""],["Ge","Chongjian",""],["Li","Chenran",""],["Xu","Chenfeng",""],["Tomizuka","Masayoshi",""],["Tang","Chen",""],["Ding","Mingyu",""],["Zhan","Wei",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 06:26:53 GMT"}],"updateDate":"2024-07-08","timestamp":1720160813000,"abstract":"  We propose Waymo Open Motion Dataset-Reasoning (WOMD-Reasoning), a language\nannotation dataset built on WOMD, with a focus on describing and reasoning\ninteractions and intentions in driving scenarios. Previous language datasets\nprimarily captured interactions caused by close distances. However,\ninteractions induced by traffic rules and human intentions, which can occur\nover long distances, are yet sufficiently covered, despite being very common\nand more challenging for prediction or planning models to understand.\nTherefore, our WOMD-Reasoning focuses extensively on these interactions,\nproviding a total of 409k Q&As for varying types of interactions. Additionally,\nWOMD-Reasoning presents by far the largest Q&A dataset on real-world driving\nscenarios, with around 3 million Q&As covering various topics of autonomous\ndriving from map descriptions, motion status descriptions, to narratives and\nanalyses of agents' interactions, behaviors, and intentions. This extensive\ntextual information enables fine-tuning driving-related Large Language Models\n(LLMs) for a wide range of applications like scene description, prediction,\nplanning, etc. By incorporating interaction and intention language from\nWOMD-Reasoning, we see significant enhancements in the performance of the\nstate-of-the-art trajectory prediction model, Multipath++, with improvements of\n10.14% in $MR_6$ and 6.90% in $minFDE_6$, proving the effectiveness of\nWOMD-Reasoning. We hope WOMD-Reasoning would empower LLMs in driving to offer\nbetter interaction understanding and behavioral reasoning. The dataset is\navailable on https://waymo.com/open/download .\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"5e2zRN-yO85NJapd4PDbEHoeNcmFjQXIVolYCBq7re4","pdfSize":"20417151"}
