{"id":"2407.05929","title":"Multiplexity is temporal: effects of social times on network structure","authors":"Javier Ure\\~na-Carrion and Sara Heydari and Talayeh Aledavood and Jari\n  Saram\\\"aki and Mikko Kivel\\\"a","authorsParsed":[["Ureña-Carrion","Javier",""],["Heydari","Sara",""],["Aledavood","Talayeh",""],["Saramäki","Jari",""],["Kivelä","Mikko",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 13:35:48 GMT"}],"updateDate":"2024-07-09","timestamp":1720445748000,"abstract":"  Large-scale social networks constructed using contact metadata have been\ninvaluable tools for understanding and testing social theories of society-wide\nsocial structures. However, multiplex relationships explaining different social\ncontexts have been out of reach of this methodology, limiting our ability to\nunderstand this crucial aspect of social systems. We propose a method that\ninfers latent social times from the weekly activity of large-scale contact\nmetadata, and reconstruct multilayer networks where layers correspond to social\ntimes. We then analyze the temporal multiplexity of ties in a society-wide\ncommunication network of millions of individuals. This allows us to test the\npropositions of Feld's social focus theory across a society-wide network: We\nshow that ties favour their own social times regardless of contact intensity,\nsuggesting they reflect underlying social foci. We present a result on strength\nof monoplex ties, which indicates that monoplex ties are bridging and even more\nimportant for global network connectivity than the weak, low-contact ties.\nFinally, we show that social times are transitive, so that when egos use a\nsocial time for a small subset of alters, the alters use the social time among\nthemselves as well. Our framework opens up a way to analyse large-scale\ncommunication as multiplex networks and uncovers society-level patterns of\nmultiplex connectivity.\n","subjects":["Physics/Physics and Society","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lyp16teL-esP9lhkE9VqdNLGkop0HoDnsHMo6Wx2YLk","pdfSize":"663389"}
