{"id":"2407.02286","title":"Rethinking Data Augmentation for Robust LiDAR Semantic Segmentation in\n  Adverse Weather","authors":"Junsung Park, Kyungmin Kim, Hyunjung Shim","authorsParsed":[["Park","Junsung",""],["Kim","Kyungmin",""],["Shim","Hyunjung",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 14:19:51 GMT"},{"version":"v2","created":"Sat, 13 Jul 2024 07:48:32 GMT"},{"version":"v3","created":"Tue, 16 Jul 2024 06:32:33 GMT"},{"version":"v4","created":"Wed, 17 Jul 2024 10:50:27 GMT"}],"updateDate":"2024-07-18","timestamp":1719929991000,"abstract":"  Existing LiDAR semantic segmentation methods often struggle with performance\ndeclines in adverse weather conditions. Previous work has addressed this issue\nby simulating adverse weather or employing universal data augmentation during\ntraining. However, these methods lack a detailed analysis and understanding of\nhow adverse weather negatively affects LiDAR semantic segmentation performance.\nMotivated by this issue, we identified key factors of adverse weather and\nconducted a toy experiment to pinpoint the main causes of performance\ndegradation: (1) Geometric perturbation due to refraction caused by fog or\ndroplets in the air and (2) Point drop due to energy absorption and occlusions.\nBased on these findings, we propose new strategic data augmentation techniques.\nFirst, we introduced a Selective Jittering (SJ) that jitters points in the\nrandom range of depth (or angle) to mimic geometric perturbation. Additionally,\nwe developed a Learnable Point Drop (LPD) to learn vulnerable erase patterns\nwith a Deep Q-Learning Network to approximate the point drop phenomenon from\nadverse weather conditions. Without precise weather simulation, these\ntechniques strengthen the LiDAR semantic segmentation model by exposing it to\nvulnerable conditions identified by our data-centric analysis. Experimental\nresults confirmed the suitability of the proposed data augmentation methods for\nenhancing robustness against adverse weather conditions. Our method achieves a\nnotable 39.5 mIoU on the SemanticKITTI-to-SemanticSTF benchmark, improving the\nbaseline by 8.1\\%p and establishing a new state-of-the-art. Our code will be\nreleased at \\url{https://github.com/engineerJPark/LiDARWeather}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"O12UGi006X0-zY_SQt6zMlO0Si1MQ0D7bjC_sry9Usw","pdfSize":"7068997","objectId":"0xf12cf66bf52d994e798820b48cc1e644f306654afa75a9179b2bfc76bf8ede7a","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
