{"id":"2407.20234","title":"Exploring Factors Affecting Student Learning Satisfaction during\n  COVID-19 in South Korea","authors":"Jiwon Han, Chaeeun Ryu, Gayathri Nadarajan","authorsParsed":[["Han","Jiwon",""],["Ryu","Chaeeun",""],["Nadarajan","Gayathri",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 14:28:11 GMT"}],"updateDate":"2024-07-31","timestamp":1720794491000,"abstract":"  Understanding students' preferences and learning satisfaction during COVID-19\nhas focused on learning attributes such as self-efficacy, performance, and\nengagement. Although existing efforts have constructed statistical models\ncapable of accurately identifying significant factors impacting learning\nsatisfaction, they do not necessarily explain the complex relationships among\nthese factors in depth. This study aimed to understand several facets related\nto student learning preferences and satisfaction during the pandemic such as\nindividual learner characteristics, instructional design elements and social\nand environmental factors. Responses from 302 students from Sungkyunkwan\nUniversity, South Korea were collected between 2021 and 2022. Information\ngathered included their gender, study major, satisfaction and motivation levels\nwhen learning, perceived performance, emotional state and learning environment.\nWilcoxon Rank sum test and Explainable Boosting Machine (EBM) were performed to\ndetermine significant differences in specific cohorts. The two core findings of\nthe study are as follows:1) Using Wilcoxon Rank Sum test, we can attest with\n95% confidence that students who took offline classes had significantly higher\nlearning satisfaction, among other attributes, than those who took online\nclasses, as with STEM versus HASS students; 2) An explainable boosting machine\n(EBM) model fitted to 95.08% accuracy determined the top five factors affecting\nstudents' learning satisfaction as their perceived performance, their\nperception on participating in class activities, their study majors, their\nability to conduct discussions in class and the study space availability at\nhome. Positive perceived performance and ability to discuss with classmates had\na positive impact on learning satisfaction, while negative perception on class\nactivities participation had a negative impact on learning satisfaction.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"M2vR0XiJkCthKrXK0U2_eh3X1MPK1A1DhMlzkxoddu8","pdfSize":"1645370","objectId":"0x2b3a40bd9052facddbbda66433bceb34d9b2c9196bd9655e38480778de1dc77a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
