{"id":"2407.20065","title":"Learning eigenstates of quantum many-body Hamiltonians within the\n  symmetric subspaces using neural network quantum states","authors":"Shuai-Tin. Bao, Dian Wu, Pan Zhang, and Ling Wang","authorsParsed":[["Bao","Shuai-Tin.",""],["Wu","Dian",""],["Zhang","Pan",""],["Wang","Ling",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 14:50:02 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 16:36:46 GMT"}],"updateDate":"2024-08-12","timestamp":1722264602000,"abstract":"  The exploration of neural network quantum states has become widespread in the\nstudies of complicated quantum many-body systems. However, achieving high\nprecision remains challenging due to the exponential growth of Hilbert space\nsize and the intricate sign structures. Utilizing symmetries of the physical\nsystem, we propose a method to evaluate and sample the variational ansatz\nwithin a symmetric subspace. This approach isolates different symmetry sectors,\nreducing the relevant Hilbert space size by a factor approximately proportional\nto the size of the symmetry group. It is inspired by exact diagonalization\ntechniques and the work of Choo et al. in Phys. Rev. Lett. 121, 167204 (2018).\nWe validate our method using the frustrated spin-1/2 $J_1$-$J_2$\nantiferromagnetic Heisenberg chain and compare its performance to the case\nwithout symmetrization. The results indicate that our symmetric subspace\napproach achieves a substantial improvement over the full Hilbert space on\noptimizing the ansatz, reducing the energy error by orders of magnitude. We\nalso compare the results on degenerate eigenstates with different quantum\nnumbers, highlighting the advantage of operating within a smaller Hilbert\nsubspace.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4pJBVx-nhiGCd_6SYkGtcpYMlDCOO9obIkWwPv1Zxqg","pdfSize":"549201","objectId":"0xa40eac2a954d4f02a7f3dcc43c374a86defc947c0e6ea45dff9d42705189e2f9","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
