{"id":"2407.11162","title":"Integrating Amortized Inference with Diffusion Models for Learning Clean\n  Distribution from Corrupted Images","authors":"Yifei Wang, Weimin Bai, Weijian Luo, Wenzheng Chen, He Sun","authorsParsed":[["Wang","Yifei",""],["Bai","Weimin",""],["Luo","Weijian",""],["Chen","Wenzheng",""],["Sun","He",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:33:20 GMT"}],"updateDate":"2024-07-17","timestamp":1721068400000,"abstract":"  Diffusion models (DMs) have emerged as powerful generative models for solving\ninverse problems, offering a good approximation of prior distributions of\nreal-world image data. Typically, diffusion models rely on large-scale clean\nsignals to accurately learn the score functions of ground truth clean image\ndistributions. However, such a requirement for large amounts of clean data is\noften impractical in real-world applications, especially in fields where data\nsamples are expensive to obtain. To address this limitation, in this work, we\nintroduce \\emph{FlowDiff}, a novel joint training paradigm that leverages a\nconditional normalizing flow model to facilitate the training of diffusion\nmodels on corrupted data sources. The conditional normalizing flow try to learn\nto recover clean images through a novel amortized inference mechanism, and can\nthus effectively facilitate the diffusion model's training with corrupted data.\nOn the other side, diffusion models provide strong priors which in turn improve\nthe quality of image recovery. The flow model and the diffusion model can\ntherefore promote each other and demonstrate strong empirical performances. Our\nelaborate experiment shows that FlowDiff can effectively learn clean\ndistributions across a wide range of corrupted data sources, such as noisy and\nblurry images. It consistently outperforms existing baselines with significant\nmargins under identical conditions. Additionally, we also study the learned\ndiffusion prior, observing its superior performance in downstream computational\nimaging tasks, including inpainting, denoising, and deblurring.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MRrP4VWlimyRpsYvBd22l3SUzxMoZOFNtLdbvofSlbk","pdfSize":"4036628","objectId":"0x16e29c799ab444bf832ead05a4f83d250bc7bcfd164ba3760e9ce352533d6bff","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
