{"id":"2407.17758","title":"Speed-enhanced Subdomain Adaptation Regression for Long-term Stable\n  Neural Decoding in Brain-computer Interfaces","authors":"Jiyu Wei, Dazhong Rong, Xinyun Zhu, Qinming He, Yueming Wang","authorsParsed":[["Wei","Jiyu",""],["Rong","Dazhong",""],["Zhu","Xinyun",""],["He","Qinming",""],["Wang","Yueming",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 04:13:34 GMT"}],"updateDate":"2024-07-26","timestamp":1721880814000,"abstract":"  Brain-computer interfaces (BCIs) offer a means to convert neural signals into\ncontrol signals, providing a potential restoration of movement for people with\nparalysis. Despite their promise, BCIs face a significant challenge in\nmaintaining decoding accuracy over time due to neural nonstationarities.\nHowever, the decoding accuracy of BCI drops severely across days due to the\nneural data drift. While current recalibration techniques address this issue to\na degree, they often fail to leverage the limited labeled data, to consider the\nsignal correlation between two days, or to perform conditional alignment in\nregression tasks. This paper introduces a novel approach to enhance\nrecalibration performance. We begin with preliminary experiments that reveal\nthe temporal patterns of neural signal changes and identify three critical\nelements for effective recalibration: global alignment, conditional speed\nalignment, and feature-label consistency. Building on these insights, we\npropose the Speed-enhanced Subdomain Adaptation Regression (SSAR) framework,\nintegrating semi-supervised learning with domain adaptation techniques in\nregression neural decoding. SSAR employs Speed-enhanced Subdomain Alignment\n(SeSA) for global and speed conditional alignment of similarly labeled data,\nwith Contrastive Consistency Constraint (CCC) to enhance the alignment of SeSA\nby reinforcing feature-label consistency through contrastive learning. Our\ncomprehensive set of experiments, both qualitative and quantitative,\nsubstantiate the superior recalibration performance and robustness of SSAR.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"c78Juak59L-Xl2-d64a2NX4_z0GTKHkrSAsCHIr9R9I","pdfSize":"1216671","objectId":"0x2b7768f72960bf991cb17ec110738d48ba584776b3fab7d6b762dc442d9458c4","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
