{"id":"2407.04199","title":"Top Research Performance Over Three Decades: A Multidimensional\n  Micro-Data Approach","authors":"Marek Kwiek, Wojciech Roszka","authorsParsed":[["Kwiek","Marek",""],["Roszka","Wojciech",""]],"versions":[{"version":"v1","created":"Fri, 5 Apr 2024 18:53:34 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 05:59:22 GMT"},{"version":"v3","created":"Sat, 7 Sep 2024 09:21:06 GMT"}],"updateDate":"2024-09-10","timestamp":1712343214000,"abstract":"  In this research, the contributions of a highly productive minority of\nscientists to the national Polish research output over the past three decades\n(1992-2021) is explored. In almost all previous research, the approaches to\nhigh research productivity are missing the time component. Cross-sectional\nstudies were not complemented by longitudinal studies: Scientists comprising\nthe classes of top performers have not been tracked over time. Three classes of\ntop performers (the upper 1%, 5%, and 10%) are examined, and a surprising\ntemporal stability of productivity patterns is found. The 1/10 and 10/50 rules\nconsistently apply across the three decades: The upper 1% of scientists, on\naverage, account for 10% of the national output, and the upper 10% account for\nalmost 50% of total output, with significant disciplinary variations. The\nRelative Presence Index (RPI) we constructed shows that men are overrepresented\nand women underrepresented in all top performers classes. Top performers are\nstudied longitudinally through their detailed publishing histories, with\nmicro-data coming from the raw Scopus dataset. Econometric models identify the\nthree most important predictors that change the odds ratio estimates of\nmembership in the top performance classes: gender, academic age, and research\ncollaboration. The downward trend in fixed effects over successive six-year\nperiods indicates increasing competition in academia. A large population of all\ninternationally visible Polish scientists (N=152,043) with their 587,558\narticles is studied.\n","subjects":["Computing Research Repository/Digital Libraries"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Bqr3IWy6_Z9_9XB3KiarTpZxK0pLXlq73EvRGCWzUKw","pdfSize":"330344"}
