{"id":"2407.06447","title":"Geospatial Trajectory Generation via Efficient Abduction: Deployment for\n  Independent Testing","authors":"Divyagna Bavikadi, Dyuman Aditya, Devendra Parkar, Paulo Shakarian,\n  Graham Mueller, Chad Parvis, Gerardo I. Simari","authorsParsed":[["Bavikadi","Divyagna",""],["Aditya","Dyuman",""],["Parkar","Devendra",""],["Shakarian","Paulo",""],["Mueller","Graham",""],["Parvis","Chad",""],["Simari","Gerardo I.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 23:11:47 GMT"}],"updateDate":"2024-07-10","timestamp":1720480307000,"abstract":"  The ability to generate artificial human movement patterns while meeting\nlocation and time constraints is an important problem in the security\ncommunity, particularly as it enables the study of the analog problem of\ndetecting such patterns while maintaining privacy. We frame this problem as an\ninstance of abduction guided by a novel parsimony function represented as an\naggregate truth value over an annotated logic program. This approach has the\nadded benefit of affording explainability to an analyst user. By showing that\nany subset of such a program can provide a lower bound on this parsimony\nrequirement, we are able to abduce movement trajectories efficiently through an\ninformed (i.e., A*) search. We describe how our implementation was enhanced\nwith the application of multiple techniques in order to be scaled and\nintegrated with a cloud-based software stack that included bottom-up rule\nlearning, geolocated knowledge graph retrieval/management, and interfaces with\ngovernment systems for independently conducted government-run tests for which\nwe provide results. We also report on our own experiments showing that we not\nonly provide exact results but also scale to very large scenarios and provide\nrealistic agent trajectories that can go undetected by machine learning anomaly\ndetectors.\n","subjects":["Computing Research Repository/Logic in Computer Science","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KioY1DMx61Vnc9f04H3F40jC0OUnrR3dtma3wcG2QwE","pdfSize":"15682409"}
