{"id":"2407.20968","title":"SoK: Payment Channel Networks","authors":"Kartick Kolachala, Mohammed Ababneh, Roopa Vishwanathan","authorsParsed":[["Kolachala","Kartick",""],["Ababneh","Mohammed",""],["Vishwanathan","Roopa",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 16:55:11 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 21:16:09 GMT"}],"updateDate":"2024-08-06","timestamp":1722358511000,"abstract":"  Payment Channel Networks (PCNs) have been proposed as an alternative solution\nto the scalability, throughput, and cost overhead associated with on-chain\ntransactions. By facilitating offchain execution of transactions, PCNs\nsignificantly reduce the burden on the blockchain, leading to faster\ntransaction processing, reduced transaction fees, and enhanced privacy. Despite\nthese advantages, the current research in PCNs presents a variety of research\nchallenges that require further exploration. In this paper, we survey the\nrecent work in several aspects of PCNs, such as pathfinding and routing,\nvirtual channels, state channels, payment channel hubs and rebalancing. This\nsurvey aims to provide the reader with a detailed understanding of the current\nstate-of-the-art in PCN research, highlighting a few important advancements.\nAdditionally, we highlight the various unresolved issues in the area of PCN\nresearch. Specifically, this paper seeks to answer the following crucial\nquestion: What are the various interesting and non-trivial challenges in PCN\nresearch that require immediate attention from the academic and research\ncommunity? By addressing this question, we aim to identify the most pressing\nproblems and future research directions that interested readers can immediately\nwork on. Through this analysis, we hope to inspire researchers and\npractitioners to tackle these challenges to make PCNs more secure and versatile\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-YahihiHPXchIyYC-MGBJDF-iz3G1XXMWfJXsS5IqIk","pdfSize":"1725332","objectId":"0x495369de95827380dac9b8bdf70fea229c97f360faf82d70c3356afd9e093343","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
