{"id":"2407.13217","title":"LIDIA: Precise Liver Tumor Diagnosis on Multi-Phase Contrast-Enhanced CT\n  via Iterative Fusion and Asymmetric Contrastive Learning","authors":"Wei Huang, Wei Liu, Xiaoming Zhang, Xiaoli Yin, Xu Han, Chunli Li,\n  Yuan Gao, Yu Shi, Le Lu, Ling Zhang, Lei Zhang, Ke Yan","authorsParsed":[["Huang","Wei",""],["Liu","Wei",""],["Zhang","Xiaoming",""],["Yin","Xiaoli",""],["Han","Xu",""],["Li","Chunli",""],["Gao","Yuan",""],["Shi","Yu",""],["Lu","Le",""],["Zhang","Ling",""],["Zhang","Lei",""],["Yan","Ke",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 07:00:23 GMT"}],"updateDate":"2024-07-19","timestamp":1721286023000,"abstract":"  The early detection and precise diagnosis of liver tumors are tasks of\ncritical clinical value, yet they pose significant challenges due to the high\nheterogeneity and variability of liver tumors. In this work, a precise LIver\ntumor DIAgnosis network on multi-phase contrast-enhance CT, named LIDIA, is\nproposed for real-world scenario. To fully utilize all available phases in\ncontrast-enhanced CT, LIDIA first employs the iterative fusion module to\naggregate variable numbers of image phases, thereby capturing the features of\nlesions at different phases for better tumor diagnosis. To effectively mitigate\nthe high heterogeneity problem of liver tumors, LIDIA incorporates asymmetric\ncontrastive learning to enhance the discriminability between different classes.\nTo evaluate our method, we constructed a large-scale dataset comprising 1,921\npatients and 8,138 lesions. LIDIA has achieved an average AUC of 93.6% across\neight different types of lesions, demonstrating its effectiveness. Besides,\nLIDIA also demonstrated strong generalizability with an average AUC of 89.3%\nwhen tested on an external cohort of 828 patients.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"16VNMPj_Py_b_lrDl2iW84962ZExWiD3sQJjKnK_JVg","pdfSize":"1826916","objectId":"0xd4d363311203dc1211cf175e4a161c1dc301f8a8939c7298270e8a7938dcfe87","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
