{"id":"2407.05876","title":"Efficiently Training Neural Networks for Imperfect Information Games by\n  Sampling Information Sets","authors":"Timo Bertram, Johannes F\\\"urnkranz, Martin M\\\"uller","authorsParsed":[["Bertram","Timo",""],["Fürnkranz","Johannes",""],["Müller","Martin",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 12:37:07 GMT"}],"updateDate":"2024-07-15","timestamp":1720442227000,"abstract":"  In imperfect information games, the evaluation of a game state not only\ndepends on the observable world but also relies on hidden parts of the\nenvironment. As accessing the obstructed information trivialises state\nevaluations, one approach to tackle such problems is to estimate the value of\nthe imperfect state as a combination of all states in the information set,\ni.e., all possible states that are consistent with the current imperfect\ninformation. In this work, the goal is to learn a function that maps from the\nimperfect game information state to its expected value. However, constructing a\nperfect training set, i.e. an enumeration of the whole information set for\nnumerous imperfect states, is often infeasible. To compute the expected values\nfor an imperfect information game like \\textit{Reconnaissance Blind Chess}, one\nwould need to evaluate thousands of chess positions just to obtain the training\ntarget for a single state. Still, the expected value of a state can already be\napproximated with appropriate accuracy from a much smaller set of evaluations.\nThus, in this paper, we empirically investigate how a budget of perfect\ninformation game evaluations should be distributed among training samples to\nmaximise the return. Our results show that sampling a small number of states,\nin our experiments roughly 3, for a larger number of separate positions is\npreferable over repeatedly sampling a smaller quantity of states. Thus, we find\nthat in our case, the quantity of different samples seems to be more important\nthan higher target quality.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qDCaV6hk9GTORaK6XoCUBvzZHW4RvbqB9sND7dBBde4","pdfSize":"1618452"}
