{"id":"2407.03298","title":"Eyes on the Game: Deciphering Implicit Human Signals to Infer Human\n  Proficiency, Trust, and Intent","authors":"Nikhil Hulle, St\\'ephane Aroca-Ouellette, Anthony J. Ries, Jake\n  Brawer, Katharina von der Wense, Alessandro Roncone","authorsParsed":[["Hulle","Nikhil",""],["Aroca-Ouellette","Stéphane",""],["Ries","Anthony J.",""],["Brawer","Jake",""],["von der Wense","Katharina",""],["Roncone","Alessandro",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 17:37:19 GMT"}],"updateDate":"2024-07-04","timestamp":1720028239000,"abstract":"  Effective collaboration between humans and AIs hinges on transparent\ncommunication and alignment of mental models. However, explicit, verbal\ncommunication is not always feasible. Under such circumstances, human-human\nteams often depend on implicit, nonverbal cues to glean important information\nabout their teammates such as intent and expertise, thereby bolstering team\nalignment and adaptability. Among these implicit cues, two of the most salient\nand fundamental are a human's actions in the environment and their visual\nattention. In this paper, we present a novel method to combine eye gaze data\nand behavioral data, and evaluate their respective predictive power for human\nproficiency, trust, and intent. We first collect a dataset of paired eye gaze\nand gameplay data in the fast-paced collaborative \"Overcooked\" environment. We\nthen train models on this dataset to compare how the predictive powers differ\nbetween gaze data, gameplay data, and their combination. We additionally\ncompare our method to prior works that aggregate eye gaze data and demonstrate\nhow these aggregation methods can substantially reduce the predictive ability\nof eye gaze. Our results indicate that, while eye gaze data and gameplay data\nexcel in different situations, a model that integrates both types consistently\noutperforms all baselines. This work paves the way for developing intuitive and\nresponsive agents that can efficiently adapt to new teammates.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"rvN62QdCm-B9Qqs6v3t-nDcifzNTmg0CpVW2yu19-h0","pdfSize":"1282949"}
