{"id":"2407.03516","title":"Three-dimensional Imaging of Pion using Lattice QCD: Generalized Parton\n  Distributions","authors":"Heng-Tong Ding, Xiang Gao, Swagato Mukherjee, Peter Petreczky, Qi Shi,\n  Sergey Syritsyn, Yong Zhao","authorsParsed":[["Ding","Heng-Tong",""],["Gao","Xiang",""],["Mukherjee","Swagato",""],["Petreczky","Peter",""],["Shi","Qi",""],["Syritsyn","Sergey",""],["Zhao","Yong",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 21:30:21 GMT"}],"updateDate":"2024-07-08","timestamp":1720042221000,"abstract":"  In this work, we report a lattice calculation of $x$-dependent valence pion\ngeneralized parton distributions (GPDs) at zero skewness with multiple values\nof the momentum transfer $-t$. The calculations are based on an $N_f=2+1$ gauge\nensemble of highly improved staggered quarks with Wilson-Clover valence\nfermion. The lattice spacing is 0.04 fm, and the pion valence mass is tuned to\nbe 300 MeV. We determine the Lorentz-invariant amplitudes of the quasi-GPD\nmatrix elements for both symmetric and asymmetric momenta transfers with\nsimilar values and show the equivalence of both frames. Then, focusing on the\nasymmetric frame, we utilize a hybrid scheme to renormalize the quasi-GPD\nmatrix elements obtained from the lattice calculations. After the Fourier\ntransforms, the quasi-GPDs are then matched to the light-cone GPDs within the\nframework of large momentum effective theory with improved matching, including\nthe next-to-next-to-leading order perturbative corrections, and leading\nrenormalon and renormalization group resummations. We also present the\n3-dimensional image of the pion in impact-parameter space through the Fourier\ntransform of the momentum transfer $-t$.\n","subjects":["Physics/High Energy Physics - Lattice","Physics/High Energy Physics - Phenomenology","Physics/Nuclear Experiment","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1ZTg2M-hZTUq3ZFusUwaZzXLtKI4C-twwJMrduZ_pGo","pdfSize":"3080319"}
