{"id":"2407.18820","title":"On Godunov-type finite volume methods for seismic wave propagation","authors":"Juan B. Camargo, Pedro S. Peixoto and Felipe A. G. Silva","authorsParsed":[["Camargo","Juan B.",""],["Peixoto","Pedro S.",""],["Silva","Felipe A. G.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 15:30:44 GMT"}],"updateDate":"2024-07-29","timestamp":1722007844000,"abstract":"  The computational complexity of simulating seismic waves demands continual\nexploration of more efficient numerical methods. While Finite Volume methods\nare widely acclaimed for tackling general nonlinear hyperbolic (wave) problems,\ntheir application in realistic seismic wave simulation remains uncommon, with\nrare investigations in the literature. Furthermore, seismic wavefields are\ninfluenced by sharp subsurface interfaces frequently encountered in realistic\nmodels, which could, in principle, be adequately solved with Finite Volume\nmethods. In this study, we delved into two Finite Volume (FV) methods to assess\ntheir efficacy and competitiveness in seismic wave simulations, compared to\ntraditional Finite Difference schemes. We investigated Gudunov-type FV methods:\nan upwind method called wave propagation algorithm (WPA), and a Central-Upwind\ntype method (CUp). Our numerical analysis uncovered that these finite volume\nmethods could provide less dispersion (albeit increased dissipation) compared\nto finite differences for seismic problems characterized by velocity profiles\nwith abrupt transitions in the velocity. However, when applied to more\nrealistic seismic models, finite volume methods yielded unfavorable outcomes\ncompared to finite difference methods, the latter offering lower computational\ncosts and higher accuracy. This highlights that despite the potential\nadvantages of finite volume methods, such as their conservative nature and\naptitude for accurately capturing shock waves in specific contexts, our results\nindicate that they are only advantageous for seismic simulations when\nunrealistic abrupt transitions are present in the velocity models.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NJ2jyeGIBVywAw5JNTwmvz1nrS-NUd7qAUxrjA7sct4","pdfSize":"6293856","objectId":"0xb50c49290c32453e2fae373bef82b0f0092ad4783f4abdfa95b8e7951739338d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
