{"id":"2407.15764","title":"Huber means on Riemannian manifolds","authors":"Jongmin Lee and Sungkyu Jung","authorsParsed":[["Lee","Jongmin",""],["Jung","Sungkyu",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 16:17:36 GMT"}],"updateDate":"2024-07-23","timestamp":1721665056000,"abstract":"  This article introduces Huber means on Riemannian manifolds, providing a\nrobust alternative to the Frechet mean by integrating elements of both square\nand absolute loss functions. The Huber means are designed to be highly\nresistant to outliers while maintaining efficiency, making it a valuable\ngeneralization of Huber's M-estimator for manifold-valued data. We\ncomprehensively investigate the statistical and computational aspects of Huber\nmeans, demonstrating their utility in manifold-valued data analysis.\nSpecifically, we establish minimal conditions for ensuring the existence and\nuniqueness of the Huber mean and discuss regularity conditions for\nunbiasedness. The Huber means are statistically consistent and enjoy the\ncentral limit theorem. Additionally, we propose a moment-based estimator for\nthe limiting covariance matrix, which is used to construct a robust one-sample\nlocation test procedure and an approximate confidence region for location\nparameters. Huber means are shown to be highly robust and efficient in the\npresence of outliers or under heavy-tailed distribution. To be more specific,\nit achieves a breakdown point of at least 0.5, the highest among all isometric\nequivariant estimators, and is more efficient than the Frechet mean under\nheavy-tailed distribution. Numerical examples on spheres and the set of\nsymmetric positive-definite matrices further illustrate the efficiency and\nreliability of the proposed Huber means on Riemannian manifolds.\n","subjects":["Mathematics/Statistics Theory","Statistics/Methodology","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ozTKmssV-HO8Z5AOri3kcvEq1WaEHw80x5W1KvBR6Wo","pdfSize":"2521559","objectId":"0xf6f2a82cd3c750fe48bc6ab253b5ca22786bd2356c28aa7edbd2bbd8dcf256ba","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
