{"id":"2407.18855","title":"Knotted optical fields: Seifert fibrations, braided open books and\n  topological constraints","authors":"Annalisa Marzuoli and Nicola Sanna","authorsParsed":[["Marzuoli","Annalisa",""],["Sanna","Nicola",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 16:38:39 GMT"}],"updateDate":"2024-07-29","timestamp":1722011919000,"abstract":"  This paper presents a novel framework for studying knotted and braided\nconfigurations of optical fields, moving beyond the conventional Hopfion\nsolution based on the Hopf fibration. By employing the Seifert fibration, a\npreferred framing is introduced to characterize the ``knottiness\" of tubular\nneighbourhoods of knots embedded in the 3-sphere. This approach yields a\nspecific presentation of Seifert surfaces and facilitates the description of\nknotted optical fields, drawing on an enriched version of Ra\\~{n}ada's\nformulation. The relation between knots and braids enables one to explore the\nconnections between configurations generated experimentally through the\ncontrolled over- and under-crossings of light beams, and concepts from\ngeometric group theory and algebraic topology. This framework, emphasizing the\nsignificance of ``braided open books\", sheds light on topological constraints\ninherent in classes of braids suitable for representing interlaced optical\nfields. These constraints primarily pertain to braids with $n\\leq3$ strands --\naligning with existing experimental implementations -- and homogeneous braids\nwith any number of strands. This paper establishes a theoretical foundation for\nunderstanding and manipulating knotted optical fields, suggesting potential\napplications and avenues for further research in this domain.\n","subjects":["Physics/Mathematical Physics","Mathematics/Mathematical Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"mQr5znmn_GVPHw_uB6F5-0rgpXwo_gvSg5zVIV6t6qA","pdfSize":"2700881","objectId":"0x1a2b01fd11659bbaba60bdb6f8f389720708fb78b34d36b233f64c196331e732","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
