{"id":"2407.10308","title":"AI Detectors are Poor Western Blot Classifiers: A Study of Accuracy and\n  Predictive Values","authors":"Romain-Daniel Gosselin","authorsParsed":[["Gosselin","Romain-Daniel",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 19:57:27 GMT"}],"updateDate":"2024-07-16","timestamp":1720987047000,"abstract":"  The recent rise of generative artificial intelligence (GenAI) capable of\ncreating scientific images presents a challenge in the fight against academic\nfraud. This study evaluates the efficacy of three free web-based AI detectors\nin identifying AI-generated images of Western blots, which is a very common\ntechnique in biology. We tested these detectors on a collection of artificial\nWestern blot images (n=48) that were created using ChatGPT 4 DALLE 3 and on\nauthentic Western blots (n=48) that were sampled from articles published within\nfour biology journals in 2015; this was before the rise of generative AI based\non large language models. The results reveal that the sensitivity (0.9583 for\nIs It AI, 0.1875 for Hive Moderation, and 0.7083 for Illuminarty) and\nspecificity (0.5417 for Is It AI, 0.8750 for Hive Moderation, and 0.4167 for\nIlluminarty) are very different. Positive predictive values (PPV) across\nvarious AI prevalence were low, for example reaching 0.1885 for Is It AI,\n0.1429 for Hive Moderation, and 0.1189 for Illuminarty at an AI prevalence of\n0.1. This highlights the difficulty in confidently determining image\nauthenticity based on the output of a single detector. Reducing the size of\nWestern blots from four to two lanes reduced test sensitivities and increased\ntest specificities but did not markedly affect overall detector accuracies and\nalso only slightly improved the PPV of one detector (Is It AI). These findings\nstrongly argue against the use of free AI detectors to detect fake scientific\nimages, and they demonstrate the urgent need for more robust detection tools\nthat are specifically trained on scientific content such as Western blot\nimages.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RIQTRrqOuILK7tlTusmq0nO__ZNCkUHbKW04Acaf_5w","pdfSize":"1587028","objectId":"0x75f90c03388cf7b461dfed1de7d4bd24c39de92c3b9d65d3cbfb88ae6740fc78","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
