{"id":"2407.03189","title":"Origin of anomalous magnetotransport in kagome superconductors\n  AV$_{3}$Sb$_{5}$ (A=K,Rb,Cs)","authors":"A. E. Koshelev, R. Chapai, D. Y. Chung, J. F. Mitchell, and U. Welp","authorsParsed":[["Koshelev","A. E.",""],["Chapai","R.",""],["Chung","D. Y.",""],["Mitchell","J. F.",""],["Welp","U.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 15:12:45 GMT"}],"updateDate":"2024-09-10","timestamp":1720019565000,"abstract":"  Multiple anomalous features in electronic spectra of metals with kagome\nlattice structure -- van Hove singularities, Dirac points, and flat bands --\nimply that materials containing this structural motif may lie at a nexus of\ntopological and correlated electron physics. Due to the prospects of such\nexceptional electronic behavior, the recent discovery of superconductivity\ncoexisting with charge-density wave (CDW) order in the layered kagome metals\nAV$_{3}$Sb$_{5}$ (A=K,Rb,Cs) has attracted considerable attention. Notably,\nthese kagome metals express unconventional magnetotransport behavior, including\na linear-in-H diagonal resistivity at low fields, and an even more peculiar,\nnonmonotonic sign-changing behavior of the Hall resistivity, which has been\nspeculated to arise from a chiral CDW. We argue here that this unusual\nmagnetotransport derives not from such unconventional phenomena, but rather\nfrom the unique fermiology of the AV$_{3}$Sb$_{5}$ materials. Specifically, it\nis caused by a large, concave hexagonal Fermi surface sheet formed in the close\nproximity to the van Hove singularities, which is backfolded into a small\nhexagonal sheet and two large triangular sheets in the CDW state. We introduce\na model of the electronic structure of these Fermi surface sheets that allows\nfor a full analytical treatment within Boltzmann kinetic theory and that\nenables semi-quantitative fits of our transport data. Specifically, we find\nthat the anomalous magnetotransport behavior is caused by the confluence of\nstrong reduction of the Fermi velocity near the van Hove singularities located\nnear the vertices of the hexagonal sheet and sharp corners in Fermi surface\ngenerated by the CDW reconstruction.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vVl41JWGXrO1d9KFZDnlAleFF4XaSycFvZdWRPrqf-Q","pdfSize":"4536924"}
