{"id":"2407.17840","title":"Complex picking via entanglement of granular mechanical metamaterials","authors":"Ashkan Rezanejad, Mostafa Mousa, Matthew Howard, Antonio Elia Forte","authorsParsed":[["Rezanejad","Ashkan",""],["Mousa","Mostafa",""],["Howard","Matthew",""],["Forte","Antonio Elia",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 07:54:42 GMT"}],"updateDate":"2024-07-26","timestamp":1721894082000,"abstract":"  When objects are packed in a cluster, physical interactions are unavoidable.\nSuch interactions emerge because of the objects geometric features; some of\nthese features promote entanglement, while others create repulsion. When\nentanglement occurs, the cluster exhibits a global, complex behaviour, which\narises from the stochastic interactions between objects. We hereby refer to\nsuch a cluster as an entangled granular metamaterial. We investigate the\ngeometrical features of the objects which make up the cluster, henceforth\nreferred to as grains, that maximise entanglement. We hypothesise that a\ncluster composed from grains with high propensity to tangle, will also show\npropensity to interact with a second cluster of tangled objects. To demonstrate\nthis, we use the entangled granular metamaterials to perform complex robotic\npicking tasks, where conventional grippers struggle. We employ an electromagnet\nto attract the metamaterial (ferromagnetic) and drop it onto a second cluster\nof objects (targets, non-ferromagnetic). When the electromagnet is\nre-activated, the entanglement ensures that both the metamaterial and the\ntargets are picked, with varying degrees of physical engagement that strongly\ndepend on geometric features. Interestingly, although the metamaterials\nstructural arrangement is random, it creates repeatable and consistent\ninteractions with a second tangled media, enabling robust picking of the\nlatter.\n","subjects":["Computing Research Repository/Robotics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"BlbXdPsNP34J-4A3RPvmVDD5AsVhtablYD1pkTVuurU","pdfSize":"3821711","objectId":"0xc6abb7454c19e32ace7cba02bc476f929bcc8a20c60ce03b36a0665c981629ea","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
