{"id":"2407.21197","title":"Pattern Formation of Freezing Infiltration in Porous Media","authors":"Nathan Jones, Adrian Moure, Xiaojing Fu","authorsParsed":[["Jones","Nathan",""],["Moure","Adrian",""],["Fu","Xiaojing",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 21:19:33 GMT"}],"updateDate":"2024-08-01","timestamp":1722374373000,"abstract":"  Gravity-driven infiltration of liquid water into unsaturated porous media can\nbe a spatially heterogeneous process due to the gravity fingering instability.\nWhen such infiltration occurs in a subfreezing porous medium, liquid water can\nreadily freeze, leading to both the removal of liquid water available for\ntransport and a reduction in local permeability. As a result of the coupling\nbetween gravity fingering and freezing, macroscopic frozen structures can form\nthat record the shape and history of the wetting front. These structures have\nbeen observed in the field in terrestrial snowpack and glacial firn layers and\nare believed to have profound impacts on how liquid water and its accompanying\nthermal content distribute during infiltration. However, a more detailed\nphysics-based understanding of freezing infiltration has been missing. In this\nwork, we use a thermodynamic nonequilibrium infiltration model to investigate\nthe emergence of refrozen structures during water infiltration into an\ninitially homogeneous and subfreezing porous medium. From scaling analysis, we\nrecover the relevant nondimensional groups that govern the physics of the\nfreezing infiltration process. We identify two key mechanisms caused by\nfreezing that reduce the effective infiltration rate, calculated as the maximum\ndepth of infiltration per elapsed time. In the first mechanism, the effective\ninfiltrate rate decreases because a portion of the liquid water is consumed due\nto freezing, and such effect can be well quantified by the freezing Damk\\\"ohler\nnumber. For the second mechanism, we report on a new phenomenon termed\nsecondary fingering, where new flow paths are established in between the\nprimary infiltration channels. We find that secondary fingering reduces the\ndegree of flow channelization and thus weakens the effective rate of\ninfiltration via flow field homogenization.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AXWqUv580EtKyYUhKaJSrvaE8yzMrxMljt9b1wAqQqU","pdfSize":"4761281","objectId":"0xcc7aac4a8f5fa82539a90830e34d1281d0711c04296084f4bab9173362de3886","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
