{"id":"2407.18338","title":"SMiCRM: A Benchmark Dataset of Mechanistic Molecular Images","authors":"Ching Ting Leung, Yufan Chen, Hanyu Gao","authorsParsed":[["Leung","Ching Ting",""],["Chen","Yufan",""],["Gao","Hanyu",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 18:52:10 GMT"}],"updateDate":"2024-07-29","timestamp":1721933530000,"abstract":"  Optical chemical structure recognition (OCSR) systems aim to extract the\nmolecular structure information, usually in the form of molecular graph or\nSMILES, from images of chemical molecules. While many tools have been developed\nfor this purpose, challenges still exist due to different types of noises that\nmight exist in the images. Specifically, we focus on the 'arrow-pushing'\ndiagrams, a typical type of chemical images to demonstrate electron flow in\nmechanistic steps. We present Structural molecular identifier of Molecular\nimages in Chemical Reaction Mechanisms (SMiCRM), a dataset designed to\nbenchmark machine recognition capabilities of chemical molecules with\narrow-pushing annotations. Comprising 453 images, it spans a broad array of\norganic chemical reactions, each illustrated with molecular structures and\nmechanistic arrows. SMiCRM offers a rich collection of annotated molecule\nimages for enhancing the benchmarking process for OCSR methods. This dataset\nincludes a machine-readable molecular identity for each image as well as\nmechanistic arrows showing electron flow during chemical reactions. It presents\na more authentic and challenging task for testing molecular recognition\ntechnologies, and achieving this task can greatly enrich the mechanisitic\ninformation in computer-extracted chemical reaction data.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing","Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SystpH4IwwH3rhtPaNCJfNX7CjlZdFyvZes88z7r1aA","pdfSize":"453410","objectId":"0x1b70415bfd11b8cf4a0ea67bc0b531171ff3d1b90feef43c672f17e16747f9cf","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
