{"id":"2407.20175","title":"Towards Localized Fine-Grained Control for Facial Expression Generation","authors":"Tuomas Varanka, Huai-Qian Khor, Yante Li, Mengting Wei, Hanwei Kung,\n  Nicu Sebe and Guoying Zhao","authorsParsed":[["Varanka","Tuomas",""],["Khor","Huai-Qian",""],["Li","Yante",""],["Wei","Mengting",""],["Kung","Hanwei",""],["Sebe","Nicu",""],["Zhao","Guoying",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 18:29:48 GMT"}],"updateDate":"2024-07-30","timestamp":1721932188000,"abstract":"  Generative models have surged in popularity recently due to their ability to\nproduce high-quality images and video. However, steering these models to\nproduce images with specific attributes and precise control remains\nchallenging. Humans, particularly their faces, are central to content\ngeneration due to their ability to convey rich expressions and intent. Current\ngenerative models mostly generate flat neutral expressions and characterless\nsmiles without authenticity. Other basic expressions like anger are possible,\nbut are limited to the stereotypical expression, while other unconventional\nfacial expressions like doubtful are difficult to reliably generate.\n  In this work, we propose the use of AUs (action units) for facial expression\ncontrol in face generation. AUs describe individual facial muscle movements\nbased on facial anatomy, allowing precise and localized control over the\nintensity of facial movements. By combining different action units, we unlock\nthe ability to create unconventional facial expressions that go beyond typical\nemotional models, enabling nuanced and authentic reactions reflective of\nreal-world expressions. The proposed method can be seamlessly integrated with\nboth text and image prompts using adapters, offering precise and intuitive\ncontrol of the generated results. Code and dataset are available in\n{https://github.com/tvaranka/fineface}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"VctXC-4LTQ4offPqCNTnb2X9gAHf9yRWyC33jMGUyeQ","pdfSize":"23352046","objectId":"0x2e8b3c589213256b5540e0dd7e4d8a719f152322d8b9af7f2da80fb56ff7f2f5","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
