{"id":"2407.10088","title":"Predictability of weakly turbulent systems from spatially sparse\n  observations using data assimilation and machine learning","authors":"Vikrant Gupta, Yuanqing Chen and Minping Wan","authorsParsed":[["Gupta","Vikrant",""],["Chen","Yuanqing",""],["Wan","Minping",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 05:28:38 GMT"}],"updateDate":"2024-07-16","timestamp":1720934918000,"abstract":"  We apply two data assimilation (DA) methods, a smoother and a filter, and a\nmodel-free machine learning (ML) shallow network to forecast two weakly\nturbulent systems. We analyse the effect of the spatial sparsity of\nobservations on accuracy of the predictions obtained from these data-driven\nmethods. Based on the results, we divide the spatial sparsity levels in three\nzones. First is the good-predictions zone in which both DA and ML methods work.\nWe find that in the good-predictions zone the observations remain dense enough\nto accurately capture the fractal manifold of the system's dynamics, which is\nmeasured using the correlation dimension. The accuracy of the DA methods in\nthis zone remains almost as good as for full-resolution observations. Second is\nthe reasonable-predictions zone in which the DA methods still work but at\nreduced prediction accuracy. Third is the bad-predictions zone in which even\nthe DA methods fail. We find that the sparsity level up to which the DA methods\nwork is almost the same up to which chaos synchronisation of these systems can\nbe achieved. The main implications of these results are that they (i) firmly\nestablish the spatial resolution up to which the data-driven methods can be\nutilised, (ii) provide measures to determine if adding more sensors will\nimprove the predictions, and (iii) quantify the advantage (in terms of the\nrequired measurement resolution) of using the governing equations within\ndata-driven methods. We also discuss the applicability of these results to\nfully developed turbulence.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"39J6zrQCdLzzUus5yx57xAUtfGRHWSleAdfJ5PzzC1Q","pdfSize":"4267250","objectId":"0x0cee994e147146d8d7572e77e38d96a1d7306130f13fd9af411778c7d24c800d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
