{"id":"2407.20784","title":"Inverse Problems with Diffusion Models: A MAP Estimation Perspective","authors":"Sai Bharath Chandra Gutha, Ricardo Vinuesa, Hossein Azizpour","authorsParsed":[["Gutha","Sai Bharath Chandra",""],["Vinuesa","Ricardo",""],["Azizpour","Hossein",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 15:41:13 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 14:01:47 GMT"}],"updateDate":"2024-09-19","timestamp":1722094873000,"abstract":"  Inverse problems have many applications in science and engineering. In\nComputer vision, several image restoration tasks such as inpainting,\ndeblurring, and super-resolution can be formally modeled as inverse problems.\nRecently, methods have been developed for solving inverse problems that only\nleverage a pre-trained unconditional diffusion model and do not require\nadditional task-specific training. In such methods, however, the inherent\nintractability of determining the conditional score function during the reverse\ndiffusion process poses a real challenge, leaving the methods to settle with an\napproximation instead, which affects their performance in practice. Here, we\npropose a MAP estimation framework to model the reverse conditional generation\nprocess of a continuous time diffusion model as an optimization process of the\nunderlying MAP objective, whose gradient term is tractable. In theory, the\nproposed framework can be applied to solve general inverse problems using\ngradient-based optimization methods. However, given the highly non-convex\nnature of the loss objective, finding a perfect gradient-based optimization\nalgorithm can be quite challenging, nevertheless, our framework offers several\npotential research directions. We use our proposed formulation to develop\nempirically effective algorithms for image restoration. We validate our\nproposed algorithms with extensive experiments over multiple datasets across\nseveral restoration tasks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kJDF7q3oXYf-2utQ6-IqmTXqhwI8WGj4SGiMrg5UV9M","pdfSize":"571438","objectId":"0xb74e609c4261ea7bcfd715d0ffa8a02fe86aabe7077dc596d3f0cac806c503bb","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
