{"id":"2407.07596","title":"Learning treatment effects while treating those in need","authors":"Bryan Wilder, Pim Welle","authorsParsed":[["Wilder","Bryan",""],["Welle","Pim",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 12:29:46 GMT"}],"updateDate":"2024-07-11","timestamp":1720614586000,"abstract":"  Many social programs attempt to allocate scarce resources to people with the\ngreatest need. Indeed, public services increasingly use algorithmic risk\nassessments motivated by this goal. However, targeting the highest-need\nrecipients often conflicts with attempting to evaluate the causal effect of the\nprogram as a whole, as the best evaluations would be obtained by randomizing\nthe allocation. We propose a framework to design randomized allocation rules\nwhich optimally balance targeting high-need individuals with learning treatment\neffects, presenting policymakers with a Pareto frontier between the two goals.\nWe give sample complexity guarantees for the policy learning problem and\nprovide a computationally efficient strategy to implement it. We then apply our\nframework to data from human services in Allegheny County, Pennsylvania.\nOptimized policies can substantially mitigate the tradeoff between learning and\ntargeting. For example, it is often possible to obtain 90% of the optimal\nutility in targeting high-need individuals while ensuring that the average\ntreatment effect can be estimated with less than 2 times the samples that a\nrandomized controlled trial would require. Mechanisms for targeting public\nservices often focus on measuring need as accurately as possible. However, our\nresults suggest that algorithmic systems in public services can be most\nimpactful if they incorporate program evaluation as an explicit goal alongside\ntargeting.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Methodology","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kYg1pWNmPXg0rydRdzrV8ZGZNwtiPE7mjcEzGadm600","pdfSize":"750099","objectId":"0x5dbc0f0ecf672100c66d062dcfe7f373572b72bba5062239456fa718089cd0a4","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
