{"id":"2407.04333","title":"PAGURI: a user experience study of creative interaction with\n  text-to-music models","authors":"Francesca Ronchini, Luca Comanducci, Gabriele Perego, Fabio Antonacci","authorsParsed":[["Ronchini","Francesca",""],["Comanducci","Luca",""],["Perego","Gabriele",""],["Antonacci","Fabio",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 08:15:55 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 13:13:32 GMT"}],"updateDate":"2024-09-06","timestamp":1720167355000,"abstract":"  In recent years, text-to-music models have been the biggest breakthrough in\nautomatic music generation. While they are unquestionably a showcase of\ntechnological progress, it is not clear yet how they can be realistically\nintegrated into the artistic practice of musicians and music practitioners.\nThis paper aims to address this question via Prompt Audio Generation User\nResearch Investigation (PAGURI), a user experience study where we leverage\nrecent text-to-music developments to study how musicians and practitioners\ninteract with these systems, evaluating their satisfaction levels. We developed\nan online tool through which users can generate music samples and/or apply\nrecently proposed personalization techniques, based on fine-tuning, to allow\nthe text-to-music model to generate sounds closer to their needs and\npreferences. Using questionnaires, we analyzed how participants interacted with\nthe proposed tool, to understand the effectiveness of text-to-music models in\nenhancing users' creativity. Results show that even if the audio samples\ngenerated and their quality may not always meet user expectations, the majority\nof the participants would incorporate the tool in their creative process.\nFurthermore, they provided insights into potential enhancements for the system\nand its integration into their music practice.\n","subjects":["Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FP0sN26pY2_NWpogt3FycbeM3J87X1sxXg2tW3sjWRo","pdfSize":"1625132"}
