{"id":"2407.00343","title":"Evanescent Optothermoelectric Trapping: Deeper Potentials at a\n  Largescale","authors":"Chaudhary Eksha Rani, Rahul Chand, Ashutosh Shukla, and G V Pavan\n  Kumar","authorsParsed":[["Rani","Chaudhary Eksha",""],["Chand","Rahul",""],["Shukla","Ashutosh",""],["Kumar","G V Pavan",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 07:11:58 GMT"}],"updateDate":"2024-07-02","timestamp":1719645118000,"abstract":"  Surface plasmons (SP) and their mediated effects have been widely used to\nmanipulate micro- and nanoscale objects of dielectric and metallic nature. In\nthis work, we show how SP excitation can be used to induce thermofluidic and\nthermoelectric effects to manipulate colloidal dynamics on a large scale. In an\nevanescent plasmonic trap, temperature gradients induce fluid flow that can\nfacilitate particle accumulation. However, large out-of-plane flows expel\nparticles from the trap, resulting in a shallow trap potential. Here, we\nnumerically demonstrate how adding thermoelectric fields can overpower the\noptical and hydrodynamic forces to achieve a stable nanoparticle assembly at\nlow excitation powers. We calculate the corresponding optical, fluidic, and\nthermoelectric trapping forces and potentials. These potentials can be enabled\nwithout resonant SP excitation, which requires careful optical alignment. Thus,\nwe explain the mechanism of how, despite weak optical intensities and forces,\nsufficient trapping force can be supplied via the evanescent optothermoelectric\ntrap to obtain large-scale reversible nanoparticle assemblies, irrespective of\ntheir shape, size, or material.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Soft Condensed Matter","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zE52CbnGQFOqANa8aq6aHp4-L42Xd2vdWQGUp6oWhJc","pdfSize":"2830284","objectId":"0xb95bf7b92407a740e3bb97faab54484c1de78906604d193e3975dadb4af8ecaa","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
