{"id":"2407.05435","title":"Polynomial Time Algorithms for Integer Programming and Unbounded Subset\n  Sum in the Total Regime","authors":"Divesh Aggarwal, Antoine Joux, Miklos Santha, Karol W\\k{e}grzycki","authorsParsed":[["Aggarwal","Divesh",""],["Joux","Antoine",""],["Santha","Miklos",""],["Węgrzycki","Karol",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 16:37:52 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 08:46:42 GMT"}],"updateDate":"2024-07-12","timestamp":1720370272000,"abstract":"  The Unbounded Subset Sum (USS) problem is an NP-hard computational problem\nwhere the goal is to decide whether there exist non-negative integers $x_1,\n\\ldots, x_n$ such that $x_1 a_1 + \\ldots + x_n a_n = b$, where $a_1 < \\cdots <\na_n < b$ are distinct positive integers with $\\text{gcd}(a_1, \\ldots, a_n)$\ndividing $b$. The problem can be solved in pseudopolynomial time, while\nspecialized cases, such as when $b$ exceeds the Frobenius number of $a_1,\n\\ldots, a_n$ simplify to a total problem where a solution always exists.\n  This paper explores the concept of totality in USS. The challenge in this\nsetting is to actually find a solution, even though we know its existence is\nguaranteed. We focus on the instances of USS where solutions are guaranteed for\nlarge $b$. We show that when $b$ is slightly greater than the Frobenius number,\nwe can find the solution to USS in polynomial time.\n  We then show how our results extend to Integer Programming with Equalities\n(ILPE), highlighting conditions under which ILPE becomes total. We investigate\nthe diagonal Frobenius number, which is the appropriate generalization of the\nFrobenius number to this context. In this setting, we give a polynomial-time\nalgorithm to find a solution of ILPE. The bound obtained from our algorithmic\nprocedure for finding a solution almost matches the recent existential bound of\nBach, Eisenbrand, Rothvoss, and Weismantel (2024).\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"Ocd_HjOgcqez8BDBj0w4GqetD4HzupOqYRQi2t4XaPk","pdfSize":"940482"}
