{"id":"2407.07898","title":"Central Bank Digital Currency: The Advent of its IT Governance in the\n  financial markets","authors":"Carlos Alberto Durigan Junior, Mauro De Mesquita Spinola, Rodrigo\n  Franco Gon\\c{c}alves, Fernando Jos\\'e Barbin Laurindo","authorsParsed":[["Junior","Carlos Alberto Durigan",""],["Spinola","Mauro De Mesquita",""],["Gonçalves","Rodrigo Franco",""],["Laurindo","Fernando José Barbin",""]],"versions":[{"version":"v1","created":"Fri, 17 May 2024 09:55:07 GMT"}],"updateDate":"2024-07-12","timestamp":1715939707000,"abstract":"  Central Bank Digital Currency (CBDC) can be defined as a virtual currency\nbased on node network and digital encryption algorithm issued by a country\nwhich has a legal credit protection. CBDCs are supported by Distributed Ledger\nTechnologies (DLTs), and they may allow a universal means of payments for the\ndigital era. There are many ways to proceed, they all require central banks to\ndevelop technological expertise. Considering these points, it is important to\nunderstand the new IT governance in the financial markets due to CBDC and\ndigital economy. Information Technology is an essential driver that will allow\nthe new financial industry design. This paper has the objective to answer two\nquestions through an updated Systematic Literature Review (SLR). The first\nquestion is What IT resources and tools have been considered or applied to set\nthe governance of CBDC adoption? The second; Identify IT governance models in\nthe financial market due to CBDC adoption. Bank for International Settlements\n(BIS) publications, Scopus and Web of Science were considered as sources of\nstudies. After the strings and including criteria were applied, fourteen papers\nwere analyzed. This paper finds many IT resources used in the CBDC adoption and\nsome preliminary IT design related to the IT governance of CBDC, in the results\nand discussion section the findings are more detailed. Finally, limitations and\nfuture work are considered. Keywords: Blockchain, Central Bank Digital Currency\n(CBDC), Digital Economy, Distributed Ledger Technology (DLT), Information\nTechnology (IT), IT governance.\n","subjects":["Quantitative Finance/General Finance"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"7RX492e2-76rYTkFWkYdRo6b3HoTA5sdqEJLKI5Z9IM","pdfSize":"324774","objectId":"0x7abc7a4eff2c4e9f9e92fa4c6279d21a3051a15b1aaf99e429f2639b2077e531","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
