{"id":"2407.17579","title":"Envisioning New Futures of Positive Social Technology: Beyond Paradigms\n  of Fixing, Protecting, and Preventing","authors":"JaeWon Kim, Lindsay Popowski, Anna Fang, Cassidy Pyle, Guo Freeman,\n  Ryan M. Kelly, Angela Y. Lee, Fannie Liu, Angela D. R. Smith, Alexandra To,\n  Amy X. Zhang","authorsParsed":[["Kim","JaeWon",""],["Popowski","Lindsay",""],["Fang","Anna",""],["Pyle","Cassidy",""],["Freeman","Guo",""],["Kelly","Ryan M.",""],["Lee","Angela Y.",""],["Liu","Fannie",""],["Smith","Angela D. R.",""],["To","Alexandra",""],["Zhang","Amy X.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 18:36:26 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 14:38:14 GMT"}],"updateDate":"2024-08-28","timestamp":1721846186000,"abstract":"  Social technology research today largely focuses on mitigating the negative\nimpacts of technology and, therefore, often misses the potential of technology\nto enhance human connections and well-being. However, we see a potential to\nshift towards a holistic view of social technology's impact on human\nflourishing. We introduce Positive Social Technology (Positech), a framework\nthat shifts emphasis toward leveraging social technologies to support and\naugment human flourishing. This workshop is organized around three themes\nrelevant to Positech: 1) \"Exploring Relevant and Adjacent Research\" to define\nand widen the Positech scope with insights from related fields, 2) \"Projecting\nthe Landscape of Positech\" for participants to outline the domain's key aspects\nand 3) \"Envisioning the Future of Positech,\" anchored around strategic planning\ntowards a sustainable research community. Ultimately, this workshop will serve\nas a platform to shift the narrative of social technology research towards a\nmore positive, human-centric approach. It will foster research that goes beyond\nfixing technologies to protect humans from harm, to also pursue enriching human\nexperiences and connections through technology.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IF0qSgsge1Qsg66n7Z0wCXwlJMSUCIQUvzagdazNwwk","pdfSize":"820954","objectId":"0xda23ec42f3415d5cb8a5dbc7f128e9821370e050cf452a420ea87c81432d5fa3","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
