{"id":"2407.04092","title":"Looking for Tiny Defects via Forward-Backward Feature Transfer","authors":"Alex Costanzino, Pierluigi Zama Ramirez, Giuseppe Lisanti, Luigi Di\n  Stefano","authorsParsed":[["Costanzino","Alex",""],["Ramirez","Pierluigi Zama",""],["Lisanti","Giuseppe",""],["Di Stefano","Luigi",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 17:59:26 GMT"},{"version":"v2","created":"Mon, 8 Jul 2024 13:19:01 GMT"}],"updateDate":"2024-07-09","timestamp":1720115966000,"abstract":"  Motivated by efficiency requirements, most anomaly detection and segmentation\n(AD&S) methods focus on processing low-resolution images, e.g., $224\\times 224$\npixels, obtained by downsampling the original input images. In this setting,\ndownsampling is typically applied also to the provided ground-truth defect\nmasks. Yet, as numerous industrial applications demand identification of both\nlarge and tiny defects, the above-described protocol may fall short in\nproviding a realistic picture of the actual performance attainable by current\nmethods. Hence, in this work, we introduce a novel benchmark that evaluates\nmethods on the original, high-resolution image and ground-truth masks, focusing\non segmentation performance as a function of the size of anomalies. Our\nbenchmark includes a metric that captures robustness with respect to defect\nsize, i.e., the ability of a method to preserve good localization from large\nanomalies to tiny ones. Furthermore, we introduce an AD&S approach based on a\nnovel Teacher-Student paradigm which relies on two shallow MLPs (the Students)\nthat learn to transfer patch features across the layers of a frozen vision\ntransformer (the Teacher). By means of our benchmark, we evaluate our proposal\nand other recent AD&S methods on high-resolution inputs containing large and\ntiny defects. Our proposal features the highest robustness to defect size, runs\nat the fastest speed, yields state-of-the-art performance on the MVTec AD\ndataset and state-of-the-art segmentation performance on the VisA dataset.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"GxA4E1bXi1oE4LtEQi08hHNHV9MZqXriV1GNH7Mjc_8","pdfSize":"19906410"}
