{"id":"2407.00295","title":"A deep neural network framework for dynamic multi-valued mapping\n  estimation and its applications","authors":"Geng Li, Di Qiu, Lok Ming Lui","authorsParsed":[["Li","Geng",""],["Qiu","Di",""],["Lui","Lok Ming",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 03:26:51 GMT"}],"updateDate":"2024-07-02","timestamp":1719631611000,"abstract":"  This paper addresses the problem of modeling and estimating dynamic\nmulti-valued mappings. While most mathematical models provide a unique solution\nfor a given input, real-world applications often lack deterministic solutions.\nIn such scenarios, estimating dynamic multi-valued mappings is necessary to\nsuggest different reasonable solutions for each input. This paper introduces a\ndeep neural network framework incorporating a generative network and a\nclassification component. The objective is to model the dynamic multi-valued\nmapping between the input and output by providing a reliable uncertainty\nmeasurement. Generating multiple solutions for a given input involves utilizing\na discrete codebook comprising finite variables. These variables are fed into a\ngenerative network along with the input, producing various output\npossibilities. The discreteness of the codebook enables efficient estimation of\nthe output's conditional probability distribution for any given input using a\nclassifier. By jointly optimizing the discrete codebook and its uncertainty\nestimation during training using a specially designed loss function, a highly\naccurate approximation is achieved. The effectiveness of our proposed framework\nis demonstrated through its application to various imaging problems, using both\nsynthetic and real imaging data. Experimental results show that our framework\naccurately estimates the dynamic multi-valued mapping with uncertainty\nestimation.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"y7POvuMitUu7rmXLuG1cQFsPN89jY0KvIcrCaLjZ04U","pdfSize":"4310083","objectId":"0xc2f1c8d1ff8b2ca3c7f063ab04dcab9d9a3ee40dddc8a4a97584308b84a592bf","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
