{"id":"2407.13410","title":"Neuromorphic Circuit Simulation with Memristors: Design and Evaluation\n  Using MemTorch for MNIST and CIFAR","authors":"Julio Souto, Guillermo Botella, Daniel Garc\\'ia, Ra\\'ul Murillo and\n  Alberto del Barrio","authorsParsed":[["Souto","Julio",""],["Botella","Guillermo",""],["García","Daniel",""],["Murillo","Raúl",""],["del Barrio","Alberto",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 11:30:33 GMT"}],"updateDate":"2024-07-19","timestamp":1721302233000,"abstract":"  Memristors offer significant advantages as in-memory computing devices due to\ntheir non-volatility, low power consumption, and history-dependent\nconductivity. These attributes are particularly valuable in the realm of\nneuromorphic circuits for neural networks, which currently face limitations\nimposed by the Von Neumann architecture and high energy demands. This study\nevaluates the feasibility of using memristors for in-memory processing by\nconstructing and training three digital convolutional neural networks with the\ndatasets MNIST, CIFAR10 and CIFAR100. Subsequent conversion of these networks\ninto memristive systems was performed using Memtorch. The simulations,\nconducted under ideal conditions, revealed minimal precision losses of nearly\n1% during inference. Additionally, the study analyzed the impact of tile size\nand memristor-specific non-idealities on performance, highlighting the\npractical implications of integrating memristors in neuromorphic computing\nsystems. This exploration into memristive neural network applications\nunderscores the potential of Memtorch in advancing neuromorphic architectures.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"7cCi00amV_8TYVhtyv_MRMZYR5DQ5FAdMvgosSusJAQ","pdfSize":"5315853","objectId":"0x2c3cb0a724f74170ba8e497b891c630dac2f5ce6e1ffcc869af1a97c9885b532","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
