{"id":"2407.17510","title":"Transfer Learning Enabled Transformer based Generative Adversarial\n  Networks (TT-GAN) for Terahertz Channel Modeling and Generating","authors":"Zhengdong Hu, Yuanbo Li, and Chong Han","authorsParsed":[["Hu","Zhengdong",""],["Li","Yuanbo",""],["Han","Chong",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 10:27:35 GMT"}],"updateDate":"2024-07-26","timestamp":1720434455000,"abstract":"  Terahertz (THz) communications, ranging from 100 GHz to 10 THz, are\nenvisioned as a promising technology for 6G and beyond wireless systems. As\nfoundation of designing THz communications, channel modeling and\ncharacterization are crucial to scrutinize the potential of the new spectrum.\nHowever, current channel modeling and standardization heavily rely on\nmeasurements, which are both time-consuming and costly to obtain in the THz\nband. Here, we propose a Transfer learning enabled Transformer based Generative\nAdversarial Network (TT-GAN) for THz channel modeling. Specifically, as a\nfundamental building block, a GAN is exploited to generate channel parameters,\nwhich can substitute measurements. To greatly improve the accuracy, the first\nT, i.e., a transformer structure with a self-attention mechanism is\nincorporated in GAN. Still incurring errors compared with ground-truth\nmeasurement, the second T, i.e., a transfer learning is designed to solve the\nmismatch between the formulated network and measurement. The proposed TT-GAN\ncan achieve high accuracy in channel modeling, while requiring only rather\nlimited amount of measurement, which is a promising complementary of channel\nstandardization that fundamentally differs from the current techniques that\nheavily rely on measurement.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oHZDCVBMfN55X_68tkJwCVTPRMDv3vumOrzzON-aSa0","pdfSize":"867803","objectId":"0x805af23b277051e33d02f70e285e51df8812d70cb5aac6b1206ecb7f171006b5","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
