{"id":"2407.11421","title":"States Hidden in Hidden States: LLMs Emerge Discrete State\n  Representations Implicitly","authors":"Junhao Chen, Shengding Hu, Zhiyuan Liu, Maosong Sun","authorsParsed":[["Chen","Junhao",""],["Hu","Shengding",""],["Liu","Zhiyuan",""],["Sun","Maosong",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 06:27:22 GMT"}],"updateDate":"2024-07-17","timestamp":1721111242000,"abstract":"  Large Language Models (LLMs) exhibit various emergent abilities. Among these\nabilities, some might reveal the internal working mechanisms of models. In this\npaper, we uncover a novel emergent capability in models: the intrinsic ability\nto perform extended sequences of calculations without relying on\nchain-of-thought step-by-step solutions. Remarkably, the most advanced models\ncan directly output the results of two-digit number additions with lengths\nextending up to 15 addends. We hypothesize that the model emerges Implicit\nDiscrete State Representations (IDSRs) within its hidden states and performs\nsymbolic calculations internally. To test this hypothesis, we design a sequence\nof experiments that look into the hidden states. Specifically, we first confirm\nthat IDSRs exist. Then, we provide interesting observations about the formation\nof IDSRs from layer, digit, and sequence perspectives. Finally, we confirm that\nmodels indeed use IDSRs to produce the final answers. However, we also discover\nthat these state representations are far from lossless in current open-sourced\nmodels, leading to inaccuracies in their final performance. Our work presents a\nnovel exploration of LLMs' symbolic calculation abilities and the underlying\nmechanisms.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dYkBYlgFqX5zNcHbFK1qC9NrJnE132bWDzihSpAHdg8","pdfSize":"623113","objectId":"0x334a665305e158db7e0c6a83544c9599d21d5879446744966a1c6cc218676d04","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
