{"id":"2407.06985","title":"PEER: Expertizing Domain-Specific Tasks with a Multi-Agent Framework and\n  Tuning Methods","authors":"Yiying Wang, Xiaojing Li, Binzhu Wang, Yueyang Zhou, Yingru Lin, Han\n  Ji, Hong Chen, Jinshi Zhang, Fei Yu, Zewei Zhao, Song Jin, Renji Gong,\n  Wanqing Xu","authorsParsed":[["Wang","Yiying",""],["Li","Xiaojing",""],["Wang","Binzhu",""],["Zhou","Yueyang",""],["Lin","Yingru",""],["Ji","Han",""],["Chen","Hong",""],["Zhang","Jinshi",""],["Yu","Fei",""],["Zhao","Zewei",""],["Jin","Song",""],["Gong","Renji",""],["Xu","Wanqing",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 15:59:28 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 03:49:05 GMT"},{"version":"v3","created":"Tue, 27 Aug 2024 17:02:41 GMT"},{"version":"v4","created":"Fri, 30 Aug 2024 06:27:58 GMT"}],"updateDate":"2024-09-02","timestamp":1720540768000,"abstract":"  In domain-specific applications, GPT-4, augmented with precise prompts or\nRetrieval-Augmented Generation (RAG), shows notable potential but faces the\ncritical tri-lemma of performance, cost, and data privacy. High performance\nrequires sophisticated processing techniques, yet managing multiple agents\nwithin a complex workflow often proves costly and challenging. To address this,\nwe introduce the PEER (Plan, Execute, Express, Review) multi-agent framework.\nThis systematizes domain-specific tasks by integrating precise question\ndecomposition, advanced information retrieval, comprehensive summarization, and\nrigorous self-assessment. Given the concerns of cost and data privacy,\nenterprises are shifting from proprietary models like GPT-4 to custom models,\nstriking a balance between cost, security, and performance. We developed\nindustrial practices leveraging online data and user feedback for efficient\nmodel tuning. This study provides best practice guidelines for applying\nmulti-agent systems in domain-specific problem-solving and implementing\neffective agent tuning strategies. Our empirical studies, particularly in the\nfinancial question-answering domain, demonstrate that our approach achieves\n95.0% of GPT-4's performance, while effectively managing costs and ensuring\ndata privacy.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"BCj2UW6XCRzXZ_cBQrjWuJFAeIu_38bAQMf9gKzhIKo","pdfSize":"1946945"}
