{"id":"2407.14815","title":"Unified Far-Field and Near-Field in Holographic MIMO: A\n  Wavenumber-Domain Perspective","authors":"Yuanbin Chen and Xufeng Guo and Gui Zhou and Shi Jin and Derrick Wing\n  Kwan Ng and Zhaocheng Wang","authorsParsed":[["Chen","Yuanbin",""],["Guo","Xufeng",""],["Zhou","Gui",""],["Jin","Shi",""],["Ng","Derrick Wing Kwan",""],["Wang","Zhaocheng",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 09:17:01 GMT"}],"updateDate":"2024-07-23","timestamp":1721467021000,"abstract":"  This article conceives a unified representation for near-field and far-field\nholographic multiple-input multiple-output (HMIMO) channels, addressing a\npractical design dilemma: \"Why does the angular-domain representation no longer\nfunction effectively?\" To answer this question, we pivot from the angular\ndomain to the wavenumber domain and present a succinct overview of its\nunderlying philosophy. In re-examining the Fourier plane-wave series expansion\nthat recasts spherical propagation waves into a series of plane waves\nrepresented by Fourier harmonics, we characterize the HMIMO channel employing\nthese Fourier harmonics having different wavenumbers. This approach, referred\nto as the wavenumebr-domain representation, facilitates a unified view across\nthe far-field and the near-field. Furthermore, the limitations of the DFT basis\nare demonstrated when identifying the sparsity inherent to the HMIMO channel,\nmotivating the development of a wavenumber-domain basis as an alternative. We\nthen present some preliminary applications of the proposed wavenumber-domain\nbasis in signal processing across both the far-field and near-field, along with\nseveral prospects for future HMIMO system designs based on the wavenumber\ndomain.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"DbI7Uy9DtJnsCNFnessjM4HktbjPsNvPKOvot8zz_14","pdfSize":"1072021","objectId":"0x64353d89366af9640a54c6e2abc6a6b6101b54a5e314fb2cb86dcf59ff1b4bcd","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
