{"id":"2407.03686","title":"DEVS/SOA: A Cross-Platform Framework for Net-centric Modeling and\n  Simulation in DEVS Unified Process","authors":"Saurabh Mittal, Jos\\'e L. Risco-Mart\\'in and Bernard P. Zeigler","authorsParsed":[["Mittal","Saurabh",""],["Risco-Martín","José L.",""],["Zeigler","Bernard P.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 07:17:48 GMT"}],"updateDate":"2024-07-08","timestamp":1720077468000,"abstract":"  Discrete EVent Specification (DEVS) environments are known to be implemented\nover middleware systems such as HLA, RMI, CORBA and others. DEVS exhibits\nconcepts of systems theory and modeling and supports capturing the system\nbehavior from the physical and behavioral perspectives. Further, they are\nimplemented using Object-oriented languages like Java and C++. This research\nwork uses the Java platform to implement DEVS over a Service Oriented\nArchitecture (SOA) framework. Called the DEVS/SOA, the framework supports a\ndevelopment and testing environment known as DEVS Unified Process that is built\non a model-continuity-based life cycle methodology. DEVS Unified Process allows\nDEVS-based Modeling and Simulation (M&S) over net-centric platforms using\nDEVS/SOA. This framework also provides the crucial feature of run-time\ncomposability of coupled systems using SOA. We describe the architecture and\ndesigns of the both the server and the client. The client application\ncommunicates with multiple servers hosting DEVS simulation services. These\nSimulation services are developed using the proposed symmetrical services\narchitecture wherein the server can act as both a service provider and a\nservice consumer contrary to the unidirectional client-server paradigm. We also\ndiscuss how this Services based architecture provides solutions for\ncross-platform distributed M&S. We demonstrate DEVS/SOA framework with a\nscenario of Joint Close Air Support specified in Business Process Modeling\nNotation (BPMN). We also provide a real-world application of Network health\nmonitoring using DEVS/SOA layered architectural framework.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"mtwdFQSY7oMBxJEDbgWey498L9CxC0hJ2C-x8bmokj4","pdfSize":"2520083"}
