{"id":"2407.08604","title":"Agglomerative Clustering in Uniform and Proportional Feature Spaces","authors":"Alexandre Benatti, Luciano da F. Costa","authorsParsed":[["Benatti","Alexandre",""],["Costa","Luciano da F.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 15:29:57 GMT"}],"updateDate":"2024-07-12","timestamp":1720711797000,"abstract":"  Pattern comparison represents a fundamental and crucial aspect of scientific\nmodeling, artificial intelligence, and pattern recognition. Three main\napproaches have typically been applied for pattern comparison: (i) distances;\n(ii) statistical joint variation; (iii) projections; and (iv) similarity\nindices, each with their specific characteristics. In addition to arguing for\nintrinsic interesting properties of multiset-based similarity approaches, the\npresent work describes a respectively based hierarchical agglomerative\nclustering approach which inherits the several interesting characteristics of\nthe coincidence similarity index -- including strict comparisons allowing\ndistinguishing between closely similar patterns, inherent normalization, as\nwell as substantial robustness to the presence of noise and outliers in\ndatasets. Two other hierarchical clustering approaches are considered, namely a\nmultiset-based method as well as the traditional Ward's approach. After\ncharacterizing uniform and proportional features spaces and presenting the main\nbasic concepts and methods, a comparison of relative performance between the\nthree considered hierarchical methods is reported and discussed, with several\ninteresting and important results. In particular, though intrinsically suitable\nfor implementing proportional comparisons, the coincidence similarity\nmethodology also works effectively in several types of data in uniform feature\nspaces\n","subjects":["Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"O_2HVc8SQWpMtR0PksFsptvvSR5dUOjvndViHcOEaz4","pdfSize":"936452","objectId":"0x2cb42be2cec8fadd87e399536af162c22597e19879865bce8037d31371bca446","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
