{"id":"2407.00218","title":"Resilient Estimator-based Control Barrier Functions for Dynamical\n  Systems with Disturbances and Noise","authors":"Chuyuan Tao, Wenbin Wan, Junjie Gao, Bihao Mo, Hunmin Kim and Naira\n  Hovakimyan","authorsParsed":[["Tao","Chuyuan",""],["Wan","Wenbin",""],["Gao","Junjie",""],["Mo","Bihao",""],["Kim","Hunmin",""],["Hovakimyan","Naira",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 20:06:22 GMT"}],"updateDate":"2024-07-02","timestamp":1719605182000,"abstract":"  Control Barrier Function (CBF) is an emerging method that guarantees safety\nin path planning problems by generating a control command to ensure the forward\ninvariance of a safety set. Most of the developments up to date assume\navailability of correct state measurements and absence of disturbances on the\nsystem. However, if the system incurs disturbances and is subject to noise, the\nCBF cannot guarantee safety due to the distorted state estimate. To improve the\nresilience and adaptability of the CBF, we propose a resilient estimator-based\ncontrol barrier function (RE-CBF), which is based on a novel stochastic CBF\noptimization and resilient estimator, to guarantee the safety of systems with\ndisturbances and noise in the path planning problems. The proposed algorithm\nuses the resilient estimation algorithm to estimate disturbances and counteract\ntheir effect using novel stochastic CBF optimization, providing safe control\ninputs for dynamical systems with disturbances and noise. To demonstrate the\neffectiveness of our algorithm in handling both noise and disturbances in\ndynamics and measurement, we design a quadrotor testing pipeline to simulate\nthe proposed algorithm and then implement the algorithm on a real drone in our\nflying arena. Both simulations and real-world experiments show that the\nproposed method can guarantee safety for systems with disturbances and noise.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Robotics","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kSud-24sHUlA9cejEYianUi91dZvBSsCfqw7MLpnJeo","pdfSize":"3317679","objectId":"0xf9fc1d56f27443a2c3893f4adb98e33cd7de977cef05f643bcbf6f1942565232","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
