{"id":"2407.06356","title":"Toward Programming Languages for Reasoning: Humans, Symbolic Systems,\n  and AI Agents","authors":"Mark Marron","authorsParsed":[["Marron","Mark",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 19:50:42 GMT"}],"updateDate":"2024-07-10","timestamp":1720468242000,"abstract":"  Integration, composition, mechanization, and AI assisted development are the\ndriving themes in the future of software development. At their core these\nconcepts are rooted in the increasingly important role of computing in our\nworld, the desire to deliver functionality faster, with higher quality, and to\nempower more people to benefit from programmatic automation. These themes, and\nhow they impact the human developers driving them, are the foundations for the\nnext generation of programming languages. At first glance the needs of\nmechanization tools, AI agents, and human developers along with the various\ngoals around development velocity, software quality, and software\ndemocratization are a broad and seemingly diverse set of needs. However, at\ntheir core is a single challenge that, once resolved, enables us to make\nradical progress in all of these areas.\n  Our hypothesis is that, fundamentally, software development is a problem of\nreasoning about code and semantics. This is true for human developers\nimplementing a feature, symbolic tools building models of application behavior,\nand even for language based AI agents as they perform tasks. While the\nparticular aspects of reasoning that each agent struggles with varies to some\ndegree, they share many common themes and, surprisingly, most mainstream\nlanguages extensively employ (anti)features that make this task harder or\ninfeasible! This paper proposes a novel approach to this challenge -- instead\nof new language features or logical constructs, that add more complexity to\nwhat is already a problem of complexity, we propose radical simplification in\nthe form of the Bosque platform and language.\n","subjects":["Computing Research Repository/Programming Languages","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kxZgrCX_YNJdE_RVkAo4fJ_TLa8Xqy4KgeqFLxrC4no","pdfSize":"372875"}
