{"id":"2407.02024","title":"Parametric Light-Matter Interaction in the Single-Photon Strong Coupling\n  Limit","authors":"C.A. Potts, R.C. Dekker, S. Deve, E.W. Strijbis, G.A. Steele","authorsParsed":[["Potts","C. A.",""],["Dekker","R. C.",""],["Deve","S.",""],["Strijbis","E. W.",""],["Steele","G. A.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 07:45:34 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 12:43:52 GMT"},{"version":"v3","created":"Wed, 4 Sep 2024 07:06:20 GMT"}],"updateDate":"2024-09-05","timestamp":1719906334000,"abstract":"  Parametric coupling between harmonic oscillators has enabled exquisite\nmeasurement precision and control of linear resonators, being extensively\nstudied, for example, in cavity optomechanics. This level of control has been\nmade possible by using strong sideband drives, enhancing the coupling rate\nwhile also linearizing the interaction. In this article, we demonstrate a new\nparadigm of parametrically coupled microwave circuits replacing one linear\nmicrowave cavity with a superconducting transmon qubit. Our system utilizes\nphoton-pressure coupling between the transmon qubit and a highly linear\nmicrowave resonator, a microwave analog of the radiation-pressure interaction.\nApplying a strong sideband drive results in an on-demand, non-linear\nJaynes-Cummings interaction with the linear resonator. We also observe a\nsingle-photon coupling rate an order of magnitude larger than all decay rates,\nplacing the device in the single-photon strong coupling regime. This\ndemonstration of photon-pressure Jaynes-Cummings interactions paves the way for\ndeveloping novel photon-pressure quantum information processing hardware and\nwill enable exotic tests of quantum gravity in the future by interfacing this\nnew platform with mechanical resonators.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"N_8sTI3pMnOlRirHRT367w0WXaIQyu4FP1TlYpwQakQ","pdfSize":"4545062","objectId":"0x59061bf6467aa5f30d9104fcce6cfcee38414b4ceed9982213e27c907e2ddad5","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
