{"id":"2407.17760","title":"TwIPS: A Large Language Model Powered Texting Application to Simplify\n  Conversational Nuances for Autistic Users","authors":"Rukhshan Haroon, Fahad Dogar","authorsParsed":[["Haroon","Rukhshan",""],["Dogar","Fahad",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 04:15:54 GMT"}],"updateDate":"2024-07-26","timestamp":1721880954000,"abstract":"  Autistic individuals often experience difficulties in conveying and\ninterpreting emotional tone and non-literal nuances. Many also mask their\ncommunication style to avoid being misconstrued by others, spending\nconsiderable time and mental effort in the process. To address these challenges\nin text-based communication, we present TwIPS, a prototype texting application\npowered by a large language model (LLM), which can assist users with: a)\ndeciphering tone and meaning of incoming messages, b) ensuring the emotional\ntone of their message is in line with their intent, and c) coming up with\nalternate phrasing for messages that could be misconstrued and received\nnegatively by others. We leverage an AI-based simulation and a conversational\nscript to evaluate TwIPS with 8 autistic participants in an in-lab setting. Our\nfindings show TwIPS enables a convenient way for participants to seek\nclarifications, provides a better alternative to tone indicators, and\nfacilitates constructive reflection on writing technique and style. We also\nexamine how autistic users utilize language for self-expression and\ninterpretation in instant messaging, and gather feedback for enhancing our\nprototype. We conclude with a discussion around balancing user-autonomy with\nAI-mediation, establishing appropriate trust levels in AI systems, and\ncustomization needs if autistic users in the context of AI-assisted\ncommunication\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kaqt2IOjCSxvJDWbaMzj4_OS7nmnf1VuQhEjnywGLDU","pdfSize":"1745149","objectId":"0x40434bf8d60afbab0010f91b053e30eb6e9b2cfa2c1e801966e1f8b01d02a593","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
