{"id":"2407.18761","title":"TESSILATOR: a one-stop shop for measuring TESS rotation periods","authors":"A. S. Binks and H. M. Guenther","authorsParsed":[["Binks","A. S.",""],["Guenther","H. M.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 14:18:28 GMT"}],"updateDate":"2024-07-29","timestamp":1722003508000,"abstract":"  We present a software package designed to produce photometric lightcurves and\nmeasure rotation periods from full-frame images taken by the Transiting\nExoplanet Survey Satellite (TESS), which we name ``TESSILATOR''. TESSILATOR is\nthe only publicly-available code that will run a full lightcurve and rotation\nperiod ($P_{\\rm rot}$) analysis based on just a (list of) target identifier(s)\nor sky position(s) via a simple command-line prompt. This paper sets out to\nintroduce the rationale for developing TESSILATOR, and then describes the\nmethods, considerations and assumptions for: extracting photometry; dealing\nwith potential contamination; accounting for natural and instrumental\nsystematic effects; lightcurve normalisation and detrending; removing outliers\nand unreliable data; and finally, measuring the $P_{\\rm rot}$ value and several\nperiodogram attributes. Our methods have been tuned specifically to optimise\nTESS lightcurves and are independent from the pipelines developed by the TESS\nScience Processing Operations Center, meaning TESSILATOR can, in principle,\nanalyse {\\it any} target across the entire celestial sphere.\n  We compare TESSILATOR $P_{\\rm rot}$ measurements with TESS-SPOC-derived\nlightcurves of 1,560 (mainly FGKM-type) stars across four benchmark open\nclusters (Pisces-Eridanus, the Pleiades, the Hyades and Praesepe) and a sample\nof nearby field M-dwarfs. From a vetted subsample of 864 targets we find an\nexcellent return of $P_{\\rm rot}$ matches for the first 3 open clusters ($>85$\nper cent) and a moderate ($\\sim 60$ per cent) match for the 700 Myr Praesepe\nand MEarth sample, which validates TESSILATOR as a tool for measuring $P_{\\rm\nrot}$. The TESSILATOR code is available at\n\\url{https://github.com/alexbinks/tessilator}.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"b3f2vcrvD_-ZWnUM_Itr3kVG-gkJg7-1bISkrDB9psM","pdfSize":"4654469","objectId":"0x3ca5c3666b311f101bebe04e4643e1cc01dcf323a9de65b5793e12a03c5f4edf","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
