{"id":"2407.13494","title":"Streaming Technologies and Serialization Protocols: Empirical\n  Performance Analysis","authors":"Samuel Jackson, Nathan Cummings, Saiful Khan","authorsParsed":[["Jackson","Samuel",""],["Cummings","Nathan",""],["Khan","Saiful",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 13:24:08 GMT"}],"updateDate":"2024-07-19","timestamp":1721309048000,"abstract":"  Efficiently streaming high-volume data is essential for real-time data\nanalytics, visualization, and AI and machine learning model training. Various\nstreaming technologies and serialization protocols have been developed to meet\ndifferent streaming needs. Together, they perform differently across various\ntasks and datasets. Therefore, when developing a streaming system, it can be\nchallenging to make an informed decision on the suitable combination, as we\nencountered when implementing streaming for the UKAEA's MAST data or SKA's\nradio astronomy data. This study addresses this gap by proposing an empirical\nstudy of widely used data streaming technologies and serialization protocols.\nWe introduce an extensible and open-source software framework to benchmark\ntheir efficiency across various performance metrics. Our findings reveal\nsignificant performance differences and trade-offs between these technologies.\nThese insights can help in choosing suitable streaming and serialization\nsolutions for contemporary data challenges. We aim to provide the scientific\ncommunity and industry professionals with the knowledge to optimize data\nstreaming for better data utilization and real-time analysis.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"LB8bzCFHuI5Xv09h5ObsmI5TyWWAplx7y2mTPQwjIQ8","pdfSize":"794439","objectId":"0xa1c1d1736a8e461fc712b535880eb5029b05ec2932e6a2f4aa6ceef7111fbe42","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
