{"id":"2407.00911","title":"Deep Image-to-Recipe Translation","authors":"Jiangqin Ma, Bilal Mawji, Franz Williams","authorsParsed":[["Ma","Jiangqin",""],["Mawji","Bilal",""],["Williams","Franz",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 02:33:07 GMT"}],"updateDate":"2024-07-02","timestamp":1719801187000,"abstract":"  The modern saying, \"You Are What You Eat\" resonates on a profound level,\nreflecting the intricate connection between our identities and the food we\nconsume. Our project, Deep Image-to-Recipe Translation, is an intersection of\ncomputer vision and natural language generation that aims to bridge the gap\nbetween cherished food memories and the art of culinary creation. Our primary\nobjective involves predicting ingredients from a given food image. For this\ntask, we first develop a custom convolutional network and then compare its\nperformance to a model that leverages transfer learning. We pursue an\nadditional goal of generating a comprehensive set of recipe steps from a list\nof ingredients. We frame this process as a sequence-to-sequence task and\ndevelop a recurrent neural network that utilizes pre-trained word embeddings.\nWe address several challenges of deep learning including imbalanced datasets,\ndata cleaning, overfitting, and hyperparameter selection. Our approach\nemphasizes the importance of metrics such as Intersection over Union (IoU) and\nF1 score in scenarios where accuracy alone might be misleading. For our recipe\nprediction model, we employ perplexity, a commonly used and important metric\nfor language models. We find that transfer learning via pre-trained ResNet-50\nweights and GloVe embeddings provide an exceptional boost to model performance,\nespecially when considering training resource constraints. Although we have\nmade progress on the image-to-recipe translation, there is an opportunity for\nfuture exploration with advancements in model architectures, dataset\nscalability, and enhanced user interaction.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1VpAi8H7nytZlhUVYx3ebnhG1WyoCaIvzoRMDMx3iXo","pdfSize":"1275923","objectId":"0xfbc7a430a9e550da674e2b5beb86389f73851e82d9e9d67aa8d5ae260424e3f2","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
