{"id":"2407.14684","title":"Data Poisoning: An Overlooked Threat to Power Grid Resilience","authors":"Nora Agah, Javad Mohammadi, Alex Aved, David Ferris, Erika Ardiles\n  Cruz, Philip Morrone","authorsParsed":[["Agah","Nora",""],["Mohammadi","Javad",""],["Aved","Alex",""],["Ferris","David",""],["Cruz","Erika Ardiles",""],["Morrone","Philip",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 22:00:52 GMT"}],"updateDate":"2024-07-23","timestamp":1721426452000,"abstract":"  As the complexities of Dynamic Data Driven Applications Systems increase,\npreserving their resilience becomes more challenging. For instance, maintaining\npower grid resilience is becoming increasingly complicated due to the growing\nnumber of stochastic variables (such as renewable outputs) and extreme weather\nevents that add uncertainty to the grid. Current optimization methods have\nstruggled to accommodate this rise in complexity. This has fueled the growing\ninterest in data-driven methods used to operate the grid, leading to more\nvulnerability to cyberattacks. One such disruption that is commonly discussed\nis the adversarial disruption, where the intruder attempts to add a small\nperturbation to input data in order to \"manipulate\" the system operation.\nDuring the last few years, work on adversarial training and disruptions on the\npower system has gained popularity. In this paper, we will first review these\napplications, specifically on the most common types of adversarial disruptions:\nevasion and poisoning disruptions. Through this review, we highlight the gap\nbetween poisoning and evasion research when applied to the power grid. This is\ndue to the underlying assumption that model training is secure, leading to\nevasion disruptions being the primary type of studied disruption. Finally, we\nwill examine the impacts of data poisoning interventions and showcase how they\ncan endanger power grid resilience.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"J-pOnS83EKxcJLSLMtJaL1leYo6-Se6jpzeButTkS40","pdfSize":"303731","objectId":"0xac745c44d2b0935eb3aead258fc9b5d896bcc6c20ddcf632bb2a1a1eead5dea4","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
