{"id":"2407.08629","title":"A lattice framework for generalizing shellable complexes and matroids","authors":"Rakhi Pratihar and Tovohery H. Randrianarisoa and Klara Stokes","authorsParsed":[["Pratihar","Rakhi",""],["Randrianarisoa","Tovohery H.",""],["Stokes","Klara",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 16:08:57 GMT"}],"updateDate":"2024-07-12","timestamp":1720714137000,"abstract":"  We introduce the notion of power lattices that unifies and extends the\nequicardinal geometric lattices, Cartesian products of subspace lattices, and\nmultiset subset lattices, among several others. The notions of shellability for\nsimplicial complexes, q-complexes, and multicomplexes are then unified and\nextended to that of complexes in power lattices, which we name as P-complexes.\nA nontrivial class of shellable P-complexes are obtained via P-complexes of the\nindependent sets of a matroid in power lattice, which we introduce to\ngeneralize matroids in Boolean lattices, q-matroids in subspace lattices, and\nsum-matroids in Cartesian products of subspace lattices. We also prove that\nshellable P-complexes in a power lattice yield shellable order complexes,\nextending the celebrated result of shellability of order complexes of\n(equicardinal) geometric lattices by Bj\\\"orner and also, a recent result on\nshellability of order complexes of lexicographically shellable q-complexes.\nFinally, we provide a construction of matroids on the lattice of multiset\nsubsets from weighted graphs. We also consider a variation of Stanley-Reisner\nrings associated with shellable multicomplexes than the one considered by\nHerzog and Popescu and proved that these rings are sequentially Cohen-Macaulay.\n","subjects":["Mathematics/Combinatorics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GGLwah3RQt30iWLYwH8sNqJtNZRsR790XhBxgDYUSl4","pdfSize":"358172","objectId":"0x219ec939d275a604c3361407d38c742853e6415304bbcc5f2a3a80f3d43aec83","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
