{"id":"2407.06821","title":"Interference of ultrahigh frequency acoustic phonons from distant\n  quasi-continuous sources","authors":"C. Xiang, E. R. Cardozo de Oliveira, S. Sandeep, K. Papatryfonos, M.\n  Morassi, L. Le Gratiet, A. Harouri, I. Sagnes, A. Lemaitre, O. Ortiz, M.\n  Esmann, N. D. Lanzillotti-Kimura","authorsParsed":[["Xiang","C.",""],["de Oliveira","E. R. Cardozo",""],["Sandeep","S.",""],["Papatryfonos","K.",""],["Morassi","M.",""],["Gratiet","L. Le",""],["Harouri","A.",""],["Sagnes","I.",""],["Lemaitre","A.",""],["Ortiz","O.",""],["Esmann","M.",""],["Lanzillotti-Kimura","N. D.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 12:54:00 GMT"}],"updateDate":"2024-07-10","timestamp":1720529640000,"abstract":"  The generation of propagating acoustic waves is essential for\ntelecommunication applications, quantum technologies, and sensing. Up to now,\nthe electrical generation has been at the core of most implementations, but is\ntechnologically limited to a few gigahertz. Overcoming this frequency limit\nholds the prospect of faster modulators, quantum acoustics at higher working\ntemperatures, nanoacoustic sensing from smaller volumes. Alternatively, the\noptical excitation of acoustic resonators has unlocked frequencies up to 1 THz,\nbut in most cases, the acoustic energy cannot be efficiently extracted from the\nresonator into a propagating wave. Here, we demonstrate a quasi-continuous and\ncoherent source of 20 GHz acoustic phonons, based on a ridge waveguide,\nstructured in the vertical direction as a high-Q acousto-optic resonator. The\nhigh frequency phonons propagate up to 20 $\\mu$m away from the source, with a\ndecay rate of $\\sim$1.14 dB/$\\mu$m. We demonstrate the coherence between\nacoustic phonons generated from two distant sources through spatio-temporal\ninterference. This concept could be scaled up to a larger number of sources,\nwhich enable a new generation of optically programmed, reconfigurable\nnanoacoustic devices and applications.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZHagUXsEj50rPpoXsilaJE5LKXO25xI748mBzm5P05g","pdfSize":"6010836"}
