{"id":"2407.20406","title":"Semialgebraic groups and generalized affine buildings","authors":"Raphael Appenzeller","authorsParsed":[["Appenzeller","Raphael",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 20:27:06 GMT"}],"updateDate":"2024-07-31","timestamp":1722284826000,"abstract":"  We develop the theory of algebraic groups over real closed fields and apply\nthe results to construct a geometric object $\\mathcal{B}$ and to prove that\n$\\mathcal{B}$ is an affine $\\Lambda$-building. We use a model theoretic\ntransfer principle to prove generalizations of statements about semisimple Lie\ngroups. In this direction we give proofs for the Iwasawa-decomposition $KAU$,\nthe Cartan-decomposition $KAK$ and the Bruhat-decomposition $BWB$. For\nunipotent subgroups we prove the Baker-Campbell-Hausdorff formula and use it to\nanalyse root groups. We give a proof of the Jacobson-Morozov Lemma about\nsubgroups whose Lie algebra is isomorphic to $\\mathfrak{sl}_2$ and we describe\nother rank 1 subgroups which are the semisimple parts of Levi-subgroups. We\nprove a semialgebraic version of Kostant's convexity.\n  Over the reals, semisimple Lie groups are closely related to the symmetry\ngroups of symmetric spaces of non-compact type. These symmetric spaces can be\ndescribed semialgebraically, which allows us to consider their semialgebraic\nextension over any real closed field. Starting from these non-standard\nsymmetric spaces we use a valuation (with image some non-discrete ordered\nabelian group $\\Lambda$) on the fields to define a $\\Lambda$-pseudometric.\nIdentifying points of distance zero results in a $\\Lambda$-metric space\n$\\mathcal{B}$. Assuming that the root system of the associated Lie group is\nreduced, we prove that $\\mathcal{B}$ is an affine $\\Lambda$-building. The proof\nrelies on a thorough analysis of stabilizers.\n","subjects":["Mathematics/Group Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"l00FY4iL_xiqX6hQnbwooBqqxZKjasirDg3NR1Z97gw","pdfSize":"1776954","objectId":"0xe97f62ba0d88677e70747214ebc052c90a4fe72ab6516a12dcec5609fe02c4a2","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
