{"id":"2407.13846","title":"Existence and Uniqueness of Permutation-Invariant Optimizers for Parisi\n  Formula","authors":"Victor Issa","authorsParsed":[["Issa","Victor",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 18:29:43 GMT"}],"updateDate":"2024-07-22","timestamp":1721327383000,"abstract":"  It has recently been shown in [arXiv:2310.06745] that, upon constraining the\nsystem to stay in a balanced state, the Parisi formula for the mean-field Potts\nmodel can be written as an optimization problem over permutation-invariant\nfunctional order parameters.\n  In this paper, we focus on permutation-invariant mean-field spin glass\nmodels. After introducing a correction term in the definition of the free\nenergy and without constraining the system, we show that the limit free energy\ncan be written as an optimization problem over permutation-invariant functional\norder parameters. We also show that for some models this optimization problem\nadmits a unique optimizer. In the case of Ising spins, the correction term can\nbe easily removed, and those results transfer to the uncorrected limit free\nenergy.\n  We also derive an upper bound for the limit free energy of some nonconvex\npermutation-invariant models. This upper bound is expressed as a variational\nformula and is related to the solution of some Hamilton-Jacobi equation. We\nshow that if no first order phase transition occurs, then this upper bound is\nequal to the lower bound derived in [arXiv:2010.09114]. We expect that this\nhypothesis holds at least in the high temperature regime.\n  Our method relies on the fact that the free energy of any convex mean-field\nspin glass model can be interpreted as the strong solution of some\nHamilton-Jacobi equation.\n","subjects":["Mathematics/Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NC16m8l8IqNJ3Rz0L36QLHt1zNDu4orJkZ3aAC2Pze8","pdfSize":"803760","objectId":"0x0b6b428028ab0475e1c68573d315fd1dac64028ebc40863798ac4f6593c8eda8","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
