{"id":"2407.01474","title":"Survey and Analysis of IoT Operating Systems: A Comparative Study on the\n  Effectiveness and Acquisition Time of Open Source Digital Forensics Tools","authors":"Jeffrey Fairbanks, Md Mashrur Arifin, Sadia Afreen and Alex Curtis","authorsParsed":[["Fairbanks","Jeffrey",""],["Arifin","Md Mashrur",""],["Afreen","Sadia",""],["Curtis","Alex",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 17:06:32 GMT"}],"updateDate":"2024-07-02","timestamp":1719853592000,"abstract":"  The main goal of this research project is to evaluate the effectiveness and\nspeed of open-source forensic tools for digital evidence collecting from\nvarious Internet-of-Things (IoT) devices. The project will create and configure\nmany IoT environments, across popular IoT operating systems, and run common\nforensics tasks in order to accomplish this goal. To validate these forensic\nanalysis operations, a variety of open-source forensic tools covering four\nstandard digital forensics tasks. These tasks will be utilized across each\nsample IoT operating system and will have its time spent on record carefully\ntracked down and examined, allowing for a thorough evaluation of the\neffectiveness and speed for performing forensics on each type of IoT device.\nThe research also aims to offer recommendations to IoT security experts and\ndigital forensic practitioners about the most efficient open-source tools for\nforensic investigations with IoT devices while maintaining the integrity of\ngathered evidence and identifying challenges that exist with these new device\ntypes. The results will be shared widely and well-documented in order to\nprovide significant contributions to the field of internet-of-things device\nmakers and digital forensics.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"mKohKGZLBTMBx9DnAIWkMyynW5AVTUq3DJD_vXS6X8s","pdfSize":"1047657","objectId":"0x49521c94d79c2d0c66bbe08f272b5633a8bdee29c271c395716950dead7113c1","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
