{"id":"2407.13435","title":"Enhancing Out-of-Vocabulary Performance of Indian TTS Systems for\n  Practical Applications through Low-Effort Data Strategies","authors":"Srija Anand, Praveen Srinivasa Varadhan, Ashwin Sankar, Giri Raju,\n  Mitesh M. Khapra","authorsParsed":[["Anand","Srija",""],["Varadhan","Praveen Srinivasa",""],["Sankar","Ashwin",""],["Raju","Giri",""],["Khapra","Mitesh M.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 12:03:14 GMT"}],"updateDate":"2024-07-19","timestamp":1721304194000,"abstract":"  Publicly available TTS datasets for low-resource languages like Hindi and\nTamil typically contain 10-20 hours of data, leading to poor vocabulary\ncoverage. This limitation becomes evident in downstream applications where\ndomain-specific vocabulary coupled with frequent code-mixing with English,\nresults in many OOV words. To highlight this problem, we create a benchmark\ncontaining OOV words from several real-world applications. Indeed,\nstate-of-the-art Hindi and Tamil TTS systems perform poorly on this OOV\nbenchmark, as indicated by intelligibility tests. To improve the model's OOV\nperformance, we propose a low-effort and economically viable strategy to obtain\nmore training data. Specifically, we propose using volunteers as opposed to\nhigh quality voice artists to record words containing character bigrams unseen\nin the training data. We show that using such inexpensive data, the model's\nperformance improves on OOV words, while not affecting voice quality and\nin-domain performance.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_so4r5SYBbr99C7DoSOAkIDonIoJX4irXmwbY85Kwmo","pdfSize":"513550","objectId":"0xe672ad2942d371902fe5a8b31a7ecb730633c7c6263048ac6e1cd08db4b7d710","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
