{"id":"2407.17419","title":"Effect of hydrogen on albedo neutrons in lunar surface: A computational\n  investigation by means of GEANT4 simulations","authors":"Ahmet Ilker Topuz","authorsParsed":[["Topuz","Ahmet Ilker",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 07:24:36 GMT"}],"updateDate":"2024-07-25","timestamp":1720509876000,"abstract":"  Motivated by the interaction of the cosmic ray protons with the lunar surface\nin the absence and presence of hydrogen, a series of GEANT4 simulations are\nemployed in the current study to unveil the influence of hydrogen on the energy\nspectrum of the albedo neutrons that escape from the lunar surface. Initially,\na discrete 69-bin proton energy spectrum between 0.4 and 115 GeV based on the\nPAMELA spectrometer is implemented into GEANT4. Subsequently, a single-volume\nlunar surface of 2-m thickness is constructed where it is assumed that a single\nlayer of either 1.6 or 1.93 g/cm$^{3}$ constitutes the lunar regolith. The\nmaterial composition in the present study includes 43.7 wt.$\\%$ oxygen, 0.3\nwt.$\\%$ sodium, 5.6 wt.$\\%$ magnesium, 9 wt.$\\%$ aluminum, 21.1 wt.$\\%$\nsilicon, 8.5 wt.$\\%$ calcium, 1.5 wt.$\\%$ titanium, 0.1 wt.$\\%$ manganese, and\n10.2 wt.$\\%$ iron in accordance with another study. Then, 0.1 wt.$\\%$ hydrogen\nis introduced by replacing oxygen in order to assess the impact of hydrogen on\nthe secondary neutrons. In the wake of irradiating a lunar surface of\n3$\\times$2$\\times$3 m$^{3}$ with a planar vertical PAMELA proton beam of\n20$\\times$20 cm$^{2}$, the depth profile of the generated neutrons as well as\nthe corresponding initial energy spectrum is primarily obtained in the absence\nand presence of 0.1 wt.$\\%$ hydrogen by voxelizing the entire geometry with 100\ncells of 2-cm thickness. Next, a surface detector is placed at the top of the\nlunar surface in order to collect the albedo neutrons in both cases, and the\nenergy spectra of the albedo neutrons are acquired in terms of thermal,\nepithermal, and fast neutrons. From the GEANT4 simulations in this study, it is\nshown that the presence of 0.1 wt.$\\%$ hydrogen is observable in each energy\nregime of the albedo neutrons at the lunar surface, thereby providing an\nindication about the elemental variation of the lunar soil.\n","subjects":["Physics/Instrumentation and Detectors","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WVZWD5gAB3m_VHs5oO_VJTcETLAiO1u5Fdu0E8FhEeo","pdfSize":"1066989","objectId":"0x7ea176a9d7d40b6fb18d918d7182adfecefcddea74c615db1578612297567c80","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
