{"id":"2407.11352","title":"Epsilon Sagittarii: An Extreme Rapid Rotator with a Decretion Disk","authors":"Jeremy Bailey, Fiona Lewis, Ian D. Howarth, Daniel V. Cotton, Jonathan\n  P. Marshall, Lucyna Kedziora-Chudczer","authorsParsed":[["Bailey","Jeremy",""],["Lewis","Fiona",""],["Howarth","Ian D.",""],["Cotton","Daniel V.",""],["Marshall","Jonathan P.",""],["Kedziora-Chudczer","Lucyna",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 03:37:49 GMT"}],"updateDate":"2024-07-17","timestamp":1721101069000,"abstract":"  We report high-precision multi-wavelength linear-polarization observations of\nthe bright B9 (or A0) star $\\epsilon$ Sagittarii. The polarization shows the\ndistinctive wavelength dependence expected for a rapidly rotating star.\nAnalysis of the polarization data reveals an angular rotation rate $\\omega$ (=\n$\\Omega/\\Omega_{crit})$ of 0.995 or greater, the highest yet measured for a\nstar in our galaxy. An additional wavelength-independent polarization component\nis attributed to electron scattering in a low-density edge-on gas disk that\nalso produces the narrow absorption components seen in the spectrum. Several\nproperties of the star (polarization due to a disk, occasional weak H$\\alpha$\nemission, and multiple periodicities seen in space photometry) resemble those\nof Be stars, but the level of activity in all cases is much lower than that of\ntypical Be stars. The stellar properties are inconsistent with single\nrotating-star evolutionary tracks, indicating that it is most likely a product\nof binary interaction. The star is an excellent candidate for observation by\ninterferometry, optical spectropolarimetry to detect the \\\"{O}hman effect, and\nUV polarimetry; any of which would allow its extreme rotation to be tested and\nits stellar properties to be refined.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MD4qa4bYNQoC8Nw7uGMufzuzZAPEYlwDdVEHDEfUjvU","pdfSize":"2293376","objectId":"0xec66c01600e10719f44b6ff15fd3d8d0eef347b02cc0db7aa3796ba58598eed8","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
