{"id":"2407.13609","title":"Training-free Composite Scene Generation for Layout-to-Image Synthesis","authors":"Jiaqi Liu, Tao Huang, Chang Xu","authorsParsed":[["Liu","Jiaqi",""],["Huang","Tao",""],["Xu","Chang",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 15:48:07 GMT"}],"updateDate":"2024-07-19","timestamp":1721317687000,"abstract":"  Recent breakthroughs in text-to-image diffusion models have significantly\nadvanced the generation of high-fidelity, photo-realistic images from textual\ndescriptions. Yet, these models often struggle with interpreting spatial\narrangements from text, hindering their ability to produce images with precise\nspatial configurations. To bridge this gap, layout-to-image generation has\nemerged as a promising direction. However, training-based approaches are\nlimited by the need for extensively annotated datasets, leading to high data\nacquisition costs and a constrained conceptual scope. Conversely, training-free\nmethods face challenges in accurately locating and generating semantically\nsimilar objects within complex compositions. This paper introduces a novel\ntraining-free approach designed to overcome adversarial semantic intersections\nduring the diffusion conditioning phase. By refining intra-token loss with\nselective sampling and enhancing the diffusion process with attention\nredistribution, we propose two innovative constraints: 1) an inter-token\nconstraint that resolves token conflicts to ensure accurate concept synthesis;\nand 2) a self-attention constraint that improves pixel-to-pixel relationships.\nOur evaluations confirm the effectiveness of leveraging layout information for\nguiding the diffusion process, generating content-rich images with enhanced\nfidelity and complexity. Code is available at\nhttps://github.com/Papple-F/csg.git.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VIfqZun9b9otFtj0alZk4a5haX597aa4z9e-gTy8iPg","pdfSize":"19032695","objectId":"0xc0f842ae17ef3f3548da30fccb02b688a69cfa6e56972c524da21c409b5a0cc4","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
