{"id":"2407.02813","title":"Data Overfitting for On-Device Super-Resolution with Dynamic Algorithm\n  and Compiler Co-Design","authors":"Gen Li, Zhihao Shu, Jie Ji, Minghai Qin, Fatemeh Afghah, Wei Niu,\n  Xiaolong Ma","authorsParsed":[["Li","Gen",""],["Shu","Zhihao",""],["Ji","Jie",""],["Qin","Minghai",""],["Afghah","Fatemeh",""],["Niu","Wei",""],["Ma","Xiaolong",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 05:17:26 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 03:39:05 GMT"}],"updateDate":"2024-07-15","timestamp":1719983846000,"abstract":"  Deep neural networks (DNNs) are frequently employed in a variety of computer\nvision applications. Nowadays, an emerging trend in the current video\ndistribution system is to take advantage of DNN's overfitting properties to\nperform video resolution upscaling. By splitting videos into chunks and\napplying a super-resolution (SR) model to overfit each chunk, this scheme of SR\nmodels plus video chunks is able to replace traditional video transmission to\nenhance video quality and transmission efficiency. However, many models and\nchunks are needed to guarantee high performance, which leads to tremendous\noverhead on model switching and memory footprints at the user end. To resolve\nsuch problems, we propose a Dynamic Deep neural network assisted by a\nContent-Aware data processing pipeline to reduce the model number down to one\n(Dy-DCA), which helps promote performance while conserving computational\nresources. Additionally, to achieve real acceleration on the user end, we\ndesigned a framework that optimizes dynamic features (e.g., dynamic shapes,\nsizes, and control flow) in Dy-DCA to enable a series of compilation\noptimizations, including fused code generation, static execution planning, etc.\nBy employing such techniques, our method achieves better PSNR and real-time\nperformance (33 FPS) on an off-the-shelf mobile phone. Meanwhile, assisted by\nour compilation optimization, we achieve a 1.7$\\times$ speedup while saving up\nto 1.61$\\times$ memory consumption. Code available in\nhttps://github.com/coulsonlee/Dy-DCA-ECCV2024.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zFsMHGV0njPX7Kjv-ajeiuyqIA61Enr8VnWQQ-Yc4f0","pdfSize":"16360811","objectId":"0x2df26b522cb4cccb03a09e488bca2529f4f8f2e8492254629d5bdb833212f77d","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
