{"id":"2407.00150","title":"The restless population of bright X-ray sources of NCG 3621","authors":"A. Sacchi, M. Imbrogno, S. E. Motta, P. Esposito, G. L. Israel, N. O.\n  Pinciroli Vago, A. De Luca, M. Marelli, F. Pintore, G. A. Rodr\\'iguez\n  Castillo, R. Salvaterra, A. Tiengo","authorsParsed":[["Sacchi","A.",""],["Imbrogno","M.",""],["Motta","S. E.",""],["Esposito","P.",""],["Israel","G. L.",""],["Vago","N. O. Pinciroli",""],["De Luca","A.",""],["Marelli","M.",""],["Pintore","F.",""],["Castillo","G. A. Rodríguez",""],["Salvaterra","R.",""],["Tiengo","A.",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 18:00:00 GMT"}],"updateDate":"2024-09-18","timestamp":1719597600000,"abstract":"  We report on the multi-year evolution of the population of X-ray sources in\nthe nuclear region of NGC 3621 based on Chandra, XMM-Newton and Swift\nobservations. Among these, two sources, X1 and X5, after their first detection\nin 2008, seem to have faded below the detectability threshold, a most\ninteresting fact as X1 is associated with the AGN of the galaxy. Two other\nsources, X3 and X6 are presented for the first time, the former showing a\npeculiar short-term variability in the latest available dataset, suggesting an\negress from eclipse, hence belonging to the handful of known eclipsing\nultra-luminous X-ray sources. One source, X4, previously known for its\n\"heart-beat\", i.e. a characteristic modulation in its signal with a period of\n$\\approx1$ h, shows a steady behaviour in the latest observation. Finally, the\nbrightest X-ray source in NGC 3621, here labelled X2, shows steady levels of\nflux across all the available datasets but a change in its spectral shape,\nreminiscent of the behaviours of Galactic disk-fed X-ray binaries.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sN7jmjR-l8lC0sPsoON2G_95iKgq7T4e65a_GKE-MLk","pdfSize":"5546751","objectId":"0x9547d1ba72c42002f167356e9babd937d9cc2585a107f9c242a3e90ffbe2fa76","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
