{"id":"2407.18645","title":"Contrastive Learning of Asset Embeddings from Financial Time Series","authors":"Rian Dolphin, Barry Smyth, Ruihai Dong","authorsParsed":[["Dolphin","Rian",""],["Smyth","Barry",""],["Dong","Ruihai",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 10:26:44 GMT"}],"updateDate":"2024-07-29","timestamp":1721989604000,"abstract":"  Representation learning has emerged as a powerful paradigm for extracting\nvaluable latent features from complex, high-dimensional data. In financial\ndomains, learning informative representations for assets can be used for tasks\nlike sector classification, and risk management. However, the complex and\nstochastic nature of financial markets poses unique challenges. We propose a\nnovel contrastive learning framework to generate asset embeddings from\nfinancial time series data. Our approach leverages the similarity of asset\nreturns over many subwindows to generate informative positive and negative\nsamples, using a statistical sampling strategy based on hypothesis testing to\naddress the noisy nature of financial data. We explore various contrastive loss\nfunctions that capture the relationships between assets in different ways to\nlearn a discriminative representation space. Experiments on real-world datasets\ndemonstrate the effectiveness of the learned asset embeddings on benchmark\nindustry classification and portfolio optimization tasks. In each case our\nnovel approaches significantly outperform existing baselines highlighting the\npotential for contrastive learning to capture meaningful and actionable\nrelationships in financial data.\n","subjects":["Computing Research Repository/Machine Learning","Quantitative Finance/Statistical Finance"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7gAaa4HQpU6V26f84dmmDgIdkQlMEBVtwVKAH5yu-2M","pdfSize":"988822","objectId":"0xde76399bd40ca3930b05d68fb41d7f160c2e2cb61bff8bb51e4a33604bcfacc0","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
