{"id":"2407.16874","title":"Vision-Based Adaptive Robotics for Autonomous Surface Crack Repair","authors":"Joshua Genova, Eric Cabrera, Vedhus Hoskere","authorsParsed":[["Genova","Joshua",""],["Cabrera","Eric",""],["Hoskere","Vedhus",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 22:46:21 GMT"}],"updateDate":"2024-07-25","timestamp":1721774781000,"abstract":"  Surface cracks in infrastructure can lead to significant deterioration and\ncostly maintenance if not efficiently repaired. Manual repair methods are\nlabor-intensive, time-consuming, and imprecise and thus difficult to scale to\nlarge areas. Breakthroughs in robotic perception and manipulation have advanced\nautonomous crack repair, but proposed methods lack end-to-end testing and\nadaptability to changing crack size. This paper presents an adaptive,\nautonomous system for surface crack detection and repair using robotics with\nadvanced sensing technologies. The system uses an RGB-D camera for crack\ndetection, a laser scanner for precise measurement, and an extruder and pump\nfor material deposition. A novel validation procedure with 3D-printed crack\nspecimens simulates real-world cracks and ensures testing repeatability. Our\nstudy shows that an adaptive system for crack filling is more efficient and\neffective than a fixed-speed approach, with experimental results confirming\nprecision and consistency. This research paves the way for versatile, reliable\nrobotic infrastructure maintenance.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Cg-kbxtQS2_s21m6Ga4AI1_xLliUZgNbYb5e0pafLGE","pdfSize":"1582402","objectId":"0x689b4d47703aa6ddc8a379d2628c81f5485f73b71cd217a8ff1e50fa6167427f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
