{"id":"2407.04465","title":"Learning Patterns from Biological Networks: A Compounded Burr\n  Probability Model","authors":"Tanujit Chakraborty, Shraddha M. Naik, Swarup Chattopadhyay,\n  Suchismita Das","authorsParsed":[["Chakraborty","Tanujit",""],["Naik","Shraddha M.",""],["Chattopadhyay","Swarup",""],["Das","Suchismita",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 12:26:21 GMT"}],"updateDate":"2024-07-08","timestamp":1720182381000,"abstract":"  Complex biological networks, comprising metabolic reactions, gene\ninteractions, and protein interactions, often exhibit scale-free\ncharacteristics with power-law degree distributions. However, empirical studies\nhave revealed discrepancies between observed biological network data and ideal\npower-law fits, highlighting the need for improved modeling approaches. To\naddress this challenge, we propose a novel family of distributions, building\nupon the baseline Burr distribution. Specifically, we introduce the compounded\nBurr (CBurr) distribution, derived from a continuous probability distribution\nfamily, enabling flexible and efficient modeling of node degree distributions\nin biological networks. This study comprehensively investigates the general\nproperties of the CBurr distribution, focusing on parameter estimation using\nthe maximum likelihood method. Subsequently, we apply the CBurr distribution\nmodel to large-scale biological network data, aiming to evaluate its efficacy\nin fitting the entire range of node degree distributions, surpassing\nconventional power-law distributions and other benchmarks. Through extensive\ndata analysis and graphical illustrations, we demonstrate that the CBurr\ndistribution exhibits superior modeling capabilities compared to traditional\npower-law distributions. This novel distribution model holds great promise for\naccurately capturing the complex nature of biological networks and advancing\nour understanding of their underlying mechanisms.\n","subjects":["Statistics/Applications","Computing Research Repository/Social and Information Networks","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"Nj9Ug7tf9_P3eCHCmkruqLgyrOYtjHqmttrp5nzECEM","pdfSize":"1944731"}
