{"id":"2407.13442","title":"BEAF: Observing BEfore-AFter Changes to Evaluate Hallucination in\n  Vision-language Models","authors":"Moon Ye-Bin, Nam Hyeon-Woo, Wonseok Choi, Tae-Hyun Oh","authorsParsed":[["Ye-Bin","Moon",""],["Hyeon-Woo","Nam",""],["Choi","Wonseok",""],["Oh","Tae-Hyun",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 12:11:12 GMT"}],"updateDate":"2024-07-19","timestamp":1721304672000,"abstract":"  Vision language models (VLMs) perceive the world through a combination of a\nvisual encoder and a large language model (LLM). The visual encoder,\npre-trained on large-scale vision-text datasets, provides zero-shot\ngeneralization to visual data, and the LLM endows its high reasoning ability to\nVLMs. It leads VLMs to achieve high performance on wide benchmarks without\nfine-tuning, exhibiting zero or few-shot capability. However, recent studies\nshow that VLMs are vulnerable to hallucination. This undesirable behavior\ndegrades reliability and credibility, thereby making users unable to fully\ntrust the output from VLMs. To enhance trustworthiness and better tackle the\nhallucination of VLMs, we curate a new evaluation dataset, called the\nBEfore-AFter hallucination dataset (BEAF), and introduce new metrics: True\nUnderstanding (TU), IGnorance (IG), StuBbornness (SB), and InDecision (ID).\nUnlike prior works that focus only on constructing questions and answers, the\nkey idea of our benchmark is to manipulate visual scene information by image\nediting models and to design the metrics based on scene changes. This allows us\nto clearly assess whether VLMs correctly understand a given scene by observing\nthe ability to perceive changes. We also visualize image-wise object\nrelationship by virtue of our two-axis view: vision and text. Upon evaluating\nVLMs with our dataset, we observed that our metrics reveal different aspects of\nVLM hallucination that have not been reported before. Project page:\n\\url{https://beafbench.github.io/}\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Zad8eB3C-aDn0_oDiYzW96Mzo6b0AIhN_2JE-ExcUoA","pdfSize":"3835476","objectId":"0xcf03f816a2ee0caa8d7d7eee5fb38de7e01a1b35ce63258780c10541769afcfb","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
