{"id":"2407.12417","title":"Improving the classification of extreme classes by means of loss\n  regularisation and generalised beta distributions","authors":"V\\'ictor Manuel Vargas, Pedro Antonio Guti\\'errez, Javier\n  Barbero-G\\'omez, C\\'esar Herv\\'as-Mart\\'inez","authorsParsed":[["Vargas","Víctor Manuel",""],["Gutiérrez","Pedro Antonio",""],["Barbero-Gómez","Javier",""],["Hervás-Martínez","César",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 08:57:42 GMT"}],"updateDate":"2024-07-18","timestamp":1721206662000,"abstract":"  An ordinal classification problem is one in which the target variable takes\nvalues on an ordinal scale. Nowadays, there are many of these problems\nassociated with real-world tasks where it is crucial to accurately classify the\nextreme classes of the ordinal structure. In this work, we propose a unimodal\nregularisation approach that can be applied to any loss function to improve the\nclassification performance of the first and last classes while maintaining good\nperformance for the remainder. The proposed methodology is tested on six\ndatasets with different numbers of classes, and compared with other unimodal\nregularisation methods in the literature. In addition, performance in the\nextreme classes is compared using a new metric that takes into account their\nsensitivities. Experimental results and statistical analysis show that the\nproposed methodology obtains a superior average performance considering\ndifferent metrics. The results for the proposed metric show that the\ngeneralised beta distribution generally improves classification performance in\nthe extreme classes. At the same time, the other five nominal and ordinal\nmetrics considered show that the overall performance is aligned with the\nperformance of previous alternatives.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"yz_L1KRKMDAzUK8XeTDZtdunQVwYwud8l96GUyXzzqw","pdfSize":"1955972","objectId":"0xa207440bb91e1856b9d9c366f39ae610c739615fc7490891349bbc991262f184","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
