{"id":"2407.08731","title":"Massive-ish Particles from Small-ish Scales: Non-Perturbative Techniques\n  for Cosmological Collider Physics from Large-Scale Structure Surveys","authors":"Samuel Goldstein, Oliver H. E. Philcox, J. Colin Hill, Lam Hui","authorsParsed":[["Goldstein","Samuel",""],["Philcox","Oliver H. E.",""],["Hill","J. Colin",""],["Hui","Lam",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:58:15 GMT"}],"updateDate":"2024-07-12","timestamp":1720720695000,"abstract":"  Massive particles produced during inflation impact soft limits of primordial\ncorrelators. Searching for these signatures presents an exciting opportunity to\nuncover the particle spectrum in the inflationary epoch. We present\nnon-perturbative methods to constrain intermediate-mass scalars ($0\\leq\nm/H<3/2$, where $H$ is the inflationary Hubble scale) produced during\ninflation, which give rise to a power-law scaling in the squeezed primordial\nbispectrum. Exploiting the large-scale structure consistency relations and the\nseparate universe approach, we derive models for the late-time squeezed matter\nbispectrum and collapsed matter trispectrum sourced by these fields. To\nvalidate our models, we run $N$-body simulations with the \"Cosmological\nCollider\" squeezed bispectrum for two different particle masses. Our models\nyield unbiased constraints on the amplitude of non-Gaussianity, $f_{\\rm\nNL}^{\\Delta}$, from the squeezed bispectrum and collapsed trispectrum deep into\nthe non-linear regime ($k_{\\rm max}\\approx 2~h/{\\rm Mpc}$ at $z=0$). We assess\nthe information content of these summary statistics, emphasizing the importance\nof sample variance cancellation in the matter sector. We also study the\nscale-dependent halo bias in our simulations. For mass-selected halos, the\nnon-Gaussian bias estimated from our simulations agrees with predictions based\non (i) separate universe simulations and (ii) universal mass functions. With\nfurther work, these results can be used to search for inflationary massive\nparticle production with upcoming galaxy surveys.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"1O9XiqCIwDB3aUeQMFxOQZXf9rluD4Ll9FbUVGvOy58","pdfSize":"2246885","objectId":"0xd09303c96fef8491316473ae1cf35e0b317a53c7514e4432c9da25c98e57a619","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
