{"id":"2407.20912","title":"What Are Good Positional Encodings for Directed Graphs?","authors":"Yinan Huang, Haoyu Wang, Pan Li","authorsParsed":[["Huang","Yinan",""],["Wang","Haoyu",""],["Li","Pan",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 15:38:14 GMT"}],"updateDate":"2024-07-31","timestamp":1722353894000,"abstract":"  Positional encodings (PE) for graphs are essential in constructing powerful\nand expressive graph neural networks and graph transformers as they effectively\ncapture relative spatial relations between nodes. While PEs for undirected\ngraphs have been extensively studied, those for directed graphs remain largely\nunexplored, despite the fundamental role of directed graphs in representing\nentities with strong logical dependencies, such as those in program analysis\nand circuit designs. This work studies the design of PEs for directed graphs\nthat are expressive to represent desired directed spatial relations. We first\npropose walk profile, a generalization of walk counting sequence to directed\ngraphs. We identify limitations in existing PE methods, including symmetrized\nLaplacian PE, Singular Value Decomposition PE, and Magnetic Laplacian PE, in\ntheir ability to express walk profiles. To address these limitations, we\npropose the Multi-q Magnetic Laplacian PE, which extends Magnetic Laplacian PE\nwith multiple potential factors. This simple variant turns out to be capable of\nprovably expressing walk profiles. Furthermore, we generalize previous\nbasis-invariant and stable networks to handle complex-domain PEs decomposed\nfrom Magnetic Laplacians. Our numerical experiments demonstrate the\neffectiveness of Multi-q Magnetic Laplacian PE with a stable neural\narchitecture, outperforming previous PE methods (with stable networks) on\npredicting directed distances/walk profiles, sorting network satisfiability,\nand on general circuit benchmarks. Our code is available at\nhttps://github.com/Graph-COM/Multi-q-Maglap.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SsHUvkNWGHTa5Nn1VpCWN4P2587Q4-c0X2uPqXM-1Oo","pdfSize":"704418","objectId":"0xe67678231626f9cc714342e6bbebc07016ecbdedd61f13160e205488a0bf1a43","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
