{"id":"2407.16897","title":"HexTiles and Semantic Icons for MAUP-Aware Multivariate Geospatial\n  Visualizations","authors":"Yuya Kawakami, Sarah Yuniar, Kwan-Liu Ma","authorsParsed":[["Kawakami","Yuya",""],["Yuniar","Sarah",""],["Ma","Kwan-Liu",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 04:55:03 GMT"}],"updateDate":"2024-07-25","timestamp":1720587303000,"abstract":"  We introduce HexTiles, a domain-agnostic hexagonal-tiling based visual\nencoding design for multivariate geospatial data. Multivariate geospatial data\nhave presented a challenge due to the graph schema associated with geospatial\nmaps, on which most geospatial data is presented. With HexTiles, we design a\nmultivariate geospatial visualization design that leverages semantic icons to\n(1) simplify the process of interpreting interactions between multivariate\ngeospatial data, and (2) put the visualization designer in the driver's seat to\nguide user attention to specific variables and interactions. Additionally with\nHexTiles, we attempt to explicitly mitigate effects of the Modifiable Areal\nUnit Problem (MAUP) for interpreting geospatial data, by proposing a confidence\nencoding for each of the information channels in HexTiles. We calculate\nweighted variances of the variables in each HexTile to provide a confidence\nvalue for each tile, which can be used to interpret the variability of the data\nwithin the corresponding geospatial area, an information that can be lost in\ngeospatial visualizations. To validate our approach, we gather quantitative and\nqualitative feedback from a user study and document domain expert feedback from\necologists and hydrologists experienced in designing geospatial visualizations.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VfX_KKURhqW2O2KnBnuMjFjMBEocc5DM_DRWAuFR4GU","pdfSize":"21652699","objectId":"0xd7c362c889a1e16dd934a698518933123bfa6dcceda211bb75d41a430d874ed2","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
