{"id":"2407.03255","title":"How Similar Are Elected Politicians and Their Constituents? Quantitative\n  Evidence From Online Social Networks","authors":"Waleed Iqbal, Gareth Tyson, Ignacio Castro","authorsParsed":[["Iqbal","Waleed",""],["Tyson","Gareth",""],["Castro","Ignacio",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 16:36:26 GMT"},{"version":"v2","created":"Fri, 5 Jul 2024 15:45:19 GMT"}],"updateDate":"2024-07-08","timestamp":1720024586000,"abstract":"  How similar are politicians to those who vote for them? This is a critical\nquestion at the heart of democratic representation and particularly relevant at\ntimes when political dissatisfaction and populism are on the rise. To answer\nthis question we compare the online discourse of elected politicians and their\nconstituents. We collect a two and a half years (September 2020 - February\n2023) constituency-level dataset for USA and UK that includes: (i) the Twitter\ntimelines (5.6 Million tweets) of elected political representatives (595 UK\nMembers of Parliament and 433 USA Representatives), (ii) the Nextdoor posts\n(21.8 Million posts) of the constituency (98.4% USA and 91.5% UK\nconstituencies). We find that elected politicians tend to be equally similar to\ntheir constituents in terms of content and style regardless of whether a\nconstituency elects a right or left-wing politician. The size of the electoral\nvictory and the level of income of a constituency shows a nuanced picture. The\nnarrower the electoral victory, the more similar the style and the more\ndissimilar the content is. The lower the income of a constituency, the more\nsimilar the content is. In terms of style, poorer constituencies tend to have a\nmore similar sentiment and more dissimilar psychological text traits (i.e.\nmeasured with LIWC categories).\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eE1Sz4Lem-1jWY2eN5Cah2FJgYLy9dhjVtEKfl3nQnI","pdfSize":"2417869"}
