{"id":"2407.20978","title":"Are gene-by-environment interactions leveraged in multi-modality neural\n  networks for breast cancer prediction?","authors":"Monica Isgut, Andrew Hornback, Yunan Luo, Asma Khimani, Neha Jain, May\n  D. Wang","authorsParsed":[["Isgut","Monica",""],["Hornback","Andrew",""],["Luo","Yunan",""],["Khimani","Asma",""],["Jain","Neha",""],["Wang","May D.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 17:15:20 GMT"}],"updateDate":"2024-07-31","timestamp":1722359720000,"abstract":"  Polygenic risk scores (PRSs) can significantly enhance breast cancer risk\nprediction when combined with clinical risk factor data. While many studies\nhave explored the value-add of PRSs, little is known about the potential impact\nof gene-by-gene or gene-by-environment interactions towards enhancing the risk\ndiscrimination capabilities of multi-modal models combining PRSs with clinical\ndata. In this study, we integrated data on 318 individual genotype variants\nalong with clinical data in a neural network to explore whether gene-by-gene\n(i.e., between individual variants) and/or gene-by-environment (between\nclinical risk factors and variants) interactions could be leveraged jointly\nduring training to improve breast cancer risk prediction performance. We\nbenchmarked our approach against a baseline model combining traditional\nunivariate PRSs with clinical data in a logistic regression model and ran an\ninterpretability analysis to identify feature interactions.\n  While our model did not demonstrate improved performance over the baseline,\nwe discovered 248 (<1%) statistically significant gene-by-gene and\ngene-by-environment interactions out of the ~53.6k possible feature pairs, the\nmost contributory of which included rs6001930 (MKL1) and rs889312 (MAP3K1),\nwith age and menopause being the most heavily interacting non-genetic risk\nfactors. We also modeled the significant interactions as a network of highly\nconnected features, suggesting that potential higher-order interactions are\ncaptured by the model. Although gene-by-environment (or gene-by-gene)\ninteractions did not enhance breast cancer risk prediction performance in\nneural networks, our study provides evidence that these interactions can be\nleveraged by these models to inform their predictions. This study represents\nthe first application of neural networks to screen for interactions impacting\nbreast cancer risk using real-world data.\n","subjects":["Quantitative Biology/Genomics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YY4OB-OBbQHxWUK4nvPleeaQAAIWKWeSCr40us5sFf8","pdfSize":"2770027","objectId":"0x9507e8cd988dd74893b9de1ebc54e22fe7419ece1d6f877fc0bd447b14c2b929","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
