{"id":"2407.01763","title":"A Cepstral Model for Efficient Spectral Analysis of Covariate-dependent\n  Time Series","authors":"Zeda Li and Yuexiao Dong","authorsParsed":[["Li","Zeda",""],["Dong","Yuexiao",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 19:52:48 GMT"}],"updateDate":"2024-07-03","timestamp":1719863568000,"abstract":"  This article introduces a novel and computationally fast model to study the\nassociation between covariates and power spectra of replicated time series. A\nrandom covariate-dependent Cram\\'{e}r spectral representation and a\nsemiparametric log-spectral model are used to quantify the association between\nthe log-spectra and covariates. Each replicate-specific log-spectrum is\nrepresented by the cepstrum, inducing a cepstral-based multivariate linear\nmodel with the cepstral coefficients as the responses. By using only a small\nnumber of cepstral coefficients, the model parsimoniously captures frequency\npatterns of time series and saves a significant amount of computational time\ncompared to existing methods. A two-stage estimation procedure is proposed. In\nthe first stage, a Whittle likelihood-based approach is used to estimate the\ntruncated replicate-specific cepstral coefficients. In the second stage,\nparameters of the cepstral-based multivariate linear model, and consequently\nthe effect functions of covariates, are estimated. The model is flexible in the\nsense that it can accommodate various estimation methods for the multivariate\nlinear model, depending on the application, domain knowledge, or\ncharacteristics of the covariates. Numerical studies confirm that the proposed\nmethod outperforms some existing methods despite its simplicity and shorter\ncomputational time. Supplementary materials for this article are available\nonline.\n","subjects":["Statistics/Methodology","Statistics/Computation"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"k91mIiIoMBXmagElpvJ0f2tQkLZQ90ZTPQjIYjDaZ-4","pdfSize":"533125","objectId":"0xe5397530fe8a7b471309e93e3df33ef1359cf11cd7cae63e8e421ec137419ade","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
