{"id":"2407.05794","title":"High-resolution imaging of the evolving bipolar outflows in symbiotic\n  novae: the case of RSOphiuchi 2021 nova outburst","authors":"R. Lico, M. Giroletti, U. Munari, T.J. O'Brien, B. Marcote, D.R.A.\n  Williams, J. Yang, P. Veres, P. Woudt","authorsParsed":[["Lico","R.",""],["Giroletti","M.",""],["Munari","U.",""],["O'Brien","T. J.",""],["Marcote","B.",""],["Williams","D. R. A.",""],["Yang","J.",""],["Veres","P.",""],["Woudt","P.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 09:55:35 GMT"}],"updateDate":"2024-07-09","timestamp":1720432535000,"abstract":"  The recurrent and symbiotic nova RS Ophiuchi (RSOph) underwent a new outburst\nphase during August 2021, about 15 years after the last event occurred in 2006.\nThis represents the first nova event ever detected at very-high energies (VHE,\nE>100\\,GeV), and a whole set of coordinated multi-wavelength observations were\ntriggered. The main goals of this work are to characterize the evolving\nmorphology of the expanding bipolar ejecta with high accuracy and determine the\nphysical conditions of the surrounding medium in which they propagate. By means\nof high-resolution very long baseline interferometry (VLBI) radio observations,\nwe monitored RSOph with the European VLBI Network (EVN) and e-MERLIN at 1.6 and\n5\\,GHz during multiple epochs from 14 to 65 days after the explosion. We reveal\nan evolving source structure, consisting of a central and compact core and two\nelongated bipolar outflows, expanding on opposite sides from the core in\neast-west direction. The ejecta angular separation with time is consistent with\na linear expansion with an average speed of $\\sim7000$ km s$^{-1}$. We find\nclear evidence of a radial dependence of the density along the density\nenhancement on the orbital plane (DEOP), going from 1.1$\\times$10$^7$\n~cm$^{-3}$ close to the central binary to 3.8$\\times$10$^5$~cm$^{-3}$ at\n$\\sim175$~AU. Thanks to the accurate source astrometric position provided by\nGaia DR3, in this work we draw a detailed scenario of the geometry and physics\nof the RSOph evolving source structure after the most recent nova event. We\nconclude that most of the mass lost by the red giant companion goes in the\nDEOP, for which we estimate a total mass of $4.3 \\times 10^{-6}\n~\\mathrm{M_\\odot}$, and in the circumstellar region, while only a small\nfraction (about one-tenth) is accreted by the white dwarf.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zOQLp3-MSylr7No5JU_KKo655nEqt87tHESkHixEuHU","pdfSize":"830015"}
