{"id":"2407.00539","title":"The role of magnetic dipolar interactions in skyrmion lattices","authors":"Elizabeth M Jefremovas, Kilian Leutner, Miriam G Fischer, Jorge\n  Marqu\\'es-March\\'an, Thomas B Winkler, Agustina Asenjo, Robert Fr\\\"omter,\n  Jairo Sinova, Mathias Kl\\\"aui","authorsParsed":[["Jefremovas","Elizabeth M",""],["Leutner","Kilian",""],["Fischer","Miriam G",""],["Marqués-Marchán","Jorge",""],["Winkler","Thomas B",""],["Asenjo","Agustina",""],["Frömter","Robert",""],["Sinova","Jairo",""],["Kläui","Mathias",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 22:32:47 GMT"}],"updateDate":"2024-07-02","timestamp":1719700367000,"abstract":"  Magnetic skyrmions are promising candidates for information and storage\ntechnologies. In the last years, magnetic multilayer systems have been tuned to\nenable room-temperature skyrmions, stable even in the absence of external\nmagnetic field. There are several models describing the properties of an\nisolated skyrmion in a homogeneous background for single repetition multilayer\nstack, however, the description on how the equilibrium skyrmion size in\nlattices scales with increasing the number of repetitions of the stack remains\nunaddressed. This question is essential for fundamental and practical\nperspectives, as the behaviour of an ensemble of skyrmions differs from the\nisolated case. Based on a multilayer stack hosting a skyrmion lattice, we have\ncarried out a series of imaging experiments scaling up the dipolar interaction\nby repeating $n$ times the multilayer unit, from $n =1$ up to $n=30$. We have\ndeveloped an analytical description for the skyrmion radius in the whole\nmultilayer regime, $i.e.$, from thin to thick film limits. Furthermore, we\nprovide insight on how nucleation by an externally applied field can give rise\nto a lattice with more skyrmions (thus, overfilled) than the predicted by the\ncalculations.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"jfg6bsq2Zyb8emvexo2MFgFoSnA7P-nCZSb_Jy2GQOI","pdfSize":"2392267","objectId":"0xff9a81758f58ea2e12cbb234e51bdb501a4763e770daedcdc834061cb035513f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
