{"id":"2407.18659","title":"The Great Wave: Evidence of a large-scale vertical corrugation\n  propagating outwards in the Galactic disc","authors":"E. Poggio, S. Khanna, R. Drimmel, E. Zari, E. D'Onghia, M. G.\n  Lattanzi, P. A. Palicio, A. Recio-Blanco, L. Thulasidharan","authorsParsed":[["Poggio","E.",""],["Khanna","S.",""],["Drimmel","R.",""],["Zari","E.",""],["D'Onghia","E.",""],["Lattanzi","M. G.",""],["Palicio","P. A.",""],["Recio-Blanco","A.",""],["Thulasidharan","L.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 10:49:57 GMT"}],"updateDate":"2024-07-29","timestamp":1721990997000,"abstract":"  We analyse the three-dimensional structure and kinematics of two samples of\nyoung stars in the Galactic disc, containing respectively young giants\n($\\sim$16000 stars out to heliocentric distances of $\\sim$7 kpc) and classical\nCepheids ($\\sim$3400 stars out to heliocentric distances of $\\sim$15 kpc). Both\nsamples show evidence of a large-scale vertical corrugation on top of the warp\nof the Milky Way, which has a vertical height of 150-200 pc, a radial width of\nabout 3 kpc, and a total length of at least 10 kpc, possibly reaching 20 kpc\nwith the Cepheid sample. The stars in the corrugation exhibit both radial and\nvertical systematic motions, with Galactocentric radial velocities towards the\nouter disc of about 10-15 km/s. In the vertical motions, once the warp\nsignature is subtracted, the residuals show a large-scale feature of\nsystematically positive vertical velocities, which is located radially outwards\nwith respect to the corrugation, and whose line of maxima approximately\ncoincides with the line of null vertical displacement, consistent with a\nvertical wave propagating towards the outer parts of the Galactic disc.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zLa3det160jSndVs0m6f7roC5bkKgkG1Is6YAjLR8hc","pdfSize":"5035272","objectId":"0xb9b092655f70cec021788ad27b691855c96f1f99febea9e5d848077c4582e432","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
