{"id":"2407.13328","title":"Unsupervised Domain Adaptive Lane Detection via Contextual Contrast and\n  Aggregation","authors":"Kunyang Zhou, Yunjian Feng, and Jun Li","authorsParsed":[["Zhou","Kunyang",""],["Feng","Yunjian",""],["Li","Jun",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:29:02 GMT"}],"updateDate":"2024-07-19","timestamp":1721294942000,"abstract":"  This paper focuses on two crucial issues in domain-adaptive lane detection,\ni.e., how to effectively learn discriminative features and transfer knowledge\nacross domains. Existing lane detection methods usually exploit a pixel-wise\ncross-entropy loss to train detection models. However, the loss ignores the\ndifference in feature representation among lanes, which leads to inefficient\nfeature learning. On the other hand, cross-domain context dependency crucial\nfor transferring knowledge across domains remains unexplored in existing lane\ndetection methods. This paper proposes a method of Domain-Adaptive lane\ndetection via Contextual Contrast and Aggregation (DACCA), consisting of two\nkey components, i.e., cross-domain contrastive loss and domain-level feature\naggregation, to realize domain-adaptive lane detection. The former can\neffectively differentiate feature representations among categories by taking\ndomain-level features as positive samples. The latter fuses the domain-level\nand pixel-level features to strengthen cross-domain context dependency.\nExtensive experiments show that DACCA significantly improves the detection\nmodel's performance and outperforms existing unsupervised domain adaptive lane\ndetection methods on six datasets, especially achieving the best performance\nwhen transferring from CULane to Tusimple (92.10% accuracy), Tusimple to CULane\n(41.9% F1 score), OpenLane to CULane (43.0% F1 score), and CULane to OpenLane\n(27.6% F1 score).\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iezriOrvLv6YKOfblf1C-xTVPHi5l6cz32if5WAGkz8","pdfSize":"3662578","objectId":"0x210a06806c2472a6b843290a67e5bb118bbfa2c8703d57d4ceb7b5b97de6fa79","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
