{"id":"2407.07695","title":"African Democracy in the Era of Generative Disinformation: Challenges\n  and Countermeasures against AI-Generated Propaganda","authors":"Chinasa T. Okolo","authorsParsed":[["Okolo","Chinasa T.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 14:24:53 GMT"}],"updateDate":"2024-07-11","timestamp":1720621493000,"abstract":"  In light of prominent discourse around the negative implications of\ngenerative AI, an emerging area of research is investigating the current and\nestimated impacts of AI-generated propaganda on African citizens participating\nin elections. Throughout Africa, there have already been suspected cases of\nAI-generated propaganda influencing electoral outcomes or precipitating coups\nin countries like Nigeria, Burkina Faso, and Gabon, underscoring the need for\ncomprehensive research in this domain. This paper aims to highlight the risks\nassociated with the spread of generative AI-driven disinformation within Africa\nwhile concurrently examining the roles of government, civil society, academia,\nand the general public in the responsible development, practical use, and\nrobust governance of AI. To understand how African governments might\neffectively counteract the impact of AI-generated propaganda, this paper\npresents case studies illustrating the current usage of generative AI for\nelection-related propaganda in Africa. Subsequently, this paper discusses\nefforts by fact-checking organisations to mitigate the negative impacts of\ndisinformation, explores the potential for new initiatives to actively engage\ncitizens in literacy efforts to combat disinformation spread, and advocates for\nincreased governmental regulatory measures. Overall, this research seeks to\nincrease comprehension of the potential ramifications of AI-generated\npropaganda on democratic processes within Africa and propose actionable\nstrategies for stakeholders to address these multifaceted challenges.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"6pIlrAawxjsqIUX4-FRvs7rX4f-afiGkRpfJDbO8WTE","pdfSize":"174671","objectId":"0x93c42d2b8f5dbe573b9ffae247dfc30e8ef6ea557b9b916a2c2c40b228dedbfc","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
