{"id":"2407.15196","title":"Channel Shaping Using Beyond Diagonal Reconfigurable Intelligent\n  Surface: Analysis, Optimization, and Enhanced Flexibility","authors":"Yang Zhao, Hongyu Li, Massimo Franceschetti, Bruno Clerckx","authorsParsed":[["Zhao","Yang",""],["Li","Hongyu",""],["Franceschetti","Massimo",""],["Clerckx","Bruno",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 15:30:01 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 09:44:44 GMT"}],"updateDate":"2024-07-24","timestamp":1721575801000,"abstract":"  This paper investigates the capability of a passive Reconfigurable\nIntelligent Surface (RIS) to redistribute the singular values of point-to-point\nMultiple-Input Multiple-Output (MIMO) channels for achieving power and rate\ngains. We depart from the conventional Diagonal (D)-RIS with diagonal phase\nshift matrix and adopt a Beyond Diagonal (BD) architecture that offers greater\nwave manipulation flexibility through element-wise connections. Specifically,\nwe first provide shaping insights by characterizing the channel singular value\nregions attainable by D-RIS and BD-RIS via a novel geodesic optimization.\nAnalytical singular value bounds are then derived to explore their shaping\nlimits in typical deployment scenarios. As a side product, we tackle\nBD-RIS-aided MIMO rate maximization problem by a local-optimal Alternating\nOptimization (AO) and a shaping-inspired low-complexity approach. Results show\nthat compared to D-RIS, BD-RIS significantly improves the dynamic range of all\nchannel singular values, the trade-off in manipulating them, and thus the\nchannel power and achievable rate. Those observations become more pronounced\nwhen the number of RIS elements and MIMO dimensions increase. Of particular\ninterest, BD-RIS is shown to activate multi-stream transmission at lower\ntransmit power than D-RIS, hence achieving the asymptotic Degrees of Freedom\n(DoF) at low Signal-to-Noise Ratio (SNR) thanks to its higher flexibility of\nshaping the distribution of channel singular values.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lErAVSPq1ZryE3acC69HgjSi9OcJzCwHGqvqlHpa3d4","pdfSize":"519760","objectId":"0x0318d3635f40bfaf85e2a38f411430c8dd6ede6e77724626ed7605fbda62793e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
