{"id":"2407.17762","title":"Mpox Detection Advanced: Rapid Epidemic Response Through Synthetic Data","authors":"Yudara Kularathne, Prathapa Janitha, Sithira Ambepitiya, Prarththanan\n  Sothyrajah, Thanveer Ahamed, Dinuka Wijesundara","authorsParsed":[["Kularathne","Yudara",""],["Janitha","Prathapa",""],["Ambepitiya","Sithira",""],["Sothyrajah","Prarththanan",""],["Ahamed","Thanveer",""],["Wijesundara","Dinuka",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 04:33:19 GMT"}],"updateDate":"2024-07-26","timestamp":1721881999000,"abstract":"  Rapid development of disease detection models using computer vision is\ncrucial in responding to medical emergencies, such as epidemics or bioterrorism\nevents. Traditional data collection methods are often too slow in these\nscenarios, requiring innovative approaches for quick, reliable model generation\nfrom minimal data. Our study introduces a novel approach by constructing a\ncomprehensive computer vision model to detect Mpox lesions using only synthetic\ndata. Initially, these models generated a diverse set of synthetic images\nrepresenting Mpox lesions on various body parts (face, back, chest, leg, neck,\narm) across different skin tones as defined by the Fitzpatrick scale (fair,\nbrown, dark skin). Subsequently, we trained and tested a vision model with this\nsynthetic dataset to evaluate the diffusion models' efficacy in producing\nhigh-quality training data and its impact on the vision model's medical image\nrecognition performance. The results were promising; the vision model achieved\na 97% accuracy rate, with 96% precision and recall for Mpox cases, and\nsimilarly high metrics for normal and other skin disorder cases, demonstrating\nits ability to correctly identify true positives and minimize false positives.\nThe model achieved an F1-Score of 96% for Mpox cases and 98% for normal and\nother skin disorders, reflecting a balanced precision-recall relationship, thus\nensuring reliability and robustness in its predictions. Our proposed\nSynthVision methodology indicates the potential to develop accurate computer\nvision models with minimal data input for future medical emergencies.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"peMmYHIrtABSuaExEBFpt4vEGFw8YTFVDoszFdsDbrQ","pdfSize":"512278","objectId":"0xafc27514e9c128c9ee973e86a0965c95e39cd1a0eb2f8e49187062a8d7339c22","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
