{"id":"2407.18907","title":"SHIC: Shape-Image Correspondences with no Keypoint Supervision","authors":"Aleksandar Shtedritski, Christian Rupprecht, Andrea Vedaldi","authorsParsed":[["Shtedritski","Aleksandar",""],["Rupprecht","Christian",""],["Vedaldi","Andrea",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:58:59 GMT"}],"updateDate":"2024-07-29","timestamp":1722016739000,"abstract":"  Canonical surface mapping generalizes keypoint detection by assigning each\npixel of an object to a corresponding point in a 3D template. Popularised by\nDensePose for the analysis of humans, authors have since attempted to apply the\nconcept to more categories, but with limited success due to the high cost of\nmanual supervision. In this work, we introduce SHIC, a method to learn\ncanonical maps without manual supervision which achieves better results than\nsupervised methods for most categories. Our idea is to leverage foundation\ncomputer vision models such as DINO and Stable Diffusion that are open-ended\nand thus possess excellent priors over natural categories. SHIC reduces the\nproblem of estimating image-to-template correspondences to predicting\nimage-to-image correspondences using features from the foundation models. The\nreduction works by matching images of the object to non-photorealistic renders\nof the template, which emulates the process of collecting manual annotations\nfor this task. These correspondences are then used to supervise high-quality\ncanonical maps for any object of interest. We also show that image generators\ncan further improve the realism of the template views, which provide an\nadditional source of supervision for the model.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rlq72INPu65gbAcHQF2Y1vHAkEJOiZK0MCQrqHxVZbs","pdfSize":"18006806","objectId":"0xe0878db852dad6323eb47cbee4b467bae3a472ce5a8ef2c23689e394603cfff3","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
