{"id":"2407.11278","title":"CICAPT-IIOT: A provenance-based APT attack dataset for IIoT environment","authors":"Erfan Ghiasvand, Suprio Ray, Shahrear Iqbal, Sajjad Dadkhah, and Ali\n  A. Ghorbani","authorsParsed":[["Ghiasvand","Erfan",""],["Ray","Suprio",""],["Iqbal","Shahrear",""],["Dadkhah","Sajjad",""],["Ghorbani","Ali A.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 23:08:34 GMT"}],"updateDate":"2024-07-17","timestamp":1721084914000,"abstract":"  The Industrial Internet of Things (IIoT) is a transformative paradigm that\nintegrates smart sensors, advanced analytics, and robust connectivity within\nindustrial processes, enabling real-time data-driven decision-making and\nenhancing operational efficiency across diverse sectors, including\nmanufacturing, energy, and logistics. IIoT is susceptible to various attack\nvectors, with Advanced Persistent Threats (APTs) posing a particularly grave\nconcern due to their stealthy, prolonged, and targeted nature. The\neffectiveness of machine learning-based intrusion detection systems in APT\ndetection has been documented in the literature. However, existing\ncybersecurity datasets often lack crucial attributes for APT detection in IIoT\nenvironments. Incorporating insights from prior research on APT detection using\nprovenance data and intrusion detection within IoT systems, we present the\nCICAPT-IIoT dataset. The main goal of this paper is to propose a novel APT\ndataset in the IIoT setting that includes essential information for the APT\ndetection task. In order to achieve this, a testbed for IIoT is developed, and\nover 20 attack techniques frequently used in APT campaigns are included. The\nperformed attacks create some of the invariant phases of the APT cycle,\nincluding Data Collection and Exfiltration, Discovery and Lateral Movement,\nDefense Evasion, and Persistence. By integrating network logs and provenance\nlogs with detailed attack information, the CICAPT-IIoT dataset presents\nfoundation for developing holistic cybersecurity measures. Additionally, a\ncomprehensive dataset analysis is provided, presenting cybersecurity experts\nwith a strong basis on which to build innovative and efficient security\nsolutions.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IE1gPp2sT9BGQb6xZuMGfxc-MDe5iqQuRzvdnWSbLrA","pdfSize":"1242344","objectId":"0x4bce7fd2accd8f1c4b8dd58b5a8b313bb4a3d8da16e454742add61e5058376aa","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
