{"id":"2407.04505","title":"Hyperspectral Dataset and Deep Learning methods for Waste from Electric\n  and Electronic Equipment Identification (WEEE)","authors":"Artzai Picon and Pablo Galan and Arantza Bereciartua-Perez and Leire\n  Benito-del-Valle","authorsParsed":[["Picon","Artzai",""],["Galan","Pablo",""],["Bereciartua-Perez","Arantza",""],["Benito-del-Valle","Leire",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 13:45:11 GMT"}],"updateDate":"2024-07-08","timestamp":1720187111000,"abstract":"  Hyperspectral imaging, a rapidly evolving field, has witnessed the ascendancy\nof deep learning techniques, supplanting classical feature extraction and\nclassification methods in various applications. However, many researchers\nemploy arbitrary architectures for hyperspectral image processing, often\nwithout rigorous analysis of the interplay between spectral and spatial\ninformation. This oversight neglects the implications of combining these two\nmodalities on model performance.\n  In this paper, we evaluate the performance of diverse deep learning\narchitectures for hyperspectral image segmentation. Our analysis disentangles\nthe impact of different architectures, spanning various spectral and spatial\ngranularities. Specifically, we investigate the effects of spectral resolution\n(capturing spectral information) and spatial texture (conveying spatial\ndetails) on segmentation outcomes. Additionally, we explore the transferability\nof knowledge from large pre-trained image foundation models, originally\ndesigned for RGB images, to the hyperspectral domain.\n  Results show that incorporating spatial information alongside spectral data\nleads to improved segmentation results, and that it is essential to further\nwork on novel architectures comprising spectral and spatial information and on\nthe adaption of RGB foundation models into the hyperspectral domain.\n  Furthermore, we contribute to the field by cleaning and publicly releasing\nthe Tecnalia WEEE Hyperspectral dataset. This dataset contains different\nnon-ferrous fractions of Waste Electrical and Electronic Equipment (WEEE),\nincluding Copper, Brass, Aluminum, Stainless Steel, and White Copper, spanning\nthe range of 400 to 1000 nm.\n  We expect these conclusions can guide novel researchers in the field of\nhyperspectral imaging.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ftZRAjtBf5byLMYyUvcNPMmE6YQrjFt1KRUJy7GSPVE","pdfSize":"4171302"}
