{"id":"2407.10552","title":"Asymptotic giant branch stars in the eROSITA-DE eRASS1 catalog","authors":"Martin A. Guerrero, Rodolfo Montez Jr., Roberto Ortiz, Jesus A. Toala,\n  and Joel H. Kastner","authorsParsed":[["Guerrero","Martin A.",""],["Montez","Rodolfo","Jr."],["Ortiz","Roberto",""],["Toala","Jesus A.",""],["Kastner","Joel H.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 09:02:58 GMT"}],"updateDate":"2024-07-16","timestamp":1721034178000,"abstract":"  AGB stars are not expected to be X-ray-emitters, yet a small fraction of\nthem, the so-called X-AGBs, show X-ray emission that can be attributed to\ncoronal activity of a companion or accretion onto it. By searching the recently\nreleased eROSITA-DE eRASS1 source catalog, we aim to increase the sample of\nknown X-AGBs. So far, 36 X-AGBs have been reported, including 21 previous ROSAT\nRASS, Chandra and XMM detections and 15 more eROSITA eRASS1 recent detections.\nWe cross-correlated the position of sources in the eROSITA-DE eRASS1 catalog\nwith those of AGB stars to find possible X-ray counterparts. We carefully\nchecked these by comparing X-ray and near-IR $K$ images, disregarding those\naffected by optical loading, diffuse sources, or unreliable positional\nassociations. Seven high-confidence X-AGBs and another seven possible ones are\nfound. Accounting for previous X-ray detections, the sample of X-AGBs is\nincreased from 36 up to 47, of which eROSITA-DE has so far discovered 26 new\nX-AGBs, more than doubling the number of known X-AGBs. This demonstrates\neROSITA's capability to detect X-AGBs despite the challenge posed by the\noptical loading caused by their near-IR brightness. The eRASS1 X-AGBs tend to\nhave higher X-ray luminosity than previously detected X-AGBs, suggesting a bias\ntoward brighter sources. A comparison of the X-ray and far-UV luminosity of\nX-AGBs with those of X-ray-emitter symbiotic stars (X-SySts) revealed an\noverlap in the X-ray luminosity range $10^{29.5}<L_X$ (erg s$^{-1}$)\n$<10^{33.0}$. The average higher X-ray luminosity of X-SySts AGBs ($\\approx\n10^{32}$ erg s$^{-1}$) can be interpreted as X-ray emission arising from a\nboundary layer between an accretion disk and a white dwarf, whereas the average\nlower X-ray luminosity ($\\approx5\\times10^{30}$ erg s$^{-1}$) of X-AGBs would\narise from an accretion disk around main-sequence or subgiant F-K companion\nstars.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"j4wCkvrmKzdlTvTYjO3TvK9qRO7C8F2AWcKSawP7ZeM","pdfSize":"1657892","objectId":"0x97ec78a7b5f24279cd2a69ef257f2eacc4b09bb008eedb44f8b13601f1eb488c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
