{"id":"2407.14640","title":"CVE-LLM : Automatic vulnerability evaluation in medical device industry\n  using large language models","authors":"Rikhiya Ghosh, Oladimeji Farri, Hans-Martin von Stockhausen, Martin\n  Schmitt, George Marica Vasile","authorsParsed":[["Ghosh","Rikhiya",""],["Farri","Oladimeji",""],["von Stockhausen","Hans-Martin",""],["Schmitt","Martin",""],["Vasile","George Marica",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 19:34:17 GMT"}],"updateDate":"2024-07-23","timestamp":1721417657000,"abstract":"  The healthcare industry is currently experiencing an unprecedented wave of\ncybersecurity attacks, impacting millions of individuals. With the discovery of\nthousands of vulnerabilities each month, there is a pressing need to drive the\nautomation of vulnerability assessment processes for medical devices,\nfacilitating rapid mitigation efforts. Generative AI systems have\nrevolutionized various industries, offering unparalleled opportunities for\nautomation and increased efficiency. This paper presents a solution leveraging\nLarge Language Models (LLMs) to learn from historical evaluations of\nvulnerabilities for the automatic assessment of vulnerabilities in the medical\ndevices industry. This approach is applied within the portfolio of a single\nmanufacturer, taking into account device characteristics, including existing\nsecurity posture and controls. The primary contributions of this paper are\nthreefold. Firstly, it provides a detailed examination of the best practices\nfor training a vulnerability Language Model (LM) in an industrial context.\nSecondly, it presents a comprehensive comparison and insightful analysis of the\neffectiveness of Language Models in vulnerability assessment. Finally, it\nproposes a new human-in-the-loop framework to expedite vulnerability evaluation\nprocesses.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"piGmPvwWePeZhPQsVi5tMuDMhePtsN_9U0gMEkgBfqg","pdfSize":"1589921","objectId":"0x6559fafbf0bad95a9ae8910079b79cdadfbb6a5ecf43f20417670dce805948a0","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
