{"id":"2407.20631","title":"Hedgehog topological defects in 3D amorphous solids","authors":"Arabinda Bera, Alessio Zaccone, Matteo Baggioli","authorsParsed":[["Bera","Arabinda",""],["Zaccone","Alessio",""],["Baggioli","Matteo",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 08:14:07 GMT"}],"updateDate":"2024-07-31","timestamp":1722327247000,"abstract":"  The underlying structural disorder renders the concept of topological defects\nin amorphous solids difficult to apply and hinders a first-principle\nidentification of the microscopic carriers of plasticity and of the regions\nmore prone to structural rearrangements (\"soft spots\"). Recently, it has been\nproposed that well-defined topological defects can still be identified in\nglasses, and correlated to local and global plasticity, by looking at the\neigenvector field or the particle displacement field. Nevertheless, all the\nexisting proposals and analyses are only valid in two spatial dimensions. In\nthis work, we propose the idea of using hedgehog topological defects to\ncharacterize the plasticity of 3D glasses and to geometrically predict the\nlocation of their soft spots. We corroborate our proposal by simulating a\nKremer-Grest 3D polymer glass, and by using both the normal mode eigenvector\nfield and the displacement field around large plastic events. Our results\nconfirm that a topological characterization of plasticity in glasses is\nfeasible, and provide a concrete realization of this program in 3D amorphous\nsystems.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Materials Science","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NSqgw0IHkAVZEt0RKIFXvqH3u5STeqyJMn6-xXYcVvE","pdfSize":"3617421","objectId":"0xd94a58e526cf03324a1f83f583514b2766ce23248f34958ce35ffbacfe1ae07e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
