{"id":"2407.20571","title":"Considering Visualization Example Galleries","authors":"Junran Yang, Andrew McNutt, Leilani Battle","authorsParsed":[["Yang","Junran",""],["McNutt","Andrew",""],["Battle","Leilani",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 05:59:45 GMT"}],"updateDate":"2024-07-31","timestamp":1722319185000,"abstract":"  Example galleries are often used to teach, document, and advertise\nvisually-focused domain-specific languages and libraries, such as those\nproducing visualizations, diagrams, or webpages. Despite their ubiquity, there\nis no consensus on the role of \"example galleries\", let alone what the best\npractices might be for their creation or curation. To understand gallery\nmeaning and usage, we interviewed the creators (N=11) and users (N=9) of\nprominent visualization-adjacent tools. From these interviews we synthesized\nstrategies and challenges for gallery curation and management (e.g. weighing\nthe costs/benefits of adding new examples and trade-offs in richness vs ease of\nuse), highlighted the differences between planned and actual gallery usage\n(e.g. opportunistic reuse vs search-engine optimization), and reflected on\nparts of the gallery design space not explored (e.g. highlighting the potential\nof tool assistance). We found that galleries are multi-faceted structures whose\nform and content are motivated to accommodate different usages--ranging from\nmarketing material to test suite to extended documentation. This work offers a\nfoundation for future support tools by characterizing gallery design and\nmanagement, as well as by highlighting challenges and opportunities in the\nspace (such as how more diverse galleries make reuse tasks simpler, but\ncomplicate upkeep).\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rkd6LXjvUbuGenKfgnpuO9ryy_XTZHPtKnjoU0gqti8","pdfSize":"2862826","objectId":"0x7ce6a82767a257274076a438a8fc784d06d9b6061db5da352946a28ad38f79ba","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
