{"id":"2407.19080","title":"Destruction of interstellar methyl cyanide (CH3CN) via collisions with\n  He+ ions","authors":"Luca Mancini, Em\\'ilia Valen\\c{c}a Ferreira de Arag\\~ao, Fernando\n  Pirani, Marzio Rosi, Noelia Faginas-Lago, Vincent Richardson, Luca Matteo\n  Martini, Linda Podio, Manuela Lippi, Claudio Codella, Daniela Ascenzi","authorsParsed":[["Mancini","Luca",""],["de Aragão","Emília Valença Ferreira",""],["Pirani","Fernando",""],["Rosi","Marzio",""],["Faginas-Lago","Noelia",""],["Richardson","Vincent",""],["Martini","Luca Matteo",""],["Podio","Linda",""],["Lippi","Manuela",""],["Codella","Claudio",""],["Ascenzi","Daniela",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 20:52:35 GMT"}],"updateDate":"2024-07-30","timestamp":1722027155000,"abstract":"  Methyl cyanide is one of the simplest interstellar complex organic molecules,\nwidely detected in young solar analogues, shocked regions, protoplanetary disks\nand comets. CH3CN can be considered a key species to explore the chemical\nconnections between planet forming disks and comets. For such comparison to be\nmeaningful kinetics data for the reactions leading to CH3CN formation and\ndestruction must be updated. We focus on the destruction of methyl cyanide\nthrough collisions with He+. A combined experimental and theoretical\nmethodology is employed to obtain cross sections (CSs) and branching ratios\n(BRs) as a function of collision energy, from which reaction rate coefficients\n$k(T)$ are calculated in the temperature range from 10 to 300 K. CSs and BRs\nare measured using a guided ion beam set-up. A theoretical treatment based on\nan analytical formulation of the potential energy surfaces (PESs) for the\ncharge exchange process is developed. The method employs a Landau Zener model\nto obtain reaction probabilities at crossings between the entrance and exit\nPESs, and an adiabatic centrifugal sudden approximation to calculate CSs and\nk(T). Rates and BRs differ from those predicted from widely-used capture\nmodels. In particular, the rate coefficient at 10 K is estimated to be almost\none order of magnitude smaller than what reported in the KIDA database. As for\nBRs, the charge exchange is completely dissociative and the most abundant\nfragments are HCCN+/CCNH+, HCNH+ and CH2+. Our results, combined with a revised\nchemical network for formation of CH3CN, support the hypothesis that methyl\ncyanide in protoplanetary disks could be mostly the product of gas-phase\nprocesses rather than grain chemistry, as currently proposed. These findings\nare expected to have implications in the comparison of the abundance ratios of\nN-bearing molecules observed in disks with cometary abundance ratios\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GcJeTndtiJf9sFfHFTH-ZlSkjxXdJL293U_ARH_5qiQ","pdfSize":"7955222","objectId":"0xe643144827221bacb19d0be9a9c6017d0f28898d2478302323fba5bc2cbd7039","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
