{"id":"2407.14917","title":"Distributed Model-Predictive Energy Management Strategy for Shipboard\n  Power Systems Considering Battery Degradation","authors":"Satish Vedula, Seyyed Shaho Alaviani, and Olugbenga Moses Anubi","authorsParsed":[["Vedula","Satish",""],["Alaviani","Seyyed Shaho",""],["Anubi","Olugbenga Moses",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 16:07:42 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 18:29:28 GMT"}],"updateDate":"2024-07-31","timestamp":1721491662000,"abstract":"  With the integration of loads such as pulse power loads, a new control\nchallenge is presented in meeting their high ramp rate requirements. Existing\nonboard generators are ramp rate limited. The inability to meet the load power\ndue to ramp rate limitation may lead to instability. The addition of energy\nstorage elements in addition to the existing generators proves a viable\nsolution in addressing the control challenges presented by high ramp rate\nloads. A distributed energy management strategy maximizing generator efficiency\nand minimizing energy storage degradation is developed that facilitates an\noptimal adaptive power split between generators and energy storage elements.\nThe complex structure of the energy storage degradation model makes it tough\nfor its direct integration into the optimization problem and is not practical\nfor real-time implementation. A degradation heuristic to minimize absolute\npower extracted from the energy storage elements is proposed as a degradation\nheuristic measure. The designed strategy is tested through a numerical case\nstudy of a consolidated shipboard power system model consisting of a single\ngenerator, energy storage element, and load model. The results show the impact\nof the designed energy management strategy in effectively managing energy\nstorage health.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"A9XtREReE5N2iuFjeJOAq9bTPdofpjHt4W-CWD6HGiM","pdfSize":"2980547","objectId":"0x1b477fdc77ec479e7b5206bb96777f12575447d89539e85290fae2998fc923cd","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
