{"id":"2407.17256","title":"Critical Infrastructure Security: Penetration Testing and Exploit\n  Development Perspectives","authors":"Papa Kobina Orleans-Bosomtwe","authorsParsed":[["Orleans-Bosomtwe","Papa Kobina",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 13:17:07 GMT"}],"updateDate":"2024-07-25","timestamp":1721827027000,"abstract":"  Critical infrastructure refers to essential physical and cyber systems vital\nto the functioning and stability of societies and economies. These systems\ninclude key sectors such as healthcare, energy, and water supply, which are\ncrucial for societal and economic stability and are increasingly becoming prime\ntargets for malicious actors, including state-sponsored hackers, seeking to\ndisrupt national security and economic stability. This paper reviews literature\non critical infrastructure security, focusing on penetration testing and\nexploit development. It explores four main questions: the characteristics of\ncritical infrastructure, the role and challenges of penetration testing,\nmethodologies of exploit development, and the contribution of these practices\nto security and resilience. The findings of this paper reveal inherent\nvulnerabilities in critical infrastructure and sophisticated threats posed by\ncyber adversaries. Penetration testing is highlighted as a vital tool for\nidentifying and addressing security weaknesses, allowing organizations to\nfortify their defenses. Additionally, understanding exploit development helps\nanticipate and mitigate potential threats, leading to more robust security\nmeasures. The review underscores the necessity of continuous and proactive\nsecurity assessments, advocating for integrating penetration testing and\nexploit development into regular security protocols. By doing so, organizations\ncan preemptively identify and mitigate risks, enhancing the overall resilience\nof critical infrastructure. The paper concludes by emphasizing the need for\nongoing research and collaboration between the public and private sectors to\ndevelop innovative solutions for the evolving cyber threat landscape. This\ncomprehensive review aims to provide a foundational understanding of critical\ninfrastructure security and guide future research and practices.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VblnqhmTQJzPvO_DEDCcU8ufzd_OrsLcjop8Dq3EK_g","pdfSize":"1173713","objectId":"0x6f5acd8b07f56358ad6c9f06e7f88854ad8951a6b356fb72f6f363a0a677b511","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
