{"id":"2407.00640","title":"Physics-augmented neural networks for constitutive modeling of\n  hyperelastic geometrically exact beams","authors":"Jasper O. Schommartz, Dominik K. Klein, Juan C. Alzate Cobo, Oliver\n  Weeger","authorsParsed":[["Schommartz","Jasper O.",""],["Klein","Dominik K.",""],["Cobo","Juan C. Alzate",""],["Weeger","Oliver",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 09:45:37 GMT"}],"updateDate":"2024-07-02","timestamp":1719740737000,"abstract":"  We present neural network-based constitutive models for hyperelastic\ngeometrically exact beams. The proposed models are physics-augmented, i.e.,\nformulated to fulfill important mechanical conditions by construction. Strains\nand curvatures of the beam are used as input for feed-forward neural networks\nthat represent the effective hyperelastic beam potential. Forces and moments\nare then received as the gradients of the beam potential, ensuring\nthermodynamic consistency. Furthermore, normalization conditions are considered\nvia additional projection terms. To include the symmetry of beams with\npoint-symmetric cross-sections, a flip symmetry constraint is introduced.\nAdditionally, parameterized models are proposed that can represent the beam's\nconstitutive behavior for varying cross-sectional geometries. The physically\nmotivated parameterization takes into account the influence of the beam radius\non the beam potential. Formulating the beam potential as a neural network\nprovides a highly flexible model. This enables efficient constitutive surrogate\nmodeling for geometrically exact beams with nonlinear material behavior and\ncross-sectional deformation, which otherwise would require computationally much\nmore expensive methods. The models are calibrated to data generated for beams\nwith circular, deformable cross-sections and varying radii, showing excellent\naccuracy and generalization. The applicability of the proposed model is further\ndemonstrated by applying it in beam simulations. In all studied cases, the\nproposed model shows excellent performance.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"DvTP7XXAJS5EPRlHAMEOPEsJc4eqWVV8qKSE9dOiM7E","pdfSize":"16531212","objectId":"0x0e6b8c2547e32c73ae2f020605939da8ccbc94e60ad70174d71bc7360ad03f0d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
