{"id":"2407.02060","title":"Terminating Differentiable Tree Experts","authors":"Jonathan Thomm, Michael Hersche, Giacomo Camposampiero, Aleksandar\n  Terzi\\'c, Bernhard Sch\\\"olkopf, Abbas Rahimi","authorsParsed":[["Thomm","Jonathan",""],["Hersche","Michael",""],["Camposampiero","Giacomo",""],["Terzić","Aleksandar",""],["Schölkopf","Bernhard",""],["Rahimi","Abbas",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 08:45:38 GMT"}],"updateDate":"2024-07-03","timestamp":1719909938000,"abstract":"  We advance the recently proposed neuro-symbolic Differentiable Tree Machine,\nwhich learns tree operations using a combination of transformers and Tensor\nProduct Representations. We investigate the architecture and propose two key\ncomponents. We first remove a series of different transformer layers that are\nused in every step by introducing a mixture of experts. This results in a\nDifferentiable Tree Experts model with a constant number of parameters for any\narbitrary number of steps in the computation, compared to the previous method\nin the Differentiable Tree Machine with a linear growth. Given this flexibility\nin the number of steps, we additionally propose a new termination algorithm to\nprovide the model the power to choose how many steps to make automatically. The\nresulting Terminating Differentiable Tree Experts model sluggishly learns to\npredict the number of steps without an oracle. It can do so while maintaining\nthe learning capabilities of the model, converging to the optimal amount of\nsteps.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Symbolic Computation"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4BgGE2VgB9j_Pk24Y5_4qeThA6mTQicdiVMn0tHozrA","pdfSize":"1656198","objectId":"0xf150f10b1bce21f63e09edf99fb9d741bb32033fd1cc7c96033b05e08cfcf503","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
