{"id":"2407.18389","title":"Doubly Robust Targeted Estimation of Conditional Average Treatment\n  Effects for Time-to-event Outcomes with Competing Risks","authors":"Runjia Li, Victor B. Talisa, Chung-Chou H. Chang","authorsParsed":[["Li","Runjia",""],["Talisa","Victor B.",""],["Chang","Chung-Chou H.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 20:44:17 GMT"}],"updateDate":"2024-07-29","timestamp":1721940257000,"abstract":"  In recent years, precision treatment strategy have gained significant\nattention in medical research, particularly for patient care. We propose a\nnovel framework for estimating conditional average treatment effects (CATE) in\ntime-to-event data with competing risks, using ICU patients with sepsis as an\nillustrative example. Our approach, based on cumulative incidence functions and\ntargeted maximum likelihood estimation (TMLE), achieves both asymptotic\nefficiency and double robustness. The primary contribution of this work lies in\nour derivation of the efficient influence function for the targeted causal\nparameter, CATE. We established the theoretical proofs for these properties,\nand subsequently confirmed them through simulations. Our TMLE framework is\nflexible, accommodating various regression and machine learning models, making\nit applicable in diverse scenarios. In order to identify variables contributing\nto treatment effect heterogeneity and to facilitate accurate estimation of\nCATE, we developed two distinct variable importance measures (VIMs). This work\nprovides a powerful tool for optimizing personalized treatment strategies,\nfurthering the pursuit of precision medicine.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QiXhPhgyKG1ZAzOxWHccE5oIBXpn5a04_Zwx4sVBfEA","pdfSize":"3609464","objectId":"0x370855c2f4a4bd475efd1265d0ba15102bdd5ec20d566e2a69b4276f16cec40f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
