{"id":"2407.19479","title":"Breaking the Balance of Power: Commitment Attacks on Ethereum's Reward\n  Mechanism","authors":"Roozbeh Sarenche, Ertem Nusret Tas, Barnabe Monnot, Caspar\n  Schwarz-Schilling, Bart Preneel","authorsParsed":[["Sarenche","Roozbeh",""],["Tas","Ertem Nusret",""],["Monnot","Barnabe",""],["Schwarz-Schilling","Caspar",""],["Preneel","Bart",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 12:17:17 GMT"}],"updateDate":"2024-07-30","timestamp":1722169037000,"abstract":"  Validators in permissionless, large-scale blockchains (e.g., Ethereum) are\ntypically payoff-maximizing, rational actors. Ethereum relies on in-protocol\nincentives, like rewards for validators delivering correct and timely votes, to\ninduce honest behavior and secure the blockchain. However, external incentives,\nsuch as the block proposer's opportunity to capture maximal extractable value\n(MEV), may tempt validators to deviate from honest protocol participation.\n  We show a series of commitment attacks on LMD GHOST, a core part of\nEthereum's consensus mechanism. We demonstrate how a single adversarial block\nproposer can orchestrate long-range chain reorganizations by manipulating\nEthereum's reward system for timely votes. These attacks disrupt the intended\nbalance of power between proposers and voters: by leveraging credible threats,\nthe adversarial proposer can coerce voters from previous slots into supporting\nblocks that conflict with the honest chain, enabling a chain reorganization at\nno cost to the adversary. In response, we introduce a novel reward mechanism\nthat restores the voters' role as a check against proposer power. Our proposed\nmitigation is fairer and more decentralized -- not only in the context of these\nattacks -- but also practical for implementation in Ethereum.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZRVktp02tLLV28ZMNpubM5TmcYBX29CFFMP5YZUSSHI","pdfSize":"6338135","objectId":"0x94af69ad1a95929913ccd38b9cd29f04d789582981c1f6469b37304eacae20fd","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
