{"id":"2407.18980","title":"Time evolution of the synchrotron X-ray emission in Kepler's SNR: the\n  effects of turbulence and shock velocity","authors":"Vincenzo Sapienza, Marco Miceli, Oleh Petruk, Aya Bamba, Satoru\n  Katsuda, Salvatore Orlando, Fabrizio Bocchino and Tracey DeLaney","authorsParsed":[["Sapienza","Vincenzo",""],["Miceli","Marco",""],["Petruk","Oleh",""],["Bamba","Aya",""],["Katsuda","Satoru",""],["Orlando","Salvatore",""],["Bocchino","Fabrizio",""],["DeLaney","Tracey",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 07:41:47 GMT"}],"updateDate":"2024-07-30","timestamp":1721720507000,"abstract":"  The maximum energy of electrons in supernova remnant (SNR) shocks is\ntypically limited by radiative losses, where the synchrotron cooling time\nequals the acceleration time. The low speed of shocks in a dense medium\nincreases the acceleration time, leading to lower maximum electron energies and\nfainter X-ray emissions. However, in Kepler's SNR, an enhanced electron\nacceleration, which proceeds close to the Bohm limit, occurs in the north of\nits shell, where the shock is slowed by a dense circumstellar medium (CSM). To\ninvestigate whether this scenario still holds at smaller scales, we analyzed\nthe temporal evolution of the X-ray synchrotron flux in filamentary structures,\nusing the two deepest Chandra/ACIS X-ray observations, performed in 2006 and\n2014. We examined spectra from different filaments, we measured their proper\nmotion and calculated the acceleration to synchrotron time-scale ratios. The\ninteraction with the turbulent and dense northern CSM induces competing effects\non electron acceleration: on one hand, turbulence reduces the electron mean\nfree path enhancing the acceleration efficiency, on the other hand, lower shock\nvelocities increase the acceleration time-scale. In most filaments, these\neffects compensate each other, but in one region the acceleration time-scale\nexceeds the synchrotron time-scale, resulting in a significant decrease in\nnonthermal X-ray emission from 2006 to 2014, indicating fading synchrotron\nemission. Our findings provide a coherent understanding of the different\nregimes of electron acceleration observed in Kepler's SNR through various\ndiagnostics.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0_eKMQY38HL8I26DHz6uOlO7DOsNe3vhFVsPsI1hTS0","pdfSize":"1334899","objectId":"0x6be1dd7f5e674b92dfaf6bcb5f543605f90db636f6f023b49ec314ba0ba9b58c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
