{"id":"2407.09274","title":"Unifying Sequences, Structures, and Descriptions for Any-to-Any Protein\n  Generation with the Large Multimodal Model HelixProtX","authors":"Zhiyuan Chen, Tianhao Chen, Chenggang Xie, Yang Xue, Xiaonan Zhang,\n  Jingbo Zhou, Xiaomin Fang","authorsParsed":[["Chen","Zhiyuan",""],["Chen","Tianhao",""],["Xie","Chenggang",""],["Xue","Yang",""],["Zhang","Xiaonan",""],["Zhou","Jingbo",""],["Fang","Xiaomin",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 14:03:02 GMT"}],"updateDate":"2024-07-15","timestamp":1720792982000,"abstract":"  Proteins are fundamental components of biological systems and can be\nrepresented through various modalities, including sequences, structures, and\ntextual descriptions. Despite the advances in deep learning and scientific\nlarge language models (LLMs) for protein research, current methodologies\npredominantly focus on limited specialized tasks -- often predicting one\nprotein modality from another. These approaches restrict the understanding and\ngeneration of multimodal protein data. In contrast, large multimodal models\nhave demonstrated potential capabilities in generating any-to-any content like\ntext, images, and videos, thus enriching user interactions across various\ndomains. Integrating these multimodal model technologies into protein research\noffers significant promise by potentially transforming how proteins are\nstudied. To this end, we introduce HelixProtX, a system built upon the large\nmultimodal model, aiming to offer a comprehensive solution to protein research\nby supporting any-to-any protein modality generation. Unlike existing methods,\nit allows for the transformation of any input protein modality into any desired\nprotein modality. The experimental results affirm the advanced capabilities of\nHelixProtX, not only in generating functional descriptions from amino acid\nsequences but also in executing critical tasks such as designing protein\nsequences and structures from textual descriptions. Preliminary findings\nindicate that HelixProtX consistently achieves superior accuracy across a range\nof protein-related tasks, outperforming existing state-of-the-art models. By\nintegrating multimodal large models into protein research, HelixProtX opens new\navenues for understanding protein biology, thereby promising to accelerate\nscientific discovery.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ymNooJKDazwsK9pDeFDw1F0ee8ZphlurJxJUV-pNGJA","pdfSize":"3610589","objectId":"0x1a5aaede33ae9415cfd7f96aece92332385cc6cd2db097739da5ef36422ecc55","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
