{"id":"2407.09035","title":"GPC: Generative and General Pathology Image Classifier","authors":"Anh Tien Nguyen and Jin Tae Kwak","authorsParsed":[["Nguyen","Anh Tien",""],["Kwak","Jin Tae",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 06:54:31 GMT"}],"updateDate":"2024-07-15","timestamp":1720767271000,"abstract":"  Deep learning has been increasingly incorporated into various computational\npathology applications to improve its efficiency, accuracy, and robustness.\nAlthough successful, most previous approaches for image classification have\ncrucial drawbacks. There exist numerous tasks in pathology, but one needs to\nbuild a model per task, i.e., a task-specific model, thereby increasing the\nnumber of models, training resources, and cost. Moreover, transferring\narbitrary task-specific model to another task is still a challenging problem.\nHerein, we propose a task-agnostic generative and general pathology image\nclassifier, so called GPC, that aims at learning from diverse kinds of\npathology images and conducting numerous classification tasks in a unified\nmodel. GPC, equipped with a convolutional neural network and a\nTransformer-based language model, maps pathology images into a high-dimensional\nfeature space and generates pertinent class labels as texts via the\nimage-to-text classification mechanism. We evaluate GPC on six datasets for\nfour different pathology image classification tasks. Experimental results show\nthat GPC holds considerable potential for developing an effective and efficient\nuniversal model for pathology image analysis.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3RkwPyfOocUs0IThh7Ah3xHlKb7zbbyKaybLIS-Sl58","pdfSize":"8773170","objectId":"0x985a76511105ff889e1320a73ae42abfb4affc7c51e2afe9672fbbdadb2e7319","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
