{"id":"2407.04627","title":"A unified approach to coupled homogeneous linear wave propagation in\n  generic gravity","authors":"Lucas T. Santana, Jo\\~ao C. Lobato, Ribamar R. R. Reis, Maur\\'icio O.\n  Calv\\~ao","authorsParsed":[["Santana","Lucas T.",""],["Lobato","João C.",""],["Reis","Ribamar R. R.",""],["Calvão","Maurício O.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 16:34:18 GMT"}],"updateDate":"2024-07-08","timestamp":1720197258000,"abstract":"  Wave propagation is a common occurrence in all of physics. A linear\napproximation provides a simpler way to describe various fields related to\nobservable phenomena in laboratory physics as well as astronomy and cosmology,\nallowing us to probe gravitation through its effect on the trajectories of\nparticles associated with those fields. This paper proposes a unified framework\nto describe the wave propagation of a set of interacting tensor fields that\nobey coupled homogeneous linear second-order partial differential equations for\narbitrary curved spacetimes, both Lorentzian and metric-affine. We use JWKB\nAns\\\"atze for all fields, written in terms of a perturbation parameter\nproportional to a representative wavelength among them, deriving a set of\nhierarchical algebraic and differential equations that link the fields' phases\nand different order amplitudes. This allows us to reobtain the well-known laws\nof geometrical optics and beyond geometrical optics in a generalized form,\nshowing that these laws are independent of the rank of the fields involved.\nThis is true as long as what we refer to as the kinetic tensor of a given field\nsatisfies a set of diagonality conditions, which further imply a handful of\nsimplifications on the transport equations obtained in the subleading orders of\nthe JWKB Ans\\\"atze. We explore these results in several notable examples in\nLorentzian and metric-affine spacetimes, illustrating the reach of our\nderivations in general relativity, reduced Horndeski theories, spacetimes with\ncompletely antisymmetric torsion and Weyl spacetimes. The formalism presented\nherein lays the groundwork for the study of rays associated with different\ntypes of waves in curved spacetimes and provides the tools to compute\nmodifications to their brightness evolution laws, consequential distance\nduality relations, and beyond geometrical optics phenomena.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8tGvRZOaa2XhC35UFrMa40G_iXrbylRyvJ2jeWjFX2Y","pdfSize":"753380"}
