{"id":"2407.09609","title":"Chebyshev approximation and composition of functions in matrix product\n  states for quantum-inspired numerical analysis","authors":"Juan Jos\\'e Rodr\\'iguez-Aldavero, Paula Garc\\'ia-Molina, Luca\n  Tagliacozzo, Juan Jos\\'e Garc\\'ia-Ripoll","authorsParsed":[["Rodríguez-Aldavero","Juan José",""],["García-Molina","Paula",""],["Tagliacozzo","Luca",""],["García-Ripoll","Juan José",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 18:00:06 GMT"}],"updateDate":"2024-07-16","timestamp":1720807206000,"abstract":"  This work explores the representation of univariate and multivariate\nfunctions as matrix product states (MPS), also known as quantized tensor-trains\n(QTT). It proposes an algorithm that employs iterative Chebyshev expansions and\nClenshaw evaluations to represent analytic and highly differentiable functions\nas MPS Chebyshev interpolants. It demonstrates rapid convergence for\nhighly-differentiable functions, aligning with theoretical predictions, and\ngeneralizes efficiently to multidimensional scenarios. The performance of the\nalgorithm is compared with that of tensor cross-interpolation (TCI) and\nmultiscale interpolative constructions through a comprehensive comparative\nstudy. When function evaluation is inexpensive or when the function is not\nanalytical, TCI is generally more efficient for function loading. However, the\nproposed method shows competitive performance, outperforming TCI in certain\nmultivariate scenarios. Moreover, it shows advantageous scaling rates and\ngeneralizes to a wider range of tasks by providing a framework for function\ncomposition in MPS, which is useful for non-linear problems and many-body\nstatistical physics.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_9cnlVYOISqgHBF_9DMHiq_XHZcUIGQyEeE0G-mHLNE","pdfSize":"1349673","objectId":"0xcabfc85f81465e5dc26840dab62867f745afcea75eae2032250afceb9a1ce0f9","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
