{"id":"2407.10500","title":"AirDnD -- Asynchronous In-Range Dynamic and Distributed Network\n  Orchestration Framework","authors":"Malsha Ashani Mahawatta Dona, Christian Berger, Yinan Yu","authorsParsed":[["Dona","Malsha Ashani Mahawatta",""],["Berger","Christian",""],["Yu","Yinan",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 07:43:56 GMT"}],"updateDate":"2024-07-16","timestamp":1721029436000,"abstract":"  The increasing usage of IoT devices has generated an extensive volume of data\nwhich resulted in the establishment of data centers with well-structured\ncomputing infrastructure. Reducing underutilized resources of such data centers\ncan be achieved by monitoring the tasks and offloading them across various\ncompute units. This approach can also be used in mini mobile data ponds\ngenerated by edge devices and smart vehicles. This research aims to improve and\nutilize the usage of computing resources in distributed edge devices by forming\na dynamic mesh network. The nodes in the mesh network shall share their\ncomputing tasks with another node that possesses unused computing resources.\nThis proposed method ensures the minimization of data transfer between\nentities. The proposed AirDnD vision will be applied to a practical scenario\nrelevant to an autonomous vehicle that approaches an intersection commonly\nknown as ``looking around the corner'' in related literature, collecting\nessential computational results from nearby vehicles to enhance its perception.\nThe proposed solution consists of three models that transform growing amounts\nof geographically distributed edge devices into a living organism.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"aUTQ1hZLjMHGueECbaE19WN8hxGwGn9t_k-nlA84KHc","pdfSize":"236835","objectId":"0xae683055a0a1a61d25339a4dee32f6f39a0d50f40373d845be90af4ec9e21290","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
