{"id":"2407.13170","title":"Unified-EGformer: Exposure Guided Lightweight Transformer for\n  Mixed-Exposure Image Enhancement","authors":"Eashan Adhikarla, Kai Zhang, Rosaura G. VidalMata, Manjushree Aithal,\n  Nikhil Ambha Madhusudhana, John Nicholson, Lichao Sun, Brian D. Davison","authorsParsed":[["Adhikarla","Eashan",""],["Zhang","Kai",""],["VidalMata","Rosaura G.",""],["Aithal","Manjushree",""],["Madhusudhana","Nikhil Ambha",""],["Nicholson","John",""],["Sun","Lichao",""],["Davison","Brian D.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 05:18:43 GMT"}],"updateDate":"2024-07-19","timestamp":1721279923000,"abstract":"  Despite recent strides made by AI in image processing, the issue of mixed\nexposure, pivotal in many real-world scenarios like surveillance and\nphotography, remains inadequately addressed. Traditional image enhancement\ntechniques and current transformer models are limited with primary focus on\neither overexposure or underexposure. To bridge this gap, we introduce the\nUnified-Exposure Guided Transformer (Unified-EGformer). Our proposed solution\nis built upon advanced transformer architectures, equipped with local\npixel-level refinement and global refinement blocks for color correction and\nimage-wide adjustments. We employ a guided attention mechanism to precisely\nidentify exposure-compromised regions, ensuring its adaptability across various\nreal-world conditions. U-EGformer, with a lightweight design featuring a memory\nfootprint (peak memory) of only $\\sim$1134 MB (0.1 Million parameters) and an\ninference time of 95 ms (9.61x faster than the average), is a viable choice for\nreal-time applications such as surveillance and autonomous navigation.\nAdditionally, our model is highly generalizable, requiring minimal fine-tuning\nto handle multiple tasks and datasets with a single architecture.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"ZG615SEeeHa-ys-F7O7K8CiqUHEdWQE99x6e1X2ORm4","pdfSize":"13286077","objectId":"0x5636bd51d1bc77f61d44648ab8efb6430a557c004f7b84d13a8856b5f0aa9c2d","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
