{"id":"2407.14353","title":"Human-in-the-loop MGA to generate energy system design options matching\n  stakeholder needs","authors":"Francesco Lombardi, Stefan Pfenninger","authorsParsed":[["Lombardi","Francesco",""],["Pfenninger","Stefan",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 14:34:55 GMT"}],"updateDate":"2024-07-22","timestamp":1721399695000,"abstract":"  Using cost-optimisation to support energy system design decisions hides from\nview many more feasible designs that, while economically comparable to the\nleast-cost option, may have other practical advantages that stakeholders\nprefer. Increasingly, modellers look at Modelling to generate alternatives\n(MGA) as a way to go beyond few, optimal designs and provide stakeholders with\nbroad portfolios of design options to appraise based on their preferences and\nknowledge of the problem. In practice, however, generating and exploring all\nthe feasible system design options is not computationally possible. Modellers\nneed to choose what design feature to generate diversity around, and yet, they\ncannot know what features may matter the most to heterogeneous real-world\nstakeholders. Stakeholders' knowledge is thus needed to guide the MGA search\ntowards the most important trade-offs, but how to incorporate such knowledge in\nthe MGA workflow is unclear. To address this gap, we propose a\nfirst-of-its-kind human-in-the-loop (HITL) approach that seamlessly and\nautomatically integrates stakeholder preferences into an MGA workflow. In a\nnutshell, we elicit stakeholders' system design preferences via a first\ninteraction between them and a tentative MGA design space. Hence, we decode\nthose preferences so that it becomes possible to feed them back to the MGA\nalgorithm to perform a guided search. This search produces an updated,\nhuman-trained design space with a higher share of designs that align with the\nelicited preferences. In a controlled experiment for the case study of the\nPortuguese energy system, we demonstrate that our HITL-MGA approach may\nfacilitate the identification of a consensus solution that balances many\nconflicting stakeholder preferences. The approach shows promise for\ngeneralisation and real-world application to accelerate technically and\nsocially feasible energy transition decisions.\n","subjects":["Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Gove00Mcbt3elvD4uPCUC7ZRda6OjwjC-fACNfW0q50","pdfSize":"5217072","objectId":"0x5172e70e7d09576fa4fbe9cd78a7e923601564be81d7e2447ec3d2e66ac73ffc","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
