{"id":"2407.17347","title":"AI Emergency Preparedness: Examining the federal government's ability to\n  detect and respond to AI-related national security threats","authors":"Akash Wasil, Everett Smith, Corin Katzke, Justin Bullock","authorsParsed":[["Wasil","Akash",""],["Smith","Everett",""],["Katzke","Corin",""],["Bullock","Justin",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 17:54:01 GMT"},{"version":"v2","created":"Sat, 27 Jul 2024 15:49:58 GMT"}],"updateDate":"2024-07-30","timestamp":1720029241000,"abstract":"  We examine how the federal government can enhance its AI emergency\npreparedness: the ability to detect and prepare for time-sensitive national\nsecurity threats relating to AI. Emergency preparedness can improve the\ngovernment's ability to monitor and predict AI progress, identify national\nsecurity threats, and prepare effective response plans for plausible threats\nand worst-case scenarios. Our approach draws from fields in which experts\nprepare for threats despite uncertainty about their exact nature or timing\n(e.g., counterterrorism, cybersecurity, pandemic preparedness). We focus on\nthree plausible risk scenarios: (1) loss of control (threats from a powerful AI\nsystem that becomes capable of escaping human control), (2) cybersecurity\nthreats from malicious actors (threats from a foreign actor that steals the\nmodel weights of a powerful AI system), and (3) biological weapons\nproliferation (threats from users identifying a way to circumvent the\nsafeguards of a publicly-released model in order to develop biological\nweapons.) We evaluate the federal government's ability to detect, prevent, and\nrespond to these threats. Then, we highlight potential gaps and offer\nrecommendations to improve emergency preparedness. We conclude by describing\nhow future work on AI emergency preparedness can be applied to improve\npolicymakers' understanding of risk scenarios, identify gaps in detection\ncapabilities, and form preparedness plans to improve the effectiveness of\nfederal responses to AI-related national security threats.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VHrCMS0taU-IQ7ZocBPQbchSDy525bjXrghSVXsWkU8","pdfSize":"265161","objectId":"0xd2f78997bf51d9f1392c3a9acf12d3a7b92460728cd92278a64c1a5bc141e8dc","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
