{"id":"2407.11771","title":"XEdgeAI: A Human-centered Industrial Inspection Framework with\n  Data-centric Explainable Edge AI Approach","authors":"Truong Thanh Hung Nguyen, Phuc Truong Loc Nguyen, Hung Cao","authorsParsed":[["Nguyen","Truong Thanh Hung",""],["Nguyen","Phuc Truong Loc",""],["Cao","Hung",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:30:24 GMT"}],"updateDate":"2024-07-17","timestamp":1721140224000,"abstract":"  Recent advancements in deep learning have significantly improved visual\nquality inspection and predictive maintenance within industrial settings.\nHowever, deploying these technologies on low-resource edge devices poses\nsubstantial challenges due to their high computational demands and the inherent\ncomplexity of Explainable AI (XAI) methods. This paper addresses these\nchallenges by introducing a novel XAI-integrated Visual Quality Inspection\nframework that optimizes the deployment of semantic segmentation models on\nlow-resource edge devices. Our framework incorporates XAI and the Large Vision\nLanguage Model to deliver human-centered interpretability through visual and\ntextual explanations to end-users. This is crucial for end-user trust and model\ninterpretability. We outline a comprehensive methodology consisting of six\nfundamental modules: base model fine-tuning, XAI-based explanation generation,\nevaluation of XAI approaches, XAI-guided data augmentation, development of an\nedge-compatible model, and the generation of understandable visual and textual\nexplanations. Through XAI-guided data augmentation, the enhanced model\nincorporating domain expert knowledge with visual and textual explanations is\nsuccessfully deployed on mobile devices to support end-users in real-world\nscenarios. Experimental results showcase the effectiveness of the proposed\nframework, with the mobile model achieving competitive accuracy while\nsignificantly reducing model size. This approach paves the way for the broader\nadoption of reliable and interpretable AI tools in critical industrial\napplications, where decisions must be both rapid and justifiable.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Tsew3x5pNttKK1TBcujWYrtHSQuqvKEHBFYBWwFxjLU","pdfSize":"45603083","objectId":"0x41994fa56da416389564ddc5d42169d86a80d17dd9ded1124e78096da135d66f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
