{"id":"2407.12804","title":"Modulating Language Model Experiences through Frictions","authors":"Katherine M. Collins, Valerie Chen, Ilia Sucholutsky, Hannah Rose\n  Kirk, Malak Sadek, Holli Sargeant, Ameet Talwalkar, Adrian Weller, Umang\n  Bhatt","authorsParsed":[["Collins","Katherine M.",""],["Chen","Valerie",""],["Sucholutsky","Ilia",""],["Kirk","Hannah Rose",""],["Sadek","Malak",""],["Sargeant","Holli",""],["Talwalkar","Ameet",""],["Weller","Adrian",""],["Bhatt","Umang",""]],"versions":[{"version":"v1","created":"Mon, 24 Jun 2024 16:31:11 GMT"}],"updateDate":"2024-07-19","timestamp":1719246671000,"abstract":"  Language models are transforming the ways that their users engage with the\nworld. Despite impressive capabilities, over-consumption of language model\noutputs risks propagating unchecked errors in the short-term and damaging human\ncapabilities for critical thinking in the long-term, particularly in\nknowledge-based tasks. How can we develop scaffolding around language models to\ncurate more appropriate use? We propose selective frictions for language model\nexperiences, inspired by behavioral science interventions, to dampen misuse.\nFrictions involve small modifications to a user's experience, e.g., the\naddition of a button impeding model access and reminding a user of their\nexpertise relative to the model. Through a user study with real humans, we\nobserve shifts in user behavior from the imposition of a friction over LLMs in\nthe context of a multi-topic question-answering task as a representative task\nthat people may use LLMs for, e.g., in education and information retrieval. We\nfind that frictions modulate over-reliance by driving down users' click rates\nwhile minimally affecting accuracy for those topics. Yet, frictions may have\nunintended effects. We find marked differences in users' click behaviors even\non topics where frictions were not provisioned. Our contributions motivate\nfurther study of human-AI behavioral interaction to inform more effective and\nappropriate LLM use.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3gZ9wJzbmnC0ADv8z7sA7AS9VoJ8jmamRyri8DGpiJU","pdfSize":"1892746","objectId":"0x1f7dd66a6102a927232ea98aa8cd881494689d6c5b609d532f1445b858b46e66","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
