{"id":"2407.15443","title":"GRASIAN: Shaping and characterization of the cold hydrogen and deuterium\n  beams for the forthcoming first demonstration of gravitational quantum states\n  of atoms","authors":"Carina Killian, Philipp Blumer, Paolo Crivelli, Daniel Kloppenburg,\n  Francois Nez, Valery Nesvizhevsky, Serge Reynaud, Katharina Schreiner, Martin\n  Simon, Sergey Vasiliev, Eberhard Widmann, Pauline Yzombard","authorsParsed":[["Killian","Carina",""],["Blumer","Philipp",""],["Crivelli","Paolo",""],["Kloppenburg","Daniel",""],["Nez","Francois",""],["Nesvizhevsky","Valery",""],["Reynaud","Serge",""],["Schreiner","Katharina",""],["Simon","Martin",""],["Vasiliev","Sergey",""],["Widmann","Eberhard",""],["Yzombard","Pauline",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 07:49:21 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 12:09:31 GMT"}],"updateDate":"2024-09-16","timestamp":1721634561000,"abstract":"  A low energy particle confined by a horizontal reflective surface and gravity\nsettles in gravitationally bound quantum states. These gravitational quantum\nstates (GQS) were so far only observed with neutrons. However, the existence of\nGQS is predicted also for atoms. The GRASIAN collaboration pursues the first\nobservation of GQS of atoms, using a cryogenic hydrogen beam. This endeavor is\nmotivated by the higher densities, which can be expected from hydrogen compared\nto neutrons, the easier access, the fact that GQS were never observed with\natoms and the accessibility to hypothetical short range interactions. In\naddition to enabling gravitational quantum spectroscopy, such a cryogenic\nhydrogen beam with very low vertical velocity components - a few cm s$^{-1}$,\ncan be used for precision optical and microwave spectroscopy. In this article,\nwe report on our methods developed to reduce background and to detect atoms\nwith a low horizontal velocity, which are needed for such an experiment. Our\nrecent measurement results on the collimation of the hydrogen beam to 2 mm, the\nreduction of background and improvement of signal-to-noise and finally our\nfirst detection of atoms with velocities < 72 m s$^{-1}$ are presented.\nFurthermore, we show calculations, estimating the feasibility of the planned\nexperiment and simulations which confirm that we can select vertical velocity\ncomponents in the order of cm s$^{-1}$.\n","subjects":["Physics/Atomic Physics","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"McLdboOePEpshrAmD1HUDBfec2X1ujjmExoKwTUwOec","pdfSize":"37848780","objectId":"0x188d7f2bf9356ed14b11aaea8035ab050ea4e219e2370844908d37d811a4fb47","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
