{"id":"2407.05771","title":"Multi-times Monte Carlo Rendering for Inter-reflection Reconstruction","authors":"Tengjie Zhu, Zhuo Chen, Jingnan Gao, Yichao Yan, Xiaokang Yang","authorsParsed":[["Zhu","Tengjie",""],["Chen","Zhuo",""],["Gao","Jingnan",""],["Yan","Yichao",""],["Yang","Xiaokang",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 09:27:34 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 14:01:34 GMT"}],"updateDate":"2024-08-08","timestamp":1720430854000,"abstract":"  Inverse rendering methods have achieved remarkable performance in\nreconstructing high-fidelity 3D objects with disentangled geometries,\nmaterials, and environmental light. However, they still face huge challenges in\nreflective surface reconstruction. Although recent methods model the light\ntrace to learn specularity, the ignorance of indirect illumination makes it\nhard to handle inter-reflections among multiple smooth objects. In this work,\nwe propose Ref-MC2 that introduces the multi-time Monte Carlo sampling which\ncomprehensively computes the environmental illumination and meanwhile considers\nthe reflective light from object surfaces. To address the computation challenge\nas the times of Monte Carlo sampling grow, we propose a specularity-adaptive\nsampling strategy, significantly reducing the computational complexity. Besides\nthe computational resource, higher geometry accuracy is also required because\ngeometric errors accumulate multiple times. Therefore, we further introduce a\nreflection-aware surface model to initialize the geometry and refine it during\ninverse rendering. We construct a challenging dataset containing scenes with\nmultiple objects and inter-reflections. Experiments show that our method\noutperforms other inverse rendering methods on various object groups. We also\nshow downstream applications, e.g., relighting and material editing, to\nillustrate the disentanglement ability of our method.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"M3YF4UtCsW_KfMYR7TPIsFc4hh3k8MSiraKixLtIr6w","pdfSize":"9930778"}
