{"id":"2407.16862","title":"Blockchain security for ransomware detection","authors":"Elodie Ngoie Mutombo and Mike Wa Nkongolo","authorsParsed":[["Mutombo","Elodie Ngoie",""],["Nkongolo","Mike Wa",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 22:04:41 GMT"}],"updateDate":"2024-07-25","timestamp":1721772281000,"abstract":"  Blockchain networks are critical for safeguarding digital transactions and\nassets, but they are increasingly targeted by ransomware attacks exploiting\nzero-day vulnerabilities. Traditional detection techniques struggle due to the\ncomplexity of these exploits and the lack of comprehensive datasets. The\nUGRansome dataset addresses this gap by offering detailed features for\nanalysing ransomware and zero-day attacks, including timestamps, attack types,\nprotocols, network flows, and financial impacts in bitcoins (BTC). This study\nuses the Lazy Predict library to automate machine learning (ML) on the\nUGRansome dataset. The study aims to enhance blockchain security through\nransomware detection based on zero-day exploit recognition using the UGRansome\ndataset. Lazy Predict streamlines different ML model comparisons and identifies\neffective algorithms for threat detection. Key features such as timestamps,\nprotocols, and financial data are used to predict anomalies as zero-day threats\nand to classify known signatures as ransomware. Results demonstrate that ML can\nsignificantly improve cybersecurity in blockchain environments. The\nDecisionTreeClassifier and ExtraTreeClassifier, with their high performance and\nlow training times, are ideal candidates for deployment in real-time threat\ndetection systems.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QJeDT7K5SlmH2FvDAvNB5iGoWwOO1jF_K2_MLIj3-ng","pdfSize":"1628207","objectId":"0x2fabdafd8c7ec2723d5928d8852cd8da25d6036be7df98bad4dc2b54aeae382e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
