{"id":"2407.15858","title":"Is there something missing from the Antikythera Mechanism? Was it a\n  mechanical Planetarium, positioner? or a Luni solar Time calculator device?\n  Reconstructing the lost parts of b1 gear and its Cover Disc","authors":"Aristeidis Voulgaris, Christophoros Mouratidis, Andreas Vossinakis and\n  Manos Roumeliotis","authorsParsed":[["Voulgaris","Aristeidis",""],["Mouratidis","Christophoros",""],["Vossinakis","Andreas",""],["Roumeliotis","Manos",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 20:25:46 GMT"}],"updateDate":"2024-07-24","timestamp":1720470346000,"abstract":"  We present the observations and the results of our experience from a large\nnumber of flight hours in constructing, handling, testing, studying and\ninteracting with our Antikythera Mechanism functional reconstruction models. We\nconstructed our models according to the X Ray tomographies and without any use\nof modern stabilization parts (screws, nuts etc). Simple typical bronze\nmaterial (not with special alloys) was used in the construction, while (most\nof) the gears were cut from simple bronze discs with thickness about 2mm and\nwith triangular shaped teeth (not in modern involute shape). The bronze (not\niron or steel) shafts have dimensions conforming to the original parts of the\nancient artifact. The assembly of the parts was done following careful study of\nthe Personal Constructional Characteristics and the Design Style of the ancient\nCraftsman, which are visible or even hidden on the Antikythera Mechanism\nFragments. During the extensive use of our models, it was concluded that two\nimportant and mandatory indicators are missing from all current reconstructions\nof the Antikythera Mechanism. The absence of these two indicator dials makes it\ndifficult to properly operate the Mechanism and their existence is necessary,\nin order for the Antikythera Mechanism to be considered as a complete and self\ncontained operational time measuring device. The two procedures related to the\n(poorly) preserved remains were located on gear b1 and the lost Cover Disc of\nthe b1 gear. The reconstruction of those missing parts was achieved by paying\nspecial attention to the Personal Constructional Characteristics of the ancient\nCraftsman. The extensive analysis of the Antikythera Mechanism calibrated\nscales leads to the understanding of the Mechanism as a luni solar time\nmeasuring device, as opposed to the notion that it was a mechanical planetarium\npresenting the hypothesized planetary motions and positions.\n","subjects":["Physics/History and Philosophy of Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fnc7YYsPrMx9lkor0wa5yadgLNkCVFMf168RHujIRQg","pdfSize":"2736150","objectId":"0x5771882ec45475454af4f312f326dcaeeb7b0ccec23753eb408033ecc33249e0","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
