{"id":"2407.15164","title":"Theoretical Study on the Structural and Thermodynamic Properties of U-He\n  compounds under High Pressure","authors":"Ye Cao, Hongxing Song, Xiaozhen Yan, Hao Wang, Yufeng Wang, Fengchao\n  Wu, Leilei Zhang, Qiang Wu, Hua Y. Geng","authorsParsed":[["Cao","Ye",""],["Song","Hongxing",""],["Yan","Xiaozhen",""],["Wang","Hao",""],["Wang","Yufeng",""],["Wu","Fengchao",""],["Zhang","Leilei",""],["Wu","Qiang",""],["Geng","Hua Y.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 13:39:42 GMT"}],"updateDate":"2024-07-23","timestamp":1721569182000,"abstract":"  Uranium is considered as a very important nuclear energy material because of\nthe huge amount of energy released. As the main products of spontaneous decay\nof uranium, helium is difficult to react with uranium for its chemical\ninertness. Therefore, bubbles will be formed inside uranium, which could\ngreatly reduce the performance of uranium or cause the safety problems.\nAdditionally, nuclear materials are usually operated in an environment of\nhigh-temperature and high-pressure, so it is necessary to figure out the exact\nstate of helium inside uranium at extreme conditions. Here, we explored the\nstructural stability of U-He system under high-pressure and high-temperature by\nusing density functional theory calculations. Two metastable phases are found\nbetween 50 and 400 GPa: U4He with space group Fmmm and U6He with space group\nP-1. Both are metallic and adopt layered structures. Electron localization\nfunction calculation combined with charge density difference analysis indicate\nthat there are covalent bonds between U and U atoms in both Fmmm-U4He and\nP-1-U6He. Compared with the elastic modulus of ${\\alpha}$-U, the addition of\nhelium has certain influence on the mechanical properties of uranium. Besides,\nfirst-principles molecular dynamics simulations were carried out to study the\ndynamical behavior of Fmmm-U4He and P-1-U6He at high-temperature. It is found\nthat Fmmm-U4He and P-1-U6He undergo one-dimensional superionic phase\ntransitions at 150 GPa. Our study revealed exotic structure of U-He compounds\nbeyond the form of bubble under high-pressure and high-temperature, that might\nbe relevant to the performance and safety issue of nuclear materials at extreme\nconditions.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KiIlYChQpd907JCoB3Df8VZhf10VHSJNkzbvLZpzc48","pdfSize":"4170776","objectId":"0x883a5e161dcf0c7929377884b99b5469a02454cecbe1c0bcfc1004336cca517d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
