{"id":"2407.17746","title":"Phonon dispersion of nanoscale honeycomb phononic crystal: gigahertz and\n  terahertz spectroscopy comparison","authors":"Michele Diego, Roman Anufriev, Ryoto Yanagisawa and Masahiro Nomura","authorsParsed":[["Diego","Michele",""],["Anufriev","Roman",""],["Yanagisawa","Ryoto",""],["Nomura","Masahiro",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 03:43:57 GMT"}],"updateDate":"2024-07-26","timestamp":1721879037000,"abstract":"  Phonons-quantized vibrational modes in crystalline structures-govern\nphenomena ranging from thermal and mechanical transport to quantum mechanics.\nIn recent years, a new class of artificial materials called phononic crystals\nhas emerged, aiming to control phononic properties. These materials are created\nby introducing a superlattice structure on top of an already-existing atomic\nlattice. Typically, phononic crystals are described using a continuous model,\nin which effective elastic constants approximate potentials between atoms. This\napproximation, however, assumes the wavelengths of vibrations to be\nsignificantly greater than the interatomic distance. In this work, we\nexperimentally investigate the behavior of a honeycomb silicon phononic crystal\nin the gigahertz range, where the continuum approximation holds, and in the\nterahertz range, where the phonon wavelengths are comparable to interatomic\ndistances. Using Brillouin light scattering, we investigate the phonon\ndispersion of the phononic crystal in the gigahertz range, finding a close\nmatch with simulations based on the continuous model. Conversely, Raman\nspectroscopy reveals no difference between the phononic crystal, an unpatterned\nmembrane, and a bulk silicon structure in the terahertz range, showing that the\ncontinuous model no longer holds at these higher frequencies.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"HrqX4Jj0CFY1qdqZY42o1nAVCROpO-z_GFmsA9rjzEk","pdfSize":"3135352","objectId":"0x304fd5d0b5d4846d8d1ad45bcbdfc9dd9fef4cc32ce51afe39d3b841eed2a8d0","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
