{"id":"2407.15338","title":"Revealing the molecular structures of a-Al2O3(0001)-water interface by\n  machine learning based computational vibrational spectroscopy","authors":"Xianglong Du, Weizhi Shao, Chenglong Bao, Linfeng Zhang, Jun Cheng,\n  Fujie Tang","authorsParsed":[["Du","Xianglong",""],["Shao","Weizhi",""],["Bao","Chenglong",""],["Zhang","Linfeng",""],["Cheng","Jun",""],["Tang","Fujie",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 02:52:22 GMT"},{"version":"v2","created":"Tue, 10 Sep 2024 02:28:43 GMT"}],"updateDate":"2024-09-11","timestamp":1721616742000,"abstract":"  Solid-water interfaces are crucial to many physical and chemical processes\nand are extensively studied using surface-specific sum-frequency generation\n(SFG) spectroscopy. To establish clear correlations between specific spectral\nsignatures and distinct interfacial water structures, theoretical calculations\nusing molecular dynamics (MD) simulations are required. These MD simulations\ntypically need relatively long trajectories (a few nanoseconds) to achieve\nreliable SFG response function calculations via the dipole-polarizability time\ncorrelation function. However, the requirement for long trajectories limits the\nuse of computationally expensive techniques such as ab initio MD (AIMD)\nsimulations, particularly for complex solid-water interfaces. In this work, we\npresent a pathway for calculating vibrational spectra (IR, Raman, SFG) of\nsolid-water interfaces using machine learning (ML)-accelerated methods. We\nemploy both the dipole moment-polarizability correlation function and the\nsurface-specific velocity-velocity correlation function approaches to calculate\nSFG spectra. Our results demonstrate the successful acceleration of AIMD\nsimulations and the calculation of SFG spectra using ML methods. This\nadvancement provides an opportunity to calculate SFG spectra for the\ncomplicated solid-water systems more rapidly and at a lower computational cost\nwith the aid of ML.\n","subjects":["Condensed Matter/Materials Science","Physics/Chemical Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UVth8ujbWEyp-jv5u0sNsaNz2-WYBPKACCDdHnAsY8w","pdfSize":"2099591","objectId":"0xce9151a4d28b6f500da9eca278e39445c912b909ea7d8b34d7f8a5e84133c0c2","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
