{"id":"2407.07554","title":"Beat-It: Beat-Synchronized Multi-Condition 3D Dance Generation","authors":"Zikai Huang, Xuemiao Xu, Cheng Xu, Huaidong Zhang, Chenxi Zheng, Jing\n  Qin, Shengfeng He","authorsParsed":[["Huang","Zikai",""],["Xu","Xuemiao",""],["Xu","Cheng",""],["Zhang","Huaidong",""],["Zheng","Chenxi",""],["Qin","Jing",""],["He","Shengfeng",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 11:29:25 GMT"}],"updateDate":"2024-07-11","timestamp":1720610965000,"abstract":"  Dance, as an art form, fundamentally hinges on the precise synchronization\nwith musical beats. However, achieving aesthetically pleasing dance sequences\nfrom music is challenging, with existing methods often falling short in\ncontrollability and beat alignment. To address these shortcomings, this paper\nintroduces Beat-It, a novel framework for beat-specific, key pose-guided dance\ngeneration. Unlike prior approaches, Beat-It uniquely integrates explicit beat\nawareness and key pose guidance, effectively resolving two main issues: the\nmisalignment of generated dance motions with musical beats, and the inability\nto map key poses to specific beats, critical for practical choreography. Our\napproach disentangles beat conditions from music using a nearest beat distance\nrepresentation and employs a hierarchical multi-condition fusion mechanism.\nThis mechanism seamlessly integrates key poses, beats, and music features,\nmitigating condition conflicts and offering rich, multi-conditioned guidance\nfor dance generation. Additionally, a specially designed beat alignment loss\nensures the generated dance movements remain in sync with the designated beats.\nExtensive experiments confirm Beat-It's superiority over existing\nstate-of-the-art methods in terms of beat alignment and motion controllability.\n","subjects":["Computing Research Repository/Graphics","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"meXywZcPQuYmc9_4oXEUNMvi3DArPqIlqyVpPCAZNdY","pdfSize":"4679812","objectId":"0xb139e6bdfe00638684881dc7e50f66cc0e8a02f5b2d52ea892af314811f082d6","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
