{"id":"2407.10720","title":"Semantic Units: Increasing Expressivity and Simplicity of Formal\n  Representations of Data and Knowledge in Knowledge Graphs","authors":"Lars Vogt","authorsParsed":[["Vogt","Lars",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 13:47:32 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 08:24:29 GMT"}],"updateDate":"2024-09-18","timestamp":1721051252000,"abstract":"  Knowledge graphs and ontologies are becoming increasingly vital as they align\nwith the FAIR Guiding Principles (Findable, Accessible, Interoperable,\nReusable). We address eleven challenges that may impede the full realization of\nthe potential of FAIR knowledge graphs, as conventional solutions are perceived\nto be overly complex and lacking in cognitive interoperability. We extend the\nconcept of \"semantic units\" as a conceptual solution by adding further\nsubcategories. Semantic units structure a knowledge graph into identifiable and\nsemantically meaningful subgraphs, with each subgraph being represented by a\nresource that instantiates a semantic unit class. We introduce some-instance,\nmost-instances, every-instance, and all-instances resources as new types of\nrepresentational entities in addition to named-individual, class, and property\nresources. We combine these new resource types with the concept of semantic\nunits and introduce new subcategories of statement units and semantically\nmeaningful collections of statement units (i.e., compound units) that provide\nsolutions to the eleven challenges. These include, for instance, schemes for\nmodelling assertional, contingent, prototypical, and universal statements,\nincluding class axioms, as well as absence statements, negations, and\ncardinality restrictions. The schemes are alternatives to existing OWL-based\nmodelling schemes, and we provide corresponding representations for them that\ndo not involve blank nodes. With question units we also introduce a way of\nrepresenting questions in a knowledge graph that can be made readily executable\nas graph queries. We also provide schemes for directive statements, directive\nconditional statements, and logical arguments. We argue that semantic units\nprovide a framework that increases the overall expressivity and cognitive\ninteroperability of knowledge graphs compared to conventional OWL-based\nsolutions.\n","subjects":["Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ujghizb7SGyE-OKanvNG14boFeRV5eaNfodXccwFux8","pdfSize":"2963700","objectId":"0xed18f910a182874464602457d9c8567a6310f972bb9f341c1b4bc76ff5e5cef4","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
