{"id":"2407.17441","title":"Gender disparities in the dissemination and acquisition of scientific\n  knowledge","authors":"Chiara Zappal\\`a, Luca Gallo, Jan Bachmann, Federico Battiston, Fariba\n  Karimi","authorsParsed":[["Zappalà","Chiara",""],["Gallo","Luca",""],["Bachmann","Jan",""],["Battiston","Federico",""],["Karimi","Fariba",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 17:18:54 GMT"}],"updateDate":"2024-07-25","timestamp":1721841534000,"abstract":"  Recent research has challenged the widespread belief that gender inequities\nin academia would disappear simply by increasing the number of women. More\ncomplex causes might be at play, embodied in the networked structure of\nscientific collaborations. Here, we aim to understand the structural inequality\nbetween male and female scholars in the dissemination of scientific knowledge.\nWe use a large-scale dataset of academic publications from the American\nPhysical Society (APS) to build a time-varying network of collaborations from\n1970 to 2020. We model knowledge dissemination as a contagion process in which\nscientists become informed based on the propagation of knowledge through their\ncollaborators. We quantify the fairness of the system in terms of how women\nacquire and diffuse knowledge compared to men. Our results indicate that\nknowledge acquisition and diffusion are slower for women than expected. We find\nthat the main determinant of women's disadvantage is the gap in the cumulative\nnumber of collaborators, highlighting how time creates structural disadvantages\nthat contribute to marginalize women in physics. Our work sheds light on how\nthe dynamics of scientific collaborations shape gender disparities in knowledge\ndissemination and calls for a deeper understanding on how to intervene to\nimprove fairness and diversity in the scientific community.\n","subjects":["Physics/Physics and Society","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ttCruxJClIToDgLd5PnAeT7b0Yycu1mPEkZhprsT44g","pdfSize":"2340317","objectId":"0x2d42e21307e39b574284da1e13b8f3f169ffec27709416f84ae9bdc8eb866a88","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
