{"id":"2407.06114","title":"Towards Unstructured Unlabeled Optical Mocap: A Video Helps!","authors":"Nicholas Milef, John Keyser, Shu Kong","authorsParsed":[["Milef","Nicholas",""],["Keyser","John",""],["Kong","Shu",""]],"versions":[{"version":"v1","created":"Wed, 15 May 2024 03:45:05 GMT"}],"updateDate":"2024-07-09","timestamp":1715744705000,"abstract":"  Optical motion capture (mocap) requires accurately reconstructing the human\nbody from retroreflective markers, including pose and shape. In a typical mocap\nsetting, marker labeling is an important but tedious and error-prone step.\nPrevious work has shown that marker labeling can be automated by using a\nstructured template defining specific marker placements, but this places\nadditional recording constraints. We propose to relax these constraints and\nsolve for Unstructured Unlabeled Optical (UUO) mocap. Compared to the typical\nmocap setting that either labels markers or places them w.r.t a structured\nlayout, markers in UUO mocap can be placed anywhere on the body and even on one\nspecific limb (e.g., right leg for biomechanics research), hence it is of more\npractical significance. It is also more challenging. To solve UUO mocap, we\nexploit a monocular video captured by a single RGB camera, which does not\nrequire camera calibration. On this video, we run an off-the-shelf method to\nreconstruct and track a human individual, giving strong visual priors of human\nbody pose and shape. With both the video and UUO markers, we propose an\noptimization pipeline towards marker identification, marker labeling, human\npose estimation, and human body reconstruction. Our technical novelties include\nmultiple hypothesis testing to optimize global orientation, and marker\nlocalization and marker-part matching to better optimize for body surface. We\nconduct extensive experiments to quantitatively compare our method against\nstate-of-the-art approaches, including marker-only mocap and video-only human\nbody/shape reconstruction. Experiments demonstrate that our method resoundingly\noutperforms existing methods on three established benchmark datasets for both\nfull-body and partial-body reconstruction.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"_uM12xatuDL8WtWQl0uaS90EVE7NKR62x-gD_R07HTU","pdfSize":"8804138"}
