{"id":"2407.16864","title":"Integrating Biological Data into Autonomous Remote Sensing Systems for\n  In Situ Imageomics: A Case Study for Kenyan Animal Behavior Sensing with\n  Unmanned Aerial Vehicles (UAVs)","authors":"Jenna M. Kline and Maksim Kholiavchenko and Otto Brookes and Tanya\n  Berger-Wolf and Charles V. Stewart and Christopher Stewart","authorsParsed":[["Kline","Jenna M.",""],["Kholiavchenko","Maksim",""],["Brookes","Otto",""],["Berger-Wolf","Tanya",""],["Stewart","Charles V.",""],["Stewart","Christopher",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 22:16:01 GMT"}],"updateDate":"2024-07-25","timestamp":1721772961000,"abstract":"  In situ imageomics leverages machine learning techniques to infer biological\ntraits from images collected in the field, or in situ, to study individuals\norganisms, groups of wildlife, and whole ecosystems. Such datasets provide\nreal-time social and environmental context to inferred biological traits, which\ncan enable new, data-driven conservation and ecosystem management. The\ndevelopment of machine learning techniques to extract biological traits from\nimages are impeded by the volume and quality data required to train these\nmodels. Autonomous, unmanned aerial vehicles (UAVs), are well suited to collect\nin situ imageomics data as they can traverse remote terrain quickly to collect\nlarge volumes of data with greater consistency and reliability compared to\nmanually piloted UAV missions. However, little guidance exists on optimizing\nautonomous UAV missions for the purposes of remote sensing for conservation and\nbiodiversity monitoring. The UAV video dataset curated by KABR: In-Situ Dataset\nfor Kenyan Animal Behavior Recognition from Drone Videos required three weeks\nto collect, a time-consuming and expensive endeavor. Our analysis of KABR\nrevealed that a third of the videos gathered were unusable for the purposes of\ninferring wildlife behavior. We analyzed the flight telemetry data from\nportions of UAV videos that were usable for inferring wildlife behavior, and\ndemonstrate how these insights can be integrated into an autonomous remote\nsensing system to track wildlife in real time. Our autonomous remote sensing\nsystem optimizes the UAV's actions to increase the yield of usable data, and\nmatches the flight path of an expert pilot with an 87% accuracy rate,\nrepresenting an 18.2% improvement in accuracy over previously proposed methods.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ON65FYV82LjcWrkmb4rTEpq_qgW5482jAfcPQkj3Jt8","pdfSize":"1243821","objectId":"0x94e8bc80d81614c0462c13f980a7a939f7cb0007f94c6115106ebb32299ee865","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
