{"id":"2407.14356","title":"Atmosphyre: Modelling Atmospheric Chromatic Dispersion for Multi-Object\n  Spectrographs","authors":"J. Stephan and R. S\\'anchez-Janssen (UK Astronomy Technology Centre)","authorsParsed":[["Stephan","J.","","UK Astronomy Technology Centre"],["Sánchez-Janssen","R.","","UK Astronomy Technology Centre"]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 14:36:18 GMT"}],"updateDate":"2024-07-22","timestamp":1721399778000,"abstract":"  The wavelength dependent refraction of light in the atmosphere causes the\nchromatic dispersion of a target on the focal plane of an instrument. This is\nknown as atmospheric dispersion, with one of the consequences being wavelength\ndependent flux losses which are difficult to minimise, requiring analysis in\nboth instrument design and operations. We present Atmosphyre, a novel python\npackage developed to characterise the impact of atmospheric dispersion on a\nspectrograph, with a focus on fibre multi-object spectrographs (MOS) which will\nbe at the forefront of ground-based astronomy for the next few decades.\n  We show example simulations and provide recommendations for minimising fibre\nMOS flux losses. We conclude that the guiding wavelength should typically be\nbluer than the observing band mid-wavelength, around 25-45% of the way through\nthe band. The aperture should be centred on this wavelength's location on the\nfocal plane. This wavelength/position remains constant for all reasonable\ndeclinations and target hour angles. We also present an application of the\npackage to MOSAIC, the ELT's multi-object spectrograph. We find that\ndifferential losses greater than 10% are unavoidable for 1h observations that\nare a) after a local hour angle of 2.5h, or b) at declinations below -60\ndegrees and above 10 degrees. We identify that the introduction of an\natmospheric dispersion corrector (ADC) would result in the significant\nreduction of spectral distortions, a gain in survey speed for many\nobservations, and enable the implementation of wider visible observing bands;\nas a result, there has been a proposal to adopt ADCs at a positioner level for\nMOSAIC. Future work includes adding field differential refraction to\nAtmosphyre, important for future wide-field multi-object spectrograph projects\nsuch as the proposed WST.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DemS-EIfvrjVarVKjiwag49S3dVEJZ5gbQn7_tpnA7E","pdfSize":"2672320","objectId":"0x420962da5a3b074b11aa73cfa669789f60da6982ee6d30c49f2ae37daddbcf65","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
