{"id":"2407.00912","title":"Unified Dual-Intent Translation for Joint Modeling of Search and\n  Recommendation","authors":"Yuting Zhang, Yiqing Wu, Ruidong Han, Ying Sun, Yongchun Zhu, Xiang\n  Li, Wei Lin, Fuzhen Zhuang, Zhulin An, Yongjun Xu","authorsParsed":[["Zhang","Yuting",""],["Wu","Yiqing",""],["Han","Ruidong",""],["Sun","Ying",""],["Zhu","Yongchun",""],["Li","Xiang",""],["Lin","Wei",""],["Zhuang","Fuzhen",""],["An","Zhulin",""],["Xu","Yongjun",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 02:36:03 GMT"}],"updateDate":"2024-07-02","timestamp":1719801363000,"abstract":"  Recommendation systems, which assist users in discovering their preferred\nitems among numerous options, have served billions of users across various\nonline platforms. Intuitively, users' interactions with items are highly driven\nby their unchanging inherent intents (e.g., always preferring high-quality\nitems) and changing demand intents (e.g., wanting a T-shirt in summer but a\ndown jacket in winter). However, both types of intents are implicitly expressed\nin recommendation scenario, posing challenges in leveraging them for accurate\nintent-aware recommendations. Fortunately, in search scenario, often found\nalongside recommendation on the same online platform, users express their\ndemand intents explicitly through their query words. Intuitively, in both\nscenarios, a user shares the same inherent intent and the interactions may be\ninfluenced by the same demand intent. It is therefore feasible to utilize the\ninteraction data from both scenarios to reinforce the dual intents for joint\nintent-aware modeling. But the joint modeling should deal with two problems: 1)\naccurately modeling users' implicit demand intents in recommendation; 2)\nmodeling the relation between the dual intents and the interactive items. To\naddress these problems, we propose a novel model named Unified Dual-Intents\nTranslation for joint modeling of Search and Recommendation (UDITSR). To\naccurately simulate users' demand intents in recommendation, we utilize real\nqueries from search data as supervision information to guide its generation. To\nexplicitly model the relation among the triplet <inherent intent, demand\nintent, interactive item>, we propose a dual-intent translation propagation\nmechanism to learn the triplet in the same semantic space via embedding\ntranslations. Extensive experiments demonstrate that UDITSR outperforms SOTA\nbaselines both in search and recommendation tasks.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0_K5vclkc0mTGXsxwF9qh2OjZlqhj2ysAciE2CZBIlU","pdfSize":"1006441","objectId":"0xf76ab33ceb6159558276ba4a12eb89ad4dc3cd1eed66400bac43956109e8de44","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
