{"id":"2407.20213","title":"Registering Neural 4D Gaussians for Endoscopic Surgery","authors":"Yiming Huang, Beilei Cui, Ikemura Kei, Jiekai Zhang, Long Bai,\n  Hongliang Ren","authorsParsed":[["Huang","Yiming",""],["Cui","Beilei",""],["Kei","Ikemura",""],["Zhang","Jiekai",""],["Bai","Long",""],["Ren","Hongliang",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 17:42:45 GMT"}],"updateDate":"2024-07-30","timestamp":1722274965000,"abstract":"  The recent advance in neural rendering has enabled the ability to reconstruct\nhigh-quality 4D scenes using neural networks. Although 4D neural reconstruction\nis popular, registration for such representations remains a challenging task,\nespecially for dynamic scene registration in surgical planning and simulation.\nIn this paper, we propose a novel strategy for dynamic surgical neural scene\nregistration. We first utilize 4D Gaussian Splatting to represent the surgical\nscene and capture both static and dynamic scenes effectively. Then, a spatial\naware feature aggregation method, Spatially Weight Cluttering (SWC) is proposed\nto accurately align the feature between surgical scenes, enabling precise and\nrealistic surgical simulations. Lastly, we present a novel strategy of\ndeformable scene registration to register two dynamic scenes. By incorporating\nboth spatial and temporal information for correspondence matching, our approach\nachieves superior performance compared to existing registration methods for\nimplicit neural representation. The proposed method has the potential to\nimprove surgical planning and training, ultimately leading to better patient\noutcomes.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"TAlVovUxgpRZOBpeXQAuBqa04ITr6ndevpuAwxBMvy0","pdfSize":"1109897","objectId":"0xb5bad5a858d69ca98903f621f07587d76d1f09e0df769524a275f9d12364e7bd","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
