{"id":"2407.04709","title":"Efficient 4D Radar Data Auto-labeling Method using LiDAR-based Object\n  Detection Network","authors":"Min-Hyeok Sun, Dong-Hee Paek, Seung-Hyun Song and Seung-Hyun Kong","authorsParsed":[["Sun","Min-Hyeok",""],["Paek","Dong-Hee",""],["Song","Seung-Hyun",""],["Kong","Seung-Hyun",""]],"versions":[{"version":"v1","created":"Mon, 13 May 2024 04:28:06 GMT"}],"updateDate":"2024-07-09","timestamp":1715574486000,"abstract":"  Focusing on the strength of 4D (4-Dimensional) radar, research about robust\n3D object detection networks in adverse weather conditions has gained\nattention. To train such networks, datasets that contain large amounts of 4D\nradar data and ground truth labels are essential. However, the existing 4D\nradar datasets (e.g., K-Radar) lack sufficient sensor data and labels, which\nhinders the advancement in this research domain. Furthermore, enlarging the 4D\nradar datasets requires a time-consuming and expensive manual labeling process.\nTo address these issues, we propose the auto-labeling method of 4D radar tensor\n(4DRT) in the K-Radar dataset. The proposed method initially trains a\nLiDAR-based object detection network (LODN) using calibrated LiDAR point cloud\n(LPC). The trained LODN then automatically generates ground truth labels (i.e.,\nauto-labels, ALs) of the K-Radar train dataset without human intervention. The\ngenerated ALs are used to train the 4D radar-based object detection network\n(4DRODN), Radar Tensor Network with Height (RTNH). The experimental results\ndemonstrate that RTNH trained with ALs has achieved a similar detection\nperformance to the original RTNH which is trained with manually annotated\nground truth labels, thereby verifying the effectiveness of the proposed\nauto-labeling method. All relevant codes will be soon available at the\nfollowing GitHub project: https://github.com/kaist-avelab/K-Radar\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"CgnQHMIM6eyN5E6wz63KJN--fD06CI_oOWs8uOmbExk","pdfSize":"597158"}
