{"id":"2407.17209","title":"Nonverbal Immediacy Analysis in Education: A Multimodal Computational\n  Model","authors":"Uro\\v{s} Petkovi\\'c, Jonas Frenkel, Olaf Hellwich, Rebecca Lazarides","authorsParsed":[["Petković","Uroš",""],["Frenkel","Jonas",""],["Hellwich","Olaf",""],["Lazarides","Rebecca",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 12:09:07 GMT"}],"updateDate":"2024-09-12","timestamp":1721822947000,"abstract":"  This paper introduces a novel computational approach for analyzing nonverbal\nsocial behavior in educational settings. Integrating multimodal behavioral\ncues, including facial expressions, gesture intensity, and spatial dynamics,\nthe model assesses the nonverbal immediacy (NVI) of teachers from RGB classroom\nvideos. A dataset of 400 30-second video segments from German classrooms was\nconstructed for model training and validation. The gesture intensity regressor\nachieved a correlation of 0.84, the perceived distance regressor 0.55, and the\nNVI model 0.44 with median human ratings. The model demonstrates the potential\nto provide a valuable support in nonverbal behavior assessment, approximating\nthe accuracy of individual human raters. Validated against both questionnaire\ndata and trained observer ratings, our models show moderate to strong\ncorrelations with relevant educational outcomes, indicating their efficacy in\nreflecting effective teaching behaviors. This research advances the objective\nassessment of nonverbal communication behaviors, opening new pathways for\neducational research.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sx2wGdqpiIZ0vq78-V4y4swzUEt7DZXB-GV7GeT1KoA","pdfSize":"951767","objectId":"0x472e3e51beeb4ee7a0cfec909b8c2ef6e6fe745cd852f851e143885a538bb94b","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
