{"id":"2407.12080","title":"Isospectrality in Effective Field Theory Extensions of General\n  Relativity","authors":"Pablo A. Cano, Marina David","authorsParsed":[["Cano","Pablo A.",""],["David","Marina",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 18:00:00 GMT"},{"version":"v2","created":"Sun, 28 Jul 2024 14:53:35 GMT"}],"updateDate":"2024-07-30","timestamp":1721152800000,"abstract":"  Two universal predictions of general relativity are the propagation of\ngravitational waves of large momentum along null geodesics and the\nisospectrality of quasinormal modes in many families of black holes. In\nextensions of general relativity, these properties are typically lost:\nquasinormal modes are no longer isospectral and gravitational wave propagation\nis no longer geodesic and it exhibits birefringence -- polarization-dependent\nspeed. We study these effects in an effective-field-theory extension of general\nrelativity with up to eight-derivative terms and show that there is a unique\nLagrangian that has a non-birefringent dispersion relation for gravitational\nwaves and isospectral quasinormal modes in the eikonal limit. We argue that\nboth properties are related through a generalized correspondence between\neikonal quasinormal modes and unstable photon-sphere orbits. These properties\ndefine a special class of theories that we denote as isospectral effective\nfield theories. We note that the lowest-order isospectral correction to general\nrelativity coincides with the quartic-curvature correction arising from type II\nstring theory, suggesting that isospectrality might be a key feature of quantum\ngravity.\n","subjects":["Physics/High Energy Physics - Theory","Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"m4rp3hp5yC0iIy54ik0Qn3BR1d7OgzBQEQBiHw3NGPc","pdfSize":"237617","objectId":"0xec9f205b59921741b35390038307935df6f84c01f1e3cf26a676b3da7aa0d669","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
