{"id":"2407.05207","title":"Review Helpfulness Scores vs. Review Unhelpfulness Scores: Two Sides of\n  the Same Coin or Different Coins?","authors":"Yinan Yu, Dominik Gutt, Warut Khern-am-nuai","authorsParsed":[["Yu","Yinan",""],["Gutt","Dominik",""],["Khern-am-nuai","Warut",""]],"versions":[{"version":"v1","created":"Wed, 24 Apr 2024 10:35:17 GMT"}],"updateDate":"2024-07-16","timestamp":1713954917000,"abstract":"  Evaluating the helpfulness of online reviews supports consumers who must sift\nthrough large volumes of online reviews. Online review platforms have\nincreasingly adopted review evaluating systems, which let users evaluate\nwhether reviews are helpful or not; in turn, these evaluations assist review\nreaders and encourage review contributors. Although review helpfulness scores\nhave been studied extensively in the literature, our knowledge regarding their\ncounterpart, review unhelpfulness scores, is lacking. Addressing this gap in\nthe literature is important because researchers and practitioners have assumed\nthat unhelpfulness scores are driven by intrinsic review characteristics and\nthat such scores are associated with low-quality reviews. This study validates\nthis conventional wisdom by examining factors that influence unhelpfulness\nscores. We find that, unlike review helpfulness scores, unhelpfulness scores\nare generally not driven by intrinsic review characteristics, as almost none of\nthem are statistically significant predictors of an unhelpfulness score. We\nalso find that users who receive review unhelpfulness votes are more likely to\ncast unhelpfulness votes for other reviews. Finally, unhelpfulness voters\nengage much less with the platform than helpfulness voters do. In summary, our\nfindings suggest that review unhelpfulness scores are not driven by intrinsic\nreview characteristics. Therefore, helpfulness and unhelpfulness scores should\nnot be considered as two sides of the same coin.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7-mhLHgTNF0blXoClLdP2Vf8R96pCIUmY07qE8qJujc","pdfSize":"657470"}
