{"id":"2407.15040","title":"Multifaceted thermal regulation in electrochemical batteries using\n  cooling channels and foam-embedded phase change materials","authors":"Mehdi V. Bozorg and Juan F. Torres","authorsParsed":[["Bozorg","Mehdi V.",""],["Torres","Juan F.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 03:16:15 GMT"}],"updateDate":"2024-07-23","timestamp":1721531775000,"abstract":"  Lithium-ion batteries are widely used in electric vehicles and grid energy\nstorage systems. Compared to cylindrical batteries, prismatic cells are the\nprimary choice because of their advantage for dense packing. However, thermal\nrunaway and temperature inhomogeneities are the main thermal regulation\nproblems that affect their reliability, safety, and useful life. Here, we\npropose and assess a multifaceted cooling system composed of water channels\n(active cooling) and metallic foam embedded with two types of phase-change\nmaterials or PCMs (passive cooling) with different melting points. We show that\na multifaceted thermal regulation strategy can improve both cooling\neffectiveness and temperature homogeneity through a representative prismatic\nbattery module. Our numerical results indicate that for a battery pack cooled\nwith a water channel (3C discharge rate), a dual-PCM arrangement can reduce the\nmaximum temperature by 1.3 $^\\circ$C and 2.7 $^\\circ$C compared to a mono-PCM\narrangement and a battery pack without PCM. The maximum temperature difference\nwithin the cell is also 1.2 $^\\circ$C. Therefore, multi-PCM thermal management\nsystems show better performance than their mono-PCM predecessors in terms of\nlowering the maximum battery temperature and improving thermal homogeneity.\nThis work motivates the development of multifaceted thermal management systems\nwith active and passive cooling to improve the long-term performance of\nelectrochemical battery cells.\n","subjects":["Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"B09IjMATjxausfFRtHJTdJCSWbH5lonWOa0Mz3xe8eU","pdfSize":"7569232","objectId":"0xd720c4a426c411615a44becb4c907d8afc7db41d766b43aee095a890af838baa","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
