{"id":"2407.01352","title":"3U Transat: a cubesat constellation to boost the multi-messenger\n  astronomy","authors":"Jean-Yves Heloret, Olivier Godet, Laurent Bouchet, Jean-Luc Atteia,\n  Guillaume Orttner","authorsParsed":[["Heloret","Jean-Yves",""],["Godet","Olivier",""],["Bouchet","Laurent",""],["Atteia","Jean-Luc",""],["Orttner","Guillaume",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:09:15 GMT"}],"updateDate":"2024-07-02","timestamp":1719846555000,"abstract":"  Thanks to the advent of sensitive gravitational wave (GW) and neutrino\ndetectors, multi-messenger (MM) astronomy will deeply transform our\nunderstanding of the Universe contents and evolution over cosmological times.\nTo fully exploit the forthcoming GW and neutrino discoveries, it is crucial to\ndetect as many electromagnetic (EM) counterparts as possible, but up to now,\nonly one event has been detected by both GW detectors (Ligo/Virgo) and\nelectromagnetic detectors (Fermi/GBM (Gamma ray Burst Monitor) and Integral),\nthe short gamma-ray burst GRB 170817A/GW 170817 associated with the merger of a\nbinary neutron star. To help improving the rate of joint MM events, it is\ncrucial for the EM detectors in particular at high-energy in space to observe\nall the sky with a decent sensitivity. To do so, we propose the development of\n3U Transat (TRANsient sky SATellites) project. 3U Transat is a constellation of\nnano-satellites offering a full sky coverage with a limited investment. The\ngoal of this article is to present the 3U Transat project and its main\nscientific drivers as well as its current status. We will also describe our\ndynamic simulator used to optimise the scientific performances of the\nconstellation. We will show highlights of the expected performances in term of\ndetection and localisation capabilities as a function of the number of\nsatellites in the constellation.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9149Ebb7gtk8I1zn1rqywcrWdj8js_k10fo2nQWHmiA","pdfSize":"2668863","objectId":"0x45af9084b529858c1892f09a87b44af8a961ef8be58724108c4d77ee04d085cc","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
