{"id":"2407.10233","title":"Visual Prompt Selection for In-Context Learning Segmentation","authors":"Wei Suo, Lanqing Lai, Mengyang Sun, Hanwang Zhang, Peng Wang, Yanning\n  Zhang","authorsParsed":[["Suo","Wei",""],["Lai","Lanqing",""],["Sun","Mengyang",""],["Zhang","Hanwang",""],["Wang","Peng",""],["Zhang","Yanning",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 15:02:54 GMT"}],"updateDate":"2024-07-16","timestamp":1720969374000,"abstract":"  As a fundamental and extensively studied task in computer vision, image\nsegmentation aims to locate and identify different semantic concepts at the\npixel level. Recently, inspired by In-Context Learning (ICL), several\ngeneralist segmentation frameworks have been proposed, providing a promising\nparadigm for segmenting specific objects. However, existing works mostly ignore\nthe value of visual prompts or simply apply similarity sorting to select\ncontextual examples. In this paper, we focus on rethinking and improving the\nexample selection strategy. By comprehensive comparisons, we first demonstrate\nthat ICL-based segmentation models are sensitive to different contexts.\nFurthermore, empirical evidence indicates that the diversity of contextual\nprompts plays a crucial role in guiding segmentation. Based on the above\ninsights, we propose a new stepwise context search method. Different from\nprevious works, we construct a small yet rich candidate pool and adaptively\nsearch the well-matched contexts. More importantly, this method effectively\nreduces the annotation cost by compacting the search space. Extensive\nexperiments show that our method is an effective strategy for selecting\nexamples and enhancing segmentation performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xuJfbhs3ROvP9kwb_4TwkXaQCdf_zSZA_C2a3H6WK1A","pdfSize":"5607062","objectId":"0xf9e067eea3bb2c8e2f61719e176b83ff03f4c7a7c6fe595c42f645b4eab6c634","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
