{"id":"2407.18063","title":"Imaging interstitial atoms with multislice electron ptychography","authors":"Zhen Chen, Yu-Tsun Shao, Steven E. Zeltmann, Harikrishnan K. P., Ethan\n  R. Rosenberg, Caroline A. Ross, Yi Jiang, David A. Muller","authorsParsed":[["Chen","Zhen",""],["Shao","Yu-Tsun",""],["Zeltmann","Steven E.",""],["P.","Harikrishnan K.",""],["Rosenberg","Ethan R.",""],["Ross","Caroline A.",""],["Jiang","Yi",""],["Muller","David A.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 14:18:06 GMT"}],"updateDate":"2024-07-26","timestamp":1721917086000,"abstract":"  Doping impurity atoms is a strategy commonly used to tune the functionality\nof materials including catalysts, semiconductors, and quantum emitters. The\nlocation of dopants and their interaction with surrounding atoms could\nsignificantly modulate the transport, optical, or magnetic properties of\nmaterials. However, directly imaging individual impurity atoms inside materials\nremains a generally unaddressed need. Here, we demonstrate how single atoms can\nbe detected and located in three dimensions via multislice electron\nptychography.Interstitial atoms in a complex garnet oxide heterostructure are\nresolved with a depth resolution better than 2.7 nm, together with a\ndeep-sub-{\\AA}ngstrom lateral resolution. Single-scan atomic-layer depth\nresolution should be possible using strongly divergent electron probe\nillumination. Our results provide a new approach to detecting individual atomic\ndefects and open doors to characterize the local environments and spatial\ndistributions that underlie a broad range of systems such as single-atom\ncatalysts, nitrogen-vacancy centers, and other atomic-scale quantum sensors.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Q-QettiGgNnBtgtM-_EWX4G16nstwPU7XfrNTtyUozo","pdfSize":"2178479","objectId":"0xe92d54a8f82e95817d247db310bde3528325d61dc7a59de8631835947ee39733","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
