{"id":"2407.14062","title":"Decomposed Vector-Quantized Variational Autoencoder for Human Grasp\n  Generation","authors":"Zhe Zhao, Mengshi Qi, Huadong Ma","authorsParsed":[["Zhao","Zhe",""],["Qi","Mengshi",""],["Ma","Huadong",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 06:41:16 GMT"}],"updateDate":"2024-07-22","timestamp":1721371276000,"abstract":"  Generating realistic human grasps is a crucial yet challenging task for\napplications involving object manipulation in computer graphics and robotics.\nExisting methods often struggle with generating fine-grained realistic human\ngrasps that ensure all fingers effectively interact with objects, as they focus\non encoding hand with the whole representation and then estimating both hand\nposture and position in a single step. In this paper, we propose a novel\nDecomposed Vector-Quantized Variational Autoencoder (DVQ-VAE) to address this\nlimitation by decomposing hand into several distinct parts and encoding them\nseparately. This part-aware decomposed architecture facilitates more precise\nmanagement of the interaction between each component of hand and object,\nenhancing the overall reality of generated human grasps. Furthermore, we design\na newly dual-stage decoding strategy, by first determining the type of grasping\nunder skeletal physical constraints, and then identifying the location of the\ngrasp, which can greatly improve the verisimilitude as well as adaptability of\nthe model to unseen hand-object interaction. In experiments, our model achieved\nabout 14.1% relative improvement in the quality index compared to the\nstate-of-the-art methods in four widely-adopted benchmarks. Our source code is\navailable at https://github.com/florasion/D-VQVAE.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LQ7ILdp4J43GlimCfpTC6ZzmGMYz7LRBXGZchn4nfyk","pdfSize":"3277832","objectId":"0xeec26ee0d3e0743cbced63f410ad8a6ec0542e5c050103f34a21061dd537bb2a","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
