{"id":"2407.16246","title":"Persistent quantum advantage with definite photon-number states in lossy\n  multiple-phase estimation","authors":"Min Namkung, Dong-Hyun Kim, Seongjin Hong, Changhyoup Lee, Hyang-Tag\n  Lim","authorsParsed":[["Namkung","Min",""],["Kim","Dong-Hyun",""],["Hong","Seongjin",""],["Lee","Changhyoup",""],["Lim","Hyang-Tag",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 07:34:33 GMT"}],"updateDate":"2024-07-24","timestamp":1721720073000,"abstract":"  Multiple-phase estimation exploiting quantum states has broad applications in\nnovel sensing and imaging technologies. However, the unavoidable presence of\nlossy environments in practical settings often diminishes the precision of\nphase estimations. To address this challenge, we propose an optimal\nmultiple-phase estimation scheme that is inherently robust against photon loss,\nensuring a persistent quantum advantage across all levels of photon loss. The\nscheme employs a multi-mode definite photon-number (DPN) state with weights\noptimized for given levels of photon loss. We theoretically demonstrate that\nthe DPN state can sustain quantum enhancement in estimation precision under all\nlevels of photon loss, compared to the classical benchmark that employs a\ncoherent state input. The proposed scheme using DPN states generalizes earlier\nstudies employing NOON states, which are only optimal when photon loss is\nsmall. We believe that our study, demonstrating persistent robustness to photon\nloss, paves the way for significant advancements in quantum-enhanced sensing\ntechnologies, enabling practical applications and quantum advantages in\nreal-world scenarios.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Be2g3M7invufj8maAEmgTcx3okqp_OQLM3Wr2RxNOac","pdfSize":"1055118","objectId":"0x1d7156d5e83e65f2ea1268a111c23250a2d9f0dba1fe1b7e3a8e6e24338aa806","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
