{"id":"2407.03549","title":"POSTURE: Pose Guided Unsupervised Domain Adaptation for Human Body Part\n  Segmentation","authors":"Arindam Dutta, Rohit Lal, Yash Garg, Calvin-Khang Ta, Dripta S.\n  Raychaudhuri, Hannah Dela Cruz, Amit K. Roy-Chowdhury","authorsParsed":[["Dutta","Arindam",""],["Lal","Rohit",""],["Garg","Yash",""],["Ta","Calvin-Khang",""],["Raychaudhuri","Dripta S.",""],["Cruz","Hannah Dela",""],["Roy-Chowdhury","Amit K.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 00:06:59 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 00:36:04 GMT"}],"updateDate":"2024-07-24","timestamp":1720051619000,"abstract":"  Existing algorithms for human body part segmentation have shown promising\nresults on challenging datasets, primarily relying on end-to-end supervision.\nHowever, these algorithms exhibit severe performance drops in the face of\ndomain shifts, leading to inaccurate segmentation masks. To tackle this issue,\nwe introduce POSTURE: \\underline{Po}se Guided Un\\underline{s}upervised Domain\nAdap\\underline{t}ation for H\\underline{u}man Body Pa\\underline{r}t\nS\\underline{e}gmentation - an innovative pseudo-labelling approach designed to\nimprove segmentation performance on the unlabeled target data. Distinct from\nconventional domain adaptive methods for general semantic segmentation, POSTURE\nstands out by considering the underlying structure of the human body and uses\nanatomical guidance from pose keypoints to drive the adaptation process. This\nstrong inductive prior translates to impressive performance improvements,\naveraging 8\\% over existing state-of-the-art domain adaptive semantic\nsegmentation methods across three benchmark datasets. Furthermore, the inherent\nflexibility of our proposed approach facilitates seamless extension to\nsource-free settings (SF-POSTURE), effectively mitigating potential privacy and\ncomputational concerns, with negligible drop in performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"afZRR4839AC8UB8ds4Ssic8sb9gak-Ts3vS9WfvraB0","pdfSize":"1854675"}
