{"id":"2407.19433","title":"How Books Tell a History of Statistics in Portugal: Works of Foreigners,\n  Estrangeirados, and Others","authors":"Dinis Pestana and Rui Santos","authorsParsed":[["Pestana","Dinis",""],["Santos","Rui",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 09:16:58 GMT"}],"updateDate":"2024-07-30","timestamp":1722158218000,"abstract":"  Foreigners and \"estrangeirados\", an expression meaning \"people going to a\nforeign country [\"estrangeiro\"] getting there further education\", had a leading\nrole in the development of Mathematical Statistics in Portugal. In what\nconcerns Statistics, \"estrangeirados\" in the nineteenth century were mainly\nliberal intellectuals exiled for political reasons. From 1930 onwards, the\nresearch funding authority sent university professors abroad, and hired foreign\nresearchers to stay in Portuguese institutions, and some of them were\ninstrumental in the importation of new concepts and methods of inferential\nstatistics. After 1970, there was a huge program of sending young researchers\nabroad for doctoral studies. At the same time, many new universities and\npolytechnic institutes have been created in Portugal. After that, aside from\nforeigners who choose to have a research career in those institutions and the\n\"estrangeirados\" who had returned and created programs of doctoral studies,\nothers, who hadn't the opportunity of studying abroad, began to play a decisive\nrole in the development of Statistics in Portugal. The publication of handbooks\non Probability and Statistics, thesis and core papers in Portuguese scientific\njournals, and also of works for the layman, reveals how Statistics progressed\nfrom descriptive to a mathematical discipline used for inference in all fields\nof knowledge, from natural sciences to methodology of scientific research.\n","subjects":["Statistics/Other Statistics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vL6TkDv6xfrmE4U9sZknrsb-6VnOlC9JoeGRdqh25YM","pdfSize":"6804971","objectId":"0x24242ac344fff6c0fb381afd80bcd30cef961177cc38b2395350e53f029f95c8","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
