{"id":"2407.00207","title":"CIS: Composable Instruction Set for Streaming Applications: Design,\n  Modeling, and Scheduling","authors":"Yu Yang, Jordi Altay\\'o Gonz\\'alez, Ahmed Hemani","authorsParsed":[["Yang","Yu",""],["González","Jordi Altayó",""],["Hemani","Ahmed",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 19:25:25 GMT"}],"updateDate":"2024-07-02","timestamp":1719602725000,"abstract":"  The efficiency improvement of hardware accelerators such as\nsingle-instruction-multiple-data (SIMD) and coarse-grained reconfigurable\narchitecture (CGRA) empowers the rapid advancement of AI and machine learning\napplications. These streaming applications consist of numerous vector\noperations that can be naturally parallelized. Despite the outstanding\nachievements of today's hardware accelerators, their potential is limited by\ntheir instruction set design. Traditional instruction sets, designed for\nmicroprocessors and accelerators, focus on computation and pay little attention\nto instruction composability and instruction-level cooperation. It leads to a\nrigid instruction set that is difficult to extend and significant control\noverhead in hardware. This paper presents an instruction set that is composable\nin both spatial and temporal sense and suitable for streaming applications. The\nproposed instruction set contains significantly fewer instruction types but can\nstill efficiently implement complex multi-level loop structures, which is\nessential for accelerating streaming applications. It is also a\nresource-centric instruction set that can be conveniently extended by adding\nnew hardware resources, thus creating a custom heterogeneous computation\nmachine. Besides presenting the composable instruction set, we propose a simple\nyet efficient instruction scheduling algorithm. We analyzed the scalability of\nthe scheduling algorithm and compared the efficiency of our compiled programs\nagainst RISC-V programs. The results indicate that our scheduling algorithm\nscales linearly, and our instruction set leads to near-optimal execution\nlatency. The mapped applications on CIS are nearly 10 times faster than the\nRISC-V version.\n","subjects":["Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"DxsltJJRhMPrTFcZQevlZ2bN6SmsUA-3JsccpQFQA8g","pdfSize":"696048","objectId":"0xd67ae9a7551c364a8ebc3af3f0e14ecccfaed1d419d6f58bc9356ab803a5aa4a","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
