{"id":"2407.07610","title":"ALMA-IMF XII: Point-process mapping of 15 massive protoclusters","authors":"P. Dell'Ova, F. Motte, A. Gusdorf, Y. Pouteau, A. Men'shchikov, D.\n  Diaz-Gonzalez, R. Galv\\'an-Madrid, P. Lesaffre, P. Didelon, A.M. Stutz,\n  A.P.M. Towner, K. Marsh, A. Whitworth, M. Armante, M. Bonfand, T. Nony, M.\n  Valeille-Manet, S. Bontemps, T. Csengeri, N. Cunningham, A. Ginsburg, F.\n  Louvet, R. H. Alvarez-Gutierrez, N. Brouillet, J. Salinas, P. Sanhueza, F.\n  Nakamura, Q. Nguyen Luong, T. Baug, M. Fernandez-Lopez, H.-L. Liu and F.\n  Olguin","authorsParsed":[["Dell'Ova","P.",""],["Motte","F.",""],["Gusdorf","A.",""],["Pouteau","Y.",""],["Men'shchikov","A.",""],["Diaz-Gonzalez","D.",""],["Galván-Madrid","R.",""],["Lesaffre","P.",""],["Didelon","P.",""],["Stutz","A. M.",""],["Towner","A. P. M.",""],["Marsh","K.",""],["Whitworth","A.",""],["Armante","M.",""],["Bonfand","M.",""],["Nony","T.",""],["Valeille-Manet","M.",""],["Bontemps","S.",""],["Csengeri","T.",""],["Cunningham","N.",""],["Ginsburg","A.",""],["Louvet","F.",""],["Alvarez-Gutierrez","R. H.",""],["Brouillet","N.",""],["Salinas","J.",""],["Sanhueza","P.",""],["Nakamura","F.",""],["Luong","Q. Nguyen",""],["Baug","T.",""],["Fernandez-Lopez","M.",""],["Liu","H. -L.",""],["Olguin","F.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 12:49:33 GMT"}],"updateDate":"2024-07-11","timestamp":1720615773000,"abstract":"  A crucial aspect in addressing the challenge of measuring the core mass\nfunction, that is pivotal for comprehending the origin of the initial mass\nfunction, lies in constraining the temperatures of the cores. We aim to measure\nthe luminosity, mass, column density and dust temperature of star-forming\nregions imaged by the ALMA-IMF large program. High angular resolution mapping\nis required to capture the properties of protostellar and pre-stellar cores and\nto effectively separate them from larger features, such as dusty filaments. We\nemployed the point process mapping (PPMAP) technique, enabling us to perform\nspectral energy distribution fitting of far-infrared and submillimeter\nobservations across the 15 ALMA-IMF fields, at an unmatched 2.5\" angular\nresolution. By combining the modified blackbody model with near-infrared data,\nwe derived bolometric luminosity maps. We estimated the errors impacting values\nof each pixel in the temperature, column density, and luminosity maps.\nSubsequently, we employed the extraction algorithm getsf on the luminosity maps\nin order to detect luminosity peaks and measure their associated masses. We\nobtained high-resolution constraints on the luminosity, dust temperature, and\nmass of protoclusters, that are in agreement with previously reported\nmeasurements made at a coarser angular resolution. We find that the\nluminosity-to-mass ratio correlates with the evolutionary stage of the studied\nregions, albeit with intra-region variability. We compiled a PPMAP source\ncatalog of 313 luminosity peaks using getsf on the derived bolometric\nluminosity maps. The PPMAP source catalog provides constraints on the mass and\nluminosity of protostars and cores, although one source may encompass several\nobjects. Finally, we compare the estimated luminosity-to-mass ratio of PPMAP\nsources with evolutionary tracks and discuss the limitations imposed by the\n2.5\" beam.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OUI-ShucoynWLS3OUZQmeSg0Djvxe08jcAgvJMWhMXo","pdfSize":"9458904","objectId":"0xc0cfcf2ce1781f1f9336a7981de4f2e5717b348834322cc60e94b4a2e9d52d5b","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
