{"id":"2407.02811","title":"SPLITZ: Certifiable Robustness via Split Lipschitz Randomized Smoothing","authors":"Meiyu Zhong, Ravi Tandon","authorsParsed":[["Zhong","Meiyu",""],["Tandon","Ravi",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 05:13:28 GMT"}],"updateDate":"2024-07-04","timestamp":1719983608000,"abstract":"  Certifiable robustness gives the guarantee that small perturbations around an\ninput to a classifier will not change the prediction. There are two approaches\nto provide certifiable robustness to adversarial examples: a) explicitly\ntraining classifiers with small Lipschitz constants, and b) Randomized\nsmoothing, which adds random noise to the input to create a smooth classifier.\nWe propose \\textit{SPLITZ}, a practical and novel approach which leverages the\nsynergistic benefits of both the above ideas into a single framework. Our main\nidea is to \\textit{split} a classifier into two halves, constrain the Lipschitz\nconstant of the first half, and smooth the second half via randomization.\nMotivation for \\textit{SPLITZ} comes from the observation that many standard\ndeep networks exhibit heterogeneity in Lipschitz constants across layers.\n\\textit{SPLITZ} can exploit this heterogeneity while inheriting the scalability\nof randomized smoothing. We present a principled approach to train\n\\textit{SPLITZ} and provide theoretical analysis to derive certified robustness\nguarantees during inference. We present a comprehensive comparison of\nrobustness-accuracy tradeoffs and show that \\textit{SPLITZ} consistently\nimproves upon existing state-of-the-art approaches on MNIST and CIFAR-10\ndatasets. For instance, with $\\ell_2$ norm perturbation budget of\n\\textbf{$\\epsilon=1$}, \\textit{SPLITZ} achieves $\\textbf{43.2\\%}$ top-1 test\naccuracy on CIFAR-10 dataset compared to state-of-art top-1 test accuracy\n$\\textbf{39.8\\%}\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"S90ZbqrRpEMtgOPtUdibyB8bewj2iXQir12-Y3lmrfs","pdfSize":"1631050","objectId":"0x65acd026d447a91deb902d3010352058e0756ac0d9788f8b1ff5b559a2831bad","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
