{"id":"2407.12447","title":"Low latency carbon budget analysis reveals a large decline of the land\n  carbon sink in 2023","authors":"Piyu Ke, Philippe Ciais, Stephen Sitch, Wei Li, Ana Bastos, Zhu Liu,\n  Yidi Xu, Xiaofan Gui, Jiang Bian, Daniel S Goll, Yi Xi, Wanjing Li, Michael\n  O'Sullivan, Jeffeson Goncalves de Souza, Pierre Friedlingstein, Frederic\n  Chevallier","authorsParsed":[["Ke","Piyu",""],["Ciais","Philippe",""],["Sitch","Stephen",""],["Li","Wei",""],["Bastos","Ana",""],["Liu","Zhu",""],["Xu","Yidi",""],["Gui","Xiaofan",""],["Bian","Jiang",""],["Goll","Daniel S",""],["Xi","Yi",""],["Li","Wanjing",""],["O'Sullivan","Michael",""],["de Souza","Jeffeson Goncalves",""],["Friedlingstein","Pierre",""],["Chevallier","Frederic",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 09:54:53 GMT"}],"updateDate":"2024-07-18","timestamp":1721210093000,"abstract":"  In 2023, the CO2 growth rate was 3.37 +/- 0.11 ppm at Mauna Loa, 86% above\nthe previous year, and hitting a record high since observations began in 1958,\nwhile global fossil fuel CO2 emissions only increased by 0.6 +/- 0.5%. This\nimplies an unprecedented weakening of land and ocean sinks, and raises the\nquestion of where and why this reduction happened. Here we show a global net\nland CO2 sink of 0.44 +/- 0.21 GtC yr-1, the weakest since 2003. We used\ndynamic global vegetation models, satellites fire emissions, an atmospheric\ninversion based on OCO-2 measurements, and emulators of ocean biogeochemical\nand data driven models to deliver a fast-track carbon budget in 2023. Those\nmodels ensured consistency with previous carbon budgets. Regional flux\nanomalies from 2015-2022 are consistent between top-down and bottom-up\napproaches, with the largest abnormal carbon loss in the Amazon during the\ndrought in the second half of 2023 (0.31 +/- 0.19 GtC yr-1), extreme fire\nemissions of 0.58 +/- 0.10 GtC yr-1 in Canada and a loss in South-East Asia\n(0.13 +/- 0.12 GtC yr-1). Since 2015, land CO2 uptake north of 20 degree N\ndeclined by half to 1.13 +/- 0.24 GtC yr-1 in 2023. Meanwhile, the tropics\nrecovered from the 2015-16 El Nino carbon loss, gained carbon during the La\nNina years (2020-2023), then switched to a carbon loss during the 2023 El Nino\n(0.56 +/- 0.23 GtC yr-1). The ocean sink was stronger than normal in the\nequatorial eastern Pacific due to reduced upwelling from La Nina's retreat in\nearly 2023 and the development of El Nino later. Land regions exposed to\nextreme heat in 2023 contributed a gross carbon loss of 1.73 GtC yr-1,\nindicating that record warming in 2023 had a strong negative impact on the\ncapacity of terrestrial ecosystems to mitigate climate change.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hOYgZfUiRSvLwii1GpcCkrgVfJ0eE4pa4_itryvw6k4","pdfSize":"27125369","objectId":"0x0935caf314191988e2e7a548080513ca597d1889a7ff291e35f2a9f0ba2cab1e","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
