{"id":"2407.20592","title":"EgoSonics: Generating Synchronized Audio for Silent Egocentric Videos","authors":"Aashish Rai, Srinath Sridhar","authorsParsed":[["Rai","Aashish",""],["Sridhar","Srinath",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 06:57:00 GMT"}],"updateDate":"2024-07-31","timestamp":1722322620000,"abstract":"  We introduce EgoSonics, a method to generate semantically meaningful and\nsynchronized audio tracks conditioned on silent egocentric videos. Generating\naudio for silent egocentric videos could open new applications in virtual\nreality, assistive technologies, or for augmenting existing datasets. Existing\nwork has been limited to domains like speech, music, or impact sounds and\ncannot easily capture the broad range of audio frequencies found in egocentric\nvideos. EgoSonics addresses these limitations by building on the strength of\nlatent diffusion models for conditioned audio synthesis. We first encode and\nprocess audio and video data into a form that is suitable for generation. The\nencoded data is used to train our model to generate audio tracks that capture\nthe semantics of the input video. Our proposed SyncroNet builds on top of\nControlNet to provide control signals that enables temporal synchronization to\nthe synthesized audio. Extensive evaluations show that our model outperforms\nexisting work in audio quality, and in our newly proposed synchronization\nevaluation method. Furthermore, we demonstrate downstream applications of our\nmodel in improving video summarization.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZIeYVbFdL-6nFoPx3ZPeLS2Z9p7U2QCAe9lCQyBoTJg","pdfSize":"4384740","objectId":"0xe3f9d3d4d03f9165d22729bb3629fb5681a181a11cf574cd7dad7b6916b2eab0","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
