{"id":"2407.09389","title":"Seasonal variation of Saturn's Lyman-$\\alpha$ brightness","authors":"P. Stephenson, T. T. Koskinen, Z. Brown, E. Qu\\'emerais, P. Lavvas, J.\n  I. Moses, B. Sandel and R. Yelle","authorsParsed":[["Stephenson","P.",""],["Koskinen","T. T.",""],["Brown","Z.",""],["Quémerais","E.",""],["Lavvas","P.",""],["Moses","J. I.",""],["Sandel","B.",""],["Yelle","R.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 16:10:25 GMT"}],"updateDate":"2024-07-15","timestamp":1720800625000,"abstract":"  We examine Saturn's non-auroral (dayglow) emissions at Lyman-$\\alpha$\nobserved by the {Cassini/UVIS} instrument from 2004 until 2016, to constrain\nmeridional and seasonal trends in the upper atmosphere. We separate viewing\ngeometry effects from trends driven by atmospheric properties, by applying a\nmulti-variate regression to the observed emissions. The Lyman-$\\alpha$ dayglow\nbrightnesses depend on the incident solar flux, solar incidence angle, emission\nangle, and observed latitude. The emissions across latitudes and seasons show a\nstrong dependence with solar incidence angle, typical of resonantly scattered\nsolar flux and consistent with no significant internal source. We observe a\nbulge in Ly-$\\alpha$ brightness that shifts with the summer season from the\nsouthern to the northern hemisphere. We estimate atomic hydrogen optical depths\nabove the methane homopause level for dayside disk observations (2004-2016) by\ncomparing observed Lyman-$\\alpha$ emissions to a radiative transfer model. We\nmodel emissions from resonantly scattered solar flux and a smaller but\nsignificant contribution by scattered photons from the interplanetary hydrogen\n(IPH) background. During northern summer, inferred hydrogen optical depths\nsteeply decrease with latitude towards the winter hemisphere from a northern\nhemisphere bulge, as predicted by a 2D seasonal photochemical model. The\nsouthern hemisphere mirrors this trend during its summer. However, inferred\noptical depths show substantially more temporal variation between 2004 and 2016\nthan predicted by the photochemical model.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Vj9t_ND00YlKC-rwep3pe9Ef5QXq2bdGCewh-qehHMw","pdfSize":"10198944","objectId":"0x9e715f4db23e84e81f41b1bdf9a75f01be4c34f5e567a305622b75a722b0ed19","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
