{"id":"2407.03648","title":"High Fidelity Text-Guided Music Generation and Editing via Single-Stage\n  Flow Matching","authors":"Gael Le Lan, Bowen Shi, Zhaoheng Ni, Sidd Srinivasan, Anurag Kumar,\n  Brian Ellis, David Kant, Varun Nagaraja, Ernie Chang, Wei-Ning Hsu, Yangyang\n  Shi, Vikas Chandra","authorsParsed":[["Lan","Gael Le",""],["Shi","Bowen",""],["Ni","Zhaoheng",""],["Srinivasan","Sidd",""],["Kumar","Anurag",""],["Ellis","Brian",""],["Kant","David",""],["Nagaraja","Varun",""],["Chang","Ernie",""],["Hsu","Wei-Ning",""],["Shi","Yangyang",""],["Chandra","Vikas",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 05:38:49 GMT"}],"updateDate":"2024-07-08","timestamp":1720071529000,"abstract":"  We introduce a simple and efficient text-controllable high-fidelity music\ngeneration and editing model. It operates on sequences of continuous latent\nrepresentations from a low frame rate 48 kHz stereo variational auto encoder\ncodec that eliminates the information loss drawback of discrete\nrepresentations. Based on a diffusion transformer architecture trained on a\nflow-matching objective the model can generate and edit diverse high quality\nstereo samples of variable duration, with simple text descriptions. We also\nexplore a new regularized latent inversion method for zero-shot test-time\ntext-guided editing and demonstrate its superior performance over naive\ndenoising diffusion implicit model (DDIM) inversion for variety of music\nediting prompts. Evaluations are conducted on both objective and subjective\nmetrics and demonstrate that the proposed model is not only competitive to the\nevaluated baselines on a standard text-to-music benchmark - quality and\nefficiency-wise - but also outperforms previous state of the art for music\nediting when combined with our proposed latent inversion. Samples are available\nat https://melodyflow.github.io.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Sound"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rDdY_PX3j0WtQ24YtGmXXcQ4Bpquw0e2OITYlSx1JtU","pdfSize":"794298"}
