{"id":"2407.06265","title":"Connecting the radio AGN life cycle to feedback: Ionised gas is more\n  disturbed in young radio AGN","authors":"Pranav Kukreti and Raffaella Morganti","authorsParsed":[["Kukreti","Pranav",""],["Morganti","Raffaella",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:00:02 GMT"}],"updateDate":"2024-07-10","timestamp":1720461602000,"abstract":"  In the host galaxies of radio AGN, kinematically disturbed gas due to\njet-driven feedback is a widely observed phenomenon. Simulations predict that\nthe impact of jets on the surrounding gas changes as they grow. Useful insights\ninto this phenomenon can be obtained by characterising radio AGN into different\nevolutionary stages and studying their impact on gas kinematics. We present a\nsystematic study of the [OIII] gas kinematics for a sample of 5720 radio AGN up\nto $z\\sim0.8$ with a large 1.4 GHz luminosity range of\n$\\approx10^{22.5}-10^{28}$W/Hz, and 1693 [OIII] detections. Taking advantage of\nthe wide frequency coverage of LOFAR and VLA surveys from $144-3000$MHz, we\ndetermine the radio spectral shapes, using them to characterise sources into\ndifferent stages of the radio AGN life cycle. We determine the [OIII]\nkinematics from SDSS spectra and link it to the life cycle. Our main conclusion\nis that the [OIII] gas is $\\sim$3 times more likely to be disturbed in the\npeaked spectrum (PS) sources (that represent a young phase of activity) than\nnon-peaked spectrum (NPS) sources (that represent more evolved sources) at\n$z<0.4$. This changes to a factor of $\\sim$2 at $z>0.4$. This shows that on\naverage, the strong impact of jets is limited to the initial stages of the\nradio AGN life cycle. At later stages, the impact on gas is more gentle. We\nalso determine the dependence of this trend on 1.4GHz and [OIII] luminosities\nand find that the difference between the two groups increases with 1.4GHz\nluminosity. Young radio AGN with $L_\\mathrm{1.4GHz}>10^{25}$W/Hz have the most\nextreme impact on [OIII]. Using a stacking analysis, we are further able to\ntrace the changing impact on [OIII] in the high-frequency peaked spectrum (i.e.\nyoungest), low-frequency peaked spectrum (\"less young\"), and non-peaked\nspectrum (evolved) radio AGN.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kCxK4uCdyImiDPrywnkfXNLHO3J78DbCERPd5xeEFjY","pdfSize":"6264659"}
