{"id":"2407.06280","title":"DESI Early Data Release Milky Way Survey Value-Added Catalogue","authors":"Sergey E. Koposov, C. Allende-Prieto, A. P. Cooper, T. S. Li, L.\n  Beraldo e Silva, B. Kim, A. Carrillo, A. Dey, C. J. Manser, F. Nikakhtar, A.\n  H. Riley, C. Rockosi, M. Valluri, J. Aguilar, S. Ahlen, S. Bailey, R. Blum,\n  D. Brooks, T. Claybaugh, S. Cole, A. de la Macorra, B. Dey, J. E.\n  Forero-Romero, E. Gazta\\~naga, J. Guy, A. Kremin, L. Le Guillou, Michael E.\n  Levi, M. Manera, A. Meisner, R. Miquel, J. Moustakas, J. Nie, N.\n  Palanque-Delabrouille, W. J. Percival, M. Rezaie, G. Rossi, E. Sanchez, E. F.\n  Schlafly, M. Schubnell, G. Tarl\\'e, B. A. Weaver, Z. Zhou","authorsParsed":[["Koposov","Sergey E.",""],["Allende-Prieto","C.",""],["Cooper","A. P.",""],["Li","T. S.",""],["Silva","L. Beraldo e",""],["Kim","B.",""],["Carrillo","A.",""],["Dey","A.",""],["Manser","C. J.",""],["Nikakhtar","F.",""],["Riley","A. H.",""],["Rockosi","C.",""],["Valluri","M.",""],["Aguilar","J.",""],["Ahlen","S.",""],["Bailey","S.",""],["Blum","R.",""],["Brooks","D.",""],["Claybaugh","T.",""],["Cole","S.",""],["de la Macorra","A.",""],["Dey","B.",""],["Forero-Romero","J. E.",""],["Gaztañaga","E.",""],["Guy","J.",""],["Kremin","A.",""],["Guillou","L. Le",""],["Levi","Michael E.",""],["Manera","M.",""],["Meisner","A.",""],["Miquel","R.",""],["Moustakas","J.",""],["Nie","J.",""],["Palanque-Delabrouille","N.",""],["Percival","W. J.",""],["Rezaie","M.",""],["Rossi","G.",""],["Sanchez","E.",""],["Schlafly","E. F.",""],["Schubnell","M.",""],["Tarlé","G.",""],["Weaver","B. A.",""],["Zhou","Z.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:00:15 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 15:02:23 GMT"}],"updateDate":"2024-07-29","timestamp":1720461615000,"abstract":"  We present the stellar value-added catalogue based on the Dark Energy\nSpectroscopic Instrument (DESI) Early Data Release. The catalogue contains\nradial velocity and stellar parameter measurements for $\\simeq$ 400,000 unique\nstars observed during commissioning and survey validation by DESI. These\nobservations were made under conditions similar to the Milky Way Survey (MWS)\ncurrently carried out by DESI but also include multiple specially targeted\nfields, such as those containing well-studied dwarf galaxies and stellar\nstreams. The majority of observed stars have $16<r<20$ with a median\nsignal-to-noise ratio in the spectra of $\\sim$ 20. In the paper, we describe\nthe structure of the catalogue, give an overview of different target classes\nobserved, as well as provide recipes for selecting clean stellar samples. We\nvalidate the catalogue using external high-resolution measurements and show\nthat radial velocities, surface gravities, and iron abundances determined by\nDESI are accurate to 1 km/s, $0.3$ dex and $\\sim$ 0.15 dex respectively. We\nalso demonstrate possible uses of the catalogue for chemo-dynamical studies of\nthe Milky Way stellar halo and Draco dwarf spheroidal. The value-added\ncatalogue described in this paper is the very first DESI MWS catalogue. The\nnext DESI data release, expected in less than a year, will add the data from\nthe first year of DESI survey operations and will contain approximately 4\nmillion stars, along with significant processing improvements.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"V_nDLo3iQ_rgQlYP-IApnXqD_aprmoabkC1sFaf3sso","pdfSize":"1617998"}
