{"id":"2407.05594","title":"SLIM: Spuriousness Mitigation with Minimal Human Annotations","authors":"Xiwei Xuan, Ziquan Deng, Hsuan-Tien Lin, Kwan-Liu Ma","authorsParsed":[["Xuan","Xiwei",""],["Deng","Ziquan",""],["Lin","Hsuan-Tien",""],["Ma","Kwan-Liu",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 04:15:44 GMT"}],"updateDate":"2024-07-09","timestamp":1720412144000,"abstract":"  Recent studies highlight that deep learning models often learn spurious\nfeatures mistakenly linked to labels, compromising their reliability in\nreal-world scenarios where such correlations do not hold. Despite the\nincreasing research effort, existing solutions often face two main challenges:\nthey either demand substantial annotations of spurious attributes, or they\nyield less competitive outcomes with expensive training when additional\nannotations are absent. In this paper, we introduce SLIM, a cost-effective and\nperformance-targeted approach to reducing spurious correlations in deep\nlearning. Our method leverages a human-in-the-loop protocol featuring a novel\nattention labeling mechanism with a constructed attention representation space.\nSLIM significantly reduces the need for exhaustive additional labeling,\nrequiring human input for fewer than 3% of instances. By prioritizing data\nquality over complicated training strategies, SLIM curates a smaller yet more\nfeature-balanced data subset, fostering the development of spuriousness-robust\nmodels. Experimental validations across key benchmarks demonstrate that SLIM\ncompetes with or exceeds the performance of leading methods while significantly\nreducing costs. The SLIM framework thus presents a promising path for\ndeveloping reliable models more efficiently. Our code is available in\nhttps://github.com/xiweix/SLIM.git/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"OkJShoFnDXganyB01hTel-SFH0VCD0w1tUTWZUId_xY","pdfSize":"39269559"}
