{"id":"2407.13207","title":"SN 2021wvw: A core-collapse supernova at the sub-luminous, slower, and\n  shorter end of Type IIPs","authors":"Rishabh Singh Teja, Jared A. Goldberg, D. K. Sahu, G. C. Anupama,\n  Avinash Singh, Vishwajeet Swain, and Varun Bhalerao","authorsParsed":[["Teja","Rishabh Singh",""],["Goldberg","Jared A.",""],["Sahu","D. K.",""],["Anupama","G. C.",""],["Singh","Avinash",""],["Swain","Vishwajeet",""],["Bhalerao","Varun",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 06:44:20 GMT"}],"updateDate":"2024-07-19","timestamp":1721285060000,"abstract":"  We present detailed multi-band photometric and spectroscopic observations and\nanalysis of a rare core-collapse supernova SN 2021wvw, that includes\nphotometric evolution up to 250 d and spectroscopic coverage up to 100 d\npost-explosion. A unique event that does not fit well within the general trends\nobserved for Type II-P supernovae, SN 2021wvw shows an intermediate luminosity\nwith a short plateau phase of just about 75 d, followed by a very sharp (~10 d)\ntransition to the tail phase. Even in the velocity space, it lies at a lower\nvelocity compared to a larger Type II sample. The observed peak absolute\nmagnitude is -16.1 mag in r-band, and the nickel mass is well constrained to\n0.020(6) Msol. Detailed hydrodynamical modeling using MESA+STELLA suggests a\nradially compact, low-metallicity, high-mass Red Supergiant progenitor (ZAMS\nmass=18 Msol), which exploded with ~0.2e51 erg/s leaving an ejecta mass of\nMej~5 Msol. Significant late-time fallback during the shock propagation phase\nis also seen in progenitor+explosion models consistent with the light curve\nproperties. As the faintest short-plateau supernova characterized to date, this\nevent adds to the growing diversity of transitional events between the\ncanonical ~100 d plateau Type IIP and stripped-envelope events.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-wFbemfaHJdmD8GCI5ymGJvULv6fI8jX8-T7zPmfL3c","pdfSize":"2970812","objectId":"0xab6a9fcbc762814c2772c34584fa55050daf91480dc588bbb50fc9e0ce72453e","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
