{"id":"2407.03895","title":"Scoping Review of Active Learning Strategies and their Evaluation\n  Environments for Entity Recognition Tasks","authors":"Philipp Kohl, Yoka Kr\\\"amer, Claudia Fohry, Bodo Kraft","authorsParsed":[["Kohl","Philipp",""],["Krämer","Yoka",""],["Fohry","Claudia",""],["Kraft","Bodo",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 12:40:35 GMT"}],"updateDate":"2024-08-23","timestamp":1720096835000,"abstract":"  We conducted a scoping review for active learning in the domain of natural\nlanguage processing (NLP), which we summarize in accordance with the PRISMA-ScR\nguidelines as follows:\n  Objective: Identify active learning strategies that were proposed for entity\nrecognition and their evaluation environments (datasets, metrics, hardware,\nexecution time). Design: We used Scopus and ACM as our search engines. We\ncompared the results with two literature surveys to assess the search quality.\nWe included peer-reviewed English publications introducing or comparing active\nlearning strategies for entity recognition. Results: We analyzed 62 relevant\npapers and identified 106 active learning strategies. We grouped them into\nthree categories: exploitation-based (60x), exploration-based (14x), and hybrid\nstrategies (32x). We found that all studies used the F1-score as an evaluation\nmetric. Information about hardware (6x) and execution time (13x) was only\noccasionally included. The 62 papers used 57 different datasets to evaluate\ntheir respective strategies. Most datasets contained newspaper articles or\nbiomedical/medical data. Our analysis revealed that 26 out of 57 datasets are\npublicly accessible.\n  Conclusion: Numerous active learning strategies have been identified, along\nwith significant open questions that still need to be addressed. Researchers\nand practitioners face difficulties when making data-driven decisions about\nwhich active learning strategy to adopt. Conducting comprehensive empirical\ncomparisons using the evaluation environment proposed in this study could help\nestablish best practices in the domain.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zCaHWZP_MJBBfpBSxl6onp3csfT7_D_5uno7XKD5bXs","pdfSize":"668151"}
