{"id":"2407.05438","title":"Shear-Layer Perturbation Responses from Time-Resolved Schlieren Data","authors":"Spencer L. Stahl, Chandan Kumar, Datta V. Gaitonde","authorsParsed":[["Stahl","Spencer L.",""],["Kumar","Chandan",""],["Gaitonde","Datta V.",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 16:58:20 GMT"}],"updateDate":"2024-07-09","timestamp":1720371500000,"abstract":"  A novel combination of physics-based and data-driven post-processing\ntechniques is proposed to extract acoustic-related shear-layer perturbation\nresponses directly from spatio-temporally resolved schlieren video. The\nphysics-based component is derived from a momentum potential theory extension\nthat extracts irrotational (acoustic and thermal) information from density\ngradients embedded in schlieren pixel intensities. For the unheated shear\nlayer, the method spotlights acoustic structures and tones otherwise hidden.\nThe filtered data is then subjected to a data-driven Dynamic Mode Decomposition\nReduced Order Model (DMD-ROM), which provides the response to forced\nperturbations. This method applies a learned linear model to isolate and\nquantify growth rates of acoustic phenomena suited for efficient parametric\nstudies. A shear-layer comprised of two streams at Mach 2.461 and 0.175,\ncorresponding to a convective Mach number 0.88 and containing shocks, is\nadopted for illustration. The overall perturbation response is first obtained\nusing an impulse forcing in the wall normal direction of the splitter plate,\nextending in both subsonic and supersonic streams. Subsequently, impulse and\nharmonic forcings are independently applied in a local pixel-by-pixel manner\nfor a precise receptivity study. The acoustic response shows a convective\nwavepacket and an acoustic burst from the splitter plate. The interaction with\nthe primary shock and associated wave dispersion emits a second, slower,\nacoustic wave. Harmonic forcing indicates higher frequency-dependent\nsensitivity in the supersonic stream, with the most sensitive location near the\nouter boundary layer region. Excitation here yields an order of magnitude\nlarger acoustic response compared to disturbances in the subsonic stream. Some\nreceptive forcing inputs do not generate significant acoustic waves, which may\nguide excitation with low noise impact.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xsGwXz2ynKf2OOzi9PXw_HtYow55OfeaggITrpTEiu8","pdfSize":"19945129"}
