{"id":"2407.15876","title":"Blockchain in Healthcare: Implementing Hyperledger Fabric for Electronic\n  Health Records at Frere Provincial Hospital","authors":"Abayomi Agbeyangi, Olukayode Oki, Aphelele Mgidi","authorsParsed":[["Agbeyangi","Abayomi",""],["Oki","Olukayode",""],["Mgidi","Aphelele",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 14:27:55 GMT"}],"updateDate":"2024-07-24","timestamp":1721399275000,"abstract":"  As healthcare systems worldwide continue to grapple with the challenges of\ninteroperability, data security, and accessibility, integrating emerging\ntechnologies becomes imperative. This paper investigates the implementation of\nblockchain technology, specifically Hyperledger Fabric, for Electronic Health\nRecords (EHR) management at Frere Hospital in the Eastern Cape province of\nSouth Africa. The paper examines the benefits and challenges of integrating\nblockchain into healthcare information systems. Hyperledger Fabric's modular\narchitecture is harnessed to create a secure, transparent, and decentralized\nplatform for storing, managing, and sharing EHRs among stakeholders. The study\nused a mixed-methods approach, integrating case studies and data collection\nmethods through observation and informal questions, with the specific goal of\nunderstanding current record management methods and challenges. This method\noffers practical insights and validates the approach. The result demonstrates\nthe role of blockchain in transforming healthcare, framed within a rigorous\nexploration and analysis. The findings of this study have broader implications\nfor healthcare institutions seeking advanced solutions to address the\npersistent challenges in electronic health record management. Ultimately, the\nresearch underscores the transformative potential of blockchain technology in\nhealthcare settings, fostering trust, security, and efficiency in the\nmanagement of sensitive patient data.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"clTN6JUKh8cubn235kd2WvLO1drG7BtRRBAUDC1_0l4","pdfSize":"923538","objectId":"0xebd38e2bcc8bbb25c0869aefc35c62ec6371bca7654c66bd741f93aaed2cada1","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
