{"id":"2407.11070","title":"Optimal Defender Strategies for CAGE-2 using Causal Modeling and Tree\n  Search","authors":"Kim Hammar, Neil Dhir, and Rolf Stadler","authorsParsed":[["Hammar","Kim",""],["Dhir","Neil",""],["Stadler","Rolf",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 18:34:55 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 07:08:31 GMT"}],"updateDate":"2024-07-23","timestamp":1720809295000,"abstract":"  The CAGE-2 challenge is considered a standard benchmark to compare methods\nfor autonomous cyber defense. Current state-of-the-art methods evaluated\nagainst this benchmark are based on model-free (offline) reinforcement\nlearning, which does not provide provably optimal defender strategies. We\naddress this limitation and present a formal (causal) model of CAGE-2 together\nwith a method that produces a provably optimal defender strategy, which we call\nCausal Partially Observable Monte-Carlo Planning (C-POMCP). It has two key\nproperties. First, it incorporates the causal structure of the target system,\ni.e., the causal relationships among the system variables. This structure\nallows for a significant reduction of the search space of defender strategies.\nSecond, it is an online method that updates the defender strategy at each time\nstep via tree search. Evaluations against the CAGE-2 benchmark show that\nC-POMCP achieves state-of-the-art performance with respect to effectiveness and\nis two orders of magnitude more efficient in computing time than the closest\ncompetitor method.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"UEqE1EElzO9_zOIGEaAS_4Xk23heUJ83nY5y7wXqYaQ","pdfSize":"1962937","objectId":"0x74dae70b2197416625125033a3673003b66059920d619c06f70be602bf050070","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
