{"id":"2407.20437","title":"BaseBoostDepth: Exploiting Larger Baselines For Self-supervised\n  Monocular Depth Estimation","authors":"Kieran Saunders, Luis J. Manso, George Vogiatzis","authorsParsed":[["Saunders","Kieran",""],["Manso","Luis J.",""],["Vogiatzis","George",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 22:05:13 GMT"}],"updateDate":"2024-07-31","timestamp":1722290713000,"abstract":"  In the domain of multi-baseline stereo, the conventional understanding is\nthat, in general, increasing baseline separation substantially enhances the\naccuracy of depth estimation. However, prevailing self-supervised depth\nestimation architectures primarily use minimal frame separation and a\nconstrained stereo baseline. Larger frame separations can be employed; however,\nwe show this to result in diminished depth quality due to various factors,\nincluding significant changes in brightness, and increased areas of occlusion.\nIn response to these challenges, our proposed method, BaseBoostDepth,\nincorporates a curriculum learning-inspired optimization strategy to\neffectively leverage larger frame separations. However, we show that our\ncurriculum learning-inspired strategy alone does not suffice, as larger\nbaselines still cause pose estimation drifts. Therefore, we introduce\nincremental pose estimation to enhance the accuracy of pose estimations,\nresulting in significant improvements across all depth metrics. Additionally,\nto improve the robustness of the model, we introduce error-induced\nreconstructions, which optimize reconstructions with added error to the pose\nestimations. Ultimately, our final depth network achieves state-of-the-art\nperformance on KITTI and SYNS-patches datasets across image-based, edge-based,\nand point cloud-based metrics without increasing computational complexity at\ntest time. The project website can be found at\nhttps://kieran514.github.io/BaseBoostDepth-Project.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dgm0TjlqGMn173b8CIT7NSx2PgFY_bcw_kdrENAhrG8","pdfSize":"4931372","objectId":"0x33b8eaba91fd2de0ba5d5b720d8ea86a5f7c892f6cc291e0726ea815751d20a6","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
