{"id":"2407.07290","title":"Causal Discovery-Driven Change Point Detection in Time Series","authors":"Shanyun Gao, Raghavendra Addanki, Tong Yu, Ryan A. Rossi, Murat\n  Kocaoglu","authorsParsed":[["Gao","Shanyun",""],["Addanki","Raghavendra",""],["Yu","Tong",""],["Rossi","Ryan A.",""],["Kocaoglu","Murat",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 00:54:42 GMT"}],"updateDate":"2024-07-11","timestamp":1720572882000,"abstract":"  Change point detection in time series seeks to identify times when the\nprobability distribution of time series changes. It is widely applied in many\nareas, such as human-activity sensing and medical science. In the context of\nmultivariate time series, this typically involves examining the joint\ndistribution of high-dimensional data: If any one variable changes, the whole\ntime series is assumed to have changed. However, in practical applications, we\nmay be interested only in certain components of the time series, exploring\nabrupt changes in their distributions in the presence of other time series.\nHere, assuming an underlying structural causal model that governs the\ntime-series data generation, we address this problem by proposing a two-stage\nnon-parametric algorithm that first learns parts of the causal structure\nthrough constraint-based discovery methods. The algorithm then uses conditional\nrelative Pearson divergence estimation to identify the change points. The\nconditional relative Pearson divergence quantifies the distribution disparity\nbetween consecutive segments in the time series, while the causal discovery\nmethod enables a focus on the causal mechanism, facilitating access to\nindependent and identically distributed (IID) samples. Theoretically, the\ntypical assumption of samples being IID in conventional change point detection\nmethods can be relaxed based on the Causal Markov Condition. Through\nexperiments on both synthetic and real-world datasets, we validate the\ncorrectness and utility of our approach.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sxF-dtR52RECY8vZXISoIqATbepyXVy6pnJwYNXrypg","pdfSize":"1973491"}
