{"id":"2407.14316","title":"Comparing three possible hypoelliptic Laplacians on the 5-dimensional\n  Cartan group via div-curl type estimates","authors":"Annalisa Baldi and Francesca Tripaldi","authorsParsed":[["Baldi","Annalisa",""],["Tripaldi","Francesca",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:48:15 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 14:57:22 GMT"}],"updateDate":"2024-07-31","timestamp":1721396895000,"abstract":"  On general Carnot groups, the definition of a possible hypoelliptic\nHodge-Laplacian on forms using the Rumin complex has been considered by Rumin,\nwho introduced a 0-order pseudodifferential operator on forms. However, for\nquestions regarding regularity for example, where one needs sharp estimates,\nthis 0-order operator is not suitable. Up to now, there have only been very few\nattempts to define hypoelliptic Hodge-Laplacians on forms that would allow for\nsuch sharp estimates. Indeed, this question is rather difficult to address in\nfull generality, the main issue being that the Rumin exterior differential\n$d_c$ is not homogeneous on arbitrary Carnot groups.\n  In this note, we consider the specific example of the free Carnot group of\nstep 3 with 2 generators, and we introduce three possible definitions of\nhypoelliptic Hodge-Laplacians. We compare how these three possible Laplacians\ncan be used to obtain sharp div-curl type inequalities akin to those considered\nby Bourgain & Brezis and Lanzani & Stein for the de Rham complex, or their\nsubelliptic counterparts obtained by Baldi, Franchi & Pansu for the Rumin\ncomplex on Heisenberg groups.\n","subjects":["Mathematics/Analysis of PDEs","Mathematics/Differential Geometry"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"scXhsLkEWWX0vIIPfj_wB7kfnN6KZ012dziCiXvI3yI","pdfSize":"380177","objectId":"0xf65391f17e5c6ce461255f54d190424ade71675141b27691b34145ca13805b8b","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
