{"id":"2407.20875","title":"Localized stem structures in quasi-resonant two-soliton solutions for\n  the asymmetric Nizhnik-Novikov-Veselov system","authors":"Feng Yuan, Jiguang Rao, Jingsong He, Yi Cheng","authorsParsed":[["Yuan","Feng",""],["Rao","Jiguang",""],["He","Jingsong",""],["Cheng","Yi",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 14:54:09 GMT"}],"updateDate":"2024-07-31","timestamp":1722351249000,"abstract":"  Elastic collisions of solitons generally have a finite phase shift. When the\nphase shift has a finitely large value, the two vertices of the\n(2+1)-dimensional 2-soliton are significantly separated due to the phase shift,\naccompanied by the formation of a local structure connecting the two V-shaped\nsolitons. We define this local structure as the stem structure. This study\nsystematically investigates the localized stem structures between two solitons\nin the (2+1)-dimensional asymmetric Nizhnik-Novikov-Veselov system. These stem\nstructures, arising from quasi-resonant collisions between the solitons,\nexhibit distinct features of spatial locality and temporal invariance. We\nexplore two scenarios: one characterized by weakly quasi-resonant collisions\n(i.e. $a_{12}\\approx 0$), and the other by strongly quasi-resonant collisions\n(i.e. $a_{12}\\approx +\\infty$). Through mathematical analysis, we extract\ncomprehensive insights into the trajectories, amplitudes, and velocities of the\nsoliton arms. Furthermore, we discuss the characteristics of the stem\nstructures, including their length and extreme points. Our findings shed new\nlight on the interaction between solitons in the (2+1)-dimensional asymmetric\nNizhnik-Novikov-Veselov system.\n","subjects":["Nonlinear Sciences/Exactly Solvable and Integrable Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"R6X2d7jkTaoYxC_NNuNBIRd_ckwtq4waIb8FiuH9rdU","pdfSize":"795985","objectId":"0x0b58172d6c4808eab3a16ae92b56f601451533fa62335f1e3fbd1fa378c5cf5c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
