{"id":"2407.05566","title":"GMC: A General Framework of Multi-stage Context Learning and Utilization\n  for Visual Detection Tasks","authors":"Xuan Wang, Hao Tang and Zhigang Zhu","authorsParsed":[["Wang","Xuan",""],["Tang","Hao",""],["Zhu","Zhigang",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 02:54:09 GMT"}],"updateDate":"2024-07-09","timestamp":1720407249000,"abstract":"  Various contextual information has been employed by many approaches for\nvisual detection tasks. However, most of the existing approaches only focus on\nspecific context for specific tasks. In this paper, GMC, a general framework is\nproposed for multistage context learning and utilization, with various deep\nnetwork architectures for various visual detection tasks. The GMC framework\nencompasses three stages: preprocessing, training, and post-processing. In the\npreprocessing stage, the representation of local context is enhanced by\nutilizing commonly used labeling standards. During the training stage, semantic\ncontext information is fused with visual information, leveraging prior\nknowledge from the training dataset to capture semantic relationships. In the\npost-processing stage, general topological relations and semantic masks for\nstuff are incorporated to enable spatial context reasoning between objects. The\nproposed framework provides a comprehensive and adaptable solution for context\nlearning and utilization in visual detection scenarios. The framework offers\nflexibility with user-defined configurations and provide adaptability to\ndiverse network architectures and visual detection tasks, offering an automated\nand streamlined solution that minimizes user effort and inference time in\ncontext learning and reasoning. Experimental results on the visual detection\ntasks, for storefront object detection, pedestrian detection and COCO object\ndetection, demonstrate that our framework outperforms previous state-of-the-art\ndetectors and transformer architectures. The experiments also demonstrate that\nthree contextual learning components can not only be applied individually and\nin combination, but can also be applied to various network architectures, and\nits flexibility and effectiveness in various detection scenarios.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"jExeq24TAn1MzGGNpZIslj5edGLDayg73w1kPyO_9UI","pdfSize":"10037964"}
