{"id":"2407.04277","title":"Research, Applications and Prospects of Event-Based Pedestrian\n  Detection: A Survey","authors":"Han Wang, Yuman Nie, Yun Li, Hongjie Liu, Min Liu, Wen Cheng, Yaoxiong\n  Wang","authorsParsed":[["Wang","Han",""],["Nie","Yuman",""],["Li","Yun",""],["Liu","Hongjie",""],["Liu","Min",""],["Cheng","Wen",""],["Wang","Yaoxiong",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 06:17:00 GMT"}],"updateDate":"2024-07-08","timestamp":1720160220000,"abstract":"  Event-based cameras, inspired by the biological retina, have evolved into\ncutting-edge sensors distinguished by their minimal power requirements,\nnegligible latency, superior temporal resolution, and expansive dynamic range.\nAt present, cameras used for pedestrian detection are mainly frame-based\nimaging sensors, which have suffered from lethargic response times and hefty\ndata redundancy. In contrast, event-based cameras address these limitations by\neschewing extraneous data transmissions and obviating motion blur in high-speed\nimaging scenarios. On pedestrian detection via event-based cameras, this paper\noffers an exhaustive review of research and applications particularly in the\nautonomous driving context. Through methodically scrutinizing relevant\nliterature, the paper outlines the foundational principles, developmental\ntrajectory, and the comparative merits and demerits of eventbased detection\nrelative to traditional frame-based methodologies. This review conducts\nthorough analyses of various event stream inputs and their corresponding\nnetwork models to evaluate their applicability across diverse operational\nenvironments. It also delves into pivotal elements such as crucial datasets and\ndata acquisition techniques essential for advancing this technology, as well as\nadvanced algorithms for processing event stream data. Culminating with a\nsynthesis of the extant landscape, the review accentuates the unique advantages\nand persistent challenges inherent in event-based pedestrian detection,\noffering a prognostic view on potential future developments in this\nfast-progressing field.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"p0KabdqaNBM9bBdIiKjspX6T1Vdg9WOjNyLj666hX5k","pdfSize":"3391841"}
