{"id":"2407.18676","title":"Right Now, Wrong Then: Non-Stationary Direct Preference Optimization\n  under Preference Drift","authors":"Seongho Son, William Bankes, Sayak Ray Chowdhury, Brooks Paige, Ilija\n  Bogunovic","authorsParsed":[["Son","Seongho",""],["Bankes","William",""],["Chowdhury","Sayak Ray",""],["Paige","Brooks",""],["Bogunovic","Ilija",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 11:38:18 GMT"}],"updateDate":"2024-07-29","timestamp":1721993898000,"abstract":"  Reinforcement learning from human feedback (RLHF) aligns Large Language\nModels (LLMs) with human preferences. However, these preferences can often\nchange over time due to external factors (e.g. environment change and societal\ninfluence). Consequently, what was wrong then might be right now. Current\npreference optimization algorithms do not account for temporal preference drift\nin their modeling, which can lead to severe misalignment. To address this\nlimitation, we use a Dynamic Bradley-Terry model that models preferences via\ntime-dependent reward functions, and propose Non-Stationary Direct Preference\nOptimisation (NS-DPO). By introducing a discount parameter in the loss\nfunction, NS-DPO applies exponential weighting, which proportionally focuses\nlearning on more time-relevant datapoints. We theoretically analyse the\nconvergence of NS-DPO in the offline setting, providing upper bounds on the\nestimation error caused by non-stationary preferences. Finally, we demonstrate\nthe effectiveness of NS-DPO1 for fine-tuning LLMs in scenarios with drifting\npreferences. By simulating preference drift using renowned reward models and\nmodifying popular LLM datasets accordingly, we show that NS-DPO fine-tuned LLMs\nremain robust under non-stationarity, significantly outperforming baseline\nalgorithms that ignore temporal preference changes, without sacrificing\nperformance in stationary cases.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UMIzZs-rdrbTZKc57nyGBx45TBRL_c5mt0zoE1cdm_o","pdfSize":"1474710","objectId":"0x649090771adc53b73ed48241a939f15926598c961d0fb23a18ad6f5f20694d56","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
