{"id":"2407.18977","title":"Industrial Practices of Requirements Engineering for ML-Enabled Systems\n  in Brazil","authors":"Antonio Pedro Santos Alves, Marcos Kalinowski, Daniel Mendez, Hugo\n  Villamizar, Kelly Azevedo, Tatiana Escovedo, Helio Lopes","authorsParsed":[["Alves","Antonio Pedro Santos",""],["Kalinowski","Marcos",""],["Mendez","Daniel",""],["Villamizar","Hugo",""],["Azevedo","Kelly",""],["Escovedo","Tatiana",""],["Lopes","Helio",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 17:25:27 GMT"}],"updateDate":"2024-07-30","timestamp":1721669127000,"abstract":"  [Context] In Brazil, 41% of companies use machine learning (ML) to some\nextent. However, several challenges have been reported when engineering\nML-enabled systems, including unrealistic customer expectations and vagueness\nin ML problem specifications. Literature suggests that Requirements Engineering\n(RE) practices and tools may help to alleviate these issues, yet there is\ninsufficient understanding of RE's practical application and its perception\namong practitioners. [Goal] This study aims to investigate the application of\nRE in developing ML-enabled systems in Brazil, creating an overview of current\npractices, perceptions, and problems in the Brazilian industry. [Method] To\nthis end, we extracted and analyzed data from an international survey focused\non ML-enabled systems, concentrating specifically on responses from\npractitioners based in Brazil. We analyzed RE-related answers gathered from 72\npractitioners involved in data-driven projects. We conducted quantitative\nstatistical analyses on contemporary practices using bootstrapping with\nconfidence intervals and qualitative studies on the reported problems involving\nopen and axial coding procedures. [Results] Our findings highlight distinct RE\nimplementation aspects in Brazil's ML projects. For instance, (i) RE-related\ntasks are predominantly conducted by data scientists; (ii) the most common\ntechniques for eliciting requirements are interviews and workshop meetings;\n(iii) there is a prevalence of interactive notebooks in requirements\ndocumentation; (iv) practitioners report problems that include a poor\nunderstanding of the problem to solve and the business domain, low customer\nengagement, and difficulties managing stakeholders expectations. [Conclusion]\nThese results provide an understanding of RE-related practices in the Brazilian\nML industry, helping to guide research toward improving the maturity of RE for\nML-enabled systems.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1-iY2x8w1w7-UnHCZzZWiECHQoAMVoBVuBOPLdnD7-o","pdfSize":"644305","objectId":"0x01a7ce3c7fa5a9ada9b4c0c048b31e65476b06c2250e3a023a3de4da6e75b7b3","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
