{"id":"2407.07605","title":"Early Explorations of Lightweight Models for Wound Segmentation on\n  Mobile Devices","authors":"Vanessa Borst, Timo Dittus, Konstantin M\\\"uller, Samuel Kounev","authorsParsed":[["Borst","Vanessa",""],["Dittus","Timo",""],["Müller","Konstantin",""],["Kounev","Samuel",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 12:44:22 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 08:01:58 GMT"},{"version":"v3","created":"Fri, 30 Aug 2024 08:36:36 GMT"}],"updateDate":"2024-09-02","timestamp":1720615462000,"abstract":"  The aging population poses numerous challenges to healthcare, including the\nincrease in chronic wounds in the elderly. The current approach to wound\nassessment by therapists based on photographic documentation is subjective,\nhighlighting the need for computer-aided wound recognition from smartphone\nphotos. This offers objective and convenient therapy monitoring, while being\naccessible to patients from their home at any time. However, despite research\nin mobile image segmentation, there is a lack of focus on mobile wound\nsegmentation. To address this gap, we conduct initial research on three\nlightweight architectures to investigate their suitability for smartphone-based\nwound segmentation. Using public datasets and UNet as a baseline, our results\nare promising, with both ENet and TopFormer, as well as the larger UNeXt\nvariant, showing comparable performance to UNet. Furthermore, we deploy the\nmodels into a smartphone app for visual assessment of live segmentation, where\nresults demonstrate the effectiveness of TopFormer in distinguishing wounds\nfrom wound-coloured objects. While our study highlights the potential of\ntransformer models for mobile wound segmentation, future work should aim to\nfurther improve the mask contours.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Gpmhh-Ygkw3UXhVgWPEU7eWwajMKh3ANZVId-8Iah_c","pdfSize":"5912111","objectId":"0x410ff220520b6971d08bb0c67194f71145d33634d2f95222a38d9b69f28d77f5","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
