{"id":"2407.18777","title":"Three-dimensional multi-physics simulation and sensitivity analysis of\n  cyclic hydrogen storage in salt caverns","authors":"Herm\\'inio Tasinafo Hon\\'orio and Hadi Hajibeygi","authorsParsed":[["Honório","Hermínio Tasinafo",""],["Hajibeygi","Hadi",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 14:39:53 GMT"}],"updateDate":"2024-07-29","timestamp":1722004793000,"abstract":"  Large-scale storage technologies are crucial to balance consumption and\nintermittent production of renewable energy systems. One of these technologies\ncan be developed by converting the excess energy into compressed air or\nhydrogen, i.e., compressed gas, and store it in underground solution-mined salt\ncaverns. Salt caverns are proven seals towards compressed air and hydrogen.\nHowever, several challenges including fast injection/production cycles and\noperating them in a system of caverns fields are yet to be resolved in order to\nallow for their safe scaled-up utilization for energy storage. The present\nstudy investigates time-dependent mechanical behaviors of salt caverns,\nindividually and in multi-cavern systems. The stress conditions and model\nconstructions are chosen to be relevant for underground energy storage purpose,\nand reflect the essential microscopic deformation mechanisms for reliable\npredictions. Built on these, the impact of model calibration and parameter\nestimation on cavern-scale performance are investigated. Moreover, the impact\nof the transient and reverse creep, cavern complex geometry, and non-salt\ninterlayers on salt cavern performance are studied in detail. Importantly, the\npresented studies include quantification of the interaction of the caverns in a\nsystem of caverns. These are achieved by developing an open-source\nthree-dimensional finite element simulator, named as \"SafeInCave\", which also\nincorporates a comprehensive salt rock constitutive model. The findings provide\ninsights into improving the reliability of numerical simulations for safe and\nefficient operation of salt caverns in energy storage applications.\n","subjects":["Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ovRDdheXACCYub70fEqW4Xc72T-rEogKeiAFU6Z8yjY","pdfSize":"8444816","objectId":"0x441b7ffaf82abf79f45030ebda6f291e427be95f614771b507db9726b15f1102","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
