{"id":"2407.06211","title":"Synthetic data: How could it be used for infectious disease research?","authors":"Styliani-Christina Fragkouli, Dhwani Solanki, Leyla J Castro, Fotis E\n  Psomopoulos, N\\'uria Queralt-Rosinach, Davide Cirillo, Lisa C Crossman","authorsParsed":[["Fragkouli","Styliani-Christina",""],["Solanki","Dhwani",""],["Castro","Leyla J",""],["Psomopoulos","Fotis E",""],["Queralt-Rosinach","Núria",""],["Cirillo","Davide",""],["Crossman","Lisa C",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 17:13:04 GMT"}],"updateDate":"2024-07-10","timestamp":1720026784000,"abstract":"  Over the last three to five years, it has become possible to generate machine\nlearning synthetic data for healthcare-related uses. However, concerns have\nbeen raised about potential negative factors associated with the possibilities\nof artificial dataset generation. These include the potential misuse of\ngenerative artificial intelligence (AI) in fields such as cybercrime, the use\nof deepfakes and fake news to deceive or manipulate, and displacement of human\njobs across various market sectors.\n  Here, we consider both current and future positive advances and possibilities\nwith synthetic datasets. Synthetic data offers significant benefits,\nparticularly in data privacy, research, in balancing datasets and reducing bias\nin machine learning models. Generative AI is an artificial intelligence genre\ncapable of creating text, images, video or other data using generative models.\nThe recent explosion of interest in GenAI was heralded by the invention and\nspeedy move to use of large language models (LLM). These computational models\nare able to achieve general-purpose language generation and other natural\nlanguage processing tasks and are based on transformer architectures, which\nmade an evolutionary leap from previous neural network architectures.\n  Fuelled by the advent of improved GenAI techniques and wide scale usage, this\nis surely the time to consider how synthetic data can be used to advance\ninfectious disease research. In this commentary we aim to create an overview of\nthe current and future position of synthetic data in infectious disease\nresearch.\n","subjects":["Quantitative Biology/Other Quantitative Biology","Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zUlPLyhhhEGuDJA8YY-bnFRp56v5y4GlkErl3x8GKkA","pdfSize":"182813"}
