{"id":"2407.01530","title":"xLSTM-UNet can be an Effective 2D & 3D Medical Image Segmentation\n  Backbone with Vision-LSTM (ViL) better than its Mamba Counterpart","authors":"Tianrun Chen, Chaotao Ding, Lanyun Zhu, Tao Xu, Deyi Ji, Yan Wang,\n  Ying Zang, Zejian Li","authorsParsed":[["Chen","Tianrun",""],["Ding","Chaotao",""],["Zhu","Lanyun",""],["Xu","Tao",""],["Ji","Deyi",""],["Wang","Yan",""],["Zang","Ying",""],["Li","Zejian",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 17:59:54 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 15:45:25 GMT"}],"updateDate":"2024-07-03","timestamp":1719856794000,"abstract":"  Convolutional Neural Networks (CNNs) and Vision Transformers (ViT) have been\npivotal in biomedical image segmentation, yet their ability to manage\nlong-range dependencies remains constrained by inherent locality and\ncomputational overhead. To overcome these challenges, in this technical report,\nwe first propose xLSTM-UNet, a UNet structured deep learning neural network\nthat leverages Vision-LSTM (xLSTM) as its backbone for medical image\nsegmentation. xLSTM is a recently proposed as the successor of Long Short-Term\nMemory (LSTM) networks and have demonstrated superior performance compared to\nTransformers and State Space Models (SSMs) like Mamba in Neural Language\nProcessing (NLP) and image classification (as demonstrated in Vision-LSTM, or\nViL implementation). Here, xLSTM-UNet we designed extend the success in\nbiomedical image segmentation domain. By integrating the local feature\nextraction strengths of convolutional layers with the long-range dependency\ncapturing abilities of xLSTM, xLSTM-UNet offers a robust solution for\ncomprehensive image analysis. We validate the efficacy of xLSTM-UNet through\nexperiments. Our findings demonstrate that xLSTM-UNet consistently surpasses\nthe performance of leading CNN-based, Transformer-based, and Mamba-based\nsegmentation networks in multiple datasets in biomedical segmentation including\norgans in abdomen MRI, instruments in endoscopic images, and cells in\nmicroscopic images. With comprehensive experiments performed, this technical\nreport highlights the potential of xLSTM-based architectures in advancing\nbiomedical image analysis in both 2D and 3D. The code, models, and datasets are\npublicly available at http://tianrun-chen.github.io/xLSTM-UNet/\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ZSIRVOYyNn_THmW1_6QHgh-4tYJvlR8IySZIp5Jrw5o","pdfSize":"3248702","objectId":"0xa126ae10861df393601ed1b3adeac007cd30de68bab554c1ceca9ae3cf323896","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
