{"id":"2407.12299","title":"Dispersive Bootstrap of Massive Inflation Correlators","authors":"Haoyuan Liu, Zhehan Qin, Zhong-Zhi Xianyu","authorsParsed":[["Liu","Haoyuan",""],["Qin","Zhehan",""],["Xianyu","Zhong-Zhi",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 03:41:08 GMT"}],"updateDate":"2024-07-18","timestamp":1721187668000,"abstract":"  Inflation correlators with massive exchanges are central observables of\ncosmological collider physics, and are also important theoretical data for us\nto better understand quantum field theories in dS. However, they are difficult\nto compute directly due to many technical complications of the\nSchwinger-Keldysh integral. In this work, we initiate a new bootstrap program\nfor massive inflation correlators with dispersion relations on complex momentum\nplanes. We classify kinematic variables of a correlator into vertex energies\nand line energies, and develop two distinct types of dispersion relations for\nboth of them, respectively called vertex dispersion and line dispersion\nrelations. These dispersion methods allow us to obtain full analytical results\nof massive correlators from a knowledge of their oscillatory signals alone,\nwhile the oscillatory signal at the tree level can be related to simpler\nsubgraphs via the cutting rule. We further apply this method to massive loop\ncorrelators, and obtain new analytical expressions for loop diagrams much\nsimpler than existing results from spectral decomposition. In particular, we\nshow that the analyticity demands the existence of an \"irreducible background\"\nin the loop correlator, which is unambiguously defined, free of UV divergence,\nand independent of renormalization schemes.\n","subjects":["Physics/High Energy Physics - Theory","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ueq90W4MA9mvSZa8_VYUHEyo81p9h9OlTfarHK6AcNA","pdfSize":"1146238","objectId":"0x2b966ad762bbf3497429428cdfc03617e8d3dd852f7f86d9a7eee6b2f47bf91b","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
