{"id":"2407.17663","title":"Explaining the Model, Protecting Your Data: Revealing and Mitigating the\n  Data Privacy Risks of Post-Hoc Model Explanations via Membership Inference","authors":"Catherine Huang, Martin Pawelczyk, Himabindu Lakkaraju","authorsParsed":[["Huang","Catherine",""],["Pawelczyk","Martin",""],["Lakkaraju","Himabindu",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 22:16:37 GMT"}],"updateDate":"2024-07-29","timestamp":1721859397000,"abstract":"  Predictive machine learning models are becoming increasingly deployed in\nhigh-stakes contexts involving sensitive personal data; in these contexts,\nthere is a trade-off between model explainability and data privacy. In this\nwork, we push the boundaries of this trade-off: with a focus on foundation\nmodels for image classification fine-tuning, we reveal unforeseen privacy risks\nof post-hoc model explanations and subsequently offer mitigation strategies for\nsuch risks. First, we construct VAR-LRT and L1/L2-LRT, two new membership\ninference attacks based on feature attribution explanations that are\nsignificantly more successful than existing explanation-leveraging attacks,\nparticularly in the low false-positive rate regime that allows an adversary to\nidentify specific training set members with confidence. Second, we find\nempirically that optimized differentially private fine-tuning substantially\ndiminishes the success of the aforementioned attacks, while maintaining high\nmodel accuracy. We carry out a systematic empirical investigation of our 2 new\nattacks with 5 vision transformer architectures, 5 benchmark datasets, 4\nstate-of-the-art post-hoc explanation methods, and 4 privacy strength settings.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lRSEE5QkoSnvMoFDd3GvjDWRn9LyoKKSVKQj9CncbwM","pdfSize":"4342791","objectId":"0xe5efd2cb0a2ea57614bdf8a6e4f27ee01e97f4b0646fae3053e566ba1a1c9180","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
