{"id":"2407.02213","title":"Network Theory in Galaxy Distributions: The Coma Supercluster\n  Neighborhood","authors":"Evelise Gausmann and Fabricio Ferrari","authorsParsed":[["Gausmann","Evelise",""],["Ferrari","Fabricio",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 12:27:00 GMT"}],"updateDate":"2024-07-03","timestamp":1719923220000,"abstract":"  In this work, we use the theory of spatial networks to analyze galaxy\ndistributions. The aim is to develop new approaches to study the spatial galaxy\nenvironment properties by means of the network parameters. We investigate how\neach of the network parameters (degree, closeness and betweeness centrality;\ndiameter; giant component; transitivity) map the cluster structure and\nproperties. We measure the network parameters of galaxy samples comprising the\nComa Supercluster and 4 regions in their neighborhood ($z<0.0674$) using the\ncatalog produced by \\citet{tempel2014flux}. For comparison we repeat the same\nprocedures for Random Geometric Graphs and Segment Cox process, generated with\nthe same dimensions and mean density of nodes. We found that there is a strong\ncorrelation between degree centrality and the normalized environmental density.\nAlso, at high degrees there are more elliptical than spiral galaxies, which\nconfirms the density-morphology relation. The mean degree as a function of the\nconnection radius is an estimator of the count-of-spheres and consequently\nprovides the correlation dimension as a function of the connection radius. The\ncorrelation dimension indicates high clustering at scales indicated by the\nnetwork diameter. Further, at this scales, high values of betweeness centrality\ncharacterize galaxy bridges connecting dense regions, tracing very well the\nfilamentary structures. Then, since galaxies with the highest closeness\ncentrality belongs to the largest components of the network, associated to\nsupercluster regions, we can produce a catalog of superclusters only by\nextracting the largest connected components of the network. Establishing the\ncorrelation between the well-studied normalized environmental densities and the\nparameters of the network theory allows us to develop alternative tools to the\nstudy of the large-scale structures.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies","Computing Research Repository/Computational Engineering, Finance, and Science","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"I5pC1znLmK9isx08gDrS6Q8e_0imXJ3Rni1VV3K6Zx0","pdfSize":"7291572","objectId":"0x0aa71a733d89483e0cbc85c51132660fd413efb89972949c708861931126fb90","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
