{"id":"2407.13090","title":"Enhanced Denoising of OCT Images Using Residual U-Net: A Cross-Modality\n  Approach on PSOCT and ASOCT for Clinical Diagnostics","authors":"Akkidas Noel Prakasha, Jahnvi Sai Gantaa, Ramaswami Krishnadasb, Tin\n  A. Tunc, Satish K Pandaa","authorsParsed":[["Prakasha","Akkidas Noel",""],["Gantaa","Jahnvi Sai",""],["Krishnadasb","Ramaswami",""],["Tunc","Tin A.",""],["Pandaa","Satish K",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 01:35:03 GMT"}],"updateDate":"2024-07-19","timestamp":1721266503000,"abstract":"  Optical Coherence Tomography (OCT) imaging is pivotal in diagnosing\nophthalmic conditions by providing detailed cross-sectional images of the\nanterior and posterior segments of the eye. Nonetheless, speckle noise and\nother imaging artifacts inherent to OCT impede the accuracy of diagnosis\nsignificantly. In this study, we proposed an enhanced denoising model using a\nResidual U-Net architecture that effectively diminishes noise and improves\nimage clarity across both Anterior Segment OCT (ASOCT) and\npolarization-sensitive OCT (PSOCT) images. Our approach demonstrated\nsubstantial improvements in image quality metrics: the Peak Signal Noise Ratio\n(PSNR) was 34.343 $\\pm$ 1.113 for PSOCT images, and Structural Similarity Index\nMeasure (SSIM) values were 0.885 $\\pm$ 0.030, indicating enhanced preservation\nof tissue integrity and textural details. For ASOCT images, we observed the\nPSNR to be 23.525 $\\pm$ 0.872 dB and SSIM 0.407 $\\pm$ 0.044, reflecting\nsignificant enhancements in visual quality and structural accuracy. These\nmetrics substantiate the models efficacy in not only reducing noise but also in\nmaintaining crucial anatomical features, thereby enabling more precise and\nefficient clinical evaluations. The dual functionality across both ASOCT and\nPSOCT modalities underscores the versatility and potential for broad\napplication in clinical settings, optimizing diagnostic processes and reducing\nthe necessity for prolonged imaging sessions.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"R1VLHaz6h-xf0DNB9l96Rtp_qtclKqIjwZPuHGPgzSk","pdfSize":"1373561","objectId":"0xcb610562b124e966d86a709b6c430263c5ece0f7a47dc0203ac1859fef0526fc","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
