{"id":"2407.15552","title":"Viologen-based supramolecular crystal gels: gelation kinetics and\n  sensitivity to temperature","authors":"Julien Bauland, Vivien Andrieux, Fr\\'ed\\'eric Pignon, Denis Frath,\n  Christophe Bucher, Thomas Gibaud","authorsParsed":[["Bauland","Julien",""],["Andrieux","Vivien",""],["Pignon","Frédéric",""],["Frath","Denis",""],["Bucher","Christophe",""],["Gibaud","Thomas",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 11:28:16 GMT"}],"updateDate":"2024-07-23","timestamp":1721647696000,"abstract":"  Supramolecular crystal gels, a subset of molecular gels, form through\nself-assembly of low molecular weight gelators into interconnecting crystalline\nfibers, creating a three-dimensional soft solid network. This study focuses on\nthe formation and properties of viologen-based supramolecular crystalline gels.\nIt aims to answer key questions about the tunability of network properties and\nthe origin of these properties through in-depth analyses of the gelation\nkinetics triggered by thermal quenching. Experimental investigations, including\nUV-Vis absorption spectroscopy, rheology, microscopy and scattering\nmeasurements, contribute to a comprehensive and self-consistent understanding\nof the system kinetics. We confirm that the viologen-based gelators crystallize\ninto nanometer radius hollow tubes that assemble into micro to millimetric\nspherulites. We then show that the crystallization follows the Avrami theory\nand is based on pre-existing nuclei. We also establish that the growth is\ninterface controlled leading to the hollow tubes to branch into spherulites\nwith fractal structures. Finally, we demonstrate that the gel properties can be\ntuned depending on the quenching temperature. Lowering the temperature results\nin the formation of denser and smaller spherulites. In contrast, the gels\nelasticity is not significantly affected by the quench temperature, leading us\nto hypothesize that the spherulites densification occurs at the expense of the\nconnectivity between spherulite.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Qd3eBmbx0lSjbGOQPzPze8LRJQxFUq6zKrOV_6kUf2A","pdfSize":"4551657","objectId":"0x73f9662715243bab59328827744a8945fc62161fc9da7648418bc65a91f3f09e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
