{"id":"2407.05414","title":"Velocity-Resolved Ionization Mapping of Broad Line Region. I. Insights\n  into Diverse Geometry and Kinematics","authors":"Sha-Sha Li, Hai-Cheng Feng, H. T. Liu, J. M. Bai, Xiang Ji, Cheng\n  Cheng, Kai-Xing Lu, Jian-Guo Wang, Rui Li","authorsParsed":[["Li","Sha-Sha",""],["Feng","Hai-Cheng",""],["Liu","H. T.",""],["Bai","J. M.",""],["Ji","Xiang",""],["Cheng","Cheng",""],["Lu","Kai-Xing",""],["Wang","Jian-Guo",""],["Li","Rui",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 15:37:20 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 07:30:28 GMT"}],"updateDate":"2024-08-29","timestamp":1720366640000,"abstract":"  Broad emission lines of active galactic nuclei (AGNs) originate from the\nbroad-line region (BLR), consisting of dense gas clouds in orbit around an\naccreting supermassive black hole. Understanding the geometry and kinematics of\nthe region is crucial for gaining insights into the physics and evolution of\nAGNs. Conventional velocity-resolved reverberation mapping may face challenges\nin disentangling the degeneracy between intricate motion and geometry of this\nregion. To address this challenge, new key constraints are required. Here, we\nreport the discovery of an asymmetric BLR using a novel technique:\nvelocity-resolved ionization mapping, which can map the distance of emitting\ngas clouds by measuring Hydrogen line ratios at different velocities. By\nanalyzing spectroscopic monitoring data, we find that the Balmer decrement is\nanticorrelated with the continuum and correlated with the lags across broad\nemission line velocities. Some line ratio profiles deviate from the\nexpectations for a symmetrically virialized BLR, suggesting that the\nred-shifted and blue-shifted gas clouds may not be equidistant from the\nsupermassive black hole (SMBH). This asymmetric geometry might represent a\nformation imprint, provide new perspectives on the evolution of AGNs, and\ninfluence SMBH mass measurements.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TxCFXgTygVdfUsTacicfH1uWvBKGA8s1bWKltiWG25Y","pdfSize":"5270449"}
