{"id":"2407.14650","title":"Auditing the Grid-Based Placement of Private Label Products on\n  E-commerce Search Result Pages","authors":"Siddharth D Jaiswal, Abhisek Dash, Nitika Shroff, Yashwanth Babu\n  Vunnam, Saptarshi Ghosh, Animesh Mukherjee","authorsParsed":[["Jaiswal","Siddharth D",""],["Dash","Abhisek",""],["Shroff","Nitika",""],["Vunnam","Yashwanth Babu",""],["Ghosh","Saptarshi",""],["Mukherjee","Animesh",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 20:01:30 GMT"}],"updateDate":"2024-07-23","timestamp":1721419290000,"abstract":"  E-commerce platforms support the needs and livelihoods of their two most\nimportant stakeholders -- customers and producers/sellers. Multiple algorithmic\nsystems, like ``search'' systems mediate the interactions between these\nstakeholders by connecting customers to producers with relevant items. Search\nresults include (i) private label (PL) products that are manufactured/sold by\nthe platform itself, as well as (ii) third-party products on advertised /\nsponsored and organic positions. In this paper, we systematically quantify the\nextent of PL product promotion on e-commerce search results for the two largest\ne-commerce platforms operating in India -- Amazon.in and Flipkart. By analyzing\nsnapshots of search results across the two platforms, we discover high PL\npromotion on the initial result pages (~ 15% PLs are advertised on the first\nSERP of Amazon). Both platforms use different strategies to promote their PL\nproducts, such as placing more PLs on the advertised positions -- while Amazon\nplaces them on the first, middle, and last rows of the search results, Flipkart\nplaces them on the first two positions and the (entire) last column of the\nsearch results. We discover that these product placement strategies of both\nplatforms conform with existing user attention strategies proposed in the\nliterature. Finally, to supplement the findings from the collected data, we\nconduct a survey among 68 participants on Amazon Mechanical Turk. The click\npattern from our survey shows that users strongly prefer to click on products\nplaced at positions that correspond to the PL products on the search results of\nAmazon, but not so strongly on Flipkart. The click-through rate follows\npreviously proposed theoretically grounded user attention distribution patterns\nin a two-dimensional layout.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CZ-CGHoXauC5Rn0dLis7_jEbzLlqpW6xnXD2_kHriVw","pdfSize":"2703433","objectId":"0x38a81dd5bdbdf9b1396b74f4c8f27682151e7f6fd6643201d93add5cc7139ac3","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
