{"id":"2407.16646","title":"ExaWorks Software Development Kit: A Robust and Scalable Collection of\n  Interoperable Workflow Technologies","authors":"Matteo Turilli, Mihael Hategan-Marandiuc, Mikhail Titov, Ketan\n  Maheshwari, Aymen Alsaadi, Andre Merzky, Ramon Arambula, Mikhail\n  Zakharchanka, Matt Cowan, Justin M. Wozniak, Andreas Wilke, Ozgur Ozan Kilic,\n  Kyle Chard, Rafael Ferreira da Silva, Shantenu Jha and Daniel Laney","authorsParsed":[["Turilli","Matteo",""],["Hategan-Marandiuc","Mihael",""],["Titov","Mikhail",""],["Maheshwari","Ketan",""],["Alsaadi","Aymen",""],["Merzky","Andre",""],["Arambula","Ramon",""],["Zakharchanka","Mikhail",""],["Cowan","Matt",""],["Wozniak","Justin M.",""],["Wilke","Andreas",""],["Kilic","Ozgur Ozan",""],["Chard","Kyle",""],["da Silva","Rafael Ferreira",""],["Jha","Shantenu",""],["Laney","Daniel",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:00:09 GMT"}],"updateDate":"2024-07-24","timestamp":1721754009000,"abstract":"  Scientific discovery increasingly requires executing heterogeneous scientific\nworkflows on high-performance computing (HPC) platforms. Heterogeneous\nworkflows contain different types of tasks (e.g., simulation, analysis, and\nlearning) that need to be mapped, scheduled, and launched on different\ncomputing. That requires a software stack that enables users to code their\nworkflows and automate resource management and workflow execution. Currently,\nthere are many workflow technologies with diverse levels of robustness and\ncapabilities, and users face difficult choices of software that can effectively\nand efficiently support their use cases on HPC machines, especially when\nconsidering the latest exascale platforms. We contributed to addressing this\nissue by developing the ExaWorks Software Development Kit (SDK). The SDK is a\ncurated collection of workflow technologies engineered following current best\npractices and specifically designed to work on HPC platforms. We present our\nexperience with (1) curating those technologies, (2) integrating them to\nprovide users with new capabilities, (3) developing a continuous integration\nplatform to test the SDK on DOE HPC platforms, (4) designing a dashboard to\npublish the results of those tests, and (5) devising an innovative\ndocumentation platform to help users to use those technologies. Our experience\ndetails the requirements and the best practices needed to curate workflow\ntechnologies, and it also serves as a blueprint for the capabilities and\nservices that DOE will have to offer to support a variety of scientific\nheterogeneous workflows on the newly available exascale HPC platforms.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8jV_09Do77neF8z-5kkiUcbqk9kL-S2AzYxPB7ZXbgU","pdfSize":"1479996","objectId":"0xb330ac562f05f8557b124a131040d6dc3e7e15642051c3e40286786f70cbfac7","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
