{"id":"2407.19513","title":"Giant Purcell broadening and Lamb shift for DNA-assembled near-infrared\n  quantum emitters","authors":"Sachin Verlekar, Maria Sanz-Paz, Mario Zapata-Herrera, Mauricio\n  Pilo-Pais, Karol Kolataj, Ruben Esteban, Javier Aizpurua, Guillermo Acuna,\n  Christophe Galland","authorsParsed":[["Verlekar","Sachin",""],["Sanz-Paz","Maria",""],["Zapata-Herrera","Mario",""],["Pilo-Pais","Mauricio",""],["Kolataj","Karol",""],["Esteban","Ruben",""],["Aizpurua","Javier",""],["Acuna","Guillermo",""],["Galland","Christophe",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 15:35:04 GMT"}],"updateDate":"2024-07-30","timestamp":1722180904000,"abstract":"  Controlling the light emitted by individual molecules is instrumental to a\nnumber of novel nanotechnologies ranging from super-resolution bio-imaging and\nmolecular sensing to quantum nanophotonics. Molecular emission can be tailored\nby modifying the local photonic environment, for example by precisely placing a\nsingle molecule inside a plasmonic nanocavity with the help of DNA origami.\nHere, using this scalable approach, we show that commercial fluorophores\nexperience giant Purcell factors and Lamb shifts, reaching values on par with\nthose recently reported in scanning tip experiments. Engineering of plasmonic\nmodes enables cavity-mediated fluorescence far detuned from the\nzero-phonon-line (ZPL) - at detunings that are up to two orders of magnitude\nlarger than the fluorescence linewidth of the bare emitter and reach into the\nnear-infrared. Our results evidence a regime where the emission linewidth is\ndominated by the excited state lifetime, as required for indistinguishable\nphoton emission, baring relevance to the development of nanoscale, ultrafast\nquantum light sources and to the quest toward single-molecule cavity-QED. In\nthe future, this approach may also allow to design efficient quantum emitters\nat infrared wavelengths, where standard organic sources have a reduced\nperformance.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"AqFzn3Zo1iKM2My2Y9Yu-pLbNYjqIr16ggCYfhFwGY8","pdfSize":"34344058","objectId":"0xcbab346e140d8ca786e2a6cf3342e99f70cb3dfc8447d8ab0186fca32aa8734e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
