{"id":"2407.15350","title":"WTS: A Pedestrian-Centric Traffic Video Dataset for Fine-grained\n  Spatial-Temporal Understanding","authors":"Quan Kong, Yuki Kawana, Rajat Saini, Ashutosh Kumar, Jingjing Pan, Ta\n  Gu, Yohei Ozao, Balazs Opra, David C. Anastasiu, Yoichi Sato, Norimasa Kobori","authorsParsed":[["Kong","Quan",""],["Kawana","Yuki",""],["Saini","Rajat",""],["Kumar","Ashutosh",""],["Pan","Jingjing",""],["Gu","Ta",""],["Ozao","Yohei",""],["Opra","Balazs",""],["Anastasiu","David C.",""],["Sato","Yoichi",""],["Kobori","Norimasa",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 03:29:22 GMT"}],"updateDate":"2024-07-23","timestamp":1721618962000,"abstract":"  In this paper, we address the challenge of fine-grained video event\nunderstanding in traffic scenarios, vital for autonomous driving and safety.\nTraditional datasets focus on driver or vehicle behavior, often neglecting\npedestrian perspectives. To fill this gap, we introduce the WTS dataset,\nhighlighting detailed behaviors of both vehicles and pedestrians across over\n1.2k video events in hundreds of traffic scenarios. WTS integrates diverse\nperspectives from vehicle ego and fixed overhead cameras in a\nvehicle-infrastructure cooperative environment, enriched with comprehensive\ntextual descriptions and unique 3D Gaze data for a synchronized 2D/3D view,\nfocusing on pedestrian analysis. We also pro-vide annotations for 5k publicly\nsourced pedestrian-related traffic videos. Additionally, we introduce\nLLMScorer, an LLM-based evaluation metric to align inference captions with\nground truth. Using WTS, we establish a benchmark for dense video-to-text\ntasks, exploring state-of-the-art Vision-Language Models with an instance-aware\nVideoLLM method as a baseline. WTS aims to advance fine-grained video event\nunderstanding, enhancing traffic safety and autonomous driving development.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"61Gz5UlWkLrLAuNcPM26IYe-vIyujsX9V7IGGw4yVHU","pdfSize":"6479048","objectId":"0xb60927eee51d33f4a87586385795a2527a1b7424e13010d2ae2eec9c83f72c5a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
