{"id":"2407.04157","title":"Finite Operator Learning: Bridging Neural Operators and Numerical\n  Methods for Efficient Parametric Solution and Optimization of PDEs","authors":"Shahed Rezaei, Reza Najian Asl, Kianoosh Taghikhani, Ahmad Moeineddin,\n  Michael Kaliske, Markus Apel","authorsParsed":[["Rezaei","Shahed",""],["Asl","Reza Najian",""],["Taghikhani","Kianoosh",""],["Moeineddin","Ahmad",""],["Kaliske","Michael",""],["Apel","Markus",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 21:23:12 GMT"}],"updateDate":"2024-07-08","timestamp":1720128192000,"abstract":"  We introduce a method that combines neural operators, physics-informed\nmachine learning, and standard numerical methods for solving PDEs. The proposed\napproach extends each of the aforementioned methods and unifies them within a\nsingle framework. We can parametrically solve partial differential equations in\na data-free manner and provide accurate sensitivities, meaning the derivatives\nof the solution space with respect to the design space. These capabilities\nenable gradient-based optimization without the typical sensitivity analysis\ncosts, unlike adjoint methods that scale directly with the number of response\nfunctions. Our Finite Operator Learning (FOL) approach uses an uncomplicated\nfeed-forward neural network model to directly map the discrete design space\n(i.e. parametric input space) to the discrete solution space (i.e. finite\nnumber of sensor points in the arbitrary shape domain) ensuring compliance with\nphysical laws by designing them into loss functions. The discretized governing\nequations, as well as the design and solution spaces, can be derived from any\nwell-established numerical techniques. In this work, we employ the Finite\nElement Method (FEM) to approximate fields and their spatial derivatives.\nSubsequently, we conduct Sobolev training to minimize a multi-objective loss\nfunction, which includes the discretized weak form of the energy functional,\nboundary conditions violations, and the stationarity of the residuals with\nrespect to the design variables. Our study focuses on the steady-state heat\nequation within heterogeneous materials that exhibits significant phase\ncontrast and possibly temperature-dependent conductivity. The network's tangent\nmatrix is directly used for gradient-based optimization to improve the\nmicrostructure's heat transfer characteristics. ...\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"tINfT6WkDRk3Eke0-gX4LBH3GXkb7-LdBPDsHF_ygx0","pdfSize":"18157799"}
