{"id":"2407.16680","title":"A Simulation Benchmark for Autonomous Racing with Large-Scale Human Data","authors":"Adrian Remonda, Nicklas Hansen, Ayoub Raji, Nicola Musiu, Marko\n  Bertogna, Eduardo Veas, Xiaolong Wang","authorsParsed":[["Remonda","Adrian",""],["Hansen","Nicklas",""],["Raji","Ayoub",""],["Musiu","Nicola",""],["Bertogna","Marko",""],["Veas","Eduardo",""],["Wang","Xiaolong",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:45:16 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 10:58:48 GMT"}],"updateDate":"2024-07-25","timestamp":1721756716000,"abstract":"  Despite the availability of international prize-money competitions, scaled\nvehicles, and simulation environments, research on autonomous racing and the\ncontrol of sports cars operating close to the limit of handling has been\nlimited by the high costs of vehicle acquisition and management, as well as the\nlimited physics accuracy of open-source simulators. In this paper, we propose a\nracing simulation platform based on the simulator Assetto Corsa to test,\nvalidate, and benchmark autonomous driving algorithms, including reinforcement\nlearning (RL) and classical Model Predictive Control (MPC), in realistic and\nchallenging scenarios. Our contributions include the development of this\nsimulation platform, several state-of-the-art algorithms tailored to the racing\nenvironment, and a comprehensive dataset collected from human drivers.\nAdditionally, we evaluate algorithms in the offline RL setting. All the\nnecessary code (including environment and benchmarks), working examples,\ndatasets, and videos are publicly released and can be found at:\nhttps://assetto-corsa-gym.github.io\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Pe0QLR-ih3_Fp-RgXrWazt3Spbb5-BgRrtE97cfuJko","pdfSize":"8256248","objectId":"0xe7a49656baaf9e11f4006b5e11b579076418dd9bd6a75aadbef2b1fd94de32e9","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
