{"id":"2407.06521","title":"Beamforming Design for Joint Target Sensing and Proactive Eavesdropping","authors":"Qian Dan, Hongjiang Lei, Ki-Hong Park, Gaofeng Pan, Mohamed-Slim\n  Alouini","authorsParsed":[["Dan","Qian",""],["Lei","Hongjiang",""],["Park","Ki-Hong",""],["Pan","Gaofeng",""],["Alouini","Mohamed-Slim",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 03:28:01 GMT"}],"updateDate":"2024-07-10","timestamp":1720495681000,"abstract":"  This work studies the beamforming design in the joint target sensing and\nproactive eavesdropping (JTSAPE) system. The JTSAPE base station (BS) receives\nthe information transmitted by the illegal transmitter and transmits the\nwaveform for target sensing. The shared waveform also serves as artificial\nnoise to interfere with the illegal receiver, thereby achieving proactive\neavesdropping. We firstly optimize the transmitting beam of the BS to maximize\nthe eavesdropping signal-to-interference-plus-noise ratio or minimize the\ntarget estimation parameter Cram{\\'{e}}r-Rao bound, respectively. Then, the\njoint optimization of proactive eavesdropping and target sensing is\ninvestigated, and the normalized weighted optimization problem is formulated.\nTo address the complexity of the original problem, the formulated problem is\ndecomposed into two subproblems: proactive eavesdropping and target sensing,\nwhich are solved by the semi-definite relaxation technique. Furthermore, the\nscenario in which the quality of the eavesdropping channel is stronger than\nthat of the illegal channel is considered. We utilize the sequential rank-one\nconstraint relaxation method and iteration technique to obtain the high-quality\nsuboptimal solution of the beam transmit covariance matrix. Numerical\nsimulation shows the effectiveness of our proposed algorithm.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8lm2hz84tR-1sPHL8kbS9GjkyY0oKzsgd0DdOViT26Y","pdfSize":"616612"}
