{"id":"2407.15150","title":"First-principles study of structural and electronic properties of\n  multiferroic oxide Mn3TeO6 under high pressure","authors":"Xiao-Long Pan, Hao Wang, Lei Liu, Xiang-Rong Chen, Hua Y. Geng","authorsParsed":[["Pan","Xiao-Long",""],["Wang","Hao",""],["Liu","Lei",""],["Chen","Xiang-Rong",""],["Geng","Hua Y.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 13:03:11 GMT"}],"updateDate":"2024-07-23","timestamp":1721566991000,"abstract":"  Mn3TeO6 (MTO) has been experimentally found to adopt a P21/n structure under\nhigh pressure, which exhibits a significantly smaller band gap compared to the\natmospheric R-3 phase. In this study, we systematically investigate the\nmagnetism, structural phase transition and electronic properties of MTO under\nhigh pressure through first-principles calculations. Both R-3 and P21/n phases\nof MTO are antiferromagnetic at zero temperature. The R-3 phase transforms to\nthe P21/n phase at 7.58 GPa, accompanied by a considerable volume collapse of\nabout 6.47%. Employing the accurate method that combines DFT+U and G0W0, the\ncalculated band gap of R-3 phase at zero pressure is very close to the\nexperimental values, while that of the P21/n phase is significantly\noverestimated. The main reason for this difference is that the experimental\nstudy incorrectly used the Kubelka-Munk plot for the indirect band gap to\nobtain the band gap of the P21/n phase instead of the Kubelka-Munk plot for the\ndirect band gap. Furthermore, our study reveals that the transition from the\nR-3 phase to the P21/n phase is accompanied by a slight reduction in the band\ngap.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Other Condensed Matter","Physics/Applied Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pmtB0apdYl6N02jowqeo-nEAbV4WeRy0T9OtkmHlKnQ","pdfSize":"1951889","objectId":"0xc7cb46fd2851be330f74c9a247027940594c41f13881ea7ad10b9c1a99aef4ad","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
