{"id":"2407.17197","title":"ALPI: Auto-Labeller with Proxy Injection for 3D Object Detection using\n  2D Labels Only","authors":"Saad Lahlali, Nicolas Granger, Herv\\'e Le Borgne, Quoc-Cuong Pham","authorsParsed":[["Lahlali","Saad",""],["Granger","Nicolas",""],["Borgne","Hervé Le",""],["Pham","Quoc-Cuong",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 11:58:31 GMT"}],"updateDate":"2024-07-25","timestamp":1721822311000,"abstract":"  3D object detection plays a crucial role in various applications such as\nautonomous vehicles, robotics and augmented reality. However, training 3D\ndetectors requires a costly precise annotation, which is a hindrance to scaling\nannotation to large datasets. To address this challenge, we propose a weakly\nsupervised 3D annotator that relies solely on 2D bounding box annotations from\nimages, along with size priors. One major problem is that supervising a 3D\ndetection model using only 2D boxes is not reliable due to ambiguities between\ndifferent 3D poses and their identical 2D projection. We introduce a simple yet\neffective and generic solution: we build 3D proxy objects with annotations by\nconstruction and add them to the training dataset. Our method requires only\nsize priors to adapt to new classes. To better align 2D supervision with 3D\ndetection, our method ensures depth invariance with a novel expression of the\n2D losses. Finally, to detect more challenging instances, our annotator follows\nan offline pseudo-labelling scheme which gradually improves its 3D\npseudo-labels. Extensive experiments on the KITTI dataset demonstrate that our\nmethod not only performs on-par or above previous works on the Car category,\nbut also achieves performance close to fully supervised methods on more\nchallenging classes. We further demonstrate the effectiveness and robustness of\nour method by being the first to experiment on the more challenging nuScenes\ndataset. We additionally propose a setting where weak labels are obtained from\na 2D detector pre-trained on MS-COCO instead of human annotations.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"qtkog3wisrgVPZmfzzv-CugHEwtQjpkoD5tBo7wnW2M","pdfSize":"785596","objectId":"0x73edeac67551e9763b0400c947928f5135893557e3bf5c7d35b57bf9175a6dc7","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
