{"id":"2405.20956","title":"A Robot Walks into a Bar: Can Language Models Serve as Creativity\n  Support Tools for Comedy? An Evaluation of LLMs' Humour Alignment with\n  Comedians","authors":"Piotr Wojciech Mirowski, Juliette Love, Kory W. Mathewson, Shakir Mohamed","authorsParsed":[["Mirowski","Piotr Wojciech",""],["Love","Juliette",""],["Mathewson","Kory W.",""],["Mohamed","Shakir",""]],"versions":[{"version":"v1","created":"Fri, 31 May 2024 15:55:51 GMT"},{"version":"v2","created":"Mon, 3 Jun 2024 21:01:50 GMT"}],"updateDate":"2024-06-05","timestamp":1717170951000,"abstract":"  We interviewed twenty professional comedians who perform live shows in front\nof audiences and who use artificial intelligence in their artistic process as\npart of 3-hour workshops on ``AI x Comedy'' conducted at the Edinburgh Festival\nFringe in August 2023 and online. The workshop consisted of a comedy writing\nsession with large language models (LLMs), a human-computer interaction\nquestionnaire to assess the Creativity Support Index of AI as a writing tool,\nand a focus group interrogating the comedians' motivations for and processes of\nusing AI, as well as their ethical concerns about bias, censorship and\ncopyright. Participants noted that existing moderation strategies used in\nsafety filtering and instruction-tuned LLMs reinforced hegemonic viewpoints by\nerasing minority groups and their perspectives, and qualified this as a form of\ncensorship. At the same time, most participants felt the LLMs did not succeed\nas a creativity support tool, by producing bland and biased comedy tropes, akin\nto ``cruise ship comedy material from the 1950s, but a bit less racist''. Our\nwork extends scholarship about the subtle difference between, one the one hand,\nharmful speech, and on the other hand, ``offensive'' language as a practice of\nresistance, satire and ``punching up''. We also interrogate the global value\nalignment behind such language models, and discuss the importance of\ncommunity-based value alignment and data ownership to build AI tools that\nbetter suit artists' needs.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","pdfSize":"962029","blobId":"K9uy17K4p-wcdbKf3gf7wOBhn8zFA3QVjbYMq-AYTik","objectId":"0x238618ca1b5b4d2aaff66a3e1b34854c0efba2e9d380ea581092c97845f362ff","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
