{"id":"2407.02148","title":"The coherent magnetic halo of Milky Way","authors":"A.Korochkin, D.Semikoz, and P.Tinyakov","authorsParsed":[["Korochkin","A.",""],["Semikoz","D.",""],["Tinyakov","P.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 10:46:22 GMT"}],"updateDate":"2024-07-03","timestamp":1719917182000,"abstract":"  Recent catalog of Faraday rotation measures (RM) of extragalactic sources\ntogether with the synchrotron polarization data from WMAP and Planck provide us\nwith the wealth of information on magnetic fields of the Galaxy. However, the\nintegral character of these observables together with our position inside the\nGalaxy makes the inference of the coherent Galactic magnetic field (GMF)\ncomplicated and ambiguous. We combine several phenomenological components of\nthe GMF -- the spiral arms, the toroidal halo, the X-shaped field and the field\nof the Local Bubble -- to construct a new model of the regular GMF outside of\nthe thin disk. To have control over the relative contributions of the RM and\npolarization data to the fit we pay special attention to the estimation of\nerrors in data bins. To this end we develop a systematic method which is\nuniformly applicable to different data sets. This method takes into account\nindividual measurement errors, the variance in the bin as well as fluctuations\nin the data at angular scales larger than the bin size. This leads to decrease\nof the errors and, as a result, to better sensitivity of the data to the model\ncontent. We cross checked the stability of our method with the new LOFAR data.\nWe found that the four components listed above are sufficient to fit both the\nRM and polarization data over the whole sky with only a small fraction masked\nout. Moreover, we have achieved several important improvements compared to\nprevious approaches. Due to account of our location inside of the Local Bubble\nour model does not require introduction of striated fields. For the first time\nwe showed that the Fan Region can be modeled as a Galactic-scale feature. The\npitch angle of the magnetic field in our fit converged to the value around 20\ndegrees. Interestingly, with value is very close to the direction of arms\ninferred recently from Gaia data on upper main sequence stars.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WROHvAkFRGKIgoW05HGiw2ne1Z6zpjzfiNvX3nlXnS4","pdfSize":"2913659"}
