{"id":"2407.01088","title":"Physics-Informed Holomorphic Neural Networks (PIHNNs): Solving Linear\n  Elasticity Problems","authors":"Matteo Calaf\\`a, Emil Hovad, Allan P. Engsig-Karup, Tito Andriollo","authorsParsed":[["Calafà","Matteo",""],["Hovad","Emil",""],["Engsig-Karup","Allan P.",""],["Andriollo","Tito",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:45:56 GMT"}],"updateDate":"2024-07-02","timestamp":1719823556000,"abstract":"  We propose physics-informed holomorphic neural networks (PIHNNs) as a method\nto solve boundary value problems where the solution can be represented via\nholomorphic functions. Specifically, we consider the case of plane linear\nelasticity and, by leveraging the Kolosov-Muskhelishvili representation of the\nsolution in terms of holomorphic potentials, we train a complex-valued neural\nnetwork to fulfill stress and displacement boundary conditions while\nautomatically satisfying the governing equations. This is achieved by designing\nthe network to return only approximations that inherently satisfy the\nCauchy-Riemann conditions through specific choices of layers and activation\nfunctions. To ensure generality, we provide a universal approximation theorem\nguaranteeing that, under basic assumptions, the proposed holomorphic neural\nnetworks can approximate any holomorphic function. Furthermore, we suggest a\nnew tailored weight initialization technique to mitigate the issue of\nvanishing/exploding gradients. Compared to the standard PINN approach,\nnoteworthy benefits of the proposed method for the linear elasticity problem\ninclude a more efficient training, as evaluations are needed solely on the\nboundary of the domain, lower memory requirements, due to the reduced number of\ntraining points, and $C^\\infty$ regularity of the learned solution. Several\nbenchmark examples are used to verify the correctness of the obtained PIHNN\napproximations, the substantial benefits over traditional PINNs, and the\npossibility to deal with non-trivial, multiply-connected geometries via a\ndomain-decomposition strategy.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}