{"id":"2407.15233","title":"CGB-DM: Content and Graphic Balance Layout Generation with\n  Transformer-based Diffusion Model","authors":"Yu Li, Yifan Chen, Gongye Liu, Jie Wu, Yujiu Yang","authorsParsed":[["Li","Yu",""],["Chen","Yifan",""],["Liu","Gongye",""],["Wu","Jie",""],["Yang","Yujiu",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 17:58:21 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 02:22:45 GMT"}],"updateDate":"2024-07-24","timestamp":1721584701000,"abstract":"  Layout generation is the foundation task of intelligent design, which\nrequires the integration of visual aesthetics and harmonious expression of\ncontent delivery. However, existing methods still face challenges in generating\nprecise and visually appealing layouts, including blocking, overlap, or spatial\nmisalignment between layouts, which are closely related to the spatial\nstructure of graphic layouts. We find that these methods overly focus on\ncontent information and lack constraints on layout spatial structure, resulting\nin an imbalance of learning content-aware and graphic-aware features. To tackle\nthis issue, we propose Content and Graphic Balance Layout Generation with\nTransformer-based Diffusion Model (CGB-DM). Specifically, we first design a\nregulator that balances the predicted content and graphic weight, overcoming\nthe tendency of paying more attention to the content on canvas. Secondly, we\nintroduce a graphic constraint of saliency bounding box to further enhance the\nalignment of geometric features between layout representations and images. In\naddition, we adapt a transformer-based diffusion model as the backbone, whose\npowerful generation capability ensures the quality in layout generation.\nExtensive experimental results indicate that our method has achieved\nstate-of-the-art performance in both quantitative and qualitative evaluations.\nOur model framework can also be expanded to other graphic design fields.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}