{"id":"2407.11036","title":"Hybrid-Generative Diffusion Models for Attack-Oriented Twin Migration in\n  Vehicular Metaverses","authors":"Yingkai Kang, Jinbo Wen, Jiawen Kang, Tao Zhang, Hongyang Du, Dusit\n  Niyato, Rong Yu, and Shengli Xie","authorsParsed":[["Kang","Yingkai",""],["Wen","Jinbo",""],["Kang","Jiawen",""],["Zhang","Tao",""],["Du","Hongyang",""],["Niyato","Dusit",""],["Yu","Rong",""],["Xie","Shengli",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 11:11:33 GMT"}],"updateDate":"2024-07-17","timestamp":1720177893000,"abstract":"  The vehicular metaverse is envisioned as a blended immersive domain that\npromises to bring revolutionary changes to the automotive industry. As a core\ncomponent of vehicular metaverses, Vehicle Twins (VTs) are digital twins that\ncover the entire life cycle of vehicles, providing immersive virtual services\nfor Vehicular Metaverse Users (VMUs). Vehicles with limited resources offload\nthe computationally intensive tasks of constructing and updating VTs to edge\nservers and migrate VTs between these servers, ensuring seamless and immersive\nexperiences for VMUs. However, the high mobility of vehicles, uneven deployment\nof edge servers, and potential security threats pose challenges to achieving\nefficient and reliable VT migrations. To address these issues, we propose a\nsecure and reliable VT migration framework in vehicular metaverses.\nSpecifically, we design a two-layer trust evaluation model to comprehensively\nevaluate the reputation value of edge servers in the network communication and\ninteraction layers. Then, we model the VT migration problem as a partially\nobservable Markov decision process and design a hybrid-Generative Diffusion\nModel (GDM) algorithm based on deep reinforcement learning to generate optimal\nmigration decisions by taking hybrid actions (i.e., continuous actions and\ndiscrete actions). Numerical results demonstrate that the hybrid-GDM algorithm\noutperforms the baseline algorithms, showing strong adaptability in various\nsettings and highlighting the potential of the hybrid-GDM algorithm for\naddressing various optimization issues in vehicular metaverses.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}