{"id":"2407.01594","title":"General-relativistic instability in rapidly accreting supermassive stars\n  in the presence of dark matter","authors":"Lionel Haemmerl\\'e","authorsParsed":[["Haemmerlé","Lionel",""]],"versions":[{"version":"v1","created":"Mon, 24 Jun 2024 18:00:06 GMT"}],"updateDate":"2024-09-18","timestamp":1719252006000,"abstract":"  The collapse of supermassive stars (SMSs) via the general-relativistic (GR)\ninstability would provide a natural explanation to the existence of the most\nextreme quasars. The presence of dark matter in SMSs is thought to potentially\nimpact their properties, in particular their mass at collapse. Dark matter\nmight be made of weakly interacting massive particles (WIMPs) that can be\ncaptured by the gravitational potential well of SMSs due to interaction with\nthe baryonic gas. The annihilation of WIMPs can provide fuel to support the\nstar before H-burning ignition, favouring low densities of baryonic gas, long\nstellar lifetimes and high final masses. Here, we estimate the impact of dark\nmatter on the GR dynamical stability of rapidly accreting SMSs. We add a dark\nmatter term to the relativistic equation of adiabatic pulsations and apply it\nto hylotropic structures in order to determine the onset point of the GR\ninstability. We find that, in principle, the dark matter gravitational field\ncan remove completely the GR instability. However, for SMSs fuelled by\nH-burning, the dark matter densities required to stabilise the star against GR\nare orders of magnitude above the values that are expected for the dark matter\nbackground. On the other hand, for SMSs fuelled by WIMP annihilation, we find\nthat the low densities of baryonic gas inhibit the destabilising GR\ncorrections, which shifts the stability limit by typically an order of\nmagnitude towards higher masses. As long as central temperatures $\\lesssim10^7$\nK are maintained by WIMP annihilation, the GR instability is reached only for\nstellar masses $>10^6$ M$_\\odot$. Dark matter can impact the GR dynamical\nstability of SMSs only in the case of energetically significant WIMP\nannihilation. The detection of a SMS with mass $>10^6$ M$_\\odot$ in an\natomically cooled halo can be interpreted as an evidence of WIMP annihilation\nin the star's core.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}