{"id":"2407.10703","title":"Towards Robust Event-based Networks for Nighttime via Unpaired\n  Day-to-Night Event Translation","authors":"Yuhwan Jeong, Hoonhee Cho, Kuk-Jin Yoon","authorsParsed":[["Jeong","Yuhwan",""],["Cho","Hoonhee",""],["Yoon","Kuk-Jin",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 13:18:37 GMT"}],"updateDate":"2024-07-16","timestamp":1721049517000,"abstract":"  Event cameras with high dynamic range ensure scene capture even in low-light\nconditions. However, night events exhibit patterns different from those\ncaptured during the day. This difference causes performance degradation when\napplying night events to a model trained solely on day events. This limitation\npersists due to a lack of annotated night events. To overcome the limitation,\nwe aim to alleviate data imbalance by translating annotated day data into night\nevents. However, generating events from different modalities challenges\nreproducing their unique properties. Accordingly, we propose an unpaired\nevent-to-event day-to-night translation model that effectively learns to map\nfrom one domain to another using Diffusion GAN. The proposed translation model\nanalyzes events in spatio-temporal dimension with wavelet decomposition and\ndisentangled convolution layers. We also propose a new temporal contrastive\nlearning with a novel shuffling and sampling strategy to regularize temporal\ncontinuity. To validate the efficacy of the proposed methodology, we redesign\nmetrics for evaluating events translated in an unpaired setting, aligning them\nwith the event modality for the first time. Our framework shows the successful\nday-to-night event translation while preserving the characteristics of events.\nIn addition, through our translation method, we facilitate event-based modes to\nlearn about night events by translating annotated day events into night events.\nOur approach effectively mitigates the performance degradation of applying real\nnight events to downstream tasks. The code is available at\nhttps://github.com/jeongyh98/UDNET.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}