{"id":"2407.06623","title":"SKYCASTLE: Taming LEO Mobility to Facilitate Seamless and Low-latency\n  Satellite Internet Services","authors":"Jihao Li, Hewu Li, Zeqi Lai, Qian Wu, Weisen Liu, Xiaomo Wang, Yuanjie\n  Li, Jun Liu, Qi Zhang","authorsParsed":[["Li","Jihao",""],["Li","Hewu",""],["Lai","Zeqi",""],["Wu","Qian",""],["Liu","Weisen",""],["Wang","Xiaomo",""],["Li","Yuanjie",""],["Liu","Jun",""],["Zhang","Qi",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 07:50:03 GMT"}],"updateDate":"2024-07-10","timestamp":1720511403000,"abstract":"  Emerging integrated space and terrestrial networks (ISTN) built upon low\nearth orbit (LEO) satellite constellations aim at providing planet-wide\nInternet services, not only for residential users, but also for mobile users\n(e.g., in airplane and cruise scenarios). Efficiently managing global mobility\nand keeping connections active for mobile users is critical for ISTN operators.\nHowever, our quantitative analysis identifies that existing mobility management\n(MM) schemes suffer from frequent connection interruptions and long latency in\nISTN scenarios. The fundamental challenge stems from a unique characteristic of\nISTNs: not only users are mobile, but also core network infrastructures (i.e.,\nLEO satellites) are frequently changing their locations in the network. To\nfacilitate seamless and low-latency satellite Internet services, this paper\npresents SKYCASTLE, a novel network-based global mobility management mechanism.\nSKYCASTLE incorporates two key techniques to address frequent connection\ninterruptions in ISTNs. First, to reduce the interruption time, SKYCASTLE\nadopts distributed satellite anchors to track the location changes of mobile\nnodes, manage handovers and avoid routing convergence. Second, SKYCASTLE\nleverages an anchor manager to schedule MM functionalities at satellites to\nreduce deployment costs while guaranteeing low latency. Extensive evaluations\ncombining real constellation information and mobile user trajectories show\nthat: SKYCASTLE can improve up to 55.8% uninterrupted time and reduce 47.8%\nlatency as compared to other existing MM solutions.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}