{"id":"2407.13022","title":"On-sky, real-time optical gain calibration on MagAO-X using incoherent\n  speckles","authors":"Eden A. McEwen, Jared R. Males, Olivier Guyon, Sebastiaan Y. Haffert,\n  Joseph D. Long, Laird M. Close, Kyle Van Gorkom, Jennifer Lumbres, Alexander\n  D. Hedglen, Lauren Schatz, Maggie Y. Kautz, Logan A. Pearce, Jay K. Kueny,\n  Avalon L. McLeod, Warren B. Foster, Jialin Li, Roz Roberts, Alycia J.\n  Weinburger","authorsParsed":[["McEwen","Eden A.",""],["Males","Jared R.",""],["Guyon","Olivier",""],["Haffert","Sebastiaan Y.",""],["Long","Joseph D.",""],["Close","Laird M.",""],["Van Gorkom","Kyle",""],["Lumbres","Jennifer",""],["Hedglen","Alexander D.",""],["Schatz","Lauren",""],["Kautz","Maggie Y.",""],["Pearce","Logan A.",""],["Kueny","Jay K.",""],["McLeod","Avalon L.",""],["Foster","Warren B.",""],["Li","Jialin",""],["Roberts","Roz",""],["Weinburger","Alycia J.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 21:23:13 GMT"}],"updateDate":"2024-07-19","timestamp":1721251393000,"abstract":"  The next generation of extreme adaptive optics (AO) must be calibrated\nexceptionally well to achieve the desired contrast for ground-based direct\nimaging exoplanet targets. Current wavefront sensing and control system\nresponses deviate from lab calibration throughout the night due to non\nlinearities in the wavefront sensor (WFS) and signal loss. One cause of these\nchanges is the optical gain (OG) effect, which shows that the difference\nbetween actual and reconstructed wavefronts is sensitive to residual wavefront\nerrors from partially corrected turbulence. This work details on-sky\nmeasurement of optical gain on MagAO-X, an extreme AO system on the Magellan\nClay 6.5m. We ultimately plan on using a method of high-temporal frequency\nprobes on our deformable mirror to track optical gain on the Pyramid WFS. The\nhigh-temporal frequency probes, used to create PSF copies at 10-22 lambda /D,\nare already routinely used by our system for coronagraph centering and\npost-observation calibration. This method is supported by the OG measurements\nfrom the modal response, measured simultaneously by sequenced pokes of each\nmode. When tracked with DIMM measurements, optical gain calibrations show a\nclear dependence on Strehl Ratio, and this relationship is discussed. This more\naccurate method of calibration is a crucial next step in enabling higher\nfidelity correction and post processing techniques for direct imaging ground\nbased systems.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}