{"id":"2407.02123","title":"Hybrid Feature Collaborative Reconstruction Network for Few-Shot\n  Fine-Grained Image Classification","authors":"Shulei Qiu, Wanqi Yang and Ming Yang","authorsParsed":[["Qiu","Shulei",""],["Yang","Wanqi",""],["Yang","Ming",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 10:14:00 GMT"}],"updateDate":"2024-07-03","timestamp":1719915240000,"abstract":"  Our research focuses on few-shot fine-grained image classification, which\nfaces two major challenges: appearance similarity of fine-grained objects and\nlimited number of samples. To preserve the appearance details of images,\ntraditional feature reconstruction networks usually enhance the representation\nability of key features by spatial feature reconstruction and minimizing the\nreconstruction error. However, we find that relying solely on a single type of\nfeature is insufficient for accurately capturing inter-class differences of\nfine-grained objects in scenarios with limited samples. In contrast, the\nintroduction of channel features provides additional information dimensions,\naiding in better understanding and distinguishing the inter-class differences\nof fine-grained objects. Therefore, in this paper, we design a new Hybrid\nFeature Collaborative Reconstruction Network (HFCR-Net) for few-shot\nfine-grained image classification, which includes a Hybrid Feature Fusion\nProcess (HFFP) and a Hybrid Feature Reconstruction Process (HFRP). In HFRP, we\nfuse the channel features and the spatial features. Through dynamic weight\nadjustment, we aggregate the spatial dependencies between arbitrary two\npositions and the correlations between different channels of each image to\nincrease the inter-class differences. Additionally, we introduce the\nreconstruction of channel dimension in HFRP. Through the collaborative\nreconstruction of channel dimension and spatial dimension, the inter-class\ndifferences are further increased in the process of support-to-query\nreconstruction, while the intra-class differences are reduced in the process of\nquery-to-support reconstruction. Ultimately, our extensive experiments on three\nwidely used fine-grained datasets demonstrate the effectiveness and superiority\nof our approach.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}