{"id":"2407.20297","title":"An Assessment of Commonly Used Equivalent Circuit Models for Corrosion\n  Analysis: A Bayesian Approach to Electrochemical Impedance Spectroscopy","authors":"Runze Zhang, Debashish Sur, Kangming Li, Julia Witt, Robert Black,\n  Alexander Whittingham, John R. Scully, Jason Hattrick-Simpers","authorsParsed":[["Zhang","Runze",""],["Sur","Debashish",""],["Li","Kangming",""],["Witt","Julia",""],["Black","Robert",""],["Whittingham","Alexander",""],["Scully","John R.",""],["Hattrick-Simpers","Jason",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 01:55:33 GMT"}],"updateDate":"2024-07-31","timestamp":1722218133000,"abstract":"  Electrochemical Impedance Spectroscopy (EIS) is a crucial technique for\nassessing corrosion of a metallic materials. The analysis of EIS hinges on the\nselection of an appropriate equivalent circuit model (ECM) that accurately\ncharacterizes the system under study. In this work, we systematically examined\nthe applicability of three commonly used ECMs across several typical material\ndegradation scenarios. By applying Bayesian Inference to simulated corrosion\nEIS data, we assessed the suitability of these ECMs under different corrosion\nconditions and identified regions where the EIS data lacks sufficient\ninformation to statistically substantiate the ECM structure. Additionally, we\nposit that the traditional approach to EIS analysis, which often requires\nmeasurements to very low frequencies, might not be always necessary to\ncorrectly model the appropriate ECM. Our study assesses the impact of omitting\ndata from low to medium-frequency ranges on inference results and reveals that\na significant portion of low-frequency measurements can be excluded without\nsubstantially compromising the accuracy of extracting system parameters.\nFurther, we propose simple checks to the posterior distributions of the ECM\ncomponents and posterior predictions, which can be used to quantitatively\nevaluate the suitability of a particular ECM and the minimum frequency required\nto be measured. This framework points to a pathway for expediting EIS\nacquisition by intelligently reducing low-frequency data collection and\npermitting on-the-fly EIS measurements\n","subjects":["Condensed Matter/Materials Science","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/"}