{"id":"2407.14070","title":"Electrical pumping of h-BN single-photon sources in van der Waals\n  heterostructures","authors":"Mihyang Yu, Jeonghan Lee, Kenji Watanabe, Takashi Taniguchi, and Jieun\n  Lee","authorsParsed":[["Yu","Mihyang",""],["Lee","Jeonghan",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Lee","Jieun",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 06:54:41 GMT"}],"updateDate":"2024-07-22","timestamp":1721372081000,"abstract":"  Atomic defects in solids offer a versatile basis to study and realize quantum\nphenomena and information science in various integrated systems. All-electrical\npumping of single defects to create quantum light emission has been realized in\nseveral platforms including color centers in diamond, silicon carbide, and zinc\noxide, which could lead to the circuit network of electrically triggered\nsingle-photon sources. However, a wide conduction channel which reduces the\ncarrier injection per defect site has been a major obstacle. Here, we conceive\nand realize a novel device concept to construct electrically pumped\nsingle-photon sources using a van der Waals stacked structure with atomic plane\nprecision. Defect-induced tunneling currents across graphene and NbSe2\nelectrodes sandwiching an atomically thin h-BN layer allows persistent and\nrepeatable generation of non-classical light from h-BN. The collected emission\nphoton energies range between 1.4 and 2.9 eV, revealing the electrical\nexcitation of a variety of atomic defects. By analyzing the dipole axis of\nobserved emitters, we further confirm that emitters are crystallographic defect\ncomplexes of h-BN crystal. Our work facilitates implementing efficient and\nminiaturized single-photon devices in van der Waals platforms toward\napplications in quantum optoelectronics.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}