{"id":"2407.08459","title":"Graph Expansions of Deep Neural Networks and their Universal Scaling\n  Limits","authors":"Nicola Muca Cirone, Jad Hamdan and Cristopher Salvi","authorsParsed":[["Cirone","Nicola Muca",""],["Hamdan","Jad",""],["Salvi","Cristopher",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 12:58:07 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 10:33:35 GMT"},{"version":"v3","created":"Sun, 18 Aug 2024 14:14:15 GMT"},{"version":"v4","created":"Sat, 14 Sep 2024 10:57:39 GMT"}],"updateDate":"2024-09-17","timestamp":1720702687000,"abstract":"  We present a unified approach to obtain scaling limits of neural networks\nusing the genus expansion technique from random matrix theory. This approach\nbegins with a novel expansion of neural networks which is reminiscent of\nButcher series for ODEs, and is obtained through a generalisation of Fa\\`a di\nBruno's formula to an arbitrary number of compositions. In this expansion, the\nrole of monomials is played by random multilinear maps indexed by directed\ngraphs whose edges correspond to random matrices, which we call operator\ngraphs. This expansion linearises the effect of the activation functions,\nallowing for the direct application of Wick's principle to compute the\nexpectation of each of its terms. We then determine the leading contribution to\neach term by embedding the corresponding graphs onto surfaces, and computing\ntheir Euler characteristic. Furthermore, by developing a correspondence between\nanalytic and graphical operations, we obtain similar graph expansions for the\nneural tangent kernel as well as the input-output Jacobian of the original\nneural network, and derive their infinite-width limits with relative ease.\nNotably, we find explicit formulae for the moments of the limiting singular\nvalue distribution of the Jacobian. We then show that all of these results hold\nfor networks with more general weights, such as general matrices with i.i.d.\nentries satisfying moment assumptions, complex matrices and sparse matrices.\n","subjects":["Mathematics/Probability","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}