{"id":"2407.18068","title":"Experimental and Numerical Study of Microcavity Filling Regimes for\n  Lab-on-a-Chip Applications","authors":"Luise Nagel, Anja Lippert, Ronny Leonhardt, Tobias Tolle, Huijie\n  Zhang, Tomislav Maric","authorsParsed":[["Nagel","Luise",""],["Lippert","Anja",""],["Leonhardt","Ronny",""],["Tolle","Tobias",""],["Zhang","Huijie",""],["Maric","Tomislav",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 14:24:44 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 06:33:16 GMT"}],"updateDate":"2024-08-01","timestamp":1721917484000,"abstract":"  The efficient and voidless filling of microcavities is of great importance\nfor Lab-on-a-Chip applications. However, predicting whether microcavities will\nbe filled or not under different circumstances is still difficult due to the\nlocal flow effects dominated by surface tension. In this work, a close-up study\nof the microcavity filling process is presented, shedding light on the\nmechanisms of the filling process using experimental insights accompanied by 3D\nnumerical simulations. The movement of a fluid interface over a microcavity\narray is investigated optically under consideration of different fluids,\ncapillary numbers, and cavity depths, revealing a regime map of different\nfilling states. Moreover, the transient interface progression over the cavities\nis analyzed with attention to small-scale effects such as pinning. Besides the\nvisual analysis of the image series, quantitative data of the dynamic contact\nangle and the interface progression is derived using an automated evaluation\nworkflow. In addition to the experiments, 3D Volume-of-Fluid simulations are\nemployed to further investigate the interface shape. It is shown that the\nsimulations can not only predict the filling states in most cases, but also the\ntransient movement and shape of the interface. The data and code associated\nwith this work are publicly available at Bosch Research GitHub and at the\nTUDatalib data repository.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MHH8Ha_vZGuC7gNXRMBtaiLerqKQycfccp3-2xvoPXY","pdfSize":"12133915"}
