{"id":"2407.07205","title":"The Emperor is Now Clothed: A Secure Governance Framework for Web User\n  Authentication through Password Managers","authors":"Ali Cherry, Konstantinos Barmpis and Siamak F. Shahandashti","authorsParsed":[["Cherry","Ali",""],["Barmpis","Konstantinos",""],["Shahandashti","Siamak F.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 19:49:49 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 13:52:09 GMT"}],"updateDate":"2024-07-15","timestamp":1720554589000,"abstract":"  Existing approaches to facilitate the interaction between password managers\nand web applications fall short of providing adequate functionality and\nmitigation strategies against prominent attacks. HTML Autofill is not\nsufficiently expressive, Credential Management API does not support browser\nextension password managers, and other proposed solutions do not conform to\nestablished user mental models. In this paper, we propose Berytus, a\nbrowser-based governance framework that mediates the interaction between\npassword managers and web applications. Two APIs are designed to support\nBerytus acting as an orchestrator between password managers and web\napplications. An implementation of the framework in Firefox is developed that\nfully supports registration and authentication processes. As an orchestrator,\nBerytus is able to authenticate web applications and facilitate authenticated\nkey exchange between web applications and password managers, which as we show,\ncan provide effective mitigation strategies against phishing, cross-site\nscripting, inline code injection (e.g., by a malicious browser extension), and\nTLS proxy in the middle attacks, whereas existing mitigation strategies such as\nContent Security Policy and credential tokenisation are only partially\neffective. The framework design also provides desirable functional properties\nsuch as support for multi-step, multi-factor, and custom authentication\nschemes. We provide a comprehensive security and functionality evaluation and\ndiscuss possible future directions.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"pmKehkLfEBeVkWxOVtNRV7gkTmTVLEjOtIfztRoDWCo","pdfSize":"1038494"}
