{"id":"2407.09183","title":"Search for neutral long-lived particles that decay into displaced jets\n  in the ATLAS calorimeter in association with leptons or jets using $pp$\n  collisions at $\\sqrt{s}=13$ TeV","authors":"ATLAS Collaboration","authorsParsed":[["ATLAS Collaboration","",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 11:32:18 GMT"}],"updateDate":"2024-07-15","timestamp":1720783938000,"abstract":"  A search for neutral long-lived particles (LLPs) decaying in the ATLAS\nhadronic calorimeter using 140 fb$^{-1}$ of proton-proton collisions at\n$\\sqrt{s}=13$ TeV delivered by the LHC is presented. The analysis is composed\nof three channels. The first targets pair-produced LLPs, where at least one LLP\nis produced with sufficiently low boost that its decay products can be resolved\nas separate jets. The second and third channels target LLPs respectively\nproduced in association with a $W$ or $Z$ boson that decays leptonically. In\neach channel, different search regions target different kinematic regimes, to\ncover a broad range of LLP mass hypotheses and models. No excesses of events\nrelative to the background predictions are observed. Higgs boson branching\nfractions to pairs of hadronically decaying neutral LLPs larger than 1% are\nexcluded at 95% confidence level for proper decay lengths in the range of 30 cm\nto 4.5 m depending on the LLP mass, a factor of three improvement on previous\nsearches in the hadronic calorimeter. The production of long-lived dark photons\nin association with a $Z$ boson with cross-sections above 0.1 pb is excluded\nfor dark photon mean proper decay lengths in the range of 20 cm to 50 m,\nimproving previous ATLAS results by an order of magnitude. Finally, long-lived\nphoto-phobic axion-like particle models are probed for the first time by ATLAS,\nwith production cross-sections above 0.1 pb excluded in the 0.1 mm to 10 m\nrange.\n","subjects":["Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6S3RaEh4wbAXKwSAXCMQBJi8B08B0rCIOV2BQ11-Dmw","pdfSize":"2965359"}
