{"id":"2407.16765","title":"Tracing the Milky Way spiral arms with 26Al -- The role of nova systems\n  in the 2D distribution of 26Al","authors":"Arianna Vasini, Emanuele Spitoni, Francesca Matteucci, Gabriele\n  Cescutti and Massimo della Valle","authorsParsed":[["Vasini","Arianna",""],["Spitoni","Emanuele",""],["Matteucci","Francesca",""],["Cescutti","Gabriele",""],["della Valle","Massimo",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 18:00:33 GMT"}],"updateDate":"2024-07-25","timestamp":1721757633000,"abstract":"  Massive stars are one of the most important and investigated astrophysical\nproduction sites of $^{26}$Al, a short-lived radioisotope with $\\sim$ 1 Myr\nhalf-life. Its short lifetime prevents us from observing its complete chemical\nhistory, and only the $^{26}$Al that was recently produced by massive stars can\nbe observed. Hence, it is considered a tracer of star formation rate (SFR).\nHowever, important contributions to $^{26}$Al comes from nova systems that\npollute the interstellar medium with a large delay, thus partly erasing the\ncorrelation between $^{26}$Al and SFR. In this work we describe the 2D\ndistribution of the mass of $^{26}$Al as well as that of massive stars and nova\nsystems in the Milky Way, to investigate their relative contributions to the\nproduction of $^{26}$Al. We use a detailed 2D chemical evolution model where\nthe SFR is azimuthally dependent and is required to reproduce the spiral arm\npattern observed in the Milky Way. We test two different models, one where the\n$^{26}$Al comes from massive stars and novae, and one with massive stars only.\nWe then compare the predictions to the $\\sim$ 2 M$_{\\odot}$ of $^{26}$Al mass\nobserved by the surveys COMPTEL and INTEGRAL. The results show that novae do\nnot trace SFR and, in the solar vicinity, they concentrate in its minima. The\neffect of novae on the map of the $^{26}$Al mass consists in damping the spiral\npattern by a factor of five. Regarding the nucleosynthesis, we find that\n$\\sim$75% of the $^{26}$Al is produced by novae and the $\\sim$25% by massive\nstars. We conclude that novae cannot be neglected as $^{26}$Al producers since\nthe observations can only be reproduced by including their contribution.\nMoreover, we suggest that bulge novae should eject around six times more\nmaterial than the disc ones to well reproduce the observed mass of $^{26}$Al.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}