{"id":"2407.03774","title":"Mixture Modeling for Temporal Point Processes with Memory","authors":"Xiaotian Zheng, Athanasios Kottas, and Bruno Sans\\'o","authorsParsed":[["Zheng","Xiaotian",""],["Kottas","Athanasios",""],["Sansó","Bruno",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 09:33:15 GMT"}],"updateDate":"2024-07-08","timestamp":1720085595000,"abstract":"  We propose a constructive approach to building temporal point processes that\nincorporate dependence on their history. The dependence is modeled through the\nconditional density of the duration, i.e., the interval between successive\nevent times, using a mixture of first-order conditional densities for each one\nof a specific number of lagged durations. Such a formulation for the\nconditional duration density accommodates high-order dynamics, and it thus\nenables flexible modeling for point processes with memory. The implied\nconditional intensity function admits a representation as a local mixture of\nfirst-order hazard functions. By specifying appropriate families of\ndistributions for the first-order conditional densities, with different shapes\nfor the associated hazard functions, we can obtain either self-exciting or\nself-regulating point processes. From the perspective of duration processes, we\ndevelop a method to specify a stationary marginal density. The resulting model,\ninterpreted as a dependent renewal process, introduces high-order Markov\ndependence among identically distributed durations. Furthermore, we provide\nextensions to cluster point processes. These can describe duration clustering\nbehaviors attributed to different factors, thus expanding the scope of the\nmodeling framework to a wider range of applications. Regarding implementation,\nwe develop a Bayesian approach to inference, model checking, and prediction. We\ninvestigate point process model properties analytically, and illustrate the\nmethodology with both synthetic and real data examples.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}