{"id":"2407.16465","title":"Improving the Computational Efficiency of Adaptive Audits of IRV\n  Elections","authors":"Alexander Ek, Michelle Blom, Philip B. Stark, Peter J. Stuckey, Damjan\n  Vukcevic","authorsParsed":[["Ek","Alexander",""],["Blom","Michelle",""],["Stark","Philip B.",""],["Stuckey","Peter J.",""],["Vukcevic","Damjan",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 13:28:00 GMT"}],"updateDate":"2024-07-24","timestamp":1721741280000,"abstract":"  AWAIRE is one of two extant methods for conducting risk-limiting audits of\ninstant-runoff voting (IRV) elections. In principle AWAIRE can audit IRV\ncontests with any number of candidates, but the original implementation\nincurred memory and computation costs that grew superexponentially with the\nnumber of candidates. This paper improves the algorithmic implementation of\nAWAIRE in three ways that make it practical to audit IRV contests with 55\ncandidates, compared to the previous 6 candidates. First, rather than trying\nfrom the start to rule out all candidate elimination orders that produce a\ndifferent winner, the algorithm starts by considering only the final round,\ntesting statistically whether each candidate could have won that round. For\nthose candidates who cannot be ruled out at that stage, it expands to consider\nearlier and earlier rounds until either it provides strong evidence that the\nreported winner really won or a full hand count is conducted, revealing who\nreally won. Second, it tests a richer collection of conditions, some of which\ncan rule out many elimination orders at once. Third, it exploits relationships\namong those conditions, allowing it to abandon testing those that are unlikely\nto help. We provide real-world examples with up to 36 candidates and synthetic\nexamples with up to 55 candidates, showing how audit sample size depends on the\nmargins and on the tuning parameters. An open-source Python implementation is\npublicly available.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Cryptography and Security","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}