{"id":"2407.12632","title":"CerberusDet: Unified Multi-Dataset Object Detection","authors":"Irina Tolstykh, Mikhail Chernyshov, Maksim Kuprashevich","authorsParsed":[["Tolstykh","Irina",""],["Chernyshov","Mikhail",""],["Kuprashevich","Maksim",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:00:35 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 05:43:14 GMT"}],"updateDate":"2024-09-16","timestamp":1721228435000,"abstract":"  Conventional object detection models are usually limited by the data on which\nthey were trained and by the category logic they define. With the recent rise\nof Language-Visual Models, new methods have emerged that are not restricted to\nthese fixed categories. Despite their flexibility, such Open Vocabulary\ndetection models still fall short in accuracy compared to traditional models\nwith fixed classes. At the same time, more accurate data-specific models face\nchallenges when there is a need to extend classes or merge different datasets\nfor training. The latter often cannot be combined due to different logics or\nconflicting class definitions, making it difficult to improve a model without\ncompromising its performance. In this paper, we introduce CerberusDet, a\nframework with a multi-headed model designed for handling multiple object\ndetection tasks. Proposed model is built on the YOLO architecture and\nefficiently shares visual features from both backbone and neck components,\nwhile maintaining separate task heads. This approach allows CerberusDet to\nperform very efficiently while still delivering optimal results. We evaluated\nthe model on the PASCAL VOC dataset and Objects365 dataset to demonstrate its\nabilities. CerberusDet achieved state-of-the-art results with 36% less\ninference time. The more tasks are trained together, the more efficient the\nproposed model becomes compared to running individual models sequentially. The\ntraining and inference code, as well as the model, are available as open-source\n(https://github.com/ai-forever/CerberusDet).\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}