{"id":"2407.18557","title":"On the precise quantification of the impact of a single discretionary\n  lane change on surrounding traffic","authors":"Kangning Hou, Jia Zou, Fangfang Zheng, Xiaobo Liu, Zhengbing He","authorsParsed":[["Hou","Kangning",""],["Zou","Jia",""],["Zheng","Fangfang",""],["Liu","Xiaobo",""],["He","Zhengbing",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 07:11:03 GMT"}],"updateDate":"2024-07-29","timestamp":1721977863000,"abstract":"  Lane-changing is a critical maneuver of vehicle driving, and a comprehensive\nunderstanding of its impact on traffic is essential for effective traffic\nmanagement and optimization. Unfortunately, existing studies fail to adequately\ndistinguish the impact of lane changes from those resulting from natural\ntraffic dynamics. Additionally, there is a lack of precise methods for\nmeasuring the spatial extent and duration of the impact of a single\ndiscretionary lane change, as well as a definitive metric to quantify the\noverall spatiotemporal impact. To address these gaps, this study introduces a\nquantitative indicator called the Corrected Travel Distance Bias (CTDB), which\naccounts for variable speeds due to inherent traffic dynamics, providing a more\naccurate assessment of lane-changing impacts. A comprehensive methodology is\ndeveloped to compare vehicle trajectory data before and after lane-changing\nevents, measuring both the magnitude and spatiotemporal extent of the\nlane-changing impact. The results, based on the Zen traffic data from Japan,\nindicate that the impact of a lane change in the target lane lasts an average\nof 23.8 seconds, affecting approximately 5.6 vehicles, with a CTDB value of\n-10.8 meters. In contrast, in the original lane, the impact lasts 25 seconds,\naffects 5.3 vehicles, and yields a CTDB value of 4.7 meters.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}