{"id":"2407.16056","title":"Stability-superconductivity map for compressed Na-intercalated graphite","authors":"Shashi B. Mishra, Edan T. Marcial, Suryakanti Debata, Aleksey N.\n  Kolmogorov, and Elena R. Margine","authorsParsed":[["Mishra","Shashi B.",""],["Marcial","Edan T.",""],["Debata","Suryakanti",""],["Kolmogorov","Aleksey N.",""],["Margine","Elena R.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 21:15:25 GMT"}],"updateDate":"2024-07-24","timestamp":1721682925000,"abstract":"  A recent ab initio investigation of Na-C binary compounds under moderate\npressures has uncovered a possible stable NaC$_4$ superconductor with an\nestimated critical temperature up to 41K. We revisit this promising binary\nsystem by performing a more focused exploration of Na-intercalated graphite\nconfigurations, assessing the sensitivity of their thermodynamic stability to\ndensity functional approximations at different (T,P) conditions, and examining\ntheir superconducting properties with the anisotropic Migdal-Eliashberg\nformalism. The combinatorial screening of possible Na arrangements reveals\nadditional stable stoichiometries, i.e., Na$_3$C$_{10}$, NaC$_8$, NaC$_{10}$,\nand NaC$_{12}$, that redefine the previously proposed convex hulls for\npressures up to 10 GPa. The evaluation of formation enthalpies with different\nvan der Waals functionals indicates that the proposed compounds might not be\nthermodynamically stable at zero temperature but some of them could stabilize\ndue to the vibrational entropy or form via cold compression if graphite is used\nas a starting material. Our more rigorous modeling of the electron-phonon\ncoupling in NaC$_4$ confirms the material's potential for high-temperature\nsuperconductivity, with a critical temperature reaching 48 K at 10 GPa, and\nreveals a well-defined two-gap structure unusual for an electron-doped\ncompound. By tracking the position of the intercalant nearly free electron\nstates with respect to the Fermi level in viable Na-C compounds, we map out the\nrange of pressures and compositions needed for strong electron-phonon coupling\nand identify Na$_3$C$_{10}$ as an equally promising superconductor.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}