{"id":"2407.09295","title":"Security Matrix for Multimodal Agents on Mobile Devices: A Systematic\n  and Proof of Concept Study","authors":"Yulong Yang, Xinshan Yang, Shuaidong Li, Chenhao Lin, Zhengyu Zhao,\n  Chao Shen, Tianwei Zhang","authorsParsed":[["Yang","Yulong",""],["Yang","Xinshan",""],["Li","Shuaidong",""],["Lin","Chenhao",""],["Zhao","Zhengyu",""],["Shen","Chao",""],["Zhang","Tianwei",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 14:30:05 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 13:36:56 GMT"}],"updateDate":"2024-07-18","timestamp":1720794605000,"abstract":"  The rapid progress in the reasoning capability of the Multi-modal Large\nLanguage Models (MLLMs) has triggered the development of autonomous agent\nsystems on mobile devices. MLLM-based mobile agent systems consist of\nperception, reasoning, memory, and multi-agent collaboration modules, enabling\nautomatic analysis of user instructions and the design of task pipelines with\nonly natural language and device screenshots as inputs. Despite the increased\nhuman-machine interaction efficiency, the security risks of MLLM-based mobile\nagent systems have not been systematically studied. Existing security\nbenchmarks for agents mainly focus on Web scenarios, and the attack techniques\nagainst MLLMs are also limited in the mobile agent scenario. To close these\ngaps, this paper proposes a mobile agent security matrix covering 3 functional\nmodules of the agent systems. Based on the security matrix, this paper proposes\n4 realistic attack paths and verifies these attack paths through 8 attack\nmethods. By analyzing the attack results, this paper reveals that MLLM-based\nmobile agent systems are not only vulnerable to multiple traditional attacks,\nbut also raise new security concerns previously unconsidered. This paper\nhighlights the need for security awareness in the design of MLLM-based systems\nand paves the way for future research on attacks and defense methods.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}