{"id":"2407.13278","title":"Deep Time Series Models: A Comprehensive Survey and Benchmark","authors":"Yuxuan Wang, Haixu Wu and Jiaxiang Dong, Yong Liu, Mingsheng Long,\n  Jianmin Wang","authorsParsed":[["Wang","Yuxuan",""],["Wu","Haixu",""],["Dong","Jiaxiang",""],["Liu","Yong",""],["Long","Mingsheng",""],["Wang","Jianmin",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:31:55 GMT"}],"updateDate":"2024-07-19","timestamp":1721291515000,"abstract":"  Time series, characterized by a sequence of data points arranged in a\ndiscrete-time order, are ubiquitous in real-world applications. Different from\nother modalities, time series present unique challenges due to their complex\nand dynamic nature, including the entanglement of nonlinear patterns and\ntime-variant trends. Analyzing time series data is of great significance in\nreal-world scenarios and has been widely studied over centuries. Recent years\nhave witnessed remarkable breakthroughs in the time series community, with\ntechniques shifting from traditional statistical methods to advanced deep\nlearning models. In this paper, we delve into the design of deep time series\nmodels across various analysis tasks and review the existing literature from\ntwo perspectives: basic modules and model architectures. Further, we develop\nand release Time Series Library (TSLib) as a fair benchmark of deep time series\nmodels for diverse analysis tasks, which implements 24 mainstream models,\ncovers 30 datasets from different domains, and supports five prevalent analysis\ntasks. Based on TSLib, we thoroughly evaluate 12 advanced deep time series\nmodels on different tasks. Empirical results indicate that models with specific\nstructures are well-suited for distinct analytical tasks, which offers insights\nfor research and adoption of deep time series models. Code is available at\nhttps://github.com/thuml/Time-Series-Library.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"u_xWJIQIxRt3KbcKfW7zzZNGbt87775XZ0M0eJw_YLI","pdfSize":"13051456"}
