{"id":"2407.00502","title":"Deep Frequency Derivative Learning for Non-stationary Time Series\n  Forecasting","authors":"Wei Fan, Kun Yi, Hangting Ye, Zhiyuan Ning, Qi Zhang, Ning An","authorsParsed":[["Fan","Wei",""],["Yi","Kun",""],["Ye","Hangting",""],["Ning","Zhiyuan",""],["Zhang","Qi",""],["An","Ning",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 17:56:59 GMT"}],"updateDate":"2024-07-02","timestamp":1719683819000,"abstract":"  While most time series are non-stationary, it is inevitable for models to\nface the distribution shift issue in time series forecasting. Existing\nsolutions manipulate statistical measures (usually mean and std.) to adjust\ntime series distribution. However, these operations can be theoretically seen\nas the transformation towards zero frequency component of the spectrum which\ncannot reveal full distribution information and would further lead to\ninformation utilization bottleneck in normalization, thus hindering forecasting\nperformance. To address this problem, we propose to utilize the whole frequency\nspectrum to transform time series to make full use of data distribution from\nthe frequency perspective. We present a deep frequency derivative learning\nframework, DERITS, for non-stationary time series forecasting. Specifically,\nDERITS is built upon a novel reversible transformation, namely Frequency\nDerivative Transformation (FDT) that makes signals derived in the frequency\ndomain to acquire more stationary frequency representations. Then, we propose\nthe Order-adaptive Fourier Convolution Network to conduct adaptive frequency\nfiltering and learning. Furthermore, we organize DERITS as a parallel-stacked\narchitecture for the multi-order derivation and fusion for forecasting.\nFinally, we conduct extensive experiments on several datasets which show the\nconsistent superiority in both time series forecasting and shift alleviation.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}