{"id":"2407.00253","title":"Comparative Analysis of Molecular Dynamics and Method of Moments in\n  Two-Dimensional Concentric Circular Layers","authors":"Robert Salazar, Cristian Cobos, Diego Jaramillo and Camilo Bayona","authorsParsed":[["Salazar","Robert",""],["Cobos","Cristian",""],["Jaramillo","Diego",""],["Bayona","Camilo",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 22:56:54 GMT"}],"updateDate":"2024-07-02","timestamp":1719615414000,"abstract":"  In this manuscript, we undertake an examination of a classical plasma\ndeployed on two finite co-planar surfaces: a circular region $\\Omega_{in}$ into\nan annular region $\\Omega_{out}$ with a gap in between. It is studied both from\nthe point of view of statistical mechanics and the electrostatics of continua\nmedia. We employ a dual perspective: the first one is by using Molecular\nDynamics (MD) simulations to find the system's positional correlation functions\nand velocity distributions. That by modeling the system as a classical\ntwo-dimensional Coulomb plasma of point-like charged particles $q_1$ and $q_2$\non the layers $\\Omega_{in}$ and $\\Omega_{out}$ respectively with no background\ndensity. The second one corresponds to a finite surface electrode composed of\nplanar metallic layers displayed on the regions $\\Omega_{in}$, $\\Omega_{out}$\nat constant voltages $V_{in}$, $V_{out}$ considering axial symmetry. The\nsurface charge density is calculated by the Method of Moments (MoM) under the\nelectrostatic approximation. Point-like and differential charges elements\ninteract via a $1/r$ - electric potential in both cases. The thermodynamic\naverages of the number density, and electric potential due to the plasma depend\non the coupling and the charge ratio $\\xi=q_1/q_2$ once the geometry of the\nlayers is fixed. On the other hand, the fields due to the SE depend on the\nlayer's geometry and their voltage. In the document, is defined a protocol to\nproperly compare the systems. We show that there are values of the coupling\nparameter, where the thermodynamic averages computed via MD agree with the\nresults of MoM for attractive $\\xi=-1$ and repulsive layers $\\xi=1$.\n  Keywords: molecular dynamics, method of moments, Coulomb systems, long-range\ninteraction.\n","subjects":["Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/"}