{"id":"2407.17917","title":"Lightwave-driven electrons in a Floquet topological insulator","authors":"Tobias Weitz, Daniel M. B. Lesko, Simon Wittigschlager, Weizhe Li,\n  Christian Heide, Ofer Neufeld, and Peter Hommelhoff","authorsParsed":[["Weitz","Tobias",""],["Lesko","Daniel M. B.",""],["Wittigschlager","Simon",""],["Li","Weizhe",""],["Heide","Christian",""],["Neufeld","Ofer",""],["Hommelhoff","Peter",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 10:11:57 GMT"}],"updateDate":"2024-07-26","timestamp":1721902317000,"abstract":"  Topological insulators offer unique opportunities for novel electronics and\nquantum phenomena. However, intrinsic material limitations often restrict their\napplications and practical implementation. Over a decade ago it was predicted\nthat a time-periodic perturbation can generate out-of-equilibrium states known\nas Floquet topological insulators (FTIs), hosting topologically protected\ntransport and anomalous Hall physics, and opening routes to optically tunable\nbandstructures and devices compatible with petahertz electronics. Although such\nstates have not yet been directly observed, indirect signatures such as the\nlight-induced anomalous Hall effect were recently measured. Thus far, much\nremained experimentally unclear and fundamentally unknown about solid-state FTI\nand whether they can be employed for electronics. Here we demonstrate coherent\ncontrol of photocurrents in light-dressed graphene. Circularly-polarized laser\npulses dress the graphene band structure to obtain an FTI, and phase-locked\nsecond harmonic pulses drive electrons in the FTI. This approach allows us to\nmeasure resulting all-optical anomalous Hall photocurrents,\nFTI-valley-polarized currents, and photocurrent circular dichroism, all\nphenomena that put FTIs on equal footing with equilibrium topological\ninsulators. We further present an intuitive description for the\nsub-optical-cycle light-matter interaction, revealing dynamical symmetry\nselection rules for photocurrents. All measurements are supported by strong\nagreement with ab-initio and analytic theory. Remarkably, the photocurrents\nshow a strong sub-cycle phase-sensitivity that can be employed for ultrafast\ncontrol in topotronics and spectroscopy. Our work connects Floquet and\ntopological physics with attoscience and valleytronics, and goes beyond band\nstructure engineering by initiating lightwave-driven dynamics in FTI states.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}