{"id":"2407.05576","title":"ORMNet: Object-centric Relationship Modeling for Egocentric Hand-object\n  Segmentation","authors":"Yuejiao Su, Yi Wang, and Lap-Pui Chau","authorsParsed":[["Su","Yuejiao",""],["Wang","Yi",""],["Chau","Lap-Pui",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 03:17:10 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 02:20:29 GMT"}],"updateDate":"2024-09-05","timestamp":1720408630000,"abstract":"  Egocentric hand-object segmentation (EgoHOS) is a promising new task aiming\nat segmenting hands and interacting objects in egocentric images. Although\nEgoHOS has the potential to enable various applications, current methods\nstruggle to achieve both high performance and end-to-end optimization\nsimultaneously. Moreover, existing approaches fail to fully leverage hand cues\nto assist the interacting-object segmentation and overlook the coupled\nrelationships between diverse interacting-object categories, resulting in\nperformance deficiencies. To address these limitations, this paper proposes a\nnovel Object-centric Relationship Modeling Network (ORMNet) to fulfill\nend-to-end and effective EgoHOS by modeling relationships between hands and\nobjects as well as objects and objects. Specifically, a Hand-Object Relation\n(HOR) module is introduced to capture the correlation between hands and\nobjects, which uses hand features to guide the network to extract more\ndistinguishing interacting-object features. Besides, we find the coupling\nrelations between diverse interacting-object categories and design the Object\nRelation Decoupling (ORD) strategy to disentangle them, emphasizing learning of\nthe interaction between hands and objects and reducing the confusion of\ninteracting-object classification. In-domain experiments show that ORMNet has\nnotably exceptional segmentation performance compared with state-of-the-art\nmethods, while out-of-domain experiments further exhibit its robust\ngeneralization capability. The project is available at\nhttps://github.com/yuggiehk/ORMNet/\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}