{"id":"2407.19620","title":"Directional coupling to a $\\lambda/5000$ nano-waveguide","authors":"Alessandro Tuniz, Sabrina Garattoni, Han-Hao Cheng, Giuseppe Della\n  Valle","authorsParsed":[["Tuniz","Alessandro",""],["Garattoni","Sabrina",""],["Cheng","Han-Hao",""],["Della Valle","Giuseppe",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 00:52:05 GMT"}],"updateDate":"2024-07-30","timestamp":1722214325000,"abstract":"  Silicon-based micro-devices are considered promising candidates for\nconsolidating several terahertz technologies into a common and practical\nplatform. The practicality stems from the relatively low loss, device\ncompactness, ease of fabrication, and wide range of available passive and\nactive functionalities. Nevertheless, typical device footprints are limited by\ndiffraction to several hundreds of micrometers, which hinders emerging\nnanoscale applications of terahertz frequencies. While metallic gap modes\nprovide nanoscale terahertz confinement, efficiently coupling to them is\ndifficult. Here we present and experimentally demonstrate a strategy for\nefficiently interfacing sub-terahertz radiation ({\\lambda}=1 mm) to a waveguide\nformed by a nanogap, etched in a gold film, that is 200 nm ({\\lambda}/5000)\nwide and up to 4.5 mm long. The design principle relies on phase matching\ndielectric and nanogap waveguide modes, resulting in efficient directional\ncoupling between them when placed side-by-side. Broadband far field terahertz\ntransmission experiments through the dielectric waveguide reveal a transmission\ndip near the designed wavelength due to resonant coupling. Near field\nmeasurements on the surface of the gold layer confirm that such a dip is\naccompanied by a transfer of power to the nanogap, with an estimated coupling\nefficiency of ~10%. Our approach provides a pathway for efficiently interfacing\nmillimeter-wave and near-infrared photonic circuits, providing controlled and\ntailored nanoscale terahertz confinement, with important implications for\non-chip nanospectroscopy, telecommunications, and quantum technologies.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}