{"id":"2407.12887","title":"Self-Adaptive Robust Motion Planning for High DoF Robot Manipulator\n  using Deep MPC","authors":"Ye Zhang, Kangtong Mo, Fangzhou Shen, Xuanzhen Xu, Xingyu Zhang,\n  Jiayue Yu, Chang Yu","authorsParsed":[["Zhang","Ye",""],["Mo","Kangtong",""],["Shen","Fangzhou",""],["Xu","Xuanzhen",""],["Zhang","Xingyu",""],["Yu","Jiayue",""],["Yu","Chang",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 07:04:26 GMT"}],"updateDate":"2024-07-19","timestamp":1721199866000,"abstract":"  In contemporary control theory, self-adaptive methodologies are highly\nesteemed for their inherent flexibility and robustness in managing modeling\nuncertainties. Particularly, robust adaptive control stands out owing to its\npotent capability of leveraging robust optimization algorithms to approximate\ncost functions and relax the stringent constraints often associated with\nconventional self-adaptive control paradigms. Deep learning methods,\ncharacterized by their extensive layered architecture, offer significantly\nenhanced approximation prowess. Notwithstanding, the implementation of deep\nlearning is replete with challenges, particularly the phenomena of vanishing\nand exploding gradients encountered during the training process. This paper\nintroduces a self-adaptive control scheme integrating a deep MPC, governed by\nan innovative weight update law designed to mitigate the vanishing and\nexploding gradient predicament by employing the gradient sign exclusively. The\nproffered controller is a self-adaptive dynamic inversion mechanism,\nintegrating an augmented state observer within an auxiliary estimation circuit\nto enhance the training phase. This approach enables the deep MPC to learn the\nentire plant model in real-time and the efficacy of the controller is\ndemonstrated through simulations involving a high-DoF robot manipulator,\nwherein the controller adeptly learns the nonlinear plant dynamics\nexpeditiously and exhibits commendable performance in the motion planning task.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aHKIoW0bXR5K3ocIeqrZsjU8y43QsMnpI0LvPsLvlIg","pdfSize":"4153386","objectId":"0xf096be6abbf289330ba3460bd8f7d58061faf8202da0f40d8cea391dd5cb0bcb","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
