{"id":"2407.18516","title":"Integrating Posture Control in Speech Motor Models: A\n  Parallel-Structured Simulation Approach","authors":"Yadong Liu, Sidney Fels, Arian Shamei, Najeeb Khan, Bryan Gick","authorsParsed":[["Liu","Yadong",""],["Fels","Sidney",""],["Shamei","Arian",""],["Khan","Najeeb",""],["Gick","Bryan",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 05:12:31 GMT"}],"updateDate":"2024-07-29","timestamp":1721970751000,"abstract":"  Posture is an essential aspect of motor behavior, necessitating continuous\nmuscle activation to counteract gravity. It remains stable under perturbation,\naiding in maintaining bodily balance and enabling movement execution.\nSimilarities have been observed between gross body postures and speech\npostures, such as those involving the jaw, tongue, and lips, which also exhibit\nresilience to perturbations and assist in equilibrium and movement. Although\npostural control is a recognized element of human movement and balance,\nparticularly in broader motor skills, it has not been adequately incorporated\ninto existing speech motor control models, which typically concentrate on the\ngestures or motor commands associated with specific speech movements,\noverlooking the influence of postural control and gravity. Here we introduce a\nmodel that aligns speech posture and movement, using simulations to explore\nwhether speech posture within this framework mirrors the principles of bodily\npostural control. Our findings indicate that, akin to body posture, speech\nposture is also robust to perturbation and plays a significant role in\nmaintaining local segment balance and enhancing speech production.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"qbQ7nlV-0qOIzVCZ-9J2w7aV0MJ8uM75tK5_b2Q7seA","pdfSize":"256200"}
