{"id":"2407.07719","title":"Model-based learning for multi-antenna multi-frequency\n  location-to-channel mapping","authors":"Baptiste Chatelier (IETR, MERCE-France, INSA Rennes), Vincent Corlay\n  (MERCE-France), Matthieu Crussi\\`ere (IETR, INSA Rennes), Luc Le Magoarou\n  (IETR, INSA Rennes)","authorsParsed":[["Chatelier","Baptiste","","IETR, MERCE-France, INSA Rennes"],["Corlay","Vincent","","MERCE-France"],["Crussière","Matthieu","","IETR, INSA Rennes"],["Magoarou","Luc Le","","IETR, INSA Rennes"]],"versions":[{"version":"v1","created":"Mon, 17 Jun 2024 13:09:25 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 06:54:53 GMT"}],"updateDate":"2024-07-16","timestamp":1718629765000,"abstract":"  Years of study of the propagation channel showed a close relation between a\nlocation and the associated communication channel response. The use of a neural\nnetwork to learn the location-to-channel mapping can therefore be envisioned.\nThe Implicit Neural Representation (INR) literature showed that classical\nneural architecture are biased towards learning low-frequency content, making\nthe location-to-channel mapping learning a non-trivial problem. Indeed, it is\nwell known that this mapping is a function rapidly varying with the location,\non the order of the wavelength. This paper leverages the model-based machine\nlearning paradigm to derive a problem-specific neural architecture from a\npropagation channel model. The resulting architecture efficiently overcomes the\nspectral-bias issue. It only learns low-frequency sparse correction terms\nactivating a dictionary of high-frequency components. The proposed architecture\nis evaluated against classical INR architectures on realistic synthetic data,\nshowing much better accuracy. Its mapping learning performance is explained\nbased on the approximated channel model, highlighting the explainability of the\nmodel-based machine learning paradigm.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}