{"id":"2407.04961","title":"A PRISMA-Driven Bibliometric Analysis of the Scientific Literature on\n  Assurance Case Patterns","authors":"Oluwafemi Odu, Alvine Boaye Belle, Song Wang, Kimya Khakzad\n  Shahandashti","authorsParsed":[["Odu","Oluwafemi",""],["Belle","Alvine Boaye",""],["Wang","Song",""],["Shahandashti","Kimya Khakzad",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 05:00:49 GMT"}],"updateDate":"2024-07-09","timestamp":1720242049000,"abstract":"  Justifying the correct implementation of the non-functional requirements\n(e.g., safety, security) of mission-critical systems is crucial to prevent\nsystem failure. The later could have severe consequences such as the death of\npeople and financial losses. Assurance cases can be used to prevent system\nfailure, They are structured arguments that allow arguing and relaying various\nsafety-critical systems' requirements extensively as well as checking the\ncompliance of such systems with industrial standards to support their\ncertification. Still, the creation of assurance cases is usually manual,\nerror-prone, and time-consuming. Besides, it may involve numerous alterations\nas the system evolves. To overcome the bottlenecks in creating assurance cases,\nexisting approaches usually promote the reuse of common structured\nevidence-based arguments (i.e. patterns) to aid the creation of assurance\ncases. To gain insights into the advancements of the research on assurance case\npatterns, we relied on SEGRESS to conduct a bibliometric analysis of 92 primary\nstudies published within the past two decades. This allows capturing the\nevolutionary trends and patterns characterizing the research in that field. Our\nfindings notably indicate the emergence of new assurance case patterns to\nsupport the assurance of ML-enabled systems that are characterized by their\nevolving requirements (e.g., cybersecurity and ethics).\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}