{"id":"2407.14001","title":"Component Selection for Craft Assembly Tasks","authors":"Vitor Hideyo Isume (1), Takuya Kiyokawa (1), Natsuki Yamanobe (2),\n  Yukiyasu Domae (2), Weiwei Wan (1) and Kensuke Harada (1 and 2) ((1) Osaka\n  University, (2) AIST)","authorsParsed":[["Isume","Vitor Hideyo","","1 and 2"],["Kiyokawa","Takuya","","1 and 2"],["Yamanobe","Natsuki","","1 and 2"],["Domae","Yukiyasu","","1 and 2"],["Wan","Weiwei","","1 and 2"],["Harada","Kensuke","","1 and 2"]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 03:22:04 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 01:27:59 GMT"}],"updateDate":"2024-08-19","timestamp":1721359324000,"abstract":"  Inspired by traditional handmade crafts, where a person improvises assemblies\nbased on the available objects, we formally introduce the Craft Assembly Task.\nIt is a robotic assembly task that involves building an accurate representation\nof a given target object using the available objects, which do not directly\ncorrespond to its parts. In this work, we focus on selecting the subset of\navailable objects for the final craft, when the given input is an RGB image of\nthe target in the wild. We use a mask segmentation neural network to identify\nvisible parts, followed by retrieving labelled template meshes. These meshes\nundergo pose optimization to determine the most suitable template. Then, we\npropose to simplify the parts of the transformed template mesh to primitive\nshapes like cuboids or cylinders. Finally, we design a search algorithm to find\ncorrespondences in the scene based on local and global proportions. We develop\nbaselines for comparison that consider all possible combinations, and choose\nthe highest scoring combination for common metrics used in foreground maps and\nmask accuracy. Our approach achieves comparable results to the baselines for\ntwo different scenes, and we show qualitative results for an implementation in\na real-world scenario.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}