{"id":"2407.08408","title":"A Two-Stage Machine Learning-Aided Approach for Quench Identification at\n  the European XFEL","authors":"Lynda Boukela, Annika Eichler, Julien Branlard, Nur Zulaiha Jomhari","authorsParsed":[["Boukela","Lynda",""],["Eichler","Annika",""],["Branlard","Julien",""],["Jomhari","Nur Zulaiha",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 11:21:41 GMT"}],"updateDate":"2024-07-12","timestamp":1720696901000,"abstract":"  This paper introduces a machine learning-aided fault detection and isolation\nmethod applied to the case study of quench identification at the European X-Ray\nFree-Electron Laser. The plant utilizes 800 superconducting radio-frequency\ncavities in order to accelerate electron bunches to high energies of up to 17.5\nGeV. Various faulty events can disrupt the nominal functioning of the\naccelerator, including quenches that can lead to a loss of the\nsuperconductivity of the cavities and the interruption of their operation. In\nthis context, our solution consists in analyzing signals reflecting the\ndynamics of the cavities in a two-stage approach. (I) Fault detection that uses\nanalytical redundancy to process the data and generate a residual. The\nevaluation of the residual through the generalized likelihood ratio allows\ndetecting the faulty behaviors. (II) Fault isolation which involves the\ndistinction of the quenches from the other faults. To this end, we proceed with\na data-driven model of the k-medoids algorithm that explores different\nsimilarity measures, namely, the Euclidean and the dynamic time warping.\nFinally, we evaluate the new method and compare it to the currently deployed\nquench detection system, the results show the improved performance achieved by\nour method.\n","subjects":["Physics/Instrumentation and Detectors","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fNp878t76ASdYapcjE8U7zXpPmRFBd0xAXeGcQtRujY","pdfSize":"1395115"}
