{"id":"2407.13094","title":"Rethinking Video-Text Understanding: Retrieval from Counterfactually\n  Augmented Data","authors":"Wufei Ma, Kai Li, Zhongshi Jiang, Moustafa Meshry, Qihao Liu, Huiyu\n  Wang, Christian H\\\"ane, and Alan Yuille","authorsParsed":[["Ma","Wufei",""],["Li","Kai",""],["Jiang","Zhongshi",""],["Meshry","Moustafa",""],["Liu","Qihao",""],["Wang","Huiyu",""],["Häne","Christian",""],["Yuille","Alan",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 01:55:48 GMT"}],"updateDate":"2024-07-19","timestamp":1721267748000,"abstract":"  Recent video-text foundation models have demonstrated strong performance on a\nwide variety of downstream video understanding tasks. Can these video-text\nmodels genuinely understand the contents of natural videos? Standard video-text\nevaluations could be misleading as many questions can be inferred merely from\nthe objects and contexts in a single frame or biases inherent in the datasets.\nIn this paper, we aim to better assess the capabilities of current video-text\nmodels and understand their limitations. We propose a novel evaluation task for\nvideo-text understanding, namely retrieval from counterfactually augmented data\n(RCAD), and a new Feint6K dataset. To succeed on our new evaluation task,\nmodels must derive a comprehensive understanding of the video from cross-frame\nreasoning. Analyses show that previous video-text foundation models can be\neasily fooled by counterfactually augmented data and are far behind human-level\nperformance. In order to narrow the gap between video-text models and human\nperformance on RCAD, we identify a key limitation of current contrastive\napproaches on video-text data and introduce LLM-teacher, a more effective\napproach to learn action semantics by leveraging knowledge obtained from a\npretrained large language model. Experiments and analyses show that our\napproach successfully learn more discriminative action embeddings and improves\nresults on Feint6K when applied to multiple video-text models. Our Feint6K\ndataset and project page is available at https://feint6k.github.io.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ai0KBAij9c5ppVRF93NK5njjhTavNcWhMSp897fStRo","pdfSize":"26886875"}
