{"id":"2407.06523","title":"Lepton flavor of four-fermion operator and fermion portal dark matter","authors":"Yuxuan He, Gang Li, Jia Liu, Xiao-Ping Wang, Xiang Zhao","authorsParsed":[["He","Yuxuan",""],["Li","Gang",""],["Liu","Jia",""],["Wang","Xiao-Ping",""],["Zhao","Xiang",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 03:31:24 GMT"}],"updateDate":"2024-07-10","timestamp":1720495884000,"abstract":"  We study the ultraviolet completion of semileptonic four-fermion operator\n$O_{ledq}^{\\alpha \\beta 11}$ that incorporates Majorana dark matter (DM) in\nboth lepton-flavor-conserving (LFC) and lepton-flavor-violating (LFV) scenarios\nat the one-loop level via box diagram, which effectively alleviates the lower\nbounds on the new physics scale. The interplay between the model-independent\nconstraints on the Wilson coefficients and DM direct detection, relic density,\nand collider searches in the context of fermion portal DM model with two\nmediators is investigated. We find that both the projected future constraint on\nthe LFC Wilson coefficient $C_{ledq}^{2211}/\\Lambda^2< (12.3~\\text{TeV})^{-2}$\nfrom the measurements of neutrino non-standard interaction in the\nnext-generation neutrino oscillation experiments, and LFV constraint\n$C_{ledq}^{1211}/\\Lambda^2< \\left(2.2\\times 10^3 ~\\text{TeV} \\right)^{-2}$ from\nongoing charged-lepton-flavor-violation searches, provide a complementary\nexploration of the parameter space encompassing the DM mass and scalar mass.\nWith the colored mediator mass typically around $2~\\text{TeV}$, the sensitivity\nof the indirect constraints on the four-fermion operator could surpass those of\ncollider searches and DM direct detection, in scenarios where the masses of the\nDM and scalar are close. By ensuring the correct DM relic density, however, we\nobtain that the collider searches and DM direct detection are more sensitive to\nthe electroweak scale DM and scalar compared to the indirect constraints.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}