{"id":"2407.16540","title":"Gravity experiments with radio pulsars","authors":"Paulo C. C. Freire and Norbert Wex","authorsParsed":[["Freire","Paulo C. C.",""],["Wex","Norbert",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:49:40 GMT"}],"updateDate":"2024-07-24","timestamp":1721746180000,"abstract":"  The discovery of the first pulsar in a binary star system, the Hulse--Taylor\npulsar, 50 years ago opened up an entirely new field of experimental gravity.\nFor the first time it was possible to investigate strong-field and radiative\naspects of the gravitational interaction. Continued observations of the\nHulse--Taylor pulsar eventually led, among other confirmations of the\npredictions of general relativity (GR), to the first evidence for the reality\nof gravitational waves. In the meantime, many more radio pulsars have been\ndiscovered that are suitable for testing GR and its alternatives. One\nparticularly remarkable binary system is the Double Pulsar, which has far\nsurpassed the Hulse--Taylor pulsar in several respects. In addition, binary\npulsar-white dwarf systems have been shown to be particularly suitable for\ntesting alternative gravitational theories, as they often predict strong\ndipolar gravitational radiation for such asymmetric systems. A rather unique\npulsar laboratory is the pulsar in a hierarchical stellar triple, that led to\nby far the most precise confirmation of the strong-field version of the\nuniversality of free fall. Using radio pulsars, it could be shown that\nadditional aspects of the Strong Equivalence Principle apply to the dynamics of\nstrongly self-gravitating bodies, like the local position and local Lorentz\ninvariance of the gravitational interaction. So far, GR has passed all pulsar\ntests with flying colours, while at the same time many alternative gravity\ntheories have either been strongly constrained or even falsified. New\ntelescopes, instrumentation, timing and search algorithms promise a significant\nimprovement of the existing tests and the discovery of (qualitatively) new,\nmore relativistic binary systems.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}