{"id":"2407.20139","title":"Emission Reduction in Urban Environments by Replacing Conventional City\n  Buses with Electric Bus Technology: A Case Study of Pakistan","authors":"Muhammad Haris Saleem, S. Wajahat Ali, Sheikh Abdullah Shehzad","authorsParsed":[["Saleem","Muhammad Haris",""],["Ali","S. Wajahat",""],["Shehzad","Sheikh Abdullah",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 16:06:41 GMT"}],"updateDate":"2024-07-30","timestamp":1722269201000,"abstract":"  The global transportation industry has become one of the main contributors to\nair pollution. Consequently, electric buses and green transportation are\ngaining popularity as crucial steps to reduce emission concerns. Many developed\ncountries have already adopted the concept of Battery Electric Buses (BEBs),\nwhile the developing ones are just starting with it. However, BEB fleets have\nadvantages, such as lower fuel, higher efficiency, lower maintenance, and\nenergy security. Yet, several obstacles must be overcome to support the mass\ndeployment of BEBs. These incorporate forthright expense charges, arranging\nloads, BEB reach, and newness to BEB innovation. Stakeholders like\npolicymakers, private company owners, and government leaders have a lot to\nconsider before introducing BEBs at any level in Pakistan. As a result, to\noperate an electric bus system profitably, it is crucial to develop a proper\nelectric bus network and fleet, especially for bus operators who need to buy\nenough electric buses at the appropriate time. As a result, this paper aims to\ninvestigate if operating an electric bus could be an alternative to regular bus\noperations. The proposed methodology develops modeling software to cater to\nvarious scenarios to determine a proper-designed electric bus operating system\nin terms of the electric bus route, service frequency, and quantity. This\nresearch work simulates and financially analyses an operating Public Transport\nInfrastructure with a proposed Green Solution. The results show that regardless\nof the high upfront costs of BEB infrastructure, it becomes profitable in 6-7\nyears, resulting in a decreased Total Cost of Ownership (TCO) of approximately\n30% of its counterpart. The study also provides a clear policy pathway to help\nstakeholders make informed decisions related to the electrification of public\ntransport in Pakistan.\n","subjects":["Economics/General Economics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/"}