{"id":"2407.16985","title":"Sparse Tensor PCA via Tensor Decomposition for Unsupervised Feature\n  Selection","authors":"Junjing Zheng, Xinyu Zhang, Weidong Jiang","authorsParsed":[["Zheng","Junjing",""],["Zhang","Xinyu",""],["Jiang","Weidong",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 04:04:56 GMT"}],"updateDate":"2024-07-25","timestamp":1721793896000,"abstract":"  Recently, introducing Tensor Decomposition (TD) methods into unsupervised\nfeature selection (UFS) has been a rising research point. A tensor structure is\nbeneficial for mining the relations between different modes and helps relieve\nthe computation burden. However, while existing methods exploit TD to minimize\nthe reconstruction error of a data tensor, they don't fully utilize the\ninterpretable and discriminative information in the factor matrices. Moreover,\nmost methods require domain knowledge to perform feature selection. To solve\nthe above problems, we develop two Sparse Tensor Principal Component Analysis\n(STPCA) models that utilize the projection directions in the factor matrices to\nperform UFS. The first model extends Tucker Decomposition to a multiview sparse\nregression form and is transformed into several alternatively solved convex\nsubproblems. The second model formulates a sparse version of the family of\nTensor Singular Value Decomposition (T-SVDs) and is transformed into individual\nconvex subproblems. For both models, we prove the optimal solution of each\nsubproblem falls onto the Hermitian Positive Semidefinite Cone (HPSD).\nAccordingly, we design two fast algorithms based on HPSD projection and prove\ntheir convergence. According to the experimental results on two original\nsynthetic datasets (Orbit and Array Signal) and five real-world datasets, the\ntwo proposed methods are suitable for handling different data tensor scenarios\nand outperform the state-of-the-art UFS methods.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"WzJwnCvwnupL8QMvfhG1bE4XVqng_hdVdOIL15N49u4","pdfSize":"2402089"}
