{"id":"2407.19207","title":"Controlling structure and interfacial interaction of monolayer TaSe2 on\n  bilayer graphene","authors":"Hyobeom Lee, Hayoon Im, Byoung Ki Choi, Kyoungree Park, Yi Chen, Wei\n  Ruan, Yong Zhong, Ji-Eun Lee, Hyejin Ryu, Michael F. Crommie, Zhi-Xun Shen,\n  Choongyu Hwang, Sung-Kwan Mo, and Jinwoong Hwang","authorsParsed":[["Lee","Hyobeom",""],["Im","Hayoon",""],["Choi","Byoung Ki",""],["Park","Kyoungree",""],["Chen","Yi",""],["Ruan","Wei",""],["Zhong","Yong",""],["Lee","Ji-Eun",""],["Ryu","Hyejin",""],["Crommie","Michael F.",""],["Shen","Zhi-Xun",""],["Hwang","Choongyu",""],["Mo","Sung-Kwan",""],["Hwang","Jinwoong",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 08:23:24 GMT"}],"updateDate":"2024-07-30","timestamp":1722068604000,"abstract":"  Tunability of interfacial effects between two-dimensional (2D) crystals is\ncrucial not only for understanding the intrinsic properties of each system, but\nalso for designing electronic devices based on ultra-thin heterostructures. A\nprerequisite of such heterostructure engineering is the availability of 2D\ncrystals with different degrees of interfacial interactions. In this work, we\nreport a controlled epitaxial growth of monolayer TaSe2 with different\nstructural phases, 1H and 1T, on a bilayer graphene (BLG) substrate using\nmolecular beam epitaxy, and its impact on the electronic properties of the\nheterostructures using angle-resolved photoemission spectroscopy. 1H-TaSe2\nexhibits significant charge transfer and band hybridization at the interface,\nwhereas 1T-TaSe2 shows weak interactions with the substrate. The distinct\ninterfacial interactions are attributed to the dual effects from the\ndifferences of the work functions as well as the relative interlayer distance\nbetween TaSe2 films and BLG substrate. The method demonstrated here provides a\nviable route towards interface engineering in a variety of transition-metal\ndichalcogenides that can be applied to future nano-devices with designed\nelectronic properties.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}