{"id":"2407.06143","title":"All You Need is a Paraboloid: Quadratic Cuts for Non-Convex MINLP","authors":"Adrian G\\\"o{\\ss}, Robert Burlacu, Alexander Martin","authorsParsed":[["Göß","Adrian",""],["Burlacu","Robert",""],["Martin","Alexander",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:18:24 GMT"}],"updateDate":"2024-07-09","timestamp":1720459104000,"abstract":"  It is only half the job to find a good solution for a mathematical\noptimization problem, as one needs to verify its quality by specifying a dual\nbound. When it comes to mixed-integer nonlinear programming (MINLP), strong\nprerequisites such as constraint qualifications appear suitable, but may be\ndifficult to verify computationally. In practice, solvers apply local\nrefinement or convexification strategies to retrieve tight dual bounds.\nHowever, these concepts require appropriate big-M formulations, generate new\nsub-problems, or struggle to represent non-convex characteristics in terms of\nhigh accuracy, all of which can lead to long running times.\n  As an alternative, we aim to leverage recent advances in mixed-integer\nquadratically-constrained programming (MIQCP) and propose a global\napproximation of constraint functions by paraboloids, \\ie, univariate quadratic\nterms. The approximation is retrieved as a solution to a mixed-integer linear\nprogramming (MIP) problem. Further, for each nonlinear constraint function, we\nsolve such MIPs and determine small numbers of paraboloids approximating it\nfrom either side. A replacement of the nonlinearities with the corresponding\nquadratic functions leads to a quadratically-constrained relaxation of the\noriginal problem. Solving the MIQCP relaxation then leads to a dual bound whose\ntightness depends on the approximation guarantee of the paraboloids. In\nsummary, this approach enables solvers that are explicitly tailored for\nquadratic constraints to solve MINLPs to global optimality.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}