{"id":"2407.01391","title":"$\\texttt{PineTree}$: A generative, fast, and differentiable halo model\n  for wide-field galaxy surveys","authors":"Simon Ding, Guilhem Lavaux, Jens Jasche","authorsParsed":[["Ding","Simon",""],["Lavaux","Guilhem",""],["Jasche","Jens",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:43:08 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 13:17:53 GMT"}],"updateDate":"2024-08-08","timestamp":1719848588000,"abstract":"  Mock halo catalogues are indispensable data products for developing and\nvalidating cosmological inference pipelines. A major challenge in generating\nmock catalogues is modelling the halo or galaxy bias, which is the mapping from\nmatter density to dark matter halos or observable galaxies. To this end, N-body\ncodes produce state-of-the-art catalogues. However, generating large numbers of\nthese N-body simulations for big volumes, requires significant computational\ntime. We introduce and benchmark a differentiable and physics-informed neural\nnetwork that can generate mock halo catalogues of comparable quality to those\nobtained from full N-body codes. The model design is computationally efficient\nfor the training procedure and the production of large mock suites. We present\na neural network, relying only on 18 to 34 trainable parameters, that produces\nhalo catalogues from dark matter overdensity fields. The reduction of network\nweights is realised through incorporating symmetries motivated by first\nprinciples into our model architecture. We train our model using dark matter\nonly N-body simulations across different resolutions, redshifts, and mass bins.\nWe validate the final mock catalogues by comparing them to N-body halo\ncatalogues using different N-point correlation functions. Our model produces\nmock halo catalogues consistent with the reference simulations, showing that\nthis novel network is a promising way to generate mock data for upcoming\nwide-field surveys due to its computational efficiency. Moreover, we find that\nthe network can be trained on approximate overdensity fields to reduce the\ncomputational cost further. We also present how the trained network parameters\ncan be interpreted to give insights into the physics of structure formation.\nFinally, we discuss the current limitations of our model as well as more\ngeneral requirements and pitfalls for approximate halo mock generation.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}