{"id":"2407.18898","title":"A Flexible and Scalable Approach for Collecting Wildlife Advertisements\n  on the Web","authors":"Juliana Barbosa, Sunandan Chakraborty and Juliana Freire","authorsParsed":[["Barbosa","Juliana",""],["Chakraborty","Sunandan",""],["Freire","Juliana",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:51:41 GMT"}],"updateDate":"2024-07-29","timestamp":1722016301000,"abstract":"  Wildlife traffickers are increasingly carrying out their activities in\ncyberspace. As they advertise and sell wildlife products in online\nmarketplaces, they leave digital traces of their activity. This creates a new\nopportunity: by analyzing these traces, we can obtain insights into how\ntrafficking networks work as well as how they can be disrupted. However,\ncollecting such information is difficult. Online marketplaces sell a very large\nnumber of products and identifying ads that actually involve wildlife is a\ncomplex task that is hard to automate. Furthermore, given that the volume of\ndata is staggering, we need scalable mechanisms to acquire, filter, and store\nthe ads, as well as to make them available for analysis. In this paper, we\npresent a new approach to collect wildlife trafficking data at scale. We\npropose a data collection pipeline that combines scoped crawlers for data\ndiscovery and acquisition with foundational models and machine learning\nclassifiers to identify relevant ads. We describe a dataset we created using\nthis pipeline which is, to the best of our knowledge, the largest of its kind:\nit contains almost a million ads obtained from 41 marketplaces, covering 235\nspecies and 20 languages. The source code is publicly available at\n\\url{https://github.com/VIDA-NYU/wildlife_pipeline}.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ithxEMVOMNuuyz6xlsWB4uVS4GFENThnvToTAqYn3o8","pdfSize":"1410831","objectId":"0x4df86a044628984bb084bae6a7cf6672024ed88ef0fd9413984864600a2af458","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
