{"id":"2407.19960","title":"Integrated Communications and Security: RIS-Assisted Simultaneous\n  Transmission and Generation of Secret Keys","authors":"Ning Gao and Yuze Yao and Shi Jin and Cen Li and Michail Matthaiou","authorsParsed":[["Gao","Ning",""],["Yao","Yuze",""],["Jin","Shi",""],["Li","Cen",""],["Matthaiou","Michail",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 12:51:26 GMT"}],"updateDate":"2024-07-30","timestamp":1722257486000,"abstract":"  We develop a new integrated communications and security (ICAS) design\nparadigm by leveraging the concept of reconfigurable intelligent surfaces\n(RISs). In particular, we propose RIS-assisted simultaneous transmission and\nsecret key generation by sharing the RIS for these two tasks. Specifically, the\nlegitimate transceivers intend to jointly optimize the data transmission rate\nand the key generation rate by configuring the phase-shift of the RIS in the\npresence of a smart attacker. We first derive the key generation rate of the\nRIS-assisted physical layer key generation (PLKG). Then, to obtain the optimal\nRIS configuration, we formulate the problem as a secure transmission (ST) game\nand prove the existence of the Nash equilibrium (NE), and then derive the NE\npoint of the static game. For the dynamic ST game, we model the problem as a\nfinite Markov decision process and propose a model-free reinforcement learning\napproach to obtain the NE point. Particularly, considering that the legitimate\ntransceivers cannot obtain the channel state information (CSI) of the attacker\nin real-world conditions, we develop a deep recurrent Q-network (DRQN) based\ndynamic ST strategy to learn the optimal RIS configuration. The details of the\nalgorithm are provided, and then, the system complexity is analyzed. Our\nsimulation results show that the proposed DRQN based dynamic ST strategy has a\nbetter performance than the benchmarks even with a partial observation\ninformation, and achieves \"one time pad\" communication by allocating a suitable\nweight factor for data transmission and PLKG.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}