{"id":"2407.17237","title":"Near-Field Integrated Sensing and Communication with Extremely\n  Large-Scale Antenna Array","authors":"Haocheng Hua, Jie Xu, and Rui Zhang","authorsParsed":[["Hua","Haocheng",""],["Xu","Jie",""],["Zhang","Rui",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 12:48:27 GMT"}],"updateDate":"2024-07-25","timestamp":1721825307000,"abstract":"  This paper studies a near-field integrated sensing and communication (ISAC)\nsystem with extremely large-scale antenna array (ELAA), in which a base station\n(BS) deployed with enormous number of antennas transmits wireless signals to\ncommunicate with multiple communication users (CUs) and simultaneously uses the\necho signals to localize multiple point targets in the three-dimension (3D)\nspace. To balance the performance tradeoff between communication and target\nlocalization, we design the transmit covariance matrix at the BS to optimize\nthe localization performance while ensuring the\nsignal-to-interference-plus-noise ratio (SINR) constraints at individual CUs.\nIn particular, we formulate three design problems by considering different 3D\nlocalization performance metrics, including minimizing the sum Cram\\'er-Rao\nbound (CRB), maximizing the minimum target illumination power, and maximizing\nthe minimum target echo signal power. Although the three design problems are\nnon-convex in general, we obtain their global optimal solutions via the\ntechnique of semi-definite relaxation (SDR). It is shown that the three\nproblems have low-rank solution structures depending on the sensing and\ncommunication channel matrices, helping reduce the complexity of the SDR-based\nsolutions. Interestingly, we find that in the special case with a single\ncollocated target/CU present towards the middle of a symmetric uniform planar\narray (UPA), the optimal solutions to the three problems become identical to\nthe SINR-maximization design and have a closed form, while in other cases they\ncan be different in general. Besides, when the target/CU moves away from the\ntransmitter/receiver, the CRB may first decrease and then increase. These two\nphenomena differ from those in the far-field. Numerical results show the\nbenefits of the proposed designs for near-field ISAC, by exploiting the beam\nfocusing capabilities of ELAA.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}