{"id":"2407.02853","title":"Plant Doctor: A hybrid machine learning and image segmentation software\n  to quantify plant damage in video footage","authors":"Marc Josep Montagut Marques, Liu Mingxin, Kuri Thomas Shiojiri, Tomika\n  Hagiwara, Kayo Hirose, Kaori Shiojiri, Shinjiro Umezu","authorsParsed":[["Marques","Marc Josep Montagut",""],["Mingxin","Liu",""],["Shiojiri","Kuri Thomas",""],["Hagiwara","Tomika",""],["Hirose","Kayo",""],["Shiojiri","Kaori",""],["Umezu","Shinjiro",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 07:11:18 GMT"}],"updateDate":"2024-07-04","timestamp":1719990678000,"abstract":"  Artificial intelligence has significantly advanced the automation of\ndiagnostic processes, benefiting various fields including agriculture. This\nstudy introduces an AI-based system for the automatic diagnosis of urban street\nplants using video footage obtained with accessible camera devices. The system\naims to monitor plant health on a day-to-day basis, aiding in the control of\ndisease spreading in urban areas. By combining two machine vision algorithms,\nYOLOv8 and DeepSORT, the system efficiently identifies and tracks individual\nleaves, extracting the optimal images for health analysis. YOLOv8, chosen for\nits speed and computational efficiency, locates leaves, while DeepSORT ensures\nrobust tracking in complex environments. For detailed health assessment,\nDeepLabV3Plus, a convolutional neural network, is employed to segment and\nquantify leaf damage caused by bacteria, pests, and fungi. The hybrid system,\nnamed Plant Doctor, has been trained and validated using a diverse dataset\nincluding footage from Tokyo urban plants. The results demonstrate the\nrobustness and accuracy of the system in diagnosing leaf damage, with potential\napplications in large scale urban flora illness monitoring. This approach\nprovides a non-invasive, efficient, and scalable solution for urban tree health\nmanagement, supporting sustainable urban ecosystems.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}