{"id":"2407.01364","title":"Co-benefits of Agricultural Diversification and Technology for Food and\n  Nutrition Security in China","authors":"Thomas Cherico Wanger, Estelle Raveloaritiana, Siyan Zeng, Haixiu Gao,\n  Xueqing He, Yiwen Shao, Panlong Wu, Kris A.G. Wyckhuys, Wenwu Zhou, Yi Zou,\n  Zengrong Zhu, Ling Li, Haiyan Cen, Yunhui Liu, Shenggen Fan","authorsParsed":[["Wanger","Thomas Cherico",""],["Raveloaritiana","Estelle",""],["Zeng","Siyan",""],["Gao","Haixiu",""],["He","Xueqing",""],["Shao","Yiwen",""],["Wu","Panlong",""],["Wyckhuys","Kris A. G.",""],["Zhou","Wenwu",""],["Zou","Yi",""],["Zhu","Zengrong",""],["Li","Ling",""],["Cen","Haiyan",""],["Liu","Yunhui",""],["Fan","Shenggen",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:20:16 GMT"}],"updateDate":"2024-07-02","timestamp":1719847216000,"abstract":"  China is the leading crop producer and has successfully implemented\nsustainable development programs related to agriculture. Sustainable\nagriculture has been promoted to achieve national food security targets such as\nfood self-sufficiency through the well-facilitated farmland construction (WFFC)\napproach. The WFFC is introduced in Chinas current national 10-year plan to\nconsolidate farmlands into large and simplified production areas to maximise\nautomation, and improve soil fertility and productivity. However, research\nsuggests that diversified and smaller farms faciliate ecosystem services, can\nimprove yield resilience, defuse human health threats, and increase farm\nprofitability. Currently, WFFC has not considered ecological farmland\nimprovements and it may miss long-term environmental benefits including\necosystem service preservation conducive to yields. Moreover, the nutritional\nstatus in China has changed in recent decades with undernutrition being\ndramatically reduced, but the prevalence of overweight, obesity, and chronic\ndiseases being increased. While a strategic choice and management of crop and\nlivestock species can improve nutrition, the environmental and production\nbenefits of agricultural diversification are currently not well interlinked\nwith Chinas food and nutrition security discussions. Lastly, the role of\nagricultural technology for socioeconomic benefits and the link with\ndiversified agricultural production may provide vast benefits for food\nsecurity. Here, we focus on the opportunities and co-benefits of agricultural\ndiversification and technology innovations to advance food and nutrition\nsecurity in China through ecosystem service and yield benefits. Our applied\nfive-point research agenda can provide evidence-based opportunities to support\nChina in reaching its ambitious food security targets through agricultural\ndiversification with global ramifications.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7zWDrcB8yDuxNZtS8QyxZoBCl01Cb0VBD_tsjK5t4F4","pdfSize":"380479","objectId":"0xe3f7d91ba4cf01f5a0f17cb7963ecf681827f39fbe263fa54f0885cf64d99cd5","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
