{"id":"2407.09042","title":"Hysteresis near the transition of the large-scale dynamo in the presence\n  of the small-scale dynamo","authors":"Vindya Vashishth","authorsParsed":[["Vashishth","Vindya",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 07:05:47 GMT"}],"updateDate":"2024-07-15","timestamp":1720767947000,"abstract":"  In Sun and solar-type stars, there is a critical dynamo number for the\noperation of a large-scale dynamo, below which the dynamo ceases to operate.\nThis region is known as the subcritical region. Previous studies showed the\npossibility of operating the solar-like large-scale (global) dynamo in the\nsubcritical region without a small-scale dynamo. As in the solar convection\nzone, both large- and small-scale dynamos are expected to operate at the same\ntime and location, we check the robustness of the previously identified\nsubcritical dynamo branch in a numerical model in which both large- and\nsmall-scale dynamos are excited. For this, we use the {\\sc Pencil Code} and set\nup an $\\alpha\\Omega$ dynamo model with uniform shear and helically forced\nturbulence. We have performed a few sets of simulations at different relative\nhelicity to explore the generation of large-scale oscillatory fields in the\npresence of small-scale dynamo. We find that in some parameter regimes, the\ndynamo shows hysteresis behavior, i.e., two dynamo solutions are possible\ndepending on the initial parameters used. A decaying solution when the dynamo\nwas started with a weak field and a strong oscillatory solution if the dynamo\nwas initialized with a strong field. Thus, the existence of the sub-critical\nbranch of the large-scale dynamo in the presence of small-scale dynamo is\nestablished. However, the regime of hysteresis is quite narrow with respect to\nthe case without the small-scale dynamo. Our work supports the possible\nexistence of large-scale dynamo in the sub-critical regime of slowly rotating\nstars.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}