{"id":"2407.12264","title":"Hybrid Near-Far Field Channel Estimation for Holographic MIMO\n  Communications","authors":"Shaohua Yue, Shuhao Zeng, Liang Liu, Yonina C. Eldar, Boya Di","authorsParsed":[["Yue","Shaohua",""],["Zeng","Shuhao",""],["Liu","Liang",""],["Eldar","Yonina C.",""],["Di","Boya",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 02:26:58 GMT"}],"updateDate":"2024-07-18","timestamp":1721183218000,"abstract":"  Holographic MIMO communications, enabled by large-scale antenna arrays with\nquasi-continuous apertures, is a potential technology for spectrum efficiency\nimprovement. However, the increased antenna aperture size extends the range of\nthe Fresnel region, leading to a hybrid near-far field communication mode. The\nusers and scatterers randomly lie in near-field and far-field zones, and thus,\nconventional far-field-only and near-field-only channel estimation methods may\nnot work. To tackle this challenge, we demonstrate the existence of the power\ndiffusion (PD) effect, which leads to a mismatch between the hybrid-field\nchannel and existing channel estimation methods. Specifically, in far-field and\nnear-field transform domains, the power gain of one channel path may diffuse to\nother positions, thus generating fake paths. This renders the conventional\ntechniques unable to detect those real paths. We propose a PD-aware orthogonal\nmatching pursuit algorithm to eliminate the influence of the PD effect by\nidentifying the PD range within which paths diffuse to other positions. PD-OMP\nfits a general case without prior knowledge of near-field and far-field path\nnumbers and the user's location. The computational complexity of PD-OMP and the\nCramer-Rao Lower Bound for the sparse-signal-recovery-based channel estimation\nare also derived. Simulation results show that PD-OMP outperforms\nstate-of-the-art hybrid-field channel estimation methods.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"fLUNCn8Jv_yxC7VvFYyj1KQQGA2mjMDlgah0m2eWMGQ","pdfSize":"561131"}
