{"id":"2407.06090","title":"The Need for a Recurring Large-Scale Benchmarking Survey to Continually\n  Evaluate Sampling Methods and Administration Modes: Lessons from the 2022\n  Collaborative Midterm Survey","authors":"Peter K. Enns, Colleen L. Barry, James N. Druckman, Sergio\n  Garcia-Rios, David C. Wilson and Jonathon P. Schuldt","authorsParsed":[["Enns","Peter K.",""],["Barry","Colleen L.",""],["Druckman","James N.",""],["Garcia-Rios","Sergio",""],["Wilson","David C.",""],["Schuldt","Jonathon P.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 16:30:12 GMT"}],"updateDate":"2024-07-09","timestamp":1720456212000,"abstract":"  As survey methods adapt to technological and societal changes, a growing body\nof research seeks to understand the tradeoffs associated with various sampling\nmethods and administration modes. We show how the NSF-funded 2022 Collaborative\nMidterm Survey (CMS) can be used as a dynamic and transparent framework for\nevaluating which sampling approaches - or combination of approaches - are best\nsuited for various research goals. The CMS is ideally suited for this purpose\nbecause it includes almost 20,000 respondents interviewed using two\nadministration modes (phone and online) and data drawn from random digit\ndialing, random address-based sampling, a probability-based panel, two\nnonprobability panels, and two nonprobability marketplaces. The analysis\nconsiders three types of population benchmarks (election data, administrative\nrecords, and large government surveys) and focuses on the national-level\nestimates as well as oversamples in three states (California, Florida, and\nWisconsin). In addition to documenting how each of the survey strategies\nperformed, we develop a strategy to assess how different combinations of\napproaches compare to different population benchmarks in order to guide\nresearchers combining sampling methods and sources. We conclude by providing\nspecific recommendations to public opinion and election survey researchers and\ndemonstrating how our approach could be applied to a large government survey\nconducted at regular intervals to provide ongoing guidance to researchers,\ngovernment, businesses, and nonprofits regarding the most appropriate survey\nsampling and administration methods.\n","subjects":["Statistics/Other Statistics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}