{"id":"2407.07818","title":"The Misclassification Likelihood Matrix: Some Classes Are More Likely To\n  Be Misclassified Than Others","authors":"Daniel Sikar, Artur Garcez, Robin Bloomfield, Tillman Weyde, Kaleem\n  Peeroo, Naman Singh, Maeve Hutchinson, Dany Laksono, Mirela Reljan-Delaney","authorsParsed":[["Sikar","Daniel",""],["Garcez","Artur",""],["Bloomfield","Robin",""],["Weyde","Tillman",""],["Peeroo","Kaleem",""],["Singh","Naman",""],["Hutchinson","Maeve",""],["Laksono","Dany",""],["Reljan-Delaney","Mirela",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 16:43:14 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 20:41:15 GMT"},{"version":"v3","created":"Tue, 13 Aug 2024 07:18:04 GMT"}],"updateDate":"2024-08-14","timestamp":1720629794000,"abstract":"  This study introduces the Misclassification Likelihood Matrix (MLM) as a\nnovel tool for quantifying the reliability of neural network predictions under\ndistribution shifts. The MLM is obtained by leveraging softmax outputs and\nclustering techniques to measure the distances between the predictions of a\ntrained neural network and class centroids. By analyzing these distances, the\nMLM provides a comprehensive view of the model's misclassification tendencies,\nenabling decision-makers to identify the most common and critical sources of\nerrors. The MLM allows for the prioritization of model improvements and the\nestablishment of decision thresholds based on acceptable risk levels. The\napproach is evaluated on the MNIST dataset using a Convolutional Neural Network\n(CNN) and a perturbed version of the dataset to simulate distribution shifts.\nThe results demonstrate the effectiveness of the MLM in assessing the\nreliability of predictions and highlight its potential in enhancing the\ninterpretability and risk mitigation capabilities of neural networks. The\nimplications of this work extend beyond image classification, with ongoing\napplications in autonomous systems, such as self-driving cars, to improve the\nsafety and reliability of decision-making in complex, real-world environments.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JqCe6WAdnwUWLVtNWdaQhnehFIynMbLDQ932wK1Uc5A","pdfSize":"610633","objectId":"0x8785aeabdc4d2ad60864c85f869cef87b7f3a964d244da5492ece4144a5ca2a1","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
