{"id":"2407.16578","title":"Unveiling In-Situ Spheroid Formation in Distant, Submillimeter-Bright\n  Galaxies","authors":"Qing-Hua Tan, Emanuele Daddi, Benjamin Magnelli, Camila A. Correa,\n  Fr\\'ed\\'eric Bournaud, Sylvia Adscheid, Shao-Bo Zhang, David Elbaz, Carlos\n  G\\'omez-Guijarro, Boris S. Kalita, Daizhong Liu, Zhaoxuan Liu, J\\'er\\^ome\n  Pety, Annagrazia Puglisi, Eva Schinnerer, John D. Silverman, and Francesco\n  Valentino","authorsParsed":[["Tan","Qing-Hua",""],["Daddi","Emanuele",""],["Magnelli","Benjamin",""],["Correa","Camila A.",""],["Bournaud","Frédéric",""],["Adscheid","Sylvia",""],["Zhang","Shao-Bo",""],["Elbaz","David",""],["Gómez-Guijarro","Carlos",""],["Kalita","Boris S.",""],["Liu","Daizhong",""],["Liu","Zhaoxuan",""],["Pety","Jérôme",""],["Puglisi","Annagrazia",""],["Schinnerer","Eva",""],["Silverman","John D.",""],["Valentino","Francesco",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 15:32:32 GMT"}],"updateDate":"2024-07-24","timestamp":1721748752000,"abstract":"  The majority of stars in today's Universe reside within spheroids, which are\nbulges of spiral galaxies and elliptical galaxies. Their formation is still an\nunsolved problem. Infrared/submm-bright galaxies at high redshifts have long\nbeen suspected to be related to spheroids formation. Proving this connection\nhas been hampered so far by heavy dust obscuration when focusing on their\nstellar emission or by methodologies and limited signal-to-noise ratios when\nlooking at submm wavelengths. Here we show that spheroids are directly\ngenerated by star formation within the cores of highly luminous starburst\ngalaxies in the distant Universe. This follows from the ALMA submillimeter\nsurface brightness profiles which deviate significantly from those of\nexponential disks, and from the skewed-high axis-ratio distribution, both\nderived with a novel analysis technique. These galaxies are fully triaxial\nrather than flat disks: scale-height ratios are 0.5 on average and $>0.6$ for\nmost spatially compact systems. These observations, supported by simulations,\nreveal a cosmologically relevant pathway for in-situ spheroid formation through\nstarbursts likely preferentially triggered by interactions (and mergers) acting\non galaxies fed by non co-planar gas accretion streams.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}