{"id":"2407.13123","title":"Reconfigurable Intelligent Surface Aided Vehicular Edge Computing: Joint\n  Phase-shift Optimization and Multi-User Power Allocation","authors":"Kangwei Qi, Qiong Wu, Pingyi Fan, Nan Cheng, Wen Chen, and Khaled B.\n  Letaief","authorsParsed":[["Qi","Kangwei",""],["Wu","Qiong",""],["Fan","Pingyi",""],["Cheng","Nan",""],["Chen","Wen",""],["Letaief","Khaled B.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 03:18:59 GMT"}],"updateDate":"2024-07-19","timestamp":1721272739000,"abstract":"  Vehicular edge computing (VEC) is an emerging technology with significant\npotential in the field of internet of vehicles (IoV), enabling vehicles to\nperform intensive computational tasks locally or offload them to nearby edge\ndevices. However, the quality of communication links may be severely\ndeteriorated due to obstacles such as buildings, impeding the offloading\nprocess. To address this challenge, we introduce the use of Reconfigurable\nIntelligent Surfaces (RIS), which provide alternative communication pathways to\nassist vehicular communication. By dynamically adjusting the phase-shift of the\nRIS, the performance of VEC systems can be substantially improved. In this\nwork, we consider a RIS-assisted VEC system, and design an optimal scheme for\nlocal execution power, offloading power, and RIS phase-shift, where random task\narrivals and channel variations are taken into account. To address the scheme,\nwe propose an innovative deep reinforcement learning (DRL) framework that\ncombines the Deep Deterministic Policy Gradient (DDPG) algorithm for optimizing\nRIS phase-shift coefficients and the Multi-Agent Deep Deterministic Policy\nGradient (MADDPG) algorithm for optimizing the power allocation of vehicle user\n(VU). Simulation results show that our proposed scheme outperforms the\ntraditional centralized DDPG, Twin Delayed Deep Deterministic Policy Gradient\n(TD3) and some typical stochastic schemes.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}