{"id":"2407.19994","title":"A Study on the Implementation Method of an Agent-Based Advanced RAG\n  System Using Graph","authors":"Cheonsu Jeong","authorsParsed":[["Jeong","Cheonsu",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:26:43 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 09:03:36 GMT"},{"version":"v3","created":"Fri, 13 Sep 2024 12:19:26 GMT"}],"updateDate":"2024-09-16","timestamp":1722259603000,"abstract":"  This study aims to improve knowledge-based question-answering (QA) systems by\novercoming the limitations of existing Retrieval-Augmented Generation (RAG)\nmodels and implementing an advanced RAG system based on Graph technology to\ndevelop high-quality generative AI services. While existing RAG models\ndemonstrate high accuracy and fluency by utilizing retrieved information, they\nmay suffer from accuracy degradation as they generate responses using\npre-loaded knowledge without reprocessing. Additionally, they cannot\nincorporate real-time data after the RAG configuration stage, leading to issues\nwith contextual understanding and biased information. To address these\nlimitations, this study implemented an enhanced RAG system utilizing Graph\ntechnology. This system is designed to efficiently search and utilize\ninformation. Specifically, it employs LangGraph to evaluate the reliability of\nretrieved information and synthesizes diverse data to generate more accurate\nand enhanced responses. Furthermore, the study provides a detailed explanation\nof the system's operation, key implementation steps, and examples through\nimplementation code and validation results, thereby enhancing the understanding\nof advanced RAG technology. This approach offers practical guidelines for\nimplementing advanced RAG systems in corporate services, making it a valuable\nresource for practical application.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"aob98sQASBMJ7psu2zeDeIodWZF_48qKE4g_bbypuVw","pdfSize":"1226235","objectId":"0xeec00f19ffec507f80ad86a20f93cab51a9f342bb40d8fd317b10947b463e1e3","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
