{"id":"2407.19108","title":"ObjectCarver: Semi-automatic segmentation, reconstruction and separation\n  of 3D objects","authors":"Gemmechu Hassena, Jonathan Moon, Ryan Fujii, Andrew Yuen, Noah\n  Snavely, Steve Marschner, Bharath Hariharan","authorsParsed":[["Hassena","Gemmechu",""],["Moon","Jonathan",""],["Fujii","Ryan",""],["Yuen","Andrew",""],["Snavely","Noah",""],["Marschner","Steve",""],["Hariharan","Bharath",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 22:13:20 GMT"}],"updateDate":"2024-07-30","timestamp":1722032000000,"abstract":"  Implicit neural fields have made remarkable progress in reconstructing 3D\nsurfaces from multiple images; however, they encounter challenges when it comes\nto separating individual objects within a scene. Previous work has attempted to\ntackle this problem by introducing a framework to train separate signed\ndistance fields (SDFs) simultaneously for each of N objects and using a\nregularization term to prevent objects from overlapping. However, all of these\nmethods require segmentation masks to be provided, which are not always readily\navailable. We introduce our method, ObjectCarver, to tackle the problem of\nobject separation from just click input in a single view. Given posed\nmulti-view images and a set of user-input clicks to prompt segmentation of the\nindividual objects, our method decomposes the scene into separate objects and\nreconstructs a high-quality 3D surface for each one. We introduce a loss\nfunction that prevents floaters and avoids inappropriate carving-out due to\nocclusion. In addition, we introduce a novel scene initialization method that\nsignificantly speeds up the process while preserving geometric details compared\nto previous approaches. Despite requiring neither ground truth masks nor\nmonocular cues, our method outperforms baselines both qualitatively and\nquantitatively. In addition, we introduce a new benchmark dataset for\nevaluation.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qpcLkAUQ-SVo1fMcdZTp1DSB5ODfujOZFdv5r1ICrsk","pdfSize":"21432304"}
