{"id":"2407.17985","title":"Optimizing ToF-SIMS Depth Profiles of Semiconductor Heterostructures","authors":"Jan Tr\\\"oger, Reinhard Kersting, Birgit Hagenhoff, Dominique Bougeard,\n  Nikolay V. Abrosimov, Jan Klos, Lars R. Schreiber, Hartmut Bracht","authorsParsed":[["Tröger","Jan",""],["Kersting","Reinhard",""],["Hagenhoff","Birgit",""],["Bougeard","Dominique",""],["Abrosimov","Nikolay V.",""],["Klos","Jan",""],["Schreiber","Lars R.",""],["Bracht","Hartmut",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 12:21:28 GMT"}],"updateDate":"2024-07-26","timestamp":1721910088000,"abstract":"  The continuous technological development of electronic devices and the\nintroduction of new materials leads to ever greater demands on the fabrication\nof semiconductor heterostructures and their characterization. This work focuses\non optimizing Time-of-Flight Secondary Ion Mass Spectrometry (ToF-SIMS) depth\nprofiles of semiconductor heterostructures aiming at a minimization of\nmeasurement-induced profile broadening. As model system, a state-of-the-art\nMolecular Beam Epitaxy (MBE) grown multilayer homostructure consisting of\n$^{\\textit{nat}}$Si/$^{28}$Si bilayers with only 2 nm in thickness is\ninvestigated while varying the most relevant sputter parameters. Atomic\nconcentration-depth profiles are determined and an error function based\ndescription model is used to quantify layer thicknesses as well as profile\nbroadening. The optimization process leads to an excellent resolution of the\nmultilayer homostructure. The results of this optimization guide to a ToF-SIMS\nanalysis of another MBE grown heterostructure consisting of a strained and\nhighly purified $^{28}$Si layer sandwiched between two Si$_{0.7}$Ge$_{0.3}$\nlayers. The sandwiched $^{28}$Si layer represents a quantum well that has\nproven to be an excellent host for the implementation of electron-spin qubits.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QoibP7qWg3DNb_si82T6N8as0sA7uFFuP2F73Cd7GcM","pdfSize":"1766962","objectId":"0x3250cd8975a7da66b2521af825618e0bf8891c25d795f7831bd2e2db7ea34096","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
