{"id":"2407.05104","title":"Crowdsourced reviews reveal substantial disparities in public\n  perceptions of parking","authors":"Lingyao Li, Songhua Hu, Ly Dinh, Libby Hemphill","authorsParsed":[["Li","Lingyao",""],["Hu","Songhua",""],["Dinh","Ly",""],["Hemphill","Libby",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 15:17:17 GMT"}],"updateDate":"2024-07-09","timestamp":1720279037000,"abstract":"  Due to increased reliance on private vehicles and growing travel demand,\nparking remains a longstanding urban challenge globally. Quantifying parking\nperceptions is paramount as it enables decision-makers to identify problematic\nareas and make informed decisions on parking management. This study introduces\na cost-effective and widely accessible data source, crowdsourced online\nreviews, to investigate public perceptions of parking across the U.S.\nSpecifically, we examine 4,987,483 parking-related reviews for 1,129,460 points\nof interest (POIs) across 911 core-based statistical areas (CBSAs) sourced from\nGoogle Maps. We employ the Bidirectional Encoder Representations from\nTransformers (BERT) model to classify the parking sentiment and conduct\nregression analyses to explore its relationships with socio-spatial factors.\nFindings reveal significant variations in parking sentiment across POI types\nand CBSAs, with Restaurant POIs showing the most negative. Regression results\nfurther indicate that denser urban areas with higher proportions of African\nAmericans and Hispanics and lower socioeconomic status are more likely to\nexhibit negative parking sentiment. Interestingly, an opposite relationship\nbetween parking supply and sentiment is observed, indicating increasing supply\ndoes not necessarily improve parking experiences. Finally, our textual analysis\nidentifies keywords associated with positive or negative sentiments and\nhighlights disparities between urban and rural areas. Overall, this study\ndemonstrates the potential of a novel data source and methodological framework\nin measuring parking sentiment, offering valuable insights that help identify\nhyperlocal parking issues and guide targeted parking management strategies.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}