{"id":"2407.20561","title":"A Constrained Optimization approach for Ultrasound Shear Wave Speed\n  Estimation with Time-Lateral Plane Cleaning","authors":"Md. Jahin Alam and Md. Kamrul Hasan","authorsParsed":[["Alam","Md. Jahin",""],["Hasan","Md. Kamrul",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 05:29:51 GMT"}],"updateDate":"2024-07-31","timestamp":1722317391000,"abstract":"  Ultrasound shear wave elastography (SWE) is a noninvasive way to measure\nstiffness of soft tissue for medical diagnosis. In SWE imaging, an acoustic\nradiation force induces tissue displacement, which creates shear waves (SWs)\nthat travel laterally through the medium. Finding the lateral arrival times of\nSWs at different tissue locations helps figure out the shear wave speed (SWS),\nwhich is directly linked to the stiffness of the medium. Traditional SWS\nestimation techniques, however, are not noise resilient enough handling noise\nand reflection artifacts filled data. This paper proposes new techniques to\nestimate SWS in both time and frequency domains. These new methods optimize a\nloss function that is based on the lateral signal shift parameter between known\nlocations and is constrained by neighborhood displacement group shift\ndetermined from the time-lateral plane-denoised SW propagation data. The\nproposed constrained optimization is formed by coupling losses of local\nparticles with a Gaussian kernel giving an optimum arrival time for the center\nparticle by enforcing stiffness homogeneity in a small neighborhood to enable\ninherent noise resilience. The denoising scheme involves isolating the\ntransitioning SW profile in each time-lateral plane, creating a parameterized\nmask. Moreover, lateral interpolation is performed to enhance reconstruction\nresolution and obtain increased displacement groups to enhance the reliability\nof the optimization. The proposed noise robust scheme is tested on a simulation\nand three experimental datasets. The performance of the method is compared with\n3 ToF and 2 frequency-domain methods. The evaluations show visually and\nquantitatively superior and noise-robust reconstructions compared to\nstate-of-the-art methods. Due to its high contrast and minimal error, the\nproposed technique can find its application in tissue health inspection and\ncancer diagnosis.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}