{"id":"2407.13749","title":"BIRA: A Spherical Bistatic Reflectivity Measurement System","authors":"Carsten Andrich, Tobias F. Nowack, Alexander Ihlow, Sebastian Giehl,\n  Maximilian Engelhardt, Gerd Sommerkorn, Andreas Schwind, Willi Hofmann,\n  Christian Bornkessel, Reiner S. Thom\\\"a, Matthias A. Hein","authorsParsed":[["Andrich","Carsten",""],["Nowack","Tobias F.",""],["Ihlow","Alexander",""],["Giehl","Sebastian",""],["Engelhardt","Maximilian",""],["Sommerkorn","Gerd",""],["Schwind","Andreas",""],["Hofmann","Willi",""],["Bornkessel","Christian",""],["Thomä","Reiner S.",""],["Hein","Matthias A.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:52:36 GMT"}],"updateDate":"2024-07-19","timestamp":1721325156000,"abstract":"  The upcoming 6G mobile communication standard will offer a revolutionary new\nfeature: Integrated sensing and communication (ISAC) reuses mobile\ncommunication signals to realize multi-static radar for various applications\nincluding localization. Consequently, applied ISAC propagation research\nnecessitates to evolve from classical monostatic radar cross section (RCS)\nmeasurement of static targets on to bistatic radar reflectivity\ncharacterization of dynamic objects. Here, we introduce our \"Bistatic Radar\"\n(BIRA) and antenna measurement facility for bistatic spherical positioning with\nsub-millimeter accuracy on a diameter of up to 7 m and with almost continuous\nfrequency coverage from 0.7 up to 260 GHz. Currently, BIRA is the only bistatic\nmeasurement facility capable of unrestricted ISAC research: In addition to\nvector network analysis, BIRA employs advanced wideband transceiver technology\nwith an instantaneous bandwidth of up to 4 GHz. These transceivers grant BIRA\nthe unique ability to characterize dynamic targets in both Doppler and range,\nwhile also significantly accelerating RCS measurements of static objects.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}