{"id":"2407.11800","title":"Gradient Flows and Riemannian Structure in the Gromov-Wasserstein\n  Geometry","authors":"Zhengxin Zhang, Ziv Goldfeld, Kristjan Greenewald, Youssef Mroueh,\n  Bharath K. Sriperumbudur","authorsParsed":[["Zhang","Zhengxin",""],["Goldfeld","Ziv",""],["Greenewald","Kristjan",""],["Mroueh","Youssef",""],["Sriperumbudur","Bharath K.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:53:23 GMT"}],"updateDate":"2024-07-17","timestamp":1721141603000,"abstract":"  The Wasserstein space of probability measures is known for its intricate\nRiemannian structure, which underpins the Wasserstein geometry and enables\ngradient flow algorithms. However, the Wasserstein geometry may not be suitable\nfor certain tasks or data modalities. Motivated by scenarios where the global\nstructure of the data needs to be preserved, this work initiates the study of\ngradient flows and Riemannian structure in the Gromov-Wasserstein (GW)\ngeometry, which is particularly suited for such purposes. We focus on the inner\nproduct GW (IGW) distance between distributions on $\\mathbb{R}^d$. Given a\nfunctional $\\mathsf{F}:\\mathcal{P}_2(\\mathbb{R}^d)\\to\\mathbb{R}$ to optimize,\nwe present an implicit IGW minimizing movement scheme that generates a sequence\nof distributions $\\{\\rho_i\\}_{i=0}^n$, which are close in IGW and aligned in\nthe 2-Wasserstein sense. Taking the time step to zero, we prove that the\ndiscrete solution converges to an IGW generalized minimizing movement (GMM)\n$(\\rho_t)_t$ that follows the continuity equation with a velocity field $v_t\\in\nL^2(\\rho_t;\\mathbb{R}^d)$, specified by a global transformation of the\nWasserstein gradient of $\\mathsf{F}$. The transformation is given by a mobility\noperator that modifies the Wasserstein gradient to encode not only local\ninformation, but also global structure. Our gradient flow analysis leads us to\nidentify the Riemannian structure that gives rise to the intrinsic IGW\ngeometry, using which we establish a Benamou-Brenier-like formula for IGW. We\nconclude with a formal derivation, akin to the Otto calculus, of the IGW\ngradient as the inverse mobility acting on the Wasserstein gradient. Numerical\nexperiments validating our theory and demonstrating the global nature of IGW\ninterpolations are provided.\n","subjects":["Mathematics/Analysis of PDEs","Mathematics/Optimization and Control","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}