{"id":"2407.07405","title":"Targeting low micro-roughness for 3D printed aluminium mirrors using a\n  hot isostatic press","authors":"Carolyn Atkins (1), Younes Chahid (1), Gregory Lister (1), Rhys Tuck\n  (1), Richard Kotlewski (1), Robert M. Snell (2), Elaine R. Livera (2), Mariam\n  Faour (2), Iain Todd (2), Robert Deffley (2), James Shipley (3), Tom Walsh\n  (3), Johannes Gardstam (3), Cyril Bourgenot (4), Paul White (4), Spencer\n  Davies (4) and Samuel Tammas-Williams (5) (1 - UK ATC, 2 - University of\n  Sheffield, 3 - Quintus Technologies, 4 - Durham University and 5 - University\n  of Edinburgh)","authorsParsed":[["Atkins","Carolyn",""],["Chahid","Younes",""],["Lister","Gregory",""],["Tuck","Rhys",""],["Kotlewski","Richard",""],["Snell","Robert M.",""],["Livera","Elaine R.",""],["Faour","Mariam",""],["Todd","Iain",""],["Deffley","Robert",""],["Shipley","James",""],["Walsh","Tom",""],["Gardstam","Johannes",""],["Bourgenot","Cyril",""],["White","Paul",""],["Davies","Spencer",""],["Tammas-Williams","Samuel",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 07:05:40 GMT"}],"updateDate":"2024-07-11","timestamp":1720595140000,"abstract":"  Additive manufacturing (AM; 3D printing) in aluminium using laser powder bed\nfusion provides a new design space for lightweight mirror production. Printing\nlayer-by-layer enables the use of intricate lattices for mass reduction, as\nwell as organic shapes generated by topology optimisation, resulting in mirrors\noptimised for function as opposed to subtractive machining. However, porosity,\na common AM defect, is present in printed aluminium and it is a result of the\nprinting environment being either too hot or too cold, or gas entrapped bubbles\nwithin the aluminium powder. When present in an AM mirror substrates, porosity\nmanifests as pits on the reflective surface, which increases micro-roughness\nand therefore scattered light. There are different strategies to reduce the\nimpact of porosity: elimination during printing, coating the aluminium print in\nnickel phosphorous, or to apply a heat and pressure treatment to close the\npores, commonly known as a hot isostatic press (HIP).\n  This paper explores the application of HIP on printed aluminium substrates\nintended for mirror production using single point diamond turning (SPDT). The\nobjective of the HIP is to reduce porosity whilst targeting a small grain\ngrowth within the aluminium, which is important in allowing the SPDT to\ngenerate surfaces with low micro-roughness. For this study, three disks, 50 mm\ndiameter by 5 mm, were printed in AlSi10Mg at 0 deg, 45 deg, and 90 deg with\nrespect to the build plate. X-ray computed tomography (XCT) was conducted\nbefore and after the HIP cycle to confirm the effectiveness of HIP to close\nporosity. The disks were SPDT and the micro-roughness evaluated. Mechanical\ntesting and electron backscatter diffraction (EBSD) was used to quantify the\nmechanical strength and the grain size after HIP.\n","subjects":["Physics/Optics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4hVkiTcotQuir5aLayjmdTlNbKf6_kjam8KoxvO7WxY","pdfSize":"7728306"}
