{"id":"2407.11494","title":"Learning Semantic Latent Directions for Accurate and Controllable Human\n  Motion Prediction","authors":"Guowei Xu, Jiale Tao, Wen Li and Lixin Duan","authorsParsed":[["Xu","Guowei",""],["Tao","Jiale",""],["Li","Wen",""],["Duan","Lixin",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 08:31:59 GMT"}],"updateDate":"2024-07-17","timestamp":1721118719000,"abstract":"  In the realm of stochastic human motion prediction (SHMP), researchers have\noften turned to generative models like GANS, VAEs and diffusion models.\nHowever, most previous approaches have struggled to accurately predict motions\nthat are both realistic and coherent with past motion due to a lack of guidance\non the latent distribution. In this paper, we introduce Semantic Latent\nDirections (SLD) as a solution to this challenge, aiming to constrain the\nlatent space to learn meaningful motion semantics and enhance the accuracy of\nSHMP. SLD defines a series of orthogonal latent directions and represents the\nhypothesis of future motion as a linear combination of these directions. By\ncreating such an information bottleneck, SLD excels in capturing meaningful\nmotion semantics, thereby improving the precision of motion predictions.\nMoreover, SLD offers controllable prediction capabilities by adjusting the\ncoefficients of the latent directions during the inference phase. Expanding on\nSLD, we introduce a set of motion queries to enhance the diversity of\npredictions. By aligning these motion queries with the SLD space, SLD is\nfurther promoted to more accurate and coherent motion predictions. Through\nextensive experiments conducted on widely used benchmarks, we showcase the\nsuperiority of our method in accurately predicting motions while maintaining a\nbalance of realism and diversity. Our code and pretrained models are available\nat https://github.com/GuoweiXu368/SLD-HMP.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}