{"id":"2407.18498","title":"A Reliable Common-Sense Reasoning Socialbot Built Using LLMs and\n  Goal-Directed ASP","authors":"Yankai Zeng, Abhiramon Rajashekharan, Kinjal Basu, Huaduo Wang,\n  Joaqu\\'in Arias, Gopal Gupta","authorsParsed":[["Zeng","Yankai",""],["Rajashekharan","Abhiramon",""],["Basu","Kinjal",""],["Wang","Huaduo",""],["Arias","Joaquín",""],["Gupta","Gopal",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 04:13:43 GMT"}],"updateDate":"2024-07-29","timestamp":1721967223000,"abstract":"  The development of large language models (LLMs), such as GPT, has enabled the\nconstruction of several socialbots, like ChatGPT, that are receiving a lot of\nattention for their ability to simulate a human conversation. However, the\nconversation is not guided by a goal and is hard to control. In addition,\nbecause LLMs rely more on pattern recognition than deductive reasoning, they\ncan give confusing answers and have difficulty integrating multiple topics into\na cohesive response. These limitations often lead the LLM to deviate from the\nmain topic to keep the conversation interesting. We propose AutoCompanion, a\nsocialbot that uses an LLM model to translate natural language into predicates\n(and vice versa) and employs commonsense reasoning based on Answer Set\nProgramming (ASP) to hold a social conversation with a human. In particular, we\nrely on s(CASP), a goal-directed implementation of ASP as the backend. This\npaper presents the framework design and how an LLM is used to parse user\nmessages and generate a response from the s(CASP) engine output. To validate\nour proposal, we describe (real) conversations in which the chatbot's goal is\nto keep the user entertained by talking about movies and books, and s(CASP)\nensures (i) correctness of answers, (ii) coherence (and precision) during the\nconversation, which it dynamically regulates to achieve its specific purpose,\nand (iii) no deviation from the main topic.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Logic in Computer Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}