{"id":"2407.16922","title":"SUIM project: measuring the upper atmosphere from the ISS by\n  observations of the CXB transmitted through the Earth rim","authors":"Kumiko K. Nobukawa, Ayaki Takeda, Satoru Katsuda, Takeshi G. Tsuru,\n  Kazuhiro Nakazawa, Koji Mori, Hiroyuki Uchida, Masayoshi Nobukawa, Eisuke\n  Kurogi, Takumi Kishimoto, Reo Matsui, Yuma Aoki, Yamato Ito, Satoru Kuwano,\n  Tomitaka Tanaka, Mizuki Uenomachi, Masamune Matsuda, Takaya Yamawaki,\n  Takayoshi Kohmura","authorsParsed":[["Nobukawa","Kumiko K.",""],["Takeda","Ayaki",""],["Katsuda","Satoru",""],["Tsuru","Takeshi G.",""],["Nakazawa","Kazuhiro",""],["Mori","Koji",""],["Uchida","Hiroyuki",""],["Nobukawa","Masayoshi",""],["Kurogi","Eisuke",""],["Kishimoto","Takumi",""],["Matsui","Reo",""],["Aoki","Yuma",""],["Ito","Yamato",""],["Kuwano","Satoru",""],["Tanaka","Tomitaka",""],["Uenomachi","Mizuki",""],["Matsuda","Masamune",""],["Yamawaki","Takaya",""],["Kohmura","Takayoshi",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 01:13:47 GMT"}],"updateDate":"2024-07-25","timestamp":1721783627000,"abstract":"  The upper atmosphere at the altitude of 60-110 km, the mesosphere and lower\nthermosphere (MLT), has the least observational data of all atmospheres due to\nthe difficulties of in-situ observations. Previous studies demonstrated that\natmospheric occultation of cosmic X-ray sources is an effective technique to\ninvestigate the MLT. Aiming to measure the atmospheric density of the MLT\ncontinuously, we are developing an X-ray camera, \"Soipix for observing Upper\natmosphere as Iss experiment Mission (SUIM)\", dedicated to atmospheric\nobservations. SUIM will be installed on the exposed area of the International\nSpace Station (ISS) and face the ram direction of the ISS to point toward the\nEarth rim. Observing the cosmic X-ray background (CXB) transmitted through the\natmosphere, we will measure the absorption column density via spectroscopy and\nthus obtain the density of the upper atmosphere. The X-ray camera is composed\nof a slit collimator and two X-ray SOI-CMOS pixel sensors (SOIPIX), and will\nstand on its own and make observations, controlled by a CPU-embedded FPGA\n\"Zynq\". We plan to install the SUIM payload on the ISS in 2025 during the solar\nmaximum. In this paper, we report the overview and the development status of\nthis project.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}