{"id":"2407.13769","title":"Emergence of Sound in a Tunable Fermi Fluid","authors":"Songtao Huang, Yunpeng Ji, Thomas Repplinger, Gabriel G. T.\n  Assump\\c{c}\\~ao, Jianyi Chen, Grant L. Schumacher, Franklin J. Vivanco,\n  Hadrien Kurkjian, Nir Navon","authorsParsed":[["Huang","Songtao",""],["Ji","Yunpeng",""],["Repplinger","Thomas",""],["Assumpção","Gabriel G. T.",""],["Chen","Jianyi",""],["Schumacher","Grant L.",""],["Vivanco","Franklin J.",""],["Kurkjian","Hadrien",""],["Navon","Nir",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:59:52 GMT"}],"updateDate":"2024-07-19","timestamp":1721325592000,"abstract":"  Landau's Fermi-liquid (FL) theory has been successful at the phenomenological\ndescription of the normal phase of many different Fermi systems. Using a dilute\natomic Fermi fluid with tunable interactions, we investigate the microscopic\nbasis of Landau's theory with a system describable from first principles. We\nstudy transport properties of an interacting Fermi gas by measuring its density\nresponse to a periodic external perturbation. In an ideal Fermi gas, we measure\nfor the first time the celebrated Lindhard function. As the system is brought\nfrom the collisionless to the hydrodynamic regime, we observe the emergence of\nsound, and find that the experimental observations are quantitatively\nunderstood with a first-principle transport equation for the FL. When the\nsystem is more strongly interacting, we find deviations from such predictions.\nFinally, we observe the shape of the quasiparticle excitations directly from\nmomentum-space tomography and see how it evolves from the collisionless to the\ncollisional regime. Our study establishes this system as a clean platform for\nstudying Landau's theory of the FL and paves the way for extending the theory\nto more exotic conditions, such as nonlinear dynamics and FLs with strong\ncorrelations in versatile settings.\n","subjects":["Condensed Matter/Quantum Gases","Condensed Matter/Statistical Mechanics","Physics/Atomic Physics","Physics/Fluid Dynamics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}