{"id":"2407.16094","title":"Universal Spectral Transfer with Physical Prior-Informed Deep Generative\n  Learning","authors":"Yanmin Zhu, Loza F. Tadesse","authorsParsed":[["Zhu","Yanmin",""],["Tadesse","Loza F.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 23:31:10 GMT"}],"updateDate":"2024-07-24","timestamp":1721691070000,"abstract":"  Spectroscopy is a powerful analytical technique for characterizing matter\nacross physical and biological realms1-5. However, its fundamental principle\nnecessitates specialized instrumentation per physical phenomena probed,\nlimiting broad adoption and use in all relevant research. In this study, we\nintroduce SpectroGen, a novel physical prior-informed deep generative model for\ngenerating relevant spectral signatures across modalities using experimentally\ncollected spectral input only from a single modality. We achieve this by\nreimagining the representation of spectral data as mathematical constructs of\ndistributions instead of their traditional physical and molecular state\nrepresentations. The results from 319 standard mineral samples tested\ndemonstrate generating with 99% correlation and 0.01 root mean square error\nwith superior resolution than experimentally acquired ground truth spectra. We\nshowed transferring capability across Raman, Infrared, and X-ray Diffraction\nmodalities with Gaussian, Lorentzian, and Voigt distribution priors\nrespectively6-10. This approach however is globally generalizable for any\nspectral input that can be represented by a distribution prior, making it\nuniversally applicable. We believe our work revolutionizes the application\nsphere of spectroscopy, which has traditionally been limited by access to the\nrequired sophisticated and often expensive equipment towards accelerating\nmaterial, pharmaceutical, and biological discoveries.\n","subjects":["Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}