{"id":"2407.17195","title":"Surrogate-guided optimization in quantum networks","authors":"Luise Prielinger and \\'Alvaro G. I\\~nesta and Gayane Vardoyan","authorsParsed":[["Prielinger","Luise",""],["Iñesta","Álvaro G.",""],["Vardoyan","Gayane",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 11:55:18 GMT"}],"updateDate":"2024-07-25","timestamp":1721822118000,"abstract":"  We propose an optimization algorithm to improve the design and performance of\nquantum communication networks. When physical architectures become too complex\nfor analytical methods, numerical simulation becomes essential to study quantum\nnetwork behavior. Although highly informative, these simulations involve\ncomplex numerical functions without known analytical forms, making traditional\noptimization techniques that assume continuity, differentiability, or convexity\ninapplicable. Additionally, quantum network simulations are computationally\ndemanding, rendering global approaches like Simulated Annealing or genetic\nalgorithms,\n  which require extensive function evaluations, impractical. We introduce a\nmore efficient optimization workflow using machine learning models, which serve\nas surrogates for a given objective function. We demonstrate the effectiveness\nof our approach by applying it to three well-known optimization problems in\nquantum networking: quantum memory allocation for multiple network nodes,\ntuning an experimental parameter in all physical links of a quantum\nentanglement switch, and finding efficient protocol settings within a large\nasymmetric quantum network. The solutions found by our algorithm consistently\noutperform those obtained with our baseline approaches -- Simulated Annealing\nand Bayesian optimization -- in the allotted time limit by up to 18\\% and 20\\%,\nrespectively. Our framework thus allows for more comprehensive quantum network\nstudies, integrating surrogate-assisted optimization with existing quantum\nnetwork simulators.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Y9XTYsNKOyyk5kM9AI-y1DUbWqnxupH9WZ-g-jY_WW8","pdfSize":"2461684"}
