{"id":"2407.21569","title":"Analysis of Functional Insufficiencies and Triggering Conditions to\n  Improve the SOTIF of an MPC-based Trajectory Planner","authors":"Mirko Conrad, Georg Schildbach","authorsParsed":[["Conrad","Mirko",""],["Schildbach","Georg",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 12:52:13 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 16:43:34 GMT"}],"updateDate":"2024-08-02","timestamp":1722430333000,"abstract":"  Automated and autonomous driving has made a significant technological leap\nover the past decade. In this process, the complexity of algorithms used for\nvehicle control has grown significantly. Model Predictive Control (MPC) is a\nprominent example, which has gained enormous popularity and is now widely used\nfor vehicle motion planning and control. However, safety concerns constrain its\npractical application, especially since traditional procedures of functional\nsafety (FS), with its universal standard ISO26262, reach their limits.\nConcomitantly, the new aspect of safety-of-the-intended-function (SOTIF) has\nmoved into the center of attention, whose standard, ISO21448, has only been\nreleased in 2022. Thus, experience with SOTIF is low and few case studies are\navailable in industry and research. Hence this paper aims to make two main\ncontributions: (1) an analysis of the SOTIF for a generic MPC-based trajectory\nplanner and (2) an interpretation and concrete application of the generic\nprocedures described in ISO21448 for determining functional insufficiencies\n(FIs) and triggering conditions (TCs). Particular novelties of the paper\ninclude an approach for the out-of-context development of SOTIF-related\nelements (SOTIF-EooC), a compilation of important FIs and TCs for a MPC-based\ntrajectory planner, and an optimized safety concept based on the identified FIs\nand TCs for the MPC-based trajectory planner.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Robotics","Computing Research Repository/Software Engineering","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"F3GUhuKcu7HQajkUuKIRpscStM_q9lrP30OXfub1n1w","pdfSize":"2407047"}
