{"id":"2407.14912","title":"PolyR-CNN: R-CNN for end-to-end polygonal building outline extraction","authors":"Weiqin Jiao, Claudio Persello, George Vosselman","authorsParsed":[["Jiao","Weiqin",""],["Persello","Claudio",""],["Vosselman","George",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 15:48:54 GMT"}],"updateDate":"2024-07-23","timestamp":1721490534000,"abstract":"  Polygonal building outline extraction has been a research focus in recent\nyears. Most existing methods have addressed this challenging task by\ndecomposing it into several subtasks and employing carefully designed\narchitectures. Despite their accuracy, such pipelines often introduce\ninefficiencies during training and inference. This paper presents an end-to-end\nframework, denoted as PolyR-CNN, which offers an efficient and fully integrated\napproach to predict vectorized building polygons and bounding boxes directly\nfrom remotely sensed images. Notably, PolyR-CNN leverages solely the features\nof the Region of Interest (RoI) for the prediction, thereby mitigating the\nnecessity for complex designs. Furthermore, we propose a novel scheme with\nPolyR-CNN to extract detailed outline information from polygon vertex\ncoordinates, termed vertex proposal feature, to guide the RoI features to\npredict more regular buildings. PolyR-CNN demonstrates the capacity to deal\nwith buildings with holes through a simple post-processing method on the Inria\ndataset. Comprehensive experiments conducted on the CrowdAI dataset show that\nPolyR-CNN achieves competitive accuracy compared to state-of-the-art methods\nwhile significantly improving computational efficiency, i.e., achieving 79.2\nAverage Precision (AP), exhibiting a 15.9 AP gain and operating 2.5 times\nfaster and four times lighter than the well-established end-to-end method\nPolyWorld. Replacing the backbone with a simple ResNet-50, PolyR-CNN maintains\na 71.1 AP while running four times faster than PolyWorld.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}