{"id":"2407.02574","title":"Percolation Statistics in the MillenniumTNG Simulations","authors":"Eniko Regos, Volker Springel, Sownak Bose, Boryana Hadzhiyska, Cesar\n  Hernandez-Aguayo","authorsParsed":[["Regos","Eniko",""],["Springel","Volker",""],["Bose","Sownak",""],["Hadzhiyska","Boryana",""],["Hernandez-Aguayo","Cesar",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 18:00:32 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 20:02:49 GMT"}],"updateDate":"2024-08-23","timestamp":1719943232000,"abstract":"  The statistical analysis of cosmic large-scale structure is most often based\non simple two-point summary statistics, like the power spectrum or the\ntwo-point correlation function of a sample of galaxies or other types of\ntracers. In contrast, topological measures of clustering are also sensitive to\nhigher-order correlations, and thus offer the prospect to access additional\ninformation that may harbor important constraining power. We here revisit one\nsuch geometric measure of the cosmic web in the form of the so-called\npercolation analysis, using the recent MillenniumTNG simulation suite of the\nLCDM paradigm. We analyze continuum percolation statistics both for high\nresolution dark matter particle distributions, as well as for galaxy mock\ncatalogues from a semi-analytic galaxy formation model within a periodic\nsimulation volume of 3000 Mpc on a side. For comparison, we also investigate\nthe percolation statistics of random particle sets and neutrino distributions\nwith two different summed particle masses. We find that the percolation\nstatistics of the dark matter distribution evolves strongly with redshift and\nthus clustering strength, yielding progressively lower percolation threshold\ntowards later times. However, there is a sizable residual dependence on\nnumerical resolution which we interpret as a residual influence of different\nlevels of shot noise. This is corroborated by our analysis of galaxy mock\ncatalogues whose results depend on sampling density more strongly than on\ngalaxy selection criteria. While this limits the discriminative power of\npercolation statistics, our results suggest that it still remains useful as a\ncomplementary cosmological test when controlled for sampling density.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fQlkWJOqCpnzsQgPHm0zH_QKVzDLbHEOKJHUMBr0YmY","pdfSize":"3706151"}
