{"id":"2407.05477","title":"Solving forward and inverse PDE problems on unknown manifolds via\n  physics-informed neural operators","authors":"Anran Jiao, Qile Yan, Jhn Harlim, Lu Lu","authorsParsed":[["Jiao","Anran",""],["Yan","Qile",""],["Harlim","Jhn",""],["Lu","Lu",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 19:21:44 GMT"}],"updateDate":"2024-07-09","timestamp":1720380104000,"abstract":"  In this paper, we evaluate the effectiveness of deep operator networks\n(DeepONets) in solving both forward and inverse problems of partial\ndifferential equations (PDEs) on unknown manifolds. By unknown manifolds, we\nidentify the manifold by a set of randomly sampled data point clouds that are\nassumed to lie on or close to the manifold. When the loss function incorporates\nthe physics, resulting in the so-called physics-informed DeepONets\n(PI-DeepONets), we approximate the differentiation terms in the PDE by an\nappropriate operator approximation scheme. For the second-order elliptic PDE\nwith a nontrivial diffusion coefficient, we approximate the differentiation\nterm with one of these methods: the Diffusion Maps (DM), the Radial Basis\nFunctions (RBF), and the Generalized Moving Least Squares (GMLS) methods. For\nthe GMLS approximation, which is more flexible for problems with boundary\nconditions, we derive the theoretical error bound induced by the approximate\ndifferentiation. Numerically, we found that DeepONet is accurate for various\ntypes of diffusion coefficients, including linear, exponential, piecewise\nlinear, and quadratic functions, for linear and semi-linear PDEs with/without\nboundaries. When the number of observations is small, PI-DeepONet trained with\nsufficiently large samples of PDE constraints produces more accurate\napproximations than DeepONet. For the inverse problem, we incorporate\nPI-DeepONet in a Bayesian Markov Chain Monte Carlo (MCMC) framework to estimate\nthe diffusion coefficient from noisy solutions of the PDEs measured at a finite\nnumber of point cloud data. Numerically, we found that PI-DeepONet provides\naccurate approximations comparable to those obtained by a more expensive method\nthat directly solves the PDE on the proposed diffusion coefficient in each MCMC\niteration.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}