{"id":"2407.00648","title":"LegalTurk Optimized BERT for Multi-Label Text Classification and NER","authors":"Farnaz Zeidi, Mehmet Fatih Amasyali, \\c{C}i\\u{g}dem Erol","authorsParsed":[["Zeidi","Farnaz",""],["Amasyali","Mehmet Fatih",""],["Erol","Çiğdem",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 10:19:54 GMT"}],"updateDate":"2024-07-02","timestamp":1719742794000,"abstract":"  The introduction of the Transformer neural network, along with techniques\nlike self-supervised pre-training and transfer learning, has paved the way for\nadvanced models like BERT. Despite BERT's impressive performance, opportunities\nfor further enhancement exist. To our knowledge, most efforts are focusing on\nimproving BERT's performance in English and in general domains, with no study\nspecifically addressing the legal Turkish domain. Our study is primarily\ndedicated to enhancing the BERT model within the legal Turkish domain through\nmodifications in the pre-training phase. In this work, we introduce our\ninnovative modified pre-training approach by combining diverse masking\nstrategies. In the fine-tuning task, we focus on two essential downstream tasks\nin the legal domain: name entity recognition and multi-label text\nclassification. To evaluate our modified pre-training approach, we fine-tuned\nall customized models alongside the original BERT models to compare their\nperformance. Our modified approach demonstrated significant improvements in\nboth NER and multi-label text classification tasks compared to the original\nBERT model. Finally, to showcase the impact of our proposed models, we trained\nour best models with different corpus sizes and compared them with BERTurk\nmodels. The experimental results demonstrate that our innovative approach,\ndespite being pre-trained on a smaller corpus, competes with BERTurk.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"SUF9_txqyBZXcpEcCJrfgRqgaGkbTUHoecq8ZblWz3A","pdfSize":"273312","objectId":"0xefc142bcd050aa34463d5d218aa4d9d5eb4106daf9ff60378be8f744acb5c0d4","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
