{"id":"2407.06948","title":"Detection-Triggered Recursive Impact Mitigation against Secondary False\n  Data Injection Attacks in Microgrids","authors":"Mengxiang Liu, Xin Zhang, Rui Zhang, Zhuoran Zhou, Zhenyong Zhang, and\n  Ruilong Deng","authorsParsed":[["Liu","Mengxiang",""],["Zhang","Xin",""],["Zhang","Rui",""],["Zhou","Zhuoran",""],["Zhang","Zhenyong",""],["Deng","Ruilong",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 15:29:16 GMT"}],"updateDate":"2024-07-10","timestamp":1720538956000,"abstract":"  The cybersecurity of microgrid has received widespread attentions due to the\nfrequently reported attack accidents against distributed energy resource (DER)\nmanufactures. Numerous impact mitigation schemes have been proposed to reduce\nor eliminate the impacts of false data injection attacks (FDIAs). Nevertheless,\nthe existing methods either requires at least one neighboring trustworthy agent\nor may bring in unacceptable cost burdens. This paper aims to propose a\ndetection-triggered recursive impact mitigation scheme that can timely and\nprecisely counter the secondary FDIAs (SFDIAs) against the communication links\namong DERs. Once triggering attack alarms, the power line current readings will\nbe utilised to observe the voltage bias injections through the physical\ninterconnections among DERs, based on which the current bias injections can be\nrecursively reconstructed from the residuals generated by unknown input\nobservers (UIOs). The attack impacts are eliminated by subtracting the\nreconstructed bias from the incoming compromised data. The proposed mitigation\nmethod can work even in the worst case where all communication links are under\nSFDIAs and only require extra current sensors. The bias reconstruction\nperformance under initial errors and system noises is theoretically analysed\nand the reconstruction error is proved to be bounded regardless of the\nelectrical parameters. To avoid deploying current sensors on all power lines, a\ncost-effective deployment strategy is presented to secure a spanning tree set\nof communication links that can guarantee the secondary control performance.\nExtensive validation studies are conducted in MATLAB/SIMULINK and\nhardware-in-the-loop (HIL) testbeds to validate the proposed method's\neffectiveness against single/multiple and continuous/discontinuous SFDIAs.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}