{"id":"2407.01063","title":"Direct observational evidence of multi-epoch massive star formation in\n  G24.47+0.49","authors":"Anindya Saha, Anandmayee Tej, Hong-Li Liu, Tie Liu, Guido Garay, Paul\n  F. Goldsmith, Chang Won Lee, Jinhua He, Mika Juvela, Leonardo Bronfman, Tapas\n  Baug, Enrique Vazquez-Semadeni, Patricio Sanhueza, Shanghuo Li, James O.\n  Chibueze, N. K. Bhadari, Lokesh K. Dewangan, Swagat Ranjan Das, Feng-Wei Xu,\n  Namitha Issac, Jihye Hwang, and L. Viktor Toth","authorsParsed":[["Saha","Anindya",""],["Tej","Anandmayee",""],["Liu","Hong-Li",""],["Liu","Tie",""],["Garay","Guido",""],["Goldsmith","Paul F.",""],["Lee","Chang Won",""],["He","Jinhua",""],["Juvela","Mika",""],["Bronfman","Leonardo",""],["Baug","Tapas",""],["Vazquez-Semadeni","Enrique",""],["Sanhueza","Patricio",""],["Li","Shanghuo",""],["Chibueze","James O.",""],["Bhadari","N. K.",""],["Dewangan","Lokesh K.",""],["Das","Swagat Ranjan",""],["Xu","Feng-Wei",""],["Issac","Namitha",""],["Hwang","Jihye",""],["Toth","L. Viktor",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:12:31 GMT"}],"updateDate":"2024-07-02","timestamp":1719821551000,"abstract":"  Using new continuum and molecular line data from the ALMA Three-millimeter\nObservations of Massive Star-forming Regions (ATOMS) survey and archival VLA,\n4.86 GHz data, we present direct observational evidence of hierarchical\ntriggering relating three epochs of massive star formation in a ring-like H II\nregion, G24.47+0.49. We find from radio flux analysis that it is excited by a\nmassive star(s) of spectral type O8.5V-O8V from the first epoch of star\nformation. The swept-up ionized ring structure shows evidence of secondary\ncollapse, and within this ring a burst of massive star formation is observed in\ndifferent evolutionary phases, which constitutes the second epoch. ATOMS\nspectral line (e.g., HCO$^+$(1-0)) observations reveal an outer concentric\nmolecular gas ring expanding at a velocity of $\\sim$ 9 $\\rm km\\,s^{-1}$,\nconstituting the direct and unambiguous detection of an expanding molecular\nring. It harbors twelve dense molecular cores with surface mass density greater\nthan 0.05 $\\rm g\\,cm^{-2}$, a threshold typical of massive star formation. Half\nof them are found to be subvirial, and thus in gravitational collapse, making\nthem third epoch of potential massive star-forming sites.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}