{"id":"2407.09642","title":"Seq-to-Final: A Benchmark for Tuning from Sequential Distributions to a\n  Final Time Point","authors":"Christina X Ji, Ahmed M Alaa, David Sontag","authorsParsed":[["Ji","Christina X",""],["Alaa","Ahmed M",""],["Sontag","David",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 19:03:42 GMT"}],"updateDate":"2024-07-16","timestamp":1720811022000,"abstract":"  Distribution shift over time occurs in many settings. Leveraging historical\ndata is necessary to learn a model for the last time point when limited data is\navailable in the final period, yet few methods have been developed specifically\nfor this purpose. In this work, we construct a benchmark with different\nsequences of synthetic shifts to evaluate the effectiveness of 3 classes of\nmethods that 1) learn from all data without adapting to the final period, 2)\nlearn from historical data with no regard to the sequential nature and then\nadapt to the final period, and 3) leverage the sequential nature of historical\ndata when tailoring a model to the final period. We call this benchmark\nSeq-to-Final to highlight the focus on using a sequence of time periods to\nlearn a model for the final time point. Our synthetic benchmark allows users to\nconstruct sequences with different types of shift and compare different\nmethods. We focus on image classification tasks using CIFAR-10 and CIFAR-100 as\nthe base images for the synthetic sequences. We also evaluate the same methods\non the Portraits dataset to explore the relevance to real-world shifts over\ntime. Finally, we create a visualization to contrast the initializations and\nupdates from different methods at the final time step. Our results suggest\nthat, for the sequences in our benchmark, methods that disregard the sequential\nstructure and adapt to the final time point tend to perform well. The\napproaches we evaluate that leverage the sequential nature do not offer any\nimprovement. We hope that this benchmark will inspire the development of new\nalgorithms that are better at leveraging sequential historical data or a deeper\nunderstanding of why methods that disregard the sequential nature are able to\nperform well.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ac0Opq1Xl743sX0hzD_l5kyjBdB4X0Yk-5O9wfEjlkE","pdfSize":"2048918","objectId":"0xf0852975269bd6f462d25f7a599589aa292a80080c2c241719869dbec109c989","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
