{"id":"2407.19851","title":"Evolution of cooperation in the public goods game with Q-learning","authors":"Guozhong Zheng, Jiqiang Zhang, Shengfeng Deng, Weiran Cai, Li Chen","authorsParsed":[["Zheng","Guozhong",""],["Zhang","Jiqiang",""],["Deng","Shengfeng",""],["Cai","Weiran",""],["Chen","Li",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 10:09:07 GMT"}],"updateDate":"2024-07-30","timestamp":1722247747000,"abstract":"  Recent paradigm shifts from imitation learning to reinforcement learning (RL)\nis shown to be productive in understanding human behaviors. In the RL paradigm,\nindividuals search for optimal strategies through interaction with the\nenvironment to make decisions. This implies that gathering, processing, and\nutilizing information from their surroundings are crucial. However, existing\nstudies typically study pairwise games such as the prisoners' dilemma and\nemploy a self-regarding setup, where individuals play against one opponent\nbased solely on their own strategies, neglecting the environmental information.\nIn this work, we investigate the evolution of cooperation with the multiplayer\ngame -- the public goods game using the Q-learning algorithm by leveraging the\nenvironmental information. Specifically, the decision-making of players is\nbased upon the cooperation information in their neighborhood. Our results show\nthat cooperation is more likely to emerge compared to the case of imitation\nlearning by using Fermi rule. Of particular interest is the observation of an\nanomalous non-monotonic dependence which is revealed when voluntary\nparticipation is further introduced. The analysis of the Q-table explains the\nmechanisms behind the cooperation evolution. Our findings indicate the\nfundamental role of environment information in the RL paradigm to understand\nthe evolution of cooperation, and human behaviors in general.\n","subjects":["Quantitative Biology/Populations and Evolution","Condensed Matter/Statistical Mechanics","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://creativecommons.org/licenses/by/4.0/"}