{"id":"2407.18139","title":"Lagrangian flow networks for passive dispersal: tracers versus finite\n  size particles","authors":"Deocl\\'ecio Valente, Ksenia Guseva, Ulrike Feudel","authorsParsed":[["Valente","Deoclécio",""],["Guseva","Ksenia",""],["Feudel","Ulrike",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 15:43:50 GMT"}],"updateDate":"2024-07-26","timestamp":1721922230000,"abstract":"  The transport and distribution of organisms like larvae, seeds or litter in\nthe ocean as well as particles in industrial flows is often approximated by a\ntransport of tracer particles. We present a theoretical investigation to check\nthe accuracy of this approximation by studying the transport of inertial\nparticles between different islands embedded in an open hydrodynamic flow\naiming at the construction of a Lagrangian flow network reflecting the\nconnectivity between the islands. To this end we formulate a two-dimensional\nkinematic flow field which allows the placement of an arbitrary number of\nislands at arbitrary locations in a flow of prescribed direction. To account\nfor the mixing in the flow we include a von K\\'arm\\'an vortex street in the\nwake of each island. We demonstrate that the transport probabilities of\ninertial particles making up the links of the Lagrangian flow network depend\nessentially on the properties of the particles, i.e. their Stokes number, the\nproperties of the flow and the geometry of the setup of the islands. We find a\nstrong segregation between aerosols and bubbles. Upon comparing the mobility of\ninertial particles to that of tracers or neutrally buoyant particles, it\nbecomes apparent that the tracer approximation may not always accurately\npredict the probability of movement. This can lead to inconsistent forecasts\nregarding the fate of marine organisms, seeds, litter or particles in\nindustrial flows.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"2ikSCliv9NErJcUOJ8BkCYNfc0k7FA-bOJxmJUwaYMw","pdfSize":"5342202"}
