{"id":"2407.15843","title":"CarFormer: Self-Driving with Learned Object-Centric Representations","authors":"Shadi Hamdan and Fatma G\\\"uney","authorsParsed":[["Hamdan","Shadi",""],["Güney","Fatma",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 17:59:01 GMT"}],"updateDate":"2024-07-23","timestamp":1721671141000,"abstract":"  The choice of representation plays a key role in self-driving. Bird's eye\nview (BEV) representations have shown remarkable performance in recent years.\nIn this paper, we propose to learn object-centric representations in BEV to\ndistill a complex scene into more actionable information for self-driving. We\nfirst learn to place objects into slots with a slot attention model on BEV\nsequences. Based on these object-centric representations, we then train a\ntransformer to learn to drive as well as reason about the future of other\nvehicles. We found that object-centric slot representations outperform both\nscene-level and object-level approaches that use the exact attributes of\nobjects. Slot representations naturally incorporate information about objects\nfrom their spatial and temporal context such as position, heading, and speed\nwithout explicitly providing it. Our model with slots achieves an increased\ncompletion rate of the provided routes and, consequently, a higher driving\nscore, with a lower variance across multiple runs, affirming slots as a\nreliable alternative in object-centric approaches. Additionally, we validate\nour model's performance as a world model through forecasting experiments,\ndemonstrating its capability to predict future slot representations accurately.\nThe code and the pre-trained models can be found at\nhttps://kuis-ai.github.io/CarFormer/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"K7DpBT5ZrElDewlVKL4jScjScqzm3jTNsDlD-zEsaJo","pdfSize":"2976462"}
