{"id":"2407.05562","title":"Focus on the Whole Character: Discriminative Character Modeling for\n  Scene Text Recognition","authors":"Bangbang Zhou, Yadong Qu, Zixiao Wang, Zicheng Li, Boqiang Zhang,\n  Hongtao Xie","authorsParsed":[["Zhou","Bangbang",""],["Qu","Yadong",""],["Wang","Zixiao",""],["Li","Zicheng",""],["Zhang","Boqiang",""],["Xie","Hongtao",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 02:33:29 GMT"}],"updateDate":"2024-07-09","timestamp":1720406009000,"abstract":"  Recently, scene text recognition (STR) models have shown significant\nperformance improvements. However, existing models still encounter difficulties\nin recognizing challenging texts that involve factors such as severely\ndistorted and perspective characters. These challenging texts mainly cause two\nproblems: (1) Large Intra-Class Variance. (2) Small Inter-Class Variance. An\nextremely distorted character may prominently differ visually from other\ncharacters within the same category, while the variance between characters from\ndifferent classes is relatively small. To address the above issues, we propose\na novel method that enriches the character features to enhance the\ndiscriminability of characters. Firstly, we propose the Character-Aware\nConstraint Encoder (CACE) with multiple blocks stacked. CACE introduces a decay\nmatrix in each block to explicitly guide the attention region for each token.\nBy continuously employing the decay matrix, CACE enables tokens to perceive\nmorphological information at the character level. Secondly, an Intra-Inter\nConsistency Loss (I^2CL) is introduced to consider intra-class compactness and\ninter-class separability at feature space. I^2CL improves the discriminative\ncapability of features by learning a long-term memory unit for each character\ncategory. Trained with synthetic data, our model achieves state-of-the-art\nperformance on common benchmarks (94.1% accuracy) and Union14M-Benchmark (61.6%\naccuracy). Code is available at https://github.com/bang123-box/CFE.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}