{"id":"2407.19858","title":"AI-Powered Energy Algorithmic Trading: Integrating Hidden Markov Models\n  with Neural Networks","authors":"Tiago Monteiro","authorsParsed":[["Monteiro","Tiago",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 10:26:52 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 12:42:38 GMT"},{"version":"v3","created":"Sat, 10 Aug 2024 20:45:35 GMT"},{"version":"v4","created":"Tue, 13 Aug 2024 21:52:52 GMT"},{"version":"v5","created":"Sun, 25 Aug 2024 13:01:32 GMT"}],"updateDate":"2024-08-27","timestamp":1722248812000,"abstract":"  In quantitative finance, machine learning methods are essential for alpha\ngeneration. This study introduces a new approach that combines Hidden Markov\nModels (HMM) and neural networks, integrated with Black-Litterman portfolio\noptimization. During the COVID period (2019-2022), this dual-model approach\nachieved a 83% return with a Sharpe ratio of 0.77. It incorporates two risk\nmodels to enhance risk management, showing efficiency during volatile periods.\nThe methodology was implemented on the QuantConnect platform, which was chosen\nfor its robust framework and experimental reproducibility. The system, which\npredicts future price movements, includes a three-year warm-up to ensure proper\nalgorithm function. It targets highly liquid, large-cap energy stocks to ensure\nstable and predictable performance while also considering broker payments. The\ndual-model alpha system utilizes log returns to select the optimal state based\non the historical performance. It combines state predictions with neural\nnetwork outputs, which are based on historical data, to generate trading\nsignals. This study examined the architecture of the trading system, data\npre-processing, training, and performance. The full code and backtesting data\nare available under the QuantConnect terms.\n","subjects":["Quantitative Finance/Portfolio Management","Computing Research Repository/Machine Learning","Quantitative Finance/General Finance","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Vlv9TAdql3JzzKrkQimfBYAjSJZlbLtcvbEVfB4Wc-E","pdfSize":"446733"}
