{"id":"2407.02413","title":"First-principles investigation of multifaceted properties; lattice\n  dynamic, structural stability, mechanical, electronic, magnetic and\n  thermodynamic response of Alkali metals-based semi Heusler alloys","authors":"Diwaker, Shyam L. Gupta, Anupam, Sumit Kumar, Aadil Fayaz and Ashwani\n  Kumar","authorsParsed":[["Diwaker","",""],["Gupta","Shyam L.",""],["Anupam","",""],["Kumar","Sumit",""],["Fayaz","Aadil",""],["Kumar","Ashwani",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 16:36:48 GMT"}],"updateDate":"2024-07-03","timestamp":1719938208000,"abstract":"  Taking into considerations the wide compositional stretch of Heusler alloys,\nthe first principles density functional theory based calculations are\nexcellently suitable for estimating the multifaceted properties of alkali metal\nbased LiVSb and NaVSb Heusler alloys. We calculated ground state stability by\noptimizing the energy in alpha, beta and gamma phase configurations. The\nmaterials are dynamically stable in spin polarised phase type alpha. To explore\nthe electronic structure, we successfully employed the generalized gradient\napproximation potential. The electronic band structures indicate a\nhalf-metallic nature featuring a wide indirect band gap of 1.40eV and 1.45eV.\nWe computed the second-order elastic parameters at different pressure levels.\nThe Pugh ratio less than 0.25 assessed that both alloys are brittle in nature\nand mechanically stable. The obtained magnetic moment is consistent with the\nSlater-Pauling rule. By executing the Quasi-Harmonic Debye model and Boltzmann\ntheory we assessed the various thermodynamic parameters and transport\ncoefficients of both alloys at different temperatures and pressures. All\npositive frequencies in lattice dynamic study confirmed their stability. Our\nfindings highlight the potential of these alloys in modern semiconductor\ntechnology, and thermoelectric applications.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}