{"id":"2407.08054","title":"SOFIA/FORCAST Galactic Center Source Catalog","authors":"Angela S. Cotera, Matthew J. Hankins, John Bally, Ashley T. Barnes,\n  Cara D. Battersby, H Perry Hatchfield, Terry L. Herter, Ryan M. Lau, Steven\n  N. Longmore, Elisabeth A. C. Mills, Mark R. Morris, James T. Radomski, Janet\n  P. Simpson, Zachary Stephens, Daniel L. Walker","authorsParsed":[["Cotera","Angela S.",""],["Hankins","Matthew J.",""],["Bally","John",""],["Barnes","Ashley T.",""],["Battersby","Cara D.",""],["Hatchfield","H Perry",""],["Herter","Terry L.",""],["Lau","Ryan M.",""],["Longmore","Steven N.",""],["Mills","Elisabeth A. C.",""],["Morris","Mark R.",""],["Radomski","James T.",""],["Simpson","Janet P.",""],["Stephens","Zachary",""],["Walker","Daniel L.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 21:24:23 GMT"}],"updateDate":"2024-07-12","timestamp":1720646663000,"abstract":"  The central regions of the Milky Way constitute a unique laboratory for a\nwide swath of astrophysical studies, consequently the inner $\\sim$400 pc has\nbeen the target of numerous large surveys at all accessible wavelengths. In\nthis paper we present a catalog of sources at 25 and 37 $\\mu$m located within\nall of the regions observed with the SOFIA/FORCAST instrument in the inner\n$\\sim$200 pc of the Galaxy. The majority of the observations were obtained as\npart of the SOFIA Cycle 7 Galactic Center Legacy program survey, which was\ndesigned to complement the Spitzer/MIPS 24 $\\mu$m catalog in regions saturated\nin the MIPS observations. Due to the wide variety of source types captured by\nour observations at 25 and 37 $\\mu$m, we do not limit the FORCAST source\ncatalog to unresolved point sources, or treat all sources as if they are\npoint-like sources. The catalog includes all detectable sources in the regions,\nresulting in a catalog of 950 sources, including point sources, compact\nsources, and extended sources. We also provide the user with metrics to\ndiscriminate between the source types.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GrISNaQkSTdwqEST7zhPBX5WUZoI1YkYQmLWRl0ZaOM","pdfSize":"12119524"}
