{"id":"2407.17819","title":"Simulating open-system molecular dynamics on analog quantum computers","authors":"V. C. Olaya-Agudelo, B. Stewart, C. H. Valahu, R. J. MacDonell, M. J.\n  Millican, V. G. Matsos, F. Scuccimarra, T. R. Tan, and I. Kassal","authorsParsed":[["Olaya-Agudelo","V. C.",""],["Stewart","B.",""],["Valahu","C. H.",""],["MacDonell","R. J.",""],["Millican","M. J.",""],["Matsos","V. G.",""],["Scuccimarra","F.",""],["Tan","T. R.",""],["Kassal","I.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 07:15:33 GMT"}],"updateDate":"2024-07-26","timestamp":1721891733000,"abstract":"  Interactions of molecules with their environment influence the course and\noutcome of almost all chemical reactions. However, classical computers struggle\nto accurately simulate complicated molecule-environment interactions because of\nthe steep growth of computational resources with both molecule size and\nenvironment complexity. Therefore, many quantum-chemical simulations are\nrestricted to isolated molecules, whose dynamics can dramatically differ from\nwhat happens in an environment. Here, we show that analog quantum simulators\ncan simulate open molecular systems by using the native dissipation of the\nsimulator and injecting additional controllable dissipation. By exploiting the\nnative dissipation to simulate the molecular dissipation -- rather than seeing\nit as a limitation -- our approach enables longer simulations of open systems\nthan are possible for closed systems. In particular, we show that trapped-ion\nsimulators using a mixed qudit-boson (MQB) encoding could simulate molecules in\na wide range of condensed phases by implementing widely used dissipative\nprocesses within the Lindblad formalism, including pure dephasing and both\nelectronic and vibrational relaxation. The MQB open-system simulations require\nsignificantly fewer additional quantum resources compared to both classical and\ndigital quantum approaches.\n","subjects":["Physics/Quantum Physics","Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}