{"id":"2407.21510","title":"PEAR: Phrase-Based Hand-Object Interaction Anticipation","authors":"Zichen Zhang and Hongchen Luo and Wei Zhai and Yang Cao and Yu Kang","authorsParsed":[["Zhang","Zichen",""],["Luo","Hongchen",""],["Zhai","Wei",""],["Cao","Yang",""],["Kang","Yu",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 10:28:49 GMT"}],"updateDate":"2024-08-01","timestamp":1722421729000,"abstract":"  First-person hand-object interaction anticipation aims to predict the\ninteraction process over a forthcoming period based on current scenes and\nprompts. This capability is crucial for embodied intelligence and human-robot\ncollaboration. The complete interaction process involves both pre-contact\ninteraction intention (i.e., hand motion trends and interaction hotspots) and\npost-contact interaction manipulation (i.e., manipulation trajectories and hand\nposes with contact). Existing research typically anticipates only interaction\nintention while neglecting manipulation, resulting in incomplete predictions\nand an increased likelihood of intention errors due to the lack of manipulation\nconstraints. To address this, we propose a novel model, PEAR (Phrase-Based\nHand-Object Interaction Anticipation), which jointly anticipates interaction\nintention and manipulation. To handle uncertainties in the interaction process,\nwe employ a twofold approach. Firstly, we perform cross-alignment of verbs,\nnouns, and images to reduce the diversity of hand movement patterns and object\nfunctional attributes, thereby mitigating intention uncertainty. Secondly, we\nestablish bidirectional constraints between intention and manipulation using\ndynamic integration and residual connections, ensuring consistency among\nelements and thus overcoming manipulation uncertainty. To rigorously evaluate\nthe performance of the proposed model, we collect a new task-relevant dataset,\nEGO-HOIP, with comprehensive annotations. Extensive experimental results\ndemonstrate the superiority of our method.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}