{"id":"2407.11418","title":"LOTUS: Enabling Semantic Queries with LLMs Over Tables of Unstructured\n  and Structured Data","authors":"Liana Patel, Siddharth Jha, Carlos Guestrin, Matei Zaharia","authorsParsed":[["Patel","Liana",""],["Jha","Siddharth",""],["Guestrin","Carlos",""],["Zaharia","Matei",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 06:19:14 GMT"}],"updateDate":"2024-07-17","timestamp":1721110754000,"abstract":"  The semantic capabilities of language models (LMs) have the potential to\nenable rich analytics and reasoning over vast knowledge corpora. Unfortunately,\nexisting systems lack high-level abstractions to perform semantic queries at\nscale. We introduce semantic operators, a declarative programming interface\nthat extends the relational model with composable AI-based operations for\nsemantic queries over datasets (e.g., sorting or aggregating records using\nnatural language criteria). Each operator can be implemented and optimized in\nmultiple ways, opening a rich space for execution plans similar to relational\noperators. We implement our operators and several optimizations for them in\nLOTUS, an open-source query engine with a Pandas-like API.\n  We demonstrate LOTUS' effectiveness across a series of real applications,\nincluding fact-checking, extreme multi-label classification, and search. We\nfind that LOTUS' programming model is highly expressive, capturing\nstate-of-the-art query pipelines with low development overhead. Specifically,\non the FEVER dataset, LOTUS' programs can reproduce FacTool, a recent\nstate-of-the-art fact-checking pipeline, in few lines of code, and implement a\nnew pipeline that improves accuracy by $9.5\\%$, while offering $7-34\\times$\nlower execution time. In the extreme multi-label classification task on the\nBioDEX dataset, LOTUS reproduces state-of-the art result quality with its join\noperator, while providing an efficient algorithm that runs $800\\times$ faster\nthan a naive join. In the search and ranking application, LOTUS allows a simple\ncomposition of operators to achieve $5.9 - 49.4\\%$ higher nDCG@10 than the\nvanilla retriever and re-ranker, while also providing query efficiency, with\n$1.67 - 10\\times$ lower execution time than LM-based ranking methods used by\nprior works. LOTUS is publicly available at\nhttps://github.com/stanford-futuredata/lotus.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}