{"id":"2407.16846","title":"Non-linear stability analysis of slip in a single-degree-of-freedom\n  elastic system with frictional evolution laws spanning aging to slip","authors":"Federico Ciardo and Robert C. Viesca","authorsParsed":[["Ciardo","Federico",""],["Viesca","Robert C.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 21:15:51 GMT"}],"updateDate":"2024-07-25","timestamp":1721769351000,"abstract":"  We present a non-linear stability analysis of quasi-static slip in a\nspring-block model. The sliding interface is governed by rate- and\nstate-dependent friction, with an intermediate state evolution law that spans\nbetween aging and slip laws using a dimensionless parameter \\epsilon. Our\nresults extend and generalize previous findings of Gu et al. (1984) and Ranjith\nand Rice (1999) that considered slip and aging laws, respectively. We examine\nthe robustness of these prior results to changes in the evolution law,\nincluding the finding of unconditional stability of the aging law for spring\nstiffnesses above a critical value. Our analysis provides analytical\ntrajectories of slip motion in a phase plane as function of dimensionless\ngoverning parameters. We investigate two scenarios: a spring-block model with\nstationary and non-stationary point loading rate. When the loading point is\nstationary, we find that deviations from the aging law lead to only conditional\nstability of the slider for spring stiffnesses above a critical value: finite\nperturbations can trigger instability, consistent with prior results for the\nslip law. We quantify these critical perturbations as a function of the\ngoverning parameters. We find that, for a given supercritical stiffness, the\nsize of the perturbation required to induce instability grows as the state\nevolution law approaches the aging law. In contrast, when the point loading\nrate is stationary, our results suggest that there exists a maximum critical\nstiffness above which an instability can never develop, for any perturbation\nsize. This critical stiffness is \\epsilon-dependent and vanishes as the slip\nlaw is approached: conditional stability is then expected in the slip law\nlimit. Finally, we derive relations for an effective spring stiffness as a\nfunction of the elastic moduli and a characteristic fault dimension or a\ncharacteristic perturbation wavelength.\n","subjects":["Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"I9-tgeTLE0wQ9Juw9ooK9Xw0TfrxpdiCAjD7nhtZIb0","pdfSize":"11536314"}
