{"id":"2407.21386","title":"The Bulk Densities of Small Solar System Bodies as a Probe of\n  Planetesimal Formation","authors":"Misako Tatsuuma, Akimasa Kataoka, Hidekazu Tanaka, Tristan Guillot","authorsParsed":[["Tatsuuma","Misako",""],["Kataoka","Akimasa",""],["Tanaka","Hidekazu",""],["Guillot","Tristan",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 07:20:42 GMT"}],"updateDate":"2024-08-01","timestamp":1722410442000,"abstract":"  Constraining the formation processes of small solar system bodies is crucial\nfor gaining insights into planetesimal formation. Their bulk densities,\ndetermined by their compressive strengths, offer valuable information about\ntheir formation history. In this paper, we utilize a formulation of the\ncompressive strength of dust aggregates obtained from dust $N$-body simulations\nto establish the relation between bulk density and diameter. We find that this\nrelation can be effectively approximated by a polytrope with an index of 0.5,\ncoupled with a formulation of the compressive strength of dust aggregates. The\nlowest-density trans-Neptunian objects (TNOs) and main-belt asteroids (MBAs)\nare well reproduced by dust aggregates composed of 0.1-$\\mathrm{\\mu}$m-sized\ngrains. However, most TNOs, MBAs, comets, and near-Earth asteroids (NEAs)\nexhibit higher densities, suggesting the influence of compaction mechanisms\nsuch as collision, dust grain disruption, sintering, or melting, leading to\nfurther growth. We speculate that there are two potential formation paths for\nsmall solar system bodies: one involves the direct coagulation of primordial\ndust grains, resulting in the formation of first-generation planetesimals,\nincluding the lowest-density TNOs, MBAs, and parent bodies of comets and NEAs.\nIn this case, comets and NEAs are fragments or rubble piles of first-generation\nplanetesimals, and objects themselves or rubbles are composed of\n0.1-$\\mathrm{\\mu}$m-sized grains. The other path involves further potential\nfragmentation of first-generation planetesimals into compact dust aggregates\nobserved in protoplanetary disks, resulting in the formation of\nsecond-generation planetesimals composed of compact dust aggregates, which may\ncontribute to explaining another formation process of comets and NEAs.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}