{"id":"2407.06292","title":"Hybrid X-Linker: Automated Data Generation and Extreme Multi-label\n  Ranking for Biomedical Entity Linking","authors":"Pedro Ruas, Fernando Gallego, Francisco J. Veredas, Francisco M. Couto","authorsParsed":[["Ruas","Pedro",""],["Gallego","Fernando",""],["Veredas","Francisco J.",""],["Couto","Francisco M.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:04:22 GMT"}],"updateDate":"2024-07-10","timestamp":1720461862000,"abstract":"  State-of-the-art deep learning entity linking methods rely on extensive\nhuman-labelled data, which is costly to acquire. Current datasets are limited\nin size, leading to inadequate coverage of biomedical concepts and diminished\nperformance when applied to new data. In this work, we propose to automatically\ngenerate data to create large-scale training datasets, which allows the\nexploration of approaches originally developed for the task of extreme\nmulti-label ranking in the biomedical entity linking task. We propose the\nhybrid X-Linker pipeline that includes different modules to link disease and\nchemical entity mentions to concepts in the MEDIC and the CTD-Chemical\nvocabularies, respectively. X-Linker was evaluated on several biomedical\ndatasets: BC5CDR-Disease, BioRED-Disease, NCBI-Disease, BC5CDR-Chemical,\nBioRED-Chemical, and NLM-Chem, achieving top-1 accuracies of 0.8307, 0.7969,\n0.8271, 0.9511, 0.9248, and 0.7895, respectively. X-Linker demonstrated\nsuperior performance in three datasets: BC5CDR-Disease, NCBI-Disease, and\nBioRED-Chemical. In contrast, SapBERT outperformed X-Linker in the remaining\nthree datasets. Both models rely only on the mention string for their\noperations. The source code of X-Linker and its associated data are publicly\navailable for performing biomedical entity linking without requiring\npre-labelled entities with identifiers from specific knowledge organization\nsystems.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Digital Libraries"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}