{"id":"2407.13024","title":"Length-preserving biconnection gravity and its cosmological implications","authors":"Lehel Csillag, Rattanasak Hama, Mate Jozsa, Tiberiu Harko, Sorin V.\n  Sabau","authorsParsed":[["Csillag","Lehel",""],["Hama","Rattanasak",""],["Jozsa","Mate",""],["Harko","Tiberiu",""],["Sabau","Sorin V.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 21:26:43 GMT"}],"updateDate":"2024-07-19","timestamp":1721251603000,"abstract":"  We consider a biconnection theory that extends general relativity, using the\nrecently defined mutual curvature as the fundamental object describing gravity.\nTo specify the two connections considered, we make a short detour into\ninformation geometry, where a connection and its dual play a natural role. We\nprove that the dual of a non-metric Schr\\\"odinger connection possesses torsion,\neven if the Schr\\\"odinger connection itself does not. Furthermore, a manifold\nwith the dual of a Schr\\\"odinger connection is a quasi-statistical manifold.\nWith these two connections, we develop length-preserving biconnection gravity.\nThe field equations resemble those of general relativity, but replace the Ricci\ntensor- and scalar with the mutual curvature tensor and mutual curvature\nscalar, resulting in additional torsion-dependent terms. The covariant\ndivergence of the matter energy-momentum does not vanish in this theory. We\nderive the equation of motion for massive particles, which shows the presence\nof an extra force, depending on the torsion vector. The Newtonian limit of the\nequations of motion is also considered. We explore the cosmological\nimplications by deriving the generalized Friedmann equations for the FLRW\ngeometry. They contain additional terms that can be interpreted as describing\nan effective, geometric type dark energy. We examine two cosmological models:\none with conserved matter and one where dark energy and pressure follow a\nlinear equation of state. The predictions of both models are compared with\nobservational Hubble function values and the standard $\\Lambda$CDM model.\nLength-preserving biconnection gravity models fit well observational data and\nalign with $\\Lambda$CDM at low redshifts $(z<3)$. They suggest that a modified\ngeometry could explain dark energy, late-time acceleration, and the formation\nof supermassive black holes, as they predict different age of our Universe.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}