{"id":"2407.12187","title":"L2AI: lightweight three-factor authentication and authorization in IOMT\n  blockchain-based environment","authors":"Laleh Khajehzadeh, Hamid Barati, Ali Barati","authorsParsed":[["Khajehzadeh","Laleh",""],["Barati","Hamid",""],["Barati","Ali",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 21:33:46 GMT"}],"updateDate":"2024-07-18","timestamp":1721165626000,"abstract":"  Medical Internet of Things (IoMT) is the next frontier in the digital\nrevolution and is utilized in healthcare. In this context, IoT enables\nindividuals to remotely manage their essential activities with minimal\ninteraction. However, the limitations of network resources and the challenges\nof establishing a secure channel, as well as sharing and collecting sensitive\ninformation through an insecure public channel, pose security challenges for\nthe medical IoT. This paper presents a lightweight multi-factor authentication\nand anonymous user authentication scheme to access real-time data in a\nblockchain-based environment. The scheme utilizes an insecure channel called\nL2AI. L2AI ensures security and efficiency while enhancing user anonymity\nthrough the use of pseudo-identity and dynamic indexing. The proposed method\nsupports highly scalable systems with an efficient user registration process,\nallowing authenticated users to access both existing and newly added system\nentities without additional processes. Although the scheme is primarily\ndesigned for large systems, such as health infrastructure, it is also suitable\nfor resource-constrained devices. The scheme relies on one-way cryptographic\nhashing functions and bitwise XOR operations. Additionally, a fuzzy mining\nalgorithm is employed on the user side to verify the user's biometric\ninformation. L2AI adopts the \"Real-Or-Random (ROR)\" model for security proof\nand employs BAN logic for proof of authenticity. Formal security verification\nis conducted using the \"Automatic Validation of Internet Security Protocols and\nPrograms\" (Proverif) tool, complemented by informal security analysis\ndemonstrating the proper functionality of L2AI.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"K_85Z1dyvFCXm4BwZZBMbFDt9X6HDZR5zSfKDwmBDvU","pdfSize":"1153394"}
