{"id":"2407.05799","title":"Fabrication of n+ contact on p-type high pure Ge by cathodic\n  electrodeposition of Li and impedance analysis of n+/p diode at low\n  temperatures","authors":"Manoranjan Ghosh, Pravahan Salunke, Shreyas Pitale, S. G. Singh, G. D.\n  Patra, and Shashwati Sen","authorsParsed":[["Ghosh","Manoranjan",""],["Salunke","Pravahan",""],["Pitale","Shreyas",""],["Singh","S. G.",""],["Patra","G. D.",""],["Sen","Shashwati",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 10:05:38 GMT"}],"updateDate":"2024-07-09","timestamp":1720433138000,"abstract":"  Fabrication of diode by forming n-type electrical contact on germanium (Ge)\nand its AC impedance analysis is important for radiation detection in the form\nof pulses. In this work lithium (Li) metal has been electro-deposited on p-type\nGe single crystal from molten lithium nitrate at 260{\\deg}C. The depth of Li\ndiffusion in Ge was successfully varied by changing the electroplating time as\ndetermined by sheet resistance (SR) measurement after successive lapping of Ge\nsurface. Li is found to diffuse up to 500 micron inside Ge by heat treatment of\nas deposited Li/Ge at 350{\\deg}C for 1 hour. A stable n-type electrical contact\non Ge with SR ~1 ohm/square and impurity concentration ~3.7x10^15/cm^3 is\ndeveloped by Li incorporation in p-type Ge crystal showing net carrier\nconcentration ~3.4x10^10/cm^3 and SR ~100 Kohm/square. Acceptor concentration\ndetermined from the 1/C^2 vs V plot shows similar temperature dependence as\nfound by Hall measurement. The fabricated n+/p junction exhibit ideal diode\ncharacteristics with gradual increase in cut off voltage at low temperatures.\nUnder forward bias, junction capacitance mainly comprises of diffusion\ncapacitance (~10 micro.F) showing strong frequency dependence and the impedance\nis partly resistive resulting in semicircular Cole-Cole plot. Imaginary\nimpedance spectra reveal that the relaxation time for the diffusion of majority\ncarriers decreases at higher temperatures and increased forward voltages. The\ndiode is purely capacitive under reverse bias showing a line parallel to the\ny-axis in the Cole-Cole plot with frequency independent (100Hz-100MHz)\ndepletion capacitance ~10pF.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}