{"id":"2407.08571","title":"Multi-Group Proportional Representation","authors":"Alex Oesterling, Claudio Mayrink Verdun, Carol Xuan Long, Alex Glynn,\n  Lucas Monteiro Paes, Sajani Vithana, Martina Cardone, Flavio P. Calmon","authorsParsed":[["Oesterling","Alex",""],["Verdun","Claudio Mayrink",""],["Long","Carol Xuan",""],["Glynn","Alex",""],["Paes","Lucas Monteiro",""],["Vithana","Sajani",""],["Cardone","Martina",""],["Calmon","Flavio P.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:59:17 GMT"}],"updateDate":"2024-07-12","timestamp":1720709957000,"abstract":"  Image search and retrieval tasks can perpetuate harmful stereotypes, erase\ncultural identities, and amplify social disparities. Current approaches to\nmitigate these representational harms balance the number of retrieved items\nacross population groups defined by a small number of (often binary)\nattributes. However, most existing methods overlook intersectional groups\ndetermined by combinations of group attributes, such as gender, race, and\nethnicity. We introduce Multi-Group Proportional Representation (MPR), a novel\nmetric that measures representation across intersectional groups. We develop\npractical methods for estimating MPR, provide theoretical guarantees, and\npropose optimization algorithms to ensure MPR in retrieval. We demonstrate that\nexisting methods optimizing for equal and proportional representation metrics\nmay fail to promote MPR. Crucially, our work shows that optimizing MPR yields\nmore proportional representation across multiple intersectional groups\nspecified by a rich function class, often with minimal compromise in retrieval\naccuracy.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval","Computing Research Repository/Information Theory","Computing Research Repository/Machine Learning","Mathematics/Information Theory","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HRFniXgnxlcYe4DT3O3s-SdP98vjgQE7BUHv9qqdccI","pdfSize":"2584944"}
