{"id":"2407.02693","title":"UAV-assisted Distributed Learning for Environmental Monitoring in Rural\n  Environments","authors":"Vukan Ninkovic, Dejan Vukobratovic, Dragisa Miskovic","authorsParsed":[["Ninkovic","Vukan",""],["Vukobratovic","Dejan",""],["Miskovic","Dragisa",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 22:21:03 GMT"}],"updateDate":"2024-07-04","timestamp":1719958863000,"abstract":"  Distributed learning and inference algorithms have become indispensable for\nIoT systems, offering benefits such as workload alleviation, data privacy\npreservation, and reduced latency. This paper introduces an innovative approach\nthat utilizes unmanned aerial vehicles (UAVs) as a coverage extension relay for\nIoT environmental monitoring in rural areas. Our method integrates a split\nlearning (SL) strategy between edge devices, a UAV and a server to enhance\nadaptability and performance of inference mechanisms. By employing UAVs as a\nrelay and by incorporating SL, we address connectivity and resource constraints\nfor applications of learning in IoT in remote settings. Our system model\naccounts for diverse channel conditions to determine the most suitable\ntransmission strategy for optimal system behaviour. Through simulation\nanalysis, the proposed approach demonstrates its robustness and adaptability,\neven excelling under adverse channel conditions. Integrating UAV relaying and\nthe SL paradigm offers significant flexibility to the server, enabling adaptive\nstrategies that consider various trade-offs beyond simply minimizing overall\ninference quality.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IM6QRn8yQLcgcmo3KFnyXJbyu8Rac_YB7pgKoM2XtVQ","pdfSize":"377715","objectId":"0x8bab553f46249447786b5b8b528f5587b220452081df333bd37cb5aa9ce1180a","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
