{"id":"2407.10981","title":"Systematic Literature Review of AI-enabled Spectrum Management in 6G and\n  Future Networks","authors":"Bushra Sabir, Shuiqiao Yang, David Nguyen, Nan Wu, Alsharif Abuadbba,\n  Hajime Suzuki, Shangqi Lai, Wei Ni, Ding Ming, Surya Nepal","authorsParsed":[["Sabir","Bushra",""],["Yang","Shuiqiao",""],["Nguyen","David",""],["Wu","Nan",""],["Abuadbba","Alsharif",""],["Suzuki","Hajime",""],["Lai","Shangqi",""],["Ni","Wei",""],["Ming","Ding",""],["Nepal","Surya",""]],"versions":[{"version":"v1","created":"Wed, 12 Jun 2024 11:31:42 GMT"}],"updateDate":"2024-07-17","timestamp":1718191902000,"abstract":"  Artificial Intelligence (AI) has advanced significantly in various domains\nlike healthcare, finance, and cybersecurity, with successes such as DeepMind's\nmedical imaging and Tesla's autonomous vehicles. As telecommunications\ntransition from 5G to 6G, integrating AI is crucial for complex demands like\ndata processing, network optimization, and security. Despite ongoing research,\nthere's a gap in consolidating AI-enabled Spectrum Management (AISM)\nadvancements. Traditional spectrum management methods are inadequate for 6G due\nto its dynamic and complex demands, making AI essential for spectrum\noptimization, security, and network efficiency. This study aims to address this\ngap by: (i) Conducting a systematic review of AISM methodologies, focusing on\nlearning models, data handling techniques, and performance metrics. (ii)\nExamining security and privacy concerns related to AI and traditional network\nthreats within AISM contexts. Using the Systematic Literature Review (SLR)\nmethodology, we meticulously analyzed 110 primary studies to: (a) Identify AI's\nutility in spectrum management. (b) Develop a taxonomy of AI approaches. (c)\nClassify datasets and performance metrics used. (d) Detail security and privacy\nthreats and countermeasures. Our findings reveal challenges such as\nunder-explored AI usage in critical AISM systems, computational resource\ndemands, transparency issues, the need for real-world datasets, imbalances in\nsecurity and privacy research, and the absence of testbeds, benchmarks, and\nsecurity analysis tools. Addressing these challenges is vital for maximizing\nAI's potential in advancing 6G technology.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}