{"id":"2407.07343","title":"Electrically Tuning Quasi-Bound States in the Continuum with Hybrid\n  Graphene-Silicon Metasurfaces","authors":"Ziqiang Cai, Xianzhe Zhang, Tushar Sanjay Karnik, Yihao Xu, Tae Yoon\n  Kim, Juejun Hu, Yongmin Liu","authorsParsed":[["Cai","Ziqiang",""],["Zhang","Xianzhe",""],["Karnik","Tushar Sanjay",""],["Xu","Yihao",""],["Kim","Tae Yoon",""],["Hu","Juejun",""],["Liu","Yongmin",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 03:31:05 GMT"}],"updateDate":"2024-07-11","timestamp":1720582265000,"abstract":"  Metasurfaces have become one of the most prominent research topics in the\nfield of optics owing to their unprecedented properties and novel applications\non an ultrathin platform. By combining graphene with metasurfaces, electrical\ntunable functions can be achieved with fast tuning speed, large modulation\ndepth and broad tuning range. However, the tuning efficiency of hybrid graphene\nmetasurfaces within the short-wavelength infrared (SWIR) spectrum is typically\nlow because of the small resonance wavelength shift in this wavelength range.\nIn this work, through the integration of graphene and silicon metasurfaces that\nsupport quasi-bound states in the continuum (quasi-BIC), we experimentally\ndemonstrate significant transmittance tuning even with less than 30 nm\nresonance wavelength shift thanks to the high quality-factor of quasi-BIC\nmetasurfaces. The tunable transmittance spectrum was measured using Fourier\nTransform Infrared Spectroscopy (FTIR) with a modified reflective lens to\nimprove the accuracy, and the electrical tuning was realized utilizing the\ncut-and-stick method of ion gel. At the wavelength of 3.0 um, the measured\nchange of transmittance T_max-T_min and modulation depth (T_max-T_min)/T_max\ncan reach 22.2% and 28.9%, respectively, under a small bias voltage ranging\nfrom -2 V to +2 V. To the best of our knowledge, this work is the first\nexperimental demonstration of tunable graphene/quasi-BIC metasurfaces, which\nhave potential applications in optical modulation, reconfigurable photonic\ndevices, and optical communications.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}