{"id":"2407.04736","title":"SCDM: Unified Representation Learning for EEG-to-fNIRS Cross-Modal\n  Generation in MI-BCIs","authors":"Yisheng Li and Shuqiang Wang","authorsParsed":[["Li","Yisheng",""],["Wang","Shuqiang",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:37:23 GMT"}],"updateDate":"2024-07-09","timestamp":1719841043000,"abstract":"  Hybrid motor imagery brain-computer interfaces (MI-BCIs), which integrate\nboth electroencephalography (EEG) and functional near-infrared spectroscopy\n(fNIRS) signals, outperform those based solely on EEG. However, simultaneously\nrecording EEG and fNIRS signals is highly challenging due to the difficulty of\ncolocating both types of sensors on the same scalp surface. This physical\nconstraint complicates the acquisition of high-quality hybrid signals, thereby\nlimiting the widespread application of hybrid MI-BCIs. To facilitate the\nacquisition of hybrid EEG-fNIRS signals, this study proposes the\nspatio-temporal controlled diffusion model (SCDM) as a framework for\ncross-modal generation from EEG to fNIRS. The model utilizes two core modules,\nthe spatial cross-modal generation (SCG) module and the multi-scale temporal\nrepresentation (MTR) module, which adaptively learn the respective latent\ntemporal and spatial representations of both signals in a unified\nrepresentation space. The SCG module further maps EEG representations to fNIRS\nrepresentations by leveraging their spatial relationships. Experimental results\nshow high similarity between synthetic and real fNIRS signals. The joint\nclassification performance of EEG and synthetic fNIRS signals is comparable to\nor even better than that of EEG with real fNIRS signals. Furthermore, the\nsynthetic signals exhibit similar spatio-temporal features to real signals\nwhile preserving spatial relationships with EEG signals. Experimental results\nsuggest that the SCDM may represent a promising paradigm for the acquisition of\nhybrid EEG-fNIRS signals in MI-BCI systems.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}