{"id":"2407.09918","title":"DiffRect: Latent Diffusion Label Rectification for Semi-supervised\n  Medical Image Segmentation","authors":"Xinyu Liu, Wuyang Li, Yixuan Yuan","authorsParsed":[["Liu","Xinyu",""],["Li","Wuyang",""],["Yuan","Yixuan",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 15:27:31 GMT"}],"updateDate":"2024-07-16","timestamp":1720884451000,"abstract":"  Semi-supervised medical image segmentation aims to leverage limited annotated\ndata and rich unlabeled data to perform accurate segmentation. However,\nexisting semi-supervised methods are highly dependent on the quality of\nself-generated pseudo labels, which are prone to incorrect supervision and\nconfirmation bias. Meanwhile, they are insufficient in capturing the label\ndistributions in latent space and suffer from limited generalization to\nunlabeled data. To address these issues, we propose a Latent Diffusion Label\nRectification Model (DiffRect) for semi-supervised medical image segmentation.\nDiffRect first utilizes a Label Context Calibration Module (LCC) to calibrate\nthe biased relationship between classes by learning the category-wise\ncorrelation in pseudo labels, then apply Latent Feature Rectification Module\n(LFR) on the latent space to formulate and align the pseudo label distributions\nof different levels via latent diffusion. It utilizes a denoising network to\nlearn the coarse to fine and fine to precise consecutive distribution\ntransportations. We evaluate DiffRect on three public datasets: ACDC, MS-CMRSEG\n2019, and Decathlon Prostate. Experimental results demonstrate the\neffectiveness of DiffRect, e.g. it achieves 82.40\\% Dice score on ACDC with\nonly 1\\% labeled scan available, outperforms the previous state-of-the-art by\n4.60\\% in Dice, and even rivals fully supervised performance. Code is released\nat \\url{https://github.com/CUHK-AIM-Group/DiffRect}.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"O0fgvfkFEsGNN9wDvBEZh9BBaZN8T0BQR6rh4h7OA44","pdfSize":"1216864"}
