{"id":"2407.13384","title":"Movement-based models for abundance data","authors":"Ricardo Carrizo Vergara, Marc K\\'ery, Trevor Hefley","authorsParsed":[["Vergara","Ricardo Carrizo",""],["Kéry","Marc",""],["Hefley","Trevor",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 10:42:51 GMT"}],"updateDate":"2024-07-19","timestamp":1721299371000,"abstract":"  We develop two statistical models for space-time abundance data based on the\nmodelling of an underlying continuous movement. Different from other models for\nabundance in the current statistical ecology literature, our models focus\nespecially on an explicit connection between the movement of the individuals\nand the count, and on the space-time auto-correlation thus induced. Our first\nmodel (Snapshot) describes the count of free individuals with a false-negative\ndetection error. Our second model (Capture) describes the capture and retention\nin traps of moving individuals, and it is constructed using an axiomatic\napproach establishing three simple principles, from which it is deduced that\nthe density of the capture time is the solution of a Volterra integral equation\nof the second kind. We make explicit the space-time mean and covariance\nstructures of the abundance fields thus generated, and we develop simulation\nmethods for both models. The joint distribution of the space-time counts is an\ninstance of a new multivariate distribution, here baptised the\nEvolving-Categories Multinomial distribution, for which we establish some key\nproperties. Since a general expression of the likelihood remains intractable,\nwe propose an approximated MLE fitting method by replacing it by a multivariate\nGaussian one, which is justified by central limit theorem and respects mean and\ncovariance structures. We apply this method to experimental data of fruit flies\nreleased in a meadow and repeatedly captured and counted in an array of traps.\nWe estimate spread and advection parameters, compare our models to an\nEcological Diffusion model, and conduct simulation studies to validate our\nanalysis. Asymptotic consistency is experimentally verified. We conclude that\nwe can estimate movement parameters using only abundance data, but must be\naware of the necessary conditions to avoid underestimation of spread\nparameters.\n","subjects":["Statistics/Applications","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"hCCnJyRdjtU-KL1lHU1A1tm0vBH5MnkudEb_ZaO5IB0","pdfSize":"793507","objectId":"0x089f45f17ca5f625194e268c18c0cc73e9f5971e8529142877ff9f5f3c5815ff","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
