{"id":"2407.19970","title":"From Flat to Spatial: Comparison of 4 methods constructing 3D, 2 and\n  1/2D Models from 2D Plans with neural networks","authors":"Jacob Sam, Karan Patel, Mike Saad","authorsParsed":[["Sam","Jacob",""],["Patel","Karan",""],["Saad","Mike",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:01:20 GMT"}],"updateDate":"2024-07-30","timestamp":1722258080000,"abstract":"  In the field of architecture, the conversion of single images into 2 and 1/2D\nand 3D meshes is a promising technology that enhances design visualization and\nefficiency. This paper evaluates four innovative methods: \"One-2-3-45,\" \"CRM:\nSingle Image to 3D Textured Mesh with Convolutional Reconstruction Model,\"\n\"Instant Mesh,\" and \"Image-to-Mesh.\" These methods are at the forefront of this\ntechnology, focusing on their applicability in architectural design and\nvisualization. They streamline the creation of 3D architectural models,\nenabling rapid prototyping and detailed visualization from minimal initial\ninputs, such as photographs or simple sketches.One-2-3-45 leverages a\ndiffusion-based approach to generate multi-view reconstructions, ensuring high\ngeometric fidelity and texture quality. CRM utilizes a convolutional network to\nintegrate geometric priors into its architecture, producing detailed and\ntextured meshes quickly and efficiently. Instant Mesh combines the strengths of\nmulti-view diffusion and sparse-view models to offer speed and scalability,\nsuitable for diverse architectural projects. Image-to-Mesh leverages a\ngenerative adversarial network (GAN) to produce 3D meshes from single images,\nfocusing on maintaining high texture fidelity and geometric accuracy by\nincorporating image and depth map data into its training process. It uses a\nhybrid approach that combines voxel-based representations with surface\nreconstruction techniques to ensure detailed and realistic 3D models.This\ncomparative study highlights each method's contribution to reducing design\ncycle times, improving accuracy, and enabling flexible adaptations to various\narchitectural styles and requirements. By providing architects with powerful\ntools for rapid visualization and iteration, these advancements in 3D mesh\ngeneration are set to revolutionize architectural practices.\n","subjects":["Computing Research Repository/Graphics","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pXvzzsPBvckEqrWb6zitd3w103IQj3R3RtEGzV0VJao","pdfSize":"721502"}
