{"id":"2407.04512","title":"Entropy Computing: A Paradigm for Optimization in an Open Quantum System","authors":"Lac Nguyen, Mohammad-Ali Miri, R. Joseph Rupert, Wesley Dyk, Sam Wu,\n  Nick Vrahoretis, Irwin Huang, Milan Begliarbekov, Nicholas Chancellor,\n  Uchenna Chukwu, Pranav Mahamuni, Cesar Martinez-Delgado, David Haycraft,\n  Carrie Spear, Mark Campanelli, Russell Huffman, Yong Meng Sua, Yuping Huang","authorsParsed":[["Nguyen","Lac",""],["Miri","Mohammad-Ali",""],["Rupert","R. Joseph",""],["Dyk","Wesley",""],["Wu","Sam",""],["Vrahoretis","Nick",""],["Huang","Irwin",""],["Begliarbekov","Milan",""],["Chancellor","Nicholas",""],["Chukwu","Uchenna",""],["Mahamuni","Pranav",""],["Martinez-Delgado","Cesar",""],["Haycraft","David",""],["Spear","Carrie",""],["Campanelli","Mark",""],["Huffman","Russell",""],["Sua","Yong Meng",""],["Huang","Yuping",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 13:54:04 GMT"}],"updateDate":"2024-07-08","timestamp":1720187644000,"abstract":"  Modern quantum technologies using matter are designed as closed quantum\nsystems to isolate them from interactions with the environment. This design\nparadigm greatly constrains the scalability and limits practical implementation\nof such systems. Here, we introduce a novel computing paradigm, entropy\ncomputing, that works by conditioning a quantum reservoir thereby enabling the\nstabilization of a ground state. In this work, we experimentally demonstrate\nthe feasibility of entropy computing by building a hybrid photonic-electronic\ncomputer that uses measurement-based feedback to solve non-convex optimization\nproblems. The system functions by using temporal photonic modes to create\nqudits in order to encode probability amplitudes in the time-frequency degree\nof freedom of a photon. This scheme, when coupled with electronic\ninterconnects, allows us to encode an arbitrary Hamiltonian into the system and\nsolve non-convex continuous variables and combinatorial optimization problems.\nWe show that the proposed entropy computing paradigm can act as a scalable and\nversatile platform for tackling a large range of NP-hard optimization problems.\n","subjects":["Physics/Quantum Physics","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}