{"id":"2407.06886","title":"Aligning Cyber Space with Physical World: A Comprehensive Survey on\n  Embodied AI","authors":"Yang Liu, Weixing Chen, Yongjie Bai, Xiaodan Liang, Guanbin Li, Wen\n  Gao, Liang Lin","authorsParsed":[["Liu","Yang",""],["Chen","Weixing",""],["Bai","Yongjie",""],["Liang","Xiaodan",""],["Li","Guanbin",""],["Gao","Wen",""],["Lin","Liang",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 14:14:47 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 01:48:00 GMT"},{"version":"v3","created":"Wed, 17 Jul 2024 07:33:26 GMT"},{"version":"v4","created":"Thu, 18 Jul 2024 07:41:12 GMT"},{"version":"v5","created":"Mon, 22 Jul 2024 01:59:21 GMT"},{"version":"v6","created":"Mon, 29 Jul 2024 05:26:44 GMT"},{"version":"v7","created":"Mon, 26 Aug 2024 03:25:12 GMT"}],"updateDate":"2024-08-27","timestamp":1720534487000,"abstract":"  Embodied Artificial Intelligence (Embodied AI) is crucial for achieving\nArtificial General Intelligence (AGI) and serves as a foundation for various\napplications that bridge cyberspace and the physical world. Recently, the\nemergence of Multi-modal Large Models (MLMs) and World Models (WMs) have\nattracted significant attention due to their remarkable perception,\ninteraction, and reasoning capabilities, making them a promising architecture\nfor the brain of embodied agents. However, there is no comprehensive survey for\nEmbodied AI in the era of MLMs. In this survey, we give a comprehensive\nexploration of the latest advancements in Embodied AI. Our analysis firstly\nnavigates through the forefront of representative works of embodied robots and\nsimulators, to fully understand the research focuses and their limitations.\nThen, we analyze four main research targets: 1) embodied perception, 2)\nembodied interaction, 3) embodied agent, and 4) sim-to-real adaptation,\ncovering the state-of-the-art methods, essential paradigms, and comprehensive\ndatasets. Additionally, we explore the complexities of MLMs in virtual and real\nembodied agents, highlighting their significance in facilitating interactions\nin dynamic digital and physical environments. Finally, we summarize the\nchallenges and limitations of embodied AI and discuss their potential future\ndirections. We hope this survey will serve as a foundational reference for the\nresearch community and inspire continued innovation. The associated project can\nbe found at https://github.com/HCPLab-SYSU/Embodied_AI_Paper_List.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Multiagent Systems","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}