{"id":"2407.19829","title":"Generative Retrieval with Preference Optimization for E-commerce Search","authors":"Mingming Li, Huimu Wang, Zuxu Chen, Guangtao Nie, Yiming Qiu, Binbin\n  Wang, Guoyu Tang, Lin Liu, Jingwei Zhuo","authorsParsed":[["Li","Mingming",""],["Wang","Huimu",""],["Chen","Zuxu",""],["Nie","Guangtao",""],["Qiu","Yiming",""],["Wang","Binbin",""],["Tang","Guoyu",""],["Liu","Lin",""],["Zhuo","Jingwei",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 09:31:19 GMT"}],"updateDate":"2024-07-30","timestamp":1722245479000,"abstract":"  Generative retrieval introduces a groundbreaking paradigm to document\nretrieval by directly generating the identifier of a pertinent document in\nresponse to a specific query. This paradigm has demonstrated considerable\nbenefits and potential, particularly in representation and generalization\ncapabilities, within the context of large language models. However, it faces\nsignificant challenges in E-commerce search scenarios, including the complexity\nof generating detailed item titles from brief queries, the presence of noise in\nitem titles with weak language order, issues with long-tail queries, and the\ninterpretability of results. To address these challenges, we have developed an\ninnovative framework for E-commerce search, called generative retrieval with\npreference optimization. This framework is designed to effectively learn and\nalign an autoregressive model with target data, subsequently generating the\nfinal item through constraint-based beam search. By employing multi-span\nidentifiers to represent raw item titles and transforming the task of\ngenerating titles from queries into the task of generating multi-span\nidentifiers from queries, we aim to simplify the generation process. The\nframework further aligns with human preferences using click data and employs a\nconstrained search method to identify key spans for retrieving the final item,\nthereby enhancing result interpretability. Our extensive experiments show that\nthis framework achieves competitive performance on a real-world dataset, and\nonline A/B tests demonstrate the superiority and effectiveness in improving\nconversion gains.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}