{"id":"2407.21149","title":"Domain Shift Analysis in Chest Radiographs Classification in a Veterans\n  Healthcare Administration Population","authors":"Mayanka Chandrashekar, Ian Goethert, Md Inzamam Ul Haque, Benjamin\n  McMahon, Sayera Dhaubhadel, Kathryn Knight, Joseph Erdos, Donna Reagan,\n  Caroline Taylor, Peter Kuzmak, John Michael Gaziano, Eileen McAllister,\n  Lauren Costa, Yuk-Lam Ho, Kelly Cho, Suzanne Tamang, Samah Fodeh-Jarad, Olga\n  S. Ovchinnikova, Amy C. Justice, Jacob Hinkle, Ioana Danciu","authorsParsed":[["Chandrashekar","Mayanka",""],["Goethert","Ian",""],["Haque","Md Inzamam Ul",""],["McMahon","Benjamin",""],["Dhaubhadel","Sayera",""],["Knight","Kathryn",""],["Erdos","Joseph",""],["Reagan","Donna",""],["Taylor","Caroline",""],["Kuzmak","Peter",""],["Gaziano","John Michael",""],["McAllister","Eileen",""],["Costa","Lauren",""],["Ho","Yuk-Lam",""],["Cho","Kelly",""],["Tamang","Suzanne",""],["Fodeh-Jarad","Samah",""],["Ovchinnikova","Olga S.",""],["Justice","Amy C.",""],["Hinkle","Jacob",""],["Danciu","Ioana",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 19:23:29 GMT"}],"updateDate":"2024-08-01","timestamp":1722367409000,"abstract":"  Objectives: This study aims to assess the impact of domain shift on chest\nX-ray classification accuracy and to analyze the influence of ground truth\nlabel quality and demographic factors such as age group, sex, and study year.\nMaterials and Methods: We used a DenseNet121 model pretrained MIMIC-CXR dataset\nfor deep learning-based multilabel classification using ground truth labels\nfrom radiology reports extracted using the CheXpert and CheXbert Labeler. We\ncompared the performance of the 14 chest X-ray labels on the MIMIC-CXR and\nVeterans Healthcare Administration chest X-ray dataset (VA-CXR). The VA-CXR\ndataset comprises over 259k chest X-ray images spanning between the years 2010\nand 2022. Results: The validation of ground truth and the assessment of\nmulti-label classification performance across various NLP extraction tools\nrevealed that the VA-CXR dataset exhibited lower disagreement rates than the\nMIMIC-CXR datasets. Additionally, there were notable differences in AUC scores\nbetween models utilizing CheXpert and CheXbert. When evaluating multi-label\nclassification performance across different datasets, minimal domain shift was\nobserved in unseen datasets, except for the label \"Enlarged Cardiomediastinum.\"\nThe study year's subgroup analyses exhibited the most significant variations in\nmulti-label classification model performance. These findings underscore the\nimportance of considering domain shifts in chest X-ray classification tasks,\nparticularly concerning study years. Conclusion: Our study reveals the\nsignificant impact of domain shift and demographic factors on chest X-ray\nclassification, emphasizing the need for improved transfer learning and\nequitable model development. Addressing these challenges is crucial for\nadvancing medical imaging and enhancing patient care.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"aJC9MMPD5Xw9S6iqbWcUtAi6Mi0t-bgdVmxTvKASCUY","pdfSize":"12354398"}
