{"id":"2407.16138","title":"DOLOS: Tricking the Wi-Fi APs with Incorrect User Locations","authors":"Aditya Arun, Vaibhav Anand, Wei Sun, Roshan Ayyalasomayajula, and\n  Dinesh Bharadia","authorsParsed":[["Arun","Aditya",""],["Anand","Vaibhav",""],["Sun","Wei",""],["Ayyalasomayajula","Roshan",""],["Bharadia","Dinesh",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 02:51:36 GMT"}],"updateDate":"2024-07-24","timestamp":1721703096000,"abstract":"  Wi-Fi-based indoor localization has been extensively studied for\ncontext-aware services. As a result, the accurate Wi-Fi-based indoor\nlocalization introduces a great location privacy threat. However, the existing\nsolutions for location privacy protection are hard to implement on current\ndevices. They require extra hardware deployment in the environment or hardware\nmodifications at the transmitter or receiver side. To this end, we propose\nDOLOS, a system that can protect the location privacy of the Wi-Fi user with a\nnovel signal obfuscation approach. DOLOSis a software-only solution that can be\ndeployed on existing protocol-compliant Wi-Fi user devices. We provide this\nobfuscation by invalidating a simple assumption made by most localization\nsystems -- \"direct path signal arrives earlier than all the reflections to\ndistinguish this direct path prior to estimating the location\". However, DOLOS\ncreates a novel software fix that allows the user to transmit the signal\nwherein this direct path arrives later, creating ambiguity in the location\nestimates. Our experimental results demonstrate DOLOS can degrade the\nlocalization accuracy of state-of-art systems by 6x for a single AP and 2.5x\nfor multiple AP scenarios, thereby protecting the Wi-Fi user's location privacy\nwithout compromising the Wi-Fi communication performance.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"35GUbH60J_rEV0nsmyFTRmXGve_6UV_o1WSg89wvYnk","pdfSize":"3176508"}
