{"id":"2407.06073","title":"Quantum control of ion-atom collisions beyond the ultracold regime","authors":"Maks Z. Walewski, Matthew D. Frye, Or Katz, Meirav Pinkas, Roee Ozeri,\n  Micha{\\l} Tomza","authorsParsed":[["Walewski","Maks Z.",""],["Frye","Matthew D.",""],["Katz","Or",""],["Pinkas","Meirav",""],["Ozeri","Roee",""],["Tomza","Michał",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 16:14:17 GMT"}],"updateDate":"2024-07-09","timestamp":1720455257000,"abstract":"  Control of microscopic physical systems is a prerequisite for experimental\nquantum science and its applications. Neutral atomic and molecular systems can\nbe controlled using tunable scattering resonances. However, the resonant\ncontrol of effective interactions has so far been limited to the ultracold\nregime, where quantum effects become manifest. Ultracold temperatures are still\nout of reach for most hybrid trapped ion-atom systems, a prospective platform\nfor quantum technologies and fundamental research. Here we show that\nmagnetically tunable Feshbach resonances can be used to control inelastic\ncollisions between a single trapped Sr${}^+$ ion and Rb atoms high above the\nultracold regime. We measure inelastic collision probabilities and use the\nresults to calibrate a comprehensive theoretical model of ion-atom collisions.\nThe observed collision dynamics show signatures of quantum interference,\nresulting in the pronounced state and mass dependence of the collision rates in\nthe multiple-partial-wave regime. With our model, we discover multiple\nmeasurable Feshbach resonances for magnetic fields from 0 to 400 G, which allow\nsignificant enhancement of spin-exchange rates at temperatures as high as 1 mK.\nFuture observation of the predicted resonances should allow precise calibration\nand control of the short-range dynamics in the ${\\text{Sr}^++\\text{Rb}}$\ncollisions under unprecedentedly warm conditions.\n","subjects":["Physics/Atomic Physics","Condensed Matter/Quantum Gases","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XC-DW8yEiWuwAKkDBRPgIDjuBFAfkywKJPLxcfExPaQ","pdfSize":"3168041"}
