{"id":"2407.05937","title":"Edge Geometry of Regular Polygons -- Part 2","authors":"Gordon Hughes","authorsParsed":[["Hughes","Gordon",""]],"versions":[{"version":"v1","created":"Thu, 20 Jun 2024 20:43:39 GMT"}],"updateDate":"2024-07-09","timestamp":1718916219000,"abstract":"  There are multiple mappings that can be used to generate what we call the\n'edge geometry' of a regular N-gon, but they are all based on piecewise\nisometries acting on the extended edges of N to form a 'singularity' set W.\nThis singularity set is also known as the 'web' because it is connected and\nconsists of rays or line segments, with possible accumulation points in the\nlimit. We will use three such maps here, all of which appear to share the same\nlocal geometry of W. These mappings are the outer-billiards map Tau, the\ndigital-filter map Df and the 'dual-center' map Dc. In 'Outer-billiards,\ndigital filters and kicked Hamiltonians' (arXiv:1206.5223) we show that the Df\nand Dc maps are equivalent to a 'shear and rotation' in a toral space and the\ncomplex plane respectively, and in 'First Families of Regular Polygons and\ntheir Mutations' (arXiv:1612.09295) we show that the Tau-web W can also be\nreduced to a shear and rotation. This equivalence of maps supports the premise\nthat this web geometry is inherent in the N-gon. Since the topology of W is\ncomplex, we hope to make some progress by studying the region local to N. The\nedges of every regular N-gon are part of a Tau-invariant region local to N. The\nemphasis here are the S[1] and S[2] First Family tiles adjacent to N, but we\nwill also study their interaction with neighboring tiles. Since all S[k] tiles\nevolve in a multi-step fashion, it is possible to make predictions about the\n'next-generation' tiles which survive in the web. The Edge Conjecture defines\njust 8 classes of N-gons so there is an 'Eightfold Way' for regular polygons.\n","subjects":["Mathematics/Dynamical Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}