{"id":"2407.15409","title":"Observational Clues to the Magnetic Evolution of Magnetars","authors":"Kazuo Makishima, Nagomi Uchida, and Teruaki Enoto","authorsParsed":[["Makishima","Kazuo",""],["Uchida","Nagomi",""],["Enoto","Teruaki",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 06:35:57 GMT"}],"updateDate":"2024-07-23","timestamp":1721630157000,"abstract":"  Utilizing four archival X-ray datasets taken with the Hard X-ray Detector\nonboard Suzaku, timing studies were performed on three magnetars, 1E 1841-045\n(observed in 2006), SGR 0501+4516 (2008), and 1RXS J170849.0-400910 (2009 and\n2010). Their pulsations were reconfirmed, typically in an energy range of 12-50\nkeV. The 11.783 s pulses of 1E 1841-045, and those of SGR 0501+4516 with 5.762\ns were periodically phase modulated, with a long period of about 23.4 ks and\nabout 16.4 ks, respectively. The pulse-phase modulation was also observed, at\n46.5 ks, from two datasets of 1RXS J170849.0-400910. In all these cases, the\nmodulation amplitude was 6 to 16 percent of the pulse cycle. Including\npreviously confirmed four objects, this characteristic timing behavior is now\ndetected from seven magnetars in total, and interpreted as a result of free\nprecession of neutron stars that are deformed to an asphericity of ~10^{-4}.\nAssuming that the deformation is due to magnetic stress, these magnetars are\ninferred to harbor toroidal magnetic fields of Bt~10^{16} G. By comparing the\nestimated Bt of these objects with their poloidal dipole field Bd, the Bt/Bd\nratio is found to increase with their characteristic age. Therefore, the\ntoroidal fields of magnetars are likely to last longer than their dipole\nfields. This explains the presence of some classes of neutron stars that have\nrelatively weak Bd but are suspected to hide strong Bt inside them.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"fJRzJ7XJszQTb6X0Fkumj2x4icr5LILa6LBDFc3lZ_A","pdfSize":"4393374"}
