{"id":"2407.13566","title":"Decentralised Governance for Autonomous Cyber-Physical Systems","authors":"Kelsie Nabben (1) and Hongyang Wang (2), Michael Zargham (3) ((1)\n  European University Institute, (2) ETH Zurich, (3) Block Science)","authorsParsed":[["Nabben","Kelsie",""],["Wang","Hongyang",""],["Zargham","Michael",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 14:40:06 GMT"}],"updateDate":"2024-07-19","timestamp":1721313606000,"abstract":"  This paper examines the potential for Cyber-Physical Systems (CPS) to be\ngoverned in a decentralised manner, whereby blockchain-based infrastructure\nfacilitates the communication between digital and physical domains through\nself-governing and self-organising principles. Decentralised governance\nparadigms that integrate computation in physical domains (such as\n'Decentralised Autonomous Organisations' (DAOs)) represent a novel approach to\nautono-mous governance and operations. These have been described as akin to\ncybernetic systems. Through the lens of a case study of an autonomous cabin\ncalled \"no1s1\" which demonstrates self-ownership via blockchain-based control\nand feedback loops, this research explores the potential for blockchain\ninfrastructure to be utilised in the management of physical systems. By\nhighlighting the considerations and challenges of decentralised governance in\nmanaging autonomous physical spaces, the study reveals that autonomy in the\ngovernance of autonomous CPS is not merely a technological feat but also\ninvolves a complex mesh of functional and social dynamics. These findings\nunderscore the importance of developing continuous feedback loops and adaptive\ngovernance frameworks within decentralised CPS to address both expected and\nemergent challenges. This investigation contributes to the fields of\ninfra-structure studies and Cyber-Physical Systems engineering. It also\ncontributes to the discourse on decentralised governance and autonomous\nmanagement of physical spaces by offering both practical insights and providing\na framework for future research.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Social and Information Networks","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NzN-9J1LOtHkk8I6NwtO2nGhf3ZYw-8GwstyGb50eOE","pdfSize":"411077"}
