{"id":"2407.11776","title":"TCAD modeling of radiation-induced defects in 4H-SiC diodes","authors":"Philipp Gaggl, J\\\"urgen Burin, Andreas Gsponer, Simon Emanuel Waid,\n  Richard Thalmeier, Thomas Bergauer","authorsParsed":[["Gaggl","Philipp",""],["Burin","Jürgen",""],["Gsponer","Andreas",""],["Waid","Simon Emanuel",""],["Thalmeier","Richard",""],["Bergauer","Thomas",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:33:56 GMT"},{"version":"v2","created":"Wed, 11 Sep 2024 12:57:41 GMT"}],"updateDate":"2024-09-12","timestamp":1721140436000,"abstract":"  Silicon Carbide (SiC) has several advantageous properties compared to Silicon\n(Si) that make it an appealing detector material, such as a larger charge\ncarrier saturation velocity, bandgap, and thermal conductivity. While the\ncurrent understanding of material and model parameters suffices to simulate\nunirradiated 4H-SiC devices using technical computer-aided design (TCAD),\nconfigurations to accurately predict performance degradation after high levels\nof irradiation due to induced defects acting as traps and recombination centers\ndo not exist. Despite increasing efforts to characterize the introduction and\nnature of such defects in 4H-SiC, published results are often contradictory.\nThis work presents a bulk radiation damage model for TCAD simulations based on\nmeasurements on 50 $\\mu m$ 4H-SiC pad diodes, neutron-irradiated at various\nfluxes ranging from $5\\times 10^{14}$ $n_{eq}/cm^2$ to $1\\times 10^{16}$\n$n_{eq}/cm^2$. The model accurately predicts internal electric shifts, such as\nflattening of the detector capacitance, degradation in charge collection\nefficiency (CCE), and signal detection capabilities under forward bias\nconditions up to high bias. It further introduces the EH$_4$ defect cluster as\nmajor lifetime killer and reinforces the assumption of the EH$_{6,7}$\ndeep-level defect to be of donor type.\n","subjects":["Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bBovchuxIyisUeXarU9tKRjMsK9PAIeFYEfFOIIArXg","pdfSize":"275611"}
