{"id":"2407.04262","title":"Conformational and static properties of tagged chains in solvents:\n  effect of chain connectivity in solvent molecules","authors":"Hong-Yao Li, Bokai Zhang, Zhi-Yong Wang","authorsParsed":[["Li","Hong-Yao",""],["Zhang","Bokai",""],["Wang","Zhi-Yong",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 05:29:33 GMT"}],"updateDate":"2024-07-08","timestamp":1720157373000,"abstract":"  Polymer chains immersed in different solvent molecules exhibit diverse\nproperties due to multiple spatiotemporal scales and complex interactions.\nUsing molecular dynamics simulations, we study the conformational and static\nproperties of tagged chains in different solvent molecules. Two types of\nsolvent molecules were examined: one type consisted of chain molecules\nconnected by bonds, while the other type consisted of individual bead molecules\nwithout any bonds. The only difference between the two solvent molecules lay in\nthe chain connectivity. Our results show a compression of the tagged chains\nwith the addition of bead or chain molecules. Chain molecule confinement\ninduces a stronger compression compared to bead molecule confinement. In chain\nsolvent molecules, the tagged chain's radius of gyration reached a minimum at a\nmonomer volume fraction of $\\sim0.3$. Notably, the probability distributions of\nchain size remain unchanged at different solvent densities, irrespective of\nwhether the solvent consists of beads or polymers. Furthermore, as solvent\ndensity increases, a crossover from a unimodal to a bimodal distribution of\nbond angles is observed, indicating the presence of both compressed and\nexpanded regions within the chain. The effective monomer-solvent interaction is\nobtained by calculating the partial radial distribution function and the\npotential of the mean force. In chain solvent, the correlation hole effect\nresults in a reduced number of nearest neighbors around tagged monomers\ncompared to bead solvents. The calculation of pore size distribution reveals\nthat the solvent nonhomogeneity induced by chain connectivity leads to a\nbroader distribution of pore sizes and larger pore dimensions at low volume\nfractions. These findings provide a deeper understanding of the conformational\nbehavior of polymer chains in different solvent environments.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}