{"id":"2407.07780","title":"Cross Domain Object Detection via Multi-Granularity Confidence Alignment\n  based Mean Teacher","authors":"Jiangming Chen, Li Liu, Wanxia Deng, Zhen Liu, Yu Liu, Yingmei Wei,\n  Yongxiang Liu","authorsParsed":[["Chen","Jiangming",""],["Liu","Li",""],["Deng","Wanxia",""],["Liu","Zhen",""],["Liu","Yu",""],["Wei","Yingmei",""],["Liu","Yongxiang",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:56:24 GMT"}],"updateDate":"2024-07-11","timestamp":1720626984000,"abstract":"  Cross domain object detection learns an object detector for an unlabeled\ntarget domain by transferring knowledge from an annotated source domain.\nPromising results have been achieved via Mean Teacher, however, pseudo labeling\nwhich is the bottleneck of mutual learning remains to be further explored. In\nthis study, we find that confidence misalignment of the predictions, including\ncategory-level overconfidence, instance-level task confidence inconsistency,\nand image-level confidence misfocusing, leading to the injection of noisy\npseudo label in the training process, will bring suboptimal performance on the\ntarget domain. To tackle this issue, we present a novel general framework\ntermed Multi-Granularity Confidence Alignment Mean Teacher (MGCAMT) for cross\ndomain object detection, which alleviates confidence misalignment across\ncategory-, instance-, and image-levels simultaneously to obtain high quality\npseudo supervision for better teacher-student learning. Specifically, to align\nconfidence with accuracy at category level, we propose Classification\nConfidence Alignment (CCA) to model category uncertainty based on Evidential\nDeep Learning (EDL) and filter out the category incorrect labels via an\nuncertainty-aware selection strategy. Furthermore, to mitigate the\ninstance-level misalignment between classification and localization, we design\nTask Confidence Alignment (TCA) to enhance the interaction between the two task\nbranches and allow each classification feature to adaptively locate the optimal\nfeature for the regression. Finally, we develop imagery Focusing Confidence\nAlignment (FCA) adopting another way of pseudo label learning, i.e., we use the\noriginal outputs from the Mean Teacher network for supervised learning without\nlabel assignment to concentrate on holistic information in the target image.\nThese three procedures benefit from each other from a cooperative learning\nperspective.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}