{"id":"2407.11947","title":"Spatiotemporal dynamics of ionic reorganization near biological membrane\n  interfaces","authors":"Hyeongjoo Row, Joshua B. Fernandes, Kranthi K. Mandadapu, and Karthik\n  Shekhar","authorsParsed":[["Row","Hyeongjoo",""],["Fernandes","Joshua B.",""],["Mandadapu","Kranthi K.",""],["Shekhar","Karthik",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 17:36:46 GMT"}],"updateDate":"2024-07-17","timestamp":1721151406000,"abstract":"  Electrical signals in excitable cells involve spatially localized ionic\nfluxes through ion channels and pumps on cellular lipid membranes. Common\napproaches to understand how these localized fluxes spread assume that the\nmembrane and the surrounding electrolyte comprise an equivalent circuit of\ncapacitors and resistors, which ignores the localized nature of transmembrane\nion transport, the resulting ionic gradients and electric fields, and their\nspatiotemporal relaxation. Here, we consider a model of localized ion pumping\nacross a lipid membrane, and use theory and simulation to investigate how the\nelectrochemical signal propagates spatiotemporally in- and out-of-plane along\nthe membrane. The localized pumping generates long-ranged electric fields with\nthree distinct scaling regimes along the membrane: a constant potential\nnear-field region, an intermediate \"monopolar\" region, and a far-field\n\"dipolar\" region. Upon sustained pumping, the monopolar region expands radially\nin-plane with a steady speed that is enhanced by the dielectric mismatch and\nthe finite thickness of the lipid membrane. For unmyelinated lipid membranes in\nphysiological settings, we find remarkably fast propagation speeds of $\\sim\\!40\n\\, \\mathrm{m/s}$, allowing faster ionic reorganization compared to bare\ndiffusion. Together, our work shows that transmembrane ionic fluxes induce\ntransient long-ranged electric fields in electrolyte solutions, which may play\nhitherto unappreciated roles in biological signaling.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Biological Physics","Quantitative Biology/Subcellular Processes"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"1b_0no-jRpFY41MgZHvvLrSCqbTqCMZWa8eTiylWlyo","pdfSize":"5014174"}
