{"id":"2407.17496","title":"Accessibility evaluation of major assistive mobile applications\n  available for the visually impaired","authors":"Saidarshan Bhagat, Padmaja Joshi, Avinash Agarwal, Shubhanshu Gupta","authorsParsed":[["Bhagat","Saidarshan",""],["Joshi","Padmaja",""],["Agarwal","Avinash",""],["Gupta","Shubhanshu",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 02:28:22 GMT"}],"updateDate":"2024-07-26","timestamp":1720146502000,"abstract":"  People with visual impairments face numerous challenges in their daily lives,\nincluding mobility, access to information, independent living, and employment.\nArtificial Intelligence (AI) with Computer Vision (CV) has the potential to\nimprove their daily lives, provide them with necessary independence, and it\nwill also spawn new opportunities in education and employment. However, while\nmany such AI/CV-based mobile applications are now available, these apps are\nstill not the preferred choice amongst visually impaired persons and are\ngenerally limited to advanced users only, due to certain limitations. This\nstudy evaluates the challenges faced by visually impaired persons when using\nAI/CV-based mobile apps. Four popular AI/CV- based apps, namely Seeing AI,\nSupersense, Envision and Lookout, are assessed by blind and low-vision users.\nHence these mobile applications are evaluated on a set of parameters, including\ngeneric parameters based on the Web Content Accessibility Guidelines (WCAG) and\nspecific parameters related to mobile app testing. The evaluation not only\nfocused on the guidelines but also on the feedback that was gathered from these\nusers on parameters covering the apps' accuracy, response time, reliability,\naccessibility, privacy, energy efficiency and usability. The paper also\nidentifies the areas of improvement in the development and innovation of these\nassistive apps. This work will help developers create better accessible\nAI-based apps for the visually impaired.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}