{"id":"2407.01426","title":"Maximizing Blockchain Performance: Mitigating Conflicting Transactions\n  through Parallelism and Dependency Management","authors":"Faisal Haque Bappy, Tarannum Shaila Zaman, Md Sajidul Islam Sajid, Mir\n  Mehedi Ahsan Pritom, and Tariqul Islam","authorsParsed":[["Bappy","Faisal Haque",""],["Zaman","Tarannum Shaila",""],["Sajid","Md Sajidul Islam",""],["Pritom","Mir Mehedi Ahsan",""],["Islam","Tariqul",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 16:17:33 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 00:33:43 GMT"}],"updateDate":"2024-07-04","timestamp":1719850653000,"abstract":"  While blockchains initially gained popularity in the realm of\ncryptocurrencies, their widespread adoption is expanding beyond conventional\napplications, driven by the imperative need for enhanced data security. Despite\nproviding a secure network, blockchains come with certain tradeoffs, including\nhigh latency, lower throughput, and an increased number of transaction\nfailures. A pivotal issue contributing to these challenges is the improper\nmanagement of \"conflicting transactions\", commonly referred to as \"contention\".\nWhen a number of pending transactions within a blockchain collide with each\nother, this results in a state of contention. This situation worsens network\nlatency, leads to the wastage of system resources, and ultimately contributes\nto reduced throughput and higher transaction failures. In response to this\nissue, in this work, we present a novel blockchain scheme that integrates\ntransaction parallelism and an intelligent dependency manager aiming to reduce\nthe occurrence of conflicting transactions within blockchain networks. In terms\nof effectiveness and efficiency, experimental results show that our scheme not\nonly mitigates the challenges posed by conflicting transactions, but also\noutperforms both existing parallel and non-parallel Hyperledger Fabric\nblockchain networks achieving higher transaction success rate, throughput, and\nlatency. The integration of our scheme with Hyperledger Fabric appears to be a\npromising solution for improving the overall performance and stability of\nblockchain networks in real-world applications.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}