{"id":"2407.03997","title":"AstroSat/UVIT Study of the Diffuse Ultraviolet Radiation in the Dwarf\n  Galaxy Holmberg II","authors":"Olag Pratim Bordoloi, B. Ananthamoorthy, P. Shalima, Margarita\n  Safonova, Debbijoy Bhattacharya, Yuri A. Shchekinov and Rupjyoti Gogoi","authorsParsed":[["Bordoloi","Olag Pratim",""],["Ananthamoorthy","B.",""],["Shalima","P.",""],["Safonova","Margarita",""],["Bhattacharya","Debbijoy",""],["Shchekinov","Yuri A.",""],["Gogoi","Rupjyoti",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 15:16:51 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 05:52:59 GMT"}],"updateDate":"2024-07-30","timestamp":1720106211000,"abstract":"  We present measurements of diffuse ultraviolet emission in the dwarf\nirregular galaxy Holmberg II obtained with the UltraViolet Imaging Telescope\n(UVIT) onboard AstroSat. With a spatial resolution of 1.2 to 1.6 arcsec, these\nare the highest resolution UV observations of the galaxy to date. We find that\ndiffuse emission accounts for 70.6 % (58.1 %) of the total FUV(NUV) emission,\nrespectively. We perform a UV-IR correlation study of the diffuse emission in\nthis galaxy using infrared observations from Spitzer Space Telescope and\nHerschel Space Observatory for selected locations, free of detectable bright\npoint sources. The strongest positive correlation between FUV and IR is\nobserved at 70 micron for high HI density locations, indicating that warm dust\ngrains dominate the IR emission, in agreement with earlier studies, while NUV\nis better correlated with 160 micron emission associated with cold dust grains.\nLow HI density regions or cavities, do not show any significant UV-IR\ncorrelation except at 160 micron, implying either the presence of colder dust\ngrains in cavities, being irradiated by the general radiation field, or\ninsufficient amount of dust. The dust scattering contribution in high HI\ndensity regions, estimated using a single scattering model with foreground dust\nclouds with LMC reddening, gives best-fit albedo and asymmetry factor values of\n0.2 and 0.5, respectively, in reasonable agreement with the theoretical\npredictions for LMC dust. Our model derived scattering optical depths in the\nFUV range from 0.02 to 0.12, implying the medium is optically thin. Therefore,\nin high HI density regions, dust scattering can be one the sources of the\nobserved diffuse UV emission, apart from possible contributions from molecular\nhydrogen fluorescence, However, the diffuse UV component in HI cavities can\nonly be explained via other mechanisms, such as two photon emission.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}