{"id":"2407.12859","title":"Automated Question Generation on Tabular Data for Conversational Data\n  Exploration","authors":"Ritwik Chaudhuri, Rajmohan C, Kirushikesh DB, Arvind Agarwal","authorsParsed":[["Chaudhuri","Ritwik",""],["C","Rajmohan",""],["DB","Kirushikesh",""],["Agarwal","Arvind",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 08:07:05 GMT"}],"updateDate":"2024-07-19","timestamp":1720598825000,"abstract":"  Exploratory data analysis (EDA) is an essential step for analyzing a dataset\nto derive insights. Several EDA techniques have been explored in the\nliterature. Many of them leverage visualizations through various plots. But it\nis not easy to interpret them for a non-technical user, and producing\nappropriate visualizations is also tough when there are a large number of\ncolumns. Few other works provide a view of some interesting slices of data but\nit is still difficult for the user to draw relevant insights from them. Of\nlate, conversational data exploration is gaining a lot of traction among\nnon-technical users. It helps the user to explore the dataset without having\ndeep technical knowledge about the data. Towards this, we propose a system that\nrecommends interesting questions in natural language based on relevant slices\nof a dataset in a conversational setting. Specifically, given a dataset, we\npick a select set of interesting columns and identify interesting slices of\nsuch columns and column combinations based on few interestingness measures. We\nuse our own fine-tuned variation of a pre-trained language model(T5) to\ngenerate natural language questions in a specific manner. We then slot-fill\nvalues in the generated questions and rank them for recommendations. We show\nthe utility of our proposed system in a coversational setting with a collection\nof real datasets.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}