{"id":"2407.17010","title":"Selective and Quasi-continuous Switching of Ferroelectric Chern\n  Insulator Device for Neuromorphic Computing","authors":"Moyu Chen, Yongqin Xie, Bin Cheng, Zaizheng Yang, Xin-Zhi Li, Fanqiang\n  Chen, Qiao Li, Jiao Xie, Kenji Watanabe, Takashi Taniguchi, Wen-Yu He,\n  Menghao Wu, Shi-Jun Liang, Feng Miao","authorsParsed":[["Chen","Moyu",""],["Xie","Yongqin",""],["Cheng","Bin",""],["Yang","Zaizheng",""],["Li","Xin-Zhi",""],["Chen","Fanqiang",""],["Li","Qiao",""],["Xie","Jiao",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["He","Wen-Yu",""],["Wu","Menghao",""],["Liang","Shi-Jun",""],["Miao","Feng",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 05:18:05 GMT"}],"updateDate":"2024-07-25","timestamp":1721798285000,"abstract":"  Topologically protected edge state transport in quantum materials is\ndissipationless and features quantized Hall conductance, and shows great\npotential in highly fault-tolerant computing technologies. However, it remains\nelusive about how to develop topological edge state-based computing devices.\nRecently, exploration and understanding of interfacial ferroelectricity in\nvarious van der Waals heterostructure material systems have received widespread\nattention among the community of materials science and condensed matter\nphysics3-11. Such ferroelectric polarization emergent at the vdW interface can\ncoexist with other quantum states and thus provides an unprecedented\nopportunity to electrically switch the topological edge states of interest,\nwhich is of crucial significance to the fault-tolerant electronic device\napplications based on the topological edge states. Here, we report the\nselective and quasi-continuous ferroelectric switching of topological Chern\ninsulator devices and demonstrate its promising application in noise-immune\nneuromorphic computing. We fabricate this ferroelectric Chern insulator device\nby encapsulating magic-angle twisted bilayer graphene with doubly-aligned h-BN\nlayers, and observe the coexistence of the interfacial ferroelectricity and the\ntopological Chern insulating states. This ferroelectricity exhibits an\nanisotropic dependence on the in-plane magnetic field. By using a VBG pulse\nwith delicately controlled amplitude, we realize the nonvolatile switching\nbetween any pair of Chern insulating states and achieve 1280 distinguishable\nnonvolatile resistance levels on a single device. Furthermore, we demonstrate\ndeterministic switching between two arbitrary levels among the record-high\nnumber of nonvolatile resistance levels.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}