{"id":"2407.04844","title":"Neural varifolds: an aggregate representation for quantifying the\n  geometry of point clouds","authors":"Juheon Lee, Xiaohao Cai, Carola-Bibian Sch\\\"onlieb, Simon Masnou","authorsParsed":[["Lee","Juheon",""],["Cai","Xiaohao",""],["Schönlieb","Carola-Bibian",""],["Masnou","Simon",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 20:08:16 GMT"}],"updateDate":"2024-07-09","timestamp":1720210096000,"abstract":"  Point clouds are popular 3D representations for real-life objects (such as in\nLiDAR and Kinect) due to their detailed and compact representation of\nsurface-based geometry. Recent approaches characterise the geometry of point\nclouds by bringing deep learning based techniques together with geometric\nfidelity metrics such as optimal transportation costs (e.g., Chamfer and\nWasserstein metrics). In this paper, we propose a new surface geometry\ncharacterisation within this realm, namely a neural varifold representation of\npoint clouds. Here the surface is represented as a measure/distribution over\nboth point positions and tangent spaces of point clouds. The varifold\nrepresentation quantifies not only the surface geometry of point clouds through\nthe manifold-based discrimination, but also subtle geometric consistencies on\nthe surface due to the combined product space. This study proposes neural\nvarifold algorithms to compute the varifold norm between two point clouds using\nneural networks on point clouds and their neural tangent kernel\nrepresentations. The proposed neural varifold is evaluated on three different\nsought-after tasks -- shape matching, few-shot shape classification and shape\nreconstruction. Detailed evaluation and comparison to the state-of-the-art\nmethods demonstrate that the proposed versatile neural varifold is superior in\nshape matching and few-shot shape classification, and is competitive for shape\nreconstruction.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}