{"id":"2407.12996","title":"Sharpness-diversity tradeoff: improving flat ensembles with SharpBalance","authors":"Haiquan Lu, Xiaotian Liu, Yefan Zhou, Qunli Li, Kurt Keutzer, Michael\n  W. Mahoney, Yujun Yan, Huanrui Yang, Yaoqing Yang","authorsParsed":[["Lu","Haiquan",""],["Liu","Xiaotian",""],["Zhou","Yefan",""],["Li","Qunli",""],["Keutzer","Kurt",""],["Mahoney","Michael W.",""],["Yan","Yujun",""],["Yang","Huanrui",""],["Yang","Yaoqing",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 20:31:26 GMT"}],"updateDate":"2024-07-19","timestamp":1721248286000,"abstract":"  Recent studies on deep ensembles have identified the sharpness of the local\nminima of individual learners and the diversity of the ensemble members as key\nfactors in improving test-time performance. Building on this, our study\ninvestigates the interplay between sharpness and diversity within deep\nensembles, illustrating their crucial role in robust generalization to both\nin-distribution (ID) and out-of-distribution (OOD) data. We discover a\ntrade-off between sharpness and diversity: minimizing the sharpness in the loss\nlandscape tends to diminish the diversity of individual members within the\nensemble, adversely affecting the ensemble's improvement. The trade-off is\njustified through our theoretical analysis and verified empirically through\nextensive experiments. To address the issue of reduced diversity, we introduce\nSharpBalance, a novel training approach that balances sharpness and diversity\nwithin ensembles. Theoretically, we show that our training strategy achieves a\nbetter sharpness-diversity trade-off. Empirically, we conducted comprehensive\nevaluations in various data sets (CIFAR-10, CIFAR-100, TinyImageNet) and showed\nthat SharpBalance not only effectively improves the sharpness-diversity\ntrade-off, but also significantly improves ensemble performance in ID and OOD\nscenarios.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}