{"id":"2407.01641","title":"NeurIPS 2024 ML4CFD Competition: Harnessing Machine Learning for\n  Computational Fluid Dynamics in Airfoil Design","authors":"Mouadh Yagoubi, David Danan, Milad Leyli-abadi, Jean-Patrick Brunet,\n  Jocelyn Ahmed Mazari, Florent Bonnet, maroua gmati, Asma Farjallah, Paola\n  Cinnella, Patrick Gallinari, Marc Schoenauer","authorsParsed":[["Yagoubi","Mouadh",""],["Danan","David",""],["Leyli-abadi","Milad",""],["Brunet","Jean-Patrick",""],["Mazari","Jocelyn Ahmed",""],["Bonnet","Florent",""],["gmati","maroua",""],["Farjallah","Asma",""],["Cinnella","Paola",""],["Gallinari","Patrick",""],["Schoenauer","Marc",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 21:48:38 GMT"}],"updateDate":"2024-07-03","timestamp":1719784118000,"abstract":"  The integration of machine learning (ML) techniques for addressing intricate\nphysics problems is increasingly recognized as a promising avenue for\nexpediting simulations. However, assessing ML-derived physical models poses a\nsignificant challenge for their adoption within industrial contexts. This\ncompetition is designed to promote the development of innovative ML approaches\nfor tackling physical challenges, leveraging our recently introduced unified\nevaluation framework known as Learning Industrial Physical Simulations (LIPS).\nBuilding upon the preliminary edition held from November 2023 to March 2024,\nthis iteration centers on a task fundamental to a well-established physical\napplication: airfoil design simulation, utilizing our proposed AirfRANS\ndataset. The competition evaluates solutions based on various criteria\nencompassing ML accuracy, computational efficiency, Out-Of-Distribution\nperformance, and adherence to physical principles. Notably, this competition\nrepresents a pioneering effort in exploring ML-driven surrogate methods aimed\nat optimizing the trade-off between computational efficiency and accuracy in\nphysical simulations. Hosted on the Codabench platform, the competition offers\nonline training and evaluation for all participating solutions.\n","subjects":["Physics/Fluid Dynamics","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xNqYqGr6XIOayryTG6LfG_w8EvohVfdjdFiO4ATp3yI","pdfSize":"12845853"}
