{"id":"2407.21302","title":"The possible coexistence of superconductivity and topological electronic\n  states in 1T-RhSeTe","authors":"Tengdong Zhang, Rui Fan, Yan Gao, Yanling Wu, Xiaodan Xu, Dao-Xin Yao,\n  and Jun Li","authorsParsed":[["Zhang","Tengdong",""],["Fan","Rui",""],["Gao","Yan",""],["Wu","Yanling",""],["Xu","Xiaodan",""],["Yao","Dao-Xin",""],["Li","Jun",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 03:05:32 GMT"}],"updateDate":"2024-08-01","timestamp":1722395132000,"abstract":"  Transition metal dichalcogenides (TMDs), exhibit a range of crystal\nstructures and topological quantum states. The 1$T$ phase, in particular, shows\npromise for superconductivity driven by electron-phonon coupling, strain,\npressure, and chemical doping. In this theoretical investigation, we explore\n1$T$-RhSeTe as a novel type of TMD superconductor with topological electronic\nstates. The optimal doping structure and atomic arrangement of 1$T$-RhSeTe are\nconstructed. Phonon calculations validate the integrity of the constructed\ndoping structure. The analysis of the electron-phonon coupling (EPC) using the\nElectron-phonon Wannier (EPW) method has confirmed the existence of a robust\nelectron-phonon interaction in 1$T$-RhSeTe, resulting in total EPC constant\n$\\lambda$ = 2.02, the logarithmic average frequency $\\omega_{\\text{log}}$ =\n3.15 meV and $T_c$ = 4.61 K, consistent with experimental measurements and\nindicative of its classification as a BCS superconductor. The band structure\nanalysis revealed the presence of Dirac-like band crossing points. The\ntopological non-trivial electronic structures of the 1$T$-RhSeTe are confirmed\nvia the evolution of Wannier charge centers (WCCs). Collectively, these\ndistinctive properties underscore 1$T$-RhSeTe as a possible candidate for a\ntopological superconductor, warranting further investigation into its potential\nimplications and applications.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/"}