{"id":"2407.17180","title":"Massive Quiescent Disk Galaxies at $0.5\\ {\\leq}\\ z\\ {\\leq}\\ 1$ in\n  CANDELS : Color Gradients and Likely Origin","authors":"Qifan Cui, Pinsong Zhao, Fengshan Liu","authorsParsed":[["Cui","Qifan",""],["Zhao","Pinsong",""],["Liu","Fengshan",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 11:28:54 GMT"}],"updateDate":"2024-07-25","timestamp":1721820534000,"abstract":"  A rare population of massive disk-dominated quiescent galaxies has recently\ndrawn much attention, which intrudes the red sequence population without\ndestroying the underlying stellar disks. In this study, we have carefully\nidentified 48 red sequence (RS), disk-dominated galaxies with $M_{\\ast} >\n10^{10}M_{\\odot}$ between redshift 0.5 and 1.0 in all five CANDELS fields.\nThese galaxies are well fitted by a two-component bulge plus disk model, and\nhave the bulge-to-total ratio $B/T<0.4$ in the both F814W and F160W bands. The\nfitting results indicate that these galaxies generally have extended stellar\ndisks ($\\rm \\sim 3~kpc$ on average) and tiny bulge components ($\\rm \\sim\n0.5~kpc$ on average). To understand their possible origins, we have also\nselected two control samples of 156 green valley (GV) and 309 blue cloud (BC)\ndisk-dominated galaxies according to the same selection criteria. We study the\n$UVI$($U-V$ versus $V-I$) color gradients of these galaxies to infer their\nspecific star formation rate (sSFR) gradients out to the maximum acceptable\nradii. We show that on average the disks in disk-dominated RS galaxies are\nfully quenched at all radii, whereas both the BC and GV disks are not fully\nquenched at any radii. We find that all the BC, GV and RS disk galaxies\ngenerally have nearly flat sSFR profiles. We propose a potential formation\nmechanism, acknowledging that various other mechanisms (e.g., central\ncompaction and AGN feedback) might contribute, where massive quiescent\ndisk-dominated galaxies are predominantly formed via a process of secular disk\nfading.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}