{"id":"2407.12011","title":"Digital Twinning of a Pressurized Water Reactor Startup Operation and\n  Partial Computational Offloading in In-network Computing-Assisted Multiaccess\n  Edge Computing","authors":"Ibrahim Aliyu, Awwal M. Arigi, Tai-Won Um, and Jinsul Kim","authorsParsed":[["Aliyu","Ibrahim",""],["Arigi","Awwal M.",""],["Um","Tai-Won",""],["Kim","Jinsul",""]],"versions":[{"version":"v1","created":"Mon, 24 Jun 2024 10:13:00 GMT"}],"updateDate":"2024-07-18","timestamp":1719223980000,"abstract":"  This paper addresses the challenge of representing complex human action (HA)\nin a nuclear power plant (NPP) digital twin (DT) and minimizing latency in\npartial computation offloading (PCO) in sixth-generation-enabled computing in\nthe network (COIN) assisted multiaccess edge computing (MEC). Accurate HA\nrepresentation in the DT-HA model is vital for modeling human interventions\nthat are crucial for the safe and efficient operation of NPPs. In this context,\nDT-enabled COIN-assisted MEC harnesses DT (known as a cybertwin) capabilities\nto optimize resource allocation and reduce latency effectively. A two-stage\napproach is employed to address system complexity. First, a probabilistic\ngraphical model (PGM) is introduced to capture HAs in the DT abstraction. In\nthe PGM, HA and NPP asset-twin abstractions form coupled systems that evolve\nand interact through observable data and control input. Next, the underlying\nPCO problem is formulated as a multiuser game, where NPP assets can partially\noffload tasks to COIN and MEC. We propose a decentralized algorithm to optimize\noffloading decisions, offloading ratios, and resource allocation. The\nsimulation results demonstrate the effectiveness of the proposed method in\ncapturing complex HAs and optimal resource allocation in DT-enabled NPPs.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}