{"id":"2407.08161","title":"Optimal Sparsity in Nonlinear Non-Parametric Reduced Order Models for\n  Transonic Aeroelastic Systems","authors":"Michael Candon, Errol Hale, Maciej Balajewicz, Arturo\n  Delgado-Gutierrez, Pier Marzocca","authorsParsed":[["Candon","Michael",""],["Hale","Errol",""],["Balajewicz","Maciej",""],["Delgado-Gutierrez","Arturo",""],["Marzocca","Pier",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 03:41:31 GMT"}],"updateDate":"2024-07-12","timestamp":1720669291000,"abstract":"  Machine learning and artificial intelligence algorithms typically require\nlarge amount of data for training. This means that for nonlinear aeroelastic\napplications, where small training budgets are driven by the high computational\nburden associated with generating data, usability of such methods has been\nlimited to highly simplified aeroelastic systems. This paper presents a novel\napproach for the identification of optimized sparse higher-order\npolynomial-based aeroelastic reduced order models (ROM) to significantly reduce\nthe amount of training data needed without sacrificing fidelity. Several\nsparsity promoting algorithms are considered, including; rigid sparsity, LASSO\nregression, and Orthogonal Matching Pursuit (OMP). The study demonstrates that\nthrough OMP, it is possible to efficiently identify optimized s-sparse\nnonlinear aerodynamic ROMs using only aerodynamic response information. This\napproach is exemplified in a three-dimensional aeroelastic stabilator model\nexperiencing high amplitude freeplay-induced limit cycles. The comparison shows\nexcellent agreement between the ROM and the full-order aeroelastic response,\nincluding the ability to generalize to new freeplay and velocity index values,\nwith online computational savings of several orders of magnitude. The\ndevelopment of an Optimally Sparse ROM (OS-ROM) extends previous higher-order\npolynomial-based ROM approaches for feasible application to complex\nthree-dimensional nonlinear aeroelastic problems, without incurring significant\ncomputational burdens or loss of accuracy.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}