{"id":"2407.15270","title":"MedEdit: Counterfactual Diffusion-based Image Editing on Brain MRI","authors":"Malek Ben Alaya, Daniel M. Lang, Benedikt Wiestler, Julia A. Schnabel,\n  Cosmin I. Bercea","authorsParsed":[["Alaya","Malek Ben",""],["Lang","Daniel M.",""],["Wiestler","Benedikt",""],["Schnabel","Julia A.",""],["Bercea","Cosmin I.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 21:19:09 GMT"}],"updateDate":"2024-07-23","timestamp":1721596749000,"abstract":"  Denoising diffusion probabilistic models enable high-fidelity image synthesis\nand editing. In biomedicine, these models facilitate counterfactual image\nediting, producing pairs of images where one is edited to simulate hypothetical\nconditions. For example, they can model the progression of specific diseases,\nsuch as stroke lesions. However, current image editing techniques often fail to\ngenerate realistic biomedical counterfactuals, either by inadequately modeling\nindirect pathological effects like brain atrophy or by excessively altering the\nscan, which disrupts correspondence to the original images. Here, we propose\nMedEdit, a conditional diffusion model for medical image editing. MedEdit\ninduces pathology in specific areas while balancing the modeling of disease\neffects and preserving the integrity of the original scan. We evaluated MedEdit\non the Atlas v2.0 stroke dataset using Frechet Inception Distance and Dice\nscores, outperforming state-of-the-art diffusion-based methods such as Palette\n(by 45%) and SDEdit (by 61%). Additionally, clinical evaluations by a\nboard-certified neuroradiologist confirmed that MedEdit generated realistic\nstroke scans indistinguishable from real ones. We believe this work will enable\ncounterfactual image editing research to further advance the development of\nrealistic and clinically useful imaging tools.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}