{"id":"2407.19589","title":"MX precipitate behavior in an irradiated advanced Fe-9Cr steel: Helium\n  effects on phase stability","authors":"T.M. Kelsy Green, Tim Graening, Weicheng Zhong, Ying Yang, and Kevin\n  G. Field","authorsParsed":[["Green","T. M. Kelsy",""],["Graening","Tim",""],["Zhong","Weicheng",""],["Yang","Ying",""],["Field","Kevin G.",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 21:17:37 GMT"}],"updateDate":"2024-07-30","timestamp":1722201457000,"abstract":"  Precipitates are main microstructural features to provide high temperature\ncreep strength and radiation resistance in structural materials for fusion\nenergy systems. However, the mechanisms of precipitate stability under\nirradiation in candidate structural materials for fusion first-wall and blanket\ncomponents are poorly understood. In particular, the dual effects of helium\ntransmutation and irradiation-induced damage on precipitate evolution have not\nbeen systematically studied in candidate materials, the leading of which are\nFe-9Cr reduced activation ferritic/martensitic (RAFM) alloys. To fill this\nknowledge gap, a fundamental understanding of the single and combined\ninteractions of helium (0-25 appm He/dpa), temperature (300-600C), and atomic\ndisplacements (15-100 dpa) on the behavior of MX (M=metal, X=C and/or N)\nprecipitates in an advanced Fe-9Cr RAFM alloy were studied through the use of\ndual ion irradiation experiments. It was found that helium suppressed the\ndiffusion-mediated mechanisms of precipitate stability (i.e. radiation-enhanced\ngrowth) at elevated temperatures and intermediate damage levels but had no\neffect on precipitate dissolution in the high dose conditions (>50 dpa). A\nprecipitate stability model was used to rationalize the impacts of helium on\nballistic dissolution and radiation-enhanced diffusion which are key\ncontributors to overall precipitate stability. This is the second paper in a\nseries of three to provide a systematic evaluation of MX precipitate behavior\nin RAFM steels under various fusion-relevant ion irradiation conditions.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}