{"id":"2407.17882","title":"Artificial Immunofluorescence in a Flash: Rapid Synthetic Imaging from\n  Brightfield Through Residual Diffusion","authors":"Xiaodan Xing, Chunling Tang, Siofra Murdoch, Giorgos Papanastasiou,\n  Yunzhe Guo, Xianglu Xiao, Jan Cross-Zamirski, Carola-Bibiane Sch\\\"onlieb,\n  Kristina Xiao Liang, Zhangming Niu, Evandro Fei Fang, Yinhai Wang, Guang Yang","authorsParsed":[["Xing","Xiaodan",""],["Tang","Chunling",""],["Murdoch","Siofra",""],["Papanastasiou","Giorgos",""],["Guo","Yunzhe",""],["Xiao","Xianglu",""],["Cross-Zamirski","Jan",""],["Schönlieb","Carola-Bibiane",""],["Liang","Kristina Xiao",""],["Niu","Zhangming",""],["Fang","Evandro Fei",""],["Wang","Yinhai",""],["Yang","Guang",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 08:54:41 GMT"}],"updateDate":"2024-07-26","timestamp":1721897681000,"abstract":"  Immunofluorescent (IF) imaging is crucial for visualizing biomarker\nexpressions, cell morphology and assessing the effects of drug treatments on\nsub-cellular components. IF imaging needs extra staining process and often\nrequiring cell fixation, therefore it may also introduce artefects and alter\nendogenouous cell morphology. Some IF stains are expensive or not readily\navailable hence hindering experiments. Recent diffusion models, which\nsynthesise high-fidelity IF images from easy-to-acquire brightfield (BF)\nimages, offer a promising solution but are hindered by training instability and\nslow inference times due to the noise diffusion process. This paper presents a\nnovel method for the conditional synthesis of IF images directly from BF images\nalong with cell segmentation masks. Our approach employs a Residual Diffusion\nprocess that enhances stability and significantly reduces inference time. We\nperformed a critical evaluation against other image-to-image synthesis models,\nincluding UNets, GANs, and advanced diffusion models. Our model demonstrates\nsignificant improvements in image quality (p<0.05 in MSE, PSNR, and SSIM),\ninference speed (26 times faster than competing diffusion models), and accurate\nsegmentation results for both nuclei and cell bodies (0.77 and 0.63 mean IOU\nfor nuclei and cell true positives, respectively). This paper is a substantial\nadvancement in the field, providing robust and efficient tools for cell image\nanalysis.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"o7pZMNuopA8ry3ZE2mXYFWFwl3PjBADu6wJVUrz7bDE","pdfSize":"10102137"}
