{"id":"2407.20249","title":"Revisiting the Disequilibrium Issues in Tackling Heart Disease\n  Classification Tasks","authors":"Thao Hoang, Linh Nguyen, Khoi Do, Duong Nguyen, and Viet Dung Nguyen","authorsParsed":[["Hoang","Thao",""],["Nguyen","Linh",""],["Do","Khoi",""],["Nguyen","Duong",""],["Nguyen","Viet Dung",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 09:50:49 GMT"}],"updateDate":"2024-07-31","timestamp":1721382649000,"abstract":"  In the field of heart disease classification, two primary obstacles arise.\nFirstly, existing Electrocardiogram (ECG) datasets consistently demonstrate\nimbalances and biases across various modalities. Secondly, these time-series\ndata consist of diverse lead signals, causing Convolutional Neural Networks\n(CNNs) to become overfitting to the one with higher power, hence diminishing\nthe performance of the Deep Learning (DL) process. In addition, when facing an\nimbalanced dataset, performance from such high-dimensional data may be\nsusceptible to overfitting. Current efforts predominantly focus on enhancing DL\nmodels by designing novel architectures, despite these evident challenges,\nseemingly overlooking the core issues, therefore hindering advancements in\nheart disease classification. To address these obstacles, our proposed approach\nintroduces two straightforward and direct methods to enhance the classification\ntasks. To address the high dimensionality issue, we employ a Channel-wise\nMagnitude Equalizer (CME) on signal-encoded images. This approach reduces\nredundancy in the feature data range, highlighting changes in the dataset.\nSimultaneously, to counteract data imbalance, we propose the Inverted Weight\nLogarithmic Loss (IWL) to alleviate imbalances among the data. When applying\nIWL loss, the accuracy of state-of-the-art models (SOTA) increases up to 5% in\nthe CPSC2018 dataset. CME in combination with IWL also surpasses the\nclassification results of other baseline models from 5% to 10%.\n","subjects":["Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}