{"id":"2407.04782","title":"Metals in Star-Forming Galaxies with KCWI. I. Methodology and First\n  Results on the Abundances of Iron, Magnesium, and Oxygen","authors":"Zhuyun Zhuang, Evan N. Kirby, Charles C. Steidel, Mithi A.C. de los\n  Reyes, Nikolaus Z. Prusinski, N. Leethochawalit, Minjung Park, Charlie\n  Conroy, and Evan H. Nu\\~nez","authorsParsed":[["Zhuang","Zhuyun",""],["Kirby","Evan N.",""],["Steidel","Charles C.",""],["Reyes","Mithi A. C. de los",""],["Prusinski","Nikolaus Z.",""],["Leethochawalit","N.",""],["Park","Minjung",""],["Conroy","Charlie",""],["Nuñez","Evan H.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 18:00:08 GMT"}],"updateDate":"2024-07-09","timestamp":1720202408000,"abstract":"  Understanding the chemical enrichment of different elements is crucial to\ngaining a complete picture of galaxy chemical evolution. In this study, we\npresent a new sample of 46 low-redshift, low-mass star-forming galaxies at\n$M_*\\sim 10^{8-10}M_{\\odot}$ along with two quiescent galaxies at $M_*\\sim\n10^{8.8}M_{\\odot}$ observed with the Keck Cosmic Web Imager (KCWI), aiming to\ninvestigate the chemical evolution of galaxies in the transition zone between\nLocal Group satellites and massive field galaxies. We develop a novel method to\nsimultaneously determine stellar abundances of iron and magnesium in\nstar-forming galaxies. With the gas-phase oxygen abundance (O/H)$_{\\rm g}$\nmeasured using the strong line method, we are able to make the first-ever\napples-to-apples comparison of $\\alpha$ elements in the stars and the ISM. We\nfind that the [Mg/H]$_*$-[O/H]$_{\\rm g}$ relation is much tighter than the\n[Fe/H]$_*$-[O/H]$_{\\rm g}$ relation, which can be explained by the similar\nproduction processes of $\\alpha$ elements. Most galaxies in our sample exhibit\nhigher [O/H]$_{\\rm g}$ than [Fe/H]$_*$ and [Mg/H]$_*$. In addition, we\nconstruct mass-metallicity relations (MZRs) measured as three different\nelements (Fe$_*$, Mg$_*$, O$_{\\rm g}$). Compared to the gas O-MZR, the stellar\nFe- and Mg-MZRs show larger scatter driven by variations in specific star\nformation rates (sSFR), with star-forming galaxies exhibiting higher sSFR and\nlower stellar abundances at fixed mass. The excess of [O/H]$_{\\rm g}$ compared\nto stellar abundances as well as the anti-correlation between sSFR and stellar\nabundance suggests that galaxy quenching of intermediate-mass galaxies at\n$M_*\\sim 10^{8-10}M_{\\odot}$ is primarily driven by starvation.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}