{"id":"2407.18988","title":"Fluid-Antenna Enhanced ISAC: Joint Antenna Positioning and\n  Dual-Functional Beamforming Design under Perfect and Imperfect CSI","authors":"Tian Hao, Changxin Shi, Qingqing Wu, Bin Xia, Yinghong Guo, Lianghui\n  Ding, and Feng Yang","authorsParsed":[["Hao","Tian",""],["Shi","Changxin",""],["Wu","Qingqing",""],["Xia","Bin",""],["Guo","Yinghong",""],["Ding","Lianghui",""],["Yang","Feng",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 07:55:01 GMT"}],"updateDate":"2024-07-30","timestamp":1721894101000,"abstract":"  Integrated sensing and communication (ISAC) emerges as an essential technique\nfor overcoming spectrum congestion. However, the performance of traditional\nISAC systems with fixed-position-antennas (FPA) is limited due to insufficient\nspatial degree of freedom (DoF) exploration. Recently, fluid antenna (FA) with\nreconfigurable antenna position is developed to enhance the sensing and\ncommunication performance by reshaping the channel. This paper investigates an\nFA-enhanced ISAC system where a base station is equipped with multiple FAs to\ncommunicate with multiple single-antenna users and with FPAs to sense a point\ntarget. In this paper, we consider both perfect and imperfect channel state\ninformation (CSI) of the communication channel and sensing channel. In two\ncases, we focus on the maximization of the sensing signal-to-noise (SNR) by\noptimizing the positions of FAs and the dual-functional beamforming under the\nconstraints of the FA moving region, the minimum FA distance and the minimum\nsignal-to-interference-plus-noise (SINR) per user. Specifically, for the ideal\ncase of perfect CSI, an iterative alternating optimization (AO) algorithm is\nproposed to tackle the formulated problem where the dual-functional beamforming\nand the FA positions are obtained via semidefinite relaxation (SDR) and\nsuccessive convex approximation (SCA) techniques. Then, for the imperfect CSI\ncase, we propose an AO-based iterative algorithm where $\\mathcal{S}-$Procedure\nand SCA are applied to obtain the dual-functional beamforming and the FA\npositions. Furthermore, we analytically and numerically prove the convergence\nof the proposed algorithms. Numerical results demonstrate the notable gains of\nthe proposed algorithms in the respective cases.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}