{"id":"2407.04180","title":"Slice-100K: A Multimodal Dataset for Extrusion-based 3D Printing","authors":"Anushrut Jignasu, Kelly O. Marshall, Ankush Kumar Mishra, Lucas Nerone\n  Rillo, Baskar Ganapathysubramanian, Aditya Balu, Chinmay Hegde, Adarsh\n  Krishnamurthy","authorsParsed":[["Jignasu","Anushrut",""],["Marshall","Kelly O.",""],["Mishra","Ankush Kumar",""],["Rillo","Lucas Nerone",""],["Ganapathysubramanian","Baskar",""],["Balu","Aditya",""],["Hegde","Chinmay",""],["Krishnamurthy","Adarsh",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 22:52:25 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 04:23:35 GMT"}],"updateDate":"2024-07-12","timestamp":1720133545000,"abstract":"  G-code (Geometric code) or RS-274 is the most widely used computer numerical\ncontrol (CNC) and 3D printing programming language. G-code provides machine\ninstructions for the movement of the 3D printer, especially for the nozzle,\nstage, and extrusion of material for extrusion-based additive manufacturing.\nCurrently there does not exist a large repository of curated CAD models along\nwith their corresponding G-code files for additive manufacturing. To address\nthis issue, we present SLICE-100K, a first-of-its-kind dataset of over 100,000\nG-code files, along with their tessellated CAD model, LVIS (Large Vocabulary\nInstance Segmentation) categories, geometric properties, and renderings. We\nbuild our dataset from triangulated meshes derived from Objaverse-XL and\nThingi10K datasets. We demonstrate the utility of this dataset by finetuning\nGPT-2 on a subset of the dataset for G-code translation from a legacy G-code\nformat (Sailfish) to a more modern, widely used format (Marlin). SLICE-100K\nwill be the first step in developing a multimodal foundation model for digital\nmanufacturing.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"B-LYHbi1ShvGGE1f2yPSoMWTHzQo0F8vGRlH5tHsUn0","pdfSize":"3921356"}
