{"id":"2407.16867","title":"From Text to Insight: Large Language Models for Materials Science Data\n  Extraction","authors":"Mara Schilling-Wilhelmi, Marti\\~no R\\'ios-Garc\\'ia, Sherjeel Shabih,\n  Mar\\'ia Victoria Gil, Santiago Miret, Christoph T. Koch, Jos\\'e A. M\\'arquez,\n  Kevin Maik Jablonka","authorsParsed":[["Schilling-Wilhelmi","Mara",""],["Ríos-García","Martiño",""],["Shabih","Sherjeel",""],["Gil","María Victoria",""],["Miret","Santiago",""],["Koch","Christoph T.",""],["Márquez","José A.",""],["Jablonka","Kevin Maik",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 22:23:47 GMT"}],"updateDate":"2024-07-25","timestamp":1721773427000,"abstract":"  The vast majority of materials science knowledge exists in unstructured\nnatural language, yet structured data is crucial for innovative and systematic\nmaterials design. Traditionally, the field has relied on manual curation and\npartial automation for data extraction for specific use cases. The advent of\nlarge language models (LLMs) represents a significant shift, potentially\nenabling efficient extraction of structured, actionable data from unstructured\ntext by non-experts. While applying LLMs to materials science data extraction\npresents unique challenges, domain knowledge offers opportunities to guide and\nvalidate LLM outputs. This review provides a comprehensive overview of\nLLM-based structured data extraction in materials science, synthesizing current\nknowledge and outlining future directions. We address the lack of standardized\nguidelines and present frameworks for leveraging the synergy between LLMs and\nmaterials science expertise. This work serves as a foundational resource for\nresearchers aiming to harness LLMs for data-driven materials research. The\ninsights presented here could significantly enhance how researchers across\ndisciplines access and utilize scientific information, potentially accelerating\nthe development of novel materials for critical societal needs.\n","subjects":["Condensed Matter/Materials Science","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}