{"id":"2407.18551","title":"Multi-Agent Trajectory Prediction with Difficulty-Guided Feature\n  Enhancement Network","authors":"Guipeng Xin, Duanfeng Chu, Liping Lu, Zejian Deng, Yuang Lu and Xigang\n  Wu","authorsParsed":[["Xin","Guipeng",""],["Chu","Duanfeng",""],["Lu","Liping",""],["Deng","Zejian",""],["Lu","Yuang",""],["Wu","Xigang",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 07:04:30 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 03:24:57 GMT"}],"updateDate":"2024-07-30","timestamp":1721977470000,"abstract":"  Trajectory prediction is crucial for autonomous driving as it aims to\nforecast the future movements of traffic participants. Traditional methods\nusually perform holistic inference on the trajectories of agents, neglecting\nthe differences in prediction difficulty among agents. This paper proposes a\nnovel Difficulty-Guided Feature Enhancement Network (DGFNet), which leverages\nthe prediction difficulty differences among agents for multi-agent trajectory\nprediction. Firstly, we employ spatio-temporal feature encoding and interaction\nto capture rich spatio-temporal features. Secondly, a difficulty-guided decoder\nis used to control the flow of future trajectories into subsequent modules,\nobtaining reliable future trajectories. Then, feature interaction and fusion\nare performed through the future feature interaction module. Finally, the fused\nagent features are fed into the final predictor to generate the predicted\ntrajectory distributions for multiple participants. Experimental results\ndemonstrate that our DGFNet achieves state-of-the-art performance on the\nArgoverse 1\\&2 motion forecasting benchmarks. Ablation studies further validate\nthe effectiveness of each module. Moreover, compared with SOTA methods, our\nmethod balances trajectory prediction accuracy and real-time inference speed.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}