{"id":"2407.20819","title":"Design and inference for multi-arm clinical trials with informational\n  borrowing: the interacting urns design","authors":"Giacomo Aletti, Alessandro Baldi Antognini, Irene Crimaldi, Rosamarie\n  Frieri and Andrea Ghiglietti","authorsParsed":[["Aletti","Giacomo",""],["Antognini","Alessandro Baldi",""],["Crimaldi","Irene",""],["Frieri","Rosamarie",""],["Ghiglietti","Andrea",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 13:33:56 GMT"}],"updateDate":"2024-07-31","timestamp":1722346436000,"abstract":"  This paper deals with a new design methodology for stratified comparative\nexperiments based on interacting reinforced urn systems. The key idea is to\nmodel the interaction between urns for borrowing information across strata and\nto use it in the design phase in order to i) enhance the information exchange\nat the beginning of the study, when only few subjects have been enrolled and\nthe stratum-specific information on treatments' efficacy could be scarce, ii)\nlet the information sharing adaptively evolves via a reinforcement mechanism\nbased on the observed outcomes, for skewing at each step the allocations\ntowards the stratum-specific most promising treatment and iii) make the\ncontribution of the strata with different treatment efficacy vanishing as the\nstratum information grows. In particular, we introduce the Interacting Urns\nDesign, namely a new Covariate-Adjusted Response-Adaptive procedure, that\nrandomizes the treatment allocations according to the evolution of the urn\nsystem. The theoretical properties of this proposal are described and the\ncorresponding asymptotic inference is provided. Moreover, by a functional\ncentral limit theorem, we obtain the asymptotic joint distribution of the\nWald-type sequential test statistics, which allows to sequentially monitor the\nsuggested design in the clinical practice.\n","subjects":["Statistics/Methodology","Mathematics/Probability","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"CkSR2rp6vEyg26gUTtJ2EQbjRKmPPMzGwXUyV5cfJjg","pdfSize":"1592823"}
