{"id":"2407.02325","title":"Phase transitions in TGFT: Landau-Ginzburg analysis of the causally\n  complete Lorentzian Barrett-Crane model","authors":"Roukaya Dekhil, Alexander F. Jercher, Andreas G. A. Pithis","authorsParsed":[["Dekhil","Roukaya",""],["Jercher","Alexander F.",""],["Pithis","Andreas G. A.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 14:53:34 GMT"}],"updateDate":"2024-07-04","timestamp":1719932014000,"abstract":"  It is expected that continuum spacetime emerges via phase transition in the\ntensorial group field theory (TGFT) approach to quantum gravity. Recent work on\nthe application of Landau-Ginzburg mean-field theory to progressively realistic\nTGFT models has demonstrated how phase transitions can be realized therein.\nHere, we further develop this setting and consider the causally complete\nLorentzian Barrett-Crane (BC) model which includes not only spacelike but also\ntimelike and lightlike tetrahedra as quantum geometric building blocks. In\naddition, we incorporate discretized scalar fields by $\\mathbb{R}$-valued\nvariables of the group fields. In this context, we analyze models with an\narbitrary single interaction of simplicial and tensor-invariant type, extend it\nto the model with the two vertices well-known from causal dynamical\ntriangulations, and also consider a model with colored simplicial interactions.\nAs a main result, we demonstrate for all those cases that a mean-field\napproximation of a phase transition towards a non-trivial condensate state can\nalways be realized. In particular, we show that the critical behavior is\nentirely driven by spacelike faces which are characterized by the boost part of\nthe Lorentz group. The latter induces an exponential suppression of\nfluctuations which then stabilizes the mean-field vacuum. In contrast, timelike\nfaces do not play a role in this as they are characterized by the rotational\nand thus compact part of the Lorentz group. Since such a state is typically\npopulated by a large number of TGFT quanta, our work lends further considerable\nsupport to the existence of a sensible continuum gravitational regime for\ncausally complete TGFT models. Our results also indirectly strengthen the\nderivation of effective cosmological dynamics and the recently improved study\nof scalar cosmological perturbations within a mean-field approximation.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}