{"id":"2407.18486","title":"Establishing HI mass v.s. stellar mass and halo mass scaling relations\n  using an abundance matching method","authors":"Yi Lu, Xiaohu Yang, Chengze Liu, Haojie Xu, Antonios Katsianis, Hong\n  Guo, Xiaoju Xu, and Yizhou Gu","authorsParsed":[["Lu","Yi",""],["Yang","Xiaohu",""],["Liu","Chengze",""],["Xu","Haojie",""],["Katsianis","Antonios",""],["Guo","Hong",""],["Xu","Xiaoju",""],["Gu","Yizhou",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 03:33:58 GMT"}],"updateDate":"2024-07-29","timestamp":1721964838000,"abstract":"  We combined data from the Sloan Digital Sky Survey (SDSS) and the Arecibo\nLegacy Fast ALFA Survey (ALFALFA) to establish the HI mass vs. stellar mass and\nhalo mass scaling relations using an abundance matching method that is free of\nthe Malmquist bias. To enable abundance matching, a cross-match between the\nSDSS DR7 galaxy group sample and the ALFALFA HI sources provides a catalog of\n16,520 HI-galaxy pairs within 14,270 galaxy groups (halos). By applying the\nobservational completeness reductions for both optical and HI observations, we\nused the remaining 8,180 ALFALFA matched sources to construct the model\nconstraints. Taking into account the dependence of HI mass on both the galaxy\nand group properties, we establish two sets of scaling relations: one with a\ncombination of stellar mass, $({g-r})$ color and halo mass, and the other with\nstellar mass, specific star-formation rate ($\\rm sSFR$), and halo mass. We\ndemonstrate that our models can reproduce the HI mass component as both a\nstellar and halo mass. Additional tests showed that the conditional HI mass\ndistributions as a function of the cosmic web type and the satellite fractions\nwere well recovered.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"IebtYUjoyRMG1mSZL3U9LJghrXrVF2fltDuTHvX2lgw","pdfSize":"5840926"}
