{"id":"2407.13491","title":"Performance Analysis and Low-Complexity Beamforming Design for\n  Near-Field Physical Layer Security","authors":"Yunpu Zhang, Yuan Fang, Xianghao Yu, Changsheng You, Ying-Jun Angela\n  Zhang","authorsParsed":[["Zhang","Yunpu",""],["Fang","Yuan",""],["Yu","Xianghao",""],["You","Changsheng",""],["Zhang","Ying-Jun Angela",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 13:18:14 GMT"}],"updateDate":"2024-07-22","timestamp":1721308694000,"abstract":"  Extremely large-scale arrays (XL-arrays) have emerged as a key enabler in\nachieving the unprecedented performance requirements of future wireless\nnetworks, leading to a significant increase in the range of the near-field\nregion. This transition necessitates the spherical wavefront model for\ncharacterizing the wireless propagation rather than the far-field planar\ncounterpart, thereby introducing extra degrees of freedom (DoFs) to wireless\nsystem design. In this paper, we explore the beam focusing-based physical layer\nsecurity (PLS) in the near field, where multiple legitimate users and one\neavesdropper are situated in the near-field region of the XL-array base station\n(BS). First, we consider a special case with one legitimate user and one\neavesdropper to shed useful insights into near-field PLS. In particular, it is\nshown that 1) Artificial noise (AN) is crucial to near-field security\nprovisioning, transforming an insecure system to a secure one; 2) AN can yield\nnumerous security gains, which considerably enhances PLS in the near field as\ncompared to the case without AN taken into account. Next, for the general case\nwith multiple legitimate users, we propose an efficient low-complexity approach\nto design the beamforming with AN to guarantee near-field secure transmission.\nSpecifically, the low-complexity approach is conceived starting by introducing\nthe concept of interference domain to capture the inter-user interference\nlevel, followed by a three-step identification framework for designing the\nbeamforming. Finally, numerical results reveal that 1) the PLS enhancement in\nthe near field is pronounced thanks to the additional spatial DoFs; 2) the\nproposed approach can achieve close performance to that of the\ncomputationally-extensive conventional approach yet with a significantly lower\ncomputational complexity.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}