{"id":"2407.15226","title":"Variation Bayesian Interference for Multiple Extended Targets or\n  Unresolved Group Targets Tracking","authors":"Yuanhao Cheng, Yunhe Cao, Tat-Soon Yeo, Yulin Zhang, Fu Jie","authorsParsed":[["Cheng","Yuanhao",""],["Cao","Yunhe",""],["Yeo","Tat-Soon",""],["Zhang","Yulin",""],["Jie","Fu",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 17:24:25 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 08:55:39 GMT"}],"updateDate":"2024-08-07","timestamp":1721582665000,"abstract":"  In this work, we propose a tracking method for multiple extended targets or\nunresolvable group targets based on the Variational Bayesian Inference (VBI).\nFirstly, based on the most commonly used Random Matrix Model (RMM), the joint\nstates of a single target are modeled as a Gamma Gaussian Inverse Wishart\n(GGIW) distribution, and the multi-target joint association variables are\ninvolved in the estimation together as unknown information with a prior\ndistribution. A shape evolution model and VBI are employed to address the\nshortcomings of the RMM. Through the VBI, we can derive the approximate\nvariational posterior for the exact multi-target posterior. Furthermore, to\ndemonstrate the applicability of the method in real-world tracking scenarios,\nwe present two potential lightweight schemes. The first is based on clustering,\nwhich effectively prunes the joint association events. The second is a\nsimplification of the variational posterior through marginal association\nprobabilities. We demonstrate the effectiveness of the proposed method using\nsimulation experiments, and the proposed method outperforms current\nstate-of-the-art methods in terms of accuracy and adaptability. This manuscript\nis only a preprint version, a completer and more official version will be\nuploaded as soon as possible\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}