{"id":"2407.21786","title":"Non-equilibrium dynamics of charged dual-unitary circuits","authors":"Alessandro Foligno, Pasquale Calabrese, and Bruno Bertini","authorsParsed":[["Foligno","Alessandro",""],["Calabrese","Pasquale",""],["Bertini","Bruno",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 17:57:14 GMT"}],"updateDate":"2024-08-01","timestamp":1722448634000,"abstract":"  The interplay between symmetries and entanglement in out-of-equilibrium\nquantum systems is currently at the centre of an intense multidisciplinary\nresearch effort. Here we introduce a setting where these questions can be\ncharacterised exactly by considering dual-unitary circuits with an arbitrary\nnumber of $U(1)$ charges. After providing a complete characterisation of these\nsystems we show that one can introduce a class of solvable states, which\nextends that of generic dual unitary circuits, for which the non-equilibrium\ndynamics can be solved exactly. In contrast to the known class of solvable\nstates, which relax to the infinite temperature state, these states relax to a\nfamily of non-trivial generalised Gibbs ensembles. The relaxation process of\nthese states can be simply described by a linear growth of the entanglement\nentropy followed by saturation to a non-maximal value but with maximal\nentanglement velocity. We then move on to consider the dynamics from\nnon-solvable states, combining exact results with the entanglement membrane\npicture we argue that the entanglement dynamics from these states is\nqualitatively different from that of the solvable ones. It shows two different\ngrowth regimes characterised by two distinct slopes, both corresponding to\nsub-maximal entanglement velocities. Moreover, we show that non-solvable\ninitial states can give rise to the quantum Mpemba effect, where less symmetric\ninitial states restore the symmetry faster than more symmetric ones.\n","subjects":["Condensed Matter/Statistical Mechanics","Physics/High Energy Physics - Theory","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}