{"id":"2407.18385","title":"Combinatorial transfer: a new method for constructing infinite families\n  of nonabelian difference sets, partial difference sets, and relative\n  difference sets","authors":"Eric Swartz, James A. Davis, John Polhill, and Ken W. Smith","authorsParsed":[["Swartz","Eric",""],["Davis","James A.",""],["Polhill","John",""],["Smith","Ken W.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 20:38:00 GMT"}],"updateDate":"2024-07-29","timestamp":1721939880000,"abstract":"  For nearly a century, mathematicians have been developing techniques for\nconstructing abelian automorphism groups of combinatorial objects, and,\nconversely, constructing combinatorial objects from abelian groups. While\nabelian groups are a natural place to start, recent computational evidence\nstrongly indicates that the vast majority of transitive automorphism groups of\ncombinatorial objects are nonabelian. This observation is the guiding\nmotivation for this paper. We propose a new method for constructing nonabelian\nautomorphism groups of combinatorial objects, which could be called the\n\\textit{combinatorial transfer method}, and we demonstrate its power by finding\n(1) the first infinite families of nonabelian Denniston partial difference sets\n(including nonabelian Denniston PDSs of odd order), (2) the first infinite\nfamily of Spence difference sets in groups with a Sylow 3-subgroup that is\nnon-normal and not elementary abelian, (3) the first infinite families of\nMcFarland difference sets in groups with a Sylow $p$-subgroup that is\nnon-normal and is not elementary abelian, (4) new infinite families of partial\ndifference sets in nonabelian $p$-groups with large exponent, (5) an infinite\nfamily of semiregular relative difference sets whose forbidden subgroup is\nnonabelian, and (6) a converse to Dillon's Dihedral Trick in the PDS setting.\nWe hope this paper will lead to more techniques to explore this largely\nunexplored topic.\n","subjects":["Mathematics/Combinatorics","Mathematics/Group Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0uEI947MeRvt2N34cRIojm9vnJ3FuuJUgj82yPD-e4A","pdfSize":"364041"}
