{"id":"2407.20916","title":"Parallel ergotropy: Maximum work extraction via parallel local unitary\n  operations","authors":"Riccardo Castellano, Ranieri Nery, Kyrylo Simonov and Donato Farina","authorsParsed":[["Castellano","Riccardo",""],["Nery","Ranieri",""],["Simonov","Kyrylo",""],["Farina","Donato",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 15:53:04 GMT"}],"updateDate":"2024-07-31","timestamp":1722354784000,"abstract":"  Maximum quantum work extraction is generally defined in terms of the\nergotropy functional, no matter how experimentally complicated is the\nimplementation of the optimal unitary allowing for it, especially in the case\nof multipartite systems. In this framework, we consider a quantum battery made\nup of many interacting sub-systems and study the maximum extractable work via\nconcurrent local unitary operations on each subsystem. We call the resulting\nfunctional parallel ergotropy. Focusing on the bipartite case, we first observe\nthat parallel ergotropy outperforms work extraction via egoistic strategies, in\nwhich the first agent A extracts locally on its part the maximum available work\nand the second agent B, subsequently, extracts what is left on the other part.\nFor the agents, this showcases the need of cooperating for an overall benefit.\nSecondly, from the informational point of view, we observe that the parallel\ncapacity of a state can detect entanglement and compare it with the statistical\nentanglement witness that exploits fluctuations of stochastic work extraction.\nAdditionally, we face the technical problem of computing parallel ergotropy. We\nderive analytical upper bounds for specific classes of states and Hamiltonians\nand provide receipts to obtain numerical upper bounds via semi-definite\nprogramming in the generic case. Finally, extending the concept of parallel\nergotropy, we demonstrate that system's free-time evolution and application of\nlocal unitaries allow one to saturate the gap with the ergotropy of the whole\nsystem.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}