{"id":"2407.02403","title":"Face Reconstruction Transfer Attack as Out-of-Distribution\n  Generalization","authors":"Yoon Gyo Jung, Jaewoo Park, Xingbo Dong, Hojin Park, Andrew Beng Jin\n  Teoh, Octavia Camps","authorsParsed":[["Jung","Yoon Gyo",""],["Park","Jaewoo",""],["Dong","Xingbo",""],["Park","Hojin",""],["Teoh","Andrew Beng Jin",""],["Camps","Octavia",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 16:21:44 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 17:57:52 GMT"}],"updateDate":"2024-09-13","timestamp":1719937304000,"abstract":"  Understanding the vulnerability of face recognition systems to malicious\nattacks is of critical importance. Previous works have focused on\nreconstructing face images that can penetrate a targeted verification system.\nEven in the white-box scenario, however, naively reconstructed images\nmisrepresent the identity information, hence the attacks are easily neutralized\nonce the face system is updated or changed. In this paper, we aim to\nreconstruct face images which are capable of transferring face attacks on\nunseen encoders. We term this problem as Face Reconstruction Transfer Attack\n(FRTA) and show that it can be formulated as an out-of-distribution (OOD)\ngeneralization problem. Inspired by its OOD nature, we propose to solve FRTA by\nAveraged Latent Search and Unsupervised Validation with pseudo target (ALSUV).\nTo strengthen the reconstruction attack on OOD unseen encoders, ALSUV\nreconstructs the face by searching the latent of amortized generator StyleGAN2\nthrough multiple latent optimization, latent optimization trajectory averaging,\nand unsupervised validation with a pseudo target. We demonstrate the efficacy\nand generalization of our method on widely used face datasets, accompanying it\nwith extensive ablation studies and visually, qualitatively, and quantitatively\nanalyses. The source code will be released.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}