{"id":"2407.08883","title":"TractGraphFormer: Anatomically Informed Hybrid Graph CNN-Transformer\n  Network for Classification from Diffusion MRI Tractography","authors":"Yuqian Chen, Fan Zhang, Meng Wang, Leo R. Zekelman, Suheyla\n  Cetin-Karayumak, Tengfei Xue, Chaoyi Zhang, Yang Song, Nikos Makris, Yogesh\n  Rathi, Weidong Cai, Lauren J. O'Donnell","authorsParsed":[["Chen","Yuqian",""],["Zhang","Fan",""],["Wang","Meng",""],["Zekelman","Leo R.",""],["Cetin-Karayumak","Suheyla",""],["Xue","Tengfei",""],["Zhang","Chaoyi",""],["Song","Yang",""],["Makris","Nikos",""],["Rathi","Yogesh",""],["Cai","Weidong",""],["O'Donnell","Lauren J.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 22:14:57 GMT"}],"updateDate":"2024-07-15","timestamp":1720736097000,"abstract":"  The relationship between brain connections and non-imaging phenotypes is\nincreasingly studied using deep neural networks. However, the local and global\nproperties of the brain's white matter networks are often overlooked in\nconvolutional network design. We introduce TractGraphFormer, a hybrid Graph\nCNN-Transformer deep learning framework tailored for diffusion MRI\ntractography. This model leverages local anatomical characteristics and global\nfeature dependencies of white matter structures. The Graph CNN module captures\nwhite matter geometry and grey matter connectivity to aggregate local features\nfrom anatomically similar white matter connections, while the Transformer\nmodule uses self-attention to enhance global information learning.\nAdditionally, TractGraphFormer includes an attention module for interpreting\npredictive white matter connections. In sex prediction tests, TractGraphFormer\nshows strong performance in large datasets of children (n=9345) and young\nadults (n=1065). Overall, our approach suggests that widespread connections in\nthe WM are predictive of the sex of an individual, and consistent predictive\nanatomical tracts are identified across the two datasets. The proposed approach\nhighlights the potential of integrating local anatomical information and global\nfeature dependencies to improve prediction performance in machine learning with\ndiffusion MRI tractography.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}