{"id":"2407.14560","title":"Automated and Holistic Co-design of Neural Networks and ASICs for\n  Enabling In-Pixel Intelligence","authors":"Shubha R. Kharel, Prashansa Mukim, Piotr Maj, Grzegorz W. Deptuch,\n  Shinjae Yoo, Yihui Ren, Soumyajit Mandal","authorsParsed":[["Kharel","Shubha R.",""],["Mukim","Prashansa",""],["Maj","Piotr",""],["Deptuch","Grzegorz W.",""],["Yoo","Shinjae",""],["Ren","Yihui",""],["Mandal","Soumyajit",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:58:05 GMT"}],"updateDate":"2024-07-23","timestamp":1721325485000,"abstract":"  Extreme edge-AI systems, such as those in readout ASICs for radiation\ndetection, must operate under stringent hardware constraints such as\nmicron-level dimensions, sub-milliwatt power, and nanosecond-scale speed while\nproviding clear accuracy advantages over traditional architectures. Finding\nideal solutions means identifying optimal AI and ASIC design choices from a\ndesign space that has explosively expanded during the merger of these domains,\ncreating non-trivial couplings which together act upon a small set of solutions\nas constraints tighten. It is impractical, if not impossible, to manually\ndetermine ideal choices among possibilities that easily exceed billions even in\nsmall-size problems. Existing methods to bridge this gap have leveraged\ntheoretical understanding of hardware to f architecture search. However, the\nassumptions made in computing such theoretical metrics are too idealized to\nprovide sufficient guidance during the difficult search for a practical\nimplementation. Meanwhile, theoretical estimates for many other crucial metrics\n(like delay) do not even exist and are similarly variable, dependent on\nparameters of the process design kit (PDK). To address these challenges, we\npresent a study that employs intelligent search using multi-objective Bayesian\noptimization, integrating both neural network search and ASIC synthesis in the\nloop. This approach provides reliable feedback on the collective impact of all\ncross-domain design choices. We showcase the effectiveness of our approach by\nfinding several Pareto-optimal design choices for effective and efficient\nneural networks that perform real-time feature extraction from input pulses\nwithin the individual pixels of a readout ASIC.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Hardware Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}