{"id":"2407.16729","title":"PateGail: A Privacy-Preserving Mobility Trajectory Generator with\n  Imitation Learning","authors":"Huandong Wang, Changzheng Gao, Yuchen Wu, Depeng Jin, Lina Yao, Yong\n  Li","authorsParsed":[["Wang","Huandong",""],["Gao","Changzheng",""],["Wu","Yuchen",""],["Jin","Depeng",""],["Yao","Lina",""],["Li","Yong",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:59:23 GMT"}],"updateDate":"2024-07-25","timestamp":1721746763000,"abstract":"  Generating human mobility trajectories is of great importance to solve the\nlack of large-scale trajectory data in numerous applications, which is caused\nby privacy concerns. However, existing mobility trajectory generation methods\nstill require real-world human trajectories centrally collected as the training\ndata, where there exists an inescapable risk of privacy leakage. To overcome\nthis limitation, in this paper, we propose PateGail, a privacy-preserving\nimitation learning model to generate mobility trajectories, which utilizes the\npowerful generative adversary imitation learning model to simulate the\ndecision-making process of humans. Further, in order to protect user privacy,\nwe train this model collectively based on decentralized mobility data stored in\nuser devices, where personal discriminators are trained locally to distinguish\nand reward the real and generated human trajectories. In the training process,\nonly the generated trajectories and their rewards obtained based on personal\ndiscriminators are shared between the server and devices, whose privacy is\nfurther preserved by our proposed perturbation mechanisms with theoretical\nproof to satisfy differential privacy. Further, to better model the human\ndecision-making process, we propose a novel aggregation mechanism of the\nrewards obtained from personal discriminators. We theoretically prove that\nunder the reward obtained based on the aggregation mechanism, our proposed\nmodel maximizes the lower bound of the discounted total rewards of users.\nExtensive experiments show that the trajectories generated by our model are\nable to resemble real-world trajectories in terms of five key statistical\nmetrics, outperforming state-of-the-art algorithms by over 48.03%. Furthermore,\nwe demonstrate that the synthetic trajectories are able to efficiently support\npractical applications, including mobility prediction and location\nrecommendation.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}