{"id":"2407.21662","title":"Stable Perovskite Solar Cells via exfoliated graphite as an ion\n  diffusion-blocking layer","authors":"Abdullah S. Alharbi, Miqad S. Albishi, Temur Maksudov, Tariq F.\n  Alhuwaymel, Chrysa Aivalioti, Kadi S. AlShebl, Naif R. Alshamrani, Furkan H.\n  Isikgor, Mubarak Aldosari, Majed M. Aljomah, Konstantinos Petridis, Thomas D.\n  Anthopoulos, George Kakavelakis, Essa A. Alharbi","authorsParsed":[["Alharbi","Abdullah S.",""],["Albishi","Miqad S.",""],["Maksudov","Temur",""],["Alhuwaymel","Tariq F.",""],["Aivalioti","Chrysa",""],["AlShebl","Kadi S.",""],["Alshamrani","Naif R.",""],["Isikgor","Furkan H.",""],["Aldosari","Mubarak",""],["Aljomah","Majed M.",""],["Petridis","Konstantinos",""],["Anthopoulos","Thomas D.",""],["Kakavelakis","George",""],["Alharbi","Essa A.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:07:07 GMT"}],"updateDate":"2024-08-01","timestamp":1722438427000,"abstract":"  Ion and metal diffusion in metal halide perovskites, charge-transporting\nlayers, and electrodes are detrimental to the performance and stability of\nperovskite-based photovoltaic devices. As a result, there is an intense\nresearch interest in developing novel defect and ion diffusion mitigation\nstrategies. We present a simple, low-cost, scalable, and highly effective\nmethod that uses spray-coated exfoliated graphite interlayers to block ion and\nmetal diffusion and humidity ingress within the perovskite, the hole transport\nmaterial, and metal electrodes. The influence of inserting the exfoliated\ngraphite films on the structural, surface morphology, and optoelectronic\nproperties were examined through various methods, including X-ray diffraction,\nTime-of-Flight Secondary Ion Mass Spectrometry, Scanning electron microscope,\natomic force microscopy, Current-voltage (J-V) characteristics, Transient\nphotocurrent, and transient photovoltage. Our comprehensive investigation found\nthat exfoliated graphite films reduced the I- and Li+ diffusion among the\nlayers, leading to defect mitigation, reducing non-radiative recombination, and\nenhancing the device stability. Consequently, the best-performing device\ndemonstrated a power conversion efficiency of 25% and a fill factor exceeding\n80%. Additionally, these devices were subjected to different lifetime tests,\nwhich significantly enhanced the operational stability.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}