{"id":"2407.15723","title":"DStruct2Design: Data and Benchmarks for Data Structure Driven Generative\n  Floor Plan Design","authors":"Zhi Hao Luo, Luis Lara, Ge Ya Luo, Florian Golemo, Christopher\n  Beckham, Christopher Pal","authorsParsed":[["Luo","Zhi Hao",""],["Lara","Luis",""],["Luo","Ge Ya",""],["Golemo","Florian",""],["Beckham","Christopher",""],["Pal","Christopher",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:27:55 GMT"}],"updateDate":"2024-07-23","timestamp":1721662075000,"abstract":"  Text conditioned generative models for images have yielded impressive\nresults. Text conditioned floorplan generation as a special type of raster\nimage generation task also received particular attention. However there are\nmany use cases in floorpla generation where numerical properties of the\ngenerated result are more important than the aesthetics. For instance, one\nmight want to specify sizes for certain rooms in a floorplan and compare the\ngenerated floorplan with given specifications Current approaches, datasets and\ncommonly used evaluations do not support these kinds of constraints. As such,\nan attractive strategy is to generate an intermediate data structure that\ncontains numerical properties of a floorplan which can be used to generate the\nfinal floorplan image. To explore this setting we (1) construct a new dataset\nfor this data-structure to data-structure formulation of floorplan generation\nusing two popular image based floorplan datasets RPLAN and ProcTHOR-10k, and\nprovide the tools to convert further procedurally generated ProcTHOR floorplan\ndata into our format. (2) We explore the task of floorplan generation given a\npartial or complete set of constraints and we design a series of metrics and\nbenchmarks to enable evaluating how well samples generated from models respect\nthe constraints. (3) We create multiple baselines by finetuning a large\nlanguage model (LLM), Llama3, and demonstrate the feasibility of using\nfloorplan data structure conditioned LLMs for the problem of floorplan\ngeneration respecting numerical constraints. We hope that our new datasets and\nbenchmarks will encourage further research on different ways to improve the\nperformance of LLMs and other generative modelling techniques for generating\ndesigns where quantitative constraints are only partially specified, but must\nbe respected.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tVNmaf0r1uTgxzqT1ZpQH6yNdth05nyTMJTWyYoJkGg","pdfSize":"1178826"}
