{"id":"2407.19456","title":"An Inverse Partial Optimal Transport Framework for Music-guided Movie\n  Trailer Generation","authors":"Yutong Wang, Sidan Zhu, Hongteng Xu, Dixin Luo","authorsParsed":[["Wang","Yutong",""],["Zhu","Sidan",""],["Xu","Hongteng",""],["Luo","Dixin",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 10:15:17 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 11:57:37 GMT"}],"updateDate":"2024-07-31","timestamp":1722161717000,"abstract":"  Trailer generation is a challenging video clipping task that aims to select\nhighlighting shots from long videos like movies and re-organize them in an\nattractive way. In this study, we propose an inverse partial optimal transport\n(IPOT) framework to achieve music-guided movie trailer generation. In\nparticular, we formulate the trailer generation task as selecting and sorting\nkey movie shots based on audio shots, which involves matching the latent\nrepresentations across visual and acoustic modalities. We learn a multi-modal\nlatent representation model in the proposed IPOT framework to achieve this aim.\nIn this framework, a two-tower encoder derives the latent representations of\nmovie and music shots, respectively, and an attention-assisted Sinkhorn\nmatching network parameterizes the grounding distance between the shots' latent\nrepresentations and the distribution of the movie shots. Taking the\ncorrespondence between the movie shots and its trailer music shots as the\nobserved optimal transport plan defined on the grounding distances, we learn\nthe model by solving an inverse partial optimal transport problem, leading to a\nbi-level optimization strategy. We collect real-world movies and their trailers\nto construct a dataset with abundant label information called CMTD and,\naccordingly, train and evaluate various automatic trailer generators. Compared\nwith state-of-the-art methods, our IPOT method consistently shows superiority\nin subjective visual effects and objective quantitative measurements.\n","subjects":["Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}