{"id":"2407.16770","title":"Infinite Ends from Finite Samples: Open-Ended Goal Inference as Top-Down\n  Bayesian Filtering of Bottom-Up Proposals","authors":"Tan Zhi-Xuan, Gloria Kang, Vikash Mansinghka, Joshua B. Tenenbaum","authorsParsed":[["Zhi-Xuan","Tan",""],["Kang","Gloria",""],["Mansinghka","Vikash",""],["Tenenbaum","Joshua B.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 18:04:40 GMT"}],"updateDate":"2024-07-25","timestamp":1721757880000,"abstract":"  The space of human goals is tremendously vast; and yet, from just a few\nmoments of watching a scene or reading a story, we seem to spontaneously infer\na range of plausible motivations for the people and characters involved. What\nexplains this remarkable capacity for intuiting other agents' goals, despite\nthe infinitude of ends they might pursue? And how does this cohere with our\nunderstanding of other people as approximately rational agents? In this paper,\nwe introduce a sequential Monte Carlo model of open-ended goal inference, which\ncombines top-down Bayesian inverse planning with bottom-up sampling based on\nthe statistics of co-occurring subgoals. By proposing goal hypotheses related\nto the subgoals achieved by an agent, our model rapidly generates plausible\ngoals without exhaustive search, then filters out goals that would be\nirrational given the actions taken so far. We validate this model in a goal\ninference task called Block Words, where participants try to guess the word\nthat someone is stacking out of lettered blocks. In comparison to both\nheuristic bottom-up guessing and exact Bayesian inference over hundreds of\ngoals, our model better predicts the mean, variance, efficiency, and resource\nrationality of human goal inferences, achieving similar accuracy to the exact\nmodel at a fraction of the cognitive cost, while also explaining garden-path\neffects that arise from misleading bottom-up cues. Our experiments thus\nhighlight the importance of uniting top-down and bottom-up models for\nexplaining the speed, accuracy, and generality of human theory-of-mind.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}