{"id":"2407.12829","title":"PICO-RAM: A PVT-Insensitive Analog Compute-In-Memory SRAM Macro with\n  In-Situ Multi-Bit Charge Computing and 6T Thin-Cell-Compatible Layout","authors":"Zhiyu Chen, Ziyuan Wen, Weier Wan, Akhil Reddy Pakala, Yiwei Zou,\n  Wei-Chen Wei, Zengyi Li, Yubei Chen, Kaiyuan Yang","authorsParsed":[["Chen","Zhiyu",""],["Wen","Ziyuan",""],["Wan","Weier",""],["Pakala","Akhil Reddy",""],["Zou","Yiwei",""],["Wei","Wei-Chen",""],["Li","Zengyi",""],["Chen","Yubei",""],["Yang","Kaiyuan",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 03:46:59 GMT"}],"updateDate":"2024-07-19","timestamp":1719978419000,"abstract":"  Analog compute-in-memory (CIM) in static random-access memory (SRAM) is\npromising for accelerating deep learning inference by circumventing the memory\nwall and exploiting ultra-efficient analog low-precision arithmetic. Latest\nanalog CIM designs attempt bit-parallel schemes for multi-bit analog\nMatrix-Vector Multiplication (MVM), aiming at higher energy efficiency,\nthroughput, and training simplicity and robustness over conventional bit-serial\nmethods that digitally shift-and-add multiple partial analog computing results.\nHowever, bit-parallel operations require more complex analog computations and\nbecome more sensitive to well-known analog CIM challenges, including large cell\nareas, inefficient and inaccurate multi-bit analog operations, and\nvulnerability to PVT variations. This paper presents PICO-RAM, a\nPVT-insensitive and compact CIM SRAM macro with charge-domain bit-parallel\ncomputation. It adopts a multi-bit thin-cell Multiply-Accumulate (MAC) unit\nthat shares the same transistor layout as the most compact 6T SRAM cell. All\nanalog computing modules, including digital-to-analog converters (DACs), MAC\nunits, analog shift-and-add, and analog-to-digital converters (ADCs) reuse one\nset of local capacitors inside the array, performing in-situ computation to\nsave area and enhance accuracy. A compact 8.5-bit dual-threshold time-domain\nADC power gates the main path most of the time, leading to a significant energy\nreduction. Our 65-nm prototype achieves the highest weight storage density of\n559 Kb/mm${^2}$ and exceptional robustness to temperature and voltage\nvariations (-40 to 105 $^{\\circ}$C and 0.65 to 1.2 V) among SRAM-based analog\nCIM designs.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Emerging Technologies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}