{"id":"2407.10851","title":"Electronic State Chromatography of Lutetium Cations","authors":"Biswajit Jana, EunKang Kim, Aayush Arya, Elisa Romero Romero,\n  Elisabeth Rickert, Harry Ramanantoanina, Sebastian Raeder, Michael Block and\n  Mustapha Laatiaoui","authorsParsed":[["Jana","Biswajit",""],["Kim","EunKang",""],["Arya","Aayush",""],["Romero","Elisa Romero",""],["Rickert","Elisabeth",""],["Ramanantoanina","Harry",""],["Raeder","Sebastian",""],["Block","Michael",""],["Laatiaoui","Mustapha",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:03:54 GMT"}],"updateDate":"2024-07-16","timestamp":1721059434000,"abstract":"  Relativistic effects strongly influence the electronic structures of the\nheaviest elements, thereby shaping their chemical and physical properties.\nStudying ion mobility within a noble gas environment reveals how the\nion-neutral interactions depend on the ion's electronic configurations, thus\nproviding an avenue for exploring these effects. An ion mobility spectrometer\nwith a cryogenic drift tube was developed to precisely measure the low-field\nreduced mobility of heavy lanthanide and actinide cations. The apparatus was\ncharacterized by optimizing the bunching operation of ions with a miniature RF\ncoulomb buncher and evaluating the chromatography performance of the drift tube\noperated with helium buffer gas at a temperature of 298K. Systematic ion\nmobility measurements of lutetium cations (Lu$^{+}$) drifting in helium gas\nwere carried out as a case study. The electronic state chromatography of\nLu$^{+}$ has been demonstrated. The low-field reduced ion mobility for the\nground and lowest meta-stable state of Lu$^{+}$ have been examined. In\naddition, the variation of both states' reduced mobility and the quenching of\nmeta-stable population has been investigated under different reduced electric\nfields ($E/n_0$), the ratio of an electric field to neutral gas number density.\n","subjects":["Physics/Atomic and Molecular Clusters"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}