{"id":"2407.18246","title":"Probing the early universe with future GW observatories","authors":"Suvashis Maity and Md Riajul Haque","authorsParsed":[["Maity","Suvashis",""],["Haque","Md Riajul",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 17:59:07 GMT"}],"updateDate":"2024-07-26","timestamp":1721930347000,"abstract":"  One of the fundamental characteristics of slow roll inflation is its\ngeneration of tensor perturbations, which manifest as stochastic gravitational\nwaves (GWs). Slow roll inflation results in a nearly scale-invariant GW\nspectrum that maintains its scale invariance as it transitions into the\nradiation-dominated era. However, introducing an intermediate reheating phase\ncan modify the spectral tilt, depending on the equation of state governing that\nparticular epoch. These GWs, especially on smaller scales, are anticipated to\nbe observable by forthcoming GW detectors. In this study, we initially\ndelineate the parameter space encompassing the inflationary energy scale,\nreheating temperature, and equation of state in a model-independent manner,\nfocusing on the spectra detectable by GW detectors such as LISA, ET, DECIGO,\nand BBO. We also examine the implications for the $\\alpha$-attractor model of\ninflation and explore the observational constraints on $n_s-r$ prediction in\nthe light of GW detection. Then, we point out the probable ranges for various\nnon-gravitational and gravitational coupling between the inflaton and Standard\nModel particles considering the perturbative reheating. If one assumes PBHs\nwere formed during the early reheating era, such detection of GW signal also\nsheds light on the probing PBH parameters. Note that for the case of PBH\ndomination, we also consider the contribution of the induced GW due to the\ndensity function in PBH distribution, which helps to decode the phase of early\nPBH domination. Finally, to test the production of other cosmological relics\nthrough future GW missions, we consider dark matter produced via gravitational\ninteraction in the early universe.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}