{"id":"2407.02801","title":"Cosmological tests of the dark energy models in Finsler-Randers\n  Space-time","authors":"Z. Nekouee, Himanshu Chaudhary, S. K. Narasimhamurthy, S. K. J. Pacif\n  and Manjunath Malligawad","authorsParsed":[["Nekouee","Z.",""],["Chaudhary","Himanshu",""],["Narasimhamurthy","S. K.",""],["Pacif","S. K. J.",""],["Malligawad","Manjunath",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 04:18:22 GMT"}],"updateDate":"2024-07-04","timestamp":1719980302000,"abstract":"  The Finsler-Randers space-time offers a novel perspective on cosmic dynamics,\ndeparting from the constraints of General Relativity. This paper thoroughly\ninvestigates two dark energy models resulting from the parametrization of $H$\nwithin this geometric framework. We have conducted some geometrical and\nphysical analysis of the dark energy models in Finslerian geometry. First, We\nhave derived the field equations governing the universe's evolution within the\nFinsler-Randers formalism, incorporating the presence of dark energy. Through\nthis, we explore its implications on cosmological phenomena, including cosmic\nexpansion, late-time behavior of the universe, cosmological phase transition,\nand a few more. Also, we employ observational data such as Cosmic Chronometer,\nSupernovae, Gamma-Ray Bursts, Quasar, and baryon acoustic oscillations to\nconstrain the parameters associated with dark energy in the Finsler-Randers\nuniverse. Comparing theoretical predictions with empirical observations, we\nassess the model viability and discern any deviations from the standard\n$\\Lambda$CDM cosmology. Our findings offer intriguing insights into the nature\nof dark energy within this alternative gravitational framework, providing a\ndeeper understanding of its role in shaping cosmic evolution. The implications\nof our results extend to fundamental cosmology, hinting at new avenues for\nresearch to unravel the mysteries surrounding dark energy and the geometric\nstructure of the universe within non-standard gravitational theories.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}