{"id":"2407.01610","title":"Stability of diffusion flames under shear flow: Taylor dispersion and\n  the formation of flame streets","authors":"Prabakaran Rajamanickam, Aiden Kelly, Joel Daou","authorsParsed":[["Rajamanickam","Prabakaran",""],["Kelly","Aiden",""],["Daou","Joel",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 11:41:35 GMT"}],"updateDate":"2024-07-03","timestamp":1719488495000,"abstract":"  Diffusion flame streets, observed in non-premixed micro-combustion devices,\nalign parallel to a shear flow. They are observed to occur in mixtures with\nhigh Lewis number ($Le$) fuels, provided that the flow Reynolds number, or the\nPeclet number $Pe$, exceeds a critical value. The underlying mechanisms behind\nthese observations have not yet been fully understood. In the present paper, we\nidentify the coupling between diffusive-thermal instabilities and Taylor\ndispersion as a mechanism which is able to explain the experimental\nobservations above. The explanation is largely based on the fact that Taylor\ndispersion enhances all diffusion processes in the flow direction, leading\neffectively to anisotropic diffusion with an effective (flow-dependent) Lewis\nnumber in the flow direction which is proportional to $1/Le$ for $Pe\\gg 1$.\nValidation of the identified mechanism is demonstrated within a simple model by\ninvestigating the stability of a planar diffusion flame established parallel to\na plane Poiseuille flow in a narrow channel. A linear stability analysis,\nleading to an eigenvalue problem solved numerically, shows that cellular (or\nfinite wavelength) instabilities emerge for high Lewis number fuels when the\nPeclet number exceeds a critical value. Furthermore, for Peclet numbers below\nthis critical value, longwave instabilities with or without time oscillations\nare obtained. Stability regime diagrams are presented for illustrative cases in\na $Le$-$Pe$ plane where various instability domains are identified. Finally,\nthe linear analysis is supported and complemented by time dependent numerical\nsimulations, describing the evolution of unstable diffusion flames. The\nsimulations demonstrate the existence of stable cellular structures and show\nthat the longwave instabilities are conducive to flame extinction.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}