{"id":"2407.08876","title":"DegustaBot: Zero-Shot Visual Preference Estimation for Personalized\n  Multi-Object Rearrangement","authors":"Benjamin A. Newman, Pranay Gupta, Kris Kitani, Yonatan Bisk, Henny\n  Admoni, Chris Paxton","authorsParsed":[["Newman","Benjamin A.",""],["Gupta","Pranay",""],["Kitani","Kris",""],["Bisk","Yonatan",""],["Admoni","Henny",""],["Paxton","Chris",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 21:28:02 GMT"}],"updateDate":"2024-07-15","timestamp":1720733282000,"abstract":"  De gustibus non est disputandum (\"there is no accounting for others' tastes\")\nis a common Latin maxim describing how many solutions in life are determined by\npeople's personal preferences. Many household tasks, in particular, can only be\nconsidered fully successful when they account for personal preferences such as\nthe visual aesthetic of the scene. For example, setting a table could be\noptimized by arranging utensils according to traditional rules of Western table\nsetting decorum, without considering the color, shape, or material of each\nobject, but this may not be a completely satisfying solution for a given\nperson. Toward this end, we present DegustaBot, an algorithm for visual\npreference learning that solves household multi-object rearrangement tasks\naccording to personal preference. To do this, we use internet-scale pre-trained\nvision-and-language foundation models (VLMs) with novel zero-shot visual\nprompting techniques. To evaluate our method, we collect a large dataset of\nnaturalistic personal preferences in a simulated table-setting task, and\nconduct a user study in order to develop two novel metrics for determining\nsuccess based on personal preference. This is a challenging problem and we find\nthat 50% of our model's predictions are likely to be found acceptable by at\nleast 20% of people.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"YqWbNUKziP8K1huk-kjbvkHFY3snZC_NhKJl0ecHzu8","pdfSize":"13945852"}
