{"id":"2407.20401","title":"Environments around quasars at $z\\sim$3 revealed by wide-field imaging\n  with Subaru HSC and CFHT","authors":"Yuta Suzuki, Hisakazu Uchiyama, Yoshiki Matsuoka, Jun Toshikawa,\n  Stephen Gwyn, Masatoshi Imanishi, Chengze Liu, Akatoki Noboriguchi, Marcin\n  Sawicki, Yoshiki Toba","authorsParsed":[["Suzuki","Yuta",""],["Uchiyama","Hisakazu",""],["Matsuoka","Yoshiki",""],["Toshikawa","Jun",""],["Gwyn","Stephen",""],["Imanishi","Masatoshi",""],["Liu","Chengze",""],["Noboriguchi","Akatoki",""],["Sawicki","Marcin",""],["Toba","Yoshiki",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 19:56:00 GMT"}],"updateDate":"2024-07-31","timestamp":1722282960000,"abstract":"  We examine the local density environments around 67 quasars at $z\\sim3$, by\ncombining the imaging data of Hyper Suprime-Cam Subaru Strategic Program\n(HSC-SSP) and Canada-France-Hawaii Telescope Large Area U-band Survey (CLAUDS)\nover about 20 deg$^{2}$. Our measurements exploit $U$-dropout galaxies in the\nvicinities of quasars taken from Sloan Digital Sky Survey (SDSS). We find that\nthe quasars have the indistinguishable surrounding density distribution from\nthe $U$-dropout galaxies, and that three quasars are associated with\nprotocluster candidates within a projected separation of 3 arcmin. According to\na halo evolutionary model, our results suggest that quasars at this epoch\noccupy haloes with a typical mass of $1.3^{+1.4}_{-0.9} \\times 10^{13} h^{-1}\n\\mathrm{M_{\\odot}}$. We also investigate the dependence of the local galaxy\noverdensity on ultraviolet (UV) luminosities, black hole (BH) masses, and\nproximity zone sizes of the quasars, but no statistically-significant\ncorrelation was found. Finally, we find that the local density of faint\n$U$-dropout galaxies are lower than that of bright $U$-dropout galaxies within\na projected distance of $0.51\\pm0.05$ physical Mpc, where the quasar UV\nradiation is 30 times intenser than backgroung UV radiation. We argue that\nphotoevaporation may suppress galaxy formation at short distances where the\nquasar UV intensity is strong, even in massive haloes.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}