{"id":"2407.06687","title":"Realization of Conditional Operations through Transition Pathway\n  Engineering","authors":"Sheng Zhang, Peng Duan, Yun-Jie Wang, Tian-Le Wang, Peng Wang, Ren-Ze\n  Zhao, Xiao-Yan Yang, Ze-An Zhao, Liang-Liang Guo, Yong Chen, Hai-Feng Zhang,\n  Lei Du, Hao-Ran Tao, Zhi-Fei Li, Yuan Wu, Zhi-Long Jia, Wei-Cheng Kong,\n  Zhao-Yun Chen, Yu-Chun Wu, Guo-Ping Guo","authorsParsed":[["Zhang","Sheng",""],["Duan","Peng",""],["Wang","Yun-Jie",""],["Wang","Tian-Le",""],["Wang","Peng",""],["Zhao","Ren-Ze",""],["Yang","Xiao-Yan",""],["Zhao","Ze-An",""],["Guo","Liang-Liang",""],["Chen","Yong",""],["Zhang","Hai-Feng",""],["Du","Lei",""],["Tao","Hao-Ran",""],["Li","Zhi-Fei",""],["Wu","Yuan",""],["Jia","Zhi-Long",""],["Kong","Wei-Cheng",""],["Chen","Zhao-Yun",""],["Wu","Yu-Chun",""],["Guo","Guo-Ping",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 09:01:04 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 02:24:51 GMT"}],"updateDate":"2024-07-12","timestamp":1720515664000,"abstract":"  In the NISQ era, achieving large-scale quantum computing demands compact\ncircuits to mitigate decoherence and gate error accumulation. Quantum\noperations with diverse degrees of freedom hold promise for circuit\ncompression, but conventional approaches encounter challenges in simultaneously\nadjusting multiple parameters. Here, we propose a transition composite gate\n(TCG) scheme grounded on state-selective transition path engineering, enabling\nmore expressive conditional operations. We experimentally validate a controlled\nunitary (CU) gate as an example, with independent and continuous parameters. By\nadjusting the parameters of $\\rm X^{12}$ gate, we obtain the CU family with a\nfidelity range of 95.2% to 99.0% leveraging quantum process tomography (QPT).\nTo demonstrate the capability of circuit compression, we use TCG scheme to\nprepare 3-qubit Greenberger-Horne-Zeilinger (GHZ) and W states, with the\nfidelity of 96.77% and 95.72%. TCG can achieve the reduction in circuit depth\nof about 40% and 44% compared with the use of CZ gates only. Moreover, we show\nthat short-path TCG (SPTCG) can further reduce the state-preparation circuit\ntime cost. The TCG scheme exhibits advantages in certain quantum circuits and\nshows significant potential for large-scale quantum algorithms.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}