{"id":"2407.14883","title":"Inferring Ingrained Remote Information in AC Power Flows Using\n  Neuromorphic Modality Regime","authors":"Xiaoguang Diao, Yubo Song, Subham Sahoo","authorsParsed":[["Diao","Xiaoguang",""],["Song","Yubo",""],["Sahoo","Subham",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 14:20:22 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 19:35:52 GMT"}],"updateDate":"2024-08-13","timestamp":1721485222000,"abstract":"  In this paper, we infer remote measurements such as remote voltages and\ncurrents online with change in AC power flows using spiking neural network\n(SNN) as grid-edge technology for efficient coordination of power electronic\nconverters. This work unifies power and information as a means of data\nnormalization using a multi-modal regime in the form of spikes using\nenergy-efficient neuromorphic learning and event-driven asynchronous data\ncollection. Firstly, we organize the synchronous real-valued measurements at\neach edge and translate them into asynchronous spike-based events to collect\nsparse data for training of SNN at each edge. Instead of relying on\nerror-dependent supervised data-driven learning theory, we exploit the\nlatency-driven unsupervised Hebbian learning rule to obtain modulation pulses\nfor switching of power electronic converters that can now comprehend grid\ndisturbances locally and adapt their operation without requiring explicit\ninfrastructure for global coordination. Not only does this philosophy block\nexogenous path arrival for cyber attackers by dismissing the cyber layer, it\nalso entails converter adaptation to system reconfiguration and parameter\nmismatch issues. We conclude this work by validating its energy-efficient and\neffective online learning performance under various scenarios in different\nsystem sizes, including modified IEEE 14-bus system and under experimental\nconditions.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}