{"id":"2407.05146","title":"Unified Approach for Hedging Impermanent Loss of Liquidity Provision","authors":"Alexander Lipton and Vladimir Lucic and Artur Sepp","authorsParsed":[["Lipton","Alexander",""],["Lucic","Vladimir",""],["Sepp","Artur",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 18:12:11 GMT"}],"updateDate":"2024-07-09","timestamp":1720289531000,"abstract":"  We develop static and dynamic approaches for hedging of the impermanent loss\n(IL) of liquidity provision (LP) staked at Decentralised Exchanges (DEXes)\nwhich employ Uniswap V2 and V3 protocols. We provide detailed definitions and\nformulas for computing the IL to unify different definitions occurring in the\nexisting literature. We show that the IL can be seen a contingent claim with a\nnon-linear payoff for a fixed maturity date. Thus, we introduce the contingent\nclaim termed as IL protection claim which delivers the negative of IL payoff at\nthe maturity date. We apply arbitrage-based methods for valuation and risk\nmanagement of this claim. First, we develop the static model-independent\nreplication method for the valuation of IL protection claim using traded\nEuropean vanilla call and put options. We extend and generalize an existing\nmethod to show that the IL protection claim can be hedged perfectly with\noptions if there is a liquid options market. Second, we develop the dynamic\nmodel-based approach for the valuation and hedging of IL protection claims\nunder a risk-neutral measure. We derive analytic valuation formulas using a\nwide class of price dynamics for which the characteristic function is available\nunder the risk-neutral measure. As base cases, we derive analytic valuation\nformulas for IL protection claim under the Black-Scholes-Merton model and the\nlog-normal stochastic volatility model. We finally discuss estimation of\nrisk-reward of LP staking using our results.\n","subjects":["Quantitative Finance/Mathematical Finance","Quantitative Finance/Trading and Market Microstructure"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}