{"id":"2407.21242","title":"Supervised brain node and network construction under voxel-level\n  functional imaging","authors":"Wanwan Xu, Selena Wang, Chichun Tan, Xilin Shen, Wenjing Luo, Todd\n  Constable, Tianxi Li, Yize Zhao","authorsParsed":[["Xu","Wanwan",""],["Wang","Selena",""],["Tan","Chichun",""],["Shen","Xilin",""],["Luo","Wenjing",""],["Constable","Todd",""],["Li","Tianxi",""],["Zhao","Yize",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 23:23:30 GMT"}],"updateDate":"2024-08-01","timestamp":1722381810000,"abstract":"  Recent advancements in understanding the brain's functional organization\nrelated to behavior have been pivotal, particularly in the development of\npredictive models based on brain connectivity. Traditional methods in this\ndomain often involve a two-step process by first constructing a connectivity\nmatrix from predefined brain regions, and then linking these connections to\nbehaviors or clinical outcomes. However, these approaches with unsupervised\nnode partitions predict outcomes inefficiently with independently established\nconnectivity. In this paper, we introduce the Supervised Brain Parcellation\n(SBP), a brain node parcellation scheme informed by the downstream predictive\ntask. With voxel-level functional time courses generated under resting-state or\ncognitive tasks as input, our approach clusters voxels into nodes in a manner\nthat maximizes the correlation between inter-node connections and the\nbehavioral outcome, while also accommodating intra-node homogeneity. We\nrigorously evaluate the SBP approach using resting-state and task-based fMRI\ndata from both the Adolescent Brain Cognitive Development (ABCD) study and the\nHuman Connectome Project (HCP). Our analyses show that SBP significantly\nimproves out-of-sample connectome-based predictive performance compared to\nconventional step-wise methods under various brain atlases. This advancement\nholds promise for enhancing our understanding of brain functional architectures\nwith behavior and establishing more informative network neuromarkers for\nclinical applications.\n","subjects":["Statistics/Applications","Statistics/Computation"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}