{"id":"2407.08975","title":"Hybrid Temporal Computing for Lower Power Hardware Accelerators","authors":"Maliha Tasnim, Sachin Sachdeva, Yibo Liu and Sheldon X.-D. Tan","authorsParsed":[["Tasnim","Maliha",""],["Sachdeva","Sachin",""],["Liu","Yibo",""],["Tan","Sheldon X. -D.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 04:05:34 GMT"}],"updateDate":"2024-07-15","timestamp":1720757134000,"abstract":"  In this paper, we propose a new hybrid temporal computing (HTC) framework\nthat leverages both pulse rate and temporal data encoding to design ultra-low\nenergy hardware accelerators. Our approach is inspired by the recently proposed\ntemporal computing, or race logic, which encodes data values as single delays,\nleading to significantly lower energy consumption due to minimized signal\nswitching. However, race logic is limited in its applications due to inherent\nrestrictions. The new HTC framework overcomes these limitations by encoding\nsignals in both temporal and pulse rate formats for multiplication and in\ntemporal format for propagation. This approach maintains reduced switch energy\nwhile being general enough to implement a wide range of arithmetic operations.\nWe demonstrate how HTC multiplication is performed for both unipolar and\nbipolar data encoding and present the basic designs for multipliers, adders,\nand MAC units. Additionally, we implement two hardware accelerators: a Finite\nImpulse Response (FIR) filter and a Discrete Cosine Transform (DCT)/iDCT engine\nfor image compression and DSP applications. Experimental results show that the\nHTC MAC has a significantly smaller power and area footprint compared to the\nUnary MAC design and is orders of magnitude faster. Compared to the CBSC MAC,\nthe HTC MAC reduces power consumption by $45.2\\%$ and area footprint by\n$50.13\\%$. For the FIR design, the HTC design significantly outperforms the\nUnary design on all metrics. Compared to the CBSC design, the HTC-based FIR\nfilter reduces power consumption by $36.61\\%$ and area cost by $45.85\\%$. The\nHTC-based DCT filter retains the quality of the original image with a decent\nPSNR, while consuming $23.34\\%$ less power and occupying $18.20\\%$ less area\nthan the CBSC MAC-based DCT filter.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"FnvTjwA0W-qawAcfd6pTR1arNdMYveiHtgMyGXMhO00","pdfSize":"1944061"}
