{"id":"2407.09074","title":"Real-time Pipe Burst Localization in Water Distribution Networks Using\n  Change Point Detection Algorithms","authors":"Takudzwa Mzembegwa and Clement N Nyirenda","authorsParsed":[["Mzembegwa","Takudzwa",""],["Nyirenda","Clement N",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 07:56:46 GMT"}],"updateDate":"2024-07-15","timestamp":1720771006000,"abstract":"  Change point detection (CPD) has proved to be an effective tool for detecting\ndrifts in data and its use over the years has become more pronounced due to the\nvast amount of data and IoT devices readily available. This study analyzes the\neffectiveness of Cumulative Sum (CUSUM) and Shewhart Control Charts for\nidentifying the occurrence of abrupt pressure changes for pipe burst\nlocalization in Water Distribution Network (WDN). Change point detection\nalgorithms could be useful for identifying the nodes that register the earliest\nand most drastic pressure changes with the aim of detecting pipe bursts in\nreal-time. TSNet, a Python package, is employed in order to simulate pipe\nbursts in a WDN. The pressure readings are served to the pipe burst\nlocalization algorithm the moment they are available for real-time pie burst\nlocalization. The performance of the pipe burst localization algorithm is\nevaluated using a key metric such as localization accuracy under different\nsettings to compare its performance when paired with either CUSUM or Shewhart.\nResults show that the pipe burst localization algorithm has an overall better\nperformance when paired with CUSUM. Although, it does show great accuracy for\nboth CPD algorithms when pressure readings are being continuously made\navailable without a big gap between time steps. The proposed approach however\nstill needs further experiments on different WDNs to assess the performance and\naccuracy of the algorithm on real-world WDN models.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}