{"id":"2407.16893","title":"The Price of Prompting: Profiling Energy Use in Large Language Models\n  Inference","authors":"Erik Johannes Husom, Arda Goknil, Lwin Khin Shar, Sagar Sen","authorsParsed":[["Husom","Erik Johannes",""],["Goknil","Arda",""],["Shar","Lwin Khin",""],["Sen","Sagar",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 12:16:28 GMT"}],"updateDate":"2024-07-25","timestamp":1720095388000,"abstract":"  In the rapidly evolving realm of artificial intelligence, deploying large\nlanguage models (LLMs) poses increasingly pressing computational and\nenvironmental challenges. This paper introduces MELODI - Monitoring Energy\nLevels and Optimization for Data-driven Inference - a multifaceted framework\ncrafted to monitor and analyze the energy consumed during LLM inference\nprocesses. MELODI enables detailed observations of power consumption dynamics\nand facilitates the creation of a comprehensive dataset reflective of energy\nefficiency across varied deployment scenarios. The dataset, generated using\nMELODI, encompasses a broad spectrum of LLM deployment frameworks, multiple\nlanguage models, and extensive prompt datasets, enabling a comparative analysis\nof energy use. Using the dataset, we investigate how prompt attributes,\nincluding length and complexity, correlate with energy expenditure. Our\nfindings indicate substantial disparities in energy efficiency, suggesting\nample scope for optimization and adoption of sustainable measures in LLM\ndeployment. Our contribution lies not only in the MELODI framework but also in\nthe novel dataset, a resource that can be expanded by other researchers. Thus,\nMELODI is a foundational tool and dataset for advancing research into\nenergy-conscious LLM deployment, steering the field toward a more sustainable\nfuture.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"Jr8rNLdG59ofoBSqhJ8Wcd0DaeUn9PocZDSqJQ0Sxmk","pdfSize":"339517"}
