{"id":"2407.10334","title":"Beyond Meditation: Understanding Everyday Mindfulness Practices and\n  Technology Use Among Experienced Practitioners","authors":"Jingjin Li, Karen Anne Cochrane, and Gilly Leshed","authorsParsed":[["Li","Jingjin",""],["Cochrane","Karen Anne",""],["Leshed","Gilly",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 21:21:01 GMT"}],"updateDate":"2024-07-16","timestamp":1720992061000,"abstract":"  Mindfulness, a practice of bringing attention to the present\nnon-judgmentally, has many mental and physical well-being benefits, especially\nwhen practiced consistently. Many technologies have been invented to support\nsolo or group mindfulness practice such as mobile apps, live streams, virtual\nreality environments, and wearables. In this paper, we present findings from an\ninterview study with 20 experienced mindfulness practitioners about their\neveryday mindfulness practices and technology use. Participants identify the\nbenefits and challenges of developing long-term commitment to mindfulness\npractice. They employ various strategies, such as brief mindfulness exercises,\nsocial accountability, and guidance from teachers, to sustain their practice.\nWhile conflicted about technology, they adopt and appropriate a range of\ntechnologies in their practice for reminders, emotion tracking, connecting with\nothers, and attending online sessions. They also carefully consider when to use\ntechnology, when and how to limit its use, and ways to incorporate technology\nas an object for mindfulness. Based on our findings, we discuss expanding the\ndefinition of mindfulness and the tension between supporting short- and\nlong-term mindfulness practice. We also propose a set of design recommendations\nto support everyday mindfulness including such as through the lens of metaphor,\nreappropriating non-mindfulness technology, and bringing community support into\npersonal practice.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bC2ezHO945BiisVZpUeIzBXAv_zS7k1Iag6QiV1clGE","pdfSize":"377293"}
