{"id":"2407.13659","title":"Quantifying uncertainty in area and regression coefficient estimation\n  from remote sensing maps","authors":"Kerri Lu, Stephen Bates, Sherrie Wang","authorsParsed":[["Lu","Kerri",""],["Bates","Stephen",""],["Wang","Sherrie",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:35:48 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 12:52:54 GMT"}],"updateDate":"2024-08-13","timestamp":1721320548000,"abstract":"  Remote sensing map products are used to obtain estimates of environmental\nquantities, such as deforested area or the effect of conservation zones on\ndeforestation. However, the quality of map products varies, and - because maps\nare outputs of complex machine learning algorithms that take in a variety of\nremotely sensed variables as inputs - errors are difficult to characterize.\nWithout capturing the biases that may be present, naive calculations of\npopulation-level estimates from such maps are statistically invalid. In this\npaper, we compare several uncertainty quantification methods - stratification,\nOlofsson area estimation method, and prediction-powered inference - that\ncombine a small amount of randomly sampled ground truth data with large-scale\nremote sensing map products to generate statistically valid estimates. Applying\nthese methods across four remote sensing use cases in area and regression\ncoefficient estimation, we find that they result in estimates that are more\nreliable than naively using the map product as if it were 100% accurate and\nhave lower uncertainty than using only the ground truth and ignoring the map\nproduct. Prediction-powered inference uses ground truth data to correct for\nbias in the map product estimate and (unlike stratification) does not require\nus to choose a map product before sampling. This is the first work to (1) apply\nprediction-powered inference to remote sensing estimation tasks, and (2)\nperform uncertainty quantification on remote sensing regression coefficients\nwithout assumptions on the structure of map product errors. To improve the\nutility of machine learning-generated remote sensing maps for downstream\napplications, we recommend that map producers provide a holdout ground truth\ndataset to be used for calibration in uncertainty quantification alongside\ntheir maps.\n","subjects":["Statistics/Applications","Economics/General Economics","Electrical Engineering and Systems Science/Signal Processing","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3SP4H3Ee_OIOxewJZIuMAhiaXOLrk0kBgIKdvlO5rRM","pdfSize":"3880250"}
