{"id":"2407.01449","title":"ColPali: Efficient Document Retrieval with Vision Language Models","authors":"Manuel Faysse, Hugues Sibille, Tony Wu, Bilel Omrani, Gautier Viaud,\n  C\\'eline Hudelot, Pierre Colombo","authorsParsed":[["Faysse","Manuel",""],["Sibille","Hugues",""],["Wu","Tony",""],["Omrani","Bilel",""],["Viaud","Gautier",""],["Hudelot","Céline",""],["Colombo","Pierre",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 15:45:29 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 13:02:58 GMT"}],"updateDate":"2024-07-03","timestamp":1719503129000,"abstract":"  Documents are visually rich structures that convey information through text,\nas well as tables, figures, page layouts, or fonts. While modern document\nretrieval systems exhibit strong performance on query-to-text matching, they\nstruggle to exploit visual cues efficiently, hindering their performance on\npractical document retrieval applications such as Retrieval Augmented\nGeneration. To benchmark current systems on visually rich document retrieval,\nwe introduce the Visual Document Retrieval Benchmark ViDoRe, composed of\nvarious page-level retrieving tasks spanning multiple domains, languages, and\nsettings. The inherent shortcomings of modern systems motivate the introduction\nof a new retrieval model architecture, ColPali, which leverages the document\nunderstanding capabilities of recent Vision Language Models to produce\nhigh-quality contextualized embeddings solely from images of document pages.\nCombined with a late interaction matching mechanism, ColPali largely\noutperforms modern document retrieval pipelines while being drastically faster\nand end-to-end trainable.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"A0KGQ6szL4iiMY_qSoE93fAd6U5w5RPkgKvzVeMbT-M","pdfSize":"9379754","objectId":"0x7f2411f1c955f3096a33b272354c2c501f05f86532bd9efadf444207197e52c3","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
