{"id":"2407.15189","title":"Unraveling Picophotonics of Crystalline Materials","authors":"Sathwik Bharadwaj and Zubin Jacob","authorsParsed":[["Bharadwaj","Sathwik",""],["Jacob","Zubin",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 15:05:27 GMT"}],"updateDate":"2024-07-23","timestamp":1721574327000,"abstract":"  Nanophotonics, which deals with the study of light-matter interaction at\nscales smaller than the wavelength of radiation, has widespread applications\nfrom plasmonic waveguiding, topological photonic crystals, super-lensing, solar\nabsorbers, and infrared imaging. The physical phenomena governing these effects\ncan be captured by using a macroscopic homogenized quantity called the\nrefractive index. However, the lattice-level description of optical waves in a\ncrystalline material using a quantum theory has long been unresolved. Inspired\nby the dynamics of electron waves and their corresponding band structure, here,\nwe put forth a pico-optical band theory of solids which reveals waves hidden\ndeep within a crystal lattice. We show that these hidden waves arise from\noptical pico-indices, a family of quantum functions obeying crystal symmetries,\nand cannot be described by the conventional concept of refractive index. We\npresent for the first time - the hidden waves and pico-optical band structure\nof 14 distinct materials. We choose Si, Ge, InAs, GaAs, CdTe, and others from\nGroup IV, III-V, and II-VI due to their technological relevance but our\nframework is readily applicable to a wide range of emerging 2D and 3D\nmaterials. In stark contrast to the macroscopic refractive index of these\nmaterials used widely today, this picophotonic framework shows that hidden\nwaves exist throughout the crystal lattice and have unique pico-polarization\ntexture and crowding. We also present an open-source software package,\nPurdue-PicoMax, for the research community to discover hidden waves in new\nmaterials like hBN, graphene, and Moire materials. Our work establishes a\nfoundational crystallographic feature to discover novel pico-optical waves in\nlight-matter interaction.\n","subjects":["Physics/Optics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}