{"id":"2407.01213","title":"EMIF: Evidence-aware Multi-source Information Fusion Network for\n  Explainable Fake News Detection","authors":"Qingxing Dong, Mengyi Zhang, Shiyuan Wu, Xiaozhen Wu","authorsParsed":[["Dong","Qingxing",""],["Zhang","Mengyi",""],["Wu","Shiyuan",""],["Wu","Xiaozhen",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 11:59:32 GMT"}],"updateDate":"2024-07-02","timestamp":1719835172000,"abstract":"  Extensive research on automatic fake news detection has been conducted due to\nthe significant detrimental effects of fake news proliferation. Most existing\napproaches rely on a single source of evidence, such as comments or relevant\nnews, to derive explanatory evidence for decision-making, demonstrating\nexceptional performance. However, their single evidence source suffers from two\ncritical drawbacks: (i) noise abundance, and (ii) resilience deficiency.\nInspired by the natural process of fake news identification, we propose an\nEvidence-aware Multi-source Information Fusion (EMIF) network that jointly\nleverages user comments and relevant news to make precise decision and excavate\nreliable evidence. To accomplish this, we initially construct a co-attention\nnetwork to capture general semantic conflicts between comments and original\nnews. Meanwhile, a divergence selection module is employed to identify the\ntop-K relevant news articles with content that deviates the most from the\noriginal news, which ensures the acquisition of multiple evidence with higher\nobjectivity. Finally, we utilize an inconsistency loss function within the\nevidence fusion layer to strengthen the consistency of two types of evidence,\nboth negating the authenticity of the same news. Extensive experiments and\nablation studies on real-world dataset FibVID show the effectiveness of our\nproposed model. Notably, EMIF shows remarkable robustness even in scenarios\nwhere a particular source of information is inadequate.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}