{"id":"2407.19923","title":"Performance of Higher-Order Networks in Reconstructing Sequential Paths:\n  from Micro to Macro Scale","authors":"Kevin Teo and Naomi Arnold and Andrew Hone and Istv\\'an Zolt\\'an Kiss","authorsParsed":[["Teo","Kevin",""],["Arnold","Naomi",""],["Hone","Andrew",""],["Kiss","István Zoltán",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 12:00:46 GMT"}],"updateDate":"2024-07-30","timestamp":1722254446000,"abstract":"  Activities such as the movement of passengers and goods, the transfer of\nphysical or digital assets, web navigation and even successive passes in\nfootball, result in timestamped paths through a physical or virtual network.\nThe need to analyse such paths has produced a new modelling paradigm in the\nform of higher-order networks which are able to capture temporal and\ntopological characteristics of sequential data. This has been complemented by\nsequence mining approaches, a key example being sequential motifs measuring the\nprevalence of recurrent subsequences. Previous work on higher-order networks\nhas focused on how to identify the optimal order for a path dataset, where the\norder can be thought of as the number of steps of memory encoded in the model.\nIn this paper, we build on these approaches to consider which orders are\nnecessary to reproduce different path characteristics, from path lengths to\ncounts of sequential motifs, viewing paths generated from different\nhigher-order models as null models which capture features of the data up to a\ncertain order, and randomised otherwise. Furthermore, we provide an important\nextension to motif counting, whereby cases with self-loops, starting nodes, and\nending nodes of paths are taken into consideration. Conducting a thorough\nanalysis using path lengths and sequential motifs on a diverse range of path\ndatasets, we show that our approach can shed light on precisely where models of\ndifferent order overperform or underperform, and what this may imply about the\noriginal path data.\n","subjects":["Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}