{"id":"2407.20087","title":"Bayesian optimization of laser wakefield acceleration in the\n  self-modulated regime (SM-LWFA) aiming to produce molybdenum-99 via\n  photonuclear reactions","authors":"B. S. Nunes, S. P. Santos, R. P. Nunes, C. Bon\\c{t}oiu, M. S.\n  Alva-S\\'anchez, R. E. Samad, N. D. Vieira Jr., G. Xia, J. Resta-L\\'opez, A.\n  Bonatto","authorsParsed":[["Nunes","B. S.",""],["Santos","S. P.",""],["Nunes","R. P.",""],["Bonţoiu","C.",""],["Alva-Sánchez","M. S.",""],["Samad","R. E.",""],["Vieira","N. D.","Jr."],["Xia","G.",""],["Resta-López","J.",""],["Bonatto","A.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:18:52 GMT"}],"updateDate":"2024-07-30","timestamp":1722266332000,"abstract":"  While laser wakefield acceleration (LWFA) in the bubble regime demands\nultra-short, high-peak-power laser pulses, operation in the self-modulated\nregime (SM-LWFA) works with more relaxed pulse conditions, albeit at the cost\nof lower beam quality. Modern laser systems can deliver pulses with durations\nof a few tens of femtoseconds and peak powers on the order of a few terawatts,\nat kHz repetition rates. These systems are well-suited for developing SM-LWFA\napplications where high average energy and charge are prioritized over beam\nquality. Such beams could be used to generate high-energy bremsstrahlung\nphotons, capable of triggering photonuclear reactions to produce radioisotopes\nlike molybdenum-99. This isotope decays into technetium-99m, the most widely\nused medical radioisotope, with over 30 million applications worldwide per\nyear. This work explores the use of Bayesian optimization to maximize the\nenergy and charge of electron beams accelerated via SM-LWFA. Particle-in-cell\n(PIC) simulations model a 5 TW, 15 fs-long Gaussian laser pulse, propagating\nthrough tailored hydrogen gas-density profiles. In these simulations, over\nmultiple iterations, the algorithm optimizes a set of input parameters\ncharacterizing the gas-density profile and the laser focal position. Three\ndistinct profiles, with total lengths ranging from 200 to 400 micrometers and\ncombining ramps and plateaus, were investigated. Optimal configurations were\nfound to produce electron beams with median energies ranging from 14 to 17 MeV\nand charges of 600 to 1300 pC, considering electrons with energies above 8 MeV.\nPreliminary estimates of the molybdenum-99 yields for the optimal beams were\nobtained by employing their phase spaces, retrieved from PIC simulations, as\nradiation source inputs in Monte Carlo simulations irradiating a combined\ntantalum and molybdenum target.\n","subjects":["Physics/Accelerator Physics","Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}