{"id":"2407.04021","title":"Total Lagrangian Smoothed Particle Hydrodynamics with An Improved\n  Bond-Based Deformation Gradient for Large Strain Solid Dynamics","authors":"I.M. Wiragunarsa, L. R. Zuhal, T. Dirgantara, I. S. Putra, E.\n  Febrianto","authorsParsed":[["Wiragunarsa","I. M.",""],["Zuhal","L. R.",""],["Dirgantara","T.",""],["Putra","I. S.",""],["Febrianto","E.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 15:59:58 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 12:46:37 GMT"}],"updateDate":"2024-09-05","timestamp":1720108798000,"abstract":"  Total Lagrangian Smoothed Particle Hydrodynamics (TLSPH) is one variant of\nSPH where the variables are described using the fixed reference configuration\nand a Lagrangian smoothing kernel. TLSPH elevates the computational efficiency\nof the standard SPH when no topological change is involved, and it alleviates\nthe stability of SPH scheme with respect to tensile loading. However,\ninstabilities associated with spurious mode, or hourglass/zero-energy mode,\npersists and often affects the simulation of solids undergoing extremely large\nstrain. This work proposes an alternative formulation to compute deformation\ngradient with improved accuracy and therefore minimising the possibility of\nencountering the zero-energy mode. Specifically, we leverage the local discrete\ncomputation of bond-based (or pairwise) deformation gradient smoothed by the\nkernel. Additionally, the bond of a particle with itself is considered to\npreserve the polynomial reproducibility imposed by the kernel correction\nscheme. We showcase the convergence of the approach using a two-dimensional\nbenchmark example. Furthermore, the accuracy, robustness, and stability of the\nproposed approach are assessed in various two- and three-dimensional examples,\nhighlighting on the stability improvement that allows for solid dynamic\nsimulations with more extreme elongation.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}