{"id":"2407.06109","title":"PerlDiff: Controllable Street View Synthesis Using Perspective-Layout\n  Diffusion Models","authors":"Jinhua Zhang, Hualian Sheng, Sijia Cai, Bing Deng, Qiao Liang, Wen Li,\n  Ying Fu, Jieping Ye, Shuhang Gu","authorsParsed":[["Zhang","Jinhua",""],["Sheng","Hualian",""],["Cai","Sijia",""],["Deng","Bing",""],["Liang","Qiao",""],["Li","Wen",""],["Fu","Ying",""],["Ye","Jieping",""],["Gu","Shuhang",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 16:46:47 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 14:05:17 GMT"}],"updateDate":"2024-07-17","timestamp":1720457207000,"abstract":"  Controllable generation is considered a potentially vital approach to address\nthe challenge of annotating 3D data, and the precision of such controllable\ngeneration becomes particularly imperative in the context of data production\nfor autonomous driving. Existing methods focus on the integration of diverse\ngenerative information into controlling inputs, utilizing frameworks such as\nGLIGEN or ControlNet, to produce commendable outcomes in controllable\ngeneration. However, such approaches intrinsically restrict generation\nperformance to the learning capacities of predefined network architectures. In\nthis paper, we explore the integration of controlling information and introduce\nPerlDiff (Perspective-Layout Diffusion Models), a method for effective street\nview image generation that fully leverages perspective 3D geometric\ninformation. Our PerlDiff employs 3D geometric priors to guide the generation\nof street view images with precise object-level control within the network\nlearning process, resulting in a more robust and controllable output. Moreover,\nit demonstrates superior controllability compared to alternative layout control\nmethods. Empirical results justify that our PerlDiff markedly enhances the\nprecision of generation on the NuScenes and KITTI datasets. Our codes and\nmodels are publicly available at https://github.com/LabShuHangGU/PerlDiff.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}