{"id":"2407.14254","title":"Discrete element method model of soot aggregates","authors":"Egor V. Demidov, Gennady Y. Gor, Alexei F. Khalizov","authorsParsed":[["Demidov","Egor V.",""],["Gor","Gennady Y.",""],["Khalizov","Alexei F.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 03:31:47 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 13:51:55 GMT"}],"updateDate":"2024-08-02","timestamp":1721100707000,"abstract":"  Soot is a component of atmospheric aerosols that affects climate by\nscattering and absorbing the sunlight. Soot particles are fractal aggregates\ncomposed of elemental carbon. In the atmosphere, the aggregates acquire\ncoatings by condensation and coagulation, resulting in significant compaction\nof the aggregates that changes the direct climate forcing of soot. Currently,\nno models exist to rigorously describe the process of soot restructuring,\nreducing prediction accuracy of atmospheric aerosol models. We develop a\ndiscrete element method contact model to simulate restructuring of fractal soot\naggregates, represented as assemblies of spheres joined by cohesion and by\nsintered necks. The model is parametrized based on atomic force spectroscopy\ndata and is used to simulate soot restructuring, showing that the fraction of\nnecks in aggregates determines the restructuring pathway. Aggregates with fewer\nnecks undergo local compaction, while aggregates with nearly-full necking\nprefer global compaction. Additionally, full compaction occurs within tens of\nnanoseconds, orders of magnitude faster than the time scale of soot aging\nthrough condensation. An important implication is that in atmospheric soot\naggregates, the rate of condensation determines how many necks are fractured\nsimultaneously, affecting the restructuring pathway, e.g., producing highly\ncompact, thinly-coated soot as observed in recent studies.\n","subjects":["Physics/Computational Physics","Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2NlDUMBwfQpYbs6xW-ZXzR5n_9Gd8P8_rZHqaPHOias","pdfSize":"5928120"}
