{"id":"2407.02593","title":"A Detailed Chemical Study of the Extreme Velocity Stars in the Galaxy","authors":"Tyler Nelson, Keith Hawkins, Henrique Reggiani, Diego Garza, Rosemary\n  F.G. Wyse, Turner Woody","authorsParsed":[["Nelson","Tyler",""],["Hawkins","Keith",""],["Reggiani","Henrique",""],["Garza","Diego",""],["Wyse","Rosemary F. G.",""],["Woody","Turner",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 18:30:19 GMT"}],"updateDate":"2024-07-04","timestamp":1719945019000,"abstract":"  Two decades on, the study of hypervelocity stars is still in its infancy.\nThese stars can provide novel constraints on the total mass of the Galaxy and\nits Dark Matter distribution. However how these stars are accelerated to such\nhigh velocities is unclear. Various proposed production mechanisms for these\nstars can be distinguished using chemo-dynamic tagging. The advent of Gaia and\nother large surveys have provided hundreds of candidate hyper velocity objects\nto target for ground based high resolution follow-up observations. We conduct\nhigh resolution spectroscopic follow-up observations of 16 candidate late-type\nhyper velocity stars using the Apache Point Observatory and the McDonald\nObservatory. We derive atmospheric parameters and chemical abundances for these\nstars. We measure up to 22 elements, including the following nucleosynthetic\nfamilies: {\\alpha} (Mg, Si, Ca, Ti), light/Odd-Z (Na, Al, V, Cu, Sc), Fe-peak\n(Fe, Cr, Mn, Co, Ni, Zn), and Neutron Capture (Sr, Y, Zr, Ba, La, Nd, Eu). Our\nkinematic analysis shows one candidate is unbound, two are marginally bound,\nand the remainder are bound to the Galaxy. Finally, for the three unbound or\nmarginally bound stars, we perform orbit integration to locate possible\nglobular cluster or dwarf galaxy progenitors. We do not find any likely\ncandidate systems for these stars and conclude that the unbound stars are\nlikely from the the stellar halo, in agreement with the chemical results. The\nremaining bound stars are all chemically consistent with the stellar halo as\nwell.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}