{"id":"2407.15989","title":"Robustness of neutron star merger simulations to changes in neutrino\n  transport and neutrino-matter interactions","authors":"Francois Foucart, Patrick Chi-Kit Cheong, Matthew D. Duez, Lawrence E.\n  Kidder, Harald P. Pfeiffer, Mark A. Scheel","authorsParsed":[["Foucart","Francois",""],["Cheong","Patrick Chi-Kit",""],["Duez","Matthew D.",""],["Kidder","Lawrence E.",""],["Pfeiffer","Harald P.",""],["Scheel","Mark A.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:59:18 GMT"}],"updateDate":"2024-07-24","timestamp":1721674758000,"abstract":"  Binary neutron star mergers play an important role in nuclear astrophysics:\ntheir gravitational wave and electromagnetic signals carry information about\nthe equation of state of cold matter above nuclear saturation density, and they\nmay be one of the main sources of r-process elements in the Universe.\nNeutrino-matter interactions during and after merger impact the properties of\nthese electromagnetic signals, and the relative abundances of the produced\nr-process elements. Existing merger simulations are however limited in their\nability to realistically model neutrino transport and neutrino-matter\ninteractions. Here, we perform a comparison of the impact of the use of\nstate-of-the art two-moment or Monte-Carlo transport schemes on the outcome of\nmerger simulations, for a single binary neutron star system with a short-lived\nneutron star remnant ($(5-10)\\,{\\rm ms}$). We also investigate the use of\ndifferent reaction rates in the simulations. While the best transport schemes\ngenerally agree well on the qualitative impact of neutrinos on the system,\ndifferences in the behavior of the high-density regions can significantly\nimpact the collapse time and the properties of the hot tidal arms in this\nmetastable merger remnant. The chosen interaction rates, transport algorithm,\nas well as recent improvements by Radice et al to the two-moment algorithms can\nall contribute to changes at the $(10-30)\\%$ level in the global properties of\nthe merger remnant and outflows. The limitations of previous moment schemes\nfixed by Radice et al also appear sufficient to explain the large difference\nthat we observed in the production of heavy-lepton neutrinos in a previous\ncomparison of Monte-Carlo and moment schemes in the context of a low mass\nbinary neutron star system.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}