{"id":"2407.11666","title":"Neural Compression of Atmospheric States","authors":"Piotr Mirowski, David Warde-Farley, Mihaela Rosca, Matthew Koichi\n  Grimes, Yana Hasson, Hyunjik Kim, M\\'elanie Rey, Simon Osindero, Suman\n  Ravuri, Shakir Mohamed","authorsParsed":[["Mirowski","Piotr",""],["Warde-Farley","David",""],["Rosca","Mihaela",""],["Grimes","Matthew Koichi",""],["Hasson","Yana",""],["Kim","Hyunjik",""],["Rey","Mélanie",""],["Osindero","Simon",""],["Ravuri","Suman",""],["Mohamed","Shakir",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 12:38:39 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 13:20:51 GMT"}],"updateDate":"2024-07-18","timestamp":1721133519000,"abstract":"  Atmospheric states derived from reanalysis comprise a substantial portion of\nweather and climate simulation outputs. Many stakeholders -- such as\nresearchers, policy makers, and insurers -- use this data to better understand\nthe earth system and guide policy decisions. Atmospheric states have also\nreceived increased interest as machine learning approaches to weather\nprediction have shown promising results. A key issue for all audiences is that\ndense time series of these high-dimensional states comprise an enormous amount\nof data, precluding all but the most well resourced groups from accessing and\nusing historical data and future projections. To address this problem, we\npropose a method for compressing atmospheric states using methods from the\nneural network literature, adapting spherical data to processing by\nconventional neural architectures through the use of the area-preserving\nHEALPix projection. We investigate two model classes for building neural\ncompressors: the hyperprior model from the neural image compression literature\nand recent vector-quantised models. We show that both families of models\nsatisfy the desiderata of small average error, a small number of high-error\nreconstructed pixels, faithful reproduction of extreme events such as\nhurricanes and heatwaves, preservation of the spectral power distribution\nacross spatial scales. We demonstrate compression ratios in excess of 1000x,\nwith compression and decompression at a rate of approximately one second per\nglobal atmospheric state.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition","Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}