{"id":"2407.17236","title":"Statistical Batch-Based Bearing Fault Detection","authors":"Victoria Jorry, Zina-Sabrina Duma, Tuomas Sihvonen, Satu-Pia\n  Reinikainen, and Lassi Roininen","authorsParsed":[["Jorry","Victoria",""],["Duma","Zina-Sabrina",""],["Sihvonen","Tuomas",""],["Reinikainen","Satu-Pia",""],["Roininen","Lassi",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 12:45:02 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 06:21:01 GMT"}],"updateDate":"2024-07-26","timestamp":1721825102000,"abstract":"  In the domain of rotating machinery, bearings are vulnerable to different\nmechanical faults, including ball, inner, and outer race faults. Various\ntechniques can be used in condition-based monitoring, from classical signal\nanalysis to deep learning methods. Based on the complex working conditions of\nrotary machines, multivariate statistical process control charts such as\nHotelling's $T^2$ and Squared Prediction Error are useful for providing early\nwarnings. However, these methods are rarely applied to condition monitoring of\nrotating machinery due to the univariate nature of the datasets. In the present\npaper, we propose a multivariate statistical process control-based fault\ndetection method that utilizes multivariate data composed of Fourier transform\nfeatures extracted for fixed-time batches. Our approach makes use of the\nmultidimensional nature of Fourier transform characteristics, which record more\ndetailed information about the machine's status, in an effort to enhance early\ndefect detection and diagnosis. Experiments with varying vibration measurement\nlocations (Fan End, Drive End), fault types (ball, inner, and outer race\nfaults), and motor loads (0-3 horsepower) are used to validate the suggested\napproach. The outcomes illustrate our method's effectiveness in fault detection\nand point to possible broader uses in industrial maintenance.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}