{"id":"2407.11886","title":"Automated production of batched unclonable micro-patterns\n  anti-counterfeiting labels with strong robustness and rapid recognition speed","authors":"Yuzheng He, Zunshuai Zhang, Yifei Xing, Zhiyuan Lang, Jinbo Wu, Jiong\n  Yang","authorsParsed":[["He","Yuzheng",""],["Zhang","Zunshuai",""],["Xing","Yifei",""],["Lang","Zhiyuan",""],["Wu","Jinbo",""],["Yang","Jiong",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 16:15:09 GMT"}],"updateDate":"2024-07-17","timestamp":1721146509000,"abstract":"  Anti-counterfeiting technologies are indeed crucial for information security\nand protecting product authenticity. Traditional anti-counterfeiting methods\nhave their limitations due to their clonable nature. Exploring new\ntechnologies, particularly those based on pixel-level textures is a promising\navenue to address the clonable issue due to high encoding capacity. However,\nresearch in this field is still in its infancy. This work introduces a new\nfluorescent anti-counterfeiting label technology with four key characteristics:\nefficient laser etching, high-throughput fabrication and segmentation,\nrobustness aided by data augmentation, and an exceptionally high recognition\nspeed. To be specific, the etching achieves a speed of 1,200 labels/3s, the\nhigh throughput yields a rate of 2,400 labels/4 min, and a total count of\n51,966 labels. The number of labels is further augmented to 5,196,600 by\nimplementing arbitrary rotation and brightness variation to enhance the\nrobustness in the recognition procedure. We divide these labels into 44\ncategories based on differences in patterns. Utilizing machine learning\nmethods, we have achieved a total recognition (including extraction and search\nprocess) time per label averaging 421.96 ms without classification, and 40.13\nms with classification. Specifically, the search process with classification is\nnearly fiftieth times shorter than the non-classification method, reaching 8.52\nmilliseconds in average. The overall recognition time is much faster than\nprevious works, and achieve an accuracy over 98.7%. This work significantly\nincreases the practicality of pixel-level anti-counterfeiting labels.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}