{"id":"2407.13870","title":"Effective conjugacy separability of virtually abelian groups","authors":"Jonas Der\\'e and Lukas Vandeputte","authorsParsed":[["Deré","Jonas",""],["Vandeputte","Lukas",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 19:33:39 GMT"}],"updateDate":"2024-07-22","timestamp":1721331219000,"abstract":"  A natural question for groups $H$ is which data can be detected in its finite\nquotients. A subset $X \\subset H$ is called separable if for all $h\\in H\n\\setminus X$, there exists an epimorphism $\\varphi$ to a finite group $Q$ such\nthat $\\varphi(h)\\notin\\varphi(X)$. More specifically, a group is said to be\nconjugacy separable if every conjugacy class is separable. It is known that\nmany classes of groups are conjugacy separable, including virtually free and\npolycyclic groups. The minimal order of the quotient $Q$, in terms of the\ncomplexity of the conjugacy classes under consideration, is captured by the\nconjugacy separability function $\\mathrm{Conj}_H: \\mathbb{N} \\to \\mathbb{N}$.\nThis function is in general ill understood, in fact the only large class of\ngroups for which it is known exactly are the abelian groups. Indeed, in this\ncase $\\mathrm{Conj}_H$ is equal to the residual finiteness function, that is\nthe size of quotients needed to separate singletons, and thus logarithmic if\nthe group is infinite.\n  Recent work has described the residual finiteness function for the class of\nvirtually abelian groups, which gives a lower bound for the conjugacy\nseparability function. The main result of this paper is a characterization of\n$\\mathrm{Conj}_H$ for every virtually abelian group $H$. If the corresponding\nextension is associated with an irreducible representation over $\\mathbb{Q}$,\nwe demonstrate that we obtain the same function as the residual finiteness\nfunction. However, if the representation is not irreducible, we find an\nexpression that is in some cases strictly larger, which we illustrate with\nseveral examples.\n","subjects":["Mathematics/Group Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}