{"id":"2407.02539","title":"Research on Autonomous Robots Navigation based on Reinforcement Learning","authors":"Zixiang Wang, Hao Yan, Yining Wang, Zhengjia Xu, Zhuoyue Wang,\n  Zhizhong Wu","authorsParsed":[["Wang","Zixiang",""],["Yan","Hao",""],["Wang","Yining",""],["Xu","Zhengjia",""],["Wang","Zhuoyue",""],["Wu","Zhizhong",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 00:44:06 GMT"},{"version":"v2","created":"Mon, 8 Jul 2024 16:50:48 GMT"},{"version":"v3","created":"Wed, 14 Aug 2024 04:49:22 GMT"}],"updateDate":"2024-08-15","timestamp":1719881046000,"abstract":"  Reinforcement learning continuously optimizes decision-making based on\nreal-time feedback reward signals through continuous interaction with the\nenvironment, demonstrating strong adaptive and self-learning capabilities. In\nrecent years, it has become one of the key methods to achieve autonomous\nnavigation of robots. In this work, an autonomous robot navigation method based\non reinforcement learning is introduced. We use the Deep Q Network (DQN) and\nProximal Policy Optimization (PPO) models to optimize the path planning and\ndecision-making process through the continuous interaction between the robot\nand the environment, and the reward signals with real-time feedback. By\ncombining the Q-value function with the deep neural network, deep Q network can\nhandle high-dimensional state space, so as to realize path planning in complex\nenvironments. Proximal policy optimization is a strategy gradient-based method,\nwhich enables robots to explore and utilize environmental information more\nefficiently by optimizing policy functions. These methods not only improve the\nrobot's navigation ability in the unknown environment, but also enhance its\nadaptive and self-learning capabilities. Through multiple training and\nsimulation experiments, we have verified the effectiveness and robustness of\nthese models in various complex scenarios.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}