{"id":"2407.20134","title":"Modular quantum processor with an all-to-all reconfigurable router","authors":"Xuntao Wu, Haoxiong Yan, Gustav Andersson, Alexander Anferov, Ming-Han\n  Chou, Christopher R. Conner, Joel Grebel, Yash J. Joshi, Shiheng Li, Jacob M.\n  Miller, Rhys G. Povey, Hong Qiao, Andrew N. Cleland","authorsParsed":[["Wu","Xuntao",""],["Yan","Haoxiong",""],["Andersson","Gustav",""],["Anferov","Alexander",""],["Chou","Ming-Han",""],["Conner","Christopher R.",""],["Grebel","Joel",""],["Joshi","Yash J.",""],["Li","Shiheng",""],["Miller","Jacob M.",""],["Povey","Rhys G.",""],["Qiao","Hong",""],["Cleland","Andrew N.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 16:02:03 GMT"},{"version":"v2","created":"Mon, 16 Sep 2024 23:46:05 GMT"}],"updateDate":"2024-09-18","timestamp":1722268923000,"abstract":"  Superconducting qubits provide a promising approach to large-scale\nfault-tolerant quantum computing. However, qubit connectivity on a planar\nsurface is typically restricted to only a few neighboring qubits. Achieving\nlonger-range and more flexible connectivity, which is particularly appealing in\nlight of recent developments in error-correcting codes, however usually\ninvolves complex multi-layer packaging and external cabling, which is\nresource-intensive and can impose fidelity limitations. Here, we propose and\nrealize a high-speed on-chip quantum processor that supports reconfigurable\nall-to-all coupling with a large on-off ratio. We implement the design in a\nfour-node quantum processor, built with a modular design comprising a wiring\nsubstrate coupled to two separate qubit-bearing substrates, each including two\nsingle-qubit nodes. We use this device to demonstrate reconfigurable\ncontrolled-Z gates across all qubit pairs, with a benchmarked average fidelity\nof $96.00\\%\\pm0.08\\%$ and best fidelity of $97.14\\%\\pm0.07\\%$, limited mainly\nby dephasing in the qubits. We also generate multi-qubit entanglement,\ndistributed across the separate modules, demonstrating GHZ-3 and GHZ-4 states\nwith fidelities of $88.15\\%\\pm0.24\\%$ and $75.18\\%\\pm0.11\\%$, respectively.\nThis approach promises efficient scaling to larger-scale quantum circuits, and\noffers a pathway for implementing quantum algorithms and error correction\nschemes that benefit from enhanced qubit connectivity.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}