{"id":"2407.06478","title":"Automated Chronotyping from a Daily Calendar using Machine Learning","authors":"Pratiik Kaushik, Koorosh Askari, Saksham Gupta, Rahul Mohan, Kris\n  Skrinak, Royan Kamyar, Benjamin Smarr","authorsParsed":[["Kaushik","Pratiik",""],["Askari","Koorosh",""],["Gupta","Saksham",""],["Mohan","Rahul",""],["Skrinak","Kris",""],["Kamyar","Royan",""],["Smarr","Benjamin",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 00:55:28 GMT"},{"version":"v2","created":"Sat, 7 Sep 2024 19:55:48 GMT"}],"updateDate":"2024-09-10","timestamp":1720486528000,"abstract":"  Chronotype compares individuals' circadian phase to others. It contextualizes\nmental health risk assessments and detection of social jet lag, which can\nhamper mental health and cognitive performance. Existing ways of determining\nchronotypes, such as Dim Light Melatonin Onset (DLMO) or the\nMorningness-Eveningness Questionnaire (MEQ), are limited by being discrete in\ntime and time-intensive to update, meaning they rarely capture real-world\nvariability across time. Chronotyping users based on a daily planner app might\naugment existing methods to enable assessment continuously and at scale. This\npaper reports the construction of a supervised binary classifier that attempts\nto demonstrate the feasibility of this approach. 1,460 registered users from\nthe Owaves app opted in by filling out the MEQ survey between July 14, 2022,\nand May 1, 2023. 142 met the eligibility criteria. We used multimodal app data\nfrom individuals identified as morning and evening types from MEQ data, basing\nthe classifier on app time series data. This included daily timing for 8 main\nlifestyle activity types: exercise, sleep, social interactions, meal times,\nrelaxation, work, play, and miscellaneous, as defined in the app. The timing of\nactivities showed substantial change across time, as well as heterogeneity by\nactivity type. Our novel chronotyping classifier was able to predict the\nmorningness and eveningness of its users with an ROC AUC of 0.70. Our findings\ndemonstrate the feasibility of chronotype classification from multimodal,\nreal-world app data, while highlighting fundamental challenges to applying\ndiscrete and fixed labels to complex, dynamic, multimodal behaviors. Our\nfindings suggest a potential for real-time monitoring of shifts in chronotype\nspecific to different causes (i.e. types of activity), which could feasibly be\nused to support future, prospective mental health support research.\n","subjects":["Quantitative Biology/Other Quantitative Biology"],"license":"http://creativecommons.org/licenses/by/4.0/"}