{"id":"2407.15416","title":"Uplink Transmit Power Optimization for Distributed Massive MIMO Systems\n  with 1-Bit ADCs","authors":"Bikshapathi Gouda, Italo Atzeni, and Antti T\\\"olli","authorsParsed":[["Gouda","Bikshapathi",""],["Atzeni","Italo",""],["Tölli","Antti",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 06:42:41 GMT"}],"updateDate":"2024-07-23","timestamp":1721630561000,"abstract":"  This paper addresses the problem of uplink transmit power optimization in\ndistributed massive multiple-input multiple-output systems, where remote radio\nheads (RRHs) are equipped with 1-bit analog-to-digital converters (ADCs).\nFirst, in a scenario where a single RRH serves a single user equipment (UE),\nthe signal-to-noise-and-distortion ratio (SNDR) is shown to be a non-monotonic\nand unimodal function of the UE transmit power due to the quantization\ndistortion (QD). Upon the introduction of multiple RRHs, adding properly tuned\ndithering at each RRH is shown to render the SNDR at the output of the joint\nreceiver unimodal. In a scenario with multiple RRHs and UEs, considering the\nnon-monotonic nature of the signal-to-interference-plus-noise-and-distortion\nratio (SINDR), both the UE transmit powers and the RRH dithering levels are\njointly optimized subject to the min-power and max-min-SINDR criteria, while\nemploying Bussgang-based maximum ratio combining (BMRC) and minimum mean\nsquared error (BMMSE) receivers. To this end, gradient and block coordinate\ndescent methods are introduced to tune the UE transmit powers, whereas a line\nsearch coupled with gradient updates is used to adjust the RRH dithering\nlevels. Numerical results demonstrate that jointly optimizing the UE transmit\npower and the RRH dithering levels can significantly enhance the system\nperformance, thus facilitating joint reception from multiple RRHs across a\nrange of scenarios. Comparing the BMMSE and BMRC receivers, the former offers a\nbetter interference and QD alleviation while the latter has a lower\ncomputational complexity.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}