{"id":"2407.15787","title":"M&M: Unsupervised Mamba-based Mastoidectomy for Cochlear Implant Surgery\n  with Noisy Data","authors":"Yike Zhang, Eduardo Davalos, Dingjie Su, Ange Lou, Jack H. Noble","authorsParsed":[["Zhang","Yike",""],["Davalos","Eduardo",""],["Su","Dingjie",""],["Lou","Ange",""],["Noble","Jack H.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 16:47:29 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 14:33:12 GMT"},{"version":"v3","created":"Sun, 18 Aug 2024 20:38:13 GMT"}],"updateDate":"2024-08-20","timestamp":1721666849000,"abstract":"  Cochlear Implant (CI) procedures involve inserting an array of electrodes\ninto the cochlea located inside the inner ear. Mastoidectomy is a surgical\nprocedure that uses a high-speed drill to remove part of the mastoid region of\nthe temporal bone, providing safe access to the cochlea through the middle and\ninner ear. We aim to develop an intraoperative navigation system that registers\nplans created using 3D preoperative Computerized Tomography (CT) volumes with\nthe 2D surgical microscope view. Herein, we propose a method to synthesize the\nmastoidectomy volume using only the preoperative CT scan, where the mastoid is\nintact. We introduce an unsupervised learning framework designed to synthesize\nmastoidectomy. For model training purposes, this method uses postoperative CT\nscans to avoid manual data cleaning or labeling, even when the region removed\nduring mastoidectomy is visible but affected by metal artifacts, low\nsignal-to-noise ratio, or electrode wiring. Our approach estimates\nmastoidectomy regions with a mean dice score of 70.0%. This approach represents\na major step forward for CI intraoperative navigation by predicting realistic\nmastoidectomy-removed regions in preoperative planning that can be used to\nregister the pre-surgery plan to intraoperative microscopy.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}