{"id":"2407.02275","title":"Learning Paradigms and Modelling Methodologies for Digital Twins in\n  Process Industry","authors":"Michael Mayr and Georgios C. Chasparis and Josef K\\\"ung","authorsParsed":[["Mayr","Michael",""],["Chasparis","Georgios C.",""],["Küng","Josef",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 14:05:10 GMT"}],"updateDate":"2024-07-03","timestamp":1719929110000,"abstract":"  Central to the digital transformation of the process industry are Digital\nTwins (DTs), virtual replicas of physical manufacturing systems that combine\nsensor data with sophisticated data-based or physics-based models, or a\ncombination thereof, to tackle a variety of industrial-relevant tasks like\nprocess monitoring, predictive control or decision support. The backbone of a\nDT, i.e. the concrete modelling methodologies and architectural frameworks\nsupporting these models, are complex, diverse and evolve fast, necessitating a\nthorough understanding of the latest state-of-the-art methods and trends to\nstay on top of a highly competitive market. From a research perspective,\ndespite the high research interest in reviewing various aspects of DTs,\nstructured literature reports specifically focusing on unravelling the utilized\nlearning paradigms (e.g. self-supervised learning) for DT-creation in the\nprocess industry are a novel contribution in this field. This study aims to\naddress these gaps by (1) systematically analyzing the modelling methodologies\n(e.g. Convolutional Neural Network, Encoder-Decoder, Hidden Markov Model) and\nparadigms (e.g. data-driven, physics-based, hybrid) used for DT-creation; (2)\nassessing the utilized learning strategies (e.g. supervised, unsupervised,\nself-supervised); (3) analyzing the type of modelling task (e.g. regression,\nclassification, clustering); and (4) identifying the challenges and research\ngaps, as well as, discuss potential resolutions provided.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}