{"id":"2407.12781","title":"VD3D: Taming Large Video Diffusion Transformers for 3D Camera Control","authors":"Sherwin Bahmani, Ivan Skorokhodov, Aliaksandr Siarohin, Willi\n  Menapace, Guocheng Qian, Michael Vasilkovsky, Hsin-Ying Lee, Chaoyang Wang,\n  Jiaxu Zou, Andrea Tagliasacchi, David B. Lindell, Sergey Tulyakov","authorsParsed":[["Bahmani","Sherwin",""],["Skorokhodov","Ivan",""],["Siarohin","Aliaksandr",""],["Menapace","Willi",""],["Qian","Guocheng",""],["Vasilkovsky","Michael",""],["Lee","Hsin-Ying",""],["Wang","Chaoyang",""],["Zou","Jiaxu",""],["Tagliasacchi","Andrea",""],["Lindell","David B.",""],["Tulyakov","Sergey",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 17:59:05 GMT"},{"version":"v2","created":"Sat, 20 Jul 2024 19:43:10 GMT"}],"updateDate":"2024-07-23","timestamp":1721239145000,"abstract":"  Modern text-to-video synthesis models demonstrate coherent, photorealistic\ngeneration of complex videos from a text description. However, most existing\nmodels lack fine-grained control over camera movement, which is critical for\ndownstream applications related to content creation, visual effects, and 3D\nvision. Recently, new methods demonstrate the ability to generate videos with\ncontrollable camera poses these techniques leverage pre-trained U-Net-based\ndiffusion models that explicitly disentangle spatial and temporal generation.\nStill, no existing approach enables camera control for new, transformer-based\nvideo diffusion models that process spatial and temporal information jointly.\nHere, we propose to tame video transformers for 3D camera control using a\nControlNet-like conditioning mechanism that incorporates spatiotemporal camera\nembeddings based on Plucker coordinates. The approach demonstrates\nstate-of-the-art performance for controllable video generation after\nfine-tuning on the RealEstate10K dataset. To the best of our knowledge, our\nwork is the first to enable camera control for transformer-based video\ndiffusion models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NJ8diHFH9mC2n4WvRr9dw0d0eZORsGXaODjIMex-oaw","pdfSize":"14255051"}
