{"id":"2407.16045","title":"Time-resolving PIV measurements and modal analysis of turbulent flow in\n  a bench-scale hydrodynamic separator","authors":"Haochen Li (University of Tennessee, Knoxville)","authorsParsed":[["Li","Haochen","","University of Tennessee, Knoxville"]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 20:49:50 GMT"}],"updateDate":"2024-07-24","timestamp":1721681390000,"abstract":"  Effective stormwater treatment infrastructures are crucial for mitigating the\nadverse effects of runoff on urban water quality. However, designing\ncost-effective treatment systems can be challenging due to complex turbulent\nflow dynamics. This study presents an in-depth analysis of turbulent flow in\nhydrodynamic separators (HS) using time-resolving, high-resolution particle\nimage velocimetry (PIV) and modal decomposition techniques. The examination of\ninterrogation window sizes on PIV measurements highlights a trade-off between\nspatial resolution and measurement uncertainty. Additionally, the impact of\nsampling frequencies and durations on the convergence of turbulence statistics,\nsuch as mean flow and Reynolds stress, is quantified. Results indicate that\nhigher-order statistics require significantly larger sampling sizes (5x) to\nachieve the same level of statistical convergence as mean flow statistics.\nLeveraging proper orthogonal decomposition (POD) and spectral proper orthogonal\ndecomposition (SPOD), dominant turbulence structures and coherent flow features\nare identified, providing a foundation for the development of reduced-order\nmodels (ROM). These ROMs demonstrate improved computational efficiency and have\npotential for real-time control applications and integration into larger\ndrainage-scale simulations. Furthermore, the outcome of this study establishes\na high-quality, open-source turbulent flow database for HS systems, offering\nthe civil and environmental engineering community valuable resources to guide\nthe development and application of computational fluid dynamics (CFD) tools.\nThis study represents a critical step toward the ultimate goal of facilitating\nscientifically guided HS design and optimization.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"j40tyHY0f3gRZJT3yfY-kmDpnGzUqpFHT6tAQv4INa0","pdfSize":"18312019"}
