{"id":"2407.15984","title":"Virtual Reality and Augmented Reality Security: A Reconnaissance and\n  Vulnerability Assessment Approach","authors":"Sarina Dastgerdy","authorsParsed":[["Dastgerdy","Sarina",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:51:59 GMT"}],"updateDate":"2024-07-24","timestamp":1721674319000,"abstract":"  Various industries have widely adopted Virtual Reality (VR) and Augmented\nReality (AR) technologies to enhance productivity and user experiences.\nHowever, their integration introduces significant security challenges. This\nsystematic literature review focuses on identifying devices used in AR and VR\ntechnologies and specifies the associated vulnerabilities, particularly during\nthe reconnaissance phase and vulnerability assessment, which are critical steps\nin penetration testing. Following Kitchenham and Charters' guidelines, we\nsystematically selected and analyzed primary studies. The reconnaissance phase\ninvolves gathering detailed information about AR and VR systems to identify\npotential attack vectors. In the vulnerability assessment phase, these vectors\nare analyzed to pinpoint weaknesses that malicious actors could exploit. Our\nfindings reveal that AR and VR devices, such as headsets (e.g., HTC Vive,\nOculus Quest), development platforms (e.g., Unity Framework, Google Cardboard\nSDK), and applications (e.g., Bigscreen VR, VRChat), are susceptible to various\nattacks, including remote code execution, cross-site scripting (XSS),\neavesdropping, and man-in-the-room attacks. Specifically, the Bigscreen VR\napplication exhibited severe vulnerabilities like remote code execution (RCE)\nvia the 'Application.OpenURL' API, XSS in user inputs, and botnet propagation.\nSimilarly, the Oculus Quest demonstrated susceptibility to side-channel attacks\nand ransomware. This paper provides a detailed overview of specific device\nvulnerabilities and emphasizes the importance of the initial steps in\npenetration testing to identify security weaknesses in AR and VR systems. By\nhighlighting these vulnerabilities, we aim to assist researchers in exploring\nand mitigating these security challenges, ensuring the safe deployment and use\nof AR and VR technologies across various sectors.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}