{"id":"2407.18056","title":"Computing an Aircraft's Gliding Range and Minimal Return Altitude in\n  Presence of Obstacles and Wind","authors":"Giovanni Piccioli","authorsParsed":[["Piccioli","Giovanni",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 14:09:38 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 13:06:13 GMT"}],"updateDate":"2024-07-30","timestamp":1721916578000,"abstract":"  In the event of a total loss of thrust, a pilot must identify a reachable\nlanding site and subsequently execute a forced landing. To do so, they must\nestimate which region on the ground can be reached safely in gliding flight. We\ncall this the gliding reachable region (GRR). To compute the GRR, we employ an\noptimal control formulation aiming to reach a point in space while minimizing\naltitude loss. A simplified model of the aircraft's dynamics is used, where the\neffect of turns is neglected. The resulting equations are discretized on a grid\nand solved numerically. Our algorithm for computing the GRR is fast enough to\nrun in real time during flight, it accounts for ground obstacles and wind, and\nfor each point in the GRR it outputs the path to reach it with minimal loss of\naltitude.\n  A related problem is estimating the minimal altitude an aircraft needs in\norder to glide to a given airfield in the presence of obstacles. This\ninformation enables pilots to plan routes that always have an airport within\ngliding distance. We formalize this problem using an optimal control\nformulation based on the same aircraft dynamics model. The resulting equations\nare solved with a second algorithm that outputs the minimal re-entry altitude\nand the paths to reach the airfield from any position while avoiding obstacles.\n  The algorithms we develop are based on the Ordered Upwind Method and the Fast\nMarching Method.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Numerical Analysis","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/"}