{"id":"2407.21045","title":"Unlocking the Potential: Benchmarking Large Language Models in Water\n  Engineering and Research","authors":"Boyan Xu, Liang Wen, Zihao Li, Yuxing Yang, Guanlan Wu, Xiongpeng\n  Tang, Yu Li, Zihao Wu, Qingxian Su, Xueqing Shi, Yue Yang, Rui Tong, How Yong\n  Ng","authorsParsed":[["Xu","Boyan",""],["Wen","Liang",""],["Li","Zihao",""],["Yang","Yuxing",""],["Wu","Guanlan",""],["Tang","Xiongpeng",""],["Li","Yu",""],["Wu","Zihao",""],["Su","Qingxian",""],["Shi","Xueqing",""],["Yang","Yue",""],["Tong","Rui",""],["Ng","How Yong",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 12:32:22 GMT"}],"updateDate":"2024-08-01","timestamp":1721651542000,"abstract":"  Recent advancements in Large Language Models (LLMs) have sparked interest in\ntheir potential applications across various fields. This paper embarked on a\npivotal inquiry: Can existing LLMs effectively serve as \"water expert models\"\nfor water engineering and research tasks? This study was the first to evaluate\nLLMs' contributions across various water engineering and research tasks by\nestablishing a domain-specific benchmark suite, namely, WaterER. Herein, we\nprepared 983 tasks related to water engineering and research, categorized into\n\"wastewater treatment\", \"environmental restoration\", \"drinking water treatment\nand distribution\", \"sanitation\", \"anaerobic digestion\" and \"contaminants\nassessment\". We evaluated the performance of seven LLMs (i.e., GPT-4, GPT-3.5,\nGemini, GLM-4, ERNIE, QWEN and Llama3) on these tasks. We highlighted the\nstrengths of GPT-4 in handling diverse and complex tasks of water engineering\nand water research, the specialized capabilities of Gemini in academic\ncontexts, Llama3's strongest capacity to answer Chinese water engineering\nquestions and the competitive performance of Chinese-oriented models like\nGLM-4, ERNIE and QWEN in some water engineering tasks. More specifically,\ncurrent LLMs excelled particularly in generating precise research gaps for\npapers on \"contaminants and related water quality monitoring and assessment\".\nAdditionally, they were more adept at creating appropriate titles for research\npapers on \"treatment processes for wastewaters\", \"environmental restoration\",\nand \"drinking water treatment\". Overall, this study pioneered evaluating LLMs\nin water engineering and research by introducing the WaterER benchmark to\nassess the trustworthiness of their predictions. This standardized evaluation\nframework would also drive future advancements in LLM technology by using\ntargeting datasets, propelling these models towards becoming true \"water\nexpert\".\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}