{"id":"2407.00309","title":"Reconsidering the nonlinear emergent inductance: time-varying Joule\n  heating and its impact on the AC electrical response","authors":"Soju Furuta, Wataru Koshibae, Keisuke Matsuura, Nobuyuki Abe, Fei\n  Wang, Shuyun Zhou, Taka-hisa Arima, and Fumitaka Kagawa","authorsParsed":[["Furuta","Soju",""],["Koshibae","Wataru",""],["Matsuura","Keisuke",""],["Abe","Nobuyuki",""],["Wang","Fei",""],["Zhou","Shuyun",""],["Arima","Taka-hisa",""],["Kagawa","Fumitaka",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 04:15:37 GMT"}],"updateDate":"2024-07-02","timestamp":1719634537000,"abstract":"  A nonlinearly enhanced electrical reactance, $\\Im Z$, under a large AC\ncurrent has been measured to explore emergent inductors, which constitute a new\nclass of inductors based on the spin-transfer torque effect. A nonlinear $\\Im\nZ$ has been observed in conducting magnets that contain noncollinear spin\ntextures and interpreted as the realization of an inductance due to\ncurrent-induced spin dynamics. However, curious behavior has concomitantly been\nobserved. For instance, the nonlinear $\\Im Z$ always has a cutoff frequency of\n$10^0$--$10^4$ Hz, which is much lower than the resonance frequency of a\nferromagnetic domain wall, $\\sim$10$^7$ Hz; furthermore, the temperature and\nmagnetic field variations in $\\Im Z$ appear to be considerably correlated with\nthose in the temperature derivative of resistance. This behavior appears to be\ndifficult to understand in terms of the current-induced spin dynamics, and\ntherefore, the earlier interpretation of the nonlinear $\\Im Z$ should be\nfurther verified. Here, we theoretically and experimentally show that\ntime-varying Joule heating and its impact on the AC electrical response can\nnaturally explain these observations. In the experimental approach, we study\nthe nonlinear AC electrical response of two conducting materials that exhibit\nno magnetic order, CuIr$_2$S$_4$ and 1$T$'-MoTe$_2$. Under time-varying Joule\nheating, a nonlinearly enhanced $\\Im Z$ with the curious behavior mentioned\nabove is observed in both systems. Our study implies that the nonlinear $\\Im Z$\npreviously observed in noncollinear magnets includes a considerable\ncontribution of the Joule-heating-induced apparent AC impedance.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IkEkb5Vu4GVwe6OqEX44AM4_AH4aicyE8lxObhA1Nzk","pdfSize":"1035087","objectId":"0xe831554fae341da02bd5d68e5c8cddbc08048bf48c05688c37cd08083e500328","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
