{"id":"2407.07146","title":"Constraints on FRB emission in the aftermath of GRBs","authors":"Barbara Patricelli, Maria Grazia Bernardini and Matteo Ferro","authorsParsed":[["Patricelli","Barbara",""],["Bernardini","Maria Grazia",""],["Ferro","Matteo",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-11","timestamp":1720548001000,"abstract":"  Fast Radio Bursts (FRBs) are highly energetic radio transients with\nmillisecond duration, whose physical origin is still unknown. Many models\nconsider magnetars as possible FRB sources, supported by the observational\nassociation of FRBs with the galactic magnetar SGR 1935+2154. Magnetars are\nalso thought to be the source of the power of a fraction of Gamma Ray Bursts\n(GRBs), opening the possibility that the two extreme phenomena have a common\nprogenitor. In this work we put constrains to this hypothesis searching for\npossible associations between GRBs and FRBs with currently available catalogs,\nand estimating if the lack of coincident detection can rule out their\nassociation. We cross-matched all the Swift GRBs detected so far with all the\nwell-localised FRBs reported in the FRBSTATS catalog, and we looked for FRB-GRB\nassociations considering both spatial and temporal constraints. We also\nsimulated a synthetic population of FRBs associated with Swift GRBs to estimate\nhow likely it is to have a joint detection with current and future radio\nfacilities. We recover two, low significant, possible associations already\nreported in literature from the catalogs' matches: GRB 110715A/FRB 20171209A\nand GRB 060502B/FRB 20190309A. However, our study shows that the absence of any\nunambiguous association so far between Swift GRBs and FRBs cannot exclude that\nthe two populations are connected, given the characteristics of current GRB and\nFRB detectors. Currently available observational data are not sufficient to\nclearly exclude/confirm whether GRBs and FRBs are physically associated. In the\nnext decade, with new generations of GRB and FRB detectors there will be a\nhigher probability to detect joint GRB-FRB events, if any: future observations\nwill therefore be key to put more stringent constraints on the hypothesis that\nFRBs and GRBs have common progenitors.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}