{"id":"2407.15735","title":"A Real-Time Suite of Biological Cell Image Analysis Software for\n  Computers, Smartphones, and Smart Glasses, Suitable for Resource-Constrained\n  Computing","authors":"Alexandre Matov","authorsParsed":[["Matov","Alexandre",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:39:58 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 05:53:03 GMT"},{"version":"v3","created":"Fri, 16 Aug 2024 16:57:31 GMT"}],"updateDate":"2024-08-19","timestamp":1721662798000,"abstract":"  Methods for personalizing medical treatment are the focal point of\ncontemporary clinical research. In cancer care, for instance, we can analyze\nthe effects of therapies at the level of individual cells. Complete\ncharacterization of treatment efficacy and evaluation of why some individuals\nrespond to specific regimens, whereas others do not, requires additional\napproaches to genetic sequencing at single time points. Methods for the\ncontinuous analysis of changes in phenotype, such as morphology and motion\ntracking of cellular proteins and organelles over time frames spanning the\nminute-hour scales, can provide important insight to patient treatment options.\nThe integration of measurements of intracellular dynamics and the contribution\nof multiple genetic pathways in degenerative diseases is vital for the\ndevelopment of biomarkers for the early detection of pathogenesis and therapy\nefficacy. We have developed a software suite (DataSet Tracker) for real-time\nanalysis designed to run on computers, smartphones, and smart glasses hardware\nand suitable for resource-constrained, on-the-fly computing in microscopes\nwithout internet connectivity; a demo is available for viewing at\ndatasetanalysis.com. Our objective is to present the community with an\nintegrated, easy to use by all, tool for resolving the complex dynamics of the\ncytoskeletal meshworks, intracytoplasmic membranous networks, and vesicle\ntrafficking. It is our goal to have this integrated tool approved for use in\nthe clinical practice.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}