{"id":"2407.15238","title":"Variational Potential Flow: A Novel Probabilistic Framework for\n  Energy-Based Generative Modelling","authors":"Junn Yong Loo, Michelle Adeline, Arghya Pal, Vishnu Monn Baskaran,\n  Chee-Ming Ting, Raphael C.-W. Phan","authorsParsed":[["Loo","Junn Yong",""],["Adeline","Michelle",""],["Pal","Arghya",""],["Baskaran","Vishnu Monn",""],["Ting","Chee-Ming",""],["Phan","Raphael C. -W.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 18:08:12 GMT"}],"updateDate":"2024-07-23","timestamp":1721585292000,"abstract":"  Energy based models (EBMs) are appealing for their generality and simplicity\nin data likelihood modeling, but have conventionally been difficult to train\ndue to the unstable and time-consuming implicit MCMC sampling during\ncontrastive divergence training. In this paper, we present a novel energy-based\ngenerative framework, Variational Potential Flow (VAPO), that entirely\ndispenses with implicit MCMC sampling and does not rely on complementary latent\nmodels or cooperative training. The VAPO framework aims to learn a potential\nenergy function whose gradient (flow) guides the prior samples, so that their\ndensity evolution closely follows an approximate data likelihood homotopy. An\nenergy loss function is then formulated to minimize the Kullback-Leibler\ndivergence between density evolution of the flow-driven prior and the data\nlikelihood homotopy. Images can be generated after training the potential\nenergy, by initializing the samples from Gaussian prior and solving the ODE\ngoverning the potential flow on a fixed time interval using generic ODE\nsolvers. Experiment results show that the proposed VAPO framework is capable of\ngenerating realistic images on various image datasets. In particular, our\nproposed framework achieves competitive FID scores for unconditional image\ngeneration on the CIFAR-10 and CelebA datasets.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"agT2Eh03XOzwdBRIGs35mtjTRdzX_ZCRznKRzM5oauU","pdfSize":"18502038"}
