{"id":"2407.09430","title":"Phenomenological emergent dark energy in the light of DESI Data Release\n  1","authors":"A. Hern\\'andez-Almada, M. L. Mendoza-Mart\\'inez, Miguel A.\n  Garc\\'ia-Aspeitia, V. Motta","authorsParsed":[["Hernández-Almada","A.",""],["Mendoza-Martínez","M. L.",""],["García-Aspeitia","Miguel A.",""],["Motta","V.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 17:01:54 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 14:20:35 GMT"}],"updateDate":"2024-09-19","timestamp":1720803714000,"abstract":"  This manuscript revisits the phenomenological emergent dark energy model\n(PEDE) by confronting it with recent cosmological data from early and late\ntimes. In particular we analyze PEDE model by using the baryon acoustic\noscillation (BAO) measurements coming from both Dark Energy Spectroscopy\nInstrument (DESI) data release 1 and Sloan Digital Sky Survey (SDSS).\nAdditionally, the measurements from cosmic chronometers, supernovae type Ia\n(Pantheon+), quasars, hydrogen II galaxies and cosmic background radiation\ndistance priors are considered. By performing a Bayesian analysis based on\nMonte Carlo Markov Chain, we find consistent results on the constraints when\nSDSS and DESI are considered. However, we find higher values on the Hubble\nconstant than Supernova $H_0$ for the Equation of State (SH0ES) does although\nit is still in agreement, within $1\\sigma$ confidence level, when BAO\nmeasurements are added. Furthermore, we estimate the age of the Universe\nyounger $\\sim3\\%$ than the one predicted by the standard cosmology.\nAdditionally, we report values of $q_0 = -0.771^{+0.007}_{-0.007}$, $z_T =\n0.764^{+0.011}_{-0.011}$ for the deceleration parameter today and the\ndeceleration-acceleration transition redshift, respectively. However, PEDE\ncosmology is disfavoured by the combined samples.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}