{"id":"2407.06536","title":"A Two-stage Evolutionary Framework For Multi-objective Optimization","authors":"Peng Chen, Jing Liang, Kangjia Qiao, Ponnuthurai Nagaratnam Suganthan,\n  Xuanxuan Ban","authorsParsed":[["Chen","Peng",""],["Liang","Jing",""],["Qiao","Kangjia",""],["Suganthan","Ponnuthurai Nagaratnam",""],["Ban","Xuanxuan",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 04:14:59 GMT"}],"updateDate":"2024-07-10","timestamp":1720498499000,"abstract":"  In the field of evolutionary multi-objective optimization, the approximation\nof the Pareto front (PF) is achieved by utilizing a collection of\nrepresentative candidate solutions that exhibit desirable convergence and\ndiversity. Although several multi-objective evolutionary algorithms (MOEAs)\nhave been designed, they still have difficulties in keeping balance between\nconvergence and diversity of population. To better solve multi-objective\noptimization problems (MOPs), this paper proposes a Two-stage Evolutionary\nFramework For Multi-objective Optimization (TEMOF). Literally, algorithms are\ndivided into two stages to enhance the search capability of the population.\nDuring the initial half of evolutions, parental selection is exclusively\nconducted from the primary population. Additionally, we not only perform\nenvironmental selection on the current population, but we also establish an\nexternal archive to store individuals situated on the first PF. Subsequently,\nin the second stage, parents are randomly chosen either from the population or\nthe archive. In the experiments, one classic MOEA and two state-of-the-art\nMOEAs are integrated into the framework to form three new algorithms. The\nexperimental results demonstrate the superior and robust performance of the\nproposed framework across a wide range of MOPs. Besides, the winner among three\nnew algorithms is compared with several existing MOEAs and shows better\nresults. Meanwhile, we conclude the reasons that why the two-stage framework is\neffect for the existing benchmark functions.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}