{"id":"2407.10094","title":"Work-From-Home and Privacy: What Do Workers Face and What are They Doing\n  About it?","authors":"Eman Alashwali and Joanne Peca and Mandy Lanyon and Lorrie Cranor","authorsParsed":[["Alashwali","Eman",""],["Peca","Joanne",""],["Lanyon","Mandy",""],["Cranor","Lorrie",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 06:15:28 GMT"}],"updateDate":"2024-07-16","timestamp":1720937728000,"abstract":"  The COVID-19 pandemic has reshaped the way people work, normalizing the\npractice of working from home (WFH). However, WFH can cause a blurring of\npersonal and professional boundaries, surfacing new privacy issues, especially\nwhen workers take work meetings from their homes. As WFH arrangements are now\nstandard practice in many organizations, addressing the associated privacy\nconcerns should be a key part of creating healthy work environments for\nworkers. To this end, we conducted a scenario-based survey with 214 US-based\nworkers who currently work from home regularly. Our results suggest that\nprivacy invasions are commonly experienced while working from home and cause\ndiscomfort to many workers. However, only a minority said that the discomfort\nescalated to cause harm to them or others, and the harm was almost always\npsychological. While scenarios that restrict worker autonomy (prohibit turning\noff camera or microphone) are the least experienced scenarios, they are\nassociated with the highest reported discomfort. In addition, participants\nreported measures that violated or would violate their employer's\nautonomy-restricting rules to protect their privacy. We also find that\nconference tool settings that can prevent privacy invasions are not widely used\ncompared to manual privacy-protective measures. Our findings provide better\nunderstanding of the privacy challenges landscape that WFH workers face and how\nthey address them. Furthermore, our discussion raised open questions that can\ninspire future work.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AonSycMc3oLNKkgGZv-0Ufo6KFTjqRHRcLG5L6hmUzU","pdfSize":"1263236"}
