{"id":"2407.13373","title":"Detection of maser emission at 183 and 380 GHz with ALMA in the\n  gigamaser galaxy TXS2226-184","authors":"A. Tarchi, P. Castangia, G. Surcis, V. Impellizzeri, E. Ladu, E. Yu\n  Bannikova","authorsParsed":[["Tarchi","A.",""],["Castangia","P.",""],["Surcis","G.",""],["Impellizzeri","V.",""],["Ladu","E.",""],["Bannikova","E. Yu",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 10:28:29 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 13:09:12 GMT"}],"updateDate":"2024-07-29","timestamp":1721298509000,"abstract":"  Abridged. The LINER galaxy TXS2226-184 is known to host a very luminous 22\nGHz water maser, called a gigamaser at the time of its discovery. To date, the\nnature of this maser is still being debated, in particular, whether it is\nassociated with a nuclear accretion disk or with an ejection component, namely\na jet or an outflow originating in the active galactic nucleus. We obtained\nmulti-band (bands 5, 6, and 7) ALMA observations during Cycle 9, with the\npurpose of investigating the maser nature and the nuclear molecular material in\nthe innermost region of the galaxy. While the full data sets are still under\nstudy, a preliminary data reduction and analysis of the band 5 and 7 spectral\nline cubes presented in this Letter already offer a significant outcome. We\nobserved bright, possibly maser emission from the water 183 GHz and 380 GHz\ntransitions in TXS2226. To the best of our knowledge, this represents the first\nunambiguous detection (S/N >= 100) of 380 GHz maser emission in a known 22-GHz\nmaser galaxy, and the first case where all three transitions are present in the\nsame object. Emission features at both frequencies show a two-peaked line\nprofile resembling that of the 22 GHz maser features. The mm/submm emission\noriginates from a region coincident, within the errors, with that of the 22\nGHz. The similarities in profile and position indicate that the emission at the\nthree frequencies is likely produced by the same nuclear structure, although\ndifferences in line strengths and feature peak positions may hint at a slightly\ndifferent physical conditions of the emitting gas. A comparison with the few\nmegamaser sources studied at high enough detail and sharing similarities with\nthe water lines in TXS2226 favors a nature associated with the amplification of\na bright nuclear continuum (from a jet or outflow) through dense and hot gas in\nfront of the nucleus (e.g., a disk or torus)...\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}