{"id":"2407.14802","title":"Non-local quench spectroscopy of fermionic excitations in 1D quantum\n  spin chains","authors":"Saverio Bocini, Filippo Caleca, Fabio Mezzacapo, Tommaso Roscilde","authorsParsed":[["Bocini","Saverio",""],["Caleca","Filippo",""],["Mezzacapo","Fabio",""],["Roscilde","Tommaso",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 08:24:01 GMT"}],"updateDate":"2024-07-23","timestamp":1721463841000,"abstract":"  The elementary excitations of quantum spin systems have generally the nature\nof weakly interacting bosonic quasi-particles, generated by local operators\nacting on the ground state. Nonetheless in one spatial dimension the nature of\nthe quasiparticles can change radically, since many relevant one-dimensional\n$S=1/2$ Hamiltonians can be exactly mapped onto models of spinless fermions\nwith local hopping and interactions. Due to the non-local nature of the\nspin-to-fermion mapping, observing directly the fermionic quasiparticle\nexcitations is impossible using local probes, which are at the basis of all the\nforms of spectroscopy (such as neutron scattering) traditionally available in\ncondensed matter physics. Here we show theoretically that \\emph{quench\nspectroscopy} for synthetic quantum matter -- which probes the excitation\nspectrum of a system by monitoring the nonequilibrium dynamics of its\ncorrelation functions -- can reconstruct accurately the dispersion relation of\nfermionic quasiparticles in spin chains. This possibility relies on the ability\nof quantum simulation experiments to measure non-local spin-spin correlation\nfunctions, corresponding to elementary fermionic correlation functions. Our\nanalysis is based on new exact results for the quench dynamics of quantum spin\nchains; and it opens the path to probe arbitrary quasiparticle excitations in\nsynthetic quantum matter.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Quantum Gases","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}