{"id":"2407.12543","title":"Abstraction Alignment: Comparing Model and Human Conceptual\n  Relationships","authors":"Angie Boggust and Hyemin Bang and Hendrik Strobelt and Arvind\n  Satyanarayan","authorsParsed":[["Boggust","Angie",""],["Bang","Hyemin",""],["Strobelt","Hendrik",""],["Satyanarayan","Arvind",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 13:27:26 GMT"}],"updateDate":"2024-07-18","timestamp":1721222846000,"abstract":"  Abstraction -- the process of generalizing specific examples into broad\nreusable patterns -- is central to how people efficiently process and store\ninformation and apply their knowledge to new data. Promisingly, research has\nshown that ML models learn representations that span levels of abstraction,\nfrom specific concepts like \"bolo tie\" and \"car tire\" to more general concepts\nlike \"CEO\" and \"model\". However, existing techniques analyze these\nrepresentations in isolation, treating learned concepts as independent\nartifacts rather than an interconnected web of abstraction. As a result,\nalthough we can identify the concepts a model uses to produce its output, it is\ndifficult to assess if it has learned a human-aligned abstraction of the\nconcepts that will generalize to new data. To address this gap, we introduce\nabstraction alignment, a methodology to measure the agreement between a model's\nlearned abstraction and the expected human abstraction. We quantify abstraction\nalignment by comparing model outputs against a human abstraction graph, such as\nlinguistic relationships or medical disease hierarchies. In evaluation tasks\ninterpreting image models, benchmarking language models, and analyzing medical\ndatasets, abstraction alignment provides a deeper understanding of model\nbehavior and dataset content, differentiating errors based on their agreement\nwith human knowledge, expanding the verbosity of current model quality metrics,\nand revealing ways to improve existing human abstractions.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}