{"id":"2407.17492","title":"Unraveling Molecular Structure: A Multimodal Spectroscopic Dataset for\n  Chemistry","authors":"Marvin Alberts, Oliver Schilter, Federico Zipoli, Nina Hartrampf,\n  Teodoro Laino","authorsParsed":[["Alberts","Marvin",""],["Schilter","Oliver",""],["Zipoli","Federico",""],["Hartrampf","Nina",""],["Laino","Teodoro",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 12:52:48 GMT"}],"updateDate":"2024-07-26","timestamp":1720097568000,"abstract":"  Spectroscopic techniques are essential tools for determining the structure of\nmolecules. Different spectroscopic techniques, such as Nuclear magnetic\nresonance (NMR), Infrared spectroscopy, and Mass Spectrometry, provide insight\ninto the molecular structure, including the presence or absence of functional\ngroups. Chemists leverage the complementary nature of the different methods to\ntheir advantage. However, the lack of a comprehensive multimodal dataset,\ncontaining spectra from a variety of spectroscopic techniques, has limited\nmachine-learning approaches mostly to single-modality tasks for predicting\nmolecular structures from spectra. Here we introduce a dataset comprising\nsimulated $^1$H-NMR, $^{13}$C-NMR, HSQC-NMR, Infrared, and Mass spectra\n(positive and negative ion modes) for 790k molecules extracted from chemical\nreactions in patent data. This dataset enables the development of foundation\nmodels for integrating information from multiple spectroscopic modalities,\nemulating the approach employed by human experts. Additionally, we provide\nbenchmarks for evaluating single-modality tasks such as structure elucidation,\npredicting the spectra for a target molecule, and functional group predictions.\nThis dataset has the potential automate structure elucidation, streamlining the\nmolecular discovery pipeline from synthesis to structure determination. The\ndataset and code for the benchmarks can be found at\nhttps://rxn4chemistry.github.io/multimodal-spectroscopic-dataset.\n","subjects":["Physics/Chemical Physics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ykryA7M2bXMcSjhY-vZU6BjZsE1QOvVytWWwutzDoP0","pdfSize":"12400169"}
