{"id":"2407.08310","title":"Robust quantum engineering of current flow in carbon nanostructures at\n  room temperature","authors":"Gaetano Calogero, Isaac Alc\\'on, Onurcan Kaya, Nick Papior, Aron W.\n  Cummings, Mads Brandbyge and Stephan Roche","authorsParsed":[["Calogero","Gaetano",""],["Alcón","Isaac",""],["Kaya","Onurcan",""],["Papior","Nick",""],["Cummings","Aron W.",""],["Brandbyge","Mads",""],["Roche","Stephan",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 08:58:57 GMT"}],"updateDate":"2024-07-12","timestamp":1720688337000,"abstract":"  Bottom-up on-surface synthesis enables the fabrication of carbon\nnanostructures with atomic precision. Good examples are graphene nanoribbons\n(GNRs), 1D conjugated polymers, and nanoporous graphenes (NPGs), which are\ngathering increasing attention for future carbon nanoelectronics. A key step is\nthe ability to manipulate current flow within these nanomaterials. Destructive\nquantum interference (QI), long studied in the field of single-molecule\nelectronics, has been proposed as the most effective way to achieve such\ncontrol with molecular-scale precision. However, for practical applications, it\nis essential that such QI-engineering remains effective near or above room\ntemperature. To assess this important point, here we combine large-scale\nmolecular dynamics simulations and quantum transport calculations and focus our\nstudy on NPGs formed as arrays of laterally bonded GNRs. By considering various\nNPGs with different inter-GNR chemical connections we disentangle the different\nfactors determining electronic transport in these carbon nanomaterials at 300\nK. Our findings unequivocally demonstrate that QI survives at room temperature,\nwith thermal vibrations weakly restricting current flow along GNRs while\ncompletely blocking transport across GNRs. Our results thus pave the way\ntowards the future realization of QI-engineered carbon nanocircuitry operating\nat room temperature, which is a fundamental step towards carbon-based\nnanoelectronics and quantum technologies.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}