{"id":"2407.06771","title":"Temporal Convolution Derived Multi-Layered Reservoir Computing","authors":"Johannes Viehweg, Dominik Walther, Patrick M\\\"ader","authorsParsed":[["Viehweg","Johannes",""],["Walther","Dominik",""],["Mäder","Patrick",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 11:40:46 GMT"}],"updateDate":"2024-08-31","timestamp":1720525246000,"abstract":"  The prediction of time series is a challenging task relevant in such diverse\napplications as analyzing financial data, forecasting flow dynamics or\nunderstanding biological processes. Especially chaotic time series that depend\non a long history pose an exceptionally difficult problem. While machine\nlearning has shown to be a promising approach for predicting such time series,\nit either demands long training time and much training data when using deep\nrecurrent neural networks. Alternative, when using a reservoir computing\napproach it comes with high uncertainty and typically a high number of random\ninitializations and extensive hyper-parameter tuning when using a reservoir\ncomputing approach. In this paper, we focus on the reservoir computing approach\nand propose a new mapping of input data into the reservoir's state space.\nFurthermore, we incorporate this method in two novel network architectures\nincreasing parallelizability, depth and predictive capabilities of the neural\nnetwork while reducing the dependence on randomness. For the evaluation, we\napproximate a set of time series from the Mackey-Glass equation, inhabiting\nnon-chaotic as well as chaotic behavior and compare our approaches in regard to\ntheir predictive capabilities to echo state networks and gated recurrent units.\nFor the chaotic time series, we observe an error reduction of up to $85.45\\%$\nand up to $87.90\\%$ in contrast to echo state networks and gated recurrent\nunits respectively. Furthermore, we also observe tremendous improvements for\nnon-chaotic time series of up to $99.99\\%$ in contrast to existing approaches.\n","subjects":["Computing Research Repository/Machine Learning","Nonlinear Sciences/Chaotic Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}