{"id":"2407.21277","title":"Two-Component gamma-ray Emission Spectrum and X-Ray Polarization of the\n  Radio Galaxy Pictor A","authors":"Jia-Xuan Li (BIT), Xin-Ke Hu (BIT), Ji-Shun Lian (BIT), Yu-Wei Yu\n  (BIT), Wei Deng (GXU), Kuan Liu (GXU), Hai-Ming Zhang (NJU), Liang Chen\n  (SHAO), Jin Zhang (BIT)","authorsParsed":[["Li","Jia-Xuan","","BIT"],["Hu","Xin-Ke","","BIT"],["Lian","Ji-Shun","","BIT"],["Yu","Yu-Wei","","BIT"],["Deng","Wei","","GXU"],["Liu","Kuan","","GXU"],["Zhang","Hai-Ming","","NJU"],["Chen","Liang","","SHAO"],["Zhang","Jin","","BIT"]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 01:56:59 GMT"}],"updateDate":"2024-08-01","timestamp":1722391019000,"abstract":"  Pictor A is a $\\gamma$-ray emitting radio galaxy and has a bright hotspot\ncalled WHS, located $\\sim$4 arcmin away from the nucleus. In this letter, we\npresent an analysis of its 16-year Fermi-LAT data and report the first Imaging\nX-ray Polarimetry Explorer (IXPE) observation for this source. Our analysis of\nthe Fermi-LAT observations reveals evidence of two components in the average\n$\\gamma$-ray spectrum of Pictor A, exhibiting a statistically significant\nhardening from $\\Gamma^1_{\\gamma}=3.25\\pm0.15$ to\n$\\Gamma^2_{\\gamma}=1.81\\pm0.07$ at a break energy of $2.46\\pm0.09$ GeV. The\nevident variability of $\\gamma$-rays is observed in Pictor A. Interestingly,\nthe variability is dominated by the component below the break energy, and the\ncomponent above the break energy shows no variability. Furthermore, we find\nthat a power-law function can adequately fit the spectrum during high-flux\nstates, whereas a broken power-law is still required to explain the spectrum\nduring low-flux state. We suggest that the low-energy component originates from\nthe nucleus, while the high-energy component primarily stems from WHS. The\nbroadband spectral energy distributions of both nucleus and WHS can be well\nrepresented by a simple leptonic model, with both $\\gamma$-ray components\nattributed to the synchrotron-self-Compton (SSC) process. The analysis of IXPE\ndata on the nucleus yields an upper limit to the polarization degree $\\Pi_{\\rm\nX}<$8.9\\% in the 2--8 keV band, agreeing with its X-ray emission originating\nfrom SSC. However, $\\Pi_{\\rm X}=23.5\\%\\pm5.6\\%$ is observed at a confidence\nlevel of $>99\\%$ in the 5--7 keV band, and the possible physical origin of this\nnarrow-energy-band polarization signal is discussed.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}