{"id":"2407.21498","title":"MaskUno: Switch-Split Block For Enhancing Instance Segmentation","authors":"Jawad Haidar, Marc Mouawad, Imad Elhajj, Daniel Asmar","authorsParsed":[["Haidar","Jawad",""],["Mouawad","Marc",""],["Elhajj","Imad",""],["Asmar","Daniel",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 10:12:14 GMT"}],"updateDate":"2024-08-01","timestamp":1722420734000,"abstract":"  Instance segmentation is an advanced form of image segmentation which, beyond\ntraditional segmentation, requires identifying individual instances of\nrepeating objects in a scene. Mask R-CNN is the most common architecture for\ninstance segmentation, and improvements to this architecture include steps such\nas benefiting from bounding box refinements, adding semantics, or backbone\nenhancements. In all the proposed variations to date, the problem of competing\nkernels (each class aims to maximize its own accuracy) persists when models try\nto synchronously learn numerous classes. In this paper, we propose mitigating\nthis problem by replacing mask prediction with a Switch-Split block that\nprocesses refined ROIs, classifies them, and assigns them to specialized mask\npredictors. We name the method MaskUno and test it on various models from the\nliterature, which are then trained on multiple classes using the benchmark COCO\ndataset. An increase in the mean Average Precision (mAP) of 2.03% was observed\nfor the high-performing DetectoRS when trained on 80 classes. MaskUno proved to\nenhance the mAP of instance segmentation models regardless of the number and\ntyp\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bMXYddr3h5AVqIrJjfscz_CEg8VWHSnzAn1iRS67iDo","pdfSize":"2797415","objectId":"0x9e504e78ff38e1b547a1120528fb95d468aebd6301cfabe3d7b49c579a3d1c3f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
