{"id":"2407.20337","title":"Contrasting Deepfakes Diffusion via Contrastive Learning and\n  Global-Local Similarities","authors":"Lorenzo Baraldi, Federico Cocchi, Marcella Cornia, Lorenzo Baraldi,\n  Alessandro Nicolosi, Rita Cucchiara","authorsParsed":[["Baraldi","Lorenzo",""],["Cocchi","Federico",""],["Cornia","Marcella",""],["Baraldi","Lorenzo",""],["Nicolosi","Alessandro",""],["Cucchiara","Rita",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:00:10 GMT"}],"updateDate":"2024-07-31","timestamp":1722276010000,"abstract":"  Discerning between authentic content and that generated by advanced AI\nmethods has become increasingly challenging. While previous research primarily\naddresses the detection of fake faces, the identification of generated natural\nimages has only recently surfaced. This prompted the recent exploration of\nsolutions that employ foundation vision-and-language models, like CLIP.\nHowever, the CLIP embedding space is optimized for global image-to-text\nalignment and is not inherently designed for deepfake detection, neglecting the\npotential benefits of tailored training and local image features. In this\nstudy, we propose CoDE (Contrastive Deepfake Embeddings), a novel embedding\nspace specifically designed for deepfake detection. CoDE is trained via\ncontrastive learning by additionally enforcing global-local similarities. To\nsustain the training of our model, we generate a comprehensive dataset that\nfocuses on images generated by diffusion models and encompasses a collection of\n9.2 million images produced by using four different generators. Experimental\nresults demonstrate that CoDE achieves state-of-the-art accuracy on the newly\ncollected dataset, while also showing excellent generalization capabilities to\nunseen image generators. Our source code, trained models, and collected dataset\nare publicly available at: https://github.com/aimagelab/CoDE.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}