{"id":"2407.15356","title":"X-Recon: Learning-based Patient-specific High-Resolution CT\n  Reconstruction from Orthogonal X-Ray Images","authors":"Yunpeng Wang, Kang Wang, Yaoyao Zhuo, Weiya Shi, Fei Shan, and Lei Liu","authorsParsed":[["Wang","Yunpeng",""],["Wang","Kang",""],["Zhuo","Yaoyao",""],["Shi","Weiya",""],["Shan","Fei",""],["Liu","Lei",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 03:55:36 GMT"}],"updateDate":"2024-07-23","timestamp":1721620536000,"abstract":"  Rapid and accurate diagnosis of pneumothorax, utilizing chest X-ray and\ncomputed tomography (CT), is crucial for assisted diagnosis. Chest X-ray is\ncommonly used for initial localization of pneumothorax, while CT ensures\naccurate quantification. However, CT scans involve high radiation doses and can\nbe costly. To achieve precise quantitative diagnosis while minimizing radiation\nexposure, we proposed X-Recon, a CT ultra-sparse reconstruction network based\non ortho-lateral chest X-ray images. X-Recon integrates generative adversarial\nnetworks (GANs), including a generator with a multi-scale fusion rendering\nmodule and a discriminator enhanced by 3D coordinate convolutional layers,\ndesigned to facilitate CT reconstruction. To improve precision, a projective\nspatial transformer is utilized to incorporate multi-angle projection loss.\nAdditionally, we proposed PTX-Seg, a zero-shot pneumothorax segmentation\nalgorithm, combining image processing techniques with deep-learning models for\nthe segmentation of air-accumulated regions and lung structures. Experiments on\na large-scale dataset demonstrate its superiority over existing approaches.\nX-Recon achieved a significantly higher reconstruction resolution with a higher\naverage spatial resolution and a lower average slice thickness. The\nreconstruction metrics achieved state-of-the-art performance in terms of\nseveral metrics including peak signal-to-noise ratio. The zero-shot\nsegmentation algorithm, PTX-Seg, also demonstrated high segmentation precision\nfor the air-accumulated region, the left lung, and the right lung. Moreover,\nthe consistency analysis for the pneumothorax chest occupancy ratio between\nreconstructed CT and original CT obtained a high correlation coefficient. Code\nwill be available at: https://github.com/wangyunpengbio/X-Recon\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}