{"id":"2407.02077","title":"Hierarchical Temporal Context Learning for Camera-based Semantic Scene\n  Completion","authors":"Bohan Li, Jiajun Deng, Wenyao Zhang, Zhujin Liang, Dalong Du, Xin Jin,\n  Wenjun Zeng","authorsParsed":[["Li","Bohan",""],["Deng","Jiajun",""],["Zhang","Wenyao",""],["Liang","Zhujin",""],["Du","Dalong",""],["Jin","Xin",""],["Zeng","Wenjun",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 09:11:17 GMT"},{"version":"v2","created":"Sun, 7 Jul 2024 05:15:40 GMT"},{"version":"v3","created":"Tue, 16 Jul 2024 08:04:29 GMT"}],"updateDate":"2024-07-17","timestamp":1719911477000,"abstract":"  Camera-based 3D semantic scene completion (SSC) is pivotal for predicting\ncomplicated 3D layouts with limited 2D image observations. The existing\nmainstream solutions generally leverage temporal information by roughly\nstacking history frames to supplement the current frame, such straightforward\ntemporal modeling inevitably diminishes valid clues and increases learning\ndifficulty. To address this problem, we present HTCL, a novel Hierarchical\nTemporal Context Learning paradigm for improving camera-based semantic scene\ncompletion. The primary innovation of this work involves decomposing temporal\ncontext learning into two hierarchical steps: (a) cross-frame affinity\nmeasurement and (b) affinity-based dynamic refinement. Firstly, to separate\ncritical relevant context from redundant information, we introduce the pattern\naffinity with scale-aware isolation and multiple independent learners for\nfine-grained contextual correspondence modeling. Subsequently, to dynamically\ncompensate for incomplete observations, we adaptively refine the feature\nsampling locations based on initially identified locations with high affinity\nand their neighboring relevant regions. Our method ranks $1^{st}$ on the\nSemanticKITTI benchmark and even surpasses LiDAR-based methods in terms of mIoU\non the OpenOccupancy benchmark. Our code is available on\nhttps://github.com/Arlo0o/HTCL.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qX5CVp08vtC0k6AOmkSO33wwTbwCI9lxfBAKsmTzUHU","pdfSize":"9252008"}
