{"id":"2407.09982","title":"Artificial intelligence and machine learning applications for cultured\n  meat","authors":"Michael E. Todhunter (1), Sheikh Jubair (2), Ruchika Verma (2), Rikard\n  Saqe (3), Kevin Shen (3), Breanna Duffy (4) ((1) Todhunter Scientifics,\n  Minneapolis, MN, USA (2) Alberta Machine Intelligence Institute, Edmonton,\n  AB, Canada (3) University of Waterloo, Waterloo, ON, Canada (4) New Harvest,\n  Sacramento, CA, USA)","authorsParsed":[["Todhunter","Michael E.",""],["Jubair","Sheikh",""],["Verma","Ruchika",""],["Saqe","Rikard",""],["Shen","Kevin",""],["Duffy","Breanna",""]],"versions":[{"version":"v1","created":"Tue, 30 Apr 2024 13:35:18 GMT"}],"updateDate":"2024-07-16","timestamp":1714484118000,"abstract":"  Cultured meat has the potential to provide a complementary meat industry with\nreduced environmental, ethical, and health impacts. However, major\ntechnological challenges remain which require time- and resource-intensive\nresearch and development efforts. Machine learning has the potential to\naccelerate cultured meat technology by streamlining experiments, predicting\noptimal results, and reducing experimentation time and resources. However, the\nuse of machine learning in cultured meat is in its infancy. This review covers\nthe work available to date on the use of machine learning in cultured meat and\nexplores future possibilities. We address four major areas of cultured meat\nresearch and development: establishing cell lines, cell culture media design,\nmicroscopy and image analysis, and bioprocessing and food processing\noptimization. This review aims to provide the foundation necessary for both\ncultured meat and machine learning scientists to identify research\nopportunities at the intersection between cultured meat and machine learning.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6MOZK2Q7Dc8BrqWWv7Rw1wUlkJgzY_A_OfHWGAGkLlk","pdfSize":"1510051"}
