{"id":"2407.10974","title":"Age and metal gradients in massive quiescent galaxies at $0.6 \\lesssim z\n  \\lesssim 1.0$: implications for quenching and assembly histories","authors":"Chloe M. Cheng, Mariska Kriek, Aliza G. Beverage, Arjen van der Wel,\n  Rachel Bezanson, Francesco D'Eugenio, Marijn Franx, Pavel E. Mancera Pi\\~na,\n  Angelos Nersesian, Martje Slob, Katherine A. Suess, Pieter G. van Dokkum,\n  Po-Feng Wu, Anna Gallazzi, and Stefano Zibetti","authorsParsed":[["Cheng","Chloe M.",""],["Kriek","Mariska",""],["Beverage","Aliza G.",""],["van der Wel","Arjen",""],["Bezanson","Rachel",""],["D'Eugenio","Francesco",""],["Franx","Marijn",""],["Piña","Pavel E. Mancera",""],["Nersesian","Angelos",""],["Slob","Martje",""],["Suess","Katherine A.",""],["van Dokkum","Pieter G.",""],["Wu","Po-Feng",""],["Gallazzi","Anna",""],["Zibetti","Stefano",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:59:58 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 11:30:17 GMT"}],"updateDate":"2024-07-24","timestamp":1721066398000,"abstract":"  We present spatially resolved, simple stellar population equivalent ages,\nstellar metallicities, and abundance ratios for 456 massive\n($10.3\\lesssim\\log(\\mathrm{M}_*/\\mathrm{M}_\\odot)\\lesssim11.8$) quiescent\ngalaxies at $0.6\\lesssim z\\lesssim1.0$ from the Large Early Galaxy Astrophysics\nCensus, derived using full-spectrum models. Typically, we find flat age and\n[Mg/Fe] gradients, and negative [Fe/H] gradients, implying iron-rich cores. We\nalso estimate intrinsic [Fe/H] gradients via forward modelling. We examine the\nobserved gradients in three age bins. Younger quiescent galaxies typically have\nnegative [Fe/H] gradients and positive age gradients, possibly indicating a\nrecent central starburst. Additionally, this finding suggests that\nphotometrically measured flat colour gradients in young quiescent galaxies are\nthe result of the positive age and negative metallicity gradients cancelling\neach other. For older quiescent galaxies, the age gradients become flat and\n[Fe/H] gradients weaken, though remain negative. Thus, negative colour\ngradients at older ages are likely driven by metallicity gradients. The\ndiminishing age gradient may result from the starburst fading. Furthermore, the\npersistence of the [Fe/H] gradients may suggest that the outskirts are\nsimultaneously built up by mergers with lower metallicity satellites. On the\nother hand, the gradients could be inherited from the star-forming phase, in\nwhich case mergers may not be needed to explain our findings. This work\nillustrates the need for resolved spectroscopy, instead of just photometry, to\nmeasure stellar population gradients. Extending these measurements to higher\nredshift is imperative for understanding how stellar populations in quiescent\ngalaxies are assembled over cosmic time.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}