{"id":"2407.06035","title":"Argon in beta Pictoris -- entrapment and release of volatile in disks","authors":"Yanqin Wu (Toronto), Kadin Worthen (JHU), Alexis Brandeker\n  (Stockholm), Christine Chen (STScI/JHU)","authorsParsed":[["Wu","Yanqin","","Toronto"],["Worthen","Kadin","","JHU"],["Brandeker","Alexis","","Stockholm"],["Chen","Christine","","STScI/JHU"]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 15:34:20 GMT"}],"updateDate":"2024-07-09","timestamp":1720452860000,"abstract":"  Chemical compositions of planets reveal much about their formation\nenvironments. Such information is well sought-after in studies of Solar System\nbodies and extra-solar ones. Here, we investigate the composition of\nplanetesimals in the beta Pic debris disk, by way of its secondary gas disk. We\nare stimulated by the recent JWST detection of an Ar II emission line, and aim\nto reproduce extensive measurements from the past four decades. Our\nphoto-ionization model reveals that the gas has to be heavily enriched in C, N,\nO, and Ar (but not S and P), by a uniform factor of about 100 relative to other\nmetals. Such an abundance pattern is both reminiscent of, and different from,\nthat of Jupiter's atmosphere. The fact that Ar, the most volatile and therefore\nthe hardest to capture into solids, is equally enriched as C/N/O suggests that\nthe planetesimals were formed in a very cold region (T < 35K) with abundant\nwater ice. In the debris disk phase, these volatile are preferentially\noutgassed from the dust grains, likely via photo-desorption. The debris grains\nmust be 'dirty' aggregates of icy and refractory clusters. Lastly, the observed\nstrength of the Ar II line can only be explained if the star beta Pic (a young\nA6V star) has sizable chromospheric and coronal emissions, on par with those\nfrom the modern Sun. In summary, observations of the beta Pic gas disk rewind\nthe clock to reveal the formation environment of planetesimals.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}