{"id":"2407.00690","title":"MnRhBi3: A Cleavable Antiferromagnetic Metal","authors":"Eleanor M. Clements, Dmitry Ovchinnikov, Parul R. Raghuvanshi,\n  Valentino R. Cooper, Satoshi Okamoto, Andrew D. Christianson, Joseph A. M.\n  Paddison, Brenden R. Ortiz, Stuart Calder, Andrew F. May, Xiaodong Xu,\n  Jiaqiang Yan, Michael A. McGuire","authorsParsed":[["Clements","Eleanor M.",""],["Ovchinnikov","Dmitry",""],["Raghuvanshi","Parul R.",""],["Cooper","Valentino R.",""],["Okamoto","Satoshi",""],["Christianson","Andrew D.",""],["Paddison","Joseph A. M.",""],["Ortiz","Brenden R.",""],["Calder","Stuart",""],["May","Andrew F.",""],["Xu","Xiaodong",""],["Yan","Jiaqiang",""],["McGuire","Michael A.",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 13:10:26 GMT"}],"updateDate":"2024-07-02","timestamp":1719753026000,"abstract":"  Cleavable metallic antiferromagnets may be of use for low-dissipation\nspintronic devices; however, few are currently known. Here we present\northorhombic MnRhBi3 as one such compound and present a thorough study of its\nphysical properties. Exfoliation is demonstrated experimentally, and the\ncleavage energy and electronic structure are examined by density functional\ntheory calculations. It is concluded that MnRhBi3 is a van der Waals layered\nmaterial that cleaves easily between neighboring Bi layers, and that the Bi\natoms have lone pairs extending into the van der Waals gaps. A series of four\nphase transitions are observed below room temperature, and neutron diffraction\nshows that at least two of the transitions involve the formation of\nantiferromagnetic order. Anomalous thermal expansion points to a\ncrystallographic phase transition and/or strong magnetoelastic coupling. This\nwork reveals a complex phase evolution in MnRhBi3 and establishes this\ncleavable antiferromagnetic metal as an interesting material for studying the\ninterplay of structure, magnetism, and transport in the bulk and ultrathin\nlimits as well as the role of lone pair electrons in interface chemistry and\nproximity effects in van der Waals heterostructures.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}