{"id":"2407.15826","title":"Statistics and Habitability of F-type Star--Planet Systems","authors":"Shaan D. Patel, Manfred Cuntz, Nevin N. Weinberg","authorsParsed":[["Patel","Shaan D.",""],["Cuntz","Manfred",""],["Weinberg","Nevin N.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 17:44:04 GMT"}],"updateDate":"2024-07-23","timestamp":1721670244000,"abstract":"  F-type star--planet systems represent an intriguing case for habitability\nstudies. Although F-type stars spend considerably less time on the\nmain-sequence than G, K, and M-type stars, they still offer a unique set of\nfeatures, allowing for the principal possibility of exolife. Examples of the\nlatter include the increased widths of stellar habitable zones as well as the\npresence of enhanced UV flux, which in moderation may have added to the origin\nof life in the Universe. In this study, we pursue a detailed statistical\nanalysis of the currently known planet-hosting F-type stars by making use of\nthe NASA Exoplanet Archive. After disregarding systems with little or no\ninformation on the planet(s), we identify 206 systems of interest. We also\nevaluate whether the stars are on the main-sequence based on various criteria.\nIn one approach, we use the stellar evolution code MESA. Depending on the\nadopted criterion, about 60 to 80 stars have been identified as main-sequence\nstars. In 18 systems, the planet spends at least part of its orbit within the\nstellar habitable zone. In one case, i.e., HD 111998, commonly known as 38 Vir,\nthe planet is situated in the habitable zone at all times. Our work may serve\nas a basis for future studies, including studies on the existence of Earth-mass\nplanets in F-type systems, as well as investigations of possibly habitable\nexomoons hosted by exo-Jupiters as the lowest-mass habitable zone planet\ncurrently identified has a mass estimate of 143 Earth masses.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6ChLDjgvh4hVE5r6WqrYpglO88_3mK2FPkNzZajmJuo","pdfSize":"654970"}
