{"id":"2407.18221","title":"Catalog of Proper Orbits for 1.25 Million Main Belt Asteroids and\n  Discovery of 136 New Collisional Families","authors":"David Nesvorny, Fernando Roig, David Vokrouhlicky, Miroslav Broz","authorsParsed":[["Nesvorny","David",""],["Roig","Fernando",""],["Vokrouhlicky","David",""],["Broz","Miroslav",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 17:37:56 GMT"}],"updateDate":"2024-07-26","timestamp":1721929076000,"abstract":"  The proper elements of asteroids are obtained from the instantaneous orbital\nelements by removing periodic oscillations produced by gravitational\ninteractions with planets. They are unchanging in time, at least if chaotic\ndynamics and non-gravitational forces could be ignored, and can therefore be\nused to identify fragments of major collisions (asteroid families) that\nhappened eons ago. Here we present a new catalog of proper elements for 1.25\nmillion main belt asteroids. We explain the methodology, evaluate\nuncertainties, and discuss how the new catalog can be used to identify asteroid\nfamilies. A systematic search for families yielded 153 cases not reported in\nNesvorn\\'y at al. (2015) -- 17 of these cases were identified in various other\npublications, 136 cases are new discoveries. There are now 274 families in the\nasteroid belt in total (plus a handful of families in the resonant Hilda\npopulation). We analyzed several compact families in detail. The new family\naround the middle belt asteroid (9332) 1990SB1 (9 members) is the youngest\nfamily found so far (estimated formation only 16-17 kyr ago). New families\n(1217) Maximiliana, (6084) Bascom, (10164) Akusekijima and (70208) 1999RX33 all\nformed 0.5-2.5 Myr ago. The (2110) Moore-Sitterly family is a close pair of\nrelatively large bodies, 2110 and 44612, and 15 small members all located\nsunwards from 2110 and 44612, presumably a consequence of the Yarkovsky drift\nover the estimated family age (1.2-1.5 Myr). A systematic characterization of\nthe new asteroid families is left for future work.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}