{"id":"2407.02525","title":"Increased antimicrobial activity of ZnO nanoparticle thin films: Effect\n  of surface structuration","authors":"Imroi El-Habib (IG, USPN), Sarah Dine (IG), Alex Lemarchand (IG,\n  USPN), Christine Mielcarek (EBI), Mamadou Traore (IG, USPN), Rabah Azouani\n  (EBI)","authorsParsed":[["El-Habib","Imroi","","IG, USPN"],["Dine","Sarah","","IG"],["Lemarchand","Alex","","IG,\n  USPN"],["Mielcarek","Christine","","EBI"],["Traore","Mamadou","","IG, USPN"],["Azouani","Rabah","","EBI"]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 08:07:46 GMT"}],"updateDate":"2024-07-04","timestamp":1719562066000,"abstract":"  This work explores the antimicrobial efficacy of ZnO nanoparticles (NPs)\nfilms with varying microstructure, crystallographic orientation and surface\nroughness. Thin films with different microstructures were obtained by varying\nprecursor concentrations (0.1 M, 0.25 M, and 0.4 M) and solvent types (Ethanol,\nPropanol, and Butanol). The characterization of the films by X-ray diffraction\n(XRD) revealed films with varying degrees of orientation along the c-axis,\nwhich increased with the concentration of the precursor and with the decrease\nin the carbon chain length of the alcohol. Raman spectroscopy analysis\nconfirmed the formation of a hexagonal wurtzite ZnO. Scanning Electron\nMicroscopy (SEM) analysis revealed the formation of dense and homogeneous films\nwith a thickness of 93 nm. Atomic force microscopy (AFM) showed changes in\nsurface irregularity and an increase in surface roughness with the carbon\nlength of solvent and a maximum roughness at a precursor concentration of 0.25\nM in propanol. The antimicrobial activity was assessed following ISO 22196:2011\nstandards with few modifications. Results indicated that ZnO NPs films with\nrougher surfaces reduced coli (gram(-)), Pseudomonas aeruginosa (gram(-)) and\nStaphylococcus aureus (gram(+) ) bacteria populations due to an increase of\ncontact surface between NPs with bacteria. Their effectiveness against Candida\nalbicans was moderate, with a maximum reduction of 0.72 Log10 CFU/cm$^2$ with\nrougher film.\n","subjects":["Condensed Matter/Materials Science","Physics/Biological Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}