{"id":"2407.19555","title":"Crystal-symmetry-paired spin-valley locking in a layered\n  room-temperature antiferromagnet","authors":"Fayuan Zhang, Xingkai Cheng, Zhouyi Yin, Changchao Liu, Liwei Deng,\n  Yuxi Qiao, Zheng Shi, Shuxuan Zhang, Junhao Lin, Zhengtai Liu, Mao Ye, Yaobo\n  Huang, Xiangyu Meng, Cheng Zhang, Taichi Okuda, Kenya Shimada, Shengtao Cui,\n  Yue Zhao, Guang-Han Cao, Shan Qiao, Junwei Liu and Chaoyu Chen","authorsParsed":[["Zhang","Fayuan",""],["Cheng","Xingkai",""],["Yin","Zhouyi",""],["Liu","Changchao",""],["Deng","Liwei",""],["Qiao","Yuxi",""],["Shi","Zheng",""],["Zhang","Shuxuan",""],["Lin","Junhao",""],["Liu","Zhengtai",""],["Ye","Mao",""],["Huang","Yaobo",""],["Meng","Xiangyu",""],["Zhang","Cheng",""],["Okuda","Taichi",""],["Shimada","Kenya",""],["Cui","Shengtao",""],["Zhao","Yue",""],["Cao","Guang-Han",""],["Qiao","Shan",""],["Liu","Junwei",""],["Chen","Chaoyu",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 18:23:01 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 08:06:09 GMT"}],"updateDate":"2024-08-05","timestamp":1722190981000,"abstract":"  Recent theoretical efforts predicted a type of unconventional antiferromagnet\ncharacterized by the crystal symmetry C (rotation or mirror), which connects\nantiferromagnetic sublattices in real space and simultaneously couples spin and\nmomentum in reciprocal space. This results in a unique C-paired spin-valley\nlocking (SVL) and corresponding novel properties such as piezomagnetism and\nnoncollinear spin current even without spin-orbit coupling. However, the\nunconventional antiferromagnets reported thus far are not layered materials,\nlimiting their potential in spintronic applications. Additionally, they do not\nmeet the necessary symmetry requirements for nonrelativistic spin current.\nHere, we report the realization of C-paired SVL in a layered room-temperature\nantiferromagnetic compound, Rb1-{\\delta}V2Te2O. Spin resolved photoemission\nmeasurements directly demonstrate the opposite spin splitting between C-paired\nvalleys. Quasi-particle interference patterns reveal the suppression of\ninter-valley scattering due to the spin selection rules, as a direct\nconsequence of C-paired SVL. All these experiments are well consistent with the\nresults obtained from first-principles calculations. Our observations represent\nthe first realization of layered antiferromagnets with C-paired SVL, enabling\nboth the advantages of layered materials and possible control through crystal\nsymmetry manipulation. These results hold significant promise and broad\nimplications for advancements in magnetism, electronics, and information\ntechnology.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hkrHX45X7NRfVSqSOyjZs3HCRMYq6xPEbLLoMa7Bk7U","pdfSize":"4971183","objectId":"0x125e6f1e74d1d44145a5969552fba82bb731380b8b4ad2ef28d5746d0ddf3ad3","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
