{"id":"2407.07287","title":"Employing Software Diversity in Cloud Microservices to Engineer Reliable\n  and Performant Systems","authors":"Nazanin Akhtarian, Hamzeh Khazaei, Marin Litoiu","authorsParsed":[["Akhtarian","Nazanin",""],["Khazaei","Hamzeh",""],["Litoiu","Marin",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 00:34:39 GMT"}],"updateDate":"2024-07-11","timestamp":1720571679000,"abstract":"  In the ever-shifting landscape of software engineering, we recognize the need\nfor adaptation and evolution to maintain system dependability. As each software\niteration potentially introduces new challenges, from unforeseen bugs to\nperformance anomalies, it becomes paramount to understand and address these\nintricacies to ensure robust system operations during the lifetime. This work\nproposes employing software diversity to enhance system reliability and\nperformance simultaneously. A cornerstone of our work is the derivation of a\nreliability metric. This metric encapsulates the reliability and performance of\neach software version under adverse conditions. Using the calculated\nreliability score, we implemented a dynamic controller responsible for\nadjusting the population of each software version. The goal is to maintain a\nhigher replica count for more reliable versions while preserving the diversity\nof versions as much as possible. This balance is crucial for ensuring not only\nthe reliability but also the performance of the system against a spectrum of\npotential failures. In addition, we designed and implemented a diversity-aware\nautoscaling algorithm that maintains the reliability and performance of the\nsystem at the same time and at any scale. Our extensive experiments on\nrealistic cloud microservice-based applications show the effectiveness of the\nproposed approach in this paper in promoting both reliability and performance.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Performance"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}