{"id":"2407.12110","title":"Pseudorandomness, symmetry, smoothing: II","authors":"Harm Derksen, Peter Ivanov, Chin Ho Lee, Emanuele Viola","authorsParsed":[["Derksen","Harm",""],["Ivanov","Peter",""],["Lee","Chin Ho",""],["Viola","Emanuele",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 18:35:24 GMT"}],"updateDate":"2024-07-18","timestamp":1721154924000,"abstract":"  We prove several new results on the Hamming weight of bounded uniform and\nsmall-bias distributions.\n  We exhibit bounded-uniform distributions whose weight is anti-concentrated,\nmatching existing concentration inequalities. This construction relies on a\nrecent result in approximation theory due to Erd\\'eyi (Acta Arithmetica 2016).\nIn particular, we match the classical tail bounds, generalizing a result by Bun\nand Steinke (RANDOM 2015). Also, we improve on a construction by Benjamini,\nGurel-Gurevich, and Peled (2012).\n  We give a generic transformation that converts any bounded uniform\ndistribution to a small-bias distribution that almost preserves its weight\ndistribution. Applying this transformation in conjunction with the above\nresults and others, we construct small-bias distributions with various weight\nrestrictions. In particular, we match the concentration that follows from that\nof bounded uniformity and the generic closeness of small-bias and\nbounded-uniform distributions, answering a question by Bun and Steinke (RANDOM\n2015). Moreover, these distributions are supported on only a constant number of\nHamming weights.\n  We further extend the anti-concentration constructions to small-bias\ndistributions perturbed with noise, a class that has received much attention\nrecently in derandomization. Our results imply (but are not implied by) a\nrecent result of the authors (CCC 2024), and are based on different techniques.\nIn particular, we prove that the standard Gaussian distribution is far from any\nmixture of Gaussians with bounded variance.\n","subjects":["Computing Research Repository/Computational Complexity"],"license":"http://creativecommons.org/licenses/by/4.0/"}