{"id":"2407.00895","title":"Large-Amplitude, Easy-Plane Spin-Orbit Torque Oscillators Driven by\n  Out-of-Plane Spin Current: A Micromagnetic Study","authors":"Daniel Kubler, David A. Smith, Tommy Nguyen, Fernando Ramos-Diaz,\n  Satoru Emori, and Vivek P. Amin","authorsParsed":[["Kubler","Daniel",""],["Smith","David A.",""],["Nguyen","Tommy",""],["Ramos-Diaz","Fernando",""],["Emori","Satoru",""],["Amin","Vivek P.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 01:31:59 GMT"}],"updateDate":"2024-07-02","timestamp":1719797519000,"abstract":"  Spin torque oscillators are spintronic devices that generate a periodic\noutput signal from a non-periodic input, making them promising candidates for\napplications like microwave communications and neuromorphic computing. However,\ntraditional spin torque oscillators suffer from a limited precessional cone\nangle and thermal stability, as well as a need for an applied bias magnetic\nfield. We use micromagnetic simulations to demonstrate a novel spin torque\noscillator that relies on spin-orbit effects in ferromagnets to overcome these\nlimitations. The key mechanism behind this oscillator is the generation of an\nout-of-plane spin current, in which both the spin flow and the spin orientation\nare out-of-plane. The torque from this spin current enables easy-plane coherent\nmagnetic precession with a large cone angle and high thermal stability over a\nmicron-scale lateral area. Moreover, the precession occurs about an internal\nfield in the free layer, thereby eliminating the need for an external bias\nfield. We demonstrate the feasibility of an easy-plane spin-orbit torque\noscillator at room temperature over a wide parameter space, including the ratio\nof the out-of-plane spin current to the conventional spin-Hall spin current,\npresenting exciting possibilities for this novel spintronic device.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}