{"id":"2407.11183","title":"Differentiable Neural-Integrated Meshfree Method for Forward and Inverse\n  Modeling of Finite Strain Hyperelasticity","authors":"Honghui Du, Binyao Guo, QiZhi He","authorsParsed":[["Du","Honghui",""],["Guo","Binyao",""],["He","QiZhi",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 19:15:18 GMT"}],"updateDate":"2024-07-17","timestamp":1721070918000,"abstract":"  The present study aims to extend the novel physics-informed machine learning\napproach, specifically the neural-integrated meshfree (NIM) method, to model\nfinite-strain problems characterized by nonlinear elasticity and large\ndeformations. To this end, the hyperelastic material models are integrated into\nthe loss function of the NIM method by employing a consistent local variational\nformulation. Thanks to the inherent differentiable programming capabilities,\nNIM can circumvent the need for derivation of Newton-Raphson linearization of\nthe variational form and the resulting tangent stiffness matrix, typically\nrequired in traditional numerical methods. Additionally, NIM utilizes a hybrid\nneural-numerical approximation encoded with partition-of-unity basis functions,\ncoined NeuroPU, to effectively represent the displacement and streamline the\ntraining process. NeuroPU can also be used for approximating the unknown\nmaterial fields, enabling NIM a unified framework for both forward and inverse\nmodeling. For the imposition of displacement boundary conditions, this study\nintroduces a new approach based on singular kernel functions into the NeuroPU\napproximation, leveraging its unique feature that allows for customized basis\nfunctions. Numerical experiments demonstrate the NIM method's capability in\nforward hyperelasticity modeling, achieving desirable accuracy, with errors\namong $10^{-3} \\sim 10^{-5}$ in the relative $L_2$ norm, comparable to the\nwell-established finite element solvers. Furthermore, NIM is applied to address\nthe complex task of identifying heterogeneous mechanical properties of\nhyperelastic materials from strain data, validating its effectiveness in the\ninverse modeling of nonlinear materials. To leverage GPU acceleration, NIM is\nfully implemented on the JAX deep learning framework in this study, utilizing\nthe accelerator-oriented array computation capabilities offered by JAX.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}