{"id":"2407.16249","title":"How Does a Single EEG Channel Tell Us About Brain States in\n  Brain-Computer Interfaces ?","authors":"Zaineb Ajra and Binbin Xu and G\\'erard Dray and Jacky Montmain and\n  St\\'ephane Perrey","authorsParsed":[["Ajra","Zaineb",""],["Xu","Binbin",""],["Dray","Gérard",""],["Montmain","Jacky",""],["Perrey","Stéphane",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 07:38:06 GMT"}],"updateDate":"2024-08-14","timestamp":1721720286000,"abstract":"  Over recent decades, neuroimaging tools, particularly electroencephalography\n(EEG), have revolutionized our understanding of the brain and its functions.\nEEG is extensively used in traditional brain-computer interface (BCI) systems\ndue to its low cost, non-invasiveness, and high temporal resolution. This makes\nit invaluable for identifying different brain states relevant to both medical\nand non-medical applications. Although this practice is widely recognized,\ncurrent methods are mainly confined to lab or clinical environments because\nthey rely on data from multiple EEG electrodes covering the entire head.\nNonetheless, a significant advancement for these applications would be their\nadaptation for \"real-world\" use, using portable devices with a single-channel.\nIn this study, we tackle this challenge through two distinct strategies: the\nfirst approach involves training models with data from multiple channels and\nthen testing new trials on data from a single channel individually. The second\nmethod focuses on training with data from a single channel and then testing the\nperformances of the models on data from all the other channels individually. To\nefficiently classify cognitive tasks from EEG data, we propose Convolutional\nNeural Networks (CNNs) with only a few parameters and fast learnable\nspectral-temporal features. We demonstrated the feasibility of these approaches\non EEG data recorded during mental arithmetic and motor imagery tasks from\nthree datasets. We achieved the highest accuracies of 100%, 91.55% and 73.45%\nin binary and 3-class classification on specific channels across three\ndatasets. This study can contribute to the development of single-channel BCI\nand provides a robust EEG biomarker for brain states classification.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}