{"id":"2407.17099","title":"Generalized Ordinal Priority Approach for Multi-Attribute\n  Decision-Making under Incomplete Preference Information","authors":"Renlong Wang","authorsParsed":[["Wang","Renlong",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 08:49:46 GMT"}],"updateDate":"2024-07-25","timestamp":1721810986000,"abstract":"  The Ordinal Priority Approach (OPA) is a multi-attribute decision-making\n(MADM) method to determine the relative importance (weights) of experts,\nattributes, and alternatives. This study formally establishes the fundamental\nproperties of OPA, including solution efficiency, analytical solution\nexpression, the decomposability of optimal decision weights, and its\nrelationship with rank-based surrogate weights. Building on these properties,\nwe propose a Generalized Ordinal Priority Approach (GOPA) based on an\n\"estimate-then-optimize\" contextual optimization framework for MADM when\npreference information is incomplete. In the first stage, we derive utility\ndistributions for ranked alternatives in discrete and continuous prospects by\nminimizing cross-entropy utility under partial preference information,\nincluding weak order relations, absolute differences, ratio scales, and lower\nbounds. Rank-based surrogate weights and risk preference utility functions\nserve as the global utility structure for discrete and continuous prospects,\nrespectively. The elicited utility information is then introduced into the\nsecond-stage problem to simultaneously optimize the weights of experts,\nattributes, and alternatives within a normalized weight space. Metrics for\nvalidating the group decision outcomes of GOPA, including percentage standard\ndeviation, correlation coefficient, and confidence level measurement, are\nproposed. Theoretical analysis reveals several advantageous properties of GOPA,\nincluding model generalizability, analytical solvability, and risk preference\nindependence. Furthermore, this study provides a lower bound reference for\ntransforming the general optimization-based weight elicitation problems into\noptimization problems with stochastic dominance constraints. The applicability\nof GOPA is demonstrated through an improvisational emergency supplier selection\nproblem.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}