{"id":"2407.02624","title":"Optimizing Information Access in Networks via Edge Augmentation","authors":"Aditya Bhaskara, Alex Crane, Md Mumtahin Habib Ullah Mazumder, Blair\n  D. Sullivan, and Prasanth Yalamanchili","authorsParsed":[["Bhaskara","Aditya",""],["Crane","Alex",""],["Mazumder","Md Mumtahin Habib Ullah",""],["Sullivan","Blair D.",""],["Yalamanchili","Prasanth",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 19:28:31 GMT"}],"updateDate":"2024-07-04","timestamp":1719948511000,"abstract":"  Given a graph $G = (V, E)$ and a model of information flow on that network, a\nfundamental question is to understand if all the nodes have sufficient access\nto information generated at other nodes in the graph. If not, we can ask if a\nsmall set of edge additions improve information access. Formally, the broadcast\nvalue of a network is defined to be the minimum over pairs $u,v \\in V$ of the\nprobability that an information cascade starting at $u$ reaches $v$. Recent\nwork in the algorithmic fairness literature has focused on heuristics for\nadding a few edges to a graph to improve its broadcast. Our goal is to formally\nstudy the approximability of the Broadcast Improvement problem: given $G$ and a\nparameter $k$, find the best set of $k$ edges to add to $G$ in order to\nmaximize the broadcast value of the resulting graph.\n  We develop efficient bicriteria approximation algorithms. If the optimal\nsolution adds $k$ edges and achieves a broadcast of $\\beta^*$, we develop\nalgorithms that can (a) add $2k-1$ edges and achieve a broadcast value roughly\n$(\\beta^*)^4$, or (b) add $O(k\\log n)$ edges and achieve a broadcast roughly\n$\\beta^*$. We also provide other trade-offs, that can be better depending on\n$k$ and the parameter associated with propagation in the cascade model. We\ncomplement our results by proving that unless P = NP, any algorithm that adds\n$O(k)$ edges must lose significantly in the approximation of $\\beta^*$,\nresolving an open question.\n  Our techniques are inspired by connections between Broadcast Improvement and\nproblems such as Metric $k$-Center and Diameter Reduction. However, since the\nobjective involves information cascades, we need to develop novel probabilistic\ntools to reason about the existence of paths in edge-sampled graphs. Finally,\nwe show that our techniques extend to a single-source variant, for which we\nshow both bicriteria algorithms and inapproximability results.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/"}