{"id":"2407.16657","title":"Fluorescence Diffraction Tomography using Explicit Neural Fields","authors":"Renzhi He, Yucheng Li, Junjie Chen, Yi Xue","authorsParsed":[["He","Renzhi",""],["Li","Yucheng",""],["Chen","Junjie",""],["Xue","Yi",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:18:24 GMT"},{"version":"v2","created":"Mon, 19 Aug 2024 05:34:35 GMT"}],"updateDate":"2024-08-20","timestamp":1721755104000,"abstract":"  Simultaneous imaging of fluorescence-labeled and label-free phase objects in\nthe same sample provides distinct and complementary information. Most\nmultimodal fluorescence-phase imaging operates in transmission mode, capturing\nfluorescence images and phase images separately or sequentially, which limits\ntheir practical application in vivo. Here, we develop fluorescence diffraction\ntomography (FDT) with explicit neural fields to reconstruct the 3D refractive\nindex (RI) of phase objects from diffracted fluorescence images captured in\nreflection mode. The successful reconstruction of 3D RI using FDT relies on\nfour key components: a coarse-to-fine structure, self-calibration, a\ndifferential multi-slice rendering model, and partially coherent masks. The\nexplicit representation integrates with the coarse-to-fine structure for\nhigh-speed, high-resolution reconstruction, while the differential multi-slice\nrendering model enables self-calibration of fluorescence illumination, ensuring\naccurate forward image prediction and RI reconstruction. Partially coherent\nmasks efficiently resolve discrepancies between the coherent light model and\npartially coherent light data. FDT successfully reconstructs the RI of 3D\ncultured label-free bovine myotubes in a 530 $\\times$ 530 $\\times$ 300 $\\mu\nm^3$ volume at 1024 $\\times$ 1024 pixels across 24 $z$-layers from fluorescence\nimages, demonstrating high resolution and high accuracy 3D RI reconstruction of\nbulky and heterogeneous biological samples in vitro.\n","subjects":["Physics/Optics","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vk_EZjuOz4mrUOKW1FtGiPVvS3t4IF1e-D7zYCzqSfE","pdfSize":"5110315"}
