{"id":"2407.08623","title":"Surpassing Cosine Similarity for Multidimensional Comparisons: Dimension\n  Insensitive Euclidean Metric (DIEM)","authors":"Federico Tessari, Neville Hogan","authorsParsed":[["Tessari","Federico",""],["Hogan","Neville",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 16:00:22 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 15:49:29 GMT"}],"updateDate":"2024-07-30","timestamp":1720713622000,"abstract":"  The advancement in computational power and hardware efficiency enabled the\ntackling of increasingly complex and high-dimensional problems. While\nartificial intelligence (AI) achieved remarkable results, the interpretability\nof high-dimensional solutions remains challenging. A critical issue is the\ncomparison of multidimensional quantities, which is essential in techniques\nlike Principal Component Analysis (PCA), or k-means clustering. Common metrics\nsuch as cosine similarity, Euclidean distance, and Manhattan distance are often\nused for such comparisons - for example in muscular synergies of the human\nmotor control system. However, their applicability and interpretability\ndiminish as dimensionality increases. This paper provides a comprehensive\nanalysis of the effects of dimensionality on these metrics. Our results reveal\nsignificant limitations of cosine similarity, particularly its dependency on\nthe dimensionality of the vectors, leading to biased and less interpretable\noutcomes. To address this, we introduce the Dimension Insensitive Euclidean\nMetric (DIEM) which demonstrates superior robustness and generalizability\nacross dimensions. DIEM maintains consistent variability and eliminates the\nbiases observed in traditional metrics, making it a reliable tool for\nhigh-dimensional comparisons. This novel metric has the potential to replace\ncosine similarity, providing a more accurate and insightful method to analyze\nmultidimensional data in fields ranging from neuromotor control to machine and\ndeep learning.\n","subjects":["Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"hUN8qvxTqe6uY8FggCJWA-75xnn-uRC7-TEgGnd1Huk","pdfSize":"1432610"}
