{"id":"2407.14262","title":"Hyperparameter Optimization for Driving Strategies Based on\n  Reinforcement Learning","authors":"Nihal Acharya Adde, Hanno Gottschalk, Andreas Ebert","authorsParsed":[["Adde","Nihal Acharya",""],["Gottschalk","Hanno",""],["Ebert","Andreas",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 12:40:08 GMT"}],"updateDate":"2024-07-22","timestamp":1721392808000,"abstract":"  This paper focuses on hyperparameter optimization for autonomous driving\nstrategies based on Reinforcement Learning. We provide a detailed description\nof training the RL agent in a simulation environment. Subsequently, we employ\nEfficient Global Optimization algorithm that uses Gaussian Process fitting for\nhyperparameter optimization in RL. Before this optimization phase, Gaussian\nprocess interpolation is applied to fit the surrogate model, for which the\nhyperparameter set is generated using Latin hypercube sampling. To accelerate\nthe evaluation, parallelization techniques are employed. Following the\nhyperparameter optimization procedure, a set of hyperparameters is identified,\nresulting in a noteworthy enhancement in overall driving performance. There is\na substantial increase of 4\\% when compared to existing manually tuned\nparameters and the hyperparameters discovered during the initialization process\nusing Latin hypercube sampling. After the optimization, we analyze the obtained\nresults thoroughly and conduct a sensitivity analysis to assess the robustness\nand generalization capabilities of the learned autonomous driving strategies.\nThe findings from this study contribute to the advancement of Gaussian process\nbased Bayesian optimization to optimize the hyperparameters for autonomous\ndriving in RL, providing valuable insights for the development of efficient and\nreliable autonomous driving systems.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}