{"id":"2407.17136","title":"Weyl Semimetallic Phase in High Pressure CrSb$_2$ and Structural\n  Compression Studies of its High Pressure Polymorphs","authors":"Carl Jonas Linnemann, Emma Ehrenreich-Petersen, Davide Ceresoli,\n  Timofey Fedotenko, Innokenty Kantor, Mads Ry Vogel J{\\o}rgensen, Martin\n  Bremholm","authorsParsed":[["Linnemann","Carl Jonas",""],["Ehrenreich-Petersen","Emma",""],["Ceresoli","Davide",""],["Fedotenko","Timofey",""],["Kantor","Innokenty",""],["Jørgensen","Mads Ry Vogel",""],["Bremholm","Martin",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 10:13:59 GMT"}],"updateDate":"2024-07-25","timestamp":1721816039000,"abstract":"  In this study, high pressure synchrotron powder X-ray diffraction is used to\ninvestigate the compression of two high pressure polymorphs of \\ce{CrSb2}. The\nfirst is the \\ce{CuAl2}-type polymorph with an eight-fold coordinated Cr, which\ncan be quenched to ambient conditions from high-pressure high-temperature\nconditions. The second is the recently discovered \\ce{MoP2}-type polymorph,\nwhich is induced by compression at room temperature, with a seven-fold\ncoordinated Cr. Here, the assigned structure is unambiguously confirmed by\nsolving it from single-crystal X-ray diffraction. Furthermore, the electrical\nproperties of the \\ce{MoP2}-type polymorph were investigated theoretically and\nthe resistance calculations under pressure were accompanied by resistance\nmeasurements under high pressure on a single crystal of \\ce{CrSb2}. The\ncalculated electronic band structure for the \\ce{MoP2}-type phase is discussed\nand we show that the polymorph is semimetallic and possesses type-I Weyl\npoints. No further phase transitions were observed for the \\ce{CuAl2}-type\nstructure up to 50 GPa and 40 GPa for the \\ce{MoP2}-type structure. Even though\nthe \\ce{CuAl2}-phase has the highest coordination number of Cr, it was found to\nbe less compressible than the \\ce{MoP2}-phase having a seven-fold coordinated\nCr, which was attributed to the longer Cr-Sb distance in the \\ce{CuAl2}-type\nphase. The discovery of a type-I Weyl semimetallic phase in \\ce{CrSb2} opens up\nfor discovering other Weyl semimetals in the transition metal di-pnictides\nunder high pressure.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SoKMySqism7_DtK4JsdhLd7QjgB3nlYktFGnagDaQ9o","pdfSize":"7082850"}
