{"id":"2407.17809","title":"Tracing the evolution of the cool gas in CGM and IGM environments\n  through Mg II absorption from redshift z=0.75 to z=1.65 using DESI-Y1 data","authors":"X. Wu, Z. Cai, T.-W. Lan, S. Zou, A. Anand, Biprateep Dey, Z. Li, J.\n  Aguilar, S. Ahlen, D. Brooks, T. Claybaugh, A. de la Macorra, P. Doel, S.\n  Ferraro, J. E. Forero-Romero, S. Gontcho A Gontcho, K. Honscheid, S. Juneau,\n  R. Kehoe, T. Kisner, A. Lambert, M. Landriau, L. Le Guillou, M. Manera, A.\n  Meisner, R. Miquel, J. Moustakas, J. A. Newman, F. Prada, G. Rossi, E.\n  Sanchez, D. Schlegel, M. Schubnell, M. Siudek, D. Sprayberry, G. Tarl\\'e, B.\n  A. Weaver, H. Zou","authorsParsed":[["Wu","X.",""],["Cai","Z.",""],["Lan","T. -W.",""],["Zou","S.",""],["Anand","A.",""],["Dey","Biprateep",""],["Li","Z.",""],["Aguilar","J.",""],["Ahlen","S.",""],["Brooks","D.",""],["Claybaugh","T.",""],["de la Macorra","A.",""],["Doel","P.",""],["Ferraro","S.",""],["Forero-Romero","J. E.",""],["Gontcho","S. Gontcho A",""],["Honscheid","K.",""],["Juneau","S.",""],["Kehoe","R.",""],["Kisner","T.",""],["Lambert","A.",""],["Landriau","M.",""],["Guillou","L. Le",""],["Manera","M.",""],["Meisner","A.",""],["Miquel","R.",""],["Moustakas","J.",""],["Newman","J. A.",""],["Prada","F.",""],["Rossi","G.",""],["Sanchez","E.",""],["Schlegel","D.",""],["Schubnell","M.",""],["Siudek","M.",""],["Sprayberry","D.",""],["Tarlé","G.",""],["Weaver","B. A.",""],["Zou","H.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 06:37:26 GMT"}],"updateDate":"2024-07-26","timestamp":1721889446000,"abstract":"  We present a measurement of the mean absorption of cool gas traced by Mg II\n(${\\lambda\\lambda 2796, 2803}$) around emission line galaxies (ELGs), spanning\nspatial scales from 20 kpc to 10 Mpc. The measurement is based on\ncross-matching the positions of about 2.5 million ELGs at $z = 0.75-1.65$ and\nthe metal absorption in the spectra of 1.4 million background quasars with data\nprovided by the Year 1 sample of the Dark Energy Spectroscopic Instrument\n(DESI). The ELGs are divided into two redshift intervals: $0.75 < z < 1.0$ and\n$1.0 < z < 1.65$. We find that the composite spectra constructed by stacking\nthe ELG-QSO pairs show evolution with redshift, with $z>1$ having a\nsystematically higher signal of Mg II absorption. Within 1 Mpc, the covering\nfraction of the cool gas at $z > 1$ is higher than that of $z < 1$. The\nenhancement becomes less apparent especially if the projected distance\n$r_{p}>$1 Mpc. Also, ELGs with higher stellar mass and star formation rate\n(SFR) yield higher clustering of Mg II absorbers at $z<1$. For $z>1$, the\ncovering fractions with different SFRs show little difference. The higher Mg II\nabsorption at higher redshift also supports the observations of higher star\nformation at cosmic noon. Besides, the profile of Mg II absorption reveals a\nchange of slope on scales of about 1 Mpc, consistent with the expected\ntransition from a dark matter halo-dominated environment to a regime where\nclustering is dominated by halo-halo correlations. We estimate the cool gas\ndensity profile and derive the metal abundance at different redshifts. The\ngrowth of metal abundance suggests an increased presence of cool gas in the\nintergalactic medium (IGM) towards higher redshifts.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}