{"id":"2407.16662","title":"Transverse resistance due to electronic inhomogeneities in\n  superconductors","authors":"Shamashis Sengupta, Alireza Farhadizadeh, Joe Youssef, Sara Loucif,\n  Florian Pallier, Louis Dumoulin, Kasturi Saha, Sumiran Pujari, Magnus Oden,\n  Claire Marrache-Kikuchi, Miguel Monteverde","authorsParsed":[["Sengupta","Shamashis",""],["Farhadizadeh","Alireza",""],["Youssef","Joe",""],["Loucif","Sara",""],["Pallier","Florian",""],["Dumoulin","Louis",""],["Saha","Kasturi",""],["Pujari","Sumiran",""],["Oden","Magnus",""],["Marrache-Kikuchi","Claire",""],["Monteverde","Miguel",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:26:16 GMT"}],"updateDate":"2024-07-24","timestamp":1721755576000,"abstract":"  Phase transitions in many-body systems are often associated with the\nemergence of spatial inhomogeneities. Such features may develop at microscopic\nlengthscales and are not necessarily evident in measurements of macroscopic\nquantities. In this work, we address the topic of distribution of current paths\nin superconducting films. Typical lengthscales associated with\nsuperconductivity are in the range of nanometres. Accordingly, measurements of\nelectrical resistance over much larger distances are supposed to be insensitive\nto details of spatial inhomogeneities of electronic properties. We observe\nthat, contrary to expectations, current paths adopt a highly non-uniform\ndistribution at the onset of the superconducting transition which is manifested\nin the development of a finite transverse resistance. The anisotropic\ndistribution of current density is unrelated to the structural properties of\nthe superconducting films, and indicates the emergence of electronic\ninhomogeneities perceivable over macroscopic distances. Our experiments reveal\nthe ubiquitous nature of this phenomenon in conventional superconductors.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AJBDf9eylL7SHubDwBBADsmM_dV96-Bn8BYJWr3wyGI","pdfSize":"2046658"}
