{"id":"2407.10523","title":"Variational Quantum Imaginary Time Evolution for Matrix Product State\n  Ansatz with Tests on Transcorrelated Hamiltonians","authors":"Hao-En Li, Xiang Li, Jia-Cheng Huang, Guang-Ze Zhang, Zhu-Ping Shen,\n  Chen Zhao, Jun Li, Han-Shi Hu","authorsParsed":[["Li","Hao-En",""],["Li","Xiang",""],["Huang","Jia-Cheng",""],["Zhang","Guang-Ze",""],["Shen","Zhu-Ping",""],["Zhao","Chen",""],["Li","Jun",""],["Hu","Han-Shi",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 08:28:52 GMT"}],"updateDate":"2024-07-16","timestamp":1721032132000,"abstract":"  The matrix product state (MPS) ansatz offers a promising approach for finding\nthe ground state of molecular Hamiltonians and solving quantum chemistry\nproblems. Building on this concept, the proposed technique of quantum circuit\nMPS (QCMPS) enables the simulation of chemical systems using a relatively small\nnumber of qubits. In this study, we enhance the optimization performance of the\nQCMPS ansatz by employing the variational quantum imaginary time evolution\n(VarQITE) approach. Guided by McLachlan's variational principle, the VarQITE\nmethod provides analytical metrics and gradients, resulting in improved\nconvergence efficiency and robustness of the QCMPS. We validate these\nimprovements numerically through simulations of $\\rm H_2$, $\\rm H_4$, and $\\rm\nLiH$ molecules. Additionally, given that VarQITE is applicable to non-Hermitian\nHamiltonians, we evaluate its effectiveness in preparing the ground state of\ntranscorrelated (TC) Hamiltonians. This approach yields energy estimates\ncomparable to the complete basis set (CBS) limit while using even fewer qubits.\nSpecifically, we perform simulations of the beryllium atom and $\\rm LiH$\nmolecule using only three qubits, maintaining high fidelity with the CBS ground\nstate energy of these systems. This qubit reduction is achieved through the\ncombined advantages of both the QCMPS ansatz and transcorrelation. Our findings\ndemonstrate the potential practicality of this quantum chemistry algorithm on\nnear-term quantum devices.\n","subjects":["Physics/Quantum Physics","Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}