{"id":"2407.12916","title":"Tomography of parametrized quantum states","authors":"Franz J. Schreiber, Jens Eisert, Johannes Jakob Meyer","authorsParsed":[["Schreiber","Franz J.",""],["Eisert","Jens",""],["Meyer","Johannes Jakob",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 18:00:04 GMT"}],"updateDate":"2024-07-19","timestamp":1721239204000,"abstract":"  Characterizing quantum systems is a fundamental task that enables the\ndevelopment of quantum technologies. Various approaches, ranging from full\ntomography to instances of classical shadows, have been proposed to this end.\nHowever, quantum states that are being prepared in practice often involve\nfamilies of quantum states characterized by continuous parameters, such as the\ntime evolution of a quantum state. In this work, we extend the foundations of\nquantum state tomography to parametrized quantum states. We introduce a\nframework that unifies different notions of tomography and use it to establish\na natural figure of merit for tomography of parametrized quantum states.\nBuilding on this, we provide an explicit algorithm that combines signal\nprocessing techniques with a tomography scheme to recover an approximation to\nthe parametrized quantum state equipped with explicit guarantees. Our algorithm\nuses techniques from compressed sensing to exploit structure in the parameter\ndependence and operates with a plug and play nature, using the underlying\ntomography scheme as a black box. In an analogous fashion, we derive a figure\nof merit that applies to parametrized quantum channels. Substituting the state\ntomography scheme with a scheme for process tomography in our algorithm, we\nthen obtain a protocol for tomography of parametrized quantum channels. We\nshowcase our algorithm with two examples of shadow tomography of states\ntime-evolved under an NMR Hamiltonian and a free fermionic Hamiltonian.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}