{"id":"2407.08930","title":"Resource-aware scheduling of multiple quantum circuits on a hardware\n  device","authors":"Debasmita Bhoumik, Ritajit Majumdar, Susmita Sur-Kolay","authorsParsed":[["Bhoumik","Debasmita",""],["Majumdar","Ritajit",""],["Sur-Kolay","Susmita",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 02:33:07 GMT"}],"updateDate":"2024-07-15","timestamp":1720751587000,"abstract":"  Recent quantum technologies and quantum error-correcting codes emphasize the\nrequirement for arranging interacting qubits in a nearest-neighbor (NN)\nconfiguration while mapping a quantum circuit onto a given hardware device, in\norder to avoid undesirable noise. It is equally important to minimize the\nwastage of qubits in a quantum hardware device with m qubits while running\ncircuits of n qubits in total, with n < m. In order to prevent cross-talk\nbetween two circuits, a buffer distance between their layouts is needed.\nFurthermore, not all the qubits and all the two-qubit interactions are at the\nsame noise-level. Scheduling multiple circuits on the same hardware may create\na possibility that some circuits are executed on a noisier layout than the\nothers. In this paper, we consider an optimization problem which schedules as\nmany circuits as possible for execution in parallel on the hardware, while\nmaintaining a pre-defined layout quality for each. An integer linear\nprogramming formulation to ensure maximum fidelity while preserving the nearest\nneighbor arrangement among interacting qubits is presented. Our assertion is\nsupported by comprehensive investigations involving various well-known quantum\ncircuit benchmarks. As this scheduling problem is shown to be NP Hard, we also\npropose a greedy heuristic method which provides 2x and 3x better utilization\nfor 27-qubit and 127-qubit hardware devices respectively in terms of qubits and\ntime.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6_HduQ9gVfQEo1nHrv1ZwyNN9CsQmwI2Zj4brxd93X4","pdfSize":"2422864"}
