{"id":"2407.20870","title":"Mean of Means: A 10-dollar Solution for Human Localization with\n  Calibration-free and Unconstrained Camera Settings","authors":"Tianyi Zhang, Wengyu Zhang, Xulu Zhang, Jiaxin Wu, Xiao-Yong Wei,\n  Jiannong Cao, Qing Li","authorsParsed":[["Zhang","Tianyi",""],["Zhang","Wengyu",""],["Zhang","Xulu",""],["Wu","Jiaxin",""],["Wei","Xiao-Yong",""],["Cao","Jiannong",""],["Li","Qing",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 14:45:31 GMT"}],"updateDate":"2024-07-31","timestamp":1722350731000,"abstract":"  Accurate human localization is crucial for various applications, especially\nin the Metaverse era. Existing high precision solutions rely on expensive,\ntag-dependent hardware, while vision-based methods offer a cheaper, tag-free\nalternative. However, current vision solutions based on stereo vision face\nlimitations due to rigid perspective transformation principles and error\npropagation in multi-stage SVD solvers. These solutions also require multiple\nhigh-resolution cameras with strict setup constraints. To address these\nlimitations, we propose a probabilistic approach that considers all points on\nthe human body as observations generated by a distribution centered around the\nbody's geometric center. This enables us to improve sampling significantly,\nincreasing the number of samples for each point of interest from hundreds to\nbillions. By modeling the relation between the means of the distributions of\nworld coordinates and pixel coordinates, leveraging the Central Limit Theorem,\nwe ensure normality and facilitate the learning process. Experimental results\ndemonstrate human localization accuracy of 95% within a 0.3m range and nearly\n100% accuracy within a 0.5m range, achieved at a low cost of only 10 USD using\ntwo web cameras with a resolution of 640x480 pixels.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computational Geometry"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}