{"id":"2407.13288","title":"Hierarchical Stage-Wise Training of Linked Deep Neural Networks for\n  Multi-Building and Multi-Floor Indoor Localization Based on Wi-Fi RSSI\n  Fingerprinting","authors":"Sihao Li, Kyeong Soo Kim, Zhe Tang, Graduate and Jeremy S. Smith","authorsParsed":[["Li","Sihao",""],["Kim","Kyeong Soo",""],["Tang","Zhe",""],["Graduate","",""],["Smith","Jeremy S.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:43:26 GMT"}],"updateDate":"2024-09-18","timestamp":1721292206000,"abstract":"  In this paper, we present a new solution to the problem of large-scale\nmulti-building and multi-floor indoor localization based on linked neural\nnetworks, where each neural network is dedicated to a sub-problem and trained\nunder a hierarchical stage-wise training framework. When the measured data from\nsensors have a hierarchical representation as in multi-building and multi-floor\nindoor localization, it is important to exploit the hierarchical nature in data\nprocessing to provide a scalable solution. In this regard, the hierarchical\nstage-wise training framework extends the original stage-wise training\nframework to the case of multiple linked networks by training a lower-hierarchy\nnetwork based on the prior knowledge gained from the training of\nhigher-hierarchy networks. The experimental results with the publicly-available\nUJIIndoorLoc multi-building and multi-floor Wi-Fi RSSI fingerprint database\ndemonstrate that the linked neural networks trained under the proposed\nhierarchical stage-wise training framework can achieve a three-dimensional\nlocalization error of 8.19 m, which, to the best of the authors' knowledge, is\nthe most accurate result ever obtained for neural network-based models trained\nand evaluated with the full datasets of the UJIIndoorLoc database, and that,\nwhen applied to a model based on hierarchical convolutional neural networks,\nthe proposed training framework can also significantly reduce the\nthree-dimensional localization error from 11.78 m to 8.71 m.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}