{"id":"2407.15530","title":"Pulse Shaping for Random ISAC Signals: The Ambiguity Function Between\n  Symbols Matters","authors":"Zihan Liao, Fan Liu, Shuangyang Li, Yifeng Xiong, Weijie Yuan,\n  Christos Masouros, and Marco Lops","authorsParsed":[["Liao","Zihan",""],["Liu","Fan",""],["Li","Shuangyang",""],["Xiong","Yifeng",""],["Yuan","Weijie",""],["Masouros","Christos",""],["Lops","Marco",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 10:35:37 GMT"}],"updateDate":"2024-07-23","timestamp":1721644537000,"abstract":"  Integrated sensing and communications (ISAC) has emerged as a pivotal\nenabling technology for next-generation wireless networks. Despite the distinct\nsignal design requirements of sensing and communication (S&C) systems, shifting\nthe symbol-wise pulse shaping (SWiPS) framework from communication-only systems\nto ISAC poses significant challenges in signal design and processing This paper\naddresses these challenges by examining the ambiguity function (AF) of the\nSWiPS ISAC signal and introducing a novel pulse shaping design for\nsingle-carrier ISAC transmission. We formulate optimization problems to\nminimize the average integrated sidelobe level (ISL) of the AF, as well as the\nweighted ISL (WISL) while satisfying inter-symbol interference (ISI),\nout-of-band emission (OOBE), and power constraints. Our contributions include\nestablishing the relationship between the AFs of both the random data symbols\nand signaling pulses, analyzing the statistical characteristics of the AF, and\ndeveloping algorithmic frameworks for pulse shaping optimization using\nsuccessive convex approximation (SCA) and alternating direction method of\nmultipliers (ADMM) approaches. Numerical results are provided to validate our\ntheoretical analysis, which demonstrate significant performance improvements in\nthe proposed SWiPS design compared to the root-raised cosine (RRC) pulse\nshaping for conventional communication systems.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}