{"id":"2407.13219","title":"Multi-sentence Video Grounding for Long Video Generation","authors":"Wei Feng, Xin Wang, Hong Chen, Zeyang Zhang, Wenwu Zhu","authorsParsed":[["Feng","Wei",""],["Wang","Xin",""],["Chen","Hong",""],["Zhang","Zeyang",""],["Zhu","Wenwu",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 07:05:05 GMT"}],"updateDate":"2024-07-19","timestamp":1721286305000,"abstract":"  Video generation has witnessed great success recently, but their application\nin generating long videos still remains challenging due to the difficulty in\nmaintaining the temporal consistency of generated videos and the high memory\ncost during generation. To tackle the problems, in this paper, we propose a\nbrave and new idea of Multi-sentence Video Grounding for Long Video Generation,\nconnecting the massive video moment retrieval to the video generation task for\nthe first time, providing a new paradigm for long video generation. The method\nof our work can be summarized as three steps: (i) We design sequential scene\ntext prompts as the queries for video grounding, utilizing the massive video\nmoment retrieval to search for video moment segments that meet the text\nrequirements in the video database. (ii) Based on the source frames of\nretrieved video moment segments, we adopt video editing methods to create new\nvideo content while preserving the temporal consistency of the retrieved video.\nSince the editing can be conducted segment by segment, and even frame by frame,\nit largely reduces the memory cost. (iii) We also attempt video morphing and\npersonalized generation methods to improve the subject consistency of long\nvideo generation, providing ablation experimental results for the subtasks of\nlong video generation. Our approach seamlessly extends the development in\nimage/video editing, video morphing and personalized generation, and video\ngrounding to the long video generation, offering effective solutions for\ngenerating long videos at low memory cost.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"qMlh1dvqebOEsi6JBQ6MVF4gsiER8e-0LOxUYyjPMR8","pdfSize":"12025071"}
