{"id":"2407.12678","title":"Promptable Counterfactual Diffusion Model for Unified Brain Tumor\n  Segmentation and Generation with MRIs","authors":"Yiqing Shen, Guannan He, Mathias Unberath","authorsParsed":[["Shen","Yiqing",""],["He","Guannan",""],["Unberath","Mathias",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:58:58 GMT"}],"updateDate":"2024-07-18","timestamp":1721231938000,"abstract":"  Brain tumor analysis in Magnetic Resonance Imaging (MRI) is crucial for\naccurate diagnosis and treatment planning. However, the task remains\nchallenging due to the complexity and variability of tumor appearances, as well\nas the scarcity of labeled data. Traditional approaches often address tumor\nsegmentation and image generation separately, limiting their effectiveness in\ncapturing the intricate relationships between healthy and pathological tissue\nstructures. We introduce a novel promptable counterfactual diffusion model as a\nunified solution for brain tumor segmentation and generation in MRI. The key\ninnovation lies in our mask-level prompting mechanism at the sampling stage,\nwhich enables guided generation and manipulation of specific healthy or\nunhealthy regions in MRI images. Specifically, the model's architecture allows\nfor bidirectional inference, which can segment tumors in existing images and\ngenerate realistic tumor structures in healthy brain scans. Furthermore, we\npresent a two-step approach for tumor generation and position transfer,\nshowcasing the model's versatility in synthesizing realistic tumor structures.\nExperiments on the BRATS2021 dataset demonstrate that our method outperforms\ntraditional counterfactual diffusion approaches, achieving a mean IoU of 0.653\nand mean Dice score of 0.785 for tumor segmentation, outperforming the 0.344\nand 0.475 of conventional counterfactual diffusion model. Our work contributes\nto improving brain tumor detection and segmentation accuracy, with potential\nimplications for data augmentation and clinical decision support in\nneuro-oncology. The code is available at\nhttps://github.com/arcadelab/counterfactual_diffusion.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}