{"id":"2407.18369","title":"AI Safety in Generative AI Large Language Models: A Survey","authors":"Jaymari Chua, Yun Li, Shiyi Yang, Chen Wang, Lina Yao","authorsParsed":[["Chua","Jaymari",""],["Li","Yun",""],["Yang","Shiyi",""],["Wang","Chen",""],["Yao","Lina",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 09:00:18 GMT"}],"updateDate":"2024-07-29","timestamp":1720256418000,"abstract":"  Large Language Model (LLMs) such as ChatGPT that exhibit generative AI\ncapabilities are facing accelerated adoption and innovation. The increased\npresence of Generative AI (GAI) inevitably raises concerns about the risks and\nsafety associated with these models. This article provides an up-to-date survey\nof recent trends in AI safety research of GAI-LLMs from a computer scientist's\nperspective: specific and technical. In this survey, we explore the background\nand motivation for the identified harms and risks in the context of LLMs being\ngenerative language models; our survey differentiates by emphasising the need\nfor unified theories of the distinct safety challenges in the research\ndevelopment and applications of LLMs. We start our discussion with a concise\nintroduction to the workings of LLMs, supported by relevant literature. Then we\ndiscuss earlier research that has pointed out the fundamental constraints of\ngenerative models, or lack of understanding thereof (e.g., performance and\nsafety trade-offs as LLMs scale in number of parameters). We provide a\nsufficient coverage of LLM alignment -- delving into various approaches,\ncontending methods and present challenges associated with aligning LLMs with\nhuman preferences. By highlighting the gaps in the literature and possible\nimplementation oversights, our aim is to create a comprehensive analysis that\nprovides insights for addressing AI safety in LLMs and encourages the\ndevelopment of aligned and secure models. We conclude our survey by discussing\nfuture directions of LLMs for AI safety, offering insights into ongoing\nresearch in this critical area.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}