{"id":"2407.04519","title":"Success or Failure? Analyzing Segmentation Refinement with Few-Shot\n  Segmentation","authors":"Seonghyeon Moon, Haein Kong, Muhammad Haris Khan","authorsParsed":[["Moon","Seonghyeon",""],["Kong","Haein",""],["Khan","Muhammad Haris",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 14:04:25 GMT"}],"updateDate":"2024-07-08","timestamp":1720188265000,"abstract":"  The purpose of segmentation refinement is to enhance the initial coarse masks\ngenerated by segmentation algorithms. The refined masks are expected to capture\nthe details and contours of the target objects. Research on segmentation\nrefinement has developed as a response to the need for high-quality initial\nmasks. However, to our knowledge, no method has been developed that can\ndetermine the success of segmentation refinement. Such a method could ensure\nthe reliability of segmentation in applications where the outcome of the\nsegmentation is important, and fosters innovation in image processing\ntechnologies. To address this research gap, we propose JFS~(Judging From\nSupport-set), a method to identify the success of segmentation refinement\nleveraging a few-shot segmentation (FSS) model. The traditional goal of the\nproblem in FSS is to find a target object in a query image utilizing target\ninformation given by a support set. However, in our proposed method, we use the\nFSS network in a novel way to assess the segmentation refinement. When there\nare two masks, a coarse mask and a refined mask from segmentation refinement,\nthese two masks become support masks. The existing support mask works as a\nground truth mask to judge whether the quality of the refined segmentation is\nmore accurate than the coarse mask. We first obtained a coarse mask and refined\nit using SEPL (SAM Enhanced Pseduo-Labels) to get the two masks. Then, these\nbecome input to FSS model to judge whether the post-processing was successful.\nJFS is evaluated on the best and worst cases from SEPL to validate its\neffectiveness. The results showed that JFS can determine whether the SEPL is a\nsuccess or not.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}