{"id":"2407.12594","title":"VisFocus: Prompt-Guided Vision Encoders for OCR-Free Dense Document\n  Understanding","authors":"Ofir Abramovich, Niv Nayman, Sharon Fogel, Inbal Lavi, Ron Litman,\n  Shahar Tsiper, Royee Tichauer, Srikar Appalaraju, Shai Mazor and R. Manmatha","authorsParsed":[["Abramovich","Ofir",""],["Nayman","Niv",""],["Fogel","Sharon",""],["Lavi","Inbal",""],["Litman","Ron",""],["Tsiper","Shahar",""],["Tichauer","Royee",""],["Appalaraju","Srikar",""],["Mazor","Shai",""],["Manmatha","R.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:16:46 GMT"}],"updateDate":"2024-07-18","timestamp":1721225806000,"abstract":"  In recent years, notable advancements have been made in the domain of visual\ndocument understanding, with the prevailing architecture comprising a cascade\nof vision and language models. The text component can either be extracted\nexplicitly with the use of external OCR models in OCR-based approaches, or\nalternatively, the vision model can be endowed with reading capabilities in\nOCR-free approaches. Typically, the queries to the model are input exclusively\nto the language component, necessitating the visual features to encompass the\nentire document. In this paper, we present VisFocus, an OCR-free method\ndesigned to better exploit the vision encoder's capacity by coupling it\ndirectly with the language prompt. To do so, we replace the down-sampling\nlayers with layers that receive the input prompt and allow highlighting\nrelevant parts of the document, while disregarding others. We pair the\narchitecture enhancements with a novel pre-training task, using language\nmasking on a snippet of the document text fed to the visual encoder in place of\nthe prompt, to empower the model with focusing capabilities. Consequently,\nVisFocus learns to allocate its attention to text patches pertinent to the\nprovided prompt. Our experiments demonstrate that this prompt-guided visual\nencoding approach significantly improves performance, achieving\nstate-of-the-art results on various benchmarks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GHggz2vntE7FZFqrpWye1rHgEI8eDAEx1kgmJGizf4E","pdfSize":"31627978"}
