{"id":"2407.11447","title":"The first-order phase transition in the neutron star from the deep\n  neural network","authors":"Wenjie Zhou, Hong Shen, Jinniu Hu, and Ying Zhang","authorsParsed":[["Zhou","Wenjie",""],["Shen","Hong",""],["Hu","Jinniu",""],["Zhang","Ying",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 07:28:14 GMT"}],"updateDate":"2024-07-17","timestamp":1721114894000,"abstract":"  This study investigates the first-order phase transition within neutron\nstars, leveraging the deep neural network (DNN) framework alongside\ncontemporary astronomical measurements. The equation of state (EOS) for neutron\nstars is delineated in a piecewise polytropic form, with the speed of sound\n($c_s$) serving as a pivotal determinant. In the phase transition region, $c_s$\nis presumed to be zero, while in other intervals, it is optimized utilizing the\nDNN. Various onset energy densities of phase transition ($\\varepsilon_{pt}$),\nspanning from $2\\varepsilon_0$ to $3\\varepsilon_0$ (where $\\varepsilon_0$\ndenotes the energy density at nuclear saturation density), as well as phase\ntransition widths ($\\Delta\\varepsilon$) ranging from $0.5\\varepsilon_0$ to\n$\\varepsilon_0$, are examined. Our findings underscore that smaller values of\n$\\varepsilon_{pt}$ lead to a more substantial impact of $\\Delta\\varepsilon$ on\nneutron star properties, encompassing maximum mass, corresponding radius, tidal\ndeformability, phase transition mass, and trace anomaly. Conversely, when\n$\\varepsilon_{pt}$ exceeds $2.5\\varepsilon_0$, the influence of\n$\\Delta\\varepsilon$ diminishes, resulting in a stiffer EOS compared to\nscenarios lacking a phase transition. Furthermore, the trace anomaly at high\ndensity shifts to negative values upon the commencement of the phase\ntransition. It is noteworthy that the correlations between the average speed of\nsound at different energy density segments demonstrate a notably weak\nconnection. The discernment of whether a phase transition has occurred with the\npresent observables of neutron stars poses a challenging task.\n","subjects":["Physics/Nuclear Theory","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}