{"id":"2407.15763","title":"Towards Open-World Object-based Anomaly Detection via Self-Supervised\n  Outlier Synthesis","authors":"Brian K. S. Isaac-Medina and Yona Falinie A. Gaus and Neelanjan\n  Bhowmik and Toby P. Breckon","authorsParsed":[["Isaac-Medina","Brian K. S.",""],["Gaus","Yona Falinie A.",""],["Bhowmik","Neelanjan",""],["Breckon","Toby P.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 16:16:38 GMT"}],"updateDate":"2024-07-23","timestamp":1721664998000,"abstract":"  Object detection is a pivotal task in computer vision that has received\nsignificant attention in previous years. Nonetheless, the capability of a\ndetector to localise objects out of the training distribution remains\nunexplored. Whilst recent approaches in object-level out-of-distribution (OoD)\ndetection heavily rely on class labels, such approaches contradict truly\nopen-world scenarios where the class distribution is often unknown. In this\ncontext, anomaly detection focuses on detecting unseen instances rather than\nclassifying detections as OoD. This work aims to bridge this gap by leveraging\nan open-world object detector and an OoD detector via virtual outlier\nsynthesis. This is achieved by using the detector backbone features to first\nlearn object pseudo-classes via self-supervision. These pseudo-classes serve as\nthe basis for class-conditional virtual outlier sampling of anomalous features\nthat are classified by an OoD head. Our approach empowers our overall object\ndetector architecture to learn anomaly-aware feature representations without\nrelying on class labels, hence enabling truly open-world object anomaly\ndetection. Empirical validation of our approach demonstrates its effectiveness\nacross diverse datasets encompassing various imaging modalities (visible,\ninfrared, and X-ray). Moreover, our method establishes state-of-the-art\nperformance on object-level anomaly detection, achieving an average recall\nscore improvement of over 5.4% for natural images and 23.5% for a security\nX-ray dataset compared to the current approaches. In addition, our method\ndetects anomalies in datasets where current approaches fail. Code available at\nhttps://github.com/KostadinovShalon/oln-ssos.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VM7OTZQqqQmeANsHpJ77f6mfjHzN91MvBuJqBTNvZp8","pdfSize":"38036334"}
