{"id":"2407.08758","title":"Credit Card Fraud Detection in the Nigerian Financial Sector: A\n  Comparison of Unsupervised TensorFlow-Based Anomaly Detection Techniques,\n  Autoencoders and PCA Algorithm","authors":"Jennifer Onyeama","authorsParsed":[["Onyeama","Jennifer",""]],"versions":[{"version":"v1","created":"Fri, 8 Mar 2024 21:22:05 GMT"}],"updateDate":"2024-07-15","timestamp":1709932925000,"abstract":"  Credit card fraud is a major cause of national concern in the Nigerian\nfinancial sector, affecting hundreds of transactions per second and impacting\ninternational ecommerce negatively. Despite the rapid spread and adoption of\nonline marketing, millions of Nigerians are prevented from transacting in\nseveral countries with local credit cards due to bans and policies directed at\nrestricting credit card fraud. Presently, a myriad of technologies exist to\ndetect fraudulent transactions, a few of which are adopted by Nigerian\nfinancial institutions to proactively manage the situation. Fraud detection\nallows institutions to restrict offenders from networks and with a centralized\nbanking identity management system, such as the Bank Verification Number used\nby the Central Bank of Nigeria, offenders who may have stolen other identities\ncan be backtraced and their bank accounts frozen. This paper aims to compare\nthe effectiveness of two fraud detection technologies that are projected to\nwork fully independent of human intervention to possibly predict and detect\nfraudulent credit card transactions. Autoencoders as an unsupervised tensorflow\nbased anomaly detection technique generally offers greater performance in\ndimensionality reduction than the Principal Component Analysis, and this theory\nwas tested out on Nigerian credit card transaction data. Results demonstrate\nthat autoencoders are better suited to analyzing complex and extensive datasets\nand offer more reliable results with minimal mislabeling than the PCA\nalgorithm.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}