{"id":"2407.05279","title":"A Hybrid Registration and Fusion Method for Hyperspectral\n  Super-resolution","authors":"Kunjing Yang, Minru Bai and TingLu","authorsParsed":[["Yang","Kunjing",""],["Bai","Minru",""],["TingLu","",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 06:36:19 GMT"}],"updateDate":"2024-07-09","timestamp":1720334179000,"abstract":"  Fusing hyperspectral images (HSIs) with multispectral images (MSIs) has\nbecome a mainstream approach to enhance the spatial resolution of HSIs. Many\nHSI-MSI fusion methods have achieved impressive results. Nevertheless, certain\nchallenges persist, including: (a) A majority of current methods rely on\naccurate registration of HSI and MSI, which can be challenging in real-world\napplications.(b) The obtained HSI-MSI pairs may not be fully utilized. In this\npaper, we propose a hybrid registration and fusion constrained optimization\nmodel named RAF-NLRGS. With respect to challenge (a), the RAF model integrates\nbatch image alignment within the fusion process, facilitating simultaneous\nexecution of image registration and fusion. To address issue (b), the NLRGS\nmodel incorporates a nonconvex low-rank and group-sparse structure, leveraging\ngroup sparsity to effectively harness valuable information embedded in the\nresidual data. Moreover, the NLRGS model can further enhance fusion performance\nbased on the RAF model. Subsequently, the RAF-NLRGS model is solved within the\nframework of Generalized Gauss-Newton (GGN) algorithm and Proximal Alternating\nOptimization (PAO) algorithm. Theoretically, we establish the error bounds for\nthe NLRGS model and the convergence analysis of corresponding algorithms is\nalso presented. Finally, extensive numerical experiments on HSI datasets are\nconducted to verify the effectiveness of our method.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}