{"id":"2407.10663","title":"Spatio-temporal neural distance fields for conditional generative\n  modeling of the heart","authors":"Kristine S{\\o}rensen, Paula Diez, Jan Margeta, Yasmin El Youssef,\n  Michael Pham, Jonas Jalili Pedersen, Tobias K\\\"uhl, Ole de Backer, Klaus\n  Kofoed, Oscar Camara, and Rasmus Paulsen","authorsParsed":[["Sørensen","Kristine",""],["Diez","Paula",""],["Margeta","Jan",""],["Youssef","Yasmin El",""],["Pham","Michael",""],["Pedersen","Jonas Jalili",""],["Kühl","Tobias",""],["de Backer","Ole",""],["Kofoed","Klaus",""],["Camara","Oscar",""],["Paulsen","Rasmus",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 12:26:52 GMT"}],"updateDate":"2024-07-16","timestamp":1721046412000,"abstract":"  The rhythmic pumping motion of the heart stands as a cornerstone in life, as\nit circulates blood to the entire human body through a series of carefully\ntimed contractions of the individual chambers. Changes in the size, shape and\nmovement of the chambers can be important markers for cardiac disease and\nmodeling this in relation to clinical demography or disease is therefore of\ninterest. Existing methods for spatio-temporal modeling of the human heart\nrequire shape correspondence over time or suffer from large memory\nrequirements, making it difficult to use for complex anatomies. We introduce a\nnovel conditional generative model, where the shape and movement is modeled\nimplicitly in the form of a spatio-temporal neural distance field and\nconditioned on clinical demography. The model is based on an auto-decoder\narchitecture and aims to disentangle the individual variations from that\nrelated to the clinical demography. It is tested on the left atrium (including\nthe left atrial appendage), where it outperforms current state-of-the-art\nmethods for anatomical sequence completion and generates synthetic sequences\nthat realistically mimics the shape and motion of the real left atrium. In\npractice, this means we can infer functional measurements from a static image,\ngenerate synthetic populations with specified demography or disease and\ninvestigate how non-imaging clinical data effect the shape and motion of\ncardiac anatomies.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6FUEX4xXwcUSbsgwOaZLpJjdKLo1Wp1gdFETzO4R1Y0","pdfSize":"5039396"}
