{"id":"2407.07702","title":"Leveraging Self-Supervised Learning for MIMO-OFDM Channel Representation\n  and Generation","authors":"Zongxi Liu, Jiacheng Chen, Yunting Xu, Ting Ma, Jingbo Liu, Haibo Zhou\n  and Dusit Niyato","authorsParsed":[["Liu","Zongxi",""],["Chen","Jiacheng",""],["Xu","Yunting",""],["Ma","Ting",""],["Liu","Jingbo",""],["Zhou","Haibo",""],["Niyato","Dusit",""]],"versions":[{"version":"v1","created":"Fri, 24 May 2024 02:54:34 GMT"}],"updateDate":"2024-07-11","timestamp":1716519274000,"abstract":"  In communications theory, the capacity of multiple input multiple\noutput-orthogonal frequency division multiplexing (MIMO-OFDM) systems is\nfundamentally determined by wireless channels, which exhibit both diversity and\ncorrelation in spatial, frequency and temporal domains. It is further\nenvisioned to exploit the inherent nature of channels, namely representation,\nto achieve geolocation-based MIMO transmission for 6G, exemplified by the\nfully-decoupled radio access network (FD-RAN). Accordingly, this paper first\nemploys self-supervised learning to obtain channel representation from\nunlabeled channel, then proposes a channel generation assisted approach for\ndetermining MIMO precoding matrix solely based on geolocation. Specifically, we\nexploit the small-scale temporal domain variations of channels at a fixed\ngeolocation, and design an ingenious pretext task tailored for contrastive\nlearning. Then, a Transformer-based encoder is trained to output channel\nrepresentations. We further develop a conditional diffusion generator to\ngenerate channel representations from geolocation. Finally, a\nTransformer-encoder-based decoder is utilized to reconstruct channels from\ngenerated representations, where the optimal channel is selected for\ncalculating the precoding matrix for both single and dual BS transmission. We\nconduct experiments on a public ray-tracing channel dataset, and the extensive\nsimulation results demonstrate the effectiveness of our channel representation\nmethod, and also showcase the performance improvement in geolocation-based MIMO\ntransmission.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}