{"id":"2407.12655","title":"Optimal Control for Clutched-Elastic Robots: A Contact-Implicit Approach","authors":"Dennis Ossadnik, Vasilije Rak\\v{c}evi\\'c, Mehmet C. Yildirim, Edmundo\n  Pozo Fortuni\\'c, Hugo T. M. Kussaba, Abdalla Swikir, Sami Haddadin","authorsParsed":[["Ossadnik","Dennis",""],["Rakčević","Vasilije",""],["Yildirim","Mehmet C.",""],["Fortunić","Edmundo Pozo",""],["Kussaba","Hugo T. M.",""],["Swikir","Abdalla",""],["Haddadin","Sami",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:38:00 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 13:27:11 GMT"}],"updateDate":"2024-08-13","timestamp":1721230680000,"abstract":"  Intrinsically elastic robots surpass their rigid counterparts in a range of\ndifferent characteristics. By temporarily storing potential energy and\nsubsequently converting it to kinetic energy, elastic robots are capable of\nhighly dynamic motions even with limited motor power. However, the\ntime-dependency of this energy storage and release mechanism remains one of the\nmajor challenges in controlling elastic robots. A possible remedy is the\nintroduction of locking elements (i.e. clutches and brakes) in the drive train.\nThis gives rise to a new class of robots, so-called clutched-elastic robots\n(CER), with which it is possible to precisely control the energy-transfer\ntiming. A prevalent challenge in the realm of CERs is the automatic discovery\nof clutch sequences. Due to complexity, many methods still rely on pre-defined\nmodes. In this paper, we introduce a novel contact-implicit scheme designed to\noptimize both control input and clutch sequence simultaneously. A penalty in\nthe objective function ensures the prevention of unnecessary clutch\ntransitions. We empirically demonstrate the effectiveness of our proposed\nmethod on a double pendulum equipped with two of our newly proposed\nclutch-based Bi-Stiffness Actuators (BSA).\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}