{"id":"2407.08559","title":"Study of a Novel Capacitive Pressure Sensor Using Spiral Comb Electrodes","authors":"Wenjie Chen, Qi Yang, Qi Liu, Yiqun Zhang, Liang He, Yuanlin Xia,\n  Zhuqing Wang, Yubo Huang, Jianfeng Chen, Cao Xia","authorsParsed":[["Chen","Wenjie",""],["Yang","Qi",""],["Liu","Qi",""],["Zhang","Yiqun",""],["He","Liang",""],["Xia","Yuanlin",""],["Wang","Zhuqing",""],["Huang","Yubo",""],["Chen","Jianfeng",""],["Xia","Cao",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:45:36 GMT"}],"updateDate":"2024-07-12","timestamp":1720709136000,"abstract":"  For traditional capacitive pressure sensors, high nonlinearity and poor\nsensitivity greatly limited their sensing applications. Hence, an innovative\ndesign of capacitors based on spiral comb electrodes is proposed for\nhigh-sensitivity pressure detection in this work. Compared to traditional\ncapacitive pressure sensors with straight plate electrodes, the proposed sensor\nwith the spiral electrodes increases the overlap areas of electrodes\nsufficiently, the pressure sensitivity can thus be greatly improved. Moreover,\nthe capacitance variation of the proposed sensor is dominated by the change of\nthe overlap area of the electrodes rather than the electrode's distance, the\nlinearity can also thus be improved to higher than 0.99. Theoretical analysis\nand COMSOL-based finite element simulation have been implemented for principle\nverification and performance optimization. Simulation results show that the\nproposed design has a mechanical sensitivity of 1.5x10-4 m/Pa, capacitive\nsensitivity of 1.10 aF/Pa, and nonlinear error of 3.63%, respectively, at the\npressure range from 0 to 30 kPa. An equivalent experiment has been further\ncarried out for verification. Experimental results also show that both the\nsensitivity and linearity of capacitive pressure sensors with spiral electrodes\nare higher than those with straight electrodes. This work not only provides a\nnew avenue for capacitor design, but also can be applied to high-sensitivity\npressure detection.\n","subjects":["Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}