{"id":"2407.07694","title":"Scalable, high-fidelity all-electronic control of trapped-ion qubits","authors":"C. M. L\\\"oschnauer, J. Mosca Toba, A. C. Hughes, S. A. King, M. A.\n  Weber, R. Srinivas, R. Matt, R. Nourshargh, D. T. C. Allcock, C. J. Ballance,\n  C. Matthiesen, M. Malinowski, T. P. Harty","authorsParsed":[["Löschnauer","C. M.",""],["Toba","J. Mosca",""],["Hughes","A. C.",""],["King","S. A.",""],["Weber","M. A.",""],["Srinivas","R.",""],["Matt","R.",""],["Nourshargh","R.",""],["Allcock","D. T. C.",""],["Ballance","C. J.",""],["Matthiesen","C.",""],["Malinowski","M.",""],["Harty","T. P.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 14:21:58 GMT"}],"updateDate":"2024-07-11","timestamp":1720621318000,"abstract":"  The central challenge of quantum computing is implementing high-fidelity\nquantum gates at scale. However, many existing approaches to qubit control\nsuffer from a scale-performance trade-off, impeding progress towards the\ncreation of useful devices. Here, we present a vision for an electronically\ncontrolled trapped-ion quantum computer that alleviates this bottleneck. Our\narchitecture utilizes shared current-carrying traces and local tuning\nelectrodes in a microfabricated chip to perform quantum gates with low noise\nand crosstalk regardless of device size. To verify our approach, we\nexperimentally demonstrate low-noise site-selective single- and two-qubit gates\nin a seven-zone ion trap that can control up to 10 qubits. We implement\nelectronic single-qubit gates with 99.99916(7)% fidelity, and demonstrate\nconsistent performance with low crosstalk across the device. We also\nelectronically generate two-qubit maximally entangled states with 99.97(1)%\nfidelity and long-term stable performance over continuous system operation.\nThese state-of-the-art results validate the path to directly scaling these\ntechniques to large-scale quantum computers based on electronically controlled\ntrapped-ion qubits.\n","subjects":["Physics/Quantum Physics","Physics/Atomic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}