{"id":"2407.09757","title":"Uncertainty Quantification in Reduced-Order Gas-Phase Atmospheric\n  Chemistry Modeling using Ensemble SINDy","authors":"Lin Guo, Xiaokai Yang, Zhonghua Zheng, Nicole Riemer, Christopher W.\n  Tessum","authorsParsed":[["Guo","Lin",""],["Yang","Xiaokai",""],["Zheng","Zhonghua",""],["Riemer","Nicole",""],["Tessum","Christopher W.",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 03:33:17 GMT"}],"updateDate":"2024-07-16","timestamp":1720841597000,"abstract":"  Uncertainty quantification during atmospheric chemistry modeling is\ncomputationally expensive as it typically requires a large number of\nsimulations using complex models. As large-scale modeling is typically\nperformed with simplified chemical mechanisms for computational tractability,\nwe describe a probabilistic surrogate modeling method using principal\ncomponents analysis (PCA) and Ensemble Sparse Identification of Nonlinear\nDynamics (E-SINDy) to both automatically simplify a gas-phase chemistry\nmechanism and to quantify the uncertainty introduced when doing so. We\ndemonstrate the application of this method on a small photochemical box model\nfor ozone formation. With 100 ensemble members, the calibration $R$-squared\nvalue is 0.96 among the three latent species on average and 0.98 for ozone,\ndemonstrating that predicted model uncertainty aligns well with actual model\nerror. In addition to uncertainty quantification, this probabilistic method\nalso improves accuracy as compared to an equivalent deterministic version, by\n$\\sim$60% for the ensemble prediction mean or $\\sim$50% for deterministic\nprediction by the best-performing single ensemble member. Overall, the ozone\ntesting root mean square error (RMSE) is 15.1% of its root mean square (RMS)\nconcentration. Although our probabilistic ensemble simulation ends up being\nslower than the reference model it emulates, we expect that use of a more\ncomplex reference model in future work will result in additional opportunities\nfor acceleration. Versions of this approach applied to full-scale chemical\nmechanisms may result in improved uncertainty quantification in models of\natmospheric composition, leading to enhanced atmospheric understanding and\nimproved support for air quality control and regulation.\n","subjects":["Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7irJnk_C7Qwg6fP2LS894oufO6Yguaw6tdNbXfJahCk","pdfSize":"10839019"}
