{"id":"2407.14152","title":"Wideband Relative Transfer Function (RTF) Estimation Exploiting\n  Frequency Correlations","authors":"Giovanni Bologni, Richard C. Hendriks and Richard Heusdens","authorsParsed":[["Bologni","Giovanni",""],["Hendriks","Richard C.",""],["Heusdens","Richard",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 09:30:06 GMT"}],"updateDate":"2024-07-22","timestamp":1721381406000,"abstract":"  This article focuses on estimating relative transfer functions (RTFs) for\nbeamforming applications. While traditional methods assume that spectra are\nuncorrelated, this assumption is often violated in practical scenarios due to\nnatural phenomena such as the Doppler effect, artificial manipulations like\ntime-domain windowing, or the non-stationary nature of the signals, as observed\nin speech. To address this, we propose an RTF estimation technique that\nleverages spectral and spatial correlations through subspace analysis. To\novercome the challenge of estimating second-order spectral statistics for real\ndata, we employ a phase-adjusted estimator originally proposed in the context\nof engine fault detection. Additionally, we derive Cram\\'er--Rao bounds (CRBs)\nfor the RTF estimation task, providing theoretical insights into the achievable\nestimation accuracy. The bounds show that channel estimation can be performed\nmore accurately if the noise or the target presents spectral correlations.\nExperiments on real and synthetic data show that our technique outperforms the\nnarrowband maximum-likelihood estimator when the target exhibits spectral\ncorrelations. Although the accuracy of the proposed algorithm is generally\nclose to the bound, there is some room for improvement, especially when noise\nsignals with high spectral correlation are present. While the applications of\nchannel estimation are diverse, we demonstrate the method in the context of\narray processing for speech.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}