{"id":"2407.02435","title":"A multi-field decomposed model order reduction approach for\n  thermo-mechanically coupled gradient-extended damage simulations","authors":"Qinghua Zhang, Stephan Ritzert, Jian Zhang, Jannick Kehls, Stefanie\n  Reese, Tim Brepols","authorsParsed":[["Zhang","Qinghua",""],["Ritzert","Stephan",""],["Zhang","Jian",""],["Kehls","Jannick",""],["Reese","Stefanie",""],["Brepols","Tim",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 17:14:01 GMT"}],"updateDate":"2024-07-03","timestamp":1719940441000,"abstract":"  Numerical simulations are crucial for comprehending how engineering\nstructures behave under extreme conditions, particularly when dealing with\nthermo-mechanically coupled issues compounded by damage-induced material\nsoftening. However, such simulations often entail substantial computational\nexpenses. To mitigate this, the focus has shifted towards employing model order\nreduction (MOR) techniques, which hold promise for accelerating computations.\nYet, applying MOR to highly nonlinear, multi-physical problems influenced by\nmaterial softening remains a relatively new area of research, with numerous\nunanswered questions. Addressing this gap, this study proposes and investigates\na novel multi-field decomposed MOR technique, rooted in a snapshot-based Proper\nOrthogonal Decomposition-Galerkin (POD-G) projection approach. Utilizing a\nrecently developed thermo-mechanically coupled gradient-extended\ndamage-plasticity model as a case study, this work demonstrates that splitting\nsnapshot vectors into distinct physical fields (displacements, damage,\ntemperature) and projecting them onto separate lower-dimensional subspaces can\nyield more precise and stable outcomes compared to conventional methods.\nThrough a series of numerical benchmark tests, our multi-field decomposed MOR\ntechnique demonstrates its capacity to significantly reduce computational\nexpenses in simulations involving severe damage, while maintaining a high level\nof accuracy.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}