{"id":"2407.21617","title":"Non-extremal Island in de Sitter Gravity","authors":"Peng-Xiang Hao, Taishi Kawamoto, Shan-Ming Ruan, Tadashi Takayanagi","authorsParsed":[["Hao","Peng-Xiang",""],["Kawamoto","Taishi",""],["Ruan","Shan-Ming",""],["Takayanagi","Tadashi",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:08:50 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 15:14:22 GMT"}],"updateDate":"2024-08-06","timestamp":1722434930000,"abstract":"  This paper investigates the challenges and resolutions in computing the\nentanglement entropy for the quantum field theory coupled to de Sitter (dS)\ngravity along a timelike boundary. The conventional island formula, originally\ndesigned to calculate the fine-grained entropy for a non-gravitational system\ncoupled to anti-de Sitter (AdS) gravity, encounters difficulties in de Sitter\ngravitational spacetime, failing to provide a physically plausible extremal\nisland. To overcome these problems, we introduce a doubly holographic model by\nembedding a dS$_2$ braneworld in an AdS$_3$ bulk spacetime. This approach\nfacilitates the computation of entanglement entropy through holographic\ncorrelation functions, effectively circumventing the constraints of the island\nformula. We demonstrate that the correct recipe for calculating entanglement\nentropy with dS gravity involves the non-extremal island, whose boundary is\ninstead defined at the edge of the dS gravitational region. Our findings\nindicate that, during the island phase, the entanglement wedge of the\nnon-gravitational bath includes the entire dS gravitational space. Using the\nsecond variation formula, we further show that the existence of a locally\nminimal surface anchored on the gravitational brane is intrinsically linked to\nthe extrinsic curvature of the brane.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yAV3Wgaz4texRhaZU9rW1yP3Z3VI1AX4-LWZ9AbxCjM","pdfSize":"6886579","objectId":"0x603319d4f95c97f76543503d0024d0e137d5dc69913ea2c5485d583bb314fb4c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
