{"id":"2407.16946","title":"Automatic Categorization of GitHub Actions with Transformers and\n  Few-shot Learning","authors":"Phuong T. Nguyen and Juri Di Rocco and Claudio Di Sipio and Mudita\n  Shakya and Davide Di Ruscio and Massimiliano Di Penta","authorsParsed":[["Nguyen","Phuong T.",""],["Di Rocco","Juri",""],["Di Sipio","Claudio",""],["Shakya","Mudita",""],["Di Ruscio","Davide",""],["Di Penta","Massimiliano",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 02:27:36 GMT"}],"updateDate":"2024-07-25","timestamp":1721788056000,"abstract":"  In the GitHub ecosystem, workflows are used as an effective means to automate\ndevelopment tasks and to set up a Continuous Integration and Delivery (CI/CD\npipeline). GitHub Actions (GHA) have been conceived to provide developers with\na practical tool to create and maintain workflows, avoiding reinventing the\nwheel and cluttering the workflow with shell commands. Properly leveraging the\npower of GitHub Actions can facilitate the development processes, enhance\ncollaboration, and significantly impact project outcomes. To expose actions to\nsearch engines, GitHub allows developers to assign them to one or more\ncategories manually. These are used as an effective means to group actions\nsharing similar functionality. Nevertheless, while providing a practical way to\nexecute workflows, many actions have unclear purposes, and sometimes they are\nnot categorized. In this work, we bridge such a gap by conceptualizing Gavel, a\npractical solution to increasing the visibility of actions in GitHub. By\nleveraging the content of README.MD files for each action, we use\nTransformer--a deep learning algorithm--to assign suitable categories to the\naction. We conducted an empirical investigation and compared Gavel with a\nstate-of-the-art baseline. The experimental results show that our proposed\napproach can assign categories to GitHub actions effectively, thus\noutperforming the state-of-the-art baseline.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"mvv_Z3X9J9znXF6imB1SN7GLaf7rY67DkqqbApRTQ_4","pdfSize":"1118837"}
