{"id":"2407.07721","title":"An hybrid framework OTFS OFDM based on mobile speed estimation","authors":"Amina Darghouthi, Abdelhakim Khlifi, Hmaied Shaiek, Fatma Ben Salah\n  and Belgacem Chibani","authorsParsed":[["Darghouthi","Amina",""],["Khlifi","Abdelhakim",""],["Shaiek","Hmaied",""],["Salah","Fatma Ben",""],["Chibani","Belgacem",""]],"versions":[{"version":"v1","created":"Wed, 19 Jun 2024 12:40:21 GMT"}],"updateDate":"2024-08-09","timestamp":1718800821000,"abstract":"  The Future wireless communication systems face the challenging task of\nsimultaneously providing high quality of service (QoS) and broadband data\ntransmission, while also minimizing power consumption, latency, and system\ncomplexity. Although Orthogonal Frequency Division Multiplexing OFDM has been\nwidely adopted in 4G and 5G systems, it struggles to cope with the significant\ndelay and Doppler spread in high mobility scenarios. To address these\nchallenges, a novel waveform called Orthogonal Time Frequency Space OTFS has\nemerged, aiming to outperform OFDM by closely aligning signals with the channel\nbehaviour. In this paper, we propose a switching strategy that empowers\noperators to select the most appropriate waveform based on the estimated speed\nof the mobile user. This strategy enables the base station to dynamically\nchoose the waveform that best suits the mobile users speed. Additionally, we\nsuggest integrating an Integrated Sensing and Communication radar for accurate\nDoppler estimation, providing precise information to aid in waveform selection.\nBy leveraging the switching strategy and harnessing the Doppler estimation\ncapabilities of an ISAC radar, our proposed approach aims to enhance the\nperformance of wireless communication systems in scenarios of high mobility.\nConsidering the complexity of waveform processing, we introduce an optimized\nhybrid system that combines OTFS and OFDM, resulting in reduced complexity\nwhile still retaining performance benefits. This hybrid system presents a\npromising solution for improving the performance of wireless communication\nsystems in scenarios with a high mobility. The simulation results validate the\neffectiveness of our approach, demonstrating its potential advantages for\nfuture wireless communication systems. The effectiveness of the proposed\napproach is validated by simulation results as it will be shown.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Networking and Internet Architecture","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"gcu5UMXDzVAwoGN8MHuoCkrl-yTHCFTiYMj1SlSfvvc","pdfSize":"1073710"}
