{"id":"2407.18915","title":"Learning-Based WiFi Fingerprint Inpainting via Generative Adversarial\n  Networks","authors":"Yu Chan, Pin-Yu Lin, Yu-Yun Tseng, Jen-Jee Chen, and Yu-Chee Tseng","authorsParsed":[["Chan","Yu",""],["Lin","Pin-Yu",""],["Tseng","Yu-Yun",""],["Chen","Jen-Jee",""],["Tseng","Yu-Chee",""]],"versions":[{"version":"v1","created":"Tue, 4 Jun 2024 01:51:39 GMT"}],"updateDate":"2024-07-30","timestamp":1717465899000,"abstract":"  WiFi-based indoor positioning has been extensively studied. A fundamental\nissue in such solutions is the collection of WiFi fingerprints. However, due to\nreal-world constraints, collecting complete fingerprints at all intended\nlocations is sometimes prohibited. This work considers the WiFi fingerprint\ninpainting problem. This problem differs from typical image/video inpainting\nproblems in several aspects. Unlike RGB images, WiFi field maps come in any\nshape, and signal data may follow certain distributions. Therefore, it is\ndifficult to forcefully fit them into a fixed-dimensional matrix, as done with\nprocessing images in RGB format. As soon as a map is changed, it also becomes\ndifficult to adapt it to the same model due to scale issues. Furthermore, such\nmodels are significantly constrained in situations requiring outward\ninpainting. Fortunately, the spatial relationships of WiFi signals and the rich\ninformation provided among channels offer ample opportunities for this\ngenerative model to accomplish inpainting. Therefore, we designed this model to\nnot only retain the characteristic of regression models in generating\nfingerprints of arbitrary shapes but also to accommodate the observational\noutcomes from densely deployed APs. This work makes two major contributions.\nFirstly, we delineate the distinctions between this problem and image\ninpainting, highlighting potential avenues for research. Secondly, we introduce\nnovel generative inpainting models aimed at capturing both inter-AP and\nintra-AP correlations while preserving latent information. Additionally, we\nincorporate a specially designed adversarial discriminator to enhance the\nquality of inpainting outcomes.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8SEavN1qhP7-NLdv9otGOf_4vIZuRs6JUPZiFZg26pk","pdfSize":"3101063"}
