{"id":"2407.10947","title":"Can Textual Semantics Mitigate Sounding Object Segmentation Preference?","authors":"Yaoting Wang, Peiwen Sun, Yuanchao Li, Honggang Zhang, Di Hu","authorsParsed":[["Wang","Yaoting",""],["Sun","Peiwen",""],["Li","Yuanchao",""],["Zhang","Honggang",""],["Hu","Di",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:45:20 GMT"}],"updateDate":"2024-07-16","timestamp":1721065520000,"abstract":"  The Audio-Visual Segmentation (AVS) task aims to segment sounding objects in\nthe visual space using audio cues. However, in this work, it is recognized that\nprevious AVS methods show a heavy reliance on detrimental segmentation\npreferences related to audible objects, rather than precise audio guidance. We\nargue that the primary reason is that audio lacks robust semantics compared to\nvision, especially in multi-source sounding scenes, resulting in weak audio\nguidance over the visual space. Motivated by the the fact that text modality is\nwell explored and contains rich abstract semantics, we propose leveraging text\ncues from the visual scene to enhance audio guidance with the semantics\ninherent in text. Our approach begins by obtaining scene descriptions through\nan off-the-shelf image captioner and prompting a frozen large language model to\ndeduce potential sounding objects as text cues. Subsequently, we introduce a\nnovel semantics-driven audio modeling module with a dynamic mask to integrate\naudio features with text cues, leading to representative sounding object\nfeatures. These features not only encompass audio cues but also possess vivid\nsemantics, providing clearer guidance in the visual space. Experimental results\non AVS benchmarks validate that our method exhibits enhanced sensitivity to\naudio when aided by text cues, achieving highly competitive performance on all\nthree subsets. Project page:\n\\href{https://github.com/GeWu-Lab/Sounding-Object-Segmentation-Preference}{https://github.com/GeWu-Lab/Sounding-Object-Segmentation-Preference}\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}