{"id":"2407.00003","title":"Cochlear Wave Propagation and Dynamics in the Human Base and Apex:\n  Model-Based Estimates from Noninvasive Measurements","authors":"Samiya A Alkhairy","authorsParsed":[["Alkhairy","Samiya A",""]],"versions":[{"version":"v1","created":"Wed, 10 Apr 2024 20:24:19 GMT"}],"updateDate":"2024-07-02","timestamp":1712780659000,"abstract":"  Cochlear wavenumber and impedance are mechanistic variables that encode\ninformation regarding how the cochlea works - specifically wave propagation and\nOrgan of Corti dynamics. These mechanistic variables underlie interesting\nfeatures of cochlear signal processing such as its place-based wavelet\nanalyzers, dispersivity and high-gain. Consequently, it is of interest to\nestimate these mechanistic variables in various species (particularly humans)\nand across various locations along the length of the cochlea. In this paper, we\ndevelop methods to estimate the mechanistic variables (wavenumber and\nimpedance) from noninvasive response characteristics (such as the quality\nfactors of psychophysical tuning curves) using an existing analytic shortwave\nsingle-partition model of the mammalian cochlea. We then apply these methods to\nestimate human mechanistic variables using reported values for quality factors\nfrom psychophysical tuning curves and a location-invariant ratio extrapolated\nfrom chinchilla. Our resultant estimates for human wavenumbers and impedances\nshow that the minimum wavelength (which occurs at the peak of the traveling\nwave) is smaller in base than the apex. The Organ of Corti is stiffness\ndominated rather than mass dominated, and there is negative effective damping\nprior to the peak followed by positive effective damping. The effective\nstiffness, and positive and negative effective damping are greater in the base\nthan the apex. The methods introduced here for estimating mechanistic variables\nfrom characteristics of invasive or noninvasive responses enable us to derive\nsuch estimates across various species and locations where the responses are\ndescribable by sharp filters. In addition to studying cochlear wave propagation\nand dynamics, the estimation methods developed here are also useful for\nauditory filter design.\n","subjects":["Quantitative Biology/Quantitative Methods","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing","Quantitative Biology/Tissues and Organs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}