{"id":"2407.11734","title":"Generating Multi-Modal and Multi-Attribute Single-Cell Counts with CFGen","authors":"Alessandro Palma, Till Richter, Hanyi Zhang, Manuel Lubetzki,\n  Alexander Tong, Andrea Dittadi, Fabian Theis","authorsParsed":[["Palma","Alessandro",""],["Richter","Till",""],["Zhang","Hanyi",""],["Lubetzki","Manuel",""],["Tong","Alexander",""],["Dittadi","Andrea",""],["Theis","Fabian",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:05:03 GMT"}],"updateDate":"2024-07-17","timestamp":1721138703000,"abstract":"  Generative modeling of single-cell RNA-seq data has shown invaluable\npotential in community-driven tasks such as trajectory inference, batch effect\nremoval and gene expression generation. However, most recent deep models\ngenerating synthetic single cells from noise operate on pre-processed\ncontinuous gene expression approximations, ignoring the inherently discrete and\nover-dispersed nature of single-cell data, which limits downstream applications\nand hinders the incorporation of robust noise models. Moreover, crucial aspects\nof deep-learning-based synthetic single-cell generation remain underexplored,\nsuch as controllable multi-modal and multi-label generation and its role in the\nperformance enhancement of downstream tasks. This work presents Cell Flow for\nGeneration (CFGen), a flow-based conditional generative model for multi-modal\nsingle-cell counts, which explicitly accounts for the discrete nature of the\ndata. Our results suggest improved recovery of crucial biological data\ncharacteristics while accounting for novel generative tasks such as\nconditioning on multiple attributes and boosting rare cell type classification\nvia data augmentation. By showcasing CFGen on a diverse set of biological\ndatasets and settings, we provide evidence of its value to the fields of\ncomputational biology and deep generative models.\n","subjects":["Quantitative Biology/Quantitative Methods","Computing Research Repository/Machine Learning","Quantitative Biology/Genomics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C891QkhtPUDKooLgJYI6sSjM57qZy8t6swQb6PNn7xU","pdfSize":"25340561"}
