{"id":"2407.02306","title":"Turbulent Diffuse Molecular Media with Non-ideal Magnetohydrodynamics\n  and Consistent Thermochemistry: Numerical Simulations and Dynamic\n  Characteristics","authors":"Nannan Yue, Lile Wang, Thomas Bisbas, Donghui Quan, Di Li","authorsParsed":[["Yue","Nannan",""],["Wang","Lile",""],["Bisbas","Thomas",""],["Quan","Donghui",""],["Li","Di",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 14:41:35 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 16:45:46 GMT"}],"updateDate":"2024-07-17","timestamp":1719931295000,"abstract":"  Turbulent diffuse molecular clouds can exhibit complicated morphologies\ncaused by the interactions among radiation, chemistry, fluids, and fields. We\nperformed full 3D simulations for turbulent diffuse molecular interstellar\nmedia, featuring time-dependent non-equilibrium thermochemistry co-evolved with\nmagnetohydrodynamics (MHD). Simulation results exhibit the relative abundances\nof key chemical species (e.g., C, CO, OH) vary by more than one order of\nmagnitude for the \"premature\" epoch of chemical evolution ($t\\lesssim 2\\times\n10^5~{\\rm yr}$). Various simulations are also conducted to study the impacts of\nphysical parameters. Non-ideal MHD effects are essential in shaping the\nbehavior of gases, and strong magnetic fields ($\\sim 10~\\mu{\\rm G}$) tend to\ninhibit vigorous compressions and thus reduce the fraction of warm gases\n($T\\gtrsim 10^2~{\\rm K}$). Thermodynamical and chemical conditions of the gas\nare sensitive to modulation by dynamic conditions, especially the energy\ninjection by turbulence. Chemical features, including ionization (cosmic ray\nand diffuse interstellar radiation), would not directly affect the turbulence\npower spectra. Nonetheless, their effects are prominent in the distribution\nprofiles of temperatures and gas densities. Comprehensive observations are\nnecessary and useful to eliminate the degeneracies of physical parameters and\nconstrain the properties of diffuse molecular clouds with confidence.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}