{"id":"2407.19916","title":"Aero-Nef: Neural Fields for Rapid Aircraft Aerodynamics Simulations","authors":"Giovanni Catalani, Siddhant Agarwal, Xavier Bertrand, Frederic Tost,\n  Michael Bauerheim, Joseph Morlier","authorsParsed":[["Catalani","Giovanni",""],["Agarwal","Siddhant",""],["Bertrand","Xavier",""],["Tost","Frederic",""],["Bauerheim","Michael",""],["Morlier","Joseph",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 11:48:44 GMT"}],"updateDate":"2024-07-30","timestamp":1722253724000,"abstract":"  This paper presents a methodology to learn surrogate models of steady state\nfluid dynamics simulations on meshed domains, based on Implicit Neural\nRepresentations (INRs). The proposed models can be applied directly to\nunstructured domains for different flow conditions, handle non-parametric 3D\ngeometric variations, and generalize to unseen shapes at test time. The\ncoordinate-based formulation naturally leads to robustness with respect to\ndiscretization, allowing an excellent trade-off between computational cost\n(memory footprint and training time) and accuracy. The method is demonstrated\non two industrially relevant applications: a RANS dataset of the\ntwo-dimensional compressible flow over a transonic airfoil and a dataset of the\nsurface pressure distribution over 3D wings, including shape, inflow condition,\nand control surface deflection variations. On the considered test cases, our\napproach achieves a more than three times lower test error and significantly\nimproves generalization error on unseen geometries compared to state-of-the-art\nGraph Neural Network architectures. Remarkably, the method can perform\ninference five order of magnitude faster than the high fidelity solver on the\nRANS transonic airfoil dataset. Code is available at\nhttps://gitlab.isae-supaero.fr/gi.catalani/aero-nepf\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EBux-KOQaXPmQRVFog4-yEAaL-Nkohl2J6V_DW-prrA","pdfSize":"32505656"}
