{"id":"2407.03385","title":"Towards CPU Performance Prediction: New Challenge Benchmark Dataset and\n  Novel Approach","authors":"Xiaoman Liu","authorsParsed":[["Liu","Xiaoman",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 03:19:36 GMT"},{"version":"v2","created":"Tue, 9 Jul 2024 16:28:22 GMT"}],"updateDate":"2024-07-10","timestamp":1719976776000,"abstract":"  CPU performance prediction, which involves forecasting the performance scores\nof a CPU based on its hardware characteristics during its operation, is a\ncritical technology for computational system design and resource management in\nthe big data era. However, this research field currently faces two significant\nchallenges. First, collecting real-world data is challenging due to the wide\nvariety of CPU products on the market and the highly specialized nature of\nrelevant hardware characteristics. In the research process, this field lacks a\nstandard dataset with unified hardware characteristics, wide data coverage, and\ncomprehensive benchmarks. Second, existing methods based on hardware simulation\nmodels or machine learning exhibit notable shortcomings, such as lengthy\nsimulation test cycles and low prediction accuracy. To bridge these gaps, we\nfirst collect, preprocess, and standardize historical data from the 4th\nGeneration Intel Xeon Scalable Processors across multiple benchmark suites to\ncreate a new dataset, named PerfCastDB. Subsequently, we design a deep learning\nbased model called Nova CPU Performance Predictor (NCPP) as the baseline for\nthis new dataset. The NCPP network is designed based on group attention\nmechanism. It effectively quantifies the implicit relationships between\nhardware characteristics within and across groups and comprehensively models\nthe impact of various hardware characteristics on CPU performance prediction.\nWe conduct comparative experiments using the proposed PerfCastDB dataset.\nCompared to existing approaches, NCPP achieves superior evaluation results,\ndemonstrating its effectiveness. Furthermore, we have open-sourced part of the\ndataset and the NCPP network code to facilitate subsequent research. The\nresources can be accessed at https://github.com/xiaoman-liu/NCPP.\n","subjects":["Computing Research Repository/Performance","Computing Research Repository/Hardware Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}