{"id":"2407.11864","title":"Navigating Munk's Abyssal Recipes: Reconciling the Paradoxes and\n  Suggesting an Upwelling Mechanism for Bottom Water in a Flat-Bottom Ocean","authors":"Lei Han","authorsParsed":[["Han","Lei",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:49:53 GMT"}],"updateDate":"2024-07-17","timestamp":1721144993000,"abstract":"  Walter Munk's classical work, known as the \"abyssal recipes\", introduced a\nfoundational framework for comprehending the upwelling of abyssal waters. While\nit has spurred numerous investigations into the complexities of deep-ocean\nprocesses from theoretical, laboratory, and field perspectives, it has also\nfaced challenges when compared to direct observations spanning decades. Two\nparticularly intriguing paradoxes emerge: the dichotomy of diffusivities and\nthe conundrum of interior downwelling. This study attempts to resolve these\nparadoxes by examining the isopycnal displacement velocity within the dynamic\nframework of Munk's abyssal recipes. A relieving inference is that it seems no\nlonger an imperative to seek a globally averaged diapycnal diffusivity of O(1)\ncm2/s to close the mass budget associated with the bottom-water formation rate.\nThrough box-model experiments, a novel erosion-intrusion model is proposed to\nelucidate the mechanism of abyssal upwelling in flat-bottom ocean, drawing an\nanalogy to the growth of \"tree rings\". Based upon this model, the average\nrising velocity in the abyssal North Pacific is estimated using observational\ndata of biogeochemical tracers. The proposed model does not seek to disprove\nexisting theories but rather acts as a complement for situations that\nprevailing theories may not apply, such as cases with flat-bottom topography or\nnon-bottom-intensified diffusivity.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Physics/Fluid Dynamics","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"a0wwI5QFuAyNAxpbwdTEHtU7XLRLlR4Upg22w5aAAcU","pdfSize":"4659471"}
