{"id":"2407.00024","title":"LMVD: A Large-Scale Multimodal Vlog Dataset for Depression Detection in\n  the Wild","authors":"Lang He, Kai Chen, Junnan Zhao, Yimeng Wang, Ercheng Pei, Haifeng\n  Chen, Jiewei Jiang, Shiqing Zhang, Jie Zhang, Zhongmin Wang, Tao He, Prayag\n  Tiwari","authorsParsed":[["He","Lang",""],["Chen","Kai",""],["Zhao","Junnan",""],["Wang","Yimeng",""],["Pei","Ercheng",""],["Chen","Haifeng",""],["Jiang","Jiewei",""],["Zhang","Shiqing",""],["Zhang","Jie",""],["Wang","Zhongmin",""],["He","Tao",""],["Tiwari","Prayag",""]],"versions":[{"version":"v1","created":"Thu, 9 May 2024 01:27:10 GMT"}],"updateDate":"2024-07-02","timestamp":1715218030000,"abstract":"  Depression can significantly impact many aspects of an individual's life,\nincluding their personal and social functioning, academic and work performance,\nand overall quality of life. Many researchers within the field of affective\ncomputing are adopting deep learning technology to explore potential patterns\nrelated to the detection of depression. However, because of subjects' privacy\nprotection concerns, that data in this area is still scarce, presenting a\nchallenge for the deep discriminative models used in detecting depression. To\nnavigate these obstacles, a large-scale multimodal vlog dataset (LMVD), for\ndepression recognition in the wild is built. In LMVD, which has 1823 samples\nwith 214 hours of the 1475 participants captured from four multimedia platforms\n(Sina Weibo, Bilibili, Tiktok, and YouTube). A novel architecture termed\nMDDformer to learn the non-verbal behaviors of individuals is proposed.\nExtensive validations are performed on the LMVD dataset, demonstrating superior\nperformance for depression detection. We anticipate that the LMVD will\ncontribute a valuable function to the depression detection community. The data\nand code will released at the link: https://github.com/helang818/LMVD/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"BID3qA1b4Pgj6HMkJTwLITsK5GzmPapSRyL5_aqBc90","pdfSize":"6692866"}
