{"id":"2407.20518","title":"High-Resolution Spatial Transcriptomics from Histology Images using\n  HisToSGE","authors":"Zhiceng Shi, Shuailin Xue, Fangfang Zhu and Wenwen Min","authorsParsed":[["Shi","Zhiceng",""],["Xue","Shuailin",""],["Zhu","Fangfang",""],["Min","Wenwen",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 03:29:57 GMT"}],"updateDate":"2024-07-31","timestamp":1722310197000,"abstract":"  Spatial transcriptomics (ST) is a groundbreaking genomic technology that\nenables spatial localization analysis of gene expression within tissue\nsections. However, it is significantly limited by high costs and sparse spatial\nresolution. An alternative, more cost-effective strategy is to use deep\nlearning methods to predict high-density gene expression profiles from\nhistological images. However, existing methods struggle to capture rich image\nfeatures effectively or rely on low-dimensional positional coordinates, making\nit difficult to accurately predict high-resolution gene expression profiles. To\naddress these limitations, we developed HisToSGE, a method that employs a\nPathology Image Large Model (PILM) to extract rich image features from\nhistological images and utilizes a feature learning module to robustly generate\nhigh-resolution gene expression profiles. We evaluated HisToSGE on four ST\ndatasets, comparing its performance with five state-of-the-art baseline\nmethods. The results demonstrate that HisToSGE excels in generating\nhigh-resolution gene expression profiles and performing downstream tasks such\nas spatial domain identification. All code and public datasets used in this\npaper are available at https://github.com/wenwenmin/HisToSGE and\nhttps://zenodo.org/records/12792163.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}