{"id":"2407.10794","title":"Graphusion: Leveraging Large Language Models for Scientific Knowledge\n  Graph Fusion and Construction in NLP Education","authors":"Rui Yang, Boming Yang, Sixun Ouyang, Tianwei She, Aosong Feng, Yuang\n  Jiang, Freddy Lecue, Jinghui Lu, Irene Li","authorsParsed":[["Yang","Rui",""],["Yang","Boming",""],["Ouyang","Sixun",""],["She","Tianwei",""],["Feng","Aosong",""],["Jiang","Yuang",""],["Lecue","Freddy",""],["Lu","Jinghui",""],["Li","Irene",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 15:13:49 GMT"}],"updateDate":"2024-07-16","timestamp":1721056429000,"abstract":"  Knowledge graphs (KGs) are crucial in the field of artificial intelligence\nand are widely applied in downstream tasks, such as enhancing Question\nAnswering (QA) systems. The construction of KGs typically requires significant\neffort from domain experts. Recently, Large Language Models (LLMs) have been\nused for knowledge graph construction (KGC), however, most existing approaches\nfocus on a local perspective, extracting knowledge triplets from individual\nsentences or documents. In this work, we introduce Graphusion, a zero-shot KGC\nframework from free text. The core fusion module provides a global view of\ntriplets, incorporating entity merging, conflict resolution, and novel triplet\ndiscovery. We showcase how Graphusion could be applied to the natural language\nprocessing (NLP) domain and validate it in the educational scenario.\nSpecifically, we introduce TutorQA, a new expert-verified benchmark for graph\nreasoning and QA, comprising six tasks and a total of 1,200 QA pairs. Our\nevaluation demonstrates that Graphusion surpasses supervised baselines by up to\n10% in accuracy on link prediction. Additionally, it achieves average scores of\n2.92 and 2.37 out of 3 in human evaluations for concept entity extraction and\nrelation recognition, respectively.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}