{"id":"2407.15360","title":"Dissecting Multiplication in Transformers: Insights into LLMs","authors":"Luyu Qiu, Jianing Li, Chi Su, Chen Jason Zhang, Lei Chen","authorsParsed":[["Qiu","Luyu",""],["Li","Jianing",""],["Su","Chi",""],["Zhang","Chen Jason",""],["Chen","Lei",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 04:07:26 GMT"}],"updateDate":"2024-07-23","timestamp":1721621246000,"abstract":"  Transformer-based large language models have achieved remarkable performance\nacross various natural language processing tasks. However, they often struggle\nwith seemingly easy tasks like arithmetic despite their vast capabilities. This\nstark disparity raise human's concerns about their safe and ethical use, hinder\ntheir widespread adoption.In this paper, we focus on a typical arithmetic task,\ninteger multiplication, to explore and explain the imperfection of transformers\nin this domain. We provide comprehensive analysis of a vanilla transformer\ntrained to perform n-digit integer multiplication. Our observations indicate\nthat the model decomposes multiplication task into multiple parallel subtasks,\nsequentially optimizing each subtask for each digit to complete the final\nmultiplication. Based on observation and analysis, we infer the reasons of\ntransformers deficiencies in multiplication tasks lies in their difficulty in\ncalculating successive carryovers and caching intermediate results, and\nconfirmed this inference through experiments. Guided by these findings, we\npropose improvements to enhance transformers performance on multiplication\ntasks. These enhancements are validated through rigorous testing and\nmathematical modeling, not only enhance transformer's interpretability, but\nalso improve its performance, e.g., we achieve over 99.9% accuracy on 5-digit\ninteger multiplication with a tiny transformer, outperform LLMs GPT-4. Our\nmethod contributes to the broader fields of model understanding and\ninterpretability, paving the way for analyzing more complex tasks and\nTransformer models. This work underscores the importance of explainable AI,\nhelping to build trust in large language models and promoting their adoption in\ncritical applications.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5laDNtfFBMC0nAH9u5bX8d-lGDph1aLZ2VzZDXY4W90","pdfSize":"580179"}
