{"id":"2407.11102","title":"Enhancing Electrocardiogram Signal Analysis Using NLP-Inspired\n  Techniques: A Novel Approach with Embedding and Self-Attention","authors":"Prapti Ganguly, Wazib Ansar, Amlan Chakrabarti","authorsParsed":[["Ganguly","Prapti",""],["Ansar","Wazib",""],["Chakrabarti","Amlan",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 12:20:15 GMT"}],"updateDate":"2024-07-17","timestamp":1721046015000,"abstract":"  A language is made up of an infinite/finite number of sentences, which in\nturn is composed of a number of words. The Electrocardiogram (ECG) is the most\npopular noninvasive medical tool for studying heart function and diagnosing\nvarious irregular cardiac rhythms. Intuitive inspection of the ECG reveals a\nmarked similarity between ECG signals and the spoken language. As a result, the\nECG signal may be thought of as a series of heartbeats (similar to sentences in\na spoken language), with each heartbeat consisting of a collection of waves\n(similar to words in a sentence) with varying morphologies. Just as natural\nlanguage processing (NLP) is used to help computers comprehend and interpret\nhuman natural language, it is conceivable to create NLP-inspired algorithms to\nhelp computers comprehend the electrocardiogram data more efficiently. In this\nstudy, we propose a novel ECG analysis technique, based on embedding and self\nattention, to capture the spatial as well as the temporal dependencies of the\nECG data. To generate the embedding, an encoder-decoder network was proposed to\ncapture the temporal dependencies of the ECG signal and perform data\ncompression. The compressed and encoded data was fed to the embedding layer as\nits weights. Finally, the proposed CNN-LSTM-Self Attention classifier works on\nthe embedding layer and classifies the signal as normal or anomalous. The\napproach was tested using the PTB-xl dataset, which is severely imbalanced. Our\nemphasis was to appropriately recognise the disease classes present in minority\nnumbers, in order to limit the detection of False Negative cases. An accuracy\nof 91% was achieved with a good F1-score for all the disease classes.\nAdditionally, the the size of the model was reduced by 34% due to compression,\nmaking it suitable for deployment in real time applications\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"c4MOVIlku2LGonvBO95R5TZkCPy3_Cg5pbjbJv_1xUU","pdfSize":"896156","objectId":"0x2c86b568cf559381f735163723182eecf04d7fb26a9d4948ec55a35c1e770ce6","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
