{"id":"2407.15423","title":"Integrating IP Broadcasting with Audio Tags: Workflow and Challenges","authors":"Rhys Burchett-Vass, Arshdeep Singh, Gabriel Bibb\\'o, Mark D. Plumbley","authorsParsed":[["Burchett-Vass","Rhys",""],["Singh","Arshdeep",""],["Bibbó","Gabriel",""],["Plumbley","Mark D.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 07:00:21 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 08:46:03 GMT"}],"updateDate":"2024-07-24","timestamp":1721631621000,"abstract":"  The broadcasting industry is increasingly adopting IP techniques,\nrevolutionising both live and pre-recorded content production, from news\ngathering to live music events. IP broadcasting allows for the transport of\naudio and video signals in an easily configurable way, aligning with modern\nnetworking techniques. This shift towards an IP workflow allows for much\ngreater flexibility, not only in routing signals but with the integration of\ntools using standard web development techniques. One possible tool could\ninclude the use of live audio tagging, which has a number of uses in the\nproduction of content. These include from automated closed captioning to\nidentifying unwanted sound events within a scene. In this paper, we describe\nthe process of containerising an audio tagging model into a microservice, a\nsmall segregated code module that can be integrated into a multitude of\ndifferent network setups. The goal is to develop a modular, accessible, and\nflexible tool capable of seamless deployment into broadcasting workflows of all\nsizes, from small productions to large corporations. Challenges surrounding\nlatency of the selected audio tagging model and its effect on the usefulness of\nthe end product are discussed.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multimedia","Computing Research Repository/Sound"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HY2VqgehRHDhbVJDnFEUW_sZnh9dTOavwp7mhFGs_JU","pdfSize":"377281"}
