{"id":"2407.08081","title":"RoCap: A Robotic Data Collection Pipeline for the Pose Estimation of\n  Appearance-Changing Objects","authors":"Jiahao Nick Li, Toby Chong, Zhongyi Zhou, Hironori Yoshida, Koji\n  Yatani, Xiang 'Anthony' Chen, Takeo Igarashi","authorsParsed":[["Li","Jiahao Nick",""],["Chong","Toby",""],["Zhou","Zhongyi",""],["Yoshida","Hironori",""],["Yatani","Koji",""],["Chen","Xiang 'Anthony'",""],["Igarashi","Takeo",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 22:52:12 GMT"}],"updateDate":"2024-07-12","timestamp":1720651932000,"abstract":"  Object pose estimation plays a vital role in mixed-reality interactions when\nusers manipulate tangible objects as controllers. Traditional vision-based\nobject pose estimation methods leverage 3D reconstruction to synthesize\ntraining data. However, these methods are designed for static objects with\ndiffuse colors and do not work well for objects that change their appearance\nduring manipulation, such as deformable objects like plush toys, transparent\nobjects like chemical flasks, reflective objects like metal pitchers, and\narticulated objects like scissors. To address this limitation, we propose\nRocap, a robotic pipeline that emulates human manipulation of target objects\nwhile generating data labeled with ground truth pose information. The user\nfirst gives the target object to a robotic arm, and the system captures many\npictures of the object in various 6D configurations. The system trains a model\nby using captured images and their ground truth pose information automatically\ncalculated from the joint angles of the robotic arm. We showcase pose\nestimation for appearance-changing objects by training simple deep-learning\nmodels using the collected data and comparing the results with a model trained\nwith synthetic data based on 3D reconstruction via quantitative and qualitative\nevaluation. The findings underscore the promising capabilities of Rocap.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ropuJqRUB150Wc5kxurTt7xzYKSuJsF0heWT28wFo08","pdfSize":"21962864"}
