{"id":"2407.05738","title":"Collaborative Secret and Covert Communications for Multi-User\n  Multi-Antenna Uplink UAV Systems: Design and Optimization","authors":"Jinpeng Xu, Lin Bai, Xin Xie, and Lin Zhou","authorsParsed":[["Xu","Jinpeng",""],["Bai","Lin",""],["Xie","Xin",""],["Zhou","Lin",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 08:45:52 GMT"}],"updateDate":"2024-07-09","timestamp":1720428352000,"abstract":"  Motivated by diverse secure requirements of multi-user in UAV systems, we\npropose a collaborative secret and covert transmission method for multi-antenna\nground users to unmanned aerial vehicle (UAV) communications. Specifically,\nbased on the power domain non-orthogonal multiple access (NOMA), two ground\nusers with distinct security requirements, named Bob and Carlo, superimpose\ntheir signals and transmit the combined signal to the UAV named Alice. An\nadversary Willie attempts to simultaneously eavesdrop Bob's confidential\nmessage and detect whether Carlo is transmitting or not. We derive close-form\nexpressions of the secrecy connection probability (SCP) and the covert\nconnection probability (CCP) to evaluate the link reliability for wiretap and\ncovert transmissions, respectively. Furthermore, we bound the secrecy outage\nprobability (SOP) from Bob to Alice and the detection error probability (DEP)\nof Willie to evaluate the link security for wiretap and covert transmissions,\nrespectively. To characterize the theoretical benchmark of the above model, we\nformulate a weighted multi-objective optimization problem to maximize the\naverage of secret and covert transmission rates subject to constraints SOP,\nDEP, the beamformers of Bob and Carlo, and UAV trajectory parameters. To solve\nthe optimization problem, we propose an iterative optimization algorithm using\nsuccessive convex approximation and block coordinate descent (SCA-BCD) methods.\nOur results reveal the influence of design parameters of the system on the\nwiretap and covert rates, analytically and numerically. In summary, our study\nfills the gaps in joint secret and covert transmission for multi-user\nmulti-antenna uplink UAV communications and provides insights to construct such\nsystems.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UwpSvf-s0p0-yGSbQOFMG-8n7Ct5dSXFS0WXPYn1Gqg","pdfSize":"723570"}
