{"id":"2407.07586","title":"Simplifying Source-Free Domain Adaptation for Object Detection:\n  Effective Self-Training Strategies and Performance Insights","authors":"Yan Hao, Florent Forest, Olga Fink","authorsParsed":[["Hao","Yan",""],["Forest","Florent",""],["Fink","Olga",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 12:18:38 GMT"}],"updateDate":"2024-07-11","timestamp":1720613918000,"abstract":"  This paper focuses on source-free domain adaptation for object detection in\ncomputer vision. This task is challenging and of great practical interest, due\nto the cost of obtaining annotated data sets for every new domain. Recent\nresearch has proposed various solutions for Source-Free Object Detection\n(SFOD), most being variations of teacher-student architectures with diverse\nfeature alignment, regularization and pseudo-label selection strategies. Our\nwork investigates simpler approaches and their performance compared to more\ncomplex SFOD methods in several adaptation scenarios. We highlight the\nimportance of batch normalization layers in the detector backbone, and show\nthat adapting only the batch statistics is a strong baseline for SFOD. We\npropose a simple extension of a Mean Teacher with strong-weak augmentation in\nthe source-free setting, Source-Free Unbiased Teacher (SF-UT), and show that it\nactually outperforms most of the previous SFOD methods. Additionally, we\nshowcase that an even simpler strategy consisting in training on a fixed set of\npseudo-labels can achieve similar performance to the more complex\nteacher-student mutual learning, while being computationally efficient and\nmitigating the major issue of teacher-student collapse. We conduct experiments\non several adaptation tasks using benchmark driving datasets including\n(Foggy)Cityscapes, Sim10k and KITTI, and achieve a notable improvement of 4.7\\%\nAP50 on Cityscapes$\\rightarrow$Foggy-Cityscapes compared with the latest\nstate-of-the-art in SFOD. Source code is available at\nhttps://github.com/EPFL-IMOS/simple-SFOD.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}