{"id":"2407.10451","title":"Role of Complexity on the Minimal Deformation of Black Holes","authors":"Z. Yousaf, Kazuharu Bamba, Bander Almutairi, S. Khan, and M. Z. Bhatti","authorsParsed":[["Yousaf","Z.",""],["Bamba","Kazuharu",""],["Almutairi","Bander",""],["Khan","S.",""],["Bhatti","M. Z.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 05:41:35 GMT"}],"updateDate":"2024-08-23","timestamp":1721022095000,"abstract":"  We investigate spherically symmetric classes of anisotropic solutions within\nthe realm of a schematic gravitational decoupling scheme, primarily decoupling\nthrough minimal geometric deformation, applied to non-rotating, ultra-compact,\nself-gravitational fluid distributions. In this respect, we employ the minimal\ncomplexity factor scheme to generate physically realistic models for\nanisotropic matter distributions, using a well-behaved model. The\nzero-complexity factor condition enables us to determine the deformation\nfunction for solving the decoupled system. We explore all the\nstructure-defining scalar variables, such as density inhomogeneity, strong\nenergy condition, density homogeneity, and the complexity factor (an alloy of\ndensity inhomogeneity and pressure anisotropy) for the decoupling constant\nranging between $0$ and $1$. We observe that the anisotropy vanishes when the\ncoupling constant is set to unity. This finding holds significance as it\nimplies that, in the context of a zero-complexity factor approach, an\nanisotropic matter distribution becomes perfect without requiring any isotropy\nrequirements. This work effectively explored the impact of complexity on the\ncomposition of self-gravitational stellar distributions. This effective\napproach enables the development of new, physically realistic isotropic stellar\nmodels for anisotropic matter distributions. Additionally, our findings\nindicate that the complexity factor in static, spherically symmetric\nself-gravitational objects can significantly affect the nature of the matter\ndistribution within these systems. It is concluded that the minimally deformed\nDurgapal-IV model features an increasing pressure profile, and the local\nanisotropy of pressure vanishes throughout the model under complexity-free\nconditions.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}