{"id":"2407.15522","title":"Big Data Analytics-Enabled Dynamic Capabilities and Market Performance:\n  Examining the Roles of Marketing Ambidexterity and Competitor Pressure","authors":"Gulfam Haider, Laiba Zubair, Aman Saleem","authorsParsed":[["Haider","Gulfam",""],["Zubair","Laiba",""],["Saleem","Aman",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 10:18:30 GMT"}],"updateDate":"2024-07-23","timestamp":1721643510000,"abstract":"  This study, rooted in dynamic capability theory and the developing era of Big\nData Analytics, explores the transformative effect of BDA EDCs on marketing.\nAmbidexterity and firms market performance in the textile sector of Pakistans\ncities. Specifically, focusing on the firms who directly deal with customers,\ninvestigates the nuanced role of BDA EDCs in textile retail firms potential to\nnavigate market dynamics. Emphasizing the exploitation component of marketing\nambidexterity, the study investigated the mediating function of marketing\nambidexterity and the moderating influence of competitive pressure. Using a\nsurvey questionnaire, the study targets key choice makers in textile firms of\nFaisalabad, Chiniot and Lahore, Pakistan. The PLS-SEM model was employed as an\nanalytical technique, allows for a full examination of the complicated\nrelations between BDA EDCs, marketing ambidexterity, rival pressure, and market\nperformance. The study Predicting a positive impact of Big Data on marketing\nambidexterity, with a specific emphasis on exploitation. The study expects this\nexploitation-orientated marketing ambidexterity to significantly enhance the\nfirms market performance. This research contributes to the existing literature\non dynamic capabilities-based frameworks from the perspective of the retail\nsegment of textile industry. The study emphasizes the role of BDA-EDCs in the\nretail sector, imparting insights into the direct and indirect results of BDA\nEDCs on market performance inside the retail area. The study s novelty lies in\nits contextualization of BDA-EDCs in the textile zone of Faisalabad, Lahore and\nChiniot, providing a unique perspective on the effect of BDA on marketing\nambidexterity and market performance in firms. Methodologically, the study uses\nnumerous samples of retail sectors to make sure broader universality,\ncontributing realistic insights.\n","subjects":["Economics/Econometrics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}