{"id":"2407.15294","title":"Systematic effects induced by half-wave plate differential optical load\n  and TES nonlinearity for LiteBIRD","authors":"Silvia Micheli, Tijmen de Haan, Tommaso Ghigna, Alessandro Novelli,\n  Francesco Piacentini, Giampaolo Pisano, Fabio Columbro, Alessandro\n  Coppolecchia, Giuseppe D'Alessandro, Paolo de Bernardis, Luca Lamagna,\n  Elisabetta Marchitelli, Silvia Masi, Andrea Occhiuzzi, Alessandro Paiella","authorsParsed":[["Micheli","Silvia",""],["de Haan","Tijmen",""],["Ghigna","Tommaso",""],["Novelli","Alessandro",""],["Piacentini","Francesco",""],["Pisano","Giampaolo",""],["Columbro","Fabio",""],["Coppolecchia","Alessandro",""],["D'Alessandro","Giuseppe",""],["de Bernardis","Paolo",""],["Lamagna","Luca",""],["Marchitelli","Elisabetta",""],["Masi","Silvia",""],["Occhiuzzi","Andrea",""],["Paiella","Alessandro",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 23:26:39 GMT"}],"updateDate":"2024-07-23","timestamp":1721604399000,"abstract":"  LiteBIRD, a forthcoming satellite mission, aims to measure the polarization\nof the Cosmic Microwave Background (CMB) across the entire sky. The experiment\nwill employ three telescopes, Transition-Edge Sensor (TES) bolometers and\nrotating Half-Wave Plates (HWPs) at cryogenic temperatures to ensure high\nsensitivity and systematic effects mitigation. This study is focused on the\nMid- and High-Frequency Telescopes (MHFT), which will use rotating metal mesh\nHWPs. We investigate how power variations due to HWP differential emissivity\nand transmittance combine with TES nonlinear responsivity, resulting in an\neffective instrumental polarization. We present the results of simulations for\nthe current HWP design, modeling the TES deviation from linearity as a\nsecond-order response. We quantify the level of acceptable residual\nnonlinearity assuming the mission requirement on the tensor-to-scalar ratio,\n$\\delta r < 0.001$. Moreover, we provide an accuracy requirement on the\nmeasurement of TES responsivity nonlinearity level for MHFT channels. Lastly,\nwe present possible mitigation methods that will be developed in future\nstudies.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}