{"id":"2407.20004","title":"Navigation services amplify concentration of traffic and emissions in\n  our cities","authors":"Giuliano Cornacchia, Mirco Nanni, Dino Pedreschi, Luca Pappalardo","authorsParsed":[["Cornacchia","Giuliano",""],["Nanni","Mirco",""],["Pedreschi","Dino",""],["Pappalardo","Luca",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:35:52 GMT"}],"updateDate":"2024-07-30","timestamp":1722260152000,"abstract":"  The proliferation of human-AI ecosystems involving human interaction with\nalgorithms, such as assistants and recommenders, raises concerns about\nlarge-scale social behaviour. Despite evidence of such phenomena across several\ncontexts, the collective impact of GPS navigation services remains unclear:\nwhile beneficial to the user, they can also cause chaos if too many vehicles\nare driven through the same few roads. Our study employs a simulation framework\nto assess navigation services' influence on road network usage and CO2\nemissions. The results demonstrate a universal pattern of amplified conformity:\nincreasing adoption rates of navigation services cause a reduction of route\ndiversity of mobile travellers and increased concentration of traffic and\nemissions on fewer roads, thus exacerbating an unequal distribution of negative\nexternalities on selected neighbourhoods. Although navigation services\nrecommendations can help reduce CO2 emissions when their adoption rate is low,\nthese benefits diminish or even disappear when the adoption rate is high and\nexceeds a certain city- and service-dependent threshold. We summarize these\ndiscoveries in a non-linear function that connects the marginal increase of\nconformity with the marginal reduction in CO2 emissions. Our simulation\napproach addresses the challenges posed by the complexity of transportation\nsystems and the lack of data and algorithmic transparency.\n","subjects":["Computing Research Repository/Multiagent Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}