{"id":"2407.09746","title":"Low-energy peak in the one-particle spectral function of the electron\n  gas at metallic densities","authors":"Yasutami Takada","authorsParsed":[["Takada","Yasutami",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 02:27:28 GMT"},{"version":"v2","created":"Sun, 11 Aug 2024 14:50:42 GMT"},{"version":"v3","created":"Wed, 14 Aug 2024 06:02:02 GMT"}],"updateDate":"2024-08-15","timestamp":1720837648000,"abstract":"  Based on a nonperturbative scheme to determine the self-energy \\Sigma(k,iw_n)\nwith automatically satisfying the Ward identity and the total momentum\nconservation law, a fully self-consistent calculation is done in the electron\ngas at various temperatures T to obtain G(k,iw_n) the one-particle Green's\nfunction with fulfilling all known conservation laws, sum rules, and correct\nasymptotic behaviors; here, T is taken unprecedentedly low, namely, T/E_F down\nto 10^{-4} with E_F the Fermi energy, and tiny mesh as small as 10^{-4}k_F is\nchosen near the Fermi surface in k space with k_F the Fermi momentum. By\nanalytically continuing G(k,iw_n) to the retarded function G^R(k,w), we find a\nnovel low-energy peak, in addition to the quasiparticle (QP) peak and one- and\ntwo-plasmon high-energy satellites, in the spectral function A(k,w)[= -Im\nG^R(k,w)/\\pi] for T less than about 10^{-3}E_F in the simple-metal density\nregion (2<r_s<6 with r_s the dimensionless density parameter). This new peak is\nattributed to the effect of excitonic attraction on \\Sigma(k,iw_n) arising from\nmultiple excitations of tightly bound electron-hole pairs in the polarization\nfunction \\Pi(q,iw_q) for |q| equal to about 2k_F and |w_q| << E_F and thus it\nis dubbed ``excitron''. Although this excitron peak height is only about a\none-hundredth of that of QP, its excitation energy is about a half of that of\nQP for |k| equal to about k_F, seemingly in contradiction to the Landau's\nhypothesis as to the one-to-one correspondence of low-energy excitations\nbetween a free Fermi gas and an interacting normal Fermi liquid. As for the QP\nproperties, our results of both the effective mass m^* and the renormalization\nfactor z^* are in good agreement with those provided by recent quantum Monte\nCarlo simulations and available experiments.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}