{"id":"2407.13276","title":"Patient-specific coronary angioplasty simulations -- a mixed-dimensional\n  finite element modeling approach","authors":"Janina C. Datz, Ivo Steinbrecher, Christoph Meier, Nora Hagmeyer,\n  Leif-Christopher Engel, Alexander Popp, Martin R. Pfaller, Heribert\n  Schunkert, Wolfgang A. Wall","authorsParsed":[["Datz","Janina C.",""],["Steinbrecher","Ivo",""],["Meier","Christoph",""],["Hagmeyer","Nora",""],["Engel","Leif-Christopher",""],["Popp","Alexander",""],["Pfaller","Martin R.",""],["Schunkert","Heribert",""],["Wall","Wolfgang A.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:31:00 GMT"}],"updateDate":"2024-07-19","timestamp":1721291460000,"abstract":"  Coronary angioplasty with stent implantation is the most frequently used\ninterventional treatment for coronary artery disease. However, reocclusion\nwithin the stent, referred to as in-stent restenosis, occurs in up to 10% of\nlesions. It is widely accepted that mechanical loads on the vessel wall\nstrongly affect adaptive and maladaptive mechanisms. Yet, the role of\nprocedural and lesion-specific influence on restenosis risk remains\nunderstudied. Computational modeling of the stenting procedure can provide new\nmechanistic insights, such as local stresses, that play a significant role in\ntissue growth and remodeling. Previous simulation studies often featured\nsimplified artery and stent geometries and cannot be applied to real-world\nexamples. Realistic simulations were computationally expensive since they\nfeatured fully resolved stenting device models. The aim of this work is to\ndevelop and present a mixed-dimensional formulation to simulate the\npatient-specific stenting procedure with a reduced-dimensional beam model for\nthe stent and 3D models for the artery. In addition to presenting the numerical\napproach, we apply it to realistic cases to study the intervention's mechanical\neffect on the artery and correlate the findings with potential high-risk\nlocations for in-stent restenosis. We found that high artery wall stresses\ndevelop during the coronary intervention in severely stenosed areas and at the\nstent boundaries. Herewith, we lay the groundwork for further studies towards\npreventing in-stent restenosis after coronary angioplasty.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}