{"id":"2407.16572","title":"Rank-reduced equation-of-motion coupled cluster triples: an accurate and\n  affordable way of calculating electronic excitation energies","authors":"Piotr Michalak and Micha{\\l} Lesiuk","authorsParsed":[["Michalak","Piotr",""],["Lesiuk","Michał",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 15:26:58 GMT"}],"updateDate":"2024-07-24","timestamp":1721748418000,"abstract":"  In the present work we report an implementation of the rank-reduced\nequation-of-motion coupled cluster method with approximate triple excitations\n(RR-EOM-CC3). The proposed variant relies on tensor decomposition techniques in\norder to alleviate the high cost of computing and manipulating the\ntriply-excited amplitudes. In the RR-EOM-CC3 method, both ground-state and\nexcited-state triple-excitation amplitudes are compressed according to the\nTucker-3 format. This enables to factorize the working equations such that the\nformal scaling of the method is reduced to $N^6$, where $N$ is the system size.\nAn additional advantage of our method is the fact the accuracy can be strictly\ncontrolled by proper choice of two parameters defining sizes of\ntriple-excitation subspaces in the Tucker decomposition for the ground and\nexcited states. Optimal strategies of selecting these parameters are discussed.\nThe developed method has been tested in a series of calculations of electronic\nexcitation energies and compared to its canonical EOM-CC3 counterpart. Errors\nseveral times smaller than the inherent error of the canonical EOM-CC3 method\n(in comparison to FCI) are straightforward to achieve. This conclusion holds\nboth for valence states dominated by single excitations and for states with\npronounced doubly-excited character. Taking advantage of the decreased scaling,\nwe demonstrate substantial computational costs reductions (in comparison with\nthe canonical EOM-CC3) in the case of two large molecules -- L-proline and\nheptazine. This illustrates the usefulness of the RR-EOM-CC3 method for\naccurate determination of excitation energies of large molecules.\n","subjects":["Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}