{"id":"2407.16205","title":"Figure it Out: Analyzing-based Jailbreak Attack on Large Language Models","authors":"Shi Lin, Rongchang Li, Xun Wang, Changting Lin, Wenpeng Xing, Meng Han","authorsParsed":[["Lin","Shi",""],["Li","Rongchang",""],["Wang","Xun",""],["Lin","Changting",""],["Xing","Wenpeng",""],["Han","Meng",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 06:14:41 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 14:37:05 GMT"},{"version":"v3","created":"Tue, 13 Aug 2024 13:46:18 GMT"}],"updateDate":"2024-08-14","timestamp":1721715281000,"abstract":"  The rapid development of Large Language Models (LLMs) has brought remarkable\ngenerative capabilities across diverse tasks. However, despite the impressive\nachievements, these LLMs still have numerous inherent vulnerabilities,\nparticularly when faced with jailbreak attacks. By investigating jailbreak\nattacks, we can uncover hidden weaknesses in LLMs and inform the development of\nmore robust defense mechanisms to fortify their security. In this paper, we\nfurther explore the boundary of jailbreak attacks on LLMs and propose\nAnalyzing-based Jailbreak (ABJ). This effective jailbreak attack method takes\nadvantage of LLMs' growing analyzing and reasoning capability and reveals their\nunderlying vulnerabilities when facing analyzing-based tasks. We conduct a\ndetailed evaluation of ABJ across various open-source and closed-source LLMs,\nwhich achieves 94.8% attack success rate (ASR) and 1.06 attack efficiency (AE)\non GPT-4-turbo-0409, demonstrating state-of-the-art attack effectiveness and\nefficiency. Our research highlights the importance of prioritizing and\nenhancing the safety of LLMs to mitigate the risks of misuse. The code is\npublicly available at hhttps://github.com/theshi-1128/ABJ-Attack. Warning: This\npaper contains examples of LLMs that might be offensive or harmful.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}