{"id":"2407.14114","title":"A3Rank: Augmentation Alignment Analysis for Prioritizing Overconfident\n  Failing Samples for Deep Learning Models","authors":"Zhengyuan Wei, Haipeng Wang, Qilin Zhou, W.K. Chan","authorsParsed":[["Wei","Zhengyuan",""],["Wang","Haipeng",""],["Zhou","Qilin",""],["Chan","W. K.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 08:32:10 GMT"}],"updateDate":"2024-07-22","timestamp":1721377930000,"abstract":"  Sharpening deep learning models by training them with examples close to the\ndecision boundary is a well-known best practice. Nonetheless, these models are\nstill error-prone in producing predictions. In practice, the inference of the\ndeep learning models in many application systems is guarded by a rejector, such\nas a confidence-based rejector, to filter out samples with insufficient\nprediction confidence. Such confidence-based rejectors cannot effectively guard\nagainst failing samples with high confidence. Existing test case prioritization\ntechniques effectively distinguish confusing samples from confident samples to\nidentify failing samples among the confusing ones, yet prioritizing the failing\nones high among many confident ones is challenging. In this paper, we propose\n$A^3$Rank, a novel test case prioritization technique with augmentation\nalignment analysis, to address this problem. $A^3$Rank generates augmented\nversions of each test case and assesses the extent of the prediction result for\nthe test case misaligned with these of the augmented versions and vice versa.\nOur experiment shows that $A^3$Rank can effectively rank failing samples\nescaping from the checking of confidence-based rejectors, which significantly\noutperforms the peer techniques by 163.63\\% in the detection ratio of\ntop-ranked samples. We also provide a framework to construct a detector devoted\nto augmenting these rejectors to defend these failing samples, and our detector\ncan achieve a significantly higher defense success rate.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}