{"id":"2407.02918","title":"Free-SurGS: SfM-Free 3D Gaussian Splatting for Surgical Scene\n  Reconstruction","authors":"Jiaxin Guo, Jiangliu Wang, Di Kang, Wenzhen Dong, Wenting Wang,\n  Yun-hui Liu","authorsParsed":[["Guo","Jiaxin",""],["Wang","Jiangliu",""],["Kang","Di",""],["Dong","Wenzhen",""],["Wang","Wenting",""],["Liu","Yun-hui",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 08:49:35 GMT"}],"updateDate":"2024-07-04","timestamp":1719996575000,"abstract":"  Real-time 3D reconstruction of surgical scenes plays a vital role in\ncomputer-assisted surgery, holding a promise to enhance surgeons' visibility.\nRecent advancements in 3D Gaussian Splatting (3DGS) have shown great potential\nfor real-time novel view synthesis of general scenes, which relies on accurate\nposes and point clouds generated by Structure-from-Motion (SfM) for\ninitialization. However, 3DGS with SfM fails to recover accurate camera poses\nand geometry in surgical scenes due to the challenges of minimal textures and\nphotometric inconsistencies. To tackle this problem, in this paper, we propose\nthe first SfM-free 3DGS-based method for surgical scene reconstruction by\njointly optimizing the camera poses and scene representation. Based on the\nvideo continuity, the key of our method is to exploit the immediate optical\nflow priors to guide the projection flow derived from 3D Gaussians. Unlike most\nprevious methods relying on photometric loss only, we formulate the pose\nestimation problem as minimizing the flow loss between the projection flow and\noptical flow. A consistency check is further introduced to filter the flow\noutliers by detecting the rigid and reliable points that satisfy the epipolar\ngeometry. During 3D Gaussian optimization, we randomly sample frames to\noptimize the scene representations to grow the 3D Gaussian progressively.\nExperiments on the SCARED dataset demonstrate our superior performance over\nexisting methods in novel view synthesis and pose estimation with high\nefficiency. Code is available at https://github.com/wrld/Free-SurGS.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}