{"id":"2407.12999","title":"Securing the Future of GenAI: Policy and Technology","authors":"Mihai Christodorescu, Ryan Craven, Soheil Feizi, Neil Gong, Mia\n  Hoffmann, Somesh Jha, Zhengyuan Jiang, Mehrdad Saberi Kamarposhti, John\n  Mitchell, Jessica Newman, Emelia Probasco, Yanjun Qi, Khawaja Shams, Matthew\n  Turek","authorsParsed":[["Christodorescu","Mihai",""],["Craven","Ryan",""],["Feizi","Soheil",""],["Gong","Neil",""],["Hoffmann","Mia",""],["Jha","Somesh",""],["Jiang","Zhengyuan",""],["Kamarposhti","Mehrdad Saberi",""],["Mitchell","John",""],["Newman","Jessica",""],["Probasco","Emelia",""],["Qi","Yanjun",""],["Shams","Khawaja",""],["Turek","Matthew",""]],"versions":[{"version":"v1","created":"Tue, 21 May 2024 20:30:01 GMT"}],"updateDate":"2024-07-19","timestamp":1716323401000,"abstract":"  The rise of Generative AI (GenAI) brings about transformative potential\nacross sectors, but its dual-use nature also amplifies risks. Governments\nglobally are grappling with the challenge of regulating GenAI, balancing\ninnovation against safety. China, the United States (US), and the European\nUnion (EU) are at the forefront with initiatives like the Management of\nAlgorithmic Recommendations, the Executive Order, and the AI Act, respectively.\nHowever, the rapid evolution of GenAI capabilities often outpaces the\ndevelopment of comprehensive safety measures, creating a gap between regulatory\nneeds and technical advancements.\n  A workshop co-organized by Google, University of Wisconsin, Madison\n(UW-Madison), and Stanford University aimed to bridge this gap between GenAI\npolicy and technology. The diverse stakeholders of the GenAI space -- from the\npublic and governments to academia and industry -- make any safety measures\nunder consideration more complex, as both technical feasibility and regulatory\nguidance must be realized. This paper summarizes the discussions during the\nworkshop which addressed questions, such as: How regulation can be designed\nwithout hindering technological progress? How technology can evolve to meet\nregulatory standards? The interplay between legislation and technology is a\nvery vast topic, and we don't claim that this paper is a comprehensive\ntreatment on this topic. This paper is meant to capture findings based on the\nworkshop, and hopefully, can guide discussion on this topic.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}