{"id":"2407.17030","title":"Applications of Multi-Agent Deep Reinforcement Learning Communication in\n  Network Management: A Survey","authors":"Yue Pi, Wang Zhang, Yong Zhang, Hairong Huang, Baoquan Rao, Yulong\n  Ding and Shuanghua Yang","authorsParsed":[["Pi","Yue",""],["Zhang","Wang",""],["Zhang","Yong",""],["Huang","Hairong",""],["Rao","Baoquan",""],["Ding","Yulong",""],["Yang","Shuanghua",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 06:19:30 GMT"}],"updateDate":"2024-07-25","timestamp":1721801970000,"abstract":"  With the advancement of artificial intelligence technology, the automation of\nnetwork management, also known as Autonomous Driving Networks (ADN), is gaining\nwidespread attention. The network management has shifted from traditional\nhomogeneity and centralization to heterogeneity and decentralization.\nMulti-agent deep reinforcement learning (MADRL) allows agents to make decisions\nbased on local observations independently. This approach is in line with the\nneeds of automation and has garnered significant attention from academia and\nindustry. In a distributed environment, information interaction between agents\ncan effectively address the non-stationarity problem of multiple agents and\npromote cooperation. Therefore, in this survey, we first examined the\napplication of MADRL in network management, including specific application\nfields such as traffic engineering, wireless network access, power control, and\nnetwork security. Then, we conducted a detailed analysis of communication\nbehavior between agents, including communication schemes, communication content\nconstruction, communication object selection, message processing, and\ncommunication constraints. Finally, we discussed the open issues and future\nresearch directions of agent communication in MADRL for future network\nmanagement and ADN applications.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}