{"id":"2407.08538","title":"Phenomenological model of gravitational self-force enhanced tides in\n  inspiralling binary neutron stars","authors":"Natalie Williams, Patricia Schmidt, Geraint Pratten","authorsParsed":[["Williams","Natalie",""],["Schmidt","Patricia",""],["Pratten","Geraint",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:26:33 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 09:00:37 GMT"}],"updateDate":"2024-09-04","timestamp":1720707993000,"abstract":"  Gravitational waves from inspiralling binary neutron stars provide unique\naccess to ultra-dense nuclear matter and offer the ability to constrain the\ncurrently unknown neutron star equation-of-state through tidal measurements.\nThis, however, requires the availability of accurate and efficient tidal\nwaveform models. In this paper we present PhenomGSF, a new phenomenological\ntidal phase model for the inspiral of neutron stars in the frequency-domain,\nwhich captures the gravitational self-force informed tidal contributions of the\ntime-domain effective-one-body model TEOBResumS. PhenomGSF is highly faithful\nand computationally efficient, and by choosing a modular approach, it can be\nused in conjunction with any frequency-domain binary black hole waveform model\nto generate the complete phase for a binary neutron star inspiral. PhenomGSF is\nvalid for neutron star binaries with unequal masses and mass ratios between 1\nand 3, and dimensionless tidal deformabilities up to 5000. Furthermore,\nPhenomGSF does not assume universal relations or parameterised\nequations-of-state, hence allowing for exotic matter analyses and beyond\nstandard model physics investigations. We demonstrate the efficacy and accuracy\nof our model through comparisons against TEOBResumS, numerical relativity\nwaveforms and full Bayesian inference, including a reanalysis of the binary\nneutron star observation GW170817.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}