{"id":"2407.11540","title":"Not Another Imputation Method: A Transformer-based Model for Missing\n  Values in Tabular Datasets","authors":"Camillo Maria Caruso, Paolo Soda and Valerio Guarrasi","authorsParsed":[["Caruso","Camillo Maria",""],["Soda","Paolo",""],["Guarrasi","Valerio",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 09:43:47 GMT"}],"updateDate":"2024-07-17","timestamp":1721123027000,"abstract":"  Handling missing values in tabular datasets presents a significant challenge\nin training and testing artificial intelligence models, an issue usually\naddressed using imputation techniques. Here we introduce \"Not Another\nImputation Method\" (NAIM), a novel transformer-based model specifically\ndesigned to address this issue without the need for traditional imputation\ntechniques. NAIM employs feature-specific embeddings and a masked\nself-attention mechanism that effectively learns from available data, thus\navoiding the necessity to impute missing values. Additionally, a novel\nregularization technique is introduced to enhance the model's generalization\ncapability from incomplete data. We extensively evaluated NAIM on 5 publicly\navailable tabular datasets, demonstrating its superior performance over 6\nstate-of-the-art machine learning models and 4 deep learning models, each\npaired with 3 different imputation techniques when necessary. The results\nhighlight the efficacy of NAIM in improving predictive performance and\nresilience in the presence of missing data. To facilitate further research and\npractical application in handling missing data without traditional imputation\nmethods, we made the code for NAIM available at\nhttps://github.com/cosbidev/NAIM.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"UTVIuKTfsvyzV8dG8Ij2qPcWy_y_VC4tYiUQD6km7Nk","pdfSize":"3409781","objectId":"0xb06991e2692e7412370880aa5fb52049f8c6cea0cf81213f66b0fe573841a892","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
