{"id":"2407.04269","title":"Glass formation in mechanically interlocked ring polymers: the role of\n  induced chain stiffness","authors":"Jian Li, Bokai Zhang, Yushan Li","authorsParsed":[["Li","Jian",""],["Zhang","Bokai",""],["Li","Yushan",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 05:50:27 GMT"}],"updateDate":"2024-07-08","timestamp":1720158627000,"abstract":"  Polymer-related materials exhibit rich glassy behaviors at different length\nscales due to their various molecular structures and topological constraints.\nRecent studies have identified transient interpenetration of the long-chain\nrings contributing to dynamic arrest on the center-of-mass level.\nInterpenetration of rings is proposed as an approach to facilitate glass\nformation in polymer melts. In this work, inspired by recent advances in the\nsynthesis of mechanically interlocked polymers, we investigate glass transition\non the nanometer-scale segments influenced by permanent interpenetration of\nrings using molecular dynamics simulations. We find that decreasing chain\nlength in the mechanically interlocked system is equivalent to inducing an\neffective chain stiffness on the sub-rings. The induced stiffness provides a\nunified explanation for these unique structural features and transient dynamic\narrest in the system of interlocked rings with rather short chains. Further, a\ncrossover is observed in the scaling relation between localization and glassy\ndepth upon cooling. Our work reveals a dynamic transition from weak to strong\ncaging at the crossover temperature. According to the localization model, we\ndemonstrate that the chain stiffness increases the critical temperature and\noscillation distance, therefore leads to more fragile dynamics and deeper\nglassy state. These findings are consistent with the predictions of molecular\nsimulations and theories for polymers with real local stiffness. Our work\ndeepens the understanding of the role of induced stiffness on glass transition,\nand opens up a new direction to design rich glass materials by manipulating\nstiffness through mechanical bonds.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}