{"id":"2407.09268","title":"Region Attention Transformer for Medical Image Restoration","authors":"Zhiwen Yang and Haowei Chen and Ziniu Qian and Yang Zhou and Hui Zhang\n  and Dan Zhao and Bingzheng Wei and Yan Xu","authorsParsed":[["Yang","Zhiwen",""],["Chen","Haowei",""],["Qian","Ziniu",""],["Zhou","Yang",""],["Zhang","Hui",""],["Zhao","Dan",""],["Wei","Bingzheng",""],["Xu","Yan",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 13:52:05 GMT"}],"updateDate":"2024-07-15","timestamp":1720792325000,"abstract":"  Transformer-based methods have demonstrated impressive results in medical\nimage restoration, attributed to the multi-head self-attention (MSA) mechanism\nin the spatial dimension. However, the majority of existing Transformers\nconduct attention within fixed and coarsely partitioned regions (\\text{e.g.}\nthe entire image or fixed patches), resulting in interference from irrelevant\nregions and fragmentation of continuous image content. To overcome these\nchallenges, we introduce a novel Region Attention Transformer (RAT) that\nutilizes a region-based multi-head self-attention mechanism (R-MSA). The R-MSA\ndynamically partitions the input image into non-overlapping semantic regions\nusing the robust Segment Anything Model (SAM) and then performs self-attention\nwithin these regions. This region partitioning is more flexible and\ninterpretable, ensuring that only pixels from similar semantic regions\ncomplement each other, thereby eliminating interference from irrelevant\nregions. Moreover, we introduce a focal region loss to guide our model to\nadaptively focus on recovering high-difficulty regions. Extensive experiments\ndemonstrate the effectiveness of RAT in various medical image restoration\ntasks, including PET image synthesis, CT image denoising, and pathological\nimage super-resolution. Code is available at\n\\href{https://github.com/Yaziwel/Region-Attention-Transformer-for-Medical-Image-Restoration.git}{https://github.com/RAT}.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}