{"id":"2407.10749","title":"SEED: A Simple and Effective 3D DETR in Point Clouds","authors":"Zhe Liu, Jinghua Hou, Xiaoqing Ye, Tong Wang, Jingdong Wang, Xiang Bai","authorsParsed":[["Liu","Zhe",""],["Hou","Jinghua",""],["Ye","Xiaoqing",""],["Wang","Tong",""],["Wang","Jingdong",""],["Bai","Xiang",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 14:21:07 GMT"}],"updateDate":"2024-07-16","timestamp":1721053267000,"abstract":"  Recently, detection transformers (DETRs) have gradually taken a dominant\nposition in 2D detection thanks to their elegant framework. However, DETR-based\ndetectors for 3D point clouds are still difficult to achieve satisfactory\nperformance. We argue that the main challenges are twofold: 1) How to obtain\nthe appropriate object queries is challenging due to the high sparsity and\nuneven distribution of point clouds; 2) How to implement an effective query\ninteraction by exploiting the rich geometric structure of point clouds is not\nfully explored. To this end, we propose a simple and effective 3D DETR method\n(SEED) for detecting 3D objects from point clouds, which involves a dual query\nselection (DQS) module and a deformable grid attention (DGA) module. More\nconcretely, to obtain appropriate queries, DQS first ensures a high recall to\nretain a large number of queries by the predicted confidence scores and then\nfurther picks out high-quality queries according to the estimated quality\nscores. DGA uniformly divides each reference box into grids as the reference\npoints and then utilizes the predicted offsets to achieve a flexible receptive\nfield, allowing the network to focus on relevant regions and capture more\ninformative features. Extensive ablation studies on DQS and DGA demonstrate its\neffectiveness. Furthermore, our SEED achieves state-of-the-art detection\nperformance on both the large-scale Waymo and nuScenes datasets, illustrating\nthe superiority of our proposed method. The code is available at\nhttps://github.com/happinesslz/SEED\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}