{"id":"2407.08821","title":"Drying of soft colloidal films","authors":"Keumkyung Kuk, Julian Ringling, Kevin Gr\\\"aff, Sebastian H\\\"ansch,\n  Virginia Carrasco-Fadanelli, Andrey A. Rudov, Igor I. Potemkin, Regine von\n  Klitzing, Ivo Buttinoni, and Matthias Karg","authorsParsed":[["Kuk","Keumkyung",""],["Ringling","Julian",""],["Gräff","Kevin",""],["Hänsch","Sebastian",""],["Carrasco-Fadanelli","Virginia",""],["Rudov","Andrey A.",""],["Potemkin","Igor I.",""],["von Klitzing","Regine",""],["Buttinoni","Ivo",""],["Karg","Matthias",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 19:09:21 GMT"}],"updateDate":"2024-07-15","timestamp":1720724961000,"abstract":"  Thin films made of deformable micro- and nano-units, such as biological\nmembranes, polymer interfaces, and particle-laden liquid surfaces, exhibit a\ncomplex behavior during drying, with consequences for various applications like\nwound healing, coating technologies, and additive manufacturing. Studying the\ndrying dynamics and structural changes of soft colloidal films thus holds the\npotential to yield valuable insights to achieve improvements for applications.\nIn this study, we employ interfacial monolayers of core-shell microgels with\nvarying degrees of softness as model systems and investigate their drying\nbehavior on differently modified solid substrates (hydrophobic vs.\nhydrophilic). By leveraging on video microscopy, particle tracking, and thin\nfilm interference, we shed light on the interplay between microgel adhesion to\nsolid surfaces and the immersion capillary forces that arise in the thin liquid\nfilm. We discovered that a dried replica of the interfacial microstructure can\nbe more accurately achieved on a hydrophobic substrate relative to a\nhydrophilic one, particularly when employing softer colloids as opposed to\nharder counterparts. These observations are qualitatively supported by\nexperiments with a thin film pressure balance which allows mimicking and\ncontrolling the drying process and by computer simulations with coarse-grained\nmodels.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}