{"id":"2407.02430","title":"Meta 3D TextureGen: Fast and Consistent Texture Generation for 3D\n  Objects","authors":"Raphael Bensadoun, Yanir Kleiman, Idan Azuri, Omri Harosh, Andrea\n  Vedaldi, Natalia Neverova, Oran Gafni","authorsParsed":[["Bensadoun","Raphael",""],["Kleiman","Yanir",""],["Azuri","Idan",""],["Harosh","Omri",""],["Vedaldi","Andrea",""],["Neverova","Natalia",""],["Gafni","Oran",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 17:04:34 GMT"}],"updateDate":"2024-07-03","timestamp":1719939874000,"abstract":"  The recent availability and adaptability of text-to-image models has sparked\na new era in many related domains that benefit from the learned text priors as\nwell as high-quality and fast generation capabilities, one of which is texture\ngeneration for 3D objects. Although recent texture generation methods achieve\nimpressive results by using text-to-image networks, the combination of global\nconsistency, quality, and speed, which is crucial for advancing texture\ngeneration to real-world applications, remains elusive. To that end, we\nintroduce Meta 3D TextureGen: a new feedforward method comprised of two\nsequential networks aimed at generating high-quality and globally consistent\ntextures for arbitrary geometries of any complexity degree in less than 20\nseconds. Our method achieves state-of-the-art results in quality and speed by\nconditioning a text-to-image model on 3D semantics in 2D space and fusing them\ninto a complete and high-resolution UV texture map, as demonstrated by\nextensive qualitative and quantitative evaluations. In addition, we introduce a\ntexture enhancement network that is capable of up-scaling any texture by an\narbitrary ratio, producing 4k pixel resolution textures.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Graphics","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}