{"id":"2407.07447","title":"Spin Splitting in Altermagnetic RuO$_2$ Enables Field-free Spin-Orbit\n  Torque Switching via Dominant Out-of-Plane Spin Polarization","authors":"Zhuoyi Li, Zhe Zhang, Xianyang Lu, Yongbing Xu","authorsParsed":[["Li","Zhuoyi",""],["Zhang","Zhe",""],["Lu","Xianyang",""],["Xu","Yongbing",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 08:00:45 GMT"}],"updateDate":"2024-07-11","timestamp":1720598445000,"abstract":"  Researchers have recently identified a novel class of magnetism, termed\n\"altermagnetism\", which exhibits characteristics of both ferromagnetism and\nantiferromagnetism. Here, we report a groundbreaking discovery of efficient\nfield-free spin-orbit torque (SOT) switching in a RuO$_2$ (101)/Co/Pt/Co/Pt/Ta\nstructure. Our results demonstrate that the spin current flows along the [100]\naxis, induced by the in-plane charge current, with the spin polarization\ndirection aligned parallel to the N\\'eel vector. These z-polarized spins\ngenerate an out-of-plane anti-damping torque, enabling deterministic switching\nof the Co/Pt layer without the necessity of an external magnetic field. The\naltermagnetic spin splitting effect (ASSE) in RuO$_2$ promotes the generation\nof spin currents with pronounced anisotropic behavior, maximized when the\ncharge current flows along the [010] direction. This unique capability yields\nthe highest field-free switching ratio, maintaining stable SOT switching within\nan external field range of approximately 400 Oe. Notably, ASSE dominates the\nspin current, especially when the current is aligned with the [010] direction\n({\\theta} = 90{\\deg}). Here, the spin polarization component creates a\nsubstantial field-like effective field, surpassing the damping-like field from\n. This highlights the crucial role of in enhancing spin-torque efficiency and\nelucidating spin flow modulation mechanics in this crystalline context. Our\nstudy highlights the potential of RuO$_2$ as a powerful spin current generator,\npaving the way for practical applications in spin-torque switching technologies\nand other cutting-edge spintronic devices.\n","subjects":["Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}