{"id":"2407.12630","title":"Weighting Pseudo-Labels via High-Activation Feature Index Similarity and\n  Object Detection for Semi-Supervised Segmentation","authors":"Prantik Howlader, Hieu Le and Dimitris Samaras","authorsParsed":[["Howlader","Prantik",""],["Le","Hieu",""],["Samaras","Dimitris",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:58:04 GMT"}],"updateDate":"2024-07-18","timestamp":1721228284000,"abstract":"  Semi-supervised semantic segmentation methods leverage unlabeled data by\npseudo-labeling them. Thus the success of these methods hinges on the\nreliablility of the pseudo-labels. Existing methods mostly choose\nhigh-confidence pixels in an effort to avoid erroneous pseudo-labels. However,\nhigh confidence does not guarantee correct pseudo-labels especially in the\ninitial training iterations. In this paper, we propose a novel approach to\nreliably learn from pseudo-labels. First, we unify the predictions from a\ntrained object detector and a semantic segmentation model to identify reliable\npseudo-label pixels. Second, we assign different learning weights to\npseudo-labeled pixels to avoid noisy training signals. To determine these\nweights, we first use the reliable pseudo-label pixels identified from the\nfirst step and labeled pixels to construct a prototype for each class. Then,\nthe per-pixel weight is the structural similarity between the pixel and the\nprototype measured via rank-statistics similarity. This metric is robust to\nnoise, making it better suited for comparing features from unlabeled images,\nparticularly in the initial training phases where wrong pseudo labels are prone\nto occur. We show that our method can be easily integrated into four\nsemi-supervised semantic segmentation frameworks, and improves them in both\nCityscapes and Pascal VOC datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dGvYy8bxFFQ_FXLnxggYZAyMb1NtbAI0QjYguwJxkkk","pdfSize":"24132843"}
