{"id":"2407.20508","title":"Unveiling the Potential of Spiking Dynamics in Graph Representation\n  Learning through Spatial-Temporal Normalization and Coding Strategies","authors":"Mingkun Xu, Huifeng Yin, Yujie Wu, Guoqi Li, Faqiang Liu, Jing Pei,\n  Shuai Zhong, Lei Deng","authorsParsed":[["Xu","Mingkun",""],["Yin","Huifeng",""],["Wu","Yujie",""],["Li","Guoqi",""],["Liu","Faqiang",""],["Pei","Jing",""],["Zhong","Shuai",""],["Deng","Lei",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 02:53:26 GMT"}],"updateDate":"2024-07-31","timestamp":1722308006000,"abstract":"  In recent years, spiking neural networks (SNNs) have attracted substantial\ninterest due to their potential to replicate the energy-efficient and\nevent-driven processing of biological neurons. Despite this, the application of\nSNNs in graph representation learning, particularly for non-Euclidean data,\nremains underexplored, and the influence of spiking dynamics on graph learning\nis not yet fully understood. This work seeks to address these gaps by examining\nthe unique properties and benefits of spiking dynamics in enhancing graph\nrepresentation learning. We propose a spike-based graph neural network model\nthat incorporates spiking dynamics, enhanced by a novel spatial-temporal\nfeature normalization (STFN) technique, to improve training efficiency and\nmodel stability. Our detailed analysis explores the impact of rate coding and\ntemporal coding on SNN performance, offering new insights into their advantages\nfor deep graph networks and addressing challenges such as the oversmoothing\nproblem. Experimental results demonstrate that our SNN models can achieve\ncompetitive performance with state-of-the-art graph neural networks (GNNs)\nwhile considerably reducing computational costs, highlighting the potential of\nSNNs for efficient neuromorphic computing applications in complex graph-based\nscenarios.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}