{"id":"2407.04359","title":"Dance of the ADS: Orchestrating Failures through Historically-Informed\n  Scenario Fuzzing","authors":"Tong Wang and Taotao Gu and Huan Deng and Hu Li and Xiaohui Kuang and\n  Gang Zhao","authorsParsed":[["Wang","Tong",""],["Gu","Taotao",""],["Deng","Huan",""],["Li","Hu",""],["Kuang","Xiaohui",""],["Zhao","Gang",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 08:58:09 GMT"}],"updateDate":"2024-07-08","timestamp":1720169889000,"abstract":"  As autonomous driving systems (ADS) advance towards higher levels of\nautonomy, orchestrating their safety verification becomes increasingly\nintricate. This paper unveils ScenarioFuzz, a pioneering scenario-based fuzz\ntesting methodology. Designed like a choreographer who understands the past\nperformances, it uncovers vulnerabilities in ADS without the crutch of\npredefined scenarios. Leveraging map road networks, such as OPENDRIVE, we\nextract essential data to form a foundational scenario seed corpus. This\ncorpus, enriched with pertinent information, provides the necessary boundaries\nfor fuzz testing in the absence of starting scenarios. Our approach integrates\nspecialized mutators and mutation techniques, combined with a graph neural\nnetwork model, to predict and filter out high-risk scenario seeds, optimizing\nthe fuzzing process using historical test data. Compared to other methods, our\napproach reduces the time cost by an average of 60.3%, while the number of\nerror scenarios discovered per unit of time increases by 103%. Furthermore, we\npropose a self-supervised collision trajectory clustering method, which aids in\nidentifying and summarizing 54 high-risk scenario categories prone to inducing\nADS faults. Our experiments have successfully uncovered 58 bugs across six\ntested systems, emphasizing the critical safety concerns of ADS.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}