{"id":"2407.00630","title":"BAZAM: A Blockchain-Assisted Zero-Trust Authentication in Multi-UAV\n  Wireless Networks","authors":"Mingyue Xie, Zheng Chang, Osama Alfarraj, Keping Yu, Tao Chen, Hongwei\n  Li","authorsParsed":[["Xie","Mingyue",""],["Chang","Zheng",""],["Alfarraj","Osama",""],["Yu","Keping",""],["Chen","Tao",""],["Li","Hongwei",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 09:06:49 GMT"}],"updateDate":"2024-07-02","timestamp":1719738409000,"abstract":"  Unmanned aerial vehicles (UAVs) are vulnerable to interception and attacks\nwhen operated remotely without a unified and efficient identity authentication.\nMeanwhile, the openness of wireless communication environments potentially\nleads to data leakage and system paralysis. However, conventional\nauthentication schemes in the UAV network are system-centric, failing to adapt\nto the diversity of UAVs identities and access, resulting in changes in network\nenvironments and connection statuses. Additionally, UAVs are not subjected to\nperiodic identity compliance checks once authenticated, leading to difficulties\nin controlling access anomalies. Therefore, in this work, we consider a\nzero-trust framework for UAV network authentication, aiming to achieve UAVs\nidentity authentication through the principle of ``never trust and always\nverify''. We introduce a blockchain-assisted zero-trust authentication scheme,\nnamely BAZAM, designed for multi-UAV wireless networks. In this scheme, UAVs\nfollow a key generation approach using physical unclonable functions (PUFs),\nand cryptographic technique helps verify registration and access requests of\nUAVs. The blockchain is applied to store UAVs authentication information in\nimmutable storage. Through thorough security analysis and extensive evaluation,\nwe demonstrate the effectiveness and efficiency of the proposed BAZAM.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}