{"id":"2407.16405","title":"On Differentially Private 3D Medical Image Synthesis with Controllable\n  Latent Diffusion Models","authors":"Deniz Daum, Richard Osuala, Anneliese Riess, Georgios Kaissis, Julia\n  A. Schnabel, Maxime Di Folco","authorsParsed":[["Daum","Deniz",""],["Osuala","Richard",""],["Riess","Anneliese",""],["Kaissis","Georgios",""],["Schnabel","Julia A.",""],["Di Folco","Maxime",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 11:49:58 GMT"}],"updateDate":"2024-07-24","timestamp":1721735398000,"abstract":"  Generally, the small size of public medical imaging datasets coupled with\nstringent privacy concerns, hampers the advancement of data-hungry deep\nlearning models in medical imaging. This study addresses these challenges for\n3D cardiac MRI images in the short-axis view. We propose Latent Diffusion\nModels that generate synthetic images conditioned on medical attributes, while\nensuring patient privacy through differentially private model training. To our\nknowledge, this is the first work to apply and quantify differential privacy in\n3D medical image generation. We pre-train our models on public data and\nfinetune them with differential privacy on the UK Biobank dataset. Our\nexperiments reveal that pre-training significantly improves model performance,\nachieving a Fr\\'echet Inception Distance (FID) of 26.77 at $\\epsilon=10$,\ncompared to 92.52 for models without pre-training. Additionally, we explore the\ntrade-off between privacy constraints and image quality, investigating how\ntighter privacy budgets affect output controllability and may lead to degraded\nperformance. Our results demonstrate that proper consideration during training\nwith differential privacy can substantially improve the quality of synthetic\ncardiac MRI images, but there are still notable challenges in achieving\nconsistent medical realism.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}