{"id":"2407.08367","title":"Modeling Hydraulic Fracture Entering Stress Barrier: Theory and\n  Practical Recommendations","authors":"Aleksandr Linkov, Liliana Rybarska-Rusinek, Ewa Rejwer-Kosi\\'nska","authorsParsed":[["Linkov","Aleksandr",""],["Rybarska-Rusinek","Liliana",""],["Rejwer-Kosińska","Ewa",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 10:23:09 GMT"}],"updateDate":"2024-07-12","timestamp":1720693389000,"abstract":"  Numerical modeling of hydraulic fracturing is complicated when a fracture\nreaches a stress barrier. For high barriers, it may require changing of a\ncomputational scheme. Despite there are examples of modeling propagation\nthrough barriers, there is no general theory clarifying when and why\nconventional schemes may become inefficient, and how to overcome computational\ndifficulties. The paper presents the theory and practical recommendations\nfollowing from it. We start from the definition of the barrier intensity, which\nexposes that the barrier strength may change from zero for contrast-free\npropagation to infinity for channelized propagation. The analysis reveals two\ntypes of computational difficulties caused by spatial discretization: (i)\ngeneral arising for fine grids and aggravated by a barrier; and (ii) specific,\ncaused entirely by a strong barrier. The asymptotic approach which avoids\nspatial discretization is suggested. It is illustrated by solving bench-mark\nproblems for barriers of arbitrary intensity. The analysis distinguishes three\ntypical stages of the fracture penetration into a barrier, and provides\ntheoretical values of the Nolte-Smith slope parameter and arrest time as\nfunctions of the barrier intensity. Special analysis establishes the accuracy\nand bounds of the asymptotic approach. It appears that the approach provides\nphysically significant and accurate results for fracture penetration into high,\nintermediate and even weak stress barriers. On this basis, simple practical\nrecommendations are given for modeling hydraulic fractures in rocks with stress\nbarriers. The recommendations may be promptly implemented in any program using\nspatial discretization to model fracture propagation.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"inJhHOKv-V2wHq4N1H29RIa0zD0YYgWG3HxJOEXL7TY","pdfSize":"1060639","objectId":"0xdcd4589781e36b7268da98c3f464eb291b031b2036ec2eb1a6c73358c02834b4","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
