{"id":"2407.15729","title":"Self-Sustainable Metasurface-Assisted mmWave Indoor Communication System","authors":"Zhenyu Li, Ozan Alp Topal, \\\"Ozlem Tu\\u{g}fe Demir, Emil Bj\\\"ornson,\n  Cicek Cavdar","authorsParsed":[["Li","Zhenyu",""],["Topal","Ozan Alp",""],["Demir","Özlem Tuğfe",""],["Björnson","Emil",""],["Cavdar","Cicek",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:33:36 GMT"}],"updateDate":"2024-07-23","timestamp":1721662416000,"abstract":"  In the design of a metasurface-assisted system for indoor environments, it is\nessential to take into account not only the performance gains and coverage\nextension provided by the metasurface but also the operating costs brought by\nits reconfigurability, such as powering and cabling. These costs can present\nchallenges, particularly in indoor dense spaces (IDSs). A self-sustainable\nmetasurface (SSM), which retains reconfigurability unlike a static metasurface\n(SMS), achieves a lower operating cost than a reconfigurable intelligent\nsurface (RIS) by being self-sustainable through power harvesting. In this\npaper, in order to find a better trade-off between metasurface gain, coverage,\nand operating cost, the design and performance of an SSM-assisted indoor mmWave\ncommunication system are investigated. We first simplify the design of the\nSSM-assisted system by considering the use of SSMs in a preset-based manner and\nthe formation of coverage groups by associating SSMs with the closest user\nequipments (UEs). We propose a two-stage iterative algorithm to maximize the\nminimum data rate in the system by jointly deciding the association between the\nUEs and the SSMs, the phase-shifts of the SSMs, and allocating time resources\nfor each UE. The non-convexities that exist in the proposed optimization\nproblem are tackled using the feasible point pursuit successive convex\napproximation method and the concave-convex procedure. To understand the best\nscenario for using SSM, the resulting performance is compared with that\nachieved with RIS and SMS. Our numerical results indicate that SSMs are best\nutilized in a small environment where self-sustainability is easier to achieve\nwhen the budget for operating costs is tight.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}