{"id":"2407.00513","title":"Dynamic Optimization of Video Streaming Quality Using Network Digital\n  Twin Technology","authors":"Zurh Farus and Betty Searcy and Tina Nassisid and Kevin Muhammad","authorsParsed":[["Farus","Zurh",""],["Searcy","Betty",""],["Nassisid","Tina",""],["Muhammad","Kevin",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 19:04:41 GMT"}],"updateDate":"2024-07-02","timestamp":1719687881000,"abstract":"  This paper introduces a novel dynamic optimization framework for video\nstreaming that leverages Network Digital Twin (NDT) technology to address the\nchallenges posed by fluctuating wireless network conditions. Traditional\nadaptive streaming methods often struggle with rapid changes in network\nbandwidth, latency, and packet loss, leading to suboptimal user experiences\ncharacterized by frequent buffering and reduced video quality. Our proposed\nframework integrates a sophisticated NDT that models the wireless network in\nreal-time and employs predictive analytics to forecast near-future network\nstates. Utilizing machine learning techniques, specifically Random Forest and\nNeural Networks, the NDT predicts bandwidth availability, latency trends, and\npotential packet losses before they impact video transmission. Based on these\npredictions, our adaptive streaming algorithm dynamically adjusts video\nbitrates, resolution, and buffering strategies, thus ensuring an uninterrupted\nand high-quality viewing experience. Experimental validations demonstrate that\nour approach significantly enhances the Quality of Experience (QoE) by reducing\nbuffering times by up to 50\\% and improving resolution in varied network\nconditions compared to conventional streaming methods. This paper underscores\nthe potential of integrating digital twin technology into multimedia\ntransmission, paving the way for more resilient and user-centric video\nstreaming solutions.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}