{"id":"2407.04597","title":"Feature Attenuation of Defective Representation Can Resolve Incomplete\n  Masking on Anomaly Detection","authors":"YeongHyeon Park, Sungho Kang, Myung Jin Kim, Hyeong Seok Kim, Juneho\n  Yi","authorsParsed":[["Park","YeongHyeon",""],["Kang","Sungho",""],["Kim","Myung Jin",""],["Kim","Hyeong Seok",""],["Yi","Juneho",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 15:44:53 GMT"}],"updateDate":"2024-07-08","timestamp":1720194293000,"abstract":"  In unsupervised anomaly detection (UAD) research, while state-of-the-art\nmodels have reached a saturation point with extensive studies on public\nbenchmark datasets, they adopt large-scale tailor-made neural networks (NN) for\ndetection performance or pursued unified models for various tasks. Towards edge\ncomputing, it is necessary to develop a computationally efficient and scalable\nsolution that avoids large-scale complex NNs. Motivated by this, we aim to\noptimize the UAD performance with minimal changes to NN settings. Thus, we\nrevisit the reconstruction-by-inpainting approach and rethink to improve it by\nanalyzing strengths and weaknesses. The strength of the SOTA methods is a\nsingle deterministic masking approach that addresses the challenges of random\nmultiple masking that is inference latency and output inconsistency.\nNevertheless, the issue of failure to provide a mask to completely cover\nanomalous regions is a remaining weakness. To mitigate this issue, we propose\nFeature Attenuation of Defective Representation (FADeR) that only employs two\nMLP layers which attenuates feature information of anomaly reconstruction\nduring decoding. By leveraging FADeR, features of unseen anomaly patterns are\nreconstructed into seen normal patterns, reducing false alarms. Experimental\nresults demonstrate that FADeR achieves enhanced performance compared to\nsimilar-scale NNs. Furthermore, our approach exhibits scalability in\nperformance enhancement when integrated with other single deterministic masking\nmethods in a plug-and-play manner.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}