{"id":"2407.04018","title":"Leveraging Topic Specificity and Social Relationships for Expert Finding\n  in Community Question Answering Platforms","authors":"Maddalena Amendola, Andrea Passarella, Raffaele Perego","authorsParsed":[["Amendola","Maddalena",""],["Passarella","Andrea",""],["Perego","Raffaele",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 15:50:18 GMT"}],"updateDate":"2024-07-08","timestamp":1720108218000,"abstract":"  Online Community Question Answering (CQA) platforms have become indispensable\ntools for users seeking expert solutions to their technical queries. The\neffectiveness of these platforms relies on their ability to identify and direct\nquestions to the most knowledgeable users within the community, a process known\nas Expert Finding (EF). EF accuracy is crucial for increasing user engagement\nand the reliability of provided answers. Despite recent advancements in EF\nmethodologies, blending the diverse information sources available on CQA\nplatforms for effective expert identification remains challenging. In this\npaper, we present TUEF, a Topic-oriented User-Interaction model for Expert\nFinding, which aims to fully and transparently leverage the heterogeneous\ninformation available within online question-answering communities. TUEF\nintegrates content and social data by constructing a multi-layer graph that\nmaps out user relationships based on their answering patterns on specific\ntopics. By combining these sources of information, TUEF identifies the most\nrelevant and knowledgeable users for any given question and ranks them using\nlearning-to-rank techniques. Our findings indicate that TUEF's topic-oriented\nmodel significantly enhances performance, particularly in large communities\ndiscussing well-defined topics. Additionally, we show that the interpretable\nlearning-to-rank algorithm integrated into TUEF offers transparency and\nexplainability with minimal performance trade-offs. The exhaustive experiments\nconducted on six different CQA communities of Stack Exchange show that TUEF\noutperforms all competitors with a minimum performance boost of 42.42% in P@1,\n32.73% in NDCG@3, 21.76% in R@5, and 29.81% in MRR, excelling in both the\nevaluation approaches present in the previous literature.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/"}