{"id":"2407.09189","title":"Segmenting Medical Images with Limited Data","authors":"Zhaoshan Liua and Qiujie Lv and Chau Hung Lee and Lei Shen","authorsParsed":[["Liua","Zhaoshan",""],["Lv","Qiujie",""],["Lee","Chau Hung",""],["Shen","Lei",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 11:41:18 GMT"}],"updateDate":"2024-07-15","timestamp":1720784478000,"abstract":"  While computer vision has proven valuable for medical image segmentation, its\napplication faces challenges such as limited dataset sizes and the complexity\nof effectively leveraging unlabeled images. To address these challenges, we\npresent a novel semi-supervised, consistency-based approach termed the\ndata-efficient medical segmenter (DEMS). The DEMS features an encoder-decoder\narchitecture and incorporates the developed online automatic augmenter (OAA)\nand residual robustness enhancement (RRE) blocks. The OAA augments input data\nwith various image transformations, thereby diversifying the dataset to improve\nthe generalization ability. The RRE enriches feature diversity and introduces\nperturbations to create varied inputs for different decoders, thereby providing\nenhanced variability. Moreover, we introduce a sensitive loss to further\nenhance consistency across different decoders and stabilize the training\nprocess. Extensive experimental results on both our own and three public\ndatasets affirm the effectiveness of DEMS. Under extreme data shortage\nscenarios, our DEMS achieves 16.85\\% and 10.37\\% improvement in dice score\ncompared with the U-Net and top-performed state-of-the-art method,\nrespectively. Given its superior data efficiency, DEMS could present\nsignificant advancements in medical segmentation under small data regimes. The\nproject homepage can be accessed at https://github.com/NUS-Tim/DEMS.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}