{"id":"2407.12940","title":"KiGRAS: Kinematic-Driven Generative Model for Realistic Agent Simulation","authors":"Jianbo Zhao, Jiaheng Zhuang, Qibin Zhou, Taiyu Ban, Ziyao Xu, Hangning\n  Zhou, Junhe Wang, Guoan Wang, Zhiheng Li, Bin Li","authorsParsed":[["Zhao","Jianbo",""],["Zhuang","Jiaheng",""],["Zhou","Qibin",""],["Ban","Taiyu",""],["Xu","Ziyao",""],["Zhou","Hangning",""],["Wang","Junhe",""],["Wang","Guoan",""],["Li","Zhiheng",""],["Li","Bin",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 18:12:11 GMT"}],"updateDate":"2024-07-19","timestamp":1721239931000,"abstract":"  Trajectory generation is a pivotal task in autonomous driving. Recent studies\nhave introduced the autoregressive paradigm, leveraging the state transition\nmodel to approximate future trajectory distributions. This paradigm closely\nmirrors the real-world trajectory generation process and has achieved notable\nsuccess. However, its potential is limited by the ineffective representation of\nrealistic trajectories within the redundant state space. To address this\nlimitation, we propose the Kinematic-Driven Generative Model for Realistic\nAgent Simulation (KiGRAS). Instead of modeling in the state space, KiGRAS\nfactorizes the driving scene into action probability distributions at each time\nstep, providing a compact space to represent realistic driving patterns. By\nestablishing physical causality from actions (cause) to trajectories (effect)\nthrough the kinematic model, KiGRAS eliminates massive redundant trajectories.\nAll states derived from actions in the cause space are constrained to be\nphysically feasible. Furthermore, redundant trajectories representing identical\naction sequences are mapped to the same representation, reflecting their\nunderlying actions. This approach significantly reduces task complexity and\nensures physical feasibility. KiGRAS achieves state-of-the-art performance in\nWaymo's SimAgents Challenge, ranking first on the WOMD leaderboard with\nsignificantly fewer parameters than other models. The video documentation is\navailable at \\url{https://kigras-mach.github.io/KiGRAS/}.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}