{"id":"2407.05828","title":"Simulation of the impact of an additional corrugated structure impedance\n  on the bursting dynamics in an electron storage ring","authors":"Sebastian Maier, Miriam Brosi, Akira Mochihashi, Michael J. Nasse,\n  Markus Schwarz, Anke-Susanne M\\\"uller","authorsParsed":[["Maier","Sebastian",""],["Brosi","Miriam",""],["Mochihashi","Akira",""],["Nasse","Michael J.",""],["Schwarz","Markus",""],["Müller","Anke-Susanne",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 11:16:36 GMT"}],"updateDate":"2024-07-09","timestamp":1720437396000,"abstract":"  In the case of single-digit picosecond bunch length, synchrotron light\nsources produce intense coherent radiation up to the THz range. The reduction\nof the bunch length by lowering the momentum compaction factor (low-$\\alpha$)\ngives rise to the micro-bunching instability, which is on one hand a crucial\nroadblock in the X-ray range during to the resulting effective bunch\nlengthening but on the other hand also an opportunity for the generation of\nintense THz radiation if it can be controlled appropriately. In the KIT storage\nring KARA (Karlsruhe Research Accelerator), two parallel plates with periodic\nrectangular corrugations are planned to be installed in an electron storage\nring. These plates create an additional longitudinal impedance based on their\ngeometry, which can affect the beam dynamics. The resulting impedance\nmanipulation will be used to study and control the longitudinal electron beam\ndynamics and the emitted coherent synchrotron radiation (CSR). This paper\npresents the results of systematic studies in simulation of the impact of\nadditional corrugated plate impedances on the longitudinal beam dynamics using\nthe example of the KARA storage ring. If the periodicity of the wake function\nof the corrugated plates matches the size of the substructures in the\nlongitudinal bunch profile, the instability threshold can be effectively\nmanipulated. This extends intense THz radiation to different beam current\nregimes.\n","subjects":["Physics/Accelerator Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}