{"id":"2407.00839","title":"Imaginary Machines: A Serverless Model for Cloud Applications","authors":"Michael Wawrzoniak, Rodrigo Bruno, Ana Klimovic, Gustavo Alonso","authorsParsed":[["Wawrzoniak","Michael",""],["Bruno","Rodrigo",""],["Klimovic","Ana",""],["Alonso","Gustavo",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 21:47:09 GMT"}],"updateDate":"2024-07-02","timestamp":1719784029000,"abstract":"  Serverless Function-as-a-Service (FaaS) platforms provide applications with\nresources that are highly elastic, quick to instantiate, accounted at fine\ngranularity, and without the need for explicit runtime resource orchestration.\nThis combination of the core properties underpins the success and popularity of\nthe serverless FaaS paradigm. However, these benefits are not available to most\ncloud applications because they are designed for networked virtual\nmachines/containers environments. Since such cloud applications cannot take\nadvantage of the highly elastic resources of serverless and require run-time\norchestration systems to operate, they suffer from lower resource utilization,\nadditional management complexity, and costs relative to their FaaS serverless\ncounterparts.\n  We propose Imaginary Machines, a new serverless model for cloud applications.\nThis model (1.) exposes the highly elastic resources of serverless platforms as\nthe traditional network-of-hosts model that cloud applications expect, and (2.)\nit eliminates the need for explicit run-time orchestration by transparently\nmanaging application resources based on signals generated during cloud\napplication executions. With the Imaginary Machines model, unmodified cloud\napplications become serverless applications. While still based on the\nnetwork-of-host model, they benefit from the highly elastic resources and do\nnot require runtime orchestration, just like their specialized serverless FaaS\ncounterparts, promising increased resource utilization while reducing\nmanagement costs.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Operating Systems"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"x7mN2OQ85zQrBU89vK_-2-FMkoLuluPwHZgVHxWUtek","pdfSize":"91380"}
