{"id":"2407.20913","title":"Explicit solution to an optimal two-player switching game in infinite\n  horizon","authors":"Brahim El Asri, Magnoud\\'ewa Paka","authorsParsed":[["Asri","Brahim El",""],["Paka","Magnoudéwa",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 15:40:33 GMT"},{"version":"v2","created":"Sat, 3 Aug 2024 13:55:36 GMT"}],"updateDate":"2024-08-06","timestamp":1722354033000,"abstract":"  We consider a problem in which two decision makers have each, a set of\npossible decisions they can make at each time. Each decision implies a given\nrandom payoff. We choose the payoff to be a functional of a one-dimensional\nIt\\^o diffusion. At each time, they can switch from a decision to another, and\nswitching incurs a cost. The first decision maker's objective is to select a\nsequence of switching times that maximizes the associated expected discounted\npayoff flow, while the second decision maker's objective is to select a\nsequence of switching times that minimizes the associated expected discounted\npayoff flow. The strategies of both decision makers are interconnected in the\nsense that the random payoff flow of one of the decision makers depends on the\nstrategy of the other decision maker. We characterize the switching regions\nwhich reduce the switching problem into one of finding a finite number of\nthreshold values in state process that would trigger switchings and then derive\nan explicit solution to this problem in the case where the functional of the\ndiffusion process is identical for each regime, while the diffusion operators\nare different together with the assumption of possibly negative costs. We\nextend our work by giving a numerical procedure to compute threshold values in\ncase we know their qualitative structure and finally we illustrate our results\nby numerical simulations.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-YCYp2uUT5ay07fV1K1bzsM1DWXQVCTwjmD0KhYxqpo","pdfSize":"793642","objectId":"0x49e5669d0c9a2954b685e7f660934e08302f108b1209b3ecbeb05d283c6cb597","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
