{"id":"2407.04117","title":"Predictive Coding Networks and Inference Learning: Tutorial and Survey","authors":"Bj\\\"orn van Zwol, Ro Jefferson, Egon L. van den Broek","authorsParsed":[["van Zwol","Björn",""],["Jefferson","Ro",""],["Broek","Egon L. van den",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 18:39:20 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 14:56:46 GMT"}],"updateDate":"2024-07-23","timestamp":1720118360000,"abstract":"  Recent years have witnessed a growing call for renewed emphasis on\nneuroscience-inspired approaches in artificial intelligence research, under the\nbanner of NeuroAI. A prime example of this is predictive coding networks\n(PCNs), based on the neuroscientific framework of predictive coding. This\nframework views the brain as a hierarchical Bayesian inference model that\nminimizes prediction errors through feedback connections. Unlike traditional\nneural networks trained with backpropagation (BP), PCNs utilize inference\nlearning (IL), a more biologically plausible algorithm that explains patterns\nof neural activity that BP cannot. Historically, IL has been more\ncomputationally intensive, but recent advancements have demonstrated that it\ncan achieve higher efficiency than BP with sufficient parallelization.\nFurthermore, PCNs can be mathematically considered a superset of traditional\nfeedforward neural networks (FNNs), significantly extending the range of\ntrainable architectures. As inherently probabilistic (graphical) latent\nvariable models, PCNs provide a versatile framework for both supervised\nlearning and unsupervised (generative) modeling that goes beyond traditional\nartificial neural networks. This work provides a comprehensive review and\ndetailed formal specification of PCNs, particularly situating them within the\ncontext of modern ML methods. Additionally, we introduce a Python library\n(PRECO) for practical implementation. This positions PC as a promising\nframework for future ML innovations.\n","subjects":["Computing Research Repository/Machine Learning","Condensed Matter/Disordered Systems and Neural Networks","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Neural and Evolutionary Computing","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}