{"id":"2407.00221","title":"Spectro-photometric follow up of the outbursting AM CVn system\n  ASASSN-21br","authors":"S. Painter, E. Aydi, M. Motsoaledi, K. V. Sokolovsky, J. Strader, D.\n  A. H. Buckley, C. S. Kochanek, T. J. Maccarone, K. Mukai, B. J. Shappee, and\n  K. Z. Stanek","authorsParsed":[["Painter","S.",""],["Aydi","E.",""],["Motsoaledi","M.",""],["Sokolovsky","K. V.",""],["Strader","J.",""],["Buckley","D. A. H.",""],["Kochanek","C. S.",""],["Maccarone","T. J.",""],["Mukai","K.",""],["Shappee","B. J.",""],["Stanek","K. Z.",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 20:19:48 GMT"},{"version":"v2","created":"Tue, 9 Jul 2024 15:02:00 GMT"}],"updateDate":"2024-07-10","timestamp":1719605988000,"abstract":"  We report on spectroscopic and photometric observations of the AM CVn system\nASASSN-21br, which was discovered in outburst by the All-Sky Automated Survey\nfor Supernovae in February 2021. The outburst lasted for around three weeks,\nand exhibited a pronounced brightness dip for $\\approx$ 4 days, during which\nthe spectra showed a sudden transition from emission- to absorption-line\ndominated. Only $\\approx$ 60 AM CVn systems with derived orbital periods are\nfound in the Galaxy, therefore increasing the sample of AM CVn systems with\nknown orbital periods is of tremendous importance to (1) constrain the physical\nmechanisms of their outbursts and (2) establish a better understanding of the\nlow-frequency background noise of future gravitational wave surveys.\nTime-resolved photometry taken during the outburst of ASASSN-21br showed\nmodulation with a period of around 36.65 minutes, which is likely the superhump\nor orbital period of the system. Time-resolved spectroscopy taken with the\nSouthern African Large Telescope did not show any sign of periodicity in the He\nI absorption lines. This is possibly due to the origin of these lines in the\noutbursting accretion disc, which makes it challenging to retrieve periodicity\nfrom the spectral lines. Future follow up spectral observations during\nquiescence might allow us better constrain the orbital period of ASASSN-21br.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}