{"id":"2407.17156","title":"Path Following and Stabilisation of a Bicycle Model using a\n  Reinforcement Learning Approach","authors":"Sebastian Weyrer, Peter Manzl, A. L. Schwab, Johannes Gerstmayr","authorsParsed":[["Weyrer","Sebastian",""],["Manzl","Peter",""],["Schwab","A. L.",""],["Gerstmayr","Johannes",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 10:54:23 GMT"}],"updateDate":"2024-07-25","timestamp":1721818463000,"abstract":"  Over the years, complex control approaches have been developed to control the\nmotion of a bicycle. Reinforcement Learning (RL), a branch of machine learning,\npromises easy deployment of so-called agents. Deployed agents are increasingly\nconsidered as an alternative to controllers for mechanical systems. The present\nwork introduces an RL approach to do path following with a virtual bicycle\nmodel while simultaneously stabilising it laterally. The bicycle, modelled as\nthe Whipple benchmark model and using multibody system dynamics, has no\nstabilisation aids. The agent succeeds in both path following and stabilisation\nof the bicycle model exclusively by outputting steering angles, which are\nconverted into steering torques via a PD controller. Curriculum learning is\napplied as a state-of-the-art training strategy. Different settings for the\nimplemented RL framework are investigated and compared to each other. The\nperformance of the deployed agents is evaluated using different types of paths\nand measurements. The ability of the deployed agents to do path following and\nstabilisation of the bicycle model travelling between 2m/s and 7m/s along\ncomplex paths including full circles, slalom manoeuvres, and lane changes is\ndemonstrated. Explanatory methods for machine learning are used to analyse the\nfunctionality of a deployed agent and link the introduced RL approach with\nresearch in the field of bicycle dynamics.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/"}