{"id":"2407.19876","title":"A feasible dose-volume estimation of radiotherapy treatment with optimal\n  transport using a concept for transportation of Ricci-flat time-varying\n  dose-volume","authors":"Yusuke Anetai, Jun'ichi Kotoku","authorsParsed":[["Anetai","Yusuke",""],["Kotoku","Jun'ichi",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 10:52:12 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 13:33:46 GMT"}],"updateDate":"2024-09-05","timestamp":1722250332000,"abstract":"  In radiotherapy, the dose-volume histogram (DVH) curve is an important means\nof evaluating the clinical feasibility of tumor control and side effects in\nnormal organs against actual treatment. Fractionation, distributing the amounts\nof irradiation, is used to enhance the treatment effectiveness of tumor control\nand mitigation of normal tissue damage. Therefore, dose and volume receive\ntime-varying effects per fractional treatment event. However, the difficulty of\nDVH superimposition of different situations prevents evaluation of the total\nDVH despite different shapes and receiving dose distributions of organs in each\nfraction. However, an actual evaluation is determined traditionally by the\ninitial treatment plan because of summation difficulty. Mathematically, this\ndifficulty can be regarded as a kind of optimal transport of DVH. For this\nstudy, we introduced DVH transportation on the curvilinear orthogonal space\nwith respect to arbitrary time ($T$), time-varying dose ($D$), and time-varying\nvolume ($V$), which was designated as the TDV space embedded in the Riemannian\nmanifold.Transportation in the TDV space should satisfy the following: (a) the\nmetrics between dose and volume must be equivalent for any fractions and (b)\nthe cumulative characteristic of DVH must hold irrespective of the lapse of\ntime. With consideration of the Ricci-flat condition for the $D$-direction and\n$V$-direction, we obtained the probability density distribution, which is\ndescribed by Poisson's equation with radial diffusion process toward $T$. This\ngeometrical requirement and transportation equation rigorously provided the\nfeasible total DVH.\n","subjects":["Physics/Medical Physics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}