{"id":"2407.05607","title":"Weakly Supervised Test-Time Domain Adaptation for Object Detection","authors":"Anh-Dzung Doan, Bach Long Nguyen, Terry Lim, Madhuka Jayawardhana,\n  Surabhi Gupta, Christophe Guettier, Ian Reid, Markus Wagner, Tat-Jun Chin","authorsParsed":[["Doan","Anh-Dzung",""],["Nguyen","Bach Long",""],["Lim","Terry",""],["Jayawardhana","Madhuka",""],["Gupta","Surabhi",""],["Guettier","Christophe",""],["Reid","Ian",""],["Wagner","Markus",""],["Chin","Tat-Jun",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 04:44:42 GMT"}],"updateDate":"2024-07-09","timestamp":1720413882000,"abstract":"  Prior to deployment, an object detector is trained on a dataset compiled from\na previous data collection campaign. However, the environment in which the\nobject detector is deployed will invariably evolve, particularly in outdoor\nsettings where changes in lighting, weather and seasons will significantly\naffect the appearance of the scene and target objects. It is almost impossible\nfor all potential scenarios that the object detector may come across to be\npresent in a finite training dataset. This necessitates continuous updates to\nthe object detector to maintain satisfactory performance. Test-time domain\nadaptation techniques enable machine learning models to self-adapt based on the\ndistributions of the testing data. However, existing methods mainly focus on\nfully automated adaptation, which makes sense for applications such as\nself-driving cars. Despite the prevalence of fully automated approaches, in\nsome applications such as surveillance, there is usually a human operator\noverseeing the system's operation. We propose to involve the operator in\ntest-time domain adaptation to raise the performance of object detection beyond\nwhat is achievable by fully automated adaptation. To reduce manual effort, the\nproposed method only requires the operator to provide weak labels, which are\nthen used to guide the adaptation process. Furthermore, the proposed method can\nbe performed in a streaming setting, where each online sample is observed only\nonce. We show that the proposed method outperforms existing works,\ndemonstrating a great benefit of human-in-the-loop test-time domain adaptation.\nOur code is publicly available at https://github.com/dzungdoan6/WSTTA\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}