{"id":"2407.01399","title":"3D MHD modelling of plasmoid drift following massive material injection\n  in a tokamak","authors":"M. Kong, E. Nardon, D. Bonfiglio, M. Hoelzl, D. Hu, the JOREK team,\n  JET contributors and the EUROfusion Tokamak Exploitation Team","authorsParsed":[["Kong","M.",""],["Nardon","E.",""],["Bonfiglio","D.",""],["Hoelzl","M.",""],["Hu","D.",""],["team","the JOREK",""],["contributors","JET",""],["Team","the EUROfusion Tokamak Exploitation",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:50:05 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 16:36:03 GMT"},{"version":"v3","created":"Thu, 18 Jul 2024 17:03:57 GMT"},{"version":"v4","created":"Tue, 30 Jul 2024 16:16:18 GMT"}],"updateDate":"2024-07-31","timestamp":1719849005000,"abstract":"  Mechanisms of plasmoid drift following massive material injection are studied\nvia 3D non-linear MHD modelling with the JOREK code, using a transient neutral\nsource deposited at the low field side midplane of a JET H-mode plasma to\nclarify basic processes and compare with existing theories. The simulations\nconfirm the important role of the propagation of shear Alfv\\'en wave (SAW)\npackets from both ends of the plasmoid (``SAW braking'') and the development of\nexternal resistive currents along magnetic field lines (``P\\'egouri\\'e\nbraking'') in limiting charge separation and thus the $\\mathbf{E}\\times\n\\mathbf{B}$ plasmoid drift, where $\\mathbf{E}$ and $\\mathbf{B}$ are the\nelectric and magnetic fields, respectively. The drift velocity is found to be\nlimited by the SAW braking on the few microseconds timescale for cases with\nrelatively small source amplitude while the P\\'egouri\\'e braking acting on a\nlonger timescale is shown to set in earlier with larger toroidal extent of the\nsource, both in good agreement with existing theories. The simulations also\nidentify the key role of the size of the $\\mathbf{E}\\times \\mathbf{B}$ flow\nregion on plasmoid drift and show that the saturated velocity caused by\ndominant SAW braking agrees well with theory when considering an effective\npressure within the $\\mathbf{E}\\times \\mathbf{B}$ flow region. The existence of\nSAWs in the simulations is demonstrated and the 3D picture of plasmoid drift is\ndiscussed.\n","subjects":["Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}