{"id":"2407.04074","title":"Properties of observable mixed inertial and gravito-inertial modes in\n  {\\gamma} Doradus stars","authors":"Marion Galoy, Fran\\c{c}ois Ligni\\`eres, J\\'er\\^ome Ballot","authorsParsed":[["Galoy","Marion",""],["Lignières","François",""],["Ballot","Jérôme",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 17:31:46 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 15:26:20 GMT"}],"updateDate":"2024-09-18","timestamp":1720114306000,"abstract":"  In {\\gamma} Doradus stars, gravito-inertial modes in the radiative zone and\ninertial modes in the convective core can interact resonantly, which translates\ninto the appearance of dip structures in the period spacing of modes. Those\ndips are information-rich, as they are related to the star core\ncharacteristics. Our aim is to characterise these dips according to stellar\nproperties and thus to develop new seismic diagnostic tools to constrain the\ninternal structure of {\\gamma} Doradus stars, especially their cores. We used\nthe two-dimensional oscillation code TOP to compute sectoral prograde and\naxisymmetric dipolar modes in {\\gamma} Doradus stars at different rotation\nrates and evolutionary stages. We then characterised the dips we obtained by\ntheir width and location on the period spacing diagram. We found that the width\nand the location of the dips depend quasi-linearly on the ratio of the rotation\nrate and the Brunt-V\\\"ais\\\"al\\\"a frequency at the core interface. This allowed\nus to determine empirical relations between the width and location of dips as\nwell as the resonant inertial mode frequency in the core and the\nBrunt-V\\\"ais\\\"al\\\"a frequency at the interface between the convective core and\nthe radiative zone. We propose an approximate theoretical model to support and\ndiscuss these empirical relations. The empirical relations we established could\nbe applied to dips observed in data, which would allow for the estimation of\nfrequencies of resonant inertial modes in the core and of the\nBrunt-V\\\"ais\\\"al\\\"a jump at the interface between the core and the radiative\nzone. As those two parameters are both related to the evolutionary stage of the\nstar, their determination could lead to more accurate estimations of stellar\nages.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}