{"id":"2407.20450","title":"Wind turbine enhancement via Active Flow Control Implementation","authors":"Marc Lahoz, Ahmad Nabhani, Mohammad Saemian and Josep M Bergada","authorsParsed":[["Lahoz","Marc",""],["Nabhani","Ahmad",""],["Saemian","Mohammad",""],["Bergada","Josep M",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 23:07:55 GMT"}],"updateDate":"2024-07-31","timestamp":1722294475000,"abstract":"  The present research aims to enhance the efficiency of a DTU-10MW Horizontal\nAxis Wind Turbine (HAWT) via Active Flow Control (AFC) implementation and using\nSynthetic Jets (SJ). In the initial part of the study the flow around two\nairfoil sections cut along the wing turbine blade and for a wind speed of 10m/s\nis simulated using CFD-2D-RANS-K{\\omega}-SST turbulence model, in order to\nobtain the time averaged boundary layer separation point and the associated\nvortex shedding frequency. This information is used, on a second stage of the\npaper, to set, in one of these two airfoils where the boundary layer is having\nan early separation, two of the AFC parameters while optimizing the remaining\nthree. The optimization is performed employing a parametric analysis and\ndemonstrates that a considerable WT power increase can be obtained when\nmanaging to reattach the former separated boundary layer. This is further\nclarified thanks to the energy assessment presented in the final part of the\npaper. Although the AFC optimization needs to be extended for the rest of the\nblade sections, the procedure outlined in the present research clarifies the\ndifferent steps to be followed to optimize the performance of any HAWT under\nany operating conditions. The Reynolds numbers associated to the respective\nairfoil sections analyzed in the present manuscript are Re = 14.088 e6 and Re =\n14.877 e6, the characteristic length being the corresponding chord length for\neach airfoil.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}