{"id":"2407.11729","title":"Using shrinkage methods to estimate treatment effects in overlapping\n  subgroups in randomized clinical trials with a time-to-event endpoint","authors":"Marcel Wolbers, Mar V\\'azquez Rabu\\~nal, Ke Li, Kaspar Rufibach,\n  Daniel Saban\\'es Bov\\'e","authorsParsed":[["Wolbers","Marcel",""],["Rabuñal","Mar Vázquez",""],["Li","Ke",""],["Rufibach","Kaspar",""],["Bové","Daniel Sabanés",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 13:50:19 GMT"}],"updateDate":"2024-07-17","timestamp":1721137819000,"abstract":"  In randomized controlled trials, forest plots are frequently used to\ninvestigate the homogeneity of treatment effect estimates in subgroups.\nHowever, the interpretation of subgroup-specific treatment effect estimates\nrequires great care due to the smaller sample size of subgroups and the large\nnumber of investigated subgroups. Bayesian shrinkage methods have been proposed\nto address these issues, but they often focus on disjoint subgroups while\nsubgroups displayed in forest plots are overlapping, i.e., each subject appears\nin multiple subgroups. In our approach, we first build a flexible Cox model\nbased on all available observations, including categorical covariates that\nidentify the subgroups of interest and their interactions with the treatment\ngroup variable. We explore both penalized partial likelihood estimation with a\nlasso or ridge penalty for treatment-by-covariate interaction terms, and\nBayesian estimation with a regularized horseshoe prior. One advantage of the\nBayesian approach is the ability to derive credible intervals for shrunken\nsubgroup-specific estimates. In a second step, the Cox model is marginalized to\nobtain treatment effect estimates for all subgroups. We illustrate these\nmethods using data from a randomized clinical trial in follicular lymphoma and\nevaluate their properties in a simulation study. In all simulation scenarios,\nthe overall mean-squared error is substantially smaller for penalized and\nshrinkage estimators compared to the standard subgroup-specific treatment\neffect estimator but leads to some bias for heterogeneous subgroups. We\nrecommend that subgroup-specific estimators, which are typically displayed in\nforest plots, are more routinely complemented by treatment effect estimators\nbased on shrinkage methods. The proposed methods are implemented in the R\npackage bonsaiforest.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HagIkKu9I_xzuXRYtp-lEXMLesZSKPTKDWqa7tMvfQw","pdfSize":"740043"}
