{"id":"2407.19040","title":"A Fault Prognostic System for the Turbine Guide Bearings of a Hydropower\n  Plant Using Long-Short Term Memory (LSTM)","authors":"Yasir Saleem Afridi, Mian Ibad Ali Shah, Adnan Khan, Atia Kareem, Laiq\n  Hasan","authorsParsed":[["Afridi","Yasir Saleem",""],["Shah","Mian Ibad Ali",""],["Khan","Adnan",""],["Kareem","Atia",""],["Hasan","Laiq",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:45:42 GMT"}],"updateDate":"2024-07-30","timestamp":1722019542000,"abstract":"  Hydroelectricity, being a renewable source of energy, globally fulfills the\nelectricity demand. Hence, Hydropower Plants (HPPs) have always been in the\nlimelight of research. The fast-paced technological advancement is enabling us\nto develop state-of-the-art power generation machines. This has not only\nresulted in improved turbine efficiency but has also increased the complexity\nof these systems. In lieu thereof, efficient Operation & Maintenance (O&M) of\nsuch intricate power generation systems has become a more challenging task.\nTherefore, there has been a shift from conventional reactive approaches to more\nintelligent predictive approaches in maintaining the HPPs. The research is\ntherefore targeted to develop an artificially intelligent fault prognostics\nsystem for the turbine bearings of an HPP. The proposed method utilizes the\nLong Short-Term Memory (LSTM) algorithm in developing the model. Initially, the\nmodel is trained and tested with bearing vibration data from a test rig.\nSubsequently, it is further trained and tested with realistic bearing vibration\ndata obtained from an HPP operating in Pakistan via the Supervisory Control and\nData Acquisition (SCADA) system. The model demonstrates highly effective\npredictions of bearing vibration values, achieving a remarkably low RMSE.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}