{"id":"2407.02980","title":"Modelling the mitigation of anti-vaccine opinion propagation to suppress\n  epidemic spread: A computational approach","authors":"Sarah Alahmadi, Rebecca Hoyle, Michael Head, Markus Brede","authorsParsed":[["Alahmadi","Sarah",""],["Hoyle","Rebecca",""],["Head","Michael",""],["Brede","Markus",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 10:24:13 GMT"}],"updateDate":"2024-07-04","timestamp":1720002253000,"abstract":"  Information regarding vaccines from sources such as health services, media,\nand social networks can significantly shape vaccination decisions. In\nparticular, the dissemination of negative information can contribute to vaccine\nhesitancy, thereby exacerbating infectious disease outbreaks. This study\ninvestigates strategies to mitigate anti-vaccine social contagion through\neffective counter-campaigns that disseminate positive vaccine information and\nencourage vaccine uptake, aiming to reduce the size of epidemics. In a coupled\nagent-based model that consists of opinion and disease diffusion processes, we\nexplore and compare different heuristics to design positive campaigns based on\nthe network structure and local presence of negative vaccine attitudes. We\nexamine two campaigning regimes: a static regime with a fixed set of targets,\nand a dynamic regime in which targets can be updated over time. We demonstrate\nthat strategic targeting and engagement with the dynamics of anti-vaccine\ninfluence diffusion in the network can effectively mitigate the spread of\nanti-vaccine sentiment, thereby reducing the epidemic size. However, the\neffectiveness of the campaigns differs across different targeting strategies\nand is impacted by a range of factors. We find that the primary advantage of\nstatic campaigns lies in their capacity to act as an obstacle, preventing the\nclustering of emerging anti-vaccine communities, thereby resulting in smaller\nand unconnected anti-vaccine groups. On the other hand, dynamic campaigns reach\na broader segment of the population and adapt to the evolution of anti-vaccine\ndiffusion, not only protecting susceptible agents from negative influence but\nalso fostering positive propagation within negative regions.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}