{"id":"2407.16871","title":"Trust Your Gut: Comparing Human and Machine Inference from Noisy\n  Visualizations","authors":"Ratanond Koonchanok, Michael E. Papka, Khairi Reda","authorsParsed":[["Koonchanok","Ratanond",""],["Papka","Michael E.",""],["Reda","Khairi",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 22:39:57 GMT"}],"updateDate":"2024-07-25","timestamp":1721774397000,"abstract":"  People commonly utilize visualizations not only to examine a given dataset,\nbut also to draw generalizable conclusions about the underlying models or\nphenomena. Prior research has compared human visual inference to that of an\noptimal Bayesian agent, with deviations from rational analysis viewed as\nproblematic. However, human reliance on non-normative heuristics may prove\nadvantageous in certain circumstances. We investigate scenarios where human\nintuition might surpass idealized statistical rationality. In two experiments,\nwe examine individuals' accuracy in characterizing the parameters of known\ndata-generating models from bivariate visualizations. Our findings indicate\nthat, although participants generally exhibited lower accuracy compared to\nstatistical models, they frequently outperformed Bayesian agents, particularly\nwhen faced with extreme samples. Participants appeared to rely on their\ninternal models to filter out noisy visualizations, thus improving their\nresilience against spurious data. However, participants displayed\noverconfidence and struggled with uncertainty estimation. They also exhibited\nhigher variance than statistical machines. Our findings suggest that analyst\ngut reactions to visualizations may provide an advantage, even when departing\nfrom rationality. These results carry implications for designing visual\nanalytics tools, offering new perspectives on how to integrate statistical\nmodels and analyst intuition for improved inference and decision-making. The\ndata and materials for this paper are available at https://osf.io/qmfv6\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}