{"id":"2407.18704","title":"HII galaxies as standard candles: evolutionary corrections","authors":"Jorge Melnick (1,2) and Eduardo Telles (2) ((1) European Southern\n  Observatory, (2) Observatorio Nacional, Brasil)","authorsParsed":[["Melnick","Jorge",""],["Telles","Eduardo",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 12:37:54 GMT"}],"updateDate":"2024-07-29","timestamp":1721997474000,"abstract":"  Over the past decade the relation between the Balmer-line luminosity of HII\ngalaxies and the velocity width of the emission lines, the L - {\\sigma}\nrelation, has been painstakingly calibrated as a cosmological distance\nindicator with seemingly spectacular results: the Hubble constant and the\nenergy-density of dark energy obtained using the L-{\\sigma} indicator agree\nremarkably well with the values from canonical indicators. Since most of the\nluminosity of these young compact starburst galaxies is emitted by a few narrow\nemission-lines, they can be observed with good precision up redshifts z ~ 7\nwith JWST, making the L - {\\sigma} indicator a potentially unique cosmological\nprobe. However, the precision of the method remains too low to effectively\nconstrain the relevant cosmological parameters, notably the equation of state\nof dark energy. The scatter of the L - {\\sigma} relation is significantly\nlarger than the random observational errors so we do not have a good handle on\nthe systematics of the method. In a previous paper we posited that since the\nionizing radiation of these young galaxies fades rapidly over time-scales of\nonly a few million years, age differences could be the main underlying cause of\nthe scatter. In this paper we explore several different ways to explain the\nscatter of the correlation, but without success. We show that the majority of\nHII galaxies are powered by multiple starbursts of slightly different ages, and\ntherefore that the equivalent widths are not reliable chronometers to correct\nthe luminosities for evolution. Thus, it is not likely that the accuracy of the\nL - {\\sigma} distance indicator can be improved in the near future. Since we do\nnot fully understand neither the systematics nor the underlying physics of the\nL - {\\sigma} relation, using large samples of distant HII galaxies may or may\nnot improve the accuracy of the method.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}