{"id":"2407.18261","title":"Study of Topological Phenomena Through Berry Phase in Classical\n  Nonlinear Elastic Granules","authors":"Kazi T. Mahmood, M. Arif Hasan","authorsParsed":[["Mahmood","Kazi T.",""],["Hasan","M. Arif",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 16:44:27 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 16:02:23 GMT"}],"updateDate":"2024-07-30","timestamp":1720975467000,"abstract":"  The geometric of Berry phase concept, traditionally rooted in quantum\nmechanics, has been found to be increasingly significant in classical\nmechanics, particularly for understanding the dynamics of linear and nonlinear\nsystems. In this study, we demonstrate the controlled accumulation of the Berry\nphase in a classical system using a two-level time-dependent elastic bit,\nanalogous to a quantum bit, within a nonlinear environment generated by a\ntwo-granular network. The nonlinearity of the granular beads is modulated\nthrough the frequency and amplitude of external harmonic excitation, along with\nstatic preloading. By employing the orthonormal basis of the nonlinear\nresponses and mapping the displacement coefficients in Bloch states, we reveal\nhow time influences the manipulation of the elastic bit and its states. Our\nanalytical and experimental investigations uncover the Berry phase's role in\nexposing the various topological characteristics of the classical granular\nnetwork. This research establishes a crucial link between classical and quantum\nrealms via the Berry phase of an elastic bit, with significant implications for\ndecoherence-free and robust data transfer and information processing.\n","subjects":["Physics/Classical Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MPIM3PR3iAo_7tsZM0OlNqa6hUsFEUza9Ai7VAf9g4Q","pdfSize":"1938160","objectId":"0x5733faf530c80ec019022198288b3935fe2f02fad077e32cff39bce17adb6206","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
