{"id":"2407.18826","title":"Effect of group-velocity dispersion on the generation of multimode\n  pulsed squeezed light in a synchronously pumped optical parametric oscillator","authors":"Valentin Averchenko, Danil Malyshev, Kirill Tikhonov","authorsParsed":[["Averchenko","Valentin",""],["Malyshev","Danil",""],["Tikhonov","Kirill",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 15:43:32 GMT"}],"updateDate":"2024-07-29","timestamp":1722008612000,"abstract":"  Parametric down-conversion in a nonlinear crystal is a widely employed\ntechnique for generating quadrature squeezed light with multiple modes, which\nfinds applications in quantum metrology, quantum information and communication.\nHere we study the generation of temporally multimode pulsed squeezed light in a\nsynchronously pumped optical parametric oscillator (SPOPO) operating below the\noscillation threshold, while considering the presence of non-compensated\nintracavity group-velocity dispersion. Based on the developed timedomain model\nof the system, we show that the dispersion results in mode-dependent detuning\nof the broadband supermodes of the pulsed parametric process from the cavity\nresonance, as well as linear coupling between these supermodes. With the\nperturbation theory up to the second order in the coupling coefficients between\nmodes, we obtained a solution for the supermode amplitudes given an arbitrary\nnumber of modes and pump level. The dispersion affects the quantum state of the\nsupermodes by influencing their squeezing level and the rotation of the\nsqueezing ellipse. It also affects the entanglement among the supermodes,\nleading to reduced suppression of shot noise level as measured in the balanced\nhomodyne detection scheme. Furthermore, our study highlights the potential of\nSPOPO with group-velocity dispersion as a testbench for experimental\ninvestigations of multimode effects in linearly evanescent coupled parametric\noscillators.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}