{"id":"2407.05992","title":"Predicting the Galactic population of free-floating planets from\n  realistic initial conditions","authors":"Gavin A. L. Coleman, William DeRocco","authorsParsed":[["Coleman","Gavin A. L.",""],["DeRocco","William",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 14:39:17 GMT"}],"updateDate":"2024-07-09","timestamp":1720449557000,"abstract":"  We present the first prediction for the mass distribution function of\nGalactic free-floating planets (FFPs) that aims to accurately include the\nrelative contributions of multiple formation pathways and stellar populations.\nWe derive our predicted distribution from dedicated simulations of planet\nbirth, growth, migration, and ejection around circumbinary systems and extend\nthese results to also include the contributions from single and wide binary\nsystems. Our resulting FFP mass distribution shows several distinct features,\nincluding a strong peak at $\\sim 8 M_{\\oplus}$ arising from the transition\nbetween pebble and gas accretion regimes and a trough at $\\sim 1 M_{\\oplus}$\ndue to the shift in the dominant ejection process from planet-planet scattering\nto ejection through interactions with stars in circumbinary systems. We find\nthat interactions with the central binary in close circumbinary systems are\nlikely the dominant progenitor for FFPs more massive than Earth, leading to a\nsteep power-law dependence in mass that agrees well with existing observations.\nIn contrast, we find planet-planet scattering events in single and wide binary\nsystems likely produce the majority of planets at Mars mass and below,\nresulting in a shallower power-law dependence. Our results suggest that\nexisting extrapolations into the sub-terrestrial mass range may significantly\noverestimate the true FFP abundance. The features we predict in the mass\ndistribution of FFPs will be detectable by upcoming space-based microlensing\nsurveys and, if observed, will provide key insight into the origins of FFPs and\nthe environments in which they form.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}