{"id":"2407.20610","title":"Constrained motion of self-propelling eccentric disks linked by a spring","authors":"Tian-liang Xu, Chao-ran Qin, Bin Tang, Jin-cheng Gao, Jiankang Zhou,\n  Kang Chen, Tian Hui Zhang, Wen-de Tian","authorsParsed":[["Xu","Tian-liang",""],["Qin","Chao-ran",""],["Tang","Bin",""],["Gao","Jin-cheng",""],["Zhou","Jiankang",""],["Chen","Kang",""],["Zhang","Tian Hui",""],["Tian","Wen-de",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 07:36:10 GMT"}],"updateDate":"2024-07-31","timestamp":1722324970000,"abstract":"  It has been supposed that the interplay of elasticity and activity plays a\nkey role in triggering the non-equilibrium behaviors in biological systems.\nHowever, the experimental model system is missing to investigate the\nspatiotemporally dynamical phenomena. Here, a model system of an active chain,\nwhere active eccentric-disks are linked by a spring, is designed to study the\ninterplay of activity, elasticity, and friction. Individual active chain\nexhibits longitudinal and transverse motion, however, it starts to self-rotate\nwhen pinning one end, and self-beats when clamping one end. Additionally, our\neccentric-disk model can qualitatively reproduce such behaviors and explain the\nunusual self-rotation of the first disk around its geometric center. Further,\nthe structure and dynamics of long chains were studied via simulations without\nsteric interactions. It was found that hairpin conformation emerges in free\nmotion, while in the constrained motions, the rotational and beating\nfrequencies scale with the flexure number (the ratio of self-propelling force\nto bending rigidity), ~4/3. Scaling analysis suggests that it results from the\nbalance between activity and energy dissipation. Our findings show that\ntopological constraints play a vital role in non-equilibrium synergy behavior.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dGcqA-IRs_u71Dz5o2KD3AM0C1GrUmhDNEg6W81NppU","pdfSize":"2903790"}
