{"id":"2407.17003","title":"Progressive Query Refinement Framework for Bird's-Eye-View Semantic\n  Segmentation from Surrounding Images","authors":"Dooseop Choi and Jungyu Kang and Taeghyun An and Kyounghwan Ahn and\n  KyoungWook Min","authorsParsed":[["Choi","Dooseop",""],["Kang","Jungyu",""],["An","Taeghyun",""],["Ahn","Kyounghwan",""],["Min","KyoungWook",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 05:00:31 GMT"}],"updateDate":"2024-07-25","timestamp":1721797231000,"abstract":"  Expressing images with Multi-Resolution (MR) features has been widely adopted\nin many computer vision tasks. In this paper, we introduce the MR concept into\nBird's-Eye-View (BEV) semantic segmentation for autonomous driving. This\nintroduction enhances our model's ability to capture both global and local\ncharacteristics of driving scenes through our proposed residual learning.\nSpecifically, given a set of MR BEV query maps, the lowest resolution query map\nis initially updated using a View Transformation (VT) encoder. This updated\nquery map is then upscaled and merged with a higher resolution query map to\nundergo further updates in a subsequent VT encoder. This process is repeated\nuntil the resolution of the updated query map reaches the target. Finally, the\nlowest resolution map is added to the target resolution to generate the final\nquery map. During training, we enforce both the lowest and final query maps to\nalign with the ground-truth BEV semantic map to help our model effectively\ncapture the global and local characteristics. We also propose a visual feature\ninteraction network that promotes interactions between features across images\nand across feature levels, thus highly contributing to the performance\nimprovement. We evaluate our model on a large-scale real-world dataset. The\nexperimental results show that our model outperforms the SOTA models in terms\nof IoU metric. Codes are available at\nhttps://github.com/d1024choi/ProgressiveQueryRefineNet\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}