{"id":"2407.08240","title":"Leveraging LLMs to Predict Affective States via Smartphone Sensor\n  Features","authors":"Tianyi Zhang, Songyan Teng, Hong Jia, Simon D'Alfonso","authorsParsed":[["Zhang","Tianyi",""],["Teng","Songyan",""],["Jia","Hong",""],["D'Alfonso","Simon",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 07:37:52 GMT"}],"updateDate":"2024-07-12","timestamp":1720683472000,"abstract":"  As mental health issues for young adults present a pressing public health\nconcern, daily digital mood monitoring for early detection has become an\nimportant prospect. An active research area, digital phenotyping, involves\ncollecting and analysing data from personal digital devices such as smartphones\n(usage and sensors) and wearables to infer behaviours and mental health. Whilst\nthis data is standardly analysed using statistical and machine learning\napproaches, the emergence of large language models (LLMs) offers a new approach\nto make sense of smartphone sensing data. Despite their effectiveness across\nvarious domains, LLMs remain relatively unexplored in digital mental health,\nparticularly in integrating mobile sensor data. Our study aims to bridge this\ngap by employing LLMs to predict affect outcomes based on smartphone sensing\ndata from university students. We demonstrate the efficacy of zero-shot and\nfew-shot embedding LLMs in inferring general wellbeing. Our findings reveal\nthat LLMs can make promising predictions of affect measures using solely\nsmartphone sensing data. This research sheds light on the potential of LLMs for\naffective state prediction, emphasizing the intricate link between smartphone\nbehavioral patterns and affective states. To our knowledge, this is the first\nwork to leverage LLMs for affective state prediction and digital phenotyping\ntasks.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fVq0UTw2ets_KjGdmf5jDJOOqPXogZBcxF0skaJdEgc","pdfSize":"665506"}
