{"id":"2407.20119","title":"Adaptive Self-supervised Robust Clustering for Unstructured Data with\n  Unknown Cluster Number","authors":"Chen-Lu Ding, Jiancan Wu, Wei Lin, Shiyang Shen, Xiang Wang, Yancheng\n  Yuan","authorsParsed":[["Ding","Chen-Lu",""],["Wu","Jiancan",""],["Lin","Wei",""],["Shen","Shiyang",""],["Wang","Xiang",""],["Yuan","Yancheng",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:51:09 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 06:33:48 GMT"}],"updateDate":"2024-07-31","timestamp":1722268269000,"abstract":"  We introduce a novel self-supervised deep clustering approach tailored for\nunstructured data without requiring prior knowledge of the number of clusters,\ntermed Adaptive Self-supervised Robust Clustering (ASRC). In particular, ASRC\nadaptively learns the graph structure and edge weights to capture both local\nand global structural information. The obtained graph enables us to learn\nclustering-friendly feature representations by an enhanced graph auto-encoder\nwith contrastive learning technique. It further leverages the clustering\nresults adaptively obtained by robust continuous clustering (RCC) to generate\nprototypes for negative sampling, which can further contribute to promoting\nconsistency among positive pairs and enlarging the gap between positive and\nnegative samples. ASRC obtains the final clustering results by applying RCC to\nthe learned feature representations with their consistent graph structure and\nedge weights. Extensive experiments conducted on seven benchmark datasets\ndemonstrate the efficacy of ASRC, demonstrating its superior performance over\nother popular clustering models. Notably, ASRC even outperforms methods that\nrely on prior knowledge of the number of clusters, highlighting its\neffectiveness in addressing the challenges of clustering unstructured data.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}