{"id":"2407.08242","title":"Efficient Reinforcement Learning On Passive RRAM Crossbar Array","authors":"Arjun Tyagi, Shubham Sahay","authorsParsed":[["Tyagi","Arjun",""],["Sahay","Shubham",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 07:38:14 GMT"}],"updateDate":"2024-07-12","timestamp":1720683494000,"abstract":"  The unprecedented growth in the field of machine learning has led to the\ndevelopment of deep neuromorphic networks trained on labelled dataset with\ncapability to mimic or even exceed human capabilities. However, for\napplications involving continuous decision making in unknown environments, such\nas rovers for space exploration, robots, unmanned aerial vehicles, etc.,\nexplicit supervision and generation of labelled data set is extremely difficult\nand expensive. Reinforcement learning (RL) allows the agents to take decisions\nwithout any (human/external) supervision or training on labelled dataset.\nHowever, the conventional implementations of RL on advanced digital CPUs/GPUs\nincur a significantly large power dissipation owing to their inherent\nvon-Neumann architecture. Although crossbar arrays of emerging non-volatile\nmemories such as resistive (R)RAMs with their innate capability to perform\nenergy-efficient in situ multiply-accumulate operation appear promising for\nQ-learning-based RL implementations, their limited endurance restricts their\napplication in practical RL systems with overwhelming weight updates. To\naddress this issue and realize the true potential of RRAM-based RL\nimplementations, in this work, for the first time, we perform an\nalgorithm-hardware co-design and propose a novel implementation of Monte Carlo\n(MC) RL algorithm on passive RRAM crossbar array. We analyse the performance of\nthe proposed MC RL implementation on the classical cart-pole problem and\ndemonstrate that it not only outperforms the prior digital and active\n1-Transistor-1-RRAM (1T1R)-based implementations by more than five orders of\nmagnitude in terms of area but is also robust against the spatial and temporal\nvariations and endurance failure of RRAMs.\n","subjects":["Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"KFD_k7CE7K2r7Day1SRDFFI7e_fZoXykqbDVXqYeXoQ","pdfSize":"726913"}
