{"id":"2407.16763","title":"Entanglement dynamics from universal low-lying modes","authors":"Shreya Vardhan and Sanjay Moudgalya","authorsParsed":[["Vardhan","Shreya",""],["Moudgalya","Sanjay",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 18:00:16 GMT"}],"updateDate":"2024-07-25","timestamp":1721757616000,"abstract":"  Information-theoretic quantities such as Renyi entropies show a remarkable\nuniversality in their late-time behaviour across a variety of chaotic quantum\nmany-body systems. Understanding how such common features emerge from very\ndifferent microscopic dynamics remains an important challenge. In this work, we\naddress this question in a class of Brownian models with random time-dependent\nHamiltonians and a variety of different microscopic couplings. In any such\nmodel, the Lorentzian time-evolution of the $n$-th Renyi entropy can be mapped\nto evolution by a Euclidean Hamiltonian on 2$n$ copies of the system. We\nprovide evidence that in systems with no symmetries, the low-energy excitations\nof the Euclidean Hamiltonian are universally given by a gapped\nquasiparticle-like band. The eigenstates in this band are plane waves of\nlocally dressed domain walls between ferromagnetic ground states associated\nwith two permutations in the symmetric group $S_n$. These excitations give rise\nto the membrane picture of entanglement growth, with the membrane tension\ndetermined by their dispersion relation. We establish this structure in a\nvariety of cases using analytical perturbative methods and numerical\nvariational techniques, and extract the associated dispersion relations and\nmembrane tensions for the second and third Renyi entropies. For the third Renyi\nentropy, we argue that phase transitions in the membrane tension as a function\nof velocity are needed to ensure that physical constraints on the membrane\ntension are satisfied. Overall, this structure provides an understanding of\nentanglement dynamics in terms of a universal set of gapped low-lying modes,\nwhich may also apply to systems with time-independent Hamiltonians.\n","subjects":["Condensed Matter/Statistical Mechanics","Condensed Matter/Strongly Correlated Electrons","Physics/High Energy Physics - Theory","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}