{"id":"2407.04620","title":"Learning to (Learn at Test Time): RNNs with Expressive Hidden States","authors":"Yu Sun, Xinhao Li, Karan Dalal, Jiarui Xu, Arjun Vikram, Genghan\n  Zhang, Yann Dubois, Xinlei Chen, Xiaolong Wang, Sanmi Koyejo, Tatsunori\n  Hashimoto, Carlos Guestrin","authorsParsed":[["Sun","Yu",""],["Li","Xinhao",""],["Dalal","Karan",""],["Xu","Jiarui",""],["Vikram","Arjun",""],["Zhang","Genghan",""],["Dubois","Yann",""],["Chen","Xinlei",""],["Wang","Xiaolong",""],["Koyejo","Sanmi",""],["Hashimoto","Tatsunori",""],["Guestrin","Carlos",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 16:23:20 GMT"},{"version":"v2","created":"Sun, 11 Aug 2024 00:42:18 GMT"}],"updateDate":"2024-08-13","timestamp":1720196600000,"abstract":"  Self-attention performs well in long context but has quadratic complexity.\nExisting RNN layers have linear complexity, but their performance in long\ncontext is limited by the expressive power of their hidden state. We propose a\nnew class of sequence modeling layers with linear complexity and an expressive\nhidden state. The key idea is to make the hidden state a machine learning model\nitself, and the update rule a step of self-supervised learning. Since the\nhidden state is updated by training even on test sequences, our layers are\ncalled Test-Time Training (TTT) layers. We consider two instantiations:\nTTT-Linear and TTT-MLP, whose hidden state is a linear model and a two-layer\nMLP respectively. We evaluate our instantiations at the scale of 125M to 1.3B\nparameters, comparing with a strong Transformer and Mamba, a modern RNN. Both\nTTT-Linear and TTT-MLP match or exceed the baselines. Similar to Transformer,\nthey can keep reducing perplexity by conditioning on more tokens, while Mamba\ncannot after 16k context. With preliminary systems optimization, TTT-Linear is\nalready faster than Transformer at 8k context and matches Mamba in wall-clock\ntime. TTT-MLP still faces challenges in memory I/O, but shows larger potential\nin long context, pointing to a promising direction for future research.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}