{"id":"2407.12654","title":"Sampling with a Black Box: Faster Parameterized Approximation Algorithms\n  for Vertex Deletion Problems","authors":"Bar{\\i}\\c{s} Can Esmer, Ariel Kulik","authorsParsed":[["Esmer","Barış Can",""],["Kulik","Ariel",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:37:31 GMT"}],"updateDate":"2024-07-18","timestamp":1721230651000,"abstract":"  In this paper we introduce Sampling with a Black Box, a generic technique for\nthe design of parameterized approximation algorithms for vertex deletion\nproblems (e.g., Vertex Cover, Feedback Vertex Set, etc.). The technique relies\non two components:\n  $\\bullet$ A Sampling Step. A polynomial time randomized algorithm which given\na graph $G$ returns a random vertex $v$ such that the optimum of $G\\setminus\n\\{v\\}$ is smaller by $1$ than the optimum of $G$ with some prescribed\nprobability $q$. We show such algorithms exists for multiple vertex deletion\nproblems.\n  $\\bullet$ A Black Box algorithm which is either an exact parameterized\nalgorithm or a polynomial time approximation algorithm.\n  Our technique combines these two components together. The sampling step is\napplied iteratively to remove vertices from the input graph, and then the\nsolution is extended using the black box algorithm. The process is repeated\nsufficiently many times so that the target approximation ratio is attained with\na constant probability. The main novelty of our work lies in the analysis of\nthe framework and the optimization of the parameters it uses.\n  We use the technique to derive parameterized approximation algorithm for\nseveral vertex deletion problems, including Feedback Vertex Set, $d$-Hitting\nSet and $\\ell$-Path Vertex Cover. In particular, for every approximation ratio\n$1<\\beta<2$, we attain a parameterized $\\beta$-approximation for Feedback\nVertex Set which is faster than the parameterized $\\beta$-approximation of\n[Jana, Lokshtanov, Mandal, Rai and Saurabh, MFCS 23']. Furthermore, our\nalgorithms are always faster than the algorithms attained using Fidelity\nPreserving Transformations [Fellows, Kulik, Rosamond, and Shachnai, JCSS 18'].\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mnTRgiLZRWd8IfDWXbjyo4XFNgdpabrq7VK0JLkosWE","pdfSize":"1046992"}
