{"id":"2407.05211","title":"Fault-tolerant Network Design for Bounded Delay Data Transfer from PMUs\n  to Control Center","authors":"A. Sen, C. Sumnicht, S. Adeniye, D. Patel, S. Choudhuri","authorsParsed":[["Sen","A.",""],["Sumnicht","C.",""],["Adeniye","S.",""],["Patel","D.",""],["Choudhuri","S.",""]],"versions":[{"version":"v1","created":"Wed, 24 Apr 2024 23:09:35 GMT"}],"updateDate":"2024-07-09","timestamp":1714000175000,"abstract":"  Communication network design for monitoring the state of an electric power\ngrid has received significant attention in recent years. In order to measure\nstability of a power grid, it is imperative that measurement data collected by\nthe Phasor Measurement Units (PMUs) located at the Sub-Stations (SS) must\narrive at the Control Center (CC) within a specified delay threshold delta. In\nearlier papers we formalized the design problem as the Rooted Delay Constrained\nMinimum Spanning Tree (RDCMST) problem. However, RDCMST does not provide any\nfault-tolerance capability, as failure of just one communication link would\nprevent PMU data from reaching the CC. In this paper, we study the optimal cost\nnetwork design problem with fault tolerance capability. In our model the PMU\ndata from the SSs will have a path to reach the CC in spite of the failure of\nat most R links within the delay threshold delta. If R = 1, each SS will have\ntwo link disjoint paths of length at most delta to the CC. In other words, each\nSS will be on a cycle with the CC. We refer to this problem as the Rooted Delay\nConstrained Minimum Cost Cycle Cover (RDCMCCC) problem. We provide\ncomputational complexity analysis, an Integer Linear Programming formulation to\nfind the optimal solution and a heuristic based on the sweeping technique. We\nevaluate the performance of our heuristic with real substation location data of\nArizona.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}