{"id":"2407.12633","title":"Bayesian spatial functional data clustering: applications in disease\n  surveillance","authors":"Ruiman Zhong, Erick A. Chac\\'on-Montalv\\'an, Paula Moraga","authorsParsed":[["Zhong","Ruiman",""],["Chacón-Montalván","Erick A.",""],["Moraga","Paula",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:01:33 GMT"}],"updateDate":"2024-07-18","timestamp":1721228493000,"abstract":"  Our method extends the application of random spanning trees to cases where\nthe response variable belongs to the exponential family, making it suitable for\na wide range of real-world scenarios, including non-Gaussian likelihoods. The\nproposed model addresses the limitations of previous spatial clustering methods\nby allowing all within-cluster model parameters to be cluster-specific, thus\noffering greater flexibility. Additionally, we propose a Bayesian inference\nalgorithm that overcomes the computational challenges associated with the\nreversible jump Markov chain Monte Carlo (RJ-MCMC) algorithm by employing\ncomposition sampling and the integrated nested Laplace approximation (INLA) to\ncompute the marginal distribution necessary for the acceptance probability.\nThis enhancement improves the mixing and feasibility of Bayesian inference for\ncomplex models. We demonstrate the effectiveness of our approach through\nsimulation studies and apply it to real-world disease mapping applications:\nCOVID-19 in the United States of America, and dengue fever in the states of\nMinas Gerais and S\\~ao Paulo, Brazil. Our results highlight the model's\ncapability to uncover meaningful spatial patterns and temporal dynamics in\ndisease outbreaks, providing valuable insights for public health\ndecision-making and resource allocation.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ywpv52lN553oHNF00Sz7eCO_-1gKt449-xHScVptuc8","pdfSize":"14503039","objectId":"0xc31b65412ebd6d1a13fdf41f4ebf4a11c0252e6fecabf552e5a8057085cf0a90","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
