{"id":"2407.08411","title":"CLEO: Continual Learning of Evolving Ontologies","authors":"Shishir Muralidhara, Saqib Bukhari, Georg Schneider, Didier Stricker,\n  Ren\\'e Schuster","authorsParsed":[["Muralidhara","Shishir",""],["Bukhari","Saqib",""],["Schneider","Georg",""],["Stricker","Didier",""],["Schuster","René",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 11:32:33 GMT"}],"updateDate":"2024-07-12","timestamp":1720697553000,"abstract":"  Continual learning (CL) addresses the problem of catastrophic forgetting in\nneural networks, which occurs when a trained model tends to overwrite\npreviously learned information, when presented with a new task. CL aims to\ninstill the lifelong learning characteristic of humans in intelligent systems,\nmaking them capable of learning continuously while retaining what was already\nlearned. Current CL problems involve either learning new domains\n(domain-incremental) or new and previously unseen classes (class-incremental).\nHowever, general learning processes are not just limited to learning\ninformation, but also refinement of existing information. In this paper, we\ndefine CLEO - Continual Learning of Evolving Ontologies, as a new incremental\nlearning setting under CL to tackle evolving classes. CLEO is motivated by the\nneed for intelligent systems to adapt to real-world ontologies that change over\ntime, such as those in autonomous driving. We use Cityscapes, PASCAL VOC, and\nMapillary Vistas to define the task settings and demonstrate the applicability\nof CLEO. We highlight the shortcomings of existing CIL methods in adapting to\nCLEO and propose a baseline solution, called Modelling Ontologies (MoOn). CLEO\nis a promising new approach to CL that addresses the challenge of evolving\nontologies in real-world applications. MoOn surpasses previous CL approaches in\nthe context of CLEO.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}