{"id":"2407.05122","title":"Irregular Fixation: I. Fixed points and librating orbits of the Brown\n  Hamiltonian","authors":"Evgeni Grishin","authorsParsed":[["Grishin","Evgeni",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 16:17:10 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 00:46:46 GMT"}],"updateDate":"2024-07-29","timestamp":1720282630000,"abstract":"  In hierarchical triple systems, the inner binary is slowly perturbed by a\ndistant companion, giving rise to large-scale oscillations in eccentricity and\ninclination, known as von-Zeipel-Lidov-Kozai (ZLK) oscillations. Stable systems\nwith a mild hierarchy, where the period ratio is not too small, require an\nadditional corrective term, known as the Brown Hamiltonian, to adequately\naccount for their long-term evolution. Although the Brown Hamiltonian has been\nused to accurately describe the highly eccentric systems on circulating orbits\nwhere the periapse completes a complete revolution, the analysis near its\nelliptical fixed points had been overlooked. We derive analytically the\nmodified fixed points including the Brown Hamiltonian and analyse its librating\norbits (where the periapse motion is limited in range). We compare our result\nto the direct three-body integrations of millions of orbits and discuss the\nregimes of validity. We numerically discover the regions of orbital\ninstability, allowed and forbidden librating zones with a complex, fractal,\nstructure. The retrograde orbits, where the mutual inclination is $\\iota > 90\\\n\\rm deg$, are more stable and allowed to librate for larger areas of the\nparameter space. We find numerical fits for the librating-circulating boundary.\nFinally, we discuss the astrophysical implications for systems of satellites,\nstars and compact objects. In a companion paper (paper II), we apply our\nformalism to the orbits of irregular satellites around giant planets.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics","Mathematics/Dynamical Systems"],"license":"http://creativecommons.org/licenses/by/4.0/"}