{"id":"2407.11936","title":"Thermal Imaging and Radar for Remote Sleep Monitoring of Breathing and\n  Apnea","authors":"Kai Del Regno, Alexander Vilesov, Adnan Armouti, Anirudh Bindiganavale\n  Harish, Selim Emir Can, Ashley Kita, Achuta Kadambi","authorsParsed":[["Del Regno","Kai",""],["Vilesov","Alexander",""],["Armouti","Adnan",""],["Harish","Anirudh Bindiganavale",""],["Can","Selim Emir",""],["Kita","Ashley",""],["Kadambi","Achuta",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 17:26:50 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 06:43:51 GMT"}],"updateDate":"2024-08-08","timestamp":1721150810000,"abstract":"  Polysomnography (PSG), the current gold standard method for monitoring and\ndetecting sleep disorders, is cumbersome and costly. At-home testing solutions,\nknown as home sleep apnea testing (HSAT), exist. However, they are\ncontact-based, a feature which limits the ability of some patient populations\nto tolerate testing and discourages widespread deployment. Previous work on\nnon-contact sleep monitoring for sleep apnea detection either estimates\nrespiratory effort using radar or nasal airflow using a thermal camera, but has\nnot compared the two or used them together. We conducted a study on 10\nparticipants, ages 34 - 78, with suspected sleep disorders using a hardware\nsetup with a synchronized radar and thermal camera. We show the first\ncomparison of radar and thermal imaging for sleep monitoring, and find that our\nthermal imaging method outperforms radar significantly. Our thermal imaging\nmethod detects apneas with an accuracy of 0.99, a precision of 0.68, a recall\nof 0.74, an F1 score of 0.71, and an intra-class correlation of 0.70; our radar\nmethod detects apneas with an accuracy of 0.83, a precision of 0.13, a recall\nof 0.86, an F1 score of 0.22, and an intra-class correlation of 0.13. We also\npresent a novel proposal for classifying obstructive and central sleep apnea by\nleveraging a multimodal setup. This method could be used accurately detect and\nclassify apneas during sleep with non-contact sensors, thereby improving\ndiagnostic capacities in patient populations unable to tolerate current\ntechnology.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"toM_mbY3kNrZbD3v0qytFeVmIiM3WfxI7ITgY6hmF3Q","pdfSize":"7400727"}
