{"id":"2407.01007","title":"GMT: A Robust Global Association Model for Multi-Target Multi-Camera\n  Tracking","authors":"Huijie Fan, Tinghui Zhao, Qiang Wang, Baojie Fan, Yandong Tang,\n  LianQing Liu","authorsParsed":[["Fan","Huijie",""],["Zhao","Tinghui",""],["Wang","Qiang",""],["Fan","Baojie",""],["Tang","Yandong",""],["Liu","LianQing",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 06:39:14 GMT"}],"updateDate":"2024-07-02","timestamp":1719815954000,"abstract":"  In the task of multi-target multi-camera (MTMC) tracking of pedestrians, the\ndata association problem is a key issue and main challenge, especially with\ncomplications arising from camera movements, lighting variations, and\nobstructions. However, most MTMC models adopt two-step approaches, thus heavily\ndepending on the results of the first-step tracking in practical applications.\nMoreover, the same targets crossing different cameras may exhibit significant\nappearance variations, which further increases the difficulty of cross-camera\nmatching. To address the aforementioned issues, we propose a global online MTMC\ntracking model that addresses the dependency on the first tracking stage in\ntwo-step methods and enhances cross-camera matching. Specifically, we propose a\ntransformer-based global MTMC association module to explore target associations\nacross different cameras and frames, generating global trajectories directly.\nAdditionally, to integrate the appearance and spatio-temporal features of\ntargets, we propose a feature extraction and fusion module for MTMC tracking.\nThis module enhances feature representation and establishes correlations\nbetween the features of targets across multiple cameras. To accommodate high\nscene diversity and complex lighting condition variations, we have established\nthe VisionTrack dataset, which enables the development of models that are more\ngeneralized and robust to various environments. Our model demonstrates\nsignificant improvements over comparison methods on the VisionTrack dataset and\nothers.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}