{"id":"2407.08093","title":"MemWarp: Discontinuity-Preserving Cardiac Registration with Memorized\n  Anatomical Filters","authors":"Hang Zhang, Xiang Chen, Renjiu Hu, Dongdong Liu, Gaolei Li, and\n  Rongguang Wang","authorsParsed":[["Zhang","Hang",""],["Chen","Xiang",""],["Hu","Renjiu",""],["Liu","Dongdong",""],["Li","Gaolei",""],["Wang","Rongguang",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 23:42:29 GMT"}],"updateDate":"2024-07-12","timestamp":1720654949000,"abstract":"  Many existing learning-based deformable image registration methods impose\nconstraints on deformation fields to ensure they are globally smooth and\ncontinuous. However, this assumption does not hold in cardiac image\nregistration, where different anatomical regions exhibit asymmetric motions\nduring respiration and movements due to sliding organs within the chest.\nConsequently, such global constraints fail to accommodate local discontinuities\nacross organ boundaries, potentially resulting in erroneous and unrealistic\ndisplacement fields. In this paper, we address this issue with MemWarp, a\nlearning framework that leverages a memory network to store prototypical\ninformation tailored to different anatomical regions. MemWarp is different from\nearlier approaches in two main aspects: firstly, by decoupling feature\nextraction from similarity matching in moving and fixed images, it facilitates\nmore effective utilization of feature maps; secondly, despite its capability to\npreserve discontinuities, it eliminates the need for segmentation masks during\nmodel inference. In experiments on a publicly available cardiac dataset, our\nmethod achieves considerable improvements in registration accuracy and\nproducing realistic deformations, outperforming state-of-the-art methods with a\nremarkable 7.1\\% Dice score improvement over the runner-up semi-supervised\nmethod. Source code will be available at https://github.com/tinymilky/Mem-Warp.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}