{"id":"2407.07929","title":"Unified Gas-Kinetic Wave-Particle Method for Multiscale Flow Simulation\n  of Partially Ionized Plasma","authors":"Zhigang Pu, Kun Xu","authorsParsed":[["Pu","Zhigang",""],["Xu","Kun",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 01:35:59 GMT"}],"updateDate":"2024-07-12","timestamp":1720575359000,"abstract":"  The Unified Gas-Kinetic Wave-Particle (UGKWP) method is constructed for\npartially ionized plasma (PIP). This method possesses both multiscale and\nunified preserving (UP) properties. The multiscale property allows the method\nto capture a wide range of plasma physics, from the particle transport in the\nkinetic regime to the two-fluid and magnetohydrodynamics (MHD) in the near\ncontinuum regimes, with the variation of local cell Knudsen number and\nnormalized Larmor radius.The unified preserving property ensures that the\nnumerical time step is not limited by the particle collision time in the\ncontinuum regime for the capturing of dissipative macroscopic solutions of the\nresistivity, Hall-effect, and all the way to the ideal MHD equations.The UGKWP\nis clearly distinguishable from the classical single scale\nParticle-in-Cell/Monte Carlo Collision (PIC/MCC) methods.The UGKWP method\ncombines the evolution of microscopic velocity distribution with the evolution\nof macroscopic mean field quantities, granting it UP properties. Moreover, the\ntime step in UGKWP is not constrained by the plasma cyclotron period through\nthe Crank-Nicolson scheme for fluid and electromagnetic field interactions. The\nmomentum and energy exchange between different species is approximated by the\nAndries-Aoki-Perthame (AAP) model. Overall, the UGKWP method enables a smooth\ntransition from the PIC method in the rarefied regime to the MHD solvers in the\ncontinuum regime. This method has been extensively tested on a variety of\nphenomena ranging from kinetic Landau damping to the macroscopic flow problems,\nsuch as the Brio-Wu shock tube, Orszag-Tang vortex, and Geospace Environmental\nModeling (GEM) magnetic reconnection. These tests demonstrate that the proposed\nmethod can capture the fundamental features of PIP across different scales\nseamlessly.\n","subjects":["Physics/Computational Physics","Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}