{"id":"2407.09899","title":"DexGrasp-Diffusion: Diffusion-based Unified Functional Grasp Synthesis\n  Pipeline for Multi-Dexterous Robotic Hands","authors":"Zhengshen Zhang, Lei Zhou, Chenchen Liu, Zhiyang Liu, Chengran Yuan,\n  Sheng Guo, Ruiteng Zhao, Marcelo H. Ang Jr., and Francis EH Tay","authorsParsed":[["Zhang","Zhengshen",""],["Zhou","Lei",""],["Liu","Chenchen",""],["Liu","Zhiyang",""],["Yuan","Chengran",""],["Guo","Sheng",""],["Zhao","Ruiteng",""],["Ang","Marcelo H.","Jr."],["Tay","Francis EH",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 14:29:12 GMT"}],"updateDate":"2024-07-16","timestamp":1720880952000,"abstract":"  The versatility and adaptability of human grasping catalyze advancing\ndexterous robotic manipulation. While significant strides have been made in\ndexterous grasp generation, current research endeavors pivot towards optimizing\nobject manipulation while ensuring functional integrity, emphasizing the\nsynthesis of functional grasps following desired affordance instructions. This\npaper addresses the challenge of synthesizing functional grasps tailored to\ndiverse dexterous robotic hands by proposing DexGrasp-Diffusion, an end-to-end\nmodularized diffusion-based pipeline. DexGrasp-Diffusion integrates\nMultiHandDiffuser, a novel unified data-driven diffusion model for\nmulti-dexterous hands grasp estimation, with DexDiscriminator, which employs a\nPhysics Discriminator and a Functional Discriminator with open-vocabulary\nsetting to filter physically plausible functional grasps based on object\naffordances. The experimental evaluation conducted on the MultiDex dataset\nprovides substantiating evidence supporting the superior performance of\nMultiHandDiffuser over the baseline model in terms of success rate, grasp\ndiversity, and collision depth. Moreover, we demonstrate the capacity of\nDexGrasp-Diffusion to reliably generate functional grasps for household objects\naligned with specific affordance instructions.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}