{"id":"2407.02809","title":"Distinguishing Carrier Transport and Interfacial Recombination at\n  Perovskite-Transport Layer Interfaces Using Ultrafast Spectroscopy and\n  Numerical Simulation","authors":"Edward Butler-Caddle, K.D.G. Imalka Jayawardena, Anjana Wijesekara,\n  Rebecca L Milot and James Lloyd-Hughes","authorsParsed":[["Butler-Caddle","Edward",""],["Jayawardena","K. D. G. Imalka",""],["Wijesekara","Anjana",""],["Milot","Rebecca L",""],["Lloyd-Hughes","James",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 05:00:06 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 11:39:23 GMT"}],"updateDate":"2024-09-04","timestamp":1719982806000,"abstract":"  In perovskite solar cells, photovoltaic action is created by charge transport\nlayers (CTLs) either side of the light-absorbing metal halide perovskite\nsemiconductor. Hence, the rates for desirable charge extraction and unwanted\ninterfacial recombination at the perovskite-CTL interfaces play a critical role\nfor device efficiency. Here, the electrical properties of perovskite-CTL\nbilayer heterostructures are obtained using ultrafast THz and optical studies\nof the charge carrier dynamics after pulsed photoexcitation, combined with a\nphysical model of charge carrier transport that includes the prominent\nCoulombic forces that arise after selective charge extraction into a CTL, and\ncross-interfacial recombination. The charge extraction velocity at the\ninterface and the ambipolar diffusion coefficient within the perovskite are\ndetermined from the experimental decay profiles for heterostructures with three\nof the highest performing CTLs, namely C$_{60}$, PCBM and Spiro-OMeTAD.\nDefinitive targets for the further improvement of devices are deduced:\nfullerenes deliver fast electron extraction, but suffer from a large rate\nconstant for cross-interface recombination or hole extraction. Conversely,\nSpiro-OMeTAD exhibits slow hole extraction but does not increase the\nperovskite's surface recombination rate, likely contributing to its success in\nsolar cell devices.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}