{"id":"2407.19204","title":"Towards the Terminator Economy: Assessing Job Exposure to AI through\n  LLMs","authors":"Emilio Colombo, Fabio Mercorio, Mario Mezzanzanica, Antonio Serino","authorsParsed":[["Colombo","Emilio",""],["Mercorio","Fabio",""],["Mezzanzanica","Mario",""],["Serino","Antonio",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 08:14:18 GMT"}],"updateDate":"2024-07-30","timestamp":1722068058000,"abstract":"  The spread and rapid development of AI-related technologies are influencing\nmany aspects of our daily lives, from social to educational, including the\nlabour market. Many researchers have been highlighting the key role AI and\ntechnologies play in reshaping jobs and their related tasks, either by\nautomating or enhancing human capabilities in the workplace. Can we estimate\nif, and to what extent, jobs and related tasks are exposed to the risk of being\nautomatized by state-of-the-art AI-related technologies? Our work tackles this\nquestion through a data-driven approach: (i) developing a reproducible\nframework that exploits a battery of open-source Large Language Models to\nassess current AI and robotics' capabilities in performing job-related tasks;\n(ii) formalising and computing an AI exposure measure by occupation, namely the\nteai (Task Exposure to AI) index. Our results show that about one-third of U.S.\nemployment is highly exposed to AI, primarily in high-skill jobs (aka, white\ncollars). This exposure correlates positively with employment and wage growth\nfrom 2019 to 2023, indicating a beneficial impact of AI on productivity. The\nsource codes and results are publicly available, enabling the whole community\nto benchmark and track AI and technology capabilities over time.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VBISOt0JT8qKTk1DYxizdstGjm-i0s4lXoUjw4fGyPc","pdfSize":"3107268"}
