{"id":"2407.01931","title":"Probabilistic 3D Correspondence Prediction from Sparse Unsegmented\n  Images","authors":"Krithika Iyer and Shireen Y. Elhabian","authorsParsed":[["Iyer","Krithika",""],["Elhabian","Shireen Y.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 03:56:20 GMT"}],"updateDate":"2024-07-03","timestamp":1719892580000,"abstract":"  The study of physiology demonstrates that the form (shape)of anatomical\nstructures dictates their functions, and analyzing the form of anatomies plays\na crucial role in clinical research. Statistical shape modeling (SSM) is a\nwidely used tool for quantitative analysis of forms of anatomies, aiding in\ncharacterizing and identifying differences within a population of subjects.\nDespite its utility, the conventional SSM construction pipeline is often\ncomplex and time-consuming. Additionally, reliance on linearity assumptions\nfurther limits the model from capturing clinically relevant variations. Recent\nadvancements in deep learning solutions enable the direct inference of SSM from\nunsegmented medical images, streamlining the process and improving\naccessibility. However, the new methods of SSM from images do not adequately\naccount for situations where the imaging data quality is poor or where only\nsparse information is available. Moreover, quantifying aleatoric uncertainty,\nwhich represents inherent data variability, is crucial in deploying deep\nlearning for clinical tasks to ensure reliable model predictions and robust\ndecision-making, especially in challenging imaging conditions. Therefore, we\npropose SPI-CorrNet, a unified model that predicts 3D correspondences from\nsparse imaging data. It leverages a teacher network to regularize feature\nlearning and quantifies data-dependent aleatoric uncertainty by adapting the\nnetwork to predict intrinsic input variances. Experiments on the LGE MRI left\natrium dataset and Abdomen CT-1K liver datasets demonstrate that our technique\nenhances the accuracy and robustness of sparse image-driven SSM.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}