{"id":"2407.21203","title":"Quantum advantage from measurement-induced entanglement in random\n  shallow circuits","authors":"Adam Bene Watts, David Gosset, Yinchen Liu, Mehdi Soleimanifar","authorsParsed":[["Watts","Adam Bene",""],["Gosset","David",""],["Liu","Yinchen",""],["Soleimanifar","Mehdi",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 21:39:23 GMT"}],"updateDate":"2024-08-01","timestamp":1722375563000,"abstract":"  We study random constant-depth quantum circuits in a two-dimensional\narchitecture. While these circuits only produce entanglement between nearby\nqubits on the lattice, long-range entanglement can be generated by measuring a\nsubset of the qubits of the output state. It is conjectured that this\nlong-range measurement-induced entanglement (MIE) proliferates when the circuit\ndepth is at least a constant critical value. For circuits composed of\nHaar-random two-qubit gates, it is also believed that this coincides with a\nquantum advantage phase transition in the classical hardness of sampling from\nthe output distribution. Here we provide evidence for a quantum advantage phase\ntransition in the setting of random Clifford circuits. Our work extends the\nscope of recent separations between the computational power of constant-depth\nquantum and classical circuits, demonstrating that this kind of advantage is\npresent in canonical random circuit sampling tasks. In particular, we show that\nin any architecture of random shallow Clifford circuits, the presence of\nlong-range MIE gives rise to an unconditional quantum advantage. In contrast,\nany depth-d 2D quantum circuit that satisfies a short-range MIE property can be\nclassically simulated efficiently and with depth O(d). Finally, we introduce a\ntwo-dimensional, depth-2, \"coarse-grained\" circuit architecture, composed of\nrandom Clifford gates acting on O(log n) qubits, for which we prove the\nexistence of long-range MIE and establish an unconditional quantum advantage.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Statistical Mechanics","Computing Research Repository/Computational Complexity"],"license":"http://creativecommons.org/licenses/by/4.0/"}