{"id":"2407.10321","title":"Public Discourse about COVID-19 Vaccinations: A Computational Analysis\n  of the Relationship between Public Concerns and Policies","authors":"Katarina Boland and Christopher Starke and Felix Bensmann and Frank\n  Marcinkowski and Stefan Dietze","authorsParsed":[["Boland","Katarina",""],["Starke","Christopher",""],["Bensmann","Felix",""],["Marcinkowski","Frank",""],["Dietze","Stefan",""]],"versions":[{"version":"v1","created":"Tue, 7 May 2024 15:31:13 GMT"}],"updateDate":"2024-07-16","timestamp":1715095873000,"abstract":"  Societies worldwide have witnessed growing rifts separating advocates and\nopponents of vaccinations and other COVID-19 countermeasures. With the rollout\nof vaccination campaigns, German-speaking regions exhibited much lower\nvaccination uptake than other European regions. While Austria, Germany, and\nSwitzerland (the DACH region) caught up over time, it remains unclear which\nfactors contributed to these changes. Scrutinizing public discourses can help\nshed light on the intricacies of vaccine hesitancy and inform policy-makers\ntasked with making far-reaching decisions: policies need to effectively curb\nthe spread of the virus while respecting fundamental civic liberties and\nminimizing undesired consequences. This study draws on Twitter data to analyze\nthe topics prevalent in the public discourse. It further maps the topics to\ndifferent phases of the pandemic and policy changes to identify potential\ndrivers of change in public attention. We use a hybrid pipeline to detect and\nanalyze vaccination-related tweets using topic modeling, sentiment analysis,\nand a minimum of social scientific domain knowledge to analyze the discourse\nabout vaccinations in the light of the COVID-19 pandemic in the DACH region. We\nshow that skepticism regarding the severity of the COVID-19 virus and towards\nefficacy and safety of vaccines were among the prevalent topics in the\ndiscourse on Twitter but that the most attention was given to debating the\ntheme of freedom and civic liberties. Especially during later phases of the\npandemic, when implemented policies restricted the freedom of unvaccinated\ncitizens, increased vaccination uptake could be observed. At the same time,\nincreasingly negative and polarized sentiments emerge in the discourse. This\nsuggests that these policies might have effectively attenuated vaccination\nhesitancy but were not successfully dispersing citizens' doubts and concerns.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"3ANN-Q75G4b-Ln9ByH19ZL81EmfJdBpY9hFtoIJbLJo","pdfSize":"2000427"}
