{"id":"2407.00220","title":"A Reflection Principle for Potential Infinite Models of Type Theory","authors":"Matthias Eberl","authorsParsed":[["Eberl","Matthias",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 20:18:27 GMT"}],"updateDate":"2024-07-02","timestamp":1719605907000,"abstract":"  Denotational models of type theory, such as set-theoretic, domain-theoretic,\nor category-theoretic models use (actual) infinite sets of objects in one way\nor another. The potential infinite, seen as an extensible finite, requires a\ndynamic understanding of the infinite sets of objects. It follows that the type\n$nat$ cannot be interpreted as a set of all natural numbers, $\\lbrack\\!\\lbrack\nnat \\rbrack\\!\\rbrack = \\mathbb{N}$, but as an increasing family of finite sets\n$\\mathbb{N}_i = \\{0, \\dots, i-1\\}$. Any reference to $\\lbrack\\!\\lbrack nat\n\\rbrack\\!\\rbrack$, either by the formal syntax or by meta-level concepts, must\nbe a reference to a (sufficiently large) set $\\mathbb{N}_i$.\n  We present the basic concepts for interpreting a fragment of the simply typed\n$\\lambda$-calculus within such a dynamic model. A type $\\varrho$ is thereby\ninterpreted as a process, which is formally a factor system together with a\nlimit of it. A factor system is very similar to a direct or an inverse system,\nand its limit is also defined by a universal property. It is crucial to\nrecognize that a limit is not necessarily an unreachable end beyond the\nprocess. Rather, it can be regarded as an intermediate state within the factor\nsystem, which can still be extended.\n  The logical type $bool$ plays an important role, which we interpret\nclassically as the set $\\{true, false\\}$. We provide an interpretation of\nsimply typed $\\lambda$-terms in these factor systems and limits. The main\nresult is a reflection principle, which states that an element in the limit has\na ``full representative'' at a sufficiently large stage within the factor\nsystem. For propositions, that is, terms of type $bool$, this implies that\nstatements about the limit are true if and only if they are true at that\nsufficiently large stage.\n","subjects":["Computing Research Repository/Logic in Computer Science","Mathematics/Logic"],"license":"http://creativecommons.org/licenses/by/4.0/"}