{"id":"2407.18312","title":"The FeK$\\alpha$ Compton shoulder in accreting Supermassive Black Holes","authors":"G. Dimopoulos, C. Ricci, S. Paltani","authorsParsed":[["Dimopoulos","G.",""],["Ricci","C.",""],["Paltani","S.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 18:06:20 GMT"}],"updateDate":"2024-07-29","timestamp":1721930780000,"abstract":"  Reprocessed X-ray radiation from active galactic nuclei (AGN) carries\nimportant information about the properties of the circumnuclear material around\nthe black hole. The X-ray photons travel from the very center of the system and\ninteract with that material often producing strong emission lines. The\nFeK$\\alpha$ Compton shoulder is formed by fluorescent FeK$\\alpha$ photons that\nperform Compton scatterings with the intercepting material and lose energy to\nform the distinct shoulder shape. In this work we use the ray-tracing code\nRefleX to explore how the physical properties of the medium, as well as its\ngeometry, affect the shape of the Compton shoulder (CS). We start by running\nsimulations using a simple toroidal reflector, to test the effect of the metal\ncomposition, metallicity, column density, dust presence and velocity on the\nFeK$\\alpha$ line and its Compton shoulder. We confirm that the shape of the\nCompton shoulder is sensitive to the optical depth of the intercepting medium,\nwhich can be regulated by either changing the metal composition or the line of\nsight column density of the circumnuclear material. Next, we create a series of\nmodels, which feature different geometrical configurations of dust and gas, and\nexplore how the Compton shoulder is affected by such configurations finding\nthat components that can regulate the line-of-sight column density affect the\nFeK$\\alpha$ and its CS. Finally, we test whether observatories such as the\nrecently launched XRISM and future Athena will make the Compton shoulder a\nuseful spectral feature of nearby AGN, by applying specific models on simulated\nspectra of the Circinus galaxy. The CS has the potential to be used to help\nconstrain properties of the circumnuclear material yet with some limitations.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}