{"id":"2407.04602","title":"Multiple stage stochastic linear programming with multiple objectives:\n  flexible decision making","authors":"Andreas H. Hamel and Andreas L\\\"ohne","authorsParsed":[["Hamel","Andreas H.",""],["Löhne","Andreas",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 15:50:47 GMT"}],"updateDate":"2024-07-08","timestamp":1720194647000,"abstract":"  Optimization problems with random data have a wide range of applications. A\ntypical feature of many such problems is that some variables have to be\noptimized before certain random coefficients have been realized and for other\nvariables it is sufficient to decide on them afterwards. This leads to a\nmultiple stage decision process. To optimize the variables in the first of two\nsubsequent stages the stochastic problem is transformed into a deterministic\nprogram, called the (deterministic equivalent of the) recourse problem. In case\nof stochastic linear programs with finitely distributed random data this\nnon-stochastic substitute is just a linear program. In the same way a multiple\nobjective linear program is obtained if the original problem has multiple\nobjective functions. In the first of the two stages, a decision maker usually\nwould chose a feasible point out of the set of all Pareto-optimal points. This\nchoice however has consequences to later stage decisions. We claim that the\ndecision process in the earlier of the two stages is not fully transparent if a\nclassical multi-objective decision process is applied: in addition to the\noriginal objectives of the problem a decision maker may have a preference for\nlargest possible flexibility in later stage decisions. This additional\nobjective is taken into account if the recourse problem in case of multiple\nobjectives is taken to be a polyhedral convex set optimization problem instead\nof a multi-objective linear program only. We also discuss several surrogate\nproblems to the recourse problem such as the wait-and-see problem and the\nexpected valued problem for the multi-objective case. The new approach based on\nset optimization is illustrated by an example, the multi-objective newsvendor\nproblem.\n","subjects":["Mathematics/Optimization and Control","Mathematics/Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}