{"id":"2407.07008","title":"Investigating opioid vulnerability profiles through a spatial Kalman\n  filter: insights from social and environmental factors","authors":"Andrew Deas, Hashan Fernando, Anuj J Kapadia, Jodie Trafton, Adam\n  Spannaus and Vasileios Maroulas","authorsParsed":[["Deas","Andrew",""],["Fernando","Hashan",""],["Kapadia","Anuj J",""],["Trafton","Jodie",""],["Spannaus","Adam",""],["Maroulas","Vasileios",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 16:22:18 GMT"}],"updateDate":"2024-07-10","timestamp":1720542138000,"abstract":"  This study investigates the national opioid crisis by exploring three key\nsocial and environmental drivers: opioid-related mortality rates, opioid\nprescription dispensing rates, and disability rank ordered rates. We introduce\na spatial Kalman filter to examine each factor individually and their potential\nintra-relationships. This study utilizes county level data, spanning the years\n2014 through 2020, on the rates of opioid-related mortality, opioid\nprescription dispensing, and disability. To successfully estimate and predict\ntrends in these opioid-related socioenvironmental factors, we augment the\nKalman Filter with a novel spatial component. Through this construction we\nanalyze opioid vulnerability at the national scale, creating heat maps and a\nhotspot analysis. Our spatial Kalman filter demonstrates strong predictive\nperformance. These predictions are used to uncover pronounced vulnerability\nprofiles for both the rates of opioid-related mortality and disability, finding\nthat the Appalachian region is likely the nation's most vulnerable area to\nthese two factors. This contrasts with a chaotic vulnerability profile found\nfor the dispensing rates. We suggest that the rates of opioid-related mortality\nand disability are connected and propose that this connection is unlikely to be\nfound in the realm of prescription opioids. Our analysis indicates that\nprescription opioids are not the primary drivers of opioid-related deaths\nacross the country. We advocate for comprehensive solutions which extend beyond\nlimiting prescription opioids.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}