{"id":"2407.12736","title":"CHOSEN: Compilation to Hardware Optimization Stack for Efficient Vision\n  Transformer Inference","authors":"Mohammad Erfan Sadeghi, Arash Fayyazi, Suhas Somashekar, Massoud\n  Pedram","authorsParsed":[["Sadeghi","Mohammad Erfan",""],["Fayyazi","Arash",""],["Somashekar","Suhas",""],["Pedram","Massoud",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 16:56:06 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 05:19:15 GMT"},{"version":"v3","created":"Thu, 25 Jul 2024 00:00:18 GMT"}],"updateDate":"2024-07-26","timestamp":1721235366000,"abstract":"  Vision Transformers (ViTs) represent a groundbreaking shift in machine\nlearning approaches to computer vision. Unlike traditional approaches, ViTs\nemploy the self-attention mechanism, which has been widely used in natural\nlanguage processing, to analyze image patches. Despite their advantages in\nmodeling visual tasks, deploying ViTs on hardware platforms, notably\nField-Programmable Gate Arrays (FPGAs), introduces considerable challenges.\nThese challenges stem primarily from the non-linear calculations and high\ncomputational and memory demands of ViTs. This paper introduces CHOSEN, a\nsoftware-hardware co-design framework to address these challenges and offer an\nautomated framework for ViT deployment on the FPGAs in order to maximize\nperformance. Our framework is built upon three fundamental contributions:\nmulti-kernel design to maximize the bandwidth, mainly targeting benefits of\nmulti DDR memory banks, approximate non-linear functions that exhibit minimal\naccuracy degradation, and efficient use of available logic blocks on the FPGA,\nand efficient compiler to maximize the performance and memory-efficiency of the\ncomputing kernels by presenting a novel algorithm for design space exploration\nto find optimal hardware configuration that achieves optimal throughput and\nlatency. Compared to the state-of-the-art ViT accelerators, CHOSEN achieves a\n1.5x and 1.42x improvement in the throughput on the DeiT-S and DeiT-B models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/"}