{"id":"2407.14191","title":"Normative Diffusion Autoencoders: Application to Amyotrophic Lateral\n  Sclerosis","authors":"Ayodeji Ijishakin, Adamos Hadjasavilou, Ahmed Abdulaal, Nina\n  Montana-Brown, Florence Townend, Edoardo Spinelli, Massimo Fillipi, Federica\n  Agosta, James Cole, Andrea Malaspina","authorsParsed":[["Ijishakin","Ayodeji",""],["Hadjasavilou","Adamos",""],["Abdulaal","Ahmed",""],["Montana-Brown","Nina",""],["Townend","Florence",""],["Spinelli","Edoardo",""],["Fillipi","Massimo",""],["Agosta","Federica",""],["Cole","James",""],["Malaspina","Andrea",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 10:39:24 GMT"}],"updateDate":"2024-07-22","timestamp":1721385564000,"abstract":"  Predicting survival in Amyotrophic Lateral Sclerosis (ALS) is a challenging\ntask. Magnetic resonance imaging (MRI) data provide in vivo insight into brain\nhealth, but the low prevalence of the condition and resultant data scarcity\nlimit training set sizes for prediction models. Survival models are further\nhindered by the subtle and often highly localised profile of ALS-related\nneurodegeneration. Normative models present a solution as they increase\nstatistical power by leveraging large healthy cohorts. Separately, diffusion\nmodels excel in capturing the semantics embedded within images including subtle\nsigns of accelerated brain ageing, which may help predict survival in ALS.\nHere, we combine the benefits of generative and normative modelling by\nintroducing the normative diffusion autoencoder framework. To our knowledge,\nthis is the first use of normative modelling within a diffusion autoencoder, as\nwell as the first application of normative modelling to ALS. Our approach\noutperforms generative and non-generative normative modelling benchmarks in ALS\nprognostication, demonstrating enhanced predictive accuracy in the context of\nALS survival prediction and normative modelling in general.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"_8uv8fhLpcTQecfU8U3JrLFLGU4VBUpJS5s8iQ_o5hE","pdfSize":"9894474","objectId":"0x16df1bda7a73de82affc339af7a167dc1c3c3b6fe81443eb2c77b1a12e8cad4a","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
