{"id":"2407.08443","title":"Infinite Motion: Extended Motion Generation via Long Text Instructions","authors":"Mengtian Li, Chengshuo Zhai, Shengxiang Yao, Zhifeng Xie, Keyu Chen,\n  Yu-Gang Jiang","authorsParsed":[["Li","Mengtian",""],["Zhai","Chengshuo",""],["Yao","Shengxiang",""],["Xie","Zhifeng",""],["Chen","Keyu",""],["Jiang","Yu-Gang",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 12:33:56 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 07:12:05 GMT"}],"updateDate":"2024-07-15","timestamp":1720701236000,"abstract":"  In the realm of motion generation, the creation of long-duration,\nhigh-quality motion sequences remains a significant challenge. This paper\npresents our groundbreaking work on \"Infinite Motion\", a novel approach that\nleverages long text to extended motion generation, effectively bridging the gap\nbetween short and long-duration motion synthesis. Our core insight is the\nstrategic extension and reassembly of existing high-quality text-motion\ndatasets, which has led to the creation of a novel benchmark dataset to\nfacilitate the training of models for extended motion sequences. A key\ninnovation of our model is its ability to accept arbitrary lengths of text as\ninput, enabling the generation of motion sequences tailored to specific\nnarratives or scenarios. Furthermore, we incorporate the timestamp design for\ntext which allows precise editing of local segments within the generated\nsequences, offering unparalleled control and flexibility in motion synthesis.\nWe further demonstrate the versatility and practical utility of \"Infinite\nMotion\" through three specific applications: natural language interactive\nediting, motion sequence editing within long sequences and splicing of\nindependent motion sequences. Each application highlights the adaptability of\nour approach and broadens the spectrum of possibilities for research and\ndevelopment in motion generation. Through extensive experiments, we demonstrate\nthe superior performance of our model in generating long sequence motions\ncompared to existing methods.Project page:\nhttps://shuochengzhai.github.io/Infinite-motion.github.io/\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}