{"id":"2407.19051","title":"Towards a Transformer-Based Pre-trained Model for IoT Traffic\n  Classification","authors":"Bruna Bazaluk, Mosab Hamdan, Mustafa Ghaleb, Mohammed S. M. Gismalla,\n  Flavio S. Correa da Silva, Daniel Mac\\^edo Batista","authorsParsed":[["Bazaluk","Bruna",""],["Hamdan","Mosab",""],["Ghaleb","Mustafa",""],["Gismalla","Mohammed S. M.",""],["da Silva","Flavio S. Correa",""],["Batista","Daniel Macêdo",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 19:13:11 GMT"}],"updateDate":"2024-07-30","timestamp":1722021191000,"abstract":"  The classification of IoT traffic is important to improve the efficiency and\nsecurity of IoT-based networks. As the state-of-the-art classification methods\nare based on Deep Learning, most of the current results require a large amount\nof data to be trained. Thereby, in real-life situations, where there is a\nscarce amount of IoT traffic data, the models would not perform so well.\nConsequently, these models underperform outside their initial training\nconditions and fail to capture the complex characteristics of network traffic,\nrendering them inefficient and unreliable in real-world applications. In this\npaper, we propose IoT Traffic Classification Transformer (ITCT), a novel\napproach that utilizes the state-of-the-art transformer-based model named\nTabTransformer. ITCT, which is pre-trained on a large labeled MQTT-based IoT\ntraffic dataset and may be fine-tuned with a small set of labeled data, showed\npromising results in various traffic classification tasks. Our experiments\ndemonstrated that the ITCT model significantly outperforms existing models,\nachieving an overall accuracy of 82%. To support reproducibility and\ncollaborative development, all associated code has been made publicly\navailable.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}