{"id":"2407.01431","title":"Graph Spanners for Group Steiner Distances","authors":"Davide Bil\\`o, Luciano Gual\\`a, Stefano Leucci, Alessandro Straziota","authorsParsed":[["Bilò","Davide",""],["Gualà","Luciano",""],["Leucci","Stefano",""],["Straziota","Alessandro",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 16:22:48 GMT"}],"updateDate":"2024-07-02","timestamp":1719850968000,"abstract":"  A spanner is a sparse subgraph of a given graph $G$ which preserves\ndistances, measured w.r.t.\\ some distance metric, up to a multiplicative\nstretch factor. This paper addresses the problem of constructing graph spanners\nw.r.t.\\ the group Steiner metric, which generalizes the recently introduced\nbeer distance metric. In such a metric we are given a collection of groups of\nrequired vertices, and we measure the distance between two vertices as the\nlength of the shortest path between them that traverses at least one required\nvertex from each group.\n  We discuss the relation between group Steiner spanners and classic spanners\nand we show that they exhibit strong ties with sourcewise spanners w.r.t.\\ the\nshortest path metric. Nevertheless, group Steiner spanners capture several\ninteresting scenarios that are not encompassed by existing spanners. This\nhappens, e.g., for the singleton case, in which each group consists of a single\nrequired vertex, thus modeling the setting in which routes need to traverse\ncertain points of interests (in any order).\n  We provide several constructions of group Steiner spanners for both the\nall-pairs and single-source case, which exhibit various size-stretch\ntrade-offs. Notably, we provide spanners with almost-optimal trade-offs for the\nsingleton case. Moreover, some of our spanners also yield novel trade-offs for\nclassical sourcewise spanners.\n  Finally, we also investigate the query times that can be achieved when our\nspanners are turned into group Steiner distance oracles with the same size,\nstretch, and building time.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}