{"id":"2407.10992","title":"AlleNoise -- large-scale text classification benchmark dataset with\n  real-world label noise","authors":"Alicja R\\k{a}czkowska, Aleksandra Osowska-Kurczab, Jacek\n  Szczerbi\\'nski, Kalina Jasinska-Kobus, Klaudia Nazarko","authorsParsed":[["Rączkowska","Alicja",""],["Osowska-Kurczab","Aleksandra",""],["Szczerbiński","Jacek",""],["Jasinska-Kobus","Kalina",""],["Nazarko","Klaudia",""]],"versions":[{"version":"v1","created":"Mon, 24 Jun 2024 09:29:14 GMT"}],"updateDate":"2024-07-17","timestamp":1719221354000,"abstract":"  Label noise remains a challenge for training robust classification models.\nMost methods for mitigating label noise have been benchmarked using primarily\ndatasets with synthetic noise. While the need for datasets with realistic noise\ndistribution has partially been addressed by web-scraped benchmarks such as\nWebVision and Clothing1M, those benchmarks are restricted to the computer\nvision domain. With the growing importance of Transformer-based models, it is\ncrucial to establish text classification benchmarks for learning with noisy\nlabels. In this paper, we present AlleNoise, a new curated text classification\nbenchmark dataset with real-world instance-dependent label noise, containing\nover 500,000 examples across approximately 5,600 classes, complemented with a\nmeaningful, hierarchical taxonomy of categories. The noise distribution comes\nfrom actual users of a major e-commerce marketplace, so it realistically\nreflects the semantics of human mistakes. In addition to the noisy labels, we\nprovide human-verified clean labels, which help to get a deeper insight into\nthe noise distribution, unlike web-scraped datasets typically used in the\nfield. We demonstrate that a representative selection of established methods\nfor learning with noisy labels is inadequate to handle such real-world noise.\nIn addition, we show evidence that these algorithms do not alleviate excessive\nmemorization. As such, with AlleNoise, we set the bar high for the development\nof label noise methods that can handle real-world label noise in text\nclassification tasks. The code and dataset are available for download at\nhttps://github.com/allegro/AlleNoise.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}