{"id":"2407.07094","title":"AnyTaskTune: Advanced Domain-Specific Solutions through Task-Fine-Tuning","authors":"Jiaxi Cui, Wentao Zhang, Jing Tang, Xudong Tong, Zhenwei Zhang, Amie,\n  Jing Wen, Rongsheng Wang and Pengfei Wu","authorsParsed":[["Cui","Jiaxi",""],["Zhang","Wentao",""],["Tang","Jing",""],["Tong","Xudong",""],["Zhang","Zhenwei",""],["Amie","",""],["Wen","Jing",""],["Wang","Rongsheng",""],["Wu","Pengfei",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 17:59:56 GMT"}],"updateDate":"2024-07-10","timestamp":1720547996000,"abstract":"  The pervasive deployment of Large Language Models-LLMs in various sectors\noften neglects the nuanced requirements of individuals and small organizations,\nwho benefit more from models precisely tailored to their specific business\ncontexts rather than those with broadly superior general capabilities. This\nwork introduces \\textbf{AnyTaskTune}, a novel fine-tuning methodology coined as\n\\textbf{Task-Fine-Tune}, specifically developed to elevate model performance on\na diverse array of domain-specific tasks. This method involves a meticulous\nprocess to identify and define targeted sub-tasks within a domain, followed by\nthe creation of specialized enhancement datasets for fine-tuning, thereby\noptimizing task-specific model performance. We conducted comprehensive\nfine-tuning experiments not only in the legal domain for tasks such as keyword\nextraction and sentence prediction but across over twenty different sub-tasks\nderived from the domains of finance, healthcare, law, psychology, consumer\nservices, and human resources. To substantiate our approach and facilitate\ncommunity engagement, we will open-source these bilingual task datasets. Our\nfindings demonstrate that models fine-tuned using the \\textbf{Task-Fine-Tune}\nmethodology not only achieve superior performance on these specific tasks but\nalso significantly outperform models with higher general capabilities in their\nrespective domains. Our work is publicly available at\n\\url{https://github.com/PandaVT/DataTager}.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}