{"id":"2407.11034","title":"Bridging Data Gaps in Healthcare: A Scoping Review of Transfer Learning\n  in Biomedical Data Analysis","authors":"Siqi Li, Xin Li, Kunyu Yu, Di Miao, Mingcheng Zhu, Mengying Yan, Yuhe\n  Ke, Danny D'Agostino, Yilin Ning, Qiming Wu, Ziwen Wang, Yuqing Shang, Molei\n  Liu, Chuan Hong, Nan Liu","authorsParsed":[["Li","Siqi",""],["Li","Xin",""],["Yu","Kunyu",""],["Miao","Di",""],["Zhu","Mingcheng",""],["Yan","Mengying",""],["Ke","Yuhe",""],["D'Agostino","Danny",""],["Ning","Yilin",""],["Wu","Qiming",""],["Wang","Ziwen",""],["Shang","Yuqing",""],["Liu","Molei",""],["Hong","Chuan",""],["Liu","Nan",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 23:34:20 GMT"}],"updateDate":"2024-07-17","timestamp":1720136060000,"abstract":"  Clinical and biomedical research in low-resource settings often faces\nsignificant challenges due to the need for high-quality data with sufficient\nsample sizes to construct effective models. These constraints hinder robust\nmodel training and prompt researchers to seek methods for leveraging existing\nknowledge from related studies to support new research efforts. Transfer\nlearning (TL), a machine learning technique, emerges as a powerful solution by\nutilizing knowledge from pre-trained models to enhance the performance of new\nmodels, offering promise across various healthcare domains. Despite its\nconceptual origins in the 1990s, the application of TL in medical research has\nremained limited, especially beyond image analysis. In our review of TL\napplications in structured clinical and biomedical data, we screened 3,515\npapers, with 55 meeting the inclusion criteria. Among these, only 2% (one out\nof 55) utilized external studies, and 7% (four out of 55) addressed scenarios\ninvolving multi-site collaborations with privacy constraints. To achieve\nactionable TL with structured medical data while addressing regional\ndisparities, inequality, and privacy constraints in healthcare research, we\nadvocate for the careful identification of appropriate source data and models,\nthe selection of suitable TL frameworks, and the validation of TL models with\nproper baselines.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UKOVkcEsEQiN1Eqi77m4_sqYREa3Db0Uzud0Ca-iKx8","pdfSize":"796248"}
