{"id":"2407.05346","title":"Wastewater Treatment Plant Data for Nutrient Removal System","authors":"Esmaeel Mohammadi, Anju Rani, Mikkel Stokholm-Bjerregaard, Daniel\n  Ortiz-Arroyo, Petar Durdevic","authorsParsed":[["Mohammadi","Esmaeel",""],["Rani","Anju",""],["Stokholm-Bjerregaard","Mikkel",""],["Ortiz-Arroyo","Daniel",""],["Durdevic","Petar",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 12:40:19 GMT"}],"updateDate":"2024-07-09","timestamp":1720356019000,"abstract":"  This paper introduces the Agtrup (BlueKolding) dataset, collected from\nDenmark's Agtrup wastewater treatment plant, specifically designed to enhance\nphosphorus removal via chemical and biological methods. This rich dataset is\nassembled through a high-frequency Supervisory Control and Data Acquisition\n(SCADA) system data collection process, which captures a wide range of\nvariables related to the operational dynamics of nutrient removal. It comprises\ntime-series data featuring measurements sampled to a frequency of two minutes\nacross various control, process, and environmental variables. The comprehensive\ndataset aims to foster significant advancements in wastewater management by\nsupporting the development of sophisticated predictive models and optimizing\noperational strategies. By providing detailed insights into the interactions\nand efficiencies of chemical and biological phosphorus removal processes, the\ndataset serves as a vital resource for environmental researchers and engineers\nfocused on improving the sustainability and effectiveness of wastewater\ntreatment operations. The ultimate goal of this dataset is to facilitate the\ncreation of digital twins and the application of machine learning techniques,\nsuch as deep reinforcement learning, to predict and enhance system performance\nunder varying operational conditions.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}