{"id":"2407.13230","title":"Probing spin textures in atomically thin CrSBr through tunneling\n  magnetoresistance","authors":"Ziqi Liu, Chengfeng Zhu, Yuchen Gao, Zuxin Chen, Pingfan Gu, and Yu Ye","authorsParsed":[["Liu","Ziqi",""],["Zhu","Chengfeng",""],["Gao","Yuchen",""],["Chen","Zuxin",""],["Gu","Pingfan",""],["Ye","Yu",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 07:31:38 GMT"}],"updateDate":"2024-07-19","timestamp":1721287898000,"abstract":"  The exploration of spin configurations and magnetoresistance in van der Waals\nmagnetic semiconductors, particularly in the realm of thin-layer structures,\nholds paramount significance for the development of two-dimensional spintronic\nnanodevices. In this Letter, we conducted comprehensive magnetotransport\nmeasurements on a few-layer CrSBr using a vertical tunneling device\nconfiguration. Notably, our investigation revealed that tunneling\nmagnetoresistance possesses a distinctive capability to discern spin\nconfigurations that would otherwise remain indistinguishable through\nalternative techniques such as photoluminescence. We observed the existence of\nenergy-degenerate states exhibiting identical net magnetization and comparable\nspin configurations, which could be differentiated based on their rectification\nproperties, reminiscent of a diode-like behavior at positive and negative bias\nvoltages. Specifically, in devices comprising 5-layer CrSBr, we observed an\nintriguing positive magnetoresistive state when subjected to an in-plane\nmagnetic field along the $b$-axis. To gain a deeper understanding of the\nunderlying mechanisms, we developed a one-dimensional linear chain model that\nsuccessfully computed the magnetic state, thereby elucidating the underlying\nspin configurations responsible for the observed transport phenomena. These\nfindings not only provide novel perspectives into the intricate spin textures\nof two-dimensional CrSBr but also underscore the sensitivity of tunneling as a\nprobing technique for investigating the magnetic order in van der Waals\nmaterials.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"BVxtjqO2ytYV_ABsqinyrnoV-leHeURGv2olxxUR98o","pdfSize":"3364447","objectId":"0xab5dcdc576f1f6d0afc80fd99f78a8aade36efa28b7391d118861629fcf8fc1f","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
