{"id":"2407.07463","title":"Buoyancy driven motion of non-coalescing inertial drops: microstructure\n  modeling with nearest particle statistics","authors":"Nicolas Fintzi, Jean-Lou Pierson, and St\\'ephane Popinet","authorsParsed":[["Fintzi","Nicolas",""],["Pierson","Jean-Lou",""],["Popinet","Stéphane",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 08:34:39 GMT"}],"updateDate":"2024-07-11","timestamp":1720600479000,"abstract":"  In this study, we analyze the various arrangements that droplets can form\nwithin dispersed buoyant emulsions, which we refer to as the study of\nmicrostructure. To this end, we have developed a novel algorithm that\neffectively prevents numerical coalescence between drops while maintaining a\nreasonable computational cost. This algorithm is integrated into the Volume of\nFluid (VoF) method and implemented using the open-source code\nhttp://basilisk.fr. Subsequently, we perform Direct Numerical Simulations (DNS)\nof statistically steady state mono-disperse buoyant emulsion over a broad range\nof dimensionless parameters, including the particle volume fraction ($\\phi$),\nthe Galileo number ($Ga$) and the viscosity ratio ($\\lambda$). We make use of\nnearest particle statistics to quantify the microstructure properties. As\npredicted by Zhang et al. (2023), it is demonstrated that the second moment of\nthe nearest particle pair distribution can effectively quantify microstructural\nfeatures such as particle clusters and layers. Specifically, the findings are:\n(1) In moderately inertial flows ($Ga = 10$), droplets form isotropic clusters.\nIn high inertial regimes ($Ga = 100$), non-isotropic clusters, such as\nhorizontal layers, are more likely to form. (3) The viscosity ratio plays a\nsignificant role in determining the microstructure, with droplets that are less\nviscous or equally viscous as the surrounding fluid tending to form layers\npreferentially. Overall, our study provides a quantitative measure of the\nmicrostructure in terms of $Ga$, $\\phi$ and $\\lambda$.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OA5FPp-5IPLS_eu5c4p29gBty2_7UhygWStcelG_WzE","pdfSize":"4614905"}
