{"id":"2407.17491","title":"Robust Adaptation of Foundation Models with Black-Box Visual Prompting","authors":"Changdae Oh, Gyeongdeok Seo, Geunyoung Jung, Zhi-Qi Cheng, Hosik Choi,\n  Jiyoung Jung, Kyungwoo Song","authorsParsed":[["Oh","Changdae",""],["Seo","Gyeongdeok",""],["Jung","Geunyoung",""],["Cheng","Zhi-Qi",""],["Choi","Hosik",""],["Jung","Jiyoung",""],["Song","Kyungwoo",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 02:35:00 GMT"}],"updateDate":"2024-07-26","timestamp":1720060500000,"abstract":"  With the surge of large-scale pre-trained models (PTMs), adapting these\nmodels to numerous downstream tasks becomes a crucial problem. Consequently,\nparameter-efficient transfer learning (PETL) of large models has grasped huge\nattention. While PETL methods show impressive performance, they commonly rely\non two optimistic assumptions: 1) the entire parameters of a PTM are available,\nand 2) a sufficiently large memory capacity is equipped for caching all the\nintermediate activations to compute gradients. However, in most real-world\napplications, PTMs are served as black-box APIs or proprietary software without\nexplicit parameter accessibility. Besides, it is hard to meet a large memory\nrequirement for modern PTMs. This work proposes black-box visual prompting\n(BlackVIP), which efficiently adapts the PTMs without knowledge about model\narchitectures and parameters. BlackVIP has two components; 1) Coordinator and\n2) simultaneous perturbation stochastic approximation with gradient correction\n(SPSA-GC). The Coordinator designs input-dependent visual prompts, which allow\nthe target PTM to adapt in the wild. SPSA-GC efficiently estimates the gradient\nof PTM to update the Coordinator. Besides, we propose a variant, BlackVIP-SE,\nwhich significantly reduces the runtime and computational cost of BlackVIP.\nExtensive experiments on 19 datasets demonstrate that BlackVIPs enable robust\nadaptation to diverse domains and tasks with minimal memory requirements. We\nfurther provide theoretical analysis on the generalization of visual prompting\nmethods by presenting their connection to the certified robustness of\nrandomized smoothing.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eL_AzqyBH3HmJtxJW_VEnRtfdfgYzpqy1iE-EVqoI2c","pdfSize":"31637823"}
