{"id":"2407.00159","title":"Probing Random-Bond Disorder Effects on Ferromagnetic Skyrmion Arrays","authors":"E. Iroulart, F. A. G\\'omez Albarrac\\'in, H. Diego Rosales","authorsParsed":[["Iroulart","E.",""],["Albarracín","F. A. Gómez",""],["Rosales","H. Diego",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 18:00:13 GMT"},{"version":"v2","created":"Mon, 8 Jul 2024 16:49:43 GMT"}],"updateDate":"2024-07-09","timestamp":1719597613000,"abstract":"  In this work, we examined the impact of disorder in a ferromagnetic skyrmion\nlattice by introducing random-bond disorder based on two different models for\nboth exchange and Dzyaloshinskii-Moriya interactions: Model I, where both\ninteractions present the same disorder distribution and thus the same local\ndistortion, and Model II, where both interactions have different disorder\ndistributions. Through extensive Monte Carlo simulations, we explored the\neffect of bond disorder on the emergent phases induced by an external magnetic\nfield at different temperatures, varying the disorder amplitude across a range\nfrom weak (10%) to strong (200%) regimes. Our study shows that for both models,\nmoderate disorder at low magnetic fields breaks the helical order and induces a\ntopologically non-trivial bimeron phase. We also found that the skyrmion\nlattice phase loses its periodicity, but surprisingly, the resulting phases\nretain topological characteristics up to high disorder amplitudes. Moreover, a\nsignificant difference between both disorder models is found at large magnetic\nfields: while in the first model, the high-field skyrmion phase is suppressed\nby disorder, in the second model, this phase is enhanced and expanded in\ntemperature and magnetic field. Furthermore, for the second model, intermediate\nvalues of disorder induce a diluted skyrmion phase and chiral textures emerging\nfrom the ferromagnetic phase at low temperatures. Our results are relevant for\nlayered magnets and provide valuable insights into the intricate behavior of\nskyrmion systems under varying disorder conditions.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"t9G7oEoQoxxB18A4BWFIMUIdwHxab70ZZTTmsmz4S48","pdfSize":"6475685"}
