{"id":"2407.18475","title":"First deep X-ray observations of the Fermi-detected steep-spectrum\n  source and radio-loud NLS1 galaxy 3C 286","authors":"Su Yao, S. Komossa, A. Kraus, D. Grupe","authorsParsed":[["Yao","Su",""],["Komossa","S.",""],["Kraus","A.",""],["Grupe","D.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 02:58:11 GMT"}],"updateDate":"2024-07-29","timestamp":1721962691000,"abstract":"  A well-known calibrator source in radio astronomy, 3C 286 ($z=0.85$), is a\ncompact steep-spectrum (CSS) radio source and spectroscopically classified as a\nnarrow-line Seyfert 1 (NLS1) galaxy. It is also known for its damped Ly$\\alpha$\nsystem from an intervening galaxy at $z=0.692$ detected in both ultraviolet\n(UV) and radio spectra. In addition, despite being a misaligned active galactic\nnuclei (AGN), 3C 286 is also detected in $\\gamma$-rays by Fermi. Thus, this\nunique object combines the characteristics of CSS sources, NLS1 galaxies, and\n$\\gamma$-ray emitters with misaligned jets, providing an excellent laboratory\nfor extending our knowledge of AGN disk-jet coupling. Despite its significance,\n3C 286 has been rarely observed in X-rays. In this study, we present our deep\nXMM-Newton and Chandra observations of 3C 286. The results reveal that the\nX-ray spectrum can be well described by models including an intervening\nabsorber with redshift and column density consistent with previous UV and radio\nobservations. The most important finding is that the spectrum cannot be\ndescribed by a single power law, but a soft excess is required which is\nparameterized by a blackbody. Furthermore, we find evidence suggesting the\npresence of off-nuclear X-ray emission at a radius that corresponds to the\nlocation of the radio lobes. While further theoretical work is still needed,\nour findings offer new clues to understand the specific mechanism for\n$\\gamma$-ray emission from this unique object.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}