{"id":"2407.14501","title":"Indoor Air Quality Dataset with Activities of Daily Living in Low to\n  Middle-income Communities","authors":"Prasenjit Karmakar, Swadhin Pradhan, Sandip Chakraborty","authorsParsed":[["Karmakar","Prasenjit",""],["Pradhan","Swadhin",""],["Chakraborty","Sandip",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 17:53:21 GMT"},{"version":"v2","created":"Sat, 17 Aug 2024 09:41:03 GMT"}],"updateDate":"2024-08-20","timestamp":1721411601000,"abstract":"  In recent years, indoor air pollution has posed a significant threat to our\nsociety, claiming over 3.2 million lives annually. Developing nations, such as\nIndia, are most affected since lack of knowledge, inadequate regulation, and\noutdoor air pollution lead to severe daily exposure to pollutants. However,\nonly a limited number of studies have attempted to understand how indoor air\npollution affects developing countries like India. To address this gap, we\npresent spatiotemporal measurements of air quality from 30 indoor sites over\nsix months during summer and winter seasons. The sites are geographically\nlocated across four regions of type: rural, suburban, and urban, covering the\ntypical low to middle-income population in India. The dataset contains various\ntypes of indoor environments (e.g., studio apartments, classrooms, research\nlaboratories, food canteens, and residential households), and can provide the\nbasis for data-driven learning model research aimed at coping with unique\npollution patterns in developing countries. This unique dataset demands\nadvanced data cleaning and imputation techniques for handling missing data due\nto power failure or network outages during data collection. Furthermore,\nthrough a simple speech-to-text application, we provide real-time indoor\nactivity labels annotated by occupants. Therefore, environmentalists and ML\nenthusiasts can utilize this dataset to understand the complex patterns of the\npollutants under different indoor activities, identify recurring sources of\npollution, forecast exposure, improve floor plans and room structures of modern\nindoor designs, develop pollution-aware recommender systems, etc.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}