{"id":"2407.21673","title":"Turbulence, Waves, and Taylor's Hypothesis for Heliosheath Observations","authors":"L.-L. Zhao, G. P. Zank, M. Opher, B. Zieger, H. Li, V. Florinski, L.\n  Adhikari, X. Zhu, and M. Nakanotani","authorsParsed":[["Zhao","L. -L.",""],["Zank","G. P.",""],["Opher","M.",""],["Zieger","B.",""],["Li","H.",""],["Florinski","V.",""],["Adhikari","L.",""],["Zhu","X.",""],["Nakanotani","M.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:13:57 GMT"}],"updateDate":"2024-08-01","timestamp":1722438837000,"abstract":"  Magnetic field fluctuations measured in the heliosheath by the Voyager\nspacecraft are often characterized as compressible, as indicated by a strong\nfluctuating component parallel to the mean magnetic field. However, the\ninterpretation of the turbulence data faces the caveat that the standard Taylor\nhypothesis is invalid because the solar wind flow velocity in the heliosheath\nbecomes subsonic and slower than the fast magnetosonic speed, given the\ncontributions from hot pickup ions in the heliosheath. We attempt to overcome\nthis caveat by introducing a 4D frequency wavenumber spectral modeling of\nturbulence, which is essentially a decomposition of different wave modes\nfollowing their respective dispersion relations. Isotropic Alfven and fast mode\nturbulence are considered to represent the heliosheath fluctuations. We also\ninclude two dispersive fast wave modes derived from a three-fluid theory. We\nfind that (1) magnetic fluctuations in the inner heliosheath are less\ncompressible than previously thought. An isotropic turbulence spectral model\nwith about 1/4 in compressible fluctuation power is consistent with the\nobserved magnetic compressibility in the heliosheath; (2) the hot pickup ion\ncomponent and the relatively cold solar wind ions induce two dispersive fast\nmagnetosonic wave branches in the perpendicular propagation limit. Pickup ion\nfast wave may account for the spectral bump near the proton gyrofrequency in\nthe observable spectrum; (3) it is possible that the turbulence wavenumber\nspectrum is not Kolmogorov-like although the observed frequency spectrum has a\n-5/3 power law index, depending on the partitioning of power among the various\nwave modes, and this partitioning may change with wavenumber.\n","subjects":["Physics/Space Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}