{"id":"2407.06825","title":"Study of Breather Structures in the Framework of Gardner Equation in\n  Electron-Positron-Ion Plasmas","authors":"Snehalata Nasipuri, Swarniv Chandra, Uday Narayan Ghosh, Chinmay Das,\n  Prasanta Chatterjee","authorsParsed":[["Nasipuri","Snehalata",""],["Chandra","Swarniv",""],["Ghosh","Uday Narayan",""],["Das","Chinmay",""],["Chatterjee","Prasanta",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 12:59:47 GMT"}],"updateDate":"2024-07-10","timestamp":1720529987000,"abstract":"  In different nonlinear mediums, the wave trains carry energy and expose many\namazing features. To describe a nonlinear phenomenon, a soliton is one that\npreserves its shape and amplitude even after the collision. Breather is one\nkind of soliton structure, which is a localized wave that periodically\noscillates in amplitude. This article uses the reductive perturbation technique\n(RPT) to get the GE from a plasma system with four parts: cold positrons that\ncan move, hot positrons and hot electrons that are spread out in a kappa\npattern, and positive ions that can't move. Then, using the Hirota bilinear\nmethod (HBM), it is possible to obtain the multi-soliton and breather\nstructures of GE. Breathers are fluctuating regional wave packets and\nsignificantly participate in hydrodynamics as well as optics; besides, their\ninteraction can alter the dynamical characteristics of the wave fields. We also\nincorporate a detailed numerical simulation study based on a newly designed\ncode by two of the co-authors. It is found that in our plasma system, soliton\nsolutions, especially breather solutions, exist. Although superthermal\n(kappa-distributed) electrons and positrons play an important role in soliton\nstructures, This type of analysis can also apply to the propagation of\nfinite-amplitude waves in natural phenomena like the atmosphere, ocean, optic\nfibres, signal processing, etc. It should also be useful to study different\nelectrostatic disturbances in space and laboratory plasmas, where immobile\npositive ions, superthermal electrons, superthermal hot positrons, and mobile\ncold positrons are the major plasma species.\n","subjects":["Physics/Plasma Physics","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Nonlinear Sciences/Pattern Formation and Solitons"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}