{"id":"2407.21005","title":"Settling the Pass Complexity of Approximate Matchings in Dynamic Graph\n  Streams","authors":"Sepehr Assadi, Soheil Behnezhad, Christian Konrad, Kheeran K. Naidu,\n  Janani Sundaresan","authorsParsed":[["Assadi","Sepehr",""],["Behnezhad","Soheil",""],["Konrad","Christian",""],["Naidu","Kheeran K.",""],["Sundaresan","Janani",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 17:54:01 GMT"}],"updateDate":"2024-07-31","timestamp":1722362041000,"abstract":"  A semi-streaming algorithm in dynamic graph streams processes any $n$-vertex\ngraph by making one or multiple passes over a stream of insertions and\ndeletions to edges of the graph and using $O(n \\cdot \\mbox{polylog}(n))$ space.\nSemi-streaming algorithms for dynamic streams were first obtained in the\nseminal work of Ahn, Guha, and McGregor in 2012, alongside the introduction of\nthe graph sketching technique, which remains the de facto way of designing\nalgorithms in this model and a highly popular technique for designing graph\nalgorithms in general.\n  We settle the pass complexity of approximating maximum matchings in dynamic\nstreams via semi-streaming algorithms by improving the state-of-the-art in both\nupper and lower bounds.\n  We present a randomized sketching based semi-streaming algorithm for\n$O(1)$-approximation of maximum matching in dynamic streams using\n$O(\\log\\log{n})$ passes. The approximation ratio of this algorithm can be\nimproved to $(1+\\epsilon)$ for any fixed $\\epsilon > 0$ even on weighted graphs\nusing standard techniques. This exponentially improves upon several\n$O(\\log{n})$ pass algorithms developed for this problem since the introduction\nof the dynamic graph streaming model.\n  In addition, we prove that any semi-streaming algorithm (not only sketching\nbased) for $O(1)$-approximation of maximum matching in dynamic streams requires\n$\\Omega(\\log\\log{n})$ passes. This presents the first multi-pass lower bound\nfor this problem, which is already also optimal, settling a longstanding open\nquestion in this area.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Computational Complexity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Cmb-cToGeFK-muv8vYU_XTDo3dwVzmUKqxee5G1DTkU","pdfSize":"3034208"}
