{"id":"2407.20178","title":"Self-Consistent Stochastic Finite-Temperature Modelling: Ultracold Bose\n  Gases with Local (s-wave) and Long-Range (Dipolar) Interactions","authors":"Nick P. Proukakis and Gerasimos Rigopoulos and Alex Soto","authorsParsed":[["Proukakis","Nick P.",""],["Rigopoulos","Gerasimos",""],["Soto","Alex",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 17:06:35 GMT"}],"updateDate":"2024-07-30","timestamp":1722272795000,"abstract":"  We formulate a generalized self-consistent quantum kinetic theory including\nthermal fluctuations and stochastic contributions for modelling ultracold Bose\ngases interacting via a generic long-range interaction. Our generalised\nequations take the usual form of an effective field theory, separating\ncoherent, low-lying, modes of the system from incoherent, higher-lying, thermal\nmodes. The low-lying modes are described by a stochastic Langevin equation with\ntwo explicitly time-dependent collisional terms (corresponding to a dissipative\nand an energy-correcting contribution) and their corresponding additive and\nmultiplicative stochastic noise terms. By coupling such an equation to an\nexplicitly non-equilibrium gas of incoherent (thermal) particles described by a\nquantum Boltzmann equation, we thus extend beyond both earlier stochastic\napproaches (including the full SPGPE) and generalised kinetic models inspired\nby a two-gas picture (the so-called ZNG formalism) commonly used in the context\nof short-range interactions, such as those relevant in ultracold alkali atoms.\nLong-range interactions are further included into our model by the\nself-consistent addition of a Poisson-like equation for the long-range\ninteraction potential. Our approach leads directly to a self-consistent model\nfor finite-temperature Bose-Einstein condensation in a long-range interacting\nsystem within the regime where thermal fluctuations dominate over quantum\nfluctuations. While such an approach could be of general use for a variety of\nexperimentally-accessible long-range interacting systems, we focus specifically\nhere on the well-studied case of dipolar atomic condensates. In this particular\ncontext, we additionally supplement our Keldysh non-equilibrium analysis for\nfluctuations of the fast (incoherent) modes by a somewhat ad hoc extension of\nthe slow (coherent) modes via the usual route of Bogoliubov-de Gennes\nequations.\n","subjects":["Condensed Matter/Quantum Gases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TBS1cEa8iKb3bPe5Gsi7PhMG6qFvuaXmjeRvy9OxARc","pdfSize":"756621"}
