{"id":"2407.09930","title":"Evaluating the Impact of Different Quantum Kernels on the Classification\n  Performance of Support Vector Machine Algorithm: A Medical Dataset\n  Application","authors":"Emine Akpinar, Sardar M. N. Islam, Murat Oduncuoglu","authorsParsed":[["Akpinar","Emine",""],["Islam","Sardar M. N.",""],["Oduncuoglu","Murat",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 15:53:37 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 10:37:03 GMT"}],"updateDate":"2024-07-22","timestamp":1720886017000,"abstract":"  The support vector machine algorithm with a quantum kernel estimator\n(QSVM-Kernel), as a leading example of a quantum machine learning technique,\nhas undergone significant advancements. Nevertheless, its integration with\nclassical data presents unique challenges. While quantum computers primarily\ninteract with data in quantum states, embedding classical data into quantum\nstates using feature mapping techniques is essential for leveraging quantum\nalgorithms Despite the recognized importance of feature mapping, its specific\nimpact on data classification outcomes remains largely unexplored. This study\naddresses this gap by comprehensively assessing the effects of various feature\nmapping methods on classification results, taking medical data analysis as a\ncase study. In this study, the QSVM-Kernel method was applied to classification\nproblems in two different and publicly available medical datasets, namely, the\nWisconsin Breast Cancer (original) and The Cancer Genome Atlas (TCGA) Glioma\ndatasets. In the QSVM-Kernel algorithm, quantum kernel matrices obtained from 9\ndifferent quantum feature maps were used. Thus, the effects of these quantum\nfeature maps on the classification results of the QSVM-Kernel algorithm were\nexamined in terms of both classifier performance and total execution time. As a\nresult, in the Wisconsin Breast Cancer (original) and TCGA Glioma datasets,\nwhen Rx and Ry rotational gates were used, respectively, as feature maps in the\nQSVM-Kernel algorithm, the best classification performances were achieved both\nin terms of classification performance and total execution time. The\ncontributions of this study are that (1) it highlights the significant impact\nof feature mapping techniques on medical data classification outcomes using the\nQSVM-Kernel algorithm, and (2) it also guides undertaking research for improved\nQSVM classification performance.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}