{"id":"2407.13340","title":"TwinRAN: Twinning the 5G RAN in Azure Cloud","authors":"Yash Deshpande, Eni Sulkaj, Wolfgang Kellerer","authorsParsed":[["Deshpande","Yash",""],["Sulkaj","Eni",""],["Kellerer","Wolfgang",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:37:05 GMT"}],"updateDate":"2024-07-19","timestamp":1721295425000,"abstract":"  The proliferation of 5G technology necessitates advanced network management\nstrategies to ensure optimal performance and reliability. Digital Twins (DTs)\nhave emerged as a promising paradigm for modeling and simulating complex\nsystems like the 5G Radio Access Network (RAN). In this paper, we present\nTwinRAN, a DT of the 5G RAN built leveraging the Azure DT platform. TwinRAN is\nbuilt on top of the Open RAN (O-RAN) architecture and is agnostic to the vendor\nof the underlying equipment. We demonstrate three applications using TwinRAN\nand evaluate the required resources and their performance for a network with\n800 users and 8 gNBs.\n  We first evaluate the performance and limitations of the Azure DT platform,\nmeasuring the latency under different conditions. The results from this\nevaluation allow us to optimize TwinRAN to the DT platform it uses. Then, we\npresent the system's architectural design, emphasizing its components and\ninteractions. We propose that two types of twin graphs be simultaneously\nmaintained on the cloud. The first one is for intercell operations, keeping a\nbroad overview of all the cells in the network. The second twin graph is where\neach cell is spawned in a separate Azure DT instance for more granular\noperation and monitoring of intracell tasks. We evaluate the performance and\noperating costs of TwinRAN for each of the three applications. The TwinRAN DT\nin the cloud can keep track of its physical twin within a few hundred\nmilliseconds, extending its utility to many 5G network management tasks - some\nof which are shown in this paper. The novel framework for building and\nmaintaining a DT of the 5G RAN presented in this paper offers network operators\nenhanced capabilities, empowering efficient deployments and management.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}