{"id":"2407.02074","title":"CGAP: Urban Region Representation Learning with Coarsened Graph\n  Attention Pooling","authors":"Zhuo Xu, Xiao Zhou","authorsParsed":[["Xu","Zhuo",""],["Zhou","Xiao",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 09:07:19 GMT"}],"updateDate":"2024-07-03","timestamp":1719911239000,"abstract":"  The explosion of massive urban data recently has provided us with a valuable\nopportunity to gain deeper insights into urban regions and the daily lives of\nresidents. Urban region representation learning emerges as a crucial realm for\nfulfilling this task. Among deep learning approaches, graph neural networks\n(GNNs) have shown promise, given that city elements can be naturally\nrepresented as nodes with various connections between them as edges. However,\nmany existing GNN approaches encounter challenges such as over-smoothing and\nlimitations in capturing information from nodes in other regions, resulting in\nthe loss of crucial urban information and a decline in region representation\nperformance. To address these challenges, we leverage urban graph structure\ninformation and introduce a hierarchical graph pooling process called Coarsened\nGraph Attention Pooling (CGAP). CGAP features local attention units to create\ncoarsened intermediate graphs and global features. Additionally, by\nincorporating urban region graphs and global features into a global attention\nlayer, we harness relational information to enhance representation\neffectiveness. Furthermore, CGAP integrates region attributes such as Points of\nInterest (POIs) and inter-regional contexts like human mobility, enabling the\nexploitation of multi-modal urban data for more comprehensive representation\nlearning. Experiments on three downstream tasks related to the UN Sustainable\nDevelopment Goals validate the effectiveness of region representations learned\nby our approach. Experimental results and analyses demonstrate that CGAP excels\nin various socioeconomic prediction tasks compared to competitive baselines.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/"}