{"id":"2407.13188","title":"Safe-SD: Safe and Traceable Stable Diffusion with Text Prompt Trigger\n  for Invisible Generative Watermarking","authors":"Zhiyuan Ma, Guoli Jia, Biqing Qi, Bowen Zhou","authorsParsed":[["Ma","Zhiyuan",""],["Jia","Guoli",""],["Qi","Biqing",""],["Zhou","Bowen",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 05:53:17 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 13:30:52 GMT"}],"updateDate":"2024-07-22","timestamp":1721281997000,"abstract":"  Recently, stable diffusion (SD) models have typically flourished in the field\nof image synthesis and personalized editing, with a range of photorealistic and\nunprecedented images being successfully generated. As a result, widespread\ninterest has been ignited to develop and use various SD-based tools for visual\ncontent creation. However, the exposure of AI-created content on public\nplatforms could raise both legal and ethical risks. In this regard, the\ntraditional methods of adding watermarks to the already generated images (i.e.\npost-processing) may face a dilemma (e.g., being erased or modified) in terms\nof copyright protection and content monitoring, since the powerful image\ninversion and text-to-image editing techniques have been widely explored in\nSD-based methods. In this work, we propose a Safe and high-traceable Stable\nDiffusion framework (namely Safe-SD) to adaptively implant the graphical\nwatermarks (e.g., QR code) into the imperceptible structure-related pixels\nduring the generative diffusion process for supporting text-driven invisible\nwatermarking and detection. Different from the previous high-cost\ninjection-then-detection training framework, we design a simple and unified\narchitecture, which makes it possible to simultaneously train watermark\ninjection and detection in a single network, greatly improving the efficiency\nand convenience of use. Moreover, to further support text-driven generative\nwatermarking and deeply explore its robustness and high-traceability, we\nelaborately design lambda sampling and encryption algorithm to fine-tune a\nlatent diffuser wrapped by a VAE for balancing high-fidelity image synthesis\nand high-traceable watermark detection. We present our quantitative and\nqualitative results on two representative datasets LSUN, COCO and FFHQ,\ndemonstrating state-of-the-art performance of Safe-SD and showing it\nsignificantly outperforms the previous approaches.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}