{"id":"2407.12090","title":"Impact of star formation models on the growth of galaxies at high\n  redshifts","authors":"Cheonsu Kang, Taysun Kimm, Daniel Han, Harley Katz, Julien Devriendt,\n  Adrianne Slyz, Romain Teyssier","authorsParsed":[["Kang","Cheonsu",""],["Kimm","Taysun",""],["Han","Daniel",""],["Katz","Harley",""],["Devriendt","Julien",""],["Slyz","Adrianne",""],["Teyssier","Romain",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 18:00:06 GMT"}],"updateDate":"2024-07-18","timestamp":1721152806000,"abstract":"  To understand the impact of star formation models on galaxy evolution, we\nperform cosmological zoom-in radiation-hydrodynamic simulations of a dwarf dark\nmatter halo with virial mass 1e9 Msun at z=6. Two different star formation\nmodels are compared, a model based on a local gravo-thermo-turbulent condition\nand a model based on a sink particle algorithm. Using idealized tests of\ncollapsing isothermal spheres and giant molecular clouds with different\nturbulent structures, we determine the optimal accretion radius to be twice the\ncell size and the resolution required to achieve reasonable convergence in star\nformation efficiency to 0.3 pc for the sink algorithm. As a first study in this\nseries, we use cosmological zoom-in simulations with different spatial\nresolutions and find that star formation is more bursty in the runs with the\nsink algorithm, generating stronger outflows than in the runs with the\ngravo-thermo-turbulent model. The main reason for the increased burstiness is\nthat the gas accretion rates on the sinks are high enough to form stars on very\nshort timescales, leading to more clustered star formation. As a result, the\nstar-forming clumps are disrupted more quickly in the sink run due to more\ncoherent radiation and supernova feedback. The difference in burstiness between\nthe two star formation models becomes even more pronounced when the supernova\nexplosion energy is artificially increased. Our results suggest that improving\nthe modelling of star formation on small, sub-molecular cloud scales can\nsignificantly impact the global properties of simulated galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}