{"id":"2407.00483","title":"Navigating the road to automotive cybersecurity compliance","authors":"Franco Oberti, Fabrizio Abrate, Alessandro Savino, Filippo Parisi, and\n  Stefano Di Carlo","authorsParsed":[["Oberti","Franco",""],["Abrate","Fabrizio",""],["Savino","Alessandro",""],["Parisi","Filippo",""],["Di Carlo","Stefano",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 16:07:48 GMT"}],"updateDate":"2024-07-02","timestamp":1719677268000,"abstract":"  The automotive industry has evolved significantly since the introduction of\nthe Ford Model T in 1908. Today's vehicles are not merely mechanical\nconstructs; they are integral components of a complex digital ecosystem,\nequipped with advanced connectivity features powered by Artificial Intelligence\nand cloud computing technologies. This evolution has enhanced vehicle safety,\nefficiency, and the overall driving experience. However, it also introduces new\nchallenges, notably in cybersecurity.\n  With the increasing integration of digital technologies, vehicles have become\nmore susceptible to cyber-attacks, prompting significant cybersecurity\nconcerns. These concerns include securing sensitive data, protecting vehicles\nfrom unauthorized access, and ensuring user privacy. In response, the\nautomotive industry is compelled to adopt robust cybersecurity measures to\nsafeguard both vehicles and data against potential threats.\n  Legislative frameworks such as UNR155 and UNR156 by the United Nations, along\nwith other international regulations, aim to establish stringent cybersecurity\nmandates. These regulations require compliance with comprehensive cybersecurity\nmanagement systems and necessitate regular updates and testing to cope with the\nevolving nature of cyber threats. The introduction of such regulations\nhighlights the growing recognition of cybersecurity as a critical component of\nautomotive safety and functionality.\n  The future of automotive cybersecurity lies in the continuous development of\nadvanced protective measures and collaborative efforts among all stakeholders,\nincluding manufacturers, policymakers, and cybersecurity professionals. Only\nthrough such concerted efforts can the industry hope to address the dual goals\nof innovation in vehicle functionality and stringent security measures against\nthe backdrop of an increasingly interconnected digital landscape.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}