{"id":"2407.14032","title":"Semantic-CC: Boosting Remote Sensing Image Change Captioning via\n  Foundational Knowledge and Semantic Guidance","authors":"Yongshuo Zhu, Lu Li, Keyan Chen, Chenyang Liu, Fugen Zhou and Zhenwei\n  Shi","authorsParsed":[["Zhu","Yongshuo",""],["Li","Lu",""],["Chen","Keyan",""],["Liu","Chenyang",""],["Zhou","Fugen",""],["Shi","Zhenwei",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 05:07:41 GMT"}],"updateDate":"2024-07-22","timestamp":1721365661000,"abstract":"  Remote sensing image change captioning (RSICC) aims to articulate the changes\nin objects of interest within bi-temporal remote sensing images using natural\nlanguage. Given the limitations of current RSICC methods in expressing general\nfeatures across multi-temporal and spatial scenarios, and their deficiency in\nproviding granular, robust, and precise change descriptions, we introduce a\nnovel change captioning (CC) method based on the foundational knowledge and\nsemantic guidance, which we term Semantic-CC. Semantic-CC alleviates the\ndependency of high-generalization algorithms on extensive annotations by\nharnessing the latent knowledge of foundation models, and it generates more\ncomprehensive and accurate change descriptions guided by pixel-level semantics\nfrom change detection (CD). Specifically, we propose a bi-temporal SAM-based\nencoder for dual-image feature extraction; a multi-task semantic aggregation\nneck for facilitating information interaction between heterogeneous tasks; a\nstraightforward multi-scale change detection decoder to provide pixel-level\nsemantic guidance; and a change caption decoder based on the large language\nmodel (LLM) to generate change description sentences. Moreover, to ensure the\nstability of the joint training of CD and CC, we propose a three-stage training\nstrategy that supervises different tasks at various stages. We validate the\nproposed method on the LEVIR-CC and LEVIR-CD datasets. The experimental results\ncorroborate the complementarity of CD and CC, demonstrating that Semantic-CC\ncan generate more accurate change descriptions and achieve optimal performance\nacross both tasks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}