{"id":"2407.09503","title":"PARSE-Ego4D: Personal Action Recommendation Suggestions for Egocentric\n  Videos","authors":"Steven Abreu, Tiffany D. Do, Karan Ahuja, Eric J. Gonzalez, Lee Payne,\n  Daniel McDuff, Mar Gonzalez-Franco","authorsParsed":[["Abreu","Steven",""],["Do","Tiffany D.",""],["Ahuja","Karan",""],["Gonzalez","Eric J.",""],["Payne","Lee",""],["McDuff","Daniel",""],["Gonzalez-Franco","Mar",""]],"versions":[{"version":"v1","created":"Fri, 14 Jun 2024 09:39:53 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 13:29:27 GMT"}],"updateDate":"2024-07-26","timestamp":1718357993000,"abstract":"  Intelligent assistance involves not only understanding but also action.\nExisting ego-centric video datasets contain rich annotations of the videos, but\nnot of actions that an intelligent assistant could perform in the moment. To\naddress this gap, we release PARSE-Ego4D, a new set of personal action\nrecommendation annotations for the Ego4D dataset. We take a multi-stage\napproach to generating and evaluating these annotations. First, we used a\nprompt-engineered large language model (LLM) to generate context-aware action\nsuggestions and identified over 18,000 action suggestions. While these\nsynthetic action suggestions are valuable, the inherent limitations of LLMs\nnecessitate human evaluation. To ensure high-quality and user-centered\nrecommendations, we conducted a large-scale human annotation study that\nprovides grounding in human preferences for all of PARSE-Ego4D. We analyze the\ninter-rater agreement and evaluate subjective preferences of participants.\nBased on our synthetic dataset and complete human annotations, we propose\nseveral new tasks for action suggestions based on ego-centric videos. We\nencourage novel solutions that improve latency and energy requirements. The\nannotations in PARSE-Ego4D will support researchers and developers who are\nworking on building action recommendation systems for augmented and virtual\nreality systems.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by/4.0/"}