{"id":"2407.09374","title":"Grain boundaries control lithiation of solid solution substrates in\n  lithium metal batteries","authors":"Leonardo Shoji Aota, Chanwon Jung, Siyuan Zhang, \\\"Omer K.\n  B\\\"uy\\\"ukuslu, Poonam Yadav, Mahander Pratap Singh, Xinren Chen, Eric Woods,\n  Christina Scheu, Se-Ho Kim, Dierk Raabe, Baptiste Gault","authorsParsed":[["Aota","Leonardo Shoji",""],["Jung","Chanwon",""],["Zhang","Siyuan",""],["Büyükuslu","Ömer K.",""],["Yadav","Poonam",""],["Singh","Mahander Pratap",""],["Chen","Xinren",""],["Woods","Eric",""],["Scheu","Christina",""],["Kim","Se-Ho",""],["Raabe","Dierk",""],["Gault","Baptiste",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 15:55:53 GMT"}],"updateDate":"2024-07-15","timestamp":1720799753000,"abstract":"  The development of sustainable transportation and communication systems\nrequires an increase in both energy density and capacity retention of\nLi-batteries. Using substrates forming a solid solution with body centered\ncubic Li enhances the cycle stability of anode-less batteries. However, it\nremains unclear how the substrate microstructure affects the lithiation\nbehavior. Here, we deploy a correlative, near-atomic scale probing approach\nthrough combined ion- and electron-microscopy to examine the distribution of Li\nin Li-Ag diffusion couples as model system. We reveal that Li regions with over\n93.8% at.% nucleate within Ag at random high angle grain boundaries, whereas\ngrain interiors are not lithiated. We evidence the role of kinetics and\nmechanical constraint from the microstructure over equilibrium thermodynamics\nin dictating the lithiation process. The findings suggest that grain size and\ngrain boundary character are critical to enhance the electrochemical\nperformance of interlayers/electrodes, particularly for improving lithiation\nkinetics and hence reducing dendrite formation.\n","subjects":["Condensed Matter/Materials Science","Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}