{"id":"2407.05627","title":"New Directions in Text Classification Research: Maximizing The\n  Performance of Sentiment Classification from Limited Data","authors":"Surya Agustian, Muhammad Irfan Syah, Nurul Fatiara, and Rahmad\n  Abdillah","authorsParsed":[["Agustian","Surya",""],["Syah","Muhammad Irfan",""],["Fatiara","Nurul",""],["Abdillah","Rahmad",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 05:42:29 GMT"}],"updateDate":"2024-07-09","timestamp":1720417349000,"abstract":"  The stakeholders' needs in sentiment analysis for various issues, whether\npositive or negative, are speed and accuracy. One new challenge in sentiment\nanalysis tasks is the limited training data, which often leads to suboptimal\nmachine learning models and poor performance on test data. This paper discusses\nthe problem of text classification based on limited training data (300 to 600\nsamples) into three classes: positive, negative, and neutral. A benchmark\ndataset is provided for training and testing data on the issue of Kaesang\nPangarep's appointment as Chairman of PSI. External data for aggregation and\naugmentation purposes are provided, consisting of two datasets: the topic of\nCovid Vaccination sentiment and an open topic. The official score used is the\nF1-score, which balances precision and recall among the three classes,\npositive, negative, and neutral. A baseline score is provided as a reference\nfor researchers for unoptimized classification methods. The optimized score is\nprovided as a reference for the target score to be achieved by any proposed\nmethod. Both scoring (baseline and optimized) use the SVM method, which is\nwidely reported as the state-of-the-art in conventional machine learning\nmethods. The F1-scores achieved by the baseline and optimized methods are\n40.83% and 51.28%, respectively.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval","Computing Research Repository/Information Theory","Computing Research Repository/Machine Learning","Computing Research Repository/Social and Information Networks","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}