{"id":"2407.08243","title":"Generalized Face Anti-spoofing via Finer Domain Partition and\n  Disentangling Liveness-irrelevant Factors","authors":"Jingyi Yang, Zitong Yu, Xiuming Ni, Jia He, Hui Li","authorsParsed":[["Yang","Jingyi",""],["Yu","Zitong",""],["Ni","Xiuming",""],["He","Jia",""],["Li","Hui",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 07:39:58 GMT"}],"updateDate":"2024-07-12","timestamp":1720683598000,"abstract":"  Face anti-spoofing techniques based on domain generalization have recently\nbeen studied widely. Adversarial learning and meta-learning techniques have\nbeen adopted to learn domain-invariant representations. However, prior\napproaches often consider the dataset gap as the primary factor behind domain\nshifts. This perspective is not fine-grained enough to reflect the intrinsic\ngap among the data accurately. In our work, we redefine domains based on\nidentities rather than datasets, aiming to disentangle liveness and identity\nattributes. We emphasize ignoring the adverse effect of identity shift,\nfocusing on learning identity-invariant liveness representations through\northogonalizing liveness and identity features. To cope with style shifts, we\npropose Style Cross module to expand the stylistic diversity and Channel-wise\nStyle Attention module to weaken the sensitivity to style shifts, aiming to\nlearn robust liveness representations. Furthermore, acknowledging the asymmetry\nbetween live and spoof samples, we introduce a novel contrastive loss,\nAsymmetric Augmented Instance Contrast. Extensive experiments on four public\ndatasets demonstrate that our method achieves state-of-the-art performance\nunder cross-dataset and limited source dataset scenarios. Additionally, our\nmethod has good scalability when expanding diversity of identities. The codes\nwill be released soon.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}