{"id":"2407.16272","title":"Video Popularity in Social Media: Impact of Emotions, Raw Features and\n  Viewer Comments","authors":"Malika Ziyada and Pakizar Shamoi","authorsParsed":[["Ziyada","Malika",""],["Shamoi","Pakizar",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 08:25:18 GMT"}],"updateDate":"2024-07-24","timestamp":1721723118000,"abstract":"  The Internet has significantly affected the increase of social media users.\nNowadays, informative content is presented along with entertainment on the web.\nHighlighting environmental issues on social networks is crucial, given their\nsignificance as major global problems. This study examines the popularity\ndeterminants for short environmental videos on social media, focusing on the\ncomparative influence of raw video features and viewer engagement metrics. We\ncollected a dataset of videos along with associated popularity metrics such as\nlikes, views, shares, and comments per day. We also extracted video\ncharacteristics, including duration, text post length, emotional and sentiment\nanalysis using the VADER and text2emotion models, and color palette brightness.\nOur analysis consisted of two main experiments: one evaluating the correlation\nbetween raw video features and popularity metrics and another assessing the\nimpact of viewer comments and their sentiments and emotions on video\npopularity. We employed a ridge regression classifier with standard scaling to\npredict the popularity, categorizing videos as popular or not based on the\nmedian views and likes per day. The findings reveal that viewer comments and\nreactions (accuracy of 0.8) have a more substantial influence on video\npopularity compared to raw video features (accuracy of 0.67). Significant\ncorrelations include a positive relationship between the emotion of sadness in\nposts and the number of likes and negative correlations between sentiment\nscores, and both likes and shares. This research highlights the complex\nrelationship between content features and public perception in shaping the\npopularity of environmental messages on social media.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}