{"id":"2407.07016","title":"Is Large Language Model All You Need to Predict the Synthesizability and\n  Precursors of Crystal Structures?","authors":"Zhilong Song, Shuaihua Lu, Minggang Ju, Qionghua Zhou and Jinlan Wang","authorsParsed":[["Song","Zhilong",""],["Lu","Shuaihua",""],["Ju","Minggang",""],["Zhou","Qionghua",""],["Wang","Jinlan",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 16:35:12 GMT"}],"updateDate":"2024-07-10","timestamp":1720542912000,"abstract":"  Accessing the synthesizability of crystal structures is pivotal for advancing\nthe practical application of theoretical material structures designed by\nmachine learning or high-throughput screening. However, a significant gap\nexists between the actual synthesizability and thermodynamic or kinetic\nstability, which is commonly used for screening theoretical structures for\nexperiments. To address this, we develop the Crystal Synthesis Large Language\nModels (CSLLM) framework, which includes three LLMs for predicting the\nsynthesizability, synthesis methods, and precursors. We create a comprehensive\nsynthesizability dataset including 140,120 crystal structures and develop an\nefficient text representation method for crystal structures to fine-tune the\nLLMs. The Synthesizability LLM achieves a remarkable 98.6% accuracy,\nsignificantly outperforming traditional synthesizability screening based on\nthermodynamic and kinetic stability by 106.1% and 44.5%, respectively. The\nMethods LLM achieves a classification accuracy of 91.02%, and the Precursors\nLLM has an 80.2% success rate in predicting synthesis precursors. Furthermore,\nwe develop a user-friendly graphical interface that enables automatic\npredictions of synthesizability and precursors from uploaded crystal structure\nfiles. Through these contributions, CSLLM bridges the gap between theoretical\nmaterial design and experimental synthesis, paving the way for the rapid\ndiscovery of novel and synthesizable functional materials.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}