{"id":"2407.00068","title":"D&A: Resource Optimisation in Personalised PageRank Computations Using\n  Multi-Core Machines","authors":"Kai Siong Yow and Chunbo Li","authorsParsed":[["Yow","Kai Siong",""],["Li","Chunbo",""]],"versions":[{"version":"v1","created":"Tue, 18 Jun 2024 15:04:16 GMT"}],"updateDate":"2024-07-02","timestamp":1718723056000,"abstract":"  Resource optimisation is commonly used in workload management, ensuring\nefficient and timely task completion utilising available resources. It serves\nto minimise costs, prompting the development of numerous algorithms tailored to\nthis end. The majority of these techniques focus on scheduling and executing\nworkloads effectively within the provided resource constraints. In this paper,\nwe tackle this problem using another approach. We propose a novel framework D&A\nto determine the number of cores required in completing a workload under time\nconstraint. We first preprocess a small portion of queries to derive the number\nof required slots, allowing for the allocation of the remaining workloads into\neach slot. We introduce a scaling factor in handling the time fluctuation issue\ncaused by random functions. We further establish a lower bound of the number of\ncores required under this scenario, serving as a baseline for comparison\npurposes. We examine the framework by computing personalised PageRank values\ninvolving intensive computations. Our experimental results show that D&A\nsurpasses the baseline, achieving reductions in the required number of cores\nranging from 38.89% to 73.68% across benchmark datasets comprising millions of\nvertices and edges.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Discrete Mathematics","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PFkshi363Qz-WzARoFZ1es16rf9Q7GYfQwyAkcpoah0","pdfSize":"419023","objectId":"0x80122d65e0e1fbbee680c2e8fce6363fe239b4dc77a721ed9563e730dee83e87","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
