{"id":"2407.05867","title":"Spin liquid state in an emergent honeycomb lattice antiferromagnet","authors":"J. Khatua, D. Tay, T. Shiroka, M. Pregelj, K. Kargeti, S. K. Panda, G.\n  B. G. Stenning, D. T. Adroja, and P. Khuntia","authorsParsed":[["Khatua","J.",""],["Tay","D.",""],["Shiroka","T.",""],["Pregelj","M.",""],["Kargeti","K.",""],["Panda","S. K.",""],["Stenning","G. B. G.",""],["Adroja","D. T.",""],["Khuntia","P.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 12:30:55 GMT"}],"updateDate":"2024-07-09","timestamp":1720441855000,"abstract":"  In rare-earth-based frustrated magnets, the synergistic interplay between\nspin correlations, spin-orbit coupling and competing exchange interactions\nprovide a promising route to realize exotic quantum states with nontrivial\nexcitations. Here, through thermodynamic and local-probe measurements down to\n16 mK, we demonstrate the exotic magnetism and spin dynamics in the nearly\nperfect emergent honeycomb lattice antiferromagnet TbBO3. The latter embodies a\nfrustrated lattice with a superimposed triangular lattice, constituted by\nadditional Tb3+ ions at the center of each hexagon. Thermodynamic experiments\nreveal the presence of dominant antiferromagnetic interactions with no\nindications of either long-range order or spin freezing down to 50 mK. Despite\nsizable antiferromagnetic exchange interactions between the Tb3+ moments,\nmuon-spin relaxation does not detect any signatures of long-range magnetic\norder or spin-freezing down to 16 mK. This suggests that the spin-orbit-driven\nanisotropic exchange interaction engenders a strong frustration, crucial to\ninduce persistent spin dynamics. The specific-heat data exhibit a T^2.2\npower-law behavior at low temperatures, suggesting gapless excitations\nconsistent with theoretical predictions. The scaling of muon relaxation rate as\na function of the characteristic energy scale for several spin-liquid\ncandidates, including TbBO3, demonstrates a thermally activated behavior. This\nis consistent with NMR results on TbBO3 and reminiscent of a universal QSL\nbehavior, here attributed to short-range spin correlations. Our experimental\nresults are supported by density functional theory + Hubbard U and crystal\nelectric-field calculations, which propose TbBO3 as a promising platform to\nrealize the theoretically proposed quantum disorder state in an\nanisotropy-driven frustrated honeycomb lattice.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}