{"id":"2407.15782","title":"Reconfigurable Intelligent Surface Empowered Full Duplex Systems:\n  Opportunities and Challenges","authors":"Chong Huang and Yun Wen and Long Zhang and Gaojie Chen and Zhen Gao\n  and Pei Xiao","authorsParsed":[["Huang","Chong",""],["Wen","Yun",""],["Zhang","Long",""],["Chen","Gaojie",""],["Gao","Zhen",""],["Xiao","Pei",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 16:37:58 GMT"}],"updateDate":"2024-07-23","timestamp":1721666278000,"abstract":"  Reconfigurable intelligent surfaces (RISs) have emerged as a promising\ntechnology in wireless communications. Simultaneously transmitting and\nreflecting RIS (STAR-RISs) in particular have garnered significant attention\ndue to their dual capabilities of simultaneous transmission and reflection,\nunderscoring their potential applications in critical scenarios within the\nforthcoming sixth-generation (6G) technology landscape. Moreover, full-duplex\n(FD) systems have emerged as a breakthrough research direction in wireless\ntransmission technology due to their high spectral efficiency. This paper\nexplores the application potential of STAR-RIS in FD systems for future\nwireless communications, presenting an innovative technology that provides\nrobust self-interference cancellation (SIC) capabilities for FD systems. We\nutilize the refraction functionality of STAR-RIS enhances the transmission\ncapacity of FD systems, while its reflection functionality is used to eliminate\nself interference within the FD system. We delve into the applications of two\ndifferent types of STAR-RIS in FD systems and compare their performance through\nsimulations. Furthermore, we discuss the performance differences of STAR-RIS\nempowered FD systems under various configurations in a case study, and\ndemonstrate the superiority of the proposed deep learning-based optimization\nalgorithm. Finally, we discuss possible future research directions for STAR-RIS\nempowered FD systems.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}