{"id":"2407.15604","title":"High-flexibility reconstruction of small-scale motions in wall\n  turbulence using a generalized zero-shot learning","authors":"Haokai Wu (2), Kai Zhang (1 and 2), Dai Zhou (1 and 2), Wen-Li Chen\n  (3), Zhaolong Han (1 and 2), Yong Cao (1 and 2) ((1) State Key Laboratory of\n  Ocean Engineering, Shanghai Key Laboratory for Digital Maintenance of\n  Buildings and Infrastructure, Shanghai Jiao Tong University, (2) School of\n  Ocean and Civil Engineering, Shanghai Jiao Tong University, (3) School of\n  Civil Engineering, Harbin Institute of Technology)","authorsParsed":[["Wu","Haokai","","1 and 2"],["Zhang","Kai","","1 and 2"],["Zhou","Dai","","1 and 2"],["Chen","Wen-Li","","1 and 2"],["Han","Zhaolong","","1 and 2"],["Cao","Yong","","1 and 2"]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 12:59:41 GMT"}],"updateDate":"2024-07-23","timestamp":1721653181000,"abstract":"  This study proposes a novel super-resolution (or SR) framework for generating\nhigh-resolution turbulent boundary layer (TBL) flow from low-resolution inputs.\nThe framework combines a super-resolution generative adversarial neural network\n(SRGAN) with down-sampling modules (DMs), integrating the residual of the\ncontinuity equation into the loss function. DMs selectively filter out\ncomponents with excessive energy dissipation in low-resolution fields prior to\nthe super-resolution process. The framework iteratively applies the SRGAN and\nDM procedure to fully capture the energy cascade of multi-scale flow\nstructures, collectively termed the SRGAN-based energy cascade framework\n(EC-SRGAN). Despite being trained solely on turbulent channel flow data (via\n\"zero-shot transfer\"), EC-SRGAN exhibits remarkable generalization in\npredicting TBL small-scale velocity fields, accurately reproducing wavenumber\nspectra compared to DNS results. Furthermore, a super-resolution core is\ntrained at a specific super-resolution ratio. By leveraging this pre-trained\nsuper-resolution core, EC-SRGAN efficiently reconstructs TBL fields at multiple\nsuper-resolution ratios from various levels of low-resolution inputs,\nshowcasing strong flexibility. By learning turbulent scale invariance, EC-SRGAN\ndemonstrates robustness across different TBL datasets. These results underscore\nEC-SRGAN potential for generating and predicting wall turbulence with high\nflexibility, offering promising applications in addressing diverse TBL-related\nchallenges.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}