{"id":"2407.15961","title":"Benchmarking of quantum fidelity kernels for Gaussian process regression","authors":"Xuyang Guo, Jun Dai, Roman V. Krems","authorsParsed":[["Guo","Xuyang",""],["Dai","Jun",""],["Krems","Roman V.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:19:48 GMT"}],"updateDate":"2024-07-24","timestamp":1721672388000,"abstract":"  Quantum computing algorithms have been shown to produce performant quantum\nkernels for machine-learning classification problems. Here, we examine the\nperformance of quantum kernels for regression problems of practical interest.\nFor an unbiased benchmarking of quantum kernels, it is necessary to construct\nthe most optimal functional form of the classical kernels and the most optimal\nquantum kernels for each given data set. We develop an algorithm that uses an\nanalog of the Bayesian information criterion to optimize the sequence of\nquantum gates used to estimate quantum kernels for Gaussian process models. The\nalgorithm increases the complexity of the quantum circuits incrementally, while\nimproving the performance of the resulting kernels, and is shown to yield much\nhigher model accuracy with fewer quantum gates than a fixed quantum circuit\nansatz. We demonstrate that quantum kernels thus obtained can be used to build\naccurate models of global potential energy surfaces (PES) for polyatomic\nmolecules. The average interpolation error of the six-dimensional PES obtained\nwith a random distribution of 2000 energy points is 16 cm$^{-1}$ for\nH$_3$O$^+$, 15 cm$^{-1}$ for H$_2$CO and 88 cm$^{-1}$ for HNO$_2$. We show that\na compositional optimization of classical kernels for Gaussian process\nregression converges to the same errors. This indicates that quantum kernels\ncan achieve the same, though not better, expressivity as classical kernels for\nregression problems.\n","subjects":["Physics/Quantum Physics","Physics/Chemical Physics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}