{"id":"2407.19187","title":"Efficiently improving key weather variables forecasting by performing\n  the guided iterative prediction in latent space","authors":"Shuangliang Li and Siwei Li","authorsParsed":[["Li","Shuangliang",""],["Li","Siwei",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 05:56:37 GMT"}],"updateDate":"2024-07-30","timestamp":1722059797000,"abstract":"  Weather forecasting refers to learning evolutionary patterns of some key\nupper-air and surface variables which is of great significance. Recently, deep\nlearning-based methods have been increasingly applied in the field of weather\nforecasting due to their powerful feature learning capabilities. However,\nprediction methods based on the original space iteration struggle to\neffectively and efficiently utilize large number of weather variables.\nTherefore, we propose an 'encoding-prediction-decoding' prediction network.\nThis network can efficiently benefit to more related input variables with key\nvariables, that is, it can adaptively extract key variable-related\nlow-dimensional latent feature from much more input atmospheric variables for\niterative prediction. And we construct a loss function to guide the iteration\nof latent feature by utilizing multiple atmospheric variables in corresponding\nlead times. The obtained latent features through iterative prediction are then\ndecoded to obtain the predicted values of key variables in multiple lead times.\nIn addition, we improve the HTA algorithm in \\cite{bi2023accurate} by inputting\nmore time steps to enhance the temporal correlation between the prediction\nresults and input variables. Both qualitative and quantitative prediction\nresults on ERA5 dataset validate the superiority of our method over other\nmethods. (The code will be available at https://github.com/rs-lsl/Kvp-lsi)\n","subjects":["Computing Research Repository/Machine Learning","Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"nvW_9gpHPJ0xEpX5FkluCOrmYWo2jIrrf9l83ts9J-U","pdfSize":"4446060"}
