{"id":"2407.21574","title":"Long-term investment and energy procurement risk management under\n  uncertainty for an electrolytic green hydrogen producer","authors":"Owen Palmer, Hugo Radet, Simon Camal, Robin Girard","authorsParsed":[["Palmer","Owen",""],["Radet","Hugo",""],["Camal","Simon",""],["Girard","Robin",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 13:03:49 GMT"}],"updateDate":"2024-08-01","timestamp":1722431029000,"abstract":"  Green hydrogen production by electrolysis is considered essential for global\nclimate ambitions, however development of the industry is lagging behind\nexpectations due to the perceived financial risk for individual projects. For\nnew bilateral Hydrogen Purchase Agreements (HPA's), green hydrogen project\nproponents will seek to manage operating cost risks using investment in\nflexible assets, and energy hedging - two sets of decisions that are usually\nconsidered separately, but are co-optimised in this study to form a\ncomprehensive asset sizing and procurement strategy. A 2-stage market-focused\nstochastic program is developed to model a hydrogen producer supplying an\nindustrial customer, including hydrogen storage, and energy hedging using Power\nPurchase Agreements (PPA's) and power futures. The effects of uncertainty in\nrenewable production, market prices, and hydrogen demand are studied. Several\nplanning methods are tested on the model, benchmarking stochastic methods\nagainst simpler methods that are common in literature and in industry. Finally,\nthe model is applied to several regulatory contexts discernible in the European\ngreen hydrogen classification rules (Renewable Fuel of Non-Biological Origin,\nRFNBO). The results show that in less complex cases, simple rule-based hedging\nmethods can be effective, while in cases with demand uncertainty stochastic\nmodels are advantageous. The results also suggest that new green hydrogen\nsubsidies are likely to stimulate demand for technologically and geographically\ndiverse PPA portfolios.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"VzWvWgdNCnKuN9bwla85bQM9WHAGzCPL2E0e0AenNAU","pdfSize":"1487430"}
