{"id":"2407.21099","title":"The Radio Galaxy Environment Reference Survey (RAGERS): a submillimetre\n  study of the environments of massive radio-quiet galaxies at $z = 1{\\rm -}3$","authors":"Thomas M. Cornish, Julie L. Wardlow, Thomas R. Greve, Scott Chapman,\n  Chian-Chou Chen, Helmut Dannerbauer, Tomotsugu Goto, Bitten Gullberg, Luis C.\n  Ho, Xue-Jian Jiang, Claudia Lagos, Minju Lee, Stephen Serjeant, Hyunjin Shim,\n  Daniel J. B. Smith, Aswin Vijayan, Jeff Wagg, Dazhi Zhou","authorsParsed":[["Cornish","Thomas M.",""],["Wardlow","Julie L.",""],["Greve","Thomas R.",""],["Chapman","Scott",""],["Chen","Chian-Chou",""],["Dannerbauer","Helmut",""],["Goto","Tomotsugu",""],["Gullberg","Bitten",""],["Ho","Luis C.",""],["Jiang","Xue-Jian",""],["Lagos","Claudia",""],["Lee","Minju",""],["Serjeant","Stephen",""],["Shim","Hyunjin",""],["Smith","Daniel J. B.",""],["Vijayan","Aswin",""],["Wagg","Jeff",""],["Zhou","Dazhi",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 18:00:01 GMT"},{"version":"v2","created":"Sat, 3 Aug 2024 13:05:25 GMT"},{"version":"v3","created":"Fri, 30 Aug 2024 14:02:41 GMT"}],"updateDate":"2024-09-02","timestamp":1722362401000,"abstract":"  Measuring the environments of massive galaxies at high redshift is crucial to\nunderstanding galaxy evolution and the conditions that gave rise to the\ndistribution of matter we see in the Universe today. While high-$z$ radio\ngalaxies (H$z$RGs) and quasars tend to reside in protocluster-like systems, the\nenvironments of their radio-quiet counterparts are relatively unexplored,\nparticularly in the submillimetre, which traces dust-obscured star formation.\nIn this study we search for 850 $\\mu$m-selected submillimetre galaxies in the\nenvironments of massive ($M_{\\star} > 10^{11} M_{\\odot}$), radio-quiet ($L_{500\n{\\rm MHz}} \\lesssim 10^{25}$ W Hz$^{-1}$) galaxies at $z \\sim 1\\text{--}3$\nusing S2COSMOS data. By constructing number counts in circular regions of\nradius 1--6 arcmin and comparing with blank-field measurements, we find no\nsignificant overdensities of SMGs around massive radio-quiet galaxies at any of\nthese scales, despite being sensitive down to overdensities of $\\delta \\sim\n0.4$. To probe deeper than the catalogue we also examine the distribution of\npeaks in the SCUBA-2 SNR map, which reveals only tentative signs of any\ndifference in the SMG densities of the radio-quiet galaxy environments compared\nto the blank field, and only on smaller scales (1$^{\\prime}$ radii,\ncorresponding to $\\sim0.5$ Mpc) and higher SNR thresholds. We conclude that\nmassive, radio-quiet galaxies at cosmic noon are typically in environments with\n$\\delta\\lesssim0.4$, which are either consistent with the blank field or\ncontain only weak overdensities spanning sub-Mpc scales. The contrast between\nour results and studies of H$z$RGs with similar stellar masses and redshifts\nimplies an intrinsic link between the wide-field environment and radio AGN\nluminosity at high redshift.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}