{"id":"2407.20746","title":"Large-Scale Horizontal Axis Wind Turbine Aerodynamic Efficiency\n  Optimization using Active Flow Control and Synthetic Jets","authors":"Ahmad Nabhani, Navid M Tousi, Marti Coma, Gabriel Bugeda and Josep M\n  Bergada","authorsParsed":[["Nabhani","Ahmad",""],["Tousi","Navid M",""],["Coma","Marti",""],["Bugeda","Gabriel",""],["Bergada","Josep M",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 11:30:56 GMT"}],"updateDate":"2024-07-31","timestamp":1722339056000,"abstract":"  Efficiency increase is seen as one of the main goals in any energy converting\ndevice. In this direction, the present study aims to demonstrate that\nlarge-scale wind turbines can still be improved in order to generate larger\namounts of energy. The research presented in this manuscript consists of two\nmain blocks. Initially, it analyzes via Computational Fluid Dynamics (CFD) the\nboundary layer dynamics on a set of pre-determined airfoils cut along the\nDTU-10MW reference blade by using the 2D URANS k omega SST turbulence model.\nThe aim of this initial stage is to identify the boundary layer separation\npoint, its associated frequency, and peak to peak amplitude for each airfoil\ncut along the blade, evaluating as well their respective aerodynamic\ncharacteristics. The second main goal of the present research consists of\nimplementing the Active Flow Control (AFC) technology and, when employing\nsynthetic jets, to reattach the boundary layer in all airfoils where it is\nseparated. To accomplish this second goal efficiently, the five parameters\nassociated to the AFC implementation performed to each airfoil will be obtained\nthrough respective genetic algorithm optimizations. An energy assessment is\nfinally undertaken at each airfoil to validate the respective energy gain\nobtained. When comparing the net power gain, before and after AFC\nimplementation, generated by each of the airfoils evaluated, net power gains\nbetween 23 and 36KW are obtained in all airfoils analyzed, clarifying that the\nproposed technology is capable of improving the performance of the wind\nturbines, very likely at any operating condition.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}