{"id":"2407.07245","title":"Accelerating Mobile Edge Generation (MEG) by Constrained Learning","authors":"Xiaoxia Xu, Yuanwei Liu, Xidong Mu, Hong Xing, Arumugam Nallanathan","authorsParsed":[["Xu","Xiaoxia",""],["Liu","Yuanwei",""],["Mu","Xidong",""],["Xing","Hong",""],["Nallanathan","Arumugam",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 21:50:39 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 18:59:12 GMT"}],"updateDate":"2024-08-08","timestamp":1720561839000,"abstract":"  A novel accelerated mobile edge generation (MEG) framework is proposed for\ngenerating high-resolution images on mobile devices. Exploiting a large-scale\nlatent diffusion model (LDM) distributed across edge server (ES) and user\nequipment (UE), cost-efficient artificial intelligence generated content (AIGC)\nis achieved by transmitting low-dimensional features between ES and UE. To\nreduce overheads of both distributed computations and transmissions, a dynamic\ndiffusion and feature merging scheme is conceived. By jointly optimizing the\ndenoising steps and feature merging ratio, the image generation quality is\nmaximized subject to latency and energy consumption constraints. To address\nthis problem and tailor LDM sub-models, a low-complexity MEG acceleration\nprotocol is developed. Particularly, a backbone meta-architecture is trained\nvia offline distillation. Then, dynamic diffusion and feature merging are\ndetermined in online channel environment, which can be viewed as a constrained\nMarkov Decision Process (MDP). A constrained variational policy optimization\n(CVPO) based MEG algorithm is further proposed for constraint-guaranteed\nlearning, namely MEG-CVPO. Numerical results verify that: 1) The proposed\nframework can generate 1024$\\times$1024 high-quality images over noisy channels\nwhile reducing over $40\\%$ latency compared to conventional generation schemes.\n2) The developed MEG-CVPO effectively mitigates constraint violations, thus\nflexibly controlling the trade-off between image distortion and generation\ncosts.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}