{"id":"2407.16848","title":"Studying Critical Parameters of Superconductor via Diamond Quantum\n  Sensors","authors":"Kin On Ho, Wai Kuen Leung, Yiu Yung Pang, King Yau Yip, Jianyu Xie, Yi\n  Man Liu, Aliki Sofia Rotelli, Man Yin Leung, Ho Yin Chow, Kwing To Lai,\n  Andrej Denisenko, B. Keimer, J\\\"org Wrachtrup, Sen Yang","authorsParsed":[["Ho","Kin On",""],["Leung","Wai Kuen",""],["Pang","Yiu Yung",""],["Yip","King Yau",""],["Xie","Jianyu",""],["Liu","Yi Man",""],["Rotelli","Aliki Sofia",""],["Leung","Man Yin",""],["Chow","Ho Yin",""],["Lai","Kwing To",""],["Denisenko","Andrej",""],["Keimer","B.",""],["Wrachtrup","Jörg",""],["Yang","Sen",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 21:23:54 GMT"}],"updateDate":"2024-07-25","timestamp":1721769834000,"abstract":"  Critical parameters are the key to superconductivity research, and reliable\ninstrumentations can facilitate the study. Traditionally, one has to use\nseveral different measurement techniques to measure critical parameters\nseparately. In this work, we develop the use of a single species of quantum\nsensor to determine and estimate several critical parameters with the help of\nindependent simulation data. We utilize the nitrogen-vacancy (NV) center in the\ndiamond, which recently emerged as a promising candidate for probing exotic\nfeatures in condensed matter physics. The non-invasive and highly stable nature\nprovides extraordinary opportunities to solve scientific problems in various\nsystems. Using a high-quality single-crystalline YBa$_{2}$Cu$_{4}$O$_{8}$\n(YBCO) as a platform, we demonstrate the use of diamond particles and a bulk\ndiamond to probe the Meissner effect. The evolution of the vector magnetic\nfield, the $H-T$ phase diagram, and the map of fluorescence contour are studied\nvia NV sensing. Our results reveal different critical parameters, including\nlower critical field $H_{c1}$, upper critical field $H_{c2}$, and critical\ncurrent density $j_{c}$, as well as verifying the unconventional nature of this\nhigh-temperature superconductor YBCO. Therefore, NV-based quantum sensing\ntechniques have huge potential in condensed matter research.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Superconductivity","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}