{"id":"2407.13185","title":"KFD-NeRF: Rethinking Dynamic NeRF with Kalman Filter","authors":"Yifan Zhan, Zhuoxiao Li, Muyao Niu, Zhihang Zhong, Shohei Nobuhara, Ko\n  Nishino, Yinqiang Zheng","authorsParsed":[["Zhan","Yifan",""],["Li","Zhuoxiao",""],["Niu","Muyao",""],["Zhong","Zhihang",""],["Nobuhara","Shohei",""],["Nishino","Ko",""],["Zheng","Yinqiang",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 05:48:24 GMT"}],"updateDate":"2024-07-19","timestamp":1721281704000,"abstract":"  We introduce KFD-NeRF, a novel dynamic neural radiance field integrated with\nan efficient and high-quality motion reconstruction framework based on Kalman\nfiltering. Our key idea is to model the dynamic radiance field as a dynamic\nsystem whose temporally varying states are estimated based on two sources of\nknowledge: observations and predictions. We introduce a novel plug-in Kalman\nfilter guided deformation field that enables accurate deformation estimation\nfrom scene observations and predictions. We use a shallow Multi-Layer\nPerceptron (MLP) for observations and model the motion as locally linear to\ncalculate predictions with motion equations. To further enhance the performance\nof the observation MLP, we introduce regularization in the canonical space to\nfacilitate the network's ability to learn warping for different frames.\nAdditionally, we employ an efficient tri-plane representation for encoding the\ncanonical space, which has been experimentally demonstrated to converge quickly\nwith high quality. This enables us to use a shallower observation MLP,\nconsisting of just two layers in our implementation. We conduct experiments on\nsynthetic and real data and compare with past dynamic NeRF methods. Our\nKFD-NeRF demonstrates similar or even superior rendering performance within\ncomparable computational time and achieves state-of-the-art view synthesis\nperformance with thorough training.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}