{"id":"2407.08162","title":"Improving Visual Place Recognition Based Robot Navigation Through\n  Verification of Localization Estimates","authors":"Owen Claxton, Connor Malone, Helen Carson, Jason Ford, Gabe Bolton,\n  Iman Shames, Michael Milford","authorsParsed":[["Claxton","Owen",""],["Malone","Connor",""],["Carson","Helen",""],["Ford","Jason",""],["Bolton","Gabe",""],["Shames","Iman",""],["Milford","Michael",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 03:47:14 GMT"}],"updateDate":"2024-07-12","timestamp":1720669634000,"abstract":"  Visual Place Recognition (VPR) systems often have imperfect performance,\nwhich affects robot navigation decisions. This research introduces a novel\nMulti-Layer Perceptron (MLP) integrity monitor for VPR which demonstrates\nimproved performance and generalizability over the previous state-of-the-art\nSVM approach, removing per-environment training and reducing manual tuning\nrequirements. We test our proposed system in extensive real-world experiments,\nwhere we also present two real-time integrity-based VPR verification methods:\nan instantaneous rejection method for a robot navigating to a goal zone\n(Experiment 1); and a historical method that takes a best, verified, match from\nits recent trajectory and uses an odometer to extrapolate forwards to a current\nposition estimate (Experiment 2). Noteworthy results for Experiment 1 include a\ndecrease in aggregate mean along-track goal error from ~9.8m to ~3.1m in\nmissions the robot pursued to completion, and an increase in the aggregate rate\nof successful mission completion from ~41% to ~55%. Experiment 2 showed a\ndecrease in aggregate mean along-track localization error from ~2.0m to ~0.5m,\nand an increase in the aggregate precision of localization attempts from ~97%\nto ~99%. Overall, our results demonstrate the practical usefulness of a VPR\nintegrity monitor in real-world robotics to improve VPR localization and\nconsequent navigation performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}