{"id":"2407.19943","title":"Practical and Robust Safety Guarantees for Advanced Counterfactual\n  Learning to Rank","authors":"Shashank Gupta, Harrie Oosterhuis, and Maarten de Rijke","authorsParsed":[["Gupta","Shashank",""],["Oosterhuis","Harrie",""],["de Rijke","Maarten",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 12:23:59 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 21:16:16 GMT"}],"updateDate":"2024-08-08","timestamp":1722255839000,"abstract":"  Counterfactual learning to rank (CLTR) can be risky and, in various\ncircumstances, can produce sub-optimal models that hurt performance when\ndeployed. Safe CLTR was introduced to mitigate these risks when using inverse\npropensity scoring to correct for position bias. However, the existing safety\nmeasure for CLTR is not applicable to state-of-the-art CLTR methods, cannot\nhandle trust bias, and relies on specific assumptions about user behavior. Our\ncontributions are two-fold. First, we generalize the existing safe CLTR\napproach to make it applicable to state-of-the-art doubly robust CLTR and trust\nbias. Second, we propose a novel approach, proximal ranking policy optimization\n(PRPO), that provides safety in deployment without assumptions about user\nbehavior. PRPO removes incentives for learning ranking behavior that is too\ndissimilar to a safe ranking model. Thereby, PRPO imposes a limit on how much\nlearned models can degrade performance metrics, without relying on any specific\nuser assumptions. Our experiments show that both our novel safe doubly robust\nmethod and PRPO provide higher performance than the existing safe inverse\npropensity scoring approach. However, in unexpected circumstances, the safe\ndoubly robust approach can become unsafe and bring detrimental performance. In\ncontrast, PRPO always maintains safety, even in maximally adversarial\nsituations. By avoiding assumptions, PRPO is the first method with\nunconditional safety in deployment that translates to robust safety for\nreal-world applications.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mzy3VPzWwI5YQmReaM2USrMwvviE0dY3_e2JcMWwTP0","pdfSize":"1240601"}
