{"id":"2407.13931","title":"Who Wins Ethereum Block Building Auctions and Why?","authors":"Burak \\\"Oz, Danning Sui, Thomas Thiery, Florian Matthes","authorsParsed":[["Öz","Burak",""],["Sui","Danning",""],["Thiery","Thomas",""],["Matthes","Florian",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 22:49:37 GMT"}],"updateDate":"2024-07-22","timestamp":1721342977000,"abstract":"  The MEV-Boost block auction contributes approximately 90% of all Ethereum\nblocks. Between October 2023 and March 2024, only three builders produced 80%\nof them, highlighting the concentration of power within the block builder\nmarket. To foster competition and preserve Ethereum's decentralized ethos and\ncensorship-resistance properties, understanding the dominant players'\ncompetitive edges is essential.\n  In this paper, we identify features that play a significant role in builders'\nability to win blocks and earn profits by conducting a comprehensive empirical\nanalysis of MEV-Boost auctions over a six-month period. We reveal that block\nmarket share positively correlates with order flow diversity, while\nprofitability correlates with access to order flow from Exclusive Providers,\nsuch as integrated searchers and external providers with exclusivity deals.\nAdditionally, we show a positive correlation between market share and profit\nmargin among the top ten builders, with features such as exclusive signal,\nnon-atomic arbitrages, and Telegram bot flow strongly correlating with both\nmetrics. This highlights a \"chicken-and-egg\" problem where builders need\ndifferentiated order flow to profit, but only receive such flow if they have a\nsignificant market share. Overall, this work provides an in-depth analysis of\nthe key features driving the builder market towards centralization and offers\nvaluable insights for designing further iterations of Ethereum block auctions,\npreserving Ethereum's censorship resistance properties.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jE0_1bHuJrh0pq-dot6t80AMqiRQ_GQD_QaWz80Gwfw","pdfSize":"1408899"}
