{"id":"2407.01787","title":"Plasma Induced Variation of Electron Capture and Bound-State $\\beta$\n  Decays","authors":"Bharat Mishra, Angelo Pidatella, Simone Taioli, Stefano Simonucci,\n  David Mascali","authorsParsed":[["Mishra","Bharat",""],["Pidatella","Angelo",""],["Taioli","Simone",""],["Simonucci","Stefano",""],["Mascali","David",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 20:28:04 GMT"}],"updateDate":"2024-07-03","timestamp":1719865684000,"abstract":"  The slow neutron capture ($s$-process) synthesises ~50% of all elements in\nthe universe heavier than iron, whose abundances are determined by the\ncompetition between neutron capture and nuclear $\\beta$-decay rates. The latter\nare expected to vary inside hot and dense plasmas such as those found in\n$s$-process nucleosynthesis sites. Here, we present a new and general\ntheoretical study of the effect of local and non-local thermodynamic\nequilibrium ((N)LTE) plasmas on $\\beta$-decays, using orbital electron capture\n(EC) decays in $^{7}$Be as a model case. We begin from the model of Takahashi\nand Yokoi to calculate the lepton phase volume of $^{7}$Be as a function of its\nionisation state and excitation level, and consequently, the\nconfiguration-dependent EC decay rate. We then calculate the in-plasma ion\ncharge state distribution (CSD) and level population distribution (LPD) for a\ngrid of plasma density and temperatures, using the population kinetics code\nFLYCHK. By combining the configuration-dependent EC rate with the CSD and LPD,\nwe calculate the in-plasma orbital EC rate in $^{7}$Be. The results show a\nstrong correlation between the half-life and thermodynamic conditions of the\nplasma, underlining the importance of measuring decay rates in laboratory\nplasmas and the relevance of high precision atomic configuration models. The\nmodel discussed in this work is capable of calculating EC and bound state\n$\\beta$ decay (BSBD) rates in both low-density NLTE and high-density LTE\nplasmas. We conclude by validating our model with state-of-the-art data in\nliterature on isotopes of Pr and Dy, and by proposing future extension of the\nmodel to laboratory magnetoplasmas and stellar interiors aimed at improving\nnucleosynthesis models.\n","subjects":["Physics/Plasma Physics","Physics/Nuclear Theory","Physics/Atomic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vxS1pGifFK6n6z6IaRwPQ_ks6cRJDIoJzmD0COvsExY","pdfSize":"11241644"}
