{"id":"2407.18857","title":"Multi-Scenario and Stochastic Thermo-Electro-Mechanical Modeling of\n  Failure in Power Transmission Lines","authors":"Prakash KC, Maryam Naghibolhosseini, and Mohsen Zayernouri","authorsParsed":[["KC","Prakash",""],["Naghibolhosseini","Maryam",""],["Zayernouri","Mohsen",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 16:45:22 GMT"}],"updateDate":"2024-07-29","timestamp":1722012322000,"abstract":"  Transmission lines, crucial to the power grid, are subjected to diverse\nenvironmental conditions such as wind, temperature, humidity, and pollution.\nWhile these conditions represent a consistent impact on the transmission lines,\ncertain unpredictable conditions such as unexpected high wind, wildfire, and\nicing pose catastrophic risks to the reliability and integrity of the\ntransmission lines. These factors in the presence of initial damage and\nelectrical loads greatly affect the material properties. In this paper, we\ndevelop a comprehensive thermo-electro-mechanical model to investigate the\nlong-term effect of unexpected high wind, wildfire, and ice on transmission\nlines. This study offers an in-depth perspective on temperature and damage\nevolution within the power lines by incorporating a phase field model for\ndamage and fatigue, alongside thermal and electrical models. We define a state\nfunction to assess the failure, considering damage and temperature. We study\nthree scenarios deterministically to establish a basic understanding and\nanalyze the stochastic behavior using the Probabilistic Collocation Method\n(PCM). We utilize PCM for forward uncertainty quantification, conducting\nsensitivity analysis, and evaluating the probability of failure. This approach\noffers an in-depth examination of the potential risks associated with\ntransmission lines under unfavorable circumstances.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}