{"id":"2407.09902","title":"Air-Ground Collaboration with SPOMP: Semantic Panoramic Online Mapping\n  and Planning","authors":"Ian D. Miller, Fernando Cladera, Trey Smith, Camillo Jose Taylor,\n  Vijay Kumar","authorsParsed":[["Miller","Ian D.",""],["Cladera","Fernando",""],["Smith","Trey",""],["Taylor","Camillo Jose",""],["Kumar","Vijay",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 14:37:44 GMT"}],"updateDate":"2024-07-16","timestamp":1720881464000,"abstract":"  Mapping and navigation have gone hand-in-hand since long before robots\nexisted. Maps are a key form of communication, allowing someone who has never\nbeen somewhere to nonetheless navigate that area successfully. In the context\nof multi-robot systems, the maps and information that flow between robots are\nnecessary for effective collaboration, whether those robots are operating\nconcurrently, sequentially, or completely asynchronously. In this paper, we\nargue that maps must go beyond encoding purely geometric or visual information\nto enable increasingly complex autonomy, particularly between robots. We\npropose a framework for multi-robot autonomy, focusing in particular on air and\nground robots operating in outdoor 2.5D environments. We show that semantic\nmaps can enable the specification, planning, and execution of complex\ncollaborative missions, including localization in GPS-denied settings. A\ndistinguishing characteristic of this work is that we strongly emphasize field\nexperiments and testing, and by doing so demonstrate that these ideas can work\nat scale in the real world. We also perform extensive simulation experiments to\nvalidate our ideas at even larger scales. We believe these experiments and the\nexperimental results constitute a significant step forward toward advancing the\nstate-of-the-art of large-scale, collaborative multi-robot systems operating\nwith real communication, navigation, and perception constraints.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}