{"id":"2407.07626","title":"Fusion of atomic W-like states in cavity QED systems","authors":"Cheng-Yun Ding, Wan-Fang Liu and Li-Hua Zhang","authorsParsed":[["Ding","Cheng-Yun",""],["Liu","Wan-Fang",""],["Zhang","Li-Hua",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 13:01:05 GMT"}],"updateDate":"2024-07-11","timestamp":1720616465000,"abstract":"  It is well-known that maximally entangled GHZ states can achieve perfect\nteleportation and superdense coding, whereas maximally entangled W states\ncannot. However, it has been demonstrated that there exists a special class of\nnon-maximally entangled W states, called as \\textit{W-like} states, which can\novercome this limitation. Therefore, it is of great significance to prepare\nsuch W-like states for efficient quantum communication. Here, we propose two\nkinds of novel and efficient fusion schemes for atomic W-like states based on\nthe large-detuning interactions between several atoms and a single-mode cavity\nfield, with which large-scale atomic $|\\mathcal{W}_{N+M-1}\\rangle$ and\n$|\\mathcal{W}_{N+M+T-2}\\rangle$ states can be prepared, respectively, from two\nsmall-scale atomic $|\\mathcal{W}_{N}\\rangle$ and $|\\mathcal{W}_{M}\\rangle$\nstates and three small-scale atomic $|\\mathcal{W}_{N}\\rangle$,\n$|\\mathcal{W}_{M}\\rangle$ and $|\\mathcal{W}_{T}\\rangle$ states, by detecting\nthe states of one or two of the fused atoms. Particularly, although the fusion\nprocess of our scheme involves particle loss, the corresponding success\nprobability is high and fixed, which may induce high fusion efficiency.\nFurthermore, through the investigation of the resource cost and feasibility\nanalysis, our protocol is simple and feasible under the current experimental\nconditions. All these suggest that it provides an alternative strategy for\npreparing large-scale atomic W-like states for perfect teleportation and\nsuperdense coding.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}