{"id":"2407.00940","title":"Unifying thermophotovoltaic performance metrics with technoeconomics:\n  the relative importance of efficiency vs. power density","authors":"Shomik Verma, Kyle Buznitsky, Asegun Henry","authorsParsed":[["Verma","Shomik",""],["Buznitsky","Kyle",""],["Henry","Asegun",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 03:42:06 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 20:44:08 GMT"}],"updateDate":"2024-08-01","timestamp":1719805326000,"abstract":"  Thermophotovoltaics (TPV) are becoming a promising new heat engine with rapid\nrecent gains in performance. Their performance is characterized by two metrics:\nefficiency and power density. As we bridge the gap between lab-scale and\nsystem-scale devices, we need to understand how each of these metrics impacts\nthe technoeconomics of a TPV system. In this work, we develop a technoeconomic\nmetric based on the levelized cost of electricity (LCOE) to understand how the\nmetrics should be weighted relative to each other in terms of importance. We\nfind that systems with high infrastructure and fuel costs should prioritize TPV\nefficiency, while systems where the TPV cell cost dominates should prioritize\npower density. We then evaluate how concrete cell improvements could improve\nthe technoeconomics of five example systems, identifying the most impactful\nspecific properties. Namely, improving spectral control with sub-bandgap\nreflectance is the most effective at reducing LCOE in systems with high\ninfrastructure cost, while increasing view factor and reducing series\nresistance are most critical in systems with high TPV cell cost. Improving just\n1-2 of these properties can reduce the LCOE by 30-50%, reaching competitive\nvalues of 8 cents/kWh. This study therefore helps researchers understand which\nperformance metric is more important for their application and how to achieve\nhigh values of this performance metric.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}