{"id":"2407.08172","title":"Deciphering Viral Trends in WhatsApp: A Case Study From a Village in\n  Rural India","authors":"Kiran Garimella, Bharat Nayak, Simon Chauchard, Aditya Vashistha","authorsParsed":[["Garimella","Kiran",""],["Nayak","Bharat",""],["Chauchard","Simon",""],["Vashistha","Aditya",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 20:31:06 GMT"}],"updateDate":"2024-07-12","timestamp":1719606666000,"abstract":"  This research studies the nature and spread of WhatsApp content among\neveryday users in a rural Indian village. Leveraging a dataset of hundreds of\nprivate WhatsApp groups collected with consent from participants, our study\nuncovers the kinds of WhatsApp groups users are part of, marking the first such\ncategorization. The dataset comprises tens of thousands of messages, out of\nwhich we manually classified 604 pieces of content designated as 'forwarded\nmany times'-indicating their viral status.\n  Our key findings indicate a high prevalence of content focused on national\npolitics, with the viral messages overwhelmingly supporting a specific\npolitical party and disparaging the opposition. Significantly, these messages\nwere fraught with misinformation, engendering hate against Muslims and\npromoting a narrative of Hindus being under threat. This trend was particularly\nnoticeable within caste-based groups, which were dominated by misinformation,\npro-BJP rhetoric, anti-Congress content, and Hindutva propaganda. Remarkably,\nmuch of the misinformation circulating had previously been discredited by\nestablished fact-checking organizations. This suggests not only a recurring\ncycle of debunked information reappearing but also that fact-checks are failing\nto penetrate these specific groups.\n  As the first quantitative analysis of everyday WhatsApp use in a rural\ncontext, this research has far-reaching implications for understanding the\nunique challenges posed by end-to-end encrypted platforms. It serves as a\ncrucial baseline for designing more effective moderation policies aimed at\ncombating misinformation and fostering a more responsible use of encrypted\ncommunication channels.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/"}