{"id":"2407.08305","title":"TESS observations of non-Be fast rotators","authors":"Yael Naze (FNRS/Uliege), Nikolay Britavskiy (ULiege, ROB), Jonathan\n  Labadie-Bartz (Paris Obs.)","authorsParsed":[["Naze","Yael","","FNRS/Uliege"],["Britavskiy","Nikolay","","ULiege, ROB"],["Labadie-Bartz","Jonathan","","Paris Obs."]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 08:51:19 GMT"}],"updateDate":"2024-07-12","timestamp":1720687879000,"abstract":"  The variability of fast-rotating Oe/Be stars has been reported in detail in\nrecent years. However, much less known about the behaviour of fast-rotating OB\nstars without known decretion disks, and hence it is difficult to identify the\ncommonalities and differences in the photometric variability of these two\npopulations, especially with regards to their pulsational properties and their\nlink with the presence of circumstellar material. Via an in-depth literature\nsearch, we identified a set of fast-rotating (v sin(i)>200 km/s) early B-type\nstars not known to have disks. TESS and Kepler light curves were built for 58\nstars that appear isolated (no bright neighbour within 1 arcmin and no known\ncompanion) to avoid contamination of the light curves. Frequency spectra were\ncalculated and then analysed to determine the noise level and the presence of\nsignificant signals above the noise. Red noise is detected in all targets,\nwithout obvious correlations between noise and stellar parameters. Long-term\nchanges are much less frequent than in Be stars, with only 12% of our targets\nhaving the variability below 0.5/d dominating their frequency spectrum. In\ncontrast, strong frequency groups are detected in about a third of targets, as\nin Be stars. These groups generally occur in pairs with harmonic frequencies,\nas is usually seen in Be stars, but with the first group more often displaying\nlarger amplitudes. Finally, the most frequent variability is due to isolated\nfrequencies in the 0.5-6./d range (which is found in two-thirds of cases and\ndominates the spectra in 42% of the sample). Higher-frequency signals (up to\n40/d) are sometimes also detected but rarely (only 12% of stars) appear as the\nstrongest ones of the frequency spectra. Overall, fast-rotating B-type stars,\nwith or without disks, display similar photometric properties, except as\nregards their longer-term behaviour.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}