{"id":"2407.14876","title":"Preictal Period Optimization for Deep Learning-Based Epileptic Seizure\n  Prediction","authors":"Petros Koutsouvelis, Bartlomiej Chybowski, Alfredo Gonzalez-Sulser,\n  Shima Abdullateef, Javier Escudero","authorsParsed":[["Koutsouvelis","Petros",""],["Chybowski","Bartlomiej",""],["Gonzalez-Sulser","Alfredo",""],["Abdullateef","Shima",""],["Escudero","Javier",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 13:49:14 GMT"}],"updateDate":"2024-07-23","timestamp":1721483354000,"abstract":"  Accurate prediction of epileptic seizures could prove critical for improving\npatient safety and quality of life in drug-resistant epilepsy. Although deep\nlearning-based approaches have shown promising seizure prediction performance\nusing scalp electroencephalogram (EEG) signals, substantial limitations still\nimpede their clinical adoption. Furthermore, identifying the optimal preictal\nperiod (OPP) for labeling EEG segments remains a challenge. Here, we not only\ndevelop a competitive deep learning model for seizure prediction but, more\nimportantly, leverage it to demonstrate a methodology to comprehensively\nevaluate the predictive performance in the seizure prediction task. For this,\nwe introduce a CNN-Transformer deep learning model to detect preictal\nspatiotemporal dynamics, alongside a novel Continuous Input-Output Performance\nRatio (CIOPR) metric to determine the OPP. We trained and evaluated our model\non 19 pediatric patients of the open-access CHB-MIT dataset in a\nsubject-specific manner. Using the OPP of each patient, preictal and interictal\nsegments were correctly identified with an average sensitivity of 99.31%,\nspecificity of 95.34%, AUC of 99.35%, and F1- score of 97.46%, while prediction\ntime averaged 76.8 minutes before onset. Notably, our novel CIOPR metric\nallowed outlining the impact of different preictal period definitions on\nprediction time, accuracy, output stability, and transition time between\ninterictal and preictal states in a comprehensive and quantitative way and\nhighlighted the importance of considering both inter- and intra-patient\nvariability in seizure prediction.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}