{"id":"2407.13909","title":"PRAGyan -- Connecting the Dots in Tweets","authors":"Rahul Ravi, Gouri Ginde, Jon Rokne","authorsParsed":[["Ravi","Rahul",""],["Ginde","Gouri",""],["Rokne","Jon",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 21:49:32 GMT"}],"updateDate":"2024-07-22","timestamp":1721339372000,"abstract":"  As social media platforms grow, understanding the underlying reasons behind\nevents and statements becomes crucial for businesses, policymakers, and\nresearchers. This research explores the integration of Knowledge Graphs (KGs)\nwith Large Language Models (LLMs) to perform causal analysis of tweets dataset.\nThe LLM aided analysis techniques often lack depth in uncovering the causes\ndriving observed effects. By leveraging KGs and LLMs, which encode rich\nsemantic relationships and temporal information, this study aims to uncover the\ncomplex interplay of factors influencing causal dynamics and compare the\nresults obtained using GPT-3.5 Turbo. We employ a Retrieval-Augmented\nGeneration (RAG) model, utilizing a KG stored in a Neo4j (a.k.a PRAGyan) data\nformat, to retrieve relevant context for causal reasoning. Our approach\ndemonstrates that the KG-enhanced LLM RAG can provide improved results when\ncompared to the baseline LLM (GPT-3.5 Turbo) model as the source corpus\nincreases in size. Our qualitative analysis highlights the advantages of\ncombining KGs with LLMs for improved interpretability and actionable insights,\nfacilitating informed decision-making across various domains. Whereas,\nquantitative analysis using metrics such as BLEU and cosine similarity show\nthat our approach outperforms the baseline by 10\\%.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lU3XtTWo5zoZgQSuJUTRyWSDWcHc2FV6ZQ1mgBWk-Do","pdfSize":"520860","objectId":"0x616cbdea6edb8e0bf89322fd817f8959737c95501442162f494b67366d98c415","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
