{"id":"2407.04848","title":"Beam Maps of the Canadian Hydrogen Intensity Mapping Experiment (CHIME)\n  Measured with a Drone","authors":"Will Tyndall, Alex Reda, J. Richard Shaw, Kevin Bandura, Arnab\n  Chakraborty, Emily Kuhn, Joshua MacEachern, Juan Mena-Parra, Laura Newburgh,\n  Anna Ordog, Tristan Pinsonneault-Marotte, Anna Rose Polish, Ben Saliwanchik,\n  Pranav Sanghavi, Seth R. Siegel, Audrey Whitmer, Dallas Wulf","authorsParsed":[["Tyndall","Will",""],["Reda","Alex",""],["Shaw","J. Richard",""],["Bandura","Kevin",""],["Chakraborty","Arnab",""],["Kuhn","Emily",""],["MacEachern","Joshua",""],["Mena-Parra","Juan",""],["Newburgh","Laura",""],["Ordog","Anna",""],["Pinsonneault-Marotte","Tristan",""],["Polish","Anna Rose",""],["Saliwanchik","Ben",""],["Sanghavi","Pranav",""],["Siegel","Seth R.",""],["Whitmer","Audrey",""],["Wulf","Dallas",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 20:19:08 GMT"}],"updateDate":"2024-07-09","timestamp":1720210748000,"abstract":"  We present beam measurements of the CHIME telescope using a radio calibration\nsource deployed on a drone payload. During test flights, the pulsing\ncalibration source and the telescope were synchronized to GPS time, enabling\nin-situ background subtraction for the full $N^{2}$ visibility matrix for one\nCHIME cylindrical reflector. We use the autocorrelation products to estimate\nthe primary beam width and centroid location, and compare these quantities to\nsolar transit measurements and holographic measurements where they overlap on\nthe sky. We find that the drone, solar, and holography data have similar beam\nparameter evolution across frequency and both spatial coordinates. This paper\npresents the first drone-based beam measurement of a large cylindrical radio\ninterferometer. Furthermore, the unique analysis and instrumentation described\nin this paper lays the foundation for near-field measurements of experiments\nlike CHIME.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}