{"id":"2407.02900","title":"Self-supervised Vision Transformer are Scalable Generative Models for\n  Domain Generalization","authors":"Sebastian Doerrich, Francesco Di Salvo, Christian Ledig","authorsParsed":[["Doerrich","Sebastian",""],["Di Salvo","Francesco",""],["Ledig","Christian",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 08:20:27 GMT"}],"updateDate":"2024-07-04","timestamp":1719994827000,"abstract":"  Despite notable advancements, the integration of deep learning (DL)\ntechniques into impactful clinical applications, particularly in the realm of\ndigital histopathology, has been hindered by challenges associated with\nachieving robust generalization across diverse imaging domains and\ncharacteristics. Traditional mitigation strategies in this field such as data\naugmentation and stain color normalization have proven insufficient in\naddressing this limitation, necessitating the exploration of alternative\nmethodologies. To this end, we propose a novel generative method for domain\ngeneralization in histopathology images. Our method employs a generative,\nself-supervised Vision Transformer to dynamically extract characteristics of\nimage patches and seamlessly infuse them into the original images, thereby\ncreating novel, synthetic images with diverse attributes. By enriching the\ndataset with such synthesized images, we aim to enhance its holistic nature,\nfacilitating improved generalization of DL models to unseen domains. Extensive\nexperiments conducted on two distinct histopathology datasets demonstrate the\neffectiveness of our proposed approach, outperforming the state of the art\nsubstantially, on the Camelyon17-wilds challenge dataset (+2%) and on a second\nepithelium-stroma dataset (+26%). Furthermore, we emphasize our method's\nability to readily scale with increasingly available unlabeled data samples and\nmore complex, higher parametric architectures. Source code is available at\nhttps://github.com/sdoerrich97/vits-are-generative-models .\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZzkDGlY5MCV1xhDdsqam7SQjf84rnXFp_MM5CpQrYdo","pdfSize":"5196430"}
