{"id":"2407.06385","title":"MUSE spectroscopy of the high abundance discrepancy planetary nebula NGC\n  6153","authors":"V. G\\'omez-Llanos (1,2), J. Garc\\'ia-Rojas (1,2), C. Morisset (3,4),\n  H. Monteiro (5), D. Jones (1,2,6), R. Wesson (7), H. M. J. Boffin (8), R. L.\n  M. Corradi (1,2,9) ((1) IAC, Spain, (2) ULL, Spain, (3) IA-UNAM, Ensenada,\n  Mexico, (4) ICF-UNAM, Cuernavaca, Mexico, (5) U. Itajub\\'a, Brazil, (6) NOT,\n  Spain, (7) Cardiff Univ., UK, (8) ESO, Germany, (9) GTC, Spain)","authorsParsed":[["Gómez-Llanos","V.",""],["García-Rojas","J.",""],["Morisset","C.",""],["Monteiro","H.",""],["Jones","D.",""],["Wesson","R.",""],["Boffin","H. M. J.",""],["Corradi","R. L. M.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 20:54:16 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 05:54:11 GMT"},{"version":"v3","created":"Thu, 25 Jul 2024 12:28:29 GMT"}],"updateDate":"2024-09-18","timestamp":1720472056000,"abstract":"  (Abridged) The abundance discrepancy problem in planetary nebulae (PNe) has\nlong puzzled astronomers. NGC6153, with its high Abundance Discrepancy Factor\n(ADF~10), provides an opportunity to understand the chemical structure and\nionisation processes by constructing detailed emission line maps and examining\nvariations in electron temperature and density. We used the MUSE spectrograph\nto acquire IFU data covering the wavelength range 4600-9300 \\AA\\ with a spatial\nsampling of 0.2 arcsec and spectral resolutions ranging from R = 1600-3500. We\ncreated emission line maps for 60 lines and two continuum regions. We developed\na tailored methodology for the analysis of the data, including correction for\nrecombination contributions to auroral lines and the contributions of different\nplasma phases. Our analysis confirmed the presence of a low-temperature plasma\ncomponent in NGC6153. We find that electron temperatures derived from\nrecombination line and continuum diagnostics are significantly lower than those\nderived from collisionally excited line diagnostics. Ionic chemical abundance\nmaps were constructed, considering the weight of the cold plasma phase in the\nHI emission. Adopting this approach, we found ionic abundances that could be up\nto 0.2 dex lower for those derived from CELs and up to 1.1 dex higher for those\nderived from RLs than in the case of an homogeneous HI emission. The abundance\ncontrast factor (ACF) between both plasma components was defined, with values,\non average, 0.9 dex higher than the ADF. Different methods for calculating\nionisation correction factors (ICFs) yielded consistent results. Our findings\nemphasise that accurate chemical abundance determinations in high-ADF PNe must\naccount for multiple plasma phases.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}