{"id":"2407.20690","title":"Double-side Integration of the Fluorinated Self-Assembling Monolayers\n  for Enhanced Stability of Inverted Perovskite Solar Cells","authors":"Ekaterina A. Ilicheva, Polina K. Sukhorukova, Lev O. Luchnikov, Dmitry\n  O. Balakirev, Nikita S. Saratovsky, Andrei P. Morozov, Pavel A. Gostishchev,\n  S. Yu. Yurchuk, Anton A. Vasilev, Sergey S. Kozlov, Sergey I. Didenko,\n  Svetlana M. Peregudova, Dmitry S. Muratov, Yuriy N. Luponosov, and Danila S.\n  Saranin","authorsParsed":[["Ilicheva","Ekaterina A.",""],["Sukhorukova","Polina K.",""],["Luchnikov","Lev O.",""],["Balakirev","Dmitry O.",""],["Saratovsky","Nikita S.",""],["Morozov","Andrei P.",""],["Gostishchev","Pavel A.",""],["Yurchuk","S. Yu.",""],["Vasilev","Anton A.",""],["Kozlov","Sergey S.",""],["Didenko","Sergey I.",""],["Peregudova","Svetlana M.",""],["Muratov","Dmitry S.",""],["Luponosov","Yuriy N.",""],["Saranin","Danila S.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 09:35:37 GMT"}],"updateDate":"2024-07-31","timestamp":1722332137000,"abstract":"  Traps and structural defects at the hole and electron transport interfaces of\nthe microcrystalline absorber limits the efficiency and long-term stability of\nperovskite solar cells (PSCs) due to accumulation of the ionic clusters,\nnon-radiative recombination and electrochemical corrosion. Surface engineering\nusing self-assembled monolayers (SAM) was considered as an effective strategy\nfor modification of charge-collection junctions. In this work, we demonstrate\nthe first report about complex integration of a SAM for double-side passivation\nin p-i-n PSCs. Integrating the novel\n5-(4-[bis(4-fluorophenyl)amino]phenyl)thiophene-2-carboxylic acid (FTPATC) as a\nfluorinated SAM at the hole-transport interface reduced potential barriers and\nlattice stresses in the absorber. At the electron-transport side, FTPATC\ninteracted with the A-site cations of the perovskite molecule (Cs,\nformamidinium), inducing a dipole for defect compensation. Using the\npassivation approach with fluorinated SAM demonstrated benefits in the gain of\nthe output performance up to 22.2%. The key-advantage of double-side\npassivation was confirmed by the enhanced stability under continuous\nlight-soaking (1-sun equivalent, 65 C, ISOS-L-2), maintaining 88% of the\ninitial performance over 1680 hours and thermal stabilization under harsh\nheating at 90 C.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}