{"id":"2407.01545","title":"In the Shadow of Smith`s Invisible Hand: Risks to Economic Stability and\n  Social Wellbeing in the Age of Intelligence","authors":"Jo-An Occhipinti, William Hynes, Ante Prodan, Harris A. Eyre, Roy\n  Green, Sharan Burrow, Marcel Tanner, John Buchanan, Goran Ujdur, Frederic\n  Destrebecq, Christine Song, Steven Carnevale, Ian B. Hickie, Mark Heffernan","authorsParsed":[["Occhipinti","Jo-An",""],["Hynes","William",""],["Prodan","Ante",""],["Eyre","Harris A.",""],["Green","Roy",""],["Burrow","Sharan",""],["Tanner","Marcel",""],["Buchanan","John",""],["Ujdur","Goran",""],["Destrebecq","Frederic",""],["Song","Christine",""],["Carnevale","Steven",""],["Hickie","Ian B.",""],["Heffernan","Mark",""]],"versions":[{"version":"v1","created":"Mon, 22 Apr 2024 06:16:48 GMT"}],"updateDate":"2024-07-03","timestamp":1713766608000,"abstract":"  Work is fundamental to societal prosperity and mental health, providing\nfinancial security, identity, purpose, and social integration. The emergence of\ngenerative artificial intelligence (AI) has catalysed debate on job\ndisplacement. Some argue that many new jobs and industries will emerge to\noffset the displacement, while others foresee a widespread decoupling of\neconomic productivity from human input threatening jobs on an unprecedented\nscale. This study explores the conditions under which both may be true and\nexamines the potential for a self-reinforcing cycle of recessionary pressures\nthat would necessitate sustained government intervention to maintain job\nsecurity and economic stability. A system dynamics model was developed to\nundertake ex ante analysis of the effect of AI-capital deepening on labour\nunderutilisation and demand in the economy. Results indicate that even a\nmoderate increase in the AI-capital-to-labour ratio could increase labour\nunderutilisation to double its current level, decrease per capita disposable\nincome by 26% (95% interval, 20.6% - 31.8%), and decrease the consumption index\nby 21% (95% interval, 13.6% - 28.3%) by mid-2050. To prevent a reduction in per\ncapita disposable income due to the estimated increase in underutilization, at\nleast a 10.8-fold increase in the new job creation rate would be necessary.\nResults demonstrate the feasibility of an AI-capital- to-labour ratio threshold\nbeyond which even high rates of new job creation cannot prevent declines in\nconsumption. The precise threshold will vary across economies, emphasizing the\nurgent need for empirical research tailored to specific contexts. This study\nunderscores the need for governments, civic organisations, and business to work\ntogether to ensure a smooth transition to an AI- dominated economy to safeguard\nthe Mental Wealth of nations.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CSDQznqIWNyGLCQObh9F4h4LF3qAvMuAhr58d7RnKh0","pdfSize":"1045044"}
