{"id":"2407.16208","title":"Gapless spin excitations in a quantum spin liquid state of S=1/2 perfect\n  kagome antiferromagnet","authors":"S. Suetsugu, T. Asaba, S. Ikemori, Y. Sekino, Y. Kasahara, K. Totsuka,\n  B. Li, Y. Zhao, Y. Li, Y. Kohama, and Y. Matsuda","authorsParsed":[["Suetsugu","S.",""],["Asaba","T.",""],["Ikemori","S.",""],["Sekino","Y.",""],["Kasahara","Y.",""],["Totsuka","K.",""],["Li","B.",""],["Zhao","Y.",""],["Li","Y.",""],["Kohama","Y.",""],["Matsuda","Y.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 06:29:08 GMT"}],"updateDate":"2024-07-24","timestamp":1721716148000,"abstract":"  Quantum spin liquids (QSLs) represent an exotic quantum many-body state\ncharacterized by the suppression of long-range magnetic order due to strong\nquantum fluctuations. The kagome spin-1/2 antiferromagnet (AFM) is a prime\ncandidate for realizing QSLs, but its ground state remains an unresolved\nconundrum. Here we investigate the recently discovered perfect kagome AFM\nYCu$_3$(OH)$_{6.5}$Br$_{2.5}$ to elucidate two central enigmas surrounding the\nkagome AFM. Ultra-sensitive torque magnetometry experiments reveal that the\nintrinsic magnetic susceptibility arising from the kagome layer remains nearly\ntemperature-independent down to exceedingly low temperatures. This observation\nseemingly implies the emergence of gapless fermionic spin excitations akin to\nPauli paramagnetism in metals. However, most strikingly, these results stand in\nstark contrast to the conspicuous absence of a temperature-linear contribution\nto the specific heat. These findings appear irreconcilable with the\nwidely-discussed theoretical frameworks assuming fermionic quasiparticles\n(QPs), instead suggesting a transition of bosonic QPs into a superfluid state\nwith a gapless Goldstone mode. Furthermore, magnetocaloric measurements evince\nan entropy anomaly, constituting thermodynamic evidence that magnetic fields\ninstigate the opening of a spin gap, driving a quantum phase transition into a\n1/9 magnetization plateau state. These results shed light on the nature of the\nlow-energy excitations in zero and strong magnetic fields, providing crucial\ninsights into the long-standing unresolved issues of the ground state of the\nkagome AFM.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}