{"id":"2407.01840","title":"Deep Harmonic Finesse: Signal Separation in Wearable Systems with\n  Limited Data","authors":"Mahya Saffarpour, Kourosh Vali, Weitai Qian, Begum Kasap, Herman L.\n  Hedriana, and Soheil Ghiasi","authorsParsed":[["Saffarpour","Mahya",""],["Vali","Kourosh",""],["Qian","Weitai",""],["Kasap","Begum",""],["Hedriana","Herman L.",""],["Ghiasi","Soheil",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 22:45:29 GMT"}],"updateDate":"2024-07-03","timestamp":1719873929000,"abstract":"  We present a method, referred to as Deep Harmonic Finesse (DHF), for\nseparation of non-stationary quasi-periodic signals when limited data is\navailable. The problem frequently arises in wearable systems in which, a\ncombination of quasi-periodic physiological phenomena give rise to the sensed\nsignal, and excessive data collection is prohibitive. Our approach utilizes\nprior knowledge of time-frequency patterns in the signals to mask and in-paint\nspectrograms. This is achieved through an application-inspired deep harmonic\nneural network coupled with an integrated pattern alignment component. The\nnetwork's structure embeds the implicit harmonic priors within the\ntime-frequency domain, while the pattern-alignment method transforms the sensed\nsignal, ensuring a strong alignment with the network. The effectiveness of the\nalgorithm is demonstrated in the context of non-invasive fetal monitoring using\nboth synthesized and in vivo data. When applied to the synthesized data, our\nmethod exhibits significant improvements in signal-to-distortion ratio (26% on\naverage) and mean squared error (80% on average), compared to the best\ncompeting method. When applied to in vivo data captured in pregnant animal\nstudies, our method improves the correlation error between estimated fetal\nblood oxygen saturation and the ground truth by 80.5% compared to the state of\nthe art.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}