{"id":"2407.00611","title":"WallFacer: Harnessing Multi-dimensional Ring Parallelism for Efficient\n  Long Sequence Model Training","authors":"Ziming Liu, Shaoyu Wang, Shenggan Cheng, Zhongkai Zhao, Kai Wang,\n  Xuanlei Zhao, James Demmel, Yang You","authorsParsed":[["Liu","Ziming",""],["Wang","Shaoyu",""],["Cheng","Shenggan",""],["Zhao","Zhongkai",""],["Wang","Kai",""],["Zhao","Xuanlei",""],["Demmel","James",""],["You","Yang",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 07:00:07 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 02:47:20 GMT"},{"version":"v3","created":"Thu, 19 Sep 2024 08:28:04 GMT"}],"updateDate":"2024-09-20","timestamp":1719730807000,"abstract":"  Training Transformer models on long sequences in a distributed setting poses\nsignificant challenges in terms of efficiency and scalability. Current methods\nare either constrained by the number of attention heads or excessive\ncommunication overheads. To address this problem, we propose WallFacer, a\nmulti-dimensional distributed training system for long sequences, fostering an\nefficient communication paradigm and providing additional tuning flexibility\nfor communication arrangements. Specifically, WallFacer introduces an extra\nparallel dimension to substantially reduce communication volume and avoid\nbandwidth bottlenecks. Through comprehensive experiments across diverse\nhardware environments and on both Natural Language Processing (NLP) and\nComputer Vision (CV) tasks, we demonstrate that our approach significantly\nsurpasses state-of-the-art methods that support near-infinite sequence lengths,\nachieving performance improvements of up to 77.12% on GPT-style models and up\nto 114.33% on DiT (Diffusion Transformer) models.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"tVT4pAHVy7XWBerK3xLJmnRaYlr-3Ywef2KWaKfdSDk","pdfSize":"3656252","objectId":"0x36e9493306e4b9184a6723d69cf515556e16551a276b3e1453a7cde2602420ea","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
