{"id":"2407.17278","title":"Hayward spacetime with axion scalar field","authors":"Jun-Ru Chen, Yong-Qiang Wang","authorsParsed":[["Chen","Jun-Ru",""],["Wang","Yong-Qiang",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 13:46:14 GMT"}],"updateDate":"2024-07-25","timestamp":1721828774000,"abstract":"  In this work, we investigate a static spherically symmetric system in which\nEinstein gravity is minimally coupled with a self-interacting complex scalar\nfield and a nonlinear electromagnetic field, referred to as Hayward axion\nstars. Employing numerical methods, we find that it essentially describes axion\nstars with the magnetic charge. In the absence of magnetic charge and with only\nthe scalar field present, the system reduces to axion stars. We discover that\nwhen the magnetic charge $q$ exceeds a critical value, extreme solutions with\nfrequencies $\\omega$ approaching zero can be found and the critical horizon\nemerges. Within this horizon, the scalar field and energy density are highly\nconcentrated and decrease precipitously at its boundary. The time component of\nthe metric function approaches zero within this region, indicating that gravity\nis extremely intense, and time nearly ceases to flow. To an observer at\ninfinity, the star appears to be frozen, hence we refer to these extreme\nsolutions exhibiting a critical horizon as Hayward axion frozen stars.\nFurthermore, it is important to note that as $\\omega \\rightarrow 0$, the mass\nof the Hayward axion frozen star becomes independent of the decay constant and\nis only determined by the magnetic charge. Additionally, we find that the\nfrozen star solutions possess two light rings. With an increase in the magnetic\ncharge, these light rings move outward, while changes in the decay constant\nhave little effect on their positions.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}