{"id":"2407.16479","title":"Revisiting Empirical Solar Energetic Particle Scaling Relations II.\n  Coronal Mass Ejections","authors":"Athanasios Papaioannou, Konstantin Herbst, Tobias Ramm, David Lario,\n  and Astrid M. Veronig","authorsParsed":[["Papaioannou","Athanasios",""],["Herbst","Konstantin",""],["Ramm","Tobias",""],["Lario","David",""],["Veronig","Astrid M.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 13:50:04 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 10:26:30 GMT"}],"updateDate":"2024-08-08","timestamp":1721742604000,"abstract":"  Aims. The space radiation environment conditions and the maximum expected\ncoronal mass ejection (CME) speed are being assessed through the investigation\nof scaling laws between the peak proton flux and fluence of Solar Energetic\nParticle (SEP) events with the speed of the CMEs. Methods. We utilize a\ncomplete catalog of SEP events, covering the last ~25 years of CME observations\n(i.e. 1997 to 2017). We calculate the peak proton fluxes and integrated event\nfluences for those events reaching an integral energy of up to E> 100 MeV,\ncovering the period of the last ~25 years of CME observations. For a sample of\n38 strong SEP events, we first investigate the statistical relations between\nthe recorded peak proton fluxes (IP) and fluences (FP) at a set of integral\nenergies of E >10 MeV, E>30 MeV, E>60 MeV, and E>100 MeV versus the projected\nCME speed near the Sun (VCME) obtained by the Solar and Heliospheric\nObservatory/Large Angle and Spectrometric Coronagraph (SOHO/LASCO). Based on\nthe inferred relations, we further calculate the integrated energy dependence\nof both IP and FP, assuming that they follow an inverse power-law with respect\nto energy. By making use of simple physical assumptions, we combine our derived\nscaling laws to estimate the upper limits for VCME, IP, and FP focusing on two\ncases of known extreme SEP events that occurred on February 23, 1956 (GLE05)\nand in AD774/775, respectively. Given physical constraints and assumptions,\nseveral options for the upper limit VCME, associated with these events, are\ninvestigated. Results. A scaling law relating IP and FP to the CME speed as\nV^{5}CME for CMEs ranging between ~3400-5400 km/s is consistent with values of\nFP inferred for the cosmogenic nuclide event of AD774/775. At the same time,\nthe upper CME speed that the current Sun can provide possibly falls within an\nupper limit of VCME <= 5500 km/s.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}