{"id":"2407.06572","title":"Origin of effective graviton mass from spontaneous symmetry breaking of\n  scalar field","authors":"Susobhan Mandal and S. Shankaranarayanan (IIT Bombay)","authorsParsed":[["Mandal","Susobhan","","IIT Bombay"],["Shankaranarayanan","S.","","IIT Bombay"]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 06:06:30 GMT"}],"updateDate":"2024-07-10","timestamp":1720505190000,"abstract":"  General relativity and quantum field theory govern all fundamental physical\nprocesses, from nuclear and subatomic scales to the solar system, galactic, and\ncosmology. Both theories work remarkably well in their tested domains. However,\nthere is minimal overlap between the two domains. Our work demonstrates that\nthe non-overlapping of domains \\emph{no longer} holds when non-perturbative\neffects are considered. We introduce a novel mechanism in which the gravitons\nacquire \\emph{effective mass} due to the spontaneous symmetry breaking (SSB) of\nglobal or local symmetry of complex scalar field minimally coupled to gravity.\nIn the flat space-time limit, we demonstrate that the resulting action for the\ngraviton is identical to the extended Fierz-Pauli (FP) action, corresponding to\nthe mass deformation parameter $\\alpha = 1/2$. The extended FP action has 6\nDegrees of freedom and no ghost. For local $U(1)$ SSB, we establish that the\neffective graviton mass is related to the mass of the gauge boson and the\nelectric charge of the complex scalar field. Interestingly, our results\nindicate that the millicharged dark matter scalar fields, generating dark\nphotons, can produce graviton mass of the same order as the Hubble constant\n$(H_0)$. Hence, we argue that the dark sector offers a natural explanation for\nthe acceleration of the current Universe.\n","subjects":["Physics/High Energy Physics - Theory","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}