{"id":"2407.19981","title":"Adversarial Robustness in RGB-Skeleton Action Recognition: Leveraging\n  Attention Modality Reweighter","authors":"Chao Liu, Xin Liu, Zitong Yu, Yonghong Hou, Huanjing Yue, Jingyu Yang","authorsParsed":[["Liu","Chao",""],["Liu","Xin",""],["Yu","Zitong",""],["Hou","Yonghong",""],["Yue","Huanjing",""],["Yang","Jingyu",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:15:51 GMT"}],"updateDate":"2024-07-30","timestamp":1722258951000,"abstract":"  Deep neural networks (DNNs) have been applied in many computer vision tasks\nand achieved state-of-the-art (SOTA) performance. However, misclassification\nwill occur when DNNs predict adversarial examples which are created by adding\nhuman-imperceptible adversarial noise to natural examples. This limits the\napplication of DNN in security-critical fields. In order to enhance the\nrobustness of models, previous research has primarily focused on the unimodal\ndomain, such as image recognition and video understanding. Although multi-modal\nlearning has achieved advanced performance in various tasks, such as action\nrecognition, research on the robustness of RGB-skeleton action recognition\nmodels is scarce. In this paper, we systematically investigate how to improve\nthe robustness of RGB-skeleton action recognition models. We initially\nconducted empirical analysis on the robustness of different modalities and\nobserved that the skeleton modality is more robust than the RGB modality.\nMotivated by this observation, we propose the \\formatword{A}ttention-based\n\\formatword{M}odality \\formatword{R}eweighter (\\formatword{AMR}), which\nutilizes an attention layer to re-weight the two modalities, enabling the model\nto learn more robust features. Our AMR is plug-and-play, allowing easy\nintegration with multimodal models. To demonstrate the effectiveness of AMR, we\nconducted extensive experiments on various datasets. For example, compared to\nthe SOTA methods, AMR exhibits a 43.77\\% improvement against PGD20 attacks on\nthe NTU-RGB+D 60 dataset. Furthermore, it effectively balances the differences\nin robustness between different modalities.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}