{"id":"2407.02559","title":"A Max-Flow approach to Random Tensor Networks","authors":"Khurshed Fitter, Faedi Loulidi, Ion Nechita","authorsParsed":[["Fitter","Khurshed",""],["Loulidi","Faedi",""],["Nechita","Ion",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-04","timestamp":1719943201000,"abstract":"  We study the entanglement entropy of a random tensor network (RTN) using\ntools from free probability theory. Random tensor networks are simple toy\nmodels that help the understanding of the entanglement behavior of a boundary\nregion in the ADS/CFT context. One can think of random tensor networks are\nspecific probabilistic models for tensors having some particular geometry\ndictated by a graph (or network) structure. We first introduce our model of\nRTN, obtained by contracting maximally entangled states (corresponding to the\nedges of the graph) on the tensor product of Gaussian tensors (corresponding to\nthe vertices of the graph). We study the entanglement spectrum of the resulting\nrandom spectrum along a given bipartition of the local Hilbert spaces. We\nprovide the limiting eigenvalue distribution of the reduced density operator of\nthe RTN state, in the limit of large local dimension. The limit value is\ndescribed via a maximum flow optimization problem in a new graph corresponding\nto the geometry of the RTN and the given bipartition. In the case of\nseries-parallel graphs, we provide an explicit formula for the limiting\neigenvalue distribution using classical and free multiplicative convolutions.\nWe discuss the physical implications of our results, allowing us to go beyond\nthe semiclassical regime without any cut assumption, specifically in terms of\nfinite corrections to the average entanglement entropy of the RTN.\n","subjects":["Physics/Quantum Physics","Physics/High Energy Physics - Theory","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Mathematics/Probability"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"yL9XpQZzsBTgVUiYbHQH2YujAQTSi5DKJAuPYp_18mY","pdfSize":"1253759"}
