{"id":"2407.21629","title":"Transition reversal over a blunt plate at Mach 5","authors":"Peixu Guo, Jiaao Hao, Chih-Yung Wen","authorsParsed":[["Guo","Peixu",""],["Hao","Jiaao",""],["Wen","Chih-Yung",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:22:57 GMT"}],"updateDate":"2024-08-01","timestamp":1722435777000,"abstract":"  In this work, the stability and transition to turbulence over an experimental\nblunt flat plate with different leading-edge radii are investigated. The\nfreestream Mach number is 5, the unit Reynolds number is $6\\times10^7$\nm$^{-1}$, and the maximum nose-tip radius 3 mm exceeds the experimental\nreversal value. High-resolution numerical simulation and stability analysis are\nperformed. Three-dimensional broadband perturbation is added on the farfield\nboundary to initiate the transition. The highlight of this work is that the\ncomplete physical process is considered, including the three-dimensional\nreceptivity, linear and nonlinear instabilities, and transition. The\nexperimental reversal phenomenon is favourably reproduced in the numerical\nsimulation for the first time. Linear stability analysis shows that unstable\nfirst and second modes are absent in the blunt-plate flows owing to the\npresence of the entropy layer, although these modes are evident in the\nsharp-leading-edge case. Therefore, the transition on the blunt plate is due to\nnonmodal instabilities. Numerical results for all the blunt-plate cases reveal\nthe formation of streamwise streaky structures downstream of the nose (stage I)\nand then the presence of intermittent turbulent spots in the transitional\nregion (stage II). In stage I, a preferential spanwise wavelength of around 0.9\nmm is selected for all the nose-tip radii, and low-frequency components are\ndominant. In stage II, high-frequency secondary instabilities appear to grow,\nwhich participate in the eventual breakdown. By contrast, leading-edge streaks\nare not remarkable in the sharp-leading-edge case, where transition is induced\nby oblique first and Mack second modes. The transition reversal beyond the\ncritical nose-tip radius arises from an increasing magnitude of the streaky\nresponse in the early stage, while the transition mechanism keeps similar\nqualitatively.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}