{"id":"2407.11972","title":"An efficient machine learning approach for extracting eSports players\n  distinguishing features and classifying their skill levels using symbolic\n  transfer entropy and consensus nested cross validation","authors":"Amin Noroozi, Mohammad S. Hasan, Maryam Ravan, Elham Norouzi, and\n  Ying-Ying Law","authorsParsed":[["Noroozi","Amin",""],["Hasan","Mohammad S.",""],["Ravan","Maryam",""],["Norouzi","Elham",""],["Law","Ying-Ying",""]],"versions":[{"version":"v1","created":"Wed, 8 May 2024 15:22:12 GMT"}],"updateDate":"2024-07-18","timestamp":1715181732000,"abstract":"  Discovering features that set elite players apart is of great significance\nfor eSports coaches as it enables them to arrange a more effective training\nprogram focused on improving those features. Moreover, finding such features\nresults in a better evaluation of eSports players skills, which, besides\ncoaches, is of interest for game developers to design games automatically\nadaptable to the players expertise. Sensor data combined with machine learning\nhave already proved effective in classifying eSports players. However, the\nexisting methods do not provide sufficient information about features that\ndistinguish high-skilled players. In this paper, we propose an efficient method\nto find these features and then use them to classify players' skill levels. We\nfirst apply a time window to extract the players' sensor data, including heart\nrate, hand activities, etc., before and after game events in the League of\nLegends game. We use the extracted segments and symbolic transfer entropy to\ncalculate connectivity features between sensors. The most relevant features are\nthen selected using the newly developed consensus nested cross validation\nmethod. These features, representing the harmony between body parts, are\nfinally used to find the optimum window size and classify players' skills. The\nclassification results demonstrate a significant improvement by achieving 90.1%\naccuracy. Also, connectivity features between players gaze positions and\nkeyboard, mouse, and hand activities were the most distinguishing features in\nclassifying players' skills. The proposed method in this paper can be similarly\napplied to sportspeople data and potentially revolutionize the training\nprograms in both eSports and sports industries\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}