{"id":"2407.04929","title":"Toward Precise Robotic Weed Flaming Using a Mobile Manipulator with a\n  Flamethrower","authors":"Di Wang, Chengsong Hu, Shuangyu Xie, Joe Johnson, Hojun Ji, Yingtao\n  Jiang, Muthukumar Bagavathiannan, and Dezhen Song","authorsParsed":[["Wang","Di",""],["Hu","Chengsong",""],["Xie","Shuangyu",""],["Johnson","Joe",""],["Ji","Hojun",""],["Jiang","Yingtao",""],["Bagavathiannan","Muthukumar",""],["Song","Dezhen",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 02:43:12 GMT"}],"updateDate":"2024-07-09","timestamp":1720233792000,"abstract":"  Robotic weed flaming is a new and environmentally friendly approach to weed\nremoval in the agricultural field. Using a mobile manipulator equipped with a\nflamethrower, we design a new system and algorithm to enable effective weed\nflaming, which requires robotic manipulation with a soft and deformable end\neffector, as the thermal coverage of the flame is affected by dynamic or\nunknown environmental factors such as gravity, wind, atmospheric pressure, fuel\ntank pressure, and pose of the nozzle. System development includes overall\ndesign, hardware integration, and software pipeline. To enable precise weed\nremoval, the greatest challenge is to detect and predict dynamic flame coverage\nin real time before motion planning, which is quite different from a\nconventional rigid gripper in grasping or a spray gun in painting. Based on the\nimages from two onboard infrared cameras and the pose information of the\nflamethrower nozzle on a mobile manipulator, we propose a new dynamic flame\ncoverage model. The flame model uses a center-arc curve with a Gaussian\ncross-section model to describe the flame coverage in real time. The\nexperiments have demonstrated the working system and shown that our model and\nalgorithm can achieve a mean average precision (mAP) of more than 76\\% in the\nreprojected images during online prediction.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"chiw2YzTJ63nr4bRKC5eviGMthkS3DR9Ruammc4uMfc","pdfSize":"7901439"}
