{"id":"2407.06051","title":"Foams with 3D Spatially Programmed Mechanics Enabled by Autonomous\n  Active Learning on Viscous Thread Printing","authors":"Brett Emery, Kelsey L. Snapp, Daniel Revier, Vivek Sarkar, Masa\n  Nakura, Keith A. Brown, Jeffrey Ian Lipton","authorsParsed":[["Emery","Brett",""],["Snapp","Kelsey L.",""],["Revier","Daniel",""],["Sarkar","Vivek",""],["Nakura","Masa",""],["Brown","Keith A.",""],["Lipton","Jeffrey Ian",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 15:54:19 GMT"}],"updateDate":"2024-07-09","timestamp":1720454059000,"abstract":"  Foams are versatile by nature and ubiquitous in a wide range of applications,\nincluding padding, insulation, and acoustic dampening. Previous work\nestablished that foams 3D printed via Viscous Thread Printing (VTP) can in\nprinciple combine the flexibility of 3D printing with the mechanical properties\nof conventional foams. However, the generality of prior work is limited due to\nthe lack of predictable process-property relationships. In this work, we\nutilize a self-driving lab that combines automated experimentation with machine\nlearning to identify a processing subspace in which dimensionally consistent\nmaterials are produced using VTP with spatially programmable mechanical\nproperties. In carrying out this process, we discover an underlying\nself-stabilizing characteristic of VTP layer thickness, an important feature\nfor its extension to new materials and systems. Several complex exemplars are\nconstructed to illustrate the newly enabled capabilities of foams produced via\nVTP, including 1D gradient rectangular slabs, 2D localized stiffness zones on\nan insole orthotic and living hinges, and programmed 3D deformation via a cable\ndriven humanoid hand. Predictive mapping models are developed and validated for\nboth thermoplastic polyurethane (TPU) and polylactic acid (PLA) filaments,\nsuggesting the ability to train a model for any material suitable for material\nextrusion (ME) 3D printing.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}