{"id":"2407.15265","title":"Inner dusty regions of protoplanetary discs -- III. The role of\n  non-radial radiation pressure in dust dynamics","authors":"Dejan Vinkovi\\'c, Miljenko \\v{C}emelji\\'c","authorsParsed":[["Vinković","Dejan",""],["Čemeljić","Miljenko",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 20:51:48 GMT"}],"updateDate":"2024-07-23","timestamp":1721595108000,"abstract":"  We explore dynamical behaviour of dust particles that populate the surface of\ninner optically thick protoplanetary discs. This is a disc region with the\nhottest dust and of a great importance for planet formation and dust evolution,\nbut we still struggle to understand all the forces that shape this environment.\nIn our approach we combine results from two separate numerical studies - one is\nthe wind velocity and density distributions obtained from magnetohydrodynamical\nsimulations of accretion discs, and the other is a high-resolution multigrain\ndust radiation transfer. In our previous paper in the series, we described the\nmethodology for utilising these results as an environmental input for the\nintegration of dust trajectories driven by gravity, gas drag, and radiation\npressure. Now we have two improvements - we incorporate time changes in the\nwind density and velocity, and we implement the non-radial radiation pressure\nforce. We applied our analysis on Herbig Ae and T Tau stars. We confirm that\nthe radiation pressure force can lead to dust outflow, especially in the case\nof more luminous stars. Additionally, it opposes dust accretion at the inner\ndisc edge and reduces dust settling. These effects are enhanced by the disc\nwind, especially in the zone where the stellar and the disc magnetic fields\nmeet. Our results suggest that dust grains can stay in the hottest disc region\nfor an extended period and then can end up ejected into the outer disc regions.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}