{"id":"2407.03272","title":"Nesterov's Accelerated Jacobi-Type Methods for Large-scale Symmetric\n  Positive Semidefinite Linear Systems","authors":"Ling Liang, Qiyuan Pang, Kim-Chuan Toh, and Haizhao Yang","authorsParsed":[["Liang","Ling",""],["Pang","Qiyuan",""],["Toh","Kim-Chuan",""],["Yang","Haizhao",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 16:58:34 GMT"}],"updateDate":"2024-07-04","timestamp":1720025914000,"abstract":"  Solving symmetric positive semidefinite linear systems is an essential task\nin many scientific computing problems. While Jacobi-type methods, including the\nclassical Jacobi method and the weighted Jacobi method, exhibit simplicity in\ntheir forms and friendliness to parallelization, they are not attractive either\nbecause of the potential convergence failure or their slow convergence rate.\nThis paper aims to showcase the possibility of improving classical Jacobi-type\nmethods by employing Nesterov's acceleration technique that results in an\naccelerated Jacobi-type method with improved convergence properties.\nSimultaneously, it preserves the appealing features for parallel\nimplementation. In particular, we show that the proposed method has an\n$O\\left(\\frac{1}{t^2}\\right)$ convergence rate in terms of objective function\nvalues of the associated convex quadratic optimization problem, where $t\\geq 1$\ndenotes the iteration counter. To further improve the practical performance of\nthe proposed method, we also develop and analyze a restarted variant of the\nmethod, which is shown to have an $O\\left(\\frac{(\\log_2(t))^2}{t^2}\\right)$\nconvergence rate when the coefficient matrix is positive definite. Furthermore,\nwe conduct appropriate numerical experiments to evaluate the efficiency of the\nproposed method. Our numerical results demonstrate that the proposed method\noutperforms the classical Jacobi-type methods and the conjugate gradient method\nand shows a comparable performance as the preconditioned conjugate gradient\nmethod with a diagonal preconditioner. Finally, we develop a parallel\nimplementation and conduct speed-up tests on some large-scale systems. Our\nresults indicate that the proposed framework is highly scalable.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}