{"id":"2407.09693","title":"A Mathematical Framework, a Taxonomy of Modeling Paradigms, and a Suite\n  of Learning Techniques for Neural-Symbolic Systems","authors":"Charles Dickens, Connor Pryor, Changyu Gao, Alon Albalak, Eriq\n  Augustine, William Wang, Stephen Wright, and Lise Getoor","authorsParsed":[["Dickens","Charles",""],["Pryor","Connor",""],["Gao","Changyu",""],["Albalak","Alon",""],["Augustine","Eriq",""],["Wang","William",""],["Wright","Stephen",""],["Getoor","Lise",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 21:26:21 GMT"}],"updateDate":"2024-07-16","timestamp":1720819581000,"abstract":"  The field of Neural-Symbolic (NeSy) systems is growing rapidly. Proposed\napproaches show great promise in achieving symbiotic unions of neural and\nsymbolic methods. However, each NeSy system differs in fundamental ways. There\nis a pressing need for a unifying theory to illuminate the commonalities and\ndifferences in approaches and enable further progress. In this paper, we\nintroduce Neural-Symbolic Energy-Based Models (NeSy-EBMs), a unifying\nmathematical framework for discriminative and generative modeling with\nprobabilistic and non-probabilistic NeSy approaches. We utilize NeSy-EBMs to\ndevelop a taxonomy of modeling paradigms focusing on a system's neural-symbolic\ninterface and reasoning capabilities. Additionally, we introduce a suite of\nlearning techniques for NeSy-EBMs. Importantly, NeSy-EBMs allow the derivation\nof general expressions for gradients of prominent learning losses, and we\nprovide four learning approaches that leverage methods from multiple domains,\nincluding bilevel and stochastic policy optimization. Finally, we present\nNeural Probabilistic Soft Logic (NeuPSL), an open-source NeSy-EBM library\ndesigned for scalability and expressivity, facilitating real-world application\nof NeSy systems. Through extensive empirical analysis across multiple datasets,\nwe demonstrate the practical advantages of NeSy-EBMs in various tasks,\nincluding image classification, graph node labeling, autonomous vehicle\nsituation awareness, and question answering.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}