{"id":"2407.14953","title":"AgileDART: An Agile and Scalable Edge Stream Processing Engine","authors":"Liting Hu, Cheng-Wei Ching","authorsParsed":[["Hu","Liting",""],["Ching","Cheng-Wei",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 18:12:11 GMT"}],"updateDate":"2024-07-23","timestamp":1721499131000,"abstract":"  Edge applications generate a large influx of sensor data at massive scales.\nUnder many time-critical scenarios, these massive data streams must be\nprocessed in a very short time to derive actionable intelligence. However,\ntraditional data processing systems (e.g., stream processing systems,\ncloud-based IoT data processing systems) are not well-suited for these edge\napplications. This is because they often do not scale well with a large number\nof concurrent stream queries, do not support low-latency processing under\nlimited edge computing resources, and do not adapt to the level of\nheterogeneity and dynamicity commonly present in edge computing environments.\nThese gaps suggest a need for a new edge stream processing system that advances\nthe stream processing paradigm to achieve efficiency and flexibility under the\nconstraints presented by edge computing architectures.\n  We present AgileDart, an agile and scalable edge stream processing engine\nthat enables fast stream processing of a large number of concurrently running\nlow-latency edge applications' queries at scale in dynamic, heterogeneous edge\nenvironments. The novelty of our work lies in a dynamic dataflow abstraction\nthat leverages distributed hash table (DHT) based peer-to-peer (P2P) overlay\nnetworks to automatically place, chain, and scale stream operators to reduce\nquery latencies, adapt to workload variations, and recover from failures; and a\nbandit-based path planning model that can re-plan the data shuffling paths to\nadapt to unreliable and heterogeneous edge networks. We show analytically and\nempirically that AgileDart outperforms Storm and EdgeWise on query latency and\nsignificantly improves scalability and adaptability when processing a large\nnumber of real-world edge stream applications' queries.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gevYL1aJCvZexiNoSWzBcx4F5ZJFKFaD4LRo2vL25zc","pdfSize":"4130485"}
