{"id":"2407.14320","title":"Joint or Disjoint: Mixing Training Regimes for Early-Exit Models","authors":"Bart{\\l}omiej Krzepkowski, Monika Michaluk, Franciszek Szarwacki,\n  Piotr Kubaty, Jary Pomponi, Tomasz Trzci\\'nski, Bartosz W\\'ojcik, Kamil\n  Adamczewski","authorsParsed":[["Krzepkowski","Bartłomiej",""],["Michaluk","Monika",""],["Szarwacki","Franciszek",""],["Kubaty","Piotr",""],["Pomponi","Jary",""],["Trzciński","Tomasz",""],["Wójcik","Bartosz",""],["Adamczewski","Kamil",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:56:57 GMT"}],"updateDate":"2024-07-22","timestamp":1721397417000,"abstract":"  Early exits are an important efficiency mechanism integrated into deep neural\nnetworks that allows for the termination of the network's forward pass before\nprocessing through all its layers. By allowing early halting of the inference\nprocess for less complex inputs that reached high confidence, early exits\nsignificantly reduce the amount of computation required. Early exit methods add\ntrainable internal classifiers which leads to more intricacy in the training\nprocess. However, there is no consistent verification of the approaches of\ntraining of early exit methods, and no unified scheme of training such models.\nMost early exit methods employ a training strategy that either simultaneously\ntrains the backbone network and the exit heads or trains the exit heads\nseparately. We propose a training approach where the backbone is initially\ntrained on its own, followed by a phase where both the backbone and the exit\nheads are trained together. Thus, we advocate for organizing early-exit\ntraining strategies into three distinct categories, and then validate them for\ntheir performance and efficiency. In this benchmark, we perform both\ntheoretical and empirical analysis of early-exit training regimes. We study the\nmethods in terms of information flow, loss landscape and numerical rank of\nactivations and gauge the suitability of regimes for various architectures and\ndatasets.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}