{"id":"2407.07078","title":"MoSt-DSA: Modeling Motion and Structural Interactions for Direct\n  Multi-Frame Interpolation in DSA Images","authors":"Ziyang Xu, Huangxuan Zhao, Ziwei Cui, Wenyu Liu, Chuansheng Zheng,\n  Xinggang Wang","authorsParsed":[["Xu","Ziyang",""],["Zhao","Huangxuan",""],["Cui","Ziwei",""],["Liu","Wenyu",""],["Zheng","Chuansheng",""],["Wang","Xinggang",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 17:50:54 GMT"}],"updateDate":"2024-07-10","timestamp":1720547454000,"abstract":"  Artificial intelligence has become a crucial tool for medical image analysis.\nAs an advanced cerebral angiography technique, Digital Subtraction Angiography\n(DSA) poses a challenge where the radiation dose to humans is proportional to\nthe image count. By reducing images and using AI interpolation instead, the\nradiation can be cut significantly. However, DSA images present more complex\nmotion and structural features than natural scenes, making interpolation more\nchallenging. We propose MoSt-DSA, the first work that uses deep learning for\nDSA frame interpolation. Unlike natural scene Video Frame Interpolation (VFI)\nmethods that extract unclear or coarse-grained features, we devise a general\nmodule that models motion and structural context interactions between frames in\nan efficient full convolution manner by adjusting optimal context range and\ntransforming contexts into linear functions. Benefiting from this, MoSt-DSA is\nalso the first method that directly achieves any number of interpolations at\nany time steps with just one forward pass during both training and testing. We\nconduct extensive comparisons with 7 representative VFI models for\ninterpolating 1 to 3 frames, MoSt-DSA demonstrates robust results across 470\nDSA image sequences (each typically 152 images), with average SSIM over 0.93,\naverage PSNR over 38 (standard deviations of less than 0.030 and 3.6,\nrespectively), comprehensively achieving state-of-the-art performance in\naccuracy, speed, visual effect, and memory usage. Our code is available at\nhttps://github.com/ZyoungXu/MoSt-DSA.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"kJkYfOnhekmSlo-6zeI0L6RVUEzBcW1BFPVSn7bpL70","pdfSize":"2057332"}
