{"id":"2407.11299","title":"FR-SLAM: A SLAM Improvement Method Based on Floor Plan Registration","authors":"Jiantao Feng, Xinde Li, HyunCheol Park, Juan Liu, Zhentong Zhang","authorsParsed":[["Feng","Jiantao",""],["Li","Xinde",""],["Park","HyunCheol",""],["Liu","Juan",""],["Zhang","Zhentong",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 01:23:38 GMT"}],"updateDate":"2024-07-17","timestamp":1721093018000,"abstract":"  Simultaneous Localization and Mapping (SLAM) technology enables the\nconstruction of environmental maps and localization, serving as a key technique\nfor indoor autonomous navigation of mobile robots. Traditional SLAM methods\ntypically require exhaustive traversal of all rooms during indoor navigation to\nobtain a complete map, resulting in lengthy path planning times and prolonged\ntime to reach target points. Moreover, cumulative errors during motion lead to\ninaccurate robot localization, impacting navigation efficiency.This paper\nproposes an improved SLAM method, FR-SLAM, based on floor plan registration,\nutilizing a morphology-based floor plan registration algorithm to align and\ntransform original floor plans. This approach facilitates the rapid acquisition\nof comprehensive motion maps and efficient path planning, enabling swift\nnavigation to target positions within a shorter timeframe. To enhance\nregistration and robot motion localization accuracy, a real-time update\nstrategy is employed, comparing the current position's building structure with\nthe map and dynamically updating floor plan registration results for precise\nlocalization. Comparative tests conducted on real and simulated datasets\ndemonstrate that, compared to other benchmark algorithms, this method achieves\nhigher floor plan registration accuracy and shorter time consumption to reach\ntarget positions.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZxyiwC1E-vaRxIhtMg4DUmR3PmPwHZXRfTcWfsCRpGs","pdfSize":"3694065","objectId":"0x25c190df7d2203d3a2591762c5cc576989bc07de17bbf91e85ab974a5d9e856c","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
