{"id":"2407.11014","title":"Geode: A Zero-shot Geospatial Question-Answering Agent with Explicit\n  Reasoning and Precise Spatio-Temporal Retrieval","authors":"Devashish Vikas Gupta, Azeez Syed Ali Ishaqui, Divya Kiran Kadiyala","authorsParsed":[["Gupta","Devashish Vikas",""],["Ishaqui","Azeez Syed Ali",""],["Kadiyala","Divya Kiran",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 21:59:54 GMT"}],"updateDate":"2024-07-17","timestamp":1719439194000,"abstract":"  Large language models (LLMs) have shown promising results in learning and\ncontextualizing information from different forms of data. Recent advancements\nin foundational models, particularly those employing self-attention mechanisms,\nhave significantly enhanced our ability to comprehend the semantics of diverse\ndata types. One such area that could highly benefit from multi-modality is in\nunderstanding geospatial data, which inherently has multiple modalities.\nHowever, current Natural Language Processing (NLP) mechanisms struggle to\neffectively address geospatial queries. Existing pre-trained LLMs are\ninadequately equipped to meet the unique demands of geospatial data, lacking\nthe ability to retrieve precise spatio-temporal data in real-time, thus leading\nto significantly reduced accuracy in answering complex geospatial queries. To\naddress these limitations, we introduce Geode--a pioneering system designed to\ntackle zero-shot geospatial question-answering tasks with high precision using\nspatio-temporal data retrieval. Our approach represents a significant\nimprovement in addressing the limitations of current LLM models, demonstrating\nremarkable improvement in geospatial question-answering abilities compared to\nexisting state-of-the-art pre-trained models.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"IOnhe58yC-HvuP2rZTWb95FIV9Wjv2i2EG_v6zk2dSo","pdfSize":"2803836","objectId":"0x98195d1a28a2097187020072f24862e690524ff36fdd3ce731270c06cb77b318","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
