{"id":"2407.02273","title":"Multilingual Trolley Problems for Language Models","authors":"Zhijing Jin, Sydney Levine, Max Kleiman-Weiner, Giorgio Piatti, Jiarui\n  Liu, Fernando Gonzalez Adauto, Francesco Ortu, Andr\\'as Strausz, Mrinmaya\n  Sachan, Rada Mihalcea, Yejin Choi, Bernhard Sch\\\"olkopf","authorsParsed":[["Jin","Zhijing",""],["Levine","Sydney",""],["Kleiman-Weiner","Max",""],["Piatti","Giorgio",""],["Liu","Jiarui",""],["Adauto","Fernando Gonzalez",""],["Ortu","Francesco",""],["Strausz","András",""],["Sachan","Mrinmaya",""],["Mihalcea","Rada",""],["Choi","Yejin",""],["Schölkopf","Bernhard",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 14:02:53 GMT"}],"updateDate":"2024-07-03","timestamp":1719928973000,"abstract":"  As large language models (LLMs) are deployed in more and more real-world\nsituations, it is crucial to understand their decision-making when faced with\nmoral dilemmas. Inspired by a large-scale cross-cultural study of human moral\npreferences, \"The Moral Machine Experiment\", we set up the same set of moral\nchoices for LLMs. We translate 1K vignettes of moral dilemmas, parametrically\nvaried across key axes, into 100+ languages, and reveal the preferences of LLMs\nin each of these languages. We then compare the responses of LLMs to that of\nhuman speakers of those languages, harnessing a dataset of 40 million human\nmoral judgments. We discover that LLMs are more aligned with human preferences\nin languages such as English, Korean, Hungarian, and Chinese, but less aligned\nin languages such as Hindi and Somali (in Africa). Moreover, we characterize\nthe explanations LLMs give for their moral choices and find that fairness is\nthe most dominant supporting reason behind GPT-4's decisions and utilitarianism\nby GPT-3. We also discover \"language inequality\" (which we define as the\nmodel's different development levels in different languages) in a series of\nmeta-properties of moral decision making.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}