{"id":"2407.02453","title":"Quantum collective motion of macroscopic mechanical oscillators","authors":"Mahdi Chegnizadeh, Marco Scigliuzzo, Amir Youssefi, Shingo Kono,\n  Evgenii Guzovskii, Tobias J. Kippenberg","authorsParsed":[["Chegnizadeh","Mahdi",""],["Scigliuzzo","Marco",""],["Youssefi","Amir",""],["Kono","Shingo",""],["Guzovskii","Evgenii",""],["Kippenberg","Tobias J.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 17:32:19 GMT"}],"updateDate":"2024-07-03","timestamp":1719941539000,"abstract":"  Collective phenomena in physics emerge from interactions among numerous\ncomponents in a complex system, leading to behaviors distinct from those of\nindividual parts. This domain includes classical phenomena like synchronization\nand extends to quantum phenomena such as Bose-Einstein condensation and\nsuper-radiance. Studying these phenomena in controlled artificial systems\nallows for simulating complex natural systems. Solid-state mechanical\noscillators, controllable via optomechanical coupling, have been proposed for\nexploring collective phenomena, but experimental realizations face the\nchallenge of requiring nearly degenerate mechanical oscillators. In this work,\nwe present the collective behavior of six mechanical oscillators coupled to a\ncommon cavity in a superconducting circuit optomechanical platform. We\nexperimentally demonstrate that increasing the optomechanical coupling rates\ninduces a transition from individual mechanical oscillators to a collective\nmode, characterized by equal amplitude and relative phase of the oscillators.\nBy utilizing the finite non-degeneracy of mechanical frequencies and rapidly\nquenching the optomechanical couplings, we directly measure the amplitude and\nrelative phase of the oscillators in the collective mode. We find that the\ncoupling rate of such mode to the cavity increases with the number of coupled\noscillators, similar to a Tavis-Cummings system. Further increasing the\ncoupling rates pushes this collective mode into the strong coupling regime with\nthe cavity. We demonstrate sideband ground-state cooling of the collective\nmode, achieving a 0.4 quanta occupation, and observe quantum sideband asymmetry\nfor this mode. Observing collective optomechanical phenomena in the quantum\nregime opens avenues for studying synchronization, investigating topological\nphases of sound, and achieving multipartite phonon-phonon and photon-phonon\nentanglement.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}