{"id":"2407.18253","title":"Denoising Improves Cross-Scanner and Cross-Protocol Test-Retest\n  Reproducibility of Higher-Order Diffusion Metrics","authors":"Benjamin Ades-Aron, Santiago Coelho, Gregory Lemberskiy, Jelle\n  Veraart, Steven Baete, Timothy M. Shepherd, Dmitry S. Novikov, Els Fieremans","authorsParsed":[["Ades-Aron","Benjamin",""],["Coelho","Santiago",""],["Lemberskiy","Gregory",""],["Veraart","Jelle",""],["Baete","Steven",""],["Shepherd","Timothy M.",""],["Novikov","Dmitry S.",""],["Fieremans","Els",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 21:18:45 GMT"}],"updateDate":"2024-07-29","timestamp":1720473525000,"abstract":"  The clinical translation of diffusion MRI (dMRI)-derived quantitative\ncontrasts hinges on robust reproducibility, minimizing both same-scanner and\ncross-scanner variability. This study evaluates the reproducibility of\nhigher-order diffusion metrics (beyond conventional diffusion tensor imaging),\nat the voxel and region-of-interest levels on magnitude and complex-valued dMRI\ndata, using denoising with and without harmonization. We compared same-scanner,\ncross-scanner, and cross-protocol variability for a multi-shell dMRI protocol\nin 20 subjects. We first evaluated the effectiveness of denoising strategies\nfor both magnitude and complex data to mitigate noise-induced bias and\nvariance, to improve dMRI parametric maps and reproducibility. We examined the\nimpact of denoising under different analysis approaches, comparing voxel-wise\nand region of interest (ROI)-based methods. We also evaluated the role of\ndenoising when harmonizing dMRI across scanners and protocols. DTI and DKI maps\nvisually improve after MPPCA denoising, with noticeably fewer outliers in\nkurtosis maps. Denoising enhances voxel-wise reproducibility, with test-retest\nvariability of kurtosis indices reduced from 15-20% to 5-10% after denoising.\nComplex dMRI denoising reduces the noise floor by up to 60%. In ROI-analyses,\ndenoising also increased statistical power, with reduction in sample size\nrequirements by up to 40% for detecting differences across populations.\nCombining denoising with linear-RISH harmonization, in voxel-wise assessments,\nimproved intra-scanner intraclass correlation coefficients for FA from moderate\nto excellent repeatability over harmonization alone. The enhancement in data\nquality and precision due to denoising facilitates the broader application and\nacceptance of these advanced imaging techniques in both clinical practice and\nlarge-scale neuroimaging studies.\n","subjects":["Physics/Medical Physics","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3xjtj4Bc6occOf6n5TufuJdMKzhbvJRXlMHpzeihDEk","pdfSize":"9018651","objectId":"0xc65589c1e5910e446f787a6a8b56889fc5023f52f6decfc2d5be9ca4d61493d1","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
