{"id":"2407.12614","title":"Strawberry detection and counting based on YOLOv7 pruning and\n  information based tracking algorithm","authors":"Shiyu Liu, Congliang Zhou, Won Suk Lee","authorsParsed":[["Liu","Shiyu",""],["Zhou","Congliang",""],["Lee","Won Suk",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:41:57 GMT"}],"updateDate":"2024-07-18","timestamp":1721227317000,"abstract":"  The strawberry industry yields significant economic benefits for Florida, yet\nthe process of monitoring strawberry growth and yield is labor-intensive and\ncostly. The development of machine learning-based detection and tracking\nmethodologies has been used for helping automated monitoring and prediction of\nstrawberry yield, still, enhancement has been limited as previous studies only\napplied the deep learning method for flower and fruit detection, which did not\nconsider the unique characteristics of image datasets collected by the machine\nvision system. This study proposed an optimal pruning of detection heads of the\ndeep learning model (YOLOv7 and its variants) that could achieve fast and\nprecise strawberry flower, immature fruit, and mature fruit detection.\nThereafter, an enhanced object tracking algorithm, which is called the\nInformation Based Tracking Algorithm (IBTA) utilized the best detection result,\nremoved the Kalman Filter, and integrated moving direction, velocity, and\nspatial information to improve the precision in strawberry flower and fruit\ntracking. The proposed pruning of detection heads across YOLOv7 variants,\nnotably Pruning-YOLOv7-tiny with detection head 3 and Pruning-YOLOv7-tiny with\nheads 2 and 3 achieved the best inference speed (163.9 frames per second) and\ndetection accuracy (89.1%), respectively. On the other hand, the effect of IBTA\nwas proved by comparing it with the centroid tracking algorithm (CTA), the\nMultiple Object Tracking Accuracy (MOTA) and Multiple Object Tracking Precision\n(MOTP) of IBTA were 12.3% and 6.0% higher than that of CTA, accordingly. In\naddition, other object-tracking evaluation metrics, including IDF1, IDR, IDP,\nMT, and IDs, show that IBTA performed better than CTA in strawberry flower and\nfruit tracking.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}