{"id":"2407.01363","title":"Mechanism design for coordinating vehicle-based mobile sensing tasks\n  within the ride-hailing platform","authors":"Shenglin Liu, Qian Ge, Ke Han, Daisuke Fukuda, Takao Dantsuji","authorsParsed":[["Liu","Shenglin",""],["Ge","Qian",""],["Han","Ke",""],["Fukuda","Daisuke",""],["Dantsuji","Takao",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:20:09 GMT"}],"updateDate":"2024-07-02","timestamp":1719847209000,"abstract":"  This paper evaluates the benefit of integrating vehicle-based mobile\ncrowd-sensing tasks into the ride-hailing system through the collaboration\nbetween the data user and the ride-hailing platform. In such a system, the\nride-hailing platform commissions high-valued sensing tasks to idle drivers who\ncan undertake either ride-hailing or sensing requests. Considering the\ndifferent service requirements and time windows between sensing and\nride-hailing requests, we design a staggered operation strategy for\nride-hailing order matching and the sensing task assignment. The auction-based\nmechanisms are employed to minimize costs while incentivizing driver\nparticipation in mobile sensing. To address the budget deficit problem of the\nprimal VCG-based task assignment mechanism, we refine the driver selection\napproach and tailor the payment rule by imposing additional budget constraints.\nWe demonstrate the benefits of our proposed mechanism through a series of\nnumerical experiments using the NYC Taxi data. Experimental results reveal the\npotential of the mechanism for achieving high completion rates of sensing tasks\nat low social costs without degrading ride-hailing services. Furthermore,\ndrivers who participate in both mobile sensing tasks and ride-hailing requests\nmay gain higher income, but this advantage may diminish with an increasing\nnumber of such drivers and higher demand for ride-hailing services.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}