{"id":"2407.21536","title":"Tracing Intricate Cues in Dialogue: Joint Graph Structure and Sentiment\n  Dynamics for Multimodal Emotion Recognition","authors":"Jiang Li, Xiaoping Wang, Zhigang Zeng","authorsParsed":[["Li","Jiang",""],["Wang","Xiaoping",""],["Zeng","Zhigang",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 11:47:36 GMT"}],"updateDate":"2024-08-01","timestamp":1722426456000,"abstract":"  Multimodal emotion recognition in conversation (MERC) has garnered\nsubstantial research attention recently. Existing MERC methods face several\nchallenges: (1) they fail to fully harness direct inter-modal cues, possibly\nleading to less-than-thorough cross-modal modeling; (2) they concurrently\nextract information from the same and different modalities at each network\nlayer, potentially triggering conflicts from the fusion of multi-source data;\n(3) they lack the agility required to detect dynamic sentimental changes,\nperhaps resulting in inaccurate classification of utterances with abrupt\nsentiment shifts. To address these issues, a novel approach named GraphSmile is\nproposed for tracking intricate emotional cues in multimodal dialogues.\nGraphSmile comprises two key components, i.e., GSF and SDP modules. GSF\ningeniously leverages graph structures to alternately assimilate inter-modal\nand intra-modal emotional dependencies layer by layer, adequately capturing\ncross-modal cues while effectively circumventing fusion conflicts. SDP is an\nauxiliary task to explicitly delineate the sentiment dynamics between\nutterances, promoting the model's ability to distinguish sentimental\ndiscrepancies. Furthermore, GraphSmile is effortlessly applied to multimodal\nsentiment analysis in conversation (MSAC), forging a unified multimodal\naffective model capable of executing MERC and MSAC tasks. Empirical results on\nmultiple benchmarks demonstrate that GraphSmile can handle complex emotional\nand sentimental patterns, significantly outperforming baseline models.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}