{"id":"2407.11912","title":"The CONUS+ experiment","authors":"The CONUS+ Collaboration: N. Ackermann, S. Armbruster, H. Bonet, C.\n  Buck, K. Fulber, J. Hakenmuller, J. Hempfling, G. Heusser, M. Lindner, W.\n  Maneschg, K. Ni, M. Rank, T. Rink, E. Sanchez Garcia, I. Stalder, H.\n  Strecker, R. Wink and J. Woenckhaus","authorsParsed":[["Collaboration","The CONUS+",""],[":","",""],["Ackermann","N.",""],["Armbruster","S.",""],["Bonet","H.",""],["Buck","C.",""],["Fulber","K.",""],["Hakenmuller","J.",""],["Hempfling","J.",""],["Heusser","G.",""],["Lindner","M.",""],["Maneschg","W.",""],["Ni","K.",""],["Rank","M.",""],["Rink","T.",""],["Garcia","E. Sanchez",""],["Stalder","I.",""],["Strecker","H.",""],["Wink","R.",""],["Woenckhaus","J.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 17:05:05 GMT"}],"updateDate":"2024-07-17","timestamp":1721149505000,"abstract":"  The CONUS+ experiment aims to detect coherent elastic neutrino-nucleus\nscattering (CEvNS) of reactor antineutrinos on germanium nuclei in the fully\ncoherent regime, continuing on this way the CONUS physics program started at\nthe Brokdorf nuclear power plant, Germany. The CONUS+ setup is installed in the\nnuclear power plant in Leibstadt, Switzerland, at a distance of 20.7 m from the\n3.6 GW thermal power reactor core. The CEvNS signature will be measured with\nthe same four point-contact high-purity germanium (HPGe) detectors produced for\nthe former experiment, however refurbished and with optimized low energy\nthresholds. To suppress the background in the CONUS+ detectors, the passive and\nactive layers of the original CONUS shield were modified such to fit better to\nthe significantly changed background conditions at the new experimental\nlocation. New data acquisition and monitoring systems were developed. A direct\nnetwork connection between the experiment and the Max-Planck-Institut fur\nKernphysik (MPIK) makes it possible to control and monitor data acquisition in\nreal time. The impact of all these modifications is discussed with particular\nemphasis on the resulting CEvNS signal prediction for the first data collection\nphase of CONUS+. Prospects of the planned upgrade in a second phase integrating\nnew larger HPGe detectors are also discussed.\n","subjects":["Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}