{"id":"2407.03523","title":"Inferring IGM parameters from the redshifted 21-cm Power Spectrum using\n  Artificial Neural Networks","authors":"Madhurima Choudhury, Raghunath Ghara, Saleem Zaroubi, Benedetta\n  Ciardi, Leon V. E. Koopmans, Garrelt Mellema, Abinash Kumar Shaw, Anshuman\n  Acharya, I. T. Iliev, Qing-Bo Ma, Sambit K. Giri","authorsParsed":[["Choudhury","Madhurima",""],["Ghara","Raghunath",""],["Zaroubi","Saleem",""],["Ciardi","Benedetta",""],["Koopmans","Leon V. E.",""],["Mellema","Garrelt",""],["Shaw","Abinash Kumar",""],["Acharya","Anshuman",""],["Iliev","I. T.",""],["Ma","Qing-Bo",""],["Giri","Sambit K.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 21:58:48 GMT"}],"updateDate":"2024-07-08","timestamp":1720043928000,"abstract":"  The high redshift 21-cm signal promises to be a crucial probe of the state of\nthe intergalactic medium (IGM). Understanding the connection between the\nobserved 21-cm power spectrum and the physical quantities intricately\nassociated with the IGM is crucial to fully understand the evolution of our\nUniverse. In this study, we develop an emulator using artificial neural network\n(ANN) to predict the 21-cm power spectrum from a given set of IGM properties,\nnamely, the bubble size distribution and the volume averaged ionization\nfraction. This emulator is implemented within a standard Bayesian framework to\nconstrain the IGM parameters from a given 21-cm power spectrum. We compare the\nperformance of the Bayesian method to an alternate method using ANN to predict\nthe IGM parameters from a given input power spectrum, and find that both\nmethods yield similar levels of accuracy, while the ANN is significantly\nfaster. We also use this ANN method of parameter estimation to predict the IGM\nparameters from a test set contaminated with noise levels expected from the\nSKA-LOW instrument after 1000 hours of observation. Finally, we train a\nseparate ANN to predict the source parameters from the IGM parameters directly,\nat a redshift of $z=9.1$, demonstrating the possibility of a non-analytic\ninference of the source parameters from the IGM parameters for the first time.\nWe achieve high accuracies, with R2-scores ranging between $0.898-0.978$ for\nthe ANN emulator and between $0.966-0.986$ and $0.817-0.981$ for the\npredictions of IGM parameters from 21-cm power spectrum and source parameters\nfrom IGM parameters, respectively. The predictions of the IGM parameters from\nthe Bayesian method incorporating the ANN emulator leads to tight constraints\nwith error bars around $\\pm{0.14}$ on the IGM parameters.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}