{"id":"2407.07387","title":"Unveiling the nature of two dwarf novae: CRTS J080846.2+313106 and V416\n  Dra","authors":"Arti Joshi, M\\'arcio Catelan, Simone Scaringi, Axel Schwope, G. C.\n  Anupama, Nikita Rawat, Devendra K. Sahu, Mridweeka Singh, Raya Dastidar, Rama\n  Venkata Subramanian, and Srinivas M Rao","authorsParsed":[["Joshi","Arti",""],["Catelan","Márcio",""],["Scaringi","Simone",""],["Schwope","Axel",""],["Anupama","G. C.",""],["Rawat","Nikita",""],["Sahu","Devendra K.",""],["Singh","Mridweeka",""],["Dastidar","Raya",""],["Subramanian","Rama Venkata",""],["Rao","Srinivas M",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 06:19:43 GMT"}],"updateDate":"2024-07-11","timestamp":1720592383000,"abstract":"  We present the analysis of optical photometric and spectroscopic observations\nof two non-magnetic cataclysmic variables, namely CRTS J080846.2+313106 and\nV416 Dra. CRTS J080846.2+313106 has been found to vary with a period of\n4.9116$\\pm$0.0003 h, which was not found in earlier studies and is\nprovisionally suggested as the orbital period of the system. In both\nlong-period systems, the observed dominant signal at second harmonic of the\norbital frequency and the orbital modulation during quiescence are suggestive\nof ellipsoidal variation from changing aspects of the secondary, with an\nadditional contribution from the accretion stream or hotspot. However, during\nthe outburst, the hotspot itself is overwhelmed by the increased brightness,\nwhich is possibly associated with the accretion disc. The mid-eclipse phase for\nV416 Dra occurs earlier and the width of the eclipse is greater during\noutbursts compared to quiescence, suggesting an increased accretion disc radius\nduring outbursts. Furthermore, the investigation of accretion disc eclipse in\nV416 Dra implies that a total disc eclipse is possible during quiescence,\nwhereas the disc seems to be partially obscured during outbursts, which further\nsignifies that the disc may grow in size as the outburst progresses. Optical\nspectra of CRTS J080846.2+313106 and V416 Dra are typical of dwarf novae during\nquiescence, and they both show a significant contribution from the M2-4V\nsecondary. The light curve patterns, orbital periods, and spectra observed in\nboth systems look remarkably similar, and seem to resemble the characteristics\nof U Gem-type dwarf novae.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}