{"id":"2407.19763","title":"TeleOR: Real-time Telemedicine System for Full-Scene Operating Room","authors":"Yixuan Wu, Kaiyuan Hu, Qian Shao, Jintai Chen, Danny Z. Chen, Jian Wu","authorsParsed":[["Wu","Yixuan",""],["Hu","Kaiyuan",""],["Shao","Qian",""],["Chen","Jintai",""],["Chen","Danny Z.",""],["Wu","Jian",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 07:56:11 GMT"}],"updateDate":"2024-07-30","timestamp":1722239771000,"abstract":"  The advent of telemedicine represents a transformative development in\nleveraging technology to extend the reach of specialized medical expertise to\nremote surgeries, a field where the immediacy of expert guidance is paramount.\nHowever, the intricate dynamics of Operating Room (OR) scene pose unique\nchallenges for telemedicine, particularly in achieving high-fidelity, real-time\nscene reconstruction and transmission amidst obstructions and bandwidth\nlimitations. This paper introduces TeleOR, a pioneering system designed to\naddress these challenges through real-time OR scene reconstruction for\nTele-intervention. TeleOR distinguishes itself with three innovative\napproaches: dynamic self-calibration, which leverages inherent scene features\nfor calibration without the need for preset markers, allowing for obstacle\navoidance and real-time camera adjustment; selective OR reconstruction,\nfocusing on dynamically changing scene segments to reduce reconstruction\ncomplexity; and viewport-adaptive transmission, optimizing data transmission\nbased on real-time client feedback to efficiently deliver high-quality 3D\nreconstructions within bandwidth constraints. Comprehensive experiments on the\n4D-OR surgical scene dataset demostrate the superiority and applicability of\nTeleOR, illuminating the potential to revolutionize tele-interventions by\novercoming the spatial and technical barriers inherent in remote surgical\nguidance.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}