{"id":"2407.02373","title":"Emerging supersolidity from a polariton condensate in a photonic crystal\n  waveguide","authors":"Dimitrios Trypogeorgos, Antonio Gianfrate, Manuele Landini, Davide\n  Nigro, Dario Gerace, Iacopo Carusotto, Fabrizio Riminucci, Kirk W. Baldwin,\n  Loren N. Pfeiffer, Giovanni I. Martone, Milena De Giorgi, Dario Ballarini,\n  Daniele Sanvitto","authorsParsed":[["Trypogeorgos","Dimitrios",""],["Gianfrate","Antonio",""],["Landini","Manuele",""],["Nigro","Davide",""],["Gerace","Dario",""],["Carusotto","Iacopo",""],["Riminucci","Fabrizio",""],["Baldwin","Kirk W.",""],["Pfeiffer","Loren N.",""],["Martone","Giovanni I.",""],["De Giorgi","Milena",""],["Ballarini","Dario",""],["Sanvitto","Daniele",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 15:42:05 GMT"}],"updateDate":"2024-07-03","timestamp":1719934925000,"abstract":"  A supersolid is a counter-intuitive phase of matter where its constituent\nparticles are arranged into a crystalline structure, yet they are free to flow\nwithout friction. This requires the particles to share a global macroscopic\nphase while being able to reduce their total energy by spontaneous, spatial\nself-organisation. This exotic state of matter has been achieved in different\nsystems using Bose-Einstein condensates coupled to cavities, possessing\nspin-orbit coupling, or dipolar interactions. Here we provide experimental\nevidence of a new implementation of the supersolid phase in a novel\nnon-equilibrium context based on exciton-polaritons condensed in a\ntopologically non-trivial, bound-in-the-continuum state with exceptionally low\nlosses. We measure the density modulation of the polaritonic state indicating\nthe breaking of translational symmetry with a remarkable precision of a few\nparts in a thousand. Direct access to the phase of the wavefunction allows us\nto additionally measure the local coherence of the superfluid component. We\ndemonstrate the potential of our synthetic photonic material to host phonon\ndynamics and a multimode excitation spectrum.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Quantum Gases"],"license":"http://creativecommons.org/licenses/by/4.0/"}