{"id":"2407.00359","title":"Multicriteria Optimization and Decision Making: Principles, Algorithms\n  and Case Studies","authors":"Michael Emmerich, Andr\\'e Deutz","authorsParsed":[["Emmerich","Michael",""],["Deutz","André",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 08:12:36 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 06:38:28 GMT"}],"updateDate":"2024-07-03","timestamp":1719648756000,"abstract":"  Real-world decision and optimization problems, often involve constraints and\nconflicting criteria. For example, choosing a travel method must balance speed,\ncost, environmental footprint, and convenience. Similarly, designing an\nindustrial process must consider safety, environmental impact, and cost\nefficiency. Ideal solutions where all objectives are optimally met are rare;\ninstead, we seek good compromises and aim to avoid lose-lose scenarios.\nMulticriteria optimization offers computational techniques to compute Pareto\noptimal solutions, aiding decision analysis and decision making. This reader\noffers an introduction to this topic and has been developed on the basis of the\nrevised edition of the reader for the MSc computer science course\n\"Multicriteria Optimization and Decision Analysis\" at the Leiden Institute of\nAdvanced Computer Science, Leiden University, The Netherlands. This course was\ntaught annually by the first author from 2007 to 2023 as a single semester\ncourse with lectures and practicals. Our aim was to make the material\naccessible to MSc students who do not study mathematics as their core\ndiscipline by introducing basic numerical analysis concepts when necessary and\nproviding numerical examples for interesting cases. The introduction is\norganized in a unique didactic manner developed by the authors, starting from\nmore simple concepts such as linear programming and single-point methods, and\nadvancing from these to more difficult concepts such as optimality conditions\nfor nonlinear optimization and set-oriented solution algorithms. Besides, we\nfocus on the mathematical modeling and foundations rather than on specific\nalgorithms, though not excluding the discussion of some representative examples\nof solution algorithms.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}