{"id":"2407.17110","title":"The Extreme Low-mass End of the Mass-Metallicity Relation at $z\\sim7$","authors":"Iryna Chemerynska, Hakim Atek, Pratika Dayal, Lukas J. Furtak, Robert\n  Feldmann, Jenny E. Greene, Michael V. Maseda, Themiya Nanayakkara, Pascal A.\n  Oesch, Ivo Labbe, Rachel Bezanson, Gabriel Brammer, Sam E. Cutler, Joel Leja,\n  Richard Pan, Sedona H. Price, Bingjie Wang, John R. Weaver, and Katherine E.\n  Whitaker","authorsParsed":[["Chemerynska","Iryna",""],["Atek","Hakim",""],["Dayal","Pratika",""],["Furtak","Lukas J.",""],["Feldmann","Robert",""],["Greene","Jenny E.",""],["Maseda","Michael V.",""],["Nanayakkara","Themiya",""],["Oesch","Pascal A.",""],["Labbe","Ivo",""],["Bezanson","Rachel",""],["Brammer","Gabriel",""],["Cutler","Sam E.",""],["Leja","Joel",""],["Pan","Richard",""],["Price","Sedona H.",""],["Wang","Bingjie",""],["Weaver","John R.",""],["Whitaker","Katherine E.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 09:19:25 GMT"}],"updateDate":"2024-07-25","timestamp":1721812765000,"abstract":"  The mass-metallicity relation (MZR) provides crucial insights into the baryon\ncycle in galaxies and provides strong constraints on galaxy formation models.\nWe use JWST NIRSpec observations from the UNCOVER program to measure the\ngas-phase metallicity in a sample of eight galaxies during the epoch of\nreionization at $z=6-8$. Thanks to strong lensing of the galaxy cluster Abell\n2744, we are able to probe extremely low stellar masses between $10^{6}$ and\n$10^{8} M_{\\odot}$. Using strong lines diagnostics and the most recent JWST\ncalibrations, we derive extremely-low oxygen abundances ranging from\n12+log(O/H)=6.7 to 7.8. By combining this sample with more massive galaxies at\nsimilar redshifts, we derive a best-fit relation of 12+{\\rm\nlog(O/H)}=$0.39_{-0.02}^{+0.02} \\times$ log(\\mstar) $+ 4.52_{-0.17}^{+0.17}$,\nwhich is steeper than determinations at $z \\sim 3$. Our results show a clear\nredshift evolution in the overall normalization of the relation, galaxies at\nhigher redshift having significantly lower metallicities at a given mass. A\ncomparison with theoretical models provides important constraints on which\nphysical processes, such as metal mixing, star formation or feedback recipes,\nare important in reproducing the observations. Additionally, these galaxies\nexhibit star formation rates that are higher by a factor of a few to tens\ncompared to extrapolated relations at similar redshifts or theoretical\npredictions of main-sequence galaxies, pointing to a recent burst of star\nformation. All these observations are indicative of highly stochastic star\nformation and ISM enrichment, expected in these low-mass systems, suggesting\nthat feedback mechanisms in high-$z$ dwarf galaxies might be different from\nthose in place at higher masses.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}