{"id":"2407.09005","title":"Introducing VaDA: Novel Image Segmentation Model for Maritime Object\n  Segmentation Using New Dataset","authors":"Yongjin Kim, Jinbum Park, Sanha Kang, Hanguen Kim","authorsParsed":[["Kim","Yongjin",""],["Park","Jinbum",""],["Kang","Sanha",""],["Kim","Hanguen",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 05:48:53 GMT"}],"updateDate":"2024-07-15","timestamp":1720763333000,"abstract":"  The maritime shipping industry is undergoing rapid evolution driven by\nadvancements in computer vision artificial intelligence (AI). Consequently,\nresearch on AI-based object recognition models for maritime transportation is\nsteadily growing, leveraging advancements in sensor technology and computing\nperformance. However, object recognition in maritime environments faces\nchallenges such as light reflection, interference, intense lighting, and\nvarious weather conditions. To address these challenges, high-performance deep\nlearning algorithms tailored to maritime imagery and high-quality datasets\nspecialized for maritime scenes are essential. Existing AI recognition models\nand datasets have limited suitability for composing autonomous navigation\nsystems. Therefore, in this paper, we propose a Vertical and Detail Attention\n(VaDA) model for maritime object segmentation and a new model evaluation\nmethod, the Integrated Figure of Calculation Performance (IFCP), to verify its\nsuitability for the system in real-time. Additionally, we introduce a benchmark\nmaritime dataset, OASIs (Ocean AI Segmentation Initiatives) to standardize\nmodel performance evaluation across diverse maritime environments. OASIs\ndataset and details are available at our website:\nhttps://www.navlue.com/dataset\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ElnJ9Z1iiAnCeu1rbV8VjRJ3lqlKzL6YKBv9XJv56VM","pdfSize":"12528310"}
