{"id":"2407.17146","title":"Quantifying variabilities in cardiac digital twin models of the\n  electrocardiogram","authors":"Elena Zappon, Matthias A.F. Gsell, Karli Gillette, Gernot Plank","authorsParsed":[["Zappon","Elena",""],["Gsell","Matthias A. F.",""],["Gillette","Karli",""],["Plank","Gernot",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 10:35:56 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 08:10:13 GMT"}],"updateDate":"2024-07-26","timestamp":1721817356000,"abstract":"  Cardiac digital twins (CDTs) of human cardiac electrophysiology (EP) are\ndigital replicas of patient hearts that match like-for-like clinical\nobservations. The electrocardiogram (ECG), as the most prevalent non-invasive\nobservation of cardiac electrophysiology, is considered an ideal target for CDT\ncalibration. Recent advanced CDT calibration methods have demonstrated their\nability to minimize discrepancies between simulated and measured ECG signals,\neffectively replicating all key morphological features relevant to diagnostics.\nHowever, due to the inherent nature of clinical data acquisition and CDT model\ngeneration pipelines, discrepancies inevitably arise between the real physical\nelectrophysiology in a patient and the simulated virtual electrophysiology in a\nCDT. In this study, we aim to qualitatively and quantitatively analyze the\nimpact of these uncertainties on ECG morphology and diagnostic markers. We\nanalyze residual beat-to-beat variability in ECG recordings obtained from\nhealthy subjects and patients. Using a biophysically detailed and anatomically\naccurate computational model of whole-heart electrophysiology combined with a\ndetailed torso model calibrated to closely replicate measured ECG signals, we\nvary anatomical factors (heart location, orientation, size), heterogeneity in\nelectrical conductivities in the heart and torso, and electrode placements\nacross ECG leads to assess their qualitative impact on ECG morphology. Our\nstudy demonstrates that diagnostically relevant ECG features and overall\nmorphology appear relatively robust against the investigated uncertainties.\nThis resilience is consistent with the narrow distribution of ECG due to\nresidual beat-to-beat variability observed in both healthy subjects and\npatients.\n","subjects":["Physics/Medical Physics","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis","Quantitative Biology/Tissues and Organs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}