{"id":"2407.08610","title":"Semantic GUI Scene Learning and Video Alignment for Detecting Duplicate\n  Video-based Bug Reports","authors":"Yanfu Yan, Nathan Cooper, Oscar Chaparro, Kevin Moran, Denys\n  Poshyvanyk","authorsParsed":[["Yan","Yanfu",""],["Cooper","Nathan",""],["Chaparro","Oscar",""],["Moran","Kevin",""],["Poshyvanyk","Denys",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 15:48:36 GMT"}],"updateDate":"2024-07-12","timestamp":1720712916000,"abstract":"  Video-based bug reports are increasingly being used to document bugs for\nprograms centered around a graphical user interface (GUI). However, developing\nautomated techniques to manage video-based reports is challenging as it\nrequires identifying and understanding often nuanced visual patterns that\ncapture key information about a reported bug. In this paper, we aim to overcome\nthese challenges by advancing the bug report management task of duplicate\ndetection for video-based reports. To this end, we introduce a new approach,\ncalled JANUS, that adapts the scene-learning capabilities of vision\ntransformers to capture subtle visual and textual patterns that manifest on app\nUI screens - which is key to differentiating between similar screens for\naccurate duplicate report detection. JANUS also makes use of a video alignment\ntechnique capable of adaptive weighting of video frames to account for typical\nbug manifestation patterns. In a comprehensive evaluation on a benchmark\ncontaining 7,290 duplicate detection tasks derived from 270 video-based bug\nreports from 90 Android app bugs, the best configuration of our approach\nachieves an overall mRR/mAP of 89.8%/84.7%, and for the large majority of\nduplicate detection tasks, outperforms prior work by around 9% to a\nstatistically significant degree. Finally, we qualitatively illustrate how the\nscene-learning capabilities provided by Janus benefits its performance.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}