{"id":"2407.21069","title":"High-Dimensional Fault Tolerance Testing of Highly Automated Vehicles\n  Based on Low-Rank Models","authors":"Yuewen Mei, Tong Nie, Jian Sun, Ye Tian","authorsParsed":[["Mei","Yuewen",""],["Nie","Tong",""],["Sun","Jian",""],["Tian","Ye",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 14:27:13 GMT"}],"updateDate":"2024-08-01","timestamp":1722176833000,"abstract":"  Ensuring fault tolerance of Highly Automated Vehicles (HAVs) is crucial for\ntheir safety due to the presence of potentially severe faults. Hence, Fault\nInjection (FI) testing is conducted by practitioners to evaluate the safety\nlevel of HAVs. To fully cover test cases, various driving scenarios and fault\nsettings should be considered. However, due to numerous combinations of test\nscenarios and fault settings, the testing space can be complex and\nhigh-dimensional. In addition, evaluating performance in all newly added\nscenarios is resource-consuming. The rarity of critical faults that can cause\nsecurity problems further strengthens the challenge. To address these\nchallenges, we propose to accelerate FI testing under the low-rank Smoothness\nRegularized Matrix Factorization (SRMF) framework. We first organize the sparse\nevaluated data into a structured matrix based on its safety values. Then the\nuntested values are estimated by the correlation captured by the matrix\nstructure. To address high dimensionality, a low-rank constraint is imposed on\nthe testing space. To exploit the relationships between existing scenarios and\nnew scenarios and capture the local regularity of critical faults, three types\nof smoothness regularization are further designed as a complement. We conduct\nexperiments on car following and cut in scenarios. The results indicate that\nSRMF has the lowest prediction error in various scenarios and is capable of\npredicting rare critical faults compared to other machine learning models. In\naddition, SRMF can achieve 1171 acceleration rate, 99.3% precision and 91.1% F1\nscore in identifying critical faults. To the best of our knowledge, this is the\nfirst work to introduce low-rank models to FI testing of HAVs.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}