{"id":"2407.08127","title":"Prediction Exposes Your Face: Black-box Model Inversion via Prediction\n  Alignment","authors":"Yufan Liu, Wanqian Zhang, Dayan Wu, Zheng Lin, Jingzi Gu, Weiping Wang","authorsParsed":[["Liu","Yufan",""],["Zhang","Wanqian",""],["Wu","Dayan",""],["Lin","Zheng",""],["Gu","Jingzi",""],["Wang","Weiping",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 01:58:35 GMT"}],"updateDate":"2024-07-12","timestamp":1720663115000,"abstract":"  Model inversion (MI) attack reconstructs the private training data of a\ntarget model given its output, posing a significant threat to deep learning\nmodels and data privacy. On one hand, most of existing MI methods focus on\nsearching for latent codes to represent the target identity, yet this iterative\noptimization-based scheme consumes a huge number of queries to the target\nmodel, making it unrealistic especially in black-box scenario. On the other\nhand, some training-based methods launch an attack through a single forward\ninference, whereas failing to directly learn high-level mappings from\nprediction vectors to images. Addressing these limitations, we propose a novel\nPrediction-to-Image (P2I) method for black-box MI attack. Specifically, we\nintroduce the Prediction Alignment Encoder to map the target model's output\nprediction into the latent code of StyleGAN. In this way, prediction vector\nspace can be well aligned with the more disentangled latent space, thus\nestablishing a connection between prediction vectors and the semantic facial\nfeatures. During the attack phase, we further design the Aligned Ensemble\nAttack scheme to integrate complementary facial attributes of target identity\nfor better reconstruction. Experimental results show that our method\noutperforms other SOTAs, e.g.,compared with RLB-MI, our method improves attack\naccuracy by 8.5% and reduces query numbers by 99% on dataset CelebA.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RydaRnrzzHyf4KDRsKXHZu20OntNt-9Sjfqp3NHl4zg","pdfSize":"5401011"}
