{"id":"2407.07390","title":"Hole Statistics of Equilibrium 2D and 3D Hard-Sphere Crystals","authors":"Haina Wang, David A. Huse, Salvatore Torquato","authorsParsed":[["Wang","Haina",""],["Huse","David A.",""],["Torquato","Salvatore",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 06:31:12 GMT"}],"updateDate":"2024-07-11","timestamp":1720593072000,"abstract":"  The probability of finding a spherical \"hole\" of a given radius $r$ contains\ncrucial structural information about many-body systems. Such hole statistics,\nincluding the void conditional nearest-neighbor probability functions $G_V(r)$,\nhave been well studied for hard-sphere fluids in $d$-dimensional Euclidean\nspace $\\mathbb{R}^d$. However, little is known about these functions for\nhard-sphere crystals for values of $r$ beyond the hard-sphere diameter, as\nlarge holes are extremely rare in crystal phases. To overcome these\ncomputational challenges, we introduce a biased-sampling scheme that accurately\ndetermines hole statistics for equilibrium hard spheres on ranges of $r$ that\nfar extend those that could be previously explored. We discover that $G_V(r)$\nin crystal and hexatic states exhibits oscillations whose amplitudes increase\nrapidly with the packing fraction, which stands in contrast to $G_V(r)$ for\nfluid states that is monotonic in $r$. The oscillations in $G_V(r)$ for 2D\ncrystals are strongly correlated with the local orientational order metric in\nthe vicinity of the holes, and variations in $G_V(r)$ for 3D states indicate a\ntransition between tetrahedral and octahedral holes, demonstrating the power of\n$G_V(r)$ as a probe of local coordination geometry. To further study the\nstatistics of interparticle spacing in hard-sphere systems, we compute the\nlocal packing fraction distribution $f(\\phi_l)$ of Delaunay cells, and find\nthat for $d\\leq 3$, the excess kurtosis of $f(\\phi_l)$ switches sign at a\ncertain transitional global packing fraction. Our investigation facilitates the\nstudy of structural and bulk properties of materials that involve the creation\nof rare large holes, such as the solubility of alloys.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"80RIhKYZkx-LCAH_igmXVMLXWPA31DB5PbY8ThG6YWA","pdfSize":"995759","objectId":"0xaae0b90cbfa04c869c57d9320cd755cff029f4d3c6357fe8d8fa51a082678224","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
