{"id":"2407.05510","title":"SCATTER: Algorithm-Circuit Co-Sparse Photonic Accelerator with\n  Thermal-Tolerant, Power-Efficient In-situ Light Redistribution","authors":"Ziang Yin, Nicholas Gangi, Meng Zhang, Jeff Zhang, Rena Huang, Jiaqi\n  Gu","authorsParsed":[["Yin","Ziang",""],["Gangi","Nicholas",""],["Zhang","Meng",""],["Zhang","Jeff",""],["Huang","Rena",""],["Gu","Jiaqi",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 22:57:44 GMT"}],"updateDate":"2024-07-09","timestamp":1720393064000,"abstract":"  Photonic computing has emerged as a promising solution for accelerating\ncomputation-intensive artificial intelligence (AI) workloads. However, limited\nreconfigurability, high electrical-optical conversion cost, and thermal\nsensitivity limit the deployment of current optical analog computing engines to\nsupport power-restricted, performance-sensitive AI workloads at scale. Sparsity\nprovides a great opportunity for hardware-efficient AI accelerators. However,\ncurrent dense photonic accelerators fail to fully exploit the power-saving\npotential of algorithmic sparsity. It requires sparsity-aware hardware\nspecialization with a fundamental re-design of photonic tensor core topology\nand cross-layer device-circuit-architecture-algorithm co-optimization aware of\nhardware non-ideality and power bottleneck. To trim down the redundant power\nconsumption while maximizing robustness to thermal variations, we propose\nSCATTER, a novel algorithm-circuit co-sparse photonic accelerator featuring\ndynamically reconfigurable signal path via thermal-tolerant, power-efficient\nin-situ light redistribution and power gating. A power-optimized,\ncrosstalk-aware dynamic sparse training framework is introduced to explore\nrow-column structured sparsity and ensure marginal accuracy loss and maximum\npower efficiency. The extensive evaluation shows that our cross-stacked\noptimized accelerator SCATTER achieves a 511X area reduction and 12.4X power\nsaving with superior crosstalk tolerance that enables unprecedented circuit\nlayout compactness and on-chip power efficiency.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Emerging Technologies","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}