{"id":"2407.00209","title":"High Throughput Parameter Estimation and Uncertainty Analysis Applied to\n  the Production of Mycoprotein from Synthetic Lignocellulosic Hydrolysates","authors":"Mason Banks, Mark Taylor, Miao Guo","authorsParsed":[["Banks","Mason",""],["Taylor","Mark",""],["Guo","Miao",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 19:29:51 GMT"}],"updateDate":"2024-07-02","timestamp":1719602991000,"abstract":"  The current global food system produces substantial waste and carbon\nemissions while exacerbating the effects of global hunger and protein\ndeficiency. This study aims to address these challenges by exploring the use of\nlignocellulosic agricultural residues as feedstocks for microbial protein\nfermentation, focusing on Fusarium venenatum A3/5, a mycelial strain known for\nits high protein yield and quality. We propose a high throughput microlitre\nbatch fermentation system paired with analytical chemistry to generate\ntime-series data of microbial growth and substrate utilisation. An unstructured\nbiokinetic model was developed using a bootstrap sampling approach to quantify\nuncertainty in the parameter estimates. The model was validated against an\nindependent dataset of a different glucose-xylose composition to assess the\npredictive performance. Our results indicate a robust model fit with high\ncoefficients of determination and low root mean squared errors for biomass,\nglucose, and xylose concentrations. Estimated parameter values provided\ninsights into the resource utilisation strategies of Fusarium venenatum A3/5 in\nmixed substrate cultures, aligning well with previous research findings.\nSignificant correlations between estimated parameters were observed,\nhighlighting challenges in parameter identifiability. This work provides a\nfoundational model for optimising the production of microbial protein from\nlignocellulosic waste, contributing to a more sustainable global food system.\n","subjects":["Physics/Biological Physics","Quantitative Biology/Cell Behavior"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"U7hglkE44OsXmMitwWdMldvsRYYMir5A-cLjaC2s7H0","pdfSize":"2750387","objectId":"0x6763326b5d22470620cbae635e97380e555b9cba8c54ec62ee5176c5566a9a14","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
