{"id":"2407.19035","title":"ScalingGaussian: Enhancing 3D Content Creation with Generative Gaussian\n  Splatting","authors":"Shen Chen, Jiale Zhou, Zhongyu Jiang, Tianfang Zhang, Zongkai Wu,\n  Jenq-Neng Hwang, Lei Li","authorsParsed":[["Chen","Shen",""],["Zhou","Jiale",""],["Jiang","Zhongyu",""],["Zhang","Tianfang",""],["Wu","Zongkai",""],["Hwang","Jenq-Neng",""],["Li","Lei",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:26:01 GMT"}],"updateDate":"2024-07-30","timestamp":1722018361000,"abstract":"  The creation of high-quality 3D assets is paramount for applications in\ndigital heritage preservation, entertainment, and robotics. Traditionally, this\nprocess necessitates skilled professionals and specialized software for the\nmodeling, texturing, and rendering of 3D objects. However, the rising demand\nfor 3D assets in gaming and virtual reality (VR) has led to the creation of\naccessible image-to-3D technologies, allowing non-professionals to produce 3D\ncontent and decreasing dependence on expert input. Existing methods for 3D\ncontent generation struggle to simultaneously achieve detailed textures and\nstrong geometric consistency. We introduce a novel 3D content creation\nframework, ScalingGaussian, which combines 3D and 2D diffusion models to\nachieve detailed textures and geometric consistency in generated 3D assets.\nInitially, a 3D diffusion model generates point clouds, which are then\ndensified through a process of selecting local regions, introducing Gaussian\nnoise, followed by using local density-weighted selection. To refine the 3D\ngaussians, we utilize a 2D diffusion model with Score Distillation Sampling\n(SDS) loss, guiding the 3D Gaussians to clone and split. Finally, the 3D\nGaussians are converted into meshes, and the surface textures are optimized\nusing Mean Square Error(MSE) and Gradient Profile Prior(GPP) losses. Our method\naddresses the common issue of sparse point clouds in 3D diffusion, resulting in\nimproved geometric structure and detailed textures. Experiments on image-to-3D\ntasks demonstrate that our approach efficiently generates high-quality 3D\nassets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}