{"id":"2407.02418","title":"AXIAL: Attention-based eXplainability for Interpretable Alzheimer's\n  Localized Diagnosis using 2D CNNs on 3D MRI brain scans","authors":"Gabriele Lozupone, Alessandro Bria, Francesco Fontanella and Claudio\n  De Stefano","authorsParsed":[["Lozupone","Gabriele",""],["Bria","Alessandro",""],["Fontanella","Francesco",""],["De Stefano","Claudio",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 16:44:00 GMT"}],"updateDate":"2024-07-03","timestamp":1719938640000,"abstract":"  This study presents an innovative method for Alzheimer's disease diagnosis\nusing 3D MRI designed to enhance the explainability of model decisions. Our\napproach adopts a soft attention mechanism, enabling 2D CNNs to extract\nvolumetric representations. At the same time, the importance of each slice in\ndecision-making is learned, allowing the generation of a voxel-level attention\nmap to produces an explainable MRI. To test our method and ensure the\nreproducibility of our results, we chose a standardized collection of MRI data\nfrom the Alzheimer's Disease Neuroimaging Initiative (ADNI). On this dataset,\nour method significantly outperforms state-of-the-art methods in (i)\ndistinguishing AD from cognitive normal (CN) with an accuracy of 0.856 and\nMatthew's correlation coefficient (MCC) of 0.712, representing improvements of\n2.4\\% and 5.3\\% respectively over the second-best, and (ii) in the prognostic\ntask of discerning stable from progressive mild cognitive impairment (MCI) with\nan accuracy of 0.725 and MCC of 0.443, showing improvements of 10.2\\% and\n20.5\\% respectively over the second-best. We achieved this prognostic result by\nadopting a double transfer learning strategy, which enhanced sensitivity to\nmorphological changes and facilitated early-stage AD detection. With\nvoxel-level precision, our method identified which specific areas are being\npaid attention to, identifying these predominant brain regions: the\n\\emph{hippocampus}, the \\emph{amygdala}, the \\emph{parahippocampal}, and the\n\\emph{inferior lateral ventricles}. All these areas are clinically associated\nwith AD development. Furthermore, our approach consistently found the same\nAD-related areas across different cross-validation folds, proving its\nrobustness and precision in highlighting areas that align closely with known\npathological markers of the disease.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}