{"id":"2407.13818","title":"Imaging the Wakes of Jets with Energy-Energy-Energy Correlators","authors":"Hannah Bossi, Arjun Srinivasan Kudinoor, Ian Moult, Daniel Pablos,\n  Ananya Rai, Krishna Rajagopal","authorsParsed":[["Bossi","Hannah",""],["Kudinoor","Arjun Srinivasan",""],["Moult","Ian",""],["Pablos","Daniel",""],["Rai","Ananya",""],["Rajagopal","Krishna",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-22","timestamp":1721325600000,"abstract":"  As the partons in a jet propagate through the quark-gluon plasma (QGP)\nproduced in a heavy-ion collision, they lose energy to, kick, and are kicked by\nthe medium. The resulting modifications to the parton shower encode information\nabout the microscopic nature of QGP. The momentum and energy lost by the parton\nshower are gained by the medium and, since QGP is a strongly coupled liquid,\nthis means that the jet excites a wake in the droplet of QGP. After freezeout,\nthis wake becomes soft hadrons with net momentum in the jet direction meaning\nthat reconstructed jets include hadrons originating from both the modified\nparton shower and its wake. This makes it challenging to find an unambiguous\nexperimental view of the response of a droplet of QGP to a jet. Recent years\nhave seen significant advances in the understanding of the substructure of jets\nusing correlation functions of the energy flux operator. So far, such studies\nhave focused primarily on the two-point correlator, which serves to identify\nthe angular scale of the underlying dynamics. Higher-point correlators hold the\npromise of mapping out the dynamics themselves. We perform the first study of\nthe shape-dependent three-point energy-energy-energy correlator in heavy-ion\ncollisions. Using the Hybrid Model to simulate the interactions of high energy\njets with QGP, we show that hadrons originating from wakes are the dominant\ncontribution to the three-point correlator in the regime where the three points\nare well-separated in angle, forming a roughly equilateral triangle. This\nequilateral region of the correlator is far from the region populated by\ncollinear vacuum emissions, making it a canvas on which jet wakes can be\nimaged. Our work is a key step towards the systematic use of energy correlators\nto image and unravel the dynamical response of a droplet of QGP to a passing\njet, and motivates many experimental and theoretical studies.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory","Physics/Nuclear Experiment","Physics/Nuclear Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}