{"id":"2407.07361","title":"Characterizing Encrypted Application Traffic through Cellular Radio\n  Interface Protocol","authors":"Md Ruman Islam (1), Raja Hasnain Anwar (2), Spyridon Mastorakis (3),\n  Muhammad Taqi Raza (2) ((1) University of Nebraska Omaha, (2) University of\n  Massachusetts Amherst, (3) University of Notre Dame)","authorsParsed":[["Islam","Md Ruman",""],["Anwar","Raja Hasnain",""],["Mastorakis","Spyridon",""],["Raza","Muhammad Taqi",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 04:39:56 GMT"},{"version":"v2","created":"Sat, 20 Jul 2024 16:33:09 GMT"}],"updateDate":"2024-07-23","timestamp":1720586396000,"abstract":"  Modern applications are end-to-end encrypted to prevent data from being read\nor secretly modified. 5G tech nology provides ubiquitous access to these\napplications without compromising the application-specific performance and\nlatency goals. In this paper, we empirically demonstrate that 5G radio\ncommunication becomes the side channel to precisely infer the user's\napplications in real-time. The key idea lies in observing the 5G physical and\nMAC layer interactions over time that reveal the application's behavior. The\nMAC layer receives the data from the application and requests the network to\nassign the radio resource blocks. The network assigns the radio resources as\nper application requirements, such as priority, Quality of Service (QoS) needs,\namount of data to be transmitted, and buffer size. The adversary can passively\nobserve the radio resources to fingerprint the applications. We empirically\ndemonstrate this attack by considering four different categories of\napplications: online shopping, voice/video conferencing, video streaming, and\nOver-The-Top (OTT) media platforms. Finally, we have also demonstrated that an\nattacker can differentiate various types of applications in real-time within\neach category.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nVEhJFQkJ0XuQXmkcBlbO4e76W5JuaYCyCN1PloIlSM","pdfSize":"745844"}
