{"id":"2407.10559","title":"LIP-CAR: contrast agent reduction by a deep learned inverse problem","authors":"Davide Bianchi, Sonia Colombo Serra, Davide Evangelista, Pengpeng Luo,\n  Elena Morotti, Giovanni Valbusa","authorsParsed":[["Bianchi","Davide",""],["Serra","Sonia Colombo",""],["Evangelista","Davide",""],["Luo","Pengpeng",""],["Morotti","Elena",""],["Valbusa","Giovanni",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 09:16:54 GMT"}],"updateDate":"2024-07-16","timestamp":1721035014000,"abstract":"  The adoption of contrast agents in medical imaging protocols is crucial for\naccurate and timely diagnosis. While highly effective and characterized by an\nexcellent safety profile, the use of contrast agents has its limitation,\nincluding rare risk of allergic reactions, potential environmental impact and\neconomic burdens on patients and healthcare systems. In this work, we address\nthe contrast agent reduction (CAR) problem, which involves reducing the\nadministered dosage of contrast agent while preserving the visual enhancement.\nThe current literature on the CAR task is based on deep learning techniques\nwithin a fully image processing framework. These techniques digitally simulate\nhigh-dose images from images acquired with a low dose of contrast agent. We\ninvestigate the feasibility of a ``learned inverse problem'' (LIP) approach, as\nopposed to the end-to-end paradigm in the state-of-the-art literature.\n  Specifically, we learn the image-to-image operator that maps high-dose images\nto their corresponding low-dose counterparts, and we frame the CAR task as an\ninverse problem. We then solve this problem through a regularized optimization\nreformulation. Regularization methods are well-established mathematical\ntechniques that offer robustness and explainability. Our approach combines\nthese rigorous techniques with cutting-edge deep learning tools. Numerical\nexperiments performed on pre-clinical medical images confirm the effectiveness\nof this strategy, showing improved stability and accuracy in the simulated\nhigh-dose images.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Numerical Analysis","Electrical Engineering and Systems Science/Image and Video Processing","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"DUl7Tv0DdARi7BPecMWn8eLVztmNdAqLknlq3a7coI8","pdfSize":"4126457"}
