{"id":"2407.15728","title":"SAM2CLIP2SAM: Vision Language Model for Segmentation of 3D CT Scans for\n  Covid-19 Detection","authors":"Dimitrios Kollias and Anastasios Arsenos and James Wingate and\n  Stefanos Kollias","authorsParsed":[["Kollias","Dimitrios",""],["Arsenos","Anastasios",""],["Wingate","James",""],["Kollias","Stefanos",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:31:18 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 23:53:03 GMT"}],"updateDate":"2024-07-25","timestamp":1721662278000,"abstract":"  This paper presents a new approach for effective segmentation of images that\ncan be integrated into any model and methodology; the paradigm that we choose\nis classification of medical images (3-D chest CT scans) for Covid-19\ndetection. Our approach includes a combination of vision-language models that\nsegment the CT scans, which are then fed to a deep neural architecture, named\nRACNet, for Covid-19 detection. In particular, a novel framework, named\nSAM2CLIP2SAM, is introduced for segmentation that leverages the strengths of\nboth Segment Anything Model (SAM) and Contrastive Language-Image Pre-Training\n(CLIP) to accurately segment the right and left lungs in CT scans, subsequently\nfeeding these segmented outputs into RACNet for classification of COVID-19 and\nnon-COVID-19 cases. At first, SAM produces multiple part-based segmentation\nmasks for each slice in the CT scan; then CLIP selects only the masks that are\nassociated with the regions of interest (ROIs), i.e., the right and left lungs;\nfinally SAM is given these ROIs as prompts and generates the final segmentation\nmask for the lungs. Experiments are presented across two Covid-19 annotated\ndatabases which illustrate the improved performance obtained when our method\nhas been used for segmentation of the CT scans.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}