{"id":"2407.05659","title":"Isochronous mass spectrometry at the RIKEN Rare-RI Ring facility","authors":"D. Nagae, S. Omika, Y. Abe, Y. Yamaguchi, F. Suzaki, K. Wakayama, N.\n  Tadano, R. Igosawa, K. Inomata, H. Arakawa, K. Nishimuro, T. Fujii, T.\n  Mitsui, T. Yamaguchi, T. Suzuki, S. Suzuki, T. Moriguchi, M. Amano, D.\n  Kamioka, A. Ozawa, S. Naimi, Z. Ge, Y. Yanagisawa, H. Baba, S. Michimasa, S.\n  Ota, G. Lorusso, Yu. A. Litvinov, M. Wakasugi, T. Uesaka, and Y. Yano","authorsParsed":[["Nagae","D.",""],["Omika","S.",""],["Abe","Y.",""],["Yamaguchi","Y.",""],["Suzaki","F.",""],["Wakayama","K.",""],["Tadano","N.",""],["Igosawa","R.",""],["Inomata","K.",""],["Arakawa","H.",""],["Nishimuro","K.",""],["Fujii","T.",""],["Mitsui","T.",""],["Yamaguchi","T.",""],["Suzuki","T.",""],["Suzuki","S.",""],["Moriguchi","T.",""],["Amano","M.",""],["Kamioka","D.",""],["Ozawa","A.",""],["Naimi","S.",""],["Ge","Z.",""],["Yanagisawa","Y.",""],["Baba","H.",""],["Michimasa","S.",""],["Ota","S.",""],["Lorusso","G.",""],["Litvinov","Yu. A.",""],["Wakasugi","M.",""],["Uesaka","T.",""],["Yano","Y.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 06:36:36 GMT"}],"updateDate":"2024-07-09","timestamp":1720420596000,"abstract":"  A dedicated isochronous storage ring, named the Rare-RI Ring, was constructed\nat the RI Beam Factory of RIKEN, aiming at precision mass measurements of\nnuclei located in uncharted territories of the nuclear chart. The Rare-RI Ring\nemploys the isochronous mass spectrometry technique with the goal to achieve a\nrelative mass precision of $10^{-6}$ within a measurement time of less than 1\nms. The performance of the facility was demonstrated through mass measurements\nof neutron-rich nuclei with well-known masses. Velocity or magnetic rigidity is\nmeasured for every particle prior to its injection into the ring, wherein its\nrevolution time is accurately determined. The latter quantity is used to\ndetermine the mass of the particle, while the former one is needed for\nnon-isochronicity corrections. Mass precisions on the order of $10^{-5}$ were\nachieved in the first commissioning, which demonstrates that Rare-RI Ring is a\npowerful tool for mass spectrometry of short-lived nuclei.\n","subjects":["Physics/Nuclear Experiment"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}