{"id":"2407.13813","title":"A review of handcrafted and deep radiomics in neurological diseases:\n  transitioning from oncology to clinical neuroimaging","authors":"Elizaveta Lavrova, Henry C. Woodruff, Hamza Khan, Eric Salmon,\n  Philippe Lambin, Christophe Phillips","authorsParsed":[["Lavrova","Elizaveta",""],["Woodruff","Henry C.",""],["Khan","Hamza",""],["Salmon","Eric",""],["Lambin","Philippe",""],["Phillips","Christophe",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:12:07 GMT"}],"updateDate":"2024-07-22","timestamp":1721319127000,"abstract":"  Medical imaging technologies have undergone extensive development, enabling\nnon-invasive visualization of clinical information. The traditional review of\nmedical images by clinicians remains subjective, time-consuming, and prone to\nhuman error. With the recent availability of medical imaging data,\nquantification have become important goals in the field. Radiomics, a\nmethodology aimed at extracting quantitative information from imaging data, has\nemerged as a promising approach to uncover hidden biological information and\nsupport decision-making in clinical practice. This paper presents a review of\nthe radiomic pipeline from the clinical neuroimaging perspective, providing a\ndetailed overview of each step with practical advice. It discusses the\napplication of handcrafted and deep radiomics in neuroimaging, stratified by\nneurological diagnosis. Although radiomics shows great potential for increasing\ndiagnostic precision and improving treatment quality in neurology, several\nlimitations hinder its clinical implementation. Addressing these challenges\nrequires collaborative efforts, advancements in image harmonization methods,\nand the establishment of reproducible and standardized pipelines with\ntransparent reporting. By overcoming these obstacles, radiomics can\nsignificantly impact clinical neurology and enhance patient care.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/"}