{"id":"2407.04326","title":"LMSeg: A deep graph message-passing network for efficient and accurate\n  semantic segmentation of large-scale 3D landscape meshes","authors":"Zexian Huang, Kourosh Khoshelham, Gunditj Mirring Traditional Owners\n  Corporation and Martin Tomko","authorsParsed":[["Huang","Zexian",""],["Khoshelham","Kourosh",""],["Corporation","Gunditj Mirring Traditional Owners",""],["Tomko","Martin",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 07:55:06 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 05:52:25 GMT"}],"updateDate":"2024-07-11","timestamp":1720166106000,"abstract":"  Semantic segmentation of large-scale 3D landscape meshes is pivotal for\nvarious geospatial applications, including spatial analysis, automatic mapping\nand localization of target objects, and urban planning and development. This\nrequires an efficient and accurate 3D perception system to understand and\nanalyze real-world environments. However, traditional mesh segmentation methods\nface challenges in accurately segmenting small objects and maintaining\ncomputational efficiency due to the complexity and large size of 3D landscape\nmesh datasets. This paper presents an end-to-end deep graph message-passing\nnetwork, LMSeg, designed to efficiently and accurately perform semantic\nsegmentation on large-scale 3D landscape meshes. The proposed approach takes\nthe barycentric dual graph of meshes as inputs and applies deep message-passing\nneural networks to hierarchically capture the geometric and spatial features\nfrom the barycentric graph structures and learn intricate semantic information\nfrom textured meshes. The hierarchical and local pooling of the barycentric\ngraph, along with the effective geometry aggregation modules of LMSeg, enable\nfast inference and accurate segmentation of small-sized and irregular mesh\nobjects in various complex landscapes. Extensive experiments on two benchmark\ndatasets (natural and urban landscapes) demonstrate that LMSeg significantly\noutperforms existing learning-based segmentation methods in terms of object\nsegmentation accuracy and computational efficiency. Furthermore, our method\nexhibits strong generalization capabilities across diverse landscapes and\ndemonstrates robust resilience against varying mesh densities and landscape\ntopologies.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}