{"id":"2407.19316","title":"AResNet-ViT: A Hybrid CNN-Transformer Network for Benign and Malignant\n  Breast Nodule Classification in Ultrasound Images","authors":"Xin Zhao, Qianqian Zhu, Jialing Wu","authorsParsed":[["Zhao","Xin",""],["Zhu","Qianqian",""],["Wu","Jialing",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 18:18:45 GMT"}],"updateDate":"2024-07-30","timestamp":1722104325000,"abstract":"  To address the challenges of similarity between lesions and surrounding\ntissues, overlapping appearances of partially benign and malignant nodules, and\ndifficulty in classification, a deep learning network that integrates CNN and\nTransformer is proposed for the classification of benign and malignant breast\nlesions in ultrasound images. This network adopts a dual-branch architecture\nfor local-global feature extraction, making full use of the advantages of CNN\nin extracting local features and the ability of ViT to extract global features\nto enhance the network's feature extraction capabilities for breast nodules.\nThe local feature extraction branch employs a residual network with multiple\nattention-guided modules, which can effectively capture the local details and\ntexture features of breast nodules, enhance sensitivity to subtle changes\nwithin the nodules, and thus can aid in accurate classification of their benign\nand malignancy. The global feature extraction branch utilizes the multi-head\nself-attention ViT network, which can capture the overall shape, boundary, and\nrelationship with surrounding tissues, and thereby enhancing the understanding\nand modeling of both nodule and global image features. Experimental results on\na public ultrasound breast nodule data set show that the proposed method is\nbetter than other comparison networks, This indicates that the fusion of CNN\nand Transformer networks can effectively improve the performance of the\nclassification model and provide a powerful solution for the benign-malignant\nclassification of ultrasound breast.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}