{"id":"2407.10822","title":"Quantum Advancements in Neutron Scattering Reshape Spintronic Devices","authors":"M. E. Henderson, D. G. Cory, D. Sarenac and D. A. Pushin","authorsParsed":[["Henderson","M. E.",""],["Cory","D. G.",""],["Sarenac","D.",""],["Pushin","D. A.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 15:36:03 GMT"}],"updateDate":"2024-07-16","timestamp":1721057763000,"abstract":"  Topological magnetism has sparked an unprecedented age in quantum\ntechnologies. Marked by twisted spin structures with exotic dynamical modes,\ntopological magnets have motivated a new generation of spintronic devices which\ntranscend the limits of conventional semiconductor-based electronics. While\nexisting material probes have biased studies and device conceptualizations for\nthin samples in two dimensions, advancements in three-dimensional probing\ntechniques using beams of neutrons, are transforming our understanding of\ntopological and emergent physics to reimagine spintronic devices. Here, we\nreview recent neutron scattering breakthroughs which harness quantum degrees of\nfreedom to enable three-dimensional topological investigations of quantum\nmaterials. We discuss applications of structured and tomographic neutron\nscattering techniques to topological magnets, with particular emphasis on\nmagnetic skyrmion systems and their inspired three-dimensional logic device\ninfrastructures through novel multi-bit encoding and control schemes.\nSANS-based dynamic visualizations and coherent manipulations of\nthree-dimensional topological qubits are proposed using electric field controls\nof depth-dependant helicities and spin-orbit tuning of the neutron beam.\nTogether, these investigations uncover a new world of three-dimensional\ntopological physics which enhances spintronic devices through a novel set of\nstructures, dynamics, and controls, unique to three-dimensional systems.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Other Condensed Matter","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"I_MEGANMfJMSY3MvwQgeKQYixjeU0Lq6hBWEeyCb_ro","pdfSize":"3622370","objectId":"0x099ca120dd22b9b429c01763244112e5892909adc9c3a24f763cfd4dca430977","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
