{"id":"2407.07953","title":"Dynamic phase transition into a mixed-CDW state in 1$T$-TaS$_2$ via a\n  thermal quench","authors":"A. de la Torre, Q. Wang, B. Campbell, J. V. Riffle, D. Balasundaram,\n  P.M. Vora, J.P.C. Ruff, S. M. Hollen, and K. W. Plumb","authorsParsed":[["de la Torre","A.",""],["Wang","Q.",""],["Campbell","B.",""],["Riffle","J. V.",""],["Balasundaram","D.",""],["Vora","P. M.",""],["Ruff","J. P. C.",""],["Hollen","S. M.",""],["Plumb","K. W.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:00:09 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 14:57:30 GMT"}],"updateDate":"2024-07-15","timestamp":1720634409000,"abstract":"  Ultrafast light-matter interaction has emerged as a new mechanism to exert\ncontrol over the macroscopic properties of quantum materials toward novel\nfunctionality. To date, technological applications of these non-thermal phases\nare limited by their ultrashort lifetimes and low-ordering temperatures. Among\nthe most studied photoinduced metastable phases for their technological promise\nis the hidden metallic charge density wave (H-CDW) in the model correlated CDW\ncompound 1$T$-TaS$_2$. Despite active study and engineering, the nature of the\nphotoinduced H-CDW remains the subject of debate and is only accessible at\ncryogenic temperatures. Here, we stabilize the H-CDW phase at thermal\nequilibrium up to near-room temperature by accessing an intermediate mixed CDW\norder regime via thermal quenching. Using x-ray high dynamic range reciprocal\nspace mapping (HDRM) and scanning tunneling spectroscopy (STS), we reveal the\ncoexistence of commensurate (C) CDW and H-CDW domains below 180 K during\ncooling and below 210 K during warming. Our findings show that each order\nparameter breaks basal plane mirror symmetry with different chiral orientations\nand induces out-of-plane unit cell tripling in the H-CDW phase. Despite\nmetallic domain walls and a finite density of states at zero bias observed via\nSTS, bulk resistance remains insulating due to CDW stacking disorder. This\nstudy establishes the H-CDW as a thermally stable phase and introduces a new\nmechanism for switchable metallic behavior in thin flakes of 1$T$-TaS$_2$ and\nsimilar materials with competing order phases.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4Q8Fzo3uA2ejPebWc7iGDzHIq1Qte2i0S170d3U8mhE","pdfSize":"12675027"}
