{"id":"2407.00073","title":"Provably Secure Non-interactive Key Exchange Protocol for Group-Oriented\n  Applications in Scenarios with Low-Quality Networks","authors":"Rui Zhang and Lei Zhang","authorsParsed":[["Zhang","Rui",""],["Zhang","Lei",""]],"versions":[{"version":"v1","created":"Fri, 21 Jun 2024 09:49:29 GMT"},{"version":"v2","created":"Sat, 13 Jul 2024 07:08:11 GMT"}],"updateDate":"2024-07-16","timestamp":1718963369000,"abstract":"  Non-interactive key exchange (NIKE) enables two or multiple parties (just\nknowing the public system parameters and each other's public key) to derive a\n(group) session key without the need for interaction. Recently, NIKE in\nmulti-party settings has been attached importance. However, we note that most\nexisting multi-party NIKE protocols, underlying costly cryptographic techniques\n(i.e., multilinear maps and indistinguishability obfuscation), lead to high\ncomputational costs once employed in practice. Therefore, it is a challenging\ntask to achieve multi-party NIKE protocols by using more practical\ncryptographic primitives. In this paper, we propose a secure and efficient NIKE\nprotocol for secure communications in dynamic groups, whose construction only\nbases on bilinear maps. This protocol allows multiple parties to negotiate\nasymmetric group keys (a public group encryption key and each party's\ndecryption key) without any interaction among one another. Additionally, the\nprotocol supports updating of group keys in an efficient and non-interactive\nway once any party outside a group or any group member joins or leaves the\ngroup. Further, any party called a sender (even outside a group) intending to\nconnect with some or all of group members called receivers in a group, just\nneeds to generate a ciphertext with constant size under the public group\nencryption key, and only the group member who is the real receiver can decrypt\nthe ciphertext to obtain the session key. We prove our protocol captures the\ncorrectness and indistinguishability of session key under k-Bilinear\nDiffie-Hellman exponent (k-BDHE) assumption. Efficiency evaluation shows the\nefficiency of our protocol.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}