{"id":"2407.14808","title":"Abundances of neutron-capture elements in selected solar-type stars","authors":"Valentina Sheminova, Martina Baratella and Valentina D'Orazi","authorsParsed":[["Sheminova","Valentina",""],["Baratella","Martina",""],["D'Orazi","Valentina",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 08:37:07 GMT"}],"updateDate":"2024-07-23","timestamp":1721464627000,"abstract":"  The primary objective of this study is to accurately determine the abundances\nof Cu, Sr, Y, Zr, Ba, La, and Ce in selected solar-type stars. This will allow\nus to establish observational abundance-metallicity and abundance-age relations\nand to explore the reasons for the excess of Ba compared to other s-elements in\nyounger solar-type stars. We analysed HARPS spectra of main-sequence solar-type\nFGK stars with metallicities from -0.15 to +0.35 dex and ages from 2 to 14 Gyr\nusing 1D LTE synthesis and MARCS atmospheric models. In the procedure of\nfitting synthetic to observed line profiles, the free parameters included\nabundance and microturbulent and macroturbulent velocity. The macroturbulent\nvelocity can substantially compensate for NLTE effects in the line core. We\nfind that the abundance [X/H] increases with metallicity and age. The ratio of\nthe abundances of s-process elements [s/Fe] increases with decreasing\nmetallicity and age, while the [Cu/Fe] ratio increases with both metallicity\nand age. These observed trends agree well with published observational data and\nwith predictions from Galactic chemical evolution models. A small [Ba/Fe]\nenhancement of 0.08 +/- 0.08 dex has been detected in seven younger stars with\nan average age of 2.8 +/- 0.6 Gyr. Compared to the abundances of other\ns-process elements, [Ba/Fe] is 0.07 and 0.08 dex higher than La and Ce on\naverage, respectively. Furthermore, we find that the [Ba/Fe] ratio increases\nwith increasing chromospheric activity. The average [Ba/Fe] for the three most\nactive stars is 0.15 +/- 0.10 dex higher than that of the other stars.\nChromospheric activity can significantly alter the physical conditions in the\nformation layers of the Ba lines. Our primary conclusion is that to account for\nthe observed excess of [Ba/Fe] abundance in younger stars, it is essential to\nuse more complex atmospheric models that incorporate magnetic structures.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}