{"id":"2407.02511","title":"LLM-A*: Large Language Model Enhanced Incremental Heuristic Search on\n  Path Planning","authors":"Silin Meng, Yiwei Wang, Cheng-Fu Yang, Nanyun Peng, Kai-Wei Chang","authorsParsed":[["Meng","Silin",""],["Wang","Yiwei",""],["Yang","Cheng-Fu",""],["Peng","Nanyun",""],["Chang","Kai-Wei",""]],"versions":[{"version":"v1","created":"Thu, 20 Jun 2024 01:24:30 GMT"}],"updateDate":"2024-07-04","timestamp":1718846670000,"abstract":"  Path planning is a fundamental scientific problem in robotics and autonomous\nnavigation, requiring the derivation of efficient routes from starting to\ndestination points while avoiding obstacles. Traditional algorithms like A* and\nits variants are capable of ensuring path validity but suffer from significant\ncomputational and memory inefficiencies as the state space grows. Conversely,\nlarge language models (LLMs) excel in broader environmental analysis through\ncontextual understanding, providing global insights into environments. However,\nthey fall short in detailed spatial and temporal reasoning, often leading to\ninvalid or inefficient routes. In this work, we propose LLM-A*, an new LLM\nbased route planning method that synergistically combines the precise\npathfinding capabilities of A* with the global reasoning capability of LLMs.\nThis hybrid approach aims to enhance pathfinding efficiency in terms of time\nand space complexity while maintaining the integrity of path validity,\nespecially in large-scale scenarios. By integrating the strengths of both\nmethodologies, LLM-A* addresses the computational and memory limitations of\nconventional algorithms without compromising on the validity required for\neffective pathfinding.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"z-GvMNqIufW9mVSHp1bBnMbYpY0wWsul0lOPmcDC4TE","pdfSize":"556866"}
