{"id":"2407.13391","title":"Double interdiction problem on trees on the sum of root-leaf distances\n  by upgrading edges","authors":"Xiao Li, Xiucui Guan, Junhua Jia, Panos M. Pardalos","authorsParsed":[["Li","Xiao",""],["Guan","Xiucui",""],["Jia","Junhua",""],["Pardalos","Panos M.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 10:58:48 GMT"}],"updateDate":"2024-07-19","timestamp":1721300328000,"abstract":"  The double interdiction problem on trees (DIT) for the sum of root-leaf\ndistances (SRD) has significant implications in diverse areas such as\ntransportation networks, military strategies, and counter-terrorism efforts. It\naims to maximize the SRD by upgrading edge weights subject to two constraints.\nOne gives an upper bound for the cost of upgrades under certain norm and the\nother specifies a lower bound for the shortest root-leaf distance (StRD). We\nutilize both weighted $l_\\infty$ norm and Hamming distance to measure the\nupgrade cost and denote the corresponding (DIT) problem by (DIT$_{H\\infty}$)\nand its minimum cost problem by (MCDIT$_{H\\infty}$). We establish the\n$\\mathcal{NP}$-hardness of problem (DIT$_{H\\infty}$) by building a reduction\nfrom the 0-1 knapsack problem. We solve the problem (DIT$_{H\\infty}$) by two\nscenarios based on the number $N$ of upgrade edges. When $N=1$, a greedy\nalgorithm with $O(n)$ complexity is proposed. For the general case, an exact\ndynamic programming algorithm within a pseudo-polynomial time is proposed,\nwhich is established on a structure of left subtrees by maximizing a convex\ncombination of the StRD and SRD. Furthermore, we confirm the\n$\\mathcal{NP}$-hardness of problem (MCDIT$_{H\\infty}$) by reducing from the 0-1\nknapsack problem. To tackle problem (MCDIT$_{H\\infty}$), a binary search\nalgorithm with pseudo-polynomial time complexity is outlined, which iteratively\nsolves problem (DIT$_{H\\infty}$). We culminate our study with numerical\nexperiments, showcasing effectiveness of the algorithm.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}