{"id":"2407.17776","title":"Entangling power, gate typicality and Measurement-induced Phase\n  Transitions","authors":"Sourav Manna, Vaibhav Madhok, Arul Lakshminarayan","authorsParsed":[["Manna","Sourav",""],["Madhok","Vaibhav",""],["Lakshminarayan","Arul",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 05:10:04 GMT"}],"updateDate":"2024-07-26","timestamp":1721884204000,"abstract":"  When subject to a non-local unitary evolution, qubits in a quantum circuit\nbecome increasingly entangled. Conversely, measurements applied to individual\nqubits lead to their disentanglement from the collective system. The extent of\nentanglement reduction depends on the frequency of local projective\nmeasurements. A delicate balance emerges between unitary evolution, which\nenhances entanglement, and measurements which diminish it. In the thermodynamic\nlimit, there is a phase transition from volume law entanglement to area law\nentanglement at a critical value of measurement frequency. This phenomenon,\noccurring in hybrid quantum circuits with both unitary gates and measurements,\nis termed as measurement-induced phase transition (MIPT). We study the behavior\nof MIPT in circuits comprising of two qubit unitary gates parameterized by\nCartan decomposition. We show that the entangling power and gate typicality of\nthe two-qubit local unitaries employed in the circuit can be used to explain\nthe behavior of global bipartite entanglement the circuit can sustain. When the\ntwo qubit gate throughout the circuit is the identity and measurements are the\nsole driver of the entanglement behavior, we obtain analytical estimate for the\nentanglement entropy that shows remarkable agreement with numerical\nsimulations. We also find that the entangling power and gate typicality enable\nthe classification of the two-qubit unitaries by different universality classes\nof phase transitions that can occur in the hybrid circuit. For all unitaries in\na particular universality class, the transition from volume to area law of\nentanglement occurs with same exponent that characterizes the phase transition.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Statistical Mechanics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}