{"id":"2407.12472","title":"Energy-Aware UAV-Enabled Target Tracking: Online Optimization with\n  Location Constraints","authors":"Yifan Jiang, Qingqing Wu, Wen Chen, Hongxun Hui","authorsParsed":[["Jiang","Yifan",""],["Wu","Qingqing",""],["Chen","Wen",""],["Hui","Hongxun",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 10:50:40 GMT"}],"updateDate":"2024-07-18","timestamp":1721213440000,"abstract":"  For unmanned aerial vehicle (UAV) trajectory design, the total propulsion\nenergy consumption and initial-final location constraints are practical factors\nto consider. However, unlike traditional offline designs, these two constraints\nare non-trivial to concurrently satisfy in online UAV trajectory designs for\nreal-time target tracking, due to the undetermined information. To address this\nissue, we propose a novel online UAV trajectory optimization approach for the\nweighted sum-predicted posterior Cram\\'er-Rao bound (PCRB) minimization, which\nguarantees the feasibility of satisfying the two mentioned constraints.\nSpecifically, our approach designs the UAV trajectory by solving two\nsubproblems: the candidate trajectory optimization problem and the energy-aware\nbackup trajectory optimization problem. Then, an efficient solution to the\ncandidate trajectory optimization problem is proposed based on Dinkelbach's\ntransform and the Lasserre hierarchy, which achieves the global optimal\nsolution under a given sufficient condition. The energy-aware backup trajectory\noptimization problem is solved by the successive convex approximation method.\nNumerical results show that our proposed UAV trajectory optimization approach\nsignificantly outperforms the benchmark regarding sensing performance and\nenergy utilization flexibility.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Information Theory","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}