{"id":"2407.20983","title":"Securing Proof of Stake Blockchains: Leveraging Multi-Agent\n  Reinforcement Learning for Detecting and Mitigating Malicious Nodes","authors":"Faisal Haque Bappy, Kamrul Hasan, Md Sajidul Islam Sajid, Mir Mehedi\n  Ahsan Pritom, and Tariqul Islam","authorsParsed":[["Bappy","Faisal Haque",""],["Hasan","Kamrul",""],["Sajid","Md Sajidul Islam",""],["Pritom","Mir Mehedi Ahsan",""],["Islam","Tariqul",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 17:18:03 GMT"}],"updateDate":"2024-07-31","timestamp":1722359883000,"abstract":"  Proof of Stake (PoS) blockchains offer promising alternatives to traditional\nProof of Work (PoW) systems, providing scalability and energy efficiency.\nHowever, blockchains operate in a decentralized manner and the network is\ncomposed of diverse users. This openness creates the potential for malicious\nnodes to disrupt the network in various ways. Therefore, it is crucial to embed\na mechanism within the blockchain network to constantly monitor, identify, and\neliminate these malicious nodes without involving any central authority. In\nthis paper, we propose MRL-PoS+, a novel consensus algorithm to enhance the\nsecurity of PoS blockchains by leveraging Multi-agent Reinforcement Learning\n(MRL) techniques. Our proposed consensus algorithm introduces a penalty-reward\nscheme for detecting and eliminating malicious nodes. This approach involves\nthe detection of behaviors that can lead to potential attacks in a blockchain\nnetwork and hence penalizes the malicious nodes, restricting them from\nperforming certain actions. Our developed Proof of Concept demonstrates\neffectiveness in eliminating malicious nodes for six types of major attacks.\nExperimental results demonstrate that MRL-PoS+ significantly improves the\nattack resilience of PoS blockchains compared to the traditional schemes\nwithout incurring additional computation overhead.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}