{"id":"2407.15267","title":"A Learning-Based Attack Framework to Break SOTA Poisoning Defenses in\n  Federated Learning","authors":"Yuxin Yang (1 and 2), Qiang Li (1), Chenfei Nie (1), Yuan Hong (3),\n  Meng Pang (4), Binghui Wang (2) ((1) College of Computer Science and\n  Technology, Jilin University, (2) Illinois Institute of Technology, (3)\n  University of Connecticut, (4) Nanchang University)","authorsParsed":[["Yang","Yuxin","","1 and 2"],["Li","Qiang",""],["Nie","Chenfei",""],["Hong","Yuan",""],["Pang","Meng",""],["Wang","Binghui",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 21:02:11 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 02:14:01 GMT"}],"updateDate":"2024-07-26","timestamp":1721595731000,"abstract":"  Federated Learning (FL) is a novel client-server distributed learning\nframework that can protect data privacy. However, recent works show that FL is\nvulnerable to poisoning attacks. Many defenses with robust aggregators (AGRs)\nare proposed to mitigate the issue, but they are all broken by advanced\nattacks. Very recently, some renewed robust AGRs are designed, typically with\nnovel clipping or/and filtering strate-gies, and they show promising defense\nperformance against the advanced poisoning attacks. In this paper, we show that\nthese novel robust AGRs are also vulnerable to carefully designed poisoning\nattacks. Specifically, we observe that breaking these robust AGRs reduces to\nbypassing the clipping or/and filtering of malicious clients, and propose an\noptimization-based attack framework to leverage this observation. Under the\nframework, we then design the customized attack against each robust AGR.\nExtensive experiments on multiple datasets and threat models verify our\nproposed optimization-based attack can break the SOTA AGRs. We hence call for\nnovel defenses against poisoning attacks to FL. Code is available at:\nhttps://github.com/Yuxin104/ BreakSTOAPoisoningDefenses.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}