{"id":"2407.13060","title":"Axions in Andromeda: Searching for Minicluster -- Neutron Star\n  Encounters with the Green Bank Telescope","authors":"Liam Walters, Jordan Shroyer, Madeleine Edenton, Prakamya Agrawal,\n  Bradley Johnson, Bradley J. Kavanagh, David J. E. Marsh, and Luca Visinelli","authorsParsed":[["Walters","Liam",""],["Shroyer","Jordan",""],["Edenton","Madeleine",""],["Agrawal","Prakamya",""],["Johnson","Bradley",""],["Kavanagh","Bradley J.",""],["Marsh","David J. E.",""],["Visinelli","Luca",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 00:10:57 GMT"}],"updateDate":"2024-07-19","timestamp":1721261457000,"abstract":"  The QCD axion and axion-like particles are compelling candidates for galactic\ndark matter. Theoretically, axions can convert into photons in the presence of\na strong external magnetic field, which means it is possible to search for them\nexperimentally. One approach is to use radio telescopes with high-resolution\nspectrometers to look for axion-photon conversion in the magnetospheres of\nneutron stars. In this paper, we describe the results obtained using a novel\napproach where we used the Green Bank Telescope (GBT) to search for radio\ntransients produced by collisions between neutron stars and dark matter clumps\nknown as axion miniclusters. We used the VErsatile GBT Astronomical\nSpectrometer (VEGAS) and the X-band receiver (8 to 10 GHz) to observe the core\nof Andromeda. Our measurements are sensitive to axions with masses between 33\nand 42 $\\mu$eV with $\\Delta$$m_a$ = 3.8$\\times10^{-4}$ $\\mu$eV. This paper\ngives a description of the search method we developed, including observation\nand analysis strategies. Given our analysis algorithm choices and the\ninstrument sensitivity ($\\sim$2 mJy in each spectral channel), we did not find\nany candidate signals greater than 5$\\sigma$. We are currently implementing\nthis search method in other spectral bands.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RQ_BUM15CbG3kJEt-dWInufpse8FUedz6Mh9w5FdLbA","pdfSize":"9373324"}
