{"id":"2407.09738","title":"Sparse Asymptotic PCA: Identifying Sparse Latent Factors Across Time\n  Horizon","authors":"Zhaoxing Gao","authorsParsed":[["Gao","Zhaoxing",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 01:32:37 GMT"}],"updateDate":"2024-07-16","timestamp":1720834357000,"abstract":"  This paper proposes a novel method for sparse latent factor modeling using a\nnew sparse asymptotic Principal Component Analysis (APCA). This approach\nanalyzes the co-movements of large-dimensional panel data systems over time\nhorizons within a general approximate factor model framework. Unlike existing\nsparse factor modeling approaches based on sparse PCA, which assume sparse\nloading matrices, our sparse APCA assumes that factor processes are sparse over\nthe time horizon, while the corresponding loading matrices are not necessarily\nsparse. This development is motivated by the observation that the assumption of\nsparse loadings may not be appropriate for financial returns, where exposure to\nmarket factors is generally universal and non-sparse. We propose a truncated\npower method to estimate the first sparse factor process and a sequential\ndeflation method for multi-factor cases. Additionally, we develop a data-driven\napproach to identify the sparsity of risk factors over the time horizon using a\nnovel cross-sectional cross-validation method. Theoretically, we establish that\nour estimators are consistent under mild conditions. Monte Carlo simulations\ndemonstrate that the proposed method performs well in finite samples.\nEmpirically, we analyze daily stock returns for a balanced panel of S&P 500\nstocks from January 2004 to December 2016. Through textual analysis, we examine\nspecific events associated with the identified sparse factors that\nsystematically influence the stock market. Our approach offers a new pathway\nfor economists to study and understand the systematic risks of economic and\nfinancial systems over time.\n","subjects":["Statistics/Methodology","Economics/Econometrics","Quantitative Finance/Statistical Finance","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}