{"id":"2407.04360","title":"Shape Prior Segmentation Guided by Harmonic Beltrami Signature","authors":"Chenran Lin, Lok Ming Lui","authorsParsed":[["Lin","Chenran",""],["Lui","Lok Ming",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 08:59:34 GMT"}],"updateDate":"2024-07-08","timestamp":1720169974000,"abstract":"  This paper presents a novel shape prior segmentation method guided by the\nHarmonic Beltrami Signature (HBS). The HBS is a shape representation fully\ncapturing 2D simply connected shapes, exhibiting resilience against\nperturbations and invariance to translation, rotation, and scaling. The\nproposed method integrates the HBS within a quasi-conformal topology preserving\nsegmentation framework, leveraging shape prior knowledge to significantly\nenhance segmentation performance, especially for low-quality or occluded\nimages. The key innovation lies in the bifurcation of the optimization process\ninto two iterative stages: 1) The computation of a quasi-conformal deformation\nmap, which transforms the unit disk into the targeted segmentation area, driven\nby image data and other regularization terms; 2) The subsequent refinement of\nthis map is contingent upon minimizing the $L_2$ distance between its Beltrami\ncoefficient and the reference HBS. This shape-constrained refinement ensures\nthat the segmentation adheres to the reference shape(s) by exploiting the\ninherent invariance, robustness, and discerning shape discriminative\ncapabilities afforded by the HBS. Extensive experiments on synthetic and\nreal-world images validate the method's ability to improve segmentation\naccuracy over baselines, eliminate preprocessing requirements, resist noise\ncorruption, and flexibly acquire and apply shape priors. Overall, the HBS\nsegmentation framework offers an efficient strategy to robustly incorporate the\nshape prior knowledge, thereby advancing critical low-level vision tasks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Mathematics/Complex Variables"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}