{"id":"2407.11960","title":"Quantum and Classical Dynamics with Random Permutation Circuits","authors":"Bruno Bertini, Katja Klobas, Pavel Kos, Daniel Malz","authorsParsed":[["Bertini","Bruno",""],["Klobas","Katja",""],["Kos","Pavel",""],["Malz","Daniel",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 17:58:03 GMT"}],"updateDate":"2024-07-17","timestamp":1721152683000,"abstract":"  Understanding thermalisation in quantum many-body systems is among the most\nenduring problems in modern physics. A particularly interesting question\nconcerns the role played by quantum mechanics in this process, i.e. whether\nthermalisation in quantum many-body systems is fundamentally different from\nthat in classical many-body systems and, if so, which of its features are\ngenuinely quantum. Here we study this question in minimally structured\nmany-body systems which are only constrained to have local interactions, i.e.\nlocal random circuits. We introduce a class of random permutation circuits\n(RPCs), where the gates locally permute basis states modelling generic\nmicroscopic classical dynamics, and compare them to random unitary circuits\n(RUCs), a standard toy model for generic quantum dynamics. We show that, like\nRUCs, RPCs permit the analytical computation of several key quantities such as\nout-of-time order correlators (OTOCs), or entanglement entropies. RPCs can be\ninterpreted both as quantum or classical dynamics, which we use to find\nsimilarities and differences between the two. Performing the average over all\nrandom circuits, we discover a series of exact relations, connecting quantities\nin RUC and (quantum) RPCs. In the classical setting, we obtain similar exact\nresults relating (quantum) purity to (classical) growth of mutual information\nand (quantum) OTOCs to (classical) decorrelators. Our results indicate that\ndespite of the fundamental differences between quantum and classical systems,\ntheir dynamics exhibits qualitatively similar behaviours.\n","subjects":["Condensed Matter/Statistical Mechanics","Physics/High Energy Physics - Theory","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Nonlinear Sciences/Cellular Automata and Lattice Gases","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}