{"id":"2407.03571","title":"A Fully Parameter-Free Second-Order Algorithm for Convex-Concave Minimax\n  Problems with Optimal Iteration Complexity","authors":"Junlin Wang, Junnan Yang, Zi Xu","authorsParsed":[["Wang","Junlin",""],["Yang","Junnan",""],["Xu","Zi",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 01:46:07 GMT"}],"updateDate":"2024-07-08","timestamp":1720057567000,"abstract":"  In this paper, we study second-order algorithms for the convex-concave\nminimax problem, which has attracted much attention in many fields such as\nmachine learning in recent years. We propose a Lipschitz-free cubic\nregularization (LF-CR) algorithm for solving the convex-concave minimax\noptimization problem without knowing the Lipschitz constant. It can be shown\nthat the iteration complexity of the LF-CR algorithm to obtain an\n$\\epsilon$-optimal solution with respect to the restricted primal-dual gap is\nupper bounded by\n$\\mathcal{O}(\\frac{\\rho\\|z^0-z^*\\|^3}{\\epsilon})^{\\frac{2}{3}}$, where\n$z^0=(x^0,y^0)$ is a pair of initial points, $z^*=(x^*,y^*)$ is a pair of\noptimal solutions, and $\\rho$ is the Lipschitz constant. We further propose a\nfully parameter-free cubic regularization (FF-CR) algorithm that does not\nrequire any parameters of the problem, including the Lipschitz constant and the\nupper bound of the distance from the initial point to the optimal solution. We\nalso prove that the iteration complexity of the FF-CR algorithm to obtain an\n$\\epsilon$-optimal solution with respect to the gradient norm is upper bounded\nby $\\mathcal{O}(\\frac{\\rho\\|z^0-z^*\\|^2}{\\epsilon})^{\\frac{2}{3}}$. Numerical\nexperiments show the efficiency of both algorithms. To the best of our\nknowledge, the proposed FF-CR algorithm is the first completely parameter-free\nsecond-order algorithm for solving convex-concave minimax optimization\nproblems, and its iteration complexity is consistent with the optimal iteration\ncomplexity lower bound of existing second-order algorithms with parameters for\nsolving convex-concave minimax problems.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}