{"id":"2407.18309","title":"Adaptive Terminal Sliding Mode Control Using Deep Reinforcement Learning\n  for Zero-Force Control of Exoskeleton Robot Systems","authors":"Morteza Mirzaee, Reza Kazemi","authorsParsed":[["Mirzaee","Morteza",""],["Kazemi","Reza",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 18:01:41 GMT"}],"updateDate":"2024-07-29","timestamp":1721930501000,"abstract":"  This paper introduces a novel zero-force control method for upper-limb\nexoskeleton robots, which are used in a variety of applications including\nrehabilitation, assistance, and human physical capability enhancement. The\nproposed control method employs an Adaptive Integral Terminal Sliding Mode\n(AITSM) controller, combined with an exponential reaching law and Proximal\nPolicy Optimization (PPO), a type of Deep Reinforcement Learning (DRL). The PPO\nsystem incorporates an attention mechanism and Long Short-Term Memory (LSTM)\nneural networks, enabling the controller to selectively focus on relevant\nsystem states, adapt to changing behavior, and capture long-term dependencies.\nThis controller is designed to manage a 5-DOF upper-limb exoskeleton robot with\nzero force, even amidst system uncertainties. The controller uses an integral\nterminal sliding surface to ensure finite-time convergence to the desired\nstate, a crucial feature for applications requiring quick responses. It also\nincludes an exponential switching control term to reduce chattering and improve\nsystem accuracy. The controller's adaptability, facilitated by the PPO system,\nallows real-time parameter adjustments based on system feedback, making the\ncontroller robust and capable of dealing with uncertainties and disturbances\nthat could affect the performance of the exoskeleton. The proposed control\nmethod's effectiveness and superiority are confirmed through numerical\nsimulations and comparisons with existing control methods.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}