{"id":"2407.09707","title":"Coherent J/$\\psi$ photoproduction and polarization in peripheral Pb-Pb\n  collisions with ALICE","authors":"L. Massacrier (for the ALICE Collaboration)","authorsParsed":[["Massacrier","L.","","for the ALICE Collaboration"]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 22:18:13 GMT"}],"updateDate":"2024-07-16","timestamp":1720822693000,"abstract":"  Photonuclear reactions are induced by the strong electromagnetic field\ngenerated by ultrarelativistic heavy ions. These processes have been\nextensively studied in ultraperipheral collisions. In recent years, the\nobservation of coherent J/$\\psi$ photoproduction has been claimed in\nnucleus-nucleus (A-A) collisions with nuclear overlap, based on the measurement\nof an excess in the very low transverse momentum ($p_{\\rm T}$) J/$\\psi$ yield.\nSuch quarkonium measurements can help constraining the nuclear gluon\ndistribution at low Bjorken-$x$ and can shed light on the theory behind photon\ninduced reactions in A-A collisions with nuclear overlap. In order to confirm\nthe photoproduction origin of the very low-$p_{\\rm T}$ J/$\\psi$ yield excess,\npolarization measurement is a golden observable. It is indeed expected that the\nproduced quarkonium would keep the polarization of the incoming photon due to\n$s$-channel helicity conservation. ALICE can measure inclusive and exclusive\nquarkonium production down to zero transverse momentum, at forward rapidity\n(2.5 $< y <$ 4) and midrapidity ($|y| <$ 0.9). In this contribution, we will\nreport on the new preliminary measurement of the $y$-differential cross section\nand the first polarization analysis at LHC of coherently photoproduced J/$\\psi$\nin peripheral Pb-Pb collisions. Both measurements are conducted at forward\nrapidity in the dimuon decay channel.\n","subjects":["Physics/Nuclear Experiment","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eiBheNvuuCe21xpLRgwylH54APTdR0TwHinfh13_PBM","pdfSize":"609551"}
