{"id":"2407.01668","title":"Galaxy clustering in modified gravity from full-physics simulations. I:\n  two-point correlation functions","authors":"Michael Collier, Sownak Bose, Baojiu Li (ICC, Durham)","authorsParsed":[["Collier","Michael","","ICC, Durham"],["Bose","Sownak","","ICC, Durham"],["Li","Baojiu","","ICC, Durham"]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-03","timestamp":1719856801000,"abstract":"  We present an in-depth investigation of galaxy clustering based on a new\nsuite of realistic large-box galaxy-formation simulations in $f(R)$ gravity,\nwith a subgrid physics model that has been recalibrated to reproduce various\nobserved stellar and gas properties. We focus on the two-point correlation\nfunctions of the luminous red galaxies (LRGs) and emission line galaxies\n(ELGs), which are primary targets of ongoing and future galaxy surveys such as\nDESI. One surprising result is that, due to several nontrivial effects of\nmodified gravity on matter clustering and the galaxy-halo connection, the\nclustering signal does not depend monotonically on the fifth-force strength.\nFor LRGs this complicated behaviour poses a challenge to meaningfully\nconstraining this model. For ELGs, in contrast, this can be straightforwardly\nexplained by the time evolution of the fifth force, which means that weaker\n$f(R)$ models can display nearly the same -- up to $25\\%$ -- deviations from\n$\\Lambda$CDM as the strongest ones, albeit at lower redshifts. This implies\nthat even very weak $f(R)$ models can be strongly constrained, unlike with most\nother observations. Our results show that galaxy formation acquires a\nsignificant environment dependence in $f(R)$ gravity which, if not properly\naccounted for, may lead to biased constraints on the model. This highlights the\nessential role of hydrodynamical simulations in future tests of gravity\nexploring precision galaxy-clustering data from the likes of DESI and Euclid.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}