{"id":"2407.00355","title":"Global decomposition of networks into multiple cores formed by local\n  hubs","authors":"Wonhee Jeong, Unjong Yu, Sang Hoon Lee","authorsParsed":[["Jeong","Wonhee",""],["Yu","Unjong",""],["Lee","Sang Hoon",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 08:02:30 GMT"}],"updateDate":"2024-07-02","timestamp":1719648150000,"abstract":"  Networks are ubiquitous in various fields, representing systems where nodes\nand their interconnections constitute their intricate structures. We introduce\na network decomposition scheme to reveal multiscale core-periphery structures\nlurking inside, using the concept of locally defined nodal hub centrality and\nedge-pruning techniques built upon it. We demonstrate that the\nhub-centrality-based edge pruning reveals a series of breaking points in\nnetwork decomposition, which effectively separates a network into its backbone\nand shell structures. Our local-edge decomposition method iteratively\nidentifies and removes locally least important nodes, and uncovers an\nonion-like hierarchical structure as a result. Compared with the conventional\n$k$-core decomposition method, our method based on relative information\nresiding in local structures exhibits a clear advantage in terms of discovering\nlocally crucial substructures. Furthermore, we introduce the core-periphery\nscore to properly separate the core and periphery with our decomposition\nscheme. By extending the method combined with the network community structure,\nwe successfully detect multiple core-periphery structures by decomposition\ninside each community. Moreover, the application of our decomposition to\nsupernode networks defined from the communities reveals the intricate relation\nbetween the two representative mesoscale structures.\n","subjects":["Physics/Physics and Society","Condensed Matter/Statistical Mechanics","Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}