{"id":"2407.13047","title":"A Novel GAN Approach to Augment Limited Tabular Data for Short-Term\n  Substance Use Prediction","authors":"Nguyen Thach, Patrick Habecker, Bergen Johnston, Lillianna Cervantes,\n  Anika Eisenbraun, Alex Mason, Kimberly Tyler, Bilal Khan, Hau Chan","authorsParsed":[["Thach","Nguyen",""],["Habecker","Patrick",""],["Johnston","Bergen",""],["Cervantes","Lillianna",""],["Eisenbraun","Anika",""],["Mason","Alex",""],["Tyler","Kimberly",""],["Khan","Bilal",""],["Chan","Hau",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 23:03:24 GMT"}],"updateDate":"2024-07-19","timestamp":1721257404000,"abstract":"  Substance use is a global issue that negatively impacts millions of persons\nwho use drugs (PWUDs). In practice, identifying vulnerable PWUDs for efficient\nallocation of appropriate resources is challenging due to their complex use\npatterns (e.g., their tendency to change usage within months) and the high\nacquisition costs for collecting PWUD-focused substance use data. Thus, there\nhas been a paucity of machine learning models for accurately predicting\nshort-term substance use behaviors of PWUDs. In this paper, using longitudinal\nsurvey data of 258 PWUDs in the U.S. Great Plains collected by our team, we\ndesign a novel GAN that deals with high-dimensional low-sample-size tabular\ndata and survey skip logic to augment existing data to improve classification\nmodels' prediction on (A) whether the PWUDs would increase usage and (B) at\nwhich ordinal frequency they would use a particular drug within the next 12\nmonths. Our evaluation results show that, when trained on augmented data from\nour proposed GAN, the classification models improve their predictive\nperformance (AUROC) by up to 13.4% in Problem (A) and 15.8% in Problem (B) for\nusage of marijuana, meth, amphetamines, and cocaine, which outperform\nstate-of-the-art generative models.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}