{"id":"2407.10741","title":"Optimizing the light output of a plastic scintillator and SiPM based\n  detector through optical characterization and simulation: A case study for\n  POLAR-2","authors":"Nicolas De Angelis and Franck Cadoux and Coralie Husi and Merlin Kole\n  and S{\\l}awomir Mianowski","authorsParsed":[["De Angelis","Nicolas",""],["Cadoux","Franck",""],["Husi","Coralie",""],["Kole","Merlin",""],["Mianowski","Sławomir",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 14:09:01 GMT"}],"updateDate":"2024-07-16","timestamp":1721052541000,"abstract":"  The combination of plastic scintillators with Silicon Photo-Multipliers\n(SiPMs) is widely used for detecting radiation in high-energy astrophysics,\nparticle physics, neutrino physics, or medical physics. An example of\napplication for this kind of detectors are Compton polarimeters such as POLAR-2\nor LEAP, for which a low-Z material is needed for the Compton effect to be\ndominant down to as low energy as possible. Such detectors aim to measure low\nenergy Compton depositions which produce small amounts of optical light, and\nfor which optimizing the instrumental optical properties consequently\nimperative.\n  The light collection efficiency of such a device was studied with a focus on\nthe POLAR-2 GRB polarimeter, in which the conversion of incoming $\\gamma$-rays\ninto readable signal goes through the production and collection of optical\nlight, which was to be optimized both through measurements and simulations. The\noptical elements of the POLAR-2 polarimeter prototype module were optically\ncharacterized and an optical simulation based on Geant4 was developed to fully\nmodel its optical performances. The results from simulations were used to\noptimize the design and finally to verify its performance. The study resulted\nin a detector capable of measuring energy depositions of several keV. In\naddition an important finding of this work is the impact of the plastic\nscintillator surface roughness on the light collection. It was found that a\nplastic scintillator with a higher scintillation efficiency but made of a\nsofter material, hence with a rougher surface, was not necessarily the best\noption to optimize the light collection. Furthermore, in order to optimize the\noptical crosstalk between different channels, a production technique for very\nthin ($\\sim$150$~\\mu$m) and reusable silicone-based optical coupling pads,\nwhich can be applied for other experiments, was developed.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}