{"id":"2407.18876","title":"Fast optical control of a coherent hole spin in a microcavity","authors":"Mark Hogg, Nadia Antoniadis, Malwina Marczak, Giang Nguyen, Timon\n  Baltisberger, Alisa Javadi, Ruediger Schott, Sascha Valentin, Andreas Wieck,\n  Arne Ludwig, Richard Warburton","authorsParsed":[["Hogg","Mark",""],["Antoniadis","Nadia",""],["Marczak","Malwina",""],["Nguyen","Giang",""],["Baltisberger","Timon",""],["Javadi","Alisa",""],["Schott","Ruediger",""],["Valentin","Sascha",""],["Wieck","Andreas",""],["Ludwig","Arne",""],["Warburton","Richard",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:13:09 GMT"}],"updateDate":"2024-07-29","timestamp":1722013989000,"abstract":"  A spin-photon interface is one of the key components of a quantum network.\nPhysical platforms under investigation span the range of modern experimental\nphysics, from ultra-cold atoms and ions to a variety of solid-state systems.\nEach system has its strengths and weaknesses, typically with a trade-off\nbetween spin properties and photonic properties. Currently, the best\ndeterministic single-photon sources use a semiconductor quantum dot embedded in\nan optical microcavity. However, coherent spin control has not yet been\nintegrated with a state-of-the-art single-photon source, and the magnetic noise\nfrom host nuclear spins in the semiconductor environment has placed strong\nlimitations on the spin coherence. Here, we combine high-fidelity all-optical\nspin control with a quantum dot in an open microcavity, currently the most\nefficient single-photon source platform available. By imprinting a microwave\nsignal onto a red-detuned optical field, a Raman process, we demonstrate\ncoherent rotations of a hole spin around an arbitrary axis of the Bloch sphere,\nachieving a maximum {\\pi}-pulse fidelity of 98.6%. The cavity enhances the\nRaman process, enabling ultra-fast Rabi frequencies above 1 GHz. We use our\nflexible spin control to perform optical cooling of the nuclear spins in the\nhost material via the central hole spin, extending the hole-spin coherence time\nT2* from 28 ns to 535 ns. Hahn echo preserves the spin coherence on a timescale\nof 20 {\\mu}s, and dynamical decoupling extends the coherence close to the\nrelaxation limit. Both the spin T2* and spin rotation time are much larger than\nthe Purcell-enhanced radiative recombination time, 50 ps, enabling many\nspin-photon pairs to be created before the spin loses its coherence.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"EgmyAOoacT59W3PAkGsOdhJpK1ecZJ_DXNEPuvaA5d8","pdfSize":"6802678","objectId":"0xea14c8948b1042229b97c0cc453c3d2e1fc7ded2c643ab849e8e903f0bc67dc9","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
