{"id":"2407.17006","title":"Large fluctuations and Primordial Black Holes","authors":"Sayantan Choudhury, M. Sami","authorsParsed":[["Choudhury","Sayantan",""],["Sami","M.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 05:06:33 GMT"}],"updateDate":"2024-07-25","timestamp":1721797593000,"abstract":"  In this paper, we review in detail different mechanisms of generation of\nlarge primordial fluctuations and their implications for the production of\nprimordial black holes (PBHs) and scalar-induced secondary gravity waves\n(SIGW), with the ultimate aim of understanding the impact of loop correction on\nquantum correlations and the power spectrum. To accomplish the goal, we provide\na concise, comprehensive, but in depth review of conceptual and technical\ndetails of the standard model of the universe, namely, causal structure and\ninflation, quantization of primordial perturbations and field theoretic\ntechniques such as \"in-in\" formalism needed for the estimation of loop\ncorrection to the power spectrum. We discuss at length the severe constraints\n(no-go) on PBH production in single-field inflation imposed by appropriately\nrenormalized quantum loop corrections, computed while maintaining the validity\nof the perturbation framework and assuming sufficient inflation to address the\ncausality problem. Thereafter, we discuss in detail the efforts to circumvent\nthe no-go result in Galileon inflation, multiple sharp transition (MST)-induced\ninflation, and stochastic single field inflation using an effective field\ntheoretic (EFT) framework applicable to a variety of models. We provide a\nthorough analysis of the Dynamical Renormalization Group (DRG) resummation\napproach, adiabatic and late-time renormalization schemes, and their use in\nproducing solar and sub-solar mass PBHs. Additionally, we give a summary of how\nscalar-induced gravitational waves (SIGWs) are produced in MST setups and\nGalileon inflation.Finally, the PBH overproduction issue is thoroughly\ndiscussed.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}