{"id":"2407.16927","title":"DeepCell: A Ubiquitous Accurate Provider-side Cellular-based\n  Localization","authors":"Ahmed Shokry and Moustafa Youssef","authorsParsed":[["Shokry","Ahmed",""],["Youssef","Moustafa",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 01:28:04 GMT"}],"updateDate":"2024-07-25","timestamp":1721784484000,"abstract":"  Although outdoor localization is already available to the general public and\nbusinesses through the wide spread use of the GPS, it is not supported by\nlow-end phones, requires a direct line of sight to satellites and can drain\nphone battery quickly. The current fingerprinting solutions can provide\nhigh-accuracy localization but are based on the client side. This limits their\nubiquitous deployment and accuracy. In this paper, we introduce DeepCell: a\nprovider-side fingerprinting localization system that can provide high accuracy\nlocalization for any cell phone. To build its fingerprint, DeepCell leverages\nthe unlabeled cellular measurements recorded by the cellular provider while\nopportunistically synchronizing with selected client devices to get location\nlabels. The fingerprint is then used to train a deep neural network model that\nis harnessed for localization. To achieve this goal, DeepCell need to address a\nnumber of challenges including using unlabeled data from the provider side,\nhandling noise and sparsity, scaling the data to large areas, and finally\nproviding enough data that is required for training deep models without\noverhead. Evaluation of DeepCell in a typical realistic environment shows that\nit can achieve a consistent median accuracy of 29m. This accuracy outperforms\nthe state-of-the-art client-based cellular-based systems by more than 75.4%. In\naddition, the same accuracy is extended to low-end phones.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OxZHU6WMOXyJAUor8oAzgfiDuvRHe_KrT57MesMU9iU","pdfSize":"1631073"}
