{"id":"2407.08131","title":"Asynchronous measurement-device-independent quantum digital signatures","authors":"Jing-Wei Bian, Bing-Hong Li, Yuan-Mei Xie, Hua-Lei Yin, Zeng-Bing Chen","authorsParsed":[["Bian","Jing-Wei",""],["Li","Bing-Hong",""],["Xie","Yuan-Mei",""],["Yin","Hua-Lei",""],["Chen","Zeng-Bing",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 02:09:55 GMT"}],"updateDate":"2024-07-16","timestamp":1720663795000,"abstract":"  Quantum digital signatures (QDSs), which distribute and measure quantum\nstates by key generation protocols and then sign messages via classical data\nprocessing, are a key area of interest in quantum cryptography. However, the\npractical implementation of a QDS network has many challenges, including\ncomplex interference technical requirements, linear channel loss of quantum\nstate transmission, and potential side-channel attacks on detectors. Here, we\npropose an asynchronous measurement-device-independent (MDI) QDS protocol with\nasynchronous two-photon interference strategy and one-time universal hashing\nmethod. The two-photon interference approach protects our protocol against all\ndetector side-channel attacks and relaxes the difficulty of experiment\nimplementation, while the asynchronous strategy effectively reduces the\nequivalent channel loss to its square root. Compared to previous MDI-QDS\nschemes, our protocol shows several orders of magnitude performance\nimprovements and doubling of transmission distance when processing multi-bit\nmessages. Our findings present an efficient and practical MDI-QDS scheme,\npaving the way for large-scale data processing with non-repudiation in quantum\nnetworks.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"25BRftshUbHimpnccdbLgxKXPV_1LFfwumd3b961HEg","pdfSize":"1027664","objectId":"0x31d4c2841bb45d97a21acfa8b988cfe2f0f80b66572fef17462183e644472412","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
