{"id":"2407.02765","title":"Graphon Particle Systems, Part II: Dynamics of Distributed Stochastic\n  Continuum Optimization","authors":"Yan Chen and Tao Li","authorsParsed":[["Chen","Yan",""],["Li","Tao",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 02:47:39 GMT"}],"updateDate":"2024-07-04","timestamp":1719974859000,"abstract":"  We study the distributed optimization problem over a graphon with a continuum\nof nodes, which is regarded as the limit of the distributed networked\noptimization as the number of nodes goes to infinity. Each node has a private\nlocal cost function. The global cost function, which all nodes cooperatively\nminimize, is the integral of the local cost functions on the node set. We\npropose stochastic gradient descent and gradient tracking algorithms over the\ngraphon. We establish a general lemma for the upper bound estimation related to\na class of time-varying differential inequalities with negative linear terms,\nbased upon which, we prove that for both kinds of algorithms, the second\nmoments of the nodes' states are uniformly bounded. Especially, for the\nstochastic gradient tracking algorithm, we transform the convergence analysis\ninto the asymptotic property of coupled nonlinear differential inequalities\nwith time-varying coefficients and develop a decoupling method. For both kinds\nof algorithms, we show that by choosing the time-varying algorithm gains\nproperly, all nodes' states achieve $\\mathcal{L}^{\\infty}$-consensus for a\nconnected graphon. Furthermore, if the local cost functions are strongly\nconvex, then all nodes' states converge to the minimizer of the global cost\nfunction and the auxiliary states in the stochastic gradient tracking algorithm\nconverge to the gradient value of the global cost function at the minimizer\nuniformly in mean square.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Systems and Control","Mathematics/Optimization and Control","Mathematics/Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hrSIJ9nQopa_aA3y7nhjXzR2eWl2F4M9N_ymfkPbn6k","pdfSize":"345339"}
