{"id":"2407.19447","title":"Nudging Consent and the New Opt Out System to the Processing of Health\n  Data in England","authors":"Janos Meszaros, Chih-hsing Ho and Marcelo Corrales Compagnucci","authorsParsed":[["Meszaros","Janos",""],["Ho","Chih-hsing",""],["Compagnucci","Marcelo Corrales",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 09:49:37 GMT"}],"updateDate":"2024-07-30","timestamp":1722160177000,"abstract":"  This chapter examines the challenges of the revised opt out system and the\nsecondary use of health data in England. The analysis of this data could be\nvery valuable for science and medical treatment as well as for the discovery of\nnew drugs. For this reason, the UK government established the care.data program\nin 2013. The aim of the project was to build a central nationwide database for\nresearch and policy planning. However, the processing of personal data was\nplanned without proper public engagement. Research has suggested that IT\ncompanies, such as in the Google DeepMind deal case, had access to other kinds\nof sensitive data and failed to comply with data protection law. Since May\n2018, the government has launched the national data opt out system with the\nhope of regaining public trust. Nevertheless, there are no evidence of\nsignificant changes in the ND opt out, compared to the previous opt out system.\nNeither in the use of secondary data, nor in the choices that patients can\nmake. The only notorious difference seems to be in the way that these options\nare communicated and framed to the patients. Most importantly, according to the\nnew ND opt out, the type 1 opt out option, which is the only choice that truly\nstops data from being shared outside direct care, will be removed in 2020.\nAccording to the Behavioral Law and Economics literature (Nudge Theory),\ndefault rules, such as the revised opt out system in England, are very\npowerful, because people tend to stick to the default choices made readily\navailable to them. The crucial question analyzed in this chapter is whether it\nis desirable for the UK government to stop promoting the type 1 opt outs, and\nwhether this could be seen as a kind of hard paternalism.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}