{"id":"2407.21316","title":"Diff-Cleanse: Identifying and Mitigating Backdoor Attacks in Diffusion\n  Models","authors":"Jiang Hao, Xiao Jin, Hu Xiaoguang, Chen Tianyou, Zhao Jiajia","authorsParsed":[["Hao","Jiang",""],["Jin","Xiao",""],["Xiaoguang","Hu",""],["Tianyou","Chen",""],["Jiajia","Zhao",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 03:54:41 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 14:46:40 GMT"}],"updateDate":"2024-08-23","timestamp":1722398081000,"abstract":"  Diffusion models (DMs) are regarded as one of the most advanced generative\nmodels today, yet recent studies suggest that they are vulnerable to backdoor\nattacks, which establish hidden associations between particular input patterns\nand model behaviors, compromising model integrity by causing undesirable\nactions with manipulated inputs. This vulnerability poses substantial risks,\nincluding reputational damage to model owners and the dissemination of harmful\ncontent. To mitigate the threat of backdoor attacks, there have been some\ninvestigations on backdoor detection and model repair. However, previous work\nfails to reliably purify the models backdoored by state-of-the-art attack\nmethods, rendering the field much underexplored. To bridge this gap, we\nintroduce Diff-Cleanse, a novel two-stage backdoor defense framework\nspecifically designed for DMs. The first stage employs a novel trigger\ninversion technique to reconstruct the trigger and detect the backdoor, and the\nsecond stage utilizes a structural pruning method to eliminate the backdoor. We\nevaluate our framework on hundreds of DMs that are attacked by three existing\nbackdoor attack methods with a wide range of hyperparameter settings. Extensive\nexperiments demonstrate that Diff-Cleanse achieves nearly 100\\% detection\naccuracy and effectively mitigates backdoor impacts, preserving the model's\nbenign performance with minimal compromise. Our code is avaliable at\nhttps://github.com/shymuel/diff-cleanse.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}