{"id":"2407.20686","title":"Solvent Quality and Nonbiological Oligomer Folding: Revisiting\n  Conventional Paradigms","authors":"Cedrix J. Dongmo Foumthuim, Tobia Arcangeli, Tatjana \\v{S}krbi\\'c,\n  Achille Giacometti","authorsParsed":[["Foumthuim","Cedrix J. Dongmo",""],["Arcangeli","Tobia",""],["Škrbić","Tatjana",""],["Giacometti","Achille",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 09:27:25 GMT"}],"updateDate":"2024-07-31","timestamp":1722331645000,"abstract":"  We report on extensive molecular dynamics atomistic simulations of a\n\\textit{meta}-substituted \\textit{poly}-phenylacetylene (pPA) foldamer\ndispersed in three solvents, water \\ce{H2O}, cyclohexane \\ce{cC6H12}, and\n\\textit{n}-hexane \\ce{nC6H14}, and for three oligomer lengths \\textit{12mer},\n\\textit{16mer} and \\textit{20mer}. At room temperature, we find a tendency of\nthe pPA foldamer to collapse into a helical structure in all three solvents but\nwith rather different stability character, stable in water, marginally stable\nin n-hexane, unstable in cyclohexane. In the case of water, the initial and\nfinal number of hydrogen bonds of the foldamer with water molecules is found to\nbe unchanged, with no formation of intrachain hydrogen bonding, thus indicating\nthat hydrogen bonding plays no role in the folding process. In all three\nsolvents, the folding is found to be mainly driven by electrostatics, nearly\nidentical in the three cases, and largely dominant compared to van der Waals\ninteractions that are different in the three cases.\n  This scenario is also supported by the analysis of distribution of the bond\nand dihedral angles and by a direct calculation of the solvation and transfer\nfree energies via thermodynamic integration. The different stability in the\ncase of cyclohexane and n-hexane notwithstanding their rather similar chemical\ncomposition can be traced back to the different entropy-enthalpy compensation\nthat is found similar for water and n-hexane, and very different for\ncyclohexane.\n  A comparison with the same properties for \\textit{poly}-phenylalanine\noligomers underscores the crucial differences between pPA and peptides.\n  To highlight how these findings can hardly be interpreted in terms of a\nsimple \"good\" and \"poor\" solvent picture, a molecular dynamics study of a\nbead-spring polymer chain in a Lennard-Jones fluid is also included.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RfQ1r9mYvA_b8Sn8pFo8fh_G7VkuFgwFG0wBO0leXA8","pdfSize":"10684841","objectId":"0xf97598fae339ac087269709fecac1692c07636d797bb86b76d6cd84f84ba504b","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
