{"id":"2407.20813","title":"On the use of field RR Lyrae as Galactic probes VII. light curve\n  templates in the LSST photometric system","authors":"V.F. Braga (1,2), M. Monelli (1), M. Dall'Ora (3), J.P. Mullen (4), R.\n  Molinaro (3), M. Marconi (3), R. Szab\\'o (5,6,7), C. Gallart (1) ((1)\n  Instituto de Astrof\\'isica de Canarias, La Laguna, Tenerife, Spain, (2)\n  INAF-Osservatorio Astronomico di Roma, Monte Porzio Catone, Italy, (3)\n  INAF-Osservatorio Astronomico di Capodimonte, Napoli, Italy, (4) Department\n  of Physics and Astronomy, Vanderbilt University, Nashville, USA, (5) Konkoly\n  Observatory, Research Centre for Astronomy and Earth Sciences (ELKH),\n  Budapest, Hungary, (6) MTA CSFK Lend\\\"ulet Near-Field Cosmology Research\n  Group, Budapest, Hungary, (7) ELTE E\\\"otv\\\"os Lor\\'and University, Institute\n  of Physics, Budapest, Hungary)","authorsParsed":[["Braga","V. F.",""],["Monelli","M.",""],["Dall'Ora","M.",""],["Mullen","J. P.",""],["Molinaro","R.",""],["Marconi","M.",""],["Szabó","R.",""],["Gallart","C.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 13:25:58 GMT"}],"updateDate":"2024-07-31","timestamp":1722345958000,"abstract":"  The \\textit{Vera C. Rubin} Observatory will start operations in 2025. During\nthe first two years, too few visits per target per band will be available,\nmeaning that mean magnitude measurements of variable stars will not be precise\nand thus, standard candles like RR Lyrae (RRL) will not be usable. Light curve\ntemplates (LCTs) can be adopted to estimate the mean magnitude of a variable\nstar with few magnitude measurements, provided that their period (plus\namplitude and reference epoch, depending on how the LCT is applied) is known.\nLSST will provide precise RRL periods within the first six months, allowing to\nexploit RRLs if LCTs were available.\n  We aim to build LCTs in the LSST bands to enhance the early science with\nLSST. Using them will provide a 1-2 years advantage with respect to a classical\napproach, concerning distance measurements.\n  We collected $gri$-band data from the ZTF survey and $z$-band data from DECam\nto build the LCTs of RRLs. We also adopted synthetic $griz$-band data in the\nLSST system from pulsation models, plus SDSS, \\gaia and OGLE photometry,\ninspecting the light amplitude ratios in different photometric systems to\nprovide useful conversions to apply the LCTs.\n  We have built LCTs of RRLs in the $griz$ bands of the LSST photometric\nsystem; for the $z$ band, we could build only fundamental-mode RRL LCTs. We\nquantitatively demonstrated that LCTs built with ZTF and DECam data can be\nadopted on the LSST photometric system. LCTs will decrease by a factor of at\nleast two the uncertainty on distance estimates of RRLs, with respect to a\nsimple average of the available measurements. Finally, within our tests, we\nhave found a brand new behavior of amplitude ratios in the Large Magellanic\nCloud.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}