{"id":"2407.01605","title":"Numerical method for the magnetic vector potential in incompressible\n  magnetohydrodynamic flows and the conservation properties of magnetic\n  helicity","authors":"Hideki Yanaoka","authorsParsed":[["Yanaoka","Hideki",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 02:11:41 GMT"}],"updateDate":"2024-07-03","timestamp":1719454301000,"abstract":"  Analyzing magnetohydrodynamic (MHD) flows requires accurate predictions of\nthe Lorentz force and energy conversion. Total energy, cross-helicity, and\nmagnetic helicity can be used to investigate energy conservation properties in\ninviscid MHD flows. However, the conservation property of magnetic helicity has\nnot been fully clarified using the magnetic vector potential equation. This\nstudy presents a numerical method to simultaneously relax magnetic vector and\nelectric potentials for incompressible MHD flows using a conservative finite\ndifference scheme that discretely conserves total energy. First, it was proven\nthat the transport equations of total energy, cross-helicity, and magnetic\nhelicity can be discretely derived from the equations of momentum, magnetic\nflux density, and magnetic vector potential, thereby elucidating the\nconservation properties of these quantities. Subsequently, five models for\nsteady and unsteady problems were analyzed to verify the accuracy and\nconvergence of the proposed numerical method. Additionally, the computational\napproach involving the magnetic vector and electric potentials was validated. A\ncomparison of the calculated results with exact solutions in the analysis of\none- and two-dimensional flow models and Hartmann flow further validated the\nnumerical method. Unsteady analyses of two- and three-dimensional decaying\nvortices were performed. The ideal periodic inviscid MHD flow exhibited good\nconservation properties for total energy and cross-helicity. Magnetic helicity\nwas discretely preserved even in three-dimensional flow. Furthermore, in\nviscous flow, the attenuation trends of total energy, cross-helicity, and\nmagnetic helicity aligned with the exact solution. The numerical method\naccurately captured the decay trends of energy. Thus, the proposed method can\nfacilitate the investigation of energy conservation and conversion in\ncompressible MHD flows.\n","subjects":["Physics/Fluid Dynamics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}