{"id":"2407.18932","title":"Be More Real: Travel Diary Generation Using LLM Agents and Individual\n  Profiles","authors":"Xuchuan Li, Fei Huang, Jianrong Lv, Zhixiong Xiao, Guolong Li, Yang\n  Yue","authorsParsed":[["Li","Xuchuan",""],["Huang","Fei",""],["Lv","Jianrong",""],["Xiao","Zhixiong",""],["Li","Guolong",""],["Yue","Yang",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 09:11:57 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 15:59:39 GMT"}],"updateDate":"2024-08-06","timestamp":1720602717000,"abstract":"  Human mobility is inextricably linked to social issues such as traffic\ncongestion, energy consumption, and public health; however, privacy concerns\nrestrict access to mobility data. Recently, research have utilized Large\nLanguage Models (LLMs) for human mobility generation, in which the challenge is\nhow LLMs can understand individuals' mobility behavioral differences to\ngenerate realistic trajectories conforming to real world contexts. This study\nhandles this problem by presenting an LLM agent-based framework (MobAgent)\ncomposing two phases: understanding-based mobility pattern extraction and\nreasoning-based trajectory generation, which enables generate more real travel\ndiaries at urban scale, considering different individual profiles. MobAgent\nextracts reasons behind specific mobility trendiness and attribute influences\nto provide reliable patterns; infers the relationships between contextual\nfactors and underlying motivations of mobility; and based on the patterns and\nthe recursive reasoning process, MobAgent finally generates more authentic and\npersonalized mobilities that reflect both individual differences and real-world\nconstraints. We validate our framework with 0.2 million travel survey data,\ndemonstrating its effectiveness in producing personalized and accurate travel\ndiaries. This study highlights the capacity of LLMs to provide detailed and\nsophisticated understanding of human mobility through the real-world mobility\ndata.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}