{"id":"2407.02128","title":"Scalable expectation propagation for generalized linear models","authors":"Niccol\\`o Anceschi and Augusto Fasano and Beatrice Franzolini and\n  Giovanni Rebaudo","authorsParsed":[["Anceschi","Niccolò",""],["Fasano","Augusto",""],["Franzolini","Beatrice",""],["Rebaudo","Giovanni",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 10:18:03 GMT"}],"updateDate":"2024-07-03","timestamp":1719915483000,"abstract":"  Generalized linear models (GLMs) arguably represent the standard approach for\nstatistical regression beyond the Gaussian likelihood scenario. When Bayesian\nformulations are employed, the general absence of a tractable posterior\ndistribution has motivated the development of deterministic approximations,\nwhich are generally more scalable than sampling techniques. Among them,\nexpectation propagation (EP) showed extreme accuracy, usually higher than many\nvariational Bayes solutions. However, the higher computational cost of EP posed\nconcerns about its practical feasibility, especially in high-dimensional\nsettings. We address these concerns by deriving a novel efficient formulation\nof EP for GLMs, whose cost scales linearly in the number of covariates p. This\nreduces the state-of-the-art O(p^2 n) per-iteration computational cost of the\nEP routine for GLMs to O(p n min{p,n}), with n being the sample size. We also\nshow that, for binary models and log-linear GLMs approximate predictive means\ncan be obtained at no additional cost. To preserve efficient moment matching\nfor count data, we propose employing a combination of log-normal Laplace\ntransform approximations, avoiding numerical integration. These novel results\nopen the possibility of employing EP in settings that were believed to be\npractically impossible. Improvements over state-of-the-art approaches are\nillustrated both for simulated and real data. The efficient EP implementation\nis available at https://github.com/niccoloanceschi/EPglm.\n","subjects":["Statistics/Computation"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IofATbxQbIwVN1CuKLM8XNOoB5gWa1RkBT7bvWmoLdo","pdfSize":"1108738"}
