{"id":"2407.00091","title":"Learning to Rank for Maps at Airbnb","authors":"Malay Haldar, Hongwei Zhang, Kedar Bellare, Sherry Chen, Soumyadip\n  Banerjee, Xiaotang Wang, Mustafa Abdool, Huiji Gao, Pavan Tapadia, Liwei He,\n  Sanjeev Katariya","authorsParsed":[["Haldar","Malay",""],["Zhang","Hongwei",""],["Bellare","Kedar",""],["Chen","Sherry",""],["Banerjee","Soumyadip",""],["Wang","Xiaotang",""],["Abdool","Mustafa",""],["Gao","Huiji",""],["Tapadia","Pavan",""],["He","Liwei",""],["Katariya","Sanjeev",""]],"versions":[{"version":"v1","created":"Tue, 25 Jun 2024 20:49:19 GMT"}],"updateDate":"2024-07-02","timestamp":1719348559000,"abstract":"  As a two-sided marketplace, Airbnb brings together hosts who own listings for\nrent with prospective guests from around the globe. Results from a guest's\nsearch for listings are displayed primarily through two interfaces: (1) as a\nlist of rectangular cards that contain on them the listing image, price,\nrating, and other details, referred to as list-results (2) as oval pins on a\nmap showing the listing price, called map-results. Both these interfaces, since\ntheir inception, have used the same ranking algorithm that orders listings by\ntheir booking probabilities and selects the top listings for display. But some\nof the basic assumptions underlying ranking, built for a world where search\nresults are presented as lists, simply break down for maps. This paper\ndescribes how we rebuilt ranking for maps by revising the mathematical\nfoundations of how users interact with search results. Our iterative and\nexperiment-driven approach led us through a path full of twists and turns,\nending in a unified theory for the two interfaces. Our journey shows how\nassumptions taken for granted when designing machine learning algorithms may\nnot apply equally across all user interfaces, and how they can be adapted. The\nnet impact was one of the largest improvements in user experience for Airbnb\nwhich we discuss as a series of experimental validations.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}