{"id":"2407.10177","title":"Towards Enabling 5G-NTN Satellite Communications for Manned and Unmanned\n  Rotary Wing Aircraft","authors":"Vasileios Leon, Ilias Christofilos, Athanasios Nesiadis, Iosif\n  Paraskevas, Juan Perrela, Georgios Ioannopoulos, Alexandros Tasoulis-Nonikas,\n  Mathieu Bernou, Jacques Reading","authorsParsed":[["Leon","Vasileios",""],["Christofilos","Ilias",""],["Nesiadis","Athanasios",""],["Paraskevas","Iosif",""],["Perrela","Juan",""],["Ioannopoulos","Georgios",""],["Tasoulis-Nonikas","Alexandros",""],["Bernou","Mathieu",""],["Reading","Jacques",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 12:26:51 GMT"},{"version":"v2","created":"Sat, 3 Aug 2024 14:22:23 GMT"},{"version":"v3","created":"Sat, 14 Sep 2024 08:31:24 GMT"},{"version":"v4","created":"Wed, 18 Sep 2024 15:36:29 GMT"}],"updateDate":"2024-09-19","timestamp":1720960011000,"abstract":"  Satellite Communications (SatCom) are a backbone of worldwide development. In\ncontrast with the past, when the GEO satellites were the only means for such\nconnectivity, nowadays the multi-orbital connectivity is emerging, especially\nwith the use of satellite constellations. Simultaneously, SatCom enabled the\nso-called In-Flight Connectivity, while with the advent of 5G-NTN, the\ndevelopment of this market is being accelerated. However, there are still\nvarious missing points before such a technology becomes mainstream, especially\nin the case of Rotary Wing Aircraft (RWA). Indeed, due to their particular\ncharacteristics, such as the low altitude flights and the blade interference,\nthere are still open challenges. In this work, an End-to-End (E2E) analysis for\nthe performance of SatCom under 5G-NTN for manned and unmanned RWA is\nperformed. Various scenarios are examined, and related requirements are shown.\nThe effects of blades and other characteristics of the RWA are established, and\nsimulations for these cases are developed. Results along with related\ndiscussion are presented, while future directions for development are\nsuggested. This work is part of the ESA ACROSS-AIR project.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Emerging Technologies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}