{"id":"2407.07317","title":"Flow-acoustic resonance in deep and inclined cavities","authors":"You Wei Ho and Jae Wook Kim","authorsParsed":[["Ho","You Wei",""],["Kim","Jae Wook",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 02:28:32 GMT"}],"updateDate":"2024-07-11","timestamp":1720578512000,"abstract":"  This paper presents numerical investigations of flow-acoustic resonances in\ndeep and inclined cavities using wall-resolved large eddy simulations. The\nstudy focuses on cavity configurations with an aspect ratio of $D/L = 2.632$,\nsubjected to two Mach numbers of $0.2$ and $0.3$ at three different inclination\nangles ($\\alpha=30^{\\circ}$, $60^{\\circ}$, and $90^{\\circ}$). Fully turbulent\nboundary layers generated from independent precursor simulations are employed\nupstream of the cavities. Initial results highlight distinct aeroacoustic\nresponses between inclined and orthogonal cavities, particularly at\n$M_{\\infty}=0.3$, where inclined cavities exhibit stronger resonances at a\nlower peak frequency ($St\\approx 0.27$) compared to the orthogonal cavity.\nFurther analysis reveals that this lower Strouhal number corresponds to a\nreduced vortex convection speed linked to large shear-layer oscillations.\nAdditionally, the acoustic input-output analysis indicates that the inclined\ncavities amplify acoustic responses more effectively and exhibit weaker\nsource-sink cancellations compared to the orthogonal cavity. These mechanisms\nare identified as the primary contributors to the enhanced aeroacoustic\nresponses in the inclined cavities. Finally, this paper proposes that the ratio\nbetween acoustic particle displacement and momentum thickness may be used as a\ncriterion to predict the onset of the distinctive resonance at $St\\approx\n0.27$. It is suggested that the amplified resonances may be linked to a\nnonlinear mode shift of the first hydrodynamic mode through enhanced\nshear-layer oscillation taking place when the proposed criterion is met.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}