{"id":"2407.19672","title":"SeaLLMs 3: Open Foundation and Chat Multilingual Large Language Models\n  for Southeast Asian Languages","authors":"Wenxuan Zhang, Hou Pong Chan, Yiran Zhao, Mahani Aljunied, Jianyu\n  Wang, Chaoqun Liu, Yue Deng, Zhiqiang Hu, Weiwen Xu, Yew Ken Chia, Xin Li,\n  Lidong Bing","authorsParsed":[["Zhang","Wenxuan",""],["Chan","Hou Pong",""],["Zhao","Yiran",""],["Aljunied","Mahani",""],["Wang","Jianyu",""],["Liu","Chaoqun",""],["Deng","Yue",""],["Hu","Zhiqiang",""],["Xu","Weiwen",""],["Chia","Yew Ken",""],["Li","Xin",""],["Bing","Lidong",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 03:26:22 GMT"}],"updateDate":"2024-07-30","timestamp":1722223582000,"abstract":"  Large Language Models (LLMs) have shown remarkable abilities across various\ntasks, yet their development has predominantly centered on high-resource\nlanguages like English and Chinese, leaving low-resource languages underserved.\nTo address this disparity, we present SeaLLMs 3, the latest iteration of the\nSeaLLMs model family, tailored for Southeast Asian languages. This region,\ncharacterized by its rich linguistic diversity, has lacked adequate language\ntechnology support. SeaLLMs 3 aims to bridge this gap by covering a\ncomprehensive range of languages spoken in this region, including English,\nChinese, Indonesian, Vietnamese, Thai, Tagalog, Malay, Burmese, Khmer, Lao,\nTamil, and Javanese. Leveraging efficient language enhancement techniques and a\nspecially constructed instruction tuning dataset, SeaLLMs 3 significantly\nreduces training costs while maintaining high performance and versatility. Our\nmodel excels in tasks such as world knowledge, mathematical reasoning,\ntranslation, and instruction following, achieving state-of-the-art performance\namong similarly sized models. Additionally, we prioritized safety and\nreliability by addressing both general and culture-specific considerations and\nincorporated mechanisms to reduce hallucinations. This work underscores the\nimportance of inclusive AI, showing that advanced LLM capabilities can benefit\nunderserved linguistic and cultural communities.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Z-SCqt2aXzzpf_OfiTdVrJf1mKEwCUTdupvJPNOD8mk","pdfSize":"564799","objectId":"0xf459f480890b1daedb3e88a05d315a4adbf7a5fa7199719392a9d4ef25626695","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
