{"id":"2407.10338","title":"Long Sequence Decoder Network for Mobile Sensing","authors":"Jiazhong Mei and J. Nathan Kutz","authorsParsed":[["Mei","Jiazhong",""],["Kutz","J. Nathan",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 21:40:22 GMT"}],"updateDate":"2024-07-16","timestamp":1720993222000,"abstract":"  The reconstruction and estimation of spatio-temporal patterns poses\nsignificant challenges when sensor measurements are limited. The use of mobile\nsensors adds additional complexity due to the change in sensor locations over\ntime. In such cases, historical measurement and sensor information are useful\nfor better performance, including models such as Kalman filters, recurrent\nneural networks (RNNs) or transformer models. However, many of these approaches\noften fail to efficiently handle long sequences of data in such scenarios and\nare sensitive to noise. In this paper, we consider a model-free approach using\nthe {\\em structured state space sequence} (S4D) model as a deep learning layer\nin traditional sequence models to learn a better representation of historical\nsensor data. Specifically, it is integrated with a shallow decoder network for\nreconstruction of the high-dimensional state space. We also introduce a novel\ninitialization of the S4D model using a Butterworth filter design to reduce\nnoise in the inputs. Consequently, we construct a robust S4D (rS4D) model by\nappending the filtering S4D layer before the original S4D structure. This\nrobust variant enhances the capability to accurately reconstruct\nspatio-temporal patterns with noisy mobile sensor measurements in long\nsequence. Numerical experiments demonstrate that our model achieves better\nperformance compared with previous approaches. Our results underscore the\nefficacy of leveraging state space models within the context of spatio-temporal\ndata reconstruction and estimation using limited mobile sensor resources,\nparticularly in terms of long-sequence dependency and robustness to noise.\n","subjects":["Mathematics/Dynamical Systems"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"K_UsY9mD5sDVG3pjY64-ySqwojyYd3qPsQ24btNSP-g","pdfSize":"1627729"}
