{"id":"2407.04023","title":"Gamma-Ray Burst prompt emission from the synchrotron radiation of\n  relativistic electrons in a rapidly decaying magnetic field","authors":"Fr\\'ed\\'eric Daigne and \\v{Z}eljka Bo\\v{s}njak","authorsParsed":[["Daigne","Frédéric",""],["Bošnjak","Željka",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 16:05:33 GMT"}],"updateDate":"2024-07-08","timestamp":1720109133000,"abstract":"  Synchrotron radiation from accelerated electrons above the photosphere of a\nrelativistic ejecta is a natural candidate for the dominant process for the\nprompt GRB emission. There is however a tension between the predicted\nlow-energy spectral index $\\alpha=-3/2$ in the fast cooling regime and\nobservations. Radiating electrons have time to travel away from their\nacceleration site and may experience an evolving magnetic field. To study the\nimpact on the synchrotron spectrum, we compute the radiation from electrons in\na decaying magnetic field, including adiabatic cooling, synchrotron radiation,\nIC scatterings and pair production. We explore the physical conditions in the\ncomoving frame of the emission region and focus on the fast cooling regime\nwhere the radiative timescale of electrons with a Lorentz factor $\\Gamma_{m}$\nresponsible for the peak of the emission, $t_{syn}(\\Gamma_{m})$, is much\nshorter than the dynamical timescale $t_{dyn}$. We find that the effect depends\non the decay characteristic timescale $t_{B}$: (i) for a slow decay with\n$t_{B}\\gtrsim 10 t_{syn}(\\Gamma_{m})$, the effect is very weak and the spectral\nshape is mostly determined by the impact of the IC scatterings on the electron\ncooling, leading to $-3/2\\le \\alpha\\le -1$; (ii) for a fast decay with $0.1\nt_{syn}(\\Gamma_{m})\\lesssim t_{B}\\lesssim 10 t_{syn}(\\Gamma_{m})$, the magnetic\nfield decay has a strong impact, leading naturally to the synchrotron\nmarginally fast cooling regime, where $\\alpha$ tends to $-2/3$ while the\nradiative efficiency remains high. The high energy IC component is enhanced in\nthis regime ; (iii) for an even faster decay, the whole electron population is\nslow cooling. We conclude that efficient synchrotron radiation in a rapidly\ndecaying magnetic field can reproduce low-energy photon indices ranging from\n$\\alpha=-3/2$ to $-2/3$, in agreement with the measured value in the majority\nof GRB spectra.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}