{"id":"2407.12347","title":"Improved Nonlocality Certification via Bouncing between Bell Operators\n  and Inequalities","authors":"Weikang Li, Mengyao Hu, Ke Wang, Shibo Xu, Zhide Lu, Jiachen Chen,\n  Yaozu Wu, Chuanyu Zhang, Feitong Jin, Xuhao Zhu, Yu Gao, Zhengyi Cui, Aosai\n  Zhang, Ning Wang, Yiren Zou, Fanhao Shen, Jiarun Zhong, Zehang Bao, Zitian\n  Zhu, Pengfei Zhang, Hekang Li, Qiujiang Guo, Zhen Wang, Dong-Ling Deng, Chao\n  Song, H. Wang, Patrick Emonts, Jordi Tura","authorsParsed":[["Li","Weikang",""],["Hu","Mengyao",""],["Wang","Ke",""],["Xu","Shibo",""],["Lu","Zhide",""],["Chen","Jiachen",""],["Wu","Yaozu",""],["Zhang","Chuanyu",""],["Jin","Feitong",""],["Zhu","Xuhao",""],["Gao","Yu",""],["Cui","Zhengyi",""],["Zhang","Aosai",""],["Wang","Ning",""],["Zou","Yiren",""],["Shen","Fanhao",""],["Zhong","Jiarun",""],["Bao","Zehang",""],["Zhu","Zitian",""],["Zhang","Pengfei",""],["Li","Hekang",""],["Guo","Qiujiang",""],["Wang","Zhen",""],["Deng","Dong-Ling",""],["Song","Chao",""],["Wang","H.",""],["Emonts","Patrick",""],["Tura","Jordi",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 06:47:22 GMT"}],"updateDate":"2024-07-18","timestamp":1721198842000,"abstract":"  Bell nonlocality is an intrinsic feature of quantum mechanics, which can be\ncertified via the violation of Bell inequalities. It is therefore a fundamental\nquestion to certify Bell nonlocality from experimental data. Here, we present\nan optimization scheme to improve nonlocality certification by exploring\nflexible mappings between Bell inequalities and Hamiltonians corresponding to\nthe Bell operators. We show that several Hamiltonian models can be mapped to\nnew inequalities with improved classical bounds than the original one, enabling\na more robust detection of nonlocality. From the other direction, we\ninvestigate the mapping from fixed Bell inequalities to Hamiltonians, aiming to\nmaximize quantum violations while considering experimental imperfections. As a\npractical demonstration, we apply this method to an XXZ-like honeycomb-lattice\nmodel utilizing over 70 superconducting qubits. The successful application of\nthis technique, as well as combining the two directions to form an optimization\nloop, may open new avenues for developing more practical and noise-resilient\nnonlocality certification techniques and enable broader experimental\nexplorations.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}