{"id":"2407.18180","title":"Passive wing deployment and retraction in beetles and flapping\n  microrobots","authors":"Hoang-Vu Phan, Hoon Cheol Park, and Dario Floreano","authorsParsed":[["Phan","Hoang-Vu",""],["Park","Hoon Cheol",""],["Floreano","Dario",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 16:39:42 GMT"}],"updateDate":"2024-08-12","timestamp":1721925582000,"abstract":"  Birds, bats and many insects can tuck their wings against their bodies at\nrest and deploy them to power flight. Whereas birds and bats use well-developed\npectoral and wing muscles and tendons, how insects control these movements\nremains unclear, as mechanisms of wing deployment and retraction vary among\ninsect species. Beetles (Coleoptera) display one of the most complex wing\nmechanisms. For example, in rhinoceros beetles, the wing deployment initiates\nby fully opening the elytra and partially releasing the hindwings from the\nabdomen. Subsequently, the beetle starts flapping, elevates the hindwings at\nthe bases, and unfolds the wingtips in an origami-like fashion. Whilst the\norigami-like fold have been extensively explored, limited attention has been\ngiven to the hindwing base deployment and retraction, which are believed to be\ndriven by thoracic muscles. Using high-speed cameras and robotic flapping-wing\nmodels, here we demonstrate that rhinoceros beetles can effortlessly elevate\nthe hindwings to flight position without the need for muscular activity. We\nshow that opening the elytra triggers a spring-like partial release of the\nhindwings from the body, allowing the clearance needed for subsequent flapping\nmotion that brings the hindwings into flight position. The results also show\nthat after flight, beetles can leverage the elytra to push the hindwings back\ninto the resting position, further strengthening the hypothesis of a passive\ndeployment mechanism. Finally, we validate the hypothesis with a flapping\nmicrorobot that passively deploys its wings for stable controlled flight and\nretracts them neatly upon landing, which offers a simple yet effective approach\nto the design of insect-like flying micromachines.\n","subjects":["Physics/Biological Physics","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"laenULCs7G5QECbETgFqBvcHt2ipxTfPzL7gzvlNQTw","pdfSize":"3857485","objectId":"0x31f1ff3ae71075a8670e43dfd922afc5b39299a14490c5b0e26431699453a1d2","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
