{"id":"2407.14065","title":"MSCT: Addressing Time-Varying Confounding with Marginal Structural\n  Causal Transformer for Counterfactual Post-Crash Traffic Prediction","authors":"Shuang Li, Ziyuan Pu, Nan Zhang, Duxin Chen, Lu Dong, Daniel J.\n  Graham, Yinhai Wang","authorsParsed":[["Li","Shuang",""],["Pu","Ziyuan",""],["Zhang","Nan",""],["Chen","Duxin",""],["Dong","Lu",""],["Graham","Daniel J.",""],["Wang","Yinhai",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 06:42:41 GMT"}],"updateDate":"2024-07-22","timestamp":1721371361000,"abstract":"  Traffic crashes profoundly impede traffic efficiency and pose economic\nchallenges. Accurate prediction of post-crash traffic status provides essential\ninformation for evaluating traffic perturbations and developing effective\nsolutions. Previous studies have established a series of deep learning models\nto predict post-crash traffic conditions, however, these correlation-based\nmethods cannot accommodate the biases caused by time-varying confounders and\nthe heterogeneous effects of crashes. The post-crash traffic prediction model\nneeds to estimate the counterfactual traffic speed response to hypothetical\ncrashes under various conditions, which demonstrates the necessity of\nunderstanding the causal relationship between traffic factors. Therefore, this\npaper presents the Marginal Structural Causal Transformer (MSCT), a novel deep\nlearning model designed for counterfactual post-crash traffic prediction. To\naddress the issue of time-varying confounding bias, MSCT incorporates a\nstructure inspired by Marginal Structural Models and introduces a balanced loss\nfunction to facilitate learning of invariant causal features. The proposed\nmodel is treatment-aware, with a specific focus on comprehending and predicting\ntraffic speed under hypothetical crash intervention strategies. In the absence\nof ground-truth data, a synthetic data generation procedure is proposed to\nemulate the causal mechanism between traffic speed, crashes, and covariates.\nThe model is validated using both synthetic and real-world data, demonstrating\nthat MSCT outperforms state-of-the-art models in multi-step-ahead prediction\nperformance. This study also systematically analyzes the impact of time-varying\nconfounding bias and dataset distribution on model performance, contributing\nvaluable insights into counterfactual prediction for intelligent transportation\nsystems.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dEcnDBygpVWJN0sBm8aVVQL_WzQCdEe0LcDk-CoVh6U","pdfSize":"3288653","objectId":"0x261775d2078d118badbaed1c0a8ca64fb0490abc15b2270c40148ae1028494db","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
