{"id":"2407.13707","title":"Dissipation at limited resolutions: Power law and detection of hidden\n  dissipative scales","authors":"Qiwei Yu and Pedro E. Harunari","authorsParsed":[["Yu","Qiwei",""],["Harunari","Pedro E.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:06:15 GMT"}],"updateDate":"2024-07-19","timestamp":1721322375000,"abstract":"  Nonequilibrium systems, in particular living organisms, are maintained by\nirreversible transformations of energy that drive diverse functions.\nQuantifying their irreversibility, as measured by energy dissipation, is\nessential for understanding the underlying mechanisms. However, existing\ntechniques usually overlook experimental limitations, either by assuming full\ninformation or by employing a coarse-graining method that requires knowledge of\nthe structure behind hidden degrees of freedom. Here, we study the inference of\ndissipation from finite-resolution measurements by employing a recently\ndeveloped model-free estimator that considers both the sequence of\ncoarse-grained transitions and the waiting time distributions:\n$\\sigma_2=\\sigma_2^\\ell + \\sigma_2^t$. The dominant term $\\sigma_2^\\ell$\noriginates from the sequence of observed transitions; we find that it scales\nwith resolution following a power law. Comparing the scaling exponent with a\nprevious estimator highlights the importance of accounting for flux\ncorrelations at lower resolutions. $\\sigma_2^t$ comes from asymmetries in\nwaiting time distributions, with its peak revealing characteristic scales of\nthe underlying dissipative process. Alternatively, the characteristic scale can\nbe detected in a crossover of the scaling of $\\sigma_2^\\ell$. This provides a\nnovel perspective for extracting otherwise hidden characteristic dissipative\nscales directly from dissipation measurements. We illustrate these results in\nbiochemical models as well as complex networks. Overall, this study highlights\nthe significance of resolution considerations in nonequilibrium systems,\nproviding insights into the interplay between experimental resolution, entropy\nproduction, and underlying complexity.\n","subjects":["Condensed Matter/Statistical Mechanics","Physics/Biological Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}