{"id":"2407.00308","title":"The role of lattice thermal conductivity suppression by dopants from a\n  holistic perspective","authors":"Shengnan Dai, Shijie Zhang, Ye Sheng, Erting Dong, Sheng Sun, Lili Xi,\n  G. Jeffrey Snyder, Jinyang Xi, Jiong Yang","authorsParsed":[["Dai","Shengnan",""],["Zhang","Shijie",""],["Sheng","Ye",""],["Dong","Erting",""],["Sun","Sheng",""],["Xi","Lili",""],["Snyder","G. Jeffrey",""],["Xi","Jinyang",""],["Yang","Jiong",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 04:13:35 GMT"}],"updateDate":"2024-07-02","timestamp":1719634415000,"abstract":"  Dopants play an important role in improving electrical and thermal transport.\nIn the traditional perspective, a dopant suppresses lattice thermal\nconductivity kL by adding point defect (PD) scattering term to the phonon\nrelaxation time, which has been adopted for decades. In this study, we propose\nan innovative perspective to solve the kL of defective systems-the holistic\napproach, i.e., treating dopant and matrix as a holism. This approach allows us\nto handle the influences from defects explicitly by the calculations of\ndefective systems, about their changed phonon dispersion, phonon-phonon and\nelectron-phonon interaction, etc, due to the existence of dopants. The kL\nreduction between defective MxNb1-xFeSb (M=V, Ti) and NbFeSb is used as an\nexample for the holistic approach, and comparable results with experiments are\nobtained. It is notable that light elemental dopants also induced the\navoided-crossing behavior. It can be further rationalized by a one-dimensional\natomic chain model. The mass and force constant imbalance generally generates\nthe avoided-crossing phonons, mathematically in a similar way as the\ncoefficients in traditional PD scattering, but along a different direction in\nkL reduction. Our work provides another perspective for understanding the\nmechanism of dopants influence in material's thermal transport.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}