{"id":"2407.03814","title":"Network Sovereignty: A Novel Metric and its Application on Network\n  Design","authors":"Shakthivelu Janardhanan, Maria Samonaki, Poul Einar Heegaard, Wolfgang\n  Kellerer, Carmen Mas-Machuca","authorsParsed":[["Janardhanan","Shakthivelu",""],["Samonaki","Maria",""],["Heegaard","Poul Einar",""],["Kellerer","Wolfgang",""],["Mas-Machuca","Carmen",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 10:38:07 GMT"}],"updateDate":"2024-08-21","timestamp":1720089487000,"abstract":"  Most network planning problems in literature consider metrics such as cost,\navailability, and other technology-aware attributes. However, network operators\nnow face new challenges in designing their networks to minimize their\ndependencies on manufacturers. A low dependency is associated with higher\nnetwork robustness in case one or more manufacturers fail due to erroneous\ncomponent design, geopolitical banning of manufacturers, or other reasons\ndiscussed in this work. Our work discusses network sovereignty, i.e., the\nability to operate a network without dependencies on a particular manufacturer\nwhile minimizing the impact of simultaneous manufacturer failure(s). Network\nsovereignty is considered by solving the manufacturer assignment problem in the\nnetwork such that robustness is maximized. The three main contributions of this\nwork are (i) the discussion of network sovereignty as a special attribute of\ndependability, (ii) the introduction of a novel metric -- the Path Set\nDiversity (PSD) score to measure network sovereignty, and (iii) the\nintroduction of Naga, an ILP formulation to maximize network sovereignty using\nthe PSD score. We compare Naga's performance with centrality metrics-based\nheuristics and an availability-based optimization. Our work aims to be the\nfoundation to guide network operators in increasing their network sovereignty.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"UgwodPrllcus_3rHnED5AJCRdORaVCJQ-rpFutW0Yzw","pdfSize":"7539759"}
