{"id":"2407.20348","title":"Late Jets, Early Sparks: Illuminating the Pre-Maximum Bumps in\n  Superluminous Supernovae","authors":"Ore Gottlieb, Brian D. Metzger","authorsParsed":[["Gottlieb","Ore",""],["Metzger","Brian D.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:01:33 GMT"}],"updateDate":"2024-07-31","timestamp":1722276093000,"abstract":"  Superluminous supernovae (SLSNe) radiate $\\gtrsim 10-100$ times more energy\nthan ordinary stellar explosions, implicating a novel power source behind these\nenigmatic events. One frequently discussed source, particularly for\nhydrogen-poor (Type I) SLSNe, is a central engine such as a millisecond\nmagnetar or accreting black hole. Both black hole and magnetar engines are\nexpected to channel a fraction of their luminosity into a collimated\nrelativistic jet. Using 3D relativistic hydrodynamical simulations, we explore\nthe interaction of a relativistic jet, endowed with a luminosity $L_{\\rm\nj}\\approx10^{45}\\,{\\rm erg\\,s^{-1}}$ and duration $t_{\\rm eng} \\approx$ days\ncompatible with those needed to power SLSNe, launched into the envelope of the\nexploding star. The jet successfully breaks through the expanding ejecta and\nits shocked cocoon powers ultraviolet/optical emission lasting several days\nafter the explosion and reaching a peak luminosity $\\gtrsim 10^{44}$ erg\ns$^{-1}$, corresponding to a sizable fraction of $L_{\\rm j}$. This high\nradiative efficiency is the result of the modest adiabatic losses the cocoon\nexperiences due to the low optical depths of the enlarged ejecta at these late\ntimes, e.g., compared to the more compact stars in gamma-ray bursts. The\nluminosity and temperature of the cocoon emission match those of the ``bumps''\nin SLSNe light curves observed weeks prior to the optical maximum in many\nSLSNe. Confirmation of jet breakout signatures by future observations (e.g.,\ndays to weeks-long internal X-ray emission from the jet for on-axis observers,\nspectroscopy confirming large photosphere velocities $v/c \\gtrsim 0.1$, or\ndetection of a radio afterglow) would offer strong evidence for central engines\npowering SLSNe.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}