{"id":"2407.19823","title":"Analyzing and reducing the synthetic-to-real transfer gap in Music\n  Information Retrieval: the task of automatic drum transcription","authors":"Micka\\\"el Zehren, Marco Alunno, and Paolo Bientinesi","authorsParsed":[["Zehren","Mickaël",""],["Alunno","Marco",""],["Bientinesi","Paolo",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 09:17:16 GMT"}],"updateDate":"2024-07-30","timestamp":1722244636000,"abstract":"  Automatic drum transcription is a critical tool in Music Information\nRetrieval for extracting and analyzing the rhythm of a music track, but it is\nlimited by the size of the datasets available for training. A popular method\nused to increase the amount of data is by generating them synthetically from\nmusic scores rendered with virtual instruments. This method can produce a\nvirtually infinite quantity of tracks, but empirical evidence shows that models\ntrained on previously created synthetic datasets do not transfer well to real\ntracks. In this work, besides increasing the amount of data, we identify and\nevaluate three more strategies that practitioners can use to improve the\nrealism of the generated data and, thus, narrow the synthetic-to-real transfer\ngap. To explore their efficacy, we used them to build a new synthetic dataset\nand then we measured how the performance of a model scales and, specifically,\nat what value it will stagnate when increasing the number of training tracks\nfor different datasets. By doing this, we were able to prove that the\naforementioned strategies contribute to make our dataset the one with the most\nrealistic data distribution and the lowest synthetic-to-real transfer gap among\nthe synthetic datasets we evaluated. We conclude by highlighting the limits of\ntraining with infinite data in drum transcription and we show how they can be\novercome.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KrHlbfEDMJrKbNpJvVpTlgccU2ODp_llafWM4dEEIjk","pdfSize":"685599"}
