{"id":"2407.14496","title":"Hair cells in the cochlea must tune resonant modes to the edge of\n  instability without destabilizing collective modes","authors":"Asheesh S. Momi, Michael C. Abbott, Julian Rubinfien, Benjamin B.\n  Machta, Isabella R. Graf","authorsParsed":[["Momi","Asheesh S.",""],["Abbott","Michael C.",""],["Rubinfien","Julian",""],["Machta","Benjamin B.",""],["Graf","Isabella R.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 17:47:42 GMT"}],"updateDate":"2024-07-22","timestamp":1721411262000,"abstract":"  Sound produces surface waves along the cochlea's basilar membrane. To achieve\nthe ear's astonishing frequency resolution and sensitivity to faint sounds,\ndissipation in the cochlea must be canceled via active processes in hair cells,\neffectively bringing the cochlea to the edge of instability. But how can the\ncochlea be globally tuned to the edge of instability with only local feedback?\nTo address this question, we use a discretized version of a standard model of\nbasilar membrane dynamics, but with an explicit contribution from active\nprocesses in hair cells. Surprisingly, we find the basilar membrane supports\ntwo qualitatively distinct sets of modes: a continuum of localized modes and a\nsmall number of collective extended modes. Localized modes sharply peak at\ntheir resonant position and are largely uncoupled. As a result, they can be\namplified almost independently from each other by local hair cells via feedback\nreminiscent of self-organized criticality. However, this amplification can\ndestabilize the collective extended modes; avoiding such instabilities places\nlimits on possible molecular mechanisms for active feedback in hair cells. Our\nwork illuminates how and under what conditions individual hair cells can\ncollectively create a critical cochlea.\n","subjects":["Physics/Biological Physics","Condensed Matter/Statistical Mechanics","Quantitative Biology/Quantitative Methods"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}