{"id":"2407.07858","title":"FACTS About Building Retrieval Augmented Generation-based Chatbots","authors":"Rama Akkiraju, Anbang Xu, Deepak Bora, Tan Yu, Lu An, Vishal Seth,\n  Aaditya Shukla, Pritam Gundecha, Hridhay Mehta, Ashwin Jha, Prithvi Raj,\n  Abhinav Balasubramanian, Murali Maram, Guru Muthusamy, Shivakesh Reddy\n  Annepally, Sidney Knowles, Min Du, Nick Burnett, Sean Javiya, Ashok Marannan,\n  Mamta Kumari, Surbhi Jha, Ethan Dereszenski, Anupam Chakraborty, Subhash\n  Ranjan, Amina Terfai, Anoop Surya, Tracey Mercer, Vinodh Kumar Thanigachalam,\n  Tamar Bar, Sanjana Krishnan, Samy Kilaru, Jasmine Jaksic, Nave Algarici,\n  Jacob Liberman, Joey Conway, Sonu Nayyar, Justin Boitano","authorsParsed":[["Akkiraju","Rama",""],["Xu","Anbang",""],["Bora","Deepak",""],["Yu","Tan",""],["An","Lu",""],["Seth","Vishal",""],["Shukla","Aaditya",""],["Gundecha","Pritam",""],["Mehta","Hridhay",""],["Jha","Ashwin",""],["Raj","Prithvi",""],["Balasubramanian","Abhinav",""],["Maram","Murali",""],["Muthusamy","Guru",""],["Annepally","Shivakesh Reddy",""],["Knowles","Sidney",""],["Du","Min",""],["Burnett","Nick",""],["Javiya","Sean",""],["Marannan","Ashok",""],["Kumari","Mamta",""],["Jha","Surbhi",""],["Dereszenski","Ethan",""],["Chakraborty","Anupam",""],["Ranjan","Subhash",""],["Terfai","Amina",""],["Surya","Anoop",""],["Mercer","Tracey",""],["Thanigachalam","Vinodh Kumar",""],["Bar","Tamar",""],["Krishnan","Sanjana",""],["Kilaru","Samy",""],["Jaksic","Jasmine",""],["Algarici","Nave",""],["Liberman","Jacob",""],["Conway","Joey",""],["Nayyar","Sonu",""],["Boitano","Justin",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 17:20:59 GMT"}],"updateDate":"2024-07-11","timestamp":1720632059000,"abstract":"  Enterprise chatbots, powered by generative AI, are emerging as key\napplications to enhance employee productivity. Retrieval Augmented Generation\n(RAG), Large Language Models (LLMs), and orchestration frameworks like\nLangchain and Llamaindex are crucial for building these chatbots. However,\ncreating effective enterprise chatbots is challenging and requires meticulous\nRAG pipeline engineering. This includes fine-tuning embeddings and LLMs,\nextracting documents from vector databases, rephrasing queries, reranking\nresults, designing prompts, honoring document access controls, providing\nconcise responses, including references, safeguarding personal information, and\nbuilding orchestration agents. We present a framework for building RAG-based\nchatbots based on our experience with three NVIDIA chatbots: for IT/HR\nbenefits, financial earnings, and general content. Our contributions are\nthree-fold: introducing the FACTS framework (Freshness, Architectures, Cost,\nTesting, Security), presenting fifteen RAG pipeline control points, and\nproviding empirical results on accuracy-latency tradeoffs between large and\nsmall LLMs. To the best of our knowledge, this is the first paper of its kind\nthat provides a holistic view of the factors as well as solutions for building\nsecure enterprise-grade chatbots.\"\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Qg5UIQYONrA0QELr9lBNO-mfqNc6TZTV-fyMfuE7x70","pdfSize":"1165789"}
