{"id":"2407.15297","title":"Distributional limits of graph cuts on discretized grids","authors":"Leo Suchan, Housen Li, Axel Munk","authorsParsed":[["Suchan","Leo",""],["Li","Housen",""],["Munk","Axel",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 23:43:44 GMT"}],"updateDate":"2024-07-23","timestamp":1721605424000,"abstract":"  Graph cuts are among the most prominent tools for clustering and\nclassification analysis. While intensively studied from geometric and\nalgorithmic perspectives, graph cut-based statistical inference still remains\nelusive to a certain extent. Distributional limits are fundamental in\nunderstanding and designing such statistical procedures on randomly sampled\ndata. We provide explicit limiting distributions for balanced graph cuts in\ngeneral on a fixed but arbitrary discretization. In particular, we show that\nMinimum Cut, Ratio Cut and Normalized Cut behave asymptotically as the minimum\nof Gaussians as sample size increases. Interestingly, our results reveal a\ndichotomy for Cheeger Cut: The limiting distribution of the optimal objective\nvalue is the minimum of Gaussians only when the optimal partition yields two\nsets of unequal volumes, while otherwise the limiting distribution is the\nminimum of a random mixture of Gaussians. Further, we show the bootstrap\nconsistency for all types of graph cuts by utilizing the directional\ndifferentiability of cut functionals. We validate these theoretical findings by\nMonte Carlo experiments, and examine differences between the cuts and the\ndependency on the underlying distribution. Additionally, we expand our\ntheoretical findings to the Xist algorithm, a computational surrogate of graph\ncuts recently proposed in Suchan, Li and Munk (arXiv, 2023), thus demonstrating\nthe practical applicability of our findings e.g. in statistical tests.\n","subjects":["Mathematics/Statistics Theory","Mathematics/Combinatorics","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}