{"id":"2407.20771","title":"Absence of BCS-BEC Crossover in FeSe0.45Te0 55 Superconductor","authors":"Junjie Jia, Yadong Gu, Chaohui Yin, Yingjie Shu, Yiwen Chen, Jumin\n  Shi, Xing Zhang, Hao Chen, Taimin Miao, Xiaolin Ren, Bo Liang, Wenpei Zhu,\n  Neng Cai, Fengfeng Zhang, Shenjin Zhang, Feng Yang, Zhimin Wang, Qinjun Peng,\n  Zuyan Xu, Hanqing Mao, Guodong Liu, Zhian Ren, Lin Zhao, X. J. Zhou","authorsParsed":[["Jia","Junjie",""],["Gu","Yadong",""],["Yin","Chaohui",""],["Shu","Yingjie",""],["Chen","Yiwen",""],["Shi","Jumin",""],["Zhang","Xing",""],["Chen","Hao",""],["Miao","Taimin",""],["Ren","Xiaolin",""],["Liang","Bo",""],["Zhu","Wenpei",""],["Cai","Neng",""],["Zhang","Fengfeng",""],["Zhang","Shenjin",""],["Yang","Feng",""],["Wang","Zhimin",""],["Peng","Qinjun",""],["Xu","Zuyan",""],["Mao","Hanqing",""],["Liu","Guodong",""],["Ren","Zhian",""],["Zhao","Lin",""],["Zhou","X. J.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 12:16:30 GMT"}],"updateDate":"2024-07-31","timestamp":1722341790000,"abstract":"  In iron-based superconductor Fe(Se,Te), a flat band-like feature near the\nFermi level was observed around the Brillouin zone center in the\nsuperconducting state. It is under debate whether this is the evidence on the\npresence of the BCS-BEC crossover in the superconductor. High-resolution\nlaser-based angle-resolved photoemission measurements are carried out on high\nquality single crystals of FeSe0.45Te0.55 superconductor to address the issue.\nBy employing different polarization geometries, we have resolved and isolated\nthe dyz band and the topological surface band, making it possible to study\ntheir superconducting behaviors separately. The dyz band alone does not form a\nflat band-like feature in the superconducting state and the measured dispersion\ncan be well described by the BCS picture. We find that the flat band-like\nfeature is formed from the combination of the dyz band and the topological\nsurface state band in the superconducting state. These results reveal the\norigin of the flat band-like feature and rule out the presence of BCS-BEC\ncrossover in Fe(Se,Te) superconductor.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}