{"id":"2407.20430","title":"Investigating the Electron Capture Supernova Candidate AT 2019abn with\n  JWST Spectroscopy","authors":"Sam Rose (1), Ryan M. Lau (2), Jacob E. Jencson (3), Mansi M. Kasliwal\n  (1), Kishalay De (4), Michael E. Ressler (5), Ori D. Fox (6), Matthew J.\n  Hankins (7) ((1) Division of Physics, Mathematics, and Astronomy, California\n  Institute of Technology, Pasadena, CA, USA, (2) NSF NOIRLab, Tucson, AZ, USA,\n  (3) Caltech/IPAC, Pasadena, CA, USA, (4) MIT-Kavli Institute for Astrophysics\n  and Space Research, Cambridge, MA, USA, (5) Jet Propulsion Laboratory,\n  California Institute of Technology, Pasadena, CA, USA, (6) Space Telescope\n  Science Institute, Baltimore, MD, USA, (7) Arkansas Tech University,\n  Russellville, AR, USA)","authorsParsed":[["Rose","Sam",""],["Lau","Ryan M.",""],["Jencson","Jacob E.",""],["Kasliwal","Mansi M.",""],["De","Kishalay",""],["Ressler","Michael E.",""],["Fox","Ori D.",""],["Hankins","Matthew J.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 21:41:25 GMT"}],"updateDate":"2024-07-31","timestamp":1722289285000,"abstract":"  The James Webb Space Telescope (JWST) has opened up a new window to study\nhighly reddened explosive transients. We present results from late-time (1421\ndays post-explosion) JWST follow-up spectroscopic observations with NIRSpec and\nMIRI LRS of the intermediate luminosity red transient (ILRT) AT 2019abn located\nin the nearby Messier 51 galaxy (8.6 Mpc). ILRTs represent a mysterious class\nof transients which exhibit peak luminosities between those of classical novae\nand supernovae and which are known to be highly dust obscured. Similar to the\nprototypical examples of this class of objects, NGC 300 2008-OT and SN 2008S,\nAT 2019abn has an extremely red and dusty progenitor detected only in\npre-explosion Spitzer/IRAC imaging at 3.6 and 4.5 micron and not in deep\noptical or near-infrared HST images. We find that late time observations of AT\n2019abn from NEOWISE and JWST are consistent with the late time evolution of SN\n2008S. In part because they are so obscured by dust, it is unknown what\nproduces an ILRT with hypotheses ranging from high mass stellar merger events,\nnon-terminal stellar outbursts, or terminal supernovae explosions through\nelectron-capture in super-AGB stars. Our JWST observations show strong mid-IR\nClass C PAH features at 6.3 and 8.25 micron typical of carbon-rich post-AGB\nsources. These features suggest the dust around AT 2019abn, either pre-existing\nor newly formed in the ejecta, is composed of carbonaceous grains which are not\ntypically observed around red supergiants. However, depending on the strength\nand temperature of hot bottom burning, SAGBs may be expected to exhibit a\ncarbon-rich chemistry. Thus our JWST observations are consistent with AT\n2019abn having an SAGB progenitor.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}