{"id":"2407.18783","title":"Science for whom? The influence of the regional academic circuit on\n  gender inequalities in Latin America","authors":"Carolina Pradier, Diego Kozlowski, Natsumi S. Shokida, and Vincent\n  Larivi\\`ere","authorsParsed":[["Pradier","Carolina",""],["Kozlowski","Diego",""],["Shokida","Natsumi S.",""],["Larivière","Vincent",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 14:45:24 GMT"}],"updateDate":"2024-07-29","timestamp":1722005124000,"abstract":"  The Latin-American scientific community has achieved significant progress\ntowards gender parity, with nearly equal representation of women and men\nscientists. Nevertheless, women continue to be underrepresented in scholarly\ncommunication. Throughout the 20th century, Latin America established its\nacademic circuit, focusing on research topics of regional significance.\nHowever, the community has since reoriented its research towards the global\nacademic circuit. Through an analysis of scientific publications, this article\nexplores the relationship between gender inequalities in science and the\nintegration of Latin-American researchers into the regional and global academic\ncircuits between 1993 and 2022. We find that women are more likely to engage in\nthe regional circuit, while men are more active within the global circuit. This\ntrend is attributed to a thematic alignment between women's research interests\nand issues specific to Latin America. Furthermore, our results reveal that the\nmechanisms contributing to gender differences in symbolic capital accumulation\nvary between circuits. Women's work achieves equal or greater recognition\ncompared to men's within the regional circuit, but generally garners less\nattention in the global circuit. Our findings suggest that policies aimed at\nstrengthening the regional academic circuit would encourage scientists to\naddress locally relevant topics while simultaneously fostering gender equality\nin science.\n","subjects":["Computing Research Repository/Digital Libraries"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wp1A0vbANsSbBx2ppQpZDrzRzddEPnEKLBEK73q2y5k","pdfSize":"987459"}
