{"id":"2407.13179","title":"Learned HDR Image Compression for Perceptually Optimal Storage and\n  Display","authors":"Peibei Cao, Haoyu Chen, Jingzhe Ma, Yu-Chieh Yuan, Zhiyong Xie, Xin\n  Xie, Haiqing Bai, and Kede Ma","authorsParsed":[["Cao","Peibei",""],["Chen","Haoyu",""],["Ma","Jingzhe",""],["Yuan","Yu-Chieh",""],["Xie","Zhiyong",""],["Xie","Xin",""],["Bai","Haiqing",""],["Ma","Kede",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 05:35:57 GMT"}],"updateDate":"2024-07-19","timestamp":1721280957000,"abstract":"  High dynamic range (HDR) capture and display have seen significant growth in\npopularity driven by the advancements in technology and increasing consumer\ndemand for superior image quality. As a result, HDR image compression is\ncrucial to fully realize the benefits of HDR imaging without suffering from\nlarge file sizes and inefficient data handling. Conventionally, this is\nachieved by introducing a residual/gain map as additional metadata to bridge\nthe gap between HDR and low dynamic range (LDR) images, making the former\ncompatible with LDR image codecs but offering suboptimal rate-distortion\nperformance. In this work, we initiate efforts towards end-to-end optimized HDR\nimage compression for perceptually optimal storage and display. Specifically,\nwe learn to compress an HDR image into two bitstreams: one for generating an\nLDR image to ensure compatibility with legacy LDR displays, and another as side\ninformation to aid HDR image reconstruction from the output LDR image. To\nmeasure the perceptual quality of output HDR and LDR images, we use two\nrecently proposed image distortion metrics, both validated against human\nperceptual data of image quality and with reference to the uncompressed HDR\nimage. Through end-to-end optimization for rate-distortion performance, our\nmethod dramatically improves HDR and LDR image quality at all bit rates.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}