{"id":"2407.08572","title":"Boosting Adversarial Transferability for Skeleton-based Action\n  Recognition via Exploring the Model Posterior Space","authors":"Yunfeng Diao, Baiqi Wu, Ruixuan Zhang, Xun Yang, Meng Wang, He Wang","authorsParsed":[["Diao","Yunfeng",""],["Wu","Baiqi",""],["Zhang","Ruixuan",""],["Yang","Xun",""],["Wang","Meng",""],["Wang","He",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:59:31 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 07:25:35 GMT"}],"updateDate":"2024-09-06","timestamp":1720709971000,"abstract":"  Skeletal motion plays a pivotal role in human activity recognition (HAR).\nRecently, attack methods have been proposed to identify the universal\nvulnerability of skeleton-based HAR(S-HAR). However, the research of\nadversarial transferability on S-HAR is largely missing. More importantly,\nexisting attacks all struggle in transfer across unknown S-HAR models. We\nobserved that the key reason is that the loss landscape of the action\nrecognizers is rugged and sharp. Given the established correlation in prior\nstudies~\\cite{qin2022boosting,wu2020towards} between loss landscape and\nadversarial transferability, we assume and empirically validate that smoothing\nthe loss landscape could potentially improve adversarial transferability on\nS-HAR. This is achieved by proposing a new post-train Dual Bayesian strategy,\nwhich can effectively explore the model posterior space for a collection of\nsurrogates without the need for re-training. Furthermore, to craft adversarial\nexamples along the motion manifold, we incorporate the attack gradient with\ninformation of the motion dynamics in a Bayesian manner. Evaluated on benchmark\ndatasets, e.g. HDM05 and NTU 60, the average transfer success rate can reach as\nhigh as 35.9\\% and 45.5\\% respectively. In comparison, current state-of-the-art\nskeletal attacks achieve only 3.6\\% and 9.8\\%. The high adversarial\ntransferability remains consistent across various surrogate, victim, and even\ndefense models. Through a comprehensive analysis of the results, we provide\ninsights on what surrogates are more likely to exhibit transferability, to shed\nlight on future research.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}