{"id":"2407.21541","title":"Elastic bodies with kinematic constraints on many small regions","authors":"Andrea Braides, Giovanni Noselli, Simone Vincini","authorsParsed":[["Braides","Andrea",""],["Noselli","Giovanni",""],["Vincini","Simone",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 11:59:44 GMT"}],"updateDate":"2024-08-01","timestamp":1722427184000,"abstract":"  We study the equilibrium of hyperelastic solids subjected to kinematic\nconstraints on many small regions, which we call perforations.\n  Such constraints on the displacement $u$ are given in the quite general form\n$u(x) \\in F_x$, where $F_x$ is a closed set, and thus comprise confinement\nconditions, unilateral constraints, controlled displacement conditions, etc.,\nboth in the bulk and on the boundary of the body. The regions in which such\nconditions are active are assumed to be so small that they do not produce an\noverall rigid constraint, but still large enough so as to produce a non-trivial\neffect on the behaviour of the body. Mathematically, this is translated in an\nasymptotic analysis by introducing two small parameters: $\\varepsilon$,\ndescribing the distance between the elements of the perforation, and $\\delta$,\nthe size of the element of the perforation. We find the critical scale at which\nthe effect of the perforation is non-trivial and express it in terms of a\n$\\Gamma$-limit in which the constraints are relaxed so that, in their place, a\npenalization term appears in the form of an integral of a function\n$\\varphi(x,u)$. This function is determined by a blow-up procedure close to the\nperforation and depends on the shape of the perforation, the constraint $F_x$,\nand the asymptotic behaviour at infinity of the strain energy density $\\sigma$.\nWe give a concise proof of the mathematical result and numerical studies for\nsome simple yet meaningful geometries.\n","subjects":["Mathematics/Analysis of PDEs","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uNv1H9-jVrkZiAXgg37AGfe5qOhh1zS5Fu9KQmNbfks","pdfSize":"7621236","objectId":"0x18391d5c09a02bacbac5e8be8cb8a23d0c612b0a1a568ff7f9e5189b1d31ab8f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
