{"id":"2407.05928","title":"CA-FedRC: Codebook Adaptation via Federated Reservoir Computing in 5G NR","authors":"Ziqiang Ye, Sikai Liao, Yulan Gao, Shu Fang, Yue Xiao, Ming Xiao,\n  Saviour Zammit","authorsParsed":[["Ye","Ziqiang",""],["Liao","Sikai",""],["Gao","Yulan",""],["Fang","Shu",""],["Xiao","Yue",""],["Xiao","Ming",""],["Zammit","Saviour",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 13:34:24 GMT"}],"updateDate":"2024-07-09","timestamp":1720445664000,"abstract":"  With the burgeon deployment of the fifth-generation new radio (5G NR)\nnetworks, the codebook plays a crucial role in enabling the base station (BS)\nto acquire the channel state information (CSI). Different 5G NR codebooks incur\nvarying overheads and exhibit performance disparities under diverse channel\nconditions, necessitating codebook adaptation based on channel conditions to\nreduce feedback overhead while enhancing performance. However, existing methods\nof 5G NR codebooks adaptation require significant overhead for model training\nand feedback or fall short in performance. To address these limitations, this\nletter introduces a federated reservoir computing framework designed for\nefficient codebook adaptation in computationally and feedback\nresource-constrained mobile devices. This framework utilizes a novel series of\nindicators as input training data, striking an effective balance between\nperformance and feedback overhead. Compared to conventional models, the\nproposed codebook adaptation via federated reservoir computing (CA-FedRC),\nachieves rapid convergence and significant loss reduction in both speed and\naccuracy. Extensive simulations under various channel conditions demonstrate\nthat our algorithm not only reduces resource consumption of users but also\naccurately identifies channel types, thereby optimizing the trade-off between\nspectrum efficiency, computational complexity, and feedback overhead.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}