{"id":"2407.15285","title":"New Philosopher Inequalities for Online Bayesian Matching, via Pivotal\n  Sampling","authors":"Mark Braverman, Mahsa Derakhshan, Tristan Pollner, Amin Saberi, David\n  Wajc","authorsParsed":[["Braverman","Mark",""],["Derakhshan","Mahsa",""],["Pollner","Tristan",""],["Saberi","Amin",""],["Wajc","David",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 22:42:58 GMT"}],"updateDate":"2024-07-23","timestamp":1721601778000,"abstract":"  We study the polynomial-time approximability of the optimal online stochastic\nbipartite matching algorithm, initiated by Papadimitriou et al. (EC'21). Here,\nnodes on one side of the graph are given upfront, while at each time $t$, an\nonline node and its edge weights are drawn from a time-dependent distribution.\nThe optimal algorithm is $\\textsf{PSPACE}$-hard to approximate within some\nuniversal constant. We refer to this optimal algorithm, which requires time to\nthink (compute), as a philosopher, and refer to polynomial-time online\napproximations of the above as philosopher inequalities. The best known\nphilosopher inequality for online matching yields a $0.652$-approximation. In\ncontrast, the best possible prophet inequality, or approximation of the optimum\noffline solution, is $0.5$.\n  Our main results are a $0.678$-approximate algorithm and a\n$0.685$-approximation for a vertex-weighted special case. Notably, both bounds\nexceed the $0.666$-approximation of the offline optimum obtained by Tang, Wu,\nand Wu (STOC'22) for the vertex-weighted problem. Building on our algorithms\nand the recent black-box reduction of Banihashem et al. (SODA'24), we provide\npolytime (pricing-based) truthful mechanisms which $0.678$-approximate the\nsocial welfare of the optimal online allocation for bipartite matching markets.\n  Our online allocation algorithm relies on the classic pivotal sampling\nalgorithm (Srinivasan FOCS'01, Gandhi et al. J.ACM'06), along with careful\ndiscarding to obtain negative correlations between offline nodes. Consequently,\nthe analysis boils down to examining the distribution of a weighted sum $X$ of\nnegatively correlated Bernoulli variables, specifically lower bounding its mass\nbelow a threshold, $\\mathbb{E}[\\min(1,X)]$, of possible independent interest.\nInterestingly, our bound relies on an imaginary invocation of pivotal sampling.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZeT3jK--XBMe6WrUtrhFZAS2BKzsTtuebHfoUisjw6c","pdfSize":"1052243"}
