{"id":"2407.04400","title":"Hard-Attention Gates with Gradient Routing for Endoscopic Image\n  Computing","authors":"Giorgio Roffo and Carlo Biffi and Pietro Salvagnini and Andrea\n  Cherubini","authorsParsed":[["Roffo","Giorgio",""],["Biffi","Carlo",""],["Salvagnini","Pietro",""],["Cherubini","Andrea",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 10:20:24 GMT"}],"updateDate":"2024-07-08","timestamp":1720174824000,"abstract":"  To address overfitting and enhance model generalization in\ngastroenterological polyp size assessment, our study introduces\nFeature-Selection Gates (FSG) or Hard-Attention Gates (HAG) alongside Gradient\nRouting (GR) for dynamic feature selection. This technique aims to boost\nConvolutional Neural Networks (CNNs) and Vision Transformers (ViTs) by\npromoting sparse connectivity, thereby reducing overfitting and enhancing\ngeneralization. HAG achieves this through sparsification with learnable\nweights, serving as a regularization strategy. GR further refines this process\nby optimizing HAG parameters via dual forward passes, independently from the\nmain model, to improve feature re-weighting. Our evaluation spanned multiple\ndatasets, including CIFAR-100 for a broad impact assessment and specialized\nendoscopic datasets (REAL-Colon, Misawa, and SUN) focusing on polyp size\nestimation, covering over 200 polyps in more than 370,000 frames. The findings\nindicate that our HAG-enhanced networks substantially enhance performance in\nboth binary and triclass classification tasks related to polyp sizing.\nSpecifically, CNNs experienced an F1 Score improvement to 87.8% in binary\nclassification, while in triclass classification, the ViT-T model reached an F1\nScore of 76.5%, outperforming traditional CNNs and ViT-T models. To facilitate\nfurther research, we are releasing our codebase, which includes implementations\nfor CNNs, multistream CNNs, ViT, and HAG-augmented variants. This resource aims\nto standardize the use of endoscopic datasets, providing public\ntraining-validation-testing splits for reliable and comparable research in\ngastroenterological polyp size estimation. The codebase is available at\ngithub.com/cosmoimd/feature-selection-gates.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}