{"id":"2407.10137","title":"Pattern Guided UV Recovery for Realistic Video Garment Texturing","authors":"Youyi Zhan, Tuanfeng Y. Wang, Tianjia Shao, Kun Zhou","authorsParsed":[["Zhan","Youyi",""],["Wang","Tuanfeng Y.",""],["Shao","Tianjia",""],["Zhou","Kun",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 09:47:37 GMT"}],"updateDate":"2024-07-16","timestamp":1720950457000,"abstract":"  The fast growth of E-Commerce creates a global market worth USD 821 billion\nfor online fashion shopping. What unique about fashion presentation is that,\nthe same design can usually be offered with different cloths textures. However,\nonly real video capturing or manual per-frame editing can be used for virtual\nshowcase on the same design with different textures, both of which are heavily\nlabor intensive. In this paper, we present a pattern-based approach for UV and\nshading recovery from a captured real video so that the garment's texture can\nbe replaced automatically. The core of our approach is a per-pixel UV\nregression module via blended-weight multilayer perceptrons (MLPs) driven by\nthe detected discrete correspondences from the cloth pattern. We propose a\nnovel loss on the Jacobian of the UV mapping to create pleasant seams around\nthe folding areas and the boundary of occluded regions while avoiding UV\ndistortion. We also adopts the temporal constraint to ensure consistency and\naccuracy in UV prediction across adjacent frames. We show that our approach is\nrobust to a variety type of clothes, in the wild illuminations and with\nchallenging motions. We show plausible texture replacement results in our\nexperiment, in which the folding and overlapping of the garment can be greatly\npreserved. We also show clear qualitative and quantitative improvement compared\nto the baselines as well. With the one-click setup, we look forward to our\napproach contributing to the growth of fashion E-commerce.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}