{"id":"2407.18861","title":"Direct numerical simulation of drag reduction in rotating pipe flow up\n  to $Re_{\\tau} \\approx 3000$","authors":"Maochao Xiao, Alessandro Ceci, Paolo Orlandi, and Sergio Pirozzoli","authorsParsed":[["Xiao","Maochao",""],["Ceci","Alessandro",""],["Orlandi","Paolo",""],["Pirozzoli","Sergio",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 16:50:12 GMT"}],"updateDate":"2024-07-29","timestamp":1722012612000,"abstract":"  Direct numerical simulations (DNS) of rotating pipe flows up to $Re_{\\tau}\n\\approx 3000$ are carried out to investigate drag reduction effects associated\nwith axial rotation, extending previous studies carried out at a modest\nReynolds number (Orlandi & Fatica 1997; Orlandi & Ebstein 2000). The results\nshow that the drag reduction, which we theoretically show to be equivalent to\nnet power saving assuming no mechanical losses, monotonically increases as\neither the Reynolds number or the rotation number increases, proportionally to\nthe inner-scaled rotational speed. Net drag reduction up to about $70\\%$ is\nobserved, while being far from flow relaminarisation. Scaling laws for the mean\naxial and azimuthal velocity are proposed, from which a predictive formula for\nthe friction factor is derived. The formula can correctly represent the\ndependency of the friction factor on the Reynolds and rotation numbers,\nmaintaining good accuracy for low-to-moderate rotation numbers. Examination of\nthe turbulent structures highlights the role of rotation in widening and\nelongating the small-scale streaks, with subsequent suppression of sweeps and\nejections. In the core part of the flow, clear weakening of large-scale\nturbulent motions is observed at high Reynolds numbers, with subsequent\nsuppression of the outer-layer peak in the pre-multiplied spectra. The\nFukagata-Iwamoto-Kasagi decomposition indicates that, consistent with a\ntheoretically derived formula, the outer layer yields the largest contribution\nto drag reduction at increasingly high Reynolds numbers. In contrast, both the\ninner and the outer layers contribute to drag reduction as the rotation number\nincreases.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JbKtvHgW8DC6r0cWNzXwZ7x8af1BgGOcVP02ULv9YVc","pdfSize":"10648705","objectId":"0x84f06efc579b8183b04564b09f818fe76d3a27a555b043e7273075745ed69dbd","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
