{"id":"2407.15396","title":"Semantic Diversity-aware Prototype-based Learning for Unbiased Scene\n  Graph Generation","authors":"Jaehyeong Jeon, Kibum Kim, Kanghoon Yoon, Chanyoung Park","authorsParsed":[["Jeon","Jaehyeong",""],["Kim","Kibum",""],["Yoon","Kanghoon",""],["Park","Chanyoung",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 05:53:46 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 12:54:52 GMT"}],"updateDate":"2024-07-26","timestamp":1721627626000,"abstract":"  The scene graph generation (SGG) task involves detecting objects within an\nimage and predicting predicates that represent the relationships between the\nobjects. However, in SGG benchmark datasets, each subject-object pair is\nannotated with a single predicate even though a single predicate may exhibit\ndiverse semantics (i.e., semantic diversity), existing SGG models are trained\nto predict the one and only predicate for each pair. This in turn results in\nthe SGG models to overlook the semantic diversity that may exist in a\npredicate, thus leading to biased predictions. In this paper, we propose a\nnovel model-agnostic Semantic Diversity-aware Prototype-based Learning (DPL)\nframework that enables unbiased predictions based on the understanding of the\nsemantic diversity of predicates. Specifically, DPL learns the regions in the\nsemantic space covered by each predicate to distinguish among the various\ndifferent semantics that a single predicate can represent. Extensive\nexperiments demonstrate that our proposed model-agnostic DPL framework brings\nsignificant performance improvement on existing SGG models, and also\neffectively understands the semantic diversity of predicates.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ie58Cy3wePQ9afGqNK8xY19Dm2nXiZoUdJqJnPuUnes","pdfSize":"2323258","objectId":"0xbae04553a8ca277820860e07ae5f9c2c3322f112e97f160dd030bd2782a89b0c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
