{"id":"2407.05976","title":"Change-Point Detection in Industrial Data Streams based on Online\n  Dynamic Mode Decomposition with Control","authors":"Marek Wadinger, Michal Kvasnica, Yoshinobu Kawahara","authorsParsed":[["Wadinger","Marek",""],["Kvasnica","Michal",""],["Kawahara","Yoshinobu",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 14:18:33 GMT"},{"version":"v2","created":"Mon, 19 Aug 2024 06:20:41 GMT"}],"updateDate":"2024-08-20","timestamp":1720448313000,"abstract":"  We propose a novel change-point detection method based on online Dynamic Mode\nDecomposition with control (ODMDwC). Leveraging ODMDwC's ability to find and\ntrack linear approximation of a non-linear system while incorporating control\neffects, the proposed method dynamically adapts to its changing behavior due to\naging and seasonality. This approach enables the detection of changes in\nspatial, temporal, and spectral patterns, providing a robust solution that\npreserves correspondence between the score and the extent of change in the\nsystem dynamics. We formulate a truncated version of ODMDwC and utilize\nhigher-order time-delay embeddings to mitigate noise and extract broad-band\nfeatures. Our method addresses the challenges faced in industrial settings\nwhere safety-critical systems generate non-uniform data streams while requiring\ntimely and accurate change-point detection to protect profit and life. Our\nresults demonstrate that this method yields intuitive and improved detection\nresults compared to the Singular-Value-Decomposition-based method. We validate\nour approach using synthetic and real-world data, showing its competitiveness\nto other approaches on complex systems' benchmark datasets. Provided guidelines\nfor hyperparameters selection enhance our method's practical applicability.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xU6US35hxjYCFFB6gRAXsE4VmSAzfAIbsKWql82QtdU","pdfSize":"1285596"}
