{"id":"2407.01421","title":"C-MP: A decentralized adaptive-coordinated traffic signal control using\n  the Max Pressure framework","authors":"Tanveer Ahmed, Hao Liu, Vikash V. Gayah","authorsParsed":[["Ahmed","Tanveer",""],["Liu","Hao",""],["Gayah","Vikash V.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 16:10:47 GMT"}],"updateDate":"2024-07-02","timestamp":1719850247000,"abstract":"  Coordinated traffic signals seek to provide uninterrupted flow through a\nseries of closely spaced intersections, typically using pre-defined fixed\nsignal timings and offsets. Adaptive traffic signals dynamically change signal\ntimings based on observed traffic conditions in a way that might disrupt\ncoordinated movements, particularly when these decisions are made independently\nat each intersection. To alleviate this issue, this paper introduces a novel\nMax Pressure-based traffic signal framework that can provide coordination even\nunder decentralized decision-making. The proposed Coordinated Max Pressure\n(C-MP) algorithm uses the space mean speeds of vehicles to explicitly detect\nfreely flowing platoons of vehicles and prioritizes their movement along a\ncorridor. Specifically, upstream platoons are detected and their weight in the\nMP framework increased to provide priority, while downstream platoons are\ndetected and their weight reduced to ensure smooth traffic flow across\ncorridors. The study analytically proves that C-MP maintains the desirable\nmaximum stability property, while micro-simulation analyses conducted on an\narterial network demonstrate its ability to achieve a larger stable region\ncompared to benchmark MP control policies. Simulation results also reveal that\nthe proposed control algorithm can effectively coordinate traffic signals in\nboth directions along an arterial without explicitly assigned offsets or\nconstraints. The results also reveal C-MP's superiority to benchmark\ncoordination strategies in reducing travel time, and fuel consumption both at\nthe corridor level and the network level by balancing the negative impact\nimparted to vehicles in the minor direction.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}