{"id":"2407.17615","title":"Ephemeris Reconstruction for Comet 67P/Churyumov-Gerasimenko During\n  Rosetta Proximity Phase from Radiometric Data Analysis","authors":"Riccardo Lasagni Manghi, Marco Zannoni, Paolo Tortora, Frank Budnik,\n  Bernard Godard, Nicholas Attree","authorsParsed":[["Manghi","Riccardo Lasagni",""],["Zannoni","Marco",""],["Tortora","Paolo",""],["Budnik","Frank",""],["Godard","Bernard",""],["Attree","Nicholas",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 20:04:33 GMT"}],"updateDate":"2024-07-26","timestamp":1721851473000,"abstract":"  This study provides a continuous ephemeris reconstruction for comet\n67P/Churyumov-Gerasimenko by reanalyzing Rosetta radiometric measurements and\nEarth-based astrometry. Given the comet-to-spacecraft relative trajectory\nprovided by the navigation team, these measurements were used to estimate the\ncomet state and some critical physical parameters, most notably the\nnon-gravitational accelerations induced by the outgassing of surface volatiles,\nfor which different models were tested and compared. The reference\nreconstructed ephemeris, which uses a stochastic acceleration model, has\nposition uncertainties below 10 km, 30 km, and 80 km in the orbital radial,\ntangential, and normal directions for the whole duration of the Rosetta\nproximity phase (from July 2014 to October 2016). Furthermore, the solution can\nfit ground-based astrometry between March 2010 and July 2018, covering a\ncomplete heliocentric orbit of 67P. The estimated comet non-gravitational\naccelerations are dominated by the orbital radial and normal components,\nreaching peak values of $(1.28 \\pm 0.17) \\times 10^{-8} \\, \\text{m/s}^2$ and\n$(0.52 \\pm 0.20) \\times 10^{-8} \\, \\text{m/s}^2$, respectively 15 days and 24\ndays after perihelion. Furthermore, the acceleration magnitude is shown to have\na steep dependence on the comet heliocentric distance $\\text{NGA} \\sim\nr_\\odot^{-6}$ and shows asymmetries in the pre- and post-perihelion activities.\nThe estimated acceleration components, agnostic due to the limited physical\nassumptions, could be used as a constraint for future investigations involving\nhigh-fidelity thermophysical models of the comet surface.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UdgWZGw1oVpw6RggMn3QTttoK7zdUvWX9PcBa_8nvkQ","pdfSize":"1446335"}
