{"id":"2407.08537","title":"BriDe Arbitrager: Enhancing Arbitrage in Ethereum 2.0 via\n  Bribery-enabled Delayed Block Production","authors":"Hulin Yang, Mingzhe Li, Jin Zhang, Alia Asheralieva, Qingsong Wei, and\n  Siow Mong Rick Goh","authorsParsed":[["Yang","Hulin",""],["Li","Mingzhe",""],["Zhang","Jin",""],["Asheralieva","Alia",""],["Wei","Qingsong",""],["Goh","Siow Mong Rick",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:26:31 GMT"}],"updateDate":"2024-07-12","timestamp":1720707991000,"abstract":"  The advent of Ethereum 2.0 has introduced significant changes, particularly\nthe shift to Proof-of-Stake consensus. This change presents new opportunities\nand challenges for arbitrage. Amidst these changes, we introduce BriDe\nArbitrager, a novel tool designed for Ethereum 2.0 that leverages\nBribery-driven attacks to Delay block production and increase arbitrage gains.\nThe main idea is to allow malicious proposers to delay block production by\nbribing validators/proposers, thereby gaining more time to identify arbitrage\nopportunities. Through analysing the bribery process, we design an adaptive\nbribery strategy. Additionally, we propose a Delayed Transaction Ordering\nAlgorithm to leverage the delayed time to amplify arbitrage profits for\nmalicious proposers. To ensure fairness and automate the bribery process, we\ndesign and implement a bribery smart contract and a bribery client. As a\nresult, BriDe Arbitrager enables adversaries controlling a limited (< 1/4)\nfraction of the voting powers to delay block production via bribery and\narbitrage more profit. Extensive experimental results based on Ethereum\nhistorical transactions demonstrate that BriDe Arbitrager yields an average of\n8.66 ETH (16,442.23 USD) daily profits. Furthermore, our approach does not\ntrigger any slashing mechanisms and remains effective even under Proposer\nBuilder Separation and other potential mechanisms will be adopted by Ethereum.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}