{"id":"2407.11829","title":"Fate of a remnant solid disk around an eccentric giant planet","authors":"S. Shibata and R. Helled","authorsParsed":[["Shibata","S.",""],["Helled","R.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:17:20 GMT"}],"updateDate":"2024-07-17","timestamp":1721143040000,"abstract":"  The composition of giant planets' atmospheres is an important tracer of their\nformation history. While many theoretical studies investigate the heavy-element\naccretion within a gaseous protoplanetary disk, the possibility of solid\naccretion after disk dissipation has not been explored. Here, we focus on the\ncase of a gas giant planet excited to an eccentric orbit and assess the\nlikelihood of solid accretion after disk dissipation. We perform N-body\nsimulations of planetesimals and embryos around an eccentric giant planet. We\nconsider various sizes and orbits for the eccentric planet and determine the\nfate of planetesimals and embryos. We find that the orbital evolution of\nsolids, such as planetesimals and embryos, is regulated by weak encounters with\nthe eccentric planet rather than strong close encounters. Even in the region\nwhere the Safronov number is smaller than unity, most solid materials fall onto\nthe central star or are ejected from the planetary system. We also develop an\nanalytical model of the solid accretion along the orbital evolution of a giant\nplanet, where the accretion probability is obtained as a function of the\nplanetary mass, radius, semi-major axis, eccentricity, inclination, and solid\ndisk thickness. Our model predicts that $\\sim$0.01-0.1 $M_\\oplus$ of solids is\naccreted onto an eccentric planet orbiting in the outer disk ($\\sim10$ au). The\naccreted heavy-element mass increases (decreases) with the eccentricity\n(inclination) of the planet. We also discuss the possibility of collisions of\nterrestrial planets and find that $\\sim10\\%$ of the hot Jupiters formed via\nhigh-eccentric migration collide with a planet of $10M_\\oplus$. However, we\nfind that solid accretion and collisions with terrestrial planets are minor\nevents for planets in the inner orbit, and a different accretion process is\nrequired to enrich eccentric giant planets with heavy elements.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}