{"id":"2407.12058","title":"Explainable artificial intelligence in breast cancer detection and risk\n  prediction: A systematic scoping review","authors":"Amirehsan Ghasemi, Soheil Hashtarkhani, David L Schwartz, Arash\n  Shaban-Nejad","authorsParsed":[["Ghasemi","Amirehsan",""],["Hashtarkhani","Soheil",""],["Schwartz","David L",""],["Shaban-Nejad","Arash",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 16:53:30 GMT"}],"updateDate":"2024-07-18","timestamp":1720803210000,"abstract":"  With the advances in artificial intelligence (AI), data-driven algorithms are\nbecoming increasingly popular in the medical domain. However, due to the\nnonlinear and complex behavior of many of these algorithms, decision-making by\nsuch algorithms is not trustworthy for clinicians and is considered a black-box\nprocess. Hence, the scientific community has introduced explainable artificial\nintelligence (XAI) to remedy the problem. This systematic scoping review\ninvestigates the application of XAI in breast cancer detection and risk\nprediction. We conducted a comprehensive search on Scopus, IEEE Explore,\nPubMed, and Google Scholar (first 50 citations) using a systematic search\nstrategy. The search spanned from January 2017 to July 2023, focusing on\npeer-reviewed studies implementing XAI methods in breast cancer datasets.\nThirty studies met our inclusion criteria and were included in the analysis.\nThe results revealed that SHapley Additive exPlanations (SHAP) is the top\nmodel-agnostic XAI technique in breast cancer research in terms of usage,\nexplaining the model prediction results, diagnosis and classification of\nbiomarkers, and prognosis and survival analysis. Additionally, the SHAP model\nprimarily explained tree-based ensemble machine learning models. The most\ncommon reason is that SHAP is model agnostic, which makes it both popular and\nuseful for explaining any model prediction. Additionally, it is relatively easy\nto implement effectively and completely suits performant models, such as\ntree-based models. Explainable AI improves the transparency, interpretability,\nfairness, and trustworthiness of AI-enabled health systems and medical devices\nand, ultimately, the quality of care and outcomes.\n","subjects":["Quantitative Biology/Quantitative Methods","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}