{"id":"2407.00595","title":"Fully invertible hyperbolic neural networks for segmenting large-scale\n  surface and sub-surface data","authors":"Bas Peters, Eldad Haber, Keegan Lensink","authorsParsed":[["Peters","Bas",""],["Haber","Eldad",""],["Lensink","Keegan",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 05:35:12 GMT"}],"updateDate":"2024-07-02","timestamp":1719725712000,"abstract":"  The large spatial/temporal/frequency scale of geoscience and remote-sensing\ndatasets causes memory issues when using convolutional neural networks for\n(sub-) surface data segmentation. Recently developed fully reversible or fully\ninvertible networks can mostly avoid memory limitations by recomputing the\nstates during the backward pass through the network. This results in a low and\nfixed memory requirement for storing network states, as opposed to the typical\nlinear memory growth with network depth. This work focuses on a fully\ninvertible network based on the telegraph equation. While reversibility saves\nthe major amount of memory used in deep networks by the data, the convolutional\nkernels can take up most memory if fully invertible networks contain multiple\ninvertible pooling/coarsening layers. We address the explosion of the number of\nconvolutional kernels by combining fully invertible networks with layers that\ncontain the convolutional kernels in a compressed form directly. A second\nchallenge is that invertible networks output a tensor the same size as its\ninput. This property prevents the straightforward application of invertible\nnetworks to applications that map between different input-output dimensions,\nneed to map to outputs with more channels than present in the input data, or\ndesire outputs that decrease/increase the resolution compared to the input\ndata. However, we show that by employing invertible networks in a non-standard\nfashion, we can still use them for these tasks. Examples in hyperspectral\nland-use classification, airborne geophysical surveying, and seismic imaging\nillustrate that we can input large data volumes in one chunk and do not need to\nwork on small patches, use dimensionality reduction, or employ methods that\nclassify a patch to a single central pixel.\n","subjects":["Physics/Geophysics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}