{"id":"2407.08353","title":"One-dimensional flat bands in phosphorene nanoribbons with pentagonal\n  nature","authors":"Shuo Sun, Jing-Yang You, Zhihao Cai, Jie Su, Tong Yang, Xinnan Peng,\n  Yihe Wang, Daiyu Geng, Jian Gou, Yuli Huang, Sisheng Duan, Lan Chen, Kehui\n  Wu, Andrew T. S. Wee, Yuan Ping Feng, Jia Lin Zhang, Jiong Lu, Baojie Feng,\n  and Wei Chen","authorsParsed":[["Sun","Shuo",""],["You","Jing-Yang",""],["Cai","Zhihao",""],["Su","Jie",""],["Yang","Tong",""],["Peng","Xinnan",""],["Wang","Yihe",""],["Geng","Daiyu",""],["Gou","Jian",""],["Huang","Yuli",""],["Duan","Sisheng",""],["Chen","Lan",""],["Wu","Kehui",""],["Wee","Andrew T. S.",""],["Feng","Yuan Ping",""],["Zhang","Jia Lin",""],["Lu","Jiong",""],["Feng","Baojie",""],["Chen","Wei",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 10:05:33 GMT"}],"updateDate":"2024-07-12","timestamp":1720692333000,"abstract":"  Materials with topological flat bands can serve as a promising platform to\ninvestigate strongly interacting phenomena. However, experimental realization\nof ideal flat bands is mostly limited to artificial lattices or moir\\'e\nsystems. Here we report a general way to construct one-dimensional (1D) flat\nbands in phosphorene nanoribbons (PNRs) with pentagonal nature: penta-hexa-PNRs\nand penta-dodeca-PNRs, wherein the corresponding flat bands are directly\nverified by using angle-resolved photoemission spectroscopy. We confirm that\nthe observed 1D flat bands originate from the electronic 1D sawtooth and Lieb\nlattices, respectively, as revealed by the combination of bond-resolved\nscanning tunneling microscopy, scanning tunneling spectroscopy, tight-binding\nmodels, and first-principles calculations. Our study demonstrates a general way\nto construct 1D flat bands in 1D solid materials system, which provides a\nrobust platform to explore strongly interacting phases of matter.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}