{"id":"2407.14227","title":"Circular Dichroism in Multiphoton Ionization of Resonantly Excited\n  Helium Ions near Channel Closing","authors":"Rene Wagner, Markus Ilchen, Nicolas Douguet, Philipp Schmidt, Niclas\n  Wieland, Carlo Callegari, Zachary Delk, Alexander Demidovich, Michele Di\n  Fraia, Jiri Hofbrucker, Michele Manfredda, Valerija Music, Oksana Plekan,\n  Kevin C. Prince, Daniel E. Rivas, Marco Zangrando, Alexei N. Grum-Grzhimailo,\n  Klaus Bartschat, and Michael Meyer","authorsParsed":[["Wagner","Rene",""],["Ilchen","Markus",""],["Douguet","Nicolas",""],["Schmidt","Philipp",""],["Wieland","Niclas",""],["Callegari","Carlo",""],["Delk","Zachary",""],["Demidovich","Alexander",""],["Di Fraia","Michele",""],["Hofbrucker","Jiri",""],["Manfredda","Michele",""],["Music","Valerija",""],["Plekan","Oksana",""],["Prince","Kevin C.",""],["Rivas","Daniel E.",""],["Zangrando","Marco",""],["Grum-Grzhimailo","Alexei N.",""],["Bartschat","Klaus",""],["Meyer","Michael",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 11:54:59 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 12:30:22 GMT"}],"updateDate":"2024-08-09","timestamp":1721390099000,"abstract":"  The circular dichroism (CD) of photoelectrons generated by near-infrared\n(NIR) laser pulses using multiphoton ionization of excited He$^+$ ions in the\n3p(m=+1) state. The ions were prepared by circularly polarized extreme\nultraviolet (XUV) pulses. For circularly polarized NIR pulses co- and\ncounter-rotating relative to the polarization of the XUV pulse, a complex\nvariation of the CD is observed as a result of intensity- and\npolarization-dependent Freeman resonances, with and without additional dichroic\nAC-Stark shifts. The experimental results are compared with numerical solutions\nof the time-dependent Schr\\\"odinger equation to identify and interpret the\npronounced variation of the experimentally observed CD.\n","subjects":["Physics/Atomic Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}