{"id":"2407.00521","title":"A Medical Low-Back Pain Physical Rehabilitation Dataset for Human Body\n  Movement Analysis","authors":"Sao Mai Nguyen and Maxime Devanne and Olivier Remy-Neris and Mathieu\n  Lempereur and Andr\\'e Thepaut","authorsParsed":[["Nguyen","Sao Mai",""],["Devanne","Maxime",""],["Remy-Neris","Olivier",""],["Lempereur","Mathieu",""],["Thepaut","André",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 19:50:06 GMT"}],"updateDate":"2024-07-02","timestamp":1719690606000,"abstract":"  While automatic monitoring and coaching of exercises are showing encouraging\nresults in non-medical applications, they still have limitations such as errors\nand limited use contexts. To allow the development and assessment of physical\nrehabilitation by an intelligent tutoring system, we identify in this article\nfour challenges to address and propose a medical dataset of clinical patients\ncarrying out low back-pain rehabilitation exercises. The dataset includes 3D\nKinect skeleton positions and orientations, RGB videos, 2D skeleton data, and\nmedical annotations to assess the correctness, and error classification and\nlocalisation of body part and timespan. Along this dataset, we perform a\ncomplete research path, from data collection to processing, and finally a small\nbenchmark. We evaluated on the dataset two baseline movement recognition\nalgorithms, pertaining to two different approaches: the probabilistic approach\nwith a Gaussian Mixture Model (GMM), and the deep learning approach with a\nLong-Short Term Memory (LSTM).\n  This dataset is valuable because it includes rehabilitation relevant motions\nin a clinical setting with patients in their rehabilitation program, using a\ncost-effective, portable, and convenient sensor, and because it shows the\npotential for improvement on these challenges.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}