{"id":"2407.10101","title":"WING: Wheel-Inertial Neural Odometry with Ground Manifold Constraints","authors":"Chenxing Jiang, Kunyi Zhang, Sheng Yang, Shaojie Shen, Chao Xu, Fei\n  Gao","authorsParsed":[["Jiang","Chenxing",""],["Zhang","Kunyi",""],["Yang","Sheng",""],["Shen","Shaojie",""],["Xu","Chao",""],["Gao","Fei",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 06:55:36 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 14:44:37 GMT"}],"updateDate":"2024-07-24","timestamp":1720940136000,"abstract":"  In this paper, we propose an interoceptive-only odometry system for ground\nrobots with neural network processing and soft constraints based on the\nassumption of a globally continuous ground manifold. Exteroceptive sensors such\nas cameras, GPS and LiDAR may encounter difficulties in scenarios with poor\nillumination, indoor environments, dusty areas and straight tunnels. Therefore,\nimproving the pose estimation accuracy only using interoceptive sensors is\nimportant to enhance the reliability of navigation system even in degrading\nscenarios mentioned above. However, interoceptive sensors like IMU and wheel\nencoders suffer from large drift due to noisy measurements. To overcome these\nchallenges, the proposed system trains deep neural networks to correct the\nmeasurements from IMU and wheel encoders, while considering their uncertainty.\nMoreover, because ground robots can only travel on the ground, we model the\nground surface as a globally continuous manifold using a dual cubic B-spline\nmanifold to further improve the estimation accuracy by this soft constraint. A\nnovel space-based sliding-window filtering framework is proposed to fully\nexploit the $C^2$ continuity of ground manifold soft constraints and fuse all\nthe information from raw measurements and neural networks in a yaw-independent\nattitude convention. Extensive experiments demonstrate that our proposed\napproach can outperform state-of-the-art learning-based interoceptive-only\nodometry methods.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rsbn-NRj-HCkg-J0nUBdnKKXjGK15xOQ-jVlRusMZBk","pdfSize":"10490554"}
