{"id":"2407.13827","title":"A novel translationally invariant supersymmetric chain with\n  inverse-square interactions: partition function, thermodynamics and\n  criticality","authors":"Bireswar Basu-Mallick, Federico Finkel, Artemio Gonz\\'alez-L\\'opez","authorsParsed":[["Basu-Mallick","Bireswar",""],["Finkel","Federico",""],["González-López","Artemio",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 18:00:20 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 17:25:57 GMT"}],"updateDate":"2024-07-23","timestamp":1721325620000,"abstract":"  We introduce a novel family of translationally-invariant su$(m|n)$\nsupersymmetric spin chains with long-range interaction not directly associated\nto a root system. We study the symmetries of these models, establishing in\nparticular the existence of a boson-fermion duality characteristic of this type\nof systems. Taking advantage of the relation of the new chains with an\nassociated many-body supersymmetric spin dynamical model, we are able to\ncompute their partition function in closed form for all values of $m$ and $n$\nand for an arbitrary number of spins. When both $m$ and $n$ are even, we show\nthat the partition function factorizes as the product of the partition\nfunctions of two supersymmetric Haldane-Shastry spin chains, which in turn\nleads to a simple expression for the thermodynamic free energy per spin in\nterms of the Perron eigenvalue of a suitable transfer matrix. We use this\nexpression to study the thermodynamics of a large class of these chains,\nshowing in particular that the specific heat presents a single Schottky peak at\napproximately the same temperature as a suitable $k$-level model. We also\nanalyze the critical behavior of the new chains, and in particular the ground\nstate degeneracy and the existence of low energy excitations with a linear\nenergy-momentum dispersion relation. In this way we are able to show that the\nonly possible critical chains are the ones with $m=0,1,2$. In addition, using\nthe explicit formula for the partition function we are able to establish the\ncriticality of the su$(0|n)$ and su$(2|n)$ chains with even $n$, and to\nevaluate the central charge of their associated conformal field theory.\n","subjects":["Condensed Matter/Statistical Mechanics","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Nonlinear Sciences/Exactly Solvable and Integrable Systems","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}