{"id":"2407.20015","title":"Reducing instrumental errors in Parkes Pulsar Timing Array data","authors":"Axl F. Rogers, Willem van Straten, Sergei Gulyaev, Aditya\n  Parthasarathy, George Hobbs, Zu-Cheng Chen, Yi Feng, Boris Goncharov, Agastya\n  Kapur, Xiaojin Liu, Daniel Reardon, Christopher J. Russell, and Andrew Zic","authorsParsed":[["Rogers","Axl F.",""],["van Straten","Willem",""],["Gulyaev","Sergei",""],["Parthasarathy","Aditya",""],["Hobbs","George",""],["Chen","Zu-Cheng",""],["Feng","Yi",""],["Goncharov","Boris",""],["Kapur","Agastya",""],["Liu","Xiaojin",""],["Reardon","Daniel",""],["Russell","Christopher J.",""],["Zic","Andrew",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:48:19 GMT"}],"updateDate":"2024-07-30","timestamp":1722260899000,"abstract":"  This paper demonstrates the impact of state-of-the-art instrumental\ncalibration techniques on the precision of arrival times obtained from 9.6\nyears of observations of millisecond pulsars using the Murriyang 64-m CSIRO\nParkes Radio Telescope. Our study focuses on 21-cm observations of 25\nhigh-priority pulsars that are regularly observed as part of the Parkes Pulsar\nTiming Array (PPTA) project, including those predicted to be the most\nsusceptible to calibration errors. We employ Measurement Equation Template\nMatching (METM) for instrumental calibration and Matrix Template Matching (MTM)\nfor arrival time estimation, resulting in significantly improved timing\nresiduals with up to a sixfold reduction in white noise compared to arrival\ntimes estimated using Scalar Template Matching and conventional calibration\nbased on the Ideal Feed Assumption. The median relative reduction in white\nnoise is 33 percent, and the maximum absolute reduction is 4.5 microseconds.\nFor PSR J0437-4715, METM and MTM reduce the best-fit power-law amplitude (2.7\nsigma) and spectral index (1.7 sigma) of the red noise in the arrival time\nresiduals, which can can be tentatively interpreted as mitigation of 1/f noise\ndue to otherwise unmodeled steps in polarimetric response. These findings\ndemonstrate the potential to directly enhance the sensitivity of pulsar timing\narray experiments through more accurate methods of instrumental calibration and\narrival time estimation.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}