{"id":"2407.01732","title":"Investigating Nudges toward Related Sellers on E-commerce Marketplaces:\n  A Case Study on Amazon","authors":"Abhisek Dash, Abhijnan Chakraborty, Saptarshi Ghosh, Animesh\n  Mukherjee, Krishna P. Gummadi","authorsParsed":[["Dash","Abhisek",""],["Chakraborty","Abhijnan",""],["Ghosh","Saptarshi",""],["Mukherjee","Animesh",""],["Gummadi","Krishna P.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 19:05:40 GMT"}],"updateDate":"2024-07-03","timestamp":1719860740000,"abstract":"  E-commerce marketplaces provide business opportunities to millions of sellers\nworldwide. Some of these sellers have special relationships with the\nmarketplace by virtue of using their subsidiary services (e.g., fulfillment\nand/or shipping services provided by the marketplace) -- we refer to such\nsellers collectively as Related Sellers. When multiple sellers offer to sell\nthe same product, the marketplace helps a customer in selecting an offer (by a\nseller) through (a) a default offer selection algorithm, (b) showing features\nabout each of the offers and the corresponding sellers (price, seller\nperformance metrics, seller's number of ratings etc.), and (c) finally\nevaluating the sellers along these features. In this paper, we perform an\nend-to-end investigation into how the above apparatus can nudge customers\ntoward the Related Sellers on Amazon's four different marketplaces in India,\nUSA, Germany and France. We find that given explicit choices, customers'\npreferred offers and algorithmically selected offers can be significantly\ndifferent. We highlight that Amazon is adopting different performance metric\nevaluation policies for different sellers, potentially benefiting Related\nSellers. For instance, such policies result in notable discrepancy between the\nactual performance metric and the presented performance metric of Related\nSellers. We further observe that among the seller-centric features visible to\ncustomers, sellers' number of ratings influences their decisions the most, yet\nit may not reflect the true quality of service by the seller, rather reflecting\nthe scale at which the seller operates, thereby implicitly steering customers\ntoward larger Related Sellers. Moreover, when customers are shown the rectified\nmetrics for the different sellers, their preference toward Related Sellers is\nalmost halved.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}