{"id":"2407.00140","title":"ModeConv: A Novel Convolution for Distinguishing Anomalous and Normal\n  Structural Behavior","authors":"Melanie Schaller and Daniel Schl\\\"or and Andreas Hotho","authorsParsed":[["Schaller","Melanie",""],["Schlör","Daniel",""],["Hotho","Andreas",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 14:46:17 GMT"}],"updateDate":"2024-07-02","timestamp":1719585977000,"abstract":"  External influences such as traffic and environmental factors induce\nvibrations in structures, leading to material degradation over time. These\nvibrations result in cracks due to the material's lack of plasticity\ncompromising structural integrity. Detecting such damage requires the\ninstallation of vibration sensors to capture the internal dynamics. However,\ndistinguishing relevant eigenmodes from external noise necessitates the use of\nDeep Learning models. The detection of changes in eigenmodes can be used to\nanticipate these shifts in material properties and to discern between normal\nand anomalous structural behavior. Eigenmodes, representing characteristic\nvibration patterns, provide insights into structural dynamics and deviations\nfrom expected states. Thus, we propose ModeConv to automatically capture and\nanalyze changes in eigenmodes, facilitating effective anomaly detection in\nstructures and material properties. In the conducted experiments, ModeConv\ndemonstrates computational efficiency improvements, resulting in reduced\nruntime for model calculations. The novel ModeConv neural network layer is\ntailored for temporal graph neural networks, in which every node represents one\nsensor. ModeConv employs a singular value decomposition based convolutional\nfilter design for complex numbers and leverages modal transformation in lieu of\nFourier or Laplace transformations in spectral graph convolutions. We include a\nmathematical complexity analysis illustrating the runtime reduction.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}