{"id":"2407.02407","title":"Emergence of spin-phonon coupling in Gd-doped Y$_2$CoMnO$_6$ double\n  perovskite oxide: a combined experimental and ab-initio study","authors":"Anasua Khan, Debdatta Banerjee, Divya Rawat, T.K Nath, Ajay Soni,\n  Swastika Chatterjee and A.Taraphder","authorsParsed":[["Khan","Anasua",""],["Banerjee","Debdatta",""],["Rawat","Divya",""],["Nath","T. K",""],["Soni","Ajay",""],["Chatterjee","Swastika",""],["Taraphder","A.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 16:30:58 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 17:26:34 GMT"}],"updateDate":"2024-07-26","timestamp":1719937858000,"abstract":"  One of the fundamental interactions that is found in many functional\nmaterials is the spin-phonon coupling (SPC), which is at the heart of many\nnovel functionalities. The simultaneous presence of multi-magnetic phases makes\nSPC even more intriguing. We have used Raman spectroscopy as well as\nfirst-principles methods to investigate the possibility of the appearance of\nSPC in Gd-doped Y$_2$CoMnO$_6$ (YGCMO) double perovskite oxide and the\ninfluence of anti-site disorder on the same. YGCMO is found to exhibit\nanti-site disorder leading to both ferromagnetic (between Co and Mn) and\nanti-ferromagnetic interactions (Co-Co, Mn-Mn, Gd-Co/Mn). An analysis of the\ntemperature-dependent phonon frequency for the stretching modes of YGCMO,\nobtained using RAMAN spectroscopy, indicates that SPC is possibly emerging from\nsimultaneous presence of ferromagnetic and antiferromagnetic interactions. The\nnature of the phonon linewidth and the insulating state of the material\neliminate the role of magnetostriction on the observed anomaly. The spin-phonon\ncoupling strength comes out to be 0.29 cm$^{-1}$. Our experimental findings are\ncorroborated by first-principles DFT calculations which indicate the presence\nof SPC in ordered YGCMO getting enhanced in the presence of anti-site disorder.\nThis indicates a strong influence of B-site (Co/Mn) ordering on SPC in the bulk\ndouble perovskite systems. An analysis of the cause behind the enhanced SPC in\nthe presence of anti-site disorder is also presented.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}