{"id":"2407.12317","title":"Out of Length Text Recognition with Sub-String Matching","authors":"Yongkun Du and Zhineng Chen and Caiyan Jia and Xieping Gao and Yu-Gang\n  Jiang","authorsParsed":[["Du","Yongkun",""],["Chen","Zhineng",""],["Jia","Caiyan",""],["Gao","Xieping",""],["Jiang","Yu-Gang",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 05:02:17 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 11:36:52 GMT"}],"updateDate":"2024-08-14","timestamp":1721192537000,"abstract":"  Scene Text Recognition (STR) methods have demonstrated robust performance in\nword-level text recognition. However, in real applications the text image is\nsometimes long due to detected with multiple horizontal words. It triggers the\nrequirement to build long text recognition models from readily available short\n(i.e., word-level) text datasets, which has been less studied previously. In\nthis paper, we term this task Out of Length (OOL) text recognition. We\nestablish the first Long Text Benchmark (LTB) to facilitate the assessment of\ndifferent methods in long text recognition. Meanwhile, we propose a novel\nmethod called OOL Text Recognition with sub-String Matching (SMTR). SMTR\ncomprises two cross-attention-based modules: one encodes a sub-string\ncontaining multiple characters into next and previous queries, and the other\nemploys the queries to attend to the image features, matching the sub-string\nand simultaneously recognizing its next and previous character. SMTR can\nrecognize text of arbitrary length by iterating the process above. To avoid\nbeing trapped in recognizing highly similar sub-strings, we introduce a\nregularization training to compel SMTR to effectively discover subtle\ndifferences between similar sub-strings for precise matching. In addition, we\npropose an inference augmentation strategy to alleviate confusion caused by\nidentical sub-strings in the same text and improve the overall recognition\nefficiency. Extensive experimental results reveal that SMTR, even when trained\nexclusively on short text, outperforms existing methods in public short text\nbenchmarks and exhibits a clear advantage on LTB. Code:\nhttps://github.com/Topdu/OpenOCR.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}