{"id":"2407.06863","title":"Beyond Aesthetics: Cultural Competence in Text-to-Image Models","authors":"Nithish Kannen, Arif Ahmad, Marco Andreetto, Vinodkumar Prabhakaran,\n  Utsav Prabhu, Adji Bousso Dieng, Pushpak Bhattacharyya, Shachi Dave","authorsParsed":[["Kannen","Nithish",""],["Ahmad","Arif",""],["Andreetto","Marco",""],["Prabhakaran","Vinodkumar",""],["Prabhu","Utsav",""],["Dieng","Adji Bousso",""],["Bhattacharyya","Pushpak",""],["Dave","Shachi",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 13:50:43 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 17:57:37 GMT"},{"version":"v3","created":"Wed, 24 Jul 2024 18:09:48 GMT"},{"version":"v4","created":"Sun, 4 Aug 2024 08:28:25 GMT"}],"updateDate":"2024-08-06","timestamp":1720533043000,"abstract":"  Text-to-Image (T2I) models are being increasingly adopted in diverse global\ncommunities where they create visual representations of their unique cultures.\nCurrent T2I benchmarks primarily focus on faithfulness, aesthetics, and realism\nof generated images, overlooking the critical dimension of cultural competence.\nIn this work, we introduce a framework to evaluate cultural competence of T2I\nmodels along two crucial dimensions: cultural awareness and cultural diversity,\nand present a scalable approach using a combination of structured knowledge\nbases and large language models to build a large dataset of cultural artifacts\nto enable this evaluation. In particular, we apply this approach to build CUBE\n(CUltural BEnchmark for Text-to-Image models), a first-of-its-kind benchmark to\nevaluate cultural competence of T2I models. CUBE covers cultural artifacts\nassociated with 8 countries across different geo-cultural regions and along 3\nconcepts: cuisine, landmarks, and art. CUBE consists of 1) CUBE-1K, a set of\nhigh-quality prompts that enable the evaluation of cultural awareness, and 2)\nCUBE-CSpace, a larger dataset of cultural artifacts that serves as grounding to\nevaluate cultural diversity. We also introduce cultural diversity as a novel\nT2I evaluation component, leveraging quality-weighted Vendi score. Our\nevaluations reveal significant gaps in the cultural awareness of existing\nmodels across countries and provide valuable insights into the cultural\ndiversity of T2I outputs for under-specified prompts. Our methodology is\nextendable to other cultural regions and concepts, and can facilitate the\ndevelopment of T2I models that better cater to the global population.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}