{"id":"2407.05205","title":"The AI Companion in Education: Analyzing the Pedagogical Potential of\n  ChatGPT in Computer Science and Engineering","authors":"Zhangying He, Thomas Nguyen, Tahereh Miari, Mehrdad Aliasgari, Setareh\n  Rafatirad, Hossein Sayadi","authorsParsed":[["He","Zhangying",""],["Nguyen","Thomas",""],["Miari","Tahereh",""],["Aliasgari","Mehrdad",""],["Rafatirad","Setareh",""],["Sayadi","Hossein",""]],"versions":[{"version":"v1","created":"Tue, 23 Apr 2024 21:42:30 GMT"}],"updateDate":"2024-07-09","timestamp":1713908550000,"abstract":"  Artificial Intelligence (AI), with ChatGPT as a prominent example, has\nrecently taken center stage in various domains including higher education,\nparticularly in Computer Science and Engineering (CSE). The AI revolution\nbrings both convenience and controversy, offering substantial benefits while\nlacking formal guidance on their application. The primary objective of this\nwork is to comprehensively analyze the pedagogical potential of ChatGPT in CSE\neducation, understanding its strengths and limitations from the perspectives of\neducators and learners. We employ a systematic approach, creating a diverse\nrange of educational practice problems within CSE field, focusing on various\nsubjects such as data science, programming, AI, machine learning, networks, and\nmore. According to our examinations, certain question types, like conceptual\nknowledge queries, typically do not pose significant challenges to ChatGPT, and\nthus, are excluded from our analysis. Alternatively, we focus our efforts on\ndeveloping more in-depth and personalized questions and project-based tasks.\nThese questions are presented to ChatGPT, followed by interactions to assess\nits effectiveness in delivering complete and meaningful responses. To this end,\nwe propose a comprehensive five-factor reliability analysis framework to\nevaluate the responses. This assessment aims to identify when ChatGPT excels\nand when it faces challenges. Our study concludes with a correlation analysis,\ndelving into the relationships among subjects, task types, and limiting\nfactors. This analysis offers valuable insights to enhance ChatGPT's utility in\nCSE education, providing guidance to educators and students regarding its\nreliability and efficacy.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}