{"id":"2407.20061","title":"Autonomous Bootstrapping of Quantum Dot Devices","authors":"Anton Zubchenko, Danielle Middlebrooks, Torbj{\\o}rn Rasmussen, Lara\n  Lausen, Ferdinand Kuemmeth, Anasua Chatterjee, and Justyna P. Zwolak","authorsParsed":[["Zubchenko","Anton",""],["Middlebrooks","Danielle",""],["Rasmussen","Torbjørn",""],["Lausen","Lara",""],["Kuemmeth","Ferdinand",""],["Chatterjee","Anasua",""],["Zwolak","Justyna P.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 14:47:46 GMT"}],"updateDate":"2024-07-30","timestamp":1722264466000,"abstract":"  Semiconductor quantum dots (QD) are a promising platform for multiple\ndifferent qubit implementations, all of which are voltage-controlled by\nprogrammable gate electrodes. However, as the QD arrays grow in size and\ncomplexity, tuning procedures that can fully autonomously handle the increasing\nnumber of control parameters are becoming essential for enabling scalability.\nWe propose a bootstrapping algorithm for initializing a depletion mode QD\ndevice in preparation for subsequent phases of tuning. During bootstrapping,\nthe QD device functionality is validated, all gates are characterized, and the\nQD charge sensor is made operational. We demonstrate the bootstrapping protocol\nin conjunction with a coarse tuning module, showing that the combined algorithm\ncan efficiently and reliably take a cooled-down QD device to a desired global\nstate configuration in under 8 minutes with a success rate of 96 %.\nImportantly, by following heuristic approaches to QD device initialization and\ncombining the efficient ray-based measurement with the rapid radio-frequency\nreflectometry measurements, the proposed algorithm establishes a reference in\nterms of performance, reliability, and efficiency against which alternative\nalgorithms can be benchmarked.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Computing Research Repository/Emerging Technologies","Computing Research Repository/Machine Learning","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}