{"id":"2407.07153","title":"Association of the IceCube neutrinos with blazars in the CGRaBS sample","authors":"Pouya M. Kouch, Elina Lindfors, Talvikki Hovatta, Ioannis Liodakis,\n  Karri I.I. Koljonen, Kari Nilsson, Sebastian Kiehlmann, Walter Max-Moerbeck,\n  Anthony C.S. Readhead, Rodrigo A. Reeves, Timothy J. Pearson, Jenni\n  Jormanainen, Vandad Fallah Ramazani, Matthew J. Graham","authorsParsed":[["Kouch","Pouya M.",""],["Lindfors","Elina",""],["Hovatta","Talvikki",""],["Liodakis","Ioannis",""],["Koljonen","Karri I. I.",""],["Nilsson","Kari",""],["Kiehlmann","Sebastian",""],["Max-Moerbeck","Walter",""],["Readhead","Anthony C. S.",""],["Reeves","Rodrigo A.",""],["Pearson","Timothy J.",""],["Jormanainen","Jenni",""],["Ramazani","Vandad Fallah",""],["Graham","Matthew J.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-11","timestamp":1720548003000,"abstract":"  The origin of high-energy (HE) astrophysical neutrinos has remained an\nelusive hot topic in the field of HE astrophysics for the past decade. Apart\nfrom a handful of individual associations, the vast majority of HE neutrinos\narise from unknown sources. While there are theoretically-motivated candidate\npopulations, such as blazars -- a subclass of AGN with jets pointed towards our\nline-of-sight -- they have not yet been convincingly linked to HE neutrino\nproduction. Here, we perform a spatio-temporal association analysis between a\nsample of blazars (from CGRaBS catalog) in the radio and optical bands and the\nmost up-to-date IceCube HE neutrino catalog. We find that if the IceCube error\nregions are enlarged by 1$^\\circ$ in quadrature, to account for unknown\nsystematic errors at maximal level, a spatio-temporal correlation between the\nmultiwavelength light curves of the CGRaBS blazars and the IceCube HE neutrinos\nis hinted at least at a 2.17$\\sigma$ significance level. On the other hand,\nwhen the IceCube error regions are taken as their published values, we do not\nfind any significant correlations. A discrepancy in the blazar-neutrino\ncorrelation strengths, when using such minimal and enlarged error region\nscenarios, was also obtained in a recent study by the IceCube collaboration. In\nour study, this difference arises because several flaring blazars -- coinciding\nwith a neutrino arrival time -- happen to narrowly miss the published\n90\\%-likelihood error region of the nearest neutrino event. For all of the\nassociations driving our most significant correlations, the flaring blazar is\nmuch less than 1$^\\circ$ away from the published error regions. Therefore, our\nresults indicate that the question of the blazar-neutrino connection is highly\nsensitive to the reconstruction of the neutrino error regions, whose\nreliability is expected to improve with the next generation of neutrino\nobservatories.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}