{"id":"2407.15036","title":"AsyCo: An Asymmetric Dual-task Co-training Model for Partial-label\n  Learning","authors":"Beibei Li, Yiyuan Zheng, Beihong Jin, Tao Xiang, Haobo Wang, Lei Feng","authorsParsed":[["Li","Beibei",""],["Zheng","Yiyuan",""],["Jin","Beihong",""],["Xiang","Tao",""],["Wang","Haobo",""],["Feng","Lei",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 02:08:51 GMT"}],"updateDate":"2024-07-23","timestamp":1721527731000,"abstract":"  Partial-Label Learning (PLL) is a typical problem of weakly supervised\nlearning, where each training instance is annotated with a set of candidate\nlabels. Self-training PLL models achieve state-of-the-art performance but\nsuffer from error accumulation problem caused by mistakenly disambiguated\ninstances. Although co-training can alleviate this issue by training two\nnetworks simultaneously and allowing them to interact with each other, most\nexisting co-training methods train two structurally identical networks with the\nsame task, i.e., are symmetric, rendering it insufficient for them to correct\neach other due to their similar limitations. Therefore, in this paper, we\npropose an asymmetric dual-task co-training PLL model called AsyCo, which\nforces its two networks, i.e., a disambiguation network and an auxiliary\nnetwork, to learn from different views explicitly by optimizing distinct tasks.\nSpecifically, the disambiguation network is trained with self-training PLL task\nto learn label confidence, while the auxiliary network is trained in a\nsupervised learning paradigm to learn from the noisy pairwise similarity labels\nthat are constructed according to the learned label confidence. Finally, the\nerror accumulation problem is mitigated via information distillation and\nconfidence refinement. Extensive experiments on both uniform and\ninstance-dependent partially labeled datasets demonstrate the effectiveness of\nAsyCo. The code is available at https://github.com/libeibeics/AsyCo.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"46NbeRTJaGuT33xH5S0S2vQh4Ziio2OOjup5lCuGQY8","pdfSize":"1310794"}
