{"id":"2407.08104","title":"Motion of a weakly charged rotating black hole in a homogeneous\n  electromagnetic field","authors":"Valeri P. Frolov, Alex Koek","authorsParsed":[["Frolov","Valeri P.",""],["Koek","Alex",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 00:26:52 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 17:01:20 GMT"},{"version":"v3","created":"Mon, 2 Sep 2024 02:01:07 GMT"}],"updateDate":"2024-09-18","timestamp":1720657612000,"abstract":"  In this paper we consider a rotating black hole with electric and magnetic\nmonopole charges that moves in a static homogeneous electromagnetic field. We\nassume that both the charges and the fields are weak, so that they have no\neffect on the spacetime geometry, which is described by the Kerr metric. We\npresent exact solutions to Maxwell's equations describing the field of a\ncharged rotating black hole moving in an external field background. We use\nthese solutions to calculate the energy, momentum, and angular momentum fluxes\nof the electromagnetic field into the black hole. Using these results, we\nobtain expressions for the torque and force acting on the moving charged\nrotating black hole arising as a result of its interaction with the external\nelectromagnetic field. We calculate these quantities both in the frame comoving\nwith the black hole and in the frame of the external background field. We use\nthis result to derive the equations that govern the change in the black hole's\nmass and spin, as well as the motion of the black hole. We provide exact\nsolutions for specific cases which illustrate the role of charge and spin on\nthe motion of the black hole.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wY_goJHN2WryDuLY8hd_LWW4_oiDHjDw4CDvVCrxO1o","pdfSize":"233081","objectId":"0x382533833b0dfff9315575b7bcafdc63c00811a5376b3295339b43c4b5ff5413","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
