{"id":"2407.07149","title":"Iron Snails: non-equilibrium dynamics and spiral abundance patterns","authors":"Neige Frankel, David W. Hogg, Scott Tremaine, Adrian Price-Whelan,\n  Jeff Shen","authorsParsed":[["Frankel","Neige",""],["Hogg","David W.",""],["Tremaine","Scott",""],["Price-Whelan","Adrian",""],["Shen","Jeff",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-11","timestamp":1720548001000,"abstract":"  Galaxies are not in a dynamical steady state. They continually undergo\nperturbations, e.g., from infalling dwarf galaxies and dark-matter\nsubstructure. After a dynamical perturbation, stars phase mix towards a new\nsteady state; in so doing they generally form spiral structures, such as spiral\ndensity waves in galaxy disks and the Gaia Snail observed in the vertical\nphase-space density in the solar neighborhood. Structures in phase-space\ndensity can be hard to measure accurately, because spatially varying selection\neffects imprint their own patterns on the density. However, stellar labels such\nas metallicity, or other element abundances, or stellar masses and ages, can be\nmeasured even in the face of complex or unknown spatial selection functions. We\nshow that if the equilibrium galaxy has phase-space gradients in these labels,\nany perturbation that could raise a spiral wave in the phase-space density will\nraise a spiral wave in the distribution of labels as well. We work out the\nrelationship between the spiral patterns in the density and in the labels. As\nan example, we analyze the Gaia Snail and show that its amplitude and dynamical\nage as derived from elemental abundances (mainly [Mg/Fe]) follow similar\npatterns to those derived from the phase-space density. Our best model dates\nthe Snail's perturbation to about 400 Myr ago although we find significant\nvariations with angular momentum in the best-fit age. Conceptually, the ideas\npresented here are related to Orbital Torus Imaging, chemical tagging, and\nother methods that use stellar labels to trace dynamics.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NhEqIF6-cVGx_0BaJlyCOlCvpgj6OsCt-3Uv9ajgkXw","pdfSize":"1587202"}
