{"id":"2407.08798","title":"Electronically-driven switching of topology in LaSbTe","authors":"J. Bannies, M. Michiardi, H.-H. Kung, S. Godin, J. W. Simonson, M.\n  Oudah, M. Zonno, S. Gorovikov, S. Zhdanovich, I. S. Elfimov, A. Damascelli,\n  M. C. Aronson","authorsParsed":[["Bannies","J.",""],["Michiardi","M.",""],["Kung","H. -H.",""],["Godin","S.",""],["Simonson","J. W.",""],["Oudah","M.",""],["Zonno","M.",""],["Gorovikov","S.",""],["Zhdanovich","S.",""],["Elfimov","I. S.",""],["Damascelli","A.",""],["Aronson","M. C.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 18:14:37 GMT"}],"updateDate":"2024-07-15","timestamp":1720721677000,"abstract":"  In the past two decades, various classes of topological materials have been\ndiscovered, spanning topological insulators, semimetals, and metals. While the\nobservation and understanding of the topology of a material has been a primary\nfocus so far, the precise and easy control of topology in a single material\nremains largely unexplored. Here, we demonstrate full experimental control over\nthe topological Dirac nodal loop in the square-net material\nLaSb$_\\mathrm{x}$Te$_\\mathrm{2-x}$ by chemical substitution and electron\ndoping. Using angle-resolved photoemission spectroscopy (ARPES), we show that\nchanging the antimony concentration x from 0.9 to 1.0 in the bulk opens a gap\nas large as 400 meV in the nodal loop. Our symmetry analysis based on\nsingle-crystal X-ray diffraction and a minimal tight binding model establishes\nthat the breaking of \\textit{n} glide symmetry in the square-net layer is\nresponsible for the opening of the gap. Remarkably, we can also realize this\ntopological phase transition \\textit{in situ} on the surface of\nLaSb$_\\mathrm{x}$Te$_\\mathrm{2-x}$ by chemical gating using potassium\ndeposition, which enables the reversible switching of the topology from gapped\nto gapless nodal loop. The underlying control parameter for the structural and\ntopological transition in the bulk and on the surface is the electron\nconcentration. It opens a pathway towards applications in devices based on\nswitching topology by electrostatic gating.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}