{"id":"2407.13845","title":"Multi-Tier Tournaments: Matching and Scoring Players","authors":"Steven J. Brams and Mehmet S. Ismail","authorsParsed":[["Brams","Steven J.",""],["Ismail","Mehmet S.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 18:29:35 GMT"}],"updateDate":"2024-07-22","timestamp":1721327375000,"abstract":"  We introduce a novel system of matching and scoring players in tournaments,\ncalled Multi-Tier Tournaments, illustrated by chess and based on the following\nrules:\n  1. Players are divided into skill-based tiers, based on their Elo ratings.\n  2. Starting with one or more mini-tournaments of the least skilled players\n(Tier 1), the winner or winners -- after playing multiple opponents -- move to\nthe next-higher tier.\n  3. The winners progress to a final tier of the best-performing players from\nlower tiers as well as players with the highest Elo ratings.\n  4. Performance in each tier is given by a player's Tournament Score (TS),\nwhich depends on his/her wins, losses, and draws (not on his/her Elo rating).\n  Whereas a player's Elo rating determines in which mini-tournament he/she\nstarts play, TS and its associated tie-breaking rules determine whether a\nplayer moves up to higher tiers and, in the final mini-tournament, wins the\ntournament. This combination of players' past Elo ratings and current TS's\nprovides a fair and accurate measure of a player's standing among the players\nin the tournament. We apply a variation of Multi-Tier Tournaments to the top 20\nactive chess players in the world (as of February 2024). Using a dataset of\n1209 head-to-head games, we illustrate the viability of giving lower-rated\nplayers the opportunity to progress and challenge higher-rated players. We also\nbriefly discuss the application of Multi-Tier Tournaments to baseball, soccer,\nand other sports that emphasize physical rather than mental skills.\n","subjects":["Economics/Theoretical Economics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}