{"id":"2407.08616","title":"GA-NIFS: the interplay between merger, star formation and chemical\n  enrichment in MACS1149-JD1 at z=9.11 with JWST/NIRSpec","authors":"Cosimo Marconcini, Francesco D'Eugenio, Roberto Maiolino, Santiago\n  Arribas, Andrew J. Bunker, Stefano Carniani, Stephane Charlot, Michele Perna,\n  Bruno Rodriguez Del Pino, Hannah Ubler, Chris J. Willott, Torsten Boker,\n  Giovanni Cresci, Mirko Curti, Gareth C. Jones, Isabella Lamperti, Eleonora\n  Parlanti, Giacomo Venturi","authorsParsed":[["Marconcini","Cosimo",""],["D'Eugenio","Francesco",""],["Maiolino","Roberto",""],["Arribas","Santiago",""],["Bunker","Andrew J.",""],["Carniani","Stefano",""],["Charlot","Stephane",""],["Perna","Michele",""],["Del Pino","Bruno Rodriguez",""],["Ubler","Hannah",""],["Willott","Chris J.",""],["Boker","Torsten",""],["Cresci","Giovanni",""],["Curti","Mirko",""],["Jones","Gareth C.",""],["Lamperti","Isabella",""],["Parlanti","Eleonora",""],["Venturi","Giacomo",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 15:53:22 GMT"}],"updateDate":"2024-07-12","timestamp":1720713202000,"abstract":"  We present JWST/NIRSpec integral-field spectroscopy observations of the z ~\n9.11 lensed galaxy MACS1149-JD1, as part of the GA-NIFS programme. The data was\nobtained with both the G395H grating (R~ 2700) and the prism (R~ 100). This\ntarget shows a main elongated UV-bright clump and a secondary component\ndetected in continuum emission at a projected distance of 2 kpc. The R2700 data\ntrace the ionised-gas morpho-kinematics in between the two components, showing\nan elongated emission mainly traced by [O III]5007. We spatially resolve [O\nII]3726,3729, [O III]4959,5007, and [O III]4363, which enable us to map the\nelectron density (ne ~ 1.0 x 103 cm-3), temperature (Te ~ 1.6 x 104 K), and\ndirect-method gas-phase metallicity (-1.2 to -0.7 dex solar). A spatially\nresolved full-spectrum modelling of the prism indicates a north-south gas\nmetallicity and stellar age gradient between the two components. We found\n3-sigma evidence of a spatially resolved anti-correlation of the gas-phase\nmetallicity and the star formation rate density, which is likely driven by gas\ninflows, enhancing the star formation in JD1. We employ high-z sensitive\ndiagnostic diagrams to rule out the presence of a strong AGN in the main\ncomponent. These findings show the unambiguous presence of two distinct stellar\npopulations, with the majority of the mass ascribed to an old star formation\nburst, as suggested by previous works. We disfavour the possibility of a\nrotating-disc nature for MACS1149-JD1; we favour a merger event that has led to\na recent burst of star formation in two separate regions, as supported by high\nvalues of [O III]5007/Hbeta, ionised gas velocity dispersion, and gas-phase\nmetallicity.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}