{"id":"2407.04734","title":"Neuro-Symbolic Fusion of Wi-Fi Sensing Data for Passive Radar with\n  Inter-Modal Knowledge Transfer","authors":"Marco Cominelli and Francesco Gringoli and Lance M. Kaplan and Mani B.\n  Srivastava and Trevor Bihl and Erik P. Blasch and Nandini Iyer and Federico\n  Cerutti","authorsParsed":[["Cominelli","Marco",""],["Gringoli","Francesco",""],["Kaplan","Lance M.",""],["Srivastava","Mani B.",""],["Bihl","Trevor",""],["Blasch","Erik P.",""],["Iyer","Nandini",""],["Cerutti","Federico",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:43:27 GMT"}],"updateDate":"2024-07-09","timestamp":1719823407000,"abstract":"  Wi-Fi devices, akin to passive radars, can discern human activities within\nindoor settings due to the human body's interaction with electromagnetic\nsignals. Current Wi-Fi sensing applications predominantly employ data-driven\nlearning techniques to associate the fluctuations in the physical properties of\nthe communication channel with the human activity causing them. However, these\ntechniques often lack the desired flexibility and transparency. This paper\nintroduces DeepProbHAR, a neuro-symbolic architecture for Wi-Fi sensing,\nproviding initial evidence that Wi-Fi signals can differentiate between simple\nmovements, such as leg or arm movements, which are integral to human activities\nlike running or walking. The neuro-symbolic approach affords gathering such\nevidence without needing additional specialised data collection or labelling.\nThe training of DeepProbHAR is facilitated by declarative domain knowledge\nobtained from a camera feed and by fusing signals from various antennas of the\nWi-Fi receivers. DeepProbHAR achieves results comparable to the\nstate-of-the-art in human activity recognition. Moreover, as a by-product of\nthe learning process, DeepProbHAR generates specialised classifiers for simple\nmovements that match the accuracy of models trained on finely labelled\ndatasets, which would be particularly costly.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Emerging Technologies","Computing Research Repository/Machine Learning","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}