{"id":"2407.06371","title":"Investigating the off-axis GRB afterglow scenario for extragalactic fast\n  X-ray transients","authors":"H. C. I. Wichern, M. E. Ravasio, P. G. Jonker, J. A.\n  Quirola-V\\'asquez, A. J. Levan, F. E. Bauer, D. A. Kann","authorsParsed":[["Wichern","H. C. I.",""],["Ravasio","M. E.",""],["Jonker","P. G.",""],["Quirola-Vásquez","J. A.",""],["Levan","A. J.",""],["Bauer","F. E.",""],["Kann","D. A.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 20:32:03 GMT"}],"updateDate":"2024-07-10","timestamp":1720470723000,"abstract":"  Extragalactic fast X-ray transients (FXTs) are short-duration ($\\sim$ ks)\nX-ray flashes of unknown origin, potentially arising from binary neutron star\nmergers. We investigate the possible link between FXTs and the afterglows of\noff-axis merger-induced gamma-ray bursts (GRBs). By modelling the broadband\nafterglows of 13 GRBs, we make predictions for their X-ray light curve\nbehaviour had they been observed off-axis, considering both a uniform jet with\ncore angle $\\theta_{C}$ and a Gaussian-structured jet with truncation angle\n$\\theta_{W} = 2\\theta_{C}$. We compare their peak X-ray luminosity, duration,\nand temporal indices with those of the currently known extragalactic FXTs. Our\nanalysis reveals that a slightly off-axis observing angle of\n$\\theta_{\\text{obs}}\\approx (2.2-3)\\theta_{C}$ and a structured jet are\nrequired to explain the shallow temporal indices of the FXT light curves. In\nthe case of a structured jet, the durations of the FXTs are consistent with\nthose of the off-axis afterglows for the same range of observing angles,\n$\\theta_{\\text{obs}}\\approx (2.2-3)\\theta_{C}$. While the off-axis peak X-ray\nluminosities are consistent only for $\\theta_{\\text{obs}} = 2.2\\theta_{C}$,\nfocussing on individual events reveals that the match of all three properties\nof the FXTs at the same viewing angle is possible in the range\n$\\theta_{\\text{obs}} \\sim (2.2-2.6)\\theta_{C}$. Despite the small sample of\nGRBs analysed, these results show that there is a region of the parameter space\n- although quite limited - where the observational properties of off-axis GRB\nafterglows can be consistent with those of the newly discovered FXTs. Future\nobservations of FXTs discovered by the recently launched Einstein Probe mission\nand GRB population studies combined with more complex afterglow models will\nshed light on this possible GRB-FXT connection, and eventually unveil the\nprogenitors of some FXTs.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}