{"id":"2407.20470","title":"Automated determination of the end time of junk radiation in binary\n  black hole simulations","authors":"Isabella G. Pretto, Mark A. Scheel and Saul A. Teukolsky","authorsParsed":[["Pretto","Isabella G.",""],["Scheel","Mark A.",""],["Teukolsky","Saul A.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 00:14:04 GMT"}],"updateDate":"2024-07-31","timestamp":1722298444000,"abstract":"  When numerically solving Einstein's equations for the evolution of binary\nblack holes, physical imperfections in the initial data manifest as a\ntransient, high-frequency pulse of ''junk radiation.'' This unphysical signal\nmust be removed before the waveform can be used. Improvements in the efficiency\nof numerical simulations now allow waveform catalogs containing thousands of\nwaveforms to be produced. Thus, an automated procedure for identifying junk\nradiation is required. To this end, we present a new algorithm based on the\nempirical mode decomposition (EMD) from the Hilbert-Huang transform. This\napproach allows us to isolate and measure the high-frequency oscillations\npresent in the measured irreducible masses of the black holes. The decay of\nthese oscillations allows us to estimate the time from which the junk radiation\ncan be ignored. To make this procedure more precise, we propose three distinct\nthreshold criteria that specify how small the contribution of junk radiation\nhas to be before it can be considered negligible. We apply this algorithm to\n3403 BBH simulations from the SXS catalog to find appropriate values for the\nthresholds in the three criteria. We find that this approach yields reliable\ndecay time estimates, i.e., when to consider the simulation physical, for over\n98.6% of the simulations studied. This demonstrates the efficacy of the EMD as\na suitable tool to automatically isolate and characterize junk radiation in the\nsimulation of binary black hole systems.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}