{"id":"2407.18495","title":"Milli-spinner thrombectomy","authors":"Yilong Chang, Qi Li, Shuai Wu, Benjamin Pulli, Darren Samli, Paul\n  Yock, Jeremy J. Heit, Ruike Renee Zhao","authorsParsed":[["Chang","Yilong",""],["Li","Qi",""],["Wu","Shuai",""],["Pulli","Benjamin",""],["Samli","Darren",""],["Yock","Paul",""],["Heit","Jeremy J.",""],["Zhao","Ruike Renee",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 04:00:35 GMT"}],"updateDate":"2024-07-29","timestamp":1721966435000,"abstract":"  Blockage of blood flow in arteries or veins by blood clots can lead to\nserious medical conditions. Mechanical thrombectomy (MT), minimally invasive\nendovascular procedures that utilize aspiration, stent retriever, or cutting\nmechanisms for clot removal have emerged as an effective treatment modality for\nischemic stroke, myocardial infarction, pulmonary embolism, and peripheral\nvascular disease. However, state-of-the-art MT technologies still fail to\nremove clots in approximately 10% to 30% of patients, especially when treating\nlarge-size clots with high fibrin content. In addition, the working mechanism\nof most current MT techniques results in rupturing or cutting of clots which\ncould lead to clot fragmentation and distal emboli. Here, we report a new MT\ntechnology based on an unprecedented mechanism, in which a milli-spinner\nmechanically debulks the clot by densifying its fibrin fiber network and\ndischarging red blood cells to significantly reduce the clot volume for\ncomplete clot removal. This mechanism is achieved by the spin-induced\ncompression and shearing of the clot. We demonstrate its effective\nclot-debulking performance with clot volumetric reduction of up to 90% on\nvarious sizes of clots with diverse clot compositions. Milli-spinner MT in both\nin-vitro pulmonary and cerebral artery flow models and in-vivo swine models\ndemonstrate high-fidelity revascularization. The milli-spinner MT is the first\nreported mechanism that directly modifies the clot microstructure to facilitate\nclot removal, which also results in markedly improved MT efficacy compared to\nthe existing MT mechanisms that are based on clot rupturing and cutting. This\ntechnology introduces a unique mechanical way of debulking and removing clots\nfor future MT device development, especially for the treatment of ischemic\nstroke, pulmonary emboli, and peripheral thrombosis.\n","subjects":["Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}