{"id":"2407.17200","title":"Generalization Bounds of Surrogate Policies for Combinatorial\n  Optimization Problems","authors":"Pierre-Cyril Aubin-Frankowski and Yohann De Castro and Axel Parmentier\n  and Alessandro Rudi","authorsParsed":[["Aubin-Frankowski","Pierre-Cyril",""],["De Castro","Yohann",""],["Parmentier","Axel",""],["Rudi","Alessandro",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 12:00:30 GMT"}],"updateDate":"2024-07-25","timestamp":1721822430000,"abstract":"  A recent stream of structured learning approaches has improved the practical\nstate of the art for a range of combinatorial optimization problems with\ncomplex objectives encountered in operations research. Such approaches train\npolicies that chain a statistical model with a surrogate combinatorial\noptimization oracle to map any instance of the problem to a feasible solution.\nThe key idea is to exploit the statistical distribution over instances instead\nof dealing with instances separately. However learning such policies by risk\nminimization is challenging because the empirical risk is piecewise constant in\nthe parameters, and few theoretical guarantees have been provided so far. In\nthis article, we investigate methods that smooth the risk by perturbing the\npolicy, which eases optimization and improves generalization. Our main\ncontribution is a generalization bound that controls the perturbation bias, the\nstatistical learning error, and the optimization error. Our analysis relies on\nthe introduction of a uniform weak property, which captures and quantifies the\ninterplay of the statistical model and the surrogate combinatorial optimization\noracle. This property holds under mild assumptions on the statistical model,\nthe surrogate optimization, and the instance data distribution. We illustrate\nthe result on a range of applications such as stochastic vehicle scheduling. In\nparticular, such policies are relevant for contextual stochastic optimization\nand our results cover this case.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Mathematics/Optimization and Control","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}