{"id":"2407.19092","title":"Boosted generalized normal distributions: Integrating machine learning\n  with operations knowledge","authors":"Ragip Gurlek, Francis de Vericourt, Donald K. K. Lee","authorsParsed":[["Gurlek","Ragip",""],["de Vericourt","Francis",""],["Lee","Donald K. K.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 21:18:26 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 23:12:50 GMT"}],"updateDate":"2024-08-05","timestamp":1722028706000,"abstract":"  Applications of machine learning (ML) techniques to operational settings\noften face two challenges: i) ML methods mostly provide point predictions\nwhereas many operational problems require distributional information; and ii)\nThey typically do not incorporate the extensive body of knowledge in the\noperations literature, particularly the theoretical and empirical findings that\ncharacterize specific distributions. We introduce a novel and rigorous\nmethodology, the Boosted Generalized Normal Distribution ($b$GND), to address\nthese challenges. The Generalized Normal Distribution (GND) encompasses a wide\nrange of parametric distributions commonly encountered in operations, and\n$b$GND leverages gradient boosting with tree learners to flexibly estimate the\nparameters of the GND as functions of covariates. We establish $b$GND's\nstatistical consistency, thereby extending this key property to special cases\nstudied in the ML literature that lacked such guarantees. Using data from a\nlarge academic emergency department in the United States, we show that the\ndistributional forecasting of patient wait and service times can be\nmeaningfully improved by leveraging findings from the healthcare operations\nliterature. Specifically, $b$GND performs 6% and 9% better than the\ndistribution-agnostic ML benchmark used to forecast wait and service times\nrespectively. Further analysis suggests that these improvements translate into\na 9% increase in patient satisfaction and a 4% reduction in mortality for\nmyocardial infarction patients. Our work underscores the importance of\nintegrating ML with operations knowledge to enhance distributional forecasts.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Methodology","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}