{"id":"2407.13869","title":"Luminosity dependence of the multiple cyclotron lines in 4U 0115$+$63","authors":"Kinjal Roy, Hemanth Manikantan and Biswajit Paul","authorsParsed":[["Roy","Kinjal",""],["Manikantan","Hemanth",""],["Paul","Biswajit",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 19:28:14 GMT"}],"updateDate":"2024-07-22","timestamp":1721330894000,"abstract":"  The Be X-ray binary 4U 0115$+$63 underwent a giant outburst in 2023 with the\nX-ray luminosity of the source reaching 10$^{38}$ erg s$^{-1}$. During the\noutburst, two target of opportunity observations were made with\n\\textit{NuSTAR}. The main goal of this work is to model the multiple cyclotron\nscattering features (CRSFs) present in 4U 0115$+$63 and study their dependence\non the luminosity of the source. The 3$-$79 keV broadband X-ray coverage of\n\\textit{NuSTAR} allowed us to properly model the continuum and investigate the\nnature of the multiple cyclotron resonance scattering features present in the\nsource spectrum. We used the epoch-folding technique to find the pulsation from\nthe source and also studied the changes in the cyclotron line energy with an\norder of magnitude variation in the source luminosity. We detected five\ncyclotron lines during the 2023 outburst near 12, 16, 24, 34, and 47 keV. The\n$\\sim$16 keV cyclotron line cannot be harmonically related to the other\ncyclotron lines at $\\sim$12 keV and $\\sim$24 keV. This indicates the presence\nof two fundamental lines in the spectrum of 4U 0115$+$63 at 12 keV and 16 keV.\nWith the inclusion of the two latest \\textit{NuSTAR} observations, we have\nexpanded the data set of the CRSF line center to encompass a broad range of\nluminosity. This enables us to comprehensively investigate the relationship\nbetween the centroid energy of the cyclotron lines and luminosity. The CRSF\nline center shows no anticorrelation with luminosity, unlike previously\nreported. Instead, a weak positive correlation is found in four out of the five\ndetected cyclotron lines of 4U 0115$+$63. The luminosity variation of the two\nfundamental CRSFs could be well explained with the prediction from the\ncollisionless shock model.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}