{"id":"2407.06033","title":"Kratos: An FPGA Benchmark for Unrolled DNNs with Fine-Grained Sparsity\n  and Mixed Precision","authors":"Xilai Dai, Yuzong Chen, Mohamed S. Abdelfattah","authorsParsed":[["Dai","Xilai",""],["Chen","Yuzong",""],["Abdelfattah","Mohamed S.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 15:31:20 GMT"}],"updateDate":"2024-07-09","timestamp":1720452680000,"abstract":"  FPGAs offer a flexible platform for accelerating deep neural network (DNN)\ninference, particularly for non-uniform workloads featuring fine-grained\nunstructured sparsity and mixed arithmetic precision. To leverage these\nredundancies, an emerging approach involves partially or fully unrolling\ncomputations for each DNN layer. That way, parameter-level and bit-level\nineffectual operations can be completely skipped, thus saving the associated\narea and power. Regardless, unrolled implementations scale poorly and limit the\nsize of a DNN that can be unrolled on an FPGA. This motivates the investigation\nof new reconfigurable architectures to improve the efficiency of unrolled DNNs,\nwhile taking advantage of sparsity and mixed precision. To enable this, we\npresent Kratos: a focused FPGA benchmark of unrolled DNN primitives with\nvarying levels of sparsity and different arithmetic precisions. Our analysis\nreveals that unrolled DNNs can operate at very high frequencies, reaching the\nmaximum frequency limit of an Arria 10 device. Additionally, we found that\nsubstantial area reductions can be achieved through fine-grained sparsity and\nlow bit-width. We build on those results to tailor the FPGA fabric for unrolled\nDNNs through an architectural case study demonstrating $\\sim$2$\\times$ area\nreduction when using smaller LUT sizes within current FPGAs. This paves the way\nfor further exploration of new programmable architectures that are\npurpose-built for sparse and low-precision unrolled DNNs. Our source code and\nbenchmark are available on github.com/abdelfattah-lab/Kratos-benchmark.\n","subjects":["Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ns8oMTOYkK0cMhKG4Pql4k8Lr-O7bI_xo_-WdTkH_r0","pdfSize":"1180004"}
