{"id":"2407.04017","title":"Contemporary Software Modernization: Perspectives and Challenges to Deal\n  with Legacy Systems","authors":"Wesley K. G. Assun\\c{c}\\~ao, Luciano Marchezan, Alexander Egyed,\n  Rudolf Ramler","authorsParsed":[["Assunção","Wesley K. G.",""],["Marchezan","Luciano",""],["Egyed","Alexander",""],["Ramler","Rudolf",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 15:49:52 GMT"}],"updateDate":"2024-07-08","timestamp":1720108192000,"abstract":"  Software modernization is an inherent activity of software engineering, as\ntechnology advances and systems inevitably become outdated. The term \"software\nmodernization\" emerged as a research topic in the early 2000s, with a\ndifferentiation from traditional software evolution. Studies on this topic\nbecame popular due to new programming paradigms, technologies, and\narchitectural styles. Given the pervasive nature of software today, modernizing\nlegacy systems is paramount to provide users with competitive and innovative\nproducts and services. Despite the large amount of work available in the\nliterature, there are significant limitations: (i) proposed approaches are\nstrictly specific to one scenario or technology, lacking flexibility; (ii) most\nof the proposed approaches are not aligned with the current modern software\ndevelopment scenario; and (iii) due to a myriad of proposed modernization\napproaches, practitioners may be misguided on how to modernize legacies. In\nthis work, our goal is to call attention to the need for advances in research\nand practices toward a well-defined software modernization domain. The focus is\non enabling organizations to preserve the knowledge represented in legacy\nsystems while taking advantages of disruptive and emerging technologies. Based\non this goal, we put the different perspectives of software modernization in\nthe context of contemporary software development. We also present a research\nagenda with 10 challenges to motivate new studies.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Zao01av6djMAryUYEI_FLZj24AwyRO9NROYYGw52hj8","pdfSize":"666904"}
