{"id":"2407.21650","title":"TESS Giants Transiting Giants. VI. Newly Discovered Hot Jupiters Provide\n  Evidence for Efficient Obliquity Damping after the Main Sequence","authors":"Nicholas Saunders, Samuel K. Grunblatt, Ashley Chontos, Fei Dai,\n  Daniel Huber, Jingwen Zhang, Gudmundur Stefansson, Jennifer L. van Saders,\n  Joshua N. Winn, Daniel Hey, Andrew W. Howard, Benjamin Fulton, Howard\n  Isaacson, Corey Beard, Steven Giacalone, Judah van Zandt, Joseph M. Akana\n  Murphey, Malena Rice, Sarah Blunt, Emma Turtelboom, Paul A. Dalba, Jack\n  Lubin, Casey Brinkman, Emma M. Louden, Emma Page, Cristilyn N. Watkins, Karen\n  A. Collins, Chris Stockdale, Thiam-Guan Tan, Richard P. Schwarz, Bob Massey,\n  Steve B. Howell, Andrew Vanderburg, George R. Ricker, Jon M. Jenkins, Sara\n  Seager, Jessie L. Christiansen, Tansu Daylan, Ben Falk, Max Brodheim, Steven\n  R. Gibson, Grant M. Hill, Bradford Holden, Aaron Householder, Stephen Kaye,\n  Russ R. Laher, Kyle Lanclos, Erik A. Petigura, Arpita Roy, Ryan A. Rubenzahl,\n  Christian Schwab, Abby P. Shaum, Martin M. Sirk, Christopher L. Smith, Josh\n  Walawender, and Sherry Yeh","authorsParsed":[["Saunders","Nicholas",""],["Grunblatt","Samuel K.",""],["Chontos","Ashley",""],["Dai","Fei",""],["Huber","Daniel",""],["Zhang","Jingwen",""],["Stefansson","Gudmundur",""],["van Saders","Jennifer L.",""],["Winn","Joshua N.",""],["Hey","Daniel",""],["Howard","Andrew W.",""],["Fulton","Benjamin",""],["Isaacson","Howard",""],["Beard","Corey",""],["Giacalone","Steven",""],["van Zandt","Judah",""],["Murphey","Joseph M. Akana",""],["Rice","Malena",""],["Blunt","Sarah",""],["Turtelboom","Emma",""],["Dalba","Paul A.",""],["Lubin","Jack",""],["Brinkman","Casey",""],["Louden","Emma M.",""],["Page","Emma",""],["Watkins","Cristilyn N.",""],["Collins","Karen A.",""],["Stockdale","Chris",""],["Tan","Thiam-Guan",""],["Schwarz","Richard P.",""],["Massey","Bob",""],["Howell","Steve B.",""],["Vanderburg","Andrew",""],["Ricker","George R.",""],["Jenkins","Jon M.",""],["Seager","Sara",""],["Christiansen","Jessie L.",""],["Daylan","Tansu",""],["Falk","Ben",""],["Brodheim","Max",""],["Gibson","Steven R.",""],["Hill","Grant M.",""],["Holden","Bradford",""],["Householder","Aaron",""],["Kaye","Stephen",""],["Laher","Russ R.",""],["Lanclos","Kyle",""],["Petigura","Erik A.",""],["Roy","Arpita",""],["Rubenzahl","Ryan A.",""],["Schwab","Christian",""],["Shaum","Abby P.",""],["Sirk","Martin M.",""],["Smith","Christopher L.",""],["Walawender","Josh",""],["Yeh","Sherry",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:53:13 GMT"}],"updateDate":"2024-08-01","timestamp":1722437593000,"abstract":"  The degree of alignment between a star's spin axis and the orbital plane of\nits planets (the stellar obliquity) is related to interesting and poorly\nunderstood processes that occur during planet formation and evolution. Hot\nJupiters orbiting hot stars ($\\gtrsim$6250 K) display a wide range of\nobliquities, while similar planets orbiting cool stars are preferentially\naligned. Tidal dissipation is expected to be more rapid in stars with thick\nconvective envelopes, potentially explaining this trend. Evolved stars provide\nan opportunity to test the damping hypothesis, particularly stars that were hot\non the main sequence and have since cooled and developed deep convective\nenvelopes. We present the first systematic study of the obliquities of hot\nJupiters orbiting subgiants that recently developed convective envelopes using\nRossiter-McLaughlin observations. Our sample includes two newly discovered\nsystems in the Giants Transiting Giants Survey (TOI-6029 b, TOI-4379 b). We\nfind that the orbits of hot Jupiters orbiting subgiants that have cooled below\n$\\sim$6250 K are aligned or nearly aligned with the spin-axis of their host\nstars, indicating rapid tidal realignment after the emergence of a stellar\nconvective envelope. We place an upper limit for the timescale of realignment\nfor hot Jupiters orbiting subgiants at $\\sim$500 Myr. Comparison with a\nsimplified tidal evolution model shows that obliquity damping needs to be\n$\\sim$4 orders of magnitude more efficient than orbital period decay to damp\nthe obliquity without destroying the planet, which is consistent with recent\npredictions for tidal dissipation from inertial waves excited by hot Jupiters\non misaligned orbits.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}