{"id":"2407.12040","title":"Comprehensive Performance Evaluation of YOLOv10, YOLOv9 and YOLOv8 on\n  Detecting and Counting Fruitlet in Complex Orchard Environments","authors":"Ranjan Sapkota, Zhichao Meng, Martin Churuvija, Xiaoqiang Du, Zenghong\n  Ma, Manoj Karkee","authorsParsed":[["Sapkota","Ranjan",""],["Meng","Zhichao",""],["Churuvija","Martin",""],["Du","Xiaoqiang",""],["Ma","Zenghong",""],["Karkee","Manoj",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 17:59:55 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 01:58:57 GMT"},{"version":"v3","created":"Tue, 27 Aug 2024 16:25:47 GMT"}],"updateDate":"2024-08-28","timestamp":1719856795000,"abstract":"  This study performed an extensive evaluation of the performances of all\nconfigurations of YOLOv8, YOLOv9, and YOLOv10 object detection algorithms for\nfruitlet (of green fruit) detection in commercial orchards. Additionally, this\nresearch performed and validated in-field counting of fruitlets using an iPhone\nand machine vision sensors in 5 different apple varieties (Scifresh, Scilate,\nHoneycrisp, Cosmic crisp & Golden delicious). This comprehensive investigation\nof total 17 different configurations (5 for YOLOv8, 6 for YOLOv9 and 6 for\nYOLOv10) revealed that YOLOv9 outperforms YOLOv10 and YOLOv8 in terms of\nmAP@50, while YOLOv10x outperformed all 17 configurations tested in terms of\nprecision and recall. Specifically, YOLOv9 Gelan-e achieved the highest mAP@50\nof 0.935, outperforming YOLOv10n's 0.921 and YOLOv8s's 0.924. In terms of\nprecision, YOLOv10x achieved the highest precision of 0.908, indicating\nsuperior object identification accuracy compared to other configurations tested\n(e.g. YOLOv9 Gelan-c with a precision of 0.903 and YOLOv8m with 0.897. In terms\nof recall, YOLOv10s achieved the highest in its series (0.872), while YOLOv9\nGelan m performed the best among YOLOv9 configurations (0.899), and YOLOv8n\nperformed the best among the YOLOv8 configurations (0.883). Meanwhile, three\nconfigurations of YOLOv10: YOLOv10b, YOLOv10l, and YOLOv10x achieved superior\npost-processing speeds of 1.5 milliseconds, outperforming all other\nconfigurations within the YOLOv9 and YOLOv8 families. Specifically, YOLOv9\nGelan-e recorded a post-processing speed of 1.9 milliseconds, and YOLOv8m\nachieved 2.1 milliseconds. Furthermore, YOLOv8n exhibited the highest inference\nspeed among all configurations tested, achieving a processing time of 4.1\nmilliseconds while YOLOv9 Gelan-t and YOLOv10n also demonstrated comparatively\nslower inference speeds of 9.3 ms and 5.5 ms, respectively.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}