{"id":"2407.06587","title":"Reactivity of ultra-thin Kagome Metal FeSn towards Oxygen and Water","authors":"James Blyth, Sadhana Sridhar, Mengting Zhao, Sajid Ali2, Thi Hai Yen\n  Vu, Qile Li, Johnathon Maniatis, Grace Causer, Michael S. Fuhrer, Nikhil V.\n  Medhekar, Anton Tadich, Mark Edmonds","authorsParsed":[["Blyth","James",""],["Sridhar","Sadhana",""],["Zhao","Mengting",""],["Ali2","Sajid",""],["Vu","Thi Hai Yen",""],["Li","Qile",""],["Maniatis","Johnathon",""],["Causer","Grace",""],["Fuhrer","Michael S.",""],["Medhekar","Nikhil V.",""],["Tadich","Anton",""],["Edmonds","Mark",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 06:37:21 GMT"}],"updateDate":"2024-07-10","timestamp":1720507041000,"abstract":"  The kagome metal FeSn, consists of alternating layers of kagome-lattice Fe3Sn\nand honeycomb Sn2, and exhibits great potential for applications in future low\nenergy electronics and spintronics because of an ideal combination of novel\ntopological phases and high-temperature magnetic ordering. Robust synthesis\nmethods for ultra-thin FeSn films, as well as an understanding of their air\nstability is crucial for its development and long-term operation in future\ndevices. In this work, we realize large area, sub-10 nm epitaxial FeSn thin\nfilms, and explore the oxidation process via synchrotron-based photoelectron\nspectroscopy using in-situ oxygen and water dosing, as well as ex-situ air\nexposure. Upon exposure to atmosphere the FeSn films are shown to be highly\nreactive, with a stable ~3 nm thick oxide layer forming at the surface within\n10 minutes. Notably the surface Fe remains largely unoxidized when compared to\nSn, which undergoes near-complete oxidation. This is further confirmed with\ncontrolled in-situ dosing of O2 and H2O where only the Sn2 (stanene)\ninter-layers within the FeSn lattice oxidize, suggesting the Fe3Sn kagome\nlayers remain almost pristine. These results are in excellent agreement with\nfirst principles calculations, which show Fe-O bonds to the Fe3Sn layer are\nenergetically unfavorable, and furthermore, a large formation energy preference\nof 1.37 eV for Sn-O bonds in the stanene Sn2 layer over Sn-O bonds in the\nkagome Fe3Sn layer. The demonstration that oxidation only occurs within the\nstanene layers may provide new avenues in how to engineer, handle and prepare\nfuture kagome metal devices.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}