{"id":"2407.10505","title":"Dynamics of Nanoscale Phase Decomposition in Laser Ablation","authors":"Yanwen Sun, Chaobo Chen, Thies J. Albert, Haoyuan Li, Mikhail I.\n  Arefev, Ying Chen, Mike Dunne, James M. Glownia, Matthias Hoffmann, Matthew\n  J. Hurley, Mianzhen Mo, Quynh L. Nguyen, Takahiro Sato, Sanghoon Song, Peihao\n  Sun, Mark Sutton, Samuel Teitelbaum, Antonios S. Valavanis, Nan Wang, Diling\n  Zhu, Leonid V. Zhigilei, Klaus Sokolowski-Tinten","authorsParsed":[["Sun","Yanwen",""],["Chen","Chaobo",""],["Albert","Thies J.",""],["Li","Haoyuan",""],["Arefev","Mikhail I.",""],["Chen","Ying",""],["Dunne","Mike",""],["Glownia","James M.",""],["Hoffmann","Matthias",""],["Hurley","Matthew J.",""],["Mo","Mianzhen",""],["Nguyen","Quynh L.",""],["Sato","Takahiro",""],["Song","Sanghoon",""],["Sun","Peihao",""],["Sutton","Mark",""],["Teitelbaum","Samuel",""],["Valavanis","Antonios S.",""],["Wang","Nan",""],["Zhu","Diling",""],["Zhigilei","Leonid V.",""],["Sokolowski-Tinten","Klaus",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 07:55:39 GMT"}],"updateDate":"2024-07-16","timestamp":1721030139000,"abstract":"  Femtosecond laser ablation is a process that bears both fundamental physics\ninterest and has wide industrial applications. For decades, the lack of probes\non the relevant time and length scales has prevented access to the highly\nnonequilibrium phase decomposition processes triggered by laser excitation.\nEnabled by the unprecedented intense femtosecond X-ray pulses delivered by an\nX-ray free electron laser, we report here results of time-resolved small angle\nscattering measurements on the dynamics of nanoscale phase decomposition in\nthin gold films upon femtosecond laser-induced ablation. By analyzing the\nfeatures imprinted onto the small angle diffraction patterns, the transient\nheterogeneous density distributions within the ablation plume as obtained from\nmolecular dynamics simulations get direct experimental confirmation.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}