{"id":"2407.05764","title":"Neuromorphic Imaging with Super-Resolution","authors":"Pei Zhang and Shuo Zhu and Chutian Wang and Yaping Zhao and Edmund Y.\n  Lam","authorsParsed":[["Zhang","Pei",""],["Zhu","Shuo",""],["Wang","Chutian",""],["Zhao","Yaping",""],["Lam","Edmund Y.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 09:16:02 GMT"}],"updateDate":"2024-07-09","timestamp":1720430162000,"abstract":"  Neuromorphic imaging is a bio-inspired technique that imitates the human\nretina to sense variations in a dynamic scene. It responds to pixel-level\nbrightness changes by asynchronous streaming events and boasts microsecond\ntemporal precision over a high dynamic range, yielding blur-free recordings\nunder extreme illumination. Nevertheless, such a modality falls short in\nspatial resolution and leads to a low level of visual richness and clarity.\nPursuing hardware upgrades is expensive and might cause compromised performance\ndue to more burdens on computational requirements. Another option is to harness\noffline, plug-in-play neuromorphic super-resolution solutions. However,\nexisting ones, which demand substantial sample volumes for lengthy training on\nmassive computing resources, are largely restricted by real data availability\nowing to the current imperfect high-resolution devices, as well as the\nrandomness and variability of motion. To tackle these challenges, we introduce\nthe first self-supervised neuromorphic super-resolution prototype. It can be\nself-adaptive to per input source from any low-resolution camera to estimate an\noptimal, high-resolution counterpart of any scale, without the need of side\nknowledge and prior training. Evaluated on downstream event-driven tasks, such\na simple yet effective method can obtain competitive results against the\nstate-of-the-arts, significantly promoting flexibility but not sacrificing\naccuracy. It also delivers enhancements for inferior natural images and optical\nmicrographs acquired under non-ideal imaging conditions, breaking through the\nlimitations that are challenging to overcome with traditional frame techniques.\nIn the current landscape where the use of high-resolution cameras for\nevent-based sensing remains an open debate, our solution serves as a\ncost-efficient and practical alternative, paving the way for more intelligent\nimaging systems.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}