{"id":"2407.07258","title":"Identification of emotions on Twitter during the 2022 electoral process\n  in Colombia","authors":"Juan Jose Iguaran Fernandez, Juan Manuel Perez, and German Rosati","authorsParsed":[["Fernandez","Juan Jose Iguaran",""],["Perez","Juan Manuel",""],["Rosati","German",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 22:26:42 GMT"}],"updateDate":"2024-07-11","timestamp":1720564002000,"abstract":"  The study of Twitter as a means for analyzing social phenomena has gained\ninterest in recent years due to the availability of large amounts of data in a\nrelatively spontaneous environment. Within opinion-mining tasks, emotion\ndetection is specially relevant, as it allows for the identification of\npeople's subjective responses to different social events in a more granular way\nthan traditional sentiment analysis based on polarity. In the particular case\nof political events, the analysis of emotions in social networks can provide\nvaluable information on the perception of candidates, proposals, and other\nimportant aspects of the public debate. In spite of this importance, there are\nfew studies on emotion detection in Spanish and, to the best of our knowledge,\nfew resources are public for opinion mining in Colombian Spanish, highlighting\nthe need for generating resources addressing the specific cultural\ncharacteristics of this variety. In this work, we present a small corpus of\ntweets in Spanish related to the 2022 Colombian presidential elections,\nmanually labeled with emotions using a fine-grained taxonomy. We perform\nclassification experiments using supervised state-of-the-art models (BERT\nmodels) and compare them with GPT-3.5 in few-shot learning settings. We make\nour dataset and code publicly available for research purposes.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WenqHttoQ_K82lQoqVWuvR7CCpYgQNhT5Y_7gnfvijI","pdfSize":"772189"}
