{"id":"2407.18621","title":"Twenty-three New Heartbeat Star Systems Discovered Based on TESS Data","authors":"Min-Yu Li, Sheng-Bang Qian, Ai-Ying Zhou, Li-Ying Zhu, Wen-Ping Liao,\n  Er-Gang Zhao, Xiang-Dong Shi, Fu-Xing Li, Qi-Bin Sun","authorsParsed":[["Li","Min-Yu",""],["Qian","Sheng-Bang",""],["Zhou","Ai-Ying",""],["Zhu","Li-Ying",""],["Liao","Wen-Ping",""],["Zhao","Er-Gang",""],["Shi","Xiang-Dong",""],["Li","Fu-Xing",""],["Sun","Qi-Bin",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 09:28:11 GMT"},{"version":"v2","created":"Wed, 11 Sep 2024 07:56:04 GMT"}],"updateDate":"2024-09-12","timestamp":1721986091000,"abstract":"  Heartbeat stars (HBSs) are ideal astrophysical laboratories to study the\nformation and evolution of binary stars in eccentric orbits and the internal\nstructural changes of their components under strong tidal action. We discover\n23 new HBSs based on TESS photometric data. The orbital parameters, including\norbital period, eccentricity, orbital inclination, argument of periastron, and\nepoch of periastron passage of these HBSs are derived by using a corrected\nversion of Kumar et al.'s model based on the Markov Chain Monte Carlo (MCMC)\nmethod. The preliminary results show that these HBSs have orbital periods in\nthe range from 2.7 to 20 days and eccentricities in the range from 0.08 to\n0.70. The eccentricity-period relation of these objects shows a positive\ncorrelation between eccentricity and period, and also shows the existence of\norbital circularization. The Hertzsprung-Russell diagram shows that the HBSs\nare not all located in a particular area. The distribution of the derived\nparameters suggests a selection bias within the TESS survey towards massive\nHBSs with shorter orbital periods, higher temperatures and luminosities. These\nobjects are a very useful source to study the structure and evolution of\neccentricity orbit binaries and to extend the TESS HBS catalog.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}