{"id":"2407.17781","title":"Ensemble data assimilation to diagnose AI-based weather prediction\n  model: A case with ClimaX","authors":"Shunji Kotsuki, Kenta Shiraishi and Atsushi Okazaki","authorsParsed":[["Kotsuki","Shunji",""],["Shiraishi","Kenta",""],["Okazaki","Atsushi",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 05:22:08 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 05:34:48 GMT"}],"updateDate":"2024-08-12","timestamp":1721884928000,"abstract":"  Artificial intelligence (AI)-based weather prediction research is growing\nrapidly and has shown to be competitive with the advanced dynamic numerical\nweather prediction models. However, research combining AI-based weather\nprediction models with data assimilation remains limited partially because\nlong-term sequential data assimilation cycles are required to evaluate data\nassimilation systems. This study proposes using ensemble data assimilation for\ndiagnosing AI-based weather prediction models, and marked the first successful\nimplementation of ensemble Kalman filter with AI-based weather prediction\nmodels. Our experiments with an AI-based model ClimaX demonstrated that the\nensemble data assimilation cycled stably for the AI-based weather prediction\nmodel using covariance inflation and localization techniques within the\nensemble Kalman filter. While ClimaX showed some limitations in capturing\nflow-dependent error covariance compared to dynamical models, the AI-based\nensemble forecasts provided reasonable and beneficial error covariance in\nsparsely observed regions. In addition, ensemble data assimilation revealed\nthat error growth based on ensemble ClimaX predictions was weaker than that of\ndynamical NWP models, leading to higher inflation factors. A series of\nexperiments demonstrated that ensemble data assimilation can be used to\ndiagnose properties of AI weather prediction models such as physical\nconsistency and accurate error growth representation.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}