{"id":"2407.09293","title":"Sample size for developing a prediction model with a binary outcome:\n  targeting precise individual risk estimates to improve clinical decisions and\n  fairness","authors":"Richard D Riley, Gary S Collins, Rebecca Whittle, Lucinda Archer, Kym\n  IE Snell, Paula Dhiman, Laura Kirton, Amardeep Legha, Xiaoxuan Liu, Alastair\n  Denniston, Frank E Harrell Jr, Laure Wynants, Glen P Martin, Joie Ensor","authorsParsed":[["Riley","Richard D",""],["Collins","Gary S",""],["Whittle","Rebecca",""],["Archer","Lucinda",""],["Snell","Kym IE",""],["Dhiman","Paula",""],["Kirton","Laura",""],["Legha","Amardeep",""],["Liu","Xiaoxuan",""],["Denniston","Alastair",""],["Harrell","Frank E","Jr"],["Wynants","Laure",""],["Martin","Glen P",""],["Ensor","Joie",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 14:27:11 GMT"}],"updateDate":"2024-07-15","timestamp":1720794431000,"abstract":"  When developing a clinical prediction model, the sample size of the\ndevelopment dataset is a key consideration. Small sample sizes lead to greater\nconcerns of overfitting, instability, poor performance and lack of fairness.\nPrevious research has outlined minimum sample size calculations to minimise\noverfitting and precisely estimate the overall risk. However even when meeting\nthese criteria, the uncertainty (instability) in individual-level risk\nestimates may be considerable. In this article we propose how to examine and\ncalculate the sample size required for developing a model with acceptably\nprecise individual-level risk estimates to inform decisions and improve\nfairness. We outline a five-step process to be used before data collection or\nwhen an existing dataset is available. It requires researchers to specify the\noverall risk in the target population, the (anticipated) distribution of key\npredictors in the model, and an assumed 'core model' either specified directly\n(i.e., a logistic regression equation is provided) or based on specified\nC-statistic and relative effects of (standardised) predictors. We produce\nclosed-form solutions that decompose the variance of an individual's risk\nestimate into Fisher's unit information matrix, predictor values and total\nsample size; this allows researchers to quickly calculate and examine\nindividual-level uncertainty interval widths and classification instability for\nspecified sample sizes. Such information can be presented to key stakeholders\n(e.g., health professionals, patients, funders) using prediction and\nclassification instability plots to help identify the (target) sample size\nrequired to improve trust, reliability and fairness in individual predictions.\nOur proposal is implemented in software module pmstabilityss. We provide real\nexamples and emphasise the importance of clinical context including any risk\nthresholds for decision making.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}