{"id":"2407.10711","title":"Rigorous derivation of damped-driven wave turbulence theory","authors":"Ricardo Grande, Zaher Hani","authorsParsed":[["Grande","Ricardo",""],["Hani","Zaher",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 13:31:35 GMT"}],"updateDate":"2024-07-16","timestamp":1721050295000,"abstract":"  We provide a rigorous justification of various kinetic regimes exhibited by\nthe nonlinear Schr\\\"{o}dinger equation with an additive stochastic forcing and\na viscous dissipation. The importance of such damped-driven models stems from\ntheir wide empirical use in studying turbulence for nonlinear wave systems. The\nforce injects energy into the system at large scales, which is then transferred\nacross scales, thanks to the nonlinear wave interactions, until it is\neventually dissipated at smaller scales. The presence of such scale-separated\nforcing and dissipation allows for the constant flux of energy in the\nintermediate scales, known as the inertial range, which is the focus of the\nvast amount of numerical and physical literature on wave turbulence.\n  Roughly speaking, our results provide a rigorous kinetic framework for this\nturbulent behavior by proving that the stochastic dynamics can be effectively\ndescribed by a deterministic damped-driven kinetic equation, which carries the\nfull picture of the turbulent energy dynamic across scales (like cascade\nspectra or other flux solutions). The analysis extends previous works in the\nunperturbed setting arXiv:1912.09518-arXiv:2301.07063 to the above empirically\nmotivated damped driven setting. Here, in addition to the size $L$ of the\nsystem, and the strength $\\lambda$ of the nonlinearity, an extra thermodynamic\nparameter has to be included in the kinetic limit ($L\\to \\infty, \\lambda\\to\n0$), namely the strength $\\nu$ of the forcing and dissipation. Various regimes\nemerge depending on the relative sizes of $L$, $\\lambda$ and $\\nu$, which give\nrise to different kinetic equations. Two major novelties of this work is the\nextension of the Feynman diagram analysis to additive stochastic objects, and\nthe sharp asymptotic development of the leading terms in that expansion.\n","subjects":["Mathematics/Analysis of PDEs","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}