{"id":"2407.02173","title":"A study of two FRBs with low polarization fractions localized with the\n  MeerTRAP transient buffer system","authors":"K. M. Rajwade, L. N. Driessen, E. D. Barr, I. Pastor-Marazuela, M.\n  Berezina, F. Jankowski, A. Muller, L. Kahinga, B. W. Stappers, M. C.\n  Bezuidenhout, M. Caleb, A. Deller, W. Fong, A. Gordon, M. Kramer, M. Malenta,\n  V. Morello, J. X. Prochaska, S. Sanidas, M. Surnis, N. Tejos and S. Wagner","authorsParsed":[["Rajwade","K. M.",""],["Driessen","L. N.",""],["Barr","E. D.",""],["Pastor-Marazuela","I.",""],["Berezina","M.",""],["Jankowski","F.",""],["Muller","A.",""],["Kahinga","L.",""],["Stappers","B. W.",""],["Bezuidenhout","M. C.",""],["Caleb","M.",""],["Deller","A.",""],["Fong","W.",""],["Gordon","A.",""],["Kramer","M.",""],["Malenta","M.",""],["Morello","V.",""],["Prochaska","J. X.",""],["Sanidas","S.",""],["Surnis","M.",""],["Tejos","N.",""],["Wagner","S.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 11:27:05 GMT"}],"updateDate":"2024-07-03","timestamp":1719919625000,"abstract":"  Localisation of fast radio bursts (FRBs) to arcsecond and sub-arcsecond\nprecision maximizes their potential as cosmological probes. To that end, FRB\ndetection instruments are deploying triggered complex-voltage capture systems\nto localize FRBs, identify their host galaxy and measure a redshift. Here, we\nreport the discovery and localisation of two FRBs (20220717A and 20220905A)\nthat were captured by the transient buffer system deployed by the MeerTRAP\ninstrument at the MeerKAT telescope in South Africa. We were able to localize\nthe FRBs to a precision of $\\sim$1 arc-second that allowed us to unambiguously\nidentify the host galaxy for FRB 20220717A (posterior probability$\\sim$0.97).\nFRB 20220905A lies in a crowded region of the sky with a tentative\nidentification of a host galaxy but the faintness and the difficulty in\nobtaining an optical spectrum preclude a conclusive association. The bursts\nshow low linear polarization fractions (10--17$\\%$) that conform to the large\ndiversity in the polarization fraction observed in apparently non-repeating\nFRBs akin to single pulses from neutron stars. We also show that the host\ngalaxy of FRB 20220717A contributes roughly 15$\\%$ of the total dispersion\nmeasure (DM), indicating that it is located in a plasma-rich part of the host\ngalaxy which can explain the large rotation measure. The scattering in FRB\n20220717A can be mostly attributed to the host galaxy and the intervening\nmedium and is consistent with what is seen in the wider FRB population.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"8YJ0BxvGx8XwwoX946HI3s2IrYl4QeQSh3wcqSryS1c","pdfSize":"6860685"}
