{"id":"2407.18055","title":"Collective quantum enhancement in critical quantum sensing","authors":"Uesli Alushi, Alessandro Coppo, Valentina Brosco, Roberto Di Candia,\n  Simone Felicetti","authorsParsed":[["Alushi","Uesli",""],["Coppo","Alessandro",""],["Brosco","Valentina",""],["Di Candia","Roberto",""],["Felicetti","Simone",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 14:08:39 GMT"}],"updateDate":"2024-07-26","timestamp":1721916519000,"abstract":"  Critical systems represent a valuable resource in quantum sensing and\nmetrology. Critical quantum sensing (CQS) protocols can be realized using\nfinite-component phase transitions, where criticality is not due to the\nthermodynamic limit but rather to the rescaling of the system parameters. In\nparticular, the second-order phase transitions of parametric Kerr resonators\nare of high experimental relevance, as they can be implemented and controlled\nwith various quantum technologies currently available. Here, we show that\ncollective quantum advantage can be achieved with a multipartite critical\nquantum sensor based on a parametrically coupled Kerr resonators chain in the\nweak-nonlinearity limit. We derive analytical solutions for the low-energy\nspectrum of this unconventional quantum many-body system, which is composed of\n\\emph{locally} critical elements. We then assess the performance of an\nadiabatic CQS protocol, comparing the coupled-resonator chain with an\nequivalent ensemble of independent critical sensors. We evaluate the scaling of\nthe quantum Fisher information with respect to fundamental resources, and find\nthat the critical chain achieves a quadratic enhancement in the number of\nresonators. Beyond the advantage found in the case of zero Kerr, we find that\nthere is a collective enhancement even in the scenario of finite Kerr\nnonlinearity.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}