{"id":"2407.21599","title":"On the convergence of bootstrap current to the Shaing-Callen limit in\n  stellarators","authors":"Christopher G. Albert, Craig D. Beidler, Gernot Kapper, Sergei V.\n  Kasilov and Winfried Kernbichler","authorsParsed":[["Albert","Christopher G.",""],["Beidler","Craig D.",""],["Kapper","Gernot",""],["Kasilov","Sergei V.",""],["Kernbichler","Winfried",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 13:33:50 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 09:15:12 GMT"}],"updateDate":"2024-08-29","timestamp":1722432830000,"abstract":"  Bootstrap current in stellarators can be presented as a sum of a\ncollisionless value given by the Shaing-Callen asymptotic formula and an\noff-set current, which non-trivially depends on plasma collisionality and\nradial electric field. Using NEO-2 modelling, analytical estimates and\nsemi-analytical studies with help of a propagator method, it is shown that the\noff-set current in the $1/\\nu$ regime does not converge with decreasing\ncollisionality $\\nu_\\ast$ but rather shows oscillations over $\\log\\nu_\\ast$\nwith an amplitude of the order of the bootstrap current in an equivalent\ntokamak. The convergence to the Shaing-Callen limit appears in regimes with\nsignificant orbit precession, in particular, due to a finite radial electric\nfield, where the off-set current decreases as $\\nu_\\ast^{3/5}$. The off-set\ncurrent strongly increases in case of nearly aligned magnetic field maxima on\nthe field line where it diverges as $\\nu_\\ast^{-1/2}$ in the $1/\\nu$ regime and\nsaturates due to the precession at a level exceeding the equivalent tokamak\nvalue by ${v_E^\\ast}^{-1/2}$ where $v_E^\\ast$ is the perpendicular Mach number.\nThe latter off-set, however, can be minimized by further aligning local\nmagnetic field maxima and by fulfilling an extra integral condition of\n\"equivalent ripples\" for the magnetic field. A criterion for the accuracy of\nthis alignment and of ripple equivalence is derived. In addition, the\npossibility of the bootstrap effect at the magnetic axis caused by the above\noff-set is also discussed.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LQ7izd2D5sXndIaeW8AXVPwQjkwtV6AJuGbe7LjlnJ0","pdfSize":"5021196","objectId":"0x484cd8eaea6ab847d890937a78f38756401c5c035ea00ba1715d99cbaad6e369","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
