{"id":"2407.01347","title":"Bulk and fracture process zone contribution to the rate-dependent\n  adhesion amplification in viscoelastic broad-band materials","authors":"Ali Maghami, Qingao Wang, Michele Tricarico, Michele Ciavarella,\n  Qunyang Li, Antonio Papangelo","authorsParsed":[["Maghami","Ali",""],["Wang","Qingao",""],["Tricarico","Michele",""],["Ciavarella","Michele",""],["Li","Qunyang",""],["Papangelo","Antonio",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:01:43 GMT"}],"updateDate":"2024-07-02","timestamp":1719846103000,"abstract":"  The contact between a rigid Hertzian indenter and an adhesive broad-band\nviscoelastic substrate is considered. The material behaviour is described by a\nmodified power law model, which is characterized by only four parameters, the\nglassy and rubbery elastic moduli, a characteristic exponent n and a timescale\n${\\tau}_0$. The maximum adherence force that can be reached while unloading the\nrigid indenter from a relaxed viscoelastic half-space is studied by means of a\nnumerical implementation based on the boundary element method, as a function of\nthe unloading velocity, preload and by varying the broadness of the\nviscoelastic material spectrum. Through a comprehensive numerical analysis we\nhave determined the minimum contact radius that is needed to achieve the\nmaximum amplification of the pull-off force at a specified unloading rate and\nfor different material exponents n. The numerical results are then compared\nwith the prediction of Persson and Brener viscoelastic crack propagation\ntheory, providing excellent agreement. However, comparison against experimental\ntests for a glass lens indenting a PDMS substrate show data can be fitted with\nthe linear theory only up to an unloading rate of about $100 \\textrm{\n$\\mu$}$m/s showing the fracture process zone rate-dependent contribution to the\nenergy enhancement is of the same order of the bulk dissipation contribution.\nHence, the limitations of the current numerical and theoretical models for\nviscoelastic adhesion are discussed in light of the most recent literature\nresults.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}