{"id":"2407.00822","title":"ROM inversion of monostatic data lifted to full MIMO","authors":"V. Druskin, S. Moskow and M. Zaslavsky","authorsParsed":[["Druskin","V.",""],["Moskow","S.",""],["Zaslavsky","M.",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 20:33:47 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 21:07:52 GMT"},{"version":"v3","created":"Mon, 8 Jul 2024 20:40:25 GMT"}],"updateDate":"2024-07-10","timestamp":1719779627000,"abstract":"  The Lippmann--Schwinger--Lanczos (LSL) algorithm has recently been shown to\nprovide an efficient tool for imaging and direct inversion of synthetic\naperture radar data in multi-scattering environments [17], where the data set\nis limited to the monostatic, a.k.a. single input/single output (SISO)\nmeasurements. The approach is based on constructing data-driven estimates of\ninternal fields via a reduced-order model (ROM) framework and then plugging\nthem into the Lippmann-Schwinger integral equation. However, the approximations\nof the internal solutions may have more error due to missing the off diagonal\nelements of the multiple input/multiple output (MIMO) matrix valued transfer\nfunction. This, in turn, may result in multiple echoes in the image. Here we\npresent a ROM-based data completion algorithm to mitigate this problem. First,\nwe apply the LSL algorithm to the SISO data as in [17] to obtain approximate\nreconstructions as well as the estimate of internal field. Next, we use these\nestimates to calculate a forward Lippmann-Schwinger integral to populate the\nmissing off-diagonal data (the lifting step). Finally, to update the\nreconstructions, we solve the Lippmann-Schwinger equation using the original\nSISO data, where the internal fields are constructed from the lifted MIMO data.\nThe steps of obtaining the approximate reconstructions and internal fields and\npopulating the missing MIMO data entries can be repeated for complex models to\nimprove the images even further. Efficiency of the proposed approach is\ndemonstrated on 2D and 2.5D numerical examples, where we see reconstructions\nare improved substantially.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"usym_QD_ANDeiD99D51oS3jD25WHfnBUoRf12pwEoDI","pdfSize":"1312099","objectId":"0x45b95ccf9a447e66c13be2975a1d4ee6f9e2b761cb597e1af682774f75a576ac","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
