{"id":"2407.17485","title":"Application of the Digital Annealer Unit in Optimizing Chemical Reaction\n  Conditions for Enhanced Production Yields","authors":"Shih-Cheng Li, Pei-Hwa Wang, Jheng-Wei Su, Wei-Yin Chiang, Shih-Hsien\n  Huang, Yen-Chu Lin, Chia-Ho Ou and Chih-Yu Chen","authorsParsed":[["Li","Shih-Cheng",""],["Wang","Pei-Hwa",""],["Su","Jheng-Wei",""],["Chiang","Wei-Yin",""],["Huang","Shih-Hsien",""],["Lin","Yen-Chu",""],["Ou","Chia-Ho",""],["Chen","Chih-Yu",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 01:57:11 GMT"}],"updateDate":"2024-07-26","timestamp":1719971831000,"abstract":"  Finding appropriate reaction conditions that yield high product rates in\nchemical synthesis is crucial for the chemical and pharmaceutical industries.\nHowever, due to the vast chemical space, conducting experiments for each\npossible reaction condition is impractical. Consequently, models such as QSAR\n(Quantitative Structure-Activity Relationship) or ML (Machine Learning) have\nbeen developed to predict the outcomes of reactions and illustrate how reaction\nconditions affect product yield. Despite these advancements, inferring all\npossible combinations remains computationally prohibitive when using a\nconventional CPU. In this work, we explore using a Digital Annealing Unit (DAU)\nto tackle these large-scale optimization problems more efficiently by solving\nQuadratic Unconstrained Binary Optimization (QUBO). Two types of QUBO models\nare constructed in this work: one using quantum annealing and the other using\nML. Both models are built and tested on four high-throughput experimentation\n(HTE) datasets and selected Reaxys datasets. Our results suggest that the\nperformance of models is comparable to classical ML methods (i.e., Random\nForest and Multilayer Perceptron (MLP)), while the inference time of our models\nrequires only seconds with a DAU. Additionally, in campaigns involving active\nlearning and autonomous design of reaction conditions to achieve higher\nreaction yield, our model demonstrates significant improvements by adding new\ndata, showing promise of adopting our method in the iterative nature of such\nproblem settings. Our method can also accelerate the screening of billions of\nreaction conditions, achieving speeds millions of times faster than traditional\ncomputing units in identifying superior conditions. Therefore, leveraging the\nDAU with our developed QUBO models has the potential to be a valuable tool for\ninnovative chemical synthesis.\n","subjects":["Physics/Chemical Physics","Computing Research Repository/Emerging Technologies","Physics/Data Analysis, Statistics and Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}