{"id":"2407.06910","title":"Fine-grained large-scale content recommendations for MSX sellers","authors":"Manpreet Singh, Ravdeep Pasricha, Ravi Prasad Kondapalli, Kiran R,\n  Nitish Singh, Akshita Agarwalla, Manoj R, Manish Prabhakar, Laurent Bou\\'e","authorsParsed":[["Singh","Manpreet",""],["Pasricha","Ravdeep",""],["Kondapalli","Ravi Prasad",""],["R","Kiran",""],["Singh","Nitish",""],["Agarwalla","Akshita",""],["R","Manoj",""],["Prabhakar","Manish",""],["Boué","Laurent",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 14:46:09 GMT"}],"updateDate":"2024-07-10","timestamp":1720536369000,"abstract":"  One of the most critical tasks of Microsoft sellers is to meticulously track\nand nurture potential business opportunities through proactive engagement and\ntailored solutions. Recommender systems play a central role to help sellers\nachieve their goals. In this paper, we present a content recommendation model\nwhich surfaces various types of content (technical documentation, comparison\nwith competitor products, customer success stories etc.) that sellers can share\nwith their customers or use for their own self-learning. The model operates at\nthe opportunity level which is the lowest possible granularity and the most\nrelevant one for sellers. It is based on semantic matching between metadata\nfrom the contents and carefully selected attributes of the opportunities.\nConsidering the volume of seller-managed opportunities in organizations such as\nMicrosoft, we show how to perform efficient semantic matching over a very large\nnumber of opportunity-content combinations. The main challenge is to ensure\nthat the top-5 relevant contents for each opportunity are recommended out of a\ntotal of $\\approx 40,000$ published contents. We achieve this target through an\nextensive comparison of different model architectures and feature selection.\nFinally, we further examine the quality of the recommendations in a\nquantitative manner using a combination of human domain experts as well as by\nusing the recently proposed \"LLM as a judge\" framework.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"exnFRtLo3zLf3bYgx4OT0uZubVt4PjJfC7FFZMmL7Es","pdfSize":"2431093"}
