{"id":"2407.19365","title":"Seamless Website Fingerprinting in Multiple Environments","authors":"Chuxu Song, Zining Fan, Hao Wang, Richard Martin","authorsParsed":[["Song","Chuxu",""],["Fan","Zining",""],["Wang","Hao",""],["Martin","Richard",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 02:18:30 GMT"}],"updateDate":"2024-07-30","timestamp":1722133110000,"abstract":"  Website fingerprinting (WF) attacks identify the websites visited over\nanonymized connections by analyzing patterns in network traffic flows, such as\npacket sizes, directions, or interval times using a machine learning\nclassifier. Previous studies showed WF attacks achieve high classification\naccuracy. However, several issues call into question whether existing WF\napproaches are realizable in practice and thus motivate a re-exploration. Due\nto Tor's performance issues and resulting poor browsing experience, the vast\nmajority of users opt for Virtual Private Networking (VPN) despite VPNs weaker\nprivacy protections. Many other past assumptions are increasingly unrealistic\nas web technology advances. Our work addresses several key limitations of prior\nart. First, we introduce a new approach that classifies entire websites rather\nthan individual web pages. Site-level classification uses traffic from all site\ncomponents, including advertisements, multimedia, and single-page applications.\nSecond, our Convolutional Neural Network (CNN) uses only the jitter and size of\n500 contiguous packets from any point in a TCP stream, in contrast to prior\nwork requiring heuristics to find page boundaries. Our seamless approach makes\neavesdropper attack models realistic. Using traces from a controlled browser,\nwe show our CNN matches observed traffic to a website with over 90% accuracy.\nWe found the training traffic quality is critical as classification accuracy is\nsignificantly reduced when the training data lacks variability in network\nlocation, performance, and clients' computational capability. We enhanced the\nbase CNN's efficacy using domain adaptation, allowing it to discount irrelevant\nfeatures, such as network location. Lastly, we evaluate several defensive\nstrategies against seamless WF attacks.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tMpUVAmHuZBE6u__KnIimpw_3uiv9hdwsuAhO0zTbGg","pdfSize":"2491804"}
