{"id":"2407.03769","title":"Nonlinear compressive reduced basis approximation for multi-parameter\n  elliptic problem","authors":"Christophe Prud'Homme (IRMA), Yvon Maday (LJLL (UMR\\_7598)), Hassan\n  Ballout (IRMA)","authorsParsed":[["Prud'Homme","Christophe","","IRMA"],["Maday","Yvon","","LJLL"],["Ballout","Hassan","","IRMA"]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 09:28:57 GMT"}],"updateDate":"2024-07-08","timestamp":1720085337000,"abstract":"  Reduced basis methods for approximating the solutions of parameter-dependant\npartial differential equations (PDEs) are based on learning the structure of\nthe set of solutions - seen as a manifold ${\\mathcal S}$ in some functional\nspace - when the parameters vary. This involves investigating the manifold and,\nin particular, understanding whether it is close to a low-dimensional affine\nspace. This leads to the notion of Kolmogorov $N$-width that consists of\nevaluating to which extent the best choice of a vectorial space of dimension\n$N$ approximates ${\\mathcal S}$ well enough. If a good approximation of\nelements in ${\\mathcal S}$ can be done with some well-chosen vectorial space of\ndimension $N$ -- provided $N$ is not too large -- then a ``reduced'' basis can\nbe proposed that leads to a Galerkin type method for the approximation of any\nelement in ${\\mathcal S}$. In many cases, however, the Kolmogorov $N$-width is\nnot so small, even if the parameter set lies in a space of small dimension\nyielding a manifold with small dimension. In terms of complexity reduction,\nthis gap between the small dimension of the manifold and the large Kolmogorov\n$N$-width can be explained by the fact that the Kolmogorov $N$-width is linear\nwhile, in contrast, the dependency in the parameter is, most often, non-linear.\nThere have been many contributions aiming at reconciling these two statements,\neither based on deterministic or AI approaches. We investigate here further a\nnew paradigm that, in some sense, merges these two aspects: the nonlinear\ncompressive reduced basisapproximation. We focus on a simple multiparameter\nproblem and illustrate rigorously that the complexity associated with the\napproximation of the solution to the parameter dependant PDE is directly\nrelated to the number of parameters rather than the Kolmogorov $N$-width.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}