{"id":"2407.02970","title":"Spectroscopic Performance of Detectors for Athena's WFI: Measurements\n  and Simulation","authors":"Johannes M\\\"uller-Seidlitz, Robert Andritschke, Valentin Emberger,\n  Michael Bonholzer, G\\\"unter Hauser, Peter Lechner, Astrid Mayr, Jonas\n  Reiffers, Anna Schweingruber, Wolfgang Treberspurg","authorsParsed":[["Müller-Seidlitz","Johannes",""],["Andritschke","Robert",""],["Emberger","Valentin",""],["Bonholzer","Michael",""],["Hauser","Günter",""],["Lechner","Peter",""],["Mayr","Astrid",""],["Reiffers","Jonas",""],["Schweingruber","Anna",""],["Treberspurg","Wolfgang",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 10:09:18 GMT"}],"updateDate":"2024-07-05","timestamp":1720001358000,"abstract":"  The depleted p-channel field effect transistor is the chosen sensor type for\nthe Wide Field Imager of the Athena mission. It will be used in two types of\ncameras. One will enable observations of a field of view of 40' x 40' by using\nan array of four 512 x 512 pixel sensors in a 2 x 2 configuration. A second,\nsmall one is designed to investigate bright, point-like sources with a time\nresolution of up to 40 microseconds. Sensors of final size, layout, and\ntechnology were fabricated, assembled and characterised. Also, first results\nfrom the flight production are available and confirm the excellent performance.\nIn order to be able to estimate the future performance of degraded detectors, a\nsimulation was developed that takes into account the non-analytical threshold\neffects on the basis of measurement results. We present the measurement\nanalysis and the comparison of simulated and measured values as well as first\nattempts to use the Monte Carlo simulation to predict performance results based\non noise measurements.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"C1pO4qbmAwz5bm5jFwnXCqDLw8Jy7orpuWM-G01N1l4","pdfSize":"2690377"}
