{"id":"2407.13894","title":"Encoding spatiotemporal asymmetry in artificial cilia with a\n  ctenophore-inspired soft-robotic platform","authors":"David J. Peterman and Margaret L. Byron","authorsParsed":[["Peterman","David J.",""],["Byron","Margaret L.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 20:44:05 GMT"}],"updateDate":"2024-07-22","timestamp":1721335445000,"abstract":"  A remarkable variety of organisms use metachronal coordination (i.e.,\nnumerous neighboring appendages beating sequentially with a fixed phase lag) to\nswim or pump fluid. This coordination strategy is used by microorganisms to\nbreak symmetry at small scales where viscous effects dominate and flow is\ntime-reversible. Some larger organisms use this swimming strategy at\nintermediate scales, where viscosity and inertia both play important roles.\nHowever, the role of individual propulsor kinematics - especially across\nhydrodynamic scales - is not well-understood, though the details of propulsor\nmotion can be crucial for the efficient generation of flow. To investigate this\nbehavior, we developed a new soft robotic platform using magnetoactive silicone\nelastomers to mimic the metachronally coordinated propulsors found in swimming\norganisms. Furthermore, we present a method to passively encode spatially\nasymmetric beating patterns in our artificial propulsors. We investigated the\nkinematics and hydrodynamics of three propulsor types, with varying degrees of\nasymmetry, using Particle Image Velocimetry and high-speed videography. We find\nthat asymmetric beating patterns can move considerably more fluid relative to\nsymmetric beating at the same frequency and phase lag, and that asymmetry can\nbe passively encoded into propulsors via the interplay between elastic and\nmagnetic torques. Our results demonstrate that nuanced differences in propulsor\nkinematics can substantially impact fluid pumping performance. Our soft robotic\nplatform also provides an avenue to explore metachronal coordination at the\nmeso-scale, which in turn can inform the design of future bioinspired pumping\ndevices and swimming robots.\n","subjects":["Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"nuWuNWMe4d0xcu3gNfgTcBUx-mfVddhHfRbUGjAnpSU","pdfSize":"1448860","objectId":"0x3feaa04edb221a642a45213c5fcd31596606d6b23d800b8435f423ea7bddcae2","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
