{"id":"2407.18458","title":"Phase engineering of giant second harmonic generation in Bi$_2$O$_2$Se","authors":"Zhefeng Lou, Yingjie Zhao, Zhihao Gong, Ziye Zhu, Mengqi Wu, Tao Wang,\n  Jialu Wang, Haoyu Qi, Huakun Zuo, Zhuokai Xu, Jichuang Shen, Zhiwei Wang, Lan\n  Li, Shuigang Xu, Wei Kong, Wenbin Li, Xiaorui Zheng, Hua Wang and Xiao Lin","authorsParsed":[["Lou","Zhefeng",""],["Zhao","Yingjie",""],["Gong","Zhihao",""],["Zhu","Ziye",""],["Wu","Mengqi",""],["Wang","Tao",""],["Wang","Jialu",""],["Qi","Haoyu",""],["Zuo","Huakun",""],["Xu","Zhuokai",""],["Shen","Jichuang",""],["Wang","Zhiwei",""],["Li","Lan",""],["Xu","Shuigang",""],["Kong","Wei",""],["Li","Wenbin",""],["Zheng","Xiaorui",""],["Wang","Hua",""],["Lin","Xiao",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 01:55:16 GMT"}],"updateDate":"2024-07-29","timestamp":1721958916000,"abstract":"  Two-dimensional (2D) materials with remarkable second-harmonic generation\n(SHG) hold promise for future on-chip nonlinear optics. Relevant materials with\nboth giant SHG response and environmental stability are long-sought targets.\nHere, we demonstrate the enormous SHG from the phase engineering of a\nhigh-performance semiconductor, Bi$_2$O$_2$Se (BOS), under uniaxial strain. SHG\nsignals captured in strained 20 nm-BOS films exceed those of NbOI$_2$ and\nNbOCl$_2$ of similar thickness by a factor of 10, and are four orders of\nmagnitude higher than monolayer-MoS$_2$, resulting in a significant\nsecond-order nonlinear susceptibility on the order of 1 nm V$^{-1}$.\nIntriguingly, the strain enables continuous adjustment of the ferroelectric\nphase transition across room temperature. Consequently, an exceptionally large\ntunability of SHG, approximately six orders of magnitude, is achieved through\nstrain or thermal modulation. This colossal SHG, originating from the geometric\nphase of Bloch wave functions and coupled with sensitive tunability through\nmultiple approaches in this air-stable 2D semiconductor, opens new\npossibilities for designing chip-scale, switchable nonlinear optical devices.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}