{"id":"2407.12857","title":"Automated Peer Reviewing in Paper SEA: Standardization, Evaluation, and\n  Analysis","authors":"Jianxiang Yu, Zichen Ding, Jiaqi Tan, Kangyang Luo, Zhenmin Weng,\n  Chenghua Gong, Long Zeng, Renjing Cui, Chengcheng Han, Qiushi Sun, Zhiyong\n  Wu, Yunshi Lan, Xiang Li","authorsParsed":[["Yu","Jianxiang",""],["Ding","Zichen",""],["Tan","Jiaqi",""],["Luo","Kangyang",""],["Weng","Zhenmin",""],["Gong","Chenghua",""],["Zeng","Long",""],["Cui","Renjing",""],["Han","Chengcheng",""],["Sun","Qiushi",""],["Wu","Zhiyong",""],["Lan","Yunshi",""],["Li","Xiang",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 15:06:14 GMT"}],"updateDate":"2024-07-19","timestamp":1720537574000,"abstract":"  In recent years, the rapid increase in scientific papers has overwhelmed\ntraditional review mechanisms, resulting in varying quality of publications.\nAlthough existing methods have explored the capabilities of Large Language\nModels (LLMs) for automated scientific reviewing, their generated contents are\noften generic or partial. To address the issues above, we introduce an\nautomated paper reviewing framework SEA. It comprises of three modules:\nStandardization, Evaluation, and Analysis, which are represented by models\nSEA-S, SEA-E, and SEA-A, respectively. Initially, SEA-S distills data\nstandardization capabilities of GPT-4 for integrating multiple reviews for a\npaper. Then, SEA-E utilizes standardized data for fine-tuning, enabling it to\ngenerate constructive reviews. Finally, SEA-A introduces a new evaluation\nmetric called mismatch score to assess the consistency between paper contents\nand reviews. Moreover, we design a self-correction strategy to enhance the\nconsistency. Extensive experimental results on datasets collected from eight\nvenues show that SEA can generate valuable insights for authors to improve\ntheir papers.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Digital Libraries","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/"}