{"id":"2407.04214","title":"Investigating symptom duration using current status data: a case study\n  of post-acute COVID-19 syndrome","authors":"Charles J. Wolock, Susan Jacob, Julia C. Bennett, Anna Elias-Warren,\n  Jessica O'Hanlon, Avi Kenny, Nicholas P. Jewell, Andrea Rotnitzky, Stephen R.\n  Cole, Ana A. Weil, Helen Y. Chu, Marco Carone","authorsParsed":[["Wolock","Charles J.",""],["Jacob","Susan",""],["Bennett","Julia C.",""],["Elias-Warren","Anna",""],["O'Hanlon","Jessica",""],["Kenny","Avi",""],["Jewell","Nicholas P.",""],["Rotnitzky","Andrea",""],["Cole","Stephen R.",""],["Weil","Ana A.",""],["Chu","Helen Y.",""],["Carone","Marco",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 01:52:30 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 18:01:44 GMT"}],"updateDate":"2024-08-30","timestamp":1720144350000,"abstract":"  For infectious diseases, characterizing symptom duration is of clinical and\npublic health importance. Symptom duration may be assessed by surveying\ninfected individuals and querying symptom status at the time of survey\nresponse. For example, in a SARS-CoV-2 testing program at the University of\nWashington, participants were surveyed at least 28 days after testing positive\nand asked to report current symptom status. This study design yielded current\nstatus data: outcome measurements for each respondent consisted only of the\ntime of survey response and a binary indicator of whether symptoms had resolved\nby that time. Such study design benefits from limited risk of recall bias, but\nanalyzing the resulting data necessitates tailored statistical tools. Here, we\nreview methods for current status data and describe a novel application of\nmodern nonparametric techniques to this setting. The proposed approach is valid\nunder weaker assumptions compared to existing methods, allows use of flexible\nmachine learning tools, and handles potential survey nonresponse. From the\nuniversity study, we estimate that 19% of participants experienced ongoing\nsymptoms 30 days after testing positive, decreasing to 7% at 90 days. Female\nsex, history of seasonal allergies, fatigue during acute infection, and higher\nviral load were associated with slower symptom resolution.\n","subjects":["Statistics/Applications","Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}