{"id":"2407.06775","title":"Empirical mass-loss rates and clumping properties of O-type stars in the\n  LMC","authors":"C. Hawcroft, L. Mahy, H. Sana, J.O. Sundqvist, M. Abdul-Masih, S. A.\n  Brands, L. Decin, A. deKoter, and J. Puls","authorsParsed":[["Hawcroft","C.",""],["Mahy","L.",""],["Sana","H.",""],["Sundqvist","J. O.",""],["Abdul-Masih","M.",""],["Brands","S. A.",""],["Decin","L.",""],["deKoter","A.",""],["Puls","J.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 11:47:05 GMT"}],"updateDate":"2024-07-10","timestamp":1720525625000,"abstract":"  We constrain wind parameters of a sample of 18 O-type stars in the LMC,\nthrough analysis with stellar atmosphere and wind models including the effects\nof optically thick clumping. This allows us to determine the most accurate\nspectroscopic mass-loss and wind structure properties of massive stars at\nsub-solar metallicity to date and gain insight into the impact of metallicity\non massive stellar winds. Combining high signal to noise (S/N) ratio\nspectroscopy in the UV and optical gives us access to diagnostics of multiple\ndifferent physical processes in the stellar wind. We produce synthetic spectra\nusing the stellar atmosphere modelling code FASTWIND, and reproduce the\nobserved spectra using a genetic algorithm based fitting technique. We\nempirically constrain 15 physical parameters associated with the stellar and\nwind properties, including temperature, surface gravity, surface abundances,\nrotation, macroturbulence and wind parameters. We find, on average, mass-loss\nrates a factor of 4-5 lower than those predicted by Vink et al. 2001, in good\nagreement with predictions from Bjorklund et al. 2021, and the best agreement\nwith those from Krticka et al. 2018. In the 'weak-wind' regime we find\nmass-loss rates orders of magnitude below any theoretical predictions. We find\na positive correlation of clumping factors (fcl) with effective temperature\nwith an average fcl = 14 +- 8 for the full sample. Above 38 kK an average 46 +-\n24% of the wind velocity span is covered by clumps and the interclump density\nis 10-30% of the mean wind. Below an effective temperature of roughly 38 kK\nthere must be additional light leakage for supergiants. For dwarf stars at low\ntemperatures there is a statistical preference for very low clump velocity\nspans, however it is unclear if this can be physically motivated as there are\nno clearly observable wind signatures in UV diagnostics.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}