{"id":"2407.13628","title":"Unruh-DeWitt Quantum Computing: Realizing Quantum Shannon Theory With\n  Quantum Fields","authors":"Eric W. Aspling","authorsParsed":[["Aspling","Eric W.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:00:49 GMT"}],"updateDate":"2024-07-19","timestamp":1721318449000,"abstract":"  Qubit-field quantum transduction provides numerous advantages to quantum\ncomputing, such as device-specific error-correcting codes, efficient\nscalability, and effective entanglement generation. An all-to-all connected bus\nof qubits implanted around the outside of a topological insulator, allowed to\ninteract with the edge state, is a promising arena for transduction with flying\nfermionic qubits. Unruh--DeWitt detectors have allowed quantum information\nscientists to model entanglement properties of qubit-field interactions in many\nsettings in a field known as Relativistic Quantum Information (RQI).\nUnruh--DeWitt detectors are useful tools to realize quantum Shannon theory, a\nsubset of the theory of quantum communication, in condensed matter systems,\naptly named Unruh--DeWitt quantum computers. These systems will provide\nquantitative measurements of communication in quantum materials that utilize\ncoherent states for bosonic and fermionic fields. In this thesis, emphasis is\nplaced on the well-studied theory of Tomonaga-Luttinger liquids, as the\nbosonization of a helical Luttinger liquid provides a pedagogical arena to\nconstruct RQI channels of fermionic systems. Multiple experimentally realizable\nsystems are proposed, and design constraints are constructed to ensure maximum\nchannel capacity. Furthermore, we elucidate the strength of these quantum\nchannels using measurements from quantum Shannon theory such as coherent\ninformation, dephasing formalism, diamond distance and universality of\nUnruh--DeWitt quantum logic gates.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Materials Science","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}