{"id":"2407.14698","title":"Investigating Student Participation in Quantum Workforce Initiatives","authors":"Michael B. Bennett and Joan \\'E. Arrow and Sasha Novack and Noah D.\n  Finkelstein","authorsParsed":[["Bennett","Michael B.",""],["Arrow","Joan É.",""],["Novack","Sasha",""],["Finkelstein","Noah D.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 23:15:15 GMT"}],"updateDate":"2024-07-23","timestamp":1721430915000,"abstract":"  As the focus of quantum science shifts from basic research to development and\nimplementation of applied quantum technology, calls for a robust, diverse\nquantum workforce have increased. However, little research has been done on the\ndesign and impact on participants of workforce preparation efforts outside of\nR1 contexts. In order to begin to answer the question of how program design can\nor should attend to the needs and interests of diverse groups of students, we\nperformed interviews with students from two Colorado-based quantum\neducation/workforce development programs, one in an undergraduate R1 setting\nand one in a distributed community setting and serving students largely from\ntwo-year colleges. Through analysis of these interviews, we were able to\nhighlight differences between the student populations in the two programs in\nterms of participation goals, prior and general awareness of quantum science,\nand career interest and framing of career trajectories. While both groups of\nstudents reported benefits from program participation, we highlight the ways in\nwhich students' different needs and contexts have informed divergent\ndevelopment of the two programs, framing contextual design of quantum education\nand workforce efforts as an issue of equity and representation for the\nburgeoning quantum workforce.\n","subjects":["Physics/Physics Education","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"jBWGOyCjPpyauwf2e1RXo5pd-UT4iUMx_8KA0vgMWdA","pdfSize":"330884"}
