{"id":"2407.04764","title":"Should zeros count? Modeling the galaxy-globular cluster scaling\n  relation with(out) zero-inflated count models","authors":"Samantha C. Berek, Gwendolyn M. Eadie, Joshua S. Speagle, Shu Yan Wang","authorsParsed":[["Berek","Samantha C.",""],["Eadie","Gwendolyn M.",""],["Speagle","Joshua S.",""],["Wang","Shu Yan",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-09","timestamp":1720202400000,"abstract":"  The scaling relation between the size of a galaxy's globular cluster (GC)\npopulation ($N_{GC}$) and the galaxy's stellar mass ($M_*$) is usually\ndescribed with a continuous, linear model, but in reality it is a count\nrelationship that should be modeled as such. For massive galaxies, a negative\nbinomial (NB) model has been shown to describe the data well, but it is unclear\nhow the scaling relation behaves at low galaxy masses where a substantial\nportion of galaxies have $N_{GC}=0$. In this work, we test the utility of\nPoisson and NB models for describing the low-mass end of the $N_{GC}-M_*$\nscaling relation. We introduce the use of zero-inflated versions of these\nmodels, which allow for larger zero populations (e.g. galaxies without GCs)\nthan would otherwise be predicted. We evaluate our models with a variety of\npredictive model comparison methods, including predictive intervals,\nleave-one-out cross-validation criterion, and posterior predictive comparisons.\nWe find that the NB model is consistent with our data, but the naive Poisson is\nnot. Moreover, we find that zero inflation of the models is not necessary to\ndescribe the population of low-mass galaxies that lack GCs, suggesting that a\nsingle formation and evolutionary process acts over all galaxy masses. Under\nthe NB model, there does not appear to be anything unique about the lack of GCs\nin many low-mass galaxies; they are simply the low-mass extension of the larger\n$N_{GC}-M_*$ scaling relation.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}