{"id":"2407.06225","title":"On the Scientific Method: The Role of Hypotheses and Involved\n  Mathematics","authors":"Mario Milanese, Carlo Novara, Michele Taragna","authorsParsed":[["Milanese","Mario",""],["Novara","Carlo",""],["Taragna","Michele",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 08:48:31 GMT"}],"updateDate":"2024-07-10","timestamp":1720255711000,"abstract":"  Many scientific problems aim to evaluate the function fo relating variables u\nand y measured from a physical phenomenon. An exact knowledge of fo cannot be\nexpected, and many methods are used for deriving approximate functions fa\ngiving small error fo-fa. It is shown that deriving functions fa having finite\nerror is not possible using measured data only, and hypothesis, i.e.,\nassumptions, on the function fo and on the disturbances corrupting the\nmeasurements must be introduced. Two main classes of assumptions are used in\nthe literature. The most widely used is the Parametric Stochastic class, where\nfo is assumed to be a function depending on a vector p and disturbances are\nstochastic variables. In last decades, assumptions belonging to Set Membership\nclass have been investigated, where fo is assumed to a smooth function with\nbounded smoothness parameter and disturbances are bounded variables. At first,\nit is shown that SM methods achieve \"theoretical\" properties (e.g., finding fa\nwith known and minimal error error, if assumptions hold) for general nonlinear\nassumptions on function fo, while are achieved by PS methods under very\nrestricted assumptions on fo. Then, it is proved that no method can be found\nfor validating PS or SM assumptions, so that at best the chosen assumptions can\nbe falsified, i.e. recognized not true. No falsification test of PS assumptions\nis known, for general nonlinear assumptions on fo. A falsification test of SM\nassumptions is proposed. Finally, the new class of Physical Set Membership\nassumptions is proposed, able to integrate the information provided by a\nfunction fp obtained by a PS method, with a suitably designed SM method. It is\nshown that PSM methods enjoy the strong results of SM methods on theoretical\nproperties and assumption falsification, and that, making use of the\ninformation provided by fp, may be more accurate than using only SM\nassumptions.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}