{"id":"2407.00956","title":"A Closer Look at Deep Learning on Tabular Data","authors":"Han-Jia Ye, Si-Yang Liu, Hao-Run Cai, Qi-Le Zhou, De-Chuan Zhan","authorsParsed":[["Ye","Han-Jia",""],["Liu","Si-Yang",""],["Cai","Hao-Run",""],["Zhou","Qi-Le",""],["Zhan","De-Chuan",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 04:24:07 GMT"}],"updateDate":"2024-07-02","timestamp":1719807847000,"abstract":"  Tabular data is prevalent across various domains in machine learning.\nAlthough Deep Neural Network (DNN)-based methods have shown promising\nperformance comparable to tree-based ones, in-depth evaluation of these methods\nis challenging due to varying performance ranks across diverse datasets. In\nthis paper, we propose a comprehensive benchmark comprising 300 tabular\ndatasets, covering a wide range of task types, size distributions, and domains.\nWe perform an extensive comparison between state-of-the-art deep tabular\nmethods and tree-based methods, revealing the average rank of all methods and\nhighlighting the key factors that influence the success of deep tabular\nmethods. Next, we analyze deep tabular methods based on their training\ndynamics, including changes in validation metrics and other statistics. For\neach dataset-method pair, we learn a mapping from both the meta-features of\ndatasets and the first part of the validation curve to the final validation set\nperformance and even the evolution of validation curves. This mapping extracts\nessential meta-features that influence prediction accuracy, helping the\nanalysis of tabular methods from novel aspects. Based on the performance of all\nmethods on this large benchmark, we identify two subsets of 45 datasets each.\nThe first subset contains datasets that favor either tree-based methods or\nDNN-based methods, serving as effective analysis tools to evaluate strategies\n(e.g., attribute encoding strategies) for improving deep tabular models. The\nsecond subset contains datasets where the ranks of methods are consistent with\nthe overall benchmark, acting as a probe for tabular analysis. These ``tiny\ntabular benchmarks'' will facilitate further studies on tabular data.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}