{"id":"2407.21339","title":"A Cooperation Control Framework Based on Admittance Control and\n  Time-varying Passive Velocity Field Control for Human--Robot Co-carrying\n  Tasks","authors":"Dang Van Trong, Sumitaka Honji, Takahiro Wada","authorsParsed":[["Van Trong","Dang",""],["Honji","Sumitaka",""],["Wada","Takahiro",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 05:13:31 GMT"}],"updateDate":"2024-08-01","timestamp":1722402811000,"abstract":"  Human--robot co-carrying tasks demonstrate their potential in both industrial\nand everyday applications by leveraging the strengths of both parties.\nEffective control of robots in these tasks requires minimizing position and\nvelocity errors to complete the shared tasks while also managing the energy\nlevel within the closed-loop systems to prevent potential dangers such as\ninstability and unintended force exertion. However, this collaboration scenario\nposes numerous challenges due to varied human intentions in adapting to\nworkspace characteristics, leading to human--robot conflicts and safety\nincidents. In this paper, we develop a robot controller that enables the robot\npartner to re-plan its path leveraging conflict information, follow co-carrying\nmotions accurately, ensure passivity, and regular the energy of the closed-loop\nsystem. A cooperation control framework for human--robot co-carrying tasks is\nconstructed by utilizing admittance control and time-varying Passive Velocity\nField Control with a fractional exponent energy compensation control term. By\nmeasuring the interaction force, the desired trajectory of co-carrying tasks\nfor the robot partner is first generated using admittance control. Thereafter,\nthe new Passive Velocity Field Control with the energy compensation feature is\ndesigned to track the desired time-varying trajectory and guarantee passivity.\nFurthermore, the proposed approach ensures that the system's kinetic energy\nconverges to the desired level within a finite time interval, which is critical\nfor time-critical applications. Numerical simulation demonstrates the\nefficiency of the proposed cooperation control method through four\ncollaborative transportation scenarios.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}