{"id":"2407.02283","title":"A Refreshed Similarity-based Upsampler for Direct High-Ratio Feature\n  Upsampling","authors":"Minghao Zhou, Hong Wang, Yefeng Zheng, Deyu Meng","authorsParsed":[["Zhou","Minghao",""],["Wang","Hong",""],["Zheng","Yefeng",""],["Meng","Deyu",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 14:12:21 GMT"}],"updateDate":"2024-07-03","timestamp":1719929541000,"abstract":"  Feature upsampling is a fundamental and indispensable ingredient of almost\nall current network structures for image segmentation tasks. Recently, a\npopular similarity-based feature upsampling pipeline has been proposed, which\nutilizes a high-resolution feature as guidance to help upsample the\nlow-resolution deep feature based on their local similarity. Albeit achieving\npromising performance, this pipeline has specific limitations: 1) HR query and\nLR key features are not well aligned; 2) the similarity between query-key\nfeatures is computed based on the fixed inner product form; 3) neighbor\nselection is coarsely operated on LR features, resulting in mosaic artifacts.\nThese shortcomings make the existing methods along this pipeline primarily\napplicable to hierarchical network architectures with iterative features as\nguidance and they are not readily extended to a broader range of structures,\nespecially for a direct high-ratio upsampling. Against the issues, we\nmeticulously optimize every methodological design. Specifically, we firstly\npropose an explicitly controllable query-key feature alignment from both\nsemantic-aware and detail-aware perspectives, and then construct a\nparameterized paired central difference convolution block for flexibly\ncalculating the similarity between the well-aligned query-key features.\nBesides, we develop a fine-grained neighbor selection strategy on HR features,\nwhich is simple yet effective for alleviating mosaic artifacts. Based on these\ncareful designs, we systematically construct a refreshed similarity-based\nfeature upsampling framework named ReSFU. Extensive experiments substantiate\nthat our proposed ReSFU is finely applicable to various types of architectures\nin a direct high-ratio upsampling manner, and consistently achieves\nsatisfactory performance on different segmentation applications, showing\nsuperior generality and ease of deployment.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}