{"id":"2407.01248","title":"Quantifying the Impact of Biobanks and Cohort Studies","authors":"Rodrigo Dorantes-Gilardi, Kerry Ivey, Lauren Costa, Rachael Matty,\n  Kelly Cho, John Michael Gaziano and Albert-L\\'aszl\\'o Barab\\'asi","authorsParsed":[["Dorantes-Gilardi","Rodrigo",""],["Ivey","Kerry",""],["Costa","Lauren",""],["Matty","Rachael",""],["Cho","Kelly",""],["Gaziano","John Michael",""],["Barabási","Albert-László",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 12:51:39 GMT"}],"updateDate":"2024-07-02","timestamp":1719838299000,"abstract":"  Biobanks advance biomedical and clinical research by collecting and offering\ndata and biological samples for numerous studies. However, the impact of these\nrepositories varies greatly due to differences in their purpose, scope,\ngovernance, and data collected. Here, we computationally identified 2,663\nbiobanks and their textual mentions in 228,761 scientific articles, 16,210\ngrants, 15,469 patents, 1,769 clinical trials, and 9,468 public policy\ndocuments, helping characterize the academic communities that utilize and\nsupport them. We found a strong concentration of biobank-related research on a\nfew diseases, where 20\\% of publications focus on obesity, Alzheimer's disease,\nbreast cancer, and diabetes. Moreover, collaboration, rather than citation\ncount, shapes the community's recognition of a biobank. We show that, on\naverage, 41.1\\% of articles miss to reference any of the biobank's reference\npapers and 59.6\\% include a biobank member as a co-author. Using a generalized\nlinear model, we identified the key factors that contribute to the impact of a\nbiobank, finding that an impactful biobank tends to be more open to external\nresearchers, and that quality data -- especially linked medical records -- as\nopposed to large data, correlates with a higher impact in science, innovation,\nand disease. The collected data and findings are accessible through an\nopen-access web application intended to inform strategies to expand access and\nmaximize the value of these valuable resources.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Onx_wj6HUotsL3KHI-1JXuuFB0fu5L8J_DxkiQ3LK7I","pdfSize":"3735548","objectId":"0xb11711ee2405d336aad4fd26e2f16ec33c1bc4aa60892291c4338e2a8a390df7","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
