{"id":"2407.19653","title":"Unraveling the role of Ta in the phase transition of Pb(Ta1+xSe2)2 using\n  low-temperature Raman spectroscopy","authors":"Yu Ma, Chi Sin Tang, Xiaohui Yang, Yi Wei Ho, Jun Zhou, Wenjun Wu,\n  Shuo Sun, Jin-Ke Bao, Dingguan Wang, Xiao Lin, Magdalena Grzeszczyk, Shijie\n  Wang, Mark B H Breese, Chuanbing Cai, Andrew T. S. Wee, Maciej Koperski,\n  Zhu-An Xu, Xinmao Yin","authorsParsed":[["Ma","Yu",""],["Tang","Chi Sin",""],["Yang","Xiaohui",""],["Ho","Yi Wei",""],["Zhou","Jun",""],["Wu","Wenjun",""],["Sun","Shuo",""],["Bao","Jin-Ke",""],["Wang","Dingguan",""],["Lin","Xiao",""],["Grzeszczyk","Magdalena",""],["Wang","Shijie",""],["Breese","Mark B H",""],["Cai","Chuanbing",""],["Wee","Andrew T. S.",""],["Koperski","Maciej",""],["Xu","Zhu-An",""],["Yin","Xinmao",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 02:35:13 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 07:33:46 GMT"}],"updateDate":"2024-08-09","timestamp":1722220513000,"abstract":"  Phase engineering strategies in two-dimensional transition metal\ndichalcogenides (2D-TMDs) have garnered significant attention due to their\npotential applications in electronics, optoelectronics, and energy storage.\nVarious methods, including direct synthesis, pressure control, and chemical\ndoping, have been employed to manipulate structural transitions in 2D-TMDs.\nMetal intercalation emerges as an effective technique to modulate phase\ntransition dynamics by inserting external atoms or ions between the layers of\n2D-TMDs, altering their electronic structure and physical properties. Here, we\ninvestigate the significant structural phase transitions in Pb(Ta1+xSe2)2\nsingle crystals induced by Ta intercalation using a combination of Raman\nspectroscopy and first-principles calculations. The results highlight the\npivotal role of Ta atoms in driving these transitions and elucidate the\ninterplay between intercalation, phase transitions, and resulting electronic\nand vibrational properties in 2D-TMDs. By focusing on Pb(Ta1+xSe2)2 as an ideal\ncase study and investigating like metal intercalation, this study advances\nunderstanding in the field and paves the way for the development of novel\napplications for 2D-TMDs, offering insights into the potential of these\nmaterials for future technological advancements.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}