{"id":"2407.05995","title":"Analysis of genetic diversity among some Iraqi durum wheat cultivars\n  revealed by different molecular markers","authors":"Mihraban Sharif Maeruf, Djshwar Dhahir Lateef, Kamil Mahmood Mustafa,\n  Hero Fatih Hamakareem, Shang Hasseb Abdalqadir, Dastan Ahmad Ahmad, Shokhan\n  Mahmood Sleman, Kamaran Salh Rasul","authorsParsed":[["Maeruf","Mihraban Sharif",""],["Lateef","Djshwar Dhahir",""],["Mustafa","Kamil Mahmood",""],["Hamakareem","Hero Fatih",""],["Abdalqadir","Shang Hasseb",""],["Ahmad","Dastan Ahmad",""],["Sleman","Shokhan Mahmood",""],["Rasul","Kamaran Salh",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 14:44:33 GMT"}],"updateDate":"2024-07-09","timestamp":1720449873000,"abstract":"  Durum wheat has been cultivated since the beginning of crop domestication,\noccupying now the tenth ranking among the global most significant cultivated\ncrops. Despite the fact that, the extent of the crop genetic diversity has not\nyet fully incorporated into modern varieties through breeding programs. In this\nstudy, a total of 35 markers (11 RAPD, 12 ISSR, and 12 CDDP) were utilized to\nassess the genetic variability and population structure of sixteen different\ncultivars of Iraqi durum wheat. Out of 294 bands obtained, 171 were identified\nas polymorphic: 47.00 polymorphic alleles from 98 RAPD bands, 53 polymorphic\nalleles from a total of 89 ISSR bands, and 71 alleles from 107 CDDP bands. The\naverage number of observed alleles (Na), effective number of alleles (Ne),\nShannon's information index (I), expected heterozygosity or gene diversity\n(He), unbiased expected heterozygosity (uHe), and polymorphic information\ncontent (PIC) (1.45, 1.38, 0.32, 0.22, 0.24, and 0.28, respectively) were\nobtained for RAPDs , (1.63, 1.45, 0.40, 0.27, 0.29, and 0.32, respectively)\nISSRs and (1.35, 1.35, 0.31, 0.21, 0.23, and 0.30, respectively) for the CDDP\nmarkers. A dendrogram of two main clades (unweighted pair group method with\narithmetic mean; UPGMA) and three populations of structure analysis, were\nobtained based on the three markers data. The analysis of molecular variance\nindicated 97.00%, 97.00%, and 90.00% variability within populations, applying\nRAPD, ISSR, and CDDP markers, respectively. The highest diversity indices were\nrevealed in population 2 under the RAPD and CDDP markers, whereas population 1\nhad the highest values of these indices according to the ISSR markers. The\nresults provide greater knowledge on the genetic makeup of Iraqi durum wheat\ncultivars, that facilitate future breeding programs of this crop.\n","subjects":["Quantitative Biology/Populations and Evolution","Quantitative Biology/Genomics"],"license":"http://creativecommons.org/licenses/by/4.0/"}