{"id":"2407.16080","title":"Setting of the Poincar\\'e section for accurately calculating the phase\n  of rhythmic spatiotemporal dynamics","authors":"Takahiro Arai, Yoji Kawamura, Toshio Aoyagi","authorsParsed":[["Arai","Takahiro",""],["Kawamura","Yoji",""],["Aoyagi","Toshio",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 22:44:15 GMT"}],"updateDate":"2024-07-24","timestamp":1721688255000,"abstract":"  The synchronization analysis of limit-cycle oscillators is prevalent in many\nfields, including physics, chemistry, and life sciences. It relies on the phase\ncalculation that utilizes measurements. However, the synchronization of\nspatiotemporal dynamics cannot be analyzed because a standardized method for\ncalculating the phase has not been established. The presence of spatial\nstructure complicates the determination of which measurements should be used\nfor accurate phase calculation. To address this, we explore a method for\ncalculating the phase from the time series of measurements taken at a single\nspatial grid point. The phase is calculated to increase linearly between event\ntimes when the measurement time series intersects the Poincar\\'e section. The\ndifference between the calculated phase and the isochron-based phase, resulting\nfrom the discrepancy between the isochron and the Poincar\\'e section, is\nevaluated using a linear approximation near the limit-cycle solution. We found\nthat the difference is small when measurements are taken from regions that\ndominate the rhythms of the entire spatiotemporal dynamics. Furthermore, we\ninvestigate an alternative method where the Poincar\\'e section is applied to\nthe time series obtained through orthogonal decomposition of the entire\nspatiotemporal dynamics. We present two decomposition schemes that utilize the\nprincipal component analysis. For illustration, the phase is calculated from\nthe measurements of spatiotemporal dynamics exhibiting target waves or\noscillating spots, simulated by weakly coupled FitzHugh-Nagumo\nreaction-diffusion models.\n","subjects":["Nonlinear Sciences/Adaptation and Self-Organizing Systems","Physics/Data Analysis, Statistics and Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}