{"id":"2407.05954","title":"Causality-driven Sequence Segmentation for Enhancing Multiphase\n  Industrial Process Data Analysis and Soft Sensing","authors":"Yimeng He, Le Yao, Xinmin Zhang, Xiangyin Kong and Zhihuan Song","authorsParsed":[["He","Yimeng",""],["Yao","Le",""],["Zhang","Xinmin",""],["Kong","Xiangyin",""],["Song","Zhihuan",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 10:40:54 GMT"}],"updateDate":"2024-07-09","timestamp":1719744054000,"abstract":"  The dynamic characteristics of multiphase industrial processes present\nsignificant challenges in the field of industrial big data modeling.\nTraditional soft sensing models frequently neglect the process dynamics and\nhave difficulty in capturing transient phenomena like phase transitions. To\naddress this issue, this article introduces a causality-driven sequence\nsegmentation (CDSS) model. This model first identifies the local dynamic\nproperties of the causal relationships between variables, which are also\nreferred to as causal mechanisms. It then segments the sequence into different\nphases based on the sudden shifts in causal mechanisms that occur during phase\ntransitions. Additionally, a novel metric, similarity distance, is designed to\nevaluate the temporal consistency of causal mechanisms, which includes both\ncausal similarity distance and stable similarity distance. The discovered\ncausal relationships in each phase are represented as a temporal causal graph\n(TCG). Furthermore, a soft sensing model called temporal-causal graph\nconvolutional network (TC-GCN) is trained for each phase, by using the\ntime-extended data and the adjacency matrix of TCG. The numerical examples are\nutilized to validate the proposed CDSS model, and the segmentation results\ndemonstrate that CDSS has excellent performance on segmenting both stable and\nunstable multiphase series. Especially, it has higher accuracy in separating\nnon-stationary time series compared to other methods. The effectiveness of the\nproposed CDSS model and the TC-GCN model is also verified through a penicillin\nfermentation process. Experimental results indicate that the breakpoints\ndiscovered by CDSS align well with the reaction mechanisms and TC-GCN\nsignificantly has excellent predictive accuracy.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}