{"id":"2407.12687","title":"Towards Responsible Development of Generative AI for Education: An\n  Evaluation-Driven Approach","authors":"Irina Jurenka, Markus Kunesch, Kevin R. McKee, Daniel Gillick,\n  Shaojian Zhu, Sara Wiltberger, Shubham Milind Phal, Katherine Hermann, Daniel\n  Kasenberg, Avishkar Bhoopchand, Ankit Anand, Miruna P\\^islar, Stephanie Chan,\n  Lisa Wang, Jennifer She, Parsa Mahmoudieh, Aliya Rysbek, Wei-Jen Ko, Andrea\n  Huber, Brett Wiltshire, Gal Elidan, Roni Rabin, Jasmin Rubinovitz, Amit\n  Pitaru, Mac McAllister, Julia Wilkowski, David Choi, Roee Engelberg, Lidan\n  Hackmon, Adva Levin, Rachel Griffin, Michael Sears, Filip Bar, Mia Mesar,\n  Mana Jabbour, Arslan Chaudhry, James Cohan, Sridhar Thiagarajan, Nir Levine,\n  Ben Brown, Dilan Gorur, Svetlana Grant, Rachel Hashimshoni, Laura Weidinger,\n  Jieru Hu, Dawn Chen, Kuba Dolecki, Canfer Akbulut, Maxwell Bileschi, Laura\n  Culp, Wen-Xin Dong, Nahema Marchal, Kelsie Van Deman, Hema Bajaj Misra,\n  Michael Duah, Moran Ambar, Avi Caciularu, Sandra Lefdal, Chris Summerfield,\n  James An, Pierre-Alexandre Kamienny, Abhinit Mohdi, Theofilos Strinopoulous,\n  Annie Hale, Wayne Anderson, Luis C. Cobo, Niv Efron, Muktha Ananda, Shakir\n  Mohamed, Maureen Heymans, Zoubin Ghahramani, Yossi Matias, Ben Gomes, Lila\n  Ibrahim","authorsParsed":[["Jurenka","Irina",""],["Kunesch","Markus",""],["McKee","Kevin R.",""],["Gillick","Daniel",""],["Zhu","Shaojian",""],["Wiltberger","Sara",""],["Phal","Shubham Milind",""],["Hermann","Katherine",""],["Kasenberg","Daniel",""],["Bhoopchand","Avishkar",""],["Anand","Ankit",""],["Pîslar","Miruna",""],["Chan","Stephanie",""],["Wang","Lisa",""],["She","Jennifer",""],["Mahmoudieh","Parsa",""],["Rysbek","Aliya",""],["Ko","Wei-Jen",""],["Huber","Andrea",""],["Wiltshire","Brett",""],["Elidan","Gal",""],["Rabin","Roni",""],["Rubinovitz","Jasmin",""],["Pitaru","Amit",""],["McAllister","Mac",""],["Wilkowski","Julia",""],["Choi","David",""],["Engelberg","Roee",""],["Hackmon","Lidan",""],["Levin","Adva",""],["Griffin","Rachel",""],["Sears","Michael",""],["Bar","Filip",""],["Mesar","Mia",""],["Jabbour","Mana",""],["Chaudhry","Arslan",""],["Cohan","James",""],["Thiagarajan","Sridhar",""],["Levine","Nir",""],["Brown","Ben",""],["Gorur","Dilan",""],["Grant","Svetlana",""],["Hashimshoni","Rachel",""],["Weidinger","Laura",""],["Hu","Jieru",""],["Chen","Dawn",""],["Dolecki","Kuba",""],["Akbulut","Canfer",""],["Bileschi","Maxwell",""],["Culp","Laura",""],["Dong","Wen-Xin",""],["Marchal","Nahema",""],["Van Deman","Kelsie",""],["Misra","Hema Bajaj",""],["Duah","Michael",""],["Ambar","Moran",""],["Caciularu","Avi",""],["Lefdal","Sandra",""],["Summerfield","Chris",""],["An","James",""],["Kamienny","Pierre-Alexandre",""],["Mohdi","Abhinit",""],["Strinopoulous","Theofilos",""],["Hale","Annie",""],["Anderson","Wayne",""],["Cobo","Luis C.",""],["Efron","Niv",""],["Ananda","Muktha",""],["Mohamed","Shakir",""],["Heymans","Maureen",""],["Ghahramani","Zoubin",""],["Matias","Yossi",""],["Gomes","Ben",""],["Ibrahim","Lila",""]],"versions":[{"version":"v1","created":"Tue, 21 May 2024 19:27:59 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 14:03:41 GMT"}],"updateDate":"2024-07-22","timestamp":1716319679000,"abstract":"  A major challenge facing the world is the provision of equitable and\nuniversal access to quality education. Recent advances in generative AI (gen\nAI) have created excitement about the potential of new technologies to offer a\npersonal tutor for every learner and a teaching assistant for every teacher.\nThe full extent of this dream, however, has not yet materialised. We argue that\nthis is primarily due to the difficulties with verbalising pedagogical\nintuitions into gen AI prompts and the lack of good evaluation practices,\nreinforced by the challenges in defining excellent pedagogy. Here we present\nour work collaborating with learners and educators to translate high level\nprinciples from learning science into a pragmatic set of seven diverse\neducational benchmarks, spanning quantitative, qualitative, automatic and human\nevaluations; and to develop a new set of fine-tuning datasets to improve the\npedagogical capabilities of Gemini, introducing LearnLM-Tutor. Our evaluations\nshow that LearnLM-Tutor is consistently preferred over a prompt tuned Gemini by\neducators and learners on a number of pedagogical dimensions. We hope that this\nwork can serve as a first step towards developing a comprehensive educational\nevaluation framework, and that this can enable rapid progress within the AI and\nEdTech communities towards maximising the positive impact of gen AI in\neducation.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8MBC7c-T1yd91YgPD8hwKFsom5m8mDnAdLPv-EjypoE","pdfSize":"6088224"}
