{"id":"2407.07805","title":"SUMix: Mixup with Semantic and Uncertain Information","authors":"Huafeng Qin, Xin Jin, Hongyu Zhu, Hongchao Liao, Moun\\^im A.\n  El-Yacoubi and Xinbo Gao","authorsParsed":[["Qin","Huafeng",""],["Jin","Xin",""],["Zhu","Hongyu",""],["Liao","Hongchao",""],["El-Yacoubi","Mounîm A.",""],["Gao","Xinbo",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 16:25:26 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 11:46:52 GMT"},{"version":"v3","created":"Tue, 3 Sep 2024 10:46:10 GMT"},{"version":"v4","created":"Tue, 10 Sep 2024 14:49:18 GMT"},{"version":"v5","created":"Thu, 19 Sep 2024 08:10:22 GMT"}],"updateDate":"2024-09-20","timestamp":1720628726000,"abstract":"  Mixup data augmentation approaches have been applied for various tasks of\ndeep learning to improve the generalization ability of deep neural networks.\nSome existing approaches CutMix, SaliencyMix, etc. randomly replace a patch in\none image with patches from another to generate the mixed image. Similarly, the\ncorresponding labels are linearly combined by a fixed ratio $\\lambda$ by l. The\nobjects in two images may be overlapped during the mixing process, so some\nsemantic information is corrupted in the mixed samples. In this case, the mixed\nimage does not match the mixed label information. Besides, such a label may\nmislead the deep learning model training, which results in poor performance. To\nsolve this problem, we proposed a novel approach named SUMix to learn the\nmixing ratio as well as the uncertainty for the mixed samples during the\ntraining process. First, we design a learnable similarity function to compute\nan accurate mix ratio. Second, an approach is investigated as a regularized\nterm to model the uncertainty of the mixed samples. We conduct experiments on\nfive image benchmarks, and extensive experimental results imply that our method\nis capable of improving the performance of classifiers with different\ncutting-based mixup approaches. The source code is available at\nhttps://github.com/JinXins/SUMix.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}