{"id":"2407.07838","title":"In-plane staging in lithium-ion intercalation of bilayer graphene","authors":"Thomas Astles, James G. McHugh, Rui Zhang, Qian Guo, Madeleine Howe,\n  Zefei Wu, Kornelia Indykiewicz, Alex Summerfield, Zachary A.H. Goodwin,\n  Sergey Slizovskiy, Daniil Domaretskiy, Andre K. Geim, Vladimir Falko, Irina\n  V. Grigorieva","authorsParsed":[["Astles","Thomas",""],["McHugh","James G.",""],["Zhang","Rui",""],["Guo","Qian",""],["Howe","Madeleine",""],["Wu","Zefei",""],["Indykiewicz","Kornelia",""],["Summerfield","Alex",""],["Goodwin","Zachary A. H.",""],["Slizovskiy","Sergey",""],["Domaretskiy","Daniil",""],["Geim","Andre K.",""],["Falko","Vladimir",""],["Grigorieva","Irina V.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 16:58:55 GMT"}],"updateDate":"2024-08-19","timestamp":1720630735000,"abstract":"  The ongoing efforts to optimize Li-ion batteries led to the interest in\nintercalation of nanoscale layered compounds, including bilayer graphene. Its\nlithium intercalation has been demonstrated recently but the mechanisms\nunderpinning the storage capacity remain poorly understood. Here, using\nmagnetotransport measurements, we report in-operando intercalation dynamics of\nbilayer graphene. Unexpectedly, we find four distinct intercalation stages that\ncorrespond to well-defined Li-ion densities. We refer to these stages as\n'in-plane', with no in-plane analogues in bulk graphite. The fully intercalated\nbilayers represent a stoichiometric compound C14LiC14 with a Li density of\n2.7x10^{14} cm^{-2}, notably lower than fully intercalated graphite. Combining\nthe experimental findings and DFT calculations, we show that the critical step\nin bilayer intercalation is a transition from AB to AA stacking which occurs at\na density of 0.9x10^{14} cm^{-2}. Our findings reveal the mechanism and limits\nfor electrochemical intercalation of bilayer graphene and suggest possible\navenues for increasing the Li storage capacity.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}