{"id":"2407.19125","title":"Binary Bleed: Fast Distributed and Parallel Method for Automatic Model\n  Selection","authors":"Ryan Barron (1, 3), Maksim E. Eren (2, 3), Manish Bhattarai (1),\n  Ismael Boureima (1), Cynthia Matuszek (2, 3), Boian S. Alexandrov (1) ((1)\n  Theoretical Division, Los Alamos National Laboratory, Los Alamos, USA, (2)\n  Advanced Research in Cyber Systems, Los Alamos National Laboratory, Los\n  Alamos, USA, (3) Department of Computer Science and Electrical Engineering,\n  University of Maryland, Baltimore County, Maryland, USA)","authorsParsed":[["Barron","Ryan",""],["Eren","Maksim E.",""],["Bhattarai","Manish",""],["Boureima","Ismael",""],["Matuszek","Cynthia",""],["Alexandrov","Boian S.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 23:48:51 GMT"}],"updateDate":"2024-07-30","timestamp":1722037731000,"abstract":"  In several Machine Learning (ML) clustering and dimensionality reduction\napproaches, such as non-negative matrix factorization (NMF), RESCAL, and\nK-Means clustering, users must select a hyper-parameter k to define the number\nof clusters or components that yield an ideal separation of samples or clean\nclusters. This selection, while difficult, is crucial to avoid overfitting or\nunderfitting the data. Several ML applications use scoring methods (e.g.,\nSilhouette and Davies Boulding scores) to evaluate the cluster pattern\nstability for a specific k. The score is calculated for different trials over a\nrange of k, and the ideal k is heuristically selected as the value before the\nmodel starts overfitting, indicated by a drop or increase in the score\nresembling an elbow curve plot. While the grid-search method can be used to\naccurately find a good k value, visiting a range of k can become time-consuming\nand computationally resource-intensive. In this paper, we introduce the Binary\nBleed method based on binary search, which significantly reduces the k search\nspace for these grid-search ML algorithms by truncating the target k values\nfrom the search space using a heuristic with thresholding over the scores.\nBinary Bleed is designed to work with single-node serial, single-node\nmulti-processing, and distributed computing resources. In our experiments, we\ndemonstrate the reduced search space gain over a naive sequential search of the\nideal k and the accuracy of the Binary Bleed in identifying the correct k for\nNMFk, K-Means pyDNMFk, and pyDRESCALk with Silhouette and Davies Boulding\nscores. We make our implementation of Binary Bleed for the NMF algorithm\navailable on GitHub.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Performance"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}