{"id":"2407.14221","title":"Tunneling current and current correlations for anyonic quasiparticles of\n  {\\nu} = 1/2 chiral Luttinger liquid in multi-edge geometries","authors":"Gu Zhang, Domenico Giuliano, Igor V. Gornyi, and Gabriele Campagnano","authorsParsed":[["Zhang","Gu",""],["Giuliano","Domenico",""],["Gornyi","Igor V.",""],["Campagnano","Gabriele",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 11:46:46 GMT"}],"updateDate":"2024-07-22","timestamp":1721389606000,"abstract":"  We consider anyonic quasiparticles with charge e/2 described by the {\\nu} =\n1/2 chiral Luttinger liquid, which collide in a Hong-Ou-Mandel-like\ninterferometer. These colliding anyonic channels can be formally viewed as\nhosting Laughlin-like fractional {\\nu} = 1/2 quasiparticles. More specifically,\ntwo possible geometries are considered: (i) a two-edge-channel setup where\nanyons originate from equilibrium reservoirs; (ii) a four-edge-channel setup\nwhere nonequilibrium anyons arrive at the collider in the form of diluted\nbeams. For both setups, we calculate the tunneling current and the current\ncorrelations. For setup (i), our results provide analytically exact expressions\nfor the tunneling current, tunneling-current noise, and cross-correlation\nnoise, The exact relation between conductance and noise is demonstrated. For\nsetup (ii), we show that the tunneling current and the generalized Fano factor\n[defined in B. Rosenow et al. (2016)] are finite for diluted streams of {\\nu} =\n1/2 anyons. This is due to the processes where nonequilibrium anyons, supplied\nvia either source edge, directly tunnel at the central QPC. Thus, to obtain\nmeaningful results in this case, one should go beyond the so-called time-domain\nbraiding processes, where nonequilibrium anyons do not tunnel at the collider,\nbut rather indirectly influence the tunneling by braiding with the\nquasiparticle-quasihole pairs created at the collider. This suggests that the\neffect of direct tunneling and collisions of diluted anyons in the\nHong-Ou-Mandel interferometer can be important for various observables in\nphysical quantum-Hall edges at Laughlin filling fractions.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dCTQErwdarwr9osibp7t0241wjsn2uEOTGa6ZAOQ5kw","pdfSize":"1689211"}
