{"id":"2407.13637","title":"Autonomous self-evolving research on biomedical data: the DREAM paradigm","authors":"Luojia Deng, Yijie Wu, Yongyong Ren, Hui Lu","authorsParsed":[["Deng","Luojia",""],["Wu","Yijie",""],["Ren","Yongyong",""],["Lu","Hui",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:12:09 GMT"},{"version":"v2","created":"Sat, 10 Aug 2024 16:36:59 GMT"}],"updateDate":"2024-08-13","timestamp":1721319129000,"abstract":"  In contemporary biomedical research, the efficiency of data-driven approaches\nis hindered by large data volumes, tool selection complexity, and human\nresource limitations, necessitating the development of fully autonomous\nresearch systems to meet complex analytical needs. Such a system should include\nthe ability to autonomously generate research questions, write analytical code,\nconfigure the computational environment, judge and interpret the results, and\niteratively generate in-depth questions or solutions, all without human\nintervention. Here we developed DREAM, the first biomedical Data-dRiven\nself-Evolving Autonomous systeM, which can independently conduct scientific\nresearch without human involvement. Utilizing a clinical dataset and two omics\ndatasets, DREAM demonstrated its ability to raise and deepen scientific\nquestions, with difficulty scores for clinical data questions surpassing top\npublished articles by 5.7% and outperforming GPT-4 and bioinformatics graduate\nstudents by 58.6% and 56.0%, respectively. Overall, DREAM has a success rate of\n80% in autonomous clinical data mining. Certainly, human can participate in\ndifferent steps of DREAM to achieve more personalized goals. After evolution,\n10% of the questions exceeded the average scores of top published article\nquestions on originality and complexity. In the autonomous environment\nconfiguration of the eight bioinformatics workflows, DREAM exhibited an 88%\nsuccess rate, whereas GPT-4 failed to configure any workflows. In clinical\ndataset, DREAM was over 10,000 times more efficient than the average scientist\nwith a single computer core, and capable of revealing new discoveries. As a\nself-evolving autonomous research system, DREAM provides an efficient and\nreliable solution for future biomedical research. This paradigm may also have a\nrevolutionary impact on other data-driven scientific research fields.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}