{"id":"2407.03376","title":"The Complex Interplay Between Risk Tolerance and the Spread of\n  Infectious Diseases","authors":"Maximilian Nguyen, Ari Freedman, Matthew Cheung, Chadi Saad-Roy,\n  Baltazar Espinoza, Bryan Grenfell, and Simon Levin","authorsParsed":[["Nguyen","Maximilian",""],["Freedman","Ari",""],["Cheung","Matthew",""],["Saad-Roy","Chadi",""],["Espinoza","Baltazar",""],["Grenfell","Bryan",""],["Levin","Simon",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 14:18:29 GMT"}],"updateDate":"2024-07-08","timestamp":1719843509000,"abstract":"  Risk-driven behavior provides a feedback mechanism through which individuals\nboth shape and are collectively affected by an epidemic. We introduce a general\nand flexible compartmental model to study the effect of heterogeneity in the\npopulation with regards to risk tolerance. The interplay between behavior and\nepidemiology leads to a rich set of possible epidemic dynamics. Depending on\nthe behavioral composition of the population, we find that increasing\nheterogeneity in risk tolerance can either increase or decrease the epidemic\nsize. We find that multiple waves of infection can arise due to the interplay\nbetween transmission and behavior, even without the replenishment of\nsusceptibles. We find that increasing protective mechanisms such as the\neffectiveness of interventions, the number of risk-averse people in the\npopulation, and the duration of intervention usage reduces the epidemic\novershoot. When the protection is pushed past a critical threshold, the\nepidemic dynamics enter an underdamped regime where the epidemic size exactly\nequals the herd immunity threshold. Lastly, we can find regimes where epidemic\nsize does not monotonically decrease with a population that becomes\nincreasingly risk-averse.\n","subjects":["Physics/Physics and Society","Nonlinear Sciences/Adaptation and Self-Organizing Systems","Quantitative Biology/Populations and Evolution"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}