{"id":"2407.12304","title":"MAGIC-VFM: Meta-learning Adaptation for Ground Interaction Control with\n  Visual Foundation Models","authors":"Elena Sorina Lupu, Fengze Xie, James A. Preiss, Jedidiah Alindogan,\n  Matthew Anderson, Soon-Jo Chung","authorsParsed":[["Lupu","Elena Sorina",""],["Xie","Fengze",""],["Preiss","James A.",""],["Alindogan","Jedidiah",""],["Anderson","Matthew",""],["Chung","Soon-Jo",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 03:57:11 GMT"}],"updateDate":"2024-07-18","timestamp":1721188631000,"abstract":"  Control of off-road vehicles is challenging due to the complex dynamic\ninteractions with the terrain. Accurate modeling of these interactions is\nimportant to optimize driving performance, but the relevant physical phenomena\nare too complex to model from first principles. Therefore, we present an\noffline meta-learning algorithm to construct a rapidly-tunable model of\nresidual dynamics and disturbances. Our model processes terrain images into\nfeatures using a visual foundation model (VFM), then maps these features and\nthe vehicle state to an estimate of the current actuation matrix using a deep\nneural network (DNN). We then combine this model with composite adaptive\ncontrol to modify the last layer of the DNN in real time, accounting for the\nremaining terrain interactions not captured during offline training. We provide\nmathematical guarantees of stability and robustness for our controller and\ndemonstrate the effectiveness of our method through simulations and hardware\nexperiments with a tracked vehicle and a car-like robot. We evaluate our method\noutdoors on different slopes with varying slippage and actuator degradation\ndisturbances, and compare against an adaptive controller that does not use the\nVFM terrain features. We show significant improvement over the baseline in both\nhardware experimentation and simulation.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/"}