{"id":"2407.08871","title":"Quantifying the Influence of Combined Lung and Kidney Support Using a\n  Cardiovascular Model and Sensitivity Analysis-Informed Parameter\n  Identification","authors":"Jan-Niklas Thiel, Ana Martins Costa, Bettina Wiegmann, Jutta Arens,\n  Ulrich Steinseifer, Michael Neidlin","authorsParsed":[["Thiel","Jan-Niklas",""],["Costa","Ana Martins",""],["Wiegmann","Bettina",""],["Arens","Jutta",""],["Steinseifer","Ulrich",""],["Neidlin","Michael",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 21:11:36 GMT"}],"updateDate":"2024-07-15","timestamp":1720732296000,"abstract":"  Combined extracorporeal membrane oxygenation (ECMO) and continuous renal\nreplacement therapy (CRRT) pose complex hemodynamic challenges in intensive\ncare. In this study, a comprehensive lumped parameter model (LPM) is developed\nto simulate the cardiovascular system, incorporating ECMO and CRRT circuit\ndynamics. The model is used to analyze nine CRRT-ECMO connection schemes under\nvarying flow conditions. Using a robust parameter identification framework\nbased on global sensitivity analysis (GSA) and multi-start gradient-based\noptimization, we calibrated the model on 30 clinical data points from eight\nveno-arterial ECMO patients.\n  Our results indicate that CRRT has a significant impact on the cardiovascular\nsystem, with changes in pulmonary artery pressure of up to 202.5 %, highly\ndependent on ECMO flow. The GSA proved to be a powerful tool to improve the\nparameter estimation process. The established parameter estimation framework is\nfast and robust without the need for hyperparameter tuning and improves the\nparameter estimation process with an R^2>0.98 between simulation and\nexperimental data. It uses modeling methods that could pave the way for\nreal-time applications in intensive care.\n  This open-source framework provides a valuable tool for the systematic\nevaluation of combined ECMO and CRRT, which can be used to develop standardized\ntreatment protocols and improve patient outcomes in critical care. In addition,\nas a digital twin, this model also provides a good basis for addressing\nresearch questions related to mechanical circulatory and respiratory support.\n","subjects":["Physics/Medical Physics","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"0IqjbNuGRNej1pX0njDdNcfN31hhB73cnN2BjH2_M48","pdfSize":"2038210","objectId":"0x01650708b77ecc0f27a662bcef459a6fc19efdb42882715f8eb49d3919b2d786","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
