{"id":"2407.05860","title":"Mabuchi rays, test configurations and quantization for toric manifolds","authors":"Ant\\'onio Gouveia and Jos\\'e M. Mour\\~ao and Jo\\~ao P. Nunes","authorsParsed":[["Gouveia","António",""],["Mourão","José M.",""],["Nunes","João P.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 12:25:57 GMT"}],"updateDate":"2024-07-09","timestamp":1720441557000,"abstract":"  We consider Mabuchi rays of toric K\\\"ahler structures on symplectic toric\nmanifolds which are associated to toric test configurations and that are\ngenerated by convex functions on themoment polytope, $P$, whose second\nderivative has support given by a compact subset $K<P$. Associated to the test\nconfiguration there is a polyhedral decomposition of $P$ whose components are\napproximated by the components of $P \\setminus K$. Along such Mabuchi rays, the\ntoric complex structure remains unchanged on the inverse image under the moment\nmap of $(P \\setminus \\check {K})$, where $\\check {K}$ denotes the interior of\n$K$. At infinite geodesic time, the K\\\"ahler polarizations along the ray\nconverge to interesting new toric mixed polarizations. The quantization in\nthese limit polarizations is given by restrictions of the monomial holomorphic\nsections of the K\\\"ahler quantization, for monomials corresponding to integral\npoints in $P \\setminus \\check {K}$, and by sections on the fibers of the moment\nmap over the integral points contained in $\\check {K}$, which, along the\ndirections parallel to $K$ are holomorphic and which along the directions\ntransverse to $K$ are distributional. These quantizations correspond to\nquantizations of the central fiber of the test family, in the symplectic\npicture. We present the case of $S2$ in detail and then generalize to higher\ndimensional symplectic toric manifolds. Metrically, at infinite Mabuchi\ngeodesic time, the sphere decomposes into two discs and a collection of\ncylinders, separated by infinitely long lines. Correspondingly, the\nquantization in the limit polarization decomposes into a direct sum of the\ncontributions from the quantizations of each of these components.\n","subjects":["Mathematics/Differential Geometry","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}