{"id":"2407.19867","title":"Design and Testing for Steel Support Axial Force Servo System","authors":"Sana Ullah (1), Yonghong Zhou (2), Maokai Lai (1), Xiang Dong (1), Tao\n  Li (1), Xiaoxue Xu (1), Yuan Li (1), Ting Peng (1)","authorsParsed":[["Ullah","Sana",""],["Zhou","Yonghong",""],["Lai","Maokai",""],["Dong","Xiang",""],["Li","Tao",""],["Xu","Xiaoxue",""],["Li","Yuan",""],["Peng","Ting",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 10:37:33 GMT"}],"updateDate":"2024-07-30","timestamp":1722249453000,"abstract":"  Foundation excavations are deepening, expanding, and approaching structures.\nSteel supports measure and manage axial force. The study regulates steel\nsupport structure power during deep excavation using a novel axial force\nmanagement system for safety, efficiency, and structural integrity. Closed-loop\ncontrol changes actuator output to maintain axial force based on force. In deep\nexcavation, the servo system regulates unstable soil, side pressure, and\nstructural demands. Modern engineering and tech are used. Temperature changes\nautomatically adjust the jack to maintain axial force. Includes hydraulic\njacks, triple-acting cylinders, temperature, and deformation sensors, and\nautomatic control. Foundation pit excavation is dynamic, yet structure tension\nis constant. There is no scientific way to regulate axial force foundation pit\nexcavation. The revolutionary Servo system adjusts temperature, compression,\nand axial force to deform pits. System control requires foundation pit\ndirection detection and modification. This engineering method has performed\neffectively for deep foundation pit excavation at railway crossings and other\ninfrastructure projects. The surrounding protective structure may reduce the\nsteel support's axial stress, making deep foundation excavation safe and\nefficient. Keywords: Servo systems, Steel strut support design, Deformation\ncontrol, Monitoring and control, Deep excavation projects.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}