{"id":"2407.13396","title":"Ball characterizations in planes and spaces of constant curvature, II\n  \\vskip.1cm \\centerline{\\rm{This pdf-file is not identical with the printed\n  paper.}}","authors":"J. Jer\\'onimo-Castro, E. Makai Jr","authorsParsed":[["Jerónimo-Castro","J.",""],["Makai","E.","Jr"]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 11:06:36 GMT"}],"updateDate":"2024-07-19","timestamp":1721300796000,"abstract":"  High proved the following theorem. If the intersections of any two congruent\ncopies of a plane convex body are centrally symmetric, then this body is a\ncircle. In our paper we extend the theorem of High to the sphere and the\nhyperbolic plane, and partly to spaces of constant curvature. We also\ninvestigate the dual question about the convex hull of the unions, rather than\nthe intersections.\n  Let us have in $H^2$ proper closed convex subsets $K,L$ with interior points,\nsuch that the numbers of the connected components of the boundaries of $K$ and\n$L$ are finite. We exactly describe all pairs of such subsets $K,L$, whose any\ncongruent copies have an intersection with axial symmetry; there are nine\ncases. (The cases of $S^2$ and ${\\Bbb{R}}^2$ were described in Part I, i.e.,\n\\cite{5}.)\n  Let us have in $S^d$, ${\\Bbb{R}}^d$ or $H^d$ proper closed convex $C^2_+$\nsubsets $K,L$ with interior points, such that all sufficiently small\nintersections of their congruent copies are symmetric w.r.t.\\ a particular\nhyperplane. Then the boundary components of both $K$ and $L$ are congruent, and\neach of them is a sphere, a parasphere or a hypersphere.\n  Let us have a pair of convex bodies in $S^d$, ${\\Bbb{R}}^d$ or $H^d$, which\nhave at any boundary points supporting spheres (for $S^d$ of radius less than\n$\\pi /2$). If the convex hull of the union of any congruent copies of these\nbodies is centrally symmetric, then our bodies are congruent balls (for $S^d$\nof radius less than $\\pi /2$). An analogous statement holds for symmetry\nw.r.t.\\ a particular hyperplane. For $d=2$, suppose the existence of the above\nsupporting circles (for $S^2$ of radius less than $\\pi /2$), and, for $S^2$,\nsmoothness of $K$ and $L$. If we suppose axial symmetry of all the above convex\nhulls, then our bodies are (incongruent) circles (for $S^2$ of radii less than\n$\\pi /2$).\n","subjects":["Mathematics/Metric Geometry"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}