{"id":"2407.01578","title":"A Hybrid-Layered System for Image-Guided Navigation and Robot Assisted\n  Spine Surgeries","authors":"Suhail Ansari T, Vivek Maik, Minhas Naheem, Keerthi Ram, Manojkumar\n  Lakshmanan, Mohanasankar Sivaprakasam","authorsParsed":[["T","Suhail Ansari",""],["Maik","Vivek",""],["Naheem","Minhas",""],["Ram","Keerthi",""],["Lakshmanan","Manojkumar",""],["Sivaprakasam","Mohanasankar",""]],"versions":[{"version":"v1","created":"Fri, 7 Jun 2024 05:14:10 GMT"}],"updateDate":"2024-07-03","timestamp":1717737250000,"abstract":"  In response to the growing demand for precise and affordable solutions for\nImage-Guided Spine Surgery (IGSS), this paper presents a comprehensive\ndevelopment of a Robot-Assisted and Navigation-Guided IGSS System. The endeavor\ninvolves integrating cutting-edge technologies to attain the required surgical\nprecision and limit user radiation exposure, thereby addressing the limitations\nof manual surgical methods. We propose an IGSS workflow and system architecture\nemploying a hybrid-layered approach, combining modular and integrated system\narchitectures in distinctive layers to develop an affordable system for\nseamless integration, scalability, and reconfigurability. We developed and\nintegrated the system and extensively tested it on phantoms and cadavers. The\nproposed system's accuracy using navigation guidance is 1.02 0.34 mm, and robot\nassistance is 1.11 0.49 mm on phantoms. Observing a similar performance in\ncadaveric validation where 84% of screw placements were grade A, 10% were grade\nB using navigation guidance, 90% were grade A, and 10% were grade B using robot\nassistance as per the Gertzbein-Robbins scale, proving its efficacy for an\nIGSS. The evaluated performance is adequate for an IGSS and at par with the\nexisting systems in literature and those commercially available. The user\nradiation is lower than in the literature, given that the system requires only\nan average of 3 C-Arm images per pedicle screw placement and verification.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Image and Video Processing","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}