{"id":"2407.04252","title":"Comparing metallicity correlations in nearby non-AGN and AGN-host\n  galaxies","authors":"Song-lin Li, Zefeng Li, Emily Wisnioski, Mark R. Krumholz, and\n  Sebasti\\'an F. S\\'anchez","authorsParsed":[["Li","Song-lin",""],["Li","Zefeng",""],["Wisnioski","Emily",""],["Krumholz","Mark R.",""],["Sánchez","Sebastián F.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 04:39:34 GMT"}],"updateDate":"2024-07-08","timestamp":1720154374000,"abstract":"  The gas-phase metallicity distribution within galaxies records critical\ninformation about galactic evolution. In this work we investigate how active\ngalactic nuclei (AGN) influence this distribution by measuring the two-point\ncorrelation functions of gas-phase metallicity in 95 non-AGN and 37 AGN-host\ngalaxies from the Calar Alto Legacy Integral Field spectroscopy Area integral\nfield spectrographic survey. We measure metallicity using a novel Bayesian\nmethod that properly includes both stellar and AGN contributions to emission\nline fluxes and allows us to measure metallicities in both AGN-host and non-AGN\ngalaxies in a single, consistent framework. We find that the two-point\ncorrelation functions of both AGN-host and non-AGN galaxies are well-fit by a\nsimple injection-diffusion model, and that the correlation lengths\n$l_\\mathrm{corr}$ we derive for the non-AGN galaxies are reasonably consistent\nwith those obtained in earlier work. The AGN-host galaxies generally have\nsmaller $l_\\mathrm{corr}$ than non-AGN galaxies at fixed stellar mass, but\nsimilar $l_\\mathrm{corr}$ at fixed star formation rate (SFR), suggesting that\nthe primary effect of hosting an AGN in this sample is a reduction in SFR at\nfixed stellar mass, and that this in turn suppresses the correlation length.\nOur findings further indicate that, while both SFR and stellar mass are\npositively correlated with metallicity correlation length $l_\\mathrm{corr}$,\nthe former is more fundamental, implying that fluctuations in the metallicity\ndistribution within galaxies are driven more by short-term responses to\nphysical processes such as star formation that can change much faster than a\nHubble time.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}