{"id":"2407.16638","title":"Unveiling and Mitigating Bias in Audio Visual Segmentation","authors":"Peiwen Sun, Honggang Zhang, Di Hu","authorsParsed":[["Sun","Peiwen",""],["Zhang","Honggang",""],["Hu","Di",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 16:55:04 GMT"}],"updateDate":"2024-07-24","timestamp":1721753704000,"abstract":"  Community researchers have developed a range of advanced audio-visual\nsegmentation models aimed at improving the quality of sounding objects' masks.\nWhile masks created by these models may initially appear plausible, they\noccasionally exhibit anomalies with incorrect grounding logic. We attribute\nthis to real-world inherent preferences and distributions as a simpler signal\nfor learning than the complex audio-visual grounding, which leads to the\ndisregard of important modality information. Generally, the anomalous phenomena\nare often complex and cannot be directly observed systematically. In this\nstudy, we made a pioneering effort with the proper synthetic data to categorize\nand analyze phenomena as two types \"audio priming bias\" and \"visual prior\"\naccording to the source of anomalies. For audio priming bias, to enhance audio\nsensitivity to different intensities and semantics, a perception module\nspecifically for audio perceives the latent semantic information and\nincorporates information into a limited set of queries, namely active queries.\nMoreover, the interaction mechanism related to such active queries in the\ntransformer decoder is customized to adapt to the need for interaction\nregulating among audio semantics. For visual prior, multiple contrastive\ntraining strategies are explored to optimize the model by incorporating a\nbiased branch, without even changing the structure of the model. During\nexperiments, observation demonstrates the presence and the impact that has been\nproduced by the biases of the existing model. Finally, through experimental\nevaluation of AVS benchmarks, we demonstrate the effectiveness of our methods\nin handling both types of biases, achieving competitive performance across all\nthree subsets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}