{"id":"2407.07696","title":"Layer Resolved Magnetotransport Properties in\n  Antiferromagnetic/Paramagnetic Superlattices","authors":"Sandip Halder, Sourav Chakraborty, and Kalpataru Pradhan","authorsParsed":[["Halder","Sandip",""],["Chakraborty","Sourav",""],["Pradhan","Kalpataru",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 14:26:01 GMT"}],"updateDate":"2024-07-11","timestamp":1720621561000,"abstract":"  We investigate the layer resolved magnetotransport properties of the\nantiferromagnetic/paramagnetic superlattices based on one band half-filled\nHubbard model in three dimensions. In our set up the correlated layers (with\non-site repulsion strength $U \\ne$ 0) are intercalated between the uncorrelated\n(U = 0) layers. Our calculations based on the semi-classical Monte-Carlo\ntechnique show that the magnetic moments are induced in the uncorrelated layers\nat low temperatures due to kinetic hopping of the carriers across the\ninterface. The average induced magnetic moment in the uncorrelated layer varies\nnonmonotonically with the $U$ values of the correlated layer. Interestingly,\nthe induced magnetic moments are antiferromagnetically arranged in uncorrelated\nlayers and mediates the antiferromagnetic ordering between correlated layers.\nAs a result the whole SL system turns out to be antiferromagnetic insulating at\nlow temperatures. For $U \\sim$ bandwidth the local moments in the correlated\nplanes increases as a function of the distance from the interface. Expectedly\nour in-plane resistivity calculations show that the metal insulator transition\ntemperature of the central plane is larger than the edge planes in the\ncorrelated layers. On the other hand, although the induced moments in\nuncorrelated planes decreases considerably as move from edge planes to center\nplanes the metal insulator transition temperature remains more or less same for\nall planes. The induced moments in uncorrelated layers gradually dissipates\nwith increasing the thickness of uncorrelated layer and as a result the long\nrange antiferromagnetic ordering vanishes in the superlattices similar to the\nexperiments.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}