{"id":"2407.12486","title":"Decoupled Edge Physics algorithms for collaborative XR simulations","authors":"George Kokiadis, Antonis Protopsaltis, Michalis Morfiadakis, Nick\n  Lydatakis and George Papagiannakis","authorsParsed":[["Kokiadis","George",""],["Protopsaltis","Antonis",""],["Morfiadakis","Michalis",""],["Lydatakis","Nick",""],["Papagiannakis","George",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 11:11:54 GMT"}],"updateDate":"2024-07-18","timestamp":1721214714000,"abstract":"  This work proposes a novel approach to transform any modern game engine\npipeline, for optimized performance and enhanced user experiences in Extended\nReality (XR) environments. Decoupling the physics engine from the game engine\npipeline and using a client-server N-1 architecture creates a scalable\nsolution, efficiently serving multiple graphics clients on Head-Mounted\nDisplays (HMDs) with a single physics engine on edge-cloud infrastructure. This\napproach ensures better synchronization in multiplayer scenarios without\nintroducing overhead in single-player experiences, maintaining session\ncontinuity despite changes in user participation. Relocating the Physics Engine\nto an edge or cloud node reduces strain on local hardware, dedicating more\nresources to high-quality rendering and unlocking the full potential of\nuntethered HMDs. We present four algorithms that decouple the physics engine,\nincreasing frame rates and Quality of Experience (QoE) in VR simulations,\nsupporting advanced interactions, numerous physics objects, and multi-user\nsessions with over 100 concurrent users. Incorporating a Geometric Algebra\ninterpolator reduces inter-calls between dissected parts, maintaining QoE and\neasing network stress. Experimental validation, with more than 100 concurrent\nusers, 10,000 physics objects, and softbody simulations, confirms the technical\nviability of the proposed architecture, showcasing transformative capabilities\nfor more immersive and collaborative XR applications without compromising\nperformance.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}