{"id":"2407.14671","title":"DefTesPY: Cyber defense model with enhanced data modeling and analysis\n  for Tesla company via Python Language","authors":"Naresh Kshetri, Irin Sultana, Mir Mehedi Rahman, Darshana Shah","authorsParsed":[["Kshetri","Naresh",""],["Sultana","Irin",""],["Rahman","Mir Mehedi",""],["Shah","Darshana",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 21:22:40 GMT"}],"updateDate":"2024-07-23","timestamp":1721424160000,"abstract":"  Several types of cyber-attacks on automobiles and business firms keep on\nrising as we are preparing to counter cybercrimes with several new technologies\nand defense models. Cyber defense (also, counter intelligence) is a computer\nnetwork defense mechanism that involves response to activities, critical\ninfrastructure protection, and information assurance for corporations,\ngovernment bodies, and other conceivable networks. Cyber defense focuses on\npreventing, detecting, and responding to assaults or threats in a timely manner\nso that no infrastructure or information is compromised. With the increasing\nvolume and complexity of cyber threats, most companies need cyber defense to\nprotect sensitive information and assets. We can control attacker actions by\nutilizing firewalls at different levels, an intrusion detection system (IDS),\nwith the intrusion prevention system (IPS) which can be installed independently\nor in combination with other protection approaches. Tesla is an American clean\nenergy and automotive company in Austin, Texas, USA. The recent data breach at\nTesla affected over 75,000 individuals as the company pinpoints two former\nemployees as the offender revealing more than 23,000 internal files from 2015\nto 2022. In this work, we will emphasize data modeling and data analysis using\ncyber defense model and python with a survey of the Tesla company. We have\nproposed a defense model, DefTesPY, with enhanced data modeling and data\nanalysis based on the encountered cyber-attacks and cybercrimes for Tesla\ncompany till date.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"h-0Sra30AlCPSHpKbQwhDLHG_--G29WcQN7aP1RDqCs","pdfSize":"740960","objectId":"0xd5b64bb22aa65cf5b7272be628de4d2a0e3d52558b6e38a39d6352d48d532dd3","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
