{"id":"2407.21478","title":"Precoding Based Downlink OAM-MIMO Communications with Rate Splitting","authors":"Ruirui Chen, Jinyang Lin, Beibei Zhang, Yu Ding, Keyue Xu","authorsParsed":[["Chen","Ruirui",""],["Lin","Jinyang",""],["Zhang","Beibei",""],["Ding","Yu",""],["Xu","Keyue",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 09:39:24 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 04:19:27 GMT"}],"updateDate":"2024-08-05","timestamp":1722418764000,"abstract":"  Orbital angular momentum (OAM) and rate splitting (RS) are the potential key\ntechniques for the future wireless communications. As a new orthogonal\nresource, OAM can achieve the multifold increase of spectrum efficiency to\nrelieve the scarcity of the spectrum resource, but how to enhance the privacy\nperformance imposes crucial challenge for OAM communications. RS technique\ndivides the information into private and common parts, which can guarantee the\nprivacies for all users. In this paper, we integrate the RS technique into\ndownlink OAM-MIMO communications, and study the precoding optimization to\nmaximize the sum capacity. First, the concentric uniform circular arrays (UCAs)\nare utilized to construct the downlink transmission framework of OAM-MIMO\ncommunications with RS. Particularly, users in the same user pair utilize RS\ntechnique to obtain the information and different user pairs use different OAM\nmodes. Then, we derive the OAM-MIMO channel model, and formulate the sum\ncapacity maximization problem. Finally, based on the fractional programming,\nthe optimal precoding matrix is obtained to maximize the sum capacity by using\nquadratic transformation. Extensive simulation results show that by using the\nproposed precoding optimization algorithm, OAM-MIMO communications with RS can\nachieve higher sum capacity than the traditional communication schemes.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}