{"id":"2407.14806","title":"Hybrid PHD-PMB Trajectory Smoothing Using Backward Simulation","authors":"Yuxuan Xia, \\'Angel F. Garc\\'ia-Fern\\'andez, and Lennart Svensson","authorsParsed":[["Xia","Yuxuan",""],["García-Fernández","Ángel F.",""],["Svensson","Lennart",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 08:31:52 GMT"}],"updateDate":"2024-07-23","timestamp":1721464312000,"abstract":"  The probability hypothesis density (PHD) and Poisson multi-Bernoulli (PMB)\nfilters are two popular set-type multi-object filters. Motivated by the fact\nthat the multi-object filtering density after each update step in the PHD\nfilter is a PMB without approximation, in this paper we present a multi-object\nsmoother involving PHD forward filtering and PMB backward smoothing. This is\nachieved by first running the PHD filtering recursion in the forward pass and\nextracting the PMB filtering densities after each update step before the\nPoisson Point Process approximation, which is inherent in the PHD filter\nupdate. Then in the backward pass we apply backward simulation for sets of\ntrajectories to the extracted PMB filtering densities. We call the resulting\nmulti-object smoother hybrid PHD-PMB trajectory smoother. Notably, the hybrid\nPHD-PMB trajectory smoother can provide smoothed trajectory estimates for the\nPHD filter without labeling or tagging, which is not possible for existing PHD\nsmoothers. Also, compared to the trajectory PHD filter, which can only estimate\nalive trajectories, the hybrid PHD-PMB trajectory smoother enables the\nestimation of the set of all trajectories. Simulation results demonstrate that\nthe hybrid PHD-PMB trajectory smoother outperforms the PHD filter in terms of\nboth state and cardinality estimates, and the trajectory PHD filter in terms of\nfalse detections.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CotNmQXeIC0NBKkHmIyOmThmXcKn0P9HHlVkpkK72zg","pdfSize":"885298"}
