{"id":"2407.01961","title":"Extended Uncertainty Principle: A Deeper Insight into the Hubble\n  Tension?","authors":"Kourosh Nozari, Sara Saghafi and Milad Hajebrahimi","authorsParsed":[["Nozari","Kourosh",""],["Saghafi","Sara",""],["Hajebrahimi","Milad",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 05:33:08 GMT"}],"updateDate":"2024-07-10","timestamp":1719898388000,"abstract":"  The standard cosmological model, known as the LambdaCDM model, has been\nsuccessful in many respects, but it has some significant discrepancies, some of\nwhich have not been resolved yet. In measuring the Hubble-Lematre parameter,\nthere is an apparent discrepancy which is known as the Hubble tension, defined\nas differences in values of this parameter measured by the Type Ia Supernovae\n(SNeIa) data (a model-independent method) and by the Cosmic Microwave\nBackground (CMB) radiation maps (a model-dependent method). Although many\npotential solutions have been proposed, the issue still remains unresolved.\nRecently, it was observed that the Hubble tension can be due to the concept of\nuncertainty in measuring cosmological parameters at large distance scales\nthrough applying the Heisenberg Uncertainty Principle (HUP) in cosmological\nsetups. Extending this pioneering idea, in the present study we plan to\nincorporate the Extended Uncertainty Principle (EUP) containing a minimal\nfundamental measurable momentum (or equivalently, a maximal fundamental\nmeasurable length) as a candidate setup for describing large-scale effects of\nQuantum Gravity (QG) to address the Hubble tension and constrain the EUP length\nscale. In this regard, by finding a relevant formula for the effective photon\nrest mass in terms of the present-time value of the Hubble-Lematre parameter,\nwe see that discrepancies in the value of photon rest mass associated with the\nHubble-Lematre parameter values estimated from model-independent and\nmodel-dependent methods perhaps is the cause of Hubble tension.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}