{"id":"2407.02896","title":"Predicting and Understanding Turn-Taking Behavior in Open-Ended Group\n  Activities in Virtual Reality","authors":"Portia Wang, Eugy Han, Anna C.M. Queiroz, Cyan DeVeaux and Jeremy N.\n  Bailenson","authorsParsed":[["Wang","Portia",""],["Han","Eugy",""],["Queiroz","Anna C. M.",""],["DeVeaux","Cyan",""],["Bailenson","Jeremy N.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 08:17:59 GMT"}],"updateDate":"2024-07-04","timestamp":1719994679000,"abstract":"  In networked virtual reality (VR), user behaviors, individual differences,\nand group dynamics can serve as important signals into future speech behaviors,\nsuch as who the next speaker will be and the timing of turn-taking behaviors.\nThe ability to predict and understand these behaviors offers opportunities to\nprovide adaptive and personalized assistance, for example helping users with\nvarying sensory abilities navigate complex social scenes and instantiating\nvirtual moderators with natural behaviors. In this work, we predict turn-taking\nbehaviors using features extracted based on social dynamics literature. We\ndiscuss results from a large-scale VR classroom dataset consisting of 77\nsessions and 1660 minutes of small-group social interactions collected over\nfour weeks. In our evaluation, gradient boosting classifiers achieved the best\nperformance, with accuracies of 0.71--0.78 AUC (area under the ROC curve)\nacross three tasks concerning the \"what\", \"who\", and \"when\" of turn-taking\nbehaviors. In interpreting these models, we found that group size, listener\npersonality, speech-related behavior (e.g., time elapsed since the listener's\nlast speech event), group gaze (e.g., how much the group looks at the speaker),\nas well as the listener's and previous speaker's head pitch, head y-axis\nposition, and left hand y-axis position more saliently influenced predictions.\nResults suggested that these features remain reliable indicators in novel\nsocial VR settings, as prediction performance is robust over time and with\ngroups and activities not used in the training dataset. We discuss theoretical\nand practical implications of the work.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}