{"id":"2407.16432","title":"Integrated high-performance error correction for continuous-variable\n  quantum key distribution","authors":"Chuang Zhou, Yang Li, Li Ma, Jie Yang, Wei Huang, Ao Sun, Heng Wang,\n  Yujie Luo, Yong Li, Ziyang Chen, Francis C. M. Lau, Yichen Zhang, Song Yu,\n  Hong Guo, and Bingjie Xu","authorsParsed":[["Zhou","Chuang",""],["Li","Yang",""],["Ma","Li",""],["Yang","Jie",""],["Huang","Wei",""],["Sun","Ao",""],["Wang","Heng",""],["Luo","Yujie",""],["Li","Yong",""],["Chen","Ziyang",""],["Lau","Francis C. M.",""],["Zhang","Yichen",""],["Yu","Song",""],["Guo","Hong",""],["Xu","Bingjie",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 12:30:46 GMT"}],"updateDate":"2024-07-24","timestamp":1721737846000,"abstract":"  An integrated error-correction scheme with high throughput, low frame errors\nrate (FER) and high reconciliation efficiency under low signal to noise ratio\n(SNR) is one of the major bottlenecks to realize high-performance and low-cost\ncontinuous variable quantum key distribution (CV-QKD). To solve this\nlong-standing problem, a novel two-stage error correction method with limited\nprecision that is suitable for integration given limited on-chip hardware\nresource while maintaining excellent decoding performance is proposed, and\nexperimentally verified on a commercial FPGA. Compared to state-of-art results,\nthe error-correction throughput can be improved more than one order of\nmagnitude given FER<0.1 based on the proposed method, where 544.03 Mbps and\n393.33 Mbps real-time error correction is achieved for typical 0.2 and 0.1 code\nrate, respectively. Besides, compared with traditional decoding method, the\nsecure key rate (SKR) for CV-QKD under composable security framework can be\nimproved by 140.09% and 122.03% by using the proposed two-stage decoding method\nfor codes rate 0.2 and 0.1, which can support 32.70 Mbps and 5.66 Mbps\nreal-time SKR under typical transmission distances of 25 km and 50 km,\ncorrespondingly. The record-breaking results paves the way for large-scale\ndeployment of high-rate integrated CV-QKD systems in metropolitan quantum\nsecure network.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1u6L_x-iowFGBRRMhLNZxST4VULCHR9hIF9uiwmjSh8","pdfSize":"1548942"}
