{"id":"2407.17343","title":"Oscillatory motions, parabolic orbits and collision orbits in the planar\n  circular restricted three-body problem","authors":"Marcel Guardia, Jos\\'e Lamas, Tere M.Seara","authorsParsed":[["Guardia","Marcel",""],["Lamas","José",""],["Seara","Tere M.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 15:13:11 GMT"}],"updateDate":"2024-07-25","timestamp":1721833991000,"abstract":"  In this paper we consider the planar circular restricted three body problem\n(PCRTBP), which models the motion of a massless body under the attraction of\nother two bodies, the primaries, which describe circular orbits around their\ncommon center of mass. In a suitable system of coordinates, this is a two\ndegrees of freedom Hamiltonian system. The orbits of this system are either\ndefined for all (future or past) time or eventually go to collision with one of\nthe primaries. For orbits defined for all time, Chazy provided a classification\nof all possible asymptotic behaviors, usually called final motions.\n  By considering a sufficiently small mass ratio between the primaries, we\nanalyze the interplay between collision orbits and various final motions and\nconstruct several types of dynamics.\n  In particular, we show that orbits corresponding to any combination of past\nand future final motions can be created to pass arbitrarily close to the\nmassive primary. Additionally, we construct arbitrarily large\nejection-collision orbits (orbits which experience collision in both past and\nfuture times) and periodic orbits that are arbitrarily large and get\narbitrarily close to the massive primary. Furthermore, we also establish\noscillatory motions in both position and velocity, meaning that as time tends\nto infinity, the superior limit of the position or velocity is infinity while\nthe inferior limit remains a real number.\n","subjects":["Mathematics/Dynamical Systems","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}