{"id":"2407.15408","title":"Chronologically Accurate Retrieval for Temporal Grounding of\n  Motion-Language Models","authors":"Kent Fujiwara, Mikihiro Tanaka, Qing Yu","authorsParsed":[["Fujiwara","Kent",""],["Tanaka","Mikihiro",""],["Yu","Qing",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 06:25:21 GMT"}],"updateDate":"2024-07-23","timestamp":1721629521000,"abstract":"  With the release of large-scale motion datasets with textual annotations, the\ntask of establishing a robust latent space for language and 3D human motion has\nrecently witnessed a surge of interest. Methods have been proposed to convert\nhuman motion and texts into features to achieve accurate correspondence between\nthem. Despite these efforts to align language and motion representations, we\nclaim that the temporal element is often overlooked, especially for compound\nactions, resulting in chronological inaccuracies. To shed light on the temporal\nalignment in motion-language latent spaces, we propose Chronologically Accurate\nRetrieval (CAR) to evaluate the chronological understanding of the models. We\ndecompose textual descriptions into events, and prepare negative text samples\nby shuffling the order of events in compound action descriptions. We then\ndesign a simple task for motion-language models to retrieve the more likely\ntext from the ground truth and its chronologically shuffled version. CAR\nreveals many cases where current motion-language models fail to distinguish the\nevent chronology of human motion, despite their impressive performance in terms\nof conventional evaluation metrics. To achieve better temporal alignment\nbetween text and motion, we further propose to use these texts with shuffled\nsequence of events as negative samples during training to reinforce the\nmotion-language models. We conduct experiments on text-motion retrieval and\ntext-to-motion generation using the reinforced motion-language models, which\ndemonstrate improved performance over conventional approaches, indicating the\nnecessity to consider temporal elements in motion-language alignment.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Py8LYeZ7A2Jhb6S3_TFRzggOC4OFL4zcwjzGMoZWOl8","pdfSize":"2062145"}
