{"id":"2407.12659","title":"Dynamical Consequence of Shadows Cast to the Outer Protoplanetary Disks:\n  I. Two-dimensional Simulations","authors":"Zehao Su and Xue-Ning Bai","authorsParsed":[["Su","Zehao",""],["Bai","Xue-Ning",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:43:05 GMT"}],"updateDate":"2024-07-18","timestamp":1721230985000,"abstract":"  There has been increasing evidence of shadows from scattered light\nobservations of outer protoplanetary disks (PPDs) cast from the (unresolved)\ndisk inner region, while in the meantime these disks present substructures of\nvarious kinds in the submillimeter. As stellar irradiation is the primary\nheating source for the outer PPDs, the presence of such shadows thus suggest\ninhomogeneous heating of the outer disk in azimuth, leading to a \"thermal\nforcing\" with dynamical consequences. We conduct a suite of idealized 2D disk\nsimulations of the outer disk with azimuthally-varying cooling prescription to\nmimic the effect of shadows, generally assuming the shadow is static or\nslowly-rotating. The linear response to such shadows is two-armed spirals with\nthe same pattern speed as the shadow. Towards the nonlinear regime, we find\nthat shadows can potentially lead to the formation of a variety of types of\nsubstructures including rings, spirals and crescents, depending on viscosity,\ncooling time, etc. We have conducted systematic and statistical\ncharacterization of the simulation suite, and as thermal forcing from the\nshadow strengthens, the dominant form of shadow-induced disk substructures\nchange from spirals to rings, and eventually to crescents/vortices. Our results\nhighlight the importance of properly modeling the dynamical impact of\ninhomogeneous stellar irradiation, while call for more detailed modeling\nincorporating more realistic disk physics.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jTszKi73MFacWX7lMfuzzk6h4lUOoFnwBF8G8ufUxXQ","pdfSize":"22379072"}
