{"id":"2407.06217","title":"On Simulation of Power Systems and Microgrid Components with SystemC-AMS","authors":"Rahul Bhadani, Satyaki Banik, Hao Tu, Srdjan Lukic, Gabor Karsai","authorsParsed":[["Bhadani","Rahul",""],["Banik","Satyaki",""],["Tu","Hao",""],["Lukic","Srdjan",""],["Karsai","Gabor",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 22:42:29 GMT"}],"updateDate":"2024-07-10","timestamp":1720132949000,"abstract":"  Cyber-physical systems such as microgrids consist of interconnected\ncomponents, localized power systems, and distributed energy resources with\nclearly defined electrical boundaries. They can function independently but can\nalso work in tandem with the main grid. Power system converters and their\ncontrol loops play an essential role in stabilizing grids and interfacing a\nmicrogrid with the main grid. The optimal selection of microgrid components for\ninstallation is expensive. Simulation of microgrids provides a cost-effective\nsolution. However, when studying the electromagnetic transient response, their\nsimulation is slow. Furthermore, software packages facilitating electromagnetic\ntransient response may be prohibitively expensive. This paper presents a faster\nmethod for simulating the electromagnetic transient response of microgrid\ncomponents using SystemC-AMS. We present a use case of a photovoltaic\ngrid-following inverter with a phase-locked loop to track reference active and\nreactive power. Our results demonstrate that the simulation performed using\nSystemC-AMS is roughly three times faster than the benchmark simulation\nconducted using Simulink. Our implementation of a photovoltaic grid-following\ninverter equipped with a phase-locked loop for monitoring reference active and\nreactive power reveals that the simulation executed using SystemC-AMS is\napproximately three times faster than the benchmark simulation carried out\nusing Simulink. Our implementation adopts a model-based design and produces a\nlibrary of components that can be used to construct increasingly complex grid\narchitectures. Additionally, the C-based nature allows for the integration of\nexternal libraries for added real-time capability and optimization\nfunctionality. We also present a use case for real-time simulation using a DC\nmicrogrid with a constant resistive load.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Software Engineering","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}