{"id":"2407.18375","title":"Relative Alignments Between Magnetic Fields, Velocity Gradients, and\n  Dust Emission Gradients in NGC 1333","authors":"Michael Chun-Yuan Chen, Laura M. Fissel, Sarah I. Sadavoy, Erik\n  Rosolowsky, Yasuo Doi, Doris Arzoumanian, Pierre Bastien, Simon Coud\\'e,\n  James Di Francesco, Rachel Friesen, Ray S. Furuya, Jihye Hwang, Shu-ichiro\n  Inutsuka, Doug Johnstone, Janik Karoly, Jungmi Kwon, Woojin Kwon, Valentin J.\n  M. Le Gouellec, Hong-Li Liu, Steve Mairs, Takashi Onaka, Kate Pattle, Mark G.\n  Rawlings, Mehrnoosh Tahani, Motohide Tamura, and Jia-Wei Wang","authorsParsed":[["Chen","Michael Chun-Yuan",""],["Fissel","Laura M.",""],["Sadavoy","Sarah I.",""],["Rosolowsky","Erik",""],["Doi","Yasuo",""],["Arzoumanian","Doris",""],["Bastien","Pierre",""],["Coudé","Simon",""],["Di Francesco","James",""],["Friesen","Rachel",""],["Furuya","Ray S.",""],["Hwang","Jihye",""],["Inutsuka","Shu-ichiro",""],["Johnstone","Doug",""],["Karoly","Janik",""],["Kwon","Jungmi",""],["Kwon","Woojin",""],["Gouellec","Valentin J. M. Le",""],["Liu","Hong-Li",""],["Mairs","Steve",""],["Onaka","Takashi",""],["Pattle","Kate",""],["Rawlings","Mark G.",""],["Tahani","Mehrnoosh",""],["Tamura","Motohide",""],["Wang","Jia-Wei",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 20:17:28 GMT"}],"updateDate":"2024-07-29","timestamp":1721938648000,"abstract":"  Magnetic fields play an important role in shaping and regulating star\nformation in molecular clouds. Here, we present one of the first studies\nexamining the relative orientations between magnetic ($B$) fields and the dust\nemission, gas column density, and velocity centroid gradients on the 0.02 pc\n(core) scales, using the BISTRO and VLA+GBT observations of the NGC 1333\nstar-forming clump. We quantified these relative orientations using the Project\nRayleigh Statistic (PRS) and found preferential global parallel alignment\nbetween the $B$ field and dust emission gradients, consistent with large-scale\nstudies with Planck. No preferential global alignments, however, are found\nbetween the $B$ field and velocity gradients. Local PRS calculated for\nsubregions defined by either dust emission or velocity coherence further\nrevealed that the $B$ field does not preferentially align with dust emission\ngradients in most emission-defined subregions, except in the warmest ones. The\nvelocity-coherent structures, on the other hand, also showed no preferred $B$\nfield alignments with velocity gradients, except for one potentially\nbubble-compressed region. Interestingly, the velocity gradient magnitude in NGC\n1333 ubiquitously features prominent ripple-like structures that are indicative\nof magnetohydrodynamic (MHD) waves. Finally, we found $B$ field alignments with\nthe emission gradients to correlate with dust temperature and anticorrelate\nwith column density, velocity dispersion, and velocity gradient magnitude. The\nlatter two anticorrelations suggest that alignments between gas structures and\n$B$ fields can be perturbed by physical processes that elevate velocity\ndispersion and velocity gradients, such as infall, accretions, and MHD waves.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}