{"id":"2407.18939","title":"Promoting AI Competencies for Medical Students: A Scoping Review on\n  Frameworks, Programs, and Tools","authors":"Yingbo Ma, Yukyeong Song, Jeremy A. Balch, Yuanfang Ren, Divya\n  Vellanki, Zhenhong Hu, Meghan Brennan, Suraj Kolla, Ziyuan Guan, Brooke\n  Armfield, Tezcan Ozrazgat-Baslanti, Parisa Rashidi, Tyler J. Loftus, Azra\n  Bihorac, Benjamin Shickel","authorsParsed":[["Ma","Yingbo",""],["Song","Yukyeong",""],["Balch","Jeremy A.",""],["Ren","Yuanfang",""],["Vellanki","Divya",""],["Hu","Zhenhong",""],["Brennan","Meghan",""],["Kolla","Suraj",""],["Guan","Ziyuan",""],["Armfield","Brooke",""],["Ozrazgat-Baslanti","Tezcan",""],["Rashidi","Parisa",""],["Loftus","Tyler J.",""],["Bihorac","Azra",""],["Shickel","Benjamin",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 16:34:41 GMT"}],"updateDate":"2024-07-30","timestamp":1720629281000,"abstract":"  As more clinical workflows continue to be augmented by artificial\nintelligence (AI), AI literacy among physicians will become a critical\nrequirement for ensuring safe and ethical AI-enabled patient care. Despite the\nevolving importance of AI in healthcare, the extent to which it has been\nadopted into traditional and often-overloaded medical curricula is currently\nunknown. In a scoping review of 1,699 articles published between January 2016\nand June 2024, we identified 18 studies which propose guiding frameworks, and\n11 studies documenting real-world instruction, centered around the integration\nof AI into medical education. We found that comprehensive guidelines will\nrequire greater clinical relevance and personalization to suit medical student\ninterests and career trajectories. Current efforts highlight discrepancies in\nthe teaching guidelines, emphasizing AI evaluation and ethics over technical\ntopics such as data science and coding. Additionally, we identified several\nchallenges associated with integrating AI training into the medical education\nprogram, including a lack of guidelines to define medical students AI literacy,\na perceived lack of proven clinical value, and a scarcity of qualified\ninstructors. With this knowledge, we propose an AI literacy framework to define\ncompetencies for medical students. To prioritize relevant and personalized AI\neducation, we categorize literacy into four dimensions: Foundational,\nPractical, Experimental, and Ethical, with tailored learning objectives to the\npre-clinical, clinical, and clinical research stages of medical education. This\nreview provides a road map for developing practical and relevant education\nstrategies for building an AI-competent healthcare workforce.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}