{"id":"2407.15014","title":"Influence of Personality Traits on Plagiarism Through Collusion in\n  Programming Assignments","authors":"Parthasarathy PD, Ishaan Kapoor, Swaroop Joshi, Sujith Thomas","authorsParsed":[["PD","Parthasarathy",""],["Kapoor","Ishaan",""],["Joshi","Swaroop",""],["Thomas","Sujith",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 10:26:48 GMT"}],"updateDate":"2024-09-04","timestamp":1719656808000,"abstract":"  Educating students about academic integrity expectations has been suggested\nas one of the ways to reduce malpractice in take-home programming assignments.\nWe test this hypothesis using data collected from an artificial intelligence\ncourse with 105 participants (N=105) at a university in India. The AI course\nhad two programming assignments. Plagiarism through collusion was quantified\nusing the Measure of Software Similarity (MOSS) tool. Students were educated\nabout what constitutes academic dishonesty and were required to take an honor\npledge before the start of the second take-home programming assignment. The two\nprogramming assignments were novel and did not have solutions available on the\ninternet. We expected the mean percentage of similar lines of code to be\nsignificantly less in the second programming assignment. However, our results\nshow no significant difference in the mean percentage of similar lines of code\nacross the two programming assignments. We also study how the Big-five\npersonality traits affect the propensity for plagiarism in the two take-home\nassignments. Our results across both assignments show that the extraversion\ntrait of the Big Five personality exhibits a positive association, and the\nconscientiousness trait exhibits a negative association with plagiarism\ntendencies. Our result suggests that the policy of educating students about\nacademic integrity will have a limited impact as long as students perceive an\nopportunity for plagiarism to be present. We explain our results using the\nFraud triangle model.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}