{"id":"2407.21626","title":"MeerKLASS L-band deep-field intensity maps: entering the HI dominated\n  regime","authors":"MeerKLASS Collaboration, Matilde Barberi-Squarotti, Jos\\'e L. Bernal,\n  Philip Bull, Stefano Camera, Isabella P. Carucci, Zhaoting Chen, Steven\n  Cunnington, Brandon N. Engelbrecht, Jos\\'e Fonseca, Keith Grainge, Melis O.\n  Irfan, Yichao Li, Aishrila Mazumder, Sourabh Paul, Alkistis Pourtsidou, Mario\n  G. Santos, Marta Spinelli, Jingying Wang, Amadeus Witzemann, Laura Wolz","authorsParsed":[["MeerKLASS Collaboration","",""],["Barberi-Squarotti","Matilde",""],["Bernal","José L.",""],["Bull","Philip",""],["Camera","Stefano",""],["Carucci","Isabella P.",""],["Chen","Zhaoting",""],["Cunnington","Steven",""],["Engelbrecht","Brandon N.",""],["Fonseca","José",""],["Grainge","Keith",""],["Irfan","Melis O.",""],["Li","Yichao",""],["Mazumder","Aishrila",""],["Paul","Sourabh",""],["Pourtsidou","Alkistis",""],["Santos","Mario G.",""],["Spinelli","Marta",""],["Wang","Jingying",""],["Witzemann","Amadeus",""],["Wolz","Laura",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:21:14 GMT"}],"updateDate":"2024-08-01","timestamp":1722435674000,"abstract":"  We present results from MeerKAT single-dish HI intensity maps, the final\nobservations to be performed in L-band in the MeerKAT Large Area Synoptic\nSurvey (MeerKLASS) campaign. The observations represent the deepest single-dish\nHI intensity maps to date, produced from 41 repeated scans over $236\\,{\\rm\ndeg}^2$, providing 62 hours of observational data for each of the 64 dishes\nbefore flagging. By introducing an iterative self-calibration process, the\nestimated thermal noise of the reconstructed maps is limited to\n${\\sim}\\,1.21\\,$mK ($1.2\\,\\times$ the theoretical noise level). This thermal\nnoise will be sub-dominant relative to the HI fluctuations on large scales\n($k\\,{\\lesssim}\\,0.15\\,h\\,\\text{Mpc}^{-1}$), which demands upgrades to power\nspectrum analysis techniques, particularly for covariance estimation. In this\nwork, we present the improved MeerKLASS analysis pipeline, validating it on\nboth a suite of mock simulations and a small sample of overlapping\nspectroscopic galaxies from the Galaxy And Mass Assembly (GAMA) survey. Despite\nonly overlapping with ${\\sim}\\,25\\%$ of the MeerKLASS deep field, and a\nconservative approach to covariance estimation, we still obtain a\n${>}\\,4\\,\\sigma$ detection of the cross-power spectrum between the intensity\nmaps and the 2269 galaxies at the narrow redshift range\n$0.39\\,{<}\\,z\\,{<}\\,0.46$. We briefly discuss the HI auto-power spectrum from\nthis data, the detection of which will be the focus of follow-up work. For the\nfirst time with MeerKAT single-dish intensity maps, we also present evidence of\nHI emission from stacking the maps onto the positions of the GAMA galaxies.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uKiDBNI9BafgSEtnKR8Cxc2HISqpNRtlcvHmzdOG_WY","pdfSize":"12555442"}
