{"id":"2407.20951","title":"An evidence-based methodology for human rights impact assessment (HRIA)\n  in the development of AI data-intensive systems","authors":"Alessandro Mantelero and Maria Samantha Esposito","authorsParsed":[["Mantelero","Alessandro",""],["Esposito","Maria Samantha",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 16:27:52 GMT"}],"updateDate":"2024-07-31","timestamp":1722356872000,"abstract":"  Different approaches have been adopted in addressing the challenges of\nArtificial Intelligence (AI), some centred on personal data and others on\nethics, respectively narrowing and broadening the scope of AI regulation. This\ncontribution aims to demonstrate that a third way is possible, starting from\nthe acknowledgement of the role that human rights can play in regulating the\nimpact of data-intensive systems. The focus on human rights is neither a\nparadigm shift nor a mere theoretical exercise. Through the analysis of more\nthan 700 decisions and documents of the data protection authorities of six\ncountries, we show that human rights already underpin the decisions in the\nfield of data use. Based on empirical analysis of this evidence, this work\npresents a methodology and a model for a Human Rights Impact Assessment (HRIA).\nThe methodology and related assessment model are focused on AI applications,\nwhose nature and scale require a proper contextualisation of HRIA methodology.\nMoreover, the proposed models provide a more measurable approach to risk\nassessment which is consistent with the regulatory proposals centred on risk\nthresholds. The proposed methodology is tested in concrete case-studies to\nprove its feasibility and effectiveness. The overall goal is to respond to the\ngrowing interest in HRIA, moving from a mere theoretical debate to a concrete\nand context-specific implementation in the field of data-intensive applications\nbased on AI.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}