{"id":"2407.16888","title":"A Nested Model for AI Design and Validation","authors":"Akshat Dubey, Zewen Yang, Georges Hattab","authorsParsed":[["Dubey","Akshat",""],["Yang","Zewen",""],["Hattab","Georges",""]],"versions":[{"version":"v1","created":"Sat, 8 Jun 2024 12:46:12 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 11:46:26 GMT"}],"updateDate":"2024-08-27","timestamp":1717850772000,"abstract":"  The growing AI field faces trust, transparency, fairness, and discrimination\nchallenges. Despite the need for new regulations, there is a mismatch between\nregulatory science and AI, preventing a consistent framework. A five-layer\nnested model for AI design and validation aims to address these issues and\nstreamline AI application design and validation, improving fairness, trust, and\nAI adoption. This model aligns with regulations, addresses AI practitioner's\ndaily challenges, and offers prescriptive guidance for determining appropriate\nevaluation approaches by identifying unique validity threats. We have three\nrecommendations motivated by this model: authors should distinguish between\nlayers when claiming contributions to clarify the specific areas in which the\ncontribution is made and to avoid confusion, authors should explicitly state\nupstream assumptions to ensure that the context and limitations of their AI\nsystem are clearly understood, AI venues should promote thorough testing and\nvalidation of AI systems and their compliance with regulatory requirements.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hq3ltbntfgNRHt3k6Hio3ZBCCPOPB677zumJutt9dWM","pdfSize":"450107","objectId":"0x2aa53919470602327b2793f7aaf0b2318290716be01e23f7f77a6b29e8569f91","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
