{"id":"2407.00394","title":"Understanding Large-Scale Plasma Simulation Challenges for Fusion Energy\n  on Supercomputers","authors":"Jeremy J. Williams, Ashish Bhole, Dylan Kierans, Matthias Hoelzl, Ihor\n  Holod, Weikang Tang, David Tskhakaya, Stefan Costea, Leon Kos, Ales Podolnik,\n  Jakub Hromadka, JOREK Team, Erwin Laure, Stefano Markidis","authorsParsed":[["Williams","Jeremy J.",""],["Bhole","Ashish",""],["Kierans","Dylan",""],["Hoelzl","Matthias",""],["Holod","Ihor",""],["Tang","Weikang",""],["Tskhakaya","David",""],["Costea","Stefan",""],["Kos","Leon",""],["Podolnik","Ales",""],["Hromadka","Jakub",""],["Team","JOREK",""],["Laure","Erwin",""],["Markidis","Stefano",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 10:30:23 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 08:11:08 GMT"}],"updateDate":"2024-07-31","timestamp":1719657023000,"abstract":"  Understanding plasma instabilities is essential for achieving sustainable\nfusion energy, with large-scale plasma simulations playing a crucial role in\nboth the design and development of next-generation fusion energy devices and\nthe modelling of industrial plasmas. To achieve sustainable fusion energy, it\nis essential to accurately model and predict plasma behavior under extreme\nconditions, requiring sophisticated simulation codes capable of capturing the\ncomplex interaction between plasma dynamics, magnetic fields, and material\nsurfaces. In this work, we conduct a comprehensive HPC analysis of two\nprominent plasma simulation codes, BIT1 and JOREK, to advance understanding of\nplasma behavior in fusion energy applications. Our focus is on evaluating\nJOREK's computational efficiency and scalability for simulating non-linear MHD\nphenomena in tokamak fusion devices. The motivation behind this work stems from\nthe urgent need to advance our understanding of plasma instabilities in\nmagnetically confined fusion devices. Enhancing JOREK's performance on\nsupercomputers improves fusion plasma code predictability, enabling more\naccurate modelling and faster optimization of fusion designs, thereby\ncontributing to sustainable fusion energy. In prior studies, we analysed BIT1,\na massively parallel Particle-in-Cell (PIC) code for studying plasma-material\ninteractions in fusion devices. Our investigations into BIT1's computational\nrequirements and scalability on advanced supercomputing architectures yielded\nvaluable insights. Through detailed profiling and performance analysis, we have\nidentified the primary bottlenecks and implemented optimization strategies,\nsignificantly enhancing parallel performance. This previous work serves as a\nfoundation for our present endeavours.\n","subjects":["Physics/Plasma Physics","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Performance","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QEInPBcc5ES5vB7UkJHVgb-Yxndm8IgwdQXlSb1oFMU","pdfSize":"1434320"}
