{"id":"2407.19229","title":"Impact of Transmission Dynamics and Treatment Uptake, Frequency and\n  Timing on the Cost-effectiveness of Directly Acting Antivirals for Hepatitis\n  C Virus Infection","authors":"Soham Das, Ajit Sood, Vandana Midha, Arshdeep Singh, Pranjl Sharma,\n  Varun Ramamohan","authorsParsed":[["Das","Soham",""],["Sood","Ajit",""],["Midha","Vandana",""],["Singh","Arshdeep",""],["Sharma","Pranjl",""],["Ramamohan","Varun",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 10:47:19 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 22:00:10 GMT"}],"updateDate":"2024-09-19","timestamp":1722077239000,"abstract":"  Cost-effectiveness analyses, based on decision-analytic models of disease\nprogression and treatment, are routinely used to assess the economic value of a\nnew intervention and consequently inform reimbursement decisions for the\nintervention. Many decision-analytic models developed to assess the economic\nvalue of highly effective directly acting antiviral (DAA) treatments for the\nhepatitis C virus (HCV) infection do not incorporate the transmission dynamics\nof HCV, accounting for which is required to estimate the number of downstream\ninfections prevented by curing an infection. In this study, we develop and\nvalidate a comprehensive agent-based simulation (ABS) model of HCV transmission\ndynamics in the Indian context and use it to: (a) quantify the extent to which\nthe cost-effectiveness of a DAA is underestimated - as a function of its uptake\nrate - if disease transmission dynamics are not considered in a\ncost-effectiveness analysis model; and (b) quantify the impact of the frequency\nand timing of treatment with DAAs, also as a function of their uptake rate,\nwithin a disease surveillance period on its cost-effectiveness. The process of\naccomplishing the above research objectives also motivated the development of a\nnovel random sampling and allocation based approach, along with associated\ntheoretical grounding, to estimate individual-level outcomes within an ABS that\nincurs substantially lower computational expense than the benchmark incremental\naccumulation approach.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}