{"id":"2407.21432","title":"Analyzing the impact of semantic LoD3 building models on image-based\n  vehicle localization","authors":"Antonia Bieringer, Olaf Wysocki, Sebastian Tuttas, Ludwig Hoegner,\n  Christoph Holst","authorsParsed":[["Bieringer","Antonia",""],["Wysocki","Olaf",""],["Tuttas","Sebastian",""],["Hoegner","Ludwig",""],["Holst","Christoph",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 08:33:41 GMT"}],"updateDate":"2024-08-01","timestamp":1722414821000,"abstract":"  Numerous navigation applications rely on data from global navigation\nsatellite systems (GNSS), even though their accuracy is compromised in urban\nareas, posing a significant challenge, particularly for precise autonomous car\nlocalization. Extensive research has focused on enhancing localization accuracy\nby integrating various sensor types to address this issue. This paper\nintroduces a novel approach for car localization, leveraging image features\nthat correspond with highly detailed semantic 3D building models. The core\nconcept involves augmenting positioning accuracy by incorporating prior\ngeometric and semantic knowledge into calculations. The work assesses outcomes\nusing Level of Detail 2 (LoD2) and Level of Detail 3 (LoD3) models, analyzing\nwhether facade-enriched models yield superior accuracy. This comprehensive\nanalysis encompasses diverse methods, including off-the-shelf feature matching\nand deep learning, facilitating thorough discussion. Our experiments\ncorroborate that LoD3 enables detecting up to 69\\% more features than using\nLoD2 models. We believe that this study will contribute to the research of\nenhancing positioning accuracy in GNSS-denied urban canyons. It also shows a\npractical application of under-explored LoD3 building models on map-based car\npositioning.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eCj865ficyIlGZoinlcEpVPsLpORZZR_A_jEAeaa_z0","pdfSize":"7778800"}
