{"id":"2407.02974","title":"IM-MoCo: Self-supervised MRI Motion Correction using Motion-Guided\n  Implicit Neural Representations","authors":"Ziad Al-Haj Hemidi, Christian Weihsbach, and Mattias P. Heinrich","authorsParsed":[["Hemidi","Ziad Al-Haj",""],["Weihsbach","Christian",""],["Heinrich","Mattias P.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 10:14:33 GMT"}],"updateDate":"2024-07-04","timestamp":1720001673000,"abstract":"  Motion artifacts in Magnetic Resonance Imaging (MRI) arise due to relatively\nlong acquisition times and can compromise the clinical utility of acquired\nimages. Traditional motion correction methods often fail to address severe\nmotion, leading to distorted and unreliable results. Deep Learning (DL)\nalleviated such pitfalls through generalization with the cost of vanishing\nstructures and hallucinations, making it challenging to apply in the medical\nfield where hallucinated structures can tremendously impact the diagnostic\noutcome. In this work, we present an instance-wise motion correction pipeline\nthat leverages motion-guided Implicit Neural Representations (INRs) to mitigate\nthe impact of motion artifacts while retaining anatomical structure. Our method\nis evaluated using the NYU fastMRI dataset with different degrees of simulated\nmotion severity. For the correction alone, we can improve over state-of-the-art\nimage reconstruction methods by $+5\\%$ SSIM, $+5\\:db$ PSNR, and $+14\\%$\nHaarPSI. Clinical relevance is demonstrated by a subsequent experiment, where\nour method improves classification outcomes by at least $+1.5$ accuracy\npercentage points compared to motion-corrupted images.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cbYo9H2sDVPjHpLl6YCbWdes-2I3dJGmU260C7BHQAI","pdfSize":"3933741"}
