{"id":"2407.00123","title":"Modeling Performance of Data Collection Systems for High-Energy Physics","authors":"Wilkie Olin-Ammentorp, Xingfu Wu, Andrew A. Chien","authorsParsed":[["Olin-Ammentorp","Wilkie",""],["Wu","Xingfu",""],["Chien","Andrew A.",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 21:46:35 GMT"}],"updateDate":"2024-07-02","timestamp":1719524795000,"abstract":"  Exponential increases in scientific experimental data are outstripping the\nrate of progress in silicon technology. As a result, heterogeneous combinations\nof architectures and process or device technologies are increasingly important\nto meet the computing demands of future scientific experiments. However, the\ncomplexity of heterogeneous computing systems requires systematic modeling to\nunderstand performance.\n  We present a model which addresses this need by framing key aspects of data\ncollection pipelines and constraints, and combines them with the important\nvectors of technology that shape alternatives, computing metrics that allow\ncomplex alternatives to be compared. For instance, a data collection pipeline\nmay be characterized by parameters such as sensor sampling rates, amount of\ndata collected, and the overall relevancy of retrieved samples. Alternatives to\nthis pipeline are enabled by hardware development vectors including advancing\nCMOS, GPUs, neuromorphic computing, and edge computing. By calculating metrics\nfor each alternative such as overall F1 score, power, hardware cost, and energy\nexpended per relevant sample, this model allows alternate data collection\nsystems to be rigorously compared.\n  To demonstrate this model's capability, we apply it to the CMS experiment\n(and planned HL-LHC upgrade) to evaluate and compare the application of novel\ntechnologies in the data acquisition system (DAQ). We demonstrate that\nimprovements to early stages in the DAQ are highly beneficial, greatly reducing\nthe resources required at later stages of processing (such as a 60% power\nreduction) and increasing the amount of relevant data retrieved from the\nexperiment per unit power (improving from 0.065 to 0.31 samples/kJ) However, we\npredict further advances will be required in order to meet overall power and\ncost constraints for the DAQ.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Physics/Data Analysis, Statistics and Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}