{"id":"2407.08735","title":"Real-Time Anomaly Detection and Reactive Planning with Large Language\n  Models","authors":"Rohan Sinha, Amine Elhafsi, Christopher Agia, Matthew Foutter, Edward\n  Schmerling, Marco Pavone","authorsParsed":[["Sinha","Rohan",""],["Elhafsi","Amine",""],["Agia","Christopher",""],["Foutter","Matthew",""],["Schmerling","Edward",""],["Pavone","Marco",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:59:22 GMT"}],"updateDate":"2024-07-12","timestamp":1720720762000,"abstract":"  Foundation models, e.g., large language models (LLMs), trained on\ninternet-scale data possess zero-shot generalization capabilities that make\nthem a promising technology towards detecting and mitigating\nout-of-distribution failure modes of robotic systems. Fully realizing this\npromise, however, poses two challenges: (i) mitigating the considerable\ncomputational expense of these models such that they may be applied online, and\n(ii) incorporating their judgement regarding potential anomalies into a safe\ncontrol framework. In this work, we present a two-stage reasoning framework:\nFirst is a fast binary anomaly classifier that analyzes observations in an LLM\nembedding space, which may then trigger a slower fallback selection stage that\nutilizes the reasoning capabilities of generative LLMs. These stages correspond\nto branch points in a model predictive control strategy that maintains the\njoint feasibility of continuing along various fallback plans to account for the\nslow reasoner's latency as soon as an anomaly is detected, thus ensuring\nsafety. We show that our fast anomaly classifier outperforms autoregressive\nreasoning with state-of-the-art GPT models, even when instantiated with\nrelatively small language models. This enables our runtime monitor to improve\nthe trustworthiness of dynamic robotic systems, such as quadrotors or\nautonomous vehicles, under resource and time constraints. Videos illustrating\nour approach in both simulation and real-world experiments are available on\nthis project page: https://sites.google.com/view/aesop-llm.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}