{"id":"2407.15542","title":"Fast second-order dynamics with slow vanishing damping approaching the\n  zeros of a monotone and continuous operator","authors":"Radu Ioan Bot, David Alexander Hulett, Dang-Khoa Nguyen","authorsParsed":[["Bot","Radu Ioan",""],["Hulett","David Alexander",""],["Nguyen","Dang-Khoa",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 11:08:54 GMT"}],"updateDate":"2024-07-23","timestamp":1721646534000,"abstract":"  In this work, we approach the problem of finding the zeros of a continuous\nand monotone operator through a second-order dynamical system with a damping\nterm of the form $1/t^{r}$, where $r\\in [0, 1]$. The system features the time\nderivative of the operator evaluated along the trajectory, which is a\nHessian-driven type damping term when the governing operator comes from a\npotential. Also entering the system is a time rescaling parameter $\\beta(t)$\nwhich satisfies a certain growth condition. We derive\n$o\\left(\\frac{1}{t^{2r}\\beta(t)}\\right)$ convergence rates for the norm of the\noperator evaluated along the generated trajectories as well as for a gap\nfunction which serves as a measure of optimality for the associated variational\ninequality. The parameter $r$ enters the growth condition for $\\beta(t)$: when\n$r < 1$, the damping $1/t^{r}$ approaches zero at a slower speed than\nNesterov's $1/t$ damping; in this case, we are allowed to choose $\\beta(t)$ to\nbe an exponential function, thus having linear convergence rates for the\ninvolved quantities. We also show weak convergence of the trajectories towards\nzeros of the governing operator. Through a particular choice for the operator,\nwe establish a connection with the problem of minimizing a smooth and convex\nfunction with linear constraints. The convergence rates we derived in the\noperator case are inherited by the objective function evaluated at the\ntrajectories and for the feasibility gap. We also prove weak convergence of the\ntrajectories towards primal-dual solutions of the problem.\n  A discretization of the dynamical system yields an implicit algorithm that\nexhibits analogous convergence properties to its continuous counterpart.\n  We complement our theoretical findings with two numerical experiments.\n","subjects":["Mathematics/Optimization and Control","Mathematics/Classical Analysis and ODEs"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JsI2v6LpPCfKvzE1yixJdlnw1qBOIKqdTTu4XrzpDXU","pdfSize":"1035190"}
