{"id":"2407.15485","title":"Subthalamic Nucleus segmentation in high-field Magnetic Resonance data.\n  Is space normalization by template co-registration necessary?","authors":"Tom\\'as Lima, Igor Varga, Eduard Bak\\v{s}tein, Daniel Nov\\'ak, Victor\n  Alves","authorsParsed":[["Lima","Tomás",""],["Varga","Igor",""],["Bakštein","Eduard",""],["Novák","Daniel",""],["Alves","Victor",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 08:57:19 GMT"}],"updateDate":"2024-07-23","timestamp":1721638639000,"abstract":"  Deep Brain Stimulation (DBS) is one of the most successful methods to\ndiminish late-stage Parkinson's Disease (PD) symptoms. It is a delicate\nsurgical procedure which requires detailed pre-surgical patient's study.\nHigh-field Magnetic Resonance Imaging (MRI) has proven its improved capacity of\ncapturing the Subthalamic Nucleus (STN) - the main target of DBS in PD - in\ngreater detail than lower field images. Here, we present a comparison between\nthe performance of two different Deep Learning (DL) automatic segmentation\narchitectures, one based in the registration to a brain template and the other\nperforming the segmentation in in the MRI acquisition native space. The study\nwas based on publicly available high-field 7 Tesla (T) brain MRI datasets of\nT1-weighted and T2-weighted sequences. nnUNet was used on the segmentation step\nof both architectures, while the data pre and post-processing pipelines\ndiverged. The evaluation metrics showed that the performance of the\nsegmentation directly in the native space yielded better results for the STN\nsegmentation, despite not showing any advantage over the template-based method\nfor the to other analysed structures: the Red Nucleus (RN) and the Substantia\nNigra (SN).\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"lXkB_lh6sdeX9klpz56agPiClcjYLEmdmSObmBVnhGQ","pdfSize":"2167046","objectId":"0x58d71eca7fdd3f812545112ae21581aef7275ac0f27b629aa90f1b2945a9b20b","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
