{"id":"2407.04143","title":"Simultaneous System Identification and Model Predictive Control with No\n  Dynamic Regret","authors":"Hongyu Zhou, Vasileios Tzoumas","authorsParsed":[["Zhou","Hongyu",""],["Tzoumas","Vasileios",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 20:10:41 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 19:21:40 GMT"}],"updateDate":"2024-07-12","timestamp":1720123841000,"abstract":"  We provide an algorithm for the simultaneous system identification and model\npredictive control of nonlinear systems. The algorithm has finite-time\nnear-optimality guarantees and asymptotically converges to the optimal\n(non-causal) controller. Particularly, the algorithm enjoys sublinear dynamic\nregret, defined herein as the suboptimality against an optimal clairvoyant\ncontroller that knows how the unknown disturbances and system dynamics will\nadapt to its actions. The algorithm is self-supervised and applies to\ncontrol-affine systems with unknown dynamics and disturbances that can be\nexpressed in reproducing kernel Hilbert spaces. Such spaces can model external\ndisturbances and modeling errors that can even be adaptive to the system's\nstate and control input. For example, they can model wind and wave disturbances\nto aerial and marine vehicles, or inaccurate model parameters such as inertia\nof mechanical systems. The algorithm first generates random Fourier features\nthat are used to approximate the unknown dynamics or disturbances. Then, it\nemploys model predictive control based on the current learned model of the\nunknown dynamics (or disturbances). The model of the unknown dynamics is\nupdated online using least squares based on the data collected while\ncontrolling the system. We validate our algorithm in both hardware experiments\nand physics-based simulations. The simulations include (i) a cart-pole aiming\nto maintain the pole upright despite inaccurate model parameters, and (ii) a\nquadrotor aiming to track reference trajectories despite unmodeled aerodynamic\ndrag effects. The hardware experiments include a quadrotor aiming to track a\ncircular trajectory despite unmodeled aerodynamic drag effects, ground effects,\nand wind disturbances.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}