{"id":"2407.03432","title":"Relational dynamics and Page-Wootters formalism in group field theory","authors":"Andrea Calcinari and Steffen Gielen","authorsParsed":[["Calcinari","Andrea",""],["Gielen","Steffen",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:18:36 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 14:40:18 GMT"}],"updateDate":"2024-08-12","timestamp":1720030716000,"abstract":"  Group field theory posits that spacetime is emergent and is hence defined\nwithout any background notion of space or time; dynamical questions are\nformulated in relational terms, in particular using (scalar) matter degrees of\nfreedom as time. Unlike in canonical quantisation of gravitational systems,\nthere is no obvious notion of coordinate transformations or constraints, and\nestablished quantisation methods cannot be directly applied. As a result,\ndifferent canonical formalisms for group field theory have been discussed in\nthe literature. We address these issues using a parametrised version of group\nfield theory, in which all (geometry and matter) degrees of freedom evolve in a\nfiducial parameter. There is a constraint associated to the freedom of\nreparametrisation and the Dirac quantisation programme can be implemented.\nUsing the \"trinity of relational dynamics\", we show that the resulting\n\"clock-neutral\" theory is entirely equivalent to a deparametrised canonical\ngroup field theory, interpreted in terms of the Page-Wootters formalism. Our\nresults not only show that the deparametrised quantisation is fully covariant\nand can be seen as encoding the dynamics of joint quantum matter and geometry\ndegrees of freedom, they also appear to be the first application of the\nPage-Wootters formalism directly to non-perturbative quantum gravity. We show\nextensions to a setting in which many independent gauge symmetries are\nintroduced, which connects to the \"multi-fingered time\" idea in quantum gravity\nand provides a somewhat novel extension of the Page-Wootters formalism.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}