{"id":"2407.08318","title":"Modeling and Suppressing Unwanted Parasitic Interactions in\n  Superconducting Circuits","authors":"Xuexin Xu","authorsParsed":[["Xu","Xuexin",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 09:07:45 GMT"}],"updateDate":"2024-07-12","timestamp":1720688865000,"abstract":"  Superconducting qubits are among the most promising candidates for building\nquantum computers. Despite significant improvements in qubit coherence,\nachieving a fault-tolerant quantum computer remains a major challenge, largely\ndue to imperfect gate fidelity. A key source of this infidelity is the\nparasitic interaction between coupled qubits, which this thesis addresses in\ntwo- and three-qubit circuits. This parasitic interaction causes a bending\nbetween computational and non-computational levels, leading to a parasitic ZZ\ninteraction. The thesis first investigates the possibility of zeroing the ZZ\ninteraction in two qubit combinations: a pair of interacting transmons, and a\nhybrid pair of a transmon coupled to a capacitively shunted flux qubit (CSFQ).\nThe theory developed is used to accurately simulate experimental results from\nour collaborators, who measured a CSFQ-transmon pair with and without a\ncross-resonance (CR) gate. The strong agreement between theory and experiment\nmotivated further study of a CR gate that achieves 99.9% fidelity in the\nabsence of static ZZ interaction. Since the CR pulse adds an additional ZZ\ncomponent to the static part, a new strategy called dynamical ZZ freedom is\nproposed to zero the total ZZ interaction. This strategy can be applied in\nall-transmon circuits to enable perfect entanglement. Based on these findings,\na new two-qubit gate, the parasitic-free (PF) gate, is proposed. Additionally,\nthe thesis explores how to utilize the ZZ interaction to enhance the\nperformance of a controlled-Z gate. Lastly, the impact of a third qubit on\ntwo-qubit gate performance is examined, with several examples illustrating the\nproperties of two-body ZZ and three-body ZZZ interactions in circuits with more\nthan two qubits.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aYb5zpDkJDrZobgiJG4epJrc73FjVaaEXlLxju1pF6M","pdfSize":"9525639"}
