{"id":"2407.10956","title":"Spider2-V: How Far Are Multimodal Agents From Automating Data Science\n  and Engineering Workflows?","authors":"Ruisheng Cao, Fangyu Lei, Haoyuan Wu, Jixuan Chen, Yeqiao Fu,\n  Hongcheng Gao, Xinzhuang Xiong, Hanchong Zhang, Yuchen Mao, Wenjing Hu,\n  Tianbao Xie, Hongshen Xu, Danyang Zhang, Sida Wang, Ruoxi Sun, Pengcheng Yin,\n  Caiming Xiong, Ansong Ni, Qian Liu, Victor Zhong, Lu Chen, Kai Yu and Tao Yu","authorsParsed":[["Cao","Ruisheng",""],["Lei","Fangyu",""],["Wu","Haoyuan",""],["Chen","Jixuan",""],["Fu","Yeqiao",""],["Gao","Hongcheng",""],["Xiong","Xinzhuang",""],["Zhang","Hanchong",""],["Mao","Yuchen",""],["Hu","Wenjing",""],["Xie","Tianbao",""],["Xu","Hongshen",""],["Zhang","Danyang",""],["Wang","Sida",""],["Sun","Ruoxi",""],["Yin","Pengcheng",""],["Xiong","Caiming",""],["Ni","Ansong",""],["Liu","Qian",""],["Zhong","Victor",""],["Chen","Lu",""],["Yu","Kai",""],["Yu","Tao",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:54:37 GMT"}],"updateDate":"2024-07-16","timestamp":1721066077000,"abstract":"  Data science and engineering workflows often span multiple stages, from\nwarehousing to orchestration, using tools like BigQuery, dbt, and Airbyte. As\nvision language models (VLMs) advance in multimodal understanding and code\ngeneration, VLM-based agents could potentially automate these workflows by\ngenerating SQL queries, Python code, and GUI operations. This automation can\nimprove the productivity of experts while democratizing access to large-scale\ndata analysis. In this paper, we introduce Spider2-V, the first multimodal\nagent benchmark focusing on professional data science and engineering\nworkflows, featuring 494 real-world tasks in authentic computer environments\nand incorporating 20 enterprise-level professional applications. These tasks,\nderived from real-world use cases, evaluate the ability of a multimodal agent\nto perform data-related tasks by writing code and managing the GUI in\nenterprise data software systems. To balance realistic simulation with\nevaluation simplicity, we devote significant effort to developing automatic\nconfigurations for task setup and carefully crafting evaluation metrics for\neach task. Furthermore, we supplement multimodal agents with comprehensive\ndocuments of these enterprise data software systems. Our empirical evaluation\nreveals that existing state-of-the-art LLM/VLM-based agents do not reliably\nautomate full data workflows (14.0% success). Even with step-by-step guidance,\nthese agents still underperform in tasks that require fine-grained,\nknowledge-intensive GUI actions (16.2%) and involve remote cloud-hosted\nworkspaces (10.6%). We hope that Spider2-V paves the way for autonomous\nmultimodal agents to transform the automation of data science and engineering\nworkflow. Our code and data are available at https://spider2-v.github.io.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}