{"id":"2407.14415","title":"Hyenas: X-ray Bubbles and Cavities in the Intra-Group Medium","authors":"Fred J. Jennings, Arif Babul, Romeel Dave, Weiguang Cui, Douglas\n  Rennehan","authorsParsed":[["Jennings","Fred J.",""],["Babul","Arif",""],["Dave","Romeel",""],["Cui","Weiguang",""],["Rennehan","Douglas",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:41:18 GMT"}],"updateDate":"2024-07-22","timestamp":1721403678000,"abstract":"  We investigate the role of the Simba feedback model on the structure of the\nIntra-Group Medium (IGrM) in the new Hyenas suite of cutting-edge cosmological\nzoom-in simulations. Using 34 high-resolution zooms of halos spanning from\n$10^{13}-10^{14}$ $M_\\odot$ at $z=0.286$, we follow halos for 700 Myr, over\nseveral major active galactic nuclei (AGN) jet feedback events. We use the\nMOXHA package to generate mock Chandra X-ray observations, as well as\npredictive mocks for the upcoming LEM mission, identifying many\nfeedback-generated features such as cavities, shock-fronts, and hot-spots,\nclosely mimicking real observations. Our sample comprises $105$ snapshots with\nidentified cavities, $50$ with single bubbles and $55$ with two, and spans\nthree orders of magnitude in observed cavity enthalpies, from $10^{41}-10^{44}$\nerg/s. Comparing semi-major axis length, midpoint radius, and eccentricity to a\nmatched sample of observations, we find good agreement in cavity dimensions\nwith real catalogues. We estimate cavity power from our mock maps following\nobservational procedures, showing that this is typically more than enough to\noffset halo cooling, particularly in low-mass halos, where we match the\nobserved excess in energy relative to cooling. Bubble enthalpy as measured with\nthe usual midpoint pressure typically exceeds the energy released by the most\nrecent jet event, hinting that the mechanical work is done predominantly at a\nlower pressure against the IGrM. We demonstrate for the first time that X-ray\ncavities are observable in a modern large-scale simulation suite and discuss\nthe use of realistic cavity mock observations as new halo-scale constraints on\nfeedback models in cosmological simulations.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SPhXi0SayIHL7z1pFvdIVOKQit-c4Y0lESHiN0HAiSI","pdfSize":"20776164"}
