{"id":"2407.13721","title":"Measurement of the fractional radiation length of a pixel module for the\n  CMS Phase-2 upgrade via the multiple scattering of positrons","authors":"The Tracker Group of the CMS Collaboration","authorsParsed":[["The Tracker Group of the CMS Collaboration","",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:21:51 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 07:40:16 GMT"},{"version":"v3","created":"Sun, 15 Sep 2024 19:16:32 GMT"}],"updateDate":"2024-09-17","timestamp":1721323311000,"abstract":"  High-luminosity particle collider experiments such as the ones planned at the\nHigh-Luminosity Large Hadron Collider require ever-greater vertexing precision\nof the tracking detectors, necessitating also reductions in the material budget\nof the detectors. Traditionally, the fractional radiation length ($x/X_0$) of\ndetectors is either estimated using known properties of the constituent\nmaterials, or measured in dedicated runs of the final detector. In this paper,\nwe present a method of direct measurement of the material budget of a CMS\nprototype module designed for the Phase-2 upgrade of the CMS detector using a\n40-65 MeV positron beam. A total of 630 million events were collected at the\nPaul Scherrer Institut PiE1 experimental area using a three-plane telescope\nconsisting of the prototype module as the central plane, surrounded by two\nMALTA monolithic pixel detectors. Fractional radiation lengths were extracted\nfrom scattering angle distributions using the Highland approximation for\nmultiple scattering. A statistical technique recovered runs suffering from\ntrigger desynchronisation, and several corrections were introduced to\ncompensate for local inefficiencies related to geometric and beam shape\nconstraints. Two regions of the module were surveyed and yielded average\n$x/X_0$ values of $(0.72 \\pm 0.05)\\%$ and $(0.95 \\pm 0.09)\\%$, which are\ncompatible with empirical estimates for these regions computed from known\nmaterial properties of 0.753% and 0.892%, respectively. Higher-granularity maps\nof the fractional radiation length were produced for both rectangular regions\nand regions of uniform material composition. The results bode well for the CMS\nPhase-2 upgrade modules, which will play a key role in the minimisation of the\nmaterial budget of the upgraded detector.\n","subjects":["Physics/Instrumentation and Detectors","Physics/High Energy Physics - Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}