{"id":"2407.18311","title":"Long-term radio monitoring of the fast X-ray transient EP240315a:\n  evidence for a relativistic jet","authors":"R. Ricci, E. Troja, Y. Yang, M. Yadav, Y. Liu, H. Sun, X. Wu, H. Gao,\n  B. Zhang, W. Yuan","authorsParsed":[["Ricci","R.",""],["Troja","E.",""],["Yang","Y.",""],["Yadav","M.",""],["Liu","Y.",""],["Sun","H.",""],["Wu","X.",""],["Gao","H.",""],["Zhang","B.",""],["Yuan","W.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 18:04:56 GMT"}],"updateDate":"2024-07-29","timestamp":1721930696000,"abstract":"  The recent launch of Einstein Probe (EP) in early 2024 opened up a new window\nonto the transient X-ray sky, allowing for real-time discovery and follow-up of\nfast X-ray transients (FXRTs). Multi-wavelength observations of FXRTs and their\ncounterparts are key to characterize the properties of their outflows and,\nultimately, identify their progenitors. Here, we report our long-term radio\nmonitoring of EP240315A, a long-lasting ($\\sim 1000$ s) high redshift ($z=4.9$)\nFXRT associated to GRB~240315C. Our campaign, carried out with the Australian\nTelescope Compact Array (ATCA), followed the transient's evolution at two\ndifferent frequencies (5.5 GHz and 9~GHz) for three months. In the radio\nlightcurves we identify an unusual steep rise at 9 GHz, possibly due to a\nrefreshed reverse shock, and a late-time rapid decay of the radio flux, which\nwe interpret as a jet break due to the outflow collimation. We find that the\nmulti-wavelength counterpart of EP240315A is well described by a model of\nrelativistic jet seen close to its axis, with jet half-opening angle $\\theta_j\n\\approx 3 ^{\\circ}$ and beaming-corrected total energy $E \\simeq 4\\times\n10^{51}$~erg, typical of GRBs. These results show that a substantial fraction\nof FXRTs may be associated to standard GRBs and that sensitive X-ray monitors,\nsuch as Einstein Probe and the proposed HiZ-GUNDAM and Theseus missions, can\nsuccessfully pinpoint their relativistic outflows up to high-redshifts.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}