{"id":"2407.20391","title":"Alignment Scores: Robust Metrics for Multiview Pose Accuracy Evaluation","authors":"Seong Hun Lee, Javier Civera","authorsParsed":[["Lee","Seong Hun",""],["Civera","Javier",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 19:34:23 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 21:31:14 GMT"}],"updateDate":"2024-08-06","timestamp":1722281663000,"abstract":"  We propose three novel metrics for evaluating the accuracy of a set of\nestimated camera poses given the ground truth: Translation Alignment Score\n(TAS), Rotation Alignment Score (RAS), and Pose Alignment Score (PAS). The TAS\nevaluates the translation accuracy independently of the rotations, and the RAS\nevaluates the rotation accuracy independently of the translations. The PAS is\nthe average of the two scores, evaluating the combined accuracy of both\ntranslations and rotations. The TAS is computed in four steps: (1) Find the\nupper quartile of the closest-pair-distances, $d$. (2) Align the estimated\ntrajectory to the ground truth using a robust registration method. (3) Collect\nall distance errors and obtain the cumulative frequencies for multiple\nthresholds ranging from $0.01d$ to $d$ with a resolution $0.01d$. (4) Add up\nthese cumulative frequencies and normalize them such that the theoretical\nmaximum is 1. The TAS has practical advantages over the existing metrics in\nthat (1) it is robust to outliers and collinear motion, and (2) there is no\nneed to adjust parameters on different datasets. The RAS is computed in a\nsimilar manner to the TAS and is also shown to be more robust against outliers\nthan the existing rotation metrics. We verify our claims through extensive\nsimulations and provide in-depth discussion of the strengths and weaknesses of\nthe proposed metrics.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}