{"id":"2407.07503","title":"Inter and Intra Prior Learning-based Hyperspectral Image Reconstruction\n  Using Snapshot SWIR Metasurface","authors":"Linqiang Li, Jinglei Hao, Yongqiang Zhao, Pan Liu, Haofang Yan, Ziqin\n  Zhang, Seong G. Kong","authorsParsed":[["Li","Linqiang",""],["Hao","Jinglei",""],["Zhao","Yongqiang",""],["Liu","Pan",""],["Yan","Haofang",""],["Zhang","Ziqin",""],["Kong","Seong G.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 09:41:36 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 02:49:39 GMT"},{"version":"v3","created":"Wed, 24 Jul 2024 13:07:26 GMT"}],"updateDate":"2024-07-25","timestamp":1720604496000,"abstract":"  Shortwave-infrared(SWIR) spectral information, ranging from 1 {\\mu}m to\n2.5{\\mu}m, overcomes the limitations of traditional color cameras in acquiring\nscene information. However, conventional SWIR hyperspectral imaging systems\nface challenges due to their bulky setups and low acquisition speeds. This work\nintroduces a snapshot SWIR hyperspectral imaging system based on a metasurface\nfilter and a corresponding filter selection method to achieve the lowest\ncorrelation coefficient among these filters. This system offers the advantages\nof compact size and snapshot imaging. We propose a novel inter and intra prior\nlearning unfolding framework to achieve high-quality SWIR hyperspectral image\nreconstruction, which bridges the gap between prior learning and cross-stage\ninformation interaction. Additionally, We design an adaptive feature transfer\nmechanism to adaptively transfer the contextual correlation of multi-scale\nencoder features to prevent detailed information loss in the decoder.\nExperiment results demonstrate that our method can reconstruct hyperspectral\nimages with high speed and superior performance over existing methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}