{"id":"2407.14873","title":"Bayesian self-calibration and imaging in Very Long Baseline\n  Interferometry","authors":"Jong-Seo Kim, Aleksei S. Nikonov, Jakob Roth, Torsten A. Ensslin,\n  Michael Janssen, Philipp Arras, Hendrik Mueller, and Andrei P. Lobanov","authorsParsed":[["Kim","Jong-Seo",""],["Nikonov","Aleksei S.",""],["Roth","Jakob",""],["Ensslin","Torsten A.",""],["Janssen","Michael",""],["Arras","Philipp",""],["Mueller","Hendrik",""],["Lobanov","Andrei P.",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 13:24:25 GMT"}],"updateDate":"2024-07-23","timestamp":1721481865000,"abstract":"  Self-calibration methods with the CLEAN algorithm have been widely employed\nin Very Long Baseline Interferometry (VLBI) data processing in order to correct\nantenna-based amplitude and phase corruptions present in the data. However,\nhuman interaction during the conventional CLEAN self-calibration process can\nimpose a strong effective prior, which in turn may produce artifacts within the\nfinal image and hinder the reproducibility of final results. In this work, we\naim to demonstrate a combined self-calibration and imaging method for VLBI data\nin a Bayesian inference framework. The method corrects for amplitude and phase\ngains for each antenna and polarization mode by inferring the temporal\ncorrelation of the gain solutions. We use Stokes I data of M87 taken with the\nVery Long Baseline Array (VLBA) at 43GHz, pre-calibrated using the rPICARD\nCASA-based pipeline. For antenna-based gain calibration and imaging, we use the\nBayesian imaging software resolve. To estimate gain and image uncertainties, we\nuse a Variational Inference method. We obtain a high-resolution M87 Stokes I\nimage at 43GHz in conjunction with antenna-based gain solutions using our\nBayesian self-calibration and imaging method. The core with counter-jet\nstructure is better resolved, and extended jet emission is better described\ncompared to the CLEAN reconstruction. Furthermore, uncertainty estimation of\nthe image and antenna-based gains allows us to quantify the reliability of the\nresult. Our Bayesian self-calibration and imaging method is able to reconstruct\nrobust and reproducible Stokes I images and gain solutions with uncertainty\nestimation by taking into account the uncertainty information in the data.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}