{"id":"2407.14703","title":"Generalizing and transporting causal inferences from randomized trials\n  in the presence of trial engagement effects","authors":"Lawson Ung, Tyler J. VanderWeele, and Issa J. Dahabreh","authorsParsed":[["Ung","Lawson",""],["VanderWeele","Tyler J.",""],["Dahabreh","Issa J.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 23:36:01 GMT"}],"updateDate":"2024-07-23","timestamp":1721432161000,"abstract":"  Trial engagement effects are effects of trial participation on the outcome\nthat are not mediated by treatment assignment. Most work on extending\n(generalizing or transporting) causal inferences from a randomized trial to a\ntarget population has, explicitly or implicitly, assumed that trial engagement\neffects are absent, allowing evidence about the effects of the treatments\nexamined in trials to be applied to non-experimental settings. Here, we define\nnovel causal estimands and present identification results for generalizability\nand transportability analyses in the presence of trial engagement effects. Our\napproach allows for trial engagement effects under assumptions of no causal\ninteraction between trial participation and treatment assignment on the\nabsolute or relative scales. We show that under these assumptions, even in the\npresence of trial engagement effects, the trial data can be combined with\ncovariate data from the target population to identify average treatment effects\nin the context of usual care as implemented in the target population (i.e.,\noutside the experimental setting). The identifying observed data functionals\nunder these no-interaction assumptions are the same as those obtained under the\nstronger identifiability conditions that have been invoked in prior work.\nTherefore, our results suggest a new interpretation for previously proposed\ngeneralizability and transportability estimators; this interpretation may be\nuseful in analyses under causal structures where background knowledge suggests\nthat trial engagement effects are present but interactions between trial\nparticipation and treatment are negligible.\n","subjects":["Statistics/Methodology","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}