{"id":"2407.00064","title":"Constraint based Modeling according to Reference Design","authors":"Erik Heiland, Peter Hillmann, Andreas Karcher","authorsParsed":[["Heiland","Erik",""],["Hillmann","Peter",""],["Karcher","Andreas",""]],"versions":[{"version":"v1","created":"Mon, 17 Jun 2024 07:41:27 GMT"}],"updateDate":"2024-07-02","timestamp":1718610087000,"abstract":"  Reference models in form of best practices are an essential element to\nensured knowledge as design for reuse. Popular modeling approaches do not offer\nmechanisms to embed reference models in a supporting way, let alone a\nrepository of it. Therefore, it is hardly possible to profit from this\nexpertise. The problem is that the reference models are not described formally\nenough to be helpful in developing solutions. Consequently, the challenge is\nabout the process, how a user can be supported in designing dedicated solutions\nassisted by reference models. In this paper, we present a generic approach for\nthe formal description of reference models using semantic technologies and\ntheir application. Our modeling assistant allows the construction of solution\nmodels using different techniques based on reference building blocks. This\nenvironment enables the subsequent verification of the developed designs\nagainst the reference models for conformity. Therefore, our reference modeling\nassistant highlights the interdependency. The application of these techniques\ncontributes to the formalization of requirements and finally to quality\nassurance in context of maturity model. It is possible to use multiple\nreference models in context of system of system designs. The approach is\nevaluated in industrial area and it can be integrated into different modeling\nlandscapes.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Information Retrieval","Computing Research Repository/Information Theory","Computing Research Repository/Software Engineering","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}