{"id":"2407.17601","title":"When Life Gives You Lemons, Squeeze Your Way Through: Understanding\n  Citrus Avoidance Behaviour by Free-Ranging Dogs in India","authors":"Tuhin Subhra Pal, Srijaya Nandi, Rohan Sarkar, Anindita Bhadra","authorsParsed":[["Pal","Tuhin Subhra",""],["Nandi","Srijaya",""],["Sarkar","Rohan",""],["Bhadra","Anindita",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 19:16:07 GMT"}],"updateDate":"2024-07-26","timestamp":1721848567000,"abstract":"  Palatability of food is driven by multiple factors like taste, smell,\ntexture, freshness, etc. and can be very variable across species. There are\nclassic examples of local adaptations leading to speciation, driven by food\navailability. Urbanization across the world is causing rapid decline of\nbiodiversity, while also driving local adaptations in some species.\nFree-ranging dogs are an interesting example of adaptation to a human-dominated\nenvironment across varied habitats. They have co-existed with humans for\ncenturies and are a perfect model system for studying local adaptations. We\nattempted to understand a specific aspect of their scavenging behaviour in\nIndia: citrus aversion. Pet dogs are known to avoid citrus fruits and food\ncontaminated by them. In India, lemons are used widely in the cuisine, and\ndiscarded in the garbage. Hence, free-ranging dogs, that typically are\nscavengers of human leftovers, are likely to encounter lemons and\nlemon-contaminated food on a regular basis. We carried out a population level\nexperiment to test response of free-ranging dogs to chicken contaminated with\nvarious parts of lemon. The dogs avoided chicken contaminated with lemon juice\nthe most. Further, when provided with chicken dipped in three different\nconcentrations of lemon juice, the lowest concentration was most preferred. A\nsurvey confirmed that the local people use lemon in their diet extensively and\nalso discard these with the leftovers. People avoided giving citrus\ncontaminated food to their pets but did not follow the same caution for\nfree-ranging dogs. This study revealed that free-ranging dogs in West Bengal,\nIndia, are well adapted to scavenging among citrus-contaminated garbage and\nhave their own strategies to avoid the contamination as far as possible, while\nmaximizing their preferred food intake.\n","subjects":["Quantitative Biology/Other Quantitative Biology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rzqs4XYbxGsblnXX0pvK_2NBJZ40Mzf9X6pxET20z80","pdfSize":"1066038"}
