{"id":"2407.10941","title":"Benchmarking Quantum Computers: Towards a Standard Performance\n  Evaluation Approach","authors":"Arturo Acuaviva, David Aguirre, Rub\\'en Pe\\~na and Mikel Sanz","authorsParsed":[["Acuaviva","Arturo",""],["Aguirre","David",""],["Peña","Rubén",""],["Sanz","Mikel",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:39:59 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 16:27:14 GMT"}],"updateDate":"2024-07-18","timestamp":1721065199000,"abstract":"  The technological development of increasingly larger quantum processors on\ndifferent quantum platforms raises the problem of how to fairly compare their\nperformance, known as quantum benchmarking of quantum processors. This is a\nchallenge that computer scientists have already faced when comparing classical\nprocessors, leading to the development of various mathematical tools to address\nit, but also to the identification of the limits of this problem. In this work,\nwe briefly review the most important aspects of both classical processor\nbenchmarks and the metrics comprising them, providing precise definitions and\nanalyzing the quality attributes that they should exhibit. Subsequently, we\nanalyze the intrinsic properties that characterize the paradigm of quantum\ncomputing and hinder the naive transfer of strategies from classical\nbenchmarking. However, we can still leverage some of the lessons learned such\nas the quality attributes of a \\textit{good} benchmark. Additionally, we review\nsome of the most important metrics and benchmarks for quantum processors\nproposed in the literature, assessing what quality attributes they fulfill.\nFinally, we propose general guidelines for quantum benchmarking. These\nguidelines aim to pave the way for establishing a roadmap towards standardizing\nthe performance evaluation of quantum devices, ultimately leading to the\ncreation of an organization akin to the Standard Performance Evaluation\nCorporation (SPEC).\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}