{"id":"2407.09157","title":"Movie Recommendation with Poster Attention via Multi-modal Transformer\n  Feature Fusion","authors":"Linhan Xia, Yicheng Yang, Ziou Chen, Zheng Yang and Shengxin Zhu","authorsParsed":[["Xia","Linhan",""],["Yang","Yicheng",""],["Chen","Ziou",""],["Yang","Zheng",""],["Zhu","Shengxin",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 10:44:51 GMT"}],"updateDate":"2024-07-15","timestamp":1720781091000,"abstract":"  Pre-trained models learn general representations from large datsets which can\nbe fine-turned for specific tasks to significantly reduce training time.\nPre-trained models like generative pretrained transformers (GPT), bidirectional\nencoder representations from transformers (BERT), vision transfomers (ViT) have\nbecome a cornerstone of current research in machine learning. This study\nproposes a multi-modal movie recommendation system by extract features of the\nwell designed posters for each movie and the narrative text description of the\nmovie. This system uses the BERT model to extract the information of text\nmodality, the ViT model applied to extract the information of poster/image\nmodality, and the Transformer architecture for feature fusion of all modalities\nto predict users' preference. The integration of pre-trained foundational\nmodels with some smaller data sets in downstream applications capture\nmulti-modal content features in a more comprehensive manner, thereby providing\nmore accurate recommendations. The efficiency of the proof-of-concept model is\nverified by the standard benchmark problem the MovieLens 100K and 1M datasets.\nThe prediction accuracy of user ratings is enhanced in comparison to the\nbaseline algorithm, thereby demonstrating the potential of this cross-modal\nalgorithm to be applied for movie or video recommendation.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}