{"id":"2407.19859","title":"ProRuka: A highly efficient HMI algorithm for controlling a novel\n  prosthetic hand with 6-DOF using sonomyography","authors":"Vaheh Nazari, Yong-Ping Zheng","authorsParsed":[["Nazari","Vaheh",""],["Zheng","Yong-Ping",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 10:27:21 GMT"}],"updateDate":"2024-07-30","timestamp":1722248841000,"abstract":"  Sonomyography (SMG) is a novel human-machine interface that controls\nupper-limb prostheses by monitoring forearm muscle activity using ultrasonic\nimaging. SMG has been investigated for controlling upper-limb prostheses during\nthe last two decades. The results show that this method, in combination with\nartificial intelligence, can classify different hand gestures with an accuracy\nof more than 90%, making it a great alternative control system compared to\nelectromyography (EMG). However, up to now there are few reports of a system\nintegrating SMG together with a prosthesis for testing on amputee subjects to\ndemonstrate its capability in relation to daily activities. In this study, we\ndeveloped ProRuka, a novel low-cost 6-degree-of-freedom prosthetic hand\nintegrated with the control provided by a SMG system with a wearable ultrasound\nimaging probe. The classification of hand gestures using different machine\nlearning classification/regression algorithms including KNN, nearest neighbor\nregression, random forest, decision tree classifier, decision tree regression,\nsupport vector regression and support vector machine in combination with a\ntransfer learning model (VGG16) was first evaluated off-line to determine its\nreliability and precision. Additionally, the developed controlling system were\nevaluated on two amputees, in real-time experiments using a variety of hand\nfunction test kits. The results from an off-line study including ten healthy\nparticipants indicated that nine different hand motions can be classified with\na success rate of 100%. In addition, the hand function test in real time (using\n4 different hand gestures) confirmed that the designed prosthesis with the SMG\ncontrolling system can assist amputees to perform a variety of hand movements\nneeded in daily activities.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}