{"id":"2407.06122","title":"Polytropic Gas Effects in Parker's Solar Wind Model and Coronal Hole\n  Flows","authors":"B. K. Shivamoggi, L. Pohl","authorsParsed":[["Shivamoggi","B. K.",""],["Pohl","L.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 16:59:08 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 23:40:59 GMT"}],"updateDate":"2024-07-26","timestamp":1720457948000,"abstract":"  A detailed and systematic investigation of polytropic gas effects in Parker's\nsolar wind model and coronal-hole flows is given. We present a viable equation\ngoverning the acceleration of solar wind of a polytropic gas and give its exact\nanalytical and numerical solutions and deduce its asymptotic analytic\nproperties (i) near the sun, (ii) far away from the sun, (iii) near the Parker\nsonic critical point (where the wind speed is equal to the speed of sound in\nthe wind). We proceed to give a detailed and systematic investigation of\ncoronal-hole polytropic gas outflows which contribute to bulk of the solar\nwind. We will model coronal-hole outflow by considering a single radial stream\ntube and use phenomenological considerations to represent its rapidly-diverging\nflow geometry. We give analytical and numerical solutions for this outflow and\ndeduce its asymptotic analytic properties in the three flow regimes above. We\nfind that, in general, the polytropic effects cause the Parker sonic critical\npoint to move closer to the sun than that for the case with isothermal gas.\nFurthermore, the flow acceleration is found to exhibit (even for an\ninfinitesimal deviation from isothermality of the gas) a power-law behavior\nrather than an exponential-law behavior near the sun or a logarithmic-law\nbehavior far away from the sun, thus implying a certain robustness of the\npower-law behavior. The Parker sonic critical point is shown to continue to be\nof X-type, hence facilitating a smooth transition from subsonic to supersonic\nwind flow through the transonic regime. Our analytical and numerical solutions\nshow that the super-radiality of the stream tube causes the Parker sonic\ncritical point to move further down in the corona, and the gas to become more\ndiabatic (the polytropic exponent gamma drops further below 5/3), and the flow\nacceleration to be enhanced further.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}