{"id":"2407.11338","title":"Heterogeneous integration of high endurance ferroelectric and\n  piezoelectric epitaxial BaTiO$_3$ devices on Si","authors":"Asraful Haque, Harshal Jason D'Souza, Shubham Kumar Parate, Rama Satya\n  Sandilya, Srinivasan Raghavan, Pavan Nukala","authorsParsed":[["Haque","Asraful",""],["D'Souza","Harshal Jason",""],["Parate","Shubham Kumar",""],["Sandilya","Rama Satya",""],["Raghavan","Srinivasan",""],["Nukala","Pavan",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 03:08:41 GMT"}],"updateDate":"2024-07-17","timestamp":1721099321000,"abstract":"  Integrating epitaxial BaTiO$_3$ (BTO) with Si is essential for leveraging its\nferroelectric, piezoelectric, and nonlinear optical properties in\nmicroelectronics. Recently, heterogeneous integration approaches that involve\ngrowth of BTO on ideal substrates followed by transfer to a desired substrate\nshow promise of achieving excellent device-quality films. However, beyond\nsimple demonstrations of the existence of ferroelectricity, robust devices with\nhigh endurance were not yet demonstrated on Si using the latter approach. Here,\nusing a novel two-step approach to synthesize epitaxial BTO using pulsed laser\ndeposition (PLD) on water soluble Sr3Al2O7 (SAO) (on SrTiO$_3$ (STO)\nsubstrates), we demonstrate successful integration of high-quality BTO\ncapacitors on Si, with Pr of 7 uC/cm2, Ec 150 kV/cm, ferroelectric and\nelectromechanical endurance of greater than $10^6$ cycles. We further address\nthe challenge of cracking and disintegration of thicker films by first\ntransferring a large area (5 mm x 5 mm) of the templated layer of BTO (~30 nm\nthick) on the desired substrate, followed by the growth of high-quality BTO on\nthis substrate, as revealed by HRXRD and HRSTEM measurements. These templated\nSi substrates offer a versatile platform for integrating any epitaxial complex\noxides with diverse functionalities onto any inorganic substrate.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6PnMMUuSP8owyYxd_jlcyoMkXb_fOKTXVdaBUzmtZPo","pdfSize":"2106716","objectId":"0x7349fd98751af3f036e3790faca5abb72ebc2ce4940ef834533cd9ee08de372e","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
