{"id":"2407.18114","title":"Unsupervised Training of Neural Cellular Automata on Edge Devices","authors":"John Kalkhof, Amin Ranem, Anirban Mukhopadhyay","authorsParsed":[["Kalkhof","John",""],["Ranem","Amin",""],["Mukhopadhyay","Anirban",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 15:21:54 GMT"}],"updateDate":"2024-07-26","timestamp":1721920914000,"abstract":"  The disparity in access to machine learning tools for medical imaging across\ndifferent regions significantly limits the potential for universal healthcare\ninnovation, particularly in remote areas. Our research addresses this issue by\nimplementing Neural Cellular Automata (NCA) training directly on smartphones\nfor accessible X-ray lung segmentation. We confirm the practicality and\nfeasibility of deploying and training these advanced models on five Android\ndevices, improving medical diagnostics accessibility and bridging the tech\ndivide to extend machine learning benefits in medical imaging to low- and\nmiddle-income countries (LMICs). We further enhance this approach with an\nunsupervised adaptation method using the novel Variance-Weighted Segmentation\nLoss (VWSL), which efficiently learns from unlabeled data by minimizing the\nvariance from multiple NCA predictions. This strategy notably improves model\nadaptability and performance across diverse medical imaging contexts without\nthe need for extensive computational resources or labeled datasets, effectively\nlowering the participation threshold. Our methodology, tested on three\nmultisite X-ray datasets -- Padchest, ChestX-ray8, and MIMIC-III --\ndemonstrates improvements in segmentation Dice accuracy by 0.7 to 2.8%,\ncompared to the classic Med-NCA. Additionally, in extreme cases where no\ndigital copy is available and images must be captured by a phone from an X-ray\nlightbox or monitor, VWSL enhances Dice accuracy by 5-20%, demonstrating the\nmethod's robustness even with suboptimal image sources.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3xsjlFODA9O5ZETaottW29EqvDfyb3P5xW0LSwwqgds","pdfSize":"3492904","objectId":"0x3b876da8096db8704cb872eeddee15f110b0e04e7a6e6159ea08f06a91772f46","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
