{"id":"2407.00304","title":"A Review of Safe Reinforcement Learning Methods for Modern Power Systems","authors":"Tong Su, Tong Wu, Junbo Zhao, Anna Scaglione, Le Xie","authorsParsed":[["Su","Tong",""],["Wu","Tong",""],["Zhao","Junbo",""],["Scaglione","Anna",""],["Xie","Le",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 03:59:06 GMT"}],"updateDate":"2024-07-02","timestamp":1719633546000,"abstract":"  Due to the availability of more comprehensive measurement data in modern\npower systems, there has been significant interest in developing and applying\nreinforcement learning (RL) methods for operation and control. Conventional RL\ntraining is based on trial-and-error and reward feedback interaction with\neither a model-based simulated environment or a data-driven and model-free\nsimulation environment. These methods often lead to the exploration of actions\nin unsafe regions of operation and, after training, the execution of unsafe\nactions when the RL policies are deployed in real power systems. A large body\nof literature has proposed safe RL strategies to prevent unsafe training\npolicies. In power systems, safe RL represents a class of RL algorithms that\ncan ensure or promote the safety of power system operations by executing safe\nactions while optimizing the objective function. While different papers handle\nthe safety constraints differently, the overarching goal of safe RL methods is\nto determine how to train policies to satisfy safety constraints while\nmaximizing rewards. This paper provides a comprehensive review of safe RL\ntechniques and their applications in different power system operations and\ncontrol, including optimal power generation dispatch, voltage control,\nstability control, electric vehicle (EV) charging control, buildings' energy\nmanagement, electricity market, system restoration, and unit commitment and\nreserve scheduling. Additionally, the paper discusses benchmarks, challenges,\nand future directions for safe RL research in power systems.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}