{"id":"2407.21503","title":"Root Cause Analysis Of Productivity Losses In Manufacturing Systems\n  Utilizing Ensemble Machine Learning","authors":"Jonas Gram, Brandon K. Sai, Thomas Bauernhansl","authorsParsed":[["Gram","Jonas",""],["Sai","Brandon K.",""],["Bauernhansl","Thomas",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 10:21:20 GMT"}],"updateDate":"2024-08-01","timestamp":1722421280000,"abstract":"  In today's rapidly evolving landscape of automation and manufacturing\nsystems, the efficient resolution of productivity losses is paramount. This\nstudy introduces a data-driven ensemble approach, utilizing the cyclic\nmultivariate time series data from binary sensors and signals from Programmable\nLogic Controllers (PLCs) within these systems. The objective is to\nautomatically analyze productivity losses per cycle and pinpoint their root\ncauses by assigning the loss to a system element. The ensemble approach\nintroduced in this publication integrates various methods, including\ninformation theory and machine learning behavior models, to provide a robust\nanalysis for each production cycle. To expedite the resolution of productivity\nlosses and ensure short response times, stream processing becomes a necessity.\nAddressing this, the approach is implemented as data-stream analysis and can be\ntransferred to batch processing, seamlessly integrating into existing systems\nwithout the need for extensive historical data analysis. This method has two\npositive effects. Firstly, the result of the analysis ensures that the period\nof lower productivity is reduced by identifying the likely root cause of the\nproductivity loss. Secondly, these results are more reliable due to the\nensemble approach and therefore avoid dependency on technical experts. The\napproach is validated using a semi-automated welding manufacturing system, an\ninjection molding automation system, and a synthetically generated test PLC\ndataset. The results demonstrate the method's efficacy in offering a\ndata-driven understanding of process behavior and mark an advancement in\nautonomous manufacturing system analysis.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZuF9f3REBpiB70cVX1KvYiSEfwEy5rqWL_Stp3FrYus","pdfSize":"4119136","objectId":"0x6c417274ec6612e777fcab1c44b338bcfda6fc938c6bdaad3e2a60b074e207f6","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
