{"id":"2407.14892","title":"Latent Pollution Model: The Hidden Carbon Footprint in 3D Image\n  Synthesis","authors":"Marvin Seyfarth, Salman Ul Hassan Dar, Sandy Engelhardt","authorsParsed":[["Seyfarth","Marvin",""],["Dar","Salman Ul Hassan",""],["Engelhardt","Sandy",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 14:44:44 GMT"}],"updateDate":"2024-07-23","timestamp":1721486684000,"abstract":"  Contemporary developments in generative AI are rapidly transforming the field\nof medical AI. These developments have been predominantly driven by the\navailability of large datasets and high computing power, which have facilitated\na significant increase in model capacity. Despite their considerable potential,\nthese models demand substantially high power, leading to high carbon dioxide\n(CO2) emissions. Given the harm such models are causing to the environment,\nthere has been little focus on the carbon footprints of such models. This study\nanalyzes carbon emissions from 2D and 3D latent diffusion models (LDMs) during\ntraining and data generation phases, revealing a surprising finding: the\nsynthesis of large images contributes most significantly to these emissions. We\nassess different scenarios including model sizes, image dimensions, distributed\ntraining, and data generation steps. Our findings reveal substantial carbon\nemissions from these models, with training 2D and 3D models comparable to\ndriving a car for 10 km and 90 km, respectively. The process of data generation\nis even more significant, with CO2 emissions equivalent to driving 160 km for\n2D models and driving for up to 3345 km for 3D synthesis. Additionally, we\nfound that the location of the experiment can increase carbon emissions by up\nto 94 times, and even the time of year can influence emissions by up to 50%.\nThese figures are alarming, considering they represent only a single training\nand data generation phase for each model. Our results emphasize the urgent need\nfor developing environmentally sustainable strategies in generative AI.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}