{"id":"2407.17834","title":"Towards the Spectral bias Alleviation by Normalizations in Coordinate\n  Networks","authors":"Zhicheng Cai, Hao Zhu, Qiu Shen, Xinran Wang, Xun Cao","authorsParsed":[["Cai","Zhicheng",""],["Zhu","Hao",""],["Shen","Qiu",""],["Wang","Xinran",""],["Cao","Xun",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 07:45:28 GMT"}],"updateDate":"2024-07-26","timestamp":1721893528000,"abstract":"  Representing signals using coordinate networks dominates the area of inverse\nproblems recently, and is widely applied in various scientific computing tasks.\nStill, there exists an issue of spectral bias in coordinate networks, limiting\nthe capacity to learn high-frequency components. This problem is caused by the\npathological distribution of the neural tangent kernel's (NTK's) eigenvalues of\ncoordinate networks. We find that, this pathological distribution could be\nimproved using classical normalization techniques (batch normalization and\nlayer normalization), which are commonly used in convolutional neural networks\nbut rarely used in coordinate networks. We prove that normalization techniques\ngreatly reduces the maximum and variance of NTK's eigenvalues while slightly\nmodifies the mean value, considering the max eigenvalue is much larger than the\nmost, this variance change results in a shift of eigenvalues' distribution from\na lower one to a higher one, therefore the spectral bias could be alleviated.\nFurthermore, we propose two new normalization techniques by combining these two\ntechniques in different ways. The efficacy of these normalization techniques is\nsubstantiated by the significant improvements and new state-of-the-arts\nachieved by applying normalization-based coordinate networks to various tasks,\nincluding the image compression, computed tomography reconstruction, shape\nrepresentation, magnetic resonance imaging, novel view synthesis and multi-view\nstereo reconstruction.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}