{"id":"2407.03457","title":"Physics-informed motion registration of lung parenchyma across static CT\n  images","authors":"Sunder Neelakantan, Tanmay Mukherjee, Kyle J. Myers, Rahim Rizi, Reza\n  Avazmohammadi","authorsParsed":[["Neelakantan","Sunder",""],["Mukherjee","Tanmay",""],["Myers","Kyle J.",""],["Rizi","Rahim",""],["Avazmohammadi","Reza",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 19:03:21 GMT"}],"updateDate":"2024-07-08","timestamp":1720033401000,"abstract":"  Lung injuries, such as ventilator-induced lung injury and radiation-induced\nlung injury, can lead to heterogeneous alterations in the biomechanical\nbehavior of the lungs. While imaging methods, e.g., X-ray and static computed\ntomography (CT), can point to regional alterations in lung structure between\nhealthy and diseased tissue, they fall short of delineating timewise kinematic\nvariations between the former and the latter. Image registration has gained\nrecent interest as a tool to estimate the displacement experienced by the lungs\nduring respiration via regional deformation metrics such as volumetric\nexpansion and distortion. However, successful image registration commonly\nrelies on a temporal series of image stacks with small displacements in the\nlungs across succeeding image stacks, which remains limited in static imaging.\nIn this study, we have presented a finite element (FE) method to estimate\nstrains from static images acquired at the end-expiration (EE) and\nend-inspiration (EI) timepoints, i.e., images with a large deformation between\nthe two distant timepoints. Physiologically realistic loads were applied to the\ngeometry obtained at EE to deform this geometry to match the geometry obtained\nat EI. The results indicated that the simulation could minimize the error\nbetween the two geometries. Using four-dimensional (4D) dynamic CT in a rat,\nthe strain at an isolated transverse plane estimated by our method showed\nsufficient agreement with that estimated through non-rigid image registration\nthat used all the timepoints. Through the proposed method, we can estimate the\nlung deformation at any timepoint between EE and EI. The proposed method offers\na tool to estimate timewise regional deformation in the lungs using only static\nimages acquired at EE and EI.\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}