{"id":"2407.10213","title":"Spatio-temporal breather dynamics in microcomb soliton crystals","authors":"Futai Hu, Abhinav Kumar Vinod, Wenting Wang, Hsiao-Hsuan Chin, James\n  F. McMillan, Ziyu Zhan, Yuan Meng, Mali Gong, and Chee Wei Wong","authorsParsed":[["Hu","Futai",""],["Vinod","Abhinav Kumar",""],["Wang","Wenting",""],["Chin","Hsiao-Hsuan",""],["McMillan","James F.",""],["Zhan","Ziyu",""],["Meng","Yuan",""],["Gong","Mali",""],["Wong","Chee Wei",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 14:14:08 GMT"}],"updateDate":"2024-07-16","timestamp":1720966448000,"abstract":"  Solitons, the distinct balance between nonlinearity and dispersion, provide a\nroute toward ultrafast electromagnetic pulse shaping, high-harmonic generation,\nreal-time image processing, and RF photonic communications. Here we newly\nexplore and observe the spatio-temporal breather dynamics of optical soliton\ncrystals in frequency microcombs, examining spatial breathers, chaos\ntransitions, and dynamical deterministic switching in nonlinear measurements\nand theory. To understand the breather solitons, we describe their dynamical\nroutes and two example transitional maps of the ensemble spatial breathers,\nwith and without chaos initiation. We elucidate the physical mechanisms of the\nbreather dynamics in the soliton crystal microcombs, in the interaction plane\nlimit cycles and in the domain-wall understanding with parity symmetry breaking\nfrom third order dispersion. We present maps of the accessible nonlinear\nregions, the breather frequency dependences on third order dispersion and\navoided mode crossing strengths, and the transition between the collective\nbreather spatiotemporal states. Our range of measurements matches well with our\nfirst-principles theory and nonlinear modeling. To image these soliton\nensembles and their breathers, we further constructed panoramic temporal\nimaging for simultaneous fast and slow axis two dimensional mapping of the\nbreathers. In the phase differential sampling, we present two dimensional\nevolution maps of soliton crystal breathers, including with defects, in both\nstable breathers and breathers with drift. Our fundamental studies contribute\nto the understanding of nonlinear dynamics in soliton crystal complexes, their\nspatiotemporal dependences, and their stability-existence zones.\n","subjects":["Nonlinear Sciences/Pattern Formation and Solitons","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}