{"id":"2407.19692","title":"High-Order Fusion Graph Contrastive Learning for Recommendation","authors":"Yu Zhang, Lei Sang, Yi Zhang, Yiwen Zhang","authorsParsed":[["Zhang","Yu",""],["Sang","Lei",""],["Zhang","Yi",""],["Zhang","Yiwen",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 04:30:38 GMT"}],"updateDate":"2024-07-30","timestamp":1722227438000,"abstract":"  Self-supervised learning (SSL) has recently attracted significant attention\nin the field of recommender systems. Contrastive learning (CL) stands out as a\nmajor SSL paradigm due to its robust ability to generate self-supervised\nsignals. Mainstream graph contrastive learning (GCL)-based methods typically\nimplement CL by creating contrastive views through various data augmentation\ntechniques. Despite these methods are effective, we argue that there still\nexist several challenges: i) Data augmentation (e.g., discarding edges or\nadding noise) necessitates additional graph convolution (GCN) or modeling\noperations, which are highly time-consuming and potentially harm the embedding\nquality. ii) Existing CL-based methods use traditional CL objectives to capture\nself-supervised signals. However, few studies have explored obtaining CL\nobjectives from more perspectives and have attempted to fuse the varying\nsignals from these CL objectives to enhance recommendation performance.\n  To overcome these challenges, we propose a High-Order Fusion Graph\nContrastive Learning (HFGCL) framework for recommendation. Specifically, we\ndiscards the data augmentations and instead high-order information from GCN\nprocess to create contrastive views. Additionally, to integrate self-supervised\nsignals from various CL objectives, we propose an advanced CL objective. By\nensuring that positive pairs are distanced from negative samples derived from\nboth contrastive views, we effectively fuse self-supervised signals from\ndistinct CL objectives, thereby enhancing the mutual information between\npositive pairs. Experimental results on three public datasets demonstrate the\nsuperior effectiveness of HFGCL compared to the state-of-the-art baselines.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}