{"id":"2407.16345","title":"Approximate real-time evolution operator for potential with one\n  ancillary qubit and application to first-quantized Hamiltonian simulation","authors":"Xinchi Huang, Taichi Kosugi, Hirofumi Nishi, Yu-ichiro Matsushita","authorsParsed":[["Huang","Xinchi",""],["Kosugi","Taichi",""],["Nishi","Hirofumi",""],["Matsushita","Yu-ichiro",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 09:47:47 GMT"}],"updateDate":"2024-07-24","timestamp":1721728067000,"abstract":"  In this article, we compare the methods implementing the real-time evolution\noperator generated by a unitary diagonal matrix where its entries obey a known\nunderlying real function. When the size of the unitary diagonal matrix is\nsmall, a well-known method based on Walsh operators gives a good and precise\nimplementation. In contrast, as the number of qubits grows, the precise one\nuses exponentially increasing resources, and we need an efficient\nimplementation based on suitable approximate functions. Using piecewise\npolynomial approximation of the function, we summarize the methods with\ndifferent polynomial degrees. Moreover, we obtain the overheads of gate count\nfor different methods concerning the error bound and grid parameter (number of\nqubits). This enables us to analytically find a relatively good method as long\nas the underlying function, the error bound, and the grid parameter are given.\nThis study contributes to the problem of encoding a known function in the phase\nfactor, which plays a crucial role in many quantum algorithms/subroutines. In\nparticular, we apply our methods to implement the real-time evolution operator\nfor the potential part in the first-quantized Hamiltonian simulation and\nestimate the resources (gate count and ancillary qubits) regarding the error\nbound, which indicates that the error coming from the approximation of the\npotential function is not negligible compared to the error from the\nTrotter-Suzuki formula.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}