{"id":"2407.06162","title":"RNNs, CNNs and Transformers in Human Action Recognition: A Survey and a\n  Hybrid Model","authors":"Khaled Alomar and Halil Ibrahim Aysel and Xiaohao Cai","authorsParsed":[["Alomar","Khaled",""],["Aysel","Halil Ibrahim",""],["Cai","Xiaohao",""]],"versions":[{"version":"v1","created":"Sun, 2 Jun 2024 17:09:59 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 08:59:38 GMT"}],"updateDate":"2024-08-16","timestamp":1717348199000,"abstract":"  Human Action Recognition (HAR) encompasses the task of monitoring human\nactivities across various domains, including but not limited to medical,\neducational, entertainment, visual surveillance, video retrieval, and the\nidentification of anomalous activities. Over the past decade, the field of HAR\nhas witnessed substantial progress by leveraging Convolutional Neural Networks\n(CNNs) to effectively extract and comprehend intricate information, thereby\nenhancing the overall performance of HAR systems. Recently, the domain of\ncomputer vision has witnessed the emergence of Vision Transformers (ViTs) as a\npotent solution. The efficacy of transformer architecture has been validated\nbeyond the confines of image analysis, extending their applicability to diverse\nvideo-related tasks. Notably, within this landscape, the research community has\nshown keen interest in HAR, acknowledging its manifold utility and widespread\nadoption across various domains. This article aims to present an encompassing\nsurvey that focuses on CNNs and the evolution of Recurrent Neural Networks\n(RNNs) to ViTs given their importance in the domain of HAR. By conducting a\nthorough examination of existing literature and exploring emerging trends, this\nstudy undertakes a critical analysis and synthesis of the accumulated knowledge\nin this field. Additionally, it investigates the ongoing efforts to develop\nhybrid approaches. Following this direction, this article presents a novel\nhybrid model that seeks to integrate the inherent strengths of CNNs and ViTs.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}