{"id":"2407.01067","title":"Human-like object concept representations emerge naturally in multimodal\n  large language models","authors":"Changde Du, Kaicheng Fu, Bincheng Wen, Yi Sun, Jie Peng, Wei Wei, Ying\n  Gao, Shengpei Wang, Chuncheng Zhang, Jinpeng Li, Shuang Qiu, Le Chang, and\n  Huiguang He","authorsParsed":[["Du","Changde",""],["Fu","Kaicheng",""],["Wen","Bincheng",""],["Sun","Yi",""],["Peng","Jie",""],["Wei","Wei",""],["Gao","Ying",""],["Wang","Shengpei",""],["Zhang","Chuncheng",""],["Li","Jinpeng",""],["Qiu","Shuang",""],["Chang","Le",""],["He","Huiguang",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:17:19 GMT"}],"updateDate":"2024-07-02","timestamp":1719821839000,"abstract":"  The conceptualization and categorization of natural objects in the human mind\nhave long intrigued cognitive scientists and neuroscientists, offering crucial\ninsights into human perception and cognition. Recently, the rapid development\nof Large Language Models (LLMs) has raised the attractive question of whether\nthese models can also develop human-like object representations through\nexposure to vast amounts of linguistic and multimodal data. In this study, we\ncombined behavioral and neuroimaging analysis methods to uncover how the object\nconcept representations in LLMs correlate with those of humans. By collecting\nlarge-scale datasets of 4.7 million triplet judgments from LLM and Multimodal\nLLM (MLLM), we were able to derive low-dimensional embeddings that capture the\nunderlying similarity structure of 1,854 natural objects. The resulting\n66-dimensional embeddings were found to be highly stable and predictive, and\nexhibited semantic clustering akin to human mental representations.\nInterestingly, the interpretability of the dimensions underlying these\nembeddings suggests that LLM and MLLM have developed human-like conceptual\nrepresentations of natural objects. Further analysis demonstrated strong\nalignment between the identified model embeddings and neural activity patterns\nin many functionally defined brain ROIs (e.g., EBA, PPA, RSC and FFA). This\nprovides compelling evidence that the object representations in LLMs, while not\nidentical to those in the human, share fundamental commonalities that reflect\nkey schemas of human conceptual knowledge. This study advances our\nunderstanding of machine intelligence and informs the development of more\nhuman-like artificial cognitive systems.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"jhFzs3MlsJFIcnha24LQTyXL1rXFFBqLF089LoLB_Sk","pdfSize":"7686795"}
