{"id":"2407.21195","title":"Diffusion-Based Generation of Neural Activity from Disentangled Latent\n  Codes","authors":"Jonathan D. McCart, Andrew R. Sedler, Christopher Versteeg, Domenick\n  Mifsud, Mattia Rigotti-Thompson, Chethan Pandarinath","authorsParsed":[["McCart","Jonathan D.",""],["Sedler","Andrew R.",""],["Versteeg","Christopher",""],["Mifsud","Domenick",""],["Rigotti-Thompson","Mattia",""],["Pandarinath","Chethan",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 21:07:09 GMT"}],"updateDate":"2024-08-01","timestamp":1722373629000,"abstract":"  Recent advances in recording technology have allowed neuroscientists to\nmonitor activity from thousands of neurons simultaneously. Latent variable\nmodels are increasingly valuable for distilling these recordings into compact\nand interpretable representations. Here we propose a new approach to neural\ndata analysis that leverages advances in conditional generative modeling to\nenable the unsupervised inference of disentangled behavioral variables from\nrecorded neural activity. Our approach builds on InfoDiffusion, which augments\ndiffusion models with a set of latent variables that capture important factors\nof variation in the data. We apply our model, called Generating Neural\nObservations Conditioned on Codes with High Information (GNOCCHI), to time\nseries neural data and test its application to synthetic and biological\nrecordings of neural activity during reaching. In comparison to a VAE-based\nsequential autoencoder, GNOCCHI learns higher-quality latent spaces that are\nmore clearly structured and more disentangled with respect to key behavioral\nvariables. These properties enable accurate generation of novel samples (unseen\nbehavioral conditions) through simple linear traversal of the latent spaces\nproduced by GNOCCHI. Our work demonstrates the potential of unsupervised,\ninformation-based models for the discovery of interpretable latent spaces from\nneural data, enabling researchers to generate high-quality samples from unseen\nconditions.\n","subjects":["Computing Research Repository/Machine Learning","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Dtrldkaa7Qmki2PCDL3DmHB7WXO-jDvQCAzacygc3ic","pdfSize":"16401920"}
