{"id":"2407.01883","title":"Robust Linear Mixed Models using Hierarchical Gamma-Divergence","authors":"Shonosuke Sugasawa, Francis K. C. Hui, Alan H. Welsh","authorsParsed":[["Sugasawa","Shonosuke",""],["Hui","Francis K. C.",""],["Welsh","Alan H.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 02:05:33 GMT"}],"updateDate":"2024-07-03","timestamp":1719885933000,"abstract":"  Linear mixed models (LMMs), which typically assume normality for both the\nrandom effects and error terms, are a popular class of methods for analyzing\nlongitudinal and clustered data. However, such models can be sensitive to\noutliers, and this can lead to poor statistical results (e.g., biased inference\non model parameters and inaccurate prediction of random effects) if the data\nare contaminated. We propose a new approach to robust estimation and inference\nfor LMMs using a hierarchical gamma divergence, which offers an automated,\ndata-driven approach to downweight the effects of outliers occurring in both\nthe error, and the random effects, using normalized powered density weights.\nFor estimation and inference, we develop a computationally scalable\nminorization-maximization algorithm for the resulting objective function, along\nwith a clustered bootstrap method for uncertainty quantification and a\nHyvarinen score criterion for selecting a tuning parameter controlling the\ndegree of robustness. When the genuine and contamination mixed effects\ndistributions are sufficiently separated, then under suitable regularity\nconditions assuming the number of clusters tends to infinity, we show the\nresulting robust estimates can be asymptotically controlled even under a heavy\nlevel of (covariate-dependent) contamination. Simulation studies demonstrate\nhierarchical gamma divergence consistently outperforms several currently\navailable methods for robustifying LMMs, under a wide range of scenarios of\noutlier generation at both the response and random effects levels. We\nillustrate the proposed method using data from a multi-center AIDS cohort\nstudy, where the use of a robust LMMs using hierarchical gamma divergence\napproach produces noticeably different results compared to methods that do not\nadequately adjust for potential outlier contamination.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}