{"id":"2407.02188","title":"Structure-Aware Consensus Network on Graphs with Few Labeled Nodes","authors":"Shuaike Xu, Xiaolin Zhang, Peng Zhang, and Kun Zhan","authorsParsed":[["Xu","Shuaike",""],["Zhang","Xiaolin",""],["Zhang","Peng",""],["Zhan","Kun",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 11:46:07 GMT"}],"updateDate":"2024-07-03","timestamp":1719920767000,"abstract":"  Graph node classification with few labeled nodes presents significant\nchallenges due to limited supervision. Conventional methods often exploit the\ngraph in a transductive learning manner. They fail to effectively utilize the\nabundant unlabeled data and the structural information inherent in graphs. To\naddress these issues, we introduce a Structure-Aware Consensus Network (SACN)\nfrom three perspectives. Firstly, SACN leverages a novel structure-aware\nconsensus learning strategy between two strongly augmented views. The proposed\nstrategy can fully exploit the potentially useful information of the unlabeled\nnodes and the structural information of the entire graph. Secondly, SACN\nuniquely integrates the graph's structural information to achieve\nstrong-to-strong consensus learning, improving the utilization of unlabeled\ndata while maintaining multiview learning. Thirdly, unlike two-branch graph\nneural network-based methods, SACN is designed for multiview feature learning\nwithin a single-branch architecture. Furthermore, a class-aware pseudolabel\nselection strategy helps address class imbalance and achieve effective\nweak-to-strong supervision. Extensive experiments on three benchmark datasets\ndemonstrate SACN's superior performance in node classification tasks,\nparticularly at very low label rates, outperforming state-of-the-art methods\nwhile maintaining computational simplicity.The source code is available at\nhttps://github.com/kunzhan/SACN\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Oaxogxfvc3y8Xy1V0UcmJFW69aSXTCqe1QPkUiE8iU8","pdfSize":"3146790","objectId":"0x0c804e795fff0aeb1f9e81ee079552e4acdda4cbff356eefe7a5e17521a95a6f","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
