{"id":"2407.01968","title":"Unsettled Law: Time to Generate New Approaches?","authors":"David Atkinson and Jacob Morrison","authorsParsed":[["Atkinson","David",""],["Morrison","Jacob",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 05:51:41 GMT"}],"updateDate":"2024-07-03","timestamp":1719899501000,"abstract":"  We identify several important and unsettled legal questions with profound\nethical and societal implications arising from generative artificial\nintelligence (GenAI), focusing on its distinguishable characteristics from\ntraditional software and earlier AI models. Our key contribution is formally\nidentifying the issues that are unique to GenAI so scholars, practitioners, and\nothers can conduct more useful investigations and discussions. While\nestablished legal frameworks, many originating from the pre-digital era, are\ncurrently employed in GenAI litigation, we question their adequacy. We argue\nthat GenAI's unique attributes, including its general-purpose nature, reliance\non massive datasets, and potential for both pervasive societal benefits and\nharms, necessitate a re-evaluation of existing legal paradigms. We explore\npotential areas for legal and regulatory adaptation, highlighting key issues\naround copyright, privacy, torts, contract law, criminal law, property law, and\nthe First Amendment. Through an exploration of these multifaceted legal\nchallenges, we aim to stimulate discourse and policy considerations surrounding\nGenAI, emphasizing a proactive approach to legal and ethical frameworks. While\nwe refrain from advocating specific legal changes, we underscore the need for\npolicymakers to carefully consider the issues raised. We conclude by\nsummarizing key questions across these areas of law in a helpful table for easy\nreference.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"K3KJLEdUw9r3eFkN27XPLmLw8zey0gkbik8uHWENvYs","pdfSize":"222071"}
