{"id":"2407.01556","title":"A Taxonomy of the Biases of the Images created by Generative Artificial\n  Intelligence","authors":"Adriana Fern\\'andez de Caleya V\\'azquez, Eduardo C. Garrido-Merch\\'an","authorsParsed":[["Vázquez","Adriana Fernández de Caleya",""],["Garrido-Merchán","Eduardo C.",""]],"versions":[{"version":"v1","created":"Thu, 2 May 2024 22:01:28 GMT"}],"updateDate":"2024-07-03","timestamp":1714687288000,"abstract":"  Generative artificial intelligence models show an amazing performance\ncreating unique content automatically just by being given a prompt by the user,\nwhich is revolutionizing several fields such as marketing and design. Not only\nare there models whose generated output belongs to the text format but we also\nfind models that are able to automatically generate high quality genuine images\nand videos given a prompt. Although the performance in image creation seems\nimpressive, it is necessary to slowly assess the content that these models are\ngenerating, as the users are uploading massively this material on the internet.\nCritically, it is important to remark that generative AI are statistical models\nwhose parameter values are estimated given algorithms that maximize the\nlikelihood of the parameters given an image dataset. Consequently, if the image\ndataset is biased towards certain values for vulnerable variables such as\ngender or skin color, we might find that the generated content of these models\ncan be harmful for certain groups of people. By generating this content and\nbeing uploaded into the internet by users, these biases are perpetuating\nharmful stereotypes for vulnerable groups, polarizing social vision about, for\nexample, what beauty or disability is and means. In this work, we analyze in\ndetail how the generated content by these models can be strongly biased with\nrespect to a plethora of variables, which we organize into a new image\ngenerative AI taxonomy. We also discuss the social, political and economical\nimplications of these biases and possible ways to mitigate them.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}