{"id":"2407.13272","title":"Thermal modification of ZrCu metallic glass nanolaminates: Structure and\n  mechanical properties","authors":"Andrea Brognara, Chanwon Jung, Cristiano Poltronieri, Philippe Djemia,\n  Gerhard Dehm, Matteo Ghidelli and James P. Best","authorsParsed":[["Brognara","Andrea",""],["Jung","Chanwon",""],["Poltronieri","Cristiano",""],["Djemia","Philippe",""],["Dehm","Gerhard",""],["Ghidelli","Matteo",""],["Best","James P.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:25:47 GMT"}],"updateDate":"2024-07-19","timestamp":1721291147000,"abstract":"  The effects of thermal treatments on metallic glass nanolaminates (NLs), with\na composition of Zr$_{24}$Cu$_{76}$ and Zr$_{61}$Cu$_{39}$ and a bilayer period\nof 50 nm, were explored to control their mechanical properties through\nannealing-induced atomic structure modifications, structural relaxation, and\npartial crystallisation. Annealing treatments up to 330 {\\deg}C ($T$ < $T_g$,\nthe glass transition temperature) maintain the amorphous structure of the NLs,\nwhile inducing atomic structural relaxation, densification, and free volume\nannihilation, reducing the formation of corrugations on fracture surfaces. Atom\nprobe tomography measurements reveal that annealing at 330 {\\deg}C for 60 mins\nalso causes intermixing between layers, altering their compositions to\nZr$_{44}$Cu$_{56}$ and Zr$_{55}$Cu$_{45}$ with increased mixing enthalpy.\nMoreover, the NLs exhibit superior thermal stability against crystallisation\ncompared to their monolithic counterparts, remaining amorphous up to 420\n{\\deg}C, while the monolithic Zr$_{24}$Cu$_{76}$ and Zr$_{61}$Cu$_{39}$ films\nare crystalline at 390 {\\deg}C, as a result of chemical interdiffusion and the\nheterogeneous NL structure of delaying the onset of crystallisation. Annealing\ntreatments $T$ > $T_g$ ($\\sim$420 {\\deg}C) induce partial crystallisation,\nforming Cu-Zr-based intermetallic and Zr-oxide phases, whereas annealing $T$ <\n$T_g$ (330 {\\deg}C) retains a visible layer structure. Nanoindentation analyses\nshow a progressive increase in elastic modulus and hardness for higher\nannealing temperatures as a result of structural relaxation and likely\nnanocrystal formation, with a maximum hardness equal to 7.6 $\\pm$ 0.2 GPa\nobtained after heat treatment at 420 {\\deg}C for 60 mins and exceeding the\nrule-of-mixtures. These results highlight the potential of thermal treatments\nto tailor the structural, mechanical and thermal properties of metallic glass\nNLs.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"_-2nzYWmp6PTsaSHVia7k0ge7XxIeAJ3F3-EXFHvnFU","pdfSize":"1350061"}
