{"id":"2407.06311","title":"Dynamics of quantum turbulence in axially rotating thermal counterflow","authors":"Ritesh Dwivedi, Tom\\'a\\v{s} Dunca, Filip Novotn\\'y, Marek Tal\\'i\\v{r},\n  Ladislav Skrbek, Pavel Urban, Martin Zoba\\v{c}, Ivan Vl\\v{c}ek and Emil Varga","authorsParsed":[["Dwivedi","Ritesh",""],["Dunca","Tomáš",""],["Novotný","Filip",""],["Talíř","Marek",""],["Skrbek","Ladislav",""],["Urban","Pavel",""],["Zobač","Martin",""],["Vlček","Ivan",""],["Varga","Emil",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:20:48 GMT"}],"updateDate":"2024-07-10","timestamp":1720462848000,"abstract":"  Generation, statistically steady state, and temporal decay of axially\nrotating thermal counterflow of superfluid $^4$He (He~II) in a square channel\nis probed using the second sound attenuation technique, measuring the density\nof quantized vortex lines. The array of rectilinear quantized vortices created\nby rotation strongly affects the development of quantum turbulence. At\nrelatively slow angular velocities, the type of instability responsible for the\ndestruction of the laminar counterflow qualitatively changes: the growth of\nseed vortex loops pinned on the channel wall becomes gradually replaced by the\ngrowth due to Donnelly-Glaberson instability, which leads to rapid growth of\nhelical Kelvin waves on vortices parallel with applied counterflow. The initial\ntransient growth of vortex line density that follows the sudden start of the\ncounterflow appears self-similar, linear in dimensionless time, $\\Omega t$. We\nshow numerically that Kelvin waves of sufficiently strong amplitude reorient\nthe vortices into more flattened shapes, which grow similarly to a free vortex\nring. The observed steady state vortex line density at sufficiently high\ncounterflow velocity and its early temporal decay after the counterflow is\nswitched off is not appreciably affected by rotation. It is striking, however,\nthat although the steady state of rotating counterflow is very different from\nrotating classical grid-generated turbulence, the late temporal decay of both\ndisplays similar features: the decay exponent decreases with the rotation rate\n$\\Omega$ from -3/2 towards approximately -0.7, typical for two-dimensional\nturbulence, consistent with the transition to bidirectional cascade.\n","subjects":["Physics/Fluid Dynamics","Condensed Matter/Other Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}