{"id":"2407.14244","title":"Sliding-Reversible Bandgap Modulation in Irreversible Asymmetric\n  Multilayers","authors":"Changming Ke and Yudi Yang and Zhuang Qian and Shi Liu","authorsParsed":[["Ke","Changming",""],["Yang","Yudi",""],["Qian","Zhuang",""],["Liu","Shi",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 12:24:57 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 15:52:17 GMT"}],"updateDate":"2024-08-23","timestamp":1721391897000,"abstract":"  The electronic bandgap of a material is often fixed after fabrication. The\ncapability to realize on-demand and non-volatile control over the bandgap will\nunlock exciting opportunities for adaptive devices with enhanced\nfunctionalities and efficiency. We introduce a general design principle for\non-demand and non-volatile control of bandgap values, which utilizes reversible\nsliding-induced polarization driven by an external electric field to modulate\nthe irreversible background polarization in asymmetric two-dimensional (2D)\nmultilayers. The structural asymmetry can be conveniently achieved in\nhomobilayers of Janus monolayers and heterobilayers of nonpolar monolayers,\nmaking the design principle applicable to a broad range of 2D materials. We\ndemonstrate the versatility of this design principle using experimentally\nsynthesized Janus metal dichalcogenide (TMD) multilayers as examples. Our\nfirst-principles calculations show that the bandgap modulation can reach up to\n0.3 eV and even support a semimetal-to-semiconductor transition. By integrating\na ferroelectric monolayer represented by 1T$'''$-MoS$_2$ into a bilayer, we\nshow that the combination of intrinsic ferroelectricity and sliding\nferroelectricity leads to multi-bandgap systems coupled to multi-step\npolarization switching. The sliding-reversible bandgap modulation offers an\navenue to dynamically adjust the optical, thermal, and electronic properties of\n2D materials through mechanical and electrical stimuli.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}