{"id":"2407.13635","title":"Droplet impact and splitting behaviour on superhydrophobic wedges","authors":"Gudlavalleti V V S Vara Prasad, Parmod Kumar, Purbarun Dhar, Devranjan\n  Samanta","authorsParsed":[["Prasad","Gudlavalleti V V S Vara",""],["Kumar","Parmod",""],["Dhar","Purbarun",""],["Samanta","Devranjan",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:08:29 GMT"}],"updateDate":"2024-07-19","timestamp":1721318909000,"abstract":"  We report an extensive computational and experimental investigation of\ndroplet impact and subsequent splitting hydrodynamics on superhydrophobic\nwedges. 2D and necessary 3D simulations using the volume of fluid method,\nbacked with experimentations, have been performed to predict the droplet\nimpact, spreading, split up, retraction against sliding, and daughter droplet\nlift off events from the SH wedge. In particular, we examine how the wedge\nangle , wedge asymmetry , Weber number and normalized Bond number influence the\npost-impact dynamics. We observe that for symmetric wedges, the maximum spread\nfactor of the droplet decreases with an increase in wedge angle at a fixed We.\nAt high wedge angles, the sharp steepness of the wedge causes less contact area\nfor the droplet to spread. For the asymmetric wedges, it has been noted that\nbeta max increases with an increase in the We due to the higher inertial forces\nof the droplet against sliding. Furthermore, the increases with an increase in\nBo at a fixed We due to the dominance of the gravitational force over the\ncapillary force of the droplet. It has been also found that at the same Bo, the\nincreases with an increase in We due to the dominance of inertial forces over\nthe capillary forces. The split volume of daughter droplets during the split up\nstage for different symmetric and asymmetric wedge angles has been discussed.\nIn general, our 2D simulations agree well with the experiments for a major part\nof the droplet lifetime. Further, we have conducted a detailed 3D simulation\nbased energy budget analysis to estimate the temporal evolution of the various\nenergy components at different post impact hydrodynamic regimes.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}