{"id":"2407.08569","title":"Approaching Outside: Scaling Unsupervised 3D Object Detection from 2D\n  Scene","authors":"Ruiyang Zhang, Hu Zhang, Hang Yu, Zhedong Zheng","authorsParsed":[["Zhang","Ruiyang",""],["Zhang","Hu",""],["Yu","Hang",""],["Zheng","Zhedong",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:58:49 GMT"}],"updateDate":"2024-07-12","timestamp":1720709929000,"abstract":"  The unsupervised 3D object detection is to accurately detect objects in\nunstructured environments with no explicit supervisory signals. This task,\ngiven sparse LiDAR point clouds, often results in compromised performance for\ndetecting distant or small objects due to the inherent sparsity and limited\nspatial resolution. In this paper, we are among the early attempts to integrate\nLiDAR data with 2D images for unsupervised 3D detection and introduce a new\nmethod, dubbed LiDAR-2D Self-paced Learning (LiSe). We argue that RGB images\nserve as a valuable complement to LiDAR data, offering precise 2D localization\ncues, particularly when scarce LiDAR points are available for certain objects.\nConsidering the unique characteristics of both modalities, our framework\ndevises a self-paced learning pipeline that incorporates adaptive sampling and\nweak model aggregation strategies. The adaptive sampling strategy dynamically\ntunes the distribution of pseudo labels during training, countering the\ntendency of models to overfit easily detected samples, such as nearby and\nlarge-sized objects. By doing so, it ensures a balanced learning trajectory\nacross varying object scales and distances. The weak model aggregation\ncomponent consolidates the strengths of models trained under different pseudo\nlabel distributions, culminating in a robust and powerful final model.\nExperimental evaluations validate the efficacy of our proposed LiSe method,\nmanifesting significant improvements of +7.1% AP$_{BEV}$ and +3.4% AP$_{3D}$ on\nnuScenes, and +8.3% AP$_{BEV}$ and +7.4% AP$_{3D}$ on Lyft compared to existing\ntechniques.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}