{"id":"2407.11432","title":"Octopus: Experiences with a Hybrid Event-Driven Architecture for\n  Distributed Scientific Computing","authors":"Haochen Pan, Ryan Chard, Sicheng Zhou, Alok Kamatar, Rafael Vescovi,\n  Valerie Hayot-Sasson, Andr\\'e Bauer, Maxime Gonthier, Kyle Chard, Ian Foster","authorsParsed":[["Pan","Haochen",""],["Chard","Ryan",""],["Zhou","Sicheng",""],["Kamatar","Alok",""],["Vescovi","Rafael",""],["Hayot-Sasson","Valerie",""],["Bauer","André",""],["Gonthier","Maxime",""],["Chard","Kyle",""],["Foster","Ian",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 06:52:43 GMT"}],"updateDate":"2024-07-17","timestamp":1721112763000,"abstract":"  Scientific research increasingly relies on distributed computational\nresources, storage systems, networks, and instruments, ranging from HPC and\ncloud systems to edge devices. Event-driven architecture (EDA) benefits\napplications targeting distributed research infrastructures by enabling the\norganization, communication, processing, reliability, and security of events\ngenerated from many sources. To support the development of scientific EDA, we\nintroduce Octopus, a hybrid, cloud-to-edge event fabric designed to link many\nlocal event producers and consumers with cloud-hosted brokers. Octopus can be\nscaled to meet demand, permits the deployment of highly available Triggers for\nautomatic event processing, and enforces fine-grained access control. We\nidentify requirements in self-driving laboratories, scientific data automation,\nonline task scheduling, epidemic modeling, and dynamic workflow management use\ncases, and present results demonstrating Octopus' ability to meet those\nrequirements. Octopus supports producing and consuming events at a rate of over\n4.2 M and 9.6 M events per second, respectively, from distributed clients.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EVcQiph_u9Pz9UdsZlQnCFwhRKdqWoJojfzxS5KncQ8","pdfSize":"966392"}
