{"id":"2407.18657","title":"SWARM-SLR -- Streamlined Workflow Automation for Machine-actionable\n  Systematic Literature Reviews","authors":"Tim Wittenborg, Oliver Karras, S\\\"oren Auer","authorsParsed":[["Wittenborg","Tim",""],["Karras","Oliver",""],["Auer","Sören",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 10:46:14 GMT"}],"updateDate":"2024-07-29","timestamp":1721990774000,"abstract":"  Authoring survey or review articles still requires significant tedious manual\neffort, despite many advancements in research knowledge management having the\npotential to improve efficiency, reproducibility, and reuse. However, these\nadvancements bring forth an increasing number of approaches, tools, and\nsystems, which often cover only specific stages and lack a comprehensive\nworkflow utilizing their task-specific strengths. We propose the Streamlined\nWorkflow Automation for Machine-actionable Systematic Literature Reviews\n(SWARM-SLR) to crowdsource the improvement of SLR efficiency while maintaining\nscientific integrity in a state-of-the-art knowledge discovery and distribution\nprocess. The workflow aims to domain-independently support researchers in\ncollaboratively and sustainably managing the rising scholarly knowledge corpus.\nBy synthesizing guidelines from the literature, we have composed a set of 65\nrequirements, spanning from planning to reporting a review. Existing tools were\nassessed against these requirements and synthesized into the SWARM-SLR workflow\nprototype, a ready-for-operation software support tool. The SWARM-SLR was\nevaluated via two online surveys, which largely confirmed the validity of the\n65 requirements and situated 11 tools to the different life-cycle stages. The\nSWARM-SLR workflow was similarly evaluated and found to be supporting almost\nthe entire span of an SLR, excelling specifically in search and retrieval,\ninformation extraction, knowledge synthesis, and distribution. Our SWARM-SLR\nrequirements and workflow support tool streamlines the SLR support for\nresearchers, allowing sustainable collaboration by linking individual\nefficiency improvements to crowdsourced knowledge management. If these efforts\nare continued, we expect the increasing number of tools to be manageable and\nusable inside fully structured, (semi-)automated literature review workflows.\n","subjects":["Computing Research Repository/Digital Libraries","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_R0K0mgu7tSvktptX3CTgVuiXmhyrglD9-tXE9-1E0I","pdfSize":"2135115","objectId":"0xce107f1679600c92556708f144bbcfdcda6f68bf31067cbde0fe521c713548bf","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
