{"id":"2407.00291","title":"FMSG-JLESS Submission for DCASE 2024 Task4 on Sound Event Detection with\n  Heterogeneous Training Dataset and Potentially Missing Labels","authors":"Yang Xiao and Han Yin and Jisheng Bai and Rohan Kumar Das","authorsParsed":[["Xiao","Yang",""],["Yin","Han",""],["Bai","Jisheng",""],["Das","Rohan Kumar",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 03:11:00 GMT"}],"updateDate":"2024-07-02","timestamp":1719630660000,"abstract":"  This report presents the systems developed and submitted by Fortemedia\nSingapore (FMSG) and Joint Laboratory of Environmental Sound Sensing (JLESS)\nfor DCASE 2024 Task 4. The task focuses on recognizing event classes and their\ntime boundaries, given that multiple events can be present and may overlap in\nan audio recording. The novelty this year is a dataset with two sources, making\nit challenging to achieve good performance without knowing the source of the\naudio clips during evaluation. To address this, we propose a sound event\ndetection method using domain generalization. Our approach integrates features\nfrom bidirectional encoder representations from audio transformers and a\nconvolutional recurrent neural network. We focus on three main strategies to\nimprove our method. First, we apply mixstyle to the frequency dimension to\nadapt the mel-spectrograms from different domains. Second, we consider training\nloss of our model specific to each datasets for their corresponding classes.\nThis independent learning framework helps the model extract domain-specific\nfeatures effectively. Lastly, we use the sound event bounding boxes method for\npost-processing. Our proposed method shows superior macro-average pAUC and\npolyphonic SED score performance on the DCASE 2024 Challenge Task 4 validation\ndataset and public evaluation dataset.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Sound"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_Uwh7LmNBsxmucKuoSfXPHd4VmfcA6QFQwO4ti3unsU","pdfSize":"186002"}
