{"id":"2407.19460","title":"White Matter Geometry-Guided Score-Based Diffusion Model for Tissue\n  Microstructure Imputation in Tractography Imaging","authors":"Yui Lo, Yuqian Chen, Fan Zhang, Dongnan Liu, Leo Zekelman, Suheyla\n  Cetin-Karayumak, Yogesh Rathi, Weidong Cai, Lauren J. O'Donnell","authorsParsed":[["Lo","Yui",""],["Chen","Yuqian",""],["Zhang","Fan",""],["Liu","Dongnan",""],["Zekelman","Leo",""],["Cetin-Karayumak","Suheyla",""],["Rathi","Yogesh",""],["Cai","Weidong",""],["O'Donnell","Lauren J.",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 10:40:32 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 03:56:07 GMT"}],"updateDate":"2024-09-20","timestamp":1722163232000,"abstract":"  Parcellation of white matter tractography provides anatomical features for\ndisease prediction, anatomical tract segmentation, surgical brain mapping, and\nnon-imaging phenotype classifications. However, parcellation does not always\nreach 100\\% accuracy due to various factors, including inter-individual\nanatomical variability and the quality of neuroimaging scan data. The failure\nto identify parcels causes a problem of missing microstructure data values,\nwhich is especially challenging for downstream tasks that analyze large brain\ndatasets. In this work, we propose a novel deep-learning model to impute tissue\nmicrostructure: the White Matter Geometry-guided Diffusion (WMG-Diff) model.\nSpecifically, we first propose a deep score-based guided diffusion model to\nimpute tissue microstructure for diffusion magnetic resonance imaging (dMRI)\ntractography fiber clusters. Second, we propose a white matter atlas geometric\nrelationship-guided denoising function to guide the reverse denoising process\nat the subject-specific level. Third, we train and evaluate our model on a\nlarge dataset with 9342 subjects. Comprehensive experiments for tissue\nmicrostructure imputation and a downstream non-imaging phenotype prediction\ntask demonstrate that our proposed WMG-Diff outperforms the compared\nstate-of-the-art methods in both error and accuracy metrics. Our code will be\navailable at: https://github.com/SlicerDMRI/WMG-Diff.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}