{"id":"2407.09100","title":"Retrospective for the Dynamic Sensorium Competition for predicting\n  large-scale mouse primary visual cortex activity from videos","authors":"Polina Turishcheva, Paul G. Fahey, Michaela Vystr\\v{c}ilov\\'a, Laura\n  Hansel, Rachel Froebe, Kayla Ponder, Yongrong Qiu, Konstantin F. Willeke,\n  Mohammad Bashiri, Ruslan Baikulov, Yu Zhu, Lei Ma, Shan Yu, Tiejun Huang,\n  Bryan M. Li, Wolf De Wulf, Nina Kudryashova, Matthias H. Hennig, Nathalie L.\n  Rochefort, Arno Onken, Eric Wang, Zhiwei Ding, Andreas S. Tolias, Fabian H.\n  Sinz, Alexander S Ecker","authorsParsed":[["Turishcheva","Polina",""],["Fahey","Paul G.",""],["Vystrčilová","Michaela",""],["Hansel","Laura",""],["Froebe","Rachel",""],["Ponder","Kayla",""],["Qiu","Yongrong",""],["Willeke","Konstantin F.",""],["Bashiri","Mohammad",""],["Baikulov","Ruslan",""],["Zhu","Yu",""],["Ma","Lei",""],["Yu","Shan",""],["Huang","Tiejun",""],["Li","Bryan M.",""],["De Wulf","Wolf",""],["Kudryashova","Nina",""],["Hennig","Matthias H.",""],["Rochefort","Nathalie L.",""],["Onken","Arno",""],["Wang","Eric",""],["Ding","Zhiwei",""],["Tolias","Andreas S.",""],["Sinz","Fabian H.",""],["Ecker","Alexander S",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 09:02:10 GMT"}],"updateDate":"2024-07-15","timestamp":1720774930000,"abstract":"  Understanding how biological visual systems process information is\nchallenging because of the nonlinear relationship between visual input and\nneuronal responses. Artificial neural networks allow computational\nneuroscientists to create predictive models that connect biological and machine\nvision. Machine learning has benefited tremendously from benchmarks that\ncompare different model on the same task under standardized conditions.\nHowever, there was no standardized benchmark to identify state-of-the-art\ndynamic models of the mouse visual system. To address this gap, we established\nthe Sensorium 2023 Benchmark Competition with dynamic input, featuring a new\nlarge-scale dataset from the primary visual cortex of ten mice. This dataset\nincludes responses from 78,853 neurons to 2 hours of dynamic stimuli per\nneuron, together with the behavioral measurements such as running speed, pupil\ndilation, and eye movements. The competition ranked models in two tracks based\non predictive performance for neuronal responses on a held-out test set: one\nfocusing on predicting in-domain natural stimuli and another on\nout-of-distribution (OOD) stimuli to assess model generalization. As part of\nthe NeurIPS 2023 competition track, we received more than 160 model submissions\nfrom 22 teams. Several new architectures for predictive models were proposed,\nand the winning teams improved the previous state-of-the-art model by 50%.\nAccess to the dataset as well as the benchmarking infrastructure will remain\nonline at www.sensorium-competition.net.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"3kWCu8Mfw-frpGzdW-E0EYzi06dzUFjWV9nQHFtmS9Y","pdfSize":"2779292"}
