{"id":"2407.02502","title":"Impact of an Autonomous Shuttle Service on Urban Road Capacity:\n  Experiments by Microscopic Traffic Simulation","authors":"Sudipta Roy, Bat-hen Nahmias-Biran, and Samiul Hasan","authorsParsed":[["Roy","Sudipta",""],["Nahmias-Biran","Bat-hen",""],["Hasan","Samiul",""]],"versions":[{"version":"v1","created":"Tue, 11 Jun 2024 20:22:50 GMT"}],"updateDate":"2024-07-04","timestamp":1718137370000,"abstract":"  Autonomous vehicles are expected to transform transportation systems with\nrapid technological advancement. Human mobility would become more accessible\nand safer with the emergence of driverless vehicles. To this end, autonomous\nshuttle services are currently introduced in different urban conditions\nthroughout the world. As a result, studies are needed to assess the safety and\nmobility performance of such autonomous shuttle services. However, calibrating\nthe movement of autonomous shuttles in a simulation environment has been a\ndifficult task due to the absence of any real-world data. This study aims to\ncalibrate autonomous shuttles in a microscopic traffic simulation model and\nconsequently assess the impact of the shuttle service on urban road capacity\nthrough simulation experiments. For this analysis, a prototype of an\noperational shuttle system at Lake Nona, Orlando, Florida is emulated in a\nmicroscopic traffic simulator during different times of the day. The movements\nof autonomous vehicles are calibrated using real-world trajectory data which\nhelp replicate the driving behavior of the shuttle in the simulation. The\nanalysis reveals that with increasing frequency of the shuttle service the\ndelay time percentage of the shared road sections increases and traveling speed\ndecreases. It is also found that increasing the speed of shuttles up to 5 mph\nduring off-peak hours and 10 mph during peak hours will improve traffic\nconditions. The findings from this study will assist policymakers and\ntransportation agencies to revise policies for deploying autonomous shuttles\nand for planning road infrastructures for shared road-use of autonomous\nshuttles and human driven vehicles.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rdjBcndelvsCKA2Hw7xU9nmuNXahOsoUD2FK3tWAVfY","pdfSize":"770311"}
