{"id":"2407.13830","title":"Non-native Quantum Generative Optimization with Adversarial Autoencoders","authors":"Blake A. Wilson, Jonathan Wurtz, Vahagn Mkhitaryan, Michael Bezick,\n  Sheng-Tao Wang, Sabre Kais, Vladimir M. Shalaev, and Alexandra Boltasseva","authorsParsed":[["Wilson","Blake A.",""],["Wurtz","Jonathan",""],["Mkhitaryan","Vahagn",""],["Bezick","Michael",""],["Wang","Sheng-Tao",""],["Kais","Sabre",""],["Shalaev","Vladimir M.",""],["Boltasseva","Alexandra",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 18:03:18 GMT"}],"updateDate":"2024-07-22","timestamp":1721325798000,"abstract":"  Large-scale optimization problems are prevalent in several fields, including\nengineering, finance, and logistics. However, most optimization problems cannot\nbe efficiently encoded onto a physical system because the existing quantum\nsamplers have too few qubits. Another typical limiting factor is that the\noptimization constraints are not compatible with the native cost Hamiltonian.\nThis work presents a new approach to address these challenges. We introduce the\nadversarial quantum autoencoder model (AQAM) that can be used to map\nlarge-scale optimization problems onto existing quantum samplers while\nsimultaneously optimizing the problem through latent quantum-enhanced Boltzmann\nsampling. We demonstrate the AQAM on a neutral atom sampler, and showcase the\nmodel by optimizing 64px by 64px unit cells that represent a broad-angle filter\nmetasurface applicable to improving the coherence of neutral atom devices.\nUsing 12-atom simulations, we demonstrate that the AQAM achieves a lower Renyi\ndivergence and a larger spectral gap when compared to classical Markov Chain\nMonte Carlo samplers. Our work paves the way to more efficient mapping of\nconventional optimization problems into existing quantum samplers.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}