{"id":"2407.11534","title":"LRQ: Optimizing Post-Training Quantization for Large Language Models by\n  Learning Low-Rank Weight-Scaling Matrices","authors":"Jung Hyun Lee, Jeonghoon Kim, June Yong Yang, Se Jung Kwon, Eunho\n  Yang, Kang Min Yoo, Dongsoo Lee","authorsParsed":[["Lee","Jung Hyun",""],["Kim","Jeonghoon",""],["Yang","June Yong",""],["Kwon","Se Jung",""],["Yang","Eunho",""],["Yoo","Kang Min",""],["Lee","Dongsoo",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 09:32:07 GMT"}],"updateDate":"2024-07-17","timestamp":1721122327000,"abstract":"  With the commercialization of large language models (LLMs), weight-activation\nquantization has emerged to compress and accelerate LLMs, achieving high\nthroughput while reducing inference costs. However, existing post-training\nquantization (PTQ) techniques for quantizing weights and activations of LLMs\nstill suffer from non-negligible accuracy drops, especially on massive\nmultitask language understanding. To address this issue, we propose Low-Rank\nQuantization (LRQ) $-$ a simple yet effective post-training weight quantization\nmethod for LLMs that reconstructs the outputs of an intermediate Transformer\nblock by leveraging low-rank weight-scaling matrices, replacing the\nconventional full weight-scaling matrices that entail as many learnable scales\nas their associated weights. Thanks to parameter sharing via low-rank\nstructure, LRQ only needs to learn significantly fewer parameters while\nenabling the individual scaling of weights, thus boosting the generalization\ncapability of quantized LLMs. We show the superiority of LRQ over prior LLM PTQ\nworks under (i) $8$-bit weight and per-tensor activation quantization, (ii)\n$4$-bit weight and $8$-bit per-token activation quantization, and (iii) low-bit\nweight-only quantization schemes. Our code is available at\n\\url{https://github.com/onliwad101/FlexRound_LRQ} to inspire LLM researchers\nand engineers.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}