{"id":"2407.08874","title":"Implications of mappings between ICD clinical diagnosis codes and Human\n  Phenotype Ontology terms","authors":"Amelia LM Tan, Rafael S Gon\\c{c}alves, William Yuan, Gabriel A Brat,\n  The Consortium for Clinical Characterization of COVID-19 by EHR (4CE), Robert\n  Gentleman, Isaac S Kohane","authorsParsed":[["Tan","Amelia LM","","4CE"],["Gonçalves","Rafael S","","4CE"],["Yuan","William","","4CE"],["Brat","Gabriel A","","4CE"],["EHR","The Consortium for Clinical Characterization of COVID-19 by","","4CE"],["Gentleman","Robert",""],["Kohane","Isaac S",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 21:17:12 GMT"}],"updateDate":"2024-07-15","timestamp":1720732632000,"abstract":"  Objective: Integrating EHR data with other resources is essential in rare\ndisease research due to low disease prevalence. Such integration is dependent\non the alignment of ontologies used for data annotation. The International\nClassification of Diseases (ICD) is used to annotate clinical diagnoses; the\nHuman Phenotype Ontology (HPO) to annotate phenotypes. Although these\nontologies overlap in biomedical entities described, the extent to which they\nare interoperable is unknown. We investigate how well aligned these ontologies\nare and whether such alignments facilitate EHR data integration.\n  Materials and Methods: We conducted an empirical analysis of the coverage of\nmappings between ICD and HPO. We interpret this mapping coverage as a proxy for\nhow easily clinical data can be integrated with research ontologies such as\nHPO. We quantify how exhaustively ICD codes are mapped to HPO by analyzing\nmappings in the UMLS Metathesaurus. We analyze the proportion of ICD codes\nmapped to HPO within a real-world EHR dataset.\n  Results and Discussion: Our analysis revealed that only 2.2% of ICD codes\nhave direct mappings to HPO in UMLS. Within our EHR dataset, less than 50% of\nICD codes have mappings to HPO terms. ICD codes that are used frequently in EHR\ndata tend to have mappings to HPO; ICD codes that represent rarer medical\nconditions are seldom mapped.\n  Conclusion: We find that interoperability between ICD and HPO via UMLS is\nlimited. While other mapping sources could be incorporated, there are no\nestablished conventions for what resources should be used to complement UMLS.\n","subjects":["Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"58JUXhX94jBBGkN2ebSPzU7jMeKi_6Jy760XCrLGVck","pdfSize":"647200"}
