{"id":"2407.03043","title":"SlerpFace: Face Template Protection via Spherical Linear Interpolation","authors":"Zhizhou Zhong, Yuxi Mi, Yuge Huang, Jianqing Xu, Guodong Mu, Shouhong\n  Ding, Jingyun Zhang, Rizen Guo, Yunsheng Wu, and Shuigeng Zhou","authorsParsed":[["Zhong","Zhizhou",""],["Mi","Yuxi",""],["Huang","Yuge",""],["Xu","Jianqing",""],["Mu","Guodong",""],["Ding","Shouhong",""],["Zhang","Jingyun",""],["Guo","Rizen",""],["Wu","Yunsheng",""],["Zhou","Shuigeng",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 12:07:36 GMT"}],"updateDate":"2024-07-04","timestamp":1720008456000,"abstract":"  Contemporary face recognition systems use feature templates extracted from\nface images to identify persons. To enhance privacy, face template protection\ntechniques are widely employed to conceal sensitive identity and appearance\ninformation stored in the template. This paper identifies an emerging privacy\nattack form utilizing diffusion models that could nullify prior protection,\nreferred to as inversion attacks. The attack can synthesize high-quality,\nidentity-preserving face images from templates, revealing persons' appearance.\nBased on studies of the diffusion model's generative capability, this paper\nproposes a defense to deteriorate the attack, by rotating templates to a\nnoise-like distribution. This is achieved efficiently by spherically and\nlinearly interpolating templates, or slerp, on their located hypersphere. This\npaper further proposes to group-wisely divide and drop out templates' feature\ndimensions, to enhance the irreversibility of rotated templates. The division\nof groups and dropouts within each group are learned in a recognition-favored\nway. The proposed techniques are concretized as a novel face template\nprotection technique, SlerpFace. Extensive experiments show that SlerpFace\nprovides satisfactory recognition accuracy and comprehensive privacy protection\nagainst inversion and other attack forms, superior to prior arts.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}