{"id":"2407.19728","title":"PersonalityScanner: Exploring the Validity of Personality Assessment\n  Based on Multimodal Signals in Virtual Reality","authors":"Xintong Zhang, Di Lu, Huiqi Hu, Nan Jiang, Xianhao Yu, Jinan Xu, Yujia\n  Peng, Qing Li, Wenjuan Han","authorsParsed":[["Zhang","Xintong",""],["Lu","Di",""],["Hu","Huiqi",""],["Jiang","Nan",""],["Yu","Xianhao",""],["Xu","Jinan",""],["Peng","Yujia",""],["Li","Qing",""],["Han","Wenjuan",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 06:17:41 GMT"}],"updateDate":"2024-07-30","timestamp":1722233861000,"abstract":"  Human cognition significantly influences expressed behavior and is\nintrinsically tied to authentic personality traits. Personality assessment\nplays a pivotal role in various fields, including psychology, education, social\nmedia, etc. However, traditional self-report questionnaires can only provide\ndata based on what individuals are willing and able to disclose, thereby\nlacking objective. Moreover, automated measurements and peer assessments demand\nsignificant human effort and resources. In this paper, given the advantages of\nthe Virtual Reality (VR) technique, we develop a VR simulator --\nPersonalityScanner, to stimulate cognitive processes and simulate daily\nbehaviors based on an immersive and interactive simulation environment, in\nwhich participants carry out a battery of engaging tasks that formulate a\nnatural story of first-day at work. Through this simulator, we collect a\nsynchronous multi-modal dataset with ten modalities, including\nfirst/third-person video, audio, text, eye tracking, facial microexpression,\npose, depth data, log, and inertial measurement unit. By systematically\nexamining the contributions of different modalities on revealing personality,\nwe demonstrate the superior performance and effectiveness of\nPersonalityScanner.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}