{"id":"2407.00102","title":"Curriculum Learning with Quality-Driven Data Selection","authors":"Biao Wu, Fang Meng, Ling Chen","authorsParsed":[["Wu","Biao",""],["Meng","Fang",""],["Chen","Ling",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 07:20:36 GMT"}],"updateDate":"2024-07-02","timestamp":1719472836000,"abstract":"  The impressive multimodal capabilities demonstrated by OpenAI's GPT-4 have\ngenerated significant interest in the development of Multimodal Large Language\nModels (MLLMs). Visual instruction tuning of MLLMs with machine-generated\ninstruction-following data has shown to enhance zero-shot capabilities across\nvarious tasks. However, there has been limited exploration into controlling the\nquality of the instruction data.Current methodologies for data selection in\nMLLMs often rely on single, unreliable scores or use downstream tasks for\nselection, which is time-consuming and can lead to potential overfitting on the\nchosen evaluation datasets. To mitigate these limitations, we propose a novel\ndata selection methodology that utilizes image-text correlation and model\nperplexity to evaluate and select data of varying quality. This approach\nleverages the distinct distribution of these two attributes, mapping data\nquality into a two-dimensional space that allows for the selection of data\nbased on their location within this distribution. By utilizing this space, we\ncan analyze the impact of task type settings, used as prompts, on data quality.\nAdditionally, this space can be used to construct multi-stage subsets of\nvarying quality to facilitate curriculum learning. Our research includes\ncomprehensive experiments conducted on various datasets. The results emphasize\nsubstantial enhancements in five commonly assessed capabilities compared to\nusing the complete dataset. Our codes, data, and models are publicly available\nat: \\url{https://anonymous.4open.science/r/EHIT-31B4}\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}