{"id":"2407.09092","title":"Diagnosing quantum transport from wave function snapshots","authors":"Devendra Singh Bhakuni, Roberto Verdel, Cristiano Muzzi, Riccardo\n  Andreoni, Monika Aidelsburger, and Marcello Dalmonte","authorsParsed":[["Bhakuni","Devendra Singh",""],["Verdel","Roberto",""],["Muzzi","Cristiano",""],["Andreoni","Riccardo",""],["Aidelsburger","Monika",""],["Dalmonte","Marcello",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 08:40:32 GMT"}],"updateDate":"2024-07-15","timestamp":1720773632000,"abstract":"  We study nonequilibrium quantum dynamics of spin chains by employing\nprincipal component analysis (PCA) on data sets of wave function snapshots and\nexamine how information propagates within these data sets. The quantities we\nemploy are derived from the spectrum of the sample second moment matrix, built\ndirectly from data sets. Our investigations on several interacting spin chains\nfeaturing distinct spin or energy transport reveal that the growth of data\ninformation spreading follows the same dynamical exponents as that of the\nunderlying quantum transport of spin or energy. Specifically, our approach\nenables an easy, data-driven, and importantly interpretable diagnostic to track\nenergy transport with a limited number of samples, which is usually challenging\nwithout any assumption on the Hamiltonian form. These observations are obtained\nat a modest finite size and evolution time, which aligns with experimental and\nnumerical constraints. Our framework directly applies to experimental quantum\nsimulator data sets of dynamics in higher-dimensional systems, where classical\nsimulation methods usually face significant limitations and apply equally to\nboth near- and far-from-equilibrium quenches.\n","subjects":["Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Strongly Correlated Electrons","Physics/Computational Physics","Physics/Data Analysis, Statistics and Probability","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}