{"id":"2407.12352","title":"SENTAUR: Security EnhaNced Trojan Assessment Using LLMs Against\n  Undesirable Revisions","authors":"Jitendra Bhandari, Rajat Sadhukhan, Prashanth Krishnamurthy, Farshad\n  Khorrami, Ramesh Karri","authorsParsed":[["Bhandari","Jitendra",""],["Sadhukhan","Rajat",""],["Krishnamurthy","Prashanth",""],["Khorrami","Farshad",""],["Karri","Ramesh",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 07:13:06 GMT"}],"updateDate":"2024-07-18","timestamp":1721200386000,"abstract":"  A globally distributed IC supply chain brings risks due to untrusted third\nparties. The risks span inadvertent use of hardware Trojan (HT), inserted\nIntellectual Property (3P-IP) or Electronic Design Automation (EDA) flows. HT\ncan introduce stealthy HT behavior, prevent an IC work as intended, or leak\nsensitive data via side channels. To counter HTs, rapidly examining HT\nscenarios is a key requirement. While Trust-Hub benchmarks are a good starting\npoint to assess defenses, they encompass a small subset of manually created HTs\nwithin the expanse of HT designs. Further, the HTs may disappear during\nsynthesis. We propose a large language model (LLM) framework SENTAUR to\ngenerate a suite of legitimate HTs for a Register Transfer Level (RTL) design\nby learning its specifications, descriptions, and natural language descriptions\nof HT effects. Existing tools and benchmarks are limited; they need a learning\nperiod to construct an ML model to mimic the threat model and are difficult to\nreproduce. SENTAUR can swiftly produce HT instances by leveraging LLMs without\nany learning period and sanitizing the HTs facilitating their rapid assessment.\nEvaluation of SENTAUR involved generating effective, synthesizable, and\npractical HTs from TrustHub and elsewhere, investigating impacts of\npayloads/triggers at the RTL. While our evaluation focused on HT insertion,\nSENTAUR can generalize to automatically transform an RTL code to have defined\nfunctional modifications.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vIClj2Oi6FJIjYZy2XtCjNZ0JHZxc4SvZgeUswFboH8","pdfSize":"770206","objectId":"0xbe82a9d353fc2e8eb48c6cda5d89089e7f3366ccaa0d9993210f98515a9cecd3","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
