{"id":"2407.20399","title":"Analysis and Improvement of Rank-Ordered Mean Algorithm in Single-Photon\n  LiDAR","authors":"William C. Yau, Weijian Zhang, Hashan Kavinga Weerasooriya, Stanley H.\n  Chan","authorsParsed":[["Yau","William C.",""],["Zhang","Weijian",""],["Weerasooriya","Hashan Kavinga",""],["Chan","Stanley H.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 19:50:44 GMT"}],"updateDate":"2024-07-31","timestamp":1722282644000,"abstract":"  Depth estimation using a single-photon LiDAR is often solved by a matched\nfilter. It is, however, error-prone in the presence of background noise. A\ncommonly used technique to reject background noise is the rank-ordered mean\n(ROM) filter previously reported by Shin \\textit{et al.} (2015). ROM rejects\nnoisy photon arrival timestamps by selecting only a small range of them around\nthe median statistics within its local neighborhood. Despite the promising\nperformance of ROM, its theoretical performance limit is unknown. In this\npaper, we theoretically characterize the ROM performance by showing that ROM\nfails when the reflectivity drops below a threshold predetermined by the depth\nand signal-to-background ratio, and its accuracy undergoes a phase transition\nat the cutoff. Based on our theory, we propose an improved signal extraction\ntechnique by selecting tight timestamp clusters. Experimental results show that\nthe proposed algorithm improves depth estimation performance over ROM by 3\norders of magnitude at the same signal intensities, and achieves high image\nfidelity at noise levels as high as 17 times that of signal.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"N17w8uppvEQaed7PiB0IBBybg5mJlQKEPSeCUnLRBEg","pdfSize":"1705036","objectId":"0x91e3b374c72959375cf1427624e369d372f4f27961095f936c813e1b1fc268dc","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
