{"id":"2407.01770","title":"Exploring causal effects of hormone- and radio-treatments in an\n  observational study of breast cancer using copula-based semi-competing risks\n  models","authors":"Tonghui Yu, Mengjiao Peng, Yifan Cui, Elynn Chen, Chixiang Chen","authorsParsed":[["Yu","Tonghui",""],["Peng","Mengjiao",""],["Cui","Yifan",""],["Chen","Elynn",""],["Chen","Chixiang",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 19:59:56 GMT"}],"updateDate":"2024-07-03","timestamp":1719863996000,"abstract":"  Breast cancer patients may experience relapse or death after surgery during\nthe follow-up period, leading to dependent censoring of relapse. This\nphenomenon, known as semi-competing risk, imposes challenges in analyzing\ntreatment effects on breast cancer and necessitates advanced statistical tools\nfor unbiased analysis. Despite progress in estimation and inference within\nsemi-competing risks regression, its application to causal inference is still\nin its early stages. This article aims to propose a frequentist and\nsemi-parametric framework based on copula models that can facilitate valid\ncausal inference, net quantity estimation and interpretation, and sensitivity\nanalysis for unmeasured factors under right-censored semi-competing risks data.\nWe also propose novel procedures to enhance parameter estimation and its\napplicability in real practice. After that, we apply the proposed framework to\na breast cancer study and detect the time-varying causal effects of hormone-\nand radio-treatments on patients' relapse-free survival and overall survival.\nMoreover, extensive numerical evaluations demonstrate the method's feasibility,\nhighlighting minimal estimation bias and reliable statistical inference.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"j3HC8-_feccxDT9qcy8oj60CfcCdFpjYWAlTpwvtI5w","pdfSize":"1031390","objectId":"0xa161b207337d0421c0c052586d558d13876367ab642993c087cade7d0b0f7e99","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
