{"id":"2407.12423","title":"StuGPTViz: A Visual Analytics Approach to Understand Student-ChatGPT\n  Interactions","authors":"Zixin Chen, Jiachen Wang, Meng Xia, Kento Shigyo, Dingdong Liu, Rong\n  Zhang, Huamin Qu","authorsParsed":[["Chen","Zixin",""],["Wang","Jiachen",""],["Xia","Meng",""],["Shigyo","Kento",""],["Liu","Dingdong",""],["Zhang","Rong",""],["Qu","Huamin",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 09:20:44 GMT"},{"version":"v2","created":"Sun, 21 Jul 2024 20:39:00 GMT"},{"version":"v3","created":"Tue, 17 Sep 2024 08:32:02 GMT"}],"updateDate":"2024-09-18","timestamp":1721208044000,"abstract":"  The integration of Large Language Models (LLMs), especially ChatGPT, into\neducation is poised to revolutionize students' learning experiences by\nintroducing innovative conversational learning methodologies. To empower\nstudents to fully leverage the capabilities of ChatGPT in educational\nscenarios, understanding students' interaction patterns with ChatGPT is crucial\nfor instructors. However, this endeavor is challenging due to the absence of\ndatasets focused on student-ChatGPT conversations and the complexities in\nidentifying and analyzing the evolutional interaction patterns within\nconversations. To address these challenges, we collected conversational data\nfrom 48 students interacting with ChatGPT in a master's level data\nvisualization course over one semester. We then developed a coding scheme,\ngrounded in the literature on cognitive levels and thematic analysis, to\ncategorize students' interaction patterns with ChatGPT. Furthermore, we present\na visual analytics system, StuGPTViz, that tracks and compares temporal\npatterns in student prompts and the quality of ChatGPT's responses at multiple\nscales, revealing significant pedagogical insights for instructors. We\nvalidated the system's effectiveness through expert interviews with six data\nvisualization instructors and three case studies. The results confirmed\nStuGPTViz's capacity to enhance educators' insights into the pedagogical value\nof ChatGPT. We also discussed the potential research opportunities of applying\nvisual analytics in education and developing AI-driven personalized learning\nsolutions.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}