{"id":"2407.06067","title":"Faraday laser pumped cesium beam clock","authors":"Hangbo Shi, Xiaomin Qin, Haijun Chen, Yufei Yan, Ziqi Lu, Zhiyang\n  Wang, Zijie Liu, Xiaolei Guan, Qiang Wei, Tiantian Shi, and Jingbiao Chen","authorsParsed":[["Shi","Hangbo",""],["Qin","Xiaomin",""],["Chen","Haijun",""],["Yan","Yufei",""],["Lu","Ziqi",""],["Wang","Zhiyang",""],["Liu","Zijie",""],["Guan","Xiaolei",""],["Wei","Qiang",""],["Shi","Tiantian",""],["Chen","Jingbiao",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 16:10:12 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 05:21:51 GMT"}],"updateDate":"2024-07-12","timestamp":1720455012000,"abstract":"  We realize a high-performance compact optically pumped cesium beam clock\nusing Faraday laser simultaneously as pumping and detection lasers. The Faraday\nlaser, which is frequency stabilized by modulation transfer spectroscopy (MTS)\ntechnique, has narrow linewidth and superior frequency stability. Measured by\noptical heterodyne method between two identical systems, the linewidth of the\nFaraday laser is 2.5 kHz after MTS locking, and the fractional frequency\nstability of the Faraday laser is optimized to\n$1.8\\times{10}^{-12}/\\sqrt{\\tau}$. Based on this high-performance Faraday\nlaser, the cesium beam clock realizes a signal-to-noise ratio (SNR) in 1 Hz\nbandwidth of $39600$ when the cesium oven temperature is 130{\\deg}C.\nFrequency-compared with Hydrogen maser, the fractional frequency stability of\nthe Faraday laser pumped cesium beam clock can reach\n$1.3\\times{10}^{-12}/\\sqrt{\\tau}$ and drops to $1.4\\times{10}^{-14}$ at 10000 s\nwhen the cesium oven temperature is 110{\\deg}C. %, which is the best reported\nresult compared with other cesium beam clocks. This Faraday laser pumped cesium\nbeam clock demonstrates its excellent performance, and its great potential in\nthe fields of timekeeping, navigation, and communication. Meanwhile, the\nFaraday laser, as a high-performance optical frequency standard, can also\ncontribute to the development of other applications in quantum metrology,\nprecision measurement and atomic physics.\n","subjects":["Physics/Atomic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}