{"id":"2407.03123","title":"Accelerating quantum imaginary-time evolution with random measurements","authors":"Ioannis Kolotouros, David Joseph, Anand Kumar Narayanan","authorsParsed":[["Kolotouros","Ioannis",""],["Joseph","David",""],["Narayanan","Anand Kumar",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 14:06:32 GMT"}],"updateDate":"2024-07-04","timestamp":1720015592000,"abstract":"  Quantum imaginary-time evolution (QITE) is a promising tool to prepare\nthermal or ground states of Hamiltonians, as convergence is guaranteed when the\nevolved state overlaps with the ground state. However, its implementation using\na parameterized quantum circuit is impractical as the number of parameters $m$\nincreases, since each step in the evolution takes $\\Theta(m^2)$ state\npreparations to calculate the quantum Fisher information matrix (QFIM). In this\nwork, we accelerate QITE by rapid estimation of the QFIM, while conserving the\nconvergence guarantees to the extent possible. To this end, we prove that if a\nparameterized state is rotated by a 2-design and measured in the computational\nbasis, then the QFIM can be inferred from partial derivative cross correlations\nof the probability outcomes. One sample estimate costs only $\\Theta(m)$ state\npreparations, leading to rapid QFIM estimation when a few samples suffice. The\nsecond family of estimators take greater liberties and replace QFIMs with\naveraged classical Fisher information matrices (CFIMs). In an extreme special\ncase optimized for rapid (over accurate) descent, just one CFIM sample is\ndrawn. We justify the second estimator family by proving rapid descent. Guided\nby these results, we propose the random-measurement imaginary-time evolution\n(RMITE) algorithm, which we showcase and test in several molecular systems,\nwith the goal of preparing ground states.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HXWDyxMnMgQonqAFhWos2dlrYsV9Dkoyn9M47gOe8kY","pdfSize":"943120"}
