{"id":"2407.11104","title":"Exploring the Potentials and Challenges of Deep Generative Models in\n  Product Design Conception","authors":"Phillip Mueller, Lars Mikelsons","authorsParsed":[["Mueller","Phillip",""],["Mikelsons","Lars",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 14:28:50 GMT"}],"updateDate":"2024-07-17","timestamp":1721053730000,"abstract":"  The synthesis of product design concepts stands at the crux of early-phase\ndevelopment processes for technical products, traditionally posing an intricate\ninterdisciplinary challenge. The application of deep learning methods,\nparticularly Deep Generative Models (DGMs), holds the promise of automating and\nstreamlining manual iterations and therefore introducing heightened levels of\ninnovation and efficiency. However, DGMs have yet to be widely adopted into the\nsynthesis of product design concepts. This paper aims to explore the reasons\nbehind this limited application and derive the requirements for successful\nintegration of these technologies. We systematically analyze DGM-families (VAE,\nGAN, Diffusion, Transformer, Radiance Field), assessing their strengths,\nweaknesses, and general applicability for product design conception. Our\nobjective is to provide insights that simplify the decision-making process for\nengineers, helping them determine which method might be most effective for\ntheir specific challenges. Recognizing the rapid evolution of this field, we\nhope that our analysis contributes to a fundamental understanding and guides\npractitioners towards the most promising approaches. This work seeks not only\nto illuminate current challenges but also to propose potential solutions,\nthereby offering a clear roadmap for leveraging DGMs in the realm of product\ndesign conception.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"XxLI9wJsaGFv11oJKpPdXq4LzaW5gL0NQAC5B4lSXWA","pdfSize":"1458445"}
