{"id":"2407.21409","title":"Price formation without fuel costs: the interaction of elastic demand\n  with storage bidding","authors":"Tom Brown and Fabian Neumann and Iegor Riepin","authorsParsed":[["Brown","Tom",""],["Neumann","Fabian",""],["Riepin","Iegor",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 07:57:00 GMT"}],"updateDate":"2024-08-01","timestamp":1722412620000,"abstract":"  Studies looking at electricity market designs for very high shares of wind\nand solar often conclude that the energy-only market will break down. Without\nfuel costs, it is said that there is nothing to set prices. Symptoms of\nbreakdown include long phases of zero prices, scarcity prices too high to be\npolitically acceptable, prices that collapse under small perturbations of\ncapacities from the long-term equilibrium, cost recovery that is impossible due\nto low market values, high variability of revenue between different weather\nyears, and difficulty operating long-term storage with limited foresight. We\nargue that all these problems are an artefact of modeling with perfectly\ninelastic demand. If short-term elasticity to reflect today's flexible demand\n(-5%) is implemented in the model, these problems are significantly reduced.\nThe combined interaction of demand willingness to pay and storage opportunity\ncosts is enough to produce stable pricing. This behavior is illustrated by a\nmodel with wind, solar, batteries, and hydrogen-based storage, where a\npiecewise linear demand curve removes high price peaks and reduces the fraction\nof zero-price hours from 90% to around 30%, and entails more price stability\nfor perturbations of capacity and different weather years. Furthermore, we show\nthat with elastic demand, the long-term model exactly reproduces the prices of\nthe short-term model with the same capacities. We then use insights from the\nlong-term model to derive simple bidding strategies for storage so that we can\nalso run the short-term model with limited operational foresight. We\ndemonstrate this short-term operation in a model trained on 35 years of weather\ndata and tested on another 35 years of unseen data. We conclude that the\nenergy-only market can still play a key role in coordinating dispatch and\ninvestment in the future.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yeEnuhC7v8ClkvmIFABOwQ_arrmG9bKQkJ7L4xirPI0","pdfSize":"7632724"}
