{"id":"2407.18970","title":"Region Guided Attention Network for Retinal Vessel Segmentation","authors":"Syed Javed, Tariq M. Khan, Abdul Qayyum, Arcot Sowmya, Imran Razzak","authorsParsed":[["Javed","Syed",""],["Khan","Tariq M.",""],["Qayyum","Abdul",""],["Sowmya","Arcot",""],["Razzak","Imran",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 00:08:18 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 03:40:32 GMT"}],"updateDate":"2024-08-22","timestamp":1721606898000,"abstract":"  Retinal imaging has emerged as a promising method of addressing this\nchallenge, taking advantage of the unique structure of the retina. The retina\nis an embryonic extension of the central nervous system, providing a direct in\nvivo window into neurological health. Recent studies have shown that specific\nstructural changes in retinal vessels can not only serve as early indicators of\nvarious diseases but also help to understand disease progression. In this work,\nwe present a lightweight retinal vessel segmentation network based on the\nencoder-decoder mechanism with region-guided attention. We introduce inverse\naddition attention blocks with region guided attention to focus on the\nforeground regions and improve the segmentation of regions of interest. To\nfurther boost the model's performance on retinal vessel segmentation, we employ\na weighted dice loss. This choice is particularly effective in addressing the\nclass imbalance issues frequently encountered in retinal vessel segmentation\ntasks. Dice loss penalises false positives and false negatives equally,\nencouraging the model to generate more accurate segmentation with improved\nobject boundary delineation and reduced fragmentation. Extensive experiments on\na benchmark dataset show better performance (0.8285, 0.8098, 0.9677, and 0.8166\nrecall, precision, accuracy and F1 score respectively) compared to\nstate-of-the-art methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}