{"id":"2407.06288","title":"Bidding Games with Charging","authors":"Guy Avni, Ehsan Kafshdar Goharshady, Thomas A. Henzinger and Kaushik\n  Mallik","authorsParsed":[["Avni","Guy",""],["Goharshady","Ehsan Kafshdar",""],["Henzinger","Thomas A.",""],["Mallik","Kaushik",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:03:27 GMT"}],"updateDate":"2024-07-10","timestamp":1720461807000,"abstract":"  Graph games lie at the algorithmic core of many automated design problems in\ncomputer science. These are games usually played between two players on a given\ngraph, where the players keep moving a token along the edges according to\npre-determined rules, and the winner is decided based on the infinite path\ntraversed by the token from a given initial position. In bidding games, the\nplayers initially get some monetary budgets which they need to use to bid for\nthe privilege of moving the token at each step. Each round of bidding affects\nthe players' available budgets, which is the only form of update that the\nbudgets experience. We introduce bidding games with charging where the players\ncan additionally improve their budgets during the game by collecting\nvertex-dependent charges. Unlike traditional bidding games (where all charges\nare zero), bidding games with charging allow non-trivial recurrent behaviors.\nWe show that the central property of traditional bidding games generalizes to\nbidding games with charging: For each vertex there exists a threshold ratio,\nwhich is the necessary and sufficient fraction of the total budget for winning\nthe game from that vertex. While the thresholds of traditional bidding games\ncorrespond to unique fixed points of linear systems of equations, in games with\ncharging, these fixed points are no longer unique. This significantly\ncomplicates the proof of existence and the algorithmic computation of\nthresholds for infinite-duration objectives. We also provide the lower\ncomplexity bounds for computing thresholds for Rabin and Streett objectives,\nwhich are the first known lower bounds in any form of bidding games (with or\nwithout charging), and we solve the following repair problem for safety and\nreachability games that have unsatisfiable objectives: Can we distribute a\ngiven amount of charge to the players in a way such that the objective can be\nsatisfied?\n","subjects":["Computing Research Repository/Computer Science and Game Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}