{"id":"2407.01493","title":"Immutable in Principle, Upgradeable by Design: Exploratory Study of\n  Smart Contract Upgradeability","authors":"Ilham Qasse, Mohammad Hamdaqa, Bj\\\"orn {\\TH}\\'or J\\'onsson","authorsParsed":[["Qasse","Ilham",""],["Hamdaqa","Mohammad",""],["Jónsson","Björn Þór",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 17:35:37 GMT"}],"updateDate":"2024-07-02","timestamp":1719855337000,"abstract":"  Smart contracts, known for their immutable nature to ensure trust via\nautomated enforcement, have evolved to require upgradeability due to unforeseen\nvulnerabilities and the need for feature enhancements post-deployment. This\ncontradiction between immutability and the need for modifications has led to\nthe development of upgradeable smart contracts. These contracts are immutable\nin principle yet upgradable by design, allowing updates without altering the\nunderlying data or state, thus preserving the contract's intent while allowing\nimprovements. This study aims to understand the application and implications of\nupgradeable smart contracts on the Ethereum blockchain. By introducing a\ndataset that catalogs the versions and evolutionary trajectories of smart\ncontracts, the research explores key dimensions: the prevalence and adoption\npatterns of upgrade mechanisms, the likelihood and occurrences of contract\nupgrades, the nature of modifications post-upgrade, and their impact on user\nengagement and contract activity. Through empirical analysis, this study\nidentifies upgradeable contracts and examines their upgrade history to uncover\ntrends, preferences, and challenges associated with modifications. The evidence\nfrom analyzing over 44 million contracts shows that only 3% have upgradeable\ncharacteristics, with only 0.34% undergoing upgrades. This finding underscores\na cautious approach by developers towards modifications, possibly due to the\ncomplexity of upgrade processes or a preference for maintaining stability.\nFurthermore, the study shows that upgrades are mainly aimed at feature\nenhancement and vulnerability mitigation, particularly when the contracts'\nsource codes are accessible. However, the relationship between upgrades and\nuser activity is complex, suggesting that additional factors significantly\naffect the use of smart contracts beyond their evolution.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}