{"id":"2407.18324","title":"AMA-LSTM: Pioneering Robust and Fair Financial Audio Analysis for Stock\n  Volatility Prediction","authors":"Shengkun Wang, Taoran Ji, Jianfeng He, Mariam Almutairi, Dan Wang,\n  Linhan Wang, Min Zhang, Chang-Tien Lu","authorsParsed":[["Wang","Shengkun",""],["Ji","Taoran",""],["He","Jianfeng",""],["Almutairi","Mariam",""],["Wang","Dan",""],["Wang","Linhan",""],["Zhang","Min",""],["Lu","Chang-Tien",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:40:53 GMT"}],"updateDate":"2024-07-29","timestamp":1720032053000,"abstract":"  Stock volatility prediction is an important task in the financial industry.\nRecent advancements in multimodal methodologies, which integrate both textual\nand auditory data, have demonstrated significant improvements in this domain,\nsuch as earnings calls (Earnings calls are public available and often involve\nthe management team of a public company and interested parties to discuss the\ncompany's earnings). However, these multimodal methods have faced two\ndrawbacks. First, they often fail to yield reliable models and overfit the data\ndue to their absorption of stochastic information from the stock market.\nMoreover, using multimodal models to predict stock volatility suffers from\ngender bias and lacks an efficient way to eliminate such bias. To address these\naforementioned problems, we use adversarial training to generate perturbations\nthat simulate the inherent stochasticity and bias, by creating areas resistant\nto random information around the input space to improve model robustness and\nfairness. Our comprehensive experiments on two real-world financial audio\ndatasets reveal that this method exceeds the performance of current\nstate-of-the-art solution. This confirms the value of adversarial training in\nreducing stochasticity and bias for stock volatility prediction tasks.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computation and Language","Electrical Engineering and Systems Science/Audio and Speech Processing","Quantitative Finance/Computational Finance","Quantitative Finance/Statistical Finance"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ykcy1Z9ZaaIUmucJ42iSXGUPLulxxnArg9NZpEM4JAg","pdfSize":"731848","objectId":"0x37c7ccf3383e45fd4dcd8e1a1cdc1c9e950e0e4415497adc2114b6c82e088f7d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
