{"id":"2407.03012","title":"GW effects on the topology of type-II Dirac cones in NiTe$_2$, PtSe$_2$\n  and PtTe$_2$","authors":"Franz Fischer, Abderrezak Torche, Marta Prada and Gabriel Bester","authorsParsed":[["Fischer","Franz",""],["Torche","Abderrezak",""],["Prada","Marta",""],["Bester","Gabriel",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 11:12:02 GMT"}],"updateDate":"2024-07-04","timestamp":1720005122000,"abstract":"  Many-body correlations are known to be responsible for a broad range of\nfascinating physical phenomena, introducing corrections that appear elusive at\nthe mean-field level. An example of this is the Lifshitz transition that occurs\nas the Fermi surface topology changes when {\\it e.g.} Coulomb interaction\neffects break into the picture. In particular, the Fermi velocity\nrenormalization can lead a type-II Weyl semimetal at mean-field level to become\na trivial or a type-I Dirac material when correlations are accounted for, which\nis far from being obvious. In this work we scrutinize the band structure of\nNiTe$_2$, a material that features a type-II Dirac point near the Fermi level\nwithin the mean-field approach. Including GW-level correlations, our findings\nshowcase anisotropic corrections on the Dirac carrier velocity exceeding $100\n\\, \\%$ enhancements, underscoring the nuanced influence of electronic\ninteractions in the band structure. We also consider type-II Dirac crossings in\nPtSe$_2$ and PtTe$_2$ and observe that including many-body effects via GW the\nband topology changes, featuring trivial topology and type-I Dirac crossings,\nrespectively. Our findings highlights the necessity to evaluate the many-body\neffects on non-trivial bands, contributing essential insights to the broader\nexploration of many-body correlation effects in type-II Dirac points of\ncondensed-matter systems.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}