{"id":"2407.21668","title":"Slow decay rate of correlations induced by long-range extended\n  Dzyaloshinskii-Moriya interactions","authors":"Tanoy Kanti Konar, Leela Ganesh Chandra Lakkaraju, Aditi Sen De","authorsParsed":[["Konar","Tanoy Kanti",""],["Lakkaraju","Leela Ganesh Chandra",""],["De","Aditi Sen",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:12:04 GMT"}],"updateDate":"2024-08-01","timestamp":1722438724000,"abstract":"  We examine the impact of long-range Dzyaloshinskii-Moriya (DM) interaction in\nthe extended XY model on the phase diagram as well as the static and dynamical\nproperties of quantum and classical correlation functions. It is known that in\nthe nearest-neighbor XY model with DM interaction, the transition from the\ngapless chiral phase to a gapped one occurs when the strengths of the DM\ninteraction and anisotropy coincide. We exhibit that the critical line gets\nmodified with the range of interactions which decay according to power-law.\nSpecifically, instead of being gapless in the presence of a strong DM\ninteraction, a gapped region emerges which grows with the increase of the\nmoderate fall-off rate (quasi-long range regime) in the presence of a\ntransverse magnetic field. The gapless chiral phase can also be separated from\na gapped one by the decay patterns of quantum mutual information and classical\ncorrelation with distant sites of the ground state which are independent of the\nfall-off rate in the gapless zone. We observe that the corresponding critical\nlines that depend on the fall-off rate can also be determined from the\neffective central charge involved in the scaling of entanglement entropy. We\nillustrate that in a non-equilibrium setting, the relaxation dynamics of\nclassical correlation, the decay rate of total correlation, and the growth rate\nof entanglement entropy can be employed to uncover whether the evolving\nHamiltonian and the Hamiltonian corresponding to the initial state are gapped\nor gapless.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Quantum Gases","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}