{"id":"2407.15151","title":"Spin Qubits with Scalable milli-kelvin CMOS Control","authors":"Samuel K. Bartee, Will Gilbert, Kun Zuo, Kushal Das, Tuomo Tanttu,\n  Chih Hwan Yang, Nard Dumoulin Stuyck, Sebastian J. Pauka, Rocky Y. Su, Wee\n  Han Lim, Santiago Serrano, Christopher C. Escott, Fay E. Hudson, Kohei M.\n  Itoh, Arne Laucht, Andrew S. Dzurak, and David J. Reilly","authorsParsed":[["Bartee","Samuel K.",""],["Gilbert","Will",""],["Zuo","Kun",""],["Das","Kushal",""],["Tanttu","Tuomo",""],["Yang","Chih Hwan",""],["Stuyck","Nard Dumoulin",""],["Pauka","Sebastian J.",""],["Su","Rocky Y.",""],["Lim","Wee Han",""],["Serrano","Santiago",""],["Escott","Christopher C.",""],["Hudson","Fay E.",""],["Itoh","Kohei M.",""],["Laucht","Arne",""],["Dzurak","Andrew S.",""],["Reilly","David J.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 13:04:21 GMT"}],"updateDate":"2024-07-23","timestamp":1721567061000,"abstract":"  A key virtue of spin qubits is their sub-micron footprint, enabling a single\nsilicon chip to host the millions of qubits required to execute useful quantum\nalgorithms with error correction. With each physical qubit needing multiple\ncontrol lines however, a fundamental barrier to scale is the extreme density of\nconnections that bridge quantum devices to their external control and readout\nhardware. A promising solution is to co-locate the control system proximal to\nthe qubit platform at milli-kelvin temperatures, wired-up via miniaturized\ninterconnects. Even so, heat and crosstalk from closely integrated control have\npotential to degrade qubit performance, particularly for two-qubit entangling\ngates based on exchange coupling that are sensitive to electrical noise. Here,\nwe benchmark silicon MOS-style electron spin qubits controlled via\nheterogeneously-integrated cryo-CMOS circuits with a low enough power density\nto enable scale-up. Demonstrating that cryo-CMOS can efficiently enable\nuniversal logic operations for spin qubits, we go on to show that mill-kelvin\ncontrol has little impact on the performance of single- and two-qubit gates.\nGiven the complexity of our milli-kelvin CMOS platform, with some 100-thousand\ntransistors, these results open the prospect of scalable control based on the\ntight packaging of spin qubits with a chiplet style control architecture.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}