{"id":"2407.08325","title":"Anisotropic Thermal Transport in Tunable Self-Assembled Nanocrystal\n  Supercrystals","authors":"Matias Feldman, Charles Vernier, Rahul Nag, Juan Barrios, S\\'ebastien\n  Royer, Herv\\'e Cruguel, Emmanuelle Lacaze, Emmanuel Lhuillier, Dani\\`ele\n  Fournier, Florian Schulz, Cyrille Hamon, Herv\\'e Portal\\`es, James K.\n  Utterback","authorsParsed":[["Feldman","Matias",""],["Vernier","Charles",""],["Nag","Rahul",""],["Barrios","Juan",""],["Royer","Sébastien",""],["Cruguel","Hervé",""],["Lacaze","Emmanuelle",""],["Lhuillier","Emmanuel",""],["Fournier","Danièle",""],["Schulz","Florian",""],["Hamon","Cyrille",""],["Portalès","Hervé",""],["Utterback","James K.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 09:18:40 GMT"}],"updateDate":"2024-07-12","timestamp":1720689520000,"abstract":"  Realizing tunable functional materials with built-in nanoscale heat flow\ndirectionality represents a significant challenge with the potential to enable\nnovel thermal management strategies. Here we use spatiotemporally-resolved\nthermoreflectance to visualize lateral thermal transport anisotropy in\nself-assembled supercrystals of anisotropic Au nanocrystals. Correlative\nelectron and thermoreflectance microscopy reveal that heat predominantly flows\nalong the long-axis of the anisotropic nanocrystals, and does so across grain\nboundaries and curved assemblies while voids disrupt heat flow. We finely\ncontrol the anisotropy via the aspect ratio of constituent nanorods, and it\nexceeds the aspect ratio for nano-bipyramid supercrystals and certain nanorod\narrangements. Finite element simulations and effective medium modeling\nrationalize the emergent anisotropic behavior in terms of a simple series\nresistance model, further providing a framework for estimating thermal\nanisotropy as a function of material and structural parameters. Self-assembly\nof colloidal nanocrystals promises a novel route to direct heat flow in a wide\nrange of applications that utilize this important class of materials.\n","subjects":["Physics/Applied Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yIe1APiViHS2VLxaLpSqwxwio_aKf4-Y1A0-Lqm1JZA","pdfSize":"11386956"}
