{"id":"2407.07098","title":"Concurrent Geometry, Control, and Layout Optimization of Wave Energy\n  Converter Farms in Probabilistic Irregular Waves using Surrogate Modeling","authors":"Saeed Azad and Daniel R. Herber and Suraj Khanal and Gaofeng Jia","authorsParsed":[["Azad","Saeed",""],["Herber","Daniel R.",""],["Khanal","Suraj",""],["Jia","Gaofeng",""]],"versions":[{"version":"v1","created":"Mon, 17 Jun 2024 21:13:27 GMT"}],"updateDate":"2024-07-11","timestamp":1718658807000,"abstract":"  A promising direction towards improving the performance of wave energy\nconverter (WEC) farms is to leverage a system-level integrated approach known\nas control co-design (CCD). A WEC farm CCD problem may entail decision\nvariables associated with the geometric attributes, control parameters, and\nlayout of the farm. However, solving the resulting optimization problem, which\nrequires the estimation of hydrodynamic coefficients through numerical methods\nsuch as multiple scattering (MS), is computationally prohibitive. To mitigate\nthis computational bottleneck, we construct data-driven surrogate models (SMs)\nusing artificial neural networks in combination with concepts from many-body\nexpansion. The resulting SMs, developed using an active learning strategy known\nas query by committee, are validated through a variety of methods to ensure\nacceptable performance in estimating the hydrodynamic coefficients,\n(energy-related) objective function, and decision variables. To rectify\ninherent errors in SMs, a hybrid optimization strategy is devised. It involves\nsolving an optimization problem with a genetic algorithm and SMs to generate a\nstarting point that will be used with a gradient-based optimizer and MS. The\neffectiveness of the proposed approach is demonstrated by solving a series of\noptimization problems with increasing levels of integration. For a layout\noptimization study, the framework offers a 91-fold increase in computational\nefficiency compared to MS. Previously unexplored investigations of much further\ncomplexity are also performed, leading to a concurrent geometry, control, and\nlayout optimization of WEC devices in probabilistic irregular waves. The\nscalability of the method is evaluated by increasing the farm size to include\n25 devices. The results indicate promising directions toward a practical\nframework for integrated WEC farm design with more tractable computational\ndemands.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"epF7hV01DUk7ZOxFPztXKdcx0ai_tyKkU7gsgaW7HMg","pdfSize":"2699653"}
