{"id":"2407.18711","title":"Vector Magnetometry Using Shallow Implanted NV Centers in Diamond with\n  Waveguide-Assisted Dipole Excitation and Readout","authors":"Sajedeh Shahbazi, Giulio Coccia, Johannes Lang, Vibhav Bharadwaj,\n  Fedor Jelezko, Roberta Ramponi, Anthony J. Bennett, John P. Hadden, Shane M.\n  Eaton, and Alexander Kubanek","authorsParsed":[["Shahbazi","Sajedeh",""],["Coccia","Giulio",""],["Lang","Johannes",""],["Bharadwaj","Vibhav",""],["Jelezko","Fedor",""],["Ramponi","Roberta",""],["Bennett","Anthony J.",""],["Hadden","John P.",""],["Eaton","Shane M.",""],["Kubanek","Alexander",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 12:55:25 GMT"}],"updateDate":"2024-07-29","timestamp":1721998525000,"abstract":"  On-chip magnetic field sensing with Nitrogen-Vacancy (NV) centers in diamond\nrequires scalable integration of 3D waveguides into diamond substrates. Here,\nwe develop a sensing array device with an ensemble of shallow implanted NV\ncenters integrated with arrays of laser-written waveguides for excitation and\nreadout of NV signals. Our approach enables an easy-to-operate on-chip\nmagnetometer with a pixel size proportional to the Gaussian mode area of each\nwaveguide. The performed continuous wave optically detected magnetic resonance\non each waveguide gives an average dc-sensitivity value of $195 \\pm 3\n{nT}/\\sqrt{Hz}$, which can be improved with lock-in-detection or\npulsed-microwave sequences. We apply a magnetic field to separate the four NV\ncrystallographic orientations of the magnetic resonance and then utilize a DC\ncurrent through a straight wire antenna close to the waveguide to prove the\nsensor capabilities of our device. We reconstruct the complete vector magnetic\nfield in the NV crystal frame using three different NV crystallographic\norientations. By knowing the polarization axis of the waveguide mode, we\nproject the magnetic field vector into the lab frame.\n","subjects":["Physics/Quantum Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/"}