{"id":"2407.19685","title":"Giant anisotropic magnetoresistance in few-layer {\\alpha}-RuCl3 tunnel\n  junctions","authors":"Mathieu Massicotte, Sam Dehlavi, Xiaoyu Liu, James L. Hart, Elio\n  Garnaoui, Paula Lampen-Kelley, Jiaqiang Yan, David Mandrus, Stephen E.\n  Nagler, Kenji Watanabe, Takashi Taniguchi, Bertrand Reulet, Judy J. Cha,\n  Hae-Young Kee and Jeffrey A. Quilliam","authorsParsed":[["Massicotte","Mathieu",""],["Dehlavi","Sam",""],["Liu","Xiaoyu",""],["Hart","James L.",""],["Garnaoui","Elio",""],["Lampen-Kelley","Paula",""],["Yan","Jiaqiang",""],["Mandrus","David",""],["Nagler","Stephen E.",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Reulet","Bertrand",""],["Cha","Judy J.",""],["Kee","Hae-Young",""],["Quilliam","Jeffrey A.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 04:04:28 GMT"}],"updateDate":"2024-07-30","timestamp":1722225868000,"abstract":"  The spin-orbit assisted Mott insulator $\\alpha$-RuCl3 is proximate to the\ncoveted quantum spin liquid (QSL) predicted by the Kitaev model. In the search\nfor the pure Kitaev QSL, reducing the dimensionality of this frustrated magnet\nby exfoliation has been proposed as a way to enhance magnetic fluctuations and\nKitaev interactions. Here, we perform angle-dependent tunneling\nmagnetoresistance (TMR) measurements on ultrathin $\\alpha$-RuCl3 crystals with\nvarious layer numbers to probe their magnetic, electronic and crystal\nstructure. We observe a giant change in resistance - as large as ~2500% - when\nthe magnetic field rotates either within or out of the $\\alpha$-RuCl3 plane, a\nmanifestation of the strongly anisotropic spin interactions in this material.\nIn combination with scanning transmission electron microscopy, this tunneling\nanisotropic magnetoresistance (TAMR) reveals that few-layer $\\alpha$-RuCl3\ncrystals remain in the high-temperature monoclinic phase at low temperature. It\nalso shows the presence of a zigzag antiferromagnetic order below the critical\ntemperature TN ~ 14 K, which is twice the one typically observed in bulk\nsamples with rhombohedral stacking. Our work offers valuable insights into the\nrelation between the stacking order and magnetic properties of this material,\nwhich helps lay the groundwork for creating and electrically probing exotic\nmagnetic phases like QSLs via van der Waals engineering.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}