{"id":"2407.09371","title":"Computationally Efficient Estimation of Large Probit Models","authors":"Patrick Ding, Guido Imbens, Zhaonan Qu, Yinyu Ye","authorsParsed":[["Ding","Patrick",""],["Imbens","Guido",""],["Qu","Zhaonan",""],["Ye","Yinyu",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 15:52:12 GMT"}],"updateDate":"2024-07-15","timestamp":1720799532000,"abstract":"  Probit models are useful for modeling correlated discrete responses in many\ndisciplines, including discrete choice data in economics. However, the Gaussian\nlatent variable feature of probit models coupled with identification\nconstraints pose significant computational challenges for its estimation and\ninference, especially when the dimension of the discrete response variable is\nlarge. In this paper, we propose a computationally efficient\nExpectation-Maximization (EM) algorithm for estimating large probit models. Our\nwork is distinct from existing methods in two important aspects. First, instead\nof simulation or sampling methods, we apply and customize expectation\npropagation (EP), a deterministic method originally proposed for approximate\nBayesian inference, to estimate moments of the truncated multivariate normal\n(TMVN) in the E (expectation) step. Second, we take advantage of a symmetric\nidentification condition to transform the constrained optimization problem in\nthe M (maximization) step into a one-dimensional problem, which is solved\nefficiently using Newton's method instead of off-the-shelf solvers. Our method\nenables the analysis of correlated choice data in the presence of more than 100\nalternatives, which is a reasonable size in modern applications, such as online\nshopping and booking platforms, but has been difficult in practice with probit\nmodels. We apply our probit estimation method to study ordering effects in\nhotel search results on Expedia.com.\n","subjects":["Statistics/Methodology","Economics/Econometrics","Statistics/Computation"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}