{"id":"2407.21207","title":"Investigating the crust of neutron stars with neural-network quantum\n  states","authors":"Bryce Fore, Jane Kim, Morten Hjorth-Jensen, and Alessandro Lovato","authorsParsed":[["Fore","Bryce",""],["Kim","Jane",""],["Hjorth-Jensen","Morten",""],["Lovato","Alessandro",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 21:42:54 GMT"}],"updateDate":"2024-08-01","timestamp":1722375774000,"abstract":"  An accurate description of low-density nuclear matter is crucial for\nexplaining the physics of neutron star crusts. In the density range between\napproximately 0.01 fm$^{-3}$ and 0.1 fm$^{-3}$, matter transitions from\nneutron-rich nuclei to various higher-density pasta shapes, before ultimately\nreaching a uniform liquid. In this work, we introduce a variational Monte Carlo\nmethod based on a neural Pfaffian-Jastrow quantum state, which allows us to\nmodel the transition from the liquid phase to neutron-rich nuclei\nmicroscopically. At low densities, nuclear clusters dynamically emerge from the\nmicroscopic interactions among protons and neutrons, which we model based on\npionless effective field theory. Our variational Monte Carlo approach\nrepresents a significant improvement over the state-of-the-art auxiliary-field\ndiffusion Monte Carlo method, which is severely hindered by the fermion-sign\nproblem in this low-density regime and cannot capture the onset of clusters. In\naddition to computing the energy per particle of symmetric nuclear matter and\npure neutron matter, we analyze an intermediate isospin-asymmetry configuration\nto elucidate the formation of nuclear clusters. We also provide evidence that\nthe presence of such nuclear clusters influences the amount of protons in the\ncrust compared to protons in beta-equilibrated, neutrino-transparent matter.\n","subjects":["Physics/Nuclear Theory","Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}