{"id":"2407.01278","title":"Small Aerial Target Detection for Airborne Infrared Detection Systems\n  using LightGBM and Trajectory Constraints","authors":"Xiaoliang Sun, Liangchao Guo, Wenlong Zhang, Zi Wang and Qifeng Yu","authorsParsed":[["Sun","Xiaoliang",""],["Guo","Liangchao",""],["Zhang","Wenlong",""],["Wang","Zi",""],["Yu","Qifeng",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:33:40 GMT"}],"updateDate":"2024-07-02","timestamp":1719840820000,"abstract":"  Factors, such as rapid relative motion, clutter background, etc., make robust\nsmall aerial target detection for airborne infrared detection systems a\nchallenge. Existing methods are facing difficulties when dealing with such\ncases. We consider that a continuous and smooth trajectory is critical in\nboosting small infrared aerial target detection performance. A simple and\neffective small aerial target detection method for airborne infrared detection\nsystem using light gradient boosting model (LightGBM) and trajectory\nconstraints is proposed in this article. First, we simply formulate target\ncandidate detection as a binary classification problem. Target candidates in\nevery individual frame are detected via interesting pixel detection and a\ntrained LightGBM model. Then, the local smoothness and global continuous\ncharacteristic of the target trajectory are modeled as short-strict and\nlong-loose constraints. The trajectory constraints are used efficiently for\ndetecting the true small infrared aerial targets from numerous target\ncandidates. Experiments on public datasets demonstrate that the proposed method\nperforms better than other existing methods. Furthermore, a public dataset for\nsmall aerial target detection in airborne infrared detection systems is\nconstructed. To the best of our knowledge, this dataset has the largest data\nscale and richest scene types within this field.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}