{"id":"2407.04681","title":"Rethinking Visual Prompting for Multimodal Large Language Models with\n  External Knowledge","authors":"Yuanze Lin, Yunsheng Li, Dongdong Chen, Weijian Xu, Ronald Clark,\n  Philip Torr, Lu Yuan","authorsParsed":[["Lin","Yuanze",""],["Li","Yunsheng",""],["Chen","Dongdong",""],["Xu","Weijian",""],["Clark","Ronald",""],["Torr","Philip",""],["Yuan","Lu",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 17:43:30 GMT"}],"updateDate":"2024-07-08","timestamp":1720201410000,"abstract":"  In recent years, multimodal large language models (MLLMs) have made\nsignificant strides by training on vast high-quality image-text datasets,\nenabling them to generally understand images well. However, the inherent\ndifficulty in explicitly conveying fine-grained or spatially dense information\nin text, such as masks, poses a challenge for MLLMs, limiting their ability to\nanswer questions requiring an understanding of detailed or localized visual\nelements. Drawing inspiration from the Retrieval-Augmented Generation (RAG)\nconcept, this paper proposes a new visual prompt approach to integrate\nfine-grained external knowledge, gleaned from specialized vision models (e.g.,\ninstance segmentation/OCR models), into MLLMs. This is a promising yet\nunderexplored direction for enhancing MLLMs' performance. Our approach diverges\nfrom concurrent works, which transform external knowledge into additional text\nprompts, necessitating the model to indirectly learn the correspondence between\nvisual content and text coordinates. Instead, we propose embedding fine-grained\nknowledge information directly into a spatial embedding map as a visual prompt.\nThis design can be effortlessly incorporated into various MLLMs, such as LLaVA\nand Mipha, considerably improving their visual understanding performance.\nThrough rigorous experiments, we demonstrate that our method can enhance MLLM\nperformance across nine benchmarks, amplifying their fine-grained context-aware\ncapabilities.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}