{"id":"2407.14185","title":"Achieving Well-Informed Decision-Making in Drug Discovery: A\n  Comprehensive Calibration Study using Neural Network-Based Structure-Activity\n  Models","authors":"Hannah Rosa Friesacher, Ola Engkvist, Lewis Mervin, Yves Moreau, Adam\n  Arany","authorsParsed":[["Friesacher","Hannah Rosa",""],["Engkvist","Ola",""],["Mervin","Lewis",""],["Moreau","Yves",""],["Arany","Adam",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 10:29:00 GMT"}],"updateDate":"2024-07-22","timestamp":1721384940000,"abstract":"  In the drug discovery process, where experiments can be costly and\ntime-consuming, computational models that predict drug-target interactions are\nvaluable tools to accelerate the development of new therapeutic agents.\nEstimating the uncertainty inherent in these neural network predictions\nprovides valuable information that facilitates optimal decision-making when\nrisk assessment is crucial. However, such models can be poorly calibrated,\nwhich results in unreliable uncertainty estimates that do not reflect the true\npredictive uncertainty. In this study, we compare different metrics, including\naccuracy and calibration scores, used for model hyperparameter tuning to\ninvestigate which model selection strategy achieves well-calibrated models.\nFurthermore, we propose to use a computationally efficient Bayesian uncertainty\nestimation method named Bayesian Linear Probing (BLP), which generates\nHamiltonian Monte Carlo (HMC) trajectories to obtain samples for the parameters\nof a Bayesian Logistic Regression fitted to the hidden layer of the baseline\nneural network. We report that BLP improves model calibration and achieves the\nperformance of common uncertainty quantification methods by combining the\nbenefits of uncertainty estimation and probability calibration methods.\nFinally, we show that combining post hoc calibration method with\nwell-performing uncertainty quantification approaches can boost model accuracy\nand calibration.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}