{"id":"2407.05930","title":"A multigrid reduction framework for domains with symmetries","authors":"\\`Adel Alsalti-Baldellou, Carlo Janna, Xavier \\'Alvarez-Farr\\'e, and\n  F. Xavier Trias","authorsParsed":[["Alsalti-Baldellou","Àdel",""],["Janna","Carlo",""],["Álvarez-Farré","Xavier",""],["Trias","F. Xavier",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 13:36:21 GMT"},{"version":"v2","created":"Sat, 31 Aug 2024 22:20:56 GMT"}],"updateDate":"2024-09-04","timestamp":1720445781000,"abstract":"  Divergence constraints are present in the governing equations of numerous\nphysical phenomena, and they usually lead to a Poisson equation whose solution\nrepresents a bottleneck in many simulation codes. Algebraic Multigrid (AMG) is\narguably the most powerful preconditioner for Poisson's equation, and its\neffectiveness results from the complementary roles played by the smoother,\nresponsible for damping high-frequency error components, and the coarse-grid\ncorrection, which in turn reduces low-frequency modes. This work presents\nseveral strategies to make AMG more compute-intensive by leveraging reflection,\ntranslational and rotational symmetries. AMGR, our final proposal, does not\nrequire boundary conditions to be symmetric, therefore applying to a broad\nrange of academic and industrial configurations. It is based on a multigrid\nreduction framework that introduces an aggressive coarsening to the multigrid\nhierarchy, reducing the memory footprint, setup and application costs of the\ntop-level smoother. While preserving AMG's excellent convergence, AMGR allows\nreplacing the standard sparse matrix-vector product with the more\ncompute-intensive sparse matrix-matrix product, yielding significant\naccelerations. Numerical experiments on industrial CFD applications\ndemonstrated up to 70% speed-ups when solving Poisson's equation with AMGR\ninstead of AMG. Additionally, strong and weak scalability analyses revealed no\nsignificant degradation.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}