{"id":"2407.03652","title":"Over the Edge of Chaos? Excess Complexity as a Roadblock to Artificial\n  General Intelligence","authors":"Teo Susnjak, Timothy R. McIntosh, Andre L. C. Barczak, Napoleon H.\n  Reyes, Tong Liu, Paul Watters, Malka N. Halgamuge","authorsParsed":[["Susnjak","Teo",""],["McIntosh","Timothy R.",""],["Barczak","Andre L. C.",""],["Reyes","Napoleon H.",""],["Liu","Tong",""],["Watters","Paul",""],["Halgamuge","Malka N.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 05:46:39 GMT"}],"updateDate":"2024-07-08","timestamp":1720071999000,"abstract":"  In this study, we explored the progression trajectories of artificial\nintelligence (AI) systems through the lens of complexity theory. We challenged\nthe conventional linear and exponential projections of AI advancement toward\nArtificial General Intelligence (AGI) underpinned by transformer-based\narchitectures, and posited the existence of critical points, akin to phase\ntransitions in complex systems, where AI performance might plateau or regress\ninto instability upon exceeding a critical complexity threshold. We employed\nagent-based modelling (ABM) to simulate hypothetical scenarios of AI systems'\nevolution under specific assumptions, using benchmark performance as a proxy\nfor capability and complexity. Our simulations demonstrated how increasing the\ncomplexity of the AI system could exceed an upper criticality threshold,\nleading to unpredictable performance behaviours. Additionally, we developed a\npractical methodology for detecting these critical thresholds using simulation\ndata and stochastic gradient descent to fine-tune detection thresholds. This\nresearch offers a novel perspective on AI advancement that has a particular\nrelevance to Large Language Models (LLMs), emphasising the need for a tempered\napproach to extrapolating AI's growth potential and underscoring the importance\nof developing more robust and comprehensive AI performance benchmarks.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Complexity"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}