{"id":"2407.00668","title":"HRDE: Retrieval-Augmented Large Language Models for Chinese Health Rumor\n  Detection and Explainability","authors":"Yanfang Chen and Ding Chen and Shichao Song and Simin Niu and Hanyu\n  Wang and Zeyun Tang and Feiyu Xiong and Zhiyu Li","authorsParsed":[["Chen","Yanfang",""],["Chen","Ding",""],["Song","Shichao",""],["Niu","Simin",""],["Wang","Hanyu",""],["Tang","Zeyun",""],["Xiong","Feiyu",""],["Li","Zhiyu",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 11:27:50 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 15:18:40 GMT"}],"updateDate":"2024-07-04","timestamp":1719746870000,"abstract":"  As people increasingly prioritize their health, the speed and breadth of\nhealth information dissemination on the internet have also grown. At the same\ntime, the presence of false health information (health rumors) intermingled\nwith genuine content poses a significant potential threat to public health.\nHowever, current research on Chinese health rumors still lacks a large-scale,\npublic, and open-source dataset of health rumor information, as well as\neffective and reliable rumor detection methods. This paper addresses this gap\nby constructing a dataset containing 1.12 million health-related rumors\n(HealthRCN) through web scraping of common health-related questions and a\nseries of data processing steps. HealthRCN is the largest known dataset of\nChinese health information rumors to date. Based on this dataset, we propose\nretrieval-augmented large language models for Chinese health rumor detection\nand explainability (HRDE). This model leverages retrieved relevant information\nto accurately determine whether the input health information is a rumor and\nprovides explanatory responses, effectively aiding users in verifying the\nauthenticity of health information. In evaluation experiments, we compared\nmultiple models and found that HRDE outperformed them all, including\nGPT-4-1106-Preview, in rumor detection accuracy and answer quality. HRDE\nachieved an average accuracy of 91.04% and an F1 score of 91.58%.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}