{"id":"2407.20138","title":"Multiplicity of stars with planets in the solar neighbourhood","authors":"J. Gonz\\'alez-Payo, J. A. Caballero, J. Gorgas, M. Cort\\'es-Contreras,\n  M.-C. G\\'alvez-Ortiz, C. Cifuentes","authorsParsed":[["González-Payo","J.",""],["Caballero","J. A.",""],["Gorgas","J.",""],["Cortés-Contreras","M.",""],["Gálvez-Ortiz","M. -C.",""],["Cifuentes","C.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 16:05:58 GMT"}],"updateDate":"2024-07-30","timestamp":1722269158000,"abstract":"  - Aims: We intended to quantify the impact of stellar multiplicity on the\npresence and properties of exoplanets. - Methods: We investigated all exoplanet\nhost stars at less than 100 pc using the latest astrometric data from Gaia DR3\nand advanced statistical methodologies. We complemented our search for common\nproper motion and parallax companions with data from the Washington Double Star\ncatalogue and the literature. After excluding a number of systems based on\nradial velocity data, and membership in clusters and open associations, or with\nresolved ultracool companions, we kept 215 exoplanet host stars in 212\nmultiple-star systems. - Results: We found 17 new companions in the systems of\n15 known exoplanet host stars, measured precise angular and projected physical\nseparations and position angles for 236 pairs of stars, compiled key parameters\nfor 276 planets in multiple systems, and established a comparison sample\ncomprising 687 single stars with exoplanets. With all of this, we statistically\nanalysed a series of hypothesis regarding planets in multiple stellar systems.\nAlthough they are only statistically significant at a 2{\\sigma} level, our\nanalysis pointed to several interesting results on the comparison in the mean\nnumber of planets in multiple versus single stellar systems and the tendency of\nhigh mass planets to be located in closer orbits in multiple systems. We\nconfirm that planets in multiple systems tend to have orbits with larger\neccentricities than those in single systems. In particular, we found a\nsignificant (> 4{\\sigma}) preference for planets to exhibit high orbital\neccentricities at small ratios between star-star projected physical separations\nand star-planet semi-major axes.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}