{"id":"2407.03260","title":"Improvement of the perovskite photodiodes performance via advanced\n  interface engineering with polymer dielectric","authors":"A.P. Morozov, L.O. Luchnikov, S. Yu. Yurchuk, A.R. Ishteev, P.A.\n  Gostishchev, S.I. Didenko, N.S. Saratovsky, S.S. Kozlov, D.S. Muratov, Yu. N.\n  Luponosov and D.S. Saranin","authorsParsed":[["Morozov","A. P.",""],["Luchnikov","L. O.",""],["Yurchuk","S. Yu.",""],["Ishteev","A. R.",""],["Gostishchev","P. A.",""],["Didenko","S. I.",""],["Saratovsky","N. S.",""],["Kozlov","S. S.",""],["Muratov","D. S.",""],["Luponosov","Yu. N.",""],["Saranin","D. S.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 16:43:43 GMT"}],"updateDate":"2024-07-04","timestamp":1720025023000,"abstract":"  Halide perovskite-based photodiodes are promising for efficient detection\nacross a broad spectral range. Perovskite absorber thin-films have a\nmicrocrystalline morphology, characterized by a high density of surface states\nand defects at inter-grain interfaces. In this work, we used\ndielectric-ferroelectric poly(vinylidene-fluoride-trifluoroethylene-P(VDF-TrFE)\nto modify the bulk interfaces and electron transport junction in p-i-n\nperovskite photodiodes. Our complex work demonstrates that interface\nengineering with P(VDF-TrFE) induces significant Fermi level pinning, reducing\nfrom 4.85 eV for intrinsic perovskite to 4.28 eV for the configuration with\ndielectric interlayers. The integration of P(VDF-TrFE) into the perovskite film\ndid not affect the morphology and crystal structure, but significantly changed\nthe charge transport and device performance. IV curve analysis and 2-diode\nmodel calculations showed enhanced shunt properties, a decreased non-ideality\nfactor, and reduced saturation dark current. We have shown that the complex\nintroduction of P(VDF-TrFE) into the absorbers bulk and on its surface is\nessential to reduce the impact of the trapping processes. For P(VDF-TrFE)\ncontaining devices, we increased the specific detectivity from 10^11 to 10^12\nJones, expanded the linear dynamic range up to 100 dB, and reduced the\nequivalent noise power to 10^-13 W*Hz^-0.5. Reducing non-radiative\nrecombination contributions significantly enhanced device performance,\nimproving rise/fall times from 6.3/10.9 us to 4.6/6.5 us. The cut-off frequency\n(3dB) increased from 64.8 kHz to 74.8 kHz following the introduction of the\ndielectric. These results provide new insights into the use of organic\ndielectrics and an improved understanding of trap-states and ion defect\ncompensation for detectors based on perovskite heterostructures.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}