{"id":"2407.12619","title":"MBE-grown virtual substrates for quantum dots emitting in the telecom O-\n  and C-bands","authors":"Bianca Scaparra, Elise Sirotti, Akhil Ajay, Bjoern Jonas, Beatrice\n  Costa, Hubert Riedl, Pavel Avdienko, Ian D. Sharp, Gregor Koblmueller,\n  Eugenio Zallo, Jonathan J. Finley, Kai Mueller","authorsParsed":[["Scaparra","Bianca",""],["Sirotti","Elise",""],["Ajay","Akhil",""],["Jonas","Bjoern",""],["Costa","Beatrice",""],["Riedl","Hubert",""],["Avdienko","Pavel",""],["Sharp","Ian D.",""],["Koblmueller","Gregor",""],["Zallo","Eugenio",""],["Finley","Jonathan J.",""],["Mueller","Kai",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:44:52 GMT"},{"version":"v2","created":"Mon, 19 Aug 2024 12:07:34 GMT"}],"updateDate":"2024-08-20","timestamp":1721227492000,"abstract":"  InAs semiconductor quantum dots (QDs) emitting in the near infrared are\npromising platforms for on-demand single-photon sources and spin-photon\ninterfaces. However, the realization of quantum-photonic nanodevices emitting\nin the second and third telecom windows with similar performance remains an\nopen challenge. Here, we report an optimized heterostructure design for QDs\nemitting in the O- and C-bands grown by means of molecular beam epitaxy. The\nInAs QDs are grown on compositionally graded InGaAs buffers, which act as\nvirtual substrates, and are embedded in mostly relaxed active regions.\nReciprocal space maps of the indium profiles and optical absorption spectra are\nused to optimize In0.22Ga0.78As and In0.30Ga0.70As active regions, accounting\nfor the chosen indium grading profile. This approach results in a tunable QD\nphotoluminescence (PL) emission from 1200 up to 1600 nm. Power and polarization\ndependent micro-PL measurements performed at 4 K reveal exciton-biexciton\ncomplexes from quantum dots emitting in the telecom O- and C-bands. The\npresented study establishes a flexible platform that can be an essential\ncomponent for advanced photonic devices based on InAs/GaAs that serve as\nbuilding blocks for future quantum networks.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}