{"id":"2407.19962","title":"Large-scale Magnetic Field Model of GRB Afterglow Polarization: Effects\n  of Field Anisotropy, Off-axis Viewing Angle, and Ordered Field","authors":"Asuka Kuwata, Kenji Toma, Sara Tomita, Jiro Shimoda","authorsParsed":[["Kuwata","Asuka",""],["Toma","Kenji",""],["Tomita","Sara",""],["Shimoda","Jiro",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 12:52:39 GMT"}],"updateDate":"2024-07-30","timestamp":1722257559000,"abstract":"  The afterglows of gamma-ray bursts are non-thermal electron synchrotron\nemissions from relativistic shocks. The origin of strong magnetic field in the\nemission region remains elusive, and two field amplification mechanisms via the\nplasma kinetic and magnetohydrodynamic instabilities have been discussed. The\npolarimetric observations are a powerful probe to distinguish these two\nmechanisms. So far, most theoretical works have focused on the former mechanism\nand constructed afterglow polarization models with microscopic-scale turbulence\nwhose coherence length is much smaller than the thickness of the blast wave. In\nthis work, focusing on the latter mechanism, we utilize our semi-analytic model\nof the synchrotron polarization with large-scale turbulence whose coherence\nlength is comparable to the thickness of the blast wave to investigate the\neffect of magnetic field anisotropy and the observer viewing angle. We find\nthat the polarization in our large-scale turbulence model can exhibit both\nbehaviors characteristic of the microscopic-scale turbulence model and those\nnot seen in the microscopic-scale model. Then we find that the large-scale\nmodel could explain all the polarimetric observational data to date that seem\nto be forward shock emission. We also examine the effect of ordered-field\ncomponent, and find that polarization degree and polarization angle constant in\ntime are realized only when the energy density ratio of the ordered and\nfluctuated components is $\\gtrsim 50$. In this case, however, the polarization\ndegree is much higher than the observed values.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}