{"id":"2407.16456","title":"Designing robust diffractive neural networks with improved transverse\n  shift tolerance","authors":"Daniil V. Soshnikov, Leonid L. Doskolovich, Georgy A. Motz, Egor V.\n  Byzov, Evgeni A. Bezus, Dmitry A. Bykov","authorsParsed":[["Soshnikov","Daniil V.",""],["Doskolovich","Leonid L.",""],["Motz","Georgy A.",""],["Byzov","Egor V.",""],["Bezus","Evgeni A.",""],["Bykov","Dmitry A.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 13:11:59 GMT"}],"updateDate":"2024-07-24","timestamp":1721740319000,"abstract":"  A wide range of practically important problems is nowadays efficiently solved\nusing artificial neural networks. This gave momentum to intensive development\nof their optical implementations, among which, the so-called diffractive neural\nnetworks (DNNs) constituted by a set of phase diffractive optical elements\n(DOEs) attract considerable research interest. In the practical implementation\nof DNNs, one of the standing problems is the requirement for high positioning\naccuracy of the DOEs. In this work, we address this problem and propose a\nmethod for the design of DNNs for image classification, which takes into\naccount the positioning errors (transverse shifts) of the DNN elements. In the\nmethod, the error of solving the classification problem is represented by a\nfunctional depending on the phase functions of the DOEs and on random vectors\ndescribing their transverse shifts. The mathematical expectation of this\nfunctional is used as an error functional in the gradient method for\ncalculating the DNN taking into account the transverse shifts of the DOEs. It\nis shown that the calculation of the derivatives of this functional corresponds\nto the DNN training method, in which the DOEs have random transverse shifts.\nUsing the proposed gradient method, DNNs are designed that are robust to\ntransverse shifts of the DOEs and enable solving the problem of classifying\nhandwritten digits at a visible wavelength. Numerical simulations demonstrate\ngood performance of the designed DNNs at transverse shifts of up to 17\nwavelengths.\n","subjects":["Physics/Optics","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}