{"id":"2407.11861","title":"What Makes a Meme a Meme? Identifying Memes for Memetics-Aware Dataset\n  Creation","authors":"Muzhaffar Hazman, Susan McKeever, Josephine Griffith","authorsParsed":[["Hazman","Muzhaffar",""],["McKeever","Susan",""],["Griffith","Josephine",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:48:36 GMT"}],"updateDate":"2024-07-17","timestamp":1721144916000,"abstract":"  Warning: This paper contains memes that may be offensive to some readers.\n  Multimodal Internet Memes are now a ubiquitous fixture in online discourse.\nOne strand of meme-based research is the classification of memes according to\nvarious affects, such as sentiment and hate, supported by manually compiled\nmeme datasets. Understanding the unique characteristics of memes is crucial for\nmeme classification. Unlike other user-generated content, memes spread via\nmemetics, i.e. the process by which memes are imitated and transformed into\nsymbols used to create new memes. In effect, there exists an ever-evolving pool\nof visual and linguistic symbols that underpin meme culture and are crucial to\ninterpreting the meaning of individual memes. The current approach of training\nsupervised learning models on static datasets, without taking memetics into\naccount, limits the depth and accuracy of meme interpretation. We argue that\nmeme datasets must contain genuine memes, as defined via memetics, so that\neffective meme classifiers can be built. In this work, we develop a meme\nidentification protocol which distinguishes meme from non-memetic content by\nrecognising the memetics within it. We apply our protocol to random samplings\nof the leading 7 meme classification datasets and observe that more than half\n(50. 4\\%) of the evaluated samples were found to contain no signs of memetics.\nOur work also provides a meme typology grounded in memetics, providing the\nbasis for more effective approaches to the interpretation of memes and the\ncreation of meme datasets.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"n0T0SKKHClFpZaoSEXw2ANPtPhJpRsdxuiWBsSG7gh0","pdfSize":"13184886"}
