{"id":"2407.00821","title":"Integrated modeling of boron powder injection for real-time\n  plasma-facing component conditioning","authors":"Florian Effenberg, Klaus Schmid, Federico Nespoli, Alessandro\n  Bortolon, Y\\\"uhe Feng, Brian A. Grierson, Jeremy D. Lore, Rajesh Maingi,\n  Dmitry L. Rudakov","authorsParsed":[["Effenberg","Florian",""],["Schmid","Klaus",""],["Nespoli","Federico",""],["Bortolon","Alessandro",""],["Feng","Yühe",""],["Grierson","Brian A.",""],["Lore","Jeremy D.",""],["Maingi","Rajesh",""],["Rudakov","Dmitry L.",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 20:32:18 GMT"},{"version":"v2","created":"Wed, 11 Sep 2024 19:35:22 GMT"}],"updateDate":"2024-09-13","timestamp":1719779538000,"abstract":"  An integrated modeling framework for investigating the application of solid\nboron powder injection for real-time surface conditioning of plasma-facing\ncomponents in tokamak environments is presented. Utilizing the DIII-D impurity\npowder dropper setup, this study simulates B powder injection scenarios ranging\nfrom mg/s to tens of mg/s, corresponding to B flux rates of $10^{20}-10^{21}$\nB/s in standard L-mode conditions. The comprehensive modeling approach combines\nEMC3-EIRENE for simulating the D plasma background and DIS for the ablation and\ntransport of the B powder particles. The results show substantial transport of\nB to the inboard lower divertor, predominantly influenced by the main ion\nplasma flow. The dependency on powder particle size (5-250 $\\mu$m) was found to\nbe insignificant for the scenario considered. The effects of erosion and\nredeposition were considered to reconcile the discrepancies with experimental\nobservations, which saw substantial deposition on the outer divertor PFCs. For\nthis purpose, the WallDYN3D code was updated to include B sources within the\nplasma domain and integrated into the modeling framework. The mixed-material\nmigration modeling shows evolving B deposition patterns, suggesting the\nformation of mixed B-C layers or predominantly B coverage depending on the\npowder mass flow rate. While the modeling outcomes at lower B injection rates\ntend to align with experimental observations, the prediction of near-pure B\nlayers at higher rates has yet to be experimentally verified in the C\nenvironment of the DIII-D tokamak. The extensive reach of B layers found in the\nmodeling suggests the need for modeling that encompasses the entire wall\ngeometry for more accurate experimental correlations. This integrated approach\nsets a precedent for analyzing and applying real-time in-situ boron coating\ntechniques in advanced tokamak scenarios, potentially extendable to ITER.\n","subjects":["Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}