{"id":"2407.09310","title":"Experimental verifiable multi-client blind quantum computing on a Qline\n  architecture","authors":"Beatrice Polacchi, Dominik Leichtle, Gonzalo Carvacho, Giorgio Milani,\n  Nicol\\`o Spagnolo, Marc Kaplan, Elham Kashefi, Fabio Sciarrino","authorsParsed":[["Polacchi","Beatrice",""],["Leichtle","Dominik",""],["Carvacho","Gonzalo",""],["Milani","Giorgio",""],["Spagnolo","Nicolò",""],["Kaplan","Marc",""],["Kashefi","Elham",""],["Sciarrino","Fabio",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 14:48:58 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 15:56:23 GMT"}],"updateDate":"2024-07-25","timestamp":1720795738000,"abstract":"  The exploitation of certification tools by end users represents a fundamental\naspect of the development of quantum technologies as the hardware scales up\nbeyond the regime of classical simulatability. Certifying quantum networks\nbecomes even more crucial when the privacy of their users is exposed to\nmalicious quantum nodes or servers as in the case of multi-client distributed\nblind quantum computing, where several clients delegate a joint private\ncomputation to remote quantum servers, such as federated quantum machine\nlearning. In such protocols, security must be provided not only by keeping data\nhidden but also by verifying that the server is correctly performing the\nrequested computation while minimizing the hardware assumptions on the employed\ndevices. Notably, standard verification techniques fail in scenarios where the\nclients receive quantum states from untrusted sources such as, for example, in\na recently demonstrated linear quantum network performing multi-client blind\nquantum computation. However, recent theoretical results provide techniques to\nverify blind quantum computations even in the case of untrusted state\npreparation. Equipped with such theoretical tools, in this work, we provide the\nfirst experimental implementation of a two-client verifiable blind quantum\ncomputing protocol in a distributed architecture. The obtained results\nrepresent novel perspectives for the verification of multi-tenant distributed\nquantum computation in large-scale networks.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}