{"id":"2407.08108","title":"CADC: Encoding User-Item Interactions for Compressing Recommendation\n  Model Training Data","authors":"Hossein Entezari Zarch, Abdulla Alshabanah, Chaoyi Jiang and Murali\n  Annavaram","authorsParsed":[["Zarch","Hossein Entezari",""],["Alshabanah","Abdulla",""],["Jiang","Chaoyi",""],["Annavaram","Murali",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 00:54:56 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 03:37:17 GMT"}],"updateDate":"2024-07-25","timestamp":1720659296000,"abstract":"  Deep learning recommendation models (DLRMs) are at the heart of the current\ne-commerce industry. However, the amount of training data used to train these\nlarge models is growing exponentially, leading to substantial training hurdles.\nThe training dataset contains two primary types of information: content-based\ninformation (features of users and items) and collaborative information\n(interactions between users and items). One approach to reduce the training\ndataset is to remove user-item interactions. But that significantly diminishes\ncollaborative information, which is crucial for maintaining accuracy due to its\ninclusion of interaction histories. This loss profoundly impacts DLRM\nperformance.\n  This paper makes an important observation that if one can capture the\nuser-item interaction history to enrich the user and item embeddings, then the\ninteraction history can be compressed without losing model accuracy. Thus, this\nwork, Collaborative Aware Data Compression (CADC), takes a two-step approach to\ntraining dataset compression. In the first step, we use matrix factorization of\nthe user-item interaction matrix to create a novel embedding representation for\nboth the users and items. Once the user and item embeddings are enriched by the\ninteraction history information the approach then applies uniform random\nsampling of the training dataset to drastically reduce the training dataset\nsize while minimizing model accuracy drop. The source code of CADC is available\nat\n\\href{https://anonymous.4open.science/r/DSS-RM-8C1D/README.md}{https://anonymous.4open.science/r/DSS-RM-8C1D/README.md}.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}