{"id":"2407.19482","title":"Bistability in spatiotemporal mode-locking with dynamic multimode gain","authors":"Zhijin Xiong, Yuankai Guo, Wei Lin, Hao Xiu, Yuncong Ma, Xuewen Chen,\n  Zhaoheng Liang, Lin Ling, Tao Liu, Xiaoming Wei and Zhongmin Yang","authorsParsed":[["Xiong","Zhijin",""],["Guo","Yuankai",""],["Lin","Wei",""],["Xiu","Hao",""],["Ma","Yuncong",""],["Chen","Xuewen",""],["Liang","Zhaoheng",""],["Ling","Lin",""],["Liu","Tao",""],["Wei","Xiaoming",""],["Yang","Zhongmin",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 12:25:42 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 06:48:01 GMT"}],"updateDate":"2024-07-31","timestamp":1722169542000,"abstract":"  Three-dimensional (3D) dissipative soliton existed in spatiotemporal\nmode-locked (STML) multimode fiber laser has been demonstrated to be a\npromising formalism for generating high-energy femtosecond pulses, which\nunfortunately exhibit diverse spatiotemporal dynamics that have not been fully\nunderstood. Completely modeling the STML multimode fiber lasers can shed new\nlight on the underlying physics of the spatiotemporal dynamics and thus better\nmanipulate the generation of high-quality energic femtosecond pulses, which\nhowever is still largely unmet. To this end, here we theoretically investigate\na dynamic multimode gain model of the STML multimode fiber laser by exploring\nthe multimode rate equation (MMRE) in the framework of generalized multimode\nnonlinear Schr\\\"odinger equation. Using this dynamic multimode gain model, the\nattractor dissection theory is revisited to understand the dominant effects\nthat determine the modal composition of 3D dissipative soliton. Specifically,\nby varying the numerical aperture of the multimode gain fiber (MMGF), different\ngain dynamics that correspond to distinct types of gain attractors are\nobserved. As a result, two distinguishing STML operation regimes, respectively\ngoverned by the multimode gain effect and spatiotemporal saturable absorption,\nare identified. In the latter regime, especially, 3D dissipative solitons\npresent bistability that there exist bifurcated solutions with two different\nlinearly polarized (LP) mode compositions. To verify the theoretical findings,\nthe experimental implementation shows that the state of STML can be switched\nbetween different LP modes, and confirms the presence of bistability.\nParticularly, the 3D-soliton shaping mechanism that is governed by the\nmultimode gain effect is testified for the first time, to the best of our\nknowledge.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}