{"id":"2407.00835","title":"Distributed Quantum Computing across an Optical Network Link","authors":"D. Main, P. Drmota, D. P. Nadlinger, E. M. Ainley, A. Agrawal, B. C.\n  Nichol, R. Srinivas, G. Araneda, D. M. Lucas","authorsParsed":[["Main","D.",""],["Drmota","P.",""],["Nadlinger","D. P.",""],["Ainley","E. M.",""],["Agrawal","A.",""],["Nichol","B. C.",""],["Srinivas","R.",""],["Araneda","G.",""],["Lucas","D. M.",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 21:32:10 GMT"}],"updateDate":"2024-07-02","timestamp":1719783130000,"abstract":"  Distributed quantum computing (DQC) combines the computing power of multiple\nnetworked quantum processing modules, enabling the execution of large quantum\ncircuits without compromising on performance and connectivity. Photonic\nnetworks are well-suited as a versatile and reconfigurable interconnect layer\nfor DQC; remote entanglement shared between matter qubits across the network\nenables all-to-all logical connectivity via quantum gate teleportation (QGT).\nFor a scalable DQC architecture, the QGT implementation must be deterministic\nand repeatable; until now, there has been no demonstration satisfying these\nrequirements. We experimentally demonstrate the distribution of quantum\ncomputations between two photonically interconnected trapped-ion modules. The\nmodules are separated by $\\sim$ 2 m, and each contains dedicated network and\ncircuit qubits. By using heralded remote entanglement between the network\nqubits, we deterministically teleport a controlled-Z gate between two circuit\nqubits in separate modules, achieving 86% fidelity. We then execute Grover's\nsearch algorithm - the first implementation of a distributed quantum algorithm\ncomprising multiple non-local two-qubit gates - and measure a 71% success rate.\nFurthermore, we implement distributed iSWAP and SWAP circuits, compiled with 2\nand 3 instances of QGT, respectively, demonstrating the ability to distribute\narbitrary two-qubit operations. As photons can be interfaced with a variety of\nsystems, this technique has applications extending beyond trapped-ion quantum\ncomputers, providing a viable pathway towards large-scale quantum computing for\na range of physical platforms.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}