{"id":"2407.13773","title":"OpenDataLab: Empowering General Artificial Intelligence with Open\n  Datasets","authors":"Conghui He, Wei Li, Zhenjiang Jin, Chao Xu, Bin Wang, Dahua Lin","authorsParsed":[["He","Conghui",""],["Li","Wei",""],["Jin","Zhenjiang",""],["Xu","Chao",""],["Wang","Bin",""],["Lin","Dahua",""]],"versions":[{"version":"v1","created":"Tue, 4 Jun 2024 10:42:01 GMT"}],"updateDate":"2024-07-22","timestamp":1717497721000,"abstract":"  The advancement of artificial intelligence (AI) hinges on the quality and\naccessibility of data, yet the current fragmentation and variability of data\nsources hinder efficient data utilization. The dispersion of data sources and\ndiversity of data formats often lead to inefficiencies in data retrieval and\nprocessing, significantly impeding the progress of AI research and\napplications. To address these challenges, this paper introduces OpenDataLab, a\nplatform designed to bridge the gap between diverse data sources and the need\nfor unified data processing. OpenDataLab integrates a wide range of open-source\nAI datasets and enhances data acquisition efficiency through intelligent\nquerying and high-speed downloading services. The platform employs a\nnext-generation AI Data Set Description Language (DSDL), which standardizes the\nrepresentation of multimodal and multi-format data, improving interoperability\nand reusability. Additionally, OpenDataLab optimizes data processing through\ntools that complement DSDL. By integrating data with unified data descriptions\nand smart data toolchains, OpenDataLab can improve data preparation efficiency\nby 30\\%. We anticipate that OpenDataLab will significantly boost artificial\ngeneral intelligence (AGI) research and facilitate advancements in related AI\nfields. For more detailed information, please visit the platform's official\nwebsite: https://opendatalab.com.\n","subjects":["Computing Research Repository/Digital Libraries","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}