{"id":"2407.12505","title":"Subequivariant Reinforcement Learning in 3D Multi-Entity Physical\n  Environments","authors":"Runfa Chen, Ling Wang, Yu Du, Tianrui Xue, Fuchun Sun, Jianwei Zhang,\n  Wenbing Huang","authorsParsed":[["Chen","Runfa",""],["Wang","Ling",""],["Du","Yu",""],["Xue","Tianrui",""],["Sun","Fuchun",""],["Zhang","Jianwei",""],["Huang","Wenbing",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 11:37:34 GMT"}],"updateDate":"2024-07-18","timestamp":1721216254000,"abstract":"  Learning policies for multi-entity systems in 3D environments is far more\ncomplicated against single-entity scenarios, due to the exponential expansion\nof the global state space as the number of entities increases. One potential\nsolution of alleviating the exponential complexity is dividing the global space\ninto independent local views that are invariant to transformations including\ntranslations and rotations. To this end, this paper proposes Subequivariant\nHierarchical Neural Networks (SHNN) to facilitate multi-entity policy learning.\nIn particular, SHNN first dynamically decouples the global space into local\nentity-level graphs via task assignment. Second, it leverages subequivariant\nmessage passing over the local entity-level graphs to devise local reference\nframes, remarkably compressing the representation redundancy, particularly in\ngravity-affected environments. Furthermore, to overcome the limitations of\nexisting benchmarks in capturing the subtleties of multi-entity systems under\nthe Euclidean symmetry, we propose the Multi-entity Benchmark (MEBEN), a new\nsuite of environments tailored for exploring a wide range of multi-entity\nreinforcement learning. Extensive experiments demonstrate significant\nadvancements of SHNN on the proposed benchmarks compared to existing methods.\nComprehensive ablations are conducted to verify the indispensability of task\nassignment and subequivariance.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}