{"id":"2407.11027","title":"A robust three-way classifier with shadowed granular-balls based on\n  justifiable granularity","authors":"Jie Yang, Lingyun Xiaodiao, Guoyin Wang, Witold Pedrycz, Shuyin Xia,\n  Qinghua Zhang, Di Wu","authorsParsed":[["Yang","Jie",""],["Xiaodiao","Lingyun",""],["Wang","Guoyin",""],["Pedrycz","Witold",""],["Xia","Shuyin",""],["Zhang","Qinghua",""],["Wu","Di",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 08:54:45 GMT"}],"updateDate":"2024-07-17","timestamp":1719996885000,"abstract":"  The granular-ball (GB)-based classifier introduced by Xia, exhibits\nadaptability in creating coarse-grained information granules for input, thereby\nenhancing its generality and flexibility. Nevertheless, the current GB-based\nclassifiers rigidly assign a specific class label to each data instance and\nlacks of the necessary strategies to address uncertain instances. These\nfar-fetched certain classification approachs toward uncertain instances may\nsuffer considerable risks. To solve this problem, we construct a robust\nthree-way classifier with shadowed GBs for uncertain data. Firstly, combine\nwith information entropy, we propose an enhanced GB generation method with the\nprinciple of justifiable granularity. Subsequently, based on minimum\nuncertainty, a shadowed mapping is utilized to partition a GB into Core region,\nImportant region and Unessential region. Based on the constructed shadowed GBs,\nwe establish a three-way classifier to categorize data instances into certain\nclasses and uncertain case. Finally, extensive comparative experiments are\nconducted with 2 three-way classifiers, 3 state-of-the-art GB-based\nclassifiers, and 3 classical machine learning classifiers on 12 public\nbenchmark datasets. The results show that our model demonstrates robustness in\nmanaging uncertain data and effectively mitigates classification risks.\nFurthermore, our model almost outperforms the other comparison methods in both\neffectiveness and efficiency.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}