{"id":"2407.12976","title":"Design, Fabrication, and Characterization of a User-Friendly\n  Microfluidic Device for Studying Liver Zonation-on-Chip (ZoC)","authors":"Reza Mahdavi, Sameereh Hashemi Najafabadi, Mohammad Adel Ghiass, Silmu\n  Valaskivi, Hannu V\\\"alim\\\"aki, Joose Kreutzer, Charlotte Hamngren Blomqvist,\n  Stefano Romeo, Pasi Kallio, Caroline Beck Adiels","authorsParsed":[["Mahdavi","Reza",""],["Najafabadi","Sameereh Hashemi",""],["Ghiass","Mohammad Adel",""],["Valaskivi","Silmu",""],["Välimäki","Hannu",""],["Kreutzer","Joose",""],["Blomqvist","Charlotte Hamngren",""],["Romeo","Stefano",""],["Kallio","Pasi",""],["Adiels","Caroline Beck",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 19:46:48 GMT"}],"updateDate":"2024-07-19","timestamp":1721245608000,"abstract":"  Liver zonation is a fundamental characteristic of hepatocyte spatial\nheterogeneity, which is challenging to recapitulate in traditional cell\ncultures. This study presents a novel microfluidic device designed to induce\nzonation in liver cell cultures by establishing an oxygen gradient using\nstandard laboratory gases. The device consists of two layers; a bottom layer\ncontaining a gas channel network that delivers high and low oxygenated gases to\ncreate three distinct zones within the cell culture chamber in the layer above.\nComputational simulations and ratiometric oxygen sensing were employed to\nvalidate the oxygen gradient, demonstrating that stable oxygen levels were\nachieved within two hours. Liver zonation was confirmed using\nimmunofluorescence staining, which showed zonated albumin production in HepG2\ncells directly correlating with oxygen levels and mimicking in-vivo zonation\nbehavior. This user-friendly device supports studies on liver zonation and\nrelated metabolic disease mechanisms in vitro. It can also be utilized for\nexperiments that necessitate precise gas concentration gradients, such as\nhypoxia-related research areas focused on angiogenesis and cancer development.\n","subjects":["Quantitative Biology/Tissues and Organs"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qObzX8sfiFF1XnlN_cwWMg6WsqQ2APQYx-fv9KTyeHk","pdfSize":"1396320"}
