{"id":"2407.09060","title":"Reference CC3 Excitation Energies for Organic Chromophores: Benchmarking\n  TD-DFT, BSE/$GW$ and Wave Function Methods","authors":"Iryna Knysh and Filippo Lipparini and Aymeric Blondel and Ivan\n  Duchemin and Xavier Blase and Pierre-Fran\\c{c}ois Loos and Denis Jacquemin","authorsParsed":[["Knysh","Iryna",""],["Lipparini","Filippo",""],["Blondel","Aymeric",""],["Duchemin","Ivan",""],["Blase","Xavier",""],["Loos","Pierre-François",""],["Jacquemin","Denis",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 07:28:27 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 13:08:15 GMT"}],"updateDate":"2024-08-27","timestamp":1720769307000,"abstract":"  To expand the QUEST database of highly-accurate vertical transition energies,\nwe consider a series of large organic chromogens ubiquitous in dye chemistry,\nsuch as anthraquinone, azobenzene, BODIPY, and naphthalimide. We compute, at\nthe CC3 level of theory, the singlet and triplet vertical transition energies\nassociated with the low-lying excited states. This leads to a collection of\nmore than 120 new highly-accurate excitation energies. Subsequently, we employ\nthese reference values to benchmark a series of lower-order wave function\napproaches, including the popular ADC(2) and CC2 schemes, as well as\ntime-dependent density-functional theory (TD-DFT), both with and without\napplying the Tamm-Dancoff approximation (TDA). At the TD-DFT level, we evaluate\na large panel of global, range-separated, local, and double hybrid functionals.\nAdditionally, we assess the performance of the Bethe-Salpeter equation (BSE)\nformalism relying on both $G_0W_0$ and ev$GW$ quasiparticle energies evaluated\nfrom various starting points. It turns out that CC2 and ADC(2.5) are the most\naccurate models amongst those with respective $\\mathcal{O}(N^5)$ and\n$\\mathcal{O}(N^6)$ scalings with system size. In contrast, CCSD does not\noutperform CC2. The best performing exchange-correlation functionals include\nBMK, M06-2X, M06-SX, CAM-B3LYP, $\\omega$B97X-D, and LH20t, with average\ndeviations of approximately 0.20 eV or slightly below. Errors on vertical\nexcitation energies can be further reduced by considering double hybrids. Both\nSOS-$\\omega$B88PP86 and SOS-$\\omega$PBEPP86 exhibit particularly attractive\nperformances with overall quality on par with CC2, whereas PBE0-DH and PBE-QIDH\nare only slightly less efficient. BSE/ev$GW$ calculations based on Kohn-Sham\nstarting points have been found to be particularly effective for singlet\ntransitions, but much less for their triplet counterparts.\n","subjects":["Physics/Chemical Physics","Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}