{"id":"2407.13828","title":"Anisotropic charge transport in strongly magnetized relativistic matter","authors":"Ritesh Ghosh and Igor A. Shovkovy","authorsParsed":[["Ghosh","Ritesh",""],["Shovkovy","Igor A.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 18:00:45 GMT"}],"updateDate":"2024-07-22","timestamp":1721325645000,"abstract":"  We investigate electrical charge transport in hot magnetized plasma using\nfirst-principles quantum field theoretical methods. By employing Kubo's linear\nresponse theory, we express the electrical conductivity tensor in terms of the\nfermion damping rate in the Landau-level representation. Utilizing\nleading-order results for the damping rates from a recent study within a gauge\ntheory, we derive the transverse and longitudinal conductivities for a strongly\nmagnetized plasma. The analytical expressions reveal drastically different\nmechanisms that explain the high anisotropy of charge transport in a magnetized\nplasma. Specifically, the transverse conductivity is suppressed, while the\nlongitudinal conductivity is enhanced by a strong magnetic field. As in the\ncase of zero magnetic field, longitudinal conduction is determined by the\nprobability of charge carriers to remain in their quantum states without\ndamping. In contrast, transverse conduction critically relies on quantum\ntransitions between Landau levels, effectively lifting charge trapping in\nlocalized Landau orbits. We examine the temperature and magnetic field\ndependence of the transverse and longitudinal electrical conductivities over a\nwide range of parameters and investigate the effects of a nonzero chemical\npotential. Additionally, we extend our analysis to strongly coupled quark-gluon\nplasma and study the impact of the coupling constant on the anisotropy of\nelectrical charge transport.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Raw32LiSxxvMre0u7YTYHU1YmJh95yLJSliUiuOlGBU","pdfSize":"1153435"}
