{"id":"2407.01129","title":"RMS-FlowNet++: Efficient and Robust Multi-Scale Scene Flow Estimation\n  for Large-Scale Point Clouds","authors":"Ramy Battrawy, Ren\\'e Schuster and Didier Stricker","authorsParsed":[["Battrawy","Ramy",""],["Schuster","René",""],["Stricker","Didier",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 09:51:17 GMT"}],"updateDate":"2024-07-02","timestamp":1719827477000,"abstract":"  The proposed RMS-FlowNet++ is a novel end-to-end learning-based architecture\nfor accurate and efficient scene flow estimation that can operate on\nhigh-density point clouds. For hierarchical scene f low estimation, existing\nmethods rely on expensive Farthest-Point-Sampling (FPS) to sample the scenes,\nmust find large correspondence sets across the consecutive frames and/or must\nsearch for correspondences at a full input resolution. While this can improve\nthe accuracy, it reduces the overall efficiency of these methods and limits\ntheir ability to handle large numbers of points due to memory requirements. In\ncontrast to these methods, our architecture is based on an efficient design for\nhierarchical prediction of multi-scale scene flow. To this end, we develop a\nspecial flow embedding block that has two advantages over the current methods:\nFirst, a smaller correspondence set is used, and second, the use of\nRandom-Sampling (RS) is possible. In addition, our architecture does not need\nto search for correspondences at a full input resolution. Exhibiting high\naccuracy, our RMS-FlowNet++ provides a faster prediction than state-of-the-art\nmethods, avoids high memory requirements and enables efficient scene flow on\ndense point clouds of more than 250K points at once. Our comprehensive\nexperiments verify the accuracy of RMS FlowNet++ on the established\nFlyingThings3D data set with different point cloud densities and validate our\ndesign choices. Furthermore, we demonstrate that our model has a competitive\nability to generalize to the real-world scenes of the KITTI data set without\nfine-tuning.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}