{"id":"2407.14097","title":"On the Robustness of Fully-Spiking Neural Networks in Open-World\n  Scenarios using Forward-Only Learning Algorithms","authors":"Erik B. Terres-Escudero, Javier Del Ser, Aitor Mart\\'inez-Seras, Pablo\n  Garcia-Bringas","authorsParsed":[["Terres-Escudero","Erik B.",""],["Del Ser","Javier",""],["Martínez-Seras","Aitor",""],["Garcia-Bringas","Pablo",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 08:08:17 GMT"}],"updateDate":"2024-07-22","timestamp":1721376497000,"abstract":"  In the last decade, Artificial Intelligence (AI) models have rapidly\nintegrated into production pipelines propelled by their excellent modeling\nperformance. However, the development of these models has not been matched by\nadvancements in algorithms ensuring their safety, failing to guarantee robust\nbehavior against Out-of-Distribution (OoD) inputs outside their learning\ndomain. Furthermore, there is a growing concern with the sustainability of AI\nmodels and their required energy consumption in both training and inference\nphases. To mitigate these issues, this work explores the use of the\nForward-Forward Algorithm (FFA), a biologically plausible alternative to\nBackpropagation, adapted to the spiking domain to enhance the overall energy\nefficiency of the model. By capitalizing on the highly expressive topology\nemerging from the latent space of models trained with FFA, we develop a novel\nFF-SCP algorithm for OoD Detection. Our approach measures the likelihood of a\nsample belonging to the in-distribution (ID) data by using the distance from\nthe latent representation of samples to class-representative manifolds.\nAdditionally, to provide deeper insights into our OoD pipeline, we propose a\ngradient-free attribution technique that highlights the features of a sample\npushing it away from the distribution of any class. Multiple experiments using\nour spiking FFA adaptation demonstrate that the achieved accuracy levels are\ncomparable to those seen in analog networks trained via back-propagation.\nFurthermore, OoD detection experiments on multiple datasets prove that FF-SCP\noutperforms avant-garde OoD detectors within the spiking domain in terms of\nseveral metrics used in this area. We also present a qualitative analysis of\nour explainability technique, exposing the precision by which the method\ndetects OoD features, such as embedded artifacts or missing regions.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}