{"id":"2407.02149","title":"Magnetic critical phenomena and low temperature re-entrant spin-glass\n  features of Al$_2$MnFe Heusler alloy","authors":"Abhinav Kumar Khorwal, Sujoy Saha, Mukesh Verma, Lalita Saini, Suvigya\n  Kaushik, Yugandhar Bitla, Alexey V. Lukoyanov, and Ajit K. Patra","authorsParsed":[["Khorwal","Abhinav Kumar",""],["Saha","Sujoy",""],["Verma","Mukesh",""],["Saini","Lalita",""],["Kaushik","Suvigya",""],["Bitla","Yugandhar",""],["Lukoyanov","Alexey V.",""],["Patra","Ajit K.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 10:47:07 GMT"}],"updateDate":"2024-07-03","timestamp":1719917227000,"abstract":"  A detailed investigation of the structural and magnetic properties, including\nmagnetocaloric effect, re-entrant spin-glass behavior at low temperature, and\ncritical behavior in polycrystalline Al$_2$MnFe Heusler alloy is reported. The\nprepared alloy crystallizes in a cubic CsCl-type crystal structure with Pm-3m\nspace group. The temperature-dependent magnetization data reveals a\nsecond-order paramagnetic to ferromagnetic phase transition ($\\sim$ 122.9 K),\nwhich is further supported by the analysis of the magnetocaloric effect. The\nisothermal magnetization loops show a soft ferromagnetic behavior of the\nstudied alloy and also reveal an itinerant character of the underlying exchange\ninteractions. In order to understand the nature of magnetic interactions, the\ncritical exponents for spontaneous magnetization, initial magnetic\nsusceptibility, and critical MH isotherm are determined using Modified Arrott\nplots, Kouvel-Fisher plots, and critical isotherm analysis. The derived\ncritical exponents $\\beta$ = 0.363(2), $\\gamma$ = 1.384(3), and $\\delta$ =\n4.81(3) confirm the critical behavior similar to that of a 3D-Heisenberg-type\nferromagnet with short-range exchange interactions that are found to decay with\ndistance as J(r) $\\approx$ r$^{-4.936}$. Moreover, the detailed analysis of the\nAC susceptibility data suggests that the frequency-dependent shifting of the\npeak temperatures is well explained using standard dynamic scaling laws such as\nthe critical slowing down model and Vogel-Fulcher law, and confirms the\nsignature of re-entrant spin-glass features in Al$_2$MnFe Heusler alloy.\nFurthermore, maximum magnetic entropy change of $\\sim$ 1.92 J/kg-K and relative\ncooling power of $\\sim$ 496 J/kg at 50 kOe applied magnetic field are\ndetermined from magnetocaloric studies that are comparable to those of other\nMn-Fe-Al systems.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PLK5m9cQY_pCfLx62zUviJz4T_0zEjGu2X6v27QDP2M","pdfSize":"15475378","objectId":"0x4baa6c5ec9dd3da55c5559e5ca9c85a320e5174a69203193dddf39babbb2c947","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
