{"id":"2407.17925","title":"Fractals and spontaneous symmetry breaking with type-B Goldstone modes:\n  a perspective from entanglement","authors":"Huan-Qiang Zhou, Qian-Qian Shi, John O. Fj{\\ae}restad, Ian P.\n  McCulloch","authorsParsed":[["Zhou","Huan-Qiang",""],["Shi","Qian-Qian",""],["Fjærestad","John O.",""],["McCulloch","Ian P.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 10:24:11 GMT"}],"updateDate":"2024-07-26","timestamp":1721903051000,"abstract":"  The one-dimensional spin-$s$ ${\\rm SU}(2)$ ferromagnetic Heisenberg model, as\na paradigmatic example for spontaneous symmetry breaking (SSB) with type-B\nGoldstone modes (GMs), is expected to exhibit an abstract fractal underlying\nthe ground state subspace. This intrinsic abstract fractal is here revealed\nfrom a systematic investigation into the entanglement entropy for a linear\ncombination of factorized (unentangled) ground states on a fractal decomposable\ninto a set of the Cantor sets. The entanglement entropy scales logarithmically\nwith the block size, with the prefactor being half the fractal dimension of a\nfractal, as long as the norm for the linear combination scales as the square\nroot of the number of the self-similar building blocks kept at each step $k$\nfor a fractal, under an assumption that the maximum absolute value of the\ncoefficients in the linear combination is chosen to be around one, and the\ncoefficients in the linear combination are almost constants within the building\nblocks. Actually, the set of the fractal dimensions for all the Cantor sets\nforms a {\\it dense} subset in the interval $[0,1]$. As a consequence, the\nground state subspace is separated into a disjoint union of countably\ninfinitely many regions, each of which is labeled by a decomposable fractal.\nHence, the interpretation of the prefactor as half the fractal dimension is\nvalid for any support beyond a fractal, which in turn leads to the\nidentification of the fractal dimension with the number of type-B GMs for the\northonormal basis states. Our argument may be extended to any quantum many-body\nsystems undergoing SSB with type-B GMs.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}