{"id":"2407.10261","title":"Design and optimization of a hadronic calorimeter based on micropattern\n  gaseous detectors for a future experiment at the Muon Collider","authors":"Antonello Pellecchia and Marco Buonsante and Maryna Borysova and Anna\n  Colaleo and Maria Teresa Camerlingo and Luigi Longo and Mauro Iodice and\n  Marcello Maggi and Luca Moleri and Raffaella Radogna and Givi Sekhniaidze and\n  Federica Maria Simone and Anna Stamerra and Rosamaria Venditti and Piet\n  Verwilligen and Darina Zavazieva and Angela Zaza","authorsParsed":[["Pellecchia","Antonello",""],["Buonsante","Marco",""],["Borysova","Maryna",""],["Colaleo","Anna",""],["Camerlingo","Maria Teresa",""],["Longo","Luigi",""],["Iodice","Mauro",""],["Maggi","Marcello",""],["Moleri","Luca",""],["Radogna","Raffaella",""],["Sekhniaidze","Givi",""],["Simone","Federica Maria",""],["Stamerra","Anna",""],["Venditti","Rosamaria",""],["Verwilligen","Piet",""],["Zavazieva","Darina",""],["Zaza","Angela",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 15:58:57 GMT"}],"updateDate":"2024-07-16","timestamp":1720972737000,"abstract":"  Micro-pattern gaseous detectors (MPGDs) are a promising readout technology\nfor hadronic calorimeters (HCAL) thanks to their good space resolution,\nlongevity and rate capability. We describe the development of a HCAL based on\nMPGDs for an experiment at the proposed Muon Collider. The design of a\nsemi-digital MPGD-HCAL is shown and its performance is calculated with Monte\nCarlo simulations with high-energy pions, showing an energy resolution down to\n8\\% for \\SI{80}{\\giga\\eV} pions. We also present the performance of twelve MPGD\nprototypes with different technologies (MicroMegas, $\\mu$-RWELL and RPWELL)\nassembled and operated in test beam first with high-energy muons and later with\npions in a hadronic calorimeter prototype of $\\sim1\\,\\lambda_\\text{I}$ length;\nthe detectors have a good response uniformity (lower than 17\\%) and space\nresolution and their performance in the calorimeter shows very good agreement\nwith the Monte Carlo shower calculation.\n","subjects":["Physics/Instrumentation and Detectors"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}