{"id":"2407.14344","title":"LLMs left, right, and center: Assessing GPT's capabilities to label\n  political bias from web domains","authors":"Raphael Hernandes","authorsParsed":[["Hernandes","Raphael",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 14:28:07 GMT"}],"updateDate":"2024-07-22","timestamp":1721399287000,"abstract":"  This research investigates whether OpenAI's GPT-4, a state-of-the-art large\nlanguage model, can accurately classify the political bias of news sources\nbased solely on their URLs. Given the subjective nature of political labels,\nthird-party bias ratings like those from Ad Fontes Media, AllSides, and Media\nBias/Fact Check (MBFC) are often used in research to analyze news source\ndiversity. This study aims to determine if GPT-4 can replicate these human\nratings on a seven-degree scale (\"far-left\" to \"far-right\"). The analysis\ncompares GPT-4's classifications against MBFC's, and controls for website\npopularity using Open PageRank scores. Findings reveal a high correlation\n($\\text{Spearman's } \\rho = .89$, $n = 5,877$, $p < 0.001$) between GPT-4's and\nMBFC's ratings, indicating the model's potential reliability. However, GPT-4\nabstained from classifying approximately $\\frac{2}{3}$ of the dataset,\nparticularly less popular and less biased sources. The study also identifies a\nslight leftward skew in GPT-4's classifications compared to MBFC's. The\nanalysis suggests that while GPT-4 can be a scalable, cost-effective tool for\npolitical bias classification of news websites, but its use should complement\nhuman judgment to mitigate biases. Further research is recommended to explore\nthe model's performance across different settings, languages, and additional\ndatasets.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xmhpBVvspbQ8Lf5KD_lMlZ_ByimUGOPeV37Mg15fM7c","pdfSize":"476638"}
