{"id":"2407.18945","title":"CogNarr Ecosystem: Facilitating Group Cognition at Scale","authors":"John C. Boik","authorsParsed":[["Boik","John C.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 08:59:17 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 20:58:18 GMT"}],"updateDate":"2024-08-02","timestamp":1720688357000,"abstract":"  Human groups of all sizes and kinds engage in deliberation, problem solving,\nstrategizing, decision making, and more generally, cognition. Some groups are\nlarge, and that setting presents unique challenges. The small-group setting\noften involves face-to-face dialogue, but group cognition in the large-group\nsetting typically requires some form of online interaction. New approaches are\nneeded to facilitate the kind of rich communication and information processing\nthat are required for effective, functional cognition in the online setting,\nespecially for groups characterized by thousands to millions of participants\nwho wish to share potentially complex, nuanced, and dynamic perspectives. This\nconcept paper proposes the CogNarr (Cognitive Narrative) ecosystem, which is\ndesigned to facilitate functional cognition in the large-group setting. The\npaper's contribution is a novel vision as to how recent developments in\ncognitive science, artificial intelligence, natural language processing, and\nrelated fields might be scaled and applied to large-group cognition, using an\napproach that itself promotes further scientific advancement. A key perspective\nis to view a group as an organism that uses some form of cognitive architecture\nto sense the world, process information, remember, learn, predict, make\ndecisions, and adapt to changing conditions. The CogNarr ecosystem is designed\nto serve as a component within that architecture.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"To7xbMgYxNTbUmbA_V6r2Kh9hDOw_LSNA0EqRiX5Mas","pdfSize":"820945"}
