{"id":"2407.13010","title":"A Resolution Independent Neural Operator","authors":"Bahador Bahmani, Somdatta Goswami, Ioannis G. Kevrekidis, Michael D.\n  Shields","authorsParsed":[["Bahmani","Bahador",""],["Goswami","Somdatta",""],["Kevrekidis","Ioannis G.",""],["Shields","Michael D.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 21:03:21 GMT"}],"updateDate":"2024-07-19","timestamp":1721250201000,"abstract":"  The Deep operator network (DeepONet) is a powerful yet simple neural operator\narchitecture that utilizes two deep neural networks to learn mappings between\ninfinite-dimensional function spaces. This architecture is highly flexible,\nallowing the evaluation of the solution field at any location within the\ndesired domain. However, it imposes a strict constraint on the input space,\nrequiring all input functions to be discretized at the same locations; this\nlimits its practical applications. In this work, we introduce a Resolution\nIndependent Neural Operator (RINO) that provides a framework to make DeepONet\nresolution-independent, enabling it to handle input functions that are\narbitrarily, but sufficiently finely, discretized. To this end, we propose a\ndictionary learning algorithm to adaptively learn a set of appropriate\ncontinuous basis functions, parameterized as implicit neural representations\n(INRs), from the input data. These basis functions are then used to project\narbitrary input function data as a point cloud onto an embedding space (i.e., a\nvector space of finite dimensions) with dimensionality equal to the dictionary\nsize, which can be directly used by DeepONet without any architectural changes.\nIn particular, we utilize sinusoidal representation networks (SIRENs) as our\ntrainable INR basis functions. We demonstrate the robustness and applicability\nof RINO in handling arbitrarily (but sufficiently richly) sampled input\nfunctions during both training and inference through several numerical\nexamples.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computational Engineering, Finance, and Science","Physics/Computational Physics","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7xuYuqvjZ79cXXsN3hZMsUKI_0ueZ9TWgVPNxEfLk00","pdfSize":"3893410"}
