{"id":"2407.13644","title":"Conformal Wide-Angle Scanning Leaky-Wave Antenna for V-Band On-Body\n  Applications","authors":"Pratik Vadher, Anja K. Skrivervik, Qihang Zeng, Ronan Sauleau, John S.\n  Ho, Giulia Sacco, Denys Nikolayev","authorsParsed":[["Vadher","Pratik",""],["Skrivervik","Anja K.",""],["Zeng","Qihang",""],["Sauleau","Ronan",""],["Ho","John S.",""],["Sacco","Giulia",""],["Nikolayev","Denys",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:21:33 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 09:18:42 GMT"}],"updateDate":"2024-09-13","timestamp":1721319693000,"abstract":"  Wearable on-body millimeter-wave (mmWave) radars can provide obstacle\ndetection and guidance for visually impaired people. However, their everyday\nperformance is hindered by the rigid form factor and limited scanning range. In\nthis article, we propose a low-profile, fast-scanning leaky-wave antenna (LWA)\noperating in the unlicensed V-band (57-64 GHz) to be integrated for on-body\napplications such as lightweight portable frequency-modulated continuous wave\n(FMCW) radars. The proposed LWA consists of meandering microstrips that can\nconform to the human body curvatures while maintaining beam-forming and\nbeam-scanning properties. Experimental results demonstrate that the planar LWA\nachieves a realized gain above 10 dB with a fan-beam steering range in the\nH-plane from -40{\\deg} to 43{\\deg} over the operating frequency band while the\nhalf power beam-width (HPBW) is within 20{\\deg}. Since for the foreseen\napplication the antenna is supposed to conform to the user's body, the\nperformance is also analyzed for a bent condition. The beam steering range\nchanges to -32{\\deg} to 50{\\deg} when placed on the knee (corresponding to 80\nmm radius). Under bending conditions, the LWA exhibits a maximum degradation of\n1.75 dB, while the HPBW increases to 25{\\deg}. This shows that due to the small\nsize of the antenna, the impact of bending is low and the beam-forming and\nbeam-scanning property of the designed LWA remain intact. Furthermore, we\nenable 2-D spatial scanning by employing an array of twelve LWAs with phased\nexcitation, extending the scanning range in the E-plane from -40{\\deg} to\n40{\\deg}, while the HPBW remains below 20{\\deg} across the operational\nfrequency range.\n","subjects":["Physics/Applied Physics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Zuch3TRxYtZvuSALv_KMVt1CedvpRCe4N-r8skpcDyU","pdfSize":"35039756"}
