{"id":"2407.14161","title":"Efficient and Safe Contact-rich pHRI via Subtask Detection and Motion\n  Estimation using Deep Learning","authors":"Pouya P. Niaz, Engin Erzin, Cagatay Basdogan","authorsParsed":[["Niaz","Pouya P.",""],["Erzin","Engin",""],["Basdogan","Cagatay",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 09:44:51 GMT"}],"updateDate":"2024-07-22","timestamp":1721382291000,"abstract":"  This paper proposes an adaptive admittance controller for improving\nefficiency and safety in physical human-robot interaction (pHRI) tasks in\nsmall-batch manufacturing that involve contact with stiff environments, such as\ndrilling, polishing, cutting, etc. We aim to minimize human effort and task\ncompletion time while maximizing precision and stability during the contact of\nthe machine tool attached to the robot's end-effector with the workpiece. To\nthis end, a two-layered learning-based human intention recognition mechanism is\nproposed, utilizing only the kinematic and kinetic data from the robot and two\nforce sensors. A ``subtask detector\" recognizes the human intent by estimating\nwhich phase of the task is being performed, e.g., \\textit{Idle},\n\\textit{Tool-Attachment}, \\textit{Driving}, and \\textit{Contact}.\nSimultaneously, a ``motion estimator\" continuously quantifies intent more\nprecisely during the \\textit{Driving} to predict when \\textit{Contact} will\nbegin. The controller is adapted online according to the subtask while allowing\nearly adaptation before the \\textit{Contact} to maximize precision and safety\nand prevent potential instabilities. Three sets of pHRI experiments were\nperformed with multiple subjects under various conditions. Spring compression\nexperiments were performed in virtual environments to train the data-driven\nmodels and validate the proposed adaptive system, and drilling experiments were\nperformed in the physical world to test the proposed methods' efficacy in\nreal-life scenarios. Experimental results show subtask classification accuracy\nof 84\\% and motion estimation R\\textsuperscript{2} score of 0.96. Furthermore,\n57\\% lower human effort was achieved during \\textit{Driving} as well as 53\\%\nlower oscillation amplitude at \\textit{Contact} as a result of the proposed\nsystem.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"W9JboznZx9whUWBD-HGHE076shSardIMDGJQ5fUMbj4","pdfSize":"5426506"}
