{"id":"2407.01797","title":"Empirical Determination of Baseball Eras: Multivariate Changepoint\n  Analysis in Major League Baseball","authors":"Mena CR Whalen, Gregory J Matthews, and Brain M Mills","authorsParsed":[["Whalen","Mena CR",""],["Matthews","Gregory J",""],["Mills","Brain M",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 20:47:48 GMT"}],"updateDate":"2024-07-03","timestamp":1719866868000,"abstract":"  We use multivariate change point analysis methods, to identify not only mean\nshifts but also changes in variance across a wide array of statistical time\nseries. Our primary objective is to empirically discern distinct eras in the\nevolution of baseball, shedding light on significant transformations in team\nperformance and management strategies. We leverage a rich dataset comprising\nbaseball statistics from the late 1800s to 2020, spanning over a century of the\nsport's history. Results confirm previous historical research, pinpointing\nwell-known baseball eras, such as the Dead Ball Era, Integration Era, Steroid\nEra, and Post-Steroid Era. Moreover, the study delves into the detection of\nsubstantial changes in team performance, effectively identifying periods of\nboth dynasties and collapses within a team's history. The multivariate change\npoint analysis proves to be a valuable tool for understanding the intricate\ndynamics of baseball's evolution. The method offers a data-driven approach to\nunveil structural shifts in the sport's historical landscape, providing fresh\ninsights into the impact of rule changes, player strategies, and external\nfactors on baseball's evolution. This not only enhances our comprehension of\nbaseball, showing more robust identification of eras than past univariate time\nseries work, but also showcases the broader applicability of multivariate\nchange point analysis in the domain of sports research and beyond.\n","subjects":["Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}