{"id":"2407.07254","title":"HAMIL-QA: Hierarchical Approach to Multiple Instance Learning for Atrial\n  LGE MRI Quality Assessment","authors":"K M Arefeen Sultan, Md Hasibul Husain Hisham, Benjamin Orkild, Alan\n  Morris, Eugene Kholmovski, Erik Bieging, Eugene Kwan, Ravi Ranjan, Ed\n  DiBella, Shireen Elhabian","authorsParsed":[["Sultan","K M Arefeen",""],["Hisham","Md Hasibul Husain",""],["Orkild","Benjamin",""],["Morris","Alan",""],["Kholmovski","Eugene",""],["Bieging","Erik",""],["Kwan","Eugene",""],["Ranjan","Ravi",""],["DiBella","Ed",""],["Elhabian","Shireen",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 22:19:21 GMT"}],"updateDate":"2024-07-11","timestamp":1720563561000,"abstract":"  The accurate evaluation of left atrial fibrosis via high-quality 3D Late\nGadolinium Enhancement (LGE) MRI is crucial for atrial fibrillation management\nbut is hindered by factors like patient movement and imaging variability. The\npursuit of automated LGE MRI quality assessment is critical for enhancing\ndiagnostic accuracy, standardizing evaluations, and improving patient outcomes.\nThe deep learning models aimed at automating this process face significant\nchallenges due to the scarcity of expert annotations, high computational costs,\nand the need to capture subtle diagnostic details in highly variable images.\nThis study introduces HAMIL-QA, a multiple instance learning (MIL) framework,\ndesigned to overcome these obstacles. HAMIL-QA employs a hierarchical bag and\nsub-bag structure that allows for targeted analysis within sub-bags and\naggregates insights at the volume level. This hierarchical MIL approach reduces\nreliance on extensive annotations, lessens computational load, and ensures\nclinically relevant quality predictions by focusing on diagnostically critical\nimage features. Our experiments show that HAMIL-QA surpasses existing MIL\nmethods and traditional supervised approaches in accuracy, AUROC, and F1-Score\non an LGE MRI scan dataset, demonstrating its potential as a scalable solution\nfor LGE MRI quality assessment automation. The code is available at:\n$\\href{https://github.com/arf111/HAMIL-QA}{\\text{this https URL}}$\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}