{"id":"2407.13542","title":"Multi-stage tomography based on eigenanalysis for high-dimensional dense\n  unitary quantum processes","authors":"Yannick Deville, Alain Deville","authorsParsed":[["Deville","Yannick",""],["Deville","Alain",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 14:18:23 GMT"}],"updateDate":"2024-07-19","timestamp":1721312303000,"abstract":"  Quantum Process Tomography (QPT) methods aim at identifying, i.e. estimating,\na quantum process. QPT is a major quantum information processing tool, since it\nespecially allows one to experimentally characterize the actual behavior of\nquantum gates, that may be used as the building blocks of quantum computers. We\nhere consider unitary, possibly dense (i.e. without sparsity constraints)\nprocesses, which corresponds to isolated systems. Moreover, we aim at\ndeveloping QPT methods that are applicable to a significant number of qubits\nand hence to a high state space dimension, which allows one to tackle more\ncomplex problems. Using the unitarity of the process allows us to develop\nmethods that first achieve part of QPT by performing an eigenanalysis of the\nestimated density matrix of a process output. Building upon this idea, we first\ndevelop a class of complete algorithms that are single-stage, i.e. that use\nonly one eigendecomposition. We then extend them to multiple-stage algorithms\n(i.e. with several eigendecompositions), in order to address high-dimensional\nstate spaces while being less limited by the estimation errors made when using\nan arbitrary given Quantum State Tomography (QST) algorithm as a building block\nof our overall methods. We first propose two-stage methods and we then extend\nthem to dichotomic methods, whose number of stages increases with the\nconsidered state space dimension. The relevance of our methods is validated by\nmeans of simulations. Single-stage and two-stage methods first yield the\nfollowing results. Just running them with standard PC and software already\nmakes it possible to evaluate their performance for up to 13 qubits, i.e. with\nstate space dimensions up to a few thousands. This shows their attractiveness\nin terms of accuracy and proves that they solve the core of the dense QPT\nproblem in a very limited time frame. For other test results, see the paper.\n","subjects":["Physics/Quantum Physics","Physics/Data Analysis, Statistics and Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}