{"id":"2407.06972","title":"Microsoft Cloud-based Digitization Workflow with Rich Metadata\n  Acquisition for Cultural Heritage Objects","authors":"Krzysztof Kutt (1), Jakub Gomu{\\l}ka (2), Luiz do Valle Miranda (1),\n  Grzegorz J. Nalepa (1) ((1) Jagiellonian University, (2) AGH University of\n  Krakow)","authorsParsed":[["Kutt","Krzysztof",""],["Gomułka","Jakub",""],["Miranda","Luiz do Valle",""],["Nalepa","Grzegorz J.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 15:49:47 GMT"}],"updateDate":"2024-07-10","timestamp":1720540187000,"abstract":"  In response to several cultural heritage initiatives at the Jagiellonian\nUniversity, we have developed a new digitization workflow in collaboration with\nthe Jagiellonian Library (JL). The solution is based on easy-to-access\ntechnological solutions -- Microsoft 365 cloud with MS Excel files as metadata\nacquisition interfaces, Office Script for validation, and MS Sharepoint for\nstorage -- that allows metadata acquisition by domain experts (philologists,\nhistorians, philosophers, librarians, archivists, curators, etc.) regardless of\ntheir experience with information systems. The ultimate goal is to create a\nknowledge graph that describes the analyzed holdings, linked to general\nknowledge bases, as well as to other cultural heritage collections, so careful\nattention is paid to the high accuracy of metadata and proper links to external\nsources. The workflow has already been evaluated in two pilots in the DiHeLib\nproject focused on digitizing the so-called \"Berlin Collection\" and in two\nworkshops with international guests, which allowed for its refinement and\nconfirmation of its correctness and usability for JL. As the proposed workflow\ndoes not interfere with existing systems or domain guidelines regarding\ndigitization and basic metadata collection in a given institution (e.g., file\ntype, image quality, use of Dublin Core/MARC-21), but extends them in order to\nenable rich metadata collection, not previously possible, we believe that it\ncould be of interest to all GLAMs (galleries, libraries, archives, and\nmuseums).\n","subjects":["Computing Research Repository/Digital Libraries","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}