{"id":"2407.05580","title":"$\\mathrm{E^{2}CFD}$: Towards Effective and Efficient Cost Function\n  Design for Safe Reinforcement Learning via Large Language Model","authors":"Zepeng Wang, Chao Ma, Linjiang Zhou, Libing Wu, Lei Yang, Xiaochuan\n  Shi, and Guojun Peng","authorsParsed":[["Wang","Zepeng",""],["Ma","Chao",""],["Zhou","Linjiang",""],["Wu","Libing",""],["Yang","Lei",""],["Shi","Xiaochuan",""],["Peng","Guojun",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 03:30:25 GMT"}],"updateDate":"2024-07-09","timestamp":1720409425000,"abstract":"  Different classes of safe reinforcement learning algorithms have shown\nsatisfactory performance in various types of safety requirement scenarios.\nHowever, the existing methods mainly address one or several classes of specific\nsafety requirement scenario problems and cannot be applied to arbitrary safety\nrequirement scenarios. In addition, the optimization objectives of existing\nreinforcement learning algorithms are misaligned with the task requirements.\nBased on the need to address these issues, we propose $\\mathrm{E^{2}CFD}$, an\neffective and efficient cost function design framework. $\\mathrm{E^{2}CFD}$\nleverages the capabilities of a large language model (LLM) to comprehend\nvarious safety scenarios and generate corresponding cost functions. It\nincorporates the \\textit{fast performance evaluation (FPE)} method to\nfacilitate rapid and iterative updates to the generated cost function. Through\nthis iterative process, $\\mathrm{E^{2}CFD}$ aims to obtain the most suitable\ncost function for policy training, tailored to the specific tasks within the\nsafety scenario. Experiments have proven that the performance of policies\ntrained using this framework is superior to traditional safe reinforcement\nlearning algorithms and policies trained with carefully designed cost\nfunctions.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}