{"id":"2407.17427","title":"Uncertainty-preserving deep knowledge tracing with state-space models","authors":"S. Thomas Christie and Carson Cook and Anna N. Rafferty","authorsParsed":[["Christie","S. Thomas",""],["Cook","Carson",""],["Rafferty","Anna N.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 13:40:28 GMT"}],"updateDate":"2024-07-25","timestamp":1720532428000,"abstract":"  A central goal of both knowledge tracing and traditional assessment is to\nquantify student knowledge and skills at a given point in time. Deep knowledge\ntracing flexibly considers a student's response history but does not quantify\nepistemic uncertainty, while IRT and CDM compute measurement error but only\nconsider responses to individual tests in isolation from a student's past\nresponses. Elo and BKT could bridge this divide, but the simplicity of the\nunderlying models limits information sharing across skills and imposes strong\ninductive biases. To overcome these limitations, we introduce Dynamic LENS, a\nmodeling paradigm that combines the flexible uncertainty-preserving properties\nof variational autoencoders with the principled information integration of\nBayesian state-space models. Dynamic LENS allows information from student\nresponses to be collected across time, while treating responses from the same\ntest as exchangeable observations generated by a shared latent state. It\nrepresents student knowledge as Gaussian distributions in high-dimensional\nspace and combines estimates both within tests and across time using Bayesian\nupdating. We show that Dynamic LENS has similar predictive performance to\ncompeting models, while preserving the epistemic uncertainty - the deep\nlearning analogue to measurement error - that DKT models lack. This approach\nprovides a conceptual bridge across an important divide between models designed\nfor formative practice and summative assessment.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}