{"id":"2407.07690","title":"High power GaSb-based distributed feedback laser with laterally coupled\n  dielectric gratings at 1.95{\\mu}m","authors":"Zhengqing Ding (1), Juntian Cao (2 and 3), Kun Zhan (1), Yihang Chen\n  (2 and 3), Lidan Zhou (1), Hao Tan (4 and 5), Chenao Yang (2 and 3), Ying Yu\n  (1), Zhichuan Niu (2 and 3) and Siyuan Yu (1) ((1) Guangzhou, China, (2)\n  Beijing, China, (3) Beijing, China, (4) Shenzhen, China, (5) Hefei, China)","authorsParsed":[["Ding","Zhengqing","","2 and 3"],["Cao","Juntian","","2 and 3"],["Zhan","Kun","","2 and 3"],["Chen","Yihang","","2 and 3"],["Zhou","Lidan","","4 and 5"],["Tan","Hao","","4 and 5"],["Yang","Chenao","","2 and 3"],["Yu","Ying","","2 and 3"],["Niu","Zhichuan","","2 and 3"],["Yu","Siyuan",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 14:17:56 GMT"}],"updateDate":"2024-07-11","timestamp":1720621076000,"abstract":"  Traditional Distributed Feedback (DFB) or Distributed Bragg Reflector (DBR)\nlasers typically utilize buried gratings as frequency-selective optical\nfeedback mechanisms. However, the fabrication of such gratings often\nnecessitates regrowth processes, which can pose technical challenges for\nmaterials platforms such as GaAs and GaSb. Metal gratings were also used for\nGaSb lasers but they introduce additional absorption loss that limits device\nefficiency and output power. In this paper, we introduce a novel laterally\ncoupled dielectric Bragg grating structure, which enables highly controllable,\ndeterministic, and stable coupling between the grating and the optical mode.\nOur device demonstrates a continuous-wave output power of 47.02 mW at room\ntemperature, exhibiting stable single-mode operation from 300-1000 mA and\nachieving a maximum side mode suppression ratio of 46.7 dB. These results\nunderscore the innovative lateral coupled dielectric grating as a feasible and\ntechnologically superior approach for fabricating DFB and DBR lasers, which\nhold universal applicability across different material platforms and wavelength\nbands.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}