{"id":"2407.13988","title":"A trustworthy blockchain-based energy trading scheme for V2G operations\n  in distributed power grids via integrated scheduling and trading framework","authors":"Yunwang Chen, Xiang Lei, Songyan Niu, Linni Jian","authorsParsed":[["Chen","Yunwang",""],["Lei","Xiang",""],["Niu","Songyan",""],["Jian","Linni",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 02:34:01 GMT"}],"updateDate":"2024-07-22","timestamp":1721356441000,"abstract":"  The rapid growth of electric vehicles (EVs) and the deployment of\nvehicle-to-grid (V2G) technology pose significant challenges for distributed\npower grids, particularly in fostering trust and ensuring effective\ncoordination among stakeholders. In this paper, we developed an integrated\nscheduling and trading framework to conduct transparent and efficacious\ncoordination in V2G operations. In blockchain implementation, we propose a\ncyber-physical blockchain architecture that enhances transaction efficiency and\nscalability by leveraging smart charging points (SCPs) for rapid transaction\nvalidation through a fast-path practical byzantine fault tolerance (fast-path\nPBFT) consensus mechanism. From the energy dispatching perspective, a\ngame-theoretical pricing strategy is employed and smart contracts are utilized\nfor autonomous decision-making between EVs and operators, aiming to optimize\nthe trading process and maximize economic benefits. Numerical evaluation of\nblockchain consensus shows the effect of the fast-path PBFT consensus in\nimproving systems scalability with a balanced trade-off in robustness. A case\nstudy, utilizing real-world data from the Southern University of Science and\nTechnology (SUSTech), demonstrates significant reductions in EV charging costs\nand the framework potential to support auxiliary grid services.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}