{"id":"2407.21794","title":"Generalized Out-of-Distribution Detection and Beyond in Vision Language\n  Model Era: A Survey","authors":"Atsuyuki Miyai, Jingkang Yang, Jingyang Zhang, Yifei Ming, Yueqian\n  Lin, Qing Yu, Go Irie, Shafiq Joty, Yixuan Li, Hai Li, Ziwei Liu, Toshihiko\n  Yamasaki, Kiyoharu Aizawa","authorsParsed":[["Miyai","Atsuyuki",""],["Yang","Jingkang",""],["Zhang","Jingyang",""],["Ming","Yifei",""],["Lin","Yueqian",""],["Yu","Qing",""],["Irie","Go",""],["Joty","Shafiq",""],["Li","Yixuan",""],["Li","Hai",""],["Liu","Ziwei",""],["Yamasaki","Toshihiko",""],["Aizawa","Kiyoharu",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 17:59:58 GMT"}],"updateDate":"2024-08-01","timestamp":1722448798000,"abstract":"  Detecting out-of-distribution (OOD) samples is crucial for ensuring the\nsafety of machine learning systems and has shaped the field of OOD detection.\nMeanwhile, several other problems are closely related to OOD detection,\nincluding anomaly detection (AD), novelty detection (ND), open set recognition\n(OSR), and outlier detection (OD). To unify these problems, a generalized OOD\ndetection framework was proposed, taxonomically categorizing these five\nproblems. However, Vision Language Models (VLMs) such as CLIP have\nsignificantly changed the paradigm and blurred the boundaries between these\nfields, again confusing researchers. In this survey, we first present a\ngeneralized OOD detection v2, encapsulating the evolution of AD, ND, OSR, OOD\ndetection, and OD in the VLM era. Our framework reveals that, with some field\ninactivity and integration, the demanding challenges have become OOD detection\nand AD. In addition, we also highlight the significant shift in the definition,\nproblem settings, and benchmarks; we thus feature a comprehensive review of the\nmethodology for OOD detection, including the discussion over other related\ntasks to clarify their relationship to OOD detection. Finally, we explore the\nadvancements in the emerging Large Vision Language Model (LVLM) era, such as\nGPT-4V. We conclude this survey with open challenges and future directions.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}