{"id":"2407.20251","title":"An Uncertainty-aware Deep Learning Framework-based Robust Design\n  Optimization of Metamaterial Units","authors":"Zihan Wang, Anindya Bhaduri, Hongyi Xu, Liping Wang","authorsParsed":[["Wang","Zihan",""],["Bhaduri","Anindya",""],["Xu","Hongyi",""],["Wang","Liping",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 22:21:27 GMT"}],"updateDate":"2024-07-31","timestamp":1721427687000,"abstract":"  Mechanical metamaterials represent an innovative class of artificial\nstructures, distinguished by their extraordinary mechanical characteristics,\nwhich are beyond the scope of traditional natural materials. The use of deep\ngenerative models has become increasingly popular in the design of metamaterial\nunits. The effectiveness of using deep generative models lies in their capacity\nto compress complex input data into a simplified, lower-dimensional latent\nspace, while also enabling the creation of novel optimal designs through\nsampling within this space. However, the design process does not take into\naccount the effect of model uncertainty due to data sparsity or the effect of\ninput data uncertainty due to inherent randomness in the data. This might lead\nto the generation of undesirable structures with high sensitivity to the\nuncertainties in the system. To address this issue, a novel uncertainty-aware\ndeep learning framework-based robust design approach is proposed for the design\nof metamaterial units with optimal target properties. The proposed approach\nutilizes the probabilistic nature of the deep learning framework and quantifies\nboth aleatoric and epistemic uncertainties associated with surrogate-based\ndesign optimization. We demonstrate that the proposed design approach is\ncapable of designing high-performance metamaterial units with high reliability.\nTo showcase the effectiveness of the proposed design approach, a\nsingle-objective design optimization problem and a multi-objective design\noptimization problem are presented. The optimal robust designs obtained are\nvalidated by comparing them to the designs obtained from the topology\noptimization method as well as the designs obtained from a deterministic deep\nlearning framework-based design optimization where none of the uncertainties in\nthe system are explicitly considered.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Condensed Matter/Materials Science","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}