{"id":"2407.19290","title":"Application of the Lov\\'asz-Schrijver Lift-and-Project Operator to\n  Compact Stable Set Integer Programs","authors":"Federico Battista, Fabrizio Rossi and Stefano Smriglio","authorsParsed":[["Battista","Federico",""],["Rossi","Fabrizio",""],["Smriglio","Stefano",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 16:03:51 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 16:34:05 GMT"}],"updateDate":"2024-08-01","timestamp":1722096231000,"abstract":"  The Lov\\'asz theta function $\\theta(G)$ provides a very good upper bound on\nthe stability number of a graph $G$. It can be computed in polynomial time by\nsolving a semidefinite program (SDP), which also turns out to be fairly\ntractable in practice. Consequently, $\\theta(G)$ achieves a hard-to-beat\ntrade-off between computational effort and strength of the bound. Indeed,\nseveral attempts to improve the theta bound are documented, mainly based on\nplaying around the application of the $N_+(\\cdot)$ lifting operator of Lov\\'asz\nand Schrijver to the classical formulation of the maximum stable set problem.\nExperience shows that solving such SDP-s often struggles against practical\nintractability and requires highly specialized methods. We investigate the\napplication of such an operator to two different linear formulations based on\nclique and nodal inequalities, respectively. Fewer inequalities describe these\ntwo and yet guarantee that the resulting SDP bound is at least as strong as\n$\\theta(G)$. Our computational experience, including larger graphs than those\npreviously documented, shows that upper bounds stronger than $\\theta(G)$ can be\naccessed by a reasonable additional effort using the clique-based formulation\non sparse graphs and the nodal-based one on dense graphs.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}