{"id":"2407.15888","title":"A Benchmark Dataset for Multimodal Prediction of Enzymatic Function\n  Coupling DNA Sequences and Natural Language","authors":"Yuchen Zhang, Ratish Kumar Chandrakant Jha, Soumya Bharadwaj, Vatsal\n  Sanjaykumar Thakkar, Adrienne Hoarfrost, Jin Sun","authorsParsed":[["Zhang","Yuchen",""],["Jha","Ratish Kumar Chandrakant",""],["Bharadwaj","Soumya",""],["Thakkar","Vatsal Sanjaykumar",""],["Hoarfrost","Adrienne",""],["Sun","Jin",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 19:27:43 GMT"}],"updateDate":"2024-07-24","timestamp":1721590063000,"abstract":"  Predicting gene function from its DNA sequence is a fundamental challenge in\nbiology. Many deep learning models have been proposed to embed DNA sequences\nand predict their enzymatic function, leveraging information in public\ndatabases linking DNA sequences to an enzymatic function label. However, much\nof the scientific community's knowledge of biological function is not\nrepresented in these categorical labels, and is instead captured in\nunstructured text descriptions of mechanisms, reactions, and enzyme behavior.\nThese descriptions are often captured alongside DNA sequences in biological\ndatabases, albeit in an unstructured manner. Deep learning of models predicting\nenzymatic function are likely to benefit from incorporating this multi-modal\ndata encoding scientific knowledge of biological function. There is, however,\nno dataset designed for machine learning algorithms to leverage this\nmulti-modal information. Here we propose a novel dataset and benchmark suite\nthat enables the exploration and development of large multi-modal neural\nnetwork models on gene DNA sequences and natural language descriptions of gene\nfunction. We present baseline performance on benchmarks for both unsupervised\nand supervised tasks that demonstrate the difficulty of this modeling\nobjective, while demonstrating the potential benefit of incorporating\nmulti-modal data types in function prediction compared to DNA sequences alone.\nOur dataset is at: https://hoarfrost-lab.github.io/BioTalk/.\n","subjects":["Quantitative Biology/Genomics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}