{"id":"2407.16068","title":"Pauli path simulations of noisy quantum circuits beyond average case","authors":"Guillermo Gonz\\'alez-Garc\\'ia, J. Ignacio Cirac and Rahul Trivedi","authorsParsed":[["González-García","Guillermo",""],["Cirac","J. Ignacio",""],["Trivedi","Rahul",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 21:58:37 GMT"}],"updateDate":"2024-07-24","timestamp":1721685517000,"abstract":"  For random quantum circuits on $n$ qubits of depth $\\Theta(\\log n)$ with\ndepolarizing noise, the task of sampling from the output state can be\nefficiently performed classically using a Pauli path method [Aharonov et al.\nProceedings of the 55th Annual ACM Symposium on Theory of Computing. 2023] .\nThis paper aims to study the performance of this method beyond random circuits.\nWe first consider the classical simulation of local observables in circuits\ncomposed of Clifford and T gates $\\unicode{x2013}$ going beyond the average\ncase analysis, we derive sufficient conditions for simulatability in terms of\nthe noise rate and the fraction of gates that are T gates, and show that if\nnoise is introduced at a faster rate than T gates, the simulation becomes\nclassically easy. As an application of this result, we study 2D QAOA circuits\nthat attempt to find low-energy states of classical Ising models on general\ngraphs. There, our results shows that for hard instances of the problem, which\ncorrespond to Ising model's graph being geometrically non-local, a QAOA\nalgorithm mapped to a geometrically local circuit architecture using SWAP gates\ndoes not have any asymptotic advantage over classical algorithms if depolarized\nat a constant rate. Finally, we illustrate instances where the Pauli path\nmethod fails to give the correct result, and also initiate a study of the\ntrade-off between fragility to noise and classical complexity of simulating a\ngiven quantum circuit.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xWMSEk0iEm6xV15Ub50jhQ5y0eEFx0_bZTUFM5w7JGc","pdfSize":"830366"}
