{"id":"2407.20596","title":"Benchmarking Histopathology Foundation Models for Ovarian Cancer\n  Bevacizumab Treatment Response Prediction from Whole Slide Images","authors":"Mayur Mallya, Ali Khajegili Mirabadi, Hossein Farahani, Ali Bashashati","authorsParsed":[["Mallya","Mayur",""],["Mirabadi","Ali Khajegili",""],["Farahani","Hossein",""],["Bashashati","Ali",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 07:15:39 GMT"}],"updateDate":"2024-07-31","timestamp":1722323739000,"abstract":"  Bevacizumab is a widely studied targeted therapeutic drug used in conjunction\nwith standard chemotherapy for the treatment of recurrent ovarian cancer. While\nits administration has shown to increase the progression-free survival (PFS) in\npatients with advanced stage ovarian cancer, the lack of identifiable\nbiomarkers for predicting patient response has been a major roadblock in its\neffective adoption towards personalized medicine. In this work, we leverage the\nlatest histopathology foundation models trained on large-scale whole slide\nimage (WSI) datasets to extract ovarian tumor tissue features for predicting\nbevacizumab response from WSIs. Our extensive experiments across a combination\nof different histopathology foundation models and multiple instance learning\n(MIL) strategies demonstrate capability of these large models in predicting\nbevacizumab response in ovarian cancer patients with the best models achieving\nan AUC score of 0.86 and an accuracy score of 72.5%. Furthermore, our survival\nmodels are able to stratify high- and low-risk cases with statistical\nsignificance (p < 0.05) even among the patients with the aggressive subtype of\nhigh-grade serous ovarian carcinoma. This work highlights the utility of\nhistopathology foundation models for the task of ovarian bevacizumab response\nprediction from WSIs. The high-attention regions of the WSIs highlighted by\nthese models not only aid the model explainability but also serve as promising\nimaging biomarkers for treatment prognosis.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RQY3NQq5dgORMI39xirewKXvk-P4Jl5PCCi7ZyiXgs4","pdfSize":"1707896"}
