{"id":"2407.17984","title":"Relativistic gravity in the inhomogeneous Universe","authors":"Theodore Anton","authorsParsed":[["Anton","Theodore",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 12:17:45 GMT"}],"updateDate":"2024-07-26","timestamp":1721909865000,"abstract":"  Cosmology is built on a relativistic understanding of gravity, where the\ngeometry of the Universe is dynamically determined by matter and energy. In the\ncosmological concordance model, gravity is described by General Relativity, and\nit is assumed that on large scales the Universe is homogeneous and isotropic.\nThese fundamental principles should be tested. In this thesis, we explore the\nimplications of breaking them.\n  In order to understand possible modifications to gravity on cosmological\nscales, we extend the formalism of parameterised post-Newtonian cosmology, an\napproach for building cosmological tests of gravity that are consistent with\ntests on astrophysical scales. We demonstrate how this approach can be used to\nconstruct theory-independent equations for the cosmic expansion and its\nfirst-order perturbations. Then, we apply the framework to observations of the\nanisotropies in the cosmic microwave background. We use these to place novel\ncosmological constraints on the evolution of the post-Newtonian parameters.\n  We investigate the consequences of inhomogeneity and isotropy by developing a\nnew approach to studying anisotropy in the Universe, wherein we consider how an\nanisotropic cosmology might emerge on large scales as a result of averaging\nover inhomogeneous structures, and demonstrate how the emergent model is\naffected by backreaction. We perform a detailed study of light propagation in a\nwide class of inhomogeneous and anisotropic spacetimes, exploring the\nconditions under which the Hubble diagram can be accurately predicted by an\nanisotropic model constructed using explicit averaging, even in the presence of\nlarge inhomogeneities. We show that observables calculated in a suitable\naveraged description closely reproduce the true Hubble diagram on large scales,\nas long as the spacetime possesses a well-defined homogeneity scale.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}