{"id":"2407.02758","title":"Differential Encoding for Improved Representation Learning over Graphs","authors":"Haimin Zhang, Jiahao Xia, Min Xu","authorsParsed":[["Zhang","Haimin",""],["Xia","Jiahao",""],["Xu","Min",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 02:23:33 GMT"}],"updateDate":"2024-07-04","timestamp":1719973413000,"abstract":"  Combining the message-passing paradigm with the global attention mechanism\nhas emerged as an effective framework for learning over graphs. The\nmessage-passing paradigm and the global attention mechanism fundamentally\ngenerate node embeddings based on information aggregated from a node's local\nneighborhood or from the whole graph. The most basic and commonly used\naggregation approach is to take the sum of information from a node's local\nneighbourhood or from the whole graph. However, it is unknown if the dominant\ninformation is from a node itself or from the node's neighbours (or the rest of\nthe graph nodes). Therefore, there exists information lost at each layer of\nembedding generation, and this information lost could be accumulated and become\nmore serious when more layers are used in the model. In this paper, we present\na differential encoding method to address the issue of information lost. The\nidea of our method is to encode the differential representation between the\ninformation from a node's neighbours (or the rest of the graph nodes) and that\nfrom the node itself. The obtained differential encoding is then combined with\nthe original aggregated local or global representation to generate the updated\nnode embedding. By integrating differential encodings, the representational\nability of generated node embeddings is improved. The differential encoding\nmethod is empirically evaluated on different graph tasks on seven benchmark\ndatasets. The results show that it is a general method that improves the\nmessage-passing update and the global attention update, advancing the\nstate-of-the-art performance for graph representation learning on these\ndatasets.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}