{"id":"2407.02620","title":"RefExpo: Unveiling Software Project Structures through Advanced\n  Dependency Graph Extraction","authors":"Vahid Haratian, Pouria Derakhshanfar, Vladimir Kovalenko, Eray\n  T\\\"uz\\\"un","authorsParsed":[["Haratian","Vahid",""],["Derakhshanfar","Pouria",""],["Kovalenko","Vladimir",""],["Tüzün","Eray",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 19:16:27 GMT"}],"updateDate":"2024-07-04","timestamp":1719947787000,"abstract":"  Assessing the dependency graph (DG) of a software project offers valuable\ninsights for identifying its key components. Numerous studies have explored\nextracting DGs and leveraging them for various analyses, including security and\nbus factor calculations. However, there is a lack of user-friendly tools for DG\nextraction, and no comprehensive DG datasets from open-source projects are\navailable. This study introduces RefExpo, an easy-to-use DG extraction tool\nsupporting multiple languages like Java, Python, and JavaScript. Based on the\nIntelliJ plugin SDK, RefExpo ensures compatibility with various project\nstructures and technology versions. We also provide a dataset of 20 Java and\nPython projects, with plans to expand upon request. To validate RefExpo we\nfocused on Java and Python. Our tests showed RefExpo achieving 92% and 100%\nrecall on micro test suites Judge and PyCG for Python and Java, respectively.\nIn macro-level experiments, RefExpo outperformed existing tools by at least 31%\nand 7% in finding unique and shared results. You can access the source code of\nour tool from our replication package1. The installable version of RefExpo is\navailable on the IntelliJ marketplace. Additionally, a short video describing\nits functionality can be viewed here: https://youtu.be/eCnPUlj6YgA.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"osWQcUEsTRVGCEh3VGOljtm6IEV98Jfl1K_SxOBr93w","pdfSize":"544433","objectId":"0xf21c3f8986ce8390dcbdbbc4b71354769fd937ab508dd3c891788b04cc0209b0","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
