{"id":"2407.12143","title":"False consensus biases AI against vulnerable stakeholders","authors":"Mengchen Dong, Jean-Fran\\c{c}ois Bonnefon, and Iyad Rahwan","authorsParsed":[["Dong","Mengchen",""],["Bonnefon","Jean-François",""],["Rahwan","Iyad",""]],"versions":[{"version":"v1","created":"Fri, 17 May 2024 14:33:47 GMT"}],"updateDate":"2024-07-18","timestamp":1715956427000,"abstract":"  The deployment of AI systems for welfare benefit allocation allows for\naccelerated decision-making and faster provision of critical help, but has\nalready led to an increase in unfair benefit denials and false fraud\naccusations. Collecting data in the US and the UK (N = 2449), we explore the\npublic acceptability of such speed-accuracy trade-offs in populations of\nclaimants and non-claimants. We observe a general willingness to trade off\nspeed gains for modest accuracy losses, but this aggregate view masks notable\ndivergences between claimants and non-claimants. Although welfare claimants\ncomprise a relatively small proportion of the general population (e.g., 20% in\nthe US representative sample), this vulnerable group is much less willing to\naccept AI deployed in welfare systems, raising concerns that solely using\naggregate data for calibration could lead to policies misaligned with\nstakeholder preferences. Our study further uncovers asymmetric insights between\nclaimants and non-claimants. The latter consistently overestimate claimant\nwillingness to accept speed-accuracy trade-offs, even when financially\nincentivized for accurate perspective-taking. This suggests that policy\ndecisions influenced by the dominant voice of non-claimants, however\nwell-intentioned, may neglect the actual preferences of those directly affected\nby welfare AI systems. Our findings underline the need for stakeholder\nengagement and transparent communication in the design and deployment of these\nsystems, particularly in contexts marked by power imbalances.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}