{"id":"2407.11564","title":"SGIFormer: Semantic-guided and Geometric-enhanced Interleaving\n  Transformer for 3D Instance Segmentation","authors":"Lei Yao, Yi Wang, Moyun Liu, Lap-Pui Chau","authorsParsed":[["Yao","Lei",""],["Wang","Yi",""],["Liu","Moyun",""],["Chau","Lap-Pui",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 10:17:28 GMT"}],"updateDate":"2024-07-17","timestamp":1721125048000,"abstract":"  In recent years, transformer-based models have exhibited considerable\npotential in point cloud instance segmentation. Despite the promising\nperformance achieved by existing methods, they encounter challenges such as\ninstance query initialization problems and excessive reliance on stacked\nlayers, rendering them incompatible with large-scale 3D scenes. This paper\nintroduces a novel method, named SGIFormer, for 3D instance segmentation, which\nis composed of the Semantic-guided Mix Query (SMQ) initialization and the\nGeometric-enhanced Interleaving Transformer (GIT) decoder. Specifically, the\nprinciple of our SMQ initialization scheme is to leverage the predicted\nvoxel-wise semantic information to implicitly generate the scene-aware query,\nyielding adequate scene prior and compensating for the learnable query set.\nSubsequently, we feed the formed overall query into our GIT decoder to\nalternately refine instance query and global scene features for further\ncapturing fine-grained information and reducing complex design intricacies\nsimultaneously. To emphasize geometric property, we consider bias estimation as\nan auxiliary task and progressively integrate shifted point coordinates\nembedding to reinforce instance localization. SGIFormer attains\nstate-of-the-art performance on ScanNet V2, ScanNet200 datasets, and the\nchallenging high-fidelity ScanNet++ benchmark, striking a balance between\naccuracy and efficiency. The code, weights, and demo videos are publicly\navailable at https://rayyoh.github.io/sgiformer.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}