{"id":"2407.03362","title":"Phase space path integral representation of the dynamic structure\n  factor. Monte Carlo simulation of strongly correlated soft-sphere fermions","authors":"V. S. Filinov, P. R. Levashov, A. S. Larkin","authorsParsed":[["Filinov","V. S.",""],["Levashov","P. R.",""],["Larkin","A. S.",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 10:45:16 GMT"}],"updateDate":"2024-07-08","timestamp":1719398716000,"abstract":"  The dynamic structure factor (DSF) is a mathematical function that contains\ninformation about inter-particle correlations and their time evolution. Mostly\nthe classical molecular dynamics is used to calculate the DSF of the classical\nsystems. On the contrary this article deals with quantum systems and the\nquantum dynamic structure factor. The Wigner formulation of quantum mechanics\nwas used to derive the path integral representation of the DSF, which is based\non the Wiener-Khinchin theorem showing relation of the the power spectrum of a\nrandom paths to their correlation function. The $3 {\\rm D} $ quantum system of\nstrongly correlated soft-sphere fermions was considered as an interesting\nphysical example.\n  The developed Wigner path integral Monte Carlo (WPIMC) approach has been\ndeveloped to calculate the spin--resolved DSFs, the radial distribution\nfunctions (RDFs) and other thermodynamic functions in a wide range of density\nand temperatures. The physical meaning of the peaks arising on the RDFs and DSF\nhave been analyzed and explained by the manifestation of the interference\neffects of the exchange and interparticle interactions and, as well as, the\nwave interference between multiple-scattering. This phenomenon in the system of\nthe soft-sphere scatterers may to be the precursor effect of the Anderson\nlocalization, which finds its origin in the wave interference between\nmultiple-scattering paths.\n","subjects":["Condensed Matter/Disordered Systems and Neural Networks","Physics/Computational Physics","Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}