{"id":"2407.08929","title":"Robust and improved constraints on higher-curvature gravitational\n  effective-field-theory with the GW170608 event","authors":"Haoyang Liu and Nicol\\'as Yunes","authorsParsed":[["Liu","Haoyang",""],["Yunes","Nicolás",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 02:32:06 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 13:41:28 GMT"}],"updateDate":"2024-07-18","timestamp":1720751526000,"abstract":"  Effective field theory methods allow us to modify general relativity through\nhigher-curvature corrections to the Einstein-Hilbert action, while preserving\nLorentz invariance and the number of gravitational degrees of freedom. We here\nconstruct an approximate inspiral-merger-ringdown waveform model within the\ncubic, parity-preserving class of effective-field-theory extensions to\nEinstein's theory for the gravitational waves emitted by quasi-circular binary\nblack holes with aligned/anti-aligned spins. Using this waveform model, we\nfirst explore the detectability of non-Einsteinian effective-field-theory\neffects through an extended version of effective cycles to illustrate the need\nto include non-Einsteinian amplitude corrections. We then use this model to\nanalyze the GW170608 event in a full Bayesian framework, and we place new\nimproved and more robust constraints on the coupling constants of the effective\nfield theory. Our Bayesian model selection study disfavors the non-Einsteinian\ntheory with a (log) Bayes factor of $\\log \\mathcal{B}^{\\text{EFT}}_{\\text{GR}}\n= -2.81$. Our Bayesian parameter estimation study places the constraints\n$\\bar{\\alpha}_1=0.87^{+1.95}_{-1.03}$ and $\n\\bar{\\alpha}_2=-0.35^{+4.12}_{-2.92}$ at $90\\%$ confidence on the coupling\nparameters of the effective-field theory. These constraints are $3.5$ stronger\nthan previous constraints, informative relative to the prior, and independent\nof the choice of prior on the coupling parameters of the modified theory.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}