{"id":"2407.15922","title":"Analyzing JWST/NIRSpec Hydrogen Line Detections at TWA 27B: Constraining\n  Accretion Properties and Geometry","authors":"Yuhiko Aoyama, Gabriel-Dominique Marleau, and Jun Hashimoto","authorsParsed":[["Aoyama","Yuhiko",""],["Marleau","Gabriel-Dominique",""],["Hashimoto","Jun",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:00:01 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 08:43:27 GMT"}],"updateDate":"2024-08-06","timestamp":1721671201000,"abstract":"  Hydrogen lines from forming planets are crucial for understanding planet\nformation. However, the number of planetary hydrogen line detections is still\nlimited. Recent JWST/NIRSpec observations have detected Paschen and Brackett\nhydrogen lines at TWA 27 B (2M1207b). TWA 27 B is classified as a\nplanetary-mass companison (PMC) rather than a planet due to its large mass\nratio to the central object ($\\approx 5 M_\\mathrm{J}$ compared to $25\nM_\\mathrm{J}$). Nevertheless, TWA 27 B's hydrogen line emission is expected to\nbe same as for planets, given its small mass. We aim to constrain the accretion\nproperties and accretion geometry of TWA 27 B, contributing to our\nunderstanding of hydrogen line emission mechanism common to both PMCs and\nplanets. We conduct spectral fitting of four bright hydrogen lines\n(Pa-$\\alpha$, Pa-$\\beta$, Pa-$\\gamma$, Pa-$\\delta$) with an accretion-shock\nemission model tailored for forming planets. We estimate the mass accretion\nrate at $\\dot{M} \\approx 3 \\times 10^{-9}\\, M_\\mathrm{J}\\,\\mathrm{yr}^{-1}$\nwith our fiducial parameters, though this is subject to an uncertainty of up to\nfactor of ten. Our analysis also indicates a dense accretion flow, $n\\gtrsim\n10^{13}\\,\\mathrm{cm^{-3}}$ just before the shock, implying a small\naccretion-shock filling factor $f_\\mathrm{f}$ on the planetary surface\n($f_\\mathrm{f} \\lesssim 5\\times10^{-4}$). This finding suggests that\nmagnetospheric accretion is occurring at TWA 27 B. Additionally, we carry out a\ncomparative analysis of hydrogen-line emission color to identify the emission\nmechanism, but the associated uncertainties proved too large for definitive\nconclusions. This underscores the need for further high-precision observational\nstudies to elucidate these emission mechanisms fully.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}