{"id":"2407.07462","title":"MAN TruckScenes: A multimodal dataset for autonomous trucking in diverse\n  conditions","authors":"Felix Fent, Fabian Kuttenreich, Florian Ruch, Farija Rizwin, Stefan\n  Juergens, Lorenz Lechermann, Christian Nissler, Andrea Perl, Ulrich Voll, Min\n  Yan, Markus Lienkamp","authorsParsed":[["Fent","Felix",""],["Kuttenreich","Fabian",""],["Ruch","Florian",""],["Rizwin","Farija",""],["Juergens","Stefan",""],["Lechermann","Lorenz",""],["Nissler","Christian",""],["Perl","Andrea",""],["Voll","Ulrich",""],["Yan","Min",""],["Lienkamp","Markus",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 08:32:26 GMT"}],"updateDate":"2024-07-11","timestamp":1720600346000,"abstract":"  Autonomous trucking is a promising technology that can greatly impact modern\nlogistics and the environment. Ensuring its safety on public roads is one of\nthe main duties that requires an accurate perception of the environment. To\nachieve this, machine learning methods rely on large datasets, but to this day,\nno such datasets are available for autonomous trucks. In this work, we present\nMAN TruckScenes, the first multimodal dataset for autonomous trucking. MAN\nTruckScenes allows the research community to come into contact with\ntruck-specific challenges, such as trailer occlusions, novel sensor\nperspectives, and terminal environments for the first time. It comprises more\nthan 740 scenes of 20 s each within a multitude of different environmental\nconditions. The sensor set includes 4 cameras, 6 lidar, 6 radar sensors, 2\nIMUs, and a high-precision GNSS. The dataset's 3D bounding boxes were manually\nannotated and carefully reviewed to achieve a high quality standard. Bounding\nboxes are available for 27 object classes, 15 attributes, and a range of more\nthan 230 m. The scenes are tagged according to 34 distinct scene tags, and all\nobjects are tracked throughout the scene to promote a wide range of\napplications. Additionally, MAN TruckScenes is the first dataset to provide 4D\nradar data with 360{\\deg} coverage and is thereby the largest radar dataset\nwith annotated 3D bounding boxes. Finally, we provide extensive dataset\nanalysis and baseline results. The dataset, development kit and more are\navailable online.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}