{"id":"2407.12305","title":"SHARC-VQE: Simplified Hamiltonian Approach with Refinement and\n  Correction enabled Variational Quantum Eigensolver for Molecular Simulation","authors":"Harshdeep Singh, Sonjoy Majumder, Sabyashachi Mishra","authorsParsed":[["Singh","Harshdeep",""],["Majumder","Sonjoy",""],["Mishra","Sabyashachi",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 04:01:55 GMT"}],"updateDate":"2024-07-18","timestamp":1721188915000,"abstract":"  The transformation of a molecular Hamiltonian from the fermionic space to the\nqubit space results in a series of Pauli strings. Calculating the energy then\ninvolves evaluating the expectation values of each of these strings, which\npresents a significant bottleneck for applying variational quantum eigensolvers\n(VQEs) in quantum chemistry. Unlike fermionic Hamiltonians, the terms in a\nqubit Hamiltonian are additive. This work leverages this property to introduce\na novel method for extracting information from the partial qubit Hamiltonian,\nthereby enhancing the efficiency of VQEs. This work introduces the SHARC-VQE\n(Simplified Hamiltonian Approximation, Refinement, and Correction-VQE) method,\nwhere the full molecular Hamiltonian is partitioned into two parts based on the\nease of quantum execution. The easy-to-execute part constitutes the Partial\nHamiltonian, and the remaining part, while more complex to execute, is\ngenerally less significant. The latter is approximated by a refined operator\nand added up as a correction into the partial Hamiltonian. SHARC-VQE\nsignificantly reduces computational costs for molecular simulations. The cost\nof a single energy measurement can be reduced from $O(\\frac{N^4}{\\epsilon^2})$\nto $O(\\frac{1}{\\epsilon^2})$ for a system of $N$ qubits and accuracy\n$\\epsilon$, while the overall cost of VQE can be reduced from\n$O(\\frac{N^7}{\\epsilon^2})$ to $O(\\frac{N^3}{\\epsilon^2})$. Furthermore,\nmeasurement outcomes using SHARC-VQE are less prone to errors induced by noise\nfrom quantum circuits, reducing the errors from 20-40% to 5-10% without any\nadditional error correction or mitigation technique. Additionally, the\nSHARC-VQE is demonstrated as an initialization technique, where the simplified\npartial Hamiltonian is used to identify an optimal starting point for a complex\nproblem.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TtcpB_mVmEXN9fb0xJ4lxSeXOgiXlLNv-nKAAhCUUcQ","pdfSize":"10072111","objectId":"0x434bb57f9c5268ee032d018fd510a5b7ccf69b12cb669a11adcd6b1238cab0d7","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
