{"id":"2407.20841","title":"Optimizing Charge Transport Simulation for Hybrid Pixel Detectors","authors":"X. Xie, R. Barten, A. Bergamaschi, B. Braham, M. Br\\\"uckner, M.\n  Carulla, R. Dinapoli, S. Ebner, K. Ferjaoui, E. Fr\\\"ojdh, D. Greiffenberg, S.\n  Hasanaj, J. Heymes, V. Hinger, T. King, P. Kozlowski, C. Lopez-Cuenca, D.\n  Mezza, K. Moustakas, A. Mozzanica, K.A. Paton, C. Ruder, B. Schmitt, P.\n  Sieberer, D. Thattil, and J. Zhang","authorsParsed":[["Xie","X.",""],["Barten","R.",""],["Bergamaschi","A.",""],["Braham","B.",""],["Brückner","M.",""],["Carulla","M.",""],["Dinapoli","R.",""],["Ebner","S.",""],["Ferjaoui","K.",""],["Fröjdh","E.",""],["Greiffenberg","D.",""],["Hasanaj","S.",""],["Heymes","J.",""],["Hinger","V.",""],["King","T.",""],["Kozlowski","P.",""],["Lopez-Cuenca","C.",""],["Mezza","D.",""],["Moustakas","K.",""],["Mozzanica","A.",""],["Paton","K. A.",""],["Ruder","C.",""],["Schmitt","B.",""],["Sieberer","P.",""],["Thattil","D.",""],["Zhang","J.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 14:15:05 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 08:46:36 GMT"}],"updateDate":"2024-08-27","timestamp":1722348905000,"abstract":"  To enhance the spatial resolution of the M\\\"ONCH 25 \\textmu m pitch hybrid\npixel detector, deep learning models have been trained using both simulation\nand measurement data. Challenges arise when comparing simulation-based deep\nlearning models to measurement-based models for electrons, as the spatial\nresolution achieved through simulations is notably inferior to that from\nmeasurements. Discrepancies are also observed when directly comparing X-ray\nsimulations with measurements, particularly in the spectral output of single\npixels. These observations collectively suggest that current simulations\nrequire optimization.\n  To address this, a Monte Carlo simulation was conducted to model the dynamics\nof charge carriers within the silicon sensor, aiming to refine charge transport\nmodeling. The simulation encompasses the initial generation of the charge\ncloud, charge cloud drift, charge diffusion and repulsion, and electronic\nnoise. The simulation results were validated with measurements from the M\\\"ONCH\ndetector for X-rays, and the agreement between measurements and simulations was\nsignificantly improved by accounting for the charge repulsion.\n","subjects":["Physics/Instrumentation and Detectors"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}