{"id":"2407.20265","title":"COEFF-KANs: A Paradigm to Address the Electrolyte Field with KANs","authors":"Xinhe Li, Zhuoying Feng, Yezeng Chen, Weichen Dai, Zixu He, Yi Zhou,\n  Shuhong Jiao","authorsParsed":[["Li","Xinhe",""],["Feng","Zhuoying",""],["Chen","Yezeng",""],["Dai","Weichen",""],["He","Zixu",""],["Zhou","Yi",""],["Jiao","Shuhong",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 14:45:25 GMT"}],"updateDate":"2024-07-31","timestamp":1721832325000,"abstract":"  To reduce the experimental validation workload for chemical researchers and\naccelerate the design and optimization of high-energy-density lithium metal\nbatteries, we aim to leverage models to automatically predict Coulombic\nEfficiency (CE) based on the composition of liquid electrolytes. There are\nmainly two representative paradigms in existing methods: machine learning and\ndeep learning. However, the former requires intelligent input feature selection\nand reliable computational methods, leading to error propagation from feature\nestimation to model prediction, while the latter (e.g. MultiModal-MoLFormer)\nfaces challenges of poor predictive performance and overfitting due to limited\ndiversity in augmented data. To tackle these issues, we propose a novel method\nCOEFF (COlumbic EFficiency prediction via Fine-tuned models), which consists of\ntwo stages: pre-training a chemical general model and fine-tuning on downstream\ndomain data. Firstly, we adopt the publicly available MoLFormer model to obtain\nfeature vectors for each solvent and salt in the electrolyte. Then, we perform\na weighted average of embeddings for each token across all molecules, with\nweights determined by the respective electrolyte component ratios. Finally, we\ninput the obtained electrolyte features into a Multi-layer Perceptron or\nKolmogorov-Arnold Network to predict CE. Experimental results on a real-world\ndataset demonstrate that our method achieves SOTA for predicting CE compared to\nall baselines. Data and code used in this work will be made publicly available\nafter the paper is published.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}