{"id":"2407.20109","title":"Diffusion-DICE: In-Sample Diffusion Guidance for Offline Reinforcement\n  Learning","authors":"Liyuan Mao, Haoran Xu, Weinan Zhang, Xianyuan Zhan, Amy Zhang","authorsParsed":[["Mao","Liyuan",""],["Xu","Haoran",""],["Zhang","Weinan",""],["Zhan","Xianyuan",""],["Zhang","Amy",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:36:42 GMT"}],"updateDate":"2024-07-30","timestamp":1722267402000,"abstract":"  One important property of DIstribution Correction Estimation (DICE) methods\nis that the solution is the optimal stationary distribution ratio between the\noptimized and data collection policy. In this work, we show that DICE-based\nmethods can be viewed as a transformation from the behavior distribution to the\noptimal policy distribution. Based on this, we propose a novel approach,\nDiffusion-DICE, that directly performs this transformation using diffusion\nmodels. We find that the optimal policy's score function can be decomposed into\ntwo terms: the behavior policy's score function and the gradient of a guidance\nterm which depends on the optimal distribution ratio. The first term can be\nobtained from a diffusion model trained on the dataset and we propose an\nin-sample learning objective to learn the second term. Due to the\nmulti-modality contained in the optimal policy distribution, the transformation\nin Diffusion-DICE may guide towards those local-optimal modes. We thus generate\na few candidate actions and carefully select from them to approach\nglobal-optimum. Different from all other diffusion-based offline RL methods,\nthe guide-then-select paradigm in Diffusion-DICE only uses in-sample actions\nfor training and brings minimal error exploitation in the value function. We\nuse a didatic toycase example to show how previous diffusion-based methods fail\nto generate optimal actions due to leveraging these errors and how\nDiffusion-DICE successfully avoids that. We then conduct extensive experiments\non benchmark datasets to show the strong performance of Diffusion-DICE.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"hE708EjvJFtYDf71wfCsKi12TPUJ_1sFGvuprPShjD8","pdfSize":"5955363"}
