{"id":"2407.04503","title":"When LLMs Play the Telephone Game: Cumulative Changes and Attractors in\n  Iterated Cultural Transmissions","authors":"J\\'er\\'emy Perez, Corentin L\\'eger, Grgur Kova\\v{c}, C\\'edric Colas,\n  Gaia Molinaro, Maxime Derex, Pierre-Yves Oudeyer, Cl\\'ement Moulin-Frier","authorsParsed":[["Perez","Jérémy",""],["Léger","Corentin",""],["Kovač","Grgur",""],["Colas","Cédric",""],["Molinaro","Gaia",""],["Derex","Maxime",""],["Oudeyer","Pierre-Yves",""],["Moulin-Frier","Clément",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 13:44:09 GMT"}],"updateDate":"2024-07-08","timestamp":1720187049000,"abstract":"  As large language models (LLMs) start interacting with each other and\ngenerating an increasing amount of text online, it becomes crucial to better\nunderstand how information is transformed as it passes from one LLM to the\nnext. While significant research has examined individual LLM behaviors,\nexisting studies have largely overlooked the collective behaviors and\ninformation distortions arising from iterated LLM interactions. Small biases,\nnegligible at the single output level, risk being amplified in iterated\ninteractions, potentially leading the content to evolve towards attractor\nstates. In a series of telephone game experiments, we apply a transmission\nchain design borrowed from the human cultural evolution literature: LLM agents\niteratively receive, produce, and transmit texts from the previous to the next\nagent in the chain. By tracking the evolution of text toxicity, positivity,\ndifficulty, and length across transmission chains, we uncover the existence of\nbiases and attractors, and study their dependence on the initial text, the\ninstructions, language model, and model size. For instance, we find that more\nopen-ended instructions lead to stronger attraction effects compared to more\nconstrained tasks. We also find that different text properties display\ndifferent sensitivity to attraction effects, with toxicity leading to stronger\nattractors than length. These findings highlight the importance of accounting\nfor multi-step transmission dynamics and represent a first step towards a more\ncomprehensive understanding of LLM cultural dynamics.\n","subjects":["Physics/Physics and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by/4.0/"}