{"id":"2407.17219","title":"Graph Neural Networks: A suitable Alternative to MLPs in Latent 3D\n  Medical Image Classification?","authors":"Johannes Kiechle, Daniel M. Lang, Stefan M. Fischer, Lina Felsner, Jan\n  C. Peeken, Julia A. Schnabel","authorsParsed":[["Kiechle","Johannes",""],["Lang","Daniel M.",""],["Fischer","Stefan M.",""],["Felsner","Lina",""],["Peeken","Jan C.",""],["Schnabel","Julia A.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 12:19:39 GMT"}],"updateDate":"2024-07-25","timestamp":1721823579000,"abstract":"  Recent studies have underscored the capabilities of natural imaging\nfoundation models to serve as powerful feature extractors, even in a zero-shot\nsetting for medical imaging data. Most commonly, a shallow multi-layer\nperceptron (MLP) is appended to the feature extractor to facilitate end-to-end\nlearning and downstream prediction tasks such as classification, thus\nrepresenting the de facto standard. However, as graph neural networks (GNNs)\nhave become a practicable choice for various tasks in medical research in the\nrecent past, we direct attention to the question of how effective GNNs are\ncompared to MLP prediction heads for the task of 3D medical image\nclassification, proposing them as a potential alternative. In our experiments,\nwe devise a subject-level graph for each volumetric dataset instance. Therein\nlatent representations of all slices in the volume, encoded through a DINOv2\npretrained vision transformer (ViT), constitute the nodes and their respective\nnode features. We use public datasets to compare the classification heads\nnumerically and evaluate various graph construction and graph convolution\nmethods in our experiments. Our findings show enhancements of the GNN in\nclassification performance and substantial improvements in runtime compared to\nan MLP prediction head. Additional robustness evaluations further validate the\npromising performance of the GNN, promoting them as a suitable alternative to\ntraditional MLP classification heads. Our code is publicly available at:\nhttps://github.com/compai-lab/2024-miccai-grail-kiechle\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}