{"id":"2407.06513","title":"Computer vision tasks for intelligent aerospace missions: An overview","authors":"Huilin Chen, Qiyu Sun, Fangfei Li, Yang Tang","authorsParsed":[["Chen","Huilin",""],["Sun","Qiyu",""],["Li","Fangfei",""],["Tang","Yang",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 02:50:54 GMT"}],"updateDate":"2024-07-10","timestamp":1720493454000,"abstract":"  Computer vision tasks are crucial for aerospace missions as they help\nspacecraft to understand and interpret the space environment, such as\nestimating position and orientation, reconstructing 3D models, and recognizing\nobjects, which have been extensively studied to successfully carry out the\nmissions. However, traditional methods like Kalman Filtering, Structure from\nMotion, and Multi-View Stereo are not robust enough to handle harsh conditions,\nleading to unreliable results. In recent years, deep learning (DL)-based\nperception technologies have shown great potential and outperformed traditional\nmethods, especially in terms of their robustness to changing environments. To\nfurther advance DL-based aerospace perception, various frameworks, datasets,\nand strategies have been proposed, indicating significant potential for future\napplications. In this survey, we aim to explore the promising techniques used\nin perception tasks and emphasize the importance of DL-based aerospace\nperception. We begin by providing an overview of aerospace perception,\nincluding classical space programs developed in recent years, commonly used\nsensors, and traditional perception methods. Subsequently, we delve into three\nfundamental perception tasks in aerospace missions: pose estimation, 3D\nreconstruction, and recognition, as they are basic and crucial for subsequent\ndecision-making and control. Finally, we discuss the limitations and\npossibilities in current research and provide an outlook on future\ndevelopments, including the challenges of working with limited datasets, the\nneed for improved algorithms, and the potential benefits of multi-source\ninformation fusion.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}