{"id":"2407.03439","title":"DACB-Net: Dual Attention Guided Compact Bilinear Convolution Neural\n  Network for Skin Disease Classification","authors":"Belal Ahmad, Mohd Usama, Tanvir Ahmad, Adnan Saeed, Shabnam Khatoon,\n  Min Chen","authorsParsed":[["Ahmad","Belal",""],["Usama","Mohd",""],["Ahmad","Tanvir",""],["Saeed","Adnan",""],["Khatoon","Shabnam",""],["Chen","Min",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:32:54 GMT"}],"updateDate":"2024-07-08","timestamp":1720031574000,"abstract":"  This paper introduces the three-branch Dual Attention-Guided Compact Bilinear\nCNN (DACB-Net) by focusing on learning from disease-specific regions to enhance\naccuracy and alignment. A global branch compensates for lost discriminative\nfeatures, generating Attention Heat Maps (AHM) for relevant cropped regions.\nFinally, the last pooling layers of global and local branches are concatenated\nfor fine-tuning, which offers a comprehensive solution to the challenges posed\nby skin disease diagnosis. Although current CNNs employ Stochastic Gradient\nDescent (SGD) for discriminative feature learning, using distinct pairs of\nlocal image patches to compute gradients and incorporating a modulation factor\nin the loss for focusing on complex data during training. However, this\napproach can lead to dataset imbalance, weight adjustments, and vulnerability\nto overfitting. The proposed solution combines two supervision branches and a\nnovel loss function to address these issues, enhancing performance and\ninterpretability. The framework integrates data augmentation, transfer\nlearning, and fine-tuning to tackle data imbalance to improve classification\nperformance, and reduce computational costs. Simulations on the HAM10000 and\nISIC2019 datasets demonstrate the effectiveness of this approach, showcasing a\n2.59% increase in accuracy compared to the state-of-the-art.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}