{"id":"2407.12676","title":"CoSIGN: Few-Step Guidance of ConSIstency Model to Solve General INverse\n  Problems","authors":"Jiankun Zhao, Bowen Song and Liyue Shen","authorsParsed":[["Zhao","Jiankun",""],["Song","Bowen",""],["Shen","Liyue",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:57:50 GMT"}],"updateDate":"2024-07-18","timestamp":1721231870000,"abstract":"  Diffusion models have been demonstrated as strong priors for solving general\ninverse problems. Most existing Diffusion model-based Inverse Problem Solvers\n(DIS) employ a plug-and-play approach to guide the sampling trajectory with\neither projections or gradients. Though effective, these methods generally\nnecessitate hundreds of sampling steps, posing a dilemma between inference time\nand reconstruction quality. In this work, we try to push the boundary of\ninference steps to 1-2 NFEs while still maintaining high reconstruction\nquality. To achieve this, we propose to leverage a pretrained distillation of\ndiffusion model, namely consistency model, as the data prior. The key to\nachieving few-step guidance is to enforce two types of constraints during the\nsampling process of the consistency model: soft measurement constraint with\nControlNet and hard measurement constraint via optimization. Supporting both\nsingle-step reconstruction and multistep refinement, the proposed framework\nfurther provides a way to trade image quality with additional computational\ncost. Within comparable NFEs, our method achieves new state-of-the-art in\ndiffusion-based inverse problem solving, showcasing the significant potential\nof employing prior-based inverse problem solvers for real-world applications.\nCode is available at: https://github.com/BioMed-AI-Lab-U-Michgan/cosign.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"28NhX9EUIlqjJDXKe04ARiCpEjpdAp1Z-T8pRRARn80","pdfSize":"5774875","objectId":"0xa3b7c6a14992e5dd907c44c1099e54951ef97a761027583e1baf651be57ff3a4","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
