{"id":"2407.19584","title":"SaulLM-54B & SaulLM-141B: Scaling Up Domain Adaptation for the Legal\n  Domain","authors":"Pierre Colombo, Telmo Pires, Malik Boudiaf, Rui Melo, Dominic Culver,\n  Sofia Morgado, Etienne Malaboeuf, Gabriel Hautreux, Johanne Charpentier,\n  Michael Desa","authorsParsed":[["Colombo","Pierre",""],["Pires","Telmo",""],["Boudiaf","Malik",""],["Melo","Rui",""],["Culver","Dominic",""],["Morgado","Sofia",""],["Malaboeuf","Etienne",""],["Hautreux","Gabriel",""],["Charpentier","Johanne",""],["Desa","Michael",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 20:50:53 GMT"}],"updateDate":"2024-07-30","timestamp":1722199853000,"abstract":"  In this paper, we introduce SaulLM-54B and SaulLM-141B, two large language\nmodels (LLMs) tailored for the legal sector. These models, which feature\narchitectures of 54 billion and 141 billion parameters, respectively, are based\non the Mixtral architecture. The development of SaulLM-54B and SaulLM-141B is\nguided by large-scale domain adaptation, divided into three strategies: (1) the\nexploitation of continued pretraining involving a base corpus that includes\nover 540 billion of legal tokens, (2) the implementation of a specialized legal\ninstruction-following protocol, and (3) the alignment of model outputs with\nhuman preferences in legal interpretations. The integration of synthetically\ngenerated data in the second and third steps enhances the models' capabilities\nin interpreting and processing legal texts, effectively reaching\nstate-of-the-art performance and outperforming previous open-source models on\nLegalBench-Instruct. This work explores the trade-offs involved in\ndomain-specific adaptation at this scale, offering insights that may inform\nfuture studies on domain adaptation using strong decoder models. Building upon\nSaulLM-7B, this study refines the approach to produce an LLM better equipped\nfor legal tasks. We are releasing base, instruct, and aligned versions on top\nof SaulLM-54B and SaulLM-141B under the MIT License to facilitate reuse and\ncollaborative research.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rW3sBWPlI2CAjOBkrB8-GQDAtOvHdNZ5H6zZlDxCQsk","pdfSize":"1076346","objectId":"0x2c4308a5a6dcfea95420c7410a5ce23bf84205feb2f27811c2ec7bdef9afcd3f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
