{"id":"2407.01245","title":"SINKT: A Structure-Aware Inductive Knowledge Tracing Model with Large\n  Language Model","authors":"Lingyue Fu, Hao Guan, Kounianhua Du, Jianghao Lin, Wei Xia, Weinan\n  Zhang, Ruiming Tang, Yasheng Wang and Yong Yu","authorsParsed":[["Fu","Lingyue",""],["Guan","Hao",""],["Du","Kounianhua",""],["Lin","Jianghao",""],["Xia","Wei",""],["Zhang","Weinan",""],["Tang","Ruiming",""],["Wang","Yasheng",""],["Yu","Yong",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 12:44:52 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 12:23:38 GMT"}],"updateDate":"2024-07-24","timestamp":1719837892000,"abstract":"  Knowledge Tracing (KT) aims to determine whether students will respond\ncorrectly to the next question, which is a crucial task in intelligent tutoring\nsystems (ITS). In educational KT scenarios, transductive ID-based methods often\nface severe data sparsity and cold start problems, where interactions between\nindividual students and questions are sparse, and new questions and concepts\nconsistently arrive in the database. In addition, existing KT models only\nimplicitly consider the correlation between concepts and questions, lacking\ndirect modeling of the more complex relationships in the heterogeneous graph of\nconcepts and questions. In this paper, we propose a Structure-aware Inductive\nKnowledge Tracing model with large language model (dubbed SINKT), which, for\nthe first time, introduces large language models (LLMs) and realizes inductive\nknowledge tracing. Firstly, SINKT utilizes LLMs to introduce structural\nrelationships between concepts and constructs a heterogeneous graph for\nconcepts and questions. Secondly, by encoding concepts and questions with LLMs,\nSINKT incorporates semantic information to aid prediction. Finally, SINKT\npredicts the student's response to the target question by interacting with the\nstudent's knowledge state and the question representation. Experiments on four\nreal-world datasets demonstrate that SINKT achieves state-of-the-art\nperformance among 12 existing transductive KT models. Additionally, we explore\nthe performance of SINKT on the inductive KT task and provide insights into\nvarious modules.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}