{"id":"2407.11502","title":"How Control Information Influences Multilingual Text Image Generation\n  and Editing?","authors":"Boqiang Zhang, Zuan Gao, Yadong Qu, Hongtao Xie","authorsParsed":[["Zhang","Boqiang",""],["Gao","Zuan",""],["Qu","Yadong",""],["Xie","Hongtao",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 08:40:21 GMT"},{"version":"v2","created":"Sun, 21 Jul 2024 08:22:18 GMT"}],"updateDate":"2024-07-23","timestamp":1721119221000,"abstract":"  Visual text generation has significantly advanced through diffusion models\naimed at producing images with readable and realistic text. Recent works\nprimarily use a ControlNet-based framework, employing standard font text images\nto control diffusion models. Recognizing the critical role of control\ninformation in generating high-quality text, we investigate its influence from\nthree perspectives: input encoding, role at different stages, and output\nfeatures. Our findings reveal that: 1) Input control information has unique\ncharacteristics compared to conventional inputs like Canny edges and depth\nmaps. 2) Control information plays distinct roles at different stages of the\ndenoising process. 3) Output control features significantly differ from the\nbase and skip features of the U-Net decoder in the frequency domain. Based on\nthese insights, we propose TextGen, a novel framework designed to enhance\ngeneration quality by optimizing control information. We improve input and\noutput features using Fourier analysis to emphasize relevant information and\nreduce noise. Additionally, we employ a two-stage generation framework to align\nthe different roles of control information at different stages. Furthermore, we\nintroduce an effective and lightweight dataset for training. Our method\nachieves state-of-the-art performance in both Chinese and English text\ngeneration. The code and dataset available at\nhttps://github.com/CyrilSterling/TextGen.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}