{"id":"2407.03644","title":"On-Device Training Empowered Transfer Learning For Human Activity\n  Recognition","authors":"Pixi Kang and Julian Moosmann and Sizhen Bian and Michele Magno","authorsParsed":[["Kang","Pixi",""],["Moosmann","Julian",""],["Bian","Sizhen",""],["Magno","Michele",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 05:32:54 GMT"}],"updateDate":"2024-07-08","timestamp":1720071174000,"abstract":"  Human Activity Recognition (HAR) is an attractive topic to perceive human\nbehavior and supplying assistive services. Besides the classical inertial unit\nand vision-based HAR methods, new sensing technologies, such as ultrasound and\nbody-area electric fields, have emerged in HAR to enhance user experience and\naccommodate new application scenarios. As those sensors are often paired with\nAI for HAR, they frequently encounter challenges due to limited training data\ncompared to the more widely IMU or vision-based HAR solutions. Additionally,\nuser-induced concept drift (UICD) is common in such HAR scenarios. UICD is\ncharacterized by deviations in the sample distribution of new users from that\nof the training participants, leading to deteriorated recognition performance.\nThis paper proposes an on-device transfer learning (ODTL) scheme tailored for\nenergy- and resource-constrained IoT edge devices. Optimized on-device training\nengines are developed for two representative MCU-level edge computing\nplatforms: STM32F756ZG and GAP9. Based on this, we evaluated the ODTL benefits\nin three HAR scenarios: body capacitance-based gym activity recognition, QVAR-\nand ultrasonic-based hand gesture recognition. We demonstrated an improvement\nof 3.73%, 17.38%, and 3.70% in the activity recognition accuracy, respectively.\nBesides this, we observed that the RISC-V-based GAP9 achieves 20x and 280x less\nlatency and power consumption than STM32F7 MCU during the ODTL deployment,\ndemonstrating the advantages of employing the latest low-power parallel\ncomputing devices for edge tasks.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}