{"id":"2407.02562","title":"Vortex-p: a Helmholtz-Hodge and Reynolds decomposition algorithm for\n  particle-based simulations","authors":"David Vall\\'es-P\\'erez, Susana Planelles, Vicent Quilis, Frederick\n  Groth, Tirso Marin-Gilabert, Klaus Dolag","authorsParsed":[["Vallés-Pérez","David",""],["Planelles","Susana",""],["Quilis","Vicent",""],["Groth","Frederick",""],["Marin-Gilabert","Tirso",""],["Dolag","Klaus",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 18:00:02 GMT"}],"updateDate":"2024-07-10","timestamp":1719943202000,"abstract":"  Astrophysical turbulent flows display an intrinsically multi-scale nature,\nmaking their numerical simulation and the subsequent analyses of simulated data\na complex problem. In particular, two fundamental steps in the study of\nturbulent velocity fields are the Helmholtz-Hodge decomposition\n(compressive+solenoidal; HHD) and the Reynolds decomposition (bulk+turbulent;\nRD). These problems are relatively simple to perform numerically for\nuniformly-sampled data, such as the one emerging from Eulerian, fix-grid\nsimulations; but their computation is remarkably more complex in the case of\nnon-uniformly sampled data, such as the one stemming from particle-based or\nmeshless simulations. In this paper, we describe, implement and test vortex-p,\na publicly available tool evolved from the vortex code, to perform both these\ndecompositions upon the velocity fields of particle-based simulations, either\nfrom smoothed particle hydrodynamics (SPH), moving-mesh or meshless codes. The\nalgorithm relies on the creation of an ad-hoc adaptive mesh refinement (AMR)\nset of grids, on which the input velocity field is represented. HHD is then\naddressed by means of elliptic solvers, while for the RD we adapt an iterative,\nmulti-scale filter. We perform a series of idealised tests to assess the\naccuracy, convergence and scaling of the code. Finally, we present some\napplications of the code to various SPH and meshless finite-mass (MFM)\nsimulations of galaxy clusters performed with OpenGadget3, with different\nresolutions and physics, to showcase the capabilities of the code.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}