{"id":"2407.17428","title":"Vision Language Model-Empowered Contract Theory for AIGC Task Allocation\n  in Teleoperation","authors":"Zijun Zhan, Yaxian Dong, Yuqing Hu, Shuai Li, Shaohua Cao, and Zhu Han","authorsParsed":[["Zhan","Zijun",""],["Dong","Yaxian",""],["Hu","Yuqing",""],["Li","Shuai",""],["Cao","Shaohua",""],["Han","Zhu",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 20:08:26 GMT"}],"updateDate":"2024-07-25","timestamp":1720555706000,"abstract":"  Integrating low-light image enhancement techniques, in which diffusion-based\nAI-generated content (AIGC) models are promising, is necessary to enhance\nnighttime teleoperation. Remarkably, the AIGC model is computation-intensive,\nthus necessitating the allocation of AIGC tasks to edge servers with ample\ncomputational resources. Given the distinct cost of the AIGC model trained with\nvarying-sized datasets and AIGC tasks possessing disparate demand, it is\nimperative to formulate a differential pricing strategy to optimize the utility\nof teleoperators and edge servers concurrently. Nonetheless, the pricing\nstrategy formulation is under information asymmetry, i.e., the demand (e.g.,\nthe difficulty level of AIGC tasks and their distribution) of AIGC tasks is\nhidden information to edge servers. Additionally, manually assessing the\ndifficulty level of AIGC tasks is tedious and unnecessary for teleoperators. To\nthis end, we devise a framework of AIGC task allocation assisted by the Vision\nLanguage Model (VLM)-empowered contract theory, which includes two components:\nVLM-empowered difficulty assessment and contract theory-assisted AIGC task\nallocation. The first component enables automatic and accurate AIGC task\ndifficulty assessment. The second component is capable of formulating the\npricing strategy for edge servers under information asymmetry, thereby\noptimizing the utility of both edge servers and teleoperators. The simulation\nresults demonstrated that our proposed framework can improve the average\nutility of teleoperators and edge servers by 10.88~12.43% and 1.4~2.17%,\nrespectively. Code and data are available at\nhttps://github.com/ZiJun0819/VLM-Contract-Theory.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}