{"id":"2407.07335","title":"Causal Leverage Density: A General Approach to Semantic Information","authors":"Stuart J Bartlett","authorsParsed":[["Bartlett","Stuart J",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 03:17:14 GMT"}],"updateDate":"2024-07-11","timestamp":1720581434000,"abstract":"  I introduce a new approach to semantic information based upon the influence\nof erasure operations (interventions) upon distributions of a system's future\ntrajectories through its phase space. Semantic (meaningful) information is\ndistinguished from syntactic information by the property of having some\nintrinsic causal power on the future of a given system. As Shannon famously\nstated, syntactic information is a simple property of probability distributions\n(the elementary Shannon expression), or correlations between two subsystems and\nthus does not tell us anything about the meaning of a given message. Kolchinsky\n& Wolpert (2018) introduced a powerful framework for computing semantic\ninformation, which employs interventions upon the state of a system (either\ninitial or dynamic) to erase syntactic information that might influence the\nviability of a subsystem (such as an organism in an environment). In this work\nI adapt this framework such that rather than using the viability of a\nsubsystem, we simply observe the changes in future trajectories through a\nsystem's phase space as a result of informational interventions (erasures or\nscrambling). This allows for a more general formalisation of semantic\ninformation that does not assume a primary role for the viability of a\nsubsystem (to use examples from Kolchinsky & Wolpert (2018), a rock, a\nhurricane, or a cell). Many systems of interest have a semantic component, such\nas a neural network, but may not have such an intrinsic connection to viability\nas living organisms or dissipative structures. Hence this simple approach to\nsemantic information could be applied to any living, non-living or\ntechnological system in order to quantify whether a given quantity of syntactic\ninformation within it also has semantic or causal power.\n","subjects":["Condensed Matter/Statistical Mechanics","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1ocYHhOrWSJjNwTrP574LUocOfLUcprEqeO34RnuIJw","pdfSize":"104687"}
