{"id":"2407.15301","title":"U-learning for Prediction Inference via Combinatory Multi-Subsampling:\n  With Applications to LASSO and Neural Networks","authors":"Zhe Fei, Yi Li","authorsParsed":[["Fei","Zhe",""],["Li","Yi",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 00:03:51 GMT"}],"updateDate":"2024-07-23","timestamp":1721606631000,"abstract":"  Epigenetic aging clocks play a pivotal role in estimating an individual's\nbiological age through the examination of DNA methylation patterns at numerous\nCpG (Cytosine-phosphate-Guanine) sites within their genome. However, making\nvalid inferences on predicted epigenetic ages, or more broadly, on predictions\nderived from high-dimensional inputs, presents challenges. We introduce a novel\nU-learning approach via combinatory multi-subsampling for making ensemble\npredictions and constructing confidence intervals for predictions of continuous\noutcomes when traditional asymptotic methods are not applicable. More\nspecifically, our approach conceptualizes the ensemble estimators within the\nframework of generalized U-statistics and invokes the H\\'ajek projection for\nderiving the variances of predictions and constructing confidence intervals\nwith valid conditional coverage probabilities. We apply our approach to two\ncommonly used predictive algorithms, Lasso and deep neural networks (DNNs), and\nillustrate the validity of inferences with extensive numerical studies. We have\napplied these methods to predict the DNA methylation age (DNAmAge) of patients\nwith various health conditions, aiming to accurately characterize the aging\nprocess and potentially guide anti-aging interventions.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Mathematics/Statistics Theory","Quantitative Biology/Quantitative Methods","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"r7pgGk_jZMbv6OsyyJ50n1UnWm-19u9BCiCxY2VcwEw","pdfSize":"1063454","objectId":"0x948715453d5b2e1bc52f1cc4ab22081d5134150ffceecb65d36ef8b432f1da7b","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
