{"id":"2407.07458","title":"Machine Learning Assisted Design of mmWave Wireless Transceiver Circuits","authors":"Xuzhe Zhao","authorsParsed":[["Zhao","Xuzhe",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 08:21:01 GMT"}],"updateDate":"2024-07-11","timestamp":1720599661000,"abstract":"  As fifth-generation (5G) and upcoming sixth-generation (6G) communications\nexhibit tremendous demands in providing high data throughput with a relatively\nlow latency, millimeter-wave (mmWave) technologies manifest themselves as the\nkey enabling components to achieve the envisioned performance and tasks. In\nthis context, mmWave integrated circuits (IC) have attracted significant\nresearch interests over the past few decades, ranging from individual block\ndesign to complex system design. However, the highly nonlinear properties and\nintricate trade-offs involved render the design of analog or RF circuits a\ncomplicated process. The rapid evolution of fabrication technology also results\nin an increasingly long time allocated in the design process due to more\nstringent requirements. In this thesis, 28-GHz transceiver circuits are first\ninvestigated with detailed schematics and associated performance metrics. In\nthis case, two target systems comprising heterogeneous individual blocks are\nselected and demonstrated on both the transmitter and receiver sides.\nSubsequently, some conventional and large-scale machine learning (ML)\napproaches are integrated into the design pipeline of the chosen systems to\npredict circuit parameters based on desired specifications, thereby\ncircumventing the typical time-consuming iterations found in traditional\nmethods. Finally, some potential research directions are discussed from the\nperspectives of circuit design and ML algorithms.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Emerging Technologies","Computing Research Repository/Information Theory","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}