{"id":"2407.09952","title":"The STAR Forward Silicon Tracker","authors":"J. D. Brandenburg, Y. Chang, J. Dong, Y. He, Y. Hu, H. Huang, T.\n  Huang, H. Li, M. Nie, R. Sharma, X. Sun, P. Tribedy, F. Videb{\\ae}k, G.\n  Visser, G. Wilks, P. Wang, G. Xie, G. Yan, Z. Ye, L. Yi, Y. Yang, S. Zhang,\n  Z. Zhang","authorsParsed":[["Brandenburg","J. D.",""],["Chang","Y.",""],["Dong","J.",""],["He","Y.",""],["Hu","Y.",""],["Huang","H.",""],["Huang","T.",""],["Li","H.",""],["Nie","M.",""],["Sharma","R.",""],["Sun","X.",""],["Tribedy","P.",""],["Videbæk","F.",""],["Visser","G.",""],["Wilks","G.",""],["Wang","P.",""],["Xie","G.",""],["Yan","G.",""],["Ye","Z.",""],["Yi","L.",""],["Yang","Y.",""],["Zhang","S.",""],["Zhang","Z.",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 17:26:22 GMT"}],"updateDate":"2024-07-16","timestamp":1720891582000,"abstract":"  The Forward Silicon Tracker (FST) is a pivotal component of the forward\nupgrade of the Solenoidal Tracker at RHIC (STAR), designed to discern hadron\ncharge signs with a momentum resolution better than 30\\% for $0.2 < p_T < 2$\nGeV/c in the $2.5 < \\eta < 4$ pseudorapidity range. Its compact design features\nthree disks along the beam direction, minimized material budget and scattering\neffects. The FST uses Hamamatsu's p-in-n silicon strip sensors with a double\nmetal layer for efficient signal processing. The flexible hybrid boards,\nessential for the readout system, are constructed with Kapton and copper layers\nto optimize signal handling and power distribution. These boards connect\nsilicon strips to analogue pipeline ASIC APV25-S1 chips, which read up to 128\nchannels each. A cooling system with nonconducting, volatile NOVEC 7200 coolant\nat 22.2{\\deg}C mitigates ASIC-generated heat. The FST enhances forward tracking\nperformance at RHIC, showcasing unique design solutions to complex challenges.\n","subjects":["Physics/Instrumentation and Detectors","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"RstYMnA9oHVS4vJdiEdgelC8luXYZgTIZVand4Kn3bk","pdfSize":"40532883"}
