{"id":"2407.05286","title":"Stability and Generalization for Stochastic Recursive Momentum-based\n  Algorithms for (Strongly-)Convex One to $K$-Level Stochastic Optimizations","authors":"Xiaokang Pan, Xingyu Li, Jin Liu, Tao Sun, Kai Sun, Lixing Chen, Zhe\n  Qu","authorsParsed":[["Pan","Xiaokang",""],["Li","Xingyu",""],["Liu","Jin",""],["Sun","Tao",""],["Sun","Kai",""],["Chen","Lixing",""],["Qu","Zhe",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 07:07:04 GMT"}],"updateDate":"2024-07-09","timestamp":1720336024000,"abstract":"  STOchastic Recursive Momentum (STORM)-based algorithms have been widely\ndeveloped to solve one to $K$-level ($K \\geq 3$) stochastic optimization\nproblems. Specifically, they use estimators to mitigate the biased gradient\nissue and achieve near-optimal convergence results. However, there is\nrelatively little work on understanding their generalization performance,\nparticularly evident during the transition from one to $K$-level optimization\ncontexts. This paper provides a comprehensive generalization analysis of three\nrepresentative STORM-based algorithms: STORM, COVER, and SVMR, for one, two,\nand $K$-level stochastic optimizations under both convex and strongly convex\nsettings based on algorithmic stability. Firstly, we define stability for\n$K$-level optimizations and link it to generalization. Then, we detail the\nstability results for three prominent STORM-based algorithms. Finally, we\nderive their excess risk bounds by balancing stability results with\noptimization errors. Our theoretical results provide strong evidence to\ncomplete STORM-based algorithms: (1) Each estimator may decrease their\nstability due to variance with its estimation target. (2) Every additional\nlevel might escalate the generalization error, influenced by the stability and\nthe variance between its cumulative stochastic gradient and the true gradient.\n(3) Increasing the batch size for the initial computation of estimators\npresents a favorable trade-off, enhancing the generalization performance.\n","subjects":["Computing Research Repository/Machine Learning","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}