{"id":"2407.11970","title":"PECCARY: A novel approach for characterizing orbital complexity,\n  stochasticity, and regularity","authors":"S\\'oley \\'O. Hyman, Kathryne J. Daniel, David A. Schaffner","authorsParsed":[["Hyman","Sóley Ó.",""],["Daniel","Kathryne J.",""],["Schaffner","David A.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 17:59:56 GMT"}],"updateDate":"2024-07-17","timestamp":1721152796000,"abstract":"  Permutation Entropy and statistiCal Complexity Analysis for astRophysics\n(PECCARY) is a computationally inexpensive, statistical method by which any\ntime-series can be characterized as predominately regular, complex, or\nstochastic. Elements of the PECCARY method have been used in a variety of\nphysical, biological, economic, and mathematical scenarios, but have not yet\ngained traction in the astrophysical community. This study introduces the\nPECCARY technique with the specific aims to motivate its use in and optimize it\nfor the analysis of astrophysical orbital systems. PECCARY works by decomposing\na time-dependent measure, such as the x-coordinate or orbital angular momentum\ntime-series, into ordinal patterns. Due to its unique approach and statistical\nnature, PECCARY is well-suited for detecting preferred and forbidden patterns\n(a signature of chaos), even when the chaotic behavior is short-lived or when\nworking with a relatively short duration time-series or small sets of\ntime-series data. A variety of examples are used to demonstrate the\ncapabilities of PECCARY. These include mathematical examples (sine waves,\nvarieties of noise, sums of sine waves, well-known chaotic functions), a double\npendulum system, and astrophysical tracer particle simulations with potentials\nof varying intricacies. Since the adopted timescale used to diagnose a given\ntime-series can affect the outcome, a method is presented to identify an ideal\nsampling scheme, constrained by the overall duration and the natural timescale\nof the system. The accompanying PECCARY Python package and its usage are\ndiscussed.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}