{"id":"2407.01336","title":"Compressed Sensing Inspired User Acquisition for Downlink Integrated\n  Sensing and Communication Transmissions","authors":"Yi Song, Fernando Pedraza, Shuangyang Li, Siyao Li, Han Yu, and\n  Giuseppe Caire","authorsParsed":[["Song","Yi",""],["Pedraza","Fernando",""],["Li","Shuangyang",""],["Li","Siyao",""],["Yu","Han",""],["Caire","Giuseppe",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 14:46:08 GMT"}],"updateDate":"2024-07-02","timestamp":1719845168000,"abstract":"  This paper investigates radar-assisted user acquisition for downlink\nmulti-user multiple-input multiple-output (MIMO) transmission using Orthogonal\nFrequency Division Multiplexing (OFDM) signals. Specifically, we formulate a\nconcise mathematical model for the user acquisition problem, where each user is\ncharacterized by its delay and beamspace response. Therefore, we propose a\ntwo-stage method for user acquisition, where the Multiple Signal Classification\n(MUSIC) algorithm is adopted for delay estimation, and then a least absolute\nshrinkage and selection operator (LASSO) is applied for estimating the user\nresponse in the beamspace. Furthermore, we also provide a comprehensive\nperformance analysis of the considered problem based on the pair-wise error\nprobability (PEP). Particularly, we show that the rank and the geometric mean\nof non-zero eigenvalues of the squared beamspace difference matrix determines\nthe user acquisition performance. More importantly, we reveal that\nsimultaneously probing multiple beams outperforms concentrating power on a\nspecific beam direction in each time slot under the power constraint, when only\nlimited OFDM symbols are transmitted. Our numerical results confirm our\nconclusions and also demonstrate a promising acquisition performance of the\nproposed two-stage method.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}