{"id":"2407.18082","title":"Well posedness of F. John's floating body problem for a fixed object","authors":"David Lannes, Mei Ming","authorsParsed":[["Lannes","David",""],["Ming","Mei",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 14:45:13 GMT"}],"updateDate":"2024-07-26","timestamp":1721918713000,"abstract":"  The goal of this paper is to prove the well-posedness of F. John's floating\nbody problem in the case of a fixed object and for unsteady waves, in\nhorizontal dimension $d=1$ and with a possibly emerging bottom. This problem\ndescribes the interactions of waves with a partially immersed object using the\nlinearized Bernoulli equations. The fluid domain $\\Omega$ therefore has corners\nwhere the object meets the free surface, which consists of various connected\ncomponents. The energy space associated with this problem involves the space of\ntraces on these different connected components of all functions in the\nBeppo-Levi space $\\dot{H}^1(\\Omega)$; we characterize this space, exhibiting\nnon local effects linking the different connected components. We prove the\nwell-posedness of the Laplace equation in corner domains, with mixed boundary\nconditions and Dirichlet data in this trace space, and study several properties\nof the associated Dirichlet-Neumann operator (self-adjointness, ellipticity\nproperties, etc.). This trace space being only semi-normed, we cannot use\nstandard semi-group theory to solve F. John's problem: one has to choose a\nrealization of the homogeneous space (i.e. choose an adequate representative in\nthe equivalence class) we are working with. When the fluid domain is bounded,\nthis realization is obtained by imposing a zero-mass condition; for unbounded\nfluid domains, we have to choose a space-time realization which can be\ninterpreted as a particular choice of the Bernoulli constant. Well-posedness in\nthe energy space is then proved. Conditions for higher order regularity in\ntimes are then derived, which yield some limited space regularity that can be\nimproved through smallness assumption on the contact angles. We finally show\nthat higher order regularity away from the contact points can be achieved\nthrough weighted estimates.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}