{"id":"2407.16131","title":"Crystals with Transformers on Graphs, for Prediction of Unconventional\n  Crystal Material Properties and the Benchmark","authors":"Hongyi Wang, Ji Sun, Jinzhe Liang, Li Zhai, Zitian Tang, Zijian Li,\n  Wei Zhai, Xusheng Wang, Weihao Gao, Sheng Gong, Bolong Huang, Hua Zhang","authorsParsed":[["Wang","Hongyi",""],["Sun","Ji",""],["Liang","Jinzhe",""],["Zhai","Li",""],["Tang","Zitian",""],["Li","Zijian",""],["Zhai","Wei",""],["Wang","Xusheng",""],["Gao","Weihao",""],["Gong","Sheng",""],["Huang","Bolong",""],["Zhang","Hua",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 02:31:06 GMT"}],"updateDate":"2024-07-24","timestamp":1721701866000,"abstract":"  The ionic bonding across the lattice and ordered microscopic structures endow\ncrystals with unique symmetry and determine their macroscopic properties.\nUnconventional crystals, in particular, exhibit non-traditional lattice\nstructures or possess exotic physical properties, making them intriguing\nsubjects for investigation. Therefore, to accurately predict the physical and\nchemical properties of crystals, it is crucial to consider long-range orders.\nWhile GNN excels at capturing the local environment of atoms in crystals, they\noften face challenges in effectively capturing longer-ranged interactions due\nto their limited depth. In this paper, we propose CrysToGraph\n($\\textbf{Crys}$tals with $\\textbf{T}$ransformers $\\textbf{o}$n\n$\\textbf{Graph}$s), a novel transformer-based geometric graph network designed\nspecifically for unconventional crystalline systems, and UnconvBench, a\ncomprehensive benchmark to evaluate models' predictive performance on\nunconventional crystal materials such as defected crystals, low-dimension\ncrystals and MOF. CrysToGraph effectively captures short-range interactions\nwith transformer-based graph convolution blocks as well as long-range\ninteractions with graph-wise transformer blocks. CrysToGraph proofs its\neffectiveness in modelling unconventional crystal materials in multiple tasks,\nand moreover, it outperforms most existing methods, achieving new\nstate-of-the-art results on the benchmarks of both unconventional crystals and\ntraditional crystals.\n","subjects":["Condensed Matter/Materials Science","Computing Research Repository/Machine Learning","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}