{"id":"2407.16669","title":"Joint Inference of Population, Cosmology, and Neutron Star Equation of\n  State from Gravitational Waves of Dark Binary Neutron Stars","authors":"Tathagata Ghosh, Bhaskar Biswas, Sukanta Bose, Shasvath J. Kapadia","authorsParsed":[["Ghosh","Tathagata",""],["Biswas","Bhaskar",""],["Bose","Sukanta",""],["Kapadia","Shasvath J.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:37:43 GMT"}],"updateDate":"2024-07-24","timestamp":1721756263000,"abstract":"  Gravitational waves (GWs) from binary neutron stars (BNSs) are expected to be\naccompanied by electromagnetic (EM) emissions, which help to identify the host\ngalaxy. Since GW events directly measure their luminosity distances, joint\nGW-EM observations from BNSs help to study cosmology, particularly the Hubble\nconstant, unaffected by cosmic distance ladder systematics. However, detecting\nEM counterparts from BNS mergers is not always possible. Additionally, the\ntidal deformations of BNS components offer insights into the neutron star (NS)\nequation of state (EoS). In such cases, the tidal parameters of NSs, combined\nwith the knowledge of the NS EoS, can break the degeneracy between mass\nparameters and redshift, allowing for the inference of the Hubble constant.\nSeveral efforts have aimed to infer the Hubble constant using the tidal\nparameters of BNSs, without EM counterparts, termed dark BNSs. Moreover, some\nstudies have focused on the joint estimation of population and NS EoS for\nunbiased NS EoS estimation. However, none of the works consistently combined\nthe uncertainties of population, cosmology, and NS EoS within a Bayesian\nframework. In this study, we propose a novel Bayesian analysis to jointly\nconstrain the NS EoS, population, and cosmological parameters using a\npopulation of dark BNSs detected through GW observations. This method can well\nconstrain the Hubble constant with as few as $5$ BNS observations using\ncurrent-generation detectors. This level of precision is unattainable without\nincorporating the NS EoS, especially when observing BNS mergers without EM\ncounterpart information.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena","Physics/Nuclear Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}