{"id":"2407.21004","title":"Evolver: Chain-of-Evolution Prompting to Boost Large Multimodal Models\n  for Hateful Meme Detection","authors":"Jinfa Huang and Jinsheng Pan and Zhongwei Wan and Hanjia Lyu and Jiebo\n  Luo","authorsParsed":[["Huang","Jinfa",""],["Pan","Jinsheng",""],["Wan","Zhongwei",""],["Lyu","Hanjia",""],["Luo","Jiebo",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 17:51:44 GMT"}],"updateDate":"2024-07-31","timestamp":1722361904000,"abstract":"  Recent advances show that two-stream approaches have achieved outstanding\nperformance in hateful meme detection. However, hateful memes constantly evolve\nas new memes emerge by fusing progressive cultural ideas, making existing\nmethods obsolete or ineffective. In this work, we explore the potential of\nLarge Multimodal Models (LMMs) for hateful meme detection. To this end, we\npropose Evolver, which incorporates LMMs via Chain-of-Evolution (CoE)\nPrompting, by integrating the evolution attribute and in-context information of\nmemes. Specifically, Evolver simulates the evolving and expressing process of\nmemes and reasons through LMMs in a step-by-step manner. First, an evolutionary\npair mining module retrieves the top-k most similar memes in the external\ncurated meme set with the input meme. Second, an evolutionary information\nextractor is designed to summarize the semantic regularities between the paired\nmemes for prompting. Finally, a contextual relevance amplifier enhances the\nin-context hatefulness information to boost the search for evolutionary\nprocesses. Extensive experiments on public FHM, MAMI, and HarM datasets show\nthat CoE prompting can be incorporated into existing LMMs to improve their\nperformance. More encouragingly, it can serve as an interpretive tool to\npromote the understanding of the evolution of social memes.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}