{"id":"2407.16652","title":"Cosmological Correlators for Bogoliubov Initial States","authors":"Alistair J. Chopping, Charlotte Sleight, Massimo Taronna","authorsParsed":[["Chopping","Alistair J.",""],["Sleight","Charlotte",""],["Taronna","Massimo",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:10:16 GMT"}],"updateDate":"2024-07-24","timestamp":1721754616000,"abstract":"  We consider late-time correlators in de Sitter (dS) space for initial states\nrelated to the Bunch-Davies vacuum by a Bogoliubov transformation. We propose\nto study such late-time correlators by reformulating them in the familiar\nlanguage of Witten diagrams in Euclidean anti-de Sitter space (EAdS), showing\nthat they can be perturbatively re-cast in terms of corresponding dS boundary\ncorrelators in the Bunch-Davies vacuum and in turn, Witten diagrams in EAdS.\nUnlike the standard relationship between late-time correlators in the\nBunch-Davies vacuum and EAdS Witten diagrams, this involves points on the upper\nand lower sheet of the EAdS hyperboloid which account for antipodal\nsingularities of the two-point functions. Such Bogoliubov states include an\ninfinite one parameter family of de Sitter invariant vacua as a special case,\nwhere the late-time correlators are constrained by Conformal Ward identities.\nIn momentum space, it is well known that their late-time correlators exhibit\nsingularities in collinear (\"folded\") momentum configurations. We give a\nposition space interpretation of such solutions to the conformal Ward\nidentities, where in embedding space they can be generated from the solution\nwithout collinear singularities by application of the antipodal map. We also\ndiscuss the operator product expansion (OPE) limit of late-time correlators in\na generic dS invariant vacuum. Many results are derived using the Mellin space\nrepresentation of late-time correlators, which in this work we extend to\naccommodate generic dS invariant vacua.\n","subjects":["Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}