{"id":"2407.20057","title":"Reconstructing Global Daily CO2 Emissions via Machine Learning","authors":"Tao Li, Lixing Wang, Zihan Qiu, Philippe Ciais, Taochun Sun, Matthew\n  W. Jones, Robbie M. Andrew, Glen P. Peters, Piyu ke, Xiaoting Huang, Robert\n  B. Jackson and Zhu Liu","authorsParsed":[["Li","Tao",""],["Wang","Lixing",""],["Qiu","Zihan",""],["Ciais","Philippe",""],["Sun","Taochun",""],["Jones","Matthew W.",""],["Andrew","Robbie M.",""],["Peters","Glen P.",""],["ke","Piyu",""],["Huang","Xiaoting",""],["Jackson","Robert B.",""],["Liu","Zhu",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 14:44:14 GMT"}],"updateDate":"2024-07-30","timestamp":1722264254000,"abstract":"  High temporal resolution CO2 emission data are crucial for understanding the\ndrivers of emission changes, however, current emission dataset is only\navailable on a yearly basis. Here, we extended a global daily CO2 emissions\ndataset backwards in time to 1970 using machine learning algorithm, which was\ntrained to predict historical daily emissions on national scales based on\nrelationships between daily emission variations and predictors established for\nthe period since 2019. Variation in daily CO2 emissions far exceeded the\nsmoothed seasonal variations. For example, the range of daily CO2 emissions\nequivalent to 31% of the year average daily emissions in China and 46% of that\nin India in 2022, respectively. We identified the critical emission-climate\ntemperature (Tc) is 16.5 degree celsius for global average (18.7 degree celsius\nfor China, 14.9 degree celsius for U.S., and 18.4 degree celsius for Japan), in\nwhich negative correlation observed between daily CO2 emission and ambient\ntemperature below Tc and a positive correlation above it, demonstrating\nincreased emissions associated with higher ambient temperature. The long-term\ntime series spanning over fifty years of global daily CO2 emissions reveals an\nincreasing trend in emissions due to extreme temperature events, driven by the\nrising frequency of these occurrences. This work suggests that, due to climate\nchange, greater efforts may be needed to reduce CO2 emissions.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Computing Research Repository/Machine Learning","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}