{"id":"2407.00772","title":"Core-level signature of long-range density-wave order and short-range\n  excitonic correlations probed by attosecond broadband spectroscopy","authors":"Alfred Zong, Sheng-Chih Lin, Shunsuke A. Sato, Emma Berger, Bailey R.\n  Nebgen, Marcus Hui, B. Q. Lv, Yun Cheng, Wei Xia, Yanfeng Guo, Dao Xiang,\n  Michael W. Zuerch","authorsParsed":[["Zong","Alfred",""],["Lin","Sheng-Chih",""],["Sato","Shunsuke A.",""],["Berger","Emma",""],["Nebgen","Bailey R.",""],["Hui","Marcus",""],["Lv","B. Q.",""],["Cheng","Yun",""],["Xia","Wei",""],["Guo","Yanfeng",""],["Xiang","Dao",""],["Zuerch","Michael W.",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 17:20:52 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 04:57:51 GMT"}],"updateDate":"2024-07-17","timestamp":1719768052000,"abstract":"  Advances in attosecond core-level spectroscopies have successfully unlocked\nthe fastest dynamics involving high-energy electrons. Yet, these techniques are\nnot conventionally regarded as an appropriate probe for low-energy\nquasiparticle interactions that govern the ground state of quantum materials,\nnor for studying long-range order because of their limited sensitivity to local\ncharge environments. Here, by employing a unique cryogenic attosecond beamline,\nwe identified clear core-level signatures of long-range charge-density-wave\n(CDW) formation in a quasi-2D excitonic insulator candidate, even though\nequilibrium photoemission and absorption measurements of the same core levels\nshowed no spectroscopic singularity at the phase transition. Leveraging the\nhigh time resolution and intrinsic sensitivity to short-range charge\nexcitations in attosecond core-level absorption, we observed compelling\ntime-domain evidence for excitonic correlations in the normal-state of the\nmaterial, whose presence has been subjected to a long-standing debate in\nequilibrium experiments because of interfering phonon fluctuations in a similar\npart of the phase space. Our findings support the scenario that short-range\nexcitonic fluctuations prelude long-range order formation in the ground state,\nproviding important insights in the mechanism of exciton condensation in a\nquasi-low-dimensional system. These results further demonstrate the importance\nof a simultaneous access to long- and short-range order with underlying\ndynamical processes spanning a multitude of time- and energy-scales, making\nattosecond spectroscopy an indispensable tool for both understanding the\nequilibrium phase diagram and for discovering novel, nonequilibrium states in\nstrongly correlated materials.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science","Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}