{"id":"2407.20867","title":"Kinematic Lensing with the Dark Energy Spectroscopic Instrument --\n  Probing structure formation at very low redshift","authors":"Jiachuan Xu, Tim Eifler, Eason Wang, Elisabeth Krause, Spencer\n  Everett, Eric Huff, Pranjal R. S., Yu-Hsiu Huang","authorsParsed":[["Xu","Jiachuan",""],["Eifler","Tim",""],["Wang","Eason",""],["Krause","Elisabeth",""],["Everett","Spencer",""],["Huff","Eric",""],["S.","Pranjal R.",""],["Huang","Yu-Hsiu",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 14:42:01 GMT"}],"updateDate":"2024-07-31","timestamp":1722350521000,"abstract":"  We explore the science prospects of a 14,000 deg$^2$ Kinematic Lensing (KL)\nsurvey with the Dark Energy Spectroscopic Instrument (DESI) and overlapping\nimaging surveys. KL infers the cosmic shear signal by jointly forward modeling\nthe observed photometric image and velocity field of a disk galaxy. The latter\ncan be constrained by placing multiple DESI fibers along the galaxy's major and\nminor axis, a concept similar to the DESI Peculiar Velocity Survey. We study\nmultiple subset galaxy samples of the DESI Legacy Survey Data Release 9 catalog\nand quantify the residual shape noise, $\\sigma_\\epsilon$, of each sample as a\nfunction of cuts in $r$-band magnitude using mock observations. We conduct\nsimulated likelihood analyses for these galaxy samples and find that a DESI-KL\nprogram can place highly interesting constraints on structure formation at very\nlow redshifts, i.e. $\\sigma_8(z<0.15)$. We conclude that if the $S_8$ tension\nconsolidates as a phenomenon, a DESI-KL survey can provide unique insights into\nthis phenomenon in the very late-time Universe. Given the different footprints\nof DESI and Rubin Observatory's Legacy Survey of Space and Time (LSST), lensing\nresults from both surveys are highly complementary and can be combined into a\njoint lensing survey. We further note that DESI-KL benefits multiple additional\nscience cases, e.g. studies of modified gravity models when combined with\npeculiar velocity surveys, and dark matter studies that are based on\ngalaxy-galaxy lensing of dwarf galaxies.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XeM2FfYzjzmxae5FtXQwnfoeF8tfmLhC_ITUh9B9-Ew","pdfSize":"592502"}
