{"id":"2407.04954","title":"Extremely Large-Scale Dynamic Metasurface Antennas (XL-DMAs): Near-Field\n  Modeling and Channel Estimation","authors":"Songjie Yang, Wanting Lyu, Boyu Ning, Yue Xiu, Youzhi Xiong, Hua Chen,\n  Chadi Assi, and Chau Yuen","authorsParsed":[["Yang","Songjie",""],["Lyu","Wanting",""],["Ning","Boyu",""],["Xiu","Yue",""],["Xiong","Youzhi",""],["Chen","Hua",""],["Assi","Chadi",""],["Yuen","Chau",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 04:26:06 GMT"}],"updateDate":"2024-07-09","timestamp":1720239966000,"abstract":"  Dynamic metasurface antennas (DMAs) represent a novel transceiver array\narchitecture for extremely large-scale (XL) communications, offering the\nadvantages of reduced power consumption and lower hardware costs compared to\nconventional arrays.\n  This paper focuses on near-field channel estimation for XL-DMAs. We begin by\nanalyzing the near-field characteristics of uniform planar arrays (UPAs) and\nintroducing the Oblong Approx. model. This model decouples elevation-azimuth\n(EL-AZ) parameters for XL-DMAs, providing an effective means to characterize\nthe near-field effect. It offers simpler mathematical expressions than the\nsecond-order Taylor expansion model, all while maintaining negligible model\nerrors for oblong-shaped arrays.\n  Building on the Oblong Approx. model, we propose an EL-AZ-decoupled\nestimation framework that involves near- and far-field parameter estimation for\nAZ/EL and EL/AZ directions, respectively. The former is formulated as a\ndistributed compressive sensing problem, addressed using the proposed off-grid\ndistributed orthogonal least squares algorithm, while the latter involves a\nstraightforward parallelizable search. Crucially, we illustrate the viability\nof decoupled EL-AZ estimation for near-field UPAs, exhibiting commendable\nperformance and linear complexity correlated with the number of metasurface\nelements.\n  Moreover, we design an measurement matrix optimization method with the\nLorentzian constraint on DMAs and highlight the estimation performance\ndegradation resulting from this constraint.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}