{"id":"2407.02249","title":"Modulation of Point Defect Properties Near Surfaces in Metal Halide\n  Perovskites","authors":"Bilal Ahmad and Md Salman Rabbi Limon and Zeeshan Ahmad","authorsParsed":[["Ahmad","Bilal",""],["Limon","Md Salman Rabbi",""],["Ahmad","Zeeshan",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 13:13:30 GMT"}],"updateDate":"2024-07-03","timestamp":1719926010000,"abstract":"  It is now widely recognized that surface and interfacial defects exhibit\ndistinct behavior compared to bulk defects in metal halide perovskites.\nHowever, the transition from bulk to surface behavior and the spatial extent of\nthe surface's influence are not well understood. To address this, we conducted\nfirst-principles calculations on iodine vacancies and interstitial defects in\nmethylammonium lead iodide and cesium lead iodide at various depths from the\nsurface, enabling us to map out depth-dependent behavior. We find that the\ndefect formation energy follows a saturating exponential curve as the defect\nmoves away from the surface to the bulk. Using first-principles calculated\ndefect formation energies, we quantify the extent of the surface's influence by\ncalculating the decay length associated with each defect. The difference\nbetween the surface and bulk defect formation energy is found to be as high as\n1.12 eV for the negatively charged iodine vacancy in methylammonium lead\niodide, leading to the enrichment of the surface with defects. Through analysis\nof defective structures, we find that the differences in the bulk and surface\ndefect properties are a consequence of different bond lengths and in some\ncases, even changes in bonding and coordination environments. Finally, we\ndetermine how the defect transition levels change as a function of the layer\nindex, which could contribute to increased non-radiative recombination. Our\nfindings pave the way for a systematic treatment of non-radiative losses in\nperovskite solar cells that incorporate spatially dependent defect densities\nand transition levels.\n","subjects":["Condensed Matter/Materials Science","Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}