{"id":"2407.19761","title":"Shotgun DNA sequencing for human identification: Dynamic SNP selection\n  and likelihood ratio calculations accounting for errors","authors":"Mikkel Meyer Andersen, Marie-Louise Kampmann, Alberte Honor\\'e Jepsen,\n  Niels Morling, Poul Svante Eriksen, Claus B{\\o}rsting, Jeppe Dyrberg Andersen","authorsParsed":[["Andersen","Mikkel Meyer",""],["Kampmann","Marie-Louise",""],["Jepsen","Alberte Honoré",""],["Morling","Niels",""],["Eriksen","Poul Svante",""],["Børsting","Claus",""],["Andersen","Jeppe Dyrberg",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 07:53:14 GMT"}],"updateDate":"2024-09-11","timestamp":1722239594000,"abstract":"  In forensic genetics, short tandem repeats (STRs) are used for human\nidentification (HID). Degraded biological trace samples with low amounts of\nshort DNA fragments (low-quality DNA samples) pose a challenge for STR typing.\nPredefined single nucleotide polymorphisms (SNPs) can be amplified on short PCR\nfragments and used to generate SNP profiles from low-quality DNA samples.\nHowever, the stochastic results from low-quality DNA samples may result in\nfrequent locus drop-outs and insufficient numbers of SNP genotypes for\nconvincing identification of individuals. Shotgun DNA sequencing potentially\nanalyses all DNA fragments in a sample in contrast to the targeted PCR-based\nsequencing methods and may be applied to DNA samples of very low quality, like\nheavily compromised crime-scene samples and ancient DNA samples. Here, we\ndeveloped a statistical model for shotgun sequencing, sequence alignment, and\ngenotype calling. Results from replicated shotgun sequencing of buccal swab\n(high-quality samples) and hair samples (low-quality samples) were arranged in\na genotype-call confusion matrix to estimate the calling error probability by\nmaximum likelihood and Bayesian inference. We developed formulas for\ncalculating the evidential weight as a likelihood ratio (LR) based on data from\ndynamically selected SNPs from shotgun DNA sequencing. The method accounts for\npotential genotyping errors. Different genotype quality filters may be applied\nto account for genotyping errors. An error probability of zero resulted in the\nforensically commonly used LR formula. When considering a single SNP marker's\ncontribution to the LR, error probabilities larger than zero reduced the LR\ncontribution of matching genotypes and increased the LR in the case of a\nmismatch. We developed an open-source R package, wgsLR, which implements the\nmethod, including estimating the calling error probability and calculating LR\nvalues.\n","subjects":["Statistics/Applications","Quantitative Biology/Genomics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}