{"id":"2407.10424","title":"CodeV: Empowering LLMs for Verilog Generation through Multi-Level\n  Summarization","authors":"Yang Zhao, Di Huang, Chongxiao Li, Pengwei Jin, Ziyuan Nan, Tianyun\n  Ma, Lei Qi, Yansong Pan, Zhenxing Zhang, Rui Zhang, Xishan Zhang, Zidong Du,\n  Qi Guo, Xing Hu, Yunji Chen","authorsParsed":[["Zhao","Yang",""],["Huang","Di",""],["Li","Chongxiao",""],["Jin","Pengwei",""],["Nan","Ziyuan",""],["Ma","Tianyun",""],["Qi","Lei",""],["Pan","Yansong",""],["Zhang","Zhenxing",""],["Zhang","Rui",""],["Zhang","Xishan",""],["Du","Zidong",""],["Guo","Qi",""],["Hu","Xing",""],["Chen","Yunji",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 03:57:20 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 01:53:59 GMT"},{"version":"v3","created":"Thu, 18 Jul 2024 09:43:08 GMT"},{"version":"v4","created":"Sat, 20 Jul 2024 16:18:15 GMT"}],"updateDate":"2024-07-23","timestamp":1721015840000,"abstract":"  The increasing complexity and high costs associated with modern processor\ndesign have led to a surge in demand for processor design automation.\nInstruction-tuned large language models (LLMs) have demonstrated remarkable\nperformance in automatically generating code for general-purpose programming\nlanguages like Python. However, these methods fail on hardware description\nlanguages (HDLs) like Verilog due to the scarcity of high-quality instruction\ntuning data, as even advanced LLMs like GPT-3.5 exhibit limited performance on\nVerilog generation. Regarding this issue, we observe that (1) Verilog code\ncollected from the real world has higher quality than those generated by LLMs.\n(2) LLMs like GPT-3.5 excel in summarizing Verilog code rather than generating\nit. Based on these observations, this paper introduces CodeV, a series of\nopen-source instruction-tuned Verilog generation LLMs. Instead of generating\ndescriptions first and then getting the corresponding code from advanced LLMs,\nwe prompt the LLM with Verilog code and let the LLM generate the corresponding\nnatural language description by multi-level summarization. Experimental results\nshow that CodeV relatively surpasses the previous open-source SOTA by 14.4%\n(BetterV in VerilogEval) and 11.3% (RTLCoder in RTLLM) respectively, and also\nrelatively outperforms previous commercial SOTA GPT-4 by 22.1% in VerilogEval.\n","subjects":["Computing Research Repository/Programming Languages","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BmgBCGpiOab8l60J1WuDezLSGDDx-wxJaSW2NIriQU4","pdfSize":"803004"}
