{"id":"2407.08715","title":"Sensor-Aware Classifiers for Energy-Efficient Time Series Applications\n  on IoT Devices","authors":"Dina Hussein, Lubah Nelson and Ganapati Bhat","authorsParsed":[["Hussein","Dina",""],["Nelson","Lubah",""],["Bhat","Ganapati",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:50:31 GMT"}],"updateDate":"2024-07-12","timestamp":1720720231000,"abstract":"  Time-series data processing is an important component of many real-world\napplications, such as health monitoring, environmental monitoring, and digital\nagriculture. These applications collect distinct windows of sensor data (e.g.,\nfew seconds) and process them to assess the environment. Machine learning (ML)\nmodels are being employed in time-series applications due to their\ngeneralization abilities for classification. State-of-the-art time-series\napplications wait for entire sensor data window to become available before\nprocessing the data using ML algorithms, resulting in high sensor energy\nconsumption. However, not all situations require processing full sensor window\nto make accurate inference. For instance, in activity recognition, sitting and\nstanding activities can be inferred with partial windows. Using this insight,\nwe propose to employ early exit classifiers with partial sensor windows to\nminimize energy consumption while maintaining accuracy. Specifically, we first\nutilize multiple early exits with successively increasing amount of data as\nthey become available in a window. If early exits provide inference with high\nconfidence, we return the label and enter low power mode for sensors. The\nproposed approach has potential to enable significant energy savings in time\nseries applications. We utilize neural networks and random forest classifiers\nto evaluate our approach. Our evaluations with six datasets show that the\nproposed approach enables up to 50-60% energy savings on average without any\nimpact on accuracy. The energy savings can enable time-series applications in\nremote locations with limited energy availability.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oosU4lXWQAurSi200osm3ekANmDdIds08qUBjMMGp-M","pdfSize":"1837834"}
