{"id":"2407.19546","title":"XLIP: Cross-modal Attention Masked Modelling for Medical Language-Image\n  Pre-Training","authors":"Biao Wu, Yutong Xie, Zeyu Zhang, Minh Hieu Phan, Qi Chen, Ling Chen,\n  Qi Wu","authorsParsed":[["Wu","Biao",""],["Xie","Yutong",""],["Zhang","Zeyu",""],["Phan","Minh Hieu",""],["Chen","Qi",""],["Chen","Ling",""],["Wu","Qi",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 17:38:21 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 10:53:37 GMT"}],"updateDate":"2024-08-05","timestamp":1722188301000,"abstract":"  Vision-and-language pretraining (VLP) in the medical field utilizes\ncontrastive learning on image-text pairs to achieve effective transfer across\ntasks. Yet, current VLP approaches with the masked modelling strategy face two\nchallenges when applied to the medical domain. First, current models struggle\nto accurately reconstruct key pathological features due to the scarcity of\nmedical data. Second, most methods only adopt either paired image-text or\nimage-only data, failing to exploit the combination of both paired and unpaired\ndata. To this end, this paper proposes a XLIP (Masked modelling for medical\nLanguage-Image Pre-training) framework to enhance pathological learning and\nfeature learning via unpaired data. First, we introduce the attention-masked\nimage modelling (AttMIM) and entity-driven masked language modelling module\n(EntMLM), which learns to reconstruct pathological visual and textual tokens\nvia multi-modal feature interaction, thus improving medical-enhanced features.\nThe AttMIM module masks a portion of the image features that are highly\nresponsive to textual features. This allows XLIP to improve the reconstruction\nof highly similar image data in medicine efficiency. Second, our XLIP\ncapitalizes unpaired data to enhance multimodal learning by introducing\ndisease-kind prompts. The experimental results show that XLIP achieves SOTA for\nzero-shot and fine-tuning classification performance on five datasets. Our code\nwill be available at https://github.com/White65534/XLIP\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"YtHrigjfQYc_CDuRhkL9no0jPWkl_E41aIf05yumBGo","pdfSize":"1915563"}
