{"id":"2407.10906","title":"An Exploratory Study on Just-in-Time Multi-Programming-Language Bug\n  Prediction","authors":"Zengyang Li, Jiabao Ji, Peng Liang, Ran Mo, Hui Liu","authorsParsed":[["Li","Zengyang",""],["Ji","Jiabao",""],["Liang","Peng",""],["Mo","Ran",""],["Liu","Hui",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:06:18 GMT"}],"updateDate":"2024-07-16","timestamp":1721063178000,"abstract":"  Context: An increasing number of software systems are written in multiple\nprogramming languages (PLs), which are called multi-programming-language (MPL)\nsystems. MPL bugs (MPLBs) refers to the bugs whose resolution involves multiple\nPLs. Despite high complexity of MPLB resolution, there lacks MPLB prediction\nmethods. Objective: This work aims to construct just-in-time (JIT) MPLB\nprediction models with selected prediction metrics, analyze the significance of\nthe metrics, and then evaluate the performance of cross-project JIT MPLB\nprediction. Method: We develop JIT MPLB prediction models with the selected\nmetrics using machine learning algorithms and evaluate the models in\nwithin-project and cross-project contexts with our constructed dataset based on\n18 Apache MPL projects. Results: Random Forest is appropriate for JIT MPLB\nprediction. Changed LOC of all files, added LOC of all files, and the total\nnumber of lines of all files of the project currently are the most crucial\nmetrics in JIT MPLB prediction. The prediction models can be simplified using a\nfew top-ranked metrics. Training on the dataset from multiple projects can\nyield significantly higher AUC than training on the dataset from a single\nproject for cross-project JIT MPLB prediction. Conclusions: JIT MPLB prediction\nmodels can be constructed with the selected set of metrics, which can be\nreduced to build simplified JIT MPLB prediction models, and cross-project JIT\nMPLB prediction is feasible.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UjqKRfHMK-7sqWcrgXBQVlPd2OsZbAzC_D2ubADo_Fc","pdfSize":"623879","objectId":"0x307bb4cdf29f296e8da07a4b5ddcac099e39a842f1d3e0c6a3a9c830d68ed309","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
