{"id":"2407.10194","title":"Curriculum Learning for Small Code Language Models","authors":"Marwa Na\\\"ir, Kamel Yamani, Lynda Said Lhadj, Riyadh Baghdadi","authorsParsed":[["Naïr","Marwa",""],["Yamani","Kamel",""],["Lhadj","Lynda Said",""],["Baghdadi","Riyadh",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 13:32:24 GMT"}],"updateDate":"2024-07-16","timestamp":1720963944000,"abstract":"  Code language models have emerged as useful tools for various programming\ntasks, yet they often struggle when it comes to complex ones. In this paper, we\nexplore the potential of curriculum learning in enhancing the performance of\nthese models. While prior research has suggested that curriculum learning does\nnot necessarily help in improving the performance of language models, our\nresults surprisingly show that this may not be the case for code language\nmodels. We demonstrate that a well-designed curriculum learning approach\nsignificantly improves the accuracy of small decoder-only code language models\non the task of code execution, while its effect on code completion is less\nsignificant. To explore the potential of curriculum learning, we train multiple\nGPT models with 1 million parameters each to predict the next token and\nevaluate them on code completion and execution tasks. Our contributions include\nproposing a novel code difficulty assessment metric by combining software code\nmeasures, investigating the effectiveness of Curriculum Learning for code\nlanguage models, and introducing a Novel Curriculum Learning schedule that\nenhances the performance of small decoder-only language models in code\nexecution tasks. The results of this paper open the door for more research on\nthe use of curriculum learning for code language models.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Programming Languages"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}