{"id":"2407.13664","title":"Decision Focused Causal Learning for Direct Counterfactual Marketing\n  Optimization","authors":"Hao Zhou, Rongxiao Huang, Shaoming Li, Guibin Jiang, Jiaqi Zheng, Bing\n  Cheng, Wei Lin","authorsParsed":[["Zhou","Hao",""],["Huang","Rongxiao",""],["Li","Shaoming",""],["Jiang","Guibin",""],["Zheng","Jiaqi",""],["Cheng","Bing",""],["Lin","Wei",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:39:44 GMT"}],"updateDate":"2024-07-19","timestamp":1721320784000,"abstract":"  Marketing optimization plays an important role to enhance user engagement in\nonline Internet platforms. Existing studies usually formulate this problem as a\nbudget allocation problem and solve it by utilizing two fully decoupled stages,\ni.e., machine learning (ML) and operation research (OR). However, the learning\nobjective in ML does not take account of the downstream optimization task in\nOR, which causes that the prediction accuracy in ML may be not positively\nrelated to the decision quality.\n  Decision Focused Learning (DFL) integrates ML and OR into an end-to-end\nframework, which takes the objective of the downstream task as the decision\nloss function and guarantees the consistency of the optimization direction\nbetween ML and OR. However, deploying DFL in marketing is non-trivial due to\nmultiple technological challenges. Firstly, the budget allocation problem in\nmarketing is a 0-1 integer stochastic programming problem and the budget is\nuncertain and fluctuates a lot in real-world settings, which is beyond the\ngeneral problem background in DFL. Secondly, the counterfactual in marketing\ncauses that the decision loss cannot be directly computed and the optimal\nsolution can never be obtained, both of which disable the common\ngradient-estimation approaches in DFL. Thirdly, the OR solver is called\nfrequently to compute the decision loss during model training in DFL, which\nproduces huge computational cost and cannot support large-scale training data.\nIn this paper, we propose a decision focused causal learning framework (DFCL)\nfor direct counterfactual marketing optimization, which overcomes the above\ntechnological challenges. Both offline experiments and online A/B testing\ndemonstrate the effectiveness of DFCL over the state-of-the-art methods.\nCurrently, DFCL has been deployed in several marketing scenarios in Meituan,\none of the largest online food delivery platform in the world.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}