{"id":"2407.06777","title":"On the complexity of Client-Waiter and Waiter-Client games","authors":"Valentin Gledel, Nacim Oijid, S\\'ebastien Tavenas and St\\'ephan\n  Thomass\\'e","authorsParsed":[["Gledel","Valentin",""],["Oijid","Nacim",""],["Tavenas","Sébastien",""],["Thomassé","Stéphan",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 11:47:34 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 14:12:00 GMT"}],"updateDate":"2024-09-04","timestamp":1720525654000,"abstract":"  Positional games were introduced by Hales and Jewett in 1963, and their study\nbecame more popular after Erdos and Selfridge's first result on their\nconnection to Ramsey theory and hypergraph coloring in 1973. Several\nconventions of these games exist, and the most popular one, Maker-Breaker was\nproved to be PSPACE-complete by Schaefer in 1978. The study of their complexity\nthen stopped for decades, until 2017 when Bonnet, Jamain, and Saffidine proved\nthat Maker-Breaker is W[1]-complete when parameterized by the number of moves.\nThe study was then intensified when Rahman and Watson improved Schaefer's\nresult in 2021 by proving that the PSPACE-hardness holds for 6-uniform\nhypergraphs. More recently, Galliot, Gravier, and Sivignon proved that\ncomputing the winner on rank 3 hypergraphs is in P.\n  We focus here on the Client-Waiter and the Waiter-Client conventions. Both\nwere proved to be NP-hard by Csernenszky, Martin, and Pluh\\'ar in 2011, but\nneither completeness nor positive results were known for these conventions. In\nthis paper, we complete the study of these conventions by proving that the\nformer is PSPACE-complete, even restricted to 6-uniform hypergraphs, and by\nproviding an FPT-algorithm for the latter, parameterized by the size of its\nlargest edge. In particular, the winner of Waiter-Client can be computed in\npolynomial time in k-uniform hypergraphs for any fixed integer k. Finally, in\nsearch of finding the exact bound between the polynomial result and the\nhardness result, we focused on the complexity of rank 3 hypergraphs in the\nClient-Waiter convention. We provide an algorithm that runs in polynomial time\nwith an oracle in NP.\n","subjects":["Mathematics/Combinatorics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}