{"id":"2407.18972","title":"Theological reasoning of Cantor's set theory","authors":"Kate\\v{r}ina Trlifajov\\'a","authorsParsed":[["Trlifajová","Kateřina",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 09:40:41 GMT"}],"updateDate":"2024-07-30","timestamp":1721641241000,"abstract":"  Discussions surrounding the nature of the infinite in mathematics have been\nunderway for two millennia. Mathematicians, philosophers, and theologians have\nall taken part. The basic question has been whether the infinite exists only in\npotential or exists in actuality. Only at the end of the 19th century, a set\ntheory was created that works with the actual infinite. Initially, this theory\nwas rejected by other mathematicians. The creator behind the theory, the German\nmathematician Georg Cantor, felt all the more the need to challenge the long\ntradition that only recognised the potential infinite. In this, he received\nstrong support from the interest among German neothomist philosophers, who,\nunder the influence of the Encyclical of Pope Leo XIII, Aeterni Patris, began\nto take an interest in Cantor's work. Gradually, his theory even acquired\napproval from the Vatican theologians. Cantor was able to firmly defend his\nwork and at the turn of the 20th century, he succeeded in gaining its\nacceptance. The storm that had accompanied its original rejection now\naccompanied its acceptance. The theory became the basis on which modern\nmathematics was and is still founded, even though the majority of\nmathematicians know nothing of its original theological justification. Set\ntheory, which today rests on an axiomatic foundation, no longer poses the\nquestion of the existence of actual infinite sets. The answer is expressed in\nits basic axiom: natural numbers form an infinite set. No substantiation has\nbeen discovered other than Cantor's: the set of all natural numbers exists from\neternity as an idea in God's intellect.\n","subjects":["Mathematics/History and Overview"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}