{"id":"2407.07520","title":"IRSAM: Advancing Segment Anything Model for Infrared Small Target\n  Detection","authors":"Mingjin Zhang, Yuchun Wang, Jie Guo, Yunsong Li, Xinbo Gao and Jing\n  Zhang","authorsParsed":[["Zhang","Mingjin",""],["Wang","Yuchun",""],["Guo","Jie",""],["Li","Yunsong",""],["Gao","Xinbo",""],["Zhang","Jing",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 10:17:57 GMT"}],"updateDate":"2024-07-11","timestamp":1720606677000,"abstract":"  The recent Segment Anything Model (SAM) is a significant advancement in\nnatural image segmentation, exhibiting potent zero-shot performance suitable\nfor various downstream image segmentation tasks. However, directly utilizing\nthe pretrained SAM for Infrared Small Target Detection (IRSTD) task falls short\nin achieving satisfying performance due to a notable domain gap between natural\nand infrared images. Unlike a visible light camera, a thermal imager reveals an\nobject's temperature distribution by capturing infrared radiation. Small\ntargets often show a subtle temperature transition at the object's boundaries.\nTo address this issue, we propose the IRSAM model for IRSTD, which improves\nSAM's encoder-decoder architecture to learn better feature representation of\ninfrared small objects. Specifically, we design a Perona-Malik diffusion\n(PMD)-based block and incorporate it into multiple levels of SAM's encoder to\nhelp it capture essential structural features while suppressing noise.\nAdditionally, we devise a Granularity-Aware Decoder (GAD) to fuse the\nmulti-granularity feature from the encoder to capture structural information\nthat may be lost in long-distance modeling. Extensive experiments on the public\ndatasets, including NUAA-SIRST, NUDT-SIRST, and IRSTD-1K, validate the design\nchoice of IRSAM and its significant superiority over representative\nstate-of-the-art methods. The source code are available at:\ngithub.com/IPIC-Lab/IRSAM.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}