{"id":"2407.10071","title":"Primordial Gravitational Waves of Big Bounce Cosmology in Light of\n  Stochastic Gravitational Wave Background","authors":"Changhong Li","authorsParsed":[["Li","Changhong",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 04:15:11 GMT"}],"updateDate":"2024-07-16","timestamp":1720930511000,"abstract":"  Primordial gravitational waves from the very early stages of the universe,\nsuch as inflation or bounce processes, are an irreducible cosmological source\nof the stochastic gravitational wave background (SGWB). The recent detection of\nSGWB signals around the nano-Hertz frequency by pulsar timing arrays (PTAs),\nincluding NANOGrav, EPTA, PPTA, IPTA, and CPTA, opens a new window to explore\nthese very early stages of the universe through these primordial gravitational\nwaves. In this work, we investigate the generation and evolution of primordial\ngravitational waves in a generic big bounce cosmology by parameterizing its\nbackground evolution into four phases, where perturbation modes exit and\nre-enter the horizon twice. By analytically solving the equation of motion for\nprimordial gravitational waves and matching solutions at the boundaries, we\nobtain the explicit form of the primordial gravitational wave spectrum in a\ngeneric big bounce cosmology. We find that, according to the evolution of\nprimordial gravitational waves, a generic scenario of big bounce cosmology can\nbe categorized into four distinct types. We introduce four toy models for these\ncategories, demonstrating that our analytical results can be straightforwardly\napplied to various bouncing universe models in which the equation of state of\nthe background is constant in each phase. We also prospect future applications\nof our results in interpreting SGWB signals searched by PTAs and upcoming\nadvanced gravitational wave detectors such as SKA, Taiji, Tianqin, LISA,\nDECIGO, and aLIGO/Virgo/KAGRA using Bayesian analysis.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QhQ9tFM79LfXzg1scaX2XRbrI6XbgDvE01kxVnFJLJE","pdfSize":"787896","objectId":"0xfd4c73525ec28e782c4a72f7c8a5b33799b65cae8321194629825904b5f4eb28","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
