{"id":"2407.08503","title":"DIOR-ViT: Differential Ordinal Learning Vision Transformer for Cancer\n  Classification in Pathology Images","authors":"Ju Cheon Lee, Keunho Byeon, Boram Song, Kyungeun Kim, Jin Tae Kwak","authorsParsed":[["Lee","Ju Cheon",""],["Byeon","Keunho",""],["Song","Boram",""],["Kim","Kyungeun",""],["Kwak","Jin Tae",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 12:42:27 GMT"}],"updateDate":"2024-07-12","timestamp":1720615347000,"abstract":"  In computational pathology, cancer grading has been mainly studied as a\ncategorical classification problem, which does not utilize the ordering nature\nof cancer grades such as the higher the grade is, the worse the cancer is. To\nincorporate the ordering relationship among cancer grades, we introduce a\ndifferential ordinal learning problem in which we define and learn the degree\nof difference in the categorical class labels between pairs of samples by using\ntheir differences in the feature space. To this end, we propose a\ntransformer-based neural network that simultaneously conducts both categorical\nclassification and differential ordinal classification for cancer grading. We\nalso propose a tailored loss function for differential ordinal learning.\nEvaluating the proposed method on three different types of cancer datasets, we\ndemonstrate that the adoption of differential ordinal learning can improve the\naccuracy and reliability of cancer grading, outperforming conventional cancer\ngrading approaches. The proposed approach should be applicable to other\ndiseases and problems as they involve ordinal relationship among class labels.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"2-TaUfo-5y_0YB_hv0Wvfd42IGGVwUhQAZ1uGuCpJYc","pdfSize":"23395342","objectId":"0x5634e43cd83bcad97bb8bef1e3bcfab7dd1d9f97a028fe3b59959fdb6a36add5","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
