{"id":"2407.07180","title":"Studies of Transonic Aircraft Flows and Prediction of Initial Buffet\n  Onset Using Large-Eddy Simulations","authors":"Konrad A. Goc, Rahul Agrawal, Sanjeeb T. Bose, Parviz Moin","authorsParsed":[["Goc","Konrad A.",""],["Agrawal","Rahul",""],["Bose","Sanjeeb T.",""],["Moin","Parviz",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 18:48:55 GMT"}],"updateDate":"2024-07-11","timestamp":1720550935000,"abstract":"  This article utilizes the Large-Eddy Simulation (LES) paradigm with a\nphysics-based turbulence modeling approach, including a dynamic subgrid-scale\nmodel and an equilibrium wall model, to examine the flow over the NASA\ntransonic Common Research Model (CRM), a flow configuration that has been the\nfocus of several AIAA Drag PredictionWorkshops (DPWs). The current work\nexplores sensitivities to laminar-to-turbulent transition, wind tunnel mounting\nsystem, grid resolution, and grid topology and suggests current best practices\nin the context of large-eddy simulations of transonic aircraft flows. It is\nfound that promoting the flow transition to turbulence via an array of\ncylindrical trip dots, including the sting mounting system in the simulations,\nand leveraging stranded boundary layer grids all tend to improve the quality of\nthe LES solutions. Non-monotonic grid convergence in the LES calculations is\nobserved to be strongly sensitive to grid topology, and stranded meshes rectify\nthis issue relative to their hexagonal close-packed (HCP) counterparts. The\ndetails of the boundary layer profiles both at the leading edge of the wing and\nwithin the shock-induced separation bubble are studied, with thicknesses and\nintegral measures reported, providing details about the boundary layer\ncharacteristics to turbulence modelers not typically available from complex\naircraft flows. Finally, an assessment of the initial buffet prediction\ncapabilities of LES is made in the context of a simpler NACA 0012 flow, with\ncomputational predictions showing reasonable agreement with available\nexperimental data for the angle of attack at initial buffet onset and shock\noscillation frequency associated with sustained buffet.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}