{"id":"2407.05953","title":"Circuit Partitioning and Transmission Cost Optimization in Distributed\n  Quantum Computing","authors":"Xinyu Chen, Zilu Chen, Xueyun Cheng, Zhijin Guan","authorsParsed":[["Chen","Xinyu",""],["Chen","Zilu",""],["Cheng","Xueyun",""],["Guan","Zhijin",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 13:51:27 GMT"}],"updateDate":"2024-07-09","timestamp":1720446687000,"abstract":"  Given the limitations on the number of qubits in current NISQ devices, the\nimplementation of large-scale quantum algorithms on such devices is\nchallenging, prompting research into distributed quantum computing. This paper\nfocuses on the issue of excessive communication complexity in distributed\nquantum computing oriented towards quantum circuits. To reduce the number of\nquantum state transmissions, i.e., the transmission cost, in distributed\nquantum circuits, a circuit partitioning method based on the QUBO model is\nproposed, coupled with the lookahead method for transmission cost optimization.\nInitially, the problem of distributed quantum circuit partitioning is\ntransformed into a graph minimum cut problem. The QUBO model, which can be\naccelerated by quantum algorithms, is introduced to minimize the number of\nquantum gates between QPUs and the transmission cost. Subsequently, the dynamic\nlookahead strategy for the selection of transmission qubits is proposed to\noptimize the transmission cost in distributed quantum circuits. Finally,\nthrough numerical simulations, the impact of different circuit partitioning\nindicators on the transmission cost is explored, and the proposed method is\nevaluated on benchmark circuits. Experimental results demonstrate that the\ntransmission cost optimized through the method proposed in this paper is\nsignificantly reduced compared with current methods for optimizing transmission\ncost, achieving noticeable improvements across different numbers of partitions.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}