{"id":"2407.02922","title":"Fair Resource Allocation for Probabilistic Semantic Communication in\n  IIoT","authors":"Siyun Liang, Zhouxiang Zhao, Chen Zhu, Zhaohui Yang, Yinchao Yang,\n  Mohammad Shikh-Bahaei, Zhaoyang Zhang","authorsParsed":[["Liang","Siyun",""],["Zhao","Zhouxiang",""],["Zhu","Chen",""],["Yang","Zhaohui",""],["Yang","Yinchao",""],["Shikh-Bahaei","Mohammad",""],["Zhang","Zhaoyang",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 08:54:56 GMT"},{"version":"v2","created":"Mon, 8 Jul 2024 08:06:42 GMT"}],"updateDate":"2024-07-09","timestamp":1719996896000,"abstract":"  In this paper, the problem of minimum rate maximization for probabilistic\nsemantic communication (PSCom) in industrial Internet of Things (IIoT) is\ninvestigated. In the considered model, users employ semantic information\nextraction techniques to compress the original data before sending it to the\nbase station (BS). During this semantic compression process, knowledge graphs\nare employed to represent the semantic information, and the probability graph\nsharing between users and the BS is utilized to further compress the knowledge\ngraph. The semantic compression process can significantly reduce the\ntransmitted data size, but it inevitably introduces additional computation\noverhead. Considering the limited power budget of the user, we formulate a\njoint communication and computation optimization problem is formulated aiming\nto maximize the minimum equivalent rate among all users while meeting total\npower and semantic compression ratio constraints. To address this problem, two\nalgorithms with different computational complexities are proposed to obtain\nsuboptimal solutions. One algorithm is based on a prorate distribution of\ntransmission power, while the other traverses the combinations of semantic\ncompression ratios among all users. In both algorithms, bisection is employed\nin order to achieve the greatest minimum equivalent rate. The simulation\nresults validate the effectiveness of the proposed algorithms.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}