{"id":"2407.13680","title":"HPix: Generating Vector Maps from Satellite Images","authors":"Aditya Taparia and Keshab Nath","authorsParsed":[["Taparia","Aditya",""],["Nath","Keshab",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:54:02 GMT"}],"updateDate":"2024-07-19","timestamp":1721321642000,"abstract":"  Vector maps find widespread utility across diverse domains due to their\ncapacity to not only store but also represent discrete data boundaries such as\nbuilding footprints, disaster impact analysis, digitization, urban planning,\nlocation points, transport links, and more. Although extensive research exists\non identifying building footprints and road types from satellite imagery, the\ngeneration of vector maps from such imagery remains an area with limited\nexploration. Furthermore, conventional map generation techniques rely on\nlabor-intensive manual feature extraction or rule-based approaches, which\nimpose inherent limitations. To surmount these limitations, we propose a novel\nmethod called HPix, which utilizes modified Generative Adversarial Networks\n(GANs) to generate vector tile map from satellite images. HPix incorporates two\nhierarchical frameworks: one operating at the global level and the other at the\nlocal level, resulting in a comprehensive model. Through empirical evaluations,\nour proposed approach showcases its effectiveness in producing highly accurate\nand visually captivating vector tile maps derived from satellite images. We\nfurther extend our study's application to include mapping of road intersections\nand building footprints cluster based on their area.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UQ7ngNQlS_cHXB9V_ugMFIAYrAc5jaZrEoP_lwBPm4s","pdfSize":"2368864","objectId":"0x4cfa3792b23078307ed8670340e22959325acfa88f95df155b87e3f09a98c9d8","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
