{"id":"2407.18639","title":"Vulnerability Detection in Ethereum Smart Contracts via Machine\n  Learning: A Qualitative Analysis","authors":"Dalila Ressi, Alvise Span\\`o, Lorenzo Benetollo, Carla Piazza, Michele\n  Bugliesi, Sabina Rossi","authorsParsed":[["Ressi","Dalila",""],["Spanò","Alvise",""],["Benetollo","Lorenzo",""],["Piazza","Carla",""],["Bugliesi","Michele",""],["Rossi","Sabina",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 10:09:44 GMT"}],"updateDate":"2024-07-29","timestamp":1721988584000,"abstract":"  Smart contracts are central to a myriad of critical blockchain applications,\nfrom financial transactions to supply chain management. However, their adoption\nis hindered by security vulnerabilities that can result in significant\nfinancial losses. Most vulnerability detection tools and methods available\nnowadays leverage either static analysis methods or machine learning.\nUnfortunately, as valuable as they are, both approaches suffer from limitations\nthat make them only partially effective. In this survey, we analyze the state\nof the art in machine-learning vulnerability detection for Ethereum smart\ncontracts, by categorizing existing tools and methodologies, evaluating them,\nand highlighting their limitations. Our critical assessment unveils issues such\nas restricted vulnerability coverage and dataset construction flaws, providing\nus with new metrics to overcome the difficulties that restrain a sound\ncomparison of existing solutions. Driven by our findings, we discuss best\npractices to enhance the accuracy, scope, and efficiency of vulnerability\ndetection in smart contracts. Our guidelines address the known flaws while at\nthe same time opening new avenues for research and development. By shedding\nlight on current challenges and offering novel directions for improvement, we\ncontribute to the advancement of secure smart contract development and\nblockchain technology as a whole.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"CVZPzr-Ac7YvZfuR-rDkHC0HwGAsq965du_RhzgbLWs","pdfSize":"875046"}
