{"id":"2407.14760","title":"Multidirectional Pixelated Cubic Antenna with Enhanced Isolation for\n  Vehicular Applications","authors":"Md. Amanath Ullah, Rasool Keshavarz, Justin Lipman, Mehran Abolhasan,\n  and Negin Shariati","authorsParsed":[["Ullah","Md. Amanath",""],["Keshavarz","Rasool",""],["Lipman","Justin",""],["Abolhasan","Mehran",""],["Shariati","Negin",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 05:45:07 GMT"},{"version":"v2","created":"Sun, 28 Jul 2024 05:40:52 GMT"},{"version":"v3","created":"Sun, 18 Aug 2024 09:55:18 GMT"}],"updateDate":"2024-08-20","timestamp":1721454307000,"abstract":"  This paper presents a pixelated cubic antenna design with enhanced isolation\nand diverse radiation pattern for vehicular applications. The design consists\nof four radiating patches to take advantage of a nearly omnidirectional\nradiation pattern with enhanced isolation and high gain. The antenna system\nwith four patches has been pixelated and optimized simultaneously to achieve\ndesired performance and high isolation at 5.4 GHz band. The antenna achieved\nmeasured isolation of more than -34 dB between antenna elements. The overall\nisolation improvement obtained by the antenna is about 18 dB compared to a\nconfiguration using standard patch antennas. Moreover, isolation improvement is\nachieved through patch pixelization without additional resonators or elements.\nThe antenna achieved up to 6.9 dB realized gain in each direction.\nAdditionally, the cubic antenna system is equipped with an E-shaped GPS antenna\nto facilitate connectivity with GPS satellite. Finally, the antenna performance\nhas been investigated using a simulation model of the vehicle roof and roof\nrack. The reflection coefficient, isolation and radiation patterns of the\nantenna remains unaffected. The antenna prototype has been fabricated on Rogers\nsubstrate and measured to verify the simulation results. The measured results\ncorrelate well with the simulation results. The proposed antenna features\nlow-profile, simple design for ease of manufacture, good radiation\ncharacteristics with multidirectional property and high isolation, which are\nwell-suited to vehicular applications in different environments.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}