{"id":"2407.05306","title":"Evaluating the severity of tandem coronary stenoses: Insights from\n  simulated FFR and iFR techniques","authors":"Navid Freidoonimehr, Tam Atkins, Jessica A. Marathe, Peter J. Psaltis,\n  and Maziar Arjomandi","authorsParsed":[["Freidoonimehr","Navid",""],["Atkins","Tam",""],["Marathe","Jessica A.",""],["Psaltis","Peter J.",""],["Arjomandi","Maziar",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 09:14:05 GMT"}],"updateDate":"2024-07-09","timestamp":1720343645000,"abstract":"  Aims: The presence of coronary tandem lesions poses a significant challenge\nfor the accurate diagnosis and management of coronary artery diseases. This\nstudy set out to provide a deeper understanding of the haemodynamic\ninteractions between tandem obstructive coronary lesions and their impact on\ndifferent haemodynamic diagnostic parameters. Methods and Results: Using a\ncomputational fluid dynamic model, validated against in vitro laboratory\nexperiments, we investigated the various combinations of moderate and severe\nstenoses interchangeably located in the proximal and distal segments of the\nartery. The investigation was conducted using two diagnostic parameters: one\nhyperaemic-based, i.e., FFR, and one rest-based, i.e., iFR, technique, both of\nwhich are commonly used to assess the physiological significance of coronary\nstenoses. The three main findings of this work are: (a) the recovery distance\n(the immediate local distance affected by the presence of stenosis) is much\nshorter for the rest-measured diagnostic parameter compared with the\nhyperaemic-measured diagnostic parameter; (b) pressure drop measurements\nimmediately downstream of the stenotic sections overestimate the significance\nof stenoses, and (c) the presence of a moderate stenosis downstream of a severe\nstenosis increases FFR value (faster FFR recovery). Conclusion: These findings\nenhance our understanding of the diagnostic accuracy of hyperaemic-based and\nrest-based physiological diagnostic coronary assessments and the nuances of\nusing these different techniques when assessing tandem coronary stenoses. This\nunderstanding can help inform tailored therapeutic approaches for the\nmanagement of coronary artery disease.\n","subjects":["Physics/Medical Physics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}