{"id":"2407.06705","title":"Integrated Sensing and Communications for Resource Allocation in\n  Non-Terrestrial Networks","authors":"Israel Leyva-Mayorga, Fabio Saggese, Lintao Li, and Petar Popovski","authorsParsed":[["Leyva-Mayorga","Israel",""],["Saggese","Fabio",""],["Li","Lintao",""],["Popovski","Petar",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 09:32:11 GMT"}],"updateDate":"2024-07-10","timestamp":1720517531000,"abstract":"  The integration of Non-Terrestrial Networks (NTNs) with Low Earth Orbit (LEO)\nsatellite constellations into 5G and Beyond is essential to achieve truly\nglobal connectivity. A distinctive characteristic of LEO mega-constellations is\nthat they constitute a global infrastructure with predictable dynamics, which\nenables the pre-planned allocation of the radio resources. However, the\ndifferent bands that can be used for ground-to-satellite communication are\naffected differently by atmospheric conditions such as precipitation, which\nintroduces uncertainty on the attenuation of the communication links at high\nfrequencies. Based on this, we present a compelling case for applying\nintegrated sensing and communications (ISAC) in heterogeneous and multi-layer\nLEO satellite constellations over wide areas. Specifically, we present an ISAC\nframework and frame structure to accurately estimate the attenuation in the\ncommunication links due to precipitation, with the aim of finding the optimal\nserving satellites and resource allocation for downlink communication with\nusers on ground. The results show that, by dedicating an adequate amount of\nresources for sensing and solving the association and resource allocation\nproblems jointly, it is feasible to increase the average throughput by 59% and\nthe fairness by 600% when compared to solving these problems separately.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}