{"id":"2407.21089","title":"Determination of electron screening potential of 6 Li(p,{\\alpha})3 He\n  reaction using MultiLayer Perceptron based neural network","authors":"D. Chattopadhyay","authorsParsed":[["Chattopadhyay","D.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 15:56:01 GMT"}],"updateDate":"2024-08-01","timestamp":1722354961000,"abstract":"  Background: Understanding the nuclear reactions between light charged nuclei\nat sub-coulomb energy region holds significant importance in several\nastrophysical processes. Determination of the precise reaction cross-section\nwithin the astrophysically important Gamow range is difficult because of\nelectron screening. Various polynomial fits, R-Matrix and Indirect Trojan horse\nmethod estimate much higher electron screening energies as compared to the\nadiabatic limit. Purpose: Obtain the bare astrophysical S-factor of 6\nLi(p,{\\alpha})3 He using Multi-Layer Perceptron based Artificial Neural Network\nbased analysis and extract the electron screening energies. Methods:\nExperimental S-factor of 6 Li(p,{\\alpha})3 He, available in literature, are\nreanalyzed using the Multi-LayerPerceptron based Artificial Neural Network\nbased algorithm to obtain the energy dependent astrophysical S-factor. Bare\nastrophysical S-factor is also calculated using the same Feed-forward\nArtificial Neural Network from the data range above 60 keV where the electron\nscreening effect is expected to be negligible. Electron screening potential is\nthen obtained by taking the ratio of total shielded S-factor with the bare\nS-factor. Results and Conclusions: The electron screening potential obtained\nfrom the Present work through the Artificial Neural network based algorithm is\nfound to be 220 eV. The extracted electron screening potential through the\npresent analysis indicates that the Artificial Neural Network might be an\nalternative tools for estimation the electron screening potential involving\nlight nuclei.\n","subjects":["Physics/Nuclear Theory","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"r-L88yFSynK4MLbJkj1m6JYtxoeiyl9cyOSktVW4lBY","pdfSize":"1231502"}
