{"id":"2407.09858","title":"Magnetism and field-induced effects in the S = 5/2 honeycomb lattice\n  antiferromagnet FeP3SiO11","authors":"J. Khatua, M. Gomilsek, Kwang-Yong Choi, and P. Khuntia","authorsParsed":[["Khatua","J.",""],["Gomilsek","M.",""],["Choi","Kwang-Yong",""],["Khuntia","P.",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 11:47:56 GMT"}],"updateDate":"2024-07-16","timestamp":1720871276000,"abstract":"  Quantum magnets based on honeycomb lattices with low-coordination number\noffer a viable ground to realize exotic emergent quantum excitations and\nphenomena arising from the interplay between competing magnetic interactions,\nspin correlations, and spatial anisotropy. However, unlike their low-spin\nanalogues, high-spin honeycomb lattice antiferromagnets have remained\ncomparatively less explored in the context of capturing the classical analogs\nof quantum phenomena. Herein, we report the crystal structure, magnetic\nsusceptibility, specific heat, and electron spin resonance (ESR), complemented\nby ab initio density functional theory (DFT) calculations on polycrystalline\nsamples of FeP3SiO11 wherein the Fe3+ ions decorate a nearly-perfect S = 5/2\nhoneycomb lattice without any site disorder among constituent atoms. Above 150\nK, an antiferromagnetic Weiss temperature of - 12 K is observed consistent with\nDFT calculations, which suggest the presence of strong intra-planar\nnearest-neighbor and weaker inter-planar further nearest-neighbor exchange\ninteractions. An anomaly at TN = 3.5 K in specific heat and magnetic\nsusceptibility reveals the presence of a long-range ordered ground state in\nzero field. Above TN, ESR evidences short-range spin correlations and\nunsaturated magnetic entropy, while below TN unconventional excitations are\nseen via power-law specific heat. A spin-flop transition is observed in an\napplied field of Hc1 = 0.2 T. At higher applied fields, TN is gradually\nsuppressed down to zero at Hc2 = 5.6 T with a 2D critical exponent 0.255. Above\nHc2, a broad maximum in specific heat due to gapped magnon excitations\nindicates the emergence of an interesting nearly-polarized state dressed by a\ndisordered state in the honeycomb lattice antiferromagnet FeP3SiO11.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}