{"id":"2407.18088","title":"A multi-physics model for the evolution of grain microstructure","authors":"Izzet Tarik Tandogan, Michael Budnitzki, Stefan Sandfeld","authorsParsed":[["Tandogan","Izzet Tarik",""],["Budnitzki","Michael",""],["Sandfeld","Stefan",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 14:51:01 GMT"}],"updateDate":"2024-07-26","timestamp":1721919061000,"abstract":"  When a metal is loaded mechanically at high temperatures, i.e. above 300\n$^o$C, its grain microstructure evolves due to multiple physical mechanisms.\nTwo of which are the curvature-driven migration of the grain boundaries due to\nincreased mobility, and the formation of subgrains due to severe plastic\ndeformation. Similar phenomena are observed during heat treatment subsequent to\nsevere plastic deformation. Grain boundary migration and plastic deformation\nsimultaneously change the lattice orientation at any given material point,\nwhich is challenging to simulate consistently. The majority of existing\nsimulation approaches tackle this problem by applying separate, specialized\nmodels for mechanical deformation and grain boundary migration sequentially.\nSignificant progress was made recognizing that the Cosserat continuum\nrepresents an ideal framework for the coupling between different mechanisms\ncausing lattice reorientation, since rotations are native degrees of freedom in\nthis setting.\n  In this work we propose and implement a multi-physics model, which couples\nCosserat crystal plasticity to Henry-Mellenthin-Plapp (HMP) type orientation\nphase-field in a single thermodynamically consistent framework for\nmicrostructure evolution. Compared to models based on the\nKobayashi-Warren-Carter (KWC) phase-field, the HMP formulation removes the\nnonphysical term linear in the gradient of orientation from the free energy\ndensity, thus eliminating long-range interactions between grain boundaries.\nFurther, HMP orientation phase field can handle inclination-dependent grain\nboundary energies. We evaluate the model's predictions and numerical\nperformance within a two-dimensional finite element framework, and compare it\nto a previously published results based on KWC phase-field coupled with\nCosserat mechanics.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}