{"id":"2407.15501","title":"Probing the shape of the primordial curvature power spectrum and the\n  energy scale of reheating with pulsar timing arrays","authors":"Lele Fan, Jie Zheng, Fengge Zhang and Zhi-Qiang You","authorsParsed":[["Fan","Lele",""],["Zheng","Jie",""],["Zhang","Fengge",""],["You","Zhi-Qiang",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 09:35:00 GMT"}],"updateDate":"2024-07-23","timestamp":1721640900000,"abstract":"  The stochastic gravitational wave background (SGWB) provides a unique\nopportunity to probe the early Universe, potentially encoding information about\nthe primordial curvature power spectrum and the energy scale of reheating.\nRecent observations by collaborations such as NANOGrav, PPTA, EPTA+InPTA, and\nCPTA have detected a stochastic common-spectrum signal, which may originate\nfrom scalar-induced gravitational waves (SIGWs) generated by primordial\ncurvature perturbations during inflation. In this study, we explore the\nhypothesis that the NANOGrav signal is sourced by SIGWs and aim to constrain\nthe shape of the primordial curvature power spectrum and the reheating energy\nscale using the NANOGrav 15-year data set. We model the primordial curvature\npower spectrum with a lognormal form and focus on the case where the equation\nof state during reheating is $w=1/6$, corresponding to an inflaton potential\n$V(\\phi) \\sim \\phi^{14/5}$. Employing Bayesian inference, we obtain posterior\ndistributions for the lognormal power spectrum parameters and the reheating\ntemperature. Our results indicate a narrow peak in the primordial power\nspectrum ($\\Delta < 0.001$ at 90\\% confidence) and a lower bound on the\nreheating temperature ($T_{\\rm rh} \\geq 0.1 {\\rm GeV}$), consistent with Big\nBang Nucleosynthesis constraints. The best-fit SIGW energy density spectrum\nexhibits a distinct turning point around $f \\sim 10^{-8.1}\\,{\\rm Hz}$,\ncorresponding to the transition from reheating to the radiation-dominated era.\nThis feature, combined with the sharp high-frequency decrease due to the narrow\nprimordial power spectrum peak, offers a unique signature for probing early\nUniverse properties.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VLaVLywmLGkDnIJ3P6MbJxiWHG3ssRtVea0G6zREq8c","pdfSize":"662728"}
