{"id":"2407.08498","title":"ERD: Exponential Retinex decomposition based on weak space and hybrid\n  nonconvex regularization and its denoising application","authors":"Liang Wu, Wenjing Lu, Liming Tang, Zhuang Fang","authorsParsed":[["Wu","Liang",""],["Lu","Wenjing",""],["Tang","Liming",""],["Fang","Zhuang",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 13:34:37 GMT"},{"version":"v2","created":"Sun, 21 Jul 2024 03:03:12 GMT"}],"updateDate":"2024-07-23","timestamp":1720704877000,"abstract":"  The Retinex theory models the image as a product of illumination and\nreflection components, which has received extensive attention and is widely\nused in image enhancement, segmentation and color restoration. However, it has\nbeen rarely used in additive noise removal due to the inclusion of both\nmultiplication and addition operations in the Retinex noisy image modeling. In\nthis paper, we propose an exponential Retinex decomposition model based on\nhybrid non-convex regularization and weak space oscillation-modeling for image\ndenoising. The proposed model utilizes non-convex first-order total variation\n(TV) and non-convex second-order TV to regularize the reflection component and\nthe illumination component, respectively, and employs weak $H^{-1}$ norm to\nmeasure the residual component. By utilizing different regularizers, the\nproposed model effectively decomposes the image into reflection, illumination,\nand noise components. An alternating direction multipliers method (ADMM)\ncombined with the Majorize-Minimization (MM) algorithm is developed to solve\nthe proposed model. Furthermore, we provide a detailed proof of the convergence\nproperty of the algorithm. Numerical experiments validate both the proposed\nmodel and algorithm. Compared with several state-of-the-art denoising models,\nthe proposed model exhibits superior performance in terms of peak\nsignal-to-noise ratio (PSNR) and mean structural similarity (MSSIM).\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}