{"id":"2407.12328","title":"Forecast Analysis of Astrophysical Stochastic Gravitational Wave\n  Background beyond general relativity: A Case Study on Brans-Dicke Gravity","authors":"Ran Chen, Zhao Li, Yin-Jie Li, Yi-Ying Wang, Rui Niu, Wen Zhao, and\n  Yi-Zhong Fan","authorsParsed":[["Chen","Ran",""],["Li","Zhao",""],["Li","Yin-Jie",""],["Wang","Yi-Ying",""],["Niu","Rui",""],["Zhao","Wen",""],["Fan","Yi-Zhong",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 06:07:03 GMT"}],"updateDate":"2024-07-18","timestamp":1721196423000,"abstract":"  Scalar-tensor gravity, exemplified by Brans-Dicke (BD) gravity, introduces\nadditional scalar polarization modes that contribute scalar radiation alongside\ntensor modes. We conduct a comprehensive analysis of how gravitational wave\ngeneration and propagation effects under Brans-Dicke gravity are encoded into\nthe astrophysical stochastic gravitational wave background (AGWB). We perform\nend-to-end analyses of realistic populations of simulated coalescing binary\nsystems to generate AGWB mock data with third-generation gravitational wave\ndetectors and conducted a complete Bayesian analysis for the first time. We\nfind the uncertainties in the population properties of binary black holes (BBH)\nsignificantly affect the ability to constrain BD gravity. Under the most\nfavorable conditions, the upper limit may suggest $\\omega_{\\rm BD} > 816$.\nFurthermore, we explore the detectability of potential scalar backgrounds\narising from binary neutron star (BNS) mergers, setting upper limits on scalar\nbackgrounds expected to be two orders of magnitude lower than the total\nbackground contributed by both BBH and BNS in one year of observational data.\nWe conclude that for ambiguous populations, employing waveform matching with\nindividual sources provides a more robust approach to constrain Brans-Dicke\ngravity. However, the future detection of a potential scalar background within\nthe AGWB could provide significant support for gravity theories beyond General\nRelativity.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}