{"id":"2407.07306","title":"Electrical Impedance Tomography Based Closed-loop Tumor Treating Fields\n  in Dynamic Lung Tumors","authors":"Minmin Wang, Xu Xie, Yuxi Guo, Liying Zhu, Yue Lan, Haitang Yang, Yun\n  Pan, Guangdi Chen, Shaomin Zhang, Maomao Zhang","authorsParsed":[["Wang","Minmin",""],["Xie","Xu",""],["Guo","Yuxi",""],["Zhu","Liying",""],["Lan","Yue",""],["Yang","Haitang",""],["Pan","Yun",""],["Chen","Guangdi",""],["Zhang","Shaomin",""],["Zhang","Maomao",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 01:56:36 GMT"}],"updateDate":"2024-07-11","timestamp":1720576596000,"abstract":"  Tumor Treating Fields (TTFields) is a non-invasive anticancer modality that\nutilizes alternating electric fields to disrupt cancer cell division and\ngrowth. While generally well-tolerated with minimal side effects, traditional\nTTFields therapy for lung tumors faces challenges due to the influence of\nrespiratory motion. We design a novel closed-loop TTFields strategy for lung\ntumors by incorporating electrical impedance tomography (EIT) for real-time\nrespiratory phase monitoring and dynamic parameter adjustments. Furthermore, we\nconduct theoretical analysis to evaluate the performance of the proposed method\nusing the lung motion model. Compared to conventional TTFields settings, we\nobserved that variations in the electrical conductivity of lung during\ndifferent respiratory phases led to a decrease in the average electric field\nintensity within lung tumors, transitioning from end-expiratory (1.08 V/cm) to\nend-inspiratory (0.87 V/cm) phases. Utilizing our proposed closed-Loop TTFields\napproach at the same dose setting (2400 mA, consistent with the traditional\nTTFields setting), we can achieve a higher and consistent average electric\nfield strength at the tumor site (1.30 V/cm) across different respiratory\nstages. Our proposed closed-loop TTFields method has the potential to improved\nlung tumor therapy by mitigating the impact of respiratory motion.\n","subjects":["Physics/Medical Physics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}