{"id":"2407.03179","title":"Motion meets Attention: Video Motion Prompts","authors":"Qixiang Chen, Lei Wang, Piotr Koniusz, Tom Gedeon","authorsParsed":[["Chen","Qixiang",""],["Wang","Lei",""],["Koniusz","Piotr",""],["Gedeon","Tom",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 14:59:46 GMT"}],"updateDate":"2024-07-04","timestamp":1720018786000,"abstract":"  Videos contain rich spatio-temporal information. Traditional methods for\nextracting motion, used in tasks such as action recognition, often rely on\nvisual contents rather than precise motion features. This phenomenon is\nreferred to as 'blind motion extraction' behavior, which proves inefficient in\ncapturing motions of interest due to a lack of motion-guided cues. Recently,\nattention mechanisms have enhanced many computer vision tasks by effectively\nhighlighting salient visual areas. Inspired by this, we propose using a\nmodified Sigmoid function with learnable slope and shift parameters as an\nattention mechanism to activate and modulate motion signals derived from frame\ndifferencing maps. This approach generates a sequence of attention maps that\nenhance the processing of motion-related video content. To ensure temporally\ncontinuity and smoothness of the attention maps, we apply pair-wise temporal\nattention variation regularization to remove unwanted motions (e.g., noise)\nwhile preserving important ones. We then perform Hadamard product between each\npair of attention maps and the original video frames to highlight the evolving\nmotions of interest over time. These highlighted motions, termed video motion\nprompts, are subsequently used as inputs to the model instead of the original\nvideo frames. We formalize this process as a motion prompt layer and\nincorporate the regularization term into the loss function to learn better\nmotion prompts. This layer serves as an adapter between the model and the video\ndata, bridging the gap between traditional 'blind motion extraction' and the\nextraction of relevant motions of interest.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}