{"id":"2407.21790","title":"First measurement of the triaxiality of the inner dark matter halo of\n  the Milky Way","authors":"Hanneke C. Woudenberg and Amina Helmi","authorsParsed":[["Woudenberg","Hanneke C.",""],["Helmi","Amina",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 17:57:45 GMT"}],"updateDate":"2024-08-01","timestamp":1722448665000,"abstract":"  Stellar streams are particularly sensitive probes of the mass distribution of\ngalaxies. In this work, we focus on the Helmi Streams, the remnants of an\naccreted dwarf galaxy orbiting the inner Milky Way. We examine in depth their\npeculiar dynamical properties, and use these to provide tight constraints on\nthe Galactic potential, and specifically on its dark matter halo in the inner\n20 kpc. We extract 6D phase-space information for the Helmi Streams from Gaia\nDR3, and confirm that the Streams split up into two clumps in angular momentum\nspace, and that these depict different degrees of phase-mixing. To explain\nthese characteristics we explore a range of Galactic potential models with a\ntriaxial NFW halo, further constrained by rotation curve data. We find that a\nGalactic potential with a mildly triaxial dark matter halo, having\n$p=1.013^{+0.006}_{-0.006}$, $q=1.204^{+0.032}_{-0.036}$,\n$M_{\\rm{discs}}=4.65^{+0.47}_{-0.57}\\cdot10^{10} M_{\\odot}$ and $M_{\\rm{DM}}(<\n15 \\text{kpc})=1.14^{+0.11}_{-0.10}\\cdot10^{11} M_{\\odot}$, is required to form\ntwo clumps in angular momentum space over time. Their formation is driven by\nthe fact that the clumps are on different orbital families and close to an\norbital resonance. This resonance also explains the different degrees of mixing\nobserved, as well as the presence of a dynamically cold subclump (also known as\nS2). This first and very precise measurement of the triaxiality of the inner\ndark matter halo of the Galaxy uniquely reveals the high sensitivity of\nphase-mixed streams to the exact form of the gravitational potential.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}