{"id":"2407.15276","title":"Nonlinear Binscatter Methods","authors":"Matias D. Cattaneo, Richard K. Crump, Max H. Farrell, Yingjie Feng","authorsParsed":[["Cattaneo","Matias D.",""],["Crump","Richard K.",""],["Farrell","Max H.",""],["Feng","Yingjie",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 21:57:09 GMT"}],"updateDate":"2024-07-23","timestamp":1721599029000,"abstract":"  Binned scatter plots are a powerful statistical tool for empirical work in\nthe social, behavioral, and biomedical sciences. Available methods rely on a\nquantile-based partitioning estimator of the conditional mean regression\nfunction to primarily construct flexible yet interpretable visualization\nmethods, but they can also be used to estimate treatment effects, assess\nuncertainty, and test substantive domain-specific hypotheses. This paper\nintroduces novel binscatter methods based on nonlinear, possibly nonsmooth\nM-estimation methods, covering generalized linear, robust, and quantile\nregression models. We provide a host of theoretical results and practical tools\nfor local constant estimation along with piecewise polynomial and spline\napproximations, including (i) optimal tuning parameter (number of bins)\nselection, (ii) confidence bands, and (iii) formal statistical tests regarding\nfunctional form or shape restrictions. Our main results rely on novel strong\napproximations for general partitioning-based estimators covering random,\ndata-driven partitions, which may be of independent interest. We demonstrate\nour methods with an empirical application studying the relation between the\npercentage of individuals without health insurance and per capita income at the\nzip-code level. We provide general-purpose software packages implementing our\nmethods in Python, R, and Stata.\n","subjects":["Statistics/Methodology","Economics/Econometrics","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"PGPtfHYiw2P-04jYLheqRq__px8me7deOwJeqerMiV4","pdfSize":"1215285"}
