{"id":"2407.12339","title":"Exploring Deeper! Segment Anything Model with Depth Perception for\n  Camouflaged Object Detection","authors":"Zhenni Yu, Xiaoqin Zhang, Li Zhao, Yi Bin, Guobao Xiao","authorsParsed":[["Yu","Zhenni",""],["Zhang","Xiaoqin",""],["Zhao","Li",""],["Bin","Yi",""],["Xiao","Guobao",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 06:31:29 GMT"}],"updateDate":"2024-07-18","timestamp":1721197889000,"abstract":"  This paper introduces a new Segment Anything Model with Depth Perception\n(DSAM) for Camouflaged Object Detection (COD). DSAM exploits the zero-shot\ncapability of SAM to realize precise segmentation in the RGB-D domain. It\nconsists of the Prompt-Deeper Module and the Finer Module. The Prompt-Deeper\nModule utilizes knowledge distillation and the Bias Correction Module to\nachieve the interaction between RGB features and depth features, especially\nusing depth features to correct erroneous parts in RGB features. Then, the\ninteracted features are combined with the box prompt in SAM to create a prompt\nwith depth perception. The Finer Module explores the possibility of accurately\nsegmenting highly camouflaged targets from a depth perspective. It uncovers\ndepth cues in areas missed by SAM through mask reversion, self-filtering, and\nself-attention operations, compensating for its defects in the COD domain. DSAM\nrepresents the first step towards the SAM-based RGB-D COD model. It maximizes\nthe utilization of depth features while synergizing with RGB features to\nachieve multimodal complementarity, thereby overcoming the segmentation\nlimitations of SAM and improving its accuracy in COD. Experimental results on\nCOD benchmarks demonstrate that DSAM achieves excellent segmentation\nperformance and reaches the state-of-the-art (SOTA) on COD benchmarks with less\nconsumption of training resources. The code will be available at\nhttps://github.com/guobaoxiao/DSAM.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}