{"id":"2407.12570","title":"Further improvement of medium temperature heat treated SRF cavities for\n  high gradients","authors":"L. Steder, C. Bate, K. Kasprzak, D. Reschke, L. Trelle, H. Weise, M.\n  Wiencek","authorsParsed":[["Steder","L.",""],["Bate","C.",""],["Kasprzak","K.",""],["Reschke","D.",""],["Trelle","L.",""],["Weise","H.",""],["Wiencek","M.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 13:52:57 GMT"}],"updateDate":"2024-07-18","timestamp":1721224377000,"abstract":"  The application of heat treatments on 1.3 GHz TESLA type cavities in\nultra-high vacuum at 250{\\deg}C to 350{\\deg}C is called medium temperature or\nmid-T heat treatment. In various laboratories such treatments on\nsuperconducting radio frequency (SRF) cavities result reproducible in three\nmain characteristic features for the quality factor $Q_0$ in dependency of the\naccelerating electric field strength $E_{acc}$. First, comparing mid-T heat\ntreatment with a baseline treatment, a significant increase of $Q_0$ up to\n$5\\cdot10^{10}$ at 2K can be observed. Second, with increasing accelerating\ngradient $E_{acc}$ the $Q_0$ increases up to a maximum around 16 to 20 MV/m.\nThis effect is known as anti-Q-slope. The third observation for a mid-T heat\ntreatment compared to a baseline treatment is an often reduced maximum gradient\n$E_{acc}$.\n  The appearance of a high-field-Q-slope (HFQS) was reported after mid-T heat\ntreatments of 3 hours at 350{\\deg}C or of 20 hours at 300{\\deg}C at DESY. Using\nthe heating temperature and the heating time taken from the temperature profile\nof the furnace effective oxygen diffusion lengths $l$ were calculated. In the\nfollow-up study presented here, a set of three single-cell cavities with\ndiffusion lengths $l$ above 1700 nm, showing HFQS, were treated with an\nadditional so-called low-T bake of 24-48 hours at 120{\\deg}C to 130{\\deg}C. The\nsubsequent reproducible Q(E) -performances results indicate that the low-T bake\nprocedure cures the HFQS like for cavities treated with the EuXFEL recipe of EP\nand following low-T treatments. As presented in the following, Q values of more\nthan $3\\cdot10^{10}$ at 16 MV/m and accelerating gradients of 32 to 40 MV/m are\nachieved.\n","subjects":["Physics/Accelerator Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}