{"id":"2407.19975","title":"Integrated Scenario-based Analysis: A data-driven approach to support\n  automated driving systems development and safety evaluation","authors":"Gibran Ali, Kaye Sullivan, Eileen Herbers, Vicki Williams, Dustin\n  Holley, Jacobo Antona-Makoshi, Kevin Kefauver","authorsParsed":[["Ali","Gibran",""],["Sullivan","Kaye",""],["Herbers","Eileen",""],["Williams","Vicki",""],["Holley","Dustin",""],["Antona-Makoshi","Jacobo",""],["Kefauver","Kevin",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:09:02 GMT"}],"updateDate":"2024-07-30","timestamp":1722258542000,"abstract":"  Several scenario-based frameworks exist to aid in vehicle system development\nand safety assurance. However, there is a need for approaches that combine\ndifferent types of datasets that offer varying levels of case severity, data\nrichness, and representativeness. This study presents an integrated\nscenario-based analysis approach that encompasses scenario definition, fusion,\nparametrization, and test case generation. For this process, ten years of fatal\nand non-fatal national crash data from the United States are combined with over\n34 million miles of naturalistic driving data. An illustrative example\nscenario, \"turns at intersection\", is chosen to demonstrate this approach.\nFirst, scenario definitions are established from both record-based and\ncontinuous time series data. Second, a frequency analysis is performed to\nunderstand how often events from the same scenario occur at different\nseverities across datasets. Third, an analysis is performed to show the key\nfactors relevant to the scenario and the distribution of various parameters.\nFinally, a method to combine both types of data into representative test case\nscenarios is presented. These techniques improve scenario representativeness in\ntwo major ways: first, they populate an entire spectrum of cases ranging from\nroutine events to fatal crashes; and second, they provide context-rich,\nmulti-year data by combining large-scale national and naturalistic datasets.\n","subjects":["Computing Research Repository/Robotics","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}