{"id":"2407.07717","title":"High-dimensional Covariance Estimation by Pairwise Likelihood Truncation","authors":"Alessandro Casa, Davide Ferrari and Zhendong Huang","authorsParsed":[["Casa","Alessandro",""],["Ferrari","Davide",""],["Huang","Zhendong",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 14:49:20 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 07:35:35 GMT"}],"updateDate":"2024-07-25","timestamp":1720622960000,"abstract":"  Pairwise likelihood is a useful approximation to the full likelihood function\nfor covariance estimation in high-dimensional context. It simplifies\nhigh-dimensional dependencies by combining marginal bivariate likelihood\nobjects, thus making estimation more manageable. In certain models, including\nthe Gaussian model, both pairwise and full likelihoods are maximized by the\nsame parameter values, thus retaining optimal statistical efficiency, when the\nnumber of variables is fixed. Leveraging on this insight, we introduce\nestimation of sparse high-dimensional covariance matrices by maximizing a\ntruncated version of the pairwise likelihood function, obtained by including\npairwise terms corresponding to nonzero covariance elements. To achieve a\nmeaningful truncation, we propose to minimize the $L_2$-distance between\npairwise and full likelihood scores plus an $L_1$-penalty discouraging the\ninclusion of uninformative terms. Differently from other regularization\napproaches, our method focuses on selecting whole pairwise likelihood objects\nrather than shrinking individual covariance parameters, thus retaining the\ninherent unbiasedness of the pairwise likelihood estimating equations. This\nselection procedure is shown to have the selection consistency property as the\ncovariance dimension increases exponentially fast. Consequently, the implied\npairwise likelihood estimator is consistent and converges to the oracle maximum\nlikelihood estimator assuming knowledge of nonzero covariance entries.\n","subjects":["Statistics/Methodology","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}