{"id":"2407.07751","title":"ArcaNN: automated enhanced sampling generation of training sets for\n  chemically reactive machine learning interatomic potentials","authors":"Rolf David (1), Miguel de la Puente (1), Axel Gomez (1), Olaia Anton\n  (1), Guillaume Stirnemann (1), Damien Laage (1) ((1) PASTEUR, D\\'epartement\n  de Chimie, \\'Ecole Normale Sup\\'erieure, PSL University, Sorbonne University,\n  CNRS, Paris)","authorsParsed":[["David","Rolf",""],["de la Puente","Miguel",""],["Gomez","Axel",""],["Anton","Olaia",""],["Stirnemann","Guillaume",""],["Laage","Damien",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:21:05 GMT"}],"updateDate":"2024-07-11","timestamp":1720624865000,"abstract":"  The emergence of artificial intelligence has profoundly impacted\ncomputational chemistry, particularly through machine-learned potentials\n(MLPs), which offer a balance of accuracy and efficiency in calculating atomic\nenergies and forces to be used in molecular dynamics simulations. These MLPs\nhave significantly advanced molecular dynamics simulations across various\napplications, including large-scale simulations of materials, interfaces, and\nchemical reactions. Despite these advances, the construction of training\ndatasets - a critical component for the accuracy of MLPs - has not received\nproportional attention. This is particularly critical for chemical reactivity\nwhich depends on rare barrier-crossing events. Here we address this gap by\nintroducing ArcaNN, a comprehensive framework designed for generating training\ndatasets for reactive MLPs. ArcaNN employs a concurrent learning approach\ncombined with advanced sampling techniques to ensure accurate representation of\nhigh-energy geometries. The framework integrates automated processes for\niterative training, exploration, new configuration selection, and energy and\nforce labeling, while ensuring reproducibility and documentation. We\ndemonstrate ArcaNN's capabilities through a paradigm nucleophilic substitution\nreaction in solution, showcasing its effectiveness, the uniformly low error of\nthe resulting MLP everywhere along the chemical reaction coordinate, and its\npotential for broad applications in reactive molecular dynamics. We also\nprovide guidelines on how to assess the quality of a NNP for a reactive system.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}