{"id":"2407.14544","title":"Fast Iterative Graph Computing with Updated Neighbor States","authors":"Yijie Zhou, Shufeng Gong, Feng Yao, Hanzhang Chen, Song Yu, Pengxi\n  Liu, Yanfeng Zhang, Ge Yu, Jeffrey Xu Yu","authorsParsed":[["Zhou","Yijie",""],["Gong","Shufeng",""],["Yao","Feng",""],["Chen","Hanzhang",""],["Yu","Song",""],["Liu","Pengxi",""],["Zhang","Yanfeng",""],["Yu","Ge",""],["Yu","Jeffrey Xu",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 07:56:58 GMT"}],"updateDate":"2024-07-23","timestamp":1721116618000,"abstract":"  Enhancing the efficiency of iterative computation on graphs has garnered\nconsiderable attention in both industry and academia. Nonetheless, the majority\nof efforts focus on expediting iterative computation by minimizing the running\ntime per iteration step, ignoring the optimization of the number of iteration\nrounds, which is a crucial aspect of iterative computation. We experimentally\nverified the correlation between the vertex processing order and the number of\niterative rounds, thus making it possible to reduce the number of execution\nrounds for iterative computation. In this paper, we propose a graph reordering\nmethod, GoGraph, which can construct a well-formed vertex processing order\neffectively reducing the number of iteration rounds and, consequently,\naccelerating iterative computation. Before delving into GoGraph, a metric\nfunction is introduced to quantify the efficiency of vertex processing order in\naccelerating iterative computation. This metric reflects the quality of the\nprocessing order by counting the number of edges whose source precedes the\ndestination. GoGraph employs a divide-and-conquer mindset to establish the\nvertex processing order by maximizing the value of the metric function. Our\nexperimental results show that GoGraph outperforms current state-of-the-art\nreordering algorithms by 1.83x on average (up to 3.34x) in runtime.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}