{"id":"2407.06333","title":"A third-order finite difference weighted essentially non-oscillatory\n  scheme with shallow neural network","authors":"Kwanghyuk Park, Xinjuan Chen, Dongjin Lee, Jiaxi Gu, Jae-Hun Jung","authorsParsed":[["Park","Kwanghyuk",""],["Chen","Xinjuan",""],["Lee","Dongjin",""],["Gu","Jiaxi",""],["Jung","Jae-Hun",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:55:57 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 09:43:58 GMT"}],"updateDate":"2024-07-11","timestamp":1720464957000,"abstract":"  In this paper, we introduce the finite difference weighted essentially\nnon-oscillatory (WENO) scheme based on the neural network for hyperbolic\nconservation laws. We employ the supervised learning and design two loss\nfunctions, one with the mean squared error and the other with the mean squared\nlogarithmic error, where the WENO3-JS weights are computed as the labels. Each\nloss function consists of two components where the first component compares the\ndifference between the weights from the neural network and WENO3-JS weights,\nwhile the second component matches the output weights of the neural network and\nthe linear weights. The former of the loss function enforces the neural network\nto follow the WENO properties, implying that there is no need for the\npost-processing layer. Additionally the latter leads to better performance\naround discontinuities. As a neural network structure, we choose the shallow\nneural network (SNN) for computational efficiency with the Delta layer\nconsisting of the normalized undivided differences. These constructed WENO3-SNN\nschemes show the outperformed results in one-dimensional examples and improved\nbehavior in two-dimensional examples, compared with the simulations from\nWENO3-JS and WENO3-Z.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis","Computing Research Repository/Neural and Evolutionary Computing","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"OyEP_eW2RGY3UGHEcVlLTZCamK9Sl7DdP8lmcxMsv3I","pdfSize":"3693189"}
