{"id":"2407.04103","title":"Advances in Diffusion Models for Image Data Augmentation: A Review of\n  Methods, Models, Evaluation Metrics and Future Research Directions","authors":"Panagiotis Alimisis, Ioannis Mademlis, Panagiotis\n  Radoglou-Grammatikis, Panagiotis Sarigiannidis, Georgios Th. Papadopoulos","authorsParsed":[["Alimisis","Panagiotis",""],["Mademlis","Ioannis",""],["Radoglou-Grammatikis","Panagiotis",""],["Sarigiannidis","Panagiotis",""],["Papadopoulos","Georgios Th.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 18:06:48 GMT"}],"updateDate":"2024-07-08","timestamp":1720116408000,"abstract":"  Image data augmentation constitutes a critical methodology in modern computer\nvision tasks, since it can facilitate towards enhancing the diversity and\nquality of training datasets; thereby, improving the performance and robustness\nof machine learning models in downstream tasks. In parallel, augmentation\napproaches can also be used for editing/modifying a given image in a context-\nand semantics-aware way. Diffusion Models (DMs), which comprise one of the most\nrecent and highly promising classes of methods in the field of generative\nArtificial Intelligence (AI), have emerged as a powerful tool for image data\naugmentation, capable of generating realistic and diverse images by learning\nthe underlying data distribution. The current study realizes a systematic,\ncomprehensive and in-depth review of DM-based approaches for image\naugmentation, covering a wide range of strategies, tasks and applications. In\nparticular, a comprehensive analysis of the fundamental principles, model\narchitectures and training strategies of DMs is initially performed.\nSubsequently, a taxonomy of the relevant image augmentation methods is\nintroduced, focusing on techniques regarding semantic manipulation,\npersonalization and adaptation, and application-specific augmentation tasks.\nThen, performance assessment methodologies and respective evaluation metrics\nare analyzed. Finally, current challenges and future research directions in the\nfield are discussed.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wtyuvNRZzA-D9Vv3Zjp-KFB5BfXIde4ZTg6bQNfupto","pdfSize":"2020649"}
