{"id":"2407.18267","title":"MCU-MixQ: A HW/SW Co-optimized Mixed-precision Neural Network Design\n  Framework for MCUs","authors":"Junfeng Gong, Cheng Liu, Long Cheng, Huawei Li, Xiaowei Li","authorsParsed":[["Gong","Junfeng",""],["Liu","Cheng",""],["Cheng","Long",""],["Li","Huawei",""],["Li","Xiaowei",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:51:15 GMT"}],"updateDate":"2024-07-29","timestamp":1721227875000,"abstract":"  Mixed-precision neural network (MPNN) that utilizes just enough data width\nfor the neural network processing is an effective approach to meet the\nstringent resources constraints including memory and computing of MCUs.\nNevertheless, there is still a lack of sub-byte and mixed-precision SIMD\noperations in MCU-class ISA and the limited computing capability of MCUs\nremains underutilized, which further aggravates the computing bound encountered\nin neural network processing. As a result, the benefits of MPNNs cannot be\nfully unleashed. In this work, we propose to pack multiple low-bitwidth\narithmetic operations within a single instruction multiple data (SIMD)\ninstructions in typical MCUs, and then develop an efficient convolution\noperator by exploring both the data parallelism and computing parallelism in\nconvolution along with the proposed SIMD packing. Finally, we further leverage\nNeural Architecture Search (NAS) to build a HW/SW co-designed MPNN design\nframework, namely MCU-MixQ. This framework can optimize both the MPNN\nquantization and MPNN implementation efficiency, striking an optimized balance\nbetween neural network performance and accuracy. According to our experiment\nresults, MCU-MixQ achieves 2.1$\\times$ and 1.4$\\times$ speedup over CMix-NN and\nMCUNet respectively under the same resource constraints.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"QyuavW7XzEXz5zTzVT4oeWhAD_InLhb2JvCns2u7RsY","pdfSize":"1029361","objectId":"0x9332e98d6790c29e74f85090d4496a0ba9bfabe6f21cba4a52c560b8da774198","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
