{"id":"2407.07921","title":"A Trustworthy AIoT-enabled Localization System via Federated Learning\n  and Blockchain","authors":"Junfei Wang, He Huang, Jingze Feng, Steven Wong, Lihua Xie, Jianfei\n  Yang","authorsParsed":[["Wang","Junfei",""],["Huang","He",""],["Feng","Jingze",""],["Wong","Steven",""],["Xie","Lihua",""],["Yang","Jianfei",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 04:14:19 GMT"}],"updateDate":"2024-07-12","timestamp":1720412059000,"abstract":"  There is a significant demand for indoor localization technology in smart\nbuildings, and the most promising solution in this field is using RF sensors\nand fingerprinting-based methods that employ machine learning models trained on\ncrowd-sourced user data gathered from IoT devices. However, this raises\nsecurity and privacy issues in practice. Some researchers propose to use\nfederated learning to partially overcome privacy problems, but there still\nremain security concerns, e.g., single-point failure and malicious attacks. In\nthis paper, we propose a framework named DFLoc to achieve precise 3D\nlocalization tasks while considering the following two security concerns.\nParticularly, we design a specialized blockchain to decentralize the framework\nby distributing the tasks such as model distribution and aggregation which are\nhandled by a central server to all clients in most previous works, to address\nthe issue of the single-point failure for a reliable and accurate indoor\nlocalization system. Moreover, we introduce an updated model verification\nmechanism within the blockchain to alleviate the concern of malicious node\nattacks. Experimental results substantiate the framework's capacity to deliver\naccurate 3D location predictions and its superior resistance to the impacts of\nsingle-point failure and malicious attacks when compared to conventional\ncentralized federated learning systems.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}