{"id":"2407.14789","title":"PERCORE: A Deep Learning-Based Framework for Persian Spelling Correction\n  with Phonetic Analysis","authors":"Seyed Mohammad Sadegh Dashti, Amid Khatibi Bardsiri, Mehdi Jafari\n  Shahbazzadeh","authorsParsed":[["Dashti","Seyed Mohammad Sadegh",""],["Bardsiri","Amid Khatibi",""],["Shahbazzadeh","Mehdi Jafari",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 07:41:04 GMT"}],"updateDate":"2024-07-23","timestamp":1721461264000,"abstract":"  This research introduces a state-of-the-art Persian spelling correction\nsystem that seamlessly integrates deep learning techniques with phonetic\nanalysis, significantly enhancing the accuracy and efficiency of natural\nlanguage processing (NLP) for Persian. Utilizing a fine-tuned language\nrepresentation model, our methodology effectively combines deep contextual\nanalysis with phonetic insights, adeptly correcting both non-word and real-word\nspelling errors. This strategy proves particularly effective in tackling the\nunique complexities of Persian spelling, including its elaborate morphology and\nthe challenge of homophony. A thorough evaluation on a wide-ranging dataset\nconfirms our system's superior performance compared to existing methods, with\nimpressive F1-Scores of 0.890 for detecting real-word errors and 0.905 for\ncorrecting them. Additionally, the system demonstrates a strong capability in\nnon-word error correction, achieving an F1-Score of 0.891. These results\nillustrate the significant benefits of incorporating phonetic insights into\ndeep learning models for spelling correction. Our contributions not only\nadvance Persian language processing by providing a versatile solution for a\nvariety of NLP applications but also pave the way for future research in the\nfield, emphasizing the critical role of phonetic analysis in developing\neffective spelling correction system.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QrnIe3JpQpiJvV5RdGhOCNNOUUvJAckb9Qnn4ZnLy1Q","pdfSize":"662728"}
