{"id":"2407.09368","title":"Maximum Unique Coverage on Streams: Improved FPT Approximation Scheme\n  and Tighter Space Lower Bound","authors":"Philip Cervenjak, Junhao Gan, Seeun William Umboh, Anthony Wirth","authorsParsed":[["Cervenjak","Philip",""],["Gan","Junhao",""],["Umboh","Seeun William",""],["Wirth","Anthony",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 15:50:20 GMT"}],"updateDate":"2024-07-15","timestamp":1720799420000,"abstract":"  We consider the Max Unique Coverage problem, including applications to the\ndata stream model. The input is a universe of $n$ elements, a collection of $m$\nsubsets of this universe, and a cardinality constraint, $k$. The goal is to\nselect a subcollection of at most $k$ sets that maximizes unique coverage, i.e,\nthe number of elements contained in exactly one of the selected sets. The Max\nUnique Coverage problem has applications in wireless networks, radio broadcast,\nand envy-free pricing.\n  Our first main result is a fixed-parameter tractable approximation scheme\n(FPT-AS) for Max Unique Coverage, parameterized by $k$ and the maximum element\nfrequency, $r$, which can be implemented on a data stream. Our FPT-AS finds a\n$(1-\\epsilon)$-approximation while maintaining a kernel of size $\\tilde{O}(k\nr/\\epsilon)$, which can be combined with subsampling to use $\\tilde{O}(k^2 r /\n\\epsilon^3)$ space overall. This significantly improves on the previous-best\nFPT-AS with the same approximation, but a kernel of size $\\tilde{O}(k^2 r /\n\\epsilon^2)$. In order to achieve our result, we show upper bounds on the ratio\nof a collection's coverage to the unique coverage of a maximizing\nsubcollection; this is by constructing explicit algorithms that find a\nsubcollection with unique coverage at least a logarithmic ratio of the\ncollection's coverage. We complement our algorithms with our second main\nresult, showing that $\\Omega(m / k^2)$ space is necessary to achieve a $(1.5 +\no(1))/(\\ln k - 1)$-approximation in the data stream. This dramatically improves\nthe previous-best lower bound showing that $\\Omega(m / k^2)$ is necessary to\nachieve better than a $e^{-1+1/k}$-approximation.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}