{"id":"2407.14250","title":"Fate of transient order parameter domain walls in ultrafast experiments","authors":"Lingxian Kong, Ryuichi Shindou, and Zhiyuan Sun","authorsParsed":[["Kong","Lingxian",""],["Shindou","Ryuichi",""],["Sun","Zhiyuan",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 12:30:48 GMT"}],"updateDate":"2024-07-22","timestamp":1721392248000,"abstract":"  In ultrafast experiments, an optical pump pulse often generates transient\ndomain walls of the order parameter in materials with spontaneous symmetry\nbreaking, due to either a finite penetration depth of the light on a\nthree-dimensional (3D) material, or a finite spot size on a two-dimensional\n(2D) material. We clarify the decaying process of such a domain wall that is\ncaused by fluctuations of the order parameters. We study a generic system with\n$U(1)$-symmetric order, and those with an additional weak $Z_2$\n($U(1)$-symmetry-breaking) term, representing the charge-density-wave (CDW)\norders in recent experiments. The decay process comprises two non-trivial\nstages. During the first stage, exponentially growing thermal fluctuations\nconvert the domain wall into an interface with randomly distributed topological\ndefects. In the second stage, the topological defects undergo a coarsening\ndynamics within the interface. For a 2D interface in the 3D system, the\ncoarsening dynamics leads to a diffusive growth of the correlation length. For\na one-dimensional (1D) interface in the 2D system with the weak $Z_2$ term, the\ncorrelation-length growth shows a crossover from diffusive to sub-diffusive\nbehavior. Our theory provides a fundamental physical picture for the dynamics\nof pump-induced domain walls in ultrafast experiments.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fvB97xcbaatLORwk9nU0IXBksuqWVriHWCRbl9OEtzM","pdfSize":"2167450"}
