{"id":"2407.20595","title":"Harvesting Textual and Structured Data from the HAL Publication\n  Repository","authors":"Francis Kulumba, Wissam Antoun, Guillaume Vimont, Laurent Romary","authorsParsed":[["Kulumba","Francis",""],["Antoun","Wissam",""],["Vimont","Guillaume",""],["Romary","Laurent",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 07:14:04 GMT"}],"updateDate":"2024-07-31","timestamp":1722323644000,"abstract":"  HAL (Hyper Articles en Ligne) is the French national publication repository,\nused by most higher education and research organizations for their open science\npolicy. As a digital library, it is a rich repository of scholarly documents,\nbut its potential for advanced research has been underutilized. We present\nHALvest, a unique dataset that bridges the gap between citation networks and\nthe full text of papers submitted on HAL. We craft our dataset by filtering HAL\nfor scholarly publications, resulting in approximately 700,000 documents,\nspanning 34 languages across 13 identified domains, suitable for language model\ntraining, and yielding approximately 16.5 billion tokens (with 8 billion in\nFrench and 7 billion in English, the most represented languages). We transform\nthe metadata of each paper into a citation network, producing a directed\nheterogeneous graph. This graph includes uniquely identified authors on HAL, as\nwell as all open submitted papers, and their citations. We provide a baseline\nfor authorship attribution using the dataset, implement a range of\nstate-of-the-art models in graph representation learning for link prediction,\nand discuss the usefulness of our generated knowledge graph structure.\n","subjects":["Computing Research Repository/Digital Libraries","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Q6YIkCDAoxsphwDlphNUUb-tSVuvwJEcgUk7EW3XvOs","pdfSize":"392828","objectId":"0xba693af2819be816898db5f35e2c6460efc59b44cb56fe032140c56cdccfcba4","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
