{"id":"2407.19377","title":"Danish DPA Banned the Use of Google Chromebooks and Google Workspace in\n  Schools in Helsingor Municipality","authors":"Marcelo Corrales Compagnucci","authorsParsed":[["Compagnucci","Marcelo Corrales",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 03:24:40 GMT"}],"updateDate":"2024-07-30","timestamp":1722137080000,"abstract":"  On July 14th, 2022, the Danish Data Protection Authority issued a reprimand\nagainst Helsingor Municipality. It imposed a general ban on using Google\nChromebooks and Google Workspace for education in primary schools in the\nMunicipality. The Danish DPA banned such processing and suspended any related\ndata transfers to the United States (U.S.) until it is brought in line with the\nGeneral Data Protection Regulation (GDPR). The suspension took effect\nimmediately, and the Municipality had until August 3rd, 2022, to withdraw and\nterminate the processing, as well as delete data already transferred. Finally,\nin a new decision on August 18th, 2022, the Danish DPA has ratified the ban to\nthe use of Google Chromebooks and Workspace. In the eyes of the Danish DPA, the\nMunicipality failed for example to document that they have assessed and reduced\nthe relevant risks to the rights and freedoms of the pupils. This article is\nstructured as follows: section II provides the background concerning the\nunfolding events after the Schrems II ruling. Section III discusses the origins\nand facts of the Danish DPA case. Section IV examines the reasoning and\ncritical findings of the Danish DPA decision. Finally, section V concludes with\nsome general recommendations the Danish municipalities must follow based on the\nensuing effects stemming from this case.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Cryptography and Security","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3phzqk3ctw_OdMH30GNjghIwX3Z7l_7sQAxBTmHbNRk","pdfSize":"362311"}
