{"id":"2407.01183","title":"TCSR-SQL: Towards Table Content-aware Text-to-SQL with Self-retrieval","authors":"Wenbo Xu, Liang Yan, Peiyi Han, Haifeng Zhu, Chuanyi Liu, Shaoming\n  Duan, Cuiyun Gao, Yingwei Liang","authorsParsed":[["Xu","Wenbo",""],["Yan","Liang",""],["Han","Peiyi",""],["Zhu","Haifeng",""],["Liu","Chuanyi",""],["Duan","Shaoming",""],["Gao","Cuiyun",""],["Liang","Yingwei",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 11:17:56 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 06:58:04 GMT"}],"updateDate":"2024-07-15","timestamp":1719832676000,"abstract":"  Large Language Model-based (LLM-based) Text-to-SQL methods have achieved\nimportant progress in generating SQL queries for real-world applications. When\nconfronted with table content-aware questions in real-world scenarios,\nambiguous data content keywords and non-existent database schema column names\nwithin the question leads to the poor performance of existing methods. To solve\nthis problem, we propose a novel approach towards Table Content-aware\nText-to-SQL with Self-Retrieval (TCSR-SQL). It leverages LLM's in-context\nlearning capability to extract data content keywords within the question and\ninfer possible related database schema, which is used to generate Seed SQL to\nfuzz search databases. The search results are further used to confirm the\nencoding knowledge with the designed encoding knowledge table, including column\nnames and exact stored content values used in the SQL. The encoding knowledge\nis sent to obtain the final Precise SQL following multi-rounds of\ngeneration-execution-revision process. To validate our approach, we introduce a\ntable-content-aware, question-related benchmark dataset, containing 1,692\nquestion-SQL pairs. Comprehensive experiments conducted on this benchmark\ndemonstrate the remarkable performance of TCSR-SQL, achieving an improvement of\nat least 13.7% in execution accuracy compared to other state-of-the-art\nmethods.\n","subjects":["Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"_Aj44B3kyY5uc1lBv1OVljVgUJ9BgXMKnIMOmwk-dsE","pdfSize":"853735"}
