{"id":"2407.19534","title":"Measuring Resolved Star Formation Histories from High-Precision\n  Color-Magnitude Diagrams with StarFormationHistories.jl","authors":"Christopher T. Garling, Nitya Kallivayalil, Kristen B. W. McQuinn,\n  Jack T. Warfield, Mario Gennaro, Roger E. Cohen","authorsParsed":[["Garling","Christopher T.",""],["Kallivayalil","Nitya",""],["McQuinn","Kristen B. W.",""],["Warfield","Jack T.",""],["Gennaro","Mario",""],["Cohen","Roger E.",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 16:47:38 GMT"}],"updateDate":"2024-07-30","timestamp":1722185258000,"abstract":"  Understanding how and when galaxies formed stars over the history of the\nUniverse is fundamental to the study of galaxy evolution. The star formation\nhistories (SFHs) of galaxies in the local Universe can be measured with high\nprecision using deep imaging with space telescopes. Such resolved SFHs are\nbased on modelling the observed color-magnitude diagram (CMD) with stellar\nevolution models and rely on age-sensitive features like the main sequence\nturn-off to measure a galaxy's star formation rate as a function of time. There\nare many other population-level parameters that factor into these measurements,\nsuch as the stellar initial mass function (IMF), binary fraction, and\nmetallicity, to name a few. We present and release StarFormationHistories.jl, a\nmodular, open-source Julia package for measuring resolved SFHs with a focus on\nmodel flexibility for these types of population parameters. The code can model\nunresolved photometric binaries and supports arbitrary IMFs. Random\nuncertainties in the SFH measurements can be quantified with Monte Carlo\nposterior sampling methods. We illustrate the performance of the package on\nJWST/NIRCAM data of the Local Group dwarf irregular galaxy WLM\n$\\left(M_v\\approx-14.2\\right)$, which exhibits a complex, well-sampled CMD, and\nHST/ACS data of the ultra-faint Milky Way satellite dwarf galaxy Horologium I\n$\\left(M_v\\approx-3.7\\right)$, which has a much simpler but sparser CMD.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}