{"id":"2407.03335","title":"Dual-Domain Deep D-bar Method for Solving Electrical Impedance\n  Tomography","authors":"Xiang Cao, Qiaoqiao Ding, Xiaoqun Zhang","authorsParsed":[["Cao","Xiang",""],["Ding","Qiaoqiao",""],["Zhang","Xiaoqun",""]],"versions":[{"version":"v1","created":"Sun, 12 May 2024 21:55:02 GMT"}],"updateDate":"2024-07-08","timestamp":1715550902000,"abstract":"  The regularized D-bar method is one of the most prominent methods for solving\nElectrical Impedance Tomography (EIT) problems due to its efficiency and\nsimplicity. It provides a direct approach by applying low-pass filtering to the\nscattering data in the non-linear Fourier domain, thereby yielding a smoothed\nconductivity approximation. However, D-bar images often present low contrast\nand low resolution due to the absence of accurate high-frequency information\nand ill-posedness of the problem. In this paper, we proposed a dual-domain\nneural network architecture to retrieve high-contrast D-bar image sequences\nfrom low-contrast D-bar images. To further accentuate the spatial features of\nthe conductivity distribution, the widely adopted U-net has been tailored for\nconductivity image calibration from the predicted D-bar image sequences. We\ncall such a hybrid approach by Dual-Domain Deep D-bar method due to the\nconsideration of both scattering data and image information. Compared to the\nsingle-scale structure, our proposed multi-scale structure exhibits superior\ncapabilities in reducing artifacts and refining conductivity approximation.\nAdditionally, solving discrete D-bar systems using the GMRES algorithm entails\nsignificant computational complexity, which is extremely time-consuming on\nCPU-based devices. To remedy this, we designed a surrogate GPU-based Richardson\niterative method to accelerate the data enhancement process by D-bar. Numerical\nresults are presented for simulated EIT data from the KIT4 and ACT4 systems to\ndemonstrate notable improvements in absolute EIT imaging quality when compared\nto existing methodologies.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Numerical Analysis","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}