{"id":"2407.05666","title":"Enhancing Neural Radiance Fields with Depth and Normal Completion Priors\n  from Sparse Views","authors":"Jiawei Guo, HungChyun Chou and Ning Ding","authorsParsed":[["Guo","Jiawei",""],["Chou","HungChyun",""],["Ding","Ning",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 07:03:22 GMT"}],"updateDate":"2024-07-09","timestamp":1720422202000,"abstract":"  Neural Radiance Fields (NeRF) are an advanced technology that creates highly\nrealistic images by learning about scenes through a neural network model.\nHowever, NeRF often encounters issues when there are not enough images to work\nwith, leading to problems in accurately rendering views. The main issue is that\nNeRF lacks sufficient structural details to guide the rendering process\naccurately. To address this, we proposed a Depth and Normal Dense Completion\nPriors for NeRF (CP\\_NeRF) framework. This framework enhances view rendering by\nadding depth and normal dense completion priors to the NeRF optimization\nprocess. Before optimizing NeRF, we obtain sparse depth maps using the\nStructure from Motion (SfM) technique used to get camera poses. Based on the\nsparse depth maps and a normal estimator, we generate sparse normal maps for\ntraining a normal completion prior with precise standard deviations. During\noptimization, we apply depth and normal completion priors to transform sparse\ndata into dense depth and normal maps with their standard deviations. We use\nthese dense maps to guide ray sampling, assist distance sampling and construct\na normal loss function for better training accuracy. To improve the rendering\nof NeRF's normal outputs, we incorporate an optical centre position embedder\nthat helps synthesize more accurate normals through volume rendering.\nAdditionally, we employ a normal patch matching technique to choose accurate\nrendered normal maps, ensuring more precise supervision for the model. Our\nmethod is superior to leading techniques in rendering detailed indoor scenes,\neven with limited input views.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}