{"id":"2407.01661","title":"The infall region as a complementary probe to cluster abundance","authors":"Charlie T. Mpetha, James E. Taylor, Yuba Amoura, Roan Haggar","authorsParsed":[["Mpetha","Charlie T.",""],["Taylor","James E.",""],["Amoura","Yuba",""],["Haggar","Roan",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:00:00 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 20:05:33 GMT"}],"updateDate":"2024-07-26","timestamp":1719856800000,"abstract":"  Galaxy cluster abundance measurements provide a classic test of cosmology.\nThey are most sensitive to the evolved amplitude of fluctuations, usually\nexpressed as $S_8 = \\sigma_8\\sqrt{\\Omega_m/0.3}$. Thus, abundance constraints\nexhibit a strong degeneracy between $\\sigma_8$ and $\\Omega_{\\rm m}$, as do\nother similar low-redshift tests such as cosmic shear. The mass distribution in\nthe infall region around galaxy clusters, where material is being accreted from\nthe surrounding field, also exhibits a cosmological dependence, but in this\ncase it is nearly orthogonal to the $S_8$ direction in the\n$\\Omega_m$--$\\sigma_8$ plane, making it highly complementary to halo abundance\nor cosmic shear studies. We explore how weak lensing measurements of the infall\nregion might be used to complement abundance studies, considering three\ndifferent tests. The splashback radius is a prominent feature of the infall\nregion; we show that detection of this feature in lensing data from the Euclid\nsurvey could independently constrain $\\Omega_{\\rm m}$ and $\\sigma_8$ to $\\pm\n0.05$. Another feature, the depletion radius where the bias reaches a minimum,\nalso shows cosmological dependence, though it is challenging to observe in\npractice. The strongest constraints come from direct measurements of the shear\nprofile in the infall region at $2$--$4\\,r_{200{\\rm c}}$. Combining the latter\nwith abundance constraints such as those reported from SRG$/$eROSITA should\nreduce the area of the error contours by an estimated factor of $1.2$ using a\nsample of clusters observed by the UNIONS survey, or a factor of $3$ using\nclusters observed by the Euclid Wide survey over a broader range of redshift.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5ekvdFHM33gdxw8nSL43_7cg4qDypA1mj42B4yjSkoQ","pdfSize":"2503196"}
