{"id":"2407.15917","title":"Exoplanets Across Galactic Stellar Populations with PLATO: Estimating\n  Exoplanet Yields Around FGK Stars for the Thin Disk, Thick Disk and Stellar\n  Halo","authors":"Christopher Boettner, Akshara Viswanathan, Pratika Dayal","authorsParsed":[["Boettner","Christopher",""],["Viswanathan","Akshara",""],["Dayal","Pratika",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-24","timestamp":1721671200000,"abstract":"  This study aims to assess the potential of the upcoming PLATO mission to\ninvestigate exoplanet populations around stars in diverse Galactic\nenvironments, specifically focusing on the Milky Way thin disk, thick disk, and\nstellar halo. We aim to quantify PLATOs ability to detect planets in each\nenvironment and determine how these observations could constrain planet\nformation models. Beginning from the all-sky PLATO Input Catalog, we\nkinematically classify the 2.4 million FGK stars into their respective Galactic\ncomponents. For the sub-sample of stars in the long-observation LOPS2 and LOPN1\nPLATO fields, we estimate planet occurrence rates using the New Generation\nPlanet Population Synthesis (NGPPS) dataset. Combining these estimates with a\nPLATO detection efficiency model, we predicted the expected planet yields for\neach Galactic environment during a nominal 2+2 year mission. Based on our\nanalysis, PLATO is likely to detect at least 400 exoplanets around the\nalpha-enriched thick disk stars. The majority of those planets are expected to\nbe Super-Earths and Sub-Neptunes with radii between 2 and 10 Earth radii and\norbital periods between 2 and 50 days, ideal for studying the link between the\nradius valley and stellar chemistry. For the metal-poor halo, PLATO is likely\nto detect between 1 and 80 planets with periods between 10 and 50 days,\ndepending on the potential existence of a metallicity threshold for planet\nformation. The PLATO fields contain more than 3,400 potential target stars with\n[Fe/H] < -0.6, which will help to improve our understanding of planets around\nmetal-poor stars. We identify a specific target list of 47 (kinematically\nclassified) halo stars in the high-priority, high-SNR PLATO P1 sample, offering\nprime opportunities in the search for planets in metal-poor environments.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}