{"id":"2407.15613","title":"Visual-Semantic Decomposition and Partial Alignment for Document-based\n  Zero-Shot Learning","authors":"Xiangyan Qu, Jing Yu, Keke Gai, Jiamin Zhuang, Yuanmin Tang, Gang\n  Xiong, Gaopeng Gou, Qi Wu","authorsParsed":[["Qu","Xiangyan",""],["Yu","Jing",""],["Gai","Keke",""],["Zhuang","Jiamin",""],["Tang","Yuanmin",""],["Xiong","Gang",""],["Gou","Gaopeng",""],["Wu","Qi",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 13:15:04 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 06:37:15 GMT"}],"updateDate":"2024-07-24","timestamp":1721654104000,"abstract":"  Recent work shows that documents from encyclopedias serve as helpful\nauxiliary information for zero-shot learning. Existing methods align the entire\nsemantics of a document with corresponding images to transfer knowledge.\nHowever, they disregard that semantic information is not equivalent between\nthem, resulting in a suboptimal alignment. In this work, we propose a novel\nnetwork to extract multi-view semantic concepts from documents and images and\nalign the matching rather than entire concepts. Specifically, we propose a\nsemantic decomposition module to generate multi-view semantic embeddings from\nvisual and textual sides, providing the basic concepts for partial alignment.\nTo alleviate the issue of information redundancy among embeddings, we propose\nthe local-to-semantic variance loss to capture distinct local details and\nmultiple semantic diversity loss to enforce orthogonality among embeddings.\nSubsequently, two losses are introduced to partially align visual-semantic\nembedding pairs according to their semantic relevance at the view and\nword-to-patch levels. Consequently, we consistently outperform state-of-the-art\nmethods under two document sources in three standard benchmarks for\ndocument-based zero-shot learning. Qualitatively, we show that our model learns\nthe interpretable partial association.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}