{"id":"2407.04944","title":"Flexible Antenna Arrays for Wireless Communications: Modeling and\n  Performance Evaluation","authors":"Songjie Yang, Jiancheng An, Yue Xiu, Wanting Lyu, Boyu Ning, Zhongpei\n  Zhang, Merouane Debbah, Chau Yuen","authorsParsed":[["Yang","Songjie",""],["An","Jiancheng",""],["Xiu","Yue",""],["Lyu","Wanting",""],["Ning","Boyu",""],["Zhang","Zhongpei",""],["Debbah","Merouane",""],["Yuen","Chau",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 03:24:00 GMT"}],"updateDate":"2024-07-09","timestamp":1720236240000,"abstract":"  Flexible antenna arrays (FAAs), distinguished by their rotatable, bendable,\nand foldable properties, are extensively employed in flexible radio systems to\nachieve customized radiation patterns. This paper aims to illustrate that FAAs,\ncapable of dynamically adjusting surface shapes, can enhance communication\nperformances with both omni-directional and directional antenna patterns, in\nterms of multi-path channel power and channel angle Cram\\'{e}r-Rao bounds. To\nthis end, we develop a mathematical model that elucidates the impacts of the\nvariations in antenna positions and orientations as the array transitions from\na flat to a rotated, bent, and folded state, all contingent on the flexible\ndegree-of-freedom. Moreover, since the array shape adjustment operates across\nthe entire beamspace, especially with directional patterns, we discuss the\nsum-rate in the multi-sector base station that covers the $360^\\circ$\ncommunication area. Particularly, to thoroughly explore the multi-sector\nsum-rate, we propose separate flexible precoding (SFP), joint flexible\nprecoding (JFP), and semi-joint flexible precoding (SJFP), respectively. In our\nnumerical analysis comparing the optimized FAA to the fixed uniform planar\narray, we find that the bendable FAA achieves a remarkable $156\\%$ sum-rate\nimprovement compared to the fixed planar array in the case of JFP with the\ndirectional pattern. Furthermore, the rotatable FAA exhibits notably superior\nperformance in SFP and SJFP cases with omni-directional patterns, with\nrespective $35\\%$ and $281\\%$.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}