{"id":"2407.02630","title":"Antiferromagnetic topological insulators in heavy-fermion systems","authors":"Mohsen Hafez-Torbati","authorsParsed":[["Hafez-Torbati","Mohsen",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 19:50:32 GMT"}],"updateDate":"2024-07-04","timestamp":1719949832000,"abstract":"  The cooperation of electronic correlation and spin-orbit coupling can\nstabilize magnetic topological insulators which host novel quantum phenomena\nsuch as the quantum anomalous Hall state also known as Chern insulator (CI).\nHere, we investigate the existence of magnetic topological insulators with\nantiferromagnetic (AF) order in heavy-fermion materials. Our analysis relies on\nthe half-filled Kane-Mele-Kondo (KMK) model with the AF Kondo interaction\n$J_{\\rm K}$ coupling the spin of itinerant electrons with a $S=1/2$ localized\nspin at each lattice site. We consider the N\\'eel AF ordering with the local\nmagnetization not only perpendicular ($z$-AF ordering) but also parallel\n($xy$-AF ordering) to the honeycomb plane. We show that in the absence of an\nenergy offset between the two sublattices of the honeycomb structure the system\nis always topologically trivial. There is a transition from the trivial $xy$-AF\ninsulator ($xy$-AFI) to the trivial Kondo insulator (KI) upon increasing\n$J_{\\rm K}$. We unveil that an alternating sublattice potential can lead to the\nstabilization of the $z$-AFCI and the $z$-AF quantum spin Hall insulator\n($z$-AFQSHI). We address the charge excitations in the bulk as well as at the\nedges of the KMK model. We provide a systematic comparison between the size of\nthe charge gap in the AFCI in heavy-fermion materials and the size of the\ncharge gap in the AFCI in transition-metal compounds. Our findings can guide\nthe future experimental studies searching for AF topological insulators in\nnovel class of systems which can survive up to higher temperatures.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gOYSk9X-u9CaZfHzfshOawqzoassR6d6GprsArReHwU","pdfSize":"531555"}
