{"id":"2407.07400","title":"Invisible sweat sensor: ultrathin membrane mimics skin for stress\n  monitoring","authors":"Yuchen Feng, Andreas Kenny Oktavius, Reno Adley Prawoto, Hing Ni Ko,\n  Qiao Gu, Ping Gao","authorsParsed":[["Feng","Yuchen",""],["Oktavius","Andreas Kenny",""],["Prawoto","Reno Adley",""],["Ko","Hing Ni",""],["Gu","Qiao",""],["Gao","Ping",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 06:49:59 GMT"}],"updateDate":"2024-07-11","timestamp":1720594199000,"abstract":"  Epidermal skin sensors have emerged as a promising approach for continuous\nand noninvasive monitoring of vital health signals, but to maximize their\nperformance, these sensors must integrate seamlessly with the skin, minimizing\nimpedance while maintaining the skin's natural protective and regulatory\nfunctions.In this study, we introduce an imperceptible sweat sensor that\nachieves this seamless skin integration through interpenetrating networks\nformed by a porous, ultra-thin, ultra-high molecular weight polyethylene\n(UHMWPE) nanomembrane. Upon attachment to the skin by van der Waals force, the\namphiphilic sweat extrudates infuse into the interconnected nanopores inside\nthe hydrophobic UHWMPE nanomembrane, forming \"pseudo skin\" nanochannels for\ncontinuous sweat perspiration. This integration is further enhanced by the\nosmotic pressure generated during water evaporation. Leveraging the efficient\ntransport of biomarkers through the \"skin\" channels within the porous membrane,\nwe developed an organic electrochemical transducer (OECT) cortisol sensor via\nin-situ synthesis of a molecularly imprinted polymer (MIP) and poly(3,4\nethylenedioxythiophene) (PEDOT) within the nanomembrane. This demonstrates the\ncapability to detect cortisol concentrations from 0.05 to 0.5 {\\mu}M for\nseamless monitoring of stress levels. This work represents a significant\nadvancement in self-adhesive sweat sensors that offer imperceptible and\nreal-time non-invasive health monitoring capabilities.\n","subjects":["Condensed Matter/Materials Science","Computing Research Repository/Human-Computer Interaction","Physics/Biological Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}