{"id":"2407.10501","title":"Crosslinking degree variations enable programming and controlling soft\n  fracture via sideways cracking","authors":"Miguel Angel Moreno-Mateos, Paul Steinmann","authorsParsed":[["Moreno-Mateos","Miguel Angel",""],["Steinmann","Paul",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 07:44:22 GMT"}],"updateDate":"2024-07-16","timestamp":1721029462000,"abstract":"  Large deformations of soft materials are customarily associated with strong\nconstitutive and geometrical nonlinearities that originate new modes of\nfracture. Some isotropic materials can develop strong fracture anisotropy,\nwhich manifests as modifications of the crack path. Sideways cracking occurs\nwhen the crack deviates to propagate in the loading direction, rather than\nperpendicular to it. This fracture mode results from higher resistance to\npropagation perpendicular to the principal stretch direction. It has been\ndemonstrated that such fracture anisotropy is related to the microstructural\nstretch of the polymer chains, also known as strain crystallization mechanisms.\nHowever, the precise variation of the fracture behavior with the degree of\ncrosslinking is not fully understood. Leveraging experiments and computational\nsimulations, here we show that the tendency of a crack to propagate sideways in\nthe two component Elastosil P7670 increases with the degree of crosslinking. We\nexplore the mixing ratio for the synthesis of the elastomer that establishes\nthe transition from forward to sideways fracturing. To assist the\ninvestigations, we construct a novel phase-field model for fracture where the\ncritical energy release rate is directly related to the crosslinking degree.\nOur results demonstrate that fracture anisotropy can be programmed during the\nsynthesis of the polymer. Then, we propose a roadmap with composite soft\nstructures with low- and high-crosslinked phases that allow for control over\nfracture, arresting and/or directing the fracture. By extending our\ncomputational framework as a virtual testbed, we capture the fracture\nperformance of the composite samples and enable predictions based on more\nintricate composite unit cells. Overall, our work offers promising avenues for\nenhancing the fracture toughness of soft polymers.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"KgzZI8hOnZtGDFvxE2fhfl-FoPS8c4qcAcRcTv5_Bcs","pdfSize":"32245300"}
