{"id":"2407.09223","title":"Codification of Good Seamanship in Complex and Congested Waterways","authors":"Yaqub Aris Prabowo, Peter Nicholas Hansen, Dimitrios Papageorgiou,\n  Roberto Galeazzi","authorsParsed":[["Prabowo","Yaqub Aris",""],["Hansen","Peter Nicholas",""],["Papageorgiou","Dimitrios",""],["Galeazzi","Roberto",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 12:44:26 GMT"}],"updateDate":"2024-07-15","timestamp":1720788266000,"abstract":"  This paper presents a novel method to quantify seafarers' good seamanship\nduring navigation scenarios with multi-vessel encounters -- in open and\nconfined waters --, and to compute COLREG's-compliant trajectories for avoiding\ncollision and grounding. The quantification of good seamanship requires\nknowledge about the state of the vessels (position, heading, and speed) and the\nsurrounding sailing environment. Such information is accessible through the AIS\nsystem and the electronic nautical chart. The proposed method evaluates mutual\ncollision risk by examining domain violations of each vessel, and comparing\nthem to the seaman's actions. This results in a comprehensive metric of good\nseamanship. As risk free actions are not always possible in the resolution of a\npotential collision and grounding, the method adopts a branch-and-bound scheme\nto identify achievable maneuvers that minimize the risk. Further, the dynamic\nnature of vessel speed in congested scenarios is considered, recognizing\npotential changes in both own and target vessels' forward speeds. The proposed\nmethod is experimentally evaluated using historical AIS data and sea charts of\nDanish waters. This research contributes to the field by providing a more\nrealistic perspective on seamanship in complex maritime environments.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"3uHvTJBlK8fLcfV70M0qaAMQymAlzpwV5VkZf8fsOt4","pdfSize":"1705261"}
