{"id":"2407.01990","title":"Hybrid Rotational Cavity Optomechanics Using Atomic Superfluid in a Ring","authors":"Sanket Das, Pardeep Kumar, M. Bhattacharya, and Tarak N. Dey","authorsParsed":[["Das","Sanket",""],["Kumar","Pardeep",""],["Bhattacharya","M.",""],["Dey","Tarak N.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 07:06:06 GMT"}],"updateDate":"2024-07-03","timestamp":1719903966000,"abstract":"  We introduce a hybrid optomechanical system containing an annularly trapped\nBose-Einstein condensate (BEC) inside an optical cavity driven by\nLauguerre-Gaussian (LG) modes. Spiral phase elements serve as the end mirrors\nof the cavity such that the rear mirror oscillates torsionally about the cavity\naxis through a clamped support. As described earlier in a related system [P.\nKumar et. al., Phys. Rev. Lett. 127, 113601 (2021)], the condensate atoms\ninteract with the optical cavity modes carrying orbital angular momentum which\ncreate two atomic side modes. We observe three peaks in the output noise\nspectrum corresponding to the atomic side modes and rotating mirror\nfrequencies, respectively. We find that the trapped BEC's rotation reduces\nquantum fluctuations at the mirror's resonance frequency. We also find that the\natomic side modes-cavity coupling and the optorotational coupling can produce\nbipartite and tripartite entanglements between various constituents of our\nhybrid system. We reduce the frequency difference between the side modes and\nthe mirror by tuning the drive field's topological charge and the condensate\natoms' rotation. When the atomic side modes become degenerate with the mirror,\nthe stationary entanglement between the cavity and the mirror mode diminishes\ndue to the suppression of cooling. Our proposal, which combines atomic\nsuperfluid circulation with mechanical rotation, provides a versatile platform\nfor reducing quantum fluctuations and producing macroscopic entanglement with\nexperimentally realizable parameters.\n","subjects":["Physics/Quantum Physics","Physics/Atomic Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WSpCaNeA7WKLm3kTG1brvwHQa1RTQXkUe7BlZs53L2c","pdfSize":"1222823"}
