{"id":"2407.16957","title":"Raindrop Clarity: A Dual-Focused Dataset for Day and Night Raindrop\n  Removal","authors":"Yeying Jin, Xin Li, Jiadong Wang, Yan Zhang, Malu Zhang","authorsParsed":[["Jin","Yeying",""],["Li","Xin",""],["Wang","Jiadong",""],["Zhang","Yan",""],["Zhang","Malu",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 02:48:30 GMT"}],"updateDate":"2024-07-25","timestamp":1721789310000,"abstract":"  Existing raindrop removal datasets have two shortcomings. First, they consist\nof images captured by cameras with a focus on the background, leading to the\npresence of blurry raindrops. To our knowledge, none of these datasets include\nimages where the focus is specifically on raindrops, which results in a blurry\nbackground. Second, these datasets predominantly consist of daytime images,\nthereby lacking nighttime raindrop scenarios. Consequently, algorithms trained\non these datasets may struggle to perform effectively in raindrop-focused or\nnighttime scenarios. The absence of datasets specifically designed for\nraindrop-focused and nighttime raindrops constrains research in this area. In\nthis paper, we introduce a large-scale, real-world raindrop removal dataset\ncalled Raindrop Clarity. Raindrop Clarity comprises 15,186 high-quality\npairs/triplets (raindrops, blur, and background) of images with raindrops and\nthe corresponding clear background images. There are 5,442 daytime raindrop\nimages and 9,744 nighttime raindrop images. Specifically, the 5,442 daytime\nimages include 3,606 raindrop- and 1,836 background-focused images. While the\n9,744 nighttime images contain 4,838 raindrop- and 4,906 background-focused\nimages. Our dataset will enable the community to explore background-focused and\nraindrop-focused images, including challenges unique to daytime and nighttime\nconditions. Our data and code are available at:\n\\url{https://github.com/jinyeying/RaindropClarity}\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}