{"id":"2407.02447","title":"PLeaS -- Merging Models with Permutations and Least Squares","authors":"Anshul Nasery, Jonathan Hayase, Pang Wei Koh, Sewoong Oh","authorsParsed":[["Nasery","Anshul",""],["Hayase","Jonathan",""],["Koh","Pang Wei",""],["Oh","Sewoong",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 17:24:04 GMT"}],"updateDate":"2024-07-03","timestamp":1719941044000,"abstract":"  The democratization of machine learning systems has made the process of\nfine-tuning accessible to a large number of practitioners, leading to a wide\nrange of open-source models fine-tuned on specialized tasks and datasets.\nRecent work has proposed to merge such models to combine their functionalities.\nHowever, prior approaches are restricted to models that are fine-tuned from the\nsame base model. Furthermore, the final merged model is typically restricted to\nbe of the same size as the original models. In this work, we propose a new\ntwo-step algorithm to merge models-termed PLeaS-which relaxes these\nconstraints. First, leveraging the Permutation symmetries inherent in the two\nmodels, PLeaS partially matches nodes in each layer by maximizing alignment.\nNext, PLeaS computes the weights of the merged model as a layer-wise Least\nSquares solution to minimize the approximation error between the features of\nthe merged model and the permuted features of the original models. into a\nsingle model of a desired size, even when the two original models are\nfine-tuned from different base models. We also present a variant of our method\nwhich can merge models without using data from the fine-tuning domains. We\ndemonstrate our method to merge ResNet models trained with shared and different\nlabel spaces, and show that we can perform better than the state-of-the-art\nmerging methods by 8 to 15 percentage points for the same target compute while\nmerging models trained on DomainNet and on fine-grained classification tasks.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ks9W1NdgQNV5EEcap-9qm0XmEGjyLnD3dFB7_hSVL1k","pdfSize":"7131468"}
