{"id":"2407.06027","title":"PAS: Data-Efficient Plug-and-Play Prompt Augmentation System","authors":"Miao Zheng, Hao Liang, Fan Yang, Haoze Sun, Tianpeng Li, Lingchu\n  Xiong, Yan Zhang, Youzhen Wu, Kun Li, Yanjun Shen, Mingan Lin, Tao Zhang,\n  Guosheng Dong, Yujing Qiao, Kun Fang, Weipeng Chen, Bin Cui, Wentao Zhang,\n  Zenan Zhou","authorsParsed":[["Zheng","Miao",""],["Liang","Hao",""],["Yang","Fan",""],["Sun","Haoze",""],["Li","Tianpeng",""],["Xiong","Lingchu",""],["Zhang","Yan",""],["Wu","Youzhen",""],["Li","Kun",""],["Shen","Yanjun",""],["Lin","Mingan",""],["Zhang","Tao",""],["Dong","Guosheng",""],["Qiao","Yujing",""],["Fang","Kun",""],["Chen","Weipeng",""],["Cui","Bin",""],["Zhang","Wentao",""],["Zhou","Zenan",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 15:25:33 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 08:30:01 GMT"},{"version":"v3","created":"Fri, 12 Jul 2024 10:04:50 GMT"},{"version":"v4","created":"Thu, 18 Jul 2024 08:46:34 GMT"},{"version":"v5","created":"Wed, 7 Aug 2024 04:17:16 GMT"}],"updateDate":"2024-08-08","timestamp":1720452333000,"abstract":"  In recent years, the rise of Large Language Models (LLMs) has spurred a\ngrowing demand for plug-and-play AI systems. Among the various AI techniques,\nprompt engineering stands out as particularly significant. However, users often\nface challenges in writing prompts due to the steep learning curve and\nsignificant time investment, and existing automatic prompt engineering (APE)\nmodels can be difficult to use. To address this issue, we propose PAS, an\nLLM-based plug-and-play APE system. PAS utilizes LLMs trained on high-quality,\nautomatically generated prompt complementary datasets, resulting in exceptional\nperformance. In comprehensive benchmarks, PAS achieves state-of-the-art (SoTA)\nresults compared to previous APE models, with an average improvement of 6.09\npoints. Moreover, PAS is highly efficient, achieving SoTA performance with only\n9000 data points. Additionally, PAS can autonomously generate prompt\naugmentation data without requiring additional human labor. Its flexibility\nalso allows it to be compatible with all existing LLMs and applicable to a wide\nrange of tasks. PAS excels in human evaluations, underscoring its suitability\nas a plug-in for users. This combination of high performance, efficiency, and\nflexibility makes PAS a valuable system for enhancing the usability and\neffectiveness of LLMs through improved prompt engineering.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}