{"id":"2407.21672","title":"Stable Sparse Operator Inference for Nonlinear Structural Dynamics","authors":"Pascal den Boef, Diana Manvelyan, Joseph Maubach, Wil Schilders,\n  Nathan van de Wouw","authorsParsed":[["Boef","Pascal den",""],["Manvelyan","Diana",""],["Maubach","Joseph",""],["Schilders","Wil",""],["van de Wouw","Nathan",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:13:57 GMT"}],"updateDate":"2024-08-01","timestamp":1722438837000,"abstract":"  Structural dynamics models with nonlinear stiffness appear, for example, when\nanalyzing systems with nonlinear material behavior or undergoing large\ndeformations. For complex systems, these models become too large for real-time\napplications or multi-query workflows. Hence, model reduction is needed.\nHowever, the mathematical operators of these models are often not available\nsince, as is common in industry practice, the models are constructed using\ncommercial simulation software. In this work, we propose an operator\ninference-based approach aimed at inferring, from data generated by the\nsimulation model, reduced-order models (ROMs) of structural dynamics systems\nwith stiffness terms represented by polynomials of arbitrary degree. To ensure\nphysically meaningful models, we impose constraints on the inference such that\nthe model is guaranteed to exhibit stability properties. Convexity of the\noptimization problem associated with the inference is maintained by applying a\nsum-of-squares relaxation to the polynomial term. To further reduce the size of\nthe ROM and improve numerical conditioning of the inference, we also propose a\nnovel clustering-based sparsification of the polynomial term. We validate the\nproposed method on several numerical examples, including a representative 3D\nFinite Element Model (FEM) of a steel piston rod.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}