{"id":"2407.01792","title":"Optimising robotic operation speed with edge computing over 5G networks:\n  Insights from selective harvesting robots","authors":"Usman A. Zahidi, Arshad Khan, Tsvetan Zhivkov, Johann Dichtl, Dom Li,\n  Soran Parsa, Marc Hanheide, Grzegorz Cielniak, Elizabeth I. Sklar, Simon\n  Pearson, Amir Ghalamzan","authorsParsed":[["Zahidi","Usman A.",""],["Khan","Arshad",""],["Zhivkov","Tsvetan",""],["Dichtl","Johann",""],["Li","Dom",""],["Parsa","Soran",""],["Hanheide","Marc",""],["Cielniak","Grzegorz",""],["Sklar","Elizabeth I.",""],["Pearson","Simon",""],["Ghalamzan","Amir",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 20:37:51 GMT"}],"updateDate":"2024-07-03","timestamp":1719866271000,"abstract":"  Selective harvesting by autonomous robots will be a critical enabling\ntechnology for future farming. Increases in inflation and shortages of skilled\nlabour are driving factors that can help encourage user acceptability of\nrobotic harvesting. For example, robotic strawberry harvesting requires\nreal-time high-precision fruit localisation, 3D mapping and path planning for\n3-D cluster manipulation. Whilst industry and academia have developed multiple\nstrawberry harvesting robots, none have yet achieved human-cost parity.\nAchieving this goal requires increased picking speed (perception, control and\nmovement), accuracy and the development of low-cost robotic system designs. We\npropose the edge-server over 5G for Selective Harvesting (E5SH) system, which\nis an integration of high bandwidth and low latency Fifth Generation (5G)\nmobile network into a crop harvesting robotic platform, which we view as an\nenabler for future robotic harvesting systems. We also consider processing\nscale and speed in conjunction with system environmental and energy costs. A\nsystem architecture is presented and evaluated with support from quantitative\nresults from a series of experiments that compare the performance of the system\nin response to different architecture choices, including image segmentation\nmodels, network infrastructure (5G vs WiFi) and messaging protocols such as\nMessage Queuing Telemetry Transport (MQTT) and Transport Control Protocol Robot\nOperating System (TCPROS). Our results demonstrate that the E5SH system\ndelivers step-change peak processing performance speedup of above 18-fold than\na stand-alone embedded computing Nvidia Jetson Xavier NX (NJXN) system.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zy1FrK5MIAy_ohTX77lcujmOlqU7obalniii0xCGJew","pdfSize":"14837829"}
