{"id":"2407.00517","title":"Local and Global Reciprocity in Orbital-Charge-Coupled Transport","authors":"Dongwook Go, Tom S. Seifert, Tobias Kampfrath, Kazuya Ando, Hyun-Woo\n  Lee, Yuriy Mokrousov","authorsParsed":[["Go","Dongwook",""],["Seifert","Tom S.",""],["Kampfrath","Tobias",""],["Ando","Kazuya",""],["Lee","Hyun-Woo",""],["Mokrousov","Yuriy",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 19:25:17 GMT"}],"updateDate":"2024-07-02","timestamp":1719689117000,"abstract":"  The coupled transport of the charge and orbital angular momentum of electrons\nis at the heart of orbitronics. Here, we discuss the reciprocal relation\nbetween the direct and inverse orbital Hall effects (OHEs) in thin films. We\nargue that the conventional orbital current is ill-defined as it does not\nsatisfy the reciprocal relation owing to non-conservation of the orbital\nangular momentum. We resolve the problem by adopting the definition of the\nso-called \\emph{proper} orbital current, which is directly related to orbital\naccumulation. We prove the reciprocal relation between the \\emph{global}\nresponse of orbital and charge currents. However, we show that their\n\\emph{local} distributions are generally different, especially due to gigantic\ncontributions at surfaces, which may lead to unintuitive results when charge\nand orbital currents are locally measured. We demonstrate our predictions by\nfirst-principles calculations on W(110) and Pt(111) thin films. In W(110), the\ndirect and inverse OHEs are severely non-reciprocal locally in each layer\nalthough the total responses are exactly reciprocal. Interestingly, the SHEs\nare almost reciprocal locally in each layer. On the other hand, in Pt(111),\nboth OHEs and SHEs are locally non-reciprocal, which we attribute to the\npronounced spin-orbit interaction. We propose that the locally distinct\nresponses may be used to distinguish the spin and orbital currents in\nexperiments.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}