{"id":"2407.18135","title":"Testing Cluster Membership of Planetary Nebulae with High-Precision\n  Proper Motions. I. HST Observations of JaFu 1 Near the Globular Cluster\n  Palomar 6","authors":"Howard E. Bond (1,2), Andrea Bellini (2), Kailash C. Sahu (2,3) ((1)\n  Penn State, (2) Space Telescope Science Institute, (3) Eureka Scientific)","authorsParsed":[["Bond","Howard E.",""],["Bellini","Andrea",""],["Sahu","Kailash C.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 15:40:46 GMT"}],"updateDate":"2024-07-26","timestamp":1721922046000,"abstract":"  If a planetary nebula (PN) is shown to be a member of a star cluster, we\nobtain important new constraints on the mass and chemical composition of the\nPN's progenitor star, which cannot be determined for PNe in the field. Cluster\nmembership can be tested by requiring the projected separation between the PN\nand cluster to be within the tidal radius of the cluster, and the objects to\nhave nearly identical radial velocities (RVs) and interstellar extinctions, and\nnearly identical proper motions (PMs). In an earlier study, we used PMs to\nconfirm that three PNe, which had already passed the other tests, are highly\nlikely to be members of Galactic globular clusters (GCs). For a fourth object,\nthe PN JaFu 1, which lies in the Galactic bulge near the GC Palomar 6 on the\nsky and has a similar RV, the available PM measurement gave equivocal results.\nWe have now obtained new high-resolution images of the central star of JaFu 1\nwith the Hubble Space Telescope (HST) which, combined with archival HST frames\ntaken 14 and 16 years earlier, provide a high-precision PM. Unfortunately, we\nfind that the PM of the central star differs from that of the cluster with high\nstatistical significance, and thus is unlikely to be a member of Palomar 6.\nNevertheless, JaFu 1 is of astrophysical interest because its nucleus appears\nto be a member of the rare class of \"EGB 6-type\" central stars, which are\nassociated with compact emission-line knots.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}