{"id":"2407.12387","title":"HGL: Hierarchical Geometry Learning for Test-time Adaptation in 3D Point\n  Cloud Segmentation","authors":"Tianpei Zou and Sanqing Qu and Zhijun Li and Alois Knoll and Lianghua\n  He and Guang Chen and Changjun Jiang","authorsParsed":[["Zou","Tianpei",""],["Qu","Sanqing",""],["Li","Zhijun",""],["Knoll","Alois",""],["He","Lianghua",""],["Chen","Guang",""],["Jiang","Changjun",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 08:08:03 GMT"}],"updateDate":"2024-07-18","timestamp":1721203683000,"abstract":"  3D point cloud segmentation has received significant interest for its growing\napplications. However, the generalization ability of models suffers in dynamic\nscenarios due to the distribution shift between test and training data. To\npromote robustness and adaptability across diverse scenarios, test-time\nadaptation (TTA) has recently been introduced. Nevertheless, most existing TTA\nmethods are developed for images, and limited approaches applicable to point\nclouds ignore the inherent hierarchical geometric structures in point cloud\nstreams, i.e., local (point-level), global (object-level), and temporal\n(frame-level) structures. In this paper, we delve into TTA in 3D point cloud\nsegmentation and propose a novel Hierarchical Geometry Learning (HGL)\nframework. HGL comprises three complementary modules from local, global to\ntemporal learning in a bottom-up manner.Technically, we first construct a local\ngeometry learning module for pseudo-label generation. Next, we build prototypes\nfrom the global geometry perspective for pseudo-label fine-tuning. Furthermore,\nwe introduce a temporal consistency regularization module to mitigate negative\ntransfer. Extensive experiments on four datasets demonstrate the effectiveness\nand superiority of our HGL. Remarkably, on the SynLiDAR to SemanticKITTI task,\nHGL achieves an overall mIoU of 46.91\\%, improving GIPSO by 3.0\\% and\nsignificantly reducing the required adaptation time by 80\\%. The code is\navailable at https://github.com/tpzou/HGL.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}