{"id":"2407.02695","title":"Topics in Weyl Geometry and Quantum Anomalies","authors":"Weizhen Jia","authorsParsed":[["Jia","Weizhen",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 22:25:17 GMT"}],"updateDate":"2024-07-04","timestamp":1719959117000,"abstract":"  The first part of this thesis focuses on the Weyl-covariant nature of\nholography. We generalize the Fefferman-Graham (FG) ambient construction for\nconformal geometry to a corresponding construction for Weyl geometry. Through\nthe Weyl-ambient construction, we investigate Weyl-covariant quantities on the\nWeyl manifold and define Weyl-obstruction tensors. We show that\nWeyl-obstruction tensors appear as poles in the Fefferman-Graham expansion of\nthe ALAdS bulk metric for even boundary dimensions. Under holographic\nrenormalization in the Weyl-Fefferman-Graham gauge, we compute the Weyl anomaly\nof the boundary theory in multiple dimensions and demonstrate that\nWeyl-obstruction tensors can be used as the building blocks for the Weyl\nanomaly of the dual quantum field theory (QFT). The holographic calculation\nwith a background Weyl geometry also suggests an underlying geometric\ninterpretation of the Weyl anomaly.\n  The second part of this thesis is devoted to understanding the geometric\nnature of the BRST formalism and quantum anomalies. Using the language of Lie\nalgebroids, the BRST complex can be encoded in the exterior algebra of an\nAtiyah Lie algebroid derived from the principal bundle of the gauge theory. We\nshowed that the cohomology of an Atiyah Lie algebroid in a trivialization gives\nrise to the BRST cohomology. We then apply the Lie algebroid cohomology in\nstudying quantum anomalies and demonstrate the computation for chiral and\nLorentz-Weyl anomalies. In particular, we pay close attention to the fact that\nthe geometric intuition afforded by the Lie algebroid (which was absent in the\ntraditional BRST complex) provides hints of a deeper picture that\nsimultaneously geometrizes the consistent and covariant forms of the anomaly.\nIn the algebroid construction, the difference between the consistent and\ncovariant anomalies is simply a different choice of basis.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology","Physics/Mathematical Physics","Mathematics/Differential Geometry","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}