{"id":"2407.03082","title":"Stable Heterogeneous Treatment Effect Estimation across\n  Out-of-Distribution Populations","authors":"Yuling Zhang, Anpeng Wu, Kun Kuang, Liang Du, Zixun Sun, Zhi Wang","authorsParsed":[["Zhang","Yuling",""],["Wu","Anpeng",""],["Kuang","Kun",""],["Du","Liang",""],["Sun","Zixun",""],["Wang","Zhi",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 13:03:51 GMT"}],"updateDate":"2024-07-04","timestamp":1720011831000,"abstract":"  Heterogeneous treatment effect (HTE) estimation is vital for understanding\nthe change of treatment effect across individuals or subgroups. Most existing\nHTE estimation methods focus on addressing selection bias induced by imbalanced\ndistributions of confounders between treated and control units, but ignore\ndistribution shifts across populations. Thereby, their applicability has been\nlimited to the in-distribution (ID) population, which shares a similar\ndistribution with the training dataset. In real-world applications, where\npopulation distributions are subject to continuous changes, there is an urgent\nneed for stable HTE estimation across out-of-distribution (OOD) populations,\nwhich, however, remains an open problem. As pioneers in resolving this problem,\nwe propose a novel Stable Balanced Representation Learning with\nHierarchical-Attention Paradigm (SBRL-HAP) framework, which consists of 1)\nBalancing Regularizer for eliminating selection bias, 2) Independence\nRegularizer for addressing the distribution shift issue, 3)\nHierarchical-Attention Paradigm for coordination between balance and\nindependence. In this way, SBRL-HAP regresses counterfactual outcomes using ID\ndata, while ensuring the resulting HTE estimation can be successfully\ngeneralized to out-of-distribution scenarios, thereby enhancing the model's\napplicability in real-world settings. Extensive experiments conducted on\nsynthetic and real-world datasets demonstrate the effectiveness of our SBRL-HAP\nin achieving stable HTE estimation across OOD populations, with an average 10%\nreduction in the error metric PEHE and 11% decrease in the ATE bias, compared\nto the SOTA methods.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}