{"id":"2407.20080","title":"UniTTA: Unified Benchmark and Versatile Framework Towards Realistic\n  Test-Time Adaptation","authors":"Chaoqun Du, Yulin Wang, Jiayi Guo, Yizeng Han, Jie Zhou and Gao Huang","authorsParsed":[["Du","Chaoqun",""],["Wang","Yulin",""],["Guo","Jiayi",""],["Han","Yizeng",""],["Zhou","Jie",""],["Huang","Gao",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:04:53 GMT"}],"updateDate":"2024-07-30","timestamp":1722265493000,"abstract":"  Test-Time Adaptation (TTA) aims to adapt pre-trained models to the target\ndomain during testing. In reality, this adaptability can be influenced by\nmultiple factors. Researchers have identified various challenging scenarios and\ndeveloped diverse methods to address these challenges, such as dealing with\ncontinual domain shifts, mixed domains, and temporally correlated or imbalanced\nclass distributions. Despite these efforts, a unified and comprehensive\nbenchmark has yet to be established. To this end, we propose a Unified\nTest-Time Adaptation (UniTTA) benchmark, which is comprehensive and widely\napplicable. Each scenario within the benchmark is fully described by a Markov\nstate transition matrix for sampling from the original dataset. The UniTTA\nbenchmark considers both domain and class as two independent dimensions of data\nand addresses various combinations of imbalance/balance and\ni.i.d./non-i.i.d./continual conditions, covering a total of \\( (2 \\times 3)^2 =\n36 \\) scenarios. It establishes a comprehensive evaluation benchmark for\nrealistic TTA and provides a guideline for practitioners to select the most\nsuitable TTA method. Alongside this benchmark, we propose a versatile UniTTA\nframework, which includes a Balanced Domain Normalization (BDN) layer and a\nCOrrelated Feature Adaptation (COFA) method--designed to mitigate distribution\ngaps in domain and class, respectively. Extensive experiments demonstrate that\nour UniTTA framework excels within the UniTTA benchmark and achieves\nstate-of-the-art performance on average. Our code is available at\n\\url{https://github.com/LeapLabTHU/UniTTA}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}