{"id":"2407.13502","title":"Spectra of Poisson functionals and applications in continuum percolation","authors":"Chinmoy Bhattacharjee, Giovanni Peccati, D. Yogeshwaran","authorsParsed":[["Bhattacharjee","Chinmoy",""],["Peccati","Giovanni",""],["Yogeshwaran","D.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 13:33:57 GMT"}],"updateDate":"2024-07-19","timestamp":1721309637000,"abstract":"  Let $\\eta$ be a Poisson random measure (defined on some Polish space), and\nlet $F(\\eta)$ be a square-integrable functional of $\\eta$. In this paper we\ndefine and study a new notion of {\\it spectral point process} associated with\n$F(\\eta)$, and use such an object to study sharp noise instability and\nsensitivity properties of planar critical continuum percolation models under\nspatial birth-death (Ornstein-Uhlenbeck) dynamics -- the notion of sharp noise\ninstability being a natural strengthening of the absence of noise stability.\nThe concept of spectral point process is defined by exploiting the Wiener-It\\^o\nchaos expansion of $F$, and represents a natural continuum counterpart to the\nnotion of {\\it spectral sample}, as introduced in Garban, Pete and Schramm\n(2010), in the context of discrete percolation models. In the particular case\nwhere $\\eta$ is a marked Poisson measure, we use Hoeffding-ANOVA decompositions\nto establish an explicit connection with the notion of {\\it annealed spectral\nsample}, introduced in Vanneuville (2021) in the context of Poisson-Voronoi\npercolation. We also relate spectral processes with an appropriate notion of\n{\\it pivotal processes}. As applications, we show sharp noise instability of\ncrossing events in the critical Poisson Boolean model with unit-radius balls\nand, using an observation of Vanneuville, we obtain sharp noise sensitivity (as\nwell as sharp noise instability) for crossing events in the Poisson Voronoi\npercolation model. As an important ingredient, we prove quasi-multiplicativity\nof the $4$-arm probabilities in the critical Poisson Boolean percolation model.\n","subjects":["Mathematics/Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}