{"id":"2407.11752","title":"IID Prophet Inequality with Random Horizon: Going Beyond Increasing\n  Hazard Rates","authors":"Giordano Giambartolomei, Frederik Mallmann-Trenn, Raimundo Saona","authorsParsed":[["Giambartolomei","Giordano",""],["Mallmann-Trenn","Frederik",""],["Saona","Raimundo",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:17:08 GMT"}],"updateDate":"2024-07-17","timestamp":1721139428000,"abstract":"  Prophet inequalities are a central object of study in optimal stopping\ntheory. In the iid model, a gambler sees values in an online fashion, sampled\nindependently from a given distribution. Upon observing each value, the gambler\neither accepts it as a reward or irrevocably rejects it and proceeds to observe\nthe next value. The goal of the gambler, who cannot see the future, is\nmaximising the expected value of the reward while competing against the\nexpectation of a prophet (the offline maximum). In other words, one seeks to\nmaximise the gambler-to-prophet ratio of the expectations.\n  This model has been studied with infinite, finite and unknown number of\nvalues. When the gambler faces a random number of values, the model is said to\nhave random horizon. We consider the model in which the gambler is given a\npriori knowledge of the horizon's distribution. Alijani et al. (2020) designed\na single-threshold algorithms achieving a ratio of $1/2$ when the random\nhorizon has an increasing hazard rate and is independent of the values. We\nprove that with a single-threshold, a ratio of $1/2$ is actually achievable for\nseveral larger classes of horizon distributions, with the largest being known\nas the $\\mathcal{G}$ class in reliability theory. Moreover, we extend this\nresult to its dual, the $\\overline{\\mathcal{G}}$ class (which includes the\ndecreasing hazard rate class), and to low-variance horizons. Finally, we\nconstruct the first example of a family of horizons, for which multiple\nthresholds are necessary to achieve a nonzero ratio. We establish that the\nSecretary Problem optimal stopping rule provides one such algorithm, paving the\nway towards the study of the model beyond single-threshold algorithms.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Discrete Mathematics","Mathematics/Optimization and Control","Mathematics/Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}