{"id":"2407.03419","title":"Analog Quantum Simulator of a Quantum Field Theory with Fermion-Spin\n  Systems in Silicon","authors":"Ali Rad, Alexander Schuckert, Eleanor Crane, Gautam Nambiar, Fan Fei,\n  Jonathan Wyrick, Richard M. Silver, Mohammad Hafezi, Zohreh Davoudi, Michael\n  J. Gullans","authorsParsed":[["Rad","Ali",""],["Schuckert","Alexander",""],["Crane","Eleanor",""],["Nambiar","Gautam",""],["Fei","Fan",""],["Wyrick","Jonathan",""],["Silver","Richard M.",""],["Hafezi","Mohammad",""],["Davoudi","Zohreh",""],["Gullans","Michael J.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:00:52 GMT"}],"updateDate":"2024-07-08","timestamp":1720029652000,"abstract":"  Simulating fermions coupled to spin degrees of freedom, relevant for a range\nof quantum field theories, represents a promising application for quantum\nsimulators. Mapping fermions to qubits is challenging in $2+1$ and higher\nspacetime dimensions, and mapping bosons demands substantial\nquantum-computational overhead. These features complicate the realization of\nmixed fermion-boson quantum systems in digital quantum computers. We propose a\nnative fermion-(large-)spin analog quantum simulator by utilizing dopant arrays\nin silicon. Specifically, we show how to use a dynamical lattice of coupled\nnuclear spins and conduction-band electrons to realize a quantum field theory:\nan extended Jackiw-Rebbi model involving coupled fermions and quantum rotors.\nWe demonstrate the feasibility of observing dynamical mass generation and a\nconfinement-deconfinement quantum phase transition in 1+1 dimensions on this\nplatform, even in the presence of strong long-range Coulomb interactions.\nFurthermore, we employ finite-temperature Hartree-Fock-Bogoliubov simulations\nto investigate the dynamics of mass generation in two-dimensional square and\nhoneycomb arrays, showing that this phenomenon can be simulated with realistic\nexperimental parameters. Our findings reveal two distinct phases, and\ndemonstrate robustness against the addition of Coulomb interactions. Finally,\nwe discuss experimental signatures of the phases through transport and local\ncharge sensing in dopant arrays. This study lays the foundation for quantum\nsimulations of quantum field theories exhibiting fermions coupled to spin\ndegrees of freedom using donors in silicon.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/High Energy Physics - Lattice","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}