{"id":"2407.15053","title":"Stacked Intelligent Metasurfaces for Task-Oriented Semantic\n  Communications","authors":"Guojun Huang, Jiancheng An, Zhaohui Yang, Lu Gan, Mehdi Bennis, and\n  M\\'erouane Debbah","authorsParsed":[["Huang","Guojun",""],["An","Jiancheng",""],["Yang","Zhaohui",""],["Gan","Lu",""],["Bennis","Mehdi",""],["Debbah","Mérouane",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 04:46:05 GMT"}],"updateDate":"2024-07-23","timestamp":1721537165000,"abstract":"  Semantic communication leveraging advanced deep learning (DL) technologies\nenhances the efficiency, reliability, and security of information transmission.\nEmerging stacked intelligent metasurface (SIM) having a diffractive neural\nnetwork (DNN) architecture allows performing complex calculations at the speed\nof light. In this letter, we introduce an innovative SIM-aided semantic\ncommunication system for image recognition tasks. In the considered model, a\nSIM is positioned in front of the transmitting antenna. In contrast to\nconventional communication systems transmitting the modulated signals carrying\nthe image information or compressed semantic information, the carrier\nelectromagnetic (EM) wave is directly transmitted from the source in the\nproposed system. The input layer of the SIM is utilized for source encoding,\nwhile the remaining multi-layer architecture constitutes a DNN for semantic\nencoding. Specifically, the semantic encoder aims to transform the signals\npassing through the input layer of the SIM into a unique beam towards a\nreceiving antenna corresponding to the image class. Remarkably, both the source\nand semantic encoding occur naturally as the EM waves propagate through the\nSIM. At the receiver, the image is recognized by probing the received signal\nmagnitude across the receiving array. To this end, we develop an efficient\nalgorithm to train the transmission coefficients of SIM's meta-atoms to learn\nthe semantic representation of the image. Extensive numerical results verify\nthe effectiveness of utilizing the SIM-based DNN for image recognition\ntask-oriented semantic communications, achieving more than 90% recognition\naccuracy.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}