{"id":"2407.06345","title":"Multi-person eye tracking for real-world scene perception in social\n  settings","authors":"Shreshth Saxena, Areez Visram, Neil Lobo, Zahid Mirza, Mehak Rafi\n  Khan, Biranugan Pirabaharan, Alexander Nguyen, and Lauren K. Fink","authorsParsed":[["Saxena","Shreshth",""],["Visram","Areez",""],["Lobo","Neil",""],["Mirza","Zahid",""],["Khan","Mehak Rafi",""],["Pirabaharan","Biranugan",""],["Nguyen","Alexander",""],["Fink","Lauren K.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 19:33:17 GMT"}],"updateDate":"2024-07-10","timestamp":1720467197000,"abstract":"  Eye movements provide a window into human behaviour, attention, and\ninteraction dynamics. Previous research suggests that eye movements are highly\ninfluenced by task, setting, and social others; however, most eye tracking\nresearch is conducted in single-person, in-lab settings and is yet to be\nvalidated in multi-person, naturalistic contexts. One such prevalent real-world\ncontext is the collective viewing of a shared scene in social settings, for\nexample, viewing a concert, film, lecture, sports, etc. Here, we apply mobile\neye tracking in a real-world multi-person setup and develop a system to stream,\nrecord, and analyse synchronised data. We tested our proposed, open-source\nsystem while participants (N=60) watched a live concert and a documentary film\nscreening during a public event. We tackled challenges related to networking\nbandwidth requirements, real-time monitoring, and gaze projection from\nindividual egocentric perspectives to a common coordinate space for shared gaze\nanalysis. Our system achieves precise time synchronisation and accurate gaze\nprojection in challenging dynamic scenes. Further, to illustrate the potential\nof collective eye-tracking data, we introduce and evaluate novel analysis\nmetrics and visualisations. Overall, our approach contributes to the\ndevelopment and application of versatile multi-person eye tracking systems in\nreal-world social settings. This advancement enables insight into collaborative\nbehaviour, group dynamics, and social interaction, with high ecological\nvalidity. Moreover, it paves the path for innovative, interactive tools that\npromote collaboration and coordination in social contexts.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Computers and Society","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}