{"id":"2407.11171","title":"End-to-end simulations of photonic phase correctors for adaptive optics\n  systems","authors":"Dhwanil Patel (1), Momen Diab (1), Ross Cheriton (2), Jacob Taylor (1\n  and 3), Libertad Rojas (1), Martin Vachon (2), Dan-Xia Xu (2), Jens H. Schmid\n  (2), Pavel Cheben (2), Siegfried Janz (2), and Suresh Sivanandam (1 and 3)\n  ((1) Dunlap Institute for Astronomy and Astrophysics, University of Toronto,\n  Toronto, Ontario, Canada, (2) Quantum and Nanotechnologies Research Centre,\n  National Research Council Canada, Ottawa, Ontario, Canada, (3) David A.\n  Dunlap Department of Astronomy and Astrophysics, University of Toronto,\n  Toronto, Ontario, Canada)","authorsParsed":[["Patel","Dhwanil","","1\n  and 3"],["Diab","Momen","","1\n  and 3"],["Cheriton","Ross","","1\n  and 3"],["Taylor","Jacob","","1\n  and 3"],["Rojas","Libertad","","1 and 3"],["Vachon","Martin","","1 and 3"],["Xu","Dan-Xia","","1 and 3"],["Schmid","Jens H.","","1 and 3"],["Cheben","Pavel","","1 and 3"],["Janz","Siegfried","","1 and 3"],["Sivanandam","Suresh","","1 and 3"]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:45:54 GMT"}],"updateDate":"2024-07-17","timestamp":1721069154000,"abstract":"  Optical beams and starlight distorted by atmospheric turbulence can be\ncorrected with adaptive optics systems to enable efficient coupling into\nsingle-mode fibers. Deformable mirrors, used to flatten the wavefront in\nastronomical telescopes, are costly, sensitive, and complex mechanical\ncomponents that require careful calibration to enable high-quality imaging in\nastronomy, microscopy, and vision science. They are also impractical to deploy\nin large numbers for non-imaging applications like free-space optical\ncommunication. Here, we propose a photonic integrated c rcuit capable of\nspatially sampling the wavefront collected by the telescope and co-phasing the\nsubapertures to maximize the flux delivered to an output single-mode fiber as\nthe integrated photonic implementation of a deformable mirror. We present the\nresults of end-to-end simulations to quantify the performance of the proposed\nphotonic solution under varying atmospheric conditions toward realizing an\nadaptive optics system without a deformable mirror for free-space optical\nreceivers.\n","subjects":["Physics/Optics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}