{"id":"2407.18679","title":"VeriCHERI: Exhaustive Formal Security Verification of CHERI at the RTL","authors":"Anna Lena Duque Ant\\'on, Johannes M\\\"uller, Philipp Schmitz, Tobias\n  Jauch, Alex Wezel, Lucas Deutschmann, Mohammad Rahmani Fadiheh, Dominik\n  Stoffel and Wolfgang Kunz","authorsParsed":[["Antón","Anna Lena Duque",""],["Müller","Johannes",""],["Schmitz","Philipp",""],["Jauch","Tobias",""],["Wezel","Alex",""],["Deutschmann","Lucas",""],["Fadiheh","Mohammad Rahmani",""],["Stoffel","Dominik",""],["Kunz","Wolfgang",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 11:48:55 GMT"}],"updateDate":"2024-07-29","timestamp":1721994535000,"abstract":"  Protecting data in memory from attackers continues to be a concern in\ncomputing systems. CHERI is a promising approach to achieve such protection, by\nproviding and enforcing fine-grained memory protection directly in the\nhardware. Creating trust for the entire system stack, however, requires a\ngap-free verification of CHERI's hardware-based protection mechanisms. Existing\nverification methods for CHERI target the abstract ISA model rather than the\nunderlying hardware implementation. Fully ensuring the CHERI security\nguarantees for a concrete RTL implementation is a challenge in previous flows\nand demands high manual efforts. This paper presents VeriCHERI, a novel\napproach to security verification. It is conceptionally different from previous\nworks in that it does not require any ISA specification. Instead of checking\ncompliance with a golden ISA model, we check against well-established global\nsecurity objectives of confidentiality and integrity. Fully covering these\nobjectives, VeriCHERI uses as few as four unbounded properties to exhaustively\nprove or disprove any vulnerability. We demonstrate the effectiveness and\nscalability of VeriCHERI on a RISC-V based processor implementing a CHERI\nvariant.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}