{"id":"2407.19241","title":"Advancements in Tuning Thermoelectric Properties: Insights from Hybrid\n  Functional Studies, Strain Engineering, and Machine Learning Models","authors":"Vipin K E and Prahallad Padhan","authorsParsed":[["E","Vipin K",""],["Padhan","Prahallad",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 12:16:12 GMT"}],"updateDate":"2024-07-30","timestamp":1722082572000,"abstract":"  Thermoelectric properties in topological insulator Bi2Se3 are explored with\nmultifaceted strategies, i.e., hybrid functional with strain and artificial\nintelligence methodology. The assessment with the experimental band gap values\nrecognises the limitations of conventional functional and the effectiveness of\nscreened hybrid functionals. A thorough investigation into the impact of\nbiaxial and uniaxial strain on thermoelectric parameters uncovers distinctive\nbehaviours in n-type and p-type Bi2Se3 , providing insights into optimal strain\nconditions for improved performance. Furthermore, the studies on the role of\ntopologically non-trivial surface states (TNSS) in thermoelectric properties\nreveal that TNSS significantly dominate electronic transport. Dual scattering\ntime approximation elucidates the segregation of thermoelectric transport\ncontributions from bulk and surface states, highlighting the importance of\ncontrolling the relaxation time ratio for enhanced thermoelectric performance.\nAdditionally, the prediction of thermoelectric properties using Random Forest\nand Neural Networks models showcase impressive agreement with density\nfunctional theory predictions across varying temperatures, offering a powerful\ntool for understanding complex temperature-dependent trends in thermoelectric\nproperties. In summary, this interdisciplinary study presents a unique approach\nto advancing the understanding and optimization of thermoelectric properties in\nBi2Se3 . It provides a comprehensive framework for tailoring material behaviour\nfor diverse thermoelectric applications.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}