{"id":"2407.18198","title":"Next Generation LLRF Control Platform for Compact C-band Linear\n  Accelerator","authors":"Chao Liu, Ryan Herbst, Larry Ruckman, Emilio Nanni","authorsParsed":[["Liu","Chao",""],["Herbst","Ryan",""],["Ruckman","Larry",""],["Nanni","Emilio",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 17:08:35 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 16:16:03 GMT"}],"updateDate":"2024-08-23","timestamp":1721927315000,"abstract":"  The Low-Level RF (LLRF) control circuits of linear accelerators (LINACs) are\nconventionally realized with heterodyne based architectures, which have analog\nRF mixers for up and down conversion with discrete data converters. We have\ndeveloped a new LLRF platform for C-band linear accelerator based on the\nFrequency System-on-Chip (RFSoC) device from AMD Xilinx. The integrated data\nconverters in the RFSoC can directly sample the RF signals in C-band and\nperform the up and down mixing digitally. The programmable logic and processors\nrequired for signal processing for the LLRF control system are also included in\na single RFSoC chip. With all the essential components integrated in a device,\nthe RFSoC-based LLRF control platform can be implemented more cost-effectively\nand compactly, which can be applied to a broad range of accelerator\napplications. In this paper, the structure and configuration of the newly\ndeveloped LLRF platform will be described. The LLRF prototype has been tested\nwith high power test setup with a Cool Cooper Collider (C\\(^3\\)) accelerating\nstructure. The LLRF and the solid state amplifier (SSA) loopback setup\ndemonstrated phase jitter in 1 s as low as 115 fs, which is lower than the\nrequirement of C\\(^3\\). The rf signals from the klystron forward and\naccelerating structure captured with peak power up to 16.45 MW will be\npresented and discussed.\n","subjects":["Physics/Accelerator Physics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}