{"id":"2407.05396","title":"Evolutionary Trigger Detection and Lightweight Model Repair Based\n  Backdoor Defense","authors":"Qi Zhou, Zipeng Ye, Yubo Tang, Wenjian Luo, Yuhui Shi, and Yan Jia","authorsParsed":[["Zhou","Qi",""],["Ye","Zipeng",""],["Tang","Yubo",""],["Luo","Wenjian",""],["Shi","Yuhui",""],["Jia","Yan",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 14:50:59 GMT"},{"version":"v2","created":"Sun, 14 Jul 2024 08:25:25 GMT"}],"updateDate":"2024-07-16","timestamp":1720363859000,"abstract":"  Deep Neural Networks (DNNs) have been widely used in many areas such as\nautonomous driving and face recognition. However, DNN model is fragile to\nbackdoor attack. A backdoor in the DNN model can be activated by a poisoned\ninput with trigger and leads to wrong prediction, which causes serious security\nissues in applications. It is challenging for current defenses to eliminate the\nbackdoor effectively with limited computing resources, especially when the\nsizes and numbers of the triggers are variable as in the physical world. We\npropose an efficient backdoor defense based on evolutionary trigger detection\nand lightweight model repair. In the first phase of our method, CAM-focus\nEvolutionary Trigger Filter (CETF) is proposed for trigger detection. CETF is\nan effective sample-preprocessing based method with the evolutionary algorithm,\nand our experimental results show that CETF not only distinguishes the images\nwith triggers accurately from the clean images, but also can be widely used in\npractice for its simplicity and stability in different backdoor attack\nsituations. In the second phase of our method, we leverage several lightweight\nunlearning methods with the trigger detected by CETF for model repair, which\nalso constructively demonstrate the underlying correlation of the backdoor with\nBatch Normalization layers. Source code will be published after accepted.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}