{"id":"2407.06833","title":"Training-free CryoET Tomogram Segmentation","authors":"Yizhou Zhao, Hengwei Bian, Michael Mu, Mostofa R. Uddin, Zhenyang Li,\n  Xiang Li, Tianyang Wang, Min Xu","authorsParsed":[["Zhao","Yizhou",""],["Bian","Hengwei",""],["Mu","Michael",""],["Uddin","Mostofa R.",""],["Li","Zhenyang",""],["Li","Xiang",""],["Wang","Tianyang",""],["Xu","Min",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 02:51:41 GMT"}],"updateDate":"2024-07-10","timestamp":1720407101000,"abstract":"  Cryogenic Electron Tomography (CryoET) is a useful imaging technology in\nstructural biology that is hindered by its need for manual annotations,\nespecially in particle picking. Recent works have endeavored to remedy this\nissue with few-shot learning or contrastive learning techniques. However,\nsupervised training is still inevitable for them. We instead choose to leverage\nthe power of existing 2D foundation models and present a novel, training-free\nframework, CryoSAM. In addition to prompt-based single-particle instance\nsegmentation, our approach can automatically search for similar features,\nfacilitating full tomogram semantic segmentation with only one prompt. CryoSAM\nis composed of two major parts: 1) a prompt-based 3D segmentation system that\nuses prompts to complete single-particle instance segmentation recursively with\nCross-Plane Self-Prompting, and 2) a Hierarchical Feature Matching mechanism\nthat efficiently matches relevant features with extracted tomogram features.\nThey collaborate to enable the segmentation of all particles of one category\nwith just one particle-specific prompt. Our experiments show that CryoSAM\noutperforms existing works by a significant margin and requires even fewer\nannotations in particle picking. Further visualizations demonstrate its ability\nwhen dealing with full tomogram segmentation for various subcellular\nstructures. Our code is available at: https://github.com/xulabs/aitom\n","subjects":["Quantitative Biology/Quantitative Methods","Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}