{"id":"2407.07514","title":"Swin SMT: Global Sequential Modeling in 3D Medical Image Segmentation","authors":"Szymon P{\\l}otka, Maciej Chrabaszcz, Przemyslaw Biecek","authorsParsed":[["Płotka","Szymon",""],["Chrabaszcz","Maciej",""],["Biecek","Przemyslaw",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 10:05:22 GMT"}],"updateDate":"2024-07-11","timestamp":1720605922000,"abstract":"  Recent advances in Vision Transformers (ViTs) have significantly enhanced\nmedical image segmentation by facilitating the learning of global\nrelationships. However, these methods face a notable challenge in capturing\ndiverse local and global long-range sequential feature representations,\nparticularly evident in whole-body CT (WBCT) scans. To overcome this\nlimitation, we introduce Swin Soft Mixture Transformer (Swin SMT), a novel\narchitecture based on Swin UNETR. This model incorporates a Soft\nMixture-of-Experts (Soft MoE) to effectively handle complex and diverse\nlong-range dependencies. The use of Soft MoE allows for scaling up model\nparameters maintaining a balance between computational complexity and\nsegmentation performance in both training and inference modes. We evaluate Swin\nSMT on the publicly available TotalSegmentator-V2 dataset, which includes 117\nmajor anatomical structures in WBCT images. Comprehensive experimental results\ndemonstrate that Swin SMT outperforms several state-of-the-art methods in 3D\nanatomical structure segmentation, achieving an average Dice Similarity\nCoefficient of 85.09%. The code and pre-trained weights of Swin SMT are\npublicly available at https://github.com/MI2DataLab/SwinSMT.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"mTF2YCuhjGX0dzhvYXmTyscjdlH0u6BfEcnV6J6XpCU","pdfSize":"14908723","objectId":"0xb282c80c5692aa478c746b8136b6f73ba7c0077922d08a4c977a5087b5f451d9","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
