{"id":"2407.04190","title":"Computer Vision for Clinical Gait Analysis: A Gait Abnormality Video\n  Dataset","authors":"Rahm Ranjan, David Ahmedt-Aristizabal, Mohammad Ali Armin and Juno Kim","authorsParsed":[["Ranjan","Rahm",""],["Ahmedt-Aristizabal","David",""],["Armin","Mohammad Ali",""],["Kim","Juno",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 00:18:40 GMT"}],"updateDate":"2024-07-08","timestamp":1720138720000,"abstract":"  Clinical gait analysis (CGA) using computer vision is an emerging field in\nartificial intelligence that faces barriers of accessible, real-world data, and\nclear task objectives. This paper lays the foundation for current developments\nin CGA as well as vision-based methods and datasets suitable for gait analysis.\nWe introduce The Gait Abnormality in Video Dataset (GAVD) in response to our\nreview of over 150 current gait-related computer vision datasets, which\nhighlighted the need for a large and accessible gait dataset clinically\nannotated for CGA. GAVD stands out as the largest video gait dataset,\ncomprising 1874 sequences of normal, abnormal and pathological gaits.\nAdditionally, GAVD includes clinically annotated RGB data sourced from publicly\navailable content on online platforms. It also encompasses over 400 subjects\nwho have undergone clinical grade visual screening to represent a diverse range\nof abnormal gait patterns, captured in various settings, including hospital\nclinics and urban uncontrolled outdoor environments. We demonstrate the\nvalidity of the dataset and utility of action recognition models for CGA using\npretrained models Temporal Segment Networks(TSN) and SlowFast network to\nachieve video abnormality detection of 94% and 92% respectively when tested on\nGAVD dataset. A GitHub repository https://github.com/Rahmyyy/GAVD consisting of\nconvenient URL links, and clinically relevant annotation for CGA is provided\nfor over 450 online videos, featuring diverse subjects performing a range of\nnormal, pathological, and abnormal gait patterns.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}