{"id":"2407.17705","title":"ALMRR: Anomaly Localization Mamba on Industrial Textured Surface with\n  Feature Reconstruction and Refinement","authors":"Shichen Qu, Xian Tao, Zhen Qu, Xinyi Gong, Zhengtao Zhang, Mukesh\n  Prasad","authorsParsed":[["Qu","Shichen",""],["Tao","Xian",""],["Qu","Zhen",""],["Gong","Xinyi",""],["Zhang","Zhengtao",""],["Prasad","Mukesh",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 01:58:10 GMT"}],"updateDate":"2024-07-26","timestamp":1721872690000,"abstract":"  Unsupervised anomaly localization on industrial textured images has achieved\nremarkable results through reconstruction-based methods, yet existing\napproaches based on image reconstruction and feature reconstruc-tion each have\ntheir own shortcomings. Firstly, image-based methods tend to reconstruct both\nnormal and anomalous regions well, which lead to over-generalization.\nFeature-based methods contain a large amount of distin-guishable semantic\ninformation, however, its feature structure is redundant and lacks anomalous\ninformation, which leads to significant reconstruction errors. In this paper,\nwe propose an Anomaly Localization method based on Mamba with Feature\nReconstruction and Refinement(ALMRR) which re-constructs semantic features\nbased on Mamba and then refines them through a feature refinement module. To\nequip the model with prior knowledge of anomalies, we enhance it by adding\nartificially simulated anomalies to the original images. Unlike image\nreconstruction or repair, the features of synthesized defects are repaired\nalong with those of normal areas. Finally, the aligned features containing rich\nsemantic information are fed in-to the refinement module to obtain the anomaly\nmap. Extensive experiments have been conducted on the MVTec-AD-Textured dataset\nand other real-world industrial dataset, which has demonstrated superior\nperformance com-pared to state-of-the-art (SOTA) methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"O-472kGLbAdaE7qtNTiX_ei6YwPBBcu5qu_Qhc3RLGU","pdfSize":"2399315"}
