{"id":"2407.11555","title":"Self-Guided Generation of Minority Samples Using Diffusion Models","authors":"Soobin Um and Jong Chul Ye","authorsParsed":[["Um","Soobin",""],["Ye","Jong Chul",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 10:03:29 GMT"}],"updateDate":"2024-07-17","timestamp":1721124209000,"abstract":"  We present a novel approach for generating minority samples that live on\nlow-density regions of a data manifold. Our framework is built upon diffusion\nmodels, leveraging the principle of guided sampling that incorporates an\narbitrary energy-based guidance during inference time. The key defining feature\nof our sampler lies in its \\emph{self-contained} nature, \\ie, implementable\nsolely with a pretrained model. This distinguishes our sampler from existing\ntechniques that require expensive additional components (like external\nclassifiers) for minority generation. Specifically, we first estimate the\nlikelihood of features within an intermediate latent sample by evaluating a\nreconstruction loss w.r.t. its posterior mean. The generation then proceeds\nwith the minimization of the estimated likelihood, thereby encouraging the\nemergence of minority features in the latent samples of subsequent timesteps.\nTo further improve the performance of our sampler, we provide several\ntime-scheduling techniques that properly manage the influence of guidance over\ninference steps. Experiments on benchmark real datasets demonstrate that our\napproach can greatly improve the capability of creating realistic\nlow-likelihood minority instances over the existing techniques without the\nreliance on costly additional elements. Code is available at\n\\url{https://github.com/soobin-um/sg-minority}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sUQnWvCX9joawsnOjKUVyIR9vC-nBsqhcK_gGos4JWo","pdfSize":"9842532","objectId":"0x0bbc777ef6ec051d8a7e91fc9b84a9f2d861ff3b1ded3017f0acd44ad5699f75","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
