{"id":"2407.05271","title":"Beyond Binary Gender Labels: Revealing Gender Biases in LLMs through\n  Gender-Neutral Name Predictions","authors":"Zhiwen You, HaeJin Lee, Shubhanshu Mishra, Sullam Jeoung, Apratim\n  Mishra, Jinseok Kim, Jana Diesner","authorsParsed":[["You","Zhiwen",""],["Lee","HaeJin",""],["Mishra","Shubhanshu",""],["Jeoung","Sullam",""],["Mishra","Apratim",""],["Kim","Jinseok",""],["Diesner","Jana",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 05:59:09 GMT"}],"updateDate":"2024-07-09","timestamp":1720331949000,"abstract":"  Name-based gender prediction has traditionally categorized individuals as\neither female or male based on their names, using a binary classification\nsystem. That binary approach can be problematic in the cases of gender-neutral\nnames that do not align with any one gender, among other reasons. Relying\nsolely on binary gender categories without recognizing gender-neutral names can\nreduce the inclusiveness of gender prediction tasks. We introduce an additional\ngender category, i.e., \"neutral\", to study and address potential gender biases\nin Large Language Models (LLMs). We evaluate the performance of several\nfoundational and large language models in predicting gender based on first\nnames only. Additionally, we investigate the impact of adding birth years to\nenhance the accuracy of gender prediction, accounting for shifting associations\nbetween names and genders over time. Our findings indicate that most LLMs\nidentify male and female names with high accuracy (over 80%) but struggle with\ngender-neutral names (under 40%), and the accuracy of gender prediction is\nhigher for English-based first names than non-English names. The experimental\nresults show that incorporating the birth year does not improve the overall\naccuracy of gender prediction, especially for names with evolving gender\nassociations. We recommend using caution when applying LLMs for gender\nidentification in downstream tasks, particularly when dealing with non-binary\ngender labels.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}