{"id":"2407.01370","title":"Summary of a Haystack: A Challenge to Long-Context LLMs and RAG Systems","authors":"Philippe Laban and Alexander R. Fabbri and Caiming Xiong and\n  Chien-Sheng Wu","authorsParsed":[["Laban","Philippe",""],["Fabbri","Alexander R.",""],["Xiong","Caiming",""],["Wu","Chien-Sheng",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:23:42 GMT"}],"updateDate":"2024-07-02","timestamp":1719847422000,"abstract":"  LLMs and RAG systems are now capable of handling millions of input tokens or\nmore. However, evaluating the output quality of such systems on long-context\ntasks remains challenging, as tasks like Needle-in-a-Haystack lack complexity.\nIn this work, we argue that summarization can play a central role in such\nevaluation. We design a procedure to synthesize Haystacks of documents,\nensuring that specific \\textit{insights} repeat across documents. The \"Summary\nof a Haystack\" (SummHay) task then requires a system to process the Haystack\nand generate, given a query, a summary that identifies the relevant insights\nand precisely cites the source documents. Since we have precise knowledge of\nwhat insights should appear in a haystack summary and what documents should be\ncited, we implement a highly reproducible automatic evaluation that can score\nsummaries on two aspects - Coverage and Citation. We generate Haystacks in two\ndomains (conversation, news), and perform a large-scale evaluation of 10 LLMs\nand corresponding 50 RAG systems. Our findings indicate that SummHay is an open\nchallenge for current systems, as even systems provided with an Oracle signal\nof document relevance lag our estimate of human performance (56\\%) by 10+\npoints on a Joint Score. Without a retriever, long-context LLMs like GPT-4o and\nClaude 3 Opus score below 20% on SummHay. We show SummHay can also be used to\nstudy enterprise RAG systems and position bias in long-context models. We hope\nfuture systems can equal and surpass human performance on SummHay.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}