{"id":"2407.15422","title":"Lattice study of SU(2) gauge theory coupled to four adjoint Higgs fields","authors":"Guilherme Catumba, Atsuki Hiraguchi, Wei-Shu Hou, Karl Jansen,\n  Ying-Jer Kao, C.-J. David Lin, Alberto Ramos and Mugdha Sarkar","authorsParsed":[["Catumba","Guilherme",""],["Hiraguchi","Atsuki",""],["Hou","Wei-Shu",""],["Jansen","Karl",""],["Kao","Ying-Jer",""],["Lin","C. -J. David",""],["Ramos","Alberto",""],["Sarkar","Mugdha",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 07:00:17 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 05:45:23 GMT"}],"updateDate":"2024-07-31","timestamp":1721631617000,"abstract":"  Gauge theories with matter fields in various representations play an\nimportant role in different branches of physics. Recently, it was proposed that\nseveral aspects of the interesting pseudogap phase of cuprate superconductors\nnear optimal doping may be explained by an emergent $SU(2)$ gauge symmetry.\nAround the transition with positive hole-doping, one can construct a\n$(2+1)-$dimensional $SU(2)$ gauge theory coupled to four adjoint scalar fields\nwhich gives rise to a rich phase diagram with a myriad of phases having\ndifferent broken symmetries. We study the phase diagram of this model on the\nEuclidean lattice using the Hybrid Monte Carlo algorithm. We find the existence\nof multiple broken phases as predicted by previous mean field studies.\nDepending on the quartic couplings, the $SU(2)$ gauge symmetry is broken down\neither to $U(1)$ or $\\mathbb{Z}_2$ in the perturbative description of the\nmodel. We further study the confinement-deconfinement transition in this\ntheory, and find that both the broken phases are deconfining in the range of\nvolumes that we studied. However, there exists a marked difference in the\nbehavior of the Polyakov loop between the two phases.\n","subjects":["Physics/High Energy Physics - Lattice","Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}