{"id":"2407.11865","title":"Novel Hybrid Integrated Pix2Pix and WGAN Model with Gradient Penalty for\n  Binary Images Denoising","authors":"Luca Tirel, Ali Mohamed Ali and Hashim A. Hashim","authorsParsed":[["Tirel","Luca",""],["Ali","Ali Mohamed",""],["Hashim","Hashim A.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:50:45 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 15:05:03 GMT"}],"updateDate":"2024-08-01","timestamp":1721145045000,"abstract":"  This paper introduces a novel approach to image denoising that leverages the\nadvantages of Generative Adversarial Networks (GANs). Specifically, we propose\na model that combines elements of the Pix2Pix model and the Wasserstein GAN\n(WGAN) with Gradient Penalty (WGAN-GP). This hybrid framework seeks to\ncapitalize on the denoising capabilities of conditional GANs, as demonstrated\nin the Pix2Pix model, while mitigating the need for an exhaustive search for\noptimal hyperparameters that could potentially ruin the stability of the\nlearning process. In the proposed method, the GAN's generator is employed to\nproduce denoised images, harnessing the power of a conditional GAN for noise\nreduction. Simultaneously, the implementation of the Lipschitz continuity\nconstraint during updates, as featured in WGAN-GP, aids in reducing\nsusceptibility to mode collapse. This innovative design allows the proposed\nmodel to benefit from the strong points of both Pix2Pix and WGAN-GP, generating\nsuperior denoising results while ensuring training stability. Drawing on\nprevious work on image-to-image translation and GAN stabilization techniques,\nthe proposed research highlights the potential of GANs as a general-purpose\nsolution for denoising. The paper details the development and testing of this\nmodel, showcasing its effectiveness through numerical experiments. The dataset\nwas created by adding synthetic noise to clean images. Numerical results based\non real-world dataset validation underscore the efficacy of this approach in\nimage-denoising tasks, exhibiting significant enhancements over traditional\ntechniques. Notably, the proposed model demonstrates strong generalization\ncapabilities, performing effectively even when trained with synthetic noise.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}