{"id":"2407.08832","title":"Searching for Protoplanets around MWC 758 and MWC 480 in Br-$\\gamma$\n  using Kernel Phase and SCExAO/CHARIS","authors":"Alexander Chaushev, Steph Sallum, Julien Lozi, Jeffrey Chilcote, Tyler\n  Groff, Olivier Guyon, N. Jeremy Kasdin, Barnaby Norris, Andy Skemer","authorsParsed":[["Chaushev","Alexander",""],["Sallum","Steph",""],["Lozi","Julien",""],["Chilcote","Jeffrey",""],["Groff","Tyler",""],["Guyon","Olivier",""],["Kasdin","N. Jeremy",""],["Norris","Barnaby",""],["Skemer","Andy",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 19:34:58 GMT"}],"updateDate":"2024-07-15","timestamp":1720726498000,"abstract":"  Discovering new actively-accreting protoplanets is crucial to answering open\nquestions about planet formation. However, identifying such planets at orbital\ndistances where they are expected to be abundant is extremely challenging, both\ndue to the technical requirements and large distances to star-forming regions.\nHere we use the kernel phase interferometry (KPI) technique to search for\ncompanions around the $\\sim$6 and $\\sim$8 Myr old Herbig Ae stars MWC 758 and\nMWC 480. KPI is a data analysis technique which is sensitive to moderate\nasymmetries, arising from eg. a circumstellar disk or companions with contrasts\nof up to 6-8 mags, at separations down to and even below the classical Rayleigh\ndiffraction limit ($\\sim 1.2\\lambda / D$). Using the high spectral resolution\nK-band mode of the SCExAO/CHARIS integral field spectrograph, we search for\nboth excess Br-$\\gamma$ line emission and continuum emission from companions\naround MWC 480 and MWC 758. We are able to set limits on the presence of\nrapidly accreting protoplanets and brown dwarfs between 4 and 16 au, well\ninterior to those of previous studies. In Br-$\\gamma$, we set limits on excess\nline emission equivalent to accretion rates ranging from $10^{-5}\nM_{j}^{2}.yr^{-1}$ to $10^{-6}M_{j}^{2}.yr^{-1}$. Our achievable contrasts\ndemonstrate that KPI using SCExAO/CHARIS is a promising technique to search for\ngiant accreting protoplanets at smaller separations compared to conventional\nimaging.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}