{"id":"2407.00132","title":"ShortcutsBench: A Large-Scale Real-world Benchmark for API-based Agents","authors":"Haiyang Shen, Yue Li, Desong Meng, Dongqi Cai, Sheng Qi, Li Zhang,\n  Mengwei Xu, Yun Ma","authorsParsed":[["Shen","Haiyang",""],["Li","Yue",""],["Meng","Desong",""],["Cai","Dongqi",""],["Qi","Sheng",""],["Zhang","Li",""],["Xu","Mengwei",""],["Ma","Yun",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 08:45:02 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 07:57:58 GMT"}],"updateDate":"2024-07-23","timestamp":1719564302000,"abstract":"  Recent advancements in integrating large language models (LLMs) with\napplication programming interfaces (APIs) have gained significant interest in\nboth academia and industry. These API-based agents, leveraging the strong\nautonomy and planning capabilities of LLMs, can efficiently solve problems\nrequiring multi-step actions. However, their ability to handle\nmulti-dimensional difficulty levels, diverse task types, and real-world demands\nthrough APIs remains unknown. In this paper, we introduce\n\\textsc{ShortcutsBench}, a large-scale benchmark for the comprehensive\nevaluation of API-based agents in solving tasks with varying levels of\ndifficulty, diverse task types, and real-world demands. \\textsc{ShortcutsBench}\nincludes a wealth of real APIs from Apple Inc.'s operating systems, refined\nuser queries from shortcuts, human-annotated high-quality action sequences from\nshortcut developers, and accurate parameter filling values about primitive\nparameter types, enum parameter types, outputs from previous actions, and\nparameters that need to request necessary information from the system or user.\nOur extensive evaluation of agents built with $5$ leading open-source (size >=\n57B) and $4$ closed-source LLMs (e.g. Gemini-1.5-Pro and GPT-3.5) reveals\nsignificant limitations in handling complex queries related to API selection,\nparameter filling, and requesting necessary information from systems and users.\nThese findings highlight the challenges that API-based agents face in\neffectively fulfilling real and complex user queries. All datasets, code, and\nexperimental results will be available at\n\\url{https://github.com/eachsheep/shortcutsbench}.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}