{"id":"2407.08877","title":"Analyzing Speech Motor Movement using Surface Electromyography in\n  Minimally Verbal Adults with Autism Spectrum Disorder","authors":"Wazeer Zulfikar, Nishat Protyasha, Camila Canales, Heli Patel, James\n  Williamson, Laura Sarnie, Lisa Nowinski, Nataliya Kosmyna, Paige Townsend,\n  Sophia Yuditskaya, Tanya Talkar, Utkarsh Oggy Sarawgi, Christopher McDougle,\n  Thomas Quatieri, Pattie Maes, Maria Mody","authorsParsed":[["Zulfikar","Wazeer",""],["Protyasha","Nishat",""],["Canales","Camila",""],["Patel","Heli",""],["Williamson","James",""],["Sarnie","Laura",""],["Nowinski","Lisa",""],["Kosmyna","Nataliya",""],["Townsend","Paige",""],["Yuditskaya","Sophia",""],["Talkar","Tanya",""],["Sarawgi","Utkarsh Oggy",""],["McDougle","Christopher",""],["Quatieri","Thomas",""],["Maes","Pattie",""],["Mody","Maria",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 21:32:20 GMT"}],"updateDate":"2024-07-15","timestamp":1720733540000,"abstract":"  Adults who are minimally verbal with autism spectrum disorder (mvASD) have\npronounced speech difficulties linked to impaired motor skills. Existing\nresearch and clinical assessments primarily use indirect methods such as\nstandardized tests, video-based facial features, and handwriting tasks, which\nmay not directly target speech-related motor skills. In this study, we measure\nactivity from eight facial muscles associated with speech using surface\nelectromyography (sEMG), during carefully designed tasks. The findings reveal a\nhigher power in the sEMG signals and a significantly greater correlation\nbetween the sEMG channels in mvASD adults (N=12) compared to age and\ngender-matched neurotypical controls (N=14). This suggests stronger muscle\nactivation and greater synchrony in the discharge patterns of motor units.\nFurther, eigenvalues derived from correlation matrices indicate lower\ncomplexity in muscle coordination in mvASD, implying fewer degrees of freedom\nin motor control.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}