{"id":"2407.00995","title":"Data on the Move: Traffic-Oriented Data Trading Platform Powered by AI\n  Agent with Common Sense","authors":"Yi Yu, Shengyue Yao, Tianchen Zhou, Yexuan Fu, Jingru Yu, Ding Wang,\n  Xuhong Wang, Cen Chen, Yilun Lin","authorsParsed":[["Yu","Yi",""],["Yao","Shengyue",""],["Zhou","Tianchen",""],["Fu","Yexuan",""],["Yu","Jingru",""],["Wang","Ding",""],["Wang","Xuhong",""],["Chen","Cen",""],["Lin","Yilun",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 06:17:18 GMT"}],"updateDate":"2024-07-02","timestamp":1719814638000,"abstract":"  In the digital era, data has become a pivotal asset, advancing technologies\nsuch as autonomous driving. Despite this, data trading faces challenges like\nthe absence of robust pricing methods and the lack of trustworthy trading\nmechanisms. To address these challenges, we introduce a traffic-oriented data\ntrading platform named Data on The Move (DTM), integrating traffic simulation,\ndata trading, and Artificial Intelligent (AI) agents. The DTM platform supports\nevident-based data value evaluation and AI-based trading mechanisms. Leveraging\nthe common sense capabilities of Large Language Models (LLMs) to assess traffic\nstate and data value, DTM can determine reasonable traffic data pricing through\nmulti-round interaction and simulations. Moreover, DTM provides a pricing\nmethod validation by simulating traffic systems, multi-agent interactions, and\nthe heterogeneity and irrational behaviors of individuals in the trading\nmarket. Within the DTM platform, entities such as connected vehicles and\ntraffic light controllers could engage in information collecting, data pricing,\ntrading, and decision-making. Simulation results demonstrate that our proposed\nAI agent-based pricing approach enhances data trading by offering rational\nprices, as evidenced by the observed improvement in traffic efficiency. This\nunderscores the effectiveness and practical value of DTM, offering new\nperspectives for the evolution of data markets and smart cities. To the best of\nour knowledge, this is the first study employing LLMs in data pricing and a\npioneering data trading practice in the field of intelligent vehicles and smart\ncities.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}