{"id":"2407.11609","title":"Statistical Reachability Analysis of Stochastic Cyber-Physical Systems\n  under Distribution Shift","authors":"Navid Hashemi, Lars Lindemann, Jyotirmoy V. Deshmukh","authorsParsed":[["Hashemi","Navid",""],["Lindemann","Lars",""],["Deshmukh","Jyotirmoy V.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 11:18:41 GMT"}],"updateDate":"2024-07-17","timestamp":1721128721000,"abstract":"  Reachability analysis is a popular method to give safety guarantees for\nstochastic cyber-physical systems (SCPSs) that takes in a symbolic description\nof the system dynamics and uses set-propagation methods to compute an\noverapproximation of the set of reachable states over a bounded time horizon.\nIn this paper, we investigate the problem of performing reachability analysis\nfor an SCPS that does not have a symbolic description of the dynamics, but\ninstead is described using a digital twin model that can be simulated to\ngenerate system trajectories. An important challenge is that the simulator\nimplicitly models a probability distribution over the set of trajectories of\nthe SCPS; however, it is typical to have a sim2real gap, i.e., the actual\ndistribution of the trajectories in a deployment setting may be shifted from\nthe distribution assumed by the simulator. We thus propose a statistical\nreachability analysis technique that, given a user-provided threshold\n$1-\\epsilon$, provides a set that guarantees that any reachable state during\ndeployment lies in this set with probability not smaller than this threshold.\nOur method is based on three main steps: (1) learning a deterministic surrogate\nmodel from sampled trajectories, (2) conducting reachability analysis over the\nsurrogate model, and (3) employing {\\em robust conformal inference} using an\nadditional set of sampled trajectories to quantify the surrogate model's\ndistribution shift with respect to the deployed SCPS. To counter conservatism\nin reachable sets, we propose a novel method to train surrogate models that\nminimizes a quantile loss term (instead of the usual mean squared loss), and a\nnew method that provides tighter guarantees using conformal inference using a\nnormalized surrogate error. We demonstrate the effectiveness of our technique\non various case studies.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Signal Processing","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gMdR0hhts5L360Mn24g_ZX6VF9WxSEdmwwBUknRUSTs","pdfSize":"1499079"}
