{"id":"2407.11349","title":"Scaling Hawkes processes to one million COVID-19 cases","authors":"Seyoon Ko, Marc A. Suchard, Andrew J. Holbrook","authorsParsed":[["Ko","Seyoon",""],["Suchard","Marc A.",""],["Holbrook","Andrew J.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 03:33:29 GMT"}],"updateDate":"2024-07-17","timestamp":1721100809000,"abstract":"  Hawkes stochastic point process models have emerged as valuable statistical\ntools for analyzing viral contagion. The spatiotemporal Hawkes process\ncharacterizes the speeds at which viruses spread within human populations.\nUnfortunately, likelihood-based inference using these models requires $O(N^2)$\nfloating-point operations, for $N$ the number of observed cases. Recent work\nresponds to the Hawkes likelihood's computational burden by developing\nefficient graphics processing unit (GPU)-based routines that enable Bayesian\nanalysis of tens-of-thousands of observations. We build on this work and\ndevelop a high-performance computing (HPC) strategy that divides 30 Markov\nchains between 4 GPU nodes, each of which uses multiple GPUs to accelerate its\nchain's likelihood computations. We use this framework to apply two\nspatiotemporal Hawkes models to the analysis of one million COVID-19 cases in\nthe United States between March 2020 and June 2023. In addition to brute-force\nHPC, we advocate for two simple strategies as scalable alternatives to\nsuccessful approaches proposed for small data settings. First, we use known\ncounty-specific population densities to build a spatially varying triggering\nkernel in a manner that avoids computationally costly nearest neighbors search.\nSecond, we use a cut-posterior inference routine that accounts for infections'\nspatial location uncertainty by iteratively sampling latent locations uniformly\nwithin their respective counties of occurrence, thereby avoiding full-blown\nlatent variable inference for 1,000,000 infection locations.\n","subjects":["Statistics/Computation","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}