{"id":"2407.19100","title":"A New Higher-Order Super Compact Finite Difference Scheme to Study\n  Three-Dimensional Non-Newtonian Flows","authors":"Ashwani Punia and Rajendra K. Ray","authorsParsed":[["Punia","Ashwani",""],["Ray","Rajendra K.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 21:40:11 GMT"}],"updateDate":"2024-07-30","timestamp":1722030011000,"abstract":"  This work introduces a new higher-order accurate super compact (HOSC) finite\ndifference scheme for solving complex unsteady three-dimensional (3D)\nnon-Newtonian fluid flow problems. As per the author's knowledge, the proposed\nscheme is the first ever developed finite difference scheme to solve\nthree-dimensional non-Newtonian flow problem. Not only that, the proposed\nmethod is fourth-order accurate in space variables and second-order accurate in\ntime. Also, the proposed scheme utilizes only seven directly adjacent grid\npoints, at the $(n+1)^{th}$ time level, around which the finite difference\ndiscretization is made. The governing equations are solved using a\ntime-marching methodology, and pressure is calculated using a\npressure-correction strategy based on the modified artificial compressibility\nmethod. Using the power-law viscosity model, we tackle the benchmark problem of\na 3D lid-driven cavity, systematically analyzing the varied rheological\nbehavior of shear-thinning ($n=0.5$), shear-thickening $(n=1.5)$, and Newtonian\n$(n=1.0)$ fluids across different Reynolds numbers $(Re= 1, 50, 100, 200)$.\nBoth Newtonian and non-Newtonian results are carefully investigated in terms of\nstreamlines, velocity variation, pressure distributions, and viscosity\ncontours, and the computed results are validated with the existing benchmark\nresults. The findings demonstrate excellent agreement with the existing\nresults. This extensive analysis, using the new HOSC scheme, not only increases\nour understanding of non-Newtonian fluid behavior but also provides a robust\nfoundation for future research and practical applications.\n","subjects":["Physics/Fluid Dynamics","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}