{"id":"2407.12185","title":"Satisficing Exploration for Deep Reinforcement Learning","authors":"Dilip Arumugam, Saurabh Kumar, Ramki Gummadi, Benjamin Van Roy","authorsParsed":[["Arumugam","Dilip",""],["Kumar","Saurabh",""],["Gummadi","Ramki",""],["Van Roy","Benjamin",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 21:28:03 GMT"}],"updateDate":"2024-07-23","timestamp":1721165283000,"abstract":"  A default assumption in the design of reinforcement-learning algorithms is\nthat a decision-making agent always explores to learn optimal behavior. In\nsufficiently complex environments that approach the vastness and scale of the\nreal world, however, attaining optimal performance may in fact be an entirely\nintractable endeavor and an agent may seldom find itself in a position to\ncomplete the requisite exploration for identifying an optimal policy. Recent\nwork has leveraged tools from information theory to design agents that\ndeliberately forgo optimal solutions in favor of sufficiently-satisfying or\nsatisficing solutions, obtained through lossy compression. Notably, such agents\nmay employ fundamentally different exploratory decisions to learn satisficing\nbehaviors more efficiently than optimal ones that are more data intensive.\nWhile supported by a rigorous corroborating theory, the underlying algorithm\nrelies on model-based planning, drastically limiting the compatibility of these\nideas with function approximation and high-dimensional observations. In this\nwork, we remedy this issue by extending an agent that directly represents\nuncertainty over the optimal value function allowing it to both bypass the need\nfor model-based planning and to learn satisficing policies. We provide simple\nyet illustrative experiments that demonstrate how our algorithm enables deep\nreinforcement-learning agents to achieve satisficing behaviors. In keeping with\nprevious work on this setting for multi-armed bandits, we additionally find\nthat our algorithm is capable of synthesizing optimal behaviors, when feasible,\nmore efficiently than its non-information-theoretic counterpart.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}