{"id":"2407.18587","title":"REMIX SPH -- improving mixing in smoothed particle hydrodynamics\n  simulations using a generalised, material-independent approach","authors":"Thomas D. Sandnes, Vincent R. Eke, Jacob A. Kegerreis, Richard J.\n  Massey, Sergio Ruiz-Bonilla, Matthieu Schaller, Luis F. A. Teodoro","authorsParsed":[["Sandnes","Thomas D.",""],["Eke","Vincent R.",""],["Kegerreis","Jacob A.",""],["Massey","Richard J.",""],["Ruiz-Bonilla","Sergio",""],["Schaller","Matthieu",""],["Teodoro","Luis F. A.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 08:13:11 GMT"}],"updateDate":"2024-07-29","timestamp":1721981591000,"abstract":"  We present REMIX, a smoothed particle hydrodynamics (SPH) scheme designed to\nalleviate effects that typically suppress mixing and instability growth at\ndensity discontinuities in SPH simulations. We approach this problem by\ndirectly targeting sources of kernel smoothing error and discretisation error,\nresulting in a generalised, material-independent formulation that improves the\ntreatment both of discontinuities within a single material, for example in an\nideal gas, and of interfaces between dissimilar materials. This approach also\nleads to improvements in capturing hydrodynamic behaviour unrelated to mixing,\nsuch as in shocks. We demonstrate marked improvements in three-dimensional test\nscenarios, focusing on more challenging cases with particles of equal mass\nacross the simulation. This validates our methods for use-cases relevant across\napplications spanning astrophysics and engineering, where particles are free to\nevolve over a large range of density scales, or where emergent and evolving\ndensity discontinuities cannot easily be corrected by choosing bespoke particle\nmasses in the initial conditions. We achieve these improvements while\nmaintaining sharp discontinuities; without introducing additional equation of\nstate dependence in, for example, particle volume elements; and without\ncontrived or targeted corrections. Our methods build upon a fully compressible\nand thermodynamically consistent core-SPH construction, retaining Galilean\ninvariance as well as conservation of mass, momentum, and energy. REMIX is\nintegrated in the open-source, state-of-the-art \\swift code and is designed\nwith computational efficiency in mind, which means that its improved\nhydrodynamic treatment can be used for high-resolution simulations without\nsignificant cost to run-speed.\n","subjects":["Physics/Computational Physics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Djeu1CzZq7GnrfP8ztX60fpahwWAfszYWsmYjwbyFTw","pdfSize":"21477773"}
