{"id":"2407.01373","title":"Evaluation of Temporal Change in IR Test Collections","authors":"J\\\"uri Keller and Timo Breuer and Philipp Schaer","authorsParsed":[["Keller","Jüri",""],["Breuer","Timo",""],["Schaer","Philipp",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:25:31 GMT"}],"updateDate":"2024-07-02","timestamp":1719847531000,"abstract":"  Information retrieval systems have been evaluated using the Cranfield\nparadigm for many years. This paradigm allows a systematic, fair, and\nreproducible evaluation of different retrieval methods in fixed experimental\nenvironments. However, real-world retrieval systems must cope with dynamic\nenvironments and temporal changes that affect the document collection, topical\ntrends, and the individual user's perception of what is considered relevant.\nYet, the temporal dimension in IR evaluations is still understudied.\n  To this end, this work investigates how the temporal generalizability of\neffectiveness evaluations can be assessed. As a conceptual model, we generalize\nCranfield-type experiments to the temporal context by classifying the change in\nthe essential components according to the create, update, and delete operations\nof persistent storage known from CRUD. From the different types of change\ndifferent evaluation scenarios are derived and it is outlined what they imply.\nBased on these scenarios, renowned state-of-the-art retrieval systems are\ntested and it is investigated how the retrieval effectiveness changes on\ndifferent levels of granularity.\n  We show that the proposed measures can be well adapted to describe the\nchanges in the retrieval results. The experiments conducted confirm that the\nretrieval effectiveness strongly depends on the evaluation scenario\ninvestigated. We find that not only the average retrieval performance of single\nsystems but also the relative system performance are strongly affected by the\ncomponents that change and to what extent these components changed.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/"}