{"id":"2407.07955","title":"Fragmentation in Gravitationally-Unstable Collapsar Disks and Sub-Solar\n  Neutron Star Mergers","authors":"Brian D. Metzger, Lam Hui, Matteo Cantiello","authorsParsed":[["Metzger","Brian D.",""],["Hui","Lam",""],["Cantiello","Matteo",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:00:13 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 14:59:09 GMT"},{"version":"v3","created":"Wed, 31 Jul 2024 22:30:40 GMT"}],"updateDate":"2024-08-02","timestamp":1720634413000,"abstract":"  Although stable neutron stars (NS) can in principle exist down to masses Mns\n~ 0.1Msun, standard models of stellar core-collapse predict a robust lower\nlimit Mns >~ 1.2Msun, roughly commensurate with the Chandrasekhar mass Mch of\nthe progenitor's iron core (electron fraction Ye ~ 0.5). However, this limit\nmay be circumvented in sufficiently dense neutron-rich environments (Ye << 0.5)\nfor which Mch ~ Ye^2 is reduced to < Msun. Such physical conditions could arise\nin the black hole accretion disks formed from the collapse of rapidly-rotating\nstars (\"collapsars\"), as a result of gravitational instabilities and\ncooling-induced fragmentation, similar to models for planet formation in\nprotostellar disks. We confirm that the conditions to form sub-solar mass NS\n(ssNS) may be marginally satisfied in the outer regions of massive\nneutrino-cooled collapsar disks. If the disk fragments into multiple ssNS,\ntheir subsequent coalescence offers a channel for precipitating sub-solar mass\nLIGO/Virgo gravitational-wave mergers that does not implicate primordial black\nholes. The model makes several additional predictions: (1) ~Hz frequency\nDoppler modulation of the ssNS-merger gravitational wave signals due to the\nbinary's orbital motion in the disk; (2) at least one additional gravitational\nwave event (coincident within <~ hours), from the coalescence of the\nssNS-merger remnant(s) with the central black hole; (3) an associated gamma-ray\nburst and supernova counterpart, the latter boosted in energy and enriched with\nr-process elements from the NS merger(s) embedded within the exploding stellar\nenvelope (\"kilonovae inside a supernova\").\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}