{"id":"2407.13728","title":"Barycentric bounds on the error exponents of quantum hypothesis\n  exclusion","authors":"Kaiyuan Ji, Hemant K. Mishra, Mil\\'an Mosonyi, and Mark M. Wilde","authorsParsed":[["Ji","Kaiyuan",""],["Mishra","Hemant K.",""],["Mosonyi","Milán",""],["Wilde","Mark M.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:27:36 GMT"}],"updateDate":"2024-07-19","timestamp":1721323656000,"abstract":"  Quantum state exclusion is an operational task that has significance in\nstudying foundational questions related to interpreting quantum theory. In such\na task, one is given a system whose state is randomly selected from a finite\nset, and the goal is to identify a state from the set that is not the true\nstate of the system. An error, i.e., an unsuccessful exclusion, occurs if and\nonly if the state identified is the true state. In this paper, we study the\noptimal error probability of quantum state exclusion and its error exponent --\nthe rate at which the error probability decays asymptotically -- from an\ninformation-theoretic perspective. Our main finding is a single-letter upper\nbound on the error exponent of state exclusion given by the multivariate\nlog-Euclidean Chernoff divergence, and we prove that this improves upon the\nbest previously known upper bound. We also extend our analysis to the more\ncomplicated task of quantum channel exclusion, and we establish a single-letter\nand efficiently computable upper bound on its error exponent, even assuming the\nuse of adaptive strategies. We derive both upper bounds, for state and channel\nexclusion, based on one-shot analysis and formulate them as a type of\nmultivariate divergence measure called a barycentric Chernoff divergence.\nMoreover, our result on channel exclusion has implications in two important\nspecial cases. First, for the special case of two hypotheses, our upper bound\nprovides the first known efficiently computable upper bound on the error\nexponent of symmetric binary channel discrimination. Second, for the special\ncase of classical channels, we show that our upper bound is achievable by a\nnonadaptive strategy, thus solving the exact error exponent of classical\nchannel exclusion and generalising a similar result on symmetric binary\nclassical channel discrimination.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Information Theory","Physics/Mathematical Physics","Mathematics/Information Theory","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}