{"id":"2407.05070","title":"MINDS. The DR Tau disk II: probing the hot and cold H$_2$O reservoirs in\n  the JWST-MIRI spectrum","authors":"Milou Temmink, Ewine F. van Dishoeck, Danny Gasman, Sierra L. Grant,\n  Benoit Tabone, Manuel Guedel, Thomas Henning, David Barrado, Alessio Caratti\n  o Garatti, Adrian M. Glauser, Inga Kamp, Aditya M. Arabhavi, Hyerin Jang,\n  Nicolas Kurtovic, Giulia Perotti, Kamber Schwarz, Marissa Vlasblom","authorsParsed":[["Temmink","Milou",""],["van Dishoeck","Ewine F.",""],["Gasman","Danny",""],["Grant","Sierra L.",""],["Tabone","Benoit",""],["Guedel","Manuel",""],["Henning","Thomas",""],["Barrado","David",""],["Garatti","Alessio Caratti o",""],["Glauser","Adrian M.",""],["Kamp","Inga",""],["Arabhavi","Aditya M.",""],["Jang","Hyerin",""],["Kurtovic","Nicolas",""],["Perotti","Giulia",""],["Schwarz","Kamber",""],["Vlasblom","Marissa",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 13:25:44 GMT"}],"updateDate":"2024-07-09","timestamp":1720272344000,"abstract":"  The MRS mode of the JWST-MIRI instrument gives insights into the chemical\nrichness and complexity of the inner regions of planet-forming disks. Here, we\nanalyse the H$_2$O-rich spectrum of the compact disk DR Tau. We probe the\nexcitation conditions of the H$_2$O transitions observed in different\nwavelength regions across the entire spectrum using LTE slab models, probing\nboth the rovibrational and rotational transitions. These regions suggest a\nradial temperature gradient, as the excitation temperature (emitting radius)\ndecreases (increases) with increasing wavelength. To explain the derived\nemitting radii, we require a larger inclination for the inner disk (i~20-23\ndegrees) compared to the outer disk (i~5 degrees), agreeing with our previous\nanalysis on CO. We also analyse the pure rotational spectrum (<10 micron) using\na large, structured disk (CI Tau) as a template, confirming the presence of the\nradial gradient, and by fitting multiple components to further characterise the\nradial and vertical temperature gradients present in the spectrum. At least\nthree temperature components (T~180-800 K) are required to reproduce the\nrotational spectrum of H$_2$O arising from the inner ~0.3-8 au. These\ncomponents describe a radial temperature gradient that scales roughly as\n~R$^{-0.5}$ in the emitting layers. As the H$_2$O is mainly optically thick, we\nderive a lower limit on the abundance ratio of H$_2$O/CO~0.17, suggesting a\npotential depletion of H$_2$O. Similarly to previous work, we detect a cold\nH$_2$O component (T~180 K) originating from near the snowline. We cannot\nconclude if an enhancement of the H$_2$O reservoir is observed following radial\ndrift. A consistent analysis of a larger sample of compact disks is necessary\nto study the importance of drift in enhancing the H$_2$O abundances.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}