{"id":"2407.14786","title":"A Pseudo-Gradient Approach for Model-free Markov Chain Optimization","authors":"Nanne A. Dieleman and Joost Berkhout and Bernd Heidergott","authorsParsed":[["Dieleman","Nanne A.",""],["Berkhout","Joost",""],["Heidergott","Bernd",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 07:33:12 GMT"}],"updateDate":"2024-07-23","timestamp":1721460792000,"abstract":"  We develop a first-order (pseudo-)gradient approach for optimizing functions\nover the stationary distribution of discrete-time Markov chains (DTMC). We give\ninsights into why solving this optimization problem is challenging and show how\ntransformations can be used to circumvent the hard constraints inherent in the\noptimization problem. The optimization framework is model-free since no\nexplicit model of the interdependence of the row elements of the Markov chain\ntransition matrix is required. Upon the transformation we build an extension of\nSimultaneous Perturbation Stochastic Approximation (SPSA) algorithm, called\nstochastic matrix SPSA (SM-SPSA) to solve the optimization problem. The\nperformance of the SM-SPSA gradient search is compared with a benchmark\ncommercial solver. Numerical examples show that SM-SPSA scales better which\nmakes it the preferred solution method for large problem instances. We also\napply the algorithm to the maximization of web-page rankings in web-graphs\nbased on a real-life data set. As we explain in the paper, when applying a\nfirst-order gradient search one typically encounters a phenomenon which we call\n``infliction points,\" that is, jumps in the optimization trajectories between\nperiods of almost stationary behavior that slow down the optimization. We\npropose a heuristic for avoiding such infliction points and present a metastudy\non a wide range of networks showing the positive effect of our heuristic on the\nconvergence properties of SM-SPSA gradient search.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"PS9eUnBtR0qVwr2Uv6ElF69TQKhSsg8fw1NMaHq2SH4","pdfSize":"995755"}
