{"id":"2407.16336","title":"Lowering Connectivity Requirements For Bivariate Bicycle Codes Using\n  Morphing Circuits","authors":"Mackenzie H. Shaw and Barbara M. Terhal","authorsParsed":[["Shaw","Mackenzie H.",""],["Terhal","Barbara M.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 09:35:49 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 09:58:06 GMT"}],"updateDate":"2024-08-21","timestamp":1721727349000,"abstract":"  Recently, Bravyi et al. [1] proposed a set of small quantum Bivariate Bicycle\n(BB) codes that achieve a similar circuit-level error rate to the surface code\nbut with an improved encoding rate. In this work, we generalise a novel\nparity-check circuit design principle that we call morphing circuits (first\nintroduced in [2]) and apply this methodology to BB codes. Our construction\ngenerates a new family of BB codes -- including a new $[[144,12,12]]$ \"gross\"\ncode -- whose parity check circuits require a qubit connectivity of degree five\ninstead of six. Intriguingly, each parity check circuit requires only 6 rounds\nof CNOT gates -- one fewer than in Ref. [1] -- even though our new codes have\nweight-9 stabilisers. We also show how to perform logical input/output circuits\nto an ancillary rotated surface code using morphing circuits, all within a\nbiplanar layout. The new codes perform at least as well as those of Ref. [1]\nunder uniform circuit-level noise when decoded using BP-OSD. Finally, we\ndevelop a general framework for designing morphing circuits and present a\nsufficient condition for its applicability to two-block group algebra codes.\n  [1] S. Bravyi, A. W. Cross, J. M. Gambetta, D. Maslov, P. Rall, and T. J.\nYoder, Nature 627, 778 (2024).\n  [2] C. Gidney and C. Jones, New circuits and an open source decoder for the\ncolor code (2023), arXiv:2312.08813.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"H2FUjfO8cYzAD8qs96wyS_5XE9uN1TEhWGJ6GrXsgCg","pdfSize":"7994107","objectId":"0x16c42b97b6b68127c216cde575f43dd55b46c9ceb075fbecac6327ba48991056","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
