{"id":"2407.17886","title":"Pseudomode treatment of strong-coupling quantum thermodynamics","authors":"Francesco Albarelli, Bassano Vacchini, Andrea Smirne","authorsParsed":[["Albarelli","Francesco",""],["Vacchini","Bassano",""],["Smirne","Andrea",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 09:11:45 GMT"}],"updateDate":"2024-07-26","timestamp":1721898705000,"abstract":"  The treatment of quantum thermodynamic systems beyond weak coupling is of\nincreasing relevance, yet extremely challenging. The evaluation of\nthermodynamic quantities in strong-coupling regimes requires a nonperturbative\nknowledge of the bath dynamics, which in turn relies on heavy numerical\nsimulations. To tame these difficulties, considering thermal bosonic baths\nlinearly coupled to the open system, we derive expressions for heat, work, and\naverage system-bath interaction energy that only involve the autocorrelation\nfunction of the bath and two-time expectation values of system operators. We\nthen exploit the pseudomode approach, which replaces the physical continuous\nbosonic bath with a small finite number of damped, possibly interacting, modes,\nto numerically evaluate these relevant thermodynamic quantities. We show in\nparticular that this method allows for an efficient numerical evaluation of\nthermodynamic quantities in terms of one-time expectation values of the open\nsystem and the pseudomodes. We apply this framework to the investigation of two\nparadigmatic situations. In the first instance, we study the entropy production\nfor a two-level system coupled to an ohmic bath, simulated via interacting\npseudomodes, allowing for the presence of time-dependent driving. Secondly, we\nconsider a quantum thermal machine composed of a two-level system interacting\nwith two thermal baths at different temperatures, showing that an appropriate\nsinusoidal modulation of the coupling with the cold bath only is enough to\nobtain work extraction.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}