{"id":"2407.18460","title":"Large Nernst Effect in a layered metallic antiferromagnet EuAl$_2$Si$_2$","authors":"Kunya Yang, Wei Xia, Xinrun Mi, Yiyue zhang, Long zhang, Aifeng Wang,\n  Yisheng Chai, Xiaoyuan Zhou, Yanfeng Guo, and Mingquan He","authorsParsed":[["Yang","Kunya",""],["Xia","Wei",""],["Mi","Xinrun",""],["zhang","Yiyue",""],["zhang","Long",""],["Wang","Aifeng",""],["Chai","Yisheng",""],["Zhou","Xiaoyuan",""],["Guo","Yanfeng",""],["He","Mingquan",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 02:02:21 GMT"}],"updateDate":"2024-07-29","timestamp":1721959341000,"abstract":"  The large Nernst effect is advantageous for developing transverse Nernst\nthermoelectric generators or Ettingshausen coolers within a single component,\navoiding the complexity of electron- and hole-modules in longitudinal Seebeck\nthermoelectric devices. We report a large Nernst signal reaching 130 uV/K at 8\nK and 13 T in the layered metallic antiferromagnet EuAl$_2$Si$_2$. Notably,\nthis large transverse Nernst thermopower is two orders of magnitude greater\nthan its longitudinal counterpart. The Nernst coefficient peaks around 4 K and\n8 K at 3 T and 13 T, respectively. At similar temperatures, both the Hall\ncoefficient and the Seebeck signal change sign. Additionally, nearly\ncompensated electron- and hole-like carriers with high mobility ($\\sim$ 4000\ncm$^2$/Vs at 4 K) are revealed from the magnetoconductivity. These findings\nsuggest that the large Nernst effect and vanishing Seebeck thermopower in\nEuAl$_2$Si$_2$ are due to the compensated electron- and hole-like bands, along\nwith the high mobility of the Weyl band near the Fermi level. Our results\nunderscore the importance of band compensation and topological fermiology in\nachieving large Nernst thermopower and exploring potential Nernst\nthermoelectric applications at low temperatures.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}