{"id":"2407.01569","title":"VDAC Solvation Free Energy Calculation by a Nonuniform Size Modified\n  Poisson-Boltzmann Ion Channel Model","authors":"Liam Jemison, Matthew Stahl, Ranjan K. Dash, and Dexuan Xie","authorsParsed":[["Jemison","Liam",""],["Stahl","Matthew",""],["Dash","Ranjan K.",""],["Xie","Dexuan",""]],"versions":[{"version":"v1","created":"Sat, 25 May 2024 17:38:13 GMT"}],"updateDate":"2024-07-03","timestamp":1716658693000,"abstract":"  The Voltage-Dependent Anion Channel (VDAC) protein is the primary conduit for\nthe regulated passage of ions and metabolites into and out of mitochondria.\nCalculating its solvation free energy is crucial for understanding its\nstability, function, and interactions within the cellular environment. In this\npaper, we introduce a total solvation free energy, $E$, which is the sum of\nelectrostatic, ideal gas, and excess free energies, along with a non-polar\nenergy to yield a zero of $E$ in the absence of charges. We develop numerical\nschemes for computing $E$ and update the current mesh generation package to\naccelerate the generation of tetrahedral meshes and improve the quality of\nmeshes for computing $E$. By integrating these schemes and the updated mesh\npackage with our non-uniform size modified Poisson-Boltzmann ion channel\n(nuSMPBIC), SMPBIC, and PBIC finite element packages, the PDB2PQR package, and\nthe OPM database, we create the VDAC Solvation Free Energy Calculation (VSFEC)\npackage. Using the VSFEC package, we perform comparison tests on the nuSMPBIC,\nSMPBIC, and PBIC models by using six VDAC proteins and various ionic solutions\ncontaining up to four ionic species, including ATP$^{4-}$ and Ca$^{2+}$. We\nalso conduct tests with different neutral voltages and permittivity constants\nto explore the varying patterns of $E$. Our test results underscore the\nimportance of considering non-uniform ionic size effects and demonstrate the\nhigh performance of the VSFEC package in calculating the solvation free energy\nof VDAC proteins.\n","subjects":["Quantitative Biology/Biomolecules","Quantitative Biology/Quantitative Methods"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}