{"id":"2407.13762","title":"Large deviations of Dyson Brownian motion on the circle and multiradial\n  SLE0+","authors":"Osama Abuzaid, Vivian Olsiewski Healey, and Eveliina Peltola","authorsParsed":[["Abuzaid","Osama",""],["Healey","Vivian Olsiewski",""],["Peltola","Eveliina",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:58:14 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 13:59:50 GMT"}],"updateDate":"2024-08-12","timestamp":1721325494000,"abstract":"  The main motivation of the present work is to investigate the asymptotic\nbehavior as $\\kappa \\to 0+$ of multiradial Schramm-Loewner evolution,\nSLE$_\\kappa$. We show that this process with the common parameterization\nsatisfies a finite-time large deviation principle (LDP) in the Hausdorff metric\nwith non-negative rate function, the multiradial Loewner energy. We also\ncharacterize the large-time behavior of curves with finite energy and zero\nenergy (whose driving functions correspond to the trigonometric Calogero-Moser\nsystem).\n  The first half of this article is of independent interest regardless of SLE\ntheory. It is devoted to proving a finite-time LDP for Dyson Brownian motion on\nthe circle for a fixed number $n$ of particles as the coupling parameter\n$\\beta=8/\\kappa$ tends to $\\infty$. To our knowledge, in the literature large\ndeviations of Dyson Brownian motion has only been considered for fixed $\\beta$\nand as $n$ tends to $\\infty$. While the non-Lipschitz drift precludes the\napplication of the Freidlin-Wentzell theorem, we show that the rate function\nhas the same form as in Freidlin-Wentzell theory for diffusions with uniformly\nLipschitz drift.\n  In the second half of this article, we turn to proving an LDP for multiradial\nSLE$_\\kappa$. Here, the main technical difficulty is that the SLE$_\\kappa$\ncurves have a common target point, preventing the usual configurational, or\nglobal, approach. Instead, we make careful use of the contraction principle\nfrom the LDP for Dyson Brownian motion (proven in the first part of the\narticle), combined with topological results in Loewner theory: we show that\nfinite-energy multiradial Loewner hulls are always disjoint unions of simple\ncurves, except possibly at their common endpoint. A key to this is obtained\nfrom a derivative estimate for the radial Loewner map in terms of the energy of\nits driving function.\n","subjects":["Mathematics/Probability","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}