{"id":"2407.14024","title":"TTA-OOD: Test-time Augmentation for Improving Out-of-Distribution\n  Detection in Gastrointestinal Vision","authors":"Sandesh Pokhrel, Sanjay Bhandari, Eduard Vazquez, Tryphon Lambrou,\n  Prashnna Gyawali, Binod Bhattarai","authorsParsed":[["Pokhrel","Sandesh",""],["Bhandari","Sanjay",""],["Vazquez","Eduard",""],["Lambrou","Tryphon",""],["Gyawali","Prashnna",""],["Bhattarai","Binod",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 04:50:54 GMT"}],"updateDate":"2024-07-22","timestamp":1721364654000,"abstract":"  Deep learning has significantly advanced the field of gastrointestinal\nvision, enhancing disease diagnosis capabilities. One major challenge in\nautomating diagnosis within gastrointestinal settings is the detection of\nabnormal cases in endoscopic images. Due to the sparsity of data, this process\nof distinguishing normal from abnormal cases has faced significant challenges,\nparticularly with rare and unseen conditions. To address this issue, we frame\nabnormality detection as an out-of-distribution (OOD) detection problem. In\nthis setup, a model trained on In-Distribution (ID) data, which represents a\nhealthy GI tract, can accurately identify healthy cases, while abnormalities\nare detected as OOD, regardless of their class. We introduce a test-time\naugmentation segment into the OOD detection pipeline, which enhances the\ndistinction between ID and OOD examples, thereby improving the effectiveness of\nexisting OOD methods with the same model. This augmentation shifts the pixel\nspace, which translates into a more distinct semantic representation for OOD\nexamples compared to ID examples. We evaluated our method against existing\nstate-of-the-art OOD scores, showing improvements with test-time augmentation\nover the baseline approach.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"evg2OVfB8DfkmZn9WDGlAtezyAI8EsfM3-VsZbbKrv0","pdfSize":"1142243","objectId":"0x9a65e5ca0a6e6e59f00974eb5f9248aeeebc8acebc5ab1ca472f37d50b06e7fb","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
