{"id":"2407.01008","title":"Periodic domain inversion in single crystal barium titanate-on-insulator\n  thin film","authors":"Pragati Aashna, Hong-Lin Lin, Yu Cao, Yuhui Yin, Yuan Gao, Sakthi\n  Sanjeev Mohanraj, Di Zhu, and Aaron Danner","authorsParsed":[["Aashna","Pragati",""],["Lin","Hong-Lin",""],["Cao","Yu",""],["Yin","Yuhui",""],["Gao","Yuan",""],["Mohanraj","Sakthi Sanjeev",""],["Zhu","Di",""],["Danner","Aaron",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 06:44:53 GMT"}],"updateDate":"2024-07-02","timestamp":1719816293000,"abstract":"  We report experimentally achieving first-ever electric field periodic poling\nof single crystal barium titanate (BTO, or BaTiO3) thin film on insulator.\nOwing to the outstanding optical nonlinearities of BTO, this result is a key\nstep towards achieving quasi-phase-matching in BTO. We first grow the BTO thin\nfilm on a dysprosium scandate substrate using pulsed laser deposition with a\nthin layer of strontium ruthenate later serving as the bottom electrode for\npoling. We present characterization of the BTO thin film using x-ray\ndiffraction and piezo-response force microscopy to clearly demonstrate single\ncrystal, single domain growth of the film which enables the desired periodic\npoling. To investigate the poling quality, we apply both non-destructive piezo\nforce response microscopy and destructive etching-assisted scanning electron\nmicroscopy and we show that high quality, uniform and intransient poling with\n50 % duty cycle and periods ranging from 2 {\\mu}m to 10 {\\mu}m is achieved. The\nsuccessful realization of periodic poling in BTO thin film unlocks the\npotential for highly efficient nonlinear processes under quasi-phase-matching\nthat seemed far-fetched with prior polycrystalline BTO thin films which\npredominantly relied on efficiency-limited random or non-phase matching\nconditions and is a key step towards integration of BTO photonic devices.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}