{"id":"2407.20484","title":"Polarization Substructure in the Spiral-Dominated HH 111 Disk: Evidence\n  for Grain Growth","authors":"Chin-Fei Lee, Zhi-Yun Li, Tao-Chung Ching, Haifeng Yang, Shih-Ping\n  Lai, Zhe-Yu Daniel Lin, Ying-Chi Hu","authorsParsed":[["Lee","Chin-Fei",""],["Li","Zhi-Yun",""],["Ching","Tao-Chung",""],["Yang","Haifeng",""],["Lai","Shih-Ping",""],["Lin","Zhe-Yu Daniel",""],["Hu","Ying-Chi",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 01:09:20 GMT"}],"updateDate":"2024-07-31","timestamp":1722301760000,"abstract":"  The HH 111 protostellar disk has recently been found to host a pair of spiral\narms. Here we report the dust polarization results in the disk as well as the\ninner envelope around it, obtained with the Atacama Large\nMillimeter/submillimeter Array in continuum at lambda ~ 870 micron and ~ 0. 05\"\nresolution. In the inner envelope, polarization is detected with a polarization\ndegree of ~ 6% and an orientation almost everywhere parallel to the minor axis\nof the disk, and thus likely to be due to the dust grains magnetically aligned\nmainly by toroidal fields. In the disk, the polarization orientation is roughly\nazimuthal on the far side and becomes parallel to the minor axis on the near\nside, with a polarization gap in between on the far side near the central\nprotostar. The disk polarization degree is ~ 2%. The polarized intensity is\nhigher on the near side than the far side, showing a near-far side asymmetry.\nMore importantly, the polarized intensity and thus polarization degree are\nlower in the spiral arms, but higher in between the arms, showing an\nanticorrelation of the polarized intensity with the spiral arms. Our modeling\nresults indicate that this anticorrelation is useful for constraining the\npolarization mechanism and is consistent with the dust self-scattering by the\ngrains that have grown to a size of ~ 150 micron. The interarms are sandwiched\nand illuminated by two brighter spiral arms and thus have higher polarized\nintensity. Our dust self-scattering model can also reproduce the observed\npolarization orientation parallel to the minor axis on the near side and the\nobserved azimuthal polarization orientation at the two disk edges in the major\naxis.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}