{"id":"2407.17114","title":"A Self-Supervised Image Registration Approach for Measuring Local\n  Response Patterns in Metastatic Ovarian Cancer","authors":"In\\^es P. Machado, Anna Reithmeir, Fryderyk Kogl, Leonardo Rundo,\n  Gabriel Funingana, Marika Reinius, Gift Mungmeeprued, Zeyu Gao, Cathal\n  McCague, Eric Kerfoot, Ramona Woitek, Evis Sala, Yangming Ou, James Brenton,\n  Julia Schnabel, Mireia Crispin","authorsParsed":[["Machado","Inês P.",""],["Reithmeir","Anna",""],["Kogl","Fryderyk",""],["Rundo","Leonardo",""],["Funingana","Gabriel",""],["Reinius","Marika",""],["Mungmeeprued","Gift",""],["Gao","Zeyu",""],["McCague","Cathal",""],["Kerfoot","Eric",""],["Woitek","Ramona",""],["Sala","Evis",""],["Ou","Yangming",""],["Brenton","James",""],["Schnabel","Julia",""],["Crispin","Mireia",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 09:24:39 GMT"}],"updateDate":"2024-07-25","timestamp":1721813079000,"abstract":"  High-grade serous ovarian carcinoma (HGSOC) is characterised by significant\nspatial and temporal heterogeneity, typically manifesting at an advanced\nmetastatic stage. A major challenge in treating advanced HGSOC is effectively\nmonitoring localised change in tumour burden across multiple sites during\nneoadjuvant chemotherapy (NACT) and predicting long-term pathological response\nand overall patient survival. In this work, we propose a self-supervised\ndeformable image registration algorithm that utilises a general-purpose image\nencoder for image feature extraction to co-register contrast-enhanced\ncomputerised tomography scan images acquired before and after neoadjuvant\nchemotherapy. This approach addresses challenges posed by highly complex tumour\ndeformations and longitudinal lesion matching during treatment. Localised\ntumour changes are calculated using the Jacobian determinant maps of the\nregistration deformation at multiple disease sites and their macroscopic areas,\nincluding hypo-dense (i.e., cystic/necrotic), hyper-dense (i.e., calcified),\nand intermediate density (i.e., soft tissue) portions. A series of experiments\nis conducted to understand the role of a general-purpose image encoder and its\napplication in quantifying change in tumour burden during neoadjuvant\nchemotherapy in HGSOC. This work is the first to demonstrate the feasibility of\na self-supervised image registration approach in quantifying NACT-induced\nlocalised tumour changes across the whole disease burden of patients with\ncomplex multi-site HGSOC, which could be used as a potential marker for ovarian\ncancer patient's long-term pathological response and survival.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}