{"id":"2407.18503","title":"Homomorphic Encryption-Enabled Federated Learning for Privacy-Preserving\n  Intrusion Detection in Resource-Constrained IoV Networks","authors":"Bui Duc Manh, Chi-Hieu Nguyen, Dinh Thai Hoang, and Diep N. Nguyen","authorsParsed":[["Manh","Bui Duc",""],["Nguyen","Chi-Hieu",""],["Hoang","Dinh Thai",""],["Nguyen","Diep N.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 04:19:37 GMT"}],"updateDate":"2024-07-29","timestamp":1721967577000,"abstract":"  This paper aims to propose a novel framework to address the data privacy\nissue for Federated Learning (FL)-based Intrusion Detection Systems (IDSs) in\nInternet-of-Vehicles(IoVs) with limited computational resources. In particular,\nin conventional FL systems, it is usually assumed that the computing nodes have\nsufficient computational resources to process the training tasks. However, in\npractical IoV systems, vehicles usually have limited computational resources to\nprocess intensive training tasks, compromising the effectiveness of deploying\nFL in IDSs. While offloading data from vehicles to the cloud can mitigate this\nissue, it introduces significant privacy concerns for vehicle users (VUs). To\nresolve this issue, we first propose a highly-effective framework using\nhomomorphic encryption to secure data that requires offloading to a centralized\nserver for processing. Furthermore, we develop an effective training algorithm\ntailored to handle the challenges of FL-based systems with encrypted data. This\nalgorithm allows the centralized server to directly compute on quantum-secure\nencrypted ciphertexts without needing decryption. This approach not only\nsafeguards data privacy during the offloading process from VUs to the\ncentralized server but also enhances the efficiency of utilizing FL for IDSs in\nIoV systems. Our simulation results show that our proposed approach can achieve\na performance that is as close to that of the solution without encryption, with\na gap of less than 0.8%.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1Ups3FfwAT_k9t7kdnJU7-jGUCl0h56AXgCyoWjmIPw","pdfSize":"1682858"}
