{"id":"2407.04089","title":"A Parameter Study of the Electromagnetic Signatures of an Analytical\n  Mini-Disk Model for Supermassive Binary Black Hole Systems","authors":"Kaitlyn Porter, Scott C. Noble, Eduardo M. Gutierrez, Joaquin Pelle,\n  Manuela Campanelli, Jeremy Schnittman, Bernard J. Kelly","authorsParsed":[["Porter","Kaitlyn",""],["Noble","Scott C.",""],["Gutierrez","Eduardo M.",""],["Pelle","Joaquin",""],["Campanelli","Manuela",""],["Schnittman","Jeremy",""],["Kelly","Bernard J.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 17:58:26 GMT"}],"updateDate":"2024-07-08","timestamp":1720115906000,"abstract":"  Supermassive black holes (SMBHs) are thought to be located at the centers of\nmost galactic nuclei. When galaxies merge they form supermassive black hole\nbinary (SMBHB) systems and these central SMBHs will also merge at later times,\nproducing gravitational waves (GWs). Because galaxy mergers are likely gas-rich\nenvironments, SMBHBs are also potential sources of electromagnetic (EM)\nradiation. The EM signatures depend on gas dynamics, orbital dynamics, and\nradiation processes. The gas dynamics are governed by general relativistic\nmagnetohydrodynamics (MHD) in a time-dependent spacetime. Numerically solving\nthe MHD equations for a time-dependent binary spacetime is computationally\nexpensive. Therefore, it is challenging to conduct a full exploration of the\nparameter space of these systems and the resulting EM signatures. We have\ndeveloped an analytical accretion disk model for the mini-disks of an SMBHB\nsystem and produced images and light curves using a general relativistic\nray-tracing code and a superimposed harmonic binary black hole metric. This\nanalytical model greatly reduces the time and computational resources needed to\nexplore these systems, while incorporating some key information from\nsimulations. We present a parameter space exploration of the SMBHB system in\nwhich we have studied the dependence of the EM signatures on the spins of the\nblack holes (BHs), the mass ratio, the accretion rate, the viewing angle, and\nthe initial binary separation. Additionally, we study how the commonly used\nfast-light approximation affects the EM signatures and evaluate its validity in\nGRMHD simulations.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}