{"id":"2407.08555","title":"SLoRD: Structural Low-Rank Descriptors for Shape Consistency in\n  Vertebrae Segmentation","authors":"Xin You, Yixin Lou, Minghui Zhang, Jie Yang, Nassir Navab, Yun Gu","authorsParsed":[["You","Xin",""],["Lou","Yixin",""],["Zhang","Minghui",""],["Yang","Jie",""],["Navab","Nassir",""],["Gu","Yun",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:39:54 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 14:58:28 GMT"}],"updateDate":"2024-09-20","timestamp":1720708794000,"abstract":"  Automatic and precise multi-class vertebrae segmentation from CT images is\ncrucial for various clinical applications. However, due to a lack of explicit\nconsistency constraints, existing methods especially for single-stage methods,\nstill suffer from the challenge of intra-vertebrae segmentation inconsistency,\nwhich refers to multiple label predictions inside a singular vertebra. For\nmulti-stage methods, vertebrae detection serving as the first step, tends to be\naffected by the pathology and metal implants. Thus, imprecise detections cause\nbiased patches before segmentation, which then leads to inaccurate contour\ndelineation and inconsistent segmentation. In our work, we intend to label\nindividual and complete binary masks to address that challenge. Specifically, a\ncontour generation network is proposed based on Structural Low-Rank Descriptors\nfor shape consistency, termed SLoRD. For a structural representation of\nvertebral contours, we adopt the spherical coordinate system and devise the\nspherical centroid to calculate contour descriptors. Due to vertebrae's similar\nappearances, basic contour descriptors can be acquired to restore original\ncontours. Therefore, SLoRD leverages these contour priors and explicit shape\nconstraints to facilitate regressed contour points close to vertebral surfaces.\nQuantitative and qualitative evaluations on VerSe 2019 and 2020 demonstrate the\nsuperior performance of our framework over other single-stage and multi-stage\nstate-of-the-art (SOTA) methods. Further, SLoRD is a plug-and-play framework to\nrefine the segmentation inconsistency existing in coarse predictions from other\napproaches.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}