{"id":"2407.00918","title":"Robust and Reliable Early-Stage Website Fingerprinting Attacks via\n  Spatial-Temporal Distribution Analysis","authors":"Xinhao Deng, Qi Li, Ke Xu","authorsParsed":[["Deng","Xinhao",""],["Li","Qi",""],["Xu","Ke",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 02:51:26 GMT"}],"updateDate":"2024-07-02","timestamp":1719802286000,"abstract":"  Website Fingerprinting (WF) attacks identify the websites visited by users by\nperforming traffic analysis, compromising user privacy. Particularly, DL-based\nWF attacks demonstrate impressive attack performance. However, the\neffectiveness of DL-based WF attacks relies on the collected complete and pure\ntraffic during the page loading, which impacts the practicality of these\nattacks. The WF performance is rather low under dynamic network conditions and\nvarious WF defenses, particularly when the analyzed traffic is only a small\npart of the complete traffic. In this paper, we propose Holmes, a robust and\nreliable early-stage WF attack. Holmes utilizes temporal and spatial\ndistribution analysis of website traffic to effectively identify websites in\nthe early stages of page loading. Specifically, Holmes develops adaptive data\naugmentation based on the temporal distribution of website traffic and utilizes\na supervised contrastive learning method to extract the correlations between\nthe early-stage traffic and the pre-collected complete traffic. Holmes\naccurately identifies traffic in the early stages of page loading by computing\nthe correlation of the traffic with the spatial distribution information, which\nensures robust and reliable detection according to early-stage traffic. We\nextensively evaluate Holmes using six datasets. Compared to nine existing\nDL-based WF attacks, Holmes improves the F1-score of identifying early-stage\ntraffic by an average of 169.18%. Furthermore, we replay the traffic of\nvisiting real-world dark web websites. Holmes successfully identifies dark web\nwebsites when the ratio of page loading on average is only 21.71%, with an\naverage precision improvement of 169.36% over the existing WF attacks.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}