{"id":"2407.10157","title":"SACNet: A Spatially Adaptive Convolution Network for 2D Multi-organ\n  Medical Segmentation","authors":"Lin Zhang, Wenbo Gao, Jie Yi, Yunyun Yang","authorsParsed":[["Zhang","Lin",""],["Gao","Wenbo",""],["Yi","Jie",""],["Yang","Yunyun",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 10:58:09 GMT"}],"updateDate":"2024-07-16","timestamp":1720954689000,"abstract":"  Multi-organ segmentation in medical image analysis is crucial for diagnosis\nand treatment planning. However, many factors complicate the task, including\nvariability in different target categories and interference from complex\nbackgrounds. In this paper, we utilize the knowledge of Deformable Convolution\nV3 (DCNv3) and multi-object segmentation to optimize our Spatially Adaptive\nConvolution Network (SACNet) in three aspects: feature extraction, model\narchitecture, and loss constraint, simultaneously enhancing the perception of\ndifferent segmentation targets. Firstly, we propose the Adaptive Receptive\nField Module (ARFM), which combines DCNv3 with a series of customized\nblock-level and architecture-level designs similar to transformers. This module\ncan capture the unique features of different organs by adaptively adjusting the\nreceptive field according to various targets. Secondly, we utilize ARFM as\nbuilding blocks to construct the encoder-decoder of SACNet and partially share\nparameters between the encoder and decoder, making the network wider rather\nthan deeper. This design achieves a shared lightweight decoder and a more\nparameter-efficient and effective framework. Lastly, we propose a novel\ncontinuity dynamic adjustment loss function, based on t-vMF dice loss and\ncross-entropy loss, to better balance easy and complex classes in segmentation.\nExperiments on 3D slice datasets from ACDC and Synapse demonstrate that SACNet\ndelivers superior segmentation performance in multi-organ segmentation tasks\ncompared to several existing methods.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Tu1hU-Ey3mZcrpv16VNITw8-X8bAeJyBo5jGHroklT0","pdfSize":"1460341"}
