{"id":"2407.06749","title":"Real-time Tracking in a Status Update System with an Imperfect Feedback\n  Channel","authors":"Saeid Sadeghi Vilni, Abolfazl Zakeri, Mohammad Moltafet, and Marian\n  Codreanu","authorsParsed":[["Vilni","Saeid Sadeghi",""],["Zakeri","Abolfazl",""],["Moltafet","Mohammad",""],["Codreanu","Marian",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 10:53:28 GMT"}],"updateDate":"2024-07-10","timestamp":1720522408000,"abstract":"  We consider a status update system consisting of a finite-state Markov\nsource, an energy-harvesting-enabled transmitter, and a sink. The forward and\nfeedback channels between the transmitter and the sink are error-prone. We\nstudy the problem of minimizing the long-term time average of a (generic)\ndistortion function subject to an energy causality constraint. Since the\nfeedback channel is error-prone, the transmitter has only partial knowledge\nabout the transmission results and, consequently, about the estimate of the\nsource state at the sink. Therefore, we model the problem as a partially\nobservable Markov decision process (POMDP), which is then cast as a belief-MDP\nproblem. The infinite belief space makes solving the belief-MDP difficult.\nThus, by exploiting a specific property of the belief evolution, we truncate\nthe state space and formulate a finite-state MDP problem, which is then solved\nusing the relative value iteration algorithm (RVIA). Furthermore, we propose a\nlow-complexity transmission policy in which the belief-MDP problem is\ntransformed into a sequence of per-slot optimization problems. Simulation\nresults show the effectiveness of the proposed policies and their superiority\ncompared to a baseline policy. Moreover, we numerically show that the proposed\npolicies have switching-type structures.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"ZkwdiiSHxbrQGbCNsjmTSHw0qAkcEOiDuAHx2FcWriU","pdfSize":"667211"}
