{"id":"2407.18097","title":"SSTD: Stripe-Like Space Target Detection Using Single-Point Weak\n  Supervision","authors":"Zijian Zhu, Ali Zia, Xuesong Li, Bingbing Dan, Yuebo Ma, Enhai Liu,\n  Rujin Zhao","authorsParsed":[["Zhu","Zijian",""],["Zia","Ali",""],["Li","Xuesong",""],["Dan","Bingbing",""],["Ma","Yuebo",""],["Liu","Enhai",""],["Zhao","Rujin",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 15:02:24 GMT"},{"version":"v2","created":"Mon, 16 Sep 2024 05:07:54 GMT"}],"updateDate":"2024-09-17","timestamp":1721919744000,"abstract":"  Stripe-like space target detection (SSTD) plays a key role in enhancing space\nsituational awareness and assessing spacecraft behaviour. This domain faces\nthree challenges: the lack of publicly available datasets, interference from\nstray light and stars, and the variability of stripe-like targets, which makes\nmanual labeling both inaccurate and labor-intensive. In response, we introduces\n`AstroStripeSet', a pioneering dataset designed for SSTD, aiming to bridge the\ngap in academic resources and advance research in SSTD. Furthermore, we propose\na novel teacher-student label evolution framework with single-point weak\nsupervision, providing a new solution to the challenges of manual labeling.\nThis framework starts with generating initial pseudo-labels using the zero-shot\ncapabilities of the Segment Anything Model (SAM) in a single-point setting.\nAfter that, the fine-tuned StripeSAM serves as the teacher and the newly\ndeveloped StripeNet as the student, consistently improving segmentation\nperformance through label evolution, which iteratively refines these labels. We\nalso introduce `GeoDice', a new loss function customized for the linear\ncharacteristics of stripe-like targets. Extensive experiments show that our\nmethod matches fully supervised approaches, exhibits strong zero-shot\ngeneralization for diverse space-based and ground-based real-world images, and\nsets a new state-of-the-art (SOTA) benchmark. Our AstroStripeSet dataset and\ncode will be made publicly available.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}