{"id":"2407.17407","title":"Systematic study of High $E_J/E_C$ transmon qudits up to $d = 12$","authors":"Z. Wang, R. W. Parker, E. Champion, M. S. Blok","authorsParsed":[["Wang","Z.",""],["Parker","R. W.",""],["Champion","E.",""],["Blok","M. S.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 16:42:58 GMT"}],"updateDate":"2024-07-25","timestamp":1721839378000,"abstract":"  Qudits provide a resource-efficient alternative to qubits for quantum\ninformation processing. The multilevel nature of the transmon, with its\nindividually resolvable transition frequencies, makes it an attractive platform\nfor superconducting circuit-based qudits. In this work, we systematically\nanalyze the trade-offs associated with encoding high-dimensional quantum\ninformation in fixed-frequency transmons. Designing high $E_J/E_C$ ratios of up\nto 325, we observe up to 12 levels ($d=12$) on a single transmon. Despite the\ndecreased anharmonicity, we demonstrate process infidelities $e_f < 3 \\times\n10^{-3}$ for qubit-like operations in each adjacent-level qubit subspace in the\nlowest 10 levels. Furthermore, we achieve a 10-state readout assignment\nfidelity of 93.8% with the assistance of deep neural network classification of\na multi-tone dispersive measurement. We find that the Hahn echo time $T_{2E}$\nfor the higher levels is close to the limit of $T_1$ decay, primarily limited\nby bosonic enhancement. We verify the recently introduced Josephson harmonics\nmodel, finding that it yields better predictions for the transition frequencies\nand charge dispersion. Finally, we show strong $ZZ$-like coupling between the\nhigher energy levels in a two-transmon system. Our high-fidelity control and\nreadout methods, in combination with our comprehensive characterization of the\ntransmon model, suggest that the high-$E_J/E_C$ transmon is a powerful tool for\nexploring excited states in circuit quantum electrodynamics.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}