{"id":"2407.12757","title":"Nanoscale ferroelectric programming of van der Waals heterostructures","authors":"Dengyu Yang, Qingrui Cao, Erin Akyuz, John Hayden, Josh Nordlander,\n  Muqing Yu, Ranjani Ramachandran, Patrick Irvin, Jon-Paul Maria, Benjamin M.\n  Hunt and Jeremy Levy","authorsParsed":[["Yang","Dengyu",""],["Cao","Qingrui",""],["Akyuz","Erin",""],["Hayden","John",""],["Nordlander","Josh",""],["Yu","Muqing",""],["Ramachandran","Ranjani",""],["Irvin","Patrick",""],["Maria","Jon-Paul",""],["Hunt","Benjamin M.",""],["Levy","Jeremy",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 17:30:31 GMT"}],"updateDate":"2024-07-18","timestamp":1721237431000,"abstract":"  The ability to create superlattices in van der Waals (vdW) heterostructures\nvia moir\\'e interference heralded a new era in the science and technology of\ntwo-dimensional materials. Through precise control of the twist angle, flat\nbands and strongly correlated phases have been engineered. The precise twisting\nof vdW layers is in some sense a bottom-up approach--a single parameter can\ndial in a wide range of periodic structures. Here, we describe a top-down\napproach to engineering nanoscale potentials in vdW layers using a buried\nprogrammable ferroelectric layer. Ultra-low-voltage electron beam lithography\n(ULV-EBL) is used to program ferroelectric domains in a ferroelectric\nAl_{1-x}B_{x}N thin film through a graphene/hexagonal boron nitride (hBN)\nheterostructure that is transferred on top. We demonstrate ferroelectric field\neffects by creating a lateral p-n junction, and demonstrate spatial resolution\ndown to 35 nm, limited by the resolution of our scanned probe characterization\nmethods. This innovative, resist-free patterning method is predicted to achieve\n10 nm resolution and enable arbitrary programming of vdW layers, opening a\npathway to create new phases that are inaccessible by moir\\'e techniques. The\nability to \"paint\" different phases of matter on a single vdW \"canvas\" provides\na wealth of new electronic and photonic functionalities.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}