{"id":"2407.09917","title":"Transonic shock solutions for steady 3-D axisymmetric full Euler flows\n  with large swirl velocity","authors":"Beixiang Fang, Xin Gao, Wei Xiang, Qin Zhao","authorsParsed":[["Fang","Beixiang",""],["Gao","Xin",""],["Xiang","Wei",""],["Zhao","Qin",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 15:27:08 GMT"}],"updateDate":"2024-07-16","timestamp":1720884428000,"abstract":"  This paper is concerned with the existence and location of three-dimensional\naxisymmetric transonic shock with large swirl velocity for solutions of the\nsteady compressible full Euler system in a cylindrical nozzle with prescribed\nreceiver pressure. Special non-trivial shock solutions with large vorticity are\nfirst constructed by considering arbitrarily given non-zero swirl functions.\nThen the existence and locations of the transonic shock solutions to the full\nEuler equations are achieved under small perturbations on the special shock\nsolutions with appropriate boundary conditions on the entrance of the nozzle\nand the receiver pressure at the exit. Moreover, within the proof, fundamental\ncontributions of the non-zero swirl velocity in determining the position of the\nshock front are investigated. Mathematically, it can be formulated as a free\nboundary value problem with the shock front as the free boundary, whose\nsolution states are a perturbation of non-trivial background solutions, and\nwith a singularity at the axis-symmetry. Because the shock location can be\narbitrary for the special shock solutions, approximate shock solutions of a\nfree boundary problem for a specific linearized Euler system are constructed\nand an iteration scheme is designed around the approximate shock solution with\na perturbation of higher order. As far as we know, it is the first mathematical\nresult on the three-dimensional transonic shock with either large vorticity or\nlarge swirl velocity. New ideas and methods introduced in this paper will be\nalso helpful for other problems with similar difficulties.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}