{"id":"2407.13307","title":"Conformal Performance Range Prediction for Segmentation Output Quality\n  Control","authors":"Anna M. Wundram, Paul Fischer, Michael Muehlebach, Lisa M. Koch and\n  Christian F. Baumgartner","authorsParsed":[["Wundram","Anna M.",""],["Fischer","Paul",""],["Muehlebach","Michael",""],["Koch","Lisa M.",""],["Baumgartner","Christian F.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:10:25 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 07:12:39 GMT"}],"updateDate":"2024-08-30","timestamp":1721293825000,"abstract":"  Recent works have introduced methods to estimate segmentation performance\nwithout ground truth, relying solely on neural network softmax outputs. These\ntechniques hold potential for intuitive output quality control. However, such\nperformance estimates rely on calibrated softmax outputs, which is often not\nthe case in modern neural networks. Moreover, the estimates do not take into\naccount inherent uncertainty in segmentation tasks. These limitations may\nrender precise performance predictions unattainable, restricting the practical\napplicability of performance estimation methods. To address these challenges,\nwe develop a novel approach for predicting performance ranges with statistical\nguarantees of containing the ground truth with a user specified probability.\nOur method leverages sampling-based segmentation uncertainty estimation to\nderive heuristic performance ranges, and applies split conformal prediction to\ntransform these estimates into rigorous prediction ranges that meet the desired\nguarantees. We demonstrate our approach on the FIVES retinal vessel\nsegmentation dataset and compare five commonly used sampling-based uncertainty\nestimation techniques. Our results show that it is possible to achieve the\ndesired coverage with small prediction ranges, highlighting the potential of\nperformance range prediction as a valuable tool for output quality control.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Y8407DpYFZCYyVvrIgtmkH0_G0clqqU04Enx1BVSHBE","pdfSize":"2120221"}
