{"id":"2407.16784","title":"A Sub-solar Fe/O, logT~7.5 Gas Component Permeating the Milky Way's CGM","authors":"Armando Lara-DI, Yair Krongold, Smita Mathur, Sanskriti Das, Anjali\n  Gupta, O. Segura Montero","authorsParsed":[["Lara-DI","Armando",""],["Krongold","Yair",""],["Mathur","Smita",""],["Das","Sanskriti",""],["Gupta","Anjali",""],["Montero","O. Segura",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 18:34:09 GMT"}],"updateDate":"2024-07-25","timestamp":1721759649000,"abstract":"  Our study focuses on characterizing the highly ionized gas within the Milky\nWay's (MW) Circumgalactic Medium (CGM) that gives rise to ionic transitions in\nthe X-ray band 2 - 25 \\AA. Utilizing stacked \\Chandra/\\ACISS\\ \\MEG\\ and \\LETG\\\nspectra toward QSO sightlines, we employ the self-consistent hybrid ionization\ncode PHASE to model our data. The stacked spectra are optimally described by\nthree distinct gas phase components: a \\warm\\ (\\logT\\ $\\sim$ 5.5), \\warmhot\\\n(\\logT\\ $\\sim 6$), and \\hot\\ (\\logT\\ $\\sim$ 7.5) components. These findings\nconfirm the presence of the \\hot\\ component in the MW's CGM indicating its\ncoexistence with a \\warm\\ and a \\warmhot\\ gas phases. We find this \\hot\\\ncomponent to be homogeneous in temperature but inhomogeneous in column density.\nThe gas in the \\hot\\ component requires over-abundances relative to solar to be\nconsistent with the Dispersion Measure (DM) from the Galactic halo reported in\nthe literature. {For the hot phase we estimated a DM = $55.1^{+29.9}_{-23.7}$\npc cm$^{-3}$}. We conclude that this phase is either enriched in Oxygen,\nSilicon, and Sulfur, or has metallicity {over 6} times solar value, or a\ncombination of both. We do not detect Fe L-shell absorption lines, implying\nO/Fe $\\geq$ 4. The non-solar abundance ratios found in the super-virial gas\ncomponent in the Galactic halo suggest that this phase arises from Galactic\nfeedback.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}