{"id":"2407.17528","title":"Interacting Null Sources in Different Geometries","authors":"Chia-Li Hsieh","authorsParsed":[["Hsieh","Chia-Li",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:31:01 GMT"}],"updateDate":"2024-07-26","timestamp":1721755861000,"abstract":"  We introduce basic mathematical techniques, followed by an exploration of\nthree distinct topics: the Callan-Giddings-Harvey-Strominger (CGHS) model in\n1+1-dimensional spacetime, the formation of astrophysical jets in\nSchwarzschild-like black holes, and collisions and confinement phenomena in the\nthird-order Lovelock gravity.\n  In the CGHS model, we investigate the collision of ghost fields within the\ndilaton background geometry, observing the formation and dissolution of\nwormholes by inserting and removing the ghost fields, respectively. This\nprocess mimics a cosmological-scale analogue of Feynman diagrams.\n  Next, we study the non-zero expectation values of bumblebee fields due to\nLorentz symmetry breaking. This alteration in the energy-momentum tensor\nnecessitates the inclusion of a potential vacuum, resulting in a shift of the\nvacuum solution towards Schwarzchild-like black holes with a scaling factor\n$l$. This scaling factor facilitates discussions on the collision of null\nsources, leading to the formation of impulsive null shells and satisfying the\ntype-D condition. When $l$ approaches zero, jet-like formations vanish,\ntransforming the problem into one involving colliding gravitational waves,\nwhich is isometric to the Schwarzschild geometry. Moreover, our method can be\napplied to any resembling Schwarzschild-like metrics. We aim to enhance our\nmodel by incorporating additional physical factors such as extra polarizations\nor EM fields.\n  Finally, our examination extends to the 4-dimensional third-order Lovelock\ngravity, observing that particles possess finite energy and be confined within\nthe metric time interval extending from - to + infinity. Moreover, this finding\ndoes not admit flat rotation curves. Additionally, when collisions occur within\nthe background of this metric, intriguingly, we observe impulsive Weyl\ncurvatures along the null boundaries subsequent to the collision.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QP-ZeH420kGhb8bT6HzIBITOL5muM-19oGrd0iQXKdo","pdfSize":"2579734","objectId":"0xbcd74feb0e0546c6ffa517720e158481a4fdac6056e5d54dcfd3d7004fb447ff","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
