{"id":"2407.09689","title":"Heavy-hole spin relaxation in quantum dots: Isotropic versus anisotropic\n  effects","authors":"Dalton Forbes, Sanjay Prabhakar, Ruma De, Himadri S. Chakraborty, and\n  Roderick Melnik","authorsParsed":[["Forbes","Dalton",""],["Prabhakar","Sanjay",""],["De","Ruma",""],["Chakraborty","Himadri S.",""],["Melnik","Roderick",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 21:18:14 GMT"}],"updateDate":"2024-07-16","timestamp":1720819094000,"abstract":"  Non-charge based logic in single-hole spin of semiconductor quantum dots\n(QDs) can be controlled by anisotropic gate potentials providing a notion for\nmaking next generation solid-state quantum devices. In this study, we\ninvestigate the isotropic and anisotropic behavior of phonon mediated spin\nrelaxation of heavy-hole spin hot spots in QDs. For the electron spin in\nisotropic QDs, hot spots are known to be always present due to the Rashba\nspin-orbit coupling. But for heavy holes in isotropic dots, we show that the\noccurrences of spin hot spots are sensitive to the bulk g-factor. The hot spot\nfor Rashba coupling in InAs and GaSb dots arises because these materials\npossess negative bulk g-factor, while that for the Dresselhaus coupling in GaAs\nand InSb dots is found due to their positive bulk g-factor. For anisotropic\nQDs, on the other hand, the spin hot spot is universally present due to their\nbroken in-plane rotational symmetry. Further, the increasing electric field,\nthat strengthens the Rashba coupling, is shown to cover a wide range of\nmagnetic field by the hot spots. Results demonstrate that the magnetic field,\nchoice of dot materials and size anisotropy can act as effective control\nparameters which can be experimentally used to design the device for detecting\nthe phonon mediated heavy-hole spin-relaxation behavior of III-V semiconductor\nQDs.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"e0_iSa8MQlMaWay8_idyS4gFzingMg4ixTqERXXtNi0","pdfSize":"6786469","objectId":"0x657c0c8eaed11e936ec5a97164d99a9853621faf858556ad74256c85a1c40df2","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
