{"id":"2407.11154","title":"Pattern speed evolution of barred galaxies in TNG50","authors":"Marcin Semczuk, Walter Dehnen, Ralph Sch\\\"onrich, E. Athanassoula","authorsParsed":[["Semczuk","Marcin",""],["Dehnen","Walter",""],["Schönrich","Ralph",""],["Athanassoula","E.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:24:28 GMT"}],"updateDate":"2024-07-17","timestamp":1721067868000,"abstract":"  Galactic bars are found in the majority of disc galaxies. They rotate nearly\nrigidly with an angular frequency called pattern speed. Previous idealised\nsimulations have shown that bar pattern speed decreases with time due to\ndynamical friction exerted by the dark matter halo, while cold gas can reduce\nor even reverse this trend. We want to understand how different galaxy\nproperties affect the evolution of the bar pattern speed in more realistic\nsituations, including ongoing star formation, mass infall, AGN feedback and\ngalaxy interactions. We used the high-resolution run TNG50-1 of the\nmagnetohydrodynamical cosmological simulations suite IllustrisTNG to trace the\npattern speed of simulated bars and see how it depends on various galaxy\nproperties. Simulated bars with initially high pattern speed and a subsequent\nrapid slowdown are more likely found in more massive galaxies. Lower mass\ngalaxies, on the other hand, preferentially host bars that start at relatively\nlow pattern speeds and retain the same value until the end of the simulation.\nMore massive barred galaxies are also more affected by the AGN feedback, which\nremoves (or heats up) the cold gas that could have prevented the slowdown. We\nfind that bars grow and strengthen with slowdown, in agreement with higher\nresolution simulations. We find that strong correlations between the bar\nslowdown rate and galaxy mass weaken considerably when we use dimensionless\nmeasures to quantify the slowdown. In TNG50, the AGN feedback prescription\namplifies the mass dependence. Turned around, this provides an interesting\nstatistic to constrain subgrid physics by bar growth/slowing.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}