{"id":"2407.07730","title":"Another reason why normalized gain should continue to be used to analyze\n  concept inventories (and estimate learning rates)","authors":"Jairo Navarrete, Valentina Giaconi, Gonzalo Contador, Mariano Vazquez","authorsParsed":[["Navarrete","Jairo",""],["Giaconi","Valentina",""],["Contador","Gonzalo",""],["Vazquez","Mariano",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:03:30 GMT"}],"updateDate":"2024-07-11","timestamp":1720623810000,"abstract":"  A transformation called normalized gain (ngain) has been acknowledged as one\nof the most common measures of knowledge growth in pretest-posttest contexts in\nphysics education research. Recent studies in math education have shown that\nngains can also be applied to assess learners' ability to acquire unfamiliar\nknowledge, that is, to estimate their \"learning rate\". This quantity is\nestimated from learning data through two well-known methods: computing the\naverage ngain of the group or computing the ngain of the average learner. These\ntwo methods commonly yield different results, and prior research has concluded\nthat the difference between them is associated with a pretest-ngains\ncorrelation. Such a correlation would suggest a bias of this learning\nmeasurement because it implies its favoring of certain subgroups of students\naccording to their performance in pretest measurements. The present study\nanalyzes these two estimation methods by drawing on statistical models. Our\nresults show that the two estimation methods are equivalent when no measurement\nerrors exist. In contrast, when there are measurement errors, the first method\nprovides a biased estimator, whereas the second one provides an unbiased\nestimator. Furthermore, these measurement errors induce a spurious correlation\nbetween the pretest and ngain scores. Our results seem consistent with prior\nresearch, except they show that measurement errors in pretest and posttest\nscores are the source of a spurious pretest-ngain correlation. Consequently,\nestimating learning rates might effectively provide unbiased estimates of\nknowledge change that control for the effect of prior knowledge even in the\npresence of pretest-ngain correlations.\n","subjects":["Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}