{"id":"2407.19143","title":"Effect of lattice relaxation on electronic spectra of helically twisted\n  trilayer graphene: Large-scale atomistic simulation approach","authors":"Joonho Jang","authorsParsed":[["Jang","Joonho",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 01:30:31 GMT"}],"updateDate":"2024-07-30","timestamp":1722043831000,"abstract":"  Twisted trilayer graphene hosts two moir\\'e superlattices originating from\ntwo interfaces between graphene layers. However, the system is generally\nunstable to lattice relaxation at small twist angles and is expected to show a\nsignificantly modified electronic band structure. In particular, a helical\ntrilayer graphene - whose two twisted angles have the same sign - provides an\nattractive platform with a flat band isolated by large energy gaps near the\nmagic angle, but the interplay between the lattice and the electronic degrees\nof freedom is not well understood. Here, we performed a large-scale molecular\ndynamics simulation to study the lattice relaxation of helical trilayer\ngraphenes and evaluated their electronic spectra with a tight-binding model\ncalculation. The comparison of the electronic spectra both with and without the\nlattice relaxation reveals how the lattice relaxation significantly modifies\nthe electronic spectra particularly near the charge neutrality point. We also\ninvestigated the local density of states to visualize the spatially-varying\nelectronic spectra that accords with domain patterns of moir\\'e lattice\nstackings. We propose these characteristic spectral features in the electronic\ndegrees of freedom of a relaxed helical trilayer graphene to be confirmed by\nscanning probe techniques, such as scanning single-electron transistors and\nscanning tunneling microscopes.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6fNWS6iqIXO825_1d1798KlLjV3Fdxl9-4s2w75m7N0","pdfSize":"1639455"}
