{"id":"2407.13049","title":"Emerging Quadrature Lattices of Kerr Combs","authors":"Eran Lustig, Melissa A. Guidry, Daniil M. Lukin, Shanhui Fan and\n  Jelena Vuckovic","authorsParsed":[["Lustig","Eran",""],["Guidry","Melissa A.",""],["Lukin","Daniil M.",""],["Fan","Shanhui",""],["Vuckovic","Jelena",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 23:30:07 GMT"}],"updateDate":"2024-07-19","timestamp":1721259007000,"abstract":"  A quadrature lattice is a coupled array of squeezed vacuum field quadratures\nthat offers new avenues in shaping the quantum properties of multimode light\n[1-3]. Such lattices are described within the framework of non-Hermitian,\nnon-dissipative physics and exhibit intriguing lattice phenomena such as\nlattice exceptional points, edge-states, entanglement and non-Hermitian skin\neffect, offering fundamentally new methods for controlling quantum fluctuations\n[1, 4]. Nonlinear resonators are suitable for studying multimode\npair-generation processes and squeezing which are non-dissipative in \\chi(2)\nand \\chi(3) materials [5-12], but observing non-Hermitian lattice phenomena in\nphotonic quadrature lattices was not achieved. Remarkably, in dissipative Kerr\nmicrocombs [13], which have revolutionized photonic technology, such lattices\nemerge and govern the quantum noise that leads to comb formation. Thus, they\noffer a unique opportunity to realize quadrature lattices, and to study and\nmanipulate multimode quantum noise which is essential for any quantum\ntechnology. Here, we experimentally study non-Hermitian lattice effects in\nphotonic quadrature lattices for the first time. Our photonic quadrature\nlattices emerge at Kerr microcomb transitions, allowing us to observe\nfundamental connections between dispersion symmetry, frequency-dependent\nsqueezed supermodes, and non-Hermitian lattice physics in an integrated setup.\nOur work unifies two major fields, quantum non-Hermitian physics and Kerr\ncombs, and opens the door to utilizing dissipative Kerr combs to experimentally\nexplore rich non-Hermitian physics in the quantum regime, engineer quantum\nlight, and develop new tools to study the quantum noise and formation of Kerr\ncombs.\n","subjects":["Physics/Optics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2JaCi9LtGehPcqfGIzJWmMXwjpHYIpWCi7bgzCMTNAI","pdfSize":"2782637"}
