{"id":"2407.20361","title":"From ML to LLM: Evaluating the Robustness of Phishing Webpage Detection\n  Models against Adversarial Attacks","authors":"Aditya Kulkarni, Vivek Balachandran, Dinil Mon Divakaran and Tamal Das","authorsParsed":[["Kulkarni","Aditya",""],["Balachandran","Vivek",""],["Divakaran","Dinil Mon",""],["Das","Tamal",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:21:34 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 16:07:40 GMT"}],"updateDate":"2024-09-19","timestamp":1722277294000,"abstract":"  Phishing attacks attempt to deceive users into stealing sensitive\ninformation, posing a significant cybersecurity threat. Advances in machine\nlearning (ML) and deep learning (DL) have led to the development of numerous\nphishing webpage detection solutions, but these models remain vulnerable to\nadversarial attacks. Evaluating their robustness against adversarial phishing\nwebpages is essential. Existing tools contain datasets of pre-designed phishing\nwebpages for a limited number of brands, and lack diversity in phishing\nfeatures.\n  To address these challenges, we develop PhishOracle, a tool that generates\nadversarial phishing webpages by embedding diverse phishing features into\nlegitimate webpages. We evaluate the robustness of two existing models, Stack\nmodel and Phishpedia, in classifying PhishOracle-generated adversarial phishing\nwebpages. Additionally, we study a commercial large language model, Gemini Pro\nVision, in the context of adversarial attacks. We conduct a user study to\ndetermine whether PhishOracle-generated adversarial phishing webpages deceive\nusers. Our findings reveal that many PhishOracle-generated phishing webpages\nevade current phishing webpage detection models and deceive users, but Gemini\nPro Vision is robust to the attack. We also develop the PhishOracle web app,\nallowing users to input a legitimate URL, select relevant phishing features and\ngenerate a corresponding phishing webpage. All resources are publicly available\non GitHub.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"PVz1gnNR1bjY9f0eEHN7fwiJYUQbQ0vOg6HYgb1O8Hc","pdfSize":"5261500"}
