{"id":"2407.05412","title":"FM-OSD: Foundation Model-Enabled One-Shot Detection of Anatomical\n  Landmarks","authors":"Juzheng Miao, Cheng Chen, Keli Zhang, Jie Chuai, Quanzheng Li and\n  Pheng-Ann Heng","authorsParsed":[["Miao","Juzheng",""],["Chen","Cheng",""],["Zhang","Keli",""],["Chuai","Jie",""],["Li","Quanzheng",""],["Heng","Pheng-Ann",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 15:37:02 GMT"}],"updateDate":"2024-07-09","timestamp":1720366622000,"abstract":"  One-shot detection of anatomical landmarks is gaining significant attention\nfor its efficiency in using minimal labeled data to produce promising results.\nHowever, the success of current methods heavily relies on the employment of\nextensive unlabeled data to pre-train an effective feature extractor, which\nlimits their applicability in scenarios where a substantial amount of unlabeled\ndata is unavailable. In this paper, we propose the first foundation\nmodel-enabled one-shot landmark detection (FM-OSD) framework for accurate\nlandmark detection in medical images by utilizing solely a single template\nimage without any additional unlabeled data. Specifically, we use the frozen\nimage encoder of visual foundation models as the feature extractor, and\nintroduce dual-branch global and local feature decoders to increase the\nresolution of extracted features in a coarse to fine manner. The introduced\nfeature decoders are efficiently trained with a distance-aware similarity\nlearning loss to incorporate domain knowledge from the single template image.\nMoreover, a novel bidirectional matching strategy is developed to improve both\nrobustness and accuracy of landmark detection in the case of scattered\nsimilarity map obtained by foundation models. We validate our method on two\npublic anatomical landmark detection datasets. By using solely a single\ntemplate image, our method demonstrates significant superiority over strong\nstate-of-the-art one-shot landmark detection methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}