{"id":"2407.11517","title":"Multi-scale assessment of high-resolution reanalysis precipitation\n  fields over Italy","authors":"Francesco Cavalleri, Cristian Lussana, Francesca Viterbo, Michele\n  Brunetti, Riccardo Bonanno, Veronica Manara, Matteo Lacavalla, Simone\n  Sperati, Mario Raffa, Valerio Capecchi, Davide Cesari, Antonio Giordani, Ines\n  Maria Luisa Cerenzia, Maurizio Maugeri","authorsParsed":[["Cavalleri","Francesco",""],["Lussana","Cristian",""],["Viterbo","Francesca",""],["Brunetti","Michele",""],["Bonanno","Riccardo",""],["Manara","Veronica",""],["Lacavalla","Matteo",""],["Sperati","Simone",""],["Raffa","Mario",""],["Capecchi","Valerio",""],["Cesari","Davide",""],["Giordani","Antonio",""],["Cerenzia","Ines Maria Luisa",""],["Maugeri","Maurizio",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 08:53:33 GMT"}],"updateDate":"2024-07-17","timestamp":1721120013000,"abstract":"  This study focuses on the validation of high-resolution regional reanalyses\nto understand their effectiveness in reproducing precipitation patterns over\nItaly, a climate change hotspot characterized by coastal sea-land interaction\nand complex orography. Nine reanalysis products were evaluated, with the ECMWF\nglobal reanalysis ERA5 serving as a benchmark. These included both European\n(COSMO-REA6, CERRA) and Italy-specific (BOLAM, MERIDA, MERIDA-HRES, MOLOCH,\nSPHERA, VHR-REA\\_IT) datasets, using different models and parametrizations. The\ninter-comparison involved determining the effective resolution of daily\nprecipitation fields using wavelet techniques and assessing intense\nprecipitation statistics through frequency distributions. In-situ observations\nand observational gridded datasets were used to independently validate\nreanalysis precipitation fields. The capability of reanalyses to depict daily\nprecipitation patterns was assessed, highlighting a maximum radius of\nprecipitation misplacement of about 15 km, with notably lower skills during\nsummer. An overall overestimation of precipitation was identified in the\nreanalysis climatological fields over the Po Valley and the Alps, whereas\nmultiple products showed an underestimation of precipitations across the\nNorth-West coast, the Apennines, and Southern Italy. Finally, a comparison with\na time-consistent observational dataset (UniMi/ISAC-CNR) revealed a non-stable\ndeviation from observations in the annual precipitation cumulate of the\nreanalysis products analyzed. This should be taken into account when\ninterpreting precipitation trends over Italy.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"gfoGdAczL2tOHuxBvB5hFk8vfNSk667_0Z4zjQa-mZM","pdfSize":"21122902"}
