{"id":"2407.09096","title":"STD-PLM: Understanding Both Spatial and Temporal Properties of\n  Spatial-Temporal Data with PLM","authors":"YiHeng Huang, Xiaowei Mao, Shengnan Guo, Yubin Chen, Junfeng Shen,\n  Tiankuo Li, Youfang Lin, Huaiyu Wan","authorsParsed":[["Huang","YiHeng",""],["Mao","Xiaowei",""],["Guo","Shengnan",""],["Chen","Yubin",""],["Shen","Junfeng",""],["Li","Tiankuo",""],["Lin","Youfang",""],["Wan","Huaiyu",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 08:48:16 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 11:50:50 GMT"},{"version":"v3","created":"Tue, 10 Sep 2024 05:10:43 GMT"}],"updateDate":"2024-09-11","timestamp":1720774096000,"abstract":"  Spatial-temporal forecasting and imputation are important for real-world\nintelligent systems. Most existing methods are tailored for individual\nforecasting or imputation tasks but are not designed for both. Additionally,\nthey are less effective for zero-shot and few-shot learning. While pre-trained\nlanguage model (PLM) have exhibited strong pattern recognition and reasoning\nabilities across various tasks, including few-shot and zero-shot learning,\ntheir applications in spatial-temporal data understanding has been constrained\nby insufficient modeling of complex correlations such as the temporal\ncorrelations, spatial connectivity, non-pairwise and high-order\nspatial-temporal correlations within data. In this paper, we propose STD-PLM\nfor understanding both spatial and temporal properties of\n\\underline{S}patial-\\underline{T}emporal \\underline{D}ata with \\underline{PLM},\nwhich is capable of implementing both spatial-temporal forecasting and\nimputation tasks. STD-PLM understands spatial-temporal correlations via\nexplicitly designed spatial and temporal tokenizers. Topology-aware node\nembeddings are designed for PLM to comprehend and exploit the topology\nstructure of data in inductive manner. Furthermore, to mitigate the efficiency\nissues introduced by the PLM, we design a sandglass attention module (SGA)\ncombined with a specific constrained loss function, which significantly\nimproves the model's efficiency while ensuring performance. Extensive\nexperiments demonstrate that STD-PLM exhibits competitive performance and\ngeneralization capabilities across the forecasting and imputation tasks on\nvarious datasets. Moreover, STD-PLM achieves promising results on both few-shot\nand zero-shot tasks.The code is made available at\n\\href{https://anonymous.4open.science/r/STD-PLM-F3BA}{https://anonymous.4open.science/r/STD-PLM-F3BA}\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}