{"id":"2407.01854","title":"Enhancing resonant second harmonic generation in bilayer WSe2 by\n  layer-dependent exciton-polaron effect","authors":"Soonyoung Cha, Tianyi Ouyang, Takashi Taniguchi, Kenji Watanabe,\n  Nathaniel M. Gabor, Chun Hung Lui","authorsParsed":[["Cha","Soonyoung",""],["Ouyang","Tianyi",""],["Taniguchi","Takashi",""],["Watanabe","Kenji",""],["Gabor","Nathaniel M.",""],["Lui","Chun Hung",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 23:54:18 GMT"}],"updateDate":"2024-07-03","timestamp":1719878058000,"abstract":"  Two-dimensional (2D) materials serve as exceptional platforms for controlled\nsecond harmonic generation (SHG), an important nonlinear optical phenomenon\nwith diverse applications. Current approaches to SHG control often depend on\nnon-resonant conditions or symmetry breaking via single-gate control. Here, we\nemploy dual-gate bilayer WSe2 to demonstrate a new SHG enhancement concept that\nleverages strong exciton resonance and layer-dependent exciton-polaron effect.\nBy selectively localizing injected holes within one layer, we induce\nexciton-polaron states in the hole-filled layer while maintaining normal\nexciton states in the charge-neutral layer. The distinct resonant conditions of\nthese layers effectively break interlayer inversion symmetry, thereby promoting\nresonant SHG. Our method achieves a remarkable 40-fold enhancement of SHG at\nminimal electric field, equivalent to conditions near the dielectric-breakdown\nthreshold but using only ~3% of the critical breakdown field. Our findings also\nreveal significant sensitivity of resonant SHG to carrier density and carrier\ntype, with distinct enhancement and quenching observed across different gating\nregimes. This advancement offers an innovative approach to manipulating SHG in\n2D excitonic materials and provides a potent spectroscopic tool for probing\nlayer-dependent quantum states.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7sTak-FtjVRcpam_Maod3-VfNlWQmLCOfnAOwHdHpsA","pdfSize":"3905165"}
