{"id":"2407.13043","title":"INTELLECT: Adapting Cyber Threat Detection to Heterogeneous Computing\n  Environments","authors":"Simone Magnani, Liubov Nedoshivina, Roberto Doriguzzi-Corin, Stefano\n  Braghin, Domenico Siracusa","authorsParsed":[["Magnani","Simone",""],["Nedoshivina","Liubov",""],["Doriguzzi-Corin","Roberto",""],["Braghin","Stefano",""],["Siracusa","Domenico",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 22:34:29 GMT"},{"version":"v2","created":"Sun, 21 Jul 2024 09:24:21 GMT"}],"updateDate":"2024-07-23","timestamp":1721255669000,"abstract":"  The widespread adoption of cloud computing, edge, and IoT has increased the\nattack surface for cyber threats. This is due to the large-scale deployment of\noften unsecured, heterogeneous devices with varying hardware and software\nconfigurations. The diversity of these devices attracts a wide array of\npotential attack methods, making it challenging for individual organizations to\nhave comprehensive knowledge of all possible threats. In this context, powerful\nanomaly detection models can be developed by combining data from different\nparties using Federated Learning. FL enables the collaborative development of\nML-based IDSs without requiring the parties to disclose sensitive training\ndata, such as network traffic or sensor readings. However, deploying the\nresulting models can be challenging, as they may require more computational\nresources than those available on target devices with limited capacity or\nalready allocated for other operations. Training device-specific models is not\nfeasible for an organization because a significant portion of the training data\nis private to other participants in the FL process. To address these\nchallenges, this paper introduces INTELLECT, a novel solution that integrates\nfeature selection, model pruning, and fine-tuning techniques into a cohesive\npipeline for the dynamic adaptation of pre-trained ML models and configurations\nfor IDSs. Through empirical evaluation, we analyze the benefits of INTELLECT's\napproach in tailoring ML models to the specific resource constraints of an\norganization's devices and measure variations in traffic classification\naccuracy resulting from feature selection, pruning, and fine-tuning operations.\nAdditionally, we demonstrate the advantages of incorporating knowledge\ndistillation techniques while fine-tuning, enabling the ML model to\nconsistently adapt to local network patterns while preserving historical\nknowledge.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"lQ0rITyudEqrUae6Xq_FBVQ6_0Iku13uLrvOxLiPpAo","pdfSize":"1840695"}
