{"id":"2407.13134","title":"LAMA: LAMOST Medium-Resolution Spectral Analysis Pipeline","authors":"Chun-qian Li, Jian-rong Shi, Hong-liang Yan, Zhong-rui Bai, Jiang-tao\n  Wang and Ming-yi Ding","authorsParsed":[["Li","Chun-qian",""],["Shi","Jian-rong",""],["Yan","Hong-liang",""],["Bai","Zhong-rui",""],["Wang","Jiang-tao",""],["Ding","Ming-yi",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 03:46:00 GMT"}],"updateDate":"2024-07-19","timestamp":1721274360000,"abstract":"  The Large Sky Area Multi-Object Fiber Spectroscopic Telescope (LAMOST) has\nobtained more than 23 million spectra, opening an unprecedented opportunity to\nstudy stellar physics, as well as the formation and evolution of our Milky Way.\nIn order to obtain the accurate stellar parameters, we develop a LAMOST\nMedium-Resolution Spectral Analysis Pipeline (LAMA), which estimates the\nstellar parameters from the LAMOST medium-resolution spectra, including the\neffective temperature (Teff), surface gravity (logg), metallicity ([Fe/H]),\nradial velocity, and rotational velocity (vsini). LAMA estimates these\nparameters utilizing the template-matching method. The comparison between our\nresults and those from the high-resolution ones, including APOGEE, GALAH, and\nPASTEL, shows no obvious bias, indicating the reliability of our results. The\naccuracy of Teff and [Fe/H] can reach 75 K and 0.12 dex, respectively, for the\nLAMOST Medium-Resolution Spectroscopic Survey (MRS) spectra with a\nsignal-to-noise ratio higher than 10. For dwarfs, the uncertainty of logg is\naround 0.17 dex, while, for giants, it ranges from 0.18 to 0.30 dex, with the\nerrors decreasing as logg increases. Using LAMA for the LAMOST-MRS spectra, we\nestimate the stellar parameters of 497,412 stars. This sample will be very\nhelpful for investigating the formation and evolution of our Galaxy.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GFTOXSoO0fqx3xvCZ2BrBRtTkfTLoQN2eWZ9Mi0CGKM","pdfSize":"5234254"}
