{"id":"2407.18596","title":"Piecewise constant tuning gain based singularity-free MRAC with\n  application to aircraft control systems","authors":"Zhipeng Zhang, Yanjun Zhang, and Jian Sun","authorsParsed":[["Zhang","Zhipeng",""],["Zhang","Yanjun",""],["Sun","Jian",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 08:31:34 GMT"}],"updateDate":"2024-07-29","timestamp":1721982694000,"abstract":"  This paper introduces an innovative singularity-free output feedback model\nreference adaptive control (MRAC) method applicable to a wide range of\ncontinuous-time linear time-invariant (LTI) systems with general relative\ndegrees. Unlike existing solutions such as Nussbaum and multiple-model-based\nmethods, which manage unknown high-frequency gains through persistent switching\nand repeated parameter estimation, the proposed method circumvents these issues\nwithout prior knowledge of the high-frequency gain or additional design\nconditions. The key innovation of this method lies in transforming the\nestimation error equation into a linear regression form via a modified MRAC law\nwith a piecewise constant tuning gain developed in this work. This represents a\nsignificant departure from existing MRAC systems, where the estimation error\nequation is typically in a bilinear regression form. The linear regression form\nfacilitates the direct estimation of all unknown parameters, thereby\nsimplifying the adaptive control process. The proposed method preserves\nclosed-loop stability and ensures asymptotic output tracking, overcoming some\nof the limitations associated with existing methods like Nussbaum and\nmultiple-model based methods. The practical efficacy of the developed MRAC\nmethod is demonstrated through detailed simulation results within an aircraft\ncontrol system scenario.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}