{"id":"2407.01876","title":"Radiation MHD Simulations of Soft X-ray Emitting Regions in Changing\n  Look AGN","authors":"Taichi Igarashi, Hiroyuki R. Takahashi, Tomohisa Kawashima, Ken\n  Ohsuga, Yosuke Matsumoto, and Ryoji Matsumoto","authorsParsed":[["Igarashi","Taichi",""],["Takahashi","Hiroyuki R.",""],["Kawashima","Tomohisa",""],["Ohsuga","Ken",""],["Matsumoto","Yosuke",""],["Matsumoto","Ryoji",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 01:36:04 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 10:09:07 GMT"}],"updateDate":"2024-07-04","timestamp":1719884164000,"abstract":"  Strong soft X-ray emission called soft X-ray excess is often observed in\nluminous active galactic nuclei (AGN). It has been suggested that the soft\nX-rays are emitted from a warm ($T=10^6\\sim10^7\\ \\rm{K}$) region that is\noptically thick for the Thomson scattering (warm Comptonization region).\nMotivated by the recent observations that soft X-ray excess appears in changing\nlook AGN (CLAGN) during the state transition from a dim state without broad\nemission lines to a bright state with broad emission lines, we performed global\nthree-dimensional radiation magnetohydrodynamic simulations assuming that the\nmass accretion rate increases and becomes around $10$\\% of the Eddington\naccretion rate. The simulation successfully reproduces a warm, Thomson-thick\nregion outside the hot radiatively inefficient accretion flow near the black\nhole. The warm region is formed by efficient radiative cooling due to inverse\nCompton scattering. The calculated luminosity $0.01L_{{\\rm Edd}}-0.08L_{{\\rm\nEdd}}$ is consistent with the luminosity of CLAGN. We also found that the warm\nComptonization region is well described by the steady model of magnetized disks\nsupported by azimuthal magnetic fields. When the anti-parallel azimuthal\nmagnetic fields supporting the radiatively cooled region reconnect around the\nequatorial plane of the disk, the temperature of the region becomes higher by\nreleasing the magnetic energy transported to the region.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}