{"id":"2407.15325","title":"Odyssey: Empowering Agents with Open-World Skills","authors":"Shunyu Liu, Yaoru Li, Kongcheng Zhang, Zhenyu Cui, Wenkai Fang, Yuxuan\n  Zheng, Tongya Zheng, Mingli Song","authorsParsed":[["Liu","Shunyu",""],["Li","Yaoru",""],["Zhang","Kongcheng",""],["Cui","Zhenyu",""],["Fang","Wenkai",""],["Zheng","Yuxuan",""],["Zheng","Tongya",""],["Song","Mingli",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 02:06:59 GMT"}],"updateDate":"2024-07-23","timestamp":1721614019000,"abstract":"  Recent studies have delved into constructing generalist agents for open-world\nembodied environments like Minecraft. Despite the encouraging results, existing\nefforts mainly focus on solving basic programmatic tasks, e.g., material\ncollection and tool-crafting following the Minecraft tech-tree, treating the\nObtainDiamond task as the ultimate goal. This limitation stems from the\nnarrowly defined set of actions available to agents, requiring them to learn\neffective long-horizon strategies from scratch. Consequently, discovering\ndiverse gameplay opportunities in the open world becomes challenging. In this\nwork, we introduce ODYSSEY, a new framework that empowers Large Language Model\n(LLM)-based agents with open-world skills to explore the vast Minecraft world.\nODYSSEY comprises three key parts: (1) An interactive agent with an open-world\nskill library that consists of 40 primitive skills and 183 compositional\nskills. (2) A fine-tuned LLaMA-3 model trained on a large question-answering\ndataset with 390k+ instruction entries derived from the Minecraft Wiki. (3) A\nnew open-world benchmark includes thousands of long-term planning tasks, tens\nof dynamic-immediate planning tasks, and one autonomous exploration task.\nExtensive experiments demonstrate that the proposed ODYSSEY framework can\neffectively evaluate the planning and exploration capabilities of agents. All\ndatasets, model weights, and code are publicly available to motivate future\nresearch on more advanced autonomous agent solutions.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}