{"id":"2407.02737","title":"Development of Machine Learning Classifiers for Blood-based Diagnosis\n  and Prognosis of Suspected Acute Infections and Sepsis","authors":"Ljubomir Buturovic, Michael Mayhew, Roland Luethy, Kirindi Choi, Uros\n  Midic, Nandita Damaraju, Yehudit Hasin-Brumshtein, Amitesh Pratap, Rhys M.\n  Adams, Joao Fonseca, Ambika Srinath, Paul Fleming, Claudia Pereira, Oliver\n  Liesenfeld, Purvesh Khatri, Timothy Sweeney","authorsParsed":[["Buturovic","Ljubomir",""],["Mayhew","Michael",""],["Luethy","Roland",""],["Choi","Kirindi",""],["Midic","Uros",""],["Damaraju","Nandita",""],["Hasin-Brumshtein","Yehudit",""],["Pratap","Amitesh",""],["Adams","Rhys M.",""],["Fonseca","Joao",""],["Srinath","Ambika",""],["Fleming","Paul",""],["Pereira","Claudia",""],["Liesenfeld","Oliver",""],["Khatri","Purvesh",""],["Sweeney","Timothy",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 01:20:26 GMT"}],"updateDate":"2024-07-04","timestamp":1719969626000,"abstract":"  We applied machine learning to the unmet medical need of rapid and accurate\ndiagnosis and prognosis of acute infections and sepsis in emergency\ndepartments. Our solution consists of a Myrna (TM) Instrument and embedded\nTriVerity (TM) classifiers. The instrument measures abundances of 29 messenger\nRNAs in patient's blood, subsequently used as features for machine learning.\nThe classifiers convert the input features to an intuitive test report\ncomprising the separate likelihoods of (1) a bacterial infection (2) a viral\ninfection, and (3) severity (need for Intensive Care Unit-level care). In\ninternal validation, the system achieved AUROC = 0.83 on the three-class\ndisease diagnosis (bacterial, viral, or non-infected) and AUROC = 0.77 on\nbinary prognosis of disease severity. The Myrna, TriVerity system was granted\nbreakthrough device designation by the United States Food and Drug\nAdministration (FDA). This engineering manuscript teaches the standard and\nnovel machine learning methods used to translate an academic research concept\nto a clinical product aimed at improving patient care, and discusses lessons\nlearned.\n","subjects":["Quantitative Biology/Quantitative Methods","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Gk_p7Hy5lH7qQykRZJYNc2XeYJFK0UfnErQ3H6I3jWc","pdfSize":"2067471","objectId":"0xf3140860f6526360f0650ebfc71d1d0b78771ec4b644c240336474ac40f1621e","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
