{"id":"2407.05780","title":"Abundances of planetary nebulae and evolved stars: Iron and sulfur\n  depletion, and carbon and nitrogen enrichment, in low- and intermediate-mass\n  stellar populations in the Milky Way","authors":"Letizia Stanghellini (NSF's NOIRLab), Verne V. Smith (NSF's NOIRLab,\n  Institut d'Astrophysique de Paris, CNRS and Sorbonne Universit\\'e), Katia\n  Cunha (Steward Observatory, University of Arizona, Institut d'Astrophysique\n  de Paris, CNRS and Sorbonne Universit\\'e, Observat\\'orio Nacional MCTI),\n  Nikos Prantzos (Institut d'Astrophysique de Paris, CNRS and Sorbonne\n  Universit\\'e)","authorsParsed":[["Stanghellini","Letizia","","NSF's NOIRLab"],["Smith","Verne V.","","NSF's NOIRLab,\n  Institut d'Astrophysique de Paris, CNRS and Sorbonne Université"],["Cunha","Katia","","Steward Observatory, University of Arizona, Institut d'Astrophysique\n  de Paris, CNRS and Sorbonne Université, Observatório Nacional MCTI"],["Prantzos","Nikos","","Institut d'Astrophysique de Paris, CNRS and Sorbonne\n  Université"]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 09:40:24 GMT"}],"updateDate":"2024-07-09","timestamp":1720431624000,"abstract":"  We explore the elemental abundances in Galactic planetary nebulae (PNe)\ncompared with those of their stellar progenitors (Red Giant Branch and\nAsymptotic Giant Branch, RGB and AGB, stars), to explore and quantify the\nexpected -- i.e., due to AGB evolution or condensation onto grains --\ndifferences. We gleaned the current literature for the nebular abundances while\nwe used the APOGEE DR~17 survey data for the stellar sample. We examined the\nelements in common between the nebular and stellar samples, namely, C, N, O,\nFe, and S. We confirm that iron in PNe is mostly entrapped in grains, with an\naverage depletion $<$D[Fe/H]$>$=1.741$\\pm$0.486 dex, and we disclose a weak\ncorrelation between iron depletion and the [O/H] abundance,\nD[Fe/H]$=(6.6003\\pm2.443)\\times{\\rm [O/H]} +(1.972\\pm0.199)$. Sulfur may also\nbe mildly depleted in PNe, with $<$D[S/H]$>=0.179\\pm0.291$ dex. We also found\nan indication of nitrogen enrichment for PNe $<$E[N/H]$>$=0.393$\\pm$0.421 dex,\nwith maximum enrichment (0.980$\\pm$0.243) occurring for the PNe whose\nprogenitors have gone through the HBB. The carbon enrichment is\n$<$E[C/H]$>$=0.332$\\pm$0.460 dex when measured for the general PN populations.\nOur results will be relevant for future Galactic and extragalactic studies\ncomparing nebular and stellar samples.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}