{"id":"2407.06445","title":"Unconventional Field-Like Spin-Torques in CrPt$_3$","authors":"Robin Klause, Yuxuan Xiao, Jonathan Gibbons, Vivek P. Amin, Kirill D.\n  Belashchenko, Dongwook Go, Eric Fullerton, Axel Hoffmann","authorsParsed":[["Klause","Robin",""],["Xiao","Yuxuan",""],["Gibbons","Jonathan",""],["Amin","Vivek P.",""],["Belashchenko","Kirill D.",""],["Go","Dongwook",""],["Fullerton","Eric",""],["Hoffmann","Axel",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 23:01:14 GMT"},{"version":"v2","created":"Mon, 9 Sep 2024 19:35:45 GMT"}],"updateDate":"2024-09-11","timestamp":1720479674000,"abstract":"  The topological semimetal CrPt$_3$ has potential for generating\nunconventional spin torques due to its ferrimagnetic ordering, topological band\nstructure, and high anomalous Hall effect. CrPt$_3$ exhibits ferrimagnetic\nbehavior only in its chemically ordered phase and is paramagnetic in its\nchemically disordered phase. By controlling the growth and annealing\ntemperatures, epitaxial films of both chemically ordered and disordered phases\nof CrPt$_3$ are prepared allowing us to investigate the role of magnetic\nordering on unconventional torque generation. We use angle dependent\nspin-torque ferromagnetic resonance and second harmonic Hall measurements to\nprobe the spin torques generated from epitaxial CrPt$_3$ in\nCrPt$_3$/Cu/Ni$_{81}$Fe$_{19}$ heterostructures. With current applied along\nspecific directions with respect to the crystal order we reveal unconventional\nspin torques in both ordered and disordered films. When current flows parallel\nto the $[1\\overline{1}1]$ and $[\\overline{1}11]$ directions we observe an\nunconventional field-like torque that is opposite in sign for the two\ndirections. Our calculations reveal that this unconventional torque originates\nfrom an indirect nonlocal spin-orbit torque due to spin scattering at the\nCrPt$_3$/Cu interface, in addition to symmetry breaking at this interface.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}