{"id":"2407.03368","title":"Predict. Optimize. Revise. On Forecast and Policy Stability in Energy\n  Management Systems","authors":"Evgenii Genov, Julian Ruddick, Christoph Bergmeir, Majid Vafaeipour,\n  Thierry Coosemans, Salvador Garcia, Maarten Messagie","authorsParsed":[["Genov","Evgenii",""],["Ruddick","Julian",""],["Bergmeir","Christoph",""],["Vafaeipour","Majid",""],["Coosemans","Thierry",""],["Garcia","Salvador",""],["Messagie","Maarten",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 12:28:30 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 13:58:47 GMT"}],"updateDate":"2024-07-12","timestamp":1719664110000,"abstract":"  This research addresses the challenge of integrating forecasting and\noptimization in energy management systems, focusing on the impacts of switching\ncosts, forecast accuracy, and stability. It proposes a novel framework for\nanalyzing online optimization problems with switching costs and enabled by\ndeterministic and probabilistic forecasts. Through empirical evaluation and\ntheoretical analysis, the research reveals the balance between forecast\naccuracy, stability, and switching costs in shaping policy performance.\nConducted in the context of battery scheduling within energy management\napplications, it introduces a metric for evaluating probabilistic forecast\nstability and examines the effects of forecast accuracy and stability on\noptimization outcomes using the real-world case of the Citylearn 2022\ncompetition. Findings indicate that switching costs significantly influence the\ntrade-off between forecast accuracy and stability, highlighting the importance\nof integrated systems that enable collaboration between forecasting and\noperational units for improved decision-making. The study shows that committing\nto a policy for longer periods can be advantageous over frequent updates.\nResults also show a correlation between forecast stability and policy\nperformance, suggesting that stable forecasts can mitigate switching costs. The\nproposed framework provides valuable insights for energy sector decision-makers\nand forecast practitioners when designing the operation of an energy management\nsystem.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"F8X8zIww6jyxcB2G9W5iTpeQyVrNAlAj71_kdVDrCNk","pdfSize":"5361261"}
