{"id":"2407.12146","title":"Physical partisan proximity outweighs online ties in predicting US\n  voting outcomes","authors":"Marco Tonin, Bruno Lepri, Michele Tizzoni","authorsParsed":[["Tonin","Marco",""],["Lepri","Bruno",""],["Tizzoni","Michele",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 20:02:18 GMT"}],"updateDate":"2024-07-18","timestamp":1721160138000,"abstract":"  Affective polarization and increasing social divisions affect social mixing\nand the spread of information across online and physical spaces, reinforcing\nsocial and electoral cleavages and influencing political outcomes. Here, using\naggregated and de-identified co-location and online network data, we\ninvestigate the relationship between partisan exposure and voting patterns in\nthe USA by comparing three dimensions of partisan exposure: physical proximity\nand exposure to the same social contexts, online social ties, and residential\nsorting. By leveraging various statistical modeling approaches, we consistently\nfind that partisan exposure in the physical space, as captured by co-location\npatterns, more accurately predicts electoral outcomes in US counties,\noutperforming online and residential exposures across metropolitan and\nnon-metro areas. Moreover, our results show that physical partisan proximity is\nthe best predictor of voting patterns in swing counties, where the election\nresults are most uncertain. We also estimate county-level experienced partisan\nsegregation and examine its relationship with individuals' demographic and\nsocioeconomic characteristics. Focusing on metropolitan areas, our results\nconfirm the presence of extensive partisan segregation in the US and show that\noffline partisan isolation, both considering physical encounters or residential\nsorting, is higher than online segregation and is primarily associated with\neducational attainment. Our findings emphasize the importance of physical space\nin understanding the relationship between social networks and political\nbehavior, in contrast to the intense scrutiny focused on online social networks\nand elections.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Computers and Society","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}