{"id":"2407.13643","title":"Surface roughening in nanoparticle catalysts","authors":"Cameron J. Owen, Nicholas Marcella, Christopher R. O'Connor,\n  Taek-Seung Kim, Ryuichi Shimogawa, Clare Yijia Xie, Ralph G. Nuzzo, Anatoly\n  I. Frenkel, Christian Reece, and Boris Kozinsky","authorsParsed":[["Owen","Cameron J.",""],["Marcella","Nicholas",""],["O'Connor","Christopher R.",""],["Kim","Taek-Seung",""],["Shimogawa","Ryuichi",""],["Xie","Clare Yijia",""],["Nuzzo","Ralph G.",""],["Frenkel","Anatoly I.",""],["Reece","Christian",""],["Kozinsky","Boris",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:21:01 GMT"}],"updateDate":"2024-07-19","timestamp":1721319661000,"abstract":"  Supported metal nanoparticle (NP) catalysts are vital for the sustainable\nproduction of chemicals, but their design and implementation are limited by the\nability to identify and characterize their structures and atomic sites that are\ncorrelated with high catalytic activity. Identification of these ''active\nsites'' has relied heavily on extrapolation to supported NP systems from\ninvestigation of idealized surfaces, experimentally using single crystals or\nsupported NPs which are always modelled computationally using slab or regular\npolyhedra models. However, the ability of these methods to predict catalytic\nactivity remains qualitative at best, as the structure of metal NPs in reactive\nenvironments has only been speculated from indirect experimental observations,\nor otherwise remains wholly unknown. Here, by circumventing these limitations\nfor highly accurate simulation methods, we provide direct atomistic insight\ninto the dynamic restructuring of metal NPs by combining in situ spectroscopy\nwith molecular dynamics simulations powered by a machine learned force field.\nWe find that in reactive environments, NP surfaces evolve to a state with\npoorly defined atomic order, while the core of the NP may remain bulk-like.\nThese insights prove that long-standing conceptual models based on idealized\nfaceting for small metal NP systems are not representative of real systems\nunder exposure to reactive environments. We show that the resultant structure\ncan be elucidated by combining advanced spectroscopy and computational tools.\nThis discovery exemplifies that to enable faithful quantitative predictions of\ncatalyst function and stability, we must move beyond idealized-facet\nexperimental and theoretical models and instead employ systems which include\nrealistic surface structures that respond to relevant physical and chemical\nconditions.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Applied Physics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}