{"id":"2407.14425","title":"The $K_s$-band luminosity function of the rich cluster VC04 in the Vela\n  supercluster","authors":"N. Hatamkhani, R. C. Kraan-Korteweg, S. L. Blyth and R. E. Skelton","authorsParsed":[["Hatamkhani","N.",""],["Kraan-Korteweg","R. C.",""],["Blyth","S. L.",""],["Skelton","R. E.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:52:32 GMT"}],"updateDate":"2024-07-22","timestamp":1721404352000,"abstract":"  To learn more about the properties of the Vela Supercluster (VSCL) located\nbehind the Milky Way at $cz\\sim 18000$~km~s$^{-1}$, we determined the\n$K_s$-band Luminosity Function (LF) of VC04, the richest known galaxy cluster\nin the VSCL, and two other VSCL clusters (VC02 and VC08). The galaxy sample is\nbased on NIR observations which are complete to an extinction-corrected\nabsolute magnitude of $M_{Ks}^o<-21.5$ mag ($\\sim 2.5$ mag below $M_K^*$),\nwithin the clustercentric radius of $r_c<1.5~$Mpc ($\\sim 70 \\%$ of the Abell\nradius). For VC04 we obtained 90 new spectroscopic redshifts of galaxies\nobserved with the 11-m Southern African Large Telescope. We found the Schechter\nparameters of the VC04 LF to be $M^*=-24.41\\pm 0.44$ mag, $\\alpha=-1.10\\pm\n0.20$ and $\\phi^*=8.84\\pm 0.20$. Both the redshift data and the LF confirm VC04\nto be a rich, not yet fully relaxed cluster. We independently determined the LF\nof VC04 on membership defined by the Red-Sequence method and demonstrated that\nthis method can be used in the absence of high spectroscopic coverage over a\ncluster. This allowed us to determine the LFs of VC02 and VC08. We also derived\nthe LFs of the Coma, Norma and Virgo clusters to similar depth and extent as\nthe VSCL clusters. We found that the Schechter parameters of VC04 are within\n$1\\sigma$ uncertainties of these local clusters, as well as VC02 and VC08. We\ndo not find significant differences between the LFs in the different cluster\nenvironments probed in this work down to $M_K^*+2.5$ mag.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}