{"id":"2407.02394","title":"Similarity Distance-Based Label Assignment for Tiny Object Detection","authors":"Shuohao Shi, Qiang Fang, Tong Zhao, Xin Xu","authorsParsed":[["Shi","Shuohao",""],["Fang","Qiang",""],["Zhao","Tong",""],["Xu","Xin",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 16:12:37 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 05:36:23 GMT"},{"version":"v3","created":"Fri, 26 Jul 2024 09:15:06 GMT"}],"updateDate":"2024-07-29","timestamp":1719936757000,"abstract":"  Tiny object detection is becoming one of the most challenging tasks in\ncomputer vision because of the limited object size and lack of information. The\nlabel assignment strategy is a key factor affecting the accuracy of object\ndetection. Although there are some effective label assignment strategies for\ntiny objects, most of them focus on reducing the sensitivity to the bounding\nboxes to increase the number of positive samples and have some fixed\nhyperparameters need to set. However, more positive samples may not necessarily\nlead to better detection results, in fact, excessive positive samples may lead\nto more false positives. In this paper, we introduce a simple but effective\nstrategy named the Similarity Distance (SimD) to evaluate the similarity\nbetween bounding boxes. This proposed strategy not only considers both location\nand shape similarity but also learns hyperparameters adaptively, ensuring that\nit can adapt to different datasets and various object sizes in a dataset. Our\napproach can be simply applied in common anchor-based detectors in place of the\nIoU for label assignment and Non Maximum Suppression (NMS). Extensive\nexperiments on four mainstream tiny object detection datasets demonstrate\nsuperior performance of our method, especially, 1.8 AP points and 4.1 AP points\nof very tiny higher than the state-of-the-art competitors on AI-TOD. Code is\navailable at: \\url{https://github.com/cszzshi/SimD}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LGORmR4xtc4rv7ReUd3srK2mN1qb4ksoRmH4fU2nc60","pdfSize":"2471497","objectId":"0x59d109027b02960a3dcf2554c48f810562c27c27a36858f0524a0d59fd3b921b","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
