{"id":"2407.17231","title":"Influence of surface relaxations on atomic-resolution imaging of a\n  charge density wave material","authors":"Nikhil S. Sivakumar, Joost Aretz, Sebastian Scherb, Marion van Midden\n  Mavri\\v{c}, Nora Huijgen, Umut Kamber, Daniel Wegner, Alexander A.\n  Khajetoorians, Malte R\\\"osner, Nadine Hauptmann","authorsParsed":[["Sivakumar","Nikhil S.",""],["Aretz","Joost",""],["Scherb","Sebastian",""],["Mavrič","Marion van Midden",""],["Huijgen","Nora",""],["Kamber","Umut",""],["Wegner","Daniel",""],["Khajetoorians","Alexander A.",""],["Rösner","Malte",""],["Hauptmann","Nadine",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 12:38:30 GMT"}],"updateDate":"2024-07-25","timestamp":1721824710000,"abstract":"  Scanning tunneling microscopy is the method of choice for characterizing\ncharge density waves by imaging the variation in atomic-scale contrast of the\nsurface. Due to the measurement principle of scanning tunneling microscopy, the\nelectronic and lattice degrees of freedom are convoluted, making it difficult\nto disentangle a structural displacement from spatial variations in the\nelectronic structure. In this work, we quantify the influence of the\ndisplacement of the surface-terminating Se atoms on the 3 x 3 charge density\nwave contrast in scanning probe microscopy images of 2H-NbSe2. In scanning\ntunneling microscopy images, we observe the 3 x 3 charge density wave\nsuperstructure and atomic lattice at all probed tip-sample distances. In\ncontrast, non-contact atomic force microscopy images show both periodicities\nonly at small tip-sample distances while, unexpectedly, a 3 x 3 superstructure\nis present at larger tip-sample distances. Using density functional theory\ncalculations, we qualitatively reproduce the experimental findings and reveal\nthat the 3 x 3 superstructure at different tip-sample distances in non-contact\natomic force microscopy images is a result from different underlying\ninteractions. In addition, we show that the displacement of the\nsurface-terminating Se atoms has a negligible influence to the contrast in\nscanning tunneling microscopy images. Our work presents a method on how to\ndiscriminate the influence of the surface corrugation from the variation of the\ncharge density to the charge density wave contrast in scanning probe microscopy\nimages, which can foster the understanding of the charge density wave mechanism\nin low-dimensional materials.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}