{"id":"2407.11341","title":"SN 2021dbg: A Luminous Type IIP-IIL Supernova Exploding from a Massive\n  Star with a Layered Shell","authors":"Zeyi Zhao, Jujia Zhang, Liping Li, Qian Zhai, Yongzhi Cai, Shubham\n  Srivastav, Xiaofeng Wang, Han Lin, Yi Yang, Alexei V. Filippenko, Thomas G.\n  Brink, and WeiKang Zheng","authorsParsed":[["Zhao","Zeyi",""],["Zhang","Jujia",""],["Li","Liping",""],["Zhai","Qian",""],["Cai","Yongzhi",""],["Srivastav","Shubham",""],["Wang","Xiaofeng",""],["Lin","Han",""],["Yang","Yi",""],["Filippenko","Alexei V.",""],["Brink","Thomas G.",""],["Zheng","WeiKang",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 03:14:26 GMT"}],"updateDate":"2024-07-17","timestamp":1721099666000,"abstract":"  We present extensive observations and analysis of supernova (SN) 2021dbg,\nutilizing optical photometry and spectroscopy. For approximately 385 days\nfollowing the explosion, SN 2021dbg exhibited remarkable luminosity, surpassing\nmost SNe II. This initial high luminosity is potentially attributed to the\ninteraction between the ejected material and the surrounding circumstellar\nmaterial (CSM), as evidenced by the pronounced interaction signatures observed\nin its spectra. The subsequent high luminosity is primarily due to the\nsignificant $^{56}$Ni ($0.17 \\pm 0.05$ M$_{\\odot}$) produced in the explosion.\nBased on the flux of flash emission lines detected in the initial spectra, we\nestimate that the CSM mass near the progenitor amounted to $\\sim$(1.0--2.0)\n$\\times 10^{-3}$ M$_{\\odot}$, likely resulting from intense stellar wind\nactivity 2--3 yr preceding the explosion. Considering the bolometric light\ncurve, nebular spectrum modeling, and mass-loss rate, we suggest that the\nprogenitor of SN 2021dbg was a red supergiant (RSG) with a mass of $\\sim 20$\nM$_{\\odot}$ and a radius of 1200 R$_{\\odot}$. This RSG featured a thick\nhydrogen shell, which may have contained a region with a sharp decrease in\nmaterial density, electron density, and temperature, contributing to its\nlayered structure. This object demonstrates mixed features of SNe IIP and SNe\nIIL, making it as a transitional event linking the above two subclasses of SNe\nII.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}