{"id":"2407.16064","title":"Color and Sentiment: A Study of Emotion-Based Color Palettes in\n  Marketing","authors":"Maksat Shagyrov and Pakizar Shamoi","authorsParsed":[["Shagyrov","Maksat",""],["Shamoi","Pakizar",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 21:43:20 GMT"}],"updateDate":"2024-07-24","timestamp":1721684600000,"abstract":"  It's widely recognized that the colors used in branding significantly impact\nhow a brand is perceived. This research explores the influence of color in\nlogos on consumer perception and emotional response. We investigate the\nassociations between color usage and emotional responses in food and beverage\nmarketing. Using a dataset of 644 companies, we analyzed the dominant colors in\nbrand logos using k-means clustering to develop distinct color palettes.\nConcurrently, we extracted customer sentiments and emotions from Google Maps\nreviews of these companies (n=30,069), categorizing them into five primary\nemotions: Happiness, Anger, Sadness, Fear, and Surprise. These emotional\nresponses were further categorized into four intensity levels: Low, Medium,\nStrong, and Very Strong, using a fuzzy sets approach. Our methodology involved\ncorrelating specific color palettes with the predominant emotional reactions\nassociated with each brand. By merging the color palettes of companies that\nelicited similar emotional responses, we identified unique color palettes\ncorresponding to each emotional category. Our findings suggest that among the\nfood companies analyzed, the dominant emotion was Happiness, with no instances\nof Anger. The colors red and gray were prevalent across all emotional\ncategories, indicating their importance in branding. Specific color-emotion\ncorrelations confirmed by our research include associations of yellow with\nHappiness, blue with Sadness, and bright colors with Surprise. This study\nhighlights the critical role of color in shaping consumer attitudes. The study\nfindings have practical implications for brand designers in the food industry.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}