{"id":"2407.17177","title":"Asgard/NOTT: water vapor and CO$_2$ atmospheric dispersion compensation\n  system","authors":"Romain Laugier, Denis Defr\\`ere, Michael Ireland, Germain Garreau,\n  Olivier Absil, Alexis Matter, Romain Petrov, Philippe Berio, Peter Tuthill,\n  Marc-Antoine Martinod, Lucas Labadie","authorsParsed":[["Laugier","Romain",""],["Defrère","Denis",""],["Ireland","Michael",""],["Garreau","Germain",""],["Absil","Olivier",""],["Matter","Alexis",""],["Petrov","Romain",""],["Berio","Philippe",""],["Tuthill","Peter",""],["Martinod","Marc-Antoine",""],["Labadie","Lucas",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 11:25:50 GMT"}],"updateDate":"2024-07-25","timestamp":1721820350000,"abstract":"  To leverage the angular resolution of interferometry at high contrast, one\nmust employ specialized beam-combiners called interferometric nullers. Nullers\ndiscard part of the astrophysical information to optimize the recording of\nlight present in the dark fringe of the central source. Asgard/NOTT will deploy\na beam-combination scheme offering good instrumental noise rejection when\nphased appropriately, but for which information is degenerate on the outputs,\nprompting a dedicated tuning strategy using the science detector. The\ndispersive effect of water vapor can be corrected with prisms forming a\nvariable thickness of glass. But observations in the L band suffer from an\nadditional and important chromatic effect due to longitudinal atmospheric\ndispersion coming from a resonance of CO2 at 4.3 micron. To compensate for this\neffect efficiently, a novel type of compensation device will be deployed\nleveraging a gas cell of variable length at ambient pressure. After reviewing\nthe impact of water vapor and CO2, we present the design of this atmospheric\ndispersion compensation device and describe a strategy to maintain this tuning\non-sky.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"GUq6r5o-JGr6APXH93K6BfzccIQ0g3AOuYOLE-a39DM","pdfSize":"1550377","objectId":"0x0d7a9f8eb7e223cc21634245ee575903864f00e406b37dc85317586e8ca79215","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
