{"id":"2407.12762","title":"Quasi-Linear Size PCPs with Small Soundness from HDX","authors":"Mitali Bafna, Dor Minzer, Nikhil Vyas","authorsParsed":[["Bafna","Mitali",""],["Minzer","Dor",""],["Vyas","Nikhil",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 17:39:42 GMT"}],"updateDate":"2024-07-18","timestamp":1721237982000,"abstract":"  We construct 2-query, quasi-linear sized probabilistically checkable proofs\n(PCPs) with arbitrarily small constant soundness, improving upon Dinur's\n2-query quasi-linear size PCPs with soundness $1-\\Omega(1)$. As an immediate\ncorollary, we get that under the exponential time hypothesis, for all $\\epsilon\n>0$ no approximation algorithm for $3$-SAT can obtain an approximation ratio of\n$7/8+\\epsilon$ in time $2^{n/\\log^C n}$, where $C$ is a constant depending on\n$\\epsilon$. Our result builds on a recent line of works showing the existence\nof linear sized direct product testers with small soundness by independent\nworks of Bafna, Lifshitz, and Minzer, and of Dikstein, Dinur, and Lubotzky.\n  The main new ingredient in our proof is a technique that embeds a given PCP\nconstruction into a PCP on a prescribed graph, provided that the latter is a\ngraph underlying a sufficiently good high-dimensional expander. Towards this\nend, we use ideas from fault-tolerant distributed computing, and more precisely\nfrom the literature of the almost everywhere agreement problem starting with\nthe work of Dwork, Peleg, Pippenger, and Upfal (1986). We show that graphs\nunderlying HDXs admit routing protocols that are tolerant to adversarial edge\ncorruptions, and in doing so we also improve the state of the art in this line\nof work.\n  Our PCP construction requires variants of the aforementioned direct product\ntesters with poly-logarithmic degree. The existence and constructability of\nthese variants is shown in an appendix by Zhiwei Yun.\n","subjects":["Computing Research Repository/Computational Complexity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}