{"id":"2407.20893","title":"MambaCapsule: Towards Transparent Cardiac Disease Diagnosis with\n  Electrocardiography Using Mamba Capsule Network","authors":"Yinlong Xu, Xiaoqiang Liu, Zitai Kong, Yixuan Wu, Yue Wang, Yingzhou\n  Lu, Honghao Gao, Jian Wu, Hongxia Xu","authorsParsed":[["Xu","Yinlong",""],["Liu","Xiaoqiang",""],["Kong","Zitai",""],["Wu","Yixuan",""],["Wang","Yue",""],["Lu","Yingzhou",""],["Gao","Honghao",""],["Wu","Jian",""],["Xu","Hongxia",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 15:12:29 GMT"}],"updateDate":"2024-07-31","timestamp":1722352349000,"abstract":"  Cardiac arrhythmia, a condition characterized by irregular heartbeats, often\nserves as an early indication of various heart ailments. With the advent of\ndeep learning, numerous innovative models have been introduced for diagnosing\narrhythmias using Electrocardiogram (ECG) signals. However, recent studies\nsolely focus on the performance of models, neglecting the interpretation of\ntheir results. This leads to a considerable lack of transparency, posing a\nsignificant risk in the actual diagnostic process. To solve this problem, this\npaper introduces MambaCapsule, a deep neural networks for ECG arrhythmias\nclassification, which increases the explainability of the model while enhancing\nthe accuracy.Our model utilizes Mamba for feature extraction and Capsule\nnetworks for prediction, providing not only a confidence score but also signal\nfeatures. Akin to the processing mechanism of human brain, the model learns\nsignal features and their relationship between them by reconstructing ECG\nsignals in the predicted selection. The model evaluation was conducted on\nMIT-BIH and PTB dataset, following the AAMI standard. MambaCapsule has achieved\na total accuracy of 99.54% and 99.59% on the test sets respectively. These\nresults demonstrate the promising performance of under the standard test\nprotocol.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}