{"id":"2407.11213","title":"OpenPSG: Open-set Panoptic Scene Graph Generation via Large Multimodal\n  Models","authors":"Zijian Zhou, Zheng Zhu, Holger Caesar, Miaojing Shi","authorsParsed":[["Zhou","Zijian",""],["Zhu","Zheng",""],["Caesar","Holger",""],["Shi","Miaojing",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 19:56:42 GMT"}],"updateDate":"2024-07-17","timestamp":1721073402000,"abstract":"  Panoptic Scene Graph Generation (PSG) aims to segment objects and recognize\ntheir relations, enabling the structured understanding of an image. Previous\nmethods focus on predicting predefined object and relation categories, hence\nlimiting their applications in the open world scenarios. With the rapid\ndevelopment of large multimodal models (LMMs), significant progress has been\nmade in open-set object detection and segmentation, yet open-set relation\nprediction in PSG remains unexplored. In this paper, we focus on the task of\nopen-set relation prediction integrated with a pretrained open-set panoptic\nsegmentation model to achieve true open-set panoptic scene graph generation\n(OpenPSG). Our OpenPSG leverages LMMs to achieve open-set relation prediction\nin an autoregressive manner. We introduce a relation query transformer to\nefficiently extract visual features of object pairs and estimate the existence\nof relations between them. The latter can enhance the prediction efficiency by\nfiltering irrelevant pairs. Finally, we design the generation and judgement\ninstructions to perform open-set relation prediction in PSG autoregressively.\nTo our knowledge, we are the first to propose the open-set PSG task. Extensive\nexperiments demonstrate that our method achieves state-of-the-art performance\nin open-set relation prediction and panoptic scene graph generation. Code is\navailable at \\url{https://github.com/franciszzj/OpenPSG}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_Z87O9al9DljFCaL9s1LqaV6N9M_xY6pXdxawUsQdYs","pdfSize":"1606113","objectId":"0x2567573b3dca80383c142098eca9e77fd48b2413e4e0301e871a61af85ffd585","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
