{"id":"2407.05415","title":"DIVESPOT: Depth Integrated Volume Estimation of Pile of Things Based on\n  Point Cloud","authors":"Yiran Ling, Rongqiang Zhao, Yixuan Shen, Dongbo Li, Jing Jin, Jie Liu","authorsParsed":[["Ling","Yiran",""],["Zhao","Rongqiang",""],["Shen","Yixuan",""],["Li","Dongbo",""],["Jin","Jing",""],["Liu","Jie",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 15:40:00 GMT"}],"updateDate":"2024-07-09","timestamp":1720366800000,"abstract":"  Non-contact volume estimation of pile-type objects has considerable potential\nin industrial scenarios, including grain, coal, mining, and stone materials.\nHowever, using existing method for these scenarios is challenged by unstable\nmeasurement poses, significant light interference, the difficulty of training\ndata collection, and the computational burden brought by large piles. To\naddress the above issues, we propose the Depth Integrated Volume EStimation of\nPile Of Things (DIVESPOT) based on point cloud technology in this study. For\nthe challenges of unstable measurement poses, the point cloud pose correction\nand filtering algorithm is designed based on the Random Sample Consensus\n(RANSAC) and the Hierarchical Density-Based Spatial Clustering of Applications\nwith Noise (HDBSCAN). To cope with light interference and to avoid the relying\non training data, the height-distribution-based ground feature extraction\nalgorithm is proposed to achieve RGB-independent. To reduce the computational\nburden, the storage space optimizing strategy is developed, such that accurate\nestimation can be acquired by using compressed voxels. Experimental results\ndemonstrate that the DIVESPOT method enables non-data-driven, RGB-independent\nsegmentation of pile point clouds, maintaining a volume calculation relative\nerror within 2%. Even with 90% compression of the voxel mesh, the average error\nof the results can be under 3%.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}