{"id":"2407.17157","title":"Establishing Truly Causal Relationship Between Whole Slide Image\n  Predictions and Diagnostic Evidence Subregions in Deep Learning","authors":"Tianhang Nan, Yong Ding, Hao Quan, Deliang Li, Mingchen Zou and Xiaoyu\n  Cui","authorsParsed":[["Nan","Tianhang",""],["Ding","Yong",""],["Quan","Hao",""],["Li","Deliang",""],["Zou","Mingchen",""],["Cui","Xiaoyu",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 11:00:08 GMT"}],"updateDate":"2024-07-25","timestamp":1721818808000,"abstract":"  In the field of deep learning-driven Whole Slide Image (WSI) classification,\nMultiple Instance Learning (MIL) has gained significant attention due to its\nability to be trained using only slide-level diagnostic labels. Previous MIL\nresearches have primarily focused on enhancing feature aggregators for globally\nanalyzing WSIs, but overlook a causal relationship in diagnosis: model's\nprediction should ideally stem solely from regions of the image that contain\ndiagnostic evidence (such as tumor cells), which usually occupy relatively\nsmall areas. To address this limitation and establish the truly causal\nrelationship between model predictions and diagnostic evidence regions, we\npropose Causal Inference Multiple Instance Learning (CI-MIL). CI-MIL integrates\nfeature distillation with a novel patch decorrelation mechanism, employing a\ntwo-stage causal inference approach to distill and process patches with high\ndiagnostic value. Initially, CI-MIL leverages feature distillation to identify\npatches likely containing tumor cells and extracts their corresponding feature\nrepresentations. These features are then mapped to random Fourier feature\nspace, where a learnable weighting scheme is employed to minimize inter-feature\ncorrelations, effectively reducing redundancy from homogenous patches and\nmitigating data bias. These processes strengthen the causal relationship\nbetween model predictions and diagnostically relevant regions, making the\nprediction more direct and reliable. Experimental results demonstrate that\nCI-MIL outperforms state-of-the-art methods. Additionally, CI-MIL exhibits\nsuperior interpretability, as its selected regions demonstrate high consistency\nwith ground truth annotations, promising more reliable diagnostic assistance\nfor pathologists.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Quantitative Biology/Tissues and Organs"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}