{"id":"2407.10857","title":"Revealing Gas Inflows towards the Galactic Central Molecular Zone","authors":"Yang Su, Shiyu Zhang, Yan Sun, Ji Yang, Qing-Zeng Yan, Shaobo Zhang,\n  Zhiwei Chen, Xuepeng Chen, Xin Zhou, and Lixia Yuan","authorsParsed":[["Su","Yang",""],["Zhang","Shiyu",""],["Sun","Yan",""],["Yang","Ji",""],["Yan","Qing-Zeng",""],["Zhang","Shaobo",""],["Chen","Zhiwei",""],["Chen","Xuepeng",""],["Zhou","Xin",""],["Yuan","Lixia",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:08:29 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 03:21:52 GMT"}],"updateDate":"2024-08-06","timestamp":1721059709000,"abstract":"  We study the gas inflows towards the Galactic Central Molecular Zone (CMZ)\nbased on the gas morphological and kinematic features from the MWISP in the\nregion of l=1.2 deg--19.0 deg and |b|<3.0 deg. We find that the near dust lane\nextends to l~15 deg, in which the end of the large-scale gas structure\nintersects with the 3 kpc-ring at a distance of ~5 kpc. Intriguingly, many\nfilamentary MCs, together with the bow-like/ballistic-like clouds and\ncontinuous CO features with notable velocity gradient, are finely outlined\nalong the long structure. These MCs also have relatively large velocity\ndispersions, indicating the shocked gas generated by local continuous accretion\nand thus the enhanced turbulence along the entire gas structure. We suggest\nthat the ~3.1--3.6 kpc long CO structure originates from the accretion\nmolecular gas driven by the Galactic bar. The gas near the bar end at the 3\nkpc-ring becomes an important reservoir for the large-scale accreting flows\ninwards to the CMZ through the bar channel. The inclination angle of the bar is\nestimated to be 20--26 deg, while the pattern speed of the bar is 30--35 km/s.\nThe total mass of the whole gas lane is about (0.9-1.7)x10^7 Msun according to\nthe calculated X_CO=(0.6-1.4)x10^20 cm^-2 (Kkm/s)^-1 from the large-scale CO\ndata and the complementary HI data. The mean gas inflow rate is about 0.8-1.4\nMsun/yr, which seems to be comparable to the outflow's rate of the Galactic\nnuclear winds after applying the updated lower X-factor value above.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}