{"id":"2407.19225","title":"Magic3DSketch: Create Colorful 3D Models From Sketch-Based 3D Modeling\n  Guided by Text and Language-Image Pre-Training","authors":"Ying Zang, Yidong Han, Chaotao Ding, Jianqi Zhang, Tianrun Chen","authorsParsed":[["Zang","Ying",""],["Han","Yidong",""],["Ding","Chaotao",""],["Zhang","Jianqi",""],["Chen","Tianrun",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 09:59:13 GMT"}],"updateDate":"2024-07-30","timestamp":1722074353000,"abstract":"  The requirement for 3D content is growing as AR/VR application emerges. At\nthe same time, 3D modelling is only available for skillful experts, because\ntraditional methods like Computer-Aided Design (CAD) are often too\nlabor-intensive and skill-demanding, making it challenging for novice users.\nOur proposed method, Magic3DSketch, employs a novel technique that encodes\nsketches to predict a 3D mesh, guided by text descriptions and leveraging\nexternal prior knowledge obtained through text and language-image pre-training.\nThe integration of language-image pre-trained neural networks complements the\nsparse and ambiguous nature of single-view sketch inputs. Our method is also\nmore useful and offers higher degree of controllability compared to existing\ntext-to-3D approaches, according to our user study. Moreover, Magic3DSketch\nachieves state-of-the-art performance in both synthetic and real dataset with\nthe capability of producing more detailed structures and realistic shapes with\nthe help of text input. Users are also more satisfied with models obtained by\nMagic3DSketch according to our user study. Additionally, we are also the first,\nto our knowledge, add color based on text description to the sketch-derived\nshapes. By combining sketches and text guidance with the help of language-image\npretrained models, our Magic3DSketch can allow novice users to create custom 3D\nmodels with minimal effort and maximum creative freedom, with the potential to\nrevolutionize future 3D modeling pipelines.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"LsTL1-rv90ctEv5Ls2y4JEhk0qvwh-QFuu80ZXtBjXQ","pdfSize":"3072162"}
