{"id":"2407.07456","title":"GothX: a generator of customizable, legitimate and malicious IoT network\n  traffic","authors":"Manuel Poisson (CIDRE, PIRAT), Rodrigo Carnier (NII), Kensuke Fukuda\n  (NII, SOKENDAI)","authorsParsed":[["Poisson","Manuel","","CIDRE, PIRAT"],["Carnier","Rodrigo","","NII"],["Fukuda","Kensuke","","NII, SOKENDAI"]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 08:20:20 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 07:35:59 GMT"}],"updateDate":"2024-08-29","timestamp":1720599620000,"abstract":"  In recent years, machine learning-based anomaly detection (AD) has become an\nimportant measure against security threats from Internet of Things (IoT)\nnetworks. Machine learning (ML) models for network traffic AD require datasets\nto be trained, evaluated and compared. Due to the necessity of realistic and\nup-to-date representation of IoT security threats, new datasets need to be\nconstantly generated to train relevant AD models. Since most traffic generation\nsetups are developed considering only the author's use, replication of traffic\ngeneration becomes an additional challenge to the creation and maintenance of\nuseful datasets. In this work, we propose GothX, a flexible traffic generator\nto create both legitimate and malicious traffic for IoT datasets. As a fork of\nGotham Testbed, GothX is developed with five requirements: 1)easy configuration\nof network topology, 2) customization of traffic parameters, 3) automatic\nexecution of legitimate and attack scenarios, 4) IoT network heterogeneity (the\ncurrent iteration supports MQTT, Kafka and SINETStream services), and 5)\nautomatic labeling of generated datasets. GothX is validated by two use cases:\na) re-generation and enrichment of traffic from the IoT dataset MQTTset,and b)\nautomatic execution of a new realistic scenario including the exploitation of a\nCVE specific to the Kafka-MQTT network topology and leading to a DDoS attack.\nWe also contribute with two datasets containing mixed traffic, one made from\nthe enriched MQTTset traffic and another from the attack scenario. We evaluated\nthe scalability of GothX (450 IoT sensors in a single machine), the replication\nof the use cases and the validity of the generated datasets, confirming the\nability of GothX to improve the current state-of-the-art of network traffic\ngeneration.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}