{"id":"2407.03885","title":"Perception-Guided Quality Metric of 3D Point Clouds Using Hybrid\n  Strategy","authors":"Yujie Zhang, Qi Yang, Yiling Xu, Shan Liu","authorsParsed":[["Zhang","Yujie",""],["Yang","Qi",""],["Xu","Yiling",""],["Liu","Shan",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 12:23:39 GMT"}],"updateDate":"2024-07-08","timestamp":1720095819000,"abstract":"  Full-reference point cloud quality assessment (FR-PCQA) aims to infer the\nquality of distorted point clouds with available references. Most of the\nexisting FR-PCQA metrics ignore the fact that the human visual system (HVS)\ndynamically tackles visual information according to different distortion levels\n(i.e., distortion detection for high-quality samples and appearance perception\nfor low-quality samples) and measure point cloud quality using unified\nfeatures. To bridge the gap, in this paper, we propose a perception-guided\nhybrid metric (PHM) that adaptively leverages two visual strategies with\nrespect to distortion degree to predict point cloud quality: to measure visible\ndifference in high-quality samples, PHM takes into account the masking effect\nand employs texture complexity as an effective compensatory factor for absolute\ndifference; on the other hand, PHM leverages spectral graph theory to evaluate\nappearance degradation in low-quality samples. Variations in geometric signals\non graphs and changes in the spectral graph wavelet coefficients are utilized\nto characterize geometry and texture appearance degradation, respectively.\nFinally, the results obtained from the two components are combined in a\nnon-linear method to produce an overall quality score of the tested point\ncloud. The results of the experiment on five independent databases show that\nPHM achieves state-of-the-art (SOTA) performance and offers significant\nperformance improvement in multiple distortion environments. The code is\npublicly available at https://github.com/zhangyujie-1998/PHM.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}