{"id":"2407.14924","title":"The Origin of Quantum Mechanical Statistics: Some Insights from the\n  Research on Human Language","authors":"Diederik Aerts, Jonito Aerts Argu\\=elles, Lester Beltran, Massimiliano\n  Sassoli de Bianchi and Sandro Sozzo","authorsParsed":[["Aerts","Diederik",""],["Arguēlles","Jonito Aerts",""],["Beltran","Lester",""],["de Bianchi","Massimiliano Sassoli",""],["Sozzo","Sandro",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 16:24:37 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 14:37:20 GMT"}],"updateDate":"2024-09-16","timestamp":1721492677000,"abstract":"  Identical systems, or entities, are indistinguishable in quantum mechanics\n(QM), and the symmetrization postulate rules the possible statistical\ndistributions of a large number of identical quantum entities. However, a\nthorough analysis on the historical development of QM attributes the origin of\nquantum statistics, in particular, Bose-Einstein statistics, to a lack of\nstatistical independence of the micro-states of identical quantum entities. We\nhave recently identified Bose-Einstein statistics in the combination of words\nin large texts, as a consequence of the entanglement created by the meaning\ncarried by words when they combine in human language. Relying on this\ninvestigation, we put forward the hypothesis that entanglement, hence the lack\nof statistical independence, is due to a mechanism of contextual updating,\nwhich provides deeper reasons for the appearance of Bose-Einstein statistics in\nhuman language. However, this investigation also contributes to a better\nunderstanding of the origin of quantum mechanical statistics in physics.\nFinally, we provide new insights into the intrinsically random behaviour of\nmicroscopic entities that is generally assumed within classical statistical\nmechanics.\n","subjects":["Quantitative Biology/Neurons and Cognition","Physics/History and Philosophy of Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}