{"id":"2407.08026","title":"Correcting Turbulence-induced Errors in Fiber Positioning for the Dark\n  Energy Spectroscopic Instrument","authors":"E. F. Schlafly, J. Guy, K. Honscheid, S. Kent, S. E. Koposov, J.\n  Aguilar, S. Ahlen, S. Bailey, D. Brooks, T. Claybaugh, K. Dawson, P. Doel, K.\n  Fanning, D. P. Finkbeiner, A. Font-Ribera, J. E. Forero-Romero, S. Gontcho A\n  Gontcho, G. Gutierrez, D. Kirkby, T. Kisner, A. Kremin, J. Lasker, M.\n  Landriau, L. Le Guillou, M. E. Levi, A. de la Macorra, P. Martini, A.\n  Meisner, R. Miquel, J. Moustakas, G. Niz, F. Prada, G. Rossi, E. Sanchez, M.\n  Schubnell, R. Sharples, D. Sprayberry, G. Tarl\\'e, B. A. Weaver, H. Zou","authorsParsed":[["Schlafly","E. F.",""],["Guy","J.",""],["Honscheid","K.",""],["Kent","S.",""],["Koposov","S. E.",""],["Aguilar","J.",""],["Ahlen","S.",""],["Bailey","S.",""],["Brooks","D.",""],["Claybaugh","T.",""],["Dawson","K.",""],["Doel","P.",""],["Fanning","K.",""],["Finkbeiner","D. P.",""],["Font-Ribera","A.",""],["Forero-Romero","J. E.",""],["Gontcho","S. Gontcho A",""],["Gutierrez","G.",""],["Kirkby","D.",""],["Kisner","T.",""],["Kremin","A.",""],["Lasker","J.",""],["Landriau","M.",""],["Guillou","L. Le",""],["Levi","M. E.",""],["de la Macorra","A.",""],["Martini","P.",""],["Meisner","A.",""],["Miquel","R.",""],["Moustakas","J.",""],["Niz","G.",""],["Prada","F.",""],["Rossi","G.",""],["Sanchez","E.",""],["Schubnell","M.",""],["Sharples","R.",""],["Sprayberry","D.",""],["Tarlé","G.",""],["Weaver","B. A.",""],["Zou","H.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 20:07:27 GMT"}],"updateDate":"2024-07-12","timestamp":1720642047000,"abstract":"  Highly-multiplexed, robotic, fiber-fed spectroscopic surveys are observing\ntens of millions of stars and galaxies. For many systems, accurate positioning\nrelies on imaging the fibers in the focal plane and feeding that information\nback to the robotic positioners to correct their positions. Inhomogeneities and\nturbulence in the air between the focal plane and the imaging camera can affect\nthe measured positions of fibers, limiting the accuracy with which fibers can\nbe placed on targets. For the Dark Energy Spectroscopic Instrument, we\ndramatically reduced the effect of turbulence on measurements of positioner\nlocations in the focal plane by taking advantage of stationary positioners and\nthe correlation function of the turbulence. We were able to reduce positioning\nerrors from 7.3 microns to 3.5 microns, speeding the survey by 1.6% under\ntypical conditions.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}