{"id":"2407.21156","title":"Electrical Detection of Magnetization Switching in Single-Molecule\n  Magnets","authors":"Amjad Alqahtani, DaVonne Henry, Lubom\\'ir Havl\\'i\\v{c}ek, Luke St.\n  Marie, Jakub Hrub\\'y, Anton\\'in Sojka, Morgan Hale, Samuel Felsenfeld,\n  Abdelouahad El Fatimy, Rachael L. Myers-Ward, D. Kurt Gaskill, Ivan Nemec,\n  Petr Neugebauer, Amy Y. Liu and Paola Barbara","authorsParsed":[["Alqahtani","Amjad",""],["Henry","DaVonne",""],["Havlíček","Lubomír",""],["Marie","Luke St.",""],["Hrubý","Jakub",""],["Sojka","Antonín",""],["Hale","Morgan",""],["Felsenfeld","Samuel",""],["Fatimy","Abdelouahad El",""],["Myers-Ward","Rachael L.",""],["Gaskill","D. Kurt",""],["Nemec","Ivan",""],["Neugebauer","Petr",""],["Liu","Amy Y.",""],["Barbara","Paola",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 19:38:22 GMT"}],"updateDate":"2024-08-01","timestamp":1722368302000,"abstract":"  Single-molecule magnets (SMMs) with chemically tailorable properties are\npotential building blocks for quantum computing, high-density magnetic memory,\nand spintronics.1 2 3,4 These applications require isolated or few molecules on\nsubstrates, but studies of SMMs have mainly focused on bulk crystals. Moreover,\nfabrication of SMM-based devices and electrical detection of the SMM magnetic\nstate are still coveted milestones that have so far been achieved mainly for\ndouble-decker rare-earth phthalocyanines at temperatures below 1 K.5-8 Here we\ndemonstrate electrical detection of magnetization switching for a modification\nof the archetypal SMM Mn12, up to 70 K, based on the supramolecular spin valve\neffect5 with graphene quantum dots9. Notably, the exchange interaction between\nthe molecules and the graphene, as well as the dot-mediated intermolecular\ninteraction, can be directly extracted from the electrical response, opening\nthe way to an effective characterization of the quantum properties of different\ntypes of SMMs in a wide temperature range.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}