{"id":"2407.21321","title":"Hyper parametric timed CTL","authors":"Masaki Waga, \\'Etienne Andr\\'e","authorsParsed":[["Waga","Masaki",""],["André","Étienne",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 04:02:56 GMT"}],"updateDate":"2024-08-01","timestamp":1722398576000,"abstract":"  Hyperproperties enable simultaneous reasoning about multiple execution traces\nof a system and are useful to reason about non-interference, opacity,\nrobustness, fairness, observational determinism, etc. We introduce hyper\nparametric timed computation tree logic (HyperPTCTL), extending hyperlogics\nwith timing reasoning and, notably, parameters to express unknown values. We\nmainly consider its nest-free fragment, where temporal operators cannot be\nnested. However, we allow extensions that enable counting actions and comparing\nthe duration since the most recent occurrence of specific actions. We show that\nour nest-free fragment with this extension is sufficiently expressive to encode\nproperties, e.g., opacity, (un)fairness, or robust observational\n(non-)determinism. We propose semi-algorithms for model checking and synthesis\nof parametric timed automata (an extension of timed automata with timing\nparameters) against this nest-free fragment with the extension via reduction to\nPTCTL model checking and synthesis. While the general model checking (and thus\nsynthesis) problem is undecidable, we show that a large part of our extended\n(yet nest-free) fragment is decidable, provided the parameters only appear in\nthe property, not in the model. We also exhibit additional decidable fragments\nwhere parameters within the model are allowed. We implemented our\nsemi-algorithms on top of the IMITATOR model checker, and performed\nexperiments. Our implementation supports most of the nest-free fragments\n(beyond the decidable classes). The experimental results highlight our method's\npractical relevance.\n","subjects":["Computing Research Repository/Formal Languages and Automata Theory","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}