{"id":"2407.14630","title":"Identification of changes in gene expression","authors":"Lucia Ameis, Kathrin M\\\"ollenhoff","authorsParsed":[["Ameis","Lucia",""],["Möllenhoff","Kathrin",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 18:58:01 GMT"}],"updateDate":"2024-07-23","timestamp":1721415481000,"abstract":"  Evaluating the change in gene expression is a common goal in many research\nareas, such as in toxicological studies as well as in clinical trials. In\npractice, the analysis is often based on multiple t-tests evaluated at the\nobserved time points. This severely limits the accuracy of determining the time\npoints at which the gene changes in expression. Even if a parametric approach\nis chosen, the analysis is often restricted to identifying the onset of an\neffect. In this paper, we propose a parametric method to identify the time\nframe where the gene expression significantly changes. This is achieved by\nfitting a parametric model to the time-response data and constructing a\nconfidence band for its first derivative. The confidence band is derived by a\nflexible two step bootstrap approach, which can be applied to a wide variety of\npossible curves. Our method focuses on the first derivative, since it provides\nan easy to compute and reliable measure for the change in response. It is\nsummarised in terms of a hypothesis test, such that rejecting the null\nhypothesis means detecting a significant change in gene expression.\nFurthermore, a method for calculating confidence intervals for time points of\ninterest (e.g. the beginning and end of significant change) is developed. We\ndemonstrate the validity of our approach through a simulation study and present\na variety of different applications to mouse gene expression data from a study\ninvestigating the effect of a Western diet on the progression of non-alcoholic\nfatty liver disease.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}