{"id":"2407.19942","title":"Predicting citation impact of research papers using GPT and other text\n  embeddings","authors":"Adilson Vital Jr., Filipi N. Silva, Osvaldo N. Oliveira Jr. and Diego\n  R. Amancio","authorsParsed":[["Vital","Adilson","Jr."],["Silva","Filipi N.",""],["Oliveira","Osvaldo N.","Jr."],["Amancio","Diego R.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 12:23:15 GMT"}],"updateDate":"2024-07-30","timestamp":1722255795000,"abstract":"  The impact of research papers, typically measured in terms of citation\ncounts, depends on several factors, including the reputation of the authors,\njournals, and institutions, in addition to the quality of the scientific work.\nIn this paper, we present an approach that combines natural language processing\nand machine learning to predict the impact of papers in a specific journal. Our\nfocus is on the text, which should correlate with impact and the topics covered\nin the research. We employed a dataset of over 40,000 articles from ACS Applied\nMaterials and Interfaces spanning from 2012 to 2022. The data was processed\nusing various text embedding techniques and classified with supervised machine\nlearning algorithms. Papers were categorized into the top 20% most cited within\nthe journal, using both yearly and cumulative citation counts as metrics. Our\nanalysis reveals that the method employing generative pre-trained transformers\n(GPT) was the most efficient for embedding, while the random forest algorithm\nexhibited the best predictive power among the machine learning algorithms. An\noptimized accuracy of 80\\% in predicting whether a paper was among the top 20%\nmost cited was achieved for the cumulative citation count when abstracts were\nprocessed. This accuracy is noteworthy, considering that author, institution,\nand early citation pattern information were not taken into account. The\naccuracy increased only slightly when the full texts of the papers were\nprocessed. Also significant is the finding that a simpler embedding technique,\nterm frequency-inverse document frequency (TFIDF), yielded performance close to\nthat of GPT. Since TFIDF captures the topics of the paper we infer that, apart\nfrom considering author and institution biases, citation counts for the\nconsidered journal may be predicted by identifying topics and \"reading\" the\nabstract of a paper.\n","subjects":["Computing Research Repository/Digital Libraries"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}