{"id":"2407.06022","title":"Investigation of microstructural evolution of irradiation-induced\n  defects in tungsten: an experimental-numerical approach","authors":"Salahudeen Mohamed, Qian Yuan, Dimitri Litvinov, Jie Gao, Ermile\n  Gaganidze, Dmitry Terentyev, Hans-Christian Schneider, Jarir Aktaa","authorsParsed":[["Mohamed","Salahudeen",""],["Yuan","Qian",""],["Litvinov","Dimitri",""],["Gao","Jie",""],["Gaganidze","Ermile",""],["Terentyev","Dmitry",""],["Schneider","Hans-Christian",""],["Aktaa","Jarir",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 15:16:43 GMT"}],"updateDate":"2024-07-09","timestamp":1720451803000,"abstract":"  The hostile condition in a fusion tokomak reactor poses the main challenge in\nthe development and design of in-vessel components such as divertor and\nbreeding blanket due to fusion relevant irradiation conditions (14 MeV) and\nlarge thermal loads. The current work describes the employment of an integrated\nexperimental-numerical approach to assess the microstructure evolution of\ndislocation loops and voids in tungsten proposed for fusion application.\nCluster dynamics (CD) model is implemented and simulations are performed on the\nirradiated tungsten Disk shape Compact Tension (DCT) specimen used in the\nexperimental test. TEM characterisation is performed on the DCT specimen\nirradiated at 400 {\\deg}C and 600 {\\deg}C with around 1 dpa, respectively. The\ndpa rate and cascade overlap rate from the experiments and SPECTRA-PKA code,\nrespectively, are implemented in the CD model. Based on the comparison between\nexperimental and computational results, the dose and temperature dependence of\nirradiation-induced defects (dislocation loops, voids, c15 clusters) are\nclearly observed. Trap mediated diffusion is studied and the impact of cascades\nwith the pre-existing defects is analysed through full cascade overlap mode and\nthe consequent influence on the defect concentration is evaluated. The exchange\nof self-interstitial atoms (SIAs) and the change in the size of loops through\nreaction between <111> and <100> loops are studied in detail by means of the\ntransfer rate of the SIAs.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}