{"id":"2407.17740","title":"Machine Learning Potential for Electrochemical Interfaces with Hybrid\n  Representation of Dielectric Response","authors":"Jia-Xin Zhu and Jun Cheng","authorsParsed":[["Zhu","Jia-Xin",""],["Cheng","Jun",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 03:29:52 GMT"}],"updateDate":"2024-07-26","timestamp":1721878192000,"abstract":"  Understanding electrochemical interfaces at a microscopic level is essential\nfor elucidating important electrochemical processes in electrocatalysis,\nbatteries and corrosion. While \\textit{ab initio} simulations have provided\nvaluable insights into model systems, the high computational cost limits their\nuse in tackling complex systems of relevance to practical applications. Machine\nlearning potentials offer a solution, but their application in electrochemistry\nremains challenging due to the difficulty in treating the dielectric response\nof electronic conductors and insulators simultaneously. In this work, we\npropose a hybrid framework of machine learning potentials that is capable of\nsimulating metal/electrolyte interfaces by unifying the interfacial dielectric\nresponse accounting for local electronic polarisation in electrolytes and\nnon-local charge transfer in metal electrodes. We validate our method by\nreproducing the bell-shaped differential Helmholtz capacitance at the\nPt(111)/electrolyte interface. Furthermore, we apply the machine learning\npotential to calculate the dielectric profile at the interface, providing new\ninsights into electronic polarisation effects. Our work lays the foundation for\natomistic modelling of complex, realistic electrochemical interfaces using\nmachine learning potential at \\textit{ab initio} accuracy.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LZQoB7Y0AzxaZoIHJ-YZx3Af4EEk_dCVAm16jTa9ZME","pdfSize":"2162472","objectId":"0xabfd79e315775d9ce9462cc30a89b620ca4f8ad1ef5fae1abb341814e5014976","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
