{"id":"2407.12795","title":"The need of a self for self-driving cars a theoretical model applying\n  homeostasis to self driving","authors":"Martin Schmalzried","authorsParsed":[["Schmalzried","Martin",""]],"versions":[{"version":"v1","created":"Wed, 19 Jun 2024 22:26:26 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 14:43:52 GMT"}],"updateDate":"2024-07-22","timestamp":1718835986000,"abstract":"  This paper explores the concept of creating a \"self\" for self-driving cars\nthrough a homeostatic architecture designed to enhance their autonomy, safety,\nand efficiency. The proposed system integrates inward focused sensors to\nmonitor the car's internal state, such as the condition of its metal bodywork,\nwheels, engine, and battery, establishing a baseline homeostatic state\nrepresenting optimal functionality. Outward facing sensors, like cameras and\nLIDAR, are then interpreted via their impact on the car's homeostatic state by\nquantifying deviations from homeostasis. This contrasts with the approach of\ntrying to make cars \"see\" reality in a similar way to humans and identify\nelements in their reality in the same way humans. Virtual environments would be\nleveraged to accelerate training. Additionally, cars are programmed to\ncommunicate and share experiences via blockchain technology, learning from each\nother's mistakes while maintaining individualized training models. A dedicated\nlanguage for self-driving cars is proposed to enable nuanced interpretation and\nresponse to environmental data. This architecture allows self-driving cars to\ndynamically adjust their behavior based on internal and external feedback,\npromoting cooperation and continuous improvement. The study concludes by\ndiscussing the broader implications for AI development, potential real-world\napplications, and future research directions.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}