{"id":"2407.20566","title":"Monocular Human-Object Reconstruction in the Wild","authors":"Chaofan Huo, Ye Shi and Jingya Wang","authorsParsed":[["Huo","Chaofan",""],["Shi","Ye",""],["Wang","Jingya",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 05:45:06 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 08:45:19 GMT"}],"updateDate":"2024-08-01","timestamp":1722318306000,"abstract":"  Learning the prior knowledge of the 3D human-object spatial relation is\ncrucial for reconstructing human-object interaction from images and\nunderstanding how humans interact with objects in 3D space. Previous works\nlearn this prior from datasets collected in controlled environments, but due to\nthe diversity of domains, they struggle to generalize to real-world scenarios.\nTo overcome this limitation, we present a 2D-supervised method that learns the\n3D human-object spatial relation prior purely from 2D images in the wild. Our\nmethod utilizes a flow-based neural network to learn the prior distribution of\nthe 2D human-object keypoint layout and viewports for each image in the\ndataset. The effectiveness of the prior learned from 2D images is demonstrated\non the human-object reconstruction task by applying the prior to tune the\nrelative pose between the human and the object during the post-optimization\nstage. To validate and benchmark our method on in-the-wild images, we collect\nthe WildHOI dataset from the YouTube website, which consists of various\ninteractions with 8 objects in real-world scenarios. We conduct the experiments\non the indoor BEHAVE dataset and the outdoor WildHOI dataset. The results show\nthat our method achieves almost comparable performance with fully 3D supervised\nmethods on the BEHAVE dataset, even if we have only utilized the 2D layout\ninformation, and outperforms previous methods in terms of generality and\ninteraction diversity on in-the-wild images.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}