{"id":"2407.05262","title":"FastSpiker: Enabling Fast Training for Spiking Neural Networks on\n  Event-based Data through Learning Rate Enhancements for Autonomous Embedded\n  Systems","authors":"Iqra Bano, Rachmad Vidya Wicaksana Putra, Alberto Marchisio, Muhammad\n  Shafique","authorsParsed":[["Bano","Iqra",""],["Putra","Rachmad Vidya Wicaksana",""],["Marchisio","Alberto",""],["Shafique","Muhammad",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 05:17:17 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 18:28:17 GMT"}],"updateDate":"2024-09-16","timestamp":1720329437000,"abstract":"  Autonomous embedded systems (e.g., robots) typically necessitate intelligent\ncomputation with low power/energy processing for completing their tasks. Such\nrequirements can be fulfilled by embodied neuromorphic intelligence with\nspiking neural networks (SNNs) because of their high learning quality (e.g.,\naccuracy) and sparse computation. Here, the employment of event-based data is\npreferred to ensure seamless connectivity between input and processing parts.\nHowever, state-of-the-art SNNs still face a long training time to achieve high\naccuracy, thereby incurring high energy consumption and producing a high rate\nof carbon emission. Toward this, we propose FastSpiker, a novel methodology\nthat enables fast SNN training on event-based data through learning rate\nenhancements targeting autonomous embedded systems. In FastSpiker, we first\ninvestigate the impact of different learning rate policies and their values,\nthen select the ones that quickly offer high accuracy. Afterward, we explore\ndifferent settings for the selected learning rate policies to find the\nappropriate policies through a statistical-based decision. Experimental results\nshow that our FastSpiker offers up to 10.5x faster training time and up to\n88.39% lower carbon emission to achieve higher or comparable accuracy to the\nstate-of-the-art on the event-based automotive dataset (i.e., NCARS). In this\nmanner, our FastSpiker methodology paves the way for green and sustainable\ncomputing in realizing embodied neuromorphic intelligence for autonomous\nembedded systems.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}