{"id":"2407.07771","title":"Multi-task Prompt Words Learning for Social Media Content Generation","authors":"Haochen Xue, Chong Zhang, Chengzhi Liu, Fangyu Wu, Xiaobo Jin","authorsParsed":[["Xue","Haochen",""],["Zhang","Chong",""],["Liu","Chengzhi",""],["Wu","Fangyu",""],["Jin","Xiaobo",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:46:32 GMT"}],"updateDate":"2024-07-11","timestamp":1720626392000,"abstract":"  The rapid development of the Internet has profoundly changed human life.\nHumans are increasingly expressing themselves and interacting with others on\nsocial media platforms. However, although artificial intelligence technology\nhas been widely used in many aspects of life, its application in social media\ncontent creation is still blank. To solve this problem, we propose a new prompt\nword generation framework based on multi-modal information fusion, which\ncombines multiple tasks including topic classification, sentiment analysis,\nscene recognition and keyword extraction to generate more comprehensive prompt\nwords. Subsequently, we use a template containing a set of prompt words to\nguide ChatGPT to generate high-quality tweets. Furthermore, in the absence of\neffective and objective evaluation criteria in the field of content generation,\nwe use the ChatGPT tool to evaluate the results generated by the algorithm,\nmaking large-scale evaluation of content generation algorithms possible.\nEvaluation results on extensive content generation demonstrate that our cue\nword generation framework generates higher quality content compared to manual\nmethods and other cueing techniques, while topic classification, sentiment\nanalysis, and scene recognition significantly enhance content clarity and its\nconsistency with the image.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pcSVjb04oFBnY8OU7Pv0E0xjhw_wzD1qqg1wnUmTgps","pdfSize":"3270014"}
