{"id":"2407.02626","title":"The text2term tool to map free-text descriptions of biomedical terms to\n  ontologies","authors":"Rafael S. Gon\\c{c}alves, Jason Payne, Amelia Tan, Carmen Benitez,\n  Jamie Haddock, Robert Gentleman","authorsParsed":[["Gonçalves","Rafael S.",""],["Payne","Jason",""],["Tan","Amelia",""],["Benitez","Carmen",""],["Haddock","Jamie",""],["Gentleman","Robert",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 19:36:37 GMT"}],"updateDate":"2024-07-04","timestamp":1719948997000,"abstract":"  There is an ongoing need for scalable tools to aid researchers in both\nretrospective and prospective standardization of discrete entity types -- such\nas disease names, cell types or chemicals -- that are used in metadata\nassociated with biomedical data. When metadata are not well-structured or\nprecise, the associated data are harder to find and are often burdensome to\nreuse, analyze or integrate with other datasets due to the upfront curation\neffort required to make the data usable -- typically through retrospective\nstandardization and cleaning of the (meta)data. With the goal of facilitating\nthe task of standardizing metadata -- either in bulk or in a one-by-one\nfashion; for example, to support auto-completion of biomedical entities in\nforms -- we have developed an open-source tool called text2term that maps\nfree-text descriptions of biomedical entities to controlled terms in\nontologies. The tool is highly configurable and can be used in multiple ways\nthat cater to different users and expertise levels -- it is available on PyPI\nand can be used programmatically as any Python package; it can also be used via\na command-line interface; or via our hosted, graphical user interface-based Web\napplication (https://text2term.hms.harvard.edu); or by deploying a local\ninstance of our interactive application using Docker.\n","subjects":["Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9UrJqV_sXeGpFE_MXqciZtClD2PAJXPkoqHWD_3ko7Q","pdfSize":"1724748"}
