{"id":"2407.10789","title":"Tailoring Solution Accuracy for Fast Whole-body Model Predictive Control\n  of Legged Robots","authors":"Charles Khazoom, Seungwoo Hong, Matthew Chignoli, Elijah Stanger-Jones\n  and Sangbae Kim","authorsParsed":[["Khazoom","Charles",""],["Hong","Seungwoo",""],["Chignoli","Matthew",""],["Stanger-Jones","Elijah",""],["Kim","Sangbae",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 15:08:17 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 14:44:02 GMT"}],"updateDate":"2024-09-13","timestamp":1721056097000,"abstract":"  Thanks to recent advancements in accelerating non-linear model predictive\ncontrol (NMPC), it is now feasible to deploy whole-body NMPC at real-time rates\nfor humanoid robots. However, enforcing inequality constraints in real time for\nsuch high-dimensional systems remains challenging due to the need for\nadditional iterations. This paper presents an implementation of whole-body NMPC\nfor legged robots that provides low-accuracy solutions to NMPC with general\nequality and inequality constraints. Instead of aiming for highly accurate\noptimal solutions, we leverage the alternating direction method of multipliers\nto rapidly provide low-accuracy solutions to quadratic programming subproblems.\nOur extensive simulation results indicate that real robots often cannot benefit\nfrom highly accurate solutions due to dynamics discretization errors, inertial\nmodeling errors and delays. We incorporate control barrier functions (CBFs) at\nthe initial timestep of the NMPC for the self-collision constraints, resulting\nin up to a 26-fold reduction in the number of self-collisions without adding\ncomputational burden. The controller is reliably deployed on hardware at 90 Hz\nfor a problem involving 32 timesteps, 2004 variables, and 3768 constraints. The\nNMPC delivers sufficiently accurate solutions, enabling the MIT Humanoid to\nplan complex crossed-leg and arm motions that enhance stability when walking\nand recovering from significant disturbances.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}