{"id":"2407.20493","title":"Magnetic ordering of the Mo$_3$O$_8$-type cluster Mott insulator\n  Na$_3$Sc$_2$(MoO$_4$)$_2$Mo$_3$O$_8$ with spin-1/2 triangular lattice\n  prepared via optimal synthesis","authors":"Yuya Haraguchi, Daigo Ishikita, and Hiroko Aruga Katori","authorsParsed":[["Haraguchi","Yuya",""],["Ishikita","Daigo",""],["Katori","Hiroko Aruga",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 01:26:48 GMT"}],"updateDate":"2024-08-29","timestamp":1722302808000,"abstract":"  We detail the optimized synthesis of the Mo$_3$O$_8$-type cluster Mott\ninsulator (CMI) Na$_3$Sc$_2$(MoO$_4$)$_2$Mo$_3$O$_8$, which has been considered\na candidate for realizing the spin liquid ground state. The optimized\nNa$_3$Sc$_2$(MoO$_4$)$_2$Mo$_3$O$_8$, characterized by x-ray diffraction,\nenergy-dispersive x-ray spectroscopy, and magnetic and heat capacity\nmeasurements, exhibited an effective magnetic moment close to the ideal 1.73\n$\\mu_{\\mathrm B}$ for $S = 1/2$ spin and magnetic ordering at $\\sim$ 5 K. These\nobservations categorize Na$_3$Sc$_2$(MoO$_4$)$_2$Mo$_3$O$_8$ as the second\nMo$_3$O$_8$-type CMI to achieve a magnetic ground state, following\nLi$_2$InMo$_3$O$_8$. They highlight the stabilization of the magnetic ground\nstate over the theoretically anticipated quantum spin liquid state through\nprecise valence and chemical disorder tuning. Our findings challenge the\nexisting theory that the magnetic ground state of Mo$_3$O$_8$-type CMIs is\ndetermined by the breathing parameter, instead showing that magnetic order is\nsuppressed by spin defects. This study underscores the crucial role of chemical\nprecision in investigating quantum magnetism. It suggests that precise tuning\nof valence states could induce magnetic ordering in previously nonmagnetic\nMo$_3$O$_8$-type CMIs. Additionally, the negative findings regarding the\nexistence of quantum spin liquids highlight the need for applied research and a\nreevaluation of our fundamental understanding of electronic states from both\ntheoretical and experimental aspects.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}