{"id":"2407.08624","title":"Physical-chemical Approach for the Impact of Modifying Molecular Bridges\n  of TPA-Based Systems to Improve the Photovoltaic Properties of Organic Solar\n  Cells","authors":"Duvalier Madrid-\\'Usuga, Omar J. Su\\'arez","authorsParsed":[["Madrid-Úsuga","Duvalier",""],["Suárez","Omar J.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 16:00:30 GMT"}],"updateDate":"2024-07-12","timestamp":1720713630000,"abstract":"  The theoretical design of donor chromophores based on triphenylamine and\n2-(1,1-dicyanomethylene)rhodanine (\\textbf{DCRD-DCRD-2}) is proposed through\nstructural adaptation with several molecular bridges derived from thiophene\nthat can be used as new organic materials for organic solar cells (OSC). The\noptoelectronics properties and geometries of the \\textbf{DCRD-DCRD-2} organic\nmolecules are characterized using the B3LYP and CAM-B3LYP functional, with the\nbasis set 6-31G(d,p). Consequently, the UV-Visible results revealed that a good\nrelationship was found between the experimental values and the calculated using\nthe DFT and TD-DFT level of theory. The study involved the prediction of\nphoto-physical descriptors such as frontier molecular orbitals, ionization\npotential, electron affinity, molecular electrostatic potential, reorganization\nenergy, open circuit voltage ($V_{oc}$), fill factor (FF), and short-circuit\ncurrent ($J_{sc}$) in the ground state geometry, using the B3LYP/6-31G(d,p)\nbasis set. Structural tailoring with various molecular bridges resulted in a\nnarrowing of the energy gap (2.130--1.96eV) with broader absorption spectra\n(525.55--417.69 nm). An effective charge transfer toward the lowest unoccupied\nmolecular orbitals (LUMO) from the highest occupied molecular orbitals (HOMO)\nwas studied, which played a crucial role in conducting materials.\n\\textbf{DCRD-2} exhibited $\\lambda_{max}$ at $417.69$~nm in EtOH (ethanol)\nsolvent with the lowest band gap (1.96 eV) and the lowest excitation energy of\n2.968 eV. The highest mobility of holes and electrons is determined in all the\ndesigned molecules due to their low reorganization energy values that validated\npreferable photovoltaic properties in the \\textbf{DCRD-1} molecular system.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}