{"id":"2407.16935","title":"Federated Automatic Latent Variable Selection in Multi-output Gaussian\n  Processes","authors":"Jingyi Gao, Seokhyun Chung","authorsParsed":[["Gao","Jingyi",""],["Chung","Seokhyun",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 02:03:28 GMT"}],"updateDate":"2024-07-25","timestamp":1721786608000,"abstract":"  This paper explores a federated learning approach that automatically selects\nthe number of latent processes in multi-output Gaussian processes (MGPs). The\nMGP has seen great success as a transfer learning tool when data is generated\nfrom multiple sources/units/entities. A common approach in MGPs to transfer\nknowledge across units involves gathering all data from each unit to a central\nserver and extracting common independent latent processes to express each unit\nas a linear combination of the shared latent patterns. However, this approach\nposes key challenges in (i) determining the adequate number of latent processes\nand (ii) relying on centralized learning which leads to potential privacy risks\nand significant computational burdens on the central server. To address these\nissues, we propose a hierarchical model that places spike-and-slab priors on\nthe coefficients of each latent process. These priors help automatically select\nonly needed latent processes by shrinking the coefficients of unnecessary ones\nto zero. To estimate the model while avoiding the drawbacks of centralized\nlearning, we propose a variational inference-based approach, that formulates\nmodel inference as an optimization problem compatible with federated settings.\nWe then design a federated learning algorithm that allows units to jointly\nselect and infer the common latent processes without sharing their data. We\nalso discuss an efficient learning approach for a new unit within our proposed\nfederated framework. Simulation and case studies on Li-ion battery degradation\nand air temperature data demonstrate the advantageous features of our proposed\napproach.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"awciKp6f6r0Vlud77VLE5thRuX-FQ2QY0C9yNPIvaOI","pdfSize":"3049914","objectId":"0x13dcd29ba593f7be867dd203d5b6e153f5fa1cc42095fabf14999f8ec998e809","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
