{"id":"2407.16410","title":"Securing Tomorrow's Smart Cities: Investigating Software Security in\n  Internet of Vehicles and Deep Learning Technologies","authors":"Ridhi Jain, Norbert Tihanyi, Mohamed Amine Ferrag","authorsParsed":[["Jain","Ridhi",""],["Tihanyi","Norbert",""],["Ferrag","Mohamed Amine",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 11:56:33 GMT"}],"updateDate":"2024-07-24","timestamp":1721735793000,"abstract":"  Integrating Deep Learning (DL) techniques in the Internet of Vehicles (IoV)\nintroduces many security challenges and issues that require thorough\nexamination. This literature review delves into the inherent vulnerabilities\nand risks associated with DL in IoV systems, shedding light on the multifaceted\nnature of security threats. Through an extensive analysis of existing research,\nwe explore potential threats posed by DL algorithms, including adversarial\nattacks, data privacy breaches, and model poisoning. Additionally, we\ninvestigate the impact of DL on critical aspects of IoV security, such as\nintrusion detection, anomaly detection, and secure communication protocols. Our\nreview emphasizes the complexities of ensuring the robustness, reliability, and\ntrustworthiness of DL-based IoV systems, given the dynamic and interconnected\nnature of vehicular networks. Furthermore, we discuss the need for novel\nsecurity solutions tailored to address these challenges effectively and enhance\nthe security posture of DL-enabled IoV environments. By offering insights into\nthese critical issues, this chapter aims to stimulate further research,\ninnovation, and collaboration in securing DL techniques within the context of\nthe IoV, thereby fostering a safer and more resilient future for vehicular\ncommunication and connectivity.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Q3VzqCF2Kl_kgbP9I1HV0KSc9ubIxJklgb4Xaw8d71Y","pdfSize":"1233887"}
