{"id":"2407.12728","title":"Exploring the interplay of individual traits and interaction dynamics in\n  preschool social networks","authors":"G\\\"ul\\c{s}ah Ak\\c{c}ak{\\i}r, Amina Azaiez, Alberto Ceria, Clara\n  Eminente, Guglielmo Ferranti, Govind Gandhi, Aishvarya Raj, Iacopo Iacopini","authorsParsed":[["Akçakır","Gülşah",""],["Azaiez","Amina",""],["Ceria","Alberto",""],["Eminente","Clara",""],["Ferranti","Guglielmo",""],["Gandhi","Govind",""],["Raj","Aishvarya",""],["Iacopini","Iacopo",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 16:47:21 GMT"}],"updateDate":"2024-07-18","timestamp":1721234841000,"abstract":"  Several studies have investigated human interaction using modern tracking\ntechniques for face-to-face encounters across various settings and age groups.\nHowever, little attention has been given to understanding how individual\ncharacteristics relate to social behavior. This is particularly important in\nyounger age groups due to its potential effects on early childhood development.\nIn this study, conducted during the Complexity 72h Workshop, we analyze human\nsocial interactions in a French preschool, where children's face-to-face\ninteractions were monitored using proximity sensors over an academic year. We\nuse metadata from parent surveys and preschool linguistic tests, covering\ndemographic information and home habits, to examine the interplay between\nindividual characteristics and contact patterns. Using a mixture of approaches,\nfrom random forest classifiers to network-based metrics at both dyadic and\nhigher-order (group) levels, we identify sex, age, language scores, and number\nof siblings as the variables displaying the most significant associations with\ninteraction patterns. We explore these variables' relationships to interactions\nwithin and outside classrooms and across mixed and single-grade classes. At the\ngroup level, we investigate how group affinity affects group persistence. We\nalso find that higher-order network centrality (hypercoreness) is higher among\nchildren with siblings, indicating different group embedding despite similar\ntotal contact duration. This study aligns with existing literature on early\nsocial development and highlights the importance of integrating individual\ntraits into the study of human interactions. Focusing on 2-5-year-olds offers\ninsights into emerging social preferences during critical phases of cognitive\ndevelopment. Future research could use these findings to enhance mechanistic\nmodels of complex social systems by incorporating individual traits.\n","subjects":["Physics/Physics and Society","Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}