{"id":"2407.11477","title":"XTraffic: A Dataset Where Traffic Meets Incidents with Explainability\n  and More","authors":"Xiaochuan Gou, Ziyue Li, Tian Lan, Junpeng Lin, Zhishuai Li, Bingyu\n  Zhao, Chen Zhang, Di Wang, Xiangliang Zhang","authorsParsed":[["Gou","Xiaochuan",""],["Li","Ziyue",""],["Lan","Tian",""],["Lin","Junpeng",""],["Li","Zhishuai",""],["Zhao","Bingyu",""],["Zhang","Chen",""],["Wang","Di",""],["Zhang","Xiangliang",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 08:16:01 GMT"}],"updateDate":"2024-07-17","timestamp":1721117761000,"abstract":"  Long-separated research has been conducted on two highly correlated tracks:\ntraffic and incidents. Traffic track witnesses complicating deep learning\nmodels, e.g., to push the prediction a few percent more accurate, and the\nincident track only studies the incidents alone, e.g., to infer the incident\nrisk. We, for the first time, spatiotemporally aligned the two tracks in a\nlarge-scale region (16,972 traffic nodes) over the whole year of 2023: our\nXTraffic dataset includes traffic, i.e., time-series indexes on traffic flow,\nlane occupancy, and average vehicle speed, and incidents, whose records are\nspatiotemporally-aligned with traffic data, with seven different incident\nclasses. Additionally, each node includes detailed physical and policy-level\nmeta-attributes of lanes. Our data can revolutionalize traditional\ntraffic-related tasks towards higher interpretability and practice: instead of\ntraditional prediction or classification tasks, we conduct: (1) post-incident\ntraffic forecasting to quantify the impact of different incidents on traffic\nindexes; (2) incident classification using traffic indexes to determine the\nincidents types for precautions measures; (3) global causal analysis among the\ntraffic indexes, meta-attributes, and incidents to give high-level guidance of\nthe interrelations of various factors; (4) local causal analysis within road\nnodes to examine how different incidents affect the road segments' relations.\nThe dataset is available at http://xaitraffic.github.io.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}