{"id":"2407.10407","title":"Distributed Scheduling for Throughput Maximization under Deadline\n  Constraint in Wireless Mesh Networks","authors":"Xin Wang and Xudong Wang","authorsParsed":[["Wang","Xin",""],["Wang","Xudong",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 02:56:02 GMT"}],"updateDate":"2024-07-16","timestamp":1721012162000,"abstract":"  This paper studies the distributed scheduling of traffic flows with arbitrary\ndeadlines that arrive at their source nodes and are transmitted to different\ndestination nodes via multiple intermediate nodes in a wireless mesh network.\nWhen a flow is successfully delivered to its destination, a reward will be\nobtained, which is the embodiment of network performance and can be expressed\nby metrics such as throughput or network utility. The objective is to maximize\nthe aggregate reward of all the deadline-constrained flows, which can be\ntransformed into the constrained Markov decision process (CMDP). According to\nthe transformation, a policy gradient-based distributed scheduling (PGDS)\nmethod is first proposed, where a primary reward and an auxiliary reward are\ndesigned to incentivize each node to independently schedule network resources\nsuch as power and subcarriers. The primary reward is generated when flows are\nsuccessfully delivered to their destinations. The auxiliary reward, designed\nbased on potential-based reward shaping (PBRS) using local information of data\ntransmission, aims to accelerate the convergence speed. Inside this method, a\nreward feedback scheme is designed to let each node obtain the primary reward.\nNoting that each node selecting resources independently may cause interference\nand collision which leads to instability of data transmission, a policy\ngradient-based resource determination algorithm is proposed. Moreover, the\noptimality and convergence of the PGDS method are derived. Especially, when a\npolicy obtained by the algorithm is not matched with the optimal policy but can\nbetter deal with the interference, an asymptotic optimum still exists and is\nfurther derived.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ZVGAI9qm_dJ5htzduaZgjTnIEvzhfnxknrI3ZXT3_4E","pdfSize":"797115"}
