{"id":"2407.06444","title":"First laboratory and on-sky results of an adaptive secondary mirror with\n  TNO-style actuators on the NASA Infrared Telescope Facility","authors":"Ellen Lee, Mark Chun, Olivier Lai, Ruihan Zhang, Max Baeten, Arjo Bos,\n  Matias Kidron, Fred Kamphues, Stefan Kuiper, Wouter Jonker, Michael\n  Connelley, John Rayner, Alan Ryan, Philip Hinz, Rachel Bowens-Rubin, Charles\n  Lockhart, Michael Kelii","authorsParsed":[["Lee","Ellen",""],["Chun","Mark",""],["Lai","Olivier",""],["Zhang","Ruihan",""],["Baeten","Max",""],["Bos","Arjo",""],["Kidron","Matias",""],["Kamphues","Fred",""],["Kuiper","Stefan",""],["Jonker","Wouter",""],["Connelley","Michael",""],["Rayner","John",""],["Ryan","Alan",""],["Hinz","Philip",""],["Bowens-Rubin","Rachel",""],["Lockhart","Charles",""],["Kelii","Michael",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 23:00:03 GMT"}],"updateDate":"2024-09-11","timestamp":1720479603000,"abstract":"  We are developing an adaptive secondary mirror (ASM) that uses a new actuator\ntechnology created by the Netherlands Organization for Applied Scientific\nResearch (TNO). The TNO hybrid variable reluctance actuators have more than an\norder of magnitude better efficiency over the traditional voice coil actuators\nthat have been used on existing ASMs and show potential for improving the\nlong-term robustness and reliability of ASMs. To demonstrate the performance,\noperations, and serviceability of TNO's actuators in an observatory, we have\ndeveloped a 36-actuator prototype ASM for the NASA Infrared Telescope Facility\n(IRTF) called IRTF-ASM-1. IRTF-ASM-1 provides the first on-sky demonstration of\nthis approach and will help us evaluate the long-term performance and use of\nthis technology in an astronomical facility environment. We present calibration\nand performance results with the ASM in a Meniscus Hindle Sphere lens setup as\nwell as preliminary on-sky results on IRTF. IRTF-ASM-1 achieved stable\nclosed-loop performance on-sky with H-band Strehl ratios of 35-40% in\nlong-exposure images under a variety of seeing conditions.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}