{"id":"2407.05960","title":"Element abundances of galactic RGB stars in the APO-K2 catalogue.\n  Dissimilarity in the scaling with [$\\alpha$/Fe]","authors":"G. Valle, M. Dell'Omodarme, P.G. Prada Moroni, S. Degl'Innocenti","authorsParsed":[["Valle","G.",""],["Dell'Omodarme","M.",""],["Moroni","P. G. Prada",""],["Degl'Innocenti","S.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 13:59:15 GMT"}],"updateDate":"2024-07-09","timestamp":1720447155000,"abstract":"  We conducted an investigation on the chemical abundances of 4,316 stars in\nthe red giant branch (RGB) phase from the recently released APO-K2 catalogue.\nOur aim was to characterize the abundance trends of the single elements with\n[$\\alpha$/Fe], mainly focusing on C, N, and O, which are the most relevant for\nthe estimation of stellar ages. The chemical analysis of the RGB sample\ninvolved cross-matching data from the APO-K2 catalogue with individual element\nabundances from APOGEE DR17. The analysis detected a statistically significant\ndifference in the [(C+N+O)/Fe] - [$\\alpha$/Fe] trend with respect to the simple\n$\\alpha$-enhancement scenario. This difference remained robust across different\nchoices for the reference solar mixture and potential zero-point calibrations\nof C and N abundances. The primary discrepancy was a steeper increase in [O/Fe]\nwith [$\\alpha$/Fe], reaching a 0.1 dex difference at [$\\alpha$/Fe] = 0.3.\nNotably, the impact on the evolutionary timescale of such oxygen over-abundance\nwith respect to the commonly adopted uniform $\\alpha$-enhancement is rather\nlimited. We verified that stellar models computed using an ad hoc O-rich\nmixture sped up the evolution by only 1% at [$\\alpha$/Fe] = 0.3, due to the\ncounterbalancing effects of O enrichment on both the evolutionary timescale and\nthe Z-to-[Fe/H] relationship.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}