{"id":"2407.02428","title":"Comparative Evaluation of Learning Models for Bionic Robots: Non-Linear\n  Transfer Function Identifications","authors":"Po-Yu Hsieh, June-Hao Hou","authorsParsed":[["Hsieh","Po-Yu",""],["Hou","June-Hao",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 17:00:23 GMT"}],"updateDate":"2024-07-10","timestamp":1719939623000,"abstract":"  The control and modeling of bionic robot dynamics have increasingly adopted\nmodel-free control strategies using machine learning methods. Given the\nnon-linear elastic nature of bionic robotic systems, learning-based methods\nprovide reliable alternatives by utilizing numerical data to establish a direct\nmapping from actuation inputs to robot trajectories without complex kinematics\nmodels. However, for developers, the method of identifying an appropriate\nlearning model for their specific bionic robots and further constructing the\ntransfer function has not been thoroughly discussed. Thus, this research trains\nfour types of models, including ensemble learning models, regularization-based\nmodels, kernel-based models, and neural network models, suitable for\nmulti-input multi-output (MIMO) data and non-linear transfer function\nidentification, in order to evaluate their (1) accuracy, (2) computation\ncomplexity, and (3) performance of capturing biological movements. This\nresearch encompasses data collection methods for control inputs and action\noutputs, selection of machine learning models, comparative analysis of training\nresults, and transfer function identifications. The main objective is to\nprovide a comprehensive evaluation strategy and framework for the application\nof model-free control.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"g7-W2uqopT476Ti9FTwYrTykYxzzCZZufR6dSHZGt2w","pdfSize":"12535226"}
