{"id":"2407.07225","title":"ConvNLP: Image-based AI Text Detection","authors":"Suriya Prakash Jambunathan, Ashwath Shankarnarayan, Parijat Dube","authorsParsed":[["Jambunathan","Suriya Prakash",""],["Shankarnarayan","Ashwath",""],["Dube","Parijat",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 20:44:40 GMT"}],"updateDate":"2024-07-11","timestamp":1720557880000,"abstract":"  The potentials of Generative-AI technologies like Large Language models\n(LLMs) to revolutionize education are undermined by ethical considerations\naround their misuse which worsens the problem of academic dishonesty. LLMs like\nGPT-4 and Llama 2 are becoming increasingly powerful in generating\nsophisticated content and answering questions, from writing academic essays to\nsolving complex math problems. Students are relying on these LLMs to complete\ntheir assignments and thus compromising academic integrity. Solutions to detect\nLLM-generated text are compute-intensive and often lack generalization. This\npaper presents a novel approach for detecting LLM-generated AI-text using a\nvisual representation of word embedding. We have formulated a novel\nConvolutional Neural Network called ZigZag ResNet, as well as a scheduler for\nimproving generalization, named ZigZag Scheduler. Through extensive evaluation\nusing datasets of text generated by six different state-of-the-art LLMs, our\nmodel demonstrates strong intra-domain and inter-domain generalization\ncapabilities. Our best model detects AI-generated text with an impressive\naverage detection rate (over inter- and intra-domain test data) of 88.35%.\nThrough an exhaustive ablation study, our ZigZag ResNet and ZigZag Scheduler\nprovide a performance improvement of nearly 4% over the vanilla ResNet. The\nend-to-end inference latency of our model is below 2.5ms per sentence. Our\nsolution offers a lightweight, computationally efficient, and faster\nalternative to existing tools for AI-generated text detection, with better\ngeneralization performance. It can help academic institutions in their fight\nagainst the misuse of LLMs in academic settings. Through this work, we aim to\ncontribute to safeguarding the principles of academic integrity and ensuring\nthe trustworthiness of student work in the era of advanced LLMs.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}