{"id":"2407.11215","title":"Mechanistic interpretability of large language models with applications\n  to the financial services industry","authors":"Ashkan Golgoon, Khashayar Filom, and Arjun Ravi Kannan","authorsParsed":[["Golgoon","Ashkan",""],["Filom","Khashayar",""],["Kannan","Arjun Ravi",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 19:59:53 GMT"}],"updateDate":"2024-07-17","timestamp":1721073593000,"abstract":"  Large Language Models such as GPTs (Generative Pre-trained Transformers)\nexhibit remarkable capabilities across a broad spectrum of applications.\nNevertheless, due to their intrinsic complexity, these models present\nsubstantial challenges in interpreting their internal decision-making\nprocesses. This lack of transparency poses critical challenges when it comes to\ntheir adaptation by financial institutions, where concerns and accountability\nregarding bias, fairness, and reliability are of paramount importance.\nMechanistic interpretability aims at reverse engineering complex AI models such\nas transformers. In this paper, we are pioneering the use of mechanistic\ninterpretability to shed some light on the inner workings of large language\nmodels for use in financial services applications. We offer several examples of\nhow algorithmic tasks can be designed for compliance monitoring purposes. In\nparticular, we investigate GPT-2 Small's attention pattern when prompted to\nidentify potential violation of Fair Lending laws. Using direct logit\nattribution, we study the contributions of each layer and its corresponding\nattention heads to the logit difference in the residual stream. Finally, we\ndesign clean and corrupted prompts and use activation patching as a causal\nintervention method to localize our task completion components further. We\nobserve that the (positive) heads $10.2$ (head $2$, layer $10$), $10.7$, and\n$11.3$, as well as the (negative) heads $9.6$ and $10.6$ play a significant\nrole in the task completion.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Computation and Language","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}