{"id":"2407.20359","title":"Evidence for Rapid Variability at High Energies in GRBs","authors":"E. Casey Aldrich and Robert J. Nemiroff","authorsParsed":[["Aldrich","E. Casey",""],["Nemiroff","Robert J.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:17:50 GMT"}],"updateDate":"2024-07-31","timestamp":1722277070000,"abstract":"  Intrinsic variability was searched for in arrival times of six gamma-ray\nbursts (GRBs) at high energies -- between 30 MeV and 2 GeV -- detected by the\nFermi satellite's Large Area Telescope (LAT). The GRBs were selected from the\nFermi LAT catalog with preference for events with numerous photons, a strong\ninitial pulse, and measured redshifts. Three long GRBs and three short GRBs\nwere selected and tested. Two different variability-detection algorithms were\ndeployed, one counting photons in pairs, and the other multiplying time gaps\nbetween photons. In both tests, a real GRB was compared to 1000 Monte-Carlo\nversions of itself smoothed over a wide range of different timescales. The\nminimum detected variability timescales for long bursts (GRB 080916C, GRB\n090926A, GRB 131108A) was found to be (0.005, 10.0, 10.0) seconds for the\nphoton pair test and (2.0, 20.0, 10.0) seconds for the time-gap multiplication\ntest. Additionally, the minimum detected variability timescales for the short\nbursts (GRB 090510, GRB 140619B, GRB 160709A) was found to be (0.05, 0.01,\n20.0) seconds for the photon pair test and (0.05, 0.01, 20.0) seconds for the\ngap multiplication test. Statistical uncertainties in these times are about a\nfactor of 2. The durations of these variability timescales may be used to\nconstrain the geometry, dynamics, speed, cosmological dispersion,\nLorentz-invariance violations, weak equivalence principle violations, and GRB\nmodels.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PZR9VLxNh283afmtkWCzRPVJPN8L4E7XpPPR82WJzXw","pdfSize":"831201"}
