{"id":"2407.04159","title":"From First Patch to Long-Term Contributor: Evaluating Onboarding\n  Recommendations for OSS Newcomers","authors":"Asif Kamal Turzo and Sayma Sultana and Amiangshu Bosu","authorsParsed":[["Turzo","Asif Kamal",""],["Sultana","Sayma",""],["Bosu","Amiangshu",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 21:25:19 GMT"}],"updateDate":"2024-07-08","timestamp":1720128319000,"abstract":"  Attracting and retaining a steady stream of new contributors is crucial to\nensuring the long-term survival of open-source software (OSS) projects.\nHowever, there are two key research gaps regarding recommendations for\nonboarding new contributors to OSS projects. First, most of the existing\nrecommendations are based on a limited number of projects, which raises\nconcerns about their generalizability. If a recommendation yields conflicting\nresults in a different context, it could hinder a newcomer's onboarding process\nrather than help them. Second, it's unclear whether these recommendations also\napply to experienced contributors. If certain recommendations are specific to\nnewcomers, continuing to follow them after their initial contributions are\naccepted could hinder their chances of becoming long-term contributors. To\naddress these gaps, we conducted a two-stage mixed-method study. In the first\nstage, we conducted a Systematic Literature Review (SLR) and identified 15\ntask-related actionable recommendations that newcomers to OSS projects can\nfollow to improve their odds of successful onboarding. In the second stage, we\nconduct a large-scale empirical study of five Gerrit-based projects and 1,155\nOSS projects from GitHub to assess whether those recommendations assist\nnewcomers' successful onboarding. Our results suggest that four recommendations\npositively correlate with newcomers' first patch acceptance in most contexts.\nFour recommendations are context-dependent, and four indicate significant\nnegative associations for most projects. Our results also found three\nnewcomer-specific recommendations, which OSS joiners should abandon at\nnon-newcomer status to increase their odds of becoming long-term contributors.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}