{"id":"2407.14377","title":"Enhancing Cloud-Native Resource Allocation with Probabilistic\n  Forecasting Techniques in O-RAN","authors":"Vaishnavi Kasuluru, Luis Blanco, Engin Zeydan, Albert Bel, Angelos\n  Antonopoulos","authorsParsed":[["Kasuluru","Vaishnavi",""],["Blanco","Luis",""],["Zeydan","Engin",""],["Bel","Albert",""],["Antonopoulos","Angelos",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:04:15 GMT"}],"updateDate":"2024-07-22","timestamp":1721401455000,"abstract":"  The need for intelligent and efficient resource provisioning for the\nproductive management of resources in real-world scenarios is growing with the\nevolution of telecommunications towards the 6G era. Technologies such as Open\nRadio Access Network (O-RAN) can help to build interoperable solutions for the\nmanagement of complex systems. Probabilistic forecasting, in contrast to\ndeterministic single-point estimators, can offer a different approach to\nresource allocation by quantifying the uncertainty of the generated\npredictions. This paper examines the cloud-native aspects of O-RAN together\nwith the radio App (rApp) deployment options. The integration of probabilistic\nforecasting techniques as a rApp in O-RAN is also emphasized, along with case\nstudies of real-world applications. Through a comparative analysis of\nforecasting models using the error metric, we show the advantages of Deep\nAutoregressive Recurrent network (DeepAR) over other deterministic\nprobabilistic estimators. Furthermore, the simplicity of Simple-Feed-Forward\n(SFF) leads to a fast runtime but does not capture the temporal dependencies of\nthe input data. Finally, we present some aspects related to the practical\napplicability of cloud-native O-RAN with probabilistic forecasting.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Information Theory","Computing Research Repository/Machine Learning","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}