{"id":"2407.09026","title":"HPC: Hierarchical Progressive Coding Framework for Volumetric Video","authors":"Zihan Zheng, Houqiang Zhong, Qiang Hu, Xiaoyun Zhang, Li Song, Ya\n  Zhang, Yanfeng Wang","authorsParsed":[["Zheng","Zihan",""],["Zhong","Houqiang",""],["Hu","Qiang",""],["Zhang","Xiaoyun",""],["Song","Li",""],["Zhang","Ya",""],["Wang","Yanfeng",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 06:34:24 GMT"},{"version":"v2","created":"Sat, 3 Aug 2024 02:22:34 GMT"}],"updateDate":"2024-08-06","timestamp":1720766064000,"abstract":"  Volumetric video based on Neural Radiance Field (NeRF) holds vast potential\nfor various 3D applications, but its substantial data volume poses significant\nchallenges for compression and transmission. Current NeRF compression lacks the\nflexibility to adjust video quality and bitrate within a single model for\nvarious network and device capacities. To address these issues, we propose HPC,\na novel hierarchical progressive volumetric video coding framework achieving\nvariable bitrate using a single model. Specifically, HPC introduces a\nhierarchical representation with a multi-resolution residual radiance field to\nreduce temporal redundancy in long-duration sequences while simultaneously\ngenerating various levels of detail. Then, we propose an end-to-end progressive\nlearning approach with a multi-rate-distortion loss function to jointly\noptimize both hierarchical representation and compression. Our HPC trained only\nonce can realize multiple compression levels, while the current methods need to\ntrain multiple fixed-bitrate models for different rate-distortion (RD)\ntradeoffs. Extensive experiments demonstrate that HPC achieves flexible quality\nlevels with variable bitrate by a single model and exhibits competitive RD\nperformance, even outperforming fixed-bitrate models across various datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Computing Research Repository/Multimedia","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}