{"id":"2407.06223","title":"PubTrend: General Overview of Artificial Intelligence for Colorectal\n  cancer diagnosis from 2010-2022","authors":"Mary Adewunmi and Reem Abdel-Salam","authorsParsed":[["Adewunmi","Mary",""],["Abdel-Salam","Reem",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 00:40:51 GMT"}],"updateDate":"2024-07-10","timestamp":1720226451000,"abstract":"  Colorectal cancer (CRC) is among the most prevalent cancers in the world. Due\nto numerous scholarly papers and broad enquiries about specific use cases for\nartificial intelligence (AI) in colorectal cancer, researchers find it\nchallenging to explore relevant papers on the current knowledge, comprehensive\nknowledge, and past methodologies in the literature review. This review\nextracts recent AI technology advances for diagnosing colorectal cancer from\nJanuary 2010 to March 2022. PubTrends was used to identify and automate the\nintellectual structure and comparable papers on the use of AI in colorectal\ncancer diagnosis using the most cited papers, keywords, and similar papers.\nPapers with quantitative results were represented with a tabular summary, and\nother paper contributions were in a sentence summary. Twenty-four (24) out of\nthe forty-nine (49) top-cited papers were quantitative results, with one (1)\noutlier about lung cancer comprehensive screening. The most frequently used\nwords were: \"polyps,\" \"detected\", \"image,\" and \"colonoscopy.\" In addition, 83\nper cent of the terms frequently used shortly before 2022 were image, polyps,\ndetected, colonoscopy, and learning. In addition, 16 per cent are preparation,\nvariant, classification, sample, and surgery. The review showcases 49 of the 50\nmost cited papers, their notable contributions, objectives, specific AI\nmethods, results, conclusions, and further recommendations. These papers\nhighlight the limitations of colonoscopy for therapeutic use. The review\nconcluded that despite the enormous benefits of using artificial intelligence,\nfrom improving diagnosis, the medical AI programmer still needs to be actively\ninvolved in the diagnosis team for effective results in CRC diagnosis.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"vtQZqVnVl14rUkBWIR5DXiXwTkn0AeezZLQ_lOdFy9M","pdfSize":"688071"}
