{"id":"2407.06272","title":"ALMA high-resolution observations unveil planet formation shaping\n  molecular emission in the PDS 70 disk","authors":"L. Rampinelli, S. Facchini, M. Leemker, J. Bae, M. Benisty, R. Teague,\n  C. J. Law, K. I. \\\"Oberg, B. Portilla-Revelo and A. J. Cridland","authorsParsed":[["Rampinelli","L.",""],["Facchini","S.",""],["Leemker","M.",""],["Bae","J.",""],["Benisty","M.",""],["Teague","R.",""],["Law","C. J.",""],["Öberg","K. I.",""],["Portilla-Revelo","B.",""],["Cridland","A. J.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:00:06 GMT"}],"updateDate":"2024-09-04","timestamp":1720461606000,"abstract":"  With two directly detected protoplanets, the PDS 70 system is a unique source\nin which to study the complex interplay between forming planets and their natal\nenvironment. The large dust cavity carved by the two giant planets can affect\nthe disk chemistry, and therefore the molecular emission morphology. On the\nother hand, chemical properties of the gas component of the disk are expected\nto leave an imprint on the planetary atmospheres. In this work, we reconstruct\nthe emission morphology of a rich inventory of molecular tracers in the PDS 70\ndisk, and we look for possible chemical signatures of the two actively\naccreting protoplanets, PDS b and c. We leverage Atacama Large\nMillimeter/submillimeter Array (ALMA) band 6 high-angular-resolution and\ndeep-sensitivity line emission observations, together with image and $uv$-plane\ntechniques, to boost the detection of faint lines. We robustly detect\nring-shaped emission from $^{12}$CO, $^{13}$CO, C$^{18}$O, H$^{13}$CN,\nHC$^{15}$N, DCN, H$_2$CO, CS, C$_2$H, and H$^{13}$CO$^{+}$ lines in\nunprecedented detail. Most of the molecular tracers show a peak of the emission\ninside the millimeter dust peak. We interpret this as the direct impact of the\neffective irradiation of the cavity wall, as a result of the planet formation\nprocess. Moreover, we have found evidence of an O-poor gas reservoir in the\nouter disk, which is supported by the observations of bright C-rich molecules,\nthe non-detection of SO, and a lower limit on the $\\mathrm{CS/SO}$ ratio of\n$\\sim1$. Eventually, we provide the first detection of the c-C$_3$H$_2$\ntransitions at 218.73 GHz, and the marginal detection of an azimuthal asymmetry\nin the higher-energy H$_2$CO (3$_{2,1}$-2$_{2,0}$) line, which could be due to\naccretion heating near PDS 70b.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}