{"id":"2407.02330","title":"Competition of Exchange and Correlation Energies in Two-Dimensional\n  $N$-component Electron Gas Ferromagnetism","authors":"Chen-How Huang, Chunli Huang and M. A. Cazalilla","authorsParsed":[["Huang","Chen-How",""],["Huang","Chunli",""],["Cazalilla","M. A.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 14:59:59 GMT"}],"updateDate":"2024-07-03","timestamp":1719932399000,"abstract":"  Motivated by recent observations of symmtry broken phases in lightly-doped\nmultilayer graphene, we investigate magnetic phase transitions in a generalized\nelectron gas model with four-component electron spin. This model simplifies the\nproblem with a parabolic dispersion band, abstracting away the details of the\ngraphene band structure to focus solely on the effects of the Coulomb\ninteraction. We report four findings: 1) In the Hartree-Fock approximation, we\nobserve that the paramagnetic state undergoes a sequence of density-driven,\nfirst-order phase transitions, progressively depopulating electrons from each\nspin component until achieving complete polarization within a very narrow\ndensity window where $1.2<r_s<2$ ($r_s$ being the electron gas parameter). 2)\nFurther incorporating the correlation energy via the Bohm-Pines random-phase\napproximation shows that the cascade of transitions obtained within\nHartree-Fock approximation is replaced by a single ferromagnetic phase\ntransition at $r_s = 6.12$. 3) The disappearance of cascade is due to the\ncorrelation energy difference between the four-component paramagnetic state and\nsymmetry-broken phases, which is nearly an order of magnitude more negative\nthan the corresponding Hartree-Fock energy difference for $1.2 < r_s < 2$. 4)\nThe transition from the paramagnetic state to the fully polarized state at\n$r_s=6.12$ is governed by the balance between exchange and correlation\nenergies, a competition that cannot be captured by mean-field approximations to\nmodels featuring effective (density-dependent) delta-function interactions,\nsuch as the Stoner model. We use the insights from our model to comment on the\nphase diagram of multilayer graphene electron gas.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}