{"id":"2407.01518","title":"Towards Multimodal Open-Set Domain Generalization and Adaptation through\n  Self-supervision","authors":"Hao Dong, Eleni Chatzi, Olga Fink","authorsParsed":[["Dong","Hao",""],["Chatzi","Eleni",""],["Fink","Olga",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 17:59:09 GMT"}],"updateDate":"2024-07-02","timestamp":1719856749000,"abstract":"  The task of open-set domain generalization (OSDG) involves recognizing novel\nclasses within unseen domains, which becomes more challenging with multiple\nmodalities as input. Existing works have only addressed unimodal OSDG within\nthe meta-learning framework, without considering multimodal scenarios. In this\nwork, we introduce a novel approach to address Multimodal Open-Set Domain\nGeneralization (MM-OSDG) for the first time, utilizing self-supervision. To\nthis end, we introduce two innovative multimodal self-supervised pretext tasks:\nMasked Cross-modal Translation and Multimodal Jigsaw Puzzles. These tasks\nfacilitate the learning of multimodal representative features, thereby\nenhancing generalization and open-class detection capabilities. Additionally,\nwe propose a novel entropy weighting mechanism to balance the loss across\ndifferent modalities. Furthermore, we extend our approach to tackle also the\nMultimodal Open-Set Domain Adaptation (MM-OSDA) problem, especially in\nscenarios where unlabeled data from the target domain is available. Extensive\nexperiments conducted under MM-OSDG, MM-OSDA, and Multimodal Closed-Set DG\nsettings on the EPIC-Kitchens and HAC datasets demonstrate the efficacy and\nversatility of the proposed approach. Our source code is available at\nhttps://github.com/donghao51/MOOSA.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Nl-lbeIG938BE27ej89IejuxGmeFODbRLJrPb9WhrKg","pdfSize":"1715787","objectId":"0x08aa0dc791cc2f161ff53c6c6e22c1c8da56108f7ae50ccfcf96cf4de8064e37","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
