{"id":"2407.08284","title":"Performance Evaluation of Hashing Algorithms on Commodity Hardware","authors":"Marut Pandya","authorsParsed":[["Pandya","Marut",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 08:31:02 GMT"}],"updateDate":"2024-07-12","timestamp":1720686662000,"abstract":"  Hashing functions, which are created to provide brief and erratic digests for\nthe message entered, are the primary cryptographic primitives used in\nblockchain networks. Hashing is employed in blockchain networks to create\nlinked block lists, which offer safe and secure distributed repository storage\nfor critical information. Due to the unique nature of the hash search problem\nin blockchain networks, the most parallelization of calculations is possible.\nThis technical report presents a performance evaluation of three popular\nhashing algorithms Blake3, SHA-256, and SHA-512. These hashing algorithms are\nwidely used in various applications, such as digital signatures, message\nauthentication, and password storage. It then discusses the performance metrics\nused to evaluate the algorithms, such as hash rate/throughput and memory usage.\nThe evaluation is conducted on a range of hardware platforms, including desktop\nand VMs. The evaluation includes synthetic benchmarks. The results of the\nevaluation show that Blake3 generally outperforms both SHA-256 and SHA-512 in\nterms of throughput and latency. However, the performance advantage of Blake3\nvaries depending on the specific hardware platform and the size of the input\ndata. The report concludes with recommendations for selecting the most suitable\nhashing algorithm for a given application, based on its performance\nrequirements and security needs. The evaluation results can also inform future\nresearch and development efforts to improve the performance and security of\nhashing algorithms.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/"}