{"id":"2407.01737","title":"Understanding the Broad-line Region of Active Galactic Nuclei with\n  Photoionization. I. the Moderate-Accretion Regime","authors":"Qiaoya Wu, Yue Shen, Hengxiao Guo, Scott F. Anderson, W. N. Brandt,\n  Catherine J. Grier, Patrick B. Hall, Luis C. Ho, Yasaman Homayouni, Keith\n  Horne, Jennifer I-Hsiu Li, and Donald P. Schneider","authorsParsed":[["Wu","Qiaoya",""],["Shen","Yue",""],["Guo","Hengxiao",""],["Anderson","Scott F.",""],["Brandt","W. N.",""],["Grier","Catherine J.",""],["Hall","Patrick B.",""],["Ho","Luis C.",""],["Homayouni","Yasaman",""],["Horne","Keith",""],["Li","Jennifer I-Hsiu",""],["Schneider","Donald P.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 19:12:13 GMT"}],"updateDate":"2024-07-03","timestamp":1719861133000,"abstract":"  Over three decades of reverberation mapping (RM) studies on local broad-line\nactive galactic nuclei (AGNs) have measured reliable black-hole (BH) masses for\n$> 100$ AGNs. These RM measurements reveal a significant correlation between\nthe Balmer broad-line region size and the AGN optical luminosity (the $R-L$\nrelation). Recent RM studies for AGN samples with more diverse BH accretion\nparameters (e.g., mass and Eddington ratio) reveal a substantial intrinsic\ndispersion around the average $R-L$ relation, suggesting variations in the\noverall spectral energy distribution shape as functions of accretion\nparameters. Here we perform a detailed photoionization investigation of\nexpected broad-line properties as functions of accretion parameters, using the\nlatest models for the AGN continuum implemented in {\\tt qsosed}. We compare\ntheoretical predictions with observations of a sample of 67 $z\\lesssim0.5$\nreverberation-mapped AGNs with both rest-frame optical and UV spectra in the\nmoderate-accretion regime (Eddington ratio $\\lambda_{\\rm Edd}\\equiv L/L_{\\rm\nEdd}<0.5$). The UV/optical line strengths and their dependences on accretion\nparameters can be reasonably well reproduced by the locally-optimally-emitting\ncloud (LOC) photoionization models. We provide quantitative recipes that use\noptical/UV line flux ratios to infer the ionizing continuum, which is not\ndirectly observable. In addition, photoionization models with universal values\nof ionization parameter ($\\log U_{\\rm H}=-2$) and hydrogen density ($\\log\nn({\\rm H})=12$) can qualitatively reproduce the observed global $R-L$ relation\nfor the current AGN sample. However, such models fail to reproduce the observed\ntrend of decreasing BLR size with $L/L_{\\rm Edd}$ at fixed optical luminosity,\nwhich may imply that the gas density increases with the accretion rate.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}