{"id":"2407.15648","title":"TreeSBA: Tree-Transformer for Self-Supervised Sequential Brick Assembly","authors":"Mengqi Guo, Chen Li, Yuyang Zhao, Gim Hee Lee","authorsParsed":[["Guo","Mengqi",""],["Li","Chen",""],["Zhao","Yuyang",""],["Lee","Gim Hee",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:05:27 GMT"}],"updateDate":"2024-07-23","timestamp":1721657127000,"abstract":"  Inferring step-wise actions to assemble 3D objects with primitive bricks from\nimages is a challenging task due to complex constraints and the vast number of\npossible combinations. Recent studies have demonstrated promising results on\nsequential LEGO brick assembly through the utilization of LEGO-Graph modeling\nto predict sequential actions. However, existing approaches are class-specific\nand require significant computational and 3D annotation resources. In this\nwork, we first propose a computationally efficient breadth-first search (BFS)\nLEGO-Tree structure to model the sequential assembly actions by considering\nconnections between consecutive layers. Based on the LEGO-Tree structure, we\nthen design a class-agnostic tree-transformer framework to predict the\nsequential assembly actions from the input multi-view images. A major challenge\nof the sequential brick assembly task is that the step-wise action labels are\ncostly and tedious to obtain in practice. We mitigate this problem by\nleveraging synthetic-to-real transfer learning. Specifically, our model is\nfirst pre-trained on synthetic data with full supervision from the available\naction labels. We then circumvent the requirement for action labels in the real\ndata by proposing an action-to-silhouette projection that replaces action\nlabels with input image silhouettes for self-supervision. Without any\nannotation on the real data, our model outperforms existing methods with 3D\nsupervision by 7.8% and 11.3% in mIoU on the MNIST and ModelNet Construction\ndatasets, respectively.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}