{"id":"2407.09372","title":"ConRebSeg: A Segmentation Dataset for Reinforced Concrete Construction","authors":"Patrick Schmidt, Lazaros Nalpantidis","authorsParsed":[["Schmidt","Patrick",""],["Nalpantidis","Lazaros",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 15:53:15 GMT"}],"updateDate":"2024-07-15","timestamp":1720799595000,"abstract":"  The construction industry has been traditionally slow in adopting digital\ntechnologies. However, these are becoming increasingly necessary due to a\nplentitude of challenges, such as a shortage of skilled labor and decreasing\nproductivity levels compared to other industries. Autonomous robotic systems\ncan alleviate this problem, but the software development process for these\nsystems is heavily driven by data, a resource usually challenging to find in\nthe construction domain due to the lack of public availability. In our work, we\ntherefore provide a dataset of 14,805 RGB images with segmentation labels for\nreinforced concrete construction and make it publicly available. We conduct a\ndetailed analysis of our dataset and discuss how to deal with labeling\ninconsistencies. Furthermore, we establish baselines for the YOLOv8L-seg,\nDeepLabV3, and U-Net segmentation models and investigate the influence of data\navailability and label inconsistencies on the performance of these models. Our\nstudy showed that the models are precise in their predictions but would benefit\nfrom more data to increase the number of recalled instances. Label\ninconsistencies had a negligible effect on model performance, and we,\ntherefore, advocate for a crowd-sourced dataset to boost the development of\nautonomous robotic systems in the construction industry.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OQRtHVELdoFLfq75GR-yWm8hQn-d-gi9uOYPoEi-7aE","pdfSize":"17187801","objectId":"0x70f43ad750705dec79a435a8559cd0bd3014cc0758c9b1c868c82152f2920f16","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
