{"id":"2407.03971","title":"MineNetCD: A Benchmark for Global Mining Change Detection on Remote\n  Sensing Imagery","authors":"Weikang Yu, Xiaokang Zhang, Xiao Xiang Zhu, Richard Gloaguen and\n  Pedram Ghamisi","authorsParsed":[["Yu","Weikang",""],["Zhang","Xiaokang",""],["Zhu","Xiao Xiang",""],["Gloaguen","Richard",""],["Ghamisi","Pedram",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 14:45:44 GMT"}],"updateDate":"2024-07-08","timestamp":1720104344000,"abstract":"  Monitoring changes triggered by mining activities is crucial for industrial\ncontrolling, environmental management and regulatory compliance, yet it poses\nsignificant challenges due to the vast and often remote locations of mining\nsites. Remote sensing technologies have increasingly become indispensable to\ndetect and analyze these changes over time. We thus introduce MineNetCD, a\ncomprehensive benchmark designed for global mining change detection using\nremote sensing imagery. The benchmark comprises three key contributions. First,\nwe establish a global mining change detection dataset featuring more than 70k\npaired patches of bi-temporal high-resolution remote sensing images and\npixel-level annotations from 100 mining sites worldwide. Second, we develop a\nnovel baseline model based on a change-aware Fast Fourier Transform (ChangeFFT)\nmodule, which enhances various backbones by leveraging essential spectrum\ncomponents within features in the frequency domain and capturing the\nchannel-wise correlation of bi-temporal feature differences to learn\nchange-aware representations. Third, we construct a unified change detection\n(UCD) framework that integrates over 13 advanced change detection models. This\nframework is designed for streamlined and efficient processing, utilizing the\ncloud platform hosted by HuggingFace. Extensive experiments have been conducted\nto demonstrate the superiority of the proposed baseline model compared with 12\nstate-of-the-art change detection approaches. Empirical studies on modularized\nbackbones comprehensively confirm the efficacy of different representation\nlearners on change detection. This contribution represents significant\nadvancements in the field of remote sensing and change detection, providing a\nrobust resource for future research and applications in global mining\nmonitoring. Dataset and Codes are available via the link.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}