{"id":"2407.02844","title":"Multi-Attention Integrated Deep Learning Frameworks for Enhanced Breast\n  Cancer Segmentation and Identification","authors":"Pandiyaraju V, Shravan Venkatraman, Pavan Kumar S, Santhosh\n  Malarvannan, Kannan A","authorsParsed":[["V","Pandiyaraju",""],["Venkatraman","Shravan",""],["S","Pavan Kumar",""],["Malarvannan","Santhosh",""],["A","Kannan",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 06:40:26 GMT"},{"version":"v2","created":"Fri, 5 Jul 2024 12:37:15 GMT"},{"version":"v3","created":"Mon, 15 Jul 2024 17:55:49 GMT"}],"updateDate":"2024-07-16","timestamp":1719988826000,"abstract":"  Breast cancer poses a profound threat to lives globally, claiming numerous\nlives each year. Therefore, timely detection is crucial for early intervention\nand improved chances of survival. Accurately diagnosing and classifying breast\ntumors using ultrasound images is a persistent challenge in medicine, demanding\ncutting-edge solutions for improved treatment strategies. This research\nintroduces multiattention-enhanced deep learning (DL) frameworks designed for\nthe classification and segmentation of breast cancer tumors from ultrasound\nimages. A spatial channel attention mechanism is proposed for segmenting tumors\nfrom ultrasound images, utilizing a novel LinkNet DL framework with an\nInceptionResNet backbone. Following this, the paper proposes a deep\nconvolutional neural network with an integrated multi-attention framework\n(DCNNIMAF) to classify the segmented tumor as benign, malignant, or normal.\nFrom experimental results, it is observed that the segmentation model has\nrecorded an accuracy of 98.1%, with a minimal loss of 0.6%. It has also\nachieved high Intersection over Union (IoU) and Dice Coefficient scores of\n96.9% and 97.2%, respectively. Similarly, the classification model has attained\nan accuracy of 99.2%, with a low loss of 0.31%. Furthermore, the classification\nframework has achieved outstanding F1-Score, precision, and recall values of\n99.1%, 99.3%, and 99.1%, respectively. By offering a robust framework for early\ndetection and accurate classification of breast cancer, this proposed work\nsignificantly advances the field of medical image analysis, potentially\nimproving diagnostic precision and patient outcomes.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}