{"id":"2407.02259","title":"Measure and continuous vector field at a boundary II: geodesics and\n  support propagation","authors":"Nicolas Burq, Belhassen Dehman and J\\'er\\^ome Le Rousseau","authorsParsed":[["Burq","Nicolas",""],["Dehman","Belhassen",""],["Rousseau","Jérôme Le",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 13:29:06 GMT"}],"updateDate":"2024-07-03","timestamp":1719926946000,"abstract":"  Nonnegative measures that are solutions to a transport equation with\ncontinuous coefficients have been widely studied. Because of the low regularity\nof the associated vector field, there is no natural flow since nonuniqueness of\nintegral curves is the general rule. It has been known since the works by L.\nAmbrosio [2] and L. Ambrosio and G. Crippa [3, 4] that such measures can be\ndescribed as a superposition of $\\delta$-measures supported on integral curves.\nIn this article, motivated by some observability questions for the wave\nequation, we are interested in such transport equations in the case of domains\nwith boundary. Associated with a wave equation with C^1-coefficients are\nbicharacteristics that are integral curves of a continuous Hamiltonian vector\nfield. We first study in details their behaviour in the presence of a boundary\nand define their natural generalisation that follows the laws of geometric\noptics. Then, we introduce a natural class of transport equations with a source\nterm on the boundary, and we prove that any nonnegative measure satisfying such\nan equation has a union of maximal generalized bicharacteristics for support.\nThis result is a weak form of the superposition principle in the presence of a\nboundary. With its companion article [7], this study completes the proof of\nwave observability generalizing the celebrated result of Bardos, Lebeau, and\nRauch [5] in a low regularity framework where coefficients of the wave equation\n(and associated metric) are C^1 and the boundary and the manifold are C^2.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}