{"id":"2407.09786","title":"Self-supervised 3D Point Cloud Completion via Multi-view Adversarial\n  Learning","authors":"Lintai Wu, Xianjing Cheng, Junhui Hou, Yong Xu, and Huanqiang Zeng","authorsParsed":[["Wu","Lintai",""],["Cheng","Xianjing",""],["Hou","Junhui",""],["Xu","Yong",""],["Zeng","Huanqiang",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 06:53:39 GMT"}],"updateDate":"2024-07-16","timestamp":1720853619000,"abstract":"  In real-world scenarios, scanned point clouds are often incomplete due to\nocclusion issues. The task of self-supervised point cloud completion involves\nreconstructing missing regions of these incomplete objects without the\nsupervision of complete ground truth. Current self-supervised methods either\nrely on multiple views of partial observations for supervision or overlook the\nintrinsic geometric similarity that can be identified and utilized from the\ngiven partial point clouds. In this paper, we propose MAL-SPC, a framework that\neffectively leverages both object-level and category-specific geometric\nsimilarities to complete missing structures. Our MAL-SPC does not require any\n3D complete supervision and only necessitates a single partial point cloud for\neach object. Specifically, we first introduce a Pattern Retrieval Network to\nretrieve similar position and curvature patterns between the partial input and\nthe predicted shape, then leverage these similarities to densify and refine the\nreconstructed results. Additionally, we render the reconstructed complete shape\ninto multi-view depth maps and design an adversarial learning module to learn\nthe geometry of the target shape from category-specific single-view depth\nimages. To achieve anisotropic rendering, we design a density-aware radius\nestimation algorithm to improve the quality of the rendered images. Our MAL-SPC\nyields the best results compared to current state-of-the-art methods.We will\nmake the source code publicly available at \\url{https://github.com/ltwu6/malspc\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}