{"id":"2407.16706","title":"Architectural Tactics to Improve the Environmental Sustainability of\n  Microservices: A Rapid Review","authors":"Xingwen Xiao","authorsParsed":[["Xiao","Xingwen",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 22:44:58 GMT"}],"updateDate":"2024-07-25","timestamp":1721429098000,"abstract":"  Microservices are a popular architectural style adopted by the industry when\nit comes to deploying software that requires scalability, maintainability, and\nagile development. There is an increasing demand for improving the\nsustainability of microservice systems in the industry. This rapid review\ngathers 22 peer-reviewed studies and synthesizes architectural tactics that\nimprove the environmental sustainability of microservices from them. We list 6\ntactics that are presented in an actionable way and categorized according to\ntheir sustainability aspects and context. The sustainability aspects include\nenergy efficiency, carbon efficiency, and resource efficiency, among which\nresource efficiency is the most researched one while energy efficiency and\ncarbon efficiency are still in the early stage of study. The context\ncategorization, including serverless platforms, decentralized networks, etc.,\nhelps to identify the tactics that we can use in a specific setting.\nAdditionally, we present how the evidence of optimization after adopting these\ntactics is presented, like the measurement unit and statistical methods, and\nhow experiments are generally set up so that this review is both instructive\nfor our future study and our industrial practitioners' interest. We further\nstudy the insufficiencies of the current study and hope to provide insight for\nother researchers and the industry.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"h2y2hZ3BD1P08mwwEz01EGkxv6F3ZfljMQQrxwPwvhQ","pdfSize":"1131459","objectId":"0x79459f79fcb1966e8c3f438b1faff7b8c6e505909d28e0bb1d5e23343514d4fa","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
