{"id":"2407.10341","title":"Affordance-Guided Reinforcement Learning via Visual Prompting","authors":"Olivia Y. Lee, Annie Xie, Kuan Fang, Karl Pertsch, Chelsea Finn","authorsParsed":[["Lee","Olivia Y.",""],["Xie","Annie",""],["Fang","Kuan",""],["Pertsch","Karl",""],["Finn","Chelsea",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 21:41:29 GMT"}],"updateDate":"2024-07-16","timestamp":1720993289000,"abstract":"  Robots equipped with reinforcement learning (RL) have the potential to learn\na wide range of skills solely from a reward signal. However, obtaining a robust\nand dense reward signal for general manipulation tasks remains a challenge.\nExisting learning-based approaches require significant data, such as\ndemonstrations or examples of success and failure, to learn task-specific\nreward functions. Recently, there is also a growing adoption of large\nmulti-modal foundation models for robotics. These models can perform visual\nreasoning in physical contexts and generate coarse robot motions for various\nmanipulation tasks. Motivated by this range of capability, in this work, we\npropose and study rewards shaped by vision-language models (VLMs).\nState-of-the-art VLMs have demonstrated an impressive ability to reason about\naffordances through keypoints in zero-shot, and we leverage this to define\ndense rewards for robotic learning. On a real-world manipulation task specified\nby natural language description, we find that these rewards improve the sample\nefficiency of autonomous RL and enable successful completion of the task in 20K\nonline finetuning steps. Additionally, we demonstrate the robustness of the\napproach to reductions in the number of in-domain demonstrations used for\npretraining, reaching comparable performance in 35K online finetuning steps.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}