{"id":"2407.10002","title":"MX precipitate behavior in an irradiated advanced Fe-9Cr steel: Self-ion\n  irradiation effects on phase stability","authors":"T.M. Kelsy Green, Tim Graening, Weicheng Zhong, Ying Yang, and Kevin\n  G. Field","authorsParsed":[["Green","T. M. Kelsy",""],["Graening","Tim",""],["Zhong","Weicheng",""],["Yang","Ying",""],["Field","Kevin G.",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 21:00:12 GMT"}],"updateDate":"2024-07-16","timestamp":1720904412000,"abstract":"  Reduced activation ferritic/martensitic (RAFM) steels are the leading\ncandidate structural materials for first-wall and blanket components in fusion\nreactors. This work is the first in a series to provide a systematic roadmap of\nMX precipitate stability in RAFM steels under various ion irradiation\nconditions. Here, the MX-TiC precipitate behavior in an advanced Fe-9Cr RAFM\nsteel is assessed under self-ion irradiation to damage levels ranging from 1 to\n100 displacements per atom (dpa) at temperatures ranging from 300-600{\\deg}C to\nisolate the effects of temperature and damage level on precipitate stability.\nThe pre-existing MX-TiC precipitates are shown to exhibit temperature-dominated\nresponses, including coarsening above 400{\\deg}C at damage levels of 15 dpa,\nwhile damage levels studied at 50 dpa and higher showed dissolution across all\ntemperature ranges studied. The effects of ballistic dissolution and diffusion\non precipitate behavior are outlined as a function of precipitate\ncharacteristics (number density, size, and 25 volume fraction) and irradiation\nparameters with the use of the recoil resolution model of precipitate\nstability. This work provides critical insights into MX-TiC stability to high\ndose in-order to further optimize advanced steels with improved radiation\nresistance.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Qqg_UGgjgkAUy6F-L5Kp80YaFHH3ck8-yt2nz-DyrXc","pdfSize":"5662280"}
