{"id":"2407.21561","title":"Effect of area divergence and frequency on damping of slow\n  magnetoacoustic waves propagating along umbral fan loops","authors":"Ananya Rawat, Girjesh R. Gupta","authorsParsed":[["Rawat","Ananya",""],["Gupta","Girjesh R.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 12:30:07 GMT"}],"updateDate":"2024-08-01","timestamp":1722429007000,"abstract":"  Waves play an important role in the heating of solar atmosphere, however,\nobservations of wave propagation and damping from the solar photosphere to\ncorona through chromosphere and transition region are very rare. Recent\nobservations have shown propagation of 3-min slow magnetoacoustic waves (SMAWs)\nalong fan loops from the solar photosphere to corona. In this work, we\ninvestigate the role of area divergence and frequencies on the damping of SMAWs\npropagating from the photosphere to the corona along several fan loops rooted\nin the sunspot umbra. We study the Fourier power spectra of oscillations along\nfan loops at each atmospheric height which showed significant enhancements in\n1--2 min, 2.3--3.6 min and 4.2--6 min period bands. Amplitude of intensity\noscillations in different period bands and heights are extracted after\nnormalizing the filtered light curves with low-frequency background. We find\ndamping of SMAW energy flux propagating along the fan loop 6 with damping\nlengths ~170 km and ~208 km for 1.5-min and 3-min period bands. We also show\nthe decay of total wave energy content with height after incorporating area\ndivergence effect, and present actual damping of SMAWs from photosphere to\ncorona. Actual damping lengths in this case increases to ~172 km and ~303 km\nfor 1.5-min and 3-min period bands. All the fan loops show such increase in\nactual damping lengths, and thus highlight the importance of area divergence\neffect. Results also show some frequency-dependent damping of SMAW energy\nfluxes with height where high-frequency waves are damped faster than\nlow-frequency waves.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}