{"id":"2407.07761","title":"Unveiling the ice and gas nature of active centaur (2060) Chiron using\n  the James Webb Space Telescope","authors":"N. Pinilla-Alonso, J. Licandro, R. Brunetto, E. Henault, C. Schambeau,\n  A. Guilbert-Lepoutre, J. Stansberry, I. Wong, J. I. Lunine, B. J. Holler, J.\n  Emery, S. Protopapa, J. Cook, H. B. Hammel, G. L. Villanueva, S. N. Milam, D.\n  Cruikshank, and A. C. de Souza-Feliciano","authorsParsed":[["Pinilla-Alonso","N.",""],["Licandro","J.",""],["Brunetto","R.",""],["Henault","E.",""],["Schambeau","C.",""],["Guilbert-Lepoutre","A.",""],["Stansberry","J.",""],["Wong","I.",""],["Lunine","J. I.",""],["Holler","B. J.",""],["Emery","J.",""],["Protopapa","S.",""],["Cook","J.",""],["Hammel","H. B.",""],["Villanueva","G. L.",""],["Milam","S. N.",""],["Cruikshank","D.",""],["de Souza-Feliciano","A. C.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:39:26 GMT"}],"updateDate":"2024-07-11","timestamp":1720625966000,"abstract":"  (2060) Chiron is a large centaur that has been reported active on multiple\noccasions including during aphelion passage. Studies of Chirons coma during\nactive periods have resulted in the detection of C(triple)N and CO outgassing.\nSignificant work remains to be undertaken to comprehend the activation\nmechanisms on Chiron and the parent molecules of the gas phases detected. This\nwork reports the study of the ices on Chirons surface and coma and seeks\nspectral indicators of volatiles associated with the activity. Additionally, we\ndiscuss how these detections could be related to the activation mechanism for\nChiron and, potentially, other centaurs. In July 2023, the James Webb Space\nTelescope (JWST) observed Chiron when it was active near its aphelion. We\npresent JWST/NIRSpec spectra from 0.97 to 5.27 microns with a resolving power\nof 1000, and compare them with laboratory data for identification of the\nspectral bands. We report the first detections on Chiron of absorption bands of\nseveral volatile ices, including CO2, CO, C2H6, C3H8, and C2H2. We also confirm\nthe presence of water ice in its amorphous state. A key discovery arising from\nthese data is the detection of fluorescence emissions of CH4, revealing the\npresence of a gas coma rich in this hyper-volatile molecule, which we also\nidentify to be in non-local thermal equilibrium (nonLTE). CO2 gas emission is\nalso detected in the fundamental stretching band at 4.27 microns. We argue that\nthe presence of CH4 emission is the first proof of the desorption of CH4 due to\na density phase transition of amorphous water ice at low temperature in\nagreement with the estimated temperature of Chiron during the JWST observations\n(61 K). Detection of photolytic and proton irradiation products of CH4 and CO2\non the surface, in the coma ice grains, or in the ring material is also\ndetected via a forest of absorption features from 3.5 to 5.3 microns.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"4-tcuLtqW7HJLJt1siMs-wdQZn5l30s8bWH5XmZNBCM","pdfSize":"673351"}
