{"id":"2407.01717","title":"VolETA: One- and Few-shot Food Volume Estimation","authors":"Ahmad AlMughrabi, Umair Haroon, Ricardo Marques, Petia Radeva","authorsParsed":[["AlMughrabi","Ahmad",""],["Haroon","Umair",""],["Marques","Ricardo",""],["Radeva","Petia",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:47:15 GMT"}],"updateDate":"2024-07-03","timestamp":1719859635000,"abstract":"  Accurate food volume estimation is essential for dietary assessment,\nnutritional tracking, and portion control applications. We present VolETA, a\nsophisticated methodology for estimating food volume using 3D generative\ntechniques. Our approach creates a scaled 3D mesh of food objects using one- or\nfew-RGBD images. We start by selecting keyframes based on the RGB images and\nthen segmenting the reference object in the RGB images using XMem++.\nSimultaneously, camera positions are estimated and refined using the PixSfM\ntechnique. The segmented food images, reference objects, and camera poses are\ncombined to form a data model suitable for NeuS2. Independent mesh\nreconstructions for reference and food objects are carried out, with scaling\nfactors determined using MeshLab based on the reference object. Moreover, depth\ninformation is used to fine-tune the scaling factors by estimating the\npotential volume range. The fine-tuned scaling factors are then applied to the\ncleaned food meshes for accurate volume measurements. Similarly, we enter a\nsegmented RGB image to the One-2-3-45 model for one-shot food volume\nestimation, resulting in a mesh. We then leverage the obtained scaling factors\nto the cleaned food mesh for accurate volume measurements. Our experiments show\nthat our method effectively addresses occlusions, varying lighting conditions,\nand complex food geometries, achieving robust and accurate volume estimations\nwith 10.97% MAPE using the MTF dataset. This innovative approach enhances the\nprecision of volume assessments and significantly contributes to computational\nnutrition and dietary monitoring advancements.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ZELbzOnsqEMTlJ_eBUqnuipTJTphOHb8pAhTpa8J1qY","pdfSize":"9096452"}
