{"id":"2407.11490","title":"Mach-Zehnder interference of fractionalized electron-spin excitations","authors":"Takase Shimizu, Eiki Iyoda, Satoshi Sasaki, Akira Endo, Shingo\n  Katsumoto, Norio Kumada, and Masayuki Hashisaka","authorsParsed":[["Shimizu","Takase",""],["Iyoda","Eiki",""],["Sasaki","Satoshi",""],["Endo","Akira",""],["Katsumoto","Shingo",""],["Kumada","Norio",""],["Hashisaka","Masayuki",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 08:25:31 GMT"}],"updateDate":"2024-07-17","timestamp":1721118331000,"abstract":"  Inter-channel Coulomb interaction mixes charge excitations in copropagating\nquantum Hall edge channels, generating coupled excitation eigenmodes\npropagating at different speeds. This mode transformation causes an electron\nstate to split into fragments, corresponding to the Tomonaga-Luttinger liquid\nmodel of a chiral one-dimensional electronic system. This paper reports the\ncoherent evolution of an electron state under the fractionalization process in\na Mach-Zehnder interferometer employing copropagating spin-up and spin-down\nchannels as the interference paths. We observe the interference visibility\noscillations as a function of the voltage bias applied between the interference\npaths, which are attributed to the second-order interference between the\nfractionalized spin excitations with different phase evolutions. This\nobservation contrasts with the single-particle picture that predicts only the\nfirst-order interference, reflecting the phase evolution of a spin-up and\nspin-down superposition state during the one-way transport. The second-order\ninterference manifests the coherent splitting of the superposition state to the\nmutually independent fast and slow excitations. Our observation offers the\nfractionalization process as a novel way to encode an electron spin state to\nspatially separated fragments.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}