{"id":"2407.15541","title":"An implicit adaptive unified gas-kinetic scheme for steady-state\n  solutions of non-equilibrium flows","authors":"Wenpei Long, Yufeng Wei, and Kun Xu","authorsParsed":[["Long","Wenpei",""],["Wei","Yufeng",""],["Xu","Kun",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 11:08:42 GMT"}],"updateDate":"2024-07-23","timestamp":1721646522000,"abstract":"  Nonequilibrium flows have been frequently encountered in various aerospace\nengineering applications. To understand nonequilibrium physics, multiscale\neffects, and the dynamics in these applications, an effective and reliable\nmultiscale scheme for all flow regimes is required. Following the direct\nmodeling methodology, the adaptive unified gas-kinetic scheme employs discrete\nvelocity space (DVS) to accurately capture the non-equilibrium physics,\nrecovering the original unified gas-kinetic scheme (UGKS), and adaptively\nemploys continuous distribution functions based on the Chapman-Enskog expansion\nto achieve better efficiency. Different regions are dynamically coupled at the\ncell interface through the fluxes from the discrete and continuous gas\ndistribution functions, thereby avoiding any buffer zone between them. In the\ncurrent study, an implicit adaptive unified gas-kinetic scheme (IAUGKS) is\nconstructed to further enhance the efficiency of steady-state solutions. The\ncurrent scheme employs implicit macroscopic governing equations and couples\nthem with implicit microscopic governing equations within the non-equilibrium\nregion, resulting in high convergence efficiency in all flow regimes. A series\nof numerical tests were conducted for high Mach number flows around diverse\ngeometries such as a cylinder, a sphere, an X-38-like vehicle, and a space\nstation. The current scheme can capture the non-equilibrium physics and provide\naccurate predictions of surface quantities. In comparison with the original\nUGKS, the velocity space adaptation, unstructured DVS, and implicit iteration\nsignificantly improve the efficiency by one or two orders of magnitude. Given\nits exceptional efficiency and accuracy, the IAUGKS serves as an effective tool\nfor nonequilibrium flow simulations.\n","subjects":["Physics/Fluid Dynamics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}