{"id":"2407.19830","title":"Hall Effect, Magnetoresistance, and Current Distribution in Quench\n  Heaters","authors":"J. Rysti","authorsParsed":[["Rysti","J.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 09:34:58 GMT"}],"updateDate":"2024-07-30","timestamp":1722245698000,"abstract":"  Quench heaters are often an essential part of protecting a superconducting\naccelerator magnet during a quench. Their purpose is to spread the quench\nthroughout the coil as quickly as possible. They are located in areas of high\nmagnetic fields and are thus prone to magnetoresistive phenomena and the Hall\neffect. Such influences can cause currents to distribute unevenly in the\nheaters, which results in uneven heating. This can reduce the effectiveness of\nthe heaters and even endanger them due to excessive local heating. Also, the\nheater geometry itself can be the cause of uneven current density.\n  In this paper we investigate by numerical simulations the importance of the\nmagnetic effects on quench heater performance and whether they should be taken\ninto account in the design. The main interest is in the Hall effect, which was\nperceived as the most likely source of trouble for the design of quench\nheaters. We use a simple phenomenological approach for modeling the Hall\neffect, utilizing values from the literature for the Hall coefficients.\nMagnetoresistance is also considered and the impact of heater geometry on\ncurrent distributions is briefly visited.\n  The conclusion of this research is that magnetoresistance plays an\ninsignificant role in the functioning of quench heaters. The Hall effect can\nclearly be more influential, but nevertheless should not pose any problems in\nmost cases. Current distributions due to heater geometry should be take into\nconsideration in the design phase and, if needed, take measures to equalize the\ncurrent density by using, for example, copper cladding in appropriate\nlocations.\n","subjects":["Physics/Accelerator Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}