{"id":"2407.18045","title":"Signatures of Low Mass Black Hole-Neutron Star Mergers","authors":"Rahime Matur, Ian Hawke, Nils Andersson","authorsParsed":[["Matur","Rahime",""],["Hawke","Ian",""],["Andersson","Nils",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 13:53:23 GMT"}],"updateDate":"2024-07-26","timestamp":1721915603000,"abstract":"  The recent observation of the GW230529 event indicates that black\nhole-neutron star binaries can contain low-mass black holes. Since lower mass\nsystems are more favourable for tidal disruption, such events are promising\ncandidates for multi-messenger observations. In this study, we employ five\nfinite-temperature, composition-dependent matter equations of state and present\nresults from ten 3D general relativistic hydrodynamic simulations for the mass\nratios $q = 2.6$ and $5$. Two of these simulations target the chirp mass and\neffective spin parameter of the GW230529 event, while the remaining eight\ncontain slightly higher-mass black holes, including both spinning ($a_{BH} =\n0.7$) and non-spinning ($a_{BH} = 0$) models. We discuss the impact of the\nequation of state, spin, and mass ratio on black hole-neutron star mergers by\nexamining both gravitational-wave and ejected matter properties. For the\nlow-mass ratio model we do not see fast-moving ejecta for the softest equation\nof state model, but the stiffer model produces on the order of $10^{-6}M_\\odot$\nof fast-moving ejecta, expected to contribute to an electromagnetic\ncounterpart. Notably, the high-mass ratio model produces nearly the same amount\nof total dynamical ejecta, but yields $52$ times more fast-moving ejecta than\nthe low-mass ratio system. In addition, we observe that the black-hole spin\ntends to decrease the amount of fast-moving ejecta while increasing\nsignificantly the total ejected mass. Finally, we note that the disc mass tends\nto increase as the neutron star compactness decreases.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}