{"id":"2407.03640","title":"Generative Technology for Human Emotion Recognition: A Scope Review","authors":"Fei Ma, Yucheng Yuan, Yifan Xie, Hongwei Ren, Ivan Liu, Ying He, Fuji\n  Ren, Fei Richard Yu, Shiguang Ni","authorsParsed":[["Ma","Fei",""],["Yuan","Yucheng",""],["Xie","Yifan",""],["Ren","Hongwei",""],["Liu","Ivan",""],["He","Ying",""],["Ren","Fuji",""],["Yu","Fei Richard",""],["Ni","Shiguang",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 05:22:55 GMT"}],"updateDate":"2024-07-08","timestamp":1720070575000,"abstract":"  Affective computing stands at the forefront of artificial intelligence (AI),\nseeking to imbue machines with the ability to comprehend and respond to human\nemotions. Central to this field is emotion recognition, which endeavors to\nidentify and interpret human emotional states from different modalities, such\nas speech, facial images, text, and physiological signals. In recent years,\nimportant progress has been made in generative models, including Autoencoder,\nGenerative Adversarial Network, Diffusion Model, and Large Language Model.\nThese models, with their powerful data generation capabilities, emerge as\npivotal tools in advancing emotion recognition. However, up to now, there\nremains a paucity of systematic efforts that review generative technology for\nemotion recognition. This survey aims to bridge the gaps in the existing\nliterature by conducting a comprehensive analysis of over 320 research papers\nuntil June 2024. Specifically, this survey will firstly introduce the\nmathematical principles of different generative models and the commonly used\ndatasets. Subsequently, through a taxonomy, it will provide an in-depth\nanalysis of how generative techniques address emotion recognition based on\ndifferent modalities in several aspects, including data augmentation, feature\nextraction, semi-supervised learning, cross-domain, etc. Finally, the review\nwill outline future research directions, emphasizing the potential of\ngenerative models to advance the field of emotion recognition and enhance the\nemotional intelligence of AI systems.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}