{"id":"2407.02073","title":"Contribution Evaluation of Heterogeneous Participants in Federated\n  Learning via Prototypical Representations","authors":"Qi Guo, Minghao Yao, Zhen Tian, Saiyu Qi, Yong Qi, Yun Lin, Jin Song\n  Dong","authorsParsed":[["Guo","Qi",""],["Yao","Minghao",""],["Tian","Zhen",""],["Qi","Saiyu",""],["Qi","Yong",""],["Lin","Yun",""],["Dong","Jin Song",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 09:05:43 GMT"}],"updateDate":"2024-07-03","timestamp":1719911143000,"abstract":"  Contribution evaluation in federated learning (FL) has become a pivotal\nresearch area due to its applicability across various domains, such as\ndetecting low-quality datasets, enhancing model robustness, and designing\nincentive mechanisms. Existing contribution evaluation methods, which primarily\nrely on data volume, model similarity, and auxiliary test datasets, have shown\nsuccess in diverse scenarios. However, their effectiveness often diminishes due\nto the heterogeneity of data distributions, presenting a significant challenge\nto their applicability. In response, this paper explores contribution\nevaluation in FL from an entirely new perspective of representation. In this\nwork, we propose a new method for the contribution evaluation of heterogeneous\nparticipants in federated learning (FLCE), which introduces a novel indicator\n\\emph{class contribution momentum} to conduct refined contribution evaluation.\nOur core idea is the construction and application of the class contribution\nmomentum indicator from individual, relative, and holistic perspectives,\nthereby achieving an effective and efficient contribution evaluation of\nheterogeneous participants without relying on an auxiliary test dataset.\nExtensive experimental results demonstrate the superiority of our method in\nterms of fidelity, effectiveness, efficiency, and heterogeneity across various\nscenarios.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}