{"id":"2407.18472","title":"FedUD: Exploiting Unaligned Data for Cross-Platform Federated\n  Click-Through Rate Prediction","authors":"Wentao Ouyang, Rui Dong, Ri Tao, Xiangzheng Liu","authorsParsed":[["Ouyang","Wentao",""],["Dong","Rui",""],["Tao","Ri",""],["Liu","Xiangzheng",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 02:48:32 GMT"}],"updateDate":"2024-07-29","timestamp":1721962112000,"abstract":"  Click-through rate (CTR) prediction plays an important role in online\nadvertising platforms. Most existing methods use data from the advertising\nplatform itself for CTR prediction. As user behaviors also exist on many other\nplatforms, e.g., media platforms, it is beneficial to further exploit such\ncomplementary information for better modeling user interest and for improving\nCTR prediction performance. However, due to privacy concerns, data from\ndifferent platforms cannot be uploaded to a server for centralized model\ntraining. Vertical federated learning (VFL) provides a possible solution which\nis able to keep the raw data on respective participating parties and learn a\ncollaborative model in a privacy-preserving way. However, traditional VFL\nmethods only utilize aligned data with common keys across parties, which\nstrongly restricts their application scope. In this paper, we propose FedUD,\nwhich is able to exploit unaligned data, in addition to aligned data, for more\naccurate federated CTR prediction. FedUD contains two steps. In the first step,\nFedUD utilizes aligned data across parties like traditional VFL, but it\nadditionally includes a knowledge distillation module. This module distills\nuseful knowledge from the guest party's high-level representations and guides\nthe learning of a representation transfer network. In the second step, FedUD\napplies the learned knowledge to enrich the representations of the host party's\nunaligned data such that both aligned and unaligned data can contribute to\nfederated model training. Experiments on two real-world datasets demonstrate\nthe superior performance of FedUD for federated CTR prediction.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}