{"id":"2407.11781","title":"SlingBAG: Sliding ball adaptive growth algorithm with differentiable\n  radiation enables super-efficient iterative 3D photoacoustic image\n  reconstruction","authors":"Shuang Li, Yibing Wang, Jian Gao, Chulhong Kim, Seongwook Choi, Yu\n  Zhang, Qian Chen, Yao Yao, Changhui Li","authorsParsed":[["Li","Shuang",""],["Wang","Yibing",""],["Gao","Jian",""],["Kim","Chulhong",""],["Choi","Seongwook",""],["Zhang","Yu",""],["Chen","Qian",""],["Yao","Yao",""],["Li","Changhui",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:38:13 GMT"}],"updateDate":"2024-07-17","timestamp":1721140693000,"abstract":"  High-quality 3D photoacoustic imaging (PAI) reconstruction under sparse view\nor limited view has long been challenging. Traditional 3D iterative-based\nreconstruction methods suffer from both slow speed and high memory consumption.\nRecently, in computer graphics, the differentiable rendering has made\nsignificant progress, particularly with the rise of 3D Gaussian Splatting.\nInspired by these, we introduce differentiable radiation into PAI, developing a\nnovel reconstruction algorithm: the Sliding Ball Adaptive Growth algorithm\n(SlingBAG) for 3D PAI, which shows ability in high-quality 3D PAI\nreconstruction both under extremely sparse view and limited view.\n  We established the point cloud dataset in PAI, and used unique differentiable\nrapid radiator based on the spherical decomposition strategy and the randomly\ninitialized point cloud adaptively optimized according to sparse sensor data.\nEach point undergoes updates in 3D coordinates, initial pressure, and\nresolution (denoted by the radius of ball). Points undergo adaptive growth\nduring iterative process, including point destroying, splitting and duplicating\nalong the gradient of their positions, manifesting the sliding ball effect.\n  Finally, our point cloud to voxel grid shader renders the final\nreconstruction results. Simulation and in vivo experiments demonstrate that our\nSlingBAG reconstruction result's SNR can be more than 40 dB under extremely\nsparse view, while the SNR of traditional back-projection algorithm's result is\nless than 20 dB. Moreover, the result of SlingBAG's structural similarity to\nthe ground truth is significantly higher, with an SSIM value of 95.6%.\n  Notably, our differentiable rapid radiator can conduct forward PA simulation\nin homogeneous, non-viscous media substantially faster than current methods\nthat numerically simulate the wave propagation, such as k-Wave. The dataset and\nall code will be open source.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}