{"id":"2407.18607","title":"Using GPT-4 to guide causal machine learning","authors":"Anthony C. Constantinou, Neville K. Kitson, Alessio Zanga","authorsParsed":[["Constantinou","Anthony C.",""],["Kitson","Neville K.",""],["Zanga","Alessio",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 08:59:26 GMT"}],"updateDate":"2024-07-29","timestamp":1721984366000,"abstract":"  Since its introduction to the public, ChatGPT has had an unprecedented\nimpact. While some experts praised AI advancements and highlighted their\npotential risks, others have been critical about the accuracy and usefulness of\nLarge Language Models (LLMs). In this paper, we are interested in the ability\nof LLMs to identify causal relationships. We focus on the well-established\nGPT-4 (Turbo) and evaluate its performance under the most restrictive\nconditions, by isolating its ability to infer causal relationships based solely\non the variable labels without being given any context, demonstrating the\nminimum level of effectiveness one can expect when it is provided with\nlabel-only information. We show that questionnaire participants judge the GPT-4\ngraphs as the most accurate in the evaluated categories, closely followed by\nknowledge graphs constructed by domain experts, with causal Machine Learning\n(ML) far behind. We use these results to highlight the important limitation of\ncausal ML, which often produces causal graphs that violate common sense,\naffecting trust in them. However, we show that pairing GPT-4 with causal ML\novercomes this limitation, resulting in graphical structures learnt from real\ndata that align more closely with those identified by domain experts, compared\nto structures learnt by causal ML alone. Overall, our findings suggest that\ndespite GPT-4 not being explicitly designed to reason causally, it can still be\na valuable tool for causal representation, as it improves the causal discovery\nprocess of causal ML algorithms that are designed to do just that.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}