{"id":"2407.07769","title":"HSTPROMO Internal Proper Motion Kinematics of Dwarf Spheroidal Galaxies:\n  I. Velocity Anisotropy and Dark Matter Cusp Slope of Draco","authors":"Eduardo Vitral, Roeland P. van der Marel, Sangmo Tony Sohn, Mattia\n  Libralato, Andr\\'es del Pino, Laura L. Watkins, Andrea Bellini, Matthew G.\n  Walker, Gurtina Besla, Marcel S. Pawlowski, Gary A. Mamon","authorsParsed":[["Vitral","Eduardo",""],["van der Marel","Roeland P.",""],["Sohn","Sangmo Tony",""],["Libralato","Mattia",""],["del Pino","Andrés",""],["Watkins","Laura L.",""],["Bellini","Andrea",""],["Walker","Matthew G.",""],["Besla","Gurtina",""],["Pawlowski","Marcel S.",""],["Mamon","Gary A.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:45:29 GMT"}],"updateDate":"2024-07-11","timestamp":1720626329000,"abstract":"  We analyze four epochs of HST imaging over 18 years for the Draco dwarf\nspheroidal galaxy. We measure precise proper motions (PMs) for hundreds of\nstars and combine these with existing line-of-sight (LOS) velocities. This\nprovides the first radially-resolved 3D velocity dispersion profiles for any\ndwarf galaxy. These constrain the intrinsic velocity anisotropy and resolve the\nmass-anisotropy degeneracy. We solve the Jeans equations in oblate axisymmetric\ngeometry to infer the mass profile. We find the velocity dispersion to be\nradially anisotropic along the symmetry axis and tangentially anisotropic in\nthe equatorial plane, with a globally-averaged value $\\overline{\\beta_{\\mathrm\nB}}=-0.20^{+ 0.28}_{- 0.53}$, (where $1 - \\beta_{\\mathrm B} \\equiv \\langle\nv_{\\mathrm{ tan}}^2 \\rangle / \\langle v_{\\mathrm{ rad}}^2 \\rangle$ in 3D). The\nlogarithmic dark matter (DM) density slope over the observed radial range,\n$\\Gamma_{\\mathrm{ dark}}$, is $-0.83^{+ 0.32}_{- 0.37}$, consistent with the\ninner cusp predicted in $\\Lambda$CDM cosmology. As expected given Draco's low\nmass and ancient star formation history, it does not appear to have been\ndissolved by baryonic processes. We rule out cores larger than 487, 717, 942 pc\nat respective 1-, 2-, 3-$\\sigma$ confidence, thus imposing important\nconstraints on the self-interacting DM cross-section. Spherical models yield\nbiased estimates for both the velocity anisotropy and the inferred slope. The\ncircular velocity at our outermost data point (900 pc) is $24.19^{+ 6.31}_{-\n2.97} \\ \\mathrm{km~s^{-1}}s$. We infer a dynamical distance of $75.37^{+\n4.73}_{- 4.00}$ kpc, and show that Draco has a modest LOS rotation, with\n$\\left<v / \\sigma \\right> = 0.22 \\pm 0.09$. Our results provide a new stringent\ntest of the so-called `cusp-core' problem that can be readily extended to other\ndwarfs.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}