{"id":"2407.09611","title":"A Phenomenological Analysis of LHC Neutrino Scattering at NLO Accuracy\n  Matched to Parton Showers","authors":"Melissa van Beekveld, Silvia Ferrario Ravasio, Eva Groenendijk, Peter\n  Krack, Juan Rojo, and Valentina Sch\\\"utze S\\'anchez","authorsParsed":[["van Beekveld","Melissa",""],["Ravasio","Silvia Ferrario",""],["Groenendijk","Eva",""],["Krack","Peter",""],["Rojo","Juan",""],["Sánchez","Valentina Schütze",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 18:00:06 GMT"}],"updateDate":"2024-07-16","timestamp":1720807206000,"abstract":"  We perform a detailed phenomenological study of high-energy neutrino deep\ninelastic scattering (DIS) focused on LHC far-forward experiments such as\nFASER$\\nu$ and SND@LHC. To this aim, we parametrise the neutrino fluxes\nreaching these LHC far-forward experiments in terms of `neutrino PDFs' encoding\ntheir energy and rapidity dependence by means of the LHAPDF framework. We\nintegrate these neutrino PDFs in the recently developed POWHEG-BOX-RES\nimplementation of neutrino-induced DIS to produce predictions accurate at\nnext-to-leading order (NLO) in the QCD coupling matched to parton showers (PS)\nwith Pythia8. We present NLO+PS predictions for final-state distributions\nwithin the acceptance of FASER$\\nu$ and SND@LHC as well as for two experiments\nof the proposed Forward Physics Facility (FPF), FASER$\\nu$2 and FLArE. We\nquantify the impact of NLO QCD corrections, of the parton showering and\nhadronisation settings in Pythia8, of the QED shower, and of the incoming\nneutrino flavour for the description of these observables, and compare our\npredictions with the GENIE neutrino event generator. Our work demonstrates the\nrelevance of modern higher-order event generators to achieve the key scientific\ntargets of the LHC neutrino experiments.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/"}