{"id":"2407.05681","title":"Bulk high-temperature superconductivity in the high-pressure tetragonal\n  phase of bilayer La2PrNi2O7","authors":"Ningning Wang, Gang Wang, Xiaoling Shen, Jun Hou, Jun Luo, Xiaoping\n  Ma, Huaixin Yang, Lifen Shi, Jie Dou, Jie Feng, Jie Yang, Yunqing Shi, Zhian\n  Ren, Hanming Ma, Pengtao Yang, Ziyi Liu, Yue Liu, Hua Zhang, Xiaoli Dong,\n  Yuxin Wang, Kun Jiang, Jiangping Hu, Stuart Calder, Jiaqiang Yan, Jianping\n  Sun, Bosen Wang, Rui Zhou, Yoshiya Uwatoko, and Jinguang Cheng","authorsParsed":[["Wang","Ningning",""],["Wang","Gang",""],["Shen","Xiaoling",""],["Hou","Jun",""],["Luo","Jun",""],["Ma","Xiaoping",""],["Yang","Huaixin",""],["Shi","Lifen",""],["Dou","Jie",""],["Feng","Jie",""],["Yang","Jie",""],["Shi","Yunqing",""],["Ren","Zhian",""],["Ma","Hanming",""],["Yang","Pengtao",""],["Liu","Ziyi",""],["Liu","Yue",""],["Zhang","Hua",""],["Dong","Xiaoli",""],["Wang","Yuxin",""],["Jiang","Kun",""],["Hu","Jiangping",""],["Calder","Stuart",""],["Yan","Jiaqiang",""],["Sun","Jianping",""],["Wang","Bosen",""],["Zhou","Rui",""],["Uwatoko","Yoshiya",""],["Cheng","Jinguang",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 07:28:52 GMT"}],"updateDate":"2024-07-09","timestamp":1720423732000,"abstract":"  The Ruddlesden-Popper (R-P) bilayer nickelate, La3Ni2O7, was recently found\nto show signatures of high-temperature superconductivity (HTSC) at pressures\nabove 14 GPa. Subsequent investigations achieved zero resistance in single- and\npoly-crystalline samples under hydrostatic pressure conditions. Yet, obvious\ndiamagnetic signals, the other hallmark of superconductors, are still lacking\nowing to the filamentary nature with low superconducting volume fraction. The\npresence of a novel \"1313\" polymorph and competing R-P phases obscured proper\nidentification of the phase for HTSC. Thus, achieving bulk HTSC and identifying\nthe phase at play are the most prominent tasks at present. Here, we address\nthese issues in the praseodymium (Pr)-doped La2PrNi2O7 polycrystalline samples.\nWe find that the substitutions of Pr for La effectively inhibits the\nintergrowth of different R-P phases, resulting in nearly pure bilayer\nstructure. For La2PrNi2O7, pressure-induced orthorhombic-to-tetragonal\nstructural transition takes place at Pc ~ 11 GPa, above which HTSC emerges\ngradually upon further compression. The superconducting transition temperatures\nat 18-20 GPa reach Tconset = 82.5 K and Tczero = 60 K, which are the highest\nvalues among known nickelate superconductors. More importantly, bulk HTSC was\ntestified by detecting clear diamagnetic signals below ~75 K corresponding to\nan estimated superconducting volume fraction ~ 57(5)% at 20 GPa. Our results\nnot only resolve the existing controversies but also illuminate directions for\nexploring bulk HTSC in the bilayer nickelates.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RucfBZ0FZWcFA_DKOCOsDqI7W5Yqsr9RmmQzMbfUwxc","pdfSize":"8938829"}
