{"id":"2407.15028","title":"Statistical Models for Outbreak Detection of Measles in North Cotabato,\n  Philippines","authors":"Julienne Kate N. Kintanar, Roel F. Ceballos","authorsParsed":[["Kintanar","Julienne Kate N.",""],["Ceballos","Roel F.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 01:25:51 GMT"}],"updateDate":"2024-07-23","timestamp":1721525151000,"abstract":"  A measles outbreak occurs when the number of cases of measles in the\npopulation exceeds the typical level. Outbreaks that are not detected and\nmanaged early can increase mortality and morbidity and incur costs from\nactivities responding to these events. The number of measles cases in the\nProvince of North Cotabato, Philippines, was used in this study. Weekly\nreported cases of measles from January 2016 to December 2021 were provided by\nthe Epidemiology and Surveillance Unit of the North Cotabato Provincial Health\nOffice. Several integer-valued autoregressive (INAR) time series models were\nused to explore the possibility of detecting and identifying measles outbreaks\nin the province along with the classical ARIMA model. These models were\nevaluated based on goodness of fit, measles outbreak detection accuracy, and\ntimeliness. The results of this study confirmed that INAR models have the\nconceptual advantage over ARIMA since the latter produces non-integer\nforecasts, which are not realistic for count data such as measles cases. Among\nthe INAR models, the ZINGINAR (1) model was recommended for having a good model\nfit and timely and accurate detection of outbreaks. Furthermore, policymakers\nand decision-makers from relevant government agencies can use the ZINGINAR (1)\nmodel to improve disease surveillance and implement preventive measures against\ncontagious diseases beforehand.\n","subjects":["Quantitative Biology/Quantitative Methods","Statistics/Applications","Statistics/Computation","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"wnhSl6a9ZkOrNDR3yrYBZXtISJ2FYDj9tlFHK-62_bw","pdfSize":"1328279"}
