{"id":"2407.08154","title":"Bayesian uncertainty analysis for underwater 3D reconstruction with\n  neural radiance fields","authors":"Haojie Lian, Xinhao Li, Yilin Qu, Jing Du, Zhuxuan Meng, Jie Liu,\n  Leilei Chen","authorsParsed":[["Lian","Haojie",""],["Li","Xinhao",""],["Qu","Yilin",""],["Du","Jing",""],["Meng","Zhuxuan",""],["Liu","Jie",""],["Chen","Leilei",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 03:16:51 GMT"}],"updateDate":"2024-07-12","timestamp":1720667811000,"abstract":"  Neural radiance fields (NeRFs) are a deep learning technique that can\ngenerate novel views of 3D scenes using sparse 2D images from different viewing\ndirections and camera poses. As an extension of conventional NeRFs in\nunderwater environment, where light can get absorbed and scattered by water,\nSeaThru-NeRF was proposed to separate the clean appearance and geometric\nstructure of underwater scene from the effects of the scattering medium. Since\nthe quality of the appearance and structure of underwater scenes is crucial for\ndownstream tasks such as underwater infrastructure inspection, the reliability\nof the 3D reconstruction model should be considered and evaluated. Nonetheless,\nowing to the lack of ability to quantify uncertainty in 3D reconstruction of\nunderwater scenes under natural ambient illumination, the practical deployment\nof NeRFs in unmanned autonomous underwater navigation is limited. To address\nthis issue, we introduce a spatial perturbation field D_omega based on Bayes'\nrays in SeaThru-NeRF and perform Laplace approximation to obtain a Gaussian\ndistribution N(0,Sigma) of the parameters omega, where the diagonal elements of\nSigma correspond to the uncertainty at each spatial location. We also employ a\nsimple thresholding method to remove artifacts from the rendered results of\nunderwater scenes. Numerical experiments are provided to demonstrate the\neffectiveness of this approach.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}