{"id":"2407.20413","title":"Through the Looking Glass, and what Horn Clause Programs Found There","authors":"Paul Tarau","authorsParsed":[["Tarau","Paul",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 20:52:26 GMT"}],"updateDate":"2024-07-31","timestamp":1722286346000,"abstract":"  Dual Horn clauses mirror key properties of Horn clauses. This paper explores\nthe ``other side of the looking glass'' to reveal some expected and unexpected\nsymmetries and their practical uses.\n  We revisit Dual Horn clauses as enablers of a form of constructive negation\nthat supports goal-driven forward reasoning and is valid both\nintuitionistically and classically. In particular, we explore the ability to\nfalsify a counterfactual hypothesis in the context of a background theory\nexpressed as a Dual Horn clause program.\n  With Dual Horn clause programs, by contrast to negation as failure, the\nvariable bindings in their computed answers provide explanations for the\nreasons why a statement is successfully falsified. Moreover, in the\npropositional case, by contrast to negation as failure as implemented with\nstable models semantics in ASP systems, and similarly to Horn clause programs,\nDual Horn clause programs have polynomial complexity.\n  After specifying their execution model with a metainterpreter, we devise a\ncompilation scheme from Dual Horn clause programs to Horn clause programs,\nensuring their execution with no performance penalty and we design the embedded\nSymLP language to support combined Horn clause and Dual Horn clause programs.\n  As a (motivating) application, we cast LLM reasoning chains into\npropositional Horn and Dual Horn clauses that work together to constructively\nprove and disprove goals and enhance Generative AI with explainability of\nreasoning chains.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FZoQypcf5kfIfomuyZITCk4XdrK3vHrdbXPITcIebUM","pdfSize":"313677"}
