{"id":"2407.03982","title":"Configuring Transmission Thresholds in IIoT Alarm Scenarios for\n  Energy-Efficient Event Reporting","authors":"David E. Ru\\'iz-Guirola, Onel L. A. L\\'opez, and Samuel\n  Montejo-S\\'anchez","authorsParsed":[["Ruíz-Guirola","David E.",""],["López","Onel L. A.",""],["Montejo-Sánchez","Samuel",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 14:55:00 GMT"}],"updateDate":"2024-07-08","timestamp":1720104900000,"abstract":"  Industrial Internet of Things (IIoT) applications involve real-time\nmonitoring, detection, and data analysis. This is challenged by the\nintermittent activity of IIoT devices (IIoTDs) and their limited battery\ncapacity. Indeed, the former issue makes resource scheduling and random access\ndifficult, while the latter constrains IIoTDs' lifetime and efficient\noperation. In this paper, we address interconnected aspects of these issues.\nSpecifically, we focus on extending the battery life of IIoTDs sensing\nevents/alarms by minimizing the number of unnecessary transmissions. Note that\nwhen multiple devices access the channel simultaneously, there are collisions,\npotentially leading to retransmissions, thus reducing energy efficiency. We\npropose a threshold-based transmission-decision policy based on the sensing\nquality and the network spatial deployment. We optimize the transmission\nthresholds using several approaches such as successive convex approximation,\nblock coordinate descent methods, Voronoi diagrams, explainable machine\nlearning, and algorithms based on natural selection and social behavior.\nBesides, we propose a new approach that reformulates the optimization problem\nas a $Q$-learning solution to promote adaptability to system dynamics. Through\nnumerical evaluation, we demonstrate significant performance enhancements in\ncomplex IIoT environments, thus validating the practicality and effectiveness\nof the proposed solutions. We show that Q-learning performs the best, while the\nblock coordinate descending method incurs the worst performance. Additionally,\nwe compare the proposed methods with a benchmark assigning the same threshold\nto all the devices for transmission decision. Compared to the benchmark, up to\n94\\% and 60\\% reduction in power consumption are achieved in low-density and\nhigh-density scenarios, respectively.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}