{"id":"2407.11287","title":"A Self-Correcting Strategy of the Digital Volume Correlation\n  Displacement Field Based on Image Matching: Application to Poor Speckles\n  Quality and Complex-Large Deformation","authors":"Chengsheng Li and Zhijun Liu","authorsParsed":[["Li","Chengsheng",""],["Liu","Zhijun",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 00:03:09 GMT"}],"updateDate":"2024-07-17","timestamp":1721088189000,"abstract":"  Digital Volume Correlation (DVC) is widely used for the analysis of\nthree-dimensional displacement and strain fields based on CT scans. However,\nthe applicability of DVC methods is limited when it comes to geomaterials: CT\nspeckles are directly correlated with the material's microstructure, and the\nspeckle structure cannot be artificially altered, with generally poor speckle\nquality. Additionally, most geomaterials exhibit elastoplastic properties and\nwill undergo complex-large deformations under external loading, sometimes\nleading to strain localization phenomena. These factors contribute to\ninaccuracies in the displacement field obtained through DVC, and at present,\nthere is a shortage of correction methods and accuracy assessment techniques\nfor the displacement field. If the accuracy of the DVC displacement field is\nsufficiently high, the gray residue of the two volume images before and after\ndeformation should be minimal, utilizing this characteristic to develop a\ncorrection method for the displacement field is feasible. The proposed\nself-correcting strategy of the DVC displacement field based on image matching,\nwhich from the experimental measurement error. We demonstrated the\neffectiveness of the proposed method by CT triaxial tests of granite residual\nsoil. Without adding other parameters or adjusting the original parameters of\nDVC, the gray residue showed that the proposed method can effectively improve\nthe accuracy of the displacement field. Additionally, the accuracy evaluation\nmethod can reasonably estimate the accuracy of the displacement field. The\nproposed method can effectively improve the accuracy of DVC three-dimensional\ndisplacement field for the state of speckles with poor quality and\ncomplex-large deformation.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QcdGZ7jmrTbYfO2bxjjSMtFWQhQdY-2uD9WX6I4oMKw","pdfSize":"1836320"}
