{"id":"2407.00718","title":"ASPS: Augmented Segment Anything Model for Polyp Segmentation","authors":"Huiqian Li, Dingwen Zhang, Jieru Yao, Longfei Han, Zhongyu Li, Junwei\n  Han","authorsParsed":[["Li","Huiqian",""],["Zhang","Dingwen",""],["Yao","Jieru",""],["Han","Longfei",""],["Li","Zhongyu",""],["Han","Junwei",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 14:55:32 GMT"}],"updateDate":"2024-07-02","timestamp":1719759332000,"abstract":"  Polyp segmentation plays a pivotal role in colorectal cancer diagnosis.\nRecently, the emergence of the Segment Anything Model (SAM) has introduced\nunprecedented potential for polyp segmentation, leveraging its powerful\npre-training capability on large-scale datasets. However, due to the domain gap\nbetween natural and endoscopy images, SAM encounters two limitations in\nachieving effective performance in polyp segmentation. Firstly, its\nTransformer-based structure prioritizes global and low-frequency information,\npotentially overlooking local details, and introducing bias into the learned\nfeatures. Secondly, when applied to endoscopy images, its poor\nout-of-distribution (OOD) performance results in substandard predictions and\nbiased confidence output. To tackle these challenges, we introduce a novel\napproach named Augmented SAM for Polyp Segmentation (ASPS), equipped with two\nmodules: Cross-branch Feature Augmentation (CFA) and Uncertainty-guided\nPrediction Regularization (UPR). CFA integrates a trainable CNN encoder branch\nwith a frozen ViT encoder, enabling the integration of domain-specific\nknowledge while enhancing local features and high-frequency details. Moreover,\nUPR ingeniously leverages SAM's IoU score to mitigate uncertainty during the\ntraining procedure, thereby improving OOD performance and domain\ngeneralization. Extensive experimental results demonstrate the effectiveness\nand utility of the proposed method in improving SAM's performance in polyp\nsegmentation. Our code is available at https://github.com/HuiqianLi/ASPS.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}