{"id":"2407.07041","title":"Hiding Local Manipulations on SAR Images: a Counter-Forensic Attack","authors":"Sara Mandelli, Edoardo Daniele Cannas, Paolo Bestagini, Stefano\n  Tebaldini, Stefano Tubaro","authorsParsed":[["Mandelli","Sara",""],["Cannas","Edoardo Daniele",""],["Bestagini","Paolo",""],["Tebaldini","Stefano",""],["Tubaro","Stefano",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 17:03:57 GMT"}],"updateDate":"2024-07-10","timestamp":1720544637000,"abstract":"  The vast accessibility of Synthetic Aperture Radar (SAR) images through\nonline portals has propelled the research across various fields. This\nwidespread use and easy availability have unfortunately made SAR data\nsusceptible to malicious alterations, such as local editing applied to the\nimages for inserting or covering the presence of sensitive targets.\nVulnerability is further emphasized by the fact that most SAR products, despite\ntheir original complex nature, are often released as amplitude-only\ninformation, allowing even inexperienced attackers to edit and easily alter the\npixel content. To contrast malicious manipulations, in the last years the\nforensic community has begun to dig into the SAR manipulation issue, proposing\ndetectors that effectively localize the tampering traces in amplitude images.\nNonetheless, in this paper we demonstrate that an expert practitioner can\nexploit the complex nature of SAR data to obscure any signs of manipulation\nwithin a locally altered amplitude image. We refer to this approach as a\ncounter-forensic attack. To achieve the concealment of manipulation traces, the\nattacker can simulate a re-acquisition of the manipulated scene by the SAR\nsystem that initially generated the pristine image. In doing so, the attacker\ncan obscure any evidence of manipulation, making it appear as if the image was\nlegitimately produced by the system. We assess the effectiveness of the\nproposed counter-forensic approach across diverse scenarios, examining various\nmanipulation operations. The obtained results indicate that our devised attack\nsuccessfully eliminates traces of manipulation, deceiving even the most\nadvanced forensic detectors.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}