{"id":"2407.01050","title":"Evolutionary Morphology Towards Overconstrained Locomotion via\n  Large-Scale, Multi-Terrain Deep Reinforcement Learning","authors":"Yenan Chen and Chuye Zhang and Pengxi Gu and Jianuo Qiu and Jiayi Yin\n  and Nuofan Qiu and Guojing Huang and Bangchao Huang and Zishang Zhang and Hui\n  Deng and Wei Zhang and Fang Wan and Chaoyang Song","authorsParsed":[["Chen","Yenan",""],["Zhang","Chuye",""],["Gu","Pengxi",""],["Qiu","Jianuo",""],["Yin","Jiayi",""],["Qiu","Nuofan",""],["Huang","Guojing",""],["Huang","Bangchao",""],["Zhang","Zishang",""],["Deng","Hui",""],["Zhang","Wei",""],["Wan","Fang",""],["Song","Chaoyang",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 07:57:01 GMT"}],"updateDate":"2024-07-02","timestamp":1719820621000,"abstract":"  While the animals' Fin-to-Limb evolution has been well-researched in biology,\nsuch morphological transformation remains under-adopted in the modern design of\nadvanced robotic limbs. This paper investigates a novel class of\noverconstrained locomotion from a design and learning perspective inspired by\nevolutionary morphology, aiming to integrate the concept of `intelligent design\nunder constraints' - hereafter referred to as constraint-driven design\nintelligence - in developing modern robotic limbs with superior energy\nefficiency. We propose a 3D-printable design of robotic limbs parametrically\nreconfigurable as a classical planar 4-bar linkage, an overconstrained Bennett\nlinkage, and a spherical 4-bar linkage. These limbs adopt a co-axial actuation,\nidentical to the modern legged robot platforms, with the added capability of\nupgrading into a wheel-legged system. Then, we implemented a large-scale,\nmulti-terrain deep reinforcement learning framework to train these\nreconfigurable limbs for a comparative analysis of overconstrained locomotion\nin energy efficiency. Results show that the overconstrained limbs exhibit more\nefficient locomotion than planar limbs during forward and sideways walking over\ndifferent terrains, including floors, slopes, and stairs, with or without\nrandom noises, by saving at least 22% mechanical energy in completing the\ntraverse task, with the spherical limbs being the least efficient. It also\nachieves the highest average speed of 0.85 meters per second on flat terrain,\nwhich is 20% faster than the planar limbs. This study paves the path for an\nexciting direction for future research in overconstrained robotics leveraging\nevolutionary morphology and reconfigurable mechanism intelligence when combined\nwith state-of-the-art methods in deep reinforcement learning.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ybCfTuEgiN4IFHb7oDKpSOw8W-BzlVUDaIOLjTtptDg","pdfSize":"7915542"}
