{"id":"2407.00828","title":"DRL-Based RAT Selection in a Hybrid Vehicular Communication Network","authors":"Badreddine Yacine Yacheur (LaBRI), Toufik Ahmed (LaBRI), Mohamed\n  Mosbah (LaBRI)","authorsParsed":[["Yacheur","Badreddine Yacine","","LaBRI"],["Ahmed","Toufik","","LaBRI"],["Mosbah","Mohamed","","LaBRI"]],"versions":[{"version":"v1","created":"Wed, 3 Apr 2024 08:13:07 GMT"}],"updateDate":"2024-07-02","timestamp":1712131987000,"abstract":"  Cooperative intelligent transport systems rely on a set of\nVehicle-to-Everything (V2X) applications to enhance road safety. Emerging new\nV2X applications like Advanced Driver Assistance Systems (ADASs) and Connected\nAutonomous Driving (CAD) applications depend on a significant amount of shared\ndata and require high reliability, low end-to-end (E2E) latency, and high\nthroughput. However, present V2X communication technologies such as ITS-G5 and\nC-V2X (Cellular V2X) cannot satisfy these requirements alone. In this paper, we\npropose an intelligent, scalable hybrid vehicular communication architecture\nthat leverages the performance of multiple Radio Access Technologies (RATs) to\nmeet the needs of these applications. Then, we propose a communication mode\nselection algorithm based on Deep Reinforcement Learning (DRL) to maximize the\nnetwork's reliability while limiting resource consumption. Finally, we assess\nour work using the platooning scenario that requires high reliability.\nNumerical results reveal that the hybrid vehicular communication architecture\nhas the potential to enhance the packet reception rate (PRR) by up to 30%\ncompared to both the static RAT selection strategy and the multi-criteria\ndecision-making (MCDM) selection algorithm. Additionally, it improves the\nefficiency of the redundant communication mode by 20% regarding resource\nconsumption\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}