{"id":"2407.12891","title":"Global-Local Similarity for Efficient Fine-Grained Image Recognition\n  with Vision Transformers","authors":"Edwin Arkel Rios, Min-Chun Hu, Bo-Cheng Lai","authorsParsed":[["Rios","Edwin Arkel",""],["Hu","Min-Chun",""],["Lai","Bo-Cheng",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 10:04:54 GMT"}],"updateDate":"2024-07-19","timestamp":1721210694000,"abstract":"  Fine-grained recognition involves the classification of images from\nsubordinate macro-categories, and it is challenging due to small inter-class\ndifferences. To overcome this, most methods perform discriminative feature\nselection enabled by a feature extraction backbone followed by a high-level\nfeature refinement step. Recently, many studies have shown the potential behind\nvision transformers as a backbone for fine-grained recognition, but their usage\nof its attention mechanism to select discriminative tokens can be\ncomputationally expensive. In this work, we propose a novel and computationally\ninexpensive metric to identify discriminative regions in an image. We compare\nthe similarity between the global representation of an image given by the CLS\ntoken, a learnable token used by transformers for classification, and the local\nrepresentation of individual patches. We select the regions with the highest\nsimilarity to obtain crops, which are forwarded through the same transformer\nencoder. Finally, high-level features of the original and cropped\nrepresentations are further refined together in order to make more robust\npredictions. Through extensive experimental evaluation we demonstrate the\neffectiveness of our proposed method, obtaining favorable results in terms of\naccuracy across a variety of datasets. Furthermore, our method achieves these\nresults at a much lower computational cost compared to the alternatives. Code\nand checkpoints are available at: \\url{https://github.com/arkel23/GLSim}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Uh2JtS99rzHSFb1r8e-dbuZ_hLVyK5F6lsoHdo8ugq8","pdfSize":"25283582"}
