{"id":"2407.10791","title":"Interactive Public Transport Infrastructure Analysis through Mobility\n  Profiles: Making the Mobility Transition Transparent","authors":"Yannick Metz, Dennis Ackermann, Daniel A. Keim, Maximilian T. Fischer","authorsParsed":[["Metz","Yannick",""],["Ackermann","Dennis",""],["Keim","Daniel A.",""],["Fischer","Maximilian T.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 15:09:14 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 06:50:16 GMT"}],"updateDate":"2024-08-27","timestamp":1721056154000,"abstract":"  Efficient public transport systems are crucial for sustainable urban\ndevelopment as cities face increasing mobility demands. Yet, many public\ntransport networks struggle to meet diverse user needs due to historical\ndevelopment, urban constraints, and financial limitations. Traditionally,\nplanning of transport network structure is often based on limited surveys,\nexpert opinions, or partial usage statistics. This provides an incomplete basis\nfor decision-making. We introduce an data-driven approach to public transport\nplanning and optimization, calculating detailed accessibility measures at the\nindividual housing level. Our visual analytics workflow combines\npopulation-group-based simulations with dynamic infrastructure analysis,\nutilizing a scenario-based model to simulate daily travel patterns of varied\ndemographic groups, including schoolchildren, students, workers, and\npensioners. These population groups, each with unique mobility requirements and\nroutines, interact with the transport system under different scenarios\ntraveling to and from Points of Interest (POI), assessed through travel time\ncalculations. Results are visualized through heatmaps, density maps, and\nnetwork overlays, as well as detailed statistics. Our system allows us to\nanalyze both the underlying data and simulation results on multiple levels of\ngranularity, delivering both broad insights and granular details. Case studies\nwith the city of Konstanz, Germany reveal key areas where public transport does\nnot meet specific needs, confirmed through a formative user study. Due to the\nhigh cost of changing legacy networks, our analysis facilitates the\nidentification of strategic enhancements, such as optimized schedules or\nrerouting, and few targeted stop relocations, highlighting consequential\nvariations in accessibility to pinpointing critical service gaps.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}