{"id":"2407.09504","title":"AI-Based Copyright Detection Of An Image In a Video Using Degree Of\n  Similarity And Image Hashing","authors":"Ashutosh and Rahul Jashvantbhai Pandya","authorsParsed":[["Ashutosh","",""],["Pandya","Rahul Jashvantbhai",""]],"versions":[{"version":"v1","created":"Fri, 14 Jun 2024 09:47:07 GMT"}],"updateDate":"2024-07-16","timestamp":1718358427000,"abstract":"  The expanse of information available over the internet makes it difficult to\nidentify whether a specific work is a replica or a duplication of a protected\nwork, especially if we talk about visual representations. Strategies are\nplanned to identify the utilization of the copyrighted image in a report.\nStill, we want to resolve the issue of involving a copyrighted image in a video\nand a calculation that could recognize the degree of similarity of the\ncopyrighted picture utilized in the video, even for the pieces of the video\nthat are not featured a lot and in the end perform characterization errands on\nthose edges. Machine learning (ML) and artificial intelligence (AI) are vital\nto address this problem. Numerous associations have been creating different\ncalculations to screen the identification of copyrighted work. This work means\nconcentrating on those calculations, recognizing designs inside the\ninformation, and fabricating a more reasonable model for copyrighted image\nclassification and detection. We have used different algorithms like- Image\nProcessing, Convolutional Neural Networks (CNN), Image hashing, etc. Keywords-\nCopyright, Artificial Intelligence(AI), Copyrighted Image, Convolutional Neural\nNetwork(CNN), Image processing, Degree of similarity, Image Hashing.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Emerging Technologies","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"-ECT5nhgXA2q7OtcFu7sqQfQk1hqjPM-g9QZaHaMY_o","pdfSize":"2424817"}
