{"id":"2407.07954","title":"3D E-textile for Exercise Physiology and Clinical Maternal Health\n  Monitoring","authors":"Junyi Zhao, Chansoo Kim, Weilun Li, Zichao Wen, Zhili Xiao, Yong Wang,\n  Shantanu Chakrabartty, Chuan Wang","authorsParsed":[["Zhao","Junyi",""],["Kim","Chansoo",""],["Li","Weilun",""],["Wen","Zichao",""],["Xiao","Zhili",""],["Wang","Yong",""],["Chakrabartty","Shantanu",""],["Wang","Chuan",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:00:09 GMT"}],"updateDate":"2024-07-12","timestamp":1720634409000,"abstract":"  Electronic textiles (E-textiles) offer great wearing comfort and\nunobtrusiveness, thus holding potential for next-generation health monitoring\nwearables. However, the practical implementation is hampered by challenges\nassociated with poor signal quality, substantial motion artifacts, durability\nfor long-term usage, and non-ideal user experience. Here, we report a\ncost-effective E-textile system that features 3D microfiber-based electrodes\nfor greatly increasing the surface area. The soft and fluffy conductive\nmicrofibers disperse freely and securely adhere to the skin, achieving a low\nimpedance at the electrode-skin interface even in the absence of gel. A\nsuperhydrophobic fluorinated self-assembled monolayer was deposited on the\nE-textile surface to render it waterproof while retaining the electrical\nconductivity. Equipped with a custom-designed motion-artifact canceling\nwireless data recording circuit, the E-textile system could be integrated into\na variety of smart garments for exercise physiology and health monitoring\napplications. Real-time multimodal electrophysiological signal monitoring,\nincluding electrocardiogram (ECG) and electromyography (EMG), was successfully\ncarried out during strenuous cycling and even underwater swimming activities.\nFurthermore, a multi-channel E-textile was developed and implemented in\nclinical patient studies for simultaneous real-time monitoring of maternal ECG\nand uterine EMG signals, incorporating spatial-temporal potential mapping\ncapabilities.\n","subjects":["Physics/Medical Physics","Condensed Matter/Materials Science","Condensed Matter/Soft Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}