{"id":"2407.09397","title":"A grid of self-consistent MSG (MARCS-StaticWeather-GGchem) cool stellar,\n  sub-stellar, and exoplanetary model atmospheres","authors":"Uffe G. J{\\o}rgensen, Flavia Amadio, Beatriz Campos Estrada, Kristian\n  Holten M{\\o}ller,Aaron D. Schneider, Thorsten Balduin, Azzurra D'Alessandro,\n  Eftychia Symeonidou, Christiane Helling, {\\AA}ke Nordlund, Peter Woitke","authorsParsed":[["Jørgensen","Uffe G.",""],["Amadio","Flavia",""],["Estrada","Beatriz Campos",""],["Møller","Kristian Holten",""],["Schneider","Aaron D.",""],["Balduin","Thorsten",""],["D'Alessandro","Azzurra",""],["Symeonidou","Eftychia",""],["Helling","Christiane",""],["Nordlund","Åke",""],["Woitke","Peter",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 16:19:13 GMT"}],"updateDate":"2024-07-15","timestamp":1720801153000,"abstract":"  Computation of a grid of self consistent 1D model atmospheres of cool stars,\nsub-stellar objects and exoplanets in the effective temperature range 300K to\n3000K, including cloud formation, chemical non-equilibrium effects, and stellar\nirradiation.\n  The models are called MSG, because they are based on an iterative coupling\nbetween three well tested codes, the MARCS stellar atmosphere code, the\nStaticWeather cloud formation code and the GGchem chemical equilibrium code. It\nincludes up-to-date molecular and atomic opacities, cloud formation and\nadvanced chemical equilibrium calculations, and involves new numerical methods\nat low temperatures to allow robust convergence.\n  The coupling between the MARCS radiative transfer and GGchem chemical\nequilibrium computations has made it possibly effectively to reach convergence\nbased on electron pressure for the warmer models and gas pressure for the\ncooler models, enabling self-consistent modelling of stellar, sub-stellar and\nexoplanetary objects in a very wide range of effective temperatures. Here we\ndescribe the basic details of the models, with illustrative examples of cloudy\nand irradiated models as well as models based on non-equilibrium chemistry.\n  The qualitative changes in the relative abundances of TiO, H2O, CH4, NH3, and\nother molecules in our models follow the observationally defined M, L, T (and\nY) sequences, but reveal more complex and depth dependent abundance changes,\nand therefore a spectral classification depending on more parameters. The self\nconsistent coupling to Static-Weather cloud computations, allows detailed\ncomparison between nucleation and observed relative dimming of different\nspectral bands, with advanced applications for new identification methods of\npotential exoplanetary biology.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}