{"id":"2407.19774","title":"Garment Animation NeRF with Color Editing","authors":"Renke Wang, Meng Zhang, Jun Li, Jian Yan","authorsParsed":[["Wang","Renke",""],["Zhang","Meng",""],["Li","Jun",""],["Yan","Jian",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 08:17:05 GMT"}],"updateDate":"2024-07-30","timestamp":1722241025000,"abstract":"  Generating high-fidelity garment animations through traditional workflows,\nfrom modeling to rendering, is both tedious and expensive. These workflows\noften require repetitive steps in response to updates in character motion,\nrendering viewpoint changes, or appearance edits. Although recent neural\nrendering offers an efficient solution for computationally intensive processes,\nit struggles with rendering complex garment animations containing fine wrinkle\ndetails and realistic garment-and-body occlusions, while maintaining structural\nconsistency across frames and dense view rendering. In this paper, we propose a\nnovel approach to directly synthesize garment animations from body motion\nsequences without the need for an explicit garment proxy. Our approach infers\ngarment dynamic features from body motion, providing a preliminary overview of\ngarment structure. Simultaneously, we capture detailed features from\nsynthesized reference images of the garment's front and back, generated by a\npre-trained image model. These features are then used to construct a neural\nradiance field that renders the garment animation video. Additionally, our\ntechnique enables garment recoloring by decomposing its visual elements. We\ndemonstrate the generalizability of our method across unseen body motions and\ncamera views, ensuring detailed structural consistency. Furthermore, we\nshowcase its applicability to color editing on both real and synthetic garment\ndata. Compared to existing neural rendering techniques, our method exhibits\nqualitative and quantitative improvements in garment dynamics and wrinkle\ndetail modeling. Code is available at\n\\url{https://github.com/wrk226/GarmentAnimationNeRF}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}