{"id":"2407.13855","title":"Accurate Column Moist Static Energy Budget in Climate Models. Part 1:\n  Conservation Equation Formulation, Methodology, and Primary Results\n  Demonstrated Using GISS ModelE3","authors":"Kuniaki Inoue, Maxwell Kelley, Ann M. Fridlind, Michela Biasutti,\n  Gregory S. Elsaesser","authorsParsed":[["Inoue","Kuniaki",""],["Kelley","Maxwell",""],["Fridlind","Ann M.",""],["Biasutti","Michela",""],["Elsaesser","Gregory S.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 18:51:03 GMT"}],"updateDate":"2024-07-22","timestamp":1721328663000,"abstract":"  This paper addresses the challenges in computing the column moist static\nenergy (MSE) budget in climate models. Residuals from such computations often\nmatch other major budget terms in magnitude, obscuring their contributions.\nThis study introduces a methodology for accurately computing the column MSE\nbudget in climate models, demonstrated using the GISS ModelE3. Multiple factors\nleading to significant residuals are identified, with the failure of the\ncontinuous calculus's chain rule upon discretization being the most critical.\nThis failure causes the potential temperature equation to diverge from the\nenthalpy equation in discretized models. Consequently, in models using\npotential temperature as a prognostic variable, the MSE budget equation is\nfundamentally not upheld, requiring a tailored strategy to close the budget.\nThis study introduces the ``process increment method'' for accurately computing\nthe column MSE flux divergence. This method calculates the difference in the\nsum of column internal energy, geopotential, and latent heats before and after\napplying the dynamics scheme. Furthermore, the calculated column flux\ndivergence is decomposed into its advective components. These computations\nenable precise MSE budget analysis. The most crucial finding is that vertical\ninterpolation into pressure coordinates can introduce errors substantial enough\nto reverse the sign of vertical MSE advection in the warm pool regions. In\nModelE3, accurately computed values show MSE import via vertical circulations,\nwhile values in pressure coordinates indicate export. This discrepancy may\nprompt a reevaluation of vertical advection as an exporting mechanism and\nunderscores the importance of precise MSE budget calculations.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HwJqEXbqllxgUD3FF9ONG9mzkr8eCSXHAL9av98Rqb4","pdfSize":"8745012","objectId":"0x9cabf395ba0bc89ae6828419f23c570537668bd712e4cb97280eb1e08f9d0903","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
