{"id":"2407.19648","title":"Changes in seismicity in a volcanically active region, on the eastern\n  side of Izu Peninsula, Japan","authors":"K. Z. Nanjo, Y. Yukutake, T. Kumazawa","authorsParsed":[["Nanjo","K. Z.",""],["Yukutake","Y.",""],["Kumazawa","T.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 02:10:05 GMT"}],"updateDate":"2024-07-30","timestamp":1722219005000,"abstract":"  The Izu-Tobu region, on the eastern side of Izu Peninsula, in Japan, is\nvolcanically and seismically active. In this region, earthquake swarms of\nordinary earthquakes frequently occur at shallow depths, which is considered to\nbe associated with magma intrusion. Beneath ordinary earthquakes, low-frequency\nearthquakes (LFEs) are infrequently observed. We conducted a timeseries\nanalysis of both types of earthquakes during the time period 2005-2020, using a\nvariant of the Epidemic-Type Aftershock Sequence model. For this analysis, we\nused the Japan Meteorological Agency catalog of ordinary earthquakes and the\ncatalog of LFEs produced using the matched filter method. The observed result,\nwhich was common to both types of earthquakes, showed a significant change in\nseismicity, which became quiet, with the inflection point falling sometime\nbetween late 2009 and mid-2013, during which two out of three pronounced\nearthquake swarms occurred. We associated this seismic quiescence with changes\nin background rate to be low, where background rate, by removing the triggering\neffect of aftershocks, was interpreted as having been caused directly by the\nmagma source, which can vary with time. We used surface displacement data\nobtained from the Geospatial Information Authority of Japan, and observed that\nthe uplift due to magma intrusion was significant during the 1970s-1990s\nwhereas it was in abatement or unobservable during the studied period\n(2005-2020). We also found that the seismic quiescence occurred without\nsignificant crustal movement during the studied period. Our implication from\nthis finding is that magma source, which caused magma intrusion into the\nIzu-Tobu region, is in a transition phase, becoming less active, compared with\nthe magma source during the 1970s-1990s.\n","subjects":["Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0hnq85gzATyYJ6LbSiIt6lykRp594Aod72jYmaN5hEA","pdfSize":"4238661","objectId":"0xcb98b145155508268a1c395095feeac4044d206ca2522f89f67fa5419b869fcd","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
