{"id":"2407.01495","title":"Multifidelity Cross-validation","authors":"S. Ashwin Renganathan and Kade Carlson","authorsParsed":[["Renganathan","S. Ashwin",""],["Carlson","Kade",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 17:42:11 GMT"}],"updateDate":"2024-07-02","timestamp":1719855731000,"abstract":"  Emulating the mapping between quantities of interest and their control\nparameters using surrogate models finds widespread application in engineering\ndesign, including in numerical optimization and uncertainty quantification.\nGaussian process models can serve as a probabilistic surrogate model of unknown\nfunctions, thereby making them highly suitable for engineering design and\ndecision-making in the presence of uncertainty. In this work, we are interested\nin emulating quantities of interest observed from models of a system at\nmultiple fidelities, which trade accuracy for computational efficiency. Using\nmultifidelity Gaussian process models, to efficiently fuse models at multiple\nfidelities, we propose a novel method to actively learn the surrogate model via\nleave-one-out cross-validation (LOO-CV). Our proposed multifidelity\ncross-validation (\\texttt{MFCV}) approach develops an adaptive approach to\nreduce the LOO-CV error at the target (highest) fidelity, by learning the\ncorrelations between the LOO-CV at all fidelities. \\texttt{MFCV} develops a\ntwo-step lookahead policy to select optimal input-fidelity pairs, both in\nsequence and in batches, both for continuous and discrete fidelity spaces. We\ndemonstrate the utility of our method on several synthetic test problems as\nwell as on the thermal stress analysis of a gas turbine blade.\n","subjects":["Statistics/Computation","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"th44xcMaqeAMDe93rwQFfOMQ-bOX6vxQlthQ0yftj5o","pdfSize":"4908460","objectId":"0x3ecbd77ab7526da4ff863135a9b344f9e13dce1cd2fd28b5ce19d814851f9db1","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
