{"id":"2407.00931","title":"Real-Time Neuromorphic Navigation: Integrating Event-Based Vision and\n  Physics-Driven Planning on a Parrot Bebop2 Quadrotor","authors":"Amogh Joshi, Sourav Sanyal, Kaushik Roy","authorsParsed":[["Joshi","Amogh",""],["Sanyal","Sourav",""],["Roy","Kaushik",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 03:23:41 GMT"}],"updateDate":"2024-07-02","timestamp":1719804221000,"abstract":"  In autonomous aerial navigation, real-time and energy-efficient obstacle\navoidance remains a significant challenge, especially in dynamic and complex\nindoor environments. This work presents a novel integration of neuromorphic\nevent cameras with physics-driven planning algorithms implemented on a Parrot\nBebop2 quadrotor. Neuromorphic event cameras, characterized by their high\ndynamic range and low latency, offer significant advantages over traditional\nframe-based systems, particularly in poor lighting conditions or during\nhigh-speed maneuvers. We use a DVS camera with a shallow Spiking Neural Network\n(SNN) for event-based object detection of a moving ring in real-time in an\nindoor lab. Further, we enhance drone control with physics-guided empirical\nknowledge inside a neural network training mechanism, to predict\nenergy-efficient flight paths to fly through the moving ring. This integration\nresults in a real-time, low-latency navigation system capable of dynamically\nresponding to environmental changes while minimizing energy consumption. We\ndetail our hardware setup, control loop, and modifications necessary for\nreal-world applications, including the challenges of sensor integration without\nburdening the flight capabilities. Experimental results demonstrate the\neffectiveness of our approach in achieving robust, collision-free, and\nenergy-efficient flight paths, showcasing the potential of neuromorphic vision\nand physics-driven planning in enhancing autonomous navigation systems.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"iQiUhgjtI1lIKCuPpC8XHLpNDad6vza9a_JtiQKzkTA","pdfSize":"1656445"}
