{"id":"2407.03776","title":"Energy-Efficient Probabilistic Semantic Communication over\n  Space-Air-Ground Integrated Networks","authors":"Zhouxiang Zhao, Zhaohui Yang, Mingzhe Chen, Zhaoyang Zhang, Wei Xu,\n  Kaibin Huang","authorsParsed":[["Zhao","Zhouxiang",""],["Yang","Zhaohui",""],["Chen","Mingzhe",""],["Zhang","Zhaoyang",""],["Xu","Wei",""],["Huang","Kaibin",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 09:35:47 GMT"}],"updateDate":"2024-07-08","timestamp":1720085747000,"abstract":"  Space-air-ground integrated networks (SAGINs) are emerging as a pivotal\nelement in the evolution of future wireless networks. Despite their potential,\nthe joint design of communication and computation within SAGINs remains a\nformidable challenge. In this paper, the problem of energy efficiency in\nSAGIN-enabled probabilistic semantic communication (PSC) system is\ninvestigated. In the considered model, a satellite needs to transmit data to\nmultiple ground terminals (GTs) via an unmanned aerial vehicle (UAV) acting as\na relay. During transmission, the satellite and the UAV can use PSC technique\nto compress the transmitting data, while the GTs can automatically recover the\nmissing information. The PSC is underpinned by shared probability graphs that\nserve as a common knowledge base among the transceivers, allowing for\nresource-saving communication at the expense of increased computation resource.\nThrough analysis, the computation overhead function in PSC is a piecewise\nfunction with respect to the semantic compression ratio. Therefore, it is\nimportant to make a balance between communication and computation to achieve\noptimal energy efficiency. The joint communication and computation problem is\nformulated as an optimization problem aiming to minimize the total\ncommunication and computation energy consumption of the network under latency,\npower, computation capacity, bandwidth, semantic compression ratio, and UAV\nlocation constraints. To solve this non-convex non-smooth problem, we propose\nan iterative algorithm where the closed-form solutions for computation capacity\nallocation and UAV altitude are obtained at each iteration. Numerical results\nshow the effectiveness of the proposed algorithm.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}