{"id":"2407.20936","title":"Non-classical excitation of a solid-state quantum emitter","authors":"Lena M. Hansen, Francesco Giorgino, Lennart Jehle, Lorenzo Carosini,\n  Juan Camilo L\\'opez Carre\\~no, I\\~nigo Arrazola, Philip Walther, and Juan C.\n  Loredo","authorsParsed":[["Hansen","Lena M.",""],["Giorgino","Francesco",""],["Jehle","Lennart",""],["Carosini","Lorenzo",""],["Carreño","Juan Camilo López",""],["Arrazola","Iñigo",""],["Walther","Philip",""],["Loredo","Juan C.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 16:16:58 GMT"}],"updateDate":"2024-07-31","timestamp":1722356218000,"abstract":"  The interaction between a single emitter and a single photon is a fundamental\naspect of quantum optics. This interaction allows for the study of various\nquantum processes, such as emitter-mediated single-photon scattering and\neffective photon-photon interactions. However, empirical observations of this\nscenario and its dynamics are rare, and in most cases, only partial\napproximations to the fully quantized case have been possible. Here, we\ndemonstrate the resonant excitation of a solid-state quantum emitter using\nquantized input light. For this light-matter interaction, with both entities\nquantized, we observe single-photon interference introduced by the emitter in a\ncoherent scattering process, photon-number-depended optical non-linearities,\nand stimulated emission processes involving only two photons. We theoretically\nreproduce our observations using a cascaded master equation model. Our findings\ndemonstrate that a single photon is sufficient to change the state of a\nsolid-state quantum emitter, and efficient emitter-mediated photon-photon\ninteractions are feasible. These results suggest future possibilities ranging\nfrom enabling quantum information transfer in a quantum network to building\ndeterministic entangling gates for photonic quantum computing.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}