{"id":"2407.03638","title":"Weighted basic parallel processes and combinatorial enumeration","authors":"Lorenzo Clemente","authorsParsed":[["Clemente","Lorenzo",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 05:18:43 GMT"}],"updateDate":"2024-07-08","timestamp":1720070323000,"abstract":"  We study weighted basic parallel processes (WBPP), a nonlinear recursive\ngeneralisation of weighted finite automata inspired from process algebra and\nPetri net theory. Our main result is an algorithm of 2-EXPSPACE complexity for\nthe WBPP equivalence problem. While (unweighted) BPP language equivalence is\nundecidable, we can use this algorithm to decide multiplicity equivalence of\nBPP and language equivalence of unambiguous BPP, with the same complexity.\nThese are long-standing open problems for the related model of weighted\ncontext-free grammars. Our second contribution is a connection between WBPP,\npower series solutions of systems of polynomial differential equations, and\ncombinatorial enumeration. To this end we consider constructible differentially\nfinite power series (CDF), a class of multivariate differentially algebraic\nseries introduced by Bergeron and Reutenauer in order to provide a\ncombinatorial interpretation to differential equations. CDF series generalise\nrational, algebraic, and a large class of D-finite (holonomic) series, for\nwhich decidability of equivalence was an open problem. We show that CDF series\ncorrespond to commutative WBPP series. As a consequence of our result on WBPP\nand commutativity, we show that equivalence of CDF power series can be decided\nwith 2-EXPTIME complexity. The complexity analysis is based on effective bounds\nfrom algebraic geometry, namely on the length of chains of polynomial ideals\nconstructed by repeated application of finitely many, not necessarily commuting\nderivations of a multivariate polynomial ring. This is obtained by generalising\na result of Novikov and Yakovenko in the case of a single derivation, which is\nnoteworthy since generic bounds on ideal chains are non-primitive recursive in\ngeneral. On the way, we develop the theory of \\WBPP~series and \\CDF~power\nseries, exposing several of their appealing properties.\n","subjects":["Computing Research Repository/Formal Languages and Automata Theory","Computing Research Repository/Computational Complexity","Computing Research Repository/Discrete Mathematics","Computing Research Repository/Logic in Computer Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}