{"id":"2407.15258","title":"Optimizing ionic conductivity of lithium in Li$_7$PS$_6$ argyrodite via\n  dopant engineering","authors":"Sokseiha Muy, Thierry Le Mercier, Marion Dufour, Marc-David Braida,\n  Antoine A. Emery and Nicola Marzari","authorsParsed":[["Muy","Sokseiha",""],["Mercier","Thierry Le",""],["Dufour","Marion",""],["Braida","Marc-David",""],["Emery","Antoine A.",""],["Marzari","Nicola",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 20:12:14 GMT"}],"updateDate":"2024-07-23","timestamp":1721592734000,"abstract":"  Li-containing argyrodites represent a promising family of Li-ion conductors\nwith several derived compounds exhibiting room-temperature ionic conductivity >\n1 mS/cm and making them attractive as potential candidates as electrolytes in\nsolid-state Li-ion batteries. Starting from the parent phase Li7PS6, several\ncation and anion substitution strategies have been attempted to increase the\nconductivity of Li ions. Nonetheless, a detailed understanding of the\nthermodynamics of native defects and doping of Li argyrodite and their effect\non the ionic conductivity of Li is missing. Here, we report a comprehensive\ncomputational study of defect chemistry of the parent phase Li7PS6 in both\nintrinsic and extrinsic regimes, using a newly developed workflow to automate\nthe computations of several defect formation energies in a thermodynamically\nconsistent framework. Our findings agree with known experimental findings, rule\nout several unfavorable aliovalent dopants, narrowing down the potential\npromising candidates that can be tested experimentally. We also find that\ncation-anion co-doping can provide a powerful strategy to further optimize the\ncomposition of argyrodite. In particular, Si-F co-doping is predicted to be\nthermodynamically favorable; this could lead to the synthesis of the first\nF-doped Li-containing argyrodite. Finally, using DeePMD neural networks, we\nhave mapped the ionic conductivity landscape as function of the concentration\nof the most promising cation and anion dopants identified from the defect\ncalculations, and identified the most promising region in the compositional\nspace with high Li conductivity that can be explored experimentally.\n","subjects":["Condensed Matter/Materials Science","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}