{"id":"2407.00164","title":"Conceptual and formal groundwork for the study of resource dependence\n  relations","authors":"Y\\`il\\`e Y\\=ing, Tom\\'a\\v{s} Gonda, Robert Spekkens","authorsParsed":[["Yīng","Yìlè",""],["Gonda","Tomáš",""],["Spekkens","Robert",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 18:04:31 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 22:56:35 GMT"}],"updateDate":"2024-07-16","timestamp":1719597871000,"abstract":"  A resource theory imposes a preorder over states, with one state being above\nanother if the first can be converted to the second by a free operation, and\nwhere the set of free operations defines the notion of resourcefulness under\nstudy. In general, the location of a state in the preorder of one resource\ntheory can constrain its location in the preorder of a different resource\ntheory. It follows that there can be nontrivial dependence relations between\ndifferent notions of resourcefulness. In this article, we lay out the\nconceptual and formal groundwork for the study of resource dependence\nrelations. In particular, we note that the relations holding among a set of\nmonotones that includes a complete set for each resource theory provides a full\ncharacterization of resource dependence relations. As an example, we consider\nthree resource theories concerning the about-face asymmetry properties of a\nqubit along three mutually orthogonal axes on the Bloch ball, where about-face\nsymmetry refers to a representation of $\\mathbb{Z}_2$, consisting of the\nidentity map and a $\\pi$ rotation about the given axis. This example is\nsufficiently simple that we are able to derive a complete set of monotones for\neach resource theory and to determine all of the relations that hold among\nthese monotones, thereby completely solving the problem of determining resource\ndependence relations. Nonetheless, we show that even in this simplest of\nexamples, these relations are already quite nuanced.\n","subjects":["Physics/Quantum Physics","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"5VP6CXjk0LKAijIWTicVJVSh1rPN6gagjFQNzijv4Pw","pdfSize":"4214192"}
