{"id":"2407.03987","title":"Fair Repetitive Interval Scheduling","authors":"Klaus Heeger, Danny Hermelin, Yuval Itzhaki, Hendrik Molter, Dvir\n  Shabtay","authorsParsed":[["Heeger","Klaus",""],["Hermelin","Danny",""],["Itzhaki","Yuval",""],["Molter","Hendrik",""],["Shabtay","Dvir",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 15:02:50 GMT"}],"updateDate":"2024-07-08","timestamp":1720105370000,"abstract":"  Fair resource allocation is undoubtedly a crucial factor in customer\nsatisfaction in several scheduling scenarios. This is especially apparent in\nrepetitive scheduling models where the same set of clients repeatedly submits\njobs on a daily basis. In this paper, we aim to analyze a repetitive scheduling\nsystem involving a set of $n$ clients and a set of $m$ days. On every day, each\nclient submits a request to process a job exactly within a specific time\ninterval, which may vary from day to day, modeling the scenario where the\nscheduling is done Just-In-Time (JIT). The daily schedule is executed on a\nsingle machine that can process a single job at a time, therefore it is not\npossible to schedule jobs with intersecting time intervals. Accordingly, a\nfeasible solution corresponds to sets of jobs with disjoint time intervals, one\nset per day. We define the quality of service (QoS) that a client receives as\nthe number of executed jobs over the $m$ days period. Our objective is to\nprovide a feasible solution where each client has at least $k$ days where his\njobs are processed. We prove that this problem is NP-hard even under various\nnatural restrictions such as identical processing times and day-independent due\ndates. We also provide efficient algorithms for several special cases and\nanalyze the parameterized tractability of the problem with respect to several\nparameters, providing both parameterized hardness and tractability results.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Computer Science and Game Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}