{"id":"2407.01416","title":"A Josephson-Anderson relation for drag in classical channel flows with\n  streamwise periodicity: Effects of wall roughness","authors":"Samvit Kumar and Gregory Eyink","authorsParsed":[["Kumar","Samvit",""],["Eyink","Gregory",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 16:07:19 GMT"}],"updateDate":"2024-07-02","timestamp":1719850039000,"abstract":"  The detailed Josephson-Anderson relation equates instantaneous work by\npressure drop over any streamwise segment of a general channel and wall-normal\nflux of spanwise vorticity spatially integrated over that section. This\nrelation was first derived by Huggins for quantum superfluids, but it holds\nalso for internal flows of classical fluids and for external flows around solid\nbodies, corresponding there to relations of Burgers, Lighthill, Kambe, Howe and\nothers. All of these prior results employ a background potential Euler flow\nwith the same inflow/outflow as the physical flow, just as in Kelvin's minimum\nenergy theorem, so that the reference potential incorporates information about\nflow geometry. We here generalize the detailed Josephson-Anderson relation to\nstreamwise periodic channels appropriate for numerical simulation of classical\nfluid turbulence. We show that the original Neumann b.c. used by Huggins for\nthe background potential create an unphysical vortex sheet in a periodic\nchannel, so that we substitute instead Dirichlet b.c. We show that the minimum\nenergy theorem still holds and our new Josephson-Anderson relation again\nequates work by pressure drop instantaneously to integrated flux of spanwise\nvorticity. The result holds for both Newtonian and non-Newtonian fluids and for\ngeneral curvilinear walls. We illustrate our new formula with numerical results\nin a periodic channel flow with a single smooth bump, which reveals how vortex\nseparation from the roughness element creates drag at each time instant. Drag\nand dissipation are thus related to vorticity structure and dynamics locally in\nspace and time, with important applications to drag-reduction and to\nexplanation of anomalous dissipation at high Reynolds numbers.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}