{"id":"2407.03125","title":"Foundations and Frontiers of Graph Learning Theory","authors":"Yu Huang, Min Zhou, Menglin Yang, Zhen Wang, Muhan Zhang, Jie Wang,\n  Hong Xie, Hao Wang, Defu Lian, and Enhong Chen","authorsParsed":[["Huang","Yu",""],["Zhou","Min",""],["Yang","Menglin",""],["Wang","Zhen",""],["Zhang","Muhan",""],["Wang","Jie",""],["Xie","Hong",""],["Wang","Hao",""],["Lian","Defu",""],["Chen","Enhong",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 14:07:41 GMT"},{"version":"v2","created":"Mon, 8 Jul 2024 01:22:37 GMT"}],"updateDate":"2024-07-09","timestamp":1720015661000,"abstract":"  Recent advancements in graph learning have revolutionized the way to\nunderstand and analyze data with complex structures. Notably, Graph Neural\nNetworks (GNNs), i.e. neural network architectures designed for learning graph\nrepresentations, have become a popular paradigm. With these models being\nusually characterized by intuition-driven design or highly intricate\ncomponents, placing them within the theoretical analysis framework to distill\nthe core concepts, helps understand the key principles that drive the\nfunctionality better and guide further development. Given this surge in\ninterest, this article provides a comprehensive summary of the theoretical\nfoundations and breakthroughs concerning the approximation and learning\nbehaviors intrinsic to prevalent graph learning models. Encompassing\ndiscussions on fundamental aspects such as expressiveness power,\ngeneralization, optimization, and unique phenomena such as over-smoothing and\nover-squashing, this piece delves into the theoretical foundations and frontier\ndriving the evolution of graph learning. In addition, this article also\npresents several challenges and further initiates discussions on possible\nsolutions.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"GdJ8fZU3YdI99GEBiYm7NtNkIdVFMPrQrT9XDRRhTGI","pdfSize":"966218"}
