{"id":"2407.07403","title":"A Survey of Attacks on Large Vision-Language Models: Resources,\n  Advances, and Future Trends","authors":"Daizong Liu, Mingyu Yang, Xiaoye Qu, Pan Zhou, Yu Cheng, Wei Hu","authorsParsed":[["Liu","Daizong",""],["Yang","Mingyu",""],["Qu","Xiaoye",""],["Zhou","Pan",""],["Cheng","Yu",""],["Hu","Wei",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 06:57:58 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 03:58:05 GMT"}],"updateDate":"2024-07-15","timestamp":1720594678000,"abstract":"  With the significant development of large models in recent years, Large\nVision-Language Models (LVLMs) have demonstrated remarkable capabilities across\na wide range of multimodal understanding and reasoning tasks. Compared to\ntraditional Large Language Models (LLMs), LVLMs present great potential and\nchallenges due to its closer proximity to the multi-resource real-world\napplications and the complexity of multi-modal processing. However, the\nvulnerability of LVLMs is relatively underexplored, posing potential security\nrisks in daily usage. In this paper, we provide a comprehensive review of the\nvarious forms of existing LVLM attacks. Specifically, we first introduce the\nbackground of attacks targeting LVLMs, including the attack preliminary, attack\nchallenges, and attack resources. Then, we systematically review the\ndevelopment of LVLM attack methods, such as adversarial attacks that manipulate\nmodel outputs, jailbreak attacks that exploit model vulnerabilities for\nunauthorized actions, prompt injection attacks that engineer the prompt type\nand pattern, and data poisoning that affects model training. Finally, we\ndiscuss promising research directions in the future. We believe that our survey\nprovides insights into the current landscape of LVLM vulnerabilities, inspiring\nmore researchers to explore and mitigate potential safety issues in LVLM\ndevelopments. The latest papers on LVLM attacks are continuously collected in\nhttps://github.com/liudaizong/Awesome-LVLM-Attack.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}