{"id":"2407.02553","title":"Large-scale quantum reservoir learning with an analog quantum computer","authors":"Milan Kornja\\v{c}a, Hong-Ye Hu, Chen Zhao, Jonathan Wurtz, Phillip\n  Weinberg, Majd Hamdan, Andrii Zhdanov, Sergio H. Cantu, Hengyun Zhou, Rodrigo\n  Araiza Bravo, Kevin Bagnall, James I. Basham, Joseph Campo, Adam Choukri,\n  Robert DeAngelo, Paige Frederick, David Haines, Julian Hammett, Ning Hsu,\n  Ming-Guang Hu, Florian Huber, Paul Niklas Jepsen, Ningyuan Jia, Thomas\n  Karolyshyn, Minho Kwon, John Long, Jonathan Lopatin, Alexander Lukin, Tommaso\n  Macr\\`i, Ognjen Markovi\\'c, Luis A. Mart\\'inez-Mart\\'inez, Xianmei Meng,\n  Evgeny Ostroumov, David Paquette, John Robinson, Pedro Sales Rodriguez,\n  Anshuman Singh, Nandan Sinha, Henry Thoreen, Noel Wan, Daniel Waxman-Lenz,\n  Tak Wong, Kai-Hsin Wu, Pedro L. S. Lopes, Yuval Boger, Nathan Gemelke, Takuya\n  Kitagawa, Alexander Keesling, Xun Gao, Alexei Bylinskii, Susanne F. Yelin,\n  Fangli Liu, Sheng-Tao Wang","authorsParsed":[["Kornjača","Milan",""],["Hu","Hong-Ye",""],["Zhao","Chen",""],["Wurtz","Jonathan",""],["Weinberg","Phillip",""],["Hamdan","Majd",""],["Zhdanov","Andrii",""],["Cantu","Sergio H.",""],["Zhou","Hengyun",""],["Bravo","Rodrigo Araiza",""],["Bagnall","Kevin",""],["Basham","James I.",""],["Campo","Joseph",""],["Choukri","Adam",""],["DeAngelo","Robert",""],["Frederick","Paige",""],["Haines","David",""],["Hammett","Julian",""],["Hsu","Ning",""],["Hu","Ming-Guang",""],["Huber","Florian",""],["Jepsen","Paul Niklas",""],["Jia","Ningyuan",""],["Karolyshyn","Thomas",""],["Kwon","Minho",""],["Long","John",""],["Lopatin","Jonathan",""],["Lukin","Alexander",""],["Macrì","Tommaso",""],["Marković","Ognjen",""],["Martínez-Martínez","Luis A.",""],["Meng","Xianmei",""],["Ostroumov","Evgeny",""],["Paquette","David",""],["Robinson","John",""],["Rodriguez","Pedro Sales",""],["Singh","Anshuman",""],["Sinha","Nandan",""],["Thoreen","Henry",""],["Wan","Noel",""],["Waxman-Lenz","Daniel",""],["Wong","Tak",""],["Wu","Kai-Hsin",""],["Lopes","Pedro L. S.",""],["Boger","Yuval",""],["Gemelke","Nathan",""],["Kitagawa","Takuya",""],["Keesling","Alexander",""],["Gao","Xun",""],["Bylinskii","Alexei",""],["Yelin","Susanne F.",""],["Liu","Fangli",""],["Wang","Sheng-Tao",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-04","timestamp":1719943200000,"abstract":"  Quantum machine learning has gained considerable attention as quantum\ntechnology advances, presenting a promising approach for efficiently learning\ncomplex data patterns. Despite this promise, most contemporary quantum methods\nrequire significant resources for variational parameter optimization and face\nissues with vanishing gradients, leading to experiments that are either limited\nin scale or lack potential for quantum advantage. To address this, we develop a\ngeneral-purpose, gradient-free, and scalable quantum reservoir learning\nalgorithm that harnesses the quantum dynamics of neutral-atom analog quantum\ncomputers to process data. We experimentally implement the algorithm, achieving\ncompetitive performance across various categories of machine learning tasks,\nincluding binary and multi-class classification, as well as timeseries\nprediction. Effective and improving learning is observed with increasing system\nsizes of up to 108 qubits, demonstrating the largest quantum machine learning\nexperiment to date. We further observe comparative quantum kernel advantage in\nlearning tasks by constructing synthetic datasets based on the geometric\ndifferences between generated quantum and classical data kernels. Our findings\ndemonstrate the potential of utilizing classically intractable quantum\ncorrelations for effective machine learning. We expect these results to\nstimulate further extensions to different quantum hardware and machine learning\nparadigms, including early fault-tolerant hardware and generative machine\nlearning tasks.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Disordered Systems and Neural Networks","Physics/Atomic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}