{"id":"2407.11743","title":"OAM-TCD: A globally diverse dataset of high-resolution tree cover maps","authors":"Josh Veitch-Michaelis, Andrew Cottam, Daniella Schweizer, Eben N.\n  Broadbent, David Dao, Ce Zhang, Angelica Almeyda Zambrano and Simeon Max","authorsParsed":[["Veitch-Michaelis","Josh",""],["Cottam","Andrew",""],["Schweizer","Daniella",""],["Broadbent","Eben N.",""],["Dao","David",""],["Zhang","Ce",""],["Zambrano","Angelica Almeyda",""],["Max","Simeon",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:11:29 GMT"}],"updateDate":"2024-07-17","timestamp":1721139089000,"abstract":"  Accurately quantifying tree cover is an important metric for ecosystem\nmonitoring and for assessing progress in restored sites. Recent works have\nshown that deep learning-based segmentation algorithms are capable of\naccurately mapping trees at country and continental scales using\nhigh-resolution aerial and satellite imagery. Mapping at high (ideally\nsub-meter) resolution is necessary to identify individual trees, however there\nare few open-access datasets containing instance level annotations and those\nthat exist are small or not geographically diverse. We present a novel\nopen-access dataset for individual tree crown delineation (TCD) in\nhigh-resolution aerial imagery sourced from OpenAerialMap (OAM). Our dataset,\nOAM-TCD, comprises 5072 2048x2048 px images at 10 cm/px resolution with\nassociated human-labeled instance masks for over 280k individual and 56k groups\nof trees. By sampling imagery from around the world, we are able to better\ncapture the diversity and morphology of trees in different terrestrial biomes\nand in both urban and natural environments. Using our dataset, we train\nreference instance and semantic segmentation models that compare favorably to\nexisting state-of-the-art models. We assess performance through k-fold\ncross-validation and comparison with existing datasets; additionally we\ndemonstrate compelling results on independent aerial imagery captured over\nSwitzerland and compare to municipal tree inventories and LIDAR-derived canopy\nmaps in the city of Zurich. Our dataset, models and training/benchmark code are\npublicly released under permissive open-source licenses: Creative Commons\n(majority CC BY 4.0), and Apache 2.0 respectively.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}