{"id":"2407.04784","title":"Cavity QED in a High NA Resonator","authors":"Danial Shadmany, Aishwarya Kumar, Anna Soper, Lukas Palm, Chuan Yin,\n  Henry Ando, Bowen Li, Lavanya Taneja, Matt Jaffe, David Schuster, and Jon\n  Simon","authorsParsed":[["Shadmany","Danial",""],["Kumar","Aishwarya",""],["Soper","Anna",""],["Palm","Lukas",""],["Yin","Chuan",""],["Ando","Henry",""],["Li","Bowen",""],["Taneja","Lavanya",""],["Jaffe","Matt",""],["Schuster","David",""],["Simon","Jon",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 18:00:24 GMT"}],"updateDate":"2024-07-09","timestamp":1720202424000,"abstract":"  From fundamental studies of light-matter interaction to applications in\nquantum networking and sensing, cavity quantum electrodynamics (QED) provides a\nplatform-crossing toolbox to control interactions between atoms and photons.\nThe coherence of such interactions is determined by the product of the\nsingle-pass atomic absorption and the number of photon round-trips. Reducing\nthe cavity loss has enabled resonators supporting nearly 1-million optical\nroundtrips at the expense of severely limited optical material choices and\nincreased alignment sensitivity. The single-pass absorption probability can be\nincreased through the use of near-concentric, fiber or nanophotonic cavities,\nwhich reduce the mode waists at the expense of constrained optical access and\nexposure to surface fields. Here we present a new high numerical-aperture,\nlens-based resonator that pushes the single-atom-single-photon absorption\nprobability per round trip close to its fundamental limit by reducing the mode\nsize at the atom below a micron while keeping the atom mm-to-cm away from all\noptics. This resonator provides strong light-matter coupling in a cavity where\nthe light circulates only ~ 10 times. We load a single 87Rb atom into such a\ncavity, observe strong coupling, demonstrate cavity-enhanced atom detection\nwith imaging fidelity of 99.55(6) percent and survival probability of 99.89(4)\npercent in 130 microseconds, and leverage this new platform for a time-resolved\nexploration of cavity cooling. The resonator's loss-resilience paves the way to\ncoupling of atoms to nonlinear and adaptive optical elements and provides a\nminimally invasive route to readout of defect centers. Introduction of\nintra-cavity imaging systems will enable the creation of cavity arrays\ncompatible with Rydberg atom array computing technologies, vastly expanding the\napplicability of the cavity QED toolbox.\n","subjects":["Physics/Atomic Physics","Condensed Matter/Quantum Gases","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}