{"id":"2407.19079","title":"UniForensics: Face Forgery Detection via General Facial Representation","authors":"Ziyuan Fang, Hanqing Zhao, Tianyi Wei, Wenbo Zhou, Ming Wan, Zhanyi\n  Wang, Weiming Zhang, Nenghai Yu","authorsParsed":[["Fang","Ziyuan",""],["Zhao","Hanqing",""],["Wei","Tianyi",""],["Zhou","Wenbo",""],["Wan","Ming",""],["Wang","Zhanyi",""],["Zhang","Weiming",""],["Yu","Nenghai",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 20:51:54 GMT"}],"updateDate":"2024-07-30","timestamp":1722027114000,"abstract":"  Previous deepfake detection methods mostly depend on low-level textural\nfeatures vulnerable to perturbations and fall short of detecting unseen forgery\nmethods. In contrast, high-level semantic features are less susceptible to\nperturbations and not limited to forgery-specific artifacts, thus having\nstronger generalization. Motivated by this, we propose a detection method that\nutilizes high-level semantic features of faces to identify inconsistencies in\ntemporal domain. We introduce UniForensics, a novel deepfake detection\nframework that leverages a transformer-based video classification network,\ninitialized with a meta-functional face encoder for enriched facial\nrepresentation. In this way, we can take advantage of both the powerful\nspatio-temporal model and the high-level semantic information of faces.\nFurthermore, to leverage easily accessible real face data and guide the model\nin focusing on spatio-temporal features, we design a Dynamic Video\nSelf-Blending (DVSB) method to efficiently generate training samples with\ndiverse spatio-temporal forgery traces using real facial videos. Based on this,\nwe advance our framework with a two-stage training approach: The first stage\nemploys a novel self-supervised contrastive learning, where we encourage the\nnetwork to focus on forgery traces by impelling videos generated by the same\nforgery process to have similar representations. On the basis of the\nrepresentation learned in the first stage, the second stage involves\nfine-tuning on face forgery detection dataset to build a deepfake detector.\nExtensive experiments validates that UniForensics outperforms existing face\nforgery methods in generalization ability and robustness. In particular, our\nmethod achieves 95.3\\% and 77.2\\% cross dataset AUC on the challenging\nCeleb-DFv2 and DFDC respectively.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}