{"id":"2407.19008","title":"GA-NIFS: Multi-phase outflows in a star-forming galaxy at $z \\sim 5.5$","authors":"Eleonora Parlanti, Stefano Carniani, Giacomo Venturi, Rodrigo\n  Herrera-Camus, Santiago Arribas, Andrew J. Bunker, Stephane Charlot,\n  Francesco D'Eugenio, Roberto Maiolino, Michele Perna, Hannah \\\"Ubler, Torsten\n  B\\\"oker, Giovanni Cresci, Mirko Curti, Gareth C. Jones, Isabella Lamperti,\n  Sandra Zamora","authorsParsed":[["Parlanti","Eleonora",""],["Carniani","Stefano",""],["Venturi","Giacomo",""],["Herrera-Camus","Rodrigo",""],["Arribas","Santiago",""],["Bunker","Andrew J.",""],["Charlot","Stephane",""],["D'Eugenio","Francesco",""],["Maiolino","Roberto",""],["Perna","Michele",""],["Übler","Hannah",""],["Böker","Torsten",""],["Cresci","Giovanni",""],["Curti","Mirko",""],["Jones","Gareth C.",""],["Lamperti","Isabella",""],["Zamora","Sandra",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:00:02 GMT"}],"updateDate":"2024-07-30","timestamp":1722016802000,"abstract":"  Galactic outflows driven by star formation or active galactic nuclei are\ntypically formed by multi-phase gas whose temperature spans over 4 orders of\nmagnitude. Probing the different outflow components requires multi-wavelength\nobservations and long exposure times, especially in the distant Universe. So\nfar, most of the high-z studies have focused on a single gas phase, but this\nkind of analysis may potentially miss a non-negligible fraction of the total\noutflowing gas content. In this work, we analyze the spatially resolved\nrest-frame UV and optical emission from HZ4, the highest redshift main sequence\nstar-forming galaxy having a detected [C II] outflow, which traces the neutral\ngas component. Our goal is to study the ionized interstellar medium in the\ngalaxy and the properties of the ionized outflow as traced by the [O\nIII]$\\lambda$5007\\r{A} and H$\\alpha$ emission lines. We exploit JWST/NIRSpec\nobservations in the integral field spectroscopy mode to investigate the galaxy\nproperties by making use of the brightest rest-frame optical emission lines.\nTheir high spectral and spatial resolution allows us to trace the ionized\noutflow from broad line wings and spatially resolve it. We also re-analyze the\n[C II] ALMA data to compare the neutral atomic and ionized outflow\nmorphologies, masses, and energetics. We find that the system consists of a\ngalaxy merger, instead of a rotating disk as originally inferred from\nlow-resolution [C II] observations, and hosts an extended ionized outflow. The\nionized outflow is being launched from a region hosting an intense burst of\nstar formation and extends over 4 kpc from the launch site. The neutral and\nionized outflows are almost co-spatial, but the mass loading factor in the\nionized gas phase is two orders of magnitude smaller than in the neutral phase,\nas found for other lower redshift multi-phase outflows.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}