{"id":"2407.13631","title":"Separating cationic and anionic redox activity in antiperovskite\n  Li$_2$Fe)SO","authors":"Lennart Singer and Bowen Dong and M.A.A. Mohamed and Frederik L.\n  Carstens and Silke Hampel and Nico Gr\\\"a{\\ss}ler and R\\\"udiger Klingeler","authorsParsed":[["Singer","Lennart",""],["Dong","Bowen",""],["Mohamed","M. A. A.",""],["Carstens","Frederik L.",""],["Hampel","Silke",""],["Gräßler","Nico",""],["Klingeler","Rüdiger",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:03:46 GMT"}],"updateDate":"2024-07-26","timestamp":1721318626000,"abstract":"  Lithium-rich antiperovskite promise to be a compelling high-capacity cathode\nmaterial due to existence of both cationic and anionic redox activity. Little\nis however known about the effect of separating the electrochemical cationic\nfrom the anionic process and the associated implications on the electrochemical\nperformance. In this context, we report the electrochemical properties of the\nillustrative example of three different Li$_2$Fe)SO materials with a focus on\nseparating cationic from anionic effects. With the high voltage anionic\nprocess, an astonishing electrochemical capacity of around 400~mAh/g can\ninitially be reached. Our results however identify the anionic process as the\ncause of poor cycling stability and demonstrate that fading reported in\nprevious literature is avoided by restricting to only the cationic processes.\nFollowing this path, our Li$_2$Fe)SO-BM500 shows strongly improved performance\nindicated by constant electrochemical cycling over 100 cycles at a capacity of\naround 175~mAh/g at 1~C. Our approach also allows us to investigate the\nelectrochemical performance of the bare antiperovskite phase excluding\nextrinsic activity from initial or cycling-induced impurity phases. Our results\nunderscore that synthesis conditions are a critical determinant of\nelectrochemical performance in lithium-rich antiperovskites, especially with\nregard to the amount of electrochemical secondary phases, while the particle\nsize has not been found a crucial parameter. Overall, separating and\nunderstanding the effects of cationic from anionic redox activity in\nlithium-rich antiperovskites provides the route to further improve their\nperformance in electrochemical energy storage.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}