{"id":"2407.06829","title":"Generation of a metrologically useful cat state through repetitive\n  measurements","authors":"Mamiko Tatsuta, Yuichiro Matsuzaki, Hiroki Kuji, and Akira Shimizu","authorsParsed":[["Tatsuta","Mamiko",""],["Matsuzaki","Yuichiro",""],["Kuji","Hiroki",""],["Shimizu","Akira",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 13:01:32 GMT"}],"updateDate":"2024-07-10","timestamp":1720530092000,"abstract":"  Recent advancements in entanglement-based quantum metrology have been\nsignificant. A fundamental connection between generalized cat states and\nsensitivity in quantum metrology has recently been established. Generalized cat\nstates are characterized by an index indicating coherence among macroscopically\ndistinct states. This criterion enables the identification of diverse states as\ngeneralized cat states, encompassing classical mixtures of exponentially large\nnumbers of states. However, preparing large generalized cat states remains\nchallenging with current technology. Here we propose a protocol to generate\nmetrologically useful cat states through repetitive measurements on a quantum\nspin system of N spins, which we call a spin ensemble. The states used as\nsensors to beat the classical limit are called the metrologically useful cat\nstates, which are well characterized by the index to indicate the coherence\nbetween macroscopically distinct states. When the spin ensemble is collectively\ncoupled with an ancillary qubit, it allows for the read out of its total\nmagnetization. Starting from a thermal equilibrium state of the spin ensemble,\nwe demonstrate that we can increase the coherence between the spin ensemble via\nrepetitive measurements of the total magnetization using the ancillary qubit.\nNotably, our method for creating the metrologically useful cat states requires\nno control over the spin ensemble. As a potential experimental realization, we\ndiscuss a hybrid system composed of a superconducting flux qubit and donor\nspins in silicon. Our results pave the way for the realization of the\nentanglement-enhanced quantum metrology.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}