{"id":"2407.19118","title":"Large Language Models as Co-Pilots for Causal Inference in Medical\n  Studies","authors":"Ahmed Alaa, Rachael V. Phillips, Emre K{\\i}c{\\i}man, Laura B. Balzer,\n  Mark van der Laan, Maya Petersen","authorsParsed":[["Alaa","Ahmed",""],["Phillips","Rachael V.",""],["Kıcıman","Emre",""],["Balzer","Laura B.",""],["van der Laan","Mark",""],["Petersen","Maya",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 22:43:15 GMT"}],"updateDate":"2024-07-30","timestamp":1722033795000,"abstract":"  The validity of medical studies based on real-world clinical data, such as\nobservational studies, depends on critical assumptions necessary for drawing\ncausal conclusions about medical interventions. Many published studies are\nflawed because they violate these assumptions and entail biases such as\nresidual confounding, selection bias, and misalignment between treatment and\nmeasurement times. Although researchers are aware of these pitfalls, they\ncontinue to occur because anticipating and addressing them in the context of a\nspecific study can be challenging without a large, often unwieldy,\ninterdisciplinary team with extensive expertise. To address this expertise gap,\nwe explore the use of large language models (LLMs) as co-pilot tools to assist\nresearchers in identifying study design flaws that undermine the validity of\ncausal inferences. We propose a conceptual framework for LLMs as causal\nco-pilots that encode domain knowledge across various fields, engaging with\nresearchers in natural language interactions to provide contextualized\nassistance in study design. We provide illustrative examples of how LLMs can\nfunction as causal co-pilots, propose a structured framework for their\ngrounding in existing causal inference frameworks, and highlight the unique\nchallenges and opportunities in adapting LLMs for reliable use in\nepidemiological research.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hlu8I2tT24Shrj3VfNApcgLMgQvcm5xh9EFaoJ5gs2k","pdfSize":"2659293","objectId":"0x7c2baf1d847324a9999a53a97d7c2d0fc198fc5e0b20d1121ecba43a5feed659","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
