{"id":"2407.17944","title":"Time-Optimal Planning for Long-Range Quadrotor Flights: An Automatic\n  Optimal Synthesis Approach","authors":"Chao Qin, Jingxiang Chen, Yifan Lin, Abhishek Goudar, Angela P.\n  Schoellig and Hugh H.-T. Liu","authorsParsed":[["Qin","Chao",""],["Chen","Jingxiang",""],["Lin","Yifan",""],["Goudar","Abhishek",""],["Schoellig","Angela P.",""],["Liu","Hugh H. -T.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 11:04:53 GMT"}],"updateDate":"2024-07-26","timestamp":1721905493000,"abstract":"  Time-critical tasks such as drone racing typically cover large operation\nareas. However, it is difficult and computationally intensive for current\ntime-optimal motion planners to accommodate long flight distances since a large\nyet unknown number of knot points is required to represent the trajectory. We\npresent a polynomial-based automatic optimal synthesis (AOS) approach that can\naddress this challenge. Our method not only achieves superior time optimality\nbut also maintains a consistently low computational cost across different\nranges while considering the full quadrotor dynamics. First, we analyze the\nproperties of time-optimal quadrotor maneuvers to determine the minimal number\nof polynomial pieces required to capture the dominant structure of time-optimal\ntrajectories. This enables us to represent substantially long minimum-time\ntrajectories with a minimal set of variables. Then, a robust optimization\nscheme is developed to handle arbitrary start and end conditions as well as\nintermediate waypoints. Extensive comparisons show that our approach is faster\nthan the state-of-the-art approach by orders of magnitude with comparable time\noptimality. Real-world experiments further validate the quality of the\nresulting trajectories, demonstrating aggressive time-optimal maneuvers with a\npeak velocity of 8.86 m/s.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}