{"id":"2407.21154","title":"Bayesian thresholded modeling for integrating brain node and network\n  predictors","authors":"Zhe Sun, Wanwan Xu, Tianxi Li, Jian Kang, Gregorio Alanis-Lobato, and\n  Yize Zhao","authorsParsed":[["Sun","Zhe",""],["Xu","Wanwan",""],["Li","Tianxi",""],["Kang","Jian",""],["Alanis-Lobato","Gregorio",""],["Zhao","Yize",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 19:35:18 GMT"}],"updateDate":"2024-08-01","timestamp":1722368118000,"abstract":"  Progress in neuroscience has provided unprecedented opportunities to advance\nour understanding of brain alterations and their correspondence to phenotypic\nprofiles. With data collected from various imaging techniques, studies have\nintegrated different types of information ranging from brain structure,\nfunction, or metabolism. More recently, an emerging way to categorize imaging\ntraits is through a metric hierarchy, including localized node-level\nmeasurements and interactive network-level metrics. However, limited research\nhas been conducted to integrate these different hierarchies and achieve a\nbetter understanding of the neurobiological mechanisms and communications. In\nthis work, we address this literature gap by proposing a Bayesian regression\nmodel under both vector-variate and matrix-variate predictors. To characterize\nthe interplay between different predicting components, we propose a set of\nbiologically plausible prior models centered on an innovative joint thresholded\nprior. This captures the coupling and grouping effect of signal patterns, as\nwell as their spatial contiguity across brain anatomy. By developing a\nposterior inference, we can identify and quantify the uncertainty of signaling\nnode- and network-level neuromarkers, as well as their predictive mechanism for\nphenotypic outcomes. Through extensive simulations, we demonstrate that our\nproposed method outperforms the alternative approaches substantially in both\nout-of-sample prediction and feature selection. By implementing the model to\nstudy children's general mental abilities, we establish a powerful predictive\nmechanism based on the identified task contrast traits and resting-state\nsub-networks.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}