{"id":"2407.01865","title":"Geometric Static Modeling Framework for Piecewise-Continuous Curved-Link\n  Multi Point-of-Contact Tensegrity Robots","authors":"Lauren Ervin, Vishesh Vikas","authorsParsed":[["Ervin","Lauren",""],["Vikas","Vishesh",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 00:45:11 GMT"}],"updateDate":"2024-07-03","timestamp":1719881111000,"abstract":"  Tensegrities synergistically combine tensile (cable) and rigid (link)\nelements to achieve structural integrity, making them lightweight, packable,\nand impact resistant. Consequently, they have high potential for locomotion in\nunstructured environments. This research presents geometric modeling of a\nTensegrity eXploratory Robot (TeXploR) comprised of two semi-circular, curved\nlinks held together by 12 prestressed cables and actuated with an internal mass\nshifting along each link. This design allows for efficient rolling with\nstability (e.g., tip-over on an incline). However, the unique design poses\nstatic and dynamic modeling challenges given the discontinuous nature of the\nsemi-circular, curved links, two changing points of contact with the surface\nplane, and instantaneous movement of the masses along the links. The robot is\nmodeled using a geometric approach where the holonomic constraints confirm the\nexperimentally observed four-state hybrid system, proving TeXploR rolls along\none link while pivoting about the end of the other. It also identifies the\nquasi-static state transition boundaries that enable a continuous change in the\nrobot states via internal mass shifting. This is the first time in literature a\nnon-spherical two-point contact system is kinematically and geometrically\nmodeled. Furthermore, the static solutions are closed-form and do not require\nnumerical exploration of the solution. The MATLAB simulations are\nexperimentally validated on a tetherless prototype with mean absolute error of\n4.36{\\deg}.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}