{"id":"2407.11054","title":"Generative AI for Health Technology Assessment: Opportunities,\n  Challenges, and Policy Considerations","authors":"Rachael Fleurence, Jiang Bian, Xiaoyan Wang, Hua Xu, Dalia\n  Dawoud,Mitch Higashi, Jagpreet Chhatwal","authorsParsed":[["Fleurence","Rachael",""],["Bian","Jiang",""],["Wang","Xiaoyan",""],["Xu","Hua",""],["Dawoud","Dalia",""],["Higashi","Mitch",""],["Chhatwal","Jagpreet",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 09:25:27 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 14:10:22 GMT"}],"updateDate":"2024-08-02","timestamp":1720517127000,"abstract":"  This review introduces the transformative potential of generative Artificial\nIntelligence (AI) and foundation models, including large language models\n(LLMs), for health technology assessment (HTA). We explore their applications\nin four critical areas, evidence synthesis, evidence generation, clinical\ntrials and economic modeling: (1) Evidence synthesis: Generative AI has the\npotential to assist in automating literature reviews and meta-analyses by\nproposing search terms, screening abstracts, and extracting data with notable\naccuracy; (2) Evidence generation: These models can potentially facilitate\nautomating the process and analyze the increasingly available large collections\nof real-world data (RWD), including unstructured clinical notes and imaging,\nenhancing the speed and quality of real-world evidence (RWE) generation; (3)\nClinical trials: Generative AI can be used to optimize trial design, improve\npatient matching, and manage trial data more efficiently; and (4) Economic\nmodeling: Generative AI can also aid in the development of health economic\nmodels, from conceptualization to validation, thus streamlining the overall HTA\nprocess. Despite their promise, these technologies, while rapidly improving,\nare still nascent and continued careful evaluation in their applications to HTA\nis required. To ensure their responsible use and implementation, both\ndevelopers and users of research incorporating these tools, should familiarize\nthemselves with their current limitations, including the issues related to\nscientific validity, risk of bias, and consider equity and ethical\nimplications. We also surveyed the current policy landscape and provide\nsuggestions for HTA agencies on responsibly integrating generative AI into\ntheir workflows, emphasizing the importance of human oversight and the\nfast-evolving nature of these tools.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}