{"id":"2407.12290","title":"SKYSURF VI: The Impact of Thermal Variations of HST on Background Light\n  Estimates","authors":"Isabel A. McIntyre, Timothy Carleton, Rosalia O'Brien, Rogier A.\n  Windhorst, Sarah Caddy, Seth H. Cohen, Rolf A. Jansen, John MacKenty, and\n  Scott J. Kenyon","authorsParsed":[["McIntyre","Isabel A.",""],["Carleton","Timothy",""],["O'Brien","Rosalia",""],["Windhorst","Rogier A.",""],["Caddy","Sarah",""],["Cohen","Seth H.",""],["Jansen","Rolf A.",""],["MacKenty","John",""],["Kenyon","Scott J.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 03:23:03 GMT"}],"updateDate":"2024-07-18","timestamp":1721186583000,"abstract":"  The SKYSURF project constrained extragalactic background light (EBL) and\ndiffuse light with the vast archive of Hubble Space Telescope (HST) images.\nThermal emission from HST itself introduces an additional uncertain background\nand hinders accurate measurement of the diffuse light level. Here, we use\narchival WFC3/IR engineering data to investigate and model changes in the\ntemperature of various components in HST's optical path as a function of time\n(solar cycle) and time of the year (Earth-Sun distance). We also specifically\ninvestigate changes in temperature with HST's orbital phase and time since\nEarth occultation. We investigate possible correlations between HST component\ntemperature and year, and temperature and month. The thermal background changes\nby less than one Kelvin in the WFC3 pick-off mirror, one of the most important\ncontributors to the thermal background. We model these data to describe the\nimpact that orbital phase, year, and time of year have on the HST and WFC3\ncomponent temperatures, and use this to derive the impact on the thermal dark\nsignal and the resulting diffuse light measurements. Based on this improved\nmodeling, we provide new upper limits on the level of diffuse light of 21 nW\nm-2 sr-1, 32 nW m-2 sr-1, and 25 nW m-2 sr-1 for F125W, F140W, and F160W.\nAdditionally, by accounting for all known sources of measurement uncertainty,\nwe report lower limits on the level of diffuse light of 12 nW m-2 sr-1, 20 nW\nm-2 sr-1, and 2 nW m-2 sr-1 for F125W, F140W, and F160W.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"lUfFNHYs4GePlyDldZOARMh-3ZQ2cPU9TWThl543QJk","pdfSize":"8971922","objectId":"0xf31c0a56d395601d346c245e986d5700717baa181a1c364167642198fc6978fc","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
