{"id":"2407.06512","title":"LuSNAR:A Lunar Segmentation, Navigation and Reconstruction Dataset based\n  on Muti-sensor for Autonomous Exploration","authors":"Jiayi Liu, Qianyu Zhang, Xue Wan, Shengyang Zhang, Yaolin Tian,\n  Haodong Han, Yutao Zhao, Baichuan Liu, Zeyuan Zhao, Xubo Luo","authorsParsed":[["Liu","Jiayi",""],["Zhang","Qianyu",""],["Wan","Xue",""],["Zhang","Shengyang",""],["Tian","Yaolin",""],["Han","Haodong",""],["Zhao","Yutao",""],["Liu","Baichuan",""],["Zhao","Zeyuan",""],["Luo","Xubo",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 02:47:58 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 03:59:05 GMT"}],"updateDate":"2024-09-06","timestamp":1720493278000,"abstract":"  With the complexity of lunar exploration missions, the moon needs to have a\nhigher level of autonomy. Environmental perception and navigation algorithms\nare the foundation for lunar rovers to achieve autonomous exploration. The\ndevelopment and verification of algorithms require highly reliable data\nsupport. Most of the existing lunar datasets are targeted at a single task,\nlacking diverse scenes and high-precision ground truth labels. To address this\nissue, we propose a multi-task, multi-scene, and multi-label lunar benchmark\ndataset LuSNAR. This dataset can be used for comprehensive evaluation of\nautonomous perception and navigation systems, including high-resolution stereo\nimage pairs, panoramic semantic labels, dense depth maps, LiDAR point clouds,\nand the position of rover. In order to provide richer scene data, we built 9\nlunar simulation scenes based on Unreal Engine. Each scene is divided according\nto topographic relief and the density of objects. To verify the usability of\nthe dataset, we evaluated and analyzed the algorithms of semantic segmentation,\n3D reconstruction, and autonomous navigation. The experiment results prove that\nthe dataset proposed in this paper can be used for ground verification of tasks\nsuch as autonomous environment perception and navigation, and provides a lunar\nbenchmark dataset for testing the accessibility of algorithm metrics. We make\nLuSNAR publicly available at: https://github.com/autumn999999/LuSNAR-dataset.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}