{"id":"2407.00430","title":"Non-equilibrium Electrical Generation of Surface Phonon Polaritons","authors":"Christopher Richard Gubbin, Stanislas Angebault, Joshua D. Caldwell\n  and Simone De Liberato","authorsParsed":[["Gubbin","Christopher Richard",""],["Angebault","Stanislas",""],["Caldwell","Joshua D.",""],["De Liberato","Simone",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 12:52:53 GMT"}],"updateDate":"2024-07-02","timestamp":1719665573000,"abstract":"  Notwithstanding its relevance to many applications in sensing, security, and\ncommunications, electrical generation of narrow-band mid-infrared light remains\nhighly challenging. Unlike in the ultraviolet or visible spectral regions few\nmaterials possess direct electronic transitions in the mid-infrared and most\nthat do are created through complex band-engineering schemes. An alternative\nmechanism, independent of dipole active material transitions, relies instead on\nenergy lost to the polar lattice through the Coulomb interaction. Longitudinal\nphonons radiated in this way can be spectrally tuned through the engineering of\npolar nanostructures and coupled to localized optical modes in the material,\nallowing them to radiate mid-infrared photons into the far-field. A recent\ntheoretical work explored this process providing for the first time an\nindication of its technological relevance when compared to standard thermal\nemitters. In order to do so it nevertheless used an equilibrium model of the\nelectron gas, making this model difficult to inform the design of an optimal\ndevice to experimentally observe the effect. The present paper removes this\nlimitation, describing the electron gas using a rigorous, self-consistent,\nnon-equilibrium Green's function model, accounting for variations in material\nproperties across the device, and electron-electron interactions. Although the\ninstability of the Schrodinger-Poisson iteration limits our studies to the\nlow-bias regime, our results demonstrate emission rates comparable to that of\nroom-temperature thermal emission despite such low biases. These results\nprovide a pathway to design a confirmatory experiment of this new emission\nchannel, that could power a new generation of mid-infrared optoelectronic\ndevices.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}