{"id":"2407.16392","title":"Synthesis of graphene aerogels toward the absorption of liquid and gas\n  pollutants","authors":"George Gorgolis, George Paterakis and Costas Galiotis","authorsParsed":[["Gorgolis","George",""],["Paterakis","George",""],["Galiotis","Costas",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 11:25:55 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 08:26:45 GMT"}],"updateDate":"2024-07-25","timestamp":1721733955000,"abstract":"  Environmental disasters, such as the oil spill in Mexico gulf or, more\nrecently, the Mauritius oil spill caused by a bulk carrier vessel, are some of\nthe ecological issues that the modern society faces frequently. These accidents\nhighlight the need for development of efficient materials that can be employed\nto eliminate pollutants including crude oil and its derivatives, as well as\ntoxic organic solvents. The objective of the present study is to achieve the\nsynthesis of graphene aerogels with two main methods and to determine their\nefficiency as absorbents of liquid and gas pollutants. Graphene aerogels were\nprepared according to the information given by Hong et al. (2015) and Yang et\nal. (2015). Both methods are based on the chemical reduction of graphene oxide\nas the first step and the formation of the aerogel as the second, providing a\nmore cost-effective solution and resulting in a lattice structure similar to\ngraphene. The fabricated materials were investigated for their absorption\ncapacity for liquid and gas pollutants. The specimens were mounted in airtight\nmicroenvironments saturated with a specific Volatile Organic Compound (VOC).\nThree VOCs were tested; formaldehyde, acetic acid and hydrochloric acid and the\nresults were based on gravimetric measurements. In order to increase the\naccuracy of the obtained data, a VOCs sensor was used to measure the change of\nvoltage before and after the introduction of graphene aerogels in a saturated\nmicroenvironment. Furthermore, the graphene aerogels were evaluated as\nabsorbents in organic solvents, namely acetone, ethanol and methanol.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}