{"id":"2407.19021","title":"Theoretical underpinnings of CP-Violation at the High-energy Frontier","authors":"Shaouly Bar-Shalom, Amarjit Soni, Jose Wudka","authorsParsed":[["Bar-Shalom","Shaouly",""],["Soni","Amarjit",""],["Wudka","Jose",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:03:16 GMT"}],"updateDate":"2024-07-30","timestamp":1722016996000,"abstract":"  We present a general analysis for the discovery potential of CP-violation\n(CPV) searches in scattering processes at TeV-scale colliders in an effective\nfield theory framework, using the SMEFT basis for higher dimensional operators.\nIn particular, we systematically examine the CP-violating sector of the SMEFT\nframework in some well motivated limiting cases, based on flavour symmetries of\nthe underlying heavy theory. We show that, under naturality arguments of the\nunderlying new physics (NP) and in the absence of (or suppressed)\nflavour-changing interactions, there is only a single operator, $Q_{t\\phi} =\n\\phi^\\dagger \\phi \\left(\\bar q_3 t \\right) \\tilde{\\phi} $ which alters the\ntop-Yukawa coupling, that can generate a non-vanishing CP-violating effect from\ntree-level SM$\\times$NP interference terms. We find, however, that CPV from\n$Q_{t\\phi} = \\phi^\\dagger \\phi \\left(\\bar q_3 t \\right) \\tilde{\\phi} $ is\nexpected to be at best of $O(1\\%)$ and, therefore, very challenging if at all\nmeasurable at the LHC or other future high-energy colliders. We then conclude\nthat a potentially measurable CP-violating effect of $O(10\\%)$ can arise in\nhigh-energy scattering processes ONLY if flavour-changing interactions are\npresent in the underlying NP; in this case a sizable CPV can be generated at\nthe tree-level by pure NP$\\times$NP effects and not from SM$\\times$NP\ninterference. We provide several examples of CPV at the LHC and at a future\n$e^+e^-$ collider to support these statements.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iTkBqsDFKlHd_ulkbulr5tKQVEqiGYVBWhG_vs0r30Q","pdfSize":"1082175"}
