{"id":"2407.08944","title":"Bora: Biomedical Generalist Video Generation Model","authors":"Weixiang Sun, Xiaocao You, Ruizhe Zheng, Zhengqing Yuan, Xiang Li,\n  Lifang He, Quanzheng Li, Lichao Sun","authorsParsed":[["Sun","Weixiang",""],["You","Xiaocao",""],["Zheng","Ruizhe",""],["Yuan","Zhengqing",""],["Li","Xiang",""],["He","Lifang",""],["Li","Quanzheng",""],["Sun","Lichao",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 03:00:25 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 03:00:07 GMT"}],"updateDate":"2024-07-17","timestamp":1720753225000,"abstract":"  Generative models hold promise for revolutionizing medical education,\nrobot-assisted surgery, and data augmentation for medical AI development.\nDiffusion models can now generate realistic images from text prompts, while\nrecent advancements have demonstrated their ability to create diverse,\nhigh-quality videos. However, these models often struggle with generating\naccurate representations of medical procedures and detailed anatomical\nstructures. This paper introduces Bora, the first spatio-temporal diffusion\nprobabilistic model designed for text-guided biomedical video generation. Bora\nleverages Transformer architecture and is pre-trained on general-purpose video\ngeneration tasks. It is fine-tuned through model alignment and instruction\ntuning using a newly established medical video corpus, which includes paired\ntext-video data from various biomedical fields. To the best of our knowledge,\nthis is the first attempt to establish such a comprehensive annotated\nbiomedical video dataset. Bora is capable of generating high-quality video data\nacross four distinct biomedical domains, adhering to medical expert standards\nand demonstrating consistency and diversity. This generalist video generative\nmodel holds significant potential for enhancing medical consultation and\ndecision-making, particularly in resource-limited settings. Additionally, Bora\ncould pave the way for immersive medical training and procedure planning.\nExtensive experiments on distinct medical modalities such as endoscopy,\nultrasound, MRI, and cell tracking validate the effectiveness of our model in\nunderstanding biomedical instructions and its superior performance across\nsubjects compared to state-of-the-art generation models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}