{"id":"2407.01228","title":"Kerr-Newman outside a rotating de Sitter-type core: A rotating version\n  of the Lemos-Zanchin electrically charged solution","authors":"Marcos L. W. Basso and Vilson T. Zanchin","authorsParsed":[["Basso","Marcos L. W.",""],["Zanchin","Vilson T.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 12:18:59 GMT"}],"updateDate":"2024-07-02","timestamp":1719836339000,"abstract":"  A rotating version of the electrically charged solution of the\nEinstein-Maxwell system of equations modeling static regular black holes by\nLemos and Zanchin [Phys. Rev. D 83, 124005 (2011)] is obtained in the present\nwork. The full rotating geometry consists of the Kerr-Newman exterior geometry\noutside a rotating de Sitter-type core with an electrically charged spheroidal\nshell at the boundary. To achieve this interior geometry, we utilize the\nG\\\"urses-G\\\"ursey metric and employ the Newman-Janis algorithm to generate the\nrotating version of the static solution. The metrics of the two spacetime\nregions are smoothly matched together at the rotating electrically charged\nshell, while the electromagnetic field satisfies the usual boundary conditions\nat a charged surface. Interestingly, we note that, although the Newman-Janis\nprocedure preserves the overall electric charge of the static solution, the\narbitrariness of the algorithm allows us to propose different electromagnetic\nfields and charge (current) distributions for the same geometry of the interior\nregion, together with different charge (current) densities on the rotating\nboundary shell. For a particular choice of the interior electromagnetic field,\nwe show that it is possible to interpret the rotating de Sitter fluid as being\nelectrically polarized due to its rotation, despite the absence of net electric\ncharge within the interior region, which is instead concentrated solely on the\ncharged shell. The properties of the entire rotating solution, such as\ncurvature regularity, energy-momentum tensor and energy conditions, are\nthoroughly examined in the text, revealing various types of charged rotating\nobjects.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}