{"id":"2407.19208","title":"WindPoly: Polygonal Mesh Reconstruction via Winding Numbers","authors":"Xin He, Chenlei Lv, Pengdi Huang, and Hui Huang","authorsParsed":[["He","Xin",""],["Lv","Chenlei",""],["Huang","Pengdi",""],["Huang","Hui",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 08:25:01 GMT"}],"updateDate":"2024-07-30","timestamp":1722068701000,"abstract":"  Polygonal mesh reconstruction of a raw point cloud is a valuable topic in the\nfield of computer graphics and 3D vision. Especially to 3D architectural\nmodels, polygonal mesh provides concise expressions for fundamental geometric\nstructures while effectively reducing data volume. However, there are some\nlimitations of traditional reconstruction methods: normal vector dependency,\nnoisy points and defective parts sensitivity, and internal geometric structure\nlost, which reduce the practicality in real scene. In this paper, we propose a\nrobust and efficient polygonal mesh reconstruction method to address the issues\nin architectural point cloud reconstruction task. It is an iterative adaptation\nprocess to detect planar shapes from scattered points. The initial structural\npolygonal mesh can be established in the constructed convex polyhedral space\nwithout assistance of normal vectors. Then, we develop an efficient\npolygon-based winding number strategy to orient polygonal mesh with global\nconsistency. The significant advantage of our method is to provide a structural\nreconstruction for architectural point clouds and avoid point-based normal\nvector analysis. It effectively improves the robustness to noisy points and\ndefective parts. More geometric details can be preserved in the reconstructed\npolygonal mesh. Experimental results show that our method can reconstruct\nconcise, oriented and faithfully polygonal mesh that are better than results of\nstate-of-the-art methods. More results and details can be found on\nhttps://vcc.tech/research/2024/WindPoly\n","subjects":["Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}