{"id":"2407.17577","title":"Unveiling the structural content of NGC 6357 via kinematics and NIR\n  variability","authors":"C. Ordenes-Huanca, M. Zoccali, A. Bayo, J. Cuadra, R. Contreras Ramos\n  and A. Rojas-Arriagada","authorsParsed":[["Ordenes-Huanca","C.",""],["Zoccali","M.",""],["Bayo","A.",""],["Cuadra","J.",""],["Ramos","R. Contreras",""],["Rojas-Arriagada","A.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 18:30:56 GMT"}],"updateDate":"2024-07-26","timestamp":1721845856000,"abstract":"  NGC 6357, a star-forming complex at $\\sim 1.7$ kpc from the Sun, contains\ngiant molecular clouds and three prominent star clusters alongside with HII\nregions, very massive stars and thousands of young stellar objects in different\nevolutionary stages. We present a combined infrared kinematic and time domain\nstudy of the line of sight towards this region enabled by the VVVX survey. In\nterms of kinematics, a novel discovery emerges: an asymmetrical distribution in\nthe vector point diagram. Some stars in the sample exhibit spatial proximity to\ndusty regions, with their proper motions aligned with filament projections,\nhinting at a younger population linked to triggered star formation. However,\nthis distribution could also stem from an asymmetric stellar expansion event\nwithin NGC 6357, warranting further investigation. Comparing this data with\nGaia revealed inconsistencies likely due to high extinction levels in the\nregion. Additionally, owing to accretion episodes and surface cool spots, young\nstars display high variability. Using the $K_s$-band time series data, we\novercome the extreme levels of extinction towards the region, and compile a\ncatalogue of $774$ infrared light curves of young stars. Each light curve has\nbeen characterized in terms of asymmetry and periodicity, to infer the dominant\nunderlying physical mechanism. These findings are then correlated with\nevolutionary stages, aiming to uncover potential age disparities among the\nobserved stars. This study contributes to our understanding the intricate\ndynamics and evolutionary processes within NGC 6357, offering valuable insights\ninto the formation and development of stellar populations within such complex\nenvironments.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}