{"id":"2407.00174","title":"Gravitational wave memory and its effects on particles and fields","authors":"Abraham I. Harte, Thomas B. Mieling, Marius A. Oancea, Florian\n  Steininger","authorsParsed":[["Harte","Abraham I.",""],["Mieling","Thomas B.",""],["Oancea","Marius A.",""],["Steininger","Florian",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 18:23:32 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 17:12:08 GMT"}],"updateDate":"2024-07-23","timestamp":1719599012000,"abstract":"  Gravitational wave memory is said to arise when a gravitational wave burst\nproduces changes in a physical system that persist even after that wave has\npassed. This paper analyzes gravitational wave bursts in plane wave spacetimes,\nderiving memory effects on timelike and null geodesics, massless scalar fields,\nand massless spinning particles whose motion is described by the spin Hall\nequations. All associated memory effects are found to be characterized by four\n``memory tensors,'' three of which are independent. These tensors form a\nscattering matrix for the transverse components of geodesics. However, unlike\nfor the ``classical'' memory effect involving initially comoving pairs of\ntimelike geodesics, one of our results is that memory effects for null\ngeodesics can have strong longitudinal components. When considering massless\nparticles with spin, we solve the spin Hall equations analytically by showing\nthat there exists a conservation law associated with each conformal Killing\nvector field. These solutions depend only on the same four memory tensors that\ncontrol geodesic scattering. For massless scalar fields, we show that given any\nsolution in flat spacetime, a weak-field solution in a plane wave spacetime can\nbe generated just by differentiation. Precisely which derivatives are involved\ndepend on the same four memory tensors. These effects are illustrated for\nscalar plane waves and higher-order Gaussian beams. Furthermore, we also\npresent a numerical comparison between the dynamics of localized wave packets\ncarrying angular momentum and the spin Hall equations.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}