{"id":"2407.15403","title":"Offline Imitation Learning Through Graph Search and Retrieval","authors":"Zhao-Heng Yin, Pieter Abbeel","authorsParsed":[["Yin","Zhao-Heng",""],["Abbeel","Pieter",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 06:12:21 GMT"}],"updateDate":"2024-07-23","timestamp":1721628741000,"abstract":"  Imitation learning is a powerful machine learning algorithm for a robot to\nacquire manipulation skills. Nevertheless, many real-world manipulation tasks\ninvolve precise and dexterous robot-object interactions, which make it\ndifficult for humans to collect high-quality expert demonstrations. As a\nresult, a robot has to learn skills from suboptimal demonstrations and\nunstructured interactions, which remains a key challenge. Existing works\ntypically use offline deep reinforcement learning (RL) to solve this challenge,\nbut in practice these algorithms are unstable and fragile due to the deadly\ntriad issue. To overcome this problem, we propose GSR, a simple yet effective\nalgorithm that learns from suboptimal demonstrations through Graph Search and\nRetrieval. We first use pretrained representation to organize the interaction\nexperience into a graph and perform a graph search to calculate the values of\ndifferent behaviors. Then, we apply a retrieval-based procedure to identify the\nbest behavior (actions) on each state and use behavior cloning to learn that\nbehavior. We evaluate our method in both simulation and real-world robotic\nmanipulation tasks with complex visual inputs, covering various precise and\ndexterous manipulation skills with objects of different physical properties.\nGSR can achieve a 10% to 30% higher success rate and over 30% higher\nproficiency compared to baselines. Our project page is at\nhttps://zhaohengyin.github.io/gsr.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}