{"id":"2407.17432","title":"An FPGA-Based Open-Source Hardware-Software Framework for Side-Channel\n  Security Research","authors":"Davide Zoni, Andrea Galimberti, Davide Galli","authorsParsed":[["Zoni","Davide",""],["Galimberti","Andrea",""],["Galli","Davide",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 17:06:21 GMT"}],"updateDate":"2024-07-25","timestamp":1721840781000,"abstract":"  Attacks based on side-channel analysis (SCA) pose a severe security threat to\nmodern computing platforms, further exacerbated on IoT devices by their\npervasiveness and handling of private and critical data. Designing\nSCA-resistant computing platforms requires a significant additional effort in\nthe early stages of the IoT devices' life cycle, which is severely constrained\nby strict time-to-market deadlines and tight budgets. This manuscript\nintroduces a hardware-software framework meant for SCA research on FPGA\ntargets. It delivers an IoT-class system-on-chip (SoC) that includes a RISC-V\nCPU, provides observability and controllability through an ad-hoc debug\ninfrastructure to facilitate SCA attacks and evaluate the platform's security,\nand streamlines the deployment of SCA countermeasures through dedicated\nhardware and software features such as a DFS actuator and FreeRTOS support. The\nopen-source release of the framework includes the SoC, the scripts to configure\nthe computing platform, compile a target application, and assess the SCA\nsecurity, as well as a suite of state-of-the-art SCA attacks and\ncountermeasures. The goal is to foster its adoption and novel developments in\nthe field, empowering designers and researchers to focus on studying SCA\ncountermeasures and attacks while relying on a sound and stable\nhardware-software platform as the foundation for their research.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/"}