{"id":"2407.17665","title":"Incoherent diffractive production of jets in electron DIS off nuclei at\n  high energy","authors":"Benjamin Rodriguez-Aguilar, D.N. Triantafyllopoulos, S.Y. Wei","authorsParsed":[["Rodriguez-Aguilar","Benjamin",""],["Triantafyllopoulos","D. N.",""],["Wei","S. Y.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 22:27:34 GMT"}],"updateDate":"2024-07-26","timestamp":1721860054000,"abstract":"  We study incoherent diffractive production of two and three jets in\nelectron-nucleus deep inelastic scattering (DIS) at small\n$x_{\\scriptscriptstyle \\rm Bj}$ using the color dipole picture and the\neffective theory of the Color Glass Condensate (CGC). We consider color\nfluctuations in the CGC weight-function as the source of the nuclear break-up\nand the associated momentum transfer $\\sqrt{|t|}$. We focus on the regime in\nwhich the two jets are almost back-to-back in transverse space and have\ntransverse momenta $P_{\\perp}$ much larger than both the momentum transfer and\nthe saturation scale $Q_s$. The cross section for producing such a hard dijet\nis parametrically dominated by large size fluctuations in the projectile\nwave-function that scatter strongly and for which a third, semi-hard, jet\nappears in the final state. The 2 + 1 jets cross section can be written in a\nfactorized form in terms of incoherent quark and gluon diffractive transverse\nmomentum distributions (DTMDs) when the third jet is explicit, or incoherent\ndiffractive parton distribution functions (DPDFs) when the third jet is\nintegrated over. We find that the DPDFs and the corresponding cross section\nsaturate logarithmically when $|t| \\ll Q_s^2$, while they fall like $1/|t|^2$\nin the regime $Q_s^2 \\ll |t| \\ll P_{\\perp}^2$. We further show that there is no\nangular correlation between the hard jet momentum and the momentum transfer.\nFor typical EIC kinematics the 2 jets and 2 + 1 jets cross sections are of the\nsame order.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/Nuclear Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}