{"id":"2407.06841","title":"HTD-Mamba: Efficient Hyperspectral Target Detection with Pyramid State\n  Space Model","authors":"Dunbin Shen, Xuanbing Zhu, Jiacheng Tian, Jianjun Liu, Zhenrong Du,\n  Hongyu Wang, Xiaorui Ma","authorsParsed":[["Shen","Dunbin",""],["Zhu","Xuanbing",""],["Tian","Jiacheng",""],["Liu","Jianjun",""],["Du","Zhenrong",""],["Wang","Hongyu",""],["Ma","Xiaorui",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 13:21:26 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 05:12:48 GMT"}],"updateDate":"2024-07-18","timestamp":1720531286000,"abstract":"  Hyperspectral target detection (HTD) identifies objects of interest from\ncomplex backgrounds at the pixel level, playing a vital role in Earth\nobservation. However, HTD faces challenges due to limited prior knowledge and\nspectral variation, leading to underfitting models and unreliable performance.\nTo address these challenges, this paper proposes an efficient self-supervised\nHTD method with a pyramid state space model (SSM), named HTD-Mamba, which\nemploys spectrally contrastive learning to distinguish between target and\nbackground based on the similarity measurement of intrinsic features.\nSpecifically, to obtain sufficient training samples and leverage spatial\ncontextual information, we propose a spatial-encoded spectral augmentation\ntechnique that encodes all surrounding pixels within a patch into a transformed\nview of the center pixel. Additionally, to explore global band correlations, we\ndivide pixels into continuous group-wise spectral embeddings and introduce\nMamba to HTD for the first time to model long-range dependencies of the\nspectral sequence with linear complexity. Furthermore, to alleviate spectral\nvariation and enhance robust representation, we propose a pyramid SSM as a\nbackbone to capture and fuse multiresolution spectral-wise intrinsic features.\nExtensive experiments conducted on four public datasets demonstrate that the\nproposed method outperforms state-of-the-art methods in both quantitative and\nqualitative evaluations. Code is available at\n\\url{https://github.com/shendb2022/HTD-Mamba}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}