{"id":"2407.09059","title":"Domain-adaptive Video Deblurring via Test-time Blurring","authors":"Jin-Ting He, Fu-Jen Tsai, Jia-Hao Wu, Yan-Tsung Peng, Chung-Chi Tsai,\n  Chia-Wen Lin, Yen-Yu Lin","authorsParsed":[["He","Jin-Ting",""],["Tsai","Fu-Jen",""],["Wu","Jia-Hao",""],["Peng","Yan-Tsung",""],["Tsai","Chung-Chi",""],["Lin","Chia-Wen",""],["Lin","Yen-Yu",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 07:28:01 GMT"}],"updateDate":"2024-07-15","timestamp":1720769281000,"abstract":"  Dynamic scene video deblurring aims to remove undesirable blurry artifacts\ncaptured during the exposure process. Although previous video deblurring\nmethods have achieved impressive results, they suffer from significant\nperformance drops due to the domain gap between training and testing videos,\nespecially for those captured in real-world scenarios. To address this issue,\nwe propose a domain adaptation scheme based on a blurring model to achieve\ntest-time fine-tuning for deblurring models in unseen domains. Since blurred\nand sharp pairs are unavailable for fine-tuning during inference, our scheme\ncan generate domain-adaptive training pairs to calibrate a deblurring model for\nthe target domain. First, a Relative Sharpness Detection Module is proposed to\nidentify relatively sharp regions from the blurry input images and regard them\nas pseudo-sharp images. Next, we utilize a blurring model to produce blurred\nimages based on the pseudo-sharp images extracted during testing. To synthesize\nblurred images in compliance with the target data distribution, we propose a\nDomain-adaptive Blur Condition Generation Module to create domain-specific blur\nconditions for the blurring model. Finally, the generated pseudo-sharp and\nblurred pairs are used to fine-tune a deblurring model for better performance.\nExtensive experimental results demonstrate that our approach can significantly\nimprove state-of-the-art video deblurring methods, providing performance gains\nof up to 7.54dB on various real-world video deblurring datasets. The source\ncode is available at https://github.com/Jin-Ting-He/DADeblur.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RLbaI_N76dY7YUIoZFsVHC0R1Lme6GLaZ-SXcCuZ79g","pdfSize":"3778224","objectId":"0x4391e47df900b038a2601fa487d264cabd11c7ae7030722cfee881721c14c4b6","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
