{"id":"2407.12848","title":"Applicability of Large Language Models and Generative Models for Legal\n  Case Judgement Summarization","authors":"Aniket Deroy, Kripabandhu Ghosh, Saptarshi Ghosh","authorsParsed":[["Deroy","Aniket",""],["Ghosh","Kripabandhu",""],["Ghosh","Saptarshi",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 04:49:40 GMT"},{"version":"v2","created":"Sat, 20 Jul 2024 05:50:41 GMT"}],"updateDate":"2024-07-23","timestamp":1720241380000,"abstract":"  Automatic summarization of legal case judgements, which are known to be long\nand complex, has traditionally been tried via extractive summarization models.\nIn recent years, generative models including abstractive summarization models\nand Large language models (LLMs) have gained huge popularity. In this paper, we\nexplore the applicability of such models for legal case judgement\nsummarization. We applied various domain specific abstractive summarization\nmodels and general domain LLMs as well as extractive summarization models over\ntwo sets of legal case judgements from the United Kingdom (UK) Supreme Court\nand the Indian (IN) Supreme Court and evaluated the quality of the generated\nsummaries. We also perform experiments on a third dataset of legal documents of\na different type, Government reports from the United States (US). Results show\nthat abstractive summarization models and LLMs generally perform better than\nthe extractive methods as per traditional metrics for evaluating summary\nquality. However, detailed investigation shows the presence of inconsistencies\nand hallucinations in the outputs of the generative models, and we explore ways\nto reduce the hallucinations and inconsistencies in the summaries. Overall, the\ninvestigation suggests that further improvements are needed to enhance the\nreliability of abstractive models and LLMs for legal case judgement\nsummarization. At present, a human-in-the-loop technique is more suitable for\nperforming manual checks to identify inconsistencies in the generated\nsummaries.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}