{"id":"2407.04235","title":"Novel Optimization Techniques for Parameter Estimation","authors":"Chenyu Wu, Nuozhou Wang, Casey Garner, Kevin Leder, Shuzhong Zhang","authorsParsed":[["Wu","Chenyu",""],["Wang","Nuozhou",""],["Garner","Casey",""],["Leder","Kevin",""],["Zhang","Shuzhong",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 03:22:51 GMT"}],"updateDate":"2024-07-08","timestamp":1720149771000,"abstract":"  In this paper, we introduce a new optimization algorithm that is well suited\nfor solving parameter estimation problems. We call our new method cubic\nregularized Newton with affine scaling (CRNAS). In contrast to so-called\nfirst-order methods which rely solely on the gradient of the objective\nfunction, our method utilizes the Hessian of the objective. As a result it is\nable to focus on points satisfying the second-order optimality conditions, as\nopposed to first-order methods that simply converge to critical points. This is\nan important feature in parameter estimation problems where the objective\nfunction is often non-convex and as a result there can be many critical points\nmaking it is near impossible to identify the global minimum. An important\nfeature of parameter estimation in mathematical models of biological systems is\nthat the parameters are constrained by either physical constraints or prior\nknowledge. We use an affine scaling approach to handle a wide class of\nconstraints. We establish that CRNAS identifies a point satisfying\n$\\epsilon$-approximate second-order optimality conditions within\n$O(\\epsilon^{-3/2})$ iterations. Finally, we compare CRNAS with MATLAB's\noptimization solver fmincon on three different test problems. These test\nproblems all feature mixtures of heterogeneous populations, a problem setting\nthat CRNAS is particularly well-suited for. Our numerical simulations show\nCRNAS has favorable performance, performing comparable if not better than\nfmincon in accuracy and computational cost for most of our examples.\n","subjects":["Mathematics/Optimization and Control","Quantitative Biology/Quantitative Methods"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}