{"id":"2407.16049","title":"The optimisation of short-term scheduling of science observations at\n  Paranal observatory (VLT and ELT)","authors":"Joseph P. Anderson and Elyar Sedaghati and Aleksandar Cikota and\n  Natalie Behara and Fuyan Bian and Angel Otarola and Steffen Mieske","authorsParsed":[["Anderson","Joseph P.",""],["Sedaghati","Elyar",""],["Cikota","Aleksandar",""],["Behara","Natalie",""],["Bian","Fuyan",""],["Otarola","Angel",""],["Mieske","Steffen",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 20:56:12 GMT"}],"updateDate":"2024-07-24","timestamp":1721681772000,"abstract":"  The efficiency of science observation Short-Term Scheduling (STS) can be\ndefined as being a function of how many highly ranked observations are\ncompleted per unit time. Current STS at ESO's Paranal observatory is achieved\nthrough filtering and ranking observations via well-defined algorithms, leading\nto a proposed observation at time t. This Paranal STS model has been\nsuccessfully employed for more than a decade. Here, we summarise the current\nVLT(I) STS model, and outline ongoing efforts of optimising the scientific\nreturn of both the VLT(I) and future ELT. We describe the STS simulator we have\nbuilt that enables us to evaluate how changes in model assumptions affect STS\neffectiveness. Such changes include: using short-term predictions of\natmospheric parameters instead of assuming their constant time evolution;\nassessing how the ranking weights on different observation parameters can be\nchanged to optimise the scheduling; changing STS to be more `dynamic' to\nconsider medium-term scheduling constraints. We present specific results\ncomparing how machine learning predictions of the seeing can improve STS\nefficiency when compared to the current model of using the last 10\\,min median\nof the measured seeing for observation selection.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}