{"id":"2407.03261","title":"Magnetic Hysteresis Modeling with Neural Operators","authors":"Abhishek Chandra, Bram Daniels, Mitrofan Curti, Koen Tiels, Elena A.\n  Lomonova","authorsParsed":[["Chandra","Abhishek",""],["Daniels","Bram",""],["Curti","Mitrofan",""],["Tiels","Koen",""],["Lomonova","Elena A.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 16:45:45 GMT"}],"updateDate":"2024-07-04","timestamp":1720025145000,"abstract":"  Hysteresis modeling is crucial to comprehend the behavior of magnetic\ndevices, facilitating optimal designs. Hitherto, deep learning-based methods\nemployed to model hysteresis, face challenges in generalizing to novel input\nmagnetic fields. This paper addresses the generalization challenge by proposing\nneural operators for modeling constitutive laws that exhibit magnetic\nhysteresis by learning a mapping between magnetic fields. In particular, two\nprominent neural operators -- deep operator network and Fourier neural operator\n-- are employed to predict novel first-order reversal curves and minor loops,\nwhere novel means they are not used to train the model. In addition, a\nrate-independent Fourier neural operator is proposed to predict material\nresponses at sampling rates different from those used during training to\nincorporate the rate-independent characteristics of magnetic hysteresis. The\npresented numerical experiments demonstrate that neural operators efficiently\nmodel magnetic hysteresis, outperforming the traditional neural recurrent\nmethods on various metrics and generalizing to novel magnetic fields. The\nfindings emphasize the advantages of using neural operators for modeling\nhysteresis under varying magnetic conditions, underscoring their importance in\ncharacterizing magnetic material based devices.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Signal Processing","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}