{"id":"2407.11823","title":"Harmonizing Safety and Speed: A Human-Algorithm Approach to Enhance the\n  FDA's Medical Device Clearance Policy","authors":"Mohammad Zhalechian, Soroush Saghafian, Omar Robles","authorsParsed":[["Zhalechian","Mohammad",""],["Saghafian","Soroush",""],["Robles","Omar",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:11:29 GMT"}],"updateDate":"2024-07-17","timestamp":1721142689000,"abstract":"  The United States Food and Drug Administration's (FDA's) Premarket\nNotification 510(K) pathway allows manufacturers to gain approval for a medical\ndevice by demonstrating its substantial equivalence to another legally marketed\ndevice. However, the inherent ambiguity of this regulatory procedure has led to\nhigh recall rates for many devices cleared through this pathway. This trend has\nraised significant concerns regarding the efficacy of the FDA's current\napproach, prompting a reassessment of the 510(K) regulatory framework. In this\npaper, we develop a combined human-algorithm approach to assist the FDA in\nimproving its 510(k) medical device clearance process by reducing the risk of\npotential recalls and the workload imposed on the FDA. We first develop machine\nlearning methods to estimate the risk of recall of 510(k) medical devices based\non the information available at the time of submission. We then propose a\ndata-driven clearance policy that recommends acceptance, rejection, or deferral\nto FDA's committees for in-depth evaluation. We conduct an empirical study\nusing a unique large-scale dataset of over 31,000 medical devices and 12,000\nnational and international manufacturers from over 65 countries that we\nassembled based on data sources from the FDA and Centers for Medicare and\nMedicaid Service (CMS). A conservative evaluation of our proposed policy based\non this data shows a 38.9% improvement in the recall rate and a 43.0% reduction\nin the FDA's workload. Our analyses also indicate that implementing our policy\ncould result in significant annual cost-savings ranging between \\$2.4 billion\nand \\$2.7 billion, which highlights the value of using a holistic and\ndata-driven approach to improve the FDA's current 510(K) medical device\nevaluation pathway.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Human-Computer Interaction","Mathematics/Optimization and Control","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}