{"id":"2407.08800","title":"Local Clustering for Lung Cancer Image Classification via Sparse\n  Solution Technique","authors":"Jackson Hamel, Ming-Jun Lai, Zhaiming Shen, Ye Tian","authorsParsed":[["Hamel","Jackson",""],["Lai","Ming-Jun",""],["Shen","Zhaiming",""],["Tian","Ye",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 18:18:32 GMT"}],"updateDate":"2024-07-15","timestamp":1720721912000,"abstract":"  In this work, we propose to use a local clustering approach based on the\nsparse solution technique to study the medical image, especially the lung\ncancer image classification task. We view images as the vertices in a weighted\ngraph and the similarity between a pair of images as the edges in the graph.\nThe vertices within the same cluster can be assumed to share similar features\nand properties, thus making the applications of graph clustering techniques\nvery useful for image classification. Recently, the approach based on the\nsparse solutions of linear systems for graph clustering has been found to\nidentify clusters more efficiently than traditional clustering methods such as\nspectral clustering. We propose to use the two newly developed local clustering\nmethods based on sparse solution of linear system for image classification. In\naddition, we employ a box spline-based tight-wavelet-framelet method to clean\nthese images and help build a better adjacency matrix before clustering. The\nperformance of our methods is shown to be very effective in classifying images.\nOur approach is significantly more efficient and either favorable or equally\neffective compared with other state-of-the-art approaches. Finally, we shall\nmake a remark by pointing out two image deformation methods to build up more\nartificial image data to increase the number of labeled images.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}