{"id":"2407.05857","title":"Disk-stacking models are consistent with Fibonacci and non-Fibonacci\n  structure in sunflowers","authors":"Jonathan Swinton","authorsParsed":[["Swinton","Jonathan",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 12:05:53 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 11:39:17 GMT"},{"version":"v3","created":"Mon, 2 Sep 2024 08:38:59 GMT"}],"updateDate":"2024-09-04","timestamp":1720440353000,"abstract":"  This paper investigates a model of plant organ placement motivated by the\nappearance of large Fibonacci numbers in phyllotaxis, and provides the first\nlarge-scale empirical validation of this model. Specifically it evaluates the\nability of Schwendener disk-stacking models to generate parastichy patterns\nseen in a large dataset of sunflower seedheads. We find that features of this\ndata that the models can account for include a predominance of Fibonacci\ncounts, usually in a pair of left and right counts on a single seedhead, a\nsmaller but detectable frequency of Lucas and double Fibonacci numbers, a\ncomparable frequency of Fibonacci numbers plus or minus one, and occurrences of\npairs of roughly equal but non-Fibonacci counts in a `columnar' structure. A\nfurther observation in the dataset was an occasional lack of rotational\nsymmetry in the parastichy spirals, and this paper demonstrates those in the\nmodel for the first time.\n  Schwendener disk-stacking models allow Fibonacci structure by ensuring that a\nparameter of the model corresponding to the speed of plant growth is kept small\nenough. While many other models can exhibit Fibonacci structure, usually by\nspecifying a rotation parameter to an extremely high precision, no other model\nhas accounted for further, non-Fibonacci, features in the observed data. The\nSchwendener model produces these naturally in the region of parameter space\njust beyond where the Fibonacci structure breaks down, without any further\nparameter fitting. We also introduce stochasticity into the model and show that\nit while it can be responsible for the appearance of columnar structure, the\ndisordered dynamics of the deterministic system near the critical region can\nalso generate this structure.\n","subjects":["Quantitative Biology/Tissues and Organs"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}