{"id":"2407.07322","title":"Integrating Human-Centric Approaches into Undergraduate Software\n  Engineering Education: A Scoping Review and Curriculum Analysis in the\n  Australian Context","authors":"Sophie McKenzie, Xiao Lui","authorsParsed":[["McKenzie","Sophie",""],["Lui","Xiao",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 02:34:58 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 00:46:41 GMT"}],"updateDate":"2024-08-09","timestamp":1720578898000,"abstract":"  Human-Centric Software Engineering (HCSE) refers to the software engineering\n(SE) processes that put human needs and requirements as core practice\nthroughout the software development life cycle. A large majority of software\nprojects fail to cater to human needs and consequently run into budget,\ndelivery, and usability issues. To support human-centric software engineering\npractices, it is important for universities to train their students on how to\nconsider human needs. But what topics from HCSE should be provided in the\nundergraduate curriculum? Curriculum guidelines for software engineering are\navailable, however do not represent update to date considerations for\nhuman-factors. To address this issue, this paper presents a scoping review to\nidentify the topics and curriculum approaches suitable for teaching HCSE to\nundergraduate software engineering students. The scoping review was conducted\naccording to the protocol by PRISMA-ScR (Preferred Reporting Items for\nSystematic reviews and Meta-Analyses extension for Scoping Reviews). Through\nPRISMA-ScR, a total of 36 conference or journal papers were identified as\nviable for analysis,with 5 common themes found that describe topics and\ncurriculum approaches relevant for teaching software engineering. Using the\noutcomes of the scoping review, this paper also analyses the Australian\nSoftware Engineering curriculum to understand the extent at which human centred\nsoftware engineering topics are scaffolded into course structures. This paper\nconcludes by suggesting topic scaffolding for the undergraduate curriculum that\naligns with the software engineering process. Overall, by providing a focus on\nHCSE topics and curriculum approaches, the education of HCSE among current and\nfuture software engineers can increase, leading to long-term impact on the\nsuccess of software projects for all stakeholders.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}