{"id":"2407.01111","title":"Proximity Matters: Local Proximity Preserved Balancing for Treatment\n  Effect Estimation","authors":"Hao Wang, Zhichao Chen, Yuan Shen, Jiajun Fan, Zhaoran Liu, Degui\n  Yang, Xinggao Liu, Haoxuan Li","authorsParsed":[["Wang","Hao",""],["Chen","Zhichao",""],["Shen","Yuan",""],["Fan","Jiajun",""],["Liu","Zhaoran",""],["Yang","Degui",""],["Liu","Xinggao",""],["Li","Haoxuan",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 09:20:26 GMT"}],"updateDate":"2024-07-02","timestamp":1719825626000,"abstract":"  Heterogeneous treatment effect (HTE) estimation from observational data poses\nsignificant challenges due to treatment selection bias. Existing methods\naddress this bias by minimizing distribution discrepancies between treatment\ngroups in latent space, focusing on global alignment. However, the fruitful\naspect of local proximity, where similar units exhibit similar outcomes, is\noften overlooked. In this study, we propose Proximity-aware Counterfactual\nRegression (PCR) to exploit proximity for representation balancing within the\nHTE estimation context. Specifically, we introduce a local proximity\npreservation regularizer based on optimal transport to depict the local\nproximity in discrepancy calculation. Furthermore, to overcome the curse of\ndimensionality that renders the estimation of discrepancy ineffective,\nexacerbated by limited data availability for HTE estimation, we develop an\ninformative subspace projector, which trades off minimal distance precision for\nimproved sample complexity. Extensive experiments demonstrate that PCR\naccurately matches units across different treatment groups, effectively\nmitigates treatment selection bias, and significantly outperforms competitors.\nCode is available at https://anonymous.4open.science/status/ncr-B697.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}