{"id":"2407.11387","title":"A Framework for Evaluating Appropriateness, Trustworthiness, and Safety\n  in Mental Wellness AI Chatbots","authors":"Lucia Chen, David A. Preece, Pilleriin Sikka, James J. Gross, Ben\n  Krause","authorsParsed":[["Chen","Lucia",""],["Preece","David A.",""],["Sikka","Pilleriin",""],["Gross","James J.",""],["Krause","Ben",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 05:07:35 GMT"}],"updateDate":"2024-07-17","timestamp":1721106455000,"abstract":"  Large language model (LLM) chatbots are susceptible to biases and\nhallucinations, but current evaluations of mental wellness technologies lack\ncomprehensive case studies to evaluate their practical applications. Here, we\naddress this gap by introducing the MHealth-EVAL framework, a new role-play\nbased interactive evaluation method designed specifically for evaluating the\nappropriateness, trustworthiness, and safety of mental wellness chatbots. We\nalso introduce Psyfy, a new chatbot leveraging LLMs to facilitate\ntransdiagnostic Cognitive Behavioral Therapy (CBT). We demonstrate the\nMHealth-EVAL framework's utility through a comparative study of two versions of\nPsyfy against standard baseline chatbots. Our results showed that Psyfy\nchatbots outperformed the baseline chatbots in delivering appropriate\nresponses, engaging users, and avoiding untrustworthy responses. However, both\nPsyfy and the baseline chatbots exhibited some limitations, such as providing\npredominantly US-centric resources. While Psyfy chatbots were able to identify\nmost unsafe situations and avoid giving unsafe responses, they sometimes\nstruggled to recognize subtle harmful intentions when prompted in role play\nscenarios. Our study demonstrates a practical application of the MHealth-EVAL\nframework and showcases Psyfy's utility in harnessing LLMs to enhance user\nengagement and provide flexible and appropriate responses aligned with an\nevidence-based CBT approach.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}