{"id":"2407.11405","title":"Cover-separable Fixed Neural Network Steganography via Deep Generative\n  Models","authors":"Guobiao Li, Sheng Li, Zhenxing Qian and Xinpeng Zhang","authorsParsed":[["Li","Guobiao",""],["Li","Sheng",""],["Qian","Zhenxing",""],["Zhang","Xinpeng",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 05:47:06 GMT"}],"updateDate":"2024-07-17","timestamp":1721108826000,"abstract":"  Image steganography is the process of hiding secret data in a cover image by\nsubtle perturbation. Recent studies show that it is feasible to use a fixed\nneural network for data embedding and extraction. Such Fixed Neural Network\nSteganography (FNNS) demonstrates favorable performance without the need for\ntraining networks, making it more practical for real-world applications.\nHowever, the stego-images generated by the existing FNNS methods exhibit high\ndistortion, which is prone to be detected by steganalysis tools. To deal with\nthis issue, we propose a Cover-separable Fixed Neural Network Steganography,\nnamely Cs-FNNS. In Cs-FNNS, we propose a Steganographic Perturbation Search\n(SPS) algorithm to directly encode the secret data into an imperceptible\nperturbation, which is combined with an AI-generated cover image for\ntransmission. Through accessing the same deep generative models, the receiver\ncould reproduce the cover image using a pre-agreed key, to separate the\nperturbation in the stego-image for data decoding. such an encoding/decoding\nstrategy focuses on the secret data and eliminates the disturbance of the cover\nimages, hence achieving a better performance. We apply our Cs-FNNS to the\nsteganographic field that hiding secret images within cover images. Through\ncomprehensive experiments, we demonstrate the superior performance of the\nproposed method in terms of visual quality and undetectability. Moreover, we\nshow the flexibility of our Cs-FNNS in terms of hiding multiple secret images\nfor different receivers.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}