{"id":"2407.21742","title":"HGOE: Hybrid External and Internal Graph Outlier Exposure for Graph\n  Out-of-Distribution Detection","authors":"Junwei He, Qianqian Xu, Yangbangyan Jiang, Zitai Wang, Yuchen Sun,\n  Qingming Huang","authorsParsed":[["He","Junwei",""],["Xu","Qianqian",""],["Jiang","Yangbangyan",""],["Wang","Zitai",""],["Sun","Yuchen",""],["Huang","Qingming",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 16:55:18 GMT"}],"updateDate":"2024-08-01","timestamp":1722444918000,"abstract":"  With the progressive advancements in deep graph learning, out-of-distribution\n(OOD) detection for graph data has emerged as a critical challenge. While the\nefficacy of auxiliary datasets in enhancing OOD detection has been extensively\nstudied for image and text data, such approaches have not yet been explored for\ngraph data. Unlike Euclidean data, graph data exhibits greater diversity but\nlower robustness to perturbations, complicating the integration of outliers. To\ntackle these challenges, we propose the introduction of \\textbf{H}ybrid\nExternal and Internal \\textbf{G}raph \\textbf{O}utlier \\textbf{E}xposure (HGOE)\nto improve graph OOD detection performance. Our framework involves using\nrealistic external graph data from various domains and synthesizing internal\noutliers within ID subgroups to address the poor robustness and presence of OOD\nsamples within the ID class. Furthermore, we develop a boundary-aware OE loss\nthat adaptively assigns weights to outliers, maximizing the use of high-quality\nOOD samples while minimizing the impact of low-quality ones. Our proposed HGOE\nframework is model-agnostic and designed to enhance the effectiveness of\nexisting graph OOD detection models. Experimental results demonstrate that our\nHGOE framework can significantly improve the performance of existing OOD\ndetection models across all 8 real datasets.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}