{"id":"2407.11079","title":"One-Bit MIMO Detection: From Global Maximum-Likelihood Detector to\n  Amplitude Retrieval Approach","authors":"Mingjie Shao, Wei-Kun Chen, Cheng-Yang Yu, Ya-Feng Liu, and Wing-Kin\n  Ma","authorsParsed":[["Shao","Mingjie",""],["Chen","Wei-Kun",""],["Yu","Cheng-Yang",""],["Liu","Ya-Feng",""],["Ma","Wing-Kin",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 08:24:57 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 03:27:56 GMT"}],"updateDate":"2024-07-18","timestamp":1720859097000,"abstract":"  As communication systems advance towards the future 6G era, the incorporation\nof large-scale antenna arrays in base stations (BSs) presents challenges such\nas increased hardware costs and energy consumption. To address these issues,\nthe use of one-bit analog-to-digital converters (ADCs)/digital-to-analog\nconverters (DACs) has gained significant attentions. This paper focuses on\none-bit multiple-input multiple-output (MIMO) detection in an uplink multiuser\ntransmission scenario where the BS employs one-bit ADCs. One-bit quantization\nretains only the sign information and loses the amplitude information, which\nposes a unique challenge in the corresponding detection problem. The\nmaximum-likelihood (ML) formulation of one-bit MIMO detection has a challenging\nlikelihood function that hinders the application of many high-performance\ndetectors developed for classic MIMO detection (under high-resolution ADCs).\nWhile many approximate methods for the ML detection problem have been studied,\nit lacks an efficient global algorithm. This paper fills this gap by proposing\nan efficient branch-and-bound algorithm, which is guaranteed to find the global\nsolution of the one-bit ML MIMO detection problem. Additionally, a new\namplitude retrieval (AR) detection approach is developed, incorporating\nexplicit amplitude variables into the problem formulation. The AR approach\nyields simpler objective functions that enable the development of efficient\nalgorithms offering both global and approximate solutions. The paper also\ncontributes to the computational complexity analysis of both ML and AR\ndetection problems. Extensive simulations are conducted to demonstrate the\neffectiveness and efficiency of the proposed formulations and algorithms.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}