{"id":"2407.06403","title":"Swin UNETR segmentation with automated geometry filtering for\n  biomechanical modeling of knee joint cartilage","authors":"Reza Kakavand, Peyman Tahghighi, Reza Ahmadi, W. Brent Edwards, Amin\n  Komeili","authorsParsed":[["Kakavand","Reza",""],["Tahghighi","Peyman",""],["Ahmadi","Reza",""],["Edwards","W. Brent",""],["Komeili","Amin",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 21:22:47 GMT"}],"updateDate":"2024-07-10","timestamp":1720473767000,"abstract":"  Simulation studies, such as finite element (FE) modeling, offer insights into\nknee joint biomechanics, which may not be achieved through experimental methods\nwithout direct involvement of patients. While generic FE models have been used\nto predict tissue biomechanics, they overlook variations in population-specific\ngeometry, loading, and material properties. In contrast, subject-specific\nmodels account for these factors, delivering enhanced predictive precision but\nrequiring significant effort and time for development. This study aimed to\nfacilitate subject-specific knee joint FE modeling by integrating an automated\ncartilage segmentation algorithm using a 3D Swin UNETR. This algorithm provided\ninitial segmentation of knee cartilage, followed by automated geometry\nfiltering to refine surface roughness and continuity. In addition to the\nstandard metrics of image segmentation performance, such as Dice similarity\ncoefficient (DSC) and Hausdorff distance, the method's effectiveness was also\nassessed in FE simulation. Nine pairs of knee cartilage FE models, using manual\nand automated segmentation methods, were developed to compare the predicted\nstress and strain responses during gait. The automated segmentation achieved\nhigh Dice similarity coefficients of 89.4% for femoral and 85.1% for tibial\ncartilage, with a Hausdorff distance of 2.3 mm between the automated and manual\nsegmentation. Mechanical results including maximum principal stress and strain,\nfluid pressure, fibril strain, and contact area showed no significant\ndifferences between the manual and automated FE models. These findings\ndemonstrate the effectiveness of the proposed automated segmentation method in\ncreating accurate knee joint FE models.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}