{"id":"2407.14410","title":"The Discovery and Evolution of a Possible New Epoch of Cometary Activity\n  by the Centaur (2060) Chiron","authors":"Matthew M. Dobson, Megan E. Schwamb, Alan Fitzsimmons, Charles\n  Schambeau, Aren Beck, Larry Denneau, Nicolas Erasmus, A. N. Heinze, Luke J.\n  Shingles, Robert J. Siverd, Ken W. Smith, John L. Tonry, Henry Weiland,\n  David. R. Young, Michael S. P. Kelley, Tim Lister, Pedro H. Bernardinelli,\n  Marin Ferrais, Emmanuel Jehin, Grigori Fedorets, Susan D. Benecchi, Anne J.\n  Verbiscer, Joseph Murtagh, Rene Duffard, Edward Gomez, Joey Chatelain, Sarah\n  Greenstreet","authorsParsed":[["Dobson","Matthew M.",""],["Schwamb","Megan E.",""],["Fitzsimmons","Alan",""],["Schambeau","Charles",""],["Beck","Aren",""],["Denneau","Larry",""],["Erasmus","Nicolas",""],["Heinze","A. N.",""],["Shingles","Luke J.",""],["Siverd","Robert J.",""],["Smith","Ken W.",""],["Tonry","John L.",""],["Weiland","Henry",""],["Young","David. R.",""],["Kelley","Michael S. P.",""],["Lister","Tim",""],["Bernardinelli","Pedro H.",""],["Ferrais","Marin",""],["Jehin","Emmanuel",""],["Fedorets","Grigori",""],["Benecchi","Susan D.",""],["Verbiscer","Anne J.",""],["Murtagh","Joseph",""],["Duffard","Rene",""],["Gomez","Edward",""],["Chatelain","Joey",""],["Greenstreet","Sarah",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:36:27 GMT"}],"updateDate":"2024-07-22","timestamp":1721403387000,"abstract":"  Centaurs are small Solar System objects on chaotic orbits in the giant planet\nregion, forming an evolutionary continuum with the Kuiper belt objects and\nJupiter-family comets. Some Centaurs are known to exhibit cometary activity,\nthough unlike comets this activity tends not to correlate with heliocentric\ndistance and the mechanism behind it is currently poorly understood. We utilize\nserendipitous observations from the Asteroid Terrestrial-impact Last Alert\nSystem (ATLAS), Zwicky Transient Facility (ZTF), Panoramic Survey Telescope and\nRapid Response System (Pan-STARRS), Dark Energy Survey (DES), and Gaia in\naddition to targeted follow-up observations from the Las Cumbres Observatory,\nTRAnsiting Planets and PlanetesImals Small Telescope South (TRAPPIST-South),\nand Gemini North telescope to analyze an unexpected brightening exhibited by\nthe known active Centaur (2060) Chiron in 2021. This is highly indicative of a\ncometary outburst. As of 2023 February, Chiron has still not returned to its\npre-brightening magnitude. We find Chiron's rotational lightcurve, phase curve\neffects, and possible high-albedo surface features to be unlikely causes of\nthis observed brightening. We consider the most likely cause to be an epoch of\neither new or increased cometary activity, though we cannot rule out a possible\ncontribution from Chiron's reported ring system, such as a collision of as-yet\nunseen satellites shepherding the rings. We find no evidence for coma in our\nGemini or TRAPPIST-South observations, though this does not preclude the\npossibility that Chiron is exhibiting a coma that is too faint for observation\nor constrained to the immediate vicinity of the nucleus.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ErkM7WKcV1XBGK9G7DN6zTO4IPjX7SGUW-iXrQZOGAs","pdfSize":"5769152","objectId":"0x032872a1cfb77095f7d90ba9b85ef5b558d03ffa10963aeaaa8b960018aef8a8","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
