{"id":"2407.17955","title":"Reduction of the downward energy flux of non-thermal electrons in the\n  solar flare corona due to co-spatial return current losses","authors":"Meriem Alaoui and Gordon D. Holman and Marc Swisdak","authorsParsed":[["Alaoui","Meriem",""],["Holman","Gordon D.",""],["Swisdak","Marc",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 11:22:49 GMT"}],"updateDate":"2024-07-26","timestamp":1721906569000,"abstract":"  High energy electrons carry much of a solar flare's energy. Therefore,\nunderstanding changes in electron beam distributions during their propagation\nis crucial. A key focus of this paper is how the co-spatial return current\nreduces the energy flux carried by these accelerated electrons. We\nsystematically compute this reduction for various beam and plasma parameters\nrelevant to solar flares. Our 1D model accounts for collisions between beam and\nplasma electrons, return current electric-field deceleration, thermalization in\na warm target approximation, and runaway electron contributions. The results\nfocus on the classical (Spitzer) regime, offering a valuable benchmark for\nenergy flux reduction and its extent. Return current losses are only negligible\nfor the lowest nonthermal fluxes. We calculate the conditions for return\ncurrent losses to become significant and estimate the extent of the\nmodification to the beam's energy flux density. We also calculate two\nadditional conditions which occur for higher injected fluxes: (1) where runaway\nelectrons become significant, and (2) where current-driven instabilities might\nbecome significant, requiring a model that self-consistently accounts for them.\nCondition (2) is relaxed and the energy flux losses are reduced in the presence\nof runaway electrons. All results are dependent on beam and co-spatial plasma\nparameters. We also examine the importance of the reflection of beam electrons\nby the return-current electric field. We show that the interpretation of a\nnumber of flares needs to be reviewed to account for the effects of return\ncurrents.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Plasma Physics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"DDq6-c4VQ36Bl0kHUJEP9GY-m08Hb7UVOw2S7ZwxBdI","pdfSize":"1265006"}
