{"id":"2407.01934","title":"Single-Ion Spectroscopy of h-BN Point Defect Fluorescence in Liquid\n  Environments","authors":"Yecun Wu, Kun Xu, Hori Pada Sarker, Takashi Taniguchi, Kenji Watanabe,\n  Frank Abild-Pedersen, Arun Majumdar, Yi Cui, Yan-Kai Tzeng, Steven Chu","authorsParsed":[["Wu","Yecun",""],["Xu","Kun",""],["Sarker","Hori Pada",""],["Taniguchi","Takashi",""],["Watanabe","Kenji",""],["Abild-Pedersen","Frank",""],["Majumdar","Arun",""],["Cui","Yi",""],["Tzeng","Yan-Kai",""],["Chu","Steven",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 04:05:54 GMT"}],"updateDate":"2024-07-03","timestamp":1719893154000,"abstract":"  Understanding individual ions in solutions is essential for advancing our\nknowledge of complex chemical systems. However, tracking and detecting ions at\nthe single-ion level in liquid environments remains a challenge. We introduce a\nstrategy for visualization and differentiation of different ions in liquid\nenvironment via point defects in hexagonal boron nitride (h-BN) as the ion\nsensor. Ions interacting with the optically active point defects in h-BN alter\nemission properties, allowing us to capture these changes and visualize single\nions. Using Li+ in organic electrolytes as a model, we observed a spectral\nshift of over 10 nm upon Li+ addition, and an over 50 nm red shift with applied\nelectric fields due to reactions between Li+ and h-BN point defects. Frequency\ndomain analysis further revealed the rapid dynamics of ion migration and the\nslow electrochemical reactions. We further spectroscopically differentiated\nvarious ions (H+, Li+, Na+, K+, Zn2+, Al3+) in aqueous solution. Each ion, with\nits distinct electron cloud configuration, interacts distinctively with the\nelectron clouds of h-BN defects, resulting in specific and identifiable\nspectroscopic signatures. This ion sensing platform enables the direct\nvisualization and differentiation of individual ions in a liquid environment,\noffering insights into chemical reactions at the single-ion level. This\ncapability presents potential applications in various fields involving ions in\nliquids, including but not limited to biology, battery technology, and\nenvironmental science.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"cjpRhgKU6ezRlbPFiynwDZPKxOCgz2xofnTACfPyNcA","pdfSize":"4530532"}
