{"id":"2407.07311","title":"ViTime: A Visual Intelligence-Based Foundation Model for Time Series\n  Forecasting","authors":"Luoxiao Yang, Yun Wang, Xinqi Fan, Israel Cohen, Jingdong Chen, Yue\n  Zhao, Zijun Zhang","authorsParsed":[["Yang","Luoxiao",""],["Wang","Yun",""],["Fan","Xinqi",""],["Cohen","Israel",""],["Chen","Jingdong",""],["Zhao","Yue",""],["Zhang","Zijun",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 02:11:01 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 08:02:39 GMT"}],"updateDate":"2024-08-15","timestamp":1720577461000,"abstract":"  The success of large pretrained models in natural language processing (NLP)\nand computer vision (CV) has opened new avenues for constructing foundation\nmodels for time series forecasting (TSF). Traditional TSF foundation models\nrely heavily on numerical data fitting. In contrast, the human brain is\ninherently skilled at processing visual information, prefer predicting future\ntrends by observing visualized sequences. From a biomimetic perspective,\nutilizing models to directly process numerical sequences might not be the most\neffective route to achieving Artificial General Intelligence (AGI). This paper\nproposes ViTime, a novel Visual Intelligence-based foundation model for TSF.\nViTime overcomes the limitations of numerical time series data fitting by\nutilizing visual data processing paradigms and employs a innovative data\nsynthesis method during training, called Real Time Series (RealTS). Experiments\non a diverse set of previously unseen forecasting datasets demonstrate that\nViTime achieves state-of-the-art zero-shot performance, even surpassing the\nbest individually trained supervised models in some situations. These findings\nsuggest that visual intelligence can significantly enhance time series analysis\nand forecasting, paving the way for more advanced and versatile models in the\nfield. The code for our framework is accessible at\nhttps://github.com/IkeYang/ViTime.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}