{"id":"2407.20836","title":"Vulnerabilities in AI-generated Image Detection: The Challenge of\n  Adversarial Attacks","authors":"Yunfeng Diao, Naixin Zhai, Changtao Miao, Xun Yang, Meng Wang","authorsParsed":[["Diao","Yunfeng",""],["Zhai","Naixin",""],["Miao","Changtao",""],["Yang","Xun",""],["Wang","Meng",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 14:07:17 GMT"}],"updateDate":"2024-07-31","timestamp":1722348437000,"abstract":"  Recent advancements in image synthesis, particularly with the advent of GAN\nand Diffusion models, have amplified public concerns regarding the\ndissemination of disinformation. To address such concerns, numerous\nAI-generated Image (AIGI) Detectors have been proposed and achieved promising\nperformance in identifying fake images. However, there still lacks a systematic\nunderstanding of the adversarial robustness of these AIGI detectors. In this\npaper, we examine the vulnerability of state-of-the-art AIGI detectors against\nadversarial attack under white-box and black-box settings, which has been\nrarely investigated so far. For the task of AIGI detection, we propose a new\nattack containing two main parts. First, inspired by the obvious difference\nbetween real images and fake images in the frequency domain, we add\nperturbations under the frequency domain to push the image away from its\noriginal frequency distribution. Second, we explore the full posterior\ndistribution of the surrogate model to further narrow this gap between\nheterogeneous models, e.g. transferring adversarial examples across CNNs and\nViTs. This is achieved by introducing a novel post-train Bayesian strategy that\nturns a single surrogate into a Bayesian one, capable of simulating diverse\nvictim models using one pre-trained surrogate, without the need for\nre-training. We name our method as frequency-based post-train Bayesian attack,\nor FPBA. Through FPBA, we show that adversarial attack is truly a real threat\nto AIGI detectors, because FPBA can deliver successful black-box attacks across\nmodels, generators, defense methods, and even evade cross-generator detection,\nwhich is a crucial real-world detection scenario.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}