{"id":"2407.07934","title":"Identifying macro conditional independencies and macro total effects in\n  summary causal graphs with latent confounding","authors":"Simon Ferreira and Charles K. Assaad","authorsParsed":[["Ferreira","Simon",""],["Assaad","Charles K.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 16:03:04 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 16:51:13 GMT"},{"version":"v3","created":"Mon, 29 Jul 2024 16:24:45 GMT"}],"updateDate":"2024-07-30","timestamp":1720627384000,"abstract":"  Understanding causal relations in dynamic systems is essential in\nepidemiology. While causal inference methods have been extensively studied,\nthey often rely on fully specified causal graphs, which may not always be\navailable in complex dynamic systems. Partially specified causal graphs, such\nas summary causal graphs (SCGs), provide a simplified representation of causal\nrelations, omitting temporal information and focusing on high-level causal\nstructures. This simplification introduces new challenges concerning the types\nof queries of interest: macro queries, which involve relationships between\nclusters represented as vertices in the graph, and micro queries, which pertain\nto relationships between variables that are not directly visible through the\nvertices of the graph. In this paper, we first clearly distinguish between\nmacro conditional independencies and micro conditional independencies and\nbetween macro total effects and micro total effects. Then, we demonstrate the\nsoundness and completeness of the d-separation to identify macro conditional\nindependencies in SCGs. Furthermore, we establish that the do-calculus is sound\nand complete for identifying macro total effects in SCGs. Finally, we give a\ngraphical characterization for the non-identifiability of macro total effects\nin SCGs.\n","subjects":["Statistics/Methodology","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7rGNYsLdRwg_LxyZP01oTCN5BrM1OVdDxhrgEPU7oIM","pdfSize":"245732"}
