{"id":"2407.21702","title":"FNet II: Spectral Classification of Quasars, Galaxies, Stars, and broad\n  absorption line (BAL) Quasars","authors":"R. Moradi, F. Rastegarnia, Y. Wang, M. T. Mirtorabi","authorsParsed":[["Moradi","R.",""],["Rastegarnia","F.",""],["Wang","Y.",""],["Mirtorabi","M. T.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:49:53 GMT"}],"updateDate":"2024-08-01","timestamp":1722440993000,"abstract":"  In this work, we enhance the FNet, a 1-dimensional convolutional neural\nnetwork (CNN) with a residual neural network (ResNet) architecture, to perform\nspectral classification of quasars, galaxies, stars, and broad absorption line\n(BAL)-quasars in the SDSS-IV catalog from DR17 of eBOSS. Leveraging its\nconvolutional layers and the ResNet structure with different kernel sizes, FNet\nautonomously identifies various patterns within the entire sample of spectra.\nSince FNet does not require the intermediate step of identifying specific\nlines, a simple modification enabled our current network to classify all SDSS\nspectra. This modification involves changing the final output layer from a\nsingle value (redshift) to multiple values (probabilities of all classes), and\naccordingly adjusting the loss function from mean squared error (MSE) to\ncross-entropy. FNet achieves a completeness of 99.00\\% $\\pm$ 0.20 for galaxies,\n98.50\\% $\\pm$ 0.30 for quasars, 99.00\\% $\\pm$ 0.18 for BAL-quasars, and 98.80\\%\n$\\pm$ 0.20 for stars. These results are comparable to those obtained using\nQuasarNET, a standard CNN employed in the SDSS routine, comprises convolutional\nlayers without the ResNet structure with equal kernel sizes, and is utilized\nfor redshift measurement and classification by identifying seven emission\nlines. QuasarNET, in order to overcome the problem of finding a CIV emission\nline with broad absorption which is slightly more challenging than that of\ndetecting emission lines requires to add BAL CIV line to the list of lines that\nthe network learns to identify. However, this procedure is not necessary in\nFNet as it learns the features through a self-learning procedure.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}