{"id":"2407.17961","title":"Numerical simulations of exocomet transits: Insights from \\{beta} Pic\n  and KIC 3542116","authors":"I. Luk'yanyk (AO of TSKU), I.Kulyk (MAO NAO of Ukraine), O.Shubina\n  (IA, Slovac AS), Ya. Pavlenko (MAO, IAC), M. Vasylenko (MAO), D. Dobrycheva\n  (MAO), and P. Korsun (MAO)","authorsParsed":[["Luk'yanyk","I.","","AO of TSKU"],["Kulyk","I.","","MAO NAO of Ukraine"],["Shubina","O.","","IA, Slovac AS"],["Pavlenko","Ya.","","MAO, IAC"],["Vasylenko","M.","","MAO"],["Dobrycheva","D.","","MAO"],["Korsun","P.","","MAO"]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 11:31:52 GMT"},{"version":"v2","created":"Sun, 28 Jul 2024 18:31:14 GMT"}],"updateDate":"2024-07-30","timestamp":1721907112000,"abstract":"  In recent years, the topic of existence and exploration of exocomets has been\ngaining increasing attention. The asymmetrical decrease in the stellar\nbrightness due to the passage of a comet-like object in front of the star was\nsuccessfully predicted. It was subsequently confirmed on the basis of the light\ncurves of stars observed by Kepler and TESS orbital telescopes. Since then,\nthere have been successful attempts to fit the asymmetrical dips observed in\nthe stellar light curves utilizing a simple 1D model of an exponentially\ndecaying optically thin dust tail. In this work, we propose fitting the\nphotometric profiles of some known exocomet transits based on a Monte Carlo\napproach to build up the distribution of dust particles in a cometary tail. As\nthe exocomet prototypes, we used the physical properties of certain Solar\nSystem comets belonging to the different dynamical groups and moving at\nheliocentric distances of 0.6 au, 1.0 au, 5.0 au, and 5.5 au. We obtained a\ngood agreement between the observed and modeled transit light curves. We also\nshow that the physical characteristics of dust particles, such as the particle\nsize range, the power index of dust size distribution, the particle terminal\nvelocity, and distance to the host star affect the shape of the transit light\ncurve, while the dust productivity of the comet nucleus and the impact\nparameter influence its depth and duration. The estimated dust production rates\nof the transiting exocomets are at the level of the most active Solar System\ncomets.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}