{"id":"2407.17587","title":"S-E Pipeline: A Vision Transformer (ViT) based Resilient Classification\n  Pipeline for Medical Imaging Against Adversarial Attacks","authors":"Neha A S, Vivek Chaturvedi, Muhammad Shafique","authorsParsed":[["S","Neha A",""],["Chaturvedi","Vivek",""],["Shafique","Muhammad",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:20:40 GMT"}],"updateDate":"2024-07-26","timestamp":1721755240000,"abstract":"  Vision Transformer (ViT) is becoming widely popular in automating accurate\ndisease diagnosis in medical imaging owing to its robust self-attention\nmechanism. However, ViTs remain vulnerable to adversarial attacks that may\nthwart the diagnosis process by leading it to intentional misclassification of\ncritical disease. In this paper, we propose a novel image classification\npipeline, namely, S-E Pipeline, that performs multiple pre-processing steps\nthat allow ViT to be trained on critical features so as to reduce the impact of\ninput perturbations by adversaries. Our method uses a combination of\nsegmentation and image enhancement techniques such as Contrast Limited Adaptive\nHistogram Equalization (CLAHE), Unsharp Masking (UM), and High-Frequency\nEmphasis filtering (HFE) as preprocessing steps to identify critical features\nthat remain intact even after adversarial perturbations. The experimental study\ndemonstrates that our novel pipeline helps in reducing the effect of\nadversarial attacks by 72.22% for the ViT-b32 model and 86.58% for the ViT-l32\nmodel. Furthermore, we have shown an end-to-end deployment of our proposed\nmethod on the NVIDIA Jetson Orin Nano board to demonstrate its practical use\ncase in modern hand-held devices that are usually resource-constrained.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"kyhI29KDLQo6FXXfoUTTnWacELYoE_x3GAWN6v42dGk","pdfSize":"5035848","objectId":"0x0f4ce713fe4236e3cca797f46bd7bf53f2c444f8b93ef965d0895b0d6179f5ad","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
