{"id":"2407.02864","title":"A quantum approach for optimal control","authors":"Hirmay Sandesara, Alok Shukla and Prakash Vedula","authorsParsed":[["Sandesara","Hirmay",""],["Shukla","Alok",""],["Vedula","Prakash",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 07:24:04 GMT"},{"version":"v2","created":"Thu, 4 Jul 2024 07:14:55 GMT"}],"updateDate":"2024-07-08","timestamp":1719991444000,"abstract":"  In this work, we propose a novel variational quantum approach for solving a\nclass of nonlinear optimal control problems. Our approach integrates Dirac's\ncanonical quantization of dynamical systems with the solution of the ground\nstate of the resulting non-Hermitian Hamiltonian via a variational quantum\neigensolver (VQE). We introduce a new perspective on the Dirac bracket\nformulation for generalized Hamiltonian dynamics in the presence of\nconstraints, providing a clear motivation and illustrative examples.\nAdditionally, we explore the structural properties of Dirac brackets within the\ncontext of multidimensional constrained optimization problems.\n  Our approach for solving a class of nonlinear optimal control problems\nemploys a VQE-based approach to determine the eigenstate and corresponding\neigenvalue associated with the ground state energy of a non-Hermitian\nHamiltonian. Assuming access to an ideal VQE, our formulation demonstrates\nexcellent results, as evidenced by selected computational examples.\nFurthermore, our method performs well when combined with a VQE-based approach\nfor non-Hermitian Hamiltonian systems. Our VQE-based formulation effectively\naddresses challenges associated with a wide range of optimal control problems,\nparticularly in high-dimensional scenarios. Compared to standard classical\napproaches, our quantum-based method shows significant promise and offers a\ncompelling alternative for tackling complex, high-dimensional optimization\nchallenges.\n","subjects":["Physics/Quantum Physics","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}