{"id":"2407.00231","title":"Bridging Large Eddy Simulation and Reduced Order Modeling of\n  Convection-Dominated Flows through Spatial Filtering: Review and Perspectives","authors":"Annalisa Quaini, Omer San, Alessandro Veneziani, Traian Iliescu","authorsParsed":[["Quaini","Annalisa",""],["San","Omer",""],["Veneziani","Alessandro",""],["Iliescu","Traian",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 21:04:29 GMT"}],"updateDate":"2024-07-02","timestamp":1719608669000,"abstract":"  Reduced order models (ROMs) have achieved a lot of success in reducing the\ncomputational cost of traditional numerical methods across many disciplines.\nFor convection-dominated (e.g., turbulent) flows, however, standard ROMs\ngenerally yield inaccurate results, usually affected by spurious oscillations.\nThus, ROMs are usually equipped with numerical stabilization or closure models\nto account for the effect of the discarded modes. The literature on ROM\nclosures and stabilizations is large and growing fast. In this paper, we focus\non one particular type of ROM closures and stabilizations that are inspired by\nLarge Eddy Simulation (LES). These ROMs, which we call LES-ROMs, are extremely\neasy to implement, very efficient, and accurate. Carefully tuned LES-ROMs can\naccurately capture the average physical quantities of interest in challenging\nconvection-dominated flows in many applications. LES-ROM are constructed by\nleveraging spatial filtering, i.e., the same principle used to build classical\nLES models. This ensures a modeling consistency between LES-ROMs and the\napproaches that generated the data used to train them. It also ``bridges'' two\ndistinct research fields (LES and ROMs), disconnected until now. This paper is\na review of LES-ROMs. It starts with a description of a versatile LES strategy\ncalled evolve-filter-relax (EFR) that has been successfully used as a full\norder method. We then show how the EFR strategy, and spatial filtering in\ngeneral, can be leveraged to construct LES-ROMs. Several applications of\nLES-ROMs are presented. Finally, we draw conclusions and outline several\nresearch directions and open questions in the LES-ROM development. While we do\nnot claim this review to be comprehensive, we certainly hope it serves as a\nbrief and friendly introduction to this exciting research area, which has a lot\nof potential in practical numerical simulation of convection-dominated flows.\n","subjects":["Physics/Fluid Dynamics","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}