{"id":"2407.15380","title":"Iterative approach to reconstructing neural disparity fields from\n  light-field data","authors":"Ligen Shi, Chang Liu, Xing Zhao, and Jun Qiu","authorsParsed":[["Shi","Ligen",""],["Liu","Chang",""],["Zhao","Xing",""],["Qiu","Jun",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 05:06:06 GMT"}],"updateDate":"2024-07-23","timestamp":1721624766000,"abstract":"  This study proposes a neural disparity field (NDF) that establishes an\nimplicit, continuous representation of scene disparity based on a neural field\nand an iterative approach to address the inverse problem of NDF reconstruction\nfrom light-field data. NDF enables seamless and precise characterization of\ndisparity variations in three-dimensional scenes and can discretize disparity\nat any arbitrary resolution, overcoming the limitations of traditional\ndisparity maps that are prone to sampling errors and interpolation\ninaccuracies. The proposed NDF network architecture utilizes hash encoding\ncombined with multilayer perceptrons to capture detailed disparities in texture\nlevels, thereby enhancing its ability to represent the geometric information of\ncomplex scenes. By leveraging the spatial-angular consistency inherent in\nlight-field data, a differentiable forward model to generate a central view\nimage from the light-field data is developed. Based on the forward model, an\noptimization scheme for the inverse problem of NDF reconstruction using\ndifferentiable propagation operators is established. Furthermore, an iterative\nsolution method is adopted to reconstruct the NDF in the optimization scheme,\nwhich does not require training datasets and applies to light-field data\ncaptured by various acquisition methods. Experimental results demonstrate that\nhigh-quality NDF can be reconstructed from light-field data using the proposed\nmethod. High-resolution disparity can be effectively recovered by NDF,\ndemonstrating its capability for the implicit, continuous representation of\nscene disparities.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}