{"id":"2407.03009","title":"Model Guidance via Explanations Turns Image Classifiers into\n  Segmentation Models","authors":"Xiaoyan Yu, Jannik Franzen, Wojciech Samek, Marina M.-C. H\\\"ohne,\n  Dagmar Kainmueller","authorsParsed":[["Yu","Xiaoyan",""],["Franzen","Jannik",""],["Samek","Wojciech",""],["Höhne","Marina M. -C.",""],["Kainmueller","Dagmar",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 11:10:23 GMT"}],"updateDate":"2024-07-04","timestamp":1720005023000,"abstract":"  Heatmaps generated on inputs of image classification networks via explainable\nAI methods like Grad-CAM and LRP have been observed to resemble segmentations\nof input images in many cases. Consequently, heatmaps have also been leveraged\nfor achieving weakly supervised segmentation with image-level supervision. On\nthe other hand, losses can be imposed on differentiable heatmaps, which has\nbeen shown to serve for (1)~improving heatmaps to be more human-interpretable,\n(2)~regularization of networks towards better generalization, (3)~training\ndiverse ensembles of networks, and (4)~for explicitly ignoring confounding\ninput features. Due to the latter use case, the paradigm of imposing losses on\nheatmaps is often referred to as \"Right for the right reasons\". We unify these\ntwo lines of research by investigating semi-supervised segmentation as a novel\nuse case for the Right for the Right Reasons paradigm. First, we show formal\nparallels between differentiable heatmap architectures and standard\nencoder-decoder architectures for image segmentation. Second, we show that such\ndifferentiable heatmap architectures yield competitive results when trained\nwith standard segmentation losses. Third, we show that such architectures allow\nfor training with weak supervision in the form of image-level labels and small\nnumbers of pixel-level labels, outperforming comparable encoder-decoder models.\nCode is available at \\url{https://github.com/Kainmueller-Lab/TW-autoencoder}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}