{"id":"2407.19116","title":"A Novel Gaussian filter-based Pressure Correction Technique with Super\n  Compact Scheme for Unsteady 3D Incompressible, Viscous Flows","authors":"Ashwani Punia and Rajendra K. Ray","authorsParsed":[["Punia","Ashwani",""],["Ray","Rajendra K.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 22:39:14 GMT"}],"updateDate":"2024-07-30","timestamp":1722033554000,"abstract":"  This work deals with a novel Gaussian filter-based pressure correction\ntechnique with a super compact higher order finite difference scheme for\nsolving unsteady three-dimensional (3D) incompressible, viscous flows. This\npressure correction technique offers significant advantages in terms of\noptimizing computational time by taking minimum iterations to reach the\nrequired accuracy, making it highly efficient and cost-effective. Pressure\nfields often exhibit highly nonlinear behavior, and employing the Gaussian\nfilter can help to enhance their reliability by reducing noise and\nuncertainties. On the other hand, the super compact scheme uses minimum grid\npoints to produce second-order accuracy in time and fourth-order accuracy in\nspace variables. The main focus of this study is to enhance the accuracy and\nefficiency and minimize the computational cost of solving complex fluid flow\nproblems. The super compact scheme utilizes 19 grid points at the known time\nlevel (i.e., $n^{th}$ time level) and only seven grid points from the unknown\ntime level (i.e., $n + 1$ time level). By employing the above strategies, it\nbecomes possible to notably decrease computational expenses while maintaining\nthe accuracy of the computational scheme for solving complex fluid flow\nproblems. We have implemented our methodology across three distinct scenarios:\nthe 3D Burger's equation having analytical solution, and two variations of the\nlid-driven cavity problem. The outcomes of our numerical simulations exhibit a\nremarkable concordance, aligning exceptionally well with both the analytical\nbenchmarks and previously validated numerical findings for the cavity problems.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}