{"id":"2407.14034","title":"SpIRIT Mission: In-Orbit Results and Technology Demonstrations","authors":"Michele Trenti (1), Miguel Ortiz del Castillo (1), Robert Mearns (1),\n  Jack McRobbie (1), Clint Therakam (1), Airlie Chapman (1), Andrew Woods (1),\n  Jonathan Morgan (1), Simon Barraclough (1), Ivan Rodriguez Mallo (1), Giulia\n  Baroni (2), Fabrizio Fiore (2), Yuri Evangelista (2), Riccardo Campana (2),\n  Alejandro Guzman (3), Paul Hedderman (3) ((1) The University of Melbourne,\n  (2) Italian National Institute of Astrophysics, (3)\n  Eberhard-Karls-Universitaet Tuebingen)","authorsParsed":[["Trenti","Michele",""],["del Castillo","Miguel Ortiz",""],["Mearns","Robert",""],["McRobbie","Jack",""],["Therakam","Clint",""],["Chapman","Airlie",""],["Woods","Andrew",""],["Morgan","Jonathan",""],["Barraclough","Simon",""],["Mallo","Ivan Rodriguez",""],["Baroni","Giulia",""],["Fiore","Fabrizio",""],["Evangelista","Yuri",""],["Campana","Riccardo",""],["Guzman","Alejandro",""],["Hedderman","Paul",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 05:13:35 GMT"}],"updateDate":"2024-07-22","timestamp":1721366015000,"abstract":"  The Space Industry Responsive Intelligent Thermal (SpIRIT) 6U CubeSat is a\nmission led by The University of Melbourne in cooperation with the Italian\nSpace Agency. Launched in a 510 km Polar Sun Synchronous Orbit in December\n2023, SpIRIT carries multiple subsystems for scientific and technology\ndemonstration. The main payload is the HERMES instrument for detection of\nhigh-energy astrophysics transients (Gamma Ray Bursts), and for studies of\ntheir variability at scales below 1 ms. The satellite includes a novel thermal\nmanagement system for its class, based on a Stirling-cycle cooler and\ndeployable thermal radiator, designed to cool HERMES to reduce instrumental\nbackground noise. A low-latency communication subsystem based on a sat-phone\nnetwork is supporting rapid transmission of time-critical data and\ntelecommands. SpIRIT is also equipped with a set of RGB and thermal IR cameras,\nconnected to an on-board image processing unit with artificial intelligence\ncapabilities for autonomous feature recognition. To effectively manage all\ninterfaces between different subsystems and mission stakeholders, the\nUniversity of Melbourne developed an instrument control unit (PMS) which\noperates all payloads. PMS also provides backup uninterruptible power to the\nHERMES instrument through a supercapacitor-based UPS for safe instrument\nshutdown in case of platform power interruptions. This paper first presents a\nmission and payload overview, and early in-orbit results, along with lessons\nlearned throughout the mission. This work not only sheds light on the novelty\nof some of the on-board technologies onboard and on their potential impact to\nenable greater utilization of CubeSats for scientific missions, but also offers\ninsights into the practical challenges and accomplishments related to\ndeveloping and operating a multi-organization CubeSat with a complex array of\ninstruments and systems.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}