{"id":"2407.06363","title":"Leveraging image captions for selective whole slide image annotation","authors":"Jingna Qiu, Marc Aubreville, Frauke Wilm, Mathias \\\"Ottl, Jonas Utz,\n  Maja Schlereth and Katharina Breininger","authorsParsed":[["Qiu","Jingna",""],["Aubreville","Marc",""],["Wilm","Frauke",""],["Öttl","Mathias",""],["Utz","Jonas",""],["Schlereth","Maja",""],["Breininger","Katharina",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 20:05:21 GMT"}],"updateDate":"2024-07-10","timestamp":1720469121000,"abstract":"  Acquiring annotations for whole slide images (WSIs)-based deep learning\ntasks, such as creating tissue segmentation masks or detecting mitotic figures,\nis a laborious process due to the extensive image size and the significant\nmanual work involved in the annotation. This paper focuses on identifying and\nannotating specific image regions that optimize model training, given a limited\nannotation budget. While random sampling helps capture data variance by\ncollecting annotation regions throughout the WSIs, insufficient data curation\nmay result in an inadequate representation of minority classes. Recent studies\nproposed diversity sampling to select a set of regions that maximally represent\nunique characteristics of the WSIs. This is done by pretraining on unlabeled\ndata through self-supervised learning and then clustering all regions in the\nlatent space. However, establishing the optimal number of clusters can be\ndifficult and not all clusters are task-relevant. This paper presents prototype\nsampling, a new method for annotation region selection. It discovers regions\nexhibiting typical characteristics of each task-specific class. The process\nentails recognizing class prototypes from extensive histopathology\nimage-caption databases and detecting unlabeled image regions that resemble\nthese prototypes. Our results show that prototype sampling is more effective\nthan random and diversity sampling in identifying annotation regions with\nvaluable training information, resulting in improved model performance in\nsemantic segmentation and mitotic figure detection tasks. Code is available at\nhttps://github.com/DeepMicroscopy/Prototype-sampling.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}