{"id":"2407.14338","title":"Star Formation in Extreme Environments: A 200 pc High Velocity Gas\n  Stream in the Galactic Centre","authors":"V. S. Veena, W.-J. Kim, Alvaro Sanchez-Monge, P. Schilke, K. M.\n  Menten, G. A. Fuller, M. C. Sormani, F. Wyrowski, W. E. Banda-Barragan, D.\n  Riquelme, P. Tarrio, P. de Vicente","authorsParsed":[["Veena","V. S.",""],["Kim","W. -J.",""],["Sanchez-Monge","Alvaro",""],["Schilke","P.",""],["Menten","K. M.",""],["Fuller","G. A.",""],["Sormani","M. C.",""],["Wyrowski","F.",""],["Banda-Barragan","W. E.",""],["Riquelme","D.",""],["Tarrio","P.",""],["de Vicente","P.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 14:18:12 GMT"}],"updateDate":"2024-09-11","timestamp":1721398692000,"abstract":"  The expanding molecular ring (EMR) manifests itself as a parallelogram in the\nposition-velocity diagram of spectral line emission from the Central Molecular\nZone (CMZ) surrounding the Galacic centre (GC). Using multiwavelength data, we\ninvestigate the gas kinematics, star formation activity, and the presence of\nshocked gas in a 200 pc long high velocity gas stream (V~ +150 km/s) with a\ndouble helix morphology named the helix stream, that is located 15-55 pc above\nthe CMZ and is kinematically associated with the EMR/parallelogram. We carried\nout molecular line observations using the IRAM 30m, Yebes 40m, and APEX 12m\ntelescopes. The detection of four rotational transitions of the SiO molecule\nindicate the presence of shocks. We derived the SiO column densities and\nabundances in different regions of the helix stream. The presence of\nprotostellar clumps and a candidate HII region signify the ongoing star\nformation activity within the helix stream. The cloud is massive (2.5x10^6\nM_sun) and highly turbulent. We find evidence of cloud-cloud collisions towards\nthe eastern edge (l~1.3{\\deg}), suggesting a dynamic interaction with the CMZ.\nAn expanding shell is detected within the cloud with radius of 6.7 pc and an\nexpansion velocity of 35 km/s. The shell might be powered by several supernovae\nor a single hypernova. The SiO abundance within the helix stream implies\nextensive shock processes occurring on large scales. The helical or cork-screw\nvelocity structure of the helix stream indicates twisting and turning motions\nwithin the cloud. We propose that the helix stream is the continuation of the\nnear side bar lane, that is overshooting after brushing the CMZ. Our findings\ncarry profound implications for understanding star formation in extreme\nconditions and elucidate the intricate properties of gas and dust associated\nwith nuclear inflows in barred spiral galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}