{"id":"2407.17023","title":"From Internal Conflict to Contextual Adaptation of Language Models","authors":"Sara Vera Marjanovi\\'c, Haeun Yu, Pepa Atanasova, Maria Maistro,\n  Christina Lioma, Isabelle Augenstein","authorsParsed":[["Marjanović","Sara Vera",""],["Yu","Haeun",""],["Atanasova","Pepa",""],["Maistro","Maria",""],["Lioma","Christina",""],["Augenstein","Isabelle",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 06:06:07 GMT"}],"updateDate":"2024-07-25","timestamp":1721801167000,"abstract":"  Knowledge-intensive language understanding tasks require Language Models\n(LMs) to integrate relevant context, mitigating their inherent weaknesses, such\nas incomplete or outdated knowledge. Nevertheless, studies indicate that LMs\noften ignore the provided context as it can conflict with the pre-existing LM's\nmemory learned during pre-training. Moreover, conflicting knowledge can already\nbe present in the LM's parameters, termed intra-memory conflict. Existing works\nhave studied the two types of knowledge conflicts only in isolation. We\nconjecture that the (degree of) intra-memory conflicts can in turn affect LM's\nhandling of context-memory conflicts. To study this, we introduce the DYNAMICQA\ndataset, which includes facts with a temporal dynamic nature where a fact can\nchange with a varying time frequency and disputable dynamic facts, which can\nchange depending on the viewpoint. DYNAMICQA is the first to include real-world\nknowledge conflicts and provide context to study the link between the different\ntypes of knowledge conflicts. With the proposed dataset, we assess the use of\nuncertainty for measuring the intra-memory conflict and introduce a novel\nCoherent Persuasion (CP) score to evaluate the context's ability to sway LM's\nsemantic output. Our extensive experiments reveal that static facts, which are\nunlikely to change, are more easily updated with additional context, relative\nto temporal and disputable facts.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}