{"id":"2407.16099","title":"Counter-monotonic risk allocations and distortion risk measures","authors":"Mario Ghossoub, Qinghua Ren, Ruodu Wang","authorsParsed":[["Ghossoub","Mario",""],["Ren","Qinghua",""],["Wang","Ruodu",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 23:44:19 GMT"}],"updateDate":"2024-07-24","timestamp":1721691859000,"abstract":"  In risk-sharing markets with aggregate uncertainty, characterizing\nPareto-optimal allocations when agents might not be risk averse is a\nchallenging task, and the literature has only provided limited explicit results\nthus far. In particular, Pareto optima in such a setting may not necessarily be\ncomonotonic, in contrast to the case of risk-averse agents. In fact, when\nmarket participants are risk-seeking, Pareto-optimal allocations are\ncounter-monotonic. Counter-monotonicity of Pareto optima also arises in some\nsituations for quantile-optimizing agents. In this paper, we provide a\nsystematic study of efficient risk sharing in markets where allocations are\nconstrained to be counter-monotonic. The preferences of the agents are modelled\nby a common distortion risk measure, or equivalently, by a common Yaari dual\nutility. We consider three different settings: risk-averse agents, risk-seeking\nagents, and those with an inverse S-shaped distortion function. In each case,\nwe provide useful characterizations of optimal allocations, for both the\ncounter-monotonic market and the unconstrained market. To illustrate our\nresults, we consider an application to a portfolio choice problem for a\nportfolio manager tasked with managing the investments of a group of clients,\nwith varying levels of risk aversion or risk seeking. We determine explicitly\nthe optimal investment strategies in this case. Our results confirm the\nintuition that a manager investing on behalf of risk-seeking agents tends to\ninvest more in risky assets than a manager acting on behalf of risk-averse\nagents.\n","subjects":["Quantitative Finance/Risk Management"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}