{"id":"2407.09356","title":"Bipartizing (Pseudo-)Disk Graphs: Approximation with a Ratio Better than\n  3","authors":"Daniel Lokshtanov, Fahad Panolan, Saket Saurabh, Jie Xue, Meirav\n  Zehavi","authorsParsed":[["Lokshtanov","Daniel",""],["Panolan","Fahad",""],["Saurabh","Saket",""],["Xue","Jie",""],["Zehavi","Meirav",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 15:29:23 GMT"}],"updateDate":"2024-07-15","timestamp":1720798163000,"abstract":"  In a disk graph, every vertex corresponds to a disk in $\\mathbb{R}^2$ and two\nvertices are connected by an edge whenever the two corresponding disks\nintersect. Disk graphs form an important class of geometric intersection\ngraphs, which generalizes both planar graphs and unit-disk graphs. We study a\nfundamental optimization problem in algorithmic graph theory, Bipartization\n(also known as Odd Cycle Transversal), on the class of disk graphs. The goal of\nBipartization is to delete a minimum number of vertices from the input graph\nsuch that the resulting graph is bipartite. A folklore (polynomial-time)\n$3$-approximation algorithm for Bipartization on disk graphs follows from the\nclassical framework of Goemans and Williamson [Combinatorica'98] for\ncycle-hitting problems. For over two decades, this result has remained the best\nknown approximation for the problem (in fact, even for Bipartization on\nunit-disk graphs). In this paper, we achieve the first improvement upon this\nresult, by giving a $(3-\\alpha)$-approximation algorithm for Bipartization on\ndisk graphs, for some constant $\\alpha>0$. Our algorithm directly generalizes\nto the broader class of pseudo-disk graphs. Furthermore, our algorithm is\nrobust in the sense that it does not require a geometric realization of the\ninput graph to be given.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Computational Geometry"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"h6vGnst6ZMv7UJM25Ez-CcvVfWVSFMDt6kC9IBU4zRI","pdfSize":"511004","objectId":"0x01ac5532abd43513b2ac974c7a702a1821ab106d56c908590f6e752be3223e06","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
