{"id":"2407.16817","title":"Harmonic maps from post-critically finite fractals to the circle","authors":"Georgi S. Medvedev, Matthew S. Mizuhara","authorsParsed":[["Medvedev","Georgi S.",""],["Mizuhara","Matthew S.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 20:07:18 GMT"}],"updateDate":"2024-07-25","timestamp":1721765238000,"abstract":"  Every continuous map between two compact Riemannian manifolds is homotopic to\na harmonic map (HM). We show that a similar situation holds for continuous maps\nbetween a post-critically finite (p.c.f.) fractal and a circle. Specifically,\nwe provide a geometric proof of Strichartz's theorem stating that for a given\ndegree and appropriate boundary conditions there is a unique HM from the\nSierpinski Gasket (SG) to a circle. Furthermore, we extend this result to HMs\non p.c.f. fractals.\n  Our method uses covering spaces for the SG, which are constructed separately\nfor HMs of a given degree, thus capturing the topology intrinsic to each\nhomotopy class. After lifting continuous functions on the SG with values in the\nunit circle to continuous real-valued functions on the covering space, we use\nthe harmonic extension algorithm to obtain a harmonic function on the covering\nspace. The desired HM is obtained by restricting the domain of the resultant\nharmonic function to the fundamental domain and projecting the range to the\ncircle.\n  We show that with suitable modifications the method applies to p.c.f.\nfractals, a large class of self-similar domains. We illustrate our method of\nconstructing the HMs using numerical examples of HMs from the SG to the circle\nand discuss the construction of the covering spaces for several representative\np.c.f. fractals, including the 3-level SG, the hexagasket, and the pentagasket.\n","subjects":["Physics/Mathematical Physics","Computing Research Repository/Numerical Analysis","Mathematics/Analysis of PDEs","Mathematics/Mathematical Physics","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}