{"id":"2407.02834","title":"Aspect-Based Sentiment Analysis Techniques: A Comparative Study","authors":"Dineth Jayakody, Koshila Isuranda, A V A Malkith, Nisansa de Silva,\n  Sachintha Rajith Ponnamperuma, G G N Sandamali, K L K Sudheera","authorsParsed":[["Jayakody","Dineth",""],["Isuranda","Koshila",""],["Malkith","A V A",""],["de Silva","Nisansa",""],["Ponnamperuma","Sachintha Rajith",""],["Sandamali","G G N",""],["Sudheera","K L K",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 06:21:07 GMT"},{"version":"v2","created":"Thu, 4 Jul 2024 12:57:37 GMT"}],"updateDate":"2024-07-08","timestamp":1719987667000,"abstract":"  Since the dawn of the digitalisation era, customer feedback and online\nreviews are unequivocally major sources of insights for businesses.\nConsequently, conducting comparative analyses of such sources has become the de\nfacto modus operandi of any business that wishes to give itself a competitive\nedge over its peers and improve customer loyalty. Sentiment analysis is one\nsuch method instrumental in gauging public interest, exposing market trends,\nand analysing competitors. While traditional sentiment analysis focuses on\noverall sentiment, as the needs advance with time, it has become important to\nexplore public opinions and sentiments on various specific subjects, products\nand services mentioned in the reviews on a finer-granular level. To this end,\nAspect-based Sentiment Analysis (ABSA), supported by advances in Artificial\nIntelligence (AI) techniques which have contributed to a paradigm shift from\nsimple word-level analysis to tone and context-aware analyses, focuses on\nidentifying specific aspects within the text and determining the sentiment\nassociated with each aspect. In this study, we compare several deep-NN methods\nfor ABSA on two benchmark datasets (Restaurant14 and Laptop-14) and found that\nFAST LSA obtains the best overall results of 87.6% and 82.6% accuracy but does\nnot pass LSA+DeBERTa which reports 90.33% and 86.21% accuracy respectively.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}