{"id":"2407.06147","title":"Prevalence of a growth mindset among introductory astronomy students","authors":"Moire K. M. Prescott (1), Laura Madson (1), Sandra M. Way (1), and\n  Kelly N. Sanderson (1) ((1) New Mexico State University)","authorsParsed":[["Prescott","Moire K. M.","","New Mexico State University"],["Madson","Laura","","New Mexico State University"],["Way","Sandra M.","","New Mexico State University"],["Sanderson","Kelly N.","","New Mexico State University"]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:20:11 GMT"}],"updateDate":"2024-07-09","timestamp":1720459211000,"abstract":"  While many previous studies have indicated that encouraging a growth mindset\ncan improve student learning outcomes, this conclusion's applicability to\ncollege-level astronomy classrooms remains poorly understood owing to the\nvariation in students' overall and domain-specific learning attitudes. To\naddress this, we surveyed undergraduate students in an introductory astronomy\nclass about their attitudes towards learning astronomy over the course of five\nsemesters. Overall, students felt an affinity for astronomy, felt moderately\ncompetent, perceived astronomy to be intermediate in terms of difficulty, and\nagreed strongly with standard statements reflecting a \"growth mindset,\" i.e.,\nthe belief that intelligence is malleable rather than fixed from birth. Their\nresponses were stable over the course of the semester and did not appear to\ndepend strongly on student demographics. The unexpected start of the COVID-19\npandemic and the associated shift to all-virtual learning correlated with a\ndrop in their affinity for astronomy, a small decrease in their perceived\ncompetence, and an increase in the perceived difficulty of the topic. Their\noverall learning mindset showed negligible change during this time, emphasizing\nthe stability of their belief in a growth mindset as compared to other measured\nlearning attitudes. However, more nuanced questions about their behaviors and\ninterpretations in the classroom, about how they felt \"in the moment\", and\nabout what factors were most important for their success in the class revealed\nsignificantly lower alignment with a growth mindset. This suggests that while\nintroductory astronomy students may believe that they have a growth mindset,\nthis mindset is not necessarily reflected in their self-reported classroom\nbehaviors or measured responses to actual learning challenges.\n","subjects":["Physics/Physics Education"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}