{"id":"2407.15871","title":"Semantic Prototypes: Enhancing Transparency Without Black Boxes","authors":"Orfeas Menis-Mastromichalakis, Giorgos Filandrianos, Jason Liartis,\n  Edmund Dervakos, Giorgos Stamou","authorsParsed":[["Menis-Mastromichalakis","Orfeas",""],["Filandrianos","Giorgos",""],["Liartis","Jason",""],["Dervakos","Edmund",""],["Stamou","Giorgos",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 18:42:58 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 16:37:52 GMT"},{"version":"v3","created":"Mon, 19 Aug 2024 15:58:03 GMT"}],"updateDate":"2024-08-20","timestamp":1721328178000,"abstract":"  As machine learning (ML) models and datasets increase in complexity, the\ndemand for methods that enhance explainability and interpretability becomes\nparamount. Prototypes, by encapsulating essential characteristics within data,\noffer insights that enable tactical decision-making and enhance transparency.\nTraditional prototype methods often rely on sub-symbolic raw data and opaque\nlatent spaces, reducing explainability and increasing the risk of\nmisinterpretations. This paper presents a novel framework that utilizes\nsemantic descriptions to define prototypes and provide clear explanations,\neffectively addressing the shortcomings of conventional methods. Our approach\nleverages concept-based descriptions to cluster data on the semantic level,\nensuring that prototypes not only represent underlying properties intuitively\nbut are also straightforward to interpret. Our method simplifies the\ninterpretative process and effectively bridges the gap between complex data\nstructures and human cognitive processes, thereby enhancing transparency and\nfostering trust. Our approach outperforms existing widely-used prototype\nmethods in facilitating human understanding and informativeness, as validated\nthrough a user survey.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"WYnpNDd660ZzZU6-va2EKwj7FiKvOjYOI3pKSCHY0WA","pdfSize":"1987856"}
