{"id":"2407.04366","title":"Nash epidemics","authors":"Simon K. Schnyder, John J. Molina, Ryoichi Yamamoto, Matthew S. Turner","authorsParsed":[["Schnyder","Simon K.",""],["Molina","John J.",""],["Yamamoto","Ryoichi",""],["Turner","Matthew S.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 09:08:59 GMT"}],"updateDate":"2024-07-08","timestamp":1720170539000,"abstract":"  Faced with a dangerous epidemic humans will spontaneously social distance to\nreduce their risk of infection at a socio-economic cost. Compartmentalised\nepidemic models have been extended to include this endogenous decision making:\nIndividuals choose their behaviour to optimise a utility function,\nself-consistently giving rise to population behaviour. Here we study the\nproperties of the resulting Nash equilibria, in which no member of the\npopulation can gain an advantage by unilaterally adopting different behaviour.\nWe leverage a new analytic solution to obtain, (1) a simple relationship\nbetween rational social distancing behaviour and the current number of\ninfections; (2) new scaling results for how the infection peak and number of\ntotal cases depend on the cost of contracting the disease; (3) characteristic\ninfection costs that divide regimes of strong and weak behavioural response and\ndepend only on the basic reproduction number of the disease; (4) a closed form\nexpression for the value of the utility. We discuss how these analytic results\nprovide a deep and intuitive understanding into the disease dynamics, useful\nfor both individuals and policymakers. In particular the relationship between\nsocial distancing and infections represents a heuristic that could be\ncommunicated to the population to encourage, or \"bootstrap\", rational\nbehaviour.\n","subjects":["Economics/Theoretical Economics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Optimization and Control","Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}