{"id":"2407.08751","title":"Latent Diffusion for Neural Spiking Data","authors":"Jaivardhan Kapoor, Auguste Schulz, Julius Vetter, Felix Pei, Richard\n  Gao, Jakob H. Macke","authorsParsed":[["Kapoor","Jaivardhan",""],["Schulz","Auguste",""],["Vetter","Julius",""],["Pei","Felix",""],["Gao","Richard",""],["Macke","Jakob H.",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 13:47:06 GMT"}],"updateDate":"2024-07-15","timestamp":1719496026000,"abstract":"  Modern datasets in neuroscience enable unprecedented inquiries into the\nrelationship between complex behaviors and the activity of many simultaneously\nrecorded neurons. While latent variable models can successfully extract\nlow-dimensional embeddings from such recordings, using them to generate\nrealistic spiking data, especially in a behavior-dependent manner, still poses\na challenge. Here, we present Latent Diffusion for Neural Spiking data (LDNS),\na diffusion-based generative model with a low-dimensional latent space: LDNS\nemploys an autoencoder with structured state-space (S4) layers to project\ndiscrete high-dimensional spiking data into continuous time-aligned latents. On\nthese inferred latents, we train expressive (conditional) diffusion models,\nenabling us to sample neural activity with realistic single-neuron and\npopulation spiking statistics. We validate LDNS on synthetic data, accurately\nrecovering latent structure, firing rates, and spiking statistics. Next, we\ndemonstrate its flexibility by generating variable-length data that mimics\nhuman cortical activity during attempted speech. We show how to equip LDNS with\nan expressive observation model that accounts for single-neuron dynamics not\nmediated by the latent state, further increasing the realism of generated\nsamples. Finally, conditional LDNS trained on motor cortical activity during\ndiverse reaching behaviors can generate realistic spiking data given reach\ndirection or unseen reach trajectories. In summary, LDNS simultaneously enables\ninference of low-dimensional latents and realistic conditional generation of\nneural spiking datasets, opening up further possibilities for simulating\nexperimentally testable hypotheses.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"mJGn_kOUrt7OJXWtDF1M-ysm37oIHNuUGDD7QBOocik","pdfSize":"5377498"}
