{"id":"2407.00484","title":"Generalized Entropy Implies Varying-G: Horizon Area Dependent Field\n  Equations and Black Hole-Cosmology Coupling","authors":"Hengxin Lu, Sofia Di Gennaro, Yen Chin Ong","authorsParsed":[["Lu","Hengxin",""],["Di Gennaro","Sofia",""],["Ong","Yen Chin",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 16:15:55 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 03:53:40 GMT"}],"updateDate":"2024-07-16","timestamp":1719677755000,"abstract":"  When the Bekenstein-Hawking entropy is modified, ambiguity often arises\nconcerning whether the Hawking temperature or the thermodynamic mass should be\nmodified. The common practice, however, is to keep the black hole solution the\nsame as that in general relativity. On the other hand, if Jacobson's method of\nderiving Einstein equations from thermodynamic is valid in the general\nsettings, then given a generalized entropy one should first derive the\ncorresponding modified gravity, and then look for the compatible black hole\nsolution before investigating its thermodynamics. We comment on some properties\nand subtleties in this approach. In particular, we point out that generically\ngeneralized entropy would lead to a varying effective gravitational \"constant\"\ntheory, where $G_\\text{eff}$ depends on the horizon area. We discuss in what\nways such theories are discernible from general relativity despite its\nseemingly jarring differences, and how to make sense of area-dependent field\nequations. As a consequence we show that in the Jacobson's approach, the\nstandard quantum gravitational logarithmic correction to Bekenstein-Hawking\nentropy is equivalent to a running gravitational \"constant\". A horizon area\ndependent $G_\\text{eff}$ could also lead to a coupling between black hole\nmasses and cosmological expansion, a scenario that has been studied recently in\nthe literature, but so far lacks strong theoretical motivation. In the Tsallis\ncase, we show that the thermodynamic mass for a Schwarzschild black hole is\njust a constant multiple of its ADM mass, which is considerably simpler than\nthe approach not utilizing the Jacobson's method.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}