{"id":"2407.19114","title":"To which reference class do you belong? Measuring racial fairness of\n  reference classes with normative modeling","authors":"Saige Rutherford, Thomas Wolfers, Charlotte Fraza, Nathaniel G.\n  Harrnet, Christian F. Beckmann, Henricus G. Ruhe, Andre F. Marquand","authorsParsed":[["Rutherford","Saige",""],["Wolfers","Thomas",""],["Fraza","Charlotte",""],["Harrnet","Nathaniel G.",""],["Beckmann","Christian F.",""],["Ruhe","Henricus G.",""],["Marquand","Andre F.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 22:34:05 GMT"}],"updateDate":"2024-07-30","timestamp":1722033245000,"abstract":"  Reference classes in healthcare establish healthy norms, such as pediatric\ngrowth charts of height and weight, and are used to chart deviations from these\nnorms which represent potential clinical risk. How the demographics of the\nreference class influence clinical interpretation of deviations is unknown.\nUsing normative modeling, a method for building reference classes, we evaluate\nthe fairness (racial bias) in reference models of structural brain images that\nare widely used in psychiatry and neurology. We test whether including race in\nthe model creates fairer models. We predict self-reported race using the\ndeviation scores from three different reference class normative models, to\nbetter understand bias in an integrated, multivariate sense. Across all of\nthese tasks, we uncover racial disparities that are not easily addressed with\nexisting data or commonly used modeling techniques. Our work suggests that\ndeviations from the norm could be due to demographic mismatch with the\nreference class, and assigning clinical meaning to these deviations should be\ndone with caution. Our approach also suggests that acquiring more\nrepresentative samples is an urgent research priority.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}