{"id":"2407.17720","title":"Multi-physics Simulation Guided Generative Diffusion Models with\n  Applications in Fluid and Heat Dynamics","authors":"Naichen Shi and Hao Yan and Shenghan Guo and Raed Al Kontar","authorsParsed":[["Shi","Naichen",""],["Yan","Hao",""],["Guo","Shenghan",""],["Kontar","Raed Al",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 02:45:58 GMT"}],"updateDate":"2024-07-26","timestamp":1721875558000,"abstract":"  In this paper, we present a generic physics-informed generative model called\nMPDM that integrates multi-fidelity physics simulations with diffusion models.\nMPDM categorizes multi-fidelity physics simulations into inexpensive and\nexpensive simulations, depending on computational costs. The inexpensive\nsimulations, which can be obtained with low latency, directly inject contextual\ninformation into DDMs. Furthermore, when results from expensive simulations are\navailable, MPDM refines the quality of generated samples via a guided diffusion\nprocess. This design separates the training of a denoising diffusion model from\nphysics-informed conditional probability models, thus lending flexibility to\npractitioners. MPDM builds on Bayesian probabilistic models and is equipped\nwith a theoretical guarantee that provides upper bounds on the Wasserstein\ndistance between the sample and underlying true distribution. The probabilistic\nnature of MPDM also provides a convenient approach for uncertainty\nquantification in prediction. Our models excel in cases where physics\nsimulations are imperfect and sometimes inaccessible. We use a numerical\nsimulation in fluid dynamics and a case study in heat dynamics within\nlaser-based metal powder deposition additive manufacturing to demonstrate how\nMPDM seamlessly integrates multi-idelity physics simulations and observations\nto obtain surrogates with superior predictive performance.\n","subjects":["Statistics/Computation","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"WfnE7PRUHMTm7H9SgCkRgFhT0gadVCSEkLYx2IHUbkc","pdfSize":"5668215"}
