{"id":"2407.13763","title":"Isospin Pomeranchuk effect and finite temperature resistivity minimum in\n  rhombohedral graphene","authors":"Ludwig Holleis, Tian Xie, Siyuan Xu, Haoxin Zhou, Caitlin L.\n  Patterson, Archisman Panigrahi, Takashi Taniguchi, Kenji Watanabe, Leonid S.\n  Levitov, Chenhao Jin, Erez Berg and Andrea F. Young","authorsParsed":[["Holleis","Ludwig",""],["Xie","Tian",""],["Xu","Siyuan",""],["Zhou","Haoxin",""],["Patterson","Caitlin L.",""],["Panigrahi","Archisman",""],["Taniguchi","Takashi",""],["Watanabe","Kenji",""],["Levitov","Leonid S.",""],["Jin","Chenhao",""],["Berg","Erez",""],["Young","Andrea F.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:58:49 GMT"}],"updateDate":"2024-07-19","timestamp":1721325529000,"abstract":"  Magnetism typically arises from the effect of exchange interactions on highly\nlocalized fermionic wave functions in f- and d-atomic orbitals. In rhombohedral\ngraphene multilayers, in contrast, magnetism -- manifesting as spontaneous\npolarization into one or more spin and valley flavors[1-7]-originates from\nfully itinerant electrons near a Van Hove singularity. Here, we show that\ndespite the absence of localized electronic orbitals on the scale of the\ninterparticle separation, rhombohedral graphene bi- and trilayers show\nthermodynamic signatures typically associated with disordered local magnetic\nmoments. Specifically, while long range valley order vanishes at temperatures\nof a few Kelvin, thermodynamic characteristics of fluctuating moments, probed\nvia both electronic compressibility[2-4] and exciton sensing measurements[8],\nsurvive to temperatures an order of magnitude higher. Measurements of the\nelectronic entropy in this regime reveal a contribution of $\\Delta S \\approx\n1k_B$/charge carrier, onsetting at the Curie temperature, while first order\nphase transitions show an isospin \"Pomeranchuk effect\" in which the fluctuating\nmoment phase is entropically favored over the nearby symmetric Fermi liquid[9,\n10]. Our results imply that despite the itinerant nature of the electron wave\nfunctions, the spin- and valley polarization of individual electrons are\ndecoupled, a phenomenon typically associated with localized moments, as\nhappens, for example, in solid 3He[11]. Transport measurements, surprisingly,\nshow a finite temperature resistance minimum within the fluctuating moment\nregime, which we attribute to the interplay of fluctuating magnetic moments and\nelectron phonon scattering. Our results highlight the universality of soft\nisospin modes to two dimensional flat band systems and their possible relevance\nboth to low-temperature ground states and high temperature transport anomalies.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}