{"id":"2407.11887","title":"On the optimal prediction of extreme events in heavy-tailed time series\n  with applications to solar flare forecasting","authors":"Victor Verma, Stilian Stoev, Yang Chen","authorsParsed":[["Verma","Victor",""],["Stoev","Stilian",""],["Chen","Yang",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 16:15:42 GMT"}],"updateDate":"2024-07-17","timestamp":1721146542000,"abstract":"  The prediction of extreme events in time series is a fundamental problem\narising in many financial, scientific, engineering, and other applications. We\nbegin by establishing a general Neyman-Pearson-type characterization of optimal\nextreme event predictors in terms of density ratios. This yields new insights\nand several closed-form optimal extreme event predictors for additive models.\nThese results naturally extend to time series, where we study optimal extreme\nevent prediction for heavy-tailed autoregressive and moving average models.\nUsing a uniform law of large numbers for ergodic time series, we establish the\nasymptotic optimality of an empirical version of the optimal predictor for\nautoregressive models. Using multivariate regular variation, we also obtain\nexpressions for the optimal extremal precision in heavy-tailed infinite moving\naverages, which provide theoretical bounds on the ability to predict extremes\nin this general class of models. The developed theory and methodology is\napplied to the important problem of solar flare prediction based on the\nstate-of-the-art GOES satellite flux measurements of the Sun. Our results\ndemonstrate the success and limitations of long-memory autoregressive as well\nas long-range dependent heavy-tailed FARIMA models for the prediction of\nextreme solar flares.\n","subjects":["Mathematics/Statistics Theory","Statistics/Applications","Statistics/Methodology","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"gaKODGcAJeyzoV2QvbpKz_o4-bnXnFoFLynPRfxbZFs","pdfSize":"2343860","objectId":"0x2d50fa6c9a7d4a5c6f4db04c56bca8f862650f9bcffaa9d9d84a3dc51c91ea0c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
