{"id":"2407.11557","title":"The impact of lossy data compression on the power spectrum of the high\n  redshift 21-cm signal with LOFAR","authors":"J. K. Chege, L.V.E. Koopmans, A. R. Offringa, B. K. Gehlot, S.A.\n  Brackenhoff, E. Ceccotti, S. Ghosh, C. H\\\"ofer, F.G. Mertens, M. Mevius and\n  S. Munshi","authorsParsed":[["Chege","J. K.",""],["Koopmans","L. V. E.",""],["Offringa","A. R.",""],["Gehlot","B. K.",""],["Brackenhoff","S. A.",""],["Ceccotti","E.",""],["Ghosh","S.",""],["Höfer","C.",""],["Mertens","F. G.",""],["Mevius","M.",""],["Munshi","S.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 10:06:28 GMT"}],"updateDate":"2024-07-17","timestamp":1721124388000,"abstract":"  Current radio interferometers output multi-petabyte-scale volumes of data per\nyear making the storage, transfer, and processing of this data a sizeable\nchallenge. This challenge is expected to grow with the next-generation\ntelescopes such as the Square Kilometre Array. Lossy compression of\ninterferometric data post-correlation can abate this challenge. However, since\nhigh-redshift 21-cm studies impose strict precision requirements, the impact of\nsuch lossy data compression on the 21-cm signal power spectrum statistic should\nbe understood. We apply Dysco visibility compression, a technique to normalize\nand quantize specifically designed for radio interferometric data. We establish\nthe level of the compression noise in the power spectrum in comparison to the\nthermal noise as well as its coherency behavior. Finally, for optimal\ncompression results, we compare the compression noise obtained from different\ncompression settings to a nominal 21-cm signal power. From a single night of\nobservation, we find that the noise introduced due to the compression is more\nthan five orders of magnitude lower than the thermal noise level in the power\nspectrum. The noise does not affect calibration. The compression noise shows no\ncorrelation with the sky signal and has no measurable coherent component. The\nlevel of compression error in the power spectrum ultimately depends on the\ncompression settings. Dysco visibility compression is found to be of\ninsignificant concern for 21-cm power spectrum studies. Hence, data volumes can\nbe safely reduced by factors of $\\sim 4$ and with insignificant bias to the\nfinal power spectrum. Data from SKA-low will likely be compressible by the same\nfactor as LOFAR, owing to the similarities of the two instruments. The same\ntechnique can be used to compress data from other telescopes, but a small\nadjustment of the compression parameters might be required.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}