{"id":"2407.20344","title":"Off-axis Hartmann wavefront sensing for the GMT-Consortium Large Earth\n  Finder (G-CLEF) red camera optics","authors":"Matthew C. H. Leung, Colby A. Jurgenson, Andrew Szentgyorgyi, Brian\n  McLeod, Cem Onyuksel, Joseph Zajac, David Charbonneau, William Podgorski,\n  Abigail Unger, Mark Mueller, Matthew Smith, Daniel Baldwin, V. Ashley Villar","authorsParsed":[["Leung","Matthew C. H.",""],["Jurgenson","Colby A.",""],["Szentgyorgyi","Andrew",""],["McLeod","Brian",""],["Onyuksel","Cem",""],["Zajac","Joseph",""],["Charbonneau","David",""],["Podgorski","William",""],["Unger","Abigail",""],["Mueller","Mark",""],["Smith","Matthew",""],["Baldwin","Daniel",""],["Villar","V. Ashley",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:00:53 GMT"}],"updateDate":"2024-07-31","timestamp":1722276053000,"abstract":"  The Hartmann test is a method used to measure the wavefront error in a focal\noptical system, wherein a mask with a pattern of small holes is placed at the\nsystem's aperture stop. By taking an image at a defocused plane, the\ndifferences between the ideal and real positions of the reimaged holes (called\nthe transverse ray aberrations) can be measured, which can then be used to\nestimate the wavefront error. However, the Hartmann test is usually used with\nan on-axis field. In this paper, we present a wavefront sensing method which\ngeneralizes the classical Hartmann test for off-axis field angles and arbitrary\nreference wavefronts. Our method involves taking images at two defocused\nplanes, and then using the real reimaged hole positions on both planes to\nestimate the trajectories of rays from the system's exit pupil, at which the\nreference wavefront is situated. We then propagate the rays forward from the\nreference wavefront to one of the two defocused planes, in order to find the\nideal reimaged hole positions, from which we can compute transverse ray\naberrations. We derive and solve a pair of nonlinear partial differential\nequations relating transverse ray aberrations to wavefront error, using Zernike\ndecomposition and nonlinear least squares. Our method has been verified on\nsimulated data from the 7-lens f/2.25 red camera system of the GMT-Consortium\nLarge Earth Finder (G-CLEF), a high resolution optical echelle spectrograph\nwhich will be a first light instrument for the Giant Magellan Telescope (GMT).\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}