{"id":"2407.20807","title":"Enhanced Radiation Hardness of InAs/GaAs Quantum Dot Lasers for Space\n  Communication","authors":"Manyang Li, Wenkang Zhan, Shujie Pan, Jinpeng Chen, Xiaotian Cheng,\n  Zhibo Ni, Bo Xu, Jinling Yu, Chaoyuan Jin, Siming Chen, Chao Zhao, Zhanguo\n  Wang","authorsParsed":[["Li","Manyang",""],["Zhan","Wenkang",""],["Pan","Shujie",""],["Chen","Jinpeng",""],["Cheng","Xiaotian",""],["Ni","Zhibo",""],["Xu","Bo",""],["Yu","Jinling",""],["Jin","Chaoyuan",""],["Chen","Siming",""],["Zhao","Chao",""],["Wang","Zhanguo",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 13:12:54 GMT"}],"updateDate":"2024-07-31","timestamp":1722345174000,"abstract":"  Semiconductor lasers have great potential for space laser communication.\nHowever, excessive radiation in space can cause laser failure. Quantum dot (QD)\nlasers are more resistant to radiation compared to quantum well (QW) and bulk\nlasers due to better carrier confinement and a smaller active region.\nTherefore, it is crucial to find the most radiation-tolerant QD structures and\ncompare the radiation tolerance of QD and QW structures at different radiation\nfluences where the QDs can show their advantages in the best way. Proton and\n60Co {\\gamma}-ray radiation tests were conducted on different InAs/GaAs QD and\nInGaAs/GaAs QW materials and devices. The results show that the QD samples were\nmore radiation-tolerant than QW samples within a certain fluence range, and\nmore radiation-tolerant QD structures were identified. Dislocations were found\nnear the QWs but not the QDs after 1 x 1011 cm-2 radiation. Defects were\ncreated in all samples after 7 x 1013 cm-2 proton radiation. Additionally, 60Co\n{\\gamma}-rays radiation tests ranging from 10 to 12000 Gy were conducted, and\nall the samples exhibited good tolerance to total radiation dose effects.\n","subjects":["Physics/Applied Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}