{"id":"2407.06144","title":"Loewner traces driven by Levy processes","authors":"Eveliina Peltola and Anne Schreuder","authorsParsed":[["Peltola","Eveliina",""],["Schreuder","Anne",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:19:23 GMT"}],"updateDate":"2024-07-09","timestamp":1720459163000,"abstract":"  Loewner chains with Levy drivers have been proposed in the physics literature\nas models related to random dendritic growth in off-critical systems (and even\nfor diffusion-limited aggregation), and in mathematics as candidates for\nfinding extremal multifractal spectra (towards Brennan's conjecture and related\nproblems in classical function theory). These processes are not scale-invariant\nin general, but they do enjoy a natural domain Markov property thanks to the\nstationary independent increments of Levy processes. The associated Loewner\nhulls feature remarkably intricate topological properties and possibly\ncomplicated multifractal phenomena, of which very little is known rigorously.\n  We prove that a chordal Loewner chain driven by a Levy process $W$ satisfying\nmild regularity conditions (including stable processes) is a.s. generated by a\ncadlag curve. Specifically, if the diffusivity parameter of the driving process\n$W$ is $\\kappa \\in [0,8)$, then the jump measure of $W$ is required to be\nlocally (upper) Ahlfors regular near the origin, while if $\\kappa > 8$, no\nconstraints are imposed. In particular, we show that the associated Loewner\nhulls are a.s. locally connected and path-connected. We also show that, the\ncomplements of the hulls are a.s. Holder domains when $\\kappa \\neq 4$ (which is\nnot expected to hold when $\\kappa=4$), without any regularity assumptions. The\nproofs of these results mainly rely on careful derivative estimates for both\nthe forward and backward Loewner maps obtained using delicate but robust enough\nsupermartingale domination arguments. As one cannot control the jump\naccumulation of general Levy processes, we must circumvent all reasoning that\nwould use continuity. To prove the local connectedness, we use an extension of\npart of the Hahn-Mazurkiewicz theorem: hulls generated by cadlag curves are\nlocally connected even when jumps would occur at infinite intensity.\n","subjects":["Mathematics/Probability","Physics/Mathematical Physics","Mathematics/Complex Variables","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}