{"id":"2407.00482","title":"Quantifying Spuriousness of Biased Datasets Using Partial Information\n  Decomposition","authors":"Barproda Halder, Faisal Hamman, Pasan Dissanayake, Qiuyi Zhang, Ilia\n  Sucholutsky, Sanghamitra Dutta","authorsParsed":[["Halder","Barproda",""],["Hamman","Faisal",""],["Dissanayake","Pasan",""],["Zhang","Qiuyi",""],["Sucholutsky","Ilia",""],["Dutta","Sanghamitra",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 16:05:47 GMT"}],"updateDate":"2024-07-02","timestamp":1719677147000,"abstract":"  Spurious patterns refer to a mathematical association between two or more\nvariables in a dataset that are not causally related. However, this notion of\nspuriousness, which is usually introduced due to sampling biases in the\ndataset, has classically lacked a formal definition. To address this gap, this\nwork presents the first information-theoretic formalization of spuriousness in\na dataset (given a split of spurious and core features) using a mathematical\nframework called Partial Information Decomposition (PID). Specifically, we\ndisentangle the joint information content that the spurious and core features\nshare about another target variable (e.g., the prediction label) into distinct\ncomponents, namely unique, redundant, and synergistic information. We propose\nthe use of unique information, with roots in Blackwell Sufficiency, as a novel\nmetric to formally quantify dataset spuriousness and derive its desirable\nproperties. We empirically demonstrate how higher unique information in the\nspurious features in a dataset could lead a model into choosing the spurious\nfeatures over the core features for inference, often having low\nworst-group-accuracy. We also propose a novel autoencoder-based estimator for\ncomputing unique information that is able to handle high-dimensional image\ndata. Finally, we also show how this unique information in the spurious feature\nis reduced across several dataset-based spurious-pattern-mitigation techniques\nsuch as data reweighting and varying levels of background mixing, demonstrating\na novel tradeoff between unique information (spuriousness) and\nworst-group-accuracy.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computers and Society","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pZdStPm-IOxy5mQzZMAkA9haI2cBRpTi0YmbuIWy8UQ","pdfSize":"9415229","objectId":"0x3071e49ee0e37ca8d30feaec6a891032c8fc8cd6da05fd294e15e0009fcd7727","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
