{"id":"2407.10846","title":"Joint Learning from Heterogeneous Rank Data","authors":"Sjoerd Hermes, Joost van Heerwaarden, Pariya Behrouzi","authorsParsed":[["Hermes","Sjoerd",""],["van Heerwaarden","Joost",""],["Behrouzi","Pariya",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 15:59:55 GMT"}],"updateDate":"2024-07-16","timestamp":1721059195000,"abstract":"  The statistical modelling of ranking data has a long history and encompasses\nvarious perspectives on how observed rankings arise. One of the most common\nmodels, the Plackett-Luce model, is frequently used to aggregate rankings from\nmultiple rankers into a single ranking that corresponds to the underlying\nquality of the ranked objects. Given that rankers frequently exhibit\nheterogeneous preferences, mixture-type models have been developed to group\nrankers with more or less homogeneous preferences together to reduce bias.\nHowever, occasionally, these preference groups are known a-priori. Under these\ncircumstances, current practice consists of fitting Plackett-Luce models\nseparately for each group. Nevertheless, there might be some commonalities\nbetween different groups of rankers, such that separate estimation implies a\nloss of information. We propose an extension of the Plackett-Luce model, the\nSparse Fused Plackett-Luce model, that allows for joint learning of such\nheterogeneous rank data, whereby information from different groups is utilised\nto achieve better model performance. The observed rankings can be considered a\nfunction of variables pertaining to the ranked objects. As such, we allow for\nthese types of variables, where information on the coefficients is shared\nacross groups. Moreover, as not all variables might be relevant for the ranking\nof an object, we impose sparsity on the coefficients to improve\ninterpretability, estimation and prediction of the model. Simulations studies\nindicate superior performance of the proposed method compared to existing\napproaches. To illustrate the usage and interpretation of the method, an\napplication on data consisting of consumer preferences regarding various sweet\npotato varieties is provided. An R package containing the proposed methodology\ncan be found on https://CRAN.R-project.org/package=SFPL.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}