{"id":"2407.21402","title":"DD-rPPGNet: De-interfering and Descriptive Feature Learning for\n  Unsupervised rPPG Estimation","authors":"Pei-Kai Huang, Tzu-Hsien Chen, Ya-Ting Chan, Kuan-Wen Chen, Chiou-Ting\n  Hsu","authorsParsed":[["Huang","Pei-Kai",""],["Chen","Tzu-Hsien",""],["Chan","Ya-Ting",""],["Chen","Kuan-Wen",""],["Hsu","Chiou-Ting",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 07:43:58 GMT"}],"updateDate":"2024-08-01","timestamp":1722411838000,"abstract":"  Remote Photoplethysmography (rPPG) aims to measure physiological signals and\nHeart Rate (HR) from facial videos. Recent unsupervised rPPG estimation methods\nhave shown promising potential in estimating rPPG signals from facial regions\nwithout relying on ground truth rPPG signals. However, these methods seem\noblivious to interference existing in rPPG signals and still result in\nunsatisfactory performance. In this paper, we propose a novel De-interfered and\nDescriptive rPPG Estimation Network (DD-rPPGNet) to eliminate the interference\nwithin rPPG features for learning genuine rPPG signals. First, we investigate\nthe characteristics of local spatial-temporal similarities of interference and\ndesign a novel unsupervised model to estimate the interference. Next, we\npropose an unsupervised de-interfered method to learn genuine rPPG signals with\ntwo stages. In the first stage, we estimate the initial rPPG signals by\ncontrastive learning from both the training data and their augmented\ncounterparts. In the second stage, we use the estimated interference features\nto derive de-interfered rPPG features and encourage the rPPG signals to be\ndistinct from the interference. In addition, we propose an effective\ndescriptive rPPG feature learning by developing a strong 3D Learnable\nDescriptive Convolution (3DLDC) to capture the subtle chrominance changes for\nenhancing rPPG estimation. Extensive experiments conducted on five rPPG\nbenchmark datasets demonstrate that the proposed DD-rPPGNet outperforms\nprevious unsupervised rPPG estimation methods and achieves competitive\nperformances with state-of-the-art supervised rPPG methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}