{"id":"2407.17283","title":"Hybrid-PFC: coupling the phase-field crystal model and its\n  amplitude-equation formulation","authors":"Maik Punke, Marco Salvalaglio","authorsParsed":[["Punke","Maik",""],["Salvalaglio","Marco",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 13:48:44 GMT"}],"updateDate":"2024-07-25","timestamp":1721828924000,"abstract":"  The phase-field crystal (PFC) model describes crystal structures at diffusive\ntimescales through a periodic, microscopic density field. It has been proposed\nto model elasticity in crystal growth and encodes most of the phenomenology\nrelated to the mechanical properties of crystals like dislocation nucleation\nand motion, grain boundaries, and elastic or interface-energy anisotropies. To\novercome limitations to small systems, a coarse-grained formulation focusing on\nslowly varying complex amplitudes of the microscopic density field has been\ndevised. This amplitude-PFC (APFC) model describes well elasticity and\ndislocations while approximating microscopic features and being limited in\ndescribing large-angle grain boundaries. We present here seminal concepts for a\nhybrid multiscale PFC-APFC framework that combines the coarse-grained\ndescription of the APFC model in bulk-like crystallites while exploiting PFC\nresolution at dislocations, grain boundaries, and interfaces or surfaces. This\nis achieved by coupling the two models via an advanced discretization based on\nthe Fourier spectral method and allowing for local solution updates. This\ndiscretization also generalizes the description of boundary conditions for PFC\nmodels. We showcase the framework capabilities through two-dimensional\nbenchmark simulations. We also show that the proposed formulation allows for\novercoming the limitations of the APFC model in describing large-angle grain\nboundaries.\n","subjects":["Condensed Matter/Materials Science","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}