{"id":"2407.16634","title":"Knowledge-driven AI-generated data for accurate and interpretable breast\n  ultrasound diagnoses","authors":"Haojun Yu, Youcheng Li, Nan Zhang, Zihan Niu, Xuantong Gong, Yanwen\n  Luo, Quanlin Wu, Wangyan Qin, Mengyuan Zhou, Jie Han, Jia Tao, Ziwei Zhao, Di\n  Dai, Di He, Dong Wang, Binghui Tang, Ling Huo, Qingli Zhu, Yong Wang and\n  Liwei Wang","authorsParsed":[["Yu","Haojun",""],["Li","Youcheng",""],["Zhang","Nan",""],["Niu","Zihan",""],["Gong","Xuantong",""],["Luo","Yanwen",""],["Wu","Quanlin",""],["Qin","Wangyan",""],["Zhou","Mengyuan",""],["Han","Jie",""],["Tao","Jia",""],["Zhao","Ziwei",""],["Dai","Di",""],["He","Di",""],["Wang","Dong",""],["Tang","Binghui",""],["Huo","Ling",""],["Zhu","Qingli",""],["Wang","Yong",""],["Wang","Liwei",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 16:49:01 GMT"}],"updateDate":"2024-07-24","timestamp":1721753341000,"abstract":"  Data-driven deep learning models have shown great capabilities to assist\nradiologists in breast ultrasound (US) diagnoses. However, their effectiveness\nis limited by the long-tail distribution of training data, which leads to\ninaccuracies in rare cases. In this study, we address a long-standing challenge\nof improving the diagnostic model performance on rare cases using long-tailed\ndata. Specifically, we introduce a pipeline, TAILOR, that builds a\nknowledge-driven generative model to produce tailored synthetic data. The\ngenerative model, using 3,749 lesions as source data, can generate millions of\nbreast-US images, especially for error-prone rare cases. The generated data can\nbe further used to build a diagnostic model for accurate and interpretable\ndiagnoses. In the prospective external evaluation, our diagnostic model\noutperforms the average performance of nine radiologists by 33.5% in\nspecificity with the same sensitivity, improving their performance by providing\npredictions with an interpretable decision-making process. Moreover, on ductal\ncarcinoma in situ (DCIS), our diagnostic model outperforms all radiologists by\na large margin, with only 34 DCIS lesions in the source data. We believe that\nTAILOR can potentially be extended to various diseases and imaging modalities.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}