{"id":"2407.12850","title":"Limits to Predicting Online Speech Using Large Language Models","authors":"Mina Remeli, Moritz Hardt and Robert C. Williamson","authorsParsed":[["Remeli","Mina",""],["Hardt","Moritz",""],["Williamson","Robert C.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 09:50:49 GMT"}],"updateDate":"2024-07-19","timestamp":1720432249000,"abstract":"  We study the predictability of online speech on social media, and whether\npredictability improves with information outside a user's own posts. Recent\nwork suggests that the predictive information contained in posts written by a\nuser's peers can surpass that of the user's own posts. Motivated by the success\nof large language models, we empirically test this hypothesis. We define\nunpredictability as a measure of the model's uncertainty, i.e., its negative\nlog-likelihood on future tokens given context. As the basis of our study, we\ncollect a corpus of 6.25M posts from more than five thousand X (previously\nTwitter) users and their peers. Across three large language models ranging in\nsize from 1 billion to 70 billion parameters, we find that predicting a user's\nposts from their peers' posts performs poorly. Moreover, the value of the\nuser's own posts for prediction is consistently higher than that of their\npeers'. Across the board, we find that the predictability of social media posts\nremains low, comparable to predicting financial news without context. We extend\nour investigation with a detailed analysis about the causes of unpredictability\nand the robustness of our findings. Specifically, we observe that a significant\namount of predictive uncertainty comes from hashtags and @-mentions. Moreover,\nour results replicate if instead of prompting the model with additional\ncontext, we finetune on additional context.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}