{"id":"2407.19015","title":"A self-consistent framework to study magnetic fields with strong\n  gravitational lensing and polarised radio sources","authors":"S. Ndiritu, S. Vegetti, D.M. Powell and J.P. McKean","authorsParsed":[["Ndiritu","S.",""],["Vegetti","S.",""],["Powell","D. M.",""],["McKean","J. P.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:00:11 GMT"}],"updateDate":"2024-07-30","timestamp":1722016811000,"abstract":"  We introduce a unified approach that, given a strong gravitationally lensed\npolarised source, self-consistently infers its complex surface brightness\ndistribution and the lens galaxy mass-density profile, magnetic field and\nelectron density from interferometric data. The method is fully Bayesian,\npixellated and three-dimensional: the source light is reconstructed in each\nfrequency channel on a Delaunay tessellation with a magnification-adaptive\nresolution. We tested this technique using simulated interferometric\nobservations with a realistic model of the lens, for two different levels of\nsource polarisation and two different lensing configurations. For all data\nsets, the presence of a Faraday rotating screen in the lens is supported by the\ndata with strong statistical significance. In the region probed by the lensed\nimages, we can recover the Rotation Measure and the parallel component of the\nmagnetic field with an average error between 0.6 and 11 rad m$^{-2}$ and 0.3\nand 3 nG, respectively. Given our choice of model, we find the electron density\nis the least well-constrained component due to a degeneracy with the magnetic\nfield and disk inclination. The background source total intensity, polarisation\nfraction, and polarisation angle are inferred with an error between 4 and 10\nper cent, 15 and 50 per cent, and 1 to 12 degrees, respectively. Our analysis\nshows that both the lensing configuration and the intrinsic model degeneracies\nplay a role in the quality of the constraints that can be obtained.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yNzq0f5eBj5CXjnc0OjLTElG1j363R8qSNHoqnMeTis","pdfSize":"22633622"}
