{"id":"2407.06641","title":"Cosmological simulations of scale-dependent primordial non-Gaussianity","authors":"Marco Baldi, Emanuele Fondi, Dionysios Karagiannis, Lauro Moscardini,\n  Andrea Ravenni, William R. Coulton, Gabriel Jung, Michele Liguori, Marco\n  Marinucci, Licia Verde, Francisco Villaescusa-Navarro, Banjamin D. Wandelt","authorsParsed":[["Baldi","Marco",""],["Fondi","Emanuele",""],["Karagiannis","Dionysios",""],["Moscardini","Lauro",""],["Ravenni","Andrea",""],["Coulton","William R.",""],["Jung","Gabriel",""],["Liguori","Michele",""],["Marinucci","Marco",""],["Verde","Licia",""],["Villaescusa-Navarro","Francisco",""],["Wandelt","Banjamin D.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 08:10:49 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 08:03:30 GMT"}],"updateDate":"2024-07-12","timestamp":1720512649000,"abstract":"  We present the results of a set of cosmological N-body simulations with\nstandard $\\Lambda$CDM cosmology but characterized by a scale-dependent\nprimordial non-Gaussianity of the local type featuring a power-law dependence\nof the $f_{\\rm NL}^{\\rm loc}(k)$ at large scales followed by a saturation to a\nconstant value at smaller scales where non-linear growth leads to the formation\nof collapsed cosmic structures. Such models are built to ensure consistency\nwith current Cosmic Microwave Background bounds on primordial non-Gaussianity\nyet allowing for large effects of the non-Gaussian statistics on the properties\nof non-linear structure formation. We show the impact of such scale-dependent\nnon-Gaussian scenarios on a wide range of properties of the resulting cosmic\nstructures, such as the non-linear matter power spectrum, the halo and sub-halo\nmass functions, the concentration-mass relation, the halo and void density\nprofiles, and we highlight for the first time that some of these models might\nmimic the effects of Warm Dark Matter for several of such observables\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"dQKS2WMoE6VKbztNI81U81LSwlCsJjO2gMR2Cfv6aEc","pdfSize":"16731313"}
