{"id":"2407.21773","title":"RainMamba: Enhanced Locality Learning with State Space Models for Video\n  Deraining","authors":"Hongtao Wu, Yijun Yang, Huihui Xu, Weiming Wang, Jinni Zhou, Lei Zhu","authorsParsed":[["Wu","Hongtao",""],["Yang","Yijun",""],["Xu","Huihui",""],["Wang","Weiming",""],["Zhou","Jinni",""],["Zhu","Lei",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 17:48:22 GMT"},{"version":"v2","created":"Wed, 11 Sep 2024 17:47:33 GMT"}],"updateDate":"2024-09-12","timestamp":1722448102000,"abstract":"  The outdoor vision systems are frequently contaminated by rain streaks and\nraindrops, which significantly degenerate the performance of visual tasks and\nmultimedia applications. The nature of videos exhibits redundant temporal cues\nfor rain removal with higher stability. Traditional video deraining methods\nheavily rely on optical flow estimation and kernel-based manners, which have a\nlimited receptive field. Yet, transformer architectures, while enabling\nlong-term dependencies, bring about a significant increase in computational\ncomplexity. Recently, the linear-complexity operator of the state space models\n(SSMs) has contrarily facilitated efficient long-term temporal modeling, which\nis crucial for rain streaks and raindrops removal in videos. Unexpectedly, its\nuni-dimensional sequential process on videos destroys the local correlations\nacross the spatio-temporal dimension by distancing adjacent pixels. To address\nthis, we present an improved SSMs-based video deraining network (RainMamba)\nwith a novel Hilbert scanning mechanism to better capture sequence-level local\ninformation. We also introduce a difference-guided dynamic contrastive locality\nlearning strategy to enhance the patch-level self-similarity learning ability\nof the proposed network. Extensive experiments on four synthesized video\nderaining datasets and real-world rainy videos demonstrate the effectiveness\nand efficiency of our network in the removal of rain streaks and raindrops. Our\ncode and results are available at https://github.com/TonyHongtaoWu/RainMamba.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}