{"id":"2407.20273","title":"Learning Physics-Consistent Material Behavior Without Prior Knowledge","authors":"Zhichao Han, Mohit Pundir, Olga Fink, David S. Kammer","authorsParsed":[["Han","Zhichao",""],["Pundir","Mohit",""],["Fink","Olga",""],["Kammer","David S.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 08:24:04 GMT"}],"updateDate":"2024-07-31","timestamp":1721895844000,"abstract":"  Accurately modeling the mechanical behavior of materials is crucial for\nnumerous engineering applications. The quality of these models depends directly\non the accuracy of the constitutive law that defines the stress-strain\nrelation. Discovering these constitutive material laws remains a significant\nchallenge, in particular when only material deformation data is available. To\naddress this challenge, unsupervised machine learning methods have been\nproposed. However, existing approaches have several limitations: they either\nfail to ensure that the learned constitutive relations are consistent with\nphysical principles, or they rely on a predefined library of constitutive\nrelations or manually crafted input features. These dependencies require\nsignificant expertise and specialized domain knowledge. Here, we introduce a\nmachine learning approach called uLED, which overcomes the limitations by using\nthe input convex neural network (ICNN) as the surrogate constitutive model. We\nimprove the optimization strategy for training ICNN, allowing it to be trained\nend-to-end using direct strain invariants as input across various materials.\nFurthermore, we utilize the nodal force equilibrium at the internal domain as\nthe training objective, which enables us to learn the constitutive relation\nsolely from temporal displacement recordings. We validate the effectiveness of\nthe proposed method on a diverse range of material laws. We demonstrate that it\nis robust to a significant level of noise and that it converges to the ground\ntruth with increasing data resolution. We also show that the model can be\neffectively trained using a displacement field from a subdomain of the test\nspecimen and that the learned constitutive relation from one material sample is\ntransferable to other samples with different geometries. The developed\nmethodology provides an effective tool for discovering constitutive relations.\n","subjects":["Condensed Matter/Materials Science","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}