{"id":"2407.09328","title":"> 2{\\pi} Phase Modulation using Exciton-Polaritons in a Two-Dimensional\n  Superlattice","authors":"Jason Lynch, Pawan Kumar, Chen Chen, Nicholas Trainor, Shalini Kumari,\n  Tzu-Yu Peng, Cindy Yueli Chen, Yu-Jung Lu, Joan Redwing, Deep Jariwala","authorsParsed":[["Lynch","Jason",""],["Kumar","Pawan",""],["Chen","Chen",""],["Trainor","Nicholas",""],["Kumari","Shalini",""],["Peng","Tzu-Yu",""],["Chen","Cindy Yueli",""],["Lu","Yu-Jung",""],["Redwing","Joan",""],["Jariwala","Deep",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 15:06:49 GMT"}],"updateDate":"2024-07-15","timestamp":1720796809000,"abstract":"  Active metamaterials promise to enable arbitrary, temporal control over the\npropagation of wavefronts of light for applications such as beam steering,\noptical communication modulators, and holograms. This has been done in the past\nusing patterned silicon photonics to locally control the phase of light such\nthat the metasurface acts as a large number of wavelets. Although phase\nmodulation only requires refractive index modulation when the interaction\nlength is on the order of the wavelength, this is not enough to significantly\nmodulate the phase of light in flatland. Instead, phase modulation is achieved\nusing a resonant mode such as a plasmon or high-Q cavity mode that enable light\nto accumulate a large amount of phase over a short distance and coupling it to\nan active material that modulates the light-matter interactions. Here, we\nreport that electrostatic doping can modulate the light-matter interaction\nstrength of a two-dimensional WS2 based multi quantum well (MQW) structure\ngoing from strongly-coupled, phase-accumulating exciton-polaritons to\nweakly-coupled exciton-trion-polaritons. As a result of this transition,\n2.02{\\pi} radians of phase modulation is observed using spectroscopic\nellipsometry. This result demonstrates the potential of the MQW structure as a\ncompact, lightweight electro-optical modulators for LiDAR and optical\ncommunications in the red region of visible spectrum.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7JD45d0_ZilHC-gnr35MLwD5kdEnTvh9IRxzbNL81uI","pdfSize":"1998448","objectId":"0xff955519bc3a85150d82aae72b7464c67d4c9bc98280d1ddc50dbd6bf8a2fe56","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
