{"id":"2407.15883","title":"A Novel Method to Improve Quality Surface Coverage in Multi-View Capture","authors":"Wei-Lun Huang, Davood Tashayyod, Amir Gandjbakhche, Michael Kazhdan,\n  Mehran Armand","authorsParsed":[["Huang","Wei-Lun",""],["Tashayyod","Davood",""],["Gandjbakhche","Amir",""],["Kazhdan","Michael",""],["Armand","Mehran",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 00:14:15 GMT"}],"updateDate":"2024-07-24","timestamp":1721520855000,"abstract":"  The depth of field of a camera is a limiting factor for applications that\nrequire taking images at a short subject-to-camera distance or using a large\nfocal length, such as total body photography, archaeology, and other\nclose-range photogrammetry applications. Furthermore, in multi-view capture,\nwhere the target is larger than the camera's field of view, an efficient way to\noptimize surface coverage captured with quality remains a challenge. Given the\n3D mesh of the target object and camera poses, we propose a novel method to\nderive a focus distance for each camera that optimizes the quality of the\ncovered surface area. We first design an Expectation-Minimization (EM)\nalgorithm to assign points on the mesh uniquely to cameras and then solve for a\nfocus distance for each camera given the associated point set. We further\nimprove the quality surface coverage by proposing a $k$-view algorithm that\nsolves for the points assignment and focus distances by considering multiple\nviews simultaneously. We demonstrate the effectiveness of the proposed method\nunder various simulations for total body photography. The EM and $k$-view\nalgorithms improve the relative cost of the baseline single-view methods by at\nleast $24$% and $28$% respectively, corresponding to increasing the in-focus\nsurface area by roughly $1550$ cm$^2$ and $1780$ cm$^2$. We believe the\nalgorithms can be useful in a number of vision applications that require\nphotogrammetric details but are limited by the depth of field.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}