{"id":"2407.19655","title":"AI-Driven Healthcare: A Survey on Ensuring Fairness and Mitigating Bias","authors":"Sribala Vidyadhari Chinta, Zichong Wang, Xingyu Zhang, Thang Doan\n  Viet, Ayesha Kashif, Monique Antoinette Smith, Wenbin Zhang","authorsParsed":[["Chinta","Sribala Vidyadhari",""],["Wang","Zichong",""],["Zhang","Xingyu",""],["Viet","Thang Doan",""],["Kashif","Ayesha",""],["Smith","Monique Antoinette",""],["Zhang","Wenbin",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 02:39:17 GMT"}],"updateDate":"2024-07-30","timestamp":1722220757000,"abstract":"  Artificial intelligence (AI) is rapidly advancing in healthcare, enhancing\nthe efficiency and effectiveness of services across various specialties,\nincluding cardiology, ophthalmology, dermatology, emergency medicine, etc. AI\napplications have significantly improved diagnostic accuracy, treatment\npersonalization, and patient outcome predictions by leveraging technologies\nsuch as machine learning, neural networks, and natural language processing.\nHowever, these advancements also introduce substantial ethical and fairness\nchallenges, particularly related to biases in data and algorithms. These biases\ncan lead to disparities in healthcare delivery, affecting diagnostic accuracy\nand treatment outcomes across different demographic groups. This survey paper\nexamines the integration of AI in healthcare, highlighting critical challenges\nrelated to bias and exploring strategies for mitigation. We emphasize the\nnecessity of diverse datasets, fairness-aware algorithms, and regulatory\nframeworks to ensure equitable healthcare delivery. The paper concludes with\nrecommendations for future research, advocating for interdisciplinary\napproaches, transparency in AI decision-making, and the development of\ninnovative and inclusive AI applications.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LyXeKEJddpJn3pZdxrCDEcl6gAmJsylGbY8qi_gNkLw","pdfSize":"285196","objectId":"0x323e78ef2acbbdc1ef6c3eb9b230a53621387d7c25b21587960de9fc9f6f6ea0","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
