{"id":"2407.19111","title":"A camera system for real-time optical calibration of water-based\n  neutrino telescopes","authors":"Wei Tian, Wei Zhi, Qiao Xue, Wenlian Li, Zhenyu Wei, Fan Hu, Qichao\n  Chang, MingXin Wang, Zhengyang Sun, Xiaohui Liu, Ziping Ye, Peng Miao,\n  Xinliang Tian, Jianglai Liu, Donglian Xu","authorsParsed":[["Tian","Wei",""],["Zhi","Wei",""],["Xue","Qiao",""],["Li","Wenlian",""],["Wei","Zhenyu",""],["Hu","Fan",""],["Chang","Qichao",""],["Wang","MingXin",""],["Sun","Zhengyang",""],["Liu","Xiaohui",""],["Ye","Ziping",""],["Miao","Peng",""],["Tian","Xinliang",""],["Liu","Jianglai",""],["Xu","Donglian",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 22:19:07 GMT"}],"updateDate":"2024-07-30","timestamp":1722032347000,"abstract":"  Calibrating the optical properties within the detection medium of a neutrino\ntelescope is crucial for determining its angular resolution and energy scale.\nFor the next generation of neutrino telescopes planned to be constructed in\ndeep water, such as the TRopIcal DEep-sea Neutrino Telescope (TRIDENT), there\nare additional challenges due to the dynamic nature and potential\nnon-uniformity of the water medium. This necessitates a real-time optical\ncalibration system distributed throughout the large detector array. This study\nintroduces a custom-designed CMOS camera system equipped with rapid image\nprocessing algorithms, providing a real-time optical calibration method for\nTRIDENT and other similar projects worldwide. In September 2021, the TRIDENT\nPathfinder experiment (TRIDENT Explorer, T-REX for short) successfully deployed\nthis camera system in the West Pacific Ocean at a depth of 3420 meters. Within\n30 minutes, about 3000 images of the T-REX light source were captured, allowing\nfor the in-situ measurement of seawater attenuation and absorption lengths\nunder three wavelengths. This deep-sea experiment for the first time showcased\na technical demonstration of a functioning camera calibration system in a\ndynamic neutrino telescope site, solidifying a substantial part of the\ncalibration strategies for the future TRIDENT project.\n","subjects":["Physics/Instrumentation and Detectors","Astrophysics/Instrumentation and Methods for Astrophysics","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"mBGIfTQZd1KY7CkY7kfBsqaoeP6gQCNbmsulxak6EQU","pdfSize":"38156776"}
