{"id":"2407.18142","title":"New black ring with all independent conserved charges in\n  five-dimensional minimal supergravity","authors":"Ryotaku Suzuki and Shinya Tomizawa","authorsParsed":[["Suzuki","Ryotaku",""],["Tomizawa","Shinya",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 15:48:14 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 11:04:53 GMT"}],"updateDate":"2024-08-29","timestamp":1721922494000,"abstract":"  We present a new exact solution for a general non-BPS black ring in the\nbosonic sector of five-dimensional minimal supergravity. This obtained solution\ncarries four independent conserved charges: the mass, two angular momenta, an\nelectric charge, and an additional dipole charge related to other charges. By\nemploying the Ehlers-Harrison transformation, we derive this solution by\ntransforming a five-dimensional vacuum solution into a charged solution in the\ntheory. Previously, our work produced a vacuum doubly rotating black ring\nsolution possessing a Dirac-Misner string singularity by using the Ehlers\ntransformation. In this study, we use the singular black ring as the seed for\nthe Harrison transformation. The resultant solution is regular, free from\ncurvature singularities, conical singularities, orbifold singularities,\nDirac-Misner string singularities, and closed timelike curves both on and\noutside the horizon. We show that within a specific parameter range, the black\nring presents two branches for the same mass, two angular momenta and electric\ncharge but these are distinguished by a dipole charge, which exhibits\ndiscontinuous non-uniqueness. Furthermore, this newly obtained black ring\nseamlessly connects to various physically significant solutions, such as the\nPomeransky-Sen'kov black ring, the extremal black ring, the supersymmetric\nblack ring, and the charged singly-spinning black ring.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}