{"id":"2407.18183","title":"Signaling Rate and Performance of RIS Reconfiguration and Handover\n  Management in Next Generation Mobile Networks","authors":"Mounir Bensalem and Admela Jukan","authorsParsed":[["Bensalem","Mounir",""],["Jukan","Admela",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 16:42:36 GMT"}],"updateDate":"2024-07-26","timestamp":1721925756000,"abstract":"  We consider the problem of signaling rate and performance for an efficient\ncontrol and management of RIS reconfigurations and handover in next generation\nmobile networks. To this end, we first analytically determine the rates of RIS\nreconfigurations and handover using a stochastic geometry network model. We\nderive closed-form expressions of these rates while taking into account static\nobstacles (both known and unknown), self-blockage, RIS location density, and\nvariations in the angle and direction of user mobility. Based on the rates\nderived, we analyze the signaling rates of a sample novel signaling protocol,\nwhich we propose as an extension of an handover signaling protocol standard in\nmobile networks. The results quantify the impact of known and unknown obstacles\non the RIS and handover reconfiguration rate as function of device density and\nmobility. We use the proposed analysis to evaluate the signaling overhead due\nto RIS reconfigurations, as well as to dimension the related RIS control plane\nserver capacity in the network management system. To the best of our knowledge,\nthis is the first analytical model to derive the closed form expressions of RIS\nreconfiguration rates, along with handover rates, and relate its statistical\nproperties to the signaling rate and performance in next generation mobile\nnetworks.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gsLU5G8Tbgv1911laNtovMNNr8iUx34-6TTR_fFZpzQ","pdfSize":"5557599","objectId":"0xfa900f2ca910e47bb0a05b00cc1356998bea27aec48e04a30f05767444ec1fd2","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
