{"id":"2407.13284","title":"Semantic-aware Representation Learning for Homography Estimation","authors":"Yuhan Liu, Qianxin Huang, Siqi Hui, Jingwen Fu, Sanping Zhou, Kangyi\n  Wu, Pengna Li, Jinjun Wang","authorsParsed":[["Liu","Yuhan",""],["Huang","Qianxin",""],["Hui","Siqi",""],["Fu","Jingwen",""],["Zhou","Sanping",""],["Wu","Kangyi",""],["Li","Pengna",""],["Wang","Jinjun",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:36:28 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 09:20:02 GMT"},{"version":"v3","created":"Mon, 5 Aug 2024 13:49:38 GMT"}],"updateDate":"2024-08-06","timestamp":1721291788000,"abstract":"  Homography estimation is the task of determining the transformation from an\nimage pair. Our approach focuses on employing detector-free feature matching\nmethods to address this issue. Previous work has underscored the importance of\nincorporating semantic information, however there still lacks an efficient way\nto utilize semantic information. Previous methods suffer from treating the\nsemantics as a pre-processing, causing the utilization of semantics overly\ncoarse-grained and lack adaptability when dealing with different tasks. In our\nwork, we seek another way to use the semantic information, that is\nsemantic-aware feature representation learning framework.Based on this, we\npropose SRMatcher, a new detector-free feature matching method, which\nencourages the network to learn integrated semantic feature\nrepresentation.Specifically, to capture precise and rich semantics, we leverage\nthe capabilities of recently popularized vision foundation models (VFMs)\ntrained on extensive datasets. Then, a cross-images Semantic-aware Fusion Block\n(SFB) is proposed to integrate its fine-grained semantic features into the\nfeature representation space. In this way, by reducing errors stemming from\nsemantic inconsistencies in matching pairs, our proposed SRMatcher is able to\ndeliver more accurate and realistic outcomes. Extensive experiments show that\nSRMatcher surpasses solid baselines and attains SOTA results on multiple\nreal-world datasets. Compared to the previous SOTA approach GeoFormer,\nSRMatcher increases the area under the cumulative curve (AUC) by about 11% on\nHPatches. Additionally, the SRMatcher could serve as a plug-and-play framework\nfor other matching methods like LoFTR, yielding substantial precision\nimprovement.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}