{"id":"2407.14154","title":"Where is the Testbed for my Federated Learning Research?","authors":"Janez Bo\\v{z}i\\v{c}, Am\\^andio R. Faustino, Boris Radovi\\v{c}, Marco\n  Canini, Veljko Pejovi\\'c","authorsParsed":[["Božič","Janez",""],["Faustino","Amândio R.",""],["Radovič","Boris",""],["Canini","Marco",""],["Pejović","Veljko",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 09:34:04 GMT"}],"updateDate":"2024-07-22","timestamp":1721381644000,"abstract":"  Progressing beyond centralized AI is of paramount importance, yet,\ndistributed AI solutions, in particular various federated learning (FL)\nalgorithms, are often not comprehensively assessed, which prevents the research\ncommunity from identifying the most promising approaches and practitioners from\nbeing convinced that a certain solution is deployment-ready. The largest hurdle\ntowards FL algorithm evaluation is the difficulty of conducting real-world\nexperiments over a variety of FL client devices and different platforms, with\ndifferent datasets and data distribution, all while assessing various\ndimensions of algorithm performance, such as inference accuracy, energy\nconsumption, and time to convergence, to name a few. In this paper, we present\nCoLExT, a real-world testbed for FL research. CoLExT is designed to streamline\nexperimentation with custom FL algorithms in a rich testbed configuration\nspace, with a large number of heterogeneous edge devices, ranging from\nsingle-board computers to smartphones, and provides real-time collection and\nvisualization of a variety of metrics through automatic instrumentation.\nAccording to our evaluation, porting FL algorithms to CoLExT requires minimal\ninvolvement from the developer, and the instrumentation introduces minimal\nresource usage overhead. Furthermore, through an initial investigation\ninvolving popular FL algorithms running on CoLExT, we reveal previously unknown\ntrade-offs, inefficiencies, and programming bugs.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WuAh_gw2REKg6r1UwwJ_croGyrziCXzqRcvmaPwoUdE","pdfSize":"8423441","objectId":"0x3ce1e62854bb81f5498e1e43dd4b87190931ada8e943ec3d15dcf3dc893c26eb","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
