{"id":"2407.05986","title":"KidSat: satellite imagery to map childhood poverty dataset and benchmark","authors":"Makkunda Sharma, Fan Yang, Duy-Nhat Vo, Esra Suel, Swapnil Mishra,\n  Samir Bhatt, Oliver Fiala, William Rudgard, Seth Flaxman","authorsParsed":[["Sharma","Makkunda",""],["Yang","Fan",""],["Vo","Duy-Nhat",""],["Suel","Esra",""],["Mishra","Swapnil",""],["Bhatt","Samir",""],["Fiala","Oliver",""],["Rudgard","William",""],["Flaxman","Seth",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 14:26:30 GMT"}],"updateDate":"2024-07-09","timestamp":1720448790000,"abstract":"  Satellite imagery has emerged as an important tool to analyse demographic,\nhealth, and development indicators. While various deep learning models have\nbeen built for these tasks, each is specific to a particular problem, with few\nstandard benchmarks available. We propose a new dataset pairing satellite\nimagery and high-quality survey data on child poverty to benchmark satellite\nfeature representations. Our dataset consists of 33,608 images, each 10 km\n$\\times$ 10 km, from 19 countries in Eastern and Southern Africa in the time\nperiod 1997-2022. As defined by UNICEF, multidimensional child poverty covers\nsix dimensions and it can be calculated from the face-to-face Demographic and\nHealth Surveys (DHS) Program . As part of the benchmark, we test spatial as\nwell as temporal generalization, by testing on unseen locations, and on data\nafter the training years. Using our dataset we benchmark multiple models, from\nlow-level satellite imagery models such as MOSAIKS , to deep learning\nfoundation models, which include both generic vision models such as\nSelf-Distillation with no Labels (DINOv2) models and specific satellite imagery\nmodels such as SatMAE. We provide open source code for building the satellite\ndataset, obtaining ground truth data from DHS and running various models\nassessed in our work.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}