{"id":"2407.06254","title":"Does the Fundamental Metallicity Relation Evolve with Redshift? II: The\n  Evolution in Normalisation of the Mass-Metallicity Relation","authors":"Alex M. Garcia, Paul Torrey, Sara L. Ellison, Kathryn Grasha, Qian-Hui\n  Chen, Z.S. Hemler, Dhruv T. Zimmerman, Ruby J. Wright, Henry R.M. Zovaro,\n  Erica J. Nelson, Ryan L. Sanders, Lisa J. Kewley, Lars Hernquist","authorsParsed":[["Garcia","Alex M.",""],["Torrey","Paul",""],["Ellison","Sara L.",""],["Grasha","Kathryn",""],["Chen","Qian-Hui",""],["Hemler","Z. S.",""],["Zimmerman","Dhruv T.",""],["Wright","Ruby J.",""],["Zovaro","Henry R. M.",""],["Nelson","Erica J.",""],["Sanders","Ryan L.",""],["Kewley","Lisa J.",""],["Hernquist","Lars",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-10","timestamp":1720461600000,"abstract":"  The metal content of galaxies is a direct probe of the baryon cycle. A\nhallmark example is the relationship between a galaxy's stellar mass, star\nformation rate (SFR), and gas-phase metallicity: the Fundamental Metallicity\nRelation (FMR). While low-redshift ($z\\lesssim4$) observational studies suggest\nthat the FMR is redshift-invariant, recent JWST data indicate deviations from\nthis model. In this study, we utilize the FMR to predict the evolution of the\nnormalisation of the mass-metallicity relation (MZR) using the cosmological\nsimulations Illustris, IllustrisTNG, EAGLE, and SIMBA. Our findings demonstrate\nthat a $z = 0$ calibrated FMR struggles to predict the evolution in the MZR of\neach simulation. To quantify the divergence of the predictions, we introduce\nthe concepts of a ''static'' FMR, where the role of the SFR in setting the\nnormalization of the MZR does not change with redshift, and a ''dynamic'' FMR,\nwhere the role of SFR evolves over time. We find static FMRs in Illustris and\nSIMBA and dynamic FMRs in IllustrisTNG and EAGLE. We suggest that the\ndifferences between these models likely points to the subtle differences in the\nimplementation of the baryon cycle. Moreover, we echo recent JWST results at $z\n> 4$ by finding significant offsets from the FMR in IllustrisTNG and EAGLE,\nsuggesting that the observed FMR may be dynamic as well. Overall, our findings\nimply that the current FMR framework neglects important variations in the\nbaryon cycle through cosmic time.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}