{"id":"2407.02371","title":"OpenVid-1M: A Large-Scale High-Quality Dataset for Text-to-video\n  Generation","authors":"Kepan Nan, Rui Xie, Penghao Zhou, Tiehan Fan, Zhenheng Yang, Zhijie\n  Chen, Xiang Li, Jian Yang and Ying Tai","authorsParsed":[["Nan","Kepan",""],["Xie","Rui",""],["Zhou","Penghao",""],["Fan","Tiehan",""],["Yang","Zhenheng",""],["Chen","Zhijie",""],["Li","Xiang",""],["Yang","Jian",""],["Tai","Ying",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 15:40:29 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 07:14:59 GMT"}],"updateDate":"2024-08-05","timestamp":1719934829000,"abstract":"  Text-to-video (T2V) generation has recently garnered significant attention\nthanks to the large multi-modality model Sora. However, T2V generation still\nfaces two important challenges: 1) Lacking a precise open sourced high-quality\ndataset. The previous popular video datasets, e.g. WebVid-10M and Panda-70M,\nare either with low quality or too large for most research institutions.\nTherefore, it is challenging but crucial to collect a precise high-quality\ntext-video pairs for T2V generation. 2) Ignoring to fully utilize textual\ninformation. Recent T2V methods have focused on vision transformers, using a\nsimple cross attention module for video generation, which falls short of\nthoroughly extracting semantic information from text prompt. To address these\nissues, we introduce OpenVid-1M, a precise high-quality dataset with expressive\ncaptions. This open-scenario dataset contains over 1 million text-video pairs,\nfacilitating research on T2V generation. Furthermore, we curate 433K 1080p\nvideos from OpenVid-1M to create OpenVidHD-0.4M, advancing high-definition\nvideo generation. Additionally, we propose a novel Multi-modal Video Diffusion\nTransformer (MVDiT) capable of mining both structure information from visual\ntokens and semantic information from text tokens. Extensive experiments and\nablation studies verify the superiority of OpenVid-1M over previous datasets\nand the effectiveness of our MVDiT.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}