{"id":"2407.11433","title":"CycleHOI: Improving Human-Object Interaction Detection with Cycle\n  Consistency of Detection and Generation","authors":"Yisen Wang, Yao Teng, Limin Wang","authorsParsed":[["Wang","Yisen",""],["Teng","Yao",""],["Wang","Limin",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 06:55:43 GMT"}],"updateDate":"2024-07-17","timestamp":1721112943000,"abstract":"  Recognition and generation are two fundamental tasks in computer vision,\nwhich are often investigated separately in the exiting literature. However,\nthese two tasks are highly correlated in essence as they both require\nunderstanding the underline semantics of visual concepts. In this paper, we\npropose a new learning framework, coined as CycleHOI, to boost the performance\nof human-object interaction (HOI) detection by bridging the DETR-based\ndetection pipeline and the pre-trained text-to-image diffusion model. Our key\ndesign is to introduce a novel cycle consistency loss for the training of HOI\ndetector, which is able to explicitly leverage the knowledge captured in the\npowerful diffusion model to guide the HOI detector training. Specifically, we\nbuild an extra generation task on top of the decoded instance representations\nfrom HOI detector to enforce a detection-generation cycle consistency.\nMoreover, we perform feature distillation from diffusion model to detector\nencoder to enhance its representation power. In addition, we further utilize\nthe generation power of diffusion model to augment the training set in both\naspects of label correction and sample generation. We perform extensive\nexperiments to verify the effectiveness and generalization power of our\nCycleHOI with three HOI detection frameworks on two public datasets: HICO-DET\nand V-COCO. The experimental results demonstrate our CycleHOI can significantly\nimprove the performance of the state-of-the-art HOI detectors.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}