{"id":"2407.20026","title":"JAX-SSO: Differentiable Finite Element Analysis Solver for Structural\n  Optimization and Seamless Integration with Neural Networks","authors":"Gaoyuan Wu","authorsParsed":[["Wu","Gaoyuan",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 14:02:33 GMT"}],"updateDate":"2024-07-30","timestamp":1722261753000,"abstract":"  Differentiable numerical simulations of physical systems have gained rising\nattention in the past few years with the development of automatic\ndifferentiation tools. This paper presents JAX-SSO, a differentiable finite\nelement analysis solver built with JAX, Google's high-performance computing\nlibrary, to assist efficient structural design in the built environment. With\nthe adjoint method and automatic differentiation feature, JAX-SSO can\nefficiently evaluate gradients of physical quantities in an automatic way,\nenabling accurate sensitivity calculation in structural optimization problems.\nWritten in Python and JAX, JAX-SSO is naturally within the machine learning\necosystem so it can be seamlessly integrated with neural networks to train\nmachine learning models with inclusion of physics. Moreover, JAX-SSO supports\nGPU acceleration to further boost finite element analysis. Several examples are\npresented to showcase the capabilities and efficiency of JAX-SSO: i) shape\noptimization of grid-shells and continuous shells; ii) size (thickness)\noptimization of continuous shells; iii) simultaneous shape and topology\noptimization of continuous shells; and iv) training of physics-informed neural\nnetworks for structural optimization. We believe that JAX-SSO can facilitate\nresearch related to differentiable physics and machine learning to further\naddress problems in structural and architectural design.\n","subjects":["Computing Research Repository/Mathematical Software","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lzDyjM6RX0-CFIT1m-sdfdMRuKGtCO12aPpZuBo3Tnk","pdfSize":"11876270"}
