{"id":"2407.04416","title":"Sound-VECaps: Improving Audio Generation with Visual Enhanced Captions","authors":"Yi Yuan, Dongya Jia, Xiaobin Zhuang, Yuanzhe Chen, Zhengxi Liu, Zhuo\n  Chen, Yuping Wang, Yuxuan Wang, Xubo Liu, Xiyuan Kang, Mark D. Plumbley,\n  Wenwu Wang","authorsParsed":[["Yuan","Yi",""],["Jia","Dongya",""],["Zhuang","Xiaobin",""],["Chen","Yuanzhe",""],["Liu","Zhengxi",""],["Chen","Zhuo",""],["Wang","Yuping",""],["Wang","Yuxuan",""],["Liu","Xubo",""],["Kang","Xiyuan",""],["Plumbley","Mark D.",""],["Wang","Wenwu",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 11:07:13 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 12:40:46 GMT"},{"version":"v3","created":"Wed, 14 Aug 2024 21:30:52 GMT"}],"updateDate":"2024-08-16","timestamp":1720177633000,"abstract":"  Generative models have shown significant achievements in audio generation\ntasks. However, existing models struggle with complex and detailed prompts,\nleading to potential performance degradation. We hypothesize that this problem\nstems from the simplicity and scarcity of the training data. This work aims to\ncreate a large-scale audio dataset with rich captions for improving audio\ngeneration models. We first develop an automated pipeline to generate detailed\ncaptions by transforming predicted visual captions, audio captions, and tagging\nlabels into comprehensive descriptions using a Large Language Model (LLM). The\nresulting dataset, Sound-VECaps, comprises 1.66M high-quality audio-caption\npairs with enriched details including audio event orders, occurred places and\nenvironment information. We then demonstrate that training the text-to-audio\ngeneration models with Sound-VECaps significantly improves the performance on\ncomplex prompts. Furthermore, we conduct ablation studies of the models on\nseveral downstream audio-language tasks, showing the potential of Sound-VECaps\nin advancing audio-text representation learning. Our dataset and models are\navailable online.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Multimedia","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}