{"id":"2407.10818","title":"Extragalactic 85Rb/87Rb and 6Li/7Li ratios in the Small Magellanic Cloud","authors":"P. Molaro, P. Bonifacio, G. Cupani and C. Howk","authorsParsed":[["Molaro","P.",""],["Bonifacio","P.",""],["Cupani","G.",""],["Howk","C.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 15:34:14 GMT"}],"updateDate":"2024-07-16","timestamp":1721057654000,"abstract":"  The line of sight toward Sk 143 (AzV 456), an O9.5 Ib star in the Small\nMagellanic Cloud (SMC), shows significant absorption from neutral atoms and\nmolecules. We report a new study of this line of sight by means of\nhigh-resolution spectra obtained with the ESPRESSO spectrograph at the VLT of\nESO. The absorption from neutral and ionized species is well characterized by a\nsingle component at vhel about +132 km/s that was modeled with the ASTROCOOK\ncode. The rubidium Rb I 780.0 nm line is detected for the first time outside\nthe Galaxy, and we derive [Rb/H]= -1.86 +/- 0.09. As a result of the high\nresolution, the 85Rb and 87Rb isotope lines are also exceptionally well\nresolved. The 85Rb/87Rb isotope ratio is 0.46, which is opposite of the\nmeteoritic value of 2.43. This implies that Rb is made through a dominant\ncontribution of the r-process, which is dominant for the 87Rb isotope. We also\nconfirm the presence of 7LiI 670.7 nm and set a limit on the isotopic ratio of\n6Li/7Li < 0.1.The dominance of the 87Rb isotope implies that Rb is made through\na dominant contribution of the r-process. At the low metallicity of the cloud\nof [Zn/H] = -1.28 +/- 0.09 , neutron rich material may have occurred in\nrotating metal-poor massive stars. Moreover, the low metallicity of the cloud\nleads to an absolute Li abundance of A(7Li) about 2.2, which differs from the\nexpectation from big bang nucleosynthesis. Because the gas-phase abundance is\nnot affected by stellar depletion, the burning of Li inside the halo stars is\nprobably not the solution for the cosmological 7Li problem.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}