{"id":"2407.11165","title":"Restricted Boltzmann Machine for Modeling Complex Physical Systems: A\n  Case Study in Artificial Spin Ice","authors":"Rehana Begum Popy, Mahdis Hamdi and Robert L. Stamps","authorsParsed":[["Popy","Rehana Begum",""],["Hamdi","Mahdis",""],["Stamps","Robert L.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:38:04 GMT"}],"updateDate":"2024-07-17","timestamp":1721068684000,"abstract":"  Restricted Boltzmann machines are powerful tools in the field of generative,\nprobabilistic learning, capable of capturing complex dependencies in data. By\nunderstanding their architecture and operational principles, one can employ\nthem for diverse purposes such as dimensionality reduction, feature learning\nand even representing and analyzing various physical systems. This work aims to\nprovide insights into the capabilities and limitations of restricted Boltzmann\nmachines in modelling complex physical systems in the context of artificial\nspin ice. Geometrical frustration in artificial spin ice systems creates\ndegeneracies leading to complex states and collective dynamics. From\nreconfigurable magnonics to neuromorphic computing, artificial spin systems are\nemerging as versatile functional platforms that go beyond simply imitating\nnaturally occurring materials. Using out of equilibrium data from Monte Carlo\nsimulations of artificial spin ice geometries, this work demonstrates the\nsensitivity of learning artificial spin ice state distributions with restricted\nBoltzmann machines. Results indicate that careful application of the restricted\nBoltzmann machine algorithm can reduce the training data required for feature\nextraction, which can be used for faster sample generation. Additionally, we\ndemonstrate how the restricted Boltzmann machine can distinguish different\nartificial spin ice geometries by identifying their respective state\ndistribution features.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"e-Mm9y1Saj6a4eSxUun77TydmuPmTU7Hcs-qi02e5to","pdfSize":"2093800"}
