{"id":"2407.01027","title":"Blind Inversion using Latent Diffusion Priors","authors":"Weimin Bai, Siyi Chen, Wenzheng Chen, He Sun","authorsParsed":[["Bai","Weimin",""],["Chen","Siyi",""],["Chen","Wenzheng",""],["Sun","He",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 07:23:28 GMT"}],"updateDate":"2024-07-02","timestamp":1719818608000,"abstract":"  Diffusion models have emerged as powerful tools for solving inverse problems\ndue to their exceptional ability to model complex prior distributions. However,\nexisting methods predominantly assume known forward operators (i.e.,\nnon-blind), limiting their applicability in practical settings where acquiring\nsuch operators is costly. Additionally, many current approaches rely on\npixel-space diffusion models, leaving the potential of more powerful latent\ndiffusion models (LDMs) underexplored. In this paper, we introduce LatentDEM,\nan innovative technique that addresses more challenging blind inverse problems\nusing latent diffusion priors. At the core of our method is solving blind\ninverse problems within an iterative Expectation-Maximization (EM) framework:\n(1) the E-step recovers clean images from corrupted observations using LDM\npriors and a known forward model, and (2) the M-step estimates the forward\noperator based on the recovered images. Additionally, we propose two novel\noptimization techniques tailored for LDM priors and EM frameworks, yielding\nmore accurate and efficient blind inversion results. As a general framework,\nLatentDEM supports both linear and non-linear inverse problems. Beyond common\n2D image restoration tasks, it enables new capabilities in non-linear 3D\ninverse rendering problems. We validate LatentDEM's performance on\nrepresentative 2D blind deblurring and 3D sparse-view reconstruction tasks,\ndemonstrating its superior efficacy over prior arts.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lvoQnY5Q0jp5HAmkHwjxIYCLf2d6Cik7Hvt6tw10uB8","pdfSize":"18776000"}
