{"id":"2407.07367","title":"An Evaluation of Immersive Infographics for News Reporting: Quantifying\n  the Effect of Mobile AR Concrete Scales Infographics on Volume Understanding","authors":"Mariane Giambastiani, Jorge Wagner, Carla M. Dal Sasso Freitas and\n  Luciana Nedel","authorsParsed":[["Giambastiani","Mariane",""],["Wagner","Jorge",""],["Freitas","Carla M. Dal Sasso",""],["Nedel","Luciana",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 05:00:17 GMT"}],"updateDate":"2024-07-11","timestamp":1720587617000,"abstract":"  Augmented Reality (AR) allows us to represent information in the user's own\nenvironment and, therefore, convey a visceral feeling of its true physical\nscale. Journalists increasingly leverage this opportunity through immersive\ninfographics, an extension of conventional infographics reliant on familiar\nreferences to convey volumes, heights, weights, and sizes. Our goal is to\nmeasure the contribution of immersive mobile AR concrete scales infographics to\nthe user's understanding of the information scale. We focus on infographics\npowered by tablet-based mobile AR, given its current much more widespread use\nfor news consumption compared to headset-based AR. We designed and implemented\na study apparatus containing three alternative representation methods (textual\nanalogies, image infographic, and AR infographic) for three different pieces of\nnews with different characteristics and scales. In a controlled user study, we\nasked 26 participants to represent the expected volume of the information in\nthe real world with the help of an AR mobile application. We also compared\ntheir subjective feelings when interacting with the different representations.\nWhile both image and AR infographics led to significantly better comprehension\nthan textual analogies alone across different kinds of news, AR infographics\nled, on average, to a 31.8% smaller volume estimation error than static ones.\nOur findings indicate that mobile AR concrete scales infographics can\ncontribute to news reporting by increasing readers' abilities to comprehend\nvolume information.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}