{"id":"2407.08705","title":"Detecting Gravitational Wave Anisotropies from Supermassive Black Hole\n  Binaries","authors":"Anna-Malin Lemke, Andrea Mitridate, Kyle A. Gersbach","authorsParsed":[["Lemke","Anna-Malin",""],["Mitridate","Andrea",""],["Gersbach","Kyle A.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:41:09 GMT"}],"updateDate":"2024-07-12","timestamp":1720719669000,"abstract":"  Several Pulsar Timing Array (PTA) collaborations have recently found evidence\nfor a gravitational wave background (GWB) permeating our galaxy. The origin of\nthis background is still unknown. Indeed, while the gravitational wave emission\nfrom inspiraling supermassive black hole binaries (SMBHB) is the primary\ncandidate for its origin, several cosmological sources have also been proposed.\nOne distinctive feature of SMBHB-generated backgrounds is the presence of GWB\nanisotropies stemming from the binaries distribution in the local Universe.\nHowever, none of the anisotropy searches performed to date reported a\ndetection. In this work, we show that the lack of anisotropy detection is not\ncurrently in tension with a SMBHB origin of the background. We accomplish this\nby calculating the anisotropy detection probability of present and future PTAs.\nWe find that a PTA with the noise characteristics of the NANOGrav 15-year data\nset had only a $~2\\%-11\\%$ probability of detecting SMBHB-generated\nanisotropies, depending on the properties of the SMBHB population. However, we\nestimate that for the IPTA DR3 data set these probabilities will increase to\n$~4\\%-28\\%$, putting more pressure on the SMBHB interpretation in case of a\nnull detection. We also identify SMBHB populations that are more likely to\nproduce detectable levels of anisotropies. This information could be used\ntogether with the spectral properties of the GWB to characterize the SMBHB\npopulation.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JX2mu1EPrlO5U2BW-tawaa8DFaCFcUkrfbvzko8DKfI","pdfSize":"3373362"}
