{"id":"2407.20651","title":"Towards Generalizable Reinforcement Learning via Causality-Guided\n  Self-Adaptive Representations","authors":"Yupei Yang, Biwei Huang, Fan Feng, Xinyue Wang, Shikui Tu, Lei Xu","authorsParsed":[["Yang","Yupei",""],["Huang","Biwei",""],["Feng","Fan",""],["Wang","Xinyue",""],["Tu","Shikui",""],["Xu","Lei",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 08:48:49 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 14:24:20 GMT"}],"updateDate":"2024-08-01","timestamp":1722329329000,"abstract":"  General intelligence requires quick adaption across tasks. While existing\nreinforcement learning (RL) methods have made progress in generalization, they\ntypically assume only distribution changes between source and target domains.\nIn this paper, we explore a wider range of scenarios where both the\ndistribution and environment spaces may change. For example, in Atari games, we\ntrain agents to generalize to tasks with different levels of mode and\ndifficulty, where there could be new state or action variables that never\noccurred in previous environments. To address this challenging setting, we\nintroduce a causality-guided self-adaptive representation-based approach,\ncalled CSR, that equips the agent to generalize effectively and efficiently\nacross a sequence of tasks with evolving dynamics. Specifically, we employ\ncausal representation learning to characterize the latent causal variables and\nworld models within the RL system. Such compact causal representations uncover\nthe structural relationships among variables, enabling the agent to\nautonomously determine whether changes in the environment stem from\ndistribution shifts or variations in space, and to precisely locate these\nchanges. We then devise a three-step strategy to fine-tune the model under\ndifferent scenarios accordingly. Empirical experiments show that CSR\nefficiently adapts to the target domains with only a few samples and\noutperforms state-of-the-art baselines on a wide range of scenarios, including\nour simulated environments, Cartpole, and Atari games.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}