{"id":"2407.00769","title":"Achieving Energetic Superiority Through System-Level Quantum Circuit\n  Simulation","authors":"Rong Fu, Zhongling Su, Han-Sen Zhong, Xiti Zhao, Jianyang Zhang, Feng\n  Pan, Pan Zhang, Xianhe Zhao, Ming-Cheng Chen, Chao-Yang Lu, Jian-Wei Pan,\n  Zhiling Pei, Xingcheng Zhang, Wanli Ouyang","authorsParsed":[["Fu","Rong",""],["Su","Zhongling",""],["Zhong","Han-Sen",""],["Zhao","Xiti",""],["Zhang","Jianyang",""],["Pan","Feng",""],["Zhang","Pan",""],["Zhao","Xianhe",""],["Chen","Ming-Cheng",""],["Lu","Chao-Yang",""],["Pan","Jian-Wei",""],["Pei","Zhiling",""],["Zhang","Xingcheng",""],["Ouyang","Wanli",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 17:14:59 GMT"}],"updateDate":"2024-07-02","timestamp":1719767699000,"abstract":"  Quantum Computational Superiority boasts rapid computation and high energy\nefficiency. Despite recent advances in classical algorithms aimed at refuting\nthe milestone claim of Google's sycamore, challenges remain in generating\nuncorrelated samples of random quantum circuits. In this paper, we present a\ngroundbreaking large-scale system technology that leverages optimization on\nglobal, node, and device levels to achieve unprecedented scalability for tensor\nnetworks. This enables the handling of large-scale tensor networks with memory\ncapacities reaching tens of terabytes, surpassing memory space constraints on a\nsingle node. Our techniques enable accommodating large-scale tensor networks\nwith up to tens of terabytes of memory, reaching up to 2304 GPUs with a peak\ncomputing power of 561 PFLOPS half-precision. Notably, we have achieved a\ntime-to-solution of 14.22 seconds with energy consumption of 2.39 kWh which\nachieved fidelity of 0.002 and our most remarkable result is a time-to-solution\nof 17.18 seconds, with energy consumption of only 0.29 kWh which achieved a XEB\nof 0.002 after post-processing, outperforming Google's quantum processor\nSycamore in both speed and energy efficiency, which recorded 600 seconds and\n4.3 kWh, respectively.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"clZGFor9nzGWpmkWL2oF_s6FdL_iFvdkfvshaJ91MfQ","pdfSize":"11269145"}
