{"id":"2407.08403","title":"Ethics of Generating Synthetic MRI Vocal Tract Views from the Face","authors":"Muhammad Suhaib Shahid, Gleb E. Yakubov, Andrew P. French","authorsParsed":[["Shahid","Muhammad Suhaib",""],["Yakubov","Gleb E.",""],["French","Andrew P.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 11:12:48 GMT"}],"updateDate":"2024-07-12","timestamp":1720696368000,"abstract":"  Forming oral models capable of understanding the complete dynamics of the\noral cavity is vital across research areas such as speech correction, designing\nfoods for the aging population, and dentistry. Magnetic resonance imaging (MRI)\ntechnologies, capable of capturing oral data essential for creating such\ndetailed representations, offer a powerful tool for illustrating articulatory\ndynamics. However, its real-time application is hindered by expense and\nexpertise requirements. Ever advancing generative AI approaches present\nthemselves as a way to address this barrier by leveraging multi-modal\napproaches for generating pseudo-MRI views. Nonetheless, this immediately\nsparks ethical concerns regarding the utilisation of a technology with the\ncapability to produce MRIs from facial observations.\n  This paper explores the ethical implications of external-to-internal\ncorrelation modeling (E2ICM). E2ICM utilises facial movements to infer internal\nconfigurations and provides a cost-effective supporting technology for MRI. In\nthis preliminary work, we employ Pix2PixGAN to generate pseudo-MRI views from\nexternal articulatory data, demonstrating the feasibility of this approach.\nEthical considerations concerning privacy, consent, and potential misuse, which\nare fundamental to our examination of this innovative methodology, are\ndiscussed as a result of this experimentation.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bG5I1BY40pz7L-s37OtTWGbe_KFqxp4L6FdsTyBpjbE","pdfSize":"408168","objectId":"0xc0439ec94d0767a3cdab2d04af378faf9fbaef6a2f929cb8da31830bed42152d","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
