{"id":"2407.05385","title":"Harmony in Diversity: Merging Neural Networks with Canonical Correlation\n  Analysis","authors":"Stefan Horoi, Albert Manuel Orozco Camacho, Eugene Belilovsky, Guy\n  Wolf","authorsParsed":[["Horoi","Stefan",""],["Camacho","Albert Manuel Orozco",""],["Belilovsky","Eugene",""],["Wolf","Guy",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 14:21:04 GMT"}],"updateDate":"2024-07-09","timestamp":1720362064000,"abstract":"  Combining the predictions of multiple trained models through ensembling is\ngenerally a good way to improve accuracy by leveraging the different learned\nfeatures of the models, however it comes with high computational and storage\ncosts. Model fusion, the act of merging multiple models into one by combining\ntheir parameters reduces these costs but doesn't work as well in practice.\nIndeed, neural network loss landscapes are high-dimensional and non-convex and\nthe minima found through learning are typically separated by high loss\nbarriers. Numerous recent works have been focused on finding permutations\nmatching one network features to the features of a second one, lowering the\nloss barrier on the linear path between them in parameter space. However,\npermutations are restrictive since they assume a one-to-one mapping between the\ndifferent models' neurons exists. We propose a new model merging algorithm, CCA\nMerge, which is based on Canonical Correlation Analysis and aims to maximize\nthe correlations between linear combinations of the model features. We show\nthat our alignment method leads to better performances than past methods when\naveraging models trained on the same, or differing data splits. We also extend\nthis analysis into the harder setting where more than 2 models are merged, and\nwe find that CCA Merge works significantly better than past methods. Our code\nis publicly available at https://github.com/shoroi/align-n-merge\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}