{"id":"2407.21332","title":"Multi-Purpose Architecture for Fast Reset and Protective Readout of\n  Superconducting Qubits","authors":"Jiayu Ding, Yulong Li, He Wang, Guangming Xue, Tang Su, Chenlu Wang,\n  Weijie Sun, Feiyu Li, Yujia Zhang, Yang Gao, Jun Peng, Zhi Hao Jiang, Yang\n  Yu, Haifeng Yu, Fei Yan","authorsParsed":[["Ding","Jiayu",""],["Li","Yulong",""],["Wang","He",""],["Xue","Guangming",""],["Su","Tang",""],["Wang","Chenlu",""],["Sun","Weijie",""],["Li","Feiyu",""],["Zhang","Yujia",""],["Gao","Yang",""],["Peng","Jun",""],["Jiang","Zhi Hao",""],["Yu","Yang",""],["Yu","Haifeng",""],["Yan","Fei",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 04:44:40 GMT"}],"updateDate":"2024-08-01","timestamp":1722401080000,"abstract":"  The ability to fast reset a qubit state is crucial for quantum information\nprocessing. However, to actively reset a qubit requires engineering a pathway\nto interact with a dissipative bath, which often comes with the cost of reduced\nqubit protection from the environment. Here, we present a novel multi-purpose\narchitecture that enables fast reset and protection of superconducting qubits\nduring control and readout. In our design, two on-chip diplexers are connected\nby two transmission lines. The high-pass branch provides a flat passband for\nconvenient allocation of readout resonators above the qubit frequencies, which\nis preferred for reducing measurement-induced state transitions. In the\nlow-pass branch, we leverage a standing-wave mode below the maximum qubit\nfrequency for a rapid reset. The qubits are located in the common stopband to\ninhibit dissipation during coherent operations. We demonstrate resetting a\ntransmon qubit from its first excited state to the ground state in 100 ns,\nachieving a residual population of 2.7%, mostly limited by the thermal effect.\nThe reset time may be further shortened to 27 ns by exploiting the coherent\npopulation inversion effect. We further extend the technique to resetting the\nqubit from its second excited state. Our approach promises scalable\nimplementation of fast reset and qubit protection during control and readout,\nadding to the toolbox of dissipation engineering.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}