{"id":"2407.16308","title":"SAFNet: Selective Alignment Fusion Network for Efficient HDR Imaging","authors":"Lingtong Kong, Bo Li, Yike Xiong, Hao Zhang, Hong Gu, Jinwei Chen","authorsParsed":[["Kong","Lingtong",""],["Li","Bo",""],["Xiong","Yike",""],["Zhang","Hao",""],["Gu","Hong",""],["Chen","Jinwei",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 09:02:35 GMT"}],"updateDate":"2024-07-24","timestamp":1721725355000,"abstract":"  Multi-exposure High Dynamic Range (HDR) imaging is a challenging task when\nfacing truncated texture and complex motion. Existing deep learning-based\nmethods have achieved great success by either following the alignment and\nfusion pipeline or utilizing attention mechanism. However, the large\ncomputation cost and inference delay hinder them from deploying on resource\nlimited devices. In this paper, to achieve better efficiency, a novel Selective\nAlignment Fusion Network (SAFNet) for HDR imaging is proposed. After extracting\npyramid features, it jointly refines valuable area masks and cross-exposure\nmotion in selected regions with shared decoders, and then fuses high quality\nHDR image in an explicit way. This approach can focus the model on finding\nvaluable regions while estimating their easily detectable and meaningful\nmotion. For further detail enhancement, a lightweight refine module is\nintroduced which enjoys privileges from previous optical flow, selection masks\nand initial prediction. Moreover, to facilitate learning on samples with large\nmotion, a new window partition cropping method is presented during training.\nExperiments on public and newly developed challenging datasets show that\nproposed SAFNet not only exceeds previous SOTA competitors quantitatively and\nqualitatively, but also runs order of magnitude faster. Code and dataset is\navailable at https://github.com/ltkong218/SAFNet.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}