{"id":"2407.07474","title":"Searcher Competition in Block Building","authors":"Akaki Mamageishvili, Christoph Schlegel, Benny Sudakov, Danning Sui","authorsParsed":[["Mamageishvili","Akaki",""],["Schlegel","Christoph",""],["Sudakov","Benny",""],["Sui","Danning",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 08:58:45 GMT"}],"updateDate":"2024-07-11","timestamp":1720601925000,"abstract":"  We study the amount of maximal extractable value (MEV) captured by\nvalidators, as a function of searcher competition, in blockchains with\ncompetitive block building markets such as Ethereum. We argue that the core is\na suitable solution concept in this context that makes robust predictions that\nare independent of implementation details or specific mechanisms chosen. We\ncharacterize how much value validators extract in the core and quantify the\nsurplus share of validators as a function of searcher competition. Searchers\ncan obtain at most the marginal value increase of the winning block relative to\nthe best block that can be built without their bundles. Dually this gives a\nlower bound on the value extracted by the validator. If arbitrages are easy to\nfind and many searchers find similar bundles, the validator gets paid all value\nalmost surely, while searchers can capture most value if there is little\nsearcher competition per arbitrage. For the case of passive block-proposers we\nstudy, moreover, mechanisms that implement core allocations in dominant\nstrategies and find that for submodular value, there is a unique\ndominant-strategy incentive compatible core-selecting mechanism that gives each\nsearcher exactly their marginal value contribution to the winning block. We\nvalidate our theoretical prediction empirically with aggregate bundle data and\nfind a significant positive relation between the number of submitted backruns\nfor the same opportunity and the median value captured by the proposer from the\nopportunity.\n","subjects":["Computing Research Repository/Computer Science and Game Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}