{"id":"2407.11748","title":"Ubiquitous Metadata: Design and Fabrication of Embedded Markers for\n  Real-World Object Identification and Interaction","authors":"Mustafa Doga Dogan","authorsParsed":[["Dogan","Mustafa Doga",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:14:52 GMT"}],"updateDate":"2024-07-17","timestamp":1721139292000,"abstract":"  The convergence of the physical and digital realms has ushered in a new era\nof immersive experiences and seamless interactions. As the boundaries between\nthe real world and virtual environments blur and result in a \"mixed reality,\"\nthere arises a need for robust and efficient methods to connect physical\nobjects with their virtual counterparts. In this thesis, we present a novel\napproach to bridging this gap through the design, fabrication, and detection of\nembedded machine-readable markers.\n  We categorize the proposed marking approaches into three distinct categories:\nnatural markers, structural markers, and internal markers. Natural markers,\nsuch as those used in SensiCut, are inherent fingerprints of objects repurposed\nas machine-readable identifiers, while structural markers, such as StructCode\nand G-ID, leverage the structural artifacts in objects that emerge during the\nfabrication process itself. Internal markers, such as InfraredTag and\nBrightMarker, are embedded inside fabricated objects using specialized\nmaterials. Leveraging a combination of methods from computer vision, machine\nlearning, computational imaging, and material science, the presented approaches\noffer robust and versatile solutions for object identification, tracking, and\ninteraction.\n  These markers, seamlessly integrated into real-world objects, effectively\ncommunicate an object's identity, origin, function, and interaction,\nfunctioning as gateways to \"ubiquitous metadata\" - a concept where metadata is\nembedded into physical objects, similar to metadata in digital files. Across\nthe different chapters, we demonstrate the applications of the presented\nmethods in diverse domains, including product design, manufacturing, retail,\nlogistics, education, entertainment, security, and sustainability.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Emerging Technologies","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/"}