{"id":"2407.16734","title":"Real time detection of C reactive protein in interstitial fluid using\n  electrochemical impedance spectroscopy, towards wearable health monitoring","authors":"Aristea Grammoustianou, Ali Saeidi, Johan Longo, Felix Risch, Adrian\n  M. Ionescu","authorsParsed":[["Grammoustianou","Aristea",""],["Saeidi","Ali",""],["Longo","Johan",""],["Risch","Felix",""],["Ionescu","Adrian M.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 15:45:06 GMT"}],"updateDate":"2024-07-25","timestamp":1721749506000,"abstract":"  Traditional detection methods of C-reactive protein (CRP) inflammation\nbiomarker, in blood are expensive, time-consuming and labor-intensive. Such\nexisting point-of-care CRP detection devices remain invasive, since they need\nblood sampling (finger-pricking or venous puncture). Here, we propose an\nelectrochemical impedance spectroscopy (EIS)-based sensor for the real-time,\nfast, specific, sensitive, and label-free detection of C-reactive protein in\nthe interstitial fluid (ISF) that can be accessed with minimally invasive\nmicroneedle arrays. The sensor has the potential to be integrated in a wearable\ndevice similar with the continuous glucose monitoring, that will detect CRP in\ninterstitial fluid in a non-invasive, inexpensive and straightforward manner.\nThe affinity based assay was tested in both buffer and ISF-like solution. The\nlimit of detection achieved was 0.7 ug/mL of CRP in buffer, and 0.8 ug/mL of\nCRP in ISF-like solution and the sensor shows excellent linearity up to 10\nug/mL. It is worth noting that the proposed sensor operates in low sample\nvolume (down to 5 uL), and has a response time of 100 seconds.\n","subjects":["Physics/Medical Physics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gOCaAmYp4_V6bPhPuNiu4tIyTWooEf_ahSbxVNYQuf4","pdfSize":"753713","objectId":"0xb5b30f12b3a446152ef7408c70ea3926a3a63f727edd9f9b79fb2a419113cbcc","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
