{"id":"2407.14668","title":"Towards a \"universal translator\" for neural dynamics at single-cell,\n  single-spike resolution","authors":"Yizi Zhang, Yanchen Wang, Donato Jimenez-Beneto, Zixuan Wang, Mehdi\n  Azabou, Blake Richards, Olivier Winter, International Brain Laboratory, Eva\n  Dyer, Liam Paninski, Cole Hurwitz","authorsParsed":[["Zhang","Yizi",""],["Wang","Yanchen",""],["Jimenez-Beneto","Donato",""],["Wang","Zixuan",""],["Azabou","Mehdi",""],["Richards","Blake",""],["Winter","Olivier",""],["Laboratory","International Brain",""],["Dyer","Eva",""],["Paninski","Liam",""],["Hurwitz","Cole",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 21:05:28 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 16:14:27 GMT"}],"updateDate":"2024-07-24","timestamp":1721423128000,"abstract":"  Neuroscience research has made immense progress over the last decade, but our\nunderstanding of the brain remains fragmented and piecemeal: the dream of\nprobing an arbitrary brain region and automatically reading out the information\nencoded in its neural activity remains out of reach. In this work, we build\ntowards a first foundation model for neural spiking data that can solve a\ndiverse set of tasks across multiple brain areas. We introduce a novel\nself-supervised modeling approach for population activity in which the model\nalternates between masking out and reconstructing neural activity across\ndifferent time steps, neurons, and brain regions. To evaluate our approach, we\ndesign unsupervised and supervised prediction tasks using the International\nBrain Laboratory repeated site dataset, which is comprised of Neuropixels\nrecordings targeting the same brain locations across 48 animals and\nexperimental sessions. The prediction tasks include single-neuron and\nregion-level activity prediction, forward prediction, and behavior decoding. We\ndemonstrate that our multi-task-masking (MtM) approach significantly improves\nthe performance of current state-of-the-art population models and enables\nmulti-task learning. We also show that by training on multiple animals, we can\nimprove the generalization ability of the model to unseen animals, paving the\nway for a foundation model of the brain at single-cell, single-spike\nresolution.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Machine Learning","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"99tSGuKDQhnHnJB96xQmbctwEEf5UYYpj2-oqDQIy2o","pdfSize":"13920800"}
