{"id":"2407.05528","title":"An accurate detection is not all you need to combat label noise in\n  web-noisy datasets","authors":"Paul Albert, Jack Valmadre, Eric Arazo, Tarun Krishna, Noel E.\n  O'Connor, Kevin McGuinness","authorsParsed":[["Albert","Paul",""],["Valmadre","Jack",""],["Arazo","Eric",""],["Krishna","Tarun",""],["O'Connor","Noel E.",""],["McGuinness","Kevin",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 00:21:42 GMT"}],"updateDate":"2024-07-09","timestamp":1720398102000,"abstract":"  Training a classifier on web-crawled data demands learning algorithms that\nare robust to annotation errors and irrelevant examples. This paper builds upon\nthe recent empirical observation that applying unsupervised contrastive\nlearning to noisy, web-crawled datasets yields a feature representation under\nwhich the in-distribution (ID) and out-of-distribution (OOD) samples are\nlinearly separable. We show that direct estimation of the separating hyperplane\ncan indeed offer an accurate detection of OOD samples, and yet, surprisingly,\nthis detection does not translate into gains in classification accuracy.\nDigging deeper into this phenomenon, we discover that the near-perfect\ndetection misses a type of clean examples that are valuable for supervised\nlearning. These examples often represent visually simple images, which are\nrelatively easy to identify as clean examples using standard loss- or\ndistance-based methods despite being poorly separated from the OOD distribution\nusing unsupervised learning. Because we further observe a low correlation with\nSOTA metrics, this urges us to propose a hybrid solution that alternates\nbetween noise detection using linear separation and a state-of-the-art (SOTA)\nsmall-loss approach. When combined with the SOTA algorithm PLS, we\nsubstantially improve SOTA results for real-world image classification in the\npresence of web noise github.com/PaulAlbert31/LSA\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}