{"id":"2407.03954","title":"Efficient Maximal Frequent Group Enumeration in Temporal Bipartite\n  Graphs","authors":"Yanping Wu, Renjie Sun, Xiaoyang Wang, Dong Wen, Ying Zhang, Lu Qin,\n  Xuemin Lin","authorsParsed":[["Wu","Yanping",""],["Sun","Renjie",""],["Wang","Xiaoyang",""],["Wen","Dong",""],["Zhang","Ying",""],["Qin","Lu",""],["Lin","Xuemin",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 14:16:18 GMT"}],"updateDate":"2024-07-08","timestamp":1720102578000,"abstract":"  Cohesive subgraph mining is a fundamental problem in bipartite graph\nanalysis. In reality, relationships between two types of entities often occur\nat some specific timestamps, which can be modeled as a temporal bipartite\ngraph. However, the temporal information is widely neglected by previous\nstudies. Moreover, directly extending the existing models may fail to find some\ncritical groups in temporal bipartite graphs, which appear in a unilateral\n(i.e., one-layer) form. To fill the gap, in this paper, we propose a novel\nmodel, called maximal \\lambda-frequency group (MFG). Given a temporal bipartite\ngraph G=(U,V,E), a vertex set V_S \\subseteq V is an MFG if i) there are no less\nthan \\lambda timestamps, at each of which V_S can form a (t_U,t_V)-biclique\nwith some vertices in U at the corresponding snapshot, and ii) it is maximal.\nTo solve the problem, a filter-and-verification (FilterV) method is proposed\nbased on the Bron-Kerbosch framework, incorporating novel filtering techniques\nto reduce the search space and array-based strategy to accelerate the frequency\nand maximality verification. Nevertheless, the cost of frequency verification\nin each valid candidate set computation and maximality check could limit the\nscalability of FilterV to larger graphs. Therefore, we further develop a novel\nverification-free (VFree) approach by leveraging the advanced dynamic counting\nstructure proposed. Theoretically, we prove that VFree can reduce the cost of\neach valid candidate set computation in FilterV by a factor of O(|V|).\nFurthermore, VFree can avoid the explicit maximality verification because of\nthe developed search paradigm. Finally, comprehensive experiments on 15\nreal-world graphs are conducted to demonstrate the efficiency and effectiveness\nof the proposed techniques and model.\n","subjects":["Computing Research Repository/Databases"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}