{"id":"2407.15199","title":"Multiple Object Detection and Tracking in Panoramic Videos for Cycling\n  Safety Analysis","authors":"Jingwei Guo, Meihui Wang, Ilya Ilyankou, Natchapon Jongwiriyanurak,\n  Xiaowei Gao, Nicola Christie, James Haworth","authorsParsed":[["Guo","Jingwei",""],["Wang","Meihui",""],["Ilyankou","Ilya",""],["Jongwiriyanurak","Natchapon",""],["Gao","Xiaowei",""],["Christie","Nicola",""],["Haworth","James",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 15:37:55 GMT"}],"updateDate":"2024-07-23","timestamp":1721576275000,"abstract":"  Panoramic cycling videos can record 360{\\deg} views around the cyclists.\nThus, it is essential to conduct automatic road user analysis on them using\ncomputer vision models to provide data for studies on cycling safety. However,\nthe features of panoramic data such as severe distortions, large number of\nsmall objects and boundary continuity have brought great challenges to the\nexisting CV models, including poor performance and evaluation methods that are\nno longer applicable. In addition, due to the lack of data with annotations, it\nis not easy to re-train the models.\n  In response to these problems, the project proposed and implemented a\nthree-step methodology: (1) improve the prediction performance of the\npre-trained object detection models on panoramic data by projecting the\noriginal image into 4 perspective sub-images; (2) introduce supports for\nboundary continuity and category information into DeepSORT, a commonly used\nmultiple object tracking model, and set an improved detection model as its\ndetector; (3) using the tracking results, develop an application for detecting\nthe overtaking behaviour of the surrounding vehicles.\n  Evaluated on the panoramic cycling dataset built by the project, the proposed\nmethodology improves the average precision of YOLO v5m6 and Faster RCNN-FPN\nunder any input resolution setting. In addition, it raises MOTA and IDF1 of\nDeepSORT by 7.6\\% and 9.7\\% respectively. When detecting the overtakes in the\ntest videos, it achieves the F-score of 0.88.\n  The code is available on GitHub at github.com/cuppp1998/360_object_tracking\nto ensure the reproducibility and further improvements of results.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}