{"id":"2407.10590","title":"Deep-Learning-Based Markerless Pose Estimation Systems in Gait Analysis:\n  DeepLabCut Custom Training and the Refinement Function","authors":"Giulia Panconi, Stefano Grasso, Sara Guarducci, Lorenzo Mucchi, Diego\n  Minciacchi, Riccardo Bravi","authorsParsed":[["Panconi","Giulia",""],["Grasso","Stefano",""],["Guarducci","Sara",""],["Mucchi","Lorenzo",""],["Minciacchi","Diego",""],["Bravi","Riccardo",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 10:14:30 GMT"}],"updateDate":"2024-07-16","timestamp":1721038470000,"abstract":"  The current gold standard for the study of human movement is the marker-based\nmotion capture system that offers high precision but constrained by costs and\ncontrolled environments. Markerless pose estimation systems emerge as\necological alternatives, allowing unobtrusive data acquisition in natural\nsettings. This study compares the performance of two popular markerless\nsystems, OpenPose (OP) and DeepLabCut (DLC), in assessing locomotion. Forty\nhealthy subjects walked along a 5 meters walkway equipped with four force\nplatforms and a camera. Gait parameters were obtained using OP BODY 25\nPre-Trained model (OPPT), DLC Model Zoo full human Pre-Trained model (DLCPT)\nand DLC Custom-Trained model (DLCCT), then compared with those acquired from\nthe force platforms as reference system. Our results demonstrated that DLCCT\noutperformed DLCPT and OPPT, highlighting the importance of leveraging\nDeepLabCut transfer learning to enhance the pose estimation performance with a\ncustom-trained neural networks. Moreover, DLCCT, with the implementation of the\nDLC refinement function, offers the most promising markerless pose estimation\nsolution for evaluating locomotion. Therefore, our data provide insights into\nthe DLC training and refinement processes required to achieve optimal\nperformance. This study offers perspectives for clinicians and practitioners\nseeking accurate low-cost methods for movement assessment beyond laboratory\nsettings.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}