{"id":"2407.18416","title":"PersonaGym: Evaluating Persona Agents and LLMs","authors":"Vinay Samuel, Henry Peng Zou, Yue Zhou, Shreyas Chaudhari, Ashwin\n  Kalyan, Tanmay Rajpurohit, Ameet Deshpande, Karthik Narasimhan, Vishvak\n  Murahari","authorsParsed":[["Samuel","Vinay",""],["Zou","Henry Peng",""],["Zhou","Yue",""],["Chaudhari","Shreyas",""],["Kalyan","Ashwin",""],["Rajpurohit","Tanmay",""],["Deshpande","Ameet",""],["Narasimhan","Karthik",""],["Murahari","Vishvak",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 22:24:45 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 02:30:35 GMT"}],"updateDate":"2024-07-30","timestamp":1721946285000,"abstract":"  Persona agents, which are LLM agents that act according to an assigned\npersona, have demonstrated impressive contextual response capabilities across\nvarious applications. These persona agents offer significant enhancements\nacross diverse sectors, such as education, healthcare, and entertainment, where\nmodel developers can align agent responses to different user requirements\nthereby broadening the scope of agent applications. However, evaluating persona\nagent performance is incredibly challenging due to the complexity of assessing\npersona adherence in free-form interactions across various environments that\nare relevant to each persona agent. We introduce PersonaGym, the first dynamic\nevaluation framework for assessing persona agents, and PersonaScore, the first\nautomated human-aligned metric grounded in decision theory for comprehensive\nlarge-scale evaluation of persona agents. Our evaluation of 6 open and\nclosed-source LLMs, using a benchmark encompassing 200 personas and 10,000\nquestions, reveals significant opportunities for advancement in persona agent\ncapabilities across state-of-the-art models. For example, Claude 3.5 Sonnet\nonly has a 2.97% relative improvement in PersonaScore than GPT 3.5 despite\nbeing a much more advanced model. Importantly, we find that increased model\nsize and complexity do not necessarily imply enhanced persona agent\ncapabilities thereby highlighting the pressing need for algorithmic and\narchitectural invention towards faithful and performant persona agents.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"CP_YWPB4xBbqoqJmbBw9sbkin4DN-ks-WK_5xwuiATM","pdfSize":"3333441"}
