{"id":"2407.00312","title":"UDC: A Unified Neural Divide-and-Conquer Framework for Large-Scale\n  Combinatorial Optimization Problems","authors":"Zhi Zheng, Changliang Zhou, Tong Xialiang, Mingxuan Yuan, Zhenkun Wang","authorsParsed":[["Zheng","Zhi",""],["Zhou","Changliang",""],["Xialiang","Tong",""],["Yuan","Mingxuan",""],["Wang","Zhenkun",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 04:29:03 GMT"}],"updateDate":"2024-07-02","timestamp":1719635343000,"abstract":"  Single-stage neural combinatorial optimization solvers have achieved\nnear-optimal results on various small-scale combinatorial optimization (CO)\nproblems without needing expert knowledge. However, these solvers exhibit\nsignificant performance degradation when applied to large-scale CO problems.\nRecently, two-stage neural methods with divide-and-conquer strategies have\nshown superiorities in addressing large-scale CO problems. Nevertheless, the\nefficiency of these methods highly relies on problem-specific heuristics in\neither the divide or the conquer procedure, which limits their applicability to\ngeneral CO problems. Moreover, these methods employ separate training schemes\nand ignore the interdependencies between the dividing and conquering\nstrategies, which often leads to sub-optimal solutions. To tackle these\ndrawbacks, this article develops a unified neural divide-and-conquer framework\n(i.e., UDC) for solving general large-scale CO problems. UDC offers a\nDivide-Conquer-Reunion (DCR) training method to eliminate the negative impact\nof a sub-optimal dividing policy. Employing a high-efficiency Graph Neural\nNetwork (GNN) for global dividing and a fixed-length sub-path solver for\nconquering sub-problems, the proposed UDC framework demonstrates extensive\napplicability, achieving superior performance in 10 representative large-scale\nCO problems.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}