{"id":"2407.18284","title":"Physics-guided machine learning predicts the planet-scale performance of\n  solar farms with sparse, heterogeneous, public data","authors":"Jabir Bin Jahangir, Muhammad Ashraful Alam","authorsParsed":[["Jahangir","Jabir Bin",""],["Alam","Muhammad Ashraful",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 08:06:21 GMT"}],"updateDate":"2024-07-29","timestamp":1721894781000,"abstract":"  The photovoltaics (PV) technology landscape is evolving rapidly. To predict\nthe potential and scalability of emerging PV technologies, a global\nunderstanding of these systems' performance is essential. Traditionally,\nexperimental and computational studies at large national research facilities\nhave focused on PV performance in specific regional climates. However,\nsynthesizing these regional studies to understand the worldwide performance\npotential has proven difficult. Given the expense of obtaining experimental\ndata, the challenge of coordinating experiments at national labs across a\npolitically-divided world, and the data-privacy concerns of large commercial\noperators, however, a fundamentally different, data-efficient approach is\ndesired. Here, we present a physics-guided machine learning (PGML) scheme to\ndemonstrate that: (a) The world can be divided into a few PV-specific climate\nzones, called PVZones, illustrating that the relevant meteorological conditions\nare shared across continents; (b) by exploiting the climatic similarities,\nhigh-quality monthly energy yield data from as few as five locations can\naccurately predict yearly energy yield potential with high spatial resolution\nand a root mean square error of less than 8 kWhm$^{2}$, and (c) even with\nnoisy, heterogeneous public PV performance data, the global energy yield can be\npredicted with less than 6% relative error compared to physics-based\nsimulations provided that the dataset is representative. This PGML scheme is\nagnostic to PV technology and farm topology, making it adaptable to new PV\ntechnologies or farm configurations. The results encourage physics-guided,\ndata-driven collaboration among national policymakers and research\norganizations to build efficient decision support systems for accelerated PV\nqualification and deployment across the world.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Applied Physics","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"vD3uTrzGdK8p0jsF7BMKM-jZAboRfrl6VCAngZn0aEA","pdfSize":"3586373"}
