{"id":"2407.02657","title":"Large Scale Hierarchical Industrial Demand Time-Series Forecasting\n  incorporating Sparsity","authors":"Harshavardhan Kamarthi, Aditya B. Sasanur, Xinjie Tong, Xingyu Zhou,\n  James Peters, Joe Czyzyk, B. Aditya Prakash","authorsParsed":[["Kamarthi","Harshavardhan",""],["Sasanur","Aditya B.",""],["Tong","Xinjie",""],["Zhou","Xingyu",""],["Peters","James",""],["Czyzyk","Joe",""],["Prakash","B. Aditya",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 20:40:08 GMT"}],"updateDate":"2024-07-04","timestamp":1719952808000,"abstract":"  Hierarchical time-series forecasting (HTSF) is an important problem for many\nreal-world business applications where the goal is to simultaneously forecast\nmultiple time-series that are related to each other via a hierarchical\nrelation. Recent works, however, do not address two important challenges that\nare typically observed in many demand forecasting applications at large\ncompanies. First, many time-series at lower levels of the hierarchy have high\nsparsity i.e., they have a significant number of zeros. Most HTSF methods do\nnot address this varying sparsity across the hierarchy. Further, they do not\nscale well to the large size of the real-world hierarchy typically unseen in\nbenchmarks used in literature. We resolve both these challenges by proposing\nHAILS, a novel probabilistic hierarchical model that enables accurate and\ncalibrated probabilistic forecasts across the hierarchy by adaptively modeling\nsparse and dense time-series with different distributional assumptions and\nreconciling them to adhere to hierarchical constraints. We show the scalability\nand effectiveness of our methods by evaluating them against real-world demand\nforecasting datasets. We deploy HAILS at a large chemical manufacturing company\nfor a product demand forecasting application with over ten thousand products\nand observe a significant 8.5\\% improvement in forecast accuracy and 23% better\nimprovement for sparse time-series. The enhanced accuracy and scalability make\nHAILS a valuable tool for improved business planning and customer experience.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BBY8KeM4rxTb44TbUd_uBKTMgatjZh-MTJG6kF8asmI","pdfSize":"2023153"}
