{"id":"2407.10614","title":"Investigating shocking events in the Ethereum stablecoin ecosystem\n  through temporal multilayer graph structure","authors":"Cheick Tidiane Ba, Richard G. Clegg, Ben A. Steer, Matteo Zignani","authorsParsed":[["Ba","Cheick Tidiane",""],["Clegg","Richard G.",""],["Steer","Ben A.",""],["Zignani","Matteo",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 10:58:18 GMT"}],"updateDate":"2024-07-16","timestamp":1721041098000,"abstract":"  In the dynamic landscape of the Web, we are witnessing the emergence of the\nWeb3 paradigm, which dictates that platforms should rely on blockchain\ntechnology and cryptocurrencies to sustain themselves and their profitability.\nCryptocurrencies are characterised by high market volatility and susceptibility\nto substantial crashes, issues that require temporal analysis methodologies\nable to tackle the high temporal resolution, heterogeneity and scale of\nblockchain data. While existing research attempts to analyse crash events,\nfundamental questions persist regarding the optimal time scale for analysis,\ndifferentiation between long-term and short-term trends, and the identification\nand characterisation of shock events within these decentralised systems. This\npaper addresses these issues by examining cryptocurrencies traded on the\nEthereum blockchain, with a spotlight on the crash of the stablecoin TerraUSD\nand the currency LUNA designed to stabilise it. Utilising complex network\nanalysis and a multi-layer temporal graph allows the study of the correlations\nbetween the layers representing the currencies and system evolution across\ndiverse time scales. The investigation sheds light on the strong\ninterconnections among stablecoins pre-crash and the significant post-crash\ntransformations. We identify anomalous signals before, during, and after the\ncollapse, emphasising their impact on graph structure metrics and user movement\nacross layers. This paper pioneers temporal, cross-chain graph analysis to\nexplore a cryptocurrency collapse. It emphasises the importance of temporal\nanalysis for studies on web-derived data and how graph-based analysis can\nenhance traditional econometric results. Overall, this research carries\nimplications beyond its field, for example for regulatory agencies aiming to\nsafeguard users from shocks and monitor investment risks for citizens and\nclients.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/"}