{"id":"2407.12462","title":"Affine Connection and Quantum Theory","authors":"Kaushik Ghosh","authorsParsed":[["Ghosh","Kaushik",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 10:26:18 GMT"}],"updateDate":"2024-07-18","timestamp":1721211978000,"abstract":"  In a few recent manuscripts, we used the affine connection to introduce two\nmassless scalar fields in the Einstein-Palatini action. These fields lead to\nnon-metricity. In this article, we will discuss the significance of these\nfields in inflation and dark energy. We will construct a Lagrangian formalism\nto include these scalar fields in a theory of gravity coupled with ordinary\nmatter and radiation. We will find that these fields need not to be included in\nthe actions of interacting gauge theories coupled with conserved fermionic\nvector currents as a part of the connection. The same remains valid for\nordinary scalar fields. We can couple the connection-scalars with ordinary\nmatter by adding suitable interaction terms. In this context, we will find that\nStokes' theorem leads us to include the right-handed neutrinos in the\nelectroweak theory in curved spacetime even with the Levi-Civita connection.\nThis is required to obtain consistent equations of motion and anomaly-free\nconserved vector current for the neutrinos. Axial vector currents for different\nDirac fields may remain anomalous. The right-handed neutrinos can be useful to\nexplain neutrino oscillation and dark matter. We will also discuss the\npossibility of introducing massless finite integer spin particles using second\nrank symmetric traceless tensors with reference to the corresponding little\ngroup in flat spacetime. We will show that we can use massless (A,A) type\nfields in Minkowski space to introduce massless finite integer spin particles.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"L2AOSyXM5cqRRqD4QqpJYSMM85JGJwSnTDa-EXz9Q7Q","pdfSize":"240726"}
