{"id":"2407.14649","title":"The Collection of a Human Robot Collaboration Dataset for Cooperative\n  Assembly in Glovebox Environments","authors":"Shivansh Sharma, Mathew Huang, Sanat Nair, Alan Wen, Christina\n  Petlowany, Juston Moore, Selma Wanna, Mitch Pryor","authorsParsed":[["Sharma","Shivansh",""],["Huang","Mathew",""],["Nair","Sanat",""],["Wen","Alan",""],["Petlowany","Christina",""],["Moore","Juston",""],["Wanna","Selma",""],["Pryor","Mitch",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 19:56:53 GMT"}],"updateDate":"2024-07-23","timestamp":1721419013000,"abstract":"  Industry 4.0 introduced AI as a transformative solution for modernizing\nmanufacturing processes. Its successor, Industry 5.0, envisions humans as\ncollaborators and experts guiding these AI-driven manufacturing solutions.\nDeveloping these techniques necessitates algorithms capable of safe, real-time\nidentification of human positions in a scene, particularly their hands, during\ncollaborative assembly. Although substantial efforts have curated datasets for\nhand segmentation, most focus on residential or commercial domains. Existing\ndatasets targeting industrial settings predominantly rely on synthetic data,\nwhich we demonstrate does not effectively transfer to real-world operations.\nMoreover, these datasets lack uncertainty estimations critical for safe\ncollaboration. Addressing these gaps, we present HAGS: Hand and Glove\nSegmentation Dataset. This dataset provides 1200 challenging examples to build\napplications toward hand and glove segmentation in industrial human-robot\ncollaboration scenarios as well as assess out-of-distribution images,\nconstructed via green screen augmentations, to determine ML-classifier\nrobustness. We study state-of-the-art, real-time segmentation models to\nevaluate existing methods. Our dataset and baselines are publicly available:\nhttps://dataverse.tdl.org/dataset.xhtml?persistentId=doi:10.18738/T8/85R7KQ and\nhttps://github.com/UTNuclearRoboticsPublic/assembly_glovebox_dataset.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"85nh3RFtswCUCootLn5sHlyF5rMi7CeC5HGSXGFALag","pdfSize":"3572902"}
