{"id":"2407.00281","title":"Distinguishing Surface and Bulk Electromagnetism via Their Dynamics in\n  an Intrinsic Magnetic Topological Insulator","authors":"Khanh Duy Nguyen, Woojoo Lee, Jianchen Dang, Tongyao Wu, Gabriele\n  Berruto, Chenhui Yan, Chi Ian Jess Ip, Haoran Lin, Qiang Gao, Seng Huat Lee,\n  Binghai Yan, Chaoxing Liu, Zhiqiang Mao, Xiao-Xiao Zhang, Shuolong Yang","authorsParsed":[["Nguyen","Khanh Duy",""],["Lee","Woojoo",""],["Dang","Jianchen",""],["Wu","Tongyao",""],["Berruto","Gabriele",""],["Yan","Chenhui",""],["Ip","Chi Ian Jess",""],["Lin","Haoran",""],["Gao","Qiang",""],["Lee","Seng Huat",""],["Yan","Binghai",""],["Liu","Chaoxing",""],["Mao","Zhiqiang",""],["Zhang","Xiao-Xiao",""],["Yang","Shuolong",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 02:14:30 GMT"}],"updateDate":"2024-08-13","timestamp":1719627270000,"abstract":"  The indirect exchange interaction between local magnetic moments via surface\nelectrons has been long predicted to bolster the surface ferromagnetism in\nmagnetic topological insulators (MTIs), which facilitates the quantum anomalous\nHall effect. This unconventional effect is critical to determining the\noperating temperatures of future topotronic devices. However, the experimental\nconfirmation of this mechanism remains elusive, especially in intrinsic MTIs.\nHere we combine time-resolved photoemission spectroscopy with time-resolved\nmagneto-optical Kerr effect measurements to elucidate the unique\nelectromagnetism at the surface of an intrinsic MTI MnBi2Te4. Theoretical\nmodeling based on 2D Ruderman-Kittel-Kasuya-Yosida interactions captures the\ninitial quenching of a surface-rooted exchange gap within a factor of two but\nover-estimates the bulk demagnetization by one order of magnitude. This\nmechanism directly explains the sizable gap in the quasi-2D electronic state\nand the nonzero residual magnetization in even-layer MnBi2Te4. Furthermore, it\nleads to efficient light-induced demagnetization comparable to state-of-the-art\nmagnetophotonic crystals, promising an effective manipulation of magnetism and\ntopological orders for future topotronics.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}