{"id":"2407.08126","title":"Label-anticipated Event Disentanglement for Audio-Visual Video Parsing","authors":"Jinxing Zhou, Dan Guo, Yuxin Mao, Yiran Zhong, Xiaojun Chang, Meng\n  Wang","authorsParsed":[["Zhou","Jinxing",""],["Guo","Dan",""],["Mao","Yuxin",""],["Zhong","Yiran",""],["Chang","Xiaojun",""],["Wang","Meng",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 01:57:08 GMT"}],"updateDate":"2024-07-12","timestamp":1720663028000,"abstract":"  Audio-Visual Video Parsing (AVVP) task aims to detect and temporally locate\nevents within audio and visual modalities. Multiple events can overlap in the\ntimeline, making identification challenging. While traditional methods usually\nfocus on improving the early audio-visual encoders to embed more effective\nfeatures, the decoding phase -- crucial for final event classification, often\nreceives less attention. We aim to advance the decoding phase and improve its\ninterpretability. Specifically, we introduce a new decoding paradigm,\n\\underline{l}abel s\\underline{e}m\\underline{a}ntic-based \\underline{p}rojection\n(LEAP), that employs labels texts of event categories, each bearing distinct\nand explicit semantics, for parsing potentially overlapping events.LEAP works\nby iteratively projecting encoded latent features of audio/visual segments onto\nsemantically independent label embeddings. This process, enriched by modeling\ncross-modal (audio/visual-label) interactions, gradually disentangles event\nsemantics within video segments to refine relevant label embeddings,\nguaranteeing a more discriminative and interpretable decoding process. To\nfacilitate the LEAP paradigm, we propose a semantic-aware optimization\nstrategy, which includes a novel audio-visual semantic similarity loss\nfunction. This function leverages the Intersection over Union of audio and\nvisual events (EIoU) as a novel metric to calibrate audio-visual similarities\nat the feature level, accommodating the varied event densities across\nmodalities. Extensive experiments demonstrate the superiority of our method,\nachieving new state-of-the-art performance for AVVP and also enhancing the\nrelevant audio-visual event localization task.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}