{"id":"2407.19085","title":"Hybrid Skyrmions in Magnetic Multilayer Thin Films are Half-Integer\n  Hopfions","authors":"William S. Parker, Jacques A. Reddinger, Benjamin J. McMorran","authorsParsed":[["Parker","William S.",""],["Reddinger","Jacques A.",""],["McMorran","Benjamin J.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 21:07:02 GMT"}],"updateDate":"2024-07-30","timestamp":1722028022000,"abstract":"  Magnetic skyrmions are chiral spin textures which have attracted intense\nresearch for their fundamentally novel physics and potential applications as\nspintronic information carriers. The stability which makes them so potentially\nuseful is a result of their underlying non-trivial topology. While skyrmions\nwere originally predicted and observed in crystalline materials lacking\ninversion symmetry, some of the most promising host systems for skyrmions are\nmultilayer thin films, where skyrmions have been stabilized at ambient\nconditions, which is critical for their use in real world devices. The\nskyrmions found in multilayer thin films have additional three-dimensional\nstructure, with their domain wall helicities twisting through the thickness of\nthe film to create a hybrid skyrmion composed of a Bloch-type core with\nN\\'eel-type caps of opposite chiralities at the surfaces. In this work, we show\nthat this three-dimensional variation creates additional knotted topological\nstructure, providing an explanation for their exceptional stability in ambient\nconditions. We show that hybrid skyrmions can be described as half-integer\nHopfions, and that their field lines have the knotted structure of the Hopf\nfibration. Furthermore, we show that the topological charge of partially\ntwisted hybrid skyrmions can be related to the domain wall helicity at the\nsurfaces, providing a straightforward way to connect experimental measurements\nto underlying topology.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-EuVnmcVf6YbFwh3bnF7jAka8tYAsXvrqIaJQsGMd_k","pdfSize":"5079971"}
