{"id":"2407.19551","title":"Improving Domain Adaptation Through Class Aware Frequency Transformation","authors":"Vikash Kumar, Himanshu Patil, Rohit Lal and Anirban Chakraborty","authorsParsed":[["Kumar","Vikash",""],["Patil","Himanshu",""],["Lal","Rohit",""],["Chakraborty","Anirban",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 18:16:41 GMT"}],"updateDate":"2024-07-30","timestamp":1722190601000,"abstract":"  In this work, we explore the usage of the Frequency Transformation for\nreducing the domain shift between the source and target domain (e.g., synthetic\nimage and real image respectively) towards solving the Domain Adaptation task.\nMost of the Unsupervised Domain Adaptation (UDA) algorithms focus on reducing\nthe global domain shift between labelled source and unlabelled target domains\nby matching the marginal distributions under a small domain gap assumption. UDA\nperformance degrades for the cases where the domain gap between source and\ntarget distribution is large. In order to bring the source and the target\ndomains closer, we propose a novel approach based on traditional image\nprocessing technique Class Aware Frequency Transformation (CAFT) that utilizes\npseudo label based class consistent low-frequency swapping for improving the\noverall performance of the existing UDA algorithms. The proposed approach, when\ncompared with the state-of-the-art deep learning based methods, is\ncomputationally more efficient and can easily be plugged into any existing UDA\nalgorithm to improve its performance. Additionally, we introduce a novel\napproach based on absolute difference of top-2 class prediction probabilities\n(ADT2P) for filtering target pseudo labels into clean and noisy sets. Samples\nwith clean pseudo labels can be used to improve the performance of unsupervised\nlearning algorithms. We name the overall framework as CAFT++. We evaluate the\nsame on the top of different UDA algorithms across many public domain\nadaptation datasets. Our extensive experiments indicate that CAFT++ is able to\nachieve significant performance gains across all the popular benchmarks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}