{"id":"2407.00847","title":"Synaptic effects on the intermittent synchronization of gamma rhythms","authors":"Quynh-Anh Nguyen, Leonid L Rubchinsky","authorsParsed":[["Nguyen","Quynh-Anh",""],["Rubchinsky","Leonid L",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 22:52:39 GMT"}],"updateDate":"2024-07-02","timestamp":1719787959000,"abstract":"  Synchronization of neural activity in the gamma frequency band is associated\nwith various cognitive phenomena. Abnormalities of gamma synchronization may\nunderlie symptoms of several neurological and psychiatric disorders such as\nschizophrenia and autism spectrum disorder. Properties of neural oscillations\nin the gamma band depend critically on the synaptic properties of the\nunderlying circuits. This study explores how synaptic properties in\npyramidal-interneuronal circuits affect not only the average synchronization\nstrength but also the fine temporal patterning of neural synchrony. If two\nsignals show only moderate synchrony strength, it may be possible to consider\nthese dynamics as alternating between synchronized and desynchronized states.\nWe use a model of connected circuits that produces pyramidal-interneuronal\ngamma (PING) oscillations to explore the temporal patterning of synchronized\nand desynchronized intervals. Changes in synaptic strength may alter the\ntemporal patterning of synchronized dynamics (even if the average synchrony\nstrength is not changed). Larger values of local synaptic connections promote\nlonger desynchronization durations, while larger values of long-range synaptic\nconnections promote shorter desynchronization durations. Furthermore, we show\nthat circuits with different temporal patterning of synchronization may have\ndifferent sensitivity to synaptic input. Thus, the alterations of synaptic\nstrength may mediate physiological properties of neural circuits not only\nthrough change in the average synchrony level of gamma oscillations, but also\nthrough change in how synchrony is patterned in time over very short time\nscales.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}