{"id":"2407.08385","title":"Approximate Degree Composition for Recursive Functions","authors":"Sourav Chakraborty, Chandrima Kayal, Rajat Mittal, Manaswi Paraashar,\n  Nitin Saurabh","authorsParsed":[["Chakraborty","Sourav",""],["Kayal","Chandrima",""],["Mittal","Rajat",""],["Paraashar","Manaswi",""],["Saurabh","Nitin",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 10:46:12 GMT"}],"updateDate":"2024-07-12","timestamp":1720694772000,"abstract":"  Determining the approximate degree composition for Boolean functions remains\na significant unsolved problem in Boolean function complexity. In recent\ndecades, researchers have concentrated on proving that approximate degree\ncomposes for special types of inner and outer functions. An important and\nextensively studied class of functions are the recursive functions,\ni.e.~functions obtained by composing a base function with itself a number of\ntimes. Let $h^d$ denote the standard $d$-fold composition of the base function\n$h$.\n  The main result of this work is to show that the approximate degree composes\nif either of the following conditions holds:\n  \\begin{itemize}\n  \\item The outer function $f:\\{0,1\\}^n\\to \\{0,1\\}$ is a recursive function of\nthe form $h^d$, with $h$ being any base function and $d= \\Omega(\\log\\log n)$.\n  \\item The inner function is a recursive function of the form $h^d$, with $h$\nbeing any constant arity base function (other than AND and OR) and $d=\n\\Omega(\\log\\log n)$, where $n$ is the arity of the outer function.\n  \\end{itemize}\n  In terms of proof techniques, we first observe that the lower bound for\ncomposition can be obtained by introducing majority in between the inner and\nthe outer functions. We then show that majority can be \\emph{efficiently\neliminated} if the inner or outer function is a recursive function.\n","subjects":["Computing Research Repository/Computational Complexity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uL7rBMnulhWnQ9kF-W6p4hYf5hMDnhNqyBTb2TbYtQg","pdfSize":"631308"}
