{"id":"2407.12254","title":"COKE: Causal Discovery with Chronological Order and Expert Knowledge in\n  High Proportion of Missing Manufacturing Data","authors":"Ting-Yun Ou, Ching Chang, Wen-Chih Peng","authorsParsed":[["Ou","Ting-Yun",""],["Chang","Ching",""],["Peng","Wen-Chih",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 01:51:27 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 01:21:57 GMT"}],"updateDate":"2024-08-02","timestamp":1721181087000,"abstract":"  Understanding causal relationships between machines is crucial for fault\ndiagnosis and optimization in manufacturing processes. Real-world datasets\nfrequently exhibit up to 90% missing data and high dimensionality from hundreds\nof sensors. These datasets also include domain-specific expert knowledge and\nchronological order information, reflecting the recording order across\ndifferent machines, which is pivotal for discerning causal relationships within\nthe manufacturing data. However, previous methods for handling missing data in\nscenarios akin to real-world conditions have not been able to effectively\nutilize expert knowledge. Conversely, prior methods that can incorporate expert\nknowledge struggle with datasets that exhibit missing values. Therefore, we\npropose COKE to construct causal graphs in manufacturing datasets by leveraging\nexpert knowledge and chronological order among sensors without imputing missing\ndata. Utilizing the characteristics of the recipe, we maximize the use of\nsamples with missing values, derive embeddings from intersections with an\ninitial graph that incorporates expert knowledge and chronological order, and\ncreate a sensor ordering graph. The graph-generating process has been optimized\nby an actor-critic architecture to obtain a final graph that has a maximum\nreward. Experimental evaluations in diverse settings of sensor quantities and\nmissing proportions demonstrate that our approach compared with the benchmark\nmethods shows an average improvement of 39.9% in the F1-score. Moreover, the\nF1-score improvement can reach 62.6% when considering the configuration similar\nto real-world datasets, and 85.0% in real-world semiconductor datasets. The\nsource code is available at https://github.com/OuTingYun/COKE.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}