{"id":"2407.15457","title":"Cross-diffusion systems coupled via a moving interface","authors":"Cl\\'ement Canc\\`es (RAPSODI, LPP), Jean Cauvin-Vila (TU Wien, TU\n  Wien), Claire Chainais-Hillairet (LPP, RAPSODI ), Virginie Ehrlacher (ENPC,\n  MATHERIALS)","authorsParsed":[["Cancès","Clément","","RAPSODI, LPP"],["Cauvin-Vila","Jean","","TU Wien, TU\n  Wien"],["Chainais-Hillairet","Claire","","LPP, RAPSODI"],["Ehrlacher","Virginie","","ENPC,\n  MATHERIALS"]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 08:13:36 GMT"}],"updateDate":"2024-07-23","timestamp":1721636016000,"abstract":"  We propose and study a one-dimensional model which consists of two\ncross-diffusion systems coupled via a moving interface. The motivation stems\nfrom the modelling of complex diffusion processes in the context of the vapor\ndeposition of thin films. In our model, cross-diffusion of the various chemical\nspecies can be respectively modelled by a size-exclusion system for the solid\nphase and the Stefan-Maxwell system for the gaseous phase. The coupling between\nthe two phases is modelled by linear phase transition laws of Butler-Volmer\ntype, resulting in an interface evolution. The continuous properties of the\nmodel are investigated, in particular its entropy variational structure and\nstationary states. We introduce a two-point flux approximation finite volume\nscheme. The moving interface is addressed with a moving-mesh approach, where\nthe mesh is locally deformed around the interface. The resulting discrete\nnonlinear system is shown to admit a solution that preserves the main\nproperties of the continuous system, namely: mass conservation, nonnegativity,\nvolume-filling constraints, decay of the free energy and asymptotics. In\nparticular, the moving-mesh approach is compatible with the entropy structure\nof the continuous model. Numerical results illustrate these properties and the\ndynamics of the model.\n","subjects":["Mathematics/Analysis of PDEs","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}