{"id":"2407.08115","title":"Dirac Electrons in AC-Magnetic Fields: $\\pi$-Landau Levels and Chiral\n  Anomaly-Induced Homodyne Effect","authors":"Sota Kitamura, Takashi Oka","authorsParsed":[["Kitamura","Sota",""],["Oka","Takashi",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 01:21:12 GMT"}],"updateDate":"2024-07-12","timestamp":1720660872000,"abstract":"  Floquet engineering, which involves controlling systems through time-periodic\ndriving, is a method for coherently manipulating quantum materials and\nrealizing dynamical states with novel functionalities. Most research in\nsolid-state systems has focused on the use of AC-electric fields as the\ncontrolling drive. In this study, we investigate the effects of AC-magnetic\nfields on two-dimensional (2D) Dirac electrons and report the emergence of new\nstates and new transport phenomena. In a magnetic field that temporarily\nchanges its direction, an electron nor a hole can sorely complete a cyclotron\norbit. However, their resonant state alternating between electron and hole can\ndo so; This leads to a new localized state that forms a flat band dubbed as a\n$\\pi$-Landau level. Then, what would be the counterpart of the Hall effect in\nAC-magnetic fields? We find that a DC-current in the transverse direction, i.e.\na homodyne Hall current, is generated when an additional AC-electric field is\napplied. In the case of Dirac electrons, several electronic states contribute\nto this phenomenon including the $\\pi$-Landau level. However, when the chemical\npotential $\\mu$ is near the Dirac point, the dominant contribution comes from\nthe low-energy electrons and we numerically find the homodyne Hall current to\nbehave as $I_y=-\\frac{e}{h}\\mu$ per valley and spin. We explain this phenomenon\nthrough the high-frequency effective Floquet Hamiltonian which resembles the\nchiral Landau level Hamiltonian of three-dimensional Weyl Hamiltonian\nexhibiting chiral anomaly. We discuss the experimental feasibility and conclude\nthat it is possible to realize this new exotic state using techniques such as\nTHz metamaterial enhancement of magnetic fields.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}