{"id":"2407.12911","title":"Strings near black holes are Carrollian -- Part II","authors":"Arjun Bagchi, Aritra Banerjee, Jelle Hartong, Emil Have, Kedar S.\n  Kolekar","authorsParsed":[["Bagchi","Arjun",""],["Banerjee","Aritra",""],["Hartong","Jelle",""],["Have","Emil",""],["Kolekar","Kedar S.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-19","timestamp":1721239201000,"abstract":"  We study classical closed bosonic strings probing the near-horizon region of\na non-extremal black hole and show that this corresponds to understanding\nstring theory in the Carroll regime. This is done by first performing a Carroll\nexpansion and then a near-horizon expansion of a closed relativistic string,\nsubsequently showing that they agree. Concretely, we expand the phase space\naction in powers of $c^2$, where $c$ is the speed of light, assuming that the\ntarget space admits a string Carroll expansion (where two directions are\nsingled out) and show that there exist two different Carroll strings: a\nmagnetic and an electric string. The magnetic string has a Lorentzian\nworldsheet, whereas the worldsheet of the electric string is Carrollian. The\ngeometry near the horizon of a four-dimensional (4D) Schwarzschild black hole\ntakes the form of a string Carroll expansion (a 2D Rindler space fibred over a\n2-sphere). We show that the solution space of relativistic strings near the\nhorizon bifurcates and the two sectors precisely match with the\nmagnetic/electric Carroll strings with an appropriate target space. Magnetic\nCarroll strings near a black hole shrink to a point on the two-sphere and\neither follow null geodesics or turn into folded strings on the 2D Rindler\nspacetime. Electric Carroll strings wrap the two-sphere and follow a massive\ngeodesic in the Rindler space. Finally, we show that 4D non-extremal Kerr and\nReissner-Nordstr\\\"om black holes also admit string Carroll expansions near\ntheir outer horizons, indicating that our formulation extends to generic\nnon-extremal black holes.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}