{"id":"2407.16569","title":"Regulated magnetic anisotropy and charge density wave in uniformly\n  fabricated Janus CrTeSe monolayer","authors":"Jin-Hua Nie, Cong Wang, Mao-Peng Miao, Kang-Di Niu, Tao Xie, Ting-Fei\n  Guo, Wen-Hao Zhang, Chao-Fei Liu, Rui-Jing Sun, Jian-Wang Zhou, Jun-Hao Lin,\n  Wei Ji, Ying-Shuang Fu","authorsParsed":[["Nie","Jin-Hua",""],["Wang","Cong",""],["Miao","Mao-Peng",""],["Niu","Kang-Di",""],["Xie","Tao",""],["Guo","Ting-Fei",""],["Zhang","Wen-Hao",""],["Liu","Chao-Fei",""],["Sun","Rui-Jing",""],["Zhou","Jian-Wang",""],["Lin","Jun-Hao",""],["Ji","Wei",""],["Fu","Ying-Shuang",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 15:22:26 GMT"}],"updateDate":"2024-07-24","timestamp":1721748146000,"abstract":"  Two-dimensional materials with Janus structure host novel physical properties\ndue to their inversional symmetry breaking. However, it remains elusive to\nsynthesize Janus monolayer crystals with tailored long-range magnetic orders.\nHere, we have developed a general method to fabricate uniform Janus CrTeSe\nmonolayers by selective selenization of preformed CrTe2 monolayers with\nmolecular beam epitaxy. The uniform Janus structure of CrTeSe with high crystal\nquality is confirmed by high-resolution scanning transmission electron\nmicroscopy. Spin-polarized scanning tunneling microscopy/spectroscopy\nmeasurements unveil that the Janus CrTeSe undergoes a charge density wave (CDW)\ntransition and a robust antiferromagnetic order. The magnetic anisotropy of\nCrTeSe is drastically altered compared to monolayer CrTe2 by the breaking\nsymmetries induced from the Janus structure and the CDW transition, as is\nsubstantiated with first principles calculations. Our research achieves the\nconstruction of large-area Janus structures, and artificially tailors the\nelectronic and magnetic properties of Janus systems at the two-dimensional\nlimit.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}