{"id":"2407.17561","title":"Compactness peaks: An astrophysical interpretation of the mass\n  distribution of merging binary black holes","authors":"Shanika Galaudage and Astrid Lamberts","authorsParsed":[["Galaudage","Shanika",""],["Lamberts","Astrid",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 18:00:05 GMT"}],"updateDate":"2024-07-26","timestamp":1721844005000,"abstract":"  With the growing number of detections of binary black hole mergers, we are\nbeginning to probe structure in the distribution of masses. A recent study by\nSchneider et al. proposes that isolated binary evolution of stripped stars\nnaturally gives rise to the peaks at chirp masses $\\sim 8 M_\\odot$, $14\nM_\\odot$ in the chirp mass distribution and explains the dearth of black holes\nbetween $\\approx 10-12 M_\\odot$ in chirp mass. The gap in chirp mass results\nfrom an apparent gap in the component mass distribution between $m_1, m_2\n\\approx 10-15 M_\\odot$ and the specific pairing of these black holes. This\ncomponent mass gap results from the variation in core compactness of the\nprogenitor, where a drop in compactness of Carbon-Oxygen core mass will no\nlonger form black holes from core collapse. We develop a population model\nmotivated by this scenario to probe the structure of the component mass\ndistribution of binary black holes consisting of two populations: 1) two peak\ncomponents to represent black holes formed in the compactness peaks, and 2) a\npowerlaw component to account for any polluting events, these are binaries that\nmay have formed from different channels (e.g. dynamical). We perform\nhierarchical Bayesian inference to analyse the events from the third\ngravitational-wave transient catalogue (GWTC-3) with this model. We find that\nthere is a preference for the lower mass peak to drop off sharply at $\\sim 11\nM_\\odot$ and the upper mass peak to turn on at $\\sim 13 M_\\odot$, in line with\npredictions from Schneider et al. However, there is no clear evidence for a\ngap. We also find mild support for the two populations to have different spin\ndistributions. In addition to these population results, we highlight observed\nevents of interest that differ from the expected population distribution of\ncompact objects formed from stripped stars.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}