{"id":"2407.09029","title":"Enhancing Emotion Recognition in Incomplete Data: A Novel Cross-Modal\n  Alignment, Reconstruction, and Refinement Framework","authors":"Haoqin Sun, Shiwan Zhao, Shaokai Li, Xiangyu Kong, Xuechen Wang, Aobo\n  Kong, Jiaming Zhou, Yong Chen, Wenjia Zeng, Yong Qin","authorsParsed":[["Sun","Haoqin",""],["Zhao","Shiwan",""],["Li","Shaokai",""],["Kong","Xiangyu",""],["Wang","Xuechen",""],["Kong","Aobo",""],["Zhou","Jiaming",""],["Chen","Yong",""],["Zeng","Wenjia",""],["Qin","Yong",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 06:44:42 GMT"}],"updateDate":"2024-07-15","timestamp":1720766682000,"abstract":"  Multimodal emotion recognition systems rely heavily on the full availability\nof modalities, suffering significant performance declines when modal data is\nincomplete. To tackle this issue, we present the Cross-Modal Alignment,\nReconstruction, and Refinement (CM-ARR) framework, an innovative approach that\nsequentially engages in cross-modal alignment, reconstruction, and refinement\nphases to handle missing modalities and enhance emotion recognition. This\nframework utilizes unsupervised distribution-based contrastive learning to\nalign heterogeneous modal distributions, reducing discrepancies and modeling\nsemantic uncertainty effectively. The reconstruction phase applies normalizing\nflow models to transform these aligned distributions and recover missing\nmodalities. The refinement phase employs supervised point-based contrastive\nlearning to disrupt semantic correlations and accentuate emotional traits,\nthereby enriching the affective content of the reconstructed representations.\nExtensive experiments on the IEMOCAP and MSP-IMPROV datasets confirm the\nsuperior performance of CM-ARR under conditions of both missing and complete\nmodalities. Notably, averaged across six scenarios of missing modalities,\nCM-ARR achieves absolute improvements of 2.11% in WAR and 2.12% in UAR on the\nIEMOCAP dataset, and 1.71% and 1.96% in WAR and UAR, respectively, on the\nMSP-IMPROV dataset.\n","subjects":["Computing Research Repository/Multimedia","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}