{"id":"2407.09471","title":"A new approach to principal-agent problems with volatility control","authors":"Alessandro Chiusolo and Emma Hubert","authorsParsed":[["Chiusolo","Alessandro",""],["Hubert","Emma",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 17:53:59 GMT"}],"updateDate":"2024-07-15","timestamp":1720806839000,"abstract":"  The recent work by Cvitani\\'c, Possama\\\"i, and Touzi (2018) [9] presents a\ngeneral approach for continuous-time principal-agent problems, through dynamic\nprogramming and second-order backward stochastic differential equations\n(BSDEs). In this paper, we provide an alternative formulation of the\nprincipal-agent problem, which can be solved simply by relying on the theory of\nBSDEs. This reformulation is strongly inspired by an important remark in [9],\nnamely that if the principal observes the output process in continuous-time,\nshe can compute its quadratic variation pathwise. While in [9], this\ninformation is used in the contract, our reformulation consists in assuming\nthat the principal could directly control this process, in a `first-best'\nfashion. The resolution approach for this alternative problem actually follows\nthe line of the so-called `Sannikov's trick' in the literature on\ncontinuous-time principal-agent problems, as originally introduced by Sannikov\n(2008) [28]. We then show that the solution to this `first-best' formulation is\nidentical to the solution of the original problem. More precisely, using the\ncontract form introduced in [9] as `penalisation contracts', we highlight that\nthis `first-best' scenario can be achieved even if the principal cannot\ndirectly control the quadratic variation. Nevertheless, we do not have to rely\non the theory of 2BSDEs to prove that such contracts are optimal, as their\noptimality is ensured by showing that the `first-best' scenario is achieved. We\nbelieve that this more straightforward approach to solve continuous-time\nprincipal-agent problems with volatility control will facilitate the\ndissemination of these problems across many fields, and its extension to even\nmore intricate problems.\n","subjects":["Mathematics/Optimization and Control","Economics/General Economics","Mathematics/Probability","Quantitative Finance/Economics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}