{"id":"2407.12149","title":"Multigrid Monte Carlo Revisited: Theory and Bayesian Inference","authors":"Yoshihito Kazashi, Eike H. M\\\"uller, Robert Scheichl","authorsParsed":[["Kazashi","Yoshihito",""],["Müller","Eike H.",""],["Scheichl","Robert",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 20:08:45 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 11:40:46 GMT"}],"updateDate":"2024-08-08","timestamp":1721160525000,"abstract":"  Gaussian random fields play an important role in many areas of science and\nengineering. In practice, they are often simulated by sampling from a\nhigh-dimensional multivariate normal distribution, which arises from the\ndiscretisation of a suitable precision operator. Existing methods such as\nCholesky factorization and Gibbs sampling become prohibitively expensive on\nfine meshes due to their high computational cost. In this work, we revisit the\nMultigrid Monte Carlo (MGMC) algorithm developed by Goodman & Sokal (Physical\nReview D 40.6, 1989) in the quantum physics context. To show that MGMC can\novercome these issues, we establish a grid-size-independent convergence theory\nbased on the link between linear solvers and samplers for multivariate normal\ndistributions, drawing on standard multigrid convergence theory. We then apply\nthis theory to linear Bayesian inverse problems. This application is achieved\nby extending the standard multigrid theory to operators with a low-rank\nperturbation. Moreover, we develop a novel bespoke random smoother which takes\ncare of the low-rank updates that arise in constructing posterior moments. In\nparticular, we prove that Multigrid Monte Carlo is algorithmically optimal in\nthe limit of the grid-size going to zero. Numerical results support our theory,\ndemonstrating that Multigrid Monte Carlo can be significantly more efficient\nthan alternative methods when applied in a Bayesian setting.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UgOBgI74ksa2AEWV6vDnQIDSrVIfD49HVa-TFdHWWUc","pdfSize":"1241931"}
