{"id":"2407.14063","title":"Statistical Survey of Chemical and Geometric Patterns on Protein\n  Surfaces as a Blueprint for Protein-mimicking Nanoparticles","authors":"John M. McBride, Aleksei Koshevarnikov, Marta Siek, Bartosz A.\n  Grzybowski and Tsvi Tlusty","authorsParsed":[["McBride","John M.",""],["Koshevarnikov","Aleksei",""],["Siek","Marta",""],["Grzybowski","Bartosz A.",""],["Tlusty","Tsvi",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 06:41:26 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 07:19:17 GMT"}],"updateDate":"2024-07-26","timestamp":1721371286000,"abstract":"  Despite recent breakthroughs in understanding how protein sequence relates to\nstructure and function, considerably less attention has been paid to the\ngeneral features of protein surfaces beyond those regions involved in binding\nand catalysis. This paper provides a systematic survey of the universe of\nprotein surfaces and quantifies the sizes, shapes, and curvatures of the\npositively/negatively charged and hydrophobic/hydrophilic surface patches as\nwell as correlations between such patches. It then compares these statistics\nwith the metrics characterizing nanoparticles functionalized with ligands\nterminated with positively and negatively charged ligands. These particles are\nof particular interest because they are also surface-patchy and have been shown\nto exhibit both antibiotic and anticancer activities - via selective\ninteractions against various cellular structures - prompting loose analogies to\nproteins. Our analyses support such analogies in several respects (e.g.,\npatterns of charged protrusions and hydrophobic niches similar to those\nobserved in proteins), although there are also significant differences. Looking\nforward, this work provides a blueprint for the rational design of synthetic\nnanoobjects with further enhanced mimicry of proteins' surface properties.\n","subjects":["Quantitative Biology/Biomolecules","Physics/Biological Physics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"9SceEcSKl40jQZ47cav1pJnwnTYfq03U9efAm6lM9b4","pdfSize":"1749227"}
