{"id":"2407.05049","title":"A hybrid upwind scheme for two-phase flow in fractured porous media","authors":"Enrico Ballini, Luca Formaggia, Alessio Fumagalli, Eirik Keilegavlen,\n  Anna Scotti","authorsParsed":[["Ballini","Enrico",""],["Formaggia","Luca",""],["Fumagalli","Alessio",""],["Keilegavlen","Eirik",""],["Scotti","Anna",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 11:23:40 GMT"}],"updateDate":"2024-07-09","timestamp":1720265020000,"abstract":"  Simulating the flow of two fluid phases in porous media is a challenging\ntask, especially when fractures are included in the simulation. Fractures may\nhave highly heterogeneous properties compared to the surrounding rock matrix,\nsignificantly affecting fluid flow, and at the same time hydraulic aperture\nthat are much smaller than any other characteristic sizes in the domain.\nGenerally, flow simulators face difficulties with counter-current flow,\ngenerated by gravity and pressure gradients, which hinders the convergence of\nnon-linear solvers (Newton).\n  In this work, we model the fracture geometry with a mixed-dimensional\ndiscrete fracture network, thus lightening the computational burden associated\nto an equi-dimensional representation. We address the issue of counter-current\nflows with appropriate spatial discretization of the advective fluid fluxes,\nwith the aim of improving the convergence speed of the non-linear solver. In\nparticular, the extension of the hybrid upwinding to the mixed-dimensional\nframework, with the use of a phase potential upstreaming at the interfaces of\nsubdomains.\n  We test the method across several cases with different flow regimes and\nfracture network geometry. Results show robustness of the chosen discretization\nand a consistent improvements, in terms of Newton iterations, compared to use\nthe phase potential upstreaming everywhere.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}