{"id":"2407.12631","title":"Particle transport and deposition in wall-sheared thermal turbulence","authors":"Ao Xu and Ben-Rui Xu and Heng-Dong Xi","authorsParsed":[["Xu","Ao",""],["Xu","Ben-Rui",""],["Xi","Heng-Dong",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:58:53 GMT"}],"updateDate":"2024-07-18","timestamp":1721228333000,"abstract":"  We studied the transport and deposition behavior of point particles in\nRayleigh-B\\'enard convection cells subjected to Couette-type wall shear. Direct\nnumerical simulations (DNS) are performed for Rayleigh number (Ra) in the range\n\\(10^7 \\leq Ra \\leq 10^9\\) with a fixed Prandtl number \\(Pr = 0.71\\), while the\nwall-shear Reynolds number (\\(Re_w\\)) is in the range \\(0 \\leq Re_w \\leq\n12000\\). With the increase of \\(Re_w\\), the large-scale rolls expanded\nhorizontally, evolving into zonal flow in two-dimensional simulations or\nstreamwise-oriented rolls in three-dimensional simulations. We observed that\nfor particles with a small Stokes number St, they either circulated within the\nlarge-scale rolls when buoyancy dominated or drifted near the walls when shear\ndominated. For medium St particles, pronounced spatial inhomogeneity and\npreferential concentration were observed regardless of the prevailing flow\nstate. For large St particles, the turbulent flow structure had a minor\ninfluence on particles' motion; although clustering still occurred, wall shear\nhad a negligible influence compared to that for medium St particles. We then\npresented the settling curves to quantify the particle deposition ratio on the\nwalls. Our DNS results aligned well with previous theoretical predictions,\nwhich state that small St particles settle with an exponential deposition ratio\nand large St particles settle with a linear deposition ratio. For medium St\nparticles, where complex particles-turbulence interaction emerges, we developed\na new model describing the settling process with an initial linear stage\nfollowed by a non-linear stage. Unknown parameters in our model can be\ndetermined either by fitting the settling curves or using empirical relations.\nCompared with DNS results, our model also accurately predicts the average\nresidence time across a wide range of St for various \\(Re_w\\).\n","subjects":["Physics/Fluid Dynamics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}