{"id":"2407.11276","title":"A practical approach to calculating magnetic Johnson noise for precision\n  measurements","authors":"N. S. Phan, S. M. Clayton, Y. J. Kim, and T. M. Ito","authorsParsed":[["Phan","N. S.",""],["Clayton","S. M.",""],["Kim","Y. J.",""],["Ito","T. M.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 22:52:17 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 20:46:22 GMT"}],"updateDate":"2024-09-17","timestamp":1721083937000,"abstract":"  Magnetic Johnson noise is an important consideration for many applications\ninvolving precision magnetometry, and its significance will only increase in\nthe future with improvements in measurement sensitivity. The\nfluctuation-dissipation theorem can be utilized to derive analytic expressions\nfor magnetic Johnson noise in certain situations. But when used in conjunction\nwith finite element analysis tools, the combined approach is particularly\npowerful as it provides a practical means to calculate the magnetic Johnson\nnoise arising from conductors of arbitrary geometry and permeability. In this\npaper, we demonstrate this method to be one of the most comprehensive\napproaches presently available to calculate thermal magnetic noise. In\nparticular, its applicability is shown to not be limited to cases where the\nnoise is evaluated at a point in space but also can be expanded to include\ncases where the magnetic field detector has a more general shape, such as a\nfinite size loop, a gradiometer, or a detector that consists of a polarized\natomic species trapped in a volume. Furthermore, some physics insights gained\nthrough studies made using this method are discussed\n","subjects":["Physics/Applied Physics","Physics/Nuclear Experiment","Physics/Atomic Physics","Physics/Biological Physics","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3WEdm_AOuYm4WuSZck0hb7ZCJFhpX2Wq5RInKkV7pPA","pdfSize":"2012961","objectId":"0x73ca00e640b70d2ae43fad1c3e9defd7eefd1600800a53878d867f068da6e272","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
