{"id":"2407.12704","title":"A new perspective on the stellar Mass-Metallicity Relation of quiescent\n  galaxies from the LEGA-C survey","authors":"D.Bevacqua (1 and 2), P. Saracco (1), A. Boecker (3 and 4), G. D'Ago\n  (5), G. De Lucia (6), R. De Propris (7 and 8), F. La Barbera (9), A. Pasquali\n  (10), C. Spiniello (11 and 9), C. Tortora (9)","authorsParsed":[["Bevacqua","D.","","1 and 2"],["Saracco","P.","","3 and 4"],["Boecker","A.","","3 and 4"],["D'Ago","G.","","7 and 8"],["De Lucia","G.","","7 and 8"],["De Propris","R.","","7 and 8"],["La Barbera","F.","","11 and 9"],["Pasquali","A.","","11 and 9"],["Spiniello","C.","","11 and 9"],["Tortora","C.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 16:26:19 GMT"}],"updateDate":"2024-07-18","timestamp":1721233579000,"abstract":"  We investigate the stellar Mass-Metallicity Relation (MZR) using a sample of\n637 quiescent galaxies with 10.4 <= log(M*/M ) < 11.7 selected from the LEGA-C\nsurvey at 0.6 <= z <= 1. We derive mass-weighted stellar metallicities using\nfull-spectral fitting. We find that while lower-mass galaxies are both metal\n-rich and -poor, there are no metal-poor galaxies at high masses, and that\nmetallicity is bounded at low values by a mass-dependent lower limit. This\nlower limit increases with mass, empirically defining a MEtallicity-Mass\nExclusion (MEME) zone. We find that the spectral index MgFe = \\sqrt{Mgb \\times\nFe4383}, a proxy for the stellar metallicity, also shows a mass-dependent lower\nlimit resembling the MEME relation. Crucially, MgFe is independent of stellar\npopulation models and fitting methods. By constructing the Metallicity\nEnrichment Histories, we find that, after the first Gyr, the Star Formation\nHistory of galaxies has a mild impact on the observed metallicity distribution.\nFinally, from the average formation times, we find that galaxies populate\ndifferently the metallicity-mass plane at different cosmic times, and that the\nMEME limit is recovered by galaxies that formed at z >= 3. Our work suggests\nthat the stellar metallicity of quiescent galaxies is bounded by a lower limit\nwhich increases with the stellar mass. On the other hand, low-mass galaxies can\nhave metallicities as high as galaxies ~1 dex more massive. This suggests that,\nat log(M*/M ) >= 10.4, rather than lower-mass galaxies being systematically\nless metallic, the observed MZR might be a consequence of the lack of massive,\nmetal-poor galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}