{"id":"2407.07946","title":"The Type I Superluminous Supernova Catalog I: Light Curve Properties,\n  Models, and Catalog Description","authors":"Sebastian Gomez, Matt Nicholl, Edo Berger, Peter K. Blanchard, V.\n  Ashley Villar, Sofia Rest, Griffin Hosseinzadeh, Aysha Aamer, Yukta Ajay,\n  Wasundara Athukoralalage, David C. Coulter, Tarraneh Eftekhari, Achille\n  Fiore, Noah Franz, Ori Fox, Alexander Gagliano, Daichi Hiramatsu, D. Andrew\n  Howell, Brian Hsu, Mitchell Karmen, Matthew R. Siebert, R\\'eka\n  K\\\"onyves-T\\'oth, Harsh Kumar, Curtis McCully, Craig Pellegrino, Justin\n  Pierel, Armin Rest, Qinan Wang","authorsParsed":[["Gomez","Sebastian",""],["Nicholl","Matt",""],["Berger","Edo",""],["Blanchard","Peter K.",""],["Villar","V. Ashley",""],["Rest","Sofia",""],["Hosseinzadeh","Griffin",""],["Aamer","Aysha",""],["Ajay","Yukta",""],["Athukoralalage","Wasundara",""],["Coulter","David C.",""],["Eftekhari","Tarraneh",""],["Fiore","Achille",""],["Franz","Noah",""],["Fox","Ori",""],["Gagliano","Alexander",""],["Hiramatsu","Daichi",""],["Howell","D. Andrew",""],["Hsu","Brian",""],["Karmen","Mitchell",""],["Siebert","Matthew R.",""],["Könyves-Tóth","Réka",""],["Kumar","Harsh",""],["McCully","Curtis",""],["Pellegrino","Craig",""],["Pierel","Justin",""],["Rest","Armin",""],["Wang","Qinan",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-12","timestamp":1720634403000,"abstract":"  We present the most comprehensive catalog to date of Type I Superluminous\nSupernovae (SLSNe), a class of stripped envelope supernovae (SNe) characterized\nby exceptionally high luminosities. We have compiled a sample of 262 SLSNe\nreported through 2022 December 31. We verified the spectroscopic classification\nof each SLSN and collated an exhaustive data set of UV, optical and IR\nphotometry from both publicly available data and our own FLEET observational\nfollow-up program, totaling over 30,000 photometric detections. Using these\ndata we derive observational parameters such as the peak absolute magnitudes,\nrise and decline timescales, as well as bolometric luminosities, temperature\nand photospheric radius evolution for all SLSNe. Additionally, we model all\nlight curves using a hybrid model that includes contributions from both a\nmagnetar central engine and the radioactive decay of $^{56}$Ni. We explore\ncorrelations among various physical and observational parameters, and recover\nthe previously found relation between ejecta mass and magnetar spin, as well as\nthe overall progenitor pre-explosion mass distribution with a peak at $\\approx\n6.5$ M$_\\odot$. We find no significant redshift dependence for any parameter,\nand no evidence for distinct sub-types of SLSNe. We find that $< 3$\\% of SLSNe\nare best fit with a significant contribution from radioactive decay $\\gtrsim\n50$\\%, representing a set of relatively dim and slowly declining SNe. We\nprovide several analytical tools designed to simulate typical SLSN light curves\nacross a broad range of wavelengths and phases, enabling accurate\nK-corrections, bolometric scaling calculations, and inclusion of SLSNe in\nsurvey simulations or future comparison works. The complete catalog, including\nall of the photometry, models, and derived parameters, is made available as an\nopen-source resource on GitHub.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}