{"id":"2407.03268","title":"For a semiotic AI: Bridging computer vision and visual semiotics for\n  computational observation of large scale facial image archives","authors":"Lia Morra, Antonio Santangelo, Pietro Basci, Luca Piano, Fabio Garcea,\n  Fabrizio Lamberti, Massimo Leone","authorsParsed":[["Morra","Lia",""],["Santangelo","Antonio",""],["Basci","Pietro",""],["Piano","Luca",""],["Garcea","Fabio",""],["Lamberti","Fabrizio",""],["Leone","Massimo",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 16:57:38 GMT"}],"updateDate":"2024-07-04","timestamp":1720025858000,"abstract":"  Social networks are creating a digital world in which the cognitive,\nemotional, and pragmatic value of the imagery of human faces and bodies is\narguably changing. However, researchers in the digital humanities are often\nill-equipped to study these phenomena at scale. This work presents FRESCO (Face\nRepresentation in E-Societies through Computational Observation), a framework\ndesigned to explore the socio-cultural implications of images on social media\nplatforms at scale. FRESCO deconstructs images into numerical and categorical\nvariables using state-of-the-art computer vision techniques, aligning with the\nprinciples of visual semiotics. The framework analyzes images across three\nlevels: the plastic level, encompassing fundamental visual features like lines\nand colors; the figurative level, representing specific entities or concepts;\nand the enunciation level, which focuses particularly on constructing the point\nof view of the spectator and observer. These levels are analyzed to discern\ndeeper narrative layers within the imagery. Experimental validation confirms\nthe reliability and utility of FRESCO, and we assess its consistency and\nprecision across two public datasets. Subsequently, we introduce the FRESCO\nscore, a metric derived from the framework's output that serves as a reliable\nmeasure of similarity in image content.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}