{"id":"2407.16313","title":"Deep Learning for Pancreas Segmentation: a Systematic Review","authors":"Andrea Moglia, Matteo Cavicchioli, Luca Mainardi, Pietro Cerveri","authorsParsed":[["Moglia","Andrea",""],["Cavicchioli","Matteo",""],["Mainardi","Luca",""],["Cerveri","Pietro",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 09:05:23 GMT"}],"updateDate":"2024-07-24","timestamp":1721725523000,"abstract":"  Pancreas segmentation has been traditionally challenging due to its small\nsize in computed tomography abdominal volumes, high variability of shape and\npositions among patients, and blurred boundaries due to low contrast between\nthe pancreas and surrounding organs. Many deep learning models for pancreas\nsegmentation have been proposed in the past few years. We present a thorough\nsystematic review based on the Preferred Reporting Items for Systematic Reviews\nand Meta-analyses (PRISMA) statement. The literature search was conducted on\nPubMed, Web of Science, Scopus, and IEEE Xplore on original studies published\nin peer-reviewed journals from 2013 to 2023. Overall, 130 studies were\nretrieved. We initially provided an overview of the technical background of the\nmost common network architectures and publicly available datasets. Then, the\nanalysis of the studies combining visual presentation in tabular form and text\ndescription was reported. The tables grouped the studies specifying the\napplication, dataset size, design (model architecture, learning strategy, and\nloss function), results, and main contributions. We first analyzed the studies\nfocusing on parenchyma segmentation using coarse-to-fine approaches,\nmulti-organ segmentation, semi-supervised learning, and unsupervised learning,\nfollowed by those studies on generalization to other datasets and those\nconcerning the design of new loss functions. Then, we analyzed the studies on\nsegmentation of tumors, cysts, and inflammation reporting multi-stage methods,\nsemi-supervised learning, generalization to other datasets, and design of new\nloss functions. Finally, we provided a critical discussion on the subject based\non the published evidence underlining current issues that need to be addressed\nbefore clinical translation.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"4dSh2DNMaP28QzQJ-npnasE7357_Z-cBbMzLH0uN3Oc","pdfSize":"20195112"}
