{"id":"2407.20422","title":"Greedy Conjecture for the Shortest Common Superstring Problem and its\n  Strengthenings","authors":"Maksim Nikolaev","authorsParsed":[["Nikolaev","Maksim",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 21:24:02 GMT"}],"updateDate":"2024-07-31","timestamp":1722288242000,"abstract":"  In the Shortest Common Superstring problem, one needs to find the shortest\nsuperstring for a set of strings. This problem is APX-hard, and many\napproximation algorithms were proposed, with the current best approximation\nfactor of 2.466. Whereas these algorithms are technically involved, for more\nthan thirty years the Greedy Conjecture remains unsolved, that states that the\nGreedy Algorithm ``take two strings with the maximum overlap; merge them;\nrepeat'' is a 2-approximation.\n  This conjecture is still open, and one way to approach it is to consider its\nstronger version, which may make the proof easier due to the stronger premise\nor provide insights from its refutation. In this paper, we propose two\ndirections to strengthen the conjecture. First, we introduce the Locally Greedy\nAlgorithm (LGA), that selects a pair of strings not with the largest overlap\nbut with the \\emph{locally largest} overlap, that is, the largest among all\npairs of strings with the same first or second string. Second, we change the\nquality metric: instead of length, we evaluate the solution by the number of\noccurrences of an arbitrary symbol.\n  Despite the double strengthening, we prove that LGA is a \\emph{uniform}\n4-approximation, that is, it always constructs a superstring with no more than\nfour times as many occurrences of an arbitrary symbol as any other superstring.\nAt the same time, we discover the limitations of the greedy heuristic: we show\nthat LGA is at least 3-approximation, and the Greedy Algorithm is at least\nuniform 2.5-approximation. These result show that if the Greedy Conjecture is\ntrue, it is not because the Greedy Algorithm is locally greedy or is uniformly\n2-approximation.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}