{"id":"2407.15185","title":"A Spatio-Temporal Approach with Self-Corrective Causal Inference for\n  Flight Delay Prediction","authors":"Qihui Zhu and Shenwen Chen and Tong Guo and Yisheng Lv and Wenbo Du","authorsParsed":[["Zhu","Qihui",""],["Chen","Shenwen",""],["Guo","Tong",""],["Lv","Yisheng",""],["Du","Wenbo",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 14:48:14 GMT"}],"updateDate":"2024-07-23","timestamp":1721573294000,"abstract":"  Accurate flight delay prediction is crucial for the secure and effective\noperation of the air traffic system. Recent advances in modeling inter-airport\nrelationships present a promising approach for investigating flight delay\nprediction from the multi-airport scenario. However, the previous prediction\nworks only accounted for the simplistic relationships such as traffic flow or\ngeographical distance, overlooking the intricate interactions among airports\nand thus proving inadequate. In this paper, we leverage causal inference to\nprecisely model inter-airport relationships and propose a self-corrective\nspatio-temporal graph neural network (named CausalNet) for flight delay\nprediction. Specifically, Granger causality inference coupled with a\nself-correction module is designed to construct causality graphs among airports\nand dynamically modify them based on the current airport's delays.\nAdditionally, the features of the causality graphs are adaptively extracted and\nutilized to address the heterogeneity of airports. Extensive experiments are\nconducted on the real data of top-74 busiest airports in China. The results\nshow that CausalNet is superior to baselines. Ablation studies emphasize the\npower of the proposed self-correction causality graph and the graph feature\nextraction module. All of these prove the effectiveness of the proposed\nmethodology.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}