{"id":"2407.02516","title":"EditFollower: Tunable Car Following Models for Customizable Adaptive\n  Cruise Control Systems","authors":"Xianda Chen, Xu Han, Meixin Zhu, Xiaowen Chu, PakHin Tiu, Xinhu Zheng,\n  Yinhai Wang","authorsParsed":[["Chen","Xianda",""],["Han","Xu",""],["Zhu","Meixin",""],["Chu","Xiaowen",""],["Tiu","PakHin",""],["Zheng","Xinhu",""],["Wang","Yinhai",""]],"versions":[{"version":"v1","created":"Sun, 23 Jun 2024 15:04:07 GMT"}],"updateDate":"2024-07-04","timestamp":1719155047000,"abstract":"  In the realm of driving technologies, fully autonomous vehicles have not been\nwidely adopted yet, making advanced driver assistance systems (ADAS) crucial\nfor enhancing driving experiences. Adaptive Cruise Control (ACC) emerges as a\npivotal component of ADAS. However, current ACC systems often employ fixed\nsettings, failing to intuitively capture drivers' social preferences and\nleading to potential function disengagement. To overcome these limitations, we\npropose the Editable Behavior Generation (EBG) model, a data-driven\ncar-following model that allows for adjusting driving discourtesy levels. The\nframework integrates diverse courtesy calculation methods into long short-term\nmemory (LSTM) and Transformer architectures, offering a comprehensive approach\nto capture nuanced driving dynamics. By integrating various discourtesy values\nduring the training process, our model generates realistic agent trajectories\nwith different levels of courtesy in car-following behavior. Experimental\nresults on the HighD and Waymo datasets showcase a reduction in Mean Squared\nError (MSE) of spacing and MSE of speed compared to baselines, establishing\nstyle controllability. To the best of our knowledge, this work represents the\nfirst data-driven car-following model capable of dynamically adjusting\ndiscourtesy levels. Our model provides valuable insights for the development of\nACC systems that take into account drivers' social preferences.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}