{"id":"2407.06613","title":"Sparse-DeRF: Deblurred Neural Radiance Fields from Sparse View","authors":"Dogyoon Lee, Donghyeong Kim, Jungho Lee, Minhyeok Lee, Seunghoon Lee,\n  and Sangyoun Lee","authorsParsed":[["Lee","Dogyoon",""],["Kim","Donghyeong",""],["Lee","Jungho",""],["Lee","Minhyeok",""],["Lee","Seunghoon",""],["Lee","Sangyoun",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 07:36:54 GMT"}],"updateDate":"2024-07-10","timestamp":1720510614000,"abstract":"  Recent studies construct deblurred neural radiance fields (DeRF) using dozens\nof blurry images, which are not practical scenarios if only a limited number of\nblurry images are available. This paper focuses on constructing DeRF from\nsparse-view for more pragmatic real-world scenarios. As observed in our\nexperiments, establishing DeRF from sparse views proves to be a more\nchallenging problem due to the inherent complexity arising from the\nsimultaneous optimization of blur kernels and NeRF from sparse view.\nSparse-DeRF successfully regularizes the complicated joint optimization,\npresenting alleviated overfitting artifacts and enhanced quality on radiance\nfields. The regularization consists of three key components: Surface\nsmoothness, helps the model accurately predict the scene structure utilizing\nunseen and additional hidden rays derived from the blur kernel based on\nstatistical tendencies of real-world; Modulated gradient scaling, helps the\nmodel adjust the amount of the backpropagated gradient according to the\narrangements of scene objects; Perceptual distillation improves the perceptual\nquality by overcoming the ill-posed multi-view inconsistency of image\ndeblurring and distilling the pre-filtered information, compensating for the\nlack of clean information in blurry images. We demonstrate the effectiveness of\nthe Sparse-DeRF with extensive quantitative and qualitative experimental\nresults by training DeRF from 2-view, 4-view, and 6-view blurry images.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}