{"id":"2407.00031","title":"Supercharging Federated Learning with Flower and NVIDIA FLARE","authors":"Holger R. Roth, Daniel J. Beutel, Yan Cheng, Javier Fernandez Marques,\n  Heng Pan, Chester Chen, Zhihong Zhang, Yuhong Wen, Sean Yang, Isaac\n  (Te-Chung) Yang, Yuan-Ting Hsieh, Ziyue Xu, Daguang Xu, Nicholas D. Lane,\n  Andrew Feng","authorsParsed":[["Roth","Holger R.","","Te-Chung"],["Beutel","Daniel J.","","Te-Chung"],["Cheng","Yan","","Te-Chung"],["Marques","Javier Fernandez","","Te-Chung"],["Pan","Heng","","Te-Chung"],["Chen","Chester","","Te-Chung"],["Zhang","Zhihong","","Te-Chung"],["Wen","Yuhong","","Te-Chung"],["Yang","Sean","","Te-Chung"],["Isaac","","","Te-Chung"],["Yang","",""],["Hsieh","Yuan-Ting",""],["Xu","Ziyue",""],["Xu","Daguang",""],["Lane","Nicholas D.",""],["Feng","Andrew",""]],"versions":[{"version":"v1","created":"Tue, 21 May 2024 21:22:16 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 07:01:48 GMT"}],"updateDate":"2024-07-23","timestamp":1716326536000,"abstract":"  Several open-source systems, such as Flower and NVIDIA FLARE, have been\ndeveloped in recent years while focusing on different aspects of federated\nlearning (FL). Flower is dedicated to implementing a cohesive approach to FL,\nanalytics, and evaluation. Over time, Flower has cultivated extensive\nstrategies and algorithms tailored for FL application development, fostering a\nvibrant FL community in research and industry. Conversely, FLARE has\nprioritized the creation of an enterprise-ready, resilient runtime environment\nexplicitly designed for FL applications in production environments. In this\npaper, we describe our initial integration of both frameworks and show how they\ncan work together to supercharge the FL ecosystem as a whole. Through the\nseamless integration of Flower and FLARE, applications crafted within the\nFlower framework can effortlessly operate within the FLARE runtime environment\nwithout necessitating any modifications. This initial integration streamlines\nthe process, eliminating complexities and ensuring smooth interoperability\nbetween the two platforms, thus enhancing the overall efficiency and\naccessibility of FL applications.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}