{"id":"2407.08032","title":"Rossby Wave Instability and Substructure Formation in 3D Non-Ideal MHD\n  Wind-Launching Disks","authors":"Chun-Yen Hsu, Zhi-Yun Li, Yisheng Tu, Xiao Hu, Min-Kai Lin","authorsParsed":[["Hsu","Chun-Yen",""],["Li","Zhi-Yun",""],["Tu","Yisheng",""],["Hu","Xiao",""],["Lin","Min-Kai",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 20:15:33 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 00:58:44 GMT"}],"updateDate":"2024-08-15","timestamp":1720642533000,"abstract":"  Rings and gaps are routinely observed in the dust continuum emission of\nprotoplanetary discs (PPDs). How they form and evolve remains debated. Previous\nstudies have demonstrated the possibility of spontaneous gas rings and gaps\nformation in wind-launching disks. Here, we show that such gas substructures\nare unstable to the Rossby Wave Instability (RWI) through numerical\nsimulations. Specifically, shorter wavelength azimuthal modes develop earlier,\nand longer wavelength ones dominate later, forming elongated (arc-like)\nanti-cyclonic vortices in the rings and (strongly magnetized) cyclonic vortices\nin the gaps that persist until the end of the simulation. Highly elongated\nvortices with aspect ratios of 10 or more are found to decay with time in our\nnon-ideal MHD simulation, in contrast with the hydro case. This difference\ncould be caused by magnetically induced motions, particularly strong meridional\ncirculations with large values of the azimuthal component of the vorticity,\nwhich may be incompatible with the columnar structure preferred by vortices.\nThe cyclonic and anti-cyclonic RWI vortices saturate at moderate levels,\nmodifying but not destroying the rings and gaps in the radial gas distribution\nof the disk. In particular, they do not shut off the poloidal magnetic flux\naccumulation in low-density regions and the characteristic meridional flow\npatterns that are crucial to the ring and gap formation in wind-launching\ndisks. Nevertheless, the RWI and their associated vortices open up the\npossibility of producing non-axisymmetric dust features observed in a small\nfraction of protoplanetary disks through non-ideal MHD, although detailed dust\ntreatment is needed to explore this possibility.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}