{"id":"2407.14078","title":"Stable-Hair: Real-World Hair Transfer via Diffusion Model","authors":"Yuxuan Zhang, Qing Zhang, Yiren Song, Jiaming Liu","authorsParsed":[["Zhang","Yuxuan",""],["Zhang","Qing",""],["Song","Yiren",""],["Liu","Jiaming",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 07:14:23 GMT"}],"updateDate":"2024-07-22","timestamp":1721373263000,"abstract":"  Current hair transfer methods struggle to handle diverse and intricate\nhairstyles, thus limiting their applicability in real-world scenarios. In this\npaper, we propose a novel diffusion-based hair transfer framework, named\n\\textit{Stable-Hair}, which robustly transfers a wide range of real-world\nhairstyles onto user-provided faces for virtual hair try-on. To achieve this\ngoal, our Stable-Hair framework is designed as a two-stage pipeline. In the\nfirst stage, we train a Bald Converter alongside stable diffusion to remove\nhair from the user-provided face images, resulting in bald images. In the\nsecond stage, we specifically designed three modules: a Hair Extractor, a\nLatent IdentityNet, and Hair Cross-Attention Layers to transfer the target\nhairstyle with highly detailed and high-fidelity to the bald image.\nSpecifically, the Hair Extractor is trained to encode reference images with the\ndesired hairstyles. To preserve the consistency of identity content and\nbackground between the source images and the transfer results, we employ a\nLatent IdentityNet to encode the source images. With the assistance of our Hair\nCross-Attention Layers in the U-Net, we can accurately and precisely transfer\nthe highly detailed and high-fidelity hairstyle to the bald image. Extensive\nexperiments have demonstrated that our approach delivers state-of-the-art\n(SOTA) results among existing hair transfer methods. Project page:\n\\textcolor{red}{\\url{https://xiaojiu-z.github.io/Stable-Hair.github.io/}}\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}