{"id":"2407.01672","title":"Optimizing Entanglement and Bell Inequality Violation in Top Anti-Top\n  Events","authors":"Kun Cheng, Tao Han, Matthew Low","authorsParsed":[["Cheng","Kun",""],["Han","Tao",""],["Low","Matthew",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-03","timestamp":1719856801000,"abstract":"  A top quark and an anti-top quark produced together at colliders have\ncorrelated spins. These spins constitute a quantum state that can exhibit\nentanglement and violate Bell's inequality. In realistic collider experiments,\nmost analyses allow the axes, as well the Lorentz frame to vary event-by-event,\nthus introducing a dependence on the choice of event-dependent basis leading us\nto adopt \"fictitious states,\" rather than genuine quantum states. The basis\ndependence of fictitious states allows for an optimization procedure, which\nmakes the usage of fictitious states advantageous in measuring entanglement and\nBell inequality violation. In this work, we show analytically that the basis\nwhich diagonalizes the spin-spin correlations is optimal for maximizing spin\ncorrelations, entanglement, and Bell inequality violation. We show that the\noptimal basis is approximately the same as the fixed beam basis (or the rotated\nbeam basis) near the $t\\bar t$ production threshold, while it approaches the\nhelicity basis far above threshold. Using this basis, we present the\nsensitivity for entanglement and Bell inequality violation in $t\\bar t$ events\nat the LHC and a future $e^+e^-$ collider. Since observing Bell inequality\nviolation appears to be quite challenging experimentally, and requires a large\ndataset in collider experiments, choosing the optimal basis is crucially\nimportant to observe Bell inequality violation. Our method and general approach\nare equally applicable to other systems beyond $t \\bar t$, including\ninteractions beyond the Standard Model.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"joFTgn5V-0Y_VKSgiiDPAgkgLEM1Frt7H_SBTMUH6TQ","pdfSize":"1909825"}
