{"id":"2407.14436","title":"Integrated Resource Allocation and Strategy Synthesis in Safety Games on\n  Graphs with Deception","authors":"Abhishek N. Kulkarni, Matthew S. Cohen, Charles A. Kamhoua, and Jie Fu","authorsParsed":[["Kulkarni","Abhishek N.",""],["Cohen","Matthew S.",""],["Kamhoua","Charles A.",""],["Fu","Jie",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 16:08:24 GMT"}],"updateDate":"2024-07-22","timestamp":1721405304000,"abstract":"  Deception plays a crucial role in strategic interactions with incomplete\ninformation. Motivated by security applications, we study a class of two-player\nturn-based deterministic games with one-sided incomplete information, in which\nplayer 1 (P1) aims to prevent player 2 (P2) from reaching a set of target\nstates. In addition to actions, P1 can place two kinds of deception resources:\n\"traps\" and \"fake targets\" to disinform P2 about the transition dynamics and\npayoff of the game. Traps \"hide the real\" by making trap states appear normal,\nwhile fake targets \"reveal the fiction\" by advertising non-target states as\ntargets. We are interested in jointly synthesizing optimal decoy placement and\ndeceptive defense strategies for P1 that exploits P2's misinformation. We\nintroduce a novel hypergame on graph model and two solution concepts: stealthy\ndeceptive sure winning and stealthy deceptive almost-sure winning. These\nidentify states from which P1 can prevent P2 from reaching the target in a\nfinite number of steps or with probability one without allowing P2 to become\naware that it is being deceived. Consequently, determining the optimal decoy\nplacement corresponds to maximizing the size of P1's deceptive winning region.\nConsidering the combinatorial complexity of exploring all decoy allocations, we\nutilize compositional synthesis concepts to show that the objective function\nfor decoy placement is monotone, non-decreasing, and, in certain cases, sub- or\nsuper-modular. This leads to a greedy algorithm for decoy placement, achieving\na $(1 - 1/e)$-approximation when the objective function is sub- or\nsuper-modular. The proposed hypergame model and solution concepts contribute to\nunderstanding the optimal deception resource allocation and deception\nstrategies in various security applications.\n","subjects":["Computing Research Repository/Computer Science and Game Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sf09lyB2rweaFzMBlel15uMzVL0HC2G1rAZNuNN7iFQ","pdfSize":"1695728"}
