{"id":"2407.06812","title":"Heuristic Predictive Control for Multi-Robot Flocking in Congested\n  Environments","authors":"Guobin Zhu, Qingrui Zhang, Bo Zhu, Tianjiang Hu","authorsParsed":[["Zhu","Guobin",""],["Zhang","Qingrui",""],["Zhu","Bo",""],["Hu","Tianjiang",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 12:37:20 GMT"}],"updateDate":"2024-07-10","timestamp":1720528640000,"abstract":"  Multi-robot flocking possesses extraordinary advantages over a single-robot\nsystem in diverse domains, but it is challenging to ensure safe and optimal\nperformance in congested environments. Hence, this paper is focused on the\ninvestigation of distributed optimal flocking control for multiple robots in\ncrowded environments. A heuristic predictive control solution is proposed based\non a Gibbs Random Field (GRF), in which bio-inspired potential functions are\nused to characterize robot-robot and robot-environment interactions. The\noptimal solution is obtained by maximizing a posteriori joint distribution of\nthe GRF in a certain future time instant. A gradient-based heuristic solution\nis developed, which could significantly speed up the computation of the optimal\ncontrol. Mathematical analysis is also conducted to show the validity of the\nheuristic solution. Multiple collision risk levels are designed to improve the\ncollision avoidance performance of robots in dynamic environments. The proposed\nheuristic predictive control is evaluated comprehensively from multiple\nperspectives based on different metrics in a challenging simulation\nenvironment. The competence of the proposed algorithm is validated via the\ncomparison with the non-heuristic predictive control and two existing popular\nflocking control methods. Real-life experiments are also performed using four\nquadrotor UAVs to further demonstrate the efficiency of the proposed design.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}