{"id":"2407.11021","title":"PCAPVision: PCAP-Based High-Velocity and Large-Volume Network Failure\n  Detection","authors":"Lukasz Tulczyjew, Ihor Biruk, Murat Bilgic, Charles Abondo, Nathanael\n  Weill","authorsParsed":[["Tulczyjew","Lukasz",""],["Biruk","Ihor",""],["Bilgic","Murat",""],["Abondo","Charles",""],["Weill","Nathanael",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:52:17 GMT"}],"updateDate":"2024-07-17","timestamp":1719841937000,"abstract":"  Detecting failures via analysis of Packet Capture (PCAP) files is crucial for\nmaintaining network reliability and performance, especially in large-scale\ntelecommunications networks. Traditional methods, relying on manual inspection\nand rule-based systems, are often too slow and labor-intensive to meet the\ndemands of modern networks. In this paper, we present PCAPVision, a novel\napproach that utilizes computer vision and Convolutional Neural Networks (CNNs)\nto detect failures in PCAP files. By converting PCAP data into images, our\nmethod leverages the robust pattern recognition capabilities of CNNs to analyze\nnetwork traffic efficiently. This transformation process involves encoding\npacket data into structured images, enabling rapid and accurate failure\ndetection. Additionally, we incorporate a continual learning framework,\nleveraging automated annotation for the feedback loop, to adapt the model\ndynamically and ensure sustained performance over time. Our approach\nsignificantly reduces the time required for failure detection. The initial\ntraining phase uses a Voice Over LTE (VoLTE) dataset, demonstrating the model's\neffectiveness and generalizability when using transfer learning on Mobility\nManagement services. This work highlights the potential of integrating computer\nvision techniques in network analysis, offering a scalable and efficient\nsolution for real-time network failure detection.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}