{"id":"2407.16966","title":"Collaboration Between Robots, Interfaces and Humans: Practice-Based and\n  Audience Perspectives","authors":"Anna Savery, Richard Savery","authorsParsed":[["Savery","Anna",""],["Savery","Richard",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 03:14:05 GMT"}],"updateDate":"2024-07-25","timestamp":1721790845000,"abstract":"  This paper provides an analysis of a mixed-media experimental musical work\nthat explores the integration of human musical interaction with a newly\ndeveloped interface for the violin, manipulated by an improvising violinist,\ninteractive visuals, a robotic drummer and an improvised synthesised orchestra.\nWe first present a detailed technical overview of the systems involved\nincluding the design and functionality of each component. We then conduct a\npractice-based review examining the creative processes and artistic decisions\nunderpinning the work, focusing on the challenges and breakthroughs encountered\nduring its development. Through this introspective analysis, we uncover\ninsights into the collaborative dynamics between the human performer and\ntechnological agents, revealing the complexities of blending traditional\nmusical expressiveness with artificial intelligence and robotics. To gauge\npublic reception and interpretive perspectives, we conducted an online survey,\nsharing a video of the performance with a diverse audience. The feedback\ncollected from this survey offers valuable viewpoints on the accessibility,\nemotional impact, and perceived artistic value of the work. Respondents'\nreactions underscore the transformative potential of integrating advanced\ntechnologies in musical performance, while also highlighting areas for further\nexploration and refinement.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bHQYcEp1JcFVlLzFMoAl4tC8b169KnitGW9ResQ1MsA","pdfSize":"4476449"}
