{"id":"2407.05034","title":"GCON: Differentially Private Graph Convolutional Network via Objective\n  Perturbation","authors":"Jianxin Wei, Yizheng Zhu, Xiaokui Xiao, Ergute Bao, Yin Yang, Kuntai\n  Cai, Beng Chin Ooi","authorsParsed":[["Wei","Jianxin",""],["Zhu","Yizheng",""],["Xiao","Xiaokui",""],["Bao","Ergute",""],["Yang","Yin",""],["Cai","Kuntai",""],["Ooi","Beng Chin",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 09:59:56 GMT"}],"updateDate":"2024-07-09","timestamp":1720259996000,"abstract":"  Graph Convolutional Networks (GCNs) are a popular machine learning model with\na wide range of applications in graph analytics, including healthcare,\ntransportation, and finance. Similar to other neural networks, a GCN may\nmemorize parts of the training data through its model weights. Thus, when the\nunderlying graph data contains sensitive information such as interpersonal\nrelationships, a GCN trained without privacy-protection measures could be\nexploited to extract private data, leading to potential violations of privacy\nregulations such as GDPR. To defend against such attacks, a promising approach\nis to train the GCN with differential privacy (DP), which is a rigorous\nframework that provides strong privacy protection by injecting random noise\ninto the trained model weights. However, training a large graph neural network\nunder DP is a highly challenging task. Existing solutions either introduce\nrandom perturbations in the graph topology, which leads to severe distortions\nof the network's message passing, or inject randomness into each neighborhood\naggregation operation, which leads to a high noise scale when the GCN performs\nmultiple levels of aggregations. Motivated by this, we propose GCON, a novel\nand effective solution for training GCNs with edge differential privacy. The\nmain idea is to (i) convert the GCN training process into a convex optimization\nproblem, and then (ii) apply the classic idea of perturbing the objective\nfunction to satisfy DP. Extensive experiments using multiple benchmark datasets\ndemonstrate GCON's consistent and superior performance over existing solutions\nin a wide variety of settings.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}