{"id":"2407.07316","title":"Fast Revenue Maximization","authors":"Achraf Bahamou, Omar Besbes and Omar Mouchtaki","authorsParsed":[["Bahamou","Achraf",""],["Besbes","Omar",""],["Mouchtaki","Omar",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 02:25:27 GMT"}],"updateDate":"2024-07-11","timestamp":1720578327000,"abstract":"  We study a data-driven problem pricing problem in which a seller offers a\nprice for a single item based on demand observed at a small finite number of\nhistorical prices. Our goal is to derive precise evaluation procedures of the\nvalue of the historical information gathered by the seller, along with\nprescriptions for more efficient price experimentation. Our main methodological\nresult is an exact characterization of the maximin ratio (defined as the\nworst-case revenue garnered by a seller who only relies on past data divided by\nthe optimal revenue achievable with full knowledge of the distribution of\nvalues). This result allows to measure the value of any historical data\nconsisting of prices and corresponding conversion rates. We leverage this\ncentral reduction to provide new insights about price experimentation.\nMotivated by practical constraints that impede the seller from changing prices\nabruptly, we first illustrate our framework by evaluating the value of local\ninformation and show that the mere sign of the gradient may sometimes provide\nsignificant information to the seller. We then showcase how our framework can\nbe used to run efficient price experiments. On the one hand, we develop a\nmethod to select the next price experiment that the seller should use to\nmaximize the information obtained. On the other hand, we demonstrate that our\nresult allows to considerably reduce the price experimentation needed to reach\npreset revenue guarantees through dynamic pricing algorithms.\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Mathematics/Optimization and Control","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}