{"id":"2407.10379","title":"Room temperature operation of germanium-silicon single-photon avalanche\n  diode","authors":"Neil Na, Yen-Cheng Lu, Yu-Hsuan Liu, Po-Wei Chen, Ying-Chen Lai,\n  You-Ru Lin, Chung-Chih Lin, Tim Shia, Chih-Hao Cheng, and Shu-Lu Chen","authorsParsed":[["Na","Neil",""],["Lu","Yen-Cheng",""],["Liu","Yu-Hsuan",""],["Chen","Po-Wei",""],["Lai","Ying-Chen",""],["Lin","You-Ru",""],["Lin","Chung-Chih",""],["Shia","Tim",""],["Cheng","Chih-Hao",""],["Chen","Shu-Lu",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 01:17:20 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 16:44:14 GMT"}],"updateDate":"2024-09-18","timestamp":1721006240000,"abstract":"  The ability to detect single photons has led to the advancement of numerous\nresearch fields. Although various types of single-photon detector have been\ndeveloped, because of two main factors - that is, (1) the need for operating at\ncryogenic temperature and (2) the incompatibility with complementary\nmetal-oxide-semiconductor (CMOS) fabrication processes - so far, to our\nknowledge, only Si-based single-photon avalanche diode (SPAD) has gained\nmainstream success and has been used in consumer electronics. With the growing\ndemand to shift the operation wavelength from near-infrared to short-wavelength\ninfrared (SWIR) for better safety and performance, an alternative solution is\nrequired because Si has negligible optical absorption for wavelengths beyond 1\n{\\mu}m. Here we report a CMOS-compatible, high-performing germanium-silicon\nSPAD operated at room temperature, featuring a noise-equivalent power\nimprovement over the previous Ge-based SPADs by 2-3.5 orders of magnitude. Key\nparameters such as dark count rate, single-photon detection probability at\n1,310 nm, timing jitter, after-pulsing characteristic time and after-pulsing\nprobability are, respectively, measured as 19 kHz {\\mu}m^2, 12%, 188 ps, ~90 ns\nand <1%, with a low breakdown voltage of 10.26 V and a small excess bias of\n0.75 V. Three-dimensional point-cloud images are captured with direct\ntime-of-flight technique as proof of concept. This work paves the way towards\nusing single-photon-sensitive SWIR sensors, imagers and photonic integrated\ncircuits in everyday life.\n","subjects":["Physics/Instrumentation and Detectors","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}