{"id":"2407.02902","title":"Instrumental Variable methods to target Hypothetical Estimands with\n  longitudinal repeated measures data: Application to the STEP 1 trial","authors":"Jack Bowden, Jesper Madsen, Bryan Goldman, Aske Thorn Iversen, Xiaoran\n  Liang and Stijn Vansteelandt","authorsParsed":[["Bowden","Jack",""],["Madsen","Jesper",""],["Goldman","Bryan",""],["Iversen","Aske Thorn",""],["Liang","Xiaoran",""],["Vansteelandt","Stijn",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 08:20:54 GMT"}],"updateDate":"2024-07-04","timestamp":1719994854000,"abstract":"  The STEP 1 randomized trial evaluated the effect of taking semaglutide vs\nplacebo on body weight over a 68 week duration. As with any study evaluating an\nintervention delivered over a sustained period, non-adherence was observed.\nThis was addressed in the original trial analysis within the Estimand Framework\nby viewing non-adherence as an intercurrent event. The primary analysis applied\na treatment policy strategy which viewed it as an aspect of the treatment\nregimen, and thus made no adjustment for its presence. A supplementary analysis\nused a hypothetical strategy, targeting an estimand that would have been\nrealised had all participants adhered, under the assumption that no\npost-baseline variables confounded adherence and change in body weight. In this\npaper we propose an alternative Instrumental Variable method to adjust for\nnon-adherence which does not rely on the same `unconfoundedness' assumption and\nis less vulnerable to positivity violations (e.g., it can give valid results\neven under conditions where non-adherence is guaranteed). Unlike many previous\nInstrumental Variable approaches, it makes full use of the repeatedly measured\noutcome data, and allows for a time-varying effect of treatment adherence on a\nparticipant's weight. We show that it provides a natural vehicle for defining\ntwo distinct hypothetical estimands: the treatment effect if all participants\nwould have adhered to semaglutide, and the treatment effect if all participants\nwould have adhered to both semaglutide and placebo. When applied to the STEP 1\nstudy, they both suggest a sustained, slowly decaying weight loss effect of\nsemaglutide treatment.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8Zi8JnobP3mZU1-0alHZ0srHf1qGH1bllFDrQdWO0UM","pdfSize":"2057972","objectId":"0xd4b0dfb579db95ba68bbed399f3d5c0edd15c1a2b844026b6abe246a806f3e40","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
