{"id":"2407.16282","title":"Limit Value in Zero-Sum Stochastic Games with Vanishing Stage Duration\n  and Public Signals","authors":"Ivan Novikov (CEREMADE)","authorsParsed":[["Novikov","Ivan","","CEREMADE"]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 08:35:03 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 15:05:29 GMT"}],"updateDate":"2024-07-25","timestamp":1721723703000,"abstract":"  We consider the behaviour of $\\lambda$-discounted zero-sum games as the\ndiscount factor $\\lambda$ approaches 0 (that is, the players are more and more\npatient), in the context of games with stage duration. In stochastic games with\nstage duration h, players act at times 0, h, 2h, and so on. The payoff and\nleaving probabilities are proportional to h. When h tends to 0, such\ndiscrete-time games approximate games played in continuous time. The asymptotic\nbehavior of the values (when both $\\lambda$ and h tend to 0) was already\nstudied in the case of stochastic games with perfect observation of the state\nand in the state-blind case.We consider the same question for the case of\nstochastic games with imperfect observation of the state. More precisely, we\nconsider a particular case of such games, stochastic games with public signals,\nin which players are given at each stage a public signal that depends only on\nthe current state. Our main result states that there exists a stochastic game\nwith public signals, with no limit value (as the discount factor $\\lambda$ goes\nto 0) if stage duration is 1, but with a limit value when stage duration h and\ndiscount factor $\\lambda$ both tend to 0. Informally speaking, it means that\nthe limit value in discrete time does not exist, but the limit value in\ncontinuous time (i.e. when h approaches 0) exists. Such a situation is\nimpossible in the case of stochastic games with perfect observation of the\nstate.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}