{"id":"2407.21236","title":"GNUMAP: A Parameter-Free Approach to Unsupervised Dimensionality\n  Reduction via Graph Neural Networks","authors":"Jihee You, So Won Jeong, Claire Donnat","authorsParsed":[["You","Jihee",""],["Jeong","So Won",""],["Donnat","Claire",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 22:58:23 GMT"}],"updateDate":"2024-08-01","timestamp":1722380303000,"abstract":"  With the proliferation of Graph Neural Network (GNN) methods stemming from\ncontrastive learning, unsupervised node representation learning for graph data\nis rapidly gaining traction across various fields, from biology to molecular\ndynamics, where it is often used as a dimensionality reduction tool. However,\nthere remains a significant gap in understanding the quality of the\nlow-dimensional node representations these methods produce, particularly beyond\nwell-curated academic datasets. To address this gap, we propose here the first\ncomprehensive benchmarking of various unsupervised node embedding techniques\ntailored for dimensionality reduction, encompassing a range of manifold\nlearning tasks, along with various performance metrics. We emphasize the\nsensitivity of current methods to hyperparameter choices -- highlighting a\nfundamental issue as to their applicability in real-world settings where there\nis no established methodology for rigorous hyperparameter selection. Addressing\nthis issue, we introduce GNUMAP, a robust and parameter-free method for\nunsupervised node representation learning that merges the traditional UMAP\napproach with the expressivity of the GNN framework. We show that GNUMAP\nconsistently outperforms existing state-of-the-art GNN embedding methods in a\nvariety of contexts, including synthetic geometric datasets, citation networks,\nand real-world biomedical data -- making it a simple but reliable\ndimensionality reduction tool.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}