{"id":"2407.13121","title":"Nematic Ising superconductivity with hidden magnetism in few-layer\n  6R-TaS2","authors":"Shao-Bo Liu, Congkuan Tian, Yuqiang Fang, Hongtao Rong, Lu Cao,\n  Xinjian Wei, Hang Cui, Mantang Chen, Di Chen, Yuanjun Song, Jian Cui, Jiankun\n  Li, Shuyue Guan, Shuang Jia, Chaoyu Chen, Wenyu He, Fuqiang Huang, Yuhang\n  Jiang, Jinhai Mao, X. C. Xie, K.T. Law, Jian-Hao Chen","authorsParsed":[["Liu","Shao-Bo",""],["Tian","Congkuan",""],["Fang","Yuqiang",""],["Rong","Hongtao",""],["Cao","Lu",""],["Wei","Xinjian",""],["Cui","Hang",""],["Chen","Mantang",""],["Chen","Di",""],["Song","Yuanjun",""],["Cui","Jian",""],["Li","Jiankun",""],["Guan","Shuyue",""],["Jia","Shuang",""],["Chen","Chaoyu",""],["He","Wenyu",""],["Huang","Fuqiang",""],["Jiang","Yuhang",""],["Mao","Jinhai",""],["Xie","X. C.",""],["Law","K. T.",""],["Chen","Jian-Hao",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 03:02:09 GMT"}],"updateDate":"2024-07-19","timestamp":1721271729000,"abstract":"  In van der Waals heterostructures (vdWHs), the manipulation of interlayer\nstacking/coupling allows for the construction of customizable quantum systems\nexhibiting exotic physics. An illustrative example is the diverse range of\nstates of matter achieved through varying the proximity coupling between\ntwo-dimensional (2D) quantum spin liquid (QSL) and superconductors within the\nTaS2 family. This study presents a demonstration of the intertwined physics of\nspontaneous rotational symmetry breaking, hidden magnetism, and Ising\nsuperconductivity in the three-fold rotationally symmetric, non-magnetic\nnatural vdWHs 6R-TaS2. A distinctive phase emerges in 6R-TaS2 below a\ncharacteristic temperature (T*) of approximately 30 K, which is characterized\nby a remarkable set of features, including a giant extrinsic anomalous Hall\neffect (AHE), Kondo screening, magnetic field-tunable thermal hysteresis, and\nnematic magneto-resistance. At lower temperatures, a coexistence of nematicity\nand Kondo screening with Ising superconductivity is observed, providing\ncompelling evidence of hidden magnetism within a superconductor. This research\nnot only sheds light on unexpected emergent physics resulting from the coupling\nof itinerant electrons and localized/correlated electrons in natural vdWHs but\nalso emphasizes the potential for tailoring exotic quantum states through the\nmanipulation of interlayer interactions.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science","Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}