{"id":"2407.07645","title":"On Sampling from Ising Models with Spectral Constraints","authors":"Andreas Galanis, Alkis Kalavasis, Anthimos Vardis Kandiros","authorsParsed":[["Galanis","Andreas",""],["Kalavasis","Alkis",""],["Kandiros","Anthimos Vardis",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 13:27:45 GMT"}],"updateDate":"2024-07-11","timestamp":1720618065000,"abstract":"  We consider the problem of sampling from the Ising model when the underlying\ninteraction matrix has eigenvalues lying within an interval of length $\\gamma$.\nRecent work in this setting has shown various algorithmic results that apply\nroughly when $\\gamma< 1$, notably with nearly-linear running times based on the\nclassical Glauber dynamics. However, the optimality of the range of $\\gamma$\nwas not clear since previous inapproximability results developed for the\nantiferromagnetic case (where the matrix has entries $\\leq 0$) apply only for\n$\\gamma>2$.\n  To this end, Kunisky (SODA'24) recently provided evidence that the problem\nbecomes hard already when $\\gamma>1$ based on the low-degree hardness for an\ninference problem on random matrices. Based on this, he conjectured that\nsampling from the Ising model in the same range of $\\gamma$ is NP-hard.\n  Here we confirm this conjecture, complementing in particular the known\nalgorithmic results by showing NP-hardness results for approximately counting\nand sampling when $\\gamma>1$, with strong inapproximability guarantees; we also\nobtain a more refined hardness result for matrices where only a constant number\nof entries per row are allowed to be non-zero. The main observation in our\nreductions is that, for $\\gamma>1$, Glauber dynamics mixes slowly when the\ninteractions are all positive (ferromagnetic) for the complete and random\nregular graphs, due to a bimodality in the underlying distribution. While\nferromagnetic interactions typically preclude NP-hardness results, here we work\naround this by introducing in an appropriate way mild antiferromagnetism,\nkeeping the spectrum roughly within the same range. This allows us to exploit\nthe bimodality of the aforementioned graphs and show the target NP-hardness by\nadapting suitably previous inapproximability techniques developed for\nantiferromagnetic systems.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Mathematics/Probability"],"license":"http://creativecommons.org/licenses/by/4.0/"}