{"id":"2407.10821","title":"Astro-COLIBRI: Empowering Citizen Scientists in Time Domain Astronomy","authors":"Fabian Sch\\\"ussler, M. de Bony de Lavergne, A. Kaan Alkan, J. Mourier","authorsParsed":[["Schüssler","Fabian",""],["de Lavergne","M. de Bony",""],["Alkan","A. Kaan",""],["Mourier","J.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 15:35:48 GMT"}],"updateDate":"2024-07-16","timestamp":1721057748000,"abstract":"  In recent decades, astronomy and astrophysics have experienced several\nfundamental changes. On one hand, there has been a significant increase in the\nobservation of transient phenomena, which are short-lived events such as\nsupernova explosions, fast radio bursts, and gamma-ray bursts. In addition, the\ndetection of a growing number of different cosmic messengers provides\nresearchers with crucial information about these objects. For example, the\ndetection of high-energy neutrinos and gravitational waves regularly\ncomplements traditional astronomical observations in the electromagnetic\nspectrum. This trend is expected to intensify in the coming years with the\ncommissioning of a wide variety of next-generation observatories, which will\nenable more in-depth studies of the transient sky.\n  To enhance our understanding and optimize the observations of these\nphenomena, we have developed the Astro-COLIBRI platform. It is freely available\nto amateur and professional astronomers in the form of a smartphone application\n(iOS and Android), a web interface, an API, and a chatbot 'Astro-COLIBRI GPT',\namong many other features. Astro-COLIBRI serves as a central access point for\ninformation on astrophysical sources and transient events, allowing a wide\nnetwork of observers to track and receive real-time alerts.\n  Here we highlight the key features of Astro-COLIBRI, with a particular\nemphasis on recent innovations. These include a discussion forum that\nfacilitates user interactions and our strengthened collaboration with various\nnetworks of amateur astronomers.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}