{"id":"2407.12250","title":"Testing the cosmic distance duality relation with Type Ia supernova and\n  transverse BAO measurements","authors":"Min Wang, Xiangyun Fu, Bing Xu, Yang Huang, Ying Yang, and Zhenyan Lu","authorsParsed":[["Wang","Min",""],["Fu","Xiangyun",""],["Xu","Bing",""],["Huang","Yang",""],["Yang","Ying",""],["Lu","Zhenyan",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 01:35:34 GMT"}],"updateDate":"2024-07-18","timestamp":1721180134000,"abstract":"  In this work, we test the cosmic distance duality relation (CDDR) by\ncomparing the angular diameter distance (ADD) derived from the transverse\nBaryon Acoustic Oscillations (BAO) data with the luminosity distance (LD) from\nthe Pantheon type Ia supernova (SNIa) sample. The binning method and Gaussian\nprocess are employed to match ADD data with LD data at the same redshift.\nFirst, we use nonparametric and parametric methods to investigate the impact of\nthe specific prior values of the absolute magnitude $M_{\\rm B}$ from SNIa\nobservations and the sound horizon scale $r_{\\rm s}$ from transverse BAO\nmeasurements on the CDDR tests. The results obtained from the parametric and\nnon-parametric methods indicate that specific prior values of $M_{\\rm B}$ and\n$r_{\\rm s}$ lead to significant biases on the CDDR test. Then, to avoid these\nbiases, we propose a method independent of $M_{\\rm B}$ and $r_{\\rm s}$ to test\nCDDR by considering the fiducial value of $\\kappa\\equiv10^{M_{\\rm B} \\over\n5}r_{\\rm s}$ as a nuisance parameter and then marginalizing its influence with\na flat prior in the analysis. No violation of the CDDR is found, and the\ntransverse BAO measurement can be used as a powerful tool to verify the\nvalidity of CDDR in the cosmological-model-independent method.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DWKxHCV7wy9DXiFfFGhxcOaofObTBCzRvMwcqtZVPq0","pdfSize":"2554920"}
