{"id":"2407.12432","title":"Validation of the static forward Grad-Shafranov equilibrium solvers in\n  FreeGSNKE and Fiesta using EFIT++ reconstructions from MAST-U","authors":"K. Pentland, N.C. Amorisco, O. El-Zobaidi, S. Etches, A. Agnello, G.\n  K. Holt, C. Vincent, J. Buchanan, S. J. P. Pamela, G. McArdle, L. Kogan, G.\n  Cunningham","authorsParsed":[["Pentland","K.",""],["Amorisco","N. C.",""],["El-Zobaidi","O.",""],["Etches","S.",""],["Agnello","A.",""],["Holt","G. K.",""],["Vincent","C.",""],["Buchanan","J.",""],["Pamela","S. J. P.",""],["McArdle","G.",""],["Kogan","L.",""],["Cunningham","G.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 09:40:16 GMT"}],"updateDate":"2024-07-18","timestamp":1721209216000,"abstract":"  A key aspect in the modelling of magnetohydrodynamic (MHD) equilibria in\ntokamak devices is having access to fast, accurate, and stable numerical\nsimulation methods. There is an increasing demand for reliable methods that can\nbe used to develop traditional or machine learning-based shape control feedback\nsystems, optimise scenario designs, and integrate with other plasma edge or\ntransport modelling codes. To handle such applications, these codes need to be\nflexible and, more importantly, they need to have been validated against both\nanalytically known and real-world tokamak equilibria to ensure they are\nconsistent and credible. In this paper, we are interested in solving the static\nforward Grad-Shafranov (GS) problem for free-boundary MHD equilibria. Our focus\nis on the validation of the static forward solver in the Python-based\nequilibrium code FreeGSNKE by solving equilibria from magnetics-only EFIT++\nreconstructions of MAST-U shots. In addition, we also validate FreeGSNKE\nagainst equilibria simulated using the well-established MATLAB-based\nequilibrium code Fiesta. To do this, we develop a computational pipeline that\nallows one to load the same (a)symmetric MAST-U machine description into each\nsolver, specify the required inputs (active/passive conductor currents, plasma\nprofiles and coefficients, etc.) from EFIT++, and solve the GS equation for all\navailable time slices across a shot. For a number of different MAST-U shots, we\ndemonstrate that both FreeGSNKE and Fiesta can successfully reproduce various\npoloidal flux quantities and shape targets (e.g. midplane radii, magnetic axes,\nseparatrices, X-points, and strikepoints) in agreement with EFIT++ calculations\nto a very high degree of accuracy. We also provide public access to the\ncode/data required to load the MAST-U machine description in FreeGSNKE/Fiesta\nand reproduce the equilibria in the shots shown.\n","subjects":["Physics/Plasma Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BdqxfEHHygQCjL5bLpOf5J4Zb0G-xpDPnbqvrNe89ko","pdfSize":"5119585"}
