{"id":"2407.04135","title":"The multi$-$physics analysis and design of CUSP, a two CubeSat\n  constellation for Space Weather and Solar flares X-ray polarimetry","authors":"Giovanni Lombardi, Sergio Fabiani, Ettore Del Monte, Enrico Costa,\n  Paolo Soffitta, Fabio Muleri, Ilaria Baffo, Marco E. Biancolini, Sergio\n  Bonomo, Daniele Brienza, Riccardo Campana, Mauro Centrone, Gessica Contini,\n  Giovanni Cucinella, Andrea Curatolo, Nicolas De Angelis, Giovanni De Cesare,\n  Andrea Del Re, Sergio Di Cosimo, Simone Di Filippo, Alessandro Di Marco,\n  Emanuele Di Meo, Giuseppe Di Persio, Immacolata Donnarumma, Pierluigi\n  Fanelli, Paolo Leonetti, Alfredo Locarini, Pasqualino Loffredo, Andrea Lopez,\n  Gabriele Minervini, Dario Modenini, Silvia Natalucci, Andrea Negri, Massimo\n  Perelli, Monia Rossi, Alda Rubini, Emanuele Scalise, Andrea Terracciano,\n  Paolo Tortora, Emanuele Zaccagnino, Alessandro Zambardi","authorsParsed":[["Lombardi","Giovanni",""],["Fabiani","Sergio",""],["Del Monte","Ettore",""],["Costa","Enrico",""],["Soffitta","Paolo",""],["Muleri","Fabio",""],["Baffo","Ilaria",""],["Biancolini","Marco E.",""],["Bonomo","Sergio",""],["Brienza","Daniele",""],["Campana","Riccardo",""],["Centrone","Mauro",""],["Contini","Gessica",""],["Cucinella","Giovanni",""],["Curatolo","Andrea",""],["De Angelis","Nicolas",""],["De Cesare","Giovanni",""],["Del Re","Andrea",""],["Di Cosimo","Sergio",""],["Di Filippo","Simone",""],["Di Marco","Alessandro",""],["Di Meo","Emanuele",""],["Di Persio","Giuseppe",""],["Donnarumma","Immacolata",""],["Fanelli","Pierluigi",""],["Leonetti","Paolo",""],["Locarini","Alfredo",""],["Loffredo","Pasqualino",""],["Lopez","Andrea",""],["Minervini","Gabriele",""],["Modenini","Dario",""],["Natalucci","Silvia",""],["Negri","Andrea",""],["Perelli","Massimo",""],["Rossi","Monia",""],["Rubini","Alda",""],["Scalise","Emanuele",""],["Terracciano","Andrea",""],["Tortora","Paolo",""],["Zaccagnino","Emanuele",""],["Zambardi","Alessandro",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 19:41:32 GMT"}],"updateDate":"2024-07-08","timestamp":1720122092000,"abstract":"  The CUbesat Solar Polarimeter (CUSP) project aims to develop a constellation\nof two CubeSats orbiting the Earth to measure the linear polarization of solar\nflares in the hard X-ray band by means of a Compton scattering polarimeter on\nboard of each satellite. CUSP will allow to study the magnetic reconnection and\nparticle acceleration in the flaring magnetic structures. CUSP is a project\napproved for a Phase B study by the Italian Space Agency in the framework of\nthe Alcor program aimed to develop CubeSat technologies and missions. In this\npaper we describe the a method for a multi-physical simulation analysis while\nanalyzing some possible design optimization of the payload design solutions\nadopted. In particular, we report the mechanical design for each structural\ncomponent, the results of static and dynamic finite element analysis, the\npreliminary thermo-mechanical analysis for two specific thermal cases (hot and\ncold orbit) and a topological optimization of the interface between the\nplatform and the payload.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}