{"id":"2407.04562","title":"An SDE Perspective on Stochastic Inertial Gradient Dynamics with\n  Time-Dependent Viscosity and Geometric Damping","authors":"Rodrigo Maulen-Soto and Jalal Fadili and Hedy Attouch and Peter Ochs","authorsParsed":[["Maulen-Soto","Rodrigo",""],["Fadili","Jalal",""],["Attouch","Hedy",""],["Ochs","Peter",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 14:53:32 GMT"}],"updateDate":"2024-07-08","timestamp":1720191212000,"abstract":"  Our approach is part of the close link between continuous dissipative\ndynamical systems and optimization algorithms. We aim to solve convex\nminimization problems by means of stochastic inertial differential equations\nwhich are driven by the gradient of the objective function. This will provide a\ngeneral mathematical framework for analyzing fast optimization algorithms with\nstochastic gradient input. Our study is a natural extension of our previous\nwork devoted to the first-order in time stochastic steepest descent. Our goal\nis to develop these results further by considering second-order stochastic\ndifferential equations in time, incorporating a viscous time-dependent damping\nand a Hessian-driven damping. To develop this program, we rely on stochastic\nLyapunov analysis. Assuming a square-integrability condition on the diffusion\nterm times a function dependant on the viscous damping, and that the\nHessian-driven damping is a positive constant, our first main result shows that\nalmost surely, there is convergence of the values, and states fast convergence\nof the values in expectation. Besides, in the case where the Hessian-driven\ndamping is zero, we conclude with the fast convergence of the values in\nexpectation and in almost sure sense, we also managed to prove almost sure weak\nconvergence of the trajectory. We provide a comprehensive complexity analysis\nby establishing several new pointwise and ergodic convergence rates in\nexpectation for the convex and strongly convex case.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}