{"id":"2407.10447","title":"A generalized geometric mechanics theory for multi-curve-fold origami:\n  vertex constrained universal configurations","authors":"Zhixuan Wen, Pengyu Lv, Fan Feng, Huiling Duan","authorsParsed":[["Wen","Zhixuan",""],["Lv","Pengyu",""],["Feng","Fan",""],["Duan","Huiling",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 05:39:18 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 03:16:57 GMT"}],"updateDate":"2024-08-16","timestamp":1721021958000,"abstract":"  Folding paper along curves leads to spatial structures that have curved\nsurfaces meeting at spatial creases, defined as curve-fold origami. In this\nwork, we provide an Eulerian framework focusing on the mechanics of arbitrary\ncurve-fold origami, especially for multi-curve-fold origami with vertices. We\nstart with single-curve-fold origami that has wide panels. Wide panel leads to\ndifferent domains of mechanical responses induced by various generator\ndistributions of the curved surface. The theories are then extended to\nmulti-curve-fold origami, involving additional geometric correlations between\ncreases. As an illustrative example, the deformation and equilibrium\nconfiguration of origami with annular creases are studied both theoretically\nand numerically. Afterward, single-vertex curved origami theory is studied as a\nspecial type of multi-curve-fold origami. We find that the extra periodicity at\nthe vertex strongly constrains the configuration space, leading to a region\nnear the vertex that has a striking universal equilibrium configuration\nregardless of the mechanical properties. Both theories and numerics confirm the\nexistence of the universality in the near-field region. In addition, the\nfar-field deformation is obtained via energy minimization and validated by\nfinite element analysis. Our generalized multi-curve-fold origami theory,\nincluding the vertex-contained universality, is anticipated to provide a new\nunderstanding and framework for the shape programming of the curved fold\norigami system.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}