{"id":"2407.08867","title":"What Do People Think about Sentient AI?","authors":"Jacy Reese Anthis, Janet V.T. Pauketat, Ali Ladak, and Aikaterina\n  Manoli","authorsParsed":[["Anthis","Jacy Reese",""],["Pauketat","Janet V. T.",""],["Ladak","Ali",""],["Manoli","Aikaterina",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 21:04:39 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 09:39:44 GMT"}],"updateDate":"2024-07-16","timestamp":1720731879000,"abstract":"  With rapid advances in machine learning, many people in the field have been\ndiscussing the rise of digital minds and the possibility of artificial\nsentience. Future developments in AI capabilities and safety will depend on\npublic opinion and human-AI interaction. To begin to fill this research gap, we\npresent the first nationally representative survey data on the topic of\nsentient AI: initial results from the Artificial Intelligence, Morality, and\nSentience (AIMS) survey, a preregistered and longitudinal study of U.S. public\nopinion that began in 2021. Across one wave of data collection in 2021 and two\nin 2023 (total N = 3,500), we found mind perception and moral concern for AI\nwell-being in 2021 were higher than predicted and significantly increased in\n2023: for example, 71% agree sentient AI deserve to be treated with respect,\nand 38% support legal rights. People have become more threatened by AI, and\nthere is widespread opposition to new technologies: 63% support a ban on\nsmarter-than-human AI, and 69% support a ban on sentient AI. Expected timelines\nare surprisingly short and shortening with a median forecast of sentient AI in\nonly five years and artificial general intelligence in only two years. We argue\nthat, whether or not AIs become sentient, the discussion itself may overhaul\nhuman-computer interaction and shape the future trajectory of AI technologies,\nincluding existential risks and opportunities.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Emerging Technologies","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wkQ3G6UzclELqjKP8JyEw7qlCMreI0DKi3o1h643kUo","pdfSize":"1591158","objectId":"0x7a9996f8247e13fb84800d9a479a92afb8e485ce12dc2eff3cd3ef5b143841d0","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
