{"id":"2407.12420","title":"Direct Nanopatterning of Complex 3D Surfaces and Self-Aligned\n  Superlattices via Molecular-Beam Holographic Lithography","authors":"Shuangshuang Zeng, Tian Tian, Jiwoo Oh, Chih-Jen Shih","authorsParsed":[["Zeng","Shuangshuang",""],["Tian","Tian",""],["Oh","Jiwoo",""],["Shih","Chih-Jen",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 09:00:31 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 13:37:12 GMT"}],"updateDate":"2024-07-19","timestamp":1721206831000,"abstract":"  Conventional lithography methods involving pattern transfer through resist\ntemplating face challenges of material compatibility with various process\nsolvents. Other approaches of direct material writing often compromise pattern\ncomplexity and overlay accuracy. Here we explore a concept based on the moir\\'e\ninterference of molecular beams to directly pattern complex three-dimensional\n(3D) surfaces made by any evaporable materials, such as metals, oxides and\norganic semiconductors. Our proposed approach, termed the Molecular-Beam\nHolographic Lithography (MBHL), relies on precise control over angular\nprojections of material flux passing through nanoapertures superimposed on the\nsubstrate, emulating the interference of coherent laser beams in interference\nlithography. Incorporating with our computational lithography (CL) algorithm,\nwe have demonstrated self-aligned overlay of multiple material patterns to\nyield binary up to quinary superlattices, with a critical dimension and overlay\naccuracy on the order of 50 and 2 nanometers, respectively. The process is\nexpected to substantially expand the boundary of materials combination for\nhigh-throughput fabrication of complex superstructures of translational\nsymmetry on arbitrary substrates, enabling new nanoimaging, sensing, catalysis,\nand optoelectronic devices.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}