{"id":"2407.14579","title":"Dark matter core creation depends on the timing of star formation","authors":"Claudia Muni, Andrew Pontzen, Justin I. Read, Oscar Agertz, Martin P.\n  Rey, Ethan Taylor","authorsParsed":[["Muni","Claudia",""],["Pontzen","Andrew",""],["Read","Justin I.",""],["Agertz","Oscar",""],["Rey","Martin P.",""],["Taylor","Ethan",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-23","timestamp":1721412000000,"abstract":"  We study feedback-driven cold dark matter core creation in the EDGE suite of\nradiation-hydrodynamical dwarf galaxy simulations. Understanding this process\nis crucial when using observed dwarf galaxies to constrain the particle nature\nof dark matter. While previous studies have shown the stellar-mass to halo-mass\nratio $(M_{\\star} / M_{200})$ determines the extent of core creation, we find\nthat in low-mass dwarfs there is a crucial additional effect, namely the timing\nof star formation relative to reionisation. Sustained post-reionisation star\nformation decreases central dark matter density through potential fluctuations;\nconversely, pre-reionisation star formation is too short-lived to have such an\neffect. In fact, large stellar masses accrued prior to reionisation are a\nstrong indicator of early collapse, and therefore indicative of an increased\ncentral dark matter density. We parameterise this differentiated effect by\nconsidering $M_{\\star,\\mathrm{post}}/M_{\\star,\\mathrm{pre}}$, where the\nnumerator and denominator represent the amount of star formation after and\nbefore $z\\sim6.5$, respectively. Our study covers the halo mass range $10^9 <\nM_{200} < 10^{10} M_\\odot$ (stellar masses between $10^4 < M_{\\star} < 10^8\nM_\\odot$), spanning both ultra-faint and classical dwarfs. In this regime,\n$M_{\\star,\\mathrm{post}}/M_{\\star,\\mathrm{pre}}$ correlates almost perfectly\nwith the central dark matter density at $z=0$, even when including simulations\nwith a substantially different variant of feedback and cooling. We provide\nfitting formulae to describe the newfound dependence.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}