{"id":"2407.18937","title":"Advancements in Recommender Systems: A Comprehensive Analysis Based on\n  Data, Algorithms, and Evaluation","authors":"Xin Ma, Mingyue Li, Xuguang Liu","authorsParsed":[["Ma","Xin",""],["Li","Mingyue",""],["Liu","Xuguang",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 14:02:21 GMT"}],"updateDate":"2024-07-30","timestamp":1720620141000,"abstract":"  Using 286 research papers collected from Web of Science, ScienceDirect,\nSpringerLink, arXiv, and Google Scholar databases, a systematic review\nmethodology was adopted to review and summarize the current challenges and\npotential future developments in data, algorithms, and evaluation aspects of\nRSs. It was found that RSs involve five major research topics, namely\nalgorithmic improvement, domain applications, user behavior & cognition, data\nprocessing & modeling, and social impact & ethics. Collaborative filtering and\nhybrid recommendation techniques are mainstream. The performance of RSs is\njointly limited by four types of eight data issues, two types of twelve\nalgorithmic issues, and two evaluation issues. Notably, data-related issues\nsuch as cold start, data sparsity, and data poisoning, algorithmic issues like\ninterest drift, device-cloud collaboration, non-causal driven, and multitask\nconflicts, along with evaluation issues such as offline data leakage and\nmulti-objective balancing, have prominent impacts. Fusing physiological signals\nfor multimodal modeling, defending against data poisoning through user\ninformation behavior, evaluating generative recommendations via social\nexperiments, fine-tuning pre-trained large models to schedule device-cloud\nresource, enhancing causal inference with deep reinforcement learning, training\nmulti-task models based on probability distributions, using cross-temporal\ndataset partitioning, and evaluating recommendation objectives across the full\nlifecycle are feasible solutions to address the aforementioned prominent\nchallenges and unlock the power and value of RSs.The collected literature is\nmainly based on major international databases, and future research will further\nexpand upon it.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}