{"id":"2407.05798","title":"Visualization of Unconventional Rashba Band and Vortex Zero Mode in\n  Topopogical Superconductor Candidate AuSn$_{4}$","authors":"Yuhan Ye, Rui Song, Hongqin Xiao, Guoyu Xian, Hui Guo, Haitao Yang,\n  Hui Chen and Hong-Jun Gao","authorsParsed":[["Ye","Yuhan",""],["Song","Rui",""],["Xiao","Hongqin",""],["Xian","Guoyu",""],["Guo","Hui",""],["Yang","Haitao",""],["Chen","Hui",""],["Gao","Hong-Jun",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 09:59:00 GMT"},{"version":"v2","created":"Tue, 9 Jul 2024 08:54:21 GMT"}],"updateDate":"2024-07-10","timestamp":1720432740000,"abstract":"  Topological superconductivity (TSC) is a promising platform to host Majorana\nzero mode (MZM) for topological quantum computing. Recently, the noble metal\nalloy AuSn$_{4}$ has been identified as an intrinsic surface TSC. However, the\natomic visualization of its nontrivial surface states and MZM remains elusive.\nHere, we report the direct observation of unconventional surface states and\nvortex zero mode at the gold (Au) terminated surfaces of AuSn$_{4}$, by\nultra-low scanning tunneling microscope/spectroscopy. Distinct from the trivial\nmetallic bulk states at tin (Sn) surfaces, the Au terminated surface exhibits\npronounced surface states near Fermi level. Our density functional theory\ncalculations indicate that these states arise from unconventional Rashba bands,\nwhere two Fermi circles from different bands share identical helical spin\ntextures, chiralities, and group velocities in the same direction. Furthermore,\nwe find that although the superconducting gap, critical temperature,\nanisotropic in-plane critical field are almost identical on Au and Sn\nterminated surfaces, the in-gap bound states inside Abrikosov vortex cores show\nsignificant differences. The vortex on Sn terminated surfaces exhibits a\nconventional Caroli-de Gennes-Matricon bound state while the Au surface shows a\nsharp zero-energy core state with a long non-splitting distance, resembling an\nMZM in a non-quantum-limit condition. This distinction may result from the\ndominant contribution of unconventional Rashba bands near Fermi energy from Au\nterminated surface. Our results provide a new platform for studying\nunconventional Rashba band and MZM in superconductors.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}