{"id":"2407.07429","title":"Time evolutions of information entropies in a one-dimensional\n  Vlasov-Poisson system","authors":"K. Maekaku, H. Sugama, and T.-H. Watanabe","authorsParsed":[["Maekaku","K.",""],["Sugama","H.",""],["Watanabe","T. -H.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 07:33:02 GMT"}],"updateDate":"2024-07-11","timestamp":1720596782000,"abstract":"  A one-dimensional Vlasov-Poisson system is considered to elucidate how the\ninformation entropies of the probability distribution functions of the electron\nposition and velocity variables evolve in the Landau damping process.\nConsidering the initial condition given by the Maxwellian velocity distribution\nwith the spatial density perturbation in the form of the cosine function of the\nposition, we derive linear and quasilinear analytical solutions that accurately\ndescribe both early and late time behaviors of the distribution function and\nthe electric field. The validity of these solutions is confirmed by comparison\nwith numerical simulations based on contour dynamics. Using the quasilinear\nanalytical solution, the time evolutions of the velocity distribution function\nand its kurtosis indicating deviation from the Gaussian distribution are\nevaluated with the accuracy of the squared perturbation amplitude. We also\ndetermine the time evolutions of the information entropies of the electron\nposition and velocity variables and their mutual information. We further\nconsider Coulomb collisions which relax the state in the late-time limit in the\ncollision less process to the thermal equilibrium state. In this collisional\nrelaxation process, the mutual information of the position and velocity\nvariables decreases to zero while the total information entropy of the\nphase-space distribution function increases by the decrease in the mutual\ninformation and demonstrates the validity of Boltzmann's H-theorem.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MTHcBfY8hfkQMGt4JVvcIv0zpTz_X4XFXejg9N_kkSI","pdfSize":"1382322","objectId":"0xcd2619f7fef5e29c2f62af0bec4c5c4c07ab34f51cce4ceea4d2019c976b126f","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
