{"id":"2407.07423","title":"Estimation of the lateral mis-registrations of the GRAVITY + adaptive\n  optics system","authors":"Anthony Berdeu (LESIA), H. Bonnet (ESO), J.-B. Le Bouquin (IPAG), C.\n  \\'Edouard (LESIA), T. Gomes (CENTRA), P. Shchekaturov (ESO), R. Dembet\n  (LESIA), T. Paumard (LESIA), S. Oberti (ESO), J. Kolb (ESO), F. Millour\n  (OCA), P. Berio (OCA), O. Lai (UniCA, CNRS), F. Eisenhauer (MPE), P. Garcia\n  (CENTRA), C. Straubmeier, L. Kreidberg (MPIA), S. H\\\"onig, D. Defr\\`ere","authorsParsed":[["Berdeu","Anthony","","LESIA"],["Bonnet","H.","","ESO"],["Bouquin","J. -B. Le","","IPAG"],["Édouard","C.","","LESIA"],["Gomes","T.","","CENTRA"],["Shchekaturov","P.","","ESO"],["Dembet","R.","","LESIA"],["Paumard","T.","","LESIA"],["Oberti","S.","","ESO"],["Kolb","J.","","ESO"],["Millour","F.","","OCA"],["Berio","P.","","OCA"],["Lai","O.","","UniCA, CNRS"],["Eisenhauer","F.","","MPE"],["Garcia","P.","","CENTRA"],["Straubmeier","C.","","MPIA"],["Kreidberg","L.","","MPIA"],["Hönig","S.",""],["Defrère","D.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 07:26:13 GMT"}],"updateDate":"2024-07-11","timestamp":1720596373000,"abstract":"  Context. The GRAVITY+ upgrade implies a complete renewal of its adaptive\noptics (AO) systems. Its complex design, featuring moving components between\nthe deformable mirrors and the wavefront sensors, requires the monitoring and\nauto-calibrating of the lateral mis-registrations of the system while in\noperation. Aims. For preset and target acquisition, large lateral registration\nerrors must be assessed in open loop to bring the system to a state where the\nAO loop closes. In closed loop, these errors must be monitored and corrected,\nwithout impacting the science. Methods. With respect to the first requirement,\nour method is perturbative, with two-dimensional modes intentionally applied to\nthe system and correlated to a reference interaction matrix. For the second\nrequirement, we applied a non-perturbative approach that searches for specific\npatterns in temporal correlations in the closed loop telemetry. This signal is\nproduced by the noise propagation through the AO loop. Results. Our methods\nwere validated through simulations and on the GRAVITY+ development bench. The\nfirst method robustly estimates the lateral mis-registrations, in a single fit\nand with a sub-subaperture resolution while in an open loop. The second method\nis not absolute, but it does successfully bring the system towards a negligible\nmis-registration error, with a limited turbulence bias. Both methods proved to\nrobustly work on a system still under development and not fully characterised.\nConclusions. Tested with Shack-Hartmann wavefront sensors, the proposed methods\nare versatile and easily adaptable to other AO instruments, such as the\npyramid, which stands as a baseline for all future AO systems. The\nnon-perturbative method, not relying on an interaction matrix model and being\nsparse in the Fourier domain, is particularly suitable to the next generation\nof AO systems for extremely large telescopes that will present an unprecedented\nlevel of complexity and numbers of actuators.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}