{"id":"2407.13537","title":"GlobalPointer: Large-Scale Plane Adjustment with Bi-Convex Relaxation","authors":"Bangyan Liao and Zhenjun Zhao and Lu Chen and Haoang Li and Daniel\n  Cremers and Peidong Liu","authorsParsed":[["Liao","Bangyan",""],["Zhao","Zhenjun",""],["Chen","Lu",""],["Li","Haoang",""],["Cremers","Daniel",""],["Liu","Peidong",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 14:09:03 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 04:40:31 GMT"}],"updateDate":"2024-07-22","timestamp":1721311743000,"abstract":"  Plane adjustment (PA) is crucial for many 3D applications, involving\nsimultaneous pose estimation and plane recovery. Despite recent advancements,\nit remains a challenging problem in the realm of multi-view point cloud\nregistration. Current state-of-the-art methods can achieve globally optimal\nconvergence only with good initialization. Furthermore, their high time\ncomplexity renders them impractical for large-scale problems. To address these\nchallenges, we first exploit a novel optimization strategy termed\n\\textit{Bi-Convex Relaxation}, which decouples the original problem into two\nsimpler sub-problems, reformulates each sub-problem using a convex relaxation\ntechnique, and alternately solves each one until the original problem\nconverges. Building on this strategy, we propose two algorithmic variants for\nsolving the plane adjustment problem, namely \\textit{GlobalPointer} and\n\\textit{GlobalPointer++}, based on point-to-plane and plane-to-plane errors,\nrespectively. Extensive experiments on both synthetic and real datasets\ndemonstrate that our method can perform large-scale plane adjustment with\nlinear time complexity, larger convergence region, and robustness to poor\ninitialization, while achieving similar accuracy as prior methods. The code is\navailable at https://github.com/wu-cvgl/GlobalPointer.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wQKOqLhgs_muCXZucDYavup1mB-h2FrDLu1JAbp3b3w","pdfSize":"2601648"}
