{"id":"2407.15344","title":"Error propagation of direct pressure gradient integration and a\n  Helmholtz-Hodge decomposition based pressure field reconstruction method for\n  image velocimetry","authors":"Lanyu Li, Jeffrey McClure, Grady B. Wright, Jared P. Whitehead, Jin\n  Wang, and Zhao Pan","authorsParsed":[["Li","Lanyu",""],["McClure","Jeffrey",""],["Wright","Grady B.",""],["Whitehead","Jared P.",""],["Wang","Jin",""],["Pan","Zhao",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 02:57:54 GMT"}],"updateDate":"2024-07-23","timestamp":1721617074000,"abstract":"  Recovering pressure fields from image velocimetry measurements has two\ngeneral strategies: i) directly integrating the pressure gradients from the\nmomentum equation and ii) solving or enforcing the pressure Poisson equation\n(divergence of the pressure gradients). In this work, we analyze the error\npropagation of the former strategy and provide some practical insights. For\nexample, we establish the error scaling laws for the Pressure Gradient\nIntegration (PGI) and the Pressure Poisson Equation (PPE). We explain why\napplying the Helmholtz-Hodge Decomposition (HHD) could significantly reduce the\nerror propagation for the PGI. We also propose to use a novel HHD-based\npressure field reconstruction strategy that offers the following advantages: i)\neffective processing of noisy scattered or structured image velocimetry data on\na complex domain and ii) using Radial Basis Functions (RBFs) with\ncurl/divergence-free kernels to provide divergence-free correction to the\nvelocity fields for incompressible flows and curl-free correction for pressure\ngradients. Complete elimination of divergence-free bias in measured pressure\ngradient and curl-free bias in the measured velocity field results in superior\naccuracy. Synthetic velocimetry data based on exact solutions and high-fidelity\nsimulations are used to validate the analysis as well as demonstrate the\nflexibility and effectiveness of the RBF-HHD solver.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}