{"id":"2407.18349","title":"Stirring the cosmic pot: how black hole feedback shapes the matter power\n  spectrum in the Fable simulations","authors":"Sergio Martin-Alvarez, Vid Ir\\v{s}i\\v{c}, Sophie Koudmani, Martin\n  Bourne, Leah Bigwood and Debora Sijacki","authorsParsed":[["Martin-Alvarez","Sergio",""],["Iršič","Vid",""],["Koudmani","Sophie",""],["Bourne","Martin",""],["Bigwood","Leah",""],["Sijacki","Debora",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 19:31:17 GMT"}],"updateDate":"2024-07-29","timestamp":1721935877000,"abstract":"  Understanding the impact of baryonic physics on cosmic structure formation is\ncrucial for accurate cosmological predictions, especially as we usher in the\nera of large galaxy surveys with the Rubin Observatory as well as the Euclid\nand Roman Space Telescopes. A key process that can redistribute matter across a\nlarge range of scales is feedback from accreting supermassive black holes. How\nexactly these active galactic nuclei (AGN) operate from sub-parsec to\nMega-parsec scales however remains largely unknown. To understand this, we\ninvestigate how different AGN feedback models in the Fable simulation suite\naffect the cosmic evolution of the matter power spectrum (MPS).\n  Our analysis reveals that AGN feedback significantly suppresses clustering at\nscales $k \\sim 10\\,h\\,cMpc^{-1}$, with the strongest effect at redshift $z = 0$\ncausing a reduction of $\\sim 10\\%$ with respect to the dark matter-only\nsimulation. This is due to the efficient feedback in both radio (low Eddington\nratio) and quasar (high Eddington ratio) modes in our fiducial Fable model. We\nfind that variations of the quasar and radio mode feedback with respect to the\nfiducial Fable model have distinct effects on the MPS redshift evolution, with\nthe radio mode being more effective on larger scales and later epochs.\nFurthermore, MPS suppression is dominated by AGN feedback effects inside haloes\nat $z = 0$, while for $z \\gtrsim 1$ the matter distribution both inside and\noutside of haloes shapes the MPS suppression. Hence, future observations\nprobing earlier cosmic times beyond $z \\sim 1$ will be instrumental in\nconstraining the nature of AGN feedback.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cIfF4eaPskRI3Xk73mVinY0Ro0XGes9RdYtGLyreO98","pdfSize":"4250132","objectId":"0x0e56bc7bb3042060c6586def21db84face4dcaec5f0d14f479ee7ead6e07342a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
