{"id":"2407.06236","title":"A theorem on extensive ground state entropy, spin liquidity and some\n  related models","authors":"Sumiran Pujari","authorsParsed":[["Pujari","Sumiran",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 17:41:07 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 17:43:47 GMT"},{"version":"v3","created":"Mon, 22 Jul 2024 17:23:17 GMT"},{"version":"v4","created":"Mon, 26 Aug 2024 17:51:55 GMT"},{"version":"v5","created":"Thu, 29 Aug 2024 17:59:03 GMT"}],"updateDate":"2024-08-30","timestamp":1720374067000,"abstract":"  The physics of the paradigmatic one-dimensional transverse field quantum\nIsing model $J \\sum_{\\langle i,j \\rangle} \\sigma^x_i \\sigma^x_j + h \\sum_i\n\\sigma^z_i$ is well-known. Instead, let us imagine \"applying\" the transverse\nfield via a transverse Ising coupling of the spins to partner auxiliary spins,\ni.e. $H= J_x \\sum_{\\langle i,j \\rangle} \\sigma^x_i \\sigma^x_j + J_z \\sum_i\n\\sigma^z_i \\sigma^z_{\\text{partner of }i}$. If each spin of the chain has a\nunique auxiliary partner, then the resultant eigenspectrum is still the same as\nthat of the quantum Ising model with $\\frac{h}{J} = \\frac{J_z}{J_x}$ and the\ndegeneracy of the entire spectrum is $2^{\\text{number of auxiliary spins}}$. We\ncan interpret this as the auxiliary spins remaining paramagnetic down to zero\ntemperature and an extensive ground state entropy. This follows from the\nexistence of extensively large and mutually \\guillemotleft\nanticommuting\\guillemotright $\\;$ sets of $local$ conserved quantities for $H$.\nSuch a structure will be shown to be not unnatural in the class of\nbond-dependent Hamiltonians. In the above quantum Ising model inspired example\nof $H$, this is lost upon the loss of the unique partner condition for the full\nspin chain. Other cases where such degeneracy survives or gets lost are also\ndiscussed. Thus this is more general and forms the basis for an exact statement\non the existence of extensive ground state entropy in any dimension.\nFurthermore this structure can be used to prove spin liquidity\nnon-perturbatively in the ground state manifold. Higher-dimensional quantum\nspin liquid constructions based on this are given which may evade a\nquasiparticle description.\n","subjects":["Condensed Matter/Statistical Mechanics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}