{"id":"2407.02921","title":"In-Memory Mirroring: Cloning Without Reading","authors":"Simranjeet Singh, Ankit Bende, Chandan Kumar Jha, Vikas Rana, Rolf\n  Drechsler, Sachin Patkar, Farhad Merchant","authorsParsed":[["Singh","Simranjeet",""],["Bende","Ankit",""],["Jha","Chandan Kumar",""],["Rana","Vikas",""],["Drechsler","Rolf",""],["Patkar","Sachin",""],["Merchant","Farhad",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 08:53:54 GMT"},{"version":"v2","created":"Thu, 4 Jul 2024 11:07:39 GMT"}],"updateDate":"2024-07-08","timestamp":1719996834000,"abstract":"  In-memory computing (IMC) has gained significant attention recently as it\nattempts to reduce the impact of memory bottlenecks. Numerous schemes for\ndigital IMC are presented in the literature, focusing on logic operations.\nOften, an application's description has data dependencies that must be\nresolved. Contemporary IMC architectures perform read followed by write\noperations for this purpose, which results in performance and energy penalties.\nTo solve this fundamental problem, this paper presents in-memory mirroring\n(IMM). IMM eliminates the need for read and write-back steps, thus avoiding\nenergy and performance penalties. Instead, we perform data movement within\nmemory, involving row-wise and column-wise data transfers. Additionally, the\nIMM scheme enables parallel cloning of entire row (word) with a complexity of\n$\\mathcal{O}(1)$. Moreover, our analysis of the energy consumption of the\nproposed technique using resistive random-access memory crossbar and\nexperimentally validated JART VCM v1b model. The IMM increases energy\nefficiency and shows 2$\\times$ performance improvement compared to conventional\ndata movement methods.\n","subjects":["Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gGWABVdXHro4u7CVSqo_ibZ1eDZMPdrDVi674C2io_k","pdfSize":"2093950","objectId":"0x9457806588cdbceba575a81ad2766e762730dd15602b791d6595c7c27ac51dd5","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
