{"id":"2407.14121","title":"Seismic Fault SAM: Adapting SAM with Lightweight Modules and 2.5D\n  Strategy for Fault Detection","authors":"Ran Chen, Zeren Zhang, Jinwen Ma","authorsParsed":[["Chen","Ran",""],["Zhang","Zeren",""],["Ma","Jinwen",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 08:38:48 GMT"}],"updateDate":"2024-07-22","timestamp":1721378328000,"abstract":"  Seismic fault detection holds significant geographical and practical\napplication value, aiding experts in subsurface structure interpretation and\nresource exploration. Despite some progress made by automated methods based on\ndeep learning, research in the seismic domain faces significant challenges,\nparticularly because it is difficult to obtain high-quality, large-scale,\nopen-source, and diverse datasets, which hinders the development of general\nfoundation models. Therefore, this paper proposes Seismic Fault SAM, which, for\nthe first time, applies the general pre-training foundation model-Segment\nAnything Model (SAM)-to seismic fault interpretation. This method aligns the\nuniversal knowledge learned from a vast amount of images with the seismic\ndomain tasks through an Adapter design. Specifically, our innovative points\ninclude designing lightweight Adapter modules, freezing most of the\npre-training weights, and only updating a small number of parameters to allow\nthe model to converge quickly and effectively learn fault features; combining\n2.5D input strategy to capture 3D spatial patterns with 2D models; integrating\ngeological constraints into the model through prior-based data augmentation\ntechniques to enhance the model's generalization capability. Experimental\nresults on the largest publicly available seismic dataset, Thebe, show that our\nmethod surpasses existing 3D models on both OIS and ODS metrics, achieving\nstate-of-the-art performance and providing an effective extension scheme for\nother seismic domain downstream tasks that lack labeled data.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}