{"id":"2407.13224","title":"Vacancy-Induced Boron Nitride Monolayers as Multifunctional Materials\n  for Metal Ion Batteries and Hydrogen Storage Applications","authors":"Wadha Alfalasi, Wael Othman, Tanveer Hussain, Nacir Tit","authorsParsed":[["Alfalasi","Wadha",""],["Othman","Wael",""],["Hussain","Tanveer",""],["Tit","Nacir",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 07:19:33 GMT"}],"updateDate":"2024-07-19","timestamp":1721287173000,"abstract":"  This study comprehensively examined the structural, electronic,\nelectrochemical, and energy storage properties of boron-vacancy induced porous\nboron nitride monolayers (BN:VB) as multifunctional materials, anodes for MIBs\nand H2 storage applications. Our computational approaches, density functional\ntheory (DFT), ab initio molecular dynamics (AIMD), and thermodynamic analysis,\nrevealed exceptionally high energy and gravimetric densities for MIBs and H2\nstorage, respectively. We investigated the interactions of Li, Na, and K atoms\non BN:VB, which strongly bonded with binding energies stronger than their bulk\ncohesive energies, which ensured structural stability and the absence of metal\nclustering. Electronic properties, analyzed through spin-polarized partial\ndensity of states (PDOS), band structure, and Bader charge analysis, revealed\nsignificant charge transfers from the metal atoms to BN:VB, enhancing the\nelectronic conductivity of the latter. Theoretical specific capacities were\ncalculated as 1821.53, 786.11, and 490.51 mA h/g for Li, Na, and K,\nrespectively, which comfortably exceeded the conventional anodes, such as\ngraphite. Average open-circuit voltages (OCVs) were found as 0.15, 0.25, and\n0.32 V, for Li, Na, and K, respectively, indicating strong electrochemical\nstability. Diffusion studies showed lower barriers of 0.47, 0.08, and 0.60 eV\nfor Li, Na, and K, respectively, with increased metal loadings, suggesting\nenhanced mobilities and charge/discharge rates. On the other side, the\nmetal-functionalized BN:VB monolayers exhibited remarkably high H2 gravimetric\ncapacities, supported by Langmuir adsorption model-based statistical\nthermodynamic analysis. Average adsorption energies of H2 on 4Li-, 4Na-, and\n4K@BN:VB, were found in perfect range for practical storage applications.\n","subjects":["Condensed Matter/Materials Science","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}