{"id":"2407.00473","title":"Dynamical evolution timescales for the triple supermassive black hole\n  system in NGC 6240","authors":"P. Berczik, M. Sobolenko, M. Ishchenko","authorsParsed":[["Berczik","P.",""],["Sobolenko","M.",""],["Ishchenko","M.",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 15:36:40 GMT"}],"updateDate":"2024-07-12","timestamp":1719675400000,"abstract":"  Based on the available observational data from the literature, we analysed\nthe dynamics of the NGC 6240 galaxy central supermassive black hole (SMBH)\nsystem. For the dynamical modelling of this triple SBMH system, we used the\nmassively parallel and GPU accelerated phi-GPU direct summation N-body code.\nFollowing a long-timescale modelling of the triple system, we carried out a\nvery detailed time output analysis of the von Zeipel-Lidov-Kozai (ZLK)\noscillations for the black holes. According to our Newtonian simulation\nresults, for all models and randomisations, the bound system from S1+S2\ncomponents formed at ~3.6 Myr. The formation of the bound hierarchical triple\nsystem S+N occurred at ~18 Myr. Over the course of these Newtonian simulations\nof the evolution of the triple SMBH system and the surrounding environment in\nNGC 6240, ZLK oscillations were detected (in most cases) for the binary\ncomponents. The inclination angle between the orbital angular momentum of\nbinary components aptly coincides with the theoretical calculations of the ZLK\nmechanism. In our set of randomised 15 Newtonian $N$-body dynamical galaxy\nmodels in 13 systems, we were able to detect a ZLK mechanism. In contrast, our\nextra few-body post-Newtonian runs (for one randomisation case) show it is only\nfor the large inner binary initial eccentricity (in our case >0.9 that we are\nable to observe the possibility of the inner binary merging, due to the\npost-Newtonian energy radiation effects. For the lower eccentricity cases, the\ntest runs show no sign of possible merging or any ZLK oscillations in the\nsystem.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"n5BuCaKHEp45AgYqzVweNNuW8a0LcTArkojYD7Ki2DE","pdfSize":"3813172","objectId":"0x2f77c2bfe4c8fbd4509ac01aa9cb9cd6a3a7d366ba9ebfd912a15a436b797c81","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
