{"id":"2407.10547","title":"Learning Social Cost Functions for Human-Aware Path Planning","authors":"Andrea Eirale, Matteo Leonetti, Marcello Chiaberge","authorsParsed":[["Eirale","Andrea",""],["Leonetti","Matteo",""],["Chiaberge","Marcello",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 08:57:02 GMT"}],"updateDate":"2024-07-16","timestamp":1721033822000,"abstract":"  Achieving social acceptance is one of the main goals of Social Robotic\nNavigation. Despite this topic has received increasing interest in recent\nyears, most of the research has focused on driving the robotic agent along\nobstacle-free trajectories, planning around estimates of future human motion to\nrespect personal distances and optimize navigation. However, social\ninteractions in everyday life are also dictated by norms that do not strictly\ndepend on movement, such as when standing at the end of a queue rather than\ncutting it. In this paper, we propose a novel method to recognize common social\nscenarios and modify a traditional planner's cost function to adapt to them.\nThis solution enables the robot to carry out different social navigation\nbehaviors that would not arise otherwise, maintaining the robustness of\ntraditional navigation. Our approach allows the robot to learn different social\nnorms with a single learned model, rather than having different modules for\neach task. As a proof of concept, we consider the tasks of queuing and respect\ninteraction spaces of groups of people talking to one another, but the method\ncan be extended to other human activities that do not involve motion.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fSjdyg27Q7V6UMUypF75InJCjiNtcOPfmjcTE5g8XOY","pdfSize":"3353745","objectId":"0x36cefcddf3f1dfb8713bb31d7aea2416bc2cf73f8a3703fe833c6e3550c717cf","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
