{"id":"2407.16924","title":"Real-space topology-engineering of skyrmionic spin textures in a van der\n  Waals ferromagnet Fe3GaTe2","authors":"Shuo Mi, Jianfeng Guo, Guojing Hu, Guangcheng Wang, Songyang Li,\n  Zizhao Gong, Shuaizhao Jin, Rui Xu, Fei Pang, Wei Ji, Weiqiang Yu, Xiaolei\n  Wang, Xueyun Wang, Haitao Yang, and Zhihai Cheng","authorsParsed":[["Mi","Shuo",""],["Guo","Jianfeng",""],["Hu","Guojing",""],["Wang","Guangcheng",""],["Li","Songyang",""],["Gong","Zizhao",""],["Jin","Shuaizhao",""],["Xu","Rui",""],["Pang","Fei",""],["Ji","Wei",""],["Yu","Weiqiang",""],["Wang","Xiaolei",""],["Wang","Xueyun",""],["Yang","Haitao",""],["Cheng","Zhihai",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 01:16:07 GMT"}],"updateDate":"2024-07-25","timestamp":1721783767000,"abstract":"  Realizing magnetic skyrmions in two-dimensional (2D) van der Waals (vdW)\nferromagnets offers unparalleled prospects for future spintronic applications.\nThe room-temperature ferromagnet Fe3GaTe2 provides an ideal platform for\ntailoring these magnetic solitons. Here, skyrmions of distinct topological\ncharges are artificially introduced and spatially engineered using magnetic\nforce microscopy (MFM). The skyrmion lattice is realized by specific\nfield-cooling process, and can be further controllably erased and painted via\ndelicate manipulation of tip stray field. The skyrmion lattice with opposite\ntopological charges (S = +1 or -1) can be tailored at the target regions to\nform topological skyrmion junctions (TSJs) with specific configurations. The\ndelicate interplay of TSJs and spin-polarized device current were finally\ninvestigated via the in-situ transport measurements, alongside the topological\nstability of TSJs. Our results demonstrate that Fe3GaTe2 not only serves as a\npotential building block for room-temperature skyrmion-based spintronic\ndevices, but also presents promising prospects for Fe3GaTe2-based\nheterostructures with the engineered topological spin textures.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}