{"id":"2407.16016","title":"Post-resonance reflections break the loss-vs-phase-resolution trade-off\n  in microwave electronics","authors":"Bala Govind, Andreia Cathelin, Alyssa Apsel","authorsParsed":[["Govind","Bala",""],["Cathelin","Andreia",""],["Apsel","Alyssa",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 19:47:33 GMT"}],"updateDate":"2024-07-24","timestamp":1721677653000,"abstract":"  Precise phase control of microwaves and millimeter waves is critical for\ntoday's wireless communication and signal processing electronics. For decades,\nachieving even modest phase-shifting resolution has demanded a complex mix of\ntransistor switches and passive electromagnetic structures. These true-phase\ndelay, true-time-delay or quasi-true-time-delay circuits operate near\nresonances that heavily attenuate and distort signals, limiting transmission\nbandwidth. Despite numerous attempts, passive phase shifters have remained\nlossy and incompatible with high-channel-capacity beamforming, irrespective of\nthe semiconductor fabrication process. In this article, we introduce a\nmechanism whereby waveguide reflectors based on coupled resonances can be\nreprogrammed to evade loss. Central to their operation is that loss from\ninternal resonances is confined to low frequencies, while at high frequencies,\ntheir reflectivity is maximized and broadband phase variations, induced by\nthose resonances, still persist. Since performance in the low-loss\npost-resonance spectrum is largely agnostic to the number of switches,\nultra-fine digital tuning is possible. This breaks the historical tradeoff\nbetween loss and precision to achieve resolution surpassing state-of-the-art\nintegrated circuits by over three orders (bits) of magnitude. The device does\nnot distort the transmitted signal and consumes no power. Moreover, the chip\noccupies a sub-wavelength footprint in a Complementary Metal Oxide\nSemiconductor platform. This makes it an optimal candidate for seamless\nintegration in on-chip multi-gigabit data links, radio astronomy transceivers\nand control hardware for millimeter-wave qubits.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}