{"id":"2407.11949","title":"Minimally Entangled Typical Thermal States for Classical and Quantum\n  Simulation of Gauge Theories at Finite Temperature and Density","authors":"I-Chi Chen and Jo\\~ao C. Getelina and Kl\\'ee Pollock and Srimoyee Sen\n  and Yong-Xin Yao and Thomas Iadecola","authorsParsed":[["Chen","I-Chi",""],["Getelina","João C.",""],["Pollock","Klée",""],["Sen","Srimoyee",""],["Yao","Yong-Xin",""],["Iadecola","Thomas",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 17:44:01 GMT"}],"updateDate":"2024-07-17","timestamp":1721151841000,"abstract":"  Simulating strongly coupled gauge theories at finite temperature and density\nis a longstanding challenge in nuclear and high-energy physics that also has\nfundamental implications for condensed matter physics. In this work, we\ninvestigate the utility of minimally entangled typical thermal state (METTS)\napproaches to facilitate both classical and quantum computational studies of\nsuch systems. METTS techniques combine classical random sampling with imaginary\ntime evolution, which can be performed on either a classical or a quantum\ncomputer, to estimate thermal averages of observables. We study the simplest\nmodel of a confining gauge theory, namely $\\mathbb{Z}_2$ gauge theory coupled\nto spinless fermionic matter in 1+1 dimensions, which can be directly mapped to\na local quantum spin chain with two- and three-body interactions. We benchmark\nboth a classical matrix-product-state implementation of METTS and a recently\nproposed adaptive variational approach to METTS that is a promising candidate\nfor implementation on near-term quantum devices, focusing on the equation of\nstate as well as on various measures of fermion confinement. Of particular\nimportance is the choice of basis for obtaining new METTS samples, which\nimpacts both the classical sampling complexity (a key factor in both classical\nand quantum simulation applications) and complexity of circuits used in the\nquantum computing approach. Our work sets the stage for future studies of\nstrongly coupled gauge theories with both classical and quantum hardware.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}