{"id":"2407.16704","title":"Applying generative neural networks for fast simulations of the ALICE\n  (CERN) experiment","authors":"Maksymilian Wojnar","authorsParsed":[["Wojnar","Maksymilian",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 17:08:59 GMT"}],"updateDate":"2024-07-25","timestamp":1720631339000,"abstract":"  This thesis investigates the application of state-of-the-art advances in\ngenerative neural networks for fast simulation of the Zero Degree Calorimeter\n(ZDC) neutron detector in the ALICE experiment at CERN. Traditional simulation\nmethods using the GEANT Monte Carlo toolkit, while accurate, are\ncomputationally demanding. With increasing computational needs at CERN,\nefficient simulation techniques are essential. The thesis provides a\ncomprehensive literature review on the application of neural networks in\ncomputer vision, fast simulations using machine learning, and generative neural\nnetworks in high-energy physics. The theory of the analyzed models is also\ndiscussed, along with technical aspects and the challenges associated with a\npractical implementation. The experiments evaluate various neural network\narchitectures, including convolutional neural networks, vision transformers,\nand MLP-Mixers, as well as generative frameworks such as autoencoders,\ngenerative adversarial networks, vector quantization models, and diffusion\nmodels. Key contributions include the implementation and evaluation of these\nmodels, a significant improvement in the Wasserstein metric compared to\nexisting methods with a low generation time of 5 milliseconds per sample, and\nthe formulation of a list of recommendations for developing models for fast ZDC\nsimulation. Open-source code and detailed hyperparameter settings are provided\nfor reproducibility. Additionally, the thesis outlines future research\ndirections to further enhance simulation fidelity and efficiency.\n","subjects":["Physics/Instrumentation and Detectors","Computing Research Repository/Machine Learning","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/"}