{"id":"2407.12980","title":"A Framework for testing Federated Learning algorithms using an edge-like\n  environment","authors":"Felipe Machado Schwanck and Marcos Tomazzoli Leipnitz and Joel Lu\\'is\n  Carbonera and Juliano Araujo Wickboldt","authorsParsed":[["Schwanck","Felipe Machado",""],["Leipnitz","Marcos Tomazzoli",""],["Carbonera","Joel Luís",""],["Wickboldt","Juliano Araujo",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 19:52:53 GMT"}],"updateDate":"2024-07-19","timestamp":1721245973000,"abstract":"  Federated Learning (FL) is a machine learning paradigm in which many clients\ncooperatively train a single centralized model while keeping their data private\nand decentralized. FL is commonly used in edge computing, which involves\nplacing computer workloads (both hardware and software) as close as possible to\nthe edge, where the data is being created and where actions are occurring,\nenabling faster response times, greater data privacy, and reduced data transfer\ncosts. However, due to the heterogeneous data distributions/contents of\nclients, it is non-trivial to accurately evaluate the contributions of local\nmodels in global centralized model aggregation. This is an example of a major\nchallenge in FL, commonly known as data imbalance or class imbalance. In\ngeneral, testing and assessing FL algorithms can be a very difficult and\ncomplex task due to the distributed nature of the systems. In this work, a\nframework is proposed and implemented to assess FL algorithms in a more easy\nand scalable way. This framework is evaluated over a distributed edge-like\nenvironment managed by a container orchestration platform (i.e. Kubernetes).\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tJiD3ZN90E1bY73pLchxzL8-OVDeQGliSxdWMGb3WMY","pdfSize":"2427655"}
