{"id":"2407.17190","title":"Fusing LLMs and KGs for Formal Causal Reasoning behind Financial Risk\n  Contagion","authors":"Guanyuan Yu, Xv Wang, Qing Li, Yu Zhao","authorsParsed":[["Yu","Guanyuan",""],["Wang","Xv",""],["Li","Qing",""],["Zhao","Yu",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 11:49:15 GMT"}],"updateDate":"2024-07-25","timestamp":1721821755000,"abstract":"  Financial risks trend to spread from one entity to another, ultimately\nleading to systemic risks. The key to preventing such risks lies in\nunderstanding the causal chains behind risk contagion. Despite this, prevailing\napproaches primarily emphasize identifying risks, overlooking the underlying\ncausal analysis of risk. To address such an issue, we propose a Risk Contagion\nCausal Reasoning model called RC2R, which uses the logical reasoning\ncapabilities of large language models (LLMs) to dissect the causal mechanisms\nof risk contagion grounded in the factual and expert knowledge embedded within\nfinancial knowledge graphs (KGs). At the data level, we utilize financial KGs\nto construct causal instructions, empowering LLMs to perform formal causal\nreasoning on risk propagation and tackle the \"causal parrot\" problem of LLMs.\nIn terms of model architecture, we integrate a fusion module that aligns tokens\nand nodes across various granularities via multi-scale contrastive learning,\nfollowed by the amalgamation of textual and graph-structured data through soft\nprompt with cross multi-head attention mechanisms. To quantify risk contagion,\nwe introduce a risk pathway inference module for calculating risk scores for\neach node in the graph. Finally, we visualize the risk contagion pathways and\ntheir intensities using Sankey diagrams, providing detailed causal\nexplanations. Comprehensive experiments on financial KGs and supply chain\ndatasets demonstrate that our model outperforms several state-of-the-art models\nin prediction performance and out-of-distribution (OOD) generalization\ncapabilities. We will make our dataset and code publicly accessible to\nencourage further research and development in this field.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}