{"id":"2407.20264","title":"Beam Focusing for Near-Field Multi-User Localization","authors":"Qianyu Yang, Anna Guerra, Francesco Guidi, Nir Shlezinger, Haiyang\n  Zhang, Davide Dardari, Baoyun Wang and Yonina C. Eldar","authorsParsed":[["Yang","Qianyu",""],["Guerra","Anna",""],["Guidi","Francesco",""],["Shlezinger","Nir",""],["Zhang","Haiyang",""],["Dardari","Davide",""],["Wang","Baoyun",""],["Eldar","Yonina C.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 14:20:30 GMT"}],"updateDate":"2024-07-31","timestamp":1721830830000,"abstract":"  Extremely large-scale antenna arrays are poised to play a pivotal role in\nsixth-generation (6G) networks. Utilizing such arrays often results in a\nnear-field spherical wave transmission environment, enabling the generation of\nfocused beams, which introduces new degrees of freedom for wireless\nlocalization. In this paper, we consider a beam-focusing design for localizing\nmultiple sources in the radiating near-field. Our formulation accommodates\nvarious expected types of implementations of large antenna arrays, including\nhybrid analog/digital architectures and dynamic metasurface antennas (DMAs). We\nconsider a direct localization estimation method exploiting\ncurvature-of-arrival of impinging spherical wavefront to obtain user positions.\nIn this regard, we adopt a two-stage approach configuring the array to optimize\nnear-field positioning. In the first step, we focus only on adjusting the array\ncoefficients to minimize the estimation error. We obtain a closed-form\napproximate solution based on projection and the better one based on the\nRiemann gradient algorithm. We then extend this approach to simultaneously\nlocalize and focus the beams via a sub-optimal iterative approach that does not\nrely on such knowledge. The simulation results show that near-field\nlocalization accuracy based on a hybrid array or DMA can achieve performance\nclose to that of fully digital arrays at a lower cost, and DMAs can attain\nbetter performance than hybrid solutions with the same aperture.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"e-iOEvKwI3FYfWI0ZFIO_8JpawAJWX6zOC7jVgYBkPU","pdfSize":"3534638","objectId":"0xabd56d820dd2164e57ff6f1a69cbcdb4bc31be3348ed3dd533082d8a034de149","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
