{"id":"2407.12224","title":"A structural analysis of ordered Cs$_{3}$Sb films grown on single\n  crystal graphene and silicon carbide substrates","authors":"C. Pennington, M. Gaowei, E. M. Echeverria, K. Evans-Lutterodt, A.\n  Galdi, T. Juffmann, S. Karkare, J. Maxson, S.J. van der Molen, P. Saha, J.\n  Smedley, W.G. Stam, R.M. Tromp","authorsParsed":[["Pennington","C.",""],["Gaowei","M.",""],["Echeverria","E. M.",""],["Evans-Lutterodt","K.",""],["Galdi","A.",""],["Juffmann","T.",""],["Karkare","S.",""],["Maxson","J.",""],["van der Molen","S. J.",""],["Saha","P.",""],["Smedley","J.",""],["Stam","W. G.",""],["Tromp","R. M.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 00:28:51 GMT"}],"updateDate":"2024-07-18","timestamp":1721176131000,"abstract":"  Alkali antimonides are well established as high efficiency, low intrinsic\nemittance photocathodes for accelerators and photon detectors. However,\nconventionally grown alkali antimonide films are polycrystalline with surface\ndisorder and roughness that can limit achievable beam brightness. Ordering the\ncrystalline structure of alkali antimonides has the potential to deliver higher\nbrightness electron beams by reducing surface disorder and enabling the\nengineering of material properties at the level of atomic layers. In this\nreport, we demonstrate the growth of ordered Cs$_{3}$Sb films on single crystal\nsubstrates 3C-SiC and graphene-coated 4H-SiC using pulsed laser deposition and\nconventional thermal evaporation growth techniques. The crystalline structures\nof the Cs$_{3}$Sb films were examined using reflection high energy electron\ndiffraction (RHEED) and X-ray diffraction (XRD) diagnostics, while film\nthickness and roughness estimates were made using x-ray reflectivity (XRR).\nWith these tools, we observed ordered domains in less than 10 nm thick films\nwith quantum efficiencies greater than one percent at 530 nm. Moreover, we\nidentify structural features such as Laue oscillations indicative of highly\nordered films. We found that Cs$_{3}$Sb films grew with flat, fiber-textured\nsurfaces on 3C-SiC and with multiple ordered domains and sub-nanometer surface\nroughness on graphene-coated 4H-SiC under our growth conditions. We identify\nthe crystallographic orientations of Cs$_{3}$Sb grown on graphene-coated 4H-SiC\nsubstrates and discuss the significance of examining the crystal structure of\nthese films for growing epitaxial heterostructures in future experiments.\n","subjects":["Condensed Matter/Materials Science","Physics/Accelerator Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}