{"id":"2407.04408","title":"Hybrid Receiver Design for Massive MIMO-OFDM with Low-Resolution ADCs\n  and Oversampling","authors":"Mengyuan Ma, Nhan Thanh Nguyen, Italo Atzeni, and Markku Juntti","authorsParsed":[["Ma","Mengyuan",""],["Nguyen","Nhan Thanh",""],["Atzeni","Italo",""],["Juntti","Markku",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 10:45:44 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 16:04:14 GMT"}],"updateDate":"2024-08-12","timestamp":1720176344000,"abstract":"  Low-resolution analog-to-digital converters (ADCs) and hybrid beamforming\nhave emerged as efficient solutions to reduce power consumption with\nsatisfactory spectral efficiency (SE) in massive multiple-input multiple-output\n(MIMO) systems. In this paper, we investigate the performance of a hybrid\nreceiver in uplink massive MIMO orthogonal frequency-division multiplexing\n(OFDM) systems with low-resolution ADCs and oversampling. Considering both the\ntemporal and spatial correlation of the quantization distortion (QD), we derive\na closed-form approximation of the frequency-domain QD covariance matrix, which\nfacilitates the evaluation of the system SE. Then we jointly design the analog\nand baseband combiners to maximize the SE. The formulated problem is\nsignificantly challenging due to the constant-modulus constraint of the analog\ncombiner and its coupling with the digital one. To overcome the challenges, we\ntransform the objective function into an equivalent but more tractable form and\nthen iteratively update the analog and digital combiner. Numerical simulations\nverify the superiority of the proposed algorithm compared to the considered\nbenchmarks and show the resilience of the hybrid receiver to beam squint for\nlow-resolution systems. Furthermore, the results show that the proposed hybrid\nreceiver design with oversampling can achieve significantly higher energy\nefficiency compared to the digital one.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}