{"id":"2407.06846","title":"SilverCycling: Exploring the Impact of Bike-Based Locomotion on Spatial\n  Orientation for Older Adults in VR","authors":"Qiongyan Chen, Zhiqing Wu, Yucheng Liu, Lei Han, Zisu Li, Ge Lin Kan,\n  Mingming Fan","authorsParsed":[["Chen","Qiongyan",""],["Wu","Zhiqing",""],["Liu","Yucheng",""],["Han","Lei",""],["Li","Zisu",""],["Kan","Ge Lin",""],["Fan","Mingming",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 13:27:29 GMT"}],"updateDate":"2024-07-10","timestamp":1720531649000,"abstract":"  Spatial orientation is essential for people to effectively navigate and\ninteract with the environment in everyday life. With age-related cognitive\ndecline, providing VR locomotion techniques with better spatial orientation\nperformance for older adults becomes important. Such advancements not only make\nVR more accessible to older adults but also enable them to reap the potential\nhealth benefits of VR technology. Natural motion-based locomotion has been\nshown to be effective in enhancing younger users' performance in VR navigation\ntasks that require spatial orientation. However, there is a lack of\nunderstanding regarding the impact of natural motion-based locomotion on\nspatial orientation for older adults in VR. To address this gap, we selected\nthe SilverCycling system, a VR bike-based locomotion technique that we\ndeveloped, as a representative of natural motion-based locomotion, guided by\nfindings from our pilot study. We conducted a user study with 16 older adults\nto compare SilverCycling with the joystick-based controller. The findings\nsuggest SilverCycling's potential to significantly enhance spatial orientation\nin the open-road urban environment for older adults, offering a better user\nexperience. Based on our findings, we identify key factors influencing spatial\norientation and propose design recommendations to make VR locomotion more\naccessible and user-friendly for older adults.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}