{"id":"2407.06432","title":"An Empirical Study of Gendered Stereotypes in Emotional Attributes for\n  Bangla in Multilingual Large Language Models","authors":"Jayanta Sadhu, Maneesha Rani Saha, Rifat Shahriyar","authorsParsed":[["Sadhu","Jayanta",""],["Saha","Maneesha Rani",""],["Shahriyar","Rifat",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 22:22:15 GMT"}],"updateDate":"2024-07-10","timestamp":1720477335000,"abstract":"  The influence of Large Language Models (LLMs) is rapidly growing, automating\nmore jobs over time. Assessing the fairness of LLMs is crucial due to their\nexpanding impact. Studies reveal the reflection of societal norms and biases in\nLLMs, which creates a risk of propagating societal stereotypes in downstream\ntasks. Many studies on bias in LLMs focus on gender bias in various NLP\napplications. However, there's a gap in research on bias in emotional\nattributes, despite the close societal link between emotion and gender. This\ngap is even larger for low-resource languages like Bangla. Historically, women\nare associated with emotions like empathy, fear, and guilt, while men are\nlinked to anger, bravado, and authority. This pattern reflects societal norms\nin Bangla-speaking regions. We offer the first thorough investigation of\ngendered emotion attribution in Bangla for both closed and open source LLMs in\nthis work. Our aim is to elucidate the intricate societal relationship between\ngender and emotion specifically within the context of Bangla. We have been\nsuccessful in showing the existence of gender bias in the context of emotions\nin Bangla through analytical methods and also show how emotion attribution\nchanges on the basis of gendered role selection in LLMs. All of our resources\nincluding code and data are made publicly available to support future research\non Bangla NLP.\n  Warning: This paper contains explicit stereotypical statements that many may\nfind offensive.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"9FySodmQ9-YW317GyAqE4MVq8PxWOiLgNrrpD2nBZVg","pdfSize":"1341904"}
