{"id":"2407.16822","title":"AI-Enhanced 7-Point Checklist for Melanoma Detection Using Clinical\n  Knowledge Graphs and Data-Driven Quantification","authors":"Yuheng Wang, Tianze Yu, Jiayue Cai, Sunil Kalia, Harvey Lui, Z. Jane\n  Wang, Tim K. Lee","authorsParsed":[["Wang","Yuheng",""],["Yu","Tianze",""],["Cai","Jiayue",""],["Kalia","Sunil",""],["Lui","Harvey",""],["Wang","Z. Jane",""],["Lee","Tim K.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 20:27:16 GMT"}],"updateDate":"2024-07-25","timestamp":1721766436000,"abstract":"  The 7-point checklist (7PCL) is widely used in dermoscopy to identify\nmalignant melanoma lesions needing urgent medical attention. It assigns point\nvalues to seven attributes: major attributes are worth two points each, and\nminor ones are worth one point each. A total score of three or higher prompts\nfurther evaluation, often including a biopsy. However, a significant limitation\nof current methods is the uniform weighting of attributes, which leads to\nimprecision and neglects their interconnections. Previous deep learning studies\nhave treated the prediction of each attribute with the same importance as\npredicting melanoma, which fails to recognize the clinical significance of the\nattributes for melanoma. To address these limitations, we introduce a novel\ndiagnostic method that integrates two innovative elements: a Clinical\nKnowledge-Based Topological Graph (CKTG) and a Gradient Diagnostic Strategy\nwith Data-Driven Weighting Standards (GD-DDW). The CKTG integrates 7PCL\nattributes with diagnostic information, revealing both internal and external\nassociations. By employing adaptive receptive domains and weighted edges, we\nestablish connections among melanoma's relevant features. Concurrently, GD-DDW\nemulates dermatologists' diagnostic processes, who first observe the visual\ncharacteristics associated with melanoma and then make predictions. Our model\nuses two imaging modalities for the same lesion, ensuring comprehensive feature\nacquisition. Our method shows outstanding performance in predicting malignant\nmelanoma and its features, achieving an average AUC value of 85%. This was\nvalidated on the EDRA dataset, the largest publicly available dataset for the\n7-point checklist algorithm. Specifically, the integrated weighting system can\nprovide clinicians with valuable data-driven benchmarks for their evaluations.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}