{"id":"2407.02190","title":"I2EKF-LO: A Dual-Iteration Extended Kalman Filter Based LiDAR Odometry","authors":"Wenlu Yu, Jie Xu, Chengwei Zhao, Lijun Zhao, Thien-Minh Nguyen,\n  Shenghai Yuan, Mingming Bai, Lihua Xie","authorsParsed":[["Yu","Wenlu",""],["Xu","Jie",""],["Zhao","Chengwei",""],["Zhao","Lijun",""],["Nguyen","Thien-Minh",""],["Yuan","Shenghai",""],["Bai","Mingming",""],["Xie","Lihua",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 11:48:08 GMT"}],"updateDate":"2024-07-03","timestamp":1719920888000,"abstract":"  LiDAR odometry is a pivotal technology in the fields of autonomous driving\nand autonomous mobile robotics. However, most of the current works focus on\nnonlinear optimization methods, and still existing many challenges in using the\ntraditional Iterative Extended Kalman Filter (IEKF) framework to tackle the\nproblem: IEKF only iterates over the observation equation, relying on a rough\nestimate of the initial state, which is insufficient to fully eliminate motion\ndistortion in the input point cloud; the system process noise is difficult to\nbe determined during state estimation of the complex motions; and the varying\nmotion models across different sensor carriers. To address these issues, we\npropose the Dual-Iteration Extended Kalman Filter (I2EKF) and the LiDAR\nodometry based on I2EKF (I2EKF-LO). This approach not only iterates over the\nobservation equation but also leverages state updates to iteratively mitigate\nmotion distortion in LiDAR point clouds. Moreover, it dynamically adjusts\nprocess noise based on the confidence level of prior predictions during state\nestimation and establishes motion models for different sensor carriers to\nachieve accurate and efficient state estimation. Comprehensive experiments\ndemonstrate that I2EKF-LO achieves outstanding levels of accuracy and\ncomputational efficiency in the realm of LiDAR odometry. Additionally, to\nfoster community development, our code is\nopen-sourced.https://github.com/YWL0720/I2EKF-LO.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}