{"id":"2407.14202","title":"SHS: Scorpion Hunting Strategy Swarm Algorithm","authors":"Abhilash Singh, Seyed Muhammad Hossein Mousavi, and Kumar Gaurav","authorsParsed":[["Singh","Abhilash",""],["Mousavi","Seyed Muhammad Hossein",""],["Gaurav","Kumar",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 10:58:42 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 06:15:59 GMT"}],"updateDate":"2024-09-04","timestamp":1721386722000,"abstract":"  We introduced the Scorpion Hunting Strategy (SHS), a novel population-based,\nnature-inspired optimisation algorithm. This algorithm draws inspiration from\nthe hunting strategy of scorpions, which identify, locate, and capture their\nprey using the alpha and beta vibration operators. These operators control the\nSHS algorithm's exploitation and exploration abilities. To formulate an\noptimisation method, we mathematically simulate these dynamic events and\nbehaviors. We evaluate the effectiveness of the SHS algorithm by employing 20\nbenchmark functions (including 10 conventional and 10 CEC2020 functions), using\nboth qualitative and quantitative analyses. Through a comparative analysis with\n12 state-of-the-art meta-heuristic algorithms, we demonstrate that the proposed\nSHS algorithm yields exceptionally promising results. These findings are\nfurther supported by statistically significant results obtained through the\nWilcoxon rank sum test. Additionally, the ranking of SHS, as determined by the\naverage rank derived from the Friedman test, positions it at the forefront when\ncompared to other algorithms. Going beyond theoretical validation, we showcase\nthe practical utility of the SHS algorithm by applying it to six distinct\nreal-world optimisation tasks. These applications illustrate the algorithm's\npotential in addressing complex optimisation challenges. In summary, this work\nnot only introduces the innovative SHS algorithm but also substantiates its\neffectiveness and versatility through rigorous benchmarking and real-world\nproblem-solving scenarios.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"LXL5BvBW48R_a4yMjmnXXl-SeDuVpBq-6KKv4mlr3s0","pdfSize":"98824590"}
