{"id":"2407.17378","title":"PrevPredMap: Exploring Temporal Modeling with Previous Predictions for\n  Online Vectorized HD Map Construction","authors":"Nan Peng, Xun Zhou, Mingming Wang, Xiaojun Yang, Songming Chen,\n  Guisong Chen","authorsParsed":[["Peng","Nan",""],["Zhou","Xun",""],["Wang","Mingming",""],["Yang","Xiaojun",""],["Chen","Songming",""],["Chen","Guisong",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 15:58:24 GMT"}],"updateDate":"2024-07-25","timestamp":1721836704000,"abstract":"  Temporal information is crucial for detecting occluded instances. Existing\ntemporal representations have progressed from BEV or PV features to more\ncompact query features. Compared to these aforementioned features, predictions\noffer the highest level of abstraction, providing explicit information. In the\ncontext of online vectorized HD map construction, this unique characteristic of\npredictions is potentially advantageous for long-term temporal modeling and the\nintegration of map priors. This paper introduces PrevPredMap, a pioneering\ntemporal modeling framework that leverages previous predictions for\nconstructing online vectorized HD maps. We have meticulously crafted two\nessential modules for PrevPredMap: the previous-predictions-based query\ngenerator and the dynamic-position-query decoder. Specifically, the\nprevious-predictions-based query generator is designed to separately encode\ndifferent types of information from previous predictions, which are then\neffectively utilized by the dynamic-position-query decoder to generate current\npredictions. Furthermore, we have developed a dual-mode strategy to ensure\nPrevPredMap's robust performance across both single-frame and temporal modes.\nExtensive experiments demonstrate that PrevPredMap achieves state-of-the-art\nperformance on the nuScenes and Argoverse2 datasets. Code will be available at\nhttps://github.com/pnnnnnnn/PrevPredMap.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}