{"id":"2407.07355","title":"High-Precision, Fair University Course Scheduling During a Pandemic","authors":"Matthew E. H. Petering, Mohammad Khamechian","authorsParsed":[["Petering","Matthew E. H.",""],["Khamechian","Mohammad",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 04:26:01 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 17:56:00 GMT"}],"updateDate":"2024-07-12","timestamp":1720585561000,"abstract":"  Scheduling university courses is extra challenging when classroom capacities\nare reduced because of social distancing requirements that are implemented in\nresponse to a pandemic such as COVID-19. In this work, we propose an expanded\ntaxonomy of course delivery modes, present an integer program, and develop a\ncourse scheduling algorithm to enable all course sections -- even the largest\n-- to have a significant classroom learning component during a pandemic. Our\napproach is fair by ensuring that a certain fraction of the instruction in\nevery course section occurs in the classroom. Unlike previous studies, we do\nnot allow rotating attendance and instead require simultaneous attendance in\nwhich all students in a section meet in 1-5 rooms at the same time but less\noften than in a normal semester. These mass meetings, which create\nopportunities for in-person midterm exams and group activities, are scheduled\nat high precision across all days of the semester rather than a single,\nrepeating week. A fast heuristic algorithm makes the schedule in an hour.\nResults: We consider the 1834 in-person course sections, 172 classrooms, and 96\ndays in the fall 2022 semester at [UniversityXYZ]. If average classroom\ncapacity is reduced by 75% due to a pandemic, our approach still allows at\nleast 25% of the instruction in every section, and more than 49% of all\ninstruction across the entire campus, to be in the classroom. Our method also\nproduces excellent results for regular classroom assignment. Managerial\nimplications: An algorithm based on the principles of fairness and simultaneous\nattendance can significantly improve university course schedules during a\npandemic and in normal times. High-precision schedules that prepare a campus\nfor various pandemic possibilities can be created with minimal administrative\neffort and activated at a moment's notice before or during a semester if an\noutbreak occurs.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}