{"id":"2407.21371","title":"Einstein Probe discovery of a super-soft outburst from CXOU\n  J005245.0-722844: a rare BeWD binary in the Small Magellanic Cloud","authors":"A. Marino, H. Yang, F. Coti Zelati, N. Rea, S. Guillot, G. K.\n  Jaisawal, C. Maitra, F. Haberl, E. Kuulkers, W. Yuan, H. Feng, L. Tao, C.\n  Jin, H. Sun, W. Zhang, W. Chen, E. P. J. van den Heuvel, R. Soria, B. Zhang,\n  S.-S. Weng, L. Ji, G. B. Zhang, X. Pan, Z. Lv, C. Zhang, Z. Ling, Y. Chen, S.\n  Jia, Y. Liu, J.-U. Ness, H. Q. Cheng, D. Y. Li, K. C. Gendreau, M. Ng, T. E.\n  Strohmayer","authorsParsed":[["Marino","A.",""],["Yang","H.",""],["Zelati","F. Coti",""],["Rea","N.",""],["Guillot","S.",""],["Jaisawal","G. K.",""],["Maitra","C.",""],["Haberl","F.",""],["Kuulkers","E.",""],["Yuan","W.",""],["Feng","H.",""],["Tao","L.",""],["Jin","C.",""],["Sun","H.",""],["Zhang","W.",""],["Chen","W.",""],["Heuvel","E. P. J. van den",""],["Soria","R.",""],["Zhang","B.",""],["Weng","S. -S.",""],["Ji","L.",""],["Zhang","G. B.",""],["Pan","X.",""],["Lv","Z.",""],["Zhang","C.",""],["Ling","Z.",""],["Chen","Y.",""],["Jia","S.",""],["Liu","Y.",""],["Ness","J. -U.",""],["Cheng","H. Q.",""],["Li","D. Y.",""],["Gendreau","K. C.",""],["Ng","M.",""],["Strohmayer","T. E.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 06:45:22 GMT"}],"updateDate":"2024-08-01","timestamp":1722408322000,"abstract":"  On May 27 2024, the Wide-field X-ray Telescope onboard the Einstein Probe\n(EP) mission detected enhanced X-ray emission from a new transient source in\nthe Small Magellanic Cloud (SMC) during its commissioning phase. Prompt\nfollow-up with the EP Follow-up X-ray Telescope, the Swift X-ray Telescope and\nNicer have revealed a very soft, thermally emitting source (kT$\\sim$0.1 keV at\nthe outburst peak) with an X-ray luminosity of L$\\sim$4$\\times$10$^{38}$ erg\ns$^{-1}$, coincident with CXOU J005245.0-722844. This super-soft outburst faded\nvery quickly in a week time. Several emission lines and absorption edges were\npresent in the X-ray spectrum, such as the Oxygen (0.57 keV) and Neon (0.92\nkeV) He-like emission lines, and deep Nitrogen (0.67 keV) and Oxygen (0.87 keV)\nabsorption edges. The X-ray emission resembles typical nova outbursts from an\naccreting white dwarf (WD) in a binary system, despite the X-ray source being\nhistorically associated with an O9-B0e massive star exhibiting a 17.55 days\nperiodicity in the optical band. The discovery of this super-soft outburst\nnails down CXOU J005245.0-722844 as a BeWD X-ray binary: an elusive\nevolutionary stage where two main-sequence massive stars have undergone a\ncommon envelope phase and experienced at least two episodes of mass transfer.\nIn addition, the very short duration of the outburst and the presence of Ne\nfeatures hint at a rather massive, i.e., close to the Chandrasekhar limit, Ne-O\nWD in the system.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6NrZeDKyKlzodOh6Zf0GCoSBWo5x79z_jMy01dQNMVM","pdfSize":"2382091","objectId":"0x006bdfa46ddbf045142481573f97b2ca33cdf06ba844de6460cfa125e6c91fa6","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
