{"id":"2407.20085","title":"Local Level Dynamic Random Partition Models for Changepoint Detection","authors":"Alice Giampino, Michele Guindani, Bernardo Nipoti, Marina Vannucci","authorsParsed":[["Giampino","Alice",""],["Guindani","Michele",""],["Nipoti","Bernardo",""],["Vannucci","Marina",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:13:03 GMT"}],"updateDate":"2024-07-30","timestamp":1722265983000,"abstract":"  Motivated by an increasing demand for models that can effectively describe\nfeatures of complex multivariate time series, e.g. from sensor data in\nbiomechanics, motion analysis, and sports science, we introduce a novel\nstate-space modeling framework where the state equation encodes the evolution\nof latent partitions of the data over time. Building on the principles of\ndynamic linear models, our approach develops a random partition model capable\nof linking data partitions to previous ones over time, using a straightforward\nMarkov structure that accounts for temporal persistence and facilitates\nchangepoint detection. The selection of changepoints involves multiple\ndependent decisions, and we address this time-dependence by adopting a\nnon-marginal false discovery rate control. This leads to a simple decision rule\nthat ensures more stringent control of the false discovery rate compared to\napproaches that do not consider dependence. The method is efficiently\nimplemented using a Gibbs sampling algorithm, leading to a straightforward\napproach compared to existing methods for dependent random partition models.\nAdditionally, we show how the proposed method can be adapted to handle\nmulti-view clustering scenarios. Simulation studies and the analysis of a human\ngesture phase dataset collected through various sensing technologies show the\neffectiveness of the method in clustering multivariate time series and\ndetecting changepoints.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}