{"id":"2407.01006","title":"Multi-Functional Beamforming Design for Integrated Sensing,\n  Communication, and Computation","authors":"Yapeng Zhao, Qingqing Wu, Wen Chen, Yong Zeng, Ruiqi Liu, Weidong Mei,\n  Fen Hou, and Shaodan Ma","authorsParsed":[["Zhao","Yapeng",""],["Wu","Qingqing",""],["Chen","Wen",""],["Zeng","Yong",""],["Liu","Ruiqi",""],["Mei","Weidong",""],["Hou","Fen",""],["Ma","Shaodan",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 06:36:46 GMT"}],"updateDate":"2024-07-02","timestamp":1719815806000,"abstract":"  Integrated sensing and communication (ISAC) systems may face a heavy\ncomputation burden since the sensory data needs to be further processed. This\npaper studies a novel system that integrates sensing, communication, and\ncomputation, aiming to provide services for different objectives efficiently.\nThis system consists of a multi-antenna multi-functional base station (BS), an\nedge server, a target, and multiple singleantenna communication users. The BS\nneeds to allocate the available resources to efficiently provide sensing,\ncommunication, and computation services. Due to the heavy service burden and\nlimited power budget, the BS can partially offload the tasks to the nearby edge\nserver instead of computing them locally. We consider the estimation of the\ntarget response matrix, a general problem in radar sensing, and utilize\nCramer-Rao bound (CRB) as the corresponding performance metric. To tackle the\nnon-convex optimization problem, we propose both semidefinite relaxation\n(SDR)-based alternating optimization and SDR-based successive convex\napproximation (SCA) algorithms to minimize the CRB of radar sensing while\nmeeting the requirement of communication users and the need for task computing.\nFurthermore, we demonstrate that the optimal rankone solutions of both the\nalternating and SCA algorithms can be directly obtained via the solver or\nfurther constructed even when dealing with multiple functionalities. Simulation\nresults show that the proposed algorithms can provide higher target estimation\nperformance than state-of-the-art benchmarks while satisfying the communication\nand computation constraints.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}