{"id":"2407.02168","title":"A Stochastic Switched Optimal Control Approach to Formation Mission\n  Design for Commercial Aircraft","authors":"Mar\\'ia Cerezo-Maga\\~na, Alberto Olivares, and Ernesto Staffetti","authorsParsed":[["Cerezo-Magaña","María",""],["Olivares","Alberto",""],["Staffetti","Ernesto",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 11:19:25 GMT"}],"updateDate":"2024-07-03","timestamp":1719919165000,"abstract":"  This paper studies the formation mission design problem for commercial\naircraft in the presence of uncertainties. Specifically, it considers\nuncertainties in the departure times of the aircraft and in the fuel burn\nsavings for the trailing aircraft. Given several commercial flights, the\nproblem consists in arranging them in formation or solo flights and finding the\ntrajectories that minimize the expected value of the direct operating cost of\nthe flights. The formation mission design problem is formulated as an optimal\ncontrol problem of a stochastic switched dynamical system and solved using\nnonintrusive generalized polynomial chaos based stochastic collocation. The\nstochastic collocation method converts the stochastic switched optimal control\nproblem into an augmented deterministic switched optimal control problem. With\nthis approach, a small number of sample points of the random parameters are\nused to jointly solve particular instances of the switched optimal control\nproblem. The obtained solutions are then expressed as orthogonal polynomial\nexpansions in terms of the random parameters using these sample points. This\ntechnique allows statistical and global sensitivity analysis of the stochastic\nsolutions to be conducted at a low computational cost. The aim of this study is\nto establish if, in the presence of uncertainties, a formation mission is\nbeneficial with respect to solo flight in terms of the expected value of the\ndirect operating costs. Several numerical experiments have been conducted in\nwhich uncertainties on the departure times and on the fuel saving during\nformation flight have been considered. The obtained results demonstrate that\nbenefits can be achieved even in the presence of these uncertainties.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}