{"id":"2407.02566","title":"Large-scale ordered magnetic fields generated in mergers of helium white\n  dwarfs","authors":"R\\\"udiger Pakmor, Ingrid Pelisoli, Stephen Justham, Abinaya S.\n  Rajamuthukumar, Friedrich K. R\\\"opke, Fabian R. N. Schneider, Selma E. de\n  Mink, Sebastian T. Ohlmann, Philipp Podsiadlowski, Javier Moran Fraile, Marco\n  Vetter, Robert Andrassy","authorsParsed":[["Pakmor","Rüdiger",""],["Pelisoli","Ingrid",""],["Justham","Stephen",""],["Rajamuthukumar","Abinaya S.",""],["Röpke","Friedrich K.",""],["Schneider","Fabian R. N.",""],["de Mink","Selma E.",""],["Ohlmann","Sebastian T.",""],["Podsiadlowski","Philipp",""],["Fraile","Javier Moran",""],["Vetter","Marco",""],["Andrassy","Robert",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 18:00:02 GMT"}],"updateDate":"2024-07-04","timestamp":1719943202000,"abstract":"  Stellar mergers are one important path to highly magnetised stars. Mergers of\ntwo low-mass white dwarfs may create up to every third hot subdwarf star. The\nmerging process is usually assumed to dramatically amplify magnetic fields.\nHowever, so far only four highly magnetised hot subdwarf stars have been found,\nsuggesting a fraction of less than $1\\%$.\n  We present two high-resolution magnetohydrodynamical (MHD) simulations of the\nmerger of two helium white dwarfs in a binary system with the same total mass\nof $0.6\\,M_\\odot$. We analyse one equal-mass merger with two $0.3\\,M_\\odot$\nwhite dwarfs, and one unequal-mass merger with a $0.25\\,M_\\odot$ white dwarf\nand a $0.35\\,M_\\odot$ white dwarf. We simulate the inspiral, merger, and\nfurther evolution of the merger remnant for about $50$ rotations.\n  We find efficient magnetic field amplification in both mergers via a\nsmall-scale dynamo, reproducing previous results of stellar merger simulations.\nThe magnetic field saturates at similar strength for both simulations.\n  We then identify a second phase of magnetic field amplification in both\nmerger remnants that happens on a timescale of several tens of rotational\nperiods of the merger remnant. This phase generates a large-scale ordered\nazimuthal field. We identify it as a large-scale dynamo driven by the\nmagneto-rotational instability (MRI).\n  Finally, we suggest that in the unequal-mass merger remnant, helium burning\nwill eventually start in a shell around a cold core. The convection zone this\ngenerates will coincide with the region that contains most of the magnetic\nenergy, probably erasing the strong, ordered field. The equal-mass merger\nremnant instead will probably ignite burning in the center, retaining its\nordered field. Therefore, the mass ratio of the initial merger could be the\nselecting factor that decides if a merger remnant will stay highly magnetised\nlong after the merger.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}