{"id":"2407.00807","title":"Spontaneous Symmetry Breaking: From the Effective Action to Cosmological\n  Phase Transitions in the Standard Model and Beyond","authors":"Apostolos Giovanakis","authorsParsed":[["Giovanakis","Apostolos",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 19:26:33 GMT"}],"updateDate":"2024-07-02","timestamp":1719775593000,"abstract":"  The primary objective of this work is to investigate the cosmological phase\ntransitions in the early Universe, with a focus on the electroweak phase\ntransition in the Standard Model and its extensions. In the Standard Model, the\nspontaneously broken electroweak symmetry at zero temperature is restored in\nthe early Universe due to finite-temperature effects. This phenomenon is\nstudied using the effective potential at finite temperatures, which determines\nthe true vacuum state of the theory. Symmetry restoration at high temperatures\nis also studied by the finite-temperature field theory introduced to derive the\nFeynman rules at finite temperatures using the imaginary-time formalism.\nFurthermore, we present the theory of cosmological phase transitions, focusing\non the concepts of thermal tunneling and bubble nucleation. We additionally\ndiscuss the observed baryon asymmetry of the Universe to formulate the\nconditions for baryogenesis and describe electroweak baryogenesis. Therefore,\nthe one-loop effective potential in the Standard Model at finite temperatures\nis derived in detail including the ring corrections to study further the\nelectroweak baryogenesis. Our results indicate that the electroweak phase\ntransition is not strong enough to explain the observed baryon asymmetry of the\nUniverse. On the other hand, the real singlet extensions of the Standard Model\ndescribe a strong enough electroweak phase transition and the observed baryon\nasymmetry of the Universe. These extensions are also discussed including a\ndimension-six operator, which originates from an effective field theory. In\nparticular, the parameter space of this singlet extension is examined\nextensively, while it is restricted by numerous phenomenological constraints,\nsuch as the invisible Higgs decay width.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}