{"id":"2407.07020","title":"Less is More: Efficient Brain-Inspired Learning for Autonomous Driving\n  Trajectory Prediction","authors":"Haicheng Liao, Yongkang Li, Zhenning Li, Chengyue Wang, Chunlin Tian,\n  Yuming Huang, Zilin Bian, Kaiqun Zhu, Guofa Li, Ziyuan Pu, Jia Hu, Zhiyong\n  Cui and Chengzhong Xu","authorsParsed":[["Liao","Haicheng",""],["Li","Yongkang",""],["Li","Zhenning",""],["Wang","Chengyue",""],["Tian","Chunlin",""],["Huang","Yuming",""],["Bian","Zilin",""],["Zhu","Kaiqun",""],["Li","Guofa",""],["Pu","Ziyuan",""],["Hu","Jia",""],["Cui","Zhiyong",""],["Xu","Chengzhong",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 16:42:17 GMT"}],"updateDate":"2024-07-10","timestamp":1720543337000,"abstract":"  Accurately and safely predicting the trajectories of surrounding vehicles is\nessential for fully realizing autonomous driving (AD). This paper presents the\nHuman-Like Trajectory Prediction model (HLTP++), which emulates human cognitive\nprocesses to improve trajectory prediction in AD. HLTP++ incorporates a novel\nteacher-student knowledge distillation framework. The \"teacher\" model equipped\nwith an adaptive visual sector, mimics the dynamic allocation of attention\nhuman drivers exhibit based on factors like spatial orientation, proximity, and\ndriving speed. On the other hand, the \"student\" model focuses on real-time\ninteraction and human decision-making, drawing parallels to the human memory\nstorage mechanism. Furthermore, we improve the model's efficiency by\nintroducing a new Fourier Adaptive Spike Neural Network (FA-SNN), allowing for\nfaster and more precise predictions with fewer parameters. Evaluated using the\nNGSIM, HighD, and MoCAD benchmarks, HLTP++ demonstrates superior performance\ncompared to existing models, which reduces the predicted trajectory error with\nover 11% on the NGSIM dataset and 25% on the HighD datasets. Moreover, HLTP++\ndemonstrates strong adaptability in challenging environments with incomplete\ninput data. This marks a significant stride in the journey towards fully AD\nsystems.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}