{"id":"2407.14742","title":"Dynamic Color Assignment for Hierarchical Data","authors":"Jiashu Chen, Weikai Yang, Zelin Jia, Lanxi Xiao, and Shixia Liu","authorsParsed":[["Chen","Jiashu",""],["Yang","Weikai",""],["Jia","Zelin",""],["Xiao","Lanxi",""],["Liu","Shixia",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 03:42:57 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 18:01:59 GMT"},{"version":"v3","created":"Fri, 9 Aug 2024 12:10:08 GMT"},{"version":"v4","created":"Tue, 20 Aug 2024 19:20:49 GMT"},{"version":"v5","created":"Sun, 25 Aug 2024 18:16:16 GMT"},{"version":"v6","created":"Tue, 3 Sep 2024 18:55:15 GMT"}],"updateDate":"2024-09-05","timestamp":1721446977000,"abstract":"  Assigning discriminable and harmonic colors to samples according to their\nclass labels and spatial distribution can generate attractive visualizations\nand facilitate data exploration. However, as the number of classes increases,\nit is challenging to generate a high-quality color assignment result that\naccommodates all classes simultaneously. A practical solution is to organize\nclasses into a hierarchy and then dynamically assign colors during exploration.\nHowever, existing color assignment methods fall short in generating\nhigh-quality color assignment results and dynamically aligning them with\nhierarchical structures. To address this issue, we develop a dynamic color\nassignment method for hierarchical data, which is formulated as a\nmulti-objective optimization problem. This method simultaneously considers\ncolor discriminability, color harmony, and spatial distribution at each\nhierarchical level. By using the colors of parent classes to guide the color\nassignment of their child classes, our method further promotes both consistency\nand clarity across hierarchical levels. We demonstrate the effectiveness of our\nmethod in generating dynamic color assignment results with quantitative\nexperiments and a user study.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}