{"id":"2407.07090","title":"3D Gaussian Ray Tracing: Fast Tracing of Particle Scenes","authors":"Nicolas Moenne-Loccoz, Ashkan Mirzaei, Or Perel, Riccardo de Lutio,\n  Janick Martinez Esturo, Gavriel State, Sanja Fidler, Nicholas Sharp, Zan\n  Gojcic","authorsParsed":[["Moenne-Loccoz","Nicolas",""],["Mirzaei","Ashkan",""],["Perel","Or",""],["de Lutio","Riccardo",""],["Esturo","Janick Martinez",""],["State","Gavriel",""],["Fidler","Sanja",""],["Sharp","Nicholas",""],["Gojcic","Zan",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 17:59:30 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 16:38:35 GMT"}],"updateDate":"2024-07-11","timestamp":1720547970000,"abstract":"  Particle-based representations of radiance fields such as 3D Gaussian\nSplatting have found great success for reconstructing and re-rendering of\ncomplex scenes. Most existing methods render particles via rasterization,\nprojecting them to screen space tiles for processing in a sorted order. This\nwork instead considers ray tracing the particles, building a bounding volume\nhierarchy and casting a ray for each pixel using high-performance GPU ray\ntracing hardware. To efficiently handle large numbers of semi-transparent\nparticles, we describe a specialized rendering algorithm which encapsulates\nparticles with bounding meshes to leverage fast ray-triangle intersections, and\nshades batches of intersections in depth-order. The benefits of ray tracing are\nwell-known in computer graphics: processing incoherent rays for secondary\nlighting effects such as shadows and reflections, rendering from\nhighly-distorted cameras common in robotics, stochastically sampling rays, and\nmore. With our renderer, this flexibility comes at little cost compared to\nrasterization. Experiments demonstrate the speed and accuracy of our approach,\nas well as several applications in computer graphics and vision. We further\npropose related improvements to the basic Gaussian representation, including a\nsimple use of generalized kernel functions which significantly reduces particle\nhit counts.\n","subjects":["Computing Research Repository/Graphics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}