{"id":"2407.15035","title":"Poiseuille Flow in Tubes of Bipolar Cross Sections: An exact hemodynamic\n  analysis for potential mechanisms of aortopathy in bicuspid aortic valve","authors":"Doyeol Ahn (David)","authorsParsed":[["Ahn","Doyeol","","David"]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 01:56:30 GMT"}],"updateDate":"2024-07-23","timestamp":1721526990000,"abstract":"  Steady blood flow, or Poiseuille flow, through compressed or defective blood\nvessels is a critical issue in hemodynamics, particularly in cardiovascular\nstudies. This research explores a tube with a bipolar cross-section, simulating\nthe geometry of a bicuspid aortic valve (BAV) during an oval systolic opening.\nThe BAV, typically featuring two cusps instead of the usual three found in\nnormal tricuspid configurations, introduces unique hemodynamic challenges. As\nthe most prevalent congenital heart defect, BAV increases the risk of aortic\ndilation and dissection. A bipolar cross-sectional analysis provides a more\naccurate geometric approximation for modeling flow through these atypical valve\nshapes, crucial for understanding the specific fluid dynamics associated with\nBAV. We derived an exact solution for the governing equations of Poiseuille\nflow within a bipolar cross-sectional tube, including velocity field, flow\nrate, and wall shear stress (WSS). The velocity profiles for BAV show\nremarkable agreement with previous studies using coherent multi-scale\nsimulations, consistently demonstrating a jet-like flow structure absent in\ntricuspid aortic valve (TAV) scenarios. Analysis reveals that at the center of\nthe entrance, BAV blood flow velocity is significantly higher than TAV but\ndecreases more rapidly towards the vessel wall, creating a steeper vertical\nvelocity gradient and resulting in higher WSS for BAV. Additionally, the WSS,\ninversely proportional to sin({\\xi}*), where {\\xi}* represents the bipolar\ncoordinate at the wall boundary, exceeds that found in a circular cylindrical\ntube with an equivalent diameter. In cases of aortic valve stenosis, where\n{\\xi}* approaches {\\pi}, the WSS increases rapidly. This elevated WSS, commonly\nobserved in BAV patients, may detrimentally impact the aortic wall in these\nstructurally abnormal valves, particularly within the ascending aorta.\n","subjects":["Physics/Medical Physics","Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}