{"id":"2407.11040","title":"High-Quality and Full Bandwidth Seismic Signal Synthesis using\n  Operational GANs","authors":"Ozer Can Devecioglu, Serkan Kiranyaz, Zafer Yilmaz, Onur Avci, Moncef\n  Gabbouj, and Ertugrul Taciroglu","authorsParsed":[["Devecioglu","Ozer Can",""],["Kiranyaz","Serkan",""],["Yilmaz","Zafer",""],["Avci","Onur",""],["Gabbouj","Moncef",""],["Taciroglu","Ertugrul",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 08:07:23 GMT"}],"updateDate":"2024-07-17","timestamp":1720253243000,"abstract":"  Vibration sensors are essential in acquiring seismic activity for an accurate\nearthquake assessment. The state-of-the-art sensors can provide the best signal\nquality and the highest bandwidth; however, their high cost usually hinders a\nwide range of applicability and coverage, which is otherwise possible with\ntheir basic and cheap counterparts. But, their poor quality and low bandwidth\ncan significantly degrade the signal fidelity and result in an imprecise\nanalysis. To address these drawbacks, in this study, we propose a novel,\nhigh-quality, and full bandwidth seismic signal synthesis by transforming the\nsignal acquired from an inferior sensor. We employ 1D Operational Generative\nAdversarial Networks (Op-GANs) with novel loss functions to achieve this.\nTherefore, the study's key contributions include releasing a new dataset,\naddressing operational constraints in seismic monitoring, and pioneering a\ndeep-learning transformation technique to create the first virtual seismic\nsensor. The proposed method is extensively evaluated over the Simulated Ground\nMotion (SimGM) benchmark dataset, and the results demonstrated that the\nproposed approach significantly improves the quality and bandwidth of seismic\nsignals acquired from a variety of sensors, including a cheap seismic sensor,\nthe CSN-Phidgets, and the integrated accelerometers of an Android, and iOS\nphone, to the same level as the state-of-the-art sensor (e.g.,\nKinemetrics-Episensor). The SimGM dataset, our results, and the optimized\nPyTorch implementation of the proposed approach are publicly shared.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Lh9nYX-bTGj8tn8LTXzGkN99yAtpBTEkKpxTLQO7dD8","pdfSize":"2910626"}
