{"id":"2407.17725","title":"The signaling dimension of two-dimensional and polytopic systems","authors":"Shuriku Kai and Michele Dall'Arno","authorsParsed":[["Kai","Shuriku",""],["Dall'Arno","Michele",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 02:54:21 GMT"}],"updateDate":"2024-07-26","timestamp":1721876061000,"abstract":"  The signaling dimension of any given physical system represents its classical\nsimulation cost, that is, the minimum dimension of a classical system capable\nof reproducing all the input/output correlations of the given system. The\nsignaling dimension landscape is vastly unexplored; the only non-trivial\nsystems whose signaling dimension is known -- other than quantum systems -- are\nthe octahedron and the composition of two squares.\n  Building on previous results by Matsumoto, Kimura, and Frenkel, our first\nresult consists of deriving bounds on the signaling dimension of any system as\na function of its Minkowski measure of asymmetry. We use such bounds to prove\nthat the signaling dimension of any two-dimensional system (i.e. with\ntwo-dimensional set of admissible states, such as polygons and the real qubit)\nis two if and only if such a set is centrally symmetric, and three otherwise,\nthus conclusively settling the problem of the signaling dimension for such\nsystems.\n  Guided by the relevance of symmetries in the two dimensional case, we propose\na branch and bound division-free algorithm for the exact computation of the\nsymmetries of any given polytope, in polynomial time in the number of vertices\nand in factorial time in the dimension of the space. Our second result then\nconsist of providing an algorithm for the exact computation of the signaling\ndimension of any given system, that outperforms previous proposals by\nexploiting the aforementioned bounds to improve its pruning techniques and\nincorporating as a subroutine the aforementioned symmetries-finding algorithm.\nWe apply our algorithm to compute the exact value of the signaling dimension\nfor all rational Platonic, Archimedean, and Catalan solids, and for the class\nof hyper-octahedral systems up to dimension five.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}