{"id":"2407.07169","title":"Unraveling the role of merger histories in the population of Insitu\n  stars: linking IllustrisTNG cosmological simulation to H3 survey","authors":"Razieh Emami, Lars Hernquist, Randall Smith, James F. Steiner, Grant\n  Tremblay, Douglas Finkbeiner, Mark Vogelsberger, Josh Grindlay, Federico\n  Marinacci, Kung-Yi Su, Cecilia Garraffo, Yuan-Sen Ting, Phillip A. Cargile,\n  Rebecca L. Davies, Chlo\\\"e E. Benton, Yijia Li, Letizia Bugiani, Amir H.\n  Khoram, and Sownak Bose","authorsParsed":[["Emami","Razieh",""],["Hernquist","Lars",""],["Smith","Randall",""],["Steiner","James F.",""],["Tremblay","Grant",""],["Finkbeiner","Douglas",""],["Vogelsberger","Mark",""],["Grindlay","Josh",""],["Marinacci","Federico",""],["Su","Kung-Yi",""],["Garraffo","Cecilia",""],["Ting","Yuan-Sen",""],["Cargile","Phillip A.",""],["Davies","Rebecca L.",""],["Benton","Chloë E.",""],["Li","Yijia",""],["Bugiani","Letizia",""],["Khoram","Amir H.",""],["Bose","Sownak",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 18:14:25 GMT"}],"updateDate":"2024-07-11","timestamp":1720548865000,"abstract":"  We undertake a comprehensive investigation into the distribution of insitu\nstars within Milky Way-like galaxies, leveraging TNG50 simulations and\ncomparing their predictions with data from the H3 survey. Our analysis reveals\nthat 28% of galaxies demonstrate reasonable agreement with H3, while only 12%\nexhibit excellent alignment in their profiles, regardless of the specific\nspatial cut employed to define insitu stars. To uncover the underlying factors\ncontributing to deviations between TNG50 and H3 distributions, we scrutinize\ncorrelation coefficients among internal drivers(e.g., virial radius, star\nformation rate [SFR]) and merger-related parameters (such as the effective\nmass-ratio, mean distance, average redshift, total number of mergers, average\nspin-ratio and maximum spin alignment between merging galaxies). Notably, we\nidentify significant correlations between deviations from observational data\nand key parameters such as the median slope of virial radius, mean SFR values,\nand the rate of SFR change across different redshift scans. Furthermore,\npositive correlations emerge between deviations from observational data and\nparameters related to galaxy mergers. We validate these correlations using the\nRandom Forest Regression method. Our findings underscore the invaluable\ninsights provided by the H3 survey in unraveling the cosmic history of galaxies\nakin to the Milky Way, thereby advancing our understanding of galactic\nevolution and shedding light on the formation and evolution of Milky Way-like\ngalaxies in cosmological simulations.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Solar and Stellar Astrophysics","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/"}