{"id":"2407.02702","title":"Practical Guide for Causal Pathways and Sub-group Disparity Analysis","authors":"Farnaz Kohankhaki, Shaina Raza, Oluwanifemi Bamgbose, Deval Pandya,\n  Elham Dolatabadi","authorsParsed":[["Kohankhaki","Farnaz",""],["Raza","Shaina",""],["Bamgbose","Oluwanifemi",""],["Pandya","Deval",""],["Dolatabadi","Elham",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 22:51:01 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 04:58:42 GMT"},{"version":"v3","created":"Wed, 7 Aug 2024 01:35:58 GMT"}],"updateDate":"2024-08-08","timestamp":1719960661000,"abstract":"  In this study, we introduce the application of causal disparity analysis to\nunveil intricate relationships and causal pathways between sensitive attributes\nand the targeted outcomes within real-world observational data. Our methodology\ninvolves employing causal decomposition analysis to quantify and examine the\ncausal interplay between sensitive attributes and outcomes. We also emphasize\nthe significance of integrating heterogeneity assessment in causal disparity\nanalysis to gain deeper insights into the impact of sensitive attributes within\nspecific sub-groups on outcomes. Our two-step investigation focuses on datasets\nwhere race serves as the sensitive attribute. The results on two datasets\nindicate the benefit of leveraging causal analysis and heterogeneity assessment\nnot only for quantifying biases in the data but also for disentangling their\ninfluences on outcomes. We demonstrate that the sub-groups identified by our\napproach to be affected the most by disparities are the ones with the largest\nML classification errors. We also show that grouping the data only based on a\nsensitive attribute is not enough, and through these analyses, we can find\nsub-groups that are directly affected by disparities. We hope that our findings\nwill encourage the adoption of such methodologies in future ethical AI\npractices and bias audits, fostering a more equitable and fair technological\nlandscape.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning","Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}