{"id":"2407.03371","title":"Mutual distribution of two partial solutions in 1D localization: new\n  information on the phase transition","authors":"I. M. Suslov (P.L.Kapitza Institute for Physical Problems, Moscow,\n  Russia)","authorsParsed":[["Suslov","I. M.","","P.L.Kapitza Institute for Physical Problems, Moscow,\n  Russia"]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 23:41:10 GMT"}],"updateDate":"2024-07-08","timestamp":1719790870000,"abstract":"  We consider the mutual distribution of two linearly independent solutions\ny_1(x) and y_2(x) of the 1D Schroedinger equation with a random potential.\nSince individual distributions of $y_1$ and $y_2$ are log-normal, it is\nnaturally to suggest that their mutual distribution is also log-normal. Such\nhypothesis is confirmed in the deep of the allowed and forbidden bands, but\nfailed near the initial band edge. The mechanism of deviations from the\nlog-normal form is elucidated, and the first correction to it is calculated.\nThe latter allows to demonstrate broadening of the spectral lines in the\nuniversal conductance fluctuations. A lot of new information is obtained on the\nphase transition in the distribution P(\\psi), where \\psi is a combined phase\nentering the evolution equations. According to the previous publications, this\ntransition is related with appearance of the imaginary part of \\psi at a\ncertain energy E_0, and is not accompanied by singularities in the system\nresistance. The real sense of this transition consists in the change of\nconfiguration of four Lyapunov exponents, which determine the general solution:\nthere are two pairs of complex-conjugated exponents for E>E_0, while for E<E_0\nall exponents become real. Realization of two different configurations is\nconfirmed for energies in the deep of the allowed and forbidden bands; it\nproves the existence of the singular point E_0 at the formal level. The phase\ntransition can be observed in optical systems, tracing the sign of the field in\na wave, when the coordinate is changed.\n","subjects":["Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Statistical Mechanics","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}