{"id":"2407.06393","title":"Higher-Dimensional MOG dark compact object: shadow behavior in the light\n  of EHT observations","authors":"Kourosh Nozari, Sara Saghafi and Ali Mohammadpour","authorsParsed":[["Nozari","Kourosh",""],["Saghafi","Sara",""],["Mohammadpour","Ali",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 21:06:31 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 19:32:13 GMT"},{"version":"v3","created":"Mon, 15 Jul 2024 11:06:18 GMT"}],"updateDate":"2024-09-10","timestamp":1720472791000,"abstract":"  Consideration of extra spatial dimensions is motivated by the unification of\ngravity with other interactions, the achievement of the ultimate framework of\nquantum gravity, and fundamental problems in particle physics and cosmology.\nMuch attention has been focused on the effect of these extra dimensions on the\nmodified theories of gravity. Analytically examining astrophysical phenomena\nlike black hole shadows is one approach to understand how extra dimensions\nwould affect the modified gravitational theories. The purpose of this study is\nto derive a higher dimensional metric for a dark compact object in STVG theory\nand then examine the behavior of the shadow shapes for this solution in STVG\ntheory in higher dimensions. We apply the Carter method to formulate the\ngeodesic equations and the Hamilton Jacobi method to find photon orbits around\nthis higher dimensional MOG dark compact object. We investigate the effects of\nextra dimensions and the STVG parameter alpha on the black hole shadow size.\nNext, we compare the shadow radius of this higher dimensional MOG dark compact\nobject to the shadow size of the supermassive black hole M87, which has been\nrealized by the Event Horizon Telescope (EHT) collaborations, in order to\nrestrict these parameters. We find that extra dimensions in the STVG theory\ntypically lead to a reduction in the shadow size of the higher dimensional MOG\ndark compact object, whereas the effect of parameter alpha on this black hole\nshadow is suppressible. Remarkably, given the constraints from EHT\nobservations, we find that the shadow size of the four dimensional MOG dark\ncompact object lies in the confidence levels of the EHT data. Finally, we\ninvestigate the issue of acceleration bounds in higher dimensional MOG dark\ncompact object in confrontation with EHT data of M87.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}