{"id":"2407.09758","title":"Cooling of gold cluster anions, Au$_N^-$, $N=2-13,15$, in a cryogenic\n  ion-beam storage ring","authors":"Klavs Hansen, Tian Weihao, Emma K. Anderson, Mikael Bj\\\"orkhage,\n  Henrik Cederquist, Ji MingChao, Stefan Ros\\'en, Alice Schmidt-May, Mark H.\n  Stockett, Henning Zettergren, Vitali Zhaunerchyk, Henning T. Schmidt","authorsParsed":[["Hansen","Klavs",""],["Weihao","Tian",""],["Anderson","Emma K.",""],["Björkhage","Mikael",""],["Cederquist","Henrik",""],["MingChao","Ji",""],["Rosén","Stefan",""],["Schmidt-May","Alice",""],["Stockett","Mark H.",""],["Zettergren","Henning",""],["Zhaunerchyk","Vitali",""],["Schmidt","Henning T.",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 03:33:35 GMT"}],"updateDate":"2024-07-16","timestamp":1720841615000,"abstract":"  We have measured the spontaneous and photo-induced decays of anionic gold\nclusters, Au$_N^-$, with sizes ranging from $N = 2$ to 13, and 15. After\nproduction in a sputter ion source, the size-selected clusters were stored in\nthe cryogenic electrostatic ion-beam storage ring DESIREE and their\nneutralization decays were measured for storage times between 0.1 and 100 s.\nThe dimer was observed to decay by electron emission in parallel to neutral\natom emission at long times, analogously to the behavior of copper and silver\ndimers, implying a breakdown of the Born-Oppenheimer approximation. Radiative\ncooling is observed for all cluster sizes except for the dimer. The decay rates\nof clusters $N=3,6,8-13,15$ show only a single radiative cooling time. For\n$N=6-13$ the cooling times have a strong odd-even oscillation with an amplitude\nthat decrease with cluster size, and with the even $N$ having the fast cooling.\nWe compare our results with previous measurements of radiative cooling rates of\nthe corresponding cationic gold clusters, Au$_N^+$, which also show an odd-even\neffect with a similar oscillation amplitude but at orders of magnitude shorter\ntime scales, and out of phase with the anions.\n","subjects":["Physics/Atomic Physics","Physics/Atomic and Molecular Clusters"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}