{"id":"2407.10887","title":"Hey, That's My Model! Introducing Chain & Hash, An LLM Fingerprinting\n  Technique","authors":"Mark Russinovich and Ahmed Salem","authorsParsed":[["Russinovich","Mark",""],["Salem","Ahmed",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:38:56 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 07:39:41 GMT"}],"updateDate":"2024-07-18","timestamp":1721061536000,"abstract":"  Amid growing concerns over the ease of theft and misuse of Large Language\nModels (LLMs), the need for fingerprinting models has increased.\nFingerprinting, in this context, means that the model owner can link a given\nmodel to their original version, thereby identifying if their model is being\nmisused or has been completely stolen. In this paper, we first define a set\nfive properties a successful fingerprint should satisfy; namely, the\nfingerprint should be Transparent, Efficient, Persistent, Robust, and\nUnforgeable. Next, we propose Chain & Hash, a new, simple fingerprinting\napproach that implements a fingerprint with a cryptographic flavor, achieving\nall these properties. Chain & Hash involves generating a set of questions (the\nfingerprints) along with a set of potential answers. These elements are hashed\ntogether using a secure hashing technique to select the value for each\nquestion, hence providing an unforgeability property-preventing adversaries\nfrom claiming false ownership. We evaluate the Chain & Hash technique on\nmultiple models and demonstrate its robustness against benign transformations,\nsuch as fine-tuning on different datasets, and adversarial attempts to erase\nthe fingerprint. Finally, our experiments demonstrate the efficiency of\nimplementing Chain & Hash and its utility, where fingerprinted models achieve\nalmost the same performance as non-fingerprinted ones across different\nbenchmarks.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"27Ofnjx7b_GfSmt_XxYcQGwe-jacAK7yhUqz7eiMZQI","pdfSize":"2563516"}
