{"id":"2407.20573","title":"Federated Learning as a Service for Hierarchical Edge Networks with\n  Heterogeneous Models","authors":"Wentao Gao, Omid Tavallaie, Shuaijun Chen, Albert Zomaya","authorsParsed":[["Gao","Wentao",""],["Tavallaie","Omid",""],["Chen","Shuaijun",""],["Zomaya","Albert",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 06:04:43 GMT"}],"updateDate":"2024-07-31","timestamp":1722319483000,"abstract":"  Federated learning (FL) is a distributed Machine Learning (ML) framework that\nis capable of training a new global model by aggregating clients' locally\ntrained models without sharing users' original data. Federated learning as a\nservice (FLaaS) offers a privacy-preserving approach for training machine\nlearning models on devices with various computational resources. Most proposed\nFL-based methods train the same model in all client devices regardless of their\ncomputational resources. However, in practical Internet of Things (IoT)\nscenarios, IoT devices with limited computational resources may not be capable\nof training models that client devices with greater hardware performance\nhosted. Most of the existing FL frameworks that aim to solve the problem of\naggregating heterogeneous models are designed for Independent and Identical\nDistributed (IID) data, which may make it hard to reach the target algorithm\nperformance when encountering non-IID scenarios. To address these problems in\nhierarchical networks, in this paper, we propose a heterogeneous aggregation\nframework for hierarchical edge systems called HAF-Edge. In our proposed\nframework, we introduce a communication-efficient model aggregation method\ndesigned for FL systems with two-level model aggregations running at the edge\nand cloud levels. This approach enhances the convergence rate of the global\nmodel by leveraging selective knowledge transfer during the aggregation of\nheterogeneous models. To the best of our knowledge, this work is pioneering in\naddressing the problem of aggregating heterogeneous models within hierarchical\nFL systems spanning IoT, edge, and cloud environments. We conducted extensive\nexperiments to validate the performance of our proposed method. The evaluation\nresults demonstrate that HAF-Edge significantly outperforms state-of-the-art\nmethods.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}