{"id":"2407.13298","title":"Approach for composition measurement of cosmic rays using the\n  muon-to-electron ratio observed by LHAASO-KM2A","authors":"Xishui Tian, Zhuo Li, Quanbu Gou, Hengying Zhang, Huihai He, Cunfeng\n  Feng, Giuseppe Di Sciascio","authorsParsed":[["Tian","Xishui",""],["Li","Zhuo",""],["Gou","Quanbu",""],["Zhang","Hengying",""],["He","Huihai",""],["Feng","Cunfeng",""],["Di Sciascio","Giuseppe",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:59:47 GMT"}],"updateDate":"2024-07-19","timestamp":1721293187000,"abstract":"  Composition measurement of cosmic rays (CRs) around the knee of the CR energy\nspectrum is crucial for studying the processes of particle acceleration and\npropagation of Galactic CRs. The Square Kilometer Array (KM2A) of Large High\nAltitude Air Shower Observatory (LHAASO) can provide precise measurement of the\nmuonic and electromagnetic (em.) components in CR-induced extensive air\nshowers, and hence a good chance to disentangle the CR composition. Here we\npropose an approach of decomposing CR compositions with the number ratio\nbetween muons and em. particles ($N_{\\mu}$/$N_{\\rm e}$) observed by\nLHAASO-KM2A: we reconstruct the energy spectra of individual CR compositions by\nfitting $N_{\\mu}$/$N_{\\rm e}$ distributions in each reconstructed energy bin\nusing the template shapes of $N_{\\mu}$/$N_{\\rm e}$ distributions of individual\nCR compositions based on Monte Carlo (MC) simulation. We evaluate the\nperformance of this approach with MC tests where mock data of LHAASO-KM2A are\ngenerated by MC simulation. We show that the input composition model can be\nwell recovered in this approach, independent of the CR composition model\nadopted in the MC simulation for the template distributions. The uncertainties\nof the reconstructed spectra at < 20 PeV, mainly limited by simulation\nstatistics, are $\\le$ 7% for proton, He, and Fe groups, and $\\le$ 8% and $\\le$\n16% for CNO and MgAlSi groups, respectively.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Noa49lgvYOLmqYYKLJ2JW6MJtVz5JkjVlOls9VEnZ2Y","pdfSize":"2142401"}
