{"id":"2407.00933","title":"Reconfigurable Intelligent Computational Surfaces for MEC-Assisted\n  Autonomous Driving Networks: Design Optimization and Analysis","authors":"Xueyao Zhang, Bo Yang, Zhiwen Yu, Xuelin Cao, George C.\n  Alexandropoulos, Yan Zhang, Merouane Debbah and Chau Yuen","authorsParsed":[["Zhang","Xueyao",""],["Yang","Bo",""],["Yu","Zhiwen",""],["Cao","Xuelin",""],["Alexandropoulos","George C.",""],["Zhang","Yan",""],["Debbah","Merouane",""],["Yuen","Chau",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 03:33:50 GMT"}],"updateDate":"2024-07-02","timestamp":1719804830000,"abstract":"  This paper investigates autonomous driving safety improvement via task\noffloading from cellular vehicles (CVs) to a multi-access edge computing (MEC)\nserver using vehicle-to-infrastructure (V2I) links. Considering that the latter\nlinks can be reused by vehicle-to-vehicle (V2V) communications to improve\nspectrum utilization, the receiver of the V2I link may suffer from severe\ninterference that can cause outages during the task offloading. To tackle this\nissue, we propose the deployment of a reconfigurable intelligent computational\nsurface (RICS) whose computationally capable metamaterials are leveraged to\njointly enable V2I reflective links as well as to implement interference\ncancellation at the V2V links. We devise a joint optimization formulation for\nthe task offloading ratio between the CVs and the MEC server, the spectrum\nsharing strategy between V2V and V2I communications, as well as the RICS\nreflection and refraction matrices to maximize an autonomous driving safety\ntask. Due to the non-convexity of the problem and the coupling among its free\nvariables, we transform it into a more tractable equivalent form, which is then\ndecomposed into three sub-problems solved via an alternate approximation\nmethod. Our simulation results showcase that the proposed RICS-assisted\noffloading framework significantly improves the safety of the considered\nautonomous driving network, yielding a nearly 34\\% improvement in the safety\ncoefficient of the CVs. In addition, it is demonstrated that the V2V data rate\ncan be improved by around 60\\% indicating that the RICS-induced adjustment of\nthe signals can effectively mitigate interference at the V2V link.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}