{"id":"2407.02385","title":"Diffusion and pattern formation in spatial games","authors":"Alexandre Champagne-Ruel, Sascha Zakaib-Bernier, and Paul Charbonneau","authorsParsed":[["Champagne-Ruel","Alexandre",""],["Zakaib-Bernier","Sascha",""],["Charbonneau","Paul",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 15:59:05 GMT"}],"updateDate":"2024-07-03","timestamp":1719935945000,"abstract":"  Diffusion plays an important role in a wide variety of phenomena, from\nbacterial quorum sensing to the dynamics of traffic flow. While it generally\ntends to level out gradients and inhomogeneities, diffusion has nonetheless\nbeen shown to promote pattern formation in certain classes of systems.\nFormation of stable structures often serves as a key factor in promoting the\nemergence and persistence of cooperative behavior in otherwise competitive\nenvironments, however an in-depth analysis on the impact of diffusion on such\nsystems is lacking. We therefore investigate the effects of diffusion on\ncooperative behavior using a cellular automaton (CA) model of the noisy spatial\niterated prisoner's dilemma (IPD), physical extension and stochasticity being\nunavoidable characteristics of several natural phenomena. We further derive a\nmean-field (MF) model that captures the 3-species predation dynamics from the\nCA model and highlight how pattern formation arises in this new model, then\ncharacterize how including diffusion by interchange similarly enables the\nemergence of large scale structures in the CA model as well. We investigate how\nthese emerging patterns favors cooperative behavior for parameter space regions\nwhere IPD error rates classically forbid such dynamics. We thus demonstrate how\nthe coupling of diffusion with non-linear dynamics can, counter-intuitively,\npromote large scale structure formation and in return establish new grounds for\ncooperation to take hold in stochastic spatial systems.\n","subjects":["Nonlinear Sciences/Pattern Formation and Solitons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cGpiISlG3U_vK9VWLf7XQZQqjf3YzI2ITsSixSydVJs","pdfSize":"2718416"}
