{"id":"2407.03922","title":"POLAFFINI: Efficient feature-based polyaffine initialization for\n  improved non-linear image registration","authors":"Antoine Legouhy, Ross Callaghan, Hojjat Azadbakht and Hui Zhang","authorsParsed":[["Legouhy","Antoine",""],["Callaghan","Ross",""],["Azadbakht","Hojjat",""],["Zhang","Hui",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 13:36:29 GMT"},{"version":"v2","created":"Tue, 9 Jul 2024 08:47:44 GMT"}],"updateDate":"2024-07-10","timestamp":1720100189000,"abstract":"  This paper presents an efficient feature-based approach to initialize\nnon-linear image registration. Today, nonlinear image registration is dominated\nby methods relying on intensity-based similarity measures. A good estimate of\nthe initial transformation is essential, both for traditional iterative\nalgorithms and for recent one-shot deep learning (DL)-based alternatives. The\nestablished approach to estimate this starting point is to perform affine\nregistration, but this may be insufficient due to its parsimonious, global, and\nnon-bending nature. We propose an improved initialization method that takes\nadvantage of recent advances in DL-based segmentation techniques able to\ninstantly estimate fine-grained regional delineations with state-of-the-art\naccuracies. Those segmentations are used to produce local, anatomically\ngrounded, feature-based affine matchings using iteration-free closed-form\nexpressions. Estimated local affine transformations are then fused, with the\nlog-Euclidean polyaffine framework, into an overall dense diffeomorphic\ntransformation. We show that, compared to its affine counterpart, the proposed\ninitialization leads to significantly better alignment for both traditional and\nDL-based non-linear registration algorithms. The proposed approach is also more\nrobust and significantly faster than commonly used affine registration\nalgorithms such as FSL FLIRT.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}