{"id":"2407.13103","title":"Participatory Approaches in AI Development and Governance: Case Studies","authors":"Ambreesh Parthasarathy, Aditya Phalnikar, Gokul S Krishnan, Ameen\n  Jauhar, Balaraman Ravindran","authorsParsed":[["Parthasarathy","Ambreesh",""],["Phalnikar","Aditya",""],["Krishnan","Gokul S",""],["Jauhar","Ameen",""],["Ravindran","Balaraman",""]],"versions":[{"version":"v1","created":"Mon, 3 Jun 2024 10:10:23 GMT"}],"updateDate":"2024-07-19","timestamp":1717409423000,"abstract":"  This paper forms the second of a two-part series on the value of a\nparticipatory approach to AI development and deployment. The first paper had\ncrafted a principled, as well as pragmatic, justification for deploying\nparticipatory methods in these two exercises (that is, development and\ndeployment of AI). The pragmatic justification is that it improves the quality\nof the overall algorithm by providing more granular and minute information. The\nmore principled justification is that it offers a voice to those who are going\nto be affected by the deployment of the algorithm, and through engagement\nattempts to build trust and buy-in for an AI system. By a participatory\napproach, we mean including various stakeholders (defined a certain way) in the\nactual decision making process through the life cycle of an AI system. Despite\nthe justifications offered above, actual implementation depends crucially on\nhow stakeholders in the entire process are identified, what information is\nelicited from them, and how it is incorporated. This paper will test these\npreliminary conclusions in two sectors, the use of facial recognition\ntechnology in the upkeep of law and order and the use of large language models\nin the healthcare sector. These sectors have been chosen for two primary\nreasons. Since Facial Recognition Technologies are a branch of AI solutions\nthat are well-researched and the impact of which is well documented, it\nprovides an established space to illustrate the various aspects of adapting PAI\nto an existing domain, especially one that has been quite contentious in the\nrecent past. LLMs in healthcare provide a canvas for a relatively less explored\nspace, and helps us illustrate how one could possibly envision enshrining the\nprinciples of PAI for a relatively new technology, in a space where innovation\nmust always align with patient welfare.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}