{"id":"2407.15045","title":"Efficient Sampling for Data-Driven Frequency Stability Constraint via\n  Forward-Mode Automatic Differentiation","authors":"Wangkun Xu, Qian Chen, Pudong Ge, Zhongda Chu, Fei Teng","authorsParsed":[["Xu","Wangkun",""],["Chen","Qian",""],["Ge","Pudong",""],["Chu","Zhongda",""],["Teng","Fei",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 03:50:11 GMT"}],"updateDate":"2024-07-23","timestamp":1721533811000,"abstract":"  Encoding frequency stability constraints in the operation problem is\nchallenging due to its complex dynamics. Recently, data-driven approaches have\nbeen proposed to learn the stability criteria offline with the trained model\nembedded as a constraint of online optimization. However, random sampling of\nstationary operation points is less efficient in generating balanced stable and\nunstable samples. Meanwhile, the performance of such a model is strongly\ndependent on the quality of the training dataset. Observing this research gap,\nwe propose a gradient-based data generation method via forward-mode automatic\ndifferentiation. In this method, the original dynamic system is augmented with\nnew states that represent the dynamic of sensitivities of the original states,\nwhich can be solved by invoking any ODE solver for a single time. To compensate\nfor the contradiction between the gradient of various frequency stability\ncriteria, gradient surgery is proposed by projecting the gradient on the normal\nplane of the other. In the end, we demonstrate the superior performance of the\nproposed sampling algorithm, compared with the unrolling differentiation and\nfinite difference. All codes are available at\nhttps://github.com/xuwkk/frequency_sample_ad.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YEm-50s6Y5lfxSBjrQAjgCEvxRZPb6tgZVACuR86C5Y","pdfSize":"375418"}
