{"id":"2407.10055","title":"MKDTI: Predicting drug-target interactions via multiple kernel fusion on\n  graph attention network","authors":"Yuhuan Zhou, Yulin Wu, Weiwei Yuan, Xuan Wang, Junyi Li","authorsParsed":[["Zhou","Yuhuan",""],["Wu","Yulin",""],["Yuan","Weiwei",""],["Wang","Xuan",""],["Li","Junyi",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 02:53:25 GMT"}],"updateDate":"2024-07-16","timestamp":1720925605000,"abstract":"  Drug-target relationships may now be predicted computationally using\nbioinformatics data, which is a valuable tool for understanding pharmacological\neffects, enhancing drug development efficiency, and advancing related research.\nA number of structure-based, ligand-based and network-based approaches have now\nemerged. Furthermore, the integration of graph attention networks with\nintricate drug target studies is an application area of growing interest. In\nour work, we formulate a model called MKDTI by extracting kernel information\nfrom various layer embeddings of a graph attention network. This combination\nimproves the prediction ability with respect to novel drug-target\nrelationships. We first build a drug-target heterogeneous network using\nheterogeneous data of drugs and targets, and then use a self-enhanced\nmulti-head graph attention network to extract potential features in each layer.\nNext, we utilize embeddings of each layer to computationally extract kernel\nmatrices and fuse multiple kernel matrices. Finally, we use a Dual Laplacian\nRegularized Least Squares framework to forecast novel drug-target entity\nconnections. This prediction can be facilitated by integrating the kernel\nmatrix associated with the drug-target. We measured our model's efficacy using\nAUPR and AUC. Compared to the benchmark algorithms, our model outperforms them\nin the prediction outcomes. In addition, we conducted an experiment on kernel\nselection. The results show that the multi-kernel fusion approach combined with\nthe kernel matrix generated by the graph attention network provides\ncomplementary insights into the model. The fusion of this information helps to\nenhance the accuracy of the predictions.\n","subjects":["Computing Research Repository/Machine Learning","Quantitative Biology/Quantitative Methods"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}