{"id":"2407.13927","title":"\"We're not all construction workers\": Algorithmic Compression of\n  Latinidad on TikTok","authors":"Nina Lutz, Cecilia Aragon","authorsParsed":[["Lutz","Nina",""],["Aragon","Cecilia",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 22:30:19 GMT"}],"updateDate":"2024-07-22","timestamp":1721341819000,"abstract":"  The Latinx diaspora in the United States is a rapidly growing and complex\ndemographic who face intersectional harms and marginalizations in\nsociotechnical systems and are currently underserved in CSCW research. While\nthe field understands that algorithms and digital content are experienced\ndifferently by marginalized populations, more investigation is needed about how\nLatinx people experience social media and, in particular, visual media. In this\npaper, we focus on how Latinx people experience the algorithmic system of the\nvideo-sharing platform TikTok. Through a bilingual interview and visual\nelicitation study of 19 Latinx TikTok users and 59 survey participants, we\nexplore how Latinx individuals experience TikTok and its Latinx content. We\nfind Latinx TikTok users actively use platform affordances to create positive\nand affirming identity content feeds, but these feeds are interrupted by\nnegative content (i.e. violence, stereotypes, linguistic assumptions) due to\nplatform affordances that have unique consequences for Latinx diaspora users.\nWe discuss these implications on Latinx identity and representation, introduce\nthe concept of \\textit{algorithmic identity compression}, where sociotechncial\nsystems simplify, flatten, and conflate intersection identities, resulting in\ncompression via the loss of critical cultural data deemed unnecessary by these\nsystems and designers of them. This study explores how Latinx individuals are\nparticularly vulnerable to this in sociotechnical systems, such as, but not\nlimited to, TikTok.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6W4ZlVXk4T5zqzCZHkkvwZj8SeikongwQ5F8-QELfQQ","pdfSize":"2540539"}
