{"id":"2407.00909","title":"Heterogeneous Graph-based Framework with Disentangled Representations\n  Learning for Multi-target Cross Domain Recommendation","authors":"Xiaopeng Liu, Juan Zhang, Chongqi Ren, Shenghui Xu, Zhaoming Pan,\n  Zhimin Zhang","authorsParsed":[["Liu","Xiaopeng",""],["Zhang","Juan",""],["Ren","Chongqi",""],["Xu","Shenghui",""],["Pan","Zhaoming",""],["Zhang","Zhimin",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 02:27:54 GMT"}],"updateDate":"2024-07-02","timestamp":1719800874000,"abstract":"  CDR (Cross-Domain Recommendation), i.e., leveraging information from multiple\ndomains, is a critical solution to data sparsity problem in recommendation\nsystem. The majority of previous research either focused on single-target CDR\n(STCDR) by utilizing data from the source domains to improve the model's\nperformance on the target domain, or applied dual-target CDR (DTCDR) by\nintegrating data from the source and target domains. In addition, multi-target\nCDR (MTCDR) is a generalization of DTCDR, which is able to capture the link\namong different domains. In this paper we present HGDR (Heterogeneous\nGraph-based Framework with Disentangled Representations Learning), an\nend-to-end heterogeneous network architecture where graph convolutional layers\nare applied to model relations among different domains, meanwhile utilizes the\nidea of disentangling representation for domain-shared and domain-specifc\ninformation. First, a shared heterogeneous graph is generated by gathering\nusers and items from several domains without any further side information.\nSecond, we use HGDR to compute disentangled representations for users and items\nin all domains.Experiments on real-world datasets and online A/B tests prove\nthat our proposed model can transmit information among domains effectively and\nreach the SOTA performance.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}