{"id":"2407.15958","title":"The 2024 KIDA network for interstellar chemistry","authors":"V. Wakelam, P. Gratier, J.-C. Loison, K. M. Hickson, J. Penguen, A.\n  Mechineau","authorsParsed":[["Wakelam","V.",""],["Gratier","P.",""],["Loison","J. -C.",""],["Hickson","K. M.",""],["Penguen","J.",""],["Mechineau","A.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:16:17 GMT"}],"updateDate":"2024-07-24","timestamp":1721672177000,"abstract":"  The study of the chemical composition of the interstellar medium (ISM)\nrequires a strong synergy between laboratory astrophysics, modeling, and\nobservations. In particular, astrochemical models have been developed for\ndecades now and include an increasing number of processes studied in the\nlaboratory or theoretically. These models follow the chemistry both in the gas\nphase and at the surface of interstellar grains. Since 2012, we have provided\ncomplete gas-phase chemical networks for astrochemical codes that can be used\nto model various environments of the ISM. Our aim is to introduce the new\nup-to-date astrochemical network kida.uva.2024 together with the ice chemical\nnetwork and the fortran code to compute time dependent compositions of the gas,\nthe ice surface, and the ice mantles under physical conditions relevant for the\nISM. The gas-phase chemical reactions, as well as associated rate coefficients,\nincluded in kida.uva.2024 were carefully selected from the KIDA online database\nand represent the most recent values. The model predictions for cold core\nconditions and for when considering only gas-phase processes were computed as a\nfunction of time and compared to the predictions obtained with the previous\nversion, kida.uva.2014. In addition, key chemical reactions were identified.\nThe model predictions, including both gas and surface processes, were compared\nto the molecular abundances as observed in the cold core TMC1-CP. Many\ngas-phase reactions were revised or added to produce kida.uva.2024. The new\nmodel predictions are different by several orders of magnitude for some\nspecies. The agreement of this new model with observations in TMC-1 (CP) is,\nhowever, similar to the one obtained with the previous network.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}