{"id":"2407.09138","title":"Distinct citation distributions complicate research evaluations. A\n  single indicator that universally reveals research efficiency cannot be\n  formulated","authors":"Alonso Rodr\\'iguez-Navarro","authorsParsed":[["Rodríguez-Navarro","Alonso",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 10:16:21 GMT"}],"updateDate":"2024-07-15","timestamp":1720779381000,"abstract":"  Purpose: Analyze the diversity of citation distributions to publications in\ndifferent research topics to investigate the accuracy of size-independent,\nrank-based indicators. Top percentile-based indicators are the most common\nindicators of this type, and the evaluations of Japan are the most evident\nmisjudgments. Design/methodology/approach: The distributions of citations to\npublications from countries and in journals in several research topics were\nanalyzed along with the corresponding global publications using histograms with\nlogarithmic binning, double rank plots, and normal probability plots of\nlog-transformed numbers of citations. Findings: Size-independent, top\npercentile-based indicators are accurate when the global ranks of local\npublications fit a power law, but deviations in the least cited papers are\nfrequent in countries and occur in all journals with high impact factors. In\nthese cases, a single indicator is misleading. Comparisons of proportions of\nuncited papers are the best way to predict these deviations. Research\nlimitations: The study is fundamentally analytical; its results describe\nmathematical facts that are self-evident. Practical implications: Respectable\ninstitutions, such as the OECD, European Commission, US National Science Board,\nand others, produce research country rankings and individual evaluations using\nsize-independent percentile indicators that are misleading in many countries.\nThese misleading evaluations should be discontinued because they cause\nconfusion among research policymakers and lead to incorrect research policies.\nOriginality/value: Studies linking the lower tail of citation distribution,\nincluding uncited papers, to percentile research indicators have not been\nperformed previously. The present results demonstrate that studies of this type\nare necessary to find reliable procedures for research assessments.\n","subjects":["Computing Research Repository/Digital Libraries","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}