{"id":"2407.18908","title":"Wolf: Captioning Everything with a World Summarization Framework","authors":"Boyi Li and Ligeng Zhu and Ran Tian and Shuhan Tan and Yuxiao Chen and\n  Yao Lu and Yin Cui and Sushant Veer and Max Ehrlich and Jonah Philion and\n  Xinshuo Weng and Fuzhao Xue and Andrew Tao and Ming-Yu Liu and Sanja Fidler\n  and Boris Ivanovic and Trevor Darrell and Jitendra Malik and Song Han and\n  Marco Pavone","authorsParsed":[["Li","Boyi",""],["Zhu","Ligeng",""],["Tian","Ran",""],["Tan","Shuhan",""],["Chen","Yuxiao",""],["Lu","Yao",""],["Cui","Yin",""],["Veer","Sushant",""],["Ehrlich","Max",""],["Philion","Jonah",""],["Weng","Xinshuo",""],["Xue","Fuzhao",""],["Tao","Andrew",""],["Liu","Ming-Yu",""],["Fidler","Sanja",""],["Ivanovic","Boris",""],["Darrell","Trevor",""],["Malik","Jitendra",""],["Han","Song",""],["Pavone","Marco",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:59:09 GMT"}],"updateDate":"2024-07-29","timestamp":1722016749000,"abstract":"  We propose Wolf, a WOrLd summarization Framework for accurate video\ncaptioning. Wolf is an automated captioning framework that adopts a\nmixture-of-experts approach, leveraging complementary strengths of Vision\nLanguage Models (VLMs). By utilizing both image and video models, our framework\ncaptures different levels of information and summarizes them efficiently. Our\napproach can be applied to enhance video understanding, auto-labeling, and\ncaptioning. To evaluate caption quality, we introduce CapScore, an LLM-based\nmetric to assess the similarity and quality of generated captions compared to\nthe ground truth captions. We further build four human-annotated datasets in\nthree domains: autonomous driving, general scenes, and robotics, to facilitate\ncomprehensive comparisons. We show that Wolf achieves superior captioning\nperformance compared to state-of-the-art approaches from the research community\n(VILA1.5, CogAgent) and commercial solutions (Gemini-Pro-1.5, GPT-4V). For\ninstance, in comparison with GPT-4V, Wolf improves CapScore both quality-wise\nby 55.6% and similarity-wise by 77.4% on challenging driving videos. Finally,\nwe establish a benchmark for video captioning and introduce a leaderboard,\naiming to accelerate advancements in video understanding, captioning, and data\nalignment. Leaderboard: https://wolfv0.github.io/leaderboard.html.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}