{"id":"2407.00139","title":"A Calibrated Sensitivity Analysis for Weighted Causal Decompositions","authors":"Andy Shen, Elina Visoki, Ran Barzilay, and Samuel D. Pimentel","authorsParsed":[["Shen","Andy",""],["Visoki","Elina",""],["Barzilay","Ran",""],["Pimentel","Samuel D.",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 14:14:59 GMT"}],"updateDate":"2024-07-02","timestamp":1719584099000,"abstract":"  Disparities in health or well-being experienced by minority groups can be\ndifficult to study using the traditional exposure-outcome paradigm in causal\ninference, since potential outcomes in variables such as race or sexual\nminority status are challenging to interpret. Causal decomposition analysis\naddresses this gap by positing causal effects on disparities under\ninterventions to other, intervenable exposures that may play a mediating role\nin the disparity. While invoking weaker assumptions than causal mediation\napproaches, decomposition analyses are often conducted in observational\nsettings and require uncheckable assumptions that eliminate unmeasured\nconfounders. Leveraging the marginal sensitivity model, we develop a\nsensitivity analysis for weighted causal decomposition estimators and use the\npercentile bootstrap to construct valid confidence intervals for causal effects\non disparities. We also propose a two-parameter amplification that enhances\ninterpretability and facilitates an intuitive understanding of the plausibility\nof unmeasured confounders and their effects. We illustrate our framework on a\nstudy examining the effect of parental acceptance on disparities in suicidal\nideation among sexual minority youth. We find that the effect is small and\nsensitive to unmeasured confounding, suggesting that further screening studies\nare needed to identify mitigating interventions in this vulnerable population.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}