{"id":"2407.00605","title":"Gaia dr3 reveals the complex dynamical evolution within star clusters","authors":"C. Viscasillas V\\'azquez, L. Magrini, N. Miret-Roig, N. J. Wright, J.\n  Alves, L. Spina, R. P. Church, G. Tautvai\\v{s}ien\\.e, and S. Randich","authorsParsed":[["Vázquez","C. Viscasillas",""],["Magrini","L.",""],["Miret-Roig","N.",""],["Wright","N. J.",""],["Alves","J.",""],["Spina","L.",""],["Church","R. P.",""],["Tautvaišienė","G.",""],["Randich","S.",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 06:26:47 GMT"}],"updateDate":"2024-07-02","timestamp":1719728807000,"abstract":"  Context: Star clusters, composed of stars born from the same molecular cloud,\nserve as invaluable natural laboratories for understanding the fundamental\nprocesses governing stellar formation and evolution. Aims: This study aims to\ninvestigate correlations between the Mean Interdistance ($\\bar{D_{i}}$), Mean\nClosest Interdistance ($\\bar{D_{c}}$) and Median Weighted Central Interdistance\n($\\bar{D_{cc}}$) with the age of star clusters, examining their evolutionary\ntrends and assessing the robustness of these quantities as possible age\nindicators. Methods: We selected a sample of open clusters in the solar region\nand with a representative number of members (e.g. well populated and without\noutliers). The interdistances are derived from the spatial distribution of\nmember stars within a cluster. Their evolution over time allows us to use them\nas an age indicators for star clusters. Results: Our investigation reveals a\nhigh-significant correlation between the interdistances and cluster age.\nConsidering the full sample of clusters between 7 and 9 kpc, the relationship\nis very broad. This is due to uncertainties in parallax, which increase with\nincreasing distance. In particular, we must limit the sample to a maximum\ndistance from the Sun of about 200 pc to avoid artificial effects on cluster\nshape and on the spatial distribution of their stars along the line of sight.\nConclusions: By conservatively restraining the distance to a maximum of\n$\\sim$200 pc, we have established a relationship between the interdistances and\nthe age of the clusters. In our sample, the relationship is mainly driven by\nthe internal expansion of the clusters, and is marginally affected by external\nperturbative effects. Such relation might enhance our comprehension of cluster\ndynamics and might be used to derive cluster dynamical ages.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}