{"id":"2407.18496","title":"Towards More Accurate Prediction of Human Empathy and Emotion in Text\n  and Multi-turn Conversations by Combining Advanced NLP, Transformers-based\n  Networks, and Linguistic Methodologies","authors":"Manisha Singh, Divy Sharma, Alonso Ma, Nora Goldfine","authorsParsed":[["Singh","Manisha",""],["Sharma","Divy",""],["Ma","Alonso",""],["Goldfine","Nora",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 04:01:27 GMT"}],"updateDate":"2024-07-29","timestamp":1721966487000,"abstract":"  Based on the WASSA 2022 Shared Task on Empathy Detection and Emotion\nClassification, we predict the level of empathic concern and personal distress\ndisplayed in essays. For the first stage of this project we implemented a\nFeed-Forward Neural Network using sentence-level embeddings as features. We\nexperimented with four different embedding models for generating the inputs to\nthe neural network. The subsequent stage builds upon the previous work and we\nhave implemented three types of revisions. The first revision focuses on the\nenhancements to the model architecture and the training approach. The second\nrevision focuses on handling class imbalance using stratified data sampling.\nThe third revision focuses on leveraging lexical resources, where we apply four\ndifferent resources to enrich the features associated with the dataset. During\nthe final stage of this project, we have created the final end-to-end system\nfor the primary task using an ensemble of models to revise primary task\nperformance. Additionally, as part of the final stage, these approaches have\nbeen adapted to the WASSA 2023 Shared Task on Empathy Emotion and Personality\nDetection in Interactions, in which the empathic concern, emotion polarity, and\nemotion intensity in dyadic text conversations are predicted.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}