{"id":"2407.08178","title":"Performance-Barrier Event-Triggered Control of a Class of\n  Reaction-Diffusion PDEs","authors":"Bhathiya Rathnayake, Mamadou Diagne, Jorge Cortes, Miroslav Krstic","authorsParsed":[["Rathnayake","Bhathiya",""],["Diagne","Mamadou",""],["Cortes","Jorge",""],["Krstic","Miroslav",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 04:46:28 GMT"}],"updateDate":"2024-07-12","timestamp":1720673188000,"abstract":"  We employ the recent performance-barrier event-triggered control (P-ETC) for\nachieving global exponential convergence of a class of reaction-diffusion PDEs\nvia PDE backstepping control. Rather than insisting on a strictly monotonic\ndecrease of the Lyapunov function for the closed-loop system, P-ETC allows the\nLyapunov function to increase as long as it remains below an acceptable\nperformance-barrier. This approach integrates a performance residual, the\ndifference between the value of the performance-barrier and the Lyapunov\nfunction, into the triggering mechanism. The integration adds flexibility and\nresults in fewer control updates than with regular ETC (R-ETC) that demands a\nmonotonic decrease of the Lyapunov function. Our P-ETC PDE backstepping design\nensures global exponential convergence of the closed-loop system in the spatial\nL^2 norm, without encountering Zeno phenomenon. To avoid continuous monitoring\nof the triggering function that generates events, we develop periodic\nevent-triggered and self-triggered variants (P-PETC and P-STC, respectively) of\nthe P-ETC. The P-PETC only requires periodic evaluation of the triggering\nfunction whereas the P-STC preemptively computes the time of the next event at\nthe current event time using the system model and continuously available system\nstates. The P-PETC and P-STC also ensure a Zeno-free behavior and deliver\nperformance equivalent to that of the continuous-time P-ETC which requires\ncontinuous evaluation of the triggering function, in addition to the continuous\nsensing of the state. We provide numerical simulations to illustrate the\nproposed technique and to compare it with R-ETC associated with strictly\ndecreasing Lyapunov functions.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1qq8cgV5yCi1g44uS19ioNnkU6m6Sz40W1wm-w6Xwhw","pdfSize":"1722093"}
