{"id":"2407.18453","title":"Cubic algebras, induced representations and general solution of the\n  exceptional Laguerre equation $X_1$","authors":"Ian Marquette","authorsParsed":[["Marquette","Ian",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 01:19:41 GMT"}],"updateDate":"2024-07-29","timestamp":1721956781000,"abstract":"  We consider the case of exceptional Laguerre polynomials $X_1$ of type I, II\nand III, their ordinary differential equations and the problem of finding\ngeneral solution beside the polynomial part. We will develop an algebraic\napproach based on the Schrodinger form of the problem and associate\nrepresentations of the underlying spectrum generating algebra. We use the\nDarboux-Crum transformation to construct ladder operators of fourth order for\nthe case of the exceptional Laguerre polynomials $X_1$ of type I, II and III.\nWe then obtain all zero modes for the lowering and raising operators. We\nconstruct the induced representation for the linearly independent solutions,\nincluding the polynomial states. Those states forming the general solution are\nimportant non only in the construction of wider set of physical states\nsatisfying different boundary conditions, but also in context of getting\nisospectral deformations. Our approach, allows to provide a completely\nalgebraic construction of the two linearly independent solutions of the\nordinary differential equation of the exceptional orthogonal polynomials of\nLaguerre type $X_1$ ( case I, II and III). The analogue of Rodrigues formulas\nfor the general solution are constructed. The set of finite states from which\nthe other states can be obtained algebraically is not unique but the vanishing\narrow and diagonal arrow from the diagram of the 2-chain representations can be\nused to obtain minimal sets. These Rodrigues formulas are then exploited, not\nonly to construct all the states (polynomial and non-polynomial), in a purely\nalgebraic way, but also to obtain coefficients from the action of the ladder\noperators also in an algebraic manner. Those results are established via higher\ncommutation relations related to the cubic Heisenberg Weyl algebra.\n","subjects":["Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}