{"id":"2407.20066","title":"JOYS+: link between ice and gas of complex organic molecules. Comparing\n  JWST and ALMA data of two low-mass protostars","authors":"Y. Chen, W. R. M. Rocha, E. F. van Dishoeck, M. L. van Gelder, P.\n  Nazari, K. Slavicinska, L. Francis, B. Tabone, M. E. Ressler, P. D. Klaassen,\n  H. Beuther, A. C. A. Boogert, C. Gieser, P. J. Kavanagh, G. Perotti, V. J. M.\n  Le Gouellec, L. Majumdar, M. G\\\"udel, and Th. Henning","authorsParsed":[["Chen","Y.",""],["Rocha","W. R. M.",""],["van Dishoeck","E. F.",""],["van Gelder","M. L.",""],["Nazari","P.",""],["Slavicinska","K.",""],["Francis","L.",""],["Tabone","B.",""],["Ressler","M. E.",""],["Klaassen","P. D.",""],["Beuther","H.",""],["Boogert","A. C. A.",""],["Gieser","C.",""],["Kavanagh","P. J.",""],["Perotti","G.",""],["Gouellec","V. J. M. Le",""],["Majumdar","L.",""],["Güdel","M.",""],["Henning","Th.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 14:53:40 GMT"}],"updateDate":"2024-07-30","timestamp":1722264820000,"abstract":"  A rich inventory of complex organic molecules (COMs) has been observed in\nhigh abundances in the gas phase toward Class 0 protostars. These molecules are\nsuggested to be formed in ices and sublimate in the warm inner envelope close\nto the protostar. However, only the most abundant COM, methanol (CH3OH), has\nbeen firmly detected in ices before the era of James Webb Space Telescope\n(JWST). Now it is possible to detect the interstellar ices of other COMs and\nconstrain their ice column densities quantitatively. We aim to determine the\ncolumn densities of several oxygen-bearing COMs (O-COMs) in both gas and ice\nfor two low-mass protostellar sources, NGC 1333 IRAS 2A and B1-c, as case\nstudies in our JWST Observations of Young protoStars (JOYS+) program. By\ncomparing the column density ratios w.r.t. CH3OH between both phases measured\nin the same sources, we can probe into the evolution of COMs from ice to gas in\nthe early stages of star formation. We are able to fit the fingerprints range\nof COM ices between 6.8 and 8.8 um in the JWST/MIRI-MRS spectra of B1-c using\nsimilar components as recently used for IRAS 2A. We claim detection of CH4,\nOCN-, HCOO-, HCOOH, CH3CHO, C2H5OH, CH3OCH3, CH3OCHO, and CH3COCH3 in B1-c, and\nupper limits are estimated for SO2, CH3COOH, and CH3CN. The comparison of O-COM\nratios w.r.t CH3OH between ice and gas shows two different cases. 1) the column\ndensity ratios of CH3OCHO and CH3OCH3 match well between the two phases, which\nmay be attributed to a direct inheritance from ice to gas or strong chemical\nlinks with CH3OH. 2) the ice ratios of CH3CHO and C2H5OH w.r.t. CH3OH are\nhigher than the gas ratios by 1-2 orders of magnitudes. This difference can be\nexplained by the gas-phase reprocessing following sublimation, or different\nspatial distributions of COMs in the envelope.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jG64bXdc-06-yz_0eT2X2RkcdoB0N9-gis9SoarEeQY","pdfSize":"24559919"}
