{"id":"2407.09341","title":"Convective mixing in giant planets and the connection to atmospheric\n  measurements","authors":"Henrik Knierim and Ravit Helled","authorsParsed":[["Knierim","Henrik",""],["Helled","Ravit",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 15:16:10 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 14:14:54 GMT"}],"updateDate":"2024-08-27","timestamp":1720797370000,"abstract":"  Linking atmospheric measurements to the bulk planetary composition and\nultimately the planetary origin is a key objective in planetary science. In\nthis work we identify the cases in which the atmospheric composition represents\nthe bulk composition. We simulate the evolution of giant planets considering a\nwide range of planetary masses ($0.3-2~M_\\mathrm{J}$), initial entropies\n($8-11~k_\\mathrm{B} m_\\mathrm{u}^{-1}$), and primordial heavy-element profiles.\nWe find that convective mixing is most efficient at early times (ages $\\lesssim\n10^7$ years) and that primordial composition gradients can be eroded. In\nseveral cases, however, the atmospheric composition can differ widely from the\nplanetary bulk composition, with the exact outcome depending on the details. We\nshow that the efficiency of convection is primarily controlled by the\nunderlying entropy profile: for low primordial entropies of $8-9~k_\\mathrm{B}\nm_\\mathrm{u}^{-1}$ convective mixing can be inhibited and composition gradients\ncan persist over billions of years. The scaling of mixing efficiency with mass\nis governed by the primordial entropy. For the same primordial entropy,\nlow-mass planets mix more efficiently than high mass planets. If the primordial\ninternal entropy would increase with mass, however, this trend could reverse.\nWe also present a new analytical model that predicts convective mixing under\nthe existence of composition (and entropy) gradients. Our results emphasize the\ncomplexity in the interpretation of atmospheric abundance measurements and show\nthe great need to better understand the planetary formation process as it plays\na key role in determining the planetary evolution and final structure.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}