{"id":"2407.11926","title":"Far from Perfect: Quantum Error Correction with (Hyperinvariant) Evenbly\n  Codes","authors":"Matthew Steinberg, Junyu Fan, Robert J. Harris, David Elkouss,\n  Sebastian Feld, Alexander Jahn","authorsParsed":[["Steinberg","Matthew",""],["Fan","Junyu",""],["Harris","Robert J.",""],["Elkouss","David",""],["Feld","Sebastian",""],["Jahn","Alexander",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 17:18:13 GMT"}],"updateDate":"2024-07-19","timestamp":1721150293000,"abstract":"  We introduce a new class of qubit codes that we call Evenbly codes, building\non a previous proposal of hyperinvariant tensor networks. Its tensor network\ndescription consists of local, non-perfect tensors describing CSS codes\ninterspersed with Hadamard gates, placed on a hyperbolic $\\{p,q\\}$ geometry\nwith even $q\\geq 4$, yielding an infinitely large class of subsystem codes. We\nconstruct an example for a $\\{5,4\\}$ manifold and describe strategies of\nlogical gauge fixing that lead to different rates $k/n$ and distances $d$,\nwhich we calculate analytically, finding distances which range from $d=2$ to $d\n\\sim n^{2/3}$ in the ungauged case. Investigating threshold performance under\nerasure, depolarizing, and pure Pauli noise channels, we find that the code\nexhibits a depolarizing noise threshold of about $19.1\\%$ in the code-capacity\nmodel and $50\\%$ for pure Pauli and erasure channels under suitable gauges. We\nalso test a constant-rate version with $k/n = 0.125$, finding excellent error\nresilience (about $40\\%$) under the erasure channel. Recovery rates for these\nand other settings are studied both under an optimal decoder as well as a more\nefficient but non-optimal greedy decoder. We also consider generalizations\nbeyond the CSS tensor construction, compute error rates and thresholds for\nother hyperbolic geometries, and discuss the relationship to holographic\nbulk/boundary dualities. Our work indicates that Evenbly codes may show promise\nfor practical quantum computing applications.\n","subjects":["Physics/Quantum Physics","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}