{"id":"2407.03506","title":"AntibotV: A Multilevel Behaviour-based Framework for Botnets Detection\n  in Vehicular Networks","authors":"Rabah Rahal, Abdelaziz Amara Korba, Nacira Ghoualmi-Zine, Yacine\n  Challal, Mohamed Yacine Ghamri-Doudane","authorsParsed":[["Rahal","Rabah",""],["Korba","Abdelaziz Amara",""],["Ghoualmi-Zine","Nacira",""],["Challal","Yacine",""],["Ghamri-Doudane","Mohamed Yacine",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 21:07:49 GMT"}],"updateDate":"2024-07-08","timestamp":1720040869000,"abstract":"  Connected cars offer safety and efficiency for both individuals and fleets of\nprivate vehicles and public transportation companies. However, equipping\nvehicles with information and communication technologies raises privacy and\nsecurity concerns, which significantly threaten the user's data and life. Using\nbot malware, a hacker may compromise a vehicle and control it remotely, for\ninstance, he can disable breaks or start the engine remotely. In this paper,\nbesides in-vehicle attacks existing in the literature, we consider new zeroday\nbot malware attacks specific to the vehicular context, WSMP-Flood, and Geo-WSMP\nFlood. Then, we propose AntibotV, a multilevel behaviour-based framework for\nvehicular botnets detection in vehicular networks. The proposed framework\ncombines two main modules for attack detection, the first one monitors the\nvehicle's activity at the network level, whereas the second one monitors the\nin-vehicle activity. The two intrusion detection modules have been trained on a\nhistorical network and in-vehicle communication using decision tree algorithms.\nThe experimental results showed that the proposed framework outperforms\nexisting solutions, it achieves a detection rate higher than 97% and a false\npositive rate lower than 0.14%.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}