{"id":"2407.09969","title":"A Momentum Balance Correction to the Non-Conservative One-Fluid\n  Formulation in Boiling Flows using Volume-of-Fluid","authors":"Jordi Poblador-Ibanez, Nicolas Valle, Bendiks Jan Boersma","authorsParsed":[["Poblador-Ibanez","Jordi",""],["Valle","Nicolas",""],["Boersma","Bendiks Jan",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 18:17:39 GMT"}],"updateDate":"2024-07-16","timestamp":1720894659000,"abstract":"  A proven methodology to solve multiphase flows is based on the one-fluid\nformulation of the governing equations, which treats the phase transition\nacross the interface as a single fluid with varying properties and adds\nadditional source terms to satisfy interface jump conditions, e.g., surface\ntension and mass transfer. Used interchangeably in the limit of non-evaporative\nflows, recent literature has formalized the inconsistencies that arise in the\nmomentum balance of the non-conservative one-fluid formulation compared to its\nconservative counterpart when phase change is involved. This translates into an\nincreased sensitivity of the numerical solution to the choice of formulation.\nMotivated by the fact that many legacy codes using the non-conservative\none-fluid formulation have been extended to phase-change simulations, the\ninclusion of two corrective forces at the interface and a modification of the\npressure-velocity solver with an additional predictor-projection step are shown\nto recover the exact momentum balance in the evaporative non-conservative\none-fluid framework for low-viscosity incompressible flows. This has direct\nimplications for obtaining a physically meaningful pressure field and is seen\nto affect the dynamics of two-phase flows. In the high-viscosity domain, the\ndiscretization of the viscous term introduces a momentum imbalance which is\nhighly dependent on the chosen method to model the phase transition. Lastly,\nthe need to develop sub-models for heat and mass transfer and for surface\ntension becomes evident since typical grid resolutions defined as ``resolved\"\nin the literature may not be enough to capture interfacial phenomena.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}