{"id":"2407.15446","title":"Text2Place: Affordance-aware Text Guided Human Placement","authors":"Rishubh Parihar, Harsh Gupta, Sachidanand VS, R. Venkatesh Babu","authorsParsed":[["Parihar","Rishubh",""],["Gupta","Harsh",""],["VS","Sachidanand",""],["Babu","R. Venkatesh",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 08:00:06 GMT"}],"updateDate":"2024-07-23","timestamp":1721635206000,"abstract":"  For a given scene, humans can easily reason for the locations and pose to\nplace objects. Designing a computational model to reason about these\naffordances poses a significant challenge, mirroring the intuitive reasoning\nabilities of humans. This work tackles the problem of realistic human insertion\nin a given background scene termed as \\textbf{Semantic Human Placement}. This\ntask is extremely challenging given the diverse backgrounds, scale, and pose of\nthe generated person and, finally, the identity preservation of the person. We\ndivide the problem into the following two stages \\textbf{i)} learning\n\\textit{semantic masks} using text guidance for localizing regions in the image\nto place humans and \\textbf{ii)} subject-conditioned inpainting to place a\ngiven subject adhering to the scene affordance within the \\textit{semantic\nmasks}. For learning semantic masks, we leverage rich object-scene priors\nlearned from the text-to-image generative models and optimize a novel\nparameterization of the semantic mask, eliminating the need for large-scale\ntraining. To the best of our knowledge, we are the first ones to provide an\neffective solution for realistic human placements in diverse real-world scenes.\nThe proposed method can generate highly realistic scene compositions while\npreserving the background and subject identity. Further, we present results for\nseveral downstream tasks - scene hallucination from a single or multiple\ngenerated persons and text-based attribute editing. With extensive comparisons\nagainst strong baselines, we show the superiority of our method in realistic\nhuman placement.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"9wEgJCk1VrJ4DI5OBaZI1wYgA6HQjPq1F85dja2SAFA","pdfSize":"40493366"}
