{"id":"2407.21529","title":"Schumann Resonances as a tool to constrain the depth of Titan's buried\n  water ocean: Re-assessment of Huygens observations and preparation of the\n  EFIELD/Dragonfly experiment","authors":"Paul Lagouanelle, Alice Le Gall","authorsParsed":[["Lagouanelle","Paul",""],["Gall","Alice Le",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 11:24:02 GMT"}],"updateDate":"2024-08-01","timestamp":1722425042000,"abstract":"  Among the lines of evidence for a buried ocean on Titan is the possible\ndetection, in 2005, by the Permittivity, Wave and Altimetry (PWA) analyzer on\nboard the ESA Huygens probe of Schumann-like Resonances (SR). SR are Extremely\nLow Frequency electromagnetic waves resonating between two electrically\nconductive layers. On Titan, it has been proposed that they propagate between\nthe moon's ionosphere and a salty subsurface water ocean. Their\ncharacterization by electric field sensors can provide constraints on Titan's\ncavity characteristics and in particular on the depth of Titan's ocean which is\nkey to better assess Titan's habitability. For this work we have developed a\nnumerical model of Titan's electromagnetic cavity as well as a surrogate model\nto conduct simulations and sensitivity analyses at a low computational cost.\nThis surrogate model is used both to re-assess PWA/Huygens measurements and to\npredict the future performance of the EFIELD experiment on board the NASA\nDragonfly mission. We demonstrate that the PWA/Huygens measurements, in\nparticular due to their low spectral resolution, do not bring any meaningful\nconstraint on Titan's ocean depth. On the other hand, the finer resolution of\nthe EFIELD experiment and its ability to capture several harmonics of SR should\nprovide more robust constraints on Titan's internal structure, especially if\nthe electrical properties of the ice crust and the atmosphere can be better\nconstrained.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}