{"id":"2407.07868","title":"Green Screen Augmentation Enables Scene Generalisation in Robotic\n  Manipulation","authors":"Eugene Teoh, Sumit Patidar, Xiao Ma, Stephen James","authorsParsed":[["Teoh","Eugene",""],["Patidar","Sumit",""],["Ma","Xiao",""],["James","Stephen",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 17:32:05 GMT"},{"version":"v2","created":"Sun, 8 Sep 2024 14:33:45 GMT"}],"updateDate":"2024-09-10","timestamp":1720632725000,"abstract":"  Generalising vision-based manipulation policies to novel environments remains\na challenging area with limited exploration. Current practices involve\ncollecting data in one location, training imitation learning or reinforcement\nlearning policies with this data, and deploying the policy in the same\nlocation. However, this approach lacks scalability as it necessitates data\ncollection in multiple locations for each task. This paper proposes a novel\napproach where data is collected in a location predominantly featuring green\nscreens. We introduce Green-screen Augmentation (GreenAug), employing a chroma\nkey algorithm to overlay background textures onto a green screen. Through\nextensive real-world empirical studies with over 850 training demonstrations\nand 8.2k evaluation episodes, we demonstrate that GreenAug surpasses no\naugmentation, standard computer vision augmentation, and prior generative\naugmentation methods in performance. While no algorithmic novelties are\nclaimed, our paper advocates for a fundamental shift in data collection\npractices. We propose that real-world demonstrations in future research should\nutilise green screens, followed by the application of GreenAug. We believe\nGreenAug unlocks policy generalisation to visually distinct novel locations,\naddressing the current scene generalisation limitations in robot learning.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"I7isBsJAjRyGk2Z4YN3Xks2HSinHxBj5DbfVyMZqHts","pdfSize":"7933945"}
