{"id":"2407.00254","title":"An Exhaustive Study of Two-Node McCulloch-Pitts Networks","authors":"Wentian Li, Astero Provata, Thomas MacCarthy","authorsParsed":[["Li","Wentian",""],["Provata","Astero",""],["MacCarthy","Thomas",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 23:00:10 GMT"}],"updateDate":"2024-07-02","timestamp":1719615610000,"abstract":"  Boolean networks are widely used in computational biology, evolutionary\nstudies, and social sciences. However, the set of all Boolean-function-defined\nnetworks are harder to study as a whole. On the other hand, McCulloch-Pitts\ngates are sparsely parameterized using only a few number of link strengths,\nmaking it possible to study and compare different networks models. We treat\ntwo-node McCulloch-Pitts systems as a minimal complex system. When the link\nstrengths are discretized, $3^4=81$ network models or rules are organized in\nthe rule space The limiting dynamics of each rule may depend on the choice of\nbinary state value ([-1,1] or [0,1]), and on the treatment at the threshold\npoint, leading to at least six variants. One variant with [-1,1] as the binary\nstate value (V1 model) tends to have a more diverse dynamical behaviors with a\nmixture of multiple cycles and fixed points at the limiting state, whereas\nother variants tend to fall only to fixed-point limiting dynamics. We use V1\nmodels to study the organization of rules with different dynamics in the rule\nspace and robustness of limiting dynamics with respect to a mutation in the\nrule table, as well as the related phenomena of phase transition and\nedge-of-chaos. We use another variant (V4 models) with only the fixed-point\nlimiting dynamics to study the robustness of limiting state with respect to\nperturbation of initial states. The two types of robustness do not seem to be\nassociated with each other. Other aspects of fully discretized two-node\nMaCulloch-Pitts networks are also studied, including: the proposal of a seventh\nvariant based on a difference equation; relation to Rene Thomas' two types of\nfeedback loops; spectrum properties of state space transition matrix; and\nasynchronous updating. Our works also expand the concept of network motifs by\nallowing more finer details.\n","subjects":["Computing Research Repository/Social and Information Networks","Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}