{"id":"2407.12434","title":"Westward hotspot offset explained by subcritical dynamo action in an\n  ultra-hot Jupiter atmosphere","authors":"Vincent G. A. B\\\"oning, Wieland Dietrich, Johannes Wicht","authorsParsed":[["Böning","Vincent G. A.",""],["Dietrich","Wieland",""],["Wicht","Johannes",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 09:42:50 GMT"}],"updateDate":"2024-07-18","timestamp":1721209370000,"abstract":"  Hot Jupiters are tidally-locked Jupiter-sized planets close to their host\nstar. They have equilibrium temperatures above about 1000 K. Photometric\nobservations find that the hotspot, the hottest location in the atmosphere, is\nshifted with respect to the substellar point. Some observations show eastward\nand some show westward hotspot offsets, while hydrodynamic simulations show an\neastward offset due to advection by the characteristic eastward mean flow. In\nparticular for ultra-hot Jupiters with equilibrium temperatures above 2000\nKelvin, electromagnetic effects must be considered since the ionization-driven\nsignificant electrical conductivity and the subsequent induction of magnetic\nfields likely result in substantial Lorentz forces. We here provide the first\nmagnetohydrodynamic numerical simulation of an ultra-hot Jupiter atmosphere at\nan equilibrium temperature of about 2400 K that fully captures non-linear\nelectromagnetic induction effects. We find a new turbulent flow regime,\nhitherto unknown for hot Jupiters. Its main characteristic is a break-down of\nthe well-known laminar mean flows. This break-down is triggered by strong local\nmagnetic fields. These fields are maintained by a subcritical dynamo process.\nIt is initiated by a sufficiently strong background field from an assumed deep\ndynamo region at a realistic amplitude around 2.5 G. Our results show a zero or\nwestward hotspot offset for the dynamo case, depending on atmospheric\nproperties, while the hydrodynamic case has the usual eastward offset. Since\nour simulation has an eastward mean flow at the equator, radial flows must be\nimportant for producing the zero or westward hotspot offset. A subcritical\ndynamo offers a new scenario for explaining the diversity of observed hotspot\noffsets. In this scenario, the dynamo has been initiated by sufficiently strong\nfields at some time in the past only for a part of the population.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}