{"id":"2407.08276","title":"Phenomenology of photons-enriched semi-visible jets","authors":"Cesare Cazzaniga, Alessandro Russo, Emre Sitti, Annapaola de Cosa","authorsParsed":[["Cazzaniga","Cesare",""],["Russo","Alessandro",""],["Sitti","Emre",""],["de Cosa","Annapaola",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 08:25:05 GMT"}],"updateDate":"2024-07-12","timestamp":1720686305000,"abstract":"  This Letter proposes a new signature for confining dark sectors at the LHC.\nUnder the assumption of a QCD-like hidden sector, hadronic jets containing\nstable dark bound states originating from hidden strong dynamics, known as\nsemi-visible jets, could manifest in proton-proton collisions. In the proposed\nsimplified model, a heavy $Z'$ mediator coupling to SM quarks allows the\nresonant production of dark quarks, subsequently hadronizing in stable and\nunstable dark bound states. The unstable dark bound states can then decay back\nto SM quarks via the same $Z'$ portal or photons via a lighter pseudo-scalar\nportal (such as an axion-like particle). This mechanism creates a new signature\nwhere semi-visible jets are enriched in non-isolated photons. We show that\nthese exotic jets evade the phase space probed by current LHC searches\nexploiting jets or photons due to the expected high jet neutral electromagnetic\nfraction and photons candidates non-isolation, respectively. In the proposed\nanalysis strategy to tackle such signature, we exploit jets as final state\nobjects to represent the underlying QCD-like hidden sector. We show that, by\nremoving any selection on the neutral electromagnetic fraction from the jet\nidentification criteria, higher signal efficiency can be reached. To enhance\nthe signal-to-background discrimination, we train a deep neural network as a\njet tagger that exploits differences in the substructure of signal and\nbackground jets. We estimate that with the available triggers for Run 2 and\nthis new strategy, a high mass search can claim a $5 \\sigma$ discovery\n(exclusion) of the $Z'$ boson with a mass up to 5 TeV (5 TeV) with the full Run\n2 data of the LHC when the fraction of unstable dark hadrons decaying to\nphotons pairs is around 30 %, and with a coupling of the $Z'$ to SM quarks of\n0.25.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fZr4cHjZHLFfjMrFqA_CZ_VLkJlTkxRyM6w3IBRLW90","pdfSize":"1158873"}
