{"id":"2407.16158","title":"Cross-Domain Separable Translation Network for Multimodal Image Change\n  Detection","authors":"Tao Zhan, Yuanyuan Zhu, Jie Lan and Qianlong Dang","authorsParsed":[["Zhan","Tao",""],["Zhu","Yuanyuan",""],["Lan","Jie",""],["Dang","Qianlong",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 03:56:02 GMT"}],"updateDate":"2024-07-24","timestamp":1721706962000,"abstract":"  In the remote sensing community, multimodal change detection (MCD) is\nparticularly critical due to its ability to track changes across different\nimaging conditions and sensor types, making it highly applicable to a wide\nrange of real-world scenarios. This paper focuses on addressing the challenges\nof MCD, especially the difficulty in comparing images from different sensors\nwith varying styles and statistical characteristics of geospatial objects.\nTraditional MCD methods often struggle with these variations, leading to\ninaccurate and unreliable results. To overcome these limitations, a novel\nunsupervised cross-domain separable translation network (CSTN) is proposed,\nwhich uniquely integrates a within-domain self-reconstruction and a\ncross-domain image translation and cycle-reconstruction workflow with change\ndetection constraints. The model is optimized by implementing both the tasks of\nimage translation and MCD simultaneously, thereby guaranteeing the\ncomparability of learned features from multimodal images. Specifically, a\nsimple yet efficient dual-branch convolutional architecture is employed to\nseparate the content and style information of multimodal images. This process\ngenerates a style-independent content-comparable feature space, which is\ncrucial for achieving accurate change detection even in the presence of\nsignificant sensor variations. Extensive experimental results demonstrate the\neffectiveness of the proposed method, showing remarkable improvements over\nstate-of-the-art approaches in terms of accuracy and efficacy for MCD. The\nimplementation of our method will be publicly available at\n\\url{https://github.com/OMEGA-RS/CSTN}\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}