{"id":"2407.04753","title":"Annotation of Sleep Depth Index with Scalable Deep Learning Yields Novel\n  Digital Biomarkers for Sleep Health","authors":"Songchi Zhou, Ge Song, Haoqi Sun, Yue Leng, M. Brandon Westover,\n  Shenda Hong","authorsParsed":[["Zhou","Songchi",""],["Song","Ge",""],["Sun","Haoqi",""],["Leng","Yue",""],["Westover","M. Brandon",""],["Hong","Shenda",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 08:42:49 GMT"}],"updateDate":"2024-07-09","timestamp":1720168969000,"abstract":"  Traditional sleep staging categorizes sleep and wakefulness into five\ncoarse-grained classes, overlooking subtle variations within each stage. It\nprovides limited information about the probability of arousal and may hinder\nthe diagnosis of sleep disorders, such as insomnia. To address this issue, we\npropose a deep-learning method for automatic and scalable annotation of sleep\ndepth index using existing sleep staging labels. Our approach is validated\nusing polysomnography from over ten thousand recordings across four large-scale\ncohorts. The results show a strong correlation between the decrease in sleep\ndepth index and the increase in arousal likelihood. Several case studies\nindicate that the sleep depth index captures more nuanced sleep structures than\nconventional sleep staging. Sleep biomarkers extracted from the whole-night\nsleep depth index exhibit statistically significant differences with\nmedium-to-large effect sizes across groups of varied subjective sleep quality\nand insomnia symptoms. These sleep biomarkers also promise utility in\npredicting the severity of obstructive sleep apnea, particularly in severe\ncases. Our study underscores the utility of the proposed method for continuous\nsleep depth annotation, which could reveal more detailed structures and\ndynamics within whole-night sleep and yield novel digital biomarkers beneficial\nfor sleep health.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Human-Computer Interaction","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}