{"id":"2407.10879","title":"Measurement of the Lund jet plane in hadronic decays of top quarks and W\n  bosons with the ATLAS detector","authors":"ATLAS Collaboration","authorsParsed":[["ATLAS Collaboration","",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:29:45 GMT"}],"updateDate":"2024-07-16","timestamp":1721060985000,"abstract":"  The Lund jet plane (LJP) is measured for the first time in $t\\overline{t}$\nevents, using 140 fb$^{-1}$ of $\\sqrt{s}$ = 13 TeV pp collision data collected\nwith the ATLAS detector at the LHC. The LJP is a two-dimensional observable of\nthe sub-structure of hadronic jets that acts as a proxy for the kinematics of\nparton showers and hadron formation. The observable is constructed from charged\nparticles and is measured for R = 1.0 anti-$k_t$ jets with transverse momentum\nabove 350 GeV containing the full decay products of either a top quark or a\ndaughter $W$ boson. The other top quark in the event is identified from its\ndecay into a b-quark, an electron or a muon and a neutrino. The measurement is\ncorrected for detector effects and compared with a range of Monte Carlo\npredictions sensitive to different aspects of the hadronic decays of the heavy\nparticles. In the $W$-boson-initiated jets, all the predictions are\nincompatible with the measurement. In the top quark initiated jets,\ndisagreement with all predictions is observed in smaller subregions of the\nplane, and with a subset of the predictions across the fiducial plane. The\nmeasurement could be used to improve the tuning of Monte Carlo generators, for\nbetter modelling of hadronic decays of heavy quarks and bosons, or to improve\nthe performance of jet taggers.\n","subjects":["Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AosVygR0AdJY7m88dKKUU3pUyGRJPsBNj_rsFoQYwYE","pdfSize":"4514313","objectId":"0xe2da880b76f0181b27edb7a3a6eb0294173c034bfbe402c2e3d32af1cb1a2036","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
