{"id":"2407.19033","title":"Rates and beaming angles of GRBs associated with compact binary\n  coalescences","authors":"Shasvath J. Kapadia, Dimple, Dhruv Jain, Resmi Lekshmi, Kuntal Misra\n  and K. G. Arun","authorsParsed":[["Kapadia","Shasvath J.",""],["Dimple","",""],["Jain","Dhruv",""],["Lekshmi","Resmi",""],["Misra","Kuntal",""],["Arun","K. G.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:20:25 GMT"}],"updateDate":"2024-07-31","timestamp":1722018025000,"abstract":"  Some, if not all, binary neutron star (BNS) coalescences, and a fraction of\nneutron - star black hole (NSBH) mergers, are thought to produce sufficient\nmass-ejection to power Gamma-Ray Bursts (GRBs). However, this fraction, as well\nas the distribution of beaming angles of BNS-associated GRBs, are poorly\nconstrained from observation. Recent work applied machine learning tools to\nanalyze GRB light curves observed by {\\textit{Fermi}}/GBM and {\\it Swift}/BAT.\nGRBs were segregated into multiple distinct clusters, with the tantalizing\npossibility that one of them (BNS cluster) could be associated with BNSs and\nanother (NSBH cluster) with NSBHs. As a proof of principle, assuming that all\nGRBs detected by {\\it Fermi}/GBM and {\\it Swift}/BAT associated with BNSs\n(NSBHs) lie in the BNS (NSBH) cluster, we estimate their rates\n($\\mathrm{Gpc}^{-3}\\mathrm{yr}^{-1}$). We compare these rates with\ncorresponding BNS and NSBH rates estimated by the LIGO-Virgo-Kagra (LVK)\ncollaboration from the first three observing runs (O1, O2, O3). We find that\nthe BNS rates are consistent with LVK's rate estimates, assuming a uniform\ndistribution of beaming fractions ($f_b \\in [0.01, 0.1]$). Conversely, using\nthe LVK's BNS rate estimates, assuming all BNS mergers produce GRBs, we are\nable to constrain the beaming angle distribution to $\\theta_j \\in [0.8^{\\circ},\n38.8^{\\circ}]$ at $90\\%$ confidence. We similarly place a lower limit on the\nfraction of GRB-Bright NSBHs to $f_B \\gtrsim 0.10$ ($f_B \\gtrsim 0.022$) with\n{\\it Fermi}/GBM ({\\it Swift}/BAT) data.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}