{"id":"2407.18695","title":"PIV3CAMS: a multi-camera dataset for multiple computer vision problems\n  and its application to novel view-point synthesis","authors":"Sohyeong Kim, Martin Danelljan, Radu Timofte, Luc Van Gool, and\n  Jean-Philippe Thiran","authorsParsed":[["Kim","Sohyeong",""],["Danelljan","Martin",""],["Timofte","Radu",""],["Van Gool","Luc",""],["Thiran","Jean-Philippe",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 12:18:29 GMT"}],"updateDate":"2024-07-29","timestamp":1721996309000,"abstract":"  The modern approaches for computer vision tasks significantly rely on machine\nlearning, which requires a large number of quality images. While there is a\nplethora of image datasets with a single type of images, there is a lack of\ndatasets collected from multiple cameras. In this thesis, we introduce Paired\nImage and Video data from three CAMeraS, namely PIV3CAMS, aimed at multiple\ncomputer vision tasks. The PIV3CAMS dataset consists of 8385 pairs of images\nand 82 pairs of videos taken from three different cameras: Canon D5 Mark IV,\nHuawei P20, and ZED stereo camera. The dataset includes various indoor and\noutdoor scenes from different locations in Zurich (Switzerland) and Cheonan\n(South Korea). Some of the computer vision applications that can benefit from\nthe PIV3CAMS dataset are image/video enhancement, view interpolation, image\nmatching, and much more. We provide a careful explanation of the data\ncollection process and detailed analysis of the data. The second part of this\nthesis studies the usage of depth information in the view synthesizing task. In\naddition to the regeneration of a current state-of-the-art algorithm, we\ninvestigate several proposed alternative models that integrate depth\ninformation geometrically. Through extensive experiments, we show that the\neffect of depth is crucial in small view changes. Finally, we apply our model\nto the introduced PIV3CAMS dataset to synthesize novel target views as an\nexample application of PIV3CAMS.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XPQzDnvfS0tAi44wO0JRDIZ_EHjC_8bv3EXA2uesPWQ","pdfSize":"32962532"}
