{"id":"2407.04598","title":"Tunable kHz distributed feedback fiber laser enabled by glass\n  additive-manufacturing","authors":"Pawel Maniewski, Alex I. Flint, Rex H. S. Bannerman, Timothy Lee,\n  Martynas Beresna","authorsParsed":[["Maniewski","Pawel",""],["Flint","Alex I.",""],["Bannerman","Rex H. S.",""],["Lee","Timothy",""],["Beresna","Martynas",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 15:45:06 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 14:37:57 GMT"}],"updateDate":"2024-07-29","timestamp":1720194306000,"abstract":"  techniques can be considered as an attractive alternative to the\noften-cumbersome traditional manufacturing routes. With the use of high-power\nlasers, localized hot zones that are necessary for glass making can be obtained\nrapidly. For instance, Laser-Powder-Deposition enables rapid fabrication of\nshort, high gain fibers used in e.g., distributed feedback fiber lasers (DFFL).\nDFFLs offer sought after performance suitable for a broad range of applications\nin modern photonics i.e., superior stability and narrower, single-frequency\nlinewidth compared to conventional fiber lasers. Tunable, narrow laser sources\nwith output in eye-safe spectrum are desired for sensing, signal multiplexing,\nLIDAR systems, quantum applications etc. In this work we present DFFL obtained\nusing Laser-Powder-Deposition made Er-doped silica fiber. Milliwatt level,\nnarrow line lasing (< 704 kHz, equipment limited) was obtained using a\nphaseshifted grating written in 16 mm long fiber. The backward slope efficiency\nwas as high as 24% when pumping at 976 nm. The results presented in this work\nshowcase new possibilities in fiber fabrication that were unlocked through\nlaser-assisted additive manufacturing. This fiber laser sets the stage for the\nfuture of rapid fabrication of advanced fiber devices through unconventional\nmanufacturing routes.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BwefamM4DkXzzHzTINAybW5EkoSawOxH9uPGbokvc3M","pdfSize":"930231"}
