{"id":"2407.17611","title":"Adaptive Training of Grid-Dependent Physics-Informed Kolmogorov-Arnold\n  Networks","authors":"Spyros Rigas, Michalis Papachristou, Theofilos Papadopoulos, Fotios\n  Anagnostopoulos and Georgios Alexandridis","authorsParsed":[["Rigas","Spyros",""],["Papachristou","Michalis",""],["Papadopoulos","Theofilos",""],["Anagnostopoulos","Fotios",""],["Alexandridis","Georgios",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 19:55:08 GMT"}],"updateDate":"2024-07-26","timestamp":1721850908000,"abstract":"  Physics-Informed Neural Networks (PINNs) have emerged as a robust framework\nfor solving Partial Differential Equations (PDEs) by approximating their\nsolutions via neural networks and imposing physics-based constraints on the\nloss function. Traditionally, Multilayer Perceptrons (MLPs) are the neural\nnetwork of choice, and significant progress has been made in optimizing their\ntraining. Recently, Kolmogorov-Arnold Networks (KANs) were introduced as a\nviable alternative, with the potential of offering better interpretability and\nefficiency while requiring fewer parameters. In this paper, we present a fast\nJAX-based implementation of grid-dependent Physics-Informed Kolmogorov-Arnold\nNetworks (PIKANs) for solving PDEs. We propose an adaptive training scheme for\nPIKANs, incorporating known MLP-based PINN techniques, introducing an adaptive\nstate transition scheme to avoid loss function peaks between grid updates, and\nproposing a methodology for designing PIKANs with alternative basis functions.\nThrough comparative experiments we demonstrate that these adaptive features\nsignificantly enhance training efficiency and solution accuracy. Our results\nillustrate the effectiveness of PIKANs in improving performance for PDE\nsolutions, highlighting their potential as a superior alternative in scientific\nand engineering applications.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}