{"id":"2407.20982","title":"Analysis of Polarized Dust Emission from the First Flight of the SPIDER\n  Balloon-Borne Telescope","authors":"SPIDER Collaboration, P. A. R. Ade, M. Amiri, S. J. Benton, A. S.\n  Bergman, R. Bihary, J. J. Bock, J. R. Bond, J. A. Bonetti, S. A. Bryan, H. C.\n  Chiang, C. R. Contaldi, O. Dor\\'e, A. J. Duivenvoorden, H. K. Eriksen, J. P.\n  Filippini, A. A. Fraisse, K. Freese, M. Galloway, A. E. Gambrel, N. N.\n  Gandilo, K. Ganga, S. Gourapura, R. Gualtieri, J. E. Gudmundsson, M. Halpern,\n  J. Hartley, M. Hasselfield, G. Hilton, W. Holmes, V. V. Hristov, Z. Huang, K.\n  D. Irwin, W. C. Jones, A. Karakci, C. L. Kuo, Z. D. Kermish, J. S.-Y. Leung,\n  S. Li, D. S. Y. Mak, P. V. Mason, K. Megerian, L. Moncelsi, T. A. Morford, J.\n  M. Nagy, C. B. Netterfield, M. Nolta, R. O'Brient, B. Osherson, I. L.\n  Padilla, B. Racine, A. S. Rahlin, C. Reintsema, J. E. Ruhl, M. C. Runyan, T.\n  M. Ruud, J. A. Shariff, E. C. Shaw, C. Shiu, J. D. Soler, X. Song, A.\n  Trangsrud, C. Tucker, R. S. Tucker, A. D. Turner, J. F. van der List, A. C.\n  Weber, I. K. Wehus, D. V. Wiebe, E. Y. Young","authorsParsed":[["SPIDER Collaboration","",""],["Ade","P. A. R.",""],["Amiri","M.",""],["Benton","S. J.",""],["Bergman","A. S.",""],["Bihary","R.",""],["Bock","J. J.",""],["Bond","J. R.",""],["Bonetti","J. A.",""],["Bryan","S. A.",""],["Chiang","H. C.",""],["Contaldi","C. R.",""],["Doré","O.",""],["Duivenvoorden","A. J.",""],["Eriksen","H. K.",""],["Filippini","J. P.",""],["Fraisse","A. A.",""],["Freese","K.",""],["Galloway","M.",""],["Gambrel","A. E.",""],["Gandilo","N. N.",""],["Ganga","K.",""],["Gourapura","S.",""],["Gualtieri","R.",""],["Gudmundsson","J. E.",""],["Halpern","M.",""],["Hartley","J.",""],["Hasselfield","M.",""],["Hilton","G.",""],["Holmes","W.",""],["Hristov","V. V.",""],["Huang","Z.",""],["Irwin","K. D.",""],["Jones","W. C.",""],["Karakci","A.",""],["Kuo","C. L.",""],["Kermish","Z. D.",""],["Leung","J. S. -Y.",""],["Li","S.",""],["Mak","D. S. Y.",""],["Mason","P. V.",""],["Megerian","K.",""],["Moncelsi","L.",""],["Morford","T. A.",""],["Nagy","J. M.",""],["Netterfield","C. B.",""],["Nolta","M.",""],["O'Brient","R.",""],["Osherson","B.",""],["Padilla","I. L.",""],["Racine","B.",""],["Rahlin","A. S.",""],["Reintsema","C.",""],["Ruhl","J. E.",""],["Runyan","M. C.",""],["Ruud","T. M.",""],["Shariff","J. A.",""],["Shaw","E. C.",""],["Shiu","C.",""],["Soler","J. D.",""],["Song","X.",""],["Trangsrud","A.",""],["Tucker","C.",""],["Tucker","R. S.",""],["Turner","A. D.",""],["van der List","J. F.",""],["Weber","A. C.",""],["Wehus","I. K.",""],["Wiebe","D. V.",""],["Young","E. Y.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 17:17:53 GMT"}],"updateDate":"2024-07-31","timestamp":1722359873000,"abstract":"  Using data from the first flight of SPIDER and from Planck HFI, we probe the\nproperties of polarized emission from interstellar dust in the SPIDER observing\nregion. Component separation algorithms operating in both the spatial and\nharmonic domains are applied to probe their consistency and to quantify\nmodeling errors associated with their assumptions. Analyses spanning the full\nSPIDER region demonstrate that i) the spectral energy distribution of diffuse\nGalactic dust emission is broadly consistent with a modified-blackbody (MBB)\nmodel with a spectral index of $\\beta_\\mathrm{d}=1.45\\pm0.05$ $(1.47\\pm0.06)$\nfor $E$ ($B$)-mode polarization, slightly lower than that reported by Planck\nfor the full sky; ii) its angular power spectrum is broadly consistent with a\npower law; and iii) there is no significant detection of line-of-sight\ndecorrelation of the astrophysical polarization. The size of the SPIDER region\nfurther allows for a statistically meaningful analysis of the variation in\nforeground properties within it. Assuming a fixed dust temperature\n$T_\\mathrm{d}=19.6$ K, an analysis of two independent sub-regions of that field\nresults in inferred values of $\\beta_\\mathrm{d}=1.52\\pm0.06$ and\n$\\beta_\\mathrm{d}=1.09\\pm0.09$, which are inconsistent at the $3.9\\,\\sigma$\nlevel. Furthermore, a joint analysis of SPIDER and Planck 217 and 353 GHz data\nwithin a subset of the SPIDER region is inconsistent with a simple MBB at more\nthan $3\\,\\sigma$, assuming a common morphology of polarized dust emission over\nthe full range of frequencies. These modeling uncertainties have a small--but\nnon-negligible--impact on limits on the cosmological tensor-to-scalar ratio\nderived from the \\spider dataset. The fidelity of the component separation\napproaches of future CMB polarization experiments may thus have a significant\nimpact on their constraining power.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}