{"id":"2407.11369","title":"High-Resolution Spectroscopy of the Intermediate Impurity States near a\n  Quantum Phase Transition","authors":"Yao Zhang, Tao Xie, Zhen-Yu Liu, Rui Wang, Wenhao Zhang, Chaofei Liu,\n  and Ying-Shuang Fu","authorsParsed":[["Zhang","Yao",""],["Xie","Tao",""],["Liu","Zhen-Yu",""],["Wang","Rui",""],["Zhang","Wenhao",""],["Liu","Chaofei",""],["Fu","Ying-Shuang",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 04:27:48 GMT"}],"updateDate":"2024-07-17","timestamp":1721104068000,"abstract":"  The intermediate behavior near a quantum phase transition is crucial for\nunderstanding the quantum criticality of various competing phases and their\nseparate origins, yet remains unexplored for the multiple Yu-Shiba-Rusinov\n(YSR) states. Here, we investigated the detailed spectroscopic change of the\nexchange coupling-dependent YSR states near a quantum phase transition. The\ninitially developed one pair of YSR states, induced by the Fe vacancy in\nmonolayer Fe(Te,Se) superconductor, are clearly resolved with high resolution\nshowing an evolution into two pairs of YSR peaks yet with dichotomy in their\nspectral features. Interestingly, while the lower-energy YSR branch enters the\nquantum phase transition region, the higher-lying one remains rigidly away from\nthe lower-energy counterpart with a constant energy difference. Spectral weight\nanalysis of the higher-energy branch yields an exponential dependence on the\nexchange coupling, which can be well rationalized by taking the two pairs of\nYSR states as a result of field splitting by the magnetic anisotropy. Our\nresults unveil the intermediate region of a quantum phase transition with a\nmagnetic anisotropy-induced splitting of the YSR resonance, and highlight a\nprospect for developing functional electronics based on the flexibly\ncontrollable multiple quantum states.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"L3HrLMFPm9iT_a-K4PwFL01saBKqgQh7NJZMiyUsvn0","pdfSize":"700211"}
