{"id":"2407.07229","title":"Using Galaxy Evolution as Source of Physics-Based Ground Truth for\n  Generative Models","authors":"Yun Qi Li (1), Tuan Do (1), Evan Jones (1), Bernie Boscoe (2), Kevin\n  Alfaro (1), Zooey Nguyen (1) ((1) UCLA, (2) Southern Oregon University)","authorsParsed":[["Li","Yun Qi","","UCLA"],["Do","Tuan","","UCLA"],["Jones","Evan","","UCLA"],["Boscoe","Bernie","","Southern Oregon University"],["Alfaro","Kevin","","UCLA"],["Nguyen","Zooey","","UCLA"]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 21:01:08 GMT"}],"updateDate":"2024-07-11","timestamp":1720558868000,"abstract":"  Generative models producing images have enormous potential to advance\ndiscoveries across scientific fields and require metrics capable of quantifying\nthe high dimensional output. We propose that astrophysics data, such as galaxy\nimages, can test generative models with additional physics-motivated ground\ntruths in addition to human judgment. For example, galaxies in the Universe\nform and change over billions of years, following physical laws and\nrelationships that are both easy to characterize and difficult to encode in\ngenerative models. We build a conditional denoising diffusion probabilistic\nmodel (DDPM) and a conditional variational autoencoder (CVAE) and test their\nability to generate realistic galaxies conditioned on their redshifts (galaxy\nages). This is one of the first studies to probe these generative models using\nphysically motivated metrics. We find that both models produce comparable\nrealistic galaxies based on human evaluation, but our physics-based metrics are\nbetter able to discern the strengths and weaknesses of the generative models.\nOverall, the DDPM model performs better than the CVAE on the majority of the\nphysics-based metrics. Ultimately, if we can show that generative models can\nlearn the physics of galaxy evolution, they have the potential to unlock new\nastrophysical discoveries.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ECshAev4Pqqos_24UEYBt5mjrszobZMSK0okrDm2yMo","pdfSize":"3588553"}
