{"id":"2407.18918","title":"Review on the Role of Virtual Reality in Reducing Mental Health Diseases\n  Specifically Stress, Anxiety, and Depression","authors":"Sadia Saeed, Khan Bahadar Khan, Muhammad Abul Hassan, Abdul Qayyum,\n  Saba Salahuddin","authorsParsed":[["Saeed","Sadia",""],["Khan","Khan Bahadar",""],["Hassan","Muhammad Abul",""],["Qayyum","Abdul",""],["Salahuddin","Saba",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:08:01 GMT"}],"updateDate":"2024-07-30","timestamp":1720462081000,"abstract":"  Objective: Virtual Reality (VR) is a technological interface that allows\nusers to interact with a simulated environment. VR has been used extensively\nfor mental health and clinical research. Mental health disorders are globally\nburdening health problems in the world. According to the Psychological\nInterventions Implementation Manual published by WHO on 6th March 2024, around\none in eight people in the world lived with a mental disorder. This literature\nreview is synthesized to find out the effects of VR therapy on stress, anxiety\nand depression. Method: We used Google Scholar database using keywords of VR,\nstress, anxiety and depression. Publication from last ten years (2014 to 1024)\nare considered. Researches only in the English language are included. All the\npapers and articles with the keyword VR missing were rejected. Result: Google\nScholar yielded 17,700 results from our keywords. Nine studies met our search\ncriteria that are included in this review. Out of nine, five studies\nencountered mental stress and gave effective results in reducing it by VR\ntherapy. The other four targeted mood disorders, Social anxiety disorders,\ndepression, loss of happiness and sleep deprivation. They also showed immense\npotential in reducing mental illness while using VR. Conclusion: Findings are\nin favor of the effectiveness of VR in reducing stress, anxiety and depression.\nStill, it is insufficient evidence to consider VR as solely independent\ntreatment over the traditional medication. In future, the limitations can be\novercome to relying on VR and using it in hospitals as a reliable source of\ncure for mental illness.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}