{"id":"2407.20020","title":"ImagiNet: A Multi-Content Dataset for Generalizable Synthetic Image\n  Detection via Contrastive Learning","authors":"Delyan Boychev, Radostin Cholakov","authorsParsed":[["Boychev","Delyan",""],["Cholakov","Radostin",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:57:24 GMT"}],"updateDate":"2024-07-30","timestamp":1722261444000,"abstract":"  Generative models, such as diffusion models (DMs), variational autoencoders\n(VAEs), and generative adversarial networks (GANs), produce images with a level\nof authenticity that makes them nearly indistinguishable from real photos and\nartwork. While this capability is beneficial for many industries, the\ndifficulty of identifying synthetic images leaves online media platforms\nvulnerable to impersonation and misinformation attempts. To support the\ndevelopment of defensive methods, we introduce ImagiNet, a high-resolution and\nbalanced dataset for synthetic image detection, designed to mitigate potential\nbiases in existing resources. It contains 200K examples, spanning four content\ncategories: photos, paintings, faces, and uncategorized. Synthetic images are\nproduced with open-source and proprietary generators, whereas real counterparts\nof the same content type are collected from public datasets. The structure of\nImagiNet allows for a two-track evaluation system: i) classification as real or\nsynthetic and ii) identification of the generative model. To establish a\nbaseline, we train a ResNet-50 model using a self-supervised contrastive\nobjective (SelfCon) for each track. The model demonstrates state-of-the-art\nperformance and high inference speed across established benchmarks, achieving\nan AUC of up to 0.99 and balanced accuracy ranging from 86% to 95%, even under\nsocial network conditions that involve compression and resizing. Our data and\ncode are available at https://github.com/delyan-boychev/imaginet.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}