{"id":"2407.08440","title":"Beyond Instruction Following: Evaluating Inferential Rule Following of\n  Large Language Models","authors":"Wangtao Sun, Chenxiang Zhang, Xueyou Zhang, Ziyang Huang, Haotian Xu,\n  Pei Chen, Shizhu He, Jun Zhao, Kang Liu","authorsParsed":[["Sun","Wangtao",""],["Zhang","Chenxiang",""],["Zhang","Xueyou",""],["Huang","Ziyang",""],["Xu","Haotian",""],["Chen","Pei",""],["He","Shizhu",""],["Zhao","Jun",""],["Liu","Kang",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 12:26:55 GMT"},{"version":"v2","created":"Sun, 18 Aug 2024 07:59:59 GMT"}],"updateDate":"2024-08-20","timestamp":1720700815000,"abstract":"  Although Large Language Models (LLMs) have demonstrated strong\ninstruction-following ability, they are further supposed to be controlled and\nguided by rules in real-world scenarios to be safe, accurate, and intelligent.\nThis demands the possession of inferential rule-following capability of LLMs.\nHowever, few works have made a clear evaluation of the inferential\nrule-following capability of LLMs. Previous studies that try to evaluate the\ninferential rule-following capability of LLMs fail to distinguish the\ninferential rule-following scenarios from the instruction-following scenarios.\nTherefore, this paper first clarifies the concept of inferential rule-following\nand proposes a comprehensive benchmark, RuleBench, to evaluate a diversified\nrange of inferential rule-following abilities. Our experimental results on a\nvariety of LLMs show that they are still limited in following rules. Our\nanalysis based on the evaluation results provides insights into the\nimprovements for LLMs toward a better inferential rule-following intelligent\nagent. We further propose Inferential Rule-Following Tuning (IRFT), which\noutperforms IFT in helping LLMs solve RuleBench. The data and code can be found\nat: https://anonymous.4open.science/r/llm-rule-following-B3E3/\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}