{"id":"2407.14848","title":"Grain boundary segregation spectrum in basal-textured Mg alloys: From\n  solute decoration to structural transition","authors":"Anumoy Ganguly, Hexin Wang, Julien Gu\\'enol\\'e, Aruna Prakash, Sandra\n  Korte-Kerzel, Talal Al-Samman, Zhuocheng Xie","authorsParsed":[["Ganguly","Anumoy",""],["Wang","Hexin",""],["Guénolé","Julien",""],["Prakash","Aruna",""],["Korte-Kerzel","Sandra",""],["Al-Samman","Talal",""],["Xie","Zhuocheng",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 11:33:41 GMT"}],"updateDate":"2024-07-23","timestamp":1721475221000,"abstract":"  Mg alloys are promising lightweight structural materials due to their low\ndensity and excellent mechanical properties. However, their limited formability\nand ductility necessitate improvements in these properties, specifically\nthrough texture modification via grain boundary segregation. While significant\nefforts have been made, the segregation behavior in Mg polycrystals,\nparticularly with basal texture, remains largely unexplored. In this study, we\nperformed atomistic simulations to investigate grain boundary segregation in\ndilute and concentrated solid solution Mg-Al alloys. We computed the\nsegregation energy spectrum of basal-textured Mg polycrystals, highlighting the\ncontribution from specific grain boundary sites, such as junctions, and\nidentified a newly discovered bimodal distribution which is distinct compared\nto the conventional skew-normal distribution found in randomly-oriented\npolycrystals. Using a hybrid molecular dynamics/Monte Carlo approach, we\nsimulated segregation behavior at finite temperatures, identifying grain\nboundary structural transitions, particularly the varied fraction and\nmorphology of topologically close-packed grain boundary phases when changing\nthermodynamic variables. The outcomes of this study offer crucial insights into\nbasal-textured grain boundary segregation and phase formation, which can be\nextended to other relevant Mg alloys containing topologically close-packed\nintermetallics.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}