{"id":"2407.19064","title":"Volume-preserving geometric shape optimization of the Dirichlet energy\n  using variational neural networks","authors":"Amaury B\\'eli\\`eres--Frendo, Emmanuel Franck, Victor Michel-Dansac,\n  Yannick Privat","authorsParsed":[["Bélières--Frendo","Amaury",""],["Franck","Emmanuel",""],["Michel-Dansac","Victor",""],["Privat","Yannick",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 20:04:11 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 12:47:06 GMT"},{"version":"v3","created":"Sat, 10 Aug 2024 12:52:29 GMT"}],"updateDate":"2024-08-13","timestamp":1722024251000,"abstract":"  In this work, we explore the numerical solution of geometric shape\noptimization problems using neural network-based approaches. This involves\nminimizing a numerical criterion that includes solving a partial differential\nequation with respect to a domain, often under geometric constraints like\nconstant volume. Our goal is to develop a proof of concept using a flexible and\nparallelizable methodology to tackle these problems. We focus on a prototypal\nproblem: minimizing the so-called Dirichlet energy with respect to the domain\nunder a volume constraint, involving a Poisson equation in $\\mathbb R^2$. We\nuse physics-informed neural networks (PINN) to approximate the Poisson\nequation's solution on a given domain and represent the shape through a neural\nnetwork that approximates a volume-preserving transformation from an initial\nshape to an optimal one. These processes are combined in a single optimization\nalgorithm that minimizes the Dirichlet energy. One of the significant\nadvantages of this approach is its parallelizable nature, which makes it easy\nto handle the addition of parameters. Additionally, it does not rely on shape\nderivative or adjoint calculations. Our approach is tested on Dirichlet and\nRobin boundary conditions, parametric right-hand sides, and extended to\nBernoulli-type free boundary problems. The source code for solving the shape\noptimization problem is open-source and freely available.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"VBk3-gijt4ExbrVyzCB71pJ83tZ6qVK3eMljGtYG72Y","pdfSize":"11289985","objectId":"0x60310f9429cc6e6edb04a87a54cfd22a352b492a7c97eb4c0790ecc47ac8d7d9","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
