{"id":"2407.01110","title":"SecGenAI: Enhancing Security of Cloud-based Generative AI Applications\n  within Australian Critical Technologies of National Interest","authors":"Christoforus Yoga Haryanto, Minh Hieu Vu, Trung Duc Nguyen, Emily\n  Lomempow, Yulia Nurliana, Sona Taheri","authorsParsed":[["Haryanto","Christoforus Yoga",""],["Vu","Minh Hieu",""],["Nguyen","Trung Duc",""],["Lomempow","Emily",""],["Nurliana","Yulia",""],["Taheri","Sona",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 09:19:50 GMT"}],"updateDate":"2024-07-02","timestamp":1719825590000,"abstract":"  The rapid advancement of Generative AI (GenAI) technologies offers\ntransformative opportunities within Australia's critical technologies of\nnational interest while introducing unique security challenges. This paper\npresents SecGenAI, a comprehensive security framework for cloud-based GenAI\napplications, with a focus on Retrieval-Augmented Generation (RAG) systems.\nSecGenAI addresses functional, infrastructure, and governance requirements,\nintegrating end-to-end security analysis to generate specifications emphasizing\ndata privacy, secure deployment, and shared responsibility models. Aligned with\nAustralian Privacy Principles, AI Ethics Principles, and guidelines from the\nAustralian Cyber Security Centre and Digital Transformation Agency, SecGenAI\nmitigates threats such as data leakage, adversarial attacks, and model\ninversion. The framework's novel approach combines advanced machine learning\ntechniques with robust security measures, ensuring compliance with Australian\nregulations while enhancing the reliability and trustworthiness of GenAI\nsystems. This research contributes to the field of intelligent systems by\nproviding actionable strategies for secure GenAI implementation in industry,\nfostering innovation in AI applications, and safeguarding national interests.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}