{"id":"2407.06300","title":"Assessing Exoplanetary System Architectures with DYNAMITE Including\n  Observational Upper Limits","authors":"Jamie Dietrich","authorsParsed":[["Dietrich","Jamie",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:08:25 GMT"}],"updateDate":"2024-07-10","timestamp":1720462105000,"abstract":"  The information gathered from observing planetary systems is not limited to\nthe discovery of planets, but also includes the observational upper limits\nconstraining the presence of any additional planets. Incorporating these upper\nlimits into statistical analyses of individual systems can significantly\nimprove our ability to find hidden planets in these systems by narrowing the\nparameter space in which to search. Here I include radial velocity (RV),\ntransit, and transit timing variation (TTV) upper limits on additional planets\nin known multi-planet systems into the DYNAMITE software package and test their\nimpact on the predicted planets for these systems. The tests are run on systems\nwith previous DYNAMITE analysis and with updated known planet parameters in the\n2-3 years since the original predictions. I find that the RV limits provide the\nstrongest constraints on additional planets, lowering the likelihood of finding\nthem within orbital periods of ~10-100 days in the inner planetary systems, as\nwell as truncating the likely planet size (radius and/or mass) distributions\ntowards planets smaller than those currently observed. Transit and TTV limits\nalso provide information on the size and inclination distributions of both the\nknown and predicted planets in the system. Utilizing these limits on a wider\nrange of systems in the near future will help determine which systems might be\nable to host temperate terrestrial planets and contribute to the search for\nextraterrestrial biosignatures.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}