{"id":"2407.02048","title":"Revolutionising Role-Playing Games with ChatGPT","authors":"Rita Stampfl, Barbara Geyer, Marie Deissl-O'Meara, Igor Ivki\\'c","authorsParsed":[["Stampfl","Rita",""],["Geyer","Barbara",""],["Deissl-O'Meara","Marie",""],["Ivkić","Igor",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 08:21:40 GMT"}],"updateDate":"2024-07-03","timestamp":1719908500000,"abstract":"  Digitalisation in education and its influence on teaching methods is the\nfocus of this study, which examines the use of ChatGPT in a role-playing game\nused in the Cloud Computing Engineering Master's programme at the University of\nApplied Sciences Burgenland. The aim of the study was to analyse the impact of\nAI-based simulations on students' learning experience. Based on Vygotsky's\nsociocultural theory, ChatGPT was used to give students a deeper understanding\nof strategic decision-making processes in simulated business scenarios. The\nmethodological approach included role-playing and qualitative content analysis\nof 20 student reflections. The findings suggest that ChatGPT enhances students'\nengagement, critical thinking, and communication skills, in addition to\ncontributing to the effective application of theoretical knowledge.\nFurthermore, simulations can contribute to the effective application of\ntheoretical knowledge. The results underscore the significance of adaptive\nteaching approaches in promoting digital literacy and equipping learners for\nthe digital workplace. The integration of AI into curricula and the need for\nongoing innovation in higher education are also emphasised as a means of\nguaranteeing excellent, future-focused instruction. The findings highlight the\npotential of AI and ChatGPT in particular, as an innovative cutting-edge\neducational tool that can both enhance the learning experience and help achieve\nthe Sustainable Development Goals (SDGs) through education.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gKml7_cn1nvmzs0f4_9tpuiqkESdDmm4rxZnW_WfORQ","pdfSize":"362278","objectId":"0xc20aa872813b2cfd00f28909695cd85eb5f3d3bda80cb7430423ddfaa034db3d","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
