{"id":"2407.11189","title":"A general and modular approach to solid-state integration and readout of\n  zero-dimensional quantum systems","authors":"Marzieh Kavand, Zoe Phillips, William H. Koll, Morgan Hamilton, Ethel\n  Perez-Hoyos, Rianna Greer, Ferdous Ara, Dan Pharis, Mehdi Maleki Sanukesh,\n  Mingyu Xu, Takashi Taniguchi, Paul Canfield, Michael E. Flatt\\'e, Danna E.\n  Freedman, Jay Gupta, Ezekiel Johnston-Halperin","authorsParsed":[["Kavand","Marzieh",""],["Phillips","Zoe",""],["Koll","William H.",""],["Hamilton","Morgan",""],["Perez-Hoyos","Ethel",""],["Greer","Rianna",""],["Ara","Ferdous",""],["Pharis","Dan",""],["Sanukesh","Mehdi Maleki",""],["Xu","Mingyu",""],["Taniguchi","Takashi",""],["Canfield","Paul",""],["Flatté","Michael E.",""],["Freedman","Danna E.",""],["Gupta","Jay",""],["Johnston-Halperin","Ezekiel",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 19:23:48 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 19:20:19 GMT"}],"updateDate":"2024-08-02","timestamp":1721071428000,"abstract":"  Electronic spectroscopy of zero-dimensional (0D) quantum systems, including\npoint defects in solids, atomic states, and small molecules, is a critical tool\nfor developing a fundamental understanding of these systems, with applications\nranging from solid-state and molecular materials development to emerging\ntechnologies rooted in quantum information science. Toward this end, scanning\ntunneling spectroscopy (STS) has demonstrated atomic-scale sensitivity, but is\nnot easily scalable for applications, whereas device-based approaches rely on\nembedding these systems within a solid-state tunnel junction (TJ) and are not\ngenerally applicable. Here we demonstrate an all-electrical readout mechanism\nfor these quasi-0D states that is modular and general, dramatically expanding\nthe phase space of accessible quantum systems and providing an approach that is\namenable to scaling and integration with other solid-state quantum\ntechnologies. Our approach relies on the creation of high-quality tunnel\njunctions via the mechanical exfoliation and stacking of multi-layer graphene\n(MLG) and hexagonal boron nitride (hBN) to encapsulate the target quantum\nsystem (QS) in an MLG/hBN/QS/hBN/MLG heterostructure. This structure allows for\nelectronic spectroscopy and readout of candidate quantum systems through a\ncombination of Coulomb and spin-blockade, providing access to entire classes of\nquantum systems that have previously only been accessible via optical\nspectroscopy or magnetic resonance measurements of large ensembles, if at all.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}