{"id":"2407.13674","title":"Observation of Ferromagnetic Phase in the Second Moir\\'e Band of Twisted\n  MoTe2","authors":"Liheng An, Haiyang Pan, Wen-Xuan Qiu, Naizhou Wang, Shihao Ru, Qinghai\n  Tan, Xuran Dai, Xiangbin Cai, Qiuyu Shang, Xiufang Lu, Hao Jiang, Xiaodan\n  Lyu, Kenji Watanabe, Takashi Taniguchi, Fengcheng Wu, Wei-bo Gao","authorsParsed":[["An","Liheng",""],["Pan","Haiyang",""],["Qiu","Wen-Xuan",""],["Wang","Naizhou",""],["Ru","Shihao",""],["Tan","Qinghai",""],["Dai","Xuran",""],["Cai","Xiangbin",""],["Shang","Qiuyu",""],["Lu","Xiufang",""],["Jiang","Hao",""],["Lyu","Xiaodan",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Wu","Fengcheng",""],["Gao","Wei-bo",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:50:37 GMT"}],"updateDate":"2024-07-19","timestamp":1721321437000,"abstract":"  Flat bands and electron correlation in moir\\'e lattices give rise to many\nexotic phases, including Mott insulators, superconductivity, and topological\nstates. Within the first moir\\'e band, integer and fractional quantum anomalous\nHall effects have been observed in twisted bilayer MoTe2 (tMoTe2) at one hole\ndoping and fractional doping per moir\\'e unit cell, respectively. When the\nsecond moir\\'e band is fully hole doped, quantum spin Hall insulator has also\nbeen reported in tMoTe2 at a certain twist angle. Exotic topological states\ntogether with ferromagnetic (FM) states in the high moir\\'e band can\npotentially exist as well. In this study, we report the observation of a FM\nphase in the second moir\\'e band in tMoTe2. The FM phase can be tuned by both\nthe doping level and displacement field. At filling around 2.58 holes per\nmoir\\'e unit cell, the FM phase reaches a Curie temperature of 3.5 K. A large\ndisplacement field can suppress the FM phase, like the FM phase at the filling\nof -1. Our results demonstrate the realization of time-reversal\nsymmetry-breaking states in the higher moir\\'e bands in tMoTe2.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"lVyJXBDvb8wx65mdY45P8Tz7p9ti5187T40wuMMMvSU","pdfSize":"2949312"}
