{"id":"2407.20761","title":"OmniBal: Towards Fast Instruct-tuning for Vision-Language Models via\n  Omniverse Computation Balance","authors":"Yongqiang Yao, Jingru Tan, Jiahao Hu, Feizhao Zhang, Xin Jin, Bo Li,\n  Ruihao Gong, Pengfei Liu","authorsParsed":[["Yao","Yongqiang",""],["Tan","Jingru",""],["Hu","Jiahao",""],["Zhang","Feizhao",""],["Jin","Xin",""],["Li","Bo",""],["Gong","Ruihao",""],["Liu","Pengfei",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 12:02:58 GMT"}],"updateDate":"2024-07-31","timestamp":1722340978000,"abstract":"  Recently, vision-language instruct-tuning models have made significant\nprogress due to their more comprehensive understanding of the world. In this\nwork, we discovered that large-scale 3D parallel training on those models leads\nto an imbalanced computation load across different devices. The vision and\nlanguage parts are inherently heterogeneous: their data distribution and model\narchitecture differ significantly, which affects distributed training\nefficiency. We rebalanced the computational loads from data, model, and memory\nperspectives to address this issue, achieving more balanced computation across\ndevices. These three components are not independent but are closely connected,\nforming an omniverse balanced training framework. Specifically, for the data,\nwe grouped instances into new balanced mini-batches within and across devices.\nFor the model, we employed a search-based method to achieve a more balanced\npartitioning. For memory optimization, we adaptively adjusted the\nre-computation strategy for each partition to utilize the available memory\nfully. We conducted extensive experiments to validate the effectiveness of our\nmethod. Compared with the open-source training code of InternVL-Chat, we\nsignificantly reduced GPU days, achieving about 1.8x speed-up. Our method's\nefficacy and generalizability were further demonstrated across various models\nand datasets. Codes will be released at https://github.com/ModelTC/OmniBal.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"GAwDN84DyrtplT3gAxXS1jFf-usQ3xkgdaYwn4ZkHXQ","pdfSize":"1062046","objectId":"0x1d54747f1230418de17e062aebc0b035addeaaab381f72cc80add64cc02320a6","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
