{"id":"2407.16511","title":"DreamVTON: Customizing 3D Virtual Try-on with Personalized Diffusion\n  Models","authors":"Zhenyu Xie and Haoye Dong and Yufei Gao and Zehua Ma and Xiaodan Liang","authorsParsed":[["Xie","Zhenyu",""],["Dong","Haoye",""],["Gao","Yufei",""],["Ma","Zehua",""],["Liang","Xiaodan",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:25:28 GMT"}],"updateDate":"2024-07-24","timestamp":1721744728000,"abstract":"  Image-based 3D Virtual Try-ON (VTON) aims to sculpt the 3D human according to\nperson and clothes images, which is data-efficient (i.e., getting rid of\nexpensive 3D data) but challenging. Recent text-to-3D methods achieve\nremarkable improvement in high-fidelity 3D human generation, demonstrating its\npotential for 3D virtual try-on. Inspired by the impressive success of\npersonalized diffusion models (e.g., Dreambooth and LoRA) for 2D VTON, it is\nstraightforward to achieve 3D VTON by integrating the personalization technique\ninto the diffusion-based text-to-3D framework. However, employing the\npersonalized module in a pre-trained diffusion model (e.g., StableDiffusion\n(SD)) would degrade the model's capability for multi-view or multi-domain\nsynthesis, which is detrimental to the geometry and texture optimization guided\nby Score Distillation Sampling (SDS) loss. In this work, we propose a novel\ncustomizing 3D human try-on model, named \\textbf{DreamVTON}, to separately\noptimize the geometry and texture of the 3D human. Specifically, a personalized\nSD with multi-concept LoRA is proposed to provide the generative prior about\nthe specific person and clothes, while a Densepose-guided ControlNet is\nexploited to guarantee consistent prior about body pose across various camera\nviews. Besides, to avoid the inconsistent multi-view priors from the\npersonalized SD dominating the optimization, DreamVTON introduces a\ntemplate-based optimization mechanism, which employs mask templates for\ngeometry shape learning and normal/RGB templates for geometry/texture details\nlearning. Furthermore, for the geometry optimization phase, DreamVTON\nintegrates a normal-style LoRA into personalized SD to enhance normal map\ngenerative prior, facilitating smooth geometry modeling.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}