{"id":"2407.00500","title":"Intrinsic PAPR for Point-level 3D Scene Albedo and Shading Editing","authors":"Alireza Moazeni, Shichong Peng, Ke Li","authorsParsed":[["Moazeni","Alireza",""],["Peng","Shichong",""],["Li","Ke",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 17:46:10 GMT"}],"updateDate":"2024-07-02","timestamp":1719683170000,"abstract":"  Recent advancements in neural rendering have excelled at novel view synthesis\nfrom multi-view RGB images. However, they often lack the capability to edit the\nshading or colour of the scene at a detailed point-level, while ensuring\nconsistency across different viewpoints. In this work, we address the challenge\nof point-level 3D scene albedo and shading editing from multi-view RGB images,\nfocusing on detailed editing at the point-level rather than at a part or global\nlevel. While prior works based on volumetric representation such as NeRF\nstruggle with achieving 3D consistent editing at the point level, recent\nadvancements in point-based neural rendering show promise in overcoming this\nchallenge. We introduce ``Intrinsic PAPR'', a novel method based on the recent\npoint-based neural rendering technique Proximity Attention Point Rendering\n(PAPR). Unlike other point-based methods that model the intrinsic decomposition\nof the scene, our approach does not rely on complicated shading models or\nsimplistic priors that may not universally apply. Instead, we directly model\nscene decomposition into albedo and shading components, leading to better\nestimation accuracy. Comparative evaluations against the latest point-based\ninverse rendering methods demonstrate that Intrinsic PAPR achieves\nhigher-quality novel view rendering and superior point-level albedo and shading\nediting.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Graphics","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}