{"id":"2407.14788","title":"On the Design and Analysis of LLM-Based Algorithms","authors":"Yanxi Chen, Yaliang Li, Bolin Ding, Jingren Zhou","authorsParsed":[["Chen","Yanxi",""],["Li","Yaliang",""],["Ding","Bolin",""],["Zhou","Jingren",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 07:39:07 GMT"}],"updateDate":"2024-07-23","timestamp":1721461147000,"abstract":"  We initiate a formal investigation into the design and analysis of LLM-based\nalgorithms, i.e. algorithms that contain one or multiple calls of large\nlanguage models (LLMs) as sub-routines and critically rely on the capabilities\nof LLMs. While LLM-based algorithms, ranging from basic LLM calls with prompt\nengineering to complicated LLM-powered agent systems and compound AI systems,\nhave achieved remarkable empirical success, the design and optimization of them\nhave mostly relied on heuristics and trial-and-errors, which is largely due to\na lack of formal and analytical study for these algorithms. To fill this gap,\nwe start by identifying the computational-graph representation of LLM-based\nalgorithms, the design principle of task decomposition, and some key\nabstractions, which then facilitate our formal analysis for the accuracy and\nefficiency of LLM-based algorithms, despite the black-box nature of LLMs. We\nfurther consider parallel decomposition for a case study, providing extensive\nanalytical and empirical study for four concrete examples of this pattern. Our\nproposed framework holds promise for advancing LLM-based algorithms, by\nrevealing the reasons behind curious empirical phenomena, guiding the choices\nof hyperparameters, predicting the empirical performance of algorithms, and\ninspiring new algorithm design. To promote further study of LLM-based\nalgorithms, we release our source code at\nhttps://github.com/modelscope/agentscope/tree/main/examples/paper_llm_based_algorithm.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}