{"id":"2407.01160","title":"Eight new 2+2 doubly eclipsing quadruple systems detected","authors":"P. Zasche, Z. Henzl, J. Merc, J. Kara, H. Kucakova","authorsParsed":[["Zasche","P.",""],["Henzl","Z.",""],["Merc","J.",""],["Kara","J.",""],["Kucakova","H.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 10:29:08 GMT"}],"updateDate":"2024-07-02","timestamp":1719829748000,"abstract":"  We studied eight new doubly eclipsing stellar systems. We found that they are\nall rare examples of quadruple systems of 2 + 2 architecture, where both inner\npairs are eclipsing binaries. Until now, such a configuration had only been\nproven for dozens of systems on the whole sky. We enlarged this rare group of\nsystems with four stars in the Small Magellanic Cloud (SMC) galaxy and four\nbrighter stars on the northern sky. These analysed systems are the following:\nOGLE SMC-ECL-2339 (both eclipsing periods of 0.72884 days and 3.39576 days;\nmutual orbital period of 5.95 years); OGLE SMC-ECL-3075 (1.35890 d, 2.41587 d,\n9.75 yr); OGLE SMC-ECL-4756 (0.91773 d, 2.06047 d, 4.34 yr); OGLE SMC-ECL-6093\n(0.90193 d, 2.03033 d, 31.2 yr); GSC 01949-01700 (0.24058 d, 0.75834 d, 21.7\nyr); ZTF J171602.61+273606.5 (0.36001 d, 4.51545 d, 19.5 yr); WISE\nJ210935.8+390501 (0.33228 d, 3.51575 d, 1.9 yr); and V597 And (0.46770 d,\n0.35250, 20.4 yr). These systems constitute a rare selection of W UMa stars\namong the doubly eclipsing quadruples. For all of the systems, new dedicated\nobservations were obtained as well. V597 And is definitely the most interesting\nsystem for several reasons: (1) the system is the brightest in our sample; (2)\nit is a rare quintuple (2 + 2) + 1 system; and (3) it is also closest to the\nSun. It yielded the predicted angular separation of the two components of 57\nmas, which is probably within the detection limits for modern,\nhigh-angular-resolution techniques.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}