{"id":"2407.21105","title":"Separating deterministic and stochastic gravitational wave signals in\n  realistic pulsar timing array datasets","authors":"Irene Ferranti, Golam Shaifullah, Aurelien Chalumeau and Alberto\n  Sesana","authorsParsed":[["Ferranti","Irene",""],["Shaifullah","Golam",""],["Chalumeau","Aurelien",""],["Sesana","Alberto",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 18:00:07 GMT"}],"updateDate":"2024-08-01","timestamp":1722362407000,"abstract":"  Recent observations by pulsar timing arrays indicate the presence of\ngravitational wave signals, likely from supermassive black hole binaries. These\nbinaries can produce two types of signals: a stochastic gravitational wave\nbackground (GWB) or deterministic continuous gravitational waves (CGW).\nCorrectly separating these signals is essential for accurate signal recovery\nand interpretation. This paper investigates the interaction between GWB and CGW\nsignals within current analysis pipelines, focusing on misinterpretations and\nbiases in parameter estimation when these signals are analyzed separately or\ntogether. We conducted several simulations based on the European PTA 24.8-year\ndataset. First, we injected either a GWB or a CGW. We compared parameter\nestimation using different search models, including Earth term only, combined\nEarth and pulsar term CGW templates, and correlated (HD) or uncorrelated (CURN)\npower law GWB templates. Our findings show that, when searched independently,\nthe GWB and CGW signals can be misinterpreted as each other, and only a\ncombined search can recover the true signal present. For datasets containing\nboth a GWB and a CGW, failure to account for the CGW biases the recovery of the\nGWB. However, a combined search allows for the recovery of both GWB and CGW\nparameters without significant bias. Care must be taken with the method used to\nperform combined searches on these multi-component datasets, as the CGW pulsar\nterm can be misinterpreted as a CURN. This can be avoided by direct searches\nfor an HD correlated GWB plus a CGW. Our study underscores the importance of\ncombined searches to ensure unbiased recovery of GWB parameters in the presence\nof strong CGWs, which is crucial for interpreting signals recently found in PTA\ndata and represents a step toward a robust framework for disentangling\nstochastic and deterministic GW signals in future, more sensitive datasets.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}