{"id":"2407.00957","title":"Expressivity of Neural Networks with Random Weights and Learned Biases","authors":"Ezekiel Williams, Avery Hee-Woon Ryoo, Thomas Jiralerspong, Alexandre\n  Payeur, Matthew G. Perich, Luca Mazzucato, Guillaume Lajoie","authorsParsed":[["Williams","Ezekiel",""],["Ryoo","Avery Hee-Woon",""],["Jiralerspong","Thomas",""],["Payeur","Alexandre",""],["Perich","Matthew G.",""],["Mazzucato","Luca",""],["Lajoie","Guillaume",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 04:25:49 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 14:48:36 GMT"}],"updateDate":"2024-07-03","timestamp":1719807949000,"abstract":"  Landmark universal function approximation results for neural networks with\ntrained weights and biases provided impetus for the ubiquitous use of neural\nnetworks as learning models in Artificial Intelligence (AI) and neuroscience.\nRecent work has pushed the bounds of universal approximation by showing that\narbitrary functions can similarly be learned by tuning smaller subsets of\nparameters, for example the output weights, within randomly initialized\nnetworks. Motivated by the fact that biases can be interpreted as biologically\nplausible mechanisms for adjusting unit outputs in neural networks, such as\ntonic inputs or activation thresholds, we investigate the expressivity of\nneural networks with random weights where only biases are optimized. We provide\ntheoretical and numerical evidence demonstrating that feedforward neural\nnetworks with fixed random weights can be trained to perform multiple tasks by\nlearning biases only. We further show that an equivalent result holds for\nrecurrent neural networks predicting dynamical system trajectories. Our results\nare relevant to neuroscience, where they demonstrate the potential for\nbehaviourally relevant changes in dynamics without modifying synaptic weights,\nas well as for AI, where they shed light on multi-task methods such as bias\nfine-tuning and unit masking.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Quantitative Biology/Neurons and Cognition","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}