{"id":"2407.06943","title":"A Starter's Kit for Concentric Tube Robots","authors":"Kalina Bonofiglio, Wenpeng Wang, Ethan R. Wilke, Adri Rajaraman, and\n  Loris Fichera","authorsParsed":[["Bonofiglio","Kalina",""],["Wang","Wenpeng",""],["Wilke","Ethan R.",""],["Rajaraman","Adri",""],["Fichera","Loris",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 15:19:13 GMT"}],"updateDate":"2024-07-10","timestamp":1720538353000,"abstract":"  Concentric Tube Robots (CTRs) have garnered significant interest within the\nsurgical robotics community because of their flexibility, dexterity, and ease\nof miniaturization. However, mastering the unique kinematics and design\nprinciples of CTRs can be challenging for newcomers to the field. In this\npaper, we present an educational kit aimed at lowering the barriers to entry\ninto concentric tube robot research. Our goal is to provide accessible learning\nresources for CTRs, bridging the knowledge gap between traditional robotic arms\nand these specialized devices. The proposed kit includes (1) An open-source\ndesign and assembly instructions for an economical (cost of materials $\\approx$\n700 USD) modular CTR; (2) A set of self-study materials to learn the basics of\nCTR modeling and control, including automatically-graded assignments. To\nevaluate the effectiveness of our educational kit, we conducted a human\nsubjects study involving first-year graduate students in engineering. Over a\nfour-week period, participants -- none of whom had any prior knowledge of\nconcentric tube robots -- successfully built their first CTR using the provided\nmaterials, implemented the robot's kinematics in MATLAB, and conducted a\ntip-tracking experiment with an optical tracking device. Our findings suggest\nthat the proposed kit facilitates learning and hands-on experience with CTRs,\nand furthermore, it has the potential to help early-stage graduate students get\nrapidly started with CTR research. By disseminating these resources, we hope to\nbroaden participation in concentric tube robot research to a wider a more\ndiverse group of researchers.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}