{"id":"2407.07073","title":"Enhanced $\\psi^{\\prime}$ yield and $\\psi^{\\prime}/(J/\\psi)$ yield ratio\n  as a possible signature of QGP formation in high multiplicity $p+p$\n  collisions","authors":"Partha Bagchi, Arpan Das, Ananta P. Mishra, Ankit Kumar Panda","authorsParsed":[["Bagchi","Partha",""],["Das","Arpan",""],["Mishra","Ananta P.",""],["Panda","Ankit Kumar",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 17:46:12 GMT"}],"updateDate":"2024-07-10","timestamp":1720547172000,"abstract":"  Suppression in the yield of quarkonia (heavy quark-antiquark bound states)\nhas been considered one of the important signatures of the formation of the\nthermalized deconfined partonic matter, also known as the Quark Gluon Plasma\n(QGP), in Relativistic Heavy Ion Collision Experiments (RHICE). Traditionally,\nthe in-medium dissociation of quarkonium states has been presented by\nimplicitly assuming an adiabatic approximation, which considers that the heavy\nquark Hamiltonian changes slowly over time owing to change in the medium.\nHowever, in high multiplicity smaller systems, such as in $p+p$ collisions, the\nearly development of transverse flow resulting from the finite transverse size\nof the locally thermalized medium may cause the quarkonium states to undergo a\nnon-adiabatic evolution. It has been argued that in the presence of such a\nnon-adiabatic evolution, the suppression of heavy quark-antiquark bound state\nyields may not reliably indicate QGP formation~\\cite{Bagchi:2023vfv}. We\npropose that, rather than concentrating on the suppression of $J/\\psi$ yields,\nthe enhancement in the yield ratio of $\\psi^{\\prime}$ to $J/\\psi$ (i.e.,\n$\\psi^{\\prime} / (J/\\psi)$), along with an increase in $\\psi^{\\prime}$ yield,\nshould be considered as a probe of QGP formation for small systems. Our\nfindings, based on realistic modeling of the time evolution of small systems,\nsuggest that the yield ratio $\\psi^{\\prime} / (J/\\psi)$ and the yield of\n$\\psi^{\\prime}$ increase as a function of hydrodynamization temperature\nincorporating the non-adiabatic transitions in high multiplicity $p+p$\ncollisions.\n","subjects":["Physics/Nuclear Theory","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/"}