{"id":"2407.13052","title":"Matchings, Predictions and Counterfactual Harm in Refugee Resettlement\n  Processes","authors":"Seungeon Lee, Nina Corvelo Benz, Suhas Thejaswi, Manuel\n  Gomez-Rodriguez","authorsParsed":[["Lee","Seungeon",""],["Benz","Nina Corvelo",""],["Thejaswi","Suhas",""],["Gomez-Rodriguez","Manuel",""]],"versions":[{"version":"v1","created":"Fri, 24 May 2024 19:51:01 GMT"}],"updateDate":"2024-07-19","timestamp":1716580261000,"abstract":"  Resettlement agencies have started to adopt data-driven algorithmic matching\nto match refugees to locations using employment rate as a measure of utility.\nGiven a pool of refugees, data-driven algorithmic matching utilizes a\nclassifier to predict the probability that each refugee would find employment\nat any given location. Then, it uses the predicted probabilities to estimate\nthe expected utility of all possible placement decisions. Finally, it finds the\nplacement decisions that maximize the predicted utility by solving a maximum\nweight bipartite matching problem. In this work, we argue that, using existing\nsolutions, there may be pools of refugees for which data-driven algorithmic\nmatching is (counterfactually) harmful -- it would have achieved lower utility\nthan a given default policy used in the past, had it been used. Then, we\ndevelop a post-processing algorithm that, given placement decisions made by a\ndefault policy on a pool of refugees and their employment outcomes, solves an\ninverse~matching problem to minimally modify the predictions made by a given\nclassifier. Under these modified predictions, the optimal matching policy that\nmaximizes predicted utility on the pool is guaranteed to be not harmful.\nFurther, we introduce a Transformer model that, given placement decisions made\nby a default policy on multiple pools of refugees and their employment\noutcomes, learns to modify the predictions made by a classifier so that the\noptimal matching policy that maximizes predicted utility under the modified\npredictions on an unseen pool of refugees is less likely to be harmful than\nunder the original predictions. Experiments on simulated resettlement processes\nusing synthetic refugee data created from a variety of publicly available data\nsuggest that our methodology may be effective in making algorithmic placement\ndecisions that are less likely to be harmful than existing solutions.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}