{"id":"2407.09240","title":"Skipping a beat: discovery of persistent quasi-periodic oscillations\n  associated with pulsed fraction drop of the spin signal in M51 ULX-7","authors":"Matteo Imbrogno, Sara Elisa Motta, Roberta Amato, Gian Luca Israel,\n  Guillermo Andres Rodr\\'iguez Castillo, Murray Brightman, Piergiorgio Casella,\n  Matteo Bachetti, Felix F\\\"urst, Luigi Stella, Ciro Pinto, Fabio Pintore,\n  Francesco Tombesi, Andr\\'es G\\'urpide, Matthew J. Middleton, Chiara\n  Salvaggio, Andrea Tiengo, Andrea Belfiore, Andrea De Luca, Paolo Esposito,\n  Anna Wolter, Hannah P. Earnshaw, Dominic J. Walton, Timothy P. Roberts, Luca\n  Zampieri, Martino Marelli, Ruben Salvaterra","authorsParsed":[["Imbrogno","Matteo",""],["Motta","Sara Elisa",""],["Amato","Roberta",""],["Israel","Gian Luca",""],["Castillo","Guillermo Andres Rodríguez",""],["Brightman","Murray",""],["Casella","Piergiorgio",""],["Bachetti","Matteo",""],["Fürst","Felix",""],["Stella","Luigi",""],["Pinto","Ciro",""],["Pintore","Fabio",""],["Tombesi","Francesco",""],["Gúrpide","Andrés",""],["Middleton","Matthew J.",""],["Salvaggio","Chiara",""],["Tiengo","Andrea",""],["Belfiore","Andrea",""],["De Luca","Andrea",""],["Esposito","Paolo",""],["Wolter","Anna",""],["Earnshaw","Hannah P.",""],["Walton","Dominic J.",""],["Roberts","Timothy P.",""],["Zampieri","Luca",""],["Marelli","Martino",""],["Salvaterra","Ruben",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 13:11:00 GMT"}],"updateDate":"2024-07-15","timestamp":1720789860000,"abstract":"  The discovery of pulsations in (at least) six ultraluminous X-ray sources\n(ULXs) has shown that neutron stars can accrete at (highly) super-Eddington\nrates, challenging the standard accretion theories. M51 ULX-7, with a spin\nsignal of $P\\simeq2.8$ s, is the pulsating ULX (PULX) with the shortest known\norbital period ($P_\\mathrm{orb}\\simeq2$ d) and has been observed multiple times\nby XMM-Newton, Chandra, and NuSTAR. We report on the timing and spectral\nanalyses of three XMM-Newton observations of M51 ULX-7 performed between the\nend of 2021 and the beginning of 2022, together with a timing re-analysis of\nXMM-Newton, Chandra, and NuSTAR archival observations. We investigated the spin\nsignal by applying accelerated search techniques and studied the power spectrum\nthrough the fast Fourier transform, looking for (a)periodic variability in the\nsource flux. We analysed the energy spectra of the 2021-2022 observations and\ncompared them to the older ones. We report the discovery of a recurrent,\nsignificant ($>$3$\\sigma$) broad complex at mHz frequencies in the power\nspectra of M51 ULX-7. We did not detect the spin signal, setting a 3$\\sigma$\nupper limit on the pulsed fraction of $\\lesssim10\\%$ for the single\nobservation. The complex is significantly detected also in five Chandra\nobservations performed in 2012. M51 ULX-7 represents the second PULX for which\nwe have a significant detection of mHz-QPOs at super-Eddington luminosities.\nThese findings suggest that one should avoid using the observed QPO frequency\nto infer the mass of the accretor in a ULX. The absence of spin pulsations when\nthe broad complex is detected suggests that the mechanism responsible for the\naperiodic modulation also dampens the spin signal's pulsed fraction. If true,\nthis represents an additional obstacle in the detection of new PULXs,\nsuggesting an even larger occurrence of PULXs among ULXs.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}