{"id":"2407.15529","title":"Environmental effects on Low Surface Brightness Galaxies in the\n  IllustrisTNG simulation","authors":"Luis Enrique P\\'erez-Monta\\~no, Bernardo Cervantes Sodi, Vicente\n  Rodriguez-Gomez, Qirong Zhu, Go Ogiya","authorsParsed":[["Pérez-Montaño","Luis Enrique",""],["Sodi","Bernardo Cervantes",""],["Rodriguez-Gomez","Vicente",""],["Zhu","Qirong",""],["Ogiya","Go",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 10:34:38 GMT"}],"updateDate":"2024-07-23","timestamp":1721644478000,"abstract":"  Employing the TNG100 run of the IllustrisTNG project, we characterize the\nenvironment of Low Surface Brightness Galaxies (LSBGs) across varying scales,\nfrom their associated dark matter halos to their distribution within the\nbroader cosmic structure. We find no significant differences in the halo\nconcentration index $c_{200}$ between LSBGs and their High Surface Brightness\n(HSBGs) counterparts, with LSBGs residing in halos with higher spin parameter\n$\\lambda$ and slightly more spherical shapes than HSBGs. LSBGs show a stronger\nalignment between the dark and stellar angular momentum vectors than their high\nsurface brightness counterparts. The relative abundance of LSBGs within groups\nand clusters displays a central deficit, hinting at potential destruction upon\nreaching these core regions. Studying the density field, we find a preference\nfor rotation-dominated LSBGs to reside in low-density environments, while\ndispersion-dominated LSBGs thrive in high-density regions where galaxy\ninteractions govern their evolution, an observation corroborated by our\nanalysis of the two-point correlation function $\\xi (r)$. Our examination of\nthe cosmic web reveals no significant differences in the distance to the\nclosest large-scale structure, barring a few exceptions. This suggests a\nlimited impact of large-scale spatial distribution on mechanisms driving LSBG\nevolution. All together, we conclude that the halo vicinity and local\nenvironment at the scale of galaxy clusters, where mechanisms such as galaxy\nmergers and tidal stripping, as well as stellar and gas accretion take place,\nis the most likely environment that favour the emergence of LSBGs with\ndifferent morphologies, mostly driven by the presence or absence of important\nlocal interaction phenomena.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}