{"id":"2407.10686","title":"Beyond the horizon: Quantifying the full sky foreground wedge in the\n  cylindrical power spectrum","authors":"S. Munshi, F. G. Mertens, L. V. E. Koopmans, A. R. Offringa, E.\n  Ceccotti, S. A. Brackenhoff, J. K. Chege, B. K. Gehlot, S. Ghosh, C. H\\\"ofer,\n  M. Mevius","authorsParsed":[["Munshi","S.",""],["Mertens","F. G.",""],["Koopmans","L. V. E.",""],["Offringa","A. R.",""],["Ceccotti","E.",""],["Brackenhoff","S. A.",""],["Chege","J. K.",""],["Gehlot","B. K.",""],["Ghosh","S.",""],["Höfer","C.",""],["Mevius","M.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 13:01:26 GMT"}],"updateDate":"2024-07-16","timestamp":1721048486000,"abstract":"  One of the main obstacles preventing the detection of the redshifted 21-cm\nsignal from neutral hydrogen in the early Universe is the astrophysical\nforeground emission, which is several orders of magnitude brighter than the\nsignal. The foregrounds, due to their smooth spectra, are expected to\npredominantly occupy a region in the cylindrical power spectrum known as the\nforeground wedge. However, the conventional equations describing the extent of\nthe foreground wedge are derived under a flat-sky approximation. This\nassumption breaks down for tracking wide-field instruments, thus rendering\nthese equations inapplicable in these situations. In this paper, we derive\nequations for the full sky foreground wedge and show that the foregrounds can\npotentially extend far beyond what the conventional equations suggest. We also\nderive the equations that describe a specific bright source in the cylindrical\npower spectrum space. The validity of both sets of equations is tested against\nnumerical simulations. Many current and upcoming interferometers (e.g., LOFAR,\nNenuFAR, MWA, SKA) are wide-field phase-tracking instruments. These equations\ngive us new insights into the nature of foreground contamination in the\ncylindrical power spectra estimated using wide-field instruments. Additionally,\nthey allow us to accurately associate features in the power spectrum to\nforegrounds or instrumental effects. The equations are also important for\ncorrectly selecting the \"EoR window\" for foreground avoidance analyses, and for\nplanning 21-cm observations. In future analyses, it is recommended to use these\nupdated horizon lines to indicate the foreground wedge in the cylindrical power\nspectrum accurately. The new equations for generating the updated wedge lines\nare made available in a Python library, pslines.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}