{"id":"2407.13404","title":"Measuring Phonon Dispersion and Electron-Phason Coupling in Twisted\n  Bilayer Graphene with a Cryogenic Quantum Twisting Microscope","authors":"John Birkbeck, Jiewen Xiao, Alon Inbar, Takashi Taniguchi, Kenji\n  Watanabe, Erez Berg, Leonid Glazman, Francisco Guinea, Felix von Oppen,\n  Shahal Ilani","authorsParsed":[["Birkbeck","John",""],["Xiao","Jiewen",""],["Inbar","Alon",""],["Taniguchi","Takashi",""],["Watanabe","Kenji",""],["Berg","Erez",""],["Glazman","Leonid",""],["Guinea","Francisco",""],["von Oppen","Felix",""],["Ilani","Shahal",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 11:13:58 GMT"}],"updateDate":"2024-07-19","timestamp":1721301238000,"abstract":"  The coupling between electrons and phonons is one of the fundamental\ninteractions in solids, underpinning a wide range of phenomena such as\nresistivity, heat conductivity, and superconductivity. However, direct\nmeasurements of this coupling for individual phonon modes remains a significant\nchallenge. In this work, we introduce a novel technique for mapping phonon\ndispersions and electron phonon coupling (EPC) in van der Waals materials. By\ngeneralizing the quantum twisting microscope to cryogenic temperatures, we\ndemonstrate its capability to map not only electronic dispersions via elastic\nmomentum-conserving tunnelling, but also phononic dispersions through inelastic\nmomentum-conserving tunnelling. Crucially, the inelastic tunnelling strength\nprovides a direct and quantitative measure of the momentum and mode resolved\nEPC. We use this technique to measure the phonon spectrum and EPC of twisted\nbilayer graphene (TBG). Surprisingly, we find that unlike standard acoustic\nphonons, whose coupling to electrons diminishes as their momentum goes to zero,\nTBG exhibits a low energy mode whose coupling increases with decreasing twist\nangle. We show that this unusual coupling arises from the modulation of the\ninter-layer tunnelling by a layer-antisymmetric 'phason' mode of the moir\\'e\nsystem. The technique demonstrated here opens the way for probing a large\nvariety of other neutral collective modes that couple to electronic tunnelling,\nincluding plasmons, magnons and spinons in quantum materials.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"H1S5Rvzclz48iO4BNn0ANFYZj738wq1eFoD9PIByzaI","pdfSize":"6165662"}
