{"id":"2407.08316","title":"Enhancing ADHD Diagnosis with EEG: The Critical Role of Preprocessing\n  and Key Features","authors":"Sandra Garc\\'ia-Ponsoda, Alejandro Mat\\'e, Juan Trujillo","authorsParsed":[["García-Ponsoda","Sandra",""],["Maté","Alejandro",""],["Trujillo","Juan",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 09:07:22 GMT"}],"updateDate":"2024-07-12","timestamp":1720688842000,"abstract":"  Background: Attention-Deficit/Hyperactivity Disorder (ADHD) is a prevalent\nneurodevelopmental disorder that significantly impacts various key aspects of\nlife, requiring accurate diagnostic methods. Electroencephalogram (EEG) signals\nare used in diagnosing ADHD, but proper preprocessing is crucial to avoid noise\nand artifacts that could lead to unreliable results.\n  Method: This study utilized a public EEG dataset from children diagnosed with\nADHD and typically developing (TD) children. Four preprocessing techniques were\napplied: no preprocessing (Raw), Finite Impulse Response (FIR) filtering,\nArtifact Subspace Reconstruction (ASR), and Independent Component Analysis\n(ICA). EEG recordings were segmented, and features were extracted and selected\nbased on statistical significance. Classification was performed using Machine\nLearning models, as XGBoost, Support Vector Machine, and K-Nearest Neighbors.\n  Results: The absence of preprocessing leads to artificially high\nclassification accuracy due to noise. In contrast, ASR and ICA preprocessing\ntechniques significantly improved the reliability of results. Segmenting EEG\nrecordings revealed that later segments provided better classification\naccuracy, likely due to the manifestation of ADHD symptoms over time. The most\nrelevant EEG channels were P3, P4, and C3. The top features for classification\nincluded Kurtosis, Katz fractal dimension, and power spectral density of Delta,\nTheta, and Alpha bands.\n  Conclusions: Effective preprocessing is essential in EEG-based ADHD diagnosis\nto prevent noise-induced biases. This study identifies crucial EEG channels and\nfeatures, providing a foundation for further research and improving ADHD\ndiagnostic accuracy. Future work should focus on expanding datasets, refining\npreprocessing methods, and enhancing feature interpretability to improve\ndiagnostic accuracy and model robustness for clinical use.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Tix1l01xpZpIXDomyFqion-yWwu-Fxir1lU5Yi_31n8","pdfSize":"9138204"}
