{"id":"2407.06915","title":"FE-GUT: Factor Graph Optimization hybrid with Extended Kalman Filter for\n  tightly coupled GNSS/UWB Integration","authors":"Qijia Zhao, Shaolin L\\\"u, Jianan Lou, Rong Zhang","authorsParsed":[["Zhao","Qijia",""],["Lü","Shaolin",""],["Lou","Jianan",""],["Zhang","Rong",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 14:50:14 GMT"}],"updateDate":"2024-07-10","timestamp":1720536614000,"abstract":"  Precise positioning and navigation information has been increasingly\nimportant with the development of the consumer electronics market. Due to some\ndeficits of Global Navigation Satellite System (GNSS), such as susceptible to\ninterferences, integrating of GNSS with additional alternative sensors is a\npromising approach to overcome the performance limitations of GNSS-based\nlocalization systems. Ultra-Wideband (UWB) can be used to enhance GNSS in\nconstructing an integrated localization system. However, most low-cost UWB\ndevices lack a hardware-level time synchronization feature, which necessitates\nthe estimation and compensation of the time-offset in the tightly coupled\nGNSS/UWB integration. Given the flexibility of probabilistic graphical models,\nthe time-offset can be modeled as an invariant constant in the discretization\nof the continuous model. This work proposes a novel architecture in which\nFactor Graph Optimization (FGO) is hybrid with Extend Kalman Filter (EKF) for\ntightly coupled GNSS/UWB integration with online Temporal calibration (FE-GUT).\nFGO is utilized to precisely estimate the time-offset, while EKF provides\ninitailization for the new factors and performs time-offset compensation.\nSimulation-based experiments validate the integrated localization performance\nof FE-GUT. In a four-wheeled robot scenario, the results demonstrate that,\ncompared to EKF, FE-GUT can improve horizontal and vertical localization\naccuracy by 58.59\\% and 34.80\\%, respectively, while the time-offset estimation\naccuracy is improved by 76.80\\%. All the source codes and datasets can be\ngotten via https://github.com/zhaoqj23/FE-GUT/.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}