{"id":"2407.09772","title":"Valid standard errors for Bayesian quantile regression with clustered\n  and independent data","authors":"Feng Ji, JoonHo Lee, Sophia Rabe-Hesketh","authorsParsed":[["Ji","Feng",""],["Lee","JoonHo",""],["Rabe-Hesketh","Sophia",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 04:58:28 GMT"}],"updateDate":"2024-07-16","timestamp":1720846708000,"abstract":"  In Bayesian quantile regression, the most commonly used likelihood is the\nasymmetric Laplace (AL) likelihood. The reason for this choice is not that it\nis a plausible data-generating model but that the corresponding maximum\nlikelihood estimator is identical to the classical estimator by Koenker and\nBassett (1978), and in that sense, the AL likelihood can be thought of as a\nworking likelihood. AL-based quantile regression has been shown to produce good\nfinite-sample Bayesian point estimates and to be consistent. However, if the AL\ndistribution does not correspond to the data-generating distribution, credible\nintervals based on posterior standard deviations can have poor coverage. Yang,\nWang, and He (2016) proposed an adjustment to the posterior covariance matrix\nthat produces asymptotically valid intervals. However, we show that this\nadjustment is sensitive to the choice of scale parameter for the AL likelihood\nand can lead to poor coverage when the sample size is small to moderate. We\ntherefore propose using Infinitesimal Jackknife (IJ) standard errors (Giordano\n& Broderick, 2023). These standard errors do not require resampling but can be\nobtained from a single MCMC run. We also propose a version of IJ standard\nerrors for clustered data. Simulations and applications to real data show that\nthe IJ standard errors have good frequentist properties, both for independent\nand clustered data. We provide an R-package that computes IJ standard errors\nfor clustered or independent data after estimation with the brms wrapper in R\nfor Stan.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}