{"id":"2407.06469","title":"Sketch-Guided Scene Image Generation","authors":"Tianyu Zhang, Xiaoxuan Xie, Xusheng Du, Haoran Xie","authorsParsed":[["Zhang","Tianyu",""],["Xie","Xiaoxuan",""],["Du","Xusheng",""],["Xie","Haoran",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 00:16:45 GMT"}],"updateDate":"2024-07-10","timestamp":1720484205000,"abstract":"  Text-to-image models are showcasing the impressive ability to create\nhigh-quality and diverse generative images. Nevertheless, the transition from\nfreehand sketches to complex scene images remains challenging using diffusion\nmodels. In this study, we propose a novel sketch-guided scene image generation\nframework, decomposing the task of scene image scene generation from sketch\ninputs into object-level cross-domain generation and scene-level image\nconstruction. We employ pre-trained diffusion models to convert each single\nobject drawing into an image of the object, inferring additional details while\nmaintaining the sparse sketch structure. In order to maintain the conceptual\nfidelity of the foreground during scene generation, we invert the visual\nfeatures of object images into identity embeddings for scene generation. In\nscene-level image construction, we generate the latent representation of the\nscene image using the separated background prompts, and then blend the\ngenerated foreground objects according to the layout of the sketch input. To\nensure the foreground objects' details remain unchanged while naturally\ncomposing the scene image, we infer the scene image on the blended latent\nrepresentation using a global prompt that includes the trained identity tokens.\nThrough qualitative and quantitative experiments, we demonstrate the ability of\nthe proposed approach to generate scene images from hand-drawn sketches\nsurpasses the state-of-the-art approaches.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/"}