{"id":"2407.13497","title":"Observation of surface Fermi arcs in altermagnetic Weyl semimetal CrSb","authors":"Wenlong Lu, Shiyu Feng, Yuzhi Wang, Dong Chen, Zihan Lin, Xin Liang,\n  Siyuan Liu, Wanxiang Feng, Kohei Yamagami, Junwei Liu, Claudia Felser,\n  Quansheng Wu, Junzhang Ma","authorsParsed":[["Lu","Wenlong",""],["Feng","Shiyu",""],["Wang","Yuzhi",""],["Chen","Dong",""],["Lin","Zihan",""],["Liang","Xin",""],["Liu","Siyuan",""],["Feng","Wanxiang",""],["Yamagami","Kohei",""],["Liu","Junwei",""],["Felser","Claudia",""],["Wu","Quansheng",""],["Ma","Junzhang",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 13:28:50 GMT"}],"updateDate":"2024-07-19","timestamp":1721309330000,"abstract":"  As a special type of collinear antiferromagnetism (AFM), altermagnetism has\ngarnered significant research interest recently. Altermagnets exhibit broken\nparity-time symmetry and zero net magnetization in real space, leading to\nsubstantial band splitting in momentum space even in the absence of spin-orbit\ncoupling. Meanwhile, parity-time symmetry breaking always induce nontrivial\nband topology such as Weyl nodes. While Weyl semimetal states and nodal lines\nhave been theoretically proposed in altermagnets, rare reports of experimental\nobservation have been made up to this point. Using ARPES and first-principles\ncalculations, we systematically studied the electronic structure of the\nroom-temperature altermagnet candidate CrSb. At generic locations in momentum\nspace, we clearly observed band spin splitting. Furthermore, we identified\ndiscrete surface Fermi arcs on the (100) cleaved side surface close to the\nFermi level originating from bulk band topology. Our results imply that CrSb\ncontains interesting nontrivial topological Weyl physics, in addition to being\nan excellent room temperature altermagnet.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Other Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VvVIeU7zJXWi9tBprHmekb6rTR-4-cU6QYzKdVafCHI","pdfSize":"2072356"}
