{"id":"2407.11243","title":"Representation Learning and Identity Adversarial Training for Facial\n  Behavior Understanding","authors":"Mang Ning, Albert Ali Salah, Itir Onal Ertugrul","authorsParsed":[["Ning","Mang",""],["Salah","Albert Ali",""],["Ertugrul","Itir Onal",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 21:13:28 GMT"}],"updateDate":"2024-07-17","timestamp":1721078008000,"abstract":"  Facial Action Unit (AU) detection has gained significant research attention\nas AUs contain complex expression information. In this paper, we unpack two\nfundamental factors in AU detection: data and subject identity regularization,\nrespectively. Motivated by recent advances in foundation models, we highlight\nthe importance of data and collect a diverse dataset Face9M, comprising 9\nmillion facial images, from multiple public resources. Pretraining a masked\nautoencoder on Face9M yields strong performance in AU detection and facial\nexpression tasks. We then show that subject identity in AU datasets provides a\nshortcut learning for the model and leads to sub-optimal solutions to AU\npredictions. To tackle this generic issue of AU tasks, we propose Identity\nAdversarial Training (IAT) and demonstrate that a strong IAT regularization is\nnecessary to learn identity-invariant features. Furthermore, we elucidate the\ndesign space of IAT and empirically show that IAT circumvents the identity\nshortcut learning and results in a better solution. Our proposed methods,\nFacial Masked Autoencoder (FMAE) and IAT, are simple, generic and effective.\nRemarkably, the proposed FMAE-IAT approach achieves new state-of-the-art F1\nscores on BP4D (67.1\\%), BP4D+ (66.8\\%), and DISFA (70.1\\%) databases,\nsignificantly outperforming previous work. We release the code and model at\nhttps://github.com/forever208/FMAE-IAT, the first open-sourced facial model\npretrained on 9 million diverse images.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}