{"id":"2407.07259","title":"Fuzzy Spheres in Stringy Matrix Models: Quantifying Chaos in a Mixed\n  Phase Space","authors":"Paolo Amore, Leopoldo A. Pando Zayas, Juan F. Pedraza, Norma Quiroz\n  and C\\'esar A. Terrero-Escalante","authorsParsed":[["Amore","Paolo",""],["Zayas","Leopoldo A. Pando",""],["Pedraza","Juan F.",""],["Quiroz","Norma",""],["Terrero-Escalante","César A.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 22:26:50 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 15:25:16 GMT"}],"updateDate":"2024-08-22","timestamp":1720564010000,"abstract":"  We consider a truncation of the BMN matrix model to a configuration of two\nfuzzy spheres, described by two coupled non-linear oscillators dependent on the\nmass parameter $\\mu$. The classical phase diagram of the system generically\n($\\mu \\neq 0$) contains three equilibrium points: two centers and a\ncenter-saddle; as $\\mu \\to 0$ the system exhibits a pitchfork bifurcation. We\ndemonstrate that the system is exactly integrable in quadratures for $\\mu=0$,\nwhile for very large values of $\\mu$, it approaches another integrable point\ncharacterized by two harmonic oscillators. The classical phase space is mixed,\ncontaining both integrable islands and chaotic regions, as evidenced by the\nclassical Lyapunov spectrum. At the quantum level, we explore indicators of\nearly and late time chaos. The eigenvalue spacing is best described by a Brody\ndistribution, which interpolates between Poisson and Wigner distributions; it\ndovetails, at the quantum level, the classical results and reemphasizes the\nnotion that the quantum system is mixed. We also study the spectral form factor\nand the quantum Lyapunov exponent, as defined by out-of-time-ordered\ncorrelators. These two indicators of quantum chaos exhibit weak correlations\nwith the Brody distribution. We speculate that the behavior of the system as\n$\\mu \\to 0$ dominates the spectral form factor and the quantum Lyapunov\nexponent, making these indicators of quantum chaos less effective in the\ncontext of a mixed phase space.\n","subjects":["Physics/High Energy Physics - Theory","Nonlinear Sciences/Chaotic Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}