{"id":"2407.11705","title":"Snail-Radar: A large-scale diverse dataset for the evaluation of\n  4D-radar-based SLAM systems","authors":"Jianzhu Huai, Binliang Wang, Yuan Zhuang, Yiwen Chen, Qipeng Li,\n  Yulong Han, Charles Toth","authorsParsed":[["Huai","Jianzhu",""],["Wang","Binliang",""],["Zhuang","Yuan",""],["Chen","Yiwen",""],["Li","Qipeng",""],["Han","Yulong",""],["Toth","Charles",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 13:22:33 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 12:34:22 GMT"}],"updateDate":"2024-07-23","timestamp":1721136153000,"abstract":"  4D radars are increasingly favored for odometry and mapping of autonomous\nsystems due to their robustness in harsh weather and dynamic environments.\nExisting datasets, however, often cover limited areas and are typically\ncaptured using a single platform. To address this gap, we present a diverse\nlarge-scale dataset specifically designed for 4D radar-based localization and\nmapping. This dataset was gathered using three different platforms: a handheld\ndevice, an e-bike, and an SUV, under a variety of environmental conditions,\nincluding clear days, nighttime, and heavy rain. The data collection occurred\nfrom September 2023 to February 2024, encompassing diverse settings such as\nroads in a vegetated campus and tunnels on highways. Each route was traversed\nmultiple times to facilitate place recognition evaluations. The sensor suite\nincluded a 3D lidar, 4D radars, stereo cameras, consumer-grade IMUs, and a\nGNSS/INS system. Sensor data packets were synchronized to GNSS time using a\ntwo-step process: a convex hull algorithm was applied to smooth host time\njitter, and then odometry and correlation algorithms were used to correct\nconstant time offsets. Extrinsic calibration between sensors was achieved\nthrough manual measurements and subsequent nonlinear optimization. The\nreference motion for the platforms was generated by registering lidar scans to\na terrestrial laser scanner (TLS) point cloud map using a lidar inertial\nodometry (LIO) method in localization mode. Additionally, a data reversion\ntechnique was introduced to enable backward LIO processing. We believe this\ndataset will boost research in radar-based point cloud registration, odometry,\nmapping, and place recognition.\n","subjects":["Computing Research Repository/Robotics","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"9GQu0kQZnGqAEMHwDWWy7IRoK8wzl4dYgl6ll2psm6U","pdfSize":"43513929"}
