{"id":"2407.19682","title":"GradCraft: Elevating Multi-task Recommendations through Holistic\n  Gradient Crafting","authors":"Yimeng Bai, Yang Zhang, Fuli Feng, Jing Lu, Xiaoxue Zang, Chenyi Lei,\n  Yang Song","authorsParsed":[["Bai","Yimeng",""],["Zhang","Yang",""],["Feng","Fuli",""],["Lu","Jing",""],["Zang","Xiaoxue",""],["Lei","Chenyi",""],["Song","Yang",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 03:54:00 GMT"}],"updateDate":"2024-07-30","timestamp":1722225240000,"abstract":"  Recommender systems require the simultaneous optimization of multiple\nobjectives to accurately model user interests, necessitating the application of\nmulti-task learning methods. However, existing multi-task learning methods in\nrecommendations overlook the specific characteristics of recommendation\nscenarios, falling short in achieving proper gradient balance. To address this\nchallenge, we set the target of multi-task learning as attaining the\nappropriate magnitude balance and the global direction balance, and propose an\ninnovative methodology named GradCraft in response. GradCraft dynamically\nadjusts gradient magnitudes to align with the maximum gradient norm, mitigating\ninterference from gradient magnitudes for subsequent manipulation. It then\nemploys projections to eliminate gradient conflicts in directions while\nconsidering all conflicting tasks simultaneously, theoretically guaranteeing\nthe global resolution of direction conflicts. GradCraft ensures the concurrent\nachievement of appropriate magnitude balance and global direction balance,\naligning with the inherent characteristics of recommendation scenarios. Both\noffline and online experiments attest to the efficacy of GradCraft in enhancing\nmulti-task performance in recommendations. The source code for GradCraft can be\naccessed at https://github.com/baiyimeng/GradCraft.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}