{"id":"2407.14559","title":"Predicting Star Scientists in the Field of Artificial Intelligence: A\n  Machine Learning Approach","authors":"Koosha Shirouyeh and Andrea Schiffauerova and Ashkan Ebadi","authorsParsed":[["Shirouyeh","Koosha",""],["Schiffauerova","Andrea",""],["Ebadi","Ashkan",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:50:18 GMT"}],"updateDate":"2024-07-23","timestamp":1721321418000,"abstract":"  Star scientists are highly influential researchers who have made significant\ncontributions to their field, gained widespread recognition, and often\nattracted substantial research funding. They are critical for the advancement\nof science and innovation, and they have a significant influence on the\ntransfer of knowledge and technology to industry. Identifying potential star\nscientists before their performance becomes outstanding is important for\nrecruitment, collaboration, networking, or research funding decisions. Using\nmachine learning techniques, this study proposes a model to predict star\nscientists in the field of artificial intelligence while highlighting features\nrelated to their success. Our results confirm that rising stars follow\ndifferent patterns compared to their non-rising stars counterparts in almost\nall the early-career features. We also found that certain features such as\ngender and ethnic diversity play important roles in scientific collaboration\nand that they can significantly impact an author's career development and\nsuccess. The most important features in predicting star scientists in the field\nof artificial intelligence were the number of articles, group discipline\ndiversity, and weighted degree centrality. The proposed approach offers\nvaluable insights for researchers, practitioners, and funding agencies\ninterested in identifying and supporting talented researchers.\n","subjects":["Computing Research Repository/Other Computer Science","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}