{"id":"2407.01904","title":"From Directed Steiner Tree to Directed Polymatroid Steiner Tree in\n  Planar Graphs","authors":"Chandra Chekuri, Rhea Jain, Shubhang Kulkarni, Da Wei Zheng, Weihao\n  Zhu","authorsParsed":[["Chekuri","Chandra",""],["Jain","Rhea",""],["Kulkarni","Shubhang",""],["Zheng","Da Wei",""],["Zhu","Weihao",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 03:08:58 GMT"}],"updateDate":"2024-07-03","timestamp":1719889738000,"abstract":"  In the Directed Steiner Tree (DST) problem the input is a directed\nedge-weighted graph $G=(V,E)$, a root vertex $r$ and a set $S \\subseteq V$ of\n$k$ terminals. The goal is to find a min-cost subgraph that connects $r$ to\neach of the terminals. DST admits an $O(\\log^2 k/\\log \\log k)$-approximation in\nquasi-polynomial time, and an $O(k^{\\epsilon})$-approximation for any fixed\n$\\epsilon > 0$ in polynomial-time. Resolving the existence of a polynomial-time\npoly-logarithmic approximation is a major open problem in approximation\nalgorithms. In a recent work, Friggstad and Mousavi [ICALP 2023] obtained a\nsimple and elegant polynomial-time $O(\\log k)$-approximation for DST in planar\ndigraphs via Thorup's shortest path separator theorem. We build on their work\nand obtain several new results on DST and related problems.\n  - We develop a tree embedding technique for rooted problems in planar\ndigraphs via an interpretation of the recursion in Friggstad and Mousavi [ICALP\n2023]. Using this we obtain polynomial-time poly-logarithmic approximations for\nGroup Steiner Tree, Covering Steiner Tree, and the Polymatroid Steiner Tree\nproblems in planar digraphs. All these problems are hard to approximate to\nwithin a factor of $\\Omega(\\log^2 n/\\log \\log n)$ even in trees.\n  - We prove that the natural cut-based LP relaxation for DST has an\nintegrality gap of $O(\\log^2 k)$ in planar graphs. This is in contrast to\ngeneral graphs where the integrality gap of this LP is known to be $\\Omega(k)$\nand $\\Omega(n^{\\delta})$ for some fixed $\\delta > 0$.\n  - We combine the preceding results with density based arguments to obtain\npoly-logarithmic approximations for the multi-rooted versions of the problems\nin planar digraphs. For DST our result improves the $O(R + \\log k)$\napproximation of Friggstad and Mousavi [ICALP 2023] when $R= \\omega(\\log^2 k)$.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}