{"id":"2407.02551","title":"A False Sense of Safety: Unsafe Information Leakage in 'Safe' AI\n  Responses","authors":"David Glukhov, Ziwen Han, Ilia Shumailov, Vardan Papyan, Nicolas\n  Papernot","authorsParsed":[["Glukhov","David",""],["Han","Ziwen",""],["Shumailov","Ilia",""],["Papyan","Vardan",""],["Papernot","Nicolas",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 16:19:25 GMT"}],"updateDate":"2024-07-04","timestamp":1719937165000,"abstract":"  Large Language Models (LLMs) are vulnerable to\njailbreaks$\\unicode{x2013}$methods to elicit harmful or generally impermissible\noutputs. Safety measures are developed and assessed on their effectiveness at\ndefending against jailbreak attacks, indicating a belief that safety is\nequivalent to robustness. We assert that current defense mechanisms, such as\noutput filters and alignment fine-tuning, are, and will remain, fundamentally\ninsufficient for ensuring model safety. These defenses fail to address risks\narising from dual-intent queries and the ability to composite innocuous outputs\nto achieve harmful goals. To address this critical gap, we introduce an\ninformation-theoretic threat model called inferential adversaries who exploit\nimpermissible information leakage from model outputs to achieve malicious\ngoals. We distinguish these from commonly studied security adversaries who only\nseek to force victim models to generate specific impermissible outputs. We\ndemonstrate the feasibility of automating inferential adversaries through\nquestion decomposition and response aggregation. To provide safety guarantees,\nwe define an information censorship criterion for censorship mechanisms,\nbounding the leakage of impermissible information. We propose a defense\nmechanism which ensures this bound and reveal an intrinsic safety-utility\ntrade-off. Our work provides the first theoretically grounded understanding of\nthe requirements for releasing safe LLMs and the utility costs involved.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Cg3tDUtFMmP3uSo7ftpqs_E6PdQPnBAMIsT__1kDtYg","pdfSize":"1838178"}
