{"id":"2407.10642","title":"On the uncertainty of the White Dwarf Astrophysical Gravitational Wave\n  Background","authors":"Sophie Hofman (1), Gijs Nelemans (1, 2 and 3) ((1) Radboud University,\n  (2) KU Leuven, (3) SRON)","authorsParsed":[["Hofman","Sophie","","1, 2 and 3"],["Nelemans","Gijs","","1, 2 and 3"]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 12:01:16 GMT"}],"updateDate":"2024-07-16","timestamp":1721044876000,"abstract":"  The astrophysical gravitational wave background (AGWB) is a stochastic GW\nsignal that is emitted by different populations of inspiralling binary systems\ncontaining compact objects. In the frequency range between 10^{-4} and 10^{-1}\nHz it will be detected by future space-based gravitational wave detectors like\nthe Laser Interferometer Space Antenna (LISA). Recently, Staelens & Nelemans\n2024 (SN24) concluded that the white dwarf (WD) contribution to the AGWB\ndominates over that of black holes (BHs).\n  We aim to investigate the uncertainties of the WD AGWB that arise from the\nuse of different stellar metallicities, different star formation rate density\n(SFRD) models, and different binary evolution models.\n  We use the code developed by SN24 to determine the WD component of the AGWB.\nWe use a metallicity dependent SFRD based on Chruslinska et al (2019,2020,2021)\nto construct five different SFRD models. We use four different population\nmodels that use different common-envelope treatment and six different\nmetallicities for each model.\n  For all possible combinations, the WD component of the AGWB is dominant over\nother populations of compact objects. The effects of metallicity and population\nmodel are smaller than the effect of a (metallicity dependent) SFRD model. We\nfind a range of about a factor of 5 in the level of the WD AGWB around a mid\nvalue of Omega_WD = 4 10^{-12} at 1 mHz and a shape that depends weakly on the\nmodel.\n  We find an uncertainty for the WD component of the AGWB of about a factor 5.\nWe note that there exist other uncertainties that have an effect on this signal\nas well. We discuss whether the turnover of the WD AGWB at 10 mHz will be\ndetectable by LISA, and find that this is likely. We confirm the previous\nfinding that the WD component of the AGWB dominates over other populations, in\nparticular BHs.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BFaMUEBiF4qEotaw9EbbaJAJOfxUbPaSM-FAcuhrjJI","pdfSize":"1498045"}
