{"id":"2407.09869","title":"Properties of neutron stars and strangeness-mixed stars from a pion\n  mean-field approach","authors":"Nam-Yong Ghim, Hyun-Chul Kim, Ulugbek Yakhshiev, and Ghil-Seok Yang","authorsParsed":[["Ghim","Nam-Yong",""],["Kim","Hyun-Chul",""],["Yakhshiev","Ulugbek",""],["Yang","Ghil-Seok",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 12:40:14 GMT"}],"updateDate":"2024-07-16","timestamp":1720874414000,"abstract":"  We investigate the properties of the static neutron stars and\nstrangeness-mixed stars, based on the equations of state derived from a pion\nmean-field approach. Using the empirical data on the pion-nucleus scattering\nand bulk properties of nuclear matter, we have already fixed all the parameters\nin a previous work, where the nucleons and hyperons were shown to be modified\nin various nuclear medium. In the current work, we first examine the energy and\npressure inside a neutron star. We show that the central densities in various\nneutron stars vary within the range of $(3-6)\\rho_0$, where $\\rho_0$ is the\nnormal nuclear matter density. The mass-radius relations are obtained and\ndiscussed. As the slope parameter for neutron matter increases, the radii of\nthe neutron stars increase with their masses fixed. We also study the\nstrangeness-mixed stars or the hyperon stars using the same sets of the\nparameters. As the strangeness content of strange matter increases, the binding\nenergy per nucleon is saturated and the corresponding equation of state becomes\nsoftened. Consequently, the central densities of the strangeness-mixed stars\nincrease. Assuming that recently observed neutron stars are the\nstrangeness-mixed ones, we find that the central densities increase. In the\ncase of the pure strange stars, the central densities reach almost\n$(5-6)\\rho_0$.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics","Physics/Nuclear Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}