{"id":"2407.14031","title":"Unlocking the Potential of Small Satellites: TheMIS's Active Cooling\n  Technology on the SpIRIT Mission","authors":"Miguel Ortiz del Castillo, Clint Therakam, Jack McRobbie, Andrew\n  Woods, Robert Mearns, Simon Barraclough, Stephen Catsamas, Mika Ohkawa,\n  Jonathan Morgan, Airlie Chapman, Michele Trenti","authorsParsed":[["del Castillo","Miguel Ortiz",""],["Therakam","Clint",""],["McRobbie","Jack",""],["Woods","Andrew",""],["Mearns","Robert",""],["Barraclough","Simon",""],["Catsamas","Stephen",""],["Ohkawa","Mika",""],["Morgan","Jonathan",""],["Chapman","Airlie",""],["Trenti","Michele",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 05:06:35 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 17:47:53 GMT"}],"updateDate":"2024-08-08","timestamp":1721365595000,"abstract":"  The Thermal Management Integrated System (TheMIS) is a key element of the\nAustralia-Italy Space Industry Responsive Intelligent Thermal (SpIRIT) mission,\nlaunched in a 510km Polar Sun-Synchronous orbit in December 2023. SpIRIT is a\n6U CubeSat led by The University of Melbourne in cooperation with ASI, with\nsupport from ASA and with contributions from Australian space industry and\ninternational research organizations. The TheMIS subsystem actively cools and\ncontrols the temperature of sensitive instruments, increasing the potential\nrange of payloads supported on small spacecraft systems. TheMIS core\nfunctionality is based on a commercial Stirling Cycle Cryocooler in-principle\ncapable of reaching cold-tip temperatures below T=100K. The cooler is operated\nby customized control electronics and is connected to deployable radiators\nthrough pyrolytic graphite sheet thermal straps, all developed by the\nUniversity of Melbourne. Until now, this level of thermal control has been\nrelatively uncommon in nanosatellites. TheMIS aims to validate the design and\nperformance by controlling the thermal environment of SpIRIT's HERMES payload,\nan X-ray instrument provided by ASI which has a noise background strongly\nsensitive to temperature. Beyond SpIRIT, TheMIS has the potential to support a\nbroad range of applications, including holding infrared focal plane arrays at\ncryogenic temperatures, and increasing resilience of electronics to space\nweather. This paper provides an overview of TheMIS's design, implementation,\nand operational performance, detailing the commissioning phase and the early\nresults obtained from its operations in orbit, with comparison to the thermal\nmodel developed during the mission environmental testing campaign. Finally, the\npaper discusses ongoing challenges for thermal management of payloads in small\nsatellite systems and potential future strategies for continuous improvement\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}