{"id":"2407.09951","title":"Interatomic spin-orbit coupling in atomic orbital-based tight-binding\n  models","authors":"Masaki Kato and Masao Ogata","authorsParsed":[["Kato","Masaki",""],["Ogata","Masao",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 17:25:52 GMT"}],"updateDate":"2024-07-16","timestamp":1720891552000,"abstract":"  Interatomic hopping mediated by spin-orbit coupling (SOC) entangles spin,\norbital and sublattice degrees of freedom of electrons, leading to the\nemergence of intriguing phenomena such as novel topological insulators and\nexotic spin-dependent transport including chirality-induced spin selectivity\n(CISS). Despite these effects, a comprehensive microscopic formalism to\ndescribe the spin-dependent hopping remains insufficiently established. In this\nstudy, we systematically investigate SOC hopping by analytically deriving the\nhopping integrals within a two-center approximation based on atomic orbitals.\nIntroducing independent parameters, or extended Slater-Koster symbols, that\ncharacterize SOC hopping, we explicitly determine the form of the hopping for\n$s$, $p$ and $d$ orbitals in the arbitrary hopping directions. Our formalism is\nthen implemented in tight-binding models on several lattices. Furthermore, we\nexamine the effect of SOC on band dispersion by employing a multipole\ndecomposition for the SOC Hamiltonian, providing a fundamental understanding of\nSOC-induced phenomena. In particular, we derive an explicit expression for the\nSOC Hamiltonian that causes unique spin splitting in chiral systems by\nconsidering a triangular helical chain. Most importantly, the obtained SOC\nHamiltonian does not contain a term that has the symmetry of electric toroidal\nmonopole $G_0$ but rather an electric toroidal quadrupole $G_u$, which is the\norigin of chirality in this case.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nUuBEHb5OHil2COHcd24SaxxiITeekzmnGG1W2kgft0","pdfSize":"7223620"}
