{"id":"2407.05308","title":"Exploring the Educational Landscape of AI: Large Language Models'\n  Approaches to Explaining Conservation of Momentum in Physics","authors":"Keisuke Sato","authorsParsed":[["Sato","Keisuke",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 09:29:51 GMT"}],"updateDate":"2024-07-09","timestamp":1720344591000,"abstract":"  The integration of Large Language Models (LLMs) in education offers both\nopportunities and challenges, particularly in fields like physics that demand\nprecise conceptual understanding. This study examines the capabilities of six\nstate-of-the-art LLMs in explaining the law of conservation of momentum, a\nfundamental principle in physics. By analyzing responses to a consistent,\nsimple prompt in Japanese, we assess the models' explanatory approaches, depth\nof understanding, and adaptability to different educational levels.Our\ncomprehensive analysis, encompassing text characteristics, response similarity,\nand keyword usage, unveils significant diversity in explanatory styles across\nmodels. ChatGPT4.0 and Coral provided more comprehensive and technically\ndetailed explanations, while Gemini models tended toward more intuitive\napproaches. Key findings include variations in the treatment of critical\nconcepts such as net force, and differing emphases on mathematical rigor and\nreal-world applications.The results indicate that different AI models may be\nmore suitable for various educational contexts, ranging from introductory to\nadvanced levels. ChatGPT4.0 and Coral demonstrated potential for advanced\ndiscussions, while Gemini models appeared more appropriate for introductory\nexplanations. Importantly, the study underscores the necessity of educator\nguidance in effectively leveraging these AI tools, as models varied in their\nability to convey nuanced aspects of physical principles.This research\nestablishes a foundation for understanding the educational potential of LLMs in\nphysics, providing insights for educators on integrating these tools into their\nteaching practices. It also highlights the need for further investigation into\nAI-assisted learning in STEM fields, paving the way for more sophisticated\napplications of AI in physics education.\n","subjects":["Physics/Physics Education"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}