{"id":"2407.09187","title":"Enhancing Depressive Post Detection in Bangla: A Comparative Study of\n  TF-IDF, BERT and FastText Embeddings","authors":"Saad Ahmed Sazan, Mahdi H. Miraz, A B M Muntasir Rahman","authorsParsed":[["Sazan","Saad Ahmed",""],["Miraz","Mahdi H.",""],["Rahman","A B M Muntasir",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 11:40:17 GMT"}],"updateDate":"2024-07-15","timestamp":1720784417000,"abstract":"  Due to massive adoption of social media, detection of users' depression\nthrough social media analytics bears significant importance, particularly for\nunderrepresented languages, such as Bangla. This study introduces a\nwell-grounded approach to identify depressive social media posts in Bangla, by\nemploying advanced natural language processing techniques. The dataset used in\nthis work, annotated by domain experts, includes both depressive and\nnon-depressive posts, ensuring high-quality data for model training and\nevaluation. To address the prevalent issue of class imbalance, we utilised\nrandom oversampling for the minority class, thereby enhancing the model's\nability to accurately detect depressive posts. We explored various numerical\nrepresentation techniques, including Term Frequency-Inverse Document Frequency\n(TF-IDF), Bidirectional Encoder Representations from Transformers (BERT)\nembedding and FastText embedding, by integrating them with a deep\nlearning-based Convolutional Neural Network-Bidirectional Long Short-Term\nMemory (CNN-BiLSTM) model. The results obtained through extensive\nexperimentation, indicate that the BERT approach performed better the others,\nachieving a F1-score of 84%. This indicates that BERT, in combination with the\nCNN-BiLSTM architecture, effectively recognises the nuances of Bangla texts\nrelevant to depressive contents. Comparative analysis with the existing\nstate-of-the-art methods demonstrates that our approach with BERT embedding\nperforms better than others in terms of evaluation metrics and the reliability\nof dataset annotations. Our research significantly contribution to the\ndevelopment of reliable tools for detecting depressive posts in the Bangla\nlanguage. By highlighting the efficacy of different embedding techniques and\ndeep learning models, this study paves the way for improved mental health\nmonitoring through social media platforms.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lfq3FTBVHwZH_LFgFU5NhbOMUM_Qxa9xMgu_dHxM54E","pdfSize":"1612752"}
