{"id":"2407.11124","title":"Quantum Chaos in Liouville CFT","authors":"Julian Sonner and Benjamin Strittmatter","authorsParsed":[["Sonner","Julian",""],["Strittmatter","Benjamin",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-17","timestamp":1721066401000,"abstract":"  Fast scrambling is a distinctive feature of quantum gravity, which by means\nof holography is closely tied to the behaviour of large$-c$ conformal field\ntheories. We study this phenomenon in the context of semiclassical Liouville\ntheory, providing both insights into the mechanism of scrambling in CFTs and\ninto the structure of Liouville theory, finding that it exhibits a maximal\nLyapunov exponent despite not featuring the identity in its spectrum. However,\nas we show, the states contributing to the relevant correlation function can be\nthought of as dressed scramblons. At a technical level we we first use the path\nintegral picture in order to derive the Euclidean four-point function in an\nexplicit compact form. Next, we demonstrate its equivalence to a conformal\nblock expansion, revealing an explicit but non-local map between path integral\nsaddles and conformal blocks. By analytically continuing both expressions to\nLorentzian times, we obtain two equivalent formulations of the OTOC, which we\nuse to study the onset of chaos in Liouville theory. We take advantage of the\ncompact form in order to extract a Lyapunov exponent and a scrambling time.\nFrom the conformal block expansion formulation of the OTOC we learn that\nscrambling shifts the dominance of conformal blocks from heavy primaries at\nearly times to the lightest primary at late times. Finally, we discuss our\nresults in the context of holography.\n","subjects":["Physics/High Energy Physics - Theory","Condensed Matter/Strongly Correlated Electrons","Nonlinear Sciences/Chaotic Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pOLT7gqV5RwG2ERuVTZVUhQtb3dNEM6DYNON9j1kkTk","pdfSize":"2274861"}
