{"id":"2407.14303","title":"Multi-Source and Test-Time Domain Adaptation on Multivariate Signals\n  using Spatio-Temporal Monge Alignment","authors":"Th\\'eo Gnassounou, Antoine Collas, R\\'emi Flamary, Karim Lounici and\n  Alexandre Gramfort","authorsParsed":[["Gnassounou","Théo",""],["Collas","Antoine",""],["Flamary","Rémi",""],["Lounici","Karim",""],["Gramfort","Alexandre",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:33:38 GMT"}],"updateDate":"2024-07-22","timestamp":1721396018000,"abstract":"  Machine learning applications on signals such as computer vision or\nbiomedical data often face significant challenges due to the variability that\nexists across hardware devices or session recordings. This variability poses a\nDomain Adaptation (DA) problem, as training and testing data distributions\noften differ. In this work, we propose Spatio-Temporal Monge Alignment (STMA)\nto mitigate these variabilities. This Optimal Transport (OT) based method\nadapts the cross-power spectrum density (cross-PSD) of multivariate signals by\nmapping them to the Wasserstein barycenter of source domains (multi-source DA).\nPredictions for new domains can be done with a filtering without the need for\nretraining a model with source data (test-time DA). We also study and discuss\ntwo special cases of the method, Temporal Monge Alignment (TMA) and Spatial\nMonge Alignment (SMA). Non-asymptotic concentration bounds are derived for the\nmappings estimation, which reveals a bias-plus-variance error structure with a\nvariance decay rate of $\\mathcal{O}(n_\\ell^{-1/2})$ with $n_\\ell$ the signal\nlength. This theoretical guarantee demonstrates the efficiency of the proposed\ncomputational schema. Numerical experiments on multivariate biosignals and\nimage data show that STMA leads to significant and consistent performance gains\nbetween datasets acquired with very different settings. Notably, STMA is a\npre-processing step complementary to state-of-the-art deep learning methods.\n","subjects":["Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}