{"id":"2407.20486","title":"Deformation of moduli spaces of meromorphic $G$-connections on\n  $\\mathbb{P}^{1}$ via unfolding of irregular singularities","authors":"Kazuki Hiroe","authorsParsed":[["Hiroe","Kazuki",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 01:14:52 GMT"}],"updateDate":"2024-07-31","timestamp":1722302092000,"abstract":"  The unfolding of singular points of linear differential equations is a\nclassical technique to study the properties of irregular singular points from\nthose of regular singular points. In this paper, we propose a general framework\nfor the unfolding of unramified irregular singularities of meromorphic\n$G$-connections on $\\mathbb{P}^{1}$. As one of main results, we give a\ndescription for the unfolding of singularities of connections as the\ndeformation of moduli spaces of them, and show that every moduli space of\nirreducible meromorphic $G$-connections with unramified irregular singularities\non $\\mathbb{P}^{1}$ has a deformation to a moduli space of irreducible Fuchsian\n$G$-connections on $\\mathbb{P}^{1}$. Furthermore, we can consider the unfolding\nof additive Delinge-Simpson problems, namely, the unfolding of irregular\nsingularities generates a family of additive Deligne-Simpson problems. Then as\nan application of our main result, we show that a Deligne-Simpson problem for\n$G$-connections with unramified irregular singularities has a solution if and\nonly if every other unfolded Deligne-Simpson problem simultaneously has a\nsolution. Also we give a combinatorial and diagrammatic description of the\nunfolding of irregular singularities via spectral types and unfolding diagrams,\nand then consider a conjecture proposed by Oshima which asks the existence of\nirreducible $G$-connections realizing the given spectral types and their\nunfolding. Our main result gives an affirmative answer of this conjecture.\n","subjects":["Mathematics/Algebraic Geometry","Mathematics/Classical Analysis and ODEs","Mathematics/Representation Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Z5wUTuanIKS8bywOkNqKozBZL61UhOLr4WSS-Hux2YI","pdfSize":"972168"}
