{"id":"2407.21465","title":"MarvelOVD: Marrying Object Recognition and Vision-Language Models for\n  Robust Open-Vocabulary Object Detection","authors":"Kuo Wang, Lechao Cheng, Weikai Chen, Pingping Zhang, Liang Lin, Fan\n  Zhou, Guanbin Li","authorsParsed":[["Wang","Kuo",""],["Cheng","Lechao",""],["Chen","Weikai",""],["Zhang","Pingping",""],["Lin","Liang",""],["Zhou","Fan",""],["Li","Guanbin",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 09:23:57 GMT"}],"updateDate":"2024-08-01","timestamp":1722417837000,"abstract":"  Learning from pseudo-labels that generated with VLMs~(Vision Language Models)\nhas been shown as a promising solution to assist open vocabulary detection\n(OVD) in recent studies. However, due to the domain gap between VLM and\nvision-detection tasks, pseudo-labels produced by the VLMs are prone to be\nnoisy, while the training design of the detector further amplifies the bias. In\nthis work, we investigate the root cause of VLMs' biased prediction under the\nOVD context. Our observations lead to a simple yet effective paradigm, coded\nMarvelOVD, that generates significantly better training targets and optimizes\nthe learning procedure in an online manner by marrying the capability of the\ndetector with the vision-language model. Our key insight is that the detector\nitself can act as a strong auxiliary guidance to accommodate VLM's inability of\nunderstanding both the ``background'' and the context of a proposal within the\nimage. Based on it, we greatly purify the noisy pseudo-labels via Online Mining\nand propose Adaptive Reweighting to effectively suppress the biased training\nboxes that are not well aligned with the target object. In addition, we also\nidentify a neglected ``base-novel-conflict'' problem and introduce stratified\nlabel assignments to prevent it. Extensive experiments on COCO and LVIS\ndatasets demonstrate that our method outperforms the other state-of-the-arts by\nsignificant margins. Codes are available at https://github.com/wkfdb/MarvelOVD\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}