{"id":"2407.01765","title":"A General Framework for Design-Based Treatment Effect Estimation in\n  Paired Cluster-Randomized Experiments","authors":"Charlotte Z. Mann, Adam C. Sales, and Johann A. Gagnon-Bartsch","authorsParsed":[["Mann","Charlotte Z.",""],["Sales","Adam C.",""],["Gagnon-Bartsch","Johann A.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 19:57:31 GMT"}],"updateDate":"2024-07-03","timestamp":1719863851000,"abstract":"  Paired cluster-randomized experiments (pCRTs) are common across many\ndisciplines because there is often natural clustering of individuals, and\npaired randomization can help balance baseline covariates to improve\nexperimental precision. Although pCRTs are common, there is surprisingly no\nobvious way to analyze this randomization design if an individual-level (rather\nthan cluster-level) treatment effect is of interest. Variance estimation is\nalso complicated due to the dependency created through pairing clusters.\nTherefore, we aim to provide an intuitive and practical comparison between\ndifferent estimation strategies in pCRTs in order to inform practitioners'\nchoice of strategy. To this end, we present a general framework for\ndesign-based estimation in pCRTs for average individual effects. This framework\noffers a novel and intuitive view on the bias-variance trade-off between\nestimators and emphasizes the benefits of covariate adjustment for estimation\nwith pCRTs. In addition to providing a general framework for estimation in\npCRTs, the point and variance estimators we present support fixed-sample\nunbiased estimation with similar precision to a common regression model and\nconsistently conservative variance estimation. Through simulation studies, we\ncompare the performance of the point and variance estimators reviewed. Finally,\nwe compare the performance of estimators with simulations using real data from\nan educational efficacy trial. Our analysis and simulation studies inform the\nchoice of point and variance estimators for analyzing pCRTs in practice.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"k8c2pmhuFserS0L1GaRKBuAjkQ2vJYnYO5eTE9t2piI","pdfSize":"2885306"}
