{"id":"2407.11424","title":"Model Inversion Attacks Through Target-Specific Conditional Diffusion\n  Models","authors":"Ouxiang Li, Yanbin Hao, Zhicai Wang, Bin Zhu, Shuo Wang, Zaixi Zhang,\n  Fuli Feng","authorsParsed":[["Li","Ouxiang",""],["Hao","Yanbin",""],["Wang","Zhicai",""],["Zhu","Bin",""],["Wang","Shuo",""],["Zhang","Zaixi",""],["Feng","Fuli",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 06:38:49 GMT"}],"updateDate":"2024-07-17","timestamp":1721111929000,"abstract":"  Model inversion attacks (MIAs) aim to reconstruct private images from a\ntarget classifier's training set, thereby raising privacy concerns in AI\napplications. Previous GAN-based MIAs tend to suffer from inferior generative\nfidelity due to GAN's inherent flaws and biased optimization within latent\nspace. To alleviate these issues, leveraging on diffusion models' remarkable\nsynthesis capabilities, we propose Diffusion-based Model Inversion (Diff-MI)\nattacks. Specifically, we introduce a novel target-specific conditional\ndiffusion model (CDM) to purposely approximate target classifier's private\ndistribution and achieve superior accuracy-fidelity balance. Our method\ninvolves a two-step learning paradigm. Step-1 incorporates the target\nclassifier into the entire CDM learning under a pretrain-then-finetune fashion,\nwith creating pseudo-labels as model conditions in pretraining and adjusting\nspecified layers with image predictions in fine-tuning. Step-2 presents an\niterative image reconstruction method, further enhancing the attack performance\nthrough a combination of diffusion priors and target knowledge. Additionally,\nwe propose an improved max-margin loss that replaces the hard max with top-k\nmaxes, fully leveraging feature information and soft labels from the target\nclassifier. Extensive experiments demonstrate that Diff-MI significantly\nimproves generative fidelity with an average decrease of 20% in FID while\nmaintaining competitive attack accuracy compared to state-of-the-art methods\nacross various datasets and models. We will release our code and models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}