{"id":"2407.05671","title":"MSTF: Multiscale Transformer for Incomplete Trajectory Prediction","authors":"Zhanwen Liu, Chao Li, Nan Yang, Yang Wang, Jiaqi Ma, Guangliang Cheng,\n  Xiangmo Zhao","authorsParsed":[["Liu","Zhanwen",""],["Li","Chao",""],["Yang","Nan",""],["Wang","Yang",""],["Ma","Jiaqi",""],["Cheng","Guangliang",""],["Zhao","Xiangmo",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 07:10:17 GMT"}],"updateDate":"2024-07-09","timestamp":1720422617000,"abstract":"  Motion forecasting plays a pivotal role in autonomous driving systems,\nenabling vehicles to execute collision warnings and rational local-path\nplanning based on predictions of the surrounding vehicles. However, prevalent\nmethods often assume complete observed trajectories, neglecting the potential\nimpact of missing values induced by object occlusion, scope limitation, and\nsensor failures. Such oversights inevitably compromise the accuracy of\ntrajectory predictions. To tackle this challenge, we propose an end-to-end\nframework, termed Multiscale Transformer (MSTF), meticulously crafted for\nincomplete trajectory prediction. MSTF integrates a Multiscale Attention Head\n(MAH) and an Information Increment-based Pattern Adaptive (IIPA) module.\nSpecifically, the MAH component concurrently captures multiscale motion\nrepresentation of trajectory sequence from various temporal granularities,\nutilizing a multi-head attention mechanism. This approach facilitates the\nmodeling of global dependencies in motion across different scales, thereby\nmitigating the adverse effects of missing values. Additionally, the IIPA module\nadaptively extracts continuity representation of motion across time steps by\nanalyzing missing patterns in the data. The continuity representation\ndelineates motion trend at a higher level, guiding MSTF to generate predictions\nconsistent with motion continuity. We evaluate our proposed MSTF model using\ntwo large-scale real-world datasets. Experimental results demonstrate that MSTF\nsurpasses state-of-the-art (SOTA) models in the task of incomplete trajectory\nprediction, showcasing its efficacy in addressing the challenges posed by\nmissing values in motion forecasting for autonomous driving systems.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}