{"id":"2407.19775","title":"Model Agnostic Hybrid Sharding For Heterogeneous Distributed Inference","authors":"Claudio Angione, Yue Zhao, Harry Yang, Ahmad Farhan, Fielding\n  Johnston, James Buban, Patrick Colangelo","authorsParsed":[["Angione","Claudio",""],["Zhao","Yue",""],["Yang","Harry",""],["Farhan","Ahmad",""],["Johnston","Fielding",""],["Buban","James",""],["Colangelo","Patrick",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 08:18:48 GMT"}],"updateDate":"2024-07-30","timestamp":1722241128000,"abstract":"  The rapid growth of large-scale AI models, particularly large language models\nhas brought significant challenges in data privacy, computational resources,\nand accessibility. Traditional centralized architectures often struggle to meet\nrequired data security and scalability needs which hinders the democratization\nof AI systems. Nesa introduces a model-agnostic sharding framework designed for\ndecentralized AI inference. Our framework uses blockchain-based sequential deep\nneural network sharding to distribute computational tasks across a diverse\nnetwork of nodes based on a personalised heuristic and routing mechanism. This\nenables efficient distributed training and inference for recent large-scale\nmodels even on consumer-grade hardware. We use compression techniques like\ndynamic blockwise quantization and mixed matrix decomposition to reduce data\ntransfer and memory needs. We also integrate robust security measures,\nincluding hardware-based trusted execution environments to ensure data\nintegrity and confidentiality. Evaluating our system across various natural\nlanguage processing and vision tasks shows that these compression strategies do\nnot compromise model accuracy. Our results highlight the potential to\ndemocratize access to cutting-edge AI technologies by enabling secure and\nefficient inference on a decentralized network.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Cryptography and Security","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/"}