{"id":"2407.14823","title":"CrossDehaze: Scaling Up Image Dehazing with Cross-Data Vision Alignment\n  and Augmentation","authors":"Yukai Shi, Zhipeng Weng, Yupei Lin, Cidan Shi, Xiaojun Yang, and Liang\n  Lin","authorsParsed":[["Shi","Yukai",""],["Weng","Zhipeng",""],["Lin","Yupei",""],["Shi","Cidan",""],["Yang","Xiaojun",""],["Lin","Liang",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 10:00:20 GMT"}],"updateDate":"2024-07-23","timestamp":1721469620000,"abstract":"  In recent years, as computer vision tasks have increasingly relied on\nhigh-quality image inputs, the task of image dehazing has received significant\nattention. Previously, many methods based on priors and deep learning have been\nproposed to address the task of image dehazing. Ignoring the domain gap between\ndifferent data, former de-hazing methods usually adopt multiple datasets for\nexplicit training, which often makes the methods themselves be violated. To\naddress this problem, we propose a novel method of internal and external data\naugmentation to improve the existing dehazing methodology. By using cross-data\nexternal augmentor. The dataset inherits samples from different domains that\nare firmly aligned, making the model learn more robust and generalizable\nfeatures. By using the internal data augmentation method, the model can fully\nexploit local information within the images, thereby obtaining more image\ndetails. To demonstrate the effectiveness of our proposed method, we conduct\ntraining on both the Natural Image Dataset (NID) and the Remote Sensing Image\nDataset (RSID). Experimental results show that our method clearly resolves the\ndomain gap in different dehazing datasets and presents a new pipeline for joint\ntraining in the dehazing task. Our approach significantly outperforms other\nadvanced methods in dehazing and produces dehazed images that are closest to\nreal haze-free images. The code will be available at:\nhttps://github.com/wengzp1/ScaleUpDehazing\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Multimedia","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TddPBP_uzoIXFCUJ7mtTc4_peb3_HFs-IGRDWuw63w4","pdfSize":"8058030"}
