{"id":"2407.13186","title":"Nearest Neighbor Future Captioning: Generating Descriptions for Possible\n  Collisions in Object Placement Tasks","authors":"Takumi Komatsu and Motonari Kambara and Shumpei Hatanaka and Haruka\n  Matsuo and Tsubasa Hirakawa and Takayoshi Yamashita and Hironobu Fujiyoshi\n  and Komei Sugiura","authorsParsed":[["Komatsu","Takumi",""],["Kambara","Motonari",""],["Hatanaka","Shumpei",""],["Matsuo","Haruka",""],["Hirakawa","Tsubasa",""],["Yamashita","Takayoshi",""],["Fujiyoshi","Hironobu",""],["Sugiura","Komei",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 05:49:46 GMT"}],"updateDate":"2024-07-19","timestamp":1721281786000,"abstract":"  Domestic service robots (DSRs) that support people in everyday environments\nhave been widely investigated. However, their ability to predict and describe\nfuture risks resulting from their own actions remains insufficient. In this\nstudy, we focus on the linguistic explainability of DSRs. Most existing methods\ndo not explicitly model the region of possible collisions; thus, they do not\nproperly generate descriptions of these regions. In this paper, we propose the\nNearest Neighbor Future Captioning Model that introduces the Nearest Neighbor\nLanguage Model for future captioning of possible collisions, which enhances the\nmodel output with a nearest neighbors retrieval mechanism. Furthermore, we\nintroduce the Collision Attention Module that attends regions of possible\ncollisions, which enables our model to generate descriptions that adequately\nreflect the objects associated with possible collisions. To validate our\nmethod, we constructed a new dataset containing samples of collisions that can\noccur when a DSR places an object in a simulation environment. The experimental\nresults demonstrated that our method outperformed baseline methods, based on\nthe standard metrics. In particular, on CIDEr-D, the baseline method obtained\n25.09 points, whereas our method obtained 33.08 points.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}