{"id":"2407.17217","title":"The Bifurcation Growth Rate for the Robust Pattern Formation in the\n  Reaction-Diffusion System on the Growing Domain","authors":"Shin Nishihara and Toru Ohira","authorsParsed":[["Nishihara","Shin",""],["Ohira","Toru",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 12:17:38 GMT"}],"updateDate":"2024-07-25","timestamp":1721823458000,"abstract":"  Among living organisms, there are species that change their patterns on their\nbody surface during their growth process and those that maintain their\npatterns. Theoretically, it has been shown that large-scale species do not form\ndistinct patterns. However, exceptionally, even large-scale species like\ngiraffes form and maintain patterns, and previous studies have shown that the\ngrowth plays a crucial role in pattern formation and transition. Here we show\nhow the growth of the domain contributes to Turing bifurcation based on the\nreaction-diffusion system by applying the Gray-Scott model to the reaction\nterms, both analytically and numerically, focusing on the phenomenon of pattern\nformation and maintenance in large species like giraffes, where melanocytes are\nwidely distributed. After analytically identifying the Turing bifurcation\nrelated to the growth rate, we numerically verify the pattern formation and\nmaintenance in response to the finite-amplitude perturbations of the blue state\nspecific to the Gray-Scott model near the bifurcation. Furthermore, among pairs\nof the parameters that form Turing patterns in a reaction-diffusion system on a\nfixed domain, we determine a pair of the parameters that maximizes the growth\nrate for the Turing bifurcation in a reaction-diffusion system on a\ntime-dependently growing domain. Specifically, we conduct a numerical analysis\nto pursue the pair of the parameters in the Turing space that can be the most\nrobust in maintaining the patterns formed on the fixed domain, even as the\ndomain grows. This study may contribute to specifically reaffirming the\nimportance of growth rate in pattern formation and understanding patterns that\nare easy to maintain even during growth.\n","subjects":["Physics/Biological Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}