{"id":"2407.05236","title":"A timing view of the additional high-energy spectral component\n  discovered in the black hole candidate Swift J1727.8-1613","authors":"Zi-Xu Yang, Liang Zhang, Shuang-Nan Zhang, L. Tao, Shu Zhang, Ruican\n  Ma, Qingcui Bu, Yue Huang, He-Xin Liu, Wei Yu, Guang C. Xiao, Peng-Ju Wang,\n  Hua Feng, Li-Ming Song, Xiang Ma, Mingyu Ge, QingChang Zhao, J. L. Qu","authorsParsed":[["Yang","Zi-Xu",""],["Zhang","Liang",""],["Zhang","Shuang-Nan",""],["Tao","L.",""],["Zhang","Shu",""],["Ma","Ruican",""],["Bu","Qingcui",""],["Huang","Yue",""],["Liu","He-Xin",""],["Yu","Wei",""],["Xiao","Guang C.",""],["Wang","Peng-Ju",""],["Feng","Hua",""],["Song","Li-Ming",""],["Ma","Xiang",""],["Ge","Mingyu",""],["Zhao","QingChang",""],["Qu","J. L.",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 02:29:45 GMT"}],"updateDate":"2024-07-09","timestamp":1720319385000,"abstract":"  We present an energy-dependent analysis for the type-C quasi-periodic\noscillations (QPOs) observed in the black hole X-ray binary Swift J1727.8-1613\nusing Insight-HXMT observations. We find that the QPO fractional rms at\nenergies above 40 keV is significantly higher than that below 20 keV. This is\nthe first report of a high energy (HE)-rms excess in the rms spectrum of a\nblack hole X-ray binary. In the high energy band, an extra hard component is\nobserved in additional to the standard thermal Comptonization component at\nsimilar energy band. The value of the QPO HE-rms excess is not only correlated\nwith the disk parameters and the photon index of the standard Comptonization\ncomponent, but also exhibits a moderate positive correlation with the flux of\nthe additional hard spectral component. No features in the QPO phase-lag\nspectra are seen corresponding to the additional hard component. We propose\nthat the additional hard component in the spectrum may originate from jet\nemission and the associated QPO HE-rms excess can be explained by the\nprecession of the jet base.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}