{"id":"2407.10568","title":"Stochastic Density Functional Theory on Lane Formation in\n  Electric-Field-Driven Ionic Mixtures: Flow-Kernel-Based Formulation","authors":"Hiroshi Frusawa","authorsParsed":[["Frusawa","Hiroshi",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 09:30:54 GMT"}],"updateDate":"2024-07-16","timestamp":1721035854000,"abstract":"  Simulation and experimental studies have demonstrated non-equilibrium\nordering in driven colloidal suspensions: with increasing driving force, a\nuniform colloidal mixture transforms into a locally demixed state characterized\nby the lane formation or the emergence of strongly anisotropic stripe-like\ndomains. Theoretically, we have found that a linear stability analysis of\ndensity dynamics can explain the non-equilibrium ordering by adding a\nnon-trivial advection term. This advection arises from fluctuating flows due to\nnon-Coulombic interactions associated with oppositely driven migrations. Recent\nstudies based on the dynamical density functional theory (DFT) without\nmultiplicative noise have introduced the flow kernel for providing a general\ndescription of the fluctuating velocity. Here, we assess and extend the above\ndeterministic DFT by treating electric-field-driven binary ionic mixtures as\nthe primitive model. First, we develop the stochastic DFT with multiplicative\nnoise for the laning phenomena. The stochastic DFT considering the fluctuating\nflows allows us to determine correlation functions in a steady state. In\nparticular, asymptotic analysis on the stationary charge-charge correlation\nfunction reveals that the above dispersion relation for linear stability\nanalysis is equivalent to the pole equation for determining the oscillatory\nwavelength of charge--charge correlations. Next, the appearance of stripe-like\ndomains is demonstrated not only by using the pole equation but also by\nperforming the 2D inverse Fourier transform of the charge--charge correlation\nfunction without the premise of anisotropic homogeneity in the electric field\ndirection.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Materials Science","Condensed Matter/Statistical Mechanics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"pqTYxpk_o9pwr5jAEJfT53BI3J_5Y3v5MOQrSwO658E","pdfSize":"2110150"}
