{"id":"2407.09820","title":"Mining individual daily commuting patterns of dockless bike-sharing\n  users: a two-layer framework integrating spatiotemporal flow clustering and\n  rule-based decision trees","authors":"Caigang Zhuang, Shaoying Li, Xiaoping Liu","authorsParsed":[["Zhuang","Caigang",""],["Li","Shaoying",""],["Liu","Xiaoping",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 09:30:51 GMT"}],"updateDate":"2024-07-16","timestamp":1720863051000,"abstract":"  The rise of dockless bike-sharing systems has led to increased interest in\nusing bike-sharing data for urban transportation and travel behavior research.\nHowever, few studies have focused on the individual daily mobility patterns,\nhindering their alignment with the increasingly refined needs of urban active\ntransportation planning. To bridge this gap, this study presents a two-layer\nframework, integrating improved flow clustering methods and multiple rule-based\ndecision trees, to mine individual cyclists' daily home-work commuting patterns\nfrom vast dockless bike-sharing trip data with users' IDs. The effectiveness\nand applicability of the framework is demonstrated by over 200 million dockless\nbike-sharing trip records in Shenzhen. Ultimately, based on the mining results,\nwe obtain two categories of bike-sharing commuters (i.e., 74.38% of Only-biking\ncommuters and 25.62% of Biking-with-transit commuters) and some interesting\nfindings about their daily commuting patterns. For instance, lots of\nbike-sharing commuters live near urban villages and old communities with lower\ncosts of living, especially in the central city. Only-biking commuters have a\nhigher proportion of overtime than Biking-with-transit commuters, and the\nLonghua Industrial Park, a manufacturing-oriented area, having the longest\naverage working hours (over 10 hours per day). Massive commuters utilize\nbike-sharing for commuting to work more frequently than for returning home,\nwhich is closely related to the over-demand for bike-sharing around workplaces\nduring commuting peak. Overall, this framework offers a cost-effective way to\nunderstand residents' non-motorized mobility patterns. Moreover, it paves the\nway for subsequent research on fine-scale cycling behaviors that consider\ndemographic disparities in socio-economic attributes.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}