{"id":"2407.08003","title":"Machine Learning for ALSFRS-R Score Prediction: Making Sense of the\n  Sensor Data","authors":"Ritesh Mehta, Aleksandar Pramov and Shashank Verma","authorsParsed":[["Mehta","Ritesh",""],["Pramov","Aleksandar",""],["Verma","Shashank",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 19:17:23 GMT"}],"updateDate":"2024-07-12","timestamp":1720639043000,"abstract":"  Amyotrophic Lateral Sclerosis (ALS) is characterized as a rapidly progressive\nneurodegenerative disease that presents individuals with limited treatment\noptions in the realm of medical interventions and therapies. The disease\nshowcases a diverse range of onset patterns and progression trajectories,\nemphasizing the critical importance of early detection of functional decline to\nenable tailored care strategies and timely therapeutic interventions. The\npresent investigation, spearheaded by the iDPP@CLEF 2024 challenge, focuses on\nutilizing sensor-derived data obtained through an app. This data is used to\nconstruct various machine learning models specifically designed to forecast the\nadvancement of the ALS Functional Rating Scale-Revised (ALSFRS-R) score,\nleveraging the dataset provided by the organizers. In our analysis, multiple\npredictive models were evaluated to determine their efficacy in handling ALS\nsensor data. The temporal aspect of the sensor data was compressed and\namalgamated using statistical methods, thereby augmenting the interpretability\nand applicability of the gathered information for predictive modeling\nobjectives. The models that demonstrated optimal performance were a naive\nbaseline and ElasticNet regression. The naive model achieved a Mean Absolute\nError (MAE) of 0.20 and a Root Mean Square Error (RMSE) of 0.49, slightly\noutperforming the ElasticNet model, which recorded an MAE of 0.22 and an RMSE\nof 0.50. Our comparative analysis suggests that while the naive approach\nyielded marginally better predictive accuracy, the ElasticNet model provides a\nrobust framework for understanding feature contributions.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}