{"id":"2407.16543","title":"Joint Active and Passive Beamforming Design for IRS-aided MIMO ISAC\n  Based on Sensing Mutual Information","authors":"Jin Li, Gui Zhou, Tantao Gong, Nan Liu, and Rui Zhang","authorsParsed":[["Li","Jin",""],["Zhou","Gui",""],["Gong","Tantao",""],["Liu","Nan",""],["Zhang","Rui",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:54:14 GMT"}],"updateDate":"2024-07-24","timestamp":1721746454000,"abstract":"  In this paper, we investigate the intelligent reflecting surface\n(IRS)/reconfigurable intelligent surface (RIS)-aided integrated sensing and\ncommunication (ISAC) system based on sensing mutual information (MI).\nSpecifically, the base station (BS) perceives the sensing target via the\nreflected sensing signal by the IRS, while communicating with the users\nsimultaneously. Our aim is to maximize the sensing MI, subject to the quality\nof service (QoS) constraints for all communication users, the transmit power\nconstraint at the BS, and the unit-modulus constraint on the IRS's passive\nreflection. We solve this problem under two cases: one simplified case assuming\na line-of-sight (LoS) channel between the BS and IRS and no clutter\ninterference to sensing, and the other generalized case considering the Rician\nfading channel of the BS-IRS link and the presence of clutter interference to\nsensing. For the first case, we show that the dedicated sensing beamformer\ncannot enhance the sensing MI if the BS-user direct links are blocked, and\ndevelop a low-complexity iterative algorithm to jointly optimize the BS and IRS\nactive/passive beamformers. In contrast, for the second case, we propose an\nalternative iterative algorithm, which can also be applied to the first case,\nto solve the beamforming design problem under the general setup. Numerical\nresults are provided to validate the performance of the proposed algorithms, as\ncompared to various benchmark schemes.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}