{"id":"2407.01636","title":"Learning Frequency-Aware Dynamic Transformers for All-In-One Image\n  Restoration","authors":"Zenglin Shi, Tong Su, Pei Liu, Yunpeng Wu, Le Zhang and Meng Wang","authorsParsed":[["Shi","Zenglin",""],["Su","Tong",""],["Liu","Pei",""],["Wu","Yunpeng",""],["Zhang","Le",""],["Wang","Meng",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 13:14:44 GMT"}],"updateDate":"2024-07-03","timestamp":1719753284000,"abstract":"  This work aims to tackle the all-in-one image restoration task, which seeks\nto handle multiple types of degradation with a single model. The primary\nchallenge is to extract degradation representations from the input degraded\nimages and use them to guide the model's adaptation to specific degradation\ntypes. Recognizing that various degradations affect image content differently\nacross frequency bands, we propose a new all-in-one image restoration approach\nfrom a frequency perspective, leveraging advanced vision transformers. Our\nmethod consists of two main components: a frequency-aware Degradation prior\nlearning transformer (Dformer) and a degradation-adaptive Restoration\ntransformer (Rformer). The Dformer captures the essential characteristics of\nvarious degradations by decomposing inputs into different frequency components.\nBy understanding how degradations affect these frequency components, the\nDformer learns robust priors that effectively guide the restoration process.\nThe Rformer then employs a degradation-adaptive self-attention module to\nselectively focus on the most affected frequency components, guided by the\nlearned degradation representations. Extensive experimental results demonstrate\nthat our approach outperforms the existing methods on four representative\nrestoration tasks, including denoising, deraining, dehazing and deblurring.\nAdditionally, our method offers benefits for handling spatially variant\ndegradations and unseen degradation levels.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ZHYNzjL9YrWseN6e_CaztZUIZgvhQ44DPNJqk1fxN8g","pdfSize":"1129346"}
