{"id":"2407.01893","title":"CausalPrism: A Visual Analytics Approach for Subgroup-based Causal\n  Heterogeneity Exploration","authors":"Jiehui Zhou, Xumeng Wang, Kam-Kwai Wong, Wei Zhang, Xingyu Liu,\n  Juntian Zhang, Minfeng Zhu, Wei Chen","authorsParsed":[["Zhou","Jiehui",""],["Wang","Xumeng",""],["Wong","Kam-Kwai",""],["Zhang","Wei",""],["Liu","Xingyu",""],["Zhang","Juntian",""],["Zhu","Minfeng",""],["Chen","Wei",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 02:27:49 GMT"},{"version":"v2","created":"Sun, 11 Aug 2024 13:06:02 GMT"}],"updateDate":"2024-08-13","timestamp":1719887269000,"abstract":"  In causal inference, estimating Heterogeneous Treatment Effects (HTEs) from\nobservational data is critical for understanding how different subgroups\nrespond to treatments, with broad applications such as precision medicine and\ntargeted advertising. However, existing work on HTE, subgroup discovery, and\ncausal visualization is insufficient to address two challenges: first, the\nsheer number of potential subgroups and the necessity to balance multiple\nobjectives (e.g., high effects and low variances) pose a considerable\nanalytical challenge. Second, effective subgroup analysis has to follow the\nanalysis goal specified by users and provide causal results with verification.\nTo this end, we propose a visual analytics approach for subgroup-based causal\nheterogeneity exploration. Specifically, we first formulate causal subgroup\ndiscovery as a constrained multi-objective optimization problem and adopt a\nheuristic genetic algorithm to learn the Pareto front of optimal subgroups\ndescribed by interpretable rules. Combining with this model, we develop a\nprototype system, CausalPrism, that incorporates tabular visualization,\nmulti-attribute rankings, and uncertainty plots to support users in\ninteractively exploring and sorting subgroups and explaining treatment effects.\nQuantitative experiments validate that the proposed model can efficiently mine\ncausal subgroups that outperform state-of-the-art HTE and subgroup discovery\nmethods, and case studies and expert interviews demonstrate the effectiveness\nand usability of the system. Code is available at\nhttps://osf.io/jaqmf/?view_only=ac9575209945476b955bf829c85196e9.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"HJfs7F5GYtIQaVyPhvwKeM6BTpDwzTEgYHudXvKN5Ys","pdfSize":"2292508"}
