{"id":"2407.03218","title":"Programmable Photonic Extreme Learning Machines","authors":"Jose Roberto Rausell-Campo, Antonio Hurtado, Daniel P\\'erez-L\\'opez,\n  Jos\\'e Capmany Francoy","authorsParsed":[["Rausell-Campo","Jose Roberto",""],["Hurtado","Antonio",""],["Pérez-López","Daniel",""],["Francoy","José Capmany",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 15:46:47 GMT"}],"updateDate":"2024-07-04","timestamp":1720021607000,"abstract":"  Photonic neural networks offer a promising alternative to traditional\nelectronic systems for machine learning accelerators due to their low latency\nand energy efficiency. However, the challenge of implementing the\nbackpropagation algorithm during training has limited their development. To\naddress this, alternative machine learning schemes, such as extreme learning\nmachines (ELMs), have been proposed. ELMs use a random hidden layer to increase\nthe feature space dimensionality, requiring only the output layer to be trained\nthrough linear regression, thus reducing training complexity. Here, we\nexperimentally demonstrate a programmable photonic extreme learning machine\n(PPELM) using a hexagonal waveguide mesh, and which enables to program directly\non chip the input feature vector and the random hidden layer. Our system also\npermits to apply the nonlinearity directly on-chip by using the systems\nintegrated photodetecting elements. Using the PPELM we solved successfully\nthree different complex classification tasks. Additioanlly, we also propose and\ndemonstrate two techniques to increase the accuracy of the models and reduce\ntheir variability using an evolutionary algorithm and a wavelength division\nmultiplexing approach, obtaining excellent performance. Our results show that\nprogrammable photonic processors may become a feasible way to train competitive\nmachine learning models on a versatile and compact platform.\n","subjects":["Physics/Optics","Computing Research Repository/Emerging Technologies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}