{"id":"2407.01943","title":"A Fast Multitaper Power Spectrum Estimation in Nonuniformly Sampled Time\n  Series","authors":"Jie Cui, Benjamin H. Brinkmann and Gregory A. Worrell","authorsParsed":[["Cui","Jie",""],["Brinkmann","Benjamin H.",""],["Worrell","Gregory A.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 04:25:57 GMT"},{"version":"v2","created":"Fri, 5 Jul 2024 17:47:58 GMT"},{"version":"v3","created":"Thu, 11 Jul 2024 16:15:23 GMT"}],"updateDate":"2024-07-12","timestamp":1719894357000,"abstract":"  Nonuniformly sampled signals are prevalent in real-world applications, but\ntheir power spectra estimation, usually from a finite number of samples of a\nsingle realization, presents a significant challenge. The optimal solution,\nwhich uses Bronez Generalized Prolate Spheroidal Sequence (GPSS), is\ncomputationally demanding and often impractical for large datasets. This paper\ndescribes a fast nonparametric method, the MultiTaper NonUniform Fast Fourier\nTransform (MTNUFFT), capable of estimating power spectra with lower\ncomputational burden. The method first derives a set of optimal tapers through\ncubic spline interpolation on a nominal analysis band. These tapers are\nsubsequently shifted to other analysis bands using the NonUniform FFT (NUFFT).\nThe estimated spectral power within the band is the average power at the\noutputs of the taper set. This algorithm eliminates the needs for\ntime-consuming computation to solve the Generalized Eigenvalue Problem (GEP),\nthus reducing the computational load from $O(N^4)$ to $O(N \\log N + N\n\\log(1/\\epsilon))$, which is comparable with the NUFFT. The statistical\nproperties of the estimator are assessed using Bronez GPSS theory, revealing\nthat the bias of estimates and variance bound of the MTNUFFT estimator are\nidentical to those of the optimal estimator. Furthermore, the degradation of\nbias bound may serve as a measure of the deviation from optimality. The\nperformance of the estimator is evaluated using both simulation and real-world\ndata, demonstrating its practical applicability. The code of the proposed fast\nalgorithm is available on GitHub (https://github.com/jiecui/mtnufft).\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qpFbOnTmAEfFa9REtCgOxqMrEqKgBQBD2LE03Ph8KAs","pdfSize":"4647649"}
