{"id":"2407.12139","title":"Propensity towards Ownership and Use of Automated Vehicles: Who Are the\n  Adopters? Who Are the Non-adopters? Who Is Hesitant?","authors":"Tho Le, and Giovanni Circella","authorsParsed":[["Le","Tho",""],["Circella","Giovanni",""]],"versions":[{"version":"v1","created":"Wed, 15 May 2024 21:08:45 GMT"}],"updateDate":"2024-07-18","timestamp":1715807325000,"abstract":"  The objective of this study is to investigate automated vehicle (AV) adoption\nperceptions, including ownership intentions and the willingness to use\nself-driving mobility services. In this paper, we use data from the 2018\nCalifornia Transportation Survey, and use K-means, a clustering technique in\ndata mining, to reveal patterns of potential AV owners (and non-owners) as well\nas AV users (and non-users) of self-driving services. The results reveal seven\nclusters, namely Multitaskers/ environmentalists/ impaired drivers, Tech\nmavens/ travelers, Life in transition, Captive car-users, Public/ active\ntransport users, Sub-urban Dwellers, and Car enthusiasts. The first two\nclusters include adopters who are largely familiar with AVs, are tech savvy,\nand who make good use of time during their commute. The last cluster comprise\nof non-adopters who are car enthusiasts. On the other hand, people who are Life\nin transition, Captive car-users, Public/ active transport users, and Sub-urban\ndwellers show uncertain perceptions towards being AV adopters. They are either\npursuing higher education, having a busy schedule, supporting for sustainable\nsociety via government policies, or have a stable life, respectively. Insights\nfrom this study help practitioners to build business models and strategic\nplanning, addressing potential market segments of individuals that are willing\nto own an AV vs. those that are more inclined to use self-driving mobility\nservices. The \"gray\" segments identify a latent untapped demand and a potential\ntarget for marketing, campaigns, and sales.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}