{"id":"2407.17436","title":"AIR-Bench 2024: A Safety Benchmark Based on Risk Categories from\n  Regulations and Policies","authors":"Yi Zeng, Yu Yang, Andy Zhou, Jeffrey Ziwei Tan, Yuheng Tu, Yifan Mai,\n  Kevin Klyman, Minzhou Pan, Ruoxi Jia, Dawn Song, Percy Liang, Bo Li","authorsParsed":[["Zeng","Yi",""],["Yang","Yu",""],["Zhou","Andy",""],["Tan","Jeffrey Ziwei",""],["Tu","Yuheng",""],["Mai","Yifan",""],["Klyman","Kevin",""],["Pan","Minzhou",""],["Jia","Ruoxi",""],["Song","Dawn",""],["Liang","Percy",""],["Li","Bo",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 21:16:48 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 18:12:27 GMT"}],"updateDate":"2024-08-07","timestamp":1720732608000,"abstract":"  Foundation models (FMs) provide societal benefits but also amplify risks.\nGovernments, companies, and researchers have proposed regulatory frameworks,\nacceptable use policies, and safety benchmarks in response. However, existing\npublic benchmarks often define safety categories based on previous literature,\nintuitions, or common sense, leading to disjointed sets of categories for risks\nspecified in recent regulations and policies, which makes it challenging to\nevaluate and compare FMs across these benchmarks. To bridge this gap, we\nintroduce AIR-Bench 2024, the first AI safety benchmark aligned with emerging\ngovernment regulations and company policies, following the regulation-based\nsafety categories grounded in our AI risks study, AIR 2024. AIR 2024 decomposes\n8 government regulations and 16 company policies into a four-tiered safety\ntaxonomy with 314 granular risk categories in the lowest tier. AIR-Bench 2024\ncontains 5,694 diverse prompts spanning these categories, with manual curation\nand human auditing to ensure quality. We evaluate leading language models on\nAIR-Bench 2024, uncovering insights into their alignment with specified safety\nconcerns. By bridging the gap between public benchmarks and practical AI risks,\nAIR-Bench 2024 provides a foundation for assessing model safety across\njurisdictions, fostering the development of safer and more responsible AI\nsystems.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QcgoxRpCMm5A-T891FIv2S3815jGWvTiAQARgpTkcfg","pdfSize":"37638439"}
