{"id":"2407.03631","title":"On the performance of sequential Bayesian update for database of diverse\n  tsunami scenarios","authors":"Reika Nomura, Louise A. Hirao Vermare, Saneiki Fujita, Donsub Rim,\n  Shuji Moriguchi, Randall J. LeVeque and Kenjiro Terada","authorsParsed":[["Nomura","Reika",""],["Vermare","Louise A. Hirao",""],["Fujita","Saneiki",""],["Rim","Donsub",""],["Moriguchi","Shuji",""],["LeVeque","Randall J.",""],["Terada","Kenjiro",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 04:46:09 GMT"}],"updateDate":"2024-07-08","timestamp":1720068369000,"abstract":"  Although the sequential tsunami scenario detection framework was validated in\nour previous work, several tasks remain to be resolved from a practical point\nof view. This study aims to evaluate the performance of the previous tsunami\nscenario detection framework using a diverse database consisting of complex\nfault rupture patterns with heterogeneous slip distributions. Specifically, we\ncompare the effectiveness of scenario superposition to that of the previous\nmost likely scenario detection method. Additionally, how the length of the\nobservation time window influences the accuracy of both methods is analyzed. We\nutilize an existing database comprising 1771 tsunami scenarios targeting the\ncity Westport (WA, U.S.), which includes synthetic wave height records and\ninundation distributions as the result of fault rupture in the Cascadia\nsubduction zone. The heterogeneous patterns of slips used in the database\nincrease the diversity of the scenarios and thus make it a proper database for\nevaluating the performance of scenario superposition. To assess the\nperformance, we consider various observation time windows shorter than 15\nminutes and divide the database into five testing and learning sets. The\nevaluation accuracy of the maximum offshore wave, inundation depth, and its\ndistribution is analyzed to examine the advantages of the scenario\nsuperposition method over the previous method. We introduce the dynamic time\nwarping (DTW) method as an additional benchmark and compare its results to that\nof the Bayesian scenario detection method.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Machine Learning","Physics/Data Analysis, Statistics and Probability","Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}