{"id":"2407.16689","title":"Robust Preference for Dynamical Dark Energy in DESI BAO and SN\n  Measurements","authors":"William Giar\\`e, Mahdi Najafi, Supriya Pan, Eleonora Di Valentino,\n  Javad T. Firouzjaee","authorsParsed":[["Giarè","William",""],["Najafi","Mahdi",""],["Pan","Supriya",""],["Di Valentino","Eleonora",""],["Firouzjaee","Javad T.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:54:39 GMT"}],"updateDate":"2024-07-24","timestamp":1721757279000,"abstract":"  Recent Baryon Acoustic Oscillation (BAO) measurements released by DESI, when\ncombined with Cosmic Microwave Background (CMB) data from Planck and two\ndifferent samples of Type Ia supernovae (Pantheon-Plus and DESY5) reveal a\npreference for Dynamical Dark Energy (DDE) characterized by a present-day\nquintessence-like equation of state that crossed into the phantom regime in the\npast. A core ansatz for this result is assuming a linear\nChevallier-Polarski-Linder (CPL) parameterization $w(a) = w_0 + w_a (1-a)$ to\ndescribe the evolution of the DE equation of state (EoS). In this paper, we\ntest if and to what extent this assumption impacts the results. To prevent\nbroadening uncertainties in cosmological parameter inference and facilitate\ndirect comparison with the baseline CPL case, we focus on 4 alternative\nwell-known models that, just like CPL, consist of only two free parameters: the\npresent-day DE EoS ($w_0$) and a parameter quantifying its dynamical evolution\n($w_a$). We demonstrate that the preference for DDE remains robust regardless\nof the parameterization: $w_0$ consistently remains in the quintessence regime,\nwhile $w_a$ consistently indicates a preference for a dynamical evolution\ntowards the phantom regime. This tendency is significantly strengthened by\nDESY5 SN measurements. By comparing the best-fit $\\chi^2$ obtained within each\nDDE model, we notice that the linear CPL parameterization is not the\nbest-fitting case. Among the models considered, the EoS proposed by Barboza and\nAlcaniz consistently leads to the most significant improvement.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}