{"id":"2407.21473","title":"Perfect quantum strategies with small input cardinality","authors":"Stefan Trandafir, Junior R. Gonzales-Ureta, Ad\\'an Cabello","authorsParsed":[["Trandafir","Stefan",""],["Gonzales-Ureta","Junior R.",""],["Cabello","Adán",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 09:33:52 GMT"}],"updateDate":"2024-08-02","timestamp":1722418432000,"abstract":"  A perfect strategy is one that allows the mutually in-communicated players of\na nonlocal game to win every trial of the game. Perfect strategies are basic\ntools for some fundamental results in quantum computation and crucial resources\nfor some applications in quantum information. Here, we address the problem of\nproducing qudit-qudit perfect quantum strategies with a small number of\nsettings. For that, we exploit a recent result showing that any perfect quantum\nstrategy induces a Kochen-Specker set. We identify a family of KS sets in even\ndimension $d \\ge 6$ that, for many dimensions, require the smallest number of\northogonal bases known: $d+1$. This family was only defined for some $d$. We\nfirst extend the family to infinitely many more dimensions. Then, we show the\noptimal way to use each of these sets to produce a bipartite perfect strategy\nwith minimum input cardinality. As a result, we present a family of perfect\nquantum strategies in any $(2,d-1,d)$ Bell scenario, with $d = 2^kp^m$ for $p$\nprime, $m \\geq k \\geq 0$ (excluding $m=k=0$), $d = 8p$ for $p \\geq 19$, $d=kp$\nfor $p > ((k-2)2^{k-2})^2$ whenever there exists a Hadamard matrix of order\n$k$, other sporadic examples, as well as a recursive construction that produces\nperfect quantum strategies for infinitely many dimensions $d$ from any\ndimension $d'$ with a perfect quantum strategy. We identify their associated\nBell inequalities and prove that they are not tight, which provides a second\ncounterexample to a conjecture of 2007.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}