{"id":"2407.16287","title":"Zero-dimensional Analysis of Thermal Choking in Arbitrary Duct with\n  Application to Dual-mode Ramjet Combustor","authors":"N Ananthkrishnan and K Sreesankar","authorsParsed":[["Ananthkrishnan","N",""],["Sreesankar","K",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 08:42:39 GMT"}],"updateDate":"2024-07-24","timestamp":1721724159000,"abstract":"  Thermal choking in combustor ducts is a matter of great interest to\nresearchers involved in the design and analysis of combustors. In case of\nscramjet combustors, a thermally choked state is undesirable whereas for a\ndual-mode combustor in the ram mode it is essential. Since real-life combustors\nfeature volume heat addition due to combustion, area variation, wall heat loss\nand frictional losses, all of these effects must be included in the analysis.\nThe standard Rayleigh flow assumes a constant-area duct with no frictional\neffects and a single heat addition/loss term without distinguishing between\ncombustion and wall heat transfer effects. Instead, a generalized Rayleigh flow\nanalysis is employed here which can account for all the above effects and also\nprovide for different fuel injection rates and mixing efficiency. The forward\nand inverse heat transfer problems are stated and solutions are compared\nbetween Rayleigh flow in constant-area and variable-area ducts. The analysis is\nchecked against a scramjet combustor in the literature and then used to study\nthe occurrence of thermal choking in a dual-mode combustor geometry. The\npossibility of thermal choking and the location of the choking event can be\neasily detected by this method. The shift in the thermal choking location with\nvariation in the duct heat and mass transfer state can be easily evaluated. In\nthis manner, the present method provides a quick and accurate tool for\npreliminary design and analysis of ramjet and scramjet combustors.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0SP9GbR5xSF6b-INYU5BxDmBl7nVfalx1Ixgi2Y-1jo","pdfSize":"1346704"}
