{"id":"2407.13671","title":"Liquid Amortization: Proving Amortized Complexity with LiquidHaskell\n  (Functional Pearl)","authors":"Jan van Br\\\"ugge","authorsParsed":[["van Brügge","Jan",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:47:34 GMT"}],"updateDate":"2024-07-19","timestamp":1721321254000,"abstract":"  Formal reasoning about the time complexity of algorithms and data structures\nis usually done in interactive theorem provers like Isabelle/HOL. This includes\nreasoning about amortized time complexity which looks at the worst case\nperformance over a series of operations. However, most programs are not written\nwithin a theorem prover and thus use the data structures of the production\nlanguage. To verify the correctness it is necessary to translate the data\nstructures from the production language into the language of the prover. Such a\ntranslation step could introduce errors, for example due to a mismatch in\nfeatures between the two languages. We show how to prove amortized complexity\nof data structures directly in Haskell using LiquidHaskell. Besides skipping\nthe translation step, our approach can also provide a didactic advantage.\nLearners do not have to learn an additional language for proofs and can focus\non the new concepts only. For this paper, we do not assume prior knowledge of\namortized complexity as we explain the concepts and apply them in our first\ncase study, a simple stack with multipop. Moving to more complicated (and\nuseful) data structures, we show that the same technique works for binomial\nheaps which can be used to implement a priority queue. We also prove amortized\ncomplexity bounds for Claessen's version of the finger tree, a sequence-like\ndata structure with constant-time cons/uncons on either end. Finally we discuss\nthe current limitations of LiquidHaskell that made certain versions of the data\nstructures not feasible.\n","subjects":["Computing Research Repository/Computational Complexity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BQm0hm2uq8hqYMQZqtjKvKbWMhX01eIq6zJrALyXjYA","pdfSize":"647130","objectId":"0x1c59f6221843e600f02e22dbea2e7a26f98c3c97e84961062de824e8c27f546f","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
