{"id":"2407.06876","title":"Hamiltonians for Quantum Systems with Contact Interactions","authors":"Daniele Ferretti and Alessandro Teta","authorsParsed":[["Ferretti","Daniele",""],["Teta","Alessandro",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 14:04:11 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 15:24:24 GMT"}],"updateDate":"2024-07-30","timestamp":1720533851000,"abstract":"  We discuss the problem of constructing self-adjoint and lower bounded\nHamiltonians for a system of $n>2$ non-relativistic quantum particles in\ndimension three with contact (or zero-range or $\\delta$) interactions. Such\ninteractions are described by (singular) boundary conditions satisfied at the\ncoincidence hyperplanes, i.e., when the coordinates of two particles coincide.\nFollowing the line of recent works appeared in the literature, we introduce a\nboundary condition slightly modified with respect to usual boundary condition\none has in the one-body problem. With such new boundary condition we can show\nthat the instability property due to the fall to the center phenomenon\ndescribed by Minlos and Faddeev in 1962 is avoided. Then one obtains a\nphysically reasonable Hamiltonian for the system. We apply the method to the\ncase of a gas of $N$ interacting bosons and to the case of $N$ distinguishable\nparticles of equal mass $M$ interacting with a different particle. In the\nlatter case we also discuss the limit of the model for $M \\longrightarrow\n+\\infty$. We show that in the limit one obtains the one-body Hamiltonian for\nthe light particle subject to $N$ (non-local) point interactions placed at\nfixed positions. We will verify that such non-local point interactions do not\nexhibit the ultraviolet pathologies that are present in the case of standard\nlocal point interactions.\n","subjects":["Physics/Mathematical Physics","Condensed Matter/Quantum Gases","Mathematics/Mathematical Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}