{"id":"2407.11197","title":"A Vision to Enhance Trust Requirements for Peer Support Systems by\n  Revisiting Trust Theories","authors":"Yasaman Gheidar, Lysanne Lessard, Yao Yao","authorsParsed":[["Gheidar","Yasaman",""],["Lessard","Lysanne",""],["Yao","Yao",""]],"versions":[{"version":"v1","created":"Thu, 6 Jun 2024 02:21:11 GMT"}],"updateDate":"2024-07-17","timestamp":1717640471000,"abstract":"  This vision paper focuses on the mental health crisis impacting healthcare\nworkers (HCWs), which exacerbated by the COVID-19 pandemic, leads to increased\nstress and psychological issues like burnout. Peer Support Programs (PSP) are a\nrecognized intervention for mitigating these issues. These programs are\nincreasingly being delivered virtually through Peer Support Systems (PSS) for\nincreased convenience and accessibility. However, HCWs perception of these\nsystems results in fear of information sharing, perceived lack of safety, and\nlow participation rate, which challenges these systems ability to achieve their\ngoals. In line with the rich body of research on the requirements and\nproperties of trustworthy systems, we posit that increasing HCWs trust in PSS\ncould address these challenges. However, extant research focuses on objectively\ndefined trustworthiness rather than perceptual trust because trustworthy\nrequirements are viewed as more controllable and easier to operationalize. This\nstudy proposes a novel approach to elicit perceptual trust requirements by\nproposing a trust framework anchored in recognized trust theories from\ndifferent disciplines that unpacks trust into its recognized types and their\nantecedents. This approach allows the identification of trust requirements\nbeyond those already proposed for trustworthy systems, providing a strong\nfoundation for improving the effectiveness of PSS for HCWs. Keywords: Trust\nRequirements, Requirements elicitation, Peer support systems, Healthcare\nworkers\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}