{"id":"2407.14231","title":"Realistic Evaluation of Test-Time Adaptation Algorithms: Unsupervised\n  Hyperparameter Selection","authors":"Sebastian Cygert, Damian S\\'ojka, Tomasz Trzci\\'nski, Bart{\\l}omiej\n  Twardowski","authorsParsed":[["Cygert","Sebastian",""],["Sójka","Damian",""],["Trzciński","Tomasz",""],["Twardowski","Bartłomiej",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 11:58:30 GMT"}],"updateDate":"2024-07-22","timestamp":1721390310000,"abstract":"  Test-Time Adaptation (TTA) has recently emerged as a promising strategy for\ntackling the problem of machine learning model robustness under distribution\nshifts by adapting the model during inference without access to any labels.\nBecause of task difficulty, hyperparameters strongly influence the\neffectiveness of adaptation. However, the literature has provided little\nexploration into optimal hyperparameter selection. In this work, we tackle this\nproblem by evaluating existing TTA methods using surrogate-based hp-selection\nstrategies (which do not assume access to the test labels) to obtain a more\nrealistic evaluation of their performance. We show that some of the recent\nstate-of-the-art methods exhibit inferior performance compared to the previous\nalgorithms when using our more realistic evaluation setup. Further, we show\nthat forgetting is still a problem in TTA as the only method that is robust to\nhp-selection resets the model to the initial state at every step. We analyze\ndifferent types of unsupervised selection strategies, and while they work\nreasonably well in most scenarios, the only strategies that work consistently\nwell use some kind of supervision (either by a limited number of annotated test\nsamples or by using pretraining data). Our findings underscore the need for\nfurther research with more rigorous benchmarking by explicitly stating model\nselection strategies, to facilitate which we open-source our code.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cRLlKYtWVKAhsysv3gCsCYIjEomK5LxVySiTGGmG_8A","pdfSize":"11855955"}
