{"id":"2407.15655","title":"Imprint of the magnetic activity cycle on solar asteroseismic\n  characterisation based on 26 years of GOLF and BiSON data","authors":"J\\'er\\^ome B\\'etrisey, Martin Farnir, Sylvain N. Breton, Rafael A.\n  Garc\\'ia, Anne-Marie Broomhall, Anish M. Amarsi, Oleg Kochukhov","authorsParsed":[["Bétrisey","Jérôme",""],["Farnir","Martin",""],["Breton","Sylvain N.",""],["García","Rafael A.",""],["Broomhall","Anne-Marie",""],["Amarsi","Anish M.",""],["Kochukhov","Oleg",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:16:08 GMT"}],"updateDate":"2024-08-14","timestamp":1721657768000,"abstract":"  Building on the success of previous missions, asteroseismic modelling will\nplay a key role in future space-based missions, such as PLATO, CubeSpec, and\nRoman. Despite remarkable achievements, asteroseismology has revealed\nsignificant discrepancies in the physics of theoretical stellar models, which\nhave the potential to bias stellar characterisation at the precision level\ndemanded by PLATO. The current modelling strategies largely overlook magnetic\nactivity, assuming that its effects are masked by filtering the so-called\nsurface effects. Given the presence of activity cycles in multiple solar-like\noscillators, and activity variations in a significant fraction of Kepler\nobservations of main-sequence stars (Santos et al. 2019b, 2021, 2023), we\nmeasured the impact of magnetic activity on the asteroseismic characterisation\nof the Sun based on 26.5 years of GOLF and BiSON observations. While magnetic\nactivity is partially absorbed in the treatment of surface effects, we found a\ndiscernible imprint of the activity cycle in the determination of the solar\nage. Notably, this imprint persists across both BiSON and GOLF datasets, with\nsignificant variations of up to 6.5% observed between solar minima and maxima.\nConsidering that the Sun exhibits low levels of activity, our study underscores\nthe looming challenge posed by magnetic activity for future photometry\nmissions, and prompts a potential reevaluation of the asteroseismic\ncharacterisation of Kepler's most active targets.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}