{"id":"2407.03787","title":"What if? Numerical weather prediction at the crossroads","authors":"Peter Bauer","authorsParsed":[["Bauer","Peter",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 09:51:11 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 13:49:28 GMT"}],"updateDate":"2024-09-06","timestamp":1720086671000,"abstract":"  This paper provides an outlook on the future of operational weather\nprediction given the recent evolution in science, computing and machine\nlearning. In many parts, this evolution strongly deviates from the strategy\noperational centres have formulated only several years ago. New opportunities\nin digital technology have greatly accelerated progress, and the full\nintegration of computational science in numerical weather prediction centres is\ncommon knowledge now. Within the last few years, a vast machine learning\nresearch community has emerged for creating new and tailor-made products,\naccelerating processing and - most of all - creating emulators for the entire\nproduction of global forecasts that outperform traditional systems at the\nspatial resolution of the training data. In this context, the role of both\nnumerical models and observations is changing from being equation to data\ndriven. Analyses and reanalyses are becoming the new currency for training\nmachine learning, and operational centres are in a powerful position as they\ngenerate these datasets based on decades worth of experience. This environment\ncreates incredible opportunities to progress much faster than in the past but\nalso uncertainties about what the strategic implications on defining\ncost-effective and sustainable research and operations are, and how to achieve\nsufficient high-performance computing and data handling capacities. It will\ntake individual national public services a while to understand what to focus on\nand how to coordinate their substantial investments in staff and infrastructure\nat institutional, national and international level. This paper addresses this\nnew situation operational weather prediction finds itself in through\nformulating the most likely \"what if?\" scenarios for the near future and\nprovides an outline for how weather centres could adapt.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}