{"id":"2407.20243","title":"Matryoshka-Adaptor: Unsupervised and Supervised Tuning for Smaller\n  Embedding Dimensions","authors":"Jinsung Yoon, Raj Sinha, Sercan O Arik, Tomas Pfister","authorsParsed":[["Yoon","Jinsung",""],["Sinha","Raj",""],["Arik","Sercan O",""],["Pfister","Tomas",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 18:03:29 GMT"}],"updateDate":"2024-07-31","timestamp":1721239409000,"abstract":"  Embeddings from Large Language Models (LLMs) have emerged as critical\ncomponents in various applications, particularly for information retrieval.\nWhile high-dimensional embeddings generally demonstrate superior performance as\nthey contain more salient information, their practical application is\nfrequently hindered by elevated computational latency and the associated higher\ncost. To address these challenges, we propose Matryoshka-Adaptor, a novel\ntuning framework designed for the customization of LLM embeddings.\nMatryoshka-Adaptor facilitates substantial dimensionality reduction while\nmaintaining comparable performance levels, thereby achieving a significant\nenhancement in computational efficiency and cost-effectiveness. Our framework\ndirectly modifies the embeddings from pre-trained LLMs which is designed to be\nseamlessly integrated with any LLM architecture, encompassing those accessible\nexclusively through black-box APIs. Also, it exhibits efficacy in both\nunsupervised and supervised learning settings. A rigorous evaluation conducted\nacross a diverse corpus of English, multilingual, and multimodal datasets\nconsistently reveals substantial gains with Matryoshka-Adaptor. Notably, with\nGoogle and OpenAI Embedding APIs, Matryoshka-Adaptor achieves a reduction in\ndimensionality ranging from two- to twelve-fold without compromising\nperformance across multiple BEIR datasets.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sAbBkgsChseFjGWKw_EyYWfytmyRVOal-l3WhX5ntY4","pdfSize":"2422680","objectId":"0xbc78702a2ef9abe64fca6874705c5b28591620cf69ec51a5528d07d5198ff480","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
