{"id":"2407.05419","title":"Multimodal Language Models for Domain-Specific Procedural Video\n  Summarization","authors":"Nafisa Hussain","authorsParsed":[["Hussain","Nafisa",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 15:50:46 GMT"}],"updateDate":"2024-07-09","timestamp":1720367446000,"abstract":"  Videos serve as a powerful medium to convey ideas, tell stories, and provide\ndetailed instructions, especially through long-format tutorials. Such tutorials\nare valuable for learning new skills at one's own pace, yet they can be\noverwhelming due to their length and dense content. Viewers often seek specific\ninformation, like precise measurements or step-by-step execution details,\nmaking it essential to extract and summarize key segments efficiently. An\nintelligent, time-sensitive video assistant capable of summarizing and\ndetecting highlights in long videos is highly sought after. Recent advancements\nin Multimodal Large Language Models offer promising solutions to develop such\nan assistant. Our research explores the use of multimodal models to enhance\nvideo summarization and step-by-step instruction generation within specific\ndomains. These models need to understand temporal events and relationships\namong actions across video frames. Our approach focuses on fine-tuning TimeChat\nto improve its performance in specific domains: cooking and medical procedures.\nBy training the model on domain-specific datasets like Tasty for cooking and\nMedVidQA for medical procedures, we aim to enhance its ability to generate\nconcise, accurate summaries of instructional videos. We curate and restructure\nthese datasets to create high-quality video-centric instruction data. Our\nfindings indicate that when finetuned on domain-specific procedural data,\nTimeChat can significantly improve the extraction and summarization of key\ninstructional steps in long-format videos. This research demonstrates the\npotential of specialized multimodal models to assist with practical tasks by\nproviding personalized, step-by-step guidance tailored to the unique aspects of\neach domain.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}