{"id":"2407.07562","title":"Transforming qubits via quasi-geometric approaches","authors":"Nyirahafashimana Valentine, Nurisya Mohd Shah, Umair Abdul Halim,\n  Sharifah Kartini Said Husain, Ahmed Jellal","authorsParsed":[["Valentine","Nyirahafashimana",""],["Shah","Nurisya Mohd",""],["Halim","Umair Abdul",""],["Husain","Sharifah Kartini Said",""],["Jellal","Ahmed",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 11:41:26 GMT"}],"updateDate":"2024-07-11","timestamp":1720611686000,"abstract":"  We develop a theory based on quasi-geometric (QG) approach to transform a\nsmall number of qubits into a larger number of error-correcting qubits by\nconsidering four different cases. More precisely, we use the 2-dimensional\nquasi-orthogonal complete complementary codes (2D-QOCCCSs) and quasi-cyclic\nasymmetric quantum error-correcting codes (AQECCs) via quasigroup and group\ntheory properties. We integrate the Pauli $X$-gate to detect and correct\nerrors, as well as the Hadamard $H$-gate to superpose the initial and final\nqubits in the quantum circuit diagram. We compare the numerical results to\nanalyze the success, consistency, and performance of the corrected errors\nthrough bar graphs for 2D-QOCCCs and AQECCs according to their characteristics.\nThe difficulty in generating additional sets of results and counts for AQECCs\narises because mapping a smaller initial number of qubits to a larger final\nnumber is necessary to correct more errors. For AQECCs, the number of errors\nthat can be corrected must be equal to or less than the initial number of\nqubits. High error correction performance is observed when mapping 1-qubit\nstate to 29-qubits to correct 5 errors using 2D-QOCCCs. Similarly, transforming\n1-qubit to 13-qubits using AQECCs also shows high performance, successfully\ncorrecting 2 errors. The results show that our theory has the advantage of\nproviding a basis for refining and optimizing these codes in future quantum\ncomputing applications due to its high performance in error correction.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"W0YWvw4_uDs8kt4kDPSp3fJaLguMaOTLMr033OmDYnI","pdfSize":"1628962","objectId":"0xdf92a17dc5b8af111ed3add957bb0e083dfad7c6eec9a74bd006cee01d4e4960","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
