{"id":"2407.13210","title":"Improved Esophageal Varices Assessment from Non-Contrast CT Scans","authors":"Chunli Li, Xiaoming Zhang, Yuan Gao, Xiaoli Yin, Le Lu, Ling Zhang, Ke\n  Yan, Yu Shi","authorsParsed":[["Li","Chunli",""],["Zhang","Xiaoming",""],["Gao","Yuan",""],["Yin","Xiaoli",""],["Lu","Le",""],["Zhang","Ling",""],["Yan","Ke",""],["Shi","Yu",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 06:49:10 GMT"}],"updateDate":"2024-07-19","timestamp":1721285350000,"abstract":"  Esophageal varices (EV), a serious health concern resulting from portal\nhypertension, are traditionally diagnosed through invasive endoscopic\nprocedures. Despite non-contrast computed tomography (NC-CT) imaging being a\nless expensive and non-invasive imaging modality, it has yet to gain full\nacceptance as a primary clinical diagnostic tool for EV evaluation. To overcome\nexisting diagnostic challenges, we present the Multi-Organ-cOhesion-Network\n(MOON), a novel framework enhancing the analysis of critical organ features in\nNC-CT scans for effective assessment of EV. Drawing inspiration from the\nthorough assessment practices of radiologists, MOON establishes a cohesive\nmultiorgan analysis model that unifies the imaging features of the related\norgans of EV, namely esophagus, liver, and spleen. This integration\nsignificantly increases the diagnostic accuracy for EV. We have compiled an\nextensive NC-CT dataset of 1,255 patients diagnosed with EV, spanning three\ngrades of severity. Each case is corroborated by endoscopic diagnostic results.\nThe efficacy of MOON has been substantiated through a validation process\ninvolving multi-fold cross-validation on 1,010 cases and an independent test on\n245 cases, exhibiting superior diagnostic performance compared to methods\nfocusing solely on the esophagus (for classifying severe grade: AUC of 0.864\nversus 0.803, and for moderate to severe grades: AUC of 0.832 versus 0.793). To\nour knowledge, MOON is the first work to incorporate a synchronized multi-organ\nNC-CT analysis for EV assessment, providing a more acceptable and minimally\ninvasive alternative for patients compared to traditional endoscopy.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"_rVkVRRJ-vklkEcQ08tRK0BxeIQg_yWwpe646DaZ5hY","pdfSize":"1036331"}
