{"id":"2407.03373","title":"Low-rank plus diagonal approximations for Riccati-like matrix\n  differential equations","authors":"Silv\\`ere Bonnabel (CAOR), Marc Lambert (Inria, DGA), Francis Bach\n  (LIENS, SIERRA)","authorsParsed":[["Bonnabel","Silvère","","CAOR"],["Lambert","Marc","","Inria, DGA"],["Bach","Francis","","LIENS, SIERRA"]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:06:13 GMT"}],"updateDate":"2024-07-08","timestamp":1719821173000,"abstract":"  We consider the problem of computing tractable approximations of\ntime-dependent d x d large positive semi-definite (PSD) matrices defined as\nsolutions of a matrix differential equation. We propose to use \"low-rank plus\ndiagonal\" PSD matrices as approximations that can be stored with a memory cost\nbeing linear in the high dimension d. To constrain the solution of the\ndifferential equation to remain in that subset, we project the derivative at\nall times onto the tangent space to the subset, following the methodology of\ndynamical low-rank approximation. We derive a closed-form formula for the\nprojection, and show that after some manipulations it can be computed with a\nnumerical cost being linear in d, allowing for tractable implementation.\nContrary to previous approaches based on pure low-rank approximations, the\naddition of the diagonal term allows for our approximations to be invertible\nmatrices, that can moreover be inverted with linear cost in d. We apply the\ntechnique to Riccati-like equations, then to two particular problems. Firstly a\nlow-rank approximation to our recent Wasserstein gradient flow for Gaussian\napproximation of posterior distributions in approximate Bayesian inference, and\nsecondly a novel low-rank approximation of the Kalman filter for\nhigh-dimensional systems. Numerical simulations illustrate the results.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}