{"id":"2407.15650","title":"Sharp commutator estimates of all order for Coulomb and Riesz modulated\n  energies","authors":"Matthew Rosenzweig, Sylvia Serfaty","authorsParsed":[["Rosenzweig","Matthew",""],["Serfaty","Sylvia",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:07:56 GMT"}],"updateDate":"2024-07-23","timestamp":1721657276000,"abstract":"  We prove functional inequalities in any dimension controlling the iterated\nderivatives along a transport of the Coulomb or super-Coulomb Riesz modulated\nenergy in terms of the modulated energy itself. This modulated energy was\nintroduced by the second author and collaborators in the study of mean-field\nlimits and statistical mechanics of Coulomb/Riesz gases, where control of such\nderivatives by the energy itself is an essential ingredient. In this paper, we\nextend and improve such functional inequalities, proving estimates which are\nnow sharp in their additive error term, in their density dependence, valid at\narbitrary order of differentiation, and localizable to the support of the\ntransport. Our method relies on the observation that these iterated derivatives\nare the quadratic form of a commutator. Taking advantage of the Riesz nature of\nthe interaction, we identify these commutators as solutions to a degenerate\nelliptic equation with a right-hand side exhibiting a recursive structure in\nterms of lower-order commutators and develop a local regularity theory for the\ncommutators, which may be of independent interest.\n  These estimates have applications to obtaining sharp rates of convergence for\nmean-field limits, quasi-neutral limits, and in proving central limit theorems\nfor the fluctuations of Coulomb/Riesz gases. In particular, we show here the\nexpected $N^{\\frac{\\mathsf{s}}{\\mathsf{d}}-1}$-rate in the modulated energy\ndistance for the mean-field convergence of first-order Hamiltonian and gradient\nflows.\n","subjects":["Mathematics/Analysis of PDEs","Physics/Mathematical Physics","Mathematics/Classical Analysis and ODEs","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}