{"id":"2407.08529","title":"Enhancing Privacy of Spatiotemporal Federated Learning against Gradient\n  Inversion Attacks","authors":"Lele Zheng, Yang Cao, Renhe Jiang, Kenjiro Taura, Yulong Shen, Sheng\n  Li, and Masatoshi Yoshikawa","authorsParsed":[["Zheng","Lele",""],["Cao","Yang",""],["Jiang","Renhe",""],["Taura","Kenjiro",""],["Shen","Yulong",""],["Li","Sheng",""],["Yoshikawa","Masatoshi",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:17:02 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 01:37:44 GMT"},{"version":"v3","created":"Mon, 15 Jul 2024 06:42:31 GMT"}],"updateDate":"2024-07-16","timestamp":1720707422000,"abstract":"  Spatiotemporal federated learning has recently raised intensive studies due\nto its ability to train valuable models with only shared gradients in various\nlocation-based services. On the other hand, recent studies have shown that\nshared gradients may be subject to gradient inversion attacks (GIA) on images\nor texts. However, so far there has not been any systematic study of the\ngradient inversion attacks in spatiotemporal federated learning. In this paper,\nwe explore the gradient attack problem in spatiotemporal federated learning\nfrom attack and defense perspectives. To understand privacy risks in\nspatiotemporal federated learning, we first propose Spatiotemporal Gradient\nInversion Attack (ST-GIA), a gradient attack algorithm tailored to\nspatiotemporal data that successfully reconstructs the original location from\ngradients. Furthermore, we design an adaptive defense strategy to mitigate\ngradient inversion attacks in spatiotemporal federated learning. By dynamically\nadjusting the perturbation levels, we can offer tailored protection for varying\nrounds of training data, thereby achieving a better trade-off between privacy\nand utility than current state-of-the-art methods. Through intensive\nexperimental analysis on three real-world datasets, we reveal that the proposed\ndefense strategy can well preserve the utility of spatiotemporal federated\nlearning with effective security protection.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}