{"id":"2407.07720","title":"Exploiting Scale-Variant Attention for Segmenting Small Medical Objects","authors":"Wei Dai, Rui Liu, Zixuan Wu, Tianyi Wu, Min Wang, Junxian Zhou, Yixuan\n  Yuan, Jun Liu","authorsParsed":[["Dai","Wei",""],["Liu","Rui",""],["Wu","Zixuan",""],["Wu","Tianyi",""],["Wang","Min",""],["Zhou","Junxian",""],["Yuan","Yixuan",""],["Liu","Jun",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 14:53:37 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 02:55:17 GMT"},{"version":"v3","created":"Thu, 25 Jul 2024 11:15:37 GMT"},{"version":"v4","created":"Mon, 5 Aug 2024 07:56:29 GMT"}],"updateDate":"2024-08-06","timestamp":1720623217000,"abstract":"  Early detection and accurate diagnosis can predict the risk of malignant\ndisease transformation, thereby increasing the probability of effective\ntreatment. Identifying mild syndrome with small pathological regions serves as\nan ominous warning and is fundamental in the early diagnosis of diseases. While\ndeep learning algorithms, particularly convolutional neural networks (CNNs),\nhave shown promise in segmenting medical objects, analyzing small areas in\nmedical images remains challenging. This difficulty arises due to information\nlosses and compression defects from convolution and pooling operations in CNNs,\nwhich become more pronounced as the network deepens, especially for small\nmedical objects. To address these challenges, we propose a novel scale-variant\nattention-based network (SvANet) for accurately segmenting small-scale objects\nin medical images. The SvANet consists of scale-variant attention, cross-scale\nguidance, Monte Carlo attention, and vision transformer, which incorporates\ncross-scale features and alleviates compression artifacts for enhancing the\ndiscrimination of small medical objects. Quantitative experimental results\ndemonstrate the superior performance of SvANet, achieving 96.12%, 96.11%,\n89.79%, 84.15%, 80.25%, 73.05%, and 72.58% in mean Dice coefficient for\nsegmenting kidney tumors, skin lesions, hepatic tumors, polyps, surgical\nexcision cells, retinal vasculatures, and sperms, which occupy less than 1% of\nthe image areas in KiTS23, ISIC 2018, ATLAS, PolypGen, TissueNet, FIVES, and\nSpermHealth datasets, respectively.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"q9JH9HCBfRMUn1ob65_4PCHSZuUDClZOiqF6W1RHkMM","pdfSize":"9244118"}
