{"id":"2407.06526","title":"Power handling in a highly-radiative negative triangularity pilot plant","authors":"M.A. Miller, D. Arnold, M. Wigram, A.O. Nelson, J. Witham, G.\n  Rutherford, H. Choudhury, C. Cummings, C. Paz-Soldan, D.G. Whyte","authorsParsed":[["Miller","M. A.",""],["Arnold","D.",""],["Wigram","M.",""],["Nelson","A. O.",""],["Witham","J.",""],["Rutherford","G.",""],["Choudhury","H.",""],["Cummings","C.",""],["Paz-Soldan","C.",""],["Whyte","D. G.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 03:52:06 GMT"}],"updateDate":"2024-07-10","timestamp":1720497126000,"abstract":"  This work explores power handling solutions for high-field, highly-radiative\nnegative triangularity (NT) reactors based around the MANTA concept\n\\cite{rutherford_manta_2024}. The divertor design is kept as simple as\npossible, opting for a standard divertor with standard leg length. FreeGS is\nused to create an equilibrium for the boundary region, prioritizing a short\nouter leg length of only $\\sim$50 cm ($\\sim$40\\% of the minor radius). The\nUEDGE code package is used for the boundary plasma solution, to track plasma\ntemperatures and fluxes to the divertor targets. It is found that for\n$P_\\mathrm{SOL}$ = 25 MW and $n_\\mathrm{sep} = 0.96 \\times 10^{20}$ m$^{-3}$,\nconditions consistent with initial core transport modeling, little additional\npower mitigation is necessary. For external impurity injection of just 0.13\\%\nNe, the peak heat flux density at the more heavily loaded outer targets falls\nto 7.8 MW/m$^{2}$, while the electron temperature $T_\\mathrm{e}$ remains just\nunder 5 eV. Scans around the parameter space reveal that even at densities\nlower than in the primary operating scenario, $P_\\mathrm{SOL}$ can be increased\nup to 50 MW, so long as a slightly higher fraction of extrinsic radiator is\nused. With less than 1\\% neon (Ne) impurity content, the divertor still\nexperiences less than 10 MW/m$^{2}$ at the outer target. Design of the\nplasma-facing components includes a close-fitting vacuum vessel with a tungsten\ninner surface as well as FLiBe-carrying cooling channels fashioned into the VV\nwall directly behind the divertor targets. For the seeded heat flux profile,\nAnsys Fluent heat transfer simulations estimate that the outer target\ntemperature remains at just below 1550\\degree C. Initial scoping of advanced\ndivertor designs shows that for an X-divertor, detachment of the outer target\nbecomes much simpler, and plasma fluxes to the targets drop considerably with\nonly 0.01\\% Ne content.\n","subjects":["Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}