{"id":"2407.21743","title":"The frequency of transiting planetary systems around polluted white\n  dwarfs","authors":"Akshay Robert, Jay Farihi, Vincent Van Eylen, Amornrat Aungwerojwit,\n  Boris T. G\\\"ansicke, Seth Redfield, Vikram S. Dhillon, Thomas R. Marsh,\n  Andrew Swan","authorsParsed":[["Robert","Akshay",""],["Farihi","Jay",""],["Van Eylen","Vincent",""],["Aungwerojwit","Amornrat",""],["Gänsicke","Boris T.",""],["Redfield","Seth",""],["Dhillon","Vikram S.",""],["Marsh","Thomas R.",""],["Swan","Andrew",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 16:55:19 GMT"}],"updateDate":"2024-08-01","timestamp":1722444919000,"abstract":"  This paper investigates the frequency of transiting planetary systems around\nmetal-polluted white dwarfs using high-cadence photometry from ULTRACAM and\nULTRASPEC on the ground, and space-based observations with TESS. Within a\nsample of 313 metal-polluted white dwarfs with available TESS light curves, two\nsystems known to have irregular transits are blindly recovered by\nbox-least-squares and Lomb-Scargle analyses, with no new detections, yielding a\ntransit fraction of 0.8 (-0.4, +0.6) per cent. Planet detection sensitivities\nare determined using simulated transit injection and recovery for all light\ncurves, producing upper limit occurrences over radii from dwarf to Kronian\nplanets, with periods from 1 h to 27 d. The dearth of short-period, transiting\nplanets orbiting polluted white dwarfs is consistent with engulfment during the\ngiant phases of stellar evolution, and modestly constrains dynamical\nre-injection of planets to the shortest orbital periods. Based on simple\npredictions of transit probability, where (R + Rp)/a ~ 0.01, the findings here\nare nominally consistent with a model where 100 per cent of polluted white\ndwarfs have circumstellar debris near the Roche limit; however, the small\nsample size precludes statistical confidence in this result. Single transits\nare also ruled out in all light curves using a search for correlated outliers,\nproviding weak constraints on the role of Oort-like comet clouds in white dwarf\npollution.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_OjoBEOCs6Tjrx8-U9hFSSNOUTZaKweUv9dAoNp1-GY","pdfSize":"1223681"}
