{"id":"2407.04808","title":"Brain Age Estimation with a Greedy Dual-Stream Model for Limited\n  Datasets","authors":"Iman Kianian, Hedieh Sajedi","authorsParsed":[["Kianian","Iman",""],["Sajedi","Hedieh",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 18:44:57 GMT"}],"updateDate":"2024-07-09","timestamp":1720205097000,"abstract":"  Brain age estimation involves predicting the biological age of individuals\nfrom their brain images, which offers valuable insights into the aging process\nand the progression of neurodegenerative diseases. Conducting large-scale\ndatasets for medical image analysis is a challenging and time-consuming task.\nExisting approaches mostly depend on large datasets, which are hard to come by\nand expensive. These approaches also require sophisticated, resource-intensive\nmodels with a large number of parameters, necessitating a considerable amount\nof processing power. As a result, there is a vital need to develop innovative\nmethods that can achieve robust performance with limited datasets and efficient\nuse of computational resources. This paper proposes a novel slice-based\ndual-stream method called GDSM (Greedy Dual-Stream Model) for brain age\nestimation. This method addresses the limitations of large dataset requirements\nand computational resource intensiveness. The proposed method incorporates\nlocal and global aspects of the brain, thereby refining the focus on specific\ntarget regions. The approach employs four backbones to predict ages based on\nlocal and global features, complemented by a final model for age correction.\nOur method demonstrates a Mean Absolute Error (MAE) of 3.25 years on the test\nset of IBID, which only contains 289 subjects. To demonstrate the robustness of\nour approach for any small dataset, we analyzed the proposed method with the\nIXI dataset and achieved an MAE of 4.18 years on the test set of IXI. By\nleveraging dual-stream and greedy strategies, this approach achieves efficiency\nand robust performance, making it comparable with other state-of-the-art\nmethods. The code for the GDSM model is available at\nhttps://github.com/iman2693/GDSM.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}