{"id":"2407.14519","title":"Electricity Consumption of Ethereum and Filecoin: Advances in Models and\n  Estimates","authors":"Elitsa Pankovska, Ashish Rajendra Sai, Harald Vranken, Alan Ransil","authorsParsed":[["Pankovska","Elitsa",""],["Sai","Ashish Rajendra",""],["Vranken","Harald",""],["Ransil","Alan",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 12:28:28 GMT"}],"updateDate":"2024-07-23","timestamp":1720096108000,"abstract":"  The high electricity consumption of cryptocurrencies that rely on\nproof-of-work (PoW) consensus algorithms has raised serious environmental\nconcerns due to its association with carbon emissions and strain on energy\ngrids. There has been significant research into estimating the electricity\nconsumption of PoW-based cryptocurrencies and developing alternatives to PoW.\n  In this article, we introduce refined models to estimate the electricity\nconsumption of two prominent alternatives: Ethereum, now utilizing\nproof-of-stake (PoS), and Filecoin, which employs proof-of-spacetime (PoSt).\nEthereum stands as a leading blockchain platform for crafting decentralized\napplications, whereas Filecoin is recognized as the world's foremost\ndecentralized data storage network.\n  Prior studies for modeling electricity consumption have been criticized for\nmethodological flaws and shortcomings, low-quality data, and unvalidated\nassumptions. We improve on this in several ways: we obtain more novel,\nvalidated data from the systems in question, extract information from existing\ndata and research, and we improve transparency and reproducibility by clearly\nexplaining and documenting the used methodology and explicitly stating\nunavoidable limitations and assumptions made. When comparing the current, most\nprominent models for Ethereum and Filecoin to our refined models, we find that\ngiven the wide error margins of both the refined models and the ones introduced\nin prior literature, the resulting average estimates are to a large extent in\nline with each other.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}