{"id":"2407.01013","title":"Collaborative Graph Exploration with Reduced Pose-SLAM Uncertainty via\n  Submodular Optimization","authors":"Ruofei Bai, Shenghai Yuan, Hongliang Guo, Pengyu Yin, Wei-Yun Yau,\n  Lihua Xie","authorsParsed":[["Bai","Ruofei",""],["Yuan","Shenghai",""],["Guo","Hongliang",""],["Yin","Pengyu",""],["Yau","Wei-Yun",""],["Xie","Lihua",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 06:54:02 GMT"}],"updateDate":"2024-07-02","timestamp":1719816842000,"abstract":"  This paper considers the collaborative graph exploration problem in\nGPS-denied environments, where a group of robots are required to cover a graph\nenvironment while maintaining reliable pose estimations in collaborative\nsimultaneous localization and mapping (SLAM). Considering both objectives\npresents challenges for multi-robot pathfinding, as it involves the expensive\ncovariance inference for SLAM uncertainty evaluation, especially considering\nvarious combinations of robots' paths. To reduce the computational complexity,\nwe propose an efficient two-stage strategy where exploration paths are first\ngenerated for quick coverage, and then enhanced by adding informative and\ndistance-efficient loop-closing actions, called loop edges, along the paths for\nreliable pose estimation. We formulate the latter problem as a non-monotone\nsubmodular maximization problem by relating SLAM uncertainty with pose graph\ntopology, which (1) facilitates more efficient evaluation of SLAM uncertainty\nthan covariance inference, and (2) allows the application of approximation\nalgorithms in submodular optimization to provide optimality guarantees. We\nfurther introduce the ordering heuristics to improve objective values while\npreserving the optimality bound. Simulation experiments over randomly generated\ngraph environments verify the efficiency of our methods in finding paths for\nquick coverage and enhanced pose graph reliability, and benchmark the\nperformance of the approximation algorithms and the greedy-based algorithm in\nthe loop edge selection problem. Our implementations will be open-source at\nhttps://github.com/bairuofei/CGE.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}