{"id":"2407.13876","title":"Unveiling the purely young star formation history of the SMC's\n  northeastern shell from colour-magnitude diagram fitting","authors":"Joanna D. Sakowska, Noelia E. D. No\\\"el, Tom\\'as Ruiz-Lara, Carme\n  Gallart, Pol Massana, David L. Nidever, Santi Cassisi, Patricio Correa-Amaro,\n  Yumi Choi, Gurtina Besla, Denis Erkal, David Mart\\'inez-Delgado, Matteo\n  Monelli, Knut A. G. Olsen, Guy S. Stringfellow","authorsParsed":[["Sakowska","Joanna D.",""],["Noël","Noelia E. D.",""],["Ruiz-Lara","Tomás",""],["Gallart","Carme",""],["Massana","Pol",""],["Nidever","David L.",""],["Cassisi","Santi",""],["Correa-Amaro","Patricio",""],["Choi","Yumi",""],["Besla","Gurtina",""],["Erkal","Denis",""],["Martínez-Delgado","David",""],["Monelli","Matteo",""],["Olsen","Knut A. G.",""],["Stringfellow","Guy S.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 19:49:21 GMT"}],"updateDate":"2024-07-22","timestamp":1721332161000,"abstract":"  We obtain a quantitative star formation history (SFH) of a shell-like\nstructure ('shell') located in the northeastern part of the Small Magellanic\nCloud (SMC). We use the Survey of the MAgellanic Stellar History (SMASH) to\nderive colour-magnitude diagrams (CMDs), reaching below the oldest\nmain-sequence turnoff, from which we compute the SFHs with CMD fitting\ntechniques. We present, for the first time, a novel technique that uses red\nclump (RC) stars from the CMDs to assess and account for the SMC's\nline-of-sight depth effect present during the SFH derivation. We find that\naccounting for this effect recovers a more accurate SFH. We quantify a 7 kpc\nline-of-sight depth present in the CMDs, in good agreement with depth estimates\nfrom RC stars in the northeastern SMC. By isolating the stellar content of the\nnortheastern shell and incorporating the line-of-sight depth into our\ncalculations, we obtain an unprecedentedly detailed SFH. We find that the\nnortheastern shell is primarily composed of stars younger than 500 Myrs, with\nsignificant star formation enhancements around 250 Myr and 450 Myr. These young\nstars are the main contributors to the shell's structure. We show synchronicity\nbetween the northeastern shell's SFH with the Large Magellanic Cloud's (LMC)\nnorthern arm, which we attribute to the interaction history of the SMC with the\nLMC and the Milky Way (MW) over the past 500 Myr. Our results highlight the\ncomplex interplay of ram pressure stripping and the influence of the MW's\ncircumgalactic medium in shaping the SMC's northeastern shell.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}