{"id":"2407.01163","title":"Benchmarking Predictive Coding Networks -- Made Simple","authors":"Luca Pinchetti and Chang Qi and Oleh Lokshyn and Gaspard Olivers and\n  Cornelius Emde and Mufeng Tang and Amine M'Charrak and Simon Frieder and\n  Bayar Menzat and Rafal Bogacz and Thomas Lukasiewicz and Tommaso Salvatori","authorsParsed":[["Pinchetti","Luca",""],["Qi","Chang",""],["Lokshyn","Oleh",""],["Olivers","Gaspard",""],["Emde","Cornelius",""],["Tang","Mufeng",""],["M'Charrak","Amine",""],["Frieder","Simon",""],["Menzat","Bayar",""],["Bogacz","Rafal",""],["Lukasiewicz","Thomas",""],["Salvatori","Tommaso",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 10:33:44 GMT"}],"updateDate":"2024-07-02","timestamp":1719830024000,"abstract":"  In this work, we tackle the problems of efficiency and scalability for\npredictive coding networks in machine learning. To do so, we first propose a\nlibrary called PCX, whose focus lies on performance and simplicity, and\nprovides a user-friendly, deep-learning oriented interface. Second, we use PCX\nto implement a large set of benchmarks for the community to use for their\nexperiments. As most works propose their own tasks and architectures, do not\ncompare one against each other, and focus on small-scale tasks, a simple and\nfast open-source library adopted by the whole community would address all of\nthese concerns. Third, we perform extensive benchmarks using multiple\nalgorithms, setting new state-of-the-art results in multiple tasks and\ndatasets, as well as highlighting limitations inherent to PC that should be\naddressed. Thanks to the efficiency of PCX, we are able to analyze larger\narchitectures than commonly used, providing baselines to galvanize community\nefforts towards one of the main open problems in the field: scalability. The\ncode for PCX is available at \\textit{https://github.com/liukidar/pcax}.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}