{"id":"2407.06183","title":"Stepping on the Edge: Curvature Aware Learning Rate Tuners","authors":"Vincent Roulet, Atish Agarwala, Jean-Bastien Grill, Grzegorz Swirszcz,\n  Mathieu Blondel, Fabian Pedregosa","authorsParsed":[["Roulet","Vincent",""],["Agarwala","Atish",""],["Grill","Jean-Bastien",""],["Swirszcz","Grzegorz",""],["Blondel","Mathieu",""],["Pedregosa","Fabian",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:56:00 GMT"}],"updateDate":"2024-07-09","timestamp":1720461360000,"abstract":"  Curvature information -- particularly, the largest eigenvalue of the loss\nHessian, known as the sharpness -- often forms the basis for learning rate\ntuners. However, recent work has shown that the curvature information undergoes\ncomplex dynamics during training, going from a phase of increasing sharpness to\neventual stabilization. We analyze the closed-loop feedback effect between\nlearning rate tuning and curvature. We find that classical learning rate tuners\nmay yield greater one-step loss reduction, yet they ultimately underperform in\nthe long term when compared to constant learning rates in the full batch\nregime. These models break the stabilization of the sharpness, which we explain\nusing a simplified model of the joint dynamics of the learning rate and the\ncurvature. To further investigate these effects, we introduce a new learning\nrate tuning method, Curvature Dynamics Aware Tuning (CDAT), which prioritizes\nlong term curvature stabilization over instantaneous progress on the objective.\nIn the full batch regime, CDAT shows behavior akin to prefixed warm-up\nschedules on deep learning objectives, outperforming tuned constant learning\nrates. In the mini batch regime, we observe that stochasticity introduces\nconfounding effects that explain the previous success of some learning rate\ntuners at appropriate batch sizes. Our findings highlight the critical role of\nunderstanding the joint dynamics of the learning rate and curvature, beyond\ngreedy minimization, to diagnose failures and design effective adaptive\nlearning rate tuners.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}