{"id":"2407.15959","title":"\"It's a Good Idea to Put It Into Words\": Writing `Rudders' in the\n  Initial Stages of Visualization Design","authors":"Chase Stokes, Clara Hu, and Marti A. Hearst","authorsParsed":[["Stokes","Chase",""],["Hu","Clara",""],["Hearst","Marti A.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:16:35 GMT"}],"updateDate":"2024-07-24","timestamp":1721672195000,"abstract":"  Written language is a useful tool for non-visual creative activities like\nwriting essays and planning searches. This paper investigates the integration\nof written language in to the visualization design process. We create the idea\nof a 'writing rudder,' which acts as a guiding force or strategy for the\ndesign. Via an interview study of 24 working visualization designers, we first\nestablished that only a minority of participants systematically use writing to\naid in design. A second study with 15 visualization designers examined four\ndifferent variants of written rudders: asking questions, stating conclusions,\ncomposing a narrative, and writing titles. Overall, participants had a positive\nreaction; designers recognized the benefits of explicitly writing down\ncomponents of the design and indicated that they would use this approach in\nfuture design work. More specifically, two approaches - writing questions and\nwriting conclusions/takeaways - were seen as beneficial across the design\nprocess, while writing narratives showed promise mainly for the creation stage.\nAlthough concerns around potential bias during data exploration were raised,\nparticipants also discussed strategies to mitigate such concerns. This paper\ncontributes to a deeper understanding of the interplay between language and\nvisualization, and proposes a straightforward, lightweight addition to the\nvisualization design process.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vrykeMge1PtiTBdxymEHGtN1_fGbSYbFoxH7GYmUtOQ","pdfSize":"1408752","objectId":"0x749941f67962eb9443ab16298d580ebd5797e40e89bad9dc73c6a490e02c6abd","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
