{"id":"2407.06416","title":"Hybrid Classical-Quantum architecture for vectorised image\n  classification of hand-written sketches","authors":"Y. Cordero, S. Biswas, F. Vilari\\~no, and M. Bilkis","authorsParsed":[["Cordero","Y.",""],["Biswas","S.",""],["Vilariño","F.",""],["Bilkis","M.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 21:51:20 GMT"}],"updateDate":"2024-07-10","timestamp":1720475480000,"abstract":"  Quantum machine learning (QML) investigates how quantum phenomena can be\nexploited in order to learn data in an alternative way, \\textit{e.g.} by means\nof a quantum computer. While recent results evidence that QML models can\npotentially surpass their classical counterparts' performance in specific\ntasks, quantum technology hardware is still unready to reach quantum advantage\nin tasks of significant relevance to the broad scope of the computer science\ncommunity. Recent advances indicate that hybrid classical-quantum models can\nreadily attain competitive performances at low architecture complexities. Such\ninvestigations are often carried out for image-processing tasks, and are\nnotably constrained to modelling \\textit{raster images}, represented as a grid\nof two-dimensional pixels. Here, we introduce vector-based representation of\nsketch drawings as a test-bed for QML models. Such a lower-dimensional data\nstructure results handful to benchmark model's performance, particularly in\ncurrent transition times, where classical simulations of quantum circuits are\nnaturally limited in the number of qubits, and quantum hardware is not readily\navailable to perform large-scale experiments. We report some encouraging\nresults for primitive hybrid classical-quantum architectures, in a canonical\nsketch recognition problem.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}