{"id":"2407.20480","title":"Direct Observation and Analysis of Low-Energy Magnons with Raman\n  Spectroscopy in Atomically Thin NiPS3","authors":"Woongki Na, Pyeongjae Park, Siwon Oh, Junghyun Kim, Allen Scheie,\n  David Alan Tennant, Hyun Cheol Lee, Je-Geun Park, Hyeonsik Cheong","authorsParsed":[["Na","Woongki",""],["Park","Pyeongjae",""],["Oh","Siwon",""],["Kim","Junghyun",""],["Scheie","Allen",""],["Tennant","David Alan",""],["Lee","Hyun Cheol",""],["Park","Je-Geun",""],["Cheong","Hyeonsik",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 00:52:03 GMT"}],"updateDate":"2024-07-31","timestamp":1722300723000,"abstract":"  Van der Waals (vdW) magnets have rapidly emerged as a fertile playground for\nnovel fundamental physics and exciting applications. Despite the impressive\ndevelopments over the past few years, technical limitations pose a severe\nchallenge to many other potential breakthroughs. High on the list is the lack\nof suitable experimental tools for studying spin dynamics on atomically thin\nsamples. Here, Raman scattering techniques are employed to observe directly the\nlow-lying magnon (~1 meV) even in bilayer NiPS3. The unique advantage is that\nit offers excellent energy resolutions far better on low-energy sides than most\ninelastic neutron spectrometers can offer. More importantly, with appropriate\ntheoretical analysis, the polarization dependence of the Raman scattering by\nthose low-lying magnons also provides otherwise hidden information on the\ndominant spin-exchange scattering paths for different magnons. By comparing\nwith high-resolution inelastic neutron scattering data, these low-energy Raman\nmodes are confirmed to be indeed of magnon origin. Because of the different\nscattering mechanisms involved in inelastic neutron and Raman scattering, this\nnew information is fundamental in pinning down the final spin Hamiltonian. This\nwork demonstrates the capability of Raman spectroscopy to probe the genuine\ntwo-dimensional spin dynamics in atomically-thin vdW magnets, which can provide\nnovel insights that are obscured in bulk spin dynamics.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}