{"id":"2407.02886","title":"A Wolf in Sheep's Clothing: Practical Black-box Adversarial Attacks for\n  Evading Learning-based Windows Malware Detection in the Wild","authors":"Xiang Ling and Zhiyu Wu and Bin Wang and Wei Deng and Jingzheng Wu and\n  Shouling Ji and Tianyue Luo and Yanjun Wu","authorsParsed":[["Ling","Xiang",""],["Wu","Zhiyu",""],["Wang","Bin",""],["Deng","Wei",""],["Wu","Jingzheng",""],["Ji","Shouling",""],["Luo","Tianyue",""],["Wu","Yanjun",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 08:01:19 GMT"}],"updateDate":"2024-07-04","timestamp":1719993679000,"abstract":"  Given the remarkable achievements of existing learning-based malware\ndetection in both academia and industry, this paper presents MalGuise, a\npractical black-box adversarial attack framework that evaluates the security\nrisks of existing learning-based Windows malware detection systems under the\nblack-box setting. MalGuise first employs a novel semantics-preserving\ntransformation of call-based redividing to concurrently manipulate both nodes\nand edges of malware's control-flow graph, making it less noticeable. By\nemploying a Monte-Carlo-tree-search-based optimization, MalGuise then searches\nfor an optimized sequence of call-based redividing transformations to apply to\nthe input Windows malware for evasions. Finally, it reconstructs the\nadversarial malware file based on the optimized transformation sequence while\nadhering to Windows executable format constraints, thereby maintaining the same\nsemantics as the original. MalGuise is systematically evaluated against three\nstate-of-the-art learning-based Windows malware detection systems under the\nblack-box setting. Evaluation results demonstrate that MalGuise achieves a\nremarkably high attack success rate, mostly exceeding 95%, with over 91% of the\ngenerated adversarial malware files maintaining the same semantics.\nFurthermore, MalGuise achieves up to a 74.97% attack success rate against five\nanti-virus products, highlighting potential tangible security concerns to\nreal-world users.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}