{"id":"2407.16606","title":"Learning to Play Foosball: System and Baselines","authors":"Janosch Moos, Cedric Derstroff, Niklas Schr\\\"oder and Debora Clever","authorsParsed":[["Moos","Janosch",""],["Derstroff","Cedric",""],["Schröder","Niklas",""],["Clever","Debora",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 16:11:08 GMT"}],"updateDate":"2024-09-10","timestamp":1721751068000,"abstract":"  This work stages Foosball as a versatile platform for advancing scientific\nresearch, particularly in the realm of robot learning. We present an automated\nFoosball table along with its corresponding simulated counterpart, showcasing a\ndiverse range of challenges through example tasks within the Foosball\nenvironment. Initial findings are shared using a simple baseline approach.\nFoosball constitutes a versatile learning environment with the potential to\nyield cutting-edge research in various fields of artificial intelligence and\nmachine learning, notably robust learning, while also extending its\napplicability to industrial robotics and automation setups. To transform our\nphysical Foosball table into a research-friendly system, we augmented it with a\n2 degrees of freedom kinematic chain to control the goalkeeper rod as an\ninitial setup with the intention to be extended to the full game as soon as\npossible. Our experiments reveal that a realistic simulation is essential for\nmastering complex robotic tasks, yet translating these accomplishments to the\nreal system remains challenging, often accompanied by a performance decline.\nThis emphasizes the critical importance of research in this direction. In this\nconcern, we spotlight the automated Foosball table as an invaluable tool,\npossessing numerous desirable attributes, to serve as a demanding learning\nenvironment for advancing robotics and automation research.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}