{"id":"2407.10844","title":"Improved Uncertainty Estimation of Graph Neural Network Potentials Using\n  Engineered Latent Space Distances","authors":"Joseph Musielewicz, Janice Lan, Matt Uyttendaele, and John R. Kitchin","authorsParsed":[["Musielewicz","Joseph",""],["Lan","Janice",""],["Uyttendaele","Matt",""],["Kitchin","John R.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 15:59:39 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 17:31:16 GMT"}],"updateDate":"2024-08-27","timestamp":1721059179000,"abstract":"  Graph neural networks (GNNs) have been shown to be astonishingly capable\nmodels for molecular property prediction, particularly as surrogates for\nexpensive density functional theory calculations of relaxed energy for novel\nmaterial discovery. However, one limitation of GNNs in this context is the lack\nof useful uncertainty prediction methods, as this is critical to the material\ndiscovery pipeline. In this work, we show that uncertainty quantification for\nrelaxed energy calculations is more complex than uncertainty quantification for\nother kinds of molecular property prediction, due to the effect that structure\noptimizations have on the error distribution. We propose that distribution-free\ntechniques are more useful tools for assessing calibration, recalibrating, and\ndeveloping uncertainty prediction methods for GNNs performing relaxed energy\ncalculations. We also develop a relaxed energy task for evaluating uncertainty\nmethods for equivariant GNNs, based on distribution-free recalibration and\nusing the Open Catalyst Project dataset. We benchmark a set of popular\nuncertainty prediction methods on this task, and show that latent distance\nmethods, with our novel improvements, are the most well-calibrated and\neconomical approach for relaxed energy calculations. Finally, we demonstrate\nthat our latent space distance method produces results which align with our\nexpectations on a clustering example, and on specific equation of state and\nadsorbate coverage examples from outside the training dataset.\n","subjects":["Computing Research Repository/Machine Learning","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WxPhnL74688rI5Ks8kSPfvgtEvclvpuK_NwCAMvePKI","pdfSize":"9143991"}
