{"id":"2407.17879","title":"HG-PIPE: Vision Transformer Acceleration with Hybrid-Grained Pipeline","authors":"Qingyu Guo, Jiayong Wan, Songqiang Xu, Meng Li, Yuan Wang","authorsParsed":[["Guo","Qingyu",""],["Wan","Jiayong",""],["Xu","Songqiang",""],["Li","Meng",""],["Wang","Yuan",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 08:47:40 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 08:18:57 GMT"}],"updateDate":"2024-08-02","timestamp":1721897260000,"abstract":"  Vision Transformer (ViT) acceleration with field programmable gate array\n(FPGA) is promising but challenging. Existing FPGA-based ViT accelerators\nmainly rely on temporal architectures, which process different operators by\nreusing the same hardware blocks and suffer from extensive memory access\noverhead. Pipelined architectures, either coarse-grained or fine-grained,\nunroll the ViT computation spatially for memory access efficiency. However,\nthey usually suffer from significant hardware resource constraints and pipeline\nbubbles induced by the global computation dependency of ViT. In this paper, we\nintroduce HG-PIPE, a pipelined FPGA accelerator for high-throughput and\nlow-latency ViT processing. HG-PIPE features a hybrid-grained pipeline\narchitecture to reduce on-chip buffer cost and couples the computation dataflow\nand parallelism design to eliminate the pipeline bubbles. HG-PIPE further\nintroduces careful approximations to implement both linear and non-linear\noperators with abundant Lookup Tables (LUTs), thus alleviating resource\nconstraints. On a ZCU102 FPGA, HG-PIPE achieves 2.78 times better throughput\nand 2.52 times better resource efficiency than the prior-art accelerators,\ne.g., AutoViTAcc. With a VCK190 FPGA, HG-PIPE realizes end-to-end ViT\nacceleration on a single device and achieves 7118 images/s, which is 2.81 times\nfaster than a V100 GPU.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"0MLUBpNGuBGrZC98X_KemXAffO8IJxncgYcrYtQpjIg","pdfSize":"11555254"}
