{"id":"2407.11719","title":"Pareto local search for a multi-objective demand response problem in\n  residential areas with heat pumps and electric vehicles","authors":"Thomas Dengiz, Andrea Raith, Max Kleinebrahm, Jonathan Vogl, Wolf\n  Fichtner","authorsParsed":[["Dengiz","Thomas",""],["Raith","Andrea",""],["Kleinebrahm","Max",""],["Vogl","Jonathan",""],["Fichtner","Wolf",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 13:38:56 GMT"}],"updateDate":"2024-07-17","timestamp":1721137136000,"abstract":"  In future energy systems characterized by significant shares of fluctuating\nrenewable energy sources, there is a need for a fundamental change in\nelectricity consumption. The energy system requires the ability to adapt to the\nintermittent electricity generation of renewable energy sources. This can be\nachieved by integrating flexible electrical loads, such as electric heating\ndevices and electric vehicles, in combination with efficient control methods.\nIn this paper, we introduce the Pareto local search method PALSS with heuristic\nsearch operations to solve the multi-objective optimization problem of a\nresidential area with different types of flexible loads. PALSS shifts the\nflexible electricity load with the objective of minimizing the electricity cost\nand peak load while maintaining the inhabitants' comfort in favorable ranges.\nFurther, we include reinforcement learning into the heuristic search operations\nin the approach RELAPALSS and use the dichotomous method for obtaining all\nPareto-optimal solutions of the multi-objective optimization problem with\nconflicting goals. The methods are evaluated in simulations with different\nconfigurations of the residential area. The results show that PALSS and\nRELAPALSS strongly outperform the two multi-objective evolutionary algorithms\nNSGA-II and SPEA-II from the literature and the conventional control approach.\nThe inclusion of reinforcement learning in RELAPALSS leads to additional\nimprovements. Our study reveals the need for multi-objective optimization\nmethods to utilize renewable energy sources in residential areas.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}