{"id":"2407.04685","title":"The miscibility of hydrogen and water in planetary atmospheres and\n  interiors","authors":"Akash Gupta, Lars Stixrude, Hilke E. Schlichting","authorsParsed":[["Gupta","Akash",""],["Stixrude","Lars",""],["Schlichting","Hilke E.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 17:47:39 GMT"}],"updateDate":"2024-07-08","timestamp":1720201659000,"abstract":"  Many planets in the solar system and across the galaxy have hydrogen-rich\natmospheres overlying more heavy element-rich interiors with which they\ninteract for billions of years. Atmosphere-interior interactions are thus\ncrucial to understanding the formation and evolution of these bodies. However,\nthis understanding is still lacking in part because the relevant\npressure-temperature conditions are extreme. We conduct molecular dynamics\nsimulations based on Density Functional Theory to investigate how hydrogen and\nwater interact over a wide range of pressure and temperature, encompassing the\ninteriors of Neptune-sized and smaller planets. We determine the critical curve\nat which a single homogeneous phase exsolves into two separate, hydrogen-rich\nand water-rich phases, finding good agreement with existing experimental data.\nWe find that the temperature along the critical curve increases with increasing\npressure and shows the influence of a change in fluid structure from molecular\nto atomic near 30 GPa and 3000 K, which may impact magnetic field generation.\nThe internal temperatures of many exoplanets, including TOI-270 d and K2-18 b\nmay lie entirely above the critical curve: the envelope is expected to consist\nof a single homogeneous hydrogen-water fluid, that is much less susceptible to\natmospheric loss as compared with a pure hydrogen envelope. As planets cool,\nthey cross the critical curve, leading to rainout of water-rich fluid and an\nincrease in internal luminosity. Compositions of the resulting outer,\nhydrogen-rich, and inner, water-rich envelopes depend on age and instellation\nand are governed by thermodynamics. Rainout of water may be occurring in Uranus\nand Neptune at present.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Condensed Matter/Materials Science","Physics/Atmospheric and Oceanic Physics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}