{"id":"2407.11467","title":"TEXasGAN: Tactile Texture Exploration and Synthesis System Using\n  Generative Adversarial Network","authors":"Mingxin Zhang, Shun Terui, Yasutoshi Makino, Hiroyuki Shinoda","authorsParsed":[["Zhang","Mingxin",""],["Terui","Shun",""],["Makino","Yasutoshi",""],["Shinoda","Hiroyuki",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 08:07:41 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 07:04:13 GMT"}],"updateDate":"2024-07-26","timestamp":1721117261000,"abstract":"  To create more realistic experiences in human-virtual object interactions,\ntexture rendering has become a research hotspot in recent years. Different\nfrequency components of designed vibrations can activate texture-related\nsensations due to similar receptors. However, designing specific vibrations for\nnumerous real-world materials is impractical. Therefore, this study proposes a\nhuman-in-the-loop vibration generation model based on user preferences. To\nenable users to easily control the generation of vibration samples with large\nparameter spaces, we introduce an optimization model based on Differential\nSubspace Search (DSS) and Generative Adversarial Network (GAN). With DSS, users\ncan use a one-dimensional slider to easily modify the high-dimensional latent\nspace so that the GAN can generate desired vibrations. We trained the\ngenerative model using a open dataset of tactile vibration data and selected\nfive types of vibrations as target samples for the generation experiment.\nExtensive user experiments were conducted using the generated and real samples.\nThe results indicate that our system can generate distinguishable samples that\nmatch the target characteristics. Moreover, the results also reveal a\ncorrelation between subjects' ability to distinguish real samples and their\nability to distinguish generated samples.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}