{"id":"2407.05670","title":"Influence of capacitance and thermal fluctuations on the Josephson diode\n  effect in asymmetric higher-harmonic SQUIDs","authors":"G. S. Seleznev, Ya. V. Fominov","authorsParsed":[["Seleznev","G. S.",""],["Fominov","Ya. V.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 07:09:37 GMT"}],"updateDate":"2024-07-09","timestamp":1720422577000,"abstract":"  Asymmetric two-junction SQUIDs with different current-phase relations in the\ntwo Josephson junctions, involving higher Josephson harmonics, demonstrate a\nflux-tunable Josephson diode effect (asymmetry between currents flowing in the\nopposite directions, which can be tuned by the magnetic flux through the\ninterferometer loop). We theoretically investigate influence of junction\ncapacitance and thermal fluctuations on performance of such Josephson diodes.\nOur main focus is on the \"minimal model\" with one junction in the SQUID loop\npossessing the sinusoidal current-phase relation and the other one featuring\nadditional second harmonic. Capacitance generally weakens the diode effect in\nthe resistive branch (R state) of the current-voltage characteristic (CVC) both\nin the absence and in the presence of external ac irradiation. At the same\ntime, it leads to qualitatively new features of the Josephson diode effect such\nas asymmetry of the retrapping currents (which are a manifestation of\nhysteretic CVC). In particular, the limiting case of the single-sided\nhysteresis becomes accessible. In its turn, thermal fluctuations are known to\nlead to nonzero average voltages at any finite current, even below the critical\nvalue. We demonstrate that in the diode regime, the fluctuation-induced voltage\ncan become strongly (exponentially) asymmetric. In addition, we find asymmetry\nof the switching currents arising both due to thermal activation and due to\nJosephson plasma resonances in the presence of ac irradiation.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}