{"id":"2407.00117","title":"Machine learning meets mass spectrometry: a focused perspective","authors":"Daniil A. Boiko, Valentine P. Ananikov","authorsParsed":[["Boiko","Daniil A.",""],["Ananikov","Valentine P.",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 14:18:23 GMT"}],"updateDate":"2024-07-02","timestamp":1719497903000,"abstract":"  Mass spectrometry is a widely used method to study molecules and processes in\nmedicine, life sciences, chemistry, catalysis, and industrial product quality\ncontrol, among many other applications. One of the main features of some mass\nspectrometry techniques is the extensive level of characterization (especially\nwhen coupled with chromatography and ion mobility methods, or a part of tandem\nmass spectrometry experiment) and a large amount of generated data per\nmeasurement. Terabyte scales can be easily reached with mass spectrometry\nstudies. Consequently, mass spectrometry has faced the challenge of a high\nlevel of data disappearance. Researchers often neglect and then altogether lose\naccess to the rich information mass spectrometry experiments could provide.\nWith the development of machine learning methods, the opportunity arises to\nunlock the potential of these data, enabling previously inaccessible\ndiscoveries. The present perspective highlights reevaluation of mass\nspectrometry data analysis in the new generation of methods and describes\nsignificant challenges in the field, particularly related to problems involving\nthe use of electrospray ionization. We argue that further applications of\nmachine learning raise new requirements for instrumentation (increasing\nthroughput and information density, decreasing pricing, and making more\nautomation-friendly software), and once met, the field may experience\nsignificant transformation.\n","subjects":["Physics/Chemical Physics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"wvXI2cbTaLiGp1Ja1lovrH76MUqkPrZ7p9uSP3iSWMQ","pdfSize":"1131692"}
