{"id":"2407.02979","title":"Progress on FORS-Up: the first instrument using ELT technologies","authors":"H. M. J. Boffin, V. Baldini, S. Bertocco, G. Calderone, R. Cirami,\n  R.D. Conzelmann, I. Coretti, C. Cumani, D. Del Valle, F. Derie, P. A. Fuerte\n  Rodr\\'iguez, P. Gutierrez Cheetham, J. Kosmalski, A. R. Manescau, P. Di\n  Marcantonio, A. Modigliani, S. Moehler, C. Moins, D. Popovic, M. Porru, J.\n  Reyes, R. Siebenmorgen, V. Strazzullo, and A. Sulich","authorsParsed":[["Boffin","H. M. J.",""],["Baldini","V.",""],["Bertocco","S.",""],["Calderone","G.",""],["Cirami","R.",""],["Conzelmann","R. D.",""],["Coretti","I.",""],["Cumani","C.",""],["Del Valle","D.",""],["Derie","F.",""],["Rodríguez","P. A. Fuerte",""],["Cheetham","P. Gutierrez",""],["Kosmalski","J.",""],["Manescau","A. R.",""],["Di Marcantonio","P.",""],["Modigliani","A.",""],["Moehler","S.",""],["Moins","C.",""],["Popovic","D.",""],["Porru","M.",""],["Reyes","J.",""],["Siebenmorgen","R.",""],["Strazzullo","V.",""],["Sulich","A.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 10:23:02 GMT"}],"updateDate":"2024-07-04","timestamp":1720002182000,"abstract":"  ESO is in the process of upgrading one of the two FORS (FOcal Reducer/low\ndispersion Spectrograph) instruments - a multi-mode (imaging, polarimetry,\nlong-slit, and multi-object spectroscopy) optical instrument mounted on the\nCassegrain focus of Unit Telescope 1 of ESO's Very Large Telescope. FORS1 was\nmoved from Chile to Trieste, and is undergoing complete refurbishment,\nincluding the exchange of all motorised parts. In addition, new software is\ndeveloped, based on the Extremely Large Telescope Instrument Control Software\nFramework, as the upgraded FORS1 will be the first instrument in operations to\nuse this framework. The new Teledyne e2V CCD has now been procured and is\nundergoing testing with the New Generation Controller at ESO. In addition, a\nnew set of grisms have been developed, and a new set of filters will be\npurchased. A new internal calibration unit has been designed, making the\noperations more efficient.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}