{"id":"2407.04692","title":"Eigen-decomposition of Covariance matrices: An application to the BAO\n  Linear Point","authors":"Jaemyoung Jason Lee, Farnik Nikakhtar, Aseem Paranjape, Ravi K. Sheth","authorsParsed":[["Lee","Jaemyoung Jason",""],["Nikakhtar","Farnik",""],["Paranjape","Aseem",""],["Sheth","Ravi K.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 17:56:01 GMT"}],"updateDate":"2024-07-08","timestamp":1720202161000,"abstract":"  The Baryon Acoustic Oscillation (BAO) feature in the two-point correlation\nfunction (TPCF) of discrete tracers such as galaxies is an accurate standard\nruler. The covariance matrix of the TPCF plays an important role in determining\nhow the precision of this ruler depends on the number density and clustering\nstrength of the tracers, as well as the survey volume. An eigen-decomposition\nof this matrix provides an objective way to separate the contributions of\ncosmic variance from those of shot-noise to the statistical uncertainties. For\nthe signal-to-noise levels that are expected in ongoing and next-generation\nsurveys, the cosmic variance eigen-modes dominate. These modes are smooth\nfunctions of scale, meaning that: they are insensitive to the modest changes in\nbinning that are allowed if one wishes to resolve the BAO feature in the TPCF;\nthey provide a good description of the correlated residuals which result from\nfitting smooth functional forms to the measured TPCF; they motivate a simple\nbut accurate approximation for the uncertainty on the Linear Point (LP)\nestimate of the BAO distance scale. This approximation allows one to quantify\nthe precision of the BAO distance scale estimate without having to generate a\nlarge ensemble of mock catalogs and explains why: the uncertainty on the LP\ndoes not depend on the functional form fitted to the TPCF or the binning used;\nthe LP is more constraining than the peak or dip scales in the TPCF; the\nevolved TPCF is less constraining than the initial one, so that reconstruction\nschemes can yield significant gains in precision.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}