{"id":"2407.16110","title":"Analyzing Polysemy Evolution Using Semantic Cells","authors":"Yukio Ohsawa, Dingming Xue, Kaira Sekiguchi","authorsParsed":[["Ohsawa","Yukio",""],["Xue","Dingming",""],["Sekiguchi","Kaira",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 00:52:12 GMT"},{"version":"v2","created":"Sun, 4 Aug 2024 14:41:42 GMT"},{"version":"v3","created":"Tue, 6 Aug 2024 02:37:51 GMT"}],"updateDate":"2024-08-07","timestamp":1721695932000,"abstract":"  The senses of words evolve. The sense of the same word may change from today\nto tomorrow, and multiple senses of the same word may be the result of the\nevolution of each other, that is, they may be parents and children. If we view\nJuba as an evolving ecosystem, the paradigm of learning the correct answer,\nwhich does not move with the sense of a word, is no longer valid. This paper is\na case study that shows that word polysemy is an evolutionary consequence of\nthe modification of Semantic Cells, which has al-ready been presented by the\nauthor, by introducing a small amount of diversity in its initial state as an\nexample of analyzing the current set of short sentences. In particular, the\nanalysis of a sentence sequence of 1000 sentences in some order for each of the\nfour senses of the word Spring, collected using Chat GPT, shows that the word\nacquires the most polysemy monotonically in the analysis when the senses are\narranged in the order in which they have evolved. In other words, we present a\nmethod for analyzing the dynamism of a word's acquiring polysemy with evolution\nand, at the same time, a methodology for viewing polysemy from an evolutionary\nframework rather than a learning-based one.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ydtffp8iTwuzqbOKOCBtAhkGCLb7IeMdh4d6EKjuRgk","pdfSize":"984113","objectId":"0x7fbf1236a07639b812bcea05a9587883794a5813fc258a80d607afe49ef471d7","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
