{"id":"2407.21508","title":"Machine Learning In-Sensors: Computation-enabled Intelligent Sensors For\n  Next Generation of IoT","authors":"Andrea Ronco, Lukas Schulthess, David Zehnder, Michele Magno","authorsParsed":[["Ronco","Andrea",""],["Schulthess","Lukas",""],["Zehnder","David",""],["Magno","Michele",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 10:27:18 GMT"}],"updateDate":"2024-08-01","timestamp":1722421638000,"abstract":"  Smart sensors are an emerging technology that allows combining the data\nacquisition with the elaboration directly on the Edge device, very close to the\nsensors. To push this concept to the extreme, technology companies are\nproposing a new generation of sensors allowing to move the intelligence from\nthe edge host device, typically a microcontroller, directly to the\nultra-low-power sensor itself, in order to further reduce the miniaturization,\ncost and energy efficiency. This paper evaluates the capabilities of a novel\nand promising solution from STMicroelectronics. The presence of a floating\npoint unit and an accelerator for binary neural networks provide capabilities\nfor in-sensor feature extraction and machine learning. We propose a comparison\nof full-precision and binary neural networks for activity recognition with\naccelerometer data generated by the sensor itself. Experimental results have\ndemonstrated that the sensor can achieve an inference performance of 10.7\ncycles/MAC, comparable to a Cortex-M4-based microcontroller, with\nfull-precision networks, and up to 1.5 cycles/MAC with large binary models for\nlow latency inference, with an average energy consumption of only 90\n$\\mu$J/inference with the core running at 5 MHz.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Hardware Architecture","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}