{"id":"2407.08950","title":"Exploring Richer and More Accurate Information via Frequency Selection\n  for Image Restoration","authors":"Hu Gao, Depeng Dang","authorsParsed":[["Gao","Hu",""],["Dang","Depeng",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 03:10:08 GMT"}],"updateDate":"2024-07-15","timestamp":1720753808000,"abstract":"  Image restoration aims to recover high-quality images from their corrupted\ncounterparts. Many existing methods primarily focus on the spatial domain,\nneglecting the understanding of frequency variations and ignoring the impact of\nimplicit noise in skip connections. In this paper, we introduce a multi-scale\nfrequency selection network (MSFSNet) that seamlessly integrates spatial and\nfrequency domain knowledge, selectively recovering richer and more accurate\ninformation. Specifically, we initially capture spatial features and input them\ninto dynamic filter selection modules (DFS) at different scales to integrate\nfrequency knowledge. DFS utilizes learnable filters to generate high and\nlow-frequency information and employs a frequency cross-attention mechanism\n(FCAM) to determine the most information to recover. To learn a multi-scale and\naccurate set of hybrid features, we develop a skip feature fusion block (SFF)\nthat leverages contextual features to discriminatively determine which\ninformation should be propagated in skip-connections. It is worth noting that\nour DFS and SFF are generic plug-in modules that can be directly employed in\nexisting networks without any adjustments, leading to performance improvements.\nExtensive experiments across various image restoration tasks demonstrate that\nour MSFSNet achieves performance that is either superior or comparable to\nstate-of-the-art algorithms.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}