{"id":"2407.01914","title":"Switchable Ferroelectricity in Subnano Silicon Thin Films","authors":"Hongyu Yu, Shihan deng, Muting Xie, Yuwen Zhang, Xizhi Shi, Jianxin\n  Zhong, Chaoyu He, Hongjun Xiang","authorsParsed":[["Yu","Hongyu",""],["deng","Shihan",""],["Xie","Muting",""],["Zhang","Yuwen",""],["Shi","Xizhi",""],["Zhong","Jianxin",""],["He","Chaoyu",""],["Xiang","Hongjun",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 03:25:51 GMT"}],"updateDate":"2024-07-03","timestamp":1719890751000,"abstract":"  Recent advancements underscore the critical need to develop ferroelectric\nmaterials compatible with silicon. We systematically explore possible\nferroelectric silicon quantum films and discover a low-energy variant\n(hex-OR-2*2-P) with energy just 1 meV/atom above the ground state (hex-OR-2*2).\nBoth hex-OR-2*2 and hex-OR-2*2-P are confirmed to be dynamically and\nmechanically stable semiconductors with indirect gaps of 1.323 eV and 1.311 eV,\nrespectively. The ferroelectric hex-OR-2*2-P exhibits remarkable in-plane\nspontaneous polarization up to 120 Pc/m and is protected by a potential barrier\n(13.33 meV/atom) from spontaneously transitioning to hex-OR-22. To simulate the\nswitching ferroelectricity in electric fields of the single-element silicon\nbilayer, we develop a method that simultaneously learns interatomic potentials\nand Born effective charges (BEC) in a single equivariant model with a\nphysically informed loss. Our method demonstrates good performance on several\nferroelectrics. Simulations of hex-OR-2*2-P silicon suggest a depolarization\ntemperature of approximately 300 K and a coercive field of about 0.05 V/{\\AA}.\nThese results indicate that silicon-based ferroelectric devices are feasible,\nand the ground state phase of the silicon bilayer (hex-OR-2*2) is an ideal\nsystem. Our findings highlight the promise of pure silicon ferroelectric\nmaterials for future experimental synthesis and applications in memory devices,\nsensors, and energy converters.\n","subjects":["Condensed Matter/Materials Science","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}