{"id":"2407.06095","title":"Accelerating Diffusion for SAR-to-Optical Image Translation via\n  Adversarial Consistency Distillation","authors":"Xinyu Bai, Feng Xu","authorsParsed":[["Bai","Xinyu",""],["Xu","Feng",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 16:36:12 GMT"}],"updateDate":"2024-07-09","timestamp":1720456572000,"abstract":"  Synthetic Aperture Radar (SAR) provides all-weather, high-resolution imaging\ncapabilities, but its unique imaging mechanism often requires expert\ninterpretation, limiting its widespread applicability. Translating SAR images\ninto more easily recognizable optical images using diffusion models helps\naddress this challenge. However, diffusion models suffer from high latency due\nto numerous iterative inferences, while Generative Adversarial Networks (GANs)\ncan achieve image translation with just a single iteration but often at the\ncost of image quality. To overcome these issues, we propose a new training\nframework for SAR-to-optical image translation that combines the strengths of\nboth approaches. Our method employs consistency distillation to reduce\niterative inference steps and integrates adversarial learning to ensure image\nclarity and minimize color shifts. Additionally, our approach allows for a\ntrade-off between quality and speed, providing flexibility based on application\nrequirements. We conducted experiments on SEN12 and GF3 datasets, performing\nquantitative evaluations using Peak Signal-to-Noise Ratio (PSNR), Structural\nSimilarity Index (SSIM), and Frechet Inception Distance (FID), as well as\ncalculating the inference latency. The results demonstrate that our approach\nsignificantly improves inference speed by 131 times while maintaining the\nvisual quality of the generated images, thus offering a robust and efficient\nsolution for SAR-to-optical image translation.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}