{"id":"2407.11937","title":"Factorial Difference-in-Differences","authors":"Yiqing Xu, Anqi Zhao, Peng Ding","authorsParsed":[["Xu","Yiqing",""],["Zhao","Anqi",""],["Ding","Peng",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 17:27:47 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 02:10:52 GMT"}],"updateDate":"2024-08-27","timestamp":1721150867000,"abstract":"  In many social science applications, researchers use the\ndifference-in-differences (DID) estimator to establish causal relationships,\nexploiting cross-sectional variation in a baseline factor and temporal\nvariation in exposure to an event that presumably may affect all units. This\napproach, which we term factorial DID (FDID), differs from canonical DID in\nthat it lacks a clean control group unexposed to the event after the event\noccurs. In this paper, we clarify FDID as a research design in terms of its\ndata structure, feasible estimands, and identifying assumptions that allow the\nDID estimator to recover these estimands. We frame FDID as a factorial design\nwith two factors: the baseline factor, denoted by $G$, and the exposure level\nto the event, denoted by $Z$, and define the effect modification and causal\ninteraction as the associative and causal effects of $G$ on the effect of $Z$,\nrespectively. We show that under the canonical no anticipation and parallel\ntrends assumptions, the DID estimator identifies only the effect modification\nof $G$ in FDID, and propose an additional factorial parallel trends assumption\nto identify the causal interaction. Moreover, we show that the canonical DID\nresearch design can be reframed as a special case of the FDID research design\nwith an additional exclusion restriction assumption, thereby reconciling the\ntwo approaches. We extend this framework to allow conditionally valid parallel\ntrends assumptions and multiple time periods, and clarify assumptions required\nto justify regression analysis under FDID. We illustrate these findings with\nempirical examples from economics and political science, and provide\nrecommendations for improving practice and interpretation under FDID.\n","subjects":["Statistics/Methodology","Economics/Econometrics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"qJdO55XwdJK0sHgzpg3Q21jJV0XSWWnJjkDWWCAxM8s","pdfSize":"1039707"}
