{"id":"2407.09647","title":"PKS 2131-021 -- Discovery of Strong Coherent Sinusoidal Variations from\n  Radio to Optical Frequencies: Compelling Evidence for a Blazar Supermassive\n  Black Hole Binary","authors":"Sebastian Kiehlmann, Philipe Vergara De La Parra, Andrew Sullivan, A.\n  Synani, Ioannis Liodakis, Anthony Readhead, Matthew Graham, Mitchell\n  Begelman, Roger Blandford, Katerina Chatziioannou, Yuanze Ding, Fiona\n  Harrison, D. Homan, Talvikki Hovatta, Shrinivas Kulkarni, Matthew Lister,\n  Roberto Maiolino, Walter Max-Moerbeck, B. Molina, Przemyslaw Mroz,\n  Christopher O'Dea, Vasiliki Pavlidou, Timothy J. Pearson, Margo Aller, C.\n  Lawrence, T. Joseph Lazio, S. O'Neill, Thomas Prince, Vikram Ravi, Rodrigo\n  Reeves, Konstantinos Tassis, Michele Vallisneri, J. Zensus","authorsParsed":[["Kiehlmann","Sebastian",""],["De La Parra","Philipe Vergara",""],["Sullivan","Andrew",""],["Synani","A.",""],["Liodakis","Ioannis",""],["Readhead","Anthony",""],["Graham","Matthew",""],["Begelman","Mitchell",""],["Blandford","Roger",""],["Chatziioannou","Katerina",""],["Ding","Yuanze",""],["Harrison","Fiona",""],["Homan","D.",""],["Hovatta","Talvikki",""],["Kulkarni","Shrinivas",""],["Lister","Matthew",""],["Maiolino","Roberto",""],["Max-Moerbeck","Walter",""],["Molina","B.",""],["Mroz","Przemyslaw",""],["O'Dea","Christopher",""],["Pavlidou","Vasiliki",""],["Pearson","Timothy J.",""],["Aller","Margo",""],["Lawrence","C.",""],["Lazio","T. Joseph",""],["O'Neill","S.",""],["Prince","Thomas",""],["Ravi","Vikram",""],["Reeves","Rodrigo",""],["Tassis","Konstantinos",""],["Vallisneri","Michele",""],["Zensus","J.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 19:05:24 GMT"}],"updateDate":"2024-07-16","timestamp":1720811124000,"abstract":"  Haystack and Owens Valley Radio Observatory (OVRO) observations recently\nrevealed strong sinusoidal total flux density variations that maintained\ncoherence between 1975 and 2021 in the blazar PKS 2131-021 ($z=1.283)$. This\nwas interpreted as possible evidence of a supermassive black hole binary\n(SMBHB). Extended observations through 2023 show coherence over 47.9~years,\nwith an observed period $P_\\textrm{15 GHz}=(1739.3 \\pm 1.2) \\, {\\rm days}$. We\nreject, with $p$-value = $5.3 \\times 10^{-7}$, the hypothesis that the\nvariations are due to random fluctuations in the red noise tail of the power\nspectral density. There is clearly a constant-period physical phenomenon in PKS\n2131-021 producing coherent intermittent sinusoidal flux density variations. We\nfind the coherent sinusoidal intensity variations extend from below 2.7 GHz to\noptical frequencies, from which we derive an observed period\n$P_\\textrm{optical}=(1764 \\pm 36)$ days. Across this broad frequency range\nthere is a monotonic phase shift in the sinusoidal variations with frequency.\nThe same coherent periodicity is possibly also observed at $\\gamma$-ray\nenergies. The importance of well-vetted SMBHB candidates to searches for\ngravitational waves is pointed out. We estimate the fraction of blazars that\nare SMBHB candidates to be $>1$ in 100. Thus monitoring programs covering tens\nof thousands of blazars could discover hundreds of SMBHB candidates.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}