{"id":"2407.08859","title":"\"Best\" iterative coupled-cluster triples model: More evidence for 3CC","authors":"Nakul Teke and Ajay Melekamburath and Bimal Gaudel and Edward F.\n  Valeev","authorsParsed":[["Teke","Nakul",""],["Melekamburath","Ajay",""],["Gaudel","Bimal",""],["Valeev","Edward F.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 20:47:51 GMT"}],"updateDate":"2024-07-15","timestamp":1720730871000,"abstract":"  To follow up on the unexpectedly-good performance of several coupled-cluster\nmodels with approximate inclusion of 3-body clusters [J. Chem. Phys. 151,\n064102 (2019)] we performed a more complete assessment of the 3CC method [J.\nChem. Phys. 125, 204105 (2006)] for accurate computational thermochemistry in\nthe standard HEAT framework. New spin-integrated implementation of the 3CC\nmethod applicable to closed- and open-shell systems utilizes a new automated\ntoolchain for derivation, optimization, and evaluation of operator algebra in\nmany-body electronic structure. We found that with a double-zeta basis set the\n3CC correlation energies and their atomization energy contributions are almost\nalways more accurate (with respect to the CCSDTQ reference) than the CCSDT\nmodel as well as the standard CCSD(T) model. The mean absolute errors in\ncc-pVDZ {3CC, CCSDT, and CCSD(T)} electronic (per valence electron) and\natomization energies relative to the CCSDTQ reference for the HEAT dataset [J.\nChem. Phys. 121, 11599 (2004)], were {24, 70, 122} $\\mu E_h/e$ and {0.46, 2.00,\n2.58} kJ/mol, respectively. The mean absolute errors in the complete-basis-set\nlimit {3CC, CCSDT, and CCSD(T)} atomization energies relative to the HEAT model\nreference, were {0.52, 2.00, and 1.07} kJ/mol, The significant and systematic\nreduction of the error by the 3CC method and its lower cost than CCSDT suggests\nit as a viable candidate for post-CCSD(T) thermochemistry applications, as well\nas the preferred alternative to CCSDT in general.\n","subjects":["Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}