{"id":"2407.19556","title":"Diffie-Hellman Picture Show: Key Exchange Stories from Commercial VoWiFi\n  Deployments","authors":"Gabriel Karl Gegenhuber, Florian Holzbauer, Philipp Frenzel, Edgar\n  Weippl, Adrian Dabrowski","authorsParsed":[["Gegenhuber","Gabriel Karl",""],["Holzbauer","Florian",""],["Frenzel","Philipp",""],["Weippl","Edgar",""],["Dabrowski","Adrian",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 18:44:41 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 20:33:33 GMT"}],"updateDate":"2024-08-08","timestamp":1722192281000,"abstract":"  Voice over Wi-Fi (VoWiFi) uses a series of IPsec tunnels to deliver IP-based\ntelephony from the subscriber's phone (User Equipment, UE) into the Mobile\nNetwork Operator's (MNO) core network via an Internet-facing endpoint, the\nEvolved Packet Data Gateway (ePDG). IPsec tunnels are set up in phases. The\nfirst phase negotiates the cryptographic algorithm and parameters and performs\na key exchange via the Internet Key Exchange protocol, while the second phase\n(protected by the above-established encryption) performs the authentication. An\ninsecure key exchange would jeopardize the later stages and the data's security\nand confidentiality.\n  In this paper, we analyze the phase 1 settings and implementations as they\nare found in phones as well as in commercially deployed networks worldwide. On\nthe UE side, we identified a recent 5G baseband chipset from a major\nmanufacturer that allows for fallback to weak, unannounced modes and verified\nit experimentally. On the MNO side -- among others -- we identified 13\noperators (totaling an estimated 140 million subscribers) on three continents\nthat all use the same globally static set of ten private keys, serving them at\nrandom. Those not-so-private keys allow the decryption of the shared keys of\nevery VoWiFi user of all those operators. All these operators deployed their\ncore network from one common manufacturer.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}