{"id":"2407.11576","title":"Half-metallicity and wandering axis ferromagnetism in Mn substituted\n  Fe$_2$TiSn","authors":"Kulbhushan Mishra, Shishir Kumar Pandey, S. Chaudhuri, Rajiv Rawat,\n  and P. A. Bhobe","authorsParsed":[["Mishra","Kulbhushan",""],["Pandey","Shishir Kumar",""],["Chaudhuri","S.",""],["Rawat","Rajiv",""],["Bhobe","P. A.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 10:35:34 GMT"}],"updateDate":"2024-07-17","timestamp":1721126134000,"abstract":"  We investigate the effect of Mn substitution in Fe$_2$Ti$_{1-x}$Mn$_x$Sn on\nelectronic structure, magnetic and electrical transport properties. The\nspin-polarized density of states calculations using density-functional theory\n(DFT), yields a half-metallic ground state in Mn-rich compositions. Localized\nmagnetic moments at Mn sites that interact through the cloud of conduction\nelectrons formed by Fe and Ti atoms are also predicted. Electrical resistivity\nand magneto-transport measurements reveal a Kondo-like ground state at low\ntemperatures and a peculiar linear negative temperature coefficient of\nresistance in the high-temperature regime with a predominant electron-phonon\nscattering mechanism. Analysis of room temperature powder X-ray diffraction\ndata reveals a highly ordered L2$_1$ structure and reduction of antisite\ndisorder, upon Mn substitution. The temperature-dependent magnetization\nmeasurements reveal distinct features indicative of weak anisotropy in the\nsystem. Isothermal magnetization measured as a function of the applied field\nhelps identify the unique magnetic ground state of the half-metallic\nFe$_2$Ti$_{1-x}$Mn$_x$Sn composition as a ferromagnet with a wandering axis,\nthat distinctively orients in the direction of applied field. Our findings thus\nprovide a new perspective for studying the mechanism of half-metallicity and\nassociated magnetic order in Heuslers.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}