{"id":"2407.17753","title":"Aspects of Rotating Anisotropic Dark Energy Stars","authors":"O. P. Jyothilakshmi, Lakshmi J. Naik, V. Sreekanth","authorsParsed":[["Jyothilakshmi","O. P.",""],["Naik","Lakshmi J.",""],["Sreekanth","V.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 04:08:19 GMT"}],"updateDate":"2024-07-26","timestamp":1721880499000,"abstract":"  By employing modified Chaplygin fluid prescription for the dark energy, we\nconstruct slowly rotating isotropic and anisotropic dark energy stars. The slow\nrotation is incorporated via general relativistic Hartle-Thorne formalism;\nwhereas the anisotropy is introduced through Bowers-Liang prescription. We\nconsider both the monopole and quadrupole deformations and present a complete\nanalysis of rotating dark energy stars. By numerically solving the rotating\nstellar structure equations in presence of anisotropy, we analyse and quantify\nvarious properties of dark energy stars such as mass ($M$), radius, mass\ndeformation, angular momentum ($J$), moment of inertia, and quadrupole moment\n($Q$), for three different equation of state parameters. We find that\nanisotropic slow rotation results in significant deformation of stellar mass\nand thereby affects other global properties studied. For the values of angular\nfrequencies considered, the effect of anisotropy on the stellar structure is\nfound to be more prominent than that due to rotation. The dimensionless\nquadrupole moment $QM/J^2$ measuring deviation from a Kerr metric black hole\nwas obtained for anisotropic dark energy stars. We observe that dark energy\nstars with higher anisotropic strength tend to approach the Kerr solution more\nclosely. We report that our results have considerable agreement with various\nastrophysical observational measurements.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}