{"id":"2407.19668","title":"Urban Traffic Accident Risk Prediction Revisited: Regionality,\n  Proximity, Similarity and Sparsity","authors":"Minxiao Chen, Haitao Yuan, Nan Jiang, Zhifeng Bao, Shangguang Wang","authorsParsed":[["Chen","Minxiao",""],["Yuan","Haitao",""],["Jiang","Nan",""],["Bao","Zhifeng",""],["Wang","Shangguang",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 03:10:15 GMT"}],"updateDate":"2024-07-30","timestamp":1722222615000,"abstract":"  Traffic accidents pose a significant risk to human health and property\nsafety. Therefore, to prevent traffic accidents, predicting their risks has\ngarnered growing interest. We argue that a desired prediction solution should\ndemonstrate resilience to the complexity of traffic accidents. In particular,\nit should adequately consider the regional background, accurately capture both\nspatial proximity and semantic similarity, and effectively address the sparsity\nof traffic accidents. However, these factors are often overlooked or difficult\nto incorporate. In this paper, we propose a novel multi-granularity\nhierarchical spatio-temporal network. Initially, we innovate by incorporating\nremote sensing data, facilitating the creation of hierarchical\nmulti-granularity structure and the comprehension of regional background. We\nconstruct multiple high-level risk prediction tasks to enhance model's ability\nto cope with sparsity. Subsequently, to capture both spatial proximity and\nsemantic similarity, region feature and multi-view graph undergo encoding\nprocesses to distill effective representations. Additionally, we propose\nmessage passing and adaptive temporal attention module that bridges different\ngranularities and dynamically captures time correlations inherent in traffic\naccident patterns. At last, a multivariate hierarchical loss function is\ndevised considering the complexity of the prediction purpose. Extensive\nexperiments on two real datasets verify the superiority of our model against\nthe state-of-the-art methods.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}