{"id":"2407.18060","title":"Cross-Vendor Reproducibility of Radiomics-based Machine Learning Models\n  for Computer-aided Diagnosis","authors":"Jatin Chaudhary, Ivan Jambor, Hannu Aronen, Otto Ettala, Jani\n  Saunavaara, Peter Bostr\\\"om, Jukka Heikkonen, Rajeev Kanth, and Harri\n  Merisaari","authorsParsed":[["Chaudhary","Jatin",""],["Jambor","Ivan",""],["Aronen","Hannu",""],["Ettala","Otto",""],["Saunavaara","Jani",""],["Boström","Peter",""],["Heikkonen","Jukka",""],["Kanth","Rajeev",""],["Merisaari","Harri",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 14:16:02 GMT"}],"updateDate":"2024-07-26","timestamp":1721916962000,"abstract":"  Background: The reproducibility of machine-learning models in prostate cancer\ndetection across different MRI vendors remains a significant challenge.\nMethods: This study investigates Support Vector Machines (SVM) and Random\nForest (RF) models trained on radiomic features extracted from T2-weighted MRI\nimages using Pyradiomics and MRCradiomics libraries. Feature selection was\nperformed using the maximum relevance minimum redundancy (MRMR) technique. We\naimed to enhance clinical decision support through multimodal learning and\nfeature fusion. Results: Our SVM model, utilizing combined features from\nPyradiomics and MRCradiomics, achieved an AUC of 0.74 on the Multi-Improd\ndataset (Siemens scanner) but decreased to 0.60 on the Philips test set. The RF\nmodel showed similar trends, with notable robustness for models using\nPyradiomics features alone (AUC of 0.78 on Philips). Conclusions: These\nfindings demonstrate the potential of multimodal feature integration to improve\nthe robustness and generalizability of machine-learning models for clinical\ndecision support in prostate cancer detection. This study marks a significant\nstep towards developing reliable AI-driven diagnostic tools that maintain\nefficacy across various imaging platforms.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Z2DqFZCajsAV2DpXyAY6wVflc8zSWSfFetpeq7ikcIU","pdfSize":"436738"}
