{"id":"2407.12336","title":"M2DS: Multilingual Dataset for Multi-document Summarisation","authors":"Kushan Hewapathirana (1 and 2), Nisansa de Silva (1), C.D. Athuraliya\n  (2) ((1) Department of Computer Science & Engineering, University of\n  Moratuwa, Sri Lanka, (2) ConscientAI, Sri Lanka)","authorsParsed":[["Hewapathirana","Kushan","","1 and 2"],["de Silva","Nisansa",""],["Athuraliya","C. D.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 06:25:51 GMT"}],"updateDate":"2024-09-19","timestamp":1721197551000,"abstract":"  In the rapidly evolving digital era, there is an increasing demand for\nconcise information as individuals seek to distil key insights from various\nsources. Recent attention from researchers on Multi-document Summarisation\n(MDS) has resulted in diverse datasets covering customer reviews, academic\npapers, medical and legal documents, and news articles. However, the\nEnglish-centric nature of these datasets has created a conspicuous void for\nmultilingual datasets in today's globalised digital landscape, where linguistic\ndiversity is celebrated. Media platforms such as British Broadcasting\nCorporation (BBC) have disseminated news in 20+ languages for decades. With\nonly 380 million people speaking English natively as their first language,\naccounting for less than 5% of the global population, the vast majority\nprimarily relies on other languages. These facts underscore the need for\ninclusivity in MDS research, utilising resources from diverse languages.\nRecognising this gap, we present the Multilingual Dataset for Multi-document\nSummarisation (M2DS), which, to the best of our knowledge, is the first dataset\nof its kind. It includes document-summary pairs in five languages from BBC\narticles published during the 2010-2023 period. This paper introduces M2DS,\nemphasising its unique multilingual aspect, and includes baseline scores from\nstate-of-the-art MDS models evaluated on our dataset.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}