{"id":"2407.19068","title":"Kondo versus Fano in superconducting artificial high-Tc heterostructures","authors":"Gaetano Campi, Gennady Logvenov, Sergio Caprara, Antonio Valletta,\n  Antonio Bianconi","authorsParsed":[["Campi","Gaetano",""],["Logvenov","Gennady",""],["Caprara","Sergio",""],["Valletta","Antonio",""],["Bianconi","Antonio",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 18:37:25 GMT"}],"updateDate":"2024-07-30","timestamp":1721414245000,"abstract":"  Recently, the quest for high-Tc superconductivity has evolved from the\ntrial-and-error methodology to the growth of nanostructured artificial high-Tc\nsuperlattices (AHTS) with tailor-made superconducting functional properties by\nquantum design. Superlattices are composed of nanoscale superconducting units\nof modulation doped Mott insulator La2CuO4 with thickness L intercalated by\nmetallic overdoped La1.55Sr0.45CuO4 and period d. Quantum design based on the\nmulti-gap Bogoliubov theory including spin-orbit coupling (SOC). has been\nemployed for prediction of the amplification of the critical temperature as a\nfunction of the conformational parameter L/d. At the top of the superconducting\ndome, at the magic ratio L/d=2/3, the heterostructures are tuned at the\nFano-Feshbach resonance and the normal phase exhibits the Planckian T-linear\nresistivity. Here, we report experimental evidence that the Kondo proximity\neffect competes with the Fano-Feshbach resonance suppressing Tc on both sides\nof the superconducting dome. The Kondo proximity effect is expected in\nelectrical resistance of AHTS nanoscale heterostructures following a Kondo\nuniversal scaling obtained by numerical renormalization group theory. We show\nthe vanishing Kondo temperature TK and Kondo scattering amplitude R0K at\nL/d=2/3, while TK and R0K increase on the underdoped (L/d>2/3) and overdoped\n(L/d<2/3) side of the superconducting dome.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}