{"id":"2407.17337","title":"Raman Spectroscopic Study on Bi2Rh3Se2: Two-dimensional-Ising Charge\n  Density Wave and Quantum Fluctuations","authors":"Fei Jiao and Yonghui Zhou and Shuyang Wang and Chao An and Xuliang\n  Chen and Ying Zhou and Min Zhang and Liang Cao and Xigang Luo and Yimin Xiong\n  and Zhaorong Yang","authorsParsed":[["Jiao","Fei",""],["Zhou","Yonghui",""],["Wang","Shuyang",""],["An","Chao",""],["Chen","Xuliang",""],["Zhou","Ying",""],["Zhang","Min",""],["Cao","Liang",""],["Luo","Xigang",""],["Xiong","Yimin",""],["Yang","Zhaorong",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 15:02:38 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 01:17:31 GMT"}],"updateDate":"2024-09-05","timestamp":1721833358000,"abstract":"  The ternary chalcogenide Bi2Rh3Se2 was found to be a charge density wave\n(CDW) superconductor with a 2*2 periodicity. The key questions regarding the\nunderlying mechanism of CDW state and its interplay with lattice and electronic\nproperties remains to be explored. Here, based on the systematic Raman\nscattering investigations on single crystalline Bi2Rh3Se2, we observed the\nfingerprinting feature of CDW state, a collective amplitude mode at 39 cm-1.\nThe temperature evolution of Raman shift and line width for this amplitude mode\ncan be well described by the critical behavior of two-dimensional (2D) Ising\nmodel, suggesting the interlayer interactions of Bi2Rh3Se2 is negligible when\nCDW state is formed, as a consequence, the quantum fluctuations play an\nimportant role at low temperature. Moreover, temperature dependence of Raman\nshift for Ag9 mode deviates significantly from the expected anharmonic behavior\nwhen approaching the CDW transition temperature 240 K, demonstrated that strong\nelectron-phonon coupling plays a key role in the formation of CDW. Our results\nreveal that Bi2Rh3Se2 is an intriguing quasi-2D system to explore electronic\nquantum phase transition and modulate the correlations between CDW and\nsuperconductivity.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZeiH2O172G_amBONIOj3niCzxmgQpa-HdpBs3iNqVpE","pdfSize":"1522430","objectId":"0xcc624ddd242caa544375ab97af5d8a23cb2c33943d9c73accd50ea05b05c96ba","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
