{"id":"2407.00053","title":"A Document-based Knowledge Discovery with Microservices Architecture","authors":"Habtom Kahsay Gidey, Mario Kesseler, Patrick Stangl, Peter Hillmann,\n  Andreas Karcher","authorsParsed":[["Gidey","Habtom Kahsay",""],["Kesseler","Mario",""],["Stangl","Patrick",""],["Hillmann","Peter",""],["Karcher","Andreas",""]],"versions":[{"version":"v1","created":"Thu, 13 Jun 2024 09:28:31 GMT"}],"updateDate":"2024-07-02","timestamp":1718270911000,"abstract":"  The first step towards digitalization within organizations lies in\ndigitization - the conversion of analog data into digitally stored data. This\nbasic step is the prerequisite for all following activities like the\ndigitalization of processes or the servitization of products or offerings.\nHowever, digitization itself often leads to 'data-rich' but 'knowledge-poor'\nmaterial. Knowledge discovery and knowledge extraction as approaches try to\nincrease the usefulness of digitized data. In this paper, we point out the key\nchallenges in the context of knowledge discovery and present an approach to\naddressing these using a microservices architecture. Our solution led to a\nconceptual design focusing on keyword extraction, similarity calculation of\ndocuments, database queries in natural language, and programming language\nindependent provision of the extracted information. In addition, the conceptual\ndesign provides referential design guidelines for integrating processes and\napplications for semi-automatic learning, editing, and visualization of\nontologies. The concept also uses a microservices architecture to address\nnon-functional requirements, such as scalability and resilience. The evaluation\nof the specified requirements is performed using a demonstrator that implements\nthe concept. Furthermore, this modern approach is used in the German patent\noffice in an extended version.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Computation and Language","Computing Research Repository/Digital Libraries","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}