{"id":"2407.11354","title":"Generative AI Driven Task-Oriented Adaptive Semantic Communications","authors":"Yuzhou Fu, Wenchi Cheng, Jingqing Wang, Liuguo Yin, and Wei Zhang","authorsParsed":[["Fu","Yuzhou",""],["Cheng","Wenchi",""],["Wang","Jingqing",""],["Yin","Liuguo",""],["Zhang","Wei",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 03:39:35 GMT"}],"updateDate":"2024-07-17","timestamp":1721101175000,"abstract":"  Task-Oriented Semantic Communication (TOSC) has been regarded as a promising\ncommunication framework, serving for various Artificial Intelligence (AI) task\ndriven applications. The existing TOSC frameworks focus on extracting the full\nsemantic features of source data and learning low-dimensional channel inputs to\ntransmit them within limited bandwidth resources. Although transmitting full\nsemantic features can preserve the integrity of data meaning, this approach\ndoes not attain the performance threshold of the TOSC. In this paper, we\npropose a Task-oriented Adaptive Semantic Communication (TasCom) framework,\nwhich aims to effectively facilitate the execution of AI tasks by only sending\ntask-related semantic features. In the TasCom framework, we first propose a\nGenerative AI (GAI) architecture based Generative Joint Source-Channel Coding\n(G-JSCC) for efficient semantic transmission. Then, an Adaptive Coding\nController (ACC) is proposed to find the optimal coding scheme for the proposed\nG-JSCC, which allows the semantic features with significant contributions to\nthe AI task to preferentially occupy limited bandwidth resources for wireless\ntransmission. Furthermore, we propose a generative training algorithm to train\nthe proposed TasCom for optimal performance. The simulation results show that\nthe proposed TasCom outperforms the existing TOSC and traditional codec schemes\non the object detection and instance segmentation tasks at all considered\nchannel conditions.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}