{"id":"2407.06226","title":"Quantum Machine Learning with Application to Progressive Supranuclear\n  Palsy Network Classification","authors":"Papri Saha","authorsParsed":[["Saha","Papri",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 14:16:31 GMT"}],"updateDate":"2024-07-10","timestamp":1720275391000,"abstract":"  Machine learning and quantum computing are being progressively explored to\nshed light on possible computational approaches to deal with hitherto\nunsolvable problems. Classical methods for machine learning are ubiquitous in\npattern recognition, with support vector machines (SVMs) being a prominent\ntechnique for network classification. However, there are limitations to the\nsuccessful resolution of such classification instances when the input feature\nspace becomes large, and the successive evaluation of so-called kernel\nfunctions becomes computationally exorbitant. The use of principal component\nanalysis (PCA) substantially minimizes the dimensionality of feature space\nthereby enabling computational speed-ups of supervised learning: the creation\nof a classifier. Further, the application of quantum-based learning to the PCA\nreduced input feature space might offer an exponential speedup with fewer\nparameters. The present learning model is evaluated on a real clinical\napplication: the diagnosis of Progressive Supranuclear Palsy (PSP) disorder.\nThe results suggest that quantum machine learning has led to noticeable\nadvancement and outperforms classical frameworks. The optimized variational\nquantum classifier classifies the PSP dataset with 86% accuracy as compared to\nconventional SVM. The other technique, a quantum kernel estimator, approximates\nthe kernel function on the quantum machine and optimizes a classical SVM. In\nparticular, we have demonstrated the successful application of the present\nmodel on both a quantum simulator and real chips of the IBM quantum platform.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"eyTOO8s74WEidHgIaL2mp8l-8ZFK7duOlp5KQmbd-sY","pdfSize":"3095585"}
