{"id":"2407.16551","title":"Estimating global article processing charges paid to six publishers for\n  open access between 2019 and 2023","authors":"Stefanie Haustein, Eric Schares, Juan Pablo Alperin, Madelaine Hare,\n  Leigh-Ann Butler and Nina Sch\\\"onfelder","authorsParsed":[["Haustein","Stefanie",""],["Schares","Eric",""],["Alperin","Juan Pablo",""],["Hare","Madelaine",""],["Butler","Leigh-Ann",""],["Schönfelder","Nina",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 15:05:47 GMT"}],"updateDate":"2024-07-24","timestamp":1721747147000,"abstract":"  This study presents estimates of the global expenditure on article processing\ncharges (APCs) paid to six publishers for open access between 2019 and 2023.\nAPCs are fees charged for publishing in some fully open access journals (gold)\nand in subscription journals to make individual articles open access (hybrid).\nThere is currently no way to systematically track institutional, national or\nglobal expenses for open access publishing due to a lack of transparency in APC\nprices, what articles they are paid for, or who pays them. We therefore curated\nand used an open dataset of annual APC list prices from Elsevier, Frontiers,\nMDPI, PLOS, Springer Nature, and Wiley in combination with the number of open\naccess articles from these publishers indexed by OpenAlex to estimate that,\nglobally, a total of \\$8.349 billion (\\$8.968 billion in 2023 US dollars) were\nspent on APCs between 2019 and 2023. We estimate that in 2023 MDPI (\\$681.6\nmillion), Elsevier (\\$582.8 million) and Springer Nature (\\$546.6) generated\nthe most revenue with APCs. After adjusting for inflation, we also show that\nannual spending almost tripled from \\$910.3 million in 2019 to \\$2.538 billion\nin 2023, that hybrid exceed gold fees, and that the median APCs paid are higher\nthan the median listed fees for both gold and hybrid. Our approach addresses\nmajor limitations in previous efforts to estimate APCs paid and offers much\nneeded insight into an otherwise opaque aspect of the business of scholarly\npublishing. We call upon publishers to be more transparent about OA fees.\n","subjects":["Computing Research Repository/Digital Libraries"],"license":"http://creativecommons.org/licenses/by/4.0/"}