{"id":"2407.00393","title":"Unified properties of supermassive black hole winds in radio-quiet and\n  radio-loud AGN","authors":"S. Mestici (1,2), F. Tombesi (1,3,4), M. Gaspari (5), E. Piconcelli\n  (3), F. Panessa (6) ((1) Physics Department, Tor Vergata University of Rome,\n  Italy, (2) Physics Department, Sapienza University of Rome, Italy, (3) INAF -\n  Astronomical Observatory of Rome, Italy, (4) INFN - Rome Tor Vergata, Italy,\n  (5) Department of Physics, Informatics and Mathematics, University of Modena\n  and Reggio Emilia, Italy, (6) INAF - Istituto di Astrofisica e Planetologia\n  Spaziali, Italy)","authorsParsed":[["Mestici","S.",""],["Tombesi","F.",""],["Gaspari","M.",""],["Piconcelli","E.",""],["Panessa","F.",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 10:30:22 GMT"}],"updateDate":"2024-07-02","timestamp":1719657022000,"abstract":"  Powerful supermassive black hole (SMBH) winds in the form of ultra-fast\noutflows (UFOs) are detected in the X-ray spectra of several active galactic\nnuclei (AGN) seemingly independently of their radio classification between\nradio quiet (RQ) and radio loud (RL). In this work we explore the physical\nparameters of SMBH winds through a uniform analysis of a sample of X-ray bright\nRQ and RL AGN. We explored several correlations between different wind\nparameters and with respect to the AGN bolometric and Eddington luminosities.\nOur analysis shows that SMBH winds are not only a common trait of both AGN\nclasses but also that they are most likely produced by the same physical\nmechanism. Consequently, we find that SMBH winds do not follow the\nradio-loudness dichotomy seen in jets. On average, a comparable amount of\nmaterial accreted by the SMBH is ejected through such winds. The average wind\npower corresponds to about 3 per cent of the Eddington luminosity, confirming\nthat they can drive AGN feedback. Moreover, the most energetic outflows are\nfound in the most luminous sources. We find a possible positive correlation of\nthe wind energetics, renormalized to the Eddington limit, with respect to\n$\\lambda_{Edd}$, consistent with the correlation found with bolometric\nluminosity. We also observe a possible positive correlation between the\nenergetics of the outflow and the X-ray radio-loudness parameter. In general,\nthese results suggest an underlying relation between the acceleration\nmechanisms of accretion disc winds and jets.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}