{"id":"2407.01208","title":"Energetic particles and high-energy processes in cosmological filaments\n  and their astronomical implications","authors":"Kinwah Wu, Ellis R. Owen, Qin Han, Yoshiyuki Inoue, Lilian Luo","authorsParsed":[["Wu","Kinwah",""],["Owen","Ellis R.",""],["Han","Qin",""],["Inoue","Yoshiyuki",""],["Luo","Lilian",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 11:55:37 GMT"}],"updateDate":"2024-07-02","timestamp":1719834937000,"abstract":"  Large-scale cosmic filaments connect galaxies, clusters and voids. They are\npermeated by magnetic fields with a variety of topologies. Cosmic rays with\nenergies up to $10^{20}\\;\\!{\\rm eV}$ can be produced in astrophysical\nenvironments associated with star-formation and AGN activities. The fate of\nthese cosmic rays in filaments, which cannot be directly observed on Earth, are\nrarely studied. We investigate the high-energy processes associated with\nenergetic particles (cosmic rays) in filaments, adopting an ecological approach\nthat includes galaxies, clusters/superclusters and voids as key cosmological\nstructures in the filament ecosystem. We derive the phenomenology for modelling\ninterfaces between filaments and these structures, and investigate how the\ntransfer and fate of energetic cosmic ray protons are affected by the magnetism\nof the interfaces. We consider different magnetic field configurations in\nfilaments and assess the implications for cosmic ray confinement and survival\nagainst hadronic pion-producing and photo-pair interactions. Our analysis shows\nthat the fate of the particles depends on the location of their origin within a\nfilament ecosystem, and that filaments act as `highways', channelling cosmic\nrays between galaxies, galaxy clusters and superclusters. Filaments can also\noperate as cosmic `fly paper', capturing cosmic ray protons with energies up to\n$10^{18}\\;\\!{\\rm eV}$ from cosmic voids. Our analysis predicts the presence of\na population of $\\sim 10^{12}-10^{16}\\;\\!{\\rm eV}$ cosmic ray protons in\nfilaments and voids accumulated continually over cosmic time. These protons do\nnot suffer significant energy losses through photo-pair or pion-production, nor\ncan they be cooled efficiently. Instead, they form a cosmic ray fossil record\nof the power generation history of the Universe.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}