{"id":"2407.16949","title":"Profitable Manipulations of Cryptographic Self-Selection are\n  Statistically Detectable","authors":"Linda Cai, Jingyi Liu, S. Matthew Weinberg, Chenghan Zhou","authorsParsed":[["Cai","Linda",""],["Liu","Jingyi",""],["Weinberg","S. Matthew",""],["Zhou","Chenghan",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 02:34:01 GMT"}],"updateDate":"2024-07-25","timestamp":1721788441000,"abstract":"  Cryptographic Self-Selection is a common primitive underlying\nleader-selection for Proof-of-Stake blockchain protocols. The concept was first\npopularized in Algorand [CM19], who also observed that the protocol might be\nmanipulable. [FHWY22] provide a concrete manipulation that is strictly\nprofitable for a staker of any size (and also prove upper bounds on the gains\nfrom manipulation).\n  Separately, [YSZ23, BM24] initiate the study of undetectable profitable\nmanipulations of consensus protocols with a focus on the seminal Selfish Mining\nstrategy [ES14] for Bitcoin's Proof-of-Work longest-chain protocol. They design\na Selfish Mining variant that, for sufficiently large miners, is strictly\nprofitable yet also indistinguishable to an onlooker from routine latency (that\nis, a sufficiently large profit-maximizing miner could use their strategy to\nstrictly profit over being honest in a way that still appears to the rest of\nthe network as though everyone is honest but experiencing mildly higher\nlatency. This avoids any risk of negatively impacting the value of the\nunderlying cryptocurrency due to attack detection).\n  We investigate the detectability of profitable manipulations of the canonical\ncryptographic self-selection leader selection protocol introduced in [CM19] and\nstudied in [FHWY22], and establish that for any player with $\\alpha <\n\\frac{3-\\sqrt{5}}{2} \\approx 0.38$ fraction of the total stake, every strictly\nprofitable manipulation is statistically detectable. Specifically, we consider\nan onlooker who sees only the random seed of each round (and does not need to\nsee any other broadcasts by any other players). We show that the distribution\nof the sequence of random seeds when any player is profitably manipulating the\nprotocol is inconsistent with any distribution that could arise by honest\nstakers being offline or timing out (for a natural stylized model of honest\ntimeouts).\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}