{"id":"2407.08019","title":"Coherent and Multi-modality Image Inpainting via Latent Space\n  Optimization","authors":"Lingzhi Pan, Tong Zhang, Bingyuan Chen, Qi Zhou, Wei Ke, Sabine\n  S\\\"usstrunk, Mathieu Salzmann","authorsParsed":[["Pan","Lingzhi",""],["Zhang","Tong",""],["Chen","Bingyuan",""],["Zhou","Qi",""],["Ke","Wei",""],["Süsstrunk","Sabine",""],["Salzmann","Mathieu",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 19:58:04 GMT"}],"updateDate":"2024-07-12","timestamp":1720641484000,"abstract":"  With the advancements in denoising diffusion probabilistic models (DDPMs),\nimage inpainting has significantly evolved from merely filling information\nbased on nearby regions to generating content conditioned on various prompts\nsuch as text, exemplar images, and sketches. However, existing methods, such as\nmodel fine-tuning and simple concatenation of latent vectors, often result in\ngeneration failures due to overfitting and inconsistency between the inpainted\nregion and the background. In this paper, we argue that the current large\ndiffusion models are sufficiently powerful to generate realistic images without\nfurther tuning. Hence, we introduce PILOT (in\\textbf{P}ainting v\\textbf{I}a\n\\textbf{L}atent \\textbf{O}p\\textbf{T}imization), an optimization approach\ngrounded on a novel \\textit{semantic centralization} and \\textit{background\npreservation loss}. Our method searches latent spaces capable of generating\ninpainted regions that exhibit high fidelity to user-provided prompts while\nmaintaining coherence with the background. Furthermore, we propose a strategy\nto balance optimization expense and image quality, significantly enhancing\ngeneration efficiency. Our method seamlessly integrates with any pre-trained\nmodel, including ControlNet and DreamBooth, making it suitable for deployment\nin multi-modal editing tools. Our qualitative and quantitative evaluations\ndemonstrate that PILOT outperforms existing approaches by generating more\ncoherent, diverse, and faithful inpainted regions in response to provided\nprompts.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}