{"id":"2407.11740","title":"The Algebras of Lewis's Counterfactuals","authors":"Giuliano Rosella and Sara Ugolini","authorsParsed":[["Rosella","Giuliano",""],["Ugolini","Sara",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:07:59 GMT"}],"updateDate":"2024-07-17","timestamp":1721138879000,"abstract":"  The logico-algebraic study of Lewis's hierarchy of variably strict\nconditional logics has been essentially unexplored, hindering our understanding\nof their mathematical foundations, and the connections with other logical\nsystems. This work aims to fill this gap by providing a comprehensive\nlogico-algebraic analysis of Lewis's logics. We begin by introducing novel\nfinite axiomatizations for varying strengths of Lewis's logics, distinguishing\nbetween global and local consequence relations on Lewisian sphere models. We\nthen demonstrate that the global consequence relation is strongly algebraizable\nin terms of a specific class of Boolean algebras with a binary operator\nrepresenting the counterfactual implication; in contrast, we show that the\nlocal consequence relation is generally not algebraizable, although it can be\ncharacterized as the degree-preserving logic over the same algebraic models.\nFurther, we delve into the algebraic semantics of Lewis's logics, developing\ntwo dual equivalences with respect to particular topological spaces. In more\ndetails, we show a duality with respect to the topological version of Lewis's\nsphere models, and also with respect to Stone spaces with a selection function;\nusing the latter, we demonstrate the strong completeness of Lewis's logics with\nrespect to sphere models. Finally, we draw some considerations concerning the\nlimit assumption over sphere models.\n","subjects":["Mathematics/Logic"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ft4Na3zcJLYNYIdSOJl7lDgnwsHkXe4IzWGD5QAAt1M","pdfSize":"462760","objectId":"0x97f4d0e042e24a58cfa143f1a14a6de058576a2e1bb3ee0ed176c701619fcb34","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
