{"id":"2407.08866","title":"Hidden subcriticality, symplectic structure, and universality of sharp\n  arithmetic spectral results for type I operators","authors":"Lingrui Ge and Svetlana Jitomirskaya","authorsParsed":[["Ge","Lingrui",""],["Jitomirskaya","Svetlana",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 20:59:18 GMT"}],"updateDate":"2024-07-15","timestamp":1720731558000,"abstract":"  We exploit the structure of dual cocycles to develop several new concepts and\ntools for the study of one-frequency quasiperiodic operators with analytic\npotentials. As applications we solve two long-standing arithmetic conjectures:\nuniversality of sharp phase transition in frequency and absolute continuity of\nthe integrated density of states for all frequencies for the entire class of\n(non-critical) type I operators, a large open set including the analytic\nneighborhood of several popular explicit models. Additionally, we prove the\nuniversality of $1/2$-H\\\"older continuity of the integrated density of states\nfor all type I operators with Diophantine frequencies, partially solving You's\nconjecture \\cite{You}.\n  A key dynamical finding: the special symplectic structure of the center of\nthe dual cocycle that, remarkably, holds also in the limit where the cocycle\ndoes not even exist, allows, among other things, to pass for the first time\nfrom trigonometric polynomials to general analytic potentials, in the\nduality-based arguments. It is also applicable in other outstanding problems\nwhere the results so far have only been obtained for the trigonometric\npolynomial case. The hidden subcriticality uncovered by this structure allows\nto define the rotation numbers for these complex-symplectic cocycles and\nreveals the dynamical nature of the special place of even potentials.\n","subjects":["Mathematics/Spectral Theory","Physics/Mathematical Physics","Mathematics/Dynamical Systems","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}