{"id":"2407.21185","title":"Amelia: A Large Model and Dataset for Airport Surface Movement\n  Forecasting","authors":"Ingrid Navarro, Pablo Ortega-Kral, Jay Patrikar, Haichuan Wang, Zelin\n  Ye, Jong Hoon Park, Jean Oh and Sebastian Scherer","authorsParsed":[["Navarro","Ingrid",""],["Ortega-Kral","Pablo",""],["Patrikar","Jay",""],["Wang","Haichuan",""],["Ye","Zelin",""],["Park","Jong Hoon",""],["Oh","Jean",""],["Scherer","Sebastian",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 20:50:48 GMT"}],"updateDate":"2024-08-01","timestamp":1722372648000,"abstract":"  The growing demand for air travel requires technological advancements in air\ntraffic management as well as mechanisms for monitoring and ensuring safe and\nefficient operations. In terminal airspaces, predictive models of future\nmovements and traffic flows can help with proactive planning and efficient\ncoordination; however, varying airport topologies, and interactions with other\nagents, among other factors, make accurate predictions challenging. Data-driven\npredictive models have shown promise for handling numerous variables to enable\nvarious downstream tasks, including collision risk assessment, taxi-out time\nprediction, departure metering, and emission estimations. While data-driven\nmethods have shown improvements in these tasks, prior works lack large-scale\ncurated surface movement datasets within the public domain and the development\nof generalizable trajectory forecasting models. In response to this, we propose\ntwo contributions: (1) Amelia-48, a large surface movement dataset collected\nusing the System Wide Information Management (SWIM) Surface Movement Event\nService (SMES). With data collection beginning in Dec 2022, the dataset\nprovides more than a year's worth of SMES data (~30TB) and covers 48 airports\nwithin the US National Airspace System. In addition to releasing this data in\nthe public domain, we also provide post-processing scripts and associated\nairport maps to enable research in the forecasting domain and beyond. (2)\nAmelia-TF model, a transformer-based next-token-prediction large multi-agent\nmulti-airport trajectory forecasting model trained on 292 days or 9.4 billion\ntokens of position data encompassing 10 different airports with varying\ntopology. The open-sourced model is validated on unseen airports with\nexperiments showcasing the different prediction horizon lengths, ego-agent\nselection strategies, and training recipes to demonstrate the generalization\ncapabilities.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GVo41L0MF3o94x033WMpfM_LOOgVJhqVnNL5ePS4Slc","pdfSize":"10113989"}
