{"id":"2407.13344","title":"Extremal models and direct integrals in affine logic","authors":"Ita\\\"i Ben Yaacov, Tom\\'as Ibarluc\\'ia, Todor Tsankov","authorsParsed":[["Yaacov","Itaï Ben",""],["Ibarlucía","Tomás",""],["Tsankov","Todor",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:41:40 GMT"}],"updateDate":"2024-07-19","timestamp":1721295700000,"abstract":"  Affine logic is a fragment of continuous logic, introduced by Bagheri, in\nwhich only affine functions are allowed as connectives. This has the effect of\nendowing type spaces with the structure of compact convex sets. We study\nextremal models of affine theories (those that only realize extreme types), and\nthe ways and conditions under which all models can be described from the\nextremal ones.\n  We introduce and develop the general theory of measurable fields of metric\nstructures and their direct integrals. One of our main results is an extremal\ndecomposition theorem for models of simplicial theories, that is, affine\ntheories whose type spaces form Choquet simplices. We prove that every model of\na simplicial theory can be (uniquely) decomposed as a direct integral of\nextremal models. This generalizes known decomposition results (ergodic\ndecomposition, tracial von Neumann factor decomposition), and moreover, holds\nwithout any separability hypothesis.\n  Two extreme kinds of simplicial theories are Bauer theories, whose extreme\ntypes form a closed set, and Poulsen theories, whose extreme types form a dense\nset. We show that Keisler randomizations of continuous theories are,\nessentially, the same thing as affine Bauer theories. We establish a dichotomy\nresult: a complete simplicial theory is either Bauer or Poulsen.\n  As part of our analysis, we adapt many results and tools from continuous\nlogic to the affine or extremal contexts (definability, saturation, type\nisolation, categoricity, etc.). We also provide a detailed study of the\nrelations between continuous logic and affine logic.\n  Finally, we present several examples of simplicial theories arising from\ntheories in discrete logic, Hilbert spaces, probability measure-preserving\nsystems, and tracial von Neumann algebras.\n","subjects":["Mathematics/Logic","Mathematics/Functional Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}