{"id":"2407.08368","title":"Magnetograms underestimate even unipolar magnetic flux nearly everywhere\n  on the solar disk","authors":"Jonas Sinjan, Sami K. Solanki, Johann Hirzberger, Tino L.\n  Riethm\\\"uller and Damien Przybylski","authorsParsed":[["Sinjan","Jonas",""],["Solanki","Sami K.",""],["Hirzberger","Johann",""],["Riethmüller","Tino L.",""],["Przybylski","Damien",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 10:23:16 GMT"}],"updateDate":"2024-07-12","timestamp":1720693396000,"abstract":"  We aim to test the reliability of determining the line-of-sight magnetic\nfield from a 3D MHD simulation of a unipolar region. In contrast to earlier\nsimilar studies, we consider the full solar disk, i.e. considering the full\ncentre-to-limb variation, as well as regions with different averaged field\nstrengths. We synthesised Stokes profiles from MURaM MHD simulations of\nunipolar regions with varying mean vertical magnetic flux densities, ranging\nfrom quiet Sun to active region plage. We did this for a comprehensive range of\nheliocentric angles: from $\\mu=1$ to $\\mu=0.15$, and for two commonly used\nphotospheric spectral lines: Fe I $6173.3$ and Fe I $5250.2${\\AA}. The\nline-of-sight magnetic field was derived with a Milne-Eddington Inversion as\nwell as with other commonly used methods. The inferred spatially averaged\n$\\langle B_{LOS}\\rangle$ is always lower than that present in the MHD\nsimulations, with the exception of $\\mu\\approx 1$ and sufficiently high spatial\nresolution. It is also generally inconsistent with a linear dependence on\n$\\mu$. Above $\\mu=0.5$ the spatial resolution greatly impacts the retrieved\nline-of-sight magnetic field. For $\\mu\\leq0.5$ the retrieved $B_{LOS}$ is\nnearly independent of resolution, but is always lower than expected from the\nsimulation. These trends persist regardless of the mean vertical magnetic field\nin the MHD simulations and are independent of the $B_{LOS}$ retrieval method.\nFor $\\mu\\leq0.5$, a larger $\\langle B_{LOS}\\rangle$ is inferred for the\n$5250.2${\\AA} spectral line than $6173.3${\\AA}, but the converse is true at\nhigher $\\mu$. The results found here raise some doubts of the reliability of\ndetermining the radial field by dividing the line-of-sight field by $\\mu$ and\nare of considerable importance for deducing the total magnetic flux of the Sun.\nThey may also contribute to the resolution of the open flux problem.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bC4TwovZm0xazziuWrUChI-BT3LmuvWTrKSjiqQie1c","pdfSize":"22378142","objectId":"0x3a4711f532c751064440e8ee063a60e588bf29f151a12e90e7ecb8a87f582aa4","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
