{"id":"2407.09353","title":"Private Blockchain-based Procurement and Asset Management System with QR\n  Code","authors":"Alonel A. Hugo and Gerard Nathaniel C. Ngo","authorsParsed":[["Hugo","Alonel A.",""],["Ngo","Gerard Nathaniel C.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 15:27:36 GMT"}],"updateDate":"2024-07-15","timestamp":1720798056000,"abstract":"  The developed system aims to incorporate a private blockchain technology in\nthe procurement process for the supply office. The procurement process includes\nthe canvassing, purchasing, delivery and inspection of items, inventory, and\ndisposal. The blockchain-based system includes a distributed ledger technology,\npeer-to-peer network, Proof-of-Authority consensus mechanism, and SHA3-512\ncryptographic hash function algorithm. This will ensure trust and proper\naccountability to the custodian of the property while safeguarding sensitive\ninformation in the procurement records. The extreme prototyping model will be\nused as software development life cycle. It is mostly used for web-based\napplications and has an increased user involvement. The prototype version of\nthe system allows the users get a better understanding of the system being\ndeveloped. It also reduces the time and cost, has quicker user feedback,\nmissing and difficult functions can be recognized, and confusing processes can\nbe addressed on an early stage. The implementation of a private blockchain\ntechnology has an increased privacy, enhanced security, improved efficiency,\nand reduced complexity over traditional blockchain network. The use of SHA3-512\nas cryptographic hash function algorithm is much faster than its predecessors\nwhen cryptography is handled by hardware components. Furthermore, it is not\nvulnerable to length extension attacks making it reliable in terms of security\nof data. The study recommends the use of private blockchain-based technology\nwith the procurement and asset management system in the supply office. The\nprocurement records will be protected against tampering using this technology.\nThis will promote trust and confidence of the stakeholders. The implementation\nof blockchain technology in developing a system served as advancement and\ninnovation in terms of securing data.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DAXbs50VzXr2LsC5UEbh-Pyt9jwf_F4MxnPCFEX0LZw","pdfSize":"287160"}
