{"id":"2407.18008","title":"GermanPartiesQA: Benchmarking Commercial Large Language Models for\n  Political Bias and Sycophancy","authors":"Jan Batzner, Volker Stocker, Stefan Schmid, Gjergji Kasneci","authorsParsed":[["Batzner","Jan",""],["Stocker","Volker",""],["Schmid","Stefan",""],["Kasneci","Gjergji",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 13:04:25 GMT"}],"updateDate":"2024-07-26","timestamp":1721912665000,"abstract":"  LLMs are changing the way humans create and interact with content,\npotentially affecting citizens' political opinions and voting decisions. As\nLLMs increasingly shape our digital information ecosystems, auditing to\nevaluate biases, sycophancy, or steerability has emerged as an active field of\nresearch. In this paper, we evaluate and compare the alignment of six LLMs by\nOpenAI, Anthropic, and Cohere with German party positions and evaluate\nsycophancy based on a prompt experiment. We contribute to evaluating political\nbias and sycophancy in multi-party systems across major commercial LLMs. First,\nwe develop the benchmark dataset GermanPartiesQA based on the Voting Advice\nApplication Wahl-o-Mat covering 10 state and 1 national elections between 2021\nand 2023. In our study, we find a left-green tendency across all examined LLMs.\nWe then conduct our prompt experiment for which we use the benchmark and\nsociodemographic data of leading German parliamentarians to evaluate changes in\nLLMs responses. To differentiate between sycophancy and steerabilty, we use 'I\nam [politician X], ...' and 'You are [politician X], ...' prompts. Against our\nexpectations, we do not observe notable differences between prompting 'I am'\nand 'You are'. While our findings underscore that LLM responses can be\nideologically steered with political personas, they suggest that observed\nchanges in LLM outputs could be better described as personalization to the\ngiven context rather than sycophancy.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}