{"id":"2407.06303","title":"Unsupervised Fault Detection using SAM with a Moving Window Approach","authors":"Ahmed Maged and Herman Shen","authorsParsed":[["Maged","Ahmed",""],["Shen","Herman",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:12:29 GMT"}],"updateDate":"2024-07-10","timestamp":1720462349000,"abstract":"  Automated f ault detection and monitoring in engineering are critical but\nfrequently difficult owing to the necessity for collecting and labeling large\namounts of defective samples . We present an unsupervised method that uses the\nhigh end Segment Anything Model (SAM) and a moving window approach. SAM has\ngained recognition in AI image segmentation communities for its accuracy and\nversatility. However, its performance can be inconsistent when dealing with\ncertain unexpected shapes , such as shadows and subtle surface irregularities.\nThis limitation raise s concerns about its applicability for fault detection in\nreal world scenarios We aim to overcome these challenges without requiring fine\ntun ing or labeled data. Our technique divides pictures into smaller windows,\nwhich are subsequently processed using SAM. This increases the accuracy of\nfault identification by focusing on localized details. We compute the sizes of\nthe segmented sections and then us e a clustering technique to discover\nconsistent fault areas while filtering out noise. To further improve the\nmethod's robustness , we propose adding the Exponentially Weighted Moving\nAverage (EWMA) technique for continuous monitoring in industrial settings,\nwhich would improve the method's capacity to trace faults over time. We compare\nour method to various well established methods u sing a real case study where\nour model achieve s 0.96 accuracy compared to 0. 8 5 for the second best\nmethod. W e also compare our method us ing two open source datasets where our\nmodel attains a consistent 0. 86 accuracy across the datasets compared to 0.53\nand 0.54 for second best model s.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}