{"id":"2407.15600","title":"A Pairwise Comparison Relation-assisted Multi-objective Evolutionary\n  Neural Architecture Search Method with Multi-population Mechanism","authors":"Yu Xue, Chenchen Zhu, MengChu Zhou, Mohamed Wahib, Moncef Gabbouj","authorsParsed":[["Xue","Yu",""],["Zhu","Chenchen",""],["Zhou","MengChu",""],["Wahib","Mohamed",""],["Gabbouj","Moncef",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 12:46:22 GMT"}],"updateDate":"2024-07-23","timestamp":1721652382000,"abstract":"  Neural architecture search (NAS) enables re-searchers to automatically\nexplore vast search spaces and find efficient neural networks. But NAS suffers\nfrom a key bottleneck, i.e., numerous architectures need to be evaluated during\nthe search process, which requires a lot of computing resources and time. In\norder to improve the efficiency of NAS, a series of methods have been proposed\nto reduce the evaluation time of neural architectures. However, they are not\nefficient enough and still only focus on the accuracy of architectures. In\naddition to the classification accuracy, more efficient and smaller network\narchitectures are required in real-world applications. To address the above\nproblems, we propose the SMEM-NAS, a pairwise com-parison relation-assisted\nmulti-objective evolutionary algorithm based on a multi-population mechanism.\nIn the SMEM-NAS, a surrogate model is constructed based on pairwise compari-son\nrelations to predict the accuracy ranking of architectures, rather than the\nabsolute accuracy. Moreover, two populations cooperate with each other in the\nsearch process, i.e., a main population guides the evolution, while a vice\npopulation expands the diversity. Our method aims to provide high-performance\nmodels that take into account multiple optimization objectives. We conduct a\nseries of experiments on the CIFAR-10, CIFAR-100 and ImageNet datasets to\nverify its effectiveness. With only a single GPU searching for 0.17 days,\ncompetitive architectures can be found by SMEM-NAS which achieves 78.91%\naccuracy with the MAdds of 570M on the ImageNet. This work makes a significant\nadvance in the important field of NAS.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}