{"id":"2407.16329","title":"PhenoFlow: A Human-LLM Driven Visual Analytics System for Exploring\n  Large and Complex Stroke Datasets","authors":"Jaeyoung Kim, Sihyeon Lee, Hyeon Jeon, Keon-Joo Lee, Hee-Joon Bae,\n  Bohyoung Kim, Jinwook Seo","authorsParsed":[["Kim","Jaeyoung",""],["Lee","Sihyeon",""],["Jeon","Hyeon",""],["Lee","Keon-Joo",""],["Bae","Hee-Joon",""],["Kim","Bohyoung",""],["Seo","Jinwook",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 09:25:59 GMT"}],"updateDate":"2024-07-24","timestamp":1721726759000,"abstract":"  Acute stroke demands prompt diagnosis and treatment to achieve optimal\npatient outcomes. However, the intricate and irregular nature of clinical data\nassociated with acute stroke, particularly blood pressure (BP) measurements,\npresents substantial obstacles to effective visual analytics and\ndecision-making. Through a year-long collaboration with experienced\nneurologists, we developed PhenoFlow, a visual analytics system that leverages\nthe collaboration between human and Large Language Models (LLMs) to analyze the\nextensive and complex data of acute ischemic stroke patients. PhenoFlow\npioneers an innovative workflow, where the LLM serves as a data wrangler while\nneurologists explore and supervise the output using visualizations and natural\nlanguage interactions. This approach enables neurologists to focus more on\ndecision-making with reduced cognitive load. To protect sensitive patient\ninformation, PhenoFlow only utilizes metadata to make inferences and synthesize\nexecutable codes, without accessing raw patient data. This ensures that the\nresults are both reproducible and interpretable while maintaining patient\nprivacy. The system incorporates a slice-and-wrap design that employs temporal\nfolding to create an overlaid circular visualization. Combined with a linear\nbar graph, this design aids in exploring meaningful patterns within irregularly\nmeasured BP data. Through case studies, PhenoFlow has demonstrated its\ncapability to support iterative analysis of extensive clinical datasets,\nreducing cognitive load and enabling neurologists to make well-informed\ndecisions. Grounded in long-term collaboration with domain experts, our\nresearch demonstrates the potential of utilizing LLMs to tackle current\nchallenges in data-driven clinical decision-making for acute ischemic stroke\npatients.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}