{"id":"2407.03960","title":"The second-order Esscher martingale densities for continuous-time market\n  models","authors":"Tahir Choulli, Ella Elazkany, Mich\\`ele Vanmaele","authorsParsed":[["Choulli","Tahir",""],["Elazkany","Ella",""],["Vanmaele","Michèle",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 14:28:03 GMT"}],"updateDate":"2024-07-08","timestamp":1720103283000,"abstract":"  In this paper, we introduce the second-order Esscher pricing notion for\ncontinuous-time models. Depending whether the stock price $S$ or its logarithm\nis the main driving noise/shock in the Esscher definition, we obtained two\nclasses of second-order Esscher densities called linear class and exponential\nclass respectively. Using the semimartingale characteristics to parametrize\n$S$, we characterize the second-order Esscher densities (exponential and\nlinear) using pointwise equations. The role of the second order concept is\nhighlighted in many manners and the relationship between the two classes is\nsingled out for the one-dimensional case. Furthermore, when $S$ is a compound\nPoisson model, we show how both classes are related to the\nDelbaen-Haenzendonck's risk-neutral measure. Afterwards, we restrict our model\n$S$ to follow the jump-diffusion model, for simplicity only, and address the\nbounds of the stochastic Esscher pricing intervals. In particular, no matter\nwhat is the Esscher class, we prove that both bounds (upper and lower) are\nsolutions to the same linear backward stochastic differential equation (BSDE\nhereafter for short) but with two different constraints. This shows that BSDEs\nwith constraints appear also in a setting beyond the classical cases of\nconstraints on gain-processes or constraints on portfolios. We prove that our\nresulting constrained BSDEs have solutions in our framework for a large class\nof claims' payoffs including any bounded claim, in contrast to the literature,\nand we single out the monotonic sequence of BSDEs that ``naturally\" approximate\nit as well.\n","subjects":["Quantitative Finance/Mathematical Finance","Mathematics/Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}