{"id":"2407.16857","title":"SECRM-2D: RL-Based Efficient and Comfortable Route-Following Autonomous\n  Driving with Analytic Safety Guarantees","authors":"Tianyu Shi, Ilia Smirnov, Omar ElSamadisy, Baher Abdulhai","authorsParsed":[["Shi","Tianyu",""],["Smirnov","Ilia",""],["ElSamadisy","Omar",""],["Abdulhai","Baher",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 21:54:39 GMT"}],"updateDate":"2024-07-25","timestamp":1721771679000,"abstract":"  Over the last decade, there has been increasing interest in autonomous\ndriving systems. Reinforcement Learning (RL) shows great promise for training\nautonomous driving controllers, being able to directly optimize a combination\nof criteria such as efficiency comfort, and stability. However, RL- based\ncontrollers typically offer no safety guarantees, making their readiness for\nreal deployment questionable. In this paper, we propose SECRM-2D (the Safe,\nEfficient and Comfortable RL- based driving Model with Lane-Changing), an RL\nautonomous driving controller (both longitudinal and lateral) that balances\noptimization of efficiency and comfort and follows a fixed route, while being\nsubject to hard analytic safety constraints. The aforementioned safety\nconstraints are derived from the criterion that the follower vehicle must have\nsufficient headway to be able to avoid a crash if the leader vehicle brakes\nsuddenly. We evaluate SECRM-2D against several learning and non-learning\nbaselines in simulated test scenarios, including freeway driving, exiting,\nmerging, and emergency braking. Our results confirm that representative\npreviously-published RL AV controllers may crash in both training and testing,\neven if they are optimizing a safety objective. By contrast, our controller\nSECRM-2D is successful in avoiding crashes during both training and testing,\nimproves over the baselines in measures of efficiency and comfort, and is more\nfaithful in following the prescribed route. In addition, we achieve a good\ntheoretical understanding of the longitudinal steady-state of a collection of\nSECRM-2D vehicles.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7_YDBc0UGjpFXbBytwNHnZqDptd1bAgT-gDwyH0xrGg","pdfSize":"7903333","objectId":"0x8a62374d0b313e07d4141f475c3e3ffab3dabbccb6fee65729514a932656d813","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
