{"id":"2407.05268","title":"Federated Knowledge Transfer Fine-tuning Large Server Model with\n  Resource-Constrained IoT Clients","authors":"Shaoyuan Chen, Linlin You, Rui Liu, Shuo Yu, Ahmed M. Abdelmoniem","authorsParsed":[["Chen","Shaoyuan",""],["You","Linlin",""],["Liu","Rui",""],["Yu","Shuo",""],["Abdelmoniem","Ahmed M.",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 05:46:01 GMT"}],"updateDate":"2024-07-09","timestamp":1720331161000,"abstract":"  The training of large models, involving fine-tuning, faces the scarcity of\nhigh-quality data. Compared to the solutions based on centralized data centers,\nupdating large models in the Internet of Things (IoT) faces challenges in\ncoordinating knowledge from distributed clients by using their private and\nheterogeneous data. To tackle such a challenge, we propose KOALA (Federated\nKnowledge Transfer Fine-tuning Large Server Model with Resource-Constrained IoT\nClients) to impel the training of large models in IoT. Since the resources\nobtained by IoT clients are limited and restricted, it is infeasible to locally\nexecute large models and also update them in a privacy-preserving manner.\nTherefore, we leverage federated learning and knowledge distillation to update\nlarge models through collaboration with their small models, which can run\nlocally at IoT clients to process their private data separately and enable\nlarge-small model knowledge transfer through iterative learning between the\nserver and clients. Moreover, to support clients with similar or different\ncomputing capacities, KOALA is designed with two kinds of large-small model\njoint learning modes, namely to be homogeneous or heterogeneous. Experimental\nresults demonstrate that compared to the conventional approach, our method can\nnot only achieve similar training performance but also significantly reduce the\nneed for local storage and computing power resources.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}