{"id":"2407.16420","title":"Feasibility of Li decorated Si6C14 and Si8C12 nanocages as promising\n  hydrogen storage media: A computational study","authors":"Ankita Jaiswal, Rakesh K. Sahoo, and Sridhar Sahu","authorsParsed":[["Jaiswal","Ankita",""],["Sahoo","Rakesh K.",""],["Sahu","Sridhar",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 12:10:07 GMT"}],"updateDate":"2024-07-24","timestamp":1721736607000,"abstract":"  This article presents the reversible hydrogen storage capacities of\nLi-decorated Si6C14 and Si8C12 using Density Functional Theory (DFT). The\nchemical stabilities of the designed Si6C14Li6 and Si8C12Li4 nanocages are\ninvestigated using HOMO-LUMO gaps and various global reactivity descriptors\nsuch as chemical hardness and electrophilicity index. Our study reveals that\neach Li atom decorated over the designed Si6C14 and Si8C12 nanocages can hold\nup to 5H2 molecules with adsorption energy lying in the optimum range of\n0.14-0.085 eV, thereby yielding an overall gravimetric density of 13.8% and\n9.2% respectively. The interaction between adsorbed H2 molecules and the Li\nmetal sites is found to occur via non-covalent and closed shell type of\ninteraction. The H2 molecules are adsorbed in a quasi-molecular fashion with\nelongated bond length. The molecular dynamics study reveals that most of the H2\nmolecules get desorbed from the designed host nanocages at 300K without causing\nany significant structural changes, which confirms their reversibility. When\nthe adsorption and desorption conditions are set at 100K/60bar and 240K/1bar\nrespectively, the practical storage gravimetric densities of Si6C14Li6 and\nSi8C12Li4 cages are estimated to be 13.73 wt% and 9.08 wt%, which are\nrelatively high in comparison to the US-DOE target of 5.5 wt% by the year 2020.\nHence, the computationally designed Si6C14Li6 and Si8C12Li4 nanocages can be\nregarded as prospective systems for hydrogen storage applications.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}