{"id":"2407.21620","title":"VEGAS-SSS: Tracing Globular Cluster Populations in the Interacting\n  NGC3640 Galaxy Group","authors":"Marco Mirabile, Michele Cantiello, Pratik Lonare, Rossella Ragusa,\n  Maurizio Paolillo, Nandini Hazra, Antonio La Marca, Enrichetta Iodice,\n  Marilena Spavone, Steffen Mieske, Marina Rejkuba, Michael Hilker, Gabriele\n  Riccio, Rebecca A. Habas, Enzo Brocato, Pietro Schipani, Aniello Grado, and\n  Luca Limatola","authorsParsed":[["Mirabile","Marco",""],["Cantiello","Michele",""],["Lonare","Pratik",""],["Ragusa","Rossella",""],["Paolillo","Maurizio",""],["Hazra","Nandini",""],["La Marca","Antonio",""],["Iodice","Enrichetta",""],["Spavone","Marilena",""],["Mieske","Steffen",""],["Rejkuba","Marina",""],["Hilker","Michael",""],["Riccio","Gabriele",""],["Habas","Rebecca A.",""],["Brocato","Enzo",""],["Schipani","Pietro",""],["Grado","Aniello",""],["Limatola","Luca",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:13:02 GMT"}],"updateDate":"2024-08-01","timestamp":1722435182000,"abstract":"  Globular clusters (GCs) are among the oldest stellar systems in the universe.\nAs such, GCs population are valuable fossil tracers of galaxy formation and\ninteraction history. We use the multi-band wide-field images obtained with the\nVST to study the properties of the GC population in an interacting pair of\ngalaxies. We derived ugri photometry over $1.5x1.5deg^2$ centred on the galaxy\ngroup composed by two elliptical galaxies: NGC3640 and its fainter companion\nNGC3641. We studied the GC system properties from both the ugri and gri matched\ncatalogs GC candidates were identified based on a combination of photometric\nproperties (colors, magnitudes) and morphometric criteria (concentration index,\nelongation, FWHM), using sources with well-defined classifications from\nspectroscopic or imaging data available in the literature and numerical\nsimulations as references. The selection criteria were also applied to empty\nfields to determine a statistical background correction for the number of\nidentified GC candidates. The 2D density maps of GCs appear to align with the\ndiffuse light patches resulting from merging events of the galaxies. The\nhighest density peak of GCs is observed to be on NGC3641 rather than NGC3640,\ndespite the latter being the more massive galaxy. The azimuthal averaged radial\ndensity profiles in both galaxies reveal that the GC population extends beyond\nthe galaxy light profile and indicate the likely presence of an intra-group GC\ncomponent. A color bimodality in (u-r) and (g-i) is observed for NGC3641,\nwhereas NGC3640 shows a broad unimodal distribution. Analysis of the GC\nLuminosity Function indicates that both galaxies are roughly located at the\nsame distance (~27Mpc). We provide an estimate of the total number of GCs, and\ndetermine the specific frequency for NGC3640, $S_N =2.0\\pm0.6$, which aligns\nwith expectations, while for NGC3641 we find a large $S_N=4.5\\pm1.6$.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}