{"id":"2407.21788","title":"Vision-Language Model Based Handwriting Verification","authors":"Mihir Chauhan, Abhishek Satbhai, Mohammad Abuzar Hashemi, Mir Basheer\n  Ali, Bina Ramamurthy, Mingchen Gao, Siwei Lyu, Sargur Srihari","authorsParsed":[["Chauhan","Mihir",""],["Satbhai","Abhishek",""],["Hashemi","Mohammad Abuzar",""],["Ali","Mir Basheer",""],["Ramamurthy","Bina",""],["Gao","Mingchen",""],["Lyu","Siwei",""],["Srihari","Sargur",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 17:57:32 GMT"}],"updateDate":"2024-08-01","timestamp":1722448652000,"abstract":"  Handwriting Verification is a critical in document forensics. Deep learning\nbased approaches often face skepticism from forensic document examiners due to\ntheir lack of explainability and reliance on extensive training data and\nhandcrafted features. This paper explores using Vision Language Models (VLMs),\nsuch as OpenAI's GPT-4o and Google's PaliGemma, to address these challenges. By\nleveraging their Visual Question Answering capabilities and 0-shot\nChain-of-Thought (CoT) reasoning, our goal is to provide clear,\nhuman-understandable explanations for model decisions. Our experiments on the\nCEDAR handwriting dataset demonstrate that VLMs offer enhanced\ninterpretability, reduce the need for large training datasets, and adapt better\nto diverse handwriting styles. However, results show that the CNN-based\nResNet-18 architecture outperforms the 0-shot CoT prompt engineering approach\nwith GPT-4o (Accuracy: 70%) and supervised fine-tuned PaliGemma (Accuracy:\n71%), achieving an accuracy of 84% on the CEDAR AND dataset. These findings\nhighlight the potential of VLMs in generating human-interpretable decisions\nwhile underscoring the need for further advancements to match the performance\nof specialized deep learning models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"okHvY4fsiKAoHVmcMKzzZiiAmGMiqUVmTWjFUVqNpzA","pdfSize":"269005"}
