{"id":"2407.21395","title":"HINER: Neural Representation for Hyperspectral Image","authors":"Junqi Shi, Mingyi Jiang, Ming Lu, Tong Chen, Xun Cao and Zhan Ma","authorsParsed":[["Shi","Junqi",""],["Jiang","Mingyi",""],["Lu","Ming",""],["Chen","Tong",""],["Cao","Xun",""],["Ma","Zhan",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 07:35:15 GMT"}],"updateDate":"2024-08-01","timestamp":1722411315000,"abstract":"  This paper introduces {HINER}, a novel neural representation for compressing\nHSI and ensuring high-quality downstream tasks on compressed HSI. HINER fully\nexploits inter-spectral correlations by explicitly encoding of spectral\nwavelengths and achieves a compact representation of the input HSI sample\nthrough joint optimization with a learnable decoder. By additionally\nincorporating the Content Angle Mapper with the L1 loss, we can supervise the\nglobal and local information within each spectral band, thereby enhancing the\noverall reconstruction quality. For downstream classification on compressed\nHSI, we theoretically demonstrate the task accuracy is not only related to the\nclassification loss but also to the reconstruction fidelity through a\nfirst-order expansion of the accuracy degradation, and accordingly adapt the\nreconstruction by introducing Adaptive Spectral Weighting. Owing to the\nmonotonic mapping of HINER between wavelengths and spectral bands, we propose\nImplicit Spectral Interpolation for data augmentation by adding random\nvariables to input wavelengths during classification model training.\nExperimental results on various HSI datasets demonstrate the superior\ncompression performance of our HINER compared to the existing learned methods\nand also the traditional codecs. Our model is lightweight and computationally\nefficient, which maintains high accuracy for downstream classification task\neven on decoded HSIs at high compression ratios. Our materials will be released\nat https://github.com/Eric-qi/HINER.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}