{"id":"2407.16851","title":"Nonlinear dynamics of vortex pairing in transitional jets","authors":"Akhil Nekkanti, Tim Colonius, Oliver T. Schmidt","authorsParsed":[["Nekkanti","Akhil",""],["Colonius","Tim",""],["Schmidt","Oliver T.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 21:26:56 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 20:09:53 GMT"}],"updateDate":"2024-08-02","timestamp":1721770016000,"abstract":"  This study investigates the onset of linear instabilities and their later\nnonlinear interactions in the shear layer of an initially-laminar jet using a\ncombination of stability analysis and data from high-fidelity flow simulations.\nWe provide a complete picture of the vortex-pairing process. Hydrodynamic\ninstabilities initiate the transition to turbulence, causing the shear layer to\nspread rapidly. In this process, the shear layer rolls up to form vortices,\naccompanied by the exponential growth of the fundamental frequency. As the\nfundamental frequency grows, it gains energy from the mean flow. Subsequently,\nas it saturates and begins to decay, the fundamental vortices start to pair.\nDuring this vortex pairing process, the subharmonic vortex acquires energy both\nlinearly from the mean flow and nonlinearly through a reverse cascade from the\nfundamental. The process concludes when the subharmonic vortex eventually\nsaturates. Similarly, two subharmonic vortices merge to form a second\nsubharmonic vortex. Our results confirm Kelly's (1967) hypothesis of a\nresonance mechanism between the fundamental and subharmonic, which supplies\nenergy to the subharmonic. In this multi-tonal, convective-dominated flow, we\nclarify the ambiguity surrounding the fundamental frequency by demonstrating\nthat the spatially most amplified frequency should be considered fundamental,\nrather than the structure associated with the spectral energy peak. For the\ninitially-laminar jet considered here, the fundamental frequency corresponds to\nthe fourth largest spectral peak, highlighting the important distinction\nbetween the energetically and dynamical significance of a tone. Despite its low\nenergy, the fundamental frequency is dynamically dominant as it determines all\nother spectral peaks and supplies energy to the subharmonics through a reverse\nenergy cascade.\n","subjects":["Physics/Fluid Dynamics","Nonlinear Sciences/Adaptation and Self-Organizing Systems","Nonlinear Sciences/Pattern Formation and Solitons","Physics/Data Analysis, Statistics and Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}