{"id":"2407.09916","title":"Measuring kinetic inductance and superfluid stiffness of two-dimensional\n  superconductors using high-quality transmission-line resonators","authors":"Mary Kreidel, Xuanjing Chu, Jesse Balgley, Nishchhal Verma, Julian\n  Ingham, Leonardo Ranzani, Raquel Queiroz, Robert M. Westervelt, James Hone,\n  and Kin Chung Fong","authorsParsed":[["Kreidel","Mary",""],["Chu","Xuanjing",""],["Balgley","Jesse",""],["Verma","Nishchhal",""],["Ingham","Julian",""],["Ranzani","Leonardo",""],["Queiroz","Raquel",""],["Westervelt","Robert M.",""],["Hone","James",""],["Fong","Kin Chung",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 15:26:00 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 16:25:15 GMT"}],"updateDate":"2024-07-19","timestamp":1720884360000,"abstract":"  The discovery of van der Waals superconductors in recent years has generated\na lot of excitement for their potentially novel pairing mechanisms. However,\ntheir typical atomic-scale thickness and micrometer-scale lateral dimensions\nimpose severe challenges to investigations of pairing symmetry by conventional\nmethods. In this report we demonstrate a new technique that employs\nhigh-quality-factor superconducting resonators to measure the kinetic\ninductance -- up to a part per million -- and loss of a van der Waals\nsuperconductor. We analyze the equivalent circuit model to extract the kinetic\ninductance, superfluid stiffness, penetration depth, and ratio of imaginary and\nreal parts of the complex conductivity. We validate the technique by measuring\naluminum and finding excellent agreement in both the zero-temperature\nsuperconducting gap as well as the complex conductivity data when compared with\nBCS theory. We then demonstrate the utility of the technique by measuring the\nkinetic inductance of multi-layered niobium diselenide and discuss the limits\nto the accuracy of our technique when the transition temperature of the sample,\nNbSe$_2$ at 7.06 K, approaches our Nb probe resonator at 8.59 K. Our method\nwill be useful for practitioners in the growing fields of superconducting\nphysics, materials science, and quantum sensing, as a means of characterizing\nsuperconducting circuit components and studying pairing mechanisms of the novel\nsuperconducting states which arise in layered 2D materials and\nheterostructures.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Physics/Applied Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}