{"id":"2407.15919","title":"Lectures on the quantum phase transitions of metals","authors":"Subir Sachdev","authorsParsed":[["Sachdev","Subir",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:00:00 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 19:30:49 GMT"},{"version":"v3","created":"Thu, 8 Aug 2024 10:53:12 GMT"},{"version":"v4","created":"Sun, 18 Aug 2024 09:05:56 GMT"}],"updateDate":"2024-08-20","timestamp":1721671200000,"abstract":"  Quantum phase transitions of metals involve changes in the Fermi surface, and\ncan be divided into three categories. The first two categories involve symmetry\nbreaking, and lead to a deformation or reconstruction of the Fermi surface. The\nthird category involves a change in the volume enclosed by the Fermi surface\nwithout any symmetry breaking: one phase is a Fermi liquid (FL) with the\nconventional Luttinger volume, while the other phase is a `fractionalized Fermi\nliquid' (FL*), which has a non-Luttinger volume Fermi surface accompanied by a\nspin liquid with fractionalized excitations. It is a relatively simple matter\nto obtain a FL*-FL transition in Kondo lattice models. However, the FL*-FL\ntransition can also be present in single-band Hubbard-like models: this is\nefficiently described by the `ancilla' method, which shows that the transition\nis a `flipped' Kondo lattice transition. This single-band FL*-FL transition is\nargued to apply to the metallic states of the hole-doped cuprates. In the clean\nlimit, the critical properties of the quantum transitions in the three\ncategories are distinct, but all lead to perfect metal transport in the\nquantum-critical regime. Impurity-induced `Harris disorder', with spatial\nfluctuations in the local position of the quantum critical point, is a relevant\nperturbation to the clean critical points. In the presence of Harris disorder,\nall three categories exhibit strange metal behavior, which can be described by\na universal two-dimensional Yukawa-Sachdev-Ye-Kitaev model.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}