{"id":"2407.01771","title":"The little coadd that could: Estimating shear from coadded images","authors":"Robert Armstrong, Erin Sheldon, Eric Huff, Jim Bosch, Eli Rykoff,\n  Rachel Mandelbaum, Arun Kannawadi, Peter Melchior, Robert Lupton, Matthew R.\n  Becker, Yusra Al-Sayyed, The LSST Dark Energy Science Collaboration","authorsParsed":[["Armstrong","Robert",""],["Sheldon","Erin",""],["Huff","Eric",""],["Bosch","Jim",""],["Rykoff","Eli",""],["Mandelbaum","Rachel",""],["Kannawadi","Arun",""],["Melchior","Peter",""],["Lupton","Robert",""],["Becker","Matthew R.",""],["Al-Sayyed","Yusra",""],["Collaboration","The LSST Dark Energy Science",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 20:00:01 GMT"}],"updateDate":"2024-07-03","timestamp":1719864001000,"abstract":"  Upcoming wide field surveys will have many overlapping epochs of the same\nregion of sky. The conventional wisdom is that in order to reduce the errors\nsufficiently for systematics-limited measurements, like weak lensing, we must\ndo simultaneous fitting of all the epochs. Using current algorithms this will\nrequire a significant amount of computing time and effort. In this paper, we\nrevisit the potential of using coadds for shear measurements. We show on a set\nof image simulations that the multiplicative shear bias can be constrained\nbelow the 0.1% level on coadds, which is sufficient for future lensing surveys.\nWe see no significant differences between simultaneous fitting and coadded\napproaches for two independent shear codes: Metacalibration and BFD. One caveat\nof our approach is the assumption of a principled coadd, i.e. the PSF is\nmathematically well-defined for all the input images. This requires us to\nreject CCD images that do not fully cover the coadd region. We estimate that\nthe number of epochs that must be rejected for a survey like LSST is on the\norder of 20%, resulting in a small loss in depth of less than 0.1 magnitudes.\nWe also put forward a cell-based coaddition scheme that meets the above\nrequirements for unbiased weak lensing shear estimation in the context of LSST.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}