{"id":"2407.02410","title":"The influence of the 3D Galactic gas structure on cosmic-ray transport\n  and gamma-ray emission","authors":"Andr\\'es Ram\\'irez, Gordian Edenhofer, Torsten A. En{\\ss}lin, Philipp\n  Frank, Philipp Mertsch, Vo Hong Minh Phan, Laurin S\\\"oding, Hanieh\n  Zhandinejad, Ralf Kissmann","authorsParsed":[["Ramírez","Andrés",""],["Edenhofer","Gordian",""],["Enßlin","Torsten A.",""],["Frank","Philipp",""],["Mertsch","Philipp",""],["Phan","Vo Hong Minh",""],["Söding","Laurin",""],["Zhandinejad","Hanieh",""],["Kissmann","Ralf",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 16:33:19 GMT"}],"updateDate":"2024-07-03","timestamp":1719937999000,"abstract":"  Cosmic rays (CRs) play a major role in the dynamics of the interstellar\nmedium (ISM). Their interactions and transport ionize, heat, and push the ISM\nthereby coupling different regions of it. The spatial distribution of CRs\ndepends on the distribution of their sources as well as the ISM constituents\nthey interact with, such as gas, starlight, and magnetic fields. Particularly,\ngas interacts closely with CRs, influencing CR fluxes and gamma -ray emission.\nWe illustrate the influence of 3D gas structures on CR transport and gamma -ray\nemission. We use the PICARD code and multiple samples of recent 3D\nreconstructions of the HI and H$_2$ Galactic gas constituents to investigate\nthe impact on the transport of CRs and emission of gamma -rays. We find the\nnecessary transport parameters to reproduce local measurements of CR fluxes,\nand see that they depend on the local distribution of gas density and\nstructure. The distribution of CR fluxes exhibits energy-dependent structures\nthat vary for all CR species due to their corresponding loss processes. Regions\nof enhanced secondary (primary) species are spatially correlated\n(anti-correlated) with the gas density. We observe a high sensitivity of the\ngamma -ray emission on the contrast of gas structures, as those determine the\n3D spatial distributions of hadronic interactions and bremsstrahlung. We find\nthat corresponding gas-induced structures in the distribution of CR electrons\nare also visible in Inverse Compton (IC) emission. Due to the aforementioned\nsensitivity, the analysis of CR data for CR sources and transport parameters\nrequires the usage of accurate 3D gas maps.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}