{"id":"2407.02484","title":"Characterizing the Interpretability of Attention Maps in Digital\n  Pathology","authors":"Tom\\'e Albuquerque, Anil Y\\\"uce, Markus D. Herrmann, Alvaro Gomariz","authorsParsed":[["Albuquerque","Tomé",""],["Yüce","Anil",""],["Herrmann","Markus D.",""],["Gomariz","Alvaro",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 17:58:58 GMT"}],"updateDate":"2024-07-03","timestamp":1719943138000,"abstract":"  Interpreting machine learning model decisions is crucial for high-risk\napplications like healthcare. In digital pathology, large whole slide images\n(WSIs) are decomposed into smaller tiles and tile-derived features are\nprocessed by attention-based multiple instance learning (ABMIL) models to\npredict WSI-level labels. These networks generate tile-specific attention\nweights, which can be visualized as attention maps for interpretability.\nHowever, a standardized evaluation framework for these maps is lacking,\nquestioning their reliability and ability to detect spurious correlations that\ncan mislead models. We herein propose a framework to assess the ability of\nattention networks to attend to relevant features in digital pathology by\ncreating artificial model confounders and using dedicated interpretability\nmetrics. Models are trained and evaluated on data with tile modifications\ncorrelated with WSI labels, enabling the analysis of model sensitivity to\nartificial confounders and the accuracy of attention maps in highlighting them.\nConfounders are introduced either through synthetic tile modifications or\nthrough tile ablations based on their specific image-based features, with the\nlatter being used to assess more clinically relevant scenarios. We also analyze\nthe impact of varying confounder quantities at both the tile and WSI levels.\nOur results show that ABMIL models perform as desired within our framework.\nWhile attention maps generally highlight relevant regions, their robustness is\naffected by the type and number of confounders. Our versatile framework has the\npotential to be used in the evaluation of various methods and the exploration\nof image-based features driving model predictions, which could aid in biomarker\ndiscovery.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}