{"id":"2407.13412","title":"Transient segregation of different density granular mixtures","authors":"Soniya Kumawat, Vishnu Kumar Sahu, and Anurag Tripathi","authorsParsed":[["Kumawat","Soniya",""],["Sahu","Vishnu Kumar",""],["Tripathi","Anurag",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 11:31:21 GMT"}],"updateDate":"2024-07-19","timestamp":1721302281000,"abstract":"  We study time-dependent density segregation of granular mixtures flowing over\nan inclined plane. Discrete Element Method (DEM) simulations in a periodic box\nare performed for granular mixtures of same size and different density\nparticles flowing under the influence of gravity. In addition, a continuum\nmodel is developed to solve the momentum balance equations along with species\ntransport equation by accounting for the inter-coupling of segregation and\nrheology. The particle force-based density segregation theory has been used\nalong with the $\\mu-I$ rheology to predict evolution of flow properties with\ntime for binary and multicomponent mixtures. The effect of particle\narrangements on the transient evolution of flow properties for three different\ninitial configurations is investigated using both continuum and DEM\nsimulations. Continuum predictions for various flow properties of interest such\nas species concentration, velocity, pressure, and shear stress at different\ntime instants are compared with DEM simulations. The results from the discrete\nand continuum models are found to be in good agreement with each other for\nwell-mixed and heavy-near-base initial configurations. However, the continuum\nmodel is unable to predict the flow evolution for the light-near-base initial\nconfiguration. DEM simulations reveal the presence of an instability driven,\nquick segregation for this configuration which is not predicted by the one\ndimensional model and requires generalization to three dimensions.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}