{"id":"2407.14548","title":"Triply charm and bottom tetraquarks in a constituent quark model","authors":"Gang Yang, Jialun Ping and Jorge Segovia","authorsParsed":[["Yang","Gang",""],["Ping","Jialun",""],["Segovia","Jorge",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 18:00:41 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 07:00:32 GMT"}],"updateDate":"2024-07-25","timestamp":1721152841000,"abstract":"  Singly, doubly and fully charmed tetraquark candidates, \\emph{e.g.},\n$T_{c\\bar{s}}(2900)$, $T^+_{cc}(3875)$ and $X(6900)$ have been recently\nreported by the LHCb collaboration. Therefore, it is timely to implement a\ntheoretical investigation on triply heavy tetraquark systems; herein, the\nS-wave triply charm and bottom tetraquarks, $\\bar{Q}Q\\bar{q}Q$\n$(q=u,\\,d,\\,s;\\,Q=c,\\,b)$, with spin-parity $J^P=0^+$, $1^+$ and $2^+$, isospin\n$I=0$ and $\\frac{1}{2}$, are systematically studied in a constituent quark\nmodel. Besides, all tetraquark configurations, \\emph{i.e.} meson-meson,\ndiquark-antidiquark and K-type arrangements, along with any allowed color\nstructure, are comprehensively considered. The Gaussian expansion method (GEM),\nin combination with the complex-scaling method (CSM), which is quite ingenious\nin dealing with either bound or resonances, is the approach adopted in solving\nthe complex scaled Schr\\\"odinger equation. This theoretical framework has\nalready been applied in various tetra- and penta-quark systems. In a fully\ncoupled-channel calculation within the GEM$+$CSM, narrow resonances are found\nin each $I(J^P)$ channel of the charm and bottom sector. In particular, triply\ncharm and bottom tetraquark resonances are obtained in $5.6-5.9$ GeV and\n$15.3-15.7$ GeV, respectively. We provide also some insights of the\ncompositeness of these exotic states, such as the inner quark distance,\nmagnetic moment and dominant wave function component. All this may help to\ndistinguish them in future high energy nuclear and particle experiments.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Lattice","Physics/Nuclear Experiment","Physics/Nuclear Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}