{"id":"2407.00348","title":"Accretion of the degenerate Fermi gas onto a Reissner-Nordstr\\\"{o}m\n  black hole","authors":"Ping Li, Jiang-he Yang, and Siwei Xu","authorsParsed":[["Li","Ping",""],["Yang","Jiang-he",""],["Xu","Siwei",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 07:35:38 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 02:10:20 GMT"}],"updateDate":"2024-07-30","timestamp":1719646538000,"abstract":"  We investigate the stationary, spherically symmetric accretion of a\ndegenerate relativistic Fermi gas onto a Reissner-Nordstr\\\"{o}m black hole. The\naccretion theory is based on the Boyer-Lindquist coordinates and the Fermi gas\nfollows Fermi-Dirac statistics at infinity. We have derived the expression for\nthe particle current density, the stress energy-momentum tensor, and three\naccretion rates. As the charged particle falls into the black hole, both the\nmass and the charge of the black hole increase. Consequently, the mass\naccretion rate and charge accretion rate are proportional to the particle\naccretion rate. We have also provided analytical results at infinity and\nnumerical results within a finite range for these quantities. Our results\nindicate that the accretion rate decreases as the charge of the black hole\nincreases, suggests that the presence of naked singularities is avoided in\nblack hole accretion theory. In this paper, we also discovered that the\naccretion model of Vlasov gas behaves as an anisotropic fluid containing two\nperfect-fluid components. One component represents the isotropic fluid of Fermi\ngas, while the other represents a null fluid. When using the Boyer-Lindquist\ncoordinate system, we observed that the contribution from the null fluid\npersists even at infinity, which led to the radial pressure always smaller than\nthe tangential pressure. Therefore, it's not appropriate to treat the accretion\nmodel as a perfect fluid at infinity.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}