{"id":"2407.03225","title":"The large-scale structure around the Fornax-Eridanus Complex","authors":"Maria Angela Raj, Petra Awad, Reynier F. Peletier, Rory Smith, Ulrike\n  Kuchner, Rien van de Weygaert, Noam I. Libeskind, Marco Canducci, Peter Tino,\n  Kerstin Bunte","authorsParsed":[["Raj","Maria Angela",""],["Awad","Petra",""],["Peletier","Reynier F.",""],["Smith","Rory",""],["Kuchner","Ulrike",""],["van de Weygaert","Rien",""],["Libeskind","Noam I.",""],["Canducci","Marco",""],["Tino","Peter",""],["Bunte","Kerstin",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 15:53:37 GMT"}],"updateDate":"2024-07-04","timestamp":1720022017000,"abstract":"  Our objectives are to map the filamentary network around the Fornax-Eridanus\nComplex and probe the influence of the local environment on galaxy morphology.\nWe employ the novel machine-learning tool, 1-DREAM (1-Dimensional, Recovery,\nExtraction, and Analysis of Manifolds) to detect and model filaments around the\nFornax cluster. We then use the morphology-density relation of galaxies to\nexamine the variation in the galaxies' morphology with respect to their\ndistance from the central axis of the detected filaments. We detect 27\nfilaments that vary in length and galaxy-number density around the\nFornax-Eridanus Complex. These filaments showcase a variety of environments;\nsome filaments encompass groups/clusters, while others are only inhabited by\ngalaxies in pristine filamentary environments. We also reveal a well-known\nstructure -- the Fornax Wall, that passes through the Dorado group, Fornax\ncluster, and Eridanus supergroup. Regarding the morphology of galaxies, we find\nthat early-type galaxies (ETGs) populate high-density filaments and\nhigh-density regions of the Fornax Wall. Furthermore, the fraction of ETGs\ndecreases as the distance to the filament spine increases. Of the total galaxy\npopulation in filaments, ~7% are ETGs and ~24% are late-type galaxies (LTGs)\nlocated in pristine environments of filaments, while ~27% are ETGs and ~42% are\nLTGs in groups/clusters within filaments. This study reveals the Cosmic Web\naround the Fornax Cluster and asserts that filamentary environments are\nheterogeneous in nature. When investigating the role of the environment on\ngalaxy morphology, it is essential to consider both, the local number-density\nand a galaxy's proximity to the filament spine. Within this framework, we\nascribe the observed morphological segregation in the Fornax Wall to\npre-processing of galaxies within groups embedded in it.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}