{"id":"2407.05044","title":"Imaging magnetic spiral phases, skyrmion clusters, and skyrmion\n  displacements at the surface of bulk Cu$_2$OSeO$_3$","authors":"E. Marchiori, G. Romagnoli, L. Schneider, B. Gross, P. Sahafi, A.\n  Jordan, R. Budakian, P. R. Baral, A. Magrez, J. S. White, and M. Poggio","authorsParsed":[["Marchiori","E.",""],["Romagnoli","G.",""],["Schneider","L.",""],["Gross","B.",""],["Sahafi","P.",""],["Jordan","A.",""],["Budakian","R.",""],["Baral","P. R.",""],["Magrez","A.",""],["White","J. S.",""],["Poggio","M.",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 10:50:09 GMT"}],"updateDate":"2024-07-09","timestamp":1720263009000,"abstract":"  Surfaces -- by breaking bulk symmetries, introducing roughness, or hosting\ndefects -- can significantly influence magnetic order in magnetic materials.\nDetermining their effect on the complex nanometer-scale phases present in\ncertain non-centrosymmetric magnets is an outstanding problem requiring\nhigh-resolution magnetic microscopy. Here, we use scanning SQUID-on-tip\nmicroscopy to image the surface of bulk Cu$_2$OSeO$_3$ at low temperature and\nin a magnetic field applied along $\\left\\langle100\\right\\rangle$. Real-space\nmaps measured as a function of applied field reveal the microscopic structure\nof the magnetic phases and their transitions. In low applied field, we observe\na magnetic texture consistent with an in-plane stripe phase, pointing to the\nexistence of a distinct surface state. In the low-temperature skyrmion phase,\nthe surface is populated by clusters of disordered skyrmions, which emerge from\nrupturing domains of the tilted spiral phase. Furthermore, we displace\nindividual skyrmions from their pinning sites by applying an electric potential\nto the scanning probe, thereby demonstrating local skyrmion control at the\nsurface of a magnetoelectric insulator.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}