{"id":"2407.19613","title":"Causal effect estimation under network interference with mean-field\n  methods","authors":"Sohom Bhattacharya, Subhabrata Sen","authorsParsed":[["Bhattacharya","Sohom",""],["Sen","Subhabrata",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 23:57:11 GMT"}],"updateDate":"2024-07-30","timestamp":1722211031000,"abstract":"  We study causal effect estimation from observational data under interference.\nThe interference pattern is captured by an observed network. We adopt the chain\ngraph framework of Tchetgen Tchetgen et. al. (2021), which allows (i)\ninteraction among the outcomes of distinct study units connected along the\ngraph and (ii) long range interference, whereby the outcome of an unit may\ndepend on the treatments assigned to distant units connected along the\ninterference network. For ``mean-field\" interaction networks, we develop a new\nscalable iterative algorithm to estimate the causal effects. For gaussian\nweighted networks, we introduce a novel causal effect estimation algorithm\nbased on Approximate Message Passing (AMP). Our algorithms are provably\nconsistent under a ``high-temperature\" condition on the underlying model. We\nestimate the (unknown) parameters of the model from data using maximum\npseudo-likelihood and establish $\\sqrt{n}$-consistency of this estimator in all\nparameter regimes. Finally, we prove that the downstream estimators obtained by\nplugging in estimated parameters into the aforementioned algorithms are\nconsistent at high-temperature. Our methods can accommodate dense interactions\namong the study units -- a setting beyond reach using existing techniques. Our\nalgorithms originate from the study of variational inference approaches in\nhigh-dimensional statistics; overall, we demonstrate the usefulness of these\nideas in the context of causal effect estimation under interference.\n","subjects":["Mathematics/Statistics Theory","Mathematics/Probability","Statistics/Methodology","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}