{"id":"2407.05790","title":"Kinetic Interacting Particle Langevin Monte Carlo","authors":"Paul Felix Valsecchi Oliva and O. Deniz Akyildiz","authorsParsed":[["Oliva","Paul Felix Valsecchi",""],["Akyildiz","O. Deniz",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 09:52:46 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 17:23:39 GMT"}],"updateDate":"2024-09-05","timestamp":1720432366000,"abstract":"  This paper introduces and analyses interacting underdamped Langevin\nalgorithms, termed Kinetic Interacting Particle Langevin Monte Carlo (KIPLMC)\nmethods, for statistical inference in latent variable models. We propose a\ndiffusion process that evolves jointly in the space of parameters and latent\nvariables and exploit the fact that the stationary distribution of this\ndiffusion concentrates around the maximum marginal likelihood estimate of the\nparameters. We then provide two explicit discretisations of this diffusion as\npractical algorithms to estimate parameters of statistical models. For each\nalgorithm, we obtain nonasymptotic rates of convergence for the case where the\njoint log-likelihood is strongly concave with respect to latent variables and\nparameters. In particular, we provide convergence analysis for the diffusion\ntogether with the discretisation error, providing convergence rate estimates\nfor the algorithms in Wasserstein-2 distance. We achieve accelerated\nconvergence rates clearly demonstrating improvement in dimension dependence,\nsimilar to the underdamped samplers. To demonstrate the utility of the\nintroduced methodology, we provide numerical experiments that demonstrate the\neffectiveness of the proposed diffusion for statistical inference and the\nstability of the numerical integrators utilised for discretisation. Our setting\ncovers a broad number of applications, including unsupervised learning,\nstatistical inference, and inverse problems.\n","subjects":["Statistics/Computation","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}