{"id":"2407.11397","title":"Adaptive Event-triggered Control with Sampled Transmitted Output and\n  Controller Dynamics","authors":"Gewei Zuo, Lijun Zhu","authorsParsed":[["Zuo","Gewei",""],["Zhu","Lijun",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 05:32:23 GMT"}],"updateDate":"2024-07-17","timestamp":1721107943000,"abstract":"  The event-triggered control with intermittent output can reduce the\ncommunication burden between the controller and plant side over the network. It\nhas been exploited for adaptive output feedback control of uncertain nonlinear\nsystems in the literature, however the controller must partially reside at the\nplant side where the computation capacity is required. In this paper, all\ncontroller components are moved to the controller side and their dynamics use\nsampled states rather than continuous one with the benefit of directly\nestimating next triggering instance of some conditions and avoiding constantly\nchecking event condition at the controller side. However, these bring two major\nchallenges. First, the virtual input designed in the dynamic filtering\ntechnique for the stabilization is no longer differentiable. Second, the plant\noutput is sampled to transmit at plant side and sampled again at controller\nside to construct the controller, and the two asynchronous samplings make the\nanalysis more involving. This paper solves these two issues by introducing a\nnew state observer to simplify the adaptive law, a set of continuous companion\nvariables for stability analysis and a new lemma quantifying the error bound\nbetween actual output signal and sampled transmitted output.\n  It is theoretically guaranteed that all internal signals in the closed-loop\nsystem are semiglobally bounded and the output is practically stabilized to the\norigin. Finally, the numerical simulation illustrates the effectiveness of\nproposed scheme.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}