{"id":"2407.02454","title":"Learning tensor networks with tensor cross interpolation: new algorithms\n  and libraries","authors":"Yuriel N\\'u\\~nez Fern\\'andez, Marc K. Ritter, Matthieu Jeannin,\n  Jheng-Wei Li, Thomas Kloss, Thibaud Louvet, Satoshi Terasaki, Olivier\n  Parcollet, Jan von Delft, Hiroshi Shinaoka, Xavier Waintal","authorsParsed":[["Fernández","Yuriel Núñez",""],["Ritter","Marc K.",""],["Jeannin","Matthieu",""],["Li","Jheng-Wei",""],["Kloss","Thomas",""],["Louvet","Thibaud",""],["Terasaki","Satoshi",""],["Parcollet","Olivier",""],["von Delft","Jan",""],["Shinaoka","Hiroshi",""],["Waintal","Xavier",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 17:32:29 GMT"},{"version":"v2","created":"Thu, 4 Jul 2024 09:44:19 GMT"}],"updateDate":"2024-07-08","timestamp":1719941549000,"abstract":"  The tensor cross interpolation (TCI) algorithm is a rank-revealing algorithm\nfor decomposing low-rank, high-dimensional tensors into tensor trains/matrix\nproduct states (MPS). TCI learns a compact MPS representation of the entire\nobject from a tiny training data set. Once obtained, the large existing MPS\ntoolbox provides exponentially fast algorithms for performing a large set of\noperations. We discuss several improvements and variants of TCI. In particular,\nwe show that replacing the cross interpolation by the partially rank-revealing\nLU decomposition yields a more stable and more flexible algorithm than the\noriginal algorithm. We also present two open source libraries, xfac in\nPython/C++ and TensorCrossInterpolation.jl in Julia, that implement these\nimproved algorithms, and illustrate them on several applications. These include\nsign-problem-free integration in large dimension, the superhigh-resolution\nquantics representation of functions, the solution of partial differential\nequations, the superfast Fourier transform, the computation of partition\nfunctions, and the construction of matrix product operators.\n","subjects":["Physics/Computational Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}