{"id":"2407.17525","title":"Crescendo Beyond the Horizon: More Gravitational Waves from Domain Walls\n  Bounded by Inflated Cosmic Strings","authors":"Yunjia Bao, Keisuke Harigaya, Lian-Tao Wang","authorsParsed":[["Bao","Yunjia",""],["Harigaya","Keisuke",""],["Wang","Lian-Tao",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-26","timestamp":1721671200000,"abstract":"  Gravitational-wave (GW) signals offer a unique window into the dynamics of\nthe early universe. GWs may be generated by the topological defects produced in\nthe early universe, which contain information on the symmetry of UV physics. We\nconsider the case in which a two-step phase transition produces a network of\ndomain walls bounded by cosmic strings. Specifically, we focus on the case in\nwhich there is a hierarchy in the symmetry-breaking scales, and a period of\ninflation pushes the cosmic string generated in the first phase transition\noutside the horizon before the second phase transition. We show that the GW\nsignal from the evolution and collapse of this string-wall network has a unique\nspectrum, and the resulting signal strength can be sizeable. In particular,\ndepending on the model parameters, the resulting signal can show up in a broad\nrange of frequencies and can be discovered by a multitude of future probes,\nincluding the pulsar timing arrays and space- and ground-based GW\nobservatories. As an example that naturally gives rise to this scenario, we\npresent a model with the first phase transition followed by a brief period of\nthermal inflation driven by the field responsible for the second stage of\nsymmetry breaking. The model can be embedded into a supersymmetric setup, which\nprovides a natural realization of this scenario. In this case, the successful\ndetection of the peak of the GW spectrum probes the soft supersymmetry breaking\nscale and the wall tension.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"417WMPGYLeWaTiJoExeB_9KreP0BGbU1bzcNg37jEJ0","pdfSize":"2618451"}
