{"id":"2407.18289","title":"MARINE: A Computer Vision Model for Detecting Rare Predator-Prey\n  Interactions in Animal Videos","authors":"Zs\\'ofia Katona, Seyed Sahand Mohammadi Ziabari, Fatemeh Karimi\n  Nejadasl","authorsParsed":[["Katona","Zsófia",""],["Ziabari","Seyed Sahand Mohammadi",""],["Nejadasl","Fatemeh Karimi",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 15:18:28 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 06:53:43 GMT"}],"updateDate":"2024-08-06","timestamp":1721920708000,"abstract":"  Encounters between predator and prey play an essential role in ecosystems,\nbut their rarity makes them difficult to detect in video recordings. Although\nadvances in action recognition (AR) and temporal action detection (AD),\nespecially transformer-based models and vision foundation models, have achieved\nhigh performance on human action datasets, animal videos remain relatively\nunder-researched. This thesis addresses this gap by proposing the model MARINE,\nwhich utilizes motion-based frame selection designed for fast animal actions\nand DINOv2 feature extraction with a trainable classification head for action\nrecognition. MARINE outperforms VideoMAE in identifying predator attacks in\nvideos of fish, both on a small and specific coral reef dataset (81.53\\%\nagainst 52.64\\% accuracy), and on a subset of the more extensive Animal Kingdom\ndataset (94.86\\% against 83.14\\% accuracy). In a multi-label setting on a\nrepresentative sample of Animal Kingdom, MARINE achieves 23.79\\% mAP,\npositioning it mid-field among existing benchmarks. Furthermore, in an AD task\non the coral reef dataset, MARINE achieves 80.78\\% AP (against VideoMAE's\n34.89\\%) although at a lowered t-IoU threshold of 25\\%. Therefore, despite room\nfor improvement, MARINE offers an effective starter framework to apply to AR\nand AD tasks on animal recordings and thus contribute to the study of natural\necosystems.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"60AKNXGGxv_7ElTV2kWW5bQjQRrQdlIglMO7J8zvp88","pdfSize":"25569045"}
