{"id":"2407.20979","title":"Substrate stiffness modulates bacterial adhesion and diversity of\n  adherent phenotypes across growth stages","authors":"Ren\\'e Riedel, Garima Rani and Anupam Sengupta","authorsParsed":[["Riedel","René",""],["Rani","Garima",""],["Sengupta","Anupam",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 17:15:30 GMT"}],"updateDate":"2024-07-31","timestamp":1722359730000,"abstract":"  Surface-adhesion and stiffness of underlying substrates mediate geometry,\nmechanics and self-organization of bacterial colonies. Recent studies have\nqualitatively indicted that stiffness may impact bacterial attachment, yet the\nvariation of cell-to-surface adhesion with substrate stiffness remains to be\nquantified. Here, by developing a cell-level Force Distance Spectroscopy (FDS)\ntechnique based on Atomic Force Microscopy (AFM), we simultaneously quantify\nthe cell-surface adhesion alongside stiffness of the underlying substrates to\nreveal stiffness-dependent adhesion in phototrophic bacterium Chromatium\nokenii. As stiffness of the soft substrate, modelled via low-melting-point\n(LMP) agarose pad, was varied between 20 kPa and 120 kPa by changing agarose\nconcentrations, we observe a progressive increase of the mean adhesion force by\nover an order of magnitude, from 0.21 (+/-0.10) nN to 2.42 (+/-1.16) nN. In\ncontrast, passive polystyrene (PS) microparticles of comparable dimensions\nshowed no perceptible change in their surface adhesion. Furthermore, for\nEscherichia coli, the cell-surface adhesion varied between 0.29 (+/-0.17) nN to\n0.39 (+/-0.20) nN, showing a weak dependence on the substrate stiffness, thus\nsuggesting that the stiffness-modulated adhesion is a species-specific trait.\nFinally, by quantifying the adhesion of C. okenii populations across growth\nstages, we report an emergent co-existence of weak and strongly adherent\nsub-populations, demonstrating a diversification of adherent phenotypes over\ntime. Taken together, these findings suggest that bacteria, depending on the\nspecies and their physiological stage, actively modulate cell-to-surface\nadhesion in response to substrate stiffness, and leverage it as a functional\ntrait to modulate initial attachment and colonization on soft substrates during\nearly stages of biofilm development.\n","subjects":["Physics/Biological Physics","Condensed Matter/Soft Condensed Matter","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/"}