{"id":"2407.17449","title":"Looking at Model Debiasing through the Lens of Anomaly Detection","authors":"Vito Paolo Pastore, Massimiliano Ciranni, Davide Marinelli, Francesca\n  Odone, Vittorio Murino","authorsParsed":[["Pastore","Vito Paolo",""],["Ciranni","Massimiliano",""],["Marinelli","Davide",""],["Odone","Francesca",""],["Murino","Vittorio",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 17:30:21 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 15:33:00 GMT"}],"updateDate":"2024-07-26","timestamp":1721842221000,"abstract":"  It is widely recognized that deep neural networks are sensitive to bias in\nthe data. This means that during training these models are likely to learn\nspurious correlations between data and labels, resulting in limited\ngeneralization abilities and low performance. In this context, model debiasing\napproaches can be devised aiming at reducing the model's dependency on such\nunwanted correlations, either leveraging the knowledge of bias information or\nnot. In this work, we focus on the latter and more realistic scenario, showing\nthe importance of accurately predicting the bias-conflicting and bias-aligned\nsamples to obtain compelling performance in bias mitigation. On this ground, we\npropose to conceive the problem of model bias from an out-of-distribution\nperspective, introducing a new bias identification method based on anomaly\ndetection. We claim that when data is mostly biased, bias-conflicting samples\ncan be regarded as outliers with respect to the bias-aligned distribution in\nthe feature space of a biased model, thus allowing for precisely detecting them\nwith an anomaly detection method. Coupling the proposed bias identification\napproach with bias-conflicting data upsampling and augmentation in a two-step\nstrategy, we reach state-of-the-art performance on synthetic and real benchmark\ndatasets. Ultimately, our proposed approach shows that the data bias issue does\nnot necessarily require complex debiasing methods, given that an accurate bias\nidentification procedure is defined.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xic1iSzowWNnWg8wOktViskESi3sB_BTRsZe50wuAkw","pdfSize":"2066205"}
