{"id":"2407.15240","title":"BIGbench: A Unified Benchmark for Social Bias in Text-to-Image\n  Generative Models Based on Multi-modal LLM","authors":"Hanjun Luo, Haoyu Huang, Ziye Deng, Xuecheng Liu, Ruizhe Chen, Zuozhu\n  Liu","authorsParsed":[["Luo","Hanjun",""],["Huang","Haoyu",""],["Deng","Ziye",""],["Liu","Xuecheng",""],["Chen","Ruizhe",""],["Liu","Zuozhu",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 18:09:40 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 12:13:42 GMT"},{"version":"v3","created":"Fri, 16 Aug 2024 05:53:16 GMT"}],"updateDate":"2024-08-19","timestamp":1721585380000,"abstract":"  Text-to-Image (T2I) generative models are becoming increasingly crucial due\nto their ability to generate high-quality images, which also raises concerns\nabout the social biases in their outputs, especially in the human generation.\nSociological research has established systematic classifications of bias.\nHowever, existing bias research about T2I models conflates different types of\nbias, impeding methodological progress. In this paper, we introduce BIGbench, a\nunified benchmark for Biases of Image Generation, featuring a meticulously\ndesigned dataset. Unlike existing benchmarks, BIGbench classifies and evaluates\nbiases across four dimensions: manifestation of bias, visibility of bias,\nacquired attributes, and protected attributes, which ensures exceptional\naccuracy for analysis. Furthermore, BIGbench applies advanced multi-modal large\nlanguage models to achieve fully automated and highly accurate evaluations. We\napply BIGbench to evaluate eight representative general T2I models and three\ndebiased methods. Our human evaluation results underscore BIGbench's\neffectiveness in aligning images and identifying various biases. Besides, our\nstudy also reveal new research directions about biases, such as the effect of\ndistillation and irrelevant protected attributes. Our benchmark is openly\naccessible at https://github.com/BIGbench2024/BIGbench2024/ to ensure\nreproducibility.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}