{"id":"2407.19259","title":"Fine-Grained Scene Graph Generation via Sample-Level Bias Prediction","authors":"Yansheng Li, Tingzhu Wang, Kang Wu, Linlin Wang, Xin Guo, Wenbin Wang","authorsParsed":[["Li","Yansheng",""],["Wang","Tingzhu",""],["Wu","Kang",""],["Wang","Linlin",""],["Guo","Xin",""],["Wang","Wenbin",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 13:49:06 GMT"}],"updateDate":"2024-07-30","timestamp":1722088146000,"abstract":"  Scene Graph Generation (SGG) aims to explore the relationships between\nobjects in images and obtain scene summary graphs, thereby better serving\ndownstream tasks. However, the long-tailed problem has adversely affected the\nscene graph's quality. The predictions are dominated by coarse-grained\nrelationships, lacking more informative fine-grained ones. The union region of\none object pair (i.e., one sample) contains rich and dedicated contextual\ninformation, enabling the prediction of the sample-specific bias for refining\nthe original relationship prediction. Therefore, we propose a novel\nSample-Level Bias Prediction (SBP) method for fine-grained SGG (SBG). Firstly,\nwe train a classic SGG model and construct a correction bias set by calculating\nthe margin between the ground truth label and the predicted label with one\nclassic SGG model. Then, we devise a Bias-Oriented Generative Adversarial\nNetwork (BGAN) that learns to predict the constructed correction biases, which\ncan be utilized to correct the original predictions from coarse-grained\nrelationships to fine-grained ones. The extensive experimental results on VG,\nGQA, and VG-1800 datasets demonstrate that our SBG outperforms the\nstate-of-the-art methods in terms of Average@K across three mainstream SGG\nmodels: Motif, VCtree, and Transformer. Compared to dataset-level correction\nmethods on VG, SBG shows a significant average improvement of 5.6%, 3.9%, and\n3.2% on Average@K for tasks PredCls, SGCls, and SGDet, respectively. The code\nwill be available at https://github.com/Zhuzi24/SBG.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}