{"id":"2407.14926","title":"TraveLLM: Could you plan my new public transit route in face of a\n  network disruption?","authors":"Bowen Fang, Zixiao Yang, Shukai Wang, Xuan Di","authorsParsed":[["Fang","Bowen",""],["Yang","Zixiao",""],["Wang","Shukai",""],["Di","Xuan",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 16:25:34 GMT"}],"updateDate":"2024-07-23","timestamp":1721492734000,"abstract":"  Imagine there is a disruption in train 1 near Times Square metro station. You\ntry to find an alternative subway route to the JFK airport on Google Maps, but\nthe app fails to provide a suitable recommendation that takes into account the\ndisruption and your preferences to avoid crowded stations. We find that in many\nsuch situations, current navigation apps may fall short and fail to give a\nreasonable recommendation. To fill this gap, in this paper, we develop a\nprototype, TraveLLM, to plan routing of public transit in face of disruption\nthat relies on Large Language Models (LLMs). LLMs have shown remarkable\ncapabilities in reasoning and planning across various domains. Here we hope to\ninvestigate the potential of LLMs that lies in incorporating multi-modal\nuser-specific queries and constraints into public transit route\nrecommendations. Various test cases are designed under different scenarios,\nincluding varying weather conditions, emergency events, and the introduction of\nnew transportation services. We then compare the performance of\nstate-of-the-art LLMs, including GPT-4, Claude 3 and Gemini, in generating\naccurate routes. Our comparative analysis demonstrates the effectiveness of\nLLMs, particularly GPT-4 in providing navigation plans. Our findings hold the\npotential for LLMs to enhance existing navigation systems and provide a more\nflexible and intelligent method for addressing diverse user needs in face of\ndisruptions.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WvXkFdSjv5-LYRm71wNfwUBb12DI3E-agYf72fhp8To","pdfSize":"4189733","objectId":"0x00db730c1eda320f329a44eca9f381d8576010e8ecaf167804f33972079e3ae7","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
