{"id":"2407.04257","title":"Dependence of Virial Factors on Optical Spectral Properties of Active\n  Galactic Nuclei","authors":"Sen Yang, Pu Du, Jian-Min Wang","authorsParsed":[["Yang","Sen",""],["Du","Pu",""],["Wang","Jian-Min",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 05:02:29 GMT"}],"updateDate":"2024-07-08","timestamp":1720155749000,"abstract":"  Reverberation mapping (RM) has long been a powerful tool for measuring the\nmasses of supermassive black holes (SMBHs) at the centers of active galactic\nnuclei (AGNs), but the precision of these mass measurements depends on the\nso-called virial factors. It has been demonstrated that the virial factors\nexhibit significant diversity, spanning approximately 1-2 orders of magnitude\nacross different AGNs. However, the underlying physical drivers for the\ndiversity have not yet been finalized. Here, adopting the SMBH mass -- spheroid\nluminosity relations of inactive galaxies with different bulge classifications,\nwe calibrate the virial factors corresponding to the AGNs with pseudobulges\n(PB) and classical bulges (or elliptical hosts, CB) using the latest nearby RM\nsample. We investigate the correlations between virial factors and the AGN\nspectral properties, and find that for both PB and CB samples, the FWHM-based\nvirial factors exhibit significant anti-correlations with the emission-line\nwidths and profiles, while the $\\sigma_{\\rm line}$-based virial factors only\nshow moderate anti-correlations with line widths for PB. We attribute these\ncorrelations mainly to the inclination angle or opening angle of the broad-line\nregions. Moreover, we establish new relations to give more precise virial\nfactors and, in combination with the latest iron-corrected radius-luminosity\nrelation, develop tentatively new single-epoch estimators of SMBH masses, which\nenable more accurate measurements of SMBH masses in large AGN samples.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}