{"id":"2407.15039","title":"Electron energy-loss spectrum and exciton band structure of\n  ${\\mathrm{WSe}}_{2}$ monolayer studied by ab initio Bethe-Salpeter equation\n  calculations","authors":"Yun-Chen Shih, Fredrik Andreas Nilsson, Guang-Yu Guo","authorsParsed":[["Shih","Yun-Chen",""],["Nilsson","Fredrik Andreas",""],["Guo","Guang-Yu",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 03:00:47 GMT"}],"updateDate":"2024-07-23","timestamp":1721530847000,"abstract":"  Bounded excitons in transition metal dichalcogenides monolayers lead to\nnumerous opto-electronic applications, which require a detailed understanding\nof the exciton dynamics. The dynamical properties of excitons with finite\nmomentum transfer $\\textbf{Q}$ can be investigated experimentally using\nelectron energy-loss (EEL) spectroscopy. The EEL spectrum depends on the\nresponse function of the material which in turn is determined by the exciton\nenergies and eigenvectors in the exciton band structure. In this work, we\nutilize ab initio density-functional theory plus Bethe-Salpeter equation\n(DFT+BSE) approach to explore the exciton band structure and also\n$\\textbf{Q}$-resolved EEL spectrum in monolayer ${\\mathrm{WSe}}_{2}$. In\nparticular, we carefully examine the discrepancies and connections among the\nexisting EEL spectrum formulas for quasi-two-dimensional (2D) systems, and\nestablish a proper definition of the EEL spectrum, which is then used to\ncalculate the EEL spectra of monolayer ${\\mathrm{WSe}}_{2}$. We find that\nremarkably, the dispersion of the calculated lowest-energy EELS peaks for the\nin-plane momentum transfer follows almost precisely the non-parabolic upper\nband of the lowest bright A exciton, and also agrees well with the previous\nexperiment. Furthermore, we show that only the bright exciton with its electric\ndipole being parallel to the direction of the transfered momentum is excited,\ni.e., EEL spectroscopy selectively probes bright exciton bands. This explains\nwhy only the upper band of the A exciton, which is a longitudinal exciton with\nan in-plane dipole moment, was observed in the previous experiment. Our\nfindings will stimulate further EEL experiments to measure other branches of\nthe exciton band structure, such as the parabolic lower band of the A exciton,\nand hence will lead to a better understanding of the exciton dynamics in\nquasi-2D materials.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}