{"id":"2407.07732","title":"Text2VP: Generative AI for Visual Programming and Parametric Modeling","authors":"Guangxi Feng, Wei Yan","authorsParsed":[["Feng","Guangxi",""],["Yan","Wei",""]],"versions":[{"version":"v1","created":"Sun, 9 Jun 2024 02:22:20 GMT"}],"updateDate":"2024-07-11","timestamp":1717899740000,"abstract":"  The integration of generative artificial intelligence (AI) into architectural\ndesign has witnessed a significant evolution, marked by the recent advancements\nin AI to generate text, images, and 3D models. However, no models exist for\ntext-to-parametric models that are used in architectural design for generating\nvarious design options, including free-form designs, and optimizing the design\noptions. This study creates and investigates an innovative application of\ngenerative AI in parametric modeling by leveraging a customized Text-to-Visual\nProgramming (Text2VP) GPT derived from GPT-4. The primary focus is on\nautomating the generation of graph-based visual programming workflows,\nincluding parameters and the links among the parameters, through AI-generated\nscripts, accurately reflecting users' design intentions and allowing the users\nto change the parameter values interactively. The Text2VP GPT customization\nprocess utilizes detailed and complete documentation of the visual programming\nlanguage components, example-driven few-shot learning, and specific\ninstructional guides. Our testing demonstrates Text2VP's capability to generate\nworking parametric models. The paper also discusses the limitations of Text2VP;\nfor example, more complex parametric model generation introduces higher error\nrates. This research highlights the potential of generative AI in visual\nprogramming and parametric modeling and sets a foundation for future\nenhancements to handle more sophisticated and intricate modeling tasks\neffectively. The study aims to allow designers to create and change design\nmodels without significant effort in learning a specific programming language\nsuch as Grasshopper.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"O0kj5cTEeVEuFHDqLdEpX2fTF14ZZNl7xwV4OMCwlxk","pdfSize":"2139173"}
