{"id":"2407.00978","title":"Hybrid RAG-empowered Multi-modal LLM for Secure Healthcare Data\n  Management: A Diffusion-based Contract Theory Approach","authors":"Cheng Su, Jinbo Wen, Jiawen Kang, Yonghua Wang, Hudan Pan, and M.\n  Shamim Hossain","authorsParsed":[["Su","Cheng",""],["Wen","Jinbo",""],["Kang","Jiawen",""],["Wang","Yonghua",""],["Pan","Hudan",""],["Hossain","M. Shamim",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 05:28:40 GMT"}],"updateDate":"2024-07-02","timestamp":1719811720000,"abstract":"  Secure data management and effective data sharing have become paramount in\nthe rapidly evolving healthcare landscape. The advancement of generative\nartificial intelligence has positioned Multi-modal Large Language Models\n(MLLMs) as crucial tools for managing healthcare data. MLLMs can support\nmulti-modal inputs and generate diverse types of content by leveraging\nlarge-scale training on vast amounts of multi-modal data. However, critical\nchallenges persist in developing medical MLLMs, including healthcare data\nsecurity and freshness issues, affecting the output quality of MLLMs. In this\npaper, we propose a hybrid Retrieval-Augmented Generation (RAG)-empowered\nmedical MLLMs framework for healthcare data management. This framework\nleverages a hierarchical cross-chain architecture to facilitate secure data\ntraining. Moreover, it enhances the output quality of MLLMs through hybrid RAG,\nwhich employs multi-modal metrics to filter various unimodal RAG results and\nincorporates these retrieval results as additional inputs to MLLMs.\nAdditionally, we employ age of information to indirectly evaluate the data\nfreshness impact of MLLMs and utilize contract theory to incentivize healthcare\ndata holders to share fresh data, mitigating information asymmetry in data\nsharing. Finally, we utilize a generative diffusion model-based reinforcement\nlearning algorithm to identify the optimal contract for efficient data sharing.\nNumerical results demonstrate the effectiveness of the proposed schemes, which\nachieve secure and efficient healthcare data management.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}