{"id":"2407.19709","title":"The Family of LML Detectors and the Family of LAS Detectors for Massive\n  MIMO Communications","authors":"Yi Sun","authorsParsed":[["Sun","Yi",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 05:22:31 GMT"},{"version":"v2","created":"Sun, 4 Aug 2024 15:16:34 GMT"},{"version":"v3","created":"Thu, 29 Aug 2024 05:19:01 GMT"}],"updateDate":"2024-08-30","timestamp":1722230551000,"abstract":"  The family of local maximum likelihood (LML) detectors, including the global\nmaximum likelihood (GML) detector, and the family of likelihood ascent search\n(LAS) detectors are akin to each other and possess common properties\nsignificant in both theory and practical multi-input multi-output (MIMO)\ncommunications. It is proved that a large MIMO channel possesses the LML\ncharacteristic, implying and predicting that a local search detector with\nlikelihood ascent, like a wide-sense sequential LAS (WSLAS) detector, can\napproach the GML detection. By the replica method, the bit error rate (BER) of\nan LML detector in the large MIMO channel is obtained. The BER indicates that\nin the high signal-to-noise ratio (SNR) regime, both the LML and GML detectors\nachieve the AWGN channel performance when the channel load is as high as up to\n1.5086 bits/dimension with an equal-energy distribution, and the channel load\ncan be higher with an unequal-energy distribution. The analytical result is\nverified by simulation in the equal-energy distribution that the sequential LAS\n(SLAS) detector, a linear-complexity LML detector, can approach the BER of the\nNP-hard GML detector. The LML and LAS detectors in the two families are\nsuccessfully applied to symbol detection in massive antenna MIMO communications\nand demonstrate the performance near the GML detection. This book chapter\nreviews the LML and LAS detectors in a unified framework. The focus is on their\nformulation, relationships, properties, and GML performance in BER and spectral\nefficiency in large MIMO channels.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}