{"id":"2407.07734","title":"Precision Agriculture: Ultra-Compact Sensor and Reconfigurable Antenna\n  for Joint Sensing and Communication","authors":"Ali Raza, Rasool Keshavarz, Negin Shariati","authorsParsed":[["Raza","Ali",""],["Keshavarz","Rasool",""],["Shariati","Negin",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:06:00 GMT"},{"version":"v2","created":"Sun, 18 Aug 2024 10:02:02 GMT"}],"updateDate":"2024-08-20","timestamp":1720623960000,"abstract":"  In this paper, a joint sensing and communication system is presented for\nsmart agriculture. The system integrates an Ultra-compact Soil Moisture Sensor\n(UCSMS) for precise sensing, along with a Pattern Reconfigurable Antenna (PRA)\nfor efficient transmission of information to the base station. A multiturn\ncomplementary spiral resonator (MCSR) is etched onto the ground plane of a\nmicrostrip transmission line to achieve miniaturization. The UCSMS operates at\n180 MHz with a 3-turn complementary spiral resonator (3-CSR), at 102 MHz with a\n4- turn complementary spiral resonator (4-CSR), and at 86 MHz with a 5-turn\ncomplementary spiral resonator (5-CSR). Due to its low resonance frequency, the\nproposed UCSMS is insensitive to variations in the Volume Under Test (VUT) of\nsoil. A probe-fed circular patch antenna is designed in the Wireless Local Area\nNetwork (WLAN) band (2.45 GHz) with a maximum measured gain of 5.63 dBi.\nAdditionally, four varactor diodes are integrated across the slots on the\nbottom side of the substrate to achieve pattern reconfiguration. Six different\nradiation patterns have been achieved by using different bias conditions of the\ndiodes. In standby mode, PRA can serve as a means for Wireless Power Transfer\n(WPT) or Energy Harvesting (EH) to store power in a battery. This stored power\ncan then be utilized to bias the varactor diodes. The combination of UCSMS and\nPRA enables the realization of a joint sensing and communication system. The\nproposed system's planar and simple geometry, along with its high sensitivity\nof 2.05 %, makes it suitable for smart agriculture applications. Moreover, the\nsensor is adaptive and capable of measuring the permittivity of various\nMaterial Under Test (MUT) within the range of 1 to 23.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}