{"id":"2407.19130","title":"Panoramic single-pixel imaging with megapixel resolution based on\n  rotational subdivision","authors":"Huan Cui, Jie Cao, Haoyu Zhang, Chang Zhou, Haifeng Yao, Yingbo Wang,\n  and Qun Hao","authorsParsed":[["Cui","Huan",""],["Cao","Jie",""],["Zhang","Haoyu",""],["Zhou","Chang",""],["Yao","Haifeng",""],["Wang","Yingbo",""],["Hao","Qun",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 00:14:12 GMT"}],"updateDate":"2024-07-30","timestamp":1722039252000,"abstract":"  Single-pixel imaging (SPI) using a single-pixel detector is an unconventional\nimaging method, which has great application prospects in many fields to realize\nhigh-performance imaging. In especial, the recent proposed catadioptric\npanoramic ghost imaging (CPGI) extends the application potential of SPI to\nhigh-performance imaging at a wide field of view (FOV) with recent growing\ndemands. However, the resolution of CPGI is limited by hardware parameters of\nthe digital micromirror device (DMD), which may not meet ultrahigh-resolution\npanoramic imaging needs that require detailed information. Therefore, to\novercome the resolution limitation of CPGI, we propose a panoramic SPI based on\nrotational subdivision (RSPSI). The key of the proposed RSPSI is to obtain the\nentire panoramic scene by the rotation-scanning with a rotating mirror tilted\n45{\\deg}, so that one single pattern that only covers one sub-Fov with a small\nFOV can complete a uninterrupted modulation on the entire panoramic FOV during\na once-through pattern projection. Then, based on temporal resolution\nsubdivision, images sequence of sub-Fovs subdivided from the entire panoramic\nFOV can be reconstructed with pixels-level or even subpixels-level horizontal\nshifting adjacently. Experimental results using a proof-of-concept setup show\nthat the panoramic image can be obtained with 10428*543 of 5,662,404 pixels,\nwhich is more than 9.6 times higher than the resolution limit of the CPGI using\nthe same DMD. To our best knowledge, the RSPSI is the first to achieve a\nmegapixel resolution via SPI, which can provide potential applications in\nfields requiring the imaging with ultrahigh-resolution and wide FOV.\n","subjects":["Physics/Optics","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}