{"id":"2407.01573","title":"Model-Based Diffusion for Trajectory Optimization","authors":"Chaoyi Pan, Zeji Yi, Guanya Shi, Guannan Qu","authorsParsed":[["Pan","Chaoyi",""],["Yi","Zeji",""],["Shi","Guanya",""],["Qu","Guannan",""]],"versions":[{"version":"v1","created":"Tue, 28 May 2024 22:14:25 GMT"}],"updateDate":"2024-07-03","timestamp":1716934465000,"abstract":"  Recent advances in diffusion models have demonstrated their strong\ncapabilities in generating high-fidelity samples from complex distributions\nthrough an iterative refinement process. Despite the empirical success of\ndiffusion models in motion planning and control, the model-free nature of these\nmethods does not leverage readily available model information and limits their\ngeneralization to new scenarios beyond the training data (e.g., new robots with\ndifferent dynamics). In this work, we introduce Model-Based Diffusion (MBD), an\noptimization approach using the diffusion process to solve trajectory\noptimization (TO) problems without data. The key idea is to explicitly compute\nthe score function by leveraging the model information in TO problems, which is\nwhy we refer to our approach as model-based diffusion. Moreover, although MBD\ndoes not require external data, it can be naturally integrated with data of\ndiverse qualities to steer the diffusion process. We also reveal that MBD has\ninteresting connections to sampling-based optimization. Empirical evaluations\nshow that MBD outperforms state-of-the-art reinforcement learning and\nsampling-based TO methods in challenging contact-rich tasks. Additionally,\nMBD's ability to integrate with data enhances its versatility and practical\napplicability, even with imperfect and infeasible data (e.g., partial-state\ndemonstrations for high-dimensional humanoids), beyond the scope of standard\ndiffusion models.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}