{"id":"2407.00729","title":"Discovering one molecule out of a million: inverse design of molecular\n  hole transporting semiconductors tailored for perovskite solar cells","authors":"Jianchang Wu, Luca Torresi, ManMan Hu, Patrick Reiser, Jiyun Zhang,\n  Juan S. Rocha-Ortiz, Luyao Wang, Zhiqiang Xie, Kaicheng Zhang, Byung-wook\n  Park, Anastasia Barabash, Yicheng Zhao, Junsheng Luo, Yunuo Wang, Larry\n  L\\\"uer, Lin-Long Deng, Jens A. Hauch, Sang Il Seok, Pascal Friederich,\n  Christoph J. Brabec","authorsParsed":[["Wu","Jianchang",""],["Torresi","Luca",""],["Hu","ManMan",""],["Reiser","Patrick",""],["Zhang","Jiyun",""],["Rocha-Ortiz","Juan S.",""],["Wang","Luyao",""],["Xie","Zhiqiang",""],["Zhang","Kaicheng",""],["Park","Byung-wook",""],["Barabash","Anastasia",""],["Zhao","Yicheng",""],["Luo","Junsheng",""],["Wang","Yunuo",""],["Lüer","Larry",""],["Deng","Lin-Long",""],["Hauch","Jens A.",""],["Seok","Sang Il",""],["Friederich","Pascal",""],["Brabec","Christoph J.",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 15:37:13 GMT"}],"updateDate":"2024-07-02","timestamp":1719761833000,"abstract":"  The inverse design of tailored organic molecules for specific optoelectronic\ndevices of high complexity holds an enormous potential, but has not yet been\nrealized1,2. The complexity and literally infinite diversity of conjugated\nmolecular structures present both, an unprecedented opportunity for\ntechnological breakthroughs as well as an unseen optimization challenge.\nCurrent models rely on big data which do not exist for specialized research\nfilms. However, a hybrid computational and high throughput experimental\nscreening workflow allowed us to train predictive models with as little as 149\nmolecules. We demonstrate a unique closed-loop workflow combining high\nthroughput synthesis and Bayesian optimization that discovers new hole\ntransporting materials with tailored properties for solar cell applications. A\nseries of high-performance molecules were identified from minimal suggestions,\nachieving up to 26.23% (certified 25.88%) power conversion efficiency in\nperovskite solar cells. Our work paves the way for rapid, informed discovery in\nvast molecular libraries, revolutionizing material selection for complex\ndevices. We believe that our approach can be generalized to other emerging\nfields and indeed accelerate the development of optoelectronic semiconductor\ndevices in general.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BqN_UWloQ3bKZzBZxLzeuJWArGLBqnASwBUKVfk3y_Q","pdfSize":"2629492"}
