{"id":"2407.18910","title":"Do We Really Need Graph Convolution During Training? Light Post-Training\n  Graph-ODE for Efficient Recommendation","authors":"Weizhi Zhang, Liangwei Yang, Zihe Song, Henry Peng Zou, Ke Xu,\n  Liancheng Fang, Philip S. Yu","authorsParsed":[["Zhang","Weizhi",""],["Yang","Liangwei",""],["Song","Zihe",""],["Zou","Henry Peng",""],["Xu","Ke",""],["Fang","Liancheng",""],["Yu","Philip S.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:59:32 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 01:26:51 GMT"}],"updateDate":"2024-07-30","timestamp":1722016772000,"abstract":"  The efficiency and scalability of graph convolution networks (GCNs) in\ntraining recommender systems (RecSys) have been persistent concerns, hindering\ntheir deployment in real-world applications. This paper presents a critical\nexamination of the necessity of graph convolutions during the training phase\nand introduces an innovative alternative: the Light Post-Training Graph\nOrdinary-Differential-Equation (LightGODE). Our investigation reveals that the\nbenefits of GCNs are more pronounced during testing rather than training.\nMotivated by this, LightGODE utilizes a novel post-training graph convolution\nmethod that bypasses the computation-intensive message passing of GCNs and\nemploys a non-parametric continuous graph ordinary-differential-equation (ODE)\nto dynamically model node representations. This approach drastically reduces\ntraining time while achieving fine-grained post-training graph convolution to\navoid the distortion of the original training embedding space, termed the\nembedding discrepancy issue. We validate our model across several real-world\ndatasets of different scales, demonstrating that LightGODE not only outperforms\nGCN-based models in terms of efficiency and effectiveness but also\nsignificantly mitigates the embedding discrepancy commonly associated with\ndeeper graph convolution layers. Our LightGODE challenges the prevailing\nparadigms in RecSys training and suggests re-evaluating the role of graph\nconvolutions, potentially guiding future developments of efficient large-scale\ngraph-based RecSys.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}