{"id":"2407.05118","title":"SHINE: Saliency-aware HIerarchical NEgative Ranking for Compositional\n  Temporal Grounding","authors":"Zixu Cheng, Yujiang Pu, Shaogang Gong, Parisa Kordjamshidi, Yu Kong","authorsParsed":[["Cheng","Zixu",""],["Pu","Yujiang",""],["Gong","Shaogang",""],["Kordjamshidi","Parisa",""],["Kong","Yu",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 16:08:17 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 16:53:17 GMT"}],"updateDate":"2024-07-16","timestamp":1720282097000,"abstract":"  Temporal grounding, also known as video moment retrieval, aims at locating\nvideo segments corresponding to a given query sentence. The compositional\nnature of natural language enables the localization beyond predefined events,\nposing a certain challenge to the compositional generalizability of existing\nmethods. Recent studies establish the correspondence between videos and queries\nthrough a decompose-reconstruct manner to achieve compositional generalization.\nHowever, they only consider dominant primitives and build negative queries\nthrough random sampling and recombination, resulting in semantically\nimplausible negatives that hinder the models from learning rational\ncompositions. In addition, recent DETR-based methods still underperform in\ncompositional temporal grounding, showing irrational saliency responses when\ngiven negative queries that have subtle differences from positive queries. To\naddress these limitations, we first propose a large language model-driven\nmethod for negative query construction, utilizing GPT-3.5-Turbo to generate\nsemantically plausible hard negative queries. Subsequently, we introduce a\ncoarse-to-fine saliency ranking strategy, which encourages the model to learn\nthe multi-granularity semantic relationships between videos and hierarchical\nnegative queries to boost compositional generalization. Extensive experiments\non two challenging benchmarks validate the effectiveness and generalizability\nof our proposed method. Our code is available at\nhttps://github.com/zxccade/SHINE.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}