{"id":"2407.20538","title":"Dimeric Drug Polymeric Micelles with Acid-Active Tumor Targeting and\n  FRET-indicated Drug Release","authors":"Xing Guo, Lin Wang, Kayla Duval, Jing Fan, Shaobing Zhou, and Zi Chen","authorsParsed":[["Guo","Xing",""],["Wang","Lin",""],["Duval","Kayla",""],["Fan","Jing",""],["Zhou","Shaobing",""],["Chen","Zi",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 04:43:58 GMT"}],"updateDate":"2024-07-31","timestamp":1722314638000,"abstract":"  Trans-activating transcriptional activator (TAT), a cell-penetrating peptide,\nhas been extensively used for facilitating cellular uptake and nuclear\ntargeting of drug delivery systems. However, the positively charged TAT peptide\nusually strongly interacts with serum components and undergoes substantial\nphagocytosis by the reticuloendothelial system, causing a short blood\ncirculation in vivo. In this work, an acid-active tumor targeting nanoplatform\nDA-TAT-PECL was developed to effectively inhibit the nonspecific interactions\nof TAT in the bloodstream. 2,3-dimethylmaleic anhydride (DA) was first used to\nconvert the TAT amines to carboxylic acid, the resulting DA-TAT was further\nconjugated to get DA-TAT-PECL. After self-assembly into polymeric micelles,\nthey were capable of circulating in the physiological condition for a long time\nand promoting cell penetration upon accumulation at the tumor site and\nde-shielding the DA group. Moreover, camptothecin (CPT) was used as the\nanticancer drug and modified into a dimer (CPT)2-ss-Mal, in which two CPT\nmolecules were connected by a reduction-labile maleimide thioether bond. The\nFRET signal between CPT and maleimide thioether bond was monitored to visualize\nthe drug release process and effective targeted delivery of antitumor drugs was\ndemonstrated. This pH/reduction dual-responsive micelle system provides a new\nplatform for high fidelity cancer therapy.\n","subjects":["Quantitative Biology/Tissues and Organs","Quantitative Biology/Biomolecules","Quantitative Biology/Cell Behavior"],"license":"http://creativecommons.org/licenses/by/4.0/"}