{"id":"2407.13092","title":"CC-DCNet: Dynamic Convolutional Neural Network with Contrastive\n  Constraints for Identifying Lung Cancer Subtypes on Multi-modality Images","authors":"Yuan Jin, Gege Ma, Geng Chen, Tianling Lyu, Jan Egger, Junhui Lyu,\n  Shaoting Zhang, Wentao Zhu","authorsParsed":[["Jin","Yuan",""],["Ma","Gege",""],["Chen","Geng",""],["Lyu","Tianling",""],["Egger","Jan",""],["Lyu","Junhui",""],["Zhang","Shaoting",""],["Zhu","Wentao",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 01:42:00 GMT"}],"updateDate":"2024-07-19","timestamp":1721266920000,"abstract":"  The accurate diagnosis of pathological subtypes of lung cancer is of\nparamount importance for follow-up treatments and prognosis managements.\nAssessment methods utilizing deep learning technologies have introduced novel\napproaches for clinical diagnosis. However, the majority of existing models\nrely solely on single-modality image input, leading to limited diagnostic\naccuracy. To this end, we propose a novel deep learning network designed to\naccurately classify lung cancer subtype with multi-dimensional and\nmulti-modality images, i.e., CT and pathological images. The strength of the\nproposed model lies in its ability to dynamically process both paired\nCT-pathological image sets as well as independent CT image sets, and\nconsequently optimize the pathology-related feature extractions from CT images.\nThis adaptive learning approach enhances the flexibility in processing\nmulti-dimensional and multi-modality datasets and results in performance\nelevating in the model testing phase. We also develop a contrastive constraint\nmodule, which quantitatively maps the cross-modality associations through\nnetwork training, and thereby helps to explore the \"gold standard\" pathological\ninformation from the corresponding CT scans. To evaluate the effectiveness,\nadaptability, and generalization ability of our model, we conducted extensive\nexperiments on a large-scale multi-center dataset and compared our model with a\nseries of state-of-the-art classification models. The experimental results\ndemonstrated the superiority of our model for lung cancer subtype\nclassification, showcasing significant improvements in accuracy metrics such as\nACC, AUC, and F1-score.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}