{"id":"2407.15870","title":"CIC: Circular Image Compression","authors":"Honggui Li, Sinan Chen, Nahid Md Lokman Hossain, Maria Trocan, Beata\n  Mikovicova, Muhammad Fahimullah, Dimitri Galayko, Mohamad Sawan","authorsParsed":[["Li","Honggui",""],["Chen","Sinan",""],["Hossain","Nahid Md Lokman",""],["Trocan","Maria",""],["Mikovicova","Beata",""],["Fahimullah","Muhammad",""],["Galayko","Dimitri",""],["Sawan","Mohamad",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 13:53:51 GMT"}],"updateDate":"2024-07-24","timestamp":1721310831000,"abstract":"  Learned image compression (LIC) is currently the cutting-edge method.\nHowever, the inherent difference between testing and training images of LIC\nresults in performance degradation to some extent. Especially for\nout-of-sample, out-of-distribution, or out-of-domain testing images, the\nperformance of LIC dramatically degraded. Classical LIC is a serial image\ncompression (SIC) approach that utilizes an open-loop architecture with serial\nencoding and decoding units. Nevertheless, according to the theory of automatic\ncontrol, a closed-loop architecture holds the potential to improve the dynamic\nand static performance of LIC. Therefore, a circular image compression (CIC)\napproach with closed-loop encoding and decoding elements is proposed to\nminimize the gap between testing and training images and upgrade the capability\nof LIC. The proposed CIC establishes a nonlinear loop equation and proves that\nsteady-state error between reconstructed and original images is close to zero\nby Talor series expansion. The proposed CIC method possesses the property of\nPost-Training and plug-and-play which can be built on any existing advanced SIC\nmethods. Experimental results on five public image compression datasets\ndemonstrate that the proposed CIC outperforms five open-source state-of-the-art\ncompeting SIC algorithms in reconstruction capacity. Experimental results\nfurther show that the proposed method is suitable for out-of-sample testing\nimages with dark backgrounds, sharp edges, high contrast, grid shapes, or\ncomplex patterns.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wBzVDG_LfGSICx3WkmH_H_WyVf64d-rCxzCnQGbyl8I","pdfSize":"1967676"}
