{"id":"2407.19069","title":"High-Tc superconducting dome in artificial heterostructures made of\n  nanoscale quantum building blocks","authors":"Antonio Valletta, Antonio Bianconi, Andrea Perali, Gennady Logvenov,\n  Gaetano Campi","authorsParsed":[["Valletta","Antonio",""],["Bianconi","Antonio",""],["Perali","Andrea",""],["Logvenov","Gennady",""],["Campi","Gaetano",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 20:36:02 GMT"}],"updateDate":"2024-07-30","timestamp":1721766962000,"abstract":"  While the search of high Tc superconductivity was driven mostly by trial and\nerror methodology searching for novel materials, here we provide a\nquasi-first-principle quantum theory for engineering superconductivity in\nartificial high-Tc superlattices (AHTS) with period d, ranging from 5.28 down\nto 3 nanometers, made of superconducting quantum wells of variable thickness L.\nAn important feature of our quantum design is the key role of the interface\ninternal electric field giving Rashba spin-orbit coupling (SOC) in the\nnanoscale quantum superconducting building blocks. By tuning the geometrical\nconformational parameter L/d around its magic ratio 2/3 we predict the\nsuperconducting dome of Tc versus doping characteristic of unconventional\nsuperconductors. Quantum size effects, controlled by L/d, change the energy\nwidth and splitting of two quantum subbands formed by the electronic space\ncharge confined in superconducting nano-layers. The theoretical superconducting\ndome Tc versus charge density controlled by the Fano-Feshbach resonance between\ntwo superconducting gaps has been able to predict experimental results on\ncuprate AHTS by tuning the geometry of superlattices of quantum wells made of\nsuperconducting layers (S) of thickness L of modulation doped stoichiometric\nMott insulator La2CuO4 with no chemical dopants, with interface space charge\nconfined within normal metal (N) overdoped cuprate layers\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}