{"id":"2407.06826","title":"VRDSynth: Synthesizing Programs for Multilingual Visually Rich Document\n  Information Extraction","authors":"Thanh-Dat Nguyen, Tung Do-Viet, Hung Nguyen-Duy, Tuan-Hai Luu, Hung\n  Le, Bach Le, and Patanamon (Pick) Thongtanunam","authorsParsed":[["Nguyen","Thanh-Dat","","Pick"],["Do-Viet","Tung","","Pick"],["Nguyen-Duy","Hung","","Pick"],["Luu","Tuan-Hai","","Pick"],["Le","Hung","","Pick"],["Le","Bach","","Pick"],["Patanamon","","","Pick"],["Thongtanunam","",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 12:59:58 GMT"}],"updateDate":"2024-07-10","timestamp":1720529998000,"abstract":"  Businesses need to query visually rich documents (VRDs) like receipts,\nmedical records, and insurance forms to make decisions. Existing techniques for\nextracting entities from VRDs struggle with new layouts or require extensive\npre-training data. We introduce VRDSynth, a program synthesis method to\nautomatically extract entity relations from multilingual VRDs without\npre-training data. To capture the complexity of VRD domain, we design a\ndomain-specific language (DSL) to capture spatial and textual relations to\ndescribe the synthesized programs. Along with this, we also derive a new\nsynthesis algorithm utilizing frequent spatial relations, search space pruning,\nand a combination of positive, negative, and exclusive programs to improve\ncoverage.\n  We evaluate VRDSynth on the FUNSD and XFUND benchmarks for semantic entity\nlinking, consisting of 1,592 forms in 8 languages. VRDSynth outperforms\nstate-of-the-art pre-trained models (LayoutXLM, InfoXLMBase, and\nXLMRobertaBase) in 5, 6, and 7 out of 8 languages, respectively, improving the\nF1 score by 42% over LayoutXLM in English. To test the extensibility of the\nmodel, we further improve VRDSynth with automated table recognition, creating\nVRDSynth(Table), and compare it with extended versions of the pre-trained\nmodels, InfoXLM(Large) and XLMRoberta(Large). VRDSynth(Table) outperforms these\nbaselines in 4 out of 8 languages and in average F1 score. VRDSynth also\nsignificantly reduces memory footprint (1M and 380MB vs. 1.48GB and 3GB for\nLayoutXLM) while maintaining similar time efficiency.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}