{"id":"2407.21199","title":"A Survey on Exploratory Spatiotemporal Visual Analytics Approaches for\n  Climate Science","authors":"Abdullah-Al-Raihan Nayeem, Dongyun Han, Huikyo Lee, Donghoon Kim,\n  Daniel Feldman, William J. Tolone, Daniel Crichton, and Isaac Cho","authorsParsed":[["Nayeem","Abdullah-Al-Raihan",""],["Han","Dongyun",""],["Lee","Huikyo",""],["Kim","Donghoon",""],["Feldman","Daniel",""],["Tolone","William J.",""],["Crichton","Daniel",""],["Cho","Isaac",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 21:23:14 GMT"}],"updateDate":"2024-08-01","timestamp":1722374594000,"abstract":"  Climate science produces a wealth of complex, high-dimensional, multivariate\ndata from observations and numerical models. These data are critical for\nunderstanding climate changes and their socioeconomic impacts. Climate\nscientists are continuously evaluating output from numerical models against\nobservations. This model evaluation process provides useful guidance to improve\nthe numerical models and subsequent climate projections. Exploratory visual\nanalytics systems possess the potential to significantly reduce the burden on\nscientists for traditional spatiotemporal analyses. In addition, technology and\ninfrastructure advancements are further facilitating broader access to climate\ndata. Climate scientists today can access climate data in distributed analytic\nenvironments and render exploratory visualizations for analyses. Efforts are\nongoing to optimize the computational efficiency of spatiotemporal analyses to\nenable efficient exploration of massive data. These advances present further\nopportunities for the visualization community to innovate over the full\nlandscape of challenges and requirements raised by scientists. In this report,\nwe provide a comprehensive review of the challenges, requirements, and current\napproaches for exploratory spatiotemporal visual analytics solutions for\nclimate data. We categorize the visual analytic techniques, systems, and tools\npresented in the relevant literature based on task requirements, data sources,\nstatistical techniques, interaction methods, visualization techniques,\nperformance evaluation methods, and application domains. Moreover, our analytic\nreview identifies trends, limitations, and key challenges in visual analysis.\nThis report will advance future research activities in climate visualizations\nand enables the end-users of climate data to identify effective climate change\nmitigation strategies.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Lw9E_Yv36D9zFinKiWWmlfqQMUDSs4dillYoTMGDdfY","pdfSize":"9989339"}
