{"id":"2407.14807","title":"Spatial distribution of isotopes and compositional mixing in the inner\n  protoplanetary disk","authors":"Kang Shuai, Hejiu Hui, Li-Yong Zhou, Weiqiang Li","authorsParsed":[["Shuai","Kang",""],["Hui","Hejiu",""],["Zhou","Li-Yong",""],["Li","Weiqiang",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 08:36:17 GMT"}],"updateDate":"2024-07-23","timestamp":1721464577000,"abstract":"  The mass-independent isotopic signatures of planetary bodies have been widely\nused to trace the mixing and transport processes in planet formation. The\nobserved isotopic variations among meteorites have been further linked to the\nmodeled mass-weighted mean initial semimajor axes, assuming a spatial isotopic\ngradient in the inner protoplanetary disk. However, nucleosynthetic isotopic\nanomalies of nonvolatile elements and mass-independent oxygen isotopic\nvariation ($\\Delta ^{17}$O) show different relationships with distance from the\nSun. Therefore, it is crucial to know whether isotopes were distributed\nsystematically with heliocentric distance. In this study, we performed N-body\nsimulations on compositional mixing during the collisional accretion and\nmigration of planetary bodies to investigate the spatial distributions of Cr\nand O isotopes in the inner protoplanetary disk. The modeled mass-weighted mean\ninitial semimajor axes of the parent bodies of noncarbonaceous (NC) meteorites\nand terrestrial planets were used to calculate the isotopic compositions of\nthese bodies. Our simulations successfully reproduced the observed\nnucleosynthetic Cr isotopic anomaly among Earth, Mars, and the NC meteorite\nparent bodies, consistent with a spatial gradient of isotopic anomalies in the\ninner disk. Asteroids originating from different regions in the inner disk were\ntransported to the main belt in our simulations, resulting in the Cr isotopic\nanomaly variation of the NC meteorite parent bodies. However, the $\\Delta\n^{17}$O distribution among the terrestrial planets and the NC meteorite parent\nbodies could not be reproduced assuming a $\\Delta ^{17}$O gradient. The absence\nof a $\\Delta ^{17}$O gradient reflects that the oxygen isotopic\nmass-independent fractionation might have altered the spatial distribution of\nthe nucleosynthetic $\\Delta ^{17}$O variation before protoplanets formed.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}