{"id":"2407.10976","title":"Learning Cellular Network Connection Quality with Conformal","authors":"Hanyang Jiang, Elizabeth Belding, Ellen Zegure, Yao Xie","authorsParsed":[["Jiang","Hanyang",""],["Belding","Elizabeth",""],["Zegure","Ellen",""],["Xie","Yao",""]],"versions":[{"version":"v1","created":"Tue, 4 Jun 2024 19:33:00 GMT"}],"updateDate":"2024-07-17","timestamp":1717529580000,"abstract":"  In this paper, we address the problem of uncertainty quantification for\ncellular network speed. It is a well-known fact that the actual internet speed\nexperienced by a mobile phone can fluctuate significantly, even when remaining\nin a single location. This high degree of variability underscores that mere\npoint estimation of network speed is insufficient. Rather, it is advantageous\nto establish a prediction interval that can encompass the expected range of\nspeed variations. In order to build an accurate network estimation map,\nnumerous mobile data need to be collected at different locations. Currently,\npublic datasets rely on users to upload data through apps. Although massive\ndata has been collected, the datasets suffer from significant noise due to the\nnature of cellular networks and various other factors. Additionally, the uneven\ndistribution of population density affects the spatial consistency of data\ncollection, leading to substantial uncertainty in the network quality maps\nderived from this data. We focus our analysis on large-scale internet-quality\ndatasets provided by Ookla to construct an estimated map of connection quality.\nTo improve the reliability of this map, we introduce a novel conformal\nprediction technique to build an uncertainty map. We identify regions with\nheightened uncertainty to prioritize targeted, manual data collection. In\naddition, the uncertainty map quantifies how reliable the prediction is in\ndifferent areas. Our method also leads to a sampling strategy that guides\nresearchers to selectively gather high-quality data that best complement the\ncurrent dataset to improve the overall accuracy of the prediction model.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}