{"id":"2407.08431","title":"Pushing high angular resolution and high contrast observations on the\n  VLTI from Y to L band with the Asgard instrumental suite: integration status\n  and plans","authors":"Marc-Antoine Martinod, Denis Defr\\`ere, Michael J. Ireland, Stefan\n  Kraus, Frantz Martinache, Peter G. Tuthill, Fatm\\'e Allouche, Emilie\n  Bouzerand, Julia Bryant, Josh Carter, Sorabh Chhabra, Benjamin\n  Courtney-Barrer, Fred Crous, Nick Cvetojevic, Colin Dandumont, Steve Ertel,\n  Tyler Gardner, Germain Garreau, Adrian M. Glauser, Xavier Haubois, Lucas\n  Labadie, St\\'ephane Lagarde, Daniel Lancaster, Romain Laugier, Alexandra\n  Mazzoli, Anthony Meilland, Kwinten Missiaen, S\\'ebastien Morel, Daniel J.\n  Mortimer, Barnaby Norris, Jyotirmay Paul, Gert Raskin, Sylvie Robbe-Dubois,\n  J. Gordon Robertson, Ahmed Sanny, Nicolas Schuhler, Owain Snaith, Adam Taras","authorsParsed":[["Martinod","Marc-Antoine",""],["Defrère","Denis",""],["Ireland","Michael J.",""],["Kraus","Stefan",""],["Martinache","Frantz",""],["Tuthill","Peter G.",""],["Allouche","Fatmé",""],["Bouzerand","Emilie",""],["Bryant","Julia",""],["Carter","Josh",""],["Chhabra","Sorabh",""],["Courtney-Barrer","Benjamin",""],["Crous","Fred",""],["Cvetojevic","Nick",""],["Dandumont","Colin",""],["Ertel","Steve",""],["Gardner","Tyler",""],["Garreau","Germain",""],["Glauser","Adrian M.",""],["Haubois","Xavier",""],["Labadie","Lucas",""],["Lagarde","Stéphane",""],["Lancaster","Daniel",""],["Laugier","Romain",""],["Mazzoli","Alexandra",""],["Meilland","Anthony",""],["Missiaen","Kwinten",""],["Morel","Sébastien",""],["Mortimer","Daniel J.",""],["Norris","Barnaby",""],["Paul","Jyotirmay",""],["Raskin","Gert",""],["Robbe-Dubois","Sylvie",""],["Robertson","J. Gordon",""],["Sanny","Ahmed",""],["Schuhler","Nicolas",""],["Snaith","Owain",""],["Taras","Adam",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 12:12:55 GMT"}],"updateDate":"2024-07-12","timestamp":1720699975000,"abstract":"  ESO's Very Large Telescope Interferometer has a history of record-breaking\ndiscoveries in astrophysics and significant advances in instrumentation. The\nnext leap forward is its new visitor instrument, called Asgard. It comprises\nfour natively collaborating instruments: HEIMDALLR, an instrument performing\nboth fringe tracking and stellar interferometry simultaneously with the same\noptics, operating in the K band; Baldr, a Strehl optimizer in the H band;\nBIFROST, a spectroscopic combiner to study the formation processes and\nproperties of stellar and planetary systems in the Y-J-H bands; and NOTT, a\nnulling interferometer dedicated to imaging nearby young planetary systems in\nthe L band. The suite is in its integration phase in Europe and should be\nshipped to Paranal in 2025. In this article, we present details of the\nalignment and calibration unit, the observing modes, the integration plan, the\nsoftware architecture, and the roadmap to completion of the project.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}