{"id":"2407.08575","title":"Vision and Tactile Robotic System to Grasp Litter in Outdoor\n  Environments","authors":"Ignacio de Loyola P\\'aez-Ubieta, Julio Casta\\~no-Amor\\'os, Santiago T.\n  Puente and Pablo Gil","authorsParsed":[["Páez-Ubieta","Ignacio de Loyola",""],["Castaño-Amorós","Julio",""],["Puente","Santiago T.",""],["Gil","Pablo",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 15:01:38 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 06:32:57 GMT"},{"version":"v3","created":"Mon, 15 Jul 2024 05:55:28 GMT"},{"version":"v4","created":"Tue, 16 Jul 2024 06:23:51 GMT"}],"updateDate":"2024-07-17","timestamp":1720710098000,"abstract":"  The accumulation of litter is increasing in many places and is consequently\nbecoming a problem that must be dealt with. In this paper, we present a\nmanipulator robotic system to collect litter in outdoor environments. This\nsystem has three functionalities. Firstly, it uses colour images to detect and\nrecognise litter comprising different materials. Secondly, depth data are\ncombined with pixels of waste objects to compute a 3D location and segment\nthree-dimensional point clouds of the litter items in the scene. The grasp in 3\nDegrees of Freedom (DoFs) is then estimated for a robot arm with a gripper for\nthe segmented cloud of each instance of waste. Finally, two tactile-based\nalgorithms are implemented and then employed in order to provide the gripper\nwith a sense of touch. This work uses two low-cost visual-based tactile sensors\nat the fingertips. One of them addresses the detection of contact (which is\nobtained from tactile images) between the gripper and solid waste, while\nanother has been designed to detect slippage in order to prevent the objects\ngrasped from falling. Our proposal was successfully tested by carrying out\nextensive experimentation with different objects varying in size, texture,\ngeometry and materials in different outdoor environments (a tiled pavement, a\nsurface of stone/soil, and grass). Our system achieved an average score of 94%\nfor the detection and Collection Success Rate (CSR) as regards its overall\nperformance, and of 80% for the collection of items of litter at the first\nattempt.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"x2O4_hlYIGGnk8KlqDdiDS5dUugi6r9La5sPEjGWi3o","pdfSize":"50566564"}
