{"id":"2407.21253","title":"An overview of methods for receiver operating characteristic analysis,\n  with an application to SARS-CoV-2 vaccine-induced humoral responses in solid\n  organ transplant recipients","authors":"Nathaniel P. Dowd, Bryan Blette, James D. Chappell, Natasha B. Halasa,\n  Andrew J. Spieker","authorsParsed":[["Dowd","Nathaniel P.",""],["Blette","Bryan",""],["Chappell","James D.",""],["Halasa","Natasha B.",""],["Spieker","Andrew J.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 00:24:58 GMT"}],"updateDate":"2024-08-01","timestamp":1722385498000,"abstract":"  Receiver operating characteristic (ROC) analysis is a tool to evaluate the\ncapacity of a numeric measure to distinguish between groups, often employed in\nthe evaluation of diagnostic tests. Overall classification ability is sometimes\ncrudely summarized by a single numeric measure such as the area under the\nempirical ROC curve. However, it may also be of interest to estimate the full\nROC curve while leveraging assumptions regarding the nature of the data\n(parametric) or about the ROC curve directly (semiparametric). Although there\nhas been recent interest in methods to conduct comparisons by way of stochastic\nordering, nuances surrounding ROC geometry and estimation are not widely known\nin the broader scientific and statistical community. The overarching goals of\nthis manuscript are to (1) provide an overview of existing frameworks for ROC\ncurve estimation with examples, (2) offer intuition for and considerations\nregarding methodological trade-offs, and (3) supply sample R code to guide\nimplementation. We utilize simulations to demonstrate the bias-variance\ntrade-off across various methods. As an illustrative example, we analyze data\nfrom a recent cohort study in order to compare responses to SARS-CoV-2\nvaccination between solid organ transplant recipients and healthy controls.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hyZ6HaOwn_M8RaEZCbOb8ahJz1RNPHjEYiac2MUXWFA","pdfSize":"929530"}
