{"id":"2407.09103","title":"DANIEL: A fast Document Attention Network for Information Extraction and\n  Labelling of handwritten documents","authors":"Thomas Constum, Pierrick Tranouez, Thierry Paquet","authorsParsed":[["Constum","Thomas",""],["Tranouez","Pierrick",""],["Paquet","Thierry",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 09:09:56 GMT"}],"updateDate":"2024-07-15","timestamp":1720775396000,"abstract":"  Information extraction from handwritten documents involves traditionally\nthree distinct steps: Document Layout Analysis, Handwritten Text Recognition,\nand Named Entity Recognition. Recent approaches have attempted to integrate\nthese steps into a single process using fully end-to-end architectures. Despite\nthis, these integrated approaches have not yet matched the performance of\nlanguage models, when applied to information extraction in plain text. In this\npaper, we introduce DANIEL (Document Attention Network for Information\nExtraction and Labelling), a fully end-to-end architecture integrating a\nlanguage model and designed for comprehensive handwritten document\nunderstanding. DANIEL performs layout recognition, handwriting recognition, and\nnamed entity recognition on full-page documents. Moreover, it can\nsimultaneously learn across multiple languages, layouts, and tasks. For named\nentity recognition, the ontology to be applied can be specified via the input\nprompt. The architecture employs a convolutional encoder capable of processing\nimages of any size without resizing, paired with an autoregressive decoder\nbased on a transformer-based language model. DANIEL achieves competitive\nresults on four datasets, including a new state-of-the-art performance on RIMES\n2009 and M-POPP for Handwriting Text Recognition, and IAM NER for Named Entity\nRecognition. Furthermore, DANIEL is much faster than existing approaches.\n  We provide the source code and the weights of the trained models at\n\\url{https://github.com/Shulk97/daniel}.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oq2PHVhn62J2doLW0j-nyqc-HuyIOBifMbjfttB9c34","pdfSize":"4167911"}
