{"id":"2407.06485","title":"CrowdTransfer: Enabling Crowd Knowledge Transfer in AIoT Community","authors":"Yan Liu and Bin Guo and Nuo Li and Yasan Ding and Zhouyangzi Zhang and\n  Zhiwen Yu","authorsParsed":[["Liu","Yan",""],["Guo","Bin",""],["Li","Nuo",""],["Ding","Yasan",""],["Zhang","Zhouyangzi",""],["Yu","Zhiwen",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 01:20:37 GMT"}],"updateDate":"2024-07-10","timestamp":1720488037000,"abstract":"  Artificial Intelligence of Things (AIoT) is an emerging frontier based on the\ndeep fusion of Internet of Things (IoT) and Artificial Intelligence (AI)\ntechnologies. Although advanced deep learning techniques enhance the efficient\ndata processing and intelligent analysis of complex IoT data, they still suffer\nfrom notable challenges when deployed to practical AIoT applications, such as\nconstrained resources, and diverse task requirements. Knowledge transfer is an\neffective method to enhance learning performance by avoiding the exorbitant\ncosts associated with data recollection and model retraining. Notably, although\nthere are already some valuable and impressive surveys on transfer learning,\nthese surveys introduce approaches in a relatively isolated way and lack the\nrecent advances of various knowledge transfer techniques for AIoT field. This\nsurvey endeavors to introduce a new concept of knowledge transfer, referred to\nas Crowd Knowledge Transfer (CrowdTransfer), which aims to transfer prior\nknowledge learned from a crowd of agents to reduce the training cost and as\nwell as improve the performance of the model in real-world complicated\nscenarios. Particularly, we present four transfer modes from the perspective of\ncrowd intelligence, including derivation, sharing, evolution and fusion modes.\nBuilding upon conventional transfer learning methods, we further delve into\nadvanced crowd knowledge transfer models from three perspectives for various\nAIoT applications. Furthermore, we explore some applications of AIoT areas,\nsuch as human activity recognition, urban computing, multi-robot system, and\nsmart factory. Finally, we discuss the open issues and outline future research\ndirections of knowledge transfer in AIoT community.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}