{"id":"2407.17989","title":"Energy Efficient Aerial RIS: Phase Shift Optimization and Trajectory\n  Design","authors":"Hajar El Hammouti, Adnane Saoud, Asma Ennahkami, El Houcine Bergou","authorsParsed":[["Hammouti","Hajar El",""],["Saoud","Adnane",""],["Ennahkami","Asma",""],["Bergou","El Houcine",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 12:28:15 GMT"}],"updateDate":"2024-07-26","timestamp":1721910495000,"abstract":"  Reconfigurable Intelligent Surface (RIS) technology has gained significant\nattention due to its ability to enhance the performance of wireless\ncommunication systems. The main advantage of RIS is that it can be\nstrategically placed in the environment to control wireless signals, enabling\nimprovements in coverage, capacity, and energy efficiency. In this paper, we\ninvestigate a scenario in which a drone, equipped with a RIS, travels from an\ninitial point to a target destination. In this scenario, the aerial RIS (ARIS)\nis deployed to establish a direct link between the base station and obstructed\nusers. Our objective is to maximize the energy efficiency of the ARIS while\ntaking into account its dynamic model including its velocity and acceleration\nalong with the phase shift of the RIS. To this end, we formulate the energy\nefficiency problem under the constraints of the dynamic model of the drone. The\nstudied problem is challenging to solve. To address this, we proceed as\nfollows. First, we introduce an efficient solution that involves decoupling the\nphase shift optimization and the trajectory design. Specifically, the\nclosed-form expression of the phase-shift is obtained using a convex\napproximation, which is subsequently integrated into the trajectory design\nproblem. We then employ tools inspired by economic model predictive control\n(EMPC) to solve the resulting trajectory optimization.\n  Our simulation results show a significant improvement in energy efficiency\nagainst the scenario where the dynamic model of the UAV is ignored.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}