{"id":"2407.05226","title":"The Emergent Aging Model: Aging as an Emergent Property of Biological\n  Systems","authors":"Hong Qin","authorsParsed":[["Qin","Hong",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 01:19:22 GMT"}],"updateDate":"2024-07-09","timestamp":1720315162000,"abstract":"  Based on the study of cellular aging using the single-cell model organism of\nbudding yeast and corroborated by other studies, we propose the Emergent Aging\nModel (EAM). EAM hypothesizes that aging is an emergent property of complex\nbiological systems, exemplified by biological networks such as gene networks.\nAn emergent property refers to traits that a system has at the system level but\nwhich its low-level components do not. EAM is based on a quantitative\ndefinition of aging using the mortality rate. A biological entity with a\nconstant mortality rate is considered non-aging which is equivalent to a\nfirst-order chemical reaction. Aging can be quantitatively defined as an\nincreasing mortality rate over time, corresponding to an organism's increasing\nchance of dying over time. EAM posits that biological aging can arise at the\nsystem level of an organism, even if the system is composed of only non-aging\ncomponents. EAM is consistent with the observation that aging is largely\nstochastic, influenced by numerous genes and epigenetic factors, with no single\ngene or factor known as the bona fide cause of aging. A parsimonious version of\nEAM can predict the Gompertz model of biological aging, the Strehler-Mildvan\ncorrelation, and the trade-off between initial reproductive fitness (asexual\nreproductive fitness) and late-life survival. EAM has been applied to\nexperimental results of the replicative lifespan of the budding yeast and can\npotentially offer new insights into the aging process of other biological\nspecies.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iBNjqnbO9CcPj_VjgC7Iv6_6yTyZpFMydABMAAT4tes","pdfSize":"609870"}
