{"id":"2407.19841","title":"RRAM-Based Bio-Inspired Circuits for Mobile Epileptic Correlation\n  Extraction and Seizure Prediction","authors":"Hao Wang, Lingfeng Zhang, Erjia Xiao, Xin Wang, Zhongrui Wang, Renjing\n  Xu","authorsParsed":[["Wang","Hao",""],["Zhang","Lingfeng",""],["Xiao","Erjia",""],["Wang","Xin",""],["Wang","Zhongrui",""],["Xu","Renjing",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 09:47:38 GMT"}],"updateDate":"2024-07-30","timestamp":1722246458000,"abstract":"  Non-invasive mobile electroencephalography (EEG) acquisition systems have\nbeen utilized for long-term monitoring of seizures, yet they suffer from\nlimited battery life. Resistive random access memory (RRAM) is widely used in\ncomputing-in-memory(CIM) systems, which offers an ideal platform for reducing\nthe computational energy consumption of seizure prediction algorithms,\npotentially solving the endurance issues of mobile EEG systems. To address this\nchallenge, inspired by neuronal mechanisms, we propose a RRAM-based\nbio-inspired circuit system for correlation feature extraction and seizure\nprediction. This system achieves a high average sensitivity of 91.2% and a low\nfalse positive rate per hour (FPR/h) of 0.11 on the CHB-MIT seizure dataset.\nThe chip under simulation demonstrates an area of approximately 0.83 mm2 and a\nlatency of 62.2 {\\mu}s. Power consumption is recorded at 24.4 mW during the\nfeature extraction phase and 19.01 mW in the seizure prediction phase, with a\ncumulative energy consumption of 1.515 {\\mu}J for a 3-second window data\nprocessing, predicting 29.2 minutes ahead. This method exhibits an 81.3%\nreduction in computational energy relative to the most efficient existing\nseizure prediction approaches, establishing a new benchmark for energy\nefficiency.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Hardware Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}