{"id":"2407.10546","title":"Laypeople's Egocentric Perceptions of Copyright for AI-Generated Art","authors":"Gabriel Lima, Nina Grgi\\'c-Hla\\v{c}a, Elissa Redmiles","authorsParsed":[["Lima","Gabriel",""],["Grgić-Hlača","Nina",""],["Redmiles","Elissa",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 08:53:43 GMT"}],"updateDate":"2024-07-16","timestamp":1721033623000,"abstract":"  Recent breakthroughs in generative AI (GenAI) have fueled debates concerning\nthe status of AI-generated creations under copyright law. This research\ninvestigates laypeople's perceptions ($N$ = 424) of AI-generated art concerning\nfactors associated with copyright protection. Inspired by prior work suggesting\nthat people show egocentric biases when evaluating their own creative outputs,\nwe also test if the same holds for AI-generated art. Namely, we study the\ndifferences between the perceptions of those who have something to gain from\ncopyright protection -- creators of AI-generated art -- and uninvested third\nparties.\n  To answer our research questions, we held an incentivized AI art competition,\nin which some participants used a GenAI model to generate images for\nconsideration while others evaluated these submissions. We find that\nparticipants are most likely to attribute authorship and copyright over\nAI-generated images to the users who prompted the AI system to generate the\nimage and the artists whose creations were used for training the AI model. We\nalso find that participants egocentrically favored their own art over other\nparticipants' art and rated their own creations higher than other people\nevaluated them. Moreover, our results suggest that people judge their own\nAI-generated art more favorably with respect to some factors (creativity and\neffort) but not others (skills). Our findings have implications for future\ndebates concerning the potential copyright protection of AI-generated outputs.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}