{"id":"2407.21052","title":"Table-Filling via Mean Teacher for Cross-domain Aspect Sentiment Triplet\n  Extraction","authors":"Kun Peng, Lei Jiang, Qian Li, Haoran Li, Xiaoyan Yu, Li Sun, Shuo Sun,\n  Yanxian Bi, Hao Peng","authorsParsed":[["Peng","Kun",""],["Jiang","Lei",""],["Li","Qian",""],["Li","Haoran",""],["Yu","Xiaoyan",""],["Sun","Li",""],["Sun","Shuo",""],["Bi","Yanxian",""],["Peng","Hao",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 09:04:08 GMT"}],"updateDate":"2024-08-01","timestamp":1721725448000,"abstract":"  Cross-domain Aspect Sentiment Triplet Extraction (ASTE) aims to extract\nfine-grained sentiment elements from target domain sentences by leveraging the\nknowledge acquired from the source domain. Due to the absence of labeled data\nin the target domain, recent studies tend to rely on pre-trained language\nmodels to generate large amounts of synthetic data for training purposes.\nHowever, these approaches entail additional computational costs associated with\nthe generation process. Different from them, we discover a striking resemblance\nbetween table-filling methods in ASTE and two-stage Object Detection (OD) in\ncomputer vision, which inspires us to revisit the cross-domain ASTE task and\napproach it from an OD standpoint. This allows the model to benefit from the OD\nextraction paradigm and region-level alignment. Building upon this premise, we\npropose a novel method named \\textbf{T}able-\\textbf{F}illing via \\textbf{M}ean\n\\textbf{T}eacher (TFMT). Specifically, the table-filling methods encode the\nsentence into a 2D table to detect word relations, while TFMT treats the table\nas a feature map and utilizes a region consistency to enhance the quality of\nthose generated pseudo labels. Additionally, considering the existence of the\ndomain gap, a cross-domain consistency based on Maximum Mean Discrepancy is\ndesigned to alleviate domain shift problems. Our method achieves\nstate-of-the-art performance with minimal parameters and computational costs,\nmaking it a strong baseline for cross-domain ASTE.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}