{"id":"2407.20083","title":"An Energy-based Model for Word-level AutoCompletion in Computer-aided\n  Translation","authors":"Cheng Yang, Guoping Huang, Mo Yu, Zhirui Zhang, Siheng Li, Mingming\n  Yang, Shuming Shi, Yujiu Yang, Lemao Liu","authorsParsed":[["Yang","Cheng",""],["Huang","Guoping",""],["Yu","Mo",""],["Zhang","Zhirui",""],["Li","Siheng",""],["Yang","Mingming",""],["Shi","Shuming",""],["Yang","Yujiu",""],["Liu","Lemao",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:07:19 GMT"}],"updateDate":"2024-07-30","timestamp":1722265639000,"abstract":"  Word-level AutoCompletion(WLAC) is a rewarding yet challenging task in\nComputer-aided Translation. Existing work addresses this task through a\nclassification model based on a neural network that maps the hidden vector of\nthe input context into its corresponding label (i.e., the candidate target word\nis treated as a label). Since the context hidden vector itself does not take\nthe label into account and it is projected to the label through a linear\nclassifier, the model can not sufficiently leverage valuable information from\nthe source sentence as verified in our experiments, which eventually hinders\nits overall performance. To alleviate this issue, this work proposes an\nenergy-based model for WLAC, which enables the context hidden vector to capture\ncrucial information from the source sentence. Unfortunately, training and\ninference suffer from efficiency and effectiveness challenges, thereby we\nemploy three simple yet effective strategies to put our model into practice.\nExperiments on four standard benchmarks demonstrate that our reranking-based\napproach achieves substantial improvements (about 6.07%) over the previous\nstate-of-the-art model. Further analyses show that each strategy of our\napproach contributes to the final performance.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"F2v-VCXmQZE0HEZa3POZXKo7y1B7pdJ6wYV3YJHZCRE","pdfSize":"970324","objectId":"0xa357c39f03f20323c08590ca1fe5318005c8590fbb4a520b68abd59a96bacfc0","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
