{"id":"2407.07059","title":"Differentiable Optimization of Similarity Scores Between Models and\n  Brains","authors":"Nathan Cloos, Moufan Li, Markus Siegel, Scott L. Brincat, Earl K.\n  Miller, Guangyu Robert Yang, Christopher J. Cueva","authorsParsed":[["Cloos","Nathan",""],["Li","Moufan",""],["Siegel","Markus",""],["Brincat","Scott L.",""],["Miller","Earl K.",""],["Yang","Guangyu Robert",""],["Cueva","Christopher J.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 17:31:47 GMT"}],"updateDate":"2024-07-10","timestamp":1720546307000,"abstract":"  What metrics should guide the development of more realistic models of the\nbrain? One proposal is to quantify the similarity between models and brains\nusing methods such as linear regression, Centered Kernel Alignment (CKA), and\nangular Procrustes distance. To better understand the limitations of these\nsimilarity measures we analyze neural activity recorded in five experiments on\nnonhuman primates, and optimize synthetic datasets to become more similar to\nthese neural recordings. How similar can these synthetic datasets be to neural\nactivity while failing to encode task relevant variables? We find that some\nmeasures like linear regression and CKA, differ from angular Procrustes, and\nyield high similarity scores even when task relevant variables cannot be\nlinearly decoded from the synthetic datasets. Synthetic datasets optimized to\nmaximize similarity scores initially learn the first principal component of the\ntarget dataset, but angular Procrustes captures higher variance dimensions much\nearlier than methods like linear regression and CKA. We show in both theory and\nsimulations how these scores change when different principal components are\nperturbed. And finally, we jointly optimize multiple similarity scores to find\ntheir allowed ranges, and show that a high angular Procrustes similarity, for\nexample, implies a high CKA score, but not the converse.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}