{"id":"2407.05749","title":"LDGCN: An Edge-End Lightweight Dual GCN Based on Single-Channel EEG for\n  Driver Drowsiness Monitoring","authors":"Jingwei Huang, Chuansheng Wang, Jiayan Huang, Haoyi Fan, Antoni Grau,\n  Fuquan Zhang","authorsParsed":[["Huang","Jingwei",""],["Wang","Chuansheng",""],["Huang","Jiayan",""],["Fan","Haoyi",""],["Grau","Antoni",""],["Zhang","Fuquan",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 08:55:25 GMT"}],"updateDate":"2024-07-09","timestamp":1720428925000,"abstract":"  Driver drowsiness electroencephalography (EEG) signal monitoring can timely\nalert drivers of their drowsiness status, thereby reducing the probability of\ntraffic accidents. Graph convolutional networks (GCNs) have shown significant\nadvancements in processing the non-stationary, time-varying, and non-Euclidean\nnature of EEG signals. However, the existing single-channel EEG adjacency graph\nconstruction process lacks interpretability, which hinders the ability of GCNs\nto effectively extract adjacency graph features, thus affecting the performance\nof drowsiness monitoring. To address this issue, we propose an edge-end\nlightweight dual graph convolutional network (LDGCN). Specifically, we are the\nfirst to incorporate neurophysiological knowledge to design a Baseline\nDrowsiness Status Adjacency Graph (BDSAG), which characterizes driver\ndrowsiness status. Additionally, to express more features within limited EEG\ndata, we introduce the Augmented Graph-level Module (AGM). This module captures\nglobal and local information at the graph level, ensuring that BDSAG features\nremain intact while enhancing effective feature expression capability.\nFurthermore, to deploy our method on the fourth-generation Raspberry Pi, we\nutilize Adaptive Pruning Optimization (APO) on both channels and neurons,\nreducing inference latency by almost half. Experiments on benchmark datasets\ndemonstrate that LDGCN offers the best trade-off between monitoring performance\nand hardware resource utilization compared to existing state-of-the-art\nalgorithms. All our source code can be found at\nhttps://github.com/BryantDom/Driver-Drowsiness-Monitoring.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}