{"id":"2407.07230","title":"Laboratory demonstration of an all-fiber-based focal plane nulling\n  interferometer","authors":"Jordan Diaz (1), Rebecca Jensen-Clem (1), Daren Dillon (1), Philip M.\n  Hinz (1), Matthew C. DeMartino (1), Kevin Bundy (1), Stephen Eikenberry (2),\n  Peter Delfyett (2), Rodrigo Amezcua-Correa (2) ((1) University of California\n  Santa Cruz, (2) Univeristy of Central Florida)","authorsParsed":[["Diaz","Jordan",""],["Jensen-Clem","Rebecca",""],["Dillon","Daren",""],["Hinz","Philip M.",""],["DeMartino","Matthew C.",""],["Bundy","Kevin",""],["Eikenberry","Stephen",""],["Delfyett","Peter",""],["Amezcua-Correa","Rodrigo",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 21:09:05 GMT"}],"updateDate":"2024-07-11","timestamp":1720559345000,"abstract":"  Starlight suppression techniques for High-Contrast Imaging (HCI) are crucial\nto achieving the demanding contrast ratios and inner working angles required\nfor detecting and characterizing exoplanets with a wide range of masses and\nseparations. The advent of photonic technologies provides new opportunities to\ncontrol the amplitude and phase characteristics of light, with the potential to\nenhance and control starlight suppression. Here, we present a focal plane\noptical-fiber-based nulling interferometer working with commercially available\ncomponents for amplitude and phase modulation. The instrument implements\nsingle-mode fiber-coupled elements: a MEMS variable optical attenuator (VOA)\nmatches the on-axis and off-axis starlight amplitude, while a\npiezoelectric-driven fiber stretcher modifies the optical path difference\nbetween the channels to achieve the $\\pi$ phase shift condition for destructive\ninterference. We show preliminary lab results using a narrowband light source\nworking at 632 nm and discuss future opportunities for testing on-sky with the\nAstrophotonics Advancement Platform at Lick Observatory (APALO) at the Shane\n3-m Telescope.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}