{"id":"2407.17459","title":"Hidden or Inferred: Fair Learning-To-Rank with Unknown Demographics","authors":"Oluseun Olulana, Kathleen Cachel, Fabricio Murai and Elke\n  Rundensteiner","authorsParsed":[["Olulana","Oluseun",""],["Cachel","Kathleen",""],["Murai","Fabricio",""],["Rundensteiner","Elke",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 17:54:07 GMT"}],"updateDate":"2024-07-25","timestamp":1721843647000,"abstract":"  As learning-to-rank models are increasingly deployed for decision-making in\nareas with profound life implications, the FairML community has been developing\nfair learning-to-rank (LTR) models. These models rely on the availability of\nsensitive demographic features such as race or sex. However, in practice,\nregulatory obstacles and privacy concerns protect this data from collection and\nuse. As a result, practitioners may either need to promote fairness despite the\nabsence of these features or turn to demographic inference tools to attempt to\ninfer them. Given that these tools are fallible, this paper aims to further\nunderstand how errors in demographic inference impact the fairness performance\nof popular fair LTR strategies. In which cases would it be better to keep such\ndemographic attributes hidden from models versus infer them? We examine a\nspectrum of fair LTR strategies ranging from fair LTR with and without\ndemographic features hidden versus inferred to fairness-unaware LTR followed by\nfair re-ranking. We conduct a controlled empirical investigation modeling\ndifferent levels of inference errors by systematically perturbing the inferred\nsensitive attribute. We also perform three case studies with real-world\ndatasets and popular open-source inference methods. Our findings reveal that as\ninference noise grows, LTR-based methods that incorporate fairness\nconsiderations into the learning process may increase bias. In contrast, fair\nre-ranking strategies are more robust to inference errors. All source code,\ndata, and experimental artifacts of our experimental study are available here:\nhttps://github.com/sewen007/hoiltr.git\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"iSMH0Uc5EKlBTrMt0SLaSPx67O1l2Z4cOKehplHPRSE","pdfSize":"9506423","objectId":"0x650283a9b14c427aed774d5adcf091841fdf3a96fec4574e177e8f0e0848d122","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
