{"id":"2407.00946","title":"Atomic cluster expansion interatomic potential for defects and\n  thermodynamics of Cu-W system","authors":"Jiahao Pan, Huiqun Cheng, Gaosheng Yan, Lei Zhang, Wenshan Yu,\n  Shengping Shen","authorsParsed":[["Pan","Jiahao",""],["Cheng","Huiqun",""],["Yan","Gaosheng",""],["Zhang","Lei",""],["Yu","Wenshan",""],["Shen","Shengping",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 03:59:39 GMT"}],"updateDate":"2024-07-02","timestamp":1719806379000,"abstract":"  The unique properties exhibited in immiscible metals, such as excellent\nstrength, hardness, and radiation-damage tolerance, have stimulated the\ninterest of many researchers. As a typical immiscible metal system, the Cu-W\nnano-multilayers combine the plasticity of copper and the strength of tungsten,\nmaking it a suitable candidate for applications in aerospace, nuclear fusion\nengineering, and electronic packaging etc. To understand the atomistic origin\nof the defects and thermodynamics of the Cu-W immiscible system, we have\ndeveloped an accurate machine learning interatomic potential (ML-IAP) for Cu-W\nbased on the atomic cluster expansion (ACE) method. The Cu-W ACE potential can\nfaithfully reproduce the fundamental properties of Cu and W predicted by\ndensity functional theory (DFT). Moreover, the thermodynamical properties, such\nas the melting point, coefficient of thermal expansion, diffusion coefficient,\nand equation of the state curve of the Cu-W solid solution, are calculated and\ncompared against DFT and experiments. Monte Carlo Molecular Dynamics (MC-MD)\nsimulations performed with the Cu-W ACE potential predict the experimentally\nobserved phase separation and uphill diffusion phenomena. Our findings not only\nprovide an accurate ACE potential for describing the Cu-W immiscible system,\nbut also shed light on understanding the atomistic mechanism during the Cu-W\nnano-multilayers formation process.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}