{"id":"2407.14141","title":"Structure preserving hybrid Finite Volume Finite Element method for\n  compressible MHD","authors":"Francesco Fambri and Eric Sonnendr\\\"ucker","authorsParsed":[["Fambri","Francesco",""],["Sonnendrücker","Eric",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 09:13:35 GMT"}],"updateDate":"2024-07-22","timestamp":1721380415000,"abstract":"  In this manuscript we present a novel and efficient numerical method for the\ncompressible viscous and resistive MHD equations for all Mach number regimes.\nThe time-integration strategy is a semi-implicit splitting, combined with a\nhybrid finite-volume and finite-element (FE) discretization in space. The\nnon-linear convection is solved by a robust explicit FV scheme, while the\nmagneto-acoustic terms are treated implicitly in time. The resulting CFL\nstability condition depends only on the fluid velocity, and not on the\nAlfv\\'enic and acoustic modes. The magneto-acoustic terms are discretized by\ncompatible FE based on a continuous and a discrete de Rham complexes designed\nusing Finite Element Exterior Calculus (FEEC). Thanks to the use of FEEC,\nenergy stability, magnetic-helicity conservation and the divergence-free\nconditions can be preserved also at the discrete level. A very efficient\nsplitting approach is used to separate the acoustic and the Alfv\\'enic modes in\nsuch a fashion that the original symmetries of the PDE governing equations are\npreserved. In this way, the algorithm relies on the solution of linear,\nsymmetric and positive-definite algebraic systems, that are very efficiently\nhandled by the simple matrix-free conjugate-gradient method. The resulting\nalgorithm showed to be robust and accurate in low and high Mach regimes even at\nlarge Courant numbers. Non-trivial tests are solved in one-, two- and three-\nspace dimensions to confirm the robustness, accuracy, and the low-dissipative\nand conserving properties of the final algorithm. While the formulation of the\nmethod is very general, numerical results for a second-order accurate FV-FE\nscheme will be presented.\n","subjects":["Mathematics/Numerical Analysis","Astrophysics/Instrumentation and Methods for Astrophysics","Computing Research Repository/Numerical Analysis","Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}