{"id":"2407.06674","title":"Almost-sure quasi-optimal approximation in reproducing kernel Hilbert\n  spaces","authors":"Philipp Trunschke, Anthony Nouy","authorsParsed":[["Trunschke","Philipp",""],["Nouy","Anthony",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 08:48:34 GMT"}],"updateDate":"2024-07-10","timestamp":1720514914000,"abstract":"  This manuscript addresses the problem of approximating an unknown function\nfrom point evaluations. When obtaining these point evaluations is costly,\nminimising the required sample size becomes crucial, and it is unreasonable to\nreserve a sufficiently large test sample for estimating the approximation\naccuracy. Therefore, an approximation with a certified quasi-optimality factor\nis required. This article shows that such an approximation can be obtained when\nthe sought function lies in a \\emph{reproducing kernel Hilbert space} (RKHS)\nand is to be approximated in a finite-dimensional linear subspace. However,\nselecting the sample points to minimise the quasi-optimality factor requires\noptimising over an infinite set of points and computing exact inner products in\nRKHS, which is often infeasible in practice. Extending results from optimal\nsampling for $L^2$ approximation, the present manuscript proves that random\npoints, drawn independently from the Christoffel sampling distribution\nassociated with $\\mcal{V}_d$, can yield a controllable quasi-optimality factor\nwith high probability. Inspired by this result, a novel sampling scheme, coined\nsubspace-informed volume sampling, is introduced and evaluated in numerical\nexperiments, where it outperforms classical i.i.d.\\ Christoffel sampling and\ncontinuous volume sampling. To reduce the size of such a random sample, an\nadditional greedy subsampling scheme with provable suboptimality bounds is\nintroduced. Our presentation is of independent interest to the community\nresearching the \\emph{parametrised background data weak} (PBDW) method, as it\noffers a simpler interpretation of the method.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}