{"id":"2407.03499","title":"An adaptive Newton-based free-boundary Grad-Shafranov solver","authors":"Daniel A. Serino, Qi Tang, Xian-Zhu Tang, Tzanio V. Kolev, Konstantin\n  Lipnikov","authorsParsed":[["Serino","Daniel A.",""],["Tang","Qi",""],["Tang","Xian-Zhu",""],["Kolev","Tzanio V.",""],["Lipnikov","Konstantin",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 20:56:58 GMT"}],"updateDate":"2024-07-08","timestamp":1720040218000,"abstract":"  Equilibriums in magnetic confinement devices result from force balancing\nbetween the Lorentz force and the plasma pressure gradient. In an axisymmetric\nconfiguration like a tokamak, such an equilibrium is described by an elliptic\nequation for the poloidal magnetic flux, commonly known as the Grad--Shafranov\nequation. It is challenging to develop a scalable and accurate free-boundary\nGrad--Shafranov solver, since it is a fully nonlinear optimization problem that\nsimultaneouly solves for the magnetic field coil current outside the plasma to\ncontrol the plasma shape. In this work, we develop a Newton-based free-boundary\nGrad--Shafranov solver using adaptive finite elements and preconditioning\nstrategies. The free-boundary interaction leads to the evaluation of a\ndomain-dependent nonlinear form of which its contribution to the Jacobian\nmatrix is achieved through shape calculus. The optimization problem aims to\nminimize the distance between the plasma boundary and specified control points\nwhile satisfying two non-trivial constraints, which correspond to the nonlinear\nfinite element discretization of the Grad--Shafranov equation and a constraint\non the total plasma current involving a nonlocal coupling term. The linear\nsystem is solved by a block factorization, and AMG is called for subblock\nelliptic operators. The unique contributions of this work include the treatment\nof a global constraint, preconditioning strategies, nonlocal reformulation, and\nthe implementation of adaptive finite elements. It is found that the resulting\nNewton solver is robust, successfully reducing the nonlinear residual to 1e-6\nand lower in a small handful of iterations while addressing the challenging\ncase to find a Taylor state equilibrium where conventional Picard-based solvers\nfail to converge.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"e2Q6bHJkeu_Jm3PxShh2fzrvz0_W-oRJxjAp1agkApA","pdfSize":"7644110"}
