{"id":"2407.14842","title":"Hydrodynamical simulations of wind interaction in spider systems : A\n  step toward understanding transitional millisecond pulsars","authors":"C. Guerra, Z. Meliani, G. Voisin","authorsParsed":[["Guerra","C.",""],["Meliani","Z.",""],["Voisin","G.",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 11:08:54 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 13:35:11 GMT"}],"updateDate":"2024-07-24","timestamp":1721473734000,"abstract":"  The detected population of \"spiders\" has significantly grown in the past\ndecade thanks to multiwavelength follow-up investigations of unidentified Fermi\nsources. These systems consist of low-mass stellar companions orbiting\nrotation-powered millisecond pulsars in short periods of a few hours up to day.\nAmong them, a subset of intriguing objects called transitional millisecond\npulsars (tMSPs) has been shown to exhibit a remarkable behavior, transitioning\nbetween pulsar-binary and faint low-mass X-ray binary states over a span of a\nfew years. Our objective is to study the interaction of stellar winds in tMSPs\nin order to understand their observational properties. To this end we focus on\nthe parameter range that places the system near Roche-lobe overflow. Employing\nthe adaptative mesh refinement (AMR) AMRVAC 2.0 code, we performed 2D\nhydrodynamical (HD) simulations of the interaction between the flows from both\nstars, accounting for the effects of gravity and orbital motion. By studying\nthe mass loss and launch speed of the winds, we successfully recreated two\nphenomenologically distinct regimes: the accretion stream and the radio pulsar\nstate. We also identified the tipping point that marks the sharp transition\nbetween these two states. In the pulsar state, we reconstructed the\ncorresponding X-ray light curves of the system that produces the characteristic\ndouble-peak pattern of these systems. The position of the peaks is shifted due\nto orbital motion and the leading peak is weaker due to eclipsing by the\ncompanion. We suggest that a smaller leading peak in X-rays is indicative of a\nnearly edge-on system. This study highlights the importance of gravity and\norbital motion in the interaction between the companion and pulsar winds. Our\nsetup allows the study of the complex interaction between the pulsar wind and\nan accretion stream during mass transfer.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}