{"id":"2407.08675","title":"CAD-Prompted Generative Models: A Pathway to Feasible and Novel\n  Engineering Designs","authors":"Leah Chong, Jude Rayan, Steven Dow, Ioanna Lykourentzou, Faez Ahmed","authorsParsed":[["Chong","Leah",""],["Rayan","Jude",""],["Dow","Steven",""],["Lykourentzou","Ioanna",""],["Ahmed","Faez",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:07:32 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 06:49:45 GMT"}],"updateDate":"2024-07-23","timestamp":1720717652000,"abstract":"  Text-to-image generative models have increasingly been used to assist\ndesigners during concept generation in various creative domains, such as\ngraphic design, user interface design, and fashion design. However, their\napplications in engineering design remain limited due to the models' challenges\nin generating images of feasible designs concepts. To address this issue, this\npaper introduces a method that improves the design feasibility by prompting the\ngeneration with feasible CAD images. In this work, the usefulness of this\nmethod is investigated through a case study with a bike design task using an\noff-the-shelf text-to-image model, Stable Diffusion 2.1. A diverse set of bike\ndesigns are produced in seven different generation settings with varying CAD\nimage prompting weights, and these designs are evaluated on their perceived\nfeasibility and novelty. Results demonstrate that the CAD image prompting\nsuccessfully helps text-to-image models like Stable Diffusion 2.1 create\nvisibly more feasible design images. While a general tradeoff is observed\nbetween feasibility and novelty, when the prompting weight is kept low around\n0.35, the design feasibility is significantly improved while its novelty\nremains on par with those generated by text prompts alone. The insights from\nthis case study offer some guidelines for selecting the appropriate CAD image\nprompting weight for different stages of the engineering design process. When\nutilized effectively, our CAD image prompting method opens doors to a wider\nrange of applications of text-to-image models in engineering design.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}