{"id":"2407.12697","title":"Calibrated Diverse Ensemble Entropy Minimization for Robust Test-Time\n  Adaptation in Prostate Cancer Detection","authors":"Mahdi Gilany, Mohamed Harmanani, Paul Wilson, Minh Nguyen Nhat To,\n  Amoon Jamzad, Fahimeh Fooladgar, Brian Wodlinger, Purang Abolmaesumi, Parvin\n  Mousavi","authorsParsed":[["Gilany","Mahdi",""],["Harmanani","Mohamed",""],["Wilson","Paul",""],["To","Minh Nguyen Nhat",""],["Jamzad","Amoon",""],["Fooladgar","Fahimeh",""],["Wodlinger","Brian",""],["Abolmaesumi","Purang",""],["Mousavi","Parvin",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 16:20:10 GMT"}],"updateDate":"2024-07-18","timestamp":1721233210000,"abstract":"  High resolution micro-ultrasound has demonstrated promise in real-time\nprostate cancer detection, with deep learning becoming a prominent tool for\nlearning complex tissue properties reflected on ultrasound. However, a\nsignificant roadblock to real-world deployment remains, which prior works often\noverlook: model performance suffers when applied to data from different\nclinical centers due to variations in data distribution. This distribution\nshift significantly impacts the model's robustness, posing major challenge to\nclinical deployment. Domain adaptation and specifically its test-time adaption\n(TTA) variant offer a promising solution to address this challenge. In a\nsetting designed to reflect real-world conditions, we compare existing methods\nto state-of-the-art TTA approaches adopted for cancer detection, demonstrating\nthe lack of robustness to distribution shifts in the former. We then propose\nDiverse Ensemble Entropy Minimization (DEnEM), questioning the effectiveness of\ncurrent TTA methods on ultrasound data. We show that these methods, although\noutperforming baselines, are suboptimal due to relying on neural networks\noutput probabilities, which could be uncalibrated, or relying on data\naugmentation, which is not straightforward to define on ultrasound data. Our\nresults show a significant improvement of $5\\%$ to $7\\%$ in AUROC over the\nexisting methods and $3\\%$ to $5\\%$ over TTA methods, demonstrating the\nadvantage of DEnEM in addressing distribution shift.\n  \\keywords{Ultrasound Imaging \\and Prostate Cancer \\and Computer-aided\nDiagnosis \\and Distribution Shift Robustness \\and Test-time Adaptation.}\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}