{"id":"2407.16541","title":"QPT V2: Masked Image Modeling Advances Visual Scoring","authors":"Qizhi Xie, Kun Yuan, Yunpeng Qu, Mingda Wu, Ming Sun, Chao Zhou,\n  Jihong Zhu","authorsParsed":[["Xie","Qizhi",""],["Yuan","Kun",""],["Qu","Yunpeng",""],["Wu","Mingda",""],["Sun","Ming",""],["Zhou","Chao",""],["Zhu","Jihong",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:53:47 GMT"}],"updateDate":"2024-07-24","timestamp":1721746427000,"abstract":"  Quality assessment and aesthetics assessment aim to evaluate the perceived\nquality and aesthetics of visual content. Current learning-based methods suffer\ngreatly from the scarcity of labeled data and usually perform sub-optimally in\nterms of generalization. Although masked image modeling (MIM) has achieved\nnoteworthy advancements across various high-level tasks (e.g., classification,\ndetection etc.). In this work, we take on a novel perspective to investigate\nits capabilities in terms of quality- and aesthetics-awareness. To this end, we\npropose Quality- and aesthetics-aware pretraining (QPT V2), the first\npretraining framework based on MIM that offers a unified solution to quality\nand aesthetics assessment. To perceive the high-level semantics and\nfine-grained details, pretraining data is curated. To comprehensively encompass\nquality- and aesthetics-related factors, degradation is introduced. To capture\nmulti-scale quality and aesthetic information, model structure is modified.\nExtensive experimental results on 11 downstream benchmarks clearly show the\nsuperior performance of QPT V2 in comparison with current state-of-the-art\napproaches and other pretraining paradigms. Code and models will be released at\n\\url{https://github.com/KeiChiTse/QPT-V2}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XaWLjiPHeAfFeO1ixw9jYGw-rGUbs7Smr5kqI29XtVk","pdfSize":"4333355"}
