{"id":"2407.13154","title":"Modeling the Solar System as an Observed Multi-Transit System I:\n  Characterization Limits from Analytic Timing Variations","authors":"Bethlee Lindor, Eric Agol","authorsParsed":[["Lindor","Bethlee",""],["Agol","Eric",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 04:43:17 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 00:25:45 GMT"}],"updateDate":"2024-07-25","timestamp":1721277797000,"abstract":"  Planetary systems with multiple transiting planets are beneficial for\nunderstanding planet occurrence rates and system architectures. Although we\nhave yet to find a solar system (SS) analog, future surveys may detect multiple\nterrestrial planets transiting a Sun-like star. In this work, we simulate\ntransit timing observations of our Solar System as viewed from a distance and\nbased on the actual orbital motions of Venus and the Earth-Moon Barycenter, as\ninfluenced by the other SS bodies, with varying noise levels and observing\ndurations. We then retrieve the system's dynamical parameters using an\napproximate N-body model for transit timing shifts while considering four\npossible plane-parallel configurations: two planets, three planets, four\nplanets, and five planets.\n  We demonstrate that -- with the retrieval applied to simulated transit times\nof Venus and EMB -- we can: 1) detect Jupiter at high significance (up to 90-s\ntiming noise); 2) measure the masses and orbits of both transiting planets\n(mass-ratios are down to 4-8% uncertainty for the 3-planet model) ; 3) detect\nMars with more than $5\\sigma$ given very high level precision (10s of seconds).\nTo accurately characterize Jupiter, we require timing precisions of better than\n30 seconds and survey durations longer than 22 years. Accurate retrieval of\nMars is possible when the survey baseline is longer than 25 years.\nAdditionally, while Jupiter's mass is underestimated in most of our simulated\ncases, the addition of Mars improves the posterior mass, suggesting that unseen\nterrestrials could interfere in the characterization of multi-planetary systems\nif they are nearly resonant to transiting planets.\n  Ultimately, these simulations will help to guide future missions -- such as\nPLATO, Nautilus, LUVOIR, and Ariel -- in detecting and characterizing exoplanet\nsystems analogous to our Solar System.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}