{"id":"2407.00814","title":"Privacy-Aware Spectrum Pricing and Power Control Optimization for LEO\n  Satellite Internet-of-Things","authors":"Bowen Shen, Kwok-Yan Lam, Feng Li","authorsParsed":[["Shen","Bowen",""],["Lam","Kwok-Yan",""],["Li","Feng",""]],"versions":[{"version":"v1","created":"Mon, 1 Apr 2024 09:15:48 GMT"}],"updateDate":"2024-07-02","timestamp":1711962948000,"abstract":"  Low earth orbit (LEO) satellite systems play an important role in next\ngeneration communication networks due to their ability to provide extensive\nglobal coverage with guaranteed communications in remote areas and isolated\nareas where base stations cannot be cost-efficiently deployed. With the\npervasive adoption of LEO satellite systems, especially in the LEO\nInternet-of-Things (IoT) scenarios, their spectrum resource management\nrequirements have become more complex as a result of massive service requests\nand high bandwidth demand from terrestrial terminals. For instance, when\nleasing the spectrum to terrestrial users and controlling the uplink transmit\npower, satellites collect user data for machine learning purposes, which\nusually are sensitive information such as location, budget and quality of\nservice (QoS) requirement. To facilitate model training in LEO IoT while\npreserving the privacy of data, blockchain-driven federated learning (FL) is\nwidely used by leveraging on a fully decentralized architecture. In this paper,\nwe propose a hybrid spectrum pricing and power control framework for LEO IoT by\ncombining blockchain technology and FL. We first design a local deep\nreinforcement learning algorithm for LEO satellite systems to learn a\nrevenue-maximizing pricing and power control scheme. Then the agents\ncollaborate to form a FL system. We also propose a reputation-based blockchain\nwhich is used in the global model aggregation phase of FL. Based on the\nreputation mechanism, a node is selected for each global training round to\nperform model aggregation and block generation, which can further enhance the\ndecentralization of the network and guarantee the trust. Simulation tests are\nconducted to evaluate the performances of the proposed scheme. Our results show\nthe efficiency of finding the maximum revenue scheme for LEO satellite systems\nwhile preserving the privacy of each agent.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}