{"id":"2407.00405","title":"Novel Skyrmion and spin wave solutions in superconducting ferromagnets","authors":"Shantonu Mukherjee and Amitabha Lahiri","authorsParsed":[["Mukherjee","Shantonu",""],["Lahiri","Amitabha",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 11:17:23 GMT"}],"updateDate":"2024-07-02","timestamp":1719659843000,"abstract":"  The coexistence of Ferromagnetism and superconductivity in so called\nferromagnetic superconductors is an intriguing phenomenon which may lead to\nnovel physical effects as well as applications. Here in this work we have\nexplored the interplay of topological excitations, namely vortices and\nskyrmions, in ferromagnetic superconductors using a field theoretic description\nof such systems. In particular, numerical solutions for the continuous spin\nfield compatible to a given vortex profile are determined in absence and\npresence of a Dzyaloshinskii-Moriya interaction (DMI) term. The solutions show\nthat the spin configuration is like a skyrmion but intertwined with the vortex\nstructure -- the radius of the the skyrmion-like solution depends on the\npenetration depth and also the polarity of the skyrmion depends on the sign of\nthe winding number. Thus our solution describes a novel topological structure\n-- namely a skyrmion-vortex composite. We have also determined the spin wave\nsolutions in such systems in presence and absence of a vortex. In absence of\nvortex frequency and wave vector satisfy a cubic equation which leads to\nvarious interesting features. In particular, we have shown that in the low\nfrequency regime the minimum in dispersion relation shifts from $k=0$ to a non\nzero $k$ value depending on the parameters. We also discuss the nature of spin\nwave dispersion in the $\\omega \\sim \\Tilde{m}$ regime which shows a similar\npattern in the dispersion curve. The group velocity of the spin wave would\nchange it's sign across such a minimum which is unique to FMSC. Also, the spin\nwave modes around the local minimum looks like roton mode in superfluid and\nhence called a magnetic roton. In presence of a vortex, the spin wave amplitude\nis shown to vary spatially such that the profile looks like that of a N\\'eel\nSkyrmion. Possible experimental signature of both solutions are also discussed.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Strongly Correlated Electrons","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}