{"id":"2407.15132","title":"Deep multimodal saliency parcellation of cerebellar pathways: linking\n  microstructure and individual function through explainable multitask learning","authors":"Ari Tchetchenian, Leo Zekelman, Yuqian Chen, Jarrett Rushmore, Fan\n  Zhang, Edward H. Yeterian, Nikos Makris, Yogesh Rathi, Erik Meijering, Yang\n  Song, Lauren J. O'Donnell","authorsParsed":[["Tchetchenian","Ari",""],["Zekelman","Leo",""],["Chen","Yuqian",""],["Rushmore","Jarrett",""],["Zhang","Fan",""],["Yeterian","Edward H.",""],["Makris","Nikos",""],["Rathi","Yogesh",""],["Meijering","Erik",""],["Song","Yang",""],["O'Donnell","Lauren J.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 12:05:45 GMT"}],"updateDate":"2024-07-23","timestamp":1721563545000,"abstract":"  Parcellation of human cerebellar pathways is essential for advancing our\nunderstanding of the human brain. Existing diffusion MRI tractography\nparcellation methods have been successful in defining major cerebellar fibre\ntracts, while relying solely on fibre tract structure. However, each fibre\ntract may relay information related to multiple cognitive and motor functions\nof the cerebellum. Hence, it may be beneficial for parcellation to consider the\npotential importance of the fibre tracts for individual motor and cognitive\nfunctional performance measures. In this work, we propose a multimodal\ndata-driven method for cerebellar pathway parcellation, which incorporates both\nmeasures of microstructure and connectivity, and measures of individual\nfunctional performance. Our method involves first training a multitask deep\nnetwork to predict various cognitive and motor measures from a set of fibre\ntract structural features. The importance of each structural feature for\npredicting each functional measure is then computed, resulting in a set of\nstructure-function saliency values that are clustered to parcellate cerebellar\npathways. We refer to our method as Deep Multimodal Saliency Parcellation\n(DeepMSP), as it computes the saliency of structural measures for predicting\ncognitive and motor functional performance, with these saliencies being applied\nto the task of parcellation. Applying DeepMSP we found that it was feasible to\nidentify multiple cerebellar pathway parcels with unique structure-function\nsaliency patterns that were stable across training folds.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}