{"id":"2407.17593","title":"AGN-driven outflows in clumpy media: multiphase structure and scaling\n  relations","authors":"Samuel Ruthven Ward, Tiago Costa, Chris M. Harrison, Vincenzo Mainieri","authorsParsed":[["Ward","Samuel Ruthven",""],["Costa","Tiago",""],["Harrison","Chris M.",""],["Mainieri","Vincenzo",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 19:00:06 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 12:04:36 GMT"}],"updateDate":"2024-08-19","timestamp":1721847606000,"abstract":"  Small-scale winds driven from accretion discs surrounding active galactic\nnuclei (AGN) are expected to launch kpc-scale outflows into their host\ngalaxies. However, the ways in which the structure of the interstellar medium\n(ISM) affects the multiphase content and impact of the outflow remains\nuncertain. We present a series of numerical experiments featuring a realistic\nsmall-scale AGN wind with velocity $5\\times 10^3-10^4\\ \\rm{km/s}$ interacting\nwith an isolated galaxy disc with a manually-controlled clumpy ISM, followed at\nsub-pc resolution. Our simulations are performed with AREPO and probe a wide\nrange of AGN luminosities ($L=10^{43-47}\\ \\rm{erg/s}$) and ISM substructures.\nIn homogeneous discs, the AGN wind sweeps up an outflowing, cooling shell,\nwhere the emerging cold phase dominates the mass and kinetic energy budgets,\nreaching a momentum flux $\\dot{p} \\approx 7\\ L/c$. However, when the ISM is\nclumpy, outflow properties are profoundly different. They contain small,\nlong-lived ($> 5\\ \\rm{Myr}$), cold ($T<10^{4.5}\\ \\rm{K}$) cloudlets entrained\nin the faster, hot outflow phase, which are only present in the outflow if\nradiative cooling is included in the simulation. While the cold phase dominates\nthe mass of the outflow, most of the kinetic luminosity is now carried by a\ntenuous, hot phase with $T > 10^7 \\ \\rm K$. While the hot phases reaches\nmomentum fluxes $\\dot{p} \\approx (1 - 5)\\ L/c$, energy-driven bubbles couple to\nthe cold phase inefficiently, producing modest momentum fluxes $\\dot{p} < L/c$\nin the fast-outflowing cold gas. These low momentum fluxes could lead to the\noutflows being misclassified as momentum-driven using common observational\ndiagnostics. We also show predictions for scaling relations between outflow\nproperties and AGN luminosity and discuss the challenges in constraining\noutflow driving mechanisms and kinetic coupling efficiencies using observed\nquantities.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zBGsXQ23hCsazmuq_Bifuhr-3FmKXnO80XVhTLA4ezk","pdfSize":"8150582","objectId":"0x9e92241131adcb6f582b6e5848d75580f279d72ba1c8484de3d6b5dc4cf620bc","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
