{"id":"2407.01268","title":"Tracking radiation damage of Euclid VIS detectors after 1 year in space","authors":"Jesper Skottfelt, Matt Wander, Mark Cropper, Ben Dryer, David J. Hall,\n  Richard Hayes, Bradley Kelman, Tom Kitching, Ralf Kohley, David Lagattuta,\n  Zoe Lee-Payne, Patricia Liebing, Richard Massey, Henry Joy McCracken, Reiko\n  Nakajima, James Nightingale","authorsParsed":[["Skottfelt","Jesper",""],["Wander","Matt",""],["Cropper","Mark",""],["Dryer","Ben",""],["Hall","David J.",""],["Hayes","Richard",""],["Kelman","Bradley",""],["Kitching","Tom",""],["Kohley","Ralf",""],["Lagattuta","David",""],["Lee-Payne","Zoe",""],["Liebing","Patricia",""],["Massey","Richard",""],["McCracken","Henry Joy",""],["Nakajima","Reiko",""],["Nightingale","James",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:19:49 GMT"}],"updateDate":"2024-07-02","timestamp":1719839989000,"abstract":"  Due to the space radiation environment at L2, ESA's Euclid mission will be\nsubject to a large amount of highly energetic particles over its lifetime.\nThese particles can cause damage to the detectors by creating defects in the\nsilicon lattice. These defects degrade the returned image in several ways, one\nexample being a degradation of the Charge Transfer Efficiency, which appears as\nreadout trails in the image data. This can be problematic for the Euclid VIS\ninstrument, which aims to measure the shapes of galaxies to a very high degree\nof accuracy. Using a special clocking technique called trap pumping, the single\ndefects in the CCDs can be detected and characterised. Being the first\ninstrument in space with this capability, it will provide novel insights into\nthe creation and evolution of radiation-induced defects and give input to the\nradiation damage correction of the scientific data. We present the status of\nthe radiation damage of the Euclid VIS CCDs and how it has evolved over the\nfirst year in space.\n","subjects":["Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"372M4okdUt8lGYQLzbuauMmdWRUMEZbUr5XEd2d5Z2s","pdfSize":"990984","objectId":"0xe3901c0d2e26915ae34a0e755d3f453fad5ffea44e56640f71469ed21a89e93f","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
