{"id":"2407.01983","title":"SADL: An Effective In-Context Learning Method for Compositional Visual\n  QA","authors":"Long Hoang Dang, Thao Minh Le, Vuong Le, Tu Minh Phuong, Truyen Tran","authorsParsed":[["Dang","Long Hoang",""],["Le","Thao Minh",""],["Le","Vuong",""],["Phuong","Tu Minh",""],["Tran","Truyen",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 06:41:39 GMT"}],"updateDate":"2024-07-03","timestamp":1719902499000,"abstract":"  Large vision-language models (LVLMs) offer a novel capability for performing\nin-context learning (ICL) in Visual QA. When prompted with a few demonstrations\nof image-question-answer triplets, LVLMs have demonstrated the ability to\ndiscern underlying patterns and transfer this latent knowledge to answer new\nquestions about unseen images without the need for expensive supervised\nfine-tuning. However, designing effective vision-language prompts, especially\nfor compositional questions, remains poorly understood. Adapting language-only\nICL techniques may not necessarily work because we need to bridge the\nvisual-linguistic semantic gap: Symbolic concepts must be grounded in visual\ncontent, which does not share the syntactic linguistic structures. This paper\nintroduces SADL, a new visual-linguistic prompting framework for the task. SADL\nrevolves around three key components: SAmpling, Deliberation, and\nPseudo-Labeling of image-question pairs. Given an image-question query, we\nsample image-question pairs from the training data that are in semantic\nproximity to the query. To address the compositional nature of questions, the\ndeliberation step decomposes complex questions into a sequence of subquestions.\nFinally, the sequence is progressively annotated one subquestion at a time to\ngenerate a sequence of pseudo-labels. We investigate the behaviors of SADL\nunder OpenFlamingo on large-scale Visual QA datasets, namely GQA, GQA-OOD,\nCLEVR, and CRIC. The evaluation demonstrates the critical roles of sampling in\nthe neighborhood of the image, the decomposition of complex questions, and the\naccurate pairing of the subquestions and labels. These findings do not always\nalign with those found in language-only ICL, suggesting fresh insights in\nvision-language settings.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}