{"id":"2407.21453","title":"TinyChirp: Bird Song Recognition Using TinyML Models on Low-power\n  Wireless Acoustic Sensors","authors":"Zhaolan Huang, Adrien Tousnakhoff, Polina Kozyr, Roman Rehausen, Felix\n  Bie{\\ss}mann, Robert Lachlan, Cedric Adjih and Emmanuel Baccelli","authorsParsed":[["Huang","Zhaolan",""],["Tousnakhoff","Adrien",""],["Kozyr","Polina",""],["Rehausen","Roman",""],["Bießmann","Felix",""],["Lachlan","Robert",""],["Adjih","Cedric",""],["Baccelli","Emmanuel",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 08:57:42 GMT"},{"version":"v2","created":"Wed, 11 Sep 2024 08:07:24 GMT"}],"updateDate":"2024-09-12","timestamp":1722416262000,"abstract":"  Monitoring biodiversity at scale is challenging. Detecting and identifying\nspecies in fine grained taxonomies requires highly accurate machine learning\n(ML) methods. Training such models requires large high quality data sets. And\ndeploying these models to low power devices requires novel compression\ntechniques and model architectures. While species classification methods have\nprofited from novel data sets and advances in ML methods, in particular neural\nnetworks, deploying these state of the art models to low power devices remains\ndifficult. Here we present a comprehensive empirical comparison of various\ntinyML neural network architectures and compression techniques for species\nclassification. We focus on the example of bird song detection, more concretely\na data set curated for studying the corn bunting bird species. The data set is\nreleased along with all code and experiments of this study. In our experiments\nwe compare predictive performance, memory and time complexity of classical\nspectrogram based methods and recent approaches operating on raw audio signal.\nOur results indicate that individual bird species can be robustly detected with\nrelatively simple architectures that can be readily deployed to low power\ndevices.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}