{"id":"2407.11366","title":"Perceived Importance of ICT Proficiency for Teaching, Learning, and\n  Career Progression among Physical Education Teachers in Pampanga","authors":"Kristine Joy D. Magallanes, Mark Brianne C. Carreon, Kristalyn C.\n  Miclat, Ni\\~na Vina V. Salita, Gino A. Sumilhig, and Raymart Christopher C.\n  Guevarra, John Paul P. Miranda","authorsParsed":[["Magallanes","Kristine Joy D.",""],["Carreon","Mark Brianne C.",""],["Miclat","Kristalyn C.",""],["Salita","Niña Vina V.",""],["Sumilhig","Gino A.",""],["Guevarra","Raymart Christopher C.",""],["Miranda","John Paul P.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 04:14:48 GMT"}],"updateDate":"2024-07-17","timestamp":1721103288000,"abstract":"  The integration of information and communication technology (ICT) has become\nincreasingly vital across various educational fields, including physical\neducation (PE). This study aimed to evaluate the proficiency levels of PE\nteachers in using various ICT applications and to examine the relationship\nbetween the perceived importance of ICT proficiency for teaching and learning,\ncareer advancement, and actual proficiency among Senior High school PE teachers\nin the municipality of Mexico, Pampanga. This study employed a quantitative\ndescriptive approach. PE teachers from the municipality of Mexico, Pampanga,\nwere selected as the respondents. This study used a two-part survey. The first\nsection collected demographic data, such as age, gender, rank/position, and\nyears of teaching experience, and the second section assessed ICT skill levels\nand the perceived importance of ICT in teaching, learning, and career\nprogression. The results revealed that the majority of PE teachers had access\nto ICT resources. However, their proficiency levels with these tools varied\nsignificantly. Factors such as age, teaching experience, and professional\nposition were found to significantly influence teachers proficiency and their\nperceptions of the benefits of ICT integration in PE instruction. The study\nprovided a glimpse of the current state of ICT integration among Senior High\nschool PE teachers in Mexico, Pampanga, Philippines. This also highlights areas\nof improvement. The study suggests that policymakers, administrators, and\ntraining program developers should focus on enhancing the ICT proficiency of PE\nteachers to improve teaching practices and student engagement. Enhancing the\nICT proficiency of PE teachers is recommended to foster better teaching\nexperiences, increase student engagement, and promote overall educational\noutcomes.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gmrljwHc_KM7Ht69XqhTZnZpihdAOihNoGRH3_NWcqg","pdfSize":"344108","objectId":"0x07bb09cfe1aa39762df863930630021cdea44302b5be821cc99088e2909e7d12","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
