{"id":"2407.09874","title":"SeFi-CD: A Semantic First Change Detection Paradigm That Can Detect Any\n  Change You Want","authors":"Ling Zhao, Zhenyang Huang, Dongsheng Kuang, Chengli Peng, Jun Gan,\n  Haifeng Li","authorsParsed":[["Zhao","Ling",""],["Huang","Zhenyang",""],["Kuang","Dongsheng",""],["Peng","Chengli",""],["Gan","Jun",""],["Li","Haifeng",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 12:49:58 GMT"}],"updateDate":"2024-07-16","timestamp":1720874998000,"abstract":"  The existing change detection(CD) methods can be summarized as the\nvisual-first change detection (ViFi-CD) paradigm, which first extracts change\nfeatures from visual differences and then assigns them specific semantic\ninformation. However, CD is essentially dependent on change regions of interest\n(CRoIs), meaning that the CD results are directly determined by the semantics\nchanges of interest, making its primary image factor semantic of interest\nrather than visual. The ViFi-CD paradigm can only assign specific semantics of\ninterest to specific change features extracted from visual differences, leading\nto the inevitable omission of potential CRoIs and the inability to adapt to\ndifferent CRoI CD tasks. In other words, changes in other CRoIs cannot be\ndetected by the ViFi-CD method without retraining the model or significantly\nmodifying the method. This paper introduces a new CD paradigm, the\nsemantic-first CD (SeFi-CD) paradigm. The core idea of SeFi-CD is to first\nperceive the dynamic semantics of interest and then visually search for change\nfeatures related to the semantics. Based on the SeFi-CD paradigm, we designed\nAnything You Want Change Detection (AUWCD). Experiments on public datasets\ndemonstrate that the AUWCD outperforms the current state-of-the-art CD methods,\nachieving an average F1 score 5.01\\% higher than that of these advanced\nsupervised baselines on the SECOND dataset, with a maximum increase of 13.17\\%.\nThe proposed SeFi-CD offers a novel CD perspective and approach.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}