{"id":"2407.01534","title":"AIGC-Assisted Digital Watermark Services in Low-Earth Orbit\n  Satellite-Terrestrial Edge Networks","authors":"Kongyang Chen, Yikai Li, Wenjun Lan, Bing Mi, Shaowei Wang","authorsParsed":[["Chen","Kongyang",""],["Li","Yikai",""],["Lan","Wenjun",""],["Mi","Bing",""],["Wang","Shaowei",""]],"versions":[{"version":"v1","created":"Fri, 8 Mar 2024 08:58:30 GMT"}],"updateDate":"2024-07-03","timestamp":1709888310000,"abstract":"  Low Earth Orbit (LEO) satellite communication is a crucial component of\nfuture 6G communication networks, contributing to the development of an\nintegrated satellite-terrestrial network. In the forthcoming\nsatellite-to-ground network, the idle computational resources of LEO satellites\ncan serve as edge servers, delivering intelligent task computation services to\nground users. Existing research on satellite-to-ground computation primarily\nfocuses on designing efficient task scheduling algorithms to provide\nstraightforward computation services to ground users. This study aims to\nintegrate satellite edge networks with Artificial Intelligence-Generated\nContent (AIGC) technology to offer personalized AIGC services to ground users,\nsuch as customized digital watermarking services. Firstly, we propose a\nsatellite-to-ground edge network architecture, enabling bidirectional\ncommunication between visible LEO satellites and ground users. Each LEO\nsatellite is equipped with intelligent algorithms supporting various\nAIGC-assisted digital watermarking technologies with different precision\nlevels. Secondly, considering metrics like satellite visibility,\nsatellite-to-ground communication stability, digital watermark quality,\nsatellite-to-ground communication time, digital watermarking time, and ground\nuser energy consumption, we construct an AIGC-assisted digital watermarking\nmodel based on the satellite-to-ground edge network. Finally, we introduce a\nreinforcement learning-based task scheduling algorithm to obtain an optimal\nstrategy. Experimental results demonstrate that our approach effectively meets\nthe watermark generation needs of ground users, achieving a well-balanced\ntrade-off between generation time and user energy consumption. We anticipate\nthat this work will provide an effective solution for the intelligent services\nin satellite-to-ground edge networks.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}