{"id":"2407.03766","title":"Growth of matter perturbations in the Interacting Dark Energy/Dark\n  Matter Scenarios","authors":"N.Nazari Pooya","authorsParsed":[["Pooya","N. Nazari",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 09:24:19 GMT"}],"updateDate":"2024-07-08","timestamp":1720085059000,"abstract":"  In this study, we investigate two widely recognized Interacting Dark\nEnergy(IDE) models and assess their compatibility with observational data,\nfocusing on the growth rate of matter perturbations. We explore IDE models with\ndifferent equations of state(EoS) parameters for Dark Energy (DE), including\nthe CPL parameterization and a constant value for $w_{\\mathrm{de}}$. To\nconstrain the parameters of the IDE models using background data, we employ a\nMarkov Chain Monte Carlo(MCMC) analysis. Our results show that both IDE-I and\nIDE-II models are Compatible with observational data, although with slight\nvariations influenced by the homogeneity or clustering of DE. Following that,\nwe investigate the growth of matter perturbations and perform a comprehensive\nstatistical analysis utilizing both the background and growth rate data. The\ngrowth rate in IDE models exhibits deviations compared to the\n$\\Lambda\\mathrm{CDM}$ model due to the impact of homogeneity or clustering of\nDE, as well as the selection of the EoS parameter. However, we find that the\nIDE models show good compatibility with the growth rate data. Furthermore, we\nexplore how the clustering or homogeneity of DE and the selection of the EoS\nparameter affect the evolution of the relative difference in the growth rate of\nIDE models, $\\Delta f$, in comparison to the $\\Lambda\\mathrm{CDM}$ model.\nLastly, we employ the AIC and BIC criteria to evaluate and identify the best\nmodel that is compatible with the observational data. The selection of the\nmodel depends on the homogeneity or clustering of DE, the EoS parameter, and\nthe dataset used. Overall, the IDE-I and IDE-II models exhibit agreement with\nthe data, with slight deviations depending on specific scenarios and\nparameters.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}