{"id":"2407.10983","title":"Analyzing the birth-death model of Oncostreams in Glioma, and the\n  effects of Cytochalasin D treatment","authors":"Kai Poffenbarger, Rohan Pandey","authorsParsed":[["Poffenbarger","Kai",""],["Pandey","Rohan",""]],"versions":[{"version":"v1","created":"Fri, 14 Jun 2024 18:32:58 GMT"}],"updateDate":"2024-07-17","timestamp":1718389978000,"abstract":"  This research project investigates the critical role of oncostreams in glioma\naggressiveness, leveraging advanced ex-vivo 3D explants and in-vivo intravital\nimaging techniques to establish a direct correlation between oncostream density\nand cancer severity. The primary objective is to model the cell populations\nwithin oncostreams, with a specific focus on GFP+ NPA cells, to simulate cancer\ndynamics and provide insights into tumor behavior. The study employs a simple\nBirth-Death process to analyze cell population dynamics and treatment effects,\nbuilding and solving Kolmogorov equations to predict changes in cell population\nover time.\n  While the model could be expanded to include additional modulators such as\nmorphological attributes and neurotransmitter exposure, the focus remains on\ncell population to maintain feasibility. The study also examines various\ntreatment methods, finding that glutamate increases glioma cell movement while\nhistamine reduces it. Collagenase treatment effectively dismantles oncostreams,\nsuggesting a potential therapeutic strategy. For this paper, we specifically\nare going to be looking at Cytochalasin D, which shows promise in disrupting\noncostreams and reducing glioma invasiveness. By integrating these treatment\nvariables into the model, the research aims to understand their impact on\nglioma cell density within the oncostreams and aggressiveness, thereby\ncontributing to improved cancer management strategies. This comprehensive\napproach is expected to enhance our understanding of glioma progression and\ninform the development of effective therapeutic interventions.\n","subjects":["Quantitative Biology/Tissues and Organs","Mathematics/Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_17SMUueEcEhYzy338rjQeT8bs6XjXHBrzKC-5fAd60","pdfSize":"930879"}
