{"id":"2407.12669","title":"Enhancing the Utility of Privacy-Preserving Cancer Classification using\n  Synthetic Data","authors":"Richard Osuala, Daniel M. Lang, Anneliese Riess, Georgios Kaissis,\n  Zuzanna Szafranowska, Grzegorz Skorupko, Oliver Diaz, Julia A. Schnabel,\n  Karim Lekadir","authorsParsed":[["Osuala","Richard",""],["Lang","Daniel M.",""],["Riess","Anneliese",""],["Kaissis","Georgios",""],["Szafranowska","Zuzanna",""],["Skorupko","Grzegorz",""],["Diaz","Oliver",""],["Schnabel","Julia A.",""],["Lekadir","Karim",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:52:45 GMT"}],"updateDate":"2024-07-18","timestamp":1721231565000,"abstract":"  Deep learning holds immense promise for aiding radiologists in breast cancer\ndetection. However, achieving optimal model performance is hampered by\nlimitations in availability and sharing of data commonly associated to patient\nprivacy concerns. Such concerns are further exacerbated, as traditional deep\nlearning models can inadvertently leak sensitive training information. This\nwork addresses these challenges exploring and quantifying the utility of\nprivacy-preserving deep learning techniques, concretely, (i) differentially\nprivate stochastic gradient descent (DP-SGD) and (ii) fully synthetic training\ndata generated by our proposed malignancy-conditioned generative adversarial\nnetwork. We assess these methods via downstream malignancy classification of\nmammography masses using a transformer model. Our experimental results depict\nthat synthetic data augmentation can improve privacy-utility tradeoffs in\ndifferentially private model training. Further, model pretraining on synthetic\ndata achieves remarkable performance, which can be further increased with\nDP-SGD fine-tuning across all privacy guarantees. With this first in-depth\nexploration of privacy-preserving deep learning in breast imaging, we address\ncurrent and emerging clinical privacy requirements and pave the way towards the\nadoption of private high-utility deep diagnostic models. Our reproducible\ncodebase is publicly available at https://github.com/RichardObi/mammo_dp.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}