{"id":"2407.15625","title":"Dressed to Gamble: How Poker Drives the Dynamics of Wearables and Visits\n  on Decentraland's Social Virtual World","authors":"Amaury Trujillo, Clara Bacciu, Matteo Abrate","authorsParsed":[["Trujillo","Amaury",""],["Bacciu","Clara",""],["Abrate","Matteo",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 13:37:53 GMT"},{"version":"v2","created":"Sat, 3 Aug 2024 07:41:11 GMT"}],"updateDate":"2024-08-06","timestamp":1721655473000,"abstract":"  Decentraland is a blockchain-based social virtual world touted to be a\ncreative space owned by its community. In it, users can publish wearables used\nto customize avatars, which can be then sold or given away via blockchain\ntransfers. Decentral Games (DG), a single project owning prominent in-world\ncasinos, has by far created the most wearables, necessary to earn\ncryptocurrency in its flagship game ICE Poker. Herein, we present a\ncomprehensive study on how DG and ICE Poker influence the dynamics of wearables\nand in-world visits in Decentraland. To this end, we analyzed 5.9 million\nwearable transfers made on the Polygon blockchain (and related sales) over a\ntwo-year period, and 677 million log events of in-world user positions in an\noverlapping 10-month period. We found that the platform-wise number of\ntransfers and sales monetary value of wearables were disproportionally related\nto DG, and that its two ICE Poker casinos (less than 0.1% of the world map)\nrepresented a very large average share of daily unique visitors (33%) and time\nspent in the virtual world (20%). Despite several alternative in-world economic\nand artistic initiatives in Decentraland, some of which have attracted much\nattention from the general public, a single third-party online poker game\nappears to be the main driver of the analyzed dynamics. Our work thus\ncontributes to the current understanding of user behavior in social virtual\nworlds, and it is among the first to study the emerging phenomenon of\nblockchain-based online gambling in virtual reality spaces.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}