{"id":"2407.13570","title":"The Storage Location Assignment and Picker Routing Problem: A Generic\n  Branch-Cut-and-Price Algorithm","authors":"Thibault Prunet, Nabil Absi, Diego Cattaruzza","authorsParsed":[["Prunet","Thibault",""],["Absi","Nabil",""],["Cattaruzza","Diego",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 15:14:32 GMT"}],"updateDate":"2024-07-19","timestamp":1721315672000,"abstract":"  The Storage Location Assignment Problem (SLAP) and the Picker Routing Problem\n(PRP) have received significant attention in the literature due to their\npivotal role in the performance of the Order Picking (OP) activity, the most\nresource-intensive process of warehousing logistics. The two problems are\ntraditionally considered at different decision-making levels: tactical for the\nSLAP, and operational for the PRP. However, this paradigm has been challenged\nby the emergence of modern practices in e-commerce warehouses, where storage\ndecisions are more dynamic and are made at an operational level, making the\nintegration of the SLAP and PRP pertinent to consider. Despite its practical\nsignificance, the joint optimization of both operations, called the Storage\nLocation Assignment and Picker Routing Problem (SLAPRP), has received limited\nattention. Scholars have investigated several variants of the SLAPRP, including\ndifferent warehouse layouts and routing policies. Nevertheless, the available\ncomputational results suggest that each variant requires an ad hoc formulation.\nMoreover, achieving a complete integration of the two problems, where the\nrouting is solved optimally, remains out of reach for commercial solvers.\n  In this paper, we propose an exact solution framework that addresses a broad\nclass of variants of the SLAPRP, including all the previously existing ones.\nThis paper proposes a Branch-Cut-and-Price framework based on a novel\nformulation with an exponential number of variables, which is strengthened with\na novel family of non-robust valid inequalities. We have developed an ad-hoc\nbranching scheme to break symmetries and maintain the size of the enumeration\ntree manageable. Computational experiments show that our framework can\neffectively solve medium-sized instances of several SLAPRP variants and\noutperforms the state-of-the-art methods from the literature.\n","subjects":["Computing Research Repository/Discrete Mathematics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}