{"id":"2407.20949","title":"Detailed abundances of the planet-hosting TOI-1173 A/B system: Possible\n  evidence of planet engulfment in a very wide binary","authors":"Jhon Yana Galarza, Henrique Reggiani, Thiago Ferreira, Diego\n  Lorenzo-Oliveira, Joshua D. Simon, Andrew McWilliam, Kevin C. Schlaufman,\n  Paula Miquelarena, Matias Flores Trivigno, Marcelo Jaque Arancibia","authorsParsed":[["Galarza","Jhon Yana",""],["Reggiani","Henrique",""],["Ferreira","Thiago",""],["Lorenzo-Oliveira","Diego",""],["Simon","Joshua D.",""],["McWilliam","Andrew",""],["Schlaufman","Kevin C.",""],["Miquelarena","Paula",""],["Trivigno","Matias Flores",""],["Arancibia","Marcelo Jaque",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 16:27:50 GMT"}],"updateDate":"2024-07-31","timestamp":1722356870000,"abstract":"  Over the last decade, studies of large samples of binary systems identified\nchemical anomalies, and showed that they might be attributed to planet\nformation or planet engulfment. However, both scenarios have primarily been\ntested in pairs without known exoplanets. In this work, we explore these\nscenarios in the newly detected planet-hosting wide binary TOI-1173 A/B\n(projected separation $\\sim 11,400$ AU) using high-resolution MAROON-X and\nARCES spectra. We determined photospheric stellar parameters both by fitting\nstellar models and via the spectroscopic equilibrium approach. Both analyses\nagree and suggest that they are cool main sequence stars located in the thin\ndisc. A line-by-line differential analysis between the components (B$-$A)\ndisplays an abundance pattern in the condensation temperature plane where the\nplanet-hosting star TOI-1173 A is enhanced in refractory elements such as iron\nby more than 0.05 dex. This suggests the engulfment of $\\sim$18 M$_{\\oplus}$ of\nrocky material in star A. Our hypothesis is supported by the dynamics of the\nsystem detailed in our companion paper Yana Galarza et al. 2024, which suggest\nthat the Super-Neptune TOI-1173 A $b$ might have been delivered to its current\nshort period ($\\sim7$ days) through circulatization and von Zeipel-Lidov-Kozai\nmechanisms, thereby triggering the engulfment of inner rocky exoplanets.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}