{"id":"2407.02751","title":"Emotion and Intent Joint Understanding in Multimodal Conversation: A\n  Benchmarking Dataset","authors":"Rui Liu, Haolin Zuo, Zheng Lian, Xiaofen Xing, Bj\\\"orn W. Schuller,\n  Haizhou Li","authorsParsed":[["Liu","Rui",""],["Zuo","Haolin",""],["Lian","Zheng",""],["Xing","Xiaofen",""],["Schuller","Björn W.",""],["Li","Haizhou",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 01:56:00 GMT"},{"version":"v2","created":"Thu, 4 Jul 2024 15:13:24 GMT"}],"updateDate":"2024-07-08","timestamp":1719971760000,"abstract":"  Emotion and Intent Joint Understanding in Multimodal Conversation (MC-EIU)\naims to decode the semantic information manifested in a multimodal\nconversational history, while inferring the emotions and intents simultaneously\nfor the current utterance. MC-EIU is enabling technology for many\nhuman-computer interfaces. However, there is a lack of available datasets in\nterms of annotation, modality, language diversity, and accessibility. In this\nwork, we propose an MC-EIU dataset, which features 7 emotion categories, 9\nintent categories, 3 modalities, i.e., textual, acoustic, and visual content,\nand two languages, i.e., English and Mandarin. Furthermore, it is completely\nopen-source for free access. To our knowledge, MC-EIU is the first\ncomprehensive and rich emotion and intent joint understanding dataset for\nmultimodal conversation. Together with the release of the dataset, we also\ndevelop an Emotion and Intent Interaction (EI$^2$) network as a reference\nsystem by modeling the deep correlation between emotion and intent in the\nmultimodal conversation. With comparative experiments and ablation studies, we\ndemonstrate the effectiveness of the proposed EI$^2$ method on the MC-EIU\ndataset. The dataset and codes will be made available at:\nhttps://github.com/MC-EIU/MC-EIU.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}