{"id":"2407.01167","title":"Information Density Bounds for Privacy","authors":"Sara Saeidian (1), Leonhard Grosse (1), Parastoo Sadeghi (2), Mikael\n  Skoglund (1), Tobias J. Oechtering (1) ((1) KTH Royal Institute of\n  Technology, (2) University of New South Wales)","authorsParsed":[["Saeidian","Sara",""],["Grosse","Leonhard",""],["Sadeghi","Parastoo",""],["Skoglund","Mikael",""],["Oechtering","Tobias J.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 10:38:02 GMT"}],"updateDate":"2024-07-02","timestamp":1719830282000,"abstract":"  This paper explores the implications of guaranteeing privacy by imposing a\nlower bound on the information density between the private and the public data.\nWe introduce an operationally meaningful privacy measure called pointwise\nmaximal cost (PMC) and demonstrate that imposing an upper bound on PMC is\nequivalent to enforcing a lower bound on the information density. PMC\nquantifies the information leakage about a secret to adversaries who aim to\nminimize non-negative cost functions after observing the outcome of a privacy\nmechanism. When restricted to finite alphabets, PMC can equivalently be defined\nas the information leakage to adversaries aiming to minimize the probability of\nincorrectly guessing randomized functions of the secret. We study the\nproperties of PMC and apply it to standard privacy mechanisms to demonstrate\nits practical relevance. Through a detailed examination, we connect PMC with\nother privacy measures that impose upper or lower bounds on the information\ndensity. Our results highlight that lower bounding the information density is a\nmore stringent requirement than upper bounding it. Overall, our work\nsignificantly bridges the gaps in understanding the relationships between\nvarious privacy frameworks and provides insights for selecting a suitable\nframework for a given application.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Cryptography and Security","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}