{"id":"2407.11348","title":"Flatfish Disease Detection Based on Part Segmentation Approach and\n  Disease Image Generation","authors":"Seo-Bin Hwang, Han-Young Kim, Chae-Yeon Heo, Hie-Yong Jung, Sung-Ju\n  Jung, Yeong-Jun Cho","authorsParsed":[["Hwang","Seo-Bin",""],["Kim","Han-Young",""],["Heo","Chae-Yeon",""],["Jung","Hie-Yong",""],["Jung","Sung-Ju",""],["Cho","Yeong-Jun",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 03:32:10 GMT"}],"updateDate":"2024-07-17","timestamp":1721100730000,"abstract":"  The flatfish is a major farmed species consumed globally in large quantities.\nHowever, due to the densely populated farming environment, flatfish are\nsusceptible to injuries and diseases, making early disease detection crucial.\nTraditionally, diseases were detected through visual inspection, but observing\nlarge numbers of fish is challenging. Automated approaches based on deep\nlearning technologies have been widely used, to address this problem, but\naccurate detection remains difficult due to the diversity of the fish and the\nlack of the fish disease dataset. In this study, augments fish disease images\nusing generative adversarial networks and image harmonization methods. Next,\ndisease detectors are trained separately for three body parts (head, fins, and\nbody) to address individual diseases properly. In addition, a flatfish disease\nimage dataset called \\texttt{FlatIMG} is created and verified on the dataset\nusing the proposed methods. A flash salmon disease dataset is also tested to\nvalidate the generalizability of the proposed methods. The results achieved\n12\\% higher performance than the baseline framework. This study is the first\nattempt to create a large-scale flatfish disease image dataset and propose an\neffective disease detection framework. Automatic disease monitoring could be\nachieved in farming environments based on the proposed methods and dataset.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}