{"id":"2407.16475","title":"Data-Driven Domestic Flexible Demand: Observations from experiments in\n  cold climate","authors":"Dirk Reinhardt, Wenqi Cai, Sebastien Gros","authorsParsed":[["Reinhardt","Dirk",""],["Cai","Wenqi",""],["Gros","Sebastien",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 13:45:11 GMT"}],"updateDate":"2024-07-24","timestamp":1721742311000,"abstract":"  In this chapter, we report on our experience with domestic flexible electric\nenergy demand based on a regular commercial (HVAC)-based heating system in a\nhouse. Our focus is on investigating the predictability of the energy demand of\nthe heating system and of the thermal response when varying the heating system\nsettings. Being able to form such predictions is crucial for most flexible\ndemand algorithms. We will compare several methods for predicting the thermal\nand energy response, which either gave good results or which are currently\npromoted in the literature for controlling buildings. We will report that the\nstochasticity of a house response is -- in our experience -- the main\ndifficulty in providing domestic flexible demand from heating. The experiments\nwere carried out on a regular house in Norway, equipped with four air-to-air\nMitsubishi heat pumps and a high-efficiency balanced ventilation system. The\nhouse was equipped with multiple IoT-based climate sensors, real-time power\nmeasurement, and the possibility to drive the HVAC system via the IoT. The\nhouse is operating on the spot market (Nord Pool NO3) and is exposed to a peak\nenergy demand penalty. Over a period of three years, we have collected data on\nthe house (temperatures, humidity, air quality), real-time power and hourly\nenergy consumption, while applying various flexible demand algorithms\nresponding to the local energy costs. This has produced large variations in the\nsettings of the heating system and energy demand, resulting in rich data for\ninvestigating the house response. This chapter aims at providing important\ninsights on providing flexible demand from houses in cold climates.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}