{"id":"2407.20184","title":"Benchmarking and linear response modeling of high-fidelity Rydberg gates","authors":"Richard Bing-Shiun Tsai, Xiangkai Sun, Adam L. Shaw, Ran Finkelstein,\n  Manuel Endres","authorsParsed":[["Tsai","Richard Bing-Shiun",""],["Sun","Xiangkai",""],["Shaw","Adam L.",""],["Finkelstein","Ran",""],["Endres","Manuel",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 17:12:51 GMT"}],"updateDate":"2024-07-30","timestamp":1722273171000,"abstract":"  The fidelity of entangling operations is a key figure of merit in quantum\ninformation processing, especially in the context of quantum error correction.\nHigh-fidelity entangling gates in neutral atoms have seen remarkable\nadvancement recently. A full understanding of error sources and their\nrespective contributions to gate infidelity will enable the prediction of\nfundamental limits on quantum gates in neutral atom platforms with realistic\nexperimental constraints. In this work, we implement the time-optimal Rydberg\nCZ gate, design a circuit to benchmark its fidelity, and achieve a fidelity,\naveraged over symmetric input states, of 0.9971(5), setting a new\nstate-of-the-art for neutral atoms. The remaining infidelity is explained by an\nab initio error model, consistent with our experimental results over a range of\ngate speeds, with varying contributions from different error sources. Further,\nwe develop a linear response formalism to efficiently predict infidelity from\nlaser noise with non-trivial power spectral densities and derive scaling laws\nof infidelity with gate speed. Besides its capability of predicting gate\nfidelity, we also utilize the linear response formalism to compare and optimize\ngate protocols, to learn laser frequency noise, and to study the noise response\nfor quantum simulation tasks. Finally, we predict that a CZ gate fidelity of\n${\\gtrsim} 0.999$ is feasible with realistic experimental upgrades.\n","subjects":["Physics/Quantum Physics","Physics/Atomic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}