{"id":"2407.16166","title":"Robust Privacy Amidst Innovation with Large Language Models Through a\n  Critical Assessment of the Risks","authors":"Yao-Shun Chuang, Atiquer Rahman Sarkar, Yu-Chun Hsu, Noman Mohammed,\n  and Xiaoqian Jiang","authorsParsed":[["Chuang","Yao-Shun",""],["Sarkar","Atiquer Rahman",""],["Hsu","Yu-Chun",""],["Mohammed","Noman",""],["Jiang","Xiaoqian",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 04:20:14 GMT"},{"version":"v2","created":"Mon, 16 Sep 2024 06:02:00 GMT"}],"updateDate":"2024-09-17","timestamp":1721708414000,"abstract":"  This study examines integrating EHRs and NLP with large language models\n(LLMs) to improve healthcare data management and patient care. It focuses on\nusing advanced models to create secure, HIPAA-compliant synthetic patient notes\nfor biomedical research. The study used de-identified and re-identified MIMIC\nIII datasets with GPT-3.5, GPT-4, and Mistral 7B to generate synthetic notes.\nText generation employed templates and keyword extraction for contextually\nrelevant notes, with one-shot generation for comparison. Privacy assessment\nchecked PHI occurrence, while text utility was tested using an ICD-9 coding\ntask. Text quality was evaluated with ROUGE and cosine similarity metrics to\nmeasure semantic similarity with source notes. Analysis of PHI occurrence and\ntext utility via the ICD-9 coding task showed that the keyword-based method had\nlow risk and good performance. One-shot generation showed the highest PHI\nexposure and PHI co-occurrence, especially in geographic location and date\ncategories. The Normalized One-shot method achieved the highest classification\naccuracy. Privacy analysis revealed a critical balance between data utility and\nprivacy protection, influencing future data use and sharing. Re-identified data\nconsistently outperformed de-identified data. This study demonstrates the\neffectiveness of keyword-based methods in generating privacy-protecting\nsynthetic clinical notes that retain data usability, potentially transforming\nclinical data-sharing practices. The superior performance of re-identified over\nde-identified data suggests a shift towards methods that enhance utility and\nprivacy by using dummy PHIs to perplex privacy attacks.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xDSoLhlo8PihZKUbJWkqKuJqM96tkbj3JmMMOEwvojA","pdfSize":"842193"}
