{"id":"2407.18310","title":"Revolutionizing Undergraduate Learning: CourseGPT and Its Generative AI\n  Advancements","authors":"Ahmad M. Nazar, Mohamed Y. Selim, Ashraf Gaffar, Shakil Ahmed","authorsParsed":[["Nazar","Ahmad M.",""],["Selim","Mohamed Y.",""],["Gaffar","Ashraf",""],["Ahmed","Shakil",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 18:02:16 GMT"}],"updateDate":"2024-07-29","timestamp":1721930536000,"abstract":"  Integrating Generative AI (GenAI) into educational contexts presents a\ntransformative potential for enhancing learning experiences. This paper\nintroduces CourseGPT, a generative AI tool designed to support instructors and\nenhance the educational experiences of undergraduate students. Built on\nopen-source Large Language Models (LLMs) from Mistral AI, CourseGPT offers\ncontinuous instructor support and regular updates to course materials,\nenriching the learning environment. By utilizing course-specific content, such\nas slide decks and supplementary readings and references, CourseGPT provides\nprecise, dynamically generated responses to student inquiries. Unlike generic\nAI models, CourseGPT allows instructors to manage and control the responses,\nthus extending the course scope without overwhelming details. The paper\ndemonstrates the application of CourseGPT using the CPR E 431 - Basics of\nInformation System Security course as a pilot. This course, with its large\nenrollments and diverse curriculum, serves as an ideal testbed for CourseGPT.\nThe tool aims to enhance the learning experience, accelerate feedback\nprocesses, and streamline administrative tasks. The study evaluates CourseGPT's\nimpact on student outcomes, focusing on correctness scores, context recall, and\nfaithfulness of responses. Results indicate that the Mixtral-8x7b model, with a\nhigher parameter count, outperforms smaller models, achieving an 88.0%\ncorrectness score and a 66.6% faithfulness score. Additionally, feedback from\nformer students and teaching assistants on CourseGPT's accuracy, helpfulness,\nand overall performance was collected. The outcomes revealed that a significant\nmajority found CourseGPT to be highly accurate and beneficial in addressing\ntheir queries, with many praising its ability to provide timely and relevant\ninformation.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}