{"id":"2407.09748","title":"Multifrequency Analysis of Favored Models for the Messier 87* Accretion\n  Flow","authors":"Daniel C. M. Palumbo, Michi Baubock, and Charles F. Gammie","authorsParsed":[["Palumbo","Daniel C. M.",""],["Baubock","Michi",""],["Gammie","Charles F.",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 02:50:33 GMT"}],"updateDate":"2024-07-16","timestamp":1720839033000,"abstract":"  The polarized images of the supermassive black hole Messier 87* (M87*)\nproduced by the Event Horizon Telescope (EHT) provide a direct view of the\nnear-horizon emission from a black hole accretion and jet system. The EHT\ntheoretical analysis of the polarized M87* images compared thousands of\nsnapshots from numerical models with a variety of spins, magnetization states,\nviewing inclinations, and electron energy distributions, and found a small\nsubset consistent with the observed image. In this article, we examine two\nmodels favored by EHT analyses: a magnetically arrested disk with moderate\nretrograde spin and a magnetically arrested disk with high prograde spin. Both\nhave electron distribution functions which lead to strong depolarization by\ncold electrons. We ray trace five snapshots from each model at 22, 43, 86, 230,\n345, and 690 GHz to forecast future VLBI observations and examine limitations\nin numerical models. We find that even at low frequencies where optical and\nFaraday rotation depths are large, approximately rotationally symmetric\npolarization persists, suggesting that shallow depths dominate the polarization\nsignal. However, morphology and spectra suggest that the assumed thermal\nelectron distribution is not adequate to describe emission from the jet. We\nfind 86 GHz images show a ring-like shape determined by a combination of plasma\nand spacetime imprints, smaller in diameter than recent results from the Global\nmm-VLBI array. We find that the photon ring becomes more apparent with\nincreasing frequency, and is more apparent in the retrograde model, leading to\nlarge differences between models in asymmetry and polarization structure.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}