{"id":"2407.07135","title":"Improving Out-of-Distribution Detection by Combining Existing Post-hoc\n  Methods","authors":"Paul Novello, Yannick Prudent, Joseba Dalmau, Corentin Friedrich, Yann\n  Pequignot","authorsParsed":[["Novello","Paul",""],["Prudent","Yannick",""],["Dalmau","Joseba",""],["Friedrich","Corentin",""],["Pequignot","Yann",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 15:46:39 GMT"}],"updateDate":"2024-07-11","timestamp":1720539999000,"abstract":"  Since the seminal paper of Hendrycks et al. arXiv:1610.02136, Post-hoc deep\nOut-of-Distribution (OOD) detection has expanded rapidly. As a result,\npractitioners working on safety-critical applications and seeking to improve\nthe robustness of a neural network now have a plethora of methods to choose\nfrom. However, no method outperforms every other on every dataset\narXiv:2210.07242, so the current best practice is to test all the methods on\nthe datasets at hand. This paper shifts focus from developing new methods to\neffectively combining existing ones to enhance OOD detection. We propose and\ncompare four different strategies for integrating multiple detection scores\ninto a unified OOD detector, based on techniques such as majority vote,\nempirical and copulas-based Cumulative Distribution Function modeling, and\nmultivariate quantiles based on optimal transport. We extend common OOD\nevaluation metrics -- like AUROC and FPR at fixed TPR rates -- to these\nmulti-dimensional OOD detectors, allowing us to evaluate them and compare them\nwith individual methods on extensive benchmarks. Furthermore, we propose a\nseries of guidelines to choose what OOD detectors to combine in more realistic\nsettings, i.e. in the absence of known OOD data, relying on principles drawn\nfrom Outlier Exposure arXiv:1812.04606. The code is available at\nhttps://github.com/paulnovello/multi-ood.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}