{"id":"2407.02946","title":"3D Multimodal Image Registration for Plant Phenotyping","authors":"Eric Stumpe, Gernot Bodner, Francesco Flagiello, Matthias Zeppelzauer","authorsParsed":[["Stumpe","Eric",""],["Bodner","Gernot",""],["Flagiello","Francesco",""],["Zeppelzauer","Matthias",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 09:29:46 GMT"}],"updateDate":"2024-07-04","timestamp":1719998986000,"abstract":"  The use of multiple camera technologies in a combined multimodal monitoring\nsystem for plant phenotyping offers promising benefits. Compared to\nconfigurations that only utilize a single camera technology, cross-modal\npatterns can be recorded that allow a more comprehensive assessment of plant\nphenotypes. However, the effective utilization of cross-modal patterns is\ndependent on precise image registration to achieve pixel-accurate alignment, a\nchallenge often complicated by parallax and occlusion effects inherent in plant\ncanopy imaging.\n  In this study, we propose a novel multimodal 3D image registration method\nthat addresses these challenges by integrating depth information from a\ntime-of-flight camera into the registration process. By leveraging depth data,\nour method mitigates parallax effects and thus facilitates more accurate pixel\nalignment across camera modalities. Additionally, we introduce an automated\nmechanism to identify and differentiate different types of occlusions, thereby\nminimizing the introduction of registration errors.\n  To evaluate the efficacy of our approach, we conduct experiments on a diverse\nimage dataset comprising six distinct plant species with varying leaf\ngeometries. Our results demonstrate the robustness of the proposed registration\nalgorithm, showcasing its ability to achieve accurate alignment across\ndifferent plant types and camera compositions. Compared to previous methods it\nis not reliant on detecting plant specific image features and can thereby be\nutilized for a wide variety of applications in plant sciences. The registration\napproach principally scales to arbitrary numbers of cameras with different\nresolutions and wavelengths. Overall, our study contributes to advancing the\nfield of plant phenotyping by offering a robust and reliable solution for\nmultimodal image registration.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}