{"id":"2407.01565","title":"A pseudo-outcome-based framework to analyze treatment heterogeneity in\n  survival data using electronic health records","authors":"Na Bo, Jong-Hyeon Jeong, Erick Forno, Ying Ding","authorsParsed":[["Bo","Na",""],["Jeong","Jong-Hyeon",""],["Forno","Erick",""],["Ding","Ying",""]],"versions":[{"version":"v1","created":"Fri, 17 May 2024 23:28:50 GMT"}],"updateDate":"2024-07-03","timestamp":1715988530000,"abstract":"  An important aspect of precision medicine focuses on characterizing diverse\nresponses to treatment due to unique patient characteristics, also known as\nheterogeneous treatment effects (HTE), and identifying beneficial subgroups\nwith enhanced treatment effects. Estimating HTE with right-censored data in\nobservational studies remains challenging. In this paper, we propose a\npseudo-outcome-based framework for analyzing HTE in survival data, which\nincludes a list of meta-learners for estimating HTE, a variable importance\nmetric for identifying predictive variables to HTE, and a data-adaptive\nprocedure to select subgroups with enhanced treatment effects. We evaluate the\nfinite sample performance of the framework under various settings of\nobservational studies. Furthermore, we applied the proposed methods to analyze\nthe treatment heterogeneity of a Written Asthma Action Plan (WAAP) on\ntime-to-ED (Emergency Department) return due to asthma exacerbation using a\nlarge asthma electronic health records dataset with visit records expanded from\npre- to post-COVID-19 pandemic. We identified vulnerable subgroups of patients\nwith poorer asthma outcomes but enhanced benefits from WAAP and characterized\npatient profiles. Our research provides valuable insights for healthcare\nproviders on the strategic distribution of WAAP, particularly during disruptive\npublic health crises, ultimately improving the management and control of\npediatric asthma.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}