{"id":"2407.10307","title":"Distributed Charging Coordination for Electric Trucks under Limited\n  Facilities and Travel Uncertainties","authors":"Ting Bai, Yuchao Li, Karl Henrik Johansson, and Jonas M{\\aa}rtensson","authorsParsed":[["Bai","Ting",""],["Li","Yuchao",""],["Johansson","Karl Henrik",""],["Mårtensson","Jonas",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 19:56:56 GMT"}],"updateDate":"2024-07-16","timestamp":1720987016000,"abstract":"  In this work, we address the problem of charging coordination between\nelectric trucks and charging stations. The problem arises from the tension\nbetween the trucks' nontrivial charging times and the stations' limited\ncharging facilities. Our goal is to reduce the trucks' waiting times at the\nstations while minimizing individual trucks' operational costs. We propose a\ndistributed coordination framework that relies on computation and communication\nbetween the stations and the trucks, and handles uncertainties in travel times\nand energy consumption. Within the framework, the stations assign a limited\nnumber of charging ports to trucks according to the first-come, first-served\nrule. In addition, each station constructs a waiting time forecast model based\non its historical data and provides its estimated waiting times to trucks upon\nrequest. When approaching a station, a truck sends its arrival time and\nestimated arrival-time windows to the nearby station and the distant stations,\nrespectively. The truck then receives the estimated waiting times from these\nstations in response, and updates its charging plan accordingly while\naccounting for travel uncertainties. We performed simulation studies for\n$1,000$ trucks traversing the Swedish road network for $40$ days, using\nrealistic traffic data with travel uncertainties. The results show that our\nmethod reduces the average waiting time of the trucks by $46.1\\%$ compared to\noffline charging plans computed by the trucks without coordination and update,\nand by $33.8\\%$ compared to the coordination scheme assuming zero waiting times\nat distant stations.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}