{"id":"2407.19046","title":"Real-time Uncertainty-Aware Motion Planning for Magnetic-based\n  Navigation","authors":"Aditya Penumarti, Kristy Waters, Humberto Ramos, Kevin Brink and Jane\n  Shin","authorsParsed":[["Penumarti","Aditya",""],["Waters","Kristy",""],["Ramos","Humberto",""],["Brink","Kevin",""],["Shin","Jane",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:59:00 GMT"}],"updateDate":"2024-07-30","timestamp":1722020340000,"abstract":"  Localization in GPS-denied environments is critical for autonomous systems,\nand traditional methods like SLAM have limitations in generalizability across\ndiverse environments. Magnetic-based navigation (MagNav) offers a robust\nsolution by leveraging the ubiquity and unique anomalies of external magnetic\nfields. This paper proposes a real-time uncertainty-aware motion planning\nalgorithm for MagNav, using onboard magnetometers and information-driven\nmethodologies to adjust trajectories based on real-time localization\nconfidence. This approach balances the trade-off between finding the shortest\nor most energy-efficient routes and reducing localization uncertainty,\nenhancing navigational accuracy and reliability. The novel algorithm integrates\nan uncertainty-driven framework with magnetic-based localization, creating a\nreal-time adaptive system capable of minimizing localization errors in complex\nenvironments. Extensive simulations and real-world experiments validate the\nmethod, demonstrating significant reductions in localization uncertainty and\nthe feasibility of real-time implementation. The paper also details the\nmathematical modeling of uncertainty, the algorithmic foundation of the\nplanning approach, and the practical implications of using magnetic fields for\nlocalization. Future work includes incorporating a global path planner to\naddress the local nature of the current guidance law, further enhancing the\nmethod's suitability for long-duration operations.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}