{"id":"2407.02558","title":"Modified gravity interpretation of the evolving dark energy in light of\n  DESI data","authors":"Anton Chudaykin and Martin Kunz","authorsParsed":[["Chudaykin","Anton",""],["Kunz","Martin",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-04","timestamp":1719943200000,"abstract":"  The Dark Energy Spectroscopic Instrument (DESI) collaboration has recently\nreleased measurements of baryon acoustic oscillation (BAO) from the first year\nof observations. A joint analysis of DESI BAO, CMB, and SN Ia probes indicates\na preference for time-evolving dark energy. We evaluate the robustness of this\npreference by replacing the DESI distance measurements at $z<0.8$ with the SDSS\nBAO measurements in a similar redshift range. Assuming the $w_0w_a$CDM model,\nwe find an evolution of the dark energy equation of state parameters consistent\nwith $\\Lambda$CDM. Our analysis of $\\chi^2$ statistics across various BAO\ndatasets shows that DESI's preference for evolving dark energy is primarily\ndriven by the two LRG samples at $z_{\\rm eff}=0.51$ and $z_{\\rm eff}=0.71$,\nwith the latter having the most significant impact.\n  Taking this preference seriously, we study a general Horndeski scalar-tensor\ntheory, which provides a physical mechanism to safely cross the phantom divide,\n$w=-1$. Utilizing the Effective Field Theory of dark energy and adopting the\n$w_0w_a$CDM background cosmological model, we derive constraints on the\nparameters $w_0=-0.856\\pm0.062$ and $w_a=-0.53_{-0.26}^{+0.28}$ at $68\\%$ CL\nfrom Planck CMB, Planck and ACT CMB lensing, DESI BAO, and Pantheon+ datasets,\nshowing good consistency with the standard $w_0w_a$CDM model. The modified\ngravity model shows a preference over $\\Lambda$CDM at the $2.4\\sigma$ level,\nwhile for $w_0w_a$CDM it is at $2.5\\sigma$. We conclude that modified gravity\noffers a viable physical explanation for DESI's preference for evolving dark\nenergy.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}