{"id":"2407.03699","title":"Generalized Robust Fundus Photography-based Vision Loss Estimation for\n  High Myopia","authors":"Zipei Yan, Zhile Liang, Zhengji Liu, Shuai Wang, Rachel Ka-Man Chun,\n  Jizhou Li, Chea-su Kee, Dong Liang","authorsParsed":[["Yan","Zipei",""],["Liang","Zhile",""],["Liu","Zhengji",""],["Wang","Shuai",""],["Chun","Rachel Ka-Man",""],["Li","Jizhou",""],["Kee","Chea-su",""],["Liang","Dong",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 07:39:19 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 06:59:32 GMT"}],"updateDate":"2024-07-18","timestamp":1720078759000,"abstract":"  High myopia significantly increases the risk of irreversible vision loss.\nTraditional perimetry-based visual field (VF) assessment provides systematic\nquantification of visual loss but it is subjective and time-consuming.\nConsequently, machine learning models utilizing fundus photographs to estimate\nVF have emerged as promising alternatives. However, due to the high variability\nand the limited availability of VF data, existing VF estimation models fail to\ngeneralize well, particularly when facing out-of-distribution data across\ndiverse centers and populations. To tackle this challenge, we propose a novel,\nparameter-efficient framework to enhance the generalized robustness of VF\nestimation on both in- and out-of-distribution data. Specifically, we design a\nRefinement-by-Denoising (RED) module for feature refinement and adaptation from\npretrained vision models, aiming to learn high-entropy feature representations\nand to mitigate the domain gap effectively and efficiently. Through independent\nvalidation on two distinct real-world datasets from separate centers, our\nmethod significantly outperforms existing approaches in RMSE, MAE and\ncorrelation coefficient for both internal and external validation. Our proposed\nframework benefits both in- and out-of-distribution VF estimation, offering\nsignificant clinical implications and potential utility in real-world\nophthalmic practices.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}