{"id":"2407.17721","title":"A Two-Stage Imaging Framework Combining CNN and Physics-Informed Neural\n  Networks for Full-Inverse Tomography: A Case Study in Electrical Impedance\n  Tomography (EIT)","authors":"Xuanxuan Yang (1 and 2), Yangming Zhang (1), Haofeng Chen (1 and 2),\n  Gang Ma (2), Xiaojie Wang (1) ((1) the Institute of Intelligent Machines,\n  Chinese Academy of Sciences, (2) University of Science and Technology of\n  China)","authorsParsed":[["Yang","Xuanxuan","","1 and 2"],["Zhang","Yangming","","1 and 2"],["Chen","Haofeng","","1 and 2"],["Ma","Gang",""],["Wang","Xiaojie",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 02:48:22 GMT"}],"updateDate":"2024-07-26","timestamp":1721875702000,"abstract":"  Physics-Informed Neural Networks (PINNs) are a machine learning technique for\nsolving partial differential equations (PDEs) by incorporating PDEs as loss\nterms in neural networks and minimizing the loss function during training.\nTomographic imaging, a method to reconstruct internal properties from external\nmeasurement data, is highly complex and ill-posed, making it an inverse\nproblem. Recently, PINNs have shown significant potential in computational\nfluid dynamics (CFD) and have advantages in solving inverse problems. However,\nexisting research has primarily focused on semi-inverse Electrical Impedance\nTomography (EIT), where internal electric potentials are accessible. The\npractical full inverse EIT problem, where only boundary voltage measurements\nare available, remains challenging. To address this, we propose a two-stage\nhybrid learning framework combining Convolutional Neural Networks (CNNs) and\nPINNs to solve the full inverse EIT problem. This framework integrates\ndata-driven and model-driven approaches, combines supervised and unsupervised\nlearning, and decouples the forward and inverse problems within the PINN\nframework in EIT. Stage I: a U-Net constructs an end-to-end mapping from\nboundary voltage measurements to the internal potential distribution using\nsupervised learning. Stage II: a Multilayer Perceptron (MLP)-based PINN takes\nthe predicted internal potentials as input to solve for the conductivity\ndistribution through unsupervised learning.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}