{"id":"2407.18357","title":"Needle Segmentation Using GAN: Restoring Thin Instrument Visibility in\n  Robotic Ultrasound","authors":"Zhongliang Jiang, Xuesong Li, Xiangyu Chu, Angelos Karlas, Yuan Bi,\n  Yingsheng Cheng, K. W. Samuel Au, Nassir Navab","authorsParsed":[["Jiang","Zhongliang",""],["Li","Xuesong",""],["Chu","Xiangyu",""],["Karlas","Angelos",""],["Bi","Yuan",""],["Cheng","Yingsheng",""],["Au","K. W. Samuel",""],["Navab","Nassir",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 19:41:56 GMT"}],"updateDate":"2024-07-29","timestamp":1721936516000,"abstract":"  Ultrasound-guided percutaneous needle insertion is a standard procedure\nemployed in both biopsy and ablation in clinical practices. However, due to the\ncomplex interaction between tissue and instrument, the needle may deviate from\nthe in-plane view, resulting in a lack of close monitoring of the percutaneous\nneedle. To address this challenge, we introduce a robot-assisted ultrasound\n(US) imaging system designed to seamlessly monitor the insertion process and\nautonomously restore the visibility of the inserted instrument when\nmisalignment happens. To this end, the adversarial structure is presented to\nencourage the generation of segmentation masks that align consistently with the\nground truth in high-order space. This study also systematically investigates\nthe effects on segmentation performance by exploring various training loss\nfunctions and their combinations. When misalignment between the probe and the\npercutaneous needle is detected, the robot is triggered to perform transverse\nsearching to optimize the positional and rotational adjustment to restore\nneedle visibility. The experimental results on ex-vivo porcine samples\ndemonstrate that the proposed method can precisely segment the percutaneous\nneedle (with a tip error of $0.37\\pm0.29mm$ and an angle error of $1.19\\pm\n0.29^{\\circ}$). Furthermore, the needle appearance can be successfully restored\nunder the repositioned probe pose in all 45 trials, with repositioning errors\nof $1.51\\pm0.95mm$ and $1.25\\pm0.79^{\\circ}$. from latex to text with math\nsymbols\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}