{"id":"2407.16895","title":"(Unfair) Norms in Fairness Research: A Meta-Analysis","authors":"Jennifer Chien, A. Stevie Bergman, Kevin R. McKee, Nenad Tomasev,\n  Vinodkumar Prabhakaran, Rida Qadri, Nahema Marchal, William Isaac","authorsParsed":[["Chien","Jennifer",""],["Bergman","A. Stevie",""],["McKee","Kevin R.",""],["Tomasev","Nenad",""],["Prabhakaran","Vinodkumar",""],["Qadri","Rida",""],["Marchal","Nahema",""],["Isaac","William",""]],"versions":[{"version":"v1","created":"Mon, 17 Jun 2024 17:14:47 GMT"}],"updateDate":"2024-07-25","timestamp":1718644487000,"abstract":"  Algorithmic fairness has emerged as a critical concern in artificial\nintelligence (AI) research. However, the development of fair AI systems is not\nan objective process. Fairness is an inherently subjective concept, shaped by\nthe values, experiences, and identities of those involved in research and\ndevelopment. To better understand the norms and values embedded in current\nfairness research, we conduct a meta-analysis of algorithmic fairness papers\nfrom two leading conferences on AI fairness and ethics, AIES and FAccT,\ncovering a final sample of 139 papers over the period from 2018 to 2022. Our\ninvestigation reveals two concerning trends: first, a US-centric perspective\ndominates throughout fairness research; and second, fairness studies exhibit a\nwidespread reliance on binary codifications of human identity (e.g.,\n\"Black/White\", \"male/female\"). These findings highlight how current research\noften overlooks the complexities of identity and lived experiences, ultimately\nfailing to represent diverse global contexts when defining algorithmic bias and\nfairness. We discuss the limitations of these research design choices and offer\nrecommendations for fostering more inclusive and representative approaches to\nfairness in AI systems, urging a paradigm shift that embraces nuanced, global\nunderstandings of human identity and values.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"UV-0LmSh1KNuw439fVc_oNr5RX_IGwct6q7Praiya-c","pdfSize":"9380723"}
