{"id":"2407.18015","title":"Uncertainty Visualization of Critical Points of 2D Scalar Fields for\n  Parametric and Nonparametric Probabilistic Models","authors":"Tushar M. Athawale, Zhe Wang, David Pugmire, Kenneth Moreland, Qian\n  Gong, Scott Klasky, Chris R. Johnson, Paul Rosen","authorsParsed":[["Athawale","Tushar M.",""],["Wang","Zhe",""],["Pugmire","David",""],["Moreland","Kenneth",""],["Gong","Qian",""],["Klasky","Scott",""],["Johnson","Chris R.",""],["Rosen","Paul",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 13:07:48 GMT"}],"updateDate":"2024-07-26","timestamp":1721912868000,"abstract":"  This paper presents a novel end-to-end framework for closed-form computation\nand visualization of critical point uncertainty in 2D uncertain scalar fields.\nCritical points are fundamental topological descriptors used in the\nvisualization and analysis of scalar fields. The uncertainty inherent in data\n(e.g., observational and experimental data, approximations in simulations, and\ncompression), however, creates uncertainty regarding critical point positions.\nUncertainty in critical point positions, therefore, cannot be ignored, given\ntheir impact on downstream data analysis tasks. In this work, we study\nuncertainty in critical points as a function of uncertainty in data modeled\nwith probability distributions. Although Monte Carlo (MC) sampling techniques\nhave been used in prior studies to quantify critical point uncertainty, they\nare often expensive and are infrequently used in production-quality\nvisualization software. We, therefore, propose a new end-to-end framework to\naddress these challenges that comprises a threefold contribution. First, we\nderive the critical point uncertainty in closed form, which is more accurate\nand efficient than the conventional MC sampling methods. Specifically, we\nprovide the closed-form and semianalytical (a mix of closed-form and MC\nmethods) solutions for parametric (e.g., uniform, Epanechnikov) and\nnonparametric models (e.g., histograms) with finite support. Second, we\naccelerate critical point probability computations using a parallel\nimplementation with the VTK-m library, which is platform portable. Finally, we\ndemonstrate the integration of our implementation with the ParaView software\nsystem to demonstrate near-real-time results for real datasets.\n","subjects":["Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}