{"id":"2407.21659","title":"Defending Jailbreak Attack in VLMs via Cross-modality Information\n  Detector","authors":"Yue Xu and Xiuyuan Qi and Zhan Qin and Wenjie Wang","authorsParsed":[["Xu","Yue",""],["Qi","Xiuyuan",""],["Qin","Zhan",""],["Wang","Wenjie",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:02:46 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 12:22:28 GMT"}],"updateDate":"2024-08-02","timestamp":1722438166000,"abstract":"  Vision Language Models (VLMs) extend the capacity of LLMs to comprehensively\nunderstand vision information, achieving remarkable performance in many\nvision-centric tasks. Despite that, recent studies have shown that these models\nare susceptible to jailbreak attacks, which refer to an exploitative technique\nwhere malicious users can break the safety alignment of the target model and\ngenerate misleading and harmful answers. This potential threat is caused by\nboth the inherent vulnerabilities of LLM and the larger attack scope introduced\nby vision input. To enhance the security of VLMs against jailbreak attacks,\nresearchers have developed various defense techniques. However, these methods\neither require modifications to the model's internal structure or demand\nsignificant computational resources during the inference phase. Multimodal\ninformation is a double-edged sword. While it increases the risk of attacks, it\nalso provides additional data that can enhance safeguards. Inspired by this, we\npropose $\\underline{\\textbf{C}}$ross-modality\n$\\underline{\\textbf{I}}$nformation\n$\\underline{\\textbf{DE}}$tecto$\\underline{\\textbf{R}}$ ($\\textit{CIDER})$, a\nplug-and-play jailbreaking detector designed to identify maliciously perturbed\nimage inputs, utilizing the cross-modal similarity between harmful queries and\nadversarial images. This simple yet effective cross-modality information\ndetector, $\\textit{CIDER}$, is independent of the target VLMs and requires less\ncomputation cost. Extensive experimental results demonstrate the effectiveness\nand efficiency of $\\textit{CIDER}$, as well as its transferability to both\nwhite-box and black-box VLMs.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}