{"id":"2407.05643","title":"Spatial Non-Stationary Dual-Wideband Channel Estimation for XL-MIMO\n  Systems","authors":"Anzheng Tang, Jun-Bo Wang, Yijin Pan, Tuo Wu, Chuanwen Chang, Yijian\n  Chen, Hongkang Yu, and Maged Elkashlan","authorsParsed":[["Tang","Anzheng",""],["Wang","Jun-Bo",""],["Pan","Yijin",""],["Wu","Tuo",""],["Chang","Chuanwen",""],["Chen","Yijian",""],["Yu","Hongkang",""],["Elkashlan","Maged",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 06:12:43 GMT"}],"updateDate":"2024-07-09","timestamp":1720419163000,"abstract":"  In this paper, we investigate the channel estimation problem for extremely\nlarge-scale multi-input and multi-output (XL-MIMO) systems, considering the\nspherical wavefront effect, spatially non-stationary (SnS) property, and\ndual-wideband effects. To accurately characterize the XL-MIMO channel, we first\nderive a novel spatial-and-frequency-domain channel model for XL-MIMO systems\nand carefully examine the channel characteristics in the angular-and-delay\ndomain. Based on the obtained channel representation, we formulate XL-MIMO\nchannel estimation as a Bayesian inference problem. To fully exploit the\nclustered sparsity of angular-and-delay channels and capture the inter-antenna\nand inter-subcarrier correlations, a Markov random field (MRF)-based\nhierarchical prior model is adopted. Meanwhile, to facilitate efficient channel\nreconstruction, we propose a sparse Bayesian learning (SBL) algorithm based on\napproximate message passing (AMP) with a unitary transformation. Tailored to\nthe MRF-based hierarchical prior model, the message passing equations are\nreformulated using structured variational inference, belief propagation, and\nmean-field rules. Finally, simulation results validate the convergence and\nsuperiority of the proposed algorithm over existing methods.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}