{"id":"2407.00696","title":"Graph in Graph Neural Network","authors":"Jiongshu Wang, Jing Yang, Jiankang Deng, Hatice Gunes, Siyang Song","authorsParsed":[["Wang","Jiongshu",""],["Yang","Jing",""],["Deng","Jiankang",""],["Gunes","Hatice",""],["Song","Siyang",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 13:37:06 GMT"}],"updateDate":"2024-07-02","timestamp":1719754626000,"abstract":"  Existing Graph Neural Networks (GNNs) are limited to process graphs each of\nwhose vertices is represented by a vector or a single value, limited their\nrepresenting capability to describe complex objects. In this paper, we propose\nthe first GNN (called Graph in Graph Neural (GIG) Network) which can process\ngraph-style data (called GIG sample) whose vertices are further represented by\ngraphs. Given a set of graphs or a data sample whose components can be\nrepresented by a set of graphs (called multi-graph data sample), our GIG\nnetwork starts with a GIG sample generation (GSG) module which encodes the\ninput as a \\textbf{GIG sample}, where each GIG vertex includes a graph. Then, a\nset of GIG hidden layers are stacked, with each consisting of: (1) a GIG\nvertex-level updating (GVU) module that individually updates the graph in every\nGIG vertex based on its internal information; and (2) a global-level GIG sample\nupdating (GGU) module that updates graphs in all GIG vertices based on their\nrelationships, making the updated GIG vertices become global context-aware.\nThis way, both internal cues within the graph contained in each GIG vertex and\nthe relationships among GIG vertices could be utilized for down-stream tasks.\nExperimental results demonstrate that our GIG network generalizes well for not\nonly various generic graph analysis tasks but also real-world multi-graph data\nanalysis (e.g., human skeleton video-based action recognition), which achieved\nthe new state-of-the-art results on 13 out of 14 evaluated datasets. Our code\nis publicly available at\nhttps://github.com/wangjs96/Graph-in-Graph-Neural-Network.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"scE9N18syPOqj7n7gZk-VDmVoKAGzfD4O5t17lMlxM8","pdfSize":"12047794"}
