{"id":"2407.17268","title":"Learning a phenomenological theory for contact-interactions between\n  motile cells from collision experiments","authors":"Tom Brandst\\\"atter, Emily Brieger, David B. Br\\\"uckner, Georg\n  Ladurner, Joachim R\\\"adler, Chase P. Broedersz","authorsParsed":[["Brandstätter","Tom",""],["Brieger","Emily",""],["Brückner","David B.",""],["Ladurner","Georg",""],["Rädler","Joachim",""],["Broedersz","Chase P.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 13:32:59 GMT"}],"updateDate":"2024-07-25","timestamp":1721827979000,"abstract":"  The migration behavior of colliding cells is critically determined by\ntransient contact-interactions. During these interactions, the motility\nmachinery, including the front-rear polarization of the cell, dynamically\nresponds to surface protein-mediated transmission of forces and biochemical\nsignals between cells. While biomolecular details of such contact-interactions\nare increasingly well understood, it remains unclear what biophysical\ninteraction mechanisms govern the cell-level dynamics of colliding cells and\nhow these mechanisms vary across cell types. Here, we develop a\nphenomenological theory based on eleven candidate contact-interaction\nmechanisms coupling cell position, shape, and polarity. Using high-throughput\nmicropattern experiments, we detect which of these phenomenological\ncontact-interactions captures the interaction behaviors of cells. We find that\nvarious cell types - ranging from mesenchymal to epithelial cells - are\naccurately captured by a single model with only two interaction mechanisms:\npolarity-protrusion coupling and polarity-polarity coupling. The qualitatively\ndifferent interaction behaviors of distinct cells, as well as cells subject to\nmolecular perturbations of surface protein-mediated signaling, can all be\nquantitatively captured by varying the strength and sign of the\npolarity-polarity coupling mechanism. Altogether, our data-driven\nphenomenological theory of cell-cell interactions reveals polarity-polarity\ncoupling as a versatile and general contact-interaction mechanism, which may\nunderlie diverse collective migration behavior of motile cells.\n","subjects":["Physics/Biological Physics","Condensed Matter/Soft Condensed Matter","Condensed Matter/Statistical Mechanics","Quantitative Biology/Cell Behavior"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"VcTfFM9Wg84GuslV5XD8bIM27lTQKquIkpp_6kx5ALI","pdfSize":"6885227"}
