{"id":"2407.17351","title":"Upscaling transport in heterogeneous media featuring local-scale\n  dispersion: flow channeling, macro-retardation and parameter prediction","authors":"Lian Zhou and Scott K. Hansen","authorsParsed":[["Zhou","Lian",""],["Hansen","Scott K.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 15:22:04 GMT"}],"updateDate":"2024-07-25","timestamp":1721834524000,"abstract":"  Many theoretical treatments of transport in heterogeneous Darcy flows\nconsider advection only. When local-scale dispersion is neglected,\nflux-weighting persists over time; mean Lagrangian and Eulerian flow velocity\ndistributions relate simply to each other and to the variance of the underlying\nhydraulic conductivity field. Local-scale dispersion complicates this\nrelationship, potentially causing initially flux-weighted solute to experience\nlower-velocity regions as well as Taylor-type macrodispersion due to transverse\nsolute movement between adjacent streamlines. To investigate the interplay of\nlocal-scale dispersion with conductivity log-variance, correlation length, and\nanisotropy, we perform a Monte Carlo study of flow and advective-dispersive\ntransport in spatially-periodic 2D Darcy flows in large-scale, high-resolution\nmultivariate Gaussian random conductivity fields. We observe flow channeling at\nall heterogeneity levels and quantify its extent. We find evidence for\nsubstantial effective retardation in the upscaled system, associated with\nincreased flow channeling, and observe limited Taylor-type macrodispersion,\nwhich we physically explain. A quasi-constant Lagrangian velocity is achieved\nwithin a short distance of release, allowing usage of a simplified\ncontinuous-time random walk (CTRW) model we previously proposed in which the\ntransition time distribution is understood as a temporal mapping of unit time\nin an equivalent system with no flow heterogeneity. The numerical data set is\nmodeled with such a CTRW; we show how dimensionless parameters defining the\nCTRW transition time distribution are predicted by dimensionless heterogeneity\nstatistics and provide empirical equations for this purpose.\n","subjects":["Physics/Fluid Dynamics","Condensed Matter/Statistical Mechanics","Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}