{"id":"2407.05180","title":"R-Trans -- A Recurrent Transformer Model for Clinical Feedback in\n  Surgical Skill Assessment","authors":"Julien Quarez, Matthew Elliot, Oscar Maccormac, Nawal Khan, Marc\n  Modat, Sebastien Ourselin, Jonathan Shapey, Alejandro Granados","authorsParsed":[["Quarez","Julien",""],["Elliot","Matthew",""],["Maccormac","Oscar",""],["Khan","Nawal",""],["Modat","Marc",""],["Ourselin","Sebastien",""],["Shapey","Jonathan",""],["Granados","Alejandro",""]],"versions":[{"version":"v1","created":"Mon, 22 Apr 2024 10:33:06 GMT"}],"updateDate":"2024-07-09","timestamp":1713781986000,"abstract":"  In surgical skill assessment, Objective Structured Assessments of Technical\nSkills (OSATS scores) and the Global Rating Scale (GRS) are established tools\nfor evaluating the performance of surgeons during training. These metrics,\ncoupled with feedback on their performance, enable surgeons to improve and\nachieve standards of practice. Recent studies on the open-source dataset\nJIGSAW, which contains both GRS and OSATS labels, have focused on regressing\nGRS scores from kinematic signals, video data, or a combination of both. In\nthis paper, we argue that regressing the GRS score, a unitless value, by itself\nis too restrictive, and variations throughout the surgical trial do not hold\nsignificant clinical meaning. To address this gap, we developed a recurrent\ntransformer model that outputs the surgeon's performance throughout their\ntraining session by relating the model's hidden states to five OSATS scores\nderived from kinematic signals. These scores are averaged and aggregated to\nproduce a GRS prediction, enabling assessment of the model's performance\nagainst the state-of-the-art (SOTA). We report Spearman's Correlation\nCoefficient (SCC), demonstrating that our model outperforms SOTA models for all\ntasks, except for Suturing under the leave-one-subject-out (LOSO) scheme (SCC\n0.68-0.89), while achieving comparable performance for suturing and across\ntasks under the leave-one-user-out (LOUO) scheme (SCC 0.45-0.68) and beating\nSOTA for Needle Passing (0.69). We argue that relating final OSATS scores to\nshort instances throughout a surgeon's procedure is more clinically meaningful\nthan a single GRS score. This approach also allows us to translate quantitative\npredictions into qualitative feedback, which is crucial for any automated\nsurgical skill assessment pipeline. A senior surgeon validated our model's\nbehaviour and agreed with the semi-supervised predictions 77 \\% (p = 0.006) of\nthe time.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}