{"id":"2407.07428","title":"A Conceptual Framework for API Refactoring in Enterprise Application\n  Architectures","authors":"Fabrizio Montesi, Marco Peressotti, Valentino Picotti, Olaf Zimmermann","authorsParsed":[["Montesi","Fabrizio",""],["Peressotti","Marco",""],["Picotti","Valentino",""],["Zimmermann","Olaf",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 07:32:16 GMT"}],"updateDate":"2024-07-11","timestamp":1720596736000,"abstract":"  Enterprise applications are often built as service-oriented architectures,\nwhere the individual services are designed to perform specific functions and\ninteract with each other by means of well-defined APIs (Application Programming\nInterfaces). The architecture of an enterprise application evolves over time,\nin order to adapt to changing business requirements. This evolution might\nrequire changes to the APIs offered by services, which can be achieved through\nappropriate API refactorings.\n  Previous studies on API refactoring focused on the effects on API\ndefinitions, with general considerations on related forces and smells. So far,\ninstead, the development strategy for realising these refactorings has received\nlittle attention. This paper addresses exactly this aspect.\n  We introduce a conceptual framework for the implementation of API\nrefactorings. Our framework elicits that there are important trade-offs and\nchoices, which significantly affect the efficiency, maintainability, and\nisolation properties of the resulting architecture. We validate our framework\nby implementing several refactorings that introduce established API patterns\nwith different choices, which illustrates the guiding principles offered by our\nframework. Our work also elicits, for the first time, how certain programming\nlanguage features can reduce friction in applying API refactoring and open up\nmore architectural choices.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Programming Languages"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}