{"id":"2407.02871","title":"LMBF-Net: A Lightweight Multipath Bidirectional Focal Attention Network\n  for Multifeatures Segmentation","authors":"Tariq M Khan, Shahzaib Iqbal, Syed S. Naqvi, Imran Razzak, Erik\n  Meijering","authorsParsed":[["Khan","Tariq M",""],["Iqbal","Shahzaib",""],["Naqvi","Syed S.",""],["Razzak","Imran",""],["Meijering","Erik",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 07:37:09 GMT"}],"updateDate":"2024-07-04","timestamp":1719992229000,"abstract":"  Retinal diseases can cause irreversible vision loss in both eyes if not\ndiagnosed and treated early. Since retinal diseases are so complicated, retinal\nimaging is likely to show two or more abnormalities. Current deep learning\ntechniques for segmenting retinal images with many labels and attributes have\npoor detection accuracy and generalisability. This paper presents a multipath\nconvolutional neural network for multifeature segmentation. The proposed\nnetwork is lightweight and spatially sensitive to information. A patch-based\nimplementation is used to extract local image features, and focal modulation\nattention blocks are incorporated between the encoder and the decoder for\nimproved segmentation. Filter optimisation is used to prevent filter overlaps\nand speed up model convergence. A combination of convolution operations and\ngroup convolution operations is used to reduce computational costs. This is the\nfirst robust and generalisable network capable of segmenting multiple features\nof fundus images (including retinal vessels, microaneurysms, optic discs,\nhaemorrhages, hard exudates, and soft exudates). The results of our\nexperimental evaluation on more than ten publicly available datasets with\nmultiple features show that the proposed network outperforms recent networks\ndespite having a small number of learnable parameters.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}