{"id":"2407.17372","title":"Climate Change in Hell: Long-Term Variation in Transits of the\n  Evaporating Planet K2-22b","authors":"E. Gaidos, H. Parviainen, E. Esparza-Borges, A. Fukui, K. Isogai, K.\n  Kawauchi, J. de Leon, M. Mori, F. Murgas, N. Narita, E. Palle, and N.\n  Watanabe","authorsParsed":[["Gaidos","E.",""],["Parviainen","H.",""],["Esparza-Borges","E.",""],["Fukui","A.",""],["Isogai","K.",""],["Kawauchi","K.",""],["de Leon","J.",""],["Mori","M.",""],["Murgas","F.",""],["Narita","N.",""],["Palle","E.",""],["Watanabe","N.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 15:50:38 GMT"}],"updateDate":"2024-08-28","timestamp":1721836238000,"abstract":"  Context: Rocky planets on ultra-short period orbits can have surface magma\noceans and rock-vapour atmospheres in which dust can condense. Observations of\nthat dust can inform about the composition surface conditions on these objects.\nAims: We constrain the properties and long-term (decade) behaviour of the\ntransiting dust cloud from the \"evaporating\" planet K2-22b. Methods: We\nobserved K2-22b around 40 predicted transits with MuSCAT ground-based\nmulti-optical channel imagers, and complemented these data with long-term\nmonitoring by the ground-based ATLAS (2018-2024) and space-based TESS\n(2021-2023) surveys. Results: We detected signals during 7 transits, none of\nwhich showed significant wavelength dependence. The expected number of\nMuSCAT-detected transits is >=22, indicating a decline in mean transit depth\nsince the K2 discovery observations in 2014. Conclusions: Lack of significant\nwavelength dependence indicates that dust grains are large or the cloud is\noptically thick. Long-term trends of depth could be due to a magnetic cycle on\nthe host star or overturn of the planet's dayside surface magma ocean. The\npossibility that K2-22b is disappearing altogether is ruled out by the\nstability of the transit ephemeris against non-gravitational forces, which\nconstrains the mass to be at least comparable to Ceres.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}