{"id":"2407.19474","title":"Visual Riddles: a Commonsense and World Knowledge Challenge for Large\n  Vision and Language Models","authors":"Nitzan Bitton-Guetta, Aviv Slobodkin, Aviya Maimon, Eliya Habba, Royi\n  Rassin, Yonatan Bitton, Idan Szpektor, Amir Globerson, Yuval Elovici","authorsParsed":[["Bitton-Guetta","Nitzan",""],["Slobodkin","Aviv",""],["Maimon","Aviya",""],["Habba","Eliya",""],["Rassin","Royi",""],["Bitton","Yonatan",""],["Szpektor","Idan",""],["Globerson","Amir",""],["Elovici","Yuval",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 11:56:03 GMT"}],"updateDate":"2024-07-30","timestamp":1722167763000,"abstract":"  Imagine observing someone scratching their arm; to understand why, additional\ncontext would be necessary. However, spotting a mosquito nearby would\nimmediately offer a likely explanation for the person's discomfort, thereby\nalleviating the need for further information. This example illustrates how\nsubtle visual cues can challenge our cognitive skills and demonstrates the\ncomplexity of interpreting visual scenarios. To study these skills, we present\nVisual Riddles, a benchmark aimed to test vision and language models on visual\nriddles requiring commonsense and world knowledge. The benchmark comprises 400\nvisual riddles, each featuring a unique image created by a variety of\ntext-to-image models, question, ground-truth answer, textual hint, and\nattribution. Human evaluation reveals that existing models lag significantly\nbehind human performance, which is at 82\\% accuracy, with Gemini-Pro-1.5\nleading with 40\\% accuracy. Our benchmark comes with automatic evaluation tasks\nto make assessment scalable. These findings underscore the potential of Visual\nRiddles as a valuable resource for enhancing vision and language models'\ncapabilities in interpreting complex visual scenarios.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}