{"id":"2407.05121","title":"SPIRou monitoring of the protostar V347 Aur: binarity, magnetic fields,\n  pulsed dynamo and accretion","authors":"J.-F. Donati, P.I. Cristofari, A. Carmona, K. Grankin","authorsParsed":[["Donati","J. -F.",""],["Cristofari","P. I.",""],["Carmona","A.",""],["Grankin","K.",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 16:15:31 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 13:31:21 GMT"}],"updateDate":"2024-09-04","timestamp":1720282531000,"abstract":"  We present in this paper an analysis of near-infrared observations of the\n0.3-Msun protostar V347 Aur collected with the SPIRou high-resolution\nspectropolarimeter and velocimeter at the 3.6-m Canada-France-Hawaii Telescope\nfrom October 2019 to April 2023. From a set of 79 unpolarized and circularly\npolarized spectra of V347 Aur to which we applied Least-Squares Deconvolution\n(LSD), we derived radial velocities and longitudinal fields, along with their\ntemporal variations over our monitoring campaign of 1258 d. Our data show that\nV347 Aur is an eccentric binary system with an orbital period 154.6$\\pm$0.7 d,\nexperiencing strong to extreme accretion events near periastron. The companion\nis a 29.0$\\pm$1.6-Mjup brown dwarf, a rare member of the brown dwarf desert of\nclose companions around M dwarfs. We detect weak longitudinal fields (<100 G)\nat the surface of V347 Aur, significantly weaker than those of more evolved\nprototypical T Tauri stars. These fields show small-amplitude rotational\nmodulation, indicating a mainly axisymmetric parent large-scale magnetic\ntopology, and larger fluctuations at half the orbital period, suggesting that\nwhat we dub a ``pulsed dynamo'' triggered by orbital motion and pulsed\naccretion operates in V347 Aur. Applying Zeeman-Doppler imaging to our\ncircularly polarised LSD profiles, we find that the large-scale field of V347\nAur is mainly toroidal for most of our observations, with the toroidal\ncomponent switching sign near periastron and apoastron. The weak large-scale\ndipole (~30 G) is not able to disrupt the disc beyond 1.3 Rstar even at the\nlowest accretion rates, implying longitudinally distributed (rather than\nlocalized) accretion at the surface of the protostar.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}