{"id":"2407.03572","title":"Core: Robust Factual Precision Scoring with Informative Sub-Claim\n  Identification","authors":"Zhengping Jiang, Jingyu Zhang, Nathaniel Weir, Seth Ebner, Miriam\n  Wanner, Kate Sanders, Daniel Khashabi, Anqi Liu and Benjamin Van Durme","authorsParsed":[["Jiang","Zhengping",""],["Zhang","Jingyu",""],["Weir","Nathaniel",""],["Ebner","Seth",""],["Wanner","Miriam",""],["Sanders","Kate",""],["Khashabi","Daniel",""],["Liu","Anqi",""],["Van Durme","Benjamin",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 01:51:38 GMT"}],"updateDate":"2024-07-08","timestamp":1720057898000,"abstract":"  Hallucinations -- the generation of untrue claims -- pose a challenge to the\napplication of large language models (LLMs) [1] thereby motivating the\ndevelopment of metrics to evaluate factual precision. We observe that popular\nmetrics using the Decompose-Then-Verify framework, such as FActScore [2], can\nbe manipulated by adding obvious or repetitive claims to artificially inflate\nscores. We expand the FActScore dataset to design and analyze factual precision\nmetrics, demonstrating that models can be trained to achieve high scores under\nexisting metrics through exploiting the issues we identify. This motivates our\nnew customizable plug-and-play subclaim selection component called Core, which\nfilters down individual subclaims according to their uniqueness and\ninformativeness. Metrics augmented by Core are substantially more robust as\nshown in head-to-head comparisons. We release an evaluation framework\nsupporting the modular use of Core (https://github.com/zipJiang/Core) and\nvarious decomposition strategies, and we suggest its adoption by the LLM\ncommunity.\n  [1] Hong et al., \"The Hallucinations Leaderboard -- An Open Effort to Measure\nHallucinations in Large Language Models\", arXiv:2404.05904v2 [cs.CL].\n  [2] Min et al., \"FActScore: Fine-grained Atomic Evaluation of Factual\nPrecision in Long Form Text Generation\", arXiv:2305.14251v2 [cs.CL].\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xw5TSDh8Bu8ENYfkt10jvnOlWxo-94yj_jT0zozKGdI","pdfSize":"1300239"}
