{"id":"2407.17597","title":"Suppressed Cosmic Ray Energy Densities in Molecular Clouds From\n  Streaming Instability-Regulated Transport","authors":"Margot Fitz Axen, Stella Offner, Phillip F. Hopkins, Mark R. Krumholz,\n  Michael Y. Grudic","authorsParsed":[["Axen","Margot Fitz",""],["Offner","Stella",""],["Hopkins","Phillip F.",""],["Krumholz","Mark R.",""],["Grudic","Michael Y.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 19:04:52 GMT"}],"updateDate":"2024-07-26","timestamp":1721847892000,"abstract":"  Cosmic rays (CRs) are the primary driver of ionization in star forming\nmolecular clouds (MCs). Despite their potential impacts on gas dynamics and\nchemistry, no simulations of star cluster formation following the creation of\nindividual stars have included explicit cosmic ray transport (CRT) to date. We\nconduct the first numerical simulations following the collapse of a $2000\nM_{\\odot}$ MC and the subsequent star formation including CRT using the\nSTARFORGE framework implemented in the GIZMO code. We show that when\nCR-transport is streaming-dominated, the CR energy in the cloud is strongly\nattenuated due to energy losses from the streaming instability. Consequently,\nin a Milky Way like environment the median CR ionization rate (CRIR) in the\ncloud is low ($ \\zeta \\lesssim 2 \\times 10^{-19} \\rm s^{-1}$) during the main\nstar forming epoch of the calculation and the impact of CRs on the star\nformation in the cloud is limited. However, in high-CR environments, the CR\ndistribution in the cloud is elevated ($\\zeta \\lesssim 6 \\times 10^{-18}$), and\nthe relatively higher CR pressure outside the cloud causes slightly earlier\ncloud collapse and increases the star formation efficiency (SFE) by $50 \\%$ to\n$\\sim 13 \\%$. The initial mass function (IMF) is similar in all cases except\nwith possible variations in a high-CR environment. Further studies are needed\nto explain the range of ionization rates observed in MCs and explore star\nformation in extreme CR environments.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}