{"id":"2407.14804","title":"WiFaKey: Generating Cryptographic Keys from Face in the Wild","authors":"Xingbo Dong, Hui Zhang, Yen Lung Lai, Zhe Jin, Junduan Huang, Wenxiong\n  Kang, Andrew Beng Jin Teoh","authorsParsed":[["Dong","Xingbo",""],["Zhang","Hui",""],["Lai","Yen Lung",""],["Jin","Zhe",""],["Huang","Junduan",""],["Kang","Wenxiong",""],["Teoh","Andrew Beng Jin",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 08:31:06 GMT"}],"updateDate":"2024-07-23","timestamp":1721464266000,"abstract":"  Deriving a unique cryptographic key from biometric measurements is a\nchallenging task due to the existing noise gap between the biometric\nmeasurements and error correction coding. Additionally, privacy and security\nconcerns arise as biometric measurements are inherently linked to the user.\nBiocryptosystems represent a key branch of solutions aimed at addressing these\nissues. However, many existing bio-cryptosystems rely on handcrafted feature\nextractors and error correction codes (ECC), often leading to performance\ndegradation. To address these challenges and improve the reliability of\nbiometric measurements, we propose a novel biometric cryptosystem named\nWiFaKey, for generating cryptographic keys from face in unconstrained settings.\nSpeciffcally, WiFaKey ffrst introduces an adaptive random masking-driven\nfeature transformation pipeline, AdaMTrans. AdaMTrans effectively quantizes and\nbinarizes realvalued features and incorporates an adaptive random masking\nscheme to align the bit error rate with error correction requirements, thereby\nmitigating the noise gap. Besides, WiFaKey incorporates a supervised\nlearning-based neural decoding scheme called Neural-MS decoder, which delivers\na more robust error correction performance with less iteration than\nnon-learning decoders, thereby alleviating the performance degradation. We\nevaluated WiFaKey using widely adopted face feature extractors on six large\nunconstrained and two constrained datasets. On the LFW dataset, WiFaKey\nachieved an average Genuine Match Rate of 85.45% and 85.20% at a 0% False Match\nRate for MagFace and AdaFace features, respectively. Our comprehensive\ncomparative analysis shows a signiffcant performance improvement of WiFaKey.\nThe source code of our work is available at github.com/xingbod/WiFaKey.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}