{"id":"2407.04778","title":"Phasing out of Darkness: From Sterile Neutrino Dark Matter to Neutrino\n  Masses via Time-Dependent Mixing","authors":"Florian Goertz, Maya Hager, Giorgio Laverda, Javier Rubio","authorsParsed":[["Goertz","Florian",""],["Hager","Maya",""],["Laverda","Giorgio",""],["Rubio","Javier",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-09","timestamp":1720202403000,"abstract":"  Sterile neutrinos are a compelling candidate for generating neutrino masses\nand for elucidating the nature of dark matter. Astrophysical X-ray constraints\non sterile neutrino dark matter decays, however, largely exclude the\nactive-sterile mixing required to produce simultaneously the correct\nleft-handed neutrino spectrum and keV-scale right-handed neutrino dark matter\nwithin a type-I seesaw framework. In this study, we demonstrate how these X-ray\nconstraints can be circumvented through a time-dependent approach, thereby\nreviving a broad range of active-sterile mixing scenarios. Our minimal model\nincorporates two right-handed neutrinos, which form a two-component dark matter\ncandidate, and an auxiliary scalar field that experiences a very late and still\nongoing phase transition, leading to the spontaneous breaking of a global $\nU(1)_N $ symmetry. Prior to this phase transition, only the right-handed\nneutrinos are massive, while the left-handed neutrinos remain massless because\nof the scalar field's vanishing expectation value. As the phase transition\ndevelops, the growing expectation value of the scalar field increases the\nactive-sterile mixing, thereby opening dark matter decay channels and inducing\nneutrino masses. The time dependence allows the scenario to be consistent with\nX-ray constraints as well as current measurements of left-handed neutrino\nmasses. The anticipated level of active-sterile mixing today is within the\ndetection capabilities of the forthcoming TRISTAN (KATRIN) tritium-beta decay\nproject. Additionally, cosmological surveys such as DESI or EUCLID and\nsupernova neutrino observations can test the prediction of massless left-handed\nneutrinos prior to the phase transition.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}