{"id":"2407.02594","title":"The DBL Survey I: discovery of 34 double-lined double white dwarf\n  binaries","authors":"James Munday, Ingrid Pelisoli, P. E. Tremblay, T. R. Marsh, Gijs\n  Nelemans, Antoine B\\'edard, Silvia Toonen, Elm\\'e Breedt, Tim Cunningham,\n  Mairi W. O'Brien, Harry Dawson","authorsParsed":[["Munday","James",""],["Pelisoli","Ingrid",""],["Tremblay","P. E.",""],["Marsh","T. R.",""],["Nelemans","Gijs",""],["Bédard","Antoine",""],["Toonen","Silvia",""],["Breedt","Elmé",""],["Cunningham","Tim",""],["O'Brien","Mairi W.",""],["Dawson","Harry",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 18:30:56 GMT"},{"version":"v2","created":"Thu, 4 Jul 2024 19:44:09 GMT"}],"updateDate":"2024-07-08","timestamp":1719945056000,"abstract":"  We present the first discoveries of the double-lined double white dwarf (DBL)\nsurvey that targets over-luminous sources with respect to the canonical white\ndwarf cooling sequence according to a set of well-defined criteria. The primary\ngoal of the DBL survey is to identify compact double white dwarf binary star\nsystems from a unique spectral detection of both stars, which then enables a\nprecise quantification of the atmospheric parameters and radial velocity\nvariability of a system. Our search of 117 candidates that were randomly\nselected from a magnitude limited sample of 399 yielded a 29% detection\nefficiency with 34 systems exhibiting a double-lined signature. A further 38\nsystems show strong evidence of being single-lined or potentially-double-lined\ndouble white dwarf binaries and 7 single-lined sources from the full observed\nsample are radial velocity variable. The 45 remaining candidates appear as a\nsingle WD with no companion or a non-DA white dwarf, bringing the efficiency of\ndetecting binaries to 62%. Atmospheric fitting of all double-lined systems\nreveals a large fraction that have two similar mass components that combine to\na total mass of 1.0-1.3 solar masses - a class of double white dwarf binaries\nthat may undergo a sub-Chandrasekhar mass type Ia detonation or merge to form a\nmassive O/Ne WD, although orbital periods are required to infer on which\ntimescales. One double-lined system located 49pc away, WDJ181058.67+311940.94,\nis super-Chandrasekhar mass, making it the second such double white dwarf\nbinary to be discovered.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}