{"id":"2407.17571","title":"Diffusion Models for Multi-Task Generative Modeling","authors":"Changyou Chen, Han Ding, Bunyamin Sisman, Yi Xu, Ouye Xie, Benjamin Z.\n  Yao, Son Dinh Tran, Belinda Zeng","authorsParsed":[["Chen","Changyou",""],["Ding","Han",""],["Sisman","Bunyamin",""],["Xu","Yi",""],["Xie","Ouye",""],["Yao","Benjamin Z.",""],["Tran","Son Dinh",""],["Zeng","Belinda",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 18:04:17 GMT"}],"updateDate":"2024-07-26","timestamp":1721844257000,"abstract":"  Diffusion-based generative modeling has been achieving state-of-the-art\nresults on various generation tasks. Most diffusion models, however, are\nlimited to a single-generation modeling. Can we generalize diffusion models\nwith the ability of multi-modal generative training for more generalizable\nmodeling? In this paper, we propose a principled way to define a diffusion\nmodel by constructing a unified multi-modal diffusion model in a common\ndiffusion space. We define the forward diffusion process to be driven by an\ninformation aggregation from multiple types of task-data, e.g., images for a\ngeneration task and labels for a classification task. In the reverse process,\nwe enforce information sharing by parameterizing a shared backbone denoising\nnetwork with additional modality-specific decoder heads. Such a structure can\nsimultaneously learn to generate different types of multi-modal data with a\nmulti-task loss, which is derived from a new multi-modal variational lower\nbound that generalizes the standard diffusion model. We propose several\nmultimodal generation settings to verify our framework, including image\ntransition, masked-image training, joint image-label and joint\nimage-representation generative modeling. Extensive experimental results on\nImageNet indicate the effectiveness of our framework for various multi-modal\ngenerative modeling, which we believe is an important research direction worthy\nof more future explorations.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hYg6IueOqwJh0kD8lBkjnES5ILZgnTforau0BO7zu9g","pdfSize":"15366427"}
