{"id":"2407.13017","title":"Size, albedo and rotational period of the Hayabusa2# target (98943) 2001\n  CC21","authors":"S. Fornasier, E. Dotto, P. Panuzzo, M. Delb\\`o, I. Belskaya, Y.\n  Krugly, R. Inasaridze, M. A. Barucci, D. Perna, J. Brucato, M. Birlan","authorsParsed":[["Fornasier","S.",""],["Dotto","E.",""],["Panuzzo","P.",""],["Delbò","M.",""],["Belskaya","I.",""],["Krugly","Y.",""],["Inasaridze","R.",""],["Barucci","M. A.",""],["Perna","D.",""],["Brucato","J.",""],["Birlan","M.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 21:13:48 GMT"}],"updateDate":"2024-08-07","timestamp":1721250828000,"abstract":"  This study aims to determine the size, albedo and rotational period of\n(98943) 2001 CC21, target of the Hayabusa2 extended mission, using thermal data\nfrom the Spitzer Space telescope and ground based observations. The Spitzer\ndata were acquired with the Infrared Spectrograph in the 6-38 micron range,\nreduced using the Spitzer pipeline and modeled with the Near Earth Asteroid\nThermal Modeling to determine the asteroid size and albedo. The absolute\nmagnitude and the rotational period were determined thanks to new observations\ncarried out at the 3.5m New Technology Telescope, at the 1.2m Observatoire de\nHaute Provence, and at the 0.7m Abastumani telescope. Three complete\nlightcurves were obtained in 2023-2024 at the last mentioned telescope. We\ndetermine an absolute magnitude of H=18.94$\\pm$0.05, and a rotational period of\n5.02124$\\pm$0.00001 hours, with a large lightcurve amplitude of $\\sim$ 0.8 mag.\nat a phase angle of 22$^o$, indicating a very elongated shape with estimated\na/b semiaxis ratio $\\geq$ 1.7, or a close-contact binary body. The emissivity\nof 2001 CC21 is consistent with that of silicates, and its albedo is\n21.6$\\pm$1.6 %. Finally, the spherical-equivalent diameter of 2001 CC21 is\n465$\\pm$15 m. The albedo value and emissivity here determined, coupled with\nresults from polarimetry and spectroscopy from the literature, confirm that\n2001 CC21 is an S-complex asteroid, and not a L-type, as previously suggested.\nThe size of 2001 CC21 is less than 500 m, which is smaller than its first size\nestimation ($\\sim$ 700 m). These results are relevant in preparation of the\nobserving strategy of 2001 CC21 by Hayabusa2 extended mission.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}