{"id":"2407.05047","title":"MFE-ETP: A Comprehensive Evaluation Benchmark for Multi-modal Foundation\n  Models on Embodied Task Planning","authors":"Min Zhang, Jianye Hao, Xian Fu, Peilong Han, Hao Zhang, Lei Shi,\n  Hongyao Tang, Yan Zheng","authorsParsed":[["Zhang","Min",""],["Hao","Jianye",""],["Fu","Xian",""],["Han","Peilong",""],["Zhang","Hao",""],["Shi","Lei",""],["Tang","Hongyao",""],["Zheng","Yan",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 11:07:18 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 08:10:39 GMT"}],"updateDate":"2024-07-31","timestamp":1720264038000,"abstract":"  In recent years, Multi-modal Foundation Models (MFMs) and Embodied Artificial\nIntelligence (EAI) have been advancing side by side at an unprecedented pace.\nThe integration of the two has garnered significant attention from the AI\nresearch community. In this work, we attempt to provide an in-depth and\ncomprehensive evaluation of the performance of MFM s on embodied task planning,\naiming to shed light on their capabilities and limitations in this domain. To\nthis end, based on the characteristics of embodied task planning, we first\ndevelop a systematic evaluation framework, which encapsulates four crucial\ncapabilities of MFMs: object understanding, spatio-temporal perception, task\nunderstanding, and embodied reasoning. Following this, we propose a new\nbenchmark, named MFE-ETP, characterized its complex and variable task\nscenarios, typical yet diverse task types, task instances of varying\ndifficulties, and rich test case types ranging from multiple embodied question\nanswering to embodied task reasoning. Finally, we offer a simple and\neasy-to-use automatic evaluation platform that enables the automated testing of\nmultiple MFMs on the proposed benchmark. Using the benchmark and evaluation\nplatform, we evaluated several state-of-the-art MFMs and found that they\nsignificantly lag behind human-level performance. The MFE-ETP is a\nhigh-quality, large-scale, and challenging benchmark relevant to real-world\ntasks.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}