{"id":"2407.18219","title":"Recursive Introspection: Teaching Language Model Agents How to\n  Self-Improve","authors":"Yuxiao Qu, Tianjun Zhang, Naman Garg, Aviral Kumar","authorsParsed":[["Qu","Yuxiao",""],["Zhang","Tianjun",""],["Garg","Naman",""],["Kumar","Aviral",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 17:35:59 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 17:50:27 GMT"}],"updateDate":"2024-07-29","timestamp":1721928959000,"abstract":"  A central piece in enabling intelligent agentic behavior in foundation models\nis to make them capable of introspecting upon their behavior, reasoning, and\ncorrecting their mistakes as more computation or interaction is available. Even\nthe strongest proprietary large language models (LLMs) do not quite exhibit the\nability of continually improving their responses sequentially, even in\nscenarios where they are explicitly told that they are making a mistake. In\nthis paper, we develop RISE: Recursive IntroSpEction, an approach for\nfine-tuning LLMs to introduce this capability, despite prior work hypothesizing\nthat this capability may not be possible to attain. Our approach prescribes an\niterative fine-tuning procedure, which attempts to teach the model how to alter\nits response after having executed previously unsuccessful attempts to solve a\nhard test-time problem, with optionally additional environment feedback. RISE\nposes fine-tuning for a single-turn prompt as solving a multi-turn Markov\ndecision process (MDP), where the initial state is the prompt. Inspired by\nprinciples in online imitation learning and reinforcement learning, we propose\nstrategies for multi-turn data collection and training so as to imbue an LLM\nwith the capability to recursively detect and correct its previous mistakes in\nsubsequent iterations. Our experiments show that RISE enables Llama2, Llama3,\nand Mistral models to improve themselves with more turns on math reasoning\ntasks, outperforming several single-turn strategies given an equal amount of\ninference-time computation. We also find that RISE scales well, often attaining\nlarger benefits with more capable models. Our analysis shows that RISE makes\nmeaningful improvements to responses to arrive at the correct solution for\nchallenging prompts, without disrupting one-turn abilities as a result of\nexpressing more complex distributions.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5qNJCYRa95GWhYw6i6nZXDEY6sN8QeMvaVm4q6QLTQU","pdfSize":"4684689","objectId":"0xc236da33c33d48b37dcdf7a23ab5833b948f4a85b796a769358e794bb74a639e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
