{"id":"2407.20239","title":"Landslide vulnerability analysis using frequency ratio (FR) model: a\n  study on Bandarban district, Bangladesh","authors":"Nafis Fuad, Javed Meandad, Ashraful Haque, Rukhsar Sultana, Sumaiya\n  Binte Anwar, Sharmin Sultana","authorsParsed":[["Fuad","Nafis",""],["Meandad","Javed",""],["Haque","Ashraful",""],["Sultana","Rukhsar",""],["Anwar","Sumaiya Binte",""],["Sultana","Sharmin",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:28:10 GMT"}],"updateDate":"2024-07-31","timestamp":1721060890000,"abstract":"  This study assesses landslide vulnerability in the Chittagong Hill Tracts\n(CHT), specifically focusing on Bandarban district in Southeast Bangladesh. By\nemploying a multidisciplinary approach, thirteen factors influencing landslides\nwere examined, including terrain features, land use, and environmental\nvariables. Utilizing the FR model and integrating various datasets such as DEM,\nsatellite images, and rainfall data, landslide susceptibility mapping was\nconducted. The analysis revealed that steep slopes, high elevations, specific\naspects, and curvature contribute significantly to landslide susceptibility.\nFactors like erosion, soil saturation, drainage density, and human activities\nwere also identified as key contributors. The study underscored the impact of\nland use changes and highlighted the stabilizing effect of vegetation cover.\nThe resulting Landslide Susceptibility Map (LSM) categorized the area into five\nsusceptibility zones. The model demonstrated a prediction accuracy of 76.47%,\nindicating its effectiveness in forecasting landslide occurrences.\nAdditionally, the study identified significant changes in the study area over\nthree decades, emphasizing the influence of human activities on slope\ninstability. These findings offer valuable insights for policymakers and\nland-use planners, emphasizing the importance of proactive measures to mitigate\nlandslide risks and ensure community safety. Incorporating these insights into\npolicy frameworks\n","subjects":["Computing Research Repository/Computers and Society","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}