{"id":"2407.01288","title":"The radio properties of z>3.5 quasars: Are most high-redshift radio-loud\n  active galactic nuclei obscured?","authors":"Alessandro Capetti (1) Barbara Balmaverde (1) ((1) INAF - Osservatorio\n  Astrofisico di Torino, Pino Torinese, Italy)","authorsParsed":[["Capetti","Alessandro",""],["Balmaverde","Barbara",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:43:04 GMT"}],"updateDate":"2024-07-02","timestamp":1719841384000,"abstract":"  We explore the radio properties of powerful (rest-frame luminosity\n$\\gtrsim10^{28}$ W Hz$^{-1}$ at 500 MHz) high-redshift (z > 3.5) quasars. The\naim of this study is to gain a better understanding of radio-loud sources at\nthe epoch when they reach the highest space density. We selected 29 radio-loud\nquasars at low radio frequencies (76 MHz). Their radio spectra, covering the\nrange from 76 MHz to 5 GHz, are generally well reproduced by a single power\nlaw. We created samples that were matched in radio luminosity at lower redshift\n(from z~1.3 to z~2.8) to investigate any spectral evolution. We find that the\nfraction of flat-spectrum radio quasars (FSRQs) strongly increases with\nredshift (from ~8% at z=1.2 to ~45% at z>3.5). This effect is also observed in\nquasars with lower luminosities (down to $\\sim 10^{27}$ W Hz$^{-1}$). The\nincrease in the fraction of FSRQs with redshift corresponds to a decrease in\nthe steep-spectrum radio quasars. This result can be explained, assuming that\nthe beaming factor and the slope of the luminosity function do not change with\nredshift, if high-redshift radio-loud sources can be recognized as quasars only\nwhen they are seen at a small viewing angle ($\\lesssim 25^\\circ$), while most\nof them, about 90%, are obscured in the UV and optical bands. We also found a\ntrend for the size of radio sources to decrease with increasing redshift.\nBecause projection effects are insufficient to cause this trend, we suggest\nthat the large amount of gas causing the nuclear obscuration also hampers the\ngrowth of the more distant sources.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}