{"id":"2407.14711","title":"SO2 and OCS toward high-mass protostars: A comparative study between ice\n  and gas","authors":"Julia C. Santos, Martijn L. van Gelder, Pooneh Nazari, Aida Ahmadi,\n  Ewine F. van Dishoeck","authorsParsed":[["Santos","Julia C.",""],["van Gelder","Martijn L.",""],["Nazari","Pooneh",""],["Ahmadi","Aida",""],["van Dishoeck","Ewine F.",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 00:13:59 GMT"}],"updateDate":"2024-07-23","timestamp":1721434439000,"abstract":"  We investigate the chemical history of interstellar OCS and SO2 by deriving a\nstatistically-significant sample of gas-phase column densities towards massive\nprotostars and comparing to observations of gas and ices towards other sources\nspanning from dark clouds to comets. We analyze a subset of 26 line-rich\nmassive protostars observed by ALMA as part of the ALMAGAL survey. Column\ndensities are derived for OCS and SO2 from their rare isotopologues O13CS and\n34SO2 towards the compact gas around the hot core. We find that gas-phase\ncolumn density ratios of OCS and SO2 with respect to methanol remain fairly\nconstant as a function of luminosity between low- and high-mass sources,\ndespite their very different physical conditions. The derived gaseous OCS and\nSO2 abundances relative to CH3OH are overall similar to protostellar ice\nvalues, with a significantly larger scatter for SO2 than for OCS. Cometary and\ndark-cloud ice values agree well with protostellar gas-phase ratios for OCS,\nwhereas higher abundances of SO2 are generally seen in comets compared to the\nother sources. Gaseous SO2/OCS ratios are consistent with ices toward dark\nclouds, protostars, and comets, albeit with some scatter. The constant\ngas-phase column density ratios throughout low and high-mass sources indicate\nan early stage formation before intense environmental differentiation begins.\nIcy protostellar values are similar to the gas phase medians, compatible with\nan icy origin of these species followed by thermal sublimation. The larger\nspread in SO2 compared to OCS ratios w.r.t. CH3OH is likely due to a more\nwater-rich chemical environment associated with the former, as opposed to a\nCO-rich origin of the latter. Post-sublimation gas-phase processing of SO2 can\nalso contribute to the large spread. Comparisons to ices in dark clouds and\ncomets point to a significant inheritance of OCS from earlier to later\nevolutionary stages.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}