{"id":"2407.05368","title":"Music Era Recognition Using Supervised Contrastive Learning and Artist\n  Information","authors":"Qiqi He, Xuchen Song, Weituo Hao, Ju-Chiang Wang, Wei-Tsung Lu and Wei\n  Li","authorsParsed":[["He","Qiqi",""],["Song","Xuchen",""],["Hao","Weituo",""],["Wang","Ju-Chiang",""],["Lu","Wei-Tsung",""],["Li","Wei",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 13:43:55 GMT"}],"updateDate":"2024-07-09","timestamp":1720359835000,"abstract":"  Does popular music from the 60s sound different than that of the 90s? Prior\nstudy has shown that there would exist some variations of patterns and\nregularities related to instrumentation changes and growing loudness across\nmulti-decadal trends. This indicates that perceiving the era of a song from\nmusical features such as audio and artist information is possible. Music era\ninformation can be an important feature for playlist generation and\nrecommendation. However, the release year of a song can be inaccessible in many\ncircumstances. This paper addresses a novel task of music era recognition. We\nformulate the task as a music classification problem and propose solutions\nbased on supervised contrastive learning. An audio-based model is developed to\npredict the era from audio. For the case where the artist information is\navailable, we extend the audio-based model to take multimodal inputs and\ndevelop a framework, called MultiModal Contrastive (MMC) learning, to enhance\nthe training. Experimental result on Million Song Dataset demonstrates that the\naudio-based model achieves 54% in accuracy with a tolerance of 3-years range;\nincorporating the artist information with the MMC framework for training leads\nto 9% improvement further.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xUhGcO9G6DOipVXobfqutKFVXrPUVFwDCe6Z8Sv6HVQ","pdfSize":"566557"}
