{"id":"2407.05254","title":"GaussReg: Fast 3D Registration with Gaussian Splatting","authors":"Jiahao Chang, Yinglin Xu, Yihao Li, Yuantao Chen, Xiaoguang Han","authorsParsed":[["Chang","Jiahao",""],["Xu","Yinglin",""],["Li","Yihao",""],["Chen","Yuantao",""],["Han","Xiaoguang",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 04:35:51 GMT"}],"updateDate":"2024-07-09","timestamp":1720326951000,"abstract":"  Point cloud registration is a fundamental problem for large-scale 3D scene\nscanning and reconstruction. With the help of deep learning, registration\nmethods have evolved significantly, reaching a nearly-mature stage. As the\nintroduction of Neural Radiance Fields (NeRF), it has become the most popular\n3D scene representation as its powerful view synthesis capabilities. Regarding\nNeRF representation, its registration is also required for large-scale scene\nreconstruction. However, this topic extremly lacks exploration. This is due to\nthe inherent challenge to model the geometric relationship among two scenes\nwith implicit representations. The existing methods usually convert the\nimplicit representation to explicit representation for further registration.\nMost recently, Gaussian Splatting (GS) is introduced, employing explicit 3D\nGaussian. This method significantly enhances rendering speed while maintaining\nhigh rendering quality. Given two scenes with explicit GS representations, in\nthis work, we explore the 3D registration task between them. To this end, we\npropose GaussReg, a novel coarse-to-fine framework, both fast and accurate. The\ncoarse stage follows existing point cloud registration methods and estimates a\nrough alignment for point clouds from GS. We further newly present an\nimage-guided fine registration approach, which renders images from GS to\nprovide more detailed geometric information for precise alignment. To support\ncomprehensive evaluation, we carefully build a scene-level dataset called\nScanNet-GSReg with 1379 scenes obtained from the ScanNet dataset and collect an\nin-the-wild dataset called GSReg. Experimental results demonstrate our method\nachieves state-of-the-art performance on multiple datasets. Our GaussReg is 44\ntimes faster than HLoc (SuperPoint as the feature extractor and SuperGlue as\nthe matcher) with comparable accuracy.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}