{"id":"2407.12172","title":"The Latency Price of Threshold Cryptosystem in Blockchains","authors":"Zhuolun Xiang, Sourav Das, Zekun Li, Zhoujun Ma and Alexander\n  Spiegelman","authorsParsed":[["Xiang","Zhuolun",""],["Das","Sourav",""],["Li","Zekun",""],["Ma","Zhoujun",""],["Spiegelman","Alexander",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 20:53:04 GMT"}],"updateDate":"2024-07-18","timestamp":1721163184000,"abstract":"  Threshold cryptography is essential for many blockchain protocols. For\nexample, many protocols rely on threshold common coin to implement asynchronous\nconsensus, leader elections, and provide support for randomized applications.\nSimilarly, threshold signature schemes are frequently used for protocol\nefficiency and state certification, and threshold decryption and threshold\ntime-lock puzzles are often necessary for privacy.\n  In this paper, we study the interplay between threshold cryptography and a\nclass of blockchains that use Byzantine-fault tolerant (BFT) consensus\nprotocols with a focus on latency. More specifically, we focus on\nblockchain-native threshold cryptosystem, where the blockchain validators seek\nto run a threshold cryptographic protocol once for every block with the block\ncontents as an input to the threshold cryptographic protocol. All existing\napproaches for blockchain-native threshold cryptosystems introduce a latency\noverhead of at least one message delay for running the threshold cryptographic\nprotocol. In this paper, we first propose a mechanism to eliminate this\noverhead for blockchain-native threshold cryptosystems with tight thresholds,\ni.e., in threshold cryptographic protocols where the secrecy and reconstruction\nthresholds are the same. However, many real-world proof-of-stake-based\nblockchain-native threshold cryptosystems rely on ramp thresholds, where\nreconstruction thresholds are strictly greater than secrecy thresholds. For\nthese blockchains, we formally demonstrate that the additional delay is\nunavoidable. We then introduce a mechanism to minimize this delay in the\noptimistic case. We implement our optimistic protocol for the proof-of-stake\ndistributed randomness scheme on the Aptos blockchain. Our measurements from\nthe Aptos mainnet show that the optimistic approach reduces latency overhead by\n71%.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}