{"id":"2407.01476","title":"Tree Search for Language Model Agents","authors":"Jing Yu Koh, Stephen McAleer, Daniel Fried, Ruslan Salakhutdinov","authorsParsed":[["Koh","Jing Yu",""],["McAleer","Stephen",""],["Fried","Daniel",""],["Salakhutdinov","Ruslan",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 17:07:55 GMT"}],"updateDate":"2024-07-02","timestamp":1719853675000,"abstract":"  Autonomous agents powered by language models (LMs) have demonstrated promise\nin their ability to perform decision-making tasks such as web automation.\nHowever, a key limitation remains: LMs, primarily optimized for natural\nlanguage understanding and generation, struggle with multi-step reasoning,\nplanning, and using environmental feedback when attempting to solve realistic\ncomputer tasks. Towards addressing this, we propose an inference-time search\nalgorithm for LM agents to explicitly perform exploration and multi-step\nplanning in interactive web environments. Our approach is a form of best-first\ntree search that operates within the actual environment space, and is\ncomplementary with most existing state-of-the-art agents. It is the first tree\nsearch algorithm for LM agents that shows effectiveness on realistic web tasks.\nOn the challenging VisualWebArena benchmark, applying our search algorithm on\ntop of a GPT-4o agent yields a 39.7% relative increase in success rate compared\nto the same baseline without search, setting a state-of-the-art success rate of\n26.4%. On WebArena, search also yields a 28.0% relative improvement over a\nbaseline agent, setting a competitive success rate of 19.2%. Our experiments\nhighlight the effectiveness of search for web agents, and we demonstrate that\nperformance scales with increased test-time compute. We conduct a thorough\nanalysis of our results to highlight improvements from search, limitations, and\npromising directions for future work. Our code and models are publicly released\nat https://jykoh.com/search-agents.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}