{"id":"2407.03897","title":"gFlora: a topology-aware method to discover functional co-response\n  groups in soil microbial communities","authors":"Nan Chen, Merlijn Schram, Doina Bucur","authorsParsed":[["Chen","Nan",""],["Schram","Merlijn",""],["Bucur","Doina",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 12:43:53 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 13:10:20 GMT"}],"updateDate":"2024-07-19","timestamp":1720097033000,"abstract":"  We aim to learn the functional co-response group: a group of taxa whose\nco-response effect (the representative characteristic of the group showing the\ntotal topological abundance of taxa) co-responds (associates well\nstatistically) to a functional variable. Different from the state-of-the-art\nmethod, we model the soil microbial community as an ecological co-occurrence\nnetwork with the taxa as nodes (weighted by their abundance) and their\nrelationships (a combination from both spatial and functional ecological\naspects) as edges (weighted by the strength of the relationships). Then, we\ndesign a method called gFlora which notably uses graph convolution over this\nco-occurrence network to get the co-response effect of the group, such that the\nnetwork topology is also considered in the discovery process. We evaluate\ngFlora on two real-world soil microbiome datasets (bacteria and nematodes) and\ncompare it with the state-of-the-art method. gFlora outperforms this on all\nevaluation metrics, and discovers new functional evidence for taxa which were\nso far under-studied. We show that the graph convolution step is crucial to\ntaxa with relatively low abundance (thus removing the bias towards taxa with\nhigher abundance), and the discovered bacteria of different genera are\ndistributed in the co-occurrence network but still tightly connected among\nthemselves, demonstrating that topologically they fill different but\ncollaborative functional roles in the ecological community.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}