{"id":"2407.16545","title":"Bubble shape oscillations in a turbulent environment","authors":"Ali\\'enor Rivi\\`ere, Kamel Abahri, St\\'ephane Perrard","authorsParsed":[["Rivière","Aliénor",""],["Abahri","Kamel",""],["Perrard","Stéphane",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:55:45 GMT"}],"updateDate":"2024-07-24","timestamp":1721746545000,"abstract":"  We investigate bubble deformations in an homogeneous and isotropic turbulent\nflow by means of direct numerical simulations of a single bubble in turbulence.\nWe examine interface deformations by decomposing the local radius into the\nspherical harmonics base. We show that the linear dynamics of each mode, (for\nlow Weber number), can be modeled by a forced stochastic linear oscillator. We\nmeasure the coefficients of the model directly from the modes' statistics. We\nfind that the natural frequency corresponds to the Rayleigh frequency, derived\nin a quiescent flow. However, dissipation increases by a factor 15 compared to\nthe quiescent case, at $Re_\\lambda = 55$. This enhanced dissipation originates\nfrom a thick boundary layer surrounding the bubble. We demonstrate that the\neffective forcing, originating from the integration of pressure over the bubble\nsurface, is independent on bubble deformability. Therefore, the interface\ndeformations are only one-way coupled to the flow. Eventually, we investigate\nthe pressure modes' statistics in the absence of bubbles and compare them to\nthe effective forcing statistics. We show that both fields share the same pdf,\ncharacterized by exponential tails, and a characteristic timescale\ncorresponding to the eddy turnover time at the mode scale.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"X6Dog0c2HJ2TCkkr1gbGhicjzzwfEmMeg7m-9dv1HEQ","pdfSize":"1369361","objectId":"0xbe7dc1432181aa247de911bf5249d52d445e6c46de665a8c25c59ef26e9ca905","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
