{"id":"2407.03662","title":"Compact Binary Formation in Open Star Clusters III: Probability of\n  Binary Black Holes Hidden Inside of Gaia Black Holes","authors":"Ataru Tanikawa, Long Wang and Michiko S. Fujii","authorsParsed":[["Tanikawa","Ataru",""],["Wang","Long",""],["Fujii","Michiko S.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 06:04:22 GMT"},{"version":"v2","created":"Tue, 9 Jul 2024 07:34:33 GMT"}],"updateDate":"2024-07-10","timestamp":1720073062000,"abstract":"  Gaia mission and its follow-up observations have discovered binaries\ncontaining single BHs and visible stars without mass transfer, so-called Gaia\nBHs. One important question is if Gaia BHs have binary BHs (BBHs), hereafter\nGaia BBHs, instead of single BHs. We have investigated how efficiently Gaia\nBBHs are formed in open star clusters, one of the promising formation sites of\nGaia BHs, by means of gravitational $N$-body simulations. Limiting Gaia BHs'\nperiods to $10^2$-$10^4$ days, we have found that there are no Gaia BBHs in the\nsolar-metallicity environments, while the formation efficiency of Gaia BBHs is\nnot small ($\\sim 10^{-6} M_\\odot^{-1}$ or $\\sim 10$ % of Gaia BHs) in\nsubsolar-metallicity environments. However, the probability of Gaia BBHs hidden\nin Gaia BHs is only $\\sim 1$ %. This is because most of the BBHs merge within\n$1$ Gyr through gravitational wave radiation. Note that the ages of discovered\nGaia BHs are more than $1$ Gyr. If we extend Gaia BHs' periods to $10^4$-$10^5$\ndays, the probability becomes higher to $\\sim 10$ %. In this case, a large\nfraction of BBHs can have enough wide orbits not to merge within the Hubble\ntime. The probability would not be high for Gaia BHs already discovered and to\nbe discovered in the near future. Nevertheless, we have shown the BH/BBH mass,\nvisible star mass, and eccentricity distributions of Gaia BHs and Gaia BBHs,\nwhich will be helpful for follow-up observations to discover Gaia BBHs. A Gaia\nBH would be more likely to be a Gaia BBH if it has younger age, longer period,\nlower-mass companion, more circular orbit, lower metallicity, and more massive\nBH. Our results have implied that Gaia BH3 is unlikely to be a Gaia BBH.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}