{"id":"2407.20350","title":"Socioeconomic determinants of protective behaviors and contact patterns\n  in the post-COVID-19 pandemic era: a cross-sectional study in Italy","authors":"Michele Tizzani and Laetitia Gauvin","authorsParsed":[["Tizzani","Michele",""],["Gauvin","Laetitia",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:04:29 GMT"}],"updateDate":"2024-07-31","timestamp":1722276269000,"abstract":"  Socioeconomic inequalities significantly influence infectious disease\noutcomes, as seen with COVID-19, but the pathways through which socioeconomic\nconditions affect transmission dynamics remain unclear. To address this, we\nconducted a survey representative of the Italian population, stratified by age,\ngender, geographical area, city size, employment status, and education level.\nThe survey's final aim was to estimate differences in contact and protective\nbehaviors across various population strata, both being key components of\ntransmission dynamics. Our initial insights based on the survey indicate that\nyears after the pandemic began, the perceived impact of COVID-19 on\nprofessional, economic, social, and psychological dimensions varied across\nsocioeconomic strata, extending beyond the heterogeneity observed in the\nepidemiological outcomes of the pandemic. This reinforces the need for\napproaches that systematically consider socioeconomic determinants. In this\ncontext, using generalized models, we identified associations between\nsocioeconomic factors and vaccination status for both COVID-19 and influenza,\nas well as the influence of socioeconomic conditions on mask-wearing and social\ndistancing. Importantly, we also observed differences in contact behaviors\nbased on employment status while education level did not show a significant\nassociation. These findings highlight the complex interplay of socioeconomic\nand demographic factors in shaping individual responses to public health\nmeasures. Understanding these dynamics is essential for developing effective\nepidemic models and targeted public health strategies, particularly for\nvulnerable populations.\n","subjects":["Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}