{"id":"2407.16629","title":"Efficient Discovery of Actual Causality using Abstraction-Refinement","authors":"Arshia Rafieioskouei and Borzoo Bonakdarpour","authorsParsed":[["Rafieioskouei","Arshia",""],["Bonakdarpour","Borzoo",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 16:40:39 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 18:45:24 GMT"},{"version":"v3","created":"Fri, 30 Aug 2024 18:19:20 GMT"}],"updateDate":"2024-09-04","timestamp":1721752839000,"abstract":"  Causality is the relationship where one event contributes to the production\nof another, with the cause being partly responsible for the effect and the\neffect partly dependent on the cause. In this paper, we propose a novel and\neffective method to formally reason about the causal effect of events in\nengineered systems, with application for finding the root-cause of safety\nviolations in embedded and cyber-physical systems. We are motivated by the\nnotion of actual causality by Halpern and Pearl, which focuses on the causal\neffect of particular events rather than type-level causality, which attempts to\nmake general statements about scientific and natural phenomena. Our first\ncontribution is formulating discovery of actual causality in computing systems\nmodeled by transition systems as an SMT solving problem.\n  Since datasets for causality analysis tend to be large, in order to tackle\nthe scalability problem of automated formal reasoning, our second contribution\nis a novel technique based on abstraction-refinement that allows identifying\nfor actual causes within smaller abstract causal models. We demonstrate the\neffectiveness of our approach (by several orders of magnitude) using three case\nstudies to find the actual cause of violations of safety in (1) a neural\nnetwork controller for a Mountain Car, (2) a controller for a Lunar Lander\nobtained by reinforcement learning, and (3) an MPC controller for an F-16\nautopilot simulator.\n","subjects":["Computing Research Repository/Logic in Computer Science","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}