{"id":"2407.06912","title":"Optimal Neighborhood Exploration for Dynamic Independent Sets","authors":"Jannick Borowitz, Ernestine Gro{\\ss}mann and Christian Schulz","authorsParsed":[["Borowitz","Jannick",""],["Großmann","Ernestine",""],["Schulz","Christian",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 14:48:02 GMT"}],"updateDate":"2024-07-10","timestamp":1720536482000,"abstract":"  A dynamic graph algorithm is a data structure that supports edge insertions,\ndeletions, and specific problem queries. While extensive research exists on\ndynamic algorithms for graph problems solvable in polynomial time, most of\nthese algorithms have not been implemented or empirically evaluated.\n  This work addresses the NP-complete maximum weight and cardinality\nindependent set problems in a dynamic setting, applicable to areas like dynamic\nmap-labeling and vehicle routing. Real-world instances can be vast, with\nmillions of vertices and edges, making it challenging to find near-optimal\nsolutions quickly. Exact solvers can find optimal solutions but have\nexponential worst-case runtimes. Conversely, heuristic algorithms use local\nsearch techniques to improve solutions by optimizing vertices.\n  In this work, we introduce a novel local search technique called optimal\nneighborhood exploration. This technique creates independent subproblems that\nare solved to optimality, leading to improved overall solutions. Through\nnumerous experiments, we assess the effectiveness of our approach and compare\nit with other state-of-the-art dynamic solvers. Our algorithm features a\nparameter, the subproblem size, that balances running time and solution\nquality. With this parameter, our configuration matches state-of-the-art\nperformance for the cardinality independent set problem. By increasing the\nparameter, we significantly enhance solution quality.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}