{"id":"2407.21250","title":"FAST observations of neutral hydrogen in the interacting galaxies NGC\n  3395/3396","authors":"Nai-Ping Yu, Ming Zhu, Jin-Long Xu, Chuan-Peng Zhang, Hai-Yang Yu,\n  Xiao-Lan Liu, Peng Jiang and Mei Ai","authorsParsed":[["Yu","Nai-Ping",""],["Zhu","Ming",""],["Xu","Jin-Long",""],["Zhang","Chuan-Peng",""],["Yu","Hai-Yang",""],["Liu","Xiao-Lan",""],["Jiang","Peng",""],["Ai","Mei",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 23:58:39 GMT"}],"updateDate":"2024-08-01","timestamp":1722383919000,"abstract":"  We report on high-sensitivity neutral hydrogen observations toward the\ngas-rich interacting galaxies NGC 3395/3396 with the Five-hundred-meter\nAperture Spherical radio Telescope (FAST). Compared to previous observations\ncarried out by the Very Large Array (VLA) and the Westerbork Synthesis Radio\nTelescope (WSRT), a more extended HI envelope around this system has been\ndetected. The total HI gas mass of the NGC 3395/3396 system is estimated to be\n7.8 x 109 M. This value is 2.7 times more than that reported based on the VLA\ninterferometric maps. Previous observations found a large HI tail extending to\nthe south-west and a minor tail emerging from the north of this peculiar galaxy\npair. Based on the high-sensitivity observations of FAST, an extended HI plume\nto the north-west and a gas plume to the north-east have been detected for the\nfirst time. Neutral hydrogen of the two smaller galaxies IC 2604 and IC 2608 on\nthe south of the system have also been detected. We discuss the origins of\nthese extra gas and possible tidal interactions between these galaxies. NGC\n3395/3396's most prominent tidal feature, the south-west tail combined with the\nnew detected north-west plume behaves like a large ring. We suggest the ring\nmight be formed by the previous fly-by interaction between NGC 3395 and NGC\n3396 which happened 500 Myr ago. Our study shows that high-sensitivity HI\nobservations are important in revealing low column density gas, which is\ncrucial to a deeper understanding of this interacting system.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}