{"id":"2407.20613","title":"Escape of an Active Ring from an Attractive Surface: Behaving Like a\n  Self-Propelled Brownian Particle","authors":"Bin Tang, Jin-cheng Gao, Kang Chen, Tian Hui Zhang, Wen-de Tian","authorsParsed":[["Tang","Bin",""],["Gao","Jin-cheng",""],["Chen","Kang",""],["Zhang","Tian Hui",""],["Tian","Wen-de",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 07:40:58 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 09:24:51 GMT"}],"updateDate":"2024-08-21","timestamp":1722325258000,"abstract":"  Escape of active agents from metastable states is of great interest in\nstatistical and biological physics. In this study, we investigate the escape of\na flexible active ring, composed of active Brownian particles, from a flat\nattractive surface using Brownian dynamics simulations. To systematically\nexplore the effects of activity, persistence time, and the shape of attractive\npotentials, we calculate escape time and effective temperature. We observe two\ndistinct escape mechanisms: Kramers-like thermal activation at small\npersistence times and the maximal force problem at large persistence time,\nwhere escape time is determined by persistence time. The escape time explicitly\ndepends on the shape of the potential barrier at high activity and large\npersistence time. Moreover, when the propulsion force is biased along the\nring's contour, escape becomes more difficult and is primarily driven by\nthermal noise. Our findings highlight that, despite its intricate\nconfiguration, the active ring can be effectively modeled as a self-propelled\nBrownian particle when studying its escape from a smooth surface.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Biological Physics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KV6sJHaK7FuU8ZEAx2f6LjNSWzFUG1kF9OTpy1sVK5A","pdfSize":"859829","objectId":"0x6a9907fc15b4dbf4bd7a879fc939ee05aef9c8fdc3ce22a9fdd6f21cfe8ea892","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
