{"id":"2407.15003","title":"Requiem for a drone: a machine-learning based framework for stealthy\n  attacks against unmanned autonomous vehicles","authors":"Kyo Hyun Kim, Denizhan Kara, Vineetha Paruchuri, Sibin Mohan, Greg\n  Kimberly, Jae Kim, Josh Eckhardt","authorsParsed":[["Kim","Kyo Hyun",""],["Kara","Denizhan",""],["Paruchuri","Vineetha",""],["Mohan","Sibin",""],["Kimberly","Greg",""],["Kim","Jae",""],["Eckhardt","Josh",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 22:58:14 GMT"}],"updateDate":"2024-07-23","timestamp":1721516294000,"abstract":"  There is a space of uncertainty in the modeling of vehicular dynamics of\nautonomous systems due to noise in sensor readings, environmental factors or\nmodeling errors. We present Requiem, a software-only, blackbox approach that\nexploits this space in a stealthy manner causing target systems, e.g., unmanned\naerial vehicles (UAVs), to significantly deviate from their mission parameters.\nOur system achieves this by modifying sensor values, all while avoiding\ndetection by onboard anomaly detectors (hence, \"stealthy\"). The Requiem\nframework uses a combination of multiple deep learning models (that we refer to\nas \"surrogates\" and \"spoofers\") coupled with extensive, realistic simulations\non a software-in-the-loop quadrotor UAV system. Requiem makes no assumptions\nabout either the (types of) sensors or the onboard state estimation\nalgorithm(s) -- it works so long as the latter is \"learnable\".\n  We demonstrate the effectiveness of our system using various attacks across\nmultiple missions as well as multiple sets of statistical analyses. We show\nthat Requiem successfully exploits the modeling errors (i.e., causes\nsignificant deviations from planned mission parameters) while remaining\nstealthy (no detection even after {tens of meters of deviations}) and are\ngeneralizable (Requiem has potential to work across different attacks and\nsensor types).\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}