{"id":"2407.00199","title":"Communication Reliably Improves Individual But Not Group Accuracy","authors":"Charlie Pilgrim and Joshua Becker","authorsParsed":[["Pilgrim","Charlie",""],["Becker","Joshua",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 19:12:16 GMT"}],"updateDate":"2024-07-02","timestamp":1719601936000,"abstract":"  Prior research offers mixed evidence on whether and when communication\nimproves belief accuracy for numeric estimates. Experiments on one-to-one\nadvice suggest that communication between peers usually benefits accuracy,\nwhile group experiments indicate that communication networks produce highly\nvariable outcomes. Notably, it is possible for a group's average estimate to\nbecome less accurate even as its individual group members -- on average --\nbecome more accurate. However, the conditions under which communication\nimproves group and/or individual outcomes remain poorly characterised. We\nanalyse an empirically supported model of opinion formation to derive these\nconditions, formally explicating the relationship between group-level effects\nand individual outcomes. We reanalyze previously published experimental data,\nfinding that empirical dynamics are consistent with theoretical expectations.\nWe show that 3 measures completely describe asymptotic opinion dynamics: the\ninitial crowd bias; the degree of influence centralisation; and the correlation\nbetween influence and initial biases. We find analytic expressions for the\nchange in crowd and individual accuracy as a function of the product of these\nthree measures, which we describe as the truth alignment. We show how truth\nalignment can be decomposed into calibration (influence/accuracy correlation),\nand herding (influence/averageness correlation), and how these measures relate\nto changes in accuracy. Overall, we find that individuals can and usually do\nimprove even when groups get worse.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}