{"id":"2407.19985","title":"Mixture of Nested Experts: Adaptive Processing of Visual Tokens","authors":"Gagan Jain, Nidhi Hegde, Aditya Kusupati, Arsha Nagrani, Shyamal Buch,\n  Prateek Jain, Anurag Arnab, Sujoy Paul","authorsParsed":[["Jain","Gagan",""],["Hegde","Nidhi",""],["Kusupati","Aditya",""],["Nagrani","Arsha",""],["Buch","Shyamal",""],["Jain","Prateek",""],["Arnab","Anurag",""],["Paul","Sujoy",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:19:31 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 17:26:22 GMT"}],"updateDate":"2024-07-31","timestamp":1722259171000,"abstract":"  The visual medium (images and videos) naturally contains a large amount of\ninformation redundancy, thereby providing a great opportunity for leveraging\nefficiency in processing. While Vision Transformer (ViT) based models scale\neffectively to large data regimes, they fail to capitalize on this inherent\nredundancy, leading to higher computational costs. Mixture of Experts (MoE)\nnetworks demonstrate scalability while maintaining same inference-time costs,\nbut they come with a larger parameter footprint. We present Mixture of Nested\nExperts (MoNE), which utilizes a nested structure for experts, wherein\nindividual experts fall on an increasing compute-accuracy curve. Given a\ncompute budget, MoNE learns to dynamically choose tokens in a priority order,\nand thus redundant tokens are processed through cheaper nested experts. Using\nthis framework, we achieve equivalent performance as the baseline models, while\nreducing inference time compute by over two-fold. We validate our approach on\nstandard image and video datasets - ImageNet-21K, Kinetics400, and\nSomething-Something-v2. We further highlight MoNE$'$s adaptability by\nshowcasing its ability to maintain strong performance across different\ninference-time compute budgets on videos, using only a single trained model.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8QcAcv70EbF6wi18SWOur63lSUvmIVpCXLQ2byyvADg","pdfSize":"1156628"}
