{"id":"2407.02329","title":"MIGC++: Advanced Multi-Instance Generation Controller for Image\n  Synthesis","authors":"Dewei Zhou, You Li, Fan Ma, Zongxin Yang, Yi Yang","authorsParsed":[["Zhou","Dewei",""],["Li","You",""],["Ma","Fan",""],["Yang","Zongxin",""],["Yang","Yi",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 14:59:37 GMT"}],"updateDate":"2024-07-03","timestamp":1719932377000,"abstract":"  We introduce the Multi-Instance Generation (MIG) task, which focuses on\ngenerating multiple instances within a single image, each accurately placed at\npredefined positions with attributes such as category, color, and shape,\nstrictly following user specifications. MIG faces three main challenges:\navoiding attribute leakage between instances, supporting diverse instance\ndescriptions, and maintaining consistency in iterative generation. To address\nattribute leakage, we propose the Multi-Instance Generation Controller (MIGC).\nMIGC generates multiple instances through a divide-and-conquer strategy,\nbreaking down multi-instance shading into single-instance tasks with singular\nattributes, later integrated. To provide more types of instance descriptions,\nwe developed MIGC++. MIGC++ allows attribute control through text \\& images and\nposition control through boxes \\& masks. Lastly, we introduced the\nConsistent-MIG algorithm to enhance the iterative MIG ability of MIGC and\nMIGC++. This algorithm ensures consistency in unmodified regions during the\naddition, deletion, or modification of instances, and preserves the identity of\ninstances when their attributes are changed. We introduce the COCO-MIG and\nMultimodal-MIG benchmarks to evaluate these methods. Extensive experiments on\nthese benchmarks, along with the COCO-Position benchmark and DrawBench,\ndemonstrate that our methods substantially outperform existing techniques,\nmaintaining precise control over aspects including position, attribute, and\nquantity. Project page: https://github.com/limuloo/MIGC.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}