{"id":"2407.06528","title":"Semantic Communication in Multi-team Dynamic Games: A Mean Field\n  Perspective","authors":"Shubham Aggarwal, Muhammad Aneeq uz Zaman, Melih Bastopcu, and Tamer\n  Ba\\c{s}ar","authorsParsed":[["Aggarwal","Shubham",""],["Zaman","Muhammad Aneeq uz",""],["Bastopcu","Melih",""],["Başar","Tamer",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 03:57:12 GMT"}],"updateDate":"2024-07-10","timestamp":1720497432000,"abstract":"  Coordinating communication and control is a key component in the stability\nand performance of networked multi-agent systems. While single user networked\ncontrol systems have gained a lot of attention within this domain, in this\nwork, we address the more challenging problem of large population multi-team\ndynamic games. In particular, each team constitutes two decision makers\n(namely, the sensor and the controller) who coordinate over a shared network to\ncontrol a dynamically evolving state of interest under costs on both actuation\nand sensing/communication. Due to the shared nature of the wireless channel,\nthe overall cost of each team depends on other teams' policies, thereby leading\nto a noncooperative game setup. Due to the presence of a large number of teams,\nwe compute approximate decentralized Nash equilibrium policies for each team\nusing the paradigm of (extended) mean-field games, which is governed by (1) the\nmean traffic flowing over the channel, and (2) the value of information at the\nsensor, which highlights the semantic nature of the ensuing communication. In\nthe process, we compute optimal controller policies and approximately optimal\nsensor policies for each representative team of the mean-field system to\nalleviate the problem of general non-contractivity of the mean-field fixed\npoint operator associated with the finite cardinality of the sensor action\nspace. Consequently, we also prove the $\\epsilon$--Nash property of the\nmean-field equilibrium solution which essentially characterizes how well the\nsolution derived using mean-field analysis performs on the finite-team system.\nFinally, we provide extensive numerical simulations, which corroborate the\ntheoretical findings and lead to additional insights on the properties of the\nresults presented.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Information Theory","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}