{"id":"2407.00437","title":"Enhancement in Photoluminescence of Pt/Ag-Pt Embedded ZrO2 Thin Films by\n  Plasma Co-sputtering","authors":"Shailendra Kumar Mishra, Ibnul Farid, Aritra Tarafder, Joyanti Chutia,\n  Subir Biswas, Arup Ratan Pal, Neeraj Shukla","authorsParsed":[["Mishra","Shailendra Kumar",""],["Farid","Ibnul",""],["Tarafder","Aritra",""],["Chutia","Joyanti",""],["Biswas","Subir",""],["Pal","Arup Ratan",""],["Shukla","Neeraj",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 13:13:26 GMT"}],"updateDate":"2024-07-02","timestamp":1719666806000,"abstract":"  Platinum, Silver-Platinum embedded Zirconia (Pt/Ag-Pt ZrO2) thin films have\nbeen fabricated on silicon wafers and glass substrates using the plasma\nco-sputtering method. Zirconia thin films are of significant technological\nimportance due to their remarkable electrical, optical, and mechanical\nproperties, as well as their high melting temperature of 2715{\\deg}C, which\nmakes them increasingly attractive for various applications. In this study,\nZrO2 thin films were deposited for 3 minutes, followed by the deposition of\nPt-Ag/Pt onto the fabricated zirconia thin films, with deposition times ranging\nfrom 15 to 60 seconds. The varying deposition times of Pt-Ag/Pt influenced the\noptical and electronic properties of the thin films due to alterations in their\nsurface roughness. The characteristics of the grown zirconia and Pt/Ag-Pt\nsputtered zirconia nanostructures were investigated using Atomic Force\nMicroscopy (AFM), Scanning Electron Microscopy (SEM), X-ray Diffraction (XRD),\nUV-visible spectroscopy, and Photoluminescence spectroscopy. The optical\ntransmittance of these thin films was examined across the visible and\nnear-infrared spectral ranges. The investigation revealed various properties,\nsuch as enhanced photoluminescence and the emergence of new peaks in the\nvisible range spectra. Plasmonic peaks were induced, and an increase in the\nsharpness of these peaks was observed between 403.15 nm and 512.10 nm for the\nPt/Ag-Pt deposited samples. This enhancement in photoluminescence is attributed\nto the plasmonic properties of Pt-Ag nanoparticles on the zirconia thin film.\nThe study demonstrates that these optically tuned thin film coatings, with\ntheir enhanced photoluminescence properties, can significantly improve the\nheat-resistance capacity of devices, mitigating issues related to overheating\nand device shutdown.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}