{"id":"2407.01005","title":"MARLP: Time-series Forecasting Control for Agricultural Managed Aquifer\n  Recharge","authors":"Yuning Chen, Kang Yang, Zhiyu An, Brady Holder, Luke Paloutzian,\n  Khaled Bali, Wan Du","authorsParsed":[["Chen","Yuning",""],["Yang","Kang",""],["An","Zhiyu",""],["Holder","Brady",""],["Paloutzian","Luke",""],["Bali","Khaled",""],["Du","Wan",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 06:36:40 GMT"}],"updateDate":"2024-07-02","timestamp":1719815800000,"abstract":"  The rapid decline in groundwater around the world poses a significant\nchallenge to sustainable agriculture. To address this issue, agricultural\nmanaged aquifer recharge (Ag-MAR) is proposed to recharge the aquifer by\nartificially flooding agricultural lands using surface water. Ag-MAR requires a\ncarefully selected flooding schedule to avoid affecting the oxygen absorption\nof crop roots. However, current Ag-MAR scheduling does not take into account\ncomplex environmental factors such as weather and soil oxygen, resulting in\ncrop damage and insufficient recharging amounts. This paper proposes MARLP, the\nfirst end-to-end data-driven control system for Ag-MAR. We first formulate\nAg-MAR as an optimization problem. To that end, we analyze four-year in-field\ndatasets, which reveal the multi-periodicity feature of the soil oxygen level\ntrends and the opportunity to use external weather forecasts and flooding\nproposals as exogenous clues for soil oxygen prediction. Then, we design a\ntwo-stage forecasting framework. In the first stage, it extracts both the\ncross-variate dependency and the periodic patterns from historical data to\nconduct preliminary forecasting. In the second stage, it uses weather-soil and\nflooding-soil causality to facilitate an accurate prediction of soil oxygen\nlevels. Finally, we conduct model predictive control (MPC) for Ag-MAR flooding.\nTo address the challenge of large action spaces, we devise a heuristic planning\nmodule to reduce the number of flooding proposals to enable the search for\noptimal solutions. Real-world experiments show that MARLP reduces the oxygen\ndeficit ratio by 86.8% while improving the recharging amount in unit time by\n35.8%, compared with the previous four years.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}