{"id":"2407.03063","title":"ScreenTK: Seamless Detection of Time-Killing Moments Using Continuous\n  Mobile Screen Text and On-Device LLMs","authors":"Le Fang, Shiquan Zhang, Hong Jia, Jorge Goncalves, Vassilis Kostakos","authorsParsed":[["Fang","Le",""],["Zhang","Shiquan",""],["Jia","Hong",""],["Goncalves","Jorge",""],["Kostakos","Vassilis",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 12:34:59 GMT"},{"version":"v2","created":"Sun, 7 Jul 2024 10:25:12 GMT"},{"version":"v3","created":"Sat, 24 Aug 2024 10:21:20 GMT"}],"updateDate":"2024-08-27","timestamp":1720010099000,"abstract":"  Smartphones have become essential to people's digital lives, providing a\ncontinuous stream of information and connectivity. However, this constant flow\ncan lead to moments where users are simply passing time rather than engaging\nmeaningfully. This underscores the importance of developing methods to identify\nthese \"time-killing\" moments, enabling the delivery of important notifications\nin a way that minimizes interruptions and enhances user engagement. Recent work\nhas utilized screenshots taken every 5 seconds to detect time-killing\nactivities on smartphones. However, this method often misses to capture phone\nusage between intervals. We demonstrate that up to 50% of time-killing\ninstances go undetected using screenshots, leading to substantial gaps in\nunderstanding user behavior. To address this limitation, we propose a method\ncalled ScreenTK that detects time-killing moments by leveraging continuous\nscreen text monitoring and on-device large language models (LLMs). Screen text\ncontains more comprehensive information than screenshots and allows LLMs to\nsummarize detailed phone usage. To verify our framework, we conducted\nexperiments with six participants, capturing 1,034 records of different\ntime-killing moments. Initial results show that our framework outperforms\nstate-of-the-art solutions by 38% in our case study.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}