{"id":"2407.10690","title":"Controllable interatomic interaction mediated by diffractive coupling in\n  a cavity","authors":"Ivor Kre\\v{s}i\\'c","authorsParsed":[["Krešić","Ivor",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 13:03:36 GMT"}],"updateDate":"2024-07-16","timestamp":1721048616000,"abstract":"  Photon-mediated interaction can be used for simulating complex many-body\nphenomena with ultracold atoms coupled to electromagnetic modes of an optical\nresonator. We theoretically study a method of producing controllable\ninteratomic interaction mediated by forward-diffracted photons circulating\ninside a ring cavity. One example of such a system is the three-mode cavity,\nwhere an on-axis mode can coexist with two diffracted sidebands. We demonstrate\nhow the self-organized stripe states of a Bose-Einstein condensate (BEC)\noccurring in this cavity geometry can exhibit supersolid properties, due to\nspontaneous breaking of the Hamiltonian's continuous translational symmetry. A\nnumerical study of the collective excitation spectrum of these states\ndemonstrates the existence of massles and finite-gap excitations, which are\nidentified as phase (Goldstone) and amplitude (Higgs) atomic density modes. We\nfurther demonstrate how judicious Fourier filtering of intracavity light can be\nused to engineer the effective atom-atom interaction profile for many cavity\nmodes. The numerical results in this configuration show the existence of\ndroplet array and single droplet BEC states for commensurate and incommensurate\ncavity modes, respectively. Diffractive coupling in a cavity is thereby\nintroduced as a novel route towards tailoring the photon-mediated interaction\nof ultracold atoms. Spatial features of the self-organized optical potentials\ncan here be tuned to scales several times larger than the pump laser\nwavelength, such that the corresponding atomic density distributions could be\nimaged and manipulated using low numerical aperture optics. These calculations\nand insights pave the way towards quantum simulation of exotic nonequilibrium\nmany-body physics with condensates in a cavity.\n","subjects":["Condensed Matter/Quantum Gases","Physics/Atomic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AgMptxrnzqF18N1urX2phb3RJIEVc-Mce3f7uYiI7YU","pdfSize":"1061374"}
