{"id":"2407.20317","title":"Lecture Notes: many-body quantum dynamics with MCTDH-X","authors":"Paolo Molignini, Sunayana Dutta, Elke Fasshauer","authorsParsed":[["Molignini","Paolo",""],["Dutta","Sunayana",""],["Fasshauer","Elke",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-31","timestamp":1722276000000,"abstract":"  The lecture notes on \"Many-body Quantum Dynamics with MCTDH-X,\" adapted from\nthe 2023 Heidelberg MCTDH Summer School, provide an in-depth exploration of the\nMulticonfigurational Time-Dependent Hartree approach for indistinguishable\nparticles. They serve as a comprehensive guide for understanding and utilizing\nthe MCTDH-X software for both bosonic and fermionic systems. The tutorial\nbegins with an introduction to the MCTDH-X software, highlighting its\ncapability to handle various quantum systems, including those with internal\ndegrees of freedom and long-range interactions. The theoretical foundation is\nthen laid out on how to solve the time-dependent and time-independent\nSchr\\\"odinger equations for many-body systems. The workflow section provides\npractical instructions on setting up and executing simulations using MCTDH-X.\nDetailed benchmarks against exact solutions are presented, showcasing the\naccuracy and reliability of the software in ground-state and dynamic\nsimulations. The notes then delve into the dynamics of quantum systems,\ncovering relaxation processes, time evolution, and the analysis of propagation\nfor both bosonic and fermionic particles. The discussion includes the\ninterpretation of various physical quantities such as energy, density\ndistributions, and orbital occupations. Advanced features of MCTDH-X are also\nexplored in the last section, including the calculation of correlation\nfunctions and the creation of visualizations through video tutorials. The notes\nconclude with a Linux/UNIX command cheat sheet, facilitating ease of use for\nusers operating the software on different systems. Overall, these lecture notes\nprovide a valuable resource for researchers and students in the field of\nquantum dynamics, offering both theoretical insights and practical guidance on\nthe use of MCTDH-X for studying complex many-body systems.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Quantum Gases","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}