{"id":"2407.12466","title":"Comparison of estimation limits for quantum two-parameter estimation","authors":"Simon K. Yung, Lorcan O. Conlon, Jie Zhao, Ping Koy Lam, Syed M. Assad","authorsParsed":[["Yung","Simon K.",""],["Conlon","Lorcan O.",""],["Zhao","Jie",""],["Lam","Ping Koy",""],["Assad","Syed M.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 10:37:08 GMT"}],"updateDate":"2024-07-18","timestamp":1721212628000,"abstract":"  Measurement estimation bounds for local quantum multiparameter estimation,\nwhich provide lower bounds on possible measurement uncertainties, have so far\nbeen formulated in two ways: by extending the classical Cram\\'er--Rao bound\n(e.g., the quantum Cram\\'er--Rao bound and the Nagaoka Cram'er--Rao bound) and\nby incorporating the parameter estimation framework with the uncertainty\nprinciple, as in the Lu--Wang uncertainty relation. In this work, we present a\ngeneral framework that allows a direct comparison between these different types\nof estimation limits. Specifically, we compare the attainability of the Nagaoka\nCram\\'er--Rao bound and the Lu--Wang uncertainty relation, using analytical and\nnumerical techniques. We show that these two limits can provide different\ninformation about the physically attainable precision. We present an example\nwhere both limits provide the same attainable precision and an example where\nthe Lu--Wang uncertainty relation is not attainable even for pure states. We\nfurther demonstrate that the unattainability in the latter case arises because\nthe figure of merit underpinning the Lu--Wang uncertainty relation (the\ndifference between the quantum and classical Fisher information matrices) does\nnot necessarily agree with the conventionally used figure of merit (mean\nsquared error). The results offer insights into the general attainability and\napplicability of the Lu--Wang uncertainty relation. Furthermore, our proposed\nframework for comparing bounds of different types may prove useful in other\nsettings.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}