{"id":"2407.18627","title":"Multi-Agent Deep Reinforcement Learning for Energy Efficient Multi-Hop\n  STAR-RIS-Assisted Transmissions","authors":"Pei-Hsiang Liao, Li-Hsiang Shen, Po-Chen Wu, and Kai-Ten Feng","authorsParsed":[["Liao","Pei-Hsiang",""],["Shen","Li-Hsiang",""],["Wu","Po-Chen",""],["Feng","Kai-Ten",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 09:35:50 GMT"}],"updateDate":"2024-07-29","timestamp":1721986550000,"abstract":"  Simultaneously transmitting and reflecting reconfigurable intelligent surface\n(STAR-RIS) provides a promising way to expand coverage in wireless\ncommunications. However, limitation of single STAR-RIS inspire us to integrate\nthe concept of multi-hop transmissions, as focused on RIS in existing research.\nTherefore, we propose the novel architecture of multi-hop STAR-RISs to achieve\na wider range of full-plane service coverage. In this paper, we intend to solve\nactive beamforming of the base station and passive beamforming of STAR-RISs,\naiming for maximizing the energy efficiency constrained by hardware limitation\nof STAR-RISs. Furthermore, we investigate the impact of the on-off state of\nSTAR-RIS elements on energy efficiency. To tackle the complex problem, a\nMulti-Agent Global and locAl deep Reinforcement learning (MAGAR) algorithm is\ndesigned. The global agent elevates the collaboration among local agents, which\nfocus on individual learning. In numerical results, we observe the significant\nimprovement of MAGAR compared to the other benchmarks, including Q-learning,\nmulti-agent deep Q network (DQN) with golbal reward, and multi-agent DQN with\nlocal rewards. Moreover, the proposed architecture of multi-hop STAR-RISs\nachieves the highest energy efficiency compared to mode switching based\nSTAR-RISs, conventional RISs and deployment without RISs or STAR-RISs.\n","subjects":["Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}