{"id":"2407.03040","title":"Raw Text is All you Need: Knowledge-intensive Multi-turn Instruction\n  Tuning for Large Language Model","authors":"Xia Hou, Qifeng Li, Jian Yang, Tongliang Li, Linzheng Chai, Xianjie\n  Wu, Hangyuan Ji, Zhoujun Li, Jixuan Nie, Jingbo Dun, Wenfeng Song","authorsParsed":[["Hou","Xia",""],["Li","Qifeng",""],["Yang","Jian",""],["Li","Tongliang",""],["Chai","Linzheng",""],["Wu","Xianjie",""],["Ji","Hangyuan",""],["Li","Zhoujun",""],["Nie","Jixuan",""],["Dun","Jingbo",""],["Song","Wenfeng",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 12:04:10 GMT"}],"updateDate":"2024-07-04","timestamp":1720008250000,"abstract":"  Instruction tuning as an effective technique aligns the outputs of large\nlanguage models (LLMs) with human preference. But how to generate the seasonal\nmulti-turn dialogues from raw documents for instruction tuning still requires\nfurther exploration. In this paper, we present a novel framework named R2S that\nleverages the CoD-Chain of Dialogue logic to guide large language models (LLMs)\nin generating knowledge-intensive multi-turn dialogues for instruction tuning.\nBy integrating raw documents from both open-source datasets and domain-specific\nweb-crawled documents into a benchmark K-BENCH, we cover diverse areas such as\nWikipedia (English), Science (Chinese), and Artifacts (Chinese). Our approach\nfirst decides the logic flow of the current dialogue and then prompts LLMs to\nproduce key phrases for sourcing relevant response content. This methodology\nenables the creation of the G I NSTRUCT instruction dataset, retaining raw\ndocument knowledge within dialoguestyle interactions. Utilizing this dataset,\nwe fine-tune GLLM, a model designed to transform raw documents into structured\nmulti-turn dialogues, thereby injecting comprehensive domain knowledge into the\nSFT model for enhanced instruction tuning. This work signifies a stride towards\nrefining the adaptability and effectiveness of LLMs in processing and\ngenerating more accurate, contextually nuanced responses across various fields.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bMfs1DIDSmGC1Qz-efdApeuirUoz0xC-d9rjtyjay6w","pdfSize":"963625"}
