{"id":"2407.18353","title":"Privacy-Preserving Hierarchical Model-Distributed Inference","authors":"Fatemeh Jafarian Dehkordi, Yasaman Keshtkarjahromi, Hulya Seferoglu","authorsParsed":[["Dehkordi","Fatemeh Jafarian",""],["Keshtkarjahromi","Yasaman",""],["Seferoglu","Hulya",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 19:39:03 GMT"},{"version":"v2","created":"Sun, 15 Sep 2024 22:27:16 GMT"}],"updateDate":"2024-09-17","timestamp":1721936343000,"abstract":"  This paper focuses on designing a privacy-preserving Machine Learning (ML)\ninference protocol for a hierarchical setup, where clients own/generate data,\nmodel owners (cloud servers) have a pre-trained ML model, and edge servers\nperform ML inference on clients' data using the cloud server's ML model. Our\ngoal is to speed up ML inference while providing privacy to both data and the\nML model. Our approach (i) uses model-distributed inference (model\nparallelization) at the edge servers and (ii) reduces the amount of\ncommunication to/from the cloud server. Our privacy-preserving hierarchical\nmodel-distributed inference, privateMDI design uses additive secret sharing and\nlinearly homomorphic encryption to handle linear calculations in the ML\ninference, and garbled circuit and a novel three-party oblivious transfer are\nused to handle non-linear functions. privateMDI consists of offline and online\nphases. We designed these phases in a way that most of the data exchange is\ndone in the offline phase while the communication overhead of the online phase\nis reduced. In particular, there is no communication to/from the cloud server\nin the online phase, and the amount of communication between the client and\nedge servers is minimized. The experimental results demonstrate that privateMDI\nsignificantly reduces the ML inference time as compared to the baselines.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"X50_McMTzE5Y0COxiZ9B0Iva2lDAjkmXrp6NKg9ZSr8","pdfSize":"382235"}
