{"id":"2407.09466","title":"TRAVERSE: Traffic-Responsive Autonomous Vehicle Experience & Rare-event\n  Simulation for Enhanced safety","authors":"Sandeep Thalapanane, Sandip Sharan Senthil Kumar, Guru Nandhan Appiya\n  Dilipkumar Peethambari, Sourang SriHari, Laura Zheng, Julio Poveda, and Ming\n  C. Lin","authorsParsed":[["Thalapanane","Sandeep",""],["Kumar","Sandip Sharan Senthil",""],["Peethambari","Guru Nandhan Appiya Dilipkumar",""],["SriHari","Sourang",""],["Zheng","Laura",""],["Poveda","Julio",""],["Lin","Ming C.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 17:46:29 GMT"}],"updateDate":"2024-07-15","timestamp":1720806389000,"abstract":"  Data for training learning-enabled self-driving cars in the physical world\nare typically collected in a safe, normal environment. Such data distribution\noften engenders a strong bias towards safe driving, making self-driving cars\nunprepared when encountering adversarial scenarios like unexpected accidents.\nDue to a dearth of such adverse data that is unrealistic for drivers to\ncollect, autonomous vehicles can perform poorly when experiencing such rare\nevents. This work addresses much-needed research by having participants drive a\nVR vehicle simulator going through simulated traffic with various types of\naccidental scenarios. It aims to understand human responses and behaviors in\nsimulated accidents, contributing to our understanding of driving dynamics and\nsafety. The simulation framework adopts a robust traffic simulation and is\nrendered using the Unity Game Engine. Furthermore, the simulation framework is\nbuilt with portable, light-weight immersive driving simulator hardware,\nlowering the resource barrier for studies in autonomous driving research.\n  Keywords: Rare Events, Traffic Simulation, Autonomous Driving, Virtual\nReality, User Studies\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nH1BD7Un9ZfJEyYHYqP7MHMQGbLV4B9OdFBEYnt1KRY","pdfSize":"1760208"}
