{"id":"2407.06042","title":"Near-Optimal MIMO Detection Using Gradient-Based MCMC in Discrete Spaces","authors":"Xingyu Zhou, Le Liang, Jing Zhang, Chao-Kai Wen, Shi Jin","authorsParsed":[["Zhou","Xingyu",""],["Liang","Le",""],["Zhang","Jing",""],["Wen","Chao-Kai",""],["Jin","Shi",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 15:39:48 GMT"}],"updateDate":"2024-07-09","timestamp":1720453188000,"abstract":"  The discrete nature of transmitted symbols poses challenges for achieving\noptimal detection in multiple-input multiple-output (MIMO) systems associated\nwith a large number of antennas. Recently, the combination of two powerful\nmachine learning methods, Markov chain Monte Carlo (MCMC) sampling and gradient\ndescent, has emerged as a highly efficient solution to address this issue.\nHowever, existing gradient-based MCMC detectors are heuristically designed and\nthus are theoretically untenable. To bridge this gap, we introduce a novel\nsampling algorithm tailored for discrete spaces. This algorithm leverages\ngradients from the underlying continuous spaces for acceleration while\nmaintaining the validity of probabilistic sampling. We prove the convergence of\nthis method and also analyze its convergence rate using both MCMC theory and\nempirical diagnostics. On this basis, we develop a MIMO detector that precisely\nsamples from the target discrete distribution and generates posterior Bayesian\nestimates using these samples, whose performance is thereby theoretically\nguaranteed. Furthermore, our proposed detector is highly parallelizable and\nscalable to large MIMO dimensions, positioning it as a compelling candidate for\nnext-generation wireless networks. Simulation results show that our detector\nachieves near-optimal performance, significantly outperforms state-of-the-art\nbaselines, and showcases resilience to various system setups.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}