{"id":"2407.10109","title":"Hardware-Efficient and Reliable Coherent DSCM Systems Enabled by\n  Single-Pilot-Tone-Based Polarization Demultiplexing","authors":"Wei Wang, Dongdong Zou, Weihao Ni, and Fan Li","authorsParsed":[["Wang","Wei",""],["Zou","Dongdong",""],["Ni","Weihao",""],["Li","Fan",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 07:41:42 GMT"}],"updateDate":"2024-07-16","timestamp":1720942902000,"abstract":"  Recently, coherent digital subcarrier multiplexing (DSCM) technology has\nbecome an attractive solution for next-generation ultra-high-speed datacenter\ninterconnects (DCIs). To meet the requirements of low-cost and low-power\nconsumption in DCI applications, a comprehensive simplification of the coherent\nDSCM system has been investigated. The pilot-tone-based polarization\ndemultiplexing (PT-PDM) technique, known for its low-power consumption and\nultra-fast polarization tracking capabilities, has emerged as a compelling\nalternative to the power-hungry N-tap adaptive multi-input multiple-output\n(MIMO) equalizer. However, the effectiveness of this PT-PDM technique is\nextremely vulnerable to the receiver-side XY-skew (Rx-XY-skew), which is\nrevealed in this paper for the first time. Then, a pilot-tone-enabled modified\nGodard phase detector (PT-MGPD) scheme is proposed to realize Rx-XY-skew\nestimation, serving as the prerequisite for the successful implementation of\nthe PT-PDM and simplification of the adaptive equalizer. Both the simulation\nand experiment are conducted to evaluate the accuracy of the proposed PT-MGPD\nscheme. The results prove it can achieve accurate estimation with an error of\nless than 0.3ps. Besides, a low-complexity, high-spectral-efficiency, and\nultra-fast polarization demultiplexing method based on a single pilot tone\n(SPT) is proposed for the DSCM system in this work. Based on the proposed\nPT-MGPD and SPT schemes, the conventional N-tap MIMO equalizer served for each\nsubcarrier can be successfully pruned into two polarization-independent\nsingle-input single-output equalizers, and there is no performance penalty even\nif the polarization rotation speed reaches 10Mrad/s. According to the results,\nthe proposed schemes provide a hardware-efficient and reliable coherent DSCM\nsolution for next-generation ultra-high-speed DCIs.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}