{"id":"2407.05838","title":"A novel metric for assessing climatological surface habitability","authors":"Hannah L. Woodward, Andrew J. Rushby, Nathan J. Mayne","authorsParsed":[["Woodward","Hannah L.",""],["Rushby","Andrew J.",""],["Mayne","Nathan J.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 11:38:04 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 13:10:27 GMT"}],"updateDate":"2024-07-31","timestamp":1720438684000,"abstract":"  Planetary surface habitability has so far been, in the main, considered in\nits entirety. The increasing popularity of 3D modelling studies of\n(exo)planetary climate has highlighted the need for a more nuanced\nunderstanding of surface habitability. Using satellite-derived data of\nphotosynthetic life to represent the observed surface habitability of modern\nEarth, we validate a set of climatologically-defined metrics previously used in\nexoplanetary habitability studies. The comparison finds that the metrics\ndefined by temperature show spatial patterns of habitability distinct to those\ndefined by aridity, with no metric able to completely replicate the observed.\nWe build upon these results to introduce a new metric defined by the observed\nthermal limits of modern Earth-based life, along with surface water fluxes as\nan analogue for water and nutrient availability. Furthermore, we pay attention\nto not only the thermal bounds of macroscopic complex life, but additionally\nthe limits of microbial life which have been vital to the generation of Earth's\nown biosignatures, thus expanding considerations of climatic habitability out\nof a historically binary definition. Repeating the validation for our metric\nfinds a significant improvement in the spatial representation of habitability,\nlaying the groundwork for more accurate assessments of potential\nlife-supporting environments upon other planets.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}