{"id":"2407.04239","title":"Enabling Multicast Transmission for Spatio-Temporally Asynchronous User\n  Requests in Wireless Environments","authors":"Hojung Lee, Jun-Pyo Hong, Wan Choi","authorsParsed":[["Lee","Hojung",""],["Hong","Jun-Pyo",""],["Choi","Wan",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 03:53:03 GMT"}],"updateDate":"2024-07-08","timestamp":1720151583000,"abstract":"  The surge in wireless devices and data traffic volume necessitates more\nefficient transmission methods. Multicasting has garnered consistent attention\nas a means to fulfill the increasing demand for more efficient data\ntransmission methods. Nevertheless, leveraging multicast wireless networks for\nspatio-temporally asynchronous data requests poses challenges. In this context,\nthis paper introduces a new multicast mechanism called \\emph{set-up based\nmerged multicast (SMMC)} to minimize the delivery time of the requested file in\nwireless networks by considering the uncertainties inherent in wireless\nchannels. The proposed mechanism comprises two phases. The first phase involves\ngathering asynchronous requests for a file from users experiencing diverse\nchannel conditions. During this phase, packets of the requested file are\ntransmitted individually in unicast mode within a specified set-up time.\nFollowing this, the second phase initiates multicast transmission, which\nsequentially handles the remaining packets of the file in multicast mode. In\nthe proposed mechanism, we optimize the set-up time and transmission rates of\nboth unicast and multicast modes to minimize the expected file delivery time by\njointly taking into account the statistical characteristics of wireless\nchannels, users' locations, and file popularity. Additionally, we also delve\ninto a \\emph{fine-tuned SMMC} by utilizing posterior information on the\nmulticast group size and further improve the performance. Our performance\nevaluations reveal that the proposed SMMC outperforms conventional unicast\nmethods, especially with high-demand data.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}