{"id":"2407.20845","title":"Assessing Graphical Perception of Image Embedding Models using Channel\n  Effectiveness","authors":"Soohyun Lee, Minsuk Chang, Seokhyeon Park, Jinwook Seo","authorsParsed":[["Lee","Soohyun",""],["Chang","Minsuk",""],["Park","Seokhyeon",""],["Seo","Jinwook",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 14:22:13 GMT"}],"updateDate":"2024-07-31","timestamp":1722349333000,"abstract":"  Recent advancements in vision models have greatly improved their ability to\nhandle complex chart understanding tasks, like chart captioning and question\nanswering. However, it remains challenging to assess how these models process\ncharts. Existing benchmarks only roughly evaluate model performance without\nevaluating the underlying mechanisms, such as how models extract image\nembeddings. This limits our understanding of the model's ability to perceive\nfundamental graphical components. To address this, we introduce a novel\nevaluation framework to assess the graphical perception of image embedding\nmodels. For chart comprehension, we examine two main aspects of channel\neffectiveness: accuracy and discriminability of various visual channels.\nChannel accuracy is assessed through the linearity of embeddings, measuring how\nwell the perceived magnitude aligns with the size of the stimulus.\nDiscriminability is evaluated based on the distances between embeddings,\nindicating their distinctness. Our experiments with the CLIP model show that it\nperceives channel accuracy differently from humans and shows unique\ndiscriminability in channels like length, tilt, and curvature. We aim to\ndevelop this work into a broader benchmark for reliable visual encoders,\nenhancing models for precise chart comprehension and human-like perception in\nfuture applications.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}