{"id":"2407.04073","title":"Deconfined quantum critical points in fermionic systems with spin-charge\n  separation","authors":"Niccol\\`o Baldelli, Arianna Montorsi, Sergi Juli\\`a-Farr\\'e, Maciej\n  Lewenstein, Matteo Rizzi, and Luca Barbiero","authorsParsed":[["Baldelli","Niccolò",""],["Montorsi","Arianna",""],["Julià-Farré","Sergi",""],["Lewenstein","Maciej",""],["Rizzi","Matteo",""],["Barbiero","Luca",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 17:30:48 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 12:29:35 GMT"},{"version":"v3","created":"Wed, 31 Jul 2024 12:45:12 GMT"}],"updateDate":"2024-08-01","timestamp":1720114248000,"abstract":"  Deconfined quantum critical points are exotic transition points not predicted\nby the Landau-Ginzburg-Wilson symmetry-breaking paradigm. They are associated\nto a one-point gap closing between distinct locally ordered phases, thus to a\ncontinuous phase transition. Because of this intrinsic criticality, at\ndeconfined quantum critical points algebraic decay of all the correlation\nfunctions is expected. Here, we show that it is possible to go beyond this\nassumption. Specifically, we consider one dimensional interacting fermions\nwhere the phenomenon of spin-charge separation arises. We first explore the low\nenergy regimes where a sine-Gordon Hamiltonian can provide accurate results. By\nmeans of a field theory approach we find that continuous phase transitions\nbetween different locally ordered phases can occur. As a consequence of the\ndecoupled spin and charge degrees of freedom, we find that in two cases only\none gap vanishes while the other remains finite. We then derive a microscopic\nmodel where such phase transitions take place. By performing a numerical\nanalysis, we unambiguously find that deconfined quantum critical points can\nindeed be further characterized by the long-range order of a parity operator\nsignaling the presence of a finite gap. Our results provide new interesting\ninsights on the widely investigated topic of quantum phase transitions.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Quantum Gases"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}