{"id":"2407.07288","title":"Structural Design Through Reinforcement Learning","authors":"Thomas Rochefort-Beaudoin, Aurelian Vadean, Niels Aage, Sofiane\n  Achiche","authorsParsed":[["Rochefort-Beaudoin","Thomas",""],["Vadean","Aurelian",""],["Aage","Niels",""],["Achiche","Sofiane",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 00:38:08 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 14:31:35 GMT"}],"updateDate":"2024-07-15","timestamp":1720571888000,"abstract":"  This paper introduces the Structural Optimization gym (SOgym), a novel\nopen-source Reinforcement Learning (RL) environment designed to advance machine\nlearning in Topology Optimization (TO). SOgym enables RL agents to generate\nphysically viable and structurally robust designs by integrating the physics of\nTO into the reward function. To enhance scalability, SOgym leverages\nfeature-mapping methods as a mesh-independent interface between the environment\nand the agent, allowing efficient interaction with the design variables\nregardless of mesh resolution. Baseline results use a model-free Proximal\nPolicy Optimization agent and a model-based DreamerV3 agent. Three observation\nspace configurations were tested. The TopOpt game-inspired configuration, an\ninteractive educational tool that improves students' intuition in designing\nstructures to minimize compliance under volume constraints, performed best in\nterms of performance and sample efficiency. The 100M parameter version of\nDreamerV3 produced structures within 54% of the baseline compliance achieved by\ntraditional optimization methods and a 0% disconnection rate, an improvement\nover supervised learning approaches that often struggle with disconnected load\npaths. When comparing the learning rates of the agents to those of engineering\nstudents from the TopOpt game experiment, the DreamerV3-100M model shows a\nlearning rate approximately four orders of magnitude lower, an impressive feat\nfor a policy trained from scratch through trial and error. These results\nsuggest RL's potential to solve continuous TO problems and its capacity to\nexplore and learn from diverse design solutions. SOgym provides a platform for\ndeveloping RL agents for complex structural design challenges and is publicly\navailable to support further research in the field.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}