{"id":"2407.18307","title":"Accurate, Precise, and Physically Self-consistent Ages and Metallicities\n  for 400,000 Solar Neighborhood Subgiant Branch Stars","authors":"David M. Nataf, Kevin C. Schlaufman, Henrique Reggiani, and Isabel\n  Hahn","authorsParsed":[["Nataf","David M.",""],["Schlaufman","Kevin C.",""],["Reggiani","Henrique",""],["Hahn","Isabel",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 18:00:13 GMT"}],"updateDate":"2024-07-29","timestamp":1721930413000,"abstract":"  Age is the most difficult fundamental stellar parameter to infer for isolated\nstars. While isochrone-based ages are in general imprecise for both main\nsequence dwarfs and red giants, precise isochrone-based ages can be obtained\nfor stars on the subgiant branch transitioning from core to shell hydrogen\nburning. We synthesize Gaia DR3-based distance inferences, multiwavelength\nphotometry from the ultraviolet to the mid infrared, and three-dimensional\nextinction maps to construct a sample of 289,759 solar-metallicity stars\namenable to accurate, precise, and physically self-consistent age inferences.\nUsing subgiants in the solar-metallicity open clusters NGC 2682 (i.e., M 67)\nand NGC 188, we show that our approach yields accurate and physically\nself-consistent ages and metallicities with median statistical precisions of\n8\\% and 0.06 dex. The inclusion of systematic uncertainties resulting from\nnon-single or variable stars results in age and metallicity precisions of 9\\%\nand 0.12 dex. We supplement this solar-metallicity sample with an additional\n112,062 metal-poor subgiants, including over 3,000 stars with\n$[\\text{Fe/H}]\\lesssim-1.50$, 7\\% age precisions, and apparent Gaia $G$-band\nmagnitudes $G<14$. We further demonstrate that our inferred metallicities agree\nwith those produced by multiplexed spectroscopic surveys. As an example of the\nscientific potential of this catalog, we show that the solar neighborhood\nstar-formation history has three components at $([\\text{Fe/H}],\\tau/\\text{Gyr})\n\\approx (+0.0,4)$, $(+0.2,7)$, and a roughly linear sequence in\nage--metallicity space beginning at\n$([\\text{Fe/H}],\\tau/\\text{Gyr})\\approx(+0.2,7)$ and extending to $(-0.5,13)$.\nOur analyses indicate that the solar neighborhood includes stars on disk-like\norbits even at the oldest ages and lowest metallicities accessible by our\nsamples.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"DhPVXo_3YP1IJwDfRt8nHqDu7EUD6PtONEujh3YhBKs","pdfSize":"2868947"}
