{"id":"2407.15006","title":"Fair Machine Learning for Healthcare Requires Recognizing the\n  Intersectionality of Sociodemographic Factors, a Case Study","authors":"Alissa A. Valentine, Alexander W. Charney, Isotta Landi","authorsParsed":[["Valentine","Alissa A.",""],["Charney","Alexander W.",""],["Landi","Isotta",""]],"versions":[{"version":"v1","created":"Thu, 30 May 2024 19:10:35 GMT"}],"updateDate":"2024-07-23","timestamp":1717096235000,"abstract":"  As interest in implementing artificial intelligence (AI) in medical systems\ngrows, discussion continues on how to evaluate the fairness of these systems,\nor the disparities they may perpetuate. Socioeconomic status (SES) is commonly\nincluded in machine learning models to control for health inequities, with the\nunderlying assumption that increased SES is associated with better health. In\nthis work, we considered a large cohort of patients from the Mount Sinai Health\nSystem in New York City to investigate the effect of patient SES, race, and sex\non schizophrenia (SCZ) diagnosis rates via a logistic regression model. Within\nan intersectional framework, patient SES, race, and sex were found to have\nsignificant interactions. Our findings showed that increased SES is associated\nwith a higher probability of obtaining a SCZ diagnosis in Black Americans\n($\\beta=4.1\\times10^{-8}$, $SE=4.5\\times10^{-9}$, $p < 0.001$). Whereas high\nSES acts as a protective factor for SCZ diagnosis in White Americans\n($\\beta=-4.1\\times10^{-8}$, $SE=6.7\\times10^{-9}$, $p < 0.001$). Further\ninvestigation is needed to reliably explain and quantify health disparities.\nNevertheless, we advocate that building fair AI tools for the health care space\nrequires recognizing the intersectionality of sociodemographic factors.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"D1OGKvKqdStXrxikKAl7mmSituO_FbB5Jzbaa5j2DDM","pdfSize":"286767"}
