{"id":"2407.10834","title":"MetaLLM: A High-performant and Cost-efficient Dynamic Framework for\n  Wrapping LLMs","authors":"Quang H. Nguyen, Duy C. Hoang, Juliette Decugis, Saurav Manchanda,\n  Nitesh V. Chawla, Khoa D. Doan","authorsParsed":[["Nguyen","Quang H.",""],["Hoang","Duy C.",""],["Decugis","Juliette",""],["Manchanda","Saurav",""],["Chawla","Nitesh V.",""],["Doan","Khoa D.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 15:45:07 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 08:14:50 GMT"}],"updateDate":"2024-07-25","timestamp":1721058307000,"abstract":"  The rapid progress in machine learning (ML) has brought forth many large\nlanguage models (LLMs) that excel in various tasks and areas. These LLMs come\nwith different abilities and costs in terms of computation or pricing. Since\nthe demand for each query can vary, e.g., because of the queried domain or its\ncomplexity, defaulting to one LLM in an application is not usually the best\nchoice, whether it is the biggest, priciest, or even the one with the best\naverage test performance. Consequently, picking the right LLM that is both\naccurate and cost-effective for an application remains a challenge. In this\npaper, we introduce MetaLLM, a framework that dynamically and intelligently\nroutes each query to the optimal LLM (among several available LLMs) for\nclassification tasks, achieving significantly improved accuracy and\ncost-effectiveness. By framing the selection problem as a multi-armed bandit,\nMetaLLM balances prediction accuracy and cost efficiency under uncertainty. Our\nexperiments, conducted on popular LLM platforms such as OpenAI's GPT models,\nAmazon's Titan, Anthropic's Claude, and Meta's LLaMa, showcase MetaLLM's\nefficacy in real-world scenarios, laying the groundwork for future extensions\nbeyond classification tasks.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eFr8sSExspnOuuB-4MZkrfgpFR4HmBQaAXjz3Ll4-_4","pdfSize":"554055"}
