{"id":"2407.09179","title":"Magnetic properties and field-induced phenomena in the Jeff = 1/2\n  distorted kagome antiferromagnet","authors":"A. Yadav, A. Elghandour, T. Arh, D. T. Adroja, M. D. Le, G. B. G.\n  Stenning, M. Aouane, S. Luther, F. Hotz, T. J. Hicken, H. Luetkens, A. Zorko,\n  R. Klingeler, and P. Khuntia","authorsParsed":[["Yadav","A.",""],["Elghandour","A.",""],["Arh","T.",""],["Adroja","D. T.",""],["Le","M. D.",""],["Stenning","G. B. G.",""],["Aouane","M.",""],["Luther","S.",""],["Hotz","F.",""],["Hicken","T. J.",""],["Luetkens","H.",""],["Zorko","A.",""],["Klingeler","R.",""],["Khuntia","P.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 11:22:30 GMT"}],"updateDate":"2024-07-15","timestamp":1720783350000,"abstract":"  The intertwining between competing degrees of freedom, anisotropy, and\nfrustration-induced quantum fluctuations offers an ideal ground to realize\nexotic quantum phenomena in the rare-earth-based kagome lattice. The magnetic\nsusceptibility reveals the presence of two energy scales in agreement with the\nINS results. The higher energy state is dominated by CEF excitations, where the\nlowest Kramers ground-state doublet is well separated from the excited state\nsuggesting that the compound realizes a low-energy state at low temperatures.\nThe second energy scale is witnessed via thermodynamic results that reveal an\nanomaly at 0.3 K typical of a phase transition, which is attributed to the\npresence of complex magnetic ordering phenomena. The broad maximum in the\nspecific heat well above 0.3 K indicates the presence of short-range spin\ncorrelations that is corroborated by muon spin relaxation rate results. The\nisothermal magnetization reveals a field-induced 1/3 magnetization plateau at\nlow temperatures. muSR relaxation rate experiments, on the other hand, neither\nshow the signature of a phase transition nor spin-freezing down to 34 mK. The\nZF muSR relaxation is governed by the Orbach process and reveals the presence\nof a fluctuating state owing to the depopulation of crystal field levels\nreflected as a constant value of relaxation rate in the temperature range\n0.4-10 K. NMR results indicate the presence of fluctuating Nd3+ moments down to\n1.8 K consistent with muSR experiments. Our comprehensive results reveal that a\nfield-induced quantum critical phenomenon is at play in this frustrated kagome\nmagnet and enable us to construct a phase diagram exemplifying the proximity\neffect of competing magnetic states. This sets the stage to investigate the\nbroad RE3BWO9 family of rare-earth kagome magnets promising to host exotic\nquantum states driven by spin-orbit coupling and geometrical frustration.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}