{"id":"2407.02376","title":"A new subclass of gamma-ray burst originating from compact binary merger","authors":"Chen-Wei Wang, Wen-Jun Tan, Shao-Lin Xiong, Shu-Xu Yi, Rahim Moradi,\n  Bing Li, Zhen Zhang, Yu Wang, Yan-Zhi Meng, Jia-Cong Liu, Yue Wang, Sheng-Lun\n  Xie, Wang-Chen Xue, Zheng-Hang Yu, Peng Zhang, Wen-Long Zhang, Yan-Qiu Zhang,\n  Chao Zheng","authorsParsed":[["Wang","Chen-Wei",""],["Tan","Wen-Jun",""],["Xiong","Shao-Lin",""],["Yi","Shu-Xu",""],["Moradi","Rahim",""],["Li","Bing",""],["Zhang","Zhen",""],["Wang","Yu",""],["Meng","Yan-Zhi",""],["Liu","Jia-Cong",""],["Wang","Yue",""],["Xie","Sheng-Lun",""],["Xue","Wang-Chen",""],["Yu","Zheng-Hang",""],["Zhang","Peng",""],["Zhang","Wen-Long",""],["Zhang","Yan-Qiu",""],["Zheng","Chao",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 15:44:54 GMT"}],"updateDate":"2024-07-03","timestamp":1719935094000,"abstract":"  Type I gamma-ray bursts (GRBs) are believed to originate from compact binary\nmerger usually with duration less than 2 seconds for the main emission.\nHowever, recent observations of GRB 211211A and GRB 230307A indicate that some\nmerger-origin GRBs could last much longer. Since they show strikingly similar\nproperties (indicating a common mechanism) which are different from the classic\n\"long\"-short burst (e.g. GRB 060614), forming an interesting subclass of type I\nGRBs, we suggest to name them as type IL GRBs. By identifying the first peak of\nGRB 230307A as a quasi-thermal precursor, we find that the prompt emission of\ntype IL GRB is composed of three episodes: (1) a precursor followed by a short\nquiescent (or weak emission) period, (2) a long-duration main emission, and (3)\nan extended emission. With this burst pattern, a good candidate, GRB 170228A,\nwas found in the Fermi/GBM archive data, and subsequent temporal and spectral\nanalyses indeed show that GRB 170228A falls in the same cluster with GRB\n211211A and GRB 230307A in many diagnostic figures. Thus this burst pattern\ncould be a good reference for rapidly identifying type IL GRB and conducting\nlow-latency follow-up observation. We estimated the occurrence rate and\ndiscussed the physical origins and implications for the three emission episodes\nof type IL GRBs. Our analysis suggests the pre-merger precursor model,\nespecially the super flare model, is more favored for type IL GRBs.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}