{"id":"2407.06952","title":"Domain theory in univalent foundations I: Directed complete posets and\n  Scott's $D_\\infty$","authors":"Tom de Jong","authorsParsed":[["de Jong","Tom",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 15:32:21 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 09:40:08 GMT"},{"version":"v3","created":"Thu, 18 Jul 2024 11:47:45 GMT"}],"updateDate":"2024-07-19","timestamp":1720539141000,"abstract":"  We develop domain theory in constructive and predicative univalent\nfoundations (also known as homotopy type theory). That we work predicatively\nmeans that we do not assume Voevodsky's propositional resizing axioms. Our work\nis constructive in the sense that we do not rely on excluded middle or the\naxiom of (countable) choice. Domain theory studies so-called directed complete\nposets (dcpos) and Scott continuous maps between them and has applications in a\nvariety of fields, such as programming language semantics, higher-type\ncomputability and topology. A common approach to deal with size issues in a\npredicative foundation is to work with information systems, abstract bases or\nformal topologies rather than dcpos, and approximable relations rather than\nScott continuous functions. In our type-theoretic approach, we instead accept\nthat dcpos may be large and work with type universes to account for this. A\npriori one might expect that iterative constructions of dcpos may result in a\nneed for ever-increasing universes and are predicatively impossible. We show,\nthrough a careful tracking of type universe parameters, that such constructions\ncan be carried out in a predicative setting. In particular, we give a\npredicative reconstruction of Scott's $D_\\infty$ model of the untyped\n$\\lambda$-calculus. Our work is formalised in the Agda proof assistant and its\nability to infer universe levels has been invaluable for our purposes.\n","subjects":["Computing Research Repository/Logic in Computer Science","Mathematics/Logic"],"license":"http://creativecommons.org/licenses/by/4.0/"}