{"id":"2407.14290","title":"Evaluation of Provenance Serialisations for Astronomical Provenance","authors":"Michael A. C. Johnson and Marcus Paradies and Hans-Rainer Kl\\\"ockner\n  and Albina Muzafarova and Kristen Lackeos and David J. Champion and Marta\n  Dembska and Sirko Schindler","authorsParsed":[["Johnson","Michael A. C.",""],["Paradies","Marcus",""],["Klöckner","Hans-Rainer",""],["Muzafarova","Albina",""],["Lackeos","Kristen",""],["Champion","David J.",""],["Dembska","Marta",""],["Schindler","Sirko",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:19:47 GMT"}],"updateDate":"2024-07-22","timestamp":1721395187000,"abstract":"  Provenance data from astronomical pipelines are instrumental in establishing\ntrust and reproducibility in the data processing and products. In addition,\nastronomers can query their provenance to answer questions routed in areas such\nas anomaly detection, recommendation, and prediction. The next generation of\nastronomical survey telescopes such as the Vera Rubin Observatory or Square\nKilometre Array, are capable of producing peta to exabyte scale data, thereby\namplifying the importance of even small improvements to the efficiency of\nprovenance storage or querying. In order to determine how astronomers should\nstore and query their provenance data, this paper reports on a comparison\nbetween the turtle and JSON provenance serialisations. The triple store Apache\nJena Fuseki and the graph database system Neo4j were selected as representative\ndatabase management systems (DBMS) for turtle and JSON, respectively. Simulated\nprovenance data was uploaded to and queried over each DBMS and the metrics\nmeasured for comparison were the accuracy and timing of the queries as well as\nthe data upload times. It was found that both serialisations are competent for\nthis purpose, and both have similar query accuracy. The turtle provenance was\nfound to be more efficient at storing and uploading the data. Regarding\nqueries, for small datasets ($<$5MB) and simple information retrieval queries,\nthe turtle serialisation was also found to be more efficient. However, queries\nfor JSON serialised provenance were found to be more efficient for more complex\nqueries which involved matching patterns across the DBMS, this effect scaled\nwith the size of the queried provenance.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oGhAfTXPdW8mL3vBcQfKcp1mk7-7T3VUk-f-pBb5UgA","pdfSize":"412495","objectId":"0x199793cd79a40e7767103901a2e8ac67a15c62da3bfea23a4b09919166dc6ab6","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
