{"id":"2407.08223","title":"Speculative RAG: Enhancing Retrieval Augmented Generation through\n  Drafting","authors":"Zilong Wang, Zifeng Wang, Long Le, Huaixiu Steven Zheng, Swaroop\n  Mishra, Vincent Perot, Yuwei Zhang, Anush Mattapalli, Ankur Taly, Jingbo\n  Shang, Chen-Yu Lee, Tomas Pfister","authorsParsed":[["Wang","Zilong",""],["Wang","Zifeng",""],["Le","Long",""],["Zheng","Huaixiu Steven",""],["Mishra","Swaroop",""],["Perot","Vincent",""],["Zhang","Yuwei",""],["Mattapalli","Anush",""],["Taly","Ankur",""],["Shang","Jingbo",""],["Lee","Chen-Yu",""],["Pfister","Tomas",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 06:50:19 GMT"}],"updateDate":"2024-07-12","timestamp":1720680619000,"abstract":"  Retrieval augmented generation (RAG) combines the generative abilities of\nlarge language models (LLMs) with external knowledge sources to provide more\naccurate and up-to-date responses. Recent RAG advancements focus on improving\nretrieval outcomes through iterative LLM refinement or self-critique\ncapabilities acquired through additional instruction tuning of LLMs. In this\nwork, we introduce Speculative RAG - a framework that leverages a larger\ngeneralist LM to efficiently verify multiple RAG drafts produced in parallel by\na smaller, distilled specialist LM. Each draft is generated from a distinct\nsubset of retrieved documents, offering diverse perspectives on the evidence\nwhile reducing input token counts per draft. This approach enhances\ncomprehension of each subset and mitigates potential position bias over long\ncontext. Our method accelerates RAG by delegating drafting to the smaller\nspecialist LM, with the larger generalist LM performing a single verification\npass over the drafts. Extensive experiments demonstrate that Speculative RAG\nachieves state-of-the-art performance with reduced latency on TriviaQA,\nMuSiQue, PubHealth, and ARC-Challenge benchmarks. It notably enhances accuracy\nby up to 12.97% while reducing latency by 51% compared to conventional RAG\nsystems on PubHealth.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}