{"id":"2407.17666","title":"Causal estimands and identification of time-varying effects in\n  non-stationary time series from N-of-1 mobile device data","authors":"Xiaoxuan Cai, Li Zeng, Charlotte Fowler, Lisa Dixon, Dost Ongur,\n  Justin T. Baker, Jukka-Pekka Onnela, Linda Valeri","authorsParsed":[["Cai","Xiaoxuan",""],["Zeng","Li",""],["Fowler","Charlotte",""],["Dixon","Lisa",""],["Ongur","Dost",""],["Baker","Justin T.",""],["Onnela","Jukka-Pekka",""],["Valeri","Linda",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 22:37:20 GMT"}],"updateDate":"2024-07-26","timestamp":1721860640000,"abstract":"  Mobile technology (mobile phones and wearable devices) generates continuous\ndata streams encompassing outcomes, exposures and covariates, presented as\nintensive longitudinal or multivariate time series data. The high frequency of\nmeasurements enables granular and dynamic evaluation of treatment effect,\nrevealing their persistence and accumulation over time. Existing methods\npredominantly focus on the contemporaneous effect, temporal-average, or\npopulation-average effects, assuming stationarity or invariance of treatment\neffects over time, which are inadequate both conceptually and statistically to\ncapture dynamic treatment effects in personalized mobile health data. We here\npropose new causal estimands for multivariate time series in N-of-1 studies.\nThese estimands summarize how time-varying exposures impact outcomes in both\nshort- and long-term. We propose identifiability assumptions and a g-formula\nestimator that accounts for exposure-outcome and outcome-covariate feedback.\nThe g-formula employs a state space model framework innovatively to accommodate\ntime-varying behavior of treatment effects in non-stationary time series. We\napply the proposed method to a multi-year smartphone observational study of\nbipolar patients and estimate the dynamic effect of phone-based communication\non mood of patients with bipolar disorder in an N-of-1 setting. Our approach\nreveals substantial heterogeneity in treatment effects over time and across\nindividuals. A simulation-based strategy is also proposed for the development\nof a short-term, dynamic, and personalized treatment recommendation based on\npatient's past information, in combination with a novel positivity diagnostics\nplot, validating proper causal inference in time series data.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}