{"id":"2407.16019","title":"The mysterious magnetic ground state of Ba14MnBi11 is likely\n  altermagnetic","authors":"Po-Hao Chang and Igor I. Mazin","authorsParsed":[["Chang","Po-Hao",""],["Mazin","Igor I.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 19:50:29 GMT"}],"updateDate":"2024-07-24","timestamp":1721677829000,"abstract":"  Mn-based transition metal Zintl compounds in the 14-1-11 phase are known to\nhost complex atomic and magnetic structures owing to their intricate crystal\nstructure. Among them, Ba14MnBi11 stands out as one of the least understood\ncompounds, with experimental measurements and theoretical findings largely\ninconsistent. Following up on the earlier attempt [D. Sanchez-Portal et al.,\nPRB 65, 144414 (2002)] at establishing a connection between metallicity and\nmagnetism through a DFT-based analysis, our work aims to provide additional\ninsights to resolve the existing contradictions. Our key finding is that the\nmagnetic ground state is very susceptible to charge doping. DFT calculations\nfor stoichiometric Ba14MnBi11 give a rather stable ferromagnetic metallic\nground state. However, by adding exactly one additional electron per Mn, the\nsystem becomes semiconducting and the magnetic ground state becomes weakly\nantiferromagnetic (AF). On the other hand, upon small hole doping the system\ntransitions to a special type of AF state known as altermagnetic ordering. The\nobserved trends suggest that hole and electron doping-induced phase transitions\nlikely result from different underlying mechanisms, influencing various\nexchange pathways. Additionally, our projected density-of-states along with\nbandstructure analyses indicate that, besides the largest hole contribution\ncoming from the tetrahedral unit of Bi, the isolated Bi sites also play a\nsubstantial role and the dispersive bands near VBM suggest a rather complex\nhybridization network involving both Bi band characters. Through a\ncomprehensive comparison of available data and our analysis, we propose that\nthe inconsistency in magnetic states between experimental findings and DFT\ncalculations is due to nonstoichiometric effects, likely impurities or defects.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"E6SpOrI0v7OpRS8qcPR2iP-8gd1jLxmcx3MoLSA6W_I","pdfSize":"3658814"}
