{"id":"2407.02178","title":"Reverse time-to-death as time-scale in time-to-event analysis for\n  studies of advanced illness and palliative care","authors":"Yin Bun Cheung, Xiangmei Ma, Isha Chaudhry, Nan Liu, Qingyuan Zhuang,\n  Grace Meijuan Yang, Chetna Malhotra, and Eric Andrew Finkelstein","authorsParsed":[["Cheung","Yin Bun",""],["Ma","Xiangmei",""],["Chaudhry","Isha",""],["Liu","Nan",""],["Zhuang","Qingyuan",""],["Yang","Grace Meijuan",""],["Malhotra","Chetna",""],["Finkelstein","Eric Andrew",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 11:36:07 GMT"}],"updateDate":"2024-07-03","timestamp":1719920167000,"abstract":"  Background: Incidence of adverse outcome events rises as patients with\nadvanced illness approach end-of-life. Exposures that tend to occur near\nend-of-life, e.g., use of wheelchair, oxygen therapy and palliative care, may\ntherefore be found associated with the incidence of the adverse outcomes. We\npropose a strategy for time-to-event analysis to mitigate the time-varying\nconfounding. Methods: We propose a concept of reverse time-to-death (rTTD) and\nits use for the time-scale in time-to-event analysis. We used data on\ncommunity-based palliative care uptake (exposure) and emergency department\nvisits (outcome) among patients with advanced cancer in Singapore to\nillustrate. We compare the results against that of the common practice of using\ntime-on-study (TOS) as time-scale. Results: Graphical analysis demonstrated\nthat cancer patients receiving palliative care had higher rate of emergency\ndepartment visits than non-recipients mainly because they were closer to\nend-of-life, and that rTTD analysis made comparison between patients at the\nsame time-to-death. Analysis of emergency department visits in relation to\npalliative care using TOS time-scale showed significant increase in hazard\nratio estimate when observed time-varying covariates were omitted from\nstatistical adjustment (change-in-estimate=0.38; 95% CI 0.15 to 0.60). There\nwas no such change in otherwise the same analysis using rTTD\n(change-in-estimate=0.04; 95% CI -0.02 to 0.11), demonstrating the ability of\nrTTD time-scale to mitigate confounding that intensifies in relation to\ntime-to-death. Conclusion: Use of rTTD as time-scale in time-to-event analysis\nprovides a simple and robust approach to control time-varying confounding in\nstudies of advanced illness, even if the confounders are unmeasured.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/"}