{"id":"2407.12701","title":"Efficient and Flexible Differet-Radix Montgomery Modular Multiplication\n  for Hardware Implementation","authors":"Yuxuan Zhang, Hua Guo, Chen Chen, Yewei Guan, Xiyong Zhang and Zhenyu\n  Guan","authorsParsed":[["Zhang","Yuxuan",""],["Guo","Hua",""],["Chen","Chen",""],["Guan","Yewei",""],["Zhang","Xiyong",""],["Guan","Zhenyu",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 16:24:15 GMT"}],"updateDate":"2024-07-18","timestamp":1721233455000,"abstract":"  Montgomery modular multiplication is widely-used in public key cryptosystems\n(PKC) and affects the efficiency of upper systems directly. However, modulus is\ngetting larger due to the increasing demand of security, which results in a\nheavy computing cost. High-performance implementation of Montgomery modular\nmultiplication is urgently required to ensure the highly-efficient operations\nin PKC. However, existing high-speed implementations still need a large amount\nredundant computing to simplify the intermediate result. Supports to the\nredundant representation is extremely limited on Montgomery modular\nmultiplication. In this paper, we propose an efficient parallel variant of\niterative Montgomery modular multiplication, called DRMMM, that allows the\nquotient can be computed in multiple iterations. In this variant, terms in\nintermediate result and the quotient in each iteration are computed in\ndifferent radix such that computation of the quotient can be pipelined. Based\non proposed variant, we also design high-performance hardware implementation\narchitecture for faster operation. In the architecture, intermediate result in\nevery iteration is denoted as three parts to free from redundant computations.\nFinally, to support FPGA-based systems, we design operators based on FPGA\nunderlying architecture for better area-time performance. The result of\nimplementation and experiment shows that our method reduces the output latency\nby 38.3\\% than the fastest design on FPGA.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}