{"id":"2407.19191","title":"Network sampling based inference for subgraph counts and clustering\n  coefficient in a Stochastic Block Model framework with some extensions to a\n  sparse case","authors":"Anirban Mandal, Arindam Chatterjee","authorsParsed":[["Mandal","Anirban",""],["Chatterjee","Arindam",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 07:14:01 GMT"}],"updateDate":"2024-07-30","timestamp":1722064441000,"abstract":"  Sampling is frequently used to collect data from large networks. In this\narticle we provide valid asymptotic prediction intervals for subgraph counts\nand clustering coefficient of a population network when a network sampling\nscheme is used to observe the population. The theory is developed under a model\nbased framework, where it is assumed that the population network is generated\nby a Stochastic Block Model (SBM). We study the effects of induced and\nego-centric network formation, following the initial selection of nodes by\nBernoulli sampling, and establish asymptotic normality of sample based subgraph\ncount and clustering coefficient statistic under both network formation\nmethods. The asymptotic results are developed under a joint design and model\nbased approach, where the effect of sampling design is not ignored. In case of\nthe sample based clustering coefficient statistic, we find that a bias\ncorrection is required in the ego-centric case, but there is no such bias in\nthe induced case. We also extend the asymptotic normality results for estimated\nsubgraph counts to a mildly sparse SBM framework, where edge probabilities\ndecay to zero at a slow rate. In this sparse setting we find that the scaling\nand the maximum allowable decay rate for edge probabilities depend on the\nchoice of the target subgraph. We obtain an expression for this maximum\nallowable decay rate and our results suggest that the rate becomes slower if\nthe target subgraph has more edges in a certain sense. The simulation results\nsuggest that the proposed prediction intervals have excellent coverage, even\nwhen the node selection probability is small and unknown SBM parameters are\nreplaced by their estimates. Finally, the proposed methodology is applied to a\nreal data set.\n","subjects":["Mathematics/Statistics Theory","Statistics/Methodology","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UkwOp0e20IOCgHMVUvVToCe5iDKK9CbdDKJfi9FhcMU","pdfSize":"1120410"}
