{"id":"2407.20416","title":"Evolution of Extremely Soft Binaries in Dense Star Clusters: On the\n  Jupiter Mass Binary Objects","authors":"Yihan Wang, Rosalba Perna, Zhaohuan Zhu and Douglas N. C. Lin","authorsParsed":[["Wang","Yihan",""],["Perna","Rosalba",""],["Zhu","Zhaohuan",""],["Lin","Douglas N. C.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 20:59:50 GMT"}],"updateDate":"2024-07-31","timestamp":1722286790000,"abstract":"  Star-forming regions, characterized by dense environments, experience\nfrequent encounters that significantly influence binary systems, leading to\ntheir hardening, softening, or ionization. We extend the Hut \\& Bahcall\nformalism to derive an analytical expression for the ionization cross-section\nin extreme mass ratio binary systems, allowing us to investigate the orbital\nevolution and population dynamics of binary planets and binary brown dwarfs in\nstar clusters, while considering ongoing binary system formation. Our findings\nreveal that for low-mass soft binaries, the semi-major axis distribution\nasymptotes to a universal power law between $\\propto a^{-8/3}$ and $\\propto\na^{-5/3}$ over the derived ionization timescale. We also discuss the\nimplications of our results for the candidate Jupiter-mass binary objects\nputatively reported in the Trapezium cluster. We demonstrate that if their\nexistence is verified, they likely form continuously with a spectrum\nproportional to $a^{1}$, aligning better with the ejection mechanism than with\nthe in-situ formation mechanism, which predicts a distribution roughly\nproportional to $a^{-1}$. However, this implies an impractically high ejection\nformation rate. Alternatively, if these objects are binary brown dwarfs,\ncontinuous in-situ formation ($\\propto a^{-1}$) with an initial minimal\nsemi-major axis around 20 AU and a formation rate of 100 Myr$^{-1}$ plausibly\nmatches the observed number of single objects, binary number, binary fraction,\nand semi-major axis distribution.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}