{"id":"2407.18814","title":"Agent-Based Insight into Eco-Choices: Simulating the Fast Fashion Shift","authors":"Daria Soboleva, Angel S\\'anchez","authorsParsed":[["Soboleva","Daria",""],["Sánchez","Angel",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 15:24:05 GMT"}],"updateDate":"2024-07-29","timestamp":1722007445000,"abstract":"  Fashion is a powerful force in the modern world. It is one of the most\naccessible means of self-expression, thereby playing a significant role in our\nsociety. Yet, it is plagued by well-documented issues of waste and human rights\nabuses. Fast fashion in particular, characterized by its disposable nature,\ncontributes extensively to environmental degradation and CO$_2$ emissions,\nsurpassing the combined outputs of France, Germany, and the UK, but its\neconomic contributions have somewhat shielded it from criticism. In this paper,\nwe examine the demand for fast fashion, with a focus on Spain. We explore the\nindividual decision-making process involved in choosing to buy fast fashion and\nthe role of awareness regarding working conditions, environmental consequences,\nand education on sustainable fashion in influencing consumer behavior. By\nemploying Agent-Based Modeling, we investigate the factors influencing garment\nconsumption patterns and how shifts in public opinion can be achieved through\npeer pressure, social media influence, and government interventions. Our study\nrevealed that government interventions are pivotal, with the state's campaigns\nsetting the overall tone for progress, although its success is conditioned by\nsocial media and polarization levels of the population. Importantly, the state\ndoes not need to adopt an extremely proactive stance or continue the campaigns\nindefinitely to achieve optimal results, as excessive interventions yield\ndiminishing returns.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"j6h71epsCUnN1MXPSz5ztd8NkSuAK9yyIIH8xrzp3kQ","pdfSize":"2771290"}
