{"id":"2407.12167","title":"Modeling Kinetic Effects of Charged Vacancies on Electromechanical\n  Responses of Ferroelectrics: Rayleighian Approach","authors":"Rajeev Kumar, Shuaifang Zhang and P. Ganesh","authorsParsed":[["Kumar","Rajeev",""],["Zhang","Shuaifang",""],["Ganesh","P.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 20:42:42 GMT"}],"updateDate":"2024-07-18","timestamp":1721162562000,"abstract":"  Understanding time-dependent effects of charged vacancies on\nelectromechanical responses of materials is at the forefront of research for\ndesigning materials exhibiting metal-insulator transition, and memresistive\nbehavior. A Rayleighian approach is used to develop a model for studying the\nnon-linear kinetics of reaction leading to generation of vacancies and\nelectrons by the dissociation of vacancy-electron pairs. Also, diffusion and\nelastic effects of charged vacancies are considered to model\npolarization-electric potential and strain-electric potential hysteresis loops.\nThe model captures multi-physics phenomena by introducing couplings among\npolarization, electric potential, stress, strain, and concentrations of charged\n(multivalent) vacancies and electrons (treated as classical negatively charged\nparticles), where the concentrations can vary due to association-dissociation\nreactions. Derivation of coupled time-dependent equations based on the\nRayleighian approach is presented. Three limiting cases of the governing\nequations are considered highlighting effects of 1) non-linear reaction\nkinetics on the generation of charged vacancies and electrons, 2) the Vegard's\nlaw (i.e., the concentration-dependent local strain) on asymmetric\nstrain-electric potential relations, and 3) coupling between a fast component\nand the slow component of the net polarization on the polarization-electric\nfield relations. The Rayleighian approach discussed in this work should pave\nthe way for developing a multi-scale modeling framework in a thermodynamically\nconsistent manner while capturing multi-physics phenomena in ferroelectric\nmaterials.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Kah2vH_6hj_5PQIOkvf12oc-CKHSkjmZuOvj4XXzdYU","pdfSize":"438819"}
