{"id":"2407.01324","title":"Superlubric Brownian Motor","authors":"Keren Stein, Gautham Vijayan, Ron Bessler and Elad Koren","authorsParsed":[["Stein","Keren",""],["Vijayan","Gautham",""],["Bessler","Ron",""],["Koren","Elad",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 14:29:46 GMT"}],"updateDate":"2024-07-02","timestamp":1719844186000,"abstract":"  Brownian motors are nanoscale machines that utilize asymmetric physical\ninteractions to generate directed motion in space. The operation mechanism\nrelies on the random motion of nanoscale elements generated by thermal\nactivation. On the other hand, structural superlubricity (SSL) refers to a\nstate of nearly vanishing friction due to structural mismatch between sliding\ninterfaces. Van-der-Waals layered materials, such as graphene are of particular\ninterest in this regard as they exhibit atomically flat surfaces and weak\ninterlayer interaction. In particular, the sliding barrier in these systems\nturned out to be extremely sensitive to temperature, leading to the observation\nof thermal lubrication at elevated temperatures. Herein, the unique combination\nof a carefully designed tilted periodic potential landscape and virtually zero\nfriction in incommensurate 2D layered systems are used to realize a mesoscopic\nsuperlubric Brownian machine. In particular, we perform mechanical shearing of\nsuperlubric graphite contacts to examine the influence of velocity on friction\nand adhesion. Our results show that while friction is virtually independent of\nvelocity below 2500 nm*sec-1, the conservative adhesion force increases by ~ 10\n% with respect to the lowest measured velocity. Intriguingly, a greater amount\nof energy can be collected by the system once the retraction velocity is set\nabove the protraction velocity. Our numerical calculations based on force field\nmodelling indicate that a slow adiabatic sliding allows to utilize the\navailable thermal energy to reduce the adhesion in agreement with our\nexperimental observations. As a result, we demonstrate a mesoscale Brownian\nmotor that can harvest thermal energy by adjusting the forward and backward\nsliding velocities and can pave the way for macroscale directed motion and\nenergy harvesting.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}