{"id":"2407.19186","title":"Channel Boosted CNN-Transformer-based Multi-Level and Multi-Scale Nuclei\n  Segmentation","authors":"Zunaira Rauf, Abdul Rehman Khan, and Asifullah Khan","authorsParsed":[["Rauf","Zunaira",""],["Khan","Abdul Rehman",""],["Khan","Asifullah",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 05:54:05 GMT"}],"updateDate":"2024-07-30","timestamp":1722059645000,"abstract":"  Accurate nuclei segmentation is an essential foundation for various\napplications in computational pathology, including cancer diagnosis and\ntreatment planning. Even slight variations in nuclei representations can\nsignificantly impact these downstream tasks. However, achieving accurate\nsegmentation remains challenging due to factors like clustered nuclei, high\nintra-class variability in size and shape, resemblance to other cells, and\ncolor or contrast variations between nuclei and background. Despite the\nextensive utilization of Convolutional Neural Networks (CNNs) in medical image\nsegmentation, they may have trouble capturing long-range dependencies crucial\nfor accurate nuclei delineation. Transformers address this limitation but might\nmiss essential low-level features. To overcome these limitations, we utilized\nCNN-Transformer-based techniques for nuclei segmentation in H&E stained\nhistology images. In this work, we proposed two CNN-Transformer architectures,\nNuclei Hybrid Vision Transformer (NucleiHVT) and Channel Boosted Nuclei Hybrid\nVision Transformer (CB-NucleiHVT), that leverage the strengths of both CNNs and\nTransformers to effectively learn nuclei boundaries in multi-organ histology\nimages. The first architecture, NucleiHVT is inspired by the UNet architecture\nand incorporates the dual attention mechanism to capture both multi-level and\nmulti-scale context effectively. The CB-NucleiHVT network, on the other hand,\nutilizes the concept of channel boosting to learn diverse feature spaces,\nenhancing the model's ability to distinguish subtle variations in nuclei\ncharacteristics. Detailed evaluation of two medical image segmentation datasets\nshows that the proposed architectures outperform existing CNN-based,\nTransformer-based, and hybrid methods. The proposed networks demonstrated\neffective results both in terms of quantitative metrics, and qualitative visual\nassessment.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}