{"id":"2407.10129","title":"Turbulence and Rossby Wave Dynamics with Realizable Eddy Damped\n  Markovian Anisotropic Closure","authors":"Jorgen S. Frederiksen and Terence J. O'Kane","authorsParsed":[["Frederiksen","Jorgen S.",""],["O'Kane","Terence J.",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 09:29:35 GMT"}],"updateDate":"2024-07-16","timestamp":1720949375000,"abstract":"  The theoretical basis for the Eddy Damped Markovian Anisotropic Closure\n(EDMAC) is formulated for two-dimensional anisotropic turbulence interacting\nwith Rossby waves in the presence of advection by a large-scale mean flow. The\nEDMAC is as computationally efficient as the Eddy Damped Quasi Normal Markovian\n(EDQNM) closure but in contrast is realizable in the presence of transient\nwaves. The EDMAC is arrived at through systematic simplification of a\ngeneralization of the non-Markovian Direct Interaction Approximation (DIA)\nclosure that has its origin in renormalized perturbation theory. Markovian\nAnisotropic Closures (MACs) are obtained from the DIA by using three variants\nof the Fluctuation Dissipation Theorem (FDT) with the information in the time\nhistory integrals instead carried by Markovian differential equations for two\nrelaxation functions. One of the MACs is simplified to the EDMAC with\nanalytical relaxation functions and high numerical efficiency, like the EDQNM.\nSufficient conditions for the EDMAC to be realizable in the presence of Rossby\nwaves are determined. Examples of the numerical integration of the EDMAC\ncompared with the EDQNM are presented for two-dimensional isotropic and\nanisotropic turbulence, at moderate Reynolds numbers, possibly interacting with\nRossby waves and large-scale mean flow. The generalization of the EDMAC for the\nstatistical dynamics of other physical systems, to higher dimension and higher\norder nonlinearity is considered.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}