{"id":"2407.10367","title":"Perceptions of Entrepreneurship Among Graduate Students: Challenges,\n  Opportunities, and Cultural Biases","authors":"Manuela Andreea Petrescu and Dan Mircea Suciu","authorsParsed":[["Petrescu","Manuela Andreea",""],["Suciu","Dan Mircea",""]],"versions":[{"version":"v1","created":"Fri, 10 May 2024 08:35:18 GMT"}],"updateDate":"2024-07-16","timestamp":1715330118000,"abstract":"  The purpose of the paper is to examine the perceptions of entrepreneurship of\ngraduate students enrolled in a digital-oriented entrepreneurship course,\nfocusing on the challenges and opportunities related to starting a business. In\ntoday's digital era, businesses heavily depend on tailored software solutions\nto facilitate their operational processes, foster expansion, and enhance their\ncompetitive edge, thus assuming, to a certain degree, the characteristics of\nsoftware companies. For data gathering, we used online exploratory surveys. The\nfindings indicated that although entrepreneurship was considered an attractive\noption by students, very few of them declared that they intended to start a\nbusiness soon. The main issues raised by the students were internal traits and\nexternal obstacles, such as lack of resources and support. Gender\ndiscrimination and cultural biases persist, limiting opportunities and equality\nfor women. In terms of gender, women face limited representation in leadership\nroles, are expected to do more unpaid 'family work', are perceived as less\ncapable in ding business, and need to prove their skills. Even if women are\nless discriminated now, both genders agree that women still face discrimination\nin business domain. In terms of percentages, women mentioned gender\ndiscrimination in higher percentages. Addressing these issues requires\nawareness, education, and policy changes to ensure fair treatment and\nopportunities for women.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}