{"id":"2407.01948","title":"Extracting and Encoding: Leveraging Large Language Models and Medical\n  Knowledge to Enhance Radiological Text Representation","authors":"Pablo Messina, Ren\\'e Vidal, Denis Parra, \\'Alvaro Soto, Vladimir\n  Araujo","authorsParsed":[["Messina","Pablo",""],["Vidal","René",""],["Parra","Denis",""],["Soto","Álvaro",""],["Araujo","Vladimir",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 04:39:19 GMT"}],"updateDate":"2024-07-03","timestamp":1719895159000,"abstract":"  Advancing representation learning in specialized fields like medicine remains\nchallenging due to the scarcity of expert annotations for text and images. To\ntackle this issue, we present a novel two-stage framework designed to extract\nhigh-quality factual statements from free-text radiology reports in order to\nimprove the representations of text encoders and, consequently, their\nperformance on various downstream tasks. In the first stage, we propose a\n\\textit{Fact Extractor} that leverages large language models (LLMs) to identify\nfactual statements from well-curated domain-specific datasets. In the second\nstage, we introduce a \\textit{Fact Encoder} (CXRFE) based on a BERT model\nfine-tuned with objective functions designed to improve its representations\nusing the extracted factual data. Our framework also includes a new\nembedding-based metric (CXRFEScore) for evaluating chest X-ray text generation\nsystems, leveraging both stages of our approach. Extensive evaluations show\nthat our fact extractor and encoder outperform current state-of-the-art methods\nin tasks such as sentence ranking, natural language inference, and label\nextraction from radiology reports. Additionally, our metric proves to be more\nrobust and effective than existing metrics commonly used in the radiology\nreport generation literature. The code of this project is available at\n\\url{https://github.com/PabloMessina/CXR-Fact-Encoder}.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GxzMoHDMtjxfhc6XeNPrtJJ_HdlALQgy08WTeyx3WmA","pdfSize":"5508782"}
