{"id":"2407.05199","title":"Abundance, Sizes, and Major Element Compositions of Components in CR and\n  LL Chondrites: Formation from Single Reservoirs","authors":"Denton S. Ebel, Marina E. Gemma, Samuel P. Alpert, Jasmine Bayron, Ana\n  H. Lobo, Michael K. Weisberg","authorsParsed":[["Ebel","Denton S.",""],["Gemma","Marina E.",""],["Alpert","Samuel P.",""],["Bayron","Jasmine",""],["Lobo","Ana H.",""],["Weisberg","Michael K.",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 22:27:58 GMT"}],"updateDate":"2024-07-09","timestamp":1720304878000,"abstract":"  Abundances, apparent sizes, and individual chemical compositions of\nchondrules, refractory inclusions, other objects and surrounding matrix have\nbeen determined for Semarkona (LL3.00) and Renazzo (CR2) using consistent\nmethods and criteria on x-ray element intensity maps. These represent the\nnon-carbonaceous (NC, Semarkona) and carbonaceous chondrite (CC, Renazzo)\nsuperclans of chondrite types. We compare object and matrix abundances with\nsimilar data for CM, CO, K, and CV chondrites. We assess, pixel-by-pixel, the\nmajor element abundance in each object and in the entire matrix. We determine\nthe abundance of \"metallic chondrules\" in LL chondrites. Chondrules with high\nMg/Si and low Fe/Si and matrix carrying opposing ratios complement each other\nto make whole rocks with near-solar major element ratios in Renazzo. Similar\nMg/Si and Fe/Si chondrule-matrix relationships are seen in Semarkona, which is\nwithin 11% of solar Mg/Si but significantly Fe-depleted. These results provide\na robust constraint in support of single-reservoir models for chondrule\nformation and accretion, ruling out whole classes of astrophysical models and\nconstraining processes of chondrite component formation and accretion into\nchondrite parent bodies.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Physics/Geophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}