{"id":"2407.15800","title":"The Evaporating Massive Embedded Stellar Cluster IRS 13 Close to Sgr A*.\n  II. Kinematic structure","authors":"Florian Pei{\\ss}ker, Michal Zajacek, Matus Labaj, Lauritz Thomkins,\n  Andreas Elbe, Andreas Eckart, Lucas Labadie, Vladimir Karas, Nadeen B. Sabha,\n  Lukas Steiniger, and Maria Melamed","authorsParsed":[["Peißker","Florian",""],["Zajacek","Michal",""],["Labaj","Matus",""],["Thomkins","Lauritz",""],["Elbe","Andreas",""],["Eckart","Andreas",""],["Labadie","Lucas",""],["Karas","Vladimir",""],["Sabha","Nadeen B.",""],["Steiniger","Lukas",""],["Melamed","Maria",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 17:05:13 GMT"}],"updateDate":"2024-07-23","timestamp":1721667913000,"abstract":"  The existence of two distinct and apparently unrelated populations of dusty\nstellar objects in the Nuclear Stellar Cluster (NSC) of the Milky Way, namely\nIRS 13 and the S-cluster, are potentially prone to a general process describing\nthe star formation history in the Galactic Center (GC). The former cluster is\nthought to be entangled in the clockwise and counterclockwise disks, a\nlarge-scale stellar distribution revealed by the analysis of stars at different\ndistances from Sgr A*, the supermassive black hole in the GC. Recently, this\nlarge-scale distribution was reported to exhibit a multi-disk structure with at\nleast four components. Motivated by this finding, we revisit the anisotropic\nIRS 13 cluster and find strong evidence for a disk-like structure. An\nexamination of about 50 individual stellar orbits reveals a new structure that\ndoes not follow any trend known in the literature. Furthermore, we investigate\nthe possibility of an inspiral cluster undergoing star formation processes, as\nproposed by several authors. Using a simplified N-body simulation to reproduce\nour observational results, we conclude that, under certain conditions, a\nmassive cluster can migrate from the Circum Nuclear Disk toward the inner\nparsec. Based on this classification, we revisit the large-scale NACO (VLT)\nobservations of IRS 13 and find evidence for a separation of the cluster into a\ngravitationally stable core remnant and a dissipating part. With the\nvelocity-resolved H30{\\alpha} line and the broadband spectral energy\ndistribution of IRS 13E3, we provide tentative support for the existence of an\nintermediate-mass black hole of ~ 3 x 10^26 M_sun surrounded by a hot gaseous\nstream.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}