{"id":"2407.06409","title":"Atom-wise formulation of the many-body dispersion problem for\n  linear-scaling van der Waals corrections","authors":"Heikki Muhli, Tapio Ala-Nissila, Miguel A. Caro","authorsParsed":[["Muhli","Heikki",""],["Ala-Nissila","Tapio",""],["Caro","Miguel A.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 21:31:26 GMT"}],"updateDate":"2024-07-10","timestamp":1720474286000,"abstract":"  A common approach to modeling dispersion interactions and overcoming the\ninaccurate description of long-range correlation effects in electronic\nstructure calculations is the use of pairwise-additive potentials, as in the\nTkatchenko-Scheffler [Phys. Rev. Lett. 102, 073005 (2009)] method. In previous\nwork [Phys. Rev. B 104, 054106 (2021)], we have shown how these are amenable to\nhighly efficient atomistic simulation by machine learning their local\nparametrization. However, the atomic polarizability and the electron\ncorrelation energy have a complex and non-local many-body character and some of\nthe dispersion effects in complex systems are not sufficiently described by\nthese types of pairwise-additive potentials. Currently, one of the most widely\nused rigorous descriptions of the many-body effects is based on the many-body\ndispersion (MBD) model [Phys. Rev. Lett. 108, 236402 (2012)]. In this work, we\nshow that the MBD model can also be locally parametrized to derive a local\napproximation for the highly non-local many-body effects. With this local\nparametrization, we develop an atom-wise formulation of MBD that we refer to as\nlinear MBD (lMBD), as this decomposition enables linear scaling with system\nsize. This model provides a transparent and controllable approximation to the\nfull MBD model with tunable convergence parameters for a fraction of the\ncomputational cost observed in electronic structure calculations with popular\ndensity-functional theory codes. We show that our model scales linearly with\nthe number of atoms in the system and is easily parallelizable. Furthermore, we\nshow how using the same machinery already established in previous work for\npredicting Hirshfeld volumes with machine learning enables access to\nlarge-scale simulations with MBD-level corrections.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}