{"id":"2407.15880","title":"Diff4VS: HIV-inhibiting Molecules Generation with Classifier Guidance\n  Diffusion for Virtual Screening","authors":"Jiaqing Lyu and Changjie Chen and Bing Liang and Yijia Zhang","authorsParsed":[["Lyu","Jiaqing",""],["Chen","Changjie",""],["Liang","Bing",""],["Zhang","Yijia",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 12:34:02 GMT"}],"updateDate":"2024-07-24","timestamp":1721478842000,"abstract":"  The AIDS epidemic has killed 40 million people and caused serious global\nproblems. The identification of new HIV-inhibiting molecules is of great\nimportance for combating the AIDS epidemic. Here, the Classifier Guidance\nDiffusion model and ligand-based virtual screening strategy are combined to\ndiscover potential HIV-inhibiting molecules for the first time. We call it\nDiff4VS. An extra classifier is trained using the HIV molecule dataset, and the\ngradient of the classifier is used to guide the Diffusion to generate\nHIV-inhibiting molecules. Experiments show that Diff4VS can generate more\ncandidate HIV-inhibiting molecules than other methods. Inspired by ligand-based\nvirtual screening, a new metric DrugIndex is proposed. The DrugIndex is the\nratio of the proportion of candidate drug molecules in the generated molecule\nto the proportion of candidate drug molecules in the training set. DrugIndex\nprovides a new evaluation method for evolving molecular generative models from\na pharmaceutical perspective. Besides, we report a new phenomenon observed when\nusing molecule generation models for virtual screening. Compared to real\nmolecules, the generated molecules have a lower proportion that is highly\nsimilar to known drug molecules. We call it Degradation in molecule generation.\nBased on the data analysis, the Degradation may result from the difficulty of\ngenerating molecules with a specific structure in the generative model. Our\nresearch contributes to the application of generative models in drug design\nfrom method, metric, and phenomenon analysis.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"PUmEafPUz67kULPrxt7UnAW4owQDwrUzJUpZsQollG4","pdfSize":"619323"}
