{"id":"2407.01515","title":"The Galactic Bulge exploration III.: Calcium Triplet Metallicities for\n  RR Lyrae Stars","authors":"Andrea Kunder, Zdenek Prudil, Claire Skaggs, Henrique Reggiani, David\n  M. Nataf, Joanne Hughes, Kevin R. Covey, Kathryn Devine","authorsParsed":[["Kunder","Andrea",""],["Prudil","Zdenek",""],["Skaggs","Claire",""],["Reggiani","Henrique",""],["Nataf","David M.",""],["Hughes","Joanne",""],["Covey","Kevin R.",""],["Devine","Kathryn",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 17:57:25 GMT"}],"updateDate":"2024-07-02","timestamp":1719856645000,"abstract":"  RR Lyrae stars are excellent tracers of stellar populations for old,\nmetal-poor components in the Milky Way Galaxy and the Local Group. Their\nluminosities have a metallicity-dependence, but determining spectroscopic\n[Fe/H] metallicities for RR Lyrae stars, especially at distances outside the\nsolar neighbourhood, is challenging. Using 40 RRLs with metallicities derived\nfrom both Fe(II) and Fe(I) abundances, we verify the calibration between the\n[Fe/H] of RR Lyrae stars from the Calcium triplet. Our calibration is applied\nto all RR Lyrae stars with Gaia RVS spectra in Gaia DR3 as well as to 80 stars\nin the inner Galaxy from the BRAVA-RR survey. The co-added Gaia RVS RR Lyrae\nspectra provide RR Lyrae metallicities with an uncertainty of 0.25~dex, which\nis a factor of two improvement over the Gaia photometric RR Lyrae\nmetallicities. Within our Galactic bulge RR Lyrae star sample, we find a\ndominant fraction with low energies without a prominent rotating component. Due\nto the large fraction of such stars, we interpret these stars as belonging to\nthe $in-situ$ metal-poor Galactic bulge component, although we can not rule out\nthat a fraction of these belong to an ancient accretion event such as\nKraken/Heracles.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}