{"id":"2407.14296","title":"Foundation Models for Autonomous Robots in Unstructured Environments","authors":"Hossein Naderi, Alireza Shojaei, Lifu Huang","authorsParsed":[["Naderi","Hossein",""],["Shojaei","Alireza",""],["Huang","Lifu",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:26:52 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 17:55:26 GMT"}],"updateDate":"2024-07-23","timestamp":1721395612000,"abstract":"  Automating activities through robots in unstructured environments, such as\nconstruction sites, has been a long-standing desire. However, the high degree\nof unpredictable events in these settings has resulted in far less adoption\ncompared to more structured settings, such as manufacturing, where robots can\nbe hard-coded or trained on narrowly defined datasets. Recently, pretrained\nfoundation models, such as Large Language Models (LLMs), have demonstrated\nsuperior generalization capabilities by providing zero-shot solutions for\nproblems do not present in the training data, proposing them as a potential\nsolution for introducing robots to unstructured environments. To this end, this\nstudy investigates potential opportunities and challenges of pretrained\nfoundation models from a multi-dimensional perspective. The study\nsystematically reviews application of foundation models in two field of robotic\nand unstructured environment and then synthesized them with deliberative acting\ntheory. Findings showed that linguistic capabilities of LLMs have been utilized\nmore than other features for improving perception in human-robot interactions.\nOn the other hand, findings showed that the use of LLMs demonstrated more\napplications in project management and safety in construction, and natural\nhazard detection in disaster management. Synthesizing these findings, we\nlocated the current state-of-the-art in this field on a five-level scale of\nautomation, placing them at conditional automation. This assessment was then\nused to envision future scenarios, challenges, and solutions toward autonomous\nsafe unstructured environments. Our study can be seen as a benchmark to track\nour progress toward that future.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}