{"id":"2407.21183","title":"SSPACE Astrobiology Payload-1 (SAP-1)","authors":"A Lokaveer, Thomas Anjana, Maliyekkal Yasir, S Yogahariharan, Akash\n  Dewangan, Saurabh Kishor Mahajan, Sakshi Aravind Tembhurne, Gunja Subhash\n  Gupta, Devashish Bhalla, Anantha Datta Dhruva, Aloke Kumar, Koushik\n  Viswanathan, Vikram Khaire, Anand Narayanan, Priyadarshnam Hari","authorsParsed":[["Lokaveer","A",""],["Anjana","Thomas",""],["Yasir","Maliyekkal",""],["Yogahariharan","S",""],["Dewangan","Akash",""],["Mahajan","Saurabh Kishor",""],["Tembhurne","Sakshi Aravind",""],["Gupta","Gunja Subhash",""],["Bhalla","Devashish",""],["Dhruva","Anantha Datta",""],["Kumar","Aloke",""],["Viswanathan","Koushik",""],["Khaire","Vikram",""],["Narayanan","Anand",""],["Hari","Priyadarshnam",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 20:46:49 GMT"}],"updateDate":"2024-08-01","timestamp":1722372409000,"abstract":"  The SSPACE Astrobiology Payload (SAP) series, starting with the SAP-1 project\nis designed to conduct in-situ microbiology experiments in low earth orbit.\nThis payload series aims to understand the behaviour of microbial organisms in\nspace, particularly those critical for human health, and the corresponding\neffects due to microgravity and solar/galactic radiation. SAP-1 focuses on\nstudying Bacillus clausii and Bacillus coagulans, bacteria beneficial to\nhumans. It aims to provide a space laboratory for astrobiology experiments\nunder microgravity conditions. The hardware developed for these experiments is\nindigenous and tailored to meet the unique requirements of autonomous\nmicrobiology experiments by controlling pressure, temperature, and nutrition\nflow to bacteria. A rotating platform, which forms the core design, is\ninnovatively utilised to regulate the flow and mixing of nutrients with dormant\nbacteria. The technology demonstration models developed at SSPACE have yielded\npromising results, with ongoing efforts to refine, adapt for space conditions,\nand prepare for integration with nanosatellites or space modules. The\nanticipated payload will be compact, approximately 1U in size (10cm x 10cm x\n10cm), consume less than 5W power, and offer flexibility for various\nmicrobiological studies.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"OpIJrhPYeQe_Bs3VeJnwd0DAhQVWB31r-Kjfc_UqijA","pdfSize":"1423111","objectId":"0xfdf44ce52e376917095ea390fdc34fc363c9412ca5353db57f6b5b68c31e44a4","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
