{"id":"2407.07216","title":"A Detailed Analysis of a Magnetic Island Observed by WISPR on Parker\n  Solar Probe","authors":"Madison L. Ascione (1), Angel J. Gutarra-Leon (1), Shaheda Begum Shaik\n  (1), Mark Linton (2), Karl Battams (2), Paulett C. Liewer (3), and Brendan\n  Gallagher (2) ((1) George Mason University, (2) US Naval Research Laboratory,\n  (3) Jet Propulsion Laboratory)","authorsParsed":[["Ascione","Madison L.",""],["Gutarra-Leon","Angel J.",""],["Shaik","Shaheda Begum",""],["Linton","Mark",""],["Battams","Karl",""],["Liewer","Paulett C.",""],["Gallagher","Brendan",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 20:25:28 GMT"}],"updateDate":"2024-07-11","timestamp":1720556728000,"abstract":"  We present the identification and physical analysis of a possible magnetic\nisland feature seen in white-light images observed by the Wide-field Imager for\nSolar Probe (WISPR) on board the Parker Solar Probe (Parker). The island is\nimaged by WISPR during Parker's second solar encounter on 2019 April 06, when\nParker was ~38 solar radii from the Sun center. We report that the average\nvelocity and acceleration of the feature are approximately 334 km s and -0.64 m\ns-2. The kinematics of the island feature, coupled with its direction of\npropagation, indicate that the island is likely entrained in the slow solar\nwind. The island is elliptical in shape with a density deficit in its center,\nsuggesting the presence of a magnetic guide field. We argue that this feature\nis consistent with the formation of this island via reconnection in the current\nsheet of the streamer. The feature's aspect ratio (calculated as the ratio of\nits minor to major axis) evolves from an elliptical to a more circular shape\nthat approximately doubles during its propagation through WISPR's field of\nview. The island is not distinct in other white-light observations from the\nSolar and Heliospheric Observatory (SOHO) and the Solar Terrestrial Relations\nObservatory (STEREO) coronagraphs, suggesting that this is a comparatively\nfaint heliospheric feature and that viewing perspective and WISPR's enhanced\nsensitivity are key to observing the magnetic island.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}