{"id":"2407.14210","title":"Fair Overlap Number of Balls (Fair-ONB): A Data-Morphology-based\n  Undersampling Method for Bias Reduction","authors":"Jos\\'e Daniel Pascual-Triana, Alberto Fern\\'andez, Paulo Novais,\n  Francisco Herrera","authorsParsed":[["Pascual-Triana","José Daniel",""],["Fernández","Alberto",""],["Novais","Paulo",""],["Herrera","Francisco",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 11:16:02 GMT"}],"updateDate":"2024-07-22","timestamp":1721387762000,"abstract":"  Given the magnitude of data generation currently, both in quantity and speed,\nthe use of machine learning is increasingly important. When data include\nprotected features that might give rise to discrimination, special care must be\ntaken. Data quality is critical in these cases, as biases in training data can\nbe reflected in classification models. This has devastating consequences and\nfails to comply with current regulations. Data-Centric Artificial Intelligence\nproposes dataset modifications to improve its quality. Instance selection via\nundersampling can foster balanced learning of classes and protected feature\nvalues in the classifier. When such undersampling is done close to the decision\nboundary, the effect on the classifier would be bolstered. This work proposes\nFair Overlap Number of Balls (Fair-ONB), an undersampling method that harnesses\nthe data morphology of the different data groups (obtained from the combination\nof classes and protected feature values) to perform guided undersampling in the\nareas where they overlap. It employs attributes of the ball coverage of the\ngroups, such as the radius, number of covered instances and density, to select\nthe most suitable areas for undersampling and reduce bias. Results show that\nthe Fair-ONB method reduces bias with low impact on the classifier's predictive\nperformance.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}