{"id":"2407.00972","title":"FALCON: Frequency Adjoint Link with CONtinuous Density Mask for Fast\n  Single Image Dehazing","authors":"Donghyun Kim, Seil Kang, Seong Jae Hwang","authorsParsed":[["Kim","Donghyun",""],["Kang","Seil",""],["Hwang","Seong Jae",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 05:16:26 GMT"}],"updateDate":"2024-07-02","timestamp":1719810986000,"abstract":"  Image dehazing, addressing atmospheric interference like fog and haze,\nremains a pervasive challenge crucial for robust vision applications such as\nsurveillance and remote sensing under adverse visibility. While various\nmethodologies have evolved from early works predicting transmission matrix and\natmospheric light features to deep learning and dehazing networks, they\ninnately prioritize dehazing quality metrics, neglecting the need for real-time\napplicability in time-sensitive domains like autonomous driving. This work\nintroduces FALCON (Frequency Adjoint Link with CONtinuous density mask), a\nsingle-image dehazing system achieving state-of-the-art performance on both\nquality and speed. Particularly, we develop a novel bottleneck module, namely,\nFrequency Adjoint Link, operating in the frequency space to globally expand the\nreceptive field with minimal growth in network size. Further, we leverage the\nunderlying haze distribution based on the atmospheric scattering model via a\nContinuous Density Mask (CDM) which serves as a continuous-valued mask input\nprior and a differentiable auxiliary loss. Comprehensive experiments involving\nmultiple state-of-the-art methods and ablation analysis demonstrate FALCON's\nexceptional performance in both dehazing quality and speed (i.e., >$180\nframes-per-second), quantified by metrics such as FPS, PSNR, and SSIM.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DtKdTAP3WF3WImlTf_j88aCBrG0UiDZbQt1n6iTucm0","pdfSize":"26855297"}
