{"id":"2407.16183","title":"Random walks on bifractal networks","authors":"Kousuke Yakubo, Gentaro Shimojo, Jun Yamamoto","authorsParsed":[["Yakubo","Kousuke",""],["Shimojo","Gentaro",""],["Yamamoto","Jun",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 05:10:11 GMT"}],"updateDate":"2024-07-24","timestamp":1721711411000,"abstract":"  It has recently been shown that networks possessing the scale-free and\nfractal properties may exhibit the bifractal nature, in which local structures\nare described by two different fractal dimensions. In this study, we\ninvestigate random walks on fractal scale-free networks (FSFNs) by examining\nthe walk dimension $d_{\\text{w}}$ and the spectral dimension $d_{\\text{s}}$, to\nunderstand how the bifractality of FSFNs affects their dynamical properties.\nThe walk dimension is found to be unaffected by the difference in local\nfractality of an FSFN and remains constant regardless of the starting node of a\nrandom walk, whereas the spectral dimension takes two values,\n$d_{\\text{s}}^{\\text{min}}$ and $d_{\\text{s}}^{\\text{max}}(>\nd_{\\text{s}}^{\\text{min}})$, depending on the starting node. The dimension\n$d_{\\text{s}}^{\\text{min}}$ characterizes the return probability of a random\nwalker starting from an infinite-degree hub node in the thermodynamic limit,\nwhile $d_{\\text{s}}^{\\text{max}}$ describes that of a random walker starting\nfrom a finite-degree non-hub node infinitely distant from hub nodes and is\nequal to the global spectral dimension $D_{\\text{s}}$. The existence of two\nlocal spectral dimensions is a direct consequence of the bifractality of the\nFSFN. Furthermore, analytical expressions of $d_{\\text{w}}$,\n$d_{\\text{s}}^{\\text{min}}$, and $d_{\\text{s}}^{\\text{max}}$ are presented for\nFSFNs formed by the generator model and the giant components of critical\nscale-free random graphs, and are numerically confirmed.\n","subjects":["Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GX89BKTKxoQb2Jqz6lP0OM6gMcXv1mUL0sKjKn53ckA","pdfSize":"636319"}
