{"id":"2407.21444","title":"Cooperative Orbital Angular Momentum Wireless Communications","authors":"Ruirui Chen, Wenchi Cheng, Jinyang Lin, and Liping Liang","authorsParsed":[["Chen","Ruirui",""],["Cheng","Wenchi",""],["Lin","Jinyang",""],["Liang","Liping",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 08:48:52 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 04:25:37 GMT"}],"updateDate":"2024-08-05","timestamp":1722415732000,"abstract":"  Orbital angular momentum (OAM) mode multiplexing has the potential to achieve\nhigh spectrum-efficiency communications at the same time and frequency by using\northogonal mode resource. However, the vortex wave hollow divergence\ncharacteristic results in the requirement of the large-scale receive antenna,\nwhich makes users hardly receive the OAM signal by size-limited equipment. To\npromote the OAM application in the next 6G communications, this paper proposes\nthe cooperative OAM wireless (COW) communication scheme, which can select the\ncooperative users (CUs) to form the aligned antennas by size-limited user\nequipment. First, we derive the feasible radial radius and selective waist\nradius to choose the CUs in the same circle with the origin at the base\nstation. Then, based on the locations of CUs, the waist radius is adjusted to\nform the receive antennas and ensure the maximum intensity for the CUs.\nFinally, the cooperative formation probability is derived in the closed-form\nsolution, which can depict the feasibility of the proposed COW communication\nscheme. Furthermore, OAM beam steering is used to expand the feasible CU\nregion, thus achieving higher cooperative formation probability. Simulation\nresults demonstrate that the derived cooperative formation probability in\nmathematical analysis is very close to the statistical probability of\ncooperative formation, and the proposed COW communication scheme can obtain\nhigher spectrum efficiency than the traditional scheme due to the effective\nreception of the OAM signal.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}