{"id":"2407.19415","title":"Start from Video-Music Retrieval: An Inter-Intra Modal Loss for Cross\n  Modal Retrieval","authors":"Zeyu Chen, Pengfei Zhang, Kai Ye, Wei Dong, Xin Feng, Yana Zhang","authorsParsed":[["Chen","Zeyu",""],["Zhang","Pengfei",""],["Ye","Kai",""],["Dong","Wei",""],["Feng","Xin",""],["Zhang","Yana",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 07:06:28 GMT"}],"updateDate":"2024-07-30","timestamp":1722150388000,"abstract":"  The burgeoning short video industry has accelerated the advancement of\nvideo-music retrieval technology, assisting content creators in selecting\nappropriate music for their videos. In self-supervised training for\nvideo-to-music retrieval, the video and music samples in the dataset are\nseparated from the same video work, so they are all one-to-one matches. This\ndoes not match the real situation. In reality, a video can use different music\nas background music, and a music can be used as background music for different\nvideos. Many videos and music that are not in a pair may be compatible, leading\nto false negative noise in the dataset. A novel inter-intra modal (II) loss is\nproposed as a solution. By reducing the variation of feature distribution\nwithin the two modalities before and after the encoder, II loss can reduce the\nmodel's overfitting to such noise without removing it in a costly and laborious\nway. The video-music retrieval framework, II-CLVM (Contrastive Learning for\nVideo-Music Retrieval), incorporating the II Loss, achieves state-of-the-art\nperformance on the YouTube8M dataset. The framework II-CLVTM shows better\nperformance when retrieving music using multi-modal video information (such as\ntext in videos). Experiments are designed to show that II loss can effectively\nalleviate the problem of false negative noise in retrieval tasks. Experiments\nalso show that II loss improves various self-supervised and supervised\nuni-modal and cross-modal retrieval tasks, and can obtain good retrieval models\nwith a small amount of training samples.\n","subjects":["Computing Research Repository/Multimedia","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"4YJXRvPPIasMrCBR0bkTVTtMPK3LImrfRmnwbiqL_3w","pdfSize":"3728213"}
