{"id":"2407.01164","title":"Around first-order rigidity of Coxeter groups","authors":"Simon Andr\\'e and Gianluca Paolini","authorsParsed":[["André","Simon",""],["Paolini","Gianluca",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 10:34:53 GMT"}],"updateDate":"2024-07-02","timestamp":1719830093000,"abstract":"  By the work of Sela, for any free group $F$, the Coxeter group $W_ 3 =\n\\mathbb{Z}/2\\mathbb{Z} \\ast \\mathbb{Z}/2\\mathbb{Z} \\ast \\mathbb{Z}/2\\mathbb{Z}$\nis elementarily equivalent to $W_3 \\ast F$, and so Coxeter groups are not\nclosed under elementary equivalence among finitely generated groups. In this\npaper we show that if we restrict to models which are generated by finitely\nmany torsion elements (finitely torsion-generated), then we can recover\nstriking rigidity results. Our main result is that if $(W, S)$ is a Coxeter\nsystem whose irreducible components are either spherical, or affine or (Gromov)\nhyperbolic, and $G$ is finitely torsion-generated and elementarily equivalent\nto $W$, then $G$ is itself a Coxeter group. This combines results of the second\nauthor et al. from [MPS22, PS23] with the following main hyperbolic result: if\n$W$ is a Coxeter hyperbolic group and $G$ is $\\mathrm{AE}$-equivalent to $W$\nand finitely torsion-generated, then $G$ belongs to a finite collection of\nCoxeter groups (modulo isomorphism). Furthermore, we show that there are two\nhyperbolic Coxeter groups $W$ and $W'$ which are non-isomorphic but\n$\\mathrm{AE}$-equivalent. We also show that, on other hand, if we restrict to\ncertain specific classes of Coxeter groups then we can recover the strongest\npossible form of first-order rigidity, which we call first-order\ntorsion-rigidity, namely the Coxeter group $W$ is the only finitely\ntorsion-generated model of its theory. Crucially, we show that this form of\nrigidity holds for the following classes of Coxeter groups: even hyperbolic\nCoxeter groups and free products of one-ended or finite hyperbolic Coxeter\ngroups. We conjecture that the same kind of phenomena occur for the whole class\nof Coxeter groups. In this direction, we prove that if $W$ and $W'$ are even\nCoxeter groups which are elementarily equivalent, then they are isomorphic.\n","subjects":["Mathematics/Group Theory","Mathematics/Logic"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}