{"id":"2407.08322","title":"Intelligent Multi-Document Summarisation for Extracting Insights on\n  Racial Inequalities from Maternity Incident Investigation Reports","authors":"Georgina Cosma, Mohit Kumar Singh, Patrick Waterson, Gyuchan Thomas\n  Jun, Jonathan Back","authorsParsed":[["Cosma","Georgina",""],["Singh","Mohit Kumar",""],["Waterson","Patrick",""],["Jun","Gyuchan Thomas",""],["Back","Jonathan",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 09:11:20 GMT"}],"updateDate":"2024-07-12","timestamp":1720689080000,"abstract":"  In healthcare, thousands of safety incidents occur every year, but learning\nfrom these incidents is not effectively aggregated. Analysing incident reports\nusing AI could uncover critical insights to prevent harm by identifying\nrecurring patterns and contributing factors. To aggregate and extract valuable\ninformation, natural language processing (NLP) and machine learning techniques\ncan be employed to summarise and mine unstructured data, potentially surfacing\nsystemic issues and priority areas for improvement. This paper presents\nI-SIRch:CS, a framework designed to facilitate the aggregation and analysis of\nsafety incident reports while ensuring traceability throughout the process. The\nframework integrates concept annotation using the Safety Intelligence Research\n(SIRch) taxonomy with clustering, summarisation, and analysis capabilities.\nUtilising a dataset of 188 anonymised maternity investigation reports annotated\nwith 27 SIRch human factors concepts, I-SIRch:CS groups the annotated sentences\ninto clusters using sentence embeddings and k-means clustering, maintaining\ntraceability via file and sentence IDs. Summaries are generated for each\ncluster using offline state-of-the-art abstractive summarisation models (BART,\nDistilBART, T5), which are evaluated and compared using metrics assessing\nsummary quality attributes. The generated summaries are linked back to the\noriginal file and sentence IDs, ensuring traceability and allowing for\nverification of the summarised information. Results demonstrate BART's\nstrengths in creating informative and concise summaries.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KEgC3iJCHdezsDr7pg4hoO59_jRhKI7FmjjNQdX4qFk","pdfSize":"689706","objectId":"0xfa2c680e28a69a3caee9810dbbeaee499142c7254662c7165a170b9af3ec05b0","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
