{"id":"2407.20844","title":"Turbulent Energy Conversion Associated with Kinetic Microinstabilities\n  in Earth's Magnetosheath","authors":"Harry C. Lewis (1), Julia E. Stawarz (2), Lorenzo Matteini (1), Luca\n  Franci (2), Kristopher G. Klein (3), Robert T. Wicks (2), Chadi S. Salem (4),\n  Timothy S. Horbury (1), Joseph H. Wang (1) ((1) Imperial College London, (2)\n  Northumbria University, (3) University of Arizona, (4) University of\n  California Berkeley)","authorsParsed":[["Lewis","Harry C.",""],["Stawarz","Julia E.",""],["Matteini","Lorenzo",""],["Franci","Luca",""],["Klein","Kristopher G.",""],["Wicks","Robert T.",""],["Salem","Chadi S.",""],["Horbury","Timothy S.",""],["Wang","Joseph H.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 14:21:48 GMT"}],"updateDate":"2024-07-31","timestamp":1722349308000,"abstract":"  Plasma in the terrestrial magnetosheath is characterised by very weak\nparticle-particle collisions, so kinetic microinstabilities are thought to be\nresponsible for regulating the thermodynamics of the plasma. By exciting\nelectromagnetic waves, these instabilities redistribute free energy in velocity\nspace, moulding the velocity distribution function (VDF) into a lower energy\nstate. In the high-beta magnetosheath, relatively small perturbations to the\nVDF can easily excite instabilities compared to in the low-beta inner\nheliosphere. Since magnetic fields cannot do work on the particles, electric\nfields mediate energy exchange between the electromagnetic field and the bulk\nfluid properties of the plasma. We investigate signatures of non-ideal energy\nconversion associated with turbulent fluctuations in the context of electron\nand ion temperature anisotropy-beta instabilities, utilising over 24 hours of\ndata spread over 163 distinct intervals of in situ magnetosheath observations\nfrom Magnetospheric Multiscale (MMS). We find that average energy conversion\ninto fluid flow is enhanced along instability boundaries, suggesting that\nturbulence is playing a role in how free energy is redistributed in the plasma.\nThe work enables a quantification of the energetics which are associated with\nthe role of kinetic microinstabilities in regulating collisionless plasma\nthermodynamics. This work provides insight into the open question of how\nspecific plasma processes couple into the turbulent dynamics and ultimately\nlead to energy dissipation and particle energisation in collisionless plasmas.\n","subjects":["Physics/Space Physics","Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}