{"id":"2407.09634","title":"A phenomenological study of the evolution of shock-induced O I emission\n  lines in the spectrum of nova V2891 Cygni","authors":"Ruchi Pandey, Mudit K. Srivastava, and Gargi Shaw","authorsParsed":[["Pandey","Ruchi",""],["Srivastava","Mudit K.",""],["Shaw","Gargi",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 18:48:03 GMT"}],"updateDate":"2024-07-16","timestamp":1720810083000,"abstract":"  The eruption of Nova V2891 Cygni in 2019 offers a rare opportunity to explore\nthe shock-induced processes in novae ejecta. The spectral evolution shows\nnoticeable differences in the evolution of various oxygen emission lines such\nas O I 7773 {\\AA}, O I 8446 {\\AA}, O I 1.1286 $\\mu$m, O I 1.3164 $\\mu$m, etc.\nHere, we use spectral synthesis code CLOUDY to study the temporal evolution of\nthese oxygen emission lines. Our photoionization model requires the\nintroduction of a component with a very high density ($n ~ 10^{11}$ cm$^{-3}$)\nand an enhanced oxygen abundance (O/H $\\sim$ 28) to produce the O I 7773 {\\AA}\nemission line, suggesting a stratification of material with high oxygen\nabundance within the ejecta. An important outcome is the behaviour of the O I\n1.3164 $\\mu$m line, which could only be generated by invoking the collisional\nionization models in CLOUDY. Our phenomenological analysis suggests that O I\n1.3164 $\\mu$m emission originates from a thin, dense shell characterized by a\nhigh density of about $10^{12.5} - 10^{12.8}$ cm$^{-3}$, which is most likely\nformed due to the strong internal collisions. If such is the case, the O I\n1.3164 $\\mu$m emission presents itself as a tracer of shock-induced dust\nformation in V2891 Cyg. The collisional ionization models have also been\nsuccessful in creating the high-temperature conditions ($~ 7.07 - 7.49 \\times\n10^5$ K) required to reproduce the observed high ionization potential coronal\nlines, which coincide with the epoch of dust formation and evolution of the O I\n1.3164 $\\mu$m emission line.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}