{"id":"2407.21516","title":"Expanding the Medical Decathlon dataset: segmentation of colon and\n  colorectal cancer from computed tomography images","authors":"I.M. Chernenkiy, Y.A. Drach, S.R. Mustakimova, V.V. Kazantseva, N.A.\n  Ushakov, S.K. Efetov and M.V. Feldsherov","authorsParsed":[["Chernenkiy","I. M.",""],["Drach","Y. A.",""],["Mustakimova","S. R.",""],["Kazantseva","V. V.",""],["Ushakov","N. A.",""],["Efetov","S. K.",""],["Feldsherov","M. V.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 10:36:41 GMT"}],"updateDate":"2024-08-01","timestamp":1722422201000,"abstract":"  Colorectal cancer is the third-most common cancer in the Western Hemisphere.\nThe segmentation of colorectal and colorectal cancer by computed tomography is\nan urgent problem in medicine. Indeed, a system capable of solving this problem\nwill enable the detection of colorectal cancer at early stages of the disease,\nfacilitate the search for pathology by the radiologist, and significantly\naccelerate the process of diagnosing the disease. However, scientific\npublications on medical image processing mostly use closed, non-public data.\nThis paper presents an extension of the Medical Decathlon dataset with\ncolorectal markups in order to improve the quality of segmentation algorithms.\nAn experienced radiologist validated the data, categorized it into subsets by\nquality, and published it in the public domain. Based on the obtained results,\nwe trained neural network models of the UNet architecture with 5-part\ncross-validation and achieved a Dice metric quality of $0.6988 \\pm 0.3$. The\npublished markups will improve the quality of colorectal cancer detection and\nsimplify the radiologist's job for study description.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}