{"id":"2407.12981","title":"Transition to turbulence in the wide-gap spherical Couette system","authors":"Ankit Barik, Santiago A. Triana, Michael Hoff, Johannes Wicht","authorsParsed":[["Barik","Ankit",""],["Triana","Santiago A.",""],["Hoff","Michael",""],["Wicht","Johannes",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 19:55:43 GMT"}],"updateDate":"2024-07-19","timestamp":1721246143000,"abstract":"  The spherical Couette system consists of two differentially rotating\nconcentric spheres with a fluid filled in between. We study a regime where the\nouter sphere is rotating rapidly enough so that the Coriolis force is important\nand the inner sphere is rotating either slower or in the opposite direction\nwith respect to the outer sphere. We numerically study the sudden transition to\nturbulence at a critical differential rotation seen in experiments at BTU\nCottbus - Senftenberg, Germany and investigate its cause. We find that the\nsource of turbulence is the boundary layer on the inner sphere, which becomes\ncentrifugally unstable. We show that this instability leads to generation of\nsmall scale structures which lead to turbulence in the bulk, dominated by\ninertial waves, a change in the force balance near the inner boundary, the\nformation of a mean flow through Reynolds stresses, and consequently, to an\nefficient angular momentum transport. We compare our findings with axisymmetric\nsimulations and show that there are significant similarities in the nature of\nthe flow in the turbulent regimes of full 3D and axisymmetric simulations but\ndifferences in the evolution of the instability that leads to this transition.\nWe find that a heuristic argument based on a Reynolds number defined using the\nthickness of the boundary layer as a length scale helps explain the scaling law\nof the variation of critical differential rotation for transition to turbulence\nwith rotation rate observed in the experiments.\n","subjects":["Physics/Fluid Dynamics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}