{"id":"2407.19645","title":"Non-iterative complex variable solution on sequential shallow tunnelling\n  in gravitational geomaterial with reasonable far-field displacement","authors":"Luo-bin Lin, Fu-quan Chen, Change-jie Zheng, Shang-shun Lin","authorsParsed":[["Lin","Luo-bin",""],["Chen","Fu-quan",""],["Zheng","Change-jie",""],["Lin","Shang-shun",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 02:02:28 GMT"}],"updateDate":"2024-07-30","timestamp":1722218548000,"abstract":"  Sequential excavation is common in shallow tunnel engineering, especially for\nlarge-span tunnels. However, existing complex variable solutions can not handle\nsequential shallow tunnelling effectively. This paper proposes a new complex\nvariable solution on sequential shallow tunnelling in gravitational geomaterial\nwith reasonable far-field displacement in a non-iterative manner by\nincorporating a bidirectional stepwise conformal mapping combining Charge\nSimulation Method and Complex Dipole Simulation Method. The non-iterative\nmanner ensures that the mechanical models of sequential excavation stages share\nsimilar mathematical formation with non-successive mixed boundary conditions,\nwhich are respectively transformed into corresponding homogenerous\nRiemann-Hilbert problems, which are solved to obtain stress and displacement\nfields of sequential shallow tunnelling. The proposed solution is subsequently\nvalidated by sufficient comparisons with equivalent finite element solution\nwith good agreements. The comparisons also suggest that the proposed solution\nshould be more accurate than the finite element one. A parametric investigation\nis finally conducted to illustrate possible practical applications of the\nproposed solution with several engineering recommendations. Additionally, the\ntheoretical improvements and defects of the proposed solution are discussed for\nobjectivity.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Mathematics/Complex Variables"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}