{"id":"2407.15133","title":"Harmonizing Material Quantity and Terahertz Wave Interference Shielding\n  Efficiency with Metallic Borophene Nanosheets","authors":"Haojian Lin, Ximiao Wang, Zhaolong Cao, Hongjia Zhu, Jiahao Wu, Runze\n  Zhan, Ningsheng Xu, Shaozhi Deng, Huanjun Chen, and Fei Liu","authorsParsed":[["Lin","Haojian",""],["Wang","Ximiao",""],["Cao","Zhaolong",""],["Zhu","Hongjia",""],["Wu","Jiahao",""],["Zhan","Runze",""],["Xu","Ningsheng",""],["Deng","Shaozhi",""],["Chen","Huanjun",""],["Liu","Fei",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 12:07:13 GMT"}],"updateDate":"2024-07-23","timestamp":1721563633000,"abstract":"  Materials with electromagnetic interference (EMI) shielding in the terahertz\n(THz) regime, while minimizing the quantity used, are highly demanded for\nfuture information communication, healthcare and mineral resource exploration\napplications. Currently, there is often a trade-off between the amount of\nmaterial used and the absolute EMI shielding effectiveness (EESt) for the EMI\nshielding materials. Here, we address this trade-off by harnessing the unique\nproperties of two-dimensional (2D) beta12-borophene (beta12-Br) nanosheets.\nLeveraging beta12-Br's light weight and exceptional electron mobility\ncharacteristics, which represent among the highest reported values to date, we\nsimultaneously achieve a THz EMI shield effectiveness (SE) of 70 dB and an EESt\nof 4.8E5 dB cm^2/g (@0.87 THz) using a beta12-Br polymer composite. This\nsurpasses the values of previously reported THz shielding materials with an\nEESt less than 3E5 dB cm^2/g and a SE smaller than 60 dB, while only needs 0.1\nwt.% of these materials to realize the same SE value. Furthermore, by\ncapitalizing on the composite's superior mechanical properties, with 158%\ntensile strain at a Young's modulus of 33 MPa, we demonstrate the\nhigh-efficiency shielding performances of conformably coated surfaces based on\nbeta12-Br nanosheets, suggesting their great potential in EMI shielding area.\n","subjects":["Physics/Applied Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/"}