{"id":"2407.00791","title":"inlabru: software for fitting latent Gaussian models with non-linear\n  predictors","authors":"Finn Lindgren, Fabian Bachl, Janine Illian, Man Ho Suen, H{\\aa}vard\n  Rue, Andrew E. Seaton","authorsParsed":[["Lindgren","Finn",""],["Bachl","Fabian",""],["Illian","Janine",""],["Suen","Man Ho",""],["Rue","Håvard",""],["Seaton","Andrew E.",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 18:08:39 GMT"}],"updateDate":"2024-07-02","timestamp":1719770919000,"abstract":"  The integrated nested Laplace approximation (INLA) method has become a\npopular approach for computationally efficient approximate Bayesian\ncomputation. In particular, by leveraging sparsity in random effect precision\nmatrices, INLA is commonly used in spatial and spatio-temporal applications.\nHowever, the speed of INLA comes at the cost of restricting the user to the\nfamily of latent Gaussian models and the likelihoods currently implemented in\n{INLA}, the main software implementation of the INLA methodology.\n  {inlabru} is a software package that extends the types of models that can be\nfitted using INLA by allowing the latent predictor to be non-linear in its\nparameters, moving beyond the additive linear predictor framework to allow more\ncomplex functional relationships. For inference it uses an approximate\niterative method based on the first-order Taylor expansion of the non-linear\npredictor, fitting the model using INLA for each linearised model\nconfiguration.\n  {inlabru} automates much of the workflow required to fit models using\n{R-INLA}, simplifying the process for users to specify, fit and predict from\nmodels. There is additional support for fitting joint likelihood models by\nbuilding each likelihood individually. {inlabru} also supports the direct use\nof spatial data structures, such as those implemented in the {sf} and {terra}\npackages.\n  In this paper we outline the statistical theory, model structure and basic\nsyntax required for users to understand and develop their own models using\n{inlabru}. We evaluate the approximate inference method using a Bayesian method\nchecking approach. We provide three examples modelling simulated spatial data\nthat demonstrate the benefits of the additional flexibility provided by\n{inlabru}.\n","subjects":["Statistics/Methodology","Statistics/Computation"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}