{"id":"2407.14333","title":"As Generative Models Improve, People Adapt Their Prompts","authors":"Eaman Jahani, Benjamin S. Manning, Joe Zhang, Hong-Yi TuYe, Mohammed\n  Alsobay, Christos Nicolaides, Siddharth Suri, David Holtz","authorsParsed":[["Jahani","Eaman",""],["Manning","Benjamin S.",""],["Zhang","Joe",""],["TuYe","Hong-Yi",""],["Alsobay","Mohammed",""],["Nicolaides","Christos",""],["Suri","Siddharth",""],["Holtz","David",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 14:13:02 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 12:57:21 GMT"}],"updateDate":"2024-08-19","timestamp":1721398382000,"abstract":"  In an online experiment with N = 1893 participants, we collected and analyzed\nover 18,000 prompts and over 300,000 images to explore how the importance of\nprompting will change as the capabilities of generative AI models continue to\nimprove. Each participant in our experiment was randomly and blindly assigned\nto use one of three text-to-image diffusion models: DALL-E 2, its more advanced\nsuccessor DALL-E 3, or a version of DALL-E 3 with automatic prompt revision.\nParticipants were then asked to write prompts to reproduce a target image as\nclosely as possible in 10 consecutive tries. We find that task performance was\nhigher for participants using DALL-E 3 than for those using DALL-E 2. This\nperformance gap corresponds to a noticeable difference in the similarity of\nparticipants' images to their target images, and was caused in equal measure\nby: (1) the increased technical capabilities of DALL-E 3, and (2) endogenous\nchanges in participants' prompting in response to these increased capabilities.\nMore specifically, despite being blind to the model they were assigned,\nparticipants assigned to DALL-E 3 wrote longer prompts that were more\nsemantically similar to each other and contained a greater number of\ndescriptive words. Furthermore, while participants assigned to DALL-E 3 with\nprompt revision still outperformed those assigned to DALL-E 2, automatic prompt\nrevision reduced the benefits of using DALL-E 3 by 58\\%. Taken together, our\nresults suggest that as models continue to progress, people will continue to\nadapt their prompts to take advantage of new models' capabilities.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Economics/General Economics","Quantitative Finance/Economics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}