{"id":"2407.09896","title":"Zero-Shot Image Compression with Diffusion-Based Posterior Sampling","authors":"Noam Elata, Tomer Michaeli, Michael Elad","authorsParsed":[["Elata","Noam",""],["Michaeli","Tomer",""],["Elad","Michael",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 14:24:22 GMT"}],"updateDate":"2024-07-16","timestamp":1720880662000,"abstract":"  Diffusion models dominate the field of image generation, however they have\nyet to make major breakthroughs in the field of image compression. Indeed,\nwhile pre-trained diffusion models have been successfully adapted to a wide\nvariety of downstream tasks, existing work in diffusion-based image compression\nrequire task specific model training, which can be both cumbersome and\nlimiting. This work addresses this gap by harnessing the image prior learned by\nexisting pre-trained diffusion models for solving the task of lossy image\ncompression. This enables the use of the wide variety of publicly-available\nmodels, and avoids the need for training or fine-tuning. Our method, PSC\n(Posterior Sampling-based Compression), utilizes zero-shot diffusion-based\nposterior samplers. It does so through a novel sequential process inspired by\nthe active acquisition technique \"Adasense\" to accumulate informative\nmeasurements of the image. This strategy minimizes uncertainty in the\nreconstructed image and allows for construction of an image-adaptive transform\ncoordinated between both the encoder and decoder. PSC offers a progressive\ncompression scheme that is both practical and simple to implement. Despite\nminimal tuning, and a simple quantization and entropy coding, PSC achieves\ncompetitive results compared to established methods, paving the way for further\nexploration of pre-trained diffusion models and posterior samplers for image\ncompression.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Eb0UTFeZ0F8Dm4WnnMeu8LW8TXp0Q4wTFq1sexx1mYw","pdfSize":"14216532"}
