{"id":"2407.12366","title":"NavGPT-2: Unleashing Navigational Reasoning Capability for Large\n  Vision-Language Models","authors":"Gengze Zhou, Yicong Hong, Zun Wang, Xin Eric Wang, Qi Wu","authorsParsed":[["Zhou","Gengze",""],["Hong","Yicong",""],["Wang","Zun",""],["Wang","Xin Eric",""],["Wu","Qi",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 07:44:26 GMT"}],"updateDate":"2024-07-18","timestamp":1721202266000,"abstract":"  Capitalizing on the remarkable advancements in Large Language Models (LLMs),\nthere is a burgeoning initiative to harness LLMs for instruction following\nrobotic navigation. Such a trend underscores the potential of LLMs to\ngeneralize navigational reasoning and diverse language understanding. However,\na significant discrepancy in agent performance is observed when integrating\nLLMs in the Vision-and-Language navigation (VLN) tasks compared to previous\ndownstream specialist models. Furthermore, the inherent capacity of language to\ninterpret and facilitate communication in agent interactions is often\nunderutilized in these integrations. In this work, we strive to bridge the\ndivide between VLN-specialized models and LLM-based navigation paradigms, while\nmaintaining the interpretative prowess of LLMs in generating linguistic\nnavigational reasoning. By aligning visual content in a frozen LLM, we\nencompass visual observation comprehension for LLMs and exploit a way to\nincorporate LLMs and navigation policy networks for effective action\npredictions and navigational reasoning. We demonstrate the data efficiency of\nthe proposed methods and eliminate the gap between LM-based agents and\nstate-of-the-art VLN specialists.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"7gTlMqAWOxV00DBIZZv78LCcNgAk5K0tb3FULPw21ks","pdfSize":"10624436"}
