{"id":"2407.18325","title":"FemQuest -- An Interactive Multiplayer Game to Engage Girls in\n  Programming","authors":"Michael Holly, Lisa Habich, Maria Seiser, Florian Glawogger, Kevin\n  Innerebner, Sandra Kupsa, Philipp Einwallner, Johanna Pirker","authorsParsed":[["Holly","Michael",""],["Habich","Lisa",""],["Seiser","Maria",""],["Glawogger","Florian",""],["Innerebner","Kevin",""],["Kupsa","Sandra",""],["Einwallner","Philipp",""],["Pirker","Johanna",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 08:42:22 GMT"}],"updateDate":"2024-07-29","timestamp":1720082542000,"abstract":"  In recent decades, computer science (CS) has undergone remarkable growth and\ndiversification. Creating attractive, social, or hands-on games has already\nbeen identified as a possible approach to get teenagers and young adults\ninterested in CS. However, overcoming the global gap between the interest and\nparticipation of men and women in CS is still a worldwide problem. To address\nthis challenge, we present a multiplayer game that is used in a workshop\nsetting to motivate girls to program through a 3D game environment. The paper\naims to expand the educational landscape within computer science education by\noffering a motivating and engaging platform for young women to explore\nprogramming quests in a collaborative environment. The study involved 235 girls\nand 50 coaches for the workshop evaluation and a subset of 20 participants for\nan in-game analysis. In this paper, we explore the engagement in programming\nand assess the cognitive workload while playing and solving programming quests\nwithin the game, as well as the learning experience and the outcome. The\nresults show that the positive outcomes of the workshop underscore the\neffectiveness of a game-based collaborative learning approach to get girls\ninterested in computer science activities. The variety of solutions found for\nthe different tasks demonstrates the creativity and problem-solving skills of\nthe participants and underlines the effectiveness of the workshop in promoting\ncritical thinking and computational skills.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}