{"id":"2407.14606","title":"Performance of the Nonlinear Curvature Wavefront Sensor as a Function of\n  Scintillation Strength","authors":"Stanimir Letchev, Justin R. Crepp, Caleb G. Abbott, Ryan Hersey,\n  Matthew Engstrom, Nicholas Baggett","authorsParsed":[["Letchev","Stanimir",""],["Crepp","Justin R.",""],["Abbott","Caleb G.",""],["Hersey","Ryan",""],["Engstrom","Matthew",""],["Baggett","Nicholas",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 18:04:00 GMT"}],"updateDate":"2024-07-23","timestamp":1721412240000,"abstract":"  Local amplitude aberrations caused by scintillation can impact the\nreconstruction process of a wavefront sensor (WFS) by inducing a spatially\nnon-uniform intensity at the pupil plane. This effect is especially relevant\nfor the commonly-used Shack-Hartmann WFS (SHWFS), which can lose slope\ninformation for portions of the beam where the signal is faint, leading to\nreduced reconstruction performance and eventually total failure as the level of\nscintillation increases. An alternative WFS is needed for such conditions. The\nnonlinear curvature wavefront sensor (nlCWFS) has been shown to achieve better\nsensitivity compared to the SHWFS under low light levels. Additionally, the\nnlCWFS has demonstrated the ability to maintain its sensitivity in the presence\nof scintillation, using amplitude aberrations to help inform the reconstruction\nprocess, rather than hinder. Experiments to date have thus far only shown\nreconstruction results for a single scintillation value. Building upon previous\nsimulations and laboratory experiments, we have built a testbed to quantify the\neffects of varying scintillation strength on the wavefront reconstruction\nperformance of the nlCWFS compared to an equivalent SHWFS. In this paper, we\npresent results showing the difference in performance between the nlCWFS and\nSHWFS as a function of relative flux and scintillation strength.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"7HJMeuHnDFbn8KFvZUoy8JuMVkt9wr1FfykwCSRMl7Y","pdfSize":"1648142"}
