{"id":"2407.14096","title":"On the microscopic structure of neat linear alkylamine liquids: an x-ray\n  scattering and computer simulation study","authors":"Martina Po\\v{z}ar, Lena Friedrich, Tristan Millet, Michael Paulus,\n  Christian Sternemann and Aur\\'elien Perera","authorsParsed":[["Požar","Martina",""],["Friedrich","Lena",""],["Millet","Tristan",""],["Paulus","Michael",""],["Sternemann","Christian",""],["Perera","Aurélien",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 08:03:47 GMT"}],"updateDate":"2024-07-22","timestamp":1721376227000,"abstract":"  Ambient condition linear amines, from propylamine up to nonylamine, are\nstudied by x-ray scattering and Molecular Dynamics simulations of various force\nfield models. The major finding is that the pre-peak in alkylamines is of about\none order of magnitude weaker than that in alkanols, hence suggesting much\nweaker hydrogen bonding induced clustering of the amine groups than for the\nhydroxyl groups. Computer simulation studies reveal that OPLS-UA model\nreproduces the pre-peak, but with larger amplitudes, while the GROMOS-UA and\nCHARMM-AA force fields show almost no pre-peak. Simulations of all models\nreveal the existence of hydrogen bonded clusters, equally confirmed through the\nprominent pre-peak of the structure factor between the nitrogen atoms. But,\nthis pre-peak gets nearly cancelled by the various combinations of the\natom-atom structure factors contributions to the scattering intensity, except\nfor the OPLS model. The purpose of this work is to understand the weakness of\nthe scattering pre-peak from the pair correlation function perspective,\nconsidered as an order parameter associated to the concept of charge order. The\ndifference between models is equally analyzed from the same perspective. The\nanalysis reveals the strong charge order induced structural similarity between\namines and water, as opposed to mono-ols. This is traced back to the C2v\nsymmetry of both the water molecule and the amine head group. It explains both\nthe existence of H-bonded clusters and the weak scattering pre-peak. Concerning\nthe models, the presence or absence of partial charges in the methyl groups of\nthe alkyl tails explains the presence or absence of the pre-peak in the\ncalculated scattering intensities\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-6IEobc95KJsnxwfKmCndUiuTkuYmSvf7u0DzxLfM5E","pdfSize":"2342007"}
