{"id":"2407.09166","title":"68-Channel Highly-Integrated Neural Signal Processing PSoC with On-Chip\n  Feature Extraction, Compression, and Hardware Accelerators for\n  Neuroprosthetics in 22nm FDSOI","authors":"Liyuan Guo, Annika Wei{\\ss}e, Seyed Mohammad Ali Zeinolabedin, Franz\n  Marcus Sch\\\"uffny, Marco Stolba, Qier Ma, Zhuo Wang, Stefan Scholze, Andreas\n  Dixius, Marc Berthel, Johannes Partzsch, Dennis Walter, Georg Ellguth,\n  Sebastian H\\\"oppner, Richard George and Christian Mayr","authorsParsed":[["Guo","Liyuan",""],["Weiße","Annika",""],["Zeinolabedin","Seyed Mohammad Ali",""],["Schüffny","Franz Marcus",""],["Stolba","Marco",""],["Ma","Qier",""],["Wang","Zhuo",""],["Scholze","Stefan",""],["Dixius","Andreas",""],["Berthel","Marc",""],["Partzsch","Johannes",""],["Walter","Dennis",""],["Ellguth","Georg",""],["Höppner","Sebastian",""],["George","Richard",""],["Mayr","Christian",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 11:00:52 GMT"}],"updateDate":"2024-07-15","timestamp":1720782052000,"abstract":"  Multi-channel electrophysiology systems for recording of neuronal activity\nface significant data throughput limitations, hampering real-time,\ndata-informed experiments. These limitations impact both experimental\nneurobiology research and next-generation neuroprosthetics. We present a novel\nsolution that leverages the high integration density of 22nm FDSOI CMOS\ntechnology to address these challenges. The proposed highly integrated\nprogrammable System-on-Chip comprises 68-channel 0.41 \\textmu W/Ch recording\nfrontends, spike detectors, 16-channel 0.87-4.39 \\textmu W/Ch action potential\nand 8-channel 0.32 \\textmu W/Ch local field potential codecs, as well as a\nMAC-assisted power-efficient processor operating at 25 MHz (5.19 \\textmu\nW/MHz). The system supports on-chip training processes for compression,\ntraining and inference for neural spike sorting. The spike sorting achieves an\naverage accuracy of 91.48% or 94.12% depending on the utilized features. The\nproposed PSoC is optimized for reduced area (9 mm2) and power. On-chip\nprocessing and compression capabilities free up the data bottlenecks in data\ntransmission (up to 91% space saving ratio), and moreover enable a fully\nautonomous yet flexible processor-driven operation. Combined, these design\nconsiderations overcome data-bottlenecks by allowing on-chip feature extraction\nand subsequent compression.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}