{"id":"2407.01078","title":"A convolutional model for estimating the junction temperatures of SiC\n  MOSFET transistors","authors":"Ali El Arabi, Denis Maillet, Nicolas Blet (LEMTA), Benjamin Remy","authorsParsed":[["Arabi","Ali El","","LEMTA"],["Maillet","Denis","","LEMTA"],["Blet","Nicolas","","LEMTA"],["Remy","Benjamin",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:31:48 GMT"}],"updateDate":"2024-07-02","timestamp":1719822708000,"abstract":"  The junction temperature is a very important parameter for monitoring power\nelectronics converters based on MOSFET transistors. They offer the possibility\nof switching at relatively higher frequencies than other transistors like\nIGTBTs. However, the electrical parameters of MOSFETs are highly thermally\ndependent. The thermo-dependence of MOSFET electrical parameters is rarely\ntaken into consideration when implementing control strategies, for many\ntechnological reasons, such as the difficulty of measuring the junction\ntemperature. In practice, the junction temperature of transistors is\ninaccessible for direct measurement. The presence of a gel covering the chips,\nthat provides electrical and thermal insulation, makes measurement by infrared\nthermography impossible. Furthermore, direct thermocouple measurement cannot be\nimplemented due to the electromagnetic disturbances in the environment. Several\nresearchers have attempted to correlate chip temperature with thermosensitive\nelectrical parameters. In the present work, a thermal convolutive model has\nbeen developed to estimate the junction temperatures of two MOSFET transistors\nbelonging to the same electronic circuit from external temperature measurements\nin two well-chosen locations (far away enough from the junction to avoid\nelectromagnetic interference), using also the measured power dissipated on each\nchip. The thermal coupling between the two transistors has been considered in\nthe form of mutual transmittances. The model was first calibrated using\nthree-dimensional numerical simulations in COMSOL Multiphysics, followed by an\nexperimental study. The results are very promising, illustrating the robustness\nof the convolutional model.\n","subjects":["Physics/Classical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}