{"id":"2407.02682","title":"Epitaxial Growth of Rutile GeO$_2$ via MOCVD","authors":"Imteaz Rahaman, Bobby Duersch, Hunter D. Ellis, Michael A. Scarpulla,\n  and Kai Fu","authorsParsed":[["Rahaman","Imteaz",""],["Duersch","Bobby",""],["Ellis","Hunter D.",""],["Scarpulla","Michael A.",""],["Fu","Kai",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 21:47:37 GMT"}],"updateDate":"2024-07-04","timestamp":1719956857000,"abstract":"  Rutile Germanium Dioxide (r-GeO$_2$) has been identified as an ultrawide\nbandgap (UWBG) semiconductor recently, featuring a bandgap of 4.68 eV,\ncomparable to Ga$_2$O$_3$ but offering bipolar dopability, higher electron\nmobility, higher thermal conductivity, and higher Baliga's figure of merit\n(BFOM).These superior properties position GeO$_2$ as a promising material for\nvarious semiconductor applications. However, the epitaxial growth of r-GeO$_2$,\nparticularly in its most advantageous rutile polymorph, is still at an early\nstage. This work explores the growth of r-GeO$_2$ using metal-organic chemical\nvapor deposition (MOCVD) on an r-TiO$_2$ (001) substrate, utilizing tetraethyl\ngermane (TEGe) as the precursor. Our investigations reveal that higher growth\ntemperatures significantly enhance crystalline quality, achieving a full width\nat half maximum (FWHM) of 0.181 degree at 925 degree C, compared to 0.54 degree\nat 840 degree C and amorphous structures at 725 degree C. Additionally, we\nfound that longer growth durations increase surface roughness due to the\nformation of faceted crystals. Meanwhile, adjusting the susceptor rotation\nspeed from 300 RPM to 170 RPM plays a crucial role in optimizing crystalline\nquality, effectively reducing surface roughness by approximately 15 times. This\nstudy offers a foundational guide for optimizing MOCVD growth conditions of\nr-GeO$_2$ films, emphasizing the crucial need for precise control over\ndeposition temperature and rotation speed to enhance adatom mobility and\neffectively minimize the boundary layer thickness.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}