{"id":"2407.15821","title":"Towards Effective Collaboration between Software Engineers and Data\n  Scientists developing Machine Learning-Enabled Systems","authors":"Gabriel Busquim, Allysson Allex Ara\\'ujo, Maria Julia Lima, Marcos\n  Kalinowski","authorsParsed":[["Busquim","Gabriel",""],["Araújo","Allysson Allex",""],["Lima","Maria Julia",""],["Kalinowski","Marcos",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 17:35:18 GMT"}],"updateDate":"2024-07-23","timestamp":1721669718000,"abstract":"  Incorporating Machine Learning (ML) into existing systems is a demand that\nhas grown among several organizations. However, the development of ML-enabled\nsystems encompasses several social and technical challenges, which must be\naddressed by actors with different fields of expertise working together. This\npaper has the objective of understanding how to enhance the collaboration\nbetween two key actors in building these systems: software engineers and data\nscientists. We conducted two focus group sessions with experienced data\nscientists and software engineers working on real-world ML-enabled systems to\nassess the relevance of different recommendations for specific technical tasks.\nOur research has found that collaboration between these actors is important for\neffectively developing ML-enabled systems, especially when defining data access\nand ML model deployment. Participants provided concrete examples of how\nrecommendations depicted in the literature can benefit collaboration during\ndifferent tasks. For example, defining clear responsibilities for each team\nmember and creating concise documentation can improve communication and overall\nperformance. Our study contributes to a better understanding of how to foster\neffective collaboration between software engineers and data scientists creating\nML-enabled systems.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7hGPklFNnu8CGPXU7rdnYskXqeNihahEI2WaZ2lWqsU","pdfSize":"529903"}
