{"id":"2407.11634","title":"A goodness-of-fit test for testing exponentiality based on normalized\n  dynamic survival extropy","authors":"Gaurav Kandpal, Nitin Gupta","authorsParsed":[["Kandpal","Gaurav",""],["Gupta","Nitin",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 11:57:00 GMT"}],"updateDate":"2024-07-17","timestamp":1721131020000,"abstract":"  The cumulative residual extropy (CRJ) is a measure of uncertainty that serves\nas an alternative to extropy. It replaces the probability density function with\nthe survival function in the expression of extropy. This work introduces a new\nconcept called normalized dynamic survival extropy (NDSE), a dynamic variation\nof CRJ. We observe that NDSE is equivalent to CRJ of the random variable of\ninterest $X_{[t]}$ in the age replacement model at a fixed time $t$.\nAdditionally, we have demonstrated that NDSE remains constant exclusively for\nexponential distribution at any time. We categorize two classes, INDSE and\nDNDSE, based on their increasing and decreasing NDSE values. Next, we present a\nnon-parametric test to assess whether a distribution follows an exponential\npattern against INDSE. We derive the exact and asymptotic distribution for the\ntest statistic $\\widehat{\\Delta}^*$. Additionally, a test for asymptotic\nbehavior is presented in the paper for right censoring data. Finally, we\ndetermine the critical values and power of our exact test through simulation.\nThe simulation demonstrates that the suggested test is easy to compute and has\nsignificant statistical power, even with small sample sizes. We also conduct a\npower comparison analysis among other tests, which shows better power for the\nproposed test against other alternatives mentioned in this paper. Some\nnumerical real-life examples validating the test are also included.\n","subjects":["Statistics/Methodology","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}