{"id":"2407.08596","title":"Modeling X-Ray Multi-Reflection in Super-Eddington Winds","authors":"Zijian Zhang, Lars Lund Thomsen, Lixin Dai, Christopher S. Reynolds,\n  Javier A. Garc\\'ia, Erin Kara, Riley Connors, Megan Masterson, Yuhan Yao,\n  Thomas Dauser","authorsParsed":[["Zhang","Zijian",""],["Thomsen","Lars Lund",""],["Dai","Lixin",""],["Reynolds","Christopher S.",""],["García","Javier A.",""],["Kara","Erin",""],["Connors","Riley",""],["Masterson","Megan",""],["Yao","Yuhan",""],["Dauser","Thomas",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 15:24:56 GMT"}],"updateDate":"2024-07-12","timestamp":1720711496000,"abstract":"  It has been recently discovered that a few super-Eddington sources undergoing\nblack hole super-Eddington accretion exhibit X-ray reflection signatures. In\nsuch new systems, one expects that the coronal X-ray emissions are mainly\nreflected by optically thick super-Eddington winds instead of thin disks. In\nthis paper, we conduct a series of general relativistic ray-tracing and Monte\nCarlo radiative transfer simulations to model the X-ray reflection signatures,\nespecially the characteristic Fe K$\\alpha$ line, produced from super-Eddington\naccretion flows. In particular, we allow the photons emitted by a lamppost\ncorona to be reflected multiple times in a cone-like funnel surrounded by fast\nwinds. We find that the Fe K$\\alpha$ line profile most sensitively depends on\nthe wind kinematics, while its exact shape also depends on the funnel open\nangle and corona height. Furthermore, very interestingly, we find that the Fe\nK$\\alpha$ line can have a prominent double-peak profile in certain parameter\nspaces even with a face-on orientation. Moreover, we compare the Fe K$\\alpha$\nline profiles produced from super-Eddington and thin disks and show that such\nlines can provide important insights into the understanding of black hole\nsystems undergoing super-Eddington accretion.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}