{"id":"2407.08515","title":"15M Multimodal Facial Image-Text Dataset","authors":"Dawei Dai, YuTang Li, YingGe Liu, Mingming Jia, Zhang YuanHui, and\n  Guoyin Wang","authorsParsed":[["Dai","Dawei",""],["Li","YuTang",""],["Liu","YingGe",""],["Jia","Mingming",""],["YuanHui","Zhang",""],["Wang","Guoyin",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:00:14 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 01:19:33 GMT"}],"updateDate":"2024-07-15","timestamp":1720706414000,"abstract":"  Currently, image-text-driven multi-modal deep learning models have\ndemonstrated their outstanding potential in many fields. In practice, tasks\ncentered around facial images have broad application prospects. This paper\npresents \\textbf{FaceCaption-15M}, a large-scale, diverse, and high-quality\ndataset of facial images accompanied by their natural language descriptions\n(facial image-to-text). This dataset aims to facilitate a study on\nface-centered tasks. FaceCaption-15M comprises over 15 million pairs of facial\nimages and their corresponding natural language descriptions of facial\nfeatures, making it the largest facial image-caption dataset to date. We\nconducted a comprehensive analysis of image quality, text naturalness, text\ncomplexity, and text-image relevance to demonstrate the superiority of\nFaceCaption-15M. To validate the effectiveness of FaceCaption-15M, we first\ntrained a facial language-image pre-training model (FLIP, similar to CLIP) to\nalign facial image with its corresponding captions in feature space.\nSubsequently, using both image and text encoders and fine-tuning only the\nlinear layer, our FLIP-based models achieved state-of-the-art results on two\nchallenging face-centered tasks. The purpose is to promote research in the\nfield of face-related tasks through the availability of the proposed\nFaceCaption-15M dataset. All data, codes, and models are publicly available.\nhttps://huggingface.co/datasets/OpenFace-CQUPT/FaceCaption-15M\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}