{"id":"2407.17914","title":"Modelling Multimodal Integration in Human Concept Processing with\n  Vision-and-Language Models","authors":"Anna Bavaresco, Marianne de Heer Kloots, Sandro Pezzelle, Raquel\n  Fern\\'andez","authorsParsed":[["Bavaresco","Anna",""],["Kloots","Marianne de Heer",""],["Pezzelle","Sandro",""],["Fernández","Raquel",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 10:08:37 GMT"}],"updateDate":"2024-07-26","timestamp":1721902117000,"abstract":"  Representations from deep neural networks (DNNs) have proven remarkably\npredictive of neural activity involved in both visual and linguistic\nprocessing. Despite these successes, most studies to date concern unimodal\nDNNs, encoding either visual or textual input but not both. Yet, there is\ngrowing evidence that human meaning representations integrate linguistic and\nsensory-motor information. Here we investigate whether the integration of\nmultimodal information operated by current vision-and-language DNN models\n(VLMs) leads to representations that are more aligned with human brain activity\nthan those obtained by language-only and vision-only DNNs. We focus on fMRI\nresponses recorded while participants read concept words in the context of\neither a full sentence or an accompanying picture. Our results reveal that VLM\nrepresentations correlate more strongly than language- and vision-only DNNs\nwith activations in brain areas functionally related to language processing. A\ncomparison between different types of visuo-linguistic architectures shows that\nrecent generative VLMs tend to be less brain-aligned than previous\narchitectures with lower performance on downstream applications. Moreover,\nthrough an additional analysis comparing brain vs. behavioural alignment across\nmultiple VLMs, we show that -- with one remarkable exception -- representations\nthat strongly align with behavioural judgments do not correlate highly with\nbrain responses. This indicates that brain similarity does not go hand in hand\nwith behavioural similarity, and vice versa.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}