{"id":"2407.09271","title":"iNeMo: Incremental Neural Mesh Models for Robust Class-Incremental\n  Learning","authors":"Tom Fischer, Yaoyao Liu, Artur Jesslen, Noor Ahmed, Prakhar Kaushik,\n  Angtian Wang, Alan Yuille, Adam Kortylewski, Eddy Ilg","authorsParsed":[["Fischer","Tom",""],["Liu","Yaoyao",""],["Jesslen","Artur",""],["Ahmed","Noor",""],["Kaushik","Prakhar",""],["Wang","Angtian",""],["Yuille","Alan",""],["Kortylewski","Adam",""],["Ilg","Eddy",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 13:57:49 GMT"},{"version":"v2","created":"Mon, 19 Aug 2024 08:38:32 GMT"}],"updateDate":"2024-08-20","timestamp":1720792669000,"abstract":"  Different from human nature, it is still common practice today for vision\ntasks to train deep learning models only initially and on fixed datasets. A\nvariety of approaches have recently addressed handling continual data streams.\nHowever, extending these methods to manage out-of-distribution (OOD) scenarios\nhas not effectively been investigated. On the other hand, it has recently been\nshown that non-continual neural mesh models exhibit strong performance in\ngeneralizing to such OOD scenarios. To leverage this decisive property in a\ncontinual learning setting, we propose incremental neural mesh models that can\nbe extended with new meshes over time. In addition, we present a latent space\ninitialization strategy that enables us to allocate feature space for future\nunseen classes in advance and a positional regularization term that forces the\nfeatures of the different classes to consistently stay in respective latent\nspace regions. We demonstrate the effectiveness of our method through extensive\nexperiments on the Pascal3D and ObjectNet3D datasets and show that our approach\noutperforms the baselines for classification by $2-6\\%$ in the in-domain and by\n$6-50\\%$ in the OOD setting. Our work also presents the first incremental\nlearning approach for pose estimation. Our code and model can be found at\nhttps://github.com/Fischer-Tom/iNeMo.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}