{"id":"2407.10435","title":"Nontrivial impact of interlayer coupling on thermal conductivity:\n  opposing trends in in-plane and out-of-plane phonons","authors":"H. F. Feng, B. Liu, J. L. Bai, X. Zhang, Z. X. Song, and Zhi-Xin Guo","authorsParsed":[["Feng","H. F.",""],["Liu","B.",""],["Bai","J. L.",""],["Zhang","X.",""],["Song","Z. X.",""],["Guo","Zhi-Xin",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 04:30:14 GMT"}],"updateDate":"2024-07-16","timestamp":1721017814000,"abstract":"  The study of heat transport in two-dimensional (2D) materials reveals novel\nbehaviors due to quantum confinement effects, where in-plane and out-of-plane\nphonons play crucial roles. In 2D materials like graphene, it is widely\nrecognized that the out-of-plane vibrational mode is the primary contributor to\nthermal conductivity owing to the mirror symmetry. Based on this perspective,\nthe introduction of interlayer coupling, which breaks this symmetry, is\nexpected to induce a significant reduction in thermal conductivity within 2D\nmaterials. Nevertheless, recent studies have presented unexpected findings,\nindicating that interlayer coupling can actually increase thermal conductivity\nof 2D materials. This controversial result suggests a nontrivial underlying\nmechanism governing the effects of interlayer coupling on thermal conductivity\nin 2D materials, necessitating further exploration. In our work, we investigate\nthe modulation of thermal conductivity through interlayer coupling in a\nsandwich structure composed of hexagonal boron nitride (h-BN) and bilayer\ngraphene (BG), specifically a h- BN/BG/h-BN system. Through molecular dynamics\nsimulations, we find that the thermal conductivity from out-of-plane phonons\ncan be significantly reduced, while that from in-plane phonons can be\nsignificantly increased, as the interlayer coupling strength increases. This\nresults in a nontrivial, coupling-strength-dependent overall thermal\nconductivity. The phonon spectrum analysis conducted using our modified package\nreveals that the upshift and flattening of the out-of-plane (ZA and ZO) phonon\nmodes are mainly responsible for these variations, and the extent of the\nupshift and flattening is proportional to the strength of interlayer coupling.\nThis work offers new insights into manipulating the thermal conductivity of 2D\nmaterials.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}