{"id":"2407.16580","title":"Assessment of scoring functions for computational models of\n  protein-protein interfaces","authors":"Jacob Sumner, Grace Meng, Naomi Brandt, Alex T. Grigas, Andr\\'es\n  C\\'ordoba, Mark D. Shattuck, Corey S. O'Hern","authorsParsed":[["Sumner","Jacob",""],["Meng","Grace",""],["Brandt","Naomi",""],["Grigas","Alex T.",""],["Córdoba","Andrés",""],["Shattuck","Mark D.",""],["O'Hern","Corey S.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 15:36:47 GMT"}],"updateDate":"2024-07-24","timestamp":1721749007000,"abstract":"  A goal of computational studies of protein-protein interfaces (PPIs) is to\npredict the binding site between two monomers that form a heterodimer. The\nsimplest version of this problem is to rigidly re-dock the bound forms of the\nmonomers, which involves generating computational models of the heterodimer and\nthen scoring them to determine the most native-like models. Scoring functions\nhave been assessed previously using rank- and classification-based metrics,\nhowever, these methods are sensitive to the number and quality of models in the\nscoring function training set. We assess the accuracy of seven PPI scoring\nfunctions by comparing their scores to a measure of structural similarity to\nthe x-ray crystal structure (i.e. the DockQ score) for a non-redundant set of\nheterodimers from the Protein Data Bank. For each heterodimer, we generate\nre-docked models uniformly sampled over DockQ and calculate the Spearman\ncorrelation between the PPI scores and DockQ. For some targets, the scores and\nDockQ are highly correlated; however, for many targets, there are weak\ncorrelations. Several physical features can explain the difference between\ndifficult- and easy-to-score targets. For example, strong correlations exist\nbetween the score and DockQ for targets with highly intertwined monomers and\nmany interface contacts. We also develop a new score based on only three\nphysical features that matches or exceeds the performance of current PPI\nscoring functions. These results emphasize that PPI prediction can be improved\nby focusing on correlations between the PPI score and DockQ and incorporating\nmore discriminating physical features into PPI scoring functions.\n","subjects":["Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by/4.0/"}