{"id":"2407.09932","title":"Quantum Clock Synchronization Network with Silicon-chip Dual-Pumped\n  Entangled Photon Source","authors":"J. A. Li, H. Han, X. P. Huang, B.Y. Tang, K. Guo, J. Q. Huang, S. Y.\n  Xiong, W. R. Yu, Z. J. Zhang, J. B. Yang, B. Liu, H. Chen, and Z. K. Lu","authorsParsed":[["Li","J. A.",""],["Han","H.",""],["Huang","X. P.",""],["Tang","B. Y.",""],["Guo","K.",""],["Huang","J. Q.",""],["Xiong","S. Y.",""],["Yu","W. R.",""],["Zhang","Z. J.",""],["Yang","J. B.",""],["Liu","B.",""],["Chen","H.",""],["Lu","Z. K.",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 16:04:54 GMT"}],"updateDate":"2024-07-16","timestamp":1720886694000,"abstract":"  In this paper, we propose a quantum clock synchronization (QCS) network\nscheme with silicon-chip dual-pumped entangled photon source. This scheme\ncouples two pump beams into the silicon-based waveguide, where degenerate and\nnon-degenerate spontaneous four-wave mixing (SFWM) occurs, generating\nentanglement between one signal channel and three idler channels. The entangled\nphotons are distributed to remote users through the wavelength division\nmultiplexing strategy to construct an entanglement distribution network, and\nthe round-trip QCS is adopted to realize a QCS network that can serve multiple\nusers. A proof-of-principle QCS network experiment is implemented among the\nserver and multiple users (Alice, Bob, and Charlie) for 11.1 hours, where Alice\nand Charlie are 10 km away from the server and Bob is 25 km away from the\nserver. The lowest time deviations (TDEV) between the server and each user\n(Alice, Bob, and Charlie) are 1.57 ps, 0.82 ps and 2.57 ps at the average time\nof 8000 s, 8000 s and 800 s respectively. The results show that the QCS network\nscheme with dual-pumped SFWM photon source proposed by us achieves high\naccuracy, and the channel resources used by n users are reduced by about 30%\ncompared with other round-trip QCS schemes.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eOeljgRG_XaBa_nS4GyIq3MWptCS27P90msUXfo80Vo","pdfSize":"3146644"}
