{"id":"2407.09684","title":"Characteristics and Source Regions of Slow Alfvenic Solar Wind Observed\n  by Parker Solar Probe","authors":"Tamar Ervin, Kai Jaffarove, Samuel T. Badman, Jia Huang, Yeimy J.\n  Rivera, Stuart D. Bale","authorsParsed":[["Ervin","Tamar",""],["Jaffarove","Kai",""],["Badman","Samuel T.",""],["Huang","Jia",""],["Rivera","Yeimy J.",""],["Bale","Stuart D.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 20:41:23 GMT"},{"version":"v2","created":"Mon, 16 Sep 2024 20:40:10 GMT"}],"updateDate":"2024-09-18","timestamp":1720816883000,"abstract":"  Using a classification scheme for solar wind type based on the heliocentric\ndistance of the observation, we look at near perihelion observations from\nParker Solar Probe Encounters Four to Fourteen to study the sources of the slow\nAlfv$\\'e$nic solar wind (SASW). Through Potential Field Source Surface (PFSS)\nmodeling and ballistic mapping, we connect streams to their solar source and\nfind that a primary population of SASW comes from low magnetic field strength\nregions (low-$B_0$), likely small coronal holes (CHs) and their over-expanded\nboundaries, while a second population of high field strength (high-$B_0$) seems\nto emerge from non-CH structures potentially through interchange reconnection\nwith nearby open field lines. This low-$B_0$ SASW shows larger expansion than\nthe fast solar wind (FSW) but similar mass flux, potentially indicating\nadditional heating below the critical point, and emergence from a cooler\nstructure, which could lead to slower wind emerging from CH-like structures. We\nshow that this low-$B_0$ SASW shows stronger preferential acceleration of alpha\nparticles (similar to the FSW) than the high-$B_0$ SASW, and that this is a\nvelocity dependent phenomenon as found in previous studies. To have additional\nconfidence in our mapping results, we quantify the error on both the PFSS model\nand ballistic mapping and discuss how additional multi-point observations of\nplasma parameters and composition would allow us to better constrain our models\nand connect the solar wind to its source.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Plasma Physics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JlDvFMbVXrieT8gqMCbr3Fk7njxr2P5S3WFxpEZePYQ","pdfSize":"4992614"}
