{"id":"2407.19499","title":"Optimization for expectation value estimation with shallow quantum\n  circuits","authors":"Bujiao Wu, Yuxuan Yan, Fuchuan Wei, Zhenhuan Liu","authorsParsed":[["Wu","Bujiao",""],["Yan","Yuxuan",""],["Wei","Fuchuan",""],["Liu","Zhenhuan",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 14:04:33 GMT"}],"updateDate":"2024-07-30","timestamp":1722175473000,"abstract":"  Estimating linear properties of quantum states, such as fidelities, molecular\nenergies, and correlation functions, is a fundamental task in quantum\ninformation science. The classical shadow has emerged as a prevalent tool due\nto its efficiency in estimating many independent observables simultaneously.\nHowever, it does not utilize the information of the target observable and the\nconstraints of quantum devices, making it inefficient in many practical\nscenarios where the focus is on estimating a select few observables. To address\nthis inefficiency, we propose a framework that optimizes sample complexity for\nestimating the expectation value of any observable using a shallow\nparameterized quantum circuit. Within this framework, we introduce a greedy\nalgorithm that decomposes the target observable into a linear combination of\nmultiple observables, each of which can be diagonalized with the shallow\ncircuit. Using this decomposition, we then apply an importance sampling\nalgorithm to estimate the expectation value of the target observable. We\nnumerically demonstrate the performance of our algorithm by estimating the\nground energy of a sparse Hamiltonian and the inner product of two pure states,\nhighlighting the advantages compared to some conventional methods.\nAdditionally, we derive the fundamental lower bound for the sample complexity\nrequired to estimate a target observable using a given shallow quantum circuit,\nthereby enhancing our understanding of the capabilities of shallow circuits in\nquantum learning tasks.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}