{"id":"2407.06388","title":"Effect of high pressure synthesis conditions on the formation of high\n  entropy oxides","authors":"Solveig Stubmo Aamlid, Minu Kim, Mario U. Gonz\\'alez-Rivas, Mohamed\n  Oudah, Hidenori Takagi, Alannah M. Hallas","authorsParsed":[["Aamlid","Solveig Stubmo",""],["Kim","Minu",""],["González-Rivas","Mario U.",""],["Oudah","Mohamed",""],["Takagi","Hidenori",""],["Hallas","Alannah M.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 20:56:30 GMT"}],"updateDate":"2024-07-10","timestamp":1720472190000,"abstract":"  High entropy materials are often entropy stabilized, meaning that the\nconfigurational entropy from multiple elements sharing a single lattice site\nstabilizes the structure. In this work, we study how high-pressure synthesis\nconditions can stabilize or destabilize a high entropy oxide (HEO). We study\nthe high-pressure and high-temperature phase equilibria of two well-known\nfamilies of HEOs: the rock-salt structured compound (Mg,Co,Ni,Cu,Zn)O including\nsome cation substitutions and the spinel structured (Cr,Mn,Fe,Co,Ni)$_3$O$_4$.\nSyntheses were performed at various temperatures, pressures, and oxygen\nactivity levels resulting in dramatically different synthesis outcomes. In\nparticular, in the rock salt HEO we observe the competing tenorite and wurtzite\nphases and the possible formation of a layered rock salt phase, while the\nspinel HEO is highly susceptible to decomposition into a mixture of rock-salt\nand corundum phases. At the highest tested pressures, 15 GPa, we discover the\ntransformation of the spinel HEO into a metastable modified ludwigite-type\nstructure with nominal formula (Cr,Mn,Fe,Co,Ni)$_4$O$_5$. The relationship\nbetween the synthesis conditions and the final reaction product is not\nstraightforward. Nonetheless, we conclude that high-pressure conditions provide\nan important opportunity to synthesize high entropy phases that cannot be\nformed any other way.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Disordered Systems and Neural Networks"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}