{"id":"2407.00317","title":"Towards Statistically Significant Taxonomy Aware Co-location Pattern\n  Detection","authors":"Subhankar Ghosh, Arun Sharma, Jayant Gupta, and Shashi Shekhar","authorsParsed":[["Ghosh","Subhankar",""],["Sharma","Arun",""],["Gupta","Jayant",""],["Shekhar","Shashi",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 04:48:39 GMT"},{"version":"v2","created":"Thu, 4 Jul 2024 05:11:10 GMT"}],"updateDate":"2024-07-08","timestamp":1719636519000,"abstract":"  Given a collection of Boolean spatial feature types, their instances, a\nneighborhood relation (e.g., proximity), and a hierarchical taxonomy of the\nfeature types, the goal is to find the subsets of feature types or their\nparents whose spatial interaction is statistically significant. This problem is\nfor taxonomy-reliant applications such as ecology (e.g., finding new symbiotic\nrelationships across the food chain), spatial pathology (e.g., immunotherapy\nfor cancer), retail, etc. The problem is computationally challenging due to the\nexponential number of candidate co-location patterns generated by the taxonomy.\nMost approaches for co-location pattern detection overlook the hierarchical\nrelationships among spatial features, and the statistical significance of the\ndetected patterns is not always considered, leading to potential false\ndiscoveries. This paper introduces two methods for incorporating taxonomies and\nassessing the statistical significance of co-location patterns. The baseline\napproach iteratively checks the significance of co-locations between leaf nodes\nor their ancestors in the taxonomy. Using the Benjamini-Hochberg procedure, an\nadvanced approach is proposed to control the false discovery rate. This\napproach effectively reduces the risk of false discoveries while maintaining\nthe power to detect true co-location patterns. Experimental evaluation and case\nstudy results show the effectiveness of the approach.\n","subjects":["Computing Research Repository/Information Retrieval","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}