{"id":"2407.16691","title":"Automatic Equalization for Individual Instrument Tracks Using\n  Convolutional Neural Networks","authors":"Florian Mockenhaupt, Joscha Simon Rieber, and Shahan Nercessian","authorsParsed":[["Mockenhaupt","Florian",""],["Rieber","Joscha Simon",""],["Nercessian","Shahan",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:55:25 GMT"}],"updateDate":"2024-07-24","timestamp":1721757325000,"abstract":"  We propose a novel approach for the automatic equalization of individual\nmusical instrument tracks. Our method begins by identifying the instrument\npresent within a source recording in order to choose its corresponding ideal\nspectrum as a target. Next, the spectral difference between the recording and\nthe target is calculated, and accordingly, an equalizer matching model is used\nto predict settings for a parametric equalizer. To this end, we build upon a\ndifferentiable parametric equalizer matching neural network, demonstrating\nimprovements relative to previously established state-of-the-art. Unlike past\napproaches, we show how our system naturally allows real-world audio data to be\nleveraged during the training of our matching model, effectively generating\nsuitably produced training targets in an automated manner mirroring conditions\nat inference time. Consequently, we illustrate how fine-tuning our matching\nmodel on such examples considerably improves parametric equalizer matching\nperformance in real-world scenarios, decreasing mean absolute error by 24%\nrelative to methods relying solely on random parameter sampling techniques as a\nself-supervised learning strategy. We perform listening tests, and demonstrate\nthat our proposed automatic equalization solution subjectively enhances the\ntonal characteristics for recordings of common instrument types.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Machine Learning","Computing Research Repository/Sound"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0dtvbJXK3nVrvK4oUFJnBLyYsj1GGsF8hIFlr7O58WQ","pdfSize":"486101","objectId":"0x7b192ecc83218ba6fff41a3f5d8cfb2e9e81702804df541e798557826c97d5f0","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
