{"id":"2407.13003","title":"Planning and Perception for Unmanned Aerial Vehicles in Object and\n  Environmental Monitoring","authors":"Harnaik Dhami","authorsParsed":[["Dhami","Harnaik",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 20:46:05 GMT"}],"updateDate":"2024-07-19","timestamp":1721249165000,"abstract":"  Unmanned Aerial Vehicles (UAVs) equipped with high-resolution sensors enable\nextensive data collection from previously inaccessible areas at a remarkable\nspatio-temporal scale, promising to revolutionize fields such as precision\nagriculture and infrastructure inspection. To fully exploit their potential,\ndeveloping autonomy algorithms for planning and perception is crucial. This\ndissertation focuses on developing planning and perception algorithms tailored\nto UAVs used in monitoring applications.\n  In the first part, we address object monitoring and its associated planning\nchallenges. Object monitoring involves continuous observation, tracking, and\nanalysis of specific objects. We tackle the problem of visual reconstruction\nwhere the goal is to maximize visual coverage of an object in an unknown\nenvironment efficiently. Leveraging shape prediction deep learning models, we\noptimize planning for quick information gathering. Extending this to multi-UAV\nsystems, we create efficient paths around objects based on reconstructed 3D\nmodels, crucial for close-up inspections aimed at detecting changes.\n  Next, we explore inspection scenarios where an object has changed or no prior\ninformation is available, focusing on infrastructure inspection. We validate\nour planning algorithms through real-world experiments and high-fidelity\nsimulations, integrating defect detection seamlessly into the process.\n  In the second part, we shift focus to monitoring entire environments,\ndistinct from object-specific monitoring. Here, the goal is to maximize\ncoverage to understand spatio-temporal changes. We investigate slow-changing\nenvironments like vegetative growth estimation and fast-changing environments\nsuch as wildfire management. For wildfires, we employ informative path planning\nto validate and localize fires early, utilizing LSTM networks for enhanced\nearly detection.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}