{"id":"2407.12188","title":"CroMo-Mixup: Augmenting Cross-Model Representations for Continual\n  Self-Supervised Learning","authors":"Erum Mushtaq, Duygu Nur Yaldiz, Yavuz Faruk Bakman, Jie Ding, Chenyang\n  Tao, Dimitrios Dimitriadis, Salman Avestimehr","authorsParsed":[["Mushtaq","Erum",""],["Yaldiz","Duygu Nur",""],["Bakman","Yavuz Faruk",""],["Ding","Jie",""],["Tao","Chenyang",""],["Dimitriadis","Dimitrios",""],["Avestimehr","Salman",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 21:34:26 GMT"}],"updateDate":"2024-07-18","timestamp":1721165666000,"abstract":"  Continual self-supervised learning (CSSL) learns a series of tasks\nsequentially on the unlabeled data. Two main challenges of continual learning\nare catastrophic forgetting and task confusion. While CSSL problem has been\nstudied to address the catastrophic forgetting challenge, little work has been\ndone to address the task confusion aspect. In this work, we show through\nextensive experiments that self-supervised learning (SSL) can make CSSL more\nsusceptible to the task confusion problem, particularly in less diverse\nsettings of class incremental learning because different classes belonging to\ndifferent tasks are not trained concurrently. Motivated by this challenge, we\npresent a novel cross-model feature Mixup (CroMo-Mixup) framework that\naddresses this issue through two key components: 1) Cross-Task data Mixup,\nwhich mixes samples across tasks to enhance negative sample diversity; and 2)\nCross-Model feature Mixup, which learns similarities between embeddings\nobtained from current and old models of the mixed sample and the original\nimages, facilitating cross-task class contrast learning and old knowledge\nretrieval. We evaluate the effectiveness of CroMo-Mixup to improve both Task-ID\nprediction and average linear accuracy across all tasks on three datasets,\nCIFAR10, CIFAR100, and tinyImageNet under different class-incremental learning\nsettings. We validate the compatibility of CroMo-Mixup on four state-of-the-art\nSSL objectives. Code is available at\n\\url{https://github.com/ErumMushtaq/CroMo-Mixup}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}