{"id":"2407.17495","title":"The Human-GenAI Value Loop in Human-Centered Innovation: Beyond the\n  Magical Narrative","authors":"Camille Grange (1), Theophile Demazure (1), Mickael Ringeval (1),\n  Simon Bourdeau (2), Cedric Martineau (3) ((1) HEC Montreal, (2) UQAM, (3)\n  Carverinno)","authorsParsed":[["Grange","Camille",""],["Demazure","Theophile",""],["Ringeval","Mickael",""],["Bourdeau","Simon",""],["Martineau","Cedric",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 21:00:02 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 20:21:30 GMT"}],"updateDate":"2024-08-14","timestamp":1720126802000,"abstract":"  Organizations across various industries are still exploring the potential of\nGenerative Artificial Intelligence (GenAI) to enhance knowledge work. While\ninnovation is often viewed as a product of individual creativity, it more\ncommonly unfolds through a highly structured, collaborative process where\ncreativity intertwines with knowledge work. However, the extent and\neffectiveness of GenAI in supporting this process remain open questions. Our\nstudy investigates this issue using a collaborative practice research approach\nfocused on three GenAI-enabled innovation projects conducted over a year within\nthree different organizations. We explored how, why, and when GenAI could be\nintegrated into design sprints, a highly structured, collaborative, and\nhuman-centered innovation method. Our research identified challenges and\nopportunities in synchronizing AI capabilities with human intelligence and\ncreativity. To translate these insights into practical strategies, we propose\nfour recommendations for organizations eager to leverage GenAI to both\nstreamline and bring more value to their innovation processes: (1) establish a\ncollaborative intelligence value loop with GenAI; (2) build trust in GenAI, (3)\ndevelop robust data collection and curation workflows, and (4) cultivate a\ncraftsmanship mindset.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}