{"id":"2407.15424","title":"Bidirectional skip-frame prediction for video anomaly detection with\n  intra-domain disparity-driven attention","authors":"Jiahao Lyu, Minghua Zhao, Jing Hu, Runtao Xi, Xuewen Huang, Shuangli\n  Du, Cheng Shi, Tian Ma","authorsParsed":[["Lyu","Jiahao",""],["Zhao","Minghua",""],["Hu","Jing",""],["Xi","Runtao",""],["Huang","Xuewen",""],["Du","Shuangli",""],["Shi","Cheng",""],["Ma","Tian",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 07:01:50 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 04:45:58 GMT"}],"updateDate":"2024-07-24","timestamp":1721631710000,"abstract":"  With the widespread deployment of video surveillance devices and the demand\nfor intelligent system development, video anomaly detection (VAD) has become an\nimportant part of constructing intelligent surveillance systems. Expanding the\ndiscriminative boundary between normal and abnormal events to enhance\nperformance is the common goal and challenge of VAD. To address this problem,\nwe propose a Bidirectional Skip-frame Prediction (BiSP) network based on a\ndual-stream autoencoder, from the perspective of learning the intra-domain\ndisparity between different features. The BiSP skips frames in the training\nphase to achieve the forward and backward frame prediction respectively, and in\nthe testing phase, it utilizes bidirectional consecutive frames to co-predict\nthe same intermediate frames, thus expanding the degree of disparity between\nnormal and abnormal events. The BiSP designs the variance channel attention and\ncontext spatial attention from the perspectives of movement patterns and object\nscales, respectively, thus ensuring the maximization of the disparity between\nnormal and abnormal in the feature extraction and delivery with different\ndimensions. Extensive experiments from four benchmark datasets demonstrate the\neffectiveness of the proposed BiSP, which substantially outperforms\nstate-of-the-art competing methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}