{"id":"2407.11559","title":"Interlayer charge transfer in graphene 2D polyimide heterostructures","authors":"Francesca Falorsi, Shuangjie Zhao, Kejun Liu, Christian Eckel, Jonas\n  F. P\\\"ohls, Wiebke Bennecke, Marcel Reutzel, Stefan Mathias, Kenji Watanabe,\n  Takashi Taniguchi, Zhiyong Wang, Miroslav Polozij, Xinliang Feng, Thomas\n  Heine, R. Thomas Weitz","authorsParsed":[["Falorsi","Francesca",""],["Zhao","Shuangjie",""],["Liu","Kejun",""],["Eckel","Christian",""],["Pöhls","Jonas F.",""],["Bennecke","Wiebke",""],["Reutzel","Marcel",""],["Mathias","Stefan",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Wang","Zhiyong",""],["Polozij","Miroslav",""],["Feng","Xinliang",""],["Heine","Thomas",""],["Weitz","R. Thomas",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 10:07:35 GMT"}],"updateDate":"2024-07-17","timestamp":1721124455000,"abstract":"  The vertical integration of multiple two-dimensional (2D) materials in\nheterostructures, held together by van der Waals forces, has opened\nunprecedented possibilities for modifying the (opto-)electronic properties of\nnanodevices. Graphene, with its remarkable opto-electronic properties, is an\nideal candidate for such applications. Further candidates are 2D polymers,\ncrystalline polymeric materials with customizable structure and electronic\nproperties that can be synthesized in all mathematically possible Bravais\nlattices. In this study, we investigated the optoelectronic properties of a\nheterostructure created by pristine graphene and a rectangular 2D polyimide\n(2DPI) film. This imprints a new superlattice on graphene in conjunction with a\ndirect influence on its electronic properties. Theoretical and experimental\nanalyses reveal that interlayer charge exchange between the 2D polymer and\ngraphene induces hole doping in the graphene layer. We have also observed that\nthe properties of the heterostructure are dependent on the substrate used in\nexperiments, likely due to the porous character of the 2DPI allowing direct\ninteraction of graphene with the support. These findings highlight the unique\nability to tailor functionalities in 2D polymers-based heterostructures,\nallowing the development of optoelectronic devices with precisely engineered\nproperties and stimulating further exploration of the diverse phenomena\naccessible through tailored designs of the 2D polymers.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}