{"id":"2407.14379","title":"Deep learning density functional theory Hamiltonian in real space","authors":"Zilong Yuan, Zechen Tang, Honggeng Tao, Xiaoxun Gong, Zezhou Chen,\n  Yuxiang Wang, He Li, Yang Li, Zhiming Xu, Minghui Sun, Boheng Zhao, Chong\n  Wang, Wenhui Duan, Yong Xu","authorsParsed":[["Yuan","Zilong",""],["Tang","Zechen",""],["Tao","Honggeng",""],["Gong","Xiaoxun",""],["Chen","Zezhou",""],["Wang","Yuxiang",""],["Li","He",""],["Li","Yang",""],["Xu","Zhiming",""],["Sun","Minghui",""],["Zhao","Boheng",""],["Wang","Chong",""],["Duan","Wenhui",""],["Xu","Yong",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:07:22 GMT"}],"updateDate":"2024-07-22","timestamp":1721401642000,"abstract":"  Deep learning electronic structures from ab initio calculations holds great\npotential to revolutionize computational materials studies. While existing\nmethods proved success in deep-learning density functional theory (DFT)\nHamiltonian matrices, they are limited to DFT programs using localized\natomic-like bases and heavily depend on the form of the bases. Here, we propose\nthe DeepH-r method for deep-learning DFT Hamiltonians in real space,\nfacilitating the prediction of DFT Hamiltonian in a basis-independent manner.\nAn equivariant neural network architecture for modeling the real-space DFT\npotential is developed, targeting a more fundamental quantity in DFT. The\nreal-space potential exhibits simplified principles of equivariance and\nenhanced nearsightedness, further boosting the performance of deep learning.\nWhen applied to evaluate the Hamiltonian matrix, this method significantly\nimproved in accuracy, as exemplified in multiple case studies. Given the\nabundance of data in the real-space potential, this work may pave a novel\npathway for establishing a ``large materials model\" with increased accuracy.\n","subjects":["Physics/Computational Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}