{"id":"2407.17116","title":"Discovery of a Damped Ly$\\alpha$ Absorber in the Circumnuclear Zone of\n  the FeLoBAL Quasar SDSS J083942.11+380526.3","authors":"Shengmiao Wu, Xiheng Shi, Nibedita Kalita, Xiang Pan, Qiguo Tian, Tuo\n  Ji, Shaohua Zhang, Xuejie Dai, Peng Jiang, Chenwei Yang and Hongyan Zhou","authorsParsed":[["Wu","Shengmiao",""],["Shi","Xiheng",""],["Kalita","Nibedita",""],["Pan","Xiang",""],["Tian","Qiguo",""],["Ji","Tuo",""],["Zhang","Shaohua",""],["Dai","Xuejie",""],["Jiang","Peng",""],["Yang","Chenwei",""],["Zhou","Hongyan",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 09:25:28 GMT"}],"updateDate":"2024-07-25","timestamp":1721813128000,"abstract":"  SDSS J083942.11+380526.3 ($z=2.315$) is a FeLoBAL quasar that exhibits\nvisible Balmer absorption lines (H$\\alpha$), implying a significant $n=2$\npopulation. The quasar also shows an array of absorption lines, including \\oi,\n\\niii, \\feii, \\mgii, \\aliii\\, to \\civ\\ and \\nv. The high-ionization absorption\nlines such as \\civ\\ and \\siiv\\ are revealed by slightly blueshifted BAL\ntroughs. The resonance doublets such as \\mgii\\ and \\aliii\\ are saturated but\ndid not reached zero intensity which indicates that the BLR is partially\ncovered. Overall, however, the absorption is predominantly from low-ionization\n\\feii\\ lines, emitted from ground and excited states up to at least 3.814 eV.\nThis implies that the absorbing gas spans the hydrogen ionization front and\nextends into the partially ionized zone where neutral hydrogen is certainly\npresent. Notably, the hydrogen line spectrum of the quasar shows no signature\nof expected Ly$\\alpha$ absorption. Instead, the line spectrum shows an unusual\nLy$\\alpha$ emission characterized by a fully filled emission line spectrum\nwhich is a composite of a strong narrow core superposed on a weak broad base.\nTaking into account the effect of partial covering to BLR, we have extracted a\nstrong DLA trough in Ly$\\alpha$ emission region. To fit the spectrum, we\nperformed photoionized model calculations and compared them to the\nobservations. We found that photoionization modeling using CLOUDY can\nsuccessfully reproduce the main characteristics of the quasar spectrum, and the\npredicted neutral hydrogen column density arising from the clouds responsible\nfor the low-ionization absorption provides a good match to the extracted DLA\ntrough. This indicates that both the DLA and the low-ionization absorption\narise from the same medium that is roughly collocated with the dusty torus.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}