{"id":"2407.14470","title":"Low [O/Fe] Ratio in a Luminous Galaxy at the Early Cosmic Epoch\n  ($z>10$): Signature of Short Delay Time or Bright Hypernovae/Pair-Instability\n  Supernovae?","authors":"Minami Nakane, Masami Ouchi, Kimihiko Nakajima, Yuichi Harikane,\n  Nozomu Tominaga, Koh Takahashi, Hiroto Yanagisawa, Kuria Watanabe, Ken'ichi\n  Nomoto, Yuki Isobe, Daichi Kashino, Moka Nishigaki, Miho N. Ishigaki,\n  Yoshiaki Ono, and Yui Takeda","authorsParsed":[["Nakane","Minami",""],["Ouchi","Masami",""],["Nakajima","Kimihiko",""],["Harikane","Yuichi",""],["Tominaga","Nozomu",""],["Takahashi","Koh",""],["Yanagisawa","Hiroto",""],["Watanabe","Kuria",""],["Nomoto","Ken'ichi",""],["Isobe","Yuki",""],["Kashino","Daichi",""],["Nishigaki","Moka",""],["Ishigaki","Miho N.",""],["Ono","Yoshiaki",""],["Takeda","Yui",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 17:16:46 GMT"}],"updateDate":"2024-07-22","timestamp":1721409406000,"abstract":"  We present an [O/Fe] ratio of a luminous galaxy GN-z11 at $z=10.60$ derived\nwith the deep public JWST/NIRSpec data. We fit the medium-resolution grating\ndata with the model spectra consisting of BPASS-stellar and CLOUDY-nebular\nspectra in the rest-frame UV wavelength ranges with Fe absorption lines,\ncarefully masking out the other emission and absorption lines in the same\nmanner as previous studies conducted for lower redshift ($z\\sim 2-6$) galaxies\nwith oxygen abundance measurements. We obtain an Fe-rich abundance ratio\n$\\mathrm{[O/Fe]}=-0.39^{+0.59}_{-0.36}$ that is confirmed with the independent\ndeep prism data as well as by the classic 1978 index method. This [O/Fe]\nmeasurement is lower than that at $z\\sim 2-3$ and comparable with those at\n$z\\sim 6$. Because $z=10.60$ is an early epoch after the Big Bang ($\\sim 430$\nMyr) and the first star formation (likely $\\sim 200$ Myr), there is a\ndifficulty in efficiently producing Fe by Type Ia supernovae (SNeIa) requiring\nsufficient delay time for white-dwarf formation and gas accretion. The Fe-rich\nabundance ratio in GN-z11 suggests that the delay time is short, or that the\nmajor Fe enrichment is not accomplished by SNeIa but bright hypernovae (BrHNe)\nand/or pair-instability supernovae (PISNe), where the yield models of BrHNe and\nPISNe explain Fe, Ne, and O abundance ratios of GN-z11. The [O/Fe] measurement\nis not too low to rule out the connection between GN-z11 and globular clusters\n(GCs) previously suggested by the nitrogen abundance, but rather confirms the\nconnection with a GC population at high [N/O] if a metal dilution process\nexists.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-ZvStypLRIGhvGmF-i-5TywRzJicIvCGlZJQh-tYEig","pdfSize":"1590276","objectId":"0xc33f9f80df81b7bf2f618b49a312295ccaa00f8596ff3fca765d0f971c5dacec","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
