{"id":"2407.14934","title":"Constraints on interacting dark energy models from the DESI BAO and DES\n  supernovae data","authors":"Tian-Nuo Li, Peng-Ju Wu, Guo-Hong Du, Shang-Jie Jin, Hai-Li Li,\n  Jing-Fei Zhang, Xin Zhang","authorsParsed":[["Li","Tian-Nuo",""],["Wu","Peng-Ju",""],["Du","Guo-Hong",""],["Jin","Shang-Jie",""],["Li","Hai-Li",""],["Zhang","Jing-Fei",""],["Zhang","Xin",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 16:52:17 GMT"}],"updateDate":"2024-07-23","timestamp":1721494337000,"abstract":"  The recent results from the first year baryon acoustic oscillations (BAO)\ndata released by the Dark Energy Spectroscopic Instrument (DESI), combined with\ncosmic microwave background (CMB) and type Ia supernova (SN) data, have shown a\ndetection of significant deviation from a cosmological constant for dark\nenergy. In this work, we utilize the latest DESI BAO data in combination with\nthe SN data from the full five-year observations of the Dark Energy Survey and\nthe CMB data from the Planck satellite to explore potential interactions\nbetween dark energy and dark matter. We consider four typical forms of the\ninteraction term $Q$. Our findings suggest that interacting dark energy (IDE)\nmodels with $Q \\propto \\rho_{\\rm de}$ support the presence of an interaction\nwhere dark energy decays into dark matter. Specifically, the deviation from\n$\\Lambda$CDM for the IDE model with $Q=\\beta H_0\\rho_{\\rm de}$ reaches the\n$3\\sigma$ level. These models yield a lower value of Akaike information\ncriterion than the $\\Lambda$CDM model, indicating a preference for these IDE\nmodels based on the current observational data. For IDE models with\n$Q\\propto\\rho_{\\rm c}$, the existence of interaction depends on the form of the\nproportionality coefficient $\\Gamma$. The IDE model with $Q=\\beta H\\rho_{\\rm\nc}$ yields $\\beta=0.0003\\pm 0.0011$, which essentially does not support the\npresence of the interaction. In general, whether the observational data support\nthe existence of interaction is closely related to the model. Our analysis\nhelps to elucidate which type of IDE model can better explain the current\nobservational data.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}