{"id":"2407.04882","title":"Improving ensemble extreme precipitation forecasts using generative\n  artificial intelligence","authors":"Yingkai Sha, Ryan A. Sobash, David John Gagne II","authorsParsed":[["Sha","Yingkai",""],["Sobash","Ryan A.",""],["Gagne","David John","II"]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 22:30:33 GMT"}],"updateDate":"2024-07-09","timestamp":1720218633000,"abstract":"  An ensemble post-processing method is developed to improve the probabilistic\nforecasts of extreme precipitation events across the conterminous United States\n(CONUS). The method combines a 3-D Vision Transformer (ViT) for bias correction\nwith a Latent Diffusion Model (LDM), a generative Artificial Intelligence (AI)\nmethod, to post-process 6-hourly precipitation ensemble forecasts and produce\nan enlarged generative ensemble that contains spatiotemporally consistent\nprecipitation trajectories. These trajectories are expected to improve the\ncharacterization of extreme precipitation events and offer skillful multi-day\naccumulated and 6-hourly precipitation guidance. The method is tested using the\nGlobal Ensemble Forecast System (GEFS) precipitation forecasts out to day 6 and\nis verified against the Climate-Calibrated Precipitation Analysis (CCPA) data.\nVerification results indicate that the method generated skillful ensemble\nmembers with improved Continuous Ranked Probabilistic Skill Scores (CRPSSs) and\nBrier Skill Scores (BSSs) over the raw operational GEFS and a multivariate\nstatistical post-processing baseline. It showed skillful and reliable\nprobabilities for events at extreme precipitation thresholds. Explainability\nstudies were further conducted, which revealed the decision-making process of\nthe method and confirmed its effectiveness on ensemble member generation. This\nwork introduces a novel, generative-AI-based approach to address the limitation\nof small numerical ensembles and the need for larger ensembles to identify\nextreme precipitation events.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}