{"id":"2407.10245","title":"GenSco: Can Question Decomposition based Passage Alignment improve\n  Question Answering?","authors":"Barah Fazili, Koustava Goswami, Natwar Modani, Inderjeet Nair","authorsParsed":[["Fazili","Barah",""],["Goswami","Koustava",""],["Modani","Natwar",""],["Nair","Inderjeet",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 15:25:08 GMT"}],"updateDate":"2024-07-16","timestamp":1720970708000,"abstract":"  Retrieval augmented generation (RAG) with large language models (LLMs) for\nQuestion Answering (QA) entails furnishing relevant context within the prompt\nto facilitate the LLM in answer generation. During the generation, inaccuracies\nor hallucinations frequently occur due to two primary factors: inadequate or\ndistracting context in the prompts, and the inability of LLMs to effectively\nreason through the facts. In this paper, we investigate whether providing\naligned context via a carefully selected passage sequence leads to better\nanswer generation by the LLM for multi-hop QA. We introduce, \"GenSco\", a novel\napproach of selecting passages based on the predicted decomposition of the\nmulti-hop questions}. The framework consists of two distinct LLMs: (i)\nGenerator LLM, which is used for question decomposition and final answer\ngeneration; (ii) an auxiliary open-sourced LLM, used as the scorer, to\nsemantically guide the Generator for passage selection. The generator is\ninvoked only once for the answer generation, resulting in a cost-effective and\nefficient approach. We evaluate on three broadly established multi-hop question\nanswering datasets: 2WikiMultiHop, Adversarial HotPotQA and MuSiQue and achieve\nan absolute gain of $15.1$ and $5.9$ points in Exact Match score with respect\nto the best performing baselines over MuSiQue and 2WikiMultiHop respectively.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PDM4nFXkndXFzgy71e44zvb0Pe4UNf6uEIi6FWwIv58","pdfSize":"887252"}
