{"id":"2407.03290","title":"Thermal and mechanical properties and the structural phase transition\n  under pressure in $A$In$_2$As$_2$ ($A$ = Ca, Sr, Ba)","authors":"Wen-Ti Guo, Zhigao Huang, and Jian-Min Zhang","authorsParsed":[["Guo","Wen-Ti",""],["Huang","Zhigao",""],["Zhang","Jian-Min",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 17:23:09 GMT"}],"updateDate":"2024-07-04","timestamp":1720027389000,"abstract":"  Experimental results that BaIn2As2 and Ca(Sr)In2As2, which are the same class\nof alkali metal compounds, belong to different structural phases have puzzled\nthe current materials physics community. Here, we investigate the\npressure-induced structural phase transition of AIn2As2 and its accompanying\nimprovement in mechanical and thermal properties. Firstly, the structural\nstability of the materials and their structural phase transitions under\npressure are characterized by enthalpy and double checking by phonon dispersion\nspectrum. We also confirm the structural phase transitions of the hexagonal and\nmonoclinic phases from a group-theoretic point of view, associating their\nsymmetry operations using transformation matrices. In terms of mechanical\nproperties, we propose an effective scheme for pressure modulation of the\nanisotropy of AIn2As2 materials and to induce the transformation of AIn2As2\nfrom isotropic to anisotropic (hexagonal) and from brittle to ductile\n(hexagonal and monoclinic). Meanwhile, we find the negative Poisson's ratio\nphenomenon under compression and tension, which is favorable for a wide range\nof applications of this series of materials in aerospace, medicine, sensors,\netc. In terms of thermal properties, applying pressure will enhance the\nstructural phase transition temperature of AIn2As2 materials to near room\ntemperature. We further give direct evidence of phonon softening based on group\nvelocity calculations and reveal that phonon softening prevents the heat\ncapacity from reaching the Dulong-Petit limit. Our study provides a theoretical\nbasis for selecting stable structural phases and pioneering thermodynamic\nproperty studies of the thermoelectric topological candidate material AIn2As2.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}