{"id":"2407.00178","title":"Shower Separation in Five Dimensions for Highly Granular Calorimeters\n  using Machine Learning","authors":"S. Lai, J. Utehs, A. Wilhahn, M.C. Fouz, O. Bach, E. Brianne, A.\n  Ebrahimi, K. Gadow, P. G\\\"ottlicher, O. Hartbrich, D. Heuchel, A. Irles, K.\n  Kr\\\"uger, J. Kvasnicka, S. Lu, C. Neub\\\"user, A. Provenza, M. Reinecke, F.\n  Sefkow, S. Schuwalow, M. De Silva, Y. Sudo, H.L. Tran, L. Liu, R. Masuda, T.\n  Murata, W. Ootani, T. Seino, T. Takatsu, N. Tsuji, R. P\\\"oschl, F. Richard,\n  D. Zerwas, F. Hummer, F. Simon, V. Boudry, J-C. Brient, J. Nanni, H. Videau,\n  E. Buhmann, E. Garutti, S. Huck, G. Kasieczka, S. Martens, J. Rolph, J.\n  Wellhausen, B. Bilki, D. Northacker, Y. Onel, L. Emberger, C. Graf","authorsParsed":[["Lai","S.",""],["Utehs","J.",""],["Wilhahn","A.",""],["Fouz","M. C.",""],["Bach","O.",""],["Brianne","E.",""],["Ebrahimi","A.",""],["Gadow","K.",""],["Göttlicher","P.",""],["Hartbrich","O.",""],["Heuchel","D.",""],["Irles","A.",""],["Krüger","K.",""],["Kvasnicka","J.",""],["Lu","S.",""],["Neubüser","C.",""],["Provenza","A.",""],["Reinecke","M.",""],["Sefkow","F.",""],["Schuwalow","S.",""],["De Silva","M.",""],["Sudo","Y.",""],["Tran","H. L.",""],["Liu","L.",""],["Masuda","R.",""],["Murata","T.",""],["Ootani","W.",""],["Seino","T.",""],["Takatsu","T.",""],["Tsuji","N.",""],["Pöschl","R.",""],["Richard","F.",""],["Zerwas","D.",""],["Hummer","F.",""],["Simon","F.",""],["Boudry","V.",""],["Brient","J-C.",""],["Nanni","J.",""],["Videau","H.",""],["Buhmann","E.",""],["Garutti","E.",""],["Huck","S.",""],["Kasieczka","G.",""],["Martens","S.",""],["Rolph","J.",""],["Wellhausen","J.",""],["Bilki","B.",""],["Northacker","D.",""],["Onel","Y.",""],["Emberger","L.",""],["Graf","C.",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 18:34:45 GMT"}],"updateDate":"2024-07-02","timestamp":1719599685000,"abstract":"  To achieve state-of-the-art jet energy resolution for Particle Flow,\nsophisticated energy clustering algorithms must be developed that can fully\nexploit available information to separate energy deposits from charged and\nneutral particles. Three published neural network-based shower separation\nmodels were applied to simulation and experimental data to measure the\nperformance of the highly granular CALICE Analogue Hadronic Calorimeter (AHCAL)\ntechnological prototype in distinguishing the energy deposited by a single\ncharged and single neutral hadron for Particle Flow. The performance of models\ntrained using only standard spatial and energy and charged track position\ninformation from an event was compared to models trained using timing\ninformation available from AHCAL, which is expected to improve sensitivity to\nshower development and, therefore, aid in clustering. Both simulation and\nexperimental data were used to train and test the models and their performances\nwere compared. The best-performing neural network achieved significantly\nsuperior event reconstruction when timing information was utilised in training\nfor the case where the charged hadron had more energy than the neutral one,\nmotivating temporally sensitive calorimeters. All models under test were\nobserved to tend to allocate energy deposited by the more energetic of the two\nshowers to the less energetic one. Similar shower reconstruction performance\nwas observed for a model trained on simulation and applied to data and a model\ntrained and applied to data.\n","subjects":["Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"J7S8CqqvSsS8osKmaMxkOoMvlKlUXr1wV3YOwQnFAs4","pdfSize":"11238187","objectId":"0xe6a7baa56bc30e12c4b17977d4f00d920571eb77969213c3e34bbe3f18e1092d","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
