{"id":"2407.02047","title":"CountFormer: Multi-View Crowd Counting Transformer","authors":"Hong Mo, Xiong Zhang, Jianchao Tan, Cheng Yang, Qiong Gu, Bo Hang,\n  Wenqi Ren","authorsParsed":[["Mo","Hong",""],["Zhang","Xiong",""],["Tan","Jianchao",""],["Yang","Cheng",""],["Gu","Qiong",""],["Hang","Bo",""],["Ren","Wenqi",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 08:19:48 GMT"}],"updateDate":"2024-07-03","timestamp":1719908388000,"abstract":"  Multi-view counting (MVC) methods have shown their superiority over\nsingle-view counterparts, particularly in situations characterized by heavy\nocclusion and severe perspective distortions. However, hand-crafted heuristic\nfeatures and identical camera layout requirements in conventional MVC methods\nlimit their applicability and scalability in real-world scenarios.In this work,\nwe propose a concise 3D MVC framework called \\textbf{CountFormer}to elevate\nmulti-view image-level features to a scene-level volume representation and\nestimate the 3D density map based on the volume features. By incorporating a\ncamera encoding strategy, CountFormer successfully embeds camera parameters\ninto the volume query and image-level features, enabling it to handle various\ncamera layouts with significant differences.Furthermore, we introduce a feature\nlifting module capitalized on the attention mechanism to transform image-level\nfeatures into a 3D volume representation for each camera view. Subsequently,\nthe multi-view volume aggregation module attentively aggregates various\nmulti-view volumes to create a comprehensive scene-level volume representation,\nallowing CountFormer to handle images captured by arbitrary dynamic camera\nlayouts. The proposed method performs favorably against the state-of-the-art\napproaches across various widely used datasets, demonstrating its greater\nsuitability for real-world deployment compared to conventional MVC frameworks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"szytRGC5GI2ymw1xB3vEsH2WmIEVcxDNGn4yu6m_LgE","pdfSize":"5417862","objectId":"0x1325597476033b3df26eeaedda04bbddec956c928e5a7e4853729541b17b2d32","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
