{"id":"2407.10722","title":"Mitigating Data Imbalance for Software Vulnerability Assessment: Does\n  Data Augmentation Help?","authors":"Triet H. M. Le, M. Ali Babar","authorsParsed":[["Le","Triet H. M.",""],["Babar","M. Ali",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 13:47:55 GMT"}],"updateDate":"2024-07-16","timestamp":1721051275000,"abstract":"  Background: Software Vulnerability (SV) assessment is increasingly adopted to\naddress the ever-increasing volume and complexity of SVs. Data-driven\napproaches have been widely used to automate SV assessment tasks, particularly\nthe prediction of the Common Vulnerability Scoring System (CVSS) metrics such\nas exploitability, impact, and severity. SV assessment suffers from the\nimbalanced distributions of the CVSS classes, but such data imbalance has been\nhardly understood and addressed in the literature. Aims: We conduct a\nlarge-scale study to quantify the impacts of data imbalance and mitigate the\nissue for SV assessment through the use of data augmentation. Method: We\nleverage nine data augmentation techniques to balance the class distributions\nof the CVSS metrics. We then compare the performance of SV assessment models\nwith and without leveraging the augmented data. Results: Through extensive\nexperiments on 180k+ real-world SVs, we show that mitigating data imbalance can\nsignificantly improve the predictive performance of models for all the CVSS\ntasks, by up to 31.8% in Matthews Correlation Coefficient. We also discover\nthat simple text augmentation like combining random text insertion, deletion,\nand replacement can outperform the baseline across the board. Conclusions: Our\nstudy provides the motivation and the first promising step toward tackling data\nimbalance for effective SV assessment.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}