{"id":"2407.10635","title":"NPA Hierarchy for Quantum Isomorphism and Homomorphism\n  Indistinguishability","authors":"Prem Nigam Kar and David E. Roberson and Tim Seppelt and Peter Zeman","authorsParsed":[["Kar","Prem Nigam",""],["Roberson","David E.",""],["Seppelt","Tim",""],["Zeman","Peter",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 11:48:09 GMT"}],"updateDate":"2024-07-16","timestamp":1721044089000,"abstract":"  Man\\v{c}inska and Roberson~[FOCS'20] showed that two graphs are quantum\nisomorphic if and only if they are homomorphism indistinguishable over the\nclass of planar graphs. Atserias et al.~[JCTB'19] proved that quantum\nisomorphism is undecidable in general. The NPA hierarchy gives a sequence of\nsemidefinite programming relaxations of quantum isomorphism. Recently, Roberson\nand Seppelt~[ICALP'23] obtained a homomorphism indistinguishability\ncharacterization of the feasibility of each level of the Lasserre hierarchy of\nsemidefinite programming relaxations of graph isomorphism. We prove a quantum\nanalogue of this result by showing that each level of the NPA hierarchy of SDP\nrelaxations for quantum isomorphism of graphs is equivalent to homomorphism\nindistinguishability over an appropriate class of planar graphs. By combining\nthe convergence of the NPA hierarchy with the fact that the union of these\ngraph classes is the set of all planar graphs, we are able to give a new proof\nof the result of Man\\v{c}inska and Roberson~[FOCS'20] that avoids the use of\nthe theory of quantum groups. This homomorphism indistinguishability\ncharacterization also allows us to give a randomized polynomial-time algorithm\ndeciding exact feasibility of each fixed level of the NPA hierarchy of SDP\nrelaxations for quantum isomorphism.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Discrete Mathematics","Computing Research Repository/Data Structures and Algorithms","Mathematics/Combinatorics","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}