{"id":"2407.08710","title":"End-to-End Orchestration of NextG Media Services over the Distributed\n  Compute Continuum","authors":"Alessandro Mauro, Antonia Maria Tulino, Jaime Llorca","authorsParsed":[["Mauro","Alessandro",""],["Tulino","Antonia Maria",""],["Llorca","Jaime",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:47:31 GMT"}],"updateDate":"2024-07-12","timestamp":1720720051000,"abstract":"  NextG (5G and beyond) networks, through the increasing integration of\ncloud/edge computing technologies, are becoming highly distributed compute\nplatforms ideally suited to host emerging resource-intensive and\nlatency-sensitive applications (e.g., industrial automation, extended reality,\ndistributed AI). The end-to-end orchestration of such demanding applications,\nwhich involves function/data placement, flow routing, and joint\ncommunication/computation/storage resource allocation, requires new models and\nalgorithms able to capture: (i) their disaggregated microservice-based\narchitecture, (ii) their complex processing graph structures, including\nmultiple-input multiple-output processing stages, and (iii) the opportunities\nfor efficiently sharing and replicating data streams that may be useful for\nmultiple functions and/or end users. To this end, we first identify the\ntechnical gaps in existing literature that prevent efficiently addressing the\noptimal orchestration of emerging applications described by information-aware\ndirected acyclic graphs (DAGs). We then leverage the recently proposed Cloud\nNetwork Flow optimization framework and a novel functionally-equivalent\nDAG-to-Forest graph transformation procedure to design IDAGO (Information-Aware\nDAG Orchestration), a polynomial-time multi-criteria approximation algorithm\nfor the optimal orchestration of NextG media services over NextG\ncompute-integrated networks.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"oIFS6z6EdVCzT0lE6wpZIpaaQ1xmmXE1x8FaqpKpkk0","pdfSize":"2043107","objectId":"0x3c5899ced8b9b20b71512f300982949ffc86a6699b14ebf15ceb2cc5f02178bd","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
