{"id":"2407.01406","title":"Adapting Multilingual LLMs to Low-Resource Languages with Knowledge\n  Graphs via Adapters","authors":"Daniil Gurgurov, Mareike Hartmann, Simon Ostermann","authorsParsed":[["Gurgurov","Daniil",""],["Hartmann","Mareike",""],["Ostermann","Simon",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:56:24 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 15:51:12 GMT"}],"updateDate":"2024-07-24","timestamp":1719849384000,"abstract":"  This paper explores the integration of graph knowledge from linguistic\nontologies into multilingual Large Language Models (LLMs) using adapters to\nimprove performance for low-resource languages (LRLs) in sentiment analysis\n(SA) and named entity recognition (NER). Building upon successful\nparameter-efficient fine-tuning techniques, such as K-ADAPTER and MAD-X, we\npropose a similar approach for incorporating knowledge from multilingual\ngraphs, connecting concepts in various languages with each other through\nlinguistic relationships, into multilingual LLMs for LRLs. Specifically, we\nfocus on eight LRLs -- Maltese, Bulgarian, Indonesian, Nepali, Javanese,\nUyghur, Tibetan, and Sinhala -- and employ language-specific adapters\nfine-tuned on data extracted from the language-specific section of ConceptNet,\naiming to enable knowledge transfer across the languages covered by the\nknowledge graph. We compare various fine-tuning objectives, including standard\nMasked Language Modeling (MLM), MLM with full-word masking, and MLM with\ntargeted masking, to analyse their effectiveness in learning and integrating\nthe extracted graph data. Through empirical evaluation on language-specific\ntasks, we assess how structured graph knowledge affects the performance of\nmultilingual LLMs for LRLs in SA and NER, providing insights into the potential\nbenefits of adapting language models for low-resource scenarios.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6y6ut7T0jH-dJiSmLuy__LQcHv33-yq7EvZg4734CDI","pdfSize":"416117","objectId":"0x749bce329344ddbaeb1d15c161a149f3bbdca68b949c8e352669e5e81245da4a","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
