{"id":"2407.17630","title":"Revising the Problem of Partial Labels from the Perspective of CNNs'\n  Robustness","authors":"Xin Zhang and Yuqi Song and Wyatt McCurdy and Xiaofeng Wang and Fei\n  Zuo","authorsParsed":[["Zhang","Xin",""],["Song","Yuqi",""],["McCurdy","Wyatt",""],["Wang","Xiaofeng",""],["Zuo","Fei",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 20:39:17 GMT"}],"updateDate":"2024-07-26","timestamp":1721853557000,"abstract":"  Convolutional neural networks (CNNs) have gained increasing popularity and\nversatility in recent decades, finding applications in diverse domains. These\nremarkable achievements are greatly attributed to the support of extensive\ndatasets with precise labels. However, annotating image datasets is intricate\nand complex, particularly in the case of multi-label datasets. Hence, the\nconcept of partial-label setting has been proposed to reduce annotation costs,\nand numerous corresponding solutions have been introduced. The evaluation\nmethods for these existing solutions have been primarily based on accuracy.\nThat is, their performance is assessed by their predictive accuracy on the test\nset. However, we insist that such an evaluation is insufficient and one-sided.\nOn one hand, since the quality of the test set has not been evaluated, the\nassessment results are unreliable. On the other hand, the partial-label problem\nmay also be raised by undergoing adversarial attacks. Therefore, incorporating\nrobustness into the evaluation system is crucial. For this purpose, we first\npropose two attack models to generate multiple partial-label datasets with\nvarying degrees of label missing rates. Subsequently, we introduce a\nlightweight partial-label solution using pseudo-labeling techniques and a\ndesigned loss function. Then, we employ D-Score to analyze both the proposed\nand existing methods to determine whether they can enhance robustness while\nimproving accuracy. Extensive experimental results demonstrate that while\ncertain methods may improve accuracy, the enhancement in robustness is not\nsignificant, and in some cases, it even diminishes.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8-jk6kWkLV5FciNJi8FGWa6weGZmUMaYp25I8apIdEI","pdfSize":"411721"}
