{"id":"2407.21372","title":"Two Completely Parameter-Free Alternating Gradient Projection Algorithms\n  for Nonconvex-(strongly) Concave Minimax Problems","authors":"Junnan Yang and Huiling Zhang and Zi Xu","authorsParsed":[["Yang","Junnan",""],["Zhang","Huiling",""],["Xu","Zi",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 06:54:24 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 14:01:43 GMT"}],"updateDate":"2024-08-16","timestamp":1722408864000,"abstract":"  Due to their importance in various emerging applications, efficient\nalgorithms for solving minimax problems have recently received increasing\nattention. However, many existing algorithms require prior knowledge of the\nproblem parameters in order to achieve optimal iteration complexity. In this\npaper, we propose two completely parameter-free alternating gradient projection\nalgorithms, i.e., the PF-AGP-NSC algorithm and the PF-AGP-NC algorithm, to\nsolve the smooth nonconvex-strongly concave and nonconvex-concave minimax\nproblems respectively using a backtracking strategy, which does not require\nprior knowledge of parameters such as the Lipschtiz constant $L$ or the\nstrongly concave constant $\\mu$. Moreover, we show that the total number of\ngradient calls of the PF-AGP-NSC algorithm and the PF-AGP-NC algorithm to\nobtain an $\\varepsilon$-stationary point is upper bounded by $\\mathcal{O}\\left(\nL\\kappa^3\\varepsilon^{-2} \\right)$ and $\\mathcal{O}\\left( L^4\\varepsilon^{-4}\n\\right)$ respectively, where $\\kappa$ is the condition number. As far as we\nknow, the PF-AGP-NSC algorithm and the PF-AGP-NC algorithm are the first\ncompletely parameter-free algorithms for solving nonconvex-strongly concave\nminimax problems and nonconvex-concave minimax problems respectively. Numerical\nresults validate the efficiency of the proposed PF-AGP algorithm.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}