{"id":"2407.06688","title":"Universal Multi-view Black-box Attack against Object Detectors via\n  Layout Optimization","authors":"Donghua Wang, Wen Yao, Tingsong Jiang, Chao Li, Xiaoqian Chen","authorsParsed":[["Wang","Donghua",""],["Yao","Wen",""],["Jiang","Tingsong",""],["Li","Chao",""],["Chen","Xiaoqian",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 09:02:19 GMT"}],"updateDate":"2024-07-10","timestamp":1720515739000,"abstract":"  Object detectors have demonstrated vulnerability to adversarial examples\ncrafted by small perturbations that can deceive the object detector. Existing\nadversarial attacks mainly focus on white-box attacks and are merely valid at a\nspecific viewpoint, while the universal multi-view black-box attack is less\nexplored, limiting their generalization in practice. In this paper, we propose\na novel universal multi-view black-box attack against object detectors, which\noptimizes a universal adversarial UV texture constructed by multiple image\nstickers for a 3D object via the designed layout optimization algorithm.\nSpecifically, we treat the placement of image stickers on the UV texture as a\ncircle-based layout optimization problem, whose objective is to find the\noptimal circle layout filled with image stickers so that it can deceive the\nobject detector under the multi-view scenario. To ensure reasonable placement\nof image stickers, two constraints are elaborately devised. To optimize the\nlayout, we adopt the random search algorithm enhanced by the devised\nimportant-aware selection strategy to find the most appropriate image sticker\nfor each circle from the image sticker pools. Extensive experiments conducted\non four common object detectors suggested that the detection performance\ndecreases by a large magnitude of 74.29% on average in multi-view scenarios.\nAdditionally, a novel evaluation tool based on the photo-realistic simulator is\ndesigned to assess the texture-based attack fairly.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}