{"id":"2407.15020","title":"Integrating Attentional Factors and Spacing in Logistic Knowledge\n  Tracing Models to Explore the Impact of Training Sequences on Category\n  Learning","authors":"Meng Cao, Philip I. Pavlik Jr., Wei Chu, Liang Zhang","authorsParsed":[["Cao","Meng",""],["Pavlik","Philip I.","Jr."],["Chu","Wei",""],["Zhang","Liang",""]],"versions":[{"version":"v1","created":"Sat, 22 Jun 2024 20:22:19 GMT"}],"updateDate":"2024-07-23","timestamp":1719087739000,"abstract":"  In category learning, a growing body of literature has increasingly focused\non exploring the impacts of interleaving in contrast to blocking. The\nsequential attention hypothesis posits that interleaving draws attention to the\ndifferences between categories while blocking directs attention toward\nsimilarities within categories. Although a recent study underscores the joint\ninfluence of memory and attentional factors on sequencing effects, there\nremains a scarcity of effective computational models integrating both\nattentional and memory considerations to comprehensively understand the effect\nof training sequences on students' performance. This study introduces a novel\nintegration of attentional factors and spacing into the logistic knowledge\ntracing (LKT) models to monitor students' performance across different training\nsequences (interleaving and blocking). Attentional factors were incorporated by\nrecording the counts of comparisons between adjacent trials, considering\nwhether they belong to the same or different category. Several features were\nemployed to account for temporal spacing. We used cross-validations to test the\nmodel fit and predictions on the learning session and posttest. Our findings\nreveal that incorporating both attentional factors and spacing features in the\nAdditive Factors Model (AFM) significantly enhances its capacity to capture the\neffects of interleaving and blocking and demonstrates superior predictive\naccuracy for students' learning outcomes. By bridging the gap between\nattentional factors and memory processes, our computational approach offers a\nmore comprehensive framework for understanding and predicting category learning\noutcomes in educational settings.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}