{"id":"2407.13287","title":"On the Logical and Algebraic Aspects of Reasoning with Formal Contexts","authors":"Prosenjit Howlader and Churn-Jung Liau","authorsParsed":[["Howlader","Prosenjit",""],["Liau","Churn-Jung",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:40:55 GMT"}],"updateDate":"2024-07-19","timestamp":1721292055000,"abstract":"  A formal context consists of objects, properties, and the incidence relation\nbetween them. Various notions of concepts defined with respect to formal\ncontexts and their associated algebraic structures have been studied\nextensively, including formal concepts in formal concept analysis (FCA), rough\nconcepts arising from rough set theory (RST), and semiconcepts and\nprotoconcepts for dealing with negation. While all these kinds of concepts are\nassociated with lattices, semiconcepts and protoconcepts additionally yield an\nordered algebraic structure, called double Boolean algebras. As the name\nsuggests, a double Boolean algebra contains two underlying Boolean algebras.\n  In this paper, we investigate logical and algebraic aspects of the\nrepresentation and reasoning about different concepts with respect to formal\ncontexts. We present two-sorted modal logic systems \\textbf{KB} and \\textbf{KF}\nfor the representation and reasoning of rough concepts and formal concepts\nrespectively. Then, in order to represent and reason about both formal and\nrough concepts in a single framework, these two logics are unified into a\ntwo-sorted Boolean modal logic \\textbf{BM}, in which semiconcepts and\nprotoconcepts are also expressible. Based on the logical representation of\nsemiconcepts and protoconcepts, we prove the characterization of double Boolean\nalgebras in terms of their underlying Boolean algebras. Finally, we also\ndiscuss the possibilities of extending our logical systems for the\nrepresentation and reasoning of more fine-grained information in formal\ncontexts.\n","subjects":["Mathematics/Logic"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LrN0oMy0YeIveDnwfuxSSTNv6_hl0kgG02mMBBEarS4","pdfSize":"426070"}
