{"id":"2407.20246","title":"From A-to-Z Review of Clustering Validation Indices","authors":"Bryar A. Hassan, Noor Bahjat Tayfor, Alla A. Hassan, Aram M. Ahmed,\n  Tarik A. Rashid, Naz N. Abdalla","authorsParsed":[["Hassan","Bryar A.",""],["Tayfor","Noor Bahjat",""],["Hassan","Alla A.",""],["Ahmed","Aram M.",""],["Rashid","Tarik A.",""],["Abdalla","Naz N.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 13:52:02 GMT"}],"updateDate":"2024-07-31","timestamp":1721310722000,"abstract":"  Data clustering involves identifying latent similarities within a dataset and\norganizing them into clusters or groups. The outcomes of various clustering\nalgorithms differ as they are susceptible to the intrinsic characteristics of\nthe original dataset, including noise and dimensionality. The effectiveness of\nsuch clustering procedures directly impacts the homogeneity of clusters,\nunderscoring the significance of evaluating algorithmic outcomes. Consequently,\nthe assessment of clustering quality presents a significant and complex\nendeavor. A pivotal aspect affecting clustering validation is the cluster\nvalidity metric, which aids in determining the optimal number of clusters. The\nmain goal of this study is to comprehensively review and explain the\nmathematical operation of internal and external cluster validity indices, but\nnot all, to categorize these indices and to brainstorm suggestions for future\nadvancement of clustering validation research. In addition, we review and\nevaluate the performance of internal and external clustering validation indices\non the most common clustering algorithms, such as the evolutionary clustering\nalgorithm star (ECA*). Finally, we suggest a classification framework for\nexamining the functionality of both internal and external clustering validation\nmeasures regarding their ideal values, user-friendliness, responsiveness to\ninput data, and appropriateness across various fields. This classification aids\nresearchers in selecting the appropriate clustering validation measure to suit\ntheir specific requirements.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"e-Q95S4ARTeH8vPwlvbnsYhzADQzctugiOqlThgXgzY","pdfSize":"1220970"}
