{"id":"2407.19224","title":"RAVSS: Robust Audio-Visual Speech Separation in Multi-Speaker Scenarios\n  with Missing Visual Cues","authors":"Tianrui Pan, Jie Liu, Bohan Wang, Jie Tang, Gangshan Wu","authorsParsed":[["Pan","Tianrui",""],["Liu","Jie",""],["Wang","Bohan",""],["Tang","Jie",""],["Wu","Gangshan",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 09:56:23 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 02:27:56 GMT"}],"updateDate":"2024-07-31","timestamp":1722074183000,"abstract":"  While existing Audio-Visual Speech Separation (AVSS) methods primarily\nconcentrate on the audio-visual fusion strategy for two-speaker separation,\nthey demonstrate a severe performance drop in the multi-speaker separation\nscenarios. Typically, AVSS methods employ guiding videos to sequentially\nisolate individual speakers from the given audio mixture, resulting in notable\nmissing and noisy parts across various segments of the separated speech. In\nthis study, we propose a simultaneous multi-speaker separation framework that\ncan facilitate the concurrent separation of multiple speakers within a singular\nprocess. We introduce speaker-wise interactions to establish distinctions and\ncorrelations among speakers. Experimental results on the VoxCeleb2 and LRS3\ndatasets demonstrate that our method achieves state-of-the-art performance in\nseparating mixtures with 2, 3, 4, and 5 speakers, respectively. Additionally,\nour model can utilize speakers with complete audio-visual information to\nmitigate other visual-deficient speakers, thereby enhancing its resilience to\nmissing visual cues. We also conduct experiments where visual information for\nspecific speakers is entirely absent or visual frames are partially missing.\nThe results demonstrate that our model consistently outperforms others,\nexhibiting the smallest performance drop across all settings involving 2, 3, 4,\nand 5 speakers.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Multimedia","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}