{"id":"2407.19579","title":"The flow field due to a sphere moving in a viscous, density stratified\n  fluid","authors":"Ramana Patibandla, Anubhab Roy and Ganesh Subramanian","authorsParsed":[["Patibandla","Ramana",""],["Roy","Anubhab",""],["Subramanian","Ganesh",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 20:28:07 GMT"}],"updateDate":"2024-07-30","timestamp":1722198487000,"abstract":"  We study the flow field induced by a sphere translating in a viscous\ndensity-stratified ambient, specifically, in the limit of small Reynolds $(Re =\n\\rho U a/\\mu \\ll 1)$, and viscous Richardson numbers $(Ri_v = \\gamma a^3 g/\\mu\nU\\ll 1)$, and large Peclet number $(Pe = Ua/D\\gg 1)$. Here, $a$ is the sphere\nradius, $U$ its translational velocity, $\\rho$ an appropriate reference density\nwithin the Boussinesq framework, $\\mu$ the ambient viscosity, $\\gamma$ the\nabsolute value of the background density gradient, and $D$ the diffusivity of\nthe stratifying agent. For the scenario where buoyancy forces first become\ncomparable to viscous forces at large distances, corresponding to the\nStokes-stratification regime defined by $Re \\ll Ri_v^{1/3} \\ll 1$ for $Pe \\gg\n1$, important flow features such as a vertical reverse jet and a horizontal\nwake, on scales larger than the primary screening length of\n$\\mathcal{O}(aRi_v^{-1/3})$, have been identified by Varanasi and Subramanian\n(2022). Here, we show that the reverse jet is only the central portion of a\ncolumnar structure with multiple annular cells. In the absence of diffusion\nthis columnar structure extends to downstream infinity with the number of\nannular cells diverging in this limit. We provide expressions for the boundary\nof the structure, and the number of cells within, as a function of the\ndownstream distance. For small but finite diffusion, two additional length\nscales emerge - a secondary screening length of $O(aRi_v^{-1/2}Pe^{1/2})$,\nwhere diffusion starts to smear out density variations across cells, leading to\nexponentially decaying flow field; and a tertiary screening length, of\n$O(aRi_v^{-1/2}Pe^{1/2}\\ln(Ri_v^{-1}Pe^3))$, beyond which the columnar\nstructure ceases to exist and the downstream disturbance field reverts from an\nexponential to eventual algebraic decay, analogous to that prevalent at large\ndistances upstream.\n","subjects":["Physics/Fluid Dynamics","Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kDFBat2kZlZXw0No7_WNP8A2rZ3DZIFH85ANxbfQBpY","pdfSize":"16627679","objectId":"0x40a4b3598679cfcc496e951b0b99ed2be136fcaee116846e8135985459a0f75e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
