{"id":"2407.01225","title":"Hong-Ou-Mandel Interference with a Coexisting Clock using Transceivers\n  for Synchronization over Deployed Fiber","authors":"Anirudh Ramesh, Daniel R. Reilly, Kim Fook Lee, Paul M. Moraw, Joaquin\n  Chung, Md Shariful Islam, Cristi\\'an Pe\\~na, Xu Han, Rajkumar Kettimuthu,\n  Prem Kumar, and Gregory Kanter","authorsParsed":[["Ramesh","Anirudh",""],["Reilly","Daniel R.",""],["Lee","Kim Fook",""],["Moraw","Paul M.",""],["Chung","Joaquin",""],["Islam","Md Shariful",""],["Peña","Cristián",""],["Han","Xu",""],["Kettimuthu","Rajkumar",""],["Kumar","Prem",""],["Kanter","Gregory",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 12:16:35 GMT"}],"updateDate":"2024-07-02","timestamp":1719836195000,"abstract":"  Interference between independently generated photons is a key step towards\ndistributing entanglement over long distances, but it requires synchronization\nbetween the distantly-located photon sources. Synchronizing the clocks of such\nphoton sources using coexisting two-way classical optical communications over\nthe same fiber that transport the quantum photonic signals is a promising\napproach for achieving photon-photon interference over long distances, enabling\nentanglement distribution for quantum networking using the deployed fiber\ninfrastructure. Here, we demonstrate photon-photon interference by observing\nthe Hong-Ou-Mandel dip between two distantly-located sources: a weak coherent\nstate source obtained by attenuating the output of a laser and a heralded\nsingle-photon source. We achieve a maximum dip visibility of $0.58 \\pm 0.04$\nwhen the two sources are connected via $4.3$ km of deployed fiber. Dip\nvisibilities $>0.5$ are nonclassical and a first step towards achieving\nteleportation over the deployed fiber infrastructure. In our experiment, the\nclassical optical communication is achieved with $-21$ dBm of optical signal\nlaunch power, which is used to synchronize the clocks in the two independent,\ndistantly-located photon sources. The impact of spontaneous Raman scattering\nfrom the classical optical signals is mitigated by appropriate choice of the\nquantum and classical channel wavelengths. All equipment used in our experiment\n(the photon sources and the synchronization setup) is commercially available.\nFinally, our experiment represents a scalable approach to enabling practical\nquantum networking with commercial equipment and coexistence with classical\ncommunications in optical fiber.\n","subjects":["Physics/Quantum Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/"}