{"id":"2407.04285","title":"Robust Decision Transformer: Tackling Data Corruption in Offline RL via\n  Sequence Modeling","authors":"Jiawei Xu, Rui Yang, Feng Luo, Meng Fang, Baoxiang Wang, Lei Han","authorsParsed":[["Xu","Jiawei",""],["Yang","Rui",""],["Luo","Feng",""],["Fang","Meng",""],["Wang","Baoxiang",""],["Han","Lei",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 06:34:32 GMT"}],"updateDate":"2024-07-08","timestamp":1720161272000,"abstract":"  Learning policies from offline datasets through offline reinforcement\nlearning (RL) holds promise for scaling data-driven decision-making and\navoiding unsafe and costly online interactions. However, real-world data\ncollected from sensors or humans often contains noise and errors, posing a\nsignificant challenge for existing offline RL methods. Our study indicates that\ntraditional offline RL methods based on temporal difference learning tend to\nunderperform Decision Transformer (DT) under data corruption, especially when\nthe amount of data is limited. This suggests the potential of sequential\nmodeling for tackling data corruption in offline RL. To further unleash the\npotential of sequence modeling methods, we propose Robust Decision Transformer\n(RDT) by incorporating several robust techniques. Specifically, we introduce\nGaussian weighted learning and iterative data correction to reduce the effect\nof corrupted data. Additionally, we leverage embedding dropout to enhance the\nmodel's resistance to erroneous inputs. Extensive experiments on MoJoCo,\nKitChen, and Adroit tasks demonstrate RDT's superior performance under diverse\ndata corruption compared to previous methods. Moreover, RDT exhibits remarkable\nrobustness in a challenging setting that combines training-time data corruption\nwith testing-time observation perturbations. These results highlight the\npotential of robust sequence modeling for learning from noisy or corrupted\noffline datasets, thereby promoting the reliable application of offline RL in\nreal-world tasks.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}