{"id":"2407.11252","title":"Dynamical Control of Excitons in Atomically Thin Semiconductors","authors":"Eric L. Peterson, Trond I. Andersen, Giovanni Scuri, Andrew Y. Joe,\n  Andr\\'es M. Mier Valdivia, Xiaoling Liu, Alexander A. Zibrov, Bumho Kim,\n  Takashi Taniguchi, Kenji Watanabe, James Hone, Valentin Walther, Hongkun\n  Park, Philip Kim, Mikhail D. Lukin","authorsParsed":[["Peterson","Eric L.",""],["Andersen","Trond I.",""],["Scuri","Giovanni",""],["Joe","Andrew Y.",""],["Valdivia","Andrés M. Mier",""],["Liu","Xiaoling",""],["Zibrov","Alexander A.",""],["Kim","Bumho",""],["Taniguchi","Takashi",""],["Watanabe","Kenji",""],["Hone","James",""],["Walther","Valentin",""],["Park","Hongkun",""],["Kim","Philip",""],["Lukin","Mikhail D.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 21:42:48 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 16:46:58 GMT"}],"updateDate":"2024-07-18","timestamp":1721079768000,"abstract":"  Excitons in transition metal dichalcogenides (TMDs) have emerged as a\npromising platform for novel applications ranging from optoelectronic devices\nto quantum optics and solid state quantum simulators. While much progress has\nbeen made towards characterizing and controlling excitons in TMDs, manipulating\ntheir properties during the course of their lifetime - a key requirement for\nmany optoelectronic device and information processing modalities - remains an\noutstanding challenge. Here we combine long-lived interlayer excitons in\nangle-aligned MoSe$_2$/WSe$_2$ heterostructures with fast electrical control to\nrealize dynamical control schemes, in which exciton properties are not\npredetermined at the time of excitation but can be dynamically manipulated\nduring their lifetime. Leveraging the out-of-plane exciton dipole moment, we\nuse electric fields to demonstrate dynamical control over the exciton emission\nwavelength. Moreover, employing a patterned gate geometry, we demonstrate rapid\nlocal sample doping and toggling of the radiative decay rate through\nexciton-charge interactions during the exciton lifetime. Spatially mapping the\nexciton response reveals charge redistribution, offering a novel probe of\nelectronic transport in twisted TMD heterostructures. Our results establish the\nfeasibility of dynamical exciton control schemes, unlocking new directions for\nexciton-based information processing and optoelectronic devices, and the\nrealization of excitonic phenomena in TMDs.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}