{"id":"2407.01607","title":"Multi-Epoch learning with Data Augmentation for Deep Click-Through Rate\n  Prediction","authors":"Zhongxiang Fan, Zhaocheng Liu, Jian Liang, Dongying Kong, Han Li, Peng\n  Jiang, Shuang Li, Kun Gai","authorsParsed":[["Fan","Zhongxiang",""],["Liu","Zhaocheng",""],["Liang","Jian",""],["Kong","Dongying",""],["Li","Han",""],["Jiang","Peng",""],["Li","Shuang",""],["Gai","Kun",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 04:00:15 GMT"}],"updateDate":"2024-07-03","timestamp":1719460815000,"abstract":"  This paper investigates the one-epoch overfitting phenomenon in Click-Through\nRate (CTR) models, where performance notably declines at the start of the\nsecond epoch. Despite extensive research, the efficacy of multi-epoch training\nover the conventional one-epoch approach remains unclear. We identify the\noverfitting of the embedding layer, caused by high-dimensional data sparsity,\nas the primary issue. To address this, we introduce a novel and simple\nMulti-Epoch learning with Data Augmentation (MEDA) framework, suitable for both\nnon-continual and continual learning scenarios, which can be seamlessly\nintegrated into existing deep CTR models and may have potential applications to\nhandle the \"forgetting or overfitting\" dilemma in the retraining and the\nwell-known catastrophic forgetting problems. MEDA minimizes overfitting by\nreducing the dependency of the embedding layer on subsequent training data or\nthe Multi-Layer Perceptron (MLP) layers, and achieves data augmentation through\ntraining the MLP with varied embedding spaces. Our findings confirm that\npre-trained MLP layers can adapt to new embedding spaces, enhancing performance\nwithout overfitting. This adaptability underscores the MLP layers' role in\nlearning a matching function focused on the relative relationships among\nembeddings rather than their absolute positions. To our knowledge, MEDA\nrepresents the first multi-epoch training strategy tailored for deep CTR\nprediction models. We conduct extensive experiments on several public and\nbusiness datasets, and the effectiveness of data augmentation and superiority\nover conventional single-epoch training are fully demonstrated. Besides, MEDA\nhas exhibited significant benefits in a real-world online advertising system.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Information Retrieval","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}