{"id":"2407.03477","title":"Whose Knowledge is Valued?: Epistemic Injustice in CSCW Applications","authors":"Leah Hope Ajmani, Jasmine C Foriest, Jordan Taylor, Kyle Pittman,\n  Sarah Gilbert, Michael Ann Devito","authorsParsed":[["Ajmani","Leah Hope",""],["Foriest","Jasmine C",""],["Taylor","Jordan",""],["Pittman","Kyle",""],["Gilbert","Sarah",""],["Devito","Michael Ann",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 19:44:04 GMT"}],"updateDate":"2024-07-08","timestamp":1720035844000,"abstract":"  Social computing scholars have long known that people do not interact with\nknowledge in straightforward ways, especially in digital environments. While\npolicies around knowledge are essential for targeting misinformation, they are\nvalue-laden; in choosing how to present information, we undermine\nnon-traditional -- often non-Western -- ways of knowing. Epistemic injustice is\nthe systemic exclusion of certain people and methods from the knowledge canon.\nEpistemic injustice chips away at one's testimony and vocabulary until they are\nstripped of their due right to know and understand. In this paper, we\narticulate how epistemic injustice in sociotechnical applications leads to\nmaterial harm. Inspired by a hybrid collaborative autoethnography of 14 CSCW\npractitioners, we present three cases of epistemic injustice in sociotechnical\napplications: online transgender healthcare, identity sensemaking on\nr/bisexual, and Indigenous ways of knowing on r/AskHistorians. We further\nexplore signature tensions across our autoethnographic materials and relate\nthem to previous CSCW research areas and personal non-technological\nexperiences. We argue that epistemic injustice can serve as a unifying and\nintersectional lens for CSCW research by surfacing dimensions of epistemic\ncommunity and power. Finally, we present a call to action of three changes the\nCSCW community should make to move toward its own goals of research justice. We\ncall for CSCW researchers to center individual experiences, bolster\ncommunities, and remediate issues of epistemic power as a means towards\nepistemic justice. In sum, we recount, synthesize, and propose solutions for\nthe various forms of epistemic injustice that CSCW sites of study -- including\nCSCW itself -- propagate.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"8ycGoKnVRZlyRM-VIzk48yiLjQMzfEnGLNfFjUFbpHA","pdfSize":"2354252"}
