{"id":"2407.13470","title":"Improving polarimetric accuracy of RoboPol to $<$ 0.05 % using a\n  half-wave plate calibrator system","authors":"Siddharth Maharana, Dmitry Blinov, A. N. Ramaprakash, Vasiliki\n  Pavlidou, Konstantinos Tassis","authorsParsed":[["Maharana","Siddharth",""],["Blinov","Dmitry",""],["Ramaprakash","A. N.",""],["Pavlidou","Vasiliki",""],["Tassis","Konstantinos",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 12:43:12 GMT"}],"updateDate":"2024-07-23","timestamp":1721306592000,"abstract":"  RoboPol is a four-channel, one-shot linear optical polarimeter that has been\nsuccessfully operating since 2013 on the 1.3 m telescope at Skinakas\nObservatory in Crete, Greece. Using its unique optical system, it measures the\nlinear Stokes parameters $q$ and $u$ in a single exposure with high\npolarimetric accuracy of 0.1% - 0.15% and 1 degree in polarization angle in the\nR broadband filter. Its performance marginally degrades in other broadband\nfilters. The source of the current instrumental performance limit has been\nidentified as unaccounted and variable instrumental polarization, most likely\noriginating from factors such as temperature and gravity-induced instrument\nflexure. To improve the performance of RoboPol in all broadband filters,\nincluding R, we have developed a rotating half-wave plate calibrator system.\nThis calibrator system is placed at the beginning of the instrument and enables\nmodulation of polarimetric measurements by beam swapping between all four\nchannels of RoboPol.\n  Using the new calibrator system, we observed multiple polarimetric standard\nstars over two annual observing seasons with RoboPol. This has enabled us to\nachieve a polarimetric accuracy of better than 0.05 % in both $q$ and $u$, and\n0.5 degrees in polarization angle across all filters, enhancing the\ninstrument's performance by a factor of two to three.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UrGQmXX39sdbMYJf-IPOJfO8ed70ydizrMqExArEwZQ","pdfSize":"5901262"}
