{"id":"2407.06113","title":"C2C: Component-to-Composition Learning for Zero-Shot Compositional\n  Action Recognition","authors":"Rongchang Li, Zhenhua Feng, Tianyang Xu, Linze Li, Xiao-Jun Wu,\n  Muhammad Awais, Sara Atito and Josef Kittler","authorsParsed":[["Li","Rongchang",""],["Feng","Zhenhua",""],["Xu","Tianyang",""],["Li","Linze",""],["Wu","Xiao-Jun",""],["Awais","Muhammad",""],["Atito","Sara",""],["Kittler","Josef",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 16:49:01 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 04:20:32 GMT"}],"updateDate":"2024-07-22","timestamp":1720457341000,"abstract":"  Compositional actions consist of dynamic (verbs) and static (objects)\nconcepts. Humans can easily recognize unseen compositions using the learned\nconcepts. For machines, solving such a problem requires a model to recognize\nunseen actions composed of previously observed verbs and objects, thus\nrequiring so-called compositional generalization ability. To facilitate this\nresearch, we propose a novel Zero-Shot Compositional Action Recognition\n(ZS-CAR) task. For evaluating the task, we construct a new benchmark,\nSomething-composition (Sth-com), based on the widely used Something-Something\nV2 dataset. We also propose a novel Component-to-Composition (C2C) learning\nmethod to solve the new ZS-CAR task. C2C includes an independent component\nlearning module and a composition inference module. Last, we devise an enhanced\ntraining strategy to address the challenges of component variations between\nseen and unseen compositions and to handle the subtle balance between learning\nseen and unseen actions. The experimental results demonstrate that the proposed\nframework significantly surpasses the existing compositional generalization\nmethods and sets a new state-of-the-art. The new Sth-com benchmark and code are\navailable at https://github.com/RongchangLi/ZSCAR_C2C.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}