{"id":"2407.19306","title":"Symmetrical Joint Learning Support-query Prototypes for Few-shot\n  Segmentation","authors":"Qun Li, Baoquan Sun, Fu Xiao, Yonggang Qi, Bir Bhanu","authorsParsed":[["Li","Qun",""],["Sun","Baoquan",""],["Xiao","Fu",""],["Qi","Yonggang",""],["Bhanu","Bir",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 17:37:56 GMT"}],"updateDate":"2024-07-30","timestamp":1722101876000,"abstract":"  We propose Sym-Net, a novel framework for Few-Shot Segmentation (FSS) that\naddresses the critical issue of intra-class variation by jointly learning both\nquery and support prototypes in a symmetrical manner. Unlike previous methods\nthat generate query prototypes solely by matching query features to support\nprototypes, which is a form of bias learning towards the few-shot support\nsamples, Sym-Net leverages a balanced symmetrical learning approach for both\nquery and support prototypes, ensuring that the learning process does not favor\none set (support or query) over the other. One of main modules of Sym-Net is\nthe visual-text alignment-based prototype aggregation module, which is not just\nquery-guided prototype refinement, it is a jointly learning from both support\nand query samples, which makes the model beneficial for handling intra-class\ndiscrepancies and allows it to generalize better to new, unseen classes.\nSpecifically, a parameter-free prior mask generation module is designed to\naccurately localize both local and global regions of the query object by using\nsliding windows of different sizes and a self-activation kernel to suppress\nincorrect background matches. Additionally, to address the information loss\ncaused by spatial pooling during prototype learning, a top-down\nhyper-correlation module is integrated to capture multi-scale spatial\nrelationships between support and query images. This approach is further\njointly optimized by implementing a co-optimized hard triplet mining strategy.\nExperimental results show that the proposed Sym-Net outperforms\nstate-of-the-art models, which demonstrates that jointly learning support-query\nprototypes in a symmetrical manner for FSS offers a promising direction to\nenhance segmentation performance with limited annotated data.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}