{"id":"2407.21209","title":"Algorithm-Assisted Decision Making and Racial Disparities in Housing: A\n  Study of the Allegheny Housing Assessment Tool","authors":"Lingwei Cheng, Cameron Drayton, Alexandra Chouldechova, Rhema\n  Vaithianathan","authorsParsed":[["Cheng","Lingwei",""],["Drayton","Cameron",""],["Chouldechova","Alexandra",""],["Vaithianathan","Rhema",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 21:44:48 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 23:13:18 GMT"}],"updateDate":"2024-08-29","timestamp":1722375888000,"abstract":"  The demand for housing assistance across the United States far exceeds the\nsupply, leaving housing providers the task of prioritizing clients for receipt\nof this limited resource. To be eligible for federal funding, local\nhomelessness systems are required to implement assessment tools as part of\ntheir prioritization processes. The Vulnerability Index Service Prioritization\nDecision Assistance Tool (VI-SPDAT) is the most commonly used assessment tool\nnationwide. Recent studies have criticized the VI-SPDAT as exhibiting racial\nbias, which may lead to unwarranted racial disparities in housing provision. In\nresponse to these criticisms, some jurisdictions have developed alternative\ntools, such as the Allegheny Housing Assessment (AHA), which uses algorithms to\nassess clients' risk levels. Drawing on data from its deployment, we conduct\ndescriptive and quantitative analyses to evaluate whether replacing the\nVI-SPDAT with the AHA affects racial disparities in housing allocation. We find\nthat the VI-SPDAT tended to assign higher risk scores to white clients and\nlower risk scores to Black clients, and that white clients were served at a\nhigher rates pre-AHA deployment. While post-deployment service decisions became\nbetter aligned with the AHA score, and the distribution of AHA scores is\nsimilar across racial groups, we do not find evidence of a corresponding\ndecrease in disparities in service rates. We attribute the persistent disparity\nto the use of Alt-AHA, a survey-based tool that is used in cases of low data\nquality, as well as group differences in eligibility-related factors, such as\nchronic homelessness and veteran status. We discuss the implications for\nhousing service systems seeking to reduce racial disparities in their service\ndelivery.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/"}