{"id":"2407.05461","title":"CAV-AD: A Robust Framework for Detection of Anomalous Data and Malicious\n  Sensors in CAV Networks","authors":"Md Sazedur Rahman, Mohamed Elmahallawy, Sanjay Madria, Samuel Frimpong","authorsParsed":[["Rahman","Md Sazedur",""],["Elmahallawy","Mohamed",""],["Madria","Sanjay",""],["Frimpong","Samuel",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 18:19:03 GMT"}],"updateDate":"2024-07-09","timestamp":1720376343000,"abstract":"  The adoption of connected and automated vehicles (CAVs) has sparked\nconsiderable interest across diverse industries, including public\ntransportation, underground mining, and agriculture sectors. However, CAVs'\nreliance on sensor readings makes them vulnerable to significant threats.\nManipulating these readings can compromise CAV network security, posing serious\nrisks for malicious activities. Although several anomaly detection (AD)\napproaches for CAV networks are proposed, they often fail to: i) detect\nmultiple anomalies in specific sensor(s) with high accuracy or F1 score, and\nii) identify the specific sensor being attacked. In response, this paper\nproposes a novel framework tailored to CAV networks, called CAV-AD, for\ndistinguishing abnormal readings amidst multiple anomaly data while identifying\nmalicious sensors. Specifically, CAV-AD comprises two main components: i) A\nnovel CNN model architecture called optimized omni-scale CNN (O-OS-CNN), which\noptimally selects the time scale by generating all possible kernel sizes for\ninput time series data; ii) An amplification block to increase the values of\nanomaly readings, enhancing sensitivity for detecting anomalies. Not only that,\nbut CAV-AD integrates the proposed O-OS-CNN with a Kalman filter to instantly\nidentify the malicious sensors. We extensively train CAV-AD using real-world\ndatasets containing both instant and constant attacks, evaluating its\nperformance in detecting intrusions from multiple anomalies, which presents a\nmore challenging scenario. Our results demonstrate that CAV-AD outperforms\nstate-of-the-art methods, achieving an average accuracy of 98% and an average\nF1 score of 89\\%, while accurately identifying the malicious sensors.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"5zNjLhWxk9UH0YJGwk9zRfuB2yG9YBgtGF_RBFcaKKE","pdfSize":"1584826"}
