{"id":"2407.15693","title":"Fisher-Rao Gradient Flow: Geodesic Convexity and Functional Inequalities","authors":"Jos\\'e A. Carrillo, Yifan Chen, Daniel Zhengyu Huang, Jiaoyang Huang,\n  Dongyi Wei","authorsParsed":[["Carrillo","José A.",""],["Chen","Yifan",""],["Huang","Daniel Zhengyu",""],["Huang","Jiaoyang",""],["Wei","Dongyi",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:00:14 GMT"}],"updateDate":"2024-07-24","timestamp":1721660414000,"abstract":"  The dynamics of probability density functions has been extensively studied in\nscience and engineering to understand physical phenomena and facilitate\nalgorithmic design. Of particular interest are dynamics that can be formulated\nas gradient flows of energy functionals under the Wasserstein metric. The\ndevelopment of functional inequalities, such as the log-Sobolev inequality,\nplays a pivotal role in analyzing the convergence of these dynamics. The goal\nof this paper is to parallel the success of techniques using functional\ninequalities, for dynamics that are gradient flows under the Fisher-Rao metric,\nwith various $f$-divergences as energy functionals. Such dynamics take the form\nof a nonlocal differential equation, for which existing analysis critically\nrelies on using the explicit solution formula in special cases. We provide a\ncomprehensive study on functional inequalities and the relevant geodesic\nconvexity for Fisher-Rao gradient flows under minimal assumptions. A notable\nfeature of the obtained functional inequalities is that they do not depend on\nthe log-concavity or log-Sobolev constants of the target distribution.\nConsequently, the convergence rate of the dynamics (assuming well-posed) is\nuniform across general target distributions, making them potentially desirable\ndynamics for posterior sampling applications in Bayesian inference.\n","subjects":["Mathematics/Analysis of PDEs","Computing Research Repository/Machine Learning","Mathematics/Functional Analysis","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NEVMNA68-nU79l--ySBAlhynIqnm_hYsYLmrsT-EFXg","pdfSize":"454298"}
