{"id":"2407.05310","title":"Ternary Spike-based Neuromorphic Signal Processing System","authors":"Shuai Wang and Dehao Zhang and Ammar Belatreche and Yichen Xiao and\n  Hongyu Qing and Wenjie We and Malu Zhang and Yang Yang","authorsParsed":[["Wang","Shuai",""],["Zhang","Dehao",""],["Belatreche","Ammar",""],["Xiao","Yichen",""],["Qing","Hongyu",""],["We","Wenjie",""],["Zhang","Malu",""],["Yang","Yang",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 09:32:19 GMT"}],"updateDate":"2024-07-09","timestamp":1720344739000,"abstract":"  Deep Neural Networks (DNNs) have been successfully implemented across various\nsignal processing fields, resulting in significant enhancements in performance.\nHowever, DNNs generally require substantial computational resources, leading to\nsignificant economic costs and posing challenges for their deployment on\nresource-constrained edge devices. In this study, we take advantage of spiking\nneural networks (SNNs) and quantization technologies to develop an\nenergy-efficient and lightweight neuromorphic signal processing system. Our\nsystem is characterized by two principal innovations: a threshold-adaptive\nencoding (TAE) method and a quantized ternary SNN (QT-SNN). The TAE method can\nefficiently encode time-varying analog signals into sparse ternary spike\ntrains, thereby reducing energy and memory demands for signal processing.\nQT-SNN, compatible with ternary spike trains from the TAE method, quantifies\nboth membrane potentials and synaptic weights to reduce memory requirements\nwhile maintaining performance. Extensive experiments are conducted on two\ntypical signal-processing tasks: speech and electroencephalogram recognition.\nThe results demonstrate that our neuromorphic signal processing system achieves\nstate-of-the-art (SOTA) performance with a 94% reduced memory requirement.\nFurthermore, through theoretical energy consumption analysis, our system shows\n7.5x energy saving compared to other SNN works. The efficiency and efficacy of\nthe proposed system highlight its potential as a promising avenue for\nenergy-efficient signal processing.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}