{"id":"2407.10310","title":"Impact of Different Infrastructures and Traffic Scenarios on Behavioral\n  and Physiological Responses of E-scooter Users","authors":"Dong Chen, Arman Hosseini, Arik Smith, David Xiang, Arsalan Heydarian,\n  Omid Shoghli, Bradford Campbell","authorsParsed":[["Chen","Dong",""],["Hosseini","Arman",""],["Smith","Arik",""],["Xiang","David",""],["Heydarian","Arsalan",""],["Shoghli","Omid",""],["Campbell","Bradford",""]],"versions":[{"version":"v1","created":"Sun, 5 May 2024 19:55:46 GMT"}],"updateDate":"2024-07-16","timestamp":1714938946000,"abstract":"  As micromobility devices such as e-scooters gain global popularity, emergency\ndepartments around the world have observed a rising trend in related injuries.\nHowever, the majority of current research on e-scooter safety relies heavily on\nsurveys, news reports, and data from vendors, with a noticeable scarcity of\nnaturalistic studies examining the effects of riders' behaviors and\nphysiological responses. Therefore, this paper aims to study the responses of\ne-scooter users under different infrastructures and scenarios through\nnaturalistic riding experiments. The findings indicate that different speed\nprofiles, infrastructural elements, and traffic scenarios significantly\ninfluence riding dynamics. The experimental results also reveal that e-scooters\nface amplified safety challenges when navigating through areas with speed\nvariations and without dedicated riding spaces. The study underscores the\nimportance of considering infrastructure design and its influence on e-scooter\nsafety, providing insights that could inform future urban planning and\npolicy-making to enhance the safety of these increasingly popular vehicles.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"y5QxbUoC5rSBHCtpJIAAdI4co8bBimdaZIQfMU0QwBQ","pdfSize":"2044902"}
