{"id":"2407.10279","title":"AlphaDou: High-Performance End-to-End Doudizhu AI Integrating Bidding","authors":"Chang Lei, Huan Lei","authorsParsed":[["Lei","Chang",""],["Lei","Huan",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 17:32:36 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 15:17:06 GMT"}],"updateDate":"2024-09-16","timestamp":1720978356000,"abstract":"  Artificial intelligence for card games has long been a popular topic in AI\nresearch. In recent years, complex card games like Mahjong and Texas Hold'em\nhave been solved, with corresponding AI programs reaching the level of human\nexperts. However, the game of Doudizhu presents significant challenges due to\nits vast state/action space and unique characteristics involving reasoning\nabout competition and cooperation, making the game extremely difficult to\nsolve.The RL model Douzero, trained using the Deep Monte Carlo algorithm\nframework, has shown excellent performance in Doudizhu. However, there are\ndifferences between its simplified game environment and the actual Doudizhu\nenvironment, and its performance is still a considerable distance from that of\nhuman experts. This paper modifies the Deep Monte Carlo algorithm framework by\nusing reinforcement learning to obtain a neural network that simultaneously\nestimates win rates and expectations. The action space is pruned using\nexpectations, and strategies are generated based on win rates. The modified\nalgorithm enables the AI to perform the full range of tasks in the Doudizhu\ngame, including bidding and cardplay. The model was trained in a actual\nDoudizhu environment and achieved state-of-the-art performance among publicly\navailable models. We hope that this new framework will provide valuable\ninsights for AI development in other bidding-based games.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Multiagent Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}