{"id":"2407.15375","title":"The Development of a Comprehensive Spanish Dictionary for Phonetic and\n  Lexical Tagging in Socio-phonetic Research (ESPADA)","authors":"Simon Gonzalez","authorsParsed":[["Gonzalez","Simon",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 04:51:33 GMT"}],"updateDate":"2024-07-23","timestamp":1721623893000,"abstract":"  Pronunciation dictionaries are an important component in the process of\nspeech forced alignment. The accuracy of these dictionaries has a strong effect\non the aligned speech data since they help the mapping between orthographic\ntranscriptions and acoustic signals. In this paper, I present the creation of a\ncomprehensive pronunciation dictionary in Spanish (ESPADA) that can be used in\nmost of the dialect variants of Spanish data. Current dictionaries focus on\nspecific regional variants, but with the flexible nature of our tool, it can be\nreadily applied to capture the most common phonetic differences across major\ndialectal variants. We propose improvements to current pronunciation\ndictionaries as well as mapping other relevant annotations such as\nmorphological and lexical information. In terms of size, it is currently the\nmost complete dictionary with more than 628,000 entries, representing words\nfrom 16 countries. All entries come with their corresponding pronunciations,\nmorphological and lexical tagging, and other relevant information for phonetic\nanalysis: stress patterns, phonotactics, IPA transcriptions, and more. This\naims to equip socio-phonetic researchers with a complete open-source tool that\nenhances dialectal research within socio-phonetic frameworks in the Spanish\nlanguage.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"w6TGKYWThy2pJnl4FtGFZZuOiMNv4Ybl8-9UKwuktoM","pdfSize":"570345","objectId":"0x4190dbc638614931bcab4c9a624037b387d02ae81b3027549bc92c2fad833843","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
