{"id":"2407.13158","title":"HHGT: Hierarchical Heterogeneous Graph Transformer for Heterogeneous\n  Graph Representation Learning","authors":"Qiuyu Zhu, Liang Zhang, Qianxiong Xu, Kaijun Liu, Cheng Long, Xiaoyang\n  Wang","authorsParsed":[["Zhu","Qiuyu",""],["Zhang","Liang",""],["Xu","Qianxiong",""],["Liu","Kaijun",""],["Long","Cheng",""],["Wang","Xiaoyang",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 04:58:27 GMT"}],"updateDate":"2024-07-19","timestamp":1721278707000,"abstract":"  Despite the success of Heterogeneous Graph Neural Networks (HGNNs) in\nmodeling real-world Heterogeneous Information Networks (HINs), challenges such\nas expressiveness limitations and over-smoothing have prompted researchers to\nexplore Graph Transformers (GTs) for enhanced HIN representation learning.\nHowever, research on GT in HINs remains limited, with two key shortcomings in\nexisting work: (1) A node's neighbors at different distances in HINs convey\ndiverse semantics. Unfortunately, existing methods ignore such differences and\nuniformly treat neighbors within a given distance in a coarse manner, which\nresults in semantic confusion. (2) Nodes in HINs have various types, each with\nunique semantics. Nevertheless, existing methods mix nodes of different types\nduring neighbor aggregation, hindering the capture of proper correlations\nbetween nodes of diverse types. To bridge these gaps, we design an innovative\nstructure named (k,t)-ring neighborhood, where nodes are initially organized by\ntheir distance, forming different non-overlapping k-ring neighborhoods for each\ndistance. Within each k-ring structure, nodes are further categorized into\ndifferent groups according to their types, thus emphasizing the heterogeneity\nof both distances and types in HINs naturally. Based on this structure, we\npropose a novel Hierarchical Heterogeneous Graph Transformer (HHGT) model,\nwhich seamlessly integrates a Type-level Transformer for aggregating nodes of\ndifferent types within each k-ring neighborhood, followed by a Ring-level\nTransformer for aggregating different k-ring neighborhoods in a hierarchical\nmanner. Extensive experiments are conducted on downstream tasks to verify\nHHGT's superiority over 14 baselines, with a notable improvement of up to\n24.75% in NMI and 29.25% in ARI for node clustering task on the ACM dataset\ncompared to the best baseline.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Databases"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}