{"id":"2407.09507","title":"Can Generative AI Replace Immunofluorescent Staining Processes? A\n  Comparison Study of Synthetically Generated CellPainting Images from\n  Brightfield","authors":"Xiaodan Xing, Siofra Murdoch, Chunling Tang, Giorgos Papanastasiou,\n  Jan Cross-Zamirski, Yunzhe Guo, Xianglu Xiao, Carola-Bibiane Sch\\\"onlieb,\n  Yinhai Wang and Guang Yang","authorsParsed":[["Xing","Xiaodan",""],["Murdoch","Siofra",""],["Tang","Chunling",""],["Papanastasiou","Giorgos",""],["Cross-Zamirski","Jan",""],["Guo","Yunzhe",""],["Xiao","Xianglu",""],["Schönlieb","Carola-Bibiane",""],["Wang","Yinhai",""],["Yang","Guang",""]],"versions":[{"version":"v1","created":"Sat, 15 Jun 2024 09:42:11 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 22:19:39 GMT"}],"updateDate":"2024-07-18","timestamp":1718444531000,"abstract":"  Cell imaging assays utilizing fluorescence stains are essential for observing\nsub-cellular organelles and their responses to perturbations. Immunofluorescent\nstaining process is routinely in labs, however the recent innovations in\ngenerative AI is challenging the idea of IF staining are required. This is\nespecially true when the availability and cost of specific fluorescence dyes is\na problem to some labs. Furthermore, staining process takes time and leads to\ninter-intra technician and hinders downstream image and data analysis, and the\nreusability of image data for other projects. Recent studies showed the use of\ngenerated synthetic immunofluorescence (IF) images from brightfield (BF) images\nusing generative AI algorithms in the literature. Therefore, in this study, we\nbenchmark and compare five models from three types of IF generation backbones,\nCNN, GAN, and diffusion models, using a publicly available dataset. This paper\nnot only serves as a comparative study to determine the best-performing model\nbut also proposes a comprehensive analysis pipeline for evaluating the efficacy\nof generators in IF image synthesis. We highlighted the potential of deep\nlearning-based generators for IF image synthesis, while also discussed\npotential issues and future research directions. Although generative AI shows\npromise in simplifying cell phenotyping using only BF images with IF staining,\nfurther research and validations are needed to address the key challenges of\nmodel generalisability, batch effects, feature relevance and computational\ncosts.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2eFLz4uailfPj1ZHrkIiIiuDcjYt5dcoda-X9lSUT4o","pdfSize":"9831827","objectId":"0x82e1c3a8a93030a9647b7983b6e569c3d61537051dd2ba65fa6f49210f7ced86","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
