{"id":"2407.15401","title":"Data Space Inversion for Efficient Predictions and Uncertainty\n  Quantification for Geothermal Models","authors":"Alex de Beer, Andrew Power, Daniel Wong, Ken Dekkers, Michael Gravatt,\n  Elvar K. Bjarkason, John P. O'Sullivan, Michael J. O'Sullivan, Oliver J.\n  Maclaren and Ruanui Nicholson","authorsParsed":[["de Beer","Alex",""],["Power","Andrew",""],["Wong","Daniel",""],["Dekkers","Ken",""],["Gravatt","Michael",""],["Bjarkason","Elvar K.",""],["O'Sullivan","John P.",""],["O'Sullivan","Michael J.",""],["Maclaren","Oliver J.",""],["Nicholson","Ruanui",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 06:08:07 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 09:09:30 GMT"}],"updateDate":"2024-08-23","timestamp":1721628487000,"abstract":"  The ability to make accurate predictions with quantified uncertainty provides\na crucial foundation for the successful management of a geothermal reservoir.\nConventional approaches for making predictions using geothermal reservoir\nmodels involve estimating unknown model parameters using field data, then\npropagating the uncertainty in these estimates through to the predictive\nquantities of interest. However, the unknown parameters are not always of\ndirect interest; instead, the predictions are of primary importance. Data space\ninversion (DSI) is an alternative methodology that allows for the efficient\nestimation of predictive quantities of interest, with quantified uncertainty,\nthat avoids the need to estimate model parameters entirely. In this paper, we\nevaluate the applicability of DSI to geothermal reservoir modelling. We first\nreview the processes of model calibration, prediction and uncertainty\nquantification from a Bayesian perspective, and introduce data space inversion\nas a simple, efficient technique for approximating the posterior predictive\ndistribution. We then apply the DSI framework to two model problems in\ngeothermal reservoir modelling. We evaluate the accuracy and efficiency of DSI\nrelative to other common methods for uncertainty quantification, study how the\nnumber of reservoir model simulations affects the resulting approximation to\nthe posterior predictive distribution, and demonstrate how the framework can be\nenhanced through the use of suitable reparametrisations. Our results support\nthe idea that data space inversion is a simple, robust and efficient technique\nfor making predictions with quantified uncertainty using geothermal reservoir\nmodels, providing a useful alternative to more conventional approaches.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}