{"id":"2407.20397","title":"Results from ON-OFF analysis of the Neutrinos-Angra detector","authors":"E. Kemp, W. V. Santos, J. C. Anjos, P. Chimenti, L. F. G. Gonzalez, G.\n  P. Guedes, H. P. Lima Jr., R. A. N\\'obrega, I. M. Pepe, D. B. S. Ribeiro","authorsParsed":[["Kemp","E.",""],["Santos","W. V.",""],["Anjos","J. C.",""],["Chimenti","P.",""],["Gonzalez","L. F. G.",""],["Guedes","G. P.",""],["Lima","H. P.","Jr."],["Nóbrega","R. A.",""],["Pepe","I. M.",""],["Ribeiro","D. B. S.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 19:50:13 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 16:04:26 GMT"}],"updateDate":"2024-08-08","timestamp":1722282613000,"abstract":"  The Neutrinos Angra Experiment, a water-based Cherenkov detector, is located\nat the Angra dos Reis nuclear power plant in Brazil. Designed to detect\nelectron antineutrinos produced in the nuclear reactor, the primary objective\nof the experiment is to demonstrate the feasibility of monitoring reactor\nactivity using an antineutrino detector. This effort aligns with the\nInternational Atomic Energy Agency (IAEA) program to identify potential and\nnovel technologies applicable to nonproliferation safeguards. Operating on the\nsurface presents challenges such as high noise rates, necessitating the\ndevelopment of very sensitive, yet small-scale detectors. These conditions make\nthe Angra experiment an excellent platform for both developing the application\nand gaining expertise in new technologies and analysis methods. The detector\nemploys a water-based target doped with gadolinium to enhance its sensitivity\nto antineutrinos. In this work, we describe the main features of the detector\nand the electronics chain, including front-end and data acquisition components.\nWe detail the data acquisition strategies and the methodologies applied for\nsignal processing and event selection. Preliminary physics results suggest that\nthe detector can reliably monitor reactor operations by detecting the inverse\nbeta decay induced by electron antineutrinos from the reactor.\n","subjects":["Physics/High Energy Physics - Experiment","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0mW28zTfvqminRa_vV2_AY0pTTW1uGJjIop6VSampCo","pdfSize":"1989709"}
