{"id":"2407.07112","title":"Doping dependence and multichannel mediators of superconductivity:\n  Calculations for a cuprate model","authors":"Fabian Schrodi, Alex Aperis, and Peter M. Oppeneer","authorsParsed":[["Schrodi","Fabian",""],["Aperis","Alex",""],["Oppeneer","Peter M.",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 09:51:14 GMT"}],"updateDate":"2024-07-12","timestamp":1719395474000,"abstract":"  We study two aspects of the superconductivity in a cuprate model system, its\ndoping dependence and the influence of competing pairing mediators. We first\ninclude electron-phonon interactions beyond Migdal's approximation and solve\nself-consistently, as a function of doping and for an isotropic electron-phonon\ncoupling, the full-bandwidth, anisotropic vertex-corrected Eliashberg equations\nunder a non-interacting state approximation for the vertex correction. Our\nresults show that such pairing interaction supports the experimentally observed\n$d_{x^2-y^2}$-wave symmetry of the superconducting gap, but only in a narrow\ndoping interval of the hole-doped system. Depending on the coupling strength,\nwe obtain realistic values for the gap magnitude and superconducting critical\ntemperature $T_c$ close to optimal doping, rendering the electron-phonon\nmechanism an important candidate for mediating superconductivity in this model\nsystem. Second, for a doping near optimal hole doping, we study multichannel\nsuperconductivity, by including both vertex-corrected electron-phonon\ninteraction and spin and charge fluctuations as pairing mechanisms. We find\nthat both mechanisms cooperate to support an unconventional $d$-wave symmetry\nof the order parameter, yet the electron-phonon interaction is mainly\nresponsible for the Cooper pairing and high critical temperature $T_c$. Spin\nfluctuations are found to have a suppressing effect on the gap magnitude and\ncritical temperature due to their repulsive interaction at small coupling wave\nvectors.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/"}