{"id":"2407.18479","title":"Multi-turn Response Selection with Commonsense-enhanced Language Models","authors":"Yuandong Wang, Xuhui Ren, Tong Chen, Yuxiao Dong, Nguyen Quoc Viet\n  Hung, Jie Tang","authorsParsed":[["Wang","Yuandong",""],["Ren","Xuhui",""],["Chen","Tong",""],["Dong","Yuxiao",""],["Hung","Nguyen Quoc Viet",""],["Tang","Jie",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 03:13:47 GMT"}],"updateDate":"2024-07-29","timestamp":1721963627000,"abstract":"  As a branch of advanced artificial intelligence, dialogue systems are\nprospering. Multi-turn response selection is a general research problem in\ndialogue systems. With the assistance of background information and pre-trained\nlanguage models, the performance of state-of-the-art methods on this problem\ngains impressive improvement. However, existing studies neglect the importance\nof external commonsense knowledge. Hence, we design a Siamese network where a\npre-trained Language model merges with a Graph neural network (SinLG). SinLG\ntakes advantage of Pre-trained Language Models (PLMs) to catch the word\ncorrelations in the context and response candidates and utilizes a Graph Neural\nNetwork (GNN) to reason helpful common sense from an external knowledge graph.\nThe GNN aims to assist the PLM in fine-tuning, and arousing its related\nmemories to attain better performance. Specifically, we first extract related\nconcepts as nodes from an external knowledge graph to construct a subgraph with\nthe context response pair as a super node for each sample. Next, we learn two\nrepresentations for the context response pair via both the PLM and GNN. A\nsimilarity loss between the two representations is utilized to transfer the\ncommonsense knowledge from the GNN to the PLM. Then only the PLM is used to\ninfer online so that efficiency can be guaranteed. Finally, we conduct\nextensive experiments on two variants of the PERSONA-CHAT dataset, which proves\nthat our solution can not only improve the performance of the PLM but also\nachieve an efficient inference.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}