{"id":"2407.11185","title":"Tides and traversability in gravastars and other related geometries","authors":"Cecilia Tomasini, Claudio Simeone and Emilio Rub\\'in de Celis","authorsParsed":[["Tomasini","Cecilia",""],["Simeone","Claudio",""],["de Celis","Emilio Rubín",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 19:16:28 GMT"}],"updateDate":"2024-07-17","timestamp":1721070988000,"abstract":"  Tidal effects related to the traversability across thin shells are examined\nin spherically symmetric geometries. We focus mainly on shells separating inner\nfrom outer regions of gravastars (de Sitter -- i.e., $\\Lambda>0$ -- interior\nand Schwarzschild exterior of mass parameter $M$), but we also examine other\nrelated geometries by including the possibility of a negative cosmological\nconstant and, besides, non trivial topologies where the shell separates two\nouter regions. The analysis is developed for radially traversing objects and\nfor tides in both radial and transverse directions, which present difficulties\nof somewhat different nature. Transverse tides are unavoidable across shells\nwhich satisfy the flare-out condition, while shells in trivial topologies, i.e.\ngeometries with one asymptotic region, are more indulgent with the issue of\ninsurmountable tides. Besides, contradicting other cases analyzed in previous\nworks, we find that large radial tides cannot be avoided when traveling across\nthe shell in the gravastar solution, but in non-trivial topologies they can. We\nstudy with special attention the traversability in practice of the transition\nlayer in the thin-shell gravastar solution. In particular, a finite object\nwhich traverses radially the shell in a gravastar with $\\sqrt{\\Lambda}\\ll 1/M$\nundergoes a compression effect in both the transverse and the radial directions\ndue to the tides associated to the thin layer. The results are interpreted in\nterms of the total momentum transfer obtained by integrating the travel time of\nthe object.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}