{"id":"2407.07163","title":"The YMCA (Yes, Magellanic Clouds Again) survey: probing the outer\n  regions of the Magellanic system with VST","authors":"Massimiliano Gatto, Vincenzo Ripepi, Michele Bellazzini, Monica Tosi,\n  Michele Cignoni, Crescenzo Tortora, Marcella Marconi, Massimo Dall'Ora,\n  Maria-Rosa L. Cioni, Ilaria Musella, Pietro Schipani, Marilena Spavone","authorsParsed":[["Gatto","Massimiliano",""],["Ripepi","Vincenzo",""],["Bellazzini","Michele",""],["Tosi","Monica",""],["Cignoni","Michele",""],["Tortora","Crescenzo",""],["Marconi","Marcella",""],["Dall'Ora","Massimo",""],["Cioni","Maria-Rosa L.",""],["Musella","Ilaria",""],["Schipani","Pietro",""],["Spavone","Marilena",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 18:01:31 GMT"}],"updateDate":"2024-07-11","timestamp":1720548091000,"abstract":"  The Magellanic Clouds (MCs) are the Milky Way's most massive dwarf\nsatellites. As they also represent the closest pair of galaxies in an ongoing\ntidal interaction, while simultaneously infalling into the Milky Way halo, they\nprovide a unique opportunity to study in detail an ongoing three-body\nencounter. We present the ``YMCA (Yes, Magellanic Clouds Again) survey: probing\nthe outer regions of the Magellanic system with VST'' based on deep optical\nphotometry carried out with the VLT Survey Telescope (VST). YMCA targeted 110\nsquare degrees, in the g and i filters, in the periphery of both the MCs,\nincluding a long strip in between the Large Magellanic Cloud (LMC) and the\nSmall Magellanic Cloud (SMC). The photometry of YMCA is sufficiently deep (50\\%\ncomplete down to $g \\simeq 23.5-24.0$~mag) to allow for a detailed analysis of\nmain-sequence stars in regions of the MCs remained relatively unexplored at\nthese faint magnitudes. The resulting colour-magnitude diagrams reveal that the\noutskirts of the MCs are predominantly characterized by intermediate-age and\nold stellar populations, with limited or negligible evidence of recent star\nformation. The analysis of the age distribution of star clusters (SCs) within\nthe surveyed area, both already known and newly discovered candidates, hints at\na close fly-by between the LMC and SMC that occurred $\\simeq 2.5-3.0$~Gyr ago,\nin agreement with previous results. We also report the discovery of candidate\nSCs with ages within the so-called ``age-gap'', questioning its real existence.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}