{"id":"2407.17803","title":"Automatic Data Labeling for Software Vulnerability Prediction Models:\n  How Far Are We?","authors":"Triet H. M. Le, M. Ali Babar","authorsParsed":[["Le","Triet H. M.",""],["Babar","M. Ali",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 06:22:25 GMT"}],"updateDate":"2024-07-26","timestamp":1721888545000,"abstract":"  Background: Software Vulnerability (SV) prediction needs large-sized and\nhigh-quality data to perform well. Current SV datasets mostly require expensive\nlabeling efforts by experts (human-labeled) and thus are limited in size.\nMeanwhile, there are growing efforts in automatic SV labeling at scale.\nHowever, the fitness of auto-labeled data for SV prediction is still largely\nunknown. Aims: We quantitatively and qualitatively study the quality and use of\nthe state-of-the-art auto-labeled SV data, D2A, for SV prediction. Method:\nUsing multiple sources and manual validation, we curate clean SV data from\nhuman-labeled SV-fixing commits in two well-known projects for investigating\nthe auto-labeled counterparts. Results: We discover that 50+% of the\nauto-labeled SVs are noisy (incorrectly labeled), and they hardly overlap with\nthe publicly reported ones. Yet, SV prediction models utilizing the noisy\nauto-labeled SVs can perform up to 22% and 90% better in Matthews Correlation\nCoefficient and Recall, respectively, than the original models. We also reveal\nthe promises and difficulties of applying noise-reduction methods for\nautomatically addressing the noise in auto-labeled SV data to maximize the data\nutilization for SV prediction. Conclusions: Our study informs the benefits and\nchallenges of using auto-labeled SVs, paving the way for large-scale SV\nprediction.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Fk9uZKWU4l3wsLfpPxz2fMgD_Sn24GNAQCDOz-FiHr8","pdfSize":"1110348"}
