{"id":"2407.15237","title":"Two eyes, Two views, and finally, One summary! Towards Multi-modal\n  Multi-tasking Knowledge-Infused Medical Dialogue Summarization","authors":"Anisha Saha, Abhisek Tiwari, Sai Ruthvik and Sriparna Saha","authorsParsed":[["Saha","Anisha",""],["Tiwari","Abhisek",""],["Ruthvik","Sai",""],["Saha","Sriparna",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 18:00:10 GMT"}],"updateDate":"2024-07-23","timestamp":1721584810000,"abstract":"  We often summarize a multi-party conversation in two stages: chunking with\nhomogeneous units and summarizing the chunks. Thus, we hypothesize that there\nexists a correlation between homogeneous speaker chunking and overall\nsummarization tasks. In this work, we investigate the effectiveness of a\nmulti-faceted approach that simultaneously produces summaries of medical\nconcerns, doctor impressions, and an overall view. We introduce a multi-modal,\nmulti-tasking, knowledge-infused medical dialogue summary generation\n(MMK-Summation) model, which is incorporated with adapter-based fine-tuning\nthrough a gated mechanism for multi-modal information integration. The model,\nMMK-Summation, takes dialogues as input, extracts pertinent external knowledge\nbased on the context, integrates the knowledge and visual cues from the\ndialogues into the textual content, and ultimately generates concise summaries\nencompassing medical concerns, doctor impressions, and a comprehensive\noverview. The introduced model surpasses multiple baselines and traditional\nsummarization models across all evaluation metrics (including human\nevaluation), which firmly demonstrates the efficacy of the knowledge-guided\nmulti-tasking, multimodal medical conversation summarization. The code is\navailable at https://github.com/NLP-RL/MMK-Summation.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-9eZra4VAEXBIpL3XorVqiy6J3U73aQZksc2p1_ikFw","pdfSize":"415810","objectId":"0x788986582e0dd76474bae8a993a7c5b4d99beac390b214fd7e9922551bd43d0d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
