{"id":"2407.20679","title":"Online Prediction-Assisted Safe Reinforcement Learning for Electric\n  Vehicle Charging Station Recommendation in Dynamically Coupled\n  Transportation-Power Systems","authors":"Qionghua Liao, Guilong Li, Jiajie Yu, Ziyuan Gu, Wei Ma","authorsParsed":[["Liao","Qionghua",""],["Li","Guilong",""],["Yu","Jiajie",""],["Gu","Ziyuan",""],["Ma","Wei",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 09:20:37 GMT"}],"updateDate":"2024-07-31","timestamp":1722331237000,"abstract":"  With the proliferation of electric vehicles (EVs), the transportation network\nand power grid become increasingly interdependent and coupled via charging\nstations. The concomitant growth in charging demand has posed challenges for\nboth networks, highlighting the importance of charging coordination. Existing\nliterature largely overlooks the interactions between power grid security and\ntraffic efficiency. In view of this, we study the en-route charging station\n(CS) recommendation problem for EVs in dynamically coupled transportation-power\nsystems. The system-level objective is to maximize the overall traffic\nefficiency while ensuring the safety of the power grid. This problem is for the\nfirst time formulated as a constrained Markov decision process (CMDP), and an\nonline prediction-assisted safe reinforcement learning (OP-SRL) method is\nproposed to learn the optimal and secure policy by extending the PPO method. To\nbe specific, we mainly address two challenges. First, the constrained\noptimization problem is converted into an equivalent unconstrained optimization\nproblem by applying the Lagrangian method. Second, to account for the uncertain\nlong-time delay between performing CS recommendation and commencing charging,\nwe put forward an online sequence-to-sequence (Seq2Seq) predictor for state\naugmentation to guide the agent in making forward-thinking decisions. Finally,\nwe conduct comprehensive experimental studies based on the Nguyen-Dupuis\nnetwork and a large-scale real-world road network, coupled with IEEE 33-bus and\nIEEE 69-bus distribution systems, respectively. Results demonstrate that the\nproposed method outperforms baselines in terms of road network efficiency,\npower grid safety, and EV user satisfaction. The case study on the real-world\nnetwork also illustrates the applicability in the practical context.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}