{"id":"2407.07539","title":"Machine Unlearning for Medical Imaging","authors":"Reza Nasirigerdeh, Nader Razmi, Julia A. Schnabel, Daniel Rueckert and\n  Georgios Kaissis","authorsParsed":[["Nasirigerdeh","Reza",""],["Razmi","Nader",""],["Schnabel","Julia A.",""],["Rueckert","Daniel",""],["Kaissis","Georgios",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 10:59:28 GMT"}],"updateDate":"2024-07-11","timestamp":1720609168000,"abstract":"  Machine unlearning is the process of removing the impact of a particular set\nof training samples from a pretrained model. It aims to fulfill the \"right to\nbe forgotten\", which grants the individuals such as patients the right to\nreconsider their contribution in models including medical imaging models. In\nthis study, we evaluate the effectiveness (performance) and computational\nefficiency of different unlearning algorithms in medical imaging domain. Our\nevaluations demonstrate that the considered unlearning algorithms perform well\non the retain set (samples whose influence on the model is allowed to be\nretained) and forget set (samples whose contribution to the model should be\neliminated), and show no bias against male or female samples. They, however,\nadversely impact the generalization of the model, especially for larger forget\nset sizes. Moreover, they might be biased against easy or hard samples, and\nneed additional computational overhead for hyper-parameter tuning. In\nconclusion, machine unlearning seems promising for medical imaging, but the\nexisting unlearning algorithms still needs further improvements to become more\npractical for medical applications.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"35_8lCVULX0WG1sb6UJOjEb2WmeUxgRDfDnzgeX-9Eg","pdfSize":"144494","objectId":"0x030d6f146bb100aa7e0fae5fdfc90631622eeab72e4f497420093713666e89a6","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
