{"id":"2407.01296","title":"Non-Hermitian skin effect in arbitrary dimensions: non-Bloch band theory\n  and classification","authors":"Yuncheng Xiong, Ze-Yu Xing, and Haiping Hu","authorsParsed":[["Xiong","Yuncheng",""],["Xing","Ze-Yu",""],["Hu","Haiping",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:49:53 GMT"}],"updateDate":"2024-07-02","timestamp":1719841793000,"abstract":"  Non-Hermitian skin effect (NHSE) is a distinctive phenomenon in non-Hermitian\nsystems, characterized by a significant accumulation of eigenstates at system\nboundaries. While well-understood in one dimension via non-Bloch band theory,\nunraveling the NHSE in higher dimensions faces formidable challenges due to the\ndiversity of open boundary conditions or lattice geometries and inevitable\nnumerical errors. Key issues, including higher-dimensional non-Bloch band\ntheory, geometric dependency, spectral convergence and stability, and a\ncomplete classification of NHSE, remain elusive. In this work, we address these\nchallenges by presenting a geometry-adaptive non-Bloch band theory in arbitrary\ndimensions, through the lens of spectral potential. Our formulation accurately\ndetermines the energy spectra, density of states, and generalized Brillouin\nzone for a given geometry in the thermodynamic limit (TDL), revealing their\ngeometric dependencies. Furthermore, we systematically classify the NHSE into\ncritical and non-reciprocal types using net winding numbers. In the critical\ncase, we identify novel scale-free skin modes residing on the boundary. In the\nnonreciprocal case, the skin modes manifest in various forms, including normal\nor anomalous corner modes, boundary modes or scale-free modes. We reveal the\nnon-convergence and instability of the non-Bloch spectra in the presence of\nscale-free modes and attribute it to the non-exchangeability of the\nzero-perturbation limit and the TDL. The instability drives the energy spectra\ntowards the Amoeba spectra in the critical case. Our findings provide a unified\nnon-Bloch band theory governing the energy spectra, density of states, and\ngeneralized Brillouin zone in the TDL, offering a comprehensive understanding\nof NHSE in arbitrary dimensions.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Quantum Gases","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Physics/Optics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Uyw_sQmgI5FygxoF0fM-213jm1iGprLPVxpLv0_tkEs","pdfSize":"11203109"}
