{"id":"2407.18367","title":"Robust Claim Verification Through Fact Detection","authors":"Nazanin Jafari, James Allan","authorsParsed":[["Jafari","Nazanin",""],["Allan","James",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 20:03:43 GMT"}],"updateDate":"2024-07-29","timestamp":1721937823000,"abstract":"  Claim verification can be a challenging task. In this paper, we present a\nmethod to enhance the robustness and reasoning capabilities of automated claim\nverification through the extraction of short facts from evidence. Our novel\napproach, FactDetect, leverages Large Language Models (LLMs) to generate\nconcise factual statements from evidence and label these facts based on their\nsemantic relevance to the claim and evidence. The generated facts are then\ncombined with the claim and evidence. To train a lightweight supervised model,\nwe incorporate a fact-detection task into the claim verification process as a\nmultitasking approach to improve both performance and explainability. We also\nshow that augmenting FactDetect in the claim verification prompt enhances\nperformance in zero-shot claim verification using LLMs. Our method demonstrates\ncompetitive results in the supervised claim verification model by 15% on the F1\nscore when evaluated for challenging scientific claim verification datasets. We\nalso demonstrate that FactDetect can be augmented with claim and evidence for\nzero-shot prompting (AugFactDetect) in LLMs for verdict prediction. We show\nthat AugFactDetect outperforms the baseline with statistical significance on\nthree challenging scientific claim verification datasets with an average of\n17.3% performance gain compared to the best performing baselines.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8OCAEbMsfz_3H6R-btexwr1XX-2Zs0FZwo7AN9v97Co","pdfSize":"1338681","objectId":"0xc71ddbb68cd8fbc74ea1f2825a1096d1967a00e7b7408b685db110ad7e0060a4","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
