{"id":"2407.08587","title":"Semantics-Aware Status Updates with Energy Harvesting Devices: Query\n  Version Age of Information","authors":"Erfan Delfani and Nikolaos Pappas","authorsParsed":[["Delfani","Erfan",""],["Pappas","Nikolaos",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 15:10:45 GMT"}],"updateDate":"2024-07-12","timestamp":1720710645000,"abstract":"  In this work, we study the freshness and significance of information in an\nIoT status update system where an Energy Harvesting (EH) device samples an\ninformation source and forwards the update packets to a destination node\nthrough a direct channel. We introduce and optimize a semantics-aware metric,\nQuery Version Age of Information (QVAoI), in the system along with other\nsemantic metrics: Query Age of Information (QAoI), Version Age of Information\n(VAoI), and Age of Information (AoI). By employing the MDP framework, we\nformulate the optimization problem and determine the optimal transmission\npolicies at the device, which involve deciding the time slots for updating,\nsubject to the energy limitations imposed by the device's battery and energy\narrivals. Through analytical and numerical results, we compare the performance\nof the semantics-aware QVAoI-Optimal, QAoI-Optimal, VoI-Optimal, and\nAoI-Optimal policies with a baseline greedy policy. All semantics-aware\npolicies show significantly improved performance compared to the greedy policy.\nThe QVAoI-Optimal policy, in particular, demonstrates a significant performance\nimprovement by either providing fresher, more relevant, and valuable updates\nwith the same amount of energy arrivals or reducing the number of transmissions\nin the system to maintain the same level of freshness and significance of\ninformation compared to the QAoI-Optimal and other policies.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Networking and Internet Architecture","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}