{"id":"2407.20837","title":"Simulating Radio Synchrotron Morphology, Spectra, and Polarization of\n  Cosmic Ray Driven Galactic Winds","authors":"H.-H. Sandy Chiu, Mateusz Ruszkowski, Timon Thomas, Maria Werhahn, and\n  Christoph Pfrommer","authorsParsed":[["Chiu","H. -H. Sandy",""],["Ruszkowski","Mateusz",""],["Thomas","Timon",""],["Werhahn","Maria",""],["Pfrommer","Christoph",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 14:08:22 GMT"}],"updateDate":"2024-07-31","timestamp":1722348502000,"abstract":"  The formation of galaxies is significantly influenced by galactic winds,\npossibly driven by cosmic rays due to their long cooling times and better\ncoupling to plasma compared to radiation. In this study, we compare the radio\nobservations of the edge-on galaxy NGC 4217 from the CHANG-ES collaboration\ncatalog with a mock observation of an isolated galaxy based on the arepo\nsimulation that adopts the state-of-the-art two-moment cosmic ray transport\ntreatment and multiphase interstellar medium model. We find significant\nagreement between the simulated and observed images and spectroscopic data.\nSpecifically, we find that (i) while the radio flux is sensitive to the\nmagnitude of the magnetic field, the shapes of intensity profiles are only\nweakly dependent on the normalization of the magnetic field and are robustly\npredicted by our galaxy simulations; (ii) the multi-wavelength spectrum above\n0.1~GHz is in agreement with the radio observations and its slope is also only\nweakly sensitive to the magnetic field strength; (iii) the magnetic field\ndirection exhibits an X-shaped morphology, often seen in edge-on galaxies,\nwhich is consistent with the observations and indicates the presence of a\ngalactic-scale outflow. Since the normalization of the intensity profiles and\nspectrum are degenerate with respect to the magnetic field strength and the\nnormalization of the electron spectrum, this qualitative match is possible\nprovided that the simulated magnetic field is only mildly boosted, which could\nbe attributed to the missing galactic disk interaction with the CGM in our\nidealized simulation. Our results highlight the importance of incorporating\nadvanced cosmic ray transport models in simulations and provide a deeper\nunderstanding of galactic wind dynamics and its impact on galaxy evolution.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}