{"id":"2407.17566","title":"Stellar Models are Reliable at Low Metallicity: An Asteroseismic Age for\n  the Ancient Very Metal-Poor Star KIC 8144907","authors":"Daniel Huber, Ditte Slumstrup, Marc Hon, Yaguang Li, Victor Aguirre\n  Borsen-Koch, Timothy R. Bedding, Meridith Joyce, J. M. Joel Ong, Aldo\n  Serenelli, Dennis Stello, Travis Berger, Samuel K. Grunblatt, Michael\n  Greklek-McKeon, Teruyuki Hirano, Evan N. Kirby, Marc H. Pinsonneault, Arthur\n  Alencastro Puls, Joel Zinn","authorsParsed":[["Huber","Daniel",""],["Slumstrup","Ditte",""],["Hon","Marc",""],["Li","Yaguang",""],["Borsen-Koch","Victor Aguirre",""],["Bedding","Timothy R.",""],["Joyce","Meridith",""],["Ong","J. M. Joel",""],["Serenelli","Aldo",""],["Stello","Dennis",""],["Berger","Travis",""],["Grunblatt","Samuel K.",""],["Greklek-McKeon","Michael",""],["Hirano","Teruyuki",""],["Kirby","Evan N.",""],["Pinsonneault","Marc H.",""],["Puls","Arthur Alencastro",""],["Zinn","Joel",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 18:00:12 GMT"}],"updateDate":"2024-07-26","timestamp":1721844012000,"abstract":"  Very metal-poor stars ([Fe/H]<-2) are important laboratories for testing\nstellar models and reconstructing the formation history of our galaxy.\nAsteroseismology is a powerful tool to probe stellar interiors and measure\nages, but few asteroseismic detections are known in very metal-poor stars and\nnone have allowed detailed modeling of oscillation frequencies. We report the\ndiscovery of a low-luminosity Kepler red giant (KIC 8144907) with high S/N\noscillations, [Fe/H]=-2.66+/-0.08 and [alpha/Fe]=0.38+/-0.06, making it by far\nthe most metal-poor star to date for which detailed asteroseismic modeling is\npossible. By combining the oscillation spectrum from Kepler with\nhigh-resolution spectroscopy we measure an asteroseismic mass and age of\n0.79+/-0.02(ran)+/-0.01(sys) Msun and 12.0+/-0.6(ran)+/-0.4(sys) Gyr, with\nremarkable agreement across different codes and input physics, demonstrating\nthat stellar models and asteroseismology are reliable for very metal-poor stars\nwhen individual frequencies are used. The results also provide a direct age\nanchor for the early formation of the Milky Way, implying that substantial star\nformation did not commence until redshift z~3 (if the star formed in-situ) or\nthat the Milky Way has undergone merger events for at least ~12 Gyr (if the\nstar was accreted by a dwarf satellite merger such as Gaia Enceladus).\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}