{"id":"2407.14480","title":"Signatures of composite dark matter in the Cosmic Microwave Background\n  spectral distortions","authors":"Anoma Ganguly, Rishi Khatri, Tuhin S. Roy","authorsParsed":[["Ganguly","Anoma",""],["Khatri","Rishi",""],["Roy","Tuhin S.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 17:33:45 GMT"}],"updateDate":"2024-07-22","timestamp":1721410425000,"abstract":"  We compute the spectral distortions of the Cosmic Microwave Background (CMB)\ncreated by an exotic process that extracts or injects photons of a particular\nfrequency into the CMB. Such signatures are a natural prediction of a class of\ncomposite dark matter models characterized by electrically neutral states but\nwith non-zero higher order electromagnetic moments. We consider a simplified\nmodel where dark matter exists as a two state system separated by a fixed\ntransition frequency, which can range from radio waves to gamma rays. The\nelectromagnetic transitions between the two states due to CMB photons give rise\nto thermal distortions, namely, the $\\mu$-type distortion in the redshift range\n$10^5\\lesssim z \\lesssim 2\\times 10^6$ and the $y$-type distortion as well as\nnon-thermal distortions at redshifts $z \\lesssim 10^5$. The nature of spectral\ndistortions depends sensitively on the dark matter transition frequency and the\nstrength of couplings of dark matter with visible sector particles as well as\nits self-interactions, thus opening a new window to probe the nature of dark\nmatter. Non-thermal distortions have unique spectral shapes making them\ndistinguishable from the standard $\\mu$ and $y$-type distortions and\npotentially detectable in the next-generation experiments such as Primordial\nInflation Explorer (PIXIE). We also find that the spectral distortion limits\nfrom the COsmic Background Explorer/Far-Infrared Absolute Spectrophotometer\n(COBE/FIRAS) already give a constraint on the electromagnetic coupling of dark\nmatter which is three orders of magnitude stronger compared to the current\ndirect detection limits for $\\sim$ MeV mass dark matter with transition energy\nin $\\sim 1$-$10$ eV range.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}