{"id":"2407.15615","title":"Vehicle-to-Everything: Looking into the Future of Flexibility Services","authors":"Omid Homaee, Chaimaa Essayeh, Vahid Vahidinasab, Ville Tikka, Goncalo\n  Mendes and Jim Fawcett","authorsParsed":[["Homaee","Omid",""],["Essayeh","Chaimaa",""],["Vahidinasab","Vahid",""],["Tikka","Ville",""],["Mendes","Goncalo",""],["Fawcett","Jim",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 13:23:49 GMT"}],"updateDate":"2024-07-23","timestamp":1721654629000,"abstract":"  The primary aim of this paper is to illuminate potential\nVehicle-to-Everything (V2X) flexibility services that can be activated at the\nthree levels of home, community, and grid. To do this, the potential practical\nservices that can be provided by EVs, flexibility requesters, and the required\nexchange mechanisms at these three levels are identified. At the home level,\nthe two main services that EVs can provide to households are explored. The\ninitial service focuses on cost reduction for homes by employing smart charging\nand discharging methods, and the second service underscores the capability of\nan EV equipped with bidirectional chargers to function as a backup resource\nduring grid outages. At the community level, three flexibility services are\nintroduced and outlined: community cost reduction, energy sharing, and backup\nresources. There is more than one flexibility requester, including the\ncommunity manager, EV owners, and other end users. Accordingly, at this level,\nhaving a fair and transparent market mechanism can optimise the activation of\ndifferent V2X flexibility services. At the grid level, flexibility providers\ncan offer two main flexibility services, namely load profile adjustment and\nreal-time voltage and frequency control, to a wide range of flexibility\nrequesters, including distribution network/systems operators (DNOs/DSOs) to\novercome technical challenges of the distribution network, energy suppliers to\nmanage their energy portfolio, and TSOs to support transmission network. In\naddition, a review of trial V2X projects and V2X supporting regulations is\npresented to contextualize the feasibility and regulatory framework for\nimplementing these services. This analysis offers insights into the challenges\nand opportunities that need to be addressed for the effective integration of\nV2X flexibility services across the three identified levels.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}