{"id":"2407.20252","title":"Power Measurement Enabled Channel Autocorrelation Matrix Estimation for\n  IRS-Assisted Wireless Communication","authors":"Ge Yan, Lipeng Zhu, Rui Zhang","authorsParsed":[["Yan","Ge",""],["Zhu","Lipeng",""],["Zhang","Rui",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 04:24:05 GMT"}],"updateDate":"2024-07-31","timestamp":1721449445000,"abstract":"  By reconfiguring wireless channels via passive signal reflection, intelligent\nreflecting surface (IRS) can bring significant performance enhancement for\nwireless communication systems. However, such performance improvement generally\nrelies on the knowledge of channel state information (CSI) for IRS-involved\nlinks. Prior works on IRS CSI acquisition mainly estimate IRS-cascaded channels\nbased on the extra pilot signals received at the users/base station (BS) with\ntime-varying IRS reflections, which, however, needs to modify the existing\nchannel training/estimation protocols of wireless systems. To address this\nissue, we propose in this paper a new channel estimation scheme for\nIRS-assisted communication systems based on the received signal power measured\nat the user terminal, which is practically attainable without the need of\nchanging the current protocol. Due to the lack of signal phase information in\nmeasured power, the autocorrelation matrix of the BS-IRS-user cascaded channel\nis estimated by solving an equivalent rank-minimization problem. To this end, a\nlow-rank-approaching (LRA) algorithm is proposed by employing the fractional\nprogramming and alternating optimization techniques. To reduce computational\ncomplexity, an approximate LRA (ALRA) algorithm is also developed. Furthermore,\nthese two algorithms are extended to be robust against the receiver noise and\nquantization error in power measurement. Simulation results are provided to\nverify the effectiveness of the proposed channel estimation algorithms as well\nas the IRS passive reflection design based on the estimated channel\nautocorrelation matrix.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Xy_kLsoKtlQv5TZn8MZEl_WjJGUk4F5nup5mJNJHnVo","pdfSize":"824631"}
