{"id":"2407.00884","title":"Mechanisms of mirror energy difference for states exhibiting\n  Thomas-Ehrman shift: Gamow shell model case studies of $^{18}$Ne/$^{18}$O and\n  $^{19}$Na/$^{19}$O","authors":"J.G. Li and K. H. Li and N. Michel and H. H. Li and W. Zuo","authorsParsed":[["Li","J. G.",""],["Li","K. H.",""],["Michel","N.",""],["Li","H. H.",""],["Zuo","W.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 01:08:19 GMT"}],"updateDate":"2024-07-02","timestamp":1719796099000,"abstract":"  The mirror energy difference (MED) of the mirror state, especially for states\nbearing the Thomas-Erhman shift, serves as a sensitive probe of isospin\nsymmetry breaking. We employ the Gamow shell model, which includes the\ninter-nucleon correlation and continuum coupling, to investigate the MED for\n$sd$-shell nuclei by taking the $^{18}$Ne/$^{18}$O and $^{19}$Na/$^{19}$O as\nexamples. Our GSM provides good descriptions for the excitation energies and\nMEDs for the $^{18}$Ne/$^{18}$O and $^{19}$Na/$^{19}$O. Moreover, our\ncalculations also reveal that the large MED of the mirror states is caused by\nthe significant occupation of the weakly bound or unbound $s_{1/2}$ waves,\ngiving the radial density distribution of the state in the proton-rich nucleus\nmore extended than that of mirror states in deeply-bound neutron-rich nuclei.\nFurthermore, our GSM calculation shows that the contribution of Coulomb is\ndifferent for the low-lying states in proton-rich nuclei, which significantly\ncontributes to MEDs of mirror states. Moreover, the contributions of the\nnucleon-nucleon interaction are different for the mirror state, especially for\nthe state of proton-rich nuclei bearing the Thomas-Erhman shift, which also\ncontributes to the significant isospin symmetry breaking with large MED.\n","subjects":["Physics/Nuclear Theory","Physics/Nuclear Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KT0Ta9AE82j3xPMNhcIhM23R5RbHrSlBzCfhEZTzQGM","pdfSize":"250159"}
