{"id":"2407.18487","title":"SMPISD-MTPNet: Scene Semantic Prior-Assisted Infrared Ship Detection\n  Using Multi-Task Perception Networks","authors":"Chen Hu, Xiaogang Dong, Yian Huang Lele Wang, Liang Xu, Tian Pu,\n  Zhenming Peng","authorsParsed":[["Hu","Chen",""],["Dong","Xiaogang",""],["Wang","Yian Huang Lele",""],["Xu","Liang",""],["Pu","Tian",""],["Peng","Zhenming",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 03:38:29 GMT"}],"updateDate":"2024-07-29","timestamp":1721965109000,"abstract":"  Infrared ship detection (IRSD) has received increasing attention in recent\nyears due to the robustness of infrared images to adverse weather. However, a\nlarge number of false alarms may occur in complex scenes. To address these\nchallenges, we propose the Scene Semantic Prior-Assisted Multi-Task Perception\nNetwork (SMPISD-MTPNet), which includes three stages: scene semantic\nextraction, deep feature extraction, and prediction. In the scene semantic\nextraction stage, we employ a Scene Semantic Extractor (SSE) to guide the\nnetwork by the features extracted based on expert knowledge. In the deep\nfeature extraction stage, a backbone network is employed to extract deep\nfeatures. These features are subsequently integrated by a fusion network,\nenhancing the detection capabilities across targets of varying sizes. In the\nprediction stage, we utilize the Multi-Task Perception Module, which includes\nthe Gradient-based Module and the Scene Segmentation Module, enabling precise\ndetection of small and dim targets within complex scenes. For the training\nprocess, we introduce the Soft Fine-tuning training strategy to suppress the\ndistortion caused by data augmentation. Besides, due to the lack of a publicly\navailable dataset labelled for scenes, we introduce the Infrared Ship Dataset\nwith Scene Segmentation (IRSDSS). Finally, we evaluate the network and compare\nit with state-of-the-art (SOTA) methods, indicating that SMPISD-MTPNet\noutperforms existing approaches. The source code and dataset for this research\ncan be accessed at https://github.com/greekinRoma/KMNDNet.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}