{"id":"2407.00225","title":"Large-scale, Independent and Comprehensive study of the power of LLMs\n  for test case generation","authors":"Wendk\\^uuni C. Ou\\'edraogo, Kader Kabor\\'e, Haoye Tian, Yewei Song,\n  Anil Koyuncu, Jacques Klein, David Lo, Tegawend\\'e F. Bissyand\\'e","authorsParsed":[["Ouédraogo","Wendkûuni C.",""],["Kaboré","Kader",""],["Tian","Haoye",""],["Song","Yewei",""],["Koyuncu","Anil",""],["Klein","Jacques",""],["Lo","David",""],["Bissyandé","Tegawendé F.",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 20:38:41 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 23:22:55 GMT"}],"updateDate":"2024-09-20","timestamp":1719607121000,"abstract":"  Unit testing, crucial for ensuring the reliability of code modules, such as\nclasses and methods, is often overlooked by developers due to time constraints.\nAutomated test generation techniques have emerged to address this, but they\nfrequently lack readability and require significant developer intervention.\nLarge Language Models (LLMs), such as GPT and Mistral, have shown promise in\nsoftware engineering tasks, including test generation, but their overall\neffectiveness remains unclear. This study presents an extensive investigation\nof LLMs, evaluating the effectiveness of four models and five prompt\nengineering techniques for unit test generation. We analyze 216 300 tests\ngenerated by the selected advanced instruct-tuned LLMs for 690 Java classes\ncollected from diverse datasets. Our evaluation considers correctness,\nunderstandability, coverage, and test smell detection in the generated tests,\ncomparing them to a widely used automated testing tool, EvoSuite. While LLMs\ndemonstrate potential, improvements in test quality particularly in reducing\ncommon test smells are necessary. This study highlights the strengths and\nlimitations of LLM-generated tests compared to traditional methods, paving the\nway for further research on LLMs in test automation.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"JLvJo_G9SNukn06Y3qVqHSBXz9nnBRFqblsM3TIu9ls","pdfSize":"2161502"}
