{"id":"2407.11292","title":"LoRA-PT: Low-Rank Adapting UNETR for Hippocampus Segmentation Using\n  Principal Tensor Singular Values and Vectors","authors":"Guanghua He, Wangang Cheng, Hancan Zhu and Gaohang Yu","authorsParsed":[["He","Guanghua",""],["Cheng","Wangang",""],["Zhu","Hancan",""],["Yu","Gaohang",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 00:40:57 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 03:02:47 GMT"}],"updateDate":"2024-07-22","timestamp":1721090457000,"abstract":"  The hippocampus is a crucial brain structure associated with various\npsychiatric disorders, and its automatic and precise segmentation is essential\nfor studying these diseases. In recent years, deep learning-based methods have\nmade significant progress in hippocampus segmentation. However, training deep\nneural network models requires substantial computational resources and time, as\nwell as a large amount of labeled training data, which is often difficult to\nobtain in medical image segmentation. To address this issue, we propose a new\nparameter-efficient fine-tuning method called LoRA-PT. This method transfers\nthe pre-trained UNETR model on the BraTS2021 dataset to the hippocampus\nsegmentation task. Specifically, the LoRA-PT method categorizes the parameter\nmatrix of the transformer structure into three sizes, forming three 3D tensors.\nThrough tensor singular value decomposition, these tensors are decomposed to\ngenerate low-rank tensors with the principal singular values and singular\nvectors, while the remaining singular values and vectors form the residual\ntensor. During the fine-tuning, we only update the low-rank tensors, i.e. the\nprincipal tensor singular values and vectors, while keeping the residual tensor\nunchanged. We validated the proposed method on three public hippocampus\ndatasets. Experimental results show that LoRA-PT outperforms existing\nparameter-efficient fine-tuning methods in segmentation accuracy while\nsignificantly reducing the number of parameter updates. Our code is available\nat https://github.com/WangangCheng/LoRA-PT/tree/LoRA-PT.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"QgVDTtpoX7KyatfdGvPWoO4qNhuneZ3nDaBuaTCrmF8","pdfSize":"1085980"}
