{"id":"2407.13247","title":"Into the depths: Unveiling ELAIS-N1 with LOFAR's deepest sub-arcsecond\n  wide-field images","authors":"J.M.G.H.J. de Jong, R.J. van Weeren, F. Sweijen, J.B.R. Oonk, T.W.\n  Shimwell, A.R. Offringa, L.K. Morabito, H.J.A. R\\\"ottgering, R. Kondapally,\n  E.L. Escott, P.N. Best, M. Bondi, H. Ye, J.W. Petley","authorsParsed":[["de Jong","J. M. G. H. J.",""],["van Weeren","R. J.",""],["Sweijen","F.",""],["Oonk","J. B. R.",""],["Shimwell","T. W.",""],["Offringa","A. R.",""],["Morabito","L. K.",""],["Röttgering","H. J. A.",""],["Kondapally","R.",""],["Escott","E. L.",""],["Best","P. N.",""],["Bondi","M.",""],["Ye","H.",""],["Petley","J. W.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:01:19 GMT"}],"updateDate":"2024-07-19","timestamp":1721289679000,"abstract":"  We present the deepest wide-field 115-166 MHz image at sub-arcsecond\nresolution spanning an area of 2.5 by 2.5 degrees centred at the ELAIS-N1 deep\nfield. To achieve this, we improved the calibration for the International LOFAR\nTelescope. This enhancement enabled us to efficiently process 32 hrs of data\nfrom four different 8-hr observations using the high-band antennas (HBAs) of\nall 52 stations, covering baselines up to approximately 2,000 km across Europe.\nThe DI calibration was improved by using an accurate sky model and refining the\nseries of calibration steps on the in-field calibrator, while the DD\ncalibration was improved by adopting a more automated approach for selecting\nthe DD calibrators and inspecting the self-calibration on these sources. We\nalso added an additional round of self-calibration for the Dutch core and\nremote stations in order to refine the solutions for shorter baselines. To\ncomplement our highest resolution at 0.3\", we also made intermediate resolution\nwide-field images at 0.6\" and 1.2\". Our resulting wide-field images achieve a\ncentral noise level of 14 muJy/beam at 0.3\", doubling the depth and uncovering\nfour times more objects than the Lockman Hole deep field image at comparable\nresolution but with only 8 hrs of data. Compared to LOFAR imaging without the\ninternational stations, we note that due to the increased collecting area and\nthe absence of confusion noise, we reached a point-source sensitivity\ncomparable to a 500-hr ELAIS-N1 6\" image with 16 times less observing time.\nImportantly, we have found that the computing costs for the same amount of data\nare almost halved (to about 139,000 CPU hrs per 8 hrs of data) compared to\nprevious efforts, though they remain high. Our work underscores the value and\nfeasibility of exploiting all Dutch and international LOFAR stations to make\ndeep wide-field images at sub-arcsecond resolution.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8g7f6ON0BV-RkuOEi3-cavk30CHR50D2j_XmQs1w5Uo","pdfSize":"31863949"}
