{"id":"2407.11023","title":"dAJC: A 2.02mW 50Mbps Direct Analog to MJPEG Converter for Video Sensor\n  Node using Low-Noise Switched Capacitor MAC-Quantizer with Auto-Calibration\n  and Sparsity-Aware ADC","authors":"Gourab Barik (1), Gaurav Kumar K (1), Baibhab Chatterjee (1 and 2),\n  Shovan Maity (3), Sumon Bose (3) and Shreyas Sen (1), ((1) Purdue University,\n  West Lafayette, USA, (2) University of Florida, Gainsville, USA, (3)\n  Quasistatics Inc. West Lafayette)","authorsParsed":[["Barik","Gourab","","1 and 2"],["K","Gaurav Kumar","","1 and 2"],["Chatterjee","Baibhab","","1 and 2"],["Maity","Shovan",""],["Bose","Sumon",""],["Sen","Shreyas",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 00:27:32 GMT"}],"updateDate":"2024-07-17","timestamp":1719880052000,"abstract":"  With the advancement in the field of the Internet of Things(IoT) and Internet\nof Bodies(IoB), video camera applications using Video Sensor Nodes(VSNs) have\ngained importance in the field of autonomous driving, health monitoring, robot\ncontrol, and security camera applications. However, these applications\ntypically involve high data rates due to the transmission of high-resolution\nvideo signals, resulting from high data volume generated from the\nanalog-to-digital converters (ADCs). This significant data deluge poses\nprocessing and storage overheads, exacerbating the problem. To address this\nchallenge, we propose a low-power solution aimed at reducing the power\nconsumption in Video Sensor Nodes (VSNs) by shifting the computation from the\ndigital domain to the inherently energy-efficient analog domain. Unlike\nstandard architectures where computation and processing are typically performed\nin digital signal processing (DSP) blocks after the ADCs, our approach\neliminates the need for such blocks. Instead, we leverage a switched\ncapacitor-based computation unit in the analog domain, resulting in a reduction\nin power consumption. We achieve a $\\sim4X$ reduction in power consumption\ncompared to digital implementations. Furthermore, we employ a sparsity-aware\nADC, which is enabled only for significant compressed samples that contribute\nto a small fraction ($\\le5\\%$) of the total captured analog samples, we achieve\na $\\sim20X$ lower ADC conversion energy without any considerable degradation,\ncontributing to the overall energy savings in the system.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}