{"id":"2407.04154","title":"Liouville theorems and universal estimates for superlinear elliptic\n  problems without scale invariance","authors":"Pavol Quittner, Philippe Souplet","authorsParsed":[["Quittner","Pavol",""],["Souplet","Philippe",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 21:06:34 GMT"}],"updateDate":"2024-07-08","timestamp":1720127194000,"abstract":"  We give applications of known and new Liouville type theorems to universal\nsingularity and decay estimates for non scale invariant elliptic problems,\nincluding Lane-Emden and Schr\\\"odinger type systems. This applies to various\nclasses of nonlinearities with regular variation and possibly different\nbehaviors at $0$ and $\\infty$. To this end, we adapt the method from [72] to\nelliptic systems, which relies on a generalized rescaling technique and on\ndoubling arguments from [55].\n  This is in particular facilitated by new Liouville type theorems in the whole\nspace and in a half-space, for elliptic problems without scale invariance, that\nwe obtain. Our results apply to some non-cooperative systems, for which maximum\nprinciple based techniques such as moving planes do not apply. To prove these\nLiouville type theorems, we employ two methods, respectively based on\nPohozaev-type identities combined with functional inequalities on the unit\nsphere, and on reduction to a scalar equation by proportionality of components.\n  In turn we will survey the existing methods for proving Liouville-type\ntheorems for superlinear elliptic equations and systems, and list some of the\ntypical existing results for (Sobolev subcritical) systems.\n  In the case of scalar equations, we also revisit the classical Gidas-Spruck\nintegral Bernstein method, providing some improvements which turn out to be\nefficient for certain nonlinearities, and we next compare the performances of\nvarious methods on a benchmark example.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}