{"id":"2407.18100","title":"DINOv2 Rocks Geological Image Analysis: Classification, Segmentation,\n  and Interpretability","authors":"Florent Brondolo and Samuel Beaussant","authorsParsed":[["Brondolo","Florent",""],["Beaussant","Samuel",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 15:03:36 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 08:53:54 GMT"},{"version":"v3","created":"Thu, 12 Sep 2024 16:32:48 GMT"}],"updateDate":"2024-09-13","timestamp":1721919816000,"abstract":"  Recent advancements in computer vision have significantly improved image\nanalysis tasks. Yet, deep learning models often struggle when applied to\ndomains outside their training distribution, such as in geosciences, where\ndomain-specific data can be scarce. This study investigates the classification,\nsegmentation, and interpretability of CT-scan images of rock samples, focusing\non the application of modern computer vision techniques to geoscientific tasks.\nWe compare a range of segmentation methods to assess their efficacy,\nefficiency, and adaptability in geological image analysis. The methods\nevaluated include Otsu thresholding, clustering techniques (K-means, fuzzy\nC-means), a supervised machine learning approach (Random Forest), and deep\nlearning models (UNet, ResNet152, and DINOv2), using ten binary sandstone\ndatasets and three multi-class calcite datasets. DINOv2 was selected for its\npromising results in feature extraction and its potential applicability in\ngeoscientific tasks, prompting further assessment of its interpretability and\neffectiveness in processing CT-scanned rock data. For classification, a\nnon-fine-tuned DINOv2 demonstrates strong performance in classifying rock\nimages, even when the CT-scans are outside its original training set. In\nsegmentation tasks, thresholding and clustering techniques, though\ncomputationally efficient, produce subpar results despite preprocessing\nefforts. In contrast, supervised methods achieve better performance. While deep\nlearning methods demand greater computational resources, they require minimal\nintervention and offer superior generalization. A LoRA fine-tuned DINOv2, in\nparticular, excels in out-of-distribution segmentation and outperforms other\nmethods in multi-class tasks, even with limited data. Notably, the segmentation\nmasks generated by DINOv2 often appear more accurate than the original targets,\nbased on visual inspection.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}