{"id":"2407.19742","title":"Proving the absence of large one-loop corrections to the power spectrum\n  of curvature perturbations in transient ultra-slow-roll inflation within the\n  path-integral approach","authors":"Ryodai Kawaguchi, Shinji Tsujikawa, and Yusuke Yamada","authorsParsed":[["Kawaguchi","Ryodai",""],["Tsujikawa","Shinji",""],["Yamada","Yusuke",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 07:09:10 GMT"}],"updateDate":"2024-07-30","timestamp":1722236950000,"abstract":"  We revisit one-loop corrections to the power spectrum of curvature\nperturbations $\\zeta$ in an inflationary scenario containing a transient\nultra-slow-roll (USR) period. In Ref.[1], it was argued that one-loop\ncorrections to the power spectrum of $\\zeta$ can be larger than the tree-level\none within the parameter region generating the seeds of primordial black holes\nduring the USR epoch, which implies the breakdown of perturbation theory. We\nprove that this is not the case by using a master formula for one-loop\ncorrections to the power spectrum obtained in Ref.[2]. We derive the same\nformula within the path-integral formalism, which is simpler than the original\nderivation in [2]. To show the smallness of one-loop corrections, the\nconsistency relations and the effective constancy of tree-level mode functions\nof $\\zeta$ for super-Hubble modes play essential roles, with which the master\nformula gives a simple expression for one-loop corrections. For concreteness,\nwe provide a reduced set of interactions including the leading-order one, while\nestablishing the consistency relations in a self-consistent manner. We also\nshow how the consistency relations of various operators hold explicitly, which\nplays a key role in proving the absence of large one-loop corrections.\n","subjects":["Physics/High Energy Physics - Theory","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lzx05mpixKljxe1RiseA_S_MpOhkcrbfHq5D-ycZBw8","pdfSize":"1245563"}
