{"id":"2407.12583","title":"eROSITA (eRASS1) study of the Canis Major overdensity: Developing a\n  multi-wavelength algorithm for classifying faint X-ray sources","authors":"Sara Saeedi, Manami Sasaki, Jonathan Knies, Jan Robrade, Theresa\n  Heindl, Aafia Zainab, Steven H\\\"ammerich, Martin Reh, Joern Wilms","authorsParsed":[["Saeedi","Sara",""],["Sasaki","Manami",""],["Knies","Jonathan",""],["Robrade","Jan",""],["Heindl","Theresa",""],["Zainab","Aafia",""],["Hämmerich","Steven",""],["Reh","Martin",""],["Wilms","Joern",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:09:52 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 10:21:29 GMT"},{"version":"v3","created":"Fri, 9 Aug 2024 11:04:53 GMT"}],"updateDate":"2024-08-12","timestamp":1721225392000,"abstract":"  Using the data of eROSITA (extended Roentgen Survey with an Imaging Telescope\nArray) on board Spektrum-Roentgen-Gamma (Spektr-RG, SRG) taken during the first\neROSITA all-sky survey (eRASS1), we perform the first X-ray classification and\npopulation study in the field of Canis Major overdensity (CMa OD), which is an\nelliptical-shaped stellar overdensity located at l = -240, b = -80. The study\naims to identify the X-ray sources in CMa OD. For this purpose, we developed a\nclassification algorithm using multi-wavelength criteria as a preliminary\nmethod for the classification of faint X-ray sources, specifically in regions\nwith a high source number density. Out of a total number of 8311 X-ray sources,\nwe have classified 1029 sources as Galactic stars and binaries in the\nforeground, 946 sources as active galactic nuclei (AGN) and galaxies in the\nbackground, and 435 sources with stellar counterparts, which can belong to\neither the MW or CMa OD. Among the sources with a stellar counterpart, we have\nidentified 34 symbiotic star candidates, plus 335 sources, of which the\ninfrared counterparts have properties of M-giants in CMa OD. Moreover, there is\na known high-mass X-ray binary (HMXB, 4U 0728-25) in the field of our study,\nwhich, according to the Gaia parallax of its companion, seems to be a member of\nCMa OD. There is also a recently detected transient low-mass X-ray binary\n(LMXB, SRGt J071522.1-191609), which can be a member of CMa OD based on its\ncompanion that is most likely highly absorbed and is thus located behind the\nGalactic disk. In addition, we present the X-ray luminosity function (XLF) of\nmembers and candidate members of CMa OD. It is dominated by sources with\nluminosities of < 2*10^32-10^33 erg/s in the energy range of 0.2-2.3 keV, which\nare expected to be either accreting white dwarfs or quiescent LMXBs.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}