{"id":"2407.02519","title":"Anvil: An integration of artificial intelligence, sampling techniques,\n  and a combined CAD-CFD tool","authors":"Harsh Vardhan, Umesh Timalsina, Michael Sandborn, David Hyde, Peter\n  Volgyesi, Janos Sztipanovits","authorsParsed":[["Vardhan","Harsh",""],["Timalsina","Umesh",""],["Sandborn","Michael",""],["Hyde","David",""],["Volgyesi","Peter",""],["Sztipanovits","Janos",""]],"versions":[{"version":"v1","created":"Mon, 24 Jun 2024 15:29:22 GMT"}],"updateDate":"2024-07-04","timestamp":1719242962000,"abstract":"  In this work, we introduce an open-source integrated CAD-CFD tool, Anvil,\nwhich combines FreeCAD for CAD modeling and OpenFOAM for CFD analysis, along\nwith an AI-based optimization method (Bayesian optimization) and other sampling\nalgorithms. Anvil serves as a scientific machine learning tool for shape\noptimization in three modes: data generation, CFD evaluation, and shape\noptimization. In data generation mode, it automatically runs CFD evaluations\nand generates data for training a surrogate model. In optimization mode, it\nsearches for the optimal design under given requirements and optimization\nmetrics. In CFD mode, a single CAD file can be evaluated with a single OpenFOAM\nrun. To use Anvil, experimenters provide a JSON configuration file and a\nparametric CAD seed design. Anvil can be used to study solid-fluid dynamics for\nany subsonic flow conditions and has been demonstrated in various simulation\nand optimization use cases. The open-source code for the tool, installation\nprocess, artifacts (such as CAD seed designs and example STL models),\nexperimentation results, and detailed documentation can be found at\n\\url{https://github.com/symbench/Anvil}.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/"}