{"id":"2407.14553","title":"Machine Learning for Improved Current Density Reconstruction from 2D\n  Vector Magnetic Images","authors":"Niko R. Reed, Danyal Bhutto, Matthew J. Turner, Declan M. Daly, Sean\n  M. Oliver, Jiashen Tang, Kevin S. Olsson, Nicholas Langellier, Mark J.H. Ku,\n  Matthew S. Rosen, Ronald L. Walsworth","authorsParsed":[["Reed","Niko R.",""],["Bhutto","Danyal",""],["Turner","Matthew J.",""],["Daly","Declan M.",""],["Oliver","Sean M.",""],["Tang","Jiashen",""],["Olsson","Kevin S.",""],["Langellier","Nicholas",""],["Ku","Mark J. H.",""],["Rosen","Matthew S.",""],["Walsworth","Ronald L.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 05:22:39 GMT"},{"version":"v2","created":"Sun, 4 Aug 2024 03:12:35 GMT"}],"updateDate":"2024-08-19","timestamp":1721280159000,"abstract":"  The reconstruction of electrical current densities from magnetic field\nmeasurements is an important technique with applications in materials science,\ncircuit design, quality control, plasma physics, and biology. Analytic\nreconstruction methods exist for planar currents, but break down in the\npresence of high spatial frequency noise or large standoff distance,\nrestricting the types of systems that can be studied. Here, we demonstrate the\nuse of a deep convolutional neural network for current density reconstruction\nfrom two-dimensional (2D) images of vector magnetic fields acquired by a\nquantum diamond microscope (QDM) utilizing a surface layer of Nitrogen Vacancy\n(NV) centers in diamond. Trained network performance significantly exceeds\nanalytic reconstruction for data with high noise or large standoff distances.\nThis machine learning technique can perform quality inversions on lower SNR\ndata, reducing the data collection time by a factor of about 400 and permitting\nreconstructions of weaker and three-dimensional current sources.\n","subjects":["Physics/Computational Physics","Physics/Applied Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}