{"id":"2407.00402","title":"Is It Really Long Context if All You Need Is Retrieval? Towards\n  Genuinely Difficult Long Context NLP","authors":"Omer Goldman, Alon Jacovi, Aviv Slobodkin, Aviya Maimon, Ido Dagan,\n  Reut Tsarfaty","authorsParsed":[["Goldman","Omer",""],["Jacovi","Alon",""],["Slobodkin","Aviv",""],["Maimon","Aviya",""],["Dagan","Ido",""],["Tsarfaty","Reut",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 11:09:47 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 11:17:09 GMT"}],"updateDate":"2024-07-12","timestamp":1719659387000,"abstract":"  Improvements in language models' capabilities have pushed their applications\ntowards longer contexts, making long-context evaluation and development an\nactive research area. However, many disparate use-cases are grouped together\nunder the umbrella term of \"long-context\", defined simply by the total length\nof the model's input, including - for example - Needle-in-a-Haystack tasks,\nbook summarization, and information aggregation. Given their varied difficulty,\nin this position paper we argue that conflating different tasks by their\ncontext length is unproductive. As a community, we require a more precise\nvocabulary to understand what makes long-context tasks similar or different. We\npropose to unpack the taxonomy of long-context based on the properties that\nmake them more difficult with longer contexts. We propose two orthogonal axes\nof difficulty: (I) Diffusion: How hard is it to find the necessary information\nin the context? (II) Scope: How much necessary information is there to find? We\nsurvey the literature on long-context, provide justification for this taxonomy\nas an informative descriptor, and situate the literature with respect to it. We\nconclude that the most difficult and interesting settings, whose necessary\ninformation is very long and highly diffused within the input, is severely\nunder-explored. By using a descriptive vocabulary and discussing the relevant\nproperties of difficulty in long-context, we can implement more informed\nresearch in this area. We call for a careful design of tasks and benchmarks\nwith distinctly long context, taking into account the characteristics that make\nit qualitatively different from shorter context.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}