{"id":"2407.18675","title":"A dual ensemble classifier used to recognise contaminated multi-channel\n  EMG and MMG signals in the control of upper limb bioprosthesis","authors":"Pawel Trajdos, Marek Kurzynski","authorsParsed":[["Trajdos","Pawel",""],["Kurzynski","Marek",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 11:36:05 GMT"}],"updateDate":"2024-07-29","timestamp":1721993765000,"abstract":"  Myopotential pattern recognition to decode the intent of the user is the most\nadvanced approach to controlling a powered bioprosthesis. Unfortunately, many\nfactors make this a difficult problem and achieving acceptable recognition\nquality in real-word conditions is a serious challenge. The aim of the paper is\nto develop a recognition system that will mitigate factors related to\nmultimodality and multichannel recording of biosignals and their high\nsusceptibility to contamination. The proposed method involves the use of two\nco-operating multiclassifier systems. The first system is composed of one-class\nclassifiers related to individual electromyographic (EMG) and mechanomyographic\n(MMG) biosignal recording channels, and its task is to recognise contaminated\nchannels. The role of the second system is to recognise the class of movement\nresulting from the patient's intention. The ensemble system consists of base\nclassifiers using the representation (extracted features) of biosignals from\ndifferent channels. The system uses a dynamic selection mechanism, eliminating\nthose base classifiers that are associated with biosignal channels that are\nrecognised by the one-class ensemble system as being contaminated. Experimental\nstudies were conducted using signals from an able-bodied person with simulation\nof amputation. The results obtained allow us to reject the null hypothesis that\nthe application of the dual ensemble foes not lead to improved classification\nquality.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"IYWBws45vSW_8woM3abrUSmD7oMfu6_4qMit5GQfQXg","pdfSize":"457946","objectId":"0xba204b4b40033f340a8f32401206a4748cc2b024540dc4dea90022c1667f884e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
