{"id":"2407.04271","title":"Variational Partial Group Convolutions for Input-Aware Partial\n  Equivariance of Rotations and Color-Shifts","authors":"Hyunsu Kim, Yegon Kim, Hongseok Yang, Juho Lee","authorsParsed":[["Kim","Hyunsu",""],["Kim","Yegon",""],["Yang","Hongseok",""],["Lee","Juho",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 05:52:51 GMT"}],"updateDate":"2024-07-08","timestamp":1720158771000,"abstract":"  Group Equivariant CNNs (G-CNNs) have shown promising efficacy in various\ntasks, owing to their ability to capture hierarchical features in an\nequivariant manner. However, their equivariance is fixed to the symmetry of the\nwhole group, limiting adaptability to diverse partial symmetries in real-world\ndatasets, such as limited rotation symmetry of handwritten digit images and\nlimited color-shift symmetry of flower images. Recent efforts address this\nlimitation, one example being Partial G-CNN which restricts the output group\nspace of convolution layers to break full equivariance. However, such an\napproach still fails to adjust equivariance levels across data. In this paper,\nwe propose a novel approach, Variational Partial G-CNN (VP G-CNN), to capture\nvarying levels of partial equivariance specific to each data instance. VP G-CNN\nredesigns the distribution of the output group elements to be conditioned on\ninput data, leveraging variational inference to avoid overfitting. This enables\nthe model to adjust its equivariance levels according to the needs of\nindividual data points. Additionally, we address training instability inherent\nin discrete group equivariance models by redesigning the reparametrizable\ndistribution. We demonstrate the effectiveness of VP G-CNN on both toy and\nreal-world datasets, including MNIST67-180, CIFAR10, ColorMNIST, and\nFlowers102. Our results show robust performance, even in uncertainty metrics.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}