{"id":"2407.04941","title":"Spindown of Pulsars Interacting with Companion Winds: Impact of\n  Magnetospheric Compression","authors":"Yici Zhong, Anatoly Spitkovsky, Jens F. Mahlmann, Hayk Hakobyan","authorsParsed":[["Zhong","Yici",""],["Spitkovsky","Anatoly",""],["Mahlmann","Jens F.",""],["Hakobyan","Hayk",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 03:16:08 GMT"}],"updateDate":"2024-07-09","timestamp":1720235768000,"abstract":"  The presence of a companion wind in neutron star binary systems can form a\ncontact discontinuity well within the pulsar's light cylinder, effectively\ncreating a waveguide that confines the pulsar's electromagnetic fields and\nsignificantly alters its spindown. We parametrize this confinement as the ratio\nbetween the equatorial position of the contact discontinuity (or standoff\ndistance) $R_\\mathrm{m}$ and the pulsar's light cylinder $R_\\mathrm{LC}$. We\nquantify the pulsar spindown for relativistic wind envelopes with\n$R_\\mathrm{m}/R_\\mathrm{LC} = 1/3...1$ and varying inclination angles $\\chi$\nbetween magnetic and rotation axes using particle-in-cell simulations. Our\nstrongly confined models ($R_\\mathrm{m}/R_\\mathrm{LC} = 1/3$) identify two\ndistinct limits. For $\\chi=0^\\circ$, the spindown induced by the compressed\npulsar magnetosphere is enhanced by approximately three times compared to an\nisolated pulsar due to an increased number of open magnetic field lines.\nConversely, for $\\chi=90^\\circ$, the compressed system spins down at less than\n$40\\%$ of the rate of an isolated reference pulsar due to the mismatch between\nthe pulsar wind stripe wavelength and the waveguide size. We directly apply our\nanalysis to the 2.77-second period oblique rotator ($\\chi=60^\\circ$) in the\ndouble pulsar system PSR J0737-3039. With the numerically derived spindown\nestimate, we constrain its surface magnetic field to $B_* \\approx (7.3 \\pm 0.2)\n\\times 10^{11}$ G. We discuss the time modulation of its period derivative, the\neffects of compression on its braking index, and implications for the radio\neclipse in PSR J0737-3039.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ti2V1-c_e0f6BQqfj6MK6GrS81TEG2ZWDt9vb_pyJ-A","pdfSize":"5228022"}
