{"id":"2407.14256","title":"Obfuscated Location Disclosure for Remote ID Enabled Drones","authors":"Alessandro Brighente, Mauro Conti, Matthijs Schotsman, Savio\n  Sciancalepore","authorsParsed":[["Brighente","Alessandro",""],["Conti","Mauro",""],["Schotsman","Matthijs",""],["Sciancalepore","Savio",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 12:35:49 GMT"}],"updateDate":"2024-07-22","timestamp":1721392549000,"abstract":"  The Remote ID (RID) regulation recently introduced by several aviation\nauthorities worldwide (including the US and EU) forces commercial drones to\nregularly (max. every second) broadcast plaintext messages on the wireless\nchannel, providing information about the drone identifier and current location,\namong others. Although these regulations increase the accountability of drone\noperations and improve traffic management, they allow malicious users to track\ndrones via the disclosed information, possibly leading to drone capture and\nsevere privacy leaks. In this paper, we propose Obfuscated Location disclOsure\nfor RID-enabled drones (OLO-RID), a solution modifying and extending the RID\nregulation while preserving drones' location privacy. Rather than disclosing\nthe actual drone's location, drones equipped with OLO-RID disclose a\ndifferentially private obfuscated location in a mobile scenario. OLO-RID also\nextends RID messages with encrypted location information, accessible only by\nauthorized entities and valuable to obtain the current drone's location in\nsafety-critical use cases. We design, implement, and deploy OLO-RID on a\nRaspberry Pi 3 and release the code of our implementation as open-source. We\nalso perform an extensive performance assessment of the runtime overhead of our\nsolution in terms of processing, communication, memory, and energy consumption.\nWe show that OLO-RID can generate RID messages on a constrained device in less\nthan 0.16 s while also requiring a minimal energy toll on a relevant device\n(0.0236% of energy for a DJI Mini 2). We also evaluate the utility of the\nproposed approach in the context of three reference use cases involving the\ndrones' location usage, demonstrating minimal performance degradation when\ntrading off location privacy and utility for next-generation RID-compliant\ndrone ecosystems.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"DL5cnaR3tYOFyA0WFb_vSg8bACkzFL17UpI9yO576Nw","pdfSize":"1867645","objectId":"0x9068768de507fe4e7123a27bf46565aaad8f4b2753f151bd0d6f615d3843c8b5","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
