{"id":"2407.21053","title":"Knowledge Models for Cancer Clinical Practice Guidelines : Construction,\n  Management and Usage in Question Answering","authors":"Pralaypati Ta, Bhumika Gupta, Arihant Jain, Sneha Sree C, Keerthi Ram,\n  Mohanasankar Sivaprakasam","authorsParsed":[["Ta","Pralaypati",""],["Gupta","Bhumika",""],["Jain","Arihant",""],["C","Sneha Sree",""],["Ram","Keerthi",""],["Sivaprakasam","Mohanasankar",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 11:26:40 GMT"}],"updateDate":"2024-08-01","timestamp":1721734000000,"abstract":"  An automated knowledge modeling algorithm for Cancer Clinical Practice\nGuidelines (CPGs) extracts the knowledge contained in the CPG documents and\ntransforms it into a programmatically interactable, easy-to-update structured\nmodel with minimal human intervention. The existing automated algorithms have\nminimal scope and cannot handle the varying complexity of the knowledge content\nin the CPGs for different cancer types. This work proposes an improved\nautomated knowledge modeling algorithm to create knowledge models from the\nNational Comprehensive Cancer Network (NCCN) CPGs in Oncology for different\ncancer types. The proposed algorithm has been evaluated with NCCN CPGs for four\ndifferent cancer types. We also proposed an algorithm to compare the knowledge\nmodels for different versions of a guideline to discover the specific changes\nintroduced in the treatment protocol of a new version. We created a\nquestion-answering (Q&A) framework with the guideline knowledge models as the\naugmented knowledge base to study our ability to query the knowledge models. We\ncompiled a set of 32 question-answer pairs derived from two reliable data\nsources for the treatment of Non-Small Cell Lung Cancer (NSCLC) to evaluate the\nQ&A framework. The framework was evaluated against the question-answer pairs\nfrom one data source, and it can generate the answers with 54.5% accuracy from\nthe treatment algorithm and 81.8% accuracy from the discussion part of the NCCN\nNSCLC guideline knowledge model.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}