{"id":"2407.00046","title":"Barrier-Augmented Lagrangian for GPU-based Elastodynamic Contact","authors":"Dewen Guo, Minchen Li, Yin Yang, Guoping Wang, Sheng Li","authorsParsed":[["Guo","Dewen",""],["Li","Minchen",""],["Yang","Yin",""],["Wang","Guoping",""],["Li","Sheng",""]],"versions":[{"version":"v1","created":"Tue, 4 Jun 2024 16:22:23 GMT"}],"updateDate":"2024-07-02","timestamp":1717518143000,"abstract":"  We propose a GPU-based iterative method for accelerated elastodynamic\nsimulation with the log-barrier-based contact model. While Newton's method is a\nconventional choice for solving the interior-point system, the presence of\nill-conditioned log barriers often necessitates a direct solution at each\nlinearized substep and costs substantial storage and computational overhead.\nMoreover, constraint sets that vary in each iteration present additional\nchallenges in algorithm convergence. Our method employs a novel\nbarrier-augmented Lagrangian method to improve system conditioning and solver\nefficiency by adaptively updating an augmentation constraint sets. This enables\nthe utilization of a scalable, inexact Newton-PCG solver with sparse GPU\nstorage, eliminating the need for direct factorization. We further enhance PCG\nconvergence speed with a domain-decomposed warm start strategy based on an\neigenvalue spectrum approximated through our in-time assembly. Demonstrating\nsignificant scalability improvements, our method makes simulations previously\nimpractical on 128 GB of CPU memory feasible with only 8 GB of GPU memory and\norders-of-magnitude faster. Additionally, our method adeptly handles stiff\nproblems, surpassing the capabilities of existing GPU-based interior-point\nmethods. Our results, validated across various complex collision scenarios\ninvolving intricate geometries and large deformations, highlight the\nexceptional performance of our approach.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}