{"id":"2407.20074","title":"FAUST. XVIII. Evidence for annular substructure in a very young Class 0\n  disk","authors":"M. J. Maureira, J. E. Pineda, H. B. Liu, L. Testi, D. Segura-Cox, C.\n  Chandler, D. Johnstone, P. Caselli, G. Sabatini, Y. Aikawa, E. Bianchi, C.\n  Codella, N. Cuello, D. Fedele, R. Friesen, L. Loinard, L. Podio, C.\n  Ceccarelli, N. Sakai, and S. Yamamoto","authorsParsed":[["Maureira","M. J.",""],["Pineda","J. E.",""],["Liu","H. B.",""],["Testi","L.",""],["Segura-Cox","D.",""],["Chandler","C.",""],["Johnstone","D.",""],["Caselli","P.",""],["Sabatini","G.",""],["Aikawa","Y.",""],["Bianchi","E.",""],["Codella","C.",""],["Cuello","N.",""],["Fedele","D.",""],["Friesen","R.",""],["Loinard","L.",""],["Podio","L.",""],["Ceccarelli","C.",""],["Sakai","N.",""],["Yamamoto","S.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:01:44 GMT"}],"updateDate":"2024-09-04","timestamp":1722265304000,"abstract":"  When the planet formation process begins in the disks surrounding young stars\nis still an open question. Annular substructures such as rings and gaps in\ndisks are intertwined with planet formation, and thus their presence or absence\nis commonly used to investigate the onset of this process. Current observations\nshow a limited number of disks surrounding protostars exhibiting annular\nsubstructures, all of them in the Class I stage. The lack of observed features\nin most of these sources may indicate a late emergence of substructures, but it\ncould also be an artifact of these disks being optically thick. To mitigate the\nproblem of optical depth, we investigate substructures within a very young\nClass 0 disk characterized by a low inclination using observations at longer\nwavelengths. We use 3 mm ALMA observations tracing dust emission at a\nresolution of 7 au to search for evidence of annular substructures in the disk\naround the deeply embedded Class 0 protostar Oph A SM1. The observations reveal\na nearly face-on disk (i$\\sim$16$^{\\circ}$) extending up to 40 au. The radial\nintensity profile shows a clear deviation from a smooth profile near 30 au,\nwhich we interpret as the presence of either a gap at 28 au or a ring at 34 au\nwith Gaussian widths of $\\sigma=1.4^{+2.3}_{-1.2}$ au and\n$\\sigma=3.9^{+2.0}_{-1.9}$ au, respectively. The 3 mm emission at the location\nof the possible gap or ring is determined to be optically thin, precluding the\npossibility that this feature in the intensity profile is due to the emission\nbeing optically thick. Annular substructures resembling those in the more\nevolved Class I and II disks could indeed be present in the Class 0 stage,\nearlier than previous observations suggested. Similar observations of embedded\ndisks in which the high optical depth problem can be mitigated are clearly\nneeded to better constrain the onset of substructures in the embedded stages.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}