{"id":"2407.14651","title":"Improving Representation of High-frequency Components for Medical\n  Foundation Models","authors":"Yuetan Chu, Yilan Zhang, Zhongyi Han, Changchun Yang, Longxi Zhou,\n  Gongning Luo, Xin Gao","authorsParsed":[["Chu","Yuetan",""],["Zhang","Yilan",""],["Han","Zhongyi",""],["Yang","Changchun",""],["Zhou","Longxi",""],["Luo","Gongning",""],["Gao","Xin",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 20:05:10 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 01:19:27 GMT"}],"updateDate":"2024-07-29","timestamp":1721419510000,"abstract":"  Foundation models have recently attracted significant attention for their\nimpressive generalizability across diverse downstream tasks. However, these\nmodels are demonstrated to exhibit great limitations in representing\nhigh-frequency components and fine-grained details. In many medical imaging\ntasks, the precise representation of such information is crucial due to the\ninherently intricate anatomical structures, sub-visual features, and complex\nboundaries involved. Consequently, the limited representation of prevalent\nfoundation models can result in significant performance degradation or even\nfailure in these tasks. To address these challenges, we propose a novel\npretraining strategy, named Frequency-advanced Representation Autoencoder\n(Frepa). Through high-frequency masking and low-frequency perturbation combined\nwith adversarial learning, Frepa encourages the encoder to effectively\nrepresent and preserve high-frequency components in the image embeddings.\nAdditionally, we introduce an innovative histogram-equalized image masking\nstrategy, extending the Masked Autoencoder approach beyond ViT to other\narchitectures such as Swin Transformer and convolutional networks. We develop\nFrepa across nine medical modalities and validate it on 32 downstream tasks for\nboth 2D images and 3D volume data. Without fine-tuning, Frepa can outperform\nother self-supervised pretraining methods and, in some cases, even surpasses\ntask-specific trained models. This improvement is particularly significant for\ntasks involving fine-grained details, such as achieving up to a +15% increase\nin DSC for retina vessel segmentation and a +7% increase in IoU for lung nodule\ndetection. Further experiments quantitatively reveal that Frepa enables\nsuperior high-frequency representations and preservation in the embeddings,\nunderscoring its potential for developing more generalized and universal\nmedical image foundation models.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Rn78vfxycjgkX4DnHg-qPx_zdYizeDXWA9KpULEX9go","pdfSize":"6800150","objectId":"0x0c8e2d620036e6f761682234912a7616f7a59cd42822712332ab4fd0cfa95832","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
