{"id":"2407.03151","title":"Inverse stochastic resonance in adaptive small-world neural networks","authors":"Marius E. Yamakou, Jinjie Zhu, and Erik A. Martens","authorsParsed":[["Yamakou","Marius E.",""],["Zhu","Jinjie",""],["Martens","Erik A.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 14:30:07 GMT"}],"updateDate":"2024-07-04","timestamp":1720017007000,"abstract":"  Inverse stochastic resonance (ISR) is a phenomenon where noise reduces rather\nthan increases the firing rate of a neuron, sometimes leading to complete\nquiescence. ISR was first experimentally verified with cerebellar Purkinje\nneurons. These experiments showed that ISR enables optimal information transfer\nbetween the input and output spike train of neurons. Subsequent studies\ndemonstrated the efficiency of information processing and transfer in neural\nnetworks with small-world topology. We conducted a numerical investigation into\nthe impact of adaptivity on ISR in a small-world network of noisy\nFitzHugh-Nagumo (FHN) neurons, operating in a bistable regime with a stable\nfixed point and a limit cycle -- a prerequisite for ISR. Our results show that\nthe degree of ISR is highly dependent on the FHN model's timescale separation\nparameter $\\epsilon$. The network structure undergoes dynamic adaptation via\nmechanisms of either spike-time-dependent plasticity (STDP) with\npotentiation-/depression-domination parameter $P$, or homeostatic structural\nplasticity (HSP) with rewiring frequency $F$. We demonstrate that both STDP and\nHSP amplify ISR when $\\epsilon$ lies within the bistability region of FHN\nneurons. Specifically, at larger values of $\\epsilon$ within the bistability\nregime, higher rewiring frequencies $F$ enhance ISR at intermediate (weak)\nsynaptic noise intensities, while values of $P$ consistent with\ndepression-domination (potentiation-domination) enhance (deteriorate) ISR.\nMoreover, although STDP and HSP parameters may jointly enhance ISR, $P$ has a\ngreater impact on ISR compared to $F$. Our findings inform future ISR\nenhancement strategies in noisy artificial neural circuits, aiming to optimize\ninformation transfer between input and output spike trains in neuromorphic\nsystems, and prompt venues for experiments in neural networks.\n","subjects":["Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}