{"id":"2407.11082","title":"Imbalanced Graph-Level Anomaly Detection via Counterfactual Augmentation\n  and Feature Learning","authors":"Zitong Wang, Xuexiong Luo, Enfeng Song, Qiuqing Bai, Fu Lin","authorsParsed":[["Wang","Zitong",""],["Luo","Xuexiong",""],["Song","Enfeng",""],["Bai","Qiuqing",""],["Lin","Fu",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 13:40:06 GMT"}],"updateDate":"2024-07-17","timestamp":1720878006000,"abstract":"  Graph-level anomaly detection (GLAD) has already gained significant\nimportance and has become a popular field of study, attracting considerable\nattention across numerous downstream works. The core focus of this domain is to\ncapture and highlight the anomalous information within given graph datasets. In\nmost existing studies, anomalies are often the instances of few. The stark\nimbalance misleads current GLAD methods to focus on learning the patterns of\nnormal graphs more, further impacting anomaly detection performance. Moreover,\nexisting methods predominantly utilize the inherent features of nodes to\nidentify anomalous graph patterns which is approved suboptimal according to our\nexperiments. In this work, we propose an imbalanced GLAD method via\ncounterfactual augmentation and feature learning. Specifically, we first\nconstruct anomalous samples based on counterfactual learning, aiming to expand\nand balance the datasets. Additionally, we construct a module based on Graph\nNeural Networks (GNNs), which allows us to utilize degree attributes to\ncomplement the inherent attribute features of nodes. Then, we design an\nadaptive weight learning module to integrate features tailored to different\ndatasets effectively to avoid indiscriminately treating all features as\nequivalent. Furthermore, extensive baseline experiments conducted on public\ndatasets substantiate the robustness and effectiveness. Besides, we apply the\nmodel to brain disease datasets, which can prove the generalization capability\nof our work. The source code of our work is available online.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}