{"id":"2407.07529","title":"Kaluza-Klein Graviton Freeze-In and Big Bang Nucleosynthesis","authors":"Mathieu Gross and Dan Hooper","authorsParsed":[["Gross","Mathieu",""],["Hooper","Dan",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 10:34:08 GMT"}],"updateDate":"2024-07-11","timestamp":1720607648000,"abstract":"  In models featuring extra spatial dimensions, particle collisions in the\nearly universe can produce Kaluza-Klein gravitons. Such particles will later\ndecay, potentially impacting the process of Big Bang nucleosynthesis. In this\npaper, we consider scenarios in which gravity is free to propagate throughout\n$n$ flat, compactified extra dimensions, while the fields of the Standard Model\nare confined to a 3+1 dimensional brane. We calculate the production and decay\nrates of the states that make up the Kaluza-Klein graviton tower and determine\nthe evolution of their abundances in the early universe. We then go on to\nevaluate the impact of these decays on the resulting light element abundances.\nWe identify significant regions of previously unexplored parameter space that\nare inconsistent with measurements of the primordial helium and deuterium\nabundances. In particular, we find that for the case of one extra dimension\n(two extra dimensions), the fundamental scale of gravity must be $M_{\\star} > 2\n\\times 10^{13} \\, {\\rm GeV}$ ($M_{\\star} > 10^{10} \\, {\\rm GeV}$) unless the\ntemperature of the early universe was never greater than $T \\sim 2 \\, {\\rm\nTeV}$ ($T \\sim 1 \\, {\\rm GeV}$). For larger values of $n$, these constraints\nare less stringent. For the case of $n=6$, for example, our analysis excludes\nall values of $M_{\\star}$ less than $\\sim 10^{6} \\, {\\rm GeV}$, unless the\ntemperature of the universe was never greater than $T \\sim 3 \\, {\\rm TeV}$. The\nresults presented here severely limit the possibility that black holes were\nefficiently produced through particle collisions in the early universe's\nthermal bath.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}