{"id":"2407.18872","title":"Packing and ejection dynamics of polymers: Role of confinement, polymer\n  stiffness and activity","authors":"Gokul Upadhyay, Rajeev Kapri, Anil Kumar Dasanna and Abhishek\n  Chaudhuri","authorsParsed":[["Upadhyay","Gokul",""],["Kapri","Rajeev",""],["Dasanna","Anil Kumar",""],["Chaudhuri","Abhishek",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:05:01 GMT"}],"updateDate":"2024-07-29","timestamp":1722013501000,"abstract":"  The translocation of biopolymers, such as DNA and proteins, across cellular\nor nuclear membranes is essential for numerous biological processes. The\ntranslocation dynamics are influenced by the properties of the polymers, such\nas polymer stiffness, and the geometry of the capsid. In our study, we aim to\ninvestigate the impact of polymer stiffness, activity, and different capsid\ngeometries on the packing and ejection dynamics of both passive and active\npolymers. We employ Langevin dynamics simulations for a systematic\ninvestigation. We observe that flexible polymers exhibit packing times that are\nfaster than those of their semi-flexible counterparts. Interestingly, for large\npolymers compared to the capsid size, sphere facilitates faster packing and\nunpacking compared to ellipsoid, mimicking the cell nucleus and suggesting a\ngeometrical advantage for biopolymer translocation. In summary, we observe that\nincreasing activity accelerates both the packing and ejection processes for\nboth flexible and semi-flexible polymers. However, the effect is significantly\nmore pronounced for semi-flexible polymers, highlighting the crucial role of\npolymer flexibility in these dynamics. These findings deepen our understanding\nof the intricate interplay between polymer flexibility, capsid geometry, and\nactivity, providing valuable insight into the dynamics of polymer packing and\nejection processes.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}