{"id":"2407.02934","title":"PosMLP-Video: Spatial and Temporal Relative Position Encoding for\n  Efficient Video Recognition","authors":"Yanbin Hao, Diansong Zhou, Zhicai Wang, Chong-Wah Ngo, Meng Wang","authorsParsed":[["Hao","Yanbin",""],["Zhou","Diansong",""],["Wang","Zhicai",""],["Ngo","Chong-Wah",""],["Wang","Meng",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 09:07:14 GMT"}],"updateDate":"2024-07-04","timestamp":1719997634000,"abstract":"  In recent years, vision Transformers and MLPs have demonstrated remarkable\nperformance in image understanding tasks. However, their inherently dense\ncomputational operators, such as self-attention and token-mixing layers, pose\nsignificant challenges when applied to spatio-temporal video data. To address\nthis gap, we propose PosMLP-Video, a lightweight yet powerful MLP-like backbone\nfor video recognition. Instead of dense operators, we use efficient relative\npositional encoding (RPE) to build pairwise token relations, leveraging\nsmall-sized parameterized relative position biases to obtain each relation\nscore. Specifically, to enable spatio-temporal modeling, we extend the image\nPosMLP's positional gating unit to temporal, spatial, and spatio-temporal\nvariants, namely PoTGU, PoSGU, and PoSTGU, respectively. These gating units can\nbe feasibly combined into three types of spatio-temporal factorized positional\nMLP blocks, which not only decrease model complexity but also maintain good\nperformance. Additionally, we enrich relative positional relationships by using\nchannel grouping. Experimental results on three video-related tasks demonstrate\nthat PosMLP-Video achieves competitive speed-accuracy trade-offs compared to\nthe previous state-of-the-art models. In particular, PosMLP-Video pre-trained\non ImageNet1K achieves 59.0%/70.3% top-1 accuracy on Something-Something V1/V2\nand 82.1% top-1 accuracy on Kinetics-400 while requiring much fewer parameters\nand FLOPs than other models. The code is released at\nhttps://github.com/zhouds1918/PosMLP_Video.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}