{"id":"2407.00474","title":"MH-pFLGB: Model Heterogeneous personalized Federated Learning via Global\n  Bypass for Medical Image Analysis","authors":"Luyuan Xie, Manqing Lin, ChenMing Xu, Tianyu Luan, Zhipeng Zeng,\n  Wenjun Qian, Cong Li, Yuejian Fang, Qingni Shen, Zhonghai Wu","authorsParsed":[["Xie","Luyuan",""],["Lin","Manqing",""],["Xu","ChenMing",""],["Luan","Tianyu",""],["Zeng","Zhipeng",""],["Qian","Wenjun",""],["Li","Cong",""],["Fang","Yuejian",""],["Shen","Qingni",""],["Wu","Zhonghai",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 15:38:37 GMT"}],"updateDate":"2024-07-02","timestamp":1719675517000,"abstract":"  In the evolving application of medical artificial intelligence, federated\nlearning is notable for its ability to protect training data privacy. Federated\nlearning facilitates collaborative model development without the need to share\nlocal data from healthcare institutions. Yet, the statistical and system\nheterogeneity among these institutions poses substantial challenges, which\naffects the effectiveness of federated learning and hampers the exchange of\ninformation between clients. To address these issues, we introduce a novel\napproach, MH-pFLGB, which employs a global bypass strategy to mitigate the\nreliance on public datasets and navigate the complexities of non-IID data\ndistributions. Our method enhances traditional federated learning by\nintegrating a global bypass model, which would share the information among the\nclients, but also serves as part of the network to enhance the performance on\neach client. Additionally, MH-pFLGB provides a feature fusion module to better\ncombine the local and global features. We validate \\model{}'s effectiveness and\nadaptability through extensive testing on different medical tasks,\ndemonstrating superior performance compared to existing state-of-the-art\nmethods.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}