{"id":"2407.09649","title":"VDB-GPDF: Online Gaussian Process Distance Field with VDB Structure","authors":"Lan Wu, Cedric Le Gentil, and Teresa Vidal-Calleja","authorsParsed":[["Wu","Lan",""],["Gentil","Cedric Le",""],["Vidal-Calleja","Teresa",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 19:09:26 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 12:53:00 GMT"}],"updateDate":"2024-07-30","timestamp":1720811366000,"abstract":"  Robots reason about the environment through dedicated representations.\nPopular choices for dense representations exploit Truncated Signed Distance\nFunctions (TSDF) and Octree data structures. However, TSDF is a projective\nsigned distance obtained directly from depth measurements that overestimates\nthe Euclidean distance. Octrees, despite being memory efficient, require tree\ntraversal and can lead to increased runtime in large scenarios. Other\nrepresentations based on Gaussian Process (GP) distance fields are appealing\ndue to their probabilistic and continuous nature, but the computational\ncomplexity is a concern. In this paper, we present an online efficient mapping\nframework that seamlessly couples GP distance fields and the fast-access VDB\ndata structure. This framework incrementally builds the Euclidean distance\nfield and fuses other surface properties, like intensity or colour, into a\nglobal scene representation that can cater for large-scale scenarios. The key\naspect is a latent Local GP Signed Distance Field (L-GPDF) contained in a local\nVDB structure that allows fast queries of the Euclidean distance, surface\nproperties and their uncertainties for arbitrary points in the field of view.\nProbabilistic fusion is then performed by merging the inferred values of these\npoints into a global VDB structure that is efficiently maintained over time.\nAfter fusion, the surface mesh is recovered, and a global GP Signed Distance\nField (G-GPDF) is generated and made available for downstream applications to\nquery accurate distance and gradients. A comparison with the state-of-the-art\nframeworks shows superior efficiency and accuracy of the inferred distance\nfield and comparable reconstruction performance. The accompanying code will be\npublicly available. https://github.com/UTS-RI/VDB_GPDF\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nibCdg4DDxAd2WjHY3h8FnFuJ2q-1raFzgm8yrFQIYc","pdfSize":"10061901"}
