{"id":"2407.12338","title":"GUME: Graphs and User Modalities Enhancement for Long-Tail Multimodal\n  Recommendation","authors":"Guojiao Lin, Zhen Meng, Dongjie Wang, Qingqing Long, Yuanchun Zhou,\n  Meng Xiao","authorsParsed":[["Lin","Guojiao",""],["Meng","Zhen",""],["Wang","Dongjie",""],["Long","Qingqing",""],["Zhou","Yuanchun",""],["Xiao","Meng",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 06:29:00 GMT"}],"updateDate":"2024-07-18","timestamp":1721197740000,"abstract":"  Multimodal recommendation systems (MMRS) have received considerable attention\nfrom the research community due to their ability to jointly utilize information\nfrom user behavior and product images and text. Previous research has two main\nissues. First, many long-tail items in recommendation systems have limited\ninteraction data, making it difficult to learn comprehensive and informative\nrepresentations. However, past MMRS studies have overlooked this issue.\nSecondly, users' modality preferences are crucial to their behavior. However,\nprevious research has primarily focused on learning item modality\nrepresentations, while user modality representations have remained relatively\nsimplistic.To address these challenges, we propose a novel Graphs and User\nModalities Enhancement (GUME) for long-tail multimodal recommendation.\nSpecifically, we first enhance the user-item graph using multimodal similarity\nbetween items. This improves the connectivity of long-tail items and helps them\nlearn high-quality representations through graph propagation. Then, we\nconstruct two types of user modalities: explicit interaction features and\nextended interest features. By using the user modality enhancement strategy to\nmaximize mutual information between these two features, we improve the\ngeneralization ability of user modality representations. Additionally, we\ndesign an alignment strategy for modality data to remove noise from both\ninternal and external perspectives. Extensive experiments on four publicly\navailable datasets demonstrate the effectiveness of our approach.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}