{"id":"2407.13480","title":"Risk-Aware Vehicle Trajectory Prediction Under Safety-Critical Scenarios","authors":"Qingfan Wang, Dongyang Xu, Gaoyuan Kuang, Chen Lv, Shengbo Eben Li,\n  Bingbing Nie","authorsParsed":[["Wang","Qingfan",""],["Xu","Dongyang",""],["Kuang","Gaoyuan",""],["Lv","Chen",""],["Li","Shengbo Eben",""],["Nie","Bingbing",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 13:00:01 GMT"}],"updateDate":"2024-07-19","timestamp":1721307601000,"abstract":"  Trajectory prediction is significant for intelligent vehicles to achieve\nhigh-level autonomous driving, and a lot of relevant research achievements have\nbeen made recently. Despite the rapid development, most existing studies solely\nfocused on normal safe scenarios while largely neglecting safety-critical\nscenarios, particularly those involving imminent collisions. This oversight may\nresult in autonomous vehicles lacking the essential predictive ability in such\nsituations, posing a significant threat to safety. To tackle these, this paper\nproposes a risk-aware trajectory prediction framework tailored to\nsafety-critical scenarios. Leveraging distinctive hazardous features, we\ndevelop three core risk-aware components. First, we introduce a\nrisk-incorporated scene encoder, which augments conventional encoders with\nquantitative risk information to achieve risk-aware encoding of hazardous scene\ncontexts. Next, we incorporate endpoint-risk-combined intention queries as\nprediction priors in the decoder to ensure that the predicted multimodal\ntrajectories cover both various spatial intentions and risk levels. Lastly, an\nauxiliary risk prediction task is implemented for the ultimate risk-aware\nprediction. Furthermore, to support model training and performance evaluation,\nwe introduce a safety-critical trajectory prediction dataset and tailored\nevaluation metrics. We conduct comprehensive evaluations and compare our model\nwith several SOTA models. Results demonstrate the superior performance of our\nmodel, with a significant improvement in most metrics. This prediction\nadvancement enables autonomous vehicles to execute correct collision avoidance\nmaneuvers under safety-critical scenarios, eventually enhancing road traffic\nsafety.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}