{"id":"2407.14896","title":"Probing 3D magnetic fields using starlight polarization and grain\n  alignment theory","authors":"Bao Truong, Thiem Hoang","authorsParsed":[["Truong","Bao",""],["Hoang","Thiem",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 15:11:04 GMT"}],"updateDate":"2024-07-23","timestamp":1721488264000,"abstract":"  Polarization of starlight induced by dust grains aligned with the magnetic\nfield (hereafter B-field) is widely used to measure the two-dimensional\nB-fields projected onto the plane-of-sky. Here, we introduce a new method to\ninfer three-dimensional B-fields using starlight polarization. The B-field's\ninclination angle or line-of-sight (LOS) component of B-fields is constrained\nby the starlight polarization efficiency from observations and the alignment\ndegree provided by the magnetically enhanced radiative torque (MRAT) alignment\ntheory. We first perform synthetic observation of starlight polarization of\nmagnetohydrodynamic (MHD) simulations of a filamentary cloud. We then test the\nnew technique with our updated POLARIS code and find that the B-field's\ninclination angles can be precisely determined by the starlight polarization\nefficiency from synthetic observations. Regardless of grain magnetic\nproperties, the technique can provide an accurate constraint on B-field's\ninclination angles in low-density regions $N_{\\rm H} < 5\\times\n10^{21}\\,\\cm^{-2}$ (or visual extinction $A_{V}< 3$) using optical\npolarization, whereas the technique can infer further to high-density regions\n$N_{\\rm H} \\sim 5 \\times 10^{22}\\,\\cm^{-2}$ (or $A_{V}\\sim 30$) using\nnear-infrared polarization. Our new technique opens the full potential of\ntracing 3D B-fields and constraining dust properties and grain alignment\nphysics on multiple scales of the diffuse interstellar medium and star-forming\nregions using multi-wavelength starlight polarization observations.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bL-7wJZ_FPrgp_n4xcIyyjgpNppf-QSyywX7RyCFNoY","pdfSize":"10386860","objectId":"0x0cbb3a4562b548c899ebb6798f750fe4496fe108f700293c587d3b9ac03d3f7a","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
