{"id":"2407.10872","title":"The updated BOSZ synthetic stellar spectral library","authors":"Szabolcs M\\'esz\\'aros, Ralph Bohlin, Carlos Allende Prieto, Borb\\'ala\n  Cseh, J\\'ozsef Kov\\'acs, Scott W. Fleming, Zolt\\'an Dencs, Susana Deustua,\n  Karl D. Gordon, Ivan Hubeny, Gy\\\"orgy Mez\\H{o}, M\\'arton Truszek","authorsParsed":[["Mészáros","Szabolcs",""],["Bohlin","Ralph",""],["Prieto","Carlos Allende",""],["Cseh","Borbála",""],["Kovács","József",""],["Fleming","Scott W.",""],["Dencs","Zoltán",""],["Deustua","Susana",""],["Gordon","Karl D.",""],["Hubeny","Ivan",""],["Mező","György",""],["Truszek","Márton",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:19:08 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 13:48:47 GMT"}],"updateDate":"2024-08-29","timestamp":1721060348000,"abstract":"  Context. The modeling of stellar spectra of flux standards observed by the\nHubble and James Webb space telescopes requires a large synthetic spectral\nlibrary that covers a wide atmospheric parameter range.\n  Aims. The aim of this paper is to present and describe the calculation\nmethods behind the updated version of the BOSZ synthetic spectral database,\nwhich was originally designed to fit the CALSPEC flux standards. These new\nlocal thermodynamic equilibrium (LTE) models incorporate both MARCS and ATLAS9\nmodel atmospheres, updated continuous opacities, and 23 new molecular line\nlists.\n  Methods. The new grid was calculated with Synspec using the LTE approximation\nand covers metallicities [M/H] from -2.5 to 0.75 dex, [alpha/M] from -0.25 to\n0.5 dex, and [C/M] from -0.75 to 0.5 dex, providing spectra for 336 unique\ncompositions. Calculations for stars between 2800 and 8000 K use MARCS model\natmospheres, and ATLAS9 is used between 7500 and 16,000 K.\n  Results. The new BOSZ grid includes 628,620 synthetic spectra from 50 nm to\n32 microns with models for 495 Teff - log g parameter pairs per composition and\nper microturbulent velocity. Each spectrum has eight different resolutions\nspanning a range from R = 500 to 50,000 as well as the original resolution of\nthe synthesis. The microturbulent velocities are 0, 1, 2, and 4 km/s.\n  Conclusions. The new BOSZ grid extends the temperature range to cooler\ntemperatures compared to the original grid because the updated molecular line\nlists make modeling possible for cooler stars. A publicly available and\nconsistently calculated database of model spectra is important for many\nastrophysical analyses, for example spectroscopic surveys and the determination\nof stellar elemental compositions.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}