{"id":"2407.05093","title":"Spiral Magnetic Field and Their Role on Accretion Dynamics in the\n  Circumnuclear Disk of Sagittarius A*: Insight from {\\lambda} = 850 {\\mu}m\n  Polarization Imaging","authors":"Kazuki Sato, Hiroko Shinnaga, Ray S. Furuya, Takeru K. Suzuki, Kensuke\n  Kakiuchi and J\\\"urgen Ott","authorsParsed":[["Sato","Kazuki",""],["Shinnaga","Hiroko",""],["Furuya","Ray S.",""],["Suzuki","Takeru K.",""],["Kakiuchi","Kensuke",""],["Ott","Jürgen",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 14:45:21 GMT"}],"updateDate":"2024-07-09","timestamp":1720277121000,"abstract":"  We showcase a study on the physical properties of the Circumnuclear Disk\nsurrounding the Sgr A* of the Galactic Center, emphasizing the role of magnetic\nfield (B field) with 0.47 pc spatial resolution, based on the sensitive\n{\\lambda} = 850 {\\mu}m polarization data taken with the JCMT. The B field\nwithin the CND exhibits a coherent spiral pattern. Applying the model described\nby Wardle and Ko\\ddot{o}nigl 1990 (WK model) to the observed B field pattern,\nit favors gas-pressure-dominant models without dismissing a gas-and-B field\ncomparable model, leading us to estimate the B-field strength in the ionized\ncavity around Sgr A* as 0.24 + 0.05 mG. Analysis -0.04 based on the WK model\nfurther allows us to derive representative B-field strengths for the radial,\nazimuthal, and vertical components as (Br,B{\\phi},Bz) = (0.4 \\pm 0.1,-0.7 \\pm\n0.2,0.2 \\pm 0.05) mG, respectively. A key finding is that the |{\\phi}|\ncomponent is dominant over Br and Bz components, consistent with the spiral\nmorphology, indicating that the CND' s B-field is predominantly toroidal,\npossibly shaped by accretion dynamics. Considering the turbulent pressure,\nestimated plasma \\{beta} values indicate the effective gas pressure should\nsurpass the magnetic pressure. Assessing the CND of our MWG in the\ntoroidal-and-vertical stability parameter space, we propose that such an\n\"effective\" magnetoro-tational instability (MRI) may likely be active. The\nestimated maximum unstable wavelength, {\\lambda}max = 0.1 \\pm 0.1 pc, is\nsmaller than the CND' s scale height (0.2 \\pm 0.1 pc), which indicates the\npotential for the effective MRI intermittent cycles of \\sim 10^{6} years, which\nshould profoundly affect the CND's evolution, considering the estimated mass\naccretion rate of 10^{-2}M_{\\odot} yr^{-1} to the Sgr A*.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}