{"id":"2407.19872","title":"OpenUAS: Embeddings of Cities in Japan with Anchor Data for Cross-city\n  Analysis of Area Usage Patterns","authors":"Naoki Tamura, Kazuyuki Shoji, Shin Katayama, Kenta Urano, Takuro\n  Yonezawa, Nobuo Kawaguchi","authorsParsed":[["Tamura","Naoki",""],["Shoji","Kazuyuki",""],["Katayama","Shin",""],["Urano","Kenta",""],["Yonezawa","Takuro",""],["Kawaguchi","Nobuo",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 10:43:15 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 08:38:35 GMT"}],"updateDate":"2024-08-02","timestamp":1722249795000,"abstract":"  We publicly release OpenUAS, a dataset of area embeddings based on urban\nusage patterns, including embeddings for over 1.3 million 50-meter square\nmeshes covering a total area of 3,300 square kilometers. This dataset is\nvaluable for analyzing area functions in fields such as market analysis, urban\nplanning, transportation infrastructure, and infection prediction. It captures\nthe characteristics of each area in the city, such as office districts and\nresidential areas, by employing an area embedding technique that utilizes\nlocation information typically obtained by GPS. Numerous area embedding\ntechniques have been proposed, and while the public release of such embedding\ndatasets is technically feasible, it has not been realized. One of the\nobstacles has been the integration of data from different cities and periods\ninto a unified space without sharing raw location data. We address this issue\nby developing an anchoring method that establishes anchors within a shared\nembedding space. We publicly release this anchor dataset along with area\nembedding datasets from several periods in eight major Japanese cities. This\ndataset allows users to analyze urban usage patterns in Japanese cities and\nembed their urban dataset into the same embedding space using the anchoring\nmethod. Our key contributions include the development of the anchoring method,\nreleasing area embedding datasets for Japanese cities, and providing tools for\neffective data utilization.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"xHiaQ_5T4R8bHQH_laIT7ab6ELu190ppg3RAyoB0cMo","pdfSize":"16358583","objectId":"0x4c7781bd37d1bb58bd77ceb6578e91200b3f920fc692b08d441805a1133932bc","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
