{"id":"2407.11987","title":"SlicerChat: Building a Local Chatbot for 3D Slicer","authors":"Colton Barr","authorsParsed":[["Barr","Colton",""]],"versions":[{"version":"v1","created":"Wed, 5 Jun 2024 03:32:06 GMT"}],"updateDate":"2024-07-18","timestamp":1717558326000,"abstract":"  3D Slicer is a powerful platform for 3D data visualization and analysis, but\nhas a significant learning curve for new users. Generative AI applications,\nsuch as ChatGPT, have emerged as a potential method of bridging the gap between\nvarious sources of documentation using natural language. The limited exposure\nof LLM services to 3D Slicer documentation, however, means that ChatGPT and\nrelated services tend to suffer from significant hallucination. The objective\nof this project is to build a chatbot architecture, called SlicerChat, that is\noptimized to answer 3D Slicer related questions and able to run locally using\nan open-source model. The core research questions explored in this work revolve\naround the answer quality and speed differences due to fine-tuning, model size,\nand the type of domain knowledge included in the prompt. A prototype SlicerChat\nsystem was built as a custom extension in 3D Slicer based on the Code-Llama\nInstruct architecture. Models of size 1.1B, 7B and 13B were fine-tuned using\nLow rank Adaptation, and various sources of 3D Slicer documentation were\ncompiled for use in a Retrieval Augmented Generation paradigm. Testing\ncombinations of fine-tuning and model sizes on a benchmark dataset of five 3D\nSlicer questions revealed that fine-tuning had no impact on model performance\nor speed compared to the base architecture, and that larger models performed\nbetter with a significant speed decrease. Experiments with adding 3D Slicer\ndocumentation to the prompt showed that Python sample code and Markdown\ndocumentation were the most useful information to include, but that adding 3D\nSlicer scene data and questions taken from Discourse also improved model\nperformance. In conclusion, this project shows the potential for integrating a\nhigh quality, local chatbot directly into 3D Slicer to help new users and\nexperienced developers alike to more efficiently use the software.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nkh919lrhdwixtjHNnbXgXXrCW23nAgOPmFpvFNUUeU","pdfSize":"1553829"}
