{"id":"2407.11618","title":"Decarbonization of Existing Heating Networks through Optimal Producer\n  Retrofit and Low-Temperature Operation","authors":"Martin Sollich, Yannick Wack, Robbe Salenbien, Maarten Blommaert","authorsParsed":[["Sollich","Martin",""],["Wack","Yannick",""],["Salenbien","Robbe",""],["Blommaert","Maarten",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 11:29:23 GMT"}],"updateDate":"2024-07-17","timestamp":1721129363000,"abstract":"  District heating networks are considered a key factor for enabling\nemission-free heat supply, while many existing networks still heavily rely on\nfossil fuels. With district heating network pipes easily exceeding a lifetime\nof 30 years, there is a growing potential to retrofit the heat producers of\nexisting networks to enable low-emission heat supply. Today, the heat producer\nretrofit for district heating networks usually focuses on simplified\napproaches, where the non-linear nature of the design problem is relaxed or not\nconsidered at all. Some approaches take non-linearities into account but use\noptimization routines that are either not scalable to large problems or are not\nreliable in obtaining an optimal solution, such as parameter optimization and\nsensitivity studies. This paper presents an automated design approach, to\ndecarbonize existing heating networks through optimal producer retrofit and\nultimately enabling 4th generation operation. The approach uses\nmulti-objective, mathematical optimization to balance CO2 emissions and network\ncosts, by assessing different CO2 prices, and is based on a detailed physical\nmodel. The optimizer is given the freedom to choose the producer types, their\ncapacities, and for each period, their supplied heat and supply temperature. A\nnon-linear heat transport model accurately accounts for heat and momentum\nlosses throughout the network, and ensures the feasibility of the proposed\ndesign and operation. The multi-period formulation incorporates temporal\nchanges in heat demand and environmental conditions throughout the year. By\nformulating a continuous problem and using adjoint-based optimization, the\nautomated approach remains scalable towards large scale applications. The\ndesign approach was assessed on a medium-sized 3rd generation DHN case and was\nable to optimally retrofit the heat producers.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4Bx93e9YUJ_qls_7Byf8D-RkWB95ePKP1-DW9InQj98","pdfSize":"10253538"}
