{"id":"2407.14219","title":"Probing instantaneous quantum circuit refrigeration in the quantum\n  regime","authors":"Shuji Nakamura, Teruaki Yoshioka, Sergei Lemziakov, Dmitrii Lvov,\n  Hiroto Mukai, Akiyoshi Tomonaga, Shintaro Takada, Yuma Okazaki, Nobu-Hisa\n  Kaneko, Jukka Pekola, and Jaw-Shen Tsai","authorsParsed":[["Nakamura","Shuji",""],["Yoshioka","Teruaki",""],["Lemziakov","Sergei",""],["Lvov","Dmitrii",""],["Mukai","Hiroto",""],["Tomonaga","Akiyoshi",""],["Takada","Shintaro",""],["Okazaki","Yuma",""],["Kaneko","Nobu-Hisa",""],["Pekola","Jukka",""],["Tsai","Jaw-Shen",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 11:38:44 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 09:10:42 GMT"}],"updateDate":"2024-08-14","timestamp":1721389124000,"abstract":"  Recent advancements in circuit quantum electrodynamics have enabled precise\nmanipulation and detection of the single energy quantum in quantum systems. A\nquantum circuit refrigerator (QCR) is capable of electrically cooling the\nexcited population of quantum systems, such as superconducting resonators and\nqubits, through photon-assisted tunneling of quasi-particles within a\nsuperconductor-insulator-normal metal junction. In this study, we demonstrated\ninstantaneous QCR in the quantum regime. We performed the time-resolved\nmeasurement of the QCR-induced cooling of photon number inside the\nsuperconducting resonator by harnessing a qubit as a photon detector. From the\nenhanced photon loss rate of the resonator estimated from the amount of the AC\nStark shift, the QCR was shown to have a cooling power of approximately 300 aW.\nFurthermore, even below the single energy quantum, the QCR can reduce the\nnumber of photons inside the resonator with 100 ns pulse from thermal\nequilibrium. Numerical calculations based on the Lindblad master equation\nsuccessfully reproduced these experimental results.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}