{"id":"2407.15220","title":"Privacy-Preserving Multi-Center Differential Protein Abundance Analysis\n  with FedProt","authors":"Yuliya Burankova, Miriam Abele, Mohammad Bakhtiari, Christine von\n  T\\\"orne, Teresa Barth, Lisa Schweizer, Pieter Giesbertz, Johannes R. Schmidt,\n  Stefan Kalkhof, Janina M\\\"uller-Deile, Peter A van Veelen, Yassene Mohammed,\n  Elke Hammer, Lis Arend, Klaudia Adamowicz, Tanja Laske, Anne Hartebrodt,\n  Tobias Frisch, Chen Meng, Julian Matschinske, Julian Sp\\\"ath, Richard\n  R\\\"ottger, Veit Schw\\\"ammle, Stefanie M. Hauck, Stefan Lichtenthaler, Axel\n  Imhof, Matthias Mann, Christina Ludwig, Bernhard Kuster, Jan Baumbach, Olga\n  Zolotareva","authorsParsed":[["Burankova","Yuliya",""],["Abele","Miriam",""],["Bakhtiari","Mohammad",""],["von Törne","Christine",""],["Barth","Teresa",""],["Schweizer","Lisa",""],["Giesbertz","Pieter",""],["Schmidt","Johannes R.",""],["Kalkhof","Stefan",""],["Müller-Deile","Janina",""],["van Veelen","Peter A",""],["Mohammed","Yassene",""],["Hammer","Elke",""],["Arend","Lis",""],["Adamowicz","Klaudia",""],["Laske","Tanja",""],["Hartebrodt","Anne",""],["Frisch","Tobias",""],["Meng","Chen",""],["Matschinske","Julian",""],["Späth","Julian",""],["Röttger","Richard",""],["Schwämmle","Veit",""],["Hauck","Stefanie M.",""],["Lichtenthaler","Stefan",""],["Imhof","Axel",""],["Mann","Matthias",""],["Ludwig","Christina",""],["Kuster","Bernhard",""],["Baumbach","Jan",""],["Zolotareva","Olga",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 17:09:20 GMT"}],"updateDate":"2024-07-23","timestamp":1721581760000,"abstract":"  Quantitative mass spectrometry has revolutionized proteomics by enabling\nsimultaneous quantification of thousands of proteins. Pooling patient-derived\ndata from multiple institutions enhances statistical power but raises\nsignificant privacy concerns. Here we introduce FedProt, the first\nprivacy-preserving tool for collaborative differential protein abundance\nanalysis of distributed data, which utilizes federated learning and additive\nsecret sharing. In the absence of a multicenter patient-derived dataset for\nevaluation, we created two, one at five centers from LFQ E.coli experiments and\none at three centers from TMT human serum. Evaluations using these datasets\nconfirm that FedProt achieves accuracy equivalent to DEqMS applied to pooled\ndata, with completely negligible absolute differences no greater than $\\text{$4\n\\times 10^{-12}$}$. In contrast, -log10(p-values) computed by the most accurate\nmeta-analysis methods diverged from the centralized analysis results by up to\n25-27. FedProt is available as a web tool with detailed documentation as a\nFeatureCloud App.\n","subjects":["Quantitative Biology/Quantitative Methods","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}