{"id":"2407.07572","title":"Impact of dendritic non-linearities on the computational capabilities of\n  neurons","authors":"Clarissa Lauditi, Enrico M. Malatesta, Fabrizio Pittorino, Carlo\n  Baldassi, Nicolas Brunel and Riccardo Zecchina","authorsParsed":[["Lauditi","Clarissa",""],["Malatesta","Enrico M.",""],["Pittorino","Fabrizio",""],["Baldassi","Carlo",""],["Brunel","Nicolas",""],["Zecchina","Riccardo",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 12:00:49 GMT"}],"updateDate":"2024-07-11","timestamp":1720612849000,"abstract":"  Multiple neurophysiological experiments have shown that dendritic\nnon-linearities can have a strong influence on synaptic input integration. In\nthis work we model a single neuron as a two-layer computational unit with\nnon-overlapping sign-constrained synaptic weights and a biologically plausible\nform of dendritic non-linearity, which is analytically tractable using\nstatistical physics methods. Using both analytical and numerical tools, we\ndemonstrate several key computational advantages of non-linear dendritic\nintegration with respect to models with linear synaptic integration. We find\nthat the dendritic non-linearity concurrently enhances the number of possible\nlearned input-output associations and the learning velocity, and we\ncharacterize how capacity and learning speed depend on the implemented\nnon-linearity and the levels of dendritic and somatic inhibition. We find that\nexperimentally observed connection probabilities naturally emerge in neurons\nwith sign-constrained synapses as a consequence of non-linear dendritic\nintegration, while in models with linear integration, an additional robustness\nparameter must be introduced in order to reproduce realistic connection\nprobabilities. Non-linearly induced sparsity comes with a second central\nadvantage for neuronal information processing, i.e. input and synaptic noise\nrobustness. By testing our model on standard real-world benchmark datasets\ninspired by deep learning practice, we observe empirically that the\nnon-linearity provides an enhancement in generalization performance, showing\nthat it enables to capture more complex input/output relations.\n","subjects":["Quantitative Biology/Neurons and Cognition","Condensed Matter/Disordered Systems and Neural Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}