{"id":"2407.12675","title":"Distilling Tiny and Ultra-fast Deep Neural Networks for Autonomous\n  Navigation on Nano-UAVs","authors":"Lorenzo Lamberti, Lorenzo Bellone, Luka Macan, Enrico Natalizio,\n  Francesco Conti, Daniele Palossi, and Luca Benini","authorsParsed":[["Lamberti","Lorenzo",""],["Bellone","Lorenzo",""],["Macan","Luka",""],["Natalizio","Enrico",""],["Conti","Francesco",""],["Palossi","Daniele",""],["Benini","Luca",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:57:48 GMT"}],"updateDate":"2024-07-18","timestamp":1721231868000,"abstract":"  Nano-sized unmanned aerial vehicles (UAVs) are ideal candidates for flying\nInternet-of-Things smart sensors to collect information in narrow spaces. This\nrequires ultra-fast navigation under very tight memory/computation constraints.\nThe PULP-Dronet convolutional neural network (CNN) enables autonomous\nnavigation running aboard a nano-UAV at 19 frame/s, at the cost of a large\nmemory footprint of 320 kB -- and with drone control in complex scenarios\nhindered by the disjoint training of collision avoidance and steering\ncapabilities. In this work, we distill a novel family of CNNs with better\ncapabilities than PULP-Dronet, but memory footprint reduced by up to 168x (down\nto 2.9 kB), achieving an inference rate of up to 139 frame/s; we collect a new\nopen-source unified collision/steering 66 k images dataset for more robust\nnavigation; and we perform a thorough in-field analysis of both PULP-Dronet and\nour tiny CNNs running on a commercially available nano-UAV. Our tiniest CNN,\ncalled Tiny-PULP-Dronet v3, navigates with a 100% success rate a challenging\nand never-seen-before path, composed of a narrow obstacle-populated corridor\nand a 180{\\deg} turn, at a maximum target speed of 0.5 m/s. In the same\nscenario, the SoA PULP-Dronet consistently fails despite having 168x more\nparameters.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}