{"id":"2407.04716","title":"Closed-loop geothermal systems: Modeling and predictions","authors":"K. Adhikari, M. K. Mudunuru, and K. B. Nakshatrala","authorsParsed":[["Adhikari","K.",""],["Mudunuru","M. K.",""],["Nakshatrala","K. B.",""]],"versions":[{"version":"v1","created":"Wed, 12 Jun 2024 19:20:40 GMT"}],"updateDate":"2024-07-09","timestamp":1718220040000,"abstract":"  Geothermal energy is a sustainable baseload source recognized for its ability\nto provide clean energy on a large scale. Advanced Geothermal Systems (AGS) --\noffer promising prototypes -- employ a closed-loop vascular layout that runs\ndeep beneath the Earth's surface. A working fluid (e.g., water or supercritical\ncarbon dioxide (sCO2)) circulates through the vasculature, entering the\nsubsurface at the inlet and exiting at the outlet with an elevated temperature.\nFor designing and performing cost-benefit analysis before deploying large-scale\nprojects and maintaining efficiency while enabling real-time monitoring during\nthe operational phase, modeling offers cost-effective solutions; often, it is\nthe only available option for performance assessment. A knowledge gap exists\ndue to the lack of a fast predictive modeling framework that considers the\nvascular intricacies, particularly the jumps in the solution fields across the\nchannel. Noting that the channel diameter is considerably smaller in scale\ncompared to the surrounding geological domain, we develop a reduced-order\nmodeling (ROM) framework for closed-loop geothermal systems. This ROM\nincorporates the jump conditions and provides a quick and accurate prediction\nof the temperature field, including the outlet temperature, which directly\ncorrelates with the power production capacity and thermal draw-down. We\ndemonstrate the predictive capabilities of the framework by establishing the\nuniqueness of the solutions and reporting representative numerical solutions.\nThe modeling framework and the predictions reported in this paper benefit the\nclosed-loop geothermal community, enabling them to determine the system's\nperformance and optimal capacity.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}