{"id":"2407.11351","title":"Learning Modality-agnostic Representation for Semantic Segmentation from\n  Any Modalities","authors":"Xu Zheng, Yuanhuiyi Lyu, Lin Wang","authorsParsed":[["Zheng","Xu",""],["Lyu","Yuanhuiyi",""],["Wang","Lin",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 03:34:38 GMT"}],"updateDate":"2024-07-17","timestamp":1721100878000,"abstract":"  Image modality is not perfect as it often fails in certain conditions, e.g.,\nnight and fast motion. This significantly limits the robustness and versatility\nof existing multi-modal (i.e., Image+X) semantic segmentation methods when\nconfronting modality absence or failure, as often occurred in real-world\napplications. Inspired by the open-world learning capability of multi-modal\nvision-language models (MVLMs), we explore a new direction in learning the\nmodality-agnostic representation via knowledge distillation (KD) from MVLMs.\nIntuitively, we propose Any2Seg, a novel framework that can achieve robust\nsegmentation from any combination of modalities in any visual conditions.\nSpecifically, we first introduce a novel language-guided semantic correlation\ndistillation (LSCD) module to transfer both inter-modal and intra-modal\nsemantic knowledge in the embedding space from MVLMs, e.g., LanguageBind. This\nenables us to minimize the modality gap and alleviate semantic ambiguity to\ncombine any modalities in any visual conditions. Then, we introduce a\nmodality-agnostic feature fusion (MFF) module that reweights the multi-modal\nfeatures based on the inter-modal correlation and selects the fine-grained\nfeature. This way, our Any2Seg finally yields an optimal modality-agnostic\nrepresentation. Extensive experiments on two benchmarks with four modalities\ndemonstrate that Any2Seg achieves the state-of-the-art under the multi-modal\nsetting (+3.54 mIoU) and excels in the challenging modality-incomplete\nsetting(+19.79 mIoU).\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}