{"id":"2407.20495","title":"Enhancing Quantitative Image Synthesis through Pretraining and\n  Resolution Scaling for Bone Mineral Density Estimation from a Plain X-ray\n  Image","authors":"Yi Gu, Yoshito Otake, Keisuke Uemura, Masaki Takao, Mazen Soufi, Seiji\n  Okada, Nobuhiko Sugano, Hugues Talbot, Yoshinobu Sato","authorsParsed":[["Gu","Yi",""],["Otake","Yoshito",""],["Uemura","Keisuke",""],["Takao","Masaki",""],["Soufi","Mazen",""],["Okada","Seiji",""],["Sugano","Nobuhiko",""],["Talbot","Hugues",""],["Sato","Yoshinobu",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 01:39:30 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 07:40:18 GMT"}],"updateDate":"2024-08-29","timestamp":1722303570000,"abstract":"  While most vision tasks are essentially visual in nature (for recognition),\nsome important tasks, especially in the medical field, also require\nquantitative analysis (for quantification) using quantitative images. Unlike in\nvisual analysis, pixel values in quantitative images correspond to physical\nmetrics measured by specific devices (e.g., a depth image). However, recent\nwork has shown that it is sometimes possible to synthesize accurate\nquantitative values from visual ones (e.g., depth from visual cues or defocus).\nThis research aims to improve quantitative image synthesis (QIS) by exploring\npretraining and image resolution scaling. We propose a benchmark for evaluating\npretraining performance using the task of QIS-based bone mineral density (BMD)\nestimation from plain X-ray images, where the synthesized quantitative image is\nused to derive BMD. Our results show that appropriate pretraining can improve\nQIS performance, significantly raising the correlation of BMD estimation from\n0.820 to 0.898, while others do not help or even hinder it. Scaling-up the\nresolution can further boost the correlation up to 0.923, a significant\nenhancement over conventional methods. Future work will include exploring more\npretraining strategies and validating them on other image synthesis tasks.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}