{"id":"2407.10640","title":"Error Bounds for the Network Scale-Up Method","authors":"Sergio D\\'iaz-Aranda, Juan Marcos Ram\\'irez, Mohit Daga, Jaya Prakash\n  Champati, Jos\\'e Aguilar, Rosa Elvira Lillo, Antonio Fern\\'andez Anta","authorsParsed":[["Díaz-Aranda","Sergio",""],["Ramírez","Juan Marcos",""],["Daga","Mohit",""],["Champati","Jaya Prakash",""],["Aguilar","José",""],["Lillo","Rosa Elvira",""],["Anta","Antonio Fernández",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 12:00:34 GMT"}],"updateDate":"2024-07-16","timestamp":1721044834000,"abstract":"  Epidemiologists and social scientists have used the Network Scale-Up Method\n(NSUM) for over thirty years to estimate the size of a hidden sub-population\nwithin a social network. This method involves querying a subset of network\nnodes about the number of their neighbours belonging to the hidden\nsub-population. In general, NSUM assumes that the social network topology and\nthe hidden sub-population distribution are well-behaved; hence, the NSUM\nestimate is close to the actual value. However, bounds on NSUM estimation\nerrors have not been analytically proven. This paper provides analytical bounds\non the error incurred by the two most popular NSUM estimators. These bounds\nassume that the queried nodes accurately provide their degree and the number of\nneighbors belonging to the hidden population. Our key findings are twofold.\nFirst, we show that when an adversary designs the network and places the hidden\nsub-population, then the estimate can be a factor of $\\Omega(\\sqrt{n})$ off\nfrom the real value (in a network with $n$ nodes). Second, we also prove error\nbounds when the underlying network is randomly generated, showing that a small\nconstant factor can be achieved with high probability using samples of\nlogarithmic size $O(\\log{n})$. We present improved analytical bounds for\nErdos-Renyi and Scale-Free networks. Our theoretical analysis is supported by\nan extensive set of numerical experiments designed to determine the effect of\nthe sample size on the accuracy of the estimates in both synthetic and real\nnetworks.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Discrete Mathematics","Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}