{"id":"2407.19277","title":"Predicting the Progression of Cancerous Tumors in Mice: A Machine and\n  Deep Learning Intuition","authors":"Amit K Chattopadhyay, Aimee Pascaline N Unkundiye, Gillian Pearce and\n  Steven Russell","authorsParsed":[["Chattopadhyay","Amit K",""],["Unkundiye","Aimee Pascaline N",""],["Pearce","Gillian",""],["Russell","Steven",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 15:16:06 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 18:09:17 GMT"}],"updateDate":"2024-08-12","timestamp":1722093366000,"abstract":"  The study explores Artificial Intelligence (AI) powered modeling to predict\nthe evolution of cancer tumor cells in mice under different forms of treatment.\nThe AI models are analyzed against varying ambient and systemic parameters,\ne.g. drug dosage, volume of the cancer cell mass, and time taken to destroy the\ncancer cell mass. The data required for the analysis have been synthetically\nextracted from plots available in both published and unpublished literature\n(primarily using a Matlab architecture called \"Grabit\"), that are then\nstatistically standardized around the same baseline for comparison. Three forms\nof treatment are considered - saline (multiple concentrations used), magnetic\nnanoparticles (mNPs) and fluorodeoxyglycose iron oxide magnetic nanoparticles\n(mNP-FDGs) - analyzed using three Machine Learning (ML) algorithms, Decision\nTree (DT), Random Forest (RF), Multilinear Regression (MLR), and a Deep\nLearning (DL) module, the Adaptive Neural Network (ANN). The AI models are\ntrained on 60-80% data, the rest used for validation. Assessed over all three\nforms of treatment, ANN consistently outperforms other predictive models. Our\nmodels predict mNP-FDG as the most potent treatment regime that kills the\ncancerous tumor completely in ca 13 days from the start of treatment. The\nmodels can be generalized to other forms of cancer treatment regimens.\n","subjects":["Physics/Biological Physics","Condensed Matter/Soft Condensed Matter","Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}