{"id":"2407.17314","title":"Edge-Cloud Continuum Orchestration of Critical Services: A Smart-City\n  Approach","authors":"Rodrigo Rosmaninho, Duarte Raposo, Pedro Rito, Susana Sargento","authorsParsed":[["Rosmaninho","Rodrigo",""],["Raposo","Duarte",""],["Rito","Pedro",""],["Sargento","Susana",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 14:38:03 GMT"}],"updateDate":"2024-07-25","timestamp":1721831883000,"abstract":"  Smart-city services are typically developed as closed systems within each\ncity's vertical, communicating and interacting with cloud services while\nremaining isolated within each provider's domain. With the emergence of 5G\nprivate domains and the introduction of new M2M services focusing on autonomous\nsystems, there is a shift from the cloud-based approach to a distributed edge\ncomputing paradigm, in a \\textit{continuum} orchestration. However, an\nessential component is missing. Current orchestration tools, designed for\ncloud-based deployments, lack robust workload isolation, fail to meet timing\nconstraints, and are not tailored to the resource-constrained nature of edge\ndevices. Therefore, new orchestration methods are needed to support MEC\nenvironments. The work presented in this paper addresses this gap. Based on the\nreal needs of a smart-city testbed - the Aveiro Living Lab-, we developed a set\nof orchestration components to facilitate the seamless orchestration of both\ncloud and edge-based services, encompassing both critical and non-critical\nservices. This work extends the current Kubernetes orchestration platform to\ninclude a novel location-specific resource definition, a custom scheduler to\naccommodate real-time and legacy services, continuous service monitoring to\ndetect sub-optimal states, and a refined load balancing mechanism that\nprioritizes the fastest response times.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/"}