{"id":"2407.18288","title":"Leveraging Foundation Models via Knowledge Distillation in Multi-Object\n  Tracking: Distilling DINOv2 Features to FairMOT","authors":"Niels G. Faber, Seyed Sahand Mohammadi Ziabari, Fatemeh Karimi\n  Nejadasl","authorsParsed":[["Faber","Niels G.",""],["Ziabari","Seyed Sahand Mohammadi",""],["Nejadasl","Fatemeh Karimi",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 14:21:35 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 06:50:44 GMT"}],"updateDate":"2024-08-06","timestamp":1721917295000,"abstract":"  Multiple Object Tracking (MOT) is a computer vision task that has been\nemployed in a variety of sectors. Some common limitations in MOT are varying\nobject appearances, occlusions, or crowded scenes. To address these challenges,\nmachine learning methods have been extensively deployed, leveraging large\ndatasets, sophisticated models, and substantial computational resources. Due to\npractical limitations, access to the above is not always an option. However,\nwith the recent release of foundation models by prominent AI companies,\npretrained models have been trained on vast datasets and resources using\nstate-of-the-art methods. This work tries to leverage one such foundation\nmodel, called DINOv2, through using knowledge distillation. The proposed method\nuses a teacher-student architecture, where DINOv2 is the teacher and the\nFairMOT backbone HRNetv2 W18 is the student. The results imply that although\nthe proposed method shows improvements in certain scenarios, it does not\nconsistently outperform the original FairMOT model. These findings highlight\nthe potential and limitations of applying foundation models in knowledge\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VfkfnGFLd4UT6NhmAI3B0bteyZg66IUdDcPvto-vcfQ","pdfSize":"1592506","objectId":"0x898df611bd8933020277c588ae0acc12b7bdcf6ad8a068c41147d9e0ad24d105","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
