{"id":"2407.11273","title":"Informational Size in School Choice","authors":"Di Feng and Yun Liu","authorsParsed":[["Feng","Di",""],["Liu","Yun",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 22:41:36 GMT"}],"updateDate":"2024-07-17","timestamp":1721083296000,"abstract":"  This paper introduces a novel measurement of informational size to school\nchoice problems, which inherits its ideas from Mount and Reiter (1974). This\nconcept measures a matching mechanism's information size by counting the\nmaximal relevant preference and priority rankings to secure a certain pairwise\nassignment of a student to a school across all possible matching problems. Our\nanalysis uncovers two key insights. First, the three prominent strategy-proof\nmatching mechanisms, the deferred acceptance (DA) mechanism, the top trading\ncycles (TTC) mechanism, and the serial dictatorship (SD) mechanism, is\n(strictly) less informative than the non-strategy-proof immediate acceptance\n(IA) mechanism. This result highlights a previously omitted advantage of IA in\nterm of its information demand, which partially explain the its popularity in\nreal-world matching problems especially when acquiring information is both\npecuniarily and cognitively costly. Second, when the matching problem contains\nat least four students, the TTC demands less information compared to the DA to\nimplement a desired allocation. The issue of comparison between TTC and DA has\npuzzled researchers both in theory (Gonczarowski and Thomas, 2023) and in\nexperiment (Hakimov and Kubler, 2021). Our result responds to this issue from\nan informational perspective: in experiments with relatively fewer students,\nagents tend to prefer DA over TTC as DA requires fewer information to secure\none's allocation in all problems (Guillen and Veszteg, 2021), while the\nopposite is true when the market size increases (Pais et al., 2011). Among\nothers, our informational size concept offers a new perspective to understand\nthe differences in auditability (Grigoryan and Moller, 2024), manipulation\nvulnerability (Pathak and Sonmez, 2013), and privacy protection (Haupt and\nHitzig, 2022), among some commonly used matching mechanisms.\n","subjects":["Economics/Theoretical Economics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}