{"id":"2407.15089","title":"Learning Physics for Unveiling Hidden Earthquake Ground Motions via\n  Conditional Generative Modeling","authors":"Pu Ren, Rie Nakata, Maxime Lacour, Ilan Naiman, Nori Nakata, Jialin\n  Song, Zhengfa Bi, Osman Asif Malik, Dmitriy Morozov, Omri Azencot, N.\n  Benjamin Erichson, and Michael W. Mahoney","authorsParsed":[["Ren","Pu",""],["Nakata","Rie",""],["Lacour","Maxime",""],["Naiman","Ilan",""],["Nakata","Nori",""],["Song","Jialin",""],["Bi","Zhengfa",""],["Malik","Osman Asif",""],["Morozov","Dmitriy",""],["Azencot","Omri",""],["Erichson","N. Benjamin",""],["Mahoney","Michael W.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 08:23:37 GMT"}],"updateDate":"2024-07-23","timestamp":1721550217000,"abstract":"  Predicting high-fidelity ground motions for future earthquakes is crucial for\nseismic hazard assessment and infrastructure resilience. Conventional empirical\nsimulations suffer from sparse sensor distribution and geographically localized\nearthquake locations, while physics-based methods are computationally intensive\nand require accurate representations of Earth structures and earthquake\nsources. We propose a novel artificial intelligence (AI) simulator, Conditional\nGenerative Modeling for Ground Motion (CGM-GM), to synthesize high-frequency\nand spatially continuous earthquake ground motion waveforms. CGM-GM leverages\nearthquake magnitudes and geographic coordinates of earthquakes and sensors as\ninputs, learning complex wave physics and Earth heterogeneities, without\nexplicit physics constraints. This is achieved through a probabilistic\nautoencoder that captures latent distributions in the time-frequency domain and\nvariational sequential models for prior and posterior distributions. We\nevaluate the performance of CGM-GM using small-magnitude earthquake records\nfrom the San Francisco Bay Area, a region with high seismic risks. CGM-GM\ndemonstrates a strong potential for outperforming a state-of-the-art\nnon-ergodic empirical ground motion model and shows great promise in seismology\nand beyond.\n","subjects":["Physics/Geophysics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}