{"id":"2407.13897","title":"A mm and near-IR study of YSOs: from outbursting protostars to\n  satellites","authors":"Pedro H. Nogueira","authorsParsed":[["Nogueira","Pedro H.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 20:53:19 GMT"}],"updateDate":"2024-07-22","timestamp":1721335999000,"abstract":"  We are in a golden era observing Young Stellar Objects (YSOs), protoplanetary\ndisks, and substellar objects, crucial for understanding their formation and\nevolution. This Ph.D. thesis explores two binary systems.\n  Firstly, we study an eruptive YSO, HBC 494, using ALMA band 6 (1.3 mm)\nobservations. It's a FUor system in Orion Molecular Cloud with a resolved\nbinary system: HBC 494 N (primary) and HBC 494 S (secondary) separated by 75\nau. The disks show hints of aligned formation scenarios, with HBC 494 N being\nbrighter and larger. Molecular line observations reveal bipolar outflows and\nrotating envelopes. Cavity features within the continuum disks' area suggest\ncontinuum over-subtraction or slow-moving jets and chemical destruction along\nthe line-of-sight.\n  Secondly, we examine the young binary system $\\eta$ Tel using VLT/SPHERE H\nband imaging. It consists of an A-type star and a brown dwarf companion $\\eta$\nTel B, separated by 208 au. Astrometric measurements over 19 years yield a low\neccentric orbit with an inclination of 81.9 degrees. The mass of $\\eta$ Tel B\nis determined to be 48 M$_{Jup}$, consistent with previous literature. No\nsignificant residual indicative of a satellite or disk surrounding the\ncompanion is detected, with limits ruling out massive objects around $\\eta$ Tel\nB at separations down to 33 au with masses as low as 1.6M$_{Jup}$.\n  These studies employ sub-mm to near-IR observations, highlighting the\ncomplexity of (sub)stellar formation/evolution. This thesis contributes diverse\nanalyses, providing insights into these intriguing processes.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"PmA5x6EfQCfbvgHihMDS0zVnFAoFBTKOaADUtr_DNqU","pdfSize":"42420953"}
