{"id":"2407.00104","title":"AI-Driven Skin Cancer Diagnosis: Grad-CAM and Expert Annotations for\n  Enhanced Interpretability","authors":"Iv\\'an Matas, Carmen Serrano, Francisca Silva, Amalia Serrano, Tom\\'as\n  Toledo-Pastrana, Bego\\~na Acha","authorsParsed":[["Matas","Iván",""],["Serrano","Carmen",""],["Silva","Francisca",""],["Serrano","Amalia",""],["Toledo-Pastrana","Tomás",""],["Acha","Begoña",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 07:33:34 GMT"}],"updateDate":"2024-07-02","timestamp":1719473614000,"abstract":"  An AI tool has been developed to provide interpretable support for the\ndiagnosis of BCC via teledermatology, thus speeding up referrals and optimizing\nresource utilization. The interpretability is provided in two ways: on the one\nhand, the main BCC dermoscopic patterns are found in the image to justify the\nBCC/Non BCC classification. Secondly, based on the common visual XAI Grad-CAM,\na clinically inspired visual explanation is developed where the relevant\nfeatures for diagnosis are located. Since there is no established ground truth\nfor BCC dermoscopic features, a standard reference is inferred from the\ndiagnosis of four dermatologists using an Expectation Maximization (EM) based\nalgorithm. The results demonstrate significant improvements in classification\naccuracy and interpretability, positioning this approach as a valuable tool for\nearly BCC detection and referral to dermatologists. The BCC/non-BCC\nclassification achieved an accuracy rate of 90%. For Clinically-inspired XAI\nresults, the detection of BCC patterns useful to clinicians reaches 99%\naccuracy. As for the Clinically-inspired Visual XAI results, the mean of the\nGrad-CAM normalized value within the manually segmented clinical features is\n0.57, while outside this region it is 0.16. This indicates that the model\nstruggles to accurately identify the regions of the BCC patterns. These results\nprove the ability of the AI tool to provide a useful explanation.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Information Retrieval","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}