{"id":"2407.01861","title":"The impact of incorrect dissociation energies on inferred photospheric\n  abundances","authors":"Sarah E Aquilina, Andrew R Casey, and Adam J Wheeler","authorsParsed":[["Aquilina","Sarah E",""],["Casey","Andrew R",""],["Wheeler","Adam J",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 00:15:58 GMT"}],"updateDate":"2024-07-03","timestamp":1719879358000,"abstract":"  Spectral synthesis codes are essential for inferring stellar parameters and\ndetailed chemical abundances. These codes require many physical inputs to\npredict an emergent spectrum. Developers adopt the best measurements of those\ninputs at the time they release their code, but those measurements usually\nimprove over time faster than the software is updated. In general, the impact\nof using incorrect or uncertain dissociation energies are largely unknown. Here\nwe evaluate how incorrect dissociation energies impact abundances measured from\nC2, CN, CH, TiO, and MgO features. For each molecule we synthesised optical\nspectra of FGKM-type main-sequence and giant stars using the literature\ndissociation energy, and an incorrect (perturbed) dissociation energy. We find\nthat the uncertainties in the dissociation energies adopted by spectral\nsynthesis codes for CN, CH, TiO, and MgO lead to negligible differences in flux\nor abundances. C2 is the only diatomic molecule where the uncertainty of the\ninputted dissociation energy translates to a significant difference in flux,\nand carbon abundance differences of up to 0.2 dex. For Solar-like stars, the\nimpact on carbon abundance is up to 0.09 dex. These large abundance differences\ndemonstrate the importance of updating the inputs adopted by spectral synthesis\ncodes, as well as a consensus on appropriate values between different codes.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TnkGB-iyTiMKcpvb8au8ifkPD7FyQRsATCSmYPRCUS8","pdfSize":"467386","objectId":"0x0fd3e6be7e138e35696ea2992c401c304e4fe6863ff431379e501118790a50a8","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
