{"id":"2407.11834","title":"Touch in Human Social Robot Interaction: Systematic Literature Review\n  with PRISMA Method","authors":"Christiana Tsirka (1), Anna-Maria Velentza (1 and 2) and Nikolaos\n  Fachantidis (1 and 2) ((1) School of School of Educational and Social\n  Sciences, University of Macedonia, GR, (2) Laboratory of Informatics &\n  Robotic Applications in Education & Society (LIRES), University of Macedonia,\n  GR)","authorsParsed":[["Tsirka","Christiana","","1 and 2"],["Velentza","Anna-Maria","","1 and 2"],["Fachantidis","Nikolaos","","1 and 2"]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:21:23 GMT"}],"updateDate":"2024-07-17","timestamp":1721143283000,"abstract":"  In the past two decades, there has been a continuous rise in the deployment\nof robots fulfilling social roles that expands across various industries such\nas guides, service providers, and educators. To establish robots as integral\nallies in daily life, it is essential for them to deliver positive and\ntrustworthy experiences, achieved through seamless and satisfying interactions\nacross diverse modalities and communication channels. In the realm of\nhuman-robot interactions, touch plays a pivotal role in facilitating meaningful\nconnections and communication. To delve into the significance of haptic\ntechnologies and their impact on interactions between humans and social robots,\nan exploration of the existing literature is essential, since the research\nabout touch is the most underrepresented between the other communication\nchannels (facial expressions, movements, vocals etc). A systematic literature\nreview has been carried out, identifying 42 articles with the Preferred\nReporting Items for Systematic Reviews and Meta-Analyses (PRISMA), related to\ntouch and haptic technologies and interaction between humans and social robots\nin the twenty years (2001 -2023). The results show the main differences, pros\nand cons between the materials and technologies that have been primary used so\nfar, the qualitative and quantitative research that links the HRI touch studies\nwith the human emotion and also the types of touch and repeatability of those\nmethods. The study identifies research gaps and outlines future directions,\nwhile it serves as a guide for anyone who will be interesting in conducting HRI\ntouch research or build a haptic system for a social robot.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"6fi_rqjxrrpV0tpg5N0JKCIwwb1VkmCAxKEO0Uu6F18","pdfSize":"398495"}
