{"id":"2407.00641","title":"HASNAS: A Hardware-Aware Spiking Neural Architecture Search Framework\n  for Neuromorphic Compute-in-Memory Systems","authors":"Rachmad Vidya Wicaksana Putra, Muhammad Shafique","authorsParsed":[["Putra","Rachmad Vidya Wicaksana",""],["Shafique","Muhammad",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 09:51:58 GMT"}],"updateDate":"2024-07-02","timestamp":1719741118000,"abstract":"  Spiking Neural Networks (SNNs) have shown capabilities for solving diverse\nmachine learning tasks with ultra-low-power/energy computation. To further\nimprove the performance and efficiency of SNN inference, the Compute-in-Memory\n(CIM) paradigm with emerging device technologies such as resistive random\naccess memory is employed. However, most of SNN architectures are developed\nwithout considering constraints from the application and the underlying CIM\nhardware (e.g., memory, area, latency, and energy consumption). Moreover, most\nof SNN designs are derived from the Artificial Neural Networks, whose network\noperations are different from SNNs. These limitations hinder SNNs from reaching\ntheir full potential in accuracy and efficiency. Toward this, we propose\nHASNAS, a novel hardware-aware spiking neural architecture search (NAS)\nframework for neuromorphic CIM systems that finds an SNN that offers high\naccuracy under the given memory, area, latency, and energy constraints. To\nachieve this, HASNAS employs the following key steps: (1) optimizing SNN\noperations to achieve high accuracy, (2) developing an SNN architecture that\nfacilitates an effective learning process, and (3) devising a systematic\nhardware-aware search algorithm to meet the constraints. The experimental\nresults show that our HASNAS quickly finds an SNN that maintains high accuracy\ncompared to the state-of-the-art by up to 11x speed-up, and meets the given\nconstraints: 4x10^6 parameters of memory, 100mm^2 of area, 400ms of latency,\nand 120uJ energy consumption for CIFAR10 and CIFAR100; while the\nstate-of-the-art fails to meet the constraints. In this manner, our HASNAS can\nenable efficient design automation for providing high-performance and\nenergy-efficient neuromorphic CIM systems for diverse applications.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Hardware Architecture","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}