{"id":"2407.13001","title":"Automated Gateways: A Smart Contract-Powered Solution for\n  Interoperability Across Blockchains","authors":"Koosha Esmaeilzadeh Khorasani (1), Sara Rouhani (1), Rui Pan (2),\n  Vahid Pourheidari (3) ((1) University of Manitoba, (2) Grain Discovery, (3)\n  Futurix Technologies)","authorsParsed":[["Khorasani","Koosha Esmaeilzadeh",""],["Rouhani","Sara",""],["Pan","Rui",""],["Pourheidari","Vahid",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 20:45:05 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 15:59:28 GMT"}],"updateDate":"2024-07-22","timestamp":1721249105000,"abstract":"  Interoperability is a significant challenge in blockchain technology,\nhindering seamless data and service sharing across diverse blockchain networks.\nThis study introduces Automated Gateways as a novel framework leveraging smart\ncontracts to facilitate interoperability. Unlike existing solutions, which\noften require adopting new technologies or relying on external services,\nAutomated Gateways framework is integrated directly with a blockchain's core\ninfrastructure to enhance systems with built-in interoperability features. By\nimplementing fine-grained access control mechanisms, smart contracts within\nthis framework manage accessibility and authorization for cross-chain\ninteractions and facilitate streamlining the selective sharing of services\nbetween blockchains. Our evaluation demonstrates the framework's capability to\nhandle cross-chain interactions efficiently, significantly reduce operational\ncomplexities, and uphold transactional integrity and security across different\nblockchain networks. With its focus on user-friendliness, self-managed\npermissions, and independence from external platforms, this framework is\ndesigned to achieve broader adoption within the blockchain community.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}