{"id":"2407.00130","title":"Universal Basic Mass Density inside Dark Matter Halos","authors":"Fateen Haddad and Nidal Haddad","authorsParsed":[["Haddad","Fateen",""],["Haddad","Nidal",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 06:39:24 GMT"}],"updateDate":"2024-07-02","timestamp":1719556764000,"abstract":"  In this work we propose a universal basic mass density and a universal basic\nmetric inside dark matter halos in the framework of Einstein equations\nproviding an analytical ground for learning about dark matter. In a previous\nwork the authors have proposed a simplified model for galaxies: a Schwarzschild\nblack hole (that contains all the baryonic matter of the galaxy) immersed\ninside a dark matter halo. The solution solved the Einstein equations\nperturbatively and successfully gave the flat rotation curve and the baryonic\nTully-Fisher relation, the two signatures of spiral galaxies. In this work we\ntake the black hole mass (the baryonic mass) of the solution to be zero in\norder to focus our study on the dark matter halo exclusively. Among the results\n(1) is the prediction of a universal basic mass density of dark matter,\n$\\rho=a_0/2\\pi G r$, where $a_0\\approx 2.8 \\times 10^{-11} \\ m/s^2$ is a\nuniversal constant whose value was deduced from observations, (2) we show that\nthe mass and velocity curve of the dark halo agree excellently with\nobservational data at intermediate distances where the baryonic matter\ncontribution is negligible, (3) we show that the constant $a_0$ is the origin\nof the constant surface density of dark matter and the origin of the\nscale-radius/scale-density scaling relation of the Navarro-Frenk-White profile\n(4) we show how the inclusion of baryonic matter in our model solves the\ncore-cusp problem.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"X345N1Kj0CyIpfB2GtnPWQ025ZKY5wEM0Dt9y3cHbMA","pdfSize":"435657"}
