{"id":"2407.07983","title":"New Wolf-Rayet wind yields and nucleosynthesis of Helium stars","authors":"Erin R. Higgins, Jorick S. Vink, Raphael Hirschi, Alison M. Laird, and\n  Andreas A. C. Sander","authorsParsed":[["Higgins","Erin R.",""],["Vink","Jorick S.",""],["Hirschi","Raphael",""],["Laird","Alison M.",""],["Sander","Andreas A. C.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:29:26 GMT"}],"updateDate":"2024-07-12","timestamp":1720636166000,"abstract":"  Strong metallicity-dependent winds dominate the evolution of core He-burning,\nclassical Wolf-Rayet (cWR) stars, which eject both H and He-fusion products\nsuch as 14N, 12C, 16O, 19F, 22Ne and 23Na during their evolution. The chemical\nenrichment from cWRs can be significant. cWR stars are also key sources for\nneutron production relevant for the weak s-process. We calculate stellar models\nof cWRs at solar metallicity for a range of initial Helium star masses\n(12-50M), adopting the recent hydrodynamical wind rates from Sander & Vink\n(2020). Stellar wind yields are provided for the entire post-main sequence\nevolution until core O-exhaustion. While literature has previously considered\ncWRs as a viable source of the radioisotope 26Al, we confirm that negligible\n26Al is ejected by cWRs since it has decayed to 26Mg or proton-captured to\n27Al. However, in Paper I, Higgins et al. (2023) we showed that very massive\nstars eject substantial quantities of 26Al, among other elements including N,\nNe, and Na, already from the zero-age-main-sequence. Here, we examine the\nproduction of 19F and find that even with lower mass-loss rates than previous\nstudies, our cWR models still eject substantial amounts of 19F. We provide\ncentral neutron densities (Nn) of a 30M cWR compared with a 32M post-VMS WR and\nconfirm that during core He-burning, cWRs produce a significant number of\nneutrons for the weak s-process via the 22Ne(alpha,n)25Mg reaction. Finally, we\ncompare our cWR models with observed [Ne/He], [C/He] and [O/He] ratios of\nGalactic WC and WO stars.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}