{"id":"2407.02224","title":"Exploiting Spatial Diversity in Earth-to-Satellite Quantum-Classical\n  Communications","authors":"Ziqing Wang, Timothy C. Ralph, Ryan Aguinaldo and Robert Malaney","authorsParsed":[["Wang","Ziqing",""],["Ralph","Timothy C.",""],["Aguinaldo","Ryan",""],["Malaney","Robert",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 12:47:01 GMT"}],"updateDate":"2024-07-03","timestamp":1719924421000,"abstract":"  Despite being an integral part of the vision of quantum Internet,\nEarth-to-satellite (uplink) quantum communications have been considered more\nchallenging than their satellite-to-Earth (downlink) counterparts due to the\nsevere channel-loss fluctuations (fading) induced by atmospheric turbulence.\nThe question of how to address the negative impact of fading on\nEarth-to-satellite quantum communications remains largely an open issue. In\nthis work, we explore the feasibility of exploiting spatial diversity as a\nmeans of fading mitigation in Earth-to-satellite Continuous-Variable (CV)\nquantum-classical optical communications. We demonstrate, via both our\ntheoretical analyses of quantum-state evolution and our detailed numerical\nsimulations of uplink optical channels, that the use of spatial diversity can\nimprove the effectiveness of entanglement distribution through the use of\nmultiple transmitting ground stations and a single satellite with multiple\nreceiving apertures. We further show that the transfer of both large\n(classically-encoded) and small (quantum-modulated) coherent states can benefit\nfrom the use of diversity over fading channels. Our work represents the first\nquantitative investigation into the use of spatial diversity for\nsatellite-based quantum communications in the uplink direction, showing under\nwhat circumstances this fading-mitigation paradigm, which has been widely\nadopted in classical communications, can be helpful within the context of\nEarth-to-satellite CV quantum communications.\n","subjects":["Physics/Quantum Physics","Electrical Engineering and Systems Science/Signal Processing","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}