{"id":"2407.12929","title":"The Foundation Model Transparency Index v1.1: May 2024","authors":"Rishi Bommasani, Kevin Klyman, Sayash Kapoor, Shayne Longpre, Betty\n  Xiong, Nestor Maslej, Percy Liang","authorsParsed":[["Bommasani","Rishi",""],["Klyman","Kevin",""],["Kapoor","Sayash",""],["Longpre","Shayne",""],["Xiong","Betty",""],["Maslej","Nestor",""],["Liang","Percy",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 18:03:37 GMT"}],"updateDate":"2024-07-19","timestamp":1721239417000,"abstract":"  Foundation models are increasingly consequential yet extremely opaque. To\ncharacterize the status quo, the Foundation Model Transparency Index was\nlaunched in October 2023 to measure the transparency of leading foundation\nmodel developers. The October 2023 Index (v1.0) assessed 10 major foundation\nmodel developers (e.g. OpenAI, Google) on 100 transparency indicators (e.g.\ndoes the developer disclose the wages it pays for data labor?). At the time,\ndevelopers publicly disclosed very limited information with the average score\nbeing 37 out of 100. To understand how the status quo has changed, we conduct a\nfollow-up study (v1.1) after 6 months: we score 14 developers against the same\n100 indicators. While in v1.0 we searched for publicly available information,\nin v1.1 developers submit reports on the 100 transparency indicators,\npotentially including information that was not previously public. We find that\ndevelopers now score 58 out of 100 on average, a 21 point improvement over\nv1.0. Much of this increase is driven by developers disclosing information\nduring the v1.1 process: on average, developers disclosed information related\nto 16.6 indicators that was not previously public. We observe regions of\nsustained (i.e. across v1.0 and v1.1) and systemic (i.e. across most or all\ndevelopers) opacity such as on copyright status, data access, data labor, and\ndownstream impact. We publish transparency reports for each developer that\nconsolidate information disclosures: these reports are based on the information\ndisclosed to us via developers. Our findings demonstrate that transparency can\nbe improved in this nascent ecosystem, the Foundation Model Transparency Index\nlikely contributes to these improvements, and policymakers should consider\ninterventions in areas where transparency has not improved.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}