{"id":"2407.01175","title":"RIS: Regularized Imaging Spectroscopy for STIX on-board Solar Orbiter","authors":"Anna Volpara, Alessandro Lupoli, Frank Filbir, Emma Perracchione, Anna\n  Maria Massone, Michele Piana","authorsParsed":[["Volpara","Anna",""],["Lupoli","Alessandro",""],["Filbir","Frank",""],["Perracchione","Emma",""],["Massone","Anna Maria",""],["Piana","Michele",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 10:57:14 GMT"}],"updateDate":"2024-07-02","timestamp":1719831434000,"abstract":"  Imaging spectroscopy, i.e., the generation of spatially resolved count\nspectra and of cubes of count maps at different energies, is one of the main\ngoals of solar hard X-ray missions based on Fourier imaging. For these\ntelescopes, so far imaging spectroscopy has been realized via the generation of\neither count maps independently reconstructed at the different energy channels,\nor electron flux maps reconstructed via deconvolution of the bremsstrahlung\ncross-section. Our aim is to introduce the Regularized Imaging Spectroscopy\nmethod (RIS), in which regularization implemented in the count space imposes a\nsmoothing constraint across contiguous energy channels, without the need to\ndeconvolve the bremsstrahlung effect. STIX records imaging data computing\nvisibilities in the spatial frequency domain. Our RIS is a sequential scheme in\nwhich part of the information coded in the image reconstructed at a specific\nenergy channel is transferred to the reconstruction process at a contiguous\nchannel via visibility interpolation based on Variably Scaled Kernels. In the\ncase of STIX visibilities recorded during the November 11, 2022 flaring event,\nwe show that RIS is able to generate hard X-ray maps whose morphology smoothly\nevolves from one energy channel to the contiguous one, and that from these maps\nit is possible to infer spatially-resolved count spectra characterized by\nnotable numerical stability. We also show that the performances of this\napproach are robust with respect to both the image reconstruction method and\nthe count energy channel utilized to trigger the sequential process. RIS is\nappropriate to construct image cubes from STIX visibilities that are\ncharacterized by a smooth behavior across count energies, thus allowing the\ngeneration of numerically stable (and, thus, physically reliable) local count\nspectra.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}