{"id":"2407.17790","title":"Exploring the Limitations of Kolmogorov-Arnold Networks in\n  Classification: Insights to Software Training and Hardware Implementation","authors":"Van Duy Tran, Tran Xuan Hieu Le, Thi Diem Tran, Hoai Luan Pham, Vu\n  Trung Duong Le, Tuan Hai Vu, Van Tinh Nguyen, and Yasuhiko Nakashima","authorsParsed":[["Tran","Van Duy",""],["Le","Tran Xuan Hieu",""],["Tran","Thi Diem",""],["Pham","Hoai Luan",""],["Le","Vu Trung Duong",""],["Vu","Tuan Hai",""],["Nguyen","Van Tinh",""],["Nakashima","Yasuhiko",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 05:52:48 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 01:14:52 GMT"}],"updateDate":"2024-07-29","timestamp":1721886768000,"abstract":"  Kolmogorov-Arnold Networks (KANs), a novel type of neural network, have\nrecently gained popularity and attention due to the ability to substitute\nmulti-layer perceptions (MLPs) in artificial intelligence (AI) with higher\naccuracy and interoperability. However, KAN assessment is still limited and\ncannot provide an in-depth analysis of a specific domain. Furthermore, no study\nhas been conducted on the implementation of KANs in hardware design, which\nwould directly demonstrate whether KANs are truly superior to MLPs in practical\napplications. As a result, in this paper, we focus on verifying KANs for\nclassification issues, which are a common but significant topic in AI using\nfour different types of datasets. Furthermore, the corresponding hardware\nimplementation is considered using the Vitis high-level synthesis (HLS) tool.\nTo the best of our knowledge, this is the first article to implement hardware\nfor KAN. The results indicate that KANs cannot achieve more accuracy than MLPs\nin high complex datasets while utilizing substantially higher hardware\nresources. Therefore, MLP remains an effective approach for achieving accuracy\nand efficiency in software and hardware implementation.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"kuwNlqBjb25VyDE_COOokAABA1BtFUchNuaNSyYW1ik","pdfSize":"332230"}
