{"id":"2407.02969","title":"Zero-X: A Blockchain-Enabled Open-Set Federated Learning Framework for\n  Zero-Day Attack Detection in IoV","authors":"Abdelaziz Amara korba, Abdelwahab Boualouache, Yacine Ghamri-Doudane","authorsParsed":[["korba","Abdelaziz Amara",""],["Boualouache","Abdelwahab",""],["Ghamri-Doudane","Yacine",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 10:06:15 GMT"}],"updateDate":"2024-07-04","timestamp":1720001175000,"abstract":"  The Internet of Vehicles (IoV) is a crucial technology for Intelligent\nTransportation Systems (ITS) that integrates vehicles with the Internet and\nother entities. The emergence of 5G and the forthcoming 6G networks presents an\nenormous potential to transform the IoV by enabling ultra-reliable,\nlow-latency, and high-bandwidth communications. Nevertheless, as connectivity\nexpands, cybersecurity threats have become a significant concern. The issue has\nbeen further exacerbated by the rising number of zero-day (0-day) attacks,\nwhich can exploit unknown vulnerabilities and bypass existing Intrusion\nDetection Systems (IDSs). In this paper, we propose Zero-X, an innovative\nsecurity framework that effectively detects both 0-day and N-day attacks. The\nframework achieves this by combining deep neural networks with Open-Set\nRecognition (OSR). Our approach introduces a novel scheme that uses blockchain\ntechnology to facilitate trusted and decentralized federated learning (FL) of\nthe ZeroX framework. This scheme also prioritizes privacy preservation,\nenabling both CAVs and Security Operation Centers (SOCs) to contribute their\nunique knowledge while protecting the privacy of their sensitive data. To the\nbest of our knowledge, this is the first work to leverage OSR in combination\nwith privacy-preserving FL to identify both 0-day and N-day attacks in the\nrealm of IoV. The in-depth experiments on two recent network traffic datasets\nshow that the proposed framework achieved a high detection rate while\nminimizing the false positive rate. Comparison with related work showed that\nthe Zero-X framework outperforms existing solutions.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nhxWfgshAAHheMonLz8C_5f9I6o6ZefumYwSDIFA6rI","pdfSize":"1694305"}
