{"id":"2407.15809","title":"Universal Optimization for Non-Clairvoyant Subadditive Joint\n  Replenishment","authors":"Tomer Ezra, Stefano Leonardi, Micha{\\l} Paw{\\l}owski, Matteo Russo,\n  Seeun William Umboh","authorsParsed":[["Ezra","Tomer",""],["Leonardi","Stefano",""],["Pawłowski","Michał",""],["Russo","Matteo",""],["Umboh","Seeun William",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 17:21:07 GMT"}],"updateDate":"2024-07-23","timestamp":1721668867000,"abstract":"  The online joint replenishment problem (JRP) is a fundamental problem in the\narea of online problems with delay. Over the last decade, several works have\nstudied generalizations of JRP with different cost functions for servicing\nrequests. Most prior works on JRP and its generalizations have focused on the\nclairvoyant setting. Recently, Touitou [Tou23a] developed a non-clairvoyant\nframework that provided an $O(\\sqrt{n \\log n})$ upper bound for a wide class of\ngeneralized JRP, where $n$ is the number of request types.\n  We advance the study of non-clairvoyant algorithms by providing a simpler,\nmodular framework that matches the competitive ratio established by Touitou for\nthe same class of generalized JRP. Our key insight is to leverage universal\nalgorithms for Set Cover to approximate arbitrary monotone subadditive\nfunctions using a simple class of functions termed \\textit{disjoint}. This\nallows us to reduce the problem to several independent instances of the TCP\nAcknowledgement problem, for which a simple 2-competitive non-clairvoyant\nalgorithm is known. The modularity of our framework is a major advantage as it\nallows us to tailor the reduction to specific problems and obtain better\ncompetitive ratios. In particular, we obtain tight $O(\\sqrt{n})$-competitive\nalgorithms for two significant problems: Multi-Level Aggregation and Weighted\nSymmetric Subadditive Joint Replenishment. We also show that, in contrast,\nTouitou's algorithm is $\\Omega(\\sqrt{n \\log n})$-competitive for both of these\nproblems.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by/4.0/"}