{"id":"2407.15462","title":"Efficient Retrieval with Learned Similarities","authors":"Bailu Ding, Jiaqi Zhai","authorsParsed":[["Ding","Bailu",""],["Zhai","Jiaqi",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 08:19:34 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 00:57:42 GMT"}],"updateDate":"2024-08-15","timestamp":1721636374000,"abstract":"  Retrieval plays a fundamental role in recommendation systems, search, and\nnatural language processing by efficiently finding relevant items from a large\ncorpus given a query. Dot products have been widely used as the similarity\nfunction in such retrieval tasks, thanks to Maximum Inner Product Search (MIPS)\nthat enabled efficient retrieval based on dot products. However,\nstate-of-the-art retrieval algorithms have migrated to learned similarities.\nSuch algorithms vary in form; the queries can be represented with multiple\nembeddings, complex neural networks can be deployed, the item ids can be\ndecoded directly from queries using beam search, and multiple approaches can be\ncombined in hybrid solutions. Unfortunately, we lack efficient solutions for\nretrieval in these state-of-the-art setups. Our work investigates techniques\nfor approximate nearest neighbor search with learned similarity functions. We\nfirst prove that Mixture-of-Logits (MoL) is a universal approximator, and can\nexpress all learned similarity functions. We next propose techniques to\nretrieve the approximate top K results using MoL with a tight bound. We finally\ncompare our techniques with existing approaches, showing that MoL sets new\nstate-of-the-art results on recommendation retrieval tasks, and our approximate\ntop-k retrieval with learned similarities outperforms baselines by up to two\norders of magnitude in latency, while achieving > .99 recall rate of exact\nalgorithms.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Databases","Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}