{"id":"2407.17573","title":"Ionospheric effect on the synthetic Epoch of Reionization observations\n  with the SKA1-Low","authors":"Samit Kumar Pal, Abhirup Datta, Aishrila Mazumder","authorsParsed":[["Pal","Samit Kumar",""],["Datta","Abhirup",""],["Mazumder","Aishrila",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 18:06:53 GMT"}],"updateDate":"2024-07-26","timestamp":1721844413000,"abstract":"  The redshifted $21$\\,cm signal of neutral hydrogen can be used as a direct\nprobe of the intergalactic medium during Cosmic Dawn\\,(CD) and Epoch of\nReionization\\,(EoR). However, detecting this inherently weak signal has\nnumerous challenges. The major ones include accurate foreground removal from\nlow-frequency radio observations and systematics arising from instrumental\neffects. The Earth's ionosphere poses a major obstacle at these low radio\nfrequencies. Thus, a systematic study of ionospheric effects on these sensitive\nlow-frequency observations is critical, given that the construction of the\nSquare Kilometre Array (SKA1-Low) is in full progress. We use the end-to-end\npipeline, called {\\sc 21cme2e}, to study the effect of time-varying ionospheric\ncorruption on the $21$\\,cm power spectrum recovery. We use two models: a) a\ncatalogue-based model focused on source position shift due to the refractive\neffect of the ionosphere and b) a realistic ionospheric condition generated\nusing Kolmogorov's turbulence model. We assess the effect of the imperfections\nthus generated on the extraction of \\HI\\ $21$\\,cm signal power spectrum. Our\nstudy shows that beyond ``median ionospheric offset\" ($\\theta_{\\text{MIO}}\n\\lesssim 0.1''$), the $21$\\,cm signal from the EoR is unaffected by residual\nionospheric effects. Our study emphasizes the need for the development of\nefficient ionospheric calibration algorithms for the upcoming SKA1-Low\nobservations to extract the \\HI\\ $21$\\,cm power spectra from the CD/EoR.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}