{"id":"2407.00182","title":"Fast Computation of the Discrete Fourier Transform Square Index\n  Coefficients","authors":"Saulo Queiroz and Jo\\~ao P. Vilela and Edmundo Monteiro","authorsParsed":[["Queiroz","Saulo",""],["Vilela","João P.",""],["Monteiro","Edmundo",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 18:37:11 GMT"}],"updateDate":"2024-07-02","timestamp":1719599831000,"abstract":"  The $N$-point discrete Fourier transform (DFT) is a cornerstone for several\nsignal processing applications. Many of these applications operate in\nreal-time, making the computational complexity of the DFT a critical\nperformance indicator to be optimized. Unfortunately, whether the\n$\\mathcal{O}(N\\log_2 N)$ time complexity of the fast Fourier transform (FFT)\ncan be outperformed remains an unresolved question in the theory of\ncomputation. However, in many applications of the DFT -- such as compressive\nsensing, image processing, and wideband spectral analysis -- only a small\nfraction of the output signal needs to be computed because the signal is\nsparse. This motivates the development of algorithms that compute specific DFT\ncoefficients more efficiently than the FFT algorithm. In this article, we show\nthat the number of points of some DFT coefficients can be dramatically reduced\nby means of elementary mathematical properties. We present an algorithm that\ncompacts the square index coefficients (SICs) of DFT (i.e., $X_{k\\sqrt{N}}$,\n$k=0,1,\\cdots, \\sqrt{N}-1$, for a square number $N$) from $N$ to $\\sqrt{N}$\npoints at the expense of $N-1$ complex sums and no multiplication. Based on\nthis, any regular DFT algorithm can be straightforwardly applied to compute the\nSICs with a reduced number of complex multiplications. If $N$ is a power of\ntwo, one can combine our algorithm with the FFT to calculate all SICs in\n$\\mathcal{O}(\\sqrt{N}\\log_2\\sqrt{N})$ time complexity.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Computational Complexity","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}