{"id":"2407.11453","title":"Stochastic branching models for the telomeres dynamics in a model\n  including telomerase activity","authors":"Athanase Benetos (DCAC), Coralie Fritsch (SIMBA, IECL), Emma Horton,\n  Lionel Lenotre (IRIMAS, ARCHIMEDE, PASTA), Simon Toupance (DCAC), Denis\n  Villemonais (SIMBA, IECL, IUF)","authorsParsed":[["Benetos","Athanase","","DCAC"],["Fritsch","Coralie","","SIMBA, IECL"],["Horton","Emma","","IRIMAS, ARCHIMEDE, PASTA"],["Lenotre","Lionel","","IRIMAS, ARCHIMEDE, PASTA"],["Toupance","Simon","","DCAC"],["Villemonais","Denis","","SIMBA, IECL, IUF"]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 07:40:07 GMT"}],"updateDate":"2024-07-17","timestamp":1721115607000,"abstract":"  Telomeres are repetitive sequences of nucleotides at the end of chromosomes,\nwhose evolution over time is intrinsically related to biological ageing. In\nmost cells, with each cell division, telomeres shorten due to the so-called end\nreplication problem, which can lead to replicative senescence and a variety of\nage-related diseases. On the other hand, in certain cells, the presence of the\nenzyme telomerase can lead to the lengthening of telomeres, which may delay or\nprevent the onset of such diseases but can also increase the risk of cancer.In\nthis article, we propose a stochastic representation of this biological model,\nwhich takes into account multiple chromosomes per cell, the effect of\ntelomerase, different cell types and the dependence of the distribution of\ntelomere length on the dynamics of the process. We study theoretical properties\nof this model, including its long-term behaviour. In addition, we investigate\nnumerically the impact of the model parameters on biologically relevant\nquantities, such as the Hayflick limit and the Malthusian parameter of the\npopulation of cells.\n","subjects":["Quantitative Biology/Cell Behavior","Mathematics/Probability","Quantitative Biology/Populations and Evolution"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}