{"id":"2407.14402","title":"The Vision of Autonomic Computing: Can LLMs Make It a Reality?","authors":"Zhiyang Zhang, Fangkai Yang, Xiaoting Qin, Jue Zhang, Qingwei Lin,\n  Gong Cheng, Dongmei Zhang, Saravan Rajmohan, Qi Zhang","authorsParsed":[["Zhang","Zhiyang",""],["Yang","Fangkai",""],["Qin","Xiaoting",""],["Zhang","Jue",""],["Lin","Qingwei",""],["Cheng","Gong",""],["Zhang","Dongmei",""],["Rajmohan","Saravan",""],["Zhang","Qi",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:30:32 GMT"}],"updateDate":"2024-07-22","timestamp":1721403032000,"abstract":"  The Vision of Autonomic Computing (ACV), proposed over two decades ago,\nenvisions computing systems that self-manage akin to biological organisms,\nadapting seamlessly to changing environments. Despite decades of research,\nachieving ACV remains challenging due to the dynamic and complex nature of\nmodern computing systems. Recent advancements in Large Language Models (LLMs)\noffer promising solutions to these challenges by leveraging their extensive\nknowledge, language understanding, and task automation capabilities. This paper\nexplores the feasibility of realizing ACV through an LLM-based multi-agent\nframework for microservice management. We introduce a five-level taxonomy for\nautonomous service maintenance and present an online evaluation benchmark based\non the Sock Shop microservice demo project to assess our framework's\nperformance. Our findings demonstrate significant progress towards achieving\nLevel 3 autonomy, highlighting the effectiveness of LLMs in detecting and\nresolving issues within microservice architectures. This study contributes to\nadvancing autonomic computing by pioneering the integration of LLMs into\nmicroservice management frameworks, paving the way for more adaptive and\nself-managing computing systems. The code will be made available at\nhttps://aka.ms/ACV-LLM.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Multiagent Systems","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}