{"id":"2407.07167","title":"Redshifts of candidate host galaxies of four fast X-ray transients using\n  VLT/MUSE","authors":"Anne Inkenhaag, Peter G. Jonker, Andrew J. Levan, Jonathan\n  Quirola-V\\'asquez, Franz E. Bauer, Deepak Eappachen","authorsParsed":[["Inkenhaag","Anne",""],["Jonker","Peter G.",""],["Levan","Andrew J.",""],["Quirola-Vásquez","Jonathan",""],["Bauer","Franz E.",""],["Eappachen","Deepak",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 18:13:07 GMT"}],"updateDate":"2024-07-11","timestamp":1720548787000,"abstract":"  Fast X-ray transients (FXTs) are X-ray flares lasting minutes to hours.\nMulti-wavelength counterparts to these FXTs have been proven hard to find. As a\nresult distance measurements are through indirect methods such as host galaxy\nidentification. The three main models proposed for FXTs; supernova shock\nbreakout emission (SN SBO), binary neutron star (BNS) mergers and tidal\ndirsuption events (TDEs) of an intermediate mass black hole (IMBH) disrupting a\nwhite dwarf (WD), have a different associated L$_{X, peak}$. Therefore\nobtaining the distance to FXTs will be a powerful probe to investigate the\nnature of these FXTs. We use VLT/MUSE observations of a sample of FXTs to\nreport the redshift of between 13 and 22 galaxies per FXT and use these\nredshifts to calculate the distance, L$_{X, peak}$ and the projected offsets.\nWe find L$_{X, peak}>10^{44}$ erg s$^{-1}$ if we assume any of the sources with\na redshift measurement is the true host galaxy of the corresponding FXT. For\nXRT 100831 we find a very faint galaxy within the 1$\\sigma$ uncertainty region\nwith a chance alignment probability of 0.04. For XRT 060207 we find a candidate\nhost galaxy at z = 0.939 with a low chance alignment probability. However, we\nalso report the detection of a late-type star within the 3$\\sigma$ uncertainty\nregion with a similar chance alignment probability. For the remaining FXTs we\nfind no sources within their 3$\\sigma$ uncertainty regions. We rule out a SN\nSBO nature for all FXTs based on L$_{X, peak}$ and the projected offsets. For\nXRT 100831 we conclude the detected galaxy within the 1$\\sigma$ uncertainty\nposition is likely to be the host galaxy of this FXT. From the available\ninformation, we are not able to determine if XRT 060207 originated from the\ngalaxy found within 1$\\sigma$ of the FXT position or was due to a flare from\nthe late-type star detected within the 3$\\sigma$ uncertainty region.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}