{"id":"2407.01017","title":"Coding for Intelligence from the Perspective of Category","authors":"Wenhan Yang, Zixuan Hu, Lilang Lin, Jiaying Liu, Ling-Yu Duan","authorsParsed":[["Yang","Wenhan",""],["Hu","Zixuan",""],["Lin","Lilang",""],["Liu","Jiaying",""],["Duan","Ling-Yu",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 07:05:44 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 05:47:02 GMT"}],"updateDate":"2024-07-03","timestamp":1719817544000,"abstract":"  Coding, which targets compressing and reconstructing data, and intelligence,\noften regarded at an abstract computational level as being centered around\nmodel learning and prediction, interweave recently to give birth to a series of\nsignificant progress. The recent trends demonstrate the potential homogeneity\nof these two fields, especially when deep-learning models aid these two\ncategories for better probability modeling. For better understanding and\ndescribing from a unified perspective, inspired by the basic generally\nrecognized principles in cognitive psychology, we formulate a novel problem of\nCoding for Intelligence from the category theory view. Based on the three\naxioms: existence of ideal coding, existence of practical coding, and\ncompactness promoting generalization, we derive a general framework to\nunderstand existing methodologies, namely that, coding captures the intrinsic\nrelationships of objects as much as possible, while ignoring information\nirrelevant to downstream tasks. This framework helps identify the challenges\nand essential elements in solving the specific derived Minimal Description\nLength (MDL) optimization problem from a broader range, providing opportunities\nto build a more intelligent system for handling multiple tasks/applications\nwith coding ideas/tools. Centering on those elements, we systematically review\nrecent processes of towards optimizing the MDL problem in more comprehensive\nways from data, model, and task perspectives, and reveal their impacts on the\npotential CfI technical routes. After that, we also present new technique paths\nto fulfill CfI and provide potential solutions with preliminary experimental\nevidence. Last, further directions and remaining issues are discussed as well.\nThe discussion shows our theory can reveal many phenomena and insights about\nlarge foundation models, which mutually corroborate with recent practices in\nfeature learning.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}