{"id":"2407.16364","title":"Harmonizing Visual Text Comprehension and Generation","authors":"Zhen Zhao, Jingqun Tang, Binghong Wu, Chunhui Lin, Shu Wei, Hao Liu,\n  Xin Tan, Zhizhong Zhang, Can Huang, Yuan Xie","authorsParsed":[["Zhao","Zhen",""],["Tang","Jingqun",""],["Wu","Binghong",""],["Lin","Chunhui",""],["Wei","Shu",""],["Liu","Hao",""],["Tan","Xin",""],["Zhang","Zhizhong",""],["Huang","Can",""],["Xie","Yuan",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 10:11:56 GMT"}],"updateDate":"2024-07-24","timestamp":1721729516000,"abstract":"  In this work, we present TextHarmony, a unified and versatile multimodal\ngenerative model proficient in comprehending and generating visual text.\nSimultaneously generating images and texts typically results in performance\ndegradation due to the inherent inconsistency between vision and language\nmodalities. To overcome this challenge, existing approaches resort to\nmodality-specific data for supervised fine-tuning, necessitating distinct model\ninstances. We propose Slide-LoRA, which dynamically aggregates\nmodality-specific and modality-agnostic LoRA experts, partially decoupling the\nmultimodal generation space. Slide-LoRA harmonizes the generation of vision and\nlanguage within a singular model instance, thereby facilitating a more unified\ngenerative process. Additionally, we develop a high-quality image caption\ndataset, DetailedTextCaps-100K, synthesized with a sophisticated closed-source\nMLLM to enhance visual text generation capabilities further. Comprehensive\nexperiments across various benchmarks demonstrate the effectiveness of the\nproposed approach. Empowered by Slide-LoRA, TextHarmony achieves comparable\nperformance to modality-specific fine-tuning results with only a 2% increase in\nparameters and shows an average improvement of 2.5% in visual text\ncomprehension tasks and 4.0% in visual text generation tasks. Our work\ndelineates the viability of an integrated approach to multimodal generation\nwithin the visual text domain, setting a foundation for subsequent inquiries.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}