{"id":"2407.10475","title":"Large-eddy simulation of hydrodynamic noise from turbulent flows past an\n  axisymmetric hull using high-order schemes","authors":"Peng Jiang and Shijun Liao and Bin Xie","authorsParsed":[["Jiang","Peng",""],["Liao","Shijun",""],["Xie","Bin",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 07:04:10 GMT"}],"updateDate":"2024-07-16","timestamp":1721027050000,"abstract":"  In this paper, wall-modeled large-eddy simulation (WMLES) is carried out with\nFfowcs-Williams and Hawkings (FW-H) acoustic analogy to investigate the\nturbulent flow and hydrodynamic noise of an axisymmetric body of revolution. We\nfirst develop the numerical model based on high-order schemes and validate it\nby benchmark test of the turbulent flow around a circular cylinder at Re=10000.\nIt demonstrates the capability of the present scheme to capture the primary\nflow patterns and the acoustic noise in the far field. Then, we conduct the\nnumerical simulation for the turbulent flows around the DARPA SUBOFF without\nappendages at the Reynolds number of Re=1.2*10^7. The numerical results such as\npressure coefficients and velocity fluctuations, are accurately predicted by\nthe present model, which shows closer agreement with the experimental data than\navailable WMLES solutions in the literature. For the parallel midbody of the\nhull, the wall pressure fluctuation reveals a low-frequency broadband spectrum\nwith the majority of signal energy. The surface fluctuating pressure spectrum\nscales to the power of Strouhal number at the different locations, which is\nconsistent with those in the turbulent boundary layer of the plate flows and\nairfoils. Moreover, the acoustic signature in the far field is investigated\nwhere the lowest sound pressure level (SPL) occurs in the upstream and\ndownstream directions while the highest is found in the mid-parallel plane.\nSPLs are relatively close in the region of high acoustic pressure at the\ntransverse plane of x/D=0, which exhibits a maximum difference of 1.2 dB\nbetween locations at different angles. In the vertical plane at z/D=0, the\ndirectivity plot reveals a symmetrical dipole pattern with vertical\nfluctuations stronger than the streamwise fluctuations.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}