{"id":"2407.05850","title":"DFedSat: Communication-Efficient and Robust Decentralized Federated\n  Learning for LEO Satellite Constellations","authors":"Minghao Yang, Jingjing Zhang, Shengyun Liu","authorsParsed":[["Yang","Minghao",""],["Zhang","Jingjing",""],["Liu","Shengyun",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 12:00:49 GMT"}],"updateDate":"2024-07-09","timestamp":1720440049000,"abstract":"  Low Earth Orbit (LEO) satellites play a crucial role in the development of 6G\nmobile networks and space-air-ground integrated systems. Recent advancements in\nspace technology have empowered LEO satellites with the capability to run AI\napplications. However, centralized approaches, where ground stations (GSs) act\nas servers and satellites as clients, often encounter slow convergence and\ninefficiencies due to intermittent connectivity between satellites and GSs. In\ncontrast, decentralized federated learning (DFL) offers a promising alternative\nby facilitating direct communication between satellites (clients) via\ninter-satellite links (ISLs). However, inter-plane ISLs connecting satellites\nfrom different orbital planes are dynamic due to Doppler shifts and pointing\nlimitations. This could impact model propagation and lead to slower\nconvergence. To mitigate these issues, we propose DFedSat, a fully\ndecentralized federated learning framework tailored for LEO satellites. DFedSat\naccelerates the training process by employing two adaptive mechanisms for\nintra-plane and inter-plane model aggregation, respectively. Furthermore, a\nself-compensation mechanism is integrated to enhance the robustness of\ninter-plane ISLs against transmission failure. Additionally, we derive the\nsublinear convergence rate for the non-convex case of DFedSat. Extensive\nexperimental results demonstrate DFedSat's superiority over other DFL baselines\nregarding convergence rate, communication efficiency, and resilience to\nunreliable links.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}