{"id":"2407.05802","title":"Performance Evaluation of MLO for XR Streaming: Can Wi-Fi 7 Meet the\n  Expectations?","authors":"Marc Carrascosa-Zamacois, Lorenzo Galati-Giordano, Francesc Wilhelmi,\n  Gianluca Fontanesi, Anders Jonsson, Giovanni Geraci, Boris Bellalta","authorsParsed":[["Carrascosa-Zamacois","Marc",""],["Galati-Giordano","Lorenzo",""],["Wilhelmi","Francesc",""],["Fontanesi","Gianluca",""],["Jonsson","Anders",""],["Geraci","Giovanni",""],["Bellalta","Boris",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 10:20:06 GMT"}],"updateDate":"2024-07-09","timestamp":1720434006000,"abstract":"  Extended Reality (XR) has stringent throughput and delay requirements that\nare hard to meet with current wireless technologies. Missing these requirements\ncan lead to worsened picture quality, perceived lag between user input and\ncorresponding output, and even dizziness for the end user. In this paper, we\nstudy the capability of upcoming Wi-Fi 7, and its novel support for Multi-Link\nOperation (MLO), to cope with these tight requirements. Our study is based on\nsimulation results extracted from an MLO-compliant simulator that realistically\nreproduces VR traffic. Results show that MLO can sustain VR applications. By\njointly using multiple links with independent channel access procedures, MLO\ncan reduce the overall delay, which is especially useful in the uplink, as it\nhas more stringent requirements than the downlink, and is instrumental in\ndelivering the expected performance. We show that using MLO can allow more\nusers per network than an equivalent number of links using SLO. We also show\nthat while maintaining the same overall bandwidth, a higher number of MLO links\nwith narrow channels leads to lower delays than a lower number of links with\nwider channels.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}