{"id":"2407.16785","title":"PrISM-Observer: Intervention Agent to Help Users Perform Everyday\n  Procedures Sensed using a Smartwatch","authors":"Riku Arakawa, Hiromu Yakura, Mayank Goel","authorsParsed":[["Arakawa","Riku",""],["Yakura","Hiromu",""],["Goel","Mayank",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 18:38:07 GMT"}],"updateDate":"2024-07-25","timestamp":1721759887000,"abstract":"  We routinely perform procedures (such as cooking) that include a set of\natomic steps. Often, inadvertent omission or misordering of a single step can\nlead to serious consequences, especially for those experiencing cognitive\nchallenges such as dementia. This paper introduces PrISM-Observer, a\nsmartwatch-based, context-aware, real-time intervention system designed to\nsupport daily tasks by preventing errors. Unlike traditional systems that\nrequire users to seek out information, the agent observes user actions and\nintervenes proactively. This capability is enabled by the agent's ability to\ncontinuously update its belief in the user's behavior in real-time through\nmultimodal sensing and forecast optimal intervention moments and methods. We\nfirst validated the steps-tracking performance of our framework through\nevaluations across three datasets with different complexities. Then, we\nimplemented a real-time agent system using a smartwatch and conducted a user\nstudy in a cooking task scenario. The system generated helpful interventions,\nand we gained positive feedback from the participants. The general\napplicability of PrISM-Observer to daily tasks promises broad applications, for\ninstance, including support for users requiring more involved interventions,\nsuch as people with dementia or post-surgical patients.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_8s5QdIlRh2NISbzc58PFfjwa2h9S3DFaJyUIU4PIKE","pdfSize":"8609455"}
