{"id":"2407.09536","title":"The Blockchain Risk Parity Line: Moving From The Efficient Frontier To\n  The Final Frontier Of Investments","authors":"Ravi Kashyap","authorsParsed":[["Kashyap","Ravi",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 05:53:57 GMT"}],"updateDate":"2024-07-16","timestamp":1719381237000,"abstract":"  We engineer blockchain based risk managed portfolios by creating three funds\nwith distinct risk and return profiles: 1) Alpha - high risk portfolio; 2) Beta\n- mimics the wider market; and 3) Gamma - represents the risk free rate\nadjusted to beat inflation. Each of the sub-funds (Alpha, Beta and Gamma)\nprovides risk parity because the weight of each asset in the corresponding\nportfolio is set to be inversely proportional to the risk derived from\ninvesting in that asset. This can be equivalently stated as equal risk\ncontributions from each asset towards the overall portfolio risk.\n  We provide detailed mechanics of combining assets - including mathematical\nformulations - to obtain better risk managed portfolios. The descriptions are\nintended to show how a risk parity based efficient frontier portfolio\nmanagement engine - that caters to different risk appetites of investors by\nletting each individual investor select their preferred risk-return combination\n- can be created seamlessly on blockchain.\n  Any Investor - using decentralized ledger technology - can select their\ndesired level of risk, or return, and allocate their wealth accordingly among\nthe sub funds, which balance one another under different market conditions.\nThis evolution of the risk parity principle - resulting in a mechanism that is\ngeared to do well under all market cycles - brings more robust performance and\ncan be termed as conceptual parity.\n  We have given several numerical examples that illustrate the various\nscenarios that arise when combining Alpha, Beta and Gamma to obtain Parity.\n  The final investment frontier is now possible - a modification to the\nefficient frontier, thus becoming more than a mere theoretical construct - on\nblockchain since anyone from anywhere can participate at anytime to obtain\nwealth appreciation based on their financial goals.\n","subjects":["Quantitative Finance/Portfolio Management","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Quantitative Finance/Computational Finance"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}