{"id":"2407.07687","title":"Direct Imaging of a Prolonged Plasma/Current Sheet and Quasiperiodic\n  Magnetic Reconnection on the Sun","authors":"Pankaj Kumar, Judith T. Karpen, Vasyl Yurchyshyn, C. Richard DeVore,\n  Spiro K. Antiochos","authorsParsed":[["Kumar","Pankaj",""],["Karpen","Judith T.",""],["Yurchyshyn","Vasyl",""],["DeVore","C. Richard",""],["Antiochos","Spiro K.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 14:10:23 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 18:50:14 GMT"}],"updateDate":"2024-07-17","timestamp":1720620623000,"abstract":"  Magnetic reconnection is widely believed to be the fundamental process in the\nsolar atmosphere that underlies magnetic energy release and particle\nacceleration. This process is responsible for the onset of solar flares,\ncoronal mass ejections, and other explosive events (e.g., jets). Here, we\nreport direct imaging of a prolonged plasma/current sheet along with\nquasiperiodic magnetic reconnection in the solar corona using\nultra-high-resolution observations from the 1.6-meter Goode Solar Telescope\n(GST) at BBSO and Solar Dynamics Observatory/Atmospheric Imaging Assembly\n(SDO/AIA). The current sheet appeared near a null point in the fan-spine\ntopology and persisted over an extended period (~20 hours). The length and\napparent width of the current sheet were about 6 arcsec and 2 arcsec\nrespectively, and the plasma temperature was ~10-20 MK. We observed\nquasiperiodic plasma inflows and outflows (bidirectional jets with plasmoids)\nat the reconnection site/current sheet. Furthermore, quasiperiodic reconnection\nat the long-lasting current sheet produced recurrent eruptions (small flares\nand jets) and contributed significantly to the recurrent impulsive heating of\nthe active region. Direct imaging of a plasma/current sheet and recurrent\nnull-point reconnection for such an extended period has not been reported\npreviously. These unprecedented observations provide compelling evidence that\nsupports the universal model for solar eruptions (i.e., the breakout model) and\nhave implications for impulsive heating of active regions by recurrent\nreconnection near null points. The prolonged and sustained reconnection for\nabout 20 hours at the breakout current sheet provides new insights into the\ndynamics and energy release processes in the solar corona.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}