{"id":"2407.16791","title":"Towards understanding interactions between the AO system and segment\n  co-phasing with the vector-Zernike wavefront sensor on Keck","authors":"Ma\\\"issa Salama, Charlotte Guthery, Vincent Chambouleyron, Rebecca\n  Jensen-Clem, J. Kent Wallace, Mitchell Troy, Jacques-Robert Delorme, Daren\n  Dillon, Daniel Echeverri, Yeyuan (Yinzi) Xin, Wen Hao (Jerry) Xuan, Nemanja\n  Jovanovic, Dimitri Mawet, Peter L. Wizinowich, Rachel Bowens-Rubin","authorsParsed":[["Salama","Maïssa","","Yinzi"],["Guthery","Charlotte","","Yinzi"],["Chambouleyron","Vincent","","Yinzi"],["Jensen-Clem","Rebecca","","Yinzi"],["Wallace","J. Kent","","Yinzi"],["Troy","Mitchell","","Yinzi"],["Delorme","Jacques-Robert","","Yinzi"],["Dillon","Daren","","Yinzi"],["Echeverri","Daniel","","Yinzi"],["Yeyuan","","","Yinzi"],["Xin","","","Jerry"],["Hao","Wen","","Jerry"],["Xuan","",""],["Jovanovic","Nemanja",""],["Mawet","Dimitri",""],["Wizinowich","Peter L.",""],["Bowens-Rubin","Rachel",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 18:44:53 GMT"}],"updateDate":"2024-07-25","timestamp":1721760293000,"abstract":"  We extend our previous demonstration of the first on-sky primary mirror\nsegment closed-loop control on Keck using a vector-Zernike wavefront sensor\n(vZWFS), which improved the Strehl ratio on the NIRC2 science camera by up to\n10 percentage points. Segment co-phasing errors contribute to Keck contrast\nlimits and will be necessary to correct for the segmented Extremely Large\nTelescopes and future space missions. The goal of the post-AO vZWFS on Keck is\nto monitor and correct segment co-phasing errors in parallel with science\nobservations. The ZWFS is ideal for measuring phase discontinuities and is one\nof the most sensitive WFSs, but has limited dynamic range. The Keck vZWFS\nconsists of a metasurface mask imposing two different phase shifts to\northogonal polarizations, split into two pupil images, extending its dynamic\nrange. We report on the vZWFS closed-loop co-phasing performance and early work\ntowards understanding the interactions between the AO system and segment\nphasing. We discuss a comparison of the AO performance when co-phasing by\naligning segment edges, as is currently done at Keck, compared with aligning to\nthe average phase over the segments, as is done by the vZWFS.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}