{"id":"2407.13695","title":"Enhancing gravitational-wave host localization with SKYFAST: rapid\n  volume and inclination angle reconstruction","authors":"Gabriele Demasi, Giulia Capurri, Angelo Ricciardone, Barbara\n  Patricelli, Massimo Lenti, Walter Del Pozzo","authorsParsed":[["Demasi","Gabriele",""],["Capurri","Giulia",""],["Ricciardone","Angelo",""],["Patricelli","Barbara",""],["Lenti","Massimo",""],["Del Pozzo","Walter",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:00:07 GMT"}],"updateDate":"2024-07-19","timestamp":1721322007000,"abstract":"  The scientific impact of GW170817 strongly supports the need for an efficient\nelectromagnetic follow-up campaign to gravitational-wave event candidates. The\nsuccess of such campaigns depends critically on a fast and accurate\nlocalization of the source. In this paper, we present SKYFAST, a new pipeline\nfor rapid localization of gravitational-wave event hosts. SKYFAST runs\nalongside a full parameter estimation (PE) algorithm, from which posterior\nsamples are taken. It uses these samples to reconstruct an analytical posterior\nfor the sky position, luminosity distance, and inclination angle using a\nDirichlet Process Gaussian Mixture Model, a Bayesian non-parametric method.\nThis approach allows us to provide an accurate localization of the event using\nonly a fraction of the total samples produced by the full PE analysis.\nDepending on the PE algorithm employed, this can lead to significant time\nsavings, which is crucial for identifying the electromagnetic counterpart.\nAdditionally, in a few minutes, SKYFAST generates a ranked list of the most\nprobable galaxy hosts from a galaxy catalog of choice. This list includes\ninformation on the inclination angle posterior conditioned to the position of\neach candidate host, which is useful for assessing the detectability of\ngamma-ray burst structured jet emissions.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}