{"id":"2407.19054","title":"Flusion: Integrating multiple data sources for accurate influenza\n  predictions","authors":"Evan L. Ray, Yijin Wang, Russell D. Wolfinger, Nicholas G. Reich","authorsParsed":[["Ray","Evan L.",""],["Wang","Yijin",""],["Wolfinger","Russell D.",""],["Reich","Nicholas G.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 19:24:02 GMT"}],"updateDate":"2024-07-30","timestamp":1722021842000,"abstract":"  Over the last ten years, the US Centers for Disease Control and Prevention\n(CDC) has organized an annual influenza forecasting challenge with the\nmotivation that accurate probabilistic forecasts could improve situational\nawareness and yield more effective public health actions. Starting with the\n2021/22 influenza season, the forecasting targets for this challenge have been\nbased on hospital admissions reported in the CDC's National Healthcare Safety\nNetwork (NHSN) surveillance system. Reporting of influenza hospital admissions\nthrough NHSN began within the last few years, and as such only a limited amount\nof historical data are available for this signal. To produce forecasts in the\npresence of limited data for the target surveillance system, we augmented these\ndata with two signals that have a longer historical record: 1) ILI+, which\nestimates the proportion of outpatient doctor visits where the patient has\ninfluenza; and 2) rates of laboratory-confirmed influenza hospitalizations at a\nselected set of healthcare facilities. Our model, Flusion, is an ensemble that\ncombines gradient boosting quantile regression models with a Bayesian\nautoregressive model. The gradient boosting models were trained on all three\ndata signals, while the autoregressive model was trained on only the target\nsignal; all models were trained jointly on data for multiple locations. Flusion\nwas the top-performing model in the CDC's influenza prediction challenge for\nthe 2023/24 season. In this article we investigate the factors contributing to\nFlusion's success, and we find that its strong performance was primarily driven\nby the use of a gradient boosting model that was trained jointly on data from\nmultiple surveillance signals and locations. These results indicate the value\nof sharing information across locations and surveillance signals, especially\nwhen doing so adds to the pool of available training data.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Quantitative Biology/Populations and Evolution","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}