{"id":"2407.09270","title":"Computational co-design of structure and feedback controller for\n  locomoting soft robots","authors":"Yuki Sato, Changyoung Yuhn, Hiroki Kobayashi, Atsushi Kawamoto,\n  Tsuyoshi Nomura","authorsParsed":[["Sato","Yuki",""],["Yuhn","Changyoung",""],["Kobayashi","Hiroki",""],["Kawamoto","Atsushi",""],["Nomura","Tsuyoshi",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 13:57:32 GMT"}],"updateDate":"2024-07-15","timestamp":1720792652000,"abstract":"  Soft robots have gained significant attention due to their flexibility and\nsafety, particularly in human-centric applications. The co-design of structure\nand controller in soft robotics has presented a longstanding challenge owing to\nthe complexity of the dynamics involved. Despite some pioneering work dealing\nwith the co-design of soft robot structures and actuation, design freedom has\nbeen limited by stochastic design search approaches. This study proposes the\nsimultaneous optimization of structure and controller for soft robots in\nlocomotion tasks, integrating topology optimization-based structural design\nwith neural network-based feedback controller design. Here, the feedback\ncontroller receives information about the surrounding terrain and outputs\nactuation signals that induce the expansion and contraction of the material. We\nformulate the simultaneous optimization problem under uncertainty in terrains\nand construct an optimization algorithm that utilizes automatic differentiation\nwithin topology optimization and neural networks. We present numerical\nexperiments to demonstrate the validity and effectiveness of our proposed\nmethod.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RA3BZ3t2ZPr8S9wjI6YmiqaJIz_vHlyAaX0rHlp3DtY","pdfSize":"10488153","objectId":"0x2820ee6e829dc1a8e9df70e23496337e9aa9c4bbc1e5be599f6646e95f429833","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
