{"id":"2407.15639","title":"Best of both worlds: Fusing hyperspectral data from two generations of\n  spectro-imagers for X-ray astrophysics","authors":"Julia Lascar, J\\'er\\^ome Bobin, Fabio Acero","authorsParsed":[["Lascar","Julia",""],["Bobin","Jérôme",""],["Acero","Fabio",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 13:58:08 GMT"}],"updateDate":"2024-07-23","timestamp":1721656688000,"abstract":"  With the launch of the X-Ray Imaging and Spectroscopy Mission (XRISM) and the\nadvent of microcalorimeter detectors, X-ray astrophysics is entering in a new\nera of spatially resolved high resolution spectroscopy. But while this new\ngeneration of X-ray telescopes have much finer spectral resolutions than their\npredecessors (e.g. XMM-Newton, Chandra), they also have coarser spatial\nresolutions, leading to problematic cross-pixel contamination. This issue is\ncurrently a critical limitation for the study of extended sources such as\ngalaxy clusters of supernova remnants. To increase the scientific output of\nXRISM's hyperspectral data, we propose to fuse it with XMM-Newton data, and\nseek to obtain a cube with the best spatial and spectral resolution of both\ngenerations. This is the aim of hyperspectral fusion. In this article, we have\nimplemented an algorithm that jointly deconvolves the spatial response of XRISM\nand the spectral response of XMM-Newton. To do so, we construct a forward model\nadapted for instrumental systematic degradations and Poisson noise, then tackle\nhyperspectral fusion as a regularized inverse problem. We test three methods of\nregularization: low rank approximation with Sobolev regularization; low rank\napproximation with 2D wavelet sparsity ; and 2D-1D wavelet sparsity. We test\nour method on toy models constructed from hydrodynamic simulations of supernova\nremnants. We find that our method reconstructs the ground truth well even when\nthe toy model is complex. For the regularization term, we find that while the\nlow rank approximation worked well as a spectral denoiser in models with less\nspectral variability, it introduced a bias in models with more spectral\nvariability, in which case the 2D-1D wavelet sparsity regularization worked\nbest. After demonstrating a proof of concept in this article, we aim to apply\nthis method to real X-ray astrophysical data in the near future.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"BNIWVyQjiiPaXzcy9DZllvn9mzvGJWH2uOEumem7F8s","pdfSize":"2160992"}
