{"id":"2407.10471","title":"GROOT: Generating Robust Watermark for Diffusion-Model-Based Audio\n  Synthesis","authors":"Weizhi Liu, Yue Li, Dongdong Lin, Hui Tian and Haizhou Li","authorsParsed":[["Liu","Weizhi",""],["Li","Yue",""],["Lin","Dongdong",""],["Tian","Hui",""],["Li","Haizhou",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 06:57:19 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 05:43:36 GMT"}],"updateDate":"2024-07-18","timestamp":1721026639000,"abstract":"  Amid the burgeoning development of generative models like diffusion models,\nthe task of differentiating synthesized audio from its natural counterpart\ngrows more daunting. Deepfake detection offers a viable solution to combat this\nchallenge. Yet, this defensive measure unintentionally fuels the continued\nrefinement of generative models. Watermarking emerges as a proactive and\nsustainable tactic, preemptively regulating the creation and dissemination of\nsynthesized content. Thus, this paper, as a pioneer, proposes the generative\nrobust audio watermarking method (Groot), presenting a paradigm for proactively\nsupervising the synthesized audio and its source diffusion models. In this\nparadigm, the processes of watermark generation and audio synthesis occur\nsimultaneously, facilitated by parameter-fixed diffusion models equipped with a\ndedicated encoder. The watermark embedded within the audio can subsequently be\nretrieved by a lightweight decoder. The experimental results highlight Groot's\noutstanding performance, particularly in terms of robustness, surpassing that\nof the leading state-of-the-art methods. Beyond its impressive resilience\nagainst individual post-processing attacks, Groot exhibits exceptional\nrobustness when facing compound attacks, maintaining an average watermark\nextraction accuracy of around 95%.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}