{"id":"2407.09285","title":"MetaFood CVPR 2024 Challenge on Physically Informed 3D Food\n  Reconstruction: Methods and Results","authors":"Jiangpeng He, Yuhao Chen, Gautham Vinod, Talha Ibn Mahmud, Fengqing\n  Zhu, Edward Delp, Alexander Wong, Pengcheng Xi, Ahmad AlMughrabi, Umair\n  Haroon, Ricardo Marques, Petia Radeva, Jiadong Tang, Dianyi Yang, Yu Gao,\n  Zhaoxiang Liang, Yawei Jueluo, Chengyu Shi, Pengyu Wang","authorsParsed":[["He","Jiangpeng",""],["Chen","Yuhao",""],["Vinod","Gautham",""],["Mahmud","Talha Ibn",""],["Zhu","Fengqing",""],["Delp","Edward",""],["Wong","Alexander",""],["Xi","Pengcheng",""],["AlMughrabi","Ahmad",""],["Haroon","Umair",""],["Marques","Ricardo",""],["Radeva","Petia",""],["Tang","Jiadong",""],["Yang","Dianyi",""],["Gao","Yu",""],["Liang","Zhaoxiang",""],["Jueluo","Yawei",""],["Shi","Chengyu",""],["Wang","Pengyu",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 14:15:48 GMT"}],"updateDate":"2024-07-15","timestamp":1720793748000,"abstract":"  The increasing interest in computer vision applications for nutrition and\ndietary monitoring has led to the development of advanced 3D reconstruction\ntechniques for food items. However, the scarcity of high-quality data and\nlimited collaboration between industry and academia have constrained progress\nin this field. Building on recent advancements in 3D reconstruction, we host\nthe MetaFood Workshop and its challenge for Physically Informed 3D Food\nReconstruction. This challenge focuses on reconstructing volume-accurate 3D\nmodels of food items from 2D images, using a visible checkerboard as a size\nreference. Participants were tasked with reconstructing 3D models for 20\nselected food items of varying difficulty levels: easy, medium, and hard. The\neasy level provides 200 images, the medium level provides 30 images, and the\nhard level provides only 1 image for reconstruction. In total, 16 teams\nsubmitted results in the final testing phase. The solutions developed in this\nchallenge achieved promising results in 3D food reconstruction, with\nsignificant potential for improving portion estimation for dietary assessment\nand nutritional monitoring. More details about this workshop challenge and\naccess to the dataset can be found at\nhttps://sites.google.com/view/cvpr-metafood-2024.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}