{"id":"2407.05901","title":"Intelligent Routing as a Service (iRaaS)","authors":"Saptarshi Ghosh, Konstantinos Antonakoglou, Ioannis Mavromatis, and\n  Kostas Katsaros","authorsParsed":[["Ghosh","Saptarshi",""],["Antonakoglou","Konstantinos",""],["Mavromatis","Ioannis",""],["Katsaros","Kostas",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 13:08:30 GMT"}],"updateDate":"2024-07-09","timestamp":1720444110000,"abstract":"  The scope of the Sixth-Generation Self-Organized Networks (6G-SON) advances\nits predecessor's capability towards agility, flexibility, and adaptability.\nOn-demand overlay networking technologies have shown a prominent maturity while\ncoping with the rising complexity and scale of enterprise, service provider,\nand data centre networks. The Software-Defined Networking paradigm has recently\noffered Model Driven Programmability, minimizing network management complexity\nthrough automation and orchestration. However, leveraging Machine\nLearning-driven network optimization, a.k.a. Knowledge-Defined Networking\n(KDN), has still been a domain of interest for the Network Softwarization\nresearch community. In this article, we propose Intelligent Routing as a\nService (iRaaS) architecture as an application layer cognitive routing\nframework for KDNs. iRaaS offers routing logic customization (i.e., customizing\nmetric function and path-finding algorithm) and provides an option to include\nheuristic parameters from trained models as a part of the metric calculation.\niRaaS sits on the application plane above the knowledge plane in a KDN stack,\nthus providing platform- and vendor-agnostic coupling with existing network\ninfrastructures. This article covers the scope of iRaaS by using reliability as\na heuristic for standard path-discovery algorithms, e.g., Shortest Path First\n(SPF) and Diffusion Update algorithm (DUAL), along with the architectural\nspecification. We validate our approach through a Proof-of-Concept deployment.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/"}