{"id":"2407.13316","title":"Deterministic Trajectory Optimization through Probabilistic Optimal\n  Control","authors":"Mohammad Mahmoudi Filabadi, Tom Lefebvre and Guillaume Crevecoeur","authorsParsed":[["Filabadi","Mohammad Mahmoudi",""],["Lefebvre","Tom",""],["Crevecoeur","Guillaume",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:17:47 GMT"}],"updateDate":"2024-07-19","timestamp":1721294267000,"abstract":"  This article proposes two new algorithms tailored to discrete-time\ndeterministic finite-horizon nonlinear optimal control problems or so-called\ntrajectory optimization problems. Both algorithms are inspired by a novel\ntheoretical paradigm known as probabilistic optimal control, that reformulates\noptimal control as an equivalent probabilistic inference problem. This\nperspective allows to address the problem using the Expectation-Maximization\nalgorithm. We show that the application of this algorithm results in a fixed\npoint iteration of probabilistic policies that converge to the deterministic\noptimal policy. Two strategies for policy evaluation are discussed, using\nstate-of-the-art uncertainty quantification methods resulting into two distinct\nalgorithms. The algorithms are structurally closest related to the differential\ndynamic programming algorithm and related methods that use sigma-point methods\nto avoid direct gradient evaluations. The main advantage of our work is an\nimproved balance between exploration and exploitation over the iterations,\nleading to improved numerical stability and accelerated convergence. These\nproperties are demonstrated on different nonlinear systems.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"DA4Ekur8u78o8mvOVFzUmdwKV3aqgFM7rK6itjYid3w","pdfSize":"3373436"}
