{"id":"2407.15033","title":"Research on Real-time Operational Status Evaluation Technology of\n  Automobile Based on Information Data Fusion Algorithm","authors":"Zuo Yanhong, Xia Shilong, Zhou Chao, Yang Kun","authorsParsed":[["Yanhong","Zuo",""],["Shilong","Xia",""],["Chao","Zhou",""],["Kun","Yang",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 01:50:43 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 01:13:37 GMT"}],"updateDate":"2024-08-19","timestamp":1721526643000,"abstract":"  Automobiles have become the main means of transportation for human beings,\nand their failures in the process of operation are directly related to the life\nand property safety of drivers. Therefore, real-time operational status\nevaluation technology have become urgent problems in the current academic\nworld. The premise of real-time operational status evaluation technology of\nautomobiles is to obtain high-quality information data in real time, but the\nautomobile operating environment is complex and changeable, resulting in the\nmeasured information data under the influence of multiple factors, such as\nequipment performance and signal interference. There is an unpredictable\nmeasurement error, which greatly affects the reliability of operational status\nevaluation systems. In this paper, on the basis of studying the structure and\noperation characteristics of automobiles, we design a method that can be used\nfor real-time operational status evaluation of automobiles; through the study\nof fractional-order calculus theory, we establish a mathematical model of\ninformation data fusion based on fractional-order differential operators. By\nproviding high-quality information data to automobile real-time operational\nstatus evaluation systems, real-time operational status evaluation technology\nfor automobile faults can be realized. The feasibility and effectiveness of the\nmethod were verified through an experiment applying the technology in\nautomobile real-time operational status evaluation systems. The research\nresults are of great significance for promoting the development of the\nautomobile industry and ensuring the safety of drivers' lives and property.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/"}