{"id":"2407.01644","title":"Evaluating the Role of Data Enrichment Approaches Towards Rare Event\n  Analysis in Manufacturing","authors":"Chathurangi Shyalika, Ruwan Wickramarachchi, Fadi El Kalach, Ramy\n  Harik, and Amit Sheth","authorsParsed":[["Shyalika","Chathurangi",""],["Wickramarachchi","Ruwan",""],["Kalach","Fadi El",""],["Harik","Ramy",""],["Sheth","Amit",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 00:05:56 GMT"}],"updateDate":"2024-07-03","timestamp":1719792356000,"abstract":"  Rare events are occurrences that take place with a significantly lower\nfrequency than more common regular events. In manufacturing, predicting such\nevents is particularly important, as they lead to unplanned downtime,\nshortening equipment lifespan, and high energy consumption. The occurrence of\nevents is considered frequently-rare if observed in more than 10% of all\ninstances, very-rare if it is 1-5%, moderately-rare if it is 5-10%, and\nextremely-rare if less than 1%. The rarity of events is inversely correlated\nwith the maturity of a manufacturing industry. Typically, the rarity of events\naffects the multivariate data generated within a manufacturing process to be\nhighly imbalanced, which leads to bias in predictive models. This paper\nevaluates the role of data enrichment techniques combined with supervised\nmachine-learning techniques for rare event detection and prediction. To address\nthe data scarcity, we use time series data augmentation and sampling methods to\namplify the dataset with more multivariate features and data points while\npreserving the underlying time series patterns in the combined alterations.\nImputation techniques are used in handling null values in datasets. Considering\n15 learning models ranging from statistical learning to machine learning to\ndeep learning methods, the best-performing model for the selected datasets is\nobtained and the efficacy of data enrichment is evaluated. Based on this\nevaluation, our results find that the enrichment procedure enhances up to 48%\nof F1 measure in rare failure event detection and prediction of supervised\nprediction models. We also conduct empirical and ablation experiments on the\ndatasets to derive dataset-specific novel insights. Finally, we investigate the\ninterpretability aspect of models for rare event prediction, considering\nmultiple methods.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}