{"id":"2407.10151","title":"Lost and Found: Overcoming Detector Failures in Online Multi-Object\n  Tracking","authors":"Lorenzo Vaquero, Yihong Xu, Xavier Alameda-Pineda, Victor M. Brea,\n  Manuel Mucientes","authorsParsed":[["Vaquero","Lorenzo",""],["Xu","Yihong",""],["Alameda-Pineda","Xavier",""],["Brea","Victor M.",""],["Mucientes","Manuel",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 10:45:12 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 14:19:48 GMT"}],"updateDate":"2024-07-17","timestamp":1720953912000,"abstract":"  Multi-object tracking (MOT) endeavors to precisely estimate the positions and\nidentities of multiple objects over time. The prevailing approach,\ntracking-by-detection (TbD), first detects objects and then links detections,\nresulting in a simple yet effective method. However, contemporary detectors may\noccasionally miss some objects in certain frames, causing trackers to cease\ntracking prematurely. To tackle this issue, we propose BUSCA, meaning `to\nsearch', a versatile framework compatible with any online TbD system, enhancing\nits ability to persistently track those objects missed by the detector,\nprimarily due to occlusions. Remarkably, this is accomplished without modifying\npast tracking results or accessing future frames, i.e., in a fully online\nmanner. BUSCA generates proposals based on neighboring tracks, motion, and\nlearned tokens. Utilizing a decision Transformer that integrates multimodal\nvisual and spatiotemporal information, it addresses the object-proposal\nassociation as a multi-choice question-answering task. BUSCA is trained\nindependently of the underlying tracker, solely on synthetic data, without\nrequiring fine-tuning. Through BUSCA, we showcase consistent performance\nenhancements across five different trackers and establish a new\nstate-of-the-art baseline across three different benchmarks. Code available at:\nhttps://github.com/lorenzovaquero/BUSCA.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"CsOJHoZmfqfSD-33-fbqnxtJaTwQQ3byvgVrHZrveWA","pdfSize":"12649160"}
