{"id":"2407.00063","title":"An Interpretable Alternative to Neural Representation Learning for\n  Rating Prediction -- Transparent Latent Class Modeling of User Reviews","authors":"Giuseppe Serra, Peter Tino, Zhao Xu, Xin Yao","authorsParsed":[["Serra","Giuseppe",""],["Tino","Peter",""],["Xu","Zhao",""],["Yao","Xin",""]],"versions":[{"version":"v1","created":"Mon, 17 Jun 2024 07:07:42 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 11:17:45 GMT"}],"updateDate":"2024-07-03","timestamp":1718608062000,"abstract":"  Nowadays, neural network (NN) and deep learning (DL) techniques are widely\nadopted in many applications, including recommender systems. Given the sparse\nand stochastic nature of collaborative filtering (CF) data, recent works have\ncritically analyzed the effective improvement of neural-based approaches\ncompared to simpler and often transparent algorithms for recommendation.\nPrevious results showed that NN and DL models can be outperformed by\ntraditional algorithms in many tasks. Moreover, given the largely black-box\nnature of neural-based methods, interpretable results are not naturally\nobtained. Following on this debate, we first present a transparent\nprobabilistic model that topologically organizes user and product latent\nclasses based on the review information. In contrast to popular neural\ntechniques for representation learning, we readily obtain a statistical,\nvisualization-friendly tool that can be easily inspected to understand user and\nproduct characteristics from a textual-based perspective. Then, given the\nlimitations of common embedding techniques, we investigate the possibility of\nusing the estimated interpretable quantities as model input for a rating\nprediction task. To contribute to the recent debates, we evaluate our results\nin terms of both capacity for interpretability and predictive performances in\ncomparison with popular text-based neural approaches. The results demonstrate\nthat the proposed latent class representations can yield competitive predictive\nperformances, compared to popular, but difficult-to-interpret approaches.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ioGfDfFvtmkN6Ek-bXcFKLJUTyeAT8a3elKnacQ_sps","pdfSize":"708768","objectId":"0x6801dcca4a99297f24084d17e25bb5febde5ada46bc33221662e5b14b256a417","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
