{"id":"2407.07530","title":"How Aligned are Different Alignment Metrics?","authors":"Jannis Ahlert, Thomas Klein, Felix Wichmann and Robert Geirhos","authorsParsed":[["Ahlert","Jannis",""],["Klein","Thomas",""],["Wichmann","Felix",""],["Geirhos","Robert",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 10:36:11 GMT"}],"updateDate":"2024-07-11","timestamp":1720607771000,"abstract":"  In recent years, various methods and benchmarks have been proposed to\nempirically evaluate the alignment of artificial neural networks to human\nneural and behavioral data. But how aligned are different alignment metrics? To\nanswer this question, we analyze visual data from Brain-Score (Schrimpf et al.,\n2018), including metrics from the model-vs-human toolbox (Geirhos et al.,\n2021), together with human feature alignment (Linsley et al., 2018; Fel et al.,\n2022) and human similarity judgements (Muttenthaler et al., 2022). We find that\npairwise correlations between neural scores and behavioral scores are quite low\nand sometimes even negative. For instance, the average correlation between\nthose 80 models on Brain-Score that were fully evaluated on all 69 alignment\nmetrics we considered is only 0.198. Assuming that all of the employed metrics\nare sound, this implies that alignment with human perception may best be\nthought of as a multidimensional concept, with different methods measuring\nfundamentally different aspects. Our results underline the importance of\nintegrative benchmarking, but also raise questions about how to correctly\ncombine and aggregate individual metrics. Aggregating by taking the arithmetic\naverage, as done in Brain-Score, leads to the overall performance currently\nbeing dominated by behavior (95.25% explained variance) while the neural\npredictivity plays a less important role (only 33.33% explained variance). As a\nfirst step towards making sure that different alignment metrics all contribute\nfairly towards an integrative benchmark score, we therefore conclude by\ncomparing three different aggregation options.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"781sB-CXcluwV-SyedXo_257dWXdD_OpIttXhBsk-Mo","pdfSize":"461802","objectId":"0xd10a69c9862efd54cc4acd407a6bc906a7d7ce5b1128ecbca827f68aadf8fc58","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
