{"id":"2407.13705","title":"Design, fabrication and testing of Al/p-Si Schottky and pn junctions for\n  radiation studies","authors":"E. Giulio Villani, Dengfeng Zhang, Adnan Malik, Trevor Vickey, Yebo\n  Chen, Matthew G. Kurth, Peilian Liu, Hongbo Zhu, Thomas Koffas, Christoph\n  Thomas Klein, Robert Vandusen, Rodney Aiton, Angela Mccormick, Garry Tarr","authorsParsed":[["Villani","E. Giulio",""],["Zhang","Dengfeng",""],["Malik","Adnan",""],["Vickey","Trevor",""],["Chen","Yebo",""],["Kurth","Matthew G.",""],["Liu","Peilian",""],["Zhu","Hongbo",""],["Koffas","Thomas",""],["Klein","Christoph Thomas",""],["Vandusen","Robert",""],["Aiton","Rodney",""],["Mccormick","Angela",""],["Tarr","Garry",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 09:39:49 GMT"}],"updateDate":"2024-07-19","timestamp":1719394789000,"abstract":"  Strip and pixels sensors, fabricated on high resistivity silicon substrate,\nnormally of p-type, are used in detectors for High Energy Physics (HEP)\ntypically in a hybrid detector assembly. Furthermore, and owing to their\ninherent advantages over hybrid sensors, Monolithic Active Pixel Sensors (MAPS)\nfabricated in CMOS technology have been increasingly implemented in HEP\nexperiments. In all cases, their use in higher radiation areas (HL-LHC and\nbeyond) will require options to improve their radiation hardness and time\nresolution. These aspects demand a deep understanding of their radiation damage\nand reliable models to predict their behaviours at high fluences. As a first\nstep, we fabricated several Schottky and n-on-p diodes, to allow a comparison\nof results and provide a backup solution for test devices, on 6 or 4-inch\np-type silicon wafers with 50 {\\mu}m epitaxial thickness and of doping\nconcentration as they are normally used in HEP detectors and CMOS MAPS devices.\nIn this paper, details of the design and fabrication process, along with test\nresults of the fabricated devices before irradiation, will be provided.\nAdditional test results on irradiated devices will be provided in subsequent\npublications.\n","subjects":["Physics/Instrumentation and Detectors","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/"}