{"id":"2407.09641","title":"The Orbit and Dynamical Mass of Polaris: Observations with the CHARA\n  Array","authors":"Nancy Remage Evans, Gail Schaefer, Alexandre Gallenne, Guillermo\n  Torres, Elliot P. Horch, Richard I Anderson, John Monnier, Rachael M.\n  Roettenbacher, Fabien Baron, Narsireddy Anugu, James W. Davidson, Jr., Pierre\n  Kervella, Garance Bras, Charles Proffitt, Antoine M\\'erand, Margarita\n  Karovska, Jeremy Jones, Cyprien Lanthermann, Stefan Kraus, Isabelle Codron,\n  Howard E. Bond, and Giordano Viviani","authorsParsed":[["Evans","Nancy Remage",""],["Schaefer","Gail",""],["Gallenne","Alexandre",""],["Torres","Guillermo",""],["Horch","Elliot P.",""],["Anderson","Richard I",""],["Monnier","John",""],["Roettenbacher","Rachael M.",""],["Baron","Fabien",""],["Anugu","Narsireddy",""],["Davidson,","James W.","Jr."],["Kervella","Pierre",""],["Bras","Garance",""],["Proffitt","Charles",""],["Mérand","Antoine",""],["Karovska","Margarita",""],["Jones","Jeremy",""],["Lanthermann","Cyprien",""],["Kraus","Stefan",""],["Codron","Isabelle",""],["Bond","Howard E.",""],["Viviani","Giordano",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 18:58:21 GMT"}],"updateDate":"2024-07-16","timestamp":1720810701000,"abstract":"  The 30 year orbit of the Cepheid Polaris has been followed with observations\nby the\n  CHARA Array (Center for High Angular Resolution Astronomy) from 2016 through\n  2021. An additional\n  measurement has been made with speckle interferometry at the Apache Point\nObservatory.\n  Detection of the companion is complicated\n  by its comparative faintness--an extreme flux ratio. Angular diameter\n  measurements appear to show some variation with pulsation phase.\n  Astrometric positions of the companion were measured with a custom grid-based\nmodel-fitting procedure and confirmed with the\n  CANDID software. These positions were combined with the extensive radial\nvelocities\n  discussed by Torres (2023) to fit an orbit. Because of the imbalance of the\nsizes\n  of the astrometry and radial velocity datasets, several methods of weighting\n  are discussed. The resulting mass of the Cepheid\n  is 5.13$\\pm$ 0.28 $M_\\odot$.\n  Because of the comparatively large eccentricity of the orbit (0.63), the mass\nderived\n  is sensitive to the value found for the eccentricity.\n  The mass combined with the distance shows that the Cepheid\n  is more luminous than predicted for this mass from evolutionary tracks.\n  The identification\n  of surface spots is discussed. This would give credence to the identification\nof\n  photometric variation with a period of approximately 120 days as a rotation\nperiod.\n  Polaris has some unusual properties (rapid period change, a phase jump,\n  variable amplitude, unusual polarization). However, a\n  pulsation scenario involving pulsation mode,\n  orbital periastron passage (Torres 2023), and low pulsation amplitude can\nexplain\n  these characteristics within the framework of pulsation seen in Cepheids.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}