{"id":"2407.10911","title":"Counting the Unseen I: Nuclear Density Scaling Relations for Nucleated\n  Galaxies","authors":"Christian H. Hannah, Anil C. Seth, Nicholas C. Stone, Sjoert van\n  Velzen","authorsParsed":[["Hannah","Christian H.",""],["Seth","Anil C.",""],["Stone","Nicholas C.",""],["van Velzen","Sjoert",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:11:38 GMT"}],"updateDate":"2024-07-16","timestamp":1721063498000,"abstract":"  The volumetric rate of tidal disruption events (TDEs) encodes information on\nthe still-unknown demographics of central massive black holes (MBHs) in\nlow-mass galaxies ($\\lesssim 10^9$~M$_\\odot$). Theoretical TDE rates from model\ngalaxy samples can extract this information, but this requires accurately\ndefining the nuclear stellar density structures. This region is typically\ndominated by nuclear star clusters (NSCs), which have been shown to increase\nTDE rates by orders of magnitude. Thus, we assemble the largest available\nsample of pc-scale 3-D density profiles that include NSC components. We\ndeproject the PSF-deconvolved surface brightness profiles of 91 nearby galaxies\nof varying morphology and combine these with nuclear mass-to-light ratios\nestimated from measured colors or spectral synthesis to create 3-D mass density\nprofiles. We fit the inner 3-D density profile to find the best-fit power-law\ndensity profile in each galaxy. We compile this information as a function of\ngalaxy stellar mass to fit new empirical density scaling relations. These fits\nreveal positive correlations between galaxy stellar mass and central stellar\ndensity in both early- and late-type galaxies. We find that early-type galaxies\nhave somewhat higher densities and shallower profiles relative to late-type\ngalaxies at the same mass. We also use the density profiles to estimate the\ninfluence radius of each galaxy's MBH and find that the sphere of influence was\nlikely resolved in most cases. These new relations will be used in future works\nto build mock galaxy samples for dynamical TDE rate calculations, with the aim\nof constraining MBH demographics in low-mass galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}