{"id":"2407.14568","title":"SQLfuse: Enhancing Text-to-SQL Performance through Comprehensive LLM\n  Synergy","authors":"Tingkai Zhang, Chaoyu Chen, Cong Liao, Jun Wang, Xudong Zhao, Hang Yu,\n  Jianchao Wang, Jianguo Li, Wenhui Shi","authorsParsed":[["Zhang","Tingkai",""],["Chen","Chaoyu",""],["Liao","Cong",""],["Wang","Jun",""],["Zhao","Xudong",""],["Yu","Hang",""],["Wang","Jianchao",""],["Li","Jianguo",""],["Shi","Wenhui",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 06:01:57 GMT"}],"updateDate":"2024-07-23","timestamp":1721368917000,"abstract":"  Text-to-SQL conversion is a critical innovation, simplifying the transition\nfrom complex SQL to intuitive natural language queries, especially significant\ngiven SQL's prevalence in the job market across various roles. The rise of\nLarge Language Models (LLMs) like GPT-3.5 and GPT-4 has greatly advanced this\nfield, offering improved natural language understanding and the ability to\ngenerate nuanced SQL statements. However, the potential of open-source LLMs in\nText-to-SQL applications remains underexplored, with many frameworks failing to\nleverage their full capabilities, particularly in handling complex database\nqueries and incorporating feedback for iterative refinement. Addressing these\nlimitations, this paper introduces SQLfuse, a robust system integrating\nopen-source LLMs with a suite of tools to enhance Text-to-SQL translation's\naccuracy and usability. SQLfuse features four modules: schema mining, schema\nlinking, SQL generation, and a SQL critic module, to not only generate but also\ncontinuously enhance SQL query quality. Demonstrated by its leading performance\non the Spider Leaderboard and deployment by Ant Group, SQLfuse showcases the\npractical merits of open-source LLMs in diverse business contexts.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Databases"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}