{"id":"2407.10890","title":"Thinking Fast and Slow: Data-Driven Adaptive DeFi Borrow-Lending\n  Protocol","authors":"Mahsa Bastankhah, Viraj Nadkarni, Xuechao Wang, Chi Jin, Sanjeev\n  Kulkarni, Pramod Viswanath","authorsParsed":[["Bastankhah","Mahsa",""],["Nadkarni","Viraj",""],["Wang","Xuechao",""],["Jin","Chi",""],["Kulkarni","Sanjeev",""],["Viswanath","Pramod",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:39:21 GMT"}],"updateDate":"2024-07-16","timestamp":1721061561000,"abstract":"  Decentralized finance (DeFi) borrowing and lending platforms are crucial to\nthe decentralized economy, involving two main participants: lenders who provide\nassets for interest and borrowers who offer collateral exceeding their debt and\npay interest. Collateral volatility necessitates over-collateralization to\nprotect lenders and ensure competitive returns. Traditional DeFi platforms use\na fixed interest rate curve based on the utilization rate (the fraction of\navailable assets borrowed) and determine over-collateralization offline through\nsimulations to manage risk. This method doesn't adapt well to dynamic market\nchanges, such as price fluctuations and evolving user needs, often resulting in\nlosses for lenders or borrowers. In this paper, we introduce an adaptive,\ndata-driven protocol for DeFi borrowing and lending. Our approach includes a\nhigh-frequency controller that dynamically adjusts interest rates to maintain\nmarket stability and competitiveness with external markets. Unlike traditional\nprotocols, which rely on user reactions and often adjust slowly, our controller\nuses a learning-based algorithm to quickly find optimal interest rates,\nreducing the opportunity cost for users during periods of misalignment with\nexternal rates. Additionally, we use a low-frequency planner that analyzes user\nbehavior to set an optimal over-collateralization ratio, balancing risk\nreduction with profit maximization over the long term. This dual approach is\nessential for adaptive markets: the short-term component maintains market\nstability, preventing exploitation, while the long-term planner optimizes\nmarket parameters to enhance profitability and reduce risks. We provide\ntheoretical guarantees on the convergence rates and adversarial robustness of\nthe short-term component and the long-term effectiveness of our protocol.\nEmpirical validation confirms our protocol's theoretical benefits.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}