{"id":"2407.17807","title":"Ab-initio study of quantum oscillation in altermagnetic and nonmagnetic\n  phases of RuO$_2$","authors":"Yingliang Huang, Junwen Lai, Jie Zhan, Peitao Liu, Xing-Qiu Chen, Yan\n  Sun","authorsParsed":[["Huang","Yingliang",""],["Lai","Junwen",""],["Zhan","Jie",""],["Liu","Peitao",""],["Chen","Xing-Qiu",""],["Sun","Yan",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 06:32:27 GMT"}],"updateDate":"2024-07-26","timestamp":1721889147000,"abstract":"  Altermagnet (AM) is a new proposed magnetic state with collinear\nantiferromagnetic ground state but presents some transport properties that were\nonly believed to exist in ferromagnets or non-collinear antiferromagnets. To\nhave a comprehensive understanding of the transport properties of AMs,\nespecially from the experimental point of view, a promising altermagnetic metal\nis crucial. In all the proposed altermagnetic metals, RuO$_2$ has a special\nposition, since it is the first proposed AM with the largest spin splitting and\nseveral important altermagnetism featured experiments were first performed\nbased on it. However, a very recent report based on sensitive muon-spin\nmeasurements suggest a super small local magnetization from Ru, i.e. a\nnonmagnetic ground state in RuO$_2$. Therefore, a determination of the\nexistence of the altermagnetic ground state is the basic starting point for all\nthe previously altermagnetic transport properties in RuO$_2$. In this work, we\npropose to identify its magnetic ground state from the Fermi surface (FS) via\nthe electronic transport property of quantum oscillation (QO). We\nsystematically analyzed the FSs of RuO$_2$ in both nonmagnetic and\naltermagnetic states via first principles calculations. Our work should be\nhelpful for future experiments on QO measurements to confirm its ground state\nby the interplay between transport measurements and computations.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}