{"id":"2407.19639","title":"Segmented Private Data Aggregation in the Multi-message Shuffle Model","authors":"Shaowei Wang, Ruilin Yang, Sufen Zeng, Kaiqi Yu, Rundong Mei,\n  Shaozheng Huang, Wei Yang","authorsParsed":[["Wang","Shaowei",""],["Yang","Ruilin",""],["Zeng","Sufen",""],["Yu","Kaiqi",""],["Mei","Rundong",""],["Huang","Shaozheng",""],["Yang","Wei",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 01:46:44 GMT"}],"updateDate":"2024-07-30","timestamp":1722217604000,"abstract":"  The shuffle model of differential privacy (DP) offers compelling\nprivacy-utility trade-offs in decentralized settings (e.g., internet of things,\nmobile edge networks). Particularly, the multi-message shuffle model, where\neach user may contribute multiple messages, has shown that accuracy can\napproach that of the central model of DP. However, existing studies typically\nassume a uniform privacy protection level for all users, which may deter\nconservative users from participating and prevent liberal users from\ncontributing more information, thereby reducing the overall data utility, such\nas the accuracy of aggregated statistics. In this work, we pioneer the study of\nsegmented private data aggregation within the multi-message shuffle model of\nDP, introducing flexible privacy protection for users and enhanced utility for\nthe aggregation server. Our framework not only protects users' data but also\nanonymizes their privacy level choices to prevent potential data leakage from\nthese choices. To optimize the privacy-utility-communication trade-offs, we\nexplore approximately optimal configurations for the number of blanket messages\nand conduct almost tight privacy amplification analyses within the shuffle\nmodel. Through extensive experiments, we demonstrate that our segmented\nmulti-message shuffle framework achieves a reduction of about 50\\% in\nestimation error compared to existing approaches, significantly enhancing both\nprivacy and utility.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}