{"id":"2407.15597","title":"Terahertz and gigahertz magneto-ratchets in graphene-based 2D\n  metamaterials","authors":"Marcel Hild, Erwin M\\\"onch, Leonid E. Golub, Ivan A. Dmitriev, Ivan\n  Yahniuk, Katharina Amann, Julia Amann, Jonathan Eroms, J\\\"org Wunderlich,\n  Dieter Weiss, Christophe Consejo, Cedric Bray, Kenneth Maussang, Frederic\n  Teppe, Joanna Gumenjuk-Sichevska, Kenji Watanabe, Takashi Taniguchi, Sergey\n  D. Ganichev","authorsParsed":[["Hild","Marcel",""],["Mönch","Erwin",""],["Golub","Leonid E.",""],["Dmitriev","Ivan A.",""],["Yahniuk","Ivan",""],["Amann","Katharina",""],["Amann","Julia",""],["Eroms","Jonathan",""],["Wunderlich","Jörg",""],["Weiss","Dieter",""],["Consejo","Christophe",""],["Bray","Cedric",""],["Maussang","Kenneth",""],["Teppe","Frederic",""],["Gumenjuk-Sichevska","Joanna",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Ganichev","Sergey D.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 12:40:51 GMT"}],"updateDate":"2024-07-23","timestamp":1721652051000,"abstract":"  We report on the observation and study of the magneto-ratchet effect in a\ngraphene-based two-dimensional metamaterial formed by a graphite gate that is\nplaced below a graphene monolayer and patterned with an array of triangular\nantidots. We demonstrate that terahertz/gigahertz excitation of the\nmetamaterial leads to sign-alternating magneto-oscillations with an amplitude\nthat exceeds the ratchet current at zero magnetic field by orders of magnitude.\nThe oscillations are shown to be related to the Shubnikov-de Haas effect. In\naddition to the giant ratchet current oscillations we detect resonant ratchet\ncurrents caused by the cyclotron and electron spin resonances. The results are\nwell described by the developed theory considering the magneto-ratchet effect\ncaused by the interplay of the near-field radiation and the nonuniform periodic\nelectrostatic potential of the metamaterial controlled by the gate voltages.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}