{"id":"2407.02797","title":"Solving Motion Planning Tasks with a Scalable Generative Model","authors":"Yihan Hu, Siqi Chai, Zhening Yang, Jingyu Qian, Kun Li, Wenxin Shao,\n  Haichao Zhang, Wei Xu, Qiang Liu","authorsParsed":[["Hu","Yihan",""],["Chai","Siqi",""],["Yang","Zhening",""],["Qian","Jingyu",""],["Li","Kun",""],["Shao","Wenxin",""],["Zhang","Haichao",""],["Xu","Wei",""],["Liu","Qiang",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 03:57:05 GMT"}],"updateDate":"2024-07-04","timestamp":1719979025000,"abstract":"  As autonomous driving systems being deployed to millions of vehicles, there\nis a pressing need of improving the system's scalability, safety and reducing\nthe engineering cost. A realistic, scalable, and practical simulator of the\ndriving world is highly desired. In this paper, we present an efficient\nsolution based on generative models which learns the dynamics of the driving\nscenes. With this model, we can not only simulate the diverse futures of a\ngiven driving scenario but also generate a variety of driving scenarios\nconditioned on various prompts. Our innovative design allows the model to\noperate in both full-Autoregressive and partial-Autoregressive modes,\nsignificantly improving inference and training speed without sacrificing\ngenerative capability. This efficiency makes it ideal for being used as an\nonline reactive environment for reinforcement learning, an evaluator for\nplanning policies, and a high-fidelity simulator for testing. We evaluated our\nmodel against two real-world datasets: the Waymo motion dataset and the nuPlan\ndataset. On the simulation realism and scene generation benchmark, our model\nachieves the state-of-the-art performance. And in the planning benchmarks, our\nplanner outperforms the prior arts. We conclude that the proposed generative\nmodel may serve as a foundation for a variety of motion planning tasks,\nincluding data generation, simulation, planning, and online training. Source\ncode is public at https://github.com/HorizonRobotics/GUMP/\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}