{"id":"2407.06631","title":"A Systematic Review of Echo Chamber Research: Comparative Analysis of\n  Conceptualizations, Operationalizations, and Varying Outcomes","authors":"David Hartmann, Lena Pohlmann, Sonja Mei Wang, and Bettina Berendt","authorsParsed":[["Hartmann","David",""],["Pohlmann","Lena",""],["Wang","Sonja Mei",""],["Berendt","Bettina",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 07:56:26 GMT"}],"updateDate":"2024-07-10","timestamp":1720511786000,"abstract":"  This systematic review synthesizes current research on echo chambers and\nfilter bubbles to highlight the reasons for the dissent in echo chamber\nresearch on the existence, antecedents, and effects of the phenomenon. The\nreview of 112 studies reveals that the lack of consensus in echo chamber\nresearch is based on different conceptualizations and operationalizations of\necho chambers. While studies that have conceptualized echo chambers with\nhomophily and utilized data-driven computational social science (CSS) methods\nhave confirmed the echo chamber hypothesis and polarization effects in social\nmedia, content exposure studies and surveys that have explored the full\nspectrum of media exposure have rejected it.\n  Most of these studies have been conducted in the United States, and the\nreview emphasizes the need for a more comprehensive understanding of how echo\nchambers work in systems with more than two parties and outside the Global\nNorth. To advance our understanding of this phenomenon, future research should\nprioritize conducting more cross-platform studies, considering algorithmic\nfiltering changes through continuous auditing, and examining the causal\ndirection of the association between polarization, fragmentation, and the\nestablishment of online echo chambers. The review also provides the advantages\nand disadvantages of different operationalizations and makes recommendations\nfor studies in the European Union (EU), which will become possible with the\nupcoming Digital Services Act (DSA). Overall, this systematic review\ncontributes to the ongoing scholarly discussion on the existence, antecedents,\nand effects of echo chambers and filter bubbles.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Computers and Society","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}