{"id":"2407.11866","title":"FitteR for Accretion ProPErties of T Tauri stars (FRAPPE): A new\n  approach to use Class III spectra to derive stellar and accretion properties","authors":"R.A.B. Claes, J. Campbell-White, C.F. Manara, A. Frasca, A. Natta,\n  J.M. Alcal\\'a, A. Armeni, M. Fang, J.B. Lovell, B. Stelzer, L. Venuti, M.\n  Wyatt, and A. Queitsch","authorsParsed":[["Claes","R. A. B.",""],["Campbell-White","J.",""],["Manara","C. F.",""],["Frasca","A.",""],["Natta","A.",""],["Alcalá","J. M.",""],["Armeni","A.",""],["Fang","M.",""],["Lovell","J. B.",""],["Stelzer","B.",""],["Venuti","L.",""],["Wyatt","M.",""],["Queitsch","A.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:51:28 GMT"}],"updateDate":"2024-07-17","timestamp":1721145088000,"abstract":"  Studies of the stellar and accretion properties of classical T Tauri stars\n(CTTS) require comparison with photospheric spectral templates. Here we aim at\nexpanding the currently available grid of wide-wavelength coverage observed\nspectra of non-accreting stars with additional new spectra and an interpolation\nmethod that allows us to obtain a continuous grid of low resolution spectra\nranging from spectral type G8 to M9.5, while also mitigating observational\nuncertainties. This interpolated grid is then implemented in the\nself-consistent method to derive stellar and accretion properties of CTTS. With\nthe new templates, we aim to estimate a lower limit on the accretion\nluminosities that can be obtained through a study of the UV excess emission\nusing observed templates. We analyse the molecular photospheric features\npresent in the VLT/X-Shooter spectra of the targets to perform a spectral\nclassification, including estimates of their extinction. We apply a\nnon-parametric fitting method to the full grid of observed templates to obtain\nan interpolated grid of templates. We use the uncertainties on our interpolated\ngrid to estimate a lower limit on the accretion luminosity that we can measure\nwith this method. We find that the measurable accretion luminosities ranges\nfrom $\\sim 2.7$ dex lower than the stellar luminosity in M5.5 stars to $\\sim\n1.3$ dex lower for G8 stars. For young stars with masses of $\\sim 1M_{\\odot}$\nand ages of 3-6 Myr this limit translates into an observational limit of mass\naccretion rate on the order of $10^{-10} \\rm M_{\\odot}/yr$. The implementation\nof an interpolated grid of observed templates allows us to better disentangle\ndegenerate solutions, leading to a more reliable estimate of accretion rates in\nyoung accreting stars.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LKSS-wduPXxHI72FynBQGU--AEqfsWebZ2xG7cdHUcY","pdfSize":"21184457","objectId":"0xdb8135d514b26b24079debd6fbada9c18f3b249e8ad34516572fc43bdd2f9a21","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
