{"id":"2407.09945","title":"Optical and UV Flares from Binary Black Hole Mergers in Active Galactic\n  Nuclei","authors":"Juan C. Rodr\\'iguez-Ram\\'irez, Rodrigo Nemmen, Cl\\'ecio R. Bom","authorsParsed":[["Rodríguez-Ramírez","Juan C.",""],["Nemmen","Rodrigo",""],["Bom","Clécio R.",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 17:01:33 GMT"}],"updateDate":"2024-07-16","timestamp":1720890093000,"abstract":"  Stellar mass, binary black hole (BBH) mergers dominates the sources of\ngravitational wave (GW) events so far detected the LIGO/Virgo/KAGRA (LVK)\nexperiment. The origin of these BBHs is unknown, and no electromagnetic (EM)\ncounterpart has been undoubtedly associated to any of such GW events. The thin\ndiscs of active galactic nuclei (AGNs) might be viable environments where BBHs\ncan form and at the same time produce observable radiation feedback. This paper\npresents new physically motivated light-curve (LC) solutions for thermal flares\ndriven by the remnant of a BBH merger within the disc of an AGN. Following\nprevious analyses, we consider that the BBH likely creates an under-density\ncavity in the disc prior to its coalescence. Depending on the merger\nconditions, the black hole (BH) remnant can leave the cavity, interact with the\nunperturbed disc, and drive a transient BH wind. The wind expels disc material\nthat expands above and below the disc plane and we consider the emission of\nthese plasma ejections as the EM counterpart to the merger GW. We model the LC\nof such eruptions as mini supernovae explosions finding that stellar mass\nmerger remnants can drive distinguishable flares in optical and UV bands, with\ntime lags of $\\sim 10-40$ ($100-400$) days after the GW event, lasting for a\nfew days (weeks) when occurring in AGN with central engines of $\\sim 10^6$\n($10^7$) M$_\\odot$. The Vera C. Rubin Observatory can potentially detect the\noptical component of these EM counterparts up to redshifts of $z \\sim 0.5 - 1$,\naccordingly. The present LC models are applicable to localise flaring AGNs as\nsources of multi-messenger emission following GW alerts.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}