{"id":"2407.19235","title":"B-ISAC: Backscatter Integrated Sensing and Communication for 6G IoE\n  Applications","authors":"Zongyao Zhao, Yuhan Dong, Tiankuo Wei, Xiao-Ping Zhang, Xinke Tang,\n  and Zhenyu Liu","authorsParsed":[["Zhao","Zongyao",""],["Dong","Yuhan",""],["Wei","Tiankuo",""],["Zhang","Xiao-Ping",""],["Tang","Xinke",""],["Liu","Zhenyu",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 11:36:40 GMT"}],"updateDate":"2024-07-30","timestamp":1722080200000,"abstract":"  The integration of backscatter communication (BackCom) technology with\nintegrated sensing and communication (ISAC) technology not only enhances the\nsystem sensing performance, but also enables low-power information\ntransmission. This is expected to provide a new paradigm for communication and\nsensing in internet of everything (IoE) applications. Existing works only\nconsider sensing rate and detection performance, while none consider the\nestimation performance. The design of the system in different task modes also\nneeds to be further studied. In this paper, we propose a novel system called\nbackscatter-ISAC (B-ISAC) and design a joint beamforming framework for\ndifferent stages (task modes). We derive communication performance metrics of\nthe system in terms of the signal-to-interference-plus-noise ratio (SINR) and\ncommunication rate, and derive sensing performance metrics of the system in\nterms of probability of detection, estimation error of linear least squares\n(LS) estimation, and the estimation error of linear minimum mean square error\n(LMMSE) estimation. The proposed joint beamforming framework consists of three\nstages: tag detection, tag estimation, and communication enhancement. We\ndevelop corresponding joint beamforming schemes aimed at enhancing the\nperformance objectives of their respective stages by solving complex non-convex\noptimization problems. Extensive simulation results demonstrate the\neffectiveness of the proposed joint beamforming schemes. The proposed B-ISAC\nsystem has broad application prospect in sixth generation (6G) IoE scenarios.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}