{"id":"2407.09468","title":"Beyond Euclid: An Illustrated Guide to Modern Machine Learning with\n  Geometric, Topological, and Algebraic Structures","authors":"Sophia Sanborn, Johan Mathe, Mathilde Papillon, Domas Buracas, Hansen\n  J Lillemark, Christian Shewmake, Abby Bertics, Xavier Pennec, Nina Miolane","authorsParsed":[["Sanborn","Sophia",""],["Mathe","Johan",""],["Papillon","Mathilde",""],["Buracas","Domas",""],["Lillemark","Hansen J",""],["Shewmake","Christian",""],["Bertics","Abby",""],["Pennec","Xavier",""],["Miolane","Nina",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 17:48:36 GMT"}],"updateDate":"2024-07-15","timestamp":1720806516000,"abstract":"  The enduring legacy of Euclidean geometry underpins classical machine\nlearning, which, for decades, has been primarily developed for data lying in\nEuclidean space. Yet, modern machine learning increasingly encounters richly\nstructured data that is inherently nonEuclidean. This data can exhibit\nintricate geometric, topological and algebraic structure: from the geometry of\nthe curvature of space-time, to topologically complex interactions between\nneurons in the brain, to the algebraic transformations describing symmetries of\nphysical systems. Extracting knowledge from such non-Euclidean data\nnecessitates a broader mathematical perspective. Echoing the 19th-century\nrevolutions that gave rise to non-Euclidean geometry, an emerging line of\nresearch is redefining modern machine learning with non-Euclidean structures.\nIts goal: generalizing classical methods to unconventional data types with\ngeometry, topology, and algebra. In this review, we provide an accessible\ngateway to this fast-growing field and propose a graphical taxonomy that\nintegrates recent advances into an intuitive unified framework. We subsequently\nextract insights into current challenges and highlight exciting opportunities\nfor future development in this field.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mt_2hjB8exbwYFWEHGwOG6q0RkKUtu37v_ShTc_XeJw","pdfSize":"20642751"}
