{"id":"2407.01974","title":"Asymptotics of estimators for structured covariance matrices","authors":"Hendrik Paul Lopuha\\\"a","authorsParsed":[["Lopuhaä","Hendrik Paul",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 06:21:26 GMT"}],"updateDate":"2024-07-03","timestamp":1719901286000,"abstract":"  We show that the limiting variance of a sequence of estimators for a\nstructured covariance matrix has a general form that appears as the variance of\na scaled projection of a random matrix that is of radial type and a similar\nresult is obtained for the corresponding sequence of estimators for the vector\nof variance components. These results are illustrated by the limiting behavior\nof estimators for a linear covariance structure in a variety of multivariate\nstatistical models. We also derive a characterization for the influence\nfunction of corresponding functionals. Furthermore, we derive the limiting\ndistribution and influence function of scale invariant mappings of such\nestimators and their corresponding functionals. As a consequence, the\nasymptotic relative efficiency of different estimators for the shape component\nof a structured covariance matrix can be compared by means of a single scalar\nand the gross error sensitivity of the corresponding influence functions can be\ncompared by means of a single index. Similar results are obtained for\nestimators of the normalized vector of variance components. We apply our\nresults to investigate how the efficiency, gross error sensitivity, and\nbreakdown point of S-estimators for the normalized variance components are\naffected simultaneously by varying their cutoff value.\n","subjects":["Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kk3t42PZFBb3hJ3SOvqCcihFHQPvxnzN41f8uz6Gv9E","pdfSize":"601871","objectId":"0xeb03a96b36b62366a9f41c0addcd79cd47ace1cfb16ea99eee3500c43fb7c6cf","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
