{"id":"2407.16354","title":"Strike a Balance in Continual Panoptic Segmentation","authors":"Jinpeng Chen, Runmin Cong, Yuxuan Luo, Horace Ho Shing Ip, and Sam\n  Kwong","authorsParsed":[["Chen","Jinpeng",""],["Cong","Runmin",""],["Luo","Yuxuan",""],["Ip","Horace Ho Shing",""],["Kwong","Sam",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 09:58:20 GMT"}],"updateDate":"2024-07-24","timestamp":1721728700000,"abstract":"  This study explores the emerging area of continual panoptic segmentation,\nhighlighting three key balances. First, we introduce past-class backtrace\ndistillation to balance the stability of existing knowledge with the\nadaptability to new information. This technique retraces the features\nassociated with past classes based on the final label assignment results,\nperforming knowledge distillation targeting these specific features from the\nprevious model while allowing other features to flexibly adapt to new\ninformation. Additionally, we introduce a class-proportional memory strategy,\nwhich aligns the class distribution in the replay sample set with that of the\nhistorical training data. This strategy maintains a balanced class\nrepresentation during replay, enhancing the utility of the limited-capacity\nreplay sample set in recalling prior classes. Moreover, recognizing that replay\nsamples are annotated only for the classes of their original step, we devise\nbalanced anti-misguidance losses, which combat the impact of incomplete\nannotations without incurring classification bias. Building upon these\ninnovations, we present a new method named Balanced Continual Panoptic\nSegmentation (BalConpas). Our evaluation on the challenging ADE20K dataset\ndemonstrates its superior performance compared to existing state-of-the-art\nmethods. The official code is available at\nhttps://github.com/jinpeng0528/BalConpas.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}