{"id":"2407.14405","title":"Impurity flat band states in the diamond chain","authors":"Anselmo M. Marques, David Viedma, Ver\\`onica Ahufinger, Ricardo G.\n  Dias","authorsParsed":[["Marques","Anselmo M.",""],["Viedma","David",""],["Ahufinger","Verònica",""],["Dias","Ricardo G.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:33:04 GMT"}],"updateDate":"2024-07-22","timestamp":1721403184000,"abstract":"  Flat band (FB) systems, i.e., models hosting dispersionless bands in their\nenergy spectrum, have attracted great interest recently. The eigenstates of\nthese FBs can be written as compact localized states (CLSs), meaning states\nhaving finite support only over a small, non-extensive portion of the lattice.\nWhen adjacent CLSs of a FB have spatial overlap, the subspace they span is, in\ngeneral, non-orthogonal. Here, we consider precisely this scenario, in the form\nof a diamond chain with a finite magnetic flux per plaquette, which has a\ngapped midspectrum FB. After developing the general framework for projecting\narbitrary operators onto a non-orthogonal subspace, we address the case of an\nopen chain with small local impurities in the midchain plaquette. The framework\nis then applied to derive analytical expressions for the states of the FB\naffected by the impurities. The results are illustrated for three\nrepresentative cases: two equal impurities, two symmetric impurities, and a\nsingle impurity. We also address the effects of diagonal disorder on the\nimpurity states. Focusing on the equal impurities case, we show how these\nstates effectively feel an averaged disorder determined by their spatial\nextension, which can be controlled by the flux. Due to this averaging effect,\nthese states exhibit enhanced robustness to disorder. For the single-impurity\ncase, we further reveal its exotic non-trivial topological phase, without\nprecedent in the literature on Hermitian models, characterized by a\nhalf-integer winding number. By mapping the system onto an equivalent\ntwo-dimensional (2D) tight-binding lattice decorated with a central impurity\nline, the half-integer bulk invariants are shown to have a correspondence with\nthe appearance of a single in-gap edge state when open boundary conditions\n(OBC) are imposed. Numerical simulations are performed to benchmark all\nanalytical predictions.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3bI44L73fQkfkfsPDw_pP3Z-fnq6YZbCSvlieN9L7Fc","pdfSize":"14298903"}
