{"id":"2407.04352","title":"UpStory: the Uppsala Storytelling dataset","authors":"Marc Fraile, Natalia Calvo-Barajas, Anastasia Sophia Apeiron, Giovanna\n  Varni, Joakim Lindblad, Nata\\v{s}a Sladoje, Ginevra Castellano","authorsParsed":[["Fraile","Marc",""],["Calvo-Barajas","Natalia",""],["Apeiron","Anastasia Sophia",""],["Varni","Giovanna",""],["Lindblad","Joakim",""],["Sladoje","Nataša",""],["Castellano","Ginevra",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 08:46:16 GMT"}],"updateDate":"2024-07-08","timestamp":1720169176000,"abstract":"  Friendship and rapport play an important role in the formation of\nconstructive social interactions, and have been widely studied in educational\nsettings due to their impact on student outcomes. Given the growing interest in\nautomating the analysis of such phenomena through Machine Learning (ML), access\nto annotated interaction datasets is highly valuable. However, no dataset on\ndyadic child-child interactions explicitly capturing rapport currently exists.\nMoreover, despite advances in the automatic analysis of human behaviour, no\nprevious work has addressed the prediction of rapport in child-child dyadic\ninteractions in educational settings. We present UpStory -- the Uppsala\nStorytelling dataset: a novel dataset of naturalistic dyadic interactions\nbetween primary school aged children, with an experimental manipulation of\nrapport. Pairs of children aged 8-10 participate in a task-oriented activity:\ndesigning a story together, while being allowed free movement within the play\narea. We promote balanced collection of different levels of rapport by using a\nwithin-subjects design: self-reported friendships are used to pair each child\ntwice, either minimizing or maximizing pair separation in the friendship\nnetwork. The dataset contains data for 35 pairs, totalling 3h 40m of audio and\nvideo recordings. It includes two video sources covering the play area, as well\nas separate voice recordings for each child. An anonymized version of the\ndataset is made publicly available, containing per-frame head pose, body pose,\nand face features; as well as per-pair information, including the level of\nrapport. Finally, we provide ML baselines for the prediction of rapport.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}