{"id":"2407.10943","title":"GRUtopia: Dream General Robots in a City at Scale","authors":"Hanqing Wang, Jiahe Chen, Wensi Huang, Qingwei Ben, Tai Wang, Boyu Mi,\n  Tao Huang, Siheng Zhao, Yilun Chen, Sizhe Yang, Peizhou Cao, Wenye Yu, Zichao\n  Ye, Jialun Li, Junfeng Long, Zirui Wang, Huiling Wang, Ying Zhao, Zhongying\n  Tu, Yu Qiao, Dahua Lin, Jiangmiao Pang","authorsParsed":[["Wang","Hanqing",""],["Chen","Jiahe",""],["Huang","Wensi",""],["Ben","Qingwei",""],["Wang","Tai",""],["Mi","Boyu",""],["Huang","Tao",""],["Zhao","Siheng",""],["Chen","Yilun",""],["Yang","Sizhe",""],["Cao","Peizhou",""],["Yu","Wenye",""],["Ye","Zichao",""],["Li","Jialun",""],["Long","Junfeng",""],["Wang","Zirui",""],["Wang","Huiling",""],["Zhao","Ying",""],["Tu","Zhongying",""],["Qiao","Yu",""],["Lin","Dahua",""],["Pang","Jiangmiao",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:40:46 GMT"}],"updateDate":"2024-07-16","timestamp":1721065246000,"abstract":"  Recent works have been exploring the scaling laws in the field of Embodied\nAI. Given the prohibitive costs of collecting real-world data, we believe the\nSimulation-to-Real (Sim2Real) paradigm is a crucial step for scaling the\nlearning of embodied models. This paper introduces project GRUtopia, the first\nsimulated interactive 3D society designed for various robots. It features\nseveral advancements: (a) The scene dataset, GRScenes, includes 100k\ninteractive, finely annotated scenes, which can be freely combined into\ncity-scale environments. In contrast to previous works mainly focusing on home,\nGRScenes covers 89 diverse scene categories, bridging the gap of\nservice-oriented environments where general robots would be initially deployed.\n(b) GRResidents, a Large Language Model (LLM) driven Non-Player Character (NPC)\nsystem that is responsible for social interaction, task generation, and task\nassignment, thus simulating social scenarios for embodied AI applications. (c)\nThe benchmark, GRBench, supports various robots but focuses on legged robots as\nprimary agents and poses moderately challenging tasks involving Object\nLoco-Navigation, Social Loco-Navigation, and Loco-Manipulation. We hope that\nthis work can alleviate the scarcity of high-quality data in this field and\nprovide a more comprehensive assessment of Embodied AI research. The project is\navailable at https://github.com/OpenRobotLab/GRUtopia.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}