{"id":"2407.18625","title":"Topology Optimization of Random Memristors for Input-Aware Dynamic SNN","authors":"Bo Wang, Shaocong Wang, Ning Lin, Yi Li, Yifei Yu, Yue Zhang, Jichang\n  Yang, Xiaoshan Wu, Yangu He, Songqi Wang, Rui Chen, Guoqi Li, Xiaojuan Qi,\n  Zhongrui Wang, and Dashan Shang","authorsParsed":[["Wang","Bo",""],["Wang","Shaocong",""],["Lin","Ning",""],["Li","Yi",""],["Yu","Yifei",""],["Zhang","Yue",""],["Yang","Jichang",""],["Wu","Xiaoshan",""],["He","Yangu",""],["Wang","Songqi",""],["Chen","Rui",""],["Li","Guoqi",""],["Qi","Xiaojuan",""],["Wang","Zhongrui",""],["Shang","Dashan",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 09:35:02 GMT"}],"updateDate":"2024-07-29","timestamp":1721986502000,"abstract":"  There is unprecedented development in machine learning, exemplified by recent\nlarge language models and world simulators, which are artificial neural\nnetworks running on digital computers. However, they still cannot parallel\nhuman brains in terms of energy efficiency and the streamlined adaptability to\ninputs of different difficulties, due to differences in signal representation,\noptimization, run-time reconfigurability, and hardware architecture. To address\nthese fundamental challenges, we introduce pruning optimization for input-aware\ndynamic memristive spiking neural network (PRIME). Signal representation-wise,\nPRIME employs leaky integrate-and-fire neurons to emulate the brain's inherent\nspiking mechanism. Drawing inspiration from the brain's structural plasticity,\nPRIME optimizes the topology of a random memristive spiking neural network\nwithout expensive memristor conductance fine-tuning. For runtime\nreconfigurability, inspired by the brain's dynamic adjustment of computational\ndepth, PRIME employs an input-aware dynamic early stop policy to minimize\nlatency during inference, thereby boosting energy efficiency without\ncompromising performance. Architecture-wise, PRIME leverages memristive\nin-memory computing, mirroring the brain and mitigating the von Neumann\nbottleneck. We validated our system using a 40 nm 256 Kb memristor-based\nin-memory computing macro on neuromorphic image classification and image\ninpainting. Our results demonstrate the classification accuracy and Inception\nScore are comparable to the software baseline, while achieving maximal\n62.50-fold improvements in energy efficiency, and maximal 77.0% computational\nload savings. The system also exhibits robustness against stochastic synaptic\nnoise of analogue memristors. Our software-hardware co-designed model paves the\nway to future brain-inspired neuromorphic computing with brain-like energy\nefficiency and adaptivity.\n","subjects":["Computing Research Repository/Emerging Technologies","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}