{"id":"2407.01330","title":"Learning Unsigned Distance Fields from Local Shape Functions for 3D\n  Surface Reconstruction","authors":"Jiangbei Hu, Yanggeng Li, Fei Hou, Junhui Hou, Zhebin Zhang, Shengfa\n  Wang, Na Lei, Ying He","authorsParsed":[["Hu","Jiangbei",""],["Li","Yanggeng",""],["Hou","Fei",""],["Hou","Junhui",""],["Zhang","Zhebin",""],["Wang","Shengfa",""],["Lei","Na",""],["He","Ying",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 14:39:03 GMT"}],"updateDate":"2024-07-02","timestamp":1719844743000,"abstract":"  Unsigned distance fields (UDFs) provide a versatile framework for\nrepresenting a diverse array of 3D shapes, encompassing both watertight and\nnon-watertight geometries. Traditional UDF learning methods typically require\nextensive training on large datasets of 3D shapes, which is costly and often\nnecessitates hyperparameter adjustments for new datasets. This paper presents a\nnovel neural framework, LoSF-UDF, for reconstructing surfaces from 3D point\nclouds by leveraging local shape functions to learn UDFs. We observe that 3D\nshapes manifest simple patterns within localized areas, prompting us to create\na training dataset of point cloud patches characterized by mathematical\nfunctions that represent a continuum from smooth surfaces to sharp edges and\ncorners. Our approach learns features within a specific radius around each\nquery point and utilizes an attention mechanism to focus on the crucial\nfeatures for UDF estimation. This method enables efficient and robust surface\nreconstruction from point clouds without the need for shape-specific training.\nAdditionally, our method exhibits enhanced resilience to noise and outliers in\npoint clouds compared to existing methods. We present comprehensive experiments\nand comparisons across various datasets, including synthetic and real-scanned\npoint clouds, to validate our method's efficacy.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}