{"id":"2407.01068","title":"Adaptive energy reference for machine-learning models of the electronic\n  density of states","authors":"Wei Bin How, Sanggyu Chong, Federico Grasselli, Kevin K.\n  Huguenin-Dumittan, Michele Ceriotti","authorsParsed":[["How","Wei Bin",""],["Chong","Sanggyu",""],["Grasselli","Federico",""],["Huguenin-Dumittan","Kevin K.",""],["Ceriotti","Michele",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:17:22 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 09:05:03 GMT"}],"updateDate":"2024-07-03","timestamp":1719821842000,"abstract":"  The electronic density of states (DOS) provides information regarding the\ndistribution of electronic states in a material, and can be used to approximate\nits optical and electronic properties and therefore guide computational\nmaterial design. Given its usefulness and relative simplicity, it has been one\nof the first electronic properties used as target for machine-learning\napproaches going beyond interatomic potentials. A subtle but important point,\nwell-appreciated in the condensed matter community but usually overlooked in\nthe construction of data-driven models, is that for bulk configurations the\nabsolute energy reference of single-particle energy levels is ill-defined. Only\nenergy differences matter, and quantities derived from the DOS are typically\nindependent on the absolute alignment. We introduce an adaptive scheme that\noptimizes the energy reference of each structure as part of training, and show\nthat it consistently improves the quality of ML models compared to traditional\nchoices of energy reference, for different classes of materials and different\nmodel architectures. On a practical level, we trace the improved performance to\nthe ability of this self-aligning scheme to match the most prominent features\nin the DOS. More broadly, we believe that this work highlights the importance\nof incorporating insights into the nature of the physical target into the\ndefinition of the architecture and of the appropriate figures of merit for\nmachine-learning models, that translate in better transferability and overall\nperformance.\n","subjects":["Condensed Matter/Materials Science","Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}