{"id":"2407.13821","title":"The First Evidence of a Host Star Metallicity Cut-off In The Formation\n  of Super-Earth Planets","authors":"Kiersten M. Boley, Jessie L. Christiansen, Jon Zink, Kevin\n  Hardegree-Ullman, Eve J. Lee, Philip F. Hopkins, Ji Wang, Rachel B.\n  Fernandes, Galen J. Bergsten, and Sakhee Bhure","authorsParsed":[["Boley","Kiersten M.",""],["Christiansen","Jessie L.",""],["Zink","Jon",""],["Hardegree-Ullman","Kevin",""],["Lee","Eve J.",""],["Hopkins","Philip F.",""],["Wang","Ji",""],["Fernandes","Rachel B.",""],["Bergsten","Galen J.",""],["Bhure","Sakhee",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 18:00:02 GMT"}],"updateDate":"2024-07-22","timestamp":1721325602000,"abstract":"  Planet formation is expected to be severely limited in disks of low\nmetallicity, owing to both the small solid mass reservoir and the low opacity\naccelerating the disk gas dissipation. While previous studies have found a weak\ncorrelation between the occurrence rates of small planets ($\\leq$4R$_\\oplus$)\nand stellar metallicity, so far no studies have probed below the metallicity\nlimit beyond which planet formation is predicted to be suppressed. Here, we\nconstructed a large catalog of ~110,000 metal-poor stars observed by the TESS\nmission with spectroscopically-derived metallicities, and systematically probed\nplanet formation within the metal-poor regime ([Fe/H] $\\leq$ -0.5) for the\nfirst time. Extrapolating known higher-metallicity trends for small,\nshort-period planets predicts the discovery of ~68 superEarths around these\nstars (~85,000 stars) after accounting for survey completeness; however, we\ndetect none. As a result, we have placed the most stringent upper limit on\nsuper-Earth occurrence rates around metal-poor stars (-0.75 < [Fe/H] $\\leq$\n-0.5) to date, $\\leq$ 1.67%, a statistically significant (p-value=0.000685)\ndeviation from the prediction of metallicity trends derived with Kepler and K2.\nWe find a clear host star metallicity cliff for super-Earths that could\nindicate the threshold below which planets are unable to grow beyond an\nEarth-mass at short orbital periods. This finding provides a crucial input to\nplanet formation theories, and has implications for the small planet inventory\nof the Galaxy and the galactic epoch at which the formation of small planets\nstarted.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}