{"id":"2407.09457","title":"How coronal mass ejections are influenced by the morphology and toroidal\n  flux of their source magnetic flux ropes?","authors":"J. H. Guo, L. Linan, S. Poedts, Y. Guo, B. Schmieder, A. Lani, Y. W.\n  Ni, M. Brchnelova, B. Perri, T. Baratashvili, S. T. Li, P. F. Chen","authorsParsed":[["Guo","J. H.",""],["Linan","L.",""],["Poedts","S.",""],["Guo","Y.",""],["Schmieder","B.",""],["Lani","A.",""],["Ni","Y. W.",""],["Brchnelova","M.",""],["Perri","B.",""],["Baratashvili","T.",""],["Li","S. T.",""],["Chen","P. F.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 17:41:05 GMT"}],"updateDate":"2024-07-15","timestamp":1720806065000,"abstract":"  Coronal mass ejections (CMEs) stand as intense eruptions of magnetized plasma\nfrom the Sun, playing a pivotal role in driving significant changes of the\nheliospheric environment. Deducing the properties of CMEs from their\nprogenitors in solar source regions is crucial for space weather forecasting.\nDeducing the properties of CMEs from their progenitors in solar source regions\nis crucial for space weather forecasting. The primary objective of this paper\nis to establish a connection between CMEs and their progenitors in solar source\nregions, enabling us to infer the magnetic structures of CMEs before their full\ndevelopment. To this end, we create a dataset comprising a magnetic flux rope\nseries with varying projection shapes, sizes and toroidal fluxes, using the\nRegularized Biot-Savart Laws (RBSL). Thereafter, we simulate the propagation of\nthese flux ropes from the solar surface to a distance of 25$R_{\\odot}$ with our\nglobal coronal MHD model which is named COCONUT. Our parametric survey reveals\nsignificant impacts of source flux ropes on the consequent CMEs. We find that\nthe projection shape can influence the magnetic structures of CMEs at\n20$R_{\\odot}$, albeit with minimal impacts on the propagation speed. However,\nthese impacts diminish as source flux ropes become fat. In terms of toroidal\nflux, our simulation results demonstrate a pronounced correlation with the\npropagation speed of CMEs, as well as the successfulness in erupting. This work\nbuilds the bridge between the CMEs in the outer corona and their progenitors in\nsolar source regions. Our parametric survey suggests that the projection shape,\ncross-section radius and toroidal flux of source flux ropes are crucial\nparameters in predicting magnetic structures and propagation speed of CMEs,\nproviding valuable insights for space weather prediction.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies","Physics/Space Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}