{"id":"2407.13070","title":"The Cost of Arbitrariness for Individuals: Examining the Legal and\n  Technical Challenges of Model Multiplicity","authors":"Prakhar Ganesh, Ihsan Ibrahim Daldaban, Ignacio Cofone, Golnoosh\n  Farnadi","authorsParsed":[["Ganesh","Prakhar",""],["Daldaban","Ihsan Ibrahim",""],["Cofone","Ignacio",""],["Farnadi","Golnoosh",""]],"versions":[{"version":"v1","created":"Tue, 28 May 2024 21:54:03 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 09:33:20 GMT"}],"updateDate":"2024-09-16","timestamp":1716933243000,"abstract":"  Model multiplicity, the phenomenon where multiple models achieve similar\nperformance despite different underlying learned functions, introduces\narbitrariness in model selection. While this arbitrariness may seem\ninconsequential in expectation, its impact on individuals can be severe. This\npaper explores various individual concerns stemming from multiplicity,\nincluding the effects of arbitrariness beyond final predictions, disparate\narbitrariness for individuals belonging to protected groups, and the challenges\nassociated with the arbitrariness of a single algorithmic system creating a\nmonopoly across various contexts. It provides both an empirical examination of\nthese concerns and a comprehensive analysis from the legal standpoint,\naddressing how these issues are perceived in the anti-discrimination law in\nCanada. We conclude the discussion with technical challenges in the current\nlandscape of model multiplicity to meet legal requirements and the legal gap\nbetween current law and the implications of arbitrariness in model selection,\nhighlighting relevant future research directions for both disciplines.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AJ2xB9fCDcanEHqhVVYGIh-Ub9YHkmAKvgKurAzDZMI","pdfSize":"311926","objectId":"0x93fc97e62f44a3f02c371b6569d58ce354e21839699e390ed2520912fe417d36","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
