{"id":"2407.13829","title":"The Local Group L-Band Survey: The First Measurements of Localized Cold\n  Neutral Medium Properties in the Low-Metallicity Dwarf Galaxy NGC 6822","authors":"Nickolas M. Pingel, Hongxing Chen, Sne\\v{z}ana Stanimirovi\\'c, Eric W.\n  Koch, Adam K. Leroy, Erik Rosolowsky, Chang-Goo Kim, Julianne J. Dalcanton,\n  Fabian Walter, Michael P. Busch, Ryan Chown, Jennifer Donovan Meyer, Cosima\n  Eibensteiner, Deidre A. Hunter, Sumit K. Sarbadhicary, Elizabeth Tarantino,\n  Vicente Villanueva, Thomas G. Williams","authorsParsed":[["Pingel","Nickolas M.",""],["Chen","Hongxing",""],["Stanimirović","Snežana",""],["Koch","Eric W.",""],["Leroy","Adam K.",""],["Rosolowsky","Erik",""],["Kim","Chang-Goo",""],["Dalcanton","Julianne J.",""],["Walter","Fabian",""],["Busch","Michael P.",""],["Chown","Ryan",""],["Meyer","Jennifer Donovan",""],["Eibensteiner","Cosima",""],["Hunter","Deidre A.",""],["Sarbadhicary","Sumit K.",""],["Tarantino","Elizabeth",""],["Villanueva","Vicente",""],["Williams","Thomas G.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 18:02:46 GMT"}],"updateDate":"2024-07-22","timestamp":1721325766000,"abstract":"  Measuring the properties of the cold neutral medium (CNM) in low-metallicity\ngalaxies provides insight into heating and cooling mechanisms in early\nUniverse-like environments. We report detections of two localized atomic\nneutral hydrogen (HI) absorption features in NGC 6822, a low-metallicity (0.2\nZ$_{\\odot}$) dwarf galaxy in the Local Group. These are the first unambiguous\nCNM detections in a low-metallicity dwarf galaxy outside the Magellanic Clouds.\nThe Local Group L-Band Survey (LGLBS) enabled these detections due to its high\nspatial (15 pc for HI emission) and spectral (0.4 \\kms) resolution. We\nintroduce LGLBS and describe a custom pipeline to search for HI absorption at\nhigh angular resolution and extract associated HI emission. A detailed Gaussian\ndecomposition and radiative transfer analysis of the NGC 6822 detections\nreveals five CNM components, with key properties: a mean spin temperature of\n32$\\pm$6 K, a mean CNM column density of 3.1$\\times$10$^{20}$ cm$^{-2}$, and\nCNM mass fractions of 0.33 and 0.12 for the two sightlines. Stacking\nnon-detections does not reveal low-level signals below our median optical depth\nsensitivity of 0.05. One detection intercepts a star-forming region, with the\nHI absorption profile encompassing the CO (2$-$1) emission, indicating\ncoincident molecular gas and a depression in high-resolution HI emission. We\nalso analyze a nearby sightline with deep, narrow HI self-absorption dips,\nwhere the background warm neutral medium is attenuated by intervening CNM. The\nassociation of CNM, CO, and H$\\alpha$ emissions suggests a close link between\nthe colder, denser HI phase and star formation in NGC 6822.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}