{"id":"2407.18650","title":"Achieving interpretable machine learning by functional decomposition of\n  black-box models into explainable predictor effects","authors":"David K\\\"ohler (1) and David R\\\"ugamer (2 and 3) and Matthias Schmid\n  (1) ((1) Institute for Medical Biometry, Informatics and Epidemiology,\n  University of Bonn, (2) Department of Statistics, LMU Munich, (3) Munich\n  Center for Machine Learning)","authorsParsed":[["Köhler","David","","2 and 3"],["Rügamer","David","","2 and 3"],["Schmid","Matthias",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 10:37:29 GMT"}],"updateDate":"2024-07-29","timestamp":1721990249000,"abstract":"  Machine learning (ML) has seen significant growth in both popularity and\nimportance. The high prediction accuracy of ML models is often achieved through\ncomplex black-box architectures that are difficult to interpret. This\ninterpretability problem has been hindering the use of ML in fields like\nmedicine, ecology and insurance, where an understanding of the inner workings\nof the model is paramount to ensure user acceptance and fairness. The need for\ninterpretable ML models has boosted research in the field of interpretable\nmachine learning (IML). Here we propose a novel approach for the functional\ndecomposition of black-box predictions, which is considered a core concept of\nIML. The idea of our method is to replace the prediction function by a\nsurrogate model consisting of simpler subfunctions. Similar to additive\nregression models, these functions provide insights into the direction and\nstrength of the main feature contributions and their interactions. Our method\nis based on a novel concept termed stacked orthogonality, which ensures that\nthe main effects capture as much functional behavior as possible and do not\ncontain information explained by higher-order interactions. Unlike earlier\nfunctional IML approaches, it is neither affected by extrapolation nor by\nhidden feature interactions. To compute the subfunctions, we propose an\nalgorithm based on neural additive modeling and an efficient post-hoc\northogonalization procedure.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}