{"id":"2407.00980","title":"Acceleration method for generating perception failure scenarios based on\n  editing Markov process","authors":"Canjie Cai","authorsParsed":[["Cai","Canjie",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 05:33:48 GMT"}],"updateDate":"2024-07-02","timestamp":1719812028000,"abstract":"  With the rapid advancement of autonomous driving technology, self-driving\ncars have become a central focus in the development of future transportation\nsystems. Scenario generation technology has emerged as a crucial tool for\ntesting and verifying the safety performance of autonomous driving systems.\nCurrent research in scenario generation primarily focuses on open roads such as\nhighways, with relatively limited studies on underground parking garages. The\nunique structural constraints, insufficient lighting, and high-density\nobstacles in underground parking garages impose greater demands on the\nperception systems, which are critical to autonomous driving technology.\n  This study proposes an accelerated generation method for perception failure\nscenarios tailored to the underground parking garage environment, aimed at\ntesting and improving the safety performance of autonomous vehicle (AV)\nperception algorithms in such settings. The method presented in this paper\ngenerates an intelligent testing environment with a high density of perception\nfailure scenarios by learning the interactions between background vehicles\n(BVs) and autonomous vehicles (AVs) within perception failure scenarios.\nFurthermore, this method edits the Markov process within the perception failure\nscenario data to increase the density of critical information in the training\ndata, thereby optimizing the learning and generation of perception failure\nscenarios. A simulation environment for an underground parking garage was\ndeveloped using the Carla and Vissim platforms, with Bevfusion employed as the\nperception algorithm for testing. The study demonstrates that this method can\ngenerate an intelligent testing environment with a high density of perception\nfailure scenarios and enhance the safety performance of perception algorithms\nwithin this experimental setup.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}