{"id":"2407.07968","title":"General relativistic viscous accretion flow around a gravitational wave\n  inspired black hole","authors":"Subhankar Patra, Bibhas Ranjan Majhi, Santabrata Das","authorsParsed":[["Patra","Subhankar",""],["Majhi","Bibhas Ranjan",""],["Das","Santabrata",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:07:07 GMT"}],"updateDate":"2024-07-12","timestamp":1720634827000,"abstract":"  We investigate the physical properties of accretion flows around\nKonoplya-Zhidenko (KZ) black hole, proposed by deforming Kerr spacetime to\naddress the inaccuracies in the observation of gravitational waves resulting\nfrom a binary black hole merger. The dynamical equations describing the general\nrelativistic viscous accreting flow are solved self-consistently to find the\ntransonic accretion solutions in terms of global constants, such as energy\n($E$), angular momentum ($\\mathcal{L}$), viscosity parameter ($\\alpha$), spin\n($a_{k}$), and deformation parameter ($\\eta_0$). We obtain five distinct types\nof accretion solutions (O, A, $\\text{A}^{\\prime}$, W, and I-types) and observe\nthat those solutions are not unique but rather continue to exist for wide range\nof parameter spaces in the $\\mathcal{L}-E$ plane. Furthermore, we find that the\nviscous accretion flows can harbor shock waves when relativistic shock\nconditions are satisfied. Consequently, the shock-induced global accretion\nsolutions are obtained and the effect of $\\eta_0$ on shock properties, such as\nshock radius ($r_{\\rm sh}$) and change in electron temperature ($T_{\\rm e}$)\nacross the shock front are investigated. Moreover, we calculate the spectral\nenergy distributions (SEDs) of accretion flow using the relativistic thermal\nbremsstrahlung emission coefficient and study the modification of SEDs due to\nthe increase of $\\eta_0$ for both shock-induced and shock-free solutions. In\naddition, it has been noticed that the observable quantities, like\nquasi-periodic oscillation frequency ($\\nu_{\\rm QPO}$) and bolometric disc\nluminosity ($L$), are strongly depend on $\\eta_0$. Finally, we\nphenomenologically show that the KZ black hole is consistent with the observed\nhigh-frequency QPOs, commonly observed in black hole binaries and black hole\ncandidates.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}