{"id":"2407.11240","title":"Making New Connections: LLMs as Puzzle Generators for The New York\n  Times' Connections Word Game","authors":"Tim Merino, Sam Earle, Ryan Sudhakaran, Shyam Sudhakaran, Julian\n  Togelius","authorsParsed":[["Merino","Tim",""],["Earle","Sam",""],["Sudhakaran","Ryan",""],["Sudhakaran","Shyam",""],["Togelius","Julian",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 21:05:25 GMT"}],"updateDate":"2024-07-17","timestamp":1721077525000,"abstract":"  The Connections puzzle is a word association game published daily by The New\nYork Times (NYT). In this game, players are asked to find groups of four words\nthat are connected by a common theme. While solving a given Connections puzzle\nrequires both semantic knowledge and abstract reasoning, generating novel\npuzzles additionally requires a form of metacognition: generators must be able\nto accurately model the downstream reasoning of potential solvers. In this\npaper, we investigate the ability of the GPT family of Large Language Models\n(LLMs) to generate challenging and creative word games for human players. We\nstart with an analysis of the word game Connections and the unique challenges\nit poses as a Procedural Content Generation (PCG) domain. We then propose a\nmethod for generating Connections puzzles using LLMs by adapting a Tree of\nThoughts (ToT) prompting approach. We evaluate this method by conducting a user\nstudy, asking human players to compare AI-generated puzzles against published\nConnections puzzles. Our findings show that LLMs are capable puzzle creators,\nand can generate diverse sets of enjoyable, challenging, and creative\nConnections puzzles as judged by human users.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FORq3VvWclxp9zlvy7QBcYzZI7auiXUHyEdnRKqgcuw","pdfSize":"487214","objectId":"0x57c425e18dbe75640fe5613ec0d870f33ba0a08c687bebe34b7e513851ef65e1","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
