{"id":"2407.09773","title":"Predicting nonequilibrium Green's function dynamics and photoemission\n  spectra via nonlinear integral operator learning","authors":"Yuanran Zhu, Jia Yin, Cian C. Reeves, Chao Yang, Vojtech Vlcek","authorsParsed":[["Zhu","Yuanran",""],["Yin","Jia",""],["Reeves","Cian C.",""],["Yang","Chao",""],["Vlcek","Vojtech",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 04:59:55 GMT"}],"updateDate":"2024-07-16","timestamp":1720846795000,"abstract":"  Understanding the dynamics of nonequilibrium quantum many-body systems is an\nimportant research topic in a wide range of fields across condensed matter\nphysics, quantum optics, and high-energy physics. However, numerical studies of\nlarge-scale nonequilibrium phenomena in realistic materials face serious\nchallenges due to intrinsic high-dimensionality of quantum many-body problems.\nThe nonequilibrium properties of many-body systems can be described by the\ndynamics of the Green's function of the system, whose time evolution is given\nby a high-dimensional system of integro-differential equations, known as the\nKadanoff-Baym equations (KBEs). The time-convolution term in KBEs, which needs\nto be recalculated at each time step, makes it difficult to perform long-time\nsimulations. In this paper, we develop an operator-learning framework based on\nRecurrent Neural Networks (RNNs) to address this challenge. The proposed\nframework utilizes RNNs to learn the nonlinear mapping between Green's\nfunctions and convolution integrals in KBEs. By using the learned operators as\na surrogate model in the KBE solver, we obtain a general machine-learning\nscheme for predicting the dynamics of nonequilibrium Green's functions. This\nnew methodology reduces the temporal computational complexity from $O(N_t^3)$\nto $O(N_t)$, where $N_t$ is the total time steps taken in a simulation, thereby\nmaking it possible to study large many-body problems which are currently\ninfeasible with conventional KBE solvers. Through different numerical examples,\nwe demonstrate the effectiveness of the operator-learning based approach in\nproviding accurate predictions of physical observables such as the reduced\ndensity matrix and time-resolved photoemission spectra. Moreover, our framework\nexhibits clear numerical convergence and can be easily parallelized, thereby\nfacilitating many possible further developments and applications.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}