{"id":"2407.19012","title":"The ANTARESS workflow I. Optimal extraction of spatially resolved\n  stellar spectra with high-resolution transit spectroscopy","authors":"V. Bourrier, J.-B. Delisle, C. Lovis, H. M. Cegla, M. Cretignier, R.\n  Allart, K. Al Moulla, S. Tavella, O. Attia, D. Mounzer, V. Vaulato, M.\n  Steiner, T. Vrignaud, S. Mercier, X. Dumusque, D. Ehrenreich, J. V. Seidel,\n  A. Wyttenbach, W. Dethier, and F. Pepe","authorsParsed":[["Bourrier","V.",""],["Delisle","J. -B.",""],["Lovis","C.",""],["Cegla","H. M.",""],["Cretignier","M.",""],["Allart","R.",""],["Moulla","K. Al",""],["Tavella","S.",""],["Attia","O.",""],["Mounzer","D.",""],["Vaulato","V.",""],["Steiner","M.",""],["Vrignaud","T.",""],["Mercier","S.",""],["Dumusque","X.",""],["Ehrenreich","D.",""],["Seidel","J. V.",""],["Wyttenbach","A.",""],["Dethier","W.",""],["Pepe","F.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:00:07 GMT"}],"updateDate":"2024-07-30","timestamp":1722016807000,"abstract":"  High-resolution spectrographs open a detailed window onto the atmospheres of\nstars and planets. As the number of systems observed with different instruments\ngrows, it is crucial to develop a standard in analyzing spectral time series of\nexoplanet transits and occultations, for the benefit of reproducibility. Here,\nwe introduce the ANTARESS workflow, a set of methods aimed at processing\nhigh-resolution spectroscopy datasets in a robust way and extracting accurate\nexoplanetary and stellar spectra. While a fast preliminary analysis can be run\non order-merged 1D spectra and cross-correlation functions (CCFs), the workflow\nwas optimally designed for extracted 2D echelle spectra to remain close to the\noriginal detector counts, limit the spectral resampling, and propagate the\ncorrelated noise. Input data from multiple instruments and epochs were\ncorrected for relevant environmental and instrumental effects, processed\nhomogeneously, and analyzed independently or jointly. In this first paper, we\nshow how planet-occulted stellar spectra extracted along the transit chord and\ncleaned from planetary contamination provide a direct comparison with\ntheoretical stellar models and enable a spectral and spatial mapping of the\nphotosphere. We illustrate this application of the workflow to archival\nESPRESSO data, using the Rossiter-McLaughlin effect Revolutions (RMR) technique\nto confirm the spin-orbit alignment of HD\\,209458b and unveil biases in\nWASP-76b's published orbital architecture. Because the workflow is modular and\nits concepts are general, it can support new methods and be extended to\nadditional spectrographs to find a range of applications beyond the proposed\nscope. In a companion paper, we will present how planet-occulted spectra can be\nprocessed further to extract and analyze planetary spectra decontaminated from\nthe star, providing clean and direct measurements of atmospheric properties.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}