{"id":"2407.13912","title":"Optimization-Based Outlier Accommodation for Tightly Coupled RTK-Aided\n  Inertial Navigation Systems in Urban Environments","authors":"Wang Hu, Yingjie Hu, Mike Stas, and Jay A. Farrell","authorsParsed":[["Hu","Wang",""],["Hu","Yingjie",""],["Stas","Mike",""],["Farrell","Jay A.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 21:53:27 GMT"},{"version":"v2","created":"Sat, 27 Jul 2024 07:18:13 GMT"}],"updateDate":"2024-07-30","timestamp":1721339607000,"abstract":"  Global Navigation Satellite Systems (GNSS) aided Inertial Navigation System\n(INS) is a fundamental approach for attaining continuously available absolute\nvehicle position and full state estimates at high bandwidth. For transportation\napplications, stated accuracy specifications must be achieved, unless the\nnavigation system can detect when it is violated. In urban environments, GNSS\nmeasurements are susceptible to outliers, which motivates the important problem\nof accommodating outliers while either achieving a performance specification or\ncommunicating that it is not feasible. Risk-Averse Performance-Specified (RAPS)\nis designed to optimally select measurements to address this problem. Existing\nRAPS approaches lack a method applicable to carrier phase measurements, which\nhave the benefit of measurement errors at the centimeter level along with the\nchallenge of being biased by integer ambiguities. This paper proposes a RAPS\nframework that combines Real-time Kinematic (RTK) in a tightly coupled INS for\nurban navigation applications. Experimental results demonstrate the\neffectiveness of this RAPS-INS-RTK framework, achieving 85.84% and 92.07% of\nhorizontal and vertical errors less than 1.5 meters and 3 meters, respectively,\nusing a smartphone-grade Inertial Measurement Unit (IMU) from a deep-urban\ndataset. This performance not only surpasses the Society of Automotive\nEngineers (SAE) requirements, but also shows a 10% improvement compared to\ntraditional methods.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}