{"id":"2407.17775","title":"Chirality-tunable non-linear Hall effect","authors":"Nesta Benno Joseph, Arka Bandyopadhyay, and Awadhesh Narayan","authorsParsed":[["Joseph","Nesta Benno",""],["Bandyopadhyay","Arka",""],["Narayan","Awadhesh",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 05:08:45 GMT"}],"updateDate":"2024-07-26","timestamp":1721884125000,"abstract":"  The non-linear generalization of the Hall effect has recently gained much\nattention, with a rapidly growing list of non-centrosymmetric materials that\ndisplay higher-order Hall responses under time-reversal invariant conditions.\nThe intrinsic second-order Hall response arises due to the first-order moment\nof Berry curvature -- termed Berry curvature dipole -- which requires broken\ninversion and low crystal symmetries. Chiral materials are characterized by\ntheir lack of improper symmetries such as inversion, mirror plane, and\nroto-inversion. Owing to this absence of symmetries, in this work, we propose\nchiral systems as ideal platforms to study the Berry curvature dipole-induced\nnon-linear Hall effects. We use state-of-the-art first-principles computations,\nin conjunction with symmetry analyses, to explore a variety of chiral material\nclasses -- metallic \\ch{NbSi2}, semiconducting elemental Te, insulating HgS,\nand topological multifold semimetal CoSi. We present the emergence and\ntunability of the Berry curvature dipole in these chiral materials. In\nparticular, we demonstrate that the two enantiomeric pairs exhibit an exactly\nopposite sign of the Berry curvature dipole. We complement our \\textit{ab\ninitio} findings with a general tight-binding minimal model and give estimates\nfor non-linear Hall voltages, which are experimentally accessible. Our\npredictions put forward chiral materials as an emerging class of materials to\nrealize non-linear Hall phenomena and highlight an as-yet-unexplored aspect of\nthese systems.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}