{"id":"2407.02748","title":"DRLQ: A Deep Reinforcement Learning-based Task Placement for Quantum\n  Cloud Computing","authors":"Hoa T. Nguyen, Muhammad Usman, Rajkumar Buyya","authorsParsed":[["Nguyen","Hoa T.",""],["Usman","Muhammad",""],["Buyya","Rajkumar",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 01:50:59 GMT"}],"updateDate":"2024-07-04","timestamp":1719971459000,"abstract":"  The quantum cloud computing paradigm presents unique challenges in task\nplacement due to the dynamic and heterogeneous nature of quantum computation\nresources. Traditional heuristic approaches fall short in adapting to the\nrapidly evolving landscape of quantum computing. This paper proposes DRLQ, a\nnovel Deep Reinforcement Learning (DRL)-based technique for task placement in\nquantum cloud computing environments, addressing the optimization of task\ncompletion time and quantum task scheduling efficiency. It leverages the Deep Q\nNetwork (DQN) architecture, enhanced with the Rainbow DQN approach, to create a\ndynamic task placement strategy. This approach is one of the first in the field\nof quantum cloud resource management, enabling adaptive learning and\ndecision-making for quantum cloud environments and effectively optimizing task\nplacement based on changing conditions and resource availability. We conduct\nextensive experiments using the QSimPy simulation toolkit to evaluate the\nperformance of our method, demonstrating substantial improvements in task\nexecution efficiency and a reduction in the need to reschedule quantum tasks.\nOur results show that utilizing the DRLQ approach for task placement can\nsignificantly reduce total quantum task completion time by 37.81% to 72.93% and\nprevent task rescheduling attempts compared to other heuristic approaches.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2lcihGlVJj7Gkm_0yvNIDC4vFkhJTG_RZI01aHz95DQ","pdfSize":"599837"}
