{"id":"2407.02180","title":"MICONIC: JWST/MIRI MRS observations of the nuclear and circumnuclear\n  regions of Mrk231","authors":"A. Alonso-Herrero, L. Hermosa Mu\\~noz, A. Labiano, P. Guillard, V. A.\n  Buiten, D. Dicken, P. van der Werf, J. \\'Alvarez-M\\'arquez, T. B\\\"oker, L.\n  Colina, A. Eckart, M. Garc\\'ia-Mar\\'in, O. C. Jones, L. Pantoni, P. G.\n  P\\'erez-Gonz\\'alez, D. Rouan, M. J. Ward, M. Baes, G. \\\"Ostlin, P. Royer, G.\n  S. Wright, M. G\\\"udel, Th. Henning, P.-O. Lagage, E. F. van Dishoeck","authorsParsed":[["Alonso-Herrero","A.",""],["Muñoz","L. Hermosa",""],["Labiano","A.",""],["Guillard","P.",""],["Buiten","V. A.",""],["Dicken","D.",""],["van der Werf","P.",""],["Álvarez-Márquez","J.",""],["Böker","T.",""],["Colina","L.",""],["Eckart","A.",""],["García-Marín","M.",""],["Jones","O. C.",""],["Pantoni","L.",""],["Pérez-González","P. G.",""],["Rouan","D.",""],["Ward","M. J.",""],["Baes","M.",""],["Östlin","G.",""],["Royer","P.",""],["Wright","G. S.",""],["Güdel","M.",""],["Henning","Th.",""],["Lagage","P. -O.",""],["van Dishoeck","E. F.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 11:39:53 GMT"}],"updateDate":"2024-07-03","timestamp":1719920393000,"abstract":"  We present JWST/MIRI MRS spatially resolved $\\sim 5-28\\,\\mu$m observations of\nthe central ~4-8kpc of the ultraluminous infrared galaxy and broad absorption\nline quasar Mrk231. These are part of the Mid-Infrared Characterization of\nNearby Iconic galaxy Centers (MICONIC) program of the MIRI European Consortium\nguaranteed time observations. No high excitation lines (i.e., [MgV] at\n5.61$\\mu$m or [NeV] at 14.32$\\mu$m) typically associated with the presence of\nan active galactic nucleus (AGN) are detected in the nuclear region of Mrk231.\nThis is likely due to the intrinsically X-ray weak nature of its quasar. Some\nintermediate ionization potential lines, for instance, [ArIII] at 8.99$\\mu$m\nand [SIV] at 10.51$\\mu$m, are not detected either, even though they are clearly\nobserved in a star-forming region ~920pc south-east of the AGN. Thus, the\nstrong nuclear mid-infrared (mid-IR) continuum is also in part hampering the\ndetection of faint lines in the nuclear region. The nuclear [NeIII]/[NeII]line\nratio is consistent with values observed in star-forming galaxies. Moreover, we\nresolve for the first time the nuclear starburst in the mid-IR low-excitation\nline emission (size of ~400pc, FWHM). Several pieces of evidence also indicate\nthat it is partly obscured even at these wavelengths. At the AGN position, the\nionized and warm molecular gas emission lines have modest widths\n(W_80~300km/s). There are, however, weak blueshifted wings reaching velocities\nv_02~-400km/s in [NeII]. The nuclear starburst is at the center of a large\n(~8kpc), massive rotating disk with widely-spread, low velocity outflows. Given\nthe high star formation rate of Mrk231, we speculate that part of the nuclear\noutflows and the large-scale non-circular motions observed in the mid-IR are\ndriven by its powerful nuclear starburst.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}