{"id":"2407.05059","title":"Slice-Consistent 3D Volumetric Brain CT-to-MRI Translation with 2D\n  Brownian Bridge Diffusion Model","authors":"Kyobin Choo, Youngjun Jun, Mijin Yun, Seong Jae Hwang","authorsParsed":[["Choo","Kyobin",""],["Jun","Youngjun",""],["Yun","Mijin",""],["Hwang","Seong Jae",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 12:13:36 GMT"}],"updateDate":"2024-07-09","timestamp":1720268016000,"abstract":"  In neuroimaging, generally, brain CT is more cost-effective and accessible\nimaging option compared to MRI. Nevertheless, CT exhibits inferior soft-tissue\ncontrast and higher noise levels, yielding less precise structural clarity. In\nresponse, leveraging more readily available CT to construct its counterpart\nMRI, namely, medical image-to-image translation (I2I), serves as a promising\nsolution. Particularly, while diffusion models (DMs) have recently risen as a\npowerhouse, they also come with a few practical caveats for medical I2I. First,\nDMs' inherent stochasticity from random noise sampling cannot guarantee\nconsistent MRI generation that faithfully reflects its CT. Second, for 3D\nvolumetric images which are prevalent in medical imaging, naively using 2D DMs\nleads to slice inconsistency, e.g., abnormal structural and brightness changes.\nWhile 3D DMs do exist, significant training costs and data dependency bring\nhesitation. As a solution, we propose novel style key conditioning (SKC) and\ninter-slice trajectory alignment (ISTA) sampling for the 2D Brownian bridge\ndiffusion model. Specifically, SKC ensures a consistent imaging style (e.g.,\ncontrast) across slices, and ISTA interconnects the independent sampling of\neach slice, deterministically achieving style and shape consistent 3D CT-to-MRI\ntranslation. To the best of our knowledge, this study is the first to achieve\nhigh-quality 3D medical I2I based only on a 2D DM with no extra architectural\nmodels. Our experimental results show superior 3D medical I2I than existing 2D\nand 3D baselines, using in-house CT-MRI dataset and BraTS2023 FLAIR-T1 MRI\ndataset.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}