{"id":"2407.02083","title":"Passivity Tools for Hybrid Learning Rules in Large Populations","authors":"Jair Certorio, Nuno C. Martins, Kevin Chang, Pierluigi Nuzzo, Yasser\n  Shoukry","authorsParsed":[["Certorio","Jair",""],["Martins","Nuno C.",""],["Chang","Kevin",""],["Nuzzo","Pierluigi",""],["Shoukry","Yasser",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 09:21:17 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 06:50:17 GMT"}],"updateDate":"2024-07-17","timestamp":1719912077000,"abstract":"  Recent work has pioneered the use of system-theoretic passivity to study\nequilibrium stability for the dynamics of noncooperative strategic interactions\nin large populations of learning agents. In this and related works, the\nstability analysis leverages knowledge that certain ``canonical'' classes of\nlearning rules used to model the agents' strategic behaviors satisfy a\npassivity condition known as $\\delta$-passivity. In this paper, we consider\nthat agents exhibit learning behaviors that do not align with a canonical\nclass. Specifically, we focus on characterizing $\\delta$-passivity for hybrid\nlearning rules that combine elements from canonical classes. Our analysis also\nintroduces and uses a more general version of $\\delta$-passivity, which, for\nthe first time, can handle discontinuous learning rules, including those\nshowing best-response behaviors. We state and prove theorems establishing\n$\\delta$-passivity for two broad convex cones of hybrid learning rules. These\ncones can merge into a larger one preserving $\\delta$-passivity in scenarios\nlimited to two strategies. In our proofs, we establish intermediate facts that\nare significant on their own and could potentially be used to further\ngeneralize our work. We illustrate the applicability of our results through\nnumerical examples.\n","subjects":["Mathematics/Dynamical Systems","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}