{"id":"2407.08402","title":"Selective area epitaxy of in-plane HgTe nanostrcutures on CdTe(001)\n  substrate","authors":"Nicolas Chaize, Xavier Baudry, Pierre-Henri Jouneau, Eric Gautier,\n  Jean-Luc Rouvi\\`ere, Yves Deblock, Jimmy Xu, Maxime Berthe, Cl\\'ement Barbot,\n  Bruno Grandidier, Ludovic Desplanque, Hermann Sellier and Philippe Ballet","authorsParsed":[["Chaize","Nicolas",""],["Baudry","Xavier",""],["Jouneau","Pierre-Henri",""],["Gautier","Eric",""],["Rouvière","Jean-Luc",""],["Deblock","Yves",""],["Xu","Jimmy",""],["Berthe","Maxime",""],["Barbot","Clément",""],["Grandidier","Bruno",""],["Desplanque","Ludovic",""],["Sellier","Hermann",""],["Ballet","Philippe",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 11:12:47 GMT"}],"updateDate":"2024-07-12","timestamp":1720696367000,"abstract":"  Semiconductor nanowires are believed to play a crucial role for future\napplications in electronics, spintronics and quantum technologies. A potential\ncandidate is HgTe but its sensitivity to nanofabrication processes restrain its\ndevelopment. A way to circumvent this obstacle is the selective area growth\ntechnique. Here, in-plane HgTe nanostructures are grown thanks to selective\narea molecular beam epitaxy on a semi-insulating CdTe substrate covered with a\npatterned SiO$_{\\mathrm{2}}$ mask. The shape of these nanostructures is defined\nby the in-plane orientation of the mask aperture along the <$110$>,\n<$1\\bar{\\mathrm{1}}0$>, or <$100$> direction, the deposited thickness, and the\ngrowth temperature. Several micron long in-plane nanowires can be achieved as\nwell as more complex nanostructures such as networks, diamond structures or\nrings. A good selectivity is achieved with very little parasitic growth on the\nmask even for a growth temperature as low as $140${\\deg}C and growth rate up to\n$0.5$ ML/s. For <$110$> oriented nanowires, the center of the nanostructure\nexhibits a trapezoidal shape with {$111$}B facets and two grains on the sides,\nwhile <$1\\bar{\\mathrm{1}}0$> oriented nanowires show {$111$}A facets with\nadatoms accumulation on the sides of the top surface. Transmission electron\nmicroscopy observations reveal a continuous epitaxial relation between the CdTe\nsubstrate and the HgTe nanowire. Measurements of the resistance with fourpoint\nscanning tunneling microscopy indicates a good electrical homogeneity along the\nmain NW axis and a thermally activated transport. This growth method paves the\nway toward the fabrication of complex HgTe-based nanostructures for electronic\ntransport measurements.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JaDmH-aUMDC39jpk3Dp7CWZJL7HStWdKHst7fTHof-U","pdfSize":"7872633","objectId":"0x98b0ba1853f0b3c19102b4ba63b0a8da6e4bab15a92bca4956b90dba5a4736f4","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
