{"id":"2407.18563","title":"Matching Input and Output Devices and Physical Disabilities for\n  Human-Robot Workstations","authors":"Carlo Weidemann and Nils Mandischer and Burkhard Corves","authorsParsed":[["Weidemann","Carlo",""],["Mandischer","Nils",""],["Corves","Burkhard",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 07:35:19 GMT"}],"updateDate":"2024-07-29","timestamp":1721979319000,"abstract":"  As labor shortage is rising at an alarming rate, it is imperative to enable\nall people to work, particularly people with disabilities and elderly people.\nRobots are often used as universal tool to assist people with disabilities.\nHowever, for such human-robot workstations universal design fails. We mitigate\nthe challenges of selecting an individualized set of input and output devices\nby matching devices required by the work process and individual disabilities\nadhering to the Convention on the Rights of Persons with Disabilities passed by\nthe United Nations. The objective is to facilitate economically viable\nworkstations with just the required devices, hence, lowering overall cost of\ncorporate inclusion and during redesign of workplaces. Our work focuses on\ndeveloping an efficient approach to filter input and output devices based on a\nperson's disabilities, resulting in a tailored list of usable devices. The\nmethodology enables an automated assessment of devices compatible with specific\ndisabilities defined in International Classification of Functioning, Disability\nand Health. In a mock-up, we showcase the synthesis of input and output devices\nfrom disabilities, thereby providing a practical tool for selecting devices for\nindividuals with disabilities.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}