{"id":"2407.15823","title":"A Large-scale Benchmark Dataset for Commuting Origin-destination Matrix\n  Generation","authors":"Can Rong, Jingtao Ding, Yan Liu, Yong Li","authorsParsed":[["Rong","Can",""],["Ding","Jingtao",""],["Liu","Yan",""],["Li","Yong",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 17:37:04 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 17:02:56 GMT"},{"version":"v3","created":"Wed, 24 Jul 2024 00:59:05 GMT"}],"updateDate":"2024-07-25","timestamp":1721669824000,"abstract":"  The commuting origin-destination~(OD) matrix is a critical input for urban\nplanning and transportation, providing crucial information about the population\nresiding in one region and working in another within an interested area.\nDespite its importance, obtaining and updating the matrix is challenging due to\nhigh costs and privacy concerns. This has spurred research into generating\ncommuting OD matrices for areas lacking historical data, utilizing readily\navailable information via computational models. In this regard, existing\nresearch is primarily restricted to only a single or few large cities,\npreventing these models from being applied effectively in other areas with\ndistinct characteristics, particularly in towns and rural areas where such data\nis urgently needed. To address this, we propose a large-scale dataset\ncomprising commuting OD matrices for 3,233 diverse areas around the U.S. For\neach area, we provide the commuting OD matrix, combined with regional\nattributes including demographics and point-of-interests of each region in that\narea. We believe this comprehensive dataset will facilitate the development of\nmore generalizable commuting OD matrix generation models, which can capture\nvarious patterns of distinct areas. Additionally, we use this dataset to\nbenchmark a set of commuting OD generation models, including physical models,\nelement-wise predictive models, and matrix-wise generative models.\nSurprisingly, we find a new paradigm, which considers the whole area combined\nwith its commuting OD matrix as an attributed directed weighted graph and\ngenerates the weighted edges based on the node attributes, can achieve the\noptimal. This may inspire a new research direction from graph learning in this\nfield.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AJHoKSq-N1sdhSv8obnbCGwdHqepgKM3-PMYlZoicXA","pdfSize":"8652450"}
