{"id":"2407.14023","title":"Towards Extracting Ethical Concerns-related Software Requirements from\n  App Reviews","authors":"Aakash Sorathiya, Gouri Ginde","authorsParsed":[["Sorathiya","Aakash",""],["Ginde","Gouri",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 04:50:32 GMT"}],"updateDate":"2024-07-22","timestamp":1721364632000,"abstract":"  As mobile applications become increasingly integral to our daily lives,\nconcerns about ethics have grown drastically. Users share their experiences,\nreport bugs, and request new features in application reviews, often\nhighlighting safety, privacy, and accountability concerns. Approaches using\nmachine learning techniques have been used in the past to identify these\nethical concerns. However, understanding the underlying reasons behind them and\nextracting requirements that could address these concerns is crucial for safer\nsoftware solution development. Thus, we propose a novel approach that leverages\na knowledge graph (KG) model to extract software requirements from app reviews,\ncapturing contextual data related to ethical concerns. Our framework consists\nof three main components: developing an ontology with relevant entities and\nrelations, extracting key entities from app reviews, and creating connections\nbetween them. This study analyzes app reviews of the Uber mobile application (a\npopular taxi/ride app) and presents the preliminary results from the proposed\nsolution. Initial results show that KG can effectively capture contextual data\nrelated to software ethical concerns, the underlying reasons behind these\nconcerns, and the corresponding potential requirements.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DUIQ8oyTDZZWsKNZkwfsdSDNU_386SskZwXeoSf-a4I","pdfSize":"1420463","objectId":"0xd85c151c36c6a6bd524532d4e68c90ebcd9b7a23dbd1191913e1ccabf36640b4","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
