{"id":"2407.11581","title":"Magnetic dissipation in short gamma-ray burst jets. I. Resistive\n  relativistic MHD evolution in a model environment","authors":"Giancarlo Mattia, Luca Del Zanna, Andrea Pavan, Riccardo Ciolfi","authorsParsed":[["Mattia","Giancarlo",""],["Del Zanna","Luca",""],["Pavan","Andrea",""],["Ciolfi","Riccardo",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 10:42:41 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 11:12:47 GMT"}],"updateDate":"2024-09-18","timestamp":1721126561000,"abstract":"  Short gamma-ray bursts originate when relativistic jets emerge from the\nremnants of binary neutron star mergers. Both the jet and the remnant are\nbelieved to be strongly magnetized, and the presence of magnetic fields is\nknown to influence the jet propagation across the surrounding post-merger\nenvironment. In the magnetic interplay between the jet and the environment\nitself, effects due to a finite plasma conductivity may be important,\nespecially in the first phases of the jet propagation. We aim to investigate\nsuch effects, from jet launching to its final breakout from the post-merger\nenvironment. 2D axisymmetric and full 3D resistive relativistic MHD\nsimulations, are performed with the PLUTO numerical code. Different models for\nphysical resistivity, which must be small but still above the numerical one\n(producing unwanted smearing of structures in any ideal MHD code) are\nconsidered and compared. All simulations are performed by using an axisymmetric\nanalytical model for the jet propagation environment; we leave the case of jet\npropagation in a realistic environment (i.e. imported from actual binary\nneutron star merger simulation) to a later study. Significant differences in\nthe jet structure and induced turbulence are clearly seen in 2D axisymmetric\nsimulations. Regions with a resistive electric field parallel to the magnetic\nfield form and non-thermal particle acceleration may be enhanced there. The\nlevel of dissipated Ohmic power is also dependent on the various recipes for\nresistivity. Most of the differences arise before breakout from the magnetized\nenvironment, whereas once the jet enters the external atmosphere these\ndifferences are preserved during further propagation despite the lower grid\nrefinement. Finally, we show and discuss the 3D evolution of the jet within the\nsame environment, in order to highlight the emergence of non-axisymmetric\nfeatures.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}