{"id":"2407.00863","title":"Dynamically Modulating Visual Place Recognition Sequence Length For\n  Minimum Acceptable Performance Scenarios","authors":"Connor Malone, Ankit Vora, Thierry Peynot, Michael Milford","authorsParsed":[["Malone","Connor",""],["Vora","Ankit",""],["Peynot","Thierry",""],["Milford","Michael",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 00:16:35 GMT"}],"updateDate":"2024-07-02","timestamp":1719792995000,"abstract":"  Mobile robots and autonomous vehicles are often required to function in\nenvironments where critical position estimates from sensors such as GPS become\nuncertain or unreliable. Single image visual place recognition (VPR) provides\nan alternative for localization but often requires techniques such as sequence\nmatching to improve robustness, which incurs additional computation and latency\ncosts. Even then, the sequence length required to localize at an acceptable\nperformance level varies widely; and simply setting overly long fixed sequence\nlengths creates unnecessary latency, computational overhead, and can even\ndegrade performance. In these scenarios it is often more desirable to meet or\nexceed a set target performance at minimal expense. In this paper we present an\napproach which uses a calibration set of data to fit a model that modulates\nsequence length for VPR as needed to exceed a target localization performance.\nWe make use of a coarse position prior, which could be provided by any other\nlocalization system, and capture the variation in appearance across this\nregion. We use the correlation between appearance variation and sequence length\nto curate VPR features and fit a multilayer perceptron (MLP) for selecting the\noptimal length. We demonstrate that this method is effective at modulating\nsequence length to maximize the number of sections in a dataset which meet or\nexceed a target performance whilst minimizing the median length used. We show\napplicability across several datasets and reveal key phenomena like\ngeneralization capabilities, the benefits of curating features and the utility\nof non-state-of-the-art feature extractors with nuanced properties.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}