{"id":"2407.16411","title":"Equation of state of nuclear matter from collective flows and stopping\n  in intermediate energy heavy-ion collisions","authors":"Dan Cozma (IFIN-HH, Bucharest)","authorsParsed":[["Cozma","Dan","","IFIN-HH, Bucharest"]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 11:57:23 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 05:58:44 GMT"}],"updateDate":"2024-07-25","timestamp":1721735843000,"abstract":"  The equation of state of nuclear matter, momentum dependence of the effective\ninteraction and in-medium modification of elastic nucleon-nucleon\ncross-sections are studied by comparing theoretical predictions for stopping,\ndirected and elliptic flows of protons and light clusters in intermediate\nenergy heavy-ion collisions of beam energy between 150 and 800 MeV/nucleon to\nexperimental data gathered by the FOPI Collaboration. A multivariate analysis\nthat takes into account systematic uncertainties induced on model predictions\nby the coalescence afterburner leads to the following constraint for the\nequation of state at 68 percent confidence level: compressibility modulus of\nisospin symmetric matter $K_0=230^{+9}_{-11}$ MeV and slope of the symmetry\nenergy $L=63^{+10}_{-13}$ MeV. The momentum dependence of the isoscalar\npotential is found to be similar to that of the empirical optical potential,\nwith an effective isoscalar mass $m^*=0.695^{+0.014}_{-0.018}$. The isovector\npotential displays a momentum dependence corresponding to a positive\nneutron-proton effective mass difference $\\Delta\nm^*_{np}=(0.17^{+0.10}_{-0.09})\\delta$, close to the world average for this\nquantity. A suppression of elastic nucleon-nucleon cross-sections in symmetric\nnuclear matter at saturation by about 60$\\%$ relative to vacuum values is\ndeduced, in qualitative agreement with microscopical results. A strong\ndependence of the suppression factor on isospin asymmetry is evidenced,\nexperimental data for isospin symmetric systems proving crucial for this last\nconclusion.\n","subjects":["Physics/Nuclear Theory","Physics/Nuclear Experiment"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"fBfz9DBVHMLTDlZNhBRKx2xRoHgy9RByaLO_3XdJF0w","pdfSize":"2292223"}
