{"id":"2407.01917","title":"Securing Distributed Network Digital Twin Systems Against Model\n  Poisoning Attacks","authors":"Zifan Zhang, Minghong Fang, Mingzhe Chen, Gaolei Li, Xi Lin, Yuchen\n  Liu","authorsParsed":[["Zhang","Zifan",""],["Fang","Minghong",""],["Chen","Mingzhe",""],["Li","Gaolei",""],["Lin","Xi",""],["Liu","Yuchen",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 03:32:09 GMT"}],"updateDate":"2024-07-03","timestamp":1719891129000,"abstract":"  In the era of 5G and beyond, the increasing complexity of wireless networks\nnecessitates innovative frameworks for efficient management and deployment.\nDigital twins (DTs), embodying real-time monitoring, predictive configurations,\nand enhanced decision-making capabilities, stand out as a promising solution in\nthis context. Within a time-series data-driven framework that effectively maps\nwireless networks into digital counterparts, encapsulated by integrated\nvertical and horizontal twinning phases, this study investigates the security\nchallenges in distributed network DT systems, which potentially undermine the\nreliability of subsequent network applications such as wireless traffic\nforecasting. Specifically, we consider a minimal-knowledge scenario for all\nattackers, in that they do not have access to network data and other\nspecialized knowledge, yet can interact with previous iterations of\nserver-level models. In this context, we spotlight a novel fake traffic\ninjection attack designed to compromise a distributed network DT system for\nwireless traffic prediction. In response, we then propose a defense mechanism,\ntermed global-local inconsistency detection (GLID), to counteract various model\npoisoning threats. GLID strategically removes abnormal model parameters that\ndeviate beyond a particular percentile range, thereby fortifying the security\nof network twinning process. Through extensive experiments on real-world\nwireless traffic datasets, our experimental evaluations show that both our\nattack and defense strategies significantly outperform existing baselines,\nhighlighting the importance of security measures in the design and\nimplementation of DTs for 5G and beyond network systems.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Cryptography and Security","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}