{"id":"2407.10716","title":"First mechanical realization of a tunable dielectric haloscope for the\n  MADMAX axion search experiment","authors":"The MADMAX Collaboration: B. Ary Dos Santos Garcia, D. Bergermann, A.\n  Caldwell, V. Dabhi, C. Diaconu, J. Diehl, G. Dvali, J. Egge, M. Ekmedzic, F.\n  Gallo, E. Garutti, S. Heyminck, F. Hubaut, A. Ivanov, J. Jochum, P. Karst, M.\n  Kramer, D. Kreikemeyer-Lorenzo, C. Krieger, D. Leppla-Weber, A. Lindner, J.\n  Maldonado, B. Majorovits, S. Martens, A. Martini, E. \\\"Oz, P. Pralavorio, G.\n  Raffelt, J. Redondo, A. Ringwald, S. Roset, J. Schaffran, A. Schmidt, F.\n  Steffen, C. Strandhagen, I. Usherov, H. Wang, G. Wieching","authorsParsed":[["The MADMAX Collaboration","",""],["Garcia","B. Ary Dos Santos",""],["Bergermann","D.",""],["Caldwell","A.",""],["Dabhi","V.",""],["Diaconu","C.",""],["Diehl","J.",""],["Dvali","G.",""],["Egge","J.",""],["Ekmedzic","M.",""],["Gallo","F.",""],["Garutti","E.",""],["Heyminck","S.",""],["Hubaut","F.",""],["Ivanov","A.",""],["Jochum","J.",""],["Karst","P.",""],["Kramer","M.",""],["Kreikemeyer-Lorenzo","D.",""],["Krieger","C.",""],["Leppla-Weber","D.",""],["Lindner","A.",""],["Maldonado","J.",""],["Majorovits","B.",""],["Martens","S.",""],["Martini","A.",""],["Öz","E.",""],["Pralavorio","P.",""],["Raffelt","G.",""],["Redondo","J.",""],["Ringwald","A.",""],["Roset","S.",""],["Schaffran","J.",""],["Schmidt","A.",""],["Steffen","F.",""],["Strandhagen","C.",""],["Usherov","I.",""],["Wang","H.",""],["Wieching","G.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 13:37:17 GMT"}],"updateDate":"2024-07-16","timestamp":1721050637000,"abstract":"  MADMAX, a future experiment to search for axion dark matter, is based on a\nnovel detection concept called the dielectric haloscope. It consists of a\nbooster composed of several dielectric disks positioned with $\\mu$m precision.\nA prototype composed of one movable disk was built to demonstrate the\nmechanical feasibility of such a booster in the challenging environment of the\nexperiment: high magnetic field to convert the axions into photons and\ncryogenic temperature to reduce the thermal noise. It was tested both inside a\nstrong magnetic field up to 1.6 T and at cryogenic temperatures down to 35K.\nThe measurements of the velocity and positioning accuracy of the disk are shown\nand are found to match the MADMAX requirements.\n","subjects":["Physics/Instrumentation and Detectors"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}