{"id":"2407.10545","title":"Efficient Continual Learning with Low Memory Footprint For Edge Device","authors":"Zeqing Wang, Fei Cheng, Kangye Ji, Bohu Huang","authorsParsed":[["Wang","Zeqing",""],["Cheng","Fei",""],["Ji","Kangye",""],["Huang","Bohu",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 08:52:20 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 14:34:43 GMT"}],"updateDate":"2024-07-18","timestamp":1721033540000,"abstract":"  Continual learning(CL) is a useful technique to acquire dynamic knowledge\ncontinually. Although powerful cloud platforms can fully exert the ability of\nCL,e.g., customized recommendation systems, similar personalized requirements\nfor edge devices are almost disregarded. This phenomenon stems from the huge\nresource overhead involved in training neural networks and overcoming the\nforgetting problem of CL. This paper focuses on these scenarios and proposes a\ncompact algorithm called LightCL. Different from other CL methods bringing huge\nresource consumption to acquire generalizability among all tasks for delaying\nforgetting, LightCL compress the resource consumption of already generalized\ncomponents in neural networks and uses a few extra resources to improve memory\nin other parts. We first propose two new metrics of learning plasticity and\nmemory stability to seek generalizability during CL. Based on the discovery\nthat lower and middle layers have more generalizability and deeper layers are\nopposite, we $\\textit{Maintain Generalizability}$ by freezing the lower and\nmiddle layers. Then, we $\\textit{Memorize Feature Patterns}$ to stabilize the\nfeature extracting patterns of previous tasks to improve generalizability in\ndeeper layers. In the experimental comparison, LightCL outperforms other SOTA\nmethods in delaying forgetting and reduces at most $\\textbf{6.16$\\times$}$\nmemory footprint, proving the excellent performance of LightCL in efficiency.\nWe also evaluate the efficiency of our method on an edge device, the Jetson\nNano, which further proves our method's practical effectiveness.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}