{"id":"2407.19473","title":"Polar cap region and plasma drift in pulsars","authors":"Andrzej Szary, Joeri van Leeuwen","authorsParsed":[["Szary","Andrzej",""],["van Leeuwen","Joeri",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 11:53:44 GMT"}],"updateDate":"2024-07-30","timestamp":1722167624000,"abstract":"  Pulsars often display systematic variations in the position and/or intensity\nof the subpulses, the components that comprise each single pulse. Although the\ndrift of these subpulses was observed in the early years of pulsar research,\nand their potential for understanding the elusive emission mechanism was\nquickly recognised, there is still no consensus on the cause of the drift. We\nexplore the electrodynamics of two recently proposed or refined drift models:\none where plasma lags behind corotation, connecting the drift with the\nrotational pole; and another where plasma drifts around the electric potential\nextremum of the polar cap. Generally, these are different locations, resulting\nin different drift behaviours, that can be tested with observations. In this\nstudy, however, we specifically examine these models in the axisymmetric case,\nwhere the physics is well understood. This approach seems counter-intuitive as\nboth models then predict similar large-scale plasma drift. However, it allows\nus to show, by studying conditions \\emph{within} the sparks for both models,\nthat the lagging behind corotation (LBC) model is inconsistent with Faraday's\nlaw. The modified carousel (MC) model, where plasma drifts around the electric\npotential extremum, not only aligns with Faraday's law, but also provides a\nfuture direction for developing a comprehensive model of plasma generation in\nthe polar cap region. Unlike previous models, which considered the drift only\ninside the discharging regions, the MC model reveals that the electric field\n\\emph{between} the discharges is not completely screened, and plasma drifts\nthere -- a paradigm shift for the drifting subpulse phenomenon.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}