{"id":"2407.18154","title":"Identification of a time-varying SIR Model for Covid-19","authors":"Walter HMendes aselein and Diego Eckhard","authorsParsed":[["aselein","Walter HMendes",""],["Eckhard","Diego",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 16:07:32 GMT"}],"updateDate":"2024-07-26","timestamp":1721923652000,"abstract":"  Throughout human history, epidemics have been a constant presence.\nUnderstanding their dynamics is essential to predict scenarios and make\nsubstantiated decisions. Mathematical models are powerful tools to describe an\nepidemic behavior. Among the most used, the compartmental ones stand out,\ndividing population into classes with well-defined characteristics. One of the\nmost known is the $SIR$ model, based on a set of differential equations\ndescribing the rates of change of three categories over time. These equations\ntake into account parameters such as the disease transmission rate and the\nrecovery rate, which both change over time. However, classical models use\nconstant parameters and can not describe the behavior of a disease over long\nperiods. In this work, it is proposed a $SIR$ model with time-varying\ntransmission rate parameter with a method to estimate this parameter based on\nan optimization problem, which minimizes the sum of the squares of the errors\nbetween the model and historical data. Additionally, based on the infection\nrates determined by the algorithm, the model's ability to predict disease\nactivity in future scenarios was also investigated. Epidemic data released by\nthe government of the State of Rio Grande do Sul in Brazil was used to evaluate\nthe models, where the models shown a very good forecasting ability, resulting\nin errors for predicting the total number of accumulated infected persons of\n0.13% for 7 days ahead and 0.6% for 14 days ahead.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control","Physics/Physics and Society","Quantitative Biology/Populations and Evolution"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}