{"id":"2407.13809","title":"Enhancing Quantum Machine Learning: The Power of Non-Linear Optical\n  Reproducing Kernels","authors":"Shahram Dehdashti, Prayag Tiwari, Kareem H. El Safty, Peter Bruza,\n  Janis Notzel","authorsParsed":[["Dehdashti","Shahram",""],["Tiwari","Prayag",""],["Safty","Kareem H. El",""],["Bruza","Peter",""],["Notzel","Janis",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 10:23:22 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 10:33:24 GMT"},{"version":"v3","created":"Thu, 12 Sep 2024 14:39:42 GMT"}],"updateDate":"2024-09-13","timestamp":1721298202000,"abstract":"  Amidst the array of quantum machine learning algorithms, the quantum kernel\nmethod has emerged as a focal point, primarily owing to its compatibility with\nnoisy intermediate-scale quantum devices and its promise to achieve quantum\nadvantage. This method operates by nonlinearly transforming data into feature\nspace constructed with quantum states, enabling classification and regression\ntasks. In this study, we present a novel feature space constructed using Kerr\ncoherent states, which generalize su(2), su(1, 1) coherent states, and squeezed\nstates. Notably, the feature space exhibits constant curvature, comprising both\nspherical and hyperbolic geometries, depending on the sign of the Kerr\nparameter. Remarkably, the physical parameters associated with the coherent\nstates, enable control over the curvature of the feature space. Our study\nemploys Kerr kernels derived from encoding data into the phase and amplitude of\nKerr coherent states. We analyze various datasets ranging from Moon to breast\ncancer diagnostics. Our findings demonstrate the robustness of Kerr coherent\nstates, attributed to their flexibility in accommodating different\nhyperparameters, thereby offering superior performance across noisy datasets\nand hardware setups.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GKshvIhTDQx0UIe3P4ipEqNQdGDrGOq1dCS9Po_TYqU","pdfSize":"2015959"}
