{"id":"2407.01599","title":"JailbreakZoo: Survey, Landscapes, and Horizons in Jailbreaking Large\n  Language and Vision-Language Models","authors":"Haibo Jin, Leyang Hu, Xinuo Li, Peiyan Zhang, Chonghan Chen, Jun\n  Zhuang, Haohan Wang","authorsParsed":[["Jin","Haibo",""],["Hu","Leyang",""],["Li","Xinuo",""],["Zhang","Peiyan",""],["Chen","Chonghan",""],["Zhuang","Jun",""],["Wang","Haohan",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 02:20:23 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 02:25:11 GMT"}],"updateDate":"2024-07-26","timestamp":1719368423000,"abstract":"  The rapid evolution of artificial intelligence (AI) through developments in\nLarge Language Models (LLMs) and Vision-Language Models (VLMs) has brought\nsignificant advancements across various technological domains. While these\nmodels enhance capabilities in natural language processing and visual\ninteractive tasks, their growing adoption raises critical concerns regarding\nsecurity and ethical alignment. This survey provides an extensive review of the\nemerging field of jailbreaking--deliberately circumventing the ethical and\noperational boundaries of LLMs and VLMs--and the consequent development of\ndefense mechanisms. Our study categorizes jailbreaks into seven distinct types\nand elaborates on defense strategies that address these vulnerabilities.\nThrough this comprehensive examination, we identify research gaps and propose\ndirections for future studies to enhance the security frameworks of LLMs and\nVLMs. Our findings underscore the necessity for a unified perspective that\nintegrates both jailbreak strategies and defensive solutions to foster a\nrobust, secure, and reliable environment for the next generation of language\nmodels. More details can be found on our website:\n\\url{https://chonghan-chen.com/llm-jailbreak-zoo-survey/}.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Cryptography and Security","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}