{"id":"2407.20130","title":"To accept or not to accept? An IRT-TOE Framework to Understand\n  Educators' Resistance to Generative AI in Higher Education","authors":"Jan-Erik Kalmus and Anastasija Nikiforova","authorsParsed":[["Kalmus","Jan-Erik",""],["Nikiforova","Anastasija",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:59:19 GMT"}],"updateDate":"2024-07-30","timestamp":1722268759000,"abstract":"  Since the public release of Chat Generative Pre-Trained Transformer\n(ChatGPT), extensive discourse has emerged concerning the potential advantages\nand challenges of integrating Generative Artificial Intelligence (GenAI) into\neducation. In the realm of information systems, research on technology adoption\nis crucial for understanding the diverse factors influencing the uptake of\nspecific technologies. Theoretical frameworks, refined and validated over\ndecades, serve as guiding tools to elucidate the individual and organizational\ndynamics, obstacles, and perceptions surrounding technology adoption. However,\nwhile several models have been proposed, they often prioritize elucidating the\nfactors that facilitate acceptance over those that impede it, typically\nfocusing on the student perspective and leaving a gap in empirical evidence\nregarding educators viewpoints. Given the pivotal role educators play in higher\neducation, this study aims to develop a theoretical model to empirically\npredict the barriers preventing educators from adopting GenAI in their\nclassrooms. Acknowledging the lack of theoretical models tailored to\nidentifying such barriers, our approach is grounded in the Innovation\nResistance Theory (IRT) framework and augmented with constructs from the\nTechnology-Organization-Environment (TOE) framework. This model is transformed\ninto a measurement instrument employing a quantitative approach, complemented\nby a qualitative approach to enrich the analysis and uncover concerns related\nto GenAI adoption in the higher education domain.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Emerging Technologies","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}