{"id":"2407.04197","title":"Compact Ion Beam System for Fusion Demonstration","authors":"Allan Xi Chen, Nai-Wei Liu, Alexander Gunn, Zhe Su, Benjamin F. Sigal,\n  Matthew Salazar, Nawar Abdalla, James Chen, Alfred Y. Wong, Qiong Wang","authorsParsed":[["Chen","Allan Xi",""],["Liu","Nai-Wei",""],["Gunn","Alexander",""],["Su","Zhe",""],["Sigal","Benjamin F.",""],["Salazar","Matthew",""],["Abdalla","Nawar",""],["Chen","James",""],["Wong","Alfred Y.",""],["Wang","Qiong",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 00:52:24 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 09:49:18 GMT"},{"version":"v3","created":"Sat, 3 Aug 2024 04:54:59 GMT"}],"updateDate":"2024-08-06","timestamp":1720140744000,"abstract":"  We demonstrate a compact ion beam device capable of accelerating H$^+$ and\nD$^+$ ions up to 75keV energy, on to a solid target, with sufficient beam\ncurrent to study fusion reactions. The ion beam system uses a microwave driven\nplasma source to generate ions that are accelerated to high energy with a\ndirect current (DC) acceleration structure. The plasma source is driven by\npulsed microwaves from a solid-state radiofrequency (RF) amplifier, which is\nimpedance matched to the plasma source chamber at the ISM band frequency\n(2.4-2.5GHz). The plasma chamber is held at high positive DC potential and is\nisolated from the impedance matching structure (at ground potential) by a\ndielectric-filled gap. To facilitate the use of high-energy-particle detectors\nnear the target, the plasma chamber is biased to a high positive voltage, while\nthe target remains grounded. A target loaded with deuterium is used to study\nD-D fusion and a B$_4$C or LaB$_6$ target is used to study p-$^{11}$B fusion.\nDetectors include solid-state charged particle detector and a scintillation\nfast neutron detector. The complete ion beam system can fit on a laboratory\ntable and is a useful tool for teaching undergraduate and graduate students\nabout the physics of fusion.\n","subjects":["Physics/Instrumentation and Detectors","Physics/High Energy Physics - Experiment","Physics/Nuclear Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}