{"id":"2407.18654","title":"Quantifying energy fluence and its uncertainty for radio emission from\n  particle cascades in the presence of noise","authors":"Sara Martinelli, Tim Huege, Diego Ravignani, Harm Schoorlemmer","authorsParsed":[["Martinelli","Sara",""],["Huege","Tim",""],["Ravignani","Diego",""],["Schoorlemmer","Harm",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 10:40:39 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 10:24:00 GMT"}],"updateDate":"2024-07-30","timestamp":1721990439000,"abstract":"  Measurements of radio signals induced by an astroparticle generating a\ncascade present a challenge because they are always superposed with an\nirreducible noise contribution. Quantifying these signals constitutes a\nnon-trivial task, especially at low signal-to-noise ratios (SNR). Because of\nthe randomness of the noise phase, the measurements can be either a\nconstructive or a destructive superposition of signal and noise. To recover the\nelectromagnetic energy of the cascade from the radio measurements, the energy\nfluence, i.e. the time integral of the Poynting vector, has to be estimated.\nConventionally, noise subtraction in the time domain has been employed for\nenergy fluence reconstruction, yielding significant biases, including even\nnon-physical and negative values. To mitigate the effect of this bias, usually\nan SNR threshold cut is imposed, at the expense of excluding valuable data from\nthe analyses. Additionally, the uncertainties derived from the conventional\nmethod are underestimated, even for large SNR values. This work tackles these\nchallenges by detailing a method to correctly estimate the uncertainties and\nlower the reconstruction bias in quantifying radio signals, thereby, ideally,\neliminating the need for an SNR cut. The development of the method is based on\na robust theoretical and statistical background, and the estimation of the\nfluence is performed in the frequency domain, allowing for the improvement of\nfurther analyses by providing access to frequency-dependent fluence estimation.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}