{"id":"2407.09303","title":"ProDepth: Boosting Self-Supervised Multi-Frame Monocular Depth with\n  Probabilistic Fusion","authors":"Sungmin Woo,Wonjoon Lee,Woo Jin Kim,Dogyoon Lee,Sangyoun Lee","authorsParsed":[["Woo","Sungmin",""],["Lee","Wonjoon",""],["Kim","Woo Jin",""],["Lee","Dogyoon",""],["Lee","Sangyoun",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 14:37:49 GMT"}],"updateDate":"2024-07-15","timestamp":1720795069000,"abstract":"  Self-supervised multi-frame monocular depth estimation relies on the\ngeometric consistency between successive frames under the assumption of a\nstatic scene. However, the presence of moving objects in dynamic scenes\nintroduces inevitable inconsistencies, causing misaligned multi-frame feature\nmatching and misleading self-supervision during training. In this paper, we\npropose a novel framework called ProDepth, which effectively addresses the\nmismatch problem caused by dynamic objects using a probabilistic approach. We\ninitially deduce the uncertainty associated with static scene assumption by\nadopting an auxiliary decoder. This decoder analyzes inconsistencies embedded\nin the cost volume, inferring the probability of areas being dynamic. We then\ndirectly rectify the erroneous cost volume for dynamic areas through a\nProbabilistic Cost Volume Modulation (PCVM) module. Specifically, we derive\nprobability distributions of depth candidates from both single-frame and\nmulti-frame cues, modulating the cost volume by adaptively fusing those\ndistributions based on the inferred uncertainty. Additionally, we present a\nself-supervision loss reweighting strategy that not only masks out incorrect\nsupervision with high uncertainty but also mitigates the risks in remaining\npossible dynamic areas in accordance with the probability. Our proposed method\nexcels over state-of-the-art approaches in all metrics on both Cityscapes and\nKITTI datasets, and demonstrates superior generalization ability on the Waymo\nOpen dataset.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}