{"id":"2407.08719","title":"The Impact of Astrophysical Priors on Parameter Inference for GW230529","authors":"Debatri Chattopadhyay, Sama Al-Shammari, Fabio Antonini, Stephen\n  Fairhurst, Benjamin Miles and Vivien Raymond","authorsParsed":[["Chattopadhyay","Debatri",""],["Al-Shammari","Sama",""],["Antonini","Fabio",""],["Fairhurst","Stephen",""],["Miles","Benjamin",""],["Raymond","Vivien",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:53:23 GMT"}],"updateDate":"2024-07-12","timestamp":1720720403000,"abstract":"  We investigate the effects of prior selection on the inferred mass and spin\nparameters of the neutron star-black hole merger GW230529\\_181500.\nSpecifically, we explore models motivated by astrophysical considerations,\nincluding massive binary and pulsar evolution. We examine mass and spin\ndistributions of neutron stars constrained by radio pulsar observations,\nalongside black hole spin observations from previous gravitational wave\ndetections. We show that the inferred mass distribution highly depends upon the\nspin prior. Specifically, under the most restrictive, binary stellar evolution\nmodels, we obtain narrower distributions of masses with a black hole mass of\n$4.1^{+0.2}_{-0.3} \\,M_\\odot$ and neutron star mass of $1.3^{+0.1}_{-0.1}\n\\,M_\\odot$ where, somewhat surprisingly, it is the prior on component spins\nwhich has the greatest impact on the inferred mass distributions. Re-weighting\nusing neutron star mass and spin priors from observations of radio pulsars,\nwith black hole spins from observations of gravitational waves, yields the\nblack hole and the neutron star masses to be $3.8^{+0.5}_{-0.6} \\,M_\\odot$ and\n$1.4^{+0.2}_{-0.1} \\,M_\\odot$ respectively. The sequence of compact object\nformation -- whether the neutron star or the black hole formed first -- cannot\nbe determined at the observed signal-to-noise ratio. However, there is no\nevidence that the black hole was tidally spun up.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xkLYsicWZmRR7Qv5X0dA0PBqcxxd9pnDEHM4mi-1IR8","pdfSize":"575511"}
