{"id":"2407.02567","title":"Local Description of Decoherence of Quantum Superpositions by Black\n  Holes and Other Bodies","authors":"Daine L. Danielson, Gautam Satishchandran, Robert M. Wald","authorsParsed":[["Danielson","Daine L.",""],["Satishchandran","Gautam",""],["Wald","Robert M.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-04","timestamp":1719943203000,"abstract":"  It was previously shown that if an experimenter, Alice, puts a massive or\ncharged body in a quantum spatial superposition, then the presence of a black\nhole (or more generally any Killing horizon) will eventually decohere the\nsuperposition [arXiv:2205.06279, arXiv:2301.00026, arXiv:2311.11461]. This\ndecoherence was identified as resulting from the radiation of soft\nphotons/gravitons through the horizon, thus suggesting that the global\nstructure of the spacetime is essential for describing the decoherence. In this\npaper, we show that the decoherence can alternatively be described in terms of\nthe local two-point function of the quantum field within Alice's lab, without\nany direct reference to the horizon. From this point of view, the decoherence\nof Alice's superposition in the presence of a black hole arises from the\nextremely low frequency Hawking quanta present in Alice's lab. We explicitly\ncalculate the decoherence occurring in Schwarzschild spacetime in the Unruh\nvacuum from the local viewpoint. We then use this viewpoint to elucidate (i)\nthe differences in decoherence effects that would occur in Schwarzschild\nspacetime in the Boulware and Hartle-Hawking vacua; (ii) the difference in\ndecoherence effects that would occur in Minkowski spacetime filled with a\nthermal bath as compared with Schwarzschild spacetime; (iii) the lack of\ndecoherence in the spacetime of a static star even though the vacuum state\noutside the star is similar in many respects to the Boulware vacuum around a\nblack hole; and (iv) the requirements on the degrees of freedom of a material\nbody needed to produce a decoherence effect that mimics that of a black hole.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4jEvAPJ7x-tqk1SiPZb-xn3tqN5RlX2LZ8BpTATETVc","pdfSize":"858179","objectId":"0x30656cfbe928e2017845a35c5b9b4c36e49a1acea6781a1891c22de39193244e","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
