{"id":"2407.01810","title":"Freeview Sketching: View-Aware Fine-Grained Sketch-Based Image Retrieval","authors":"Aneeshan Sain, Pinaki Nath Chowdhury, Subhadeep Koley, Ayan Kumar\n  Bhunia and Yi-Zhe Song","authorsParsed":[["Sain","Aneeshan",""],["Chowdhury","Pinaki Nath",""],["Koley","Subhadeep",""],["Bhunia","Ayan Kumar",""],["Song","Yi-Zhe",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 21:20:44 GMT"}],"updateDate":"2024-07-03","timestamp":1719868844000,"abstract":"  In this paper, we delve into the intricate dynamics of Fine-Grained\nSketch-Based Image Retrieval (FG-SBIR) by addressing a critical yet overlooked\naspect -- the choice of viewpoint during sketch creation. Unlike photo systems\nthat seamlessly handle diverse views through extensive datasets, sketch\nsystems, with limited data collected from fixed perspectives, face challenges.\nOur pilot study, employing a pre-trained FG-SBIR model, highlights the system's\nstruggle when query-sketches differ in viewpoint from target instances.\nInterestingly, a questionnaire however shows users desire autonomy, with a\nsignificant percentage favouring view-specific retrieval. To reconcile this, we\nadvocate for a view-aware system, seamlessly accommodating both view-agnostic\nand view-specific tasks. Overcoming dataset limitations, our first contribution\nleverages multi-view 2D projections of 3D objects, instilling cross-modal view\nawareness. The second contribution introduces a customisable cross-modal\nfeature through disentanglement, allowing effortless mode switching. Extensive\nexperiments on standard datasets validate the effectiveness of our method.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"e6bZ-7NWdJU0xfjN92UOa1EFwXwd1vO_67Nxe9rDiVg","pdfSize":"8300181","objectId":"0x3bdcafba9124e312605ebda95dcb756f4bb35a3c49e08b10b39148220c80c8a1","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
