{"id":"2407.16670","title":"FakingRecipe: Detecting Fake News on Short Video Platforms from the\n  Perspective of Creative Process","authors":"Yuyan Bu, Qiang Sheng, Juan Cao, Peng Qi, Danding Wang, Jintao Li","authorsParsed":[["Bu","Yuyan",""],["Sheng","Qiang",""],["Cao","Juan",""],["Qi","Peng",""],["Wang","Danding",""],["Li","Jintao",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:39:49 GMT"}],"updateDate":"2024-07-24","timestamp":1721756389000,"abstract":"  As short-form video-sharing platforms become a significant channel for news\nconsumption, fake news in short videos has emerged as a serious threat in the\nonline information ecosystem, making developing detection methods for this new\nscenario an urgent need. Compared with that in text and image formats, fake\nnews on short video platforms contains rich but heterogeneous information in\nvarious modalities, posing a challenge to effective feature utilization. Unlike\nexisting works mostly focusing on analyzing what is presented, we introduce a\nnovel perspective that considers how it might be created. Through the lens of\nthe creative process behind news video production, our empirical analysis\nuncovers the unique characteristics of fake news videos in material selection\nand editing. Based on the obtained insights, we design FakingRecipe, a creative\nprocess-aware model for detecting fake news short videos. It captures the fake\nnews preferences in material selection from sentimental and semantic aspects\nand considers the traits of material editing from spatial and temporal aspects.\nTo improve evaluation comprehensiveness, we first construct FakeTT, an English\ndataset for this task, and conduct experiments on both FakeTT and the existing\nChinese FakeSV dataset. The results show FakingRecipe's superiority in\ndetecting fake news on short video platforms.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computers and Society","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/"}