{"id":"2407.03265","title":"Policymaker meetings as heteroscedasticity shifters: Identification and\n  simultaneous inference in unstable SVARs","authors":"Bulat Gafarov, Madina Karamysheva, Andrey Polbin, Anton Skrobotov","authorsParsed":[["Gafarov","Bulat",""],["Karamysheva","Madina",""],["Polbin","Andrey",""],["Skrobotov","Anton",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 16:53:37 GMT"}],"updateDate":"2024-07-04","timestamp":1720025617000,"abstract":"  We propose a novel approach to identification in structural vector\nautoregressions (SVARs) that uses external instruments for heteroscedasticiy of\na structural shock of interest. This approach does not require lead/lag\nexogeneity for identification, does not require heteroskedasticity to be\npersistent, and facilitates interpretation of the structural shocks. To\nimplement this identification approach in applications, we develop a new method\nfor simultaneous inference of structural impulse responses and other\nparameters, employing a dependent wild-bootstrap of local projection\nestimators. This method is robust to an arbitrary number of unit roots and\ncointegration relationships, time-varying local means and drifts, and\nconditional heteroskedasticity of unknown form and can be used with other\nidentification schemes, including Cholesky and the conventional external IV. We\nshow how to construct pointwise and simultaneous confidence bounds for\nstructural impulse responses and how to compute smoothed local projections with\nthe corresponding confidence bounds. Using simulated data from a standard\nlog-linearized DSGE model, we show that the method can reliably recover the\ntrue impulse responses in realistic datasets. As an empirical application, we\nadopt the proposed method in order to identify monetary policy shock using the\ndates of FOMC meetings in a standard six-variable VAR. The robustness of our\nidentification and inference methods allows us to construct an instrumental\nvariable for monetary policy shock that dates back to 1965. The resulting\nimpulse response functions for all variables align with the classical Cholesky\nidentification scheme and are different from the narrative sign restricted\nBayesian VAR estimates. In particular, the response to inflation manifests a\nprice puzzle that is indicative of the cost channel of the interest rates.\n","subjects":["Economics/Econometrics"],"license":"http://creativecommons.org/licenses/by/4.0/"}