{"id":"2407.11324","title":"ApproxPilot: A GNN-based Accelerator Approximation Framework","authors":"Qing Zhang, Cheng Liu, Siting Liu, Yajuan Hui, Huawei Li and Xiaowei\n  Li","authorsParsed":[["Zhang","Qing",""],["Liu","Cheng",""],["Liu","Siting",""],["Hui","Yajuan",""],["Li","Huawei",""],["Li","Xiaowei",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 02:27:28 GMT"}],"updateDate":"2024-07-17","timestamp":1721096848000,"abstract":"  A typical optimization of customized accelerators for error-tolerant\napplications such as multimedia, recognition, and classification is to replace\ntraditional arithmetic units like multipliers and adders with the approximate\nones to enhance energy efficiency while adhering to accuracy requirements.\nHowever, the plethora of arithmetic units and diverse approximate unit options\nresult in an exceedingly large design space. Therefore, there is a pressing\nneed for an end-to-end design framework capable of navigating this intricate\ndesign space for approximation optimization. Traditional methods relying on\nsimulation-based or blackbox model evaluations suffer from either high\ncomputational costs or limitations in accuracy and scalability, posing\nsignificant challenges to the optimization process. In this paper, we propose a\nGraph Neural Network (GNN) model that leverages the physical connections of\narithmetic units to capture their influence on the performance, power, area\n(PPA), and accuracy of the accelerator. Particularly, we notice that critical\npath plays a key role in node feature of the GNN model and having it embedded\nin the feature vector greatly enhances the prediction quality of the models. On\ntop of the models that allow rapid and efficient PPA and accuracy prediction of\nvarious approximate accelerator configurations, we can further explore the\nlarge design space effectively and build an end-to-end accelerator\napproximation framework named ApproxPilot to optimize the accelerator\napproximation. Our experimental results demonstrate that ApproxPilot\noutperforms state-of-the-art approximation optimization frameworks in both\nperformance and hardware overhead with the same accuracy constraints.\n","subjects":["Computing Research Repository/Hardware Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}