{"id":"2407.13304","title":"A Dataset and Benchmark for Shape Completion of Fruits for Agricultural\n  Robotics","authors":"Federico Magistri, Thomas L\\\"abe, Elias Marks, Sumanth Nagulavancha,\n  Yue Pan, Claus Smitt, Lasse Klingbeil, Michael Halstead, Heiner Kuhlmann,\n  Chris McCool, Jens Behley, Cyrill Stachniss","authorsParsed":[["Magistri","Federico",""],["Läbe","Thomas",""],["Marks","Elias",""],["Nagulavancha","Sumanth",""],["Pan","Yue",""],["Smitt","Claus",""],["Klingbeil","Lasse",""],["Halstead","Michael",""],["Kuhlmann","Heiner",""],["McCool","Chris",""],["Behley","Jens",""],["Stachniss","Cyrill",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:07:23 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 08:16:57 GMT"}],"updateDate":"2024-09-18","timestamp":1721293643000,"abstract":"  As the world population is expected to reach 10 billion by 2050, our\nagricultural production system needs to double its productivity despite a\ndecline of human workforce in the agricultural sector. Autonomous robotic\nsystems are one promising pathway to increase productivity by taking over\nlabor-intensive manual tasks like fruit picking. To be effective, such systems\nneed to monitor and interact with plants and fruits precisely, which is\nchallenging due to the cluttered nature of agricultural environments causing,\nfor example, strong occlusions. Thus, being able to estimate the complete 3D\nshapes of objects in presence of occlusions is crucial for automating\noperations such as fruit harvesting. In this paper, we propose the first\npublicly available 3D shape completion dataset for agricultural vision systems.\nWe provide an RGB-D dataset for estimating the 3D shape of fruits.\nSpecifically, our dataset contains RGB-D frames of single sweet peppers in lab\nconditions but also in a commercial greenhouse. For each fruit, we additionally\ncollected high-precision point clouds that we use as ground truth. For\nacquiring the ground truth shape, we developed a measuring process that allows\nus to record data of real sweet pepper plants, both in the lab and in the\ngreenhouse with high precision, and determine the shape of the sensed fruits.\nWe release our dataset, consisting of almost 7,000 RGB-D frames belonging to\nmore than 100 different fruits. We provide segmented RGB-D frames, with camera\nintrinsics to easily obtain colored point clouds, together with the\ncorresponding high-precision, occlusion-free point clouds obtained with a\nhigh-precision laser scanner. We additionally enable evaluation of shape\ncompletion approaches on a hidden test set through a public challenge on a\nbenchmark server.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}