{"id":"2407.20579","title":"Measurement and Modeling of Polarized Atmosphere at the South Pole with\n  SPT-3G","authors":"A. Coerver, J. A. Zebrowski, S. Takakura, W. L. Holzapfel, P. A. R.\n  Ade, A. J. Anderson, Z. Ahmed, B. Ansarinejad, M. Archipley, L. Balkenhol, D.\n  Barron, K. Benabed, A. N. Bender, B. A. Benson, F. Bianchini, L. E. Bleem, F.\n  R. Bouchet, L. Bryant, E. Camphuis, J. E. Carlstrom, T. W. Cecil, C. L.\n  Chang, P. Chaubal, P. M. Chichura, A. Chokshi, T.-L. Chou, T. M. Crawford, A.\n  Cukierman, C. Daley, T. de Haan, K. R. Dibert, M. A. Dobbs, A. Doussot, D.\n  Dutcher, W. Everett, C. Feng, K. R. Ferguson, K. Fichman, A. Foster, S.\n  Galli, A. E. Gambrel, R. W. Gardner, F. Ge, N. Goeckner-Wald, R. Gualtieri,\n  F. Guidi, S. Guns, N. W. Halverson, E. Hivon, G. P. Holder, J. C. Hood, A.\n  Hryciuk, N. Huang, F. Keruzore, A. R. Khalife, L. Knox, M. Korman, K.\n  Kornoelje, C.-L. Kuo, A. T. Lee, K. Levy, A. E. Lowitz, C. Lu, A. Maniyar, E.\n  S. Martsen, F. Menanteau, M. Millea, J. Montgomery, Y. Nakato, T. Natoli, G.\n  I. Noble, V. Novosad, Y. Omori, S. Padin, Z. Pan, P. Paschos, K. A. Phadke,\n  A. W. Pollak, K. Prabhu, W. Quan, M. Rahimi, A. Rahlin, C. L. Reichardt, M.\n  Rouble, J. E. Ruhl, E. Schiappucci, G. Smecher, J. A. Sobrin, A. A. Stark, J.\n  Stephen, A. Suzuki, C. Tandoi, K. L. Thompson, B. Thorne, C. Trendafilova, C.\n  Tucker, C. Umilta, J. D. Vieira, A. Vitrier, Y. Wan, G. Wang, N. Whitehorn,\n  W. L. K. Wu, V. Yefremenko, M. R. Young","authorsParsed":[["Coerver","A.",""],["Zebrowski","J. A.",""],["Takakura","S.",""],["Holzapfel","W. L.",""],["Ade","P. A. R.",""],["Anderson","A. J.",""],["Ahmed","Z.",""],["Ansarinejad","B.",""],["Archipley","M.",""],["Balkenhol","L.",""],["Barron","D.",""],["Benabed","K.",""],["Bender","A. N.",""],["Benson","B. A.",""],["Bianchini","F.",""],["Bleem","L. E.",""],["Bouchet","F. R.",""],["Bryant","L.",""],["Camphuis","E.",""],["Carlstrom","J. E.",""],["Cecil","T. W.",""],["Chang","C. L.",""],["Chaubal","P.",""],["Chichura","P. M.",""],["Chokshi","A.",""],["Chou","T. -L.",""],["Crawford","T. M.",""],["Cukierman","A.",""],["Daley","C.",""],["de Haan","T.",""],["Dibert","K. R.",""],["Dobbs","M. A.",""],["Doussot","A.",""],["Dutcher","D.",""],["Everett","W.",""],["Feng","C.",""],["Ferguson","K. R.",""],["Fichman","K.",""],["Foster","A.",""],["Galli","S.",""],["Gambrel","A. E.",""],["Gardner","R. W.",""],["Ge","F.",""],["Goeckner-Wald","N.",""],["Gualtieri","R.",""],["Guidi","F.",""],["Guns","S.",""],["Halverson","N. W.",""],["Hivon","E.",""],["Holder","G. P.",""],["Hood","J. C.",""],["Hryciuk","A.",""],["Huang","N.",""],["Keruzore","F.",""],["Khalife","A. R.",""],["Knox","L.",""],["Korman","M.",""],["Kornoelje","K.",""],["Kuo","C. -L.",""],["Lee","A. T.",""],["Levy","K.",""],["Lowitz","A. E.",""],["Lu","C.",""],["Maniyar","A.",""],["Martsen","E. S.",""],["Menanteau","F.",""],["Millea","M.",""],["Montgomery","J.",""],["Nakato","Y.",""],["Natoli","T.",""],["Noble","G. I.",""],["Novosad","V.",""],["Omori","Y.",""],["Padin","S.",""],["Pan","Z.",""],["Paschos","P.",""],["Phadke","K. A.",""],["Pollak","A. W.",""],["Prabhu","K.",""],["Quan","W.",""],["Rahimi","M.",""],["Rahlin","A.",""],["Reichardt","C. L.",""],["Rouble","M.",""],["Ruhl","J. E.",""],["Schiappucci","E.",""],["Smecher","G.",""],["Sobrin","J. A.",""],["Stark","A. A.",""],["Stephen","J.",""],["Suzuki","A.",""],["Tandoi","C.",""],["Thompson","K. L.",""],["Thorne","B.",""],["Trendafilova","C.",""],["Tucker","C.",""],["Umilta","C.",""],["Vieira","J. D.",""],["Vitrier","A.",""],["Wan","Y.",""],["Wang","G.",""],["Whitehorn","N.",""],["Wu","W. L. K.",""],["Yefremenko","V.",""],["Young","M. R.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 06:24:49 GMT"}],"updateDate":"2024-07-31","timestamp":1722320689000,"abstract":"  We present the detection and characterization of fluctuations in linearly\npolarized emission from the atmosphere above the South Pole. These measurements\nmake use of Austral winter survey data from the SPT-3G receiver on the South\nPole Telescope in three frequency bands centered at 95, 150, and 220 GHz. We\nuse the cross-correlation between detectors to produce an unbiased estimate of\nthe power in Stokes I, Q, and U parameters on large angular scales. Our results\nare consistent with the polarized signal being produced by the combination of\nRayleigh scattering of thermal radiation from the ground and thermal emission\nfrom a population of horizontally aligned ice crystals with an anisotropic\ndistribution described by Kolmogorov turbulence. The signal is most significant\nat large angular scales, high observing frequency, and low elevation angle.\nPolarized atmospheric emission has the potential to significantly impact\nobservations on the large angular scales being targeted by searches for\ninflationary B-mode CMB polarization. We present the distribution of measured\nangular power spectrum amplitudes in Stokes Q and I for 4 years of winter\nobservations, which can be used to simulate the impact of atmospheric\npolarization and intensity fluctuations at the South Pole on a specified\nexperiment and observation strategy. For the SPT-3G data, downweighting the\nsmall fraction of significantly contaminated observations is an effective\nmitigation strategy. In addition, we present a strategy for further improving\nsensitivity on large angular scales where maps made in the 220 GHz band are\nused to measure and subtract the polarized atmosphere signal from the 150 GHz\nband maps. In observations with the SPT-3G instrument at the South Pole, the\npolarized atmospheric signal is a well-understood and sub-dominant contribution\nto the measured noise after implementing the mitigation strategies described\nhere.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}