{"id":"2407.12873","title":"Evaluation of RAG Metrics for Question Answering in the Telecom Domain","authors":"Sujoy Roychowdhury, Sumit Soman, H G Ranjani, Neeraj Gunda, Vansh\n  Chhabra, Sai Krishna Bala","authorsParsed":[["Roychowdhury","Sujoy",""],["Soman","Sumit",""],["Ranjani","H G",""],["Gunda","Neeraj",""],["Chhabra","Vansh",""],["Bala","Sai Krishna",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:40:15 GMT"}],"updateDate":"2024-07-23","timestamp":1721065215000,"abstract":"  Retrieval Augmented Generation (RAG) is widely used to enable Large Language\nModels (LLMs) perform Question Answering (QA) tasks in various domains.\nHowever, RAG based on open-source LLM for specialized domains has challenges of\nevaluating generated responses. A popular framework in the literature is the\nRAG Assessment (RAGAS), a publicly available library which uses LLMs for\nevaluation. One disadvantage of RAGAS is the lack of details of derivation of\nnumerical value of the evaluation metrics. One of the outcomes of this work is\na modified version of this package for few metrics (faithfulness, context\nrelevance, answer relevance, answer correctness, answer similarity and factual\ncorrectness) through which we provide the intermediate outputs of the prompts\nby using any LLMs. Next, we analyse the expert evaluations of the output of the\nmodified RAGAS package and observe the challenges of using it in the telecom\ndomain. We also study the effect of the metrics under correct vs. wrong\nretrieval and observe that few of the metrics have higher values for correct\nretrieval. We also study for differences in metrics between base embeddings and\nthose domain adapted via pre-training and fine-tuning. Finally, we comment on\nthe suitability and challenges of using these metrics for in-the-wild telecom\nQA task.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}