{"id":"2407.11086","title":"Pre-training with Fractional Denoising to Enhance Molecular Property\n  Prediction","authors":"Yuyan Ni, Shikun Feng, Xin Hong, Yuancheng Sun, Wei-Ying Ma, Zhi-Ming\n  Ma, Qiwei Ye, Yanyan Lan","authorsParsed":[["Ni","Yuyan",""],["Feng","Shikun",""],["Hong","Xin",""],["Sun","Yuancheng",""],["Ma","Wei-Ying",""],["Ma","Zhi-Ming",""],["Ye","Qiwei",""],["Lan","Yanyan",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 11:09:42 GMT"}],"updateDate":"2024-07-17","timestamp":1720955382000,"abstract":"  Deep learning methods have been considered promising for accelerating\nmolecular screening in drug discovery and material design. Due to the limited\navailability of labelled data, various self-supervised molecular pre-training\nmethods have been presented. While many existing methods utilize common\npre-training tasks in computer vision (CV) and natural language processing\n(NLP), they often overlook the fundamental physical principles governing\nmolecules. In contrast, applying denoising in pre-training can be interpreted\nas an equivalent force learning, but the limited noise distribution introduces\nbias into the molecular distribution. To address this issue, we introduce a\nmolecular pre-training framework called fractional denoising (Frad), which\ndecouples noise design from the constraints imposed by force learning\nequivalence. In this way, the noise becomes customizable, allowing for\nincorporating chemical priors to significantly improve molecular distribution\nmodeling. Experiments demonstrate that our framework consistently outperforms\nexisting methods, establishing state-of-the-art results across force\nprediction, quantum chemical properties, and binding affinity tasks. The\nrefined noise design enhances force accuracy and sampling coverage, which\ncontribute to the creation of physically consistent molecular representations,\nultimately leading to superior predictive performance.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}