{"id":"2407.12364","title":"TL properties of RE-Doped and Co-doped Sol-gel Silica Rods. Application\n  to Passive (OSL) and Real-time (RL) Dosimetry","authors":"Mourad Benabdesselam (INPHYNI), J. Bahout (Photonique), Franck Mady\n  (INPHYNI), Wilfried Blanc (INPHYNI), Hicham El Hamzaoui (Photonique), Andy\n  Cassez (IRCICA), Karen Delplace-Baudelle (IRCICA), Remi Habert (IRCICA),\n  Geraud Bouwmans (Photonique), Mohamed Bouazaoui (Photonique), Bruno Capoen\n  (Photonique, IRCICA)","authorsParsed":[["Benabdesselam","Mourad","","INPHYNI"],["Bahout","J.","","Photonique"],["Mady","Franck","","INPHYNI"],["Blanc","Wilfried","","INPHYNI"],["Hamzaoui","Hicham El","","Photonique"],["Cassez","Andy","","IRCICA"],["Delplace-Baudelle","Karen","","IRCICA"],["Habert","Remi","","IRCICA"],["Bouwmans","Geraud","","Photonique"],["Bouazaoui","Mohamed","","Photonique"],["Capoen","Bruno","","Photonique, IRCICA"]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 07:40:40 GMT"}],"updateDate":"2024-07-18","timestamp":1721202040000,"abstract":"  Two rods made from sol-gel silica have been doped with Ce ions or co-doped\nwith Ce and Tb ions respectively. First, a thermoluminescence (TL)\ncharacterization of the trapping and luminescence parameters is carried out to\nunderstand the physical mechanisms involved following the irradiation of these\nrods and to evaluate their dosimetric properties. The optically stimulated\nluminescence (OSL) and the radioluminescence (RL) responses as a function of\nrespectively absorbed dose and dose rate are assessed. The OSL response of both\nrods is linear as a function of the absorbed dose. The RL sensitivity of both\nrods proves not only to be extremely high but also shows a linear behavior over\nmore than 6 decades, allowing real-time detection of dose rates as low as few\n$\\mu$Gy s$^{-1}$, a threshold that to our knowledge, has never been reached.\nThe results from RL and OSL show that these silica-based doped rods are\npotentially suitable for medical dosimetry and environmental monitoring around\nnuclear sites.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}