{"id":"2407.13607","title":"Atomistic evolution of active sites in multi-component heterogeneous\n  catalysts","authors":"Cameron J. Owen, Lorenzo Russotto, Christopher R. O'Connor, Nicholas\n  Marcella, Anders Johansson, Albert Musaelian, and Boris Kozinsky","authorsParsed":[["Owen","Cameron J.",""],["Russotto","Lorenzo",""],["O'Connor","Christopher R.",""],["Marcella","Nicholas",""],["Johansson","Anders",""],["Musaelian","Albert",""],["Kozinsky","Boris",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 15:45:37 GMT"}],"updateDate":"2024-07-19","timestamp":1721317537000,"abstract":"  Multi-component metal nanoparticles (NPs) are of paramount importance in the\nchemical industry, as most processes therein employ heterogeneous catalysts.\nWhile these multi-component systems have been shown to result in higher product\nyields, improved selectivities, and greater stability through catalytic\ncycling, the structural dynamics of these materials in response to various\nstimuli (e.g. temperature, adsorbates, etc.) are not understood with atomistic\nresolution. Here, we present a highly accurate equivariant machine-learned\nforce field (MLFF), constructed from ab initio training data collected using\nBayesian active learning, that is able to reliably simulate PdAu surfaces and\nNPs in response to thermal treatment as well as exposure to reactive H$_2$\natmospheres. We thus provide a single model that is able to reliably describe\nthe full space of geometric and chemical complexity for such a heterogeneous\ncatalytic system across single crystals, gas-phase interactions, and NPs\nreacting with H$_2$, including catalyst degradation and explicit reactivity.\nUltimately, we provide direct atomistic evidence that verifies existing\nexperimental hypotheses for bimetallic catalyst deactivation under reaction\nconditions, namely that Pd preferentially segregates into the Au bulk through\naggressive catalytic cycling and that this degradation is site-selective, as\nwell as the reactivity for hydrogen exchange as a function of Pd ensemble size.\nWe demonstrate that understanding of the atomistic evolution of these active\nsites is of the utmost importance, as it allows for design and control of\nmaterial structure and corresponding performance, which can be vetted in\nsilico.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics","Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}