{"id":"2407.05571","title":"Cost-Efficient Computation Offloading in SAGIN: A Deep Reinforcement\n  Learning and Perception-Aided Approach","authors":"Yulan Gao, Ziqiang Ye, Han Yu","authorsParsed":[["Gao","Yulan",""],["Ye","Ziqiang",""],["Yu","Han",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 03:03:06 GMT"}],"updateDate":"2024-07-09","timestamp":1720407786000,"abstract":"  The Space-Air-Ground Integrated Network (SAGIN), crucial to the advancement\nof sixth-generation (6G) technology, plays a key role in ensuring universal\nconnectivity, particularly by addressing the communication needs of remote\nareas lacking cellular network infrastructure. This paper delves into the role\nof unmanned aerial vehicles (UAVs) within SAGIN, where they act as a control\nlayer owing to their adaptable deployment capabilities and their intermediary\nrole. Equipped with millimeter-wave (mmWave) radar and vision sensors, these\nUAVs are capable of acquiring multi-source data, which helps to diminish\nuncertainty and enhance the accuracy of decision-making. Concurrently, UAVs\ncollect tasks requiring computing resources from their coverage areas,\noriginating from a variety of mobile devices moving at different speeds. These\ntasks are then allocated to ground base stations (BSs), low-earth-orbit (LEO)\nsatellite, and local processing units to improve processing efficiency. Amidst\nthis framework, our study concentrates on devising dynamic strategies for\nfacilitating task hosting between mobile devices and UAVs, offloading\ncomputations, managing associations between UAVs and BSs, and allocating\ncomputing resources. The objective is to minimize the time-averaged network\ncost, considering the uncertainty of device locations, speeds, and even types.\nTo tackle these complexities, we propose a deep reinforcement learning and\nperception-aided online approach (DRL-and-Perception-aided Approach) for this\njoint optimization in SAGIN, tailored for an environment filled with\nuncertainties. The effectiveness of our proposed approach is validated through\nextensive numerical simulations, which quantify its performance relative to\nvarious network parameters.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}