{"id":"2407.13682","title":"Tuning collective actuation of active solids by optimizing activity\n  localization","authors":"Davi Lazzari, Olivier Dauchot and Carolina Brito","authorsParsed":[["Lazzari","Davi",""],["Dauchot","Olivier",""],["Brito","Carolina",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:54:17 GMT"},{"version":"v2","created":"Wed, 11 Sep 2024 20:29:47 GMT"}],"updateDate":"2024-09-13","timestamp":1721321657000,"abstract":"  Active solids, more specifically elastic lattices embedded with polar active\nunits, exhibit collective actuation when the elasto-active feedback,\ngenerically present in such systems, exceeds some critical value. The dynamics\nthen condensates on a small fraction of the vibrational modes, the selection of\nwhich obeys non trivial rules rooted in the nonlinear part of the dynamics. So\nfar the complexity of the selection mechanism has limited the design of\nspecific actuation. Here we investigate numerically how, localizing the\nactivity on a fraction of modes, one can select non-trivial collective\nactuation. We perform numerical simulations of an agent based model on\ntriangular and disordered lattices and vary the concentration and the\nlocalization of the active agents on the lattices nodes. Both contribute to the\ndistribution of the elastic energy across the modes. We then introduce an\nalgorithm, which, for a given fraction of active nodes, evolves the\nlocalization of the activity in such a way that the energy distribution on a\nfew targeted modes is maximized -- or minimized. We illustrate on a specific\ntargeted actuation, how the algorithm performs as compared to manually chosen\nlocalization of the activity. While, in the case of the ordered lattice, a well\neducated guess performs better than the algorithm, the latter outperform the\nmanual trials in the case of the disordered lattice. Finally, the analysis of\nthe results in the case of the ordered lattice leads us to introduce a design\nprinciple based on a measure of the susceptibility of the modes to be activated\nalong certain activation paths.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Materials Science","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}