{"id":"2407.08879","title":"Scalable microwave-to-optical transducers at single photon level with\n  spins","authors":"Tian Xie, Rikuto Fukumori, Jiahui Li, and Andrei Faraon","authorsParsed":[["Xie","Tian",""],["Fukumori","Rikuto",""],["Li","Jiahui",""],["Faraon","Andrei",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 21:43:02 GMT"}],"updateDate":"2024-07-15","timestamp":1720734182000,"abstract":"  Microwave-to-optical transduction of single photons will play an essential\nrole in interconnecting future superconducting quantum devices, with\napplications in distributed quantum computing and secure communications.\nVarious transducers that couple microwave and optical modes via an optical\ndrive have been developed, utilizing nonlinear phenomena such as the Pockels\neffect and a combination of electromechanical, piezoelectric, and\noptomechanical couplings. However, the limited strength of these\nnonlinearities, set by bulk material properties, requires the use of high\nquality factor resonators, often in conjunction with sophisticated\nnano-fabrication of suspended structures. Thus, an efficient and scalable\ntransduction technology is still an outstanding goal. Rare-earth ion (REI)\ndoped crystals provide high-quality atomic resonances that result in effective\nsecond-order nonlinearities stronger by many orders of magnitude compared to\nconventional materials. Here, we use ytterbium-171 ions doped in a YVO$_4$\ncrystal at 340 ppm with an effective resonant $\\chi^{(2)}$ nonlinearity of ~\n10$^7$ pm/V to implement an on-chip microwave-to-optical transducer. Without an\nengineered optical cavity, we achieve percent-level efficiencies with an added\nnoise as low as 1.24(9) photons. To showcase scalability, we demonstrate the\ninterference of photons originating from two simultaneously operated\ntransducers, enabled by the inherent absolute frequencies of the atomic\ntransitions. These results establish REI-based transducers as a highly\ncompetitive transduction platform, provide existing REI-based quantum\ntechnologies a native link to various leading quantum microwave platforms, and\npave the way toward remote transducer-assisted entanglement of superconducting\nquantum machines.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}