{"id":"2407.10184","title":"Towards Robust Recommendation via Decision Boundary-aware Graph\n  Contrastive Learning","authors":"Jiakai Tang, Sunhao Dai, Zexu Sun, Xu Chen, Jun Xu, Wenhui Yu, Lantao\n  Hu, Peng Jiang, Han Li","authorsParsed":[["Tang","Jiakai",""],["Dai","Sunhao",""],["Sun","Zexu",""],["Chen","Xu",""],["Xu","Jun",""],["Yu","Wenhui",""],["Hu","Lantao",""],["Jiang","Peng",""],["Li","Han",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 13:03:35 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 01:10:52 GMT"}],"updateDate":"2024-07-23","timestamp":1720962215000,"abstract":"  In recent years, graph contrastive learning (GCL) has received increasing\nattention in recommender systems due to its effectiveness in reducing bias\ncaused by data sparsity. However, most existing GCL models rely on heuristic\napproaches and usually assume entity independence when constructing contrastive\nviews. We argue that these methods struggle to strike a balance between\nsemantic invariance and view hardness across the dynamic training process, both\nof which are critical factors in graph contrastive learning.\n  To address the above issues, we propose a novel GCL-based recommendation\nframework RGCL, which effectively maintains the semantic invariance of\ncontrastive pairs and dynamically adapts as the model capability evolves\nthrough the training process. Specifically, RGCL first introduces decision\nboundary-aware adversarial perturbations to constrain the exploration space of\ncontrastive augmented views, avoiding the decrease of task-specific\ninformation. Furthermore, to incorporate global user-user and item-item\ncollaboration relationships for guiding on the generation of hard contrastive\nviews, we propose an adversarial-contrastive learning objective to construct a\nrelation-aware view-generator. Besides, considering that unsupervised GCL could\npotentially narrower margins between data points and the decision boundary,\nresulting in decreased model robustness, we introduce the adversarial examples\nbased on maximum perturbations to achieve margin maximization. We also provide\ntheoretical analyses on the effectiveness of our designs. Through extensive\nexperiments on five public datasets, we demonstrate the superiority of RGCL\ncompared against twelve baseline models.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}