{"id":"2407.02392","title":"TokenPacker: Efficient Visual Projector for Multimodal LLM","authors":"Wentong Li, Yuqian Yuan, Jian Liu, Dongqi Tang, Song Wang, Jie Qin,\n  Jianke Zhu, Lei Zhang","authorsParsed":[["Li","Wentong",""],["Yuan","Yuqian",""],["Liu","Jian",""],["Tang","Dongqi",""],["Wang","Song",""],["Qin","Jie",""],["Zhu","Jianke",""],["Zhang","Lei",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 16:10:55 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 12:55:46 GMT"},{"version":"v3","created":"Fri, 23 Aug 2024 12:27:06 GMT"},{"version":"v4","created":"Wed, 28 Aug 2024 08:49:57 GMT"}],"updateDate":"2024-08-29","timestamp":1719936655000,"abstract":"  The visual projector serves as an essential bridge between the visual encoder\nand the Large Language Model (LLM) in a Multimodal LLM (MLLM). Typically, MLLMs\nadopt a simple MLP to preserve all visual contexts via one-to-one\ntransformation. However, the visual tokens are redundant and can be\nconsiderably increased when dealing with high-resolution images, impairing the\nefficiency of MLLMs significantly. Some recent works have introduced resampler\nor abstractor to reduce the number of resulting visual tokens. Unfortunately,\nthey fail to capture finer details and undermine the visual reasoning\ncapabilities of MLLMs. In this work, we propose a novel visual projector, which\nadopts a coarse-to-fine scheme to inject the enriched characteristics to\ngenerate the condensed visual tokens. In specific, we first interpolate the\nvisual features as a low-resolution point query, providing the overall visual\nrepresentation as the foundation. Then, we introduce a region-to-point\ninjection module that utilizes high-resolution, multi-level region-based cues\nas fine-grained reference keys and values, allowing them to be fully absorbed\nwithin the corresponding local context region. This step effectively updates\nthe coarse point query, transforming it into an enriched one for the subsequent\nLLM reasoning. Extensive experiments demonstrate that our approach compresses\nthe visual tokens by 75%~89%, while achieves comparable or even better\nperformance across diverse benchmarks with significantly higher efficiency. The\nsource codes can be found at https://github.com/CircleRadon/TokenPacker.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}