{"id":"2407.21550","title":"Topological Anderson insulator phases in one dimensional quasi-periodic\n  mechanical SSH chains","authors":"Sayan Sircar","authorsParsed":[["Sircar","Sayan",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 12:16:04 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 10:41:56 GMT"},{"version":"v3","created":"Sat, 10 Aug 2024 12:37:59 GMT"},{"version":"v4","created":"Tue, 20 Aug 2024 11:56:38 GMT"},{"version":"v5","created":"Tue, 27 Aug 2024 18:29:20 GMT"}],"updateDate":"2024-08-29","timestamp":1722428164000,"abstract":"  In this paper, we investigate the transition between topological phases in a\nSu-Schrieffer-Heeger (SSH) model composed of springs and masses in which the\nintracellular Aubry-Andr\\'e disorder modulates the spring constants. We\nanalytically compute the eigenvectors and eigenvalues of the dynamical matrix\nfor both periodic and fixed boundary conditions, and compare them with the\ndispersion spectrum of the original tight-binding SSH model. We observe the\npresence of a topological Anderson insulating (TAI) phase within a specific\nrange of quasi-periodic modulation strength and calculate the phase transition\nboundary analytically. We examine the localization properties of normal modes\nusing their inverse participation ratio (IPR) of eigenstates of the dynamical\nmatrix, and the corresponding fractal dimension associated with quasiperiodic\nmodulation. We also examine the stability of the TAI phase across a range of\nmodulation strengths and comments on the presence of mobility edge that\nseparate localized modes from non-localized ones. We demonstrate the fact that\nspecial analytical techniques are needed to compute an exact expression for\nmobility edges in such scenarios.\n","subjects":["Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"olvXlXbOW-x88KGXQhv9u7U8XCwmOMj4BmbNsgXZD6A","pdfSize":"1528928","objectId":"0xa9d913a79f6561b2015596a58d02e97c8c03e01475489b76d05c85d2f366bb29","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
