{"id":"2407.19459","title":"An Alternative to Multi-Factor Authentication with a Triple-Identity\n  Authentication Scheme","authors":"Suyun Borjigin","authorsParsed":[["Borjigin","Suyun",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 10:27:35 GMT"},{"version":"v2","created":"Sat, 3 Aug 2024 08:15:23 GMT"},{"version":"v3","created":"Mon, 12 Aug 2024 09:18:04 GMT"}],"updateDate":"2024-08-13","timestamp":1722162455000,"abstract":"  Every user authentication scheme involves three login credentials, i.e. a\nusername, a password and a hash value, but only one of them is associated with\na user identity. However, this single identity is not robust enough to protect\nthe whole system and the login entries (i.e., the username and password forms)\nhave not been effectively authenticated. Therefore, a multi-factor\nauthentication service is utilized to help guarantee the account security by\ntransmitting an extra factor to the user to use. If more identities can be\nemployed for the two login forms to associate with the corresponding login\ncredentials, and if the identifiers are neither transmitted through the network\nnor accessible to users, such a system can be more robust even without relying\non a third-party service. To achieve this, a triple-identity authentication\nscheme is designed within a dual-password login-authentication system, by which\nthe identities for the username and the login password can be defined\nrespectively. Therefore, in addition to the traditional server verification,\nthe system can also verify the identity of a user at the username and password\nforms simultaneously. In the triple-identity authentication, the identifiers\nare entirely managed by the system without involvement of users or any\nthird-party service, and they are concealed, incommunicable, inaccessible and\nindependent of personal information. Thus, such truly unique identifiers are\nuseless in online attacks.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Emerging Technologies","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"BfFPNWPYphRdHcjuUgCqzHWTsaAjCKo440e5vSB4PEc","pdfSize":"71802"}
