{"id":"2407.16437","title":"Multi-Industry Simplex 2.0 : Temporally-Evolving Probabilistic Industry\n  Classification","authors":"Maksim Papenkov","authorsParsed":[["Papenkov","Maksim",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 12:42:09 GMT"}],"updateDate":"2024-07-24","timestamp":1721738529000,"abstract":"  Accurate industry classification is critical for many areas of portfolio\nmanagement, yet the traditional single-industry framework of the Global\nIndustry Classification Standard (GICS) struggles to comprehensively represent\nrisk for highly diversified multi-sector conglomerates like Amazon. Previously,\nwe introduced the Multi-Industry Simplex (MIS), a probabilistic extension of\nGICS that utilizes topic modeling, a natural language processing approach.\nAlthough our initial version, MIS-1, was able to improve upon GICS by providing\nmulti-industry representations, it relied on an overly simple architecture that\nrequired prior knowledge about the number of industries and relied on the\nunrealistic assumption that industries are uncorrelated and independent over\ntime. We improve upon this model with MIS-2, which addresses three key\nlimitations of MIS-1 : we utilize Bayesian Non-Parametrics to automatically\ninfer the number of industries from data, we employ Markov Updating to account\nfor industries that change over time, and we adjust for correlated and\nhierarchical industries allowing for both broad and niche industries (similar\nto GICS). Further, we provide an out-of-sample test directly comparing MIS-2\nand GICS on the basis of future correlation prediction, where we find evidence\nthat MIS-2 provides a measurable improvement over GICS. MIS-2 provides\nportfolio managers with a more robust tool for industry classification,\nempowering them to more effectively identify and manage risk, particularly\naround multi-sector conglomerates in a rapidly evolving market in which new\nindustries periodically emerge.\n","subjects":["Quantitative Finance/Portfolio Management"],"license":"http://creativecommons.org/licenses/by/4.0/"}