{"id":"2407.08725","title":"MetaUrban: A Simulation Platform for Embodied AI in Urban Spaces","authors":"Wayne Wu, Honglin He, Yiran Wang, Chenda Duan, Jack He, Zhizheng Liu,\n  Quanyi Li, Bolei Zhou","authorsParsed":[["Wu","Wayne",""],["He","Honglin",""],["Wang","Yiran",""],["Duan","Chenda",""],["He","Jack",""],["Liu","Zhizheng",""],["Li","Quanyi",""],["Zhou","Bolei",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:56:49 GMT"}],"updateDate":"2024-07-12","timestamp":1720720609000,"abstract":"  Public urban spaces like streetscapes and plazas serve residents and\naccommodate social life in all its vibrant variations. Recent advances in\nRobotics and Embodied AI make public urban spaces no longer exclusive to\nhumans. Food delivery bots and electric wheelchairs have started sharing\nsidewalks with pedestrians, while diverse robot dogs and humanoids have\nrecently emerged in the street. Ensuring the generalizability and safety of\nthese forthcoming mobile machines is crucial when navigating through the\nbustling streets in urban spaces. In this work, we present MetaUrban, a\ncompositional simulation platform for Embodied AI research in urban spaces.\nMetaUrban can construct an infinite number of interactive urban scenes from\ncompositional elements, covering a vast array of ground plans, object\nplacements, pedestrians, vulnerable road users, and other mobile agents'\nappearances and dynamics. We design point navigation and social navigation\ntasks as the pilot study using MetaUrban for embodied AI research and establish\nvarious baselines of Reinforcement Learning and Imitation Learning. Experiments\ndemonstrate that the compositional nature of the simulated environments can\nsubstantially improve the generalizability and safety of the trained mobile\nagents. MetaUrban will be made publicly available to provide more research\nopportunities and foster safe and trustworthy embodied AI in urban spaces.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4jsaXhMb5kqH8rptSjpMmyZUN2enWX73TRl8mpuHhfA","pdfSize":"47526528"}
