{"id":"2407.16870","title":"CoCA: Cooperative Component Analysis","authors":"Daisy Yi Ding, Alden Green, Min Woo Sun, Robert Tibshirani","authorsParsed":[["Ding","Daisy Yi",""],["Green","Alden",""],["Sun","Min Woo",""],["Tibshirani","Robert",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 22:33:05 GMT"}],"updateDate":"2024-07-25","timestamp":1721773985000,"abstract":"  We propose Cooperative Component Analysis (CoCA), a new method for\nunsupervised multi-view analysis: it identifies the component that\nsimultaneously captures significant within-view variance and exhibits strong\ncross-view correlation. The challenge of integrating multi-view data is\nparticularly important in biology and medicine, where various types of \"-omic\"\ndata, ranging from genomics to proteomics, are measured on the same set of\nsamples. The goal is to uncover important, shared signals that represent\nunderlying biological mechanisms. CoCA combines an approximation error loss to\npreserve information within data views and an \"agreement penalty\" to encourage\nalignment across data views. By balancing the trade-off between these two key\ncomponents in the objective, CoCA has the property of interpolating between the\ncommonly-used principal component analysis (PCA) and canonical correlation\nanalysis (CCA) as special cases at the two ends of the solution path. CoCA\nchooses the degree of agreement in a data-adaptive manner, using a validation\nset or cross-validation to estimate test error. Furthermore, we propose a\nsparse variant of CoCA that incorporates the Lasso penalty to yield feature\nsparsity, facilitating the identification of key features driving the observed\npatterns. We demonstrate the effectiveness of CoCA on simulated data and two\nreal multiomics studies of COVID-19 and ductal carcinoma in situ of breast. In\nboth real data applications, CoCA successfully integrates multiomics data,\nextracting components that are not only consistently present across different\ndata views but also more informative and predictive of disease progression.\nCoCA offers a powerful framework for discovering important shared signals in\nmulti-view data, with the potential to uncover novel insights in an\nincreasingly multi-view data world.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}