{"id":"2407.19167","title":"Machine-assisted classification of potential biosignatures in earth-like\n  exoplanets using low signal-to-noise ratio transmission spectra","authors":"David S. Duque-Casta\\~no, Jorge I. Zuluaga, Lauren Flor-Torres","authorsParsed":[["Duque-Castaño","David S.",""],["Zuluaga","Jorge I.",""],["Flor-Torres","Lauren",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 04:44:37 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 19:26:07 GMT"}],"updateDate":"2024-08-01","timestamp":1722055477000,"abstract":"  The search for atmospheric biosignatures in Earth-like exoplanets is one of\nthe most pressing challenges in observational astrobiology. Detecting biogenic\ngases in terrestrial planets requires high resolution and long integration\ntimes. In this work, we developed and tested a machine-learning general\nmethodology, intended to classify transmission spectra with low Signal-to-Noise\nRatio according to their potential to contain biosignatures. For that purpose,\nwe trained a set of models capable of classifying noisy transmission spectra,\nas having methane, ozone, and/or water (multilabel classification), or simply\nas being interesting for follow-up observations (binary classification). The\nmodels were trained with $\\sim\\, 10^6$ synthetic spectra of planets similar to\nTRAPPIST-1 e, which were generated with the package MultiREx, especially\ndeveloped for this work. The trained algorithms correctly classified test\nplanets with transmission spectra having SNR $<$ 6 and containing methane\nand/or ozone at mixing ratios similar to those of modern and Proterozoic Earth.\nTests on realistic synthetic spectra based on the current Earth\\'s atmosphere\nshow at least one of our models would classify as likely having biosignatures\nand using only one transit, most of the inhabited terrestrial planets observed\nwith the JWST/NIRSpec PRISM around M-dwarfs located at distances similar or\nsmaller than that of TRAPPIST-1 e. The implication of this result for the\ndesigning of observing programs and future surveys is enormous since\nmachine-assisted strategies similar to those presented here could significantly\noptimize the usage of JWST resources for biosignature searching, while\nmaximizing the chances of a real discovery after dedicated follow-up\nobservations of promising candidates.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}