{"id":"2407.11541","title":"Uniformly Accelerated Motion Model for Inter Prediction","authors":"Zhuoyuan Li, Yao Li, Chuanbo Tang, Li Li, Dong Liu, Feng Wu","authorsParsed":[["Li","Zhuoyuan",""],["Li","Yao",""],["Tang","Chuanbo",""],["Li","Li",""],["Liu","Dong",""],["Wu","Feng",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 09:46:29 GMT"},{"version":"v2","created":"Sun, 21 Jul 2024 12:58:00 GMT"}],"updateDate":"2024-07-23","timestamp":1721123189000,"abstract":"  Inter prediction is a key technology to reduce the temporal redundancy in\nvideo coding. In natural videos, there are usually multiple moving objects with\nvariable velocity, resulting in complex motion fields that are difficult to\nrepresent compactly. In Versatile Video Coding (VVC), existing inter prediction\nmethods usually assume uniform speed motion between consecutive frames and use\nthe linear models for motion estimation (ME) and motion compensation (MC),\nwhich may not well handle the complex motion fields in the real world. To\naddress these issues, we introduce a uniformly accelerated motion model (UAMM)\nto exploit motion-related elements (velocity, acceleration) of moving objects\nbetween the video frames, and further combine them to assist the inter\nprediction methods to handle the variable motion in the temporal domain.\nSpecifically, first, the theory of UAMM is mentioned. Second, based on that, we\npropose the UAMM-based parameter derivation and extrapolation schemes in the\ncoding process. Third, we integrate the UAMM into existing inter prediction\nmodes (Merge, MMVD, CIIP) to achieve higher prediction accuracy. The proposed\nmethod is implemented into the VVC reference software, VTM version 12.0.\nExperimental results show that the proposed method achieves up to 0.38% and on\naverage 0.13% BD-rate reduction compared to the VTM anchor, under the Low-delay\nP configuration, with a slight increase of time complexity on the\nencoding/decoding side.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}