{"id":"2407.16720","title":"Mathematical Justification of a Compressible Two-Phase Averaged System\n  with Temperature but Without Heat Conductivity","authors":"D Bresch (LAMA), C Burtea (UFR Math\\'ematiques UPCit\\'e), P\n  Gonin--Joubert (MMCS), F Lagouti\\`ere (MMCS)","authorsParsed":[["Bresch","D","","LAMA"],["Burtea","C","","UFR Mathématiques UPCité"],["Gonin--Joubert","P","","MMCS"],["Lagoutière","F","","MMCS"]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 08:22:12 GMT"}],"updateDate":"2024-07-25","timestamp":1721722932000,"abstract":"  This article concerns the mathematical justification of an averaged system of\npartial differential equations governing the evolution of a two-phase mixture\nof heat non-conductive, compressible fluids, in space dimension 1 with periodic\nboundary conditions. The first step is to write a system of partial\ndifferential equations governing the physics at a mesoscopical level where the\ntwo phases are separated by sharp interfaces. In a second step we study the\nbehavior of a sequence of solutions corresponding to highly oscillating initial\ndensities and temperatures. The limit of such a sequence is described byan\naveraged system of partial differential equations that has a different\nalgebraic structure than the mesoscopic model and that reflects the\nmacroscopical properties of the mixture. The originality of the paper consists\nin the fact that both the density and temperature are allowed to oscillate, so\nthat the limiting model is a six-equation, two-pressures, two-temperatures\nmodel. The key point is to show the strong convergence of the stress tensor in\n$L^2((0, T) \\times (0, 1))$. In order to obtain uniform estimates in spite of\nthe presence of oscillating coefficients in the energy equation, we look at\nsolutions with low regularity for the density and the temperature.For the\nreaders convenience, we provide in a separated section the modelization of the\nmesoscopic system and the formal derivation of the averaged two-phase system.\nWe also provide, at the end of the paper, numerical illustrations comparing the\nunknowns solving the mesoscopic system and the one satisfying the averaged\ntwo-phase system.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}