{"id":"2407.08327","title":"Investigating tidal heating in neutron stars via gravitational Raman\n  scattering","authors":"M. V. S. Saketh, Zihan Zhou, Suprovo Ghosh, Jan Steinhoff, Debarati\n  Chatterjee","authorsParsed":[["Saketh","M. V. S.",""],["Zhou","Zihan",""],["Ghosh","Suprovo",""],["Steinhoff","Jan",""],["Chatterjee","Debarati",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 09:26:04 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 17:42:14 GMT"}],"updateDate":"2024-07-29","timestamp":1720689964000,"abstract":"  We present a scattering amplitude formalism to study the tidal heating\neffects of nonspinning neutron stars incorporating both worldline effective\nfield theory and relativistic stellar perturbation theory. In neutron stars,\ntidal heating arises from fluid viscosity due to various scattering processes\nin the interior. It also serves as a channel for the exchange of energy and\nangular momentum between the neutron star and its environment. In the interior\nof the neutron star, we first derive two master perturbation equations that\ncapture fluid perturbations accurate to linear order in frequency. Remarkably,\nthese equations receive no contribution from bulk viscosity due to a peculiar\nadiabatic incompressibility which arises in stellar fluid for non-barotropic\nperturbations. In the exterior, the metric perturbations reduce to the\nRegge-Wheeler (RW) equation which we solve using the analytical\nMano-Suzuki-Takasugi (MST) method. We compute the amplitude for gravitational\nwaves scattering off a neutron star, also known as gravitational Raman\nscattering. From the amplitude, we obtain expressions for the electric\nquadrupolar static Love number and the leading dissipation number to all orders\nin compactness. We then compute the leading dissipation number for various\nrealistic equation-of-state(s) and estimate the change in the number of\ngravitational wave cycles due to tidal heating during inspiral in the\nLIGO-Virgo-KAGRA (LVK) band.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MDG9onQxEz30UeTCSeU0JEhqbkzcBIOlmT8rVV4_HJM","pdfSize":"560865","objectId":"0x93744d1aa655a08f04606df26bd585c8748f7541b49e9a8ef3b59406ef8ef6d2","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
