{"id":"2407.07863","title":"Intensity-sensitive quality assessment of extended sources in\n  astronomical images","authors":"X. Li, K. Adamek, W. Armour","authorsParsed":[["Li","X.",""],["Adamek","K.",""],["Armour","W.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 17:26:09 GMT"}],"updateDate":"2024-07-11","timestamp":1720632369000,"abstract":"  Radio astronomy studies the Universe by observing the radio emissions of\ncelestial bodies. Different methods can be used to recover the sky brightness\ndistribution (SBD), which describes the distribution of celestial sources from\nrecorded data, with the output dependent on the method used. Image quality\nassessment (IQA) indexes can be used to compare the differences between\nrestored SBDs produced by different image reconstruction techniques to evaluate\nthe effectiveness of different techniques. However, reconstructed images (for\nthe same SBD) can appear to be very similar, especially when observed by the\nhuman visual system (HVS). Hence current structural similarity methods,\ninspired by the HVS, are not effective. In the past, we have proposed two\nmethods to assess point source images, where low amounts of concentrated\ninformation are present in larger regions of noise-like data. But for images\nthat include extended source(s), the increase in complexity of the structure\nmakes the IQA methods for point sources over-sensitive since the important\nobjects cannot be described by isolated point sources. Therefore, in this\narticle we propose augmented Low-Information Similarity Index (augLISI), an\nimproved version of LISI, to assess images including extended source(s).\nExperiments have been carried out to illustrate how this new IQA method can\nhelp with the development and study of astronomical imaging techniques. Note\nthat although we focus on radio astronomical images herein, these IQA methods\nare also applicable to other astronomical images, and imaging techniques.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}