{"id":"2407.18796","title":"Jet radius dependence of dijet momentum balance and suppression in Pb+Pb\n  collisions at 5.02 TeV with the ATLAS detector","authors":"ATLAS Collaboration","authorsParsed":[["ATLAS Collaboration","",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 14:59:45 GMT"}],"updateDate":"2024-07-29","timestamp":1722005985000,"abstract":"  This paper describes a measurement of the jet radius dependence of the dijet\nmomentum balance between leading back-to-back jets in 1.72 $nb^{-1}$ of Pb+Pb\ncollisions collected in 2018 and 255 pb$^{-1}$ of $pp$ collisions collected in\n2017 by the ATLAS detector at the LHC. Both data sets were collected at $\n\\sqrt{s_{\\rm NN}}=$ 5.02 TeV. Jets are reconstructed using the anti-$k_t$\nalgorithm with jet radius parameters $R=$ 0.2, 0.3, 0.4, 0.5 and 0.6. The dijet\nmomentum balance distributions are constructed for leading jets with transverse\nmomentum $p_{\\rm T}$ from 100 to 562 GeV for $R=$ 0.2, 0.3 and 0.4 jets, and\nfrom 158 to 562 GeV for $R=$ 0.5 and 0.6 jets. The absolutely normalized dijet\nmomentum balance distributions are constructed to compare measurements of the\ndijet yields in Pb+Pb collisions directly to the dijet cross sections in $pp$\ncollisions. For all jet radii considered here, there is a suppression of more\nbalanced dijets in Pb+Pb collisions compared to $pp$ collisions, while for more\nimbalanced dijets there is an enhancement. There is a jet radius dependence to\nthe dijet yields, being stronger for more imbalanced dijets than for more\nbalanced dijets. Additionally, jet pair nuclear modification factors are\nmeasured. The subleading jet yields are found to be more suppressed than\nleading jet yields in dijets. A jet radius dependence of the pair nuclear\nmodification factors is observed, with the suppression decreasing with\nincreasing jet radius. These measurements provide new constraints on jet\nquenching scenarios in the quark-gluon plasma.\n","subjects":["Physics/Nuclear Experiment","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/"}