{"id":"2407.17511","title":"Thermal Radiation (TR) mode: A Deployment Perspective for 5G NR","authors":"Haneet Kour, Rakesh Kumar Jha, Sanjeev Jain, Shubha Jain","authorsParsed":[["Kour","Haneet",""],["Jha","Rakesh Kumar",""],["Jain","Sanjeev",""],["Jain","Shubha",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 11:32:34 GMT"}],"updateDate":"2024-07-26","timestamp":1720438354000,"abstract":"  The 5G New Radio NR technology is under standardization process by 3GPP to\nprovide outline for a new radio interface for the next generation of cellular\nnetworks. The aim of the 5G networks include not only to provide enhanced\ncapacity coverage but also support advanced services such as enhanced mobile\nbroadband (eMBB) Ultra-Reliable Low Latency Communication URLLC massive Machine\nType Communication mMTC. Key features of NR include Ultra lean carrier design\nto minimize the power consumption by limiting the always-on signal\ntransmissions and to reduce interference in the neighboring cells . Another\nfeature is the use of massive number of antennas for transmission as well as\nreception of signals. This rise in the number of antennas to provide a greater\ncoverage brings about various challenges and impact in the system. With the\nincrease in investigations in the mmWave frequencies, there is a need to\ninvestigate the health hazards they have on human body and the environment at\nlarge. This paper intends to provide an insight into the harmful impacts of\nRadio Frequency RF fields. The radiation metric to study the RF impact for far\nfield is power density and for near field is Specific Absorption Rate SAR.\nThese are the two main EM radiation metrics to find out the exposure due to\nuplink and downlink phenomenon in mobile communications. Mobile communication\nsystems are addressed particularly to discuss the Electromagnetic EM Radiation\nimpact as smart phones are used in close proximity to the body. A proposal in\nthe form of Thermal Radiation TR mode is given to reduce the radiations emitted\nfrom a mobile phone. The performance of the proposed mode is validated from the\nresults by achieving reduced power density, complexity and exposure ratio.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dqqr2a6FZZycoOpkgoU1q-ZuU7Lw_fCU8-RtAqJudJU","pdfSize":"1486382"}
