{"id":"2407.17442","title":"AHMF: Adaptive Hybrid-Memory-Fusion Model for Driver Attention\n  Prediction","authors":"Dongyang Xu, Qingfan Wang, Ji Ma, Xiangyun Zeng and Lei Chen","authorsParsed":[["Xu","Dongyang",""],["Wang","Qingfan",""],["Ma","Ji",""],["Zeng","Xiangyun",""],["Chen","Lei",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 17:19:58 GMT"}],"updateDate":"2024-07-25","timestamp":1721841598000,"abstract":"  Accurate driver attention prediction can serve as a critical reference for\nintelligent vehicles in understanding traffic scenes and making informed\ndriving decisions. Though existing studies on driver attention prediction\nimproved performance by incorporating advanced saliency detection techniques,\nthey overlooked the opportunity to achieve human-inspired prediction by\nanalyzing driving tasks from a cognitive science perspective. During driving,\ndrivers' working memory and long-term memory play crucial roles in scene\ncomprehension and experience retrieval, respectively. Together, they form\nsituational awareness, facilitating drivers to quickly understand the current\ntraffic situation and make optimal decisions based on past driving experiences.\nTo explicitly integrate these two types of memory, this paper proposes an\nAdaptive Hybrid-Memory-Fusion (AHMF) driver attention prediction model to\nachieve more human-like predictions. Specifically, the model first encodes\ninformation about specific hazardous stimuli in the current scene to form\nworking memories. Then, it adaptively retrieves similar situational experiences\nfrom the long-term memory for final prediction. Utilizing domain adaptation\ntechniques, the model performs parallel training across multiple datasets,\nthereby enriching the accumulated driving experience within the long-term\nmemory module. Compared to existing models, our model demonstrates significant\nimprovements across various metrics on multiple public datasets, proving the\neffectiveness of integrating hybrid memories in driver attention prediction.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"WEDWe8XYT2AQG4qUtUkHivDzTmlv8Ir4NItJkH0-zok","pdfSize":"2004540"}
