{"id":"2407.03978","title":"Benchmarking Complex Instruction-Following with Multiple Constraints\n  Composition","authors":"Bosi Wen, Pei Ke, Xiaotao Gu, Lindong Wu, Hao Huang, Jinfeng Zhou,\n  Wenchuang Li, Binxin Hu, Wendy Gao, Jiaxin Xu, Yiming Liu, Jie Tang, Hongning\n  Wang, Minlie Huang","authorsParsed":[["Wen","Bosi",""],["Ke","Pei",""],["Gu","Xiaotao",""],["Wu","Lindong",""],["Huang","Hao",""],["Zhou","Jinfeng",""],["Li","Wenchuang",""],["Hu","Binxin",""],["Gao","Wendy",""],["Xu","Jiaxin",""],["Liu","Yiming",""],["Tang","Jie",""],["Wang","Hongning",""],["Huang","Minlie",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 14:50:45 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 06:44:47 GMT"}],"updateDate":"2024-07-12","timestamp":1720104645000,"abstract":"  Instruction following is one of the fundamental capabilities of large\nlanguage models (LLMs). As the ability of LLMs is constantly improving, they\nhave been increasingly applied to deal with complex human instructions in\nreal-world scenarios. Therefore, how to evaluate the ability of complex\ninstruction-following of LLMs has become a critical research problem. Existing\nbenchmarks mainly focus on modeling different types of constraints in human\ninstructions while neglecting the composition of different constraints, which\nis an indispensable constituent in complex instructions. To this end, we\npropose ComplexBench, a benchmark for comprehensively evaluating the ability of\nLLMs to follow complex instructions composed of multiple constraints. We\npropose a hierarchical taxonomy for complex instructions, including 4\nconstraint types, 19 constraint dimensions, and 4 composition types, and\nmanually collect a high-quality dataset accordingly. To make the evaluation\nreliable, we augment LLM-based evaluators with rules to effectively verify\nwhether generated texts can satisfy each constraint and composition.\nFurthermore, we obtain the final evaluation score based on the dependency\nstructure determined by different composition types. ComplexBench identifies\nsignificant deficiencies in existing LLMs when dealing with complex\ninstructions with multiple constraints composition.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}