{"id":"2407.07137","title":"Loss of Axial Symmetry in Hypersonic Flows over Conical Shapes","authors":"Irmak T. Karpuzcu and Deborah A. Levin","authorsParsed":[["Karpuzcu","Irmak T.",""],["Levin","Deborah A.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 16:55:55 GMT"}],"updateDate":"2024-07-11","timestamp":1720544155000,"abstract":"  The assumption of axial symmetry for hypersonic flows over conically shaped\ngeometries is ubiquitous in both experiments and numerical simulations. Yet\ndepending on the free stream conditions, many of these flows are unsteady and\ntheir transition from laminar to turbulent is a three-dimensional phenomena.\nCombining triple deck theory/linear stability analysis with the kinetic direct\nsimulation Monte Carlo method we analyze the azimuthal eigenmodes of flows over\nsingle and double-cone configurations. For Mach 16 flows we find that the\nstrongest amplification rate occurs for the non-axisymmetric azimuthal\nwavenumber of n = 1. This occurs in regions quite close to the tip of the cone\ndue to the proximity of the conical shock to the viscous shear layer where\nnon-axisymmetric modes are amplified through linear mechanisms. Comparison of\ntriple deck linear stability predictions shows that in addition to the\nazimuthal wavenumber, both the temporal content and amplification rate of these\nnon-axisymmetric disturbances agree well with the time accurate DSMC flowfield.\nIn addition to the loss of axial symmetry observed at the conical shock, the\neffect of axial symmetry assumptions on the more complex shock-shock and\nshock-boundary layer interactions of a flow over a double cone are considered.\nThe results for the separation region show that axisymmetric and three\ndimensional simulations differ in almost all of the main flow structures. Three\ndimensional flowfields result in a smaller separation bubble with weaker shocks\nand three dimensional effects were manifest in the variation in surface\nparameters in the azimuthal direction as well. Interestingly, the DSMC\nsimulations show that the loss of axial symmetry in the separation region,\nbegins near the cone tip.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}