{"id":"2407.11100","title":"Building Intelligence Identification System via Large Language Model\n  Watermarking: A Survey and Beyond","authors":"Xuhong Wang, Haoyu Jiang, Yi Yu, Jingru Yu, Yilun Lin, Ping Yi,\n  Yingchun Wang, Yu Qiao, Li Li, Fei-Yue Wang","authorsParsed":[["Wang","Xuhong",""],["Jiang","Haoyu",""],["Yu","Yi",""],["Yu","Jingru",""],["Lin","Yilun",""],["Yi","Ping",""],["Wang","Yingchun",""],["Qiao","Yu",""],["Li","Li",""],["Wang","Fei-Yue",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 07:20:02 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 03:08:14 GMT"},{"version":"v3","created":"Wed, 24 Jul 2024 08:10:29 GMT"}],"updateDate":"2024-07-25","timestamp":1721028002000,"abstract":"  Large Language Models (LLMs) are increasingly integrated into diverse\nindustries, posing substantial security risks due to unauthorized replication\nand misuse. To mitigate these concerns, robust identification mechanisms are\nwidely acknowledged as an effective strategy. Identification systems for LLMs\nnow rely heavily on watermarking technology to manage and protect intellectual\nproperty and ensure data security. However, previous studies have primarily\nconcentrated on the basic principles of algorithms and lacked a comprehensive\nanalysis of watermarking theory and practice from the perspective of\nintelligent identification. To bridge this gap, firstly, we explore how a\nrobust identity recognition system can be effectively implemented and managed\nwithin LLMs by various participants using watermarking technology. Secondly, we\npropose a mathematical framework based on mutual information theory, which\nsystematizes the identification process to achieve more precise and customized\nwatermarking. Additionally, we present a comprehensive evaluation of\nperformance metrics for LLM watermarking, reflecting participant preferences\nand advancing discussions on its identification applications. Lastly, we\noutline the existing challenges in current watermarking technologies and\ntheoretical frameworks, and provide directional guidance to address these\nchallenges. Our systematic classification and detailed exposition aim to\nenhance the comparison and evaluation of various methods, fostering further\nresearch and development toward a transparent, secure, and equitable LLM\necosystem.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}