{"id":"2407.14719","title":"Universal Medical Imaging Model for Domain Generalization with Data\n  Privacy","authors":"Ahmed Radwan, Islam Osman, Mohamed S. Shehata","authorsParsed":[["Radwan","Ahmed",""],["Osman","Islam",""],["Shehata","Mohamed S.",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 01:24:15 GMT"}],"updateDate":"2024-07-23","timestamp":1721438655000,"abstract":"  Achieving domain generalization in medical imaging poses a significant\nchallenge, primarily due to the limited availability of publicly labeled\ndatasets in this domain. This limitation arises from concerns related to data\nprivacy and the necessity for medical expertise to accurately label the data.\nIn this paper, we propose a federated learning approach to transfer knowledge\nfrom multiple local models to a global model, eliminating the need for direct\naccess to the local datasets used to train each model. The primary objective is\nto train a global model capable of performing a wide variety of medical imaging\ntasks. This is done while ensuring the confidentiality of the private datasets\nutilized during the training of these models. To validate the effectiveness of\nour approach, extensive experiments were conducted on eight datasets, each\ncorresponding to a different medical imaging application. The client's data\ndistribution in our experiments varies significantly as they originate from\ndiverse domains. Despite this variation, we demonstrate a statistically\nsignificant improvement over a state-of-the-art baseline utilizing masked image\nmodeling over a diverse pre-training dataset that spans different body parts\nand scanning types. This improvement is achieved by curating information\nlearned from clients without accessing any labeled dataset on the server.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}