{"id":"2407.15042","title":"MedSAGa: Few-shot Memory Efficient Medical Image Segmentation using\n  Gradient Low-Rank Projection in SAM","authors":"Navyansh Mahla, Annie D'souza, Shubh Gupta, Bhavik Kanekar, Kshitij\n  Sharad Jadhav","authorsParsed":[["Mahla","Navyansh",""],["D'souza","Annie",""],["Gupta","Shubh",""],["Kanekar","Bhavik",""],["Jadhav","Kshitij Sharad",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 03:34:49 GMT"}],"updateDate":"2024-07-23","timestamp":1721532889000,"abstract":"  The application of large-scale models in medical image segmentation demands\nsubstantial quantities of meticulously annotated data curated by experts along\nwith high computational resources, both of which are challenges in\nresource-poor settings. In this study, we present the Medical Segment Anything\nModel with Galore MedSAGa where we adopt the Segment Anything Model (SAM) to\nachieve memory-efficient, few-shot medical image segmentation by applying\nGradient Low-Rank Projection GaLore to the parameters of the image encoder of\nSAM. Meanwhile, the weights of the prompt encoder and mask decoder undergo full\nparameter fine-tuning using standard optimizers. We further assess MedSAGa's\nfew-shot learning capabilities, reporting on its memory efficiency and\nsegmentation performance across multiple standard medical image segmentation\ndatasets. We compare it with several baseline models, including LoRA fine-tuned\nSAM (SAMed) and DAE-Former. Experiments across multiple datasets and these\nbaseline models with different number of images for fine tuning demonstrated\nthat the GPU memory consumption of MedSAGa is significantly less than that of\nthe baseline models, achieving an average memory efficiency of 66% more than\ncurrent state-of-the-art (SOTA) models for medical image segmentation. The\ncombination of substantially lower memory requirements and comparable to SOTA\nresults in few-shot learning for medical image segmentation positions MedSAGa\nas an optimal solution for deployment in resource-constrained settings.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}