{"id":"2407.04769","title":"Neutrino quantum kinetics in two spatial dimensions","authors":"Marie Cornelius, Shashank Shalgar, Irene Tamborra","authorsParsed":[["Cornelius","Marie",""],["Shalgar","Shashank",""],["Tamborra","Irene",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-09","timestamp":1720202401000,"abstract":"  Our understanding of neutrino flavor conversion in the innermost regions of\ncore-collapse supernovae and neutron star mergers is mostly limited to\nspherically symmetric configurations that facilitate the numerical solution of\nthe quantum kinetic equations. In this paper, we simulate neutrino quantum\nkinetics within a (2+1+1) dimensional setup: we model the flavor evolution\nduring neutrino decoupling from matter in two spatial dimensions, one neutrino\nmomentum variable, and time; taking into account non-forward neutral current\nand charged current collisions of neutrinos with the matter background, as well\nas neutrino advection. In order to mimic fluctuations in the neutrino emission\nand matter background, and explore their effect on the flavor evolution, we\nintroduce perturbations in the collision term as well as in the vacuum term of\nthe Hamiltonian. Because of such perturbations, the initial symmetry of the\nneutrino field across the simulation annulus is broken and flavor conversion is\nqualitatively affected, with regions of larger flavor conversion alternating\nacross the simulation annulus. In addition, neutrino advection is responsible\nfor spreading flavor waves across neighboring spatial regions. Although based\non a simplified setup, our findings highlight the importance of modeling\nneutrino quantum kinetics in multi-dimensions to assess the impact of neutrinos\non the physics of compact astrophysical sources and nucleosynthesis.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/"}