{"id":"2407.02139","title":"Kinetics of Rayleigh-Taylor instability in van der Waals fluid: the\n  influence of compressibility","authors":"Jie Chen, Aiguo Xu, Yudong Zhang, Dawei Chen, Zhihua Chen","authorsParsed":[["Chen","Jie",""],["Xu","Aiguo",""],["Zhang","Yudong",""],["Chen","Dawei",""],["Chen","Zhihua",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 10:34:19 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 08:58:46 GMT"}],"updateDate":"2024-07-04","timestamp":1719916459000,"abstract":"  Early studies on Rayleigh-Taylor instability (RTI) primarily relied on the\nNavier-Stokes (NS) model. As research progresses, it becomes increasingly\nevident that the kinetic information that the NS model failed to capture is of\ngreat value for identifying and even controlling the RTI process;\nsimultaneously, the lack of analysis techniques for complex physical fields\nresults in a significant waste of data information. In addition, early RTI\nstudies mainly focused on the incompressible case and the weakly compressible\ncase. In the case of strong compressibility, the density of the fluid from the\nupper layer (originally heavy fluid) may become smaller than that of the\nsurrounding (originally light) fluid, thus invalidating the early method of\ndistinguishing light and heavy fluids based on density. In this paper, tracer\nparticles are incorporated into a single-fluid discrete Boltzmann method (DBM)\nmodel that considers the van der Waals potential. By using tracer particles to\nlabel the matter-particle sources, a careful study of the matter-mixing and\nenergy-mixing processes of the RTI evolution is realized in the single-fluid\nframework. The effects of compressibility on the evolution of RTI are examined\nmainly through the analysis of bubble and spike velocities, the ratio of area\noccupied by heavy fluid, and various entropy generation rates of the system. It\nis demonstrated that: (1) compressibility has a suppressive effect on the spike\nvelocity, and this suppressive impact diminishes as the Atwood number ($At$)\nincreases. The influence of compressibility on bubble velocity shows a staged\nbehavior with increasing $At$. (2) The impact of compressibility on the entropy\nproduction rate associated with the heat flow (${{\\dot{S}}_{NOEF}}$) is related\nto the stages of RTI evolution.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}