{"id":"2407.01606","title":"On Discrete Prompt Optimization for Diffusion Models","authors":"Ruochen Wang and Ting Liu and Cho-Jui Hsieh and Boqing Gong","authorsParsed":[["Wang","Ruochen",""],["Liu","Ting",""],["Hsieh","Cho-Jui",""],["Gong","Boqing",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 02:53:01 GMT"}],"updateDate":"2024-07-03","timestamp":1719456781000,"abstract":"  This paper introduces the first gradient-based framework for prompt\noptimization in text-to-image diffusion models. We formulate prompt engineering\nas a discrete optimization problem over the language space. Two major\nchallenges arise in efficiently finding a solution to this problem: (1)\nEnormous Domain Space: Setting the domain to the entire language space poses\nsignificant difficulty to the optimization process. (2) Text Gradient:\nEfficiently computing the text gradient is challenging, as it requires\nbackpropagating through the inference steps of the diffusion model and a\nnon-differentiable embedding lookup table. Beyond the problem formulation, our\nmain technical contributions lie in solving the above challenges. First, we\ndesign a family of dynamically generated compact subspaces comprised of only\nthe most relevant words to user input, substantially restricting the domain\nspace. Second, we introduce \"Shortcut Text Gradient\" -- an effective\nreplacement for the text gradient that can be obtained with constant memory and\nruntime. Empirical evaluation on prompts collected from diverse sources\n(DiffusionDB, ChatGPT, COCO) suggests that our method can discover prompts that\nsubstantially improve (prompt enhancement) or destroy (adversarial attack) the\nfaithfulness of images generated by the text-to-image diffusion model.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fLo3nmew1uuiA9q_gTG5XGQbzaGGSCcuZqJZJXPJX2c","pdfSize":"28236723"}
