{"id":"2407.14555","title":"Particle image velocimetry and modelling of horizontal coherent liquid\n  jets impinging on and draining down a vertical wall","authors":"W. Aouad, Julien R. Landel (DAMTP), S.B. Dalziel (DAMTP), J.F.\n  Davidson, D.I. Wilson","authorsParsed":[["Aouad","W.","","DAMTP"],["Landel","Julien R.","","DAMTP"],["Dalziel","S. B.","","DAMTP"],["Davidson","J. F.",""],["Wilson","D. I.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:04:21 GMT"}],"updateDate":"2024-07-23","timestamp":1721289861000,"abstract":"  The flow patterns created by a coherent horizontal liquid jet impinging on a\nvertical wall atmoderate flow rates (jet flowrates 0.5-4.0 L min-1, jet\nvelocities 2.6-21 m s-1) are studied withwater on glass, polypropylene and\npolymethylmethacrylate (acrylic, Perspex(R)) using a novelparticle image\nvelicometry (PIV) technique employing nearly opaque fluid doped withartificial\npearlescence to track surface velocity. Flow patterns similar to those reported\ninprevious studies are observed on each substrate: their dimensions differed\nowing to theinfluence of wall material on contact angle. The dimensions are\ncompared with models for (i)the radial flow zone, reported by Wang et al.\n(2013b), and the part of the draining film belowthe jet impingement point where\nit narrows to a node. For (ii), the model presented by Mertenset al. (2005) is\nrevised to include a simpler assumed draining film shape and an\nalternativeboundary condition accounting for surface tension effects acting at\nthe film edge. This refinedmodel gives equally good or better fits to the\nexperimental data. The effective contact anglewhich gives good agreement with\nthe data is found to lie between the measured quasi-staticadvancing and\nreceding contact angles, at approximately half the advancing value. The\nPIVmeasurements confirmed the existence of a thin fast moving film with radial\nflow surroundingthe point of impingement, and a wide draining film bounded by\nropes of liquid below theimpingement point. While these measurements generally\nsupport the predictions of existingmodels, these models assume that the flow is\nsteady. In contrast, surface waves were evident inboth regions and this partly\nexplains the difference between the measured surface velocity andthe values\nestimated from the models.\n","subjects":["Physics/Fluid Dynamics","Physics/Classical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}