{"id":"2407.00171","title":"The PARADIGM project I: How early merger histories shape the present-day\n  sizes of Milky-Way-mass galaxies","authors":"Gandhali D. Joshi, Andrew Pontzen, Oscar Agertz, Martin P. Rey, Justin\n  Read and Annalisa Pillepich","authorsParsed":[["Joshi","Gandhali D.",""],["Pontzen","Andrew",""],["Agertz","Oscar",""],["Rey","Martin P.",""],["Read","Justin",""],["Pillepich","Annalisa",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 18:16:23 GMT"}],"updateDate":"2024-07-02","timestamp":1719598583000,"abstract":"  The way in which mergers affect galaxy formation depends on both feedback\nprocesses, and on the geometry and strength of the mergers themselves. We\nintroduce the PARADIGM project, where we study the response of a simulated\nMilky-Way-mass galaxy forming in a cosmological setting to differing merger\nhistories, using genetically modified initial conditions. Each initial\ncondition is simulated with the VINTERGATAN and IllustrisTNG codes. While\nVINTERGATAN has been developed with an emphasis on resolving the cold\ninterstellar medium, IllustrisTNG uses a subgrid two-phase model and\nconsequently scales to large volume simulations, making them ideal to examine\ncomplementary views on how merger histories and feedback interact. Our genetic\nmodifications alter the mass ratio of an important $z \\approx 2$ merger while\nmaintaining the halo's $z=0$ mass. Whether simulated with VINTERGATAN or\nIllustrisTNG, smaller mass ratios for this early merger result in larger\ngalaxies at $z=0$, due to a greater build up of a kinematically cold disc. We\nconclude that such broad trends are robustly reproducible; however, the\nnormalization of the resulting stellar sizes is substantially different in the\ntwo codes (ranging between $0.5-1.7\\ \\rm{kpc}$ for VINTERGATAN but $1.3-7.0\\\n\\rm{kpc}$ for IllustrisTNG). The VINTERGATAN galaxies systematically form stars\nearlier, leading to a larger bulge component. Despite the difference in size\nnormalization, both simulation suites lie on the observed size-mass relation\nfor their respective morphological types. In light of these results, we discuss\nthe interplay between internal processes and large scale gravitational\ninteractions and gas accretion, and how the two galaxy models converge on\nsimilar emergent trends but along different evolutionary pathways.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}