{"id":"2407.03900","title":"Oracle Bone Inscriptions Multi-modal Dataset","authors":"Bang Li, Donghao Luo, Yujie Liang, Jing Yang, Zengmao Ding, Xu Peng,\n  Boyuan Jiang, Shengwei Han, Dan Sui, Peichao Qin, Pian Wu, Chaoyang Wang, Yun\n  Qi, Taisong Jin, Chengjie Wang, Xiaoming Huang, Zhan Shu, Rongrong Ji, Yongge\n  Liu, Yunsheng Wu","authorsParsed":[["Li","Bang",""],["Luo","Donghao",""],["Liang","Yujie",""],["Yang","Jing",""],["Ding","Zengmao",""],["Peng","Xu",""],["Jiang","Boyuan",""],["Han","Shengwei",""],["Sui","Dan",""],["Qin","Peichao",""],["Wu","Pian",""],["Wang","Chaoyang",""],["Qi","Yun",""],["Jin","Taisong",""],["Wang","Chengjie",""],["Huang","Xiaoming",""],["Shu","Zhan",""],["Ji","Rongrong",""],["Liu","Yongge",""],["Wu","Yunsheng",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 12:47:32 GMT"}],"updateDate":"2024-07-08","timestamp":1720097252000,"abstract":"  Oracle bone inscriptions(OBI) is the earliest developed writing system in\nChina, bearing invaluable written exemplifications of early Shang history and\npaleography. However, the task of deciphering OBI, in the current climate of\nthe scholarship, can prove extremely challenging. Out of the 4,500 oracle bone\ncharacters excavated, only a third have been successfully identified.\nTherefore, leveraging the advantages of advanced AI technology to assist in the\ndecipherment of OBI is a highly essential research topic. However, fully\nutilizing AI's capabilities in these matters is reliant on having a\ncomprehensive and high-quality annotated OBI dataset at hand whereas most\nexisting datasets are only annotated in just a single or a few dimensions,\nlimiting the value of their potential application. For instance, the\nOracle-MNIST dataset only offers 30k images classified into 10 categories.\nTherefore, this paper proposes an Oracle Bone Inscriptions Multi-modal\nDataset(OBIMD), which includes annotation information for 10,077 pieces of\noracle bones. Each piece has two modalities: pixel-level aligned rubbings and\nfacsimiles. The dataset annotates the detection boxes, character categories,\ntranscriptions, corresponding inscription groups, and reading sequences in the\ngroups of each oracle bone character, providing a comprehensive and\nhigh-quality level of annotations. This dataset can be used for a variety of\nAI-related research tasks relevant to the field of OBI, such as OBI Character\nDetection and Recognition, Rubbing Denoising, Character Matching, Character\nGeneration, Reading Sequence Prediction, Missing Characters Completion task and\nso on. We believe that the creation and publication of a dataset like this will\nhelp significantly advance the application of AI algorithms in the field of OBI\nresearch.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}