{"id":"2407.20706","title":"HEFT's appraisal of triple (versus double) Higgs weak boson fusion","authors":"Anisha, Daniel Domenech, Christoph Englert, Maria J. Herrero, Roberto\n  A. Morales","authorsParsed":[["Anisha","",""],["Domenech","Daniel",""],["Englert","Christoph",""],["Herrero","Maria J.",""],["Morales","Roberto A.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 10:00:29 GMT"}],"updateDate":"2024-07-31","timestamp":1722333629000,"abstract":"  Multi-Higgs boson interactions with massive gauge bosons are known to be\ntell-tale probes of the vacuum manifold of electroweak symmetry breaking.\nPhenomenologically, a precise determination of these parameters is hampered\nthrough increasingly rare processes at the presently available energy frontier\nprovided by the Large Hadron Collider. Contact interactions of three Higgs\nbosons with the $W$ and $Z$ bosons seem currently well out of experimental\nreach due to an irrelevant SM production cross section. From a theoretical\nperspective, in perturbative extensions of the SM such interactions are\nsuppressed by weak loops and further diluted in a priori sensitive processes\nlike weak boson fusion (WBF) when they admit a dimension-six Standard Model\nEffective Field Theory description. In this work, we identify scenarios that\ncan indeed lead to large, and perhaps even observable modifications of WBF\ntriple Higgs production most directly parametrised by Higgs Effective Field\nTheory. We critically analyse these enhancements at the LHC and future\ncolliders from the perspective of unitarity and demonstrate the radiative\nstability of such analyses under QCD corrections at hadron colliders. In\npassing, we also comment on the expected sensitivity at non-hadron colliders.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9lPhn1Ekj5G3Uy-6MQafgSu5WwJYxrQq3ugEGBgAyYE","pdfSize":"2306171"}
