{"id":"2407.03104","title":"KeyVideoLLM: Towards Large-scale Video Keyframe Selection","authors":"Hao Liang, Jiapeng Li, Tianyi Bai, Xijie Huang, Linzhuang Sun,\n  Zhengren Wang, Conghui He, Bin Cui, Chong Chen, Wentao Zhang","authorsParsed":[["Liang","Hao",""],["Li","Jiapeng",""],["Bai","Tianyi",""],["Huang","Xijie",""],["Sun","Linzhuang",""],["Wang","Zhengren",""],["He","Conghui",""],["Cui","Bin",""],["Chen","Chong",""],["Zhang","Wentao",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 13:41:44 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 08:08:43 GMT"},{"version":"v3","created":"Sat, 10 Aug 2024 14:57:37 GMT"}],"updateDate":"2024-08-13","timestamp":1720014104000,"abstract":"  Recently, with the rise of web videos, managing and understanding large-scale\nvideo datasets has become increasingly important. Video Large Language Models\n(VideoLLMs) have emerged in recent years due to their strong video\nunderstanding capabilities. However, training and inference processes for\nVideoLLMs demand vast amounts of data, presenting significant challenges to\ndata management, particularly regarding efficiency, robustness, and\neffectiveness. In this work, we present KeyVideoLLM, a text-video frame\nsimilarity-based keyframe selection method designed to manage VideoLLM data\nefficiently, robustly, and effectively. Specifically, KeyVideoLLM achieves a\nremarkable data compression rate of up to 60.9 times, substantially lowering\ndisk space requirements, which proves its high efficiency. Additionally, it\nmaintains a 100% selection success rate across all video formats and scales,\nenhances processing speed by up to 200 times compared to existing keyframe\nselection methods, and does not require hyperparameter tuning. Beyond its\noutstanding efficiency and robustness, KeyVideoLLM further improves model\nperformance in video question-answering tasks during both training and\ninference stages. Notably, it consistently achieved the state-of-the-art (SoTA)\nexperimental results on diverse datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computation and Language","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/"}