{"id":"2407.04816","title":"Object recognition in primates: What can early visual areas contribute?","authors":"Christian Quaia and Richard J Krauzlis","authorsParsed":[["Quaia","Christian",""],["Krauzlis","Richard J",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 18:57:09 GMT"}],"updateDate":"2024-07-09","timestamp":1720205829000,"abstract":"  If neuroscientists were asked which brain area is responsible for object\nrecognition in primates, most would probably answer infero-temporal (IT)\ncortex. While IT is likely responsible for fine discriminations, and it is\naccordingly dominated by foveal visual inputs, there is more to object\nrecognition than fine discrimination. Importantly, foveation of an object of\ninterest usually requires recognizing, with reasonable confidence, its presence\nin the periphery. Arguably, IT plays a secondary role in such peripheral\nrecognition, and other visual areas might instead be more critical. To\ninvestigate how signals carried by early visual processing areas (such as LGN\nand V1) could be used for object recognition in the periphery, we focused here\non the task of distinguishing faces from non-faces. We tested how sensitive\nvarious models were to nuisance parameters, such as changes in scale and\norientation of the image, and the type of image background. We found that a\nmodel of V1 simple or complex cells could provide quite reliable information,\nresulting in performance better than 80% in realistic scenarios. An LGN model\nperformed considerably worse. Because peripheral recognition is both crucial to\nenable fine recognition (by bringing an object of interest on the fovea), and\nprobably sufficient to account for a considerable fraction of our daily\nrecognition-guided behavior, we think that the current focus on area IT and\nfoveal processing is too narrow. We propose that rather than a hierarchical\nsystem with IT-like properties as its primary aim, object recognition should be\nseen as a parallel process, with high-accuracy foveal modules operating in\nparallel with lower-accuracy and faster modules that can operate across the\nvisual field.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"i7eTmZI1bYkGul5M8b8xcIfTjEr9pm9wJKaCe6TX81k","pdfSize":"3994681"}
