{"id":"2407.09525","title":"A Deep Learning Framework for Three Dimensional Shape Reconstruction\n  from Phaseless Acoustic Scattering Far-field Data","authors":"Doga Dikbayir, Abdel Alsnayyan, Vishnu Naresh Boddeti, Balasubramaniam\n  Shanker, Hasan Metin Aktulga","authorsParsed":[["Dikbayir","Doga",""],["Alsnayyan","Abdel",""],["Boddeti","Vishnu Naresh",""],["Shanker","Balasubramaniam",""],["Aktulga","Hasan Metin",""]],"versions":[{"version":"v1","created":"Mon, 24 Jun 2024 14:58:49 GMT"}],"updateDate":"2024-07-16","timestamp":1719241129000,"abstract":"  The inverse scattering problem is of critical importance in a number of\nfields, including medical imaging, sonar, sensing, non-destructive evaluation,\nand several others. The problem of interest can vary from detecting the shape\nto the constitutive properties of the obstacle. The challenge in both is that\nthis problem is ill-posed, more so when there is limited information. That\nsaid, significant effort has been expended over the years in developing\nsolutions to this problem. Here, we use a different approach, one that is\nfounded on data. Specifically, we develop a deep learning framework for shape\nreconstruction using limited information with single incident wave, single\nfrequency, and phase-less far-field data. This is done by (a) using a compact\nprobabilistic shape latent space, learned by a 3D variational auto-encoder, and\n(b) a convolutional neural network trained to map the acoustic scattering\ninformation to this shape representation. The proposed framework is evaluated\non a synthetic 3D particle dataset, as well as ShapeNet, a popular 3D shape\nrecognition dataset. As demonstrated via a number of results, the proposed\nmethod is able to produce accurate reconstructions for large batches of complex\nscatterer shapes (such as airplanes and automobiles), despite the significant\nvariation present within the data.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}