{"id":"2407.12589","title":"Privacy-Preserving Adaptive Re-Identification without Image Transfer","authors":"Hamza Rami, Jhony H. Giraldo, Nicolas Winckler, St\\'ephane\n  Lathuili\\`ere","authorsParsed":[["Rami","Hamza",""],["Giraldo","Jhony H.",""],["Winckler","Nicolas",""],["Lathuilière","Stéphane",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:12:44 GMT"}],"updateDate":"2024-07-18","timestamp":1721225564000,"abstract":"  Re-Identification systems (Re-ID) are crucial for public safety but face the\nchallenge of having to adapt to environments that differ from their training\ndistribution. Furthermore, rigorous privacy protocols in public places are\nbeing enforced as apprehensions regarding individual freedom rise, adding\nlayers of complexity to the deployment of accurate Re-ID systems in new\nenvironments. For example, in the European Union, the principles of ``Data\nMinimization'' and ``Purpose Limitation'' restrict the retention and processing\nof images to what is strictly necessary. These regulations pose a challenge to\nthe conventional Re-ID training schemes that rely on centralizing data on\nservers. In this work, we present a novel setting for privacy-preserving\nDistributed Unsupervised Domain Adaptation for person Re-ID (DUDA-Rid) to\naddress the problem of domain shift without requiring any image transfer\noutside the camera devices. To address this setting, we introduce Fed-Protoid,\na novel solution that adapts person Re-ID models directly within the edge\ndevices. Our proposed solution employs prototypes derived from the source\ndomain to align feature statistics within edge devices. Those source prototypes\nare distributed across the edge devices to minimize a distributed Maximum Mean\nDiscrepancy (MMD) loss tailored for the DUDA-Rid setting. Our experiments\nprovide compelling evidence that Fed-Protoid outperforms all evaluated methods\nin terms of both accuracy and communication efficiency, all while maintaining\ndata privacy.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}