{"id":"2407.15727","title":"Inferring turbulent velocity and temperature fields and their statistics\n  from Lagrangian velocity measurements using physics-informed\n  Kolmogorov-Arnold Networks","authors":"Juan Diego Toscano and Theo K\\\"aufer and Zhibo Wang and Martin Maxey\n  and Christian Cierpka and George Em Karniadakis","authorsParsed":[["Toscano","Juan Diego",""],["Käufer","Theo",""],["Wang","Zhibo",""],["Maxey","Martin",""],["Cierpka","Christian",""],["Karniadakis","George Em",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:30:21 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 11:19:18 GMT"}],"updateDate":"2024-07-24","timestamp":1721662221000,"abstract":"  We propose the Artificial Intelligence Velocimetry-Thermometry (AIVT) method\nto infer hidden temperature fields from experimental turbulent velocity data.\nThis physics-informed machine learning method enables us to infer continuous\ntemperature fields using only sparse velocity data, hence eliminating the need\nfor direct temperature measurements. Specifically, AIVT is based on\nphysics-informed Kolmogorov-Arnold Networks (not neural networks) and is\ntrained by optimizing a combined loss function that minimizes the residuals of\nthe velocity data, boundary conditions, and the governing equations. We apply\nAIVT to a unique set of experimental volumetric and simultaneous temperature\nand velocity data of Rayleigh-B\\'enard convection (RBC) that we acquired by\ncombining Particle Image Thermometry and Lagrangian Particle Tracking. This\nallows us to compare AIVT predictions and measurements directly. We demonstrate\nthat we can reconstruct and infer continuous and instantaneous velocity and\ntemperature fields from sparse experimental data at a fidelity comparable to\ndirect numerical simulations (DNS) of turbulence. This, in turn, enables us to\ncompute important quantities for quantifying turbulence, such as fluctuations,\nviscous and thermal dissipation, and QR distribution. This paradigm shift in\nprocessing experimental data using AIVT to infer turbulent fields at DNS-level\nfidelity is a promising avenue in breaking the current deadlock of quantitative\nunderstanding of turbulence at high Reynolds numbers, where DNS is\ncomputationally infeasible.\n","subjects":["Physics/Fluid Dynamics","Computing Research Repository/Machine Learning","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-MDWyTQlp59p3gCImIr7jQBycj4BUv0e_4nzuaQPf9s","pdfSize":"11052221","objectId":"0x8496358500dba4fc5985c3ae0468398be7e46720afa95ae6a40b17a7c5ef3a10","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
