{"id":"2407.14986","title":"Structured Input-Output Modeling and Robust Stability Analysis of\n  Compressible Flows","authors":"Diganta Bhattacharjee, Talha Mushtaq, Peter Seiler, Maziar S. Hemati","authorsParsed":[["Bhattacharjee","Diganta",""],["Mushtaq","Talha",""],["Seiler","Peter",""],["Hemati","Maziar S.",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 21:25:58 GMT"}],"updateDate":"2024-07-23","timestamp":1721510758000,"abstract":"  The recently introduced structured input-output analysis is a powerful method\nfor capturing nonlinear phenomena associated with incompressible flows, and\nthis paper extends that method to the compressible regime. The proposed method\nrelies upon a reformulation of the compressible Navier-Stokes equations, which\nallows for an exact quadratic formulation of the dynamics of perturbations\nabout a steady base flow. To facilitate the structured input-output analysis, a\npseudo-linear model for the quadratic nonlinearity is proposed and the\nstructural information of the nonlinearity is embedded into a structured\nuncertainty comprising unknown `perturbations'. The structured singular value\nframework is employed to compute the input-output gain, which provides an\nestimate of the robust stability margin of the flow perturbations, as well as\nthe forcing and response modes that are consistent with the nonlinearity\nstructure. The analysis is then carried out on a plane, laminar compressible\nCouette flow over a range of Mach numbers. The structured input-output gains\nidentify an instability mechanism, characterized by a spanwise elongated\nstructure in the streamwise-spanwise wavenumber space at a subsonic Mach\nnumber, that evolves into an oblique structure at sonic and supersonic Mach\nnumbers. In addition, the structured input-output forcing and response modes\nprovide insight into the thermodynamic and momentum characteristics associated\nwith a source of instability. Comparisons with a resolvent/unstructured\nanalysis reveal discrepancies in the distribution of input-output gains over\nthe wavenumber space as well as in the modal behavior of an instability, thus\nhighlighting the strong correlation between the structural information of the\nnonlinearity and the underlying flow physics.\n","subjects":["Physics/Fluid Dynamics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}