{"id":"2407.11057","title":"SPIN: SE(3)-Invariant Physics Informed Network for Binding Affinity\n  Prediction","authors":"Seungyeon Choi, Sangmin Seo, Sanghyun Park","authorsParsed":[["Choi","Seungyeon",""],["Seo","Sangmin",""],["Park","Sanghyun",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 08:40:07 GMT"}],"updateDate":"2024-07-17","timestamp":1720600807000,"abstract":"  Accurate prediction of protein-ligand binding affinity is crucial for rapid\nand efficient drug development. Recently, the importance of predicting binding\naffinity has led to increased attention on research that models the\nthree-dimensional structure of protein-ligand complexes using graph neural\nnetworks to predict binding affinity. However, traditional methods often fail\nto accurately model the complex's spatial information or rely solely on\ngeometric features, neglecting the principles of protein-ligand binding. This\ncan lead to overfitting, resulting in models that perform poorly on independent\ndatasets and ultimately reducing their usefulness in real drug development. To\naddress this issue, we propose SPIN, a model designed to achieve superior\ngeneralization by incorporating various inductive biases applicable to this\ntask, beyond merely training on empirical data from datasets. For prediction,\nwe defined two types of inductive biases: a geometric perspective that\nmaintains consistent binding affinity predictions regardless of the complexs\nrotations and translations, and a physicochemical perspective that necessitates\nminimal binding free energy along their reaction coordinate for effective\nprotein-ligand binding. These prior knowledge inputs enable the SPIN to\noutperform comparative models in benchmark sets such as CASF-2016 and CSAR HiQ.\nFurthermore, we demonstrated the practicality of our model through virtual\nscreening experiments and validated the reliability and potential of our\nproposed model based on experiments assessing its interpretability.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Quantitative Biology/Biomolecules"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}