{"id":"2407.05909","title":"Multi-clue Consistency Learning to Bridge Gaps Between General and\n  Oriented Object in Semi-supervised Detection","authors":"Chenxu Wang, Chunyan Xu, Ziqi Gu, Zhen Cui","authorsParsed":[["Wang","Chenxu",""],["Xu","Chunyan",""],["Gu","Ziqi",""],["Cui","Zhen",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 13:14:25 GMT"}],"updateDate":"2024-07-09","timestamp":1720444465000,"abstract":"  While existing semi-supervised object detection (SSOD) methods perform well\nin general scenes, they encounter challenges in handling oriented objects in\naerial images. We experimentally find three gaps between general and oriented\nobject detection in semi-supervised learning: 1) Sampling inconsistency: the\ncommon center sampling is not suitable for oriented objects with larger aspect\nratios when selecting positive labels from labeled data. 2) Assignment\ninconsistency: balancing the precision and localization quality of oriented\npseudo-boxes poses greater challenges which introduces more noise when\nselecting positive labels from unlabeled data. 3) Confidence inconsistency:\nthere exists more mismatch between the predicted classification and\nlocalization qualities when considering oriented objects, affecting the\nselection of pseudo-labels. Therefore, we propose a Multi-clue Consistency\nLearning (MCL) framework to bridge gaps between general and oriented objects in\nsemi-supervised detection. Specifically, considering various shapes of rotated\nobjects, the Gaussian Center Assignment is specially designed to select the\npixel-level positive labels from labeled data. We then introduce the\nScale-aware Label Assignment to select pixel-level pseudo-labels instead of\nunreliable pseudo-boxes, which is a divide-and-rule strategy suited for objects\nwith various scales. The Consistent Confidence Soft Label is adopted to further\nboost the detector by maintaining the alignment of the predicted results.\nComprehensive experiments on DOTA-v1.5 and DOTA-v1.0 benchmarks demonstrate\nthat our proposed MCL can achieve state-of-the-art performance in the\nsemi-supervised oriented object detection task.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fqnWoOa4EcDYil9Rdo0tiMI7nfB9UodXzto2dINh7Ik","pdfSize":"5762834"}
