{"id":"2407.15937","title":"Toward Exoplanet Transit Spectroscopy Using JWST/MIRI's Medium\n  Resolution Spectrometer","authors":"Drake Deming, Guangwei Fu, Jeroen Bouwman, Daniel Dicken, Nestor\n  Espinoza, Alistair Glasse, Thomas Greene, Sarah Kendrew, David Law, Jacob\n  Lustig-Yaeger, Macarena Garcia Marin, and Everett Schlawin","authorsParsed":[["Deming","Drake",""],["Fu","Guangwei",""],["Bouwman","Jeroen",""],["Dicken","Daniel",""],["Espinoza","Nestor",""],["Glasse","Alistair",""],["Greene","Thomas",""],["Kendrew","Sarah",""],["Law","David",""],["Lustig-Yaeger","Jacob",""],["Marin","Macarena Garcia",""],["Schlawin","Everett",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:00:04 GMT"}],"updateDate":"2024-07-24","timestamp":1721671204000,"abstract":"  The Mid-Infrared Instrument (MIRI)'s Medium Resolution Spectrometer (the MRS)\non JWST has potentially important advantages for transit and eclipse\nspectroscopy of exoplanets, including lack of saturation for bright host stars,\nwavelength span to longward of 20 microns, and JWST's highest spectral\nresolving power. We here test the performance of the MRS for time series\nspectroscopy by observing the secondary eclipse of the bright stellar eclipsing\nbinary R Canis Majoris. Our observations push the MRS into saturation at the\nshortest wavelength, more than for any currently known exoplanet system. We\nfind strong charge migration between pixels that we mitigate using a custom\ndata analysis pipeline. Our data analysis recovers much of the spatial charge\nmigration by combining detector pixels at the group level, via weighting by the\npoint spread function. We achieve nearly photon-limited performance in time\nseries data at wavelengths longward of 5.2 microns. In 2017, Snellen et al.\nsuggested that the MRS could be used to detect carbon dioxide absorption from\nthe atmosphere of the temperate planet orbiting Proxima Centauri. We infer that\nthe relative spectral response of the MRS versus wavelength is sufficiently\nstable to make that detection feasible. As regards the secondary eclipse of\nthis Algol-type binary, we measure the eclipse depth by summing our spectra\nover the wavelengths in four channels, and also measuring the eclipse depth as\nobserved by TESS. Those eclipse depths require a temperature for the secondary\nstar that is significantly hotter than previous observations in the optical to\nnear-IR, probably due to irradiation by the primary star. At full spectral\nresolution of the MRS, we find atomic hydrogen recombination emission lines in\nthe secondary star, from principal quantum levels n = 7, 8, 10, and 14.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}