{"id":"2407.05333","title":"Generating multi-scale NMC particles with radial grain architectures\n  using spatial stochastics and GANs","authors":"Lukas Fuchs, Orkun Furat, Donal P. Finegan, Jeffery Allen, Francois\n  L.E. Usseglio-Viretta, Bertan Ozdogru, Peter J. Weddle, Kandler Smith, Volker\n  Schmidt","authorsParsed":[["Fuchs","Lukas",""],["Furat","Orkun",""],["Finegan","Donal P.",""],["Allen","Jeffery",""],["Usseglio-Viretta","Francois L. E.",""],["Ozdogru","Bertan",""],["Weddle","Peter J.",""],["Smith","Kandler",""],["Schmidt","Volker",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 11:23:17 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 08:44:39 GMT"}],"updateDate":"2024-07-22","timestamp":1720351397000,"abstract":"  Understanding structure-property relationships of Li-ion battery cathodes is\ncrucial for optimizing rate-performance and cycle-life resilience. However,\ncorrelating the morphology of cathode particles, such as in NMC811, and their\ninner grain architecture with electrode performance is challenging,\nparticularly, due to the significant length-scale difference between grain and\nparticle sizes. Experimentally, it is currently not feasible to image such a\nhigh number of particles with full granular detail to achieve representivity. A\nsecond challenge is that sufficiently high-resolution 3D imaging techniques\nremain expensive and are sparsely available at research institutions. To\naddress these challenges, a stereological generative adversarial network\n(GAN)-based model fitting approach is presented that can generate\nrepresentative 3D information from 2D data, enabling characterization of\nmaterials in 3D using cost-effective 2D data. Once calibrated, this multi-scale\nmodel is able to rapidly generate virtual cathode particles that are\nstatistically similar to experimental data, and thus is suitable for virtual\ncharacterization and materials testing through numerical simulations. A large\ndataset of simulated particles with inner grain architecture has been made\npublicly available.\n","subjects":["Physics/Applied Physics","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}