{"id":"2407.17310","title":"LangOcc: Self-Supervised Open Vocabulary Occupancy Estimation via Volume\n  Rendering","authors":"Simon Boeder, Fabian Gigengack, Benjamin Risse","authorsParsed":[["Boeder","Simon",""],["Gigengack","Fabian",""],["Risse","Benjamin",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 14:22:55 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 07:47:11 GMT"}],"updateDate":"2024-07-26","timestamp":1721830975000,"abstract":"  The 3D occupancy estimation task has become an important challenge in the\narea of vision-based autonomous driving recently. However, most existing\ncamera-based methods rely on costly 3D voxel labels or LiDAR scans for\ntraining, limiting their practicality and scalability. Moreover, most methods\nare tied to a predefined set of classes which they can detect. In this work we\npresent a novel approach for open vocabulary occupancy estimation called\nLangOcc, that is trained only via camera images, and can detect arbitrary\nsemantics via vision-language alignment. In particular, we distill the\nknowledge of the strong vision-language aligned encoder CLIP into a 3D\noccupancy model via differentiable volume rendering. Our model estimates\nvision-language aligned features in a 3D voxel grid using only images. It is\ntrained in a self-supervised manner by rendering our estimations back to 2D\nspace, where ground-truth features can be computed. This training mechanism\nautomatically supervises the scene geometry, allowing for a straight-forward\nand powerful training method without any explicit geometry supervision. LangOcc\noutperforms LiDAR-supervised competitors in open vocabulary occupancy by a\nlarge margin, solely relying on vision-based training. We also achieve\nstate-of-the-art results in self-supervised semantic occupancy estimation on\nthe Occ3D-nuScenes dataset, despite not being limited to a specific set of\ncategories, thus demonstrating the effectiveness of our proposed\nvision-language training.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}