{"id":"2407.17216","title":"Reduced-Space Iteratively Reweighted Second-Order Methods for Nonconvex\n  Sparse Regularization","authors":"Hao Wang, Xiangyu Yang, Yichen Zhu","authorsParsed":[["Wang","Hao",""],["Yang","Xiangyu",""],["Zhu","Yichen",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 12:15:59 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 15:08:44 GMT"},{"version":"v3","created":"Sat, 17 Aug 2024 16:31:37 GMT"}],"updateDate":"2024-08-20","timestamp":1721823359000,"abstract":"  This paper explores a specific type of nonconvex sparsity-promoting\nregularization problems, namely those involving $\\ell_p$-norm regularization,\nin conjunction with a twice continuously differentiable loss function. We\npropose a novel second-order algorithm designed to effectively address this\nclass of challenging nonconvex and nonsmooth problems, showcasing several\ninnovative features: (i) The use of an alternating strategy to solve a\nreweighted $\\ell_1$ regularized subproblem and the subspace approximate Newton\nstep. (ii) The reweighted $\\ell_1$ regularized subproblem relies on a convex\napproximation to the nonconvex regularization term, enabling a closed-form\nsolution characterized by the soft-thresholding operator. This feature allows\nour method to be applied to various nonconvex regularization problems. (iii)\nOur algorithm ensures that the iterates maintain their sign values and that\nnonzero components are kept away from 0 for a sufficient number of iterations,\neventually transitioning to a perturbed Newton method. (iv) We provide\ntheoretical guarantees of global convergence, local superlinear convergence in\nthe presence of the Kurdyka-\\L ojasiewicz (KL) property, and local quadratic\nconvergence when employing the exact Newton step in our algorithm. We also\nshowcase the effectiveness of our approach through experiments on a diverse set\nof model prediction problems.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}