{"id":"2407.12533","title":"Set-theoretic solutions of the Yang-Baxter equation and regular\n  *-semibraces","authors":"Qianxue Liu and Shoufeng Wang","authorsParsed":[["Liu","Qianxue",""],["Wang","Shoufeng",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 13:14:50 GMT"}],"updateDate":"2024-07-18","timestamp":1721222090000,"abstract":"  As generalizations of inverse semibraces introduced by Catino, Mazzotta and\nStefanelli, Miccoli has introduced regular $\\star$-semibraces under the name of\ninvolution semibraces and given a sufficient condition under which the\nassociated map to a regular $\\star$-semibrace is a set-theoretic solution of\nthe Yang-Baxter equation. From the viewpoint of universal algebra, regular\n$\\star$-semibraces are (2,2,1)-type algebras. In this paper we continue to\nstudy set-theoretic solutions of the Yang-Baxter equation and regular\n$\\star$-semibraces. We first consider several kinds of (2,2,1)-type algebras\nthat induced by regular $\\star$-semigroups and give some equivalent\ncharacterizations of the statement that they form regular $\\star$-semibraces.\nThen we give sufficient and necessary conditions under which the associated\nmaps to these (2,2,1)-type algebras are set-theoretic solutions of the\nYang-Baxter equation. Finally, as analogues of weak braces defined by Catino,\nMazzotta, Miccoli and Stefanelli, we introduce weak $\\star$-braces in the class\nof regular $\\star$-semibraces, describe their algebraic structures and prove\nthat the associated maps to weak $\\star$-braces are always set-theoretic\nsolutions of the Yang-Baxter equation. The result of the present paper shows\nthat the class of completely regular, orthodox and locally inverse regular\n$\\star$-semigroups is a source of possibly new set-theoretic solutions of the\nYang-Baxter equation. Our results establish the close connection between the\nYang-Baxter equation and the classical structural theory of regular\n$\\star$-semigroups.\n","subjects":["Mathematics/Group Theory","Mathematics/Quantum Algebra"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}