{"id":"2407.09315","title":"RBMD: A molecular dynamics package enabling to simulate 10 million\n  all-atom particles in a single graphics processing unit","authors":"Weihang Gao, Teng Zhao, Yongfa Guo, Jiuyang Liang, Huan Liu, Maoying\n  Luo, Zedong Luo, Wei Qin, Yichao Wang, Qi Zhou, Shi Jin, and Zhenli Xu","authorsParsed":[["Gao","Weihang",""],["Zhao","Teng",""],["Guo","Yongfa",""],["Liang","Jiuyang",""],["Liu","Huan",""],["Luo","Maoying",""],["Luo","Zedong",""],["Qin","Wei",""],["Wang","Yichao",""],["Zhou","Qi",""],["Jin","Shi",""],["Xu","Zhenli",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 14:54:54 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 14:12:20 GMT"},{"version":"v3","created":"Fri, 23 Aug 2024 02:06:56 GMT"}],"updateDate":"2024-08-26","timestamp":1720796094000,"abstract":"  This paper introduces a random-batch molecular dynamics (RBMD) package for\nfast simulations of particle systems at the nano/micro scale. Different from\nexisting packages, the RBMD uses random batch methods for nonbonded\ninteractions of particle systems. The long-range part of Coulomb interactions\nis calculated in Fourier space by the random batch Ewald algorithm, which\nachieves linear complexity and superscalability, surpassing classical\nlattice-based Ewald methods. For the short-range part, the random batch list\nalgorithm is used to construct neighbor lists, significantly reducing both\ncomputational and memory costs. The RBMD is implemented on GPU-CPU\nheterogeneous architectures, with classical force fields for all-atom systems.\nBenchmark systems are used to validate accuracy and performance of the package.\nComparison with the particle-particle particle-mesh method and the Verlet list\nmethod in the LAMMPS package is performed on three different NVIDIA GPUs,\ndemonstrating high efficiency of the RBMD on heterogeneous architectures. Our\nresults also show that the RBMD enables simulations on a single GPU with a CPU\ncore up to 10 million particles. Typically, for systems of one million\nparticles, the RBMD allows simulating all-atom systems with a high efficiency\nof 8.20 ms per step, demonstrating the attractive feature for running\nlarge-scale simulations of practical applications on a desktop machine.\n","subjects":["Physics/Computational Physics","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}