{"id":"2407.17476","title":"ORCDF: An Oversmoothing-Resistant Cognitive Diagnosis Framework for\n  Student Learning in Online Education Systems","authors":"Hong Qian, Shuo Liu, Mingjia Li, Bingdong Li, Zhi Liu, Aimin Zhou","authorsParsed":[["Qian","Hong",""],["Liu","Shuo",""],["Li","Mingjia",""],["Li","Bingdong",""],["Liu","Zhi",""],["Zhou","Aimin",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 16:42:53 GMT"}],"updateDate":"2024-07-26","timestamp":1719592973000,"abstract":"  Cognitive diagnosis models (CDMs) are designed to learn students' mastery\nlevels using their response logs. CDMs play a fundamental role in online\neducation systems since they significantly influence downstream applications\nsuch as teachers' guidance and computerized adaptive testing. Despite the\nsuccess achieved by existing CDMs, we find that they suffer from a thorny issue\nthat the learned students' mastery levels are too similar. This issue, which we\nrefer to as oversmoothing, could diminish the CDMs' effectiveness in downstream\ntasks. CDMs comprise two core parts: learning students' mastery levels and\nassessing mastery levels by fitting the response logs. This paper contends that\nthe oversmoothing issue arises from that existing CDMs seldom utilize response\nsignals on exercises in the learning part but only use them as labels in the\nassessing part. To this end, this paper proposes an oversmoothing-resistant\ncognitive diagnosis framework (ORCDF) to enhance existing CDMs by utilizing\nresponse signals in the learning part. Specifically, ORCDF introduces a novel\nresponse graph to inherently incorporate response signals as types of edges.\nThen, ORCDF designs a tailored response-aware graph convolution network (RGC)\nthat effectively captures the crucial response signals within the response\ngraph. Via ORCDF, existing CDMs are enhanced by replacing the input embeddings\nwith the outcome of RGC, allowing for the consideration of response signals on\nexercises in the learning part. Extensive experiments on real-world datasets\nshow that ORCDF not only helps existing CDMs alleviate the oversmoothing issue\nbut also significantly enhances the models' prediction and interpretability\nperformance. Moreover, the effectiveness of ORCDF is validated in the\ndownstream task of computerized adaptive testing.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}