{"id":"2407.11389","title":"Spatial-spectral Cell-free Networks: A Large-scale Case Study","authors":"Zesheng Zhu, Lifeng Wang, Xin Wang, Dongming Wang and Kai-Kit Wong","authorsParsed":[["Zhu","Zesheng",""],["Wang","Lifeng",""],["Wang","Xin",""],["Wang","Dongming",""],["Wong","Kai-Kit",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 05:15:44 GMT"}],"updateDate":"2024-07-17","timestamp":1721106944000,"abstract":"  This paper studies the large-scale cell-free networks where dense distributed\naccess points (APs) serve many users. As a promising next-generation network\narchitecture, cell-free networks enable ultra-reliable connections and minimal\nfading/blockage, which are much favorable to the millimeter wave and Terahertz\ntransmissions. However, conventional beam management with large phased arrays\nin a cell is very time-consuming in the higher-frequencies, and could be\nworsened when deploying a large number of coordinated APs in the cell-free\nsystems. To tackle this challenge, the spatial-spectral cell-free networks with\nthe leaky-wave antennas are established by coupling the propagation angles with\nfrequencies. The beam training overhead in this direction can be significantly\nreduced through exploiting such spatial-spectral coupling effects. In the\nconsidered large-scale spatial-spectral cell-free networks, a novel subchannel\nallocation solution at sub-terahertz bands is proposed by leveraging the\nrelationship between cross-entropy method and mixture model. Since initial\naccess and AP clustering play a key role in achieving scalable large-scale\ncell-free networks, a hierarchical AP clustering solution is proposed to make\nthe joint initial access and cluster formation, which is adaptive and has no\nneed to initialize the number of AP clusters. After AP clustering, a subchannel\nallocation solution is devised to manage the interference between AP clusters.\nNumerical results are presented to confirm the efficiency of the proposed\nsolutions and indicate that besides subchannel allocation, AP clustering can\nalso have a big impact on the large-scale cell-free network performance at\nsub-terahertz bands.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7hjUHQ511iU7kOjOQrtQ_rDxWk-NyNiduiPyIjM8920","pdfSize":"541231"}
