{"id":"2407.00610","title":"Diff-BBO: Diffusion-Based Inverse Modeling for Black-Box Optimization","authors":"Dongxia Wu, Nikki Lijing Kuang, Ruijia Niu, Yi-An Ma, Rose Yu","authorsParsed":[["Wu","Dongxia",""],["Kuang","Nikki Lijing",""],["Niu","Ruijia",""],["Ma","Yi-An",""],["Yu","Rose",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 06:58:31 GMT"}],"updateDate":"2024-07-02","timestamp":1719730711000,"abstract":"  Black-box optimization (BBO) aims to optimize an objective function by\niteratively querying a black-box oracle. This process demands sample-efficient\noptimization due to the high computational cost of function evaluations. While\nprior studies focus on forward approaches to learn surrogates for the unknown\nobjective function, they struggle with high-dimensional inputs where valid\ninputs form a small subspace (e.g., valid protein sequences), which is common\nin real-world tasks. Recently, diffusion models have demonstrated impressive\ncapability in learning the high-dimensional data manifold. They have shown\npromising performance in black-box optimization tasks but only in offline\nsettings. In this work, we propose diffusion-based inverse modeling for\nblack-box optimization (Diff-BBO), the first inverse approach leveraging\ndiffusion models for online BBO problem. Diff-BBO distinguishes itself from\nforward approaches through the design of acquisition function. Instead of\nproposing candidates in the design space, Diff-BBO employs a novel acquisition\nfunction Uncertainty-aware Exploration (UaE) to propose objective function\nvalues, which leverages the uncertainty of a conditional diffusion model to\ngenerate samples in the design space. Theoretically, we prove that using UaE\nleads to optimal optimization outcomes. Empirically, we redesign experiments on\nthe Design-Bench benchmark for online settings and show that Diff-BBO achieves\nstate-of-the-art performance.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}