{"id":"2407.03484","title":"Visualizing the Evolution of Twitter (X.com) Conversations: A\n  Comprehensive Methodology Applied to AI Training Discussions on ChatGPT","authors":"Nicole Jess and Hasan Gokberk Bayhan","authorsParsed":[["Jess","Nicole",""],["Bayhan","Hasan Gokberk",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 20:13:11 GMT"}],"updateDate":"2024-07-08","timestamp":1720037591000,"abstract":"  With the rise of social media platforms, especially X.com (formerly Twitter),\nthere is a growing interest in understanding digital social networks and human\ndigital interactions. This paper presents a comprehensive methodology for\nextracting, processing, and visually analyzing data from X.com, using a\ncombination of Python and R packages, enhanced by our publicly accessible,\ncustomizable code. Our approach compiles a dynamic dataset that captures\nvarious interactions: replies, retweets, and mentions. To explore deeper\ninsights, the data is subjected to sentiment analysis and keyword coding,\nindicating shifts in discourse over time. Our method is structured in three\nprimary phases. Initially, R is employed for pulling data and the formation of\nsocial network datasets. Following this, the combination of Python and R is\nutilized for sentiment analysis and keyword coding, aiming to uncover the\nunderlying emotional shifts and language transitions within topics of\ndiscussion. The final phase employs R to visualize the dynamic shifts within\nthese social networks. These visualization tools highlight changes in user\ninteractions and patterns of influence. For a practical demonstration, we\nanalyzed conversations on X.com regarding the controversial proposal to halt AI\ndevelopment, focusing specifically on discussions about ChatGPT. By using\nkeyword searches, leading voices in the debate were identified. Our analysis of\nsentiment and keywords revealed patterns in emotions and language, while visual\ntools illustrated the development of network connections and their influence.\nThis study emphasizes the vital role of visual tools in understanding online\nsocial dynamics in the digital age.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}