{"id":"2407.16339","title":"A smooth filament origin for prolate galaxies \"going bananas\" in deep\n  JWST images","authors":"Alvaro Pozo, Tom Broadhurst, Razieh Emami, Philip Mocz, Mark\n  Vogelsberger, Lars Hernquist, Christopher J. Conselice, Hoang Nhan Luu,\n  George F. Smoot and Rogier Windhorst","authorsParsed":[["Pozo","Alvaro",""],["Broadhurst","Tom",""],["Emami","Razieh",""],["Mocz","Philip",""],["Vogelsberger","Mark",""],["Hernquist","Lars",""],["Conselice","Christopher J.",""],["Luu","Hoang Nhan",""],["Smoot","George F.",""],["Windhorst","Rogier",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 09:40:32 GMT"}],"updateDate":"2024-07-24","timestamp":1721727632000,"abstract":"  We compare the abundant prolate shaped galaxies reported beyond z$>$3 in deep\nJWST surveys, with the predicted {\\it stellar} appearance of young galaxies in\ndetailed hydro-simulations of three main dark matter contenders: Cold (CDM),\nWave/Fuzzy ($\\psi$DM) and Warm Dark Matter (WDM). We find the observed galaxy\nimages closely resemble the elongated stellar appearance of young galaxies\npredicted for both $\\psi$DM and WDM, during the first $\\simeq$ 500Myr while\nmaterial steadily accretes from long, smooth filaments. The dark mater halos of\nWDM and $\\psi$DM also have pronounced, prolate elongation similar to the stars,\nindicating a shared, highly triaxial equilibrium. This is unlike CDM where the\nearly stellar morphology is mainly spheroidal formed from fragmented filaments\nwith frequent merging, resulting in modest triaxiality. Quantitatively, the\nexcess of prolate galaxies observed by JWST matches well WDM and $\\psi$DM for\nparticle masses of 1.4KeV and $2.5\\times 10^{-22}$ eV respectively. For CDM,\nseveral visible subhalos are typically predicted to orbit within the virial\nradius of each galaxy from subhalo accretion, whereas merging is initially rare\nfor WDM and $\\psi$DM. We also verify with our simulations that $\\psi$DM may be\ndistinguished from WDM by the form of the core, which is predicted to be smooth\nand centered for WDM, but is a dense soliton for $\\psi$DM traced by stars and\nmeasurably offset from the galaxy center by random wave perturbations in the\nsimulations. We emphasise that long smooth filaments absent of galaxies may\nprove detectable with JWST, traced by stars and gas with comoving lengths of\n150kpc predicted at z$\\simeq$10, depending on the particle mass of $\\psi$DM or\nWDM.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}