{"id":"2407.20398","title":"Eccentric planet-disc interactions: orbital migration and eccentricity\n  evolution","authors":"Callum W. Fairbairn and Roman R. Rafikov","authorsParsed":[["Fairbairn","Callum W.",""],["Rafikov","Roman R.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 19:50:15 GMT"}],"updateDate":"2024-07-31","timestamp":1722282615000,"abstract":"  Gravitational coupling between a protoplanetary disc and an embedded\neccentric planet is an important, long-standing problem, which has been not yet\nbeen conclusively explored. Here we study the torque and associated orbital\nevolution of an eccentric planet in a two-dimensional disc via the\nsemi-analytical, fully global linear approach. Our methodology has the\nadvantage that the spatial structure of the density waves launched by the\nplanet is solved for fully. This allows us to account for the possibility of\ntorque excitation over an extended radial interval for each Fourier harmonic of\nthe perturbation, as opposed to earlier approximate treatments localized around\nLindblad and corotation resonances. We systematically explore the torque\nbehaviour across the space of disc properties (assuming power law profiles for\nthe disc surface density and temperature), including the aspect ratio.\nCrucially, we examine the torque variation as the orbital eccentricity becomes\nsupersonic relative to the gas motion (when planetary eccentricity is of order\nthe disc aspect ratio), finding that the torque robustly reverses its sign near\nthis transition. We also find that for shallow surface density gradients\nplanetary migration may become outwards beyond this transition, although the\nrapid eccentricity damping (which is typically $\\sim 10^2$ times faster than\nthe orbital migration rate) would quickly restore inwards migration as the\nplanet circularizes. Our self-consistently computed torques are in qualitative\nagreement with past numerical studies of eccentric planet-disc coupling. We\nprovide our torque data for different disc parameters to the community for\nfuture testing and implementation in population synthesis studies.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}