{"id":"2407.09705","title":"Diagnosing and Re-learning for Balanced Multimodal Learning","authors":"Yake Wei and Siwei Li and Ruoxuan Feng and Di Hu","authorsParsed":[["Wei","Yake",""],["Li","Siwei",""],["Feng","Ruoxuan",""],["Hu","Di",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 22:12:03 GMT"}],"updateDate":"2024-07-16","timestamp":1720822323000,"abstract":"  To overcome the imbalanced multimodal learning problem, where models prefer\nthe training of specific modalities, existing methods propose to control the\ntraining of uni-modal encoders from different perspectives, taking the\ninter-modal performance discrepancy as the basis. However, the intrinsic\nlimitation of modality capacity is ignored. The scarcely informative modalities\ncan be recognized as ``worse-learnt'' ones, which could force the model to\nmemorize more noise, counterproductively affecting the multimodal model\nability. Moreover, the current modality modulation methods narrowly concentrate\non selected worse-learnt modalities, even suppressing the training of others.\nHence, it is essential to consider the intrinsic limitation of modality\ncapacity and take all modalities into account during balancing. To this end, we\npropose the Diagnosing \\& Re-learning method. The learning state of each\nmodality is firstly estimated based on the separability of its uni-modal\nrepresentation space, and then used to softly re-initialize the corresponding\nuni-modal encoder. In this way, the over-emphasizing of scarcely informative\nmodalities is avoided. In addition, encoders of worse-learnt modalities are\nenhanced, simultaneously avoiding the over-training of other modalities.\nAccordingly, multimodal learning is effectively balanced and enhanced.\nExperiments covering multiple types of modalities and multimodal frameworks\ndemonstrate the superior performance of our simple-yet-effective method for\nbalanced multimodal learning. The source code and dataset are available at\n\\url{https://github.com/GeWu-Lab/Diagnosing_Relearning_ECCV2024}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}