{"id":"2407.19017","title":"Waveform models for the gravitational-wave memory effect: Extreme\n  mass-ratio limit and final memory offset","authors":"Arwa Elhashash, David A. Nichols","authorsParsed":[["Elhashash","Arwa",""],["Nichols","David A.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:01:06 GMT"}],"updateDate":"2024-07-30","timestamp":1722016866000,"abstract":"  The gravitational-wave (GW) memory effect is a strong-field relativistic\nphenomenon that is associated with a persistent change in the GW strain after\nthe passage of a GW. The nonlinear effect arises from interactions of GWs\nthemselves in the wave zone and is an observable effect connected to the\ninfrared properties of general relativity. The detection of the GW memory\neffect is possible with LIGO and Virgo in a population of binary-black-hole\n(BBH) mergers or from individual events with next-generation ground- and\nspace-based GW detectors or pulsar timing arrays. Matched-filtering-based\nsearches for the GW memory require accurate, and preferably rapid-to-evaluate\nwaveform models of the memory effect's GW signal. One important element of such\na waveform model is a model for the final memory offset -- namely, the net\nchange in strain between early and late times. In this paper, we construct a\nmodel for the final memory offset from the merger of nonspinning BBH systems in\nquasicircular orbits. A novel ingredient of this model is that we first compute\nthe memory signal for extreme mass-ratio inspirals using a high\npost-Newtonian-order analytic calculation, and we use this analytical result to\nfix the coefficient in the fit which is linear in the mass-ratio. The resulting\nmemory-offset fit could be used for detecting the GW memory for binaries that\nmerge on a timescale that is short relative to the inverse of the low-frequency\ncutoff of a GW detector. Additionally, this fit will be useful for analytic\nwaveform models of the GW memory signals in the time and frequency domains.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}