{"id":"2407.21281","title":"Unlocking the Potential of Binding Corporate Rules (BCRs) in Health Data\n  Transfers","authors":"Marcelo Corrales Compagnucci, Mark Fenwick and Helena Haapio","authorsParsed":[["Compagnucci","Marcelo Corrales",""],["Fenwick","Mark",""],["Haapio","Helena",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 02:09:52 GMT"}],"updateDate":"2024-08-01","timestamp":1722391792000,"abstract":"  This chapter explores the essential role of Binding Corporate Rules (BCRs) in\nmanaging and facilitating secure health data transfers within corporate groups\nunder the EU General Data Protection Regulation (GDPR). BCRs are tailored to\nensure compliance with the GDPR and similar international data protection laws,\npresenting a flexible mechanism for transferring sensitive health and genomic\ndata. The chapter situates BCRs within the broader spectrum of the GDPR\ninternational data transfer mechanisms, addressing the unique challenges posed\nby the sensitive nature of health data and the increased adoption of AI\ntechnologies. The European Data Protection Board (EDPB) Recommendations 1/2022\non BCRs, issued following the Schrems II decision, are critically analyzed,\nhighlighting their stringent requirements and the need for a balanced approach\nthat prioritizes data protection and an AI governance framework. The chapter\noutlines the BCR approval process, stressing the importance of streamlining\nthis process to encourage broader adoption. It underscores the necessity of a\nmultidisciplinary approach in developing BCRs, incorporating recently adopted\ninternational standards and frameworks, which offer valuable guidance for\norganizations to build trustworthy AI management systems. They guarantee the\nethical development, deployment, and operation of AI, which is essential for\nits successful integration and the broader digital transformation. In\nconclusion, BCRs are positioned as essential tools for secure health data\nmanagement, fostering transparency, accountability, and collaboration across\ninternational borders. The chapter calls for proactive measures to incentivize\nBCR adoption, streamline approval processes, and promote more innovative\napproaches, ensuring BCRs remain a robust mechanism for global data protection\nand compliance.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}