{"id":"2407.13131","title":"Reimagining Communities through Transnational Bengali Decolonial\n  Discourse with YouTube Content Creators","authors":"Dipto Das, Dhwani Gandhi, Bryan Semaan","authorsParsed":[["Das","Dipto",""],["Gandhi","Dhwani",""],["Semaan","Bryan",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 03:41:39 GMT"}],"updateDate":"2024-07-19","timestamp":1721274099000,"abstract":"  Colonialism--the policies and practices wherein a foreign body imposes its\nways of life on local communities--has historically impacted how collectives\nperceive themselves in relation to others. One way colonialism has impacted how\npeople see themselves is through nationalism, where nationalism is often\nunderstood through shared language, culture, religion, and geopolitical\nborders. The way colonialism has shaped people's experiences with nationalism\nhas shaped historical conflicts between members of different nation-states for\na long time. While recent social computing research has studied how colonially\nmarginalized people can engage in discourse to decolonize or re-imagine and\nreclaim themselves and their communities on their own terms--what is less\nunderstood is how technology can better support decolonial discourses in an\neffort to re-imagine nationalism. To understand this phenomenon, this research\ndraws on a semi-structured interview study with YouTubers who make videos about\nculturally Bengali people whose lives were upended as a product of colonization\nand are now dispersed across Bangladesh, India, and Pakistan. This research\nseeks to understand people's motivations and strategies for engaging in\nvideo-mediated decolonial discourse in transnational contexts. We discuss how\nour work demonstrates the potential of the sociomateriality of decolonial\ndiscourse online and extends an invitation to foreground complexities of\nnationalism in social computing research.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3ie12se1GaDMMqHuMUDiyGKI3Ho0hhTIzGwPGHo2D34","pdfSize":"531278","objectId":"0x9b043e0e23482a8fd38cda86f3a7b939b3db298a5757234888e91789a04de98e","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
