{"id":"2407.08718","title":"The exact non-Gaussian weak lensing likelihood: A framework to calculate\n  analytic likelihoods for correlation functions on masked Gaussian random\n  fields","authors":"Veronika Oehl and Tilman Tr\\\"oster","authorsParsed":[["Oehl","Veronika",""],["Tröster","Tilman",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:52:20 GMT"}],"updateDate":"2024-07-16","timestamp":1720720340000,"abstract":"  We present exact non-Gaussian joint likelihoods for auto- and\ncross-correlation functions on arbitrarily masked spherical Gaussian random\nfields. Our considerations apply to spin-0 as well as spin-2 fields but are\ndemonstrated here for the spin-2 weak-lensing correlation function.\n  We motivate that this likelihood cannot be Gaussian and show how it can\nnevertheless be calculated exactly for any mask geometry and on a curved sky,\nas well as jointly for different angular-separation bins and redshift-bin\ncombinations. Splitting our calculation into a large- and small-scale part, we\napply a computationally efficient approximation for the small scales that does\nnot alter the overall non-Gaussian likelihood shape.\n  To compare our exact likelihoods to correlation-function sampling\ndistributions, we simulated a large number of weak-lensing maps, including\nshape noise, and find excellent agreement for one-dimensional as well as\ntwo-dimensional distributions. Furthermore, we compare the exact likelihood to\nthe widely employed Gaussian likelihood and find significant levels of skewness\nat angular separations $\\gtrsim 1^{\\circ}$ such that the mode of the exact\ndistributions is shifted away from the mean towards lower values of the\ncorrelation function. We find that the assumption of a Gaussian random field\nfor the weak-lensing field is well valid at these angular separations.\n  Considering the skewness of the non-Gaussian likelihood, we evaluate its\nimpact on the posterior constraints on $S_8$. On a simplified\nweak-lensing-survey setup with an area of $10 \\ 000 \\ \\mathrm{deg}^2$, we find\nthat the posterior mean of $S_8$ is up to $2\\%$ higher when using the\nnon-Gaussian likelihood, a shift comparable to the precision of current\nstage-III surveys.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pzVR39TagTbrj7OVaVAZTqYmZ76X32nb-aTQaDGwp9I","pdfSize":"1812579"}
