{"id":"2407.11089","title":"Explainable bank failure prediction models: Counterfactual explanations\n  to reduce the failure risk","authors":"Seyma Gunonu, Gizem Altun, Mustafa Cavus","authorsParsed":[["Gunonu","Seyma",""],["Altun","Gizem",""],["Cavus","Mustafa",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 15:27:27 GMT"},{"version":"v2","created":"Sun, 21 Jul 2024 19:47:47 GMT"}],"updateDate":"2024-07-23","timestamp":1720970847000,"abstract":"  The accuracy and understandability of bank failure prediction models are\ncrucial. While interpretable models like logistic regression are favored for\ntheir explainability, complex models such as random forest, support vector\nmachines, and deep learning offer higher predictive performance but lower\nexplainability. These models, known as black boxes, make it difficult to derive\nactionable insights. To address this challenge, using counterfactual\nexplanations is suggested. These explanations demonstrate how changes in input\nvariables can alter the model output and suggest ways to mitigate bank failure\nrisk. The key challenge lies in selecting the most effective method for\ngenerating useful counterfactuals, which should demonstrate validity,\nproximity, sparsity, and plausibility. The paper evaluates several\ncounterfactual generation methods: WhatIf, Multi Objective, and Nearest\nInstance Counterfactual Explanation, and also explores resampling methods like\nundersampling, oversampling, SMOTE, and the cost sensitive approach to address\ndata imbalance in bank failure prediction in the US. The results indicate that\nthe Nearest Instance Counterfactual Explanation method yields higher quality\ncounterfactual explanations, mainly using the cost sensitive approach. Overall,\nthe Multi Objective Counterfactual and Nearest Instance Counterfactual\nExplanation methods outperform others regarding validity, proximity, and\nsparsity metrics, with the cost sensitive approach providing the most desirable\ncounterfactual explanations. These findings highlight the variability in the\nperformance of counterfactual generation methods across different balancing\nstrategies and machine learning models, offering valuable strategies to enhance\nthe utility of black box bank failure prediction models.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cjy-0lJqf-jpHnp9n0tPVTIdx0XdhBzRW9I1L9rhEtg","pdfSize":"664475","objectId":"0xeefab3985549e29047f5acb0f7f7a153ae4a252ecf290ca3b2265cb36f4b8688","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
