{"id":"2407.14037","title":"Low Leakage Ferroelectric Heteroepitaxial Al$_{0.7}$Sc$_{0.3}$N Films on\n  GaN","authors":"Keisuke Yazawa, Charles Evans, Elizabeth Dickey, Brooks Tellekamp,\n  Geoff L. Brennecka, Andriy Zakutayev","authorsParsed":[["Yazawa","Keisuke",""],["Evans","Charles",""],["Dickey","Elizabeth",""],["Tellekamp","Brooks",""],["Brennecka","Geoff L.",""],["Zakutayev","Andriy",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 05:22:11 GMT"}],"updateDate":"2024-07-22","timestamp":1721366531000,"abstract":"  Wurtzite (Al,Sc)N ferroelectrics are attractive for microelectronics\napplications due to their chemical and epitaxial structural compatibility with\nwurtzite semiconductors such as GaN and (Al,Ga)N. However, the leakage current\nin epitaxial stacks reported to date should be reduced for reliable device\noperation. Following the tradition of other semiconductor heterostructures,\ncrystalline structural quality, as measured by breadth of diffraction peaks and\ncorrelating with dislocation density, is commonly used as a proxy for leakage\ncurrent, but we demonstrate here that the crystalline mosaicity that dominates\nthe broadening of diffraction peaks in epitaxial Al$_{0.7}$Sc$_{0.3}$N stacks\ndoes not dominate leakage current. We report here well-saturated ferroelectric\nhysteresis loops and orders of magnitude lower leakage current (0.07 A\ncm$^{-2}$) compared to values reported in literature (1 ~ 19 A cm$^{-2}$) for\nsputter-deposited epitaxial Al$_{0.7}$Sc$_{0.3}$N/GaN of comparable crystalline\nquality to prior reports. Further, we show Al$_{0.7}$Sc$_{0.3}$N on\nlattice-matched InGaN buffers with improved structural characteristics exhibits\nincreased leakage characteristics. This demonstration and understanding can\nhelp to guide further efforts towards reliable wurtzite ferroelectric devices\nand prioritize approaches targeting further leakage current reduction.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}