{"id":"2407.10079","title":"Synthetic Modelling of Polarized Dust Emission in Intermediate-Mass\n  YSOs: I: Constraining the Role of Iron Inclusions and Inelastic Relaxation on\n  Grain Alignment with ALMA Polarization","authors":"Nguyen Chau Giang, V. J. M. Le Gouellec, Thiem Hoang, A. J. Maury, P.\n  Hennebelle","authorsParsed":[["Giang","Nguyen Chau",""],["Gouellec","V. J. M. Le",""],["Hoang","Thiem",""],["Maury","A. J.",""],["Hennebelle","P.",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 04:58:18 GMT"}],"updateDate":"2024-07-16","timestamp":1720933098000,"abstract":"  Iron inclusions embedded inside dust grains play a crucial role in both\ninternal alignment via Barnett relaxation and external alignment via the\nMAgnetically Enhanced RAdiative Torque (MRAT) mechanism. Moreover, inelastic\nrelaxation is predicted to dominate over Barnett relaxation in driving the\ninternal alignment of micron-sized and very large grains above $10\\mu m$\n(VLGs). Yet, a detailed modeling of polarized thermal dust emission from Class\n0/I Young Stellar Objects (YSOs) taking into account these effects and their\nobservational constraints are still lacking. In this paper, we perform\nsynthetic dust polarization modeling for MHD simulations of an\nintermediate-mass YSOs using our updated POLARIS code developed by Giang et al.\n(2022). Synthetic polarization results are then post-processed with CASA to\nconfront ALMA observations. We found that to reproduce the high polarization\ndegree of $p \\sim 5-30\\%$ observed in protostellar envelopes by ALMA,\nmicron-sized and VLGs must contain iron inclusions with $N_{\\rm cl} \\sim 5 -\n10^{4}$ iron atoms per cluster, assuming $30\\%$ of iron abundance locked inside\ndust grains under the cluster form. Inside the inner $\\sim 500$ au region, it\nrequires inelastic relaxation, larger iron inclusions of $N_{\\rm cl} \\sim\n10^{2}-10^{4}$, and grain growth beyond $\\geq 10\\mu m$ to reproduce $\\sim\n3-10\\%$ of polarization observed by ALMA. But given such a combination, the\ninternal alignment and MRAT efficiency acting on VLGs still decrease toward the\ncenter, which produces the decrease of $p(\\%)$ with increasing gas density,\nreaching $p \\sim 1\\%$ inside the disk. Additionally, our results show that the\nhigh polarization by ALMA toward YSOs is not totally an artifact caused by the\ninterferometric filtering, but it could be explained by the efficient magnetic\nalignment of SPM grains by MRAT mechanism.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}