{"id":"2407.12092","title":"Theory of phonon spectroscopy with the quantum twisting microscope","authors":"Jiewen Xiao, Erez Berg, Leonid I. Glazman, Francisco Guinea, Shahal\n  Ilani, Felix von Oppen","authorsParsed":[["Xiao","Jiewen",""],["Berg","Erez",""],["Glazman","Leonid I.",""],["Guinea","Francisco",""],["Ilani","Shahal",""],["von Oppen","Felix",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 18:00:12 GMT"}],"updateDate":"2024-07-18","timestamp":1721152812000,"abstract":"  We develop a theory of probing phonon modes of van-der-Waals materials using\nthe quantum twisting microscope. While elastic tunneling dominates the\ntunneling current at small twist angles, the momentum mismatch between the\nK-points of tip and sample at large twist angles can only be bridged by\ninelastic scattering. This allows for probing phonon dispersions along certain\nlines in reciprocal space by measuring the tunneling current as a function of\ntwist angle and bias voltage. We illustrate this modality of the quantum\ntwisting microscope by developing a systematic theory for graphene-graphene\njunctions. We show that beyond phonon dispersions, the tunneling current also\nencodes the strength of electron-phonon couplings. Extracting the coupling\nstrengths for individual phonon modes requires careful consideration of various\ninelastic tunneling processes. These processes are associated with the\nintralayer and interlayer electron-phonon couplings and appear at different\norders in a perturbative calculation of the tunneling current. We find that the\ndominant process depends on the particular phonon mode under consideration. Our\nresults inform the quest to understand the origin of superconductivity in\ntwisted bilayer graphene and provide a case study for\nquantum-twisting-microscope investigations of collective modes.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}