{"id":"2407.03742","title":"Projections of the uncertainty on the compact binary population\n  background using popstock","authors":"Arianna I. Renzini and Jacob Golomb","authorsParsed":[["Renzini","Arianna I.",""],["Golomb","Jacob",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 08:54:00 GMT"}],"updateDate":"2024-07-08","timestamp":1720083240000,"abstract":"  The LIGO-Virgo-KAGRA collaboration has announced the detection of almost 100\nbinary black holes so far, which have been used in several studies to infer the\nfeatures of the underlying binary black hole population. From these, it is\npossible to predict the overall gravitational-wave (GW) fractional energy\ndensity contributed by black holes throughout the Universe, and thus estimate\nthe gravitational-wave background (GWB) spectrum emitted in the current GW\ndetector band. These predictions are fundamental in our forecasts for\nbackground detection and characterization, with both present and future\ninstruments. The uncertainties in the inferred population strongly impact the\npredicted energy spectrum, and in this paper we present a new, flexible method\nto quickly calculate the energy spectrum for varying black hole population\nfeatures such as the mass spectrum and redshift distribution. We implement this\nmethod in an open-access package, popstock, and extensively test its\ncapabilities. Using popstock, we investigate how uncertainties in these\ndistributions impact our detection capabilities and present several caveats for\nbackground estimation. In particular, we find that the standard assumption that\nthe background signal follows a 2/3 power-law at low frequencies is both\nwaveform and mass-model dependent, and that the signal power-law is likely\nshallower than previously modelled, given the current waveform and population\nknowledge.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}