{"id":"2407.13475","title":"Double Etch Method for the Fabrication of Nanophotonic Devices from Van\n  der Waals Materials","authors":"Otto Cranwell Schaeper, Lesley Spencer, Dominic Scognamiglio, Waleed\n  El-Sayed, Benjamin Whitefield, Jake Horder, Nathan Coste, Paul Barclay, Milos\n  Toth, Anastasiia Zalogina, and Igor Aharonovich","authorsParsed":[["Schaeper","Otto Cranwell",""],["Spencer","Lesley",""],["Scognamiglio","Dominic",""],["El-Sayed","Waleed",""],["Whitefield","Benjamin",""],["Horder","Jake",""],["Coste","Nathan",""],["Barclay","Paul",""],["Toth","Milos",""],["Zalogina","Anastasiia",""],["Aharonovich","Igor",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 12:50:52 GMT"}],"updateDate":"2024-07-19","timestamp":1721307052000,"abstract":"  The integration of van der Waals (vdW) materials into photonic devices has\nlaid out a foundation for many new quantum and optoelectronic applications.\nDespite tremendous progress in the nanofabrication of photonic building blocks\nfrom vdW crystals, there are still limitations, specifically with large-area\ndevices and masking. Here, we focus on hexagonal boron nitride (hBN) as a vdW\nmaterial and present a double etch method that overcomes problems associated\nwith methods that employ metallic films and resist-based films for masking.\nEfficacy of the developed protocol is demonstrated by designing and fabricating\na set of functional photonic components including waveguides, ring resonators\nand photonic crystal cavities. The functionality of the fabricated structures\nis demonstrated through optical characterization over several key spectral\nranges. These include the near-infrared and blue ranges, where the hBN boron\nvacancy (VB-) spin defects and the coherent B center quantum emitters emit,\nrespectively. The double etch method enables fabrication of high-quality factor\noptical cavities and constitutes a promising pathway toward on-chip integration\nof vdW materials.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}