{"id":"2407.15762","title":"Conditioned Language Policy: A General Framework for Steerable\n  Multi-Objective Finetuning","authors":"Kaiwen Wang, Rahul Kidambi, Ryan Sullivan, Alekh Agarwal, Christoph\n  Dann, Andrea Michi, Marco Gelmi, Yunxuan Li, Raghav Gupta, Avinava Dubey,\n  Alexandre Ram\\'e, Johan Ferret, Geoffrey Cideron, Le Hou, Hongkun Yu, Amr\n  Ahmed, Aranyak Mehta, L\\'eonard Hussenot, Olivier Bachem, Edouard Leurent","authorsParsed":[["Wang","Kaiwen",""],["Kidambi","Rahul",""],["Sullivan","Ryan",""],["Agarwal","Alekh",""],["Dann","Christoph",""],["Michi","Andrea",""],["Gelmi","Marco",""],["Li","Yunxuan",""],["Gupta","Raghav",""],["Dubey","Avinava",""],["Ramé","Alexandre",""],["Ferret","Johan",""],["Cideron","Geoffrey",""],["Hou","Le",""],["Yu","Hongkun",""],["Ahmed","Amr",""],["Mehta","Aranyak",""],["Hussenot","Léonard",""],["Bachem","Olivier",""],["Leurent","Edouard",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 16:13:38 GMT"}],"updateDate":"2024-07-23","timestamp":1721664818000,"abstract":"  Reward-based finetuning is crucial for aligning language policies with\nintended behaviors (e.g., creativity and safety). A key challenge here is to\ndevelop steerable language models that trade-off multiple (conflicting)\nobjectives in a flexible and efficient manner. This paper presents Conditioned\nLanguage Policy (CLP), a general framework for finetuning language models on\nmultiple objectives. Building on techniques from multi-task training and\nparameter-efficient finetuning, CLP can learn steerable models that effectively\ntrade-off conflicting objectives at inference time. Notably, this does not\nrequire training or maintaining multiple models to achieve different trade-offs\nbetween the objectives. Through an extensive set of experiments and ablations,\nwe show that the CLP framework learns steerable models that outperform and\nPareto-dominate the current state-of-the-art approaches for multi-objective\nfinetuning.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}