{"id":"2407.18359","title":"Toward ultra-efficient high-fidelity prediction of bed morphodynamics of\n  large-scale meandering rivers using a novel LES-trained machine learning\n  approach","authors":"Zexia Zhang, Mehrshad Gholami Anjiraki, Hossein Seyedzadeh, Fotis\n  Sotiropoulos, and Ali Khosronejad","authorsParsed":[["Zhang","Zexia",""],["Anjiraki","Mehrshad Gholami",""],["Seyedzadeh","Hossein",""],["Sotiropoulos","Fotis",""],["Khosronejad","Ali",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 19:49:19 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 14:56:24 GMT"}],"updateDate":"2024-08-02","timestamp":1721936959000,"abstract":"  Flood-induced deformation of the bed topography of fluvial meandering rivers\ncould lead to river bank displacement, structural failure of the\ninfrastructures, and the propagation of scour or deposition features. The\nassessment of sediment transport in large-scale meanders is, therefore, a key\nenvironmental issue. High-fidelity numerical models provide powerful tools for\nsuch assessments. However, high-fidelity simulations of large-scale rivers\nusing the coupled flow and morphodynamics modules can be computationally\nexpensive, owing to the costly two-way coupling between turbulence and bed\nmorphodynamics. This study seeks to present a novel machine learning approach,\nwhich is trained using coupled large-eddy simulation (LES) and morphodynamics\nresults. The proposed machine learning approach predicts bed shear stress and\nequilibrium bed morphology of large-scale meanders under bankfull flow\nconditions at a fraction of the cost of coupled LES-morphodynamics. We\ndeveloped and evaluated the performance of a convolutional neural network\nautoencoder (CNNAE) algorithm to generate high-fidelity bed shear stress and\nequilibrium morphology of large-scale meandering rivers. The CNNAE algorithm\nutilizes instantaneous shear stress distribution and change of bed elevation of\nhigh-fidelity simulation results, along with geometric parameters of meanders\nas inputs to predict mean bed shear stress distribution and equilibrium bed\nelevation of rivers. The results demonstrated the feasibility, accuracy, and\nefficiency of the proposed CNNAE algorithm.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"8Dl-MiYlHfokPKifntvSn7Ye-lSzFwsqnxiGypOF9Dg","pdfSize":"3684669"}
