{"id":"2407.11205","title":"Impact on clinical guideline adherence of Orient-COVID, a CDSS based on\n  dynamic medical decision trees for COVID19 management: a randomized\n  simulation trial","authors":"Mouin Jammal, Antoine Saab, Cynthia Abi Khalil, Charbel Mourad, Rosy\n  Tsopra, Melody Saikali, Jean-Baptiste Lamy","authorsParsed":[["Jammal","Mouin",""],["Saab","Antoine",""],["Khalil","Cynthia Abi",""],["Mourad","Charbel",""],["Tsopra","Rosy",""],["Saikali","Melody",""],["Lamy","Jean-Baptiste",""]],"versions":[{"version":"v1","created":"Fri, 21 Jun 2024 11:50:50 GMT"}],"updateDate":"2024-07-17","timestamp":1718970650000,"abstract":"  Background: The adherence of clinicians to clinical practice guidelines is\nknown to be low, including for the management of COVID-19, due to their\ndifficult use at the point of care and their complexity. Clinical decision\nsupport systems have been proposed to implement guidelines and improve\nadherence. One approach is to permit the navigation inside the recommendations,\npresented as a decision tree, but the size of the tree often limits this\napproach and may cause erroneous navigation, especially when it does not fit in\na single screen. Methods: We proposed an innovative visual interface to allow\nclinicians easily navigating inside decision trees for the management of\nCOVID-19 patients. It associates a multi-path tree model with the use of the\nfisheye visual technique, allowing the visualization of large decision trees in\na single screen. To evaluate the impact of this tool on guideline adherence, we\nconducted a randomized controlled trial in a near-real simulation setting,\ncomparing the decisions taken by medical students using Orient-COVID with those\ntaken with paper guidelines or without guidance, when performing on six\nrealistic clinical cases. Results: The results show that paper guidelines had\nno impact (p=0.97), while Orient-COVID significantly improved the guideline\nadherence compared to both other groups (p<0.0003). A significant impact of\nOrient-COVID was identified on several key points during the management of\nCOVID-19: ordering troponin lab tests, prescribing anticoagulant and oxygen\ntherapy. A multifactor analysis showed no difference between male and female\nparticipants. Conclusions: The use of an interactive decision tree for the\nmanagement of COVID-19 significantly improved the clinician adherence to\nguidelines. Future works will focus on the integration of the system to\nelectronic health records and on the adaptation of the system to other clinical\nconditions.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Y4sn6mDyItLXlZk_QaDaFIaPQrCNeEJOwA8gq9jdw_c","pdfSize":"543127"}
