{"id":"2407.15636","title":"On-the-fly spectral unmixing based on Kalman filtering","authors":"Hugues Kouakou, Jos\\'e Henrique de Morais Goulart, Raffaele Vitale,\n  Thomas Oberlin, David Rousseau, Cyril Ruckebusch, Nicolas Dobigeon","authorsParsed":[["Kouakou","Hugues",""],["Goulart","José Henrique de Morais",""],["Vitale","Raffaele",""],["Oberlin","Thomas",""],["Rousseau","David",""],["Ruckebusch","Cyril",""],["Dobigeon","Nicolas",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 13:49:55 GMT"}],"updateDate":"2024-07-23","timestamp":1721656195000,"abstract":"  This work introduces an on-the-fly (i.e., online) linear unmixing method\nwhich is able to sequentially analyze spectral data acquired on a\nspectrum-by-spectrum basis. After deriving a sequential counterpart of the\nconventional linear mixing model, the proposed approach recasts the linear\nunmixing problem into a linear state-space estimation framework. Under Gaussian\nnoise and state models, the estimation of the pure spectra can be efficiently\nconducted by resorting to Kalman filtering. Interestingly, it is shown that\nthis Kalman filter can operate in a lower-dimensional subspace while ensuring\nthe nonnegativity constraint inherent to pure spectra. This dimensionality\nreduction allows significantly lightening the computational burden, while\nleveraging recent advances related to the representation of essential spectral\ninformation. The proposed method is evaluated through extensive numerical\nexperiments conducted on synthetic and real Raman data sets. The results show\nthat this Kalman filter-based method offers a convenient trade-off between\nunmixing accuracy and computational efficiency, which is crucial for operating\nin an on-the-fly setting. To the best of the authors' knowledge, this is the\nfirst operational method which is able to solve the spectral unmixing problem\nefficiently in a dynamic fashion. It also constitutes a valuable building block\nfor benefiting from acquisition and processing frameworks recently proposed in\nthe microscopy literature, which are motivated by practical issues such as\nreducing acquisition time and avoiding potential damages being inflicted to\nphotosensitive samples.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Physics/Chemical Physics","Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}