{"id":"2407.00594","title":"Major merger fraction along the massive galaxy quenching channel at\n  0.2$<z<$0.7","authors":"Shin Inoue (1), Kouji Ohta (1), Yoshihisa Asada (1 and 2), Marcin\n  Sawicki (1 and 2), Guillaume Desprez (2), Stephen Gwyn (3), Vincent Picouet\n  (4) ((1) Department of Astronomy, Kyoto University, Japan (2) Department of\n  Astronomy and Physics and Institute for Computational Astrophysics, Saint\n  Mary's University, Canada (3) NRC-Herzberg, Canada (4) Cahill Center for\n  Astrophysics, California Institute of Technology, USA)","authorsParsed":[["Inoue","Shin","","1 and 2"],["Ohta","Kouji","","1 and 2"],["Asada","Yoshihisa","","1 and 2"],["Sawicki","Marcin","","1 and 2"],["Desprez","Guillaume",""],["Gwyn","Stephen",""],["Picouet","Vincent",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 05:27:40 GMT"}],"updateDate":"2024-07-02","timestamp":1719725260000,"abstract":"  We study the major merger fraction along the massive galaxy quenching channel\n(traced with rest-frame $\\mathrm{NUV}-r$ color) at $z=$ 0.2-0.7, aiming to\nexamine the Cosmic Web Detachment (CWD) scenario of galaxy quenching. In this\nscenario, the major merger fraction is expected to be high in green valley\ngalaxies as compared with those in star-forming and quiescent galaxies of\nsimilar stellar mass. We used photometry in the E-COSMOS field to select 1491\n(2334) massive ($M_\\ast>10^{9.5}$ $M_\\odot$) galaxies with $m_i<22$ mag\n($m_z<22$ mag) at $z=$ 0.2-0.4 ($z=$ 0.4-0.7) in the rest-frame color range of\n$0.8<r-K_s<1.3$. We define a major galaxy-galaxy merger as a galaxy pair of\ncomparable angular size and luminosity with tidal tails or bridges, and we\nidentified such major mergers through visual inspection of Subaru-HSC-SSP PDR 2\n$i$- and $z$-band images. We classify 92 (123) galaxies as major merger\ngalaxies at $z=$ 0.2-0.4 ($z=$ 0.4-0.7). The resulting major merger fraction is\n5%-6% and this fraction does not change with galaxy color along the massive\ngalaxy quenching channel. The result is not consistent with the expectation\nbased of CWD scenario as the dominant mechanism of massive galaxy quenching.\nHowever, there are some caveats such as (i) the mergers that cause quenching\nmay lose their visible merger signatures rapidly before they enter the Green\nValley, (ii) our method may not trace the cosmic web sufficiently well, and\n(iii) because of our mass limit, most of the galaxies in our sample may have\nalready experienced CWD events at higher redshifts than those studied here.\nFurther studies with deeper data are desirable in the future.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}