{"id":"2407.13907","title":"Conformity to continuous and discrete ordinal traits","authors":"Elisa Heinrich Mora, Kaleda K. Denton, Michael E. Palmer, Marcus W.\n  Feldman","authorsParsed":[["Mora","Elisa Heinrich",""],["Denton","Kaleda K.",""],["Palmer","Michael E.",""],["Feldman","Marcus W.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 21:44:09 GMT"}],"updateDate":"2024-07-22","timestamp":1721339049000,"abstract":"  Models of conformity and anti-conformity have typically focused on cultural\ntraits with nominal (unordered) variants, such as baby names, strategies\n(cooperate/defect), or the presence/absence of an innovation. There have been\nfewer studies of conformity to \"ordinal\" cultural traits with ordered variants,\nsuch as level of cooperation (low to high) or fraction of time spent on a task\n(0 to 1). In these latter studies, conformity is conceptualized as a preference\nfor the mean trait value in a population even if no members of the population\nhave variants near this mean; e.g., 50% of the population has variant 0 and 50%\nhas variant 1, producing a mean of 0.5. Here, we introduce models of conformity\nto ordinal traits, which can be either discrete or continuous and linear (with\nminimum and maximum values) or circular (without boundaries). In these models,\nconformists prefer to adopt more popular cultural variants, even if these\nvariants are far from the population mean. To measure a variant's \"popularity\"\nin cases where no two individuals share precisely the same variant on a\ncontinuum, we introduce a metric called $k$-dispersal; this takes into account\na variant's distance to its $k$ closest neighbors, with more \"popular\" variants\nhaving lower distances to their neighbors. We demonstrate through simulations\nthat conformity to ordinal traits need not produce a homogeneous population, as\nhas previously been claimed. Under some combinations of parameter values,\nconformity sustains substantial trait variation over many generations.\nAnti-conformist transmission may produce high levels of polarization.\n","subjects":["Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}