{"id":"2407.05235","title":"Tracking Reflected Objects: A Benchmark","authors":"Xiaoyu Guo, Pengzhi Zhong, Lizhi Lin, Hao Zhang, Ling Huang, Shuiwang\n  Li","authorsParsed":[["Guo","Xiaoyu",""],["Zhong","Pengzhi",""],["Lin","Lizhi",""],["Zhang","Hao",""],["Huang","Ling",""],["Li","Shuiwang",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 02:22:45 GMT"}],"updateDate":"2024-07-09","timestamp":1720318965000,"abstract":"  Visual tracking has advanced significantly in recent years, mainly due to the\navailability of large-scale training datasets. These datasets have enabled the\ndevelopment of numerous algorithms that can track objects with high accuracy\nand robustness.However, the majority of current research has been directed\ntowards tracking generic objects, with less emphasis on more specialized and\nchallenging scenarios. One such challenging scenario involves tracking\nreflected objects. Reflections can significantly distort the appearance of\nobjects, creating ambiguous visual cues that complicate the tracking process.\nThis issue is particularly pertinent in applications such as autonomous\ndriving, security, smart homes, and industrial production, where accurately\ntracking objects reflected in surfaces like mirrors or glass is crucial. To\naddress this gap, we introduce TRO, a benchmark specifically for Tracking\nReflected Objects. TRO includes 200 sequences with around 70,000 frames, each\ncarefully annotated with bounding boxes. This dataset aims to encourage the\ndevelopment of new, accurate methods for tracking reflected objects, which\npresent unique challenges not sufficiently covered by existing benchmarks. We\nevaluated 20 state-of-the-art trackers and found that they struggle with the\ncomplexities of reflections. To provide a stronger baseline, we propose a new\ntracker, HiP-HaTrack, which uses hierarchical features to improve performance,\nsignificantly outperforming existing algorithms. We believe our benchmark,\nevaluation, and HiP-HaTrack will inspire further research and applications in\ntracking reflected objects. The TRO and code are available at\nhttps://github.com/OpenCodeGithub/HIP-HaTrack.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}