{"id":"2407.01275","title":"Quaternion-based Adaptive Backstepping Fast Terminal Sliding Mode\n  Control for Quadrotor UAVs with Finite Time Convergence","authors":"Arezo Shevidi and Hashim A. Hashim","authorsParsed":[["Shevidi","Arezo",""],["Hashim","Hashim A.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:30:37 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 14:15:48 GMT"}],"updateDate":"2024-08-01","timestamp":1719840637000,"abstract":"  This paper proposes a novel quaternion-based approach for tracking the\ntranslation (position and linear velocity) and rotation (attitude and angular\nvelocity) trajectories of underactuated Unmanned Aerial Vehicles (UAVs).\nQuadrotor UAVs are challenging regarding accuracy, singularity, and\nuncertainties issues. Controllers designed based on unit-quaternion are\nsingularity-free for attitude representation compared to other methods (e.g.,\nEuler angles), which fail to represent the vehicle's attitude at multiple\norientations. Quaternion-based Adaptive Backstepping Control (ABC) and Adaptive\nFast Terminal Sliding Mode Control (AFTSMC) are proposed to address a set of\nchallenging problems. A quaternion-based ABC, a superior recursive approach, is\nproposed to generate the necessary thrust handling unknown uncertainties and\nUAV translation trajectory tracking. Next, a quaternion-based AFTSMC is\ndeveloped to overcome parametric uncertainties, avoid singularity, and ensure\nfast convergence in a finite time. Moreover, the proposed AFTSMC is able to\nsignificantly minimize control signal chattering, which is the main reason for\nactuator failure and provide smooth and accurate rotational control input. To\nensure the robustness of the proposed approach, the designed control algorithms\nhave been validated considering unknown time-variant parametric uncertainties\nand significant initialization errors. The proposed techniques has been\ncompared to state-of-the-art control technique. Keywords: Adaptive Backstepping\nControl (ABC), Adaptive Fast Terminal Sliding Mode Control (AFTSMC),\nUnit-quaternion, Unmanned Aerial Vehicles, Singularity Free, Pose Control\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}