{"id":"2407.07526","title":"ler : LVK (LIGO-Virgo-KAGRA collaboration) event (compact-binary\n  mergers) rate calculator and simulator","authors":"Hemantakumar Phurailatpam, Anupreeta More, Harsh Narola, Ng Chung Yin\n  (Leo), Justin Janquart, Chris Van Den Broeck, Otto Akseli Hannuksela, Neha\n  Singh, David Keitel","authorsParsed":[["Phurailatpam","Hemantakumar","","Leo"],["More","Anupreeta","","Leo"],["Narola","Harsh","","Leo"],["Yin","Ng Chung","","Leo"],["Janquart","Justin",""],["Broeck","Chris Van Den",""],["Hannuksela","Otto Akseli",""],["Singh","Neha",""],["Keitel","David",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 10:26:01 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 04:16:00 GMT"}],"updateDate":"2024-07-16","timestamp":1720607161000,"abstract":"  '$ler$' is a statistics-based Python package specifically designed for\ncomputing detectable rates of both lensed and unlensed GW events, catering to\nthe requirements of the LIGO-Virgo-KAGRA Scientific Collaboration and\nastrophysics research scholars. The core functionality of '$ler$' intricately\nhinges upon the interplay of various components which include sampling the\nproperties of compact-binary sources, lens galaxies characteristics, solving\nlens equations to derive properties of resultant images, and computing\ndetectable GW rates. This comprehensive functionality builds on the leveraging\nof array operations and linear algebra from the $numpy$ library, enhanced by\ninterpolation methods from $scipy$ and Python's $multiprocessing$ capabilities.\nEfficiency is further boosted by the $numba$ library's Just-In-Time ($njit$)\ncompilation, optimizing extensive numerical computations and employing the\ninverse transform sampling method to replace more cumbersome rejection\nsampling. The modular design of '$ler$' not only optimizes speed and\nfunctionality but also ensures adaptability and upgradability, supporting the\nintegration of additional statistics as research evolves. Currently, '$ler$' is\nan important tool in generating simulated GW events, both lensed and unlensed,\nand provides astrophysically accurate distributions of event-related parameters\nfor both detectable and non-detectable events. This functionality aids in event\nvalidation and enhances the forecasting of detection capabilities across\nvarious GW detectors to study such events. The architecture of the '$ler$' API\nfacilitates seamless compatibility with other software packages, allowing\nresearchers to integrate and utilize its functionalities based on specific\nscientific requirements.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gDTvLGkRBgelbywHa_SBwYCwwvYixdcehMTXjXJMzHM","pdfSize":"391608"}
