{"id":"2407.03566","title":"Stacked Intelligent Metasurfaces for Wireless Sensing and Communication:\n  Applications and Challenges","authors":"Hao Liu, Jiancheng An, Xing Jia, Shining Lin, Xianghao Yao, Lu Gan,\n  Bruno Clerckx, Chau Yuen, Mehdi Bennis, and M\\'erouane Debbah","authorsParsed":[["Liu","Hao",""],["An","Jiancheng",""],["Jia","Xing",""],["Lin","Shining",""],["Yao","Xianghao",""],["Gan","Lu",""],["Clerckx","Bruno",""],["Yuen","Chau",""],["Bennis","Mehdi",""],["Debbah","Mérouane",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 01:39:52 GMT"}],"updateDate":"2024-07-08","timestamp":1720057192000,"abstract":"  The rapid advancement of wireless communication technologies has precipitated\nan unprecedented demand for high data rates, extremely low latency, and\nubiquitous connectivity. In order to achieve these goals, stacked intelligent\nmetasurfaces (SIM) has been developed as a novel solution to perform advanced\nsignal processing tasks directly in the electromagnetic wave domain, thus\nachieving ultra-fast computing speed and reducing hardware complexity. This\narticle provides an overview of the SIM technology by discussing its hardware\narchitectures, advantages, and potential applications for wireless sensing and\ncommunication. Specifically, we explore the utilization of SIMs in enabling\nwave-domain beamforming, channel modeling and estimation in SIM-assisted\ncommunication systems. Furthermore, we elaborate on the potential of utilizing\na SIM to build a hybrid optical-electronic neural network (HOENN) and\ndemonstrate its efficacy by examining two case studies: disaster monitoring and\ndirection-of-arrival estimation. Finally, we identify key implementation\nchallenges, including practical hardware imperfections, efficient SIM\nconfiguration for realizing wave-domain signal processing, and performance\nanalysis to motivate future research on this important and far-reaching topic.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}