{"id":"2407.14945","title":"Efficient Intrusion Detection: Combining $\\chi^2$ Feature Selection with\n  CNN-BiLSTM on the UNSW-NB15 Dataset","authors":"Mohammed Jouhari, Hafsa Benaddi, Khalil Ibrahimi","authorsParsed":[["Jouhari","Mohammed",""],["Benaddi","Hafsa",""],["Ibrahimi","Khalil",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 17:41:16 GMT"}],"updateDate":"2024-07-23","timestamp":1721497276000,"abstract":"  Intrusion Detection Systems (IDSs) have played a significant role in the\ndetection and prevention of cyber-attacks in traditional computing systems. It\nis not surprising that this technology is now being applied to secure Internet\nof Things (IoT) networks against cyber threats. However, the limited\ncomputational resources available on IoT devices pose a challenge for deploying\nconventional computing-based IDSs. IDSs designed for IoT environments must\ndemonstrate high classification performance, and utilize low-complexity models.\nDeveloping intrusion detection models in the field of IoT has seen significant\nadvancements. However, achieving a balance between high classification\nperformance and reduced complexity remains a challenging endeavor. In this\nresearch, we present an effective IDS model that addresses this issue by\ncombining a lightweight Convolutional Neural Network (CNN) with bidirectional\nLong Short-Term Memory (BiLSTM). Additionally, we employ feature selection\ntechniques to minimize the number of features inputted into the model, thereby\nreducing its complexity. This approach renders the proposed model highly\nsuitable for resource-constrained IoT devices, ensuring it meets their\ncomputation capability requirements. Creating a model that meets the demands of\nIoT devices and attains enhanced precision is a challenging task. However, our\nsuggested model outperforms previous works in the literature by attaining a\nremarkable accuracy rate of 97.90% within a prediction time of 1.1 seconds for\nbinary classification. Furthermore, it achieves an accuracy rate of 97.09%\nwithin a prediction time of 2.10 seconds for multiclassification.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Wp6DWzn2R3ogvLRYhAD4tGtY_qWyC5glma0Mo3P2VHg","pdfSize":"318385","objectId":"0x48bfd28fc4f65e45b4b3f06597e3092bd479409746d213ee8c75d26a690312bc","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
