{"id":"2407.14943","title":"Uncertainty of line-of-sight velocity measurement of faint stars from\n  low and medium resolution optical spectra","authors":"L\\'aszl\\'o Dobos, Alexander S. Szalay, Tam\\'as Budav\\'ari, Evan N.\n  Kirby, Robert H. Lupton, Rosemary F.G. Wyse","authorsParsed":[["Dobos","L치szl칩",""],["Szalay","Alexander S.",""],["Budav치ri","Tam치s",""],["Kirby","Evan N.",""],["Lupton","Robert H.",""],["Wyse","Rosemary F. G.",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 17:31:50 GMT"}],"updateDate":"2024-07-23","timestamp":1721496710000,"abstract":"  Massively multiplexed spectrographs will soon gather large statistical\nsamples of stellar spectra. The accurate estimation of uncertainties on derived\nparameters, such as line-of-sight velocity $v_\\mathrm{los}$, especially for\nspectra with low signal-to-noise ratios, is paramount. We generated an ensemble\nof simulated optical spectra of stars as if they were observed with low- and\nmedium-resolution fiber-fed instruments on an 8-meter class telescope, similar\nto the Subaru Prime Focus Spectrograph, and determined $v_\\mathrm{los}$ by\nfitting stellar templates to the simulations. We compared the empirical errors\nof the derived parameters -- calculated from an ensemble of simulations -- to\nthe asymptotic error determined from the Fisher matrix, as well as from Monte\nCarlo sampling of the posterior probability. We confirm that the uncertainty of\n$v_\\mathrm{los}$ scales with the inverse square root of $S/N$, but also show\nhow this scaling breaks down at low $S/N$ and analyze the error and bias caused\nby template mismatch. We outline a computationally optimized algorithm to fit\nmulti-exposure data and provide the mathematical model of stellar spectrum\nfitting that maximizes the so called significance, which allows for calculating\nthe error from the Fisher matrix analytically. We also introduce the effective\nline count, and provide a scaling relation to estimate the error of\n$v_\\mathrm{los}$ measurement based on the stellar type. Our analysis covers a\nrange of stellar types with parameters that are typical of the Galactic outer\ndisk and halo, together with analogs of stars in M31 and in satellite dwarf\nspheroidal galaxies around the Milky Way.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}