{"id":"2407.14394","title":"TTT: A Temporal Refinement Heuristic for Tenuously Tractable Discrete\n  Time Reachability Problems","authors":"Chelsea Sidrane and Jana Tumova","authorsParsed":[["Sidrane","Chelsea",""],["Tumova","Jana",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:16:25 GMT"}],"updateDate":"2024-07-22","timestamp":1721402185000,"abstract":"  Reachable set computation is an important tool for analyzing control systems.\nSimulating a control system can show that the system is generally functioning\nas desired, but a formal tool like reachability analysis can provide a\nguarantee of correctness. For linear systems, reachability analysis is\nstraightforward and fast, but as more complex components are added to the\ncontrol system such as nonlinear dynamics or a neural network controller,\nreachability analysis may slow down or become overly conservative. To address\nthese challenges, much literature has focused on spatial refinement, e.g.,\ntuning the discretization of the input sets and intermediate reachable sets.\nHowever, this paper addresses a different dimension: temporal refinement. The\nbasic idea of temporal refinement is to automatically choose when along the\nhorizon of the reachability problem to execute slow symbolic queries which\nincur less approximation error versus fast concrete queries which incur more\napproximation error. Temporal refinement can be combined with other refinement\napproaches and offers an additional ``tuning knob'' with which to trade off\ntractability and tightness in approximate reachable set computation. Here, we\nintroduce an automatic framework for performing temporal refinement and we\ndemonstrate the effectiveness of this technique on computing approximate\nreachable sets for nonlinear systems with neural network control policies. We\ndemonstrate the calculation of reachable sets of varying approximation error\nunder varying computational budget and show that our algorithm is able to\ngenerate approximate reachable sets with a similar amount of error to the\nbaseline approach in 20-70% less time.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Logic in Computer Science","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}