{"id":"2407.07985","title":"Rising from the Ashes: How the Milky Way Got Its Scars","authors":"Angus Beane","authorsParsed":[["Beane","Angus",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:34:47 GMT"}],"updateDate":"2024-07-12","timestamp":1720636487000,"abstract":"  The elemental abundance distribution of stars encodes the history of the\ngas-phase abundance in the Milky Way. Without a large, unbiased sample of\nhighly precise stellar ages, the exact timing and nature of this history must\nbe inferred from the abundances. In the two-dimensional plane of\n[alpha/Fe]-[Fe/H], it is now clear that two separate populations exist -- the\nlow-alpha and high-alpha sequences. Structure in the elemental abundance\ndistribution can arise from many processes -- proposals include specific gas\ninfall scenarios, radial migration, high-redshift clump formation, and various\neffects associated with galaxy mergers, among others. In this work, we\ndemonstrate another possible avenue for structure formation with clear\nobservational predictions. In this scenario, the Galaxy underwent a starburst\nfollowed by a brief (hundreds of Myr) quiescent phase -- i.e., the Galaxy\nunderwent a post-starburst rejuvenation sequence at z~2. A natural consequence\nof the quiescent phase is that stars in the valley of the bimodality do not\nform because: (1) the absence of enrichment from high-mass stars leads to a\nrapid reduction in [alpha/Fe], and (2) any time the gas spends in the abundance\nvalley is deemphasized in the present day distribution because the star\nformation rate is lower. With a set of idealized merger simulations, we\ndemonstrate the feasibility of this proposal. This \"phoenix hypothesis\"\npredicts a ~300 Myr gap in stellar ages at a fixed [Fe/H] and that stars which\nform directly after this gap would have lower [alpha/Fe] than stars which form\nslightly (~1 Gyr) later.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}