{"id":"2407.05328","title":"Blind Bistatic Radar Parameter Estimation for AFDM Systems in\n  Doubly-Dispersive Channels","authors":"Kuranage Roche Rayan Ranasinghe, Kengo Ando, Hyeon Seok Rou, Giuseppe\n  Thadeu Freitas de Abreu and Andreas Bathelt","authorsParsed":[["Ranasinghe","Kuranage Roche Rayan",""],["Ando","Kengo",""],["Rou","Hyeon Seok",""],["de Abreu","Giuseppe Thadeu Freitas",""],["Bathelt","Andreas",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 10:49:31 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 10:01:28 GMT"}],"updateDate":"2024-08-29","timestamp":1720349371000,"abstract":"  We propose a novel method for blind bistatic radar parameter estimation\n(RPE), which enables integrated sensing and communications (ISAC) by allowing\npassive (receive) base stations (BSs) to extract radar parameters (ranges and\nvelocities of targets), without requiring knowledge of the information sent by\nan active (transmit) BS to its users. The contributed method is formulated with\nbasis on the covariance of received signals, and under a generalized\ndoubly-dispersive channel model compatible with most of the waveforms typically\nconsidered for ISAC, such as orthogonal frequency division multiplexing (OFDM),\northogonal time frequency space (OTFS) and affine frequency division\nmultiplexing (AFDM). The original non-convex problem, which includes an\n$\\ell_0$-norm regularization term in order to mitigate clutter, is solved not\nby relaxation to an $\\ell_1$-norm, but by introducing an arbitrarily-tight\napproximation then relaxed via fractional programming (FP). Simulation results\nshow that the performance of the proposed method approaches that of an ideal\nsystem with perfect knowledge of the transmit signal covariance with an\nincreasing number of transmit frames.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}