{"id":"2407.19524","title":"VersusDebias: Universal Zero-Shot Debiasing for Text-to-Image Models via\n  SLM-Based Prompt Engineering and Generative Adversary","authors":"Hanjun Luo, Ziye Deng, Haoyu Huang, Xuecheng Liu, Ruizhe Chen, Zuozhu\n  Liu","authorsParsed":[["Luo","Hanjun",""],["Deng","Ziye",""],["Huang","Haoyu",""],["Liu","Xuecheng",""],["Chen","Ruizhe",""],["Liu","Zuozhu",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 16:24:07 GMT"},{"version":"v2","created":"Sat, 3 Aug 2024 14:36:06 GMT"},{"version":"v3","created":"Fri, 16 Aug 2024 06:24:24 GMT"}],"updateDate":"2024-08-19","timestamp":1722183847000,"abstract":"  With the rapid development of Text-to-Image (T2I) models, biases in human\nimage generation against demographic social groups become a significant\nconcern, impacting fairness and ethical standards in AI. Some researchers\npropose their methods to tackle with the issue. However, existing methods are\ndesigned for specific models with fixed prompts, limiting their adaptability to\nthe fast-evolving models and diverse practical scenarios. Moreover, they\nneglect the impact of hallucinations, leading to discrepancies between expected\nand actual results. To address these issues, we introduce VersusDebias, a novel\nand universal debiasing framework for biases in arbitrary T2I models,\nconsisting of an array generation (AG) module and an image generation (IG)\nmodule. The self-adaptive AG module generates specialized attribute arrays to\npost-process hallucinations and debias multiple attributes simultaneously. The\nIG module employs a small language model to modify prompts according to the\narrays and drives the T2I model to generate debiased images, enabling zero-shot\ndebiasing. Extensive experiments demonstrate VersusDebias's capability to\ndebias any models across gender, race, and age simultaneously. In both\nzero-shot and few-shot scenarios, VersusDebias outperforms existing methods,\nshowcasing its exceptional utility. Our work is accessible at\nhttps://github.com/VersusDebias/VersusDebias to ensure reproducibility and\nfacilitate further research.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}