{"id":"2407.17536","title":"Improved symbolic drum style classification with grammar-based\n  hierarchical representations","authors":"L\\'eo G\\'er\\'e (CNAM Paris, CEDRIC - VERTIGO), Philippe Rigaux (CEDRIC\n  - VERTIGO, CNAM Paris), Nicolas Audebert (CEDRIC - VERTIGO, CNAM, IGN,\n  LaSTIG)","authorsParsed":[["Géré","Léo","","CNAM Paris, CEDRIC - VERTIGO"],["Rigaux","Philippe","","CEDRIC\n  - VERTIGO, CNAM Paris"],["Audebert","Nicolas","","CEDRIC - VERTIGO, CNAM, IGN,\n  LaSTIG"]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 07:32:26 GMT"}],"updateDate":"2024-07-26","timestamp":1721806346000,"abstract":"  Deep learning models have become a critical tool for analysis and\nclassification of musical data. These models operate either on the audio\nsignal, e.g. waveform or spectrogram, or on a symbolic representation, such as\nMIDI. In the latter, musical information is often reduced to basic features,\ni.e. durations, pitches and velocities. Most existing works then rely on\ngeneric tokenization strategies from classical natural language processing, or\nmatrix representations, e.g. piano roll. In this work, we evaluate how enriched\nrepresentations of symbolic data can impact deep models, i.e. Transformers and\nRNN, for music style classification. In particular, we examine representations\nthat explicitly incorporate musical information implicitly present in MIDI-like\nencodings, such as rhythmic organization, and show that they outperform generic\ntokenization strategies. We introduce a new tree-based representation of MIDI\ndata built upon a context-free musical grammar. We show that this grammar\nrepresentation accurately encodes high-level rhythmic information and\noutperforms existing encodings on the GrooveMIDI Dataset for drumming style\nclassification, while being more compact and parameter-efficient.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Multimedia","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}