{"id":"2407.13933","title":"Unsupervised Video Highlight Detection by Learning from Audio and Visual\n  Recurrence","authors":"Zahidul Islam, Sujoy Paul, Mrigank Rochan","authorsParsed":[["Islam","Zahidul",""],["Paul","Sujoy",""],["Rochan","Mrigank",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 23:09:14 GMT"}],"updateDate":"2024-07-22","timestamp":1721344154000,"abstract":"  With the exponential growth of video content, the need for automated video\nhighlight detection to extract key moments or highlights from lengthy videos\nhas become increasingly pressing. This technology has the potential to\nsignificantly enhance user experiences by allowing quick access to relevant\ncontent across diverse domains. Existing methods typically rely either on\nexpensive manually labeled frame-level annotations, or on a large external\ndataset of videos for weak supervision through category information. To\novercome this, we focus on unsupervised video highlight detection, eliminating\nthe need for manual annotations. We propose an innovative unsupervised approach\nwhich capitalizes on the premise that significant moments tend to recur across\nmultiple videos of the similar category in both audio and visual modalities.\nSurprisingly, audio remains under-explored, especially in unsupervised\nalgorithms, despite its potential to detect key moments. Through a clustering\ntechnique, we identify pseudo-categories of videos and compute audio\npseudo-highlight scores for each video by measuring the similarities of audio\nfeatures among audio clips of all the videos within each pseudo-category.\nSimilarly, we also compute visual pseudo-highlight scores for each video using\nvisual features. Subsequently, we combine audio and visual pseudo-highlights to\ncreate the audio-visual pseudo ground-truth highlight of each video for\ntraining an audio-visual highlight detection network. Extensive experiments and\nablation studies on three highlight detection benchmarks showcase the superior\nperformance of our method over prior work.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}