{"id":"2407.21294","title":"Decentralized and Uncoordinated Learning of Stable Matchings: A\n  Game-Theoretic Approach","authors":"S. Rasoul Etesami and R. Srikant","authorsParsed":[["Etesami","S. Rasoul",""],["Srikant","R.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 02:36:14 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 02:57:09 GMT"}],"updateDate":"2024-08-16","timestamp":1722393374000,"abstract":"  We consider the problem of learning stable matchings with unknown preferences\nin a decentralized and uncoordinated manner, where \"decentralized\" means that\nplayers make decisions individually without the influence of a central\nplatform, and \"uncoordinated\" means that players do not need to synchronize\ntheir decisions using pre-specified rules. First, we provide a game formulation\nfor this problem with known preferences, where the set of pure Nash equilibria\n(NE) coincides with the set of stable matchings, and mixed NE can be rounded to\na stable matching. Then, we show that for hierarchical markets, applying the\nexponential weight (EXP) learning algorithm to the stable matching game\nachieves logarithmic regret in a fully decentralized and uncoordinated fashion.\nMoreover, we show that EXP converges locally and exponentially fast to a stable\nmatching in general markets. We also introduce another decentralized and\nuncoordinated learning algorithm that globally converges to a stable matching\nwith arbitrarily high probability. Finally, we provide stronger feedback\nconditions under which it is possible to drive the market faster toward an\napproximate stable matching. Our proposed game-theoretic framework bridges the\ndiscrete problem of learning stable matchings with the problem of learning NE\nin continuous-action games.\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Machine Learning","Computing Research Repository/Multiagent Systems","Computing Research Repository/Social and Information Networks","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}