{"id":"2407.10061","title":"InfiniMotion: Mamba Boosts Memory in Transformer for Arbitrary Long\n  Motion Generation","authors":"Zeyu Zhang, Akide Liu, Qi Chen, Feng Chen, Ian Reid, Richard Hartley,\n  Bohan Zhuang, Hao Tang","authorsParsed":[["Zhang","Zeyu",""],["Liu","Akide",""],["Chen","Qi",""],["Chen","Feng",""],["Reid","Ian",""],["Hartley","Richard",""],["Zhuang","Bohan",""],["Tang","Hao",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 03:12:19 GMT"}],"updateDate":"2024-07-16","timestamp":1720926739000,"abstract":"  Text-to-motion generation holds potential for film, gaming, and robotics, yet\ncurrent methods often prioritize short motion generation, making it challenging\nto produce long motion sequences effectively: (1) Current methods struggle to\nhandle long motion sequences as a single input due to prohibitively high\ncomputational cost; (2) Breaking down the generation of long motion sequences\ninto shorter segments can result in inconsistent transitions and requires\ninterpolation or inpainting, which lacks entire sequence modeling. To solve\nthese challenges, we propose InfiniMotion, a method that generates continuous\nmotion sequences of arbitrary length within an autoregressive framework. We\nhighlight its groundbreaking capability by generating a continuous 1-hour human\nmotion with around 80,000 frames. Specifically, we introduce the Motion Memory\nTransformer with Bidirectional Mamba Memory, enhancing the transformer's memory\nto process long motion sequences effectively without overwhelming computational\nresources. Notably our method achieves over 30% improvement in FID and 6 times\nlonger demonstration compared to previous state-of-the-art methods, showcasing\nsignificant advancements in long motion generation. See project webpage:\nhttps://steve-zeyu-zhang.github.io/InfiniMotion/\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"8RpNuRB2sDLWHi-bPUt1K167wzy3RGHSFTjLr7rzbOE","pdfSize":"2267214"}
