{"id":"2407.13007","title":"MagAO-X: Commissioning Results and Status of Ongoing Upgrades","authors":"Jared R. Males, Laird M. Close, Sebastiaan Y. Haffert, Maggie Y.\n  Kautz, Jay Kueny, Joseph D. Long, Eden McEwen, Noah Swimmer, John I. Bailey\n  III, Warren Foster, Benjamin A. Mazin, Logan Pearce, Joshua Liberman, Katie\n  Twitchell, Alycia J. Weinberger, Olivier Guyon, Alexander D. Hedglen, Avalon\n  McLeod, Roz Roberts, Kyle Van Gorkom, Jialin Li, Isabella Doty, Victor Gasho","authorsParsed":[["Males","Jared R.",""],["Close","Laird M.",""],["Haffert","Sebastiaan Y.",""],["Kautz","Maggie Y.",""],["Kueny","Jay",""],["Long","Joseph D.",""],["McEwen","Eden",""],["Swimmer","Noah",""],["Bailey","John I.","III"],["Foster","Warren",""],["Mazin","Benjamin A.",""],["Pearce","Logan",""],["Liberman","Joshua",""],["Twitchell","Katie",""],["Weinberger","Alycia J.",""],["Guyon","Olivier",""],["Hedglen","Alexander D.",""],["McLeod","Avalon",""],["Roberts","Roz",""],["Van Gorkom","Kyle",""],["Li","Jialin",""],["Doty","Isabella",""],["Gasho","Victor",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 20:57:37 GMT"}],"updateDate":"2024-07-19","timestamp":1721249857000,"abstract":"  MagAO-X is the coronagraphic extreme adaptive optics system for the 6.5 m\nMagellan Clay Telescope. We report the results of commissioning the first phase\nof MagAO-X. Components now available for routine observations include: the >2\nkHz high-order control loop consisting of a 97 actuator woofer deformable\nmirror (DM), a 2040 actuator tweeter DM, and a modulated pyramid wavefront\nsensor (WFS); classical Lyot coronagraphs with integrated low-order (LO) WFS\nand control using a third 97-actuator non-common path correcting (NCPC) DM;\nbroad band imaging in g, r, i, and z filters with two EMCCDs; simultaneous\ndifferential imaging in H-alpha; and integral field spectroscopy with the VIS-X\nmodule. Early science results include the discovery of an H-alpha jet, images\nof accreting protoplanets at H-alpha, images of young extrasolar giant planets\nin the optical, discovery of new white dwarf companions, resolved images of\nevolved stars, and high-contrast images of circumstellar disks in scattered\nlight in g-band (500 nm). We have commenced an upgrade program, called \"Phase\nII\", to enable high-contrast observations at the smallest inner working angles\npossible. These upgrades include a new 952 actuator NCPC DM to enable\ncoronagraphic wavefront control; phase induced amplitude apodization\ncoronagraphs; new fast cameras for LOWFS and Lyot-LOWFS; and real-time computer\nupgrades. We will report the status of these upgrades and results of first\non-sky testing in March-May 2024.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}