{"id":"2407.05224","title":"On the importance of learning non-local dynamics for stable data-driven\n  climate modeling: A 1D gravity wave-QBO testbed","authors":"Hamid A. Pahlavan, Pedram Hassanzadeh, M. Joan Alexander","authorsParsed":[["Pahlavan","Hamid A.",""],["Hassanzadeh","Pedram",""],["Alexander","M. Joan",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 01:15:52 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 00:58:41 GMT"}],"updateDate":"2024-07-17","timestamp":1720314952000,"abstract":"  Machine learning (ML) techniques, especially neural networks (NNs), have\nshown promise in learning subgrid-scale parameterizations for climate models.\nHowever, a major problem with data-driven parameterizations, particularly those\nlearned with supervised algorithms, is model instability. Current remedies are\noften ad-hoc and lack a theoretical foundation. Here, we combine ML theory and\nclimate physics to address a source of instability in NN-based\nparameterization. We demonstrate the importance of learning spatially\n$\\textit{non-local}$ dynamics using a 1D model of the quasi-biennial\noscillation (QBO) with gravity wave (GW) parameterization as a testbed. While\ncommon offline metrics fail to identify shortcomings in learning non-local\ndynamics, we show that the concept of receptive field (RF) can identify\ninstability a-priori. We find that NN-based parameterizations that seem to\naccurately predict GW forcings from wind profiles ($\\mathbf{R^2 \\approx 0.99}$)\ncause unstable simulations when RF is too small to capture the non-local\ndynamics, while NNs of the same size but large-enough RF are stable. We examine\nthree broad classes of architectures, namely convolutional NNs, Fourier neural\noperators, and fully-connected NNs; the latter two have inherently large RFs.\nWe also demonstrate that learning non-local dynamics is crucial for the\nstability and accuracy of a data-driven spatiotemporal emulator of the zonal\nwind field. Given the ubiquity of non-local dynamics in the climate system, we\nexpect the use of effective RF, which can be computed for any NN architecture,\nto be important for many applications. This work highlights the necessity of\nintegrating ML theory with physics to design and analyze data-driven algorithms\nfor weather and climate modeling.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}