{"id":"2407.19729","title":"Cross-variable amplitude-frequency coupling during intermittency in a\n  turbulent thermoacoustic system","authors":"Shruti Tandon, Aswin Balaji, Rohit Radhakrishnan, Manikandan\n  Raghunathan, Gaurav Chopra and R. I. Sujith","authorsParsed":[["Tandon","Shruti",""],["Balaji","Aswin",""],["Radhakrishnan","Rohit",""],["Raghunathan","Manikandan",""],["Chopra","Gaurav",""],["Sujith","R. I.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 06:26:36 GMT"}],"updateDate":"2024-07-30","timestamp":1722234396000,"abstract":"  We investigate flame-acoustic interactions in a turbulent combustor during\nthe state of intermittency before the onset of thermoacoustic instability using\ncomplex networks. Experiments are performed in a turbulent bluff-body\nstabilized dump combustor where the inlet airflow rate is varied (a)\nquasi-statically and (b) continuously. We construct a natural visibility graph\nfrom the local heat release rate fluctuations at each location. Comparing the\naverage degree during epochs of high- and low-amplitude acoustic pressure\noscillations (p') during the state of intermittency, we detect frequency\nmodulation in heat release rate fluctuations. Through this approach, we\ndiscover unique spatial patterns of cross-variable coupling between the\nfrequency of heat release rate fluctuations and amplitude of p'. The frequency\nof local heat release rate fluctuations increases in regions of flame anchoring\nowing to high-frequency excitation of the flow and flame during epochs of\nhigh-amplitude p' dynamics. On the other hand, the frequency of heat release\nrate fluctuations decreases in regions associated with flame front distortions\nby large coherent vortices. In experiments with continuously varying airflow\nrates, the spatial pattern of frequency modulation varies with an increase in\nthe average amplitude of p' owing to an increase in the epochs of periodic p'\ndynamics and the size of vortices forming in the flow. Moreover, we discover\nthat the frequency of heat release rate fluctuations decreases even in regions\nof flame anchoring when very large coherent structures are shed in the flow,\ncausing dynamic shifts in the location of flame anchoring. Our analysis thus\nreveals and explains rich spatial patterns of flame-acoustic interactions in\nturbulent reacting flows.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}