{"id":"2407.13251","title":"Motif-Consistent Counterfactuals with Adversarial Refinement for\n  Graph-Level Anomaly Detection","authors":"Chunjing Xiao, Shikang Pang, Wenxin Tai, Yanlong Huang, Goce\n  Trajcevski, Fan Zhou","authorsParsed":[["Xiao","Chunjing",""],["Pang","Shikang",""],["Tai","Wenxin",""],["Huang","Yanlong",""],["Trajcevski","Goce",""],["Zhou","Fan",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:04:57 GMT"}],"updateDate":"2024-07-19","timestamp":1721289897000,"abstract":"  Graph-level anomaly detection is significant in diverse domains. To improve\ndetection performance, counterfactual graphs have been exploited to benefit the\ngeneralization capacity by learning causal relations. Most existing studies\ndirectly introduce perturbations (e.g., flipping edges) to generate\ncounterfactual graphs, which are prone to alter the semantics of generated\nexamples and make them off the data manifold, resulting in sub-optimal\nperformance. To address these issues, we propose a novel approach,\nMotif-consistent Counterfactuals with Adversarial Refinement (MotifCAR), for\ngraph-level anomaly detection. The model combines the motif of one graph, the\ncore subgraph containing the identification (category) information, and the\ncontextual subgraph (non-motif) of another graph to produce a raw\ncounterfactual graph. However, the produced raw graph might be distorted and\ncannot satisfy the important counterfactual properties: Realism, Validity,\nProximity and Sparsity. Towards that, we present a Generative Adversarial\nNetwork (GAN)-based graph optimizer to refine the raw counterfactual graphs. It\nadopts the discriminator to guide the generator to generate graphs close to\nrealistic data, i.e., meet the property Realism. Further, we design the motif\nconsistency to force the motif of the generated graphs to be consistent with\nthe realistic graphs, meeting the property Validity. Also, we devise the\ncontextual loss and connection loss to control the contextual subgraph and the\nnewly added links to meet the properties Proximity and Sparsity. As a result,\nthe model can generate high-quality counterfactual graphs. Experiments\ndemonstrate the superiority of MotifCAR.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}