{"id":"2407.12622","title":"Rethinking the Architecture Design for Efficient Generic Event Boundary\n  Detection","authors":"Ziwei Zheng, Zechuan Zhang, Yulin Wang, Shiji Song, Gao Huang, Le Yang","authorsParsed":[["Zheng","Ziwei",""],["Zhang","Zechuan",""],["Wang","Yulin",""],["Song","Shiji",""],["Huang","Gao",""],["Yang","Le",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:49:54 GMT"}],"updateDate":"2024-07-18","timestamp":1721227794000,"abstract":"  Generic event boundary detection (GEBD), inspired by human visual cognitive\nbehaviors of consistently segmenting videos into meaningful temporal chunks,\nfinds utility in various applications such as video editing and. In this paper,\nwe demonstrate that SOTA GEBD models often prioritize final performance over\nmodel complexity, resulting in low inference speed and hindering efficient\ndeployment in real-world scenarios. We contribute to addressing this challenge\nby experimentally reexamining the architecture of GEBD models and uncovering\nseveral surprising findings. Firstly, we reveal that a concise GEBD baseline\nmodel already achieves promising performance without any sophisticated design.\nSecondly, we find that the widely applied image-domain backbones in GEBD models\ncan contain plenty of architecture redundancy, motivating us to gradually\n``modernize'' each component to enhance efficiency. Thirdly, we show that the\nGEBD models using image-domain backbones conducting the spatiotemporal learning\nin a spatial-then-temporal greedy manner can suffer from a distraction issue,\nwhich might be the inefficient villain for GEBD. Using a video-domain backbone\nto jointly conduct spatiotemporal modeling is an effective solution for this\nissue. The outcome of our exploration is a family of GEBD models, named\nEfficientGEBD, significantly outperforms the previous SOTA methods by up to\n1.7\\% performance gain and 280\\% speedup under the same backbone. Our research\nprompts the community to design modern GEBD methods with the consideration of\nmodel complexity, particularly in resource-aware applications. The code is\navailable at \\url{https://github.com/Ziwei-Zheng/EfficientGEBD}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}