{"id":"2407.03863","title":"Unsupervised Analysis of Alzheimer's Disease Signatures using 3D\n  Deformable Autoencoders","authors":"Mehmet Yigit Avci, Emily Chan, Veronika Zimmer, Daniel Rueckert,\n  Benedikt Wiestler, Julia A. Schnabel, Cosmin I. Bercea","authorsParsed":[["Avci","Mehmet Yigit",""],["Chan","Emily",""],["Zimmer","Veronika",""],["Rueckert","Daniel",""],["Wiestler","Benedikt",""],["Schnabel","Julia A.",""],["Bercea","Cosmin I.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 11:52:44 GMT"}],"updateDate":"2024-07-08","timestamp":1720093964000,"abstract":"  With the increasing incidence of neurodegenerative diseases such as\nAlzheimer's Disease (AD), there is a need for further research that enhances\ndetection and monitoring of the diseases. We present MORPHADE (Morphological\nAutoencoders for Alzheimer's Disease Detection), a novel unsupervised learning\napproach which uses deformations to allow the analysis of 3D T1-weighted brain\nimages. To the best of our knowledge, this is the first use of deformations\nwith deep unsupervised learning to not only detect, but also localize and\nassess the severity of structural changes in the brain due to AD. We obtain\nmarkedly higher anomaly scores in clinically important areas of the brain in\nsubjects with AD compared to healthy controls, showcasing that our method is\nable to effectively locate AD-related atrophy. We additionally observe a visual\ncorrelation between the severity of atrophy highlighted in our anomaly maps and\nmedial temporal lobe atrophy scores evaluated by a clinical expert. Finally,\nour method achieves an AUROC of 0.80 in detecting AD, out-performing several\nsupervised and unsupervised baselines. We believe our framework shows promise\nas a tool towards improved understanding, monitoring and detection of AD. To\nsupport further research and application, we have made our code publicly\navailable at github.com/ci-ber/MORPHADE.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cRUaKkdD1sqw2qTOVPFFCSXHyLPGrlgZxVuAXMaF-x0","pdfSize":"31768154"}
