{"id":"2407.18606","title":"A data balancing approach towards design of an expert system for Heart\n  Disease Prediction","authors":"Rahul Karmakar, Udita Ghosh, Arpita Pal, Sattwiki Dey, Debraj Malik,\n  Priyabrata Sain","authorsParsed":[["Karmakar","Rahul",""],["Ghosh","Udita",""],["Pal","Arpita",""],["Dey","Sattwiki",""],["Malik","Debraj",""],["Sain","Priyabrata",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 08:56:13 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 10:22:00 GMT"}],"updateDate":"2024-07-30","timestamp":1721984173000,"abstract":"  Heart disease is a serious global health issue that claims millions of lives\nevery year. Early detection and precise prediction are critical to the\nprevention and successful treatment of heart related issues. A lot of research\nutilizes machine learning (ML) models to forecast cardiac disease and obtain\nearly detection. In order to do predictive analysis on \"Heart disease health\nindicators \" dataset. We employed five machine learning methods in this paper:\nDecision Tree (DT), Random Forest (RF), Linear Discriminant Analysis, Extra\nTree Classifier, and AdaBoost. The model is further examined using various\nfeature selection (FS) techniques. To enhance the baseline model, we have\nseparately applied four FS techniques: Sequential Forward FS, Sequential\nBackward FS, Correlation Matrix, and Chi2. Lastly, K means SMOTE oversampling\nis applied to the models to enable additional analysis. The findings show that\nwhen it came to predicting heart disease, ensemble approaches in particular,\nrandom forests performed better than individual classifiers. The presence of\nsmoking, blood pressure, cholesterol, and physical inactivity were among the\nmajor predictors that were found. The accuracy of the Random Forest and\nDecision Tree model was 99.83%. This paper demonstrates how machine learning\nmodels can improve the accuracy of heart disease prediction, especially when\nusing ensemble methodologies. The models provide a more accurate risk\nassessment than traditional methods since they incorporate a large number of\nfactors and complex algorithms.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}