{"id":"2407.19073","title":"On Machine Learning Approaches for Protein-Ligand Binding Affinity\n  Prediction","authors":"Nikolai Schapin, Carles Navarro, Albert Bou, Gianni De Fabritiis","authorsParsed":[["Schapin","Nikolai",""],["Navarro","Carles",""],["Bou","Albert",""],["De Fabritiis","Gianni",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 13:06:00 GMT"}],"updateDate":"2024-07-30","timestamp":1721048760000,"abstract":"  Binding affinity optimization is crucial in early-stage drug discovery. While\nnumerous machine learning methods exist for predicting ligand potency, their\ncomparative efficacy remains unclear. This study evaluates the performance of\nclassical tree-based models and advanced neural networks in protein-ligand\nbinding affinity prediction. Our comprehensive benchmarking encompasses 2D\nmodels utilizing ligand-only RDKit embeddings and Large Language Model (LLM)\nligand representations, as well as 3D neural networks incorporating bound\nprotein-ligand conformations. We assess these models across multiple standard\ndatasets, examining various predictive scenarios including classification,\nranking, regression, and active learning. Results indicate that simpler models\ncan surpass more complex ones in specific tasks, while 3D models leveraging\nstructural information become increasingly competitive with larger training\ndatasets containing compounds with labelled affinity data against multiple\ntargets. Pre-trained 3D models, by incorporating protein pocket environments,\ndemonstrate significant advantages in data-scarce scenarios for specific\nbinding pockets. Additionally, LLM pretraining on 2D ligand data enhances\ncomplex model performance, providing versatile embeddings that outperform\ntraditional RDKit features in computational efficiency. Finally, we show that\ncombining 2D and 3D model strengths improves active learning outcomes beyond\ncurrent state-of-the-art approaches. These findings offer valuable insights for\noptimizing machine learning strategies in drug discovery pipelines.\n","subjects":["Quantitative Biology/Biomolecules","Computing Research Repository/Machine Learning","Quantitative Biology/Quantitative Methods"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}