{"id":"2407.10139","title":"Dispersion in the Hubble-Lema\\^{i}tre constant measurements from\n  gravitational clustering","authors":"Swati Gavas, J S Bagla, Nishikanta Khandai","authorsParsed":[["Gavas","Swati",""],["Bagla","J S",""],["Khandai","Nishikanta",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 10:10:54 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 12:51:17 GMT"},{"version":"v3","created":"Mon, 16 Sep 2024 11:06:57 GMT"}],"updateDate":"2024-09-17","timestamp":1720951854000,"abstract":"  Measurements of the Hubble-Lema\\^{i}tre constant ($H_0$) require us to\nestimate the distance and recession velocity of galaxies independently.\nGravitational clustering that leads to the formation of galaxies and the large\nscale structure leaves its imprints in the form of peculiar velocities of\ngalaxies. In general, it is not possible to disentangle the peculiar velocity\ncomponent from the recession velocities of galaxies, and this introduces an\nuncertainty in the determination of $H_0$. Using N-body simulations, we\nquantify the impact of peculiar velocities on the $H_0$ estimation. We consider\nobservers to be located in dark matter halos and compute the distribution of\nthe estimated value of $H_0$ across all such observers. We find that the\ndispersion of this distribution is large at small scales, and it diminishes as\nwe go to large separations, reaching the level of the quoted statistical error\nin Planck and SH0ES measurements well beyond $\\sim$135 Mpc/h and $\\sim$220\nMpc/h, respectively. Measurements at smaller scales are susceptible to errors\narising from peculiar motions, and this error can propagate to measurements at\nlarger scales in the distance ladder. Notably, we observe a negative\ncorrelation between the local over-density around an observer and the deviation\nof the local and the global value of $H_0$. We show that deviations more\nsignificant than 5% of the global values can be encountered frequently at\nscales of up to 40 Mpc/h, and this is considerably larger than the statistical\nerrors on local estimates. We also analyse the cumulative effect of such errors\non mock measurements of $H_0$ as measured from Milky Way-sized halos. We find\nthat this error is sensitive to the lowest distance at which we use\nmeasurements. The distribution of $H_0$ in mock measurements has a large tail,\nand deviations of a few percent from the global value cannot be ruled out.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}