{"id":"2407.20993","title":"Integrating Agent-Based and Compartmental Models for Infectious Disease\n  Modeling: A Novel Hybrid Approach","authors":"Inan Bostanci, Tim Conrad","authorsParsed":[["Bostanci","Inan",""],["Conrad","Tim",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 17:28:50 GMT"}],"updateDate":"2024-07-31","timestamp":1722360530000,"abstract":"  This study investigates the spatial integration of agent-based models (ABMs)\nand compartmental models in infectious disease modeling, presenting a novel\nhybrid approach and studying its implications. ABMs, characterized by\nindividual agent interactions and decision-making, offer detailed insights but\nare computationally intensive for large populations. Compartmental models,\nbased on differential equations, provide population-level dynamics but lack\ngranular detail. Our hybrid model aims to balance the granularity of ABMs with\nthe computational efficiency of compartmental models, offering a more nuanced\nunderstanding of disease spread in diverse scenarios, including large\npopulations. We developed a custom ABM and a compartmental model, analyzing\ntheir infectious disease dynamics separately before integrating them into a\nhybrid model. This integration involved spatial coupling of discrete and\ncontinuous populations and evaluating the consistency of disease dynamics at\nthe macro scale. Our key objectives were to assess the effect of model\nhybridization on resulting infection dynamics, and to quantify computational\ncost savings of the hybrid approach over the ABM. We show that the hybrid\napproach can significantly reduce computational costs, but is sensitive to\nbetween-model differences, highlighting that model equivalence is a crucial\ncomponent of hybrid modeling approaches. The code is available at\nhttp://github.com/iebos/hybrid_model1.\n","subjects":["Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xkEv0XexK70StkLo_1WLb6812unVPVt40emgaoQrjw8","pdfSize":"954230"}
