{"id":"2407.19481","title":"What can we learn about Reionization astrophysical parameters using\n  Gaussian Process Regression?","authors":"Purba Mukherjee, Antara Dey, Supratik Pal","authorsParsed":[["Mukherjee","Purba",""],["Dey","Antara",""],["Pal","Supratik",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 12:21:27 GMT"}],"updateDate":"2024-07-30","timestamp":1722169287000,"abstract":"  Reionization is one of the least understood processes in the evolution\nhistory of the Universe, mostly because of the numerous astrophysical processes\noccurring simultaneously about which we do not have a very clear idea so far.\nIn this article, we use the Gaussian Process Regression (GPR) method to learn\nthe reionization history and infer the astrophysical parameters. We reconstruct\nthe UV luminosity density function using the HFF and early JWST data. From the\nreconstructed history of reionization, the global differential brightness\ntemperature fluctuation during this epoch has been computed. We perform MCMC\nanalysis of the global 21-cm signal using the instrumental specifications of\nSARAS, in combination with Lyman-$\\alpha$ ionization fraction data, Planck\noptical depth measurements and UV luminosity data. Our analysis reveals that\nGPR can help infer the astrophysical parameters in a model-agnostic way than\nconventional methods. Additionally, we analyze the 21-cm power spectrum using\nthe reconstructed history of reionization and demonstrate how the future 21-cm\nmission SKA, in combination with Planck and Lyman-$\\alpha$ forest data,\nimproves the bounds on the reionization astrophysical parameters by doing a\njoint MCMC analysis for the astrophysical parameters plus 6 cosmological\nparameters for $\\Lambda$CDM model. The results make the GPR-based\nreconstruction technique a robust learning process and the inferences on the\nastrophysical parameters obtained therefrom are quite reliable that can be used\nfor future analysis.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}