{"id":"2407.09114","title":"Spectroscopy of Single CdSe Magic-Sized Nanocrystals","authors":"Gabriel Nagamine, Julian Santen, Juri G. Crimmann, Aniket S. Mule,\n  Andrew B. Pun, and David J. Norris","authorsParsed":[["Nagamine","Gabriel",""],["Santen","Julian",""],["Crimmann","Juri G.",""],["Mule","Aniket S.",""],["Pun","Andrew B.",""],["Norris","David J.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 09:26:10 GMT"}],"updateDate":"2024-07-15","timestamp":1720776370000,"abstract":"  Chemical syntheses that provide nanocrystals (NCs) with narrow distributions\nin size and shape are critical for NC research. This has led to the\ninvestigation of magic-sized NCs (MSNCs), a class of semiconductor crystallites\nthat grow in discrete steps, potentially offering a single size and shape\n(i.e., monodispersity). However, the photoluminescence (PL) spectra of CdSe\nMSNCs measured at room temperature have been reported to be broader than those\nof state-of-the-art quantum dots. This difference could be due to the smaller\nsize of MSNCs, which broadens their line widths, or due to their residual size\ndispersity. To better understand the optical performance of MSNCs, here we\nperform single-particle spectroscopy. Our results show that, while CdSe MSNCs\ndo exhibit particle-to-particle variations that lead to modest broadening of\ntheir ensemble emission spectra, the largest contribution comes from the\nsingle-particle line width. By examining MSNCs with different sizes and shells,\nwe conclude that this single-particle broadening is consistent with exciton\ncoupling to acoustic phonons from the NC surface. Because of their small size,\nthis coupling and the role of residual size dispersity have a larger impact on\nthe ensemble emission line widths. Notably, when small (<2.7 nm diameter) MSNCs\nand quantum dots are compared, the ensemble PL line widths of MSNCs are\nactually sharper. Due to their small size, MSNCs also exhibit strong\nanti-bunching $[g^{(2)}(0) \\sim 0.05]$ at room temperature. Thus, MSNCs\nrepresent a bright, spectrally pure class of quantum emitter, useful for\napplications in optoelectronic and quantum-information technologies where\nstrong three-dimensional confinement is required.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Physics/Optics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"D8d2vEaZknn3EfYOUD3DmoZTggG0o4AKDB8B_iK9n3c","pdfSize":"5722907","objectId":"0x2ce29bfd2da8234c42f200ba08e7c4cb476b35856f7318da77705261c6f65f9d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
