{"id":"2407.21557","title":"Andreev Reflection in the Quantum Hall Regime at an Al/InAs Junction on\n  a Cleaved Edge","authors":"Takafumi Akiho, Hiroshi Irie, Yusuke Nakazawa, Satoshi Sasaki, Norio\n  Kumada, and Koji Muraki","authorsParsed":[["Akiho","Takafumi",""],["Irie","Hiroshi",""],["Nakazawa","Yusuke",""],["Sasaki","Satoshi",""],["Kumada","Norio",""],["Muraki","Koji",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 12:26:35 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 08:06:51 GMT"}],"updateDate":"2024-08-30","timestamp":1722428795000,"abstract":"  We have fabricated a superconductor/semiconductor (S/Sm) junction composed of\nAl and InAs using cleaved edge overgrowth. By exploiting the unique geometry\nwith a thin Al/Pt/Al trilayer formed on the side surface of an in-situ cleaved\nheterostructure wafer containing an InAs quantum well, we achieve a\nsuperconducting critical field of 5 T, allowing superconductivity and quantum\nHall (QH) effects to coexist down to Landau-level filling factor nu = 3.\nAndreev reflection at zero magnetic field shows a conductance enhancement that\nis limited solely by the Fermi velocity mismatch, demonstrating a virtually\nbarrier-free, high-quality S/Sm junction. Bias spectroscopy in the QH regime\nreveals the opening of a superconducting gap, with the reduced downstream\nresistance demonstrating that the electron-hole Andreev conversion probability\nconsistently exceeds 50%. Our results, obtained in a new experimental regime\ncharacterized by a clean edge-contacted junction with a superconducting\nelectrode narrower than the coherence length, open new avenues for both\ntheoretical and experimental studies of the interplay between superconductivity\nand QH effects and the engineering of exotic quasiparticles.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oCDZgrN2W3p_qcOB8Agw6PPeO-k0S2EFQPM7Dd13a5M","pdfSize":"3620176","objectId":"0x0c8848b76166f802e849cc30d8a0694fe790c2d56c88e0232987fafed55cd55a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
