{"id":"2407.04058","title":"Measuring multipartite quantum correlations by thermodynamic work\n  extraction","authors":"Toshihiro Yada, Nobuyuki Yoshioka, Takahiro Sagawa","authorsParsed":[["Yada","Toshihiro",""],["Yoshioka","Nobuyuki",""],["Sagawa","Takahiro",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 16:58:30 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 09:16:06 GMT"}],"updateDate":"2024-08-01","timestamp":1720112310000,"abstract":"  Quantum correlations are at the core of quantum mechanics and play a crucial\nrole in various fields. While bipartite quantum correlations have been\nextensively studied, multipartite quantum correlations in many-body systems\nremain elusive due to their complex structure. In particular, a primary\nchallenge lies in the fact that the calculation of multipartite quantum\ncorrelation measure often requires exponential cost. In this work, we tackle\nthis problem by adopting a thermodynamic approach; we introduce a measure of\nmultipartite quantum correlations based on the difference in extractable\nthermodynamic work by global operations and local operations and classical\ncommunication (LOCC). This can be regarded as a multipartite generalization of\nthe work deficit, which has attracted attention as a thermodynamic measure of\nbipartite quantum correlation. A distinguishing feature of the thermodynamic\napproach to multipartite quantum correlation is that we can compare the degree\nof quantum correlations with clear operational meaning. Importantly, we develop\nan efficient calculation method of the multipartite work deficit. This\nefficient method works for a special class of quantum many-body systems\ndescribed by matrix product states (MPS), where the numerical cost is shown to\nbe proportional to the system size, significantly reducing the exponential cost\nrequired for the direct calculations. We demonstrate this efficient method in\nthe AKLT state and the cluster state, and analytically obtain the exact values\nof this measure. We further show that a quantum phase transition described by\nMPS is well captured by the multipartite work deficit. This shows that the\nmultipartite work deficit does not only highlight the fundamental connection\nbetween multipartite quantum correlations and quantum thermodynamics, but also\nserves as an efficiently-computable probe of the structures of quantum\nmany-body systems.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}