{"id":"2407.05168","title":"Deception in Nash Equilibrium Seeking","authors":"Michael Tang, Umar Javed, Xudong Chen, Miroslav Krstic, Jorge I.\n  Poveda","authorsParsed":[["Tang","Michael",""],["Javed","Umar",""],["Chen","Xudong",""],["Krstic","Miroslav",""],["Poveda","Jorge I.",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 20:09:33 GMT"}],"updateDate":"2024-07-09","timestamp":1720296573000,"abstract":"  In socio-technical multi-agent systems, deception exploits privileged\ninformation to induce false beliefs in \"victims,\" keeping them oblivious and\nleading to outcomes detrimental to them or advantageous to the deceiver. We\nconsider model-free Nash-equilibrium-seeking for non-cooperative games with\nasymmetric information and introduce model-free deceptive algorithms with\nstability guarantees. In the simplest algorithm, the deceiver includes in his\naction policy the victim's exploration signal, with an amplitude tuned by an\nintegrator of the regulation error between the deceiver's actual and desired\npayoff. The integral feedback drives the deceiver's payoff to the payoff's\nreference value, while the victim is led to adopt a suboptimal action, at which\nthe pseudogradient of the deceiver's payoff is zero. The deceiver's and\nvictim's actions turn out to constitute a \"deceptive\" Nash equilibrium of a\ndifferent game, whose structure is managed - in real time - by the deceiver. We\nexamine quadratic, aggregative, and more general games and provide conditions\nfor a successful deception, mutual and benevolent deception, and immunity to\ndeception. Stability results are established using techniques based on\naveraging and singular perturbations. Among the examples in the paper is a\nmicroeconomic duopoly in which the deceiver induces in the victim a belief that\nthe buyers disfavor the deceiver more than they actually do, leading the victim\nto increase the price above the Nash price, and resulting in an increased\nprofit for the deceiver and a decreased profit for the victim. A study of the\ndeceiver's integral feedback for the desired profit reveals that, in duopolies\nwith equal marginal costs, a deceiver that is greedy for very high profit can\nattain any such profit, and pursue this with arbitrarily high integral gain\n(impatiently), irrespective of the market preference for the victim.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}