{"id":"2407.02467","title":"Error mitigation with stabilized noise in superconducting quantum\n  processors","authors":"Youngseok Kim, Luke C. G. Govia, Andrew Dane, Ewout van den Berg,\n  David M. Zajac, Bradley Mitchell, Yinyu Liu, Karthik Balakrishnan, George\n  Keefe, Adam Stabile, Emily Pritchett, Jiri Stehlik, Abhinav Kandala","authorsParsed":[["Kim","Youngseok",""],["Govia","Luke C. G.",""],["Dane","Andrew",""],["Berg","Ewout van den",""],["Zajac","David M.",""],["Mitchell","Bradley",""],["Liu","Yinyu",""],["Balakrishnan","Karthik",""],["Keefe","George",""],["Stabile","Adam",""],["Pritchett","Emily",""],["Stehlik","Jiri",""],["Kandala","Abhinav",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 17:47:07 GMT"},{"version":"v2","created":"Fri, 5 Jul 2024 04:53:53 GMT"}],"updateDate":"2024-07-08","timestamp":1719942427000,"abstract":"  Pre-fault tolerant quantum computers have already demonstrated the ability to\nestimate observable values accurately, at a scale beyond brute-force classical\ncomputation. This has been enabled by error mitigation techniques that often\nrely on a representative model on the device noise. However, learning and\nmaintaining these models is complicated by fluctuations in the noise over\nunpredictable time scales, for instance, arising from resonant interactions\nbetween superconducting qubits and defect two-level systems (TLS). Such\ninteractions affect the stability and uniformity of device performance as a\nwhole, but also affect the noise model accuracy, leading to incorrect\nobservable estimation. Here, we experimentally demonstrate that tuning of the\nqubit-TLS interactions helps reduce noise instabilities and consequently\nenables more reliable error-mitigation performance. These experiments provide a\ncontrolled platform for studying the performance of error mitigation in the\npresence of quasi-static noise. We anticipate that the capabilities introduced\nhere will be crucial for the exploration of quantum applications on solid-state\nprocessors at non-trivial scales.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}