{"id":"2407.09718","title":"CLOVER: Context-aware Long-term Object Viewpoint- and Environment-\n  Invariant Representation Learning","authors":"Dongmyeong Lee, Amanda Adkins, Joydeep Biswas","authorsParsed":[["Lee","Dongmyeong",""],["Adkins","Amanda",""],["Biswas","Joydeep",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 23:16:48 GMT"}],"updateDate":"2024-07-16","timestamp":1720826208000,"abstract":"  In many applications, robots can benefit from object-level understanding of\ntheir environments, including the ability to distinguish object instances and\nre-identify previously seen instances. Object re-identification is challenging\nacross different viewpoints and in scenes with significant appearance variation\narising from weather or lighting changes. Most works on object\nre-identification focus on specific classes; approaches that address general\nobject re-identification require foreground segmentation and have limited\nconsideration of challenges such as occlusions, outdoor scenes, and\nillumination changes. To address this problem, we introduce CODa Re-ID: an\nin-the-wild object re-identification dataset containing 1,037,814 observations\nof 557 objects of 8 classes under diverse lighting conditions and viewpoints.\nFurther, we propose CLOVER, a representation learning method for object\nobservations that can distinguish between static object instances. Our results\nshow that CLOVER achieves superior performance in static object\nre-identification under varying lighting conditions and viewpoint changes, and\ncan generalize to unseen instances and classes.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"nQKF2gNSvDAUVUChlnoNR4cuQfPu04L0xz_qs9uiG88","pdfSize":"17895363","objectId":"0xb2aad2b78f358c3d5167f7d2b88132d50c607575990a83b5dfaa008c5c2f6d06","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
