{"id":"2407.00097","title":"Predictive accuracy of recommender algorithms","authors":"William Noffsinger","authorsParsed":[["Noffsinger","William",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 19:25:07 GMT"}],"updateDate":"2024-07-02","timestamp":1719429907000,"abstract":"  Recommender systems present a customized list of items based upon user or\nitem characteristics with the objective of reducing a large number of possible\nchoices to a smaller ranked set most likely to appeal to the user. A variety of\nalgorithms for recommender systems have been developed and refined including\napplications of deep learning neural networks. Recent research reports point to\na need to perform carefully controlled experiments to gain insights about the\nrelative accuracy of different recommender algorithms, because studies\nevaluating different methods have not used a common set of benchmark data sets,\nbaseline models, and evaluation metrics. This investigation used publicly\navailable sources of ratings data with a suite of three conventional\nrecommender algorithms and two deep learning (DL) algorithms in controlled\nexperiments to assess their comparative accuracy. Results for the non-DL\nalgorithms conformed well to published results and benchmarks. The two DL\nalgorithms did not perform as well and illuminated known challenges\nimplementing DL recommender algorithms as reported in the literature. Model\noverfitting is discussed as a potential explanation for the weaker performance\nof the DL algorithms and several regularization strategies are reviewed as\npossible approaches to improve predictive error. Findings justify the need for\nfurther research in the use of deep learning models for recommender systems.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NdD4ZCP7VrGC8BiWH31H7BdsJfDLafiqQI9g8DqSqWM","pdfSize":"2147061","objectId":"0x63994c0483f1801d043f15177a2b6cfec350bdf8f1befa2ebd050873c911c544","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
