{"id":"2407.06182","title":"Compositional Video Generation as Flow Equalization","authors":"Xingyi Yang, Xinchao Wang","authorsParsed":[["Yang","Xingyi",""],["Wang","Xinchao",""]],"versions":[{"version":"v1","created":"Mon, 10 Jun 2024 16:27:47 GMT"}],"updateDate":"2024-07-09","timestamp":1718036867000,"abstract":"  Large-scale Text-to-Video (T2V) diffusion models have recently demonstrated\nunprecedented capability to transform natural language descriptions into\nstunning and photorealistic videos. Despite the promising results, a\nsignificant challenge remains: these models struggle to fully grasp complex\ncompositional interactions between multiple concepts and actions. This issue\narises when some words dominantly influence the final video, overshadowing\nother concepts.To tackle this problem, we introduce \\textbf{Vico}, a generic\nframework for compositional video generation that explicitly ensures all\nconcepts are represented properly. At its core, Vico analyzes how input tokens\ninfluence the generated video, and adjusts the model to prevent any single\nconcept from dominating. Specifically, Vico extracts attention weights from all\nlayers to build a spatial-temporal attention graph, and then estimates the\ninfluence as the \\emph{max-flow} from the source text token to the video target\ntoken. Although the direct computation of attention flow in diffusion models is\ntypically infeasible, we devise an efficient approximation based on subgraph\nflows and employ a fast and vectorized implementation, which in turn makes the\nflow computation manageable and differentiable. By updating the noisy latent to\nbalance these flows, Vico captures complex interactions and consequently\nproduces videos that closely adhere to textual descriptions. We apply our\nmethod to multiple diffusion-based video models for compositional T2V and video\nediting. Empirical results demonstrate that our framework significantly\nenhances the compositional richness and accuracy of the generated videos. Visit\nour website\nat~\\href{https://adamdad.github.io/vico/}{\\url{https://adamdad.github.io/vico/}}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}