{"id":"2407.05887","title":"Generation and De-Identification of Indian Clinical Discharge Summaries\n  using LLMs","authors":"Sanjeet Singh and Shreya Gupta and Niralee Gupta and Naimish Sharma\n  and Lokesh Srivastava and Vibhu Agarwal and Ashutosh Modi","authorsParsed":[["Singh","Sanjeet",""],["Gupta","Shreya",""],["Gupta","Niralee",""],["Sharma","Naimish",""],["Srivastava","Lokesh",""],["Agarwal","Vibhu",""],["Modi","Ashutosh",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 12:47:03 GMT"}],"updateDate":"2024-07-09","timestamp":1720442823000,"abstract":"  The consequences of a healthcare data breach can be devastating for the\npatients, providers, and payers. The average financial impact of a data breach\nin recent months has been estimated to be close to USD 10 million. This is\nespecially significant for healthcare organizations in India that are managing\nrapid digitization while still establishing data governance procedures that\nalign with the letter and spirit of the law. Computer-based systems for\nde-identification of personal information are vulnerable to data drift, often\nrendering them ineffective in cross-institution settings. Therefore, a rigorous\nassessment of existing de-identification against local health datasets is\nimperative to support the safe adoption of digital health initiatives in India.\nUsing a small set of de-identified patient discharge summaries provided by an\nIndian healthcare institution, in this paper, we report the nominal performance\nof de-identification algorithms (based on language models) trained on publicly\navailable non-Indian datasets, pointing towards a lack of cross-institutional\ngeneralization. Similarly, experimentation with off-the-shelf de-identification\nsystems reveals potential risks associated with the approach. To overcome data\nscarcity, we explore generating synthetic clinical reports (using publicly\navailable and Indian summaries) by performing in-context learning over Large\nLanguage Models (LLMs). Our experiments demonstrate the use of generated\nreports as an effective strategy for creating high-performing de-identification\nsystems with good generalization capabilities.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}