{"id":"2407.13321","title":"Hardware-Efficient Stabilization of Entanglement via Engineered\n  Dissipation in Superconducting Circuits","authors":"Changling Chen, Kai Tang, Yuxuan Zhou, KangYuan Yi, Xuan Zhang, Xu\n  Zhang, Haosheng Guo, Song Liu, Yuanzhen Chen, Tongxing Yan, and Dapeng Yu","authorsParsed":[["Chen","Changling",""],["Tang","Kai",""],["Zhou","Yuxuan",""],["Yi","KangYuan",""],["Zhang","Xuan",""],["Zhang","Xu",""],["Guo","Haosheng",""],["Liu","Song",""],["Chen","Yuanzhen",""],["Yan","Tongxing",""],["Yu","Dapeng",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:21:58 GMT"}],"updateDate":"2024-07-19","timestamp":1721294518000,"abstract":"  Generation and preservation of quantum entanglement are among the primary\ntasks in quantum information processing. State stabilization via quantum bath\nengineering offers a resource-efficient approach to achieve this objective.\nHowever, current methods for engineering dissipative channels to stabilize\ntarget entangled states often require specialized hardware designs,\ncomplicating experimental realization and hindering their compatibility with\nscalable quantum computation architectures. In this work, we propose and\nexperimentally demonstrate a stabilization protocol readily implementable in\nthe mainstream integrated superconducting quantum circuits. The approach\nutilizes a Raman process involving a resonant (or nearly resonant)\nsuperconducting qubit array and their dedicated readout resonators to\neffectively emerge nonlocal dissipative channels. Leveraging individual\ncontrollability of the qubits and resonators, the protocol stabilizes two-qubit\nBell states with a fidelity of $90.7\\%$, marking the highest reported value in\nsolid-state platforms to date. Furthermore, by extending this strategy to\ninclude three qubits, an entangled $W$ state is achieved with a fidelity of\n$86.2\\%$, which has not been experimentally investigated before. Notably, the\nprotocol is of practical interest since it only utilizes existing hardware\ncommon to standard operations in the underlying superconducting circuits,\nthereby facilitating the exploration of many-body quantum entanglement with\ndissipative resources.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}