{"id":"2407.21351","title":"Small Object Few-shot Segmentation for Vision-based Industrial\n  Inspection","authors":"Zilong Zhang, Chang Niu, Zhibin Zhao, Xingwu Zhang, Xuefeng Chen","authorsParsed":[["Zhang","Zilong",""],["Niu","Chang",""],["Zhao","Zhibin",""],["Zhang","Xingwu",""],["Chen","Xuefeng",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 05:43:36 GMT"}],"updateDate":"2024-08-01","timestamp":1722404616000,"abstract":"  Vision-based industrial inspection (VII) aims to locate defects quickly and\naccurately. Supervised learning under a close-set setting and industrial\nanomaly detection, as two common paradigms in VII, face different problems in\npractical applications. The former is that various and sufficient defects are\ndifficult to obtain, while the latter is that specific defects cannot be\nlocated. To solve these problems, in this paper, we focus on the few-shot\nsemantic segmentation (FSS) method, which can locate unseen defects conditioned\non a few annotations without retraining. Compared to common objects in natural\nimages, the defects in VII are small. This brings two problems to current FSS\nmethods: 1 distortion of target semantics and 2 many false positives for\nbackgrounds. To alleviate these problems, we propose a small object few-shot\nsegmentation (SOFS) model. The key idea for alleviating 1 is to avoid the\nresizing of the original image and correctly indicate the intensity of target\nsemantics. SOFS achieves this idea via the non-resizing procedure and the\nprototype intensity downsampling of support annotations. To alleviate 2, we\ndesign an abnormal prior map in SOFS to guide the model to reduce false\npositives and propose a mixed normal Dice loss to preferentially prevent the\nmodel from predicting false positives. SOFS can achieve FSS and few-shot\nanomaly detection determined by support masks. Diverse experiments substantiate\nthe superior performance of SOFS. Code is available at\nhttps://github.com/zhangzilongc/SOFS.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}