{"id":"2407.02270","title":"Strange metal and exotic non-Fermi liquids at two-dimensional van Hove\n  singularity","authors":"Yi-Hui Xing, Wu-Ming Liu, Xiao-Tian Zhang","authorsParsed":[["Xing","Yi-Hui",""],["Liu","Wu-Ming",""],["Zhang","Xiao-Tian",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 13:58:53 GMT"},{"version":"v2","created":"Tue, 10 Sep 2024 14:09:59 GMT"}],"updateDate":"2024-09-11","timestamp":1719928733000,"abstract":"  Non-Fermi liquids, particularly the universal strange metal, are ubiquitously\nobserved in strongly correlated materials, that includes the high-$T_c$\ncuprates, ruthenate oxides and twisted bilayer graphenes. The unprecedent\ntunablity of these two-dimensional (2D) systems provides access towards the\nLifshitz transition where the Fermi surface exhibits van Hove singularity (VHS)\nsaddle points. Despite extensive investigation on the ordering instabilities,\nthe critical phenomenon induced by the VHS are rarely explored. Here, we\ninvestigate the NFL behaviors at Lifshitz transition in the 2D magnetic\nheterostructure interface, where the Fermi surface undergoes a\nconvex-to-concave topological transition. We uncover an exotic NFL phase at the\nVHS that dominates over other Fermi surface points in the low-energy limit. At\nfinite energies, it crossovers to the well-known marginal Fermi liquid (MFL).\nIn the finite-temperature regimes, we demonstrate that the universal strange\nmetal transport emerges both in the MFL phase, and unexpectedly, in the exotic\nNFL phase which is induced by solely by the spatially uniform Yukawa\ninteraction. This non-vanishing optical conductivity is largely attributed to\nthe Galilean invariance breaking at VHS. Furthermore, we propose that the\nnon-magnetic ARPES can directly probe the exotic NFL features at\nheterostructure interface. Our findings explore the interplay of VHS in lower\ndimension, disorder and strong interactions, which paves a novel path to study\nthe high-$T_c$ superconductivity, 2D magnetism and spintronics.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}