{"id":"2407.10626","title":"NoviCode: Generating Programs from Natural Language Utterances by\n  Novices","authors":"Asaf Achi Mordechai, Yoav Goldberg, Reut Tsarfaty","authorsParsed":[["Mordechai","Asaf Achi",""],["Goldberg","Yoav",""],["Tsarfaty","Reut",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 11:26:03 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 05:36:53 GMT"}],"updateDate":"2024-07-17","timestamp":1721042763000,"abstract":"  Current Text-to-Code models demonstrate impressive capabilities in generating\nexecutable code from natural language snippets. However, current studies focus\non technical instructions and programmer-oriented language, and it is an open\nquestion whether these models can effectively translate natural language\ndescriptions given by non-technical users and express complex goals, to an\nexecutable program that contains an intricate flow - composed of API access and\ncontrol structures as loops, conditions, and sequences. To unlock the challenge\nof generating a complete program from a plain non-technical description we\npresent NoviCode, a novel NL Programming task, which takes as input an API and\na natural language description by a novice non-programmer and provides an\nexecutable program as output. To assess the efficacy of models on this task, we\nprovide a novel benchmark accompanied by test suites wherein the generated\nprogram code is assessed not according to their form, but according to their\nfunctional execution. Our experiments show that, first, NoviCode is indeed a\nchallenging task in the code synthesis domain, and that generating complex code\nfrom non-technical instructions goes beyond the current Text-to-Code paradigm.\nSecond, we show that a novel approach wherein we align the NL utterances with\nthe compositional hierarchical structure of the code, greatly enhances the\nperformance of LLMs on this task, compared with the end-to-end Text-to-Code\ncounterparts.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}