{"id":"2407.18773","title":"Channel Estimation for Movable-Antenna MIMO Systems Via Tensor\n  Decomposition","authors":"Ruoyu Zhang, Lei Cheng, Wei Zhang, Xinrong Guan, Yueming Cai, Wen Wu,\n  Rui Zhang","authorsParsed":[["Zhang","Ruoyu",""],["Cheng","Lei",""],["Zhang","Wei",""],["Guan","Xinrong",""],["Cai","Yueming",""],["Wu","Wen",""],["Zhang","Rui",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 14:33:11 GMT"}],"updateDate":"2024-07-29","timestamp":1722004391000,"abstract":"  In this letter, we investigate the channel estimation problem for MIMO\nwireless communication systems with movable antennas (MAs) at both the\ntransmitter (Tx) and receiver (Rx). To achieve high channel estimation accuracy\nwith low pilot training overhead, we propose a tensor decomposition-based\nmethod for estimating the parameters of multi-path channel components,\nincluding their azimuth and elevation angles, as well as complex gain\ncoefficients, thereby reconstructing the wireless channel between any pair of\nTx and Rx MA positions in the Tx and Rx regions. First, we introduce a\ntwo-stage Tx-Rx successive antenna movement pattern for pilot training, such\nthat the received pilot signals in both stages can be expressed as a\nthird-order tensor. Then, we obtain the factor matrices of the tensor via the\ncanonical polyadic decomposition, and thereby estimate the angle/gain\nparameters for enabling the channel reconstruction between arbitrary Tx/Rx MA\npositions. In addition, we analyze the uniqueness condition of the tensor\ndecomposition, which ensures the complete channel reconstruction between the\nwhole Tx and Rx regions based on the channel measurements at only a finite\nnumber of Tx/Rx MA positions. Finally, simulation results are presented to\nevaluate the proposed tensor decomposition-based method as compared to existing\nmethods, in terms of channel estimation accuracy and pilot overhead.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}