{"id":"2407.09564","title":"Implication of modelling choices on connectivity estimation: A\n  comparative analysis","authors":"Marie Soret, Sylvain Moulherat, Maxime Lenormand, Sandra Luque","authorsParsed":[["Soret","Marie",""],["Moulherat","Sylvain",""],["Lenormand","Maxime",""],["Luque","Sandra",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 06:01:51 GMT"}],"updateDate":"2024-07-16","timestamp":1720159311000,"abstract":"  We focus on connectivity methods used to understand and predict how\nlandscapes and habitats facilitate or impede the movement and dispersal of\nspecies. Our objective is to compare the implication of methodological choices\nat three stages of the modelling framework: landscape characterisation,\nconnectivity estimation, and connectivity assessment. What are the convergences\nand divergences of different modelling approaches? What are the implications of\ntheir combined results for landscape planning? We implemented two landscape\ncharacterisation approaches: expert opinion and species distribution model\n(SDM); four connectivity estimation models: Euclidean distance, least-cost\npaths (LCP), circuit theory, and stochastic movement simulation (SMS); and two\nconnectivity indices: flux and area-weighted flux (dPCflux). We compared\noutcomes such as movement maps and habitat prioritisation for a rural landscape\nin southwestern France. Landscape characterisation is the main factor\ninfluencing connectivity assessment. The movement maps reflect the models'\nassumptions: LCP produced narrow beams reflecting the optimal pathways; whereas\ncircuit theory and SMS produced wider estimation reflecting movement\nstochasticity, with SMS integrating behavioural drivers. The indices\nhighlighted different aspects: dPCflux the surface of suitable habitats and\nflux their proximity. We recommend focusing on landscape characterisation\nbefore engaging further in the modelling framework. We emphasise the importance\nof stochasticity and behavioural drivers in connectivity, which can be\nreflected using circuit theory, SMS or other stochastic individual-based\nmodels. We stress the importance of using multiple indices to capture the\nmulti-factorial aspect of connectivity.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}