{"id":"2407.08307","title":"Characterizing a class of accelerating wormholes with periodic potential","authors":"Soham Chatterjee, Sagnik Roy and Ratna Koley","authorsParsed":[["Chatterjee","Soham",""],["Roy","Sagnik",""],["Koley","Ratna",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 08:54:57 GMT"}],"updateDate":"2024-07-12","timestamp":1720688097000,"abstract":"  The newly discovered Wormhole C--metric is a solution of Einstein's field\nequation coupled with a phantom scalar field which describes the accelerated\nwormholes. In the zero acceleration limit the solution reduces to an\nasymptotically flat wormhole. For certain range of parameter space this\nsolution doesn't possess any horizon, thus making it a viable candidate of\nwormhole. To completely unveil this property we have studied the topological\nproperties of this spacetime and shown that the throat is marginally connected.\nIn the aforementioned range of parameters, the spacetime doesn't posses any\nphoton orbit confirming the absence of shadow. We further analysed the\nstability of this spacetime under scalar perturbation. Under the usual boundary\nconditions (outgoing waves at both spatial infinities) there exists a\ncontinuous spectra. On the contrary one may achieve the quantization of the\nmodes by exploiting a different but physically intuitive boundary condition.\nThe lowest lying mode behaves as normal mode, and the imaginary part comes into\nplay for the modes corresponding to first overtone number $(n=1)$ marking the\nonset of quasi-nomral modes for all azimuthal quantum number, $L$. We have also\nargued that the spacetime has a tendency to hold the excitation in it due to\nthe external perturbation, rather than a fast de-excitation.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"znb85bRDWtooB6wddpUNs43Ardd7bsxCkLzCBsePJrM","pdfSize":"1163953","objectId":"0x5ca54dd7ed72a3dbe4f1597754f542f8846f1a3d8168862b81205d0ec88cd2c4","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
