{"id":"2407.11883","title":"Constraints on Short Gamma-Ray Burst Physics and Their Host Galaxies\n  from Systematic Radio Follow-up Campaigns","authors":"S. I. Chastain, A. J. van der Horst, G. E. Anderson, L. Rhodes, D.\n  d'Antonio, M. E. Bell, R. P. Fender, P. J. Hancock, A. Horesh, C.\n  Kouveliotou, K. P. Mooley, A. Rowlinson, S. D. Vergani, R. A. M. J. Wijers,\n  and P. A. Woudt","authorsParsed":[["Chastain","S. I.",""],["van der Horst","A. J.",""],["Anderson","G. E.",""],["Rhodes","L.",""],["d'Antonio","D.",""],["Bell","M. E.",""],["Fender","R. P.",""],["Hancock","P. J.",""],["Horesh","A.",""],["Kouveliotou","C.",""],["Mooley","K. P.",""],["Rowlinson","A.",""],["Vergani","S. D.",""],["Wijers","R. A. M. J.",""],["Woudt","P. A.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 16:09:27 GMT"}],"updateDate":"2024-07-17","timestamp":1721146167000,"abstract":"  Short gamma-ray bursts (GRBs) are explosive transients caused by binary\nmergers of compact objects containing at least one neutron star.\nMulti-wavelength afterglow observations provide constraints on the physical\nparameters of the jet, its surrounding medium, and the microphysics of the\nenhanced magnetic fields and accelerated electrons in the blast wave at the\nfront of the jet. The synchrotron radio emission can be tracked for much longer\nthan in other spectral regimes, and it can pin down the evolution of the\nspectral peak. We present the results of a systematic observing campaign of\neight short GRBs with the MeerKAT radio telescope. Additionally, we present\nobservations of four of these short GRBs using the ATCA radio telescope and two\nof these short GRBs with the e-MERLIN radio telescope. Using these results we\nreport one possible detection of a short GRB afterglow from GRB 230217A and\ndeep upper limits for the rest of our short GRB observations. We use these\nobservations to place constraints on some of the physical parameters, in\nparticular those related to electron acceleration, the circumburst density, and\ngamma-ray energy efficiency. We discuss how deeper observations with new and\nupgraded telescopes should be able to determine if the gamma-ray efficiency\ndiffers between long and short GRBs. We also report detections of the likely\nhost galaxies for four of the eight GRBs and upper limits for another GRB,\nincreasing the number of detected host galaxies in the radio with implications\nfor the star formation rate in these galaxies.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}