{"id":"2407.00629","title":"Identification of LFT Structured Descriptor Systems with Slow and\n  Non-uniform Sampling","authors":"Tong Zhou","authorsParsed":[["Zhou","Tong",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 09:04:27 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 01:31:23 GMT"},{"version":"v3","created":"Sat, 31 Aug 2024 14:22:43 GMT"},{"version":"v4","created":"Sat, 7 Sep 2024 09:05:09 GMT"}],"updateDate":"2024-09-10","timestamp":1719738267000,"abstract":"  Time domain identification is studied in this paper for parameters of a\ncontinuous-time multi-input multi-output descriptor system, with these\nparameters affecting system matrices through a linear fractional\ntransformation. Sampling is permitted to be slow and non-uniform, and there are\nno necessities to satisfy the Nyquist frequency restrictions. This model can be\nused to described the behaviors of a networked dynamic system, and the obtained\nresults can be straightforwardly applied to an ordinary state-space model, as\nwell as a lumped system. An explicit formula is obtained respectively for the\ntransient and steady-state responses of the system stimulated by an arbitrary\nsignal. Some relations have been derived between the system steady-state\nresponse and its transfer function matrix (TFM), which reveal that the value of\na TFM at almost any interested point, as well as its derivatives and a right\ntangential interpolation along an arbitrary direction, can in principle be\nestimated from input-output experimental data. Based on these relations, an\nestimation algorithm is suggested respectively for the parameters of the\ndescriptor system and the values of its TFM. Their properties like asymptotic\nunbiasedness, consistency, etc., are analyzed. A simple numerical example is\nincluded to illustrate characteristics of the suggested estimation algorithms.\n","subjects":["Computing Research Repository/Multiagent Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}