{"id":"2407.08807","title":"Whispers from the quantum core: the ringdown of semiclassical stars","authors":"Julio Arrechea, Stefano Liberati, Vania Vellucci","authorsParsed":[["Arrechea","Julio",""],["Liberati","Stefano",""],["Vellucci","Vania",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 18:32:01 GMT"}],"updateDate":"2024-07-15","timestamp":1720722721000,"abstract":"  This investigation delves into the ringdown signals produced by semiclassical\nstars, which are ultra-compact, regular solutions of the Einstein equations\nincorporating stress-energy contributions from quantum vacuum polarization.\nThese stars exhibit an approximately Schwarzschild exterior and an interior\ncomposed of a constant-density classical fluid and a cloud of vacuum\npolarization. By adjusting their compactness and density, we can alter the\ninternal structure of these stars without modifying the exterior. This\nadaptability enables us to examine the sensitivity of the ringdown signal to\nthe innermost regions of the emitting object and to compare it with similar\ngeometries that differ substantially only at the core. Our results indicate\nthat echo signals are intrinsically linked to the presence of stable light\nrings and can be very sensitive to the internal structure of the emitting\nobject. This point was previously overlooked, either due to the imposition of\nreflective boundary conditions at the stellar surface or due to the assumption\nof low curvature interior geometries. Specifically, for stellar-sized\nsemiclassical stars, we find that the interior travel time is sufficiently\nprolonged to render the echoes effectively unobservable. These findings\nunderscore the potential efficacy of ultra-compact objects as black hole\nmimickers and emphasize that any phenomenological constraints on such objects\nnecessitate a detailed understanding of their specific properties and core\nstructure.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"f6Cnz-Pt8dZA_77Vb-5CZAI2gkLcYkjwf2tsj3RUVns","pdfSize":"4104967","objectId":"0xc3b74200189ed531b2815fabc3e3bc7cf8a045e6c4aa5cf760c3c89d61ae41ec","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
