{"id":"2407.21714","title":"UMMAN: Unsupervised Multi-graph Merge Adversarial Network for Disease\n  Prediction Based on Intestinal Flora","authors":"Dingkun Liu, Hongjie Zhou, Yilu Qu, Huimei Zhang and Yongdong Xu","authorsParsed":[["Liu","Dingkun",""],["Zhou","Hongjie",""],["Qu","Yilu",""],["Zhang","Huimei",""],["Xu","Yongdong",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 16:06:43 GMT"}],"updateDate":"2024-08-01","timestamp":1722442003000,"abstract":"  The abundance of intestinal flora is closely related to human diseases, but\ndiseases are not caused by a single gut microbe. Instead, they result from the\ncomplex interplay of numerous microbial entities. This intricate and implicit\nconnection among gut microbes poses a significant challenge for disease\nprediction using abundance information from OTU data. Recently, several methods\nhave shown potential in predicting corresponding diseases. However, these\nmethods fail to learn the inner association among gut microbes from different\nhosts, leading to unsatisfactory performance. In this paper, we present a novel\narchitecture, Unsupervised Multi-graph Merge Adversarial Network (UMMAN). UMMAN\ncan obtain the embeddings of nodes in the Multi-Graph in an unsupervised\nscenario, so that it helps learn the multiplex association. Our method is the\nfirst to combine Graph Neural Network with the task of intestinal flora disease\nprediction. We employ complex relation-types to construct the Original-Graph\nand disrupt the relationships among nodes to generate corresponding\nShuffled-Graph. We introduce the Node Feature Global Integration (NFGI) module\nto represent the global features of the graph. Furthermore, we design a joint\nloss comprising adversarial loss and hybrid attention loss to ensure that the\nreal graph embedding aligns closely with the Original-Graph and diverges from\nthe Shuffled-Graph. Comprehensive experiments on five classical OTU gut\nmicrobiome datasets demonstrate the effectiveness and stability of our method.\n(We will release our code soon.)\n","subjects":["Computing Research Repository/Artificial Intelligence","Quantitative Biology/Quantitative Methods"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}