{"id":"2407.08554","title":"Establishing Rigorous and Cost-effective Clinical Trials for Artificial\n  Intelligence Models","authors":"Wanling Gao, Yunyou Huang, Dandan Cui, Zhuoming Yu, Wenjing Liu,\n  Xiaoshuang Liang, Jiahui Zhao, Jiyue Xie, Hao Li, Li Ma, Ning Ye, Yumiao\n  Kang, Dingfeng Luo, Peng Pan, Wei Huang, Zhongmou Liu, Jizhong Hu, Gangyuan\n  Zhao, Chongrong Jiang, Fan Huang, Tianyi Wei, Suqin Tang, Bingjie Xia, Zhifei\n  Zhang, Jianfeng Zhan","authorsParsed":[["Gao","Wanling",""],["Huang","Yunyou",""],["Cui","Dandan",""],["Yu","Zhuoming",""],["Liu","Wenjing",""],["Liang","Xiaoshuang",""],["Zhao","Jiahui",""],["Xie","Jiyue",""],["Li","Hao",""],["Ma","Li",""],["Ye","Ning",""],["Kang","Yumiao",""],["Luo","Dingfeng",""],["Pan","Peng",""],["Huang","Wei",""],["Liu","Zhongmou",""],["Hu","Jizhong",""],["Zhao","Gangyuan",""],["Jiang","Chongrong",""],["Huang","Fan",""],["Wei","Tianyi",""],["Tang","Suqin",""],["Xia","Bingjie",""],["Zhang","Zhifei",""],["Zhan","Jianfeng",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:37:08 GMT"},{"version":"v2","created":"Sun, 28 Jul 2024 15:33:33 GMT"}],"updateDate":"2024-07-30","timestamp":1720708628000,"abstract":"  A profound gap persists between artificial intelligence (AI) and clinical\npractice in medicine, primarily due to the lack of rigorous and cost-effective\nevaluation methodologies. State-of-the-art and state-of-the-practice AI model\nevaluations are limited to laboratory studies on medical datasets or direct\nclinical trials with no or solely patient-centered controls. Moreover, the\ncrucial role of clinicians in collaborating with AI, pivotal for determining\nits impact on clinical practice, is often overlooked. For the first time, we\nemphasize the critical necessity for rigorous and cost-effective evaluation\nmethodologies for AI models in clinical practice, featuring\npatient/clinician-centered (dual-centered) AI randomized controlled trials\n(DC-AI RCTs) and virtual clinician-based in-silico trials (VC-MedAI) as an\neffective proxy for DC-AI RCTs. Leveraging 7500 diagnosis records from two-step\ninaugural DC-AI RCTs across 14 medical centers with 125 clinicians, our results\ndemonstrate the necessity of DC-AI RCTs and the effectiveness of VC-MedAI.\nNotably, VC-MedAI performs comparably to human clinicians, replicating insights\nand conclusions from prospective DC-AI RCTs. We envision DC-AI RCTs and\nVC-MedAI as pivotal advancements, presenting innovative and transformative\nevaluation methodologies for AI models in clinical practice, offering a\npreclinical-like setting mirroring conventional medicine, and reshaping\ndevelopment paradigms in a cost-effective and fast-iterative manner. Chinese\nClinical Trial Registration: ChiCTR2400086816.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}