{"id":"2407.11827","title":"GPT Assisted Annotation of Rhetorical and Linguistic Features for\n  Interpretable Propaganda Technique Detection in News Text","authors":"Kyle Hamilton, Luca Longo, Bojan Bozic","authorsParsed":[["Hamilton","Kyle",""],["Longo","Luca",""],["Bozic","Bojan",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:15:39 GMT"}],"updateDate":"2024-07-17","timestamp":1721142939000,"abstract":"  While the use of machine learning for the detection of propaganda techniques\nin text has garnered considerable attention, most approaches focus on\n\"black-box\" solutions with opaque inner workings. Interpretable approaches\nprovide a solution, however, they depend on careful feature engineering and\ncostly expert annotated data. Additionally, language features specific to\npropagandistic text are generally the focus of rhetoricians or linguists, and\nthere is no data set labeled with such features suitable for machine learning.\nThis study codifies 22 rhetorical and linguistic features identified in\nliterature related to the language of persuasion for the purpose of annotating\nan existing data set labeled with propaganda techniques. To help human experts\nannotate natural language sentences with these features, RhetAnn, a web\napplication, was specifically designed to minimize an otherwise considerable\nmental effort. Finally, a small set of annotated data was used to fine-tune\nGPT-3.5, a generative large language model (LLM), to annotate the remaining\ndata while optimizing for financial cost and classification accuracy. This\nstudy demonstrates how combining a small number of human annotated examples\nwith GPT can be an effective strategy for scaling the annotation process at a\nfraction of the cost of traditional annotation relying solely on human experts.\nThe results are on par with the best performing model at the time of writing,\nnamely GPT-4, at 10x less the cost. Our contribution is a set of features,\ntheir properties, definitions, and examples in a machine-readable format, along\nwith the code for RhetAnn and the GPT prompts and fine-tuning procedures for\nadvancing state-of-the-art interpretable propaganda technique detection.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Azx1T97S6DmSJJCYjngVLCW8nbQKdrUu5P5DReamANM","pdfSize":"1181883","objectId":"0x5226d1257c14c69e51af0ab00cd843aeb916fb784638ef6123a0b8172f90f88a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
