{"id":"2407.05606","title":"Surface and curvature tensions of cold dense quark matter: a\n  term-by-term analysis within the Nambu-Jona-Lasinio model","authors":"A. G. Grunfeld, M. F. Izzo Villafa\\~ne and G. Lugones","authorsParsed":[["Grunfeld","A. G.",""],["Villafañe","M. F. Izzo",""],["Lugones","G.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 04:43:13 GMT"}],"updateDate":"2024-07-09","timestamp":1720413793000,"abstract":"  In this paper, we conduct a thorough investigation of the surface and\ncurvature tensions, $\\sigma$ and $\\gamma$, of three-flavor cold quark matter\nusing the Nambu-Jona-Lasinio (NJL) model with vector interactions. Our approach\nensures both local and global electric charge neutrality, as well as chemical\nequilibrium under weak interactions. By employing the multiple reflection\nexpansion formalism to account for finite size effects, we explore the impact\nof specific input parameters, particularly the vector coupling constant ratio\n$\\eta_V$, the radius $R$ of quark matter droplets, as well as charge-per-baryon\nratio $\\xi$ of the finite size configurations. We focus on the role of the\ncontributions of each term of the NJL Lagrangian to the surface and curvature\ntensions in the mean field approximation. We find that the total surface\ntension exhibits two different density regimes: it remains roughly constant at\naround $100 \\, \\mathrm{MeV \\, fm^{-2}}$ up to approximately $2-4$ times the\nnuclear saturation density, and beyond this point, it becomes a steeply\nincreasing function of $n_B$. The total surface and curvature tensions are\nrelatively insensitive to variations in $R$ but are affected by changes in\n$\\xi$ and $\\eta_V$. We observe that the largest contribution to $\\sigma$ and\n$\\gamma$ comes from the regularized divergent term, making these quantities\nsignificantly higher than those obtained within the MIT bag model.\n","subjects":["Physics/Nuclear Theory","Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}