{"id":"2407.18875","title":"Generative Adversarial Networks for Imputing Sparse Learning Performance","authors":"Liang Zhang, Mohammed Yeasin, Jionghao Lin, Felix Havugimana, Xiangen\n  Hu","authorsParsed":[["Zhang","Liang",""],["Yeasin","Mohammed",""],["Lin","Jionghao",""],["Havugimana","Felix",""],["Hu","Xiangen",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:09:48 GMT"}],"updateDate":"2024-07-29","timestamp":1722013788000,"abstract":"  Learning performance data, such as correct or incorrect responses to\nquestions in Intelligent Tutoring Systems (ITSs) is crucial for tracking and\nassessing the learners' progress and mastery of knowledge. However, the issue\nof data sparsity, characterized by unexplored questions and missing attempts,\nhampers accurate assessment and the provision of tailored, personalized\ninstruction within ITSs. This paper proposes using the Generative Adversarial\nImputation Networks (GAIN) framework to impute sparse learning performance\ndata, reconstructed into a three-dimensional (3D) tensor representation across\nthe dimensions of learners, questions and attempts. Our customized GAIN-based\nmethod computational process imputes sparse data in a 3D tensor space,\nsignificantly enhanced by convolutional neural networks for its input and\noutput layers. This adaptation also includes the use of a least squares loss\nfunction for optimization and aligns the shapes of the input and output with\nthe dimensions of the questions-attempts matrices along the learners'\ndimension. Through extensive experiments on six datasets from various ITSs,\nincluding AutoTutor, ASSISTments and MATHia, we demonstrate that the GAIN\napproach generally outperforms existing methods such as tensor factorization\nand other generative adversarial network (GAN) based approaches in terms of\nimputation accuracy. This finding enhances comprehensive learning data modeling\nand analytics in AI-based education.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vfShgQ29Y6EJeDFLNGLzXgwm0E-j3sNkyLZCYlrqfss","pdfSize":"1268379"}
