{"id":"2407.09688","title":"Large Language Models for Integrating Social Determinant of Health Data:\n  A Case Study on Heart Failure 30-Day Readmission Prediction","authors":"Chase Fensore, Rodrigo M. Carrillo-Larco, Shivani A. Patel, Alanna A.\n  Morris, Joyce C. Ho","authorsParsed":[["Fensore","Chase",""],["Carrillo-Larco","Rodrigo M.",""],["Patel","Shivani A.",""],["Morris","Alanna A.",""],["Ho","Joyce C.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 21:14:06 GMT"}],"updateDate":"2024-07-16","timestamp":1720818846000,"abstract":"  Social determinants of health (SDOH) $-$ the myriad of circumstances in which\npeople live, grow, and age $-$ play an important role in health outcomes.\nHowever, existing outcome prediction models often only use proxies of SDOH as\nfeatures. Recent open data initiatives present an opportunity to construct a\nmore comprehensive view of SDOH, but manually integrating the most relevant\ndata for individual patients becomes increasingly challenging as the volume and\ndiversity of public SDOH data grows. Large language models (LLMs) have shown\npromise at automatically annotating structured data. Here, we conduct an\nend-to-end case study evaluating the feasibility of using LLMs to integrate\nSDOH data, and the utility of these SDOH features for clinical prediction. We\nfirst manually label 700+ variables from two publicly-accessible SDOH data\nsources to one of five semantic SDOH categories. Then, we benchmark performance\nof 9 open-source LLMs on this classification task. Finally, we train ML models\nto predict 30-day hospital readmission among 39k heart failure (HF) patients,\nand we compare the prediction performance of the categorized SDOH variables\nwith standard clinical variables. Additionally, we investigate the impact of\nfew-shot LLM prompting on LLM annotation performance, and perform a metadata\nablation study on prompts to evaluate which information helps LLMs accurately\nannotate these variables. We find that some open-source LLMs can effectively,\naccurately annotate SDOH variables with zero-shot prompting without the need\nfor fine-tuning. Crucially, when combined with standard clinical features, the\nLLM-annotated Neighborhood and Built Environment subset of the SDOH variables\nshows the best performance predicting 30-day readmission of HF patients.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}