{"id":"2407.19172","title":"Bridging the gap between micro-economics and micro-mobility: a\n  two-dimensional risk-based microscopic model of pedestrians' and bicyclists'\n  operational behaviors","authors":"Mohaiminul Haque, Samer Hamdar and Alireza Talebpour","authorsParsed":[["Haque","Mohaiminul",""],["Hamdar","Samer",""],["Talebpour","Alireza",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 05:00:51 GMT"}],"updateDate":"2024-07-30","timestamp":1722056451000,"abstract":"  Due to the inherent safety concerns associated with traffic movement in\nunconstrained two-dimensional settings, it is important that pedestrians' and\nother modes' movements such as bicyclists are modeled as a risk-taking\nstochastic dynamic process that may lead to errors and thus contacts and\ncollisions. Among the existing models that may capture risk-taking behaviors\nare: 1) the social force models (through the interplay of the repulsion and the\nattraction force parameters); 2) and the discrete-choice models (through the\nrationality or the bounded rationality paradigm while weighing different\nalternatives). Given that the social force models may not readily capture the\ncontact/collision dynamics through the Newtonian force framework,\ndecision-making theories are hypothesized as a feasible approach to formulate a\nnew model that can account for cognitive and behavioral dimensions such as\nuncertainty and risk. However, instead of relying on the bounded rationality\ntheory, in this paper, a generalized Prospect Theory based microsimulation\nmodel is proposed. The model relies on the micro-economics Prospect Theory\nparadigm where pedestrians or bicyclists (i.e., micro-mobility users) evaluate\ntheir speed and directional alternatives while considering the possibility of\ncolliding with other obstacles/users. A numerical analysis on the main model\nparameters is presented. The model is then calibrated and validated using two\nreal-world data sets with trajectories recorded in naturalistic settings. With\nthe calibrated parameters studied, simulation exercises and sensitivity\nanalysis are conducted to recreate bottlenecks and lane formations in different\nconditions. The findings show that the proposed model's parameters reflect the\nrisk-taking tendencies of different roadway users in mixed right-of-way's\nenvironments while showing realistic microscopic and macroscopic traffic flow\ncharacteristics.\n","subjects":["Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6BKRx-wTLjMm9Vtle6CWyle6eTaDN6nxNs2nnJvdMt8","pdfSize":"18234080","objectId":"0x6ec718f6d469b3d78ba3f9dfac7369597abc7c4125c12b60d44ee58c74568887","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
