{"id":"2407.01869","title":"Let it shine: Autofluorescence of Papanicolaou-stain improves AI-based\n  cytological oral cancer detection","authors":"Wenyi Lian, Joakim Lindblad, Christina Runow Stark, Jan-Micha\\'el\n  Hirsch, Nata\\v{s}a Sladoje","authorsParsed":[["Lian","Wenyi",""],["Lindblad","Joakim",""],["Stark","Christina Runow",""],["Hirsch","Jan-Michaél",""],["Sladoje","Nataša",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 01:05:35 GMT"}],"updateDate":"2024-07-03","timestamp":1719882335000,"abstract":"  Oral cancer is a global health challenge. It is treatable if detected early,\nbut it is often fatal in late stages. There is a shift from the invasive and\ntime-consuming tissue sampling and histological examination, toward\nnon-invasive brush biopsies and cytological examination. Reliable\ncomputer-assisted methods are essential for cost-effective and accurate\ncytological analysis, but the lack of detailed cell-level annotations impairs\nmodel effectiveness. This study aims to improve AI-based oral cancer detection\nusing multimodal imaging and deep fusion. We combine brightfield and\nfluorescence whole slide microscopy imaging to analyze Papanicolaou-stained\nliquid-based cytology slides of brush biopsies collected from both healthy and\ncancer patients. Due to limited cytological annotations, we utilize a weakly\nsupervised deep learning approach using only patient-level labels. We evaluate\nvarious multimodal fusion strategies, including early, late, and three recent\nintermediate fusion methods. Our results show: (i) fluorescence imaging of\nPapanicolaou-stained samples provides substantial diagnostic information; (ii)\nmultimodal fusion enhances classification and cancer detection accuracy over\nsingle-modality methods. Intermediate fusion is the leading method among the\nstudied approaches. Specifically, the Co-Attention Fusion Network (CAFNet)\nmodel excels with an F1 score of 83.34% and accuracy of 91.79%, surpassing\nhuman performance on the task. Additional tests highlight the need for precise\nimage registration to optimize multimodal analysis benefits. This study\nadvances cytopathology by combining deep learning and multimodal imaging to\nenhance early, non-invasive detection of oral cancer, improving diagnostic\naccuracy and streamlining clinical workflows. The developed pipeline is also\napplicable in other cytological settings. Our codes and dataset are available\nonline for further research.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}