{"id":"2407.11245","title":"Pacer and Runner: Cooperative Learning Framework between Single- and\n  Cross-Domain Sequential Recommendation","authors":"Chung Park, Taesan Kim, Hyungjun Yoon, Junui Hong, Yelim Yu, Mincheol\n  Cho, Minsung Choi, Jaegul Choo","authorsParsed":[["Park","Chung",""],["Kim","Taesan",""],["Yoon","Hyungjun",""],["Hong","Junui",""],["Yu","Yelim",""],["Cho","Mincheol",""],["Choi","Minsung",""],["Choo","Jaegul",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 21:14:13 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 11:54:26 GMT"}],"updateDate":"2024-07-25","timestamp":1721078053000,"abstract":"  Cross-Domain Sequential Recommendation (CDSR) improves recommendation\nperformance by utilizing information from multiple domains, which contrasts\nwith Single-Domain Sequential Recommendation (SDSR) that relies on a historical\ninteraction within a specific domain. However, CDSR may underperform compared\nto the SDSR approach in certain domains due to negative transfer, which occurs\nwhen there is a lack of relation between domains or different levels of data\nsparsity. To address the issue of negative transfer, our proposed CDSR model\nestimates the degree of negative transfer of each domain and adaptively assigns\nit as a weight factor to the prediction loss, to control gradient flows through\ndomains with significant negative transfer. To this end, our model compares the\nperformance of a model trained on multiple domains (CDSR) with a model trained\nsolely on the specific domain (SDSR) to evaluate the negative transfer of each\ndomain using our asymmetric cooperative network. In addition, to facilitate the\ntransfer of valuable cues between the SDSR and CDSR tasks, we developed an\nauxiliary loss that maximizes the mutual information between the representation\npairs from both tasks on a per-domain basis. This cooperative learning between\nSDSR and CDSR tasks is similar to the collaborative dynamics between pacers and\nrunners in a marathon. Our model outperformed numerous previous works in\nextensive experiments on two real-world industrial datasets across ten service\ndomains. We also have deployed our model in the recommendation system of our\npersonal assistant app service, resulting in 21.4% increase in click-through\nrate compared to existing models, which is valuable to real-world business.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}