{"id":"2407.05259","title":"Multi-scale Conditional Generative Modeling for Microscopic Image\n  Restoration","authors":"Luzhe Huang, Xiongye Xiao, Shixuan Li, Jiawen Sun, Yi Huang, Aydogan\n  Ozcan, Paul Bogdan","authorsParsed":[["Huang","Luzhe",""],["Xiao","Xiongye",""],["Li","Shixuan",""],["Sun","Jiawen",""],["Huang","Yi",""],["Ozcan","Aydogan",""],["Bogdan","Paul",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 05:11:00 GMT"}],"updateDate":"2024-07-09","timestamp":1720329060000,"abstract":"  The advance of diffusion-based generative models in recent years has\nrevolutionized state-of-the-art (SOTA) techniques in a wide variety of image\nanalysis and synthesis tasks, whereas their adaptation on image restoration,\nparticularly within computational microscopy remains theoretically and\nempirically underexplored. In this research, we introduce a multi-scale\ngenerative model that enhances conditional image restoration through a novel\nexploitation of the Brownian Bridge process within wavelet domain. By\ninitiating the Brownian Bridge diffusion process specifically at the\nlowest-frequency subband and applying generative adversarial networks at\nsubsequent multi-scale high-frequency subbands in the wavelet domain, our\nmethod provides significant acceleration during training and sampling while\nsustaining a high image generation quality and diversity on par with SOTA\ndiffusion models. Experimental results on various computational microscopy and\nimaging tasks confirm our method's robust performance and its considerable\nreduction in its sampling steps and time. This pioneering technique offers an\nefficient image restoration framework that harmonizes efficiency with quality,\nsignifying a major stride in incorporating cutting-edge generative models into\ncomputational microscopy workflows.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}