{"id":"2407.10595","title":"On full-separating sets in graphs","authors":"Dipayan Chakraborty and Annegret K. Wagler","authorsParsed":[["Chakraborty","Dipayan",""],["Wagler","Annegret K.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 10:17:02 GMT"}],"updateDate":"2024-07-16","timestamp":1721038622000,"abstract":"  Several different types of identification problems have been already studied\nin the literature, where the objective is to distinguish any two vertices of a\ngraph by their unique neighborhoods in a suitably chosen dominating or\ntotal-dominating set of the graph, often referred to as a \\emph{code}. To study\nsuch problems under a unifying point of view, reformulations of the already\nstudied problems in terms of covering problems in suitably constructed\nhypergraphs have been provided. Analyzing these hypergraph representations, we\nintroduce a new separation property, called \\emph{full-separation}, which has\nnot yet been considered in the literature so far. We study it in combination\nwith both domination and total-domination, and call the resulting codes\n\\emph{full-separating-dominating codes} (or \\emph{FD-codes} for short) and\n\\emph{full-separating-total-dominating codes} (or \\emph{FTD-codes} for short),\nrespectively. We address the conditions for the existence of FD- and FTD-codes,\nbounds for their size and their relation to codes of the other types. We show\nthat the problems of determining an FD- or an FTD-code of minimum cardinality\nin a graph is NP-hard. We also show that the cardinalities of minimum FD- and\nFTD-codes differ by at most one, but that it is NP-complete to decide if they\nare equal for a given graph in general. We find the exact values of minimum\ncardinalities of the FD- and FTD-codes on some familiar graph classes like\npaths, cycles, half-graphs and spiders. This helps us compare the two codes\nwith other codes on these graph families thereby exhibiting extremal cases for\nseveral lower bounds.\n","subjects":["Mathematics/Combinatorics","Computing Research Repository/Computational Complexity","Computing Research Repository/Discrete Mathematics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ugsCJ6AWvMO18UY7rqUE9QpGzSbAPPaZNOKoOyuaqKs","pdfSize":"694176"}
