{"id":"2407.04814","title":"Unified Model for Probing Solar Cell Dynamics via Cyclic Voltammetry and\n  Impedance Spectroscopy","authors":"Victor Lopez-Richard, Luiz A. Meneghetti Jr, Gabriel L. Nogueira,\n  Fabian Hartmann, Carlos F. O. Graeff","authorsParsed":[["Lopez-Richard","Victor",""],["Meneghetti","Luiz A.","Jr"],["Nogueira","Gabriel L.",""],["Hartmann","Fabian",""],["Graeff","Carlos F. O.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 18:53:53 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 16:09:29 GMT"}],"updateDate":"2024-09-16","timestamp":1720205633000,"abstract":"  Despite the remarkable progress in emerging solar cell technologies such as\nhybrid organic-inorganic perovskites, there are still significant limitations\nrelated to the stability of the devices and their non-ideal electrical behavior\nunder certain external stimuli. We present a conceptual framework for\ncharacterizing photovoltaic devices by integrating cyclic voltammetry (CV) and\nimpedance spectroscopy (IS). This framework is constructed from a microscopic,\nmulti-mode perspective that explicitly accounts for drift, diffusion,\ndisplacement, and memory contributions. We derive comprehensive analytical\nexpressions for current-voltage relationships and complex admittance. Our model\nreveals the inseparable connection between hysteresis behaviors in\ncurrent-voltage characteristics observed in CV and the apparent capacitive and\ninductive behaviors seen in IS spectral analysis. We demonstrate how CV and IS\nnaturally complement each other, providing a deeper microscopic understanding\nof device performance and limitations. Additionally, we establish the\nrelationship between intrinsic material parameters and experimentally\naccessible extrinsic parameters such as light intensity, temperature, DC bias,\nvoltage amplitude, and frequency. This framework enables unprecedented\noptimization of solar cell performance, marking a significant advancement\ntowards sustainability.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}