{"id":"2407.10512","title":"MARVEL: MR Fingerprinting with Additional micRoVascular Estimates using\n  bidirectional LSTMs","authors":"Antoine Barrier (GIN), Thomas Coudert (GIN), Aur\\'elien Delphin\n  (IRMaGe), Benjamin Lemasson (GIN), Thomas Christen (GIN)","authorsParsed":[["Barrier","Antoine","","GIN"],["Coudert","Thomas","","GIN"],["Delphin","Aurélien","","IRMaGe"],["Lemasson","Benjamin","","GIN"],["Christen","Thomas","","GIN"]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 08:09:54 GMT"}],"updateDate":"2024-07-16","timestamp":1721030994000,"abstract":"  The Magnetic Resonance Fingerprinting (MRF) approach aims to estimate\nmultiple MR or physiological parameters simultaneously with a single fast\nacquisition sequence. Most of the MRF studies proposed so far have used simple\nMR sequence types to measure relaxation times (T1, T2). In that case, deep\nlearning algorithms have been successfully used to speed up the reconstruction\nprocess. In theory, the MRF concept could be used with a variety of other MR\nsequence types and should be able to provide more information about the tissue\nmicrostructures. Yet, increasing the complexity of the numerical models often\nleads to prohibited simulation times, and estimating multiple parameters from\none sequence implies new dictionary dimensions whose sizes become too large for\nstandard computers and DL architectures.In this paper, we propose to analyze\nthe MRF signal coming from a complex balance Steady-state free precession\n(bSSFP) type sequence to simultaneously estimate relaxometry maps (T1, T2),\nField maps (B1, B0) as well as microvascular properties such as the local\nCerebral Blood Volume (CBV) or the averaged vessel Radius (R).To bypass the\ncurse of dimensionality, we propose an efficient way to simulate the MR signal\ncoming from numerical voxels containing realistic microvascular networks as\nwell as a Bidirectional Long Short-Term Memory network used for the matching\nprocess.On top of standard MRF maps, our results on 3 human volunteers suggest\nthat our approach can quickly produce high-quality quantitative maps of\nmicrovascular parameters that are otherwise obtained using longer dedicated\nsequences and intravenous injection of a contrast agent. This approach could be\nused for the management of multiple pathologies and could be tuned to provide\nother types of microstructural information.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}