{"id":"2407.09920","title":"MutDet: Mutually Optimizing Pre-training for Remote Sensing Object\n  Detection","authors":"Ziyue Huang, Yongchao Feng, Qingjie Liu, and Yunhong Wang","authorsParsed":[["Huang","Ziyue",""],["Feng","Yongchao",""],["Liu","Qingjie",""],["Wang","Yunhong",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 15:28:15 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 14:11:17 GMT"}],"updateDate":"2024-07-25","timestamp":1720884495000,"abstract":"  Detection pre-training methods for the DETR series detector have been\nextensively studied in natural scenes, e.g., DETReg. However, the detection\npre-training remains unexplored in remote sensing scenes. In existing\npre-training methods, alignment between object embeddings extracted from a\npre-trained backbone and detector features is significant. However, due to\ndifferences in feature extraction methods, a pronounced feature discrepancy\nstill exists and hinders the pre-training performance. The remote sensing\nimages with complex environments and more densely distributed objects\nexacerbate the discrepancy. In this work, we propose a novel Mutually\noptimizing pre-training framework for remote sensing object Detection, dubbed\nas MutDet. In MutDet, we propose a systemic solution against this challenge.\nFirstly, we propose a mutual enhancement module, which fuses the object\nembeddings and detector features bidirectionally in the last encoder layer,\nenhancing their information interaction.Secondly, contrastive alignment loss is\nemployed to guide this alignment process softly and simultaneously enhances\ndetector features' discriminativity. Finally, we design an auxiliary siamese\nhead to mitigate the task gap arising from the introduction of enhancement\nmodule. Comprehensive experiments on various settings show new state-of-the-art\ntransfer performance. The improvement is particularly pronounced when data\nquantity is limited. When using 10% of the DIOR-R data, MutDet improves DetReg\nby 6.1% in AP50. Codes and models are available at:\nhttps://github.com/floatingstarZ/MutDet.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JHnsn5QO0QTXYctiDEiRlGY-_ok-LAV6ivRStZgD15I","pdfSize":"2135399","objectId":"0x06cc1ac22a199188b8802b855c2f1940337c4c41422e5aa6949996c4b21283a9","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
