{"id":"2407.02625","title":"Lung-CADex: Fully automatic Zero-Shot Detection and Classification of\n  Lung Nodules in Thoracic CT Images","authors":"Furqan Shaukat, Syed Muhammad Anwar, Abhijeet Parida, Van Khanh Lam,\n  Marius George Linguraru, Mubarak Shah","authorsParsed":[["Shaukat","Furqan",""],["Anwar","Syed Muhammad",""],["Parida","Abhijeet",""],["Lam","Van Khanh",""],["Linguraru","Marius George",""],["Shah","Mubarak",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 19:30:25 GMT"}],"updateDate":"2024-07-04","timestamp":1719948625000,"abstract":"  Lung cancer has been one of the major threats to human life for decades.\nComputer-aided diagnosis can help with early lung nodul detection and\nfacilitate subsequent nodule characterization. Large Visual Language models\n(VLMs) have been found effective for multiple downstream medical tasks that\nrely on both imaging and text data. However, lesion level detection and\nsubsequent diagnosis using VLMs have not been explored yet. We propose CADe,\nfor segmenting lung nodules in a zero-shot manner using a variant of the\nSegment Anything Model called MedSAM. CADe trains on a prompt suite on input\ncomputed tomography (CT) scans by using the CLIP text encoder through prefix\ntuning. We also propose, CADx, a method for the nodule characterization as\nbenign/malignant by making a gallery of radiomic features and aligning\nimage-feature pairs through contrastive learning. Training and validation of\nCADe and CADx have been done using one of the largest publicly available\ndatasets, called LIDC. To check the generalization ability of the model, it is\nalso evaluated on a challenging dataset, LUNGx. Our experimental results show\nthat the proposed methods achieve a sensitivity of 0.86 compared to 0.76 that\nof other fully supervised methods.The source code, datasets and pre-processed\ndata can be accessed using the link:\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4PZD-Jg630tHJuGkpD_3YN9ilMFl2WgnI9Oi3zr4KVM","pdfSize":"510399"}
