{"id":"2407.00015","title":"A New Approach for Evaluating the Performance of Distributed\n  Latency-Sensitive Services","authors":"Theodoros Theodoropoulos, John Violos, Antonios Makris, Konstantinos\n  Tserpes","authorsParsed":[["Theodoropoulos","Theodoros",""],["Violos","John",""],["Makris","Antonios",""],["Tserpes","Konstantinos",""]],"versions":[{"version":"v1","created":"Wed, 1 May 2024 13:47:31 GMT"}],"updateDate":"2024-07-02","timestamp":1714571251000,"abstract":"  Conventional latency metrics are formulated based on a broad definition of\ntraditional monolithic services, and hence lack the capacity to address the\ncomplexities inherent in modern services and distributed computing paradigms.\nConsequently, their effectiveness in identifying areas for improvement is\nrestricted, falling short of providing a comprehensive evaluation of service\nperformance within the context of contemporary services and computing\nparadigms. More specifically, these metrics do not offer insights into two\ncritical aspects of service performance: the frequency of latency surpassing\nspecified Service Level Agreement (SLA) thresholds and the time required for\nlatency to return to an acceptable level once the threshold is exceeded. This\nlimitation is quite significant in the frame of contemporary latency-sensitive\nservices, and especially immersive services that require deterministic low\nlatency that behaves in a consistent manner. Towards addressing this\nlimitation, the authors of this work propose 5 novel latency metrics that when\nleveraged alongside the conventional latency metrics manage to provide advanced\ninsights that can be potentially used to improve service performance. The\nvalidity and usefulness of the proposed metrics in the frame of providing\nadvanced insights into service performance is evaluated using a large-scale\nexperiment.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YsVOf4BVP8gEwbSKLkGyYNi0-5Rm-qgGkfJ49xJeGVk","pdfSize":"121278"}
