{"id":"2407.06174","title":"The Tug-of-War Between Deepfake Generation and Detection","authors":"Hannah Lee, Changyeon Lee, Kevin Farhat, Lin Qiu, Steve Geluso, Aerin\n  Kim, Oren Etzioni","authorsParsed":[["Lee","Hannah",""],["Lee","Changyeon",""],["Farhat","Kevin",""],["Qiu","Lin",""],["Geluso","Steve",""],["Kim","Aerin",""],["Etzioni","Oren",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:49:41 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 19:13:19 GMT"},{"version":"v3","created":"Fri, 26 Jul 2024 01:09:35 GMT"},{"version":"v4","created":"Wed, 21 Aug 2024 16:33:02 GMT"}],"updateDate":"2024-08-22","timestamp":1720460981000,"abstract":"  Multimodal generative models are rapidly evolving, leading to a surge in the\ngeneration of realistic video and audio that offers exciting possibilities but\nalso serious risks. Deepfake videos, which can convincingly impersonate\nindividuals, have particularly garnered attention due to their potential misuse\nin spreading misinformation and creating fraudulent content. This survey paper\nexamines the dual landscape of deepfake video generation and detection,\nemphasizing the need for effective countermeasures against potential abuses. We\nprovide a comprehensive overview of current deepfake generation techniques,\nincluding face swapping, reenactment, and audio-driven animation, which\nleverage cutting-edge technologies like GANs and diffusion models to produce\nhighly realistic fake videos. Additionally, we analyze various detection\napproaches designed to differentiate authentic from altered videos, from\ndetecting visual artifacts to deploying advanced algorithms that pinpoint\ninconsistencies across video and audio signals.\n  The effectiveness of these detection methods heavily relies on the diversity\nand quality of datasets used for training and evaluation. We discuss the\nevolution of deepfake datasets, highlighting the importance of robust, diverse,\nand frequently updated collections to enhance the detection accuracy and\ngeneralizability. As deepfakes become increasingly indistinguishable from\nauthentic content, developing advanced detection techniques that can keep pace\nwith generation technologies is crucial. We advocate for a proactive approach\nin the \"tug-of-war\" between deepfake creators and detectors, emphasizing the\nneed for continuous research collaboration, standardization of evaluation\nmetrics, and the creation of comprehensive benchmarks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}