{"id":"2407.06570","title":"Attack GAN (AGAN ): A new Security Evaluation Tool for Perceptual\n  Encryption","authors":"Umesh Kashyap, Sudev Kumar Padhi and Sk. Subidh Ali","authorsParsed":[["Kashyap","Umesh",""],["Padhi","Sudev Kumar",""],["Ali","Sk. Subidh",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 06:03:32 GMT"}],"updateDate":"2024-07-10","timestamp":1720505012000,"abstract":"  Training state-of-the-art (SOTA) deep learning models requires a large amount\nof data. The visual information present in the training data can be misused,\nwhich creates a huge privacy concern. One of the prominent solutions for this\nissue is perceptual encryption, which converts images into an unrecognizable\nformat to protect the sensitive visual information in the training data. This\ncomes at the cost of a significant reduction in the accuracy of the models.\nAdversarial Visual Information Hiding (AV IH) overcomes this drawback to\nprotect image privacy by attempting to create encrypted images that are\nunrecognizable to the human eye while keeping relevant features for the target\nmodel. In this paper, we introduce the Attack GAN (AGAN ) method, a new\nGenerative Adversarial Network (GAN )-based attack that exposes multiple\nvulnerabilities in the AV IH method. To show the adaptability, the AGAN is\nextended to traditional perceptual encryption methods of Learnable encryption\n(LE) and Encryption-then-Compression (EtC). Extensive experiments were\nconducted on diverse image datasets and target models to validate the efficacy\nof our AGAN method. The results show that AGAN can successfully break\nperceptual encryption methods by reconstructing original images from their AV\nIH encrypted images. AGAN can be used as a benchmark tool to evaluate the\nrobustness of encryption methods for privacy protection such as AV IH.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"1rG8FJvx6YPElCUzMaeQ4Ytyy40c9UQ9nBcYQ-VaX4k","pdfSize":"3210024"}
