{"id":"2407.18718","title":"Nova contributions to the chemical evolution of the Milky Way","authors":"Alex J. Kemp, Amanda I. Karakas, Andrew R. Casey, Benoit Cote, Robert\n  G. Izzard, Zara Osborn","authorsParsed":[["Kemp","Alex J.",""],["Karakas","Amanda I.",""],["Casey","Andrew R.",""],["Cote","Benoit",""],["Izzard","Robert G.",""],["Osborn","Zara",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 13:07:14 GMT"}],"updateDate":"2024-07-29","timestamp":1721999234000,"abstract":"  Context. The explosive burning that drives nova eruptions results in unique\nnucleosynthesis that heavily over-produces certain isotopes relative to the\nsolar abundance. However, novae are often ignored when considering the chemical\nevolution of our Galaxy due to their low ejecta masses. Aims. In this work, we\nuse previously computed synthetic nova populations and the galactic chemical\nevolution code OMEGA+ to assess the impact that novae have on the evolution of\nstable elemental and isotopic abundances. Methods. We combine populations of\nnovae computed using the binary population synthesis code binary_c with the\ngalactic chemical evolution code OMEGA+ and detailed, white dwarf\nmass-dependent nova yields to model the nucleosynthetic contributions of novae\nto the evolution of the Milky Way. We consider three different nova yield\nprofiles, each corresponding to a different set of nova yield calculations.\nResults. Despite novae from low-mass white dwarfs (WDs) dominating nova ejecta\ncontributions, we find that novae occurring on massive WDs are still able to\ncontribute significantly to many isotopes, particularly those with high mass\nnumbers. We find that novae can produce up to 35% of the Galactic 13C and 15N\nmass by the time the model Galaxy reaches [Fe/H] = 0, and earlier in the\nevolution of the Galaxy (between [Fe/H] = -2 and -1) novae may have been the\ndominant source of 15N. Predictions for [13C/Fe], [15N/Fe], 12C/13C, and\n14N/15N abundances ratios vary by up to 0.2 dex at [Fe/H] = 0 and by up to 0.7\ndex in [15N/Fe] and 14N/15N between [Fe/H] = -2 and -1 (corresponding\napproximately to Galactic ages of 170 Myr and 1 Gyr in our model). The Galactic\nevolution of other stable isotopes (excluding Li) is not noticeably affected by\nincluding novae.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}