{"id":"2407.13507","title":"Strength of 2D Glasses Explored by Machine-Learning Force Fields","authors":"Pengjie Shi and Zhiping Xu","authorsParsed":[["Shi","Pengjie",""],["Xu","Zhiping",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 13:42:03 GMT"}],"updateDate":"2024-08-13","timestamp":1721310123000,"abstract":"  The strengths of glasses are intricately linked to their atomic-level\nheterogeneity. Atomistic simulations are frequently used to investigate the\nstatistical physics of this relationship, compensating for the limited\nspatiotemporal resolution in experimental studies. However, theoretical\ninsights are limited by the complexity of glass structures and the accuracy of\nthe interatomic potentials used in simulations. Here, we investigate the\nstrengths and fracture mechanisms of 2D silica, with all structural units\naccessible to direct experimental observation. We develop a neural network\nforce field for fracture (NN-F$^{3}$) based on the deep potential-smooth\nedition (DeepPot-SE) framework. Representative atomic structures across\ncrystals, nanocrystalline, paracrystalline, and continuous random network\nglasses are studied. We find that the virials or bond lengths control the\ninitialization of bond-breaking events, creating nanoscale voids in the\nvitreous network. However, the voids do not necessarily lead to crack\npropagation due to a disorder-trapping effect, which is stronger than the\nlattice-trapping effect in a crystalline lattice and occurs over larger length\nand time scales. Fracture initiation proceeds with void growth and coalescence,\nand advances through a bridging mechanism. The fracture patterns are shaped by\nsubsequent trapping and cleavage steps, often guided by voids forming ahead of\nthe crack tip. These heterogeneous processes result in atomically smooth facets\nin crystalline regions and rough, amorphous edges in the glassy phase. These\ninsights into 2D crystals and glasses, both sharing SiO$_{2}$ chemistry,\nhighlight the pivotal role of atomic-level structures in determining fracture\nkinetics and path selection in materials.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qI6CEQjeRn7L6Pq1eoshCul8gnJGzBEz9_aClobrYmk","pdfSize":"8231435"}
