{"id":"2407.05873","title":"Receiver Selection and Transmit Beamforming for Multi-static Integrated\n  Sensing and Communications","authors":"Dan Wang, Yuanming Tian, Chuan Huang, Hao Chen, Xiaodong Xu, and Ping\n  Zhang","authorsParsed":[["Wang","Dan",""],["Tian","Yuanming",""],["Huang","Chuan",""],["Chen","Hao",""],["Xu","Xiaodong",""],["Zhang","Ping",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 12:32:57 GMT"}],"updateDate":"2024-07-09","timestamp":1720441977000,"abstract":"  Next-generation wireless networks are expected to develop a novel paradigm of\nintegrated sensing and communications (ISAC) to enable both the high-accuracy\nsensing and high-speed communications. However, conventional mono-static ISAC\nsystems, which simultaneously transmit and receive at the same equipment, may\nsuffer from severe self-interference, and thus significantly degrade the system\nperformance.To address this issue, this paper studies a multi-static ISAC\nsystem for cooperative target localization and communications, where the\ntransmitter transmits ISAC signal to multiple receivers (REs) deployed at\ndifferent positions. We derive the closed-form Cram\\'{e}r-Rao bound (CRB) on\nthe joint estimations of both the transmission delay and Doppler shift for\ncooperative target localization, and the CRB minimization problem is formulated\nby considering the cooperative cost and communication rate requirements for the\nREs. To solve this problem, we first decouple it into two subproblems for RE\nselection and transmit beamforming, respectively. Then, a minimax linkage-based\nmethod is proposed to solve the RE selection subproblem, and a successive\nconvex approximation algorithm is adopted to deal with the transmit beamforming\nsubproblem with non-convex constraints. Finally, numerical results validate our\nanalysis and reveal that our proposed multi-static ISAC scheme achieves better\nISAC performance than the conventional mono-static ones when the number of\ncooperative REs is large.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}