{"id":"2407.03992","title":"Performance of Medical Image Fusion in High-level Analysis Tasks: A\n  Mutual Enhancement Framework for Unaligned PAT and MRI Image Fusion","authors":"Yutian Zhong, Jinchuan He, Zhichao Liang, Shuangyang Zhang, Qianjin\n  Feng, Wufan Chen and Li Qi","authorsParsed":[["Zhong","Yutian",""],["He","Jinchuan",""],["Liang","Zhichao",""],["Zhang","Shuangyang",""],["Feng","Qianjin",""],["Chen","Wufan",""],["Qi","Li",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 15:13:32 GMT"}],"updateDate":"2024-07-08","timestamp":1720106012000,"abstract":"  Photoacoustic tomography (PAT) offers optical contrast, whereas magnetic\nresonance imaging (MRI) excels in imaging soft tissue and organ anatomy. The\nfusion of PAT with MRI holds promising application prospects due to their\ncomplementary advantages. Existing image fusion have made considerable progress\nin pre-registered images, yet spatial deformations are difficult to avoid in\nmedical imaging scenarios. More importantly, current algorithms focus on visual\nquality and statistical metrics, thus overlooking the requirements of\nhigh-level tasks. To address these challenges, we proposes a unsupervised\nfusion model, termed PAMRFuse+, which integrates image generation and\nregistration. Specifically, a cross-modal style transfer network is introduced\nto simplify cross-modal registration to single-modal registration.\nSubsequently, a multi-level registration network is employed to predict\ndisplacement vector fields. Furthermore, a dual-branch feature decomposition\nfusion network is proposed to address the challenges of cross-modal feature\nmodeling and decomposition by integrating modality-specific and modality-shared\nfeatures. PAMRFuse+ achieves satisfactory results in registering and fusing\nunaligned PAT-MRI datasets. Moreover, for the first time, we evaluate the\nperformance of medical image fusion with contour segmentation and multi-organ\ninstance segmentation. Extensive experimental demonstrations reveal the\nadvantages of PAMRFuse+ in improving the performance of medical image analysis\ntasks.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}