{"id":"2407.00663","title":"Cholesky decomposition in spin-free Dirac-Coulomb coupled-cluster\n  calculations","authors":"Tereza Uhl\\'i\\v{r}ov\\'a, Davide Cianchino, Tommaso Nottoli, Filippo\n  Lipparini, and J\\\"urgen Gauss","authorsParsed":[["Uhlířová","Tereza",""],["Cianchino","Davide",""],["Nottoli","Tommaso",""],["Lipparini","Filippo",""],["Gauss","Jürgen",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 11:18:28 GMT"}],"updateDate":"2024-07-02","timestamp":1719746308000,"abstract":"  We present an implementation for the use of Cholesky decomposition (CD) of\ntwo-electron integrals within the spin-free Dirac-Coulomb (SFDC) scheme that\nenables to perform high-accuracy coupled-cluster (CC) calculations at costs\nalmost comparable to those of their non-relativistic counterparts. While for\nnon-relativistic CC calculations atomic-orbital (AO) based algorithms, due to\ntheir significantly reduced disk-space requirements, are the key to efficient\nlarge-scale computations, such algorithms are less advantageous in the SFDC\ncase due to their increased computational cost on that case. Here,\nmolecular-orbital (MO) based algorithms exploiting the CD of the two-electron\nintegrals allow to reduce disk-space requirements, and lead to computational\ncost in the CC step that are more or less the same as in the non-relativistic\ncase. The only remaining overhead in a CD-SFDC-CC calculation are due to the\nneed to compute additional two-electron integrals, the somewhat higher cost of\nthe Hartree-Fock calculation in the SFDC case, and additional cost in the\ntransformation of the Cholesky vectors from the AO to the MO representation.\nHowever, these additional costs typically amount to less than 5-15 % of the\ntotal wall time and are thus acceptable. We illustrate the efficiency of our CD\nscheme for SFDC-CC calculations on a series of illustrative calculations for\nthe X(CO)$_4$ molecules with X = Ni, Pd, Pt.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"PW6zE0AA4YQl9vUf8blp5rf_HwaOR5W6NvKx8IIc3Jg","pdfSize":"1282942"}
