{"id":"2407.02715","title":"Revealing the Electronic Structure of NiPS$_3$ through Synchrotron-Based\n  ARPES and Alkali Metal Dosing","authors":"Yifeng Cao, Qishuo Tan, Yucheng Guo, Cl\\'ovis Guerim Vieira, M\\'ario\n  S. C. Mazzon, Jude Laverock, Nicholas Russo, Hongze Gao, Chris Jozwiak, Aaron\n  Bostwick, Eli Rotenberg, Jinghua Guo, Ming Yi, Matheus J. S. Matos, Xi Ling,\n  and Kevin E. Smith","authorsParsed":[["Cao","Yifeng",""],["Tan","Qishuo",""],["Guo","Yucheng",""],["Vieira","Clóvis Guerim",""],["Mazzon","Mário S. C.",""],["Laverock","Jude",""],["Russo","Nicholas",""],["Gao","Hongze",""],["Jozwiak","Chris",""],["Bostwick","Aaron",""],["Rotenberg","Eli",""],["Guo","Jinghua",""],["Yi","Ming",""],["Matos","Matheus J. S.",""],["Ling","Xi",""],["Smith","Kevin E.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 23:38:21 GMT"}],"updateDate":"2024-07-04","timestamp":1719963501000,"abstract":"  This study presents a comprehensive analysis of the band structure in\nNiPS$_3$, a van der Waals layered antiferromagnet, utilizing high-resolution\nsynchrotron-based angle-resolved photoemission spectroscopy (ARPES) and\ncorroborative density functional theory (DFT) calculations. By tuning the\nparameters of the light source, we obtained a very clear and wide energy range\nband structure of NiPS$_3$. Comparison with DFT calculations allows for the\nidentification of the orbital character of the observed bands. Our DFT\ncalculations perfectly match the experimental results, and no adaptations were\nmade to the calculations based on the experimental outcomes. The appearance of\nnovel electronic structure upon alkali metal dosing (AMD) were also obtained in\nthis ARPES study. Above valence band maximum, structure of conduction bands and\nbands from defect states were firstly observed in NiPS$_3$. We provide the\ndirect determination of the band gap of NiPS$_3$ as 1.3 eV from the band\nstructure by AMD. In addition, detailed temperature dependent ARPES spectra\nwere obtained across a range that spans both below and above the N\\'eel\ntransition temperature of NiPS$_3$. We found that the paramagnetic and\nantiferromagnetic states have almost identical spectra, indicating the highly\nlocalized nature of Ni $d$ states.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/"}