{"id":"2407.01108","title":"Anomalous Behavior of the Dielectric and Pyroelectric Responses of\n  Ferroelectric Fine-Grained Ceramics","authors":"Oleksandr S. Pylypchuk, Serhii E. Ivanchenko, Mykola Y. Yelisieiev,\n  Andrii S. Nikolenko, Victor I. Styopkin, Bohdan Pokhylko, Vladyslav Kushnir,\n  Denis O. Stetsenko, Oleksii Bereznykov, Oksana V. Leschenko, Eugene A.\n  Eliseev, Vladimir N. Poroshin, Nicholas V. Morozovsky, Victor V. Vainberg,\n  and Anna N. Morozovska","authorsParsed":[["Pylypchuk","Oleksandr S.",""],["Ivanchenko","Serhii E.",""],["Yelisieiev","Mykola Y.",""],["Nikolenko","Andrii S.",""],["Styopkin","Victor I.",""],["Pokhylko","Bohdan",""],["Kushnir","Vladyslav",""],["Stetsenko","Denis O.",""],["Bereznykov","Oleksii",""],["Leschenko","Oksana V.",""],["Eliseev","Eugene A.",""],["Poroshin","Vladimir N.",""],["Morozovsky","Nicholas V.",""],["Vainberg","Victor V.",""],["Morozovska","Anna N.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 09:19:44 GMT"}],"updateDate":"2024-07-02","timestamp":1719825584000,"abstract":"  We revealed the anomalous temperature behavior of the giant dielectric\npermittivity and unusual frequency dependences of the pyroelectric response of\nthe fine-grained ceramics prepared by the spark plasma sintering of the\nferroelectric BaTiO3 nanoparticles. The temperature dependences of the\nelectro-resistivity indicate the frequency-dependent transition in the\nelectro-transport mechanisms between the lower and higher conductivity states\naccompanied by the maximum in the temperature dependence of the loss angle\ntangent. The pyroelectric thermal-wave probing revealed the existence of the\nspatially inhomogeneous counter-polarized ferroelectric state at the opposite\nsurfaces of the ceramic sample. We described the anomalous temperature behavior\nof the giant dielectric response and losses using the core-shell model for\nceramic grains and modified Maxwell-Wagner approach. We assume that core shells\nand grain boundaries, which contain high concentration of space charge carriers\ndue to the presence of graphite inclusions in the inter-grain space, can\neffectively screen weakly conductive ferroelectric grain cores. The\nsuperparaelectric-like state with a giant dielectric response can appear in the\nparaelectric shells and inter-grain space due to the step-like thermal\nactivation of localized polarons in the spatial regions, agreeing with\nexperimentally observed frequency-dependent transition of the electro-transport\nmechanism. The obtained results can be the key for the description of complex\nelectrophysical properties inherent to the strongly inhomogeneous media with\nelectrically coupled insulating ferroelectric nanoregions and semiconducting\nsuperparaelectric-like regions.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}