{"id":"2407.13942","title":"Harmful Suicide Content Detection","authors":"Kyumin Park, Myung Jae Baik, YeongJun Hwang, Yen Shin, HoJae Lee, Ruda\n  Lee, Sang Min Lee, Je Young Hannah Sun, Ah Rah Lee, Si Yeun Yoon, Dong-ho\n  Lee, Jihyung Moon, JinYeong Bak, Kyunghyun Cho, Jong-Woo Paik and Sungjoon\n  Park","authorsParsed":[["Park","Kyumin",""],["Baik","Myung Jae",""],["Hwang","YeongJun",""],["Shin","Yen",""],["Lee","HoJae",""],["Lee","Ruda",""],["Lee","Sang Min",""],["Sun","Je Young Hannah",""],["Lee","Ah Rah",""],["Yoon","Si Yeun",""],["Lee","Dong-ho",""],["Moon","Jihyung",""],["Bak","JinYeong",""],["Cho","Kyunghyun",""],["Paik","Jong-Woo",""],["Park","Sungjoon",""]],"versions":[{"version":"v1","created":"Mon, 3 Jun 2024 03:43:44 GMT"}],"updateDate":"2024-07-22","timestamp":1717386224000,"abstract":"  Harmful suicide content on the Internet is a significant risk factor inducing\nsuicidal thoughts and behaviors among vulnerable populations. Despite global\nefforts, existing resources are insufficient, specifically in high-risk regions\nlike the Republic of Korea. Current research mainly focuses on understanding\nnegative effects of such content or suicide risk in individuals, rather than on\nautomatically detecting the harmfulness of content. To fill this gap, we\nintroduce a harmful suicide content detection task for classifying online\nsuicide content into five harmfulness levels. We develop a multi-modal\nbenchmark and a task description document in collaboration with medical\nprofessionals, and leverage large language models (LLMs) to explore efficient\nmethods for moderating such content. Our contributions include proposing a\nnovel detection task, a multi-modal Korean benchmark with expert annotations,\nand suggesting strategies using LLMs to detect illegal and harmful content.\nOwing to the potential harm involved, we publicize our implementations and\nbenchmark, incorporating an ethical verification process.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}