{"id":"2407.07944","title":"A Stress Test of Global PDF Fits: Closure Testing the MSHT PDFs and a\n  First Direct Comparison to the Neural Net Approach","authors":"L. A. Harland-Lang, T. Cridge, R.S. Thorne","authorsParsed":[["Harland-Lang","L. A.",""],["Cridge","T.",""],["Thorne","R. S.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:00:02 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 12:31:47 GMT"}],"updateDate":"2024-08-12","timestamp":1720634402000,"abstract":"  We present a first global closure test of the fixed parameterisation (MSHT)\napproach to PDF fitting. We find that the default MSHT20 parameterisation can\nreproduce the features of the input set in such a closure test to well within\nthe textbook uncertainties. This provides strong evidence that parameterisation\ninflexibility in the MSHT20 fit is not a significant issue in the data region.\nWe also present the first completely like-for-like comparison between two\nglobal PDF fits, namely MSHT and NNPDF, where the only difference is guaranteed\nto be due to the fitting methodology. To achieve this, we present a fit to the\nNNPDF4.0 data and theory inputs, but with the MSHT fixed parameterisation. We\nfind that this gives a moderately, but noticeably, better fit quality than the\ncentral NNPDF4.0 fits, both with perturbative and fitted charm, and that this\ndifference persists at the level of the PDFs and benchmark cross sections. The\nNNPDF4.0 uncertainties are found to be broadly in line with the MSHT results if\na textbook $T^2=1$ tolerance is applied, but to be significantly smaller if a\ntolerance typical of the MSHT20 fit is applied. This points to an inherent\ninconsistency between these approaches. We discuss the need for an enlarged\ntolerance criterion in global PDF fits in detail, and demonstrate the impact of\ndata/theory inconsistencies in the closure test setting; namely, these do not\nlead to any increase in the $T^2=1$ PDF uncertainty. We also investigate the\nimpact of restricting the PDF parameterisation to have fewer free parameters\nthan the default MSHT20 case, and find this can be significant at the level of\nboth closure tests and the full fit.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}