{"id":"2407.12256","title":"Enhancing Polygonal Building Segmentation via Oriented Corners","authors":"Mohammad Moein Sheikholeslami, Muhammad Kamran, Andreas Wichmann,\n  Gunho Sohn","authorsParsed":[["Sheikholeslami","Mohammad Moein",""],["Kamran","Muhammad",""],["Wichmann","Andreas",""],["Sohn","Gunho",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 01:59:06 GMT"}],"updateDate":"2024-07-18","timestamp":1721181546000,"abstract":"  The growing demand for high-resolution maps across various applications has\nunderscored the necessity of accurately segmenting building vectors from\noverhead imagery. However, current deep neural networks often produce raster\ndata outputs, leading to the need for extensive post-processing that\ncompromises the fidelity, regularity, and simplicity of building\nrepresentations. In response, this paper introduces a novel deep convolutional\nneural network named OriCornerNet, which directly extracts delineated building\npolygons from input images. Specifically, our approach involves a deep model\nthat predicts building footprint masks, corners, and orientation vectors that\nindicate directions toward adjacent corners. These predictions are then used to\nreconstruct an initial polygon, followed by iterative refinement using a graph\nconvolutional network that leverages semantic and geometric features. Our\nmethod inherently generates simplified polygons by initializing the refinement\nprocess with predicted corners. Also, including geometric information from\noriented corners contributes to producing more regular and accurate results.\nPerformance evaluations conducted on SpaceNet Vegas and CrowdAI-small datasets\ndemonstrate the competitive efficacy of our approach compared to the\nstate-of-the-art in building segmentation from overhead imagery.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KC4hRtRTpc-yb1q9KEnepnKEPn0_8EDNOHQe8aPtRj4","pdfSize":"4468303","objectId":"0x1d43bc29ad683c6fb704aeabecc57b8a68489babfc7d7315b6b25afcf8a30d51","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
