{"id":"2407.18265","title":"Gauge fields and four interactions in the trigintaduonion spaces","authors":"Zi-Hua Weng","authorsParsed":[["Weng","Zi-Hua",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 08:16:20 GMT"}],"updateDate":"2024-07-29","timestamp":1721204180000,"abstract":"  The paper aims to apply the trigintaduonion spaces to explore the physical\nproperties of four interactions simultaneously, including the electromagnetic\nfields, gravitational fields, weak nuclear fields, and strong nuclear fields.\nJ. C. Maxwell first applied the algebra of quaternions to study the physical\nproperties of electromagnetic fields. It inspired some subsequent scholars to\nintroduce the quaternions, octonions, sedenions, and trigintaduonions to\nresearch the electromagnetic fields, gravitational fields, weak nuclear fields,\nstrong nuclear fields, quantum mechanics, gauge fields, and curved spaces and\nso forth. The algebra of trigintaduonions is able to discuss the physical\nquantities of four interactions, including the field potential, field strength,\nfield source, linear momentum, angular momentum, torque, and force. In the\nfield theories described with the algebra of trigintaduonions, the weak nuclear\nfield is composed of three types of fundamental fields. These three fundamental\nfields, related to weak nuclear fields, can describe the physical properties of\nweak nuclear fields collectively. This is consistent with the conclusion of the\nelectroweak theory. Meanwhile the strong nuclear field consists of three types\nof fundamental fields. These three fundamental fields relevant to strong\nnuclear fields may investigate the physical properties of strong nuclear fields\nmutually. It is coincident with the deduction of quark theory. According to the\nproperties of trigintaduonions, one can deduce the Yang-Mills equation related\nto the gauge fields. It means that the electromagnetic field occupies a\nquaternion space. The gravitational field owns one different quaternion space.\nThe weak nuclear fields occupy three mutually independent quaternion spaces.\nThe properties of weak nuclear fields are different from those of\nelectromagnetic fields or gravitational fields.\n","subjects":["Physics/General Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Q65BfuhTvoFRoHw4pjHTVAbfmW3iyZFxTsOGVqb33wc","pdfSize":"172779"}
