{"id":"2407.02742","title":"A Comparative Study of DSL Code Generation: Fine-Tuning vs. Optimized\n  Retrieval Augmentation","authors":"Nastaran Bassamzadeh and Chhaya Methani","authorsParsed":[["Bassamzadeh","Nastaran",""],["Methani","Chhaya",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 01:28:51 GMT"}],"updateDate":"2024-07-04","timestamp":1719970131000,"abstract":"  Natural Language to Code Generation has made significant progress in recent\nyears with the advent of Large Language Models(LLMs). While generation for\ngeneral-purpose languages like C, C++, and Python has improved significantly,\nLLMs struggle with custom function names in Domain Specific Languages or DSLs.\nThis leads to higher hallucination rates and syntax errors, specially for DSLs\nhaving a high number of custom function names. Additionally, constant updates\nto function names add to the challenge as LLMs need to stay up-to-date. In this\npaper, we present optimizations for using Retrieval Augmented Generation (or\nRAG) with LLMs for DSL generation along with an ablation study comparing these\nstrategies. We generated a train as well as test dataset with a DSL to\nrepresent automation tasks across roughly 700 APIs in public domain. We used\nthe training dataset to fine-tune a Codex model for this DSL. Our results\nshowed that the fine-tuned model scored the best on code similarity metric.\nWith our RAG optimizations, we achieved parity for similarity metric. The\ncompilation rate, however, showed that both the models still got the syntax\nwrong many times, with RAG-based method being 2 pts better. Conversely,\nhallucination rate for RAG model lagged by 1 pt for API names and by 2 pts for\nAPI parameter keys. We conclude that an optimized RAG model can match the\nquality of fine-tuned models and offer advantages for new, unseen APIs.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nFBuEqbIyQjpRxa2r4CIdt6oqNg6iQf5QywimSQRtTw","pdfSize":"257252","objectId":"0x3fe67f4b84f444e97251055e4cfce1d7224af83de192d63e49f4202a35c9a348","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
