{"id":"2407.10085","title":"Statistical Dynamics and Subgrid Modelling of Turbulence: From Isotropic\n  to Inhomogeneous","authors":"Jorgen S. Frederiksen, Vassili Kitsios and Terence J. O'Kane","authorsParsed":[["Frederiksen","Jorgen S.",""],["Kitsios","Vassili",""],["O'Kane","Terence J.",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 05:22:41 GMT"}],"updateDate":"2024-07-16","timestamp":1720934561000,"abstract":"  Turbulence is the most important, ubiquitous, and difficult problem of\nclassical physics. Feynman viewed it as essentially unsolved, without a\nrigorous mathematical basis to describe the statistical dynamics of this most\ncomplex of fluid motion. However, the paradigm shift came in 1959, with the\nformulation of the Eulerian direct interaction approximation (DIA) closure by\nKraichnan. It was again based on renormalized perturbation theory, like quantum\nelectrodynamics, and is a bare vertex theory that is manifestly realizable.\nHere, we review some of the subsequent exciting achievements in closure theory.\nWe also document in some detail the progress that has been made in extending\nstatistical dynamical turbulence theory to the real world of interactions with\nmean flows, waves and inhomogeneities such as topography. This includes\nnumerically efficient inhomogeneous closures, like the realizable\nquasi-diagonal direct interaction approximation (QDIA), and even more efficient\nMarkovian inhomogeneous closures (MICs). Recent developments include the\nformulation and testing of an eddy damped Markovian anisotropic closure (EDMAC)\nthat is realizable in interactions with transient waves but is as efficient as\nthe eddy damped quasi-normal Markovian (EDQNM). As well a similarly efficient\nclosure, the realizable eddy damped Markovian inhomogeneous closure (EDMIC) has\nbeen developed. Moreover, we present subgrid models that cater for the complex\ninteractions that occur in geophysical flows. Recent progress includes the\ndetermination of complete sets of subgrid terms for skilful large eddy\nsimulations of baroclinic inhomogeneous turbulent atmospheric and oceanic flows\ninteracting with Rossby waves and topography. The success of these\ninhomogeneous closures has also led to further applications in data\nassimilation and ensemble prediction and generalization to quantum fields.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}