{"id":"2407.13991","title":"Accurately Estimating Redshifts from CSST Slitless Spectroscopic Survey\n  using Deep Learning","authors":"Xingchen Zhou, Yan Gong, Xin Zhang, Nan Li, Xian-Min Meng, Xuelei\n  Chen, Run Wen, Yunkun Han, Hu Zou, Xian Zhong Zheng, Xiaohu Yang, Hong Guo\n  and Pengjie Zhang","authorsParsed":[["Zhou","Xingchen",""],["Gong","Yan",""],["Zhang","Xin",""],["Li","Nan",""],["Meng","Xian-Min",""],["Chen","Xuelei",""],["Wen","Run",""],["Han","Yunkun",""],["Zou","Hu",""],["Zheng","Xian Zhong",""],["Yang","Xiaohu",""],["Guo","Hong",""],["Zhang","Pengjie",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 02:47:08 GMT"}],"updateDate":"2024-07-22","timestamp":1721357228000,"abstract":"  China Space Station Telescope (CSST) has the capability to conduct slitless\nspectroscopic survey simultaneously with photometric survey. The spectroscopic\nsurvey will measure slitless spectra, potentially providing more accurate\nestimations of galaxy properties, particularly redshift, compared to broadband\nphotometry. However, due to low-resolution and signal-to-noise ratio of\nslitless spectra, measurement of these properties is significantly challenging.\nIn this study, we employ a Bayesian neural network (BNN) to assess the accuracy\nof redshift estimations from slitless spectra anticipated to be observed by\nCSST. The slitless spectra are simulated based on real data from the early data\nrelease of the Dark Energy Spectroscopic Instrument (DESI-EDR) and the 16th\ndata release of the Baryon Oscillaton Spectroscopic Survey (BOSS-DR16),\ncombining the 9th data release of the DESI Legacy Survey (DESI LS DR9). The BNN\nprovides redshifts estimates along with corresponding uncertainties, achieving\nan accuracy of $\\sigma_{\\rm NMAD} = 0.00063$, outlier percentage $\\eta=0.92\\%$\nand weighted mean uncertainty $\\bar{E} = 0.00228$. These results successfully\nmeet the requirement for cosmological studies using slitless spectra from CSST.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}