{"id":"2407.13107","title":"DITTO: A Visual Digital Twin for Interventions and Temporal Treatment\n  Outcomes in Head and Neck Cancer","authors":"Andrew Wentzel, Serageldin Attia, Xinhua Zhang, Guadalupe Canahuate,\n  Clifton David Fuller, G.Elisabeta Marai","authorsParsed":[["Wentzel","Andrew",""],["Attia","Serageldin",""],["Zhang","Xinhua",""],["Canahuate","Guadalupe",""],["Fuller","Clifton David",""],["Marai","G. Elisabeta",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 02:36:18 GMT"}],"updateDate":"2024-07-19","timestamp":1721270178000,"abstract":"  Digital twin models are of high interest to Head and Neck Cancer (HNC)\noncologists, who have to navigate a series of complex treatment decisions that\nweigh the efficacy of tumor control against toxicity and mortality risks.\nEvaluating individual risk profiles necessitates a deeper understanding of the\ninterplay between different factors such as patient health, spatial tumor\nlocation and spread, and risk of subsequent toxicities that can not be\nadequately captured through simple heuristics. To support clinicians in better\nunderstanding tradeoffs when deciding on treatment courses, we developed DITTO,\na digital-twin and visual computing system that allows clinicians to analyze\ndetailed risk profiles for each patient, and decide on a treatment plan. DITTO\nrelies on a sequential Deep Reinforcement Learning digital twin (DT) to deliver\npersonalized risk of both long-term and short-term disease outcome and toxicity\nrisk for HNC patients. Based on a participatory collaborative design alongside\noncologists, we also implement several visual explainability methods to promote\nclinical trust and encourage healthy skepticism when using our system. We\nevaluate the efficacy of DITTO through quantitative evaluation of performance\nand case studies with qualitative feedback. Finally, we discuss design lessons\nfor developing clinical visual XAI applications for clinical end users.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}