{"id":"2407.02331","title":"Attoliter Mie Void Sensing","authors":"Serkan Arslan, Micha Kappel, Adri\\`a Can\\'os Valero, Thu Huong T.\n  Tran, Julian Karst, Philipp Christ, Ulrich Hohenester, Thomas Weiss, Harald\n  Giessen, and Mario Hentschel","authorsParsed":[["Arslan","Serkan",""],["Kappel","Micha",""],["Valero","Adrià Canós",""],["Tran","Thu Huong T.",""],["Karst","Julian",""],["Christ","Philipp",""],["Hohenester","Ulrich",""],["Weiss","Thomas",""],["Giessen","Harald",""],["Hentschel","Mario",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 15:00:09 GMT"}],"updateDate":"2024-07-03","timestamp":1719932409000,"abstract":"  Traditional nanophotonic sensing schemes utilize evanescent fields in\ndielectric or metallic nanoparticles, which confine far-field radiation in\ndispersive and lossy media. Apart from the lack of a well-defined sensing\nvolume that can be accompanied by moderate sensitivities, these structures\nsuffer from the generally limited access to the modal field, which is key for\nsensing performance. Recently, a novel strategy for dielectric nanophotonics\nhas been demonstrated, namely, the resonant confinement of light in air.\nSo-called Mie voids created in high-index dielectric host materials support\nlocalized resonant modes with exceptional properties. In particular, due to the\nconfinement in air, these structures benefit from the full access to the modal\nfield inside the void. We utilize these Mie voids for refractive index sensing\nin single voids with volumes down to 100 attoliters and sensitivities on the\norder of 400 nm per refractive index unit. Taking the signal-to-noise ratio of\nour measurements into account, we demonstrate detection of refractive index\nchanges as small as 6.9 x 10-4 in a defined volume of just 850 attoliters. The\ncombination of our Mie void sensor platform with appropriate surface\nfunctionalization will even enable specificity to biological or other analytes\nof interest, as the sensing volumes are on the order of cellular signaling\nchemicals of single vesicles in cellular synapses.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/"}