{"id":"2407.13516","title":"Optimal Mechanisms for Quantum Local Differential Privacy","authors":"Ji Guan","authorsParsed":[["Guan","Ji",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 13:46:16 GMT"}],"updateDate":"2024-07-19","timestamp":1721310376000,"abstract":"  In recent years, centralized differential privacy has been successfully\nextended to quantum computing and information processing to safeguard privacy\nand prevent leaks in neighboring relationships of quantum states. This paper\nintroduces a framework known as quantum local differential privacy (QLDP) and\ninitializes the algorithmic study of QLDP. QLDP utilizes a parameter $\\epsilon$\nto manage privacy leaks and ensure the privacy of individual quantum states.\nThe optimization of the QLDP value $\\epsilon$, denoted as $\\epsilon^*$, for any\nquantum mechanism is addressed as an optimization problem. The introduction of\nquantum noise is shown to provide privacy protections similar to classical\nscenarios, with quantum depolarizing noise identified as the optimal unital\nprivatization mechanism within the QLDP framework. Unital mechanisms represent\na diverse set of quantum mechanisms that encompass frequently employed quantum\nnoise types. Quantum depolarizing noise optimizes both fidelity and trace\ndistance utilities, which are crucial metrics in the field of quantum\ncomputation and information, and can be viewed as a quantum counterpart to\nclassical randomized response methods. Additionally, a composition theorem is\npresented for the application of QLDP framework in distributed (spatially\nseparated) quantum systems, ensuring the validity (additivity of QLDP value)\nirrespective of the states' independence, classical correlation, or\nentanglement (quantum correlation). The study further explores the trade-off\nbetween utility and privacy across different quantum noise mechanisms,\nincluding unital and non-unital quantum noise mechanisms, through both\nanalytical and numerically experimental approaches. Meanwhile, this highlights\nthe optimization of quantum depolarizing noise in QLDP framework.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}