{"id":"2407.19163","title":"A Resource-Efficient Decentralized Sequential Planner for Spatiotemporal\n  Wildfire Mitigation","authors":"Josy John, Shridhar Velhal, Suresh Sundaram","authorsParsed":[["John","Josy",""],["Velhal","Shridhar",""],["Sundaram","Suresh",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 04:12:08 GMT"}],"updateDate":"2024-07-30","timestamp":1722053528000,"abstract":"  This paper proposes a Conflict-aware Resource-Efficient Decentralized\nSequential planner (CREDS) for early wildfire mitigation using multiple\nheterogeneous Unmanned Aerial Vehicles (UAVs). Multi-UAV wildfire management\nscenarios are non-stationary, with spatially clustered dynamically spreading\nfires, potential pop-up fires, and partial observability due to limited UAV\nnumbers and sensing range. The objective of CREDS is to detect and sequentially\nmitigate all growing fires as Single-UAV Tasks (SUT), minimizing biodiversity\nloss through rapid UAV intervention and promoting efficient resource\nutilization by avoiding complex multi-UAV coordination. CREDS employs a\nthree-phased approach, beginning with fire detection using a search algorithm,\nfollowed by local trajectory generation using the auction-based\nResource-Efficient Decentralized Sequential planner (REDS), incorporating the\nnovel non-stationary cost function, the Deadline-Prioritized Mitigation Cost\n(DPMC). Finally, a conflict-aware consensus algorithm resolves conflicts to\ndetermine a global trajectory for spatiotemporal mitigation. The performance\nevaluation of the CREDS for partial and full observability conditions with both\nheterogeneous and homogeneous UAV teams for different fires-to-UAV ratios\ndemonstrates a $100\\%$ success rate for ratios up to $4$ and a high success\nrate for the critical ratio of $5$, outperforming baselines. Heterogeneous UAV\nteams outperform homogeneous teams in handling heterogeneous deadlines of SUT\nmitigation. CREDS exhibits scalability and $100\\%$ convergence, demonstrating\nrobustness against potential deadlock assignments, enhancing its success rate\ncompared to the baseline approaches.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}