{"id":"2407.05056","title":"Surface waves in randomly perturbed discrete models","authors":"Josselin Garnier and Basant Lal Sharma","authorsParsed":[["Garnier","Josselin",""],["Sharma","Basant Lal",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 12:04:39 GMT"}],"updateDate":"2024-07-09","timestamp":1720267479000,"abstract":"  We study the propagation of surface waves across structured surfaces with\nrandom, localized inhomogeneities. A discrete analogue of Gurtin-Murdoch model\nis employed and surface elasticity, in contrast to bulk elasticity, is captured\nby distinct point masses and elastic constants for nearest-neighbour\ninteractions parallel to the surface. Expressions for the surface wave\nreflectance and transmittance, as well as the radiative loss, are provided for\nevery localized patch of point mass perturbation on the surface. As the main\nresult in the article, we provide the statistics of surface wave reflectance\nand transmittance and the radiative loss for an ensemble of random mass\nperturbations, independent and identically distributed with mean zero, on the\nsurface. In the weakly scattering regime, the mean radiative loss is found to\nbe proportional to the size of the perturbed patch, to the variance of the mass\nperturbations, and to an effective parameter that depends on the continuous\nspectrum of the unperturbed system. In the strongly scattering regime, the mean\nradiative loss is found to depend on another effective parameter that depends\non the continuous spectrum, but not on the variance of the mass perturbations.\nNumerical simulations are found in quantitative agreement with the theoretical\npredictions for several illustrative values of the surface structure\nparameters.\n","subjects":["Physics/Mathematical Physics","Mathematics/Classical Analysis and ODEs","Mathematics/Mathematical Physics","Mathematics/Probability"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"5iS2qzzhI6y-2u7dBzF_LspkkmBNePTqp6yKV1-ArbQ","pdfSize":"3314175"}
