{"id":"2407.14868","title":"Dual High-Order Total Variation Model for Underwater Image Restoration","authors":"Yuemei Li, Guojia Hou, Peixian Zhuang, Zhenkuan Pan","authorsParsed":[["Li","Yuemei",""],["Hou","Guojia",""],["Zhuang","Peixian",""],["Pan","Zhenkuan",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 13:06:37 GMT"}],"updateDate":"2024-07-23","timestamp":1721480797000,"abstract":"  Underwater images are typically characterized by color cast, haze, blurring,\nand uneven illumination due to the selective absorption and scattering when\nlight propagates through the water, which limits their practical applications.\nUnderwater image enhancement and restoration (UIER) is one crucial mode to\nimprove the visual quality of underwater images. However, most existing UIER\nmethods concentrate on enhancing contrast and dehazing, rarely pay attention to\nthe local illumination differences within the image caused by illumination\nvariations, thus introducing some undesirable artifacts and unnatural color. To\naddress this issue, an effective variational framework is proposed based on an\nextended underwater image formation model (UIFM). Technically, dual high-order\nregularizations are successfully integrated into the variational model to\nacquire smoothed local ambient illuminance and structure-revealed reflectance\nin a unified manner. In our proposed framework, the weight factors-based color\ncompensation is combined with the color balance to compensate for the\nattenuated color channels and remove the color cast. In particular, the local\nambient illuminance with strong robustness is acquired by performing the local\npatch brightest pixel estimation and an improved gamma correction.\nAdditionally, we design an iterative optimization algorithm relying on the\nalternating direction method of multipliers (ADMM) to accelerate the solution\nof the proposed variational model. Considerable experiments on three real-world\nunderwater image datasets demonstrate that the proposed method outperforms\nseveral state-of-the-art methods with regard to visual quality and quantitative\nassessments. Moreover, the proposed method can also be extended to outdoor\nimage dehazing, low-light image enhancement, and some high-level vision tasks.\nThe code is available at https://github.com/Hou-Guojia/UDHTV.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}