{"id":"2407.20996","title":"Thermal spin-crossover and temperature-dependent zero-field splitting in\n  magnetic nanographene chains","authors":"Yan Wang, Alejandro P\\'erez Paz, Emil Vi\\~nas Bostr\\\"om, Xiaoxi Zhang,\n  Juan Li, Reinhard Berger, Kun Liu, Ji Ma, Li Huang, Shixuan Du, Hong-jun Gao,\n  Klaus M\\\"ullen, Akimitsu Narita, Xinliang Feng, Angel Rubio, CA Palma","authorsParsed":[["Wang","Yan",""],["Paz","Alejandro Pérez",""],["Boström","Emil Viñas",""],["Zhang","Xiaoxi",""],["Li","Juan",""],["Berger","Reinhard",""],["Liu","Kun",""],["Ma","Ji",""],["Huang","Li",""],["Du","Shixuan",""],["Gao","Hong-jun",""],["Müllen","Klaus",""],["Narita","Akimitsu",""],["Feng","Xinliang",""],["Rubio","Angel",""],["Palma","CA",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 17:33:24 GMT"}],"updateDate":"2024-07-31","timestamp":1722360804000,"abstract":"  Nanographene-based magnetism at interfaces offers an avenue to designer\nquantum materials towards novel phases of matter and atomic-scale applications.\nKey to spintronics applications at the nanoscale is bistable spin-crossover\nwhich however remains to be demonstrated in nanographenes. Here we show that\nantiaromatic 1,4-disubstituted pyrazine-embedded nanographene derivatives,\nwhich promote magnetism through oxidation to a non-aromatic radical are\nprototypical models for the study of carbon-based thermal spin-crossover.\nScanning tunneling spectroscopy studies reveal symmetric spin excitation\nsignals which evolve at Tc to a zero-energy peak, and are assigned to the\ntransition of a S = 3/2 high-spin to a S = 1/2 low-spin state by density\nfunctional theory. At temperatures below and close to the spin-crossover Tc,\nthe high-spin S= 3/2 excitations evidence pronouncedly different\ntemperature-dependent excitation energies corresponding to a zero-field\nsplitting in the Hubbard-Kanamori Hamiltonian. The discovery of thermal spin\ncrossover and temperature-dependent zero-field splitting in carbon\nnanomaterials promises to accelerate quantum information, spintronics and\nthermometry at the atomic scale.\n","subjects":["Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}