{"id":"2407.00700","title":"Study of $\\tau^- \\to \\omega \\pi^- \\nu_\\tau$ decay in resonance chiral\n  theory with tensor sources","authors":"Feng-Zhi Chen, Xin-Qiang Li, Shi-Can Peng, Ya-Dong Yang, and Yuan-He\n  Zou","authorsParsed":[["Chen","Feng-Zhi",""],["Li","Xin-Qiang",""],["Peng","Shi-Can",""],["Yang","Ya-Dong",""],["Zou","Yuan-He",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 13:47:56 GMT"},{"version":"v2","created":"Sat, 7 Sep 2024 01:14:08 GMT"}],"updateDate":"2024-09-10","timestamp":1719755276000,"abstract":"  In this work, we make a study of the $\\tau^- \\to \\omega\\pi^-\\nu_\\tau$ decay\nin the framework of low-energy effective field theory. The $J^{\\mathcal{P}G}$\ndecompositions of the quark currents and the $\\omega\\pi$ final state show that,\nbesides the Standard Model vector interaction, only the non-standard tensor\ninteraction can have a non-zero contribution to the decay. To discuss its\neffect, a reliable calculation of the $\\omega\\pi$ tensor form factors is\nnecessary. After constructing the Lagrangian of resonance chiral theory with\nexternal tensor sources, we calculate both the vector and tensor form factors\nwith the relevant resonance couplings determined by combining the QCD\nshort-distance constraints, the fit to the spectral function of $\\tau^- \\to\n\\omega\\pi^-\\nu_\\tau$ decay, as well as the matching between the\n$\\mathcal{O}(p^4)$ odd-intrinsic-parity operators after integrating out the\nvector resonances and the $\\mathcal{O}(p^6)$ operators of chiral perturbation\ntheory. The new physics effect is then investigated in the distributions of the\nspectral function and the forward-backward asymmetry of $\\tau^- \\to\n\\omega\\pi^-\\nu_\\tau$ decay. We find that the spectral function is dominated by\nthe Standard Model, and the non-standard tensor contribution is negligible.\nHowever, since the forward-backward asymmetry can be only generated with a\nnon-zero tensor interaction, the observable is quite sensitive to this kind of\nnew physics. A future measurement of the observable at the Belle II experiment\nas well as at the proposed Tera-Z and STCF facilities is, therefore, strongly\ncalled for to check the existence of such a non-standard tensor interaction.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}