{"id":"2407.08968","title":"SlideGCD: Slide-based Graph Collaborative Training with Knowledge\n  Distillation for Whole Slide Image Classification","authors":"Tong Shu, Jun Shi, Dongdong Sun, Zhiguo Jiang, Yushan Zheng","authorsParsed":[["Shu","Tong",""],["Shi","Jun",""],["Sun","Dongdong",""],["Jiang","Zhiguo",""],["Zheng","Yushan",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 03:32:13 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 04:23:11 GMT"}],"updateDate":"2024-07-22","timestamp":1720755133000,"abstract":"  Existing WSI analysis methods lie on the consensus that histopathological\ncharacteristics of tumors are significant guidance for cancer diagnostics.\nParticularly, as the evolution of cancers is a continuous process, the\ncorrelations and differences across various stages, anatomical locations and\npatients should be taken into account. However, recent research mainly focuses\non the inner-contextual information in a single WSI, ignoring the correlations\nbetween slides. To verify whether introducing the slide inter-correlations can\nbring improvements to WSI representation learning, we propose a generic WSI\nanalysis pipeline SlideGCD that considers the existing multi-instance learning\n(MIL) methods as the backbone and forge the WSI classification task as a node\nclassification problem. More specifically, SlideGCD declares a node buffer that\nstores previous slide embeddings for subsequent extensive slide-based graph\nconstruction and conducts graph learning to explore the inter-correlations\nimplied in the slide-based graph. Moreover, we frame the MIL classifier and\ngraph learning into two parallel workflows and deploy the knowledge\ndistillation to transfer the differentiable information to the graph neural\nnetwork. The consistent performance boosting, brought by SlideGCD, of four\nprevious state-of-the-art MIL methods is observed on two TCGA benchmark\ndatasets. The code is available at https://github.com/HFUT-miaLab/SlideGCD.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}