{"id":"2407.14428","title":"Multicritical quantum sensors driven by symmetry-breaking","authors":"Sayan Mondal, Ayan Sahoo, Ujjwal Sen and Debraj Rakshit","authorsParsed":[["Mondal","Sayan",""],["Sahoo","Ayan",""],["Sen","Ujjwal",""],["Rakshit","Debraj",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:57:02 GMT"}],"updateDate":"2024-07-22","timestamp":1721404622000,"abstract":"  Quantum criticality has been demonstrated as a useful quantum resource for\nparameter estimation. This includes second-order, topological and localization\ntransitions. In all these works reported so far, gap-to-gapless transition at\ncriticality has been identified as the ultimate resource for achieving the\nquantum enhanced sensing, although there are several important concepts\nassociated with criticality, such as long-range correlation, symmetry breaking.\nIn this work, we analytically demonstrate that symmetry-breaking can drive a\nquantum enhanced sensing in single- or multiparameter estimation. We show this\nin the well-known Kitaev model, a lattice version of the 1D p-wave\nsuperconductor, which consists of a pairing term and an onsite potential term.\nThe model is characterized by two critical lines and a multi-critical point at\nthe intersection of these two lines. We show that Heisenberg scaling can be\nobtained in precision measurement of the superconducting coupling by preparing\nthe system at or near the multicritical point despite the fact that parameter\nvariation follows the critical lines, i.e., without an explicit requirement of\ngap-to-gapless transition. Quantum enhancement in such situations solely occurs\ndue to a global U(1) symmetry-breaking by the pairing term. Extending our\nanalysis in the realm of multiparameter estimation we show that it is possible\nto obtain super-Heisenberg scaling by combining the effects of\nsymmetry-breaking and gapless-to-gapped transition.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Quantum Gases"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}