{"id":"2407.02124","title":"Data-Driven Subsynchronous Oscillation Suppression for Renewable Energy\n  Integrated Power Systems Based on Koopman Operator","authors":"Zihan Wang, Ziyang Huang, Xiaonan Zhang, Gengyin Li and Le Zheng","authorsParsed":[["Wang","Zihan",""],["Huang","Ziyang",""],["Zhang","Xiaonan",""],["Li","Gengyin",""],["Zheng","Le",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 10:14:57 GMT"}],"updateDate":"2024-07-03","timestamp":1719915297000,"abstract":"  Recently, subsynchronous oscillations (SSOs) have emerged frequently\nworldwide, with the high penetration of renewable power generation in modern\npower systems. The SSO introduced by renewables has become a prominent new\nstability problem, seriously threatening the stable operation of systems. This\npaper proposes a data-driven dynamic optimal controller for renewable energy\nintegrated power systems, to suppress SSOs with the control of renewables. The\nchallenges of the controller design are the nonlinearity, complexity and hard\naccessibility of the system models. Using Koopman operator, the system dynamics\nare accurately extracted from data and utilized to the linear model predictive\ncontrol (MPC). Firstly, the globally linear representation of the system\ndynamics is obtained by lifting, and the key states are selected as control\nsignals by analyzing Koopman participation factors. Subsequently, augmented\nwith the control term, the Koopman linear parameter-varying predictor of the\ncontrolled system is constructed. Finally, using MPC, the proposed controller\ncomputes control signals online in a moving horizon fashion. Case studies show\nthat the proposed controller is effective, adaptive and robust in various\nconditions, surpassing other controllers with reliable control performance.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}