{"id":"2407.09523","title":"MuseCL: Predicting Urban Socioeconomic Indicators via Multi-Semantic\n  Contrastive Learning","authors":"Xixian Yong, Xiao Zhou","authorsParsed":[["Yong","Xixian",""],["Zhou","Xiao",""]],"versions":[{"version":"v1","created":"Sun, 23 Jun 2024 09:49:41 GMT"}],"updateDate":"2024-07-16","timestamp":1719136181000,"abstract":"  Predicting socioeconomic indicators within urban regions is crucial for\nfostering inclusivity, resilience, and sustainability in cities and human\nsettlements. While pioneering studies have attempted to leverage multi-modal\ndata for socioeconomic prediction, jointly exploring their underlying semantics\nremains a significant challenge. To address the gap, this paper introduces a\nMulti-Semantic Contrastive Learning (MuseCL) framework for fine-grained urban\nregion profiling and socioeconomic prediction. Within this framework, we\ninitiate the process by constructing contrastive sample pairs for street view\nand remote sensing images, capitalizing on the similarities in human mobility\nand Point of Interest (POI) distribution to derive semantic features from the\nvisual modality. Additionally, we extract semantic insights from POI texts\nembedded within these regions, employing a pre-trained text encoder. To merge\nthe acquired visual and textual features, we devise an innovative\ncross-modality-based attentional fusion module, which leverages a contrastive\nmechanism for integration. Experimental results across multiple cities and\nindicators consistently highlight the superiority of MuseCL, demonstrating an\naverage improvement of 10% in $R^2$ compared to various competitive baseline\nmodels. The code of this work is publicly available at\nhttps://github.com/XixianYong/MuseCL.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}