{"id":"2407.08030","title":"Dynamics of the response of dark matter halo to galaxy evolution in\n  IllustrisTNG","authors":"Premvijay Velmani and Aseem Paranjape","authorsParsed":[["Velmani","Premvijay",""],["Paranjape","Aseem",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 20:14:26 GMT"}],"updateDate":"2024-07-12","timestamp":1720642466000,"abstract":"  We present the dynamical evolution of the dark matter's relaxation response\nto galaxies and their connection to the astrophysical properties as simulated\nin the IllustrisTNG suite of cosmological hydrodynamical simulations. Our\nresults show that the radially-dependent linear relaxation relation model from\nour previous work is applicable at least from redshift $z=5$. We focus on the\noffset parameter $q_0$, which characterizes the relaxation of dark matter\nshells without changing the enclosed mass. We perform multiple time-series\nanalyses to determine the possible causal connections between the relaxation\nmechanism and astrophysical processes such as star formation and associated\nfeedback processes, as well as feedback due to active galactic nuclei. We show\nthat star formation activity significantly influences the halo relaxation\nresponse throughout its evolutionary history, with essentially immediate\neffects in the inner haloes and delayed effects of 2 to 3 Gyr in the outer\nregions. Metal content shows a weaker connection to relaxation than star\nformation rates, but the accumulated wind from feedback processes exhibits a\nstronger correlation. These findings enhance our understanding of halo\nrelaxation mechanisms. Our estimates of the time-scales relevant for dark\nmatter relaxation can potentially improve the description of halo profiles in\nexisting baryonification schemes and semi-analytical galaxy formation models.\nOur results also show how the relaxation response of dark haloes can probe the\nevolutionary history of the galaxies they host.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}