{"id":"2407.14237","title":"Hyper-Heuristics Can Profit From Global Variation Operators","authors":"Benjamin Doerr, Johannes F. Lutzeyer","authorsParsed":[["Doerr","Benjamin",""],["Lutzeyer","Johannes F.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 12:10:05 GMT"}],"updateDate":"2024-07-22","timestamp":1721391005000,"abstract":"  In recent work, Lissovoi, Oliveto, and Warwicker (Artificial Intelligence\n(2023)) proved that the Move Acceptance Hyper-Heuristic (MAHH) leaves the local\noptimum of the multimodal CLIFF benchmark with remarkable efficiency. The\n$O(n^3)$ runtime of the MAHH, for almost all cliff widths $d\\ge 2,$ is\nsignificantly better than the $\\Theta(n^d)$ runtime of simple elitist\nevolutionary algorithms (EAs) on CLIFF.\n  In this work, we first show that this advantage is specific to the CLIFF\nproblem and does not extend to the JUMP benchmark, the most prominent\nmulti-modal benchmark in the theory of randomized search heuristics. We prove\nthat for any choice of the MAHH selection parameter $p$, the expected runtime\nof the MAHH on a JUMP function with gap size $m = O(n^{1/2})$ is at least\n$\\Omega(n^{2m-1} / (2m-1)!)$. This is significantly slower than the $O(n^m)$\nruntime of simple elitist EAs. Encouragingly, we also show that replacing the\nlocal one-bit mutation operator in the MAHH with the global bit-wise mutation\noperator, commonly used in EAs, yields a runtime of $\\min\\{1,\nO(\\frac{e\\ln(n)}{m})^m\\} \\, O(n^m)$ on JUMP functions. This is at least as good\nas the runtime of simple elitist EAs. For larger values of $m$, this result\nproves an asymptotic performance gain over simple EAs. As our proofs reveal,\nthe MAHH profits from its ability to walk through the valley of lower objective\nvalues in moderate-size steps, always accepting inferior solutions. This is the\nfirst time that such an optimization behavior is proven via mathematical means.\nGenerally, our result shows that combining two ways of coping with local\noptima, global mutation and accepting inferior solutions, can lead to\nconsiderable performance gains.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Data Structures and Algorithms"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}