{"id":"2407.12942","title":"Investigation of triangularity effects on tokamak edge turbulence\n  through multi-fidelity gyrokinetic simulations","authors":"A.C.D. Hoffmann, P. Ricci","authorsParsed":[["Hoffmann","A. C. D.",""],["Ricci","P.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 18:20:07 GMT"}],"updateDate":"2024-07-19","timestamp":1721240407000,"abstract":"  This paper uses the gyro-moment (GM) approach as a multi-fidelity tool to\nexplore the effect of triangularity on tokamak edge turbulence. Considering\nexperimental data from an L-mode DIII-D discharge, we conduct gyrokinetic (GK)\nsimulations with realistic plasma edge geometry parameters at $\\rho=0.95$. We\nfind that employing ten GMs effectively captures essential features of both\ntrapped electron mode (TEM) and ion temperature gradient (ITG) turbulence. By\ncomparing electromagnetic GK simulations with adiabatic electron GK and reduced\nfluid simulations, we identify the range of validity of the reduced models. We\nobserve that TEMs drive turbulent heat transport under nominal discharge\nconditions, hindering accurate transport level estimates by both simplified\nmodels. However, when TEMs are absent, and turbulence is ITG-driven, an\nagreement across the different models is observed. Finally, a parameter scan\nshows that the positive triangularity scenario destabilizes the TEM, therefore,\nthe adiabatic electron model tends to show agreement with the electromagnetic\nsimulations in zero and negative triangularity scenarios. On the other hand,\nthe reduced fluid simulations exhibit limited sensitivity to triangularity\nchanges, shedding light on the importance of retaining kinetic effects to\naccurately model the impact of triangularity turbulence in the tokamak edge. In\nconclusion, our multi-fidelity study suggests that a GM hierarchy with a\nlimited number of moments is an ideal candidate for efficiently exploring\ntriangularity effects on micro-scale turbulence.\n","subjects":["Physics/Plasma Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}