{"id":"2407.15918","title":"Combined Gemini-South and HST photometric analysis of the globular\n  cluster NGC 6558. The age of the metal-poor population of the Galactic Bulge","authors":"S. O. Souza, M. Libralato, D. Nardiello, L. O. Kerber, S. Ortolani, A.\n  P\\'erez-Villegas, R. A. P. Oliveira, B. Barbuy, E. Bica, M. Griggio, B. Dias","authorsParsed":[["Souza","S. O.",""],["Libralato","M.",""],["Nardiello","D.",""],["Kerber","L. O.",""],["Ortolani","S.",""],["Pérez-Villegas","A.",""],["Oliveira","R. A. P.",""],["Barbuy","B.",""],["Bica","E.",""],["Griggio","M.",""],["Dias","B.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-24","timestamp":1721671200000,"abstract":"  NGC~6558 is a low-galactic latitude globular cluster projected in the\ndirection of the Galactic bulge. Due to high reddening, this region presents\nchallenges in deriving accurate parameters, which require meticulous\nphotometric analysis. We present a combined analysis of near-infrared and\noptical photometry from multi-epoch high-resolution images collected with\nGemini-South/GSAOI+GeMS (in the $J$ and $K_S$ filters) and HST/ACS (in the\nF606W and F814W filters). We aim to refine the fundamental parameters of\nNGC~6558, utilizing high-quality Gemini-South/GSAOI and HST/ACS photometries.\nAdditionally, we intend to investigate its role in the formation of the\nGalactic bulge. We studied the impact of two differential reddening corrections\non the age derivation. When removing as much as possible the Galactic bulge\nfield star contamination, the isochrone fitting combined with synthetic\ncolour-magnitude diagrams gives a distance of $8.41^{+0.11}_{-0.10}$ kpc, an\nage of $13.0\\pm 0.9$ Gyr, a reddening of E($B-V$)$\\,\\,=0.34\\pm0.02$, and a\ntotal-to-selective coefficient R$_V = 3.2\\pm0.2$ thanks to the simultaneous\nnear-infrared$-$Optical synthetic colour-magnitude diagram fitting. The orbital\nparameters showed that NGC~6558 is confined whitin the inner Galaxy and it is\nnot compatible with a bar-shape orbit, indicating that it is a bulge member.\nThe old age of NGC~6558, combined with similar metallicity and a blue\nhorizontal branch in the Galactic bulge, indicates that it is part of the\nmoderately metal-poor globular clusters. Assembling the old and moderately\nmetal-poor ([Fe/H]$\\,\\,\\sim-1.1$) clusters in the Galactic bulge, we derived\ntheir age-metallicity relation with star formation stars at $13.6\\pm0.2$ Gyr\nand effective yields of $\\rho=0.007\\pm0.009\\,\\, Z_\\odot$ showing a chemical\nenrichment ten times faster than the ex-situ globular clusters branch.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}