{"id":"2407.01100","title":"Eliminating Position Bias of Language Models: A Mechanistic Approach","authors":"Ziqi Wang, Hanlin Zhang, Xiner Li, Kuan-Hao Huang, Chi Han, Shuiwang\n  Ji, Sham M. Kakade, Hao Peng, Heng Ji","authorsParsed":[["Wang","Ziqi",""],["Zhang","Hanlin",""],["Li","Xiner",""],["Huang","Kuan-Hao",""],["Han","Chi",""],["Ji","Shuiwang",""],["Kakade","Sham M.",""],["Peng","Hao",""],["Ji","Heng",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 09:06:57 GMT"}],"updateDate":"2024-07-02","timestamp":1719824817000,"abstract":"  Position bias has proven to be a prevalent issue of modern language models\n(LMs), where the models prioritize content based on its position within the\ngiven context. This bias often leads to unexpected model failures and hurts\nperformance, robustness, and reliability across various applications. Our\nmechanistic analysis attributes the position bias to two components employed in\nnearly all state-of-the-art LMs: causal attention and relative positional\nencodings. Specifically, we find that causal attention generally causes models\nto favor distant content, while relative positional encodings like RoPE prefer\nnearby ones based on the analysis of retrieval-augmented question answering\n(QA). Further, our empirical study on object detection reveals that position\nbias is also present in vision-language models (VLMs).\n  Based on the above analyses, we propose to ELIMINATE position bias caused by\ndifferent input segment orders (e.g., options in LM-as-a-judge, retrieved\ndocuments in QA) in a TRAINING-FREE ZERO-SHOT manner. Our method changes the\ncausal attention to bidirectional attention between segments and utilizes model\nattention values to decide the relative orders of segments instead of using the\norder provided in input prompts, therefore enabling Position-INvariant\ninferencE (PINE) at the segment level. By eliminating position bias, models\nachieve better performance and reliability in downstream tasks where position\nbias widely exists, such as LM-as-a-judge and retrieval-augmented QA.\n  Notably, PINE is especially useful when adapting LMs for evaluating reasoning\npairs: it consistently provides 8 to 10 percentage points performance gains in\nmost cases, and makes Llama-3-70B-Instruct perform even better than\nGPT-4-0125-preview on the RewardBench reasoning subset.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}