{"id":"2407.18329","title":"A New Brain Network Construction Paradigm for Brain Disorder via\n  Diffusion-based Graph Contrastive Learning","authors":"Yongcheng Zong, Shuqiang Wang","authorsParsed":[["Zong","Yongcheng",""],["Wang","Shuqiang",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 02:47:48 GMT"}],"updateDate":"2024-07-29","timestamp":1720234068000,"abstract":"  Brain network analysis plays an increasingly important role in studying brain\nfunction and the exploring of disease mechanisms. However, existing brain\nnetwork construction tools have some limitations, including dependency on\nempirical users, weak consistency in repeated experiments and time-consuming\nprocesses. In this work, a diffusion-based brain network pipeline, DGCL is\ndesigned for end-to-end construction of brain networks. Initially, the brain\nregion-aware module (BRAM) precisely determines the spatial locations of brain\nregions by the diffusion process, avoiding subjective parameter selection.\nSubsequently, DGCL employs graph contrastive learning to optimize brain\nconnections by eliminating individual differences in redundant connections\nunrelated to diseases, thereby enhancing the consistency of brain networks\nwithin the same group. Finally, the node-graph contrastive loss and\nclassification loss jointly constrain the learning process of the model to\nobtain the reconstructed brain network, which is then used to analyze important\nbrain connections. Validation on two datasets, ADNI and ABIDE, demonstrates\nthat DGCL surpasses traditional methods and other deep learning models in\npredicting disease development stages. Significantly, the proposed model\nimproves the efficiency and generalization of brain network construction. In\nsummary, the proposed DGCL can be served as a universal brain network\nconstruction scheme, which can effectively identify important brain connections\nthrough generative paradigms and has the potential to provide disease\ninterpretability support for neuroscience research.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}