{"id":"2407.10644","title":"TripletViNet: Mitigating Misinformation Video Spread Across Platforms","authors":"Petar Smolovic, Thilini Dahanayaka, Kanchana Thilakarathna","authorsParsed":[["Smolovic","Petar",""],["Dahanayaka","Thilini",""],["Thilakarathna","Kanchana",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 12:03:23 GMT"}],"updateDate":"2024-07-16","timestamp":1721045003000,"abstract":"  There has been rampant propagation of fake news and misinformation videos on\nmany platforms lately, and moderation of such content faces many challenges\nthat must be overcome. Recent research has shown the feasibility of identifying\nvideo titles from encrypted network traffic within a single platform, for\nexample, within YouTube or Facebook. However, there are no existing methods for\ncross-platform video recognition, a crucial gap that this works aims to\naddress. Encrypted video traffic classification within a single platform, that\nis, classifying the video title of a traffic trace of a video on one platform\nby training on traffic traces of videos on the same platform, has significant\nlimitations due to the large number of video platforms available to users to\nupload harmful content to. To attempt to address this limitation, we conduct a\nfeasibility analysis into and attempt to solve the challenge of recognizing\nvideos across multiple platforms by using the traffic traces of videos on one\nplatform only. We propose TripletViNet, a framework that encompasses i)\nplatform-wise pre-processing, ii) an encoder trained utilizing triplet learning\nfor improved accuracy and iii) multiclass classifier for classifying the video\ntitle of a traffic trace. To evaluate the performance of TripletViNet, a\ncomprehensive dataset with traffic traces for 100 videos on six major platforms\nwith the potential for spreading misinformation such as YouTube, X, Instagram,\nFacebook, Rumble, and Tumblr was collected and used to test TripletViNet in\nboth closed-set and open-set scenarios. TripletViNet achieves significant\nimprovements in accuracy due to the correlation between video traffic and the\nvideo's VBR, with impressive final accuracies exceeding 90% in certain\nscenarios.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"q10jWXGBIMHmEnNZ6vOIkV7amEqF3ov936TnzVfuO1U","pdfSize":"3179710"}
