{"id":"2407.04289","title":"Electronic Correlations in Multielectron Silicon Quantum Dots","authors":"Dylan H. Liang, MengKe Feng, Philip Y. Mai, Jesus D. Cifuentes, Andrew\n  S. Dzurak, and Andre Saraiva","authorsParsed":[["Liang","Dylan H.",""],["Feng","MengKe",""],["Mai","Philip Y.",""],["Cifuentes","Jesus D.",""],["Dzurak","Andrew S.",""],["Saraiva","Andre",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 06:46:38 GMT"}],"updateDate":"2024-07-08","timestamp":1720161998000,"abstract":"  Silicon quantum computing has the potential to revolutionize technology with\ncapabilities to solve real-life problems that are computationally complex or\neven intractable for modern computers [1] by offering sufficient high quality\nqubits to perform complex error-corrected calculations. Silicon\nmetal-oxide-semiconductor based quantum dots present a promising pathway for\nrealizing practical quantum computers. To improve certain qubit properties, it\nis a common strategy to incorporate multiple electrons in the same dot in order\nto form qubits in higher confined orbital states. Theoretical modelling is an\nessential part of understanding the quantum behaviour of these electrons,\nproviding a basis for validating the physical working of device models as well\nas providing insights into experimental data.\n  Hartree-Fock theory is an imperative tool for the electronic structure\nmodelling of multi-electron quantum dots due to its ability to simulate a large\nnumber of electrons with manageable computation load. However, an efficient\ncalculation of the self-consistent field becomes hard because dot formations in\nsilicon are characterized by strong electron-electron interactions and\nconduction band valleys, besides the relatively high comparative effective\nmass, which add to create a behaviour dominated by repulsion between electrons\nrather than a well established shell structure. In this paper, we present a\nHartree-Fock-based method that accounts for these complexities for the\nmodelling of silicon quantum dots. With this method, we first establish the\nsignificance of including electron-electron interactions and valley degree of\nfreedom and their implications. We then explore a simple case of anisotropic\ndots and observe the impact of anisotropy on dot formations.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}