{"id":"2407.16439","title":"PINNPStomo: Simultaneous P- and S-wave seismic traveltime tomography\n  using physics-informed neural networks with a new factored eikonal equation","authors":"Chao Song, Hang Geng, Umair bin Waheed, Cai Liu","authorsParsed":[["Song","Chao",""],["Geng","Hang",""],["Waheed","Umair bin",""],["Liu","Cai",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 12:48:17 GMT"}],"updateDate":"2024-07-24","timestamp":1721738897000,"abstract":"  Seismic tomography has long been an effective tool for constructing reliable\nsubsurface structures. However, simultaneous inversion of P- and S-wave\nvelocities presents a significant challenge for conventional seismic tomography\nmethods, which depend on numerical algorithms to calculate traveltimes. A\nphysics informed neural network (PINN)-based seismic tomography method\n(PINNtomo) has been proposed to solve the eikonal equation and construct the\nvelocity model. Leveraging the powerful approximation capabilities of neural\nnetworks, we propose extending PINNtomo to perform multiparameter inversion of\nP- and S-wave velocities jointly, which we refer to as PINNPStomo. In\nPINNPStomo, we employ two neural networks: one for the P- and S-wave\ntraveltimes, and another for the P- and S-wave velocities. By optimizing the\nmisfits of P- and S-wave first-arrival traveltimes calculated from the eikonal\nequations, we can obtain the predicted P- and S-wave velocities that determine\nthese traveltimes. Recognizing that the original PINNtomo utilizes a\nmultiplicative factored eikonal equation, which depends on background\ntraveltimes corresponding to a homogeneous velocity at the source location. We\npropose a new factored eikonal equation for PINNPStomo to eliminate this\ndependency. The proposed PINNPStomo, incorporating the new factored eikonal\nequation, demonstrates superior convergence speed and multiparameter inversion\naccuracy. We validate these improvements using 2D Marmousi and 2D/3D Overthrust\nelastic velocity models across three different seismic data acquisition\ngeometries.\n","subjects":["Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}