{"id":"2407.01355","title":"Hyperspectral Pansharpening: Critical Review, Tools and Future\n  Perspectives","authors":"Matteo Ciotola, Giuseppe Guarino, Gemine Vivone, Giovanni Poggi,\n  Jocelyn Chanussot, Antonio Plaza, Giuseppe Scarpa","authorsParsed":[["Ciotola","Matteo",""],["Guarino","Giuseppe",""],["Vivone","Gemine",""],["Poggi","Giovanni",""],["Chanussot","Jocelyn",""],["Plaza","Antonio",""],["Scarpa","Giuseppe",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:10:50 GMT"}],"updateDate":"2024-07-02","timestamp":1719846650000,"abstract":"  Hyperspectral pansharpening consists of fusing a high-resolution panchromatic\nband and a low-resolution hyperspectral image to obtain a new image with high\nresolution in both the spatial and spectral domains. These remote sensing\nproducts are valuable for a wide range of applications, driving ever growing\nresearch efforts. Nonetheless, results still do not meet application demands.\nIn part, this comes from the technical complexity of the task: compared to\nmultispectral pansharpening, many more bands are involved, in a spectral range\nonly partially covered by the panchromatic component and with overwhelming\nnoise. However, another major limiting factor is the absence of a comprehensive\nframework for the rapid development and accurate evaluation of new methods.\nThis paper attempts to address this issue.\n  We started by designing a dataset large and diverse enough to allow reliable\ntraining (for data-driven methods) and testing of new methods. Then, we\nselected a set of state-of-the-art methods, following different approaches,\ncharacterized by promising performance, and reimplemented them in a single\nPyTorch framework. Finally, we carried out a critical comparative analysis of\nall methods, using the most accredited quality indicators. The analysis\nhighlights the main limitations of current solutions in terms of\nspectral/spatial quality and computational efficiency, and suggests promising\nresearch directions.\n  To ensure full reproducibility of the results and support future research,\nthe framework (including codes, evaluation procedures and links to the dataset)\nis shared on https://github.com/matciotola/hyperspectral_pansharpening_toolbox,\nas a single Python-based reference benchmark toolbox.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ciDFqUFFvzVrMfxD3uLraKt1h3cjyIcQyA03ccizzl0","pdfSize":"3616527","objectId":"0x159f09d3f035b9583624c5149569eb99c263a507ba6793c8951c08a5c63df86c","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
