{"id":"2407.19296","title":"Multi-Modal CLIP-Informed Protein Editing","authors":"Mingze Yin, Hanjing Zhou, Yiheng Zhu, Miao Lin, Yixuan Wu, Jialu Wu,\n  Hongxia Xu, Chang-Yu Hsieh, Tingjun Hou, Jintai Chen, Jian Wu","authorsParsed":[["Yin","Mingze",""],["Zhou","Hanjing",""],["Zhu","Yiheng",""],["Lin","Miao",""],["Wu","Yixuan",""],["Wu","Jialu",""],["Xu","Hongxia",""],["Hsieh","Chang-Yu",""],["Hou","Tingjun",""],["Chen","Jintai",""],["Wu","Jian",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 16:41:08 GMT"}],"updateDate":"2024-07-30","timestamp":1722098468000,"abstract":"  Proteins govern most biological functions essential for life, but achieving\ncontrollable protein discovery and optimization remains challenging. Recently,\nmachine learning-assisted protein editing (MLPE) has shown promise in\naccelerating optimization cycles and reducing experimental workloads. However,\ncurrent methods struggle with the vast combinatorial space of potential protein\nedits and cannot explicitly conduct protein editing using biotext instructions,\nlimiting their interactivity with human feedback. To fill these gaps, we\npropose a novel method called ProtET for efficient CLIP-informed protein\nediting through multi-modality learning. Our approach comprises two stages: in\nthe pretraining stage, contrastive learning aligns protein-biotext\nrepresentations encoded by two large language models (LLMs), respectively.\nSubsequently, during the protein editing stage, the fused features from editing\ninstruction texts and original protein sequences serve as the final editing\ncondition for generating target protein sequences. Comprehensive experiments\ndemonstrated the superiority of ProtET in editing proteins to enhance\nhuman-expected functionality across multiple attribute domains, including\nenzyme catalytic activity, protein stability and antibody specific binding\nability. And ProtET improves the state-of-the-art results by a large margin,\nleading to significant stability improvements of 16.67% and 16.90%. This\ncapability positions ProtET to advance real-world artificial protein editing,\npotentially addressing unmet academic, industrial, and clinical needs.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}