{"id":"2407.12078","title":"Resolving the nano-Hz gravitational wave sky: the detectability of\n  eccentric binaries with PTA experiments","authors":"Riccardo J. Truant, David Izquierdo-Villalba, Alberto Sesana, Golam\n  Mohiuddin Shaifullah, Matteo Bonetti","authorsParsed":[["Truant","Riccardo J.",""],["Izquierdo-Villalba","David",""],["Sesana","Alberto",""],["Shaifullah","Golam Mohiuddin",""],["Bonetti","Matteo",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-18","timestamp":1721152800000,"abstract":"  Pulsar Timing Array (PTA) collaborations reported evidence of a nano-Hz\nstochastic gravitational wave background (sGWB) compatible with an\nadiabatically inspiraling population of massive black hole binaries (MBHBs).\nDespite the large uncertainties, the relatively flat spectral slope of the\nrecovered signal suggests a possible prominent role of MBHB dynamical coupling\nwith the environment or/and the presence of an eccentric MBHB population. This\nwork aims at studying the capabilities of future PTA experiments to detect\nsingle MBHBs under the realistic assumption that the sGWB is originated from an\neccentric binary population coupled with its environment. To this end, we\ngeneralize the standard signal-to-noise ratio (SNR) and Fisher Information\nMatrix calculations used in PTA for circular MBHBs to the case of eccentric\nsystems. We consider an ideal 10-year MeerKAT and 30-year SKA PTAs and apply\nour method over a wide number of simulated eccentric MBHB populations. We find\nthat the number of resolvable MBHBs for the SKA (MeerKAT) PTA is ${\\sim}\\,30$\n($4$) at $\\rm SNR\\,{>}\\,5$ (${>}\\,3$), featuring an increasing trend for larger\neccentricity values of the MBHB population. This is the result of eccentric\nMBHBs at ${\\lesssim}\\,10^{-9}\\, \\rm Hz$ emitting part of their power at high\nharmonics, thus reaching the PTA sensitivity band. Our results also indicate\nthat resolved MBHBs do not follow the eccentricity distribution of the\nunderlying MBHB population, but prefer low eccentricity values (${<}\\,0.6$).\nFinally, the recovery of binary intrinsic properties and sky-localization do\nnot depend on the system eccentricity, while orbital parameters such as\neccentricity and initial orbital phase show clear trends. Although simplified,\nour results show that SKA will enable the detection of tens of MBHBs,\nprojecting us into the era of precision gravitational wave astronomy at nano-Hz\nfrequencies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}