{"id":"2407.11155","title":"Joint Optimization of Completion Ratio and Latency of Offloaded Tasks\n  with Multiple Priority Levels in 5G Edge","authors":"Parisa Fard Moshiri, Murat Simsek, Burak Kantarci","authorsParsed":[["Moshiri","Parisa Fard",""],["Simsek","Murat",""],["Kantarci","Burak",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:26:55 GMT"}],"updateDate":"2024-07-17","timestamp":1721068015000,"abstract":"  Multi-Access Edge Computing (MEC) is widely recognized as an essential\nenabler for applications that necessitate minimal latency. However, the dropped\ntask ratio metric has not been studied thoroughly in literature. Neglecting\nthis metric can potentially reduce the system's capability to effectively\nmanage tasks, leading to an increase in the number of eliminated or unprocessed\ntasks. This paper presents a 5G-MEC task offloading scenario with a focus on\nminimizing the dropped task ratio, computational latency, and communication\nlatency. We employ Mixed Integer Linear Programming (MILP), Particle Swarm\nOptimization (PSO), and Genetic Algorithm (GA) to optimize the latency and\ndropped task ratio. We conduct an analysis on how the quantity of tasks and\nUser Equipment (UE) impacts the ratio of dropped tasks and the latency. The\ntasks that are generated by UEs are classified into two categories: urgent\ntasks and non-urgent tasks. The UEs with urgent tasks are prioritized in\nprocessing to ensure a zero-dropped task ratio. Our proposed method improves\nthe performance of the baseline methods, First Come First Serve (FCFS) and\nShortest Task First (STF), in the context of 5G-MEC task offloading. Under the\nMILP-based approach, the latency is reduced by approximately 55% compared to GA\nand 35% compared to PSO. The dropped task ratio under the MILP-based approach\nis reduced by approximately 70% compared to GA and by 40% compared to PSO.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}