{"id":"2407.11350","title":"Digital-Analog Transmission Framework for Task-Oriented Semantic\n  Communications","authors":"Yuzhou Fu, Wenchi Cheng, Wei Zhang, Wei Zhang","authorsParsed":[["Fu","Yuzhou",""],["Cheng","Wenchi",""],["Zhang","Wei",""],["Zhang","Wei",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 03:34:23 GMT"}],"updateDate":"2024-07-17","timestamp":1721100863000,"abstract":"  Task-Oriented Semantic Communication (TOSC) has been considered as a new\ncommunication paradigm to serve various samrt devices that depend on Artificial\nIntelligence (AI) tasks in future wireless networks. The existing TOSC\nframeworks rely on the Neural Network (NN) model to extract the semantic\nfeature from the source data. The semantic feature, constituted by analog\nvectors of a lower dimensionality relative to the original source data,\nreserves the meaning of the source data. By conveying the semantic feature,\nTOSCs can significantly reduce the amount of data transmission while ensuring\nthe correct execution of the AI-driven downstream task. However, standardized\nwireless networks depend on digital signal processing for data transmission,\nyet they necessitate the conveyance of semantic features that are inherently\nanalog. Although existing TOSC frameworks developed the Deep Learning (DL)\nbased \\emph{analog approach} or conventional \\emph{digital approach} to\ntransmit the semantic feature, but there are still many challenging problems to\nurgently be solved in actual deployment. In this article, we first propose\nseveral challenging issues associated with the development of the TOSC\nframework in the standardized wireless network. Then, we develop a\nDigital-Analog transmission framework based TOSC (DA-TOSC) to resolve these\nchallenging issues. Future research directions are discussed to further improve\nthe DA-TOSC.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}