{"id":"2407.14701","title":"Contextual modulation of language comprehension in a dynamic neural\n  model of lexical meaning","authors":"Michael C. Stern and Maria M. Pi\\~nango","authorsParsed":[["Stern","Michael C.",""],["Piñango","Maria M.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 23:28:55 GMT"}],"updateDate":"2024-07-23","timestamp":1721431735000,"abstract":"  We propose and computationally implement a dynamic neural model of lexical\nmeaning, and experimentally test its behavioral predictions. We demonstrate the\narchitecture and behavior of the model using as a test case the English lexical\nitem 'have', focusing on its polysemous use. In the model, 'have' maps to a\nsemantic space defined by two continuous conceptual dimensions, connectedness\nand control asymmetry, previously proposed to parameterize the conceptual\nsystem for language. The mapping is modeled as coupling between a neural node\nrepresenting the lexical item and neural fields representing the conceptual\ndimensions. While lexical knowledge is modeled as a stable coupling pattern,\nreal-time lexical meaning retrieval is modeled as the motion of neural\nactivation patterns between metastable states corresponding to semantic\ninterpretations or readings. Model simulations capture two previously reported\nempirical observations: (1) contextual modulation of lexical semantic\ninterpretation, and (2) individual variation in the magnitude of this\nmodulation. Simulations also generate a novel prediction that the by-trial\nrelationship between sentence reading time and acceptability should be\ncontextually modulated. An experiment combining self-paced reading and\nacceptability judgments replicates previous results and confirms the new model\nprediction. Altogether, results support a novel perspective on lexical\npolysemy: that the many related meanings of a word are metastable neural\nactivation states that arise from the nonlinear dynamics of neural populations\ngoverning interpretation on continuous semantic dimensions.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}