{"id":"2407.09841","title":"OmniRace: 6D Hand Pose Estimation for Intuitive Guidance of Racing Drone","authors":"Valerii Serpiva, Aleksey Fedoseev, Sausar Karaf, Ali Alridha\n  Abdulkarim, Dzmitry Tsetserukou","authorsParsed":[["Serpiva","Valerii",""],["Fedoseev","Aleksey",""],["Karaf","Sausar",""],["Abdulkarim","Ali Alridha",""],["Tsetserukou","Dzmitry",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 10:29:41 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 11:26:39 GMT"}],"updateDate":"2024-07-17","timestamp":1720866581000,"abstract":"  This paper presents the OmniRace approach to controlling a racing drone with\n6-degree of freedom (DoF) hand pose estimation and gesture recognition. To our\nknowledge, it is the first-ever technology that allows for low-level control of\nhigh-speed drones using gestures. OmniRace employs a gesture interface based on\ncomputer vision and a deep neural network to estimate a 6-DoF hand pose. The\nadvanced machine learning algorithm robustly interprets human gestures,\nallowing users to control drone motion intuitively. Real-time control of a\nracing drone demonstrates the effectiveness of the system, validating its\npotential to revolutionize drone racing and other applications. Experimental\nresults conducted in the Gazebo simulation environment revealed that OmniRace\nallows the users to complite the UAV race track significantly (by 25.1%) faster\nand to decrease the length of the test drone path (from 102.9 to 83.7 m). Users\npreferred the gesture interface for attractiveness (1.57 UEQ score), hedonic\nquality (1.56 UEQ score), and lower perceived temporal demand (32.0 score in\nNASA-TLX), while noting the high efficiency (0.75 UEQ score) and low physical\ndemand (19.0 score in NASA-TLX) of the baseline remote controller. The deep\nneural network attains an average accuracy of 99.75% when applied to both\nnormalized datasets and raw datasets. OmniRace can potentially change the way\nhumans interact with and navigate racing drones in dynamic and complex\nenvironments. The source code is available at\nhttps://github.com/SerValera/OmniRace.git.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}