{"id":"2407.17056","title":"Current-driven mechanical motion of double stranded DNA results in\n  structural instabilities and chiral-induced-spin-selectivity of electron\n  transport","authors":"Nicholas S. Davis, Julian A. Lawn, Riley J. Preston, Daniel S. Kosov","authorsParsed":[["Davis","Nicholas S.",""],["Lawn","Julian A.",""],["Preston","Riley J.",""],["Kosov","Daniel S.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 07:32:40 GMT"}],"updateDate":"2024-07-25","timestamp":1721806360000,"abstract":"  Chiral-induced-spin-selectivity of electron transport and its interplay with\nDNA's mechanical motion is explored in a double stranded DNA helix with\nspin-orbit-coupling. The mechanical degree of freedom is treated as a\nstochastic classical variable experiencing fluctuations and dissipation induced\nby the environment as well as force exerted by nonequilibrium, current-carrying\nelectrons. Electronic degrees of freedom are described quantum mechanically\nusing nonequilibrium Green's functions. Nonequilibrium Green's functions are\ncomputed along the trajectory for the classical variable taking into account\ndynamical, velocity dependent corrections. This mixed quantum-classical\napproach enables calculations of time-dependent spin-resolved currents. We\nshowed that the electronic force may significantly modify the classical\npotential which, at sufficient voltage, creates a bistable potential with\nconsiderable effect on electronic transport. The DNA's mechanical motion has a\nprofound effect on spin transport; it results in chiral-induced spin\nselectivity increasing spin polarisation of the current by 9% and also\nresulting in temperature-dependent current voltage characteristics. We\ndemonstrate that the current noise measurement provides an accessible\nexperimental means to monitor the emergence of mechanical instability in DNA\nmotion. The spin resolved current noise also provides important dynamical\ninformation about the interplay between vibrational and spin degrees of freedom\nin DNA.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nQ6qvDRTxZo17xQOWyOTd_0W5lmBpYltxU1NZD8c1ao","pdfSize":"668109"}
