{"id":"2407.04172","title":"ChartGemma: Visual Instruction-tuning for Chart Reasoning in the Wild","authors":"Ahmed Masry, Megh Thakkar, Aayush Bajaj, Aaryaman Kartha, Enamul\n  Hoque, Shafiq Joty","authorsParsed":[["Masry","Ahmed",""],["Thakkar","Megh",""],["Bajaj","Aayush",""],["Kartha","Aaryaman",""],["Hoque","Enamul",""],["Joty","Shafiq",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 22:16:40 GMT"}],"updateDate":"2024-07-08","timestamp":1720131400000,"abstract":"  Given the ubiquity of charts as a data analysis, visualization, and\ndecision-making tool across industries and sciences, there has been a growing\ninterest in developing pre-trained foundation models as well as general purpose\ninstruction-tuned models for chart understanding and reasoning. However,\nexisting methods suffer crucial drawbacks across two critical axes affecting\nthe performance of chart representation models: they are trained on data\ngenerated from underlying data tables of the charts, ignoring the visual trends\nand patterns in chart images, and use weakly aligned vision-language backbone\nmodels for domain-specific training, limiting their generalizability when\nencountering charts in the wild. We address these important drawbacks and\nintroduce ChartGemma, a novel chart understanding and reasoning model developed\nover PaliGemma. Rather than relying on underlying data tables, ChartGemma is\ntrained on instruction-tuning data generated directly from chart images, thus\ncapturing both high-level trends and low-level visual information from a\ndiverse set of charts. Our simple approach achieves state-of-the-art results\nacross $5$ benchmarks spanning chart summarization, question answering, and\nfact-checking, and our elaborate qualitative studies on real-world charts show\nthat ChartGemma generates more realistic and factually correct summaries\ncompared to its contemporaries. We release the code, model checkpoints,\ndataset, and demos at https://github.com/vis-nlp/ChartGemma.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}