{"id":"2407.04055","title":"Benchmark on Drug Target Interaction Modeling from a Structure\n  Perspective","authors":"Xinnan Zhang, Jialin Wu, Junyi Xie, Tianlong Chen, Kaixiong Zhou","authorsParsed":[["Zhang","Xinnan",""],["Wu","Jialin",""],["Xie","Junyi",""],["Chen","Tianlong",""],["Zhou","Kaixiong",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 16:56:59 GMT"}],"updateDate":"2024-07-08","timestamp":1720112219000,"abstract":"  The prediction modeling of drug-target interactions is crucial to drug\ndiscovery and design, which has seen rapid advancements owing to deep learning\ntechnologies. Recently developed methods, such as those based on graph neural\nnetworks (GNNs) and Transformers, demonstrate exceptional performance across\nvarious datasets by effectively extracting structural information. However, the\nbenchmarking of these novel methods often varies significantly in terms of\nhyperparameter settings and datasets, which limits algorithmic progress. In\nview of these, we conduct a comprehensive survey and benchmark for drug-target\ninteraction modeling from a structure perspective, via integrating tens of\nexplicit (i.e., GNN-based) and implicit (i.e., Transformer-based) structure\nlearning algorithms. To this end, we first unify the hyperparameter setting\nwithin each class of structure learning methods. Moreover, we conduct a\nmacroscopical comparison between these two classes of encoding strategies as\nwell as the different featurization techniques that inform molecules' chemical\nand physical properties. We then carry out the microscopical comparison between\nall the integrated models across the six datasets, via comprehensively\nbenchmarking their effectiveness and efficiency. Remarkably, the summarized\ninsights from the benchmark studies lead to the design of model combos. We\ndemonstrate that our combos can achieve new state-of-the-art performance on\nvarious datasets associated with cost-effective memory and computation. Our\ncode is available at\n\\hyperlink{https://github.com/justinwjl/GTB-DTI/tree/main}{https://github.com/justinwjl/GTB-DTI/tree/main}.\n","subjects":["Quantitative Biology/Quantitative Methods","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}