{"id":"2407.16046","title":"Self-Ordering, Cooling and Lasing in an Ensemble of Clock Atoms","authors":"Anna Bychek, Laurin Ostermann, Helmut Ritsch","authorsParsed":[["Bychek","Anna",""],["Ostermann","Laurin",""],["Ritsch","Helmut",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 20:54:03 GMT"}],"updateDate":"2024-07-24","timestamp":1721681643000,"abstract":"  Active atomic clocks are predicted to provide far better short-term stability\nand robustness against thermal fluctuations than typical feedback-based optical\natomic clocks. However, continuous laser operation using an ensemble of clock\natoms still remains an experimentally challenging task. We study spatial\nself-organization in a transversely driven ensemble of clock atoms inside an\noptical resonator and coherent light emission from the cavity. We focus on the\nspectral properties of the emitted light in the narrow atomic linewidth regime,\nwhere the phase coherence providing frequency stability is stored in the atomic\ndipoles rather than the cavity field. The atoms are off-resonantly driven by a\nstanding-wave coherent laser transversely to the cavity axis allowing for\natomic motion along the cavity axis as well as along the pump. In order to\ntreat larger atom numbers we employ a second-order cumulant expansion which\nallows us to calculate the spectrum of the cavity light field. We identify the\nself-organization threshold where the atoms align themselves in a checkerboard\npattern thus maximizing light scattering into the cavity which simultaneously\ninduces cooling. For a larger driving intensity, more atoms are transferred to\nthe excited state, reducing cooling but increasing light emission from the\nexcited atoms. This can be enhanced via a second cavity mode at the atomic\nfrequency spatially shifted by a quarter wavelength. For large enough atom\nnumbers we observe laser-like emission close to the bare atomic transition\nfrequency.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BTUU3PKOASPLk-VLdZpy8TowKR8Hd2L-vdVZ9T3hG88","pdfSize":"2729237"}
