{"id":"2407.01671","title":"Quantum State Preparation via Free Binary Decision Diagram","authors":"Yu Tanaka, Hayata Yamasaki and Mio Murao","authorsParsed":[["Tanaka","Yu",""],["Yamasaki","Hayata",""],["Murao","Mio",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:00:01 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 06:00:58 GMT"},{"version":"v3","created":"Mon, 2 Sep 2024 02:18:38 GMT"}],"updateDate":"2024-09-04","timestamp":1719856801000,"abstract":"  Quantum state preparation (QSP) is a fundamental task in quantum computation\nto prepare a quantum state for a given classical description of the quantum\nstate. The classical description of an $n$-qubit quantum state may have\n$\\exp(O(n))$ parameters in general, which are inherently inefficient to deal\nwith in the worst case; however, in many practical cases, we may be able to\nemploy suitable data structures to represent such large-scale data in a\ncompressed way, e.g., by using a free binary decision diagram (FBDD), a rooted\ndirected acyclic graph with two terminal nodes to concisely represent a Boolean\nfunction. We here construct a quantum algorithm for QSP when the classical\ndescription of a quantum state is given by an FBDD with weighted edges, and\nanalyze the space, and time complexity of QSP in this setting. We provide a\nnontrivial example of an $n$-qubit state that can be represented by a weighted\nFBDD with $N=O(\\mathrm{poly}(n))$ nodes rather than $\\mathrm{exp}(O(n))$. We\nshow that any quantum state represented by the weighted FBDD with $N$ nodes can\nbe prepared by an $O(N)$-sized quantum circuit using $N$ ancillary qubits,\nexponentially improving the required circuit size for QSP compared to other\nBDD-based QSPs. We also provide another example of an $n$-qubit state that can\nbe represented by a weighted FBDD with $N=O(n^2)$ nodes, and $O(n^2)$ ancillary\nqubits, but cannot be prepared efficiently by a QSP based on the amplitude\namplification. These results provide techniques to employ FBDDs as a tool for\nbroadening the possibility of efficient QSP.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}