{"id":"2407.17980","title":"Personalized and Context-aware Route Planning for Edge-assisted Vehicles","authors":"Dinesh Cyril Selvaraj, Falko Dressler and Carla Fabiana Chiasserini","authorsParsed":[["Selvaraj","Dinesh Cyril",""],["Dressler","Falko",""],["Chiasserini","Carla Fabiana",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 12:14:12 GMT"}],"updateDate":"2024-07-26","timestamp":1721909652000,"abstract":"  Conventional route planning services typically offer the same routes to all\ndrivers, focusing primarily on a few standardized factors such as travel\ndistance or time, overlooking individual driver preferences. With the inception\nof autonomous vehicles expected in the coming years, where vehicles will rely\non routes decided by such planners, there arises a need to incorporate the\nspecific preferences of each driver, ensuring personalized navigation\nexperiences. In this work, we propose a novel approach based on graph neural\nnetworks (GNNs) and deep reinforcement learning (DRL), aimed at customizing\nroutes to suit individual preferences. By analyzing the historical trajectories\nof individual drivers, we classify their driving behavior and associate it with\nrelevant road attributes as indicators of driver preferences. The GNN is\ncapable of representing the road network as graph-structured data effectively,\nwhile DRL is capable of making decisions utilizing reward mechanisms to\noptimize route selection with factors such as travel costs, congestion level,\nand driver satisfaction. We evaluate our proposed GNN-based DRL framework using\na real-world road network and demonstrate its ability to accommodate driver\npreferences, offering a range of route options tailored to individual drivers.\nThe results indicate that our framework can select routes that accommodate\ndriver's preferences with up to a 17% improvement compared to a generic route\nplanner, and reduce the travel time by 33% (afternoon) and 46% (evening)\nrelatively to the shortest distance-based approach.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}