{"id":"2407.11867","title":"Unlearning Targeted Information via Single Layer Unlearning Gradient","authors":"Zikui Cai, Yaoteng Tan, M. Salman Asif","authorsParsed":[["Cai","Zikui",""],["Tan","Yaoteng",""],["Asif","M. Salman",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:52:36 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 19:19:59 GMT"}],"updateDate":"2024-09-09","timestamp":1721145156000,"abstract":"  Unauthorized privacy-related and copyrighted content generation using\ngenerative-AI is becoming a significant concern for human society, raising\nethical, legal, and privacy issues that demand urgent attention. The EU's\nGeneral Data Protection Regulation (GDPR) include a \"right to be forgotten,\"\nwhich allows individuals to request the deletion of their personal data.\nHowever, this primarily applies to data stored in traditional databases, not AI\nmodels. Recently, machine unlearning techniques have arise that attempt to\neliminate the influence of sensitive content used during AI model training, but\nthey often require extensive updates to the deployed systems and incur\nsubstantial computational costs. In this work, we propose a novel and efficient\nmethod called Single Layer Unlearning Gradient (SLUG), that can unlearn\ntargeted information by updating targeted layers of a model using a one-time\ngradient computation. Our method is highly modular and enables the selective\nremoval of multiple sensitive concepts, such as celebrity names and copyrighted\ncontent, from the generated outputs of widely used foundation models (e.g.,\nCLIP) and generative models (e.g., Stable Diffusion). Broadly, our method\nensures AI-generated content complies with privacy regulations and intellectual\nproperty laws, fostering responsible use of generative models, mitigating legal\nrisks and promoting a trustworthy, socially responsible AI ecosystem.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cZthI3n8sJQr09EzkrS6mQ4-NtRQPwXszRHbQnO_lFs","pdfSize":"14251367","objectId":"0xd78366ba3803af40cfbe7f3405ee96571eb946c2b2d9013fdfd16a1908ffb435","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
