{"id":"2407.00419","title":"On the Complexity of Learning to Cooperate with Populations of Socially\n  Rational Agents","authors":"Robert Loftin, Saptarashmi Bandyopadhyay, Mustafa Mert \\c{C}elikok","authorsParsed":[["Loftin","Robert",""],["Bandyopadhyay","Saptarashmi",""],["Çelikok","Mustafa Mert",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 11:59:52 GMT"}],"updateDate":"2024-07-02","timestamp":1719662392000,"abstract":"  Artificially intelligent agents deployed in the real-world will require the\nability to reliably \\textit{cooperate} with humans (as well as other,\nheterogeneous AI agents). To provide formal guarantees of successful\ncooperation, we must make some assumptions about how partner agents could\nplausibly behave. Any realistic set of assumptions must account for the fact\nthat other agents may be just as adaptable as our agent is. In this work, we\nconsider the problem of cooperating with a \\textit{population} of agents in a\nfinitely-repeated, two player general-sum matrix game with private utilities.\nTwo natural assumptions in such settings are that: 1) all agents in the\npopulation are individually rational learners, and 2) when any two members of\nthe population are paired together, with high-probability they will achieve at\nleast the same utility as they would under some Pareto efficient equilibrium\nstrategy. Our results first show that these assumptions alone are insufficient\nto ensure \\textit{zero-shot} cooperation with members of the target population.\nWe therefore consider the problem of \\textit{learning} a strategy for\ncooperating with such a population using prior observations its members\ninteracting with one another. We provide upper and lower bounds on the number\nof samples needed to learn an effective cooperation strategy. Most importantly,\nwe show that these bounds can be much stronger than those arising from a\n\"naive'' reduction of the problem to one of imitation learning.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Multiagent Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}