{"id":"2407.09673","title":"The Ballad of the Bots: Sonification Using Cognitive Metaphor to Support\n  Immersed Teleoperation of Robot Teams","authors":"Joe Simmons, Paul Bremner, Thomas J Mitchell, Alison Bown, Verity\n  McIntosh","authorsParsed":[["Simmons","Joe",""],["Bremner","Paul",""],["Mitchell","Thomas J",""],["Bown","Alison",""],["McIntosh","Verity",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 20:12:24 GMT"}],"updateDate":"2024-07-16","timestamp":1720815144000,"abstract":"  As an embodied and spatial medium, virtual reality is proving an attractive\nproposition for robot teleoperation in hazardous environments. This paper\nexamines a nuclear decommissioning scenario in which a simulated team of\nsemi-autonomous robots are used to characterise a chamber within a virtual\nnuclear facility. This study examines the potential utility and impact of\nsonification as a means of communicating salient operator data in such an\nenvironment. However, the question of what sound should be used and how it can\nbe applied in different applications is far from resolved. This paper explores\nand compares two sonification design approaches. The first is inspired by the\ntheory of cognitive metaphor to create sonifications that align with socially\nacquired contextual and ecological understanding of the application domain. The\nsecond adopts a computationalist approach using auditory mappings that are\ncommonplace in the literature. The results suggest that the computationalist\napproach outperforms the cognitive metaphor approach in terms of predictability\nand mental workload. However, qualitative data analysis demonstrates that the\ncognitive metaphor approach resulted in sounds that were more intuitive, and\nwere better implemented for spatialisation of data sources and data legibility\nwhen there was more than one sound source.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}