{"id":"2407.03046","title":"Insulating and metallic phases in the one-dimensional\n  Hubbard-Su-Schrieffer-Heeger model: Insights from a backflow-inspired\n  variational wave function","authors":"Davide Piccioni, Francesco Ferrari, Michele Fabrizio, Federico Becca","authorsParsed":[["Piccioni","Davide",""],["Ferrari","Francesco",""],["Fabrizio","Michele",""],["Becca","Federico",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 12:13:28 GMT"}],"updateDate":"2024-07-04","timestamp":1720008808000,"abstract":"  The interplay between electron-electron and electron-phonon interactions is\nstudied in a one-dimensional lattice model, by means of a variational Monte\nCarlo method based on generalized Jastrow-Slater wave functions. Here, the\nfermionic part is constructed by a pair-product state, which explicitly depends\non the phonon configuration, thus including the electron-phonon coupling in a\nbackflow-inspired way. We report the results for the Hubbard model in presence\nof the Su-Schrieffer-Heeger coupling to optical phonons, both at half-filling\nand upon hole doping. At half-filling, the ground state is either a\ntranslationally invariant Mott insulator, with gapless spin excitations, or a\nPeierls insulator, which breaks translations and has fully gapped excitations.\nAway from half-filling, the charge gap closes in both Mott and Peierls\ninsulators, turning the former into a conventional Luttinger liquid (gapless in\nall excitation channels). The latter, instead, retains a finite spin gap that\ncloses only above a threshold value of the doping. Even though consistent with\nthe general theory of interacting electrons in one dimension, the existence of\nsuch a phase (with gapless charge but gapped spin excitations) has never been\ndemonstrated in a model with repulsive interaction and with only two Fermi\npoints. Since the spin-gapped metal represents the one-dimensional counterpart\nof a superconductor, our results furnish evidence that a true off-diagonal\nlong-range order may exist in the two-dimensional case.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}