{"id":"2407.15467","title":"FASHI: A blind survey of 21cm HI absorption galaxies with FAST","authors":"Chuan-Peng Zhang (NAOC), Ming Zhu, Peng Jiang, Cheng Cheng, Jin-Long\n  Xu, Nai-Ping Yu, Xiao-Lan Liu, and Bo Zhang","authorsParsed":[["Zhang","Chuan-Peng","","NAOC"],["Zhu","Ming",""],["Jiang","Peng",""],["Cheng","Cheng",""],["Xu","Jin-Long",""],["Yu","Nai-Ping",""],["Liu","Xiao-Lan",""],["Zhang","Bo",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 08:27:44 GMT"}],"updateDate":"2024-07-23","timestamp":1721636864000,"abstract":"  The FAST All Sky HI survey (FASHI) is broader in frequency band and deeper in\ndetection sensitivity than most of previous HI surveys. FASHI is designed to\ncover the entire sky observable by the Five-hundred-meter Aperture Spherical\nradio Telescope (FAST). Based on the FASHI data, we perform a blind survey of\n21cm HI absorption galaxies at redshift $z<0.09$ over an area of about 10000\nsquare degrees. We detected 51 HI absorbers, including 21 previously known and\n30 new ones, with 8 sources having no optical spectroscopic redshift. The\nprobability of occurrence for HI absorbers in all HI galaxies is 1/1078. The\nradio flux densities of the FASHI absorbers are mainly concentrated in the\nrange of $S_{\\rm 1.4GHz}=10\\sim100$ mJy, but even as low as $2.6\\pm0.4$mJy. The\nnumber of redshifted absorbers is slightly higher than the number of\nblueshifted absorbers. Such results would provide some important clues for\nfuture flux-selected HI absorber surveys. Therefore, FAST has significantly\nimproved the capabilities and performance for HI absorption observations and\nprovided a true blind survey of 21cm HI absorption galaxies for such studies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bB0RFgOgTju5YaloY70wWPdAvCnL4Ok8XG_pZPBuOg4","pdfSize":"5902920","objectId":"0x8828a0b395db47f675f2cf6a68f15acfb4e2a6be2eed8e6e75a189d2323475ae","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
