{"id":"2407.03813","title":"PECTP: Parameter-Efficient Cross-Task Prompts for Incremental Vision\n  Transformer","authors":"Qian Feng, Hanbin Zhao, Chao Zhang, Jiahua Dong, Henghui Ding, Yu-Gang\n  Jiang and Hui Qian","authorsParsed":[["Feng","Qian",""],["Zhao","Hanbin",""],["Zhang","Chao",""],["Dong","Jiahua",""],["Ding","Henghui",""],["Jiang","Yu-Gang",""],["Qian","Hui",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 10:37:58 GMT"}],"updateDate":"2024-07-08","timestamp":1720089478000,"abstract":"  Incremental Learning (IL) aims to learn deep models on sequential tasks\ncontinually, where each new task includes a batch of new classes and deep\nmodels have no access to task-ID information at the inference time. Recent vast\npre-trained models (PTMs) have achieved outstanding performance by prompt\ntechnique in practical IL without the old samples (rehearsal-free) and with a\nmemory constraint (memory-constrained): Prompt-extending and Prompt-fixed\nmethods. However, prompt-extending methods need a large memory buffer to\nmaintain an ever-expanding prompt pool and meet an extra challenging prompt\nselection problem. Prompt-fixed methods only learn a single set of prompts on\none of the incremental tasks and can not handle all the incremental tasks\neffectively. To achieve a good balance between the memory cost and the\nperformance on all the tasks, we propose a Parameter-Efficient Cross-Task\nPrompt (PECTP) framework with Prompt Retention Module (PRM) and classifier Head\nRetention Module (HRM). To make the final learned prompts effective on all\nincremental tasks, PRM constrains the evolution of cross-task prompts'\nparameters from Outer Prompt Granularity and Inner Prompt Granularity. Besides,\nwe employ HRM to inherit old knowledge in the previously learned classifier\nheads to facilitate the cross-task prompts' generalization ability. Extensive\nexperiments show the effectiveness of our method. The source codes will be\navailable at \\url{https://github.com/RAIAN08/PECTP}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}