{"id":"2407.07704","title":"Evaluating the Role of Security Assurance Cases in Agile Medical Device\n  Development","authors":"Max Fransson, Adam Andersson, Mazen Mohamad, Jan-Philipp Stegh\\\"ofer","authorsParsed":[["Fransson","Max",""],["Andersson","Adam",""],["Mohamad","Mazen",""],["Steghöfer","Jan-Philipp",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 14:34:53 GMT"}],"updateDate":"2024-07-11","timestamp":1720622093000,"abstract":"  Cybersecurity issues in medical devices threaten patient safety and can cause\nharm if exploited. Standards and regulations therefore require vendors of such\ndevices to provide an assessment of the cybersecurity risks as well as a\ndescription of their mitigation. Security assurance cases (SACs) capture these\nelements as a structured argument. Compiling an SAC requires taking\ndomain-specific regulations and requirements as well as the way of working into\naccount. In this case study, we evaluate CASCADE, an approach for building SAC\nin the context of a large medical device manufacturer with an established agile\ndevelopment workflow. We investigate the regulatory context as well as the\nadaptations needed in the development process. Our results show the suitability\nof SACs in the medical device industry. We identified 17 use cases in which an\nSAC supports internal and external needs. The connection to safety assurance\ncan be achieved by incorporating information from the risk assessment matrix\ninto the SAC. Integration into the development process can be achieved by\nintroducing a new role and rules for the design review and the release to\nproduction as well as additional criteria for the definition of done. We also\nshow that SACs built with CASCADE fulfill the requirements of relevant\nstandards in the medical domain such as ISO 14971.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}