{"id":"2407.02664","title":"The path towards contact-based physical human-robot interaction","authors":"Mohammad Farajtabar and Marie Charbonneau","authorsParsed":[["Farajtabar","Mohammad",""],["Charbonneau","Marie",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 20:52:42 GMT"},{"version":"v2","created":"Thu, 4 Jul 2024 05:54:17 GMT"},{"version":"v3","created":"Tue, 30 Jul 2024 03:59:34 GMT"}],"updateDate":"2024-07-31","timestamp":1719953562000,"abstract":"  With the advancements in human-robot interaction (HRI), robots are now\ncapable of operating in close proximity and engaging in physical interactions\nwith humans (pHRI). Likewise, contact-based pHRI is becoming increasingly\ncommon as robots are equipped with a range of sensors to perceive human\nmotions. Despite the presence of surveys exploring various aspects of HRI and\npHRI, there is presently a gap in comprehensive studies that collect, organize\nand relate developments across all aspects of contact-based pHRI. It has become\nchallenging to gain a comprehensive understanding of the current state of the\nfield, thoroughly analyze the aspects that have been covered, and identify\nareas needing further attention. Hence, the present survey. While it includes\nkey developments in pHRI, a particular focus is placed on contact-based\ninteraction, which has numerous applications in industrial, rehabilitation and\nmedical robotics. Across the literature, a common denominator is the importance\nto establish a safe, compliant and human intention-oriented interaction. This\nendeavour encompasses aspects of perception, planning and control, and how they\nwork together to enhance safety and reliability. Notably, the survey highlights\nthe application of data-driven techniques: backed by a growing body of\nliterature demonstrating their effectiveness, approaches like reinforcement\nlearning and learning from demonstration have become key to improving robot\nperception and decision-making within complex and uncertain pHRI scenarios. As\nthe field is yet in its early stage, these observations may help guide future\ndevelopments and steer research towards the responsible integration of\nphysically interactive robots into workplaces, public spaces, and elements of\nprivate life.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/"}