{"id":"2407.13541","title":"On the Discriminability of Self-Supervised Representation Learning","authors":"Zeen Song, Wenwen Qiang, Changwen Zheng, Fuchun Sun, Hui Xiong","authorsParsed":[["Song","Zeen",""],["Qiang","Wenwen",""],["Zheng","Changwen",""],["Sun","Fuchun",""],["Xiong","Hui",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 14:18:03 GMT"}],"updateDate":"2024-07-19","timestamp":1721312283000,"abstract":"  Self-supervised learning (SSL) has recently achieved significant success in\ndownstream visual tasks. However, a notable gap still exists between SSL and\nsupervised learning (SL), especially in complex downstream tasks. In this\npaper, we show that the features learned by SSL methods suffer from the\ncrowding problem, where features of different classes are not distinctly\nseparated, and features within the same class exhibit large intra-class\nvariance. In contrast, SL ensures a clear separation between classes. We\nanalyze this phenomenon and conclude that SSL objectives do not constrain the\nrelationships between different samples and their augmentations. Our\ntheoretical analysis delves into how SSL objectives fail to enforce the\nnecessary constraints between samples and their augmentations, leading to poor\nperformance in complex tasks. We provide a theoretical framework showing that\nthe performance gap between SSL and SL mainly stems from the inability of SSL\nmethods to capture the aggregation of similar augmentations and the separation\nof dissimilar augmentations. To address this issue, we propose a learnable\nregulator called Dynamic Semantic Adjuster (DSA). DSA aggregates and separates\nsamples in the feature space while being robust to outliers. Through extensive\nempirical evaluations on multiple benchmark datasets, we demonstrate the\nsuperiority of DSA in enhancing feature aggregation and separation, ultimately\nclosing the performance gap between SSL and SL.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WTCchPZ1BypYkBESYBuM07ahfKOcToeXtE-iK-71x0I","pdfSize":"2343968"}
