{"id":"2407.07517","title":"Parameter Efficient Fine Tuning for Multi-scanner PET to PET\n  Reconstruction","authors":"Yumin Kim, Gayoon Choi, Seong Jae Hwang","authorsParsed":[["Kim","Yumin",""],["Choi","Gayoon",""],["Hwang","Seong Jae",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 10:12:26 GMT"}],"updateDate":"2024-07-11","timestamp":1720606346000,"abstract":"  Reducing scan time in Positron Emission Tomography (PET) imaging while\nmaintaining high-quality images is crucial for minimizing patient discomfort\nand radiation exposure. Due to the limited size of datasets and distribution\ndiscrepancy across scanners in medical imaging, fine-tuning in a\nparameter-efficient and effective manner is on the rise. Motivated by the\npotential of Parameter-Efficient Fine-Tuning (PEFT), we aim to address these\nissues by effectively leveraging PEFT to improve limited data and GPU resource\nissues in multi-scanner setups. In this paper, we introduce PETITE,\nParameter-Efficient Fine-Tuning for MultI-scanner PET to PET REconstruction\nthat uses fewer than 1% of the parameters. To the best of our knowledge, this\nstudy is the first to systematically explore the efficacy of diverse PEFT\ntechniques in medical imaging reconstruction tasks via prevalent\nencoder-decoder-type deep models. This investigation, in particular, brings\nintriguing insights into PETITE as we show further improvements by treating\nencoder and decoder separately and mixing different PEFT methods, namely,\nMix-PEFT. Using multi-scanner PET datasets comprised of five different\nscanners, we extensively test the cross-scanner PET scan time reduction\nperformances (i.e., a model pre-trained on one scanner is fine-tuned on a\ndifferent scanner) of 21 feasible Mix-PEFT combinations to derive optimal\nPETITE. We show that training with less than 1% parameters using PETITE\nperforms on par with full fine-tuning (i.e., 100% parameter)\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}