{"id":"2407.19388","title":"A Phase-resolved View of \"Heartbeat\"-like variability in IGR J17091-3624\n  During the 2022 Outburst","authors":"Qing-Cang Shui, Shu Zhang, Jing-Qiang Peng, Shuang-Nan Zhang, Yu-Peng\n  Chen, Ling-Da Kong, Zhuo-Li Yu, Long Ji, Peng-Ju Wang, Zhi Chang, Hong-Xing\n  Yin, Jian Li","authorsParsed":[["Shui","Qing-Cang",""],["Zhang","Shu",""],["Peng","Jing-Qiang",""],["Zhang","Shuang-Nan",""],["Chen","Yu-Peng",""],["Kong","Ling-Da",""],["Yu","Zhuo-Li",""],["Ji","Long",""],["Wang","Peng-Ju",""],["Chang","Zhi",""],["Yin","Hong-Xing",""],["Li","Jian",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 04:09:27 GMT"}],"updateDate":"2024-07-30","timestamp":1722139767000,"abstract":"  IGR J17091-3624, in addition to GRS 1915+105, is the only black hole X-ray\nbinary that displays ``heartbeat\"-like variability characterized by structured\nflares with high amplitudes. In this study, we conduct a detailed\nphase-resolved analysis of the recently identified ``heartbeat\"-like Class X\nvariability in IGR J17091-3624 during its 2022 outburst, utilizing data from\nNICER and NuSTAR observations. A shortage in the high-energy (>20 keV) X-ray\nflux is detected at peak phases of the soft X-ray flare at a ~15 sigma\nconfidence level from the phase-folded light curves. Furthermore, our\nphase-resolved spectral analysis reveals variations in the spectral shape,\nparticularly showing significant synchronous variations in the disk temperature\nand flux with the count rate. These findings imply that the flare is primarily\ndriven by instabilities within the accretion disk, consistent with previous\nstudies on the well-known Class rho variability in GRS 1915+105. However, we\nalso observe a positive correlation between the disk temperature and flux over\nthe flare cycle, which differs from a loop relation between the two parameters\nfound in the Class rho variability. This could suggest differences in\nunderlying physical processes between the two variability classes. Variations\nin the Componization component during flares are also observed: the electron\ntemperature and covering fraction show anti-correlations with the disk flux,\nrevealing potential interactions between the accretion disk and the corona\nduring these flares.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}