{"id":"2407.07581","title":"Water-resistant hybrid perovskite solar cell -- drop triboelectric\n  energy harvester","authors":"Fernando Nunez-Galvez, Xabier Garcia-Casas, Lidia Contreras Bernal,\n  Alejandro Descalzo, Jose Manuel Obrero-Perez, Juan Pedro Espinos, Angel\n  Barranco, Ana Borras, Juan Ramon Sanchez-Valencia, Carmen Lopez-Santos","authorsParsed":[["Nunez-Galvez","Fernando",""],["Garcia-Casas","Xabier",""],["Bernal","Lidia Contreras",""],["Descalzo","Alejandro",""],["Obrero-Perez","Jose Manuel",""],["Espinos","Juan Pedro",""],["Barranco","Angel",""],["Borras","Ana",""],["Sanchez-Valencia","Juan Ramon",""],["Lopez-Santos","Carmen",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 12:13:54 GMT"}],"updateDate":"2024-07-11","timestamp":1720613634000,"abstract":"  The stability and reproducibility issues related to metal halide Perovskite\nSolar Cells (PSCs) have prevented so far from exploiting this highly efficient\nphotovoltaic technology under rainy or even moisture conditions and in\ncombination with drop triboelectric nanogenerators (D-TENGs). Protecting the\nPSCs with a waterproof encapsulator could overcome such a disadvantage. Herein,\nwe propose the implementation of fluorinated carbon (CFx) coatings produced by\nPECVD, enabling waterproof capability for the PSC and working as an energy\nharvesting surface for D-TENGs. These 100 nm - films present optimal optical\ntransmittance, fully preserving the photovoltaic parameters of the cell. The\nimproved long-term stability of the water-resistant PSCs prevents degradation\nunder illumination in outdoor or simulated adverse environments with high\nhumidity, high temperature, water immersion, or rain. As a remarkable result,\nthe 50% Power Conversion Efficiency (PCE) has been retained after ten days of\nillumination under 100% relative humidity at 50 degrees Celsius. Also, the CFx\ncoatings were successfully tested as a promoter agent to integrate commercial\nUV-curable sealants compatible with Spiro-OMeTAD, enhancing the performance\nstability of up to 80 % of PCE after 100 hours under illumination in a humid\nenvironment. This PSC was tested in a top-bottom electrode configuration for\nharvesting kinetic energy from droplets. Devices were compatible with\nsimultaneously working as D-TENG and photovoltaic cells, yielding voltage\noutputs up to 12 V with maximum peak power density reaching 2.75 uW/cm2 defined\nby the D-TENG and PCE of 11.5 % and 8.46 mA/cm2 of short circuit current\ndetermined by the PSC under dripping and for an illumination angle of 45\ndegrees. The durability of the multisource device was tested under constant\nillumination and periodical drop impacting for more than 5 hours.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}