{"id":"2407.21505","title":"Monotonicity, bounds and extrapolation of Block-Gauss and Gauss-Radau\n  quadrature for computing $B^T \\phi (A) B$","authors":"J\\\"orn Zimmerling and Vladimir Druskin and Valeria Simoncini","authorsParsed":[["Zimmerling","Jörn",""],["Druskin","Vladimir",""],["Simoncini","Valeria",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 10:23:41 GMT"},{"version":"v2","created":"Sun, 11 Aug 2024 09:16:02 GMT"}],"updateDate":"2024-08-13","timestamp":1722421421000,"abstract":"  In this paper, we explore quadratures for the evaluation of $B^T \\phi(A) B$\nwhere $A$ is a symmetric nonnegative-definite matrix in $\\mathbb{R}^{n \\times\nn}$, $B$ is a tall matrix in $\\mathbb{R}^{n \\times p}$, and $\\phi(\\cdot)$\nrepresents a matrix function that is regular enough in the neighborhood of\n$A$'s spectrum, e.g., a Stieltjes or exponential function. These formulations,\nfor example, commonly arise in the computation of multiple-input\nmultiple-output (MIMO) transfer functions for diffusion PDEs.\n  We propose an approximation scheme for $B^T \\phi(A) B$ leveraging the block\nLanczos algorithm and its equivalent representation through Stieltjes matrix\ncontinued fractions. We extend the notion of Gauss-Radau quadrature to the\nblock case, facilitating the derivation of easily computable error bounds. For\nproblems stemming from the discretization of self-adjoint operators with a\ncontinuous spectrum, we obtain sharp estimates grounded in potential theory for\nPad\\'e approximations and justify extrapolation algorithms at no added\ncomputational cost. The obtained results are illustrated on large-scale\nexamples of 2D diffusion and 3D Maxwell's equations as well as a graph from the\nSNAP repository. We also present promising experimental results on convergence\nacceleration via random enrichment of the initial block $B$.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}