{"id":"2407.07320","title":"Flow to Rare Events: An Application of Normalizing Flow in Temporal\n  Importance Sampling for Automated Vehicle Validation","authors":"Yichun Ye, He Zhang, Ye Tian, Jian Sun","authorsParsed":[["Ye","Yichun",""],["Zhang","He",""],["Tian","Ye",""],["Sun","Jian",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 02:31:15 GMT"}],"updateDate":"2024-07-11","timestamp":1720578675000,"abstract":"  Automated Vehicle (AV) validation based on simulated testing requires\nunbiased evaluation and high efficiency. One effective solution is to increase\nthe exposure to risky rare events while reweighting the probability measure.\nHowever, characterizing the distribution of risky events is particularly\nchallenging due to the paucity of samples and the temporality of continuous\nscenario variables. To solve it, we devise a method to represent, generate, and\nreweight the distribution of risky rare events. We decompose the temporal\nevolution of continuous variables into distribution components based on\nconditional probability. By introducing the Risk Indicator Function, the\ndistribution of risky rare events is theoretically precipitated out of\nnaturalistic driving distribution. This targeted distribution is practically\ngenerated via Normalizing Flow, which achieves exact and tractable probability\nevaluation of intricate distribution. The rare event distribution is then\ndemonstrated as the advantageous Importance Sampling distribution. We also\npromote the technique of temporal Importance Sampling. The combined method,\nnamed as TrimFlow, is executed to estimate the collision rate of Car-following\nscenarios as a tentative practice. The results showed that sampling background\nvehicle maneuvers from rare event distribution could evolve testing scenarios\nto hazardous states. TrimFlow reduced 86.1% of tests compared to generating\ntesting scenarios according to their exposure in the naturalistic driving\nenvironment. In addition, the TrimFlow method is not limited to one specific\ntype of functional scenario.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}