{"id":"2407.01790","title":"Label-free Neural Semantic Image Synthesis","authors":"Jiayi Wang, Kevin Alexander Laube, Yumeng Li, Jan Hendrik Metzen,\n  Shin-I Cheng, Julio Borges, Anna Khoreva","authorsParsed":[["Wang","Jiayi",""],["Laube","Kevin Alexander",""],["Li","Yumeng",""],["Metzen","Jan Hendrik",""],["Cheng","Shin-I",""],["Borges","Julio",""],["Khoreva","Anna",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 20:30:23 GMT"}],"updateDate":"2024-07-03","timestamp":1719865823000,"abstract":"  Recent work has shown great progress in integrating spatial conditioning to\ncontrol large, pre-trained text-to-image diffusion models. Despite these\nadvances, existing methods describe the spatial image content using\nhand-crafted conditioning inputs, which are either semantically ambiguous\n(e.g., edges) or require expensive manual annotations (e.g., semantic\nsegmentation). To address these limitations, we propose a new label-free way of\nconditioning diffusion models to enable fine-grained spatial control. We\nintroduce the concept of neural semantic image synthesis, which uses neural\nlayouts extracted from pre-trained foundation models as conditioning. Neural\nlayouts are advantageous as they provide rich descriptions of the desired\nimage, containing both semantics and detailed geometry of the scene. We\nexperimentally show that images synthesized via neural semantic image synthesis\nachieve similar or superior pixel-level alignment of semantic classes compared\nto those created using expensive semantic label maps. At the same time, they\ncapture better semantics, instance separation, and object orientation than\nother label-free conditioning options, such as edges or depth. Moreover, we\nshow that images generated by neural layout conditioning can effectively\naugment real data for training various perception tasks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"EGszLmKSy_wKUHzme9g_j4mvev4O65IP2_sRJ6ck-SQ","pdfSize":"42493585"}
