{"id":"2407.01455","title":"TimeToM: Temporal Space is the Key to Unlocking the Door of Large\n  Language Models' Theory-of-Mind","authors":"Guiyang Hou, Wenqi Zhang, Yongliang Shen, Linjuan Wu, Weiming Lu","authorsParsed":[["Hou","Guiyang",""],["Zhang","Wenqi",""],["Shen","Yongliang",""],["Wu","Linjuan",""],["Lu","Weiming",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 16:50:49 GMT"}],"updateDate":"2024-07-02","timestamp":1719852649000,"abstract":"  Theory of Mind (ToM)-the cognitive ability to reason about mental states of\nourselves and others, is the foundation of social interaction. Although ToM\ncomes naturally to humans, it poses a significant challenge to even the most\nadvanced Large Language Models (LLMs). Due to the complex logical chains in ToM\nreasoning, especially in higher-order ToM questions, simply utilizing reasoning\nmethods like Chain of Thought (CoT) will not improve the ToM capabilities of\nLLMs. We present TimeToM, which constructs a temporal space and uses it as the\nfoundation to improve the ToM capabilities of LLMs in multiple scenarios.\nSpecifically, within the temporal space, we construct Temporal Belief State\nChain (TBSC) for each character and inspired by the cognition perspective of\nthe social world model, we divide TBSC into self-world beliefs and social world\nbeliefs, aligning with first-order ToM (first-order beliefs) and higher-order\nToM (higher-order beliefs) questions, respectively. Moreover, we design a novel\ntool-belief solver that, by considering belief communication between characters\nin temporal space, can transform a character's higher-order beliefs into\nanother character's first-order beliefs under belief communication period.\nExperimental results indicate that TimeToM can dramatically improve the\nreasoning performance of LLMs on ToM questions while taking a big step towards\ncoherent and robust ToM reasoning.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}