{"id":"2407.05686","title":"Joint observations of late universe probes: cosmological parameter\n  constraints from gravitational wave and Type Ia supernova data","authors":"Jie Zheng, Xiao-Hui Liu and Jing-Zhao Qi","authorsParsed":[["Zheng","Jie",""],["Liu","Xiao-Hui",""],["Qi","Jing-Zhao",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 07:39:02 GMT"}],"updateDate":"2024-07-09","timestamp":1720424342000,"abstract":"  The growing tensions between the early Universe and the late Universe\nincreasingly highlight the importance of developing precise probes for late\ncosmology. As significant late-Universe probes, Type Ia supernovae (SNe Ia) and\ngravitational waves (GWs) can provide measurements of relative and absolute\ndistances, respectively. Their complementary nature is likely to break the\ndegeneracies among cosmological parameters, thereby yielding more precise\nconstraints. In this study, we use 43 gravitational-wave sources from the Third\nLIGO-Virgo-KAGRA Gravitational-Wave Transient Catalog (GWTC-3) and 1590 SNe Ia\nfrom Pantheon+ compilation to constrain the dark energy models, as an attempt\nto achieve precise late-Universe cosmological constraints. For the dark siren\nGW event, we estimate the corresponding redshift using the binary black hole\nredshift distribution model. The combination of GW and SNe Ia data could\nprovide the precision on the Hubble constant (H0) and the present matter\ndensity (Omega_m) of approximately 20% and 8% for the LambdaCDM model. If we\nconsider the equation of state of dark energy (w), the combination sample\nconstrains the precision of w to approximately 30%. Although the combination of\nGW and SNe Ia observations effectively breaks degeneracies among various\ncosmological parameters, yielding more stringent constraints, the precision of\nthese constraints still does not meet the stringent standards required by\nprecision cosmology. However, it is reasonable to anticipate that, in the near\nfuture, the joint observations of GWs and SNe Ia will become a powerful tool,\nparticularly in the late Universe, for the precise measurement of cosmological\nparameters.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}