{"id":"2407.04488","title":"Impact of an Ensemble of Ocean Data Assimilations in ECMWF's next\n  generation ocean reanalysis system","authors":"Marcin Chrust, Anthony T. Weaver, Philip Browne, Hao Zuo, Magdalena\n  Alonso Balmaseda","authorsParsed":[["Chrust","Marcin",""],["Weaver","Anthony T.",""],["Browne","Philip",""],["Zuo","Hao",""],["Balmaseda","Magdalena Alonso",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 13:14:57 GMT"}],"updateDate":"2024-07-08","timestamp":1720185297000,"abstract":"  An Ensemble of Data Assimilations (EDA) can provide valuable information on\nthe analysis and short-range forecast uncertainties. The present ECMWF\noperational ocean analysis and reanalysis system, called ORAS5, produces an\nensemble but does not exploit it for the specification of the background-error\ncovariance matrix $\\mathbf{B}$, a key component of the data assimilation\nsystem. In this article, we describe EDA developments for the ocean, which take\nadvantage of the short-range forecast ensemble for specifying, in two distinct\nways, parameters of a covariance model representation of $\\mathbf{B}$. First,\nwe generate a climatological ensemble over an extended period to produce\nseasonally varying climatological estimates of background-error variances and\nhorizontal correlation length-scales. Second, on each assimilation cycle, we\ndiagnose flow-dependent variances from the ensemble and blend them with the\nclimatological estimates to form hybrid variances. We also use the ensemble to\ndiagnose flow-dependent vertical correlation length-scales. We demonstrate for\nthe Argo-rich period that this new, hybrid formulation of $\\mathbf{B}$ results\nin a significant reduction of background errors compared to the parameterized\nformulation of $\\mathbf{B}$ used in ORAS5. The new ocean EDA system will be\nemployed in ORAS6, ECMWF's next generation ocean reanalysis system.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}