{"id":"2407.04732","title":"PhishNet: A Phishing Website Detection Tool using XGBoost","authors":"Prashant Kumar, Kevin Antony, Deepakmoney Banga and Arshpreet Sohal","authorsParsed":[["Kumar","Prashant",""],["Antony","Kevin",""],["Banga","Deepakmoney",""],["Sohal","Arshpreet",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 21:31:13 GMT"}],"updateDate":"2024-07-09","timestamp":1719696673000,"abstract":"  PhisNet is a cutting-edge web application designed to detect phishing\nwebsites using advanced machine learning. It aims to help individuals and\norganizations identify and prevent phishing attacks through a robust AI\nframework. PhisNet utilizes Python to apply various machine learning algorithms\nand feature extraction techniques for high accuracy and efficiency.\n  The project starts by collecting and preprocessing a comprehensive dataset of\nURLs, comprising both phishing and legitimate sites. Key features such as URL\nlength, special characters, and domain age are extracted to effectively train\nthe model. Multiple machine learning algorithms, including logistic regression,\ndecision trees, and neural networks, are evaluated to determine the best\nperformance in phishing detection. The model is finely tuned to optimize\nmetrics like accuracy, precision, recall, and the F1 score, ensuring reliable\ndetection of both common and sophisticated phishing tactics.\n  PhisNet's web application is developed using React.js, which allows for\nclient-side rendering and smooth integration with backend services, creating a\nresponsive and user-friendly interface. Users can input URLs and receive\nimmediate predictions with confidence scores, thanks to a robust backend\ninfrastructure that processes data and provides real-time results. The model is\ndeployed using Google Colab and AWS EC2 for their computational power and\nscalability, ensuring the application remains accessible and functional under\nvarying loads.\n  In summary, PhisNet represents a significant advancement in cybersecurity,\nshowcasing the effective use of machine learning and web development\ntechnologies to enhance user security. It empowers users to prevent phishing\nattacks and highlights AI's potential in transforming cybersecurity.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}