{"id":"2407.10628","title":"Automated high-resolution backscattered-electron imaging at macroscopic\n  scale","authors":"Zhiyuan Lang, Zunshuai Zhang, Lei Wang, Yuhan Liu, Weixiong Qian,\n  Shenghua Zhou, Ying Jiang, Tongyi Zhang, and Jiong Yang","authorsParsed":[["Lang","Zhiyuan",""],["Zhang","Zunshuai",""],["Wang","Lei",""],["Liu","Yuhan",""],["Qian","Weixiong",""],["Zhou","Shenghua",""],["Jiang","Ying",""],["Zhang","Tongyi",""],["Yang","Jiong",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 11:27:16 GMT"}],"updateDate":"2024-07-16","timestamp":1721042836000,"abstract":"  Scanning electron microscopy (SEM) has been widely utilized in the field of\nmaterials science due to its significant advantages, such as large depth of\nfield, wide field of view, and excellent stereoscopic imaging. However, at high\nmagnification, the limited imaging range in SEM cannot cover all the possible\ninhomogeneous microstructures. In this research, we propose a novel approach\nfor generating high-resolution SEM images across multiple scales, enabling a\nsingle image to capture physical dimensions at the centimeter level while\npreserving submicron-level details. We adopted the SEM imaging on the\nAlCoCrFeNi2.1 eutectic high entropy alloy (EHEA) as an example. SEM videos and\nimage stitching are combined to fulfill this goal, and the video-extracted\nlow-definition (LD) images are clarified by a well-trained denoising model.\nFurthermore, we segment the macroscopic image of the EHEA, and area of various\nmicrostructures are distinguished. Combining the segmentation results and\nhardness experiments, we found that the hardness is positively correlated with\nthe content of body-centered cubic (BCC) phase, negatively correlated with the\nlamella width, and the relationship with the proportion of lamellar structures\nwas not significant. Our work provides a feasible solution to generate\nmacroscopic images based on SEMs for further analysis of the correlations\nbetween the microstructures and spatial distribution, and can be widely applied\nto other types of microscope.\n","subjects":["Condensed Matter/Materials Science","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}