{"id":"2407.18432","title":"Accounting for reporting delays in real-time phylodynamic analyses with\n  preferential sampling","authors":"Catalina M. Medina, Julia A. Palacios, Volodymyr M. Minin","authorsParsed":[["Medina","Catalina M.",""],["Palacios","Julia A.",""],["Minin","Volodymyr M.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 23:52:29 GMT"}],"updateDate":"2024-07-29","timestamp":1721951549000,"abstract":"  The COVID-19 pandemic demonstrated that fast and accurate analysis of\ncontinually collected infectious disease surveillance data is crucial for\nsituational awareness and policy making. Coalescent-based phylodynamic analysis\ncan use genetic sequences of a pathogen to estimate changes in its effective\npopulation size, a measure of genetic diversity. These changes in effective\npopulation size can be connected to the changes in the number of infections in\nthe population of interest under certain conditions. Phylodynamics is an\nimportant set of tools because its methods are often resilient to the\nascertainment biases present in traditional surveillance data (e.g.,\npreferentially testing symptomatic individuals). Unfortunately, it takes weeks\nor months to sequence and deposit the sampled pathogen genetic sequences into a\ndatabase, making them available for such analyses. These reporting delays\nseverely decrease precision of phylodynamic methods closer to present time, and\nfor some models can lead to extreme biases. Here we present a method that\naffords reliable estimation of the effective population size trajectory closer\nto the time of data collection, allowing for policy decisions to be based on\nmore recent data. Our work uses readily available historic times between\nsampling and sequencing for a population of interest, and incorporates this\ninformation into the sampling model to mitigate the effects of reporting delay\nin real-time analyses. We illustrate our methodology on simulated data and on\nSARS-CoV-2 sequences collected in the state of Washington in 2021.\n","subjects":["Statistics/Methodology","Quantitative Biology/Populations and Evolution"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}