{"id":"2407.08086","title":"The GeometricKernels Package: Heat and Mat\\'ern Kernels for Geometric\n  Learning on Manifolds, Meshes, and Graphs","authors":"Peter Mostowsky, Vincent Dutordoir, Iskander Azangulov, No\\'emie\n  Jaquier, Michael John Hutchinson, Aditya Ravuri, Leonel Rozo, Alexander\n  Terenin, Viacheslav Borovitskiy","authorsParsed":[["Mostowsky","Peter",""],["Dutordoir","Vincent",""],["Azangulov","Iskander",""],["Jaquier","Noémie",""],["Hutchinson","Michael John",""],["Ravuri","Aditya",""],["Rozo","Leonel",""],["Terenin","Alexander",""],["Borovitskiy","Viacheslav",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 23:09:23 GMT"}],"updateDate":"2024-07-12","timestamp":1720652963000,"abstract":"  Kernels are a fundamental technical primitive in machine learning. In recent\nyears, kernel-based methods such as Gaussian processes are becoming\nincreasingly important in applications where quantifying uncertainty is of key\ninterest. In settings that involve structured data defined on graphs, meshes,\nmanifolds, or other related spaces, defining kernels with good\nuncertainty-quantification behavior, and computing their value numerically, is\nless straightforward than in the Euclidean setting. To address this difficulty,\nwe present GeometricKernels, a software package which implements the geometric\nanalogs of classical Euclidean squared exponential - also known as heat - and\nMat\\'ern kernels, which are widely-used in settings where uncertainty is of key\ninterest. As a byproduct, we obtain the ability to compute Fourier-feature-type\nexpansions, which are widely used in their own right, on a wide set of\ngeometric spaces. Our implementation supports automatic differentiation in\nevery major current framework simultaneously via a backend-agnostic design. In\nthis companion paper to the package and its documentation, we outline the\ncapabilities of the package and present an illustrated example of its\ninterface. We also include a brief overview of the theory the package is built\nupon and provide some historic context in the appendix.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Computation","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}