{"id":"2407.05323","title":"Enhancing Label-efficient Medical Image Segmentation with Text-guided\n  Diffusion Models","authors":"Chun-Mei Feng","authorsParsed":[["Feng","Chun-Mei",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 10:21:08 GMT"}],"updateDate":"2024-07-09","timestamp":1720347668000,"abstract":"  Aside from offering state-of-the-art performance in medical image generation,\ndenoising diffusion probabilistic models (DPM) can also serve as a\nrepresentation learner to capture semantic information and potentially be used\nas an image representation for downstream tasks, e.g., segmentation. However,\nthese latent semantic representations rely heavily on labor-intensive\npixel-level annotations as supervision, limiting the usability of DPM in\nmedical image segmentation. To address this limitation, we propose an enhanced\ndiffusion segmentation model, called TextDiff, that improves semantic\nrepresentation through inexpensive medical text annotations, thereby explicitly\nestablishing semantic representation and language correspondence for diffusion\nmodels. Concretely, TextDiff extracts intermediate activations of the Markov\nstep of the reverse diffusion process in a pretrained diffusion model on\nlarge-scale natural images and learns additional expert knowledge by combining\nthem with complementary and readily available diagnostic text information.\nTextDiff freezes the dual-branch multi-modal structure and mines the latent\nalignment of semantic features in diffusion models with diagnostic descriptions\nby only training the cross-attention mechanism and pixel classifier, making it\npossible to enhance semantic representation with inexpensive text. Extensive\nexperiments on public QaTa-COVID19 and MoNuSeg datasets show that our TextDiff\nis significantly superior to the state-of-the-art multi-modal segmentation\nmethods with only a few training samples.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}