{"id":"2407.01604","title":"Disentangling the X-ray variability in the Lyman continuum emitter Haro\n  11","authors":"A. Danehkar (1), S. Silich (2), E. C. Herenz (3), G. \\\"Ostlin (4) ((1)\n  Eureka Scientific, (2) Instituto Nacional de Astrof\\'isica, \\'Optica y\n  Electr\\'onica (INAOE), (3) Inter-University Centre for Astronomy and\n  Astrophysics (IUCAA), (4) Oskar Klein Centre, Stockholm University)","authorsParsed":[["Danehkar","A.",""],["Silich","S.",""],["Herenz","E. C.",""],["Östlin","G.",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 17:56:52 GMT"}],"updateDate":"2024-07-03","timestamp":1719424612000,"abstract":"  Lyman break analogs in the local Universe serve as counterparts to Lyman\nbreak galaxies (LBGs) at high redshifts, which are widely regarded as major\ncontributors to cosmic reionization in the early stages of the Universe. We\nstudied XMM-Newton and Chandra observations of the nearby LBG analog Haro 11,\nwhich contains two X-ray-bright sources, X1 and X2. Both sources exhibit Lyman\ncontinuum (LyC) leakage, particularly X2. We analyzed the X-ray variability\nusing principal component analysis (PCA) and performed spectral modeling of the\nX1 and X2 observations made with the Chandra ACIS-S instrument. The PCA\ncomponent, which contributes to the X-ray variability, is apparently associated\nwith variable emission features, likely from ionized superwinds. Our spectral\nanalysis of the Chandra data indicates that the fainter X-ray source, X2 (X-ray\nluminosity $L_{\\rm X} \\sim 4 \\times 10^{40} $ erg s$^{-1}$), the one with\nhigher LyC leakage, has a much lower absorbing column ($N_{\\rm H} \\sim 1.2\n\\times 10^{21}$ cm$^{-2}$) than the heavily absorbed luminous source X1\n($L_{\\rm X} \\sim 9 \\times 10^{40} $ erg s$^{-1}$ and $N_{\\rm H} \\sim 11.5\n\\times 10^{21}$ cm$^{-2}$). We conclude that X2 is likely less covered by\nabsorbing material, which may be a result of powerful superwinds clearing\ngalactic channels and facilitating the escape of LyC radiation. Much deeper\nX-ray observations are required to validate the presence of potential\nsuperwinds and determine their implications for the LyC escape.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}