{"id":"2407.20794","title":"Data-driven physics-based modeling of pedestrian dynamics","authors":"Caspar A.S. Pouw and Geert G.M. van der Vleuten and Alessandro\n  Corbetta and Federico Toschi","authorsParsed":[["Pouw","Caspar A. S.",""],["van der Vleuten","Geert G. M.",""],["Corbetta","Alessandro",""],["Toschi","Federico",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 12:56:15 GMT"}],"updateDate":"2024-07-31","timestamp":1722344175000,"abstract":"  Pedestrian crowds encompass a complex interplay of intentional movements\naimed at reaching specific destinations, fluctuations due to personal and\ninterpersonal variability, and interactions with each other and the\nenvironment. Previous work showed the effectiveness of Langevin-like equations\nin capturing the statistical properties of pedestrian dynamics in simple\nsettings, such as almost straight trajectories. However, modeling more complex\ndynamics, e.g. when multiple routes and origin-destinations are involved,\nremains a significant challenge. In this work, we introduce a novel and generic\nframework to describe the dynamics of pedestrians in any geometric setting,\nsignificantly extending previous works. Our model is based on Langevin dynamics\nwith two timescales. The fast timescale corresponds to the stochastic\nfluctuations present when a pedestrian is walking. The slow timescale is\nassociated with the dynamics that a pedestrian plans to follow, thus a smoother\npath. Employing a data-driven approach inspired by statistical field theories,\nwe learn the complex potentials directly from the data, namely a\nhigh-statistics database of real-life pedestrian trajectories. This approach\nmakes the model generic as the potentials can be read from any trajectory data\nset and the underlying Langevin structure enables physics-based insights. We\nvalidate our model through a comprehensive statistical analysis, comparing\nsimulated trajectories with actual pedestrian measurements across five\ncomplementary settings, including a real-life train platform scenario,\nunderscoring its practical societal relevance. We show that our model\neffectively captures fluctuation statistics in pedestrian motion. Beyond\nproviding fundamental insights and predictive capabilities in pedestrian\ndynamics, our model could be used to investigate generic active dynamics such\nas vehicular traffic and collective animal behavior.\n","subjects":["Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}