{"id":"2407.08887","title":"Automatic Pruning of Fine-tuning Datasets for Transformer-based Language\n  Models","authors":"Mohammadreza Tayaranian, Seyyed Hasan Mozafari, Brett H. Meyer, James\n  J. Clark, Warren J. Gross","authorsParsed":[["Tayaranian","Mohammadreza",""],["Mozafari","Seyyed Hasan",""],["Meyer","Brett H.",""],["Clark","James J.",""],["Gross","Warren J.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 22:46:18 GMT"}],"updateDate":"2024-07-15","timestamp":1720737978000,"abstract":"  Transformer-based language models have shown state-of-the-art performance on\na variety of natural language understanding tasks. To achieve this performance,\nthese models are first pre-trained on general corpus and then fine-tuned on\ndownstream tasks. Previous work studied the effect of pruning the training set\nof the downstream tasks on the performance of the model on its evaluation set.\nIn this work, we propose an automatic dataset pruning method for the training\nset of fine-tuning tasks. Our method is based on the model's success rate in\ncorrectly classifying each training data point. Unlike previous work which\nrelies on user feedback to determine subset size, our method automatically\nextracts training subsets that are adapted for each pair of model and\nfine-tuning task. Our method provides multiple subsets for use in dataset\npruning that navigate the trade-off between subset size and evaluation\naccuracy. Our largest subset, which we also refer to as the winning ticket\nsubset, is on average $3 \\times$ smaller than the original training set of the\nfine-tuning task. Our experiments on 5 downstream tasks and 2 language models\nshow that, on average, fine-tuning on the winning ticket subsets results in a\n$0.1 \\%$ increase in the evaluation performance of the model.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}