{"id":"2407.00166","title":"Constraints on the in-situ and ex-situ stellar masses in nearby galaxies\n  with Artificial Intelligence","authors":"Eirini Angeloudi, Jes\\'us Falc\\'on-Barroso, Marc Huertas-Company,\n  Alina Boecker, Regina Sarmiento, Lukas Eisert, and Annalisa Pillepich","authorsParsed":[["Angeloudi","Eirini",""],["Falcón-Barroso","Jesús",""],["Huertas-Company","Marc",""],["Boecker","Alina",""],["Sarmiento","Regina",""],["Eisert","Lukas",""],["Pillepich","Annalisa",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 18:04:58 GMT"}],"updateDate":"2024-07-02","timestamp":1719597898000,"abstract":"  The hierarchical model of galaxy evolution suggests that the impact of\nmergers is substantial on the intricate processes that drive stellar assembly\nwithin a galaxy. However, accurately measuring the contribution of accretion to\na galaxy's total stellar mass and its balance with in-situ star formation poses\na persistent challenge, as it is neither directly observable nor easily\ninferred from observational properties. Here, we present theory-motivated\npredictions for the fraction of stellar mass originating from mergers in a\nstatistically significant sample of nearby galaxies, using data from MaNGA.\nEmploying a robust machine learning model trained on mock MaNGA analogs\n(MaNGIA) in turn obtained from a cosmological simulation (TNG50), we unveil\nthat in-situ stellar mass dominates almost across the entire stellar mass\nspectrum (1e9Msun < M* < 1e12Msun). Only in more massive galaxies (M* >\n1e11Msun) does accreted mass become a substantial contributor, reaching up to\n35-40% of the total stellar mass. Notably, the ex-situ stellar mass in the\nnearby universe exhibits significant dependence on galaxy characteristics, with\nhigher accreted fractions favored by elliptical, quenched galaxies and slow\nrotators, as well as galaxies at the center of more massive dark matter halos.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}