{"id":"2407.04839","title":"Bayesian Analysis Reveals the Key to Extracting Pair Potentials from\n  Neutron Scattering Data","authors":"Brennon L. Shanks, Harry W. Sullivan, Michael P. Hoepfner","authorsParsed":[["Shanks","Brennon L.",""],["Sullivan","Harry W.",""],["Hoepfner","Michael P.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 19:51:15 GMT"}],"updateDate":"2024-07-09","timestamp":1720209075000,"abstract":"  The inverse problem of statistical mechanics is an unsolved, century-old\nchallenge to learn classical pair potentials directly from experimental\nscattering data. This problem was extensively investigated in the 20th century\nbut was eventually eclipsed by standard methods of benchmarking pair potentials\nto macroscopic thermodynamic data. However, it is becoming increasingly clear\nthat existing force field models fail to reliably reproduce fluid structures\neven in simple liquids, which can result in reduced transferability and\nsubstantial misrepresentations of thermophysical behavior and self-assembly. In\nthis study, we revisited the structure inverse problem for a classical Mie\nfluid to determine to what extent experimental uncertainty in neutron\nscattering data influences the ability to recover classical pair potentials.\nBayesian uncertainty quantification was used to show that structure factors\nwith random noise smaller than 0.005 to $\\sim30$ A$^{-1}$ are required to\naccurately recover pair potentials from neutron scattering. Notably, modern\nneutron instruments can achieve this precision to extract classical force\nmodels to within approximately $\\pm$ 1.3 for the repulsive exponent, $\\pm$\n0.068 A$^{-1}$ for atomic size, and 0.024 kcal/mol in the potential well-depth\nwith 95\\% confidence. Our results suggest the exciting possibility of improving\nmolecular simulation accuracy through the incorporation of neutron scattering\ndata, advancement in structural modeling, and extraction of model-independent\nmeasurements of local atomic forces in real fluids.\n","subjects":["Condensed Matter/Statistical Mechanics","Condensed Matter/Soft Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}