{"id":"2407.00849","title":"Towards Understanding Sensitive and Decisive Patterns in Explainable AI:\n  A Case Study of Model Interpretation in Geometric Deep Learning","authors":"Jiajun Zhu, Siqi Miao, Rex Ying, Pan Li","authorsParsed":[["Zhu","Jiajun",""],["Miao","Siqi",""],["Ying","Rex",""],["Li","Pan",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 22:59:15 GMT"}],"updateDate":"2024-07-02","timestamp":1719788355000,"abstract":"  The interpretability of machine learning models has gained increasing\nattention, particularly in scientific domains where high precision and\naccountability are crucial. This research focuses on distinguishing between two\ncritical data patterns -- sensitive patterns (model-related) and decisive\npatterns (task-related) -- which are commonly used as model interpretations but\noften lead to confusion. Specifically, this study compares the effectiveness of\ntwo main streams of interpretation methods: post-hoc methods and\nself-interpretable methods, in detecting these patterns. Recently, geometric\ndeep learning (GDL) has shown superior predictive performance in various\nscientific applications, creating an urgent need for principled interpretation\nmethods. Therefore, we conduct our study using several representative GDL\napplications as case studies. We evaluate thirteen interpretation methods\napplied to three major GDL backbone models, using four scientific datasets to\nassess how well these methods identify sensitive and decisive patterns. Our\nfindings indicate that post-hoc methods tend to provide interpretations better\naligned with sensitive patterns, whereas certain self-interpretable methods\nexhibit strong and stable performance in detecting decisive patterns.\nAdditionally, our study offers valuable insights into improving the reliability\nof these interpretation methods. For example, ensembling post-hoc\ninterpretations from multiple models trained on the same task can effectively\nuncover the task's decisive patterns.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}