{"id":"2407.12642","title":"Zero-shot Text-guided Infinite Image Synthesis with LLM guidance","authors":"Soyeong Kwon, Taegyeong Lee, Taehwan Kim","authorsParsed":[["Kwon","Soyeong",""],["Lee","Taegyeong",""],["Kim","Taehwan",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:10:01 GMT"}],"updateDate":"2024-07-18","timestamp":1721229001000,"abstract":"  Text-guided image editing and generation methods have diverse real-world\napplications. However, text-guided infinite image synthesis faces several\nchallenges. First, there is a lack of text-image paired datasets with\nhigh-resolution and contextual diversity. Second, expanding images based on\ntext requires global coherence and rich local context understanding. Previous\nstudies have mainly focused on limited categories, such as natural landscapes,\nand also required to train on high-resolution images with paired text. To\naddress these challenges, we propose a novel approach utilizing Large Language\nModels (LLMs) for both global coherence and local context understanding,\nwithout any high-resolution text-image paired training dataset. We train the\ndiffusion model to expand an image conditioned on global and local captions\ngenerated from the LLM and visual feature. At the inference stage, given an\nimage and a global caption, we use the LLM to generate a next local caption to\nexpand the input image. Then, we expand the image using the global caption,\ngenerated local caption and the visual feature to consider global consistency\nand spatial local context. In experiments, our model outperforms the baselines\nboth quantitatively and qualitatively. Furthermore, our model demonstrates the\ncapability of text-guided arbitrary-sized image generation in zero-shot manner\nwith LLM guidance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"K3hrydjxgUhbHVRcIw2VSzg4dtqLaXGtEFN5tQSDOIg","pdfSize":"25729312"}
