{"id":"2407.00351","title":"Saturation of gas concentration signal of the laser gas sensor","authors":"Z.Zh. Zhanabaev, A.O. Tileu, T.S. Duisebayev, D.B. Almen","authorsParsed":[["Zhanabaev","Z. Zh.",""],["Tileu","A. O.",""],["Duisebayev","T. S.",""],["Almen","D. B.",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 07:51:02 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 10:29:55 GMT"},{"version":"v3","created":"Thu, 5 Sep 2024 08:00:09 GMT"}],"updateDate":"2024-09-06","timestamp":1719647462000,"abstract":"  Nowadays it is possible to determine the type of gas with sufficient accuracy\nwhen its concentration is less than {10}^{-6} (in units of ppm) fractions using\nspectroscopic methods (optical, radio engineering, acoustic). Along with this,\nthe value of permissible concentrations of explosive, toxic, harmful to\ntechnology and ecology gases is practically important. Known physical\nexperimental studies indicate only a linear dependence of the response of a\nlaser gas sensor at ppm\\gtrsim{10}^3. The research methods for\nppm\\lesssim{10}^3 are based on the processes of combustion, microexplosion,\nstructural and phase transformations and are not always applicable in real\npractical conditions. The work is devoted to the analysis of experimentally\nobtained fluctuations caused by a laser beam in a gas in a photodiode (signal\nreceiver) due to its influence not only at the atomic level, but also on the\nscale of clusters of nanoparticle molecules. The gas concentration is estimated\nby the fluctuation-dissipation ratio. It is shown that the signal correlator is\nsaturated to a constant value when the quantum (laser photon energy) and\nthermal (nanoparticle temperature) factors are comparable with an increase in\nthe concentration of the target gas. The critical values of the saturation\nconcentration are determined by the equality of these two factors.\n","subjects":["Physics/Instrumentation and Detectors","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZBh36S3hWoiQaCfacH1CTtuQWzXiFFHRSpLN38_iKa4","pdfSize":"578635"}
