{"id":"2407.08546","title":"Quantitative Evaluation of the Saliency Map for Alzheimer's Disease\n  Classifier with Anatomical Segmentation","authors":"Yihan Zhang, Xuanshuo Zhang, Wei Wu, and Haohan Wang","authorsParsed":[["Zhang","Yihan",""],["Zhang","Xuanshuo",""],["Wu","Wei",""],["Wang","Haohan",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:30:49 GMT"}],"updateDate":"2024-07-12","timestamp":1720708249000,"abstract":"  Saliency maps have been widely used to interpret deep learning classifiers\nfor Alzheimer's disease (AD). However, since AD is heterogeneous and has\nmultiple subtypes, the pathological mechanism of AD remains not fully\nunderstood and may vary from patient to patient. Due to the lack of such\nunderstanding, it is difficult to comprehensively and effectively assess the\nsaliency map of AD classifier. In this paper, we utilize the anatomical\nsegmentation to allocate saliency values into different brain regions. By\nplotting the distributions of saliency maps corresponding to AD and NC (Normal\nControl), we can gain a comprehensive view of the model's decisions process. In\norder to leverage the fact that the brain volume shrinkage happens in AD\npatients during disease progression, we define a new evaluation metric, brain\nvolume change score (VCS), by computing the average Pearson correlation of the\nbrain volume changes and the saliency values of a model in different brain\nregions for each patient. Thus, the VCS metric can help us gain some knowledge\nof how saliency maps resulting from different models relate to the changes of\nthe volumes across different regions in the whole brain. We trained candidate\nmodels on the ADNI dataset and tested on three different datasets. Our results\nindicate: (i) models with higher VCSs tend to demonstrate saliency maps with\nmore details relevant to the AD pathology, (ii) using gradient-based\nadversarial training strategies such as FGSM and stochastic masking can improve\nthe VCSs of the models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Quantitative Biology/Quantitative Methods"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}