{"id":"2407.14149","title":"Coprime networks of the composite numbers: pseudo-randomness and\n  synchronizability","authors":"Md Rahil Miraj, Dibakar Ghosh and Chittaranjan Hens","authorsParsed":[["Miraj","Md Rahil",""],["Ghosh","Dibakar",""],["Hens","Chittaranjan",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 09:27:56 GMT"}],"updateDate":"2024-07-22","timestamp":1721381276000,"abstract":"  In this paper, we propose a network whose nodes are labeled by the composite\nnumbers and two nodes are connected by an undirected link if they are\nrelatively prime to each other. As the size of the network increases, the\nnetwork will be connected whenever the largest possible node index $n\\geq 49$.\nTo investigate how the nodes are connected, we analytically describe that the\nlink density saturates to $6/\\pi^2$, whereas the average degree increases\nlinearly with slope $6/\\pi^2$ with the size of the network. To investigate how\nthe neighbors of the nodes are connected to each other, we find the shortest\npath length will be at most 3 for $49\\leq n\\leq 288$ and it is at most 2 for\n$n\\geq 289$. We also derive an analytic expression for the local clustering\ncoefficients of the nodes, which quantifies how close the neighbors of a node\nto form a triangle. We also provide an expression for the number of $r$-length\nlabeled cycles, which indicates the existence of a cycle of length at most\n$O(\\log n)$. Finally, we show that this graph sequence is actually a sequence\nof weakly pseudo-random graphs. We numerically verify our observed analytical\nresults. As a possible application, we have observed less synchronizability\n(the ratio of the largest and smallest positive eigenvalue of the Laplacian\nmatrix is high) as compared to Erd\\H{o}s-R\\'{e}nyi random network and\nBarab\\'{a}si-Albert network. This unusual observation is consistent with the\nprolonged transient behaviors of ecological and predator-prey networks which\ncan easily avoid the global synchronization.\n","subjects":["Mathematics/Combinatorics","Computing Research Repository/Discrete Mathematics","Computing Research Repository/Social and Information Networks","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NHdZYKuF_trR9LtKV7_I_RptKOKQt6tMpvfb5lhAcSY","pdfSize":"710676"}
