{"id":"2407.17897","title":"A general thermodynamically consistent phase-field-micromechanics model\n  of sintering with coupled diffusion and grain motion","authors":"Qingcheng Yang, Arkadz Kirshtein","authorsParsed":[["Yang","Qingcheng",""],["Kirshtein","Arkadz",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 09:38:03 GMT"}],"updateDate":"2024-07-26","timestamp":1721900283000,"abstract":"  Sintering is a pivotal technology for processing ceramic and metallic powders\ninto solid objects. A profound understanding of microstructure evolution during\nsintering is essential for manufacturing products with tailored properties.\nWhile various phase-field models have been proposed to simulate microstructure\nevolution in solid-state sintering, correctly incorporating the crucial\ndensification mechanism, particularly grain motion, remains a challenge. The\nfundamental obstacle lies in the ad hoc treatment of the micromechanics of\ngrain motion, where the thermodynamical driving force cannot be derived from\nthe system's free energy. This work presents a novel phase-field-micromechanics\nmodel for sintering (PFMMS) that addresses this challenge. We define a unified\nenergy law, under which the governing equations for microstructure evolution in\nsintering are derived using variational principles. Our approach ensures\nthermodynamic consistency, with the driving force for grain motion derived from\nthe system's free energy. Consequently, the proposed PFMMS guarantees the\nevolution of microstructure in a direction that reduces the system's energy and\neliminates non-densifying phenomena. We rigorously validate PFMMS against\nrecent benchmarks of theoretical and numerical analysis. It is found that PFMMS\ncaptures intrinsic stress distribution along and beyond grain boundaries,\nexhibits system-size-independent shrinkage strain, and maintains thermodynamic\nequilibrium states. These features are fundamental requirements for a\nphysically consistent sintering model.\n","subjects":["Condensed Matter/Materials Science","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}