{"id":"2407.21637","title":"Mixed precision HODLR matrices","authors":"Erin Carson, Xinye Chen, Xiaobo Liu","authorsParsed":[["Carson","Erin",""],["Chen","Xinye",""],["Liu","Xiaobo",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:36:40 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 07:32:54 GMT"},{"version":"v3","created":"Sat, 10 Aug 2024 09:35:08 GMT"}],"updateDate":"2024-08-13","timestamp":1722436600000,"abstract":"  Hierarchical matrix computations have attracted significant attention in the\nscience and engineering community as exploiting data-sparse structures can\nsignificantly reduce the computational complexity of many important kernels.\nOne particularly popular option within this class is the Hierarchical\nOff-Diagonal Low-Rank (HODLR) format. In this paper, we show that the\noff-diagonal blocks of HODLR matrices that are approximated by low-rank\nmatrices can be represented in low precision without degenerating the quality\nof the overall approximation (with the error growth bounded by a factor of\n$2$). We also present an adaptive-precision scheme for constructing and storing\nHODLR matrices, and we prove that the use of mixed precision does not\ncompromise the numerical stability of the resulting HOLDR matrix--vector\nproduct and LU factorization. That is, the resulting error in these\ncomputations is not significantly greater than the case where we use one\nprecision (say, double) for constructing and storing the HOLDR matrix. Our\nanalyses further give insight on how one must choose the working precision in\nHOLDR matrix computations relative to the approximation error in order to not\nobserve the effects of finite precision. Intuitively, when a HOLDR matrix is\nsubject to a high degree of approximation error, subsequent computations can be\nperformed in a lower precision without detriment. We demonstrate the validity\nof our theoretical results through a range of numerical experiments.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}