{"id":"2407.19812","title":"Image-text matching for large-scale book collections","authors":"Artemis Llabr\\'es, Arka Ujjal Dey, Dimosthenis Karatzas, and Ernest\n  Valveny","authorsParsed":[["Llabrés","Artemis",""],["Dey","Arka Ujjal",""],["Karatzas","Dimosthenis",""],["Valveny","Ernest",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 09:05:04 GMT"}],"updateDate":"2024-07-30","timestamp":1722243904000,"abstract":"  We address the problem of detecting and mapping all books in a collection of\nimages to entries in a given book catalogue. Instead of performing independent\nretrieval for each book detected, we treat the image-text mapping problem as a\nmany-to-many matching process, looking for the best overall match between the\ntwo sets. We combine a state-of-the-art segmentation method (SAM) to detect\nbook spines and extract book information using a commercial OCR. We then\npropose a two-stage approach for text-image matching, where CLIP embeddings are\nused first for fast matching, followed by a second slower stage to refine the\nmatching, employing either the Hungarian Algorithm or a BERT-based model\ntrained to cope with noisy OCR input and partial text matches. To evaluate our\napproach, we publish a new dataset of annotated bookshelf images that covers\nthe whole book collection of a public library in Spain. In addition, we provide\ntwo target lists of book metadata, a closed-set of 15k book titles that\ncorresponds to the known library inventory, and an open-set of 2.3M book titles\nto simulate an open-world scenario. We report results on two settings, on one\nhand on a matching-only task, where the book segments and OCR is given and the\nobjective is to perform many-to-many matching against the target lists, and a\ncombined detection and matching task, where books must be first detected and\nrecognised before they are matched to the target list entries. We show that\nboth the Hungarian Matching and the proposed BERT-based model outperform a\nfuzzy string matching baseline, and we highlight inherent limitations of the\nmatching algorithms as the target increases in size, and when either of the two\nsets (detected books or target book list) is incomplete. The dataset and code\nare available at https://github.com/llabres/library-dataset\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LfWCZnUQOpt6E46K2my8qhCYhamsN2PCSCZrNR3EKUI","pdfSize":"9129457","objectId":"0xd05c2b3eaf9905a62c466ec15734f2e6efba8bd257b8df38e4805ebf76fda655","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
