{"id":"2407.01235","title":"A Fingerprint for Large Language Models","authors":"Zhiguang Yang and Hanzhou Wu","authorsParsed":[["Yang","Zhiguang",""],["Wu","Hanzhou",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 12:25:42 GMT"}],"updateDate":"2024-07-02","timestamp":1719836742000,"abstract":"  Recent advances show that scaling a pre-trained language model could achieve\nstate-of-the-art performance on many downstream tasks, prompting large language\nmodels (LLMs) to become a hot research topic in the field of artificial\nintelligence. However, due to the resource-intensive nature of training LLMs\nfrom scratch, it is urgent and crucial to protect the intellectual property of\nLLMs against infringement. This has motivated the authors in this paper to\npropose a novel black-box fingerprinting technique for LLMs, which requires\nneither model training nor model fine-tuning. We first demonstrate that the\noutputs of LLMs span a unique vector space associated with each model. We model\nthe problem of ownership authentication as the task of evaluating the\nsimilarity between the victim model's space and the output's space of the\nsuspect model. To deal with this problem, we propose two solutions, where the\nfirst solution involves verifying whether the outputs of the suspected large\nmodel are in the same space as those of the victim model, enabling rapid\nidentification of model infringement, and the second one reconstructs the union\nof the vector spaces for LLM outputs and the victim model to address situations\nwhere the victim model has undergone the Parameter-Efficient Fine-Tuning (PEFT)\nattacks. Experimental results indicate that the proposed technique achieves\nsuperior performance in ownership verification and robustness against PEFT\nattacks. This work reveals inherent characteristics of LLMs and provides a\npromising solution for ownership verification of LLMs in black-box scenarios,\nensuring efficiency, generality and practicality.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}