{"id":"2407.02260","title":"Dynamical robustness of network of oscillators","authors":"Soumen Majhi, Biswambhar Rakshit, Amit Sharma, J\\\"urgen Kurths,\n  Dibakar Ghosh","authorsParsed":[["Majhi","Soumen",""],["Rakshit","Biswambhar",""],["Sharma","Amit",""],["Kurths","Jürgen",""],["Ghosh","Dibakar",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 13:29:21 GMT"}],"updateDate":"2024-07-03","timestamp":1719926961000,"abstract":"  Most complex systems are nonlinear, relying on emergent behavior from\ninteracting subsystems, often characterized by oscillatory dynamics. Collective\noscillatory behavior is essential for the proper functioning of many real world\nsystems. Complex networks have proven efficient in elucidating the topological\nstructures of both natural and artificial systems and describing diverse\nprocesses occurring within them. Recent advancements have significantly\nenhanced our understanding of emergent dynamics in complex networks. Among\nvarious processes, a substantial body of work explores the dynamical robustness\nof complex networks, their ability to withstand degradation in network\nconstituents while maintaining collective oscillatory dynamics. Many physical\nand biological systems experience a decline in dynamic activities due to\nnatural or environmental factors. The impact of such damages on network\nperformance can be significant, and the system's robustness indicates its\ncapability to maintain functionality despite dynamic changes, often termed\naging. This review provides a comprehensive overview of notable research\nexamining how networks sustain global oscillation despite increasing inactive\ndynamical units. We present contemporary research dedicated to the theoretical\nunderstanding and enhancement mechanisms of dynamical robustness in complex\nnetworks. Our focus includes various network structures and coupling functions,\nelucidating the persistence of networked systems. We cover system\ncharacteristics from heterogeneity in network connectivity to heterogeneity in\ndynamical units. Finally, we discuss challenges in this field and open areas\nfor future studies.\n","subjects":["Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://creativecommons.org/licenses/by/4.0/"}