{"id":"2407.07784","title":"First demonstration of Super-X divertor exhaust control for transient\n  heat load management in compact fusion reactors","authors":"B. Kool, K. Verhaegh, G.L. Derks, T.A. Wijkamp, N. Lonigro, R. Doyle,\n  G. McArdle, C. Vincent, J. Lovell, F. Federici, S.S. Henderson, R.T. Osawa,\n  D. Brida, H. Reimerdes, M. van Berkel, The EUROfusion tokamak exploitation\n  team, and the MAST-U team","authorsParsed":[["Kool","B.",""],["Verhaegh","K.",""],["Derks","G. L.",""],["Wijkamp","T. A.",""],["Lonigro","N.",""],["Doyle","R.",""],["McArdle","G.",""],["Vincent","C.",""],["Lovell","J.",""],["Federici","F.",""],["Henderson","S. S.",""],["Osawa","R. T.",""],["Brida","D.",""],["Reimerdes","H.",""],["van Berkel","M.",""],["team","The EUROfusion tokamak exploitation",""],["team","the MAST-U",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 16:00:11 GMT"}],"updateDate":"2024-07-11","timestamp":1720627211000,"abstract":"  Nuclear fusion could offer clean, abundant energy. However, managing the\nimmense power exhausted from the core fusion plasma towards the divertor\nremains a major challenge. This is compounded in emerging compact reactor\ndesigns which promise more cost-effective pathways towards commercial fusion\nenergy. Alternative divertor configurations (ADCs) are a potential solution to\nthis challenge. In this work, we demonstrate exhaust control in ADCs for the\nfirst time, on MAST-U. We employ a novel diagnostic strategy for the neutral\ngas buffer which shields the target. Our work shows that ADCs tackle key risks\nand uncertainties in realising fusion energy: 1) an enlarged operating window\nwhich 2) improves exhaust control through the absorption of transients which\ncan remove the neutral shield and damage the divertor, 3) isolation of each\ndivertor from other reactor regions, enabling combined control. This showcases\nreal-world benefits of alternative divertors for effective heat load management\nand control in reactors.\n","subjects":["Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}