{"id":"2407.05859","title":"Level one automorphic representations of an anisotropic exceptional\n  group over $\\mathbb{Q}$ of type $\\mathrm{F}_{4}$","authors":"Yi Shan","authorsParsed":[["Shan","Yi",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 12:22:35 GMT"}],"updateDate":"2024-07-09","timestamp":1720441355000,"abstract":"  Up to isomorphism, there is a unique connected semisimple algebraic group\nover $\\mathbb{Q}$ of Lie type $\\mathrm{F}_{4}$, with compact real points and\nsplit over $\\mathbb{Q}_{p}$ for all primes $p$. Let $\\mathbf{F}_{4}$ be such a\ngroup. In this paper, we study the level one automorphic representations of\n$\\mathbf{F}_{4}$ in the spirit of the work of Chenevier, Renard, and Ta\\\"ibi.\nFirst, we give an explicit formula for the number of these representations\nhaving any given archimedean component. For this, we study the automorphism\ngroup of the two definite exceptional Jordan algebras of rank $27$ over\n$\\mathbb{Z}$ studied by Gross, as well as the dimension of the invariants of\nthese groups in all irreducible representations of\n$\\mathbf{F}_{4}(\\mathbb{R})$. Then, assuming standard conjectures by Arthur and\nLanglands for $\\mathbf{F}_{4}$, we refine this counting by studying the\ncontribution of the representations whose global Arthur parameter has any\npossible image (or \"Sato-Tate group\"). This includes a detailed description of\nall those images, as well as precise statements for the Arthur's multiplicity\nformula in each case. As a consequence, we obtain a conjectural but explicit\nformula for the number of algebraic, cuspidal, level one automorphic\nrepresentation of $\\mathrm{GL}_{26}$ over $\\mathbb{Q}$ with Sato-Tate group\n$\\mathbf{F}_{4}(\\mathbb{R})$ of any given weight (assumed\n\"$\\mathrm{F}_{4}$-regular\"). The first example of such representations occurs\nin motivic weight $36$.\n","subjects":["Mathematics/Number Theory","Mathematics/Representation Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}