{"id":"2407.17391","title":"Tutorial: Object as a Service (OaaS) Serverless Cloud Computing Paradigm","authors":"Pawissanutt Lertpongrujikorn, Mohsen Amini Salehi","authorsParsed":[["Lertpongrujikorn","Pawissanutt",""],["Salehi","Mohsen Amini",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 16:14:38 GMT"}],"updateDate":"2024-07-25","timestamp":1721837678000,"abstract":"  While the first generation of cloud computing systems mitigated the job of\nsystem administrators, the next generation of cloud computing systems is\nemerging to mitigate the burden for cloud developers -- facilitating the\ndevelopment of cloud-native applications. This paradigm shift is primarily\nhappening by offering higher-level serverless abstractions, such as Function as\na Service (FaaS). Although FaaS has successfully abstracted developers from the\ncloud resource management details, it falls short in abstracting the management\nof both data (i.e., state) and the non-functional aspects, such as Quality of\nService (QoS) requirements. The lack of such abstractions implies developer\nintervention and is counterproductive to the objective of mitigating the burden\nof cloud-native application development. To further streamline cloud-native\napplication development, we present Object-as-a-Service (OaaS) -- a serverless\nparadigm that borrows the object-oriented programming concepts to encapsulate\napplication logic and data in addition to non-functional requirements into a\nsingle deployment package, thereby streamlining provider-agnostic cloud-native\napplication development. We realized the OaaS paradigm through the development\nof an open-source platform called Oparaca. In this tutorial, we will present\nthe concept and design of the OaaS paradigm and its implementation -- the\nOparaca platform. Then, we give a tutorial on developing and deploying the\napplication on the Oparaca platform and discuss its benefits and its optimal\nconfigurations to avoid potential overheads.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}