{"id":"2407.10062","title":"SpikeGS: 3D Gaussian Splatting from Spike Streams with High-Speed Camera\n  Motion","authors":"Jiyuan Zhang, Kang Chen, Shiyan Chen, Yajing Zheng, Tiejun Huang,\n  Zhaofei Yu","authorsParsed":[["Zhang","Jiyuan",""],["Chen","Kang",""],["Chen","Shiyan",""],["Zheng","Yajing",""],["Huang","Tiejun",""],["Yu","Zhaofei",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 03:19:30 GMT"}],"updateDate":"2024-07-16","timestamp":1720927170000,"abstract":"  Novel View Synthesis plays a crucial role by generating new 2D renderings\nfrom multi-view images of 3D scenes. However, capturing high-speed scenes with\nconventional cameras often leads to motion blur, hindering the effectiveness of\n3D reconstruction. To address this challenge, high-frame-rate dense 3D\nreconstruction emerges as a vital technique, enabling detailed and accurate\nmodeling of real-world objects or scenes in various fields, including Virtual\nReality or embodied AI. Spike cameras, a novel type of neuromorphic sensor,\ncontinuously record scenes with an ultra-high temporal resolution, showing\npotential for accurate 3D reconstruction. Despite their promise, existing\napproaches, such as applying Neural Radiance Fields (NeRF) to spike cameras,\nencounter challenges due to the time-consuming rendering process. To address\nthis issue, we make the first attempt to introduce the 3D Gaussian Splatting\n(3DGS) into spike cameras in high-speed capture, providing 3DGS as dense and\ncontinuous clues of views, then constructing SpikeGS. Specifically, to train\nSpikeGS, we establish computational equations between the rendering process of\n3DGS and the processes of instantaneous imaging and exposing-like imaging of\nthe continuous spike stream. Besides, we build a very lightweight but effective\nmapping process from spikes to instant images to support training. Furthermore,\nwe introduced a new spike-based 3D rendering dataset for validation. Extensive\nexperiments have demonstrated our method possesses the high quality of novel\nview rendering, proving the tremendous potential of spike cameras in modeling\n3D scenes.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}