{"id":"2407.21624","title":"Grid-Based Decompositions for Spatial Data under Local Differential\n  Privacy","authors":"Berkay Kemal Balioglu, Alireza Khodaie, Ameer Taweel, Mehmet Emre\n  Gursoy","authorsParsed":[["Balioglu","Berkay Kemal",""],["Khodaie","Alireza",""],["Taweel","Ameer",""],["Gursoy","Mehmet Emre",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:17:44 GMT"}],"updateDate":"2024-08-01","timestamp":1722435464000,"abstract":"  Local differential privacy (LDP) has recently emerged as a popular privacy\nstandard. With the growing popularity of LDP, several recent works have applied\nLDP to spatial data, and grid-based decompositions have been a common building\nblock in the collection and analysis of spatial data under DP and LDP. In this\npaper, we study three grid-based decomposition methods for spatial data under\nLDP: Uniform Grid (UG), PrivAG, and AAG. UG is a static approach that consists\nof equal-sized cells. To enable data-dependent decomposition, PrivAG was\nproposed by Yang et al. as the most recent adaptive grid method. To advance the\nstate-of-the-art in adaptive grids, in this paper we propose the Advanced\nAdaptive Grid (AAG) method. For each grid cell, following the intuition that\nthe cell's intra-cell density distribution will be affected by its neighbors,\nAAG performs uneven cell divisions depending on the neighboring cells'\ndensities. We experimentally compare UG, PrivAG, and AAG using three real-world\nlocation datasets, varying privacy budgets, and query sizes. Results show that\nAAG provides higher utility than PrivAG, demonstrating the superiority of our\nproposed approach. Furthermore, UG's performance is heavily dependent on the\nchoice of grid size. When the grid size is chosen optimally in UG, AAG still\nbeats UG for small queries, but UG beats AAG for large (coarse-grained)\nqueries.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nPQ7I5dCRqPn982a-iwu50MtfVE7FudEjJwAQ1fyYXk","pdfSize":"837995","objectId":"0x911c1adccf5c65fbfa260b07e9aee83cce175103a029fedcf951f44cf2d3f2b7","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
