{"id":"2407.17149","title":"SKAO Observation Execution Tool: Designing for concurrent, responsive\n  observations","authors":"Viivi Pursiainen, Stewart J. Williams, Thaddeus Kenny, Elizabeth S.\n  Bartlett, Andrew D. Biggs, Brendan McCollam, Danilo Acosta, Sean Ellis,\n  Rupert Lung","authorsParsed":[["Pursiainen","Viivi",""],["Williams","Stewart J.",""],["Kenny","Thaddeus",""],["Bartlett","Elizabeth S.",""],["Biggs","Andrew D.",""],["McCollam","Brendan",""],["Acosta","Danilo",""],["Ellis","Sean",""],["Lung","Rupert",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 10:45:06 GMT"}],"updateDate":"2024-07-25","timestamp":1721817906000,"abstract":"  The SKA Observatory, currently in the construction phase, will have two of\nthe world's largest radio telescopes when completed in 2028. The scale of the\nproject introduces unique challenges for the telescope software design and\nimplementation at all levels, from user interfacing software down to the\nlower-level control of individual telescope elements. The Observation Execution\nTool (OET) is part of the Observation Science Operations (OSO) suite of\napplications and is responsible for orchestrating the highest level of\ntelescope control through the execution of telescope control scripts. One of\nthe main challenges for the OET is creating a design that can robustly run\nconcurrent observations on multiple subarrays while remaining responsive to the\nuser. The Scaled Agile Framework (SAFe) development process followed by the SKA\nproject also means the software should be allow to iterative implementation and\neasily accommodate new and changing requirements. This paper concentrates on\nthe design decisions and challenges in the development of the OET, how we have\nsolved some of the specific technical problems and details on how we remain\nflexible for future requirements.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1h839Rvrn7h9NmjpAU5gFiiZWFF5WebbfwIAxB-R-ww","pdfSize":"241131"}
