{"id":"2407.17687","title":"A Crowding Distance That Provably Solves the Difficulties of the NSGA-II\n  in Many-Objective Optimization","authors":"Weijie Zheng, Yao Gao, Benjamin Doerr","authorsParsed":[["Zheng","Weijie",""],["Gao","Yao",""],["Doerr","Benjamin",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 01:09:58 GMT"},{"version":"v2","created":"Sun, 18 Aug 2024 09:35:27 GMT"}],"updateDate":"2024-08-20","timestamp":1721869798000,"abstract":"  Recent theoretical works have shown that the NSGA-II can have enormous\ndifficulties to solve problems with more than two objectives. In contrast,\nalgorithms like the NSGA-III or SMS-EMOA, differing from the NSGA-II only in\nthe secondary selection criterion, provably perform well in these situations.\n  To remedy this shortcoming of the NSGA-II, but at the same time keep the\nadvantages of the widely accepted crowding distance, we use the insights of\nthese previous work to define a variant of the crowding distance, called\ntruthful crowding distance. Different from the classic crowding distance, it\nhas for any number of objectives the desirable property that a small crowding\ndistance value indicates that some other solution has a similar objective\nvector.\n  Building on this property, we conduct mathematical runtime analyses for the\nNSGA-II with truthful crowding distance. We show that this algorithm can solve\nthe many-objective versions of the OneMinMax, COCZ, LOTZ, and OJZJ$_k$ problems\nin the same (polynomial) asymptotic runtimes as the NSGA-III and the SMS-EMOA.\nThis contrasts the exponential lower bounds previously shown for the classic\nNSGA-II. For the bi-objective versions of these problems, our NSGA-II has a\nsimilar performance as the classic NSGA-II, gaining however from smaller\nadmissible population sizes. For the bi-objective OneMinMax problem, we also\nobserve a (minimally) better performance in approximating the Pareto front.\n  These results suggest that our truthful version of the NSGA-II has the same\ngood performance as the classic NSGA-II in two objectives, but can resolve the\ndrastic problems in more than two objectives.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}