{"id":"2407.08384","title":"Accurate Cooperative Localization Utilizing LiDAR-equipped Roadside\n  Infrastructure for Autonomous Driving","authors":"Yuze Jiang, Ehsan Javanmardi, Manabu Tsukada, Hiroshi Esaki","authorsParsed":[["Jiang","Yuze",""],["Javanmardi","Ehsan",""],["Tsukada","Manabu",""],["Esaki","Hiroshi",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 10:44:42 GMT"}],"updateDate":"2024-07-12","timestamp":1720694682000,"abstract":"  Recent advancements in LiDAR technology have significantly lowered costs and\nimproved both its precision and resolution, thereby solidifying its role as a\ncritical component in autonomous vehicle localization. Using sophisticated 3D\nregistration algorithms, LiDAR now facilitates vehicle localization with\ncentimeter-level accuracy. However, these high-precision techniques often face\nreliability challenges in environments devoid of identifiable map features. To\naddress this limitation, we propose a novel approach that utilizes road side\nunits (RSU) with vehicle-to-infrastructure (V2I) communications to assist\nvehicle self-localization. By using RSUs as stationary reference points and\nprocessing real-time LiDAR data, our method enhances localization accuracy\nthrough a cooperative localization framework. By placing RSUs in critical\nareas, our proposed method can improve the reliability and precision of vehicle\nlocalization when the traditional vehicle self-localization technique falls\nshort. Evaluation results in an end-to-end autonomous driving simulator AWSIM\nshow that the proposed method can improve localization accuracy by up to 80%\nunder vulnerable environments compared to traditional localization methods.\nAdditionally, our method also demonstrates robust resistance to network delays\nand packet loss in heterogeneous network environments.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"9d-jJeQe13ldlp6Mm8JZizmVja6I8975xFKsN0Dmlak","pdfSize":"4233471"}
