{"id":"2407.00887","title":"Portfolio optimisation: bridging the gap between theory and practice","authors":"Cristiano Arbex Valle","authorsParsed":[["Valle","Cristiano Arbex",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 01:14:15 GMT"}],"updateDate":"2024-07-02","timestamp":1719796455000,"abstract":"  Portfolio optimisation is widely acknowledged for its significance in\ninvestment decision-making. Yet, existing methodologies face several\nlimitations, among them converting optimal theoretical portfolios into real\ninvestment is not always straightforward. Several classes of exogenous\n(real-world) constraints have been proposed in literature with the intent of\nreducing the gap between theory and practice, which have worked to an extent.\n  In this paper, we propose an optimisation-based framework which attempts to\nfurther reduce this gap. We have the explicit intention of producing portfolios\nthat can be immediately converted into financial holdings. Our proposed\nframework is generic in the sense that it can be used in conjunction with any\nportfolio selection model, and consists of splitting the portfolio selection\nproblem into two-stages. The main motivation behind this approach is in\nenabling automated investing with minimal human intervention, and thus the\nframework was built in such a way that real-world market features can be\nincorporated with relative ease. Among the novel contributions of this paper,\nthis is the first work, to the best of our knowledge, to combine futures\ncontracts and equities in a single framework, and also the first to consider\nborrowing costs in short positions.\n  We present extensive computational results to illustrate the applicability of\nour approach and to evaluate its overall quality. Among these experiments, we\nobserved that alternatives from literature are susceptible to numerical errors,\nwhereas our approach effectively mitigates this issue.\n","subjects":["Quantitative Finance/Portfolio Management","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}