{"id":"2407.15303","title":"CORINOS II. JWST-MIRI detection of warm molecular gas from an embedded,\n  disk-bearing protostar","authors":"Colette Salyk, Yao-Lun Yang, Klaus M. Pontoppidan, Jennifer B.\n  Bergner, Yuki Okoda, Jaeyeong Kim, Neal J. Evans II, Ilsedore Cleeves, Ewine\n  F. van Dishoeck, Robin T. Garrod, Joel D. Green","authorsParsed":[["Salyk","Colette",""],["Yang","Yao-Lun",""],["Pontoppidan","Klaus M.",""],["Bergner","Jennifer B.",""],["Okoda","Yuki",""],["Kim","Jaeyeong",""],["Evans","Neal J.","II"],["Cleeves","Ilsedore",""],["van Dishoeck","Ewine F.",""],["Garrod","Robin T.",""],["Green","Joel D.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 00:07:17 GMT"},{"version":"v2","created":"Wed, 11 Sep 2024 18:10:50 GMT"}],"updateDate":"2024-09-13","timestamp":1721606837000,"abstract":"  We present James Webb Space Telescope (JWST) Mid-InfraRed Instrument (MIRI)\nobservations of warm CO and H$_2$O gas in emission toward the low-mass\nprotostar IRAS 15398-3359, observed as part of the CORINOS program. The CO is\ndetected via the rovibrational fundamental band and hot band near 5 $\\mu$m,\nwhereas the H$_2$O is detected in the rovibrational bending mode at 6-8 $\\mu$m.\nRotational analysis indicates that the CO originates in a hot reservoir of\n$1598\\pm118$ K, while the water is much cooler at $204\\pm 7$ K. Neither the CO\nnor the H$_2$O line images are significantly spatially extended, constraining\nthe emission to within $\\sim$40 au of the protostar. The compactness and high\ntemperature of the CO are consistent with an origin in the embedded\nprotostellar disk, or a compact disk wind. In contrast, the water must arise\nfrom a cooler region and requires a larger emitting area (compared to CO) to\nproduce the observed fluxes. The water may arise from a more extended part of\nthe disk, or from the inner portion of the outflow cavity. Thus, the origin of\nthe molecular emission observed with JWST remains ambiguous. Better constraints\non the overall extinction, comparison with realistic disk models, and future\nkinematically-resolved observations may all help to pinpoint the true emitting\nreservoirs.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}