{"id":"2407.10525","title":"Incentivizing Agents through Ratings","authors":"Peiran Xiao","authorsParsed":[["Xiao","Peiran",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 08:33:21 GMT"},{"version":"v2","created":"Sun, 21 Jul 2024 21:56:39 GMT"}],"updateDate":"2024-07-23","timestamp":1721032401000,"abstract":"  I study the optimal design of performance or product ratings to motivate\nagents' performance or investment in product quality. The principal designs a\nrating that maps their quality (performance) to possibly stochastic scores.\nAgents have private information about their abilities (cost of effort/quality)\nand choose their quality. The market observes the scores and offers a wage\nequal to the agent's expected quality [resp. ability].\n  I first show that an incentive-compatible interim wage function can be\ninduced by a rating (i.e., feasible) if and only if it is a mean-preserving\nspread of quality [resp. ability] in the quantile space. Thus, I reduce the\nprincipal's rating design problem to the design of a feasible interim wage.\nWhen restricted to deterministic ratings, the optimal rating design is\nequivalent to the optimal delegation with a participation constraint (Amador\nand Bagwell, 2022). Using optimal control theory, I provide necessary and\nsufficient conditions under which lower censorship, and particularly a simple\npass/fail test, are optimal within deterministic ratings. In particular, when\nthe principal elicits maximal effort (quality), lower censorship [resp.\npass/fail] is optimal if the density is unimodal [resp. increasing]. I also\nsolve for the optimal deterministic ratings beyond lower censorship for general\ndistributions and preferences. For general ratings, I provide sufficient\nconditions under which lower censorship remains optimal. In the\neffort-maximizing case, a pass/fail test remains optimal if the density is\nincreasing.\n","subjects":["Economics/Theoretical Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"D_ZL8N38eUi_M57Rg_nmiX8WUZx81cTpj5Y52yoLz74","pdfSize":"1776532"}
