{"id":"2407.14928","title":"Influencer: Empowering Everyday Users in Creating Promotional Posts via\n  AI-infused Exploration and Customization","authors":"Xuye Liu, Annie Sun, Pengcheng An, Tengfei Ma, Jian Zhao","authorsParsed":[["Liu","Xuye",""],["Sun","Annie",""],["An","Pengcheng",""],["Ma","Tengfei",""],["Zhao","Jian",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 16:27:49 GMT"}],"updateDate":"2024-07-23","timestamp":1721492869000,"abstract":"  Creating promotional posts on social platforms enables everyday users to\ndisseminate their creative outcomes, engage in community exchanges, or generate\nadditional income from micro-businesses. However, creating eye-catching posts\ncombining both original, appealing images and articulate, effective captions\ncan be rather challenging and time-consuming for everyday users who are mostly\ndesign novices. We propose Influen, an interactive tool to assist novice\ncreators in crafting high-quality promotional post designs, achieving quick\ndesign ideation and unencumbered content creation through AI. Within\nInfluencer, we contribute a multi-dimensional recommendation framework that\nallows users to intuitively generate new ideas through example-based image and\ncaption recommendation. Further, Influencer implements a holistic promotional\npost design system that supports context-aware image and caption exploration\nconsidering brand messages and user-specified design constraints, flexible\nfusion of various images and captions, and a mind-map-like layout for thinking\ntracking and post-recording. We evaluated Influencer with 12 design enthusiasts\nthrough an in-lab user study by comparing it to a baseline combining Google\nSearch + Figma. Quantitative and qualitative results demonstrate that\n\\sysname{} is effective in assisting design novices to generate ideas as well\nas creative and diverse promotional posts with user-friendly interaction.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}