{"id":"2407.21424","title":"Cost-Effective Hallucination Detection for LLMs","authors":"Simon Valentin, Jinmiao Fu, Gianluca Detommaso, Shaoyuan Xu, Giovanni\n  Zappella, Bryan Wang","authorsParsed":[["Valentin","Simon",""],["Fu","Jinmiao",""],["Detommaso","Gianluca",""],["Xu","Shaoyuan",""],["Zappella","Giovanni",""],["Wang","Bryan",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 08:19:06 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 11:58:55 GMT"}],"updateDate":"2024-08-12","timestamp":1722413946000,"abstract":"  Large language models (LLMs) can be prone to hallucinations - generating\nunreliable outputs that are unfaithful to their inputs, external facts or\ninternally inconsistent. In this work, we address several challenges for\npost-hoc hallucination detection in production settings. Our pipeline for\nhallucination detection entails: first, producing a confidence score\nrepresenting the likelihood that a generated answer is a hallucination; second,\ncalibrating the score conditional on attributes of the inputs and candidate\nresponse; finally, performing detection by thresholding the calibrated score.\nWe benchmark a variety of state-of-the-art scoring methods on different\ndatasets, encompassing question answering, fact checking, and summarization\ntasks. We employ diverse LLMs to ensure a comprehensive assessment of\nperformance. We show that calibrating individual scoring methods is critical\nfor ensuring risk-aware downstream decision making. Based on findings that no\nindividual score performs best in all situations, we propose a multi-scoring\nframework, which combines different scores and achieves top performance across\nall datasets. We further introduce cost-effective multi-scoring, which can\nmatch or even outperform more expensive detection methods, while significantly\nreducing computational overhead.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}