{"id":"2407.03414","title":"Direct Estimation of the Density of States for Fermionic Systems","authors":"Matthew L. Goh, B\\'alint Koczor","authorsParsed":[["Goh","Matthew L.",""],["Koczor","Bálint",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:00:05 GMT"}],"updateDate":"2024-07-08","timestamp":1720029605000,"abstract":"  Simulating time evolution is one of the most natural applications of quantum\ncomputers and is thus one of the most promising prospects for achieving\npractical quantum advantage. Here we develop quantum algorithms to extract\nthermodynamic properties by estimating the density of states (DOS), a central\nobject in quantum statistical mechanics. We introduce key innovations that\nsignificantly improve the practicality and extend the generality of previous\ntechniques. First, our approach allows one to estimate the DOS for a specific\nsubspace of the full Hilbert space. This is crucial for fermionic systems,\nsince fermion-to-qubit mappings partition the full Hilbert space into subspaces\nof fixed number, on which both canonical and grand canonical ensemble\nproperties depend. Second, in our approach, by time evolving very simple,\nrandom initial states (e.g. random computational basis states), we can exactly\nrecover the DOS on average. Third, due to circuit-depth limitations, we only\nreconstruct the DOS up to a convolution with a Gaussian window - thus all\nimperfections that shift the energy levels by less than the width of the\nconvolution window will not significantly affect the estimated DOS. For these\nreasons we find the approach is a promising candidate for early quantum\nadvantage as even short-time, noisy dynamics yield a semi-quantitative\nreconstruction of the DOS (convolution with a broad Gaussian window), while\nearly fault tolerant devices will likely enable higher resolution DOS\nreconstruction through longer time evolution. We demonstrate the practicality\nof our approach in representative Fermi-Hubbard and spin models and find that\nour approach is highly robust to algorithmic errors in the time evolution and\nto gate noise. We show that our approach is compatible with NISQ-friendly\nvariational methods, introducing a new technique for variational time evolution\nin noisy DOS computations.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}