{"id":"2407.15811","title":"Stretching Each Dollar: Diffusion Training from Scratch on a\n  Micro-Budget","authors":"Vikash Sehwag, Xianghao Kong, Jingtao Li, Michael Spranger, Lingjuan\n  Lyu","authorsParsed":[["Sehwag","Vikash",""],["Kong","Xianghao",""],["Li","Jingtao",""],["Spranger","Michael",""],["Lyu","Lingjuan",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 17:23:28 GMT"}],"updateDate":"2024-07-23","timestamp":1721669008000,"abstract":"  As scaling laws in generative AI push performance, they also simultaneously\nconcentrate the development of these models among actors with large\ncomputational resources. With a focus on text-to-image (T2I) generative models,\nwe aim to address this bottleneck by demonstrating very low-cost training of\nlarge-scale T2I diffusion transformer models. As the computational cost of\ntransformers increases with the number of patches in each image, we propose to\nrandomly mask up to 75% of the image patches during training. We propose a\ndeferred masking strategy that preprocesses all patches using a patch-mixer\nbefore masking, thus significantly reducing the performance degradation with\nmasking, making it superior to model downscaling in reducing computational\ncost. We also incorporate the latest improvements in transformer architecture,\nsuch as the use of mixture-of-experts layers, to improve performance and\nfurther identify the critical benefit of using synthetic images in micro-budget\ntraining. Finally, using only 37M publicly available real and synthetic images,\nwe train a 1.16 billion parameter sparse transformer with only \\$1,890\neconomical cost and achieve a 12.7 FID in zero-shot generation on the COCO\ndataset. Notably, our model achieves competitive FID and high-quality\ngenerations while incurring 118$\\times$ lower cost than stable diffusion models\nand 14$\\times$ lower cost than the current state-of-the-art approach that costs\n\\$28,400. We aim to release our end-to-end training pipeline to further\ndemocratize the training of large-scale diffusion models on micro-budgets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"i6CBRJ8GM0xaodA_UOVgedkTFUvGcvWdtvUjHC8jMnI","pdfSize":"29877808","objectId":"0xd8a967aaf07a63ec829404c7cc1f15da060d34b8fe75e8d615a3fab148ab3633","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
