{"id":"2407.05879","title":"Learning With Generalised Card Representations for \"Magic: The\n  Gathering\"","authors":"Timo Bertram, Johannes F\\\"urnkranz, Martin M\\\"uller","authorsParsed":[["Bertram","Timo",""],["Fürnkranz","Johannes",""],["Müller","Martin",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 12:42:44 GMT"}],"updateDate":"2024-07-15","timestamp":1720442564000,"abstract":"  A defining feature of collectable card games is the deck building process\nprior to actual gameplay, in which players form their decks according to some\nrestrictions. Learning to build decks is difficult for players and models alike\ndue to the large card variety and highly complex semantics, as well as\nrequiring meaningful card and deck representations when aiming to utilise AI.\nIn addition, regular releases of new card sets lead to unforeseeable\nfluctuations in the available card pool, thus affecting possible deck\nconfigurations and requiring continuous updates. Previous Game AI approaches to\nbuilding decks have often been limited to fixed sets of possible cards, which\ngreatly limits their utility in practice. In this work, we explore possible\ncard representations that generalise to unseen cards, thus greatly extending\nthe real-world utility of AI-based deck building for the game \"Magic: The\nGathering\".We study such representations based on numerical, nominal, and\ntext-based features of cards, card images, and meta information about card\nusage from third-party services. Our results show that while the particular\nchoice of generalised input representation has little effect on learning to\npredict human card selections among known cards, the performance on new, unseen\ncards can be greatly improved. Our generalised model is able to predict 55\\% of\nhuman choices on completely unseen cards, thus showing a deep understanding of\ncard quality and strategy.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}