{"id":"2407.01711","title":"Harmonizing Microstructures and Enhancing Mechanical Resilience: Novel\n  Powder Metallurgy Approach for Zn-Mg Alloys","authors":"Anna Boukalova, Jiri Kubasek, David Necas, Peter Minarik, Crtomir\n  Donik, Drahomir Dvorsky, Dalibor Vojtech, Alena Michalcova, Matjaz Godec,\n  Irena Paulin","authorsParsed":[["Boukalova","Anna",""],["Kubasek","Jiri",""],["Necas","David",""],["Minarik","Peter",""],["Donik","Crtomir",""],["Dvorsky","Drahomir",""],["Vojtech","Dalibor",""],["Michalcova","Alena",""],["Godec","Matjaz",""],["Paulin","Irena",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:39:29 GMT"}],"updateDate":"2024-07-03","timestamp":1719859169000,"abstract":"  Zinc alloys are recognised for their excellent biocompatibility and\nfavourable corrosion rates, making them suitable for bioabsorbable implants.\nHowever, their mechanical properties necessitate improvement to fulfil the\nrigorous requirements of biomedical applications. This research focuses on\nengineering pseudo-harmonic structures within zinc alloys through a\ncomprehensive method combining mechanical alloying, spark plasma sintering, and\nhot extrusion techniques. This fabrication process results in a composite\nmaterial characterised by a soft core surrounded by a continuous,\nthree-dimensional, ultrafine-grained hard shell. The experiment involved\nblending pure zinc with Zn-1Mg alloy powder, leading to the formation of both\nductile zinc and fine-grained Zn-1Mg regions. While the Mg2Zn11 intermetallic\nphase was found to enhance the alloy's mechanical strength, the presence of\noxide shells adversely affected the material's properties. The elimination of\nthese shells via hot extrusion markedly improved the alloy's tensile strength,\nreaching an average value of tensile strength of 333 MPa. This study provides\nsignificant insights into the material engineering of zinc-based alloys for\nbiodegradable implant applications, demonstrating a viable approach to\noptimising their mechanical performance.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4PM9eChsTuZI8LGZJTDjngXbhSMq_4_a8oI-mOVfPSs","pdfSize":"3101098"}
