{"id":"2407.05277","title":"Einstein from Noise: Statistical Analysis","authors":"Amnon Balanov, Wasim Huleihel, and Tamir Bendory","authorsParsed":[["Balanov","Amnon",""],["Huleihel","Wasim",""],["Bendory","Tamir",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 06:21:28 GMT"}],"updateDate":"2024-07-09","timestamp":1720333288000,"abstract":"  ``Einstein from noise\" (EfN) is a prominent example of the model bias\nphenomenon: systematic errors in the statistical model that lead to erroneous\nbut consistent estimates. In the EfN experiment, one falsely believes that a\nset of observations contains noisy, shifted copies of a template signal (e.g.,\nan Einstein image), whereas in reality, it contains only pure noise\nobservations. To estimate the signal, the observations are first aligned with\nthe template using cross-correlation, and then averaged. Although the\nobservations contain nothing but noise, it was recognized early on that this\nprocess produces a signal that resembles the template signal! This pitfall was\nat the heart of a central scientific controversy about validation techniques in\nstructural biology.\n  This paper provides a comprehensive statistical analysis of the EfN\nphenomenon above. We show that the Fourier phases of the EfN estimator (namely,\nthe average of the aligned noise observations) converge to the Fourier phases\nof the template signal, explaining the observed structural similarity.\nAdditionally, we prove that the convergence rate is inversely proportional to\nthe number of noise observations and, in the high-dimensional regime, to the\nFourier magnitudes of the template signal. Moreover, in the high-dimensional\nregime, the Fourier magnitudes converge to a scaled version of the template\nsignal's Fourier magnitudes. This work not only deepens the theoretical\nunderstanding of the EfN phenomenon but also highlights potential pitfalls in\ntemplate matching techniques and emphasizes the need for careful interpretation\nof noisy observations across disciplines in engineering, statistics, physics,\nand biology.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}