{"id":"2407.09975","title":"The GPT Surprise: Offering Large Language Model Chat in a Massive Coding\n  Class Reduced Engagement but Increased Adopters Exam Performances","authors":"Allen Nie, Yash Chandak, Miroslav Suzara, Malika Ali, Juliette\n  Woodrow, Matt Peng, Mehran Sahami, Emma Brunskill, Chris Piech","authorsParsed":[["Nie","Allen",""],["Chandak","Yash",""],["Suzara","Miroslav",""],["Ali","Malika",""],["Woodrow","Juliette",""],["Peng","Matt",""],["Sahami","Mehran",""],["Brunskill","Emma",""],["Piech","Chris",""]],"versions":[{"version":"v1","created":"Thu, 25 Apr 2024 15:39:22 GMT"}],"updateDate":"2024-07-16","timestamp":1714059562000,"abstract":"  Large language models (LLMs) are quickly being adopted in a wide range of\nlearning experiences, especially via ubiquitous and broadly accessible chat\ninterfaces like ChatGPT and Copilot. This type of interface is readily\navailable to students and teachers around the world, yet relatively little\nresearch has been done to assess the impact of such generic tools on student\nlearning. Coding education is an interesting test case, both because LLMs have\nstrong performance on coding tasks, and because LLM-powered support tools are\nrapidly becoming part of the workflow of professional software engineers. To\nhelp understand the impact of generic LLM use on coding education, we conducted\na large-scale randomized control trial with 5,831 students from 146 countries\nin an online coding class in which we provided some students with access to a\nchat interface with GPT-4. We estimate positive benefits on exam performance\nfor adopters, the students who used the tool, but over all students, the\nadvertisement of GPT-4 led to a significant average decrease in exam\nparticipation. We observe similar decreases in other forms of course\nengagement. However, this decrease is modulated by the student's country of\norigin. Offering access to LLMs to students from low human development index\ncountries increased their exam participation rate on average. Our results\nsuggest there may be promising benefits to using LLMs in an introductory coding\nclass, but also potential harms for engagement, which makes their longer term\nimpact on student success unclear. Our work highlights the need for additional\ninvestigations to help understand the potential impact of future adoption and\nintegration of LLMs into classrooms.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}