{"id":"2407.14438","title":"Improving Observed Decisions Quality using Inverse Optimization: A\n  Radiation Therapy Treatment Planning Application","authors":"Farzin Ahmadi, Todd R. McNutt, Kimia Ghobadi","authorsParsed":[["Ahmadi","Farzin",""],["McNutt","Todd R.",""],["Ghobadi","Kimia",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 16:10:00 GMT"}],"updateDate":"2024-07-22","timestamp":1721405400000,"abstract":"  In many applied optimization settings, parameters that define the constraints\nmay not guarantee the best possible solution, and superior solutions might\nexist that are infeasible for the given parameter values. Removing such\nconstraints, re-optimizing, and evaluating the new solution may be\ninsufficient, as the optimizer's preferences in selecting the existing\nsolutions might be lost. To address this issue, we present an inverse\noptimization-based model that takes an observed solution as input and aims to\nimprove upon it by projecting onto desired hyperplanes or expanding the\nfeasible set while balancing the distance to the observed decision to preserve\nthe optimizer's preferences.\n  We demonstrate the applicability of the model in the context of radiation\ntherapy treatment planning, an essential component of cancer treatment.\nRadiation therapy treatment planning is typically guided by expert-driven\nguidelines that define the optimization problem but remain mostly general. Our\nmodel provides an automated framework that learns new plans from available\nplans based on given clinical criteria, optimizing the desired effect without\ncompromising the remaining constraints.\n  The proposed approach is applied to a cohort of four prostate cancer\npatients, and the results demonstrate improvements in dose-volume histograms\nwhile maintaining comparable target coverage to clinically acceptable plans. By\noptimizing the parameters of the treatment planning problem and exploring the\nPareto frontier, our methodology uncovers previously unattainable solutions\nthat enhance organ-at-risk sparing without sacrificing target coverage. The\nframework's ability to handle multiple organs-at-risk and various dose-volume\nconstraints highlights its flexibility and potential for application to diverse\nradiation therapy treatment planning scenarios.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}