{"id":"2407.08566","title":"The XYZ ruby code: Making a case for a three-colored graphical calculus\n  for quantum error correction in spacetime","authors":"Julio C. Magdalena de la Fuente, Josias Old, Alex Townsend-Teague,\n  Manuel Rispler, Jens Eisert, Markus M\\\"uller","authorsParsed":[["de la Fuente","Julio C. Magdalena",""],["Old","Josias",""],["Townsend-Teague","Alex",""],["Rispler","Manuel",""],["Eisert","Jens",""],["Müller","Markus",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:56:26 GMT"}],"updateDate":"2024-07-12","timestamp":1720709786000,"abstract":"  Analyzing and developing new quantum error-correcting schemes is one of the\nmost prominent tasks in quantum computing research. In such efforts,\nintroducing time dynamics explicitly in both analysis and design of\nerror-correcting protocols constitutes an important cornerstone. In this work,\nwe present a graphical formalism based on tensor networks to capture the\nlogical action and error-correcting capabilities of any Clifford circuit with\nPauli measurements. We showcase the formalism on new Floquet codes derived from\ntopological subsystem codes, which we call XYZ ruby codes. Based on the\nprojective symmetries of the building blocks of the tensor network we develop a\nframework of Pauli flows. Pauli flows allow for a graphical understanding of\nall quantities entering an error correction analysis of a circuit, including\ndifferent types of QEC experiments, such as memory and stability experiments.\nWe lay out how to derive a well-defined decoding problem from the tensor\nnetwork representation of a protocol and its Pauli flows alone, independent of\nany stabilizer code or fixed circuit. Importantly, this framework applies to\nall Clifford protocols and encompasses both measurement- and circuit-based\napproaches to fault tolerance. We apply our method to our new family of\ndynamical codes which are in the same topological phase as the 2+1d color code,\nmaking them a promising candidate for low-overhead logical gates. In contrast\nto its static counterpart, the dynamical protocol applies a Z3 automorphism to\nthe logical Pauli group every three timesteps. We highlight some of its\ntopological properties and comment on the anyon physics behind a planar layout.\nLastly, we benchmark the performance of the XYZ ruby code on a torus by\nperforming both memory and stability experiments and find competitive\ncircuit-level noise thresholds of 0.18%, comparable with other Floquet codes\nand 2+1d color codes.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Strongly Correlated Electrons","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"wuXnci3P8Ywj7Vh2QvLb0OuX-RoeIRGfMBzF7LiTU2M","pdfSize":"9945059"}
