{"id":"2407.13054","title":"Comprehensive Review and Empirical Evaluation of Causal Discovery\n  Algorithms for Numerical Data","authors":"Wenjin Niu, Zijun Gao, Liyan Song, Lingbo Li","authorsParsed":[["Niu","Wenjin",""],["Gao","Zijun",""],["Song","Liyan",""],["Li","Lingbo",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 23:47:05 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 13:13:03 GMT"}],"updateDate":"2024-09-05","timestamp":1721260025000,"abstract":"  Causal analysis has become an essential component in understanding the\nunderlying causes of phenomena across various fields. Despite its significance,\nexisting literature on causal discovery algorithms is fragmented, with\ninconsistent methodologies, i.e., there is no universal classification standard\nfor existing methods, and a lack of comprehensive evaluations, i.e., data\ncharacteristics are often ignored to be jointly analyzed when benchmarking\nalgorithms. This study addresses these gaps by conducting an exhaustive review\nand empirical evaluation for causal discovery methods on numerical data, aiming\nto provide a clearer and more structured understanding of the field. Our\nresearch begins with a comprehensive literature review spanning over two\ndecades, analyzing over 200 academic articles and identifying more than 40\nrepresentative algorithms. This extensive analysis leads to the development of\na structured taxonomy tailored to the complexities of causal discovery,\ncategorizing methods into six main types. To address the lack of comprehensive\nevaluations, our study conducts an extensive empirical assessment of 29 causal\ndiscovery algorithms on multiple synthetic and real-world datasets. We\ncategorize synthetic datasets based on size, linearity, and noise distribution,\nemploying five evaluation metrics, and summarize the top-3 algorithm\nrecommendations, providing guidelines for users in various data scenarios. Our\nresults highlight a significant impact of dataset characteristics on algorithm\nperformance. Moreover, a metadata extraction strategy with an accuracy\nexceeding 80% is developed to assist users in algorithm selection on unknown\ndatasets. Based on these insights, we offer professional and practical\nguidelines to help users choose the most suitable causal discovery methods for\ntheir specific dataset.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WMIWDCwKnbMV2MwhM7eLTtlp288vpwq3U5iT2HE-GDQ","pdfSize":"6484025"}
