{"id":"2407.09966","title":"Optimizing ROI Benefits Vehicle ReID in ITS","authors":"Mei Qiu, Lauren Ann Christopher, Lingxi Li, Stanley Chien, Yaobin Chen","authorsParsed":[["Qiu","Mei",""],["Christopher","Lauren Ann",""],["Li","Lingxi",""],["Chien","Stanley",""],["Chen","Yaobin",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 18:15:06 GMT"}],"updateDate":"2024-07-16","timestamp":1720894506000,"abstract":"  Vehicle re-identification (ReID) is a computer vision task that matches the\nsame vehicle across different cameras or viewpoints in a surveillance system.\nThis is crucial for Intelligent Transportation Systems (ITS), where the\neffectiveness is influenced by the regions from which vehicle images are\ncropped. This study explores whether optimal vehicle detection regions, guided\nby detection confidence scores, can enhance feature matching and ReID tasks.\nUsing our framework with multiple Regions of Interest (ROIs) and lane-wise\nvehicle counts, we employed YOLOv8 for detection and DeepSORT for tracking\nacross twelve Indiana Highway videos, including two pairs of videos from\nnon-overlapping cameras. Tracked vehicle images were cropped from inside and\noutside the ROIs at five-frame intervals. Features were extracted using\npre-trained models: ResNet50, ResNeXt50, Vision Transformer, and\nSwin-Transformer. Feature consistency was assessed through cosine similarity,\ninformation entropy, and clustering variance. Results showed that features from\nimages cropped inside ROIs had higher mean cosine similarity values compared to\nthose involving one image inside and one outside the ROIs. The most significant\ndifference was observed during night conditions (0.7842 inside vs. 0.5 outside\nthe ROI with Swin-Transformer) and in cross-camera scenarios (0.75\ninside-inside vs. 0.52 inside-outside the ROI with Vision Transformer).\nInformation entropy and clustering variance further supported that features in\nROIs are more consistent. These findings suggest that strategically selected\nROIs can enhance tracking performance and ReID accuracy in ITS.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}