{"id":"2407.06181","title":"Left-Linear Rewriting in Adhesive Categories","authors":"Paolo Baldan, Davide Castelnovo, Andrea Corradini, Fabio Gadducci","authorsParsed":[["Baldan","Paolo",""],["Castelnovo","Davide",""],["Corradini","Andrea",""],["Gadducci","Fabio",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:54:43 GMT"}],"updateDate":"2024-07-09","timestamp":1720461283000,"abstract":"  When can two sequential steps performed by a computing device be considered\n(causally) independent? This is a relevant question for concurrent and\ndistributed systems, since independence means that they could be executed in\nany order, and potentially in parallel. Equivalences identifying rewriting\nsequences which differ only for independent steps are at the core of the theory\nof concurrency of many formalisms. We investigate the issue in the context of\nthe double pushout approach to rewriting in the general setting of adhesive\ncategories. While a consolidated theory exists for linear rules,which can\nconsume, preserve and generate entities, this paper focuses on left-linear\nrules which may also \"merge\" parts of the state. This is an apparently minimal,\nyet technically hard enhancement,since a standard characterisation of\nindependence that - in the linear case - allows one to derive a number of\nproperties, essential in the development of a theory of concurrency, no longer\nholds. The paper performs an in-depth study of the notion of independence for\nleft-linear rules: it introduces a novel characterisation of independence,\nidentifies well-behaved classes of left-linear rewriting systems,and provides\nsome fundamental results including a Church-Rosser property and the existence\nof canonical equivalence proofs for concurrent computations. These results\nproperly extends the class of formalisms that can be modelled in the adhesive\nframework\n","subjects":["Computing Research Repository/Logic in Computer Science","Mathematics/Category Theory","Mathematics/Logic"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}