{"id":"2407.20408","title":"From chimeras to extensive chaos in networks of heterogeneous Kuramoto\n  oscillator populations","authors":"Pol Floriach, Jordi Garcia-Ojalvo, Pau Clusella","authorsParsed":[["Floriach","Pol",""],["Garcia-Ojalvo","Jordi",""],["Clusella","Pau",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 20:35:13 GMT"}],"updateDate":"2024-07-31","timestamp":1722285313000,"abstract":"  Networks of coupled oscillators can exhibit a wide range of complex dynamical\nbehavior, from complete synchronization to chimera and chaotic states. Here we\nanalyze the dynamics of networks of populations of heterogeneous mean-field\ncoupled Kuramoto-Sakaguchi oscillators and show that the instability that leads\nto chimera states in a simple two-population model also leads to extensive\nchaos in large networks of coupled populations. Formally, the system consists\nof a complex network of interacting oscillator populations whose mesoscopic\nbehavior evolves according to the Ott-Antonsen equations. By considering\nidentical parameters across populations, the system contains a manifold of\nhomogeneous solutions where all populations behave identically. Stability\nanalysis of these homogeneous states provided by the Master Stability Function\nshows that non-trivial dynamics might emerge on a wide region of the parameter\nspace for arbitrary network topologies. As examples, we first revisit the\ntwo-population case, and provide a complete bifurcation diagram. Then, we\ninvestigate the emergent dynamics in large ring and Erd\\\"os-R\\'enyi networks.\nIn both cases, transverse instabilities lead to extensive space-time chaos,\ni.e., irregular regimes whose complexity scales linearly with the system size.\nIn summary, our work provides a unified analytical framework to understand the\nemergent dynamics of networks of Kuramoto populations, from chimera states to\nrobust high-dimensional chaos.\n","subjects":["Nonlinear Sciences/Chaotic Dynamics","Mathematics/Dynamical Systems","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}