{"id":"2407.16554","title":"Coarse-to-Fine Proposal Refinement Framework for Audio Temporal Forgery\n  Detection and Localization","authors":"Junyan Wu, Wei Lu, Xiangyang Luo, Rui Yang, Qian Wang, Xiaochun Cao","authorsParsed":[["Wu","Junyan",""],["Lu","Wei",""],["Luo","Xiangyang",""],["Yang","Rui",""],["Wang","Qian",""],["Cao","Xiaochun",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 15:07:52 GMT"}],"updateDate":"2024-07-24","timestamp":1721747272000,"abstract":"  Recently, a novel form of audio partial forgery has posed challenges to its\nforensics, requiring advanced countermeasures to detect subtle forgery\nmanipulations within long-duration audio. However, existing countermeasures\nstill serve a classification purpose and fail to perform meaningful analysis of\nthe start and end timestamps of partial forgery segments. To address this\nchallenge, we introduce a novel coarse-to-fine proposal refinement framework\n(CFPRF) that incorporates a frame-level detection network (FDN) and a proposal\nrefinement network (PRN) for audio temporal forgery detection and localization.\nSpecifically, the FDN aims to mine informative inconsistency cues between real\nand fake frames to obtain discriminative features that are beneficial for\nroughly indicating forgery regions. The PRN is responsible for predicting\nconfidence scores and regression offsets to refine the coarse-grained proposals\nderived from the FDN. To learn robust discriminative features, we devise a\ndifference-aware feature learning (DAFL) module guided by contrastive\nrepresentation learning to enlarge the sensitive differences between different\nframes induced by minor manipulations. We further design a boundary-aware\nfeature enhancement (BAFE) module to capture the contextual information of\nmultiple transition boundaries and guide the interaction between boundary\ninformation and temporal features via a cross-attention mechanism. Extensive\nexperiments show that our CFPRF achieves state-of-the-art performance on\nvarious datasets, including LAV-DF, ASVS2019PS, and HAD.\n","subjects":["Computing Research Repository/Multimedia","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}