{"id":"2407.01648","title":"Aligning Target-Aware Molecule Diffusion Models with Exact Energy\n  Optimization","authors":"Siyi Gu, Minkai Xu, Alexander Powers, Weili Nie, Tomas Geffner,\n  Karsten Kreis, Jure Leskovec, Arash Vahdat, Stefano Ermon","authorsParsed":[["Gu","Siyi",""],["Xu","Minkai",""],["Powers","Alexander",""],["Nie","Weili",""],["Geffner","Tomas",""],["Kreis","Karsten",""],["Leskovec","Jure",""],["Vahdat","Arash",""],["Ermon","Stefano",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 06:10:29 GMT"}],"updateDate":"2024-07-03","timestamp":1719814229000,"abstract":"  Generating ligand molecules for specific protein targets, known as\nstructure-based drug design, is a fundamental problem in therapeutics\ndevelopment and biological discovery. Recently, target-aware generative models,\nespecially diffusion models, have shown great promise in modeling\nprotein-ligand interactions and generating candidate drugs. However, existing\nmodels primarily focus on learning the chemical distribution of all drug\ncandidates, which lacks effective steerability on the chemical quality of model\ngenerations. In this paper, we propose a novel and general alignment framework\nto align pretrained target diffusion models with preferred functional\nproperties, named AliDiff. AliDiff shifts the target-conditioned chemical\ndistribution towards regions with higher binding affinity and structural\nrationality, specified by user-defined reward functions, via the preference\noptimization approach. To avoid the overfitting problem in common preference\noptimization objectives, we further develop an improved Exact Energy Preference\nOptimization method to yield an exact and efficient alignment of the diffusion\nmodels, and provide the closed-form expression for the converged distribution.\nEmpirical studies on the CrossDocked2020 benchmark show that AliDiff can\ngenerate molecules with state-of-the-art binding energies with up to -7.07 Avg.\nVina Score, while maintaining strong molecular properties.\n","subjects":["Quantitative Biology/Biomolecules","Computing Research Repository/Machine Learning","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/"}