{"id":"2407.00383","title":"FANFOLD: Graph Normalizing Flows-driven Asymmetric Network for\n  Unsupervised Graph-Level Anomaly Detection","authors":"Rui Cao, Shijie Xue, Jindong Li, Qi Wang, Yi Chang","authorsParsed":[["Cao","Rui",""],["Xue","Shijie",""],["Li","Jindong",""],["Wang","Qi",""],["Chang","Yi",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 09:49:16 GMT"}],"updateDate":"2024-07-02","timestamp":1719654556000,"abstract":"  Unsupervised graph-level anomaly detection (UGAD) has attracted increasing\ninterest due to its widespread application. In recent studies, knowledge\ndistillation-based methods have been widely used in unsupervised anomaly\ndetection to improve model efficiency and generalization. However, the inherent\nsymmetry between the source (teacher) and target (student) networks typically\nresults in consistent outputs across both architectures, making it difficult to\ndistinguish abnormal graphs from normal graphs. Also, existing methods mainly\nrely on graph features to distinguish anomalies, which may be unstable with\ncomplex and diverse data and fail to capture the essence that differentiates\nnormal graphs from abnormal ones. In this work, we propose a Graph Normalizing\nFlows-driven Asymmetric Network For Unsupervised Graph-Level Anomaly Detection\n(FANFOLD in short). We introduce normalizing flows to unsupervised graph-level\nanomaly detection due to their successful application and superior quality in\nlearning the underlying distribution of samples. Specifically, we adopt the\nknowledge distillation technique and apply normalizing flows on the source\nnetwork, achieving the asymmetric network. In the training stage, FANFOLD\ntransforms the original distribution of normal graphs to a standard normal\ndistribution. During inference, FANFOLD computes the anomaly score using the\nsource-target loss to discriminate between normal and anomalous graphs. We\nconduct extensive experiments on 15 datasets of different fields with 9\nbaseline methods to validate the superiority of FANFOLD.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}