{"id":"2407.10022","title":"AtomAgents: Alloy design and discovery through physics-aware multi-modal\n  multi-agent artificial intelligence","authors":"Alireza Ghafarollahi and Markus J. Buehler","authorsParsed":[["Ghafarollahi","Alireza",""],["Buehler","Markus J.",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 22:46:02 GMT"}],"updateDate":"2024-07-16","timestamp":1720910762000,"abstract":"  The design of alloys is a multi-scale problem that requires a holistic\napproach that involves retrieving relevant knowledge, applying advanced\ncomputational methods, conducting experimental validations, and analyzing the\nresults, a process that is typically reserved for human experts. Machine\nlearning (ML) can help accelerate this process, for instance, through the use\nof deep surrogate models that connect structural features to material\nproperties, or vice versa. However, existing data-driven models often target\nspecific material objectives, offering limited flexibility to integrate\nout-of-domain knowledge and cannot adapt to new, unforeseen challenges. Here,\nwe overcome these limitations by leveraging the distinct capabilities of\nmultiple AI agents that collaborate autonomously within a dynamic environment\nto solve complex materials design tasks. The proposed physics-aware generative\nAI platform, AtomAgents, synergizes the intelligence of large language models\n(LLM) the dynamic collaboration among AI agents with expertise in various\ndomains, including knowledge retrieval, multi-modal data integration,\nphysics-based simulations, and comprehensive results analysis across modalities\nthat includes numerical data and images of physical simulation results. The\nconcerted effort of the multi-agent system allows for addressing complex\nmaterials design problems, as demonstrated by examples that include\nautonomously designing metallic alloys with enhanced properties compared to\ntheir pure counterparts. Our results enable accurate prediction of key\ncharacteristics across alloys and highlight the crucial role of solid solution\nalloying to steer the development of advanced metallic alloys. Our framework\nenhances the efficiency of complex multi-objective design tasks and opens new\navenues in fields such as biomedical materials engineering, renewable energy,\nand environmental sustainability.\n","subjects":["Computing Research Repository/Artificial Intelligence","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Condensed Matter/Statistical Mechanics","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"SeQ-J_Bf8ir0R7PP5eEysGdNXPsLv26miPmHGIqGkg4","pdfSize":"1506916","objectId":"0x38c72b1a3e8ad47ab028992bc865cb1a6fedefb3f66c42ed2a67186c4f94652d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
