{"id":"2407.05620","title":"Geometry of optimal control in chemical reaction networks","authors":"Yikuan Zhang, Qi Ouyang, Yuhai Tu","authorsParsed":[["Zhang","Yikuan",""],["Ouyang","Qi",""],["Tu","Yuhai",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 05:19:53 GMT"},{"version":"v2","created":"Tue, 9 Jul 2024 06:39:16 GMT"}],"updateDate":"2024-07-10","timestamp":1720415993000,"abstract":"  Although optimal control (OC) has been studied in stochastic thermodynamics\nfor systems with continuous state variables, less is known in systems with\ndiscrete state variables, such as Chemical Reaction Networks (CRNs). Here, we\ndevelop a general theoretical framework to study OC of CRNs for changing the\nsystem from an initial distribution of states to a final distribution with\nminimum dissipation. We derive a ``Kirchhoff's law\" for the probability current\nin the adiabatic limit, from which the optimal kinetic rates are determined\nanalytically for any given probability trajectory. By using the optimal rates,\nwe show that the total dissipation is determined by a $L_2$-distance measure in\nthe probability space and derive an analytical expression for the metric tensor\nthat depends on the probability distribution, network topology, and capacity of\neach link. Minimizing the total dissipation leads to the geodesic trajectory in\nthe probability space and the corresponding OC protocol is determined by the\nKirchhoff's law. To demonstrate our general approach, we use it to find a lower\nbound for the minimum dissipation that is tighter than existing bounds obtained\nwith only global constraints. We also apply it to simple networks, e.g., fully\nconnected 3-state CRNs with different local constraints and show that indirect\npathway and non-functional transient state can play a crucial role in switching\nbetween different probability distributions efficiently. Future directions in\nstudying OC in CRNs by using our general framework are discussed.\n","subjects":["Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}