{"id":"2407.19220","title":"A Low-Frequency Vibration Experimental Platform for University Physics\n  Experiment Designed by LabVIEW","authors":"Yangjie Dai, Leijian Wang, Wenbin Wu, Aiping Chen, Dawei Gu","authorsParsed":[["Dai","Yangjie",""],["Wang","Leijian",""],["Wu","Wenbin",""],["Chen","Aiping",""],["Gu","Dawei",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 09:27:19 GMT"}],"updateDate":"2024-07-30","timestamp":1722072439000,"abstract":"  Virtual instrument technology has been increasingly used in university\nphysics experiment teaching. An experimental platform is specifically\nconstructed for studying low-frequency vibrations in university physics, which\nis based on a computer and its internal sound card, along with a program\ndeveloped in LabVIEW programming environment to perform control and measurement\non our experimental platform. The proposed platform effectively replaces the\nconventional signal generator and oscilloscope traditionally used in such\nexperiments by integrating virtual instruments and essential experimental\nequipment. The platform offers various functionalities, such as synchronous\ntransmission and reception of low-frequency signals, frequency measurement,\ndynamic frequency sweep measurement, and measurement using the three-point\napproximation method. The proposed platform has been successfully applied in\nexperiments involving forced vibration, resonance of tuning forks, and dynamic\nmeasurement of Young's modulus. Unlike conventional low-frequency vibration\nexperiments, the proposed experimental platform optimizes efficiency, reduces\ncosts, and offers opportunities for enhancing the instructional content of\nexperiments. Furthermore, the incorporation of state-of-the-art computer\ntechnology enhances students' engagement and enthusiasm for learning.\n","subjects":["Physics/Physics Education","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}