{"id":"2407.18709","title":"Immunity to Increasing Condition Numbers of Linear Superiorization\n  versus Linear Programming","authors":"Jan Schr\\\"oder, Yair Censor, Philipp S\\\"uss and Karl-Heinz K\\\"ufer","authorsParsed":[["Schröder","Jan",""],["Censor","Yair",""],["Süss","Philipp",""],["Küfer","Karl-Heinz",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 12:49:52 GMT"}],"updateDate":"2024-07-29","timestamp":1721998192000,"abstract":"  Given a family of linear constraints and a linear objective function one can\nconsider whether to apply a Linear Programming (LP) algorithm or use a Linear\nSuperiorization (LinSup) algorithm on this data. In the LP methodology one aims\nat finding a point that fulfills the constraints and has the minimal value of\nthe objective function over these constraints. The Linear Superiorization\napproach considers the same data as linear programming problems but instead of\nattempting to solve those with linear optimization methods it employs\nperturbation resilient feasibility-seeking algorithms and steers them toward\nfeasible points with reduced (not necessarily minimal) objective function\nvalues. Previous studies compared LP and LinSup in terms of their respective\noutputs and the resources they use. In this paper we investigate these two\napproaches in terms of their sensitivity to condition numbers of the system of\nlinear constraints. Condition numbers are a measure for the impact of\ndeviations in the input data on the output of a problem and, in particular,\nthey describe the factor of error propagation when given wrong or erroneous\ndata. Therefore, the ability of LP and LinSup to cope with increased condition\nnumbers, thus with ill-posed problems, is an important matter to consider which\nwas not studied until now. We investigate experimentally the advantages and\ndisadvantages of both LP and LinSup on examplary problems of linear programming\nwith multiple condition numbers and different problem dimensions.\n","subjects":["Mathematics/Optimization and Control","Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}