{"id":"2407.19319","title":"On The Effect Of Size On The Kinetics Of Reactions In Solutions","authors":"Manuel Dedola, Gaia Cassar\\`a-Airoldi, Ludovico Cademartiri","authorsParsed":[["Dedola","Manuel",""],["Cassarà-Airoldi","Gaia",""],["Cademartiri","Ludovico",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 18:31:36 GMT"}],"updateDate":"2024-07-30","timestamp":1722105096000,"abstract":"  Reactions in solution require \"contact\" between the reagents. We can predict\nthe rate at which reagents come into \"contact\" (at least in dilute conditions),\nbut if the initial collision does not lead to reaction, what happens then? The\ncollision rates in solution-phase reactions are generally described (explicitly\nor implicitly) with the Smoluchowski equation. Unfortunately, that model\ndescribes coagulations in gases, not reactions in solutions. The model is\nmemory-less, i.e., collisions are treated as random processes, unaware of each\nother in space and time. The reality is that unreactive collisions create\nmemory: particles (even molecules) \"remember\" they just collided, i.e, the\nprobability of collision depends on how far back in time their prior collision\nhappened. As we show here, this purely geometric and statistical fact is valid\nas long as their size is larger than the Kuhn length of their Brownian motion\nin solution. Under these conditions, particles in solution form, even in the\nabsence of attractive interactions, relatively long-lived \"clusters\" kept\ntogether by the statistical unlikeliness of separating. We show here through\nBrownian dynamics simulations that, as a result of this memory, the collision\nrates and the lifetimes of these clusters, differently from what predicted by\nSmoluchowski's model, are proportional to the ratio between the radius of the\ncolliders and the Kuhn length of their path in solution, with a coefficient\nclose to unity!\n","subjects":["Physics/Chemical Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Condensed Matter/Soft Condensed Matter","Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}