{"id":"2407.05441","title":"Language Models Encode Collaborative Signals in Recommendation","authors":"Leheng Sheng and An Zhang and Yi Zhang and Yuxin Chen and Xiang Wang\n  and Tat-Seng Chua","authorsParsed":[["Sheng","Leheng",""],["Zhang","An",""],["Zhang","Yi",""],["Chen","Yuxin",""],["Wang","Xiang",""],["Chua","Tat-Seng",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 17:05:24 GMT"}],"updateDate":"2024-07-09","timestamp":1720371924000,"abstract":"  Recent studies empirically indicate that language models (LMs) encode rich\nworld knowledge beyond mere semantics, attracting significant attention across\nvarious fields. However, in the recommendation domain, it remains uncertain\nwhether LMs implicitly encode user preference information. Contrary to the\nprevailing understanding that LMs and traditional recommender models learn two\ndistinct representation spaces due to a huge gap in language and behavior\nmodeling objectives, this work rethinks such understanding and explores\nextracting a recommendation space directly from the language representation\nspace. Surprisingly, our findings demonstrate that item representations, when\nlinearly mapped from advanced LM representations, yield superior recommendation\nperformance. This outcome suggests the homomorphism between the language\nrepresentation space and an effective recommendation space, implying that\ncollaborative signals may indeed be encoded within advanced LMs. Motivated by\nthese findings, we propose a simple yet effective collaborative filtering (CF)\nmodel named AlphaRec, which utilizes language representations of item textual\nmetadata (e.g., titles) instead of traditional ID-based embeddings.\nSpecifically, AlphaRec is comprised of three main components: a multilayer\nperceptron (MLP), graph convolution, and contrastive learning (CL) loss\nfunction, making it extremely easy to implement and train. Our empirical\nresults show that AlphaRec outperforms leading ID-based CF models on multiple\ndatasets, marking the first instance of such a recommender with text embeddings\nachieving this level of performance. Moreover, AlphaRec introduces a new\nlanguage-representation-based CF paradigm with several desirable advantages:\nbeing easy to implement, lightweight, rapid convergence, superior zero-shot\nrecommendation abilities in new domains, and being aware of user intention.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}