{"id":"2407.06242","title":"Angular anisotropy in prefission neutron spectra and PFNS of\n  $^{240}$Pu$(n,F)$","authors":"V.M. Maslov","authorsParsed":[["Maslov","V. M.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 07:12:01 GMT"}],"updateDate":"2024-07-11","timestamp":1720422721000,"abstract":"  Angular anisotropy of secondary neutrons was evidenced in neutron emission\nspectra (NES) of $^{239}$Pu+n in 1972, and prompt fission neutron spectra\n(PFNS) of $^{239}$Pu$(n,F)$ in 2019, it might be predicted for $^{240}$Pu(n,F)\nPFNS now. In case of NES angular anisotropy is due to direct excitation of\ncollective levels and pre-equilibrium/semi-direct (states in the continuum are\nexcited) mechanism of neutron emission of first neutron in (n,nX) reaction,\nwhile in case of PFNS it is due to exclusive spectra of pre-fission neutrons of\n(n, xnf) reactions. In $^{239}$Pu$(n,xnf)$ and $^{240}$Pu(n,xnf) reactions\nobserved PFNS envision different response to the emission of first pre-fission\nneutron in forward or backward semi-spheres with respect to the momentum of\nincident neutrons. Since energies of (n,nf) neutrons and their average values\ndepend on angle of emission theta with respect to the incident neutron\nmomentum, the observed PFNS, average prompt fission neutron multiplicity,\nfission cross section, average total kinetic energy TKE, etc. also would be\nquite dependent on angle theta. Exclusive spectra of (n, xnf) neutrons at theta\nof 90 degrees are consistent with $^{240}$Pu(n, F)($^{239}$Pu$(n,F)$,\n$^{239}$Pu$(n,2n)$) observed cross sections and neutron emission spectra of\n$^{239}$Pu+n interaction at En up to 20 MeV. The correlations of the angular\nanisotropy of PFNS with the relative contribution of the $(n,nf)$ fission\nchance to the observed fission cross section and angular anisotropy of\npre-fission neutron emission are ascertained.\n","subjects":["Physics/Nuclear Theory","Physics/Nuclear Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}