{"id":"2407.11466","title":"Navigating the Data Trading Crossroads: An Interdisciplinary Survey","authors":"Yi Yu, Jingru Yu, Xuhong Wang, Juanjuan Li, Yilun Lin, Conghui He,\n  Yanqing Yang, Yu Qiao, Li Li, and Fei-Yue Wang","authorsParsed":[["Yu","Yi",""],["Yu","Jingru",""],["Wang","Xuhong",""],["Li","Juanjuan",""],["Lin","Yilun",""],["He","Conghui",""],["Yang","Yanqing",""],["Qiao","Yu",""],["Li","Li",""],["Wang","Fei-Yue",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 08:07:16 GMT"}],"updateDate":"2024-07-17","timestamp":1721117236000,"abstract":"  Data has been increasingly recognized as a critical factor in the future\neconomy. However, constructing an efficient data trading market faces\nchallenges such as privacy breaches, data monopolies, and misuse. Despite\nnumerous studies proposing algorithms to protect privacy and methods for\npricing data, a comprehensive understanding of these issues and systemic\nsolutions remain elusive. This paper provides an extensive review and\nevaluation of data trading research, aiming to identify existing problems,\nresearch gaps, and propose potential solutions. We categorize the challenges\ninto three main areas: Compliance Challenges, Collateral Consequences, and\nCostly Transactions (the \"3C problems\"), all stemming from ambiguity in data\nrights. Through a quantitative analysis of the literature, we observe a\nparadigm shift from isolated solutions to integrated approaches. Addressing the\nunresolved issue of right ambiguity, we introduce the novel concept of \"data\nusufruct,\" which allows individuals to use and benefit from data they do not\nown. This concept helps reframe data as a more conventional factor of\nproduction and aligns it with established economic theories, paving the way for\na comprehensive framework of research theories, technical tools, and platforms.\nWe hope this survey provides valuable insights and guidance for researchers,\npractitioners, and policymakers, thereby contributing to digital economy\nadvancements.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}