{"id":"2407.06764","title":"Resolvent analysis of a swimming foil","authors":"Jonathan M. O. Massey, Sean Symon, Bharathram Ganapathisubramani and\n  Gabriel D. Weymouth","authorsParsed":[["Massey","Jonathan M. O.",""],["Symon","Sean",""],["Ganapathisubramani","Bharathram",""],["Weymouth","Gabriel D.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 11:17:48 GMT"}],"updateDate":"2024-07-10","timestamp":1720523868000,"abstract":"  This study employs resolvent analysis to explore the dynamics and coherent\nstructures in the boundary layer of a foil that swims via a travelling wave\nundulation. A modified NACA foil shape is used together with undulatory\nkinematics to represent fish-like bodies at realistic Reynolds numbers ($\n\\mathit{Re} = 10,000 $ and $ \\mathit{Re} = 100,000 $) in both thrust- and\ndrag-producing propulsion regimes. We introduce a novel coordinate\ntransformation that enables the implementation of the data-driven resolvent\nanalysis \\citep{herrmann_data-driven_2021} to dissect the stability of the\nboundary layer of the swimming foil. This is the first study to implement\nresolvent analysis on deforming bodies with non-zero thickness and at realistic\nswimming Reynolds numbers. The analysis reinforces the notion that swimming\nkinematics drive the system's physics. In drag-producing regimes, it reveals\nbreakdown mechanisms of the propulsive wave, while thrust-producing regimes\nshow a uniform wave amplification across the foil's back half. The key thrust\nand drag mechanisms scale with the boundary-layer thickness, implying geometric\nself-similarity in this $\\mathit{Re}$ regime. In addition, we identify a\nmechanism that is less strongly coupled to the body motion. We offer a\ncomparison to a rough foil that reduces the amplification of this mechanism,\ndemonstrating the potential of roughness to control the amplification of key\nmechanisms in the flow. The results provide valuable insights into the dynamics\nof swimming bodies and highlight avenues for developing opposition control\nstrategies.\n","subjects":["Physics/Fluid Dynamics","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1FMWTdRouBzmeqwsNwm8YwHSdHAR8LzKritD294F87c","pdfSize":"1063232"}
