{"id":"2407.01788","title":"Impact of the Network Size and Frequency of Information Receipt on\n  Polarization in Social Networks","authors":"Sudhakar Krisharao, Shaja Arul Selvamani","authorsParsed":[["Krisharao","Sudhakar",""],["Selvamani","Shaja Arul",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 20:30:04 GMT"}],"updateDate":"2024-07-03","timestamp":1719865804000,"abstract":"  Opinion Dynamics is an interdisciplinary area of research. Psychology and\nSociology have proposed models of how individuals form opinions and how social\ninteractions influence this process. Socio-Physicists have interpreted patterns\nin opinion formation as arising from non-linearity in the underlying process,\nshaping the models. Agent-based modeling has offered a platform to study the\nOpinion Dynamics of large groups. This paper recasts recent models in opinion\nformation into a proper dynamical system, injecting the idea of clock time into\nevolving opinions. The time interval between successive receipts of new\ninformation (frequency of information receipts) becomes a factor to study.\nSocial media has shrunk time intervals between information receipts, increasing\ntheir frequency. The recast models show that shorter intervals and larger\nnetworks increase an individual's propensity for polarization, defined as an\ninability to hold a neutral opinion. A Polarization number based on\nsociological parameters is proposed, with critical values beyond which\nindividuals are prone to polarization, depending on psychological parameters.\nReduced time intervals and larger interacting groups can push the Polarization\nnumber to critical values, contributing to polarization. The Extent of\nPolarization is defined as the width of the region around neutral within which\nan individual cannot hold an opinion. Results are reported for model parameters\nfound in the literature. The findings offer an opportunity to adjust model\nparameters to align with empirical evidence, aiding the study of Opinion\nDynamics in large social networks using Agent-Based Modeling.\n","subjects":["Computing Research Repository/Multiagent Systems","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}