{"id":"2407.09082","title":"The MeerKAT Fornax Survey. III. Ram-pressure stripping of the tidally\n  interacting galaxy NGC 1427A in the Fornax cluster","authors":"P. Serra, T. A. Oosterloo, P. Kamphuis, G. I. G. Jozsa, W. J. G. de\n  Blok, G. L. Bryan, J. H. van Gorkom, E. Iodice, D. Kleiner, A. Loni, S. I.\n  Loubser, F. M. Maccagni, D. Molnar, R. Peletier, D. J. Pisano, M. Ramatsoku,\n  M. W. L. Smith, M. A. W. Verheijen, N. Zabel","authorsParsed":[["Serra","P.",""],["Oosterloo","T. A.",""],["Kamphuis","P.",""],["Jozsa","G. I. G.",""],["de Blok","W. J. G.",""],["Bryan","G. L.",""],["van Gorkom","J. H.",""],["Iodice","E.",""],["Kleiner","D.",""],["Loni","A.",""],["Loubser","S. I.",""],["Maccagni","F. M.",""],["Molnar","D.",""],["Peletier","R.",""],["Pisano","D. J.",""],["Ramatsoku","M.",""],["Smith","M. W. L.",""],["Verheijen","M. A. W.",""],["Zabel","N.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 08:12:55 GMT"}],"updateDate":"2024-07-15","timestamp":1720771975000,"abstract":"  We present MeerKAT Fornax Survey HI observations of NGC 1427A, a blue\nirregular galaxy with a stellar mass of 2e+9 Msun located near the centre of\nthe Fornax galaxy cluster. Thanks to the excellent resolution (1 to 6 kpc\nspatially, 1.4 km/s in velocity) and HI column density sensitivity (4e+19/cm^2\nto 1e+18/cm^2 depending on resolution), our data deliver new insights on the\nlong-debated interaction of this galaxy with the cluster environment. We\nconfirm the presence of a broad, one-sided, starless HI tail stretching from\nthe outer regions of the stellar body and pointing away from the cluster\ncentre. We find the tail to have 50% more HI (4e+8 Msun) and to be 3 times\nlonger (70 kpc) than in previous observations. In fact, we detect scattered HI\nclouds out to 300 kpc from the galaxy in the direction of the tail -- possibly\nthe most ancient remnant of the passage of NGC 1427A through the intracluster\nmedium of Fornax. Both the velocity gradient along the HI tail and the peculiar\nkinematics of HI in the outer region of the stellar body are consistent with\nthe effect of ram pressure given the line-of-sight motion of the galaxy within\nthe cluster. However, several properties cannot be explained solely by ram\npressure and suggest an ongoing tidal interaction. This includes: the close\nmatch between dense HI and stars within the disturbed stellar body; the\nabundant kinematically-anomalous HI; and the inversion of the HI velocity\ngradient near the base of the HI tail. We rule out an interaction with the\ncluster tidal field, and conclude that NGC 1427A is the result of a high-speed\ngalaxy encounter or of a merger started at least 300 Myr ago, where ram\npressure shapes the distribution and kinematics of the HI in the perturbed\nouter stellar body and in the tidal tails.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}