{"id":"2407.21628","title":"Ram-pressure stripped radio tails detected in the dynamically active\n  environment of the Shapley Supercluster","authors":"P. Merluzzi, T. Venturi, G. Busarello, G. Di Gennaro, S. Giacintucci,\n  V. Casasola, D. Krajnovic, T. Vernstrom, E. Carretti, O. Smirnov, K.\n  Trehaeven, C. S. Anderson, J. Chesters, G. Heald, A. M. Hopkins, B.\n  Koribalski","authorsParsed":[["Merluzzi","P.",""],["Venturi","T.",""],["Busarello","G.",""],["Di Gennaro","G.",""],["Giacintucci","S.",""],["Casasola","V.",""],["Krajnovic","D.",""],["Vernstrom","T.",""],["Carretti","E.",""],["Smirnov","O.",""],["Trehaeven","K.",""],["Anderson","C. S.",""],["Chesters","J.",""],["Heald","G.",""],["Hopkins","A. M.",""],["Koribalski","B.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:22:44 GMT"}],"updateDate":"2024-08-01","timestamp":1722435764000,"abstract":"  We study the radio continuum emission of four galaxies experiencing\nram-pressure stripping in four clusters of the Shapley supercluster at redshift\nz~0.05. Multi-band (235-1367 MHz) radio data, complemented by integral-field\nspectroscopy, allow us to detect and analyse in detail the non-thermal\ncomponent both in the galaxy discs and the radio continuum tails. Three\ngalaxies present radio continuum tails which are tens of kiloparsecs long. By\nderiving the radio spectral index in the inner and outer tails and comparing\nour findings with the distribution of the extraplanar ionised gas and the\nresults of N-body/hydrodynamical simulations, we demonstrate that these tails\nare caused by the ram pressure which, together with the ionised gas, sweeps the\nmagnetic field from the galaxy discs. We suggest that the radio continuum\nemission in these tails can be differently powered by (i) in situ star\nformation; (ii) relativistic electrons stripped from the disc; (iii) shock\nexcitation or a combination of them. All the ram-pressure stripped galaxies are\nfound in environments where cluster-cluster interactions occurred and/or are\nongoing thus strongly supporting the thesis that cluster and group collisions\nand mergers may locally increase the ram pressure and trigger hydrodynamical\ninteractions between the intracluster medium and the interstellar medium of\ngalaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NAfRs_XMXoRbBTLbJkXJIvmFdNn4ZXVgIMooZKL1uKc","pdfSize":"5837033"}
