{"id":"2407.04761","title":"A Decomposition Theorem for Dynamic Flows","authors":"Lukas Graf, Tobias Harks, Julian Schwarz","authorsParsed":[["Graf","Lukas",""],["Harks","Tobias",""],["Schwarz","Julian",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 17:58:52 GMT"}],"updateDate":"2024-07-09","timestamp":1720202332000,"abstract":"  The famous edge flow decomposition theorem of Gallai (1958) states that any\nstatic edge $s$,$d$-flow in a directed graph can be decomposed into a linear\ncombination of incidence vectors of paths and cycles. In this paper, we study\nthe decomposition problem for the setting of dynamic edge $s$,$d$-flows\nassuming a quite general dynamic flow propagation model. We prove the following\ndecomposition theorem: For any dynamic edge $s$,$d$-flow with finite support,\nthere exists a decomposition into a linear combination of $s$,$d$-walk inflows\nand circulations, i.e. edge flows that circulate along cycles with zero transit\ntime. We show that a variant of the classical algorithmic approach of\niteratively subtracting walk inflows from the current dynamic edge flow\nconverges to a dynamic circulation. The algorithm terminates in finite time, if\nthere is a lower bound on the minimum edge travel times. We further\ncharacterize those dynamic edge flows which can be decomposed purely into\nlinear combinations of $s$,$d$-walk inflows.\n  The proofs rely on the new concept of parameterized network loadings which\ndescribe how particles of a different walk flow would hypothetically propagate\nthroughout the network under the fixed travel times induced by the given edge\nflow. We show several technical properties of this type of network loading and\nas a byproduct we also derive some general results on dynamic flows which could\nbe of interest outside the context of this paper as well.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}