{"id":"2407.00411","title":"Explainability of Machine Learning Models under Missing Data","authors":"Tuan L. Vo, Thu Nguyen, Hugo L. Hammer, Michael A. Riegler, Pal\n  Halvorsen","authorsParsed":[["Vo","Tuan L.",""],["Nguyen","Thu",""],["Hammer","Hugo L.",""],["Riegler","Michael A.",""],["Halvorsen","Pal",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 11:31:09 GMT"}],"updateDate":"2024-07-02","timestamp":1719660669000,"abstract":"  Missing data is a prevalent issue that can significantly impair model\nperformance and interpretability. This paper briefly summarizes the development\nof the field of missing data with respect to Explainable Artificial\nIntelligence and experimentally investigates the effects of various imputation\nmethods on the calculation of Shapley values, a popular technique for\ninterpreting complex machine learning models. We compare different imputation\nstrategies and assess their impact on feature importance and interaction as\ndetermined by Shapley values. Moreover, we also theoretically analyze the\neffects of missing values on Shapley values. Importantly, our findings reveal\nthat the choice of imputation method can introduce biases that could lead to\nchanges in the Shapley values, thereby affecting the interpretability of the\nmodel. Moreover, and that a lower test prediction mean square error (MSE) may\nnot imply a lower MSE in Shapley values and vice versa. Also, while Xgboost is\na method that could handle missing data directly, using Xgboost directly on\nmissing data can seriously affect interpretability compared to imputing the\ndata before training Xgboost. This study provides a comprehensive evaluation of\nimputation methods in the context of model interpretation, offering practical\nguidance for selecting appropriate techniques based on dataset characteristics\nand analysis objectives. The results underscore the importance of considering\nimputation effects to ensure robust and reliable insights from machine learning\nmodels.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"K2sfi6lw_CYRZmbWVRkZui5YSva7dYYihUH2P_u9KqQ","pdfSize":"5134243"}
