{"id":"2407.02444","title":"Asymmetries in the simulated ozone distribution on TRAPPIST-1e due to\n  orography","authors":"Anand Bhongade, Daniel R Marsh, Felix Sainsbury-Martinez, and Gregory\n  J Cooke","authorsParsed":[["Bhongade","Anand",""],["Marsh","Daniel R",""],["Sainsbury-Martinez","Felix",""],["Cooke","Gregory J",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 17:21:00 GMT"}],"updateDate":"2024-07-03","timestamp":1719940860000,"abstract":"  TRAPPIST-1e is a tidally locked rocky exoplanet orbiting the habitable zone\nof an M dwarf star. Upcoming observations are expected to reveal new rocky\nexoplanets and their atmospheres around M dwarf stars. To interpret these\nfuture observations we need to model the atmospheres of such exoplanets. We\nconfigured CESM2-WACCM6, a chemistry climate model, for the orbit and stellar\nirradiance of TRAPPIST-1e assuming an initial Earth-like atmospheric\ncomposition. Our aim is to characterize the possible ozone (O$_3$) distribution\nand explore how this is influenced by the atmospheric circulation shaped by\norography, using the Helmholtz wind decomposition and meridional mass\nstreamfunction. The model included Earth-like orography and the substellar\npoint was located over the Pacific Ocean. For such a scenario, our analysis\nreveals a North-South asymmetry in the simulated O$_3$ distribution. The O$_3$\nconcentration is highest below 10 hPa level (below $\\sim$30 km) near the South\npole. This asymmetry results from the presence of land masses on the night side\nthat cause drag in near-surface flows and lead to an asymmetric meridional\noverturning circulation. Catalytic species were roughly symmetrically\ndistributed and were not found to be primary driver for the O$_3$ asymmetry.\nThe total ozone column (TOC) density was higher for TRAPPIST-1e compared to\nEarth, with 8000 Dobson Units (DU) near the South pole and 2000 DU near the\nNorth pole. The results emphasize the sensitivity of O$_3$ to model parameters,\nillustrating how incorporating Earth-like orography can affect atmospheric\ndynamics and O$_3$ distribution. This link between surface features and\natmospheric dynamics underlines the importance of how changing model parameters\nused to study exoplanet atmospheres can influence the interpretation of\nobservations.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Q9In5UDECobKBy-YaY4RKVNphoeQ44TI8pujKo5Uxx8","pdfSize":"8302043"}
