{"id":"2407.13183","title":"Methods to Measure the Broncho-Arterial Ratio and Wall Thickness in the\n  Right Lower Lobe for Defining Radiographic Reversibility of Bronchiectasis","authors":"Abhijith R. Beeravolu, Ian Brent Masters, Mirjam Jonkman, Kheng Cher\n  Yeo, Spyridon Prountzos, Rahul J Thomas, Eva Ignatious, Sami Azam, Gabrielle\n  B McCallum, Efthymia Alexopoulou, Anne B Chang, Friso De Boer","authorsParsed":[["Beeravolu","Abhijith R.",""],["Masters","Ian Brent",""],["Jonkman","Mirjam",""],["Yeo","Kheng Cher",""],["Prountzos","Spyridon",""],["Thomas","Rahul J",""],["Ignatious","Eva",""],["Azam","Sami",""],["McCallum","Gabrielle B",""],["Alexopoulou","Efthymia",""],["Chang","Anne B",""],["De Boer","Friso",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 05:43:38 GMT"}],"updateDate":"2024-07-19","timestamp":1721281418000,"abstract":"  The diagnosis of bronchiectasis requires measuring abnormal bronchial\ndilation. It is confirmed using a chest CT scan, where the key feature is an\nincreased broncho-arterial ratio (BAR) (>0.8 in children), often with bronchial\nwall thickening. Image processing methods facilitate quicker interpretation and\ndetailed evaluations by lobes and segments. Challenges like inclined nature,\noblique orientation, and partial volume effect make it difficult to obtain\naccurate measurements in the upper and middle lobes using the same algorithms.\nTherefore, accurate detection and measurement of airway and artery regions for\nBAR and wall thickness in each lobe require different image processing/machine\nlearning methods. We propose methods for: 1. Separating the right lower lobe\n(RLL) region from full-length CT scans using the tracheal bifurcation (Carina)\npoint as a central marker; 2. Locating the inner diameter of airways and outer\ndiameter of arteries for BAR measurement; and 3. Measuring airway wall\nthickness (WT) by identifying the outer and inner diameters of airway\nboundaries. Analysis of 13 HRCT scans with varying thicknesses (0.67mm, 1mm,\n2mm) shows the tracheal bifurcation frame can be detected accurately, with a\ndeviation of +/- 2 frames in some cases. A Windows app was developed for\nmeasuring inner airway diameter, artery diameter, BAR, and wall thickness,\nallowing users to draw boundaries around visible BA pairs in the RLL region.\nMeasurements of 10 BA pairs revealed accurate results comparable to those of a\nhuman reader, with deviations of +/- 0.10-0.15mm. Additional studies and\nvalidation are needed to consolidate inter- and intra-rater variability and\nenhance the methods.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}