{"id":"2407.10980","title":"Learning-based Big Data Sharing Incentive in Mobile AIGC Networks","authors":"Jinbo Wen, Yang Zhang, Yulin Chen, Weifeng Zhong, Xumin Huang, Lei\n  Liu, Dusit Niyato","authorsParsed":[["Wen","Jinbo",""],["Zhang","Yang",""],["Chen","Yulin",""],["Zhong","Weifeng",""],["Huang","Xumin",""],["Liu","Lei",""],["Niyato","Dusit",""]],"versions":[{"version":"v1","created":"Mon, 10 Jun 2024 15:16:41 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 16:49:02 GMT"}],"updateDate":"2024-08-01","timestamp":1718032601000,"abstract":"  Rapid advancements in wireless communication have led to a dramatic upsurge\nin data volumes within mobile edge networks. These substantial data volumes\noffer opportunities for training Artificial Intelligence-Generated Content\n(AIGC) models to possess strong prediction and decision-making capabilities.\nAIGC represents an innovative approach that utilizes sophisticated generative\nAI algorithms to automatically generate diverse content based on user inputs.\nLeveraging mobile edge networks, mobile AIGC networks enable customized and\nreal-time AIGC services for users by deploying AIGC models on edge devices.\nNonetheless, several challenges hinder the provision of high-quality AIGC\nservices, including issues related to the quality of sensing data for AIGC\nmodel training and the establishment of incentives for big data sharing from\nmobile devices to edge devices amidst information asymmetry. In this paper, we\ninitially define a Quality of Data (QoD) metric based on the age of information\nto quantify the quality of sensing data. Subsequently, we propose a contract\ntheoretic model aimed at motivating mobile devices for big data sharing.\nFurthermore, we employ a Proximal Policy Optimization (PPO) algorithm to\ndetermine the optimal contract. Numerical results demonstrate the efficacy and\nreliability of the proposed PPO-based contract model.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}