{"id":"2407.01478","title":"Estimating the possible QPOs of M87* from the parameters of a hairy Kerr\n  black hole","authors":"Orhan Donmez and Fatih Dogan","authorsParsed":[["Donmez","Orhan",""],["Dogan","Fatih",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 17:09:35 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 21:33:36 GMT"}],"updateDate":"2024-08-16","timestamp":1719853775000,"abstract":"  In this paper, we study the dynamics of the shock cone formed around the\nhairy Kerr black hole due to BHL accretion and investigate the QPO behaviors\nresulting from the black hole-cone interaction, aiming to predict the QPO\nfrequencies that may occur around the M87* black hole. To achieve this, we use\nthe hairy Kerr black hole parameters consistent with the observed shadow\nparameters of M87* as initial conditions in numerical simulations, revealing\nthe structure of the resulting shock cone and QPOs in a strong gravitational\nfield. Numerical calculations show that the deviation of the hairy Kerr black\nhole from the Kerr metric and the hair parameters significantly influence the\ncomplex behavior of the resulting QPOs. It is found that the Lense-Thirring\neffect and the pressure modes trapped within the cone lead to the excitation of\nQPOs. The hair parameter has been observed to suppress the resulting QPO\nfrequencies. The Lense-Thirring effect, in a strong gravitational field with a\nblack hole spin parameter of a/M > 0.7, also suppresses other modes and\ngenerates high-frequency QPOs. It is predicted that the QPO frequencies\nobserved around the M87* black hole could span a wide range from nHz to mHz.\nUsing both Kerr and hairy Kerr gravities, the QPO frequencies formed around the\nM87* black hole can be explained. Especially in cases where the black hole is\nspinning rapidly, PSD analyses have shown very distinct low-frequency QPOs and\nresonance conditions in both gravities. By comparing the results obtained from\nnumerical calculations with observational and analytical results, we discuss\nthe observability of the QPO frequencies that may occur around the M87* black\nhole.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}