{"id":"2407.16505","title":"Towards Modelling AR Sco: Generalised Particle Dynamics and Strong\n  Radiation-Reaction Regimes","authors":"L. Du Plessis, C. Venter, A.K. Harding, Z. Wadiasingh, C.\n  Kalapotharakos, and P. Els","authorsParsed":[["Plessis","L. Du",""],["Venter","C.",""],["Harding","A. K.",""],["Wadiasingh","Z.",""],["Kalapotharakos","C.",""],["Els","P.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:22:02 GMT"}],"updateDate":"2024-07-24","timestamp":1721744522000,"abstract":"  Numerical simulations of relativistic plasmas have become more feasible,\npopular, and crucial for various astrophysical sources with the availability of\ncomputational resources. The necessity for high-accuracy particle dynamics is\nespecially highlighted in pulsar modelling due to the extreme associated\nelectromagnetic fields and particle Lorentz factors. Including the\nradiation-reaction force in the particle dynamics adds even more complexity to\nthe problem, but is crucial for such extreme astrophysical sources. We have\nalso realised the need for such modelling concerning magnetic mirroring and\nparticle injection models proposed for AR Sco, the first white dwarf pulsar.\nThis paper demonstrates the benefits of using higher-order explicit numerical\nintegrators with adaptive time step methods to solve the full particle dynamics\nwith radiation-reaction forces included. We show that for standard test\nscenarios, namely various combinations of uniform $E$- and $B$-fields and a\nstatic dipole $B$-field, the schemes we use are equivalent to and in extreme\nfield cases outperform standard symplectic integrators in accuracy. We show\nthat the higher-order schemes have massive computational time improvements due\nto the adaptive time steps we implement, especially in non-uniform field\nscenarios and included radiation reaction where the particle gyro-radius\nrapidly changes. When balancing accuracy and computational time, we identified\nthe adaptive Dormand-Prince eighth-order scheme to be ideal for our use cases.\nThe schemes we use maintain accuracy and stability in describing the particle\ndynamics and we indicate how a charged particle enters radiation-reaction\nequilibrium and conforms to the analytic Aristotelian Electrodynamics\nexpectations.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}