{"id":"2407.01561","title":"Synthetic Data in Radiological Imaging: Current State and Future Outlook","authors":"Elena Sizikova, Andreu Badal, Jana G. Delfino, Miguel Lago, Brandon\n  Nelson, Niloufar Saharkhiz, Berkman Sahiner, Ghada Zamzmi, Aldo Badano","authorsParsed":[["Sizikova","Elena",""],["Badal","Andreu",""],["Delfino","Jana G.",""],["Lago","Miguel",""],["Nelson","Brandon",""],["Saharkhiz","Niloufar",""],["Sahiner","Berkman",""],["Zamzmi","Ghada",""],["Badano","Aldo",""]],"versions":[{"version":"v1","created":"Wed, 8 May 2024 18:35:47 GMT"}],"updateDate":"2024-07-03","timestamp":1715193347000,"abstract":"  A key challenge for the development and deployment of artificial intelligence\n(AI) solutions in radiology is solving the associated data limitations.\nObtaining sufficient and representative patient datasets with appropriate\nannotations may be burdensome due to high acquisition cost, safety limitations,\npatient privacy restrictions or low disease prevalence rates. In silico data\noffers a number of potential advantages to patient data, such as diminished\npatient harm, reduced cost, simplified data acquisition, scalability, improved\nquality assurance testing, and a mitigation approach to data imbalances. We\nsummarize key research trends and practical uses for synthetically generated\ndata for radiological applications of AI. Specifically, we discuss different\ntypes of techniques for generating synthetic examples, their main application\nareas, and related quality control assessment issues. We also discuss current\napproaches for evaluating synthetic imaging data. Overall, synthetic data holds\ngreat promise in addressing current data availability gaps, but additional work\nis needed before its full potential is realized.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}