{"id":"2407.05422","title":"Three-dimensional diffusive-thermal instability of flames propagating in\n  a plane Poiseuille flow","authors":"Aiden Kelly, Prabakaran Rajamanickam, Joel Daou, Julien R. Landel","authorsParsed":[["Kelly","Aiden",""],["Rajamanickam","Prabakaran",""],["Daou","Joel",""],["Landel","Julien R.",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 16:00:07 GMT"}],"updateDate":"2024-07-09","timestamp":1720368007000,"abstract":"  The three-dimensional diffusive-thermal stability of a two-dimensional flame\npropagating in a Poiseuille flow is examined. The study explores the effect of\nthree non-dimensional parameters, namely the Lewis number $Le$, the Damk\\\"ohler\nnumber $Da$, and the flow Peclet number $Pe$. Wide ranges of the Lewis number\nand the flow amplitude are covered, as well as conditions corresponding to\nsmall-scale narrow ($Da \\ll 1$) to large-scale wide ($Da \\gg 1$) channels. The\ninstability experienced by the flame appears as a combination of the\ntraditional diffusive-thermal instability of planar flames and the recently\nidentified instability corresponding to a transition from symmetric to\nasymmetric flame. The instability regions are identified in the $Le$-$Pe$ plane\nfor selected values of $Da$ by computing the eigenvalues of a linear stability\nproblem. These are complemented by two- and three-dimensional time-dependent\nsimulations describing the full evolution of unstable flames into the\nnon-linear regime. In narrow channels, flames are found to be always symmetric\nabout the mid-plane of the channel. Additionally, in these situations, shear\nflow-induced Taylor dispersion enhances the cellular instability in $Le<1$\nmixtures and suppresses the oscillatory instability in $Le>1$ mixtures. In\nlarge-scale channels, however, both the cellular and the oscillatory\ninstabilities are expected to persist. Here, the flame has a stronger\npropensity to become asymmetric when the mean flow opposes its propagation and\nwhen $Le<1$; if the mean flow facilitates the flame propagation, then the flame\nis likely to remain symmetric about the channel mid-plane. For $Le>1$, both\nsymmetric and asymmetric flames are encountered and are accompanied by temporal\noscillations.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}