{"id":"2407.00246","title":"SBOM.EXE: Countering Dynamic Code Injection based on Software Bill of\n  Materials in Java","authors":"Aman Sharma, Martin Wittlinger, Benoit Baudry, and Martin Monperrus","authorsParsed":[["Sharma","Aman",""],["Wittlinger","Martin",""],["Baudry","Benoit",""],["Monperrus","Martin",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 22:08:17 GMT"}],"updateDate":"2024-07-02","timestamp":1719612497000,"abstract":"  Software supply chain attacks have become a significant threat as software\ndevelopment increasingly relies on contributions from multiple, often\nunverified sources. The code from unverified sources does not pose a threat\nuntil it is executed. Log4Shell is a recent example of a supply chain attack\nthat processed a malicious input at runtime, leading to remote code execution.\nIt exploited the dynamic class loading facilities of Java to compromise the\nruntime integrity of the application. Traditional safeguards can mitigate\nsupply chain attacks at build time, but they have limitations in mitigating\nruntime threats posed by dynamically loaded malicious classes. This calls for a\nsystem that can detect these malicious classes and prevent their execution at\nruntime. This paper introduces SBOM.EXE, a proactive system designed to\nsafeguard Java applications against such threats. SBOM.EXE constructs a\ncomprehensive allowlist of permissible classes based on the complete software\nsupply chain of the application. This allowlist is enforced at runtime,\nblocking any unrecognized or tampered classes from executing. We assess\nSBOM.EXE's effectiveness by mitigating 3 critical CVEs based on the above\nthreat. We run our tool with 3 open-source Java applications and report that\nour tool is compatible with real-world applications with minimal performance\noverhead. Our findings demonstrate that SBOM.EXE can effectively maintain\nruntime integrity with minimal performance impact, offering a novel approach to\nfortifying Java applications against dynamic classloading attacks.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AsYBErtPj2A-Jx43Lf8eqmKEqw5Gm9KnARZbauNQqk0","pdfSize":"2336270"}
