{"id":"2407.11500","title":"An AI System for Continuous Knee Osteoarthritis Severity Grading Using\n  Self-Supervised Anomaly Detection with Limited Data","authors":"Niamh Belton and Aonghus Lawlor and Kathleen M. Curran","authorsParsed":[["Belton","Niamh",""],["Lawlor","Aonghus",""],["Curran","Kathleen M.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 08:37:33 GMT"}],"updateDate":"2024-07-17","timestamp":1721119053000,"abstract":"  The diagnostic accuracy and subjectivity of existing Knee Osteoarthritis (OA)\nordinal grading systems has been a subject of on-going debate and concern.\nExisting automated solutions are trained to emulate these imperfect systems,\nwhilst also being reliant on large annotated databases for fully-supervised\ntraining. This work proposes a three stage approach for automated continuous\ngrading of knee OA that is built upon the principles of Anomaly Detection (AD);\nlearning a robust representation of healthy knee X-rays and grading disease\nseverity based on its distance to the centre of normality. In the first stage,\nSS-FewSOME is proposed, a self-supervised AD technique that learns the 'normal'\nrepresentation, requiring only examples of healthy subjects and <3% of the\nlabels that existing methods require. In the second stage, this model is used\nto pseudo label a subset of unlabelled data as 'normal' or 'anomalous',\nfollowed by denoising of pseudo labels with CLIP. The final stage involves\nretraining on labelled and pseudo labelled data using the proposed Dual Centre\nRepresentation Learning (DCRL) which learns the centres of two representation\nspaces; normal and anomalous. Disease severity is then graded based on the\ndistance to the learned centres. The proposed methodology outperforms existing\ntechniques by margins of up to 24% in terms of OA detection and the disease\nseverity scores correlate with the Kellgren-Lawrence grading system at the same\nlevel as human expert performance. Code available at\nhttps://github.com/niamhbelton/SS-FewSOME_Disease_Severity_Knee_Osteoarthritis.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}