{"id":"2407.12006","title":"Form-Finding and Physical Property Predictions of Tensegrity Structures\n  Using Deep Neural Networks","authors":"Muhao Chen and Jing Qin","authorsParsed":[["Chen","Muhao",""],["Qin","Jing",""]],"versions":[{"version":"v1","created":"Sat, 15 Jun 2024 16:39:53 GMT"}],"updateDate":"2024-07-18","timestamp":1718469593000,"abstract":"  In the design of tensegrity structures, traditional form-finding methods\nutilize kinematic and static approaches to identify geometric configurations\nthat achieve equilibrium. However, these methods often fall short when applied\nto actual physical models due to imperfections in the manufacturing of\nstructural elements, assembly errors, and material non-linearities. In this\nwork, we develop a deep neural network (DNN) approach to predict the geometric\nconfigurations and physical properties-such as nodal coordinates, member\nforces, and natural frequencies-of any tensegrity structures in equilibrium\nstates. First, we outline the analytical governing equations for tensegrity\nstructures, covering statics involving nodal coordinates and member forces, as\nwell as modal information. Next, we propose a data-driven framework for\ntraining an appropriate DNN model capable of simultaneously predicting\ntensegrity forms and physical properties, thereby circumventing the need to\nsolve equilibrium equations. For validation, we analyze three tensegrity\nstructures, including a tensegrity D-bar, prism, and lander, demonstrating that\nour approach can identify approximation systems with relatively very small\noutput errors. This technique is applicable to a wide range of tensegrity\nstructures, particularly in real-world construction, and can be extended to\naddress additional challenges in identifying structural physics information.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}