{"id":"2407.20792","title":"How Novice Programmers Use and Experience ChatGPT when Solving\n  Programming Exercises in an Introductory Course","authors":"Andreas Scholl and Natalie Kiesler","authorsParsed":[["Scholl","Andreas",""],["Kiesler","Natalie",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 12:55:42 GMT"}],"updateDate":"2024-07-31","timestamp":1722344142000,"abstract":"  This research paper contributes to the computing education research\ncommunity's understanding of Generative AI (GenAI) in the context of\nintroductory programming, and specifically, how students utilize related tools,\nsuch as ChatGPT. An increased understanding of students' use is mandatory for\neducators and higher education institutions, as GenAI is here to stay, and its\nperformance is likely to improve rapidly in the near future. Learning about\nstudents' use patterns is not only crucial to support their learning, but to\ndevelop adequate forms of instruction and assessment. With the rapid\nadvancement of AI, its broad availability, and ubiquitous presence in\neducational environments, elaborating how AI can enhance learning experiences,\nespecially in courses such as introductory programming is important. To date,\nmost studies have focused on the educator's perspective on GenAI, its\nperformance, characteristics, and limitations. However, the student\nperspective, and how they actually use GenAI tools in course contexts, has not\nbeen subject to a great number of studies. Therefore, this study is guided by\nthe following research questions: (1) What do students report on their use\npattern of ChatGPT in the context of introductory programming exercises? and\n(2) How do students perceive ChatGPT in the context of introductory programming\nexercises? To address these questions, computing students at a large German\nuniversity were asked to solve programming tasks with the assistance of ChatGPT\nas part of their introductory programming course. Students (n=298) provided\ninformation regarding the use of ChatGPT, and their evaluation of the tool via\nan online survey. This research provides a comprehensive evaluation of\nChatGPT-3.5's application by novice programmers in a higher education\ncontext...\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"5J_ogn8hNMOdPqXS4QibRkgItrDoU8as_-6QRAN93yQ","pdfSize":"247268","objectId":"0xdc219bc2c542a85384ac7a8ffc8828399c91af0b6f32f931747c224d1b3393fb","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
