{"id":"2407.01643","title":"A Deep Generative Framework for Joint Households and Individuals\n  Population Synthesis","authors":"Xiao Qian, Utkarsh Gangwal, Shangjia Dong, Rachel Davidson","authorsParsed":[["Qian","Xiao",""],["Gangwal","Utkarsh",""],["Dong","Shangjia",""],["Davidson","Rachel",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 23:01:58 GMT"}],"updateDate":"2024-07-03","timestamp":1719788518000,"abstract":"  Household and individual-level sociodemographic data are essential for\nunderstanding human-infrastructure interaction and policymaking. However, the\nPublic Use Microdata Sample (PUMS) offers only a sample at the state level,\nwhile census tract data only provides the marginal distributions of variables\nwithout correlations. Therefore, we need an accurate synthetic population\ndataset that maintains consistent variable correlations observed in microdata,\npreserves household-individual and individual-individual relationships, adheres\nto state-level statistics, and accurately represents the geographic\ndistribution of the population. We propose a deep generative framework\nleveraging the variational autoencoder (VAE) to generate a synthetic population\nwith the aforementioned features. The methodological contributions include (1)\na new data structure for capturing household-individual and\nindividual-individual relationships, (2) a transfer learning process with\npre-training and fine-tuning steps to generate households and individuals whose\naggregated distributions align with the census tract marginal distribution, and\n(3) decoupled binary cross-entropy (D-BCE) loss function enabling distribution\nshift and out-of-sample records generation. Model results for an application in\nDelaware, USA demonstrate the ability to ensure the realism of generated\nhousehold-individual records and accurately describe population statistics at\nthe census tract level compared to existing methods. Furthermore, testing in\nNorth Carolina, USA yielded promising results, supporting the transferability\nof our method.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}