{"id":"2407.15784","title":"Diffusion Model Based Resource Allocation Strategy in Ultra-Reliable\n  Wireless Networked Control Systems","authors":"Amirhassan Babazadeh Darabi, Sinem Coleri","authorsParsed":[["Darabi","Amirhassan Babazadeh",""],["Coleri","Sinem",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 16:44:57 GMT"}],"updateDate":"2024-07-23","timestamp":1721666697000,"abstract":"  Diffusion models are vastly used in generative AI, leveraging their\ncapability to capture complex data distributions. However, their potential\nremains largely unexplored in the field of resource allocation in wireless\nnetworks. This paper introduces a novel diffusion model-based resource\nallocation strategy for Wireless Networked Control Systems (WNCSs) with the\nobjective of minimizing total power consumption through the optimization of the\nsampling period in the control system, and blocklength and packet error\nprobability in the finite blocklength regime of the communication system. The\nproblem is first reduced to the optimization of blocklength only based on the\nderivation of the optimality conditions. Then, the optimization theory solution\ncollects a dataset of channel gains and corresponding optimal blocklengths.\nFinally, the Denoising Diffusion Probabilistic Model (DDPM) uses this collected\ndataset to train the resource allocation algorithm that generates optimal\nblocklength values conditioned on the channel state information (CSI). Via\nextensive simulations, the proposed approach is shown to outperform previously\nproposed Deep Reinforcement Learning (DRL) based approaches with close to\noptimal performance regarding total power consumption. Moreover, an improvement\nof up to eighteen-fold in the reduction of critical constraint violations is\nobserved, further underscoring the accuracy of the solution.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Theory","Computing Research Repository/Systems and Control","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"C0ajOUm41Vwpr0HseudfZS7FARS7DRUEYjRvtJFrGVY","pdfSize":"5875770"}
