{"id":"2407.12758","title":"Mutual Information Guided Optimal Transport for Unsupervised\n  Visible-Infrared Person Re-identification","authors":"Zhizhong Zhang, Jiangming Wang, Xin Tan, Yanyun Qu, Junping Wang, Yong\n  Xie, Yuan Xie","authorsParsed":[["Zhang","Zhizhong",""],["Wang","Jiangming",""],["Tan","Xin",""],["Qu","Yanyun",""],["Wang","Junping",""],["Xie","Yong",""],["Xie","Yuan",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 17:32:07 GMT"}],"updateDate":"2024-07-18","timestamp":1721237527000,"abstract":"  Unsupervised visible infrared person re-identification (USVI-ReID) is a\nchallenging retrieval task that aims to retrieve cross-modality pedestrian\nimages without using any label information. In this task, the large\ncross-modality variance makes it difficult to generate reliable cross-modality\nlabels, and the lack of annotations also provides additional difficulties for\nlearning modality-invariant features. In this paper, we first deduce an\noptimization objective for unsupervised VI-ReID based on the mutual information\nbetween the model's cross-modality input and output. With equivalent\nderivation, three learning principles, i.e., \"Sharpness\" (entropy\nminimization), \"Fairness\" (uniform label distribution), and \"Fitness\" (reliable\ncross-modality matching) are obtained. Under their guidance, we design a loop\niterative training strategy alternating between model training and\ncross-modality matching. In the matching stage, a uniform prior guided optimal\ntransport assignment (\"Fitness\", \"Fairness\") is proposed to select matched\nvisible and infrared prototypes. In the training stage, we utilize this\nmatching information to introduce prototype-based contrastive learning for\nminimizing the intra- and cross-modality entropy (\"Sharpness\"). Extensive\nexperimental results on benchmarks demonstrate the effectiveness of our method,\ne.g., 60.6% and 90.3% of Rank-1 accuracy on SYSU-MM01 and RegDB without any\nannotations.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}