{"id":"2407.03162","title":"Bunny-VisionPro: Real-Time Bimanual Dexterous Teleoperation for\n  Imitation Learning","authors":"Runyu Ding, Yuzhe Qin, Jiyue Zhu, Chengzhe Jia, Shiqi Yang, Ruihan\n  Yang, Xiaojuan Qi, Xiaolong Wang","authorsParsed":[["Ding","Runyu",""],["Qin","Yuzhe",""],["Zhu","Jiyue",""],["Jia","Chengzhe",""],["Yang","Shiqi",""],["Yang","Ruihan",""],["Qi","Xiaojuan",""],["Wang","Xiaolong",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 14:35:35 GMT"}],"updateDate":"2024-07-04","timestamp":1720017335000,"abstract":"  Teleoperation is a crucial tool for collecting human demonstrations, but\ncontrolling robots with bimanual dexterous hands remains a challenge. Existing\nteleoperation systems struggle to handle the complexity of coordinating two\nhands for intricate manipulations. We introduce Bunny-VisionPro, a real-time\nbimanual dexterous teleoperation system that leverages a VR headset. Unlike\nprevious vision-based teleoperation systems, we design novel low-cost devices\nto provide haptic feedback to the operator, enhancing immersion. Our system\nprioritizes safety by incorporating collision and singularity avoidance while\nmaintaining real-time performance through innovative designs. Bunny-VisionPro\noutperforms prior systems on a standard task suite, achieving higher success\nrates and reduced task completion times. Moreover, the high-quality\nteleoperation demonstrations improve downstream imitation learning performance,\nleading to better generalizability. Notably, Bunny-VisionPro enables imitation\nlearning with challenging multi-stage, long-horizon dexterous manipulation\ntasks, which have rarely been addressed in previous work. Our system's ability\nto handle bimanual manipulations while prioritizing safety and real-time\nperformance makes it a powerful tool for advancing dexterous manipulation and\nimitation learning.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}