{"id":"2407.04437","title":"Overeducation under different macroeconomic conditions: The case of\n  Spanish university graduates","authors":"Maite Bl\\'azquez Cuesta, Marco A. P\\'erez Navarro, Roc\\'io\n  S\\'anchez-Mangas","authorsParsed":[["Cuesta","Maite Blázquez",""],["Navarro","Marco A. Pérez",""],["Sánchez-Mangas","Rocío",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 11:34:48 GMT"}],"updateDate":"2024-07-08","timestamp":1720179288000,"abstract":"  This paper examines the incidence and persistence of overeducation in the\nearly careers of Spanish university graduates. We investigate the role played\nby the business cycle and field of study and their interaction in shaping both\nphenomena. We also analyse the relevance of specific types of knowledge and\nskills as driving factors in reducing overeducation risk. We use data from the\nSurvey on the Labour Insertion of University Graduates (EILU) conducted by the\nSpanish National Statistics Institute in 2014 and 2019. The survey collects\nrich information on cohorts that graduated in the 2009/2010 and 2014/2015\nacademic years during the Great Recession and the subsequent economic recovery,\nrespectively. Our results show, first, the relevance of the economic scenario\nwhen graduates enter the labour market. Graduation during a recession increased\novereducation risk and persistence. Second, a clear heterogeneous pattern\noccurs across fields of study, with health sciences graduates displaying better\nperformance in terms of both overeducation incidence and persistence and less\nimpact of the business cycle. Third, we find evidence that some transversal\nskills (language, IT, management) can help to reduce overeducation risk in the\nabsence of specific knowledge required for the job, thus indicating some kind\nof compensatory role. Finally, our findings have important policy implications.\nOvereducation, and more importantly overeducation persistence, imply a\nnon-neglectable misallocation of resources. Therefore, policymakers need to\naddress this issue in the design of education and labour market policies.\n","subjects":["Economics/Econometrics"],"license":"http://creativecommons.org/licenses/by/4.0/"}