{"id":"2407.01270","title":"The African Woman is Rhythmic and Soulful: Evaluation of Open-ended\n  Generation for Implicit Biases","authors":"Serene Lim","authorsParsed":[["Lim","Serene",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:21:33 GMT"}],"updateDate":"2024-07-02","timestamp":1719840093000,"abstract":"  This study investigates the subtle and often concealed biases present in\nLarge Language Models (LLMs), which, despite passing explicit bias tests, can\nstill exhibit implicit biases akin to those observed in humans who profess\negalitarian beliefs yet demonstrate underlying prejudices. The challenge of\nmeasuring such biases is exacerbated as LLMs become increasingly proprietary,\nrestricting access to their internal mechanisms such as embeddings, which are\ncrucial for applying traditional bias measures. To tackle these issues, this\nstudy introduces innovative measures of bias inspired by psychological\nmethodologies: the LLM Implicit Association Test (IAT) Bias and the LLM\nDecision Bias. The LLM IAT Bias is a prompt-based method designed to unearth\nimplicit biases by simulating the well-known psychological IAT but adapted for\nuse with LLMs. The LLM Decision Bias measure is developed to detect subtle\ndiscrimination in decision-making tasks, focusing on how LLMs choose between\nindividuals in various scenarios. Open-ended generation is also utilised\nthrough thematic analysis of word generations and storytelling. The experiments\nrevealed biases across gender and racial domains, from discriminatory\ncategorisations to exoticisation. Our findings indicate that the prompt-based\nmeasure of implicit bias not only correlates with traditional embedding-based\nmethods but also more effectively predicts downstream behaviors, which are\ncrucially measured by the LLM Decision Bias. This relationship underscores the\nimportance of relative, rather than absolute, evaluations in assessing implicit\nbiases, reflecting psychological insights into human bias assessment. This\nresearch contributes to the broader understanding of AI ethics and provides\nsuggestions for continually assessing and mitigating biases in advanced AI\nsystems, emphasising the need for more qualitative and downstream focus.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}