{"id":"2407.04514","title":"Giant Second Harmonic Generation from Wafer-Scale Aligned Chiral Carbon\n  Nanotubes","authors":"Rui Xu, Jacques Doumani, Viktor Labuntsov, Nina Hong, Anna-Christina\n  Samaha, Weiran Tu, Fuyang Tay, Elizabeth Blackert, Jiaming Luo, Mario El\n  Tahchi, Weilu Gao, Jun Lou, Yohei Yomogida, Kazuhiro Yanagi, Riichiro Saito,\n  Vasili Perebeinos, Andrey Baydin, Junichiro Kono, Hanyu Zhu","authorsParsed":[["Xu","Rui",""],["Doumani","Jacques",""],["Labuntsov","Viktor",""],["Hong","Nina",""],["Samaha","Anna-Christina",""],["Tu","Weiran",""],["Tay","Fuyang",""],["Blackert","Elizabeth",""],["Luo","Jiaming",""],["Tahchi","Mario El",""],["Gao","Weilu",""],["Lou","Jun",""],["Yomogida","Yohei",""],["Yanagi","Kazuhiro",""],["Saito","Riichiro",""],["Perebeinos","Vasili",""],["Baydin","Andrey",""],["Kono","Junichiro",""],["Zhu","Hanyu",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 13:55:45 GMT"}],"updateDate":"2024-07-08","timestamp":1720187745000,"abstract":"  Chiral carbon nanotubes (CNTs) are direct-gap semiconductors with optical\nproperties governed by one-dimensional excitons with enormous oscillator\nstrengths. Each species of chiral CNTs has an enantiomeric pair of left- and\nright-handed CNTs with nearly identical properties, but enantiomer-dependent\nphenomena can emerge, especially in nonlinear optical processes. Theoretical\nstudies have predicted strong second-order nonlinearities for chiral CNTs, but\nthere has been no experimental verification due to the lack of macroscopically\nordered assemblies of single-enantiomer chiral CNTs. Here for the first time,\nwe report the synthesis of centimeter-scale films of densely packed and aligned\nsingle-enantiomer chiral CNTs that exhibit micro-fabrication compatibility. We\nobserve giant second harmonic generation (SHG) emission from the chiral CNT\nfilm, which originates from the intrinsic chirality and inversion symmetry\nbreaking of the atomic structure of chiral CNTs. The observed value of the\ndominant element of the second-order nonlinear optical susceptibility tensor\nreaches $1.5\\times 10^{3}$ pm/V at a pump wavelength of 1030 nm, corresponding\nto the lowest-energy excitonic resonance. Our calculations based on many-body\ntheory correctly estimate the spectrum and magnitude of such excitonically\nenhanced optical nonlinearity. These results are promising for developing\nscalable chiral-CNT electronics, nonlinear photonics and photonic quantum\ncomputing.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}