{"id":"2407.17713","title":"Robust Room-Temperature Polariton Condensation and Lasing in Scalable\n  FAPbBr$_3$ Perovskite Microcavities","authors":"Mateusz Kr\\'ol, Mitko Oldfield, Matthias Wurdack, Eliezer Estrecho,\n  Gary Beane, Yihui Hou, Andrew G. Truscott, Agustin Schiffrin, Elena A.\n  Ostrovskaya","authorsParsed":[["Król","Mateusz",""],["Oldfield","Mitko",""],["Wurdack","Matthias",""],["Estrecho","Eliezer",""],["Beane","Gary",""],["Hou","Yihui",""],["Truscott","Andrew G.",""],["Schiffrin","Agustin",""],["Ostrovskaya","Elena A.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 02:27:04 GMT"}],"updateDate":"2024-07-26","timestamp":1721874424000,"abstract":"  Exciton-polariton condensation in direct bandgap semiconductors strongly\ncoupled to light enables a broad range of fundamental studies and applications\nlike low-threshold and electrically driven lasing. Yet, materials hosting\nexciton-polariton condensation in ambient conditions are rare, with fabrication\nprotocols that are often inefficient and non-scalable. Here, room-temperature\nexciton-polariton condensation and lasing is observed in a microcavity with\nembedded formamidiniumlead bromide (FAPbBr$_3$) perovskite film. This optically\nactive material is spin-coated onto the microcavity mirror, which makes the\nwhole device scalable up to large lateral sizes. The sub-$\\mu$m granulation of\nthe polycrystalline FAPbBr$_3$ film allows for observation of polariton lasing\nin a single quantum-confined mode of a polaritonic 'quantum dot'. Compared to\nrandom photon lasing, observed in bare FAPbBr$_3$ films, polariton lasing\nexhibits a lower threshold, narrower linewidth, and an order of magnitude\nlonger coherence time. Both polariton and random photon lasing are observed\nunder the conditions of pulsed optical pumping, and persist without significant\ndegradation for up to 6 and 17 hours of a continuous experimental run,\nrespectively. This study demonstrates the excellent potential of the FAPbBr$_3$\nperovskite as a new material for room-temperature polaritonics, with the added\nvalue of efficient and scalable fabrication offered by the solution-based\nspin-coating process.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WFHK9ctrQZ9yJEZdpGRPAey9t4RF_TVOZR0sw897Mz0","pdfSize":"16978909"}
