{"id":"2407.21486","title":"TinyBird-ML: An ultra-low Power Smart Sensor Node for Bird Vocalization\n  Analysis and Syllable Classification","authors":"Lukas Schulthess, Steven Marty, Matilde Dirodi, Mariana D. Rocha,\n  Linus R\\\"uttimann, Richard H. R. Hahnloser, Michele Magno","authorsParsed":[["Schulthess","Lukas",""],["Marty","Steven",""],["Dirodi","Matilde",""],["Rocha","Mariana D.",""],["Rüttimann","Linus",""],["Hahnloser","Richard H. R.",""],["Magno","Michele",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 09:50:49 GMT"}],"updateDate":"2024-08-01","timestamp":1722419449000,"abstract":"  Animal vocalisations serve a wide range of vital functions. Although it is\npossible to record animal vocalisations with external microphones, more\ninsights are gained from miniature sensors mounted directly on animals' backs.\nWe present TinyBird-ML; a wearable sensor node weighing only 1.4 g for\nacquiring, processing, and wirelessly transmitting acoustic signals to a host\nsystem using Bluetooth Low Energy. TinyBird-ML embeds low-latency tiny machine\nlearning algorithms for song syllable classification. To optimize battery\nlifetime of TinyBird-ML during fault-tolerant continuous recordings, we present\nan efficient firmware and hardware design. We make use of standard lossy\ncompression schemes to reduce the amount of data sent over the Bluetooth\nantenna, which increases battery lifetime by 70% without negative impact on\noffline sound analysis. Furthermore, by not transmitting signals during silent\nperiods, we further increase battery lifetime. One advantage of our sensor is\nthat it allows for closed-loop experiments in the microsecond range by\nprocessing sounds directly on the device instead of streaming them to a\ncomputer. We demonstrate this capability by detecting and classifying song\nsyllables with minimal latency and a syllable error rate of 7%, using a\nlight-weight neural network that runs directly on the sensor node itself.\nThanks to our power-saving hardware and software design, during continuous\noperation at a sampling rate of 16 kHz, the sensor node achieves a lifetime of\n25 hours on a single size 13 zinc-air battery.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}