{"id":"2407.11597","title":"Bayesian Emulation of Geotechnical Deterioration Curves Using Quadratic\n  and B-Spline Hierarchical Models","authors":"Jordan L. Oakley, Aleksandra Svalova, Peter Helm, Mohamed Rouainia,\n  Stephanie Glendinning, Dennis Prangle, Darren Wilkinson","authorsParsed":[["Oakley","Jordan L.",""],["Svalova","Aleksandra",""],["Helm","Peter",""],["Rouainia","Mohamed",""],["Glendinning","Stephanie",""],["Prangle","Dennis",""],["Wilkinson","Darren",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 10:53:28 GMT"}],"updateDate":"2024-07-17","timestamp":1721127208000,"abstract":"  The stability of geotechnical infrastructure assets, such as cuttings and\nembankments, is crucial to the safe and efficient delivery of transport\nservices. The successful emulation of geotechnical models of deterioration of\ninfrastructure slopes has the potential to inform slope design, maintenance and\nremediation by introducing the time dependency of deterioration into\ngeotechnical asset management. We have performed computer experiments of\ndeterioration, measured by the factor of safety (FoS), for a set of cutting\nslope geometries and soil properties that are common in the southern UK. Whilst\ncomputer experiments are an extremely useful and cost-effective method of\nbetter understanding deterioration mechanisms, it would not be practical to run\nenough experiments to understand relations between high-dimensional inputs and\noutputs. Therefore, we trained a fully-Bayesian Gaussian process emulator using\nan ensemble of 75 computer experiments to predict the FoS. We construct two\ndifferent emulator models, one approximating the FoS temporal evolution with a\nquadratic model and one approximating the temporal evolution with a B-spline\nmodel; and we emulated their parameters. We also compare the ability of our\nmodels to predict failure time. The developed models could be used to inform\ninfrastructure cutting slope design and management, and extend serviceable\nlife.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NmZlpie7PUhxAV9ySUM5nN9zBreawYtjLdKQG1sFtNI","pdfSize":"1423760","objectId":"0x643175cad6a2466e94fb694850e92150a9c6e87cafb5da907d5762d90fe06d30","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
