{"id":"2407.13152","title":"Composable Generation Strategy Framework Enabled Bidirectional Design on\n  Topological Circuits","authors":"Xi Chen, Jinyang Sun, Xiumei Wang, Maoxin Chen, Qingyuan Lin, Minggang\n  Xia, and Xingping Zhou","authorsParsed":[["Chen","Xi",""],["Sun","Jinyang",""],["Wang","Xiumei",""],["Chen","Maoxin",""],["Lin","Qingyuan",""],["Xia","Minggang",""],["Zhou","Xingping",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 04:41:24 GMT"}],"updateDate":"2024-07-19","timestamp":1721277684000,"abstract":"  Topological insulators show important properties, such as topological phase\ntransitions and topological edge states. Although these properties and\nphenomena can be simulated by well-designed circuits, it is undoubtedly\ndifficult to design such topological circuits due to the complex physical\nprinciples and calculations involved. Therefore, achieving a framework that can\nautomatically to complete bidirectional design of topology circuits is very\nsignificant. Here, we propose an effective bidirectional collaborative design\nframework with strong task adaptability, which can automatically generate\nspecific results according to our requirements. In the framework, a composable\ngeneration strategy is employed, which involves building a shared multimodal\nspace by bridging alignment in the diffusion process. For simplicity, a series\nof two-dimensional (2D) Su-Schrieffer-Heeger (SSH) circuits are constructed\nwith different structural parameters. The framework at first is applied to find\nthe relationship between the structural information and topological features.\nThen, the correctness of the results through experimental measurements can be\nverified by the automatically generated circuit diagram following the\nmanufacture of Printed Circuit Board (PCB). The framework is demonstrated by\nachieving good results in the reverse design of circuit structures and forward\nprediction of topological edge states, reaching an accuracy of 94%. Overall,\nour research demonstrates the enormous potential of the proposed bidirectional\ndeep learning framework in complex tasks and provides insights for\ncollaborative design tasks.\n","subjects":["Physics/Applied Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}