{"id":"2407.07709","title":"Motion simulation of radio-labeled cells in whole-body positron emission\n  tomography","authors":"Nils Marquardt, Tobias Hengsbach, Marco Mauritz, Benedikt Wirth, Klaus\n  Sch\\\"afers","authorsParsed":[["Marquardt","Nils",""],["Hengsbach","Tobias",""],["Mauritz","Marco",""],["Wirth","Benedikt",""],["Schäfers","Klaus",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 14:39:30 GMT"}],"updateDate":"2024-07-11","timestamp":1720622370000,"abstract":"  Cell tracking is a subject of active research gathering great interest in\nmedicine and biology. Positron emission tomography (PET) is well suited for\ntracking radio-labeled cells in vivo due to its exceptional sensitivity and\nwhole-body capability. For validation, ground-truth data is desirable that\nrealistically mimics the flow of cells in a clinical situation. This study\ndevelops a workflow (CeFloPS) for simulating moving radio-labeled cells in a\nhuman phantom. From the XCAT phantom, the blood vessels are reduced to nodal\nnetworks along which cells can move and distribute to organs and tissues. The\nmovement is directed by the blood flow which is calculated in each node using\nthe Hagen-Poiseuille equation and Kirchhoffs laws assuming laminar flow. Organs\nare voxelized and movement of cells from artery entry to vein exit is generated\nvia a biased 3D random walk. The probabilities of whether cells move or stay in\ntissues are derived from rate constants of physiologically based compartment\nmodeling. PET listmode data is generated using the Monte-Carlo simulation\nframework GATE based on the definition of a large-body PET scanner with cell\npaths as moving radioactive sources and the XCAT phantom providing attenuation\ndata. From the flow simulation of 10000 cells, 100 sample cells were further\nprocessed by GATE and listmode data was reconstructed into images for\ncomparison. As demonstrated by comparisons of simulated and reconstructed cell\ndistributions, CeFloPS can realistically simulate the cell behavior of\nwhole-body PET providing valuable data for development and validation of cell\ntracking algorithms.\n","subjects":["Physics/Medical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}