{"id":"2407.12174","title":"Non-thermal Observations of a Flare Loop-top using IRIS Fe XXI:\n  Implications for Turbulence and Electron Acceleration","authors":"William Ashfield IV, Vanessa Polito, Sijie Yu, Hannah Collier, and\n  Laura Hayes","authorsParsed":[["Ashfield","William","IV"],["Polito","Vanessa",""],["Yu","Sijie",""],["Collier","Hannah",""],["Hayes","Laura",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 20:57:43 GMT"}],"updateDate":"2024-07-18","timestamp":1721163463000,"abstract":"  The excess broadening of high-temperature spectral lines, long observed near\nthe tops of flare arcades, is widely considered to result from\nmagnetohydrodynamic (MHD) turbulence. According to different theories, plasma\nturbulence is also believed to be a candidate mechanism for particle\nacceleration during solar flares. However, the degree to which this broadening\nis connected to the acceleration of non-thermal electrons remains largely\nunexplored outside of recent work, and many observations have been limited by\nlimited spatial resolution and cadence. Using the Interface Region Imaging\nSpectrometer (IRIS), we present spatially resolved observations of loop-top\nbroadenings using hot (11MK) Fe XXI 1354.1 \\r{A} line emission at ~9s cadence\nduring the 2022 March 30 X1.3 flare. We find non-thermal velocities upwards of\n65km/s that decay linearly with time, indicating the presence and subsequent\ndissipation of plasma turbulence. Moreover, the initial Fe XXI signal was found\nto be co-spatial and co-temporal with microwave emission measured by the\nExpanded Owens Valley Solar Array (EOVSA), placing a population of non-thermal\nelectrons in the same region as the loop-top turbulence. Evidence of electron\nacceleration at this time is further supported by hard X-ray measurements from\nthe Spectrometer/Telescope for Imaging X-rays (STIX) aboard Solar Orbiter.\nUsing the decay of non-thermal broadenings as a proxy for turbulent\ndissipation, we found the rate of energy dissipation to be consistent with the\npower of non-thermal electrons deposited into the chromosphere, suggesting a\npossible connection between turbulence and electron acceleration.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}