{"id":"2407.13725","title":"Scalable Optimization for Locally Relevant Geo-Location Privacy","authors":"Chenxi Qiu, Ruiyao Liu, Primal Pappachan, Anna Squicciarini, Xinpeng\n  Xie","authorsParsed":[["Qiu","Chenxi",""],["Liu","Ruiyao",""],["Pappachan","Primal",""],["Squicciarini","Anna",""],["Xie","Xinpeng",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:25:08 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 03:44:28 GMT"}],"updateDate":"2024-09-02","timestamp":1721323508000,"abstract":"  Geo-obfuscation functions as a location privacy protection mechanism (LPPM),\nenabling mobile users to share obfuscated locations with servers instead of\ntheir exact locations. This technique protects users' location privacy during\nserver-side data breaches since the obfuscation process is irreversible. To\nminimize the utility loss caused by data obfuscation, linear programming (LP)\nis widely used. However, LP can face a polynomial explosion in decision\nvariables, making it impractical for large-scale geo-obfuscation applications.\nIn this paper, we propose a new LPPM called Locally Relevant Geo-obfuscation\n(LR-Geo) to optimize geo-obfuscation using LP more efficiently. This is\naccomplished by restricting the geo-obfuscation calculations for each user to\nlocally relevant (LR) locations near the user's actual location. To prevent LR\nlocations from inadvertently revealing a user's true whereabouts, users compute\nthe LP coefficients locally and upload only these coefficients to the server,\nrather than the LR locations themselves. The server then solves the LP problem\nusing the provided coefficients. Additionally, we enhance the LP framework with\nan exponential obfuscation mechanism to ensure that the obfuscation\ndistribution is indistinguishable across multiple users. By leveraging the\nconstraint structure of the LP formulation, we apply Benders' decomposition to\nfurther boost computational efficiency. Our theoretical analysis confirms that,\neven though geo-obfuscation is calculated independently for each user, it still\nadheres to geo-indistinguishability constraints across multiple users with high\nprobability. Finally, experimental results using a real-world dataset\ndemonstrate that LR-Geo outperforms existing geo-obfuscation methods in terms\nof computational time, data utility, and privacy protection.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}