{"id":"2407.09345","title":"Reconfigurable Spin-Wave Properties in Two-Dimensional Magnonic Crystals\n  Formed of Diamond and Triangular Shaped Nanomagnets","authors":"Swapnil Barman and Rajib Kumar Mitra","authorsParsed":[["Barman","Swapnil",""],["Mitra","Rajib Kumar",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 15:21:41 GMT"}],"updateDate":"2024-07-15","timestamp":1720797701000,"abstract":"  Two-dimensional ferromagnetic nanodot structures exhibit intriguing\nmagnetization dynamics and hold promise for future magnonic devices. In this\nstudy, we present a comparative experimental investigation into the\nreconfigurable magnetization dynamics of non-ellipsoidal diamond and\ntriangular-shaped nanodot structures, employing broadband ferromagnetic\nresonance spectroscopy. Our findings reveal substantial variations in the spin\nwave (SW) spectra of these structures under different bias field strengths (H)\nand angles ({\\phi}). Notably, the diamond nanodot structure exhibits a\nvariation from nearly symmetric W-shaped dispersion to a skewed dispersion and\nsubsequent transition to a discontinuous dispersion with subtle variation in\nbias field angle. On the other hand, in the triangular nanodot array a SW mode\nanti-crossing appears at {\\phi} = 15{\\deg} which is starkly modified with the\nincrease in {\\phi} to 30{\\deg}. By analyzing the static magnetic\nconfigurations, we unveil the nature of the SW spectra in these two shapes. We\nreinforce our observations with simulated spatial power and phase maps. This\nstudy underscores the critical impact of dot shape and inversion symmetry on SW\ndynamical response, highlighting the significance of selecting appropriate\nstructures and bias field strength and orientation for required\nfunctionalities. The remarkable tunability demonstrated by the magnonic\ncrystals underscores their potential suitability for future magnonic devices.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}