{"id":"2407.21083","title":"X-Ray microtomography of mercury intruded compacted clay: An insight\n  into the geometry of macropores","authors":"Shengyang Yuan, Xianfeng Liu, Yongxin Wang, Pierre Delage (NAVIER UMR\n  8205), Patrick Aimedieu, Olivier Buzzi","authorsParsed":[["Yuan","Shengyang","","NAVIER UMR\n  8205"],["Liu","Xianfeng","","NAVIER UMR\n  8205"],["Wang","Yongxin","","NAVIER UMR\n  8205"],["Delage","Pierre","","NAVIER UMR\n  8205"],["Aimedieu","Patrick",""],["Buzzi","Olivier",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 08:02:28 GMT"}],"updateDate":"2024-08-01","timestamp":1722326548000,"abstract":"  Soil properties, such as wetting collapse behavior and permeability, are\nstrongly correlated to the soil microstructure. To date, several techniques\nincluding mercury intrusion porosimetry (MIP), can be used to characterize the\nmicrostructure of soil, but all techniques have their own limitations. In this\nstudy, the features of mercury that penetrated and has been entrapped in the\npore network of the specimens through MIP testing were investigated by X-Ray\nmicrotomography (X-$\\mu$CT), in order to give an insight into the geometry of\nmacropores and possible ink-bottle geometry. Two conditions of water content\nand density were selected for the compacted Maryland clay. The distribution and\ngeometry features of mercury entrapped in the microstructure after MIP were\ncharacterized and pore size distributions were also reconstructed. The results\nsuggest that, for the two conditions studied in this paper, macropores were\nevenly distributed within the specimens, and most of them with a non-spherical\nshape, and with aspect ratio (ratio between the maximum and minimum thickness\nalong a given segment) smaller than three. Different dominant entrance pore\nsize of macropore was obtained from MIP and X-$\\mu$CT, due to the specific\nexperimental protocol used in tests and the effect of ink-bottle geometry. Only\nthe large pore bodies with high aspect ratio were imaged in X-$\\mu$CT, due to\nthe extrusion of mercury during the process of depressurization and subsequent\nsample preparation for X- $\\mu$CT. But entire pore space was accessible in MIP.\nThe difference in dominant entrance pore size was more significant for\nspecimens with lower void ratio due to a more pronounced aspect ratio.\n","subjects":["Condensed Matter/Materials Science","Physics/Classical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}