{"id":"2407.03142","title":"Closing Pandora's Box -- The deepest X-ray observations of Abell 2744\n  and a multi-wavelength merger picture","authors":"Urmila Chadayammuri, \\'Akos Bogd\\'an, Gerrit Schellenberger and John\n  ZuHone","authorsParsed":[["Chadayammuri","Urmila",""],["Bogdán","Ákos",""],["Schellenberger","Gerrit",""],["ZuHone","John",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 14:21:27 GMT"}],"updateDate":"2024-07-04","timestamp":1720016487000,"abstract":"  Abell 2744, also known as Pandora's Cluster, is a complex merging galaxy\ncluster. While a major merger is clear along the north-south axis, the\ndynamical state of the northwest subcluster has been highly uncertain. We\npresent ultra-deep ($\\approx$2.1 Ms) X-ray observations of Abell 2744 obtained\nwith the Chandra X-ray Observatory and reinterpret the multi-wavelength picture\nwith a suite of idealised simulations of galaxy cluster mergers. The new data\nreveal in unprecedented detail the disruption of cool cores in the three X-ray\nluminous subclusters and confirm the presence of a shock to the NW. A\nposition-velocity clustering of the cluster member galaxies shows a clearly\nseparated S2 component, with a $\\Delta z$ implying a separation of 53 Mpc or a\nline-of-sight velocity of $4500\\ \\rm{km \\ s^{-1}}$, or likely some combination\nof the two. While binary simulations allow NW to have undergone a gravitational\nslingshot after the first pericenter passage, triple merger simulations rule\nout this scenario, because the two mergers would have had to occur $\\sim$0.5\nGyr apart, and the joint impact of the shocks from the two mergers would\ncompletely disrupt the SE and NW cool cores; they only reform after 1-2 Gyr, by\nwhich point the core separations greatly exceed observations. The scenario that\nbest describes Abell 2744 is a head-on N-S merger $0.5-0.6$ Gyrs ago followed\nby a first infall of the NW subcluster. Furthermore, we note that a model with\nthree cluster-size halos, with masses consistent with gravitational lensing\nconstraints, nevertheless produces a lensing convergence and surface brightness\nlower than observed in most of the field of view, whereas the temperatures are\nconsistent with observations. This suggests the presence of a large-scale\noverdensity, which contributes to the diffuse emission and total surface\ndensity without heating the densest gas.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7Kuq53SV5l9Ibko2LhkM8PRMTHQb8l9hEIHoy7YcwAY","pdfSize":"4613139"}
