{"id":"2407.03463","title":"Precision at Scale: Domain-Specific Datasets On-Demand","authors":"Jes\\'us M Rodr\\'iguez-de-Vera, Imanol G Estepa, Ignacio Saras\\'ua,\n  Bhalaji Nagarajan, Petia Radeva","authorsParsed":[["Rodríguez-de-Vera","Jesús M",""],["Estepa","Imanol G",""],["Sarasúa","Ignacio",""],["Nagarajan","Bhalaji",""],["Radeva","Petia",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 19:17:42 GMT"}],"updateDate":"2024-07-08","timestamp":1720034262000,"abstract":"  In the realm of self-supervised learning (SSL), conventional wisdom has\ngravitated towards the utility of massive, general domain datasets for\npretraining robust backbones. In this paper, we challenge this idea by\nexploring if it is possible to bridge the scale between general-domain datasets\nand (traditionally smaller) domain-specific datasets to reduce the current\nperformance gap. More specifically, we propose Precision at Scale (PaS), a\nnovel method for the autonomous creation of domain-specific datasets on-demand.\nThe modularity of the PaS pipeline enables leveraging state-of-the-art\nfoundational and generative models to create a collection of images of any\ngiven size belonging to any given domain with minimal human intervention.\nExtensive analysis in two complex domains, proves the superiority of PaS\ndatasets over existing traditional domain-specific datasets in terms of\ndiversity, scale, and effectiveness in training visual transformers and\nconvolutional neural networks. Most notably, we prove that automatically\ngenerated domain-specific datasets lead to better pretraining than large-scale\nsupervised datasets such as ImageNet-1k and ImageNet-21k. Concretely, models\ntrained on domain-specific datasets constructed by PaS pipeline, beat\nImageNet-1k pretrained backbones by at least 12% in all the considered domains\nand classification tasks and lead to better food domain performance than\nsupervised ImageNet-21k pretrain while being 12 times smaller. Code repository:\nhttps://github.com/jesusmolrdv/Precision-at-Scale/\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}