{"id":"2407.08111","title":"Embodying Control in Soft Multistable Grippers from morphofunctional\n  co-design","authors":"Juan C. Osorio (1), Jhonatan S. Rincon (1), Harith Morgan (1), Andres\n  F. Arrieta (1) ((1) School of Mechanical Engineering, Purdue University, West\n  Lafayette, USA)","authorsParsed":[["Osorio","Juan C.",""],["Rincon","Jhonatan S.",""],["Morgan","Harith",""],["Arrieta","Andres F.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 01:03:55 GMT"}],"updateDate":"2024-07-12","timestamp":1720659835000,"abstract":"  Soft robots are distinguished by their flexible and adaptable, allowing them\nto perform tasks that are nearly impossible for rigid robots. However,\ncontrolling their configuration is challenging due to their nonlinear material\nresponse and infinite deflection degrees of freedom. A potential solution is to\ndiscretize the infinite-dimensional configuration space of soft robots into a\nfinite but sufficiently large number of functional shapes. This study explores\na co-design strategy for pneumatically actuated soft grippers with multiple\nencoded stable states, enabling desired functional shape and stiffness\nreconfiguration. An energy based analytical model for soft multistable grippers\nis presented, mapping the robots' infinite-dimensional configuration space into\ndiscrete stable states, allowing for prediction of the systems final state and\ndynamic behavior. Our approach introduces a general method to capture the soft\nrobots' response with the lattice lumped parameters using automatic relevance\ndetermination regression, facilitating inverse co-design. The resulting\ncomputationally efficient model enables us to explore the configuration space\nin a tractable manner, allowing the inverse co-design of our robots by setting\ndesired targeted positions with optimized stiffness of the set targets. This\nstrategy offers a framework for controlling soft robots by exploiting the\nnonlinear mechanics of multistable structures, thus embodying mechanical\nintelligence into soft structures.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"7ArOQIVYa3-etM4vzKNE6dDA00PImFomLSXN5E5On84","pdfSize":"25314073"}
