{"id":"2407.03441","title":"MotifbreakR v2: extended capability and database integration","authors":"Simon G. Coetzee and Dennis J. Hazelett","authorsParsed":[["Coetzee","Simon G.",""],["Hazelett","Dennis J.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:34:03 GMT"}],"updateDate":"2024-07-08","timestamp":1720031643000,"abstract":"  MotifbreakR is a software tool that scans genetic variants against position\nweight matrices of transcription factors (TF) to determine the potential for\nthe disruption of TF binding at the site of the variant. It leverages the\nBioconductor suite of software packages and annotations to operate across a\ndiverse array of genomes and motif databases. Initially developed to\ninterrogate the effect of single nucleotide variants (common and rare SNVs) on\npotential TF binding sites, in motifbreakR v2, we have updated the\nfunctionality. New features include the ability to query other types of more\ncomplex genetic variants, such as short insertions and deletions (indels). This\nfunction allows modeling a more extensive array of variants that may have more\nsignificant effects on TF binding. Additionally, while TF binding is based\npartly on sequence preference, predictions of TF binding based on sequence\npreference alone can indicate many more potential binding events than observed.\nAdding information from DNA-binding sequencing datasets lends confidence to\nmotif disruption prediction by demonstrating TF binding in cell lines and\ntissue types. Therefore, motifbreakR implements querying the ReMap2022 database\nfor evidence that a TF matching the disrupted motif binds over the disrupting\nvariant. Finally, in motifbreakR, in addition to the existing interface, we\nhave implemented an R/Shiny graphical user interface to simplify and enhance\naccess to researchers with different skill sets.\n","subjects":["Quantitative Biology/Genomics","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}