{"id":"2407.10080","title":"Design and Optimization on Successive RIS-assisted Multi-hop Wireless\n  Communications","authors":"Rujing Xiong, Jialong Lu, Jianan Zhang, Minggang Liu, Xuehui Dong,\n  Tiebin Mi, Robert Caiming Qiu","authorsParsed":[["Xiong","Rujing",""],["Lu","Jialong",""],["Zhang","Jianan",""],["Liu","Minggang",""],["Dong","Xuehui",""],["Mi","Tiebin",""],["Qiu","Robert Caiming",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 05:00:54 GMT"}],"updateDate":"2024-07-16","timestamp":1720933254000,"abstract":"  As an emerging wireless communication technology, reconfigurable intelligent\nsurface (RIS) has become a basic choice for providing signal coverage services\nin scenarios with dense obstacles or long tunnels through multi-hop\nconfigurations. Conventional works of literature mainly focus on alternating\noptimization or single-beam calculation in RIS phase configuration, which is\nlimited in considering energy efficiency, and often suffers from inaccurate\nchannel state information (CSI), poor convergence, and high computational\ncomplexity. This paper addresses the design and optimization challenges for\nsuccessive RIS-assisted multi-hop systems. Specifically, we establish a general\nmodel for multi-hop communication based on the relationship between the input\nand output electric fields within each RIS. Meanwhile, we derive the half-power\nbeamwidth of the RIS-reflected beams, considering the beam direction.\nLeveraging these models and derivations, we propose deployment optimization and\nbeam optimization strategies for multi-hop systems, which feature high aperture\nefficiency and significant gains in signal power. Simulation and prototype\nexperiment results validate the effectiveness and superiority of the proposed\nsystems and methods.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}