{"id":"2407.12195","title":"CLUE: Safe Model-Based RL HVAC Control Using Epistemic Uncertainty\n  Estimation","authors":"Xianzhong Ding, Zhiyu An, Arya Rathee, and Wan Du","authorsParsed":[["Ding","Xianzhong",""],["An","Zhiyu",""],["Rathee","Arya",""],["Du","Wan",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 21:43:09 GMT"}],"updateDate":"2024-07-18","timestamp":1721166189000,"abstract":"  Model-Based Reinforcement Learning (MBRL) has been widely studied for\nHeating, Ventilation, and Air Conditioning (HVAC) control in buildings. One of\nthe critical challenges is the large amount of data required to effectively\ntrain neural networks for modeling building dynamics. This paper presents CLUE,\nan MBRL system for HVAC control in buildings. CLUE optimizes HVAC operations by\nintegrating a Gaussian Process (GP) model to model building dynamics with\nuncertainty awareness. CLUE utilizes GP to predict state transitions as\nGaussian distributions, effectively capturing prediction uncertainty and\nenhancing decision-making under sparse data conditions. Our approach employs a\nmeta-kernel learning technique to efficiently set GP kernel hyperparameters\nusing domain knowledge from diverse buildings. This drastically reduces the\ndata requirements typically associated with GP models in HVAC applications.\nAdditionally, CLUE incorporates these uncertainty estimates into a Model\nPredictive Path Integral (MPPI) algorithm, enabling the selection of safe,\nenergy-efficient control actions. This uncertainty-aware control strategy\nevaluates and selects action trajectories based on their predicted impact on\nenergy consumption and human comfort, optimizing operations even under\nuncertain conditions. Extensive simulations in a five-zone office building\ndemonstrate that CLUE reduces the required training data from hundreds of days\nto just seven while maintaining robust control performance. It reduces comfort\nviolations by an average of 12.07% compared to existing MBRL methods, without\ncompromising on energy efficiency.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}