{"id":"2407.12177","title":"Are Linear Regression Models White Box and Interpretable?","authors":"Ahmed M Salih and Yuhe Wang","authorsParsed":[["Salih","Ahmed M",""],["Wang","Yuhe",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 21:05:51 GMT"}],"updateDate":"2024-07-18","timestamp":1721163951000,"abstract":"  Explainable artificial intelligence (XAI) is a set of tools and algorithms\nthat applied or embedded to machine learning models to understand and interpret\nthe models. They are recommended especially for complex or advanced models\nincluding deep neural network because they are not interpretable from human\npoint of view. On the other hand, simple models including linear regression are\neasy to implement, has less computational complexity and easy to visualize the\noutput. The common notion in the literature that simple models including linear\nregression are considered as \"white box\" because they are more interpretable\nand easier to understand. This is based on the idea that linear regression\nmodels have several favorable outcomes including the effect of the features in\nthe model and whether they affect positively or negatively toward model output.\nMoreover, uncertainty of the model can be measured or estimated using the\nconfidence interval. However, we argue that this perception is not accurate and\nlinear regression models are not easy to interpret neither easy to understand\nconsidering common XAI metrics and possible challenges might face. This\nincludes linearity, local explanation, multicollinearity, covariates,\nnormalization, uncertainty, features contribution and fairness. Consequently,\nwe recommend the so-called simple models should be treated equally to complex\nmodels when it comes to explainability and interpretability.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qsYLstZyLEEA2-ZrqGU-GIVLs_yd6D5ZbDiqbcdTyFo","pdfSize":"870573","objectId":"0xd23cfb41a19eafaebfd40cc14d9c7f4ca48331e8e3934bbbbf93accf17d4f85f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
