{"id":"2407.18273","title":"$K$-theory classification of Wannier localizability and detachable\n  topological boundary states","authors":"Ken Shiozaki, Daichi Nakamura, Kenji Shimomura, Masatoshi Sato, Kohei\n  Kawabata","authorsParsed":[["Shiozaki","Ken",""],["Nakamura","Daichi",""],["Shimomura","Kenji",""],["Sato","Masatoshi",""],["Kawabata","Kohei",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 07:27:41 GMT"}],"updateDate":"2024-07-29","timestamp":1721719661000,"abstract":"  A hallmark of certain topology, including the Chern number, is the\nobstruction to constructing exponentially localized Wannier functions in the\nbulk bands. Conversely, other types of topology do not necessarily impose\nWannier obstructions. Remarkably, such Wannier-localizable topological\ninsulators can host boundary states that are detachable from the bulk bands. In\nour accompanying Letter (D. Nakamura et al., arXiv:2407.09458), we demonstrate\nthat non-Hermitian topology underlies detachable boundary states in Hermitian\ntopological insulators and superconductors, thereby establishing their tenfold\nclassification based on internal symmetry. Here, using $K$-theory, we elucidate\nthe relationship between Wannier localizability and detachability of\ntopological boundary states. From the boundary perspective, we classify\nintrinsic and extrinsic non-Hermitian topology, corresponding to nondetachable\nand detachable topological boundary states, respectively. From the bulk\nperspective, on the other hand, we classify Wannier localizability through the\nhomomorphisms of topological phases from the tenfold Altland-Zirnbauer symmetry\nclasses to the threefold Wigner-Dyson symmetry classes. Notably, these two\napproaches from the boundary and bulk perspectives lead to the same\nclassification. We clarify this agreement and develop a unified understanding\nof the bulk-boundary correspondence on the basis of $K$-theory.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"s7LaNrra2WZFjDMfU5XWFR1qSGgMgVmTV22hCwtyyTY","pdfSize":"1052237","objectId":"0xe12ec9fbdb5b077a337d90730441544057d0fe16f02259b664855845c1264d4a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
