{"id":"2407.00935","title":"Look Ahead or Look Around? A Theoretical Comparison Between\n  Autoregressive and Masked Pretraining","authors":"Qi Zhang, Tianqi Du, Haotian Huang, Yifei Wang, Yisen Wang","authorsParsed":[["Zhang","Qi",""],["Du","Tianqi",""],["Huang","Haotian",""],["Wang","Yifei",""],["Wang","Yisen",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 03:35:59 GMT"}],"updateDate":"2024-07-02","timestamp":1719804959000,"abstract":"  In recent years, the rise of generative self-supervised learning (SSL)\nparadigms has exhibited impressive performance across visual, language, and\nmulti-modal domains. While the varied designs of generative SSL objectives lead\nto distinct properties in downstream tasks, a theoretical understanding of\nthese differences remains largely unexplored. In this paper, we establish the\nfirst theoretical comparisons between two leading generative SSL paradigms:\nautoregressive SSL and masked SSL. Through establishing theoretical frameworks,\nwe elucidate the strengths and limitations of autoregressive and masked SSL\nwithin the primary evaluation tasks of classification and content generation.\nOur findings demonstrate that in classification tasks, the flexibility of\ntargeted tokens in masked SSL fosters more inter-sample connections compared to\nthe fixed position of target tokens in autoregressive SSL, which yields\nsuperior clustering performance. In content generation tasks, the misalignment\nbetween the flexible lengths of test samples and the fixed length of unmasked\ntexts in masked SSL (vs. flexible lengths of conditional texts in\nautoregressive SSL) hinders its generation performance. To leverage each\nother's strengths and mitigate weaknesses, we propose diversity-enhanced\nautoregressive and variable-length masked objectives, which substantially\nimprove the classification performance of autoregressive SSL and the generation\nperformance of masked SSL. Code is available at\nhttps://github.com/PKU-ML/LookAheadLookAround.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"19lTgrMJOz3PipW4HalLFQ0nGpj2o9HMcY2cfnMVL0c","pdfSize":"1667104"}
