{"id":"2407.21751","title":"Discovery of 6G Services and Resources in Edge-Cloud-Continuum","authors":"Mohammad Farhoudi, Masoud Shokrnezhad, Tarik Taleb, Richard Li, and\n  JaeSeung Song","authorsParsed":[["Farhoudi","Mohammad",""],["Shokrnezhad","Masoud",""],["Taleb","Tarik",""],["Li","Richard",""],["Song","JaeSeung",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 17:15:51 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 15:45:42 GMT"}],"updateDate":"2024-08-09","timestamp":1722446151000,"abstract":"  The advent of 6G networks will present a pivotal juncture in the evolution of\ntelecommunications, marked by the proliferation of devices, dynamic service\nrequests, and the integration of edge and cloud computing. In response to these\ntransformative shifts, this paper proposes a service and resource discovery\narchitecture as part of service provisioning for the future 6G\nedge-cloud-continuum. Through the architecture's orchestration and platform\ncomponents, users will have access to services efficiently and on time.\nBlockchain underpins trust in this inherently trustless environment, while\nsemantic networking dynamically extracts context from service requests,\nfostering efficient communication and service delivery. A key innovation lies\nin dynamic overlay zoning, which not only optimizes resource allocation but\nalso endows our architecture with scalability, adaptability, and resilience.\nNotably, our architecture excels at predictive capabilities, harnessing\nlearning algorithms to anticipate user and service instance behavior, thereby\nenhancing network responsiveness and preserving service continuity. This\ncomprehensive architecture paves the way for unparalleled resource\noptimization, latency reduction, and seamless service delivery, positioning it\nas an instrumental pillar in the unfolding 6G landscape. Simulation results\nshow that our architecture provides near-optimal timely responses that\nsignificantly improve the network's potential, offering scalable and efficient\nservice and resource discovery.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}