{"id":"2407.08174","title":"An Adaptively Weighted Averaging Method for Regional Time Series\n  Extraction of fMRI-based Brain Decoding","authors":"Jianfei Zhu, Baichun Wei, Jiaru Tian, Feng Jiang, and Chunzhi Yi","authorsParsed":[["Zhu","Jianfei",""],["Wei","Baichun",""],["Tian","Jiaru",""],["Jiang","Feng",""],["Yi","Chunzhi",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 04:31:28 GMT"}],"updateDate":"2024-07-12","timestamp":1720672288000,"abstract":"  Brain decoding that classifies cognitive states using the functional\nfluctuations of the brain can provide insightful information for understanding\nthe brain mechanisms of cognitive functions. Among the common procedures of\ndecoding the brain cognitive states with functional magnetic resonance imaging\n(fMRI), extracting the time series of each brain region after brain\nparcellation traditionally averages across the voxels within a brain region.\nThis neglects the spatial information among the voxels and the requirement of\nextracting information for the downstream tasks. In this study, we propose to\nuse a fully connected neural network that is jointly trained with the brain\ndecoder to perform an adaptively weighted average across the voxels within each\nbrain region. We perform extensive evaluations by cognitive state decoding,\nmanifold learning, and interpretability analysis on the Human Connectome\nProject (HCP) dataset. The performance comparison of the cognitive state\ndecoding presents an accuracy increase of up to 5\\% and stable accuracy\nimprovement under different time window sizes, resampling sizes, and training\ndata sizes. The results of manifold learning show that our method presents a\nconsiderable separability among cognitive states and basically excludes\nsubject-specific information. The interpretability analysis shows that our\nmethod can identify reasonable brain regions corresponding to each cognitive\nstate. Our study would aid the improvement of the basic pipeline of fMRI\nprocessing.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Quantitative Biology/Neurons and Cognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}