{"id":"2407.11463","title":"Investigating Imperceptibility of Adversarial Attacks on Tabular Data:\n  An Empirical Analysis","authors":"Zhipeng He, Chun Ouyang, Laith Alzubaidi, Alistair Barros, Catarina\n  Moreira","authorsParsed":[["He","Zhipeng",""],["Ouyang","Chun",""],["Alzubaidi","Laith",""],["Barros","Alistair",""],["Moreira","Catarina",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 07:55:25 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 03:48:56 GMT"}],"updateDate":"2024-08-22","timestamp":1721116525000,"abstract":"  Adversarial attacks are a potential threat to machine learning models by\ncausing incorrect predictions through imperceptible perturbations to the input\ndata. While these attacks have been extensively studied in unstructured data\nlike images, applying them to tabular data, poses new challenges. These\nchallenges arise from the inherent heterogeneity and complex feature\ninterdependencies in tabular data, which differ from the image data. To account\nfor this distinction, it is necessary to establish tailored imperceptibility\ncriteria specific to tabular data. However, there is currently a lack of\nstandardised metrics for assessing the imperceptibility of adversarial attacks\non tabular data. To address this gap, we propose a set of key properties and\ncorresponding metrics designed to comprehensively characterise imperceptible\nadversarial attacks on tabular data. These are: proximity to the original\ninput, sparsity of altered features, deviation from the original data\ndistribution, sensitivity in perturbing features with narrow distribution,\nimmutability of certain features that should remain unchanged, feasibility of\nspecific feature values that should not go beyond valid practical ranges, and\nfeature interdependencies capturing complex relationships between data\nattributes. We evaluate the imperceptibility of five adversarial attacks,\nincluding both bounded attacks and unbounded attacks, on tabular data using the\nproposed imperceptibility metrics. The results reveal a trade-off between the\nimperceptibility and effectiveness of these attacks. The study also identifies\nlimitations in current attack algorithms, offering insights that can guide\nfuture research in the area. The findings gained from this empirical analysis\nprovide valuable direction for enhancing the design of adversarial attack\nalgorithms, thereby advancing adversarial machine learning on tabular data.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}