{"id":"2407.00885","title":"Impact of Co-Excipient Selection on Hydrophobic Polymer Folding:\n  Insights for Optimal Formulation Design","authors":"Jonathan W. P. Zajac, Praveen Muralikrishnan, Caryn L. Heldt, Sarah L.\n  Perry, and Sapna Sarupria","authorsParsed":[["Zajac","Jonathan W. P.",""],["Muralikrishnan","Praveen",""],["Heldt","Caryn L.",""],["Perry","Sarah L.",""],["Sarupria","Sapna",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 01:09:15 GMT"}],"updateDate":"2024-07-02","timestamp":1719796155000,"abstract":"  The stabilization of liquid biological products is a complex task that\ndepends on the chemical composition of both the active ingredient and any\nexcipients in solution. Frequently, a large number of unique excipients are\nrequired to stabilize biologics, though it is not well-known how these\nexcipients interact with one another. To probe these excipient-excipient\ninteractions, we performed molecular dynamics simulations of arginine -- a\nwidely used excipient with unique properties -- in solution either alone or\nwith equimolar lysine or glutamate. We studied the effects of these mixtures on\na hydrophobic polymer model to isolate excipient mechanisms on hydrophobic\ninteractions, relevant to both protein folding and biomolecular self-assembly.\nWe observed that arginine is the most effective single excipient in stabilizing\nhydrophobic polymer collapse, and its effectiveness can be augmented by lysine\nor glutamate addition. We utilized a decomposition of the potential of mean\nforce to identify that the key source of arginine-lysine and arginine-glutamate\nsynergy on polymer collapse is a reduction in attractive polymer-excipient\ndirect interactions. Further, we applied principles from network theory to\ncharacterize the local solvent network that embeds the hydrophobic polymer.\nThrough this approach, we found that arginine enables a more highly connected\nand stable network than in pure water, lysine, or glutamate solutions.\nImportantly, these network properties are preserved when lysine or glutamate\nare added to arginine solutions. Overall, we highlight the importance of\nidentifying key molecular consequences of co-excipient selection, aiding in the\nestablishment of rational formulation design rules.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Biological Physics","Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dQtLhwZ8XjFwgZwJs3N-jbGd1_o8lKYxWBySsup-Y10","pdfSize":"10717786"}
