{"id":"2407.11877","title":"Bridging Weighted First Order Model Counting and Graph Polynomials","authors":"Qipeng Kuang, Ond\\v{r}ej Ku\\v{z}elka, Yuanhong Wang and Yuyi Wang","authorsParsed":[["Kuang","Qipeng",""],["Kuželka","Ondřej",""],["Wang","Yuanhong",""],["Wang","Yuyi",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 16:01:25 GMT"}],"updateDate":"2024-07-17","timestamp":1721145685000,"abstract":"  The Weighted First-Order Model Counting Problem (WFOMC) asks to compute the\nweighted sum of models of a given first-order logic sentence over a given\ndomain. It can be solved in time polynomial in the domain size for sentences\nfrom the two-variable fragment with counting quantifiers, known as $C^2$. This\npolynomial-time complexity is also retained when extending $C^2$ by one of the\nfollowing axioms: linear order axiom, tree axiom, forest axiom, directed\nacyclic graph axiom or connectedness axiom. An interesting question remains as\nto which other axioms can be added to the first-order sentences in this way. We\nprovide a new perspective on this problem by associating WFOMC with graph\npolynomials. Using WFOMC, we define Weak Connectedness Polynomial and Strong\nConnectedness Polynomials for first-order logic sentences. It turns out that\nthese polynomials have the following interesting properties. First, they can be\ncomputed in polynomial time in the domain size for sentences from $C^2$.\nSecond, we can use them to solve WFOMC with all of the existing axioms known to\nbe tractable as well as with new ones such as bipartiteness, strong\nconnectedness, being a spanning subgraph, having $k$ connected components, etc.\nThird, the well-known Tutte polynomial can be recovered as a special case of\nthe Weak Connectedness Polynomial, and the Strict and Non-Strict Directed\nChromatic Polynomials can be recovered from the Strong Connectedness\nPolynomials, which allows us to show that these important graph polynomials can\nbe computed in time polynomial in the number of vertices for any graph that can\nbe encoded by a fixed $C^2$ sentence and a conjunction of an arbitrary number\nof ground unary literals.\n","subjects":["Computing Research Repository/Logic in Computer Science","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}