{"id":"2407.06330","title":"Absence of Majorana oscillations in finite-length full-shell hybrid\n  nanowires","authors":"Carlos Pay\\'a, Pablo San-Jose, Carlos J. S\\'anchez Mart\\'inez, Ram\\'on\n  Aguado and Elsa Prada","authorsParsed":[["Payá","Carlos",""],["San-Jose","Pablo",""],["Martínez","Carlos J. Sánchez",""],["Aguado","Ramón",""],["Prada","Elsa",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:48:01 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 16:08:24 GMT"}],"updateDate":"2024-09-13","timestamp":1720464481000,"abstract":"  Majorana bound states (MBSs) located at the ends of a hybrid\nsuperconductor-semiconductor nanowire are only true zero modes if their\ncharacteristic localization length is much smaller than the nanowire length,\n$\\xi_M\\ll L$. Otherwise, their wave function overlap gives rise to a finite\nenergy splitting that shows a characteristic oscillatory pattern $\\sim\ne^{-2L/\\xi_M}\\cos(k_F L)$ versus external parameters that modify the Fermi\nmomentum $k_F$. Detecting such \"Majorana oscillations\", measurable through\nlow-bias conductance, has been proposed as a strategy for Majorana detection in\npristine nanowires. Here we discuss how this detection scheme does not work in\nfull-shell hybrid nanowires, an alternative design to partial-shell nanowires\nin which a superconductor shell fully wraps the semiconductor core. Using\nmicroscopic models, we provide both numerical simulations for Al/InAs hybrids\nas well as analytical approximations in terms of general nanowire parameters.\nWe find that Majorana oscillations with flux in full-shell nanowires are absent\nin a wide portion of parameter space. This absence is not a signature of\nnon-overlapping left- and right-end MBSs, but a consequence of the Majorana\noscillation period being systematically larger than the flux window of odd\nLittle-Parks lobes where Majorana zero-energy peaks are predicted to appear.\nOur results demonstrate that split near-zero modes or individual zero-energy\ncrossings should not be dismissed as trivial even if they are found not to\noscillate with flux.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}