{"id":"2407.10340","title":"Mapping the Scholarship of Dark Pattern Regulation: A Systematic Review\n  of Concepts, Regulatory Paradigms, and Solutions from an Interdisciplinary\n  Perspective","authors":"Weiwei Yi, Zihao Li","authorsParsed":[["Yi","Weiwei",""],["Li","Zihao",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 21:41:18 GMT"}],"updateDate":"2024-07-16","timestamp":1720993278000,"abstract":"  Dark patterns, design tricks used on online interfaces to manipulate users\ndecision-making process, have raised public concerns. However, research on\nregulation of dark pattern remains underdeveloped and scattered, particularly\nregarding scholars views on the concept, regulatory paradigms, and solutions.\nFollowing PRISMA guidelines, this paper systematically reviews the formats and\ncontent of regulatory discussions on dark patterns from the interdisciplinary\nscholarship of Law and Human-Computer Interaction. A total of 65 studies were\nanalysed through content and thematic analysis. This study synthesises the\nunique trends and characteristics of legal scholarship on dark patterns,\nidentifying five root problems and triple layered harms. It critiques current\nregulations in terms of legal theories and sectoral legislations, highlighting\ntheir inadequacies in addressing dark patterns. The paper also critically\nexamines existing proposed solutions, including paradigmatic shifts in legal\ndoctrines, refinements to existing frameworks, technical design-embedded\nsolutions, and accountability measures for design practices. This research\ncritically discusses the current barriers to effective dark pattern regulations\nand explores promising regulatory solutions. The difficulty in identifying the\nnormative nature of various forms of dark patterns, in identifying evident and\nactionable harm, and the expanding scope of dark patterns connotation\ninherently hinders effective regulation. However, technical design-embedded\nsolutions, accountability frameworks, and practical design guidelines offer\npotential routes for more proactive regulation, while legal pluralism stands as\na promising macro-level change in regulatory paradigms for dark pattern\nregulation.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Information Theory","Computing Research Repository/Social and Information Networks","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"H9_mkGdw2q7Wa-vPGP10kYeZgGUhl6l2Lw7SETXTchQ","pdfSize":"1134877"}
