{"id":"2407.13105","title":"Survey on Plagiarism Detection in Large Language Models: The Impact of\n  ChatGPT and Gemini on Academic Integrity","authors":"Shushanta Pudasaini and Luis Miralles-Pechu\\'an and David Lillis and\n  Marisa Llorens Salvador","authorsParsed":[["Pudasaini","Shushanta",""],["Miralles-Pechuán","Luis",""],["Lillis","David",""],["Salvador","Marisa Llorens",""]],"versions":[{"version":"v1","created":"Tue, 4 Jun 2024 09:38:03 GMT"}],"updateDate":"2024-07-19","timestamp":1717493883000,"abstract":"  The rise of Large Language Models (LLMs) such as ChatGPT and Gemini has posed\nnew challenges for the academic community. With the help of these models,\nstudents can easily complete their assignments and exams, while educators\nstruggle to detect AI-generated content. This has led to a surge in academic\nmisconduct, as students present work generated by LLMs as their own, without\nputting in the effort required for learning. As AI tools become more advanced\nand produce increasingly human-like text, detecting such content becomes more\nchallenging. This development has significantly impacted the academic world,\nwhere many educators are finding it difficult to adapt their assessment methods\nto this challenge.\n  This research first demonstrates how LLMs have increased academic dishonesty,\nand then reviews state-of-the-art solutions for academic plagiarism in detail.\nA survey of datasets, algorithms, tools, and evasion strategies for plagiarism\ndetection has been conducted, focusing on how LLMs and AI-generated content\n(AIGC) detection have affected this area. The survey aims to identify the gaps\nin existing solutions. Lastly, potential long-term solutions are presented to\naddress the issue of academic plagiarism using LLMs based on AI tools and\neducational approaches in an ever-changing world.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uyjBxRCtBQ7qwzHhf9q4j8gWocysnQ4PVZcz0zan3Qs","pdfSize":"659553"}
