{"id":"2407.00548","title":"KOROL: Learning Visualizable Object Feature with Koopman Operator\n  Rollout for Manipulation","authors":"Hongyi Chen, Abulikemu Abuduweili, Aviral Agrawal, Yunhai Han, Harish\n  Ravichandar, Changliu Liu, Jeffrey Ichnowski","authorsParsed":[["Chen","Hongyi",""],["Abuduweili","Abulikemu",""],["Agrawal","Aviral",""],["Han","Yunhai",""],["Ravichandar","Harish",""],["Liu","Changliu",""],["Ichnowski","Jeffrey",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 23:56:57 GMT"},{"version":"v2","created":"Sun, 8 Sep 2024 23:39:25 GMT"}],"updateDate":"2024-09-10","timestamp":1719705417000,"abstract":"  Learning dexterous manipulation skills presents significant challenges due to\ncomplex nonlinear dynamics that underlie the interactions between objects and\nmulti-fingered hands. Koopman operators have emerged as a robust method for\nmodeling such nonlinear dynamics within a linear framework. However, current\nmethods rely on runtime access to ground-truth (GT) object states, making them\nunsuitable for vision-based practical applications. Unlike image-to-action\npolicies that implicitly learn visual features for control, we use a dynamics\nmodel, specifically the Koopman operator, to learn visually interpretable\nobject features critical for robotic manipulation within a scene. We construct\na Koopman operator using object features predicted by a feature extractor and\nutilize it to auto-regressively advance system states. We train the feature\nextractor to embed scene information into object features, thereby enabling the\naccurate propagation of robot trajectories. We evaluate our approach on\nsimulated and real-world robot tasks, with results showing that it outperformed\nthe model-based imitation learning NDP by 1.08$\\times$ and the image-to-action\nDiffusion Policy by 1.16$\\times$. The results suggest that our method maintains\ntask success rates with learned features and extends applicability to\nreal-world manipulation without GT object states. Project video and code are\navailable at: \\url{https://github.com/hychen-naza/KOROL}.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}