{"id":"2407.17596","title":"Quality Assured: Rethinking Annotation Strategies in Imaging AI","authors":"Tim R\\\"adsch, Annika Reinke, Vivienn Weru, Minu D. Tizabi, Nicholas\n  Heller, Fabian Isensee, Annette Kopp-Schneider, Lena Maier-Hein","authorsParsed":[["Rädsch","Tim",""],["Reinke","Annika",""],["Weru","Vivienn",""],["Tizabi","Minu D.",""],["Heller","Nicholas",""],["Isensee","Fabian",""],["Kopp-Schneider","Annette",""],["Maier-Hein","Lena",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 19:02:01 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 11:26:43 GMT"}],"updateDate":"2024-07-29","timestamp":1721847721000,"abstract":"  This paper does not describe a novel method. Instead, it studies an essential\nfoundation for reliable benchmarking and ultimately real-world application of\nAI-based image analysis: generating high-quality reference annotations.\nPrevious research has focused on crowdsourcing as a means of outsourcing\nannotations. However, little attention has so far been given to annotation\ncompanies, specifically regarding their internal quality assurance (QA)\nprocesses. Therefore, our aim is to evaluate the influence of QA employed by\nannotation companies on annotation quality and devise methodologies for\nmaximizing data annotation efficacy. Based on a total of 57,648 instance\nsegmented images obtained from a total of 924 annotators and 34 QA workers from\nfour annotation companies and Amazon Mechanical Turk (MTurk), we derived the\nfollowing insights: (1) Annotation companies perform better both in terms of\nquantity and quality compared to the widely used platform MTurk. (2) Annotation\ncompanies' internal QA only provides marginal improvements, if any. However,\nimproving labeling instructions instead of investing in QA can substantially\nboost annotation performance. (3) The benefit of internal QA depends on\nspecific image characteristics. Our work could enable researchers to derive\nsubstantially more value from a fixed annotation budget and change the way\nannotation companies conduct internal QA.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LqOp1RTxRojwACG_FtIT6378FhIYLL-tTap-M0ybQrw","pdfSize":"10914608"}
