{"id":"2407.14398","title":"Exponential Quantum Advantage for Pathfinding in Regular Sunflower\n  Graphs","authors":"Jianqiang Li, Yu Tong","authorsParsed":[["Li","Jianqiang",""],["Tong","Yu",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:21:13 GMT"}],"updateDate":"2024-07-22","timestamp":1721402473000,"abstract":"  Finding problems that allow for superpolynomial quantum speedup is one of the\nmost important tasks in quantum computation. A key challenge is identifying\nproblem structures that can only be exploited by quantum mechanics. In this\npaper, we find a class of graphs that allows for exponential quantum-classical\nseparation for the pathfinding problem with the adjacency list oracle, and this\nclass of graphs is named regular sunflower graphs. We prove that, with high\nprobability, a regular sunflower graph of degree at least $7$ is a mild\nexpander graph, that is, the spectral gap of the graph Laplacian is at least\ninverse polylogarithmic in the graph size.\n  We provide an efficient quantum algorithm to find an $s$-$t$ path in the\nregular sunflower graph while any classical algorithm takes exponential time.\nThis quantum advantage is achieved by efficiently preparing a $0$-eigenstate of\nthe adjacency matrix of the regular sunflower graph as a quantum superposition\nstate over the vertices, and this quantum state contains enough information to\nhelp us efficiently find an $s$-$t$ path in the regular sunflower graph.\n  Because the security of an isogeny-based cryptosystem depends on the hardness\nof finding an $s$-$t$ path in an expander graph \\cite{Charles2009}, a quantum\nspeedup of the pathfinding problem on an expander graph is of significance. Our\nresult represents a step towards this goal as the first provable exponential\nspeedup for pathfinding in a mild expander graph.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by/4.0/"}