{"id":"2407.13329","title":"Why do you cite? An investigation on citation intents and\n  decision-making classification processes","authors":"Lorenzo Paolini (Department of Classical Philology and Italian\n  Studies, University of Bologna, Bologna, Italy), Sahar Vahdati\n  (Nature-inspired machine intelligence group, SCaDS.AI center, Technical\n  University of Dresden, Germany Institute for Applied Computer Science, InfAI\n  - Dresden, Germany), Angelo Di Iorio (Department of Computer Science and\n  Engineering, University of Bologna, Bologna, Italy), Robert Wardenga\n  (Institute for Applied Computer Science, InfAI - Dresden, Germany), Ivan\n  Heibi (Research Centre for Open Scholarly Metadata, Department of Classical\n  Philology and Italian Studies, University of Bologna, Bologna, Italy, Digital\n  Humanities Advanced Research Centre (/DH.arc), Department of Classical\n  Philology and Italian Studies, University of Bologna, Bologna, Italy), Silvio\n  Peroni (Research Centre for Open Scholarly Metadata, Department of Classical\n  Philology and Italian Studies, University of Bologna, Bologna, Italy, Digital\n  Humanities Advanced Research Centre (/DH.arc), Department of Classical\n  Philology and Italian Studies, University of Bologna, Bologna, Italy)","authorsParsed":[["Paolini","Lorenzo","","Department of Classical Philology and Italian\n  Studies, University of Bologna, Bologna, Italy"],["Vahdati","Sahar","","Nature-inspired machine intelligence group, SCaDS.AI center, Technical\n  University of Dresden, Germany Institute for Applied Computer Science, InfAI\n  - Dresden, Germany"],["Di Iorio","Angelo","","Department of Computer Science and\n  Engineering, University of Bologna, Bologna, Italy"],["Wardenga","Robert","","Institute for Applied Computer Science, InfAI - Dresden, Germany"],["Heibi","Ivan","","Research Centre for Open Scholarly Metadata, Department of Classical\n  Philology and Italian Studies, University of Bologna, Bologna, Italy, Digital\n  Humanities Advanced Research Centre"],["Peroni","Silvio","","Research Centre for Open Scholarly Metadata, Department of Classical\n  Philology and Italian Studies, University of Bologna, Bologna, Italy, Digital\n  Humanities Advanced Research Centre"]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:29:33 GMT"}],"updateDate":"2024-07-19","timestamp":1721294973000,"abstract":"  Identifying the reason for which an author cites another work is essential to\nunderstand the nature of scientific contributions and to assess their impact.\nCitations are one of the pillars of scholarly communication and most metrics\nemployed to analyze these conceptual links are based on quantitative\nobservations. Behind the act of referencing another scholarly work there is a\nwhole world of meanings that needs to be proficiently and effectively revealed.\nThis study emphasizes the importance of trustfully classifying citation intents\nto provide more comprehensive and insightful analyses in research assessment.\nWe address this task by presenting a study utilizing advanced Ensemble\nStrategies for Citation Intent Classification (CIC) incorporating Language\nModels (LMs) and employing Explainable AI (XAI) techniques to enhance the\ninterpretability and trustworthiness of models' predictions. Our approach\ninvolves two ensemble classifiers that utilize fine-tuned SciBERT and XLNet LMs\nas baselines. We further demonstrate the critical role of section titles as a\nfeature in improving models' performances. The study also introduces a web\napplication developed with Flask and currently available at\nhttp://137.204.64.4:81/cic/classifier, aimed at classifying citation intents.\nOne of our models sets as a new state-of-the-art (SOTA) with an 89.46% Macro-F1\nscore on the SciCite benchmark. The integration of XAI techniques provides\ninsights into the decision-making processes, highlighting the contributions of\nindividual words for level-0 classifications, and of individual models for the\nmetaclassification. The findings suggest that the inclusion of section titles\nsignificantly enhances classification performances in the CIC task. Our\ncontributions provide useful insights for developing more robust datasets and\nmethodologies, thus fostering a deeper understanding of scholarly\ncommunication.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}