{"id":"2407.17472","title":"Promoting Health via mHealth Applications Using a French Version of the\n  Mobile App Rating Scale: Adaptation and Validation Study","authors":"Ina Saliasi (P2S), Prescilla Martinon (P2S), Emily Darlington (P2S),\n  Colette Smentek (P2S), Delphine Tardivo (ADES, APHM, AMU ODONTO), Denis\n  Bourgeois (P2S), Claude Dussart (P2S), Florence Carrouel (P2S), Laurie\n  Fraticelli (P2S)","authorsParsed":[["Saliasi","Ina","","P2S"],["Martinon","Prescilla","","P2S"],["Darlington","Emily","","P2S"],["Smentek","Colette","","P2S"],["Tardivo","Delphine","","ADES, APHM, AMU ODONTO"],["Bourgeois","Denis","","P2S"],["Dussart","Claude","","P2S"],["Carrouel","Florence","","P2S"],["Fraticelli","Laurie","","P2S"]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 08:26:33 GMT"}],"updateDate":"2024-07-26","timestamp":1719476793000,"abstract":"  Background In the recent decades, the number of apps promoting health\nbehaviors and health-related strategies and interventions has increased\nalongside the number of smartphone users. Nevertheless, the validity process\nfor measuring and reporting app quality remains unsatisfactory for health\nprofessionals and end users and represents a public health concern. The Mobile\nApplication Rating Scale (MARS) is a tool validated and widely used in the\nscientific literature to evaluate and compare mHealth app functionalities.\nHowever, MARS is not adapted to the French culture nor to the language.\nObjective This study aims to translate, adapt, and validate the equivalent\nFrench version of MARS (ie, MARS-F). Methods The original MARS was first\ntranslated to French by two independent bilingual scientists, and their common\nversion was blind back-translated twice by two native English speakers,\nculminating in a final well-established MARS-F. Its comprehensibility was then\nevaluated by 6 individuals (3 researchers and 3 nonacademics), and the final\nMARS-F version was created. Two bilingual raters independently completed the\nevaluation of 63 apps using MARS and MARS-F. Interrater reliability was\nassessed using intraclass correlation coefficients. In addition, internal\nconsistency and validity of both scales were assessed. Mokken scale analysis\nwas used to investigate the scalability of both MARS and MARS-F. Results MARS-F\nhad a good alignment with the original MARS, with properties comparable between\nthe two scales. The correlation coefficients (r) between the corresponding\ndimensions of MARS and MARS-F ranged from 0.97 to 0.99. The internal\nconsistencies of the MARS-F dimensions engagement ($\\omega$=0.79),\nfunctionality ($\\omega$=0.79), esthetics ($\\omega$=0.78), and information\nquality ($\\omega$=0.61) were acceptable and that for the overall MARS score\n($\\omega$=0.86) was good. Mokken scale analysis revealed a strong scalability\nfor MARS (Loevinger H=0.37) and a good scalability for MARS-F (H=0.35).\nConclusions MARS-F is a valid tool, and it would serve as a crucial aid for\nresearchers, health care professionals, public health authorities, and\ninterested third parties, to assess the quality of mHealth apps in\nFrench-speaking countries.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}