{"id":"2407.06339","title":"Noise-Free Explanation for Driving Action Prediction","authors":"Hongbo Zhu, Theodor Wulff, Rahul Singh Maharjan, Jinpei Han and Angelo\n  Cangelosi","authorsParsed":[["Zhu","Hongbo",""],["Wulff","Theodor",""],["Maharjan","Rahul Singh",""],["Han","Jinpei",""],["Cangelosi","Angelo",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 19:21:24 GMT"}],"updateDate":"2024-07-10","timestamp":1720466484000,"abstract":"  Although attention mechanisms have achieved considerable progress in\nTransformer-based architectures across various Artificial Intelligence (AI)\ndomains, their inner workings remain to be explored. Existing explainable\nmethods have different emphases but are rather one-sided. They primarily\nanalyse the attention mechanisms or gradient-based attribution while neglecting\nthe magnitudes of input feature values or the skip-connection module. Moreover,\nthey inevitably bring spurious noisy pixel attributions unrelated to the\nmodel's decision, hindering humans' trust in the spotted visualization result.\nHence, we propose an easy-to-implement but effective way to remedy this flaw:\nSmooth Noise Norm Attention (SNNA). We weigh the attention by the norm of the\ntransformed value vector and guide the label-specific signal with the attention\ngradient, then randomly sample the input perturbations and average the\ncorresponding gradients to produce noise-free attribution. Instead of\nevaluating the explanation method on the binary or multi-class classification\ntasks like in previous works, we explore the more complex multi-label\nclassification scenario in this work, i.e., the driving action prediction task,\nand trained a model for it specifically. Both qualitative and quantitative\nevaluation results show the superiority of SNNA compared to other SOTA\nattention-based explainable methods in generating a clearer visual explanation\nmap and ranking the input pixel importance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}