{"id":"2407.11913","title":"Quantised Global Autoencoder: A Holistic Approach to Representing Visual\n  Data","authors":"Tim Elsner, Paula Usinger, Victor Czech, Gregor Kobsik, Yanjiang He,\n  Isaak Lim, Leif Kobbelt","authorsParsed":[["Elsner","Tim",""],["Usinger","Paula",""],["Czech","Victor",""],["Kobsik","Gregor",""],["He","Yanjiang",""],["Lim","Isaak",""],["Kobbelt","Leif",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 17:05:20 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 17:50:03 GMT"}],"updateDate":"2024-08-06","timestamp":1721149520000,"abstract":"  In quantised autoencoders, images are usually split into local patches, each\nencoded by one token. This representation is redundant in the sense that the\nsame number of tokens is spend per region, regardless of the visual information\ncontent in that region. Adaptive discretisation schemes like quadtrees are\napplied to allocate tokens for patches with varying sizes, but this just varies\nthe region of influence for a token which nevertheless remains a local\ndescriptor. Modern architectures add an attention mechanism to the autoencoder\nwhich infuses some degree of global information into the local tokens. Despite\nthe global context, tokens are still associated with a local image region. In\ncontrast, our method is inspired by spectral decompositions which transform an\ninput signal into a superposition of global frequencies. Taking the data-driven\nperspective, we learn custom basis functions corresponding to the codebook\nentries in our VQ-VAE setup. Furthermore, a decoder combines these basis\nfunctions in a non-linear fashion, going beyond the simple linear superposition\nof spectral decompositions. We can achieve this global description with an\nefficient transpose operation between features and channels and demonstrate our\nperformance on compression.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GzbaLj5yNU2olVPEssLPsXltEBskF1wfzY190koA70E","pdfSize":"6235588"}
