{"id":"2407.14297","title":"Equivariant Symmetries for Aided Inertial Navigation","authors":"Alessandro Fornasier","authorsParsed":[["Fornasier","Alessandro",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:30:22 GMT"}],"updateDate":"2024-07-22","timestamp":1721395822000,"abstract":"  Respecting the geometry of the underlying system and exploiting its symmetry\nhave been driving concepts in deriving modern geometric filters for inertial\nnavigation systems (INSs). Despite their success, the explicit treatment of\ninertial measurement unit (IMU) biases remains challenging, unveiling a gap in\nthe current theory of filter design. In response to this gap, this dissertation\nbuilds upon the recent theory of equivariant systems to address and overcome\nthe limitations in existing methodologies. The goal is to identify new\nsymmetries of inertial navigation systems that include a geometric treatment of\nIMU biases and exploit them to design filtering algorithms that outperform\nstate-of-the-art solutions in terms of accuracy, convergence rate, robustness,\nand consistency. This dissertation leverages the semi-direct product rule and\nintroduces the tangent group for inertial navigation systems as the first\nequivariant symmetry that properly accounts for IMU biases. Based on that, we\nshow that it is possible to derive an equivariant filter (EqF) algorithm with\nautonomous navigation error dynamics. The resulting filter demonstrates\nsuperior to state-of-the-art solutions. Through a comprehensive analysis of\nvarious symmetries of inertial navigation systems, we formalized the concept\nthat every filter can be derived as an EqF with a specific choice of symmetry.\nThis underlines the fundamental role of symmetry in determining filter\nperformance. This dissertation advances the understanding of equivariant\nsymmetries in the context of inertial navigation systems and serves as a basis\nfor the next generation of equivariant estimators, marking a significant leap\ntoward more reliable navigation solutions.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}