{"id":"2407.00898","title":"Residual-MPPI: Online Policy Customization for Continuous Control","authors":"Pengcheng Wang, Chenran Li, Catherine Weaver, Kenta Kawamoto,\n  Masayoshi Tomizuka, Chen Tang, Wei Zhan","authorsParsed":[["Wang","Pengcheng",""],["Li","Chenran",""],["Weaver","Catherine",""],["Kawamoto","Kenta",""],["Tomizuka","Masayoshi",""],["Tang","Chen",""],["Zhan","Wei",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 01:53:07 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 03:56:09 GMT"},{"version":"v3","created":"Wed, 3 Jul 2024 11:00:42 GMT"},{"version":"v4","created":"Thu, 11 Jul 2024 12:02:12 GMT"}],"updateDate":"2024-07-12","timestamp":1719798787000,"abstract":"  Policies learned through Reinforcement Learning (RL) and Imitation Learning\n(IL) have demonstrated significant potential in achieving advanced performance\nin continuous control tasks. However, in real-world environments, it is often\nnecessary to further customize a trained policy when there are additional\nrequirements that were unforeseen during the original training phase. It is\npossible to fine-tune the policy to meet the new requirements, but this often\nrequires collecting new data with the added requirements and access to the\noriginal training metric and policy parameters. In contrast, an online planning\nalgorithm, if capable of meeting the additional requirements, can eliminate the\nnecessity for extensive training phases and customize the policy without\nknowledge of the original training scheme or task. In this work, we propose a\ngeneric online planning algorithm for customizing continuous-control policies\nat the execution time which we call Residual-MPPI. It is able to customize a\ngiven prior policy on new performance metrics in few-shot and even zero-shot\nonline settings. Also, Residual-MPPI only requires access to the action\ndistribution produced by the prior policy, without additional knowledge\nregarding the original task. Through our experiments, we demonstrate that the\nproposed Residual-MPPI algorithm can accomplish the few-shot/zero-shot online\npolicy customization task effectively, including customizing the champion-level\nracing agent, Gran Turismo Sophy (GT Sophy) 1.0, in the challenging car racing\nscenario, Gran Turismo Sport (GTS) environment. Demo videos are available on\nour website: https://sites.google.com/view/residual-mppi\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}