{"id":"2407.19865","title":"Imitation Learning for Intra-Day Power Grid Operation through Topology\n  Actions","authors":"Matthijs de Jong, Jan Viebahn, Yuliya Shapovalova","authorsParsed":[["de Jong","Matthijs",""],["Viebahn","Jan",""],["Shapovalova","Yuliya",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 10:34:19 GMT"},{"version":"v2","created":"Sun, 18 Aug 2024 09:55:39 GMT"}],"updateDate":"2024-08-20","timestamp":1722249259000,"abstract":"  Power grid operation is becoming increasingly complex due to the increase in\ngeneration of renewable energy. The recent series of Learning To Run a Power\nNetwork (L2RPN) competitions have encouraged the use of artificial agents to\nassist human dispatchers in operating power grids. In this paper we study the\nperformance of imitation learning for day-ahead power grid operation through\ntopology actions. In particular, we consider two rule-based expert agents: a\ngreedy agent and a N-1 agent. While the latter is more computationally\nexpensive since it takes N-1 safety considerations into account, it exhibits a\nmuch higher operational performance. We train a fully-connected neural network\n(FCNN) on expert state-action pairs and evaluate it in two ways. First, we find\nthat classification accuracy is limited despite extensive hyperparameter\ntuning, due to class imbalance and class overlap. Second, as a power system\nagent, the FCNN performs only slightly worse than expert agents. Furthermore,\nhybrid agents, which incorporate minimal additional simulations, match expert\nagents' performance with significantly lower computational cost. Consequently,\nimitation learning shows promise for developing fast, high-performing power\ngrid agents, motivating its further exploration in future L2RPN studies.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}