{"id":"2407.02842","title":"MindBench: A Comprehensive Benchmark for Mind Map Structure Recognition\n  and Analysis","authors":"Lei Chen, Feng Yan, Yujie Zhong, Shaoxiang Chen, Zequn Jie, Lin Ma","authorsParsed":[["Chen","Lei",""],["Yan","Feng",""],["Zhong","Yujie",""],["Chen","Shaoxiang",""],["Jie","Zequn",""],["Ma","Lin",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 06:39:18 GMT"}],"updateDate":"2024-07-04","timestamp":1719988758000,"abstract":"  Multimodal Large Language Models (MLLM) have made significant progress in the\nfield of document analysis. Despite this, existing benchmarks typically focus\nonly on extracting text and simple layout information, neglecting the complex\ninteractions between elements in structured documents such as mind maps and\nflowcharts. To address this issue, we introduce the new benchmark named\nMindBench, which not only includes meticulously constructed bilingual authentic\nor synthetic images, detailed annotations, evaluation metrics and baseline\nmodels, but also specifically designs five types of structured understanding\nand parsing tasks. These tasks include full parsing, partial parsing,\nposition-related parsing, structured Visual Question Answering (VQA), and\nposition-related VQA, covering key areas such as text recognition, spatial\nawareness, relationship discernment, and structured parsing. Extensive\nexperimental results demonstrate the substantial potential and significant room\nfor improvement in current models' ability to handle structured document\ninformation. We anticipate that the launch of MindBench will significantly\nadvance research and application development in structured document analysis\ntechnology. MindBench is available at:\nhttps://miasanlei.github.io/MindBench.github.io/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZV7p6jOrjyfrk59yEegzfoke9kQf5yZ7i-vdbNrl1RA","pdfSize":"5237768","objectId":"0x0ea8366922d3c72938d59de897c4ee26118d06c24e8d70a419870fcbb97d0f35","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
