{"id":"2407.08878","title":"SALT: Introducing a Framework for Hierarchical Segmentations in Medical\n  Imaging using Softmax for Arbitrary Label Trees","authors":"Sven Koitka, Giulia Baldini, Cynthia S. Schmidt, Olivia B. Pollok,\n  Obioma Pelka, Judith Kohnke, Katarzyna Borys, Christoph M. Friedrich,\n  Benedikt M. Schaarschmidt, Michael Forsting, Lale Umutlu, Johannes Haubold,\n  Felix Nensa, Ren\\'e Hosch","authorsParsed":[["Koitka","Sven",""],["Baldini","Giulia",""],["Schmidt","Cynthia S.",""],["Pollok","Olivia B.",""],["Pelka","Obioma",""],["Kohnke","Judith",""],["Borys","Katarzyna",""],["Friedrich","Christoph M.",""],["Schaarschmidt","Benedikt M.",""],["Forsting","Michael",""],["Umutlu","Lale",""],["Haubold","Johannes",""],["Nensa","Felix",""],["Hosch","René",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 21:33:08 GMT"}],"updateDate":"2024-07-15","timestamp":1720733588000,"abstract":"  Traditional segmentation networks approach anatomical structures as\nstandalone elements, overlooking the intrinsic hierarchical connections among\nthem. This study introduces Softmax for Arbitrary Label Trees (SALT), a novel\napproach designed to leverage the hierarchical relationships between labels,\nimproving the efficiency and interpretability of the segmentations.\n  This study introduces a novel segmentation technique for CT imaging, which\nleverages conditional probabilities to map the hierarchical structure of\nanatomical landmarks, such as the spine's division into lumbar, thoracic, and\ncervical regions and further into individual vertebrae. The model was developed\nusing the SAROS dataset from The Cancer Imaging Archive (TCIA), comprising 900\nbody region segmentations from 883 patients. The dataset was further enhanced\nby generating additional segmentations with the TotalSegmentator, for a total\nof 113 labels. The model was trained on 600 scans, while validation and testing\nwere conducted on 150 CT scans. Performance was assessed using the Dice score\nacross various datasets, including SAROS, CT-ORG, FLARE22, LCTSC, LUNA16, and\nWORD.\n  Among the evaluated datasets, SALT achieved its best results on the LUNA16\nand SAROS datasets, with Dice scores of 0.93 and 0.929 respectively. The model\ndemonstrated reliable accuracy across other datasets, scoring 0.891 on CT-ORG\nand 0.849 on FLARE22. The LCTSC dataset showed a score of 0.908 and the WORD\ndataset also showed good performance with a score of 0.844.\n  SALT used the hierarchical structures inherent in the human body to achieve\nwhole-body segmentations with an average of 35 seconds for 100 slices. This\nrapid processing underscores its potential for integration into clinical\nworkflows, facilitating the automatic and efficient computation of full-body\nsegmentations with each CT scan, thus enhancing diagnostic processes and\npatient care.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}