{"id":"2407.01201","title":"Performance of small-diameter muon drift tube chambers with new fast\n  readout ASIC at high background rates","authors":"Sergey Abovyan, Nayana Bangaru, Francesco Fallavollita, Oliver\n  Kortner, Sandra Kortner, Hubert Kroha, Elena Voevodina, Robert Richter and\n  Yazhou Zhao","authorsParsed":[["Abovyan","Sergey",""],["Bangaru","Nayana",""],["Fallavollita","Francesco",""],["Kortner","Oliver",""],["Kortner","Sandra",""],["Kroha","Hubert",""],["Voevodina","Elena",""],["Richter","Robert",""],["Zhao","Yazhou",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 11:49:15 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 09:11:40 GMT"}],"updateDate":"2024-07-04","timestamp":1719834555000,"abstract":"  Experiments like ATLAS at the HL-LHC or detectors at future hadron colliders\nneed muon detectors with excellent momentum resolution up to the TeV scale both\nat the trigger and offline reconstruction levels. This requires muon tracking\nchambers with high spatial resolution even at the highest background fluxes.\nDrift-tube chambers are the most cost-effective technology for large-area muon\nsystems, providing the required high rate capability and three-dimensional\nspatial resolution. Thanks to advances in electronics, the new generation\nsmall-diameter Muon Drift Tube (sMDT) detectors with 15 mm tube diameter can be\nused in stand-alone mode up to the background rates expected at future hadron\ncollider experiments, providing event times and second coordinates without\nadditional trigger chambers. New developments in integrated front-end\nelectronics include fast baseline restoration of the shaped signal and\npicosecond time-to-digital converters for second coordinate measurement with\ndouble-sided read-out. Self-triggered operation is now possible using modern\nhigh-performance FPGAs for real-time pattern recognition and track\nreconstruction. A new amplifier shaper discriminator chip in 65 nm TSMC CMOS\ntechnology with increased sensitivity and faster baseline recovery has been\ndeveloped to cope with high background fluxes. Extensive test beam campaigns\nusing sMDT chambers with new readout electronics have been performed at the\nCERN Gamma Irradiation Facility (GIF++). Results show that the shorter peaking\ntime of the new chip enhances the spatial resolution of the drift tubes by up\nto 100 $\\mu$m at a background rate of 1 MHz, the maximum rate expected at the\n100 TeV collider experiment.\n","subjects":["Physics/High Energy Physics - Experiment","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/"}