{"id":"2407.12573","title":"Neutrino beaming in ultraluminous X-ray pulsars as a result of\n  gravitational lensing by neutron stars","authors":"Alexander A. Mushtukov, Alexander Y. Potekhin, Suraga Nallan, Kesja\n  Kornacka, Igor S. Ognev, Vadim Kravtsov, Alexandra A. Dobrynina, Alexander D.\n  Kaminker","authorsParsed":[["Mushtukov","Alexander A.",""],["Potekhin","Alexander Y.",""],["Nallan","Suraga",""],["Kornacka","Kesja",""],["Ognev","Igor S.",""],["Kravtsov","Vadim",""],["Dobrynina","Alexandra A.",""],["Kaminker","Alexander D.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 13:57:26 GMT"}],"updateDate":"2024-07-18","timestamp":1721224646000,"abstract":"  X-ray pulsars experiencing extreme mass accretion rates can produce neutrino\nemission in the MeV energy band. Neutrinos in these systems are emitted in\nclose proximity to the stellar surface and subsequently undergo gravitational\nbending in the space curved by a neutron star. This process results in the\nformation of a distinct beam pattern of neutrino emission and gives rise to the\nphenomenon of neutrino pulsars. The energy flux of neutrinos, when averaged\nover the neutron star's pulsation period, can differ from the isotropic\nneutrino energy flux, which impacts the detectability of bright pulsars in\nneutrinos. We investigate the process of neutrino beam pattern formation,\naccounting for neutron star transparency to neutrinos and gravitational\nbending. Based on simulated neutrino beam patterns, we estimate the potential\ndifference between the actual and apparent neutrino luminosity. We show that\nthe apparent luminosity can greatly exceed the actual luminosity, albeit only\nin a small fraction of cases, depending on the specific equation of state and\nthe mass of the star. For example, the amplification can exceed a factor of ten\nfor $\\approx0.2\\%$ of typical neutron stars with mass of $1.4\\,M_\\odot$. Strong\namplification is less probable for neutron stars of higher mass. In the case of\nstrange stars, a fraction of high energy neutrinos can be absorbed and the beam\npattern, as well as the amplification of apparent neutrino luminosity, depend\non neutrino energy.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-wHREFOasGlnJ2C7JdtSXiBpbdoJQ-nWs5qw2RhWv0o","pdfSize":"3288079"}
