{"id":"2407.16197","title":"LiCROcc: Teach Radar for Accurate Semantic Occupancy Prediction using\n  LiDAR and Camera","authors":"Yukai Ma, Jianbiao Mei, Xuemeng Yang, Licheng Wen, Weihua Xu,\n  Jiangning Zhang, Botian Shi, Yong Liu, Xingxing Zuo","authorsParsed":[["Ma","Yukai",""],["Mei","Jianbiao",""],["Yang","Xuemeng",""],["Wen","Licheng",""],["Xu","Weihua",""],["Zhang","Jiangning",""],["Shi","Botian",""],["Liu","Yong",""],["Zuo","Xingxing",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 05:53:05 GMT"}],"updateDate":"2024-07-24","timestamp":1721713985000,"abstract":"  Semantic Scene Completion (SSC) is pivotal in autonomous driving perception,\nfrequently confronted with the complexities of weather and illumination\nchanges. The long-term strategy involves fusing multi-modal information to\nbolster the system's robustness. Radar, increasingly utilized for 3D target\ndetection, is gradually replacing LiDAR in autonomous driving applications,\noffering a robust sensing alternative. In this paper, we focus on the potential\nof 3D radar in semantic scene completion, pioneering cross-modal refinement\ntechniques for improved robustness against weather and illumination changes,\nand enhancing SSC performance.Regarding model architecture, we propose a\nthree-stage tight fusion approach on BEV to realize a fusion framework for\npoint clouds and images. Based on this foundation, we designed three\ncross-modal distillation modules-CMRD, BRD, and PDD. Our approach enhances the\nperformance in both radar-only (R-LiCROcc) and radar-camera (RC-LiCROcc)\nsettings by distilling to them the rich semantic and structural information of\nthe fused features of LiDAR and camera. Finally, our LC-Fusion (teacher model),\nR-LiCROcc and RC-LiCROcc achieve the best performance on the nuScenes-Occupancy\ndataset, with mIOU exceeding the baseline by 22.9%, 44.1%, and 15.5%,\nrespectively. The project page is available at\nhttps://hr-zju.github.io/LiCROcc/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}