{"id":"2407.19292","title":"Understanding Misconfigurations in ROS: An Empirical Study and Current\n  Approaches","authors":"Paulo Canelas and Bradley Schmerl and Alcides Fonseca and Christopher\n  S. Timperley","authorsParsed":[["Canelas","Paulo",""],["Schmerl","Bradley",""],["Fonseca","Alcides",""],["Timperley","Christopher S.",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 16:20:43 GMT"}],"updateDate":"2024-07-30","timestamp":1722097243000,"abstract":"  The Robot Operating System (ROS) is a popular framework and ecosystem that\nallows developers to build robot software systems from reusable, off-the-shelf\ncomponents. Systems are often built by customizing and connecting components\nvia configuration files. While reusable components theoretically allow rapid\nprototyping, ensuring proper configuration and connection is challenging, as\nevidenced by numerous questions on developer forums. Developers must abide to\nthe often unchecked and unstated assumptions of individual components. Failure\nto do so can result in misconfigurations that are only discovered during field\ndeployment, at which point errors may lead to unpredictable and dangerous\nbehavior. Despite misconfigurations having been studied in the broader context\nof software engineering, robotics software (and ROS in particular) poses\ndomain-specific challenges with potentially disastrous consequences. To\nunderstand and improve the reliability of ROS projects, it is critical to\nidentify the types of misconfigurations faced by developers. To that end, we\nperform a study of ROS Answers, a Q&A platform, to identify and categorize\nmisconfigurations that occur during ROS development. We then conduct a\nliterature review to assess the coverage of these misconfigurations by existing\ndetection techniques. In total, we find 12 high-level categories and 50\nsub-categories of misconfigurations. Of these categories, 27 are not covered by\nexisting techniques. To conclude, we discuss how to tackle those\nmisconfigurations in future work.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}