{"id":"2407.11579","title":"Enhancing stop location detection for incomplete urban mobility datasets","authors":"Margherita Bert\\`e, Rashid Ibrahimli, Lars Koopmans, Pablo\n  Valga\\~n\\'on, Nicola Zomer and Davide Colombi","authorsParsed":[["Bertè","Margherita",""],["Ibrahimli","Rashid",""],["Koopmans","Lars",""],["Valgañón","Pablo",""],["Zomer","Nicola",""],["Colombi","Davide",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 10:41:08 GMT"}],"updateDate":"2024-07-17","timestamp":1721126468000,"abstract":"  Stop location detection, within human mobility studies, has an impacts in\nmultiple fields including urban planning, transport network design,\nepidemiological modeling, and socio-economic segregation analysis. However, it\nremains a challenging task because classical density clustering algorithms\noften struggle with noisy or incomplete GPS datasets. This study investigates\nthe application of classification algorithms to enhance density-based methods\nfor stop identification. Our approach incorporates multiple features, including\nindividual routine behavior across various time scales and local\ncharacteristics of individual GPS points. The dataset comprises\nprivacy-preserving and anonymized GPS points previously labeled as stops by a\nsequence-oriented, density-dependent algorithm. We simulated data gaps by\nremoving point density from select stops to assess performance under sparse\ndata conditions. The model classifies individual GPS points within trajectories\nas potential stops or non-stops. Given the highly imbalanced nature of the\ndataset, we prioritized recall over precision in performance evaluation.\nResults indicate that this method detects most stops, even in the presence of\nspatio-temporal gaps and that points classified as false positives often\ncorrespond to recurring locations for devices, typically near previous stops.\nWhile this research contributes to mobility analysis techniques, significant\nchallenges persist. The lack of ground truth data limits definitive conclusions\nabout the algorithm's accuracy. Further research is needed to validate the\nmethod across diverse datasets and to incorporate collective behavior inputs.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"c5hxYUuLYfZaGgVIz8BujG7fK6nddSi3McvOkzQLHRE","pdfSize":"3847516"}
