{"id":"2407.16357","title":"TWIN V2: Scaling Ultra-Long User Behavior Sequence Modeling for Enhanced\n  CTR Prediction at Kuaishou","authors":"Zihua Si, Lin Guan, ZhongXiang Sun, Xiaoxue Zang, Jing Lu, Yiqun Hui,\n  Xingchao Cao, Zeyu Yang, Yichen Zheng, Dewei Leng, Kai Zheng, Chenbin Zhang,\n  Yanan Niu, Yang Song, Kun Gai","authorsParsed":[["Si","Zihua",""],["Guan","Lin",""],["Sun","ZhongXiang",""],["Zang","Xiaoxue",""],["Lu","Jing",""],["Hui","Yiqun",""],["Cao","Xingchao",""],["Yang","Zeyu",""],["Zheng","Yichen",""],["Leng","Dewei",""],["Zheng","Kai",""],["Zhang","Chenbin",""],["Niu","Yanan",""],["Song","Yang",""],["Gai","Kun",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 10:00:45 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 05:16:31 GMT"}],"updateDate":"2024-08-19","timestamp":1721728845000,"abstract":"  The significance of modeling long-term user interests for CTR prediction\ntasks in large-scale recommendation systems is progressively gaining attention\namong researchers and practitioners. Existing work, such as SIM and TWIN,\ntypically employs a two-stage approach to model long-term user behavior\nsequences for efficiency concerns. The first stage rapidly retrieves a subset\nof sequences related to the target item from a long sequence using a\nsearch-based mechanism namely the General Search Unit (GSU), while the second\nstage calculates the interest scores using the Exact Search Unit (ESU) on the\nretrieved results. Given the extensive length of user behavior sequences\nspanning the entire life cycle, potentially reaching up to 10^6 in scale, there\nis currently no effective solution for fully modeling such expansive user\ninterests. To overcome this issue, we introduced TWIN-V2, an enhancement of\nTWIN, where a divide-and-conquer approach is applied to compress life-cycle\nbehaviors and uncover more accurate and diverse user interests. Specifically, a\nhierarchical clustering method groups items with similar characteristics in\nlife-cycle behaviors into a single cluster during the offline phase. By\nlimiting the size of clusters, we can compress behavior sequences well beyond\nthe magnitude of 10^5 to a length manageable for online inference in GSU\nretrieval. Cluster-aware target attention extracts comprehensive and\nmulti-faceted long-term interests of users, thereby making the final\nrecommendation results more accurate and diverse. Extensive offline experiments\non a multi-billion-scale industrial dataset and online A/B tests have\ndemonstrated the effectiveness of TWIN-V2. Under an efficient deployment\nframework, TWIN-V2 has been successfully deployed to the primary traffic that\nserves hundreds of millions of daily active users at Kuaishou.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}