{"id":"2407.13858","title":"Quantum Natural Stochastic Pairwise Coordinate Descent","authors":"Mohammad Aamir Sohail, Mohsen Heidari Khoozani, S. Sandeep Pradhan","authorsParsed":[["Sohail","Mohammad Aamir",""],["Khoozani","Mohsen Heidari",""],["Pradhan","S. Sandeep",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 18:57:29 GMT"}],"updateDate":"2024-07-22","timestamp":1721329049000,"abstract":"  Quantum machine learning through variational quantum algorithms (VQAs) has\ngained substantial attention in recent years. VQAs employ parameterized quantum\ncircuits, which are typically optimized using gradient-based methods. However,\nthese methods often exhibit sub-optimal convergence performance due to their\ndependence on Euclidean geometry. The quantum natural gradient descent (QNGD)\noptimization method, which considers the geometry of the quantum state space\nvia a quantum information (Riemannian) metric tensor, provides a more effective\noptimization strategy. Despite its advantages, QNGD encounters notable\nchallenges for learning from quantum data, including the no-cloning principle,\nwhich prohibits the replication of quantum data, state collapse, and the\nmeasurement postulate, which leads to the stochastic loss function. This paper\nintroduces the quantum natural stochastic pairwise coordinate descent (2-QNSCD)\noptimization method. This method leverages the curved geometry of the quantum\nstate space through a novel ensemble-based quantum information metric tensor,\noffering a more physically realizable optimization strategy for learning from\nquantum data. To improve computational efficiency and reduce sample complexity,\nwe develop a highly sparse unbiased estimator of the novel metric tensor using\na quantum circuit with gate complexity $\\Theta(1)$ times that of the\nparameterized quantum circuit and single-shot quantum measurements. Our\napproach avoids the need for multiple copies of quantum data, thus adhering to\nthe no-cloning principle. We provide a detailed theoretical foundation for our\noptimization method, along with an exponential convergence analysis.\nAdditionally, we validate the utility of our method through a series of\nnumerical experiments.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Machine Learning","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Stpy9lE5cn5wm5qmuAETksWWtHOwpZFEyIm9I57tJHQ","pdfSize":"7231589","objectId":"0xea668949b5bdd009009b576b65e6e82d0a5b6d02208676fb471979d0122a6f44","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
