{"id":"2407.15260","title":"Weakly SSM : On the Viability of Weakly Supervised Segmentations for\n  Statistical Shape Modeling","authors":"Janmesh Ukey, Tushar Kataria, Shireen Y. Elhabian","authorsParsed":[["Ukey","Janmesh",""],["Kataria","Tushar",""],["Elhabian","Shireen Y.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 20:24:21 GMT"}],"updateDate":"2024-07-23","timestamp":1721593461000,"abstract":"  Statistical Shape Models (SSMs) excel at identifying population level\nanatomical variations, which is at the core of various clinical and biomedical\napplications, including morphology-based diagnostics and surgical planning.\nHowever, the effectiveness of SSM is often constrained by the necessity for\nexpert-driven manual segmentation, a process that is both time-intensive and\nexpensive, thereby restricting their broader application and utility. Recent\ndeep learning approaches enable the direct estimation of Statistical Shape\nModels (SSMs) from unsegmented images. While these models can predict SSMs\nwithout segmentation during deployment, they do not address the challenge of\nacquiring the manual annotations needed for training, particularly in\nresource-limited settings. Semi-supervised and foundation models for anatomy\nsegmentation can mitigate the annotation burden. Yet, despite the abundance of\navailable approaches, there are no established guidelines to inform end-users\non their effectiveness for the downstream task of constructing SSMs. In this\nstudy, we systematically evaluate the potential of weakly supervised methods as\nviable alternatives to manual segmentation's for building SSMs. We establish a\nnew performance benchmark by employing various semi-supervised and foundational\nmodel methods for anatomy segmentation under low annotation settings, utilizing\nthe predicted segmentation's for the task of SSM. We compare the modes of shape\nvariation and use quantitative metrics to compare against a shape model derived\nfrom a manually annotated dataset. Our results indicate that some methods\nproduce noisy segmentation, which is very unfavorable for SSM tasks, while\nothers can capture the correct modes of variations in the population cohort\nwith 60-80\\% reduction in required manual annotation.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}