{"id":"2407.01168","title":"Multi-View Black-Box Physical Attacks on Infrared Pedestrian Detectors\n  Using Adversarial Infrared Grid","authors":"Kalibinuer Tiliwalidi, Chengyin Hu, Weiwen Shi","authorsParsed":[["Tiliwalidi","Kalibinuer",""],["Hu","Chengyin",""],["Shi","Weiwen",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 10:38:08 GMT"},{"version":"v2","created":"Mon, 8 Jul 2024 14:17:26 GMT"}],"updateDate":"2024-07-09","timestamp":1719830288000,"abstract":"  While extensive research exists on physical adversarial attacks within the\nvisible spectrum, studies on such techniques in the infrared spectrum are\nlimited. Infrared object detectors are vital in modern technological\napplications but are susceptible to adversarial attacks, posing significant\nsecurity threats. Previous studies using physical perturbations like light bulb\narrays and aerogels for white-box attacks, or hot and cold patches for\nblack-box attacks, have proven impractical or limited in multi-view support. To\naddress these issues, we propose the Adversarial Infrared Grid (AdvGrid), which\nmodels perturbations in a grid format and uses a genetic algorithm for\nblack-box optimization. These perturbations are cyclically applied to various\nparts of a pedestrian's clothing to facilitate multi-view black-box physical\nattacks on infrared pedestrian detectors. Extensive experiments validate\nAdvGrid's effectiveness, stealthiness, and robustness. The method achieves\nattack success rates of 80.00\\% in digital environments and 91.86\\% in physical\nenvironments, outperforming baseline methods. Additionally, the average attack\nsuccess rate exceeds 50\\% against mainstream detectors, demonstrating AdvGrid's\nrobustness. Our analyses include ablation studies, transfer attacks, and\nadversarial defenses, confirming the method's superiority.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}