{"id":"2407.01071","title":"Linear-Time MaxCut in Multigraphs Parameterized Above the\n  Poljak-Turz\\'ik Bound","authors":"Jonas Lill, Kalina Petrova, Simon Weber","authorsParsed":[["Lill","Jonas",""],["Petrova","Kalina",""],["Weber","Simon",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:23:36 GMT"}],"updateDate":"2024-07-02","timestamp":1719822216000,"abstract":"  MaxCut is a classical NP-complete problem and a crucial building block in\nmany combinatorial algorithms. The famous Edwards-Erd\\H{o}s bound states that\nany connected graph on n vertices with m edges contains a cut of size at least\n$m/2 + (n-1)/4$. Crowston, Jones and Mnich [Algorithmica, 2015] showed that the\nMaxCut problem on simple connected graphs admits an FPT algorithm, where the\nparameter k is the difference between the desired cut size c and the lower\nbound given by the Edwards-Erd\\H{o}s bound. This was later improved by Etscheid\nand Mnich [Algorithmica, 2017] to run in parameterized linear time, i.e.,\n$f(k)\\cdot O(m)$. We improve upon this result in two ways: Firstly, we extend\nthe algorithm to work also for multigraphs (alternatively, graphs with positive\ninteger weights). Secondly, we change the parameter; instead of the difference\nto the Edwards-Erd\\H{o}s bound, we use the difference to the Poljak-Turz\\'ik\nbound. The Poljak-Turz\\'ik bound states that any weighted graph G has a cut of\nsize at least $w(G)/2 + w_{MSF}(G)/4$, where w(G) denotes the total weight of\nG, and $w_{MSF}(G)$ denotes the weight of its minimum spanning forest. In\nconnected simple graphs the two bounds are equivalent, but for multigraphs the\nPoljak-Turz\\'ik bound can be larger and thus yield a smaller parameter k. Our\nalgorithm also runs in parameterized linear time, i.e., $f(k)\\cdot O(m+n)$.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Computational Complexity","Computing Research Repository/Discrete Mathematics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}