{"id":"2407.20060","title":"RelBench: A Benchmark for Deep Learning on Relational Databases","authors":"Joshua Robinson, Rishabh Ranjan, Weihua Hu, Kexin Huang, Jiaqi Han,\n  Alejandro Dobles, Matthias Fey, Jan E. Lenssen, Yiwen Yuan, Zecheng Zhang,\n  Xinwei He, Jure Leskovec","authorsParsed":[["Robinson","Joshua",""],["Ranjan","Rishabh",""],["Hu","Weihua",""],["Huang","Kexin",""],["Han","Jiaqi",""],["Dobles","Alejandro",""],["Fey","Matthias",""],["Lenssen","Jan E.",""],["Yuan","Yiwen",""],["Zhang","Zecheng",""],["He","Xinwei",""],["Leskovec","Jure",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 14:46:13 GMT"}],"updateDate":"2024-07-30","timestamp":1722264373000,"abstract":"  We present RelBench, a public benchmark for solving predictive tasks over\nrelational databases with graph neural networks. RelBench provides databases\nand tasks spanning diverse domains and scales, and is intended to be a\nfoundational infrastructure for future research. We use RelBench to conduct the\nfirst comprehensive study of Relational Deep Learning (RDL) (Fey et al., 2024),\nwhich combines graph neural network predictive models with (deep) tabular\nmodels that extract initial entity-level representations from raw tables.\nEnd-to-end learned RDL models fully exploit the predictive signal encoded in\nprimary-foreign key links, marking a significant shift away from the dominant\nparadigm of manual feature engineering combined with tabular models. To\nthoroughly evaluate RDL against this prior gold-standard, we conduct an\nin-depth user study where an experienced data scientist manually engineers\nfeatures for each task. In this study, RDL learns better models whilst reducing\nhuman work needed by more than an order of magnitude. This demonstrates the\npower of deep learning for solving predictive tasks over relational databases,\nopening up many new research opportunities enabled by RelBench.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/"}