{"id":"2407.17764","title":"Identifying pulsar candidates in interferometric radio images using\n  scintillation","authors":"Jitendra Salal, Shriharsh P. Tendulkar, Visweshwar Ram Marthi","authorsParsed":[["Salal","Jitendra",""],["Tendulkar","Shriharsh P.",""],["Marthi","Visweshwar Ram",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 04:41:37 GMT"}],"updateDate":"2024-07-26","timestamp":1721882497000,"abstract":"  Pulsars have been primarily detected by their narrow pulses or periodicity in\ntime domain data. Interferometric surveys for pulsars are challenging due to\nthe trade-off between beam sensitivity and beam size and the corresponding\ntradeoff between survey sensitivity (depth), sky coverage, and computational\nefforts. The detection sensitivity of time-domain searches for pulsars is\naffected by dispersion smearing, scattering, and rapid orbital motion of\npulsars in binaries. We have developed a new technique to select pulsar\ncandidates in interferometric radio images by identifying scintillating sources\nand measuring their scintillation bandwidth and timescale. Identifying likely\ncandidates allows sensitive, focused time-domain searches, saving computational\neffort. Pulsar scintillation is independent of its timing properties and hence\noffers a different selection of pulsars compared to time-domain searches.\nCandidates identified from this method could allow us to find hard-to-detect\npulsars, such as sub-millisecond pulsars and pulsars in very compact,\nhighly-accelerated binary orbits. We use uGMRT observations in the fields of\nPSR\\,B1508+55, PSR\\,J0437$-$4715, and PSR\\,B0031$-$07 as test cases for our\ntechnique. We demonstrate that the technique correctly differentiates between\nthe pulsar and other non-scintillating point sources and show that the\nextracted dynamic spectrum of the pulsar is equivalent to that extracted from\nthe uGMRT phased array beam. We show the results from our analysis of known\npulsar fields and discuss challenges in dealing with interference and\ninstrumental effects.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}