{"id":"2407.06115","title":"Infer Induced Sentiment of Comment Response to Video: A New Task,\n  Dataset and Baseline","authors":"Qi Jia, Baoyu Fan, Cong Xu, Lu Liu, Liang Jin, Guoguang Du, Zhenhua\n  Guo, Yaqian Zhao, Xuanjing Huang, Rengang Li","authorsParsed":[["Jia","Qi",""],["Fan","Baoyu",""],["Xu","Cong",""],["Liu","Lu",""],["Jin","Liang",""],["Du","Guoguang",""],["Guo","Zhenhua",""],["Zhao","Yaqian",""],["Huang","Xuanjing",""],["Li","Rengang",""]],"versions":[{"version":"v1","created":"Wed, 15 May 2024 10:24:54 GMT"}],"updateDate":"2024-07-09","timestamp":1715768694000,"abstract":"  Existing video multi-modal sentiment analysis mainly focuses on the sentiment\nexpression of people within the video, yet often neglects the induced sentiment\nof viewers while watching the videos. Induced sentiment of viewers is essential\nfor inferring the public response to videos, has broad application in analyzing\npublic societal sentiment, effectiveness of advertising and other areas. The\nmicro videos and the related comments provide a rich application scenario for\nviewers induced sentiment analysis. In light of this, we introduces a novel\nresearch task, Multi-modal Sentiment Analysis for Comment Response of Video\nInduced(MSA-CRVI), aims to inferring opinions and emotions according to the\ncomments response to micro video. Meanwhile, we manually annotate a dataset\nnamed Comment Sentiment toward to Micro Video (CSMV) to support this research.\nIt is the largest video multi-modal sentiment dataset in terms of scale and\nvideo duration to our knowledge, containing 107,267 comments and 8,210 micro\nvideos with a video duration of 68.83 hours. To infer the induced sentiment of\ncomment should leverage the video content, so we propose the Video\nContent-aware Comment Sentiment Analysis (VC-CSA) method as baseline to address\nthe challenges inherent in this new task. Extensive experiments demonstrate\nthat our method is showing significant improvements over other established\nbaselines.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}