{"id":"2407.13675","title":"MeshSegmenter: Zero-Shot Mesh Semantic Segmentation via Texture\n  Synthesis","authors":"Ziming Zhong, Yanxu Xu, Jing Li, Jiale Xu, Zhengxin Li, Chaohui Yu,\n  Shenghua Gao","authorsParsed":[["Zhong","Ziming",""],["Xu","Yanxu",""],["Li","Jing",""],["Xu","Jiale",""],["Li","Zhengxin",""],["Yu","Chaohui",""],["Gao","Shenghua",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:50:59 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 08:47:34 GMT"},{"version":"v3","created":"Thu, 25 Jul 2024 12:32:21 GMT"}],"updateDate":"2024-07-26","timestamp":1721321459000,"abstract":"  We present MeshSegmenter, a simple yet effective framework designed for\nzero-shot 3D semantic segmentation. This model successfully extends the\npowerful capabilities of 2D segmentation models to 3D meshes, delivering\naccurate 3D segmentation across diverse meshes and segment descriptions.\nSpecifically, our model leverages the Segment Anything Model (SAM) model to\nsegment the target regions from images rendered from the 3D shape. In light of\nthe importance of the texture for segmentation, we also leverage the pretrained\nstable diffusion model to generate images with textures from 3D shape, and\nleverage SAM to segment the target regions from images with textures. Textures\nsupplement the shape for segmentation and facilitate accurate 3D segmentation\neven in geometrically non-prominent areas, such as segmenting a car door within\na car mesh. To achieve the 3D segments, we render 2D images from different\nviews and conduct segmentation for both textured and untextured images. Lastly,\nwe develop a multi-view revoting scheme that integrates 2D segmentation results\nand confidence scores from various views onto the 3D mesh, ensuring the 3D\nconsistency of segmentation results and eliminating inaccuracies from specific\nperspectives. Through these innovations, MeshSegmenter offers stable and\nreliable 3D segmentation results both quantitatively and qualitatively,\nhighlighting its potential as a transformative tool in the field of 3D\nzero-shot segmentation. The code is available at\n\\url{https://github.com/zimingzhong/MeshSegmenter}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"n6gKvtPTD10UFtWSrl2IKOPWRnmVs7fvLFqp6_00iyI","pdfSize":"10992722","objectId":"0x1b27dedb63ba788508b9b6bac4965827cee74fe3157a28df7408f761b9a1aafe","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
