{"id":"2407.11991","title":"Inspired by AI? A Novel Generative AI System To Assist Conceptual\n  Automotive Design","authors":"Ye Wang, Nicole B. Damen, Thomas Gale, Voho Seo, Hooman Shayani","authorsParsed":[["Wang","Ye",""],["Damen","Nicole B.",""],["Gale","Thomas",""],["Seo","Voho",""],["Shayani","Hooman",""]],"versions":[{"version":"v1","created":"Thu, 6 Jun 2024 17:04:14 GMT"}],"updateDate":"2024-07-18","timestamp":1717693454000,"abstract":"  Design inspiration is crucial for establishing the direction of a design as\nwell as evoking feelings and conveying meanings during the conceptual design\nprocess. Many practice designers use text-based searches on platforms like\nPinterest to gather image ideas, followed by sketching on paper or using\ndigital tools to develop concepts. Emerging generative AI techniques, such as\ndiffusion models, offer a promising avenue to streamline these processes by\nswiftly generating design concepts based on text and image inspiration inputs,\nsubsequently using the AI generated design concepts as fresh sources of\ninspiration for further concept development. However, applying these generative\nAI techniques directly within a design context has challenges. Firstly,\ngenerative AI tools may exhibit a bias towards particular styles, resulting in\na lack of diversity of design outputs. Secondly, these tools may struggle to\ngrasp the nuanced meanings of texts or images in a design context. Lastly, the\nlack of integration with established design processes within design teams can\nresult in fragmented use scenarios. Focusing on these challenges, we conducted\nworkshops, surveys, and data augmentation involving teams of experienced\nautomotive designers to investigate their current practices in generating\nconcepts inspired by texts and images, as well as their preferred interaction\nmodes for generative AI systems to support the concept generation workflow.\nFinally, we developed a novel generative AI system based on diffusion models to\nassist conceptual automotive design.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}