{"id":"2407.02023","title":"Field Theories on Quantum Space-Times: Towards the Phenomenology of\n  Quantum Gravity","authors":"Kilian Hersent","authorsParsed":[["Hersent","Kilian",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 07:45:21 GMT"}],"updateDate":"2024-07-03","timestamp":1719906321000,"abstract":"  Noncommutative geometry is a mathematical framework that expresses the\nstructure of space-time in terms of operator algebras. By using the tools of\nquantum mechanics to describe the geometry, noncommutative space-times are\nexpected to give rise to quantum gravity effects, at least in some regime. This\nmanuscript focuses on the physical aspects of these so-called quantum\nspace-times, in particular through the formalism of field and gauge theories.\nScalar field theories are shown to possibly trigger mixed divergences in the\ninfra-red and ultra-violet for the 2-point function at one loop. This\nphenomenon is generically called UV/IR mixing and stems from a diverging\nbehaviour of the propagator. The analysis of such divergences differs from the\ncommutative case because the momentum space is now also noncommutative. From\nanother perspective, a gauge theory on $\\kappa$-Minkowski, a quantum\ndeformation of the Minkowski space-time, is derived. A first perturbative\ncomputation is shown to break the gauge invariance, a pathological behaviour\ncommon to other quantum space-times. A causality toy model is also developed on\n$\\kappa$-Minkowski, in which an analogue of the speed-of-light limit emerges.\nThe phenomenology of quantum gravity arising from quantum space-times is\ndiscussed, together with the actual constraints it imposes. Finally, a toy\nmodel for noncommutative gravity is tackled, using the former\n$\\kappa$-Minkowski space-time to describe the tangent space. It necessitates\nthe notion of noncommutative partition of unity specifically defined there.\n","subjects":["Physics/Mathematical Physics","Physics/High Energy Physics - Theory","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}