{"id":"2407.01662","title":"Investigating the ultraviolet and infrared radiation through the\n  turbulent life of molecular clouds","authors":"Fabio Di Mascia, Andrea Pallottini, Laura Sommovigo, Davide Decataldo","authorsParsed":[["Di Mascia","Fabio",""],["Pallottini","Andrea",""],["Sommovigo","Laura",""],["Decataldo","Davide",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-03","timestamp":1719856800000,"abstract":"  Context. Molecular Clouds (MCs) are the place where stars are formed and\ntheir feedback starts to take place, regulating the evolution of galaxies.\nTherefore, MCs represent the critical scale at which to study how ultra-violet\n(UV) photons emitted by young stars are reprocessed in the far-infrared (FIR)\nby interaction with dust grains, thereby determining the multi-wavelength\ncontinuum emission of galaxies. Aims. Our goal is to analyze the UV and IR\nemission of a MC at different stages of its evolution and relate its absorption\nand emission properties with its morphology and star formation rate. Such a\nstudy is fundamental to determine how the properties of MCs shape the emission\nfrom entire galaxies. Method. We consider a radiation-hydrodynamic simulation\nof a MC with self-consistent chemistry treatment. The MC has a mass $M_{\\rm MC}\n= 10^5 ~ M_\\odot$, is resolved down to a scale of $0.06\\, \\rm pc$, and evolves\nfor $\\simeq 2.4$~Myr after the onset of star formation. We post-process the\nsimulation via Monte Carlo radiative transfer calculations to compute the\ndetailed UV-to-FIR emission of the MC. Such results are compared with data from\nphysically-motivated analytical models, other simulations, and observations.\nResults. We find that the simulated MC is globally UV-optically thick, but\noptically-thin channels allow for photon escape ($0.1\\%-10\\%$), feature which\nis not well-captured in the analytical models. Dust temperature spans a wide\nrange ($T_{\\rm dust} \\sim 20-300$~K) depending on the dust-to-stellar geometry,\nwhich is reproduced reasonably well by analytical models. However, the\ncomplexity of the dust temperature distribution is not captured in the\nanalytical models, as evidenced by the 10 K (20 K) difference in the mass\n(luminosity) average temperature. Indeed, the total IR luminosity is the same\nin all the models, but the IR emission -abridged\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}