{"id":"2407.08460","title":"Semi-Supervised Object Detection: A Survey on Progress from CNN to\n  Transformer","authors":"Tahira Shehzadi, Ifza, Didier Stricker and Muhammad Zeshan Afzal","authorsParsed":[["Shehzadi","Tahira",""],["Ifza","",""],["Stricker","Didier",""],["Afzal","Muhammad Zeshan",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 12:58:13 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 09:28:59 GMT"}],"updateDate":"2024-07-17","timestamp":1720702693000,"abstract":"  The impressive advancements in semi-supervised learning have driven\nresearchers to explore its potential in object detection tasks within the field\nof computer vision. Semi-Supervised Object Detection (SSOD) leverages a\ncombination of a small labeled dataset and a larger, unlabeled dataset. This\napproach effectively reduces the dependence on large labeled datasets, which\nare often expensive and time-consuming to obtain. Initially, SSOD models\nencountered challenges in effectively leveraging unlabeled data and managing\nnoise in generated pseudo-labels for unlabeled data. However, numerous recent\nadvancements have addressed these issues, resulting in substantial improvements\nin SSOD performance. This paper presents a comprehensive review of 27\ncutting-edge developments in SSOD methodologies, from Convolutional Neural\nNetworks (CNNs) to Transformers. We delve into the core components of\nsemi-supervised learning and its integration into object detection frameworks,\ncovering data augmentation techniques, pseudo-labeling strategies, consistency\nregularization, and adversarial training methods. Furthermore, we conduct a\ncomparative analysis of various SSOD models, evaluating their performance and\narchitectural differences. We aim to ignite further research interest in\novercoming existing challenges and exploring new directions in semi-supervised\nlearning for object detection.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZUIkKNIuSHm_xygTGYZMMlzZZd3wDMkEGt1IwWlIR9M","pdfSize":"4327543"}
