{"id":"2407.16223","title":"Probabilistic Parameter Estimators and Calibration Metrics for Pose\n  Estimation from Image Features","authors":"Romeo Valentin, Sydney M. Katz, Joonghyun Lee, Don Walker, Matthew\n  Sorgenfrei, and Mykel J. Kochenderfer","authorsParsed":[["Valentin","Romeo",""],["Katz","Sydney M.",""],["Lee","Joonghyun",""],["Walker","Don",""],["Sorgenfrei","Matthew",""],["Kochenderfer","Mykel J.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 07:02:01 GMT"}],"updateDate":"2024-07-24","timestamp":1721718121000,"abstract":"  This paper addresses the challenge of probabilistic parameter estimation\ngiven measurement uncertainty in real-time. We provide a general formulation\nand apply this to pose estimation for an autonomous visual landing system. We\npresent three probabilistic parameter estimators: a least-squares sampling\napproach, a linear approximation method, and a probabilistic programming\nestimator. To evaluate these estimators, we introduce novel closed-form\nexpressions for measuring calibration and sharpness specifically for\nmultivariate normal distributions. Our experimental study compares the three\nestimators under various noise conditions. We demonstrate that the linear\napproximation estimator can produce sharp and well-calibrated pose predictions\nsignificantly faster than the other methods but may yield overconfident\npredictions in certain scenarios. Additionally, we demonstrate that these\nestimators can be integrated with a Kalman filter for continuous pose\nestimation during a runway approach where we observe a 50\\% improvement in\nsharpness while maintaining marginal calibration. This work contributes to the\nintegration of data-driven computer vision models into complex safety-critical\naircraft systems and provides a foundation for developing rigorous\ncertification guidelines for such systems.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VkSQZWQLDv6fXi9vECu8HK31ph435lrWsB82Sll86ro","pdfSize":"371365"}
