{"id":"2407.21021","title":"Asymptotic Formulation of the Role of Shear Loads on Multi-Layered Thin\n  Shells and Classification of Their Deformation Modes","authors":"Xiwei Pan (1) and Yichao Zhu (1,2) ((1) Department of Engineering\n  Mechanics, Dalian University of Technology, (2) State Key Laboratory of\n  Structural Analysis, Optimization and CAE Software for Industrial Equipment)","authorsParsed":[["Pan","Xiwei",""],["Zhu","Yichao",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 14:03:01 GMT"},{"version":"v2","created":"Sat, 14 Sep 2024 07:43:40 GMT"}],"updateDate":"2024-09-17","timestamp":1720447381000,"abstract":"  Shell structures are generally modeled based on kinematic hypotheses, where\nsome of the parameters are preferentially evaluated in a phenomenological\nmanner. In this article, asymptotic analysis against the underlying\nthree-dimensional equation system is considered so as to provide a rational\nframework for modeling and interpreting the deformation behavior of\nmulti-layered thin shells (MTSs). Capable of accurate predictions of not only\nthe overall stiffness of MTSs, but also the detailed stress distribution, the\nproposed shell theory shows its distinguishing features at least in the\nfollowing aspects. Firstly, it naturally introduces a rule for classifying the\ndeformation modes of MTSs. One mode resembles a plate, where the transverse\nload is withstood through bending, while the other is like a supporting\nstructure, where the load gets conducted to adjacent inclined sections.\nSecondly, in contrast with the existing arguments where an applied shear load\non the shell surface necessitates the inclusion of transverse shear stresses\nfor analysis, it is demonstrated that a leading-order multi-layered shell\ntheory derived from asymptotic analysis should suffice to output satisfactory\npredictions over the shell stiffness, as well as its internal stress\ndistribution. Numerical examples of the deformation and strength analysis for\nMTSs are also presented to show the reliability of the leading-order model.\n","subjects":["Condensed Matter/Materials Science","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}