{"id":"2407.05249","title":"RIS-assisted Coverage Enhancement in mmWave Integrated Sensing and\n  Communication Networks","authors":"Xu Gan, Chongwen Huang, Zhaohui Yang, Xiaoming Chen, Faouzi Bader,\n  Zhaoyang Zhang, Chau Yuen, Yong Liang Guan, Merouane Debbah","authorsParsed":[["Gan","Xu",""],["Huang","Chongwen",""],["Yang","Zhaohui",""],["Chen","Xiaoming",""],["Bader","Faouzi",""],["Zhang","Zhaoyang",""],["Yuen","Chau",""],["Guan","Yong Liang",""],["Debbah","Merouane",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 03:36:28 GMT"}],"updateDate":"2024-07-09","timestamp":1720323388000,"abstract":"  Integrated sensing and communication (ISAC) has emerged as a promising\ntechnology to facilitate high-rate communications and super-resolution sensing,\nparticularly operating in the millimeter wave (mmWave) band. However, the\nvulnerability of mmWave signals to blockages severely impairs ISAC capabilities\nand coverage. To tackle this, an efficient and low-cost solution is to deploy\ndistributed reconfigurable intelligent surfaces (RISs) to construct virtual\nlinks between the base stations (BSs) and users in a controllable fashion. In\nthis paper, we investigate the generalized RIS-assisted mmWave ISAC networks\nconsidering the blockage effect, and examine the beneficial impact of RISs on\nthe coverage rate utilizing stochastic geometry. Specifically, taking into\naccount the coupling effect of ISAC dual functions within the same network\ntopology, we derive the conditional coverage probability of ISAC performance\nfor two association cases, based on the proposed beam pattern model and user\nassociation policies. Then, the marginal coverage rate is calculated by\ncombining these two cases through the distance-dependent thinning method.\nSimulation results verify the accuracy of derived theoretical formulations and\nprovide valuable guidelines for the practical network deployment. Specifically,\nour results indicate the superiority of the RIS deployment with the density of\n40 km${}^{-2}$ BSs, and that the joint coverage rate of ISAC performance\nexhibits potential growth from $67.1\\%$ to $92.2\\%$ with the deployment of\nRISs.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}