{"id":"2407.13417","title":"GDDS: A Single Domain Generalized Defect Detection Frame of Open World\n  Scenario using Gather and Distribute Domain-shift Suppression Network","authors":"Haiyong Chen, Yaxiu Zhang, Yan Zhang, Xin Zhang, Xingwei Yan","authorsParsed":[["Chen","Haiyong",""],["Zhang","Yaxiu",""],["Zhang","Yan",""],["Zhang","Xin",""],["Yan","Xingwei",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 11:40:43 GMT"}],"updateDate":"2024-07-19","timestamp":1721302843000,"abstract":"  Efficient and intelligent surface defect detection of photovoltaic modules is\ncrucial for improving the quality of photovoltaic modules and ensuring the\nreliable operation of large-scale infrastructure. However, the scenario\ncharacteristics of data distribution deviation make the construction of defect\ndetection models for open world scenarios such as photovoltaic manufacturing\nand power plant inspections a challenge. Therefore, we propose the Gather and\nDistribute Domain shift Suppression Network (GDDS). It adopts a single domain\ngeneralized method that is completely independent of the test samples to\naddress the problem of distribution shift. Using a one-stage network as the\nbaseline network breaks through the limitations of traditional domain\ngeneralization methods that typically use two-stage networks. It not only\nbalances detection accuracy and speed but also simplifies the model deployment\nand application process. The GDDS includes two modules: DeepSpine Module and\nGather and Distribute Module. Specifically, the DeepSpine Module applies a\nwider range of contextual information and suppresses background style shift by\nacquiring and concatenating multi-scale features. The Gather and Distribute\nModule collects and distributes global information to achieve cross layer\ninteractive learning of multi-scale channel features and suppress defect\ninstance shift. Furthermore, the GDDS utilizes normalized Wasserstein distance\nfor similarity measurement, reducing measurement errors caused by bounding box\nposition deviations. We conducted a comprehensive evaluation of GDDS on the EL\nendogenous shift dataset and Photovoltaic inspection infrared image dataset.\nThe experimental results showed that GDDS can adapt to defect detection in open\nworld scenarios faster and better than other state-of-the-art methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}