{"id":"2407.18903","title":"Using high-fidelity discrete element simulation to calibrate an\n  expeditious terramechanics model in a multibody dynamics framework","authors":"Yuemin Zhang and Junpeng Dai and Wei Hu and Dan Negrut","authorsParsed":[["Zhang","Yuemin",""],["Dai","Junpeng",""],["Hu","Wei",""],["Negrut","Dan",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:56:13 GMT"}],"updateDate":"2024-07-29","timestamp":1722016573000,"abstract":"  The wheel-soil interaction has great impact on the dynamics of off-road\nvehicles in terramechanics applications. The Soil Contact Model (SCM), which\nanchors an empirical method to characterize the frictional contact between a\nwheel and soil, has been widely used in off-road vehicle dynamics simulations\nbecause it quickly produces adequate results for many terramechanics\napplications. The SCM approach calls for a set of model parameters that are\nobtained via a bevameter test. This test is expensive and time consuming to\ncarry out, and in some cases difficult to set up, e.g., in extraterrestrial\napplications. We propose an approach to address these concerns by conducting\nthe bevameter test in simulation, using a model that captures the physics of\nthe actual experiment with high fidelity. To that end, we model the bevameter\ntest rig as a multibody system, while the dynamics of the soil is captured\nusing a discrete element model (DEM). The multibody dynamics--soil dynamics\nco-simulation is used to replicate the bevameter test, producing high-fidelity\nground truth test data that is subsequently used to calibrate the SCM\nparameters within a Bayesian inference framework. To test the accuracy of the\nresulting SCM terramechanics, we run single wheel and full rover simulations\nusing both DEM and SCM terrains. The SCM results match well with those produced\nby the DEM solution, and the simulation time for SCM is two to three orders of\nmagnitude lower than that of DEM. All simulations in this work are performed\nusing Chrono, an open-source, publicly available simulator. The scripts and\nmodels used are available in a public repository for reproducibility studies\nand further research.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}