{"id":"2407.03033","title":"ISWSST: Index-space-wave State Superposition Transformers for\n  Multispectral Remotely Sensed Imagery Semantic Segmentation","authors":"Chang Li, Pengfei Zhang, Yu Wang","authorsParsed":[["Li","Chang",""],["Zhang","Pengfei",""],["Wang","Yu",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 11:54:17 GMT"}],"updateDate":"2024-07-04","timestamp":1720007657000,"abstract":"  Currently the semantic segmentation task of multispectral remotely sensed\nimagery (MSRSI) faces the following problems: 1) Usually, only single domain\nfeature (i.e., space domain or frequency domain) is considered; 2) downsampling\noperation in encoder generally leads to the accuracy loss of edge extraction;\n3) multichannel features of MSRSI are not fully considered; and 4) prior\nknowledge of remote sensing is not fully utilized. To solve the aforementioned\nissues, an index-space-wave state superposition Transformer (ISWSST) is the\nfirst to be proposed for MSRSI semantic segmentation by the inspiration from\nquantum mechanics, whose superiority is as follows: 1) index, space and wave\nstates are superposed or fused to simulate quantum superposition by adaptively\nvoting decision (i.e., ensemble learning idea) for being a stronger classifier\nand improving the segmentation accuracy; 2) a lossless wavelet pyramid\nencoder-decoder module is designed to losslessly reconstruct image and simulate\nquantum entanglement based on wavelet transform and inverse wavelet transform\nfor avoiding the edge extraction loss; 3) combining multispectral features\n(i.e. remote sensing index and channel attention mechanism) is proposed to\naccurately extract ground objects from original resolution images; and 4)\nquantum mechanics are introduced to interpret the underlying superiority of\nISWSST. Experiments show that ISWSST is validated and superior to the\nstate-of-the-art architectures for the MSRSI segmentation task, which improves\nthe segmentation and edge extraction accuracy effectively. Codes will be\navailable publicly after our paper is accepted.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}