{"id":"2407.02439","title":"Predicting Visual Attention in Graphic Design Documents","authors":"Souradeep Chakraborty, Zijun Wei, Conor Kelton, Seoyoung Ahn, Aruna\n  Balasubramanian, Gregory J. Zelinsky, Dimitris Samaras","authorsParsed":[["Chakraborty","Souradeep",""],["Wei","Zijun",""],["Kelton","Conor",""],["Ahn","Seoyoung",""],["Balasubramanian","Aruna",""],["Zelinsky","Gregory J.",""],["Samaras","Dimitris",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 17:15:21 GMT"}],"updateDate":"2024-07-03","timestamp":1719940521000,"abstract":"  We present a model for predicting visual attention during the free viewing of\ngraphic design documents. While existing works on this topic have aimed at\npredicting static saliency of graphic designs, our work is the first attempt to\npredict both spatial attention and dynamic temporal order in which the document\nregions are fixated by gaze using a deep learning based model. We propose a\ntwo-stage model for predicting dynamic attention on such documents, with\nwebpages being our primary choice of document design for demonstration. In the\nfirst stage, we predict the saliency maps for each of the document components\n(e.g. logos, banners, texts, etc. for webpages) conditioned on the type of\ndocument layout. These component saliency maps are then jointly used to predict\nthe overall document saliency. In the second stage, we use these\nlayout-specific component saliency maps as the state representation for an\ninverse reinforcement learning model of fixation scanpath prediction during\ndocument viewing. To test our model, we collected a new dataset consisting of\neye movements from 41 people freely viewing 450 webpages (the largest dataset\nof its kind). Experimental results show that our model outperforms existing\nmodels in both saliency and scanpath prediction for webpages, and also\ngeneralizes very well to other graphic design documents such as comics,\nposters, mobile UIs, etc. and natural images.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"V_JDhqPSG4qrgFbBmzrnHzD5dajByhriMW7n5-kIJHw","pdfSize":"13457622","objectId":"0x6f0b53c7da2e6ce920d8ea620b241e1d52afa8cede01a5b3f5d8137934a97e76","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
