{"id":"2407.05365","title":"ElecBench: a Power Dispatch Evaluation Benchmark for Large Language\n  Models","authors":"Xiyuan Zhou, Huan Zhao, Yuheng Cheng, Yuji Cao, Gaoqi Liang, Guolong\n  Liu, Wenxuan Liu, Yan Xu, Junhua Zhao","authorsParsed":[["Zhou","Xiyuan",""],["Zhao","Huan",""],["Cheng","Yuheng",""],["Cao","Yuji",""],["Liang","Gaoqi",""],["Liu","Guolong",""],["Liu","Wenxuan",""],["Xu","Yan",""],["Zhao","Junhua",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 13:38:05 GMT"},{"version":"v2","created":"Sun, 11 Aug 2024 11:11:32 GMT"}],"updateDate":"2024-08-13","timestamp":1720359485000,"abstract":"  In response to the urgent demand for grid stability and the complex\nchallenges posed by renewable energy integration and electricity market\ndynamics, the power sector increasingly seeks innovative technological\nsolutions. In this context, large language models (LLMs) have become a key\ntechnology to improve efficiency and promote intelligent progress in the power\nsector with their excellent natural language processing, logical reasoning, and\ngeneralization capabilities. Despite their potential, the absence of a\nperformance evaluation benchmark for LLM in the power sector has limited the\neffective application of these technologies. Addressing this gap, our study\nintroduces \"ElecBench\", an evaluation benchmark of LLMs within the power\nsector. ElecBench aims to overcome the shortcomings of existing evaluation\nbenchmarks by providing comprehensive coverage of sector-specific scenarios,\ndeepening the testing of professional knowledge, and enhancing decision-making\nprecision. The framework categorizes scenarios into general knowledge and\nprofessional business, further divided into six core performance metrics:\nfactuality, logicality, stability, security, fairness, and expressiveness, and\nis subdivided into 24 sub-metrics, offering profound insights into the\ncapabilities and limitations of LLM applications in the power sector. To ensure\ntransparency, we have made the complete test set public, evaluating the\nperformance of eight LLMs across various scenarios and metrics. ElecBench\naspires to serve as the standard benchmark for LLM applications in the power\nsector, supporting continuous updates of scenarios, metrics, and models to\ndrive technological progress and application.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}