{"id":"2407.03270","title":"Lattices, Gates, and Curves: GKP codes as a Rosetta stone","authors":"Jonathan Conrad, Ansgar G. Burchards, Steven T. Flammia","authorsParsed":[["Conrad","Jonathan",""],["Burchards","Ansgar G.",""],["Flammia","Steven T.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 16:57:53 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 08:06:26 GMT"}],"updateDate":"2024-07-11","timestamp":1720025873000,"abstract":"  Gottesman-Kitaev-Preskill (GKP) codes are a promising candidate for\nimplementing fault tolerant quantum computation in quantum harmonic oscillator\nsystems such as superconducting resonators, optical photons and trapped ions,\nand in recent years theoretical and experimental evidence for their utility has\nsteadily grown. It is known that logical Clifford operations on GKP codes can\nbe implemented fault tolerantly using only Gaussian operations, and several\ntheoretical investigations have illuminated their general structure. In this\nwork, we explain how GKP Clifford gates arise as symplectic automorphisms of\nthe corresponding GKP lattice and show how they are identified with the mapping\nclass group of suitable genus $n$ surfaces. This correspondence introduces a\ntopological interpretation of fault tolerance for GKP codes and motivates the\nconnection between GKP codes (lattices), their Clifford gates, and algebraic\ncurves, which we explore in depth. For a single-mode GKP code, we identify the\nspace of all GKP codes with the moduli space of elliptic curves, given by the\nthree sphere with a trefoil knot removed, and explain how logical degrees of\nfreedom arise from the choice of a level structure on the corresponding curves.\nWe discuss how the implementation of Clifford gates corresponds to\nhomotopically nontrivial loops on the space of all GKP codes and show that the\nmodular Rademacher function describes a topological invariant for certain\nClifford gates implemented by such loops. Finally, we construct a universal\nfamily of GKP codes and show how it gives rise to an explicit construction of\nfiber bundle fault tolerance as proposed by Gottesman and Zhang for the GKP\ncode. On our path towards understanding this correspondence, we introduce a\ngeneral algebraic geometric perspective on GKP codes and their moduli spaces,\nwhich uncovers a map towards many possible routes of future research.\n","subjects":["Physics/Quantum Physics","Physics/Mathematical Physics","Mathematics/Algebraic Geometry","Mathematics/Differential Geometry","Mathematics/Geometric Topology","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}