{"id":"2407.06889","title":"A Neurosymbolic Approach to Adaptive Feature Extraction in SLAM","authors":"Yasra Chandio, Momin A. Khan, Khotso Selialia, Luis Garcia, Joseph\n  DeGol, Fatima M. Anwar","authorsParsed":[["Chandio","Yasra",""],["Khan","Momin A.",""],["Selialia","Khotso",""],["Garcia","Luis",""],["DeGol","Joseph",""],["Anwar","Fatima M.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 14:18:35 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 15:12:08 GMT"},{"version":"v3","created":"Tue, 27 Aug 2024 00:03:31 GMT"}],"updateDate":"2024-08-28","timestamp":1720534715000,"abstract":"  Autonomous robots, autonomous vehicles, and humans wearing mixed-reality\nheadsets require accurate and reliable tracking services for safety-critical\napplications in dynamically changing real-world environments. However, the\nexisting tracking approaches, such as Simultaneous Localization and Mapping\n(SLAM), do not adapt well to environmental changes and boundary conditions\ndespite extensive manual tuning. On the other hand, while deep learning-based\napproaches can better adapt to environmental changes, they typically demand\nsubstantial data for training and often lack flexibility in adapting to new\ndomains. To solve this problem, we propose leveraging the neurosymbolic program\nsynthesis approach to construct adaptable SLAM pipelines that integrate the\ndomain knowledge from traditional SLAM approaches while leveraging data to\nlearn complex relationships. While the approach can synthesize end-to-end SLAM\npipelines, we focus on synthesizing the feature extraction module. We first\ndevise a domain-specific language (DSL) that can encapsulate domain knowledge\non the important attributes for feature extraction and the real-world\nperformance of various feature extractors. Our neurosymbolic architecture then\nundertakes adaptive feature extraction, optimizing parameters via learning\nwhile employing symbolic reasoning to select the most suitable feature\nextractor. Our evaluations demonstrate that our approach, neurosymbolic Feature\nEXtraction (nFEX), yields higher-quality features. It also reduces the pose\nerror observed for the state-of-the-art baseline feature extractors ORB and\nSIFT by up to 90% and up to 66%, respectively, thereby enhancing the system's\nefficiency and adaptability to novel environments.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Symbolic Computation"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"7f6_LGC8wNpauK1kXR1JLfuNntcPEyrMgCdqQ0yZhUc","pdfSize":"854682"}
