{"id":"2407.01247","title":"Multi-level Reliable Guidance for Unpaired Multi-view Clustering","authors":"Like Xin, Wanqi Yang, Lei Wang, Ming Yang","authorsParsed":[["Xin","Like",""],["Yang","Wanqi",""],["Wang","Lei",""],["Yang","Ming",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 12:49:55 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 09:55:26 GMT"}],"updateDate":"2024-07-03","timestamp":1719838195000,"abstract":"  In this paper, we address the challenging problem of unpaired multi-view\nclustering (UMC), aiming to perform effective joint clustering using unpaired\nobserved samples across multiple views. Commonly, traditional incomplete\nmulti-view clustering (IMC) methods often depend on paired samples to capture\ncomplementary information between views. However, the strategy becomes\nimpractical in UMC due to the absence of paired samples. Although some\nresearchers have attempted to tackle the issue by preserving consistent cluster\nstructures across views, they frequently neglect the confidence of these\ncluster structures, especially for boundary samples and uncertain cluster\nstructures during the initial training. Therefore, we propose a method called\nMulti-level Reliable Guidance for UMC (MRG-UMC), which leverages multi-level\nclustering to aid in learning a trustworthy cluster structure across\ninner-view, cross-view, and common-view, respectively. Specifically, within\neach view, multi-level clustering fosters a trustworthy cluster structure\nacross different levels and reduces clustering error. In cross-view learning,\nreliable view guidance enhances the confidence of the cluster structures in\nother views. Similarly, within the multi-level framework, the incorporation of\na common view aids in aligning different views, thereby reducing the clustering\nerror and uncertainty of cluster structure. Finally, as evidenced by extensive\nexperiments, our method for UMC demonstrates significant efficiency\nimprovements compared to 20 state-of-the-art methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}