{"id":"2407.06689","title":"Finding planets via gravitational microlensing","authors":"Natalia E. Rektsini, Virginie Batista","authorsParsed":[["Rektsini","Natalia E.",""],["Batista","Virginie",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 09:03:38 GMT"}],"updateDate":"2024-07-10","timestamp":1720515818000,"abstract":"  Since the first microlensing planet discovery in 2003, more than 200 planets\nhave been detected with gravitational microlensing, in addition to several\nfree-floating planet and black hole candidates. In this chapter the\nmicrolensing theory is presented by introducing the numerical methods used to\nsolve binary and triple lens problems and how these lead to the\ncharacterisation of the planetary systems. Then the microlensing planetary\ndetection efficiency is discussed, with an emphasis on cold planets beyond the\nsnow line. Furthermore, it will be explained how the planetary characterisation\ncan be facilitated when the microlensing light curves exhibit distortions due\nto second order effects such as parallax, planetary orbital motion, and\nextended source. These second order effects can be turned to our advantage, and\nbecome useful to ultimately better characterise the planetary systems, but they\ncan also introduce degeneracies in the light curve models. It will be explained\nhow the use of modern observational and computational techniques enables\nmicrolensers to solve these degeneracies and estimate the planetary system\nparameters with very high accuracy. Then a review of the main discoveries to\ndate will be presented while exploring the recent statistical results from\nhigh-cadence ground-based surveys and space-based observations, especially on\nthe planet mass function. Finally, future prospects are discussed, with the\nexpected advances from dedicated space missions, extending the planet\nsensitivity range down to Mars mass.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fhv7N3gFuIKfWQL3IwUSHlp8MKBFY4TC6exI6ar7ruc","pdfSize":"3587856"}
