{"id":"2407.02442","title":"A New Achievable Region of the $K$-User MAC Wiretap Channel with\n  Confidential and Open Messages Under Strong Secrecy","authors":"Hao Xu, Kai-Kit Wong, Giuseppe Caire","authorsParsed":[["Xu","Hao",""],["Wong","Kai-Kit",""],["Caire","Giuseppe",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 17:17:53 GMT"}],"updateDate":"2024-07-03","timestamp":1719940673000,"abstract":"  This paper investigates the achievable region of a $K$-user discrete\nmemoryless (DM) multiple access wiretap (MAC-WT) channel, where each user\ntransmits both secret and open messages. All these messages are intended for\nBob, while Eve is only interested in the secret messages. In the achievable\ncoding strategy, the confidential information is protected by open messages and\nalso by the introduction of auxiliary messages. When introducing an auxiliary\nmessage, one has to ensure that, on one hand, its rate is large enough for\nprotecting the secret message from Eve and, on the other hand, the resulting\nsum rate (together with the secret and open message rate) does not exceed Bob's\ndecoding capability. This yields an inequality structure involving the rates of\nall users' secret, open, and auxiliary messages. To obtain the rate region, the\nauxiliary message rates must be eliminated from the system of inequalities. A\ndirect application of the Fourier-Motzkin elimination procedure is elusive\nsince a) it requires that the number of users $K$ is explicitly given, and b)\neven for small $K = 3, 4, \\ldots$, the number of inequalities becomes extremely\nlarge. We prove the result for general $K$ through the combined use of\nFourier-Motzkin elimination procedure and mathematical induction. This paper\nadopts the strong secrecy metric, characterized by information leakage. To\nprove the achievability under this criterion, we analyze the resolvability\nregion of a $K$-user DM-MAC channel. In addition, we show that users with zero\nsecrecy rate can play different roles and use different strategies in encoding\ntheir messages. These strategies yield non-redundant rate inequalities. By\nconsidering all possible coding strategies, we provide a new achievable region\nfor the considered channel, and show that it strictly improves those already\nknown in the existing literature by considering a specific example.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}