{"id":"2407.11607","title":"Pseudorandom density matrices","authors":"Nikhil Bansal, Wai-Keong Mok, Kishor Bharti, Dax Enshan Koh, Tobias\n  Haug","authorsParsed":[["Bansal","Nikhil",""],["Mok","Wai-Keong",""],["Bharti","Kishor",""],["Koh","Dax Enshan",""],["Haug","Tobias",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 11:14:58 GMT"}],"updateDate":"2024-07-17","timestamp":1721128498000,"abstract":"  Pseudorandom states (PRSs) are state ensembles that cannot be distinguished\nfrom Haar random states by any efficient quantum algorithm. However, the\ndefinition of PRSs has been limited to pure states and lacks robustness against\nnoise. In this work, we introduce pseudorandom density matrices (PRDMs),\nensembles of $n$-qubit states that are computationally indistinguishable from\nthe generalized Hilbert-Schmidt ensemble, which is constructed from\n$(n+m)$-qubit Haar random states with $m$ qubits traced out. For a mixedness\nparameter $m=0$, PRDMs are equivalent to PRSs, whereas for $m=\\omega(\\log n)$,\nPRDMs are computationally indistinguishable from the maximally mixed state. In\ncontrast to PRSs, PRDMs with $m=\\omega(\\log n)$ are robust to unital noise\nchannels and a recently introduced $\\mathsf{PostBQP}$ attack. Further, we\nconstruct pseudomagic and pseudocoherent state ensembles, which possess\nnear-maximal magic and coherence, but are computationally indistinguishable\nfrom states with zero magic and coherence. PRDMs can exhibit a pseudoresource\ngap of $\\Theta(n)$ vs $0$, surpassing previously found gaps. We introduce\nnoise-robust EFI pairs, which are state ensembles that are computationally\nindistinguishable yet statistically far, even when subject to noise. We show\nthat testing entanglement, magic and coherence is not efficient. Further, we\nprove that black-box resource distillation requires a superpolynomial number of\ncopies. We also establish lower bounds on the purity needed for efficient\ntesting and black-box distillation. Finally, we introduce memoryless PRSs, a\nnoise-robust notion of PRS which are indistinguishable to Haar random states\nfor efficient algorithms without quantum memory. Our work provides a\ncomprehensive framework of pseudorandomness for mixed states, which yields\npowerful quantum cryptographic primitives and fundamental bounds on quantum\nresource theories.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Computational Complexity","Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}