{"id":"2407.20720","title":"Supernova Polarization Signals From the Interaction with a Dense\n  Circumstellar Disk","authors":"Xudong Wen, He Gao, Yi Yang, Liangduan Liu, Shunke Ai and Zongkai Peng","authorsParsed":[["Wen","Xudong",""],["Gao","He",""],["Yang","Yi",""],["Liu","Liangduan",""],["Ai","Shunke",""],["Peng","Zongkai",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 10:33:10 GMT"}],"updateDate":"2024-07-31","timestamp":1722335590000,"abstract":"  There is increasing evidence that massive stars may exhibit an enhanced mass\nloss shortly before their termination explosion. Some of them also indicate the\nenhancement of their circumstellar matter (CSM) is not spherically symmetric.\nSupernova (SN) interacting with aspherical CSM could induce special\npolarization signals from multiple radiation components that deviate from\nspherical symmetry. We investigate the time-evolution of the continuum\npolarization induced by the SN ejecta interacting with a disk/torus-like CSM.\nOur calculation suggests that the interaction between the SN ejecta and an\nimmediate disk-like CSM with a thin, homogenous density structure would produce\na high continuum polarization, which may reach a peak level of $\\sim$15\\%. The\ninterplay between the evolving geometry of the emitting regions and the\ntime-variant flux ratio between the polar ejecta and the equatorial CSM\ninteraction may produce a double-peaked feature in the polarization time\nsequence. A similar trend of the time evolution of the polarization is also\nfound for a radially extended CSM disk that exhibits a wind-like density\nstructure, with an overall relatively lower level of continuum polarization\n($<2.5\\%$) during the interaction process. We also identify a non-uniform\ntemperature distribution along the radial direction of the CSM disk, which\nyields a strong wavelength dependence of the continuum polarization. These\nsignatures provide a unique geometric diagnostic to explore the interaction\nprocess and the associated extreme mass loss of the progenitors of interacting\ntransients.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"G2DzEWwPAsHAntJHf7Ii0yD1ZHaJddnJ5JlqeqiuTW4","pdfSize":"20898154"}
