{"id":"2407.03307","title":"HoloHisto: End-to-end Gigapixel WSI Segmentation with 4K Resolution\n  Sequential Tokenization","authors":"Yucheng Tang, Yufan He, Vishwesh Nath, Pengfeig Guo, Ruining Deng,\n  Tianyuan Yao, Quan Liu, Can Cui, Mengmeng Yin, Ziyue Xu, Holger Roth, Daguang\n  Xu, Haichun Yang, Yuankai Huo","authorsParsed":[["Tang","Yucheng",""],["He","Yufan",""],["Nath","Vishwesh",""],["Guo","Pengfeig",""],["Deng","Ruining",""],["Yao","Tianyuan",""],["Liu","Quan",""],["Cui","Can",""],["Yin","Mengmeng",""],["Xu","Ziyue",""],["Roth","Holger",""],["Xu","Daguang",""],["Yang","Haichun",""],["Huo","Yuankai",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 17:49:31 GMT"}],"updateDate":"2024-07-04","timestamp":1720028971000,"abstract":"  In digital pathology, the traditional method for deep learning-based image\nsegmentation typically involves a two-stage process: initially segmenting\nhigh-resolution whole slide images (WSI) into smaller patches (e.g., 256x256,\n512x512, 1024x1024) and subsequently reconstructing them to their original\nscale. This method often struggles to capture the complex details and vast\nscope of WSIs. In this paper, we propose the holistic histopathology\n(HoloHisto) segmentation method to achieve end-to-end segmentation on gigapixel\nWSIs, whose maximum resolution is above 80,000$\\times$70,000 pixels. HoloHisto\nfundamentally shifts the paradigm of WSI segmentation to an end-to-end learning\nfashion with 1) a large (4K) resolution base patch for elevated visual\ninformation inclusion and efficient processing, and 2) a novel sequential\ntokenization mechanism to properly model the contextual relationships and\nefficiently model the rich information from the 4K input. To our best\nknowledge, HoloHisto presents the first holistic approach for gigapixel\nresolution WSI segmentation, supporting direct I/O of complete WSI and their\ncorresponding gigapixel masks. Under the HoloHisto platform, we unveil a random\n4K sampler that transcends ultra-high resolution, delivering 31 and 10 times\nmore pixels than standard 2D and 3D patches, respectively, for advancing\ncomputational capabilities. To facilitate efficient 4K resolution dense\nprediction, we leverage sequential tokenization, utilizing a pre-trained image\ntokenizer to group image features into a discrete token grid. To assess the\nperformance, our team curated a new kidney pathology image segmentation (KPIs)\ndataset with WSI-level glomeruli segmentation from whole mouse kidneys. From\nthe results, HoloHisto-4K delivers remarkable performance gains over previous\nstate-of-the-art models.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}