{"id":"2407.16487","title":"DRAM Errors and Cosmic Rays: Space Invaders or Science Fiction?","authors":"Isaac Boixaderas, Jorge Amaya, Sergi Mor\\'e, Javier Bartolome, David\n  Vicente, Osman Unsal, Dimitris Gizopoulos, Paul M. Carpenter, Petar\n  Radojkovi\\'c, Eduard Ayguad\\'e","authorsParsed":[["Boixaderas","Isaac",""],["Amaya","Jorge",""],["Moré","Sergi",""],["Bartolome","Javier",""],["Vicente","David",""],["Unsal","Osman",""],["Gizopoulos","Dimitris",""],["Carpenter","Paul M.",""],["Radojković","Petar",""],["Ayguadé","Eduard",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:01:12 GMT"}],"updateDate":"2024-07-24","timestamp":1721743272000,"abstract":"  It is widely accepted that cosmic rays are a plausible cause of DRAM errors\nin high-performance computing (HPC) systems, and various studies suggest that\nthey could explain some aspects of the observed DRAM error behavior. However,\nthis phenomenon is insufficiently studied in production environments. We\nanalyze the correlations between cosmic rays and DRAM errors on two HPC\nclusters: a production supercomputer with server-class DDR3-1600 and a\nprototype with LPDDR3-1600 and no hardware error correction. Our error logs\ncover 2000 billion MB-hours for the MareNostrum 3 supercomputer and 135 million\nMB-hours for the Mont-Blanc prototype. Our analysis combines quantitative\nanalysis, formal statistical methods and machine learning. We detect no\nindications that cosmic rays have any influence on the DRAM errors. To\nunderstand whether the findings are specific to systems under study, located at\n100 meters above the sea level, the analysis should be repeated on other HPC\nclusters, especially the ones located on higher altitudes. Also, analysis can\n(and should) be applied to revisit and extend numerous previous studies which\nuse cosmic rays as a hypothetical explanation for some aspects of the observed\nDRAM error behaviors.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aqcdaYoa0k99TjO47KoqzMq80ibcsKBWkyVfiarc-GE","pdfSize":"1014933","objectId":"0xe7ffb4eeda8b9dab5d8547d70541cbd51186e06201d428e5f477babd1732fdb2","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
