{"id":"2407.01800","title":"Normalization and effective learning rates in reinforcement learning","authors":"Clare Lyle and Zeyu Zheng and Khimya Khetarpal and James Martens and\n  Hado van Hasselt and Razvan Pascanu and Will Dabney","authorsParsed":[["Lyle","Clare",""],["Zheng","Zeyu",""],["Khetarpal","Khimya",""],["Martens","James",""],["van Hasselt","Hado",""],["Pascanu","Razvan",""],["Dabney","Will",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 20:58:01 GMT"}],"updateDate":"2024-07-03","timestamp":1719867481000,"abstract":"  Normalization layers have recently experienced a renaissance in the deep\nreinforcement learning and continual learning literature, with several works\nhighlighting diverse benefits such as improving loss landscape conditioning and\ncombatting overestimation bias. However, normalization brings with it a subtle\nbut important side effect: an equivalence between growth in the norm of the\nnetwork parameters and decay in the effective learning rate. This becomes\nproblematic in continual learning settings, where the resulting effective\nlearning rate schedule may decay to near zero too quickly relative to the\ntimescale of the learning problem. We propose to make the learning rate\nschedule explicit with a simple re-parameterization which we call\nNormalize-and-Project (NaP), which couples the insertion of normalization\nlayers with weight projection, ensuring that the effective learning rate\nremains constant throughout training. This technique reveals itself as a\npowerful analytical tool to better understand learning rate schedules in deep\nreinforcement learning, and as a means of improving robustness to\nnonstationarity in synthetic plasticity loss benchmarks along with both the\nsingle-task and sequential variants of the Arcade Learning Environment. We also\nshow that our approach can be easily applied to popular architectures such as\nResNets and transformers while recovering and in some cases even slightly\nimproving the performance of the base model in common stationary benchmarks.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BQMVcQTLLWCgN6-6h2atFjioiGaNUDZv_1FdmFbhUrU","pdfSize":"6887212"}
