{"id":"2407.21042","title":"Post$-$operative glioblastoma cancer cell distribution in the\n  peritumoural oedema","authors":"Andrei Ciprian Macarie, Szabolcs Suveges, Mohamed Okasha, Kismet\n  Hossain-Ibrahim, J Douglas Steele, and Dumitru Trucu","authorsParsed":[["Macarie","Andrei Ciprian",""],["Suveges","Szabolcs",""],["Okasha","Mohamed",""],["Hossain-Ibrahim","Kismet",""],["Steele","J Douglas",""],["Trucu","Dumitru",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 20:38:22 GMT"}],"updateDate":"2024-08-01","timestamp":1721594302000,"abstract":"  Glioblastoma multiforme (GBM), the most aggressive primary brain tumour,\nexhibits low survival rates due to its rapid growth, infiltrates surrounding\nbrain tissue, and is highly resistant to treatment. One major challenge is\noedema infiltration, a fluid build$-$up that provides a path for cancer cells\nto invade other areas. MRI resolution is insufficient to detect these\ninfiltrating cells, leading to relapses despite chemotherapy and radiotherapy.\nIn this work, we propose a new multiscale mathematical modelling method, to\nexplore the oedema infiltration and predict tumour relapses. To address tumour\nrelapses, we investigated several possible scenarios for the distribution of\nremaining GBM cells within the oedema after surgery. Furthermore, in this\ncomputational modelling investigation on tumour relapse scenarios were\ninvestigated assuming the presence of clinically relevant chemo$-$radio therapy\nnumerical results suggest that a higher concentration of GBM cells near the\nsurgical cavity edge led to limited spread and slower progression of tumour\nrelapse. Finally, we explore mathematical and computational avenues for\nreconstructing relevant shapes for the initial distributions of GBM cells\nwithin the oedema from available MRI scans. The results obtained show good\noverlap between our simulation and the patient serial MRI scans taken 881 days\ninto the treatment. While still under analytical investigation, this work paves\nthe way for robust reconstruction of tumour relapses from available clinical\ndata.\n","subjects":["Physics/Medical Physics","Mathematics/Dynamical Systems","Quantitative Biology/Quantitative Methods"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}