{"id":"2407.02109","title":"HRSAM: Efficiently Segment Anything in High-Resolution Images","authors":"You Huang, Wenbin Lai, Jiayi Ji, Liujuan Cao, Shengchuan Zhang,\n  Rongrong Ji","authorsParsed":[["Huang","You",""],["Lai","Wenbin",""],["Ji","Jiayi",""],["Cao","Liujuan",""],["Zhang","Shengchuan",""],["Ji","Rongrong",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 09:51:56 GMT"}],"updateDate":"2024-07-03","timestamp":1719913916000,"abstract":"  The Segment Anything Model (SAM) has significantly advanced interactive\nsegmentation but struggles with high-resolution images crucial for\nhigh-precision segmentation. This is primarily due to the quadratic space\ncomplexity of SAM-implemented attention and the length extrapolation issue in\ncommon global attention. This study proposes HRSAM that integrates Flash\nAttention and incorporates Plain, Shifted and newly proposed Cycle-scan Window\n(PSCWin) attention to address these issues. The shifted window attention is\nredesigned with padding to maintain consistent window sizes, enabling effective\nlength extrapolation. The cycle-scan window attention adopts the recently\ndeveloped State Space Models (SSMs) to ensure global information exchange with\nminimal computational overhead. Such window-based attention allows HRSAM to\nperform effective attention computations on scaled input images while\nmaintaining low latency. Moreover, we further propose HRSAM++ that additionally\nemploys a multi-scale strategy to enhance HRSAM's performance. The experiments\non the high-precision segmentation datasets HQSeg44K and DAVIS show that\nhigh-resolution inputs enable the SAM-distilled HRSAM models to outperform the\nteacher model while maintaining lower latency. Compared to the SOTAs, HRSAM\nachieves a 1.56 improvement in interactive segmentation's NoC95 metric with\nonly 31% of the latency. HRSAM++ further enhances the performance, achieving a\n1.63 improvement in NoC95 with just 38% of the latency.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}