{"id":"2407.17234","title":"Intent-guided Heterogeneous Graph Contrastive Learning for\n  Recommendation","authors":"Lei Sang, Yu Wang, Yi Zhang, Yiwen Zhang, Xindong Wu","authorsParsed":[["Sang","Lei",""],["Wang","Yu",""],["Zhang","Yi",""],["Zhang","Yiwen",""],["Wu","Xindong",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 12:42:41 GMT"},{"version":"v2","created":"Sun, 28 Jul 2024 15:00:40 GMT"}],"updateDate":"2024-07-30","timestamp":1721824961000,"abstract":"  Contrastive Learning (CL)-based recommender systems have gained prominence in\nthe context of Heterogeneous Graph (HG) due to their capacity to enhance the\nconsistency of representations across different views. However, existing\nframeworks often neglect the fact that user-item interactions within HG are\ngoverned by diverse latent intents (e.g., brand preferences or demographic\ncharacteristics of item audiences), which are pivotal in capturing fine-grained\nrelations. The exploration of these underlying intents, particularly through\nthe lens of meta-paths in HGs, presents us with two principal challenges: i)\nHow to integrate CL with intents; ii) How to mitigate noise from\nmeta-path-driven intents.\n  To address these challenges, we propose an innovative framework termed\nIntent-guided Heterogeneous Graph Contrastive Learning (IHGCL), which designed\nto enhance CL-based recommendation by capturing the intents contained within\nmeta-paths. Specifically, the IHGCL framework includes: i) a meta-path-based\nDual Contrastive Learning (DCL) approach to effectively integrate intents into\nthe recommendation, constructing intent-intent contrast and intent-interaction\ncontrast; ii) a Bottlenecked AutoEncoder (BAE) that combines mask propagation\nwith the information bottleneck principle to significantly reduce noise\nperturbations introduced by meta-paths. Empirical evaluations conducted across\nsix distinct datasets demonstrate the superior performance of our IHGCL\nframework relative to conventional baseline methods. Our model implementation\nis available at https://github.com/wangyu0627/IHGCL.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}