{"id":"2407.02887","title":"Explicitly Guided Information Interaction Network for Cross-modal Point\n  Cloud Completion","authors":"Hang Xu, Chen Long, Wenxiao Zhang, Yuan Liu, Zhen Cao, Zhen Dong,\n  Bisheng Yang","authorsParsed":[["Xu","Hang",""],["Long","Chen",""],["Zhang","Wenxiao",""],["Liu","Yuan",""],["Cao","Zhen",""],["Dong","Zhen",""],["Yang","Bisheng",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 08:03:56 GMT"},{"version":"v2","created":"Thu, 4 Jul 2024 08:57:47 GMT"},{"version":"v3","created":"Tue, 23 Jul 2024 03:03:54 GMT"}],"updateDate":"2024-07-24","timestamp":1719993836000,"abstract":"  In this paper, we explore a novel framework, EGIInet (Explicitly Guided\nInformation Interaction Network), a model for View-guided Point cloud\nCompletion (ViPC) task, which aims to restore a complete point cloud from a\npartial one with a single view image. In comparison with previous methods that\nrelied on the global semantics of input images, EGIInet efficiently combines\nthe information from two modalities by leveraging the geometric nature of the\ncompletion task. Specifically, we propose an explicitly guided information\ninteraction strategy supported by modal alignment for point cloud completion.\nFirst, in contrast to previous methods which simply use 2D and 3D backbones to\nencode features respectively, we unified the encoding process to promote modal\nalignment. Second, we propose a novel explicitly guided information interaction\nstrategy that could help the network identify critical information within\nimages, thus achieving better guidance for completion. Extensive experiments\ndemonstrate the effectiveness of our framework, and we achieved a new\nstate-of-the-art (+16% CD over XMFnet) in benchmark datasets despite using\nfewer parameters than the previous methods. The pre-trained model and code and\nare available at https://github.com/WHU-USI3DV/EGIInet.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}