{"id":"2407.05761","title":"Interpretability of Uncertainty: Exploring Cortical Lesion Segmentation\n  in Multiple Sclerosis","authors":"Nataliia Molchanova, Alessandro Cagol, Pedro M. Gordaliza, Mario\n  Ocampo-Pineda, Po-Jui Lu, Matthias Weigel, Xinjie Chen, Adrien Depeursinge,\n  Cristina Granziera, Henning M\\\"uller, Meritxell Bach Cuadra","authorsParsed":[["Molchanova","Nataliia",""],["Cagol","Alessandro",""],["Gordaliza","Pedro M.",""],["Ocampo-Pineda","Mario",""],["Lu","Po-Jui",""],["Weigel","Matthias",""],["Chen","Xinjie",""],["Depeursinge","Adrien",""],["Granziera","Cristina",""],["Müller","Henning",""],["Cuadra","Meritxell Bach",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 09:13:30 GMT"}],"updateDate":"2024-07-09","timestamp":1720430010000,"abstract":"  Uncertainty quantification (UQ) has become critical for evaluating the\nreliability of artificial intelligence systems, especially in medical image\nsegmentation. This study addresses the interpretability of instance-wise\nuncertainty values in deep learning models for focal lesion segmentation in\nmagnetic resonance imaging, specifically cortical lesion (CL) segmentation in\nmultiple sclerosis. CL segmentation presents several challenges, including the\ncomplexity of manual segmentation, high variability in annotation, data\nscarcity, and class imbalance, all of which contribute to aleatoric and\nepistemic uncertainty. We explore how UQ can be used not only to assess\nprediction reliability but also to provide insights into model behavior, detect\nbiases, and verify the accuracy of UQ methods. Our research demonstrates the\npotential of instance-wise uncertainty values to offer post hoc global model\nexplanations, serving as a sanity check for the model. The implementation is\navailable at https://github.com/NataliiaMolch/interpret-lesion-unc.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}