{"id":"2407.12223","title":"Conditional Quantile Estimation for Uncertain Watch Time in Short-Video\n  Recommendation","authors":"Chengzhi Lin, Shuchang Liu, Chuyuan Wang, Yongqi Liu","authorsParsed":[["Lin","Chengzhi",""],["Liu","Shuchang",""],["Wang","Chuyuan",""],["Liu","Yongqi",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 00:25:35 GMT"},{"version":"v2","created":"Sat, 27 Jul 2024 07:58:27 GMT"},{"version":"v3","created":"Wed, 31 Jul 2024 12:49:17 GMT"}],"updateDate":"2024-08-01","timestamp":1721175935000,"abstract":"  Accurately predicting watch time is crucial for optimizing recommendations\nand user experience in short video platforms. However, existing methods that\nestimate a single average watch time often fail to capture the inherent\nuncertainty and diversity in user engagement patterns. In this paper, we\npropose the Conditional Quantile Estimation (CQE) framework to model the entire\nconditional distribution of watch time. Using quantile regression, CQE\ncharacterizes the complex watch-time distribution for each user-video pair,\nproviding a flexible and comprehensive approach to understanding user behavior.\nWe further design multiple strategies to combine the quantile estimates,\nadapting to different recommendation scenarios and user preferences. Extensive\noffline experiments and online A/B tests demonstrate the superiority of CQE in\nwatch time prediction and user engagement modeling. In particular, the online\ndeployment of CQE in KuaiShow has led to significant improvements in key\nevaluation metrics, including active days, active users, engagement duration,\nand video view counts. These results highlight the practical impact of our\nproposed approach in enhancing the user experience and overall performance of\nthe short video recommendation system. The code will be released after\npublication.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"agOIkAxdnXmDNloTtKIlJr6ShcAWJKgRhkKwk7ioFMs","pdfSize":"916222"}
