{"id":"2407.08418","title":"PredBench: Benchmarking Spatio-Temporal Prediction across Diverse\n  Disciplines","authors":"ZiDong Wang and Zeyu Lu and Di Huang and Tong He and Xihui Liu and\n  Wanli Ouyang and Lei Bai","authorsParsed":[["Wang","ZiDong",""],["Lu","Zeyu",""],["Huang","Di",""],["He","Tong",""],["Liu","Xihui",""],["Ouyang","Wanli",""],["Bai","Lei",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 11:51:36 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 02:55:16 GMT"}],"updateDate":"2024-07-15","timestamp":1720698696000,"abstract":"  In this paper, we introduce PredBench, a benchmark tailored for the holistic\nevaluation of spatio-temporal prediction networks. Despite significant progress\nin this field, there remains a lack of a standardized framework for a detailed\nand comparative analysis of various prediction network architectures. PredBench\naddresses this gap by conducting large-scale experiments, upholding\nstandardized and appropriate experimental settings, and implementing\nmulti-dimensional evaluations. This benchmark integrates 12 widely adopted\nmethods with 15 diverse datasets across multiple application domains, offering\nextensive evaluation of contemporary spatio-temporal prediction networks.\nThrough meticulous calibration of prediction settings across various\napplications, PredBench ensures evaluations relevant to their intended use and\nenables fair comparisons. Moreover, its multi-dimensional evaluation framework\nbroadens the analysis with a comprehensive set of metrics, providing deep\ninsights into the capabilities of models. The findings from our research offer\nstrategic directions for future developments in the field. Our codebase is\navailable at https://github.com/OpenEarthLab/PredBench.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QmeZVNO2WPBrxVs_WrYy8dhGMoW3yoVJkgXFvidpc7k","pdfSize":"35506511"}
