{"id":"2407.06362","title":"Self-deployable contracting-cord metamaterials with tunable mechanical\n  properties","authors":"Wenzhong Yan and Talmage Jones and Christopher L. Jawetz and Ryan H.\n  Lee and Jonathan B. Hopkins and Ankur Mehta","authorsParsed":[["Yan","Wenzhong",""],["Jones","Talmage",""],["Jawetz","Christopher L.",""],["Lee","Ryan H.",""],["Hopkins","Jonathan B.",""],["Mehta","Ankur",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 20:04:37 GMT"}],"updateDate":"2024-07-11","timestamp":1720469077000,"abstract":"  Recent advances in active materials and fabrication techniques have enabled\nthe production of cyclically self-deployable metamaterials with an expanded\nfunctionality space. However, designing metamaterials that possess continuously\ntunable mechanical properties after self-deployment remains a challenge,\nnotwithstanding its importance. Inspired by push puppets, we introduce an\nefficient design strategy to create reversibly self-deployable metamaterials\nwith continuously tunable post-deployment stiffness and damping. Our\nmetamaterial comprises contracting actuators threaded through beads with\nmatching conical concavo-convex interfaces in networked chains. The slack\nnetwork conforms to arbitrary shapes, but when actuated, it self-assembles into\na preprogrammed configuration with beads gathered together. Further contraction\nof the actuators can dynamically tune the assembly's mechanical properties\nthrough the beads' particle jamming, while maintaining the overall structure\nwith minimal change. We show that, after deployment, such metamaterials exhibit\npronounced tunability in bending-dominated configurations: they can become more\nthan 35 times stiffer and change their damping capability by over 50%. Through\nsystematic analysis, we find that the beads'conical angle can introduce\ngeometric nonlinearity, which has a major effect on the self-deployability and\ntunability of the metamaterial. Our work provides routes towards reversibly\nself-deployable, lightweight, and tunable metamaterials, with potential\napplications in soft robotics, reconfigurable architectures, and space\nengineering.\n","subjects":["Computing Research Repository/Robotics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}