{"id":"2407.16964","title":"When AI Defeats Password Deception! A Deep Learning Framework to\n  Distinguish Passwords and Honeywords","authors":"Jimmy Dani, Brandon McCulloh, Nitesh Saxena","authorsParsed":[["Dani","Jimmy",""],["McCulloh","Brandon",""],["Saxena","Nitesh",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 03:02:57 GMT"}],"updateDate":"2024-07-25","timestamp":1721790177000,"abstract":"  \"Honeywords\" have emerged as a promising defense mechanism for detecting data\nbreaches and foiling offline dictionary attacks (ODA) by deceiving attackers\nwith false passwords. In this paper, we propose PassFilter, a novel deep\nlearning (DL) based attack framework, fundamental in its ability to identify\npasswords from a set of sweetwords associated with a user account, effectively\nchallenging a variety of honeywords generation techniques (HGTs). The DL model\nin PassFilter is trained with a set of previously collected or adversarially\ngenerated passwords and honeywords, and carefully orchestrated to predict\nwhether a sweetword is the password or a honeyword. Our model can compromise\nthe security of state-of-the-art, heuristics-based, and representation\nlearning-based HGTs proposed by Dionysiou et al. Specifically, our analysis\nwith nine publicly available password datasets shows that PassFilter\nsignificantly outperforms the baseline random guessing success rate of 5%,\nachieving 6.10% to 52.78% on the 1st guessing attempt, considering 20\nsweetwords per account. This success rate rapidly increases with additional\nlogin attempts before account lock-outs, often allowed on many real-world\nonline services to maintain reasonable usability. For example, it ranges from\n41.78% to 96.80% for five attempts, and from 72.87% to 99.00% for ten attempts,\ncompared to 25% and 50% random guessing, respectively. We also examined\nPassFilter against general-purpose language models used for honeyword\ngeneration, like those proposed by Yu et al. These honeywords also proved\nvulnerable to our attack, with success rates of 14.19% for 1st guessing\nattempt, increasing to 30.23%, 41.70%, and 63.10% after 3rd, 5th, and 10th\nguessing attempts, respectively. Our findings demonstrate the effectiveness of\nDL model deployed in PassFilter in breaching state-of-the-art HGTs and\ncompromising password security based on ODA.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}