{"id":"2407.05568","title":"High-order accurate entropy stable schemes for compressible Euler\n  equations with van der Waals equation of state on adaptive moving meshes","authors":"Shangting Li and Huazhong Tang","authorsParsed":[["Li","Shangting",""],["Tang","Huazhong",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 03:01:05 GMT"}],"updateDate":"2024-07-09","timestamp":1720407665000,"abstract":"  This paper develops the high-order entropy stable (ES) finite difference\nschemes for multi-dimensional compressible Euler equations with the van der\nWaals equation of state (EOS) on adaptive moving meshes. Semi-discrete schemes\nare first nontrivially constructed built on the newly derived high-order\nentropy conservative (EC) fluxes in curvilinear coordinates and scaled\neigenvector matrices as well as the multi-resolution WENO reconstruction, and\nthen the fully-discrete schemes are given by using the high-order explicit\nstrong-stability-preserving Runge-Kutta time discretizations.The high-order EC\nfluxes in curvilinear coordinates are derived by using the discrete geometric\nconservation laws and the linear combination of the two-point symmetric EC\nfluxes, while the two-point EC fluxes are delicately selected by using their\nsufficient condition, the thermodynamic entropy and the technically selected\nparameter vector.The adaptive moving meshes are iteratively generated by\nsolving the mesh redistribution equations, in which the fundamental derivative\nrelated to the occurrence of non-classical waves is involved to produce\nhigh-quality mesh. Several numerical tests on the parallel computer system with\nthe MPI programming are conducted to validate the accuracy, the ability to\ncapture the classical and non-classical waves, and the high efficiency of our\nschemes in comparison with their counterparts on the uniform mesh.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}