{"id":"2407.03977","title":"Statistics for Phylogenetic Trees in the Presence of Stickiness","authors":"Lars Lammers, Tom M. W. Nye, Stephan F. Huckemann","authorsParsed":[["Lammers","Lars",""],["Nye","Tom M. W.",""],["Huckemann","Stephan F.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 14:50:42 GMT"}],"updateDate":"2024-07-08","timestamp":1720104642000,"abstract":"  Samples of phylogenetic trees arise in a variety of evolutionary and\nbiomedical applications, and the Fr\\'echet mean in Billera-Holmes-Vogtmann tree\nspace is a summary tree shown to have advantages over other mean or consensus\ntrees. However, use of the Fr\\'echet mean raises computational and statistical\nissues which we explore in this paper. The Fr\\'echet sample mean is known often\nto contain fewer internal edges than the trees in the sample, and in this\ncircumstance calculating the mean by iterative schemes can be problematic due\nto slow convergence. We present new methods for identifying edges which must\nlie in the Fr\\'echet sample mean and apply these to a data set of gene trees\nrelating organisms from the apicomplexa which cause a variety of parasitic\ninfections. When a sample of trees contains a significant level of\nheterogeneity in the branching patterns, or topologies, displayed by the trees\nthen the Fr\\'echet mean is often a star tree, lacking any internal edges. Not\nonly in this situation, the population Fr\\'echet mean is affected by a\nnon-Euclidean phenomenon called stickness which impacts upon asymptotics, and\nwe examine two data sets for which the mean tree is a star tree. The first\nconsists of trees representing the physical shape of artery structures in a\nsample of medical images of human brains in which the branching patterns are\nvery diverse. The second consists of gene trees from a population of baboons in\nwhich there is evidence of substantial hybridization. We develop hypothesis\ntests which work in the presence of stickiness. The first is a test for the\npresence of a given edge in the Fr\\'echet population mean; the second is a\ntwo-sample test for differences in two distributions which share the same\nsticky population mean.\n","subjects":["Quantitative Biology/Populations and Evolution","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}