{"id":"2407.11408","title":"Prescribed-time Cooperative Output Regulation of Linear Heterogeneous\n  Multi-agent Systems","authors":"Gewei Zuo, Lijun Zhu, Yujuan Wang and Zhiyong Chen","authorsParsed":[["Zuo","Gewei",""],["Zhu","Lijun",""],["Wang","Yujuan",""],["Chen","Zhiyong",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 05:52:08 GMT"}],"updateDate":"2024-07-17","timestamp":1721109128000,"abstract":"  A finite-time protocol for a multi-agent systems (MASs) can guarantee the\nconvergence of every agent in a finite time interval in contrast to the\nasymptotic convergence, but the settling time depends on the initial condition\nand design parameters and is inconsistent across the agents. In this paper, we\nstudy the prescribed-time cooperative output regulation (PTCOR) problem for a\nclass of linear heterogeneous MASs under a directed communication graph, where\nthe settling time of every agent can be specified a priori and thus consistent.\nAs a special case of PTCOR, the necessary and sufficient condition for\nprescribed-time output regulation of an individual system is first discussed.\nThen, the PTCOR problem is converted into two cascaded subsystem, where the\nfirst one composed of distributed estimate errors and local estimate errors and\nthe second one is for\n  local tracking errors.\n  The criterion for prescribed-time stabilization of the cascaded system is\nproposed and is found to be different from that of traditional asymptotic\nstabilization of a cascaded system. Under the criterion and sufficient\ncondition, the general PTCOR problem is studied in two scenarios including\nstate feedback control and measurement output feedback control. In particular,\na distributed prescribed-time observer for each subsystem is explicitly\nconstructed to estimate the exosystem's state. Based on the observer, a\ndistributed controller is proposed to achieve convergence of the regulated\noutput to zero within a prescribed-time.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}