{"id":"2407.05678","title":"Computational Power of Mobile Robots in Synchronous Environment:\n  Discrete Version","authors":"Avisek Sharma, Pritam Goswami, and Buddhadeb Sau","authorsParsed":[["Sharma","Avisek",""],["Goswami","Pritam",""],["Sau","Buddhadeb",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 07:25:26 GMT"},{"version":"v2","created":"Tue, 9 Jul 2024 11:09:56 GMT"},{"version":"v3","created":"Wed, 10 Jul 2024 06:22:37 GMT"},{"version":"v4","created":"Wed, 24 Jul 2024 09:41:04 GMT"}],"updateDate":"2024-07-25","timestamp":1720423526000,"abstract":"  In distributed computing by mobile robots, robots are deployed over a region,\ncontinuous or discrete, operating through a sequence of\n\\textit{look-compute-move} cycles. An extensive study has been carried out to\nunderstand the computational powers of different robot models. The models vary\non the ability to 1)~remember constant size information and 2)~communicate\nconstant size message. Depending on the abilities the different models are\n1)~$\\mathcal{OBLOT}$ (robots are oblivious and silent), 2)~$\\mathcal{FSTA}$\n(robots have finite states but silent), 3)~$\\mathcal{FCOM}$ (robots are\noblivious but can communicate constant size information) and,\n4)~$\\mathcal{LUMI}$ (robots have finite states and can communicate constant\nsize information). Another factor that affects computational ability is the\nscheduler that decides the activation time of the robots. The main three\nschedulers are \\textit{fully-synchronous}, \\textit{semi-synchronous} and\n\\textit{asynchronous}. Combining the models ($M$) with schedulers ($K$), we\nhave twelve combinations $M^K$.\n  In the euclidean domain, the comparisons between these twelve variants have\nbeen done in different works for transparent robots, opaque robots, and robots\nwith limited visibility. There is a vacant space for similar works when robots\nare operating on discrete regions like networks. It demands separate research\nattention because there have been a series of works where robots operate on\ndifferent networks, and there is a fundamental difference when robots are\noperating on a continuous domain versus a discrete domain in terms of robots'\nmovement. This work contributes to filling the space by giving a full\ncomparison table for all models with two synchronous schedulers:\nfully-synchronous and semi-synchronous.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}