{"id":"2407.05744","title":"Automating Urban Soundscape Enhancements with AI: In-situ Assessment of\n  Quality and Restorativeness in Traffic-Exposed Residential Areas","authors":"Bhan Lam, Zhen-Ting Ong, Kenneth Ooi, Wen-Hui Ong, Trevor Wong, Karn\n  N. Watcharasupat, Vanessa Boey, Irene Lee, Joo Young Hong, Jian Kang, Kar Fye\n  Alvin Lee, Georgios Christopoulos, and Woon-Seng Gan","authorsParsed":[["Lam","Bhan",""],["Ong","Zhen-Ting",""],["Ooi","Kenneth",""],["Ong","Wen-Hui",""],["Wong","Trevor",""],["Watcharasupat","Karn N.",""],["Boey","Vanessa",""],["Lee","Irene",""],["Hong","Joo Young",""],["Kang","Jian",""],["Lee","Kar Fye Alvin",""],["Christopoulos","Georgios",""],["Gan","Woon-Seng",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 08:48:43 GMT"}],"updateDate":"2024-07-09","timestamp":1720428523000,"abstract":"  Formalized in ISO 12913, the \"soundscape\" approach is a paradigmatic shift\ntowards perception-based urban sound management, aiming to alleviate the\nsubstantial socioeconomic costs of noise pollution to advance the United\nNations Sustainable Development Goals. Focusing on traffic-exposed outdoor\nresidential sites, we implemented an automatic masker selection system (AMSS)\nutilizing natural sounds to mask (or augment) traffic soundscapes. We employed\na pre-trained AI model to automatically select the optimal masker and adjust\nits playback level, adapting to changes over time in the ambient environment to\nmaximize \"Pleasantness\", a perceptual dimension of soundscape quality in ISO\n12913. Our validation study involving ($N=68$) residents revealed a significant\n14.6 % enhancement in \"Pleasantness\" after intervention, correlating with\nincreased restorativeness and positive affect. Perceptual enhancements at the\ntraffic-exposed site matched those at a quieter control site with 6 dB(A) lower\n$L_\\text{A,eq}$ and road traffic noise dominance, affirming the efficacy of\nAMSS as a soundscape intervention, while streamlining the labour-intensive\nassessment of \"Pleasantness\" with probabilistic AI prediction.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Sound"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}