{"id":"2407.06888","title":"A Complete Set of Quadratic Constraints for Repeated ReLU and\n  Generalizations","authors":"Sahel Vahedi Noori, Bin Hu, Geir Dullerud, Peter Seiler","authorsParsed":[["Noori","Sahel Vahedi",""],["Hu","Bin",""],["Dullerud","Geir",""],["Seiler","Peter",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 14:18:30 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 16:38:56 GMT"}],"updateDate":"2024-08-23","timestamp":1720534710000,"abstract":"  This paper derives a complete set of quadratic constraints (QCs) for the\nrepeated ReLU. The complete set of QCs is described by a collection of matrix\ncopositivity conditions. We also show that only two functions satisfy all QCs\nin our complete set: the repeated ReLU and flipped ReLU. Thus our complete set\nof QCs bounds the repeated ReLU as tight as possible up to the sign invariance\ninherent in quadratic forms. We derive a similar complete set of incremental\nQCs for repeated ReLU, which can potentially lead to less conservative\nLipschitz bounds for ReLU networks than the standard LipSDP approach. The basic\nconstructions are also used to derive the complete sets of QCs for other\npiecewise linear activation functions such as leaky ReLU, MaxMin, and\nHouseHolder. Finally, we illustrate the use of the complete set of QCs to\nassess stability and performance for recurrent neural networks with ReLU\nactivation functions. We rely on a standard copositivity relaxation to\nformulate the stability/performance condition as a semidefinite program. Simple\nexamples are provided to illustrate that the complete sets of QCs and\nincremental QCs can yield less conservative bounds than existing sets.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oy-OcAivyK6kJVQZNhuRgiVAs3bZ4SZ07bGOD_tppoI","pdfSize":"341971"}
