{"id":"2407.18552","title":"Multimodal Emotion Recognition using Audio-Video Transformer Fusion with\n  Cross Attention","authors":"Joe Dhanith P R, Shravan Venkatraman, Modigari Narendra, Vigya Sharma,\n  Santhosh Malarvannan, and Amir H. Gandomi","authorsParsed":[["R","Joe Dhanith P",""],["Venkatraman","Shravan",""],["Narendra","Modigari",""],["Sharma","Vigya",""],["Malarvannan","Santhosh",""],["Gandomi","Amir H.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 07:05:04 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 05:14:38 GMT"}],"updateDate":"2024-08-16","timestamp":1721977504000,"abstract":"  Understanding emotions is a fundamental aspect of human communication.\nIntegrating audio and video signals offers a more comprehensive understanding\nof emotional states compared to traditional methods that rely on a single data\nsource, such as speech or facial expressions. Despite its potential, multimodal\nemotion recognition faces significant challenges, particularly in\nsynchronization, feature extraction, and fusion of diverse data sources. To\naddress these issues, this paper introduces a novel transformer-based model\nnamed Audio-Video Transformer Fusion with Cross Attention (AVT-CA). The AVT-CA\nmodel employs a transformer fusion approach to effectively capture and\nsynchronize interlinked features from both audio and video inputs, thereby\nresolving synchronization problems. Additionally, the Cross Attention mechanism\nwithin AVT-CA selectively extracts and emphasizes critical features while\ndiscarding irrelevant ones from both modalities, addressing feature extraction\nand fusion challenges. Extensive experimental analysis conducted on the\nCMU-MOSEI, RAVDESS and CREMA-D datasets demonstrates the efficacy of the\nproposed model. The results underscore the importance of AVT-CA in developing\nprecise and reliable multimodal emotion recognition systems for practical\napplications.\n","subjects":["Computing Research Repository/Multimedia","Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}