{"id":"2407.17871","title":"Two-strand ladder network variants: localization, multifractality, and\n  quantum dynamics under an Aubry-Andr\\'e-Harper kind of quasiperiodicity","authors":"Sougata Biswas","authorsParsed":[["Biswas","Sougata",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 08:43:48 GMT"}],"updateDate":"2024-07-26","timestamp":1721897028000,"abstract":"  In this paper we demonstrate, using a couple of variants of a two-strand\nladder network that, a quasiperiodic Aubry-Andr\\'e-Harper (AAH) modulation\napplied to the vertical strands, mimicking a deterministic distortion in the\nnetwork, can give rise to certain exotic features in the electronic spectrum of\nsuch systems. While, for the simplest ladder network all the eigenstates become\nlocalized as the modulation strength crosses a threshold, for the second\nvariant, modelling an ultrathin graphene nano-ribbon, the central part of the\nenergy spectrum remains populated by extended wavefunctions. The multifractal\ncharacter in the energy spectrum is observed for both these networks close to\nthe critical values of the modulation. We substantiate our findings also by\nstudying the quantum dynamics of a wave packet on such decorated lattices.\nInterestingly, while the mean square displacement (MSD) changes in the usual\nmanner in a pure two-strand ladder network as the modulation strength varies,\nfor the ultrathin graphene nanoribbon the temporal behaviour of the MSD remains\nunaltered only up to a strong modulation strength. This, we argue, is due to\nthe extendedness of the wavefunction at the central part of the energy\nspectrum. Other measurements like the return probability, temporal\nautocorrelation function, the time dependence of the inverse participation\nratio, and the information entropy are calculated for both networks with\ndifferent modulation strengths and corroborate our analytical findings.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"OO4rsjThwjGn_KyIWTeHWUsyu0UHkSdnyrP-TCyCh9g","pdfSize":"6500157"}
