{"id":"2407.02221","title":"Rapidly-rotating quantum droplets confined in a harmonic potential","authors":"S. Nikolaou, G. M. Kavoulakis, M. Ogren","authorsParsed":[["Nikolaou","S.",""],["Kavoulakis","G. M.",""],["Ogren","M.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 12:40:49 GMT"}],"updateDate":"2024-07-03","timestamp":1719924049000,"abstract":"  We consider a \"symmetric\" quantum droplet in two spatial dimensions, which\nrotates in a harmonic potential, focusing mostly on the limit of \"rapid\"\nrotation. We examine this problem using a purely numerical approach, as well as\na semi-analytic Wigner-Seitz approximation (first developed by Baym, Pethick et\nal.) for the description of the state with a vortex lattice. Within this\napproximation we assume that each vortex occupies a cylindrical cell, with the\nvortex-core size treated as a variational parameter. Working with a fixed\nangular momentum, as the angular momentum increases and depending on the atom\nnumber, the droplet accommodates none, few, or many vortices, before it turns\nto center-of-mass excitation. For the case of a \"large\" droplet, working with a\nfixed rotational frequency of the trap $\\Omega$, as $\\Omega$ approaches the\ntrap frequency $\\omega$, a vortex lattice forms, the number of vortices\nincreases, the mean spacing between them decreases, while the \"size\" of each\nvortex increases as compared to the size of each cell. In contrast to the\nwell-known problem of contact interactions, where we have melting of the vortex\nlattice and highly-correlated many-body states, here no melting of the vortex\nlattice is present, even when $\\Omega = \\omega$. This difference is due to the\nfact that the droplet is self-bound. Actually, for $\\Omega = \\omega$, the\n\"smoothed\" density distribution becomes a flat top, very much like the static\ndroplet. When $\\Omega$ exceeds $\\omega$, the droplet maintains its shape and\nescapes to infinity, via center-of-mass motion.\n","subjects":["Condensed Matter/Quantum Gases","Physics/Atomic Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}