{"id":"2407.08164","title":"Hierarchical Consensus-Based Multi-Agent Reinforcement Learning for\n  Multi-Robot Cooperation Tasks","authors":"Pu Feng, Junkang Liang, Size Wang, Xin Yu, Xin Ji, Yiting Chen, Kui\n  Zhang, Rongye Shi, and Wenjun Wu","authorsParsed":[["Feng","Pu",""],["Liang","Junkang",""],["Wang","Size",""],["Yu","Xin",""],["Ji","Xin",""],["Chen","Yiting",""],["Zhang","Kui",""],["Shi","Rongye",""],["Wu","Wenjun",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 03:55:55 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 13:07:46 GMT"}],"updateDate":"2024-08-26","timestamp":1720670155000,"abstract":"  In multi-agent reinforcement learning (MARL), the Centralized Training with\nDecentralized Execution (CTDE) framework is pivotal but struggles due to a gap:\nglobal state guidance in training versus reliance on local observations in\nexecution, lacking global signals. Inspired by human societal consensus\nmechanisms, we introduce the Hierarchical Consensus-based Multi-Agent\nReinforcement Learning (HC-MARL) framework to address this limitation. HC-MARL\nemploys contrastive learning to foster a global consensus among agents,\nenabling cooperative behavior without direct communication. This approach\nenables agents to form a global consensus from local observations, using it as\nan additional piece of information to guide collaborative actions during\nexecution. To cater to the dynamic requirements of various tasks, consensus is\ndivided into multiple layers, encompassing both short-term and long-term\nconsiderations. Short-term observations prompt the creation of an immediate,\nlow-layer consensus, while long-term observations contribute to the formation\nof a strategic, high-layer consensus. This process is further refined through\nan adaptive attention mechanism that dynamically adjusts the influence of each\nconsensus layer. This mechanism optimizes the balance between immediate\nreactions and strategic planning, tailoring it to the specific demands of the\ntask at hand. Extensive experiments and real-world applications in multi-robot\nsystems showcase our framework's superior performance, marking significant\nadvancements over baselines.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multiagent Systems","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}