{"id":"2407.15320","title":"Edge Graph Intelligence: Reciprocally Empowering Edge Networks with\n  Graph Intelligence","authors":"Liekang Zeng, Shengyuan Ye, Xu Chen, Xiaoxi Zhang, Ju Ren, Jian Tang,\n  Yang Yang, Xuemin (Sherman) Shen","authorsParsed":[["Zeng","Liekang","","Sherman"],["Ye","Shengyuan","","Sherman"],["Chen","Xu","","Sherman"],["Zhang","Xiaoxi","","Sherman"],["Ren","Ju","","Sherman"],["Tang","Jian","","Sherman"],["Yang","Yang","","Sherman"],["Xuemin","","","Sherman"],["Shen","",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 09:25:52 GMT"}],"updateDate":"2024-07-23","timestamp":1720344352000,"abstract":"  Recent years have witnessed a thriving growth of computing facilities\nconnected at the network edge, cultivating edge computing networks as a\nfundamental infrastructure for supporting miscellaneous intelligent services.\nMeanwhile, Artificial Intelligence frontiers have extrapolated Machine Learning\nto the graph domain and promoted Graph Intelligence (GI), which unlocks\nunprecedented ability in learning from massive data in graph structures. Given\nthe inherent relation between graphs and networks, the interdiscipline of graph\nrepresentation learning and edge networks, i.e., Edge GI or EGI, has revealed a\nnovel interplay between them -- GI models principally open a new door for\nmodeling, understanding, and optimizing edge networks, and conversely, edge\nnetworks serve as physical support for training, deploying, and accelerating GI\nmodels. Driven by this delicate closed-loop, EGI can be widely recognized as a\npromising solution to fully unleash the potential of edge computing power and\nis garnering significant attention. Nevertheless, research on EGI yet remains\nnascent, and there is a soaring demand within both the communications and AI\ncommunities for a dedicated venue to share recent advancements. To this end,\nthis paper promotes the concept of EGI, explores its scope and core principles,\nand conducts a comprehensive survey concerning recent research efforts on this\nemerging field and specifically, introduces and discusses: 1) fundamentals of\nedge computing and graph representation learning, 2) emerging techniques\ncentering on the closed loop between graph intelligence and edge networks, and\n3) open challenges and research opportunities of future EGI. By bridging the\ngap across communication, networking, and graph learning areas, we believe that\nthis survey can garner increased attention, foster meaningful discussions, and\ninspire further research ideas in EGI.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}