{"id":"2407.18098","title":"Unraveling the Web of Disinformation: Exploring the Larger Context of\n  State-Sponsored Influence Campaigns on Twitter","authors":"Mohammad Hammas Saeed, Shiza Ali, Pujan Paudel, Jeremy Blackburn,\n  Gianluca Stringhini","authorsParsed":[["Saeed","Mohammad Hammas",""],["Ali","Shiza",""],["Paudel","Pujan",""],["Blackburn","Jeremy",""],["Stringhini","Gianluca",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 15:03:33 GMT"}],"updateDate":"2024-07-26","timestamp":1721919813000,"abstract":"  Social media platforms offer unprecedented opportunities for connectivity and\nexchange of ideas; however, they also serve as fertile grounds for the\ndissemination of disinformation. Over the years, there has been a rise in\nstate-sponsored campaigns aiming to spread disinformation and sway public\nopinion on sensitive topics through designated accounts, known as troll\naccounts. Past works on detecting accounts belonging to state-backed operations\nfocus on a single campaign. While campaign-specific detection techniques are\neasier to build, there is no work done on developing systems that are\ncampaign-agnostic and offer generalized detection of troll accounts unaffected\nby the biases of the specific campaign they belong to. In this paper, we\nidentify several strategies adopted across different state actors and present a\nsystem that leverages them to detect accounts from previously unseen campaigns.\nWe study 19 state-sponsored disinformation campaigns that took place on\nTwitter, originating from various countries. The strategies include sending\nautomated messages through popular scheduling services, retweeting and sharing\nselective content and using fake versions of verified applications for pushing\ncontent. By translating these traits into a feature set, we build a machine\nlearning-based classifier that can correctly identify up to 94% of accounts\nfrom unseen campaigns. Additionally, we run our system in the wild and find\nmore accounts that could potentially belong to state-backed operations. We also\npresent case studies to highlight the similarity between the accounts found by\nour system and those identified by Twitter.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}