{"id":"2407.21454","title":"StreetSurfaceVis: a dataset of crowdsourced street-level imagery with\n  semi-automated annotations of road surface type and quality","authors":"Alexandra Kapp, Edith Hoffmann, Esther Weigmann, Helena Mihaljevi\\'c","authorsParsed":[["Kapp","Alexandra",""],["Hoffmann","Edith",""],["Weigmann","Esther",""],["Mihaljević","Helena",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 08:59:33 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 07:50:32 GMT"}],"updateDate":"2024-08-13","timestamp":1722416373000,"abstract":"  Road unevenness significantly impacts the safety and comfort of various\ntraffic participants, especially vulnerable road users such as cyclists and\nwheelchair users. This paper introduces StreetSurfaceVis, a novel dataset\ncomprising 9,122 street-level images collected from a crowdsourcing platform\nand manually annotated by road surface type and quality. The dataset is\nintended to train models for comprehensive surface assessments of road\nnetworks. Existing open datasets are constrained by limited geospatial coverage\nand camera setups, typically excluding cycleways and footways. By crafting a\nheterogeneous dataset, we aim to fill this gap and enable robust models that\nmaintain high accuracy across diverse image sources. However, the frequency\ndistribution of road surface types and qualities is highly imbalanced. We\naddress the challenge of ensuring sufficient images per class while reducing\nmanual annotation by proposing a sampling strategy that incorporates various\nexternal label prediction resources. More precisely, we estimate the impact of\n(1) enriching the image data with OpenStreetMap tags, (2) iterative training\nand application of a custom surface type classification model, (3) amplifying\nunderrepresented classes through prompt-based classification with GPT-4o or\nsimilarity search using image embeddings. We show that utilizing a combination\nof these strategies effectively reduces manual annotation workload while\nensuring sufficient class representation.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hwY_TAePfN4sQD-aHD2eQi2eGrMANbPkqQK0ghNNALM","pdfSize":"966104"}
