{"id":"2407.18500","title":"Revisit Event Generation Model: Self-Supervised Learning of\n  Event-to-Video Reconstruction with Implicit Neural Representations","authors":"Zipeng Wang, Yunfan Lu, Lin Wang","authorsParsed":[["Wang","Zipeng",""],["Lu","Yunfan",""],["Wang","Lin",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 04:18:10 GMT"}],"updateDate":"2024-07-29","timestamp":1721967490000,"abstract":"  Reconstructing intensity frames from event data while maintaining high\ntemporal resolution and dynamic range is crucial for bridging the gap between\nevent-based and frame-based computer vision. Previous approaches have depended\non supervised learning on synthetic data, which lacks interpretability and risk\nover-fitting to the setting of the event simulator. Recently, self-supervised\nlearning (SSL) based methods, which primarily utilize per-frame optical flow to\nestimate intensity via photometric constancy, has been actively investigated.\nHowever, they are vulnerable to errors in the case of inaccurate optical flow.\nThis paper proposes a novel SSL event-to-video reconstruction approach, dubbed\nEvINR, which eliminates the need for labeled data or optical flow estimation.\nOur core idea is to reconstruct intensity frames by directly addressing the\nevent generation model, essentially a partial differential equation (PDE) that\ndescribes how events are generated based on the time-varying brightness\nsignals. Specifically, we utilize an implicit neural representation (INR),\nwhich takes in spatiotemporal coordinate $(x, y, t)$ and predicts intensity\nvalues, to represent the solution of the event generation equation. The INR,\nparameterized as a fully-connected Multi-layer Perceptron (MLP), can be\noptimized with its temporal derivatives supervised by events. To make EvINR\nfeasible for online requisites, we propose several acceleration techniques that\nsubstantially expedite the training process. Comprehensive experiments\ndemonstrate that our EvINR surpasses previous SSL methods by 38% w.r.t. Mean\nSquared Error (MSE) and is comparable or superior to SoTA supervised methods.\nProject page: https://vlislab22.github.io/EvINR/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}