{"id":"2407.03785","title":"Impact of Channel Aging and Electromagnetic Interference on RIS-Assisted\n  Cell-Free Massive MIMO Systems","authors":"Jun Qian, Chi Zhang, Ross Murch, Khaled B. Letaief","authorsParsed":[["Qian","Jun",""],["Zhang","Chi",""],["Murch","Ross",""],["Letaief","Khaled B.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 09:47:21 GMT"}],"updateDate":"2024-07-08","timestamp":1720086441000,"abstract":"  In this work, we investigate the impact of channel aging and electromagnetic\ninterference (EMI) on spatially correlated reconfigurable intelligent surface\n(RIS) assisted cell-free massive multiple-input multiple-output (MIMO) systems.\nTo effectively handle channel aging and EMI, we employ a novel two-phase\nchannel estimation scheme with fractional power control-aided pilot assignment\nduring the uplink channel estimation phase. This scheme provides improved\nchannel estimates compared to existing approaches. The closed-form uplink and\ndownlink spectral efficiency (SE) expressions incorporating fractional power\ncontrol are derived to enable system performance evaluation. Additionally, we\nintroduce the system's power consumption model to analyze energy efficiency\n(EE). Our numerical results illustrate the theoretical results and demonstrate\nthe system performance with channel aging and EMI. Specifically, the proposed\ntwo-phase channel estimation scheme enhances estimation accuracy, compensating\nfor performance degradation caused by channel aging and EMI. We find that\nincreasing the number of access points (APs), RISs, antennas per AP, and\nelements per RIS can help to mitigate the SE performance degradation. We also\nfind that an optimal number of APs can be selected to achieve energy efficiency\n(EE) maximization. However, in severe EMI environments, the benefits of\ndeploying more RISs cannot be fully realized.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}