{"id":"2407.13904","title":"In defense of MAR over latent ignorability (or latent MAR) for outcome\n  missingness in studying principal causal effects: a causal graph view","authors":"Trang Quynh Nguyen","authorsParsed":[["Nguyen","Trang Quynh",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 21:28:17 GMT"}],"updateDate":"2024-07-22","timestamp":1721338097000,"abstract":"  This paper concerns outcome missingness in principal stratification analysis.\nWe revisit a common assumption known as latent ignorability or latent\nmissing-at-random (LMAR), often considered a relaxation of missing-at-random\n(MAR). LMAR posits that the outcome is independent of its missingness if one\nconditions on principal stratum (which is partially unobservable) in addition\nto observed variables. The literature has focused on methods assuming LMAR\n(usually supplemented with a more specific assumption about the missingness),\nwithout considering the theoretical plausibility and necessity of LMAR. In this\npaper, we devise a way to represent principal stratum in causal graphs, and use\ncausal graphs to examine this assumption. We find that LMAR is harder to\nsatisfy than MAR, and for the purpose of breaking the dependence between the\noutcome and its missingness, no benefit is gained from conditioning on\nprincipal stratum on top of conditioning on observed variables. This finding\nhas an important implication: MAR should be preferred over LMAR. This is\nconvenient because MAR is easier to handle and (unlike LMAR) if MAR is assumed\nno additional assumption is needed. We thus turn to focus on the plausibility\nof MAR and its implications, with a view to facilitate appropriate use of this\nassumption. We clarify conditions on the causal structure and on auxiliary\nvariables (if available) that need to hold for MAR to hold, and we use MAR to\nrecover effect identification under two dominant identification assumptions\n(exclusion restriction and principal ignorability). We briefly comment on cases\nwhere MAR does not hold. In terms of broader connections, most of the MAR\nfindings are also relevant to classic instrumental variable analysis that\ntargets the local average treatment effect; and the LMAR finding suggests\ngeneral caution with assumptions that condition on principal stratum.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/"}