{"id":"2407.21484","title":"All-electrical operation of a spin qubit coupled to a high-Q resonator","authors":"Rafael S. Eggli, Taras Patlatiuk, Eoin G. Kelly, Alexei Orekhov, Gian\n  Salis, Richard J. Warburton, Dominik M. Zumb\\\"uhl and Andreas V. Kuhlmann","authorsParsed":[["Eggli","Rafael S.",""],["Patlatiuk","Taras",""],["Kelly","Eoin G.",""],["Orekhov","Alexei",""],["Salis","Gian",""],["Warburton","Richard J.",""],["Zumbühl","Dominik M.",""],["Kuhlmann","Andreas V.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 09:48:47 GMT"}],"updateDate":"2024-08-01","timestamp":1722419327000,"abstract":"  Building a practical quantum processor involves integrating millions of\nphysical qubits along with the necessary components for individual qubit\nmanipulation and readout. Arrays of gated silicon spins offer a promising route\ntoward achieving this goal. Optimized radio frequency resonators with high\ninternal quality factor are based on superconducting inductors and enable fast\nspin readout. All-electrical spin control and gate-dispersive readout remove\nthe need for additional device components and simplify scaling. However,\nsuperconducting high-Q tank circuits are susceptible to crosstalk induced\nringup from electrical qubit control pulses, which causes fluctuations of the\nquantum dot potential and is suspected to degrade qubit performance. Here, we\nreport on the coherent and all-electrical control of a hole spin qubit at 1.5K,\nintegrated into a silicon fin field-effect transistor and connected to a\nniobium nitride nanowire inductor gate-sensor. Our experiments show that qubit\ncontrol pulses with their broad range of higher harmonics ring up the tank when\nthe control pulse spectrum overlaps with the tank resonance. This can cause a\nreduction of the readout visibility if the tank ringing amplitude exceeds the\nexcited state splitting of the quantum dot, lifting Pauli spin blockade and\nthus leading to state preparation and measurement errors. We demonstrate how to\ncircumvent these effects by engineering control pulses around the tank\nresonances. Importantly, we find that the ringup does not limit the spin\ncoherence time, indicating that efficient high-Q resonators in gate-sensing are\ncompatible with all-electrical spin control.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3UdD1GgqCLtalk4VuW0_-7l8uadak5g_txDuBZWmvdE","pdfSize":"17075360"}
