{"id":"2407.06257","title":"Once a Triple, Not Always a Triple: The Evolution of Hierarchical\n  Triples that Yield Merged Inner Binaries","authors":"Cheyanne Shariat, Smadar Naoz, Kareem El-Badry, Antonio C. Rodriguez,\n  Bradley M.S. Hansen, Isabel Angelo, and Alexander P. Stephan","authorsParsed":[["Shariat","Cheyanne",""],["Naoz","Smadar",""],["El-Badry","Kareem",""],["Rodriguez","Antonio C.",""],["Hansen","Bradley M. S.",""],["Angelo","Isabel",""],["Stephan","Alexander P.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-10","timestamp":1720461601000,"abstract":"  More than half of all main-sequence (MS) stars have one or more companions,\nand many of those with initial masses <8 M$_\\odot$ are born in hierarchical\ntriples. These systems feature two stars in a close orbit (the inner binary)\nwhile a tertiary star orbits them on a wider orbit (the outer binary). In\nhierarchical triples, three-body dynamics combined with stellar evolution\ndrives interactions and, in many cases, merges the inner binary entirely to\ncreate a renovated `Post-Merger Binary' (PMB). By leveraging dynamical\nsimulations and tracking binary interactions, we explore the outcomes of merged\ntriples and investigate whether PMBs preserve signatures of their three-body\nhistory. Our findings indicate that in 26-54% of wide double WD binaries (s>100\nau), the more massive white dwarf (WD) is a merger product, implying that these\nDWD binaries were previously triples. Overall, we estimate that $44\\pm14\\%$ of\nobserved wide DWDs originated in triple star systems and thereby have rich\ndynamical histories. Additionally, our results suggest that the separations of\ninner and outer binaries are uncorrelated at birth, providing insights into\nstellar formation processes. We also examine MS+MS and MS+Red Giant mergers\nmanifesting as Blue Straggler stars (BSSs). These PMBs have orbital\nconfigurations and ages similar to most observed BSS binaries. While the\ntriple+merger formation channel can explain the observed chemical abundances,\nmoderate eccentricities, and companion masses in BSS binaries, it likely only\naccounts for $\\sim$20-25% of BSSs. Meanwhile, we predict that the majority of\nobserved single BSSs formed as collisions in triples and harbor long-period\n(>10 yr) companions. Furthermore, both BSS binaries and DWDs exhibit signatures\nof WD birth kicks.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}