{"id":"2407.06633","title":"Variational Zero-shot Multispectral Pansharpening","authors":"Xiangyu Rui, Xiangyong Cao, Yining Li, Deyu Meng","authorsParsed":[["Rui","Xiangyu",""],["Cao","Xiangyong",""],["Li","Yining",""],["Meng","Deyu",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 07:59:34 GMT"}],"updateDate":"2024-07-10","timestamp":1720511974000,"abstract":"  Pansharpening aims to generate a high spatial resolution multispectral image\n(HRMS) by fusing a low spatial resolution multispectral image (LRMS) and a\npanchromatic image (PAN). The most challenging issue for this task is that only\nthe to-be-fused LRMS and PAN are available, and the existing deep\nlearning-based methods are unsuitable since they rely on many training pairs.\nTraditional variational optimization (VO) based methods are well-suited for\naddressing such a problem. They focus on carefully designing explicit fusion\nrules as well as regularizations for an optimization problem, which are based\non the researcher's discovery of the image relationships and image structures.\nUnlike previous VO-based methods, in this work, we explore such complex\nrelationships by a parameterized term rather than a manually designed one.\nSpecifically, we propose a zero-shot pansharpening method by introducing a\nneural network into the optimization objective. This network estimates a\nrepresentation component of HRMS, which mainly describes the relationship\nbetween HRMS and PAN. In this way, the network achieves a similar goal to the\nso-called deep image prior because it implicitly regulates the relationship\nbetween the HRMS and PAN images through its inherent structure. We directly\nminimize this optimization objective via network parameters and the expected\nHRMS image through iterative updating. Extensive experiments on various\nbenchmark datasets demonstrate that our proposed method can achieve better\nperformance compared with other state-of-the-art methods. The codes are\navailable at https://github.com/xyrui/PSDip.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}