{"id":"2407.03762","title":"Is active motion beneficial for target search with resetting in a\n  thermal environment?","authors":"Priyo Shankar Pal, Jong-Min Park, Arnab Pal, Hyunggyu Park, Jae Sung\n  Lee","authorsParsed":[["Pal","Priyo Shankar",""],["Park","Jong-Min",""],["Pal","Arnab",""],["Park","Hyunggyu",""],["Lee","Jae Sung",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 09:15:42 GMT"}],"updateDate":"2024-07-08","timestamp":1720084542000,"abstract":"  Stochastic resetting has recently emerged as an efficient target-searching\nstrategy in various physical and biological systems. The efficiency of this\nstrategy depends on the type of environmental noise, whether it is thermal or\ntelegraphic (active). While the impact of each noise type on a search process\nhas been investigated separately, their combined effects have not been\nexplored. In this work, we explore the effects of stochastic resetting on an\nactive system, namely a self-propelled run-and-tumble particle immersed in a\nthermal bath. In particular, we assume that the position of the particle is\nreset at a fixed rate with or without reversing the direction of self-propelled\nvelocity. Using standard renewal techniques, we compute the mean search time of\nthis active particle to a fixed target and investigate the interplay between\nactive and thermal fluctuations. We find that the active search can outperform\nthe Brownian search when the magnitude and flipping rate of self-propelled\nvelocity are large and the strength of environmental noise is small. Notably,\nwe find that the presence of thermal noise in the environment helps reduce the\nmean first passage time of the run-and-tumble particle compared to the absence\nof thermal noise. Finally, we observe that reversing the direction of\nself-propelled velocity while resetting can also reduce the overall search\ntime.\n","subjects":["Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"c28AAxASRCiKlqQtPULjH0EJ2m5D1_fkSlpl6tDvIGI","pdfSize":"4090643"}
