{"id":"2407.01035","title":"Off-site production of plasma-activated water for efficient\n  sterilization: the crucial role of high-valence NOx and new chemical pathways","authors":"Zifeng Wang, Xiangyu Wang, Shenghang Xu, Renwu Zhou, Mingyan Zhang,\n  Wanchun Li, Zizhu Zhang, Luge Wang, Jinkun Chen, Jishen Zhang, Li Guo, Dandan\n  Pei, Dingxin Liu, and Mingzhe Rong","authorsParsed":[["Wang","Zifeng",""],["Wang","Xiangyu",""],["Xu","Shenghang",""],["Zhou","Renwu",""],["Zhang","Mingyan",""],["Li","Wanchun",""],["Zhang","Zizhu",""],["Wang","Luge",""],["Chen","Jinkun",""],["Zhang","Jishen",""],["Guo","Li",""],["Pei","Dandan",""],["Liu","Dingxin",""],["Rong","Mingzhe",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 07:39:31 GMT"}],"updateDate":"2024-07-02","timestamp":1719819571000,"abstract":"  Efficient sterilization of pathogens with cleaner methods is a critical\nconcern for environmental disinfection and clinical anti-infective treatment.\nPlasma-activated water (PAW) is a promising alternative to chemical\ndisinfectants and antibiotics for its strong sterilization ability and not\ninducing any acute toxicity, and only water and air are consumed during\nproduction. For more efficient water activation, plasma sources are commonly\nplaced near or fully in contact with water as possible, but the risks of\nelectrode corrosion and metal contamination of water threaten the safety and\nstability of PAW production. Herein, plasma-activated gas rich in high-valence\nNOx is generated by a hybrid plasma configuration and introduced into water for\noff-site PAW production. Plasma-generated O3 is found to dominate the gas-phase\nreactions for the formation of high-valence NOx. With the time-evolution of O3\nconcentration, gaseous NO3 radicals are produced behind N2O5 formation, but\nwill be decomposed before N2O5 quenching. By decoupling the roles of gaseous\nNO3, N2O5, and O3 in the water activation, results show that short-lived\naqueous species induced by gaseous NO3 radicals play the most crucial role in\nPAW sterilization, and the acidic environment induced by N2O5 is also\nessential. Moreover, SEM photographs and biomacromolecule leakage assays\ndemonstrate that PAW disrupts the cell membranes of bacteria to achieve\ninactivation. In real-life applications, an integrated device for off-site PAW\nproduction with a yield of 2 L/h and a bactericidal efficiency of >99.9% is\ndeveloped. The PAW of 50mL produced in 3 minutes using this device is more\neffective in disinfection than 0.5% NaClO and 3% H2O2 with the same bacterial\ncontact time. This work provides new avenues for efficient PAW production and\ndeepens insights into the fundamental processes that govern the reactive\nchemistry in PAW sterilization.\n","subjects":["Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}