{"id":"2407.00238","title":"The Braid Indices of Pretzel Links: A Comprehensive Study, Part II","authors":"Yuanan Diao, Claus Ernst and Gabor Hetyei","authorsParsed":[["Diao","Yuanan",""],["Ernst","Claus",""],["Hetyei","Gabor",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 21:21:03 GMT"}],"updateDate":"2024-07-02","timestamp":1719609663000,"abstract":"  This paper is the second part of our comprehensive study on the braid index\nproblem of pretzel links. Our ultimate goal is to completely determine the\nbraid indices of all pretzel links, alternating or non alternating. In our\napproach, we divide the pretzel links into three types as follows. Let $D$ be a\nstandard diagram of an oriented pretzel link $\\mathcal{L}$, $S(D)$ be the\nSeifert circle decomposition of $D$, and $C_1$, $C_2$ be the Seifert circles in\n$S(D)$ containing the top and bottom long strands of $D$ respectively, then\n$\\mathcal{L}$ is classified as a Type 1 (Type 2) pretzel link if $C_1\\not=C_2$\nand $C_1$, $C_2$ have different (identical) orientations. In the case that\n$C_1=C_2$, then $\\mathcal{L}$ is classified as a Type 3 pretzel link. In our\nprevious paper, we succeeded in reaching our goal for all Type 1 and Type 2\npretzel links. That is, we successfully derived precise braid index formulas\nfor all Type 1 and Type 2 pretzel links. In this paper, we present the results\nof our study on Type 3 pretzel links. In this case, we are very close to\nreaching our goal. More precisely, with the exception of a small percentage of\nType 3 pretzel links, we are able to determine the precise braid indices for\nthe majority of Type 3 pretzel links. Even for those exceptional ones, we are\nable to determine their braid indices within two consecutive integers. With\nsome numerical evidence, we conjecture that in such a case, the braid index of\nthe Type 3 pretzel link is given by the larger of the two consecutive integers\ngiven by our formulas.\n","subjects":["Mathematics/Geometric Topology","Mathematics/Algebraic Topology"],"license":"http://creativecommons.org/licenses/by/4.0/"}