{"id":"2407.20710","title":"On-the-fly Communication-and-Computing to Enable Representation Learning\n  for Distributed Point Clouds","authors":"Xu Chen, Hai Wu, Kaibin Huang","authorsParsed":[["Chen","Xu",""],["Wu","Hai",""],["Huang","Kaibin",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 10:07:23 GMT"}],"updateDate":"2024-07-31","timestamp":1722334043000,"abstract":"  The advent of sixth-generation (6G) mobile networks introduces two\ngroundbreaking capabilities: sensing and artificial intelligence (AI). Sensing\nleverages multi-modal sensors to capture real-time environmental data, while AI\nbrings powerful models to the network edge, enabling intelligent\nInternet-of-Things (IoT) applications. These features converge in the\nIntegrated Sensing and Edge AI (ISEA) paradigm, where edge devices collect and\nlocally process sensor data before aggregating it centrally for AI tasks. Point\nclouds (PtClouds), generated by depth sensors, are crucial in this setup,\nsupporting applications such as autonomous driving and mixed reality. However,\nthe heavy computational load and communication demands of PtCloud fusion pose\nchallenges. To address these, the FlyCom$^2$ framework is proposed, optimizing\ndistributed PtCloud fusion through on-the-fly communication and computing,\nnamely streaming on-sensor processing, progressive data uploading integrated\ncommunication-efficient AirComp, and the progressive output of a global PtCloud\nrepresentation. FlyCom$^2$ distinguishes itself by aligning PtCloud fusion with\nGaussian process regression (GPR), ensuring that global PtCloud representation\nprogressively improves as more observations are received. Joint optimization of\nlocal observation synthesis and AirComp receiver settings is based on\nminimizing prediction error, balancing communication distortions, data\nheterogeneity, and temporal correlation. This framework enhances PtCloud fusion\nby balancing local processing demands with efficient central aggregation,\npaving the way for advanced 6G applications. Validation on real-world datasets\ndemonstrates the efficacy of FlyCom$^2$, highlighting its potential in\nnext-generation mobile networks.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}