{"id":"2407.09505","title":"1-Lipschitz Neural Distance Fields","authors":"Guillaume Coiffier and Louis Bethune","authorsParsed":[["Coiffier","Guillaume",""],["Bethune","Louis",""]],"versions":[{"version":"v1","created":"Fri, 14 Jun 2024 11:56:36 GMT"}],"updateDate":"2024-07-16","timestamp":1718366196000,"abstract":"  Neural implicit surfaces are a promising tool for geometry processing that\nrepresent a solid object as the zero level set of a neural network. Usually\ntrained to approximate a signed distance function of the considered object,\nthese methods exhibit great visual fidelity and quality near the surface, yet\ntheir properties tend to degrade with distance, making geometrical queries hard\nto perform without the help of complex range analysis techniques. Based on\nrecent advancements in Lipschitz neural networks, we introduce a new method for\napproximating the signed distance function of a given object. As our neural\nfunction is made 1- Lipschitz by construction, it cannot overestimate the\ndistance, which guarantees robustness even far from the surface. Moreover, the\n1-Lipschitz constraint allows us to use a different loss function, called the\nhinge-Kantorovitch-Rubinstein loss, which pushes the gradient as close to\nunit-norm as possible, thus reducing computation costs in iterative queries. As\nthis loss function only needs a rough estimate of occupancy to be optimized,\nthis means that the true distance function need not to be known. We are\ntherefore able to compute neural implicit representations of even bad quality\ngeometry such as noisy point clouds or triangle soups. We demonstrate that our\nmethods is able to approximate the distance function of any closed or open\nsurfaces or curves in the plane or in space, while still allowing sphere\ntracing or closest point projections to be performed robustly.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}