{"id":"2407.18895","title":"Robust multi-mode superconducting qubit designed with evolutionary\n  algorithms","authors":"P. Garc\\'ia-Azor\\'in, F. A. C\\'ardenas-L\\'opez, G. B. P. Huber, G.\n  Romero, M. Werninghaus, F. Motzoi, S. Filipp and M. Sanz","authorsParsed":[["García-Azorín","P.",""],["Cárdenas-López","F. A.",""],["Huber","G. B. P.",""],["Romero","G.",""],["Werninghaus","M.",""],["Motzoi","F.",""],["Filipp","S.",""],["Sanz","M.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:47:54 GMT"}],"updateDate":"2024-07-29","timestamp":1722016074000,"abstract":"  Multi-mode superconducting circuits offer a promising platform for\nengineering robust systems for quantum computation. Previous studies have shown\nthat single-mode devices cannot simultaneously exhibit resilience against\nmultiple decoherence sources due to conflicting protection requirements. In\ncontrast, multi-mode systems offer increased flexibility and have proven\ncapable of overcoming these fundamental limitations. Nevertheless, exploring\nmulti-mode architectures is computationally demanding due to the exponential\nscaling of the Hilbert space dimension. Here, we present a multi-mode device\ndesigned using evolutionary optimization techniques, which have been shown to\nbe effective for this computational task. The proposed device was optimized to\nfeature an anharmonicity of a third of the qubit frequency and reduced energy\ndispersion caused by charge and magnetic flux fluctuations. It exhibits\nimprovements over the fundamental errors limiting Transmon and Fluxonium\ncoherence and manipulation, aiming for a balance between low depolarization\nerror and fast manipulation; furthermore demonstrating robustness against\nfabrication errors, a major limitation in many proposed multi-mode devices.\nOverall, by striking a balance between coupling matrix elements and noise\nprotection, we propose a device that paves the way towards finding proper\ncharacteristics for the construction of superconducting quantum processors.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}