{"id":"2407.12329","title":"Label-Efficient 3D Brain Segmentation via Complementary 2D Diffusion\n  Models with Orthogonal Views","authors":"Jihoon Cho, Suhyun Ahn, Beomju Kim, Hyungjoon Bae, Xiaofeng Liu,\n  Fangxu Xing, Kyungeun Lee, Georges Elfakhri, Van Wedeen, Jonghye Woo, Jinah\n  Park","authorsParsed":[["Cho","Jihoon",""],["Ahn","Suhyun",""],["Kim","Beomju",""],["Bae","Hyungjoon",""],["Liu","Xiaofeng",""],["Xing","Fangxu",""],["Lee","Kyungeun",""],["Elfakhri","Georges",""],["Wedeen","Van",""],["Woo","Jonghye",""],["Park","Jinah",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 06:14:53 GMT"}],"updateDate":"2024-07-18","timestamp":1721196893000,"abstract":"  Deep learning-based segmentation techniques have shown remarkable performance\nin brain segmentation, yet their success hinges on the availability of\nextensive labeled training data. Acquiring such vast datasets, however, poses a\nsignificant challenge in many clinical applications. To address this issue, in\nthis work, we propose a novel 3D brain segmentation approach using\ncomplementary 2D diffusion models. The core idea behind our approach is to\nfirst mine 2D features with semantic information extracted from the 2D\ndiffusion models by taking orthogonal views as input, followed by fusing them\ninto a 3D contextual feature representation. Then, we use these aggregated\nfeatures to train multi-layer perceptrons to classify the segmentation labels.\nOur goal is to achieve reliable segmentation quality without requiring complete\nlabels for each individual subject. Our experiments on training in brain\nsubcortical structure segmentation with a dataset from only one subject\ndemonstrate that our approach outperforms state-of-the-art self-supervised\nlearning methods. Further experiments on the minimum requirement of annotation\nby sparse labeling yield promising results even with only nine slices and a\nlabeled background region.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}