{"id":"2407.11813","title":"Approximate inverse measurement channel for shallow shadows","authors":"Riccardo Cioli, Elisa Ercolessi, Matteo Ippoliti, Xhek Turkeshi,\n  Lorenzo Piroli","authorsParsed":[["Cioli","Riccardo",""],["Ercolessi","Elisa",""],["Ippoliti","Matteo",""],["Turkeshi","Xhek",""],["Piroli","Lorenzo",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:02:25 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 15:10:13 GMT"}],"updateDate":"2024-07-24","timestamp":1721142145000,"abstract":"  Classical shadows are a versatile tool to probe many-body quantum systems,\nconsisting of a combination of randomised measurements and classical\npost-processing computations. In a recently introduced version of the protocol,\nthe randomization step is performed via unitary circuits of variable depth $t$,\ndefining the so-called shallow shadows. For sufficiently large $t$, this\napproach allows one to get around the use of non-local unitaries to probe\nglobal properties such as the fidelity with respect to a target state or the\npurity. Still, shallow shadows involve the inversion of a many-body map, the\nmeasurement channel, which requires non-trivial computations in the\npost-processing step, thus limiting its applicability when the number of qubits\n$N$ is large. In this work, we put forward a simple approximate post-processing\nscheme where the infinite-depth inverse channel is applied to the finite-depth\nclassical shadows and study its performance for fidelity and purity estimation.\nThe scheme allows for different circuit connectivity, as we illustrate for\ngeometrically local circuits in one and two spatial dimensions and\ngeometrically non-local circuits made of two-qubit gates. For the fidelity, we\nfind that the resulting estimator coincides with a known linear cross-entropy,\nachieving an arbitrary small approximation error $\\delta$ at depth $t=O(\\log\n(N/\\delta))$ (independent of the circuit connectivity). For the purity, we show\nthat the estimator becomes accurate at a depth $O(N)$. In addition, at those\ndepths, the variances of both the fidelity and purity estimators display the\nsame scaling with $N$ as in the case of global random unitaries. We establish\nthese bounds by analytic arguments and extensive numerical computations in\nseveral cases of interest. Our work extends the applicability of shallow\nshadows to large system sizes and general circuit connectivity.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}