{"id":"2407.06963","title":"Transferring spectroscopic stellar labels to 217 million Gaia DR3 XP\n  stars with SHBoost","authors":"A. Khalatyan, F. Anders, C. Chiappini, A. B. A. Queiroz, S. Nepal, M.\n  dal Ponte, C. Jordi, G. Guiglion, M. Valentini, G. Torralba Elipe, M.\n  Steinmetz, M. Pantaleoni-Gonz\\'alez, S. Malhotra, \\'O. Jim\\'enez-Arranz, H.\n  Enke, L. Casamiquela, J. Ard\\`evol","authorsParsed":[["Khalatyan","A.",""],["Anders","F.",""],["Chiappini","C.",""],["Queiroz","A. B. A.",""],["Nepal","S.",""],["Ponte","M. dal",""],["Jordi","C.",""],["Guiglion","G.",""],["Valentini","M.",""],["Elipe","G. Torralba",""],["Steinmetz","M.",""],["Pantaleoni-González","M.",""],["Malhotra","S.",""],["Jiménez-Arranz","Ó.",""],["Enke","H.",""],["Casamiquela","L.",""],["Ardèvol","J.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 15:44:49 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 07:19:03 GMT"}],"updateDate":"2024-09-19","timestamp":1720539889000,"abstract":"  We explore the feasibility of using machine-learning regression as a method\nof extracting basic stellar parameters and line-of-sight extinctions, given\nspectro-photometric data. To this end, we build a stable gradient-boosted\nrandom-forest regressor (xgboost), trained on spectroscopic data, capable of\nproducing output parameters with reliable uncertainties from Gaia DR3 data\n(most notably the low-resolution XP spectra) without ground-based spectroscopic\nobservations. Using Shapley additive explanations, we are able to interpret how\nthe predictions for each star are influenced by each data feature. For the\ntraining and testing of the network, we use high-quality parameters obtained\nfrom the StarHorse code for a sample of around eight million stars observed by\nmajor spectroscopic surveys (APOGEE, GALAH, LAMOST, RAVE, SEGUE, and GES),\ncomplemented by curated samples of hot stars, very metal-poor stars, white\ndwarfs, and hot sub-dwarfs. The training data cover the whole sky, all Galactic\ncomponents, and almost the full magnitude range of the Gaia DR3 XP sample of\nmore than 217 million objects that also have parallaxes. We achieve median\nuncertainties (at $G\\approx16$) of 0.20 mag in V-band extinction, 0.01 dex in\nlogarithmic effective temperature, 0.20 dex in surface gravity, 0.18 dex in\nmetallicity, and $12\\%$ in mass (over the full Gaia DR3 XP sample, with\nconsiderable variations in precision as a function of magnitude and stellar\ntype). We succeed in predicting competitive results based on Gaia DR3 XP\nspectra compared to classical isochrone fitting methods we employed in earlier\nwork, especially for the parameters $A_V$, $T_{\\rm eff}$, and metallicity.\nFinally, we showcase some applications of this new catalogue (e.g. extinction\nmaps, metallicity trends in the Milky Way, extended maps of young massive\nstars, metal-poor stars, and metal-rich stars). [abridged]\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}