{"id":"2407.00694","title":"Enumeration of minimal transversals of hypergraphs of bounded\n  VC-dimension","authors":"Arnaud Mary","authorsParsed":[["Mary","Arnaud",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 13:31:44 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 08:44:16 GMT"}],"updateDate":"2024-07-04","timestamp":1719754304000,"abstract":"  We consider the problem of enumerating all minimal transversals (also called\nminimal hitting sets) of a hypergraph $\\mathcal{H}$. An equivalent formulation\nof this problem known as the \\emph{transversal hypergraph} problem (or\n\\emph{hypergraph dualization} problem) is to decide, given two hypergraphs,\nwhether one corresponds to the set of minimal transversals of the other. The\nexistence of a polynomial time algorithm to solve this problem is a long\nstanding open question. In \\cite{fredman_complexity_1996}, the authors present\nthe first sub-exponential algorithm to solve the transversal hypergraph problem\nwhich runs in quasi-polynomial time, making it unlikely that the problem is\n(co)NP-complete.\n  In this paper, we show that when one of the two hypergraphs is of bounded\nVC-dimension, the transversal hypergraph problem can be solved in polynomial\ntime, or equivalently that if $\\mathcal{H}$ is a hypergraph of bounded\nVC-dimension, then there exists an incremental polynomial time algorithm to\nenumerate its minimal transversals. This result generalizes most of the\npreviously known polynomial cases in the literature since they almost all\nconsider classes of hypergraphs of bounded VC-dimension. As a consequence, the\nhypergraph transversal problem is solvable in polynomial time for any class of\nhypergraphs closed under partial subhypergraphs. We also show that the proposed\nalgorithm runs in quasi-polynomial time in general hypergraphs and runs in\npolynomial time if the conformality of the hypergraph is bounded, which is one\nof the few known polynomial cases where the VC-dimension is unbounded.\n","subjects":["Mathematics/Combinatorics","Computing Research Repository/Computational Complexity","Computing Research Repository/Discrete Mathematics","Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QWeuP0OpaXIvg3IfSNgXkDhuZHMwqmC9mu2xD1kHd3g","pdfSize":"226311"}
