{"id":"2407.14081","title":"DisenSemi: Semi-supervised Graph Classification via Disentangled\n  Representation Learning","authors":"Yifan Wang, Xiao Luo, Chong Chen, Xian-Sheng Hua, Ming Zhang, Wei Ju","authorsParsed":[["Wang","Yifan",""],["Luo","Xiao",""],["Chen","Chong",""],["Hua","Xian-Sheng",""],["Zhang","Ming",""],["Ju","Wei",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 07:31:32 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 08:23:12 GMT"}],"updateDate":"2024-08-12","timestamp":1721374292000,"abstract":"  Graph classification is a critical task in numerous multimedia applications,\nwhere graphs are employed to represent diverse types of multimedia data,\nincluding images, videos, and social networks. Nevertheless, in real-world\nscenarios, labeled graph data can be limited or scarce. To address this issue,\nwe focus on the problem of semi-supervised graph classification, which involves\nboth supervised and unsupervised models learning from labeled and unlabeled\ndata. In contrast to recent approaches that transfer the entire knowledge from\nthe unsupervised model to the supervised one, we argue that an effective\ntransfer should only retain the relevant semantics that align well with the\nsupervised task. In this paper, we propose a novel framework named DisenSemi,\nwhich learns disentangled representation for semi-supervised graph\nclassification. Specifically, a disentangled graph encoder is proposed to\ngenerate factor-wise graph representations for both supervised and unsupervised\nmodels. Then we train two models via supervised objective and mutual\ninformation (MI)-based constraints respectively. To ensure the meaningful\ntransfer of knowledge from the unsupervised encoder to the supervised one, we\nfurther define an MI-based disentangled consistency regularization between two\nmodels and identify the corresponding rationale that aligns well with the\ncurrent graph classification task. Experimental results on a range of publicly\naccessible datasets reveal the effectiveness of our DisenSemi.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval","Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}