{"id":"2407.00099","title":"Optimal Transport for Latent Integration with An Application to\n  Heterogeneous Neuronal Activity Data","authors":"Yubai Yuan, Babak Shahbaba, Norbert Fortin, Keiland Cooper, Qing Nie,\n  Annie Qu","authorsParsed":[["Yuan","Yubai",""],["Shahbaba","Babak",""],["Fortin","Norbert",""],["Cooper","Keiland",""],["Nie","Qing",""],["Qu","Annie",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 04:29:21 GMT"}],"updateDate":"2024-07-02","timestamp":1719462561000,"abstract":"  Detecting dynamic patterns of task-specific responses shared across\nheterogeneous datasets is an essential and challenging problem in many\nscientific applications in medical science and neuroscience. In our motivating\nexample of rodent electrophysiological data, identifying the dynamical patterns\nin neuronal activity associated with ongoing cognitive demands and behavior is\nkey to uncovering the neural mechanisms of memory. One of the greatest\nchallenges in investigating a cross-subject biological process is that the\nsystematic heterogeneity across individuals could significantly undermine the\npower of existing machine learning methods to identify the underlying\nbiological dynamics. In addition, many technically challenging neurobiological\nexperiments are conducted on only a handful of subjects where rich longitudinal\ndata are available for each subject. The low sample sizes of such experiments\ncould further reduce the power to detect common dynamic patterns among\nsubjects. In this paper, we propose a novel heterogeneous data integration\nframework based on optimal transport to extract shared patterns in complex\nbiological processes. The key advantages of the proposed method are that it can\nincrease discriminating power in identifying common patterns by reducing\nheterogeneity unrelated to the signal by aligning the extracted latent\nspatiotemporal information across subjects. Our approach is effective even with\na small number of subjects, and does not require auxiliary matching information\nfor the alignment. In particular, our method can align longitudinal data across\nheterogeneous subjects in a common latent space to capture the dynamics of\nshared patterns while utilizing temporal dependency within subjects.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Machine Learning","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"27w0hk-a-d8pVvdTBQWBY__ehSaK-Ehh2jAnglyov9Q","pdfSize":"2640989"}
