{"id":"2407.09407","title":"Exploring Galactic open clusters with Gaia I. An examination in the\n  first kiloparsec","authors":"Jeison Alfonso, Alejandro Garc\\'ia-Varela and Katherine Vieira","authorsParsed":[["Alfonso","Jeison",""],["García-Varela","Alejandro",""],["Vieira","Katherine",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 16:35:01 GMT"}],"updateDate":"2024-08-28","timestamp":1720802101000,"abstract":"  Context. Since the first publication of the Gaia catalogue a new view of our\nGalaxy has arrived. Its astrometric and photometric information has improved\nthe precision of the physical parameters of open star clusters obtained from\nthem. Aims. Using the Gaia DR3 catalogue, we aim to find physical stellar\nmembers including faint stars for 370 Galactic open clusters located within 1\nkpc. We also estimate the age, metallicity, distance modulus and extinction of\nthese clusters. Methods. We employ the HDBSCAN algorithm on both astrometric\nand photometric data to identify members in the open clusters. Subsequently, we\nrefine the samples by eliminating outliers through the application of the\nMahalanobis metric utilizing the chi-square distribution at a confidence level\nof 95%. Furthermore, we characterize the stellar parameters with the PARSEC\nisochrones. Results. We obtain reliable star members for 370 open clusters with\nan average parallax error of 0.16 mas. We identify about 40% more stars in\nthese clusters compared to previous work using the Gaia DR2 catalogue,\nincluding faint stars as new members with G > 17. Before the clustering\napplication we correct the parallax zero-point bias to avoid spatial\ndistribution stretching that may affect clustering results. Our membership\nlists include merging stars identified by HDBSCAN with astrometry and\nphotometry. We note that the use of photometry in clustering can recover up to\n10% more stars in the fainter limit than clustering based on astrometry only,\nthis combined with the selection of stars filtering them out by quality cuts\nsignificantly reduces the number of stars with huge parallax error. After\nclustering, we estimate age, Z, and AV from the photometry of the membership\nlists.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}