{"id":"2407.17100","title":"Generalized Morse Functions, Excision and Higher Torsions","authors":"Martin Puchol and Junrong Yan","authorsParsed":[["Puchol","Martin",""],["Yan","Junrong",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 08:52:28 GMT"}],"updateDate":"2024-07-25","timestamp":1721811148000,"abstract":"  Comparing invariants from both topological and geometric perspectives is a\nkey focus in index theorem. This paper compares higher analytic and topological\ntorsions and establishes a version of the higher Cheeger-M\\\"uller/Bismut-Zhang\ntheorem. In fact, Bismut-Goette achieved this comparison assuming the existence\nof fiberwise Morse functions satisfying the fiberwise Thom-Smale transversality\ncondition (TS condition). To fully generalize the theorem, we should remove\nthis assumption. Notably, unlike fiberwise Morse functions, fiberwise\ngeneralized Morse functions (GMFs) always exist, we extend Bismut-Goette's\nsetup by considering a fibration $ M \\to S $ with a unitarily flat complex\nbundle $ F \\to M $ and a fiberwise GMF $ f $, while retaining the TS condition.\n  Compared to Bismut-Goette's work, handling birth-death points for a\ngeneralized Morse function poses a key difficulty. To address this, first, by\nthe work of the author M.P., joint with Zhang and Zhu, we focus on a relative\nversion of the theorem. Here, analytic and topological torsions are normalized\nby subtracting their corresponding torsions for trivial bundles. Next, using\nnew techniques from by the author J.Y., we excise a small neighborhood around\nthe locus where $f$ has birth-death points. This reduces the problem to\nBismut-Goette's settings (or its version with boundaries) via a Witten-type\ndeformation. However, new difficulties arise from very singular critical points\nduring this deformation.To address these, we extend methods from Bismut-Lebeau,\nusing Agmon estimates for noncompact manifolds developed by Dai and J.Y.\n","subjects":["Mathematics/Differential Geometry","Mathematics/Analysis of PDEs","Mathematics/Spectral Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}