{"id":"2407.00488","title":"PFME: A Modular Approach for Fine-grained Hallucination Detection and\n  Editing of Large Language Models","authors":"Kunquan Deng, Zeyu Huang, Chen Li, Chenghua Lin, Min Gao, Wenge Rong","authorsParsed":[["Deng","Kunquan",""],["Huang","Zeyu",""],["Li","Chen",""],["Lin","Chenghua",""],["Gao","Min",""],["Rong","Wenge",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 16:35:57 GMT"}],"updateDate":"2024-07-02","timestamp":1719678957000,"abstract":"  Large Language Models (LLMs) excel in fluency but risk producing inaccurate\ncontent, called \"hallucinations.\" This paper outlines a standardized process\nfor categorizing fine-grained hallucination types and proposes an innovative\nframework--the Progressive Fine-grained Model Editor (PFME)--specifically\ndesigned to detect and correct fine-grained hallucinations in LLMs. PFME\nconsists of two collaborative modules: the Real-time Fact Retrieval Module and\nthe Fine-grained Hallucination Detection and Editing Module. The former\nidentifies key entities in the document and retrieves the latest factual\nevidence from credible sources. The latter further segments the document into\nsentence-level text and, based on relevant evidence and previously edited\ncontext, identifies, locates, and edits each sentence's hallucination type.\nExperimental results on FavaBench and FActScore demonstrate that PFME\noutperforms existing methods in fine-grained hallucination detection tasks.\nParticularly, when using the Llama3-8B-Instruct model, PFME's performance in\nfine-grained hallucination detection with external knowledge assistance\nimproves by 8.7 percentage points (pp) compared to ChatGPT. In editing tasks,\nPFME further enhances the FActScore of FActScore-Alpaca13B and\nFActScore-ChatGPT datasets, increasing by 16.2pp and 4.6pp, respectively.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cjtnCNL9zR7mfwW4dIwRzJQIuX3pdfLwu4eqUxpnLn4","pdfSize":"547434"}
