{"id":"2407.20499","title":"Optimizing Long-tailed Link Prediction in Graph Neural Networks through\n  Structure Representation Enhancement","authors":"Yakun Wang, Daixin Wang, Hongrui Liu, Binbin Hu, Yingcui Yan, Qiyang\n  Zhang, Zhiqiang Zhang","authorsParsed":[["Wang","Yakun",""],["Wang","Daixin",""],["Liu","Hongrui",""],["Hu","Binbin",""],["Yan","Yingcui",""],["Zhang","Qiyang",""],["Zhang","Zhiqiang",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 02:20:38 GMT"}],"updateDate":"2024-07-31","timestamp":1722306038000,"abstract":"  Link prediction, as a fundamental task for graph neural networks (GNNs), has\nboasted significant progress in varied domains. Its success is typically\ninfluenced by the expressive power of node representation, but recent\ndevelopments reveal the inferior performance of low-degree nodes owing to their\nsparse neighbor connections, known as the degree-based long-tailed problem.\nWill the degree-based long-tailed distribution similarly constrain the efficacy\nof GNNs on link prediction? Unexpectedly, our study reveals that only a mild\ncorrelation exists between node degree and predictive accuracy, and more\nimportantly, the number of common neighbors between node pairs exhibits a\nstrong correlation with accuracy. Considering node pairs with less common\nneighbors, i.e., tail node pairs, make up a substantial fraction of the dataset\nbut achieve worse performance, we propose that link prediction also faces the\nlong-tailed problem. Therefore, link prediction of GNNs is greatly hindered by\nthe tail node pairs. After knowing the weakness of link prediction, a natural\nquestion is how can we eliminate the negative effects of the skewed long-tailed\ndistribution on common neighbors so as to improve the performance of link\nprediction? Towards this end, we introduce our long-tailed framework (LTLP),\nwhich is designed to enhance the performance of tail node pairs on link\nprediction by increasing common neighbors. Two key modules in LTLP respectively\nsupplement high-quality edges for tail node pairs and enforce representational\nalignment between head and tail node pairs within the same category, thereby\nimproving the performance of tail node pairs.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}