{"id":"2407.19953","title":"FedDEO: Description-Enhanced One-Shot Federated Learning with Diffusion\n  Models","authors":"Mingzhao Yang, Shangchao Su, Bin Li, Xiangyang Xue","authorsParsed":[["Yang","Mingzhao",""],["Su","Shangchao",""],["Li","Bin",""],["Xue","Xiangyang",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 12:40:12 GMT"}],"updateDate":"2024-07-30","timestamp":1722256812000,"abstract":"  In recent years, the attention towards One-Shot Federated Learning (OSFL) has\nbeen driven by its capacity to minimize communication. With the development of\nthe diffusion model (DM), several methods employ the DM for OSFL, utilizing\nmodel parameters, image features, or textual prompts as mediums to transfer the\nlocal client knowledge to the server. However, these mediums often require\npublic datasets or the uniform feature extractor, significantly limiting their\npracticality. In this paper, we propose FedDEO, a Description-Enhanced One-Shot\nFederated Learning Method with DMs, offering a novel exploration of utilizing\nthe DM in OSFL. The core idea of our method involves training local\ndescriptions on the clients, serving as the medium to transfer the knowledge of\nthe distributed clients to the server. Firstly, we train local descriptions on\nthe client data to capture the characteristics of client distributions, which\nare then uploaded to the server. On the server, the descriptions are used as\nconditions to guide the DM in generating synthetic datasets that comply with\nthe distributions of various clients, enabling the training of the aggregated\nmodel. Theoretical analyses and sufficient quantitation and visualization\nexperiments on three large-scale real-world datasets demonstrate that through\nthe training of local descriptions, the server is capable of generating\nsynthetic datasets with high quality and diversity. Consequently, with\nadvantages in communication and privacy protection, the aggregated model\noutperforms compared FL or diffusion-based OSFL methods and, on some clients,\noutperforms the performance ceiling of centralized training.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}