{"id":"2407.09629","title":"FEBio FINESSE: An open-source finite element simulation approach to\n  estimate in vivo heart valve strains using shape enforcement","authors":"Devin W. Laurence, Patricia M. Sabin, Analise M. Sulentic, Matthew\n  Daemer, Steve A. Maas, Jeffrey A. Weiss, Matthew A. Jolley","authorsParsed":[["Laurence","Devin W.",""],["Sabin","Patricia M.",""],["Sulentic","Analise M.",""],["Daemer","Matthew",""],["Maas","Steve A.",""],["Weiss","Jeffrey A.",""],["Jolley","Matthew A.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 18:32:59 GMT"}],"updateDate":"2024-07-16","timestamp":1720809179000,"abstract":"  Finite element simulations are an enticing tool to evaluate heart valve\nfunction in healthy and diseased patients; however, patient-specific\nsimulations derived from 3D echocardiography are hampered by several technical\nchallenges. In this work, we present an open-source method to enforce matching\nbetween finite element simulations and in vivo image-derived heart valve\ngeometry in the absence of patient-specific material properties, leaflet\nthickness, and chordae tendineae structures. We evaluate FEBio Finite Element\nSimulations with Shape Enforcement (FINESSE) using three synthetic test cases\ncovering a wide range of model complexity. Our results suggest that FINESSE can\nbe used to not only enforce finite element simulations to match an\nimage-derived surface, but to also estimate the first principal leaflet strains\nwithin +/- 0.03 strain. Key FINESSE considerations include: (i) appropriately\ndefining the user-defined penalty, (ii) omitting the leaflet commissures to\nimprove simulation convergence, and (iii) emulating the chordae tendineae\nbehavior via prescribed leaflet free edge motion or a chordae emulating force.\nWe then use FINESSE to estimate the in vivo valve behavior and leaflet strains\nfor three pediatric patients. In all three cases, FINESSE successfully matched\nthe target surface with median errors similar to or less than the smallest\nvoxel dimension. Further analysis revealed valve-specific findings, such as the\ntricuspid valve leaflet strains of a 2-day old patient with HLHS being larger\nthan those of two 13-year old patients. The development of this open source\npipeline will enable future studies to begin linking in vivo leaflet mechanics\nwith patient outcomes\n","subjects":["Physics/Medical Physics","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8c6pEkoI9hdUZ93Ur2FwbR_AoXxA3hbECcn3z0UDxlA","pdfSize":"19150289","objectId":"0x3cb1383d7b5a839c36eff3dcf949ad43d527d73d3f63cdf8ad2dd480c952e458","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
