{"id":"2407.18909","title":"Hybrid summary statistics: neural weak lensing inference beyond the\n  power spectrum","authors":"T. Lucas Makinen, Alan Heavens, Natalia Porqueres, Tom Charnock, Axel\n  Lapel, Benjamin D. Wandelt","authorsParsed":[["Makinen","T. Lucas",""],["Heavens","Alan",""],["Porqueres","Natalia",""],["Charnock","Tom",""],["Lapel","Axel",""],["Wandelt","Benjamin D.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:59:26 GMT"}],"updateDate":"2024-07-29","timestamp":1722016766000,"abstract":"  In inference problems, we often have domain knowledge which allows us to\ndefine summary statistics that capture most of the information content in a\ndataset. In this paper, we present a hybrid approach, where such physics-based\nsummaries are augmented by a set of compressed neural summary statistics that\nare optimised to extract the extra information that is not captured by the\npredefined summaries. The resulting statistics are very powerful inputs to\nsimulation-based or implicit inference of model parameters. We apply this\ngeneralisation of Information Maximising Neural Networks (IMNNs) to parameter\nconstraints from tomographic weak gravitational lensing convergence maps to\nfind summary statistics that are explicitly optimised to complement angular\npower spectrum estimates. We study several dark matter simulation resolutions\nin low- and high-noise regimes. We show that i) the information-update\nformalism extracts at least $3\\times$ and up to $8\\times$ as much information\nas the angular power spectrum in all noise regimes, ii) the network summaries\nare highly complementary to existing 2-point summaries, and iii) our formalism\nallows for networks with smaller, physically-informed architectures to match\nmuch larger regression networks with far fewer simulations needed to obtain\nasymptotically optimal inference.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Computing Research Repository/Machine Learning","Physics/Computational Physics","Statistics/Machine Learning","Statistics/Other Statistics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"n3yNyaSj1WBC_6Oa4RPZA-BQ08Oq8m2eurqYuck9TEo","pdfSize":"6257150"}
