{"id":"2407.11836","title":"Magnetic memory and distinct spin populations in ferromagnetic Co3Sn2S2","authors":"Charles Menil, Brigitte Leridon, Antonella Cavanna, Ulf Gennser,\n  Dominique Mailly, Linchao Ding, Xiaokang Li, Zengwei Zhu, Beno\\^it Fauqu\\'e\n  and Kamran Behnia","authorsParsed":[["Menil","Charles",""],["Leridon","Brigitte",""],["Cavanna","Antonella",""],["Gennser","Ulf",""],["Mailly","Dominique",""],["Ding","Linchao",""],["Li","Xiaokang",""],["Zhu","Zengwei",""],["Fauqué","Benoît",""],["Behnia","Kamran",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:21:34 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 08:52:55 GMT"}],"updateDate":"2024-09-19","timestamp":1721143294000,"abstract":"  Co3Sn2S2, a ferromagnetic Weyl semi-metal with Co atoms on a kagome lattice,\nhas generated much recent attention. Experiments have identified a temperature\nscale below the Curie temperature. Here, we find that this magnet keeps a\nmemory, when not exposed to a magnetic field sufficiently large to erase it. We\nidentify the driver of this memory effect as a small secondary population of\nspins, whose coercive field is significantly larger than that of the majority\nspins. The shape of the magnetization hysteresis curve has a threshold magnetic\nfield set by the demagnetizing factor. These two field scales set the hitherto\nunidentified temperature scale, which is not a thermodynamic phase transition,\nbut a crossing point between meta-stable boundaries. Global magnetization is\nwell defined, even when it is non-uniform, but drastic variations in local\nmagnetization point to a coarse energy landscape, with the thermodynamic limit\nnot achieved at micrometer length scales.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Jlc5sYlt6J3VKC8QdjjSy4ilYjtSMPdXQwl8qfhEI9c","pdfSize":"2548395","objectId":"0xffae13e14c58c5b233aadcb17db2efc9ed19fbfc3bea0d201cc717b760b5b075","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
