{"id":"2407.14757","title":"Enhancing Skin Disease Classification Leveraging Transformer-based Deep\n  Learning Architectures and Explainable AI","authors":"Jayanth Mohan, Arrun Sivasubramanian, V Sowmya and Ravi Vinayakumar","authorsParsed":[["Mohan","Jayanth",""],["Sivasubramanian","Arrun",""],["Sowmya","V",""],["Vinayakumar","Ravi",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 05:38:00 GMT"}],"updateDate":"2024-07-23","timestamp":1721453880000,"abstract":"  Skin diseases affect over a third of the global population, yet their impact\nis often underestimated. Automating skin disease classification to assist\ndoctors with their prognosis might be difficult. Nevertheless, due to efficient\nfeature extraction pipelines, deep learning techniques have shown much promise\nfor various tasks, including dermatological disease identification. This study\nuses a skin disease dataset with 31 classes and compares it with all versions\nof Vision Transformers, Swin Transformers and DivoV2. The analysis is also\nextended to compare with benchmark convolution-based architecture presented in\nthe literature. Transfer learning with ImageNet1k weights on the skin disease\ndataset contributes to a high test accuracy of 96.48\\% and an F1-Score of\n0.9727 using DinoV2, which is almost a 10\\% improvement over this data's\ncurrent benchmark results. The performance of DinoV2 was also compared for the\nHAM10000 and Dermnet datasets to test the model's robustness, and the trained\nmodel overcomes the benchmark results by a slight margin in test accuracy and\nin F1-Score on the 23 and 7 class datasets. The results are substantiated using\nexplainable AI frameworks like GradCAM and SHAP, which provide precise image\nlocations to map the disease, assisting dermatologists in early detection,\nprompt prognosis, and treatment.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wbOH-psuz8noGMewIgJfwMscj7LDpAEWIjow_CA-WVI","pdfSize":"7600217"}
