{"id":"2407.19711","title":"TVDiag: A Task-oriented and View-invariant Failure Diagnosis Framework\n  with Multimodal Data","authors":"Shuaiyu Xie, Jian Wang, Hanbin He, Zhihao Wang, Yuqi Zhao, Neng Zhang,\n  Bing Li","authorsParsed":[["Xie","Shuaiyu",""],["Wang","Jian",""],["He","Hanbin",""],["Wang","Zhihao",""],["Zhao","Yuqi",""],["Zhang","Neng",""],["Li","Bing",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 05:26:57 GMT"},{"version":"v2","created":"Sat, 24 Aug 2024 02:50:15 GMT"}],"updateDate":"2024-08-27","timestamp":1722230817000,"abstract":"  Microservice-based systems often suffer from reliability issues due to their\nintricate interactions and expanding scale. With the rapid growth of\nobservability techniques, various methods have been proposed to achieve failure\ndiagnosis, including root cause localization and failure type identification,\nby leveraging diverse monitoring data such as logs, metrics, or traces.\nHowever, traditional failure diagnosis methods that use single-modal data can\nhardly cover all failure scenarios due to the restricted information. Several\nfailure diagnosis methods have been recently proposed to integrate multimodal\ndata based on deep learning. These methods, however, tend to combine modalities\nindiscriminately and treat them equally in failure diagnosis, ignoring the\nrelationship between specific modalities and different diagnostic tasks. This\noversight hinders the effective utilization of the unique advantages offered by\neach modality. To address the limitation, we propose \\textit{TVDiag}, a\nmultimodal failure diagnosis framework for locating culprit microservice\ninstances and identifying their failure types (e.g., Net-packets Corruption) in\nmicroservice-based systems. \\textit{TVDiag} employs task-oriented learning to\nenhance the potential advantages of each modality and establishes cross-modal\nassociations based on contrastive learning to extract view-invariant failure\ninformation. Furthermore, we develop a graph-level data augmentation strategy\nthat randomly inactivates the observability of some normal microservice\ninstances during training to mitigate the shortage of training data.\nExperimental results show that \\textit{TVDiag} outperforms state-of-the-art\nmethods in multimodal failure diagnosis, achieving at least a 55.94\\% higher\n$HR@1$ accuracy and over a 4.08\\% increase in F1-score across two datasets.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}