{"id":"2407.19005","title":"Spinning Black Hole Scattering at $\\mathcal{O}(G^3 S^2)$: Casimir Terms,\n  Radial Action and Hidden Symmetry","authors":"Dogan Akpinar, Fernando Febres Cordero, Manfred Kraus, Michael S. Ruf,\n  Mao Zeng","authorsParsed":[["Akpinar","Dogan",""],["Cordero","Fernando Febres",""],["Kraus","Manfred",""],["Ruf","Michael S.",""],["Zeng","Mao",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-30","timestamp":1722016801000,"abstract":"  We resolve subtleties in calculating the post-Minksowskian dynamics of binary\nsystems, as a spin expansion, from massive scattering amplitudes of fixed\nfinite spin. In particular, the apparently ambiguous spin Casimir terms can be\nfully determined from the gradient of the spin-diagonal part of the amplitudes\nwith respect to $S^2 = -s(s+1)\\hbar^2$, using an interpolation between massive\namplitudes with different spin representations. From two-loop amplitudes of\nspin-0 and spin-1 particles minimally coupled to gravity, we extract the spin\nCasimir terms in the conservative scattering angle between a spinless and a\nspinning black hole at $\\mathcal{O}(G^3 S^2)$, finding agreement with known\nresults in the literature. This completes an earlier study [Phys. Rev. Lett.\n130 (2023), 021601] that calculated the non-Casimir terms from amplitudes. We\nalso illustrate our methods using a model of spinning bodies in\nelectrodynamics, finding agreement between scattering amplitude predictions and\nclassical predictions in a root-Kerr electromagnetic background up to\n$\\mathcal{O}(\\alpha^3 S^2)$. For both gravity and electrodynamics, the finite\npart of the amplitude coincides with the two-body radial action in the aligned\nspin limit, generalizing the amplitude-action relation beyond the spinless\ncase. Surprisingly, the two-loop amplitude displays a hidden spin-shift\nsymmetry in the probe limit, which was previously observed at one loop. We\nconjecture that the symmetry holds to all orders in the coupling constant and\nis a consequence of integrability of Kerr orbits in the probe limit at the\nfirst few orders in spin.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"axpdGlSqKk23ZnEH7MAOQDqisZh3fTBNlJEAyJNVZsY","pdfSize":"1022393"}
