{"id":"2407.19845","title":"BackdoorBench: A Comprehensive Benchmark and Analysis of Backdoor\n  Learning","authors":"Baoyuan Wu, Hongrui Chen, Mingda Zhang, Zihao Zhu, Shaokui Wei, Danni\n  Yuan, Mingli Zhu, Ruotong Wang, Li Liu, Chao Shen","authorsParsed":[["Wu","Baoyuan",""],["Chen","Hongrui",""],["Zhang","Mingda",""],["Zhu","Zihao",""],["Wei","Shaokui",""],["Yuan","Danni",""],["Zhu","Mingli",""],["Wang","Ruotong",""],["Liu","Li",""],["Shen","Chao",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 09:57:03 GMT"}],"updateDate":"2024-07-30","timestamp":1722247023000,"abstract":"  As an emerging approach to explore the vulnerability of deep neural networks\n(DNNs), backdoor learning has attracted increasing interest in recent years,\nand many seminal backdoor attack and defense algorithms are being developed\nsuccessively or concurrently, in the status of a rapid arms race. However,\nmainly due to the diverse settings, and the difficulties of implementation and\nreproducibility of existing works, there is a lack of a unified and\nstandardized benchmark of backdoor learning, causing unfair comparisons or\nunreliable conclusions (e.g., misleading, biased or even false conclusions).\nConsequently, it is difficult to evaluate the current progress and design the\nfuture development roadmap of this literature. To alleviate this dilemma, we\nbuild a comprehensive benchmark of backdoor learning called BackdoorBench. Our\nbenchmark makes three valuable contributions to the research community. 1) We\nprovide an integrated implementation of state-of-the-art (SOTA) backdoor\nlearning algorithms (currently including 20 attack and 32 defense algorithms),\nbased on an extensible modular-based codebase. 2) We conduct comprehensive\nevaluations with 5 poisoning ratios, based on 4 models and 4 datasets, leading\nto 11,492 pairs of attack-against-defense evaluations in total. 3) Based on\nabove evaluations, we present abundant analysis from 10 perspectives via 18\nuseful analysis tools, and provide several inspiring insights about backdoor\nlearning. We hope that our efforts could build a solid foundation of backdoor\nlearning to facilitate researchers to investigate existing algorithms, develop\nmore innovative algorithms, and explore the intrinsic mechanism of backdoor\nlearning. Finally, we have created a user-friendly website at\nhttp://backdoorbench.com, which collects all important information of\nBackdoorBench, including codebase, docs, leaderboard, and model Zoo.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}