{"id":"2407.02517","title":"CAV-AHDV-CAV: Mitigating Traffic Oscillations for CAVs through a Novel\n  Car-Following Structure and Reinforcement Learning","authors":"Xianda Chen, PakHin Tiu, Yihuai Zhang, Xinhu Zheng, Meixin Zhu","authorsParsed":[["Chen","Xianda",""],["Tiu","PakHin",""],["Zhang","Yihuai",""],["Zheng","Xinhu",""],["Zhu","Meixin",""]],"versions":[{"version":"v1","created":"Sun, 23 Jun 2024 15:38:29 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 03:27:50 GMT"}],"updateDate":"2024-07-12","timestamp":1719157109000,"abstract":"  Connected and Automated Vehicles (CAVs) offer a promising solution to the\nchallenges of mixed traffic with both CAVs and Human-Driven Vehicles (HDVs). A\nsignificant hurdle in such scenarios is traffic oscillation, or the\n\"stop-and-go\" pattern, during car-following situations. While HDVs rely on\nlimited information, CAVs can leverage data from other CAVs for better\ndecision-making. This allows CAVs to anticipate and mitigate the spread of\ndeceleration waves that worsen traffic flow. We propose a novel \"CAV-AHDV-CAV\"\ncar-following framework that treats the sequence of HDVs between two CAVs as a\nsingle entity, eliminating noise from individual driver behaviors. This deep\nreinforcement learning approach analyzes vehicle equilibrium states and employs\na state fusion strategy. Trained and tested on diverse datasets (HighD, NGSIM,\nSPMD, Waymo, Lyft) encompassing over 70,000 car-following instances, our model\noutperforms baselines in collision avoidance, maintaining equilibrium with both\npreceding and leading vehicles and achieving the lowest standard deviation of\ntime headway. These results demonstrate the effectiveness of our approach in\ndeveloping robust CAV control strategies for mixed traffic. Our model has the\npotential to mitigate traffic oscillation, improve traffic flow efficiency, and\nenhance overall safety.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}