{"id":"2407.02056","title":"Integrate the Essence and Eliminate the Dross: Fine-Grained\n  Self-Consistency for Free-Form Language Generation","authors":"Xinglin Wang, Yiwei Li, Shaoxiong Feng, Peiwen Yuan, Boyuan Pan, Heda\n  Wang, Yao Hu, Kan Li","authorsParsed":[["Wang","Xinglin",""],["Li","Yiwei",""],["Feng","Shaoxiong",""],["Yuan","Peiwen",""],["Pan","Boyuan",""],["Wang","Heda",""],["Hu","Yao",""],["Li","Kan",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 08:38:31 GMT"}],"updateDate":"2024-07-03","timestamp":1719909511000,"abstract":"  Self-consistency (SC), leveraging multiple samples from LLMs, shows\nsignificant gains on various reasoning tasks but struggles with free-form\ngeneration due to the difficulty of aggregating answers. Its variants, UCS and\nUSC, rely on sample selection or voting mechanisms to improve output quality.\nThese methods, however, face limitations due to their inability to fully\nutilize the nuanced consensus knowledge present within multiple candidate\nsamples, often resulting in suboptimal outputs. We propose Fine-Grained\nSelf-Consistency (FSC) to addresses these limitations by extracting and\nintegrating segment-level commonalities from candidate samples, enhancing the\nperformance of LLMs both in open-ended and reasoning tasks. Based on this, we\npresent two additional strategies: candidate filtering, which enhances overall\nquality by identifying highly similar candidate sets, and merging, which\nreduces input token requirements by combining similar samples. The\neffectiveness of FSC is demonstrated through extensive experiments on various\ntasks, including summarization, code generation, and mathematical reasoning,\nusing GPT-3.5-turbo and GPT-4. The results indicate significant improvements\nover baseline methods, showcasing the potential of FSC to optimize output\nquality by effectively synthesizing fine-grained consensus knowledge from\nmultiple samples.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}