{"id":"2407.18447","title":"Matlab-based Epoch Extraction for Speaker Differentiation","authors":"Kunlun Li, Daniel Ferro, Xu Zhao, Abdul Jabbar Syed, Anil K Vuppala,\n  Azeemuddin Syed","authorsParsed":[["Li","Kunlun",""],["Ferro","Daniel",""],["Zhao","Xu",""],["Syed","Abdul Jabbar",""],["Vuppala","Anil K",""],["Syed","Azeemuddin",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 01:01:32 GMT"}],"updateDate":"2024-07-29","timestamp":1721955692000,"abstract":"  Epoch extraction has become increasingly popular in recent years for speech\nanalysis research because accurately detecting the location of the Epoch is\ncrucial for analyzing speech signals. The Epoch, occurring at the instant of\nexcitation in the vocal tract system, particularly during glottal closure,\nplays a significant role in differentiating speakers in multi-speaker\nconversations. However, the extraction of the Epoch poses a challenge due to\nthe time-varying factors in the vocal tract system, which makes deconvolution\nfor obtaining the original excitation location more complex. In this paper,\nvarious methods for Epoch extraction, including Zero Frequency Filtering (ZFF)\nand Zero Frequency Resonator (ZFR), will be discussed, and their pros and cons\nevaluated. In addition, the stability, accuracy, and feasibility of each method\nwill be compared. The evaluation will involve a Matlab-based locking algorithm,\nand a proposed hardware implementation using Raspberry pi for speaker\ndifferentiation. The experiment includes six individuals uttering the phrase\n\"The University of Mississippi,\" with one person acting as the reference or\n\"lock\" speaker. The number of epochs occurring at similar positions to the\nreference speaker will be counted as Delta, with larger Delta values indicating\ngreater speaker similarity. Experimental results demonstrate that when the\nspeaker remains the same, the average number of Delta is 7.5, while for\ndifferent speakers, the average number of Delta decreases to 3, 2, 2, and 1,\nrespectively, representing a decrease of approximately 73% in the number of\nepochs at similar positions compared to the reference speaker.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}