{"id":"2407.01458","title":"Contractual Reinforcement Learning: Pulling Arms with Invisible Hands","authors":"Jibang Wu, Siyu Chen, Mengdi Wang, Huazheng Wang, Haifeng Xu","authorsParsed":[["Wu","Jibang",""],["Chen","Siyu",""],["Wang","Mengdi",""],["Wang","Huazheng",""],["Xu","Haifeng",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 16:53:00 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 15:17:50 GMT"}],"updateDate":"2024-07-03","timestamp":1719852780000,"abstract":"  The agency problem emerges in today's large scale machine learning tasks,\nwhere the learners are unable to direct content creation or enforce data\ncollection. In this work, we propose a theoretical framework for aligning\neconomic interests of different stakeholders in the online learning problems\nthrough contract design. The problem, termed \\emph{contractual reinforcement\nlearning}, naturally arises from the classic model of Markov decision\nprocesses, where a learning principal seeks to optimally influence the agent's\naction policy for their common interests through a set of payment rules\ncontingent on the realization of next state. For the planning problem, we\ndesign an efficient dynamic programming algorithm to determine the optimal\ncontracts against the far-sighted agent. For the learning problem, we introduce\na generic design of no-regret learning algorithms to untangle the challenges\nfrom robust design of contracts to the balance of exploration and exploitation,\nreducing the complexity analysis to the construction of efficient search\nalgorithms. For several natural classes of problems, we design tailored search\nalgorithms that provably achieve $\\tilde{O}(\\sqrt{T})$ regret. We also present\nan algorithm with $\\tilde{O}(T^{2/3})$ for the general problem that improves\nthe existing analysis in online contract design with mild technical\nassumptions.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Science and Game Theory","Economics/Theoretical Economics"],"license":"http://creativecommons.org/licenses/by/4.0/"}