{"id":"2407.15254","title":"Does EDPVR Represent Myocardial Tissue Stiffness? Toward a Better\n  Definition","authors":"Rana Raza Mehdi, Emilio A. Mendiola, Vahid Naeini, Gaurav Choudhary,\n  and Reza Avazmohammadi","authorsParsed":[["Mehdi","Rana Raza",""],["Mendiola","Emilio A.",""],["Naeini","Vahid",""],["Choudhary","Gaurav",""],["Avazmohammadi","Reza",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 19:54:45 GMT"}],"updateDate":"2024-07-23","timestamp":1721591685000,"abstract":"  Accurate assessment of myocardial tissue stiffness is pivotal for the\ndiagnosis and prognosis of heart diseases. Left ventricular diastolic stiffness\n($\\beta$) obtained from the end-diastolic pressure-volume relationship (EDPVR)\nhas conventionally been utilized as a representative metric of myocardial\nstiffness. The EDPVR can be employed to estimate the intrinsic stiffness of\nmyocardial tissues through image-based in-silico inverse optimization. However,\nwhether $\\beta$, as an organ-level metric, accurately represents the\ntissue-level myocardial tissue stiffness in healthy and diseased myocardium\nremains elusive. We developed a modeling-based approach utilizing a\ntwo-parameter material model for the myocardium (denoted by $a_f$ and $b_f$) in\nimage-based in-silico biventricular heart models to generate EDPVRs for\ndifferent material parameters. Our results indicated a variable relationship\nbetween $\\beta$ and the material parameters depending on the range of the\nparameters. Interestingly, $\\beta$ showed a very low sensitivity to $a_f$, once\naveraged across several LV geometries, and even a negative correlation with\n$a_f$ for small values of $a_f$. These findings call for a critical assessment\nof the reliability and confoundedness of EDPVR-derived metrics to represent\ntissue-level myocardial stiffness. Our results also underscore the necessity to\nexplore image-based in-silico frameworks, promising to provide a high-fidelity\nand potentially non-invasive assessment of myocardial stiffness.\n","subjects":["Physics/Medical Physics","Quantitative Biology/Tissues and Organs"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"nypN1H9VgQRm_5kyb72aKZhy4xeZcUtDhomX62RClXg","pdfSize":"4320055","objectId":"0xf0b67c98d30445c47b734acb1aef2f9ba2edc175fe800c375cc3f575605a7536","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
