{"id":"2407.04094","title":"Multi-wavelength properties of three new radio-powerful $z\\sim5.6$ QSOs\n  discovered from RACS","authors":"L. Ighina, A. Caccianiga, A. Moretti, J. W. Broderick, J. K. Leung, A.\n  R. L\\'opez-S\\'anchez, F. Rigamonti, N. Seymour, T. An, S. Belladitta, S.\n  Bisogni, R. Della Ceca, G. Drouart, A. Gargiulo, Y. Liu","authorsParsed":[["Ighina","L.",""],["Caccianiga","A.",""],["Moretti","A.",""],["Broderick","J. W.",""],["Leung","J. K.",""],["López-Sánchez","A. R.",""],["Rigamonti","F.",""],["Seymour","N.",""],["An","T.",""],["Belladitta","S.",""],["Bisogni","S.",""],["Della Ceca","R.",""],["Drouart","G.",""],["Gargiulo","A.",""],["Liu","Y.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-08","timestamp":1720116000000,"abstract":"  We present a multi-wavelength study on three new $z\\sim5.6$ quasi stellar\nobjects (QSOs) selected based on their radio and optical/near-infrared\nproperties in publicly available surveys and then identified with dedicated\nspectroscopic observations. These are among the radio-brightest QSOs currently\nknown at $z>5.5$, having $\\rm R=S_{\\rm 5GHz}/S_{\\rm 4400A}>100$. In this work\nwe present their identification and we also discuss their multi-wavelength\nproperties (from the radio to the X-ray band) based on the detection in public\nsurveys as well as dedicated radio and X-ray observations. The three sources\npresent a wide range of properties, in terms of relative intensity and spectral\nshape, highlighting the importance of multi-wavelength observations in order to\naccurately characterise these high-$z$ objects. In particular, from our\nanalysis we found one source, at $z=5.61$, that presents clear blazars\nproperties (strong and flat radio and X-ray emission), making it one of the\nmost distant currently known in this class. Moreover, from the fit of the\noptical/near-infrared photometric measurements with an accretion disc model, as\nwell as the analysis of the CIV broad emission line in one case, we were able\nto estimate the mass and the accretion rate of the central black holes in these\nsystems, finding $\\rm M_{\\rm BH}\\sim1-10\\times10^9$ M$_\\odot$ accreting at a\nrate $\\lambda_{\\rm Edd}\\sim0.1-0.2$. With this work we increase the number of\nvery-high redshift radio-powerful QSOs characterised with multi-wavelength\nobservations, essential in order to understand the evolution and the properties\nof this still poorly constrained class of sources.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uxRtsAmPaKU5_30tlBk4goxXFgofd4KFhTSD0gxWu4M","pdfSize":"985437"}
