{"id":"2407.01024","title":"Unveiling frequency-dependent eclipsing in spider millisecond pulsars\n  using broadband polarization observations with the Parkes","authors":"Sangita Kumari, Bhaswati Bhattacharyya, Rahul Sharan, Simon Johnston,\n  Patrick Weltevrede, Benjamin Stappers, Devojyoti Kansabanik, Jayanta Roy,\n  Ankita Ghosh","authorsParsed":[["Kumari","Sangita",""],["Bhattacharyya","Bhaswati",""],["Sharan","Rahul",""],["Johnston","Simon",""],["Weltevrede","Patrick",""],["Stappers","Benjamin",""],["Kansabanik","Devojyoti",""],["Roy","Jayanta",""],["Ghosh","Ankita",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 07:15:26 GMT"}],"updateDate":"2024-07-02","timestamp":1719818126000,"abstract":"  This study presents an orbital phase-dependent analysis of three black widow\nspider millisecond pulsars (BW MSPs), aiming to investigate the magnetic field\nwithin the eclipse environment. The ultra-wide-bandwidth low-frequency receiver\n(UWL) of the Parkes 'Murriyang' radio telescope is utilised for full\npolarisation observations covering frequencies from 704-4032 MHz.\nDepolarisation of pulsed emission is observed during the eclipse phase of three\nBW MSPs namely, J0024-7204J, J1431-4715 and PSR J1959+2048, consistent with\nprevious studies of other BW MSPs. We estimated orbital phase dependent RM\nvalues for these MSPs. The wide bandwidth observations also provided the\nconstraints on eclipse cutoff frequency for these BW MSPs. For PSR J0024-7204J,\nwe report temporal variation of the eclipse cutoff frequency coupled with\nchanges in the electron column density within the eclipse medium across six\nobserved eclipses. Moreover, the eclipse cutoff frequency for PSR J1431-4715 is\ndetermined to be 1251 $\\pm$ 80 MHz, leading to the conclusion that synchrotron\nabsorption is the primary mechanism responsible for the eclipsing.\nAdditionally, for PSR J1959+2048, the estimated cutoff frequency exceeded 1400\nMHz, consistent with previous studies. With this investigation, we have doubled\nthe sample size of BW MSPs with orbital phase-resolved studies allowing a\nbetter probe to the eclipse environment.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}