{"id":"2407.04053","title":"Edge AI: A Taxonomy, Systematic Review and Future Directions","authors":"Sukhpal Singh Gill, Muhammed Golec, Jianmin Hu, Minxian Xu, Junhui Du,\n  Huaming Wu, Guneet Kaur Walia, Subramaniam Subramanian Murugesan, Babar Ali,\n  Mohit Kumar, Kejiang Ye, Prabal Verma, Surendra Kumar, Felix Cuadrado, Steve\n  Uhlig","authorsParsed":[["Gill","Sukhpal Singh",""],["Golec","Muhammed",""],["Hu","Jianmin",""],["Xu","Minxian",""],["Du","Junhui",""],["Wu","Huaming",""],["Walia","Guneet Kaur",""],["Murugesan","Subramaniam Subramanian",""],["Ali","Babar",""],["Kumar","Mohit",""],["Ye","Kejiang",""],["Verma","Prabal",""],["Kumar","Surendra",""],["Cuadrado","Felix",""],["Uhlig","Steve",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 16:51:17 GMT"}],"updateDate":"2024-07-08","timestamp":1720111877000,"abstract":"  Edge Artificial Intelligence (AI) incorporates a network of interconnected\nsystems and devices that receive, cache, process, and analyse data in close\ncommunication with the location where the data is captured with AI technology.\nRecent advancements in AI efficiency, the widespread use of Internet of Things\n(IoT) devices, and the emergence of edge computing have unlocked the enormous\nscope of Edge AI. The goal of Edge AI is to optimize data processing efficiency\nand velocity while ensuring data confidentiality and integrity. Despite being a\nrelatively new field of research, spanning from 2014 to the present, it has\nshown significant and rapid development over the last five years. In this\narticle, we present a systematic literature review for Edge AI to discuss the\nexisting research, recent advancements, and future research directions. We\ncreated a collaborative edge AI learning system for cloud and edge computing\nanalysis, including an in-depth study of the architectures that facilitate this\nmechanism. The taxonomy for Edge AI facilitates the classification and\nconfiguration of Edge AI systems while also examining its potential influence\nacross many fields through compassing infrastructure, cloud computing, fog\ncomputing, services, use cases, ML and deep learning, and resource management.\nThis study highlights the significance of Edge AI in processing real-time data\nat the edge of the network. Additionally, it emphasizes the research challenges\nencountered by Edge AI systems, including constraints on resources,\nvulnerabilities to security threats, and problems with scalability. Finally,\nthis study highlights the potential future research directions that aim to\naddress the current limitations of Edge AI by providing innovative solutions.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/"}