{"id":"2407.16396","title":"Learning Unsigned Distance Functions from Multi-view Images with Volume\n  Rendering Priors","authors":"Wenyuan Zhang, Kanle Shi, Yu-Shen Liu, Zhizhong Han","authorsParsed":[["Zhang","Wenyuan",""],["Shi","Kanle",""],["Liu","Yu-Shen",""],["Han","Zhizhong",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 11:35:33 GMT"}],"updateDate":"2024-07-24","timestamp":1721734533000,"abstract":"  Unsigned distance functions (UDFs) have been a vital representation for open\nsurfaces. With different differentiable renderers, current methods are able to\ntrain neural networks to infer a UDF by minimizing the rendering errors on the\nUDF to the multi-view ground truth. However, these differentiable renderers are\nmainly handcrafted, which makes them either biased on ray-surface\nintersections, or sensitive to unsigned distance outliers, or not scalable to\nlarge scale scenes. To resolve these issues, we present a novel differentiable\nrenderer to infer UDFs more accurately. Instead of using handcrafted equations,\nour differentiable renderer is a neural network which is pre-trained in a\ndata-driven manner. It learns how to render unsigned distances into depth\nimages, leading to a prior knowledge, dubbed volume rendering priors. To infer\na UDF for an unseen scene from multiple RGB images, we generalize the learned\nvolume rendering priors to map inferred unsigned distances in alpha blending\nfor RGB image rendering. Our results show that the learned volume rendering\npriors are unbiased, robust, scalable, 3D aware, and more importantly, easy to\nlearn. We evaluate our method on both widely used benchmarks and real scenes,\nand report superior performance over the state-of-the-art methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"g-aaj3gVFYRhXzUSekPx2pw5_ftDNTMdJQtEOPj_wMw","pdfSize":"11931549","objectId":"0x3e08fc50d8935f7faf92a3cf44f26931880812a0c006aed593e8f01f041b420c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
