{"id":"2407.12105","title":"AeroHaptix: A Wearable Vibrotactile Feedback System for Enhancing\n  Collision Avoidance in UAV Teleoperation","authors":"Bingjian Huang, Zhecheng Wang, Qilong Cheng, Siyi Ren, Hanfeng Cai,\n  Antonio Alvarez Valdivia, Karthik Mahadevan, Daniel Wigdor","authorsParsed":[["Huang","Bingjian",""],["Wang","Zhecheng",""],["Cheng","Qilong",""],["Ren","Siyi",""],["Cai","Hanfeng",""],["Valdivia","Antonio Alvarez",""],["Mahadevan","Karthik",""],["Wigdor","Daniel",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 18:23:10 GMT"}],"updateDate":"2024-07-18","timestamp":1721154190000,"abstract":"  Haptic feedback enhances collision avoidance by providing directional\nobstacle information to operators in unmanned aerial vehicle (UAV)\nteleoperation. However, such feedback is often rendered via haptic joysticks,\nwhich are unfamiliar to UAV operators and limited to single-directional force\nfeedback. Additionally, the direct coupling of the input device and the\nfeedback method diminishes the operators' control authority and causes\noscillatory movements. To overcome these limitations, we propose AeroHaptix, a\nwearable haptic feedback system that uses high-resolution vibrations to\ncommunicate multiple obstacle directions simultaneously. The vibrotactile\nactuators' layout was optimized based on a perceptual study to eliminate\nperceptual biases and achieve uniform spatial coverage. A novel rendering\nalgorithm, MultiCBF, was adapted from control barrier functions to support\nmulti-directional feedback. System evaluation showed that AeroHaptix\neffectively reduced collisions in complex environment, and operators reported\nsignificantly lower physical workload, improved situational awareness, and\nincreased control authority.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"s8BUuJJZeUE8FjV5YoEYyfGa17c5s7J67d4jqKR7hEE","pdfSize":"5469308"}
