{"id":"2407.08166","title":"Synthetic Electroretinogram Signal Generation Using Conditional\n  Generative Adversarial Network for Enhancing Classification of Autism\n  Spectrum Disorder","authors":"Mikhail Kulyabin, Paul A. Constable, Aleksei Zhdanov, Irene O. Lee,\n  David H. Skuse, Dorothy A. Thompson, and Andreas Maier","authorsParsed":[["Kulyabin","Mikhail",""],["Constable","Paul A.",""],["Zhdanov","Aleksei",""],["Lee","Irene O.",""],["Skuse","David H.",""],["Thompson","Dorothy A.",""],["Maier","Andreas",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 04:11:52 GMT"}],"updateDate":"2024-07-12","timestamp":1720671112000,"abstract":"  The electroretinogram (ERG) is a clinical test that records the retina's\nelectrical response to light. The ERG is a promising way to study different\nneurodevelopmental and neurodegenerative disorders, including autism spectrum\ndisorder (ASD) - a neurodevelopmental condition that impacts language,\ncommunication, and reciprocal social interactions. However, in heterogeneous\npopulations, such as ASD, where the ability to collect large datasets is\nlimited, the application of artificial intelligence (AI) is complicated.\nSynthetic ERG signals generated from real ERG recordings carry similar\ninformation as natural ERGs and, therefore, could be used as an extension for\nnatural data to increase datasets so that AI applications can be fully\nutilized. As proof of principle, this study presents a Generative Adversarial\nNetwork capable of generating synthetic ERG signals of children with ASD and\ntypically developing control individuals. We applied a Time Series Transformer\nand Visual Transformer with Continuous Wavelet Transform to enhance\nclassification results on the extended synthetic signals dataset. This approach\nmay support classification models in related psychiatric conditions where the\nERG may help classify disorders.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Jh689ovw_jvGIkxPEYNeFpqWFiKAs-hRfnBzypS67Es","pdfSize":"9310078","objectId":"0xaefd3d8e5ec8db8520dbb8e9ad5ffb0990a289d69009384d8e00d27baff2b1fb","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
