{"id":"2407.14011","title":"Segmentation of Brain Metastases in MRI: A Two-Stage Deep Learning\n  Approach with Modality Impact Study","authors":"Yousef Sadegheih and Dorit Merhof","authorsParsed":[["Sadegheih","Yousef",""],["Merhof","Dorit",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 03:51:38 GMT"}],"updateDate":"2024-07-22","timestamp":1721361098000,"abstract":"  Brain metastasis segmentation poses a significant challenge in medical\nimaging due to the complex presentation and variability in size and location of\nmetastases. In this study, we first investigate the impact of different imaging\nmodalities on segmentation performance using a 3D U-Net. Through a\ncomprehensive analysis, we determine that combining all available modalities\ndoes not necessarily enhance performance. Instead, the combination of\nT1-weighted with contrast enhancement (T1c), T1-weighted (T1), and FLAIR\nmodalities yields superior results. Building on these findings, we propose a\ntwo-stage detection and segmentation model specifically designed to accurately\nsegment brain metastases. Our approach demonstrates that leveraging three key\nmodalities (T1c, T1, and FLAIR) achieves significantly higher accuracy compared\nto single-pass deep learning models. This targeted combination allows for\nprecise segmentation, capturing even small metastases that other models often\nmiss. Our model sets a new benchmark in brain metastasis segmentation,\nhighlighting the importance of strategic modality selection and multi-stage\nprocessing in medical imaging. Our implementation is freely accessible to the\nresearch community on \\href{https://github.com/xmindflow/Met-Seg}{GitHub}.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CZGdwDaVdqTH7UIYreIFCQupC276it05TIYY1hqxdhQ","pdfSize":"1801104","objectId":"0xe2c97dfd962962e901602abc9dd3eee1ace8c2ac132aad4f9c65d4f9b5dbc3d6","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
