{"id":"2407.13895","title":"Improving Robustness and Clinical Applicability of Respiratory Sound\n  Classification via Audio Enhancement","authors":"Jing-Tong Tzeng, Jeng-Lin Li, Huan-Yu Chen, Chun-Hsiang Huang,\n  Chi-Hsin Chen, Cheng-Yi Fan, Edward Pei-Chuan Huang, Chi-Chun Lee","authorsParsed":[["Tzeng","Jing-Tong",""],["Li","Jeng-Lin",""],["Chen","Huan-Yu",""],["Huang","Chun-Hsiang",""],["Chen","Chi-Hsin",""],["Fan","Cheng-Yi",""],["Huang","Edward Pei-Chuan",""],["Lee","Chi-Chun",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 20:48:33 GMT"}],"updateDate":"2024-07-22","timestamp":1721335713000,"abstract":"  Deep learning techniques have shown promising results in the automatic\nclassification of respiratory sounds. However, accurately distinguishing these\nsounds in real-world noisy conditions poses challenges for clinical deployment.\nAdditionally, predicting signals with only background noise could undermine\nuser trust in the system. In this study, we propose an audio enhancement (AE)\npipeline as a pre-processing step before respiratory sound classification,\naiming to improve performance in noisy environments. Multiple experiments were\nconducted using different audio enhancement model structures, demonstrating\nimproved classification performance compared to the baseline method of noise\ninjection data augmentation. Specifically, the integration of the AE pipeline\nresulted in a 2.59% increase in the ICBHI classification score on the ICBHI\nrespiratory sound dataset and a 2.51% improvement on our recently collected\nFormosa Archive of Breath Sounds (FABS) in multi-class noisy scenarios.\nFurthermore, a physician validation study assessed the clinical utility of our\nsystem. Quantitative analysis revealed enhancements in efficiency, diagnostic\nconfidence, and trust during model-assisted diagnosis with our system compared\nto raw noisy recordings. Workflows integrating enhanced audio led to an 11.61%\nincrease in diagnostic sensitivity and facilitated high-confidence diagnoses.\nOur findings demonstrate that incorporating an audio enhancement algorithm\nsignificantly enhances robustness and clinical utility.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}