{"id":"2407.17913","title":"Extracting the symmetries of nonequilibrium quantum many-body systems","authors":"Aleksandr N. Mikheev, Viktoria Noel, Ido Siovitz, Helmut Strobel,\n  Markus K. Oberthaler, J\\\"urgen Berges","authorsParsed":[["Mikheev","Aleksandr N.",""],["Noel","Viktoria",""],["Siovitz","Ido",""],["Strobel","Helmut",""],["Oberthaler","Markus K.",""],["Berges","Jürgen",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 10:07:48 GMT"}],"updateDate":"2024-07-26","timestamp":1721902068000,"abstract":"  Symmetries play a pivotal role in our understanding of the properties of\nquantum many-body systems. While there are theorems and a well-established\ntoolbox for systems in thermal equilibrium, much less is known about the role\nof symmetries and their connection to dynamics out of equilibrium. This arises\ndue to the direct link between a system's thermal state and its Hamiltonian,\nwhich is generally not the case for nonequilibrium dynamics. Here we present a\npathway to identify the effective symmetries and to extract them from data in\nnonequilibrium quantum many-body systems. Our approach is based on exact\nrelations between correlation functions involving different numbers of spatial\npoints, which can be viewed as nonequilibrium versions of (equal-time) Ward\nidentities encoding the symmetries of the system. We derive symmetry witnesses,\nwhich are particularly suitable for the analysis of measured or simulated data\nat different snapshots in time. To demonstrate the potential of the approach,\nwe apply our method to numerical and experimental data for a spinor Bose gas.\nWe investigate the important question of a dynamical restoration of an\nexplicitly broken symmetry of the Hamiltonian by the initial state. Remarkably,\nit is found that effective symmetry restoration can occur long before the\nsystem equilibrates. We also use the approach to define and identify\nspontaneous symmetry breaking far from equilibrium, which is of great relevance\nfor applications to nonequilibrium phase transitions. Our work opens new\navenues for the classification and analysis of quantum as well as classical\nmany-body dynamics in a large variety of systems, ranging from ultracold\nquantum gases to cosmology.\n","subjects":["Condensed Matter/Quantum Gases","Condensed Matter/Statistical Mechanics","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}