{"id":"2407.16715","title":"Research on Adverse Drug Reaction Prediction Model Combining Knowledge\n  Graph Embedding and Deep Learning","authors":"Yufeng Li, Wenchao Zhao, Bo Dang, Xu Yan, Weimin Wang, Min Gao,\n  Mingxuan Xiao","authorsParsed":[["Li","Yufeng",""],["Zhao","Wenchao",""],["Dang","Bo",""],["Yan","Xu",""],["Wang","Weimin",""],["Gao","Min",""],["Xiao","Mingxuan",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 03:25:55 GMT"},{"version":"v2","created":"Sat, 27 Jul 2024 15:09:51 GMT"}],"updateDate":"2024-07-30","timestamp":1721705155000,"abstract":"  In clinical treatment, identifying potential adverse reactions of drugs can\nhelp assist doctors in making medication decisions. In response to the problems\nin previous studies that features are high-dimensional and sparse, independent\nprediction models need to be constructed for each adverse reaction of drugs,\nand the prediction accuracy is low, this paper develops an adverse drug\nreaction prediction model based on knowledge graph embedding and deep learning,\nwhich can predict experimental results. Unified prediction of adverse drug\nreactions covered. Knowledge graph embedding technology can fuse the associated\ninformation between drugs and alleviate the shortcomings of high-dimensional\nsparsity in feature matrices, and the efficient training capabilities of deep\nlearning can improve the prediction accuracy of the model. This article builds\nan adverse drug reaction knowledge graph based on drug feature data; by\nanalyzing the embedding effect of the knowledge graph under different embedding\nstrategies, the best embedding strategy is selected to obtain sample vectors;\nand then a convolutional neural network model is constructed to predict adverse\nreactions. The results show that under the DistMult embedding model and\n400-dimensional embedding strategy, the convolutional neural network model has\nthe best prediction effect; the average accuracy, F_1 score, recall rate and\narea under the curve of repeated experiments are better than the methods\nreported in the literature. The obtained prediction model has good prediction\naccuracy and stability, and can provide an effective reference for later safe\nmedication guidance.\n","subjects":["Quantitative Biology/Quantitative Methods","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}