{"id":"2407.08522","title":"Gaia DR3 asteroid reflectance spectra: L-type families, memberships, and\n  ages","authors":"Roberto Balossi, Paolo Tanga, Alexey Sergeyev, Alberto Cellino and\n  Federica Spoto","authorsParsed":[["Balossi","Roberto",""],["Tanga","Paolo",""],["Sergeyev","Alexey",""],["Cellino","Alberto",""],["Spoto","Federica",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:10:03 GMT"}],"updateDate":"2024-08-28","timestamp":1720707003000,"abstract":"  The Gaia Data Release 3 (DR3) contains reflectance spectra at visible\nwavelengths for 60,518 asteroids over the range between 374-1034 nm,\nrepresenting a large sample that is well suited to studies of asteroid\nfamilies. We want to assess the potential of Gaia spectra in identifying\nasteroid family members. Here, we focus on two L-type families, namely\nTirela/Klumpkea and Watsonia. These families are known for their connection to\nBarbarian asteroids, which are potentially abundant in calcium-aluminum rich\ninclusions (CAIs). Our method is based (1) on a color taxonomy specifically\nbuilt on Gaia data and (2) the similarity of spectra of candidate members with\nthe template spectrum of a specific family. We identified objects in the halo\nof Tirela/Klumpkea, along with possible interlopers. We also found an\nindependent group of eight asteroids erroneously linked to the family by the\nhierarchical clustering method (HCM). Consequently, the knowledge of the size\ndistribution of the family has been significantly improved, with a more\nconsistent shape at the larger end. The Watsonia family is a more intricate\ncase, mainly due to its smaller size and the less marked difference between the\nspectral types of the background and of the family members. However, the\nspectral selection helps identify objects that were not seen by HCM, including\na cluster separated from the family core by a resonance. For both families, the\nV-shape is better defined, leading to a revised age estimation based on the\nmemberships established mainly from spectral properties. Our work demonstrates\nthe advantage of combining the classical HCM approach to spectral properties\nobtained by Gaia for the study of asteroid families. Future data releases are\nexpected to further expand the capabilities in this domain\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JA7og3Skhm28fcLx8ZG5-o1wimBRkeOnO3-Pj94p6pA","pdfSize":"4107276"}
