{"id":"2407.08101","title":"Live Fitness Coaching as a Testbed for Situated Interaction","authors":"Sunny Panchal, Apratim Bhattacharyya, Guillaume Berger, Antoine\n  Mercier, Cornelius Bohm, Florian Dietrichkeit, Reza Pourreza, Xuanlin Li,\n  Pulkit Madan, Mingu Lee, Mark Todorovich, Ingo Bax, Roland Memisevic","authorsParsed":[["Panchal","Sunny",""],["Bhattacharyya","Apratim",""],["Berger","Guillaume",""],["Mercier","Antoine",""],["Bohm","Cornelius",""],["Dietrichkeit","Florian",""],["Pourreza","Reza",""],["Li","Xuanlin",""],["Madan","Pulkit",""],["Lee","Mingu",""],["Todorovich","Mark",""],["Bax","Ingo",""],["Memisevic","Roland",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 00:10:45 GMT"}],"updateDate":"2024-07-12","timestamp":1720656645000,"abstract":"  Tasks at the intersection of vision and language have had a profound impact\nin advancing the capabilities of vision-language models such as dialog-based\nassistants. However, models trained on existing tasks are largely limited to\nturn-based interactions, where each turn must be stepped (i.e., prompted) by\nthe user. Open-ended, asynchronous interactions where an AI model may\nproactively deliver timely responses or feedback based on the unfolding\nsituation in real-time are an open challenge. In this work, we present the QEVD\nbenchmark and dataset which explores human-AI interaction in the challenging,\nyet controlled, real-world domain of fitness coaching - a task which\nintrinsically requires monitoring live user activity and providing timely\nfeedback. It is the first benchmark that requires assistive vision-language\nmodels to recognize complex human actions, identify mistakes grounded in those\nactions, and provide appropriate feedback. Our experiments reveal the\nlimitations of existing state of the art vision-language models for such\nasynchronous situated interactions. Motivated by this, we propose a simple\nend-to-end streaming baseline that can respond asynchronously to human actions\nwith appropriate feedbacks at the appropriate time.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"b7tXD5ZEd6PGgLUu08Z-cbHwZrfdzQMtE_EEUlEY_6s","pdfSize":"6994798","objectId":"0x735ad098c448c6ebde7947641358fd4b9a2ba1011c0b15ac9819e70f395e8807","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
