{"id":"2407.12226","title":"Individualized Federated Learning for Traffic Prediction with Error\n  Driven Aggregation","authors":"Hang Chen, Collin Meese, Mark Nejad, Chien-Chung Shen","authorsParsed":[["Chen","Hang",""],["Meese","Collin",""],["Nejad","Mark",""],["Shen","Chien-Chung",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 00:42:47 GMT"}],"updateDate":"2024-07-18","timestamp":1721176967000,"abstract":"  Low-latency traffic prediction is vital for smart city traffic management.\nFederated Learning has emerged as a promising technique for Traffic Prediction\n(FLTP), offering several advantages such as privacy preservation, reduced\ncommunication overhead, improved prediction accuracy, and enhanced adaptability\nto changing traffic conditions. However, majority of the current FLTP\nframeworks lack a real-time model updating scheme, which hinders their ability\nto continuously incorporate new incoming traffic data and adapt effectively to\nthe changing dynamics of traffic trends. Another concern with the existing FLTP\nframeworks is their reliance on the conventional FL model aggregation method,\nwhich involves assigning an identical model (i.e., the global model) to all\ntraffic monitoring devices to predict their individual local traffic trends,\nthereby neglecting the non-IID characteristics of traffic data collected in\ndifferent locations. Building upon these findings and harnessing insights from\nreinforcement learning, we propose NeighborFL, an individualized real-time\nfederated learning scheme that introduces a haversine distance-based and\nerror-driven, personalized local models grouping heuristic from the perspective\nof each individual traffic node. This approach allows NeighborFL to create\nlocation-aware and tailored prediction models for each client while fostering\ncollaborative learning. Simulations demonstrate the effectiveness of\nNeighborFL, offering improved real-time prediction accuracy over three baseline\nmodels, with one experimental setting showing a 16.9% reduction in MSE value\ncompared to a naive FL setting.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}