{"id":"2407.15901","title":"Enhancing Cognitive Workload Classification Using Integrated LSTM Layers\n  and CNNs for fNIRS Data Analysis","authors":"Mehshan Ahmed Khan, Houshyar Asadi, Mohammad Reza Chalak Qazani,\n  Adetokunbo Arogbonlo, Siamak Pedrammehr, Adnan Anwar, Asim Bhatti, Saeid\n  Nahavandi, Chee Peng Lim","authorsParsed":[["Khan","Mehshan Ahmed",""],["Asadi","Houshyar",""],["Qazani","Mohammad Reza Chalak",""],["Arogbonlo","Adetokunbo",""],["Pedrammehr","Siamak",""],["Anwar","Adnan",""],["Bhatti","Asim",""],["Nahavandi","Saeid",""],["Lim","Chee Peng",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 11:28:34 GMT"}],"updateDate":"2024-07-24","timestamp":1721647714000,"abstract":"  Functional near-infrared spectroscopy (fNIRS) is employed as a non-invasive\nmethod to monitor functional brain activation by capturing changes in the\nconcentrations of oxygenated haemoglobin (HbO) and deoxygenated haemo-globin\n(HbR). Various machine learning classification techniques have been utilized to\ndistinguish cognitive states. However, conventional machine learning methods,\nalthough simpler to implement, undergo a complex pre-processing phase before\nnetwork training and demonstrate reduced accuracy due to inadequate data\npreprocessing. Additionally, previous research in cog-nitive load assessment\nusing fNIRS has predominantly focused on differ-sizeentiating between two\nlevels of mental workload. These studies mainly aim to classify low and high\nlevels of cognitive load or distinguish between easy and difficult tasks. To\naddress these limitations associated with conven-tional methods, this paper\nconducts a comprehensive exploration of the im-pact of Long Short-Term Memory\n(LSTM) layers on the effectiveness of Convolutional Neural Networks (CNNs)\nwithin deep learning models. This is to address the issues related to spatial\nfeatures overfitting and lack of tem-poral dependencies in CNN in the previous\nstudies. By integrating LSTM layers, the model can capture temporal\ndependencies in the fNIRS data, al-lowing for a more comprehensive\nunderstanding of cognitive states. The primary objective is to assess how\nincorporating LSTM layers enhances the performance of CNNs. The experimental\nresults presented in this paper demonstrate that the integration of LSTM layers\nwith Convolutional layers results in an increase in the accuracy of deep\nlearning models from 97.40% to 97.92%.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}