{"id":"2407.00882","title":"Subgroup Identification with Latent Factor Structure","authors":"Yong He and Dong Liu and Fuxin Wang and Mingjuan Zhang and Wen-Xin\n  Zhou","authorsParsed":[["He","Yong",""],["Liu","Dong",""],["Wang","Fuxin",""],["Zhang","Mingjuan",""],["Zhou","Wen-Xin",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 01:07:12 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 07:22:59 GMT"}],"updateDate":"2024-07-18","timestamp":1719796032000,"abstract":"  Subgroup analysis has garnered increasing attention for its ability to\nidentify meaningful subgroups within heterogeneous populations, thereby\nenhancing predictive power. However, in many fields such as social science and\nbiology, covariates are often highly correlated due to common factors. This\ncorrelation poses significant challenges for subgroup identification, an issue\nthat is often overlooked in existing literature. In this paper, we aim to\naddress this gap in the ``diverging dimension\" regime by proposing a\ncenter-augmented subgroup identification method within the Factor Augmented\n(sparse) Linear Model framework. This method bridges dimension reduction and\nsparse regression. Our proposed approach is adaptable to the high\ncross-sectional dependence among covariates and offers computational advantages\nwith a complexity of $O(nK)$, compared to the $O(n^2)$ complexity of the\nconventional pairwise fusion penalty method in the literature, where $n$ is the\nsample size and $K$ is the number of subgroups. We also investigate the\nasymptotic properties of the oracle estimators under conditions on the minimal\ndistance between group centroids. To implement the proposed approach, we\nintroduce a Difference of Convex functions-based Alternating Direction Method\nof Multipliers (DC-ADMM) algorithm and demonstrate its convergence to a local\nminimizer in a finite number of steps. We illustrate the superiority of the\nproposed method through extensive numerical experiments and a real\nmacroeconomic data example. An \\texttt{R} package, \\texttt{SILFS}, implementing\nthe method is also available on CRAN.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}