{"id":"2407.14213","title":"Higher-order triadic percolation on random hypergraphs","authors":"Hanlin Sun, Ginestra Bianconi","authorsParsed":[["Sun","Hanlin",""],["Bianconi","Ginestra",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 11:19:13 GMT"}],"updateDate":"2024-07-22","timestamp":1721387953000,"abstract":"  In this work, we propose a comprehensive theoretical framework combining\npercolation theory with nonlinear dynamics in order to study hypergraphs with a\ntime-varying giant component. We consider in particular hypergraphs with\nhigher-order triadic interactions that can upregulate or downregulate the\nhyperedges. Triadic interactions are a general type of signed regulatory\ninteraction that occurs when a third node regulates the interaction between two\nother nodes. For example, in brain networks, the glia can facilitate or inhibit\nsynaptic interactions between neurons. However, the regulatory interactions may\nnot only occur between regulator nodes and pairwise interactions but also\nbetween regulator nodes and higher-order interactions (hyperedges), leading to\nhigher-order triadic interactions. For instance, in biochemical reaction\nnetworks, the enzymes regulate the reactions involving multiple reactants. Here\nwe propose and investigate higher-order triadic percolation on hypergraphs\nshowing that the giant component can have a non-trivial dynamics. Specifically,\nwe demonstrate that, under suitable conditions, the order parameter of this\npercolation problem, i.e., the fraction of nodes in the giant component,\nundergoes a route to chaos in the universality class of the logistic map. In\nhierarchical higher-order triadic percolation, we extend this paradigm in order\nto treat hierarchically nested triadic interactions demonstrating the\nnon-trivial effect of their increased combinatorial complexity on the critical\nphenomena and the dynamical properties of the process. Finally, we consider\nother generalizations of the model studying the effect of considering\ninterdependencies and node regulation instead of hyperedge regulation.\n","subjects":["Nonlinear Sciences/Adaptation and Self-Organizing Systems","Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Statistical Mechanics","Nonlinear Sciences/Chaotic Dynamics","Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}