{"id":"2407.19590","title":"The Future is Meta: Metadata, Formats and Perspectives towards\n  Interactive and Personalized AV Content","authors":"Alexander Weller (1), Werner Bleisteiner (2), Christian Hufnagel (3),\n  Michael Iber (4) ((1) S\\\"udwestrundfunk, Fachhochschule St. P\\\"olten, (2)\n  Bayerischer Rundfunk, (3) S\\\"udwestrundfunk, (4) Fachhochschule St. P\\\"olten)","authorsParsed":[["Weller","Alexander",""],["Bleisteiner","Werner",""],["Hufnagel","Christian",""],["Iber","Michael",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 21:18:30 GMT"}],"updateDate":"2024-07-30","timestamp":1722201510000,"abstract":"  The production of media content has undergone tremendous changes in recent\nyears. Multiple daily content updates are just as common for some platforms as\nis processing the provided content specifically for their target audiences.\nSuch features are made possible through metadata, which make information\naccessible by categorizing it. In conjunction with AI-supported tools, metadata\nare shaping the future of audio-visual content production, distribution and\nconsumption. It allows editors to effectively search through archives like in\nthe Tailored Media Project, broadcasters to provide content that is adapted to\nusers' surroundings like in the ARD Audiothek unterwegs project, or give users\nthe ability to experience audio-visual content from different perspectives like\nin the ORPHEUS project. Although these projects provide comprehensive insight\ninto the potential of metadata, their integration in existing infrastructures\nmeets several limitations. For example, content-related metadata may initially\nbe generated at some point during the production process but will then be lost\nat later stages due to current standards and incomplete software\nimplementations. In our contribution, we will discuss requirements and\npotential approaches and give an outlook on possible fields of application and\nuse-cases.\n","subjects":["Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}