{"id":"2407.08541","title":"Cavity Formation in Silica-Filled Rubber Compounds Observed During\n  Deformation by Ultra Small-Angle X-Ray Scattering","authors":"Ilya Yakovlev (1 and 3), Michael Sztucki (1), Frank Fleck (2), Hossein\n  Ali Karimi-Varzaneh (2), Jorge Lacayo-Pineda (2 and 3), Christoph Vatterott\n  (2), Ulrich Giese (3 and 4) ((1) European Synchrotron Radiation Facility,\n  Grenoble, France, (2) Continental Reifen Deutschland GmbH, Hanover, Germany,\n  (3) Faculty of Natural Sciences, Gottfried Wilhelm Leibniz University\n  Hannover, Hanover, Germany, (4) Deutsches Institut f\\\"ur Kautschuktechnologie\n  e. V., Hanover, Germany)","authorsParsed":[["Yakovlev","Ilya","","1 and 3"],["Sztucki","Michael","","2 and 3"],["Fleck","Frank","","2 and 3"],["Karimi-Varzaneh","Hossein Ali","","2 and 3"],["Lacayo-Pineda","Jorge","","2 and 3"],["Vatterott","Christoph","","3 and 4"],["Giese","Ulrich","","3 and 4"]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:29:20 GMT"}],"updateDate":"2024-07-12","timestamp":1720708160000,"abstract":"  When silica-filled rubber compounds are deformed, structural modifications in\nthe material's bulk lead to irreversible damage, the most significant of which\nis cavitation appearing within the interfaces of interconnected polymer and\nfiller networks. This work introduces a new method to analyze cavitation in\nindustrial-grade rubbers based on Ultra Small-Angle X-ray Scattering. This\nmethod employs a specially designed multi-sample stretching device for\nhigh-throughput measurements with statistical relevance. The proposed data\nreduction approach allows for early detection and quantification of cavitation\nwhile providing at the same time information on the hierarchical filler\nstructures at length scales ranging from the primary particle size to large\nsilica agglomerates over four orders of magnitude. To validate the method, the\nscattering of SSBR rubber compounds filled with highly dispersible silica at\ndifferent ratios was measured under quasi-static strain. The strain was applied\nin incremental steps up to a maximum achievable elongation or breakage of the\nsample. From the measurements performed in multiple repetitions, it was found\nthat the minimum strain necessary for cavity formation and the size evolution\nof the cavities with increasing strain are comparable between these samples.\nThe sample with the highest polymer content showed the lowest rate of cavity\nformation and higher durability of silica structures. The structural stability\nof the compounds was determined by the evolution of the filler hierarchical\nstructures, obtained by fitting data across the available strain range.\n","subjects":["Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"daG1RAQVO0jYvNl1rzWfAL6O8fj0ejYP2kCFmufaNrM","pdfSize":"6556102"}
