{"id":"2407.02821","title":"Effect of a Process Mining based Pre-processing Step in Prediction of\n  the Critical Health Outcomes","authors":"Negin Ashrafi, Armin Abdollahi, Greg Placencia, Maryam Pishgar","authorsParsed":[["Ashrafi","Negin",""],["Abdollahi","Armin",""],["Placencia","Greg",""],["Pishgar","Maryam",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 05:45:09 GMT"}],"updateDate":"2024-07-04","timestamp":1719985509000,"abstract":"  Predicting critical health outcomes such as patient mortality and hospital\nreadmission is essential for improving survivability. However, healthcare\ndatasets have many concurrences that create complexities, leading to poor\npredictions. Consequently, pre-processing the data is crucial to improve its\nquality. In this study, we use an existing pre-processing algorithm,\nconcatenation, to improve data quality by decreasing the complexity of\ndatasets. Sixteen healthcare datasets were extracted from two databases - MIMIC\nIII and University of Illinois Hospital - converted to the event logs, they\nwere then fed into the concatenation algorithm. The pre-processed event logs\nwere then fed to the Split Miner (SM) algorithm to produce a process model.\nProcess model quality was evaluated before and after concatenation using the\nfollowing metrics: fitness, precision, F-Measure, and complexity. The\npre-processed event logs were also used as inputs to the Decay Replay Mining\n(DREAM) algorithm to predict critical outcomes. We compared predicted results\nbefore and after applying the concatenation algorithm using Area Under the\nCurve (AUC) and Confidence Intervals (CI). Results indicated that the\nconcatenation algorithm improved the quality of the process models and\npredictions of the critical health outcomes.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jQXfc_c20VTEZI_SOCrHFrCxBPG81gGQIO5zoBfnedE","pdfSize":"965481"}
