{"id":"2407.08012","title":"Measurement of boosted Higgs bosons produced via vector boson fusion or\n  gluon fusion in the H $\\to$ $\\mathrm{b\\bar{b}}$ decay mode using LHC\n  proton-proton collision data at $\\sqrt{s}$ = 13 TeV","authors":"CMS Collaboration","authorsParsed":[["CMS Collaboration","",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 19:37:47 GMT"}],"updateDate":"2024-07-12","timestamp":1720640267000,"abstract":"  A measurement is performed of Higgs bosons produced with high transverse\nmomentum ($p_\\mathrm{T}$) via vector boson or gluon fusion in proton-proton\ncollisions. The result is based on a data set with a center-of-mass energy of\n13 TeV collected in 2016-2018 with the CMS detector at the LHC and corresponds\nto an integrated luminosity of 138 fb$^{-1}$. The decay of a\nhigh-$p_\\mathrm{T}$ Higgs boson to a boosted bottom quark-antiquark pair is\nselected using large-radius jets and employing jet substructure and\nheavy-flavor taggers based on machine learning techniques. Independent regions\ntargeting the vector boson and gluon fusion mechanisms are defined based on the\ntopology of two quark-initiated jets with large pseudorapidity separation. The\nsignal strengths for both processes are extracted simultaneously by performing\na maximum likelihood fit to data in the large-radius jet mass distribution. The\nobserved signal strengths relative to the standard model expectation are\n4.9$^{+1.9}_{-1.6}$ and 1.6$^{+1.7}_{-1.5}$ for the vector boson and gluon\nfusion mechanisms, respectively. A differential cross section measurement is\nalso reported in the simplified template cross section framework.\n","subjects":["Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cisZon_IHGVyXZQhBMlMUCvI69GlZeKpa_b6HJ9dd94","pdfSize":"1638849","objectId":"0xba9502c5560faf112b0ec6bee40b40905e7e5d3aed8cd4a4917dbdd8b98308de","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
