{"id":"2407.14144","title":"On the tomographic cluster clustering as a cosmological probe","authors":"Massimiliano Romanello, Federico Marulli, Lauro Moscardini, Carlo\n  Giocoli, Giorgio Francesco Lesci, Sofia Contarini, Alessandra Fumagalli,\n  Barbara Sartoris","authorsParsed":[["Romanello","Massimiliano",""],["Marulli","Federico",""],["Moscardini","Lauro",""],["Giocoli","Carlo",""],["Lesci","Giorgio Francesco",""],["Contarini","Sofia",""],["Fumagalli","Alessandra",""],["Sartoris","Barbara",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 09:23:01 GMT"}],"updateDate":"2024-07-22","timestamp":1721380981000,"abstract":"  The spatial distribution of galaxy clusters is a valuable probe for inferring\nfundamental cosmological parameters. We measured the clustering properties of\ndark matter haloes from the \\textsc{Pinocchio} simulations, in the redshift\nrange $0.2 < z < 1.0$ and with virial masses $M_\\mathrm{vir} > 10^{14} M_\\odot\n\\, h^{-1}$, which reproduce the expected mass selection of galaxy cluster\nsamples. The past-light cones we analysed have an angular size of 60 degrees,\nwhich approximately corresponds to a quarter of the sky. We adopted a linear\npower spectrum model, accounting for nonlinear corrections at the baryon\nacoustic oscillations scale, to perform a comparative study between 3D and 2D\ntomographic clustering. For this purpose, we modelled the multipoles of the 3D\ntwo-point correlation function, $\\xi(r)$, the angular correlation function,\n$w(\\theta)$, and the angular power spectrum, $C_\\ell$. We considered\nobservational effects such as redshift-space distortions, produced by the\npeculiar velocities of tracers, and redshift errors. We found that photometric\nredshift errors have a more severe consequence on the 3D than on the 2D\nclustering, as they affect only the radial separation between haloes and not\nthe angular one, with a relevant impact on the 3D multipoles. Using a Bayesian\nanalysis, we explored the posterior distributions of the considered probes with\ndifferent tomographic strategies, in the $\\Omega_m-\\sigma_8$ plane, focusing on\nthe summary parameter $S_8\\equiv \\sigma_8\\sqrt{\\Omega_m/0.3}$. Our results show\nthat in the presence of large photometric errors the 2D clustering can provide\ncompetitive cosmological constraints with respect to the full 3D clustering\nstatistics, and can be successfully applied to analyse the galaxy cluster\ncatalogues from the ongoing and forthcoming Stage-III and Stage-IV photometric\nredshift surveys.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}