{"id":"2407.07545","title":"Narrow Linewidth Laser Based on Extended Topological Interface States in\n  One-Dimensional Photonic Crystals","authors":"Xiao Sun, Zhibo Li, Yiming Sun, Yupei Wang, Jue Wang, Huihua Cheng,\n  Cong Fu, John H. Marsh, Anthony E. Kelly, Lianping Hou","authorsParsed":[["Sun","Xiao",""],["Li","Zhibo",""],["Sun","Yiming",""],["Wang","Yupei",""],["Wang","Jue",""],["Cheng","Huihua",""],["Fu","Cong",""],["Marsh","John H.",""],["Kelly","Anthony E.",""],["Hou","Lianping",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 11:12:51 GMT"}],"updateDate":"2024-07-11","timestamp":1720609971000,"abstract":"  Recent advances in topological one-dimensional photonic crystal concepts have\nenabled the development of robust light-emitting devices by incorporating a\ntopological interface state (TIS) at the cavity center. In this study, we\ntheoretically and experimentally demonstrate a one-dimensional TIS-extended\nphotonic crystal (1D-TISE-PC) structure. By integrating a linearly dispersive\nzero-index one-dimensional photonic crystal structure with a four-phase shift\nsampled grating, photons propagate along the cavity without phase differences,\nenhancing the robustness to material variations and extending the TIS. Our\nfindings indicate that extending the TIS promotes a more uniform photon\ndistribution along the laser cavity and mitigates the spatial hole burning\n(SHB) effect. We fabricated and characterized a 1550 nm sidewall 1D-TISE-PC\nsemiconductor laser, achieving stable single-mode operation across a wide\ncurrent range from 60 to 420 mA, with a side-mode suppression ratio of 50 dB.\nThe 1D-TISE-PC structure exhibited a linewidth narrowing effect to\napproximately 150 kHz Lorentzian linewidth. Utilizing reconstruction\nequivalent-chirp technology for the 4PS sampled grating enabled precise\nwavelength control in 1D-TISE-PC laser arrays, achieving a wavelength spacing\nof 0.796 nm +- 0.003 nm. We show that the TIS still exists in the TISE cavity\nand topological protection is preserved. Its mode extension characteristics\nmitigate the SHB so narrows the linewidth. We argue that the design simplicity\nand improvement of the fabrication tolerance make this architecture suitable\nfor high-power and narrow-linewidth semiconductor lasers development.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}