{"id":"2407.13038","title":"Universal Facial Encoding of Codec Avatars from VR Headsets","authors":"Shaojie Bai, Te-Li Wang, Chenghui Li, Akshay Venkatesh, Tomas Simon,\n  Chen Cao, Gabriel Schwartz, Ryan Wrench, Jason Saragih, Yaser Sheikh, Shih-En\n  Wei","authorsParsed":[["Bai","Shaojie",""],["Wang","Te-Li",""],["Li","Chenghui",""],["Venkatesh","Akshay",""],["Simon","Tomas",""],["Cao","Chen",""],["Schwartz","Gabriel",""],["Wrench","Ryan",""],["Saragih","Jason",""],["Sheikh","Yaser",""],["Wei","Shih-En",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 22:08:15 GMT"}],"updateDate":"2024-07-19","timestamp":1721254095000,"abstract":"  Faithful real-time facial animation is essential for avatar-mediated\ntelepresence in Virtual Reality (VR). To emulate authentic communication,\navatar animation needs to be efficient and accurate: able to capture both\nextreme and subtle expressions within a few milliseconds to sustain the rhythm\nof natural conversations. The oblique and incomplete views of the face,\nvariability in the donning of headsets, and illumination variation due to the\nenvironment are some of the unique challenges in generalization to unseen\nfaces. In this paper, we present a method that can animate a photorealistic\navatar in realtime from head-mounted cameras (HMCs) on a consumer VR headset.\nWe present a self-supervised learning approach, based on a cross-view\nreconstruction objective, that enables generalization to unseen users. We\npresent a lightweight expression calibration mechanism that increases accuracy\nwith minimal additional cost to run-time efficiency. We present an improved\nparameterization for precise ground-truth generation that provides robustness\nto environmental variation. The resulting system produces accurate facial\nanimation for unseen users wearing VR headsets in realtime. We compare our\napproach to prior face-encoding methods demonstrating significant improvements\nin both quantitative metrics and qualitative results.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}