{"id":"2407.15010","title":"ChatISA: A Prompt-Engineered Chatbot for Coding, Project Management,\n  Interview and Exam Preparation Activities","authors":"Fadel M. Megahed, Ying-Ju Chen, Joshua A. Ferris, Cameron Resatar,\n  Kaitlyn Ross, Younghwa Lee, L. Allison Jones-Farmer","authorsParsed":[["Megahed","Fadel M.",""],["Chen","Ying-Ju",""],["Ferris","Joshua A.",""],["Resatar","Cameron",""],["Ross","Kaitlyn",""],["Lee","Younghwa",""],["Jones-Farmer","L. Allison",""]],"versions":[{"version":"v1","created":"Thu, 13 Jun 2024 04:00:07 GMT"}],"updateDate":"2024-07-23","timestamp":1718251207000,"abstract":"  As generative AI continues to evolve, educators face the challenge of\npreparing students for a future where AI-assisted work is integral to\nprofessional success. This paper introduces ChatISA, an in-house, multi-model\nchatbot designed to support students in an Information Systems and Analytics\ndepartment. ChatISA comprises four primary modules-Coding Companion, Project\nCoach, Exam Ally, and Interview Mentor-each tailored to enhance different\naspects of the educational experience. Through iterative development, student\nfeedback, and leveraging open-source frameworks, we created a robust tool that\naddresses coding inquiries, project management, exam preparation, and interview\nreadiness. The implementation of ChatISA revealed significant insights and\nchallenges, including the necessity of ethical guidelines and balancing AI\nusage with maintaining student agency. Our findings underscore the importance\nof adaptive pedagogy and proactive engagement with AI tools to maximize their\neducational benefits. To support broader adoption and innovation, all code for\nChatISA is made publicly available on GitHub, enabling other institutions to\ncustomize and integrate similar AI-driven educational tools within their\ncurricula.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}