{"id":"2407.16764","title":"Augmenting astronomical X-ray detectors with AI for enhanced sensitivity\n  and reduced background","authors":"D. R. Wilkins, A. Poliszczuk, B. Schneider, E. D. Miller, S. W. Allen,\n  M. Bautz, T. Chattopadhyay, A. D. Falcone, R. Foster, C. E. Grant, S.\n  Herrmann, R. Kraft, R. G. Morris, P. Nulsen, P. Orel, G. Schellenberger","authorsParsed":[["Wilkins","D. R.",""],["Poliszczuk","A.",""],["Schneider","B.",""],["Miller","E. D.",""],["Allen","S. W.",""],["Bautz","M.",""],["Chattopadhyay","T.",""],["Falcone","A. D.",""],["Foster","R.",""],["Grant","C. E.",""],["Herrmann","S.",""],["Kraft","R.",""],["Morris","R. G.",""],["Nulsen","P.",""],["Orel","P.",""],["Schellenberger","G.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 18:00:22 GMT"}],"updateDate":"2024-07-25","timestamp":1721757622000,"abstract":"  Bringing artificial intelligence (AI) alongside next-generation X-ray imaging\ndetectors, including CCDs and DEPFET sensors, enhances their sensitivity to\nachieve many of the flagship science cases targeted by future X-ray\nobservatories, based upon low surface brightness and high redshift sources.\nMachine learning algorithms operating on the raw frame-level data provide\nenhanced identification of background vs. astrophysical X-ray events, by\nconsidering all of the signals in the context within which they appear within\neach frame. We have developed prototype machine learning algorithms to identify\nvalid X-ray and cosmic-ray induced background events, trained and tested upon a\nsuite of realistic end-to-end simulations that trace the interaction of cosmic\nray particles and their secondaries through the spacecraft and detector. These\nalgorithms demonstrate that AI can reduce the unrejected instrumental\nbackground by up to 41.5 per cent compared with traditional filtering methods.\nAlongside AI algorithms to reduce the instrumental background, next-generation\nevent reconstruction methods, based upon fitting physically-motivated Gaussian\nmodels of the charge clouds produced by events within the detector, promise\nincreased accuracy and spectral resolution of the lowest energy photon events.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}