{"id":"2407.01188","title":"Prediction of Rare Channel Conditions using Bayesian Statistics and\n  Extreme Value Theory","authors":"Tobias Kallehauge, Anders E. Kal{\\o}r, Pablo Ram\\'irez-Espinosa,\n  Christophe Biscio, Petar Popovski","authorsParsed":[["Kallehauge","Tobias",""],["Kalør","Anders E.",""],["Ramírez-Espinosa","Pablo",""],["Biscio","Christophe",""],["Popovski","Petar",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 11:30:24 GMT"},{"version":"v2","created":"Fri, 5 Jul 2024 09:30:45 GMT"}],"updateDate":"2024-07-08","timestamp":1719833424000,"abstract":"  Estimating the probability of rare channel conditions is a central challenge\nin ultra-reliable wireless communication, where random events, such as deep\nfades, can cause sudden variations in the channel quality. This paper proposes\na sample-efficient framework for predicting the statistics of such events by\nutilizing spatial dependency between channel measurements acquired from various\nlocations. The proposed framework combines radio maps with non-parametric\nmodels and extreme value theory (EVT) to estimate rare-event channel statistics\nunder a Bayesian formulation. The framework can be applied to a wide range of\nproblems in wireless communication and is exemplified by rate selection in\nultra-reliable communications. Notably, besides simulated data, the proposed\nframework is also validated with experimental measurements. The results in both\ncases show that the Bayesian formulation provides significantly better results\nin terms of throughput compared to baselines that do not leverage measurements\nfrom surrounding locations. It is also observed that the models based on EVT\nare generally more accurate in predicting rare-event statistics than\nnon-parametric models, especially when only a limited number of channel samples\nare available. Overall, the proposed methods can significantly reduce the\nnumber of measurements required to predict rare channel conditions and\nguarantee reliability.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}