{"id":"2407.04065","title":"On the Workflows and Smells of Leaderboard Operations (LBOps): An\n  Exploratory Study of Foundation Model Leaderboards","authors":"Zhimin Zhao, Abdul Ali Bangash, Filipe Roseiro C\\^ogo, Bram Adams,\n  Ahmed E. Hassan","authorsParsed":[["Zhao","Zhimin",""],["Bangash","Abdul Ali",""],["Côgo","Filipe Roseiro",""],["Adams","Bram",""],["Hassan","Ahmed E.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 17:12:00 GMT"},{"version":"v2","created":"Sat, 13 Jul 2024 03:21:40 GMT"}],"updateDate":"2024-07-16","timestamp":1720113120000,"abstract":"  Foundation models (FM), such as large language models (LLMs), which are\nlarge-scale machine learning (ML) models, have demonstrated remarkable\nadaptability in various downstream software engineering (SE) tasks, such as\ncode completion, code understanding, and software development. As a result, FM\nleaderboards, especially those hosted on cloud platforms, have become essential\ntools for SE teams to compare and select the best third-party FMs for their\nspecific products and purposes. However, the lack of standardized guidelines\nfor FM evaluation and comparison threatens the transparency of FM leaderboards\nand limits stakeholders' ability to perform effective FM selection. As a first\nstep towards addressing this challenge, our research focuses on understanding\nhow these FM leaderboards operate in real-world scenarios (\"leaderboard\noperations\") and identifying potential leaderboard pitfalls and areas for\nimprovement (\"leaderboard smells\"). In this regard, we perform a multivocal\nliterature review to collect up to 721 FM leaderboards, after which we examine\ntheir documentation and engage in direct communication with leaderboard\noperators to understand their workflow patterns. Using card sorting and\nnegotiated agreement, we identify 5 unique workflow patterns and develop a\ndomain model that outlines the essential components and their interaction\nwithin FM leaderboards. We then identify 8 unique types of leaderboard smells\nin LBOps. By mitigating these smells, SE teams can improve transparency,\naccountability, and collaboration in current LBOps practices, fostering a more\nrobust and responsible ecosystem for FM comparison and selection.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}