{"id":"2407.08479","title":"Robust Generalization of Graph Neural Networks for Carrier Scheduling","authors":"Daniel F. Perez-Ramirez, Carlos P\\'erez-Penichet, Nicolas Tsiftes,\n  Dejan Kostic, Magnus Boman, Thiemo Voigt","authorsParsed":[["Perez-Ramirez","Daniel F.",""],["Pérez-Penichet","Carlos",""],["Tsiftes","Nicolas",""],["Kostic","Dejan",""],["Boman","Magnus",""],["Voigt","Thiemo",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 13:13:24 GMT"}],"updateDate":"2024-07-12","timestamp":1720703604000,"abstract":"  Battery-free sensor tags are devices that leverage backscatter techniques to\ncommunicate with standard IoT devices, thereby augmenting a network's sensing\ncapabilities in a scalable way. For communicating, a sensor tag relies on an\nunmodulated carrier provided by a neighboring IoT device, with a schedule\ncoordinating this provisioning across the network. Carrier\nscheduling--computing schedules to interrogate all sensor tags while minimizing\nenergy, spectrum utilization, and latency--is an NP-Hard optimization problem.\nRecent work introduces learning-based schedulers that achieve resource savings\nover a carefully-crafted heuristic, generalizing to networks of up to 60 nodes.\nHowever, we find that their advantage diminishes in networks with hundreds of\nnodes, and degrades further in larger setups. This paper introduces\nRobustGANTT, a GNN-based scheduler that improves generalization (without\nre-training) to networks up to 1000 nodes (100x training topology sizes).\nRobustGANTT not only achieves better and more consistent generalization, but\nalso computes schedules requiring up to 2x less resources than existing\nsystems. Our scheduler exhibits average runtimes of hundreds of milliseconds,\nallowing it to react fast to changing network conditions. Our work not only\nimproves resource utilization in large-scale backscatter networks, but also\noffers valuable insights in learning-based scheduling.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}