{"id":"2407.16376","title":"Bayesian Autoregressive Online Change-Point Detection with Time-Varying\n  Parameters","authors":"Ioanna-Yvonni Tsaknaki, Fabrizio Lillo, Piero Mazzarisi","authorsParsed":[["Tsaknaki","Ioanna-Yvonni",""],["Lillo","Fabrizio",""],["Mazzarisi","Piero",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 10:57:13 GMT"}],"updateDate":"2024-07-24","timestamp":1721732233000,"abstract":"  Change points in real-world systems mark significant regime shifts in system\ndynamics, possibly triggered by exogenous or endogenous factors. These points\ndefine regimes for the time evolution of the system and are crucial for\nunderstanding transitions in financial, economic, social, environmental, and\ntechnological contexts. Building upon the Bayesian approach introduced in\n\\cite{c:07}, we devise a new method for online change point detection in the\nmean of a univariate time series, which is well suited for real-time\napplications and is able to handle the general temporal patterns displayed by\ndata in many empirical contexts. We first describe time series as an\nautoregressive process of an arbitrary order. Second, the variance and\ncorrelation of the data are allowed to vary within each regime driven by a\nscoring rule that updates the value of the parameters for a better fit of the\nobservations. Finally, a change point is detected in a probabilistic framework\nvia the posterior distribution of the current regime length. By modeling\ntemporal dependencies and time-varying parameters, the proposed approach\nenhances both the estimate accuracy and the forecasting power. Empirical\nvalidations using various datasets demonstrate the method's effectiveness in\ncapturing memory and dynamic patterns, offering deeper insights into the\nnon-stationary dynamics of real-world systems.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/"}