{"id":"2407.08709","title":"Hierarchical Bayesian estimation of motor-evoked potential recruitment\n  curves yields accurate and robust estimates","authors":"Vishweshwar Tyagi, Lynda M. Murray, Ahmet S. Asan, Christopher\n  Mandigo, Michael S. Virk, Noam Y. Harel, Jason B. Carmel, James R. McIntosh","authorsParsed":[["Tyagi","Vishweshwar",""],["Murray","Lynda M.",""],["Asan","Ahmet S.",""],["Mandigo","Christopher",""],["Virk","Michael S.",""],["Harel","Noam Y.",""],["Carmel","Jason B.",""],["McIntosh","James R.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:46:28 GMT"}],"updateDate":"2024-07-12","timestamp":1720719988000,"abstract":"  Electromagnetic stimulation probes and modulates the neural systems that\ncontrol movement. Key to understanding their effects is the muscle recruitment\ncurve, which maps evoked potential size against stimulation intensity. Current\nmethods to estimate curve parameters require large samples; however, obtaining\nthese is often impractical due to experimental constraints. Here, we present a\nhierarchical Bayesian framework that accounts for small samples, handles\noutliers, simulates high-fidelity data, and returns a posterior distribution\nover curve parameters that quantify estimation uncertainty. It uses a\nrectified-logistic function that estimates motor threshold and outperforms\nconventionally used sigmoidal alternatives in predictive performance, as\ndemonstrated through cross-validation. In simulations, our method outperforms\nnon-hierarchical models by reducing threshold estimation error on sparse data\nand requires fewer participants to detect shifts in threshold compared to\nfrequentist testing. We present two common use cases involving electrical and\nelectromagnetic stimulation data and provide an open-source library for Python,\ncalled hbMEP, for diverse applications.\n","subjects":["Statistics/Applications","Quantitative Biology/Neurons and Cognition","Quantitative Biology/Quantitative Methods"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}