{"id":"2407.03426","title":"Multi-Task Decision-Making for Multi-User 360 Video Processing over\n  Wireless Networks","authors":"Babak Badnava, Jacob Chakareski, Morteza Hashemi","authorsParsed":[["Badnava","Babak",""],["Chakareski","Jacob",""],["Hashemi","Morteza",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:09:25 GMT"}],"updateDate":"2024-07-08","timestamp":1720030165000,"abstract":"  We study a multi-task decision-making problem for 360 video processing in a\nwireless multi-user virtual reality (VR) system that includes an edge computing\nunit (ECU) to deliver 360 videos to VR users and offer computing assistance for\ndecoding/rendering of video frames. However, this comes at the expense of\nincreased data volume and required bandwidth. To balance this trade-off, we\nformulate a constrained quality of experience (QoE) maximization problem in\nwhich the rebuffering time and quality variation between video frames are\nbounded by user and video requirements. To solve the formulated multi-user QoE\nmaximization, we leverage deep reinforcement learning (DRL) for multi-task rate\nadaptation and computation distribution (MTRC). The proposed MTRC approach does\nnot rely on any predefined assumption about the environment and relies on video\nplayback statistics (i.e., past throughput, decoding time, transmission time,\netc.), video information, and the resulting performance to adjust the video\nbitrate and computation distribution. We train MTRC with real-world wireless\nnetwork traces and 360 video datasets to obtain evaluation results in terms of\nthe average QoE, peak signal-to-noise ratio (PSNR), rebuffering time, and\nquality variation. Our results indicate that the MTRC improves the users' QoE\ncompared to state-of-the-art rate adaptation algorithm. Specifically, we show a\n5.97 dB to 6.44 dB improvement in PSNR, a 1.66X to 4.23X improvement in\nrebuffering time, and a 4.21 dB to 4.35 dB improvement in quality variation.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Machine Learning","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}