{"id":"2407.03331","title":"Anole: Adapting Diverse Compressed Models For Cross-Scene Prediction On\n  Mobile Devices","authors":"Yunzhe Li, Hongzi Zhu, Zhuohong Deng, Yunlong Cheng, Liang Zhang, Shan\n  Chang and Minyi Guo","authorsParsed":[["Li","Yunzhe",""],["Zhu","Hongzi",""],["Deng","Zhuohong",""],["Cheng","Yunlong",""],["Zhang","Liang",""],["Chang","Shan",""],["Guo","Minyi",""]],"versions":[{"version":"v1","created":"Thu, 9 May 2024 12:06:18 GMT"}],"updateDate":"2024-07-08","timestamp":1715256378000,"abstract":"  Emerging Artificial Intelligence of Things (AIoT) applications desire online\nprediction using deep neural network (DNN) models on mobile devices. However,\ndue to the movement of devices, unfamiliar test samples constantly appear,\nsignificantly affecting the prediction accuracy of a pre-trained DNN. In\naddition, unstable network connection calls for local model inference. In this\npaper, we propose a light-weight scheme, called Anole, to cope with the local\nDNN model inference on mobile devices. The core idea of Anole is to first\nestablish an army of compact DNN models, and then adaptively select the model\nfitting the current test sample best for online inference. The key is to\nautomatically identify model-friendly scenes for training scene-specific DNN\nmodels. To this end, we design a weakly-supervised scene representation\nlearning algorithm by combining both human heuristics and feature similarity in\nseparating scenes. Moreover, we further train a model classifier to predict the\nbest-fit scene-specific DNN model for each test sample. We implement Anole on\ndifferent types of mobile devices and conduct extensive trace-driven and\nreal-world experiments based on unmanned aerial vehicles (UAVs). The results\ndemonstrate that Anole outwits the method of using a versatile large DNN in\nterms of prediction accuracy (4.5% higher), response time (33.1% faster) and\npower consumption (45.1% lower).\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}