{"id":"2407.12776","title":"Experimental Demonstration of a Quantum-Optimal Coronagraph Using\n  Spatial Mode Sorters","authors":"Nico Deshler, Itay Ozer, Amit Ashok, Saikat Guha","authorsParsed":[["Deshler","Nico",""],["Ozer","Itay",""],["Ashok","Amit",""],["Guha","Saikat",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 17:55:39 GMT"}],"updateDate":"2024-07-18","timestamp":1721238939000,"abstract":"  An ideal direct imaging coronagraph, which selectively rejects the\nfundamental mode of a telescope, has been shown to achieve the quantum\ninformation limits for exoplanet detection and localization. In this study, we\nexperimentally implement this quantum-optimal coronagraph using spatial mode\n(de)multiplexing. Our benchtop system includes a forward and inverse pass\nthrough a free-space programmable spatial mode sorter, designed to isolate\nphotons in a point spread function (PSF)-adapted basis. During the forward\npass, the fundamental mode is rejected, effectively eliminating light from an\non-axis point-like star. On the inverse pass, the remaining modes are\ncoherently recombined, enabling direct imaging of a faint companion. We develop\na probabilistic measurement model that accounts for combined effects of\nfundamental shot noise and experimental noise specific to our benchtop setup,\nsuch as modal cross-talk, dark noise, and ambient background illumination. We\nleverage this measurement model to formulate a maximum-likelihood estimator of\nthe exoplanet position given an image captured with the coronagraph. Using this\napproach, we successfully localize an artificial exoplanet at sub-diffraction\ndistances $(<\\sigma)$ from its host star under a 1000:1 star-planet contrast\nratio. Our system accurately localizes the exoplanet up to an absolute error\n$<0.03\\sigma$ over the separation range $[0,\\,0.6]\\sigma$. Finally, we\nnumerically evaluate the precision of our experimental coronagraph against\nstate-of-the-art coronagraphs subject to comparable noise models.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ZnxNUKRt6_gvxc9VF3yR18YR1LXTkb48fx5s03XmZaw","pdfSize":"2991215"}
