{"id":"2407.20198","title":"SpaER: Learning Spatio-temporal Equivariant Representations for Fetal\n  Brain Motion Tracking","authors":"Jian Wang, Razieh Faghihpirayesh, Polina Golland, Ali Gholipour","authorsParsed":[["Wang","Jian",""],["Faghihpirayesh","Razieh",""],["Golland","Polina",""],["Gholipour","Ali",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 17:24:52 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 15:33:41 GMT"},{"version":"v3","created":"Wed, 31 Jul 2024 15:36:22 GMT"}],"updateDate":"2024-08-01","timestamp":1722273892000,"abstract":"  In this paper, we introduce SpaER, a pioneering method for fetal motion\ntracking that leverages equivariant filters and self-attention mechanisms to\neffectively learn spatio-temporal representations. Different from conventional\napproaches that statically estimate fetal brain motions from pairs of images,\nour method dynamically tracks the rigid movement patterns of the fetal head\nacross temporal and spatial dimensions. Specifically, we first develop an\nequivariant neural network that efficiently learns rigid motion sequences\nthrough low-dimensional spatial representations of images. Subsequently, we\nlearn spatio-temporal representations by incorporating time encoding and\nself-attention neural network layers. This approach allows for the capture of\nlong-term dependencies of fetal brain motion and addresses alignment errors due\nto contrast changes and severe motion artifacts. Our model also provides a\ngeometric deformation estimation that properly addresses image distortions\namong all time frames. To the best of our knowledge, our approach is the first\nto learn spatial-temporal representations via deep neural networks for fetal\nmotion tracking without data augmentation. We validated our model using real\nfetal echo-planar images with simulated and real motions. Our method carries\nsignificant potential value in accurately measuring, tracking, and correcting\nfetal motion in fetal MRI sequences.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}