{"id":"2407.20739","title":"Architectural Influence on Variational Quantum Circuits in Multi-Agent\n  Reinforcement Learning: Evolutionary Strategies for Optimization","authors":"Michael K\\\"olle, Karola Schneider, Sabrina Egger, Felix Topp, Thomy\n  Phan, Philipp Altmann, Jonas N\\\"u{\\ss}lein, Claudia Linnhoff-Popien","authorsParsed":[["Kölle","Michael",""],["Schneider","Karola",""],["Egger","Sabrina",""],["Topp","Felix",""],["Phan","Thomy",""],["Altmann","Philipp",""],["Nüßlein","Jonas",""],["Linnhoff-Popien","Claudia",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 11:16:25 GMT"}],"updateDate":"2024-07-31","timestamp":1722338185000,"abstract":"  In recent years, Multi-Agent Reinforcement Learning (MARL) has found\napplication in numerous areas of science and industry, such as autonomous\ndriving, telecommunications, and global health. Nevertheless, MARL suffers\nfrom, for instance, an exponential growth of dimensions. Inherent properties of\nquantum mechanics help to overcome these limitations, e.g., by significantly\nreducing the number of trainable parameters. Previous studies have developed an\napproach that uses gradient-free quantum Reinforcement Learning and\nevolutionary optimization for variational quantum circuits (VQCs) to reduce the\ntrainable parameters and avoid barren plateaus as well as vanishing gradients.\nThis leads to a significantly better performance of VQCs compared to classical\nneural networks with a similar number of trainable parameters and a reduction\nin the number of parameters by more than 97 \\% compared to similarly good\nneural networks. We extend an approach of K\\\"olle et al. by proposing a\nGate-Based, a Layer-Based, and a Prototype-Based concept to mutate and\nrecombine VQCs. Our results show the best performance for mutation-only\nstrategies and the Gate-Based approach. In particular, we observe a\nsignificantly better score, higher total and own collected coins, as well as a\nsuperior own coin rate for the best agent when evaluated in the Coin Game\nenvironment.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multiagent Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}