{"id":"2407.17625","title":"Mixed Convection and Entropy Generation Analysis of Carbon\n  Nanotube-Water Nanofluid in a Square Cavity with Cylinders and Flow\n  Deflectors","authors":"Hashnayne Ahmed, Shashanka Biswas, Farzana Akter Tina","authorsParsed":[["Ahmed","Hashnayne",""],["Biswas","Shashanka",""],["Tina","Farzana Akter",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 20:31:49 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 04:47:23 GMT"}],"updateDate":"2024-08-16","timestamp":1721853109000,"abstract":"  This study explores the mixed convection of carbon nanotube (CNT)-water\nnanofluid within a square cavity containing heated cylinders under the\ninfluence of a magnetic field, focusing on three geometric configurations: a\nsingle heated cylinder, two heated cylinders, and two heated cylinders with a\nflow deflector. The impact of various parameters, including Reynolds number,\nRichardson number, Hartmann number, wavy wall peaks, nanoparticle volume\nfraction, Hartmann angle, rotational speed, and inclination angle, on thermal\nand fluid dynamic behaviors is analyzed. Results reveal that multi-walled\ncarbon nanotube (MWCNT) nanofluids consistently achieve higher Nusselt numbers\nthan single-walled carbon nanotube (SWCNT) nanofluids, indicating superior heat\ntransfer capabilities. Introducing a second cylinder and a flow deflector\nenhances thermal interactions, while increasing Ha stabilizes the flow,\nimproving thermal performance. Wavy wall peaks further enhance fluid mixing and\nheat transfer efficiency. Additionally, SWCNT nanofluids exhibit higher Bejan\nnumbers, indicating a greater dominance of thermal entropy generation over\nfluid friction. These findings provide valuable insights for optimizing thermal\nmanagement systems in engineering applications, highlighting the importance of\nselecting appropriate nanofluids, geometric configurations, and magnetic field\nparameters to achieve optimal thermal performance and fluid stability.\n","subjects":["Physics/Fluid Dynamics","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"5W7dIQ0E5UcvkGc85yUCrPpiDbZsfR9OfyDVeX5kx4w","pdfSize":"8515175"}
