{"id":"2407.16647","title":"Deformable Convolution Based Road Scene Semantic Segmentation of Fisheye\n  Images in Autonomous Driving","authors":"Anam Manzoor, Aryan Singh, Ganesh Sistu, Reenu Mohandas, Eoin Grua,\n  Anthony Scanlan, Ciar\\'an Eising","authorsParsed":[["Manzoor","Anam",""],["Singh","Aryan",""],["Sistu","Ganesh",""],["Mohandas","Reenu",""],["Grua","Eoin",""],["Scanlan","Anthony",""],["Eising","Ciarán",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:02:24 GMT"}],"updateDate":"2024-07-24","timestamp":1721754144000,"abstract":"  This study investigates the effectiveness of modern Deformable Convolutional\nNeural Networks (DCNNs) for semantic segmentation tasks, particularly in\nautonomous driving scenarios with fisheye images. These images, providing a\nwide field of view, pose unique challenges for extracting spatial and geometric\ninformation due to dynamic changes in object attributes. Our experiments focus\non segmenting the WoodScape fisheye image dataset into ten distinct classes,\nassessing the Deformable Networks' ability to capture intricate spatial\nrelationships and improve segmentation accuracy. Additionally, we explore\ndifferent loss functions to address class imbalance issues and compare the\nperformance of conventional CNN architectures with Deformable Convolution-based\nCNNs, including Vanilla U-Net and Residual U-Net architectures. The significant\nimprovement in mIoU score resulting from integrating Deformable CNNs\ndemonstrates their effectiveness in handling the geometric distortions present\nin fisheye imagery, exceeding the performance of traditional CNN architectures.\nThis underscores the significant role of Deformable convolution in enhancing\nsemantic segmentation performance for fisheye imagery.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Zw4J7ODxRI-vu2X_H6lfka2H3tvYqekfFZDCG12_KzM","pdfSize":"1391605"}
