{"id":"2407.20532","title":"Scalable Synthesis of Formally Verified Neural Value Function for\n  Hamilton-Jacobi Reachability Analysis","authors":"Yujie Yang, Hanjiang Hu, Tianhao Wei, Shengbo Eben Li, Changliu Liu","authorsParsed":[["Yang","Yujie",""],["Hu","Hanjiang",""],["Wei","Tianhao",""],["Li","Shengbo Eben",""],["Liu","Changliu",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 04:14:52 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 16:22:00 GMT"}],"updateDate":"2024-08-01","timestamp":1722312892000,"abstract":"  Hamilton-Jacobi (HJ) reachability analysis provides a formal method for\nguaranteeing safety in constrained control problems. It synthesizes a value\nfunction to represent a long-term safe set called feasible region. Early\nsynthesis methods based on state space discretization cannot scale to\nhigh-dimensional problems, while recent methods that use neural networks to\napproximate value functions result in unverifiable feasible regions. To achieve\nboth scalability and verifiability, we propose a framework for synthesizing\nverified neural value functions for HJ reachability analysis. Our framework\nconsists of three stages: pre-training, adversarial training, and\nverification-guided training. We design three techniques to address three\nchallenges to improve scalability respectively: boundary-guided backtracking\n(BGB) to improve counterexample search efficiency, entering state\nregularization (ESR) to enlarge feasible region, and activation pattern\nalignment (APA) to accelerate neural network verification. We also provide a\nneural safety certificate synthesis and verification benchmark called\nCersyve-9, which includes nine commonly used safe control tasks and supplements\nexisting neural network verification benchmarks. Our framework successfully\nsynthesizes verified neural value functions on all tasks, and our proposed\nthree techniques exhibit superior scalability and efficiency compared with\nexisting methods.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}