{"id":"2407.08448","title":"Paving the way toward foundation models for irregular and unaligned\n  Satellite Image Time Series","authors":"Iris Dumeur (CESBIO), Silvia Valero (CESBIO), Jordi Inglada (CESBIO)","authorsParsed":[["Dumeur","Iris","","CESBIO"],["Valero","Silvia","","CESBIO"],["Inglada","Jordi","","CESBIO"]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 12:42:10 GMT"}],"updateDate":"2024-07-12","timestamp":1720701730000,"abstract":"  Although recently several foundation models for satellite remote sensing\nimagery have been proposed, they fail to address major challenges of\nreal/operational applications. Indeed, embeddings that don't take into account\nthe spectral, spatial and temporal dimensions of the data as well as the\nirregular or unaligned temporal sampling are of little use for most real world\nuses.As a consequence, we propose an ALIgned Sits Encoder (ALISE), a novel\napproach that leverages the spatial, spectral, and temporal dimensions of\nirregular and unaligned SITS while producing aligned latent representations.\nUnlike SSL models currently available for SITS, ALISE incorporates a flexible\nquery mechanism to project the SITS into a common and learned temporal\nprojection space. Additionally, thanks to a multi-view framework, we explore\nintegration of instance discrimination along a masked autoencoding task to\nSITS. The quality of the produced representation is assessed through three\ndownstream tasks: crop segmentation (PASTIS), land cover segmentation\n(MultiSenGE), and a novel crop change detection dataset. Furthermore, the\nchange detection task is performed without supervision. The results suggest\nthat the use of aligned representations is more effective than previous SSL\nmethods for linear probing segmentation tasks.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}