{"id":"2407.13706","title":"GAP9Shield: A 150GOPS AI-capable Ultra-low Power Module for Vision and\n  Ranging Applications on Nano-drones","authors":"Hanna M\\\"uller, Victor Kartsch, Luca Benini","authorsParsed":[["Müller","Hanna",""],["Kartsch","Victor",""],["Benini","Luca",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 11:41:39 GMT"}],"updateDate":"2024-07-19","timestamp":1719488499000,"abstract":"  The evolution of AI and digital signal processing technologies, combined with\naffordable energy-efficient processors, has propelled the development of both\nhardware and software for drone applications. Nano-drones, which fit into the\npalm of the hand, are suitable for indoor environments and safe for human\ninteraction; however, they often fail to deliver the required performance for\ncomplex tasks due to the lack of hardware providing sufficient sensing and\ncomputing performance. Addressing this gap, we present the GAP9Shield, a\nnano-drone-compatible module powered by the GAP9, a 150GOPS-capable SoC. The\nsystem also includes a 5MP OV5647 camera for high-definition imaging, a\nWiFi-BLE NINA module, and a 5D VL53L1-based ranging subsystem, which enhances\nobstacle avoidance capabilities. In comparison with similarly targeted\nstate-of-the-art systems, GAP9Shield provides a 20% higher sample rate (RGB\nimages) while offering a 20% weight reduction. In this paper, we also highlight\nthe energy efficiency and processing power capabilities of GAP9 for object\ndetection (YOLO), localization, and mapping, which can run within a power\nenvelope of below 100 mW and at low latency (as 17 ms for object detection),\nhighlighting the transformative potential of GAP9 for the new generation of\nnano-drone applications.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FJljbMKxwsjLF-TNJrjadmnt5lRfIyWCGo64OsVLIKg","pdfSize":"1773099","objectId":"0xcfac75c236e63753ff93457028eb61f40b9a8931411fd3517cc165c16d37157e","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
