{"id":"2407.19199","title":"A simulation study of cluster search algorithms in data set generated by\n  Gaussian mixture models","authors":"Ryosuke Motegi and Yoichi Seki","authorsParsed":[["Motegi","Ryosuke",""],["Seki","Yoichi",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 07:47:25 GMT"}],"updateDate":"2024-07-30","timestamp":1722066445000,"abstract":"  Determining the number of clusters is a fundamental issue in data clustering.\nSeveral algorithms have been proposed, including centroid-based algorithms\nusing the Euclidean distance and model-based algorithms using a mixture of\nprobability distributions. Among these, greedy algorithms for searching the\nnumber of clusters by repeatedly splitting or merging clusters have advantages\nin terms of computation time for problems with large sample sizes. However,\nstudies comparing these methods in systematic evaluation experiments still need\nto be included. This study examines centroid- and model-based cluster search\nalgorithms in various cases that Gaussian mixture models (GMMs) can generate.\nThe cases are generated by combining five factors: dimensionality, sample size,\nthe number of clusters, cluster overlap, and covariance type. The results show\nthat some cluster-splitting criteria based on Euclidean distance make\nunreasonable decisions when clusters overlap. The results also show that\nmodel-based algorithms are insensitive to covariance type and cluster overlap\ncompared to the centroid-based method if the sample size is sufficient. Our\ncluster search implementation codes are available at\nhttps://github.com/lipryou/searchClustK\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8Spmwx4CizmeQO2-SyUUI08DFq4VGtnirOO6Ai0o86c","pdfSize":"1524412","objectId":"0x17b92e0ae464cf25a1b6873450ed7a4d07c10f1682bbc668d8a82ae000bae130","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
