{"id":"2407.06762","title":"Explicit Modelling of Theory of Mind for Belief Prediction in Nonverbal\n  Social Interactions","authors":"Matteo Bortoletto, Constantin Ruhdorfer, Lei Shi, Andreas Bulling","authorsParsed":[["Bortoletto","Matteo",""],["Ruhdorfer","Constantin",""],["Shi","Lei",""],["Bulling","Andreas",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 11:15:51 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 15:42:29 GMT"},{"version":"v3","created":"Wed, 28 Aug 2024 11:26:06 GMT"}],"updateDate":"2024-08-29","timestamp":1720523751000,"abstract":"  We propose MToMnet - a Theory of Mind (ToM) neural network for predicting\nbeliefs and their dynamics during human social interactions from multimodal\ninput. ToM is key for effective nonverbal human communication and\ncollaboration, yet, existing methods for belief modelling have not included\nexplicit ToM modelling or have typically been limited to one or two modalities.\nMToMnet encodes contextual cues (scene videos and object locations) and\nintegrates them with person-specific cues (human gaze and body language) in a\nseparate MindNet for each person. Inspired by prior research on social\ncognition and computational ToM, we propose three different MToMnet variants:\ntwo involving fusion of latent representations and one involving re-ranking of\nclassification scores. We evaluate our approach on two challenging real-world\ndatasets, one focusing on belief prediction, while the other examining belief\ndynamics prediction. Our results demonstrate that MToMnet surpasses existing\nmethods by a large margin while at the same time requiring a significantly\nsmaller number of parameters. Taken together, our method opens up a highly\npromising direction for future work on artificial intelligent systems that can\nrobustly predict human beliefs from their non-verbal behaviour and, as such,\nmore effectively collaborate with humans.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"sq7Yhqk98Tdh9y558ixCfuMMQbX2fXKRNxSU2MK1Tjs","pdfSize":"10921914"}
