{"id":"2407.20853","title":"NIS-SLAM: Neural Implicit Semantic RGB-D SLAM for 3D Consistent Scene\n  Understanding","authors":"Hongjia Zhai, Gan Huang, Qirui Hu, Guanglin Li, Hujun Bao, Guofeng\n  Zhang","authorsParsed":[["Zhai","Hongjia",""],["Huang","Gan",""],["Hu","Qirui",""],["Li","Guanglin",""],["Bao","Hujun",""],["Zhang","Guofeng",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 14:27:59 GMT"}],"updateDate":"2024-07-31","timestamp":1722349679000,"abstract":"  In recent years, the paradigm of neural implicit representations has gained\nsubstantial attention in the field of Simultaneous Localization and Mapping\n(SLAM). However, a notable gap exists in the existing approaches when it comes\nto scene understanding. In this paper, we introduce NIS-SLAM, an efficient\nneural implicit semantic RGB-D SLAM system, that leverages a pre-trained 2D\nsegmentation network to learn consistent semantic representations.\nSpecifically, for high-fidelity surface reconstruction and spatial consistent\nscene understanding, we combine high-frequency multi-resolution\ntetrahedron-based features and low-frequency positional encoding as the\nimplicit scene representations. Besides, to address the inconsistency of 2D\nsegmentation results from multiple views, we propose a fusion strategy that\nintegrates the semantic probabilities from previous non-keyframes into\nkeyframes to achieve consistent semantic learning. Furthermore, we implement a\nconfidence-based pixel sampling and progressive optimization weight function\nfor robust camera tracking. Extensive experimental results on various datasets\nshow the better or more competitive performance of our system when compared to\nother existing neural dense implicit RGB-D SLAM approaches. Finally, we also\nshow that our approach can be used in augmented reality applications. Project\npage:\n\\href{https://zju3dv.github.io/nis_slam}{https://zju3dv.github.io/nis\\_slam}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZVXBv7Q-ZVLxekqCyu12N-B5R3bF-FTZGCX268AqibA","pdfSize":"23688805"}
