{"id":"2407.17308","title":"Impact parameter dependence of anisotropic flow: Bayesian reconstruction\n  in ultracentral nucleus-nucleus collisions","authors":"Mubarak Alqahtani, Rajeev S. Bhalerao, Giuliano Giacalone, Andreas\n  Kirchner, Jean-Yves Ollitrault","authorsParsed":[["Alqahtani","Mubarak",""],["Bhalerao","Rajeev S.",""],["Giacalone","Giuliano",""],["Kirchner","Andreas",""],["Ollitrault","Jean-Yves",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 14:22:38 GMT"}],"updateDate":"2024-07-25","timestamp":1721830958000,"abstract":"  Peculiar phenomena have been observed in analyses of anisotropic flow ($v_n$)\nfluctuations in ultracentral nucleus-nucleus collisions: The fourth-order\ncumulant of the elliptic flow ($v_2$) distribution changes sign. In addition,\nthe ATLAS collaboration has shown that cumulants of $v_n$ fluctuations of all\norders depend significantly on the centrality estimator. We show that these\npeculiarities are due to the fact that the impact parameter $b$ always spans a\nfinite range for a fixed value of the centrality estimator. We provide a\nquantitative determination of this range through a simple Bayesian analysis. We\nobtain excellent fits of STAR and ATLAS data, with a few parameters, by\nassuming that the probability distribution of $v_n$ solely depends on $b$ at a\ngiven centrality. This probability distribution is almost Gaussian, and its\nparameters depend smoothly on $b$, in a way that is constrained by symmetry and\nscaling laws. We reconstruct, thus, the impact parameter dependence of the mean\nelliptic flow in the reaction plane in a model-independent manner, and assess\nthe robustness of the extraction using Monte Carlo simulations of the\ncollisions where the impact parameter is known. We argue that the\nnon-Gaussianity of $v_n$ fluctuations gives direct information on the\nhydrodynamic response to initial anisotropies, ATLAS data being consistent with\na smaller response for $n=4$ than for $n=2$ and $n=3$, in agreement with\nhydrodynamic calculations.\n","subjects":["Physics/Nuclear Theory","Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Phenomenology","Physics/Nuclear Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/"}