{"id":"2407.03551","title":"Feelings about Bodies: Emotions on Diet and Fitness Forums Reveal\n  Gendered Stereotypes and Body Image Concerns","authors":"Cinthia S\\'anchez, Minh Duc Chu, Zihao He, Rebecca Dorn, Stuart\n  Murray, Kristina Lerman","authorsParsed":[["Sánchez","Cinthia",""],["Chu","Minh Duc",""],["He","Zihao",""],["Dorn","Rebecca",""],["Murray","Stuart",""],["Lerman","Kristina",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 00:11:27 GMT"}],"updateDate":"2024-07-08","timestamp":1720051887000,"abstract":"  The gendered expectations about ideal body types can lead to body image\nconcerns, dissatisfaction, and in extreme cases, disordered eating and other\npsychopathologies across the gender spectrum. While research has focused on\npro-anorexia online communities that glorify the 'thin ideal', less attention\nhas been given to the broader spectrum of body image concerns or how emerging\ndisorders like muscle dysmorphia ('bigorexia') present in online discussions.\nTo address these gaps, we analyze 46 Reddit discussion forums related to diet,\nfitness, and associated mental health challenges. Using membership structure\nanalysis and transformer-based language models, we project these communities\nalong gender and body ideal axes, revealing complex interactions between\ngender, body ideals, and emotional expression. Our findings show that\nfeminine-oriented communities generally express more negative emotions,\nparticularly in thinness-promoting forums. Conversely, communities focused on\nthe muscular ideal exhibit less negativity, regardless of gender orientation.\nWe also uncover a gendered pattern in emotional indicators of mental health\nchallenges, with communities discussing serious issues aligning more closely\nwith thinness-oriented, predominantly feminine-leaning communities. By\nrevealing the gendered emotional dynamics of online communities, our findings\ncan inform the development of more effective content moderation approaches that\nfacilitate supportive interactions, while minimizing exposure to potentially\nharmful content.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Computation and Language","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}