{"id":"2407.21753","title":"Characterizing User Archetypes and Discussions on Scored.co","authors":"Andrea Failla, Salvatore Citraro, Giulio Rossetti, Francesco\n  Cauteruccio","authorsParsed":[["Failla","Andrea",""],["Citraro","Salvatore",""],["Rossetti","Giulio",""],["Cauteruccio","Francesco",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 17:18:25 GMT"}],"updateDate":"2024-08-05","timestamp":1722446305000,"abstract":"  In recent years, the proliferation of social platforms has drastically\ntransformed the way individuals interact, organize, and share information. In\nthis scenario, we experience an unprecedented increase in the scale and\ncomplexity of interactions and, at the same time, little to no research about\nsome fringe social platforms. In this paper, we present a multi-dimensional\nframework for characterizing nodes and hyperedges in social hypernetworks, with\na focus on the understudied alt-right platform Scored.co. Our approach\nintegrates the possibility of studying higher-order interactions, thanks to the\nhypernetwork representation, and various node features such as user activity,\nsentiment, and toxicity, with the aim to define distinct user archetypes and\nunderstand their roles within the network. Utilizing a comprehensive dataset\nfrom Scored.co, we analyze the dynamics of these archetypes over time and\nexplore their interactions and influence within the community. The framework's\nversatility allows for detailed analysis of both individual user behaviors and\nbroader social structures. Our findings highlight the importance of\nhigher-order interactions in understanding social dynamics, offering new\ninsights into the roles and behaviors that emerge in complex online\nenvironments.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"70HaT4FIehSYh1wHuiTw9AyHeP0BUsU6DgFLIYN9Dmk","pdfSize":"855809","objectId":"0x7e909f8a8561cd0b228f6473706b19762a42e33ee78b4caddeb7a72cc32cc693","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
