{"id":"2407.16697","title":"AbdomenAtlas: A Large-Scale, Detailed-Annotated, & Multi-Center Dataset\n  for Efficient Transfer Learning and Open Algorithmic Benchmarking","authors":"Wenxuan Li, Chongyu Qu, Xiaoxi Chen, Pedro R. A. S. Bassi, Yijia Shi,\n  Yuxiang Lai, Qian Yu, Huimin Xue, Yixiong Chen, Xiaorui Lin, Yutong Tang,\n  Yining Cao, Haoqi Han, Zheyuan Zhang, Jiawei Liu, Tiezheng Zhang, Yujiu Ma,\n  Jincheng Wang, Guang Zhang, Alan Yuille, Zongwei Zhou","authorsParsed":[["Li","Wenxuan",""],["Qu","Chongyu",""],["Chen","Xiaoxi",""],["Bassi","Pedro R. A. S.",""],["Shi","Yijia",""],["Lai","Yuxiang",""],["Yu","Qian",""],["Xue","Huimin",""],["Chen","Yixiong",""],["Lin","Xiaorui",""],["Tang","Yutong",""],["Cao","Yining",""],["Han","Haoqi",""],["Zhang","Zheyuan",""],["Liu","Jiawei",""],["Zhang","Tiezheng",""],["Ma","Yujiu",""],["Wang","Jincheng",""],["Zhang","Guang",""],["Yuille","Alan",""],["Zhou","Zongwei",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:59:44 GMT"}],"updateDate":"2024-07-24","timestamp":1721757584000,"abstract":"  We introduce the largest abdominal CT dataset (termed AbdomenAtlas) of 20,460\nthree-dimensional CT volumes sourced from 112 hospitals across diverse\npopulations, geographies, and facilities. AbdomenAtlas provides 673K\nhigh-quality masks of anatomical structures in the abdominal region annotated\nby a team of 10 radiologists with the help of AI algorithms. We start by having\nexpert radiologists manually annotate 22 anatomical structures in 5,246 CT\nvolumes. Following this, a semi-automatic annotation procedure is performed for\nthe remaining CT volumes, where radiologists revise the annotations predicted\nby AI, and in turn, AI improves its predictions by learning from revised\nannotations. Such a large-scale, detailed-annotated, and multi-center dataset\nis needed for two reasons. Firstly, AbdomenAtlas provides important resources\nfor AI development at scale, branded as large pre-trained models, which can\nalleviate the annotation workload of expert radiologists to transfer to broader\nclinical applications. Secondly, AbdomenAtlas establishes a large-scale\nbenchmark for evaluating AI algorithms -- the more data we use to test the\nalgorithms, the better we can guarantee reliable performance in complex\nclinical scenarios. An ISBI & MICCAI challenge named BodyMaps: Towards 3D Atlas\nof Human Body was launched using a subset of our AbdomenAtlas, aiming to\nstimulate AI innovation and to benchmark segmentation accuracy, inference\nefficiency, and domain generalizability. We hope our AbdomenAtlas can set the\nstage for larger-scale clinical trials and offer exceptional opportunities to\npractitioners in the medical imaging community. Codes, models, and datasets are\navailable at https://www.zongweiz.com/dataset\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}