{"id":"2407.11117","title":"A Simplified Model of Heavy Vector Singlets for the LHC and Future\n  Colliders","authors":"Michael J. Baker, Timothy Martonhelyi, Andrea Thamm, Riccardo Torre","authorsParsed":[["Baker","Michael J.",""],["Martonhelyi","Timothy",""],["Thamm","Andrea",""],["Torre","Riccardo",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-17","timestamp":1721066401000,"abstract":"  We study a simplified model of two colourless heavy vector resonances in the\nsinglet representation of $SU(2)_{L}$, with zero and unit hypercharge. We\ndiscuss mixing with the Standard Model gauge bosons due to electroweak symmetry\nbreaking, semi-analytic formulae for production at proton colliders,\nrequirements to obey the narrow width approximation and selected low energy\nconstraints. We show current LHC constraints and sensitivity projections for\nthe HL-LHC, HE-LHC, SPPC and FCC-hh on the charged and neutral heavy vectors.\nThe utility of the simplified model Lagrangian is demonstrated by matching\nthese results onto three explicit models: a weakly coupled abelian extension of\nthe Standard Model gauge group, a weakly coupled non-abelian extension and a\nstrongly coupled minimal composite Higgs model. All our results are presented\nin terms of physical resonance masses, which are accurate even at vector masses\nnear the electroweak scale due to a parameter inversion we derive. We discuss\nthe importance of this inversion and point out that its effect, and the effects\nof electroweak symmetry breaking, can remain important up to resonance masses\nof several TeV. Finally, we clarify the relation between this simplified model\nand the Heavy Vector Triplet (HVT) model, a simplified model for heavy\n$SU(2)_{L}$ triplets with zero hypercharge, and provide exact and approximate\nmatching relations.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}