{"id":"2407.00386","title":"Multi-task multi-constraint differential evolution with elite-guided\n  knowledge transfer for coal mine integrated energy system dispatching","authors":"Canyun Dai and Xiaoyan Sun and Hejuan Hu and Wei Song and Yong Zhang\n  and Dunwei Gong","authorsParsed":[["Dai","Canyun",""],["Sun","Xiaoyan",""],["Hu","Hejuan",""],["Song","Wei",""],["Zhang","Yong",""],["Gong","Dunwei",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 10:00:16 GMT"}],"updateDate":"2024-07-02","timestamp":1719655216000,"abstract":"  The dispatch optimization of coal mine integrated energy system is\nchallenging due to high dimensionality, strong coupling constraints, and\nmultiobjective. Existing constrained multiobjective evolutionary algorithms\nstruggle with locating multiple small and irregular feasible regions, making\nthem inaplicable to this problem. To address this issue, we here develop a\nmultitask evolutionary algorithm framework that incorporates the dispatch\ncorrelated domain knowledge to effectively deal with strong constraints and\nmultiobjective optimization. Possible evolutionary multitask construction\nstrategy based on complex constraint relationship analysis and handling, i.e.,\nconstraint coupled spatial decomposition, constraint strength classification\nand constraint handling technique, is first explored. Within the multitask\nevolutionary optimization framework, two strategies, i.e., an elite guided\nknowledge transfer by designing a special crowding distance mechanism to select\ndominant individuals from each task, and an adaptive neighborhood technology\nbased mutation to effectively balance the diversity and convergence of each\noptimized task for the differential evolution algorithm, are further developed.\nThe performance of the proposed algorithm in feasibility, convergence, and\ndiversity is demonstrated in a case study of a coal mine integrated energy\nsystem by comparing with CPLEX solver and seven constrained multiobjective\nevolutionary algorithms.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}