{"id":"2407.14538","title":"Alea-BFT: Practical Asynchronous Byzantine Fault Tolerance","authors":"Diogo S. Antunes, Afonso N. Oliveira, Andr\\'e Breda, Matheus Guilherme\n  Franco, Henrique Moniz, Rodrigo Rodrigues","authorsParsed":[["Antunes","Diogo S.",""],["Oliveira","Afonso N.",""],["Breda","André",""],["Franco","Matheus Guilherme",""],["Moniz","Henrique",""],["Rodrigues","Rodrigo",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 14:09:50 GMT"}],"updateDate":"2024-07-23","timestamp":1720966190000,"abstract":"  Traditional Byzantine Fault Tolerance (BFT) state machine replication\nprotocols assume a partial synchrony model, leading to a design where a leader\nreplica drives the protocol and is replaced after a timeout. Recently, we\nwitnessed a surge of asynchronous BFT protocols, which use randomization to\nremove the need for bounds on message delivery times, making them more\nresilient to adverse network conditions. However, existing research proposals\nstill fall short of gaining practical adoption, plausibly because they are not\nable to combine good performance with a simple design that can be readily\nunderstood and adopted. In this paper, we present Alea-BFT, a simple and highly\nefficient asynchronous BFT protocol, which is gaining practical adoption,\nnamely in Ethereum distributed validators. Alea-BFT brings the key design\ninsight from classical protocols of concentrating part of the work on a single\ndesignated replica and incorporates this principle in a simple two-stage\npipelined design, with an efficient broadcast led by the designated replica,\nfollowed by an inexpensive binary agreement. The evaluation of our research\nprototype implementation and two real-world integrations in cryptocurrency\necosystems shows excellent performance, improving on the fastest protocol\n(Dumbo-NG) in terms of latency and displaying good performance under faults.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NWEYY7WwJb1sVP_lUD9W5zO69QBq66H_clF9NmDdcno","pdfSize":"1436290","objectId":"0xd4cbd7fef8c823668f9469fc7aa4f90074a2869face1c940b418cd80120cf008","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
