{"id":"2407.00307","title":"Deterministic and Stochastic Frank-Wolfe Recursion on Probability Spaces","authors":"Di Yu, Shane G. Henderson, Raghu Pasupathy","authorsParsed":[["Yu","Di",""],["Henderson","Shane G.",""],["Pasupathy","Raghu",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 04:13:35 GMT"}],"updateDate":"2024-07-02","timestamp":1719634415000,"abstract":"  Motivated by applications in emergency response and experimental design, we\nconsider smooth stochastic optimization problems over probability measures\nsupported on compact subsets of the Euclidean space. With the influence\nfunction as the variational object, we construct a deterministic Frank-Wolfe\n(dFW) recursion for probability spaces, made especially possible by a lemma\nthat identifies a ``closed-form'' solution to the infinite-dimensional\nFrank-Wolfe sub-problem. Each iterate in dFW is expressed as a convex\ncombination of the incumbent iterate and a Dirac measure concentrating on the\nminimum of the influence function at the incumbent iterate. To address common\napplication contexts that have access only to Monte Carlo observations of the\nobjective and influence function, we construct a stochastic Frank-Wolfe (sFW)\nvariation that generates a random sequence of probability measures constructed\nusing minima of increasingly accurate estimates of the influence function. We\ndemonstrate that sFW's optimality gap sequence exhibits $O(k^{-1})$ iteration\ncomplexity almost surely and in expectation for smooth convex objectives, and\n$O(k^{-1/2})$ (in Frank-Wolfe gap) for smooth non-convex objectives.\nFurthermore, we show that an easy-to-implement fixed-step, fixed-sample version\nof (sFW) exhibits exponential convergence to $\\varepsilon$-optimality. We end\nwith a central limit theorem on the observed objective values at the sequence\nof generated random measures. To further intuition, we include several\nillustrative examples with exact influence function calculations.\n","subjects":["Mathematics/Optimization and Control","Statistics/Computation"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}