{"id":"2407.20664","title":"3D-GRES: Generalized 3D Referring Expression Segmentation","authors":"Changli Wu, Yihang Liu, Jiayi Ji, Yiwei Ma, Haowei Wang, Gen Luo,\n  Henghui Ding, Xiaoshuai Sun, Rongrong Ji","authorsParsed":[["Wu","Changli",""],["Liu","Yihang",""],["Ji","Jiayi",""],["Ma","Yiwei",""],["Wang","Haowei",""],["Luo","Gen",""],["Ding","Henghui",""],["Sun","Xiaoshuai",""],["Ji","Rongrong",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 08:59:05 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 11:11:20 GMT"}],"updateDate":"2024-08-01","timestamp":1722329945000,"abstract":"  3D Referring Expression Segmentation (3D-RES) is dedicated to segmenting a\nspecific instance within a 3D space based on a natural language description.\nHowever, current approaches are limited to segmenting a single target,\nrestricting the versatility of the task. To overcome this limitation, we\nintroduce Generalized 3D Referring Expression Segmentation (3D-GRES), which\nextends the capability to segment any number of instances based on natural\nlanguage instructions. In addressing this broader task, we propose the\nMulti-Query Decoupled Interaction Network (MDIN), designed to break down\nmulti-object segmentation tasks into simpler, individual segmentations. MDIN\ncomprises two fundamental components: Text-driven Sparse Queries (TSQ) and\nMulti-object Decoupling Optimization (MDO). TSQ generates sparse point cloud\nfeatures distributed over key targets as the initialization for queries.\nMeanwhile, MDO is tasked with assigning each target in multi-object scenarios\nto different queries while maintaining their semantic consistency. To adapt to\nthis new task, we build a new dataset, namely Multi3DRes. Our comprehensive\nevaluations on this dataset demonstrate substantial enhancements over existing\nmodels, thus charting a new path for intricate multi-object 3D scene\ncomprehension. The benchmark and code are available at\nhttps://github.com/sosppxo/MDIN.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}