{"id":"2407.14184","title":"From the Janis-Newman-Winicour naked singularities to Einstein-Maxwell\n  phantom wormholes","authors":"Changjun Gao and Jianhui Qiu","authorsParsed":[["Gao","Changjun",""],["Qiu","Jianhui",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 10:28:31 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 11:54:04 GMT"},{"version":"v3","created":"Fri, 16 Aug 2024 07:31:02 GMT"}],"updateDate":"2024-08-19","timestamp":1721384911000,"abstract":"  The Janis-Newman-Winicour spacetime corresponds to a static spherically\nsymmetric solution of Einstein equations with the energy momentum tensor of a\nmassless quintessence field. It is understood that the spacetime describes a\nnaked singularity. The solution has two parameters, $b$ and $s$. To our\nknowledge, the exact physical meaning of the two parameters is still unclear.\nIn this paper, starting from the Janis-Newman-Winicour naked singularity\nsolution, we first obtain a wormhole solution by a complex transformation. Then\nlet the parameter $s$ approaching infinity, we obtain the well-known\nexponential wormhole solution. After that, we embed both the\nJanis-Newman-Winicour naked singularity and its wormhole counterpart in the\nbackground of de Sitter or anti-de Sitter Universe with the energy momentum\ntensor of massive quintessence and massive phantom fields, respectively. To our\nsurprise, the resulting quintessence potential is actually the dilaton\npotential found by one of us. It hints us that, by modulating the parameters in\nthe charged dilaton black hole solutions we can get the Janis-Newman-Winicour\nsolution. Furthermore, a charged wormhole solution is obtained by performing\ncomplex transformation on the charged dilaton black hole solutions in the\nbackground of de Sitter or anti-de Sitter Universe. We eventually find that $s$\nis actually related to the coupling constant of dilaton field to Maxwell field\nand $b$ is related to a negative mass for the dilaton black holes. A negative\nblack hole mass is physically forbidden. Therefore, we conclude that the\nJanis-Newman-Winicour naked singularity solution is not physically allowed.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}