{"id":"2407.00362","title":"JSCDS: A Core Data Selection Method with Jason-Shannon Divergence for\n  Caries RGB Images-Efficient Learning","authors":"Peiliang Zhang and Yujia Tong and Chenghu Du and Chao Che and Yongjun\n  Zhu","authorsParsed":[["Zhang","Peiliang",""],["Tong","Yujia",""],["Du","Chenghu",""],["Che","Chao",""],["Zhu","Yongjun",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 08:19:25 GMT"},{"version":"v2","created":"Sun, 7 Jul 2024 03:36:14 GMT"}],"updateDate":"2024-07-09","timestamp":1719649165000,"abstract":"  Deep learning-based RGB caries detection improves the efficiency of caries\nidentification and is crucial for preventing oral diseases. The performance of\ndeep learning models depends on high-quality data and requires substantial\ntraining resources, making efficient deployment challenging. Core data\nselection, by eliminating low-quality and confusing data, aims to enhance\ntraining efficiency without significantly compromising model performance.\nHowever, distance-based data selection methods struggle to distinguish\ndependencies among high-dimensional caries data. To address this issue, we\npropose a Core Data Selection Method with Jensen-Shannon Divergence (JSCDS) for\nefficient caries image learning and caries classification. We describe the core\ndata selection criterion as the distribution of samples in different classes.\nJSCDS calculates the cluster centers by sample embedding representation in the\ncaries classification network and utilizes Jensen-Shannon Divergence to compute\nthe mutual information between data samples and cluster centers, capturing\nnonlinear dependencies among high-dimensional data. The average mutual\ninformation is calculated to fit the above distribution, serving as the\ncriterion for constructing the core set for model training. Extensive\nexperiments on RGB caries datasets show that JSCDS outperforms other data\nselection methods in prediction performance and time consumption. Notably,\nJSCDS exceeds the performance of the full dataset model with only 50% of the\ncore data, with its performance advantage becoming more pronounced in the 70%\nof core data.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}