{"id":"2407.08839","title":"A Survey on the Application of Generative Adversarial Networks in\n  Cybersecurity: Prospective, Direction and Open Research Scopes","authors":"Md Mashrur Arifin, Md Shoaib Ahmed, Tanmai Kumar Ghosh, Jun Zhuang,\n  Jyh-haw Yeh","authorsParsed":[["Arifin","Md Mashrur",""],["Ahmed","Md Shoaib",""],["Ghosh","Tanmai Kumar",""],["Zhuang","Jun",""],["Yeh","Jyh-haw",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 19:51:48 GMT"}],"updateDate":"2024-07-15","timestamp":1720727508000,"abstract":"  With the proliferation of Artificial Intelligence, there has been a massive\nincrease in the amount of data required to be accumulated and disseminated\ndigitally. As the data are available online in digital landscapes with complex\nand sophisticated infrastructures, it is crucial to implement various defense\nmechanisms based on cybersecurity. Generative Adversarial Networks (GANs),\nwhich are deep learning models, have emerged as powerful solutions for\naddressing the constantly changing security issues. This survey studies the\nsignificance of the deep learning model, precisely on GANs, in strengthening\ncybersecurity defenses. Our survey aims to explore the various works completed\nin GANs, such as Intrusion Detection Systems (IDS), Mobile and Network\nTrespass, BotNet Detection, and Malware Detection. The focus is to examine how\nGANs can be influential tools to strengthen cybersecurity defenses in these\ndomains. Further, the paper discusses the challenges and constraints of using\nGANs in these areas and suggests future research directions. Overall, the paper\nhighlights the potential of GANs in enhancing cybersecurity measures and\naddresses the need for further exploration in this field.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}