{"id":"2407.13068","title":"Krait: A Backdoor Attack Against Graph Prompt Tuning","authors":"Ying Song, Rita Singh, Balaji Palanisamy","authorsParsed":[["Song","Ying",""],["Singh","Rita",""],["Palanisamy","Balaji",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 00:25:49 GMT"}],"updateDate":"2024-07-19","timestamp":1721262349000,"abstract":"  Graph prompt tuning has emerged as a promising paradigm to effectively\ntransfer general graph knowledge from pre-trained models to various downstream\ntasks, particularly in few-shot contexts. However, its susceptibility to\nbackdoor attacks, where adversaries insert triggers to manipulate outcomes,\nraises a critical concern. We conduct the first study to investigate such\nvulnerability, revealing that backdoors can disguise benign graph prompts, thus\nevading detection. We introduce Krait, a novel graph prompt backdoor.\nSpecifically, we propose a simple yet effective model-agnostic metric called\nlabel non-uniformity homophily to select poisoned candidates, significantly\nreducing computational complexity. To accommodate diverse attack scenarios and\nadvanced attack types, we design three customizable trigger generation methods\nto craft prompts as triggers. We propose a novel centroid similarity-based loss\nfunction to optimize prompt tuning for attack effectiveness and stealthiness.\nExperiments on four real-world graphs demonstrate that Krait can efficiently\nembed triggers to merely 0.15% to 2% of training nodes, achieving high attack\nsuccess rates without sacrificing clean accuracy. Notably, in one-to-one and\nall-to-one attacks, Krait can achieve 100% attack success rates by poisoning as\nfew as 2 and 22 nodes, respectively. Our experiments further show that Krait\nremains potent across different transfer cases, attack types, and graph neural\nnetwork backbones. Additionally, Krait can be successfully extended to the\nblack-box setting, posing more severe threats. Finally, we analyze why Krait\ncan evade both classical and state-of-the-art defenses, and provide practical\ninsights for detecting and mitigating this class of attacks.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}