{"id":"2407.18376","title":"Exploring Bengali Religious Dialect Biases in Large Language Models with\n  Evaluation Perspectives","authors":"Azmine Toushik Wasi and Raima Islam and Mst Rafia Islam and Taki Hasan\n  Rafi and Dong-Kyu Chae","authorsParsed":[["Wasi","Azmine Toushik",""],["Islam","Raima",""],["Islam","Mst Rafia",""],["Rafi","Taki Hasan",""],["Chae","Dong-Kyu",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 20:19:29 GMT"}],"updateDate":"2024-07-29","timestamp":1721938769000,"abstract":"  While Large Language Models (LLM) have created a massive technological impact\nin the past decade, allowing for human-enabled applications, they can produce\noutput that contains stereotypes and biases, especially when using low-resource\nlanguages. This can be of great ethical concern when dealing with sensitive\ntopics such as religion. As a means toward making LLMS more fair, we explore\nbias from a religious perspective in Bengali, focusing specifically on two main\nreligious dialects: Hindu and Muslim-majority dialects. Here, we perform\ndifferent experiments and audit showing the comparative analysis of different\nsentences using three commonly used LLMs: ChatGPT, Gemini, and Microsoft\nCopilot, pertaining to the Hindu and Muslim dialects of specific words and\nshowcasing which ones catch the social biases and which do not. Furthermore, we\nanalyze our findings and relate them to potential reasons and evaluation\nperspectives, considering their global impact with over 300 million speakers\nworldwide. With this work, we hope to establish the rigor for creating more\nfairness in LLMs, as these are widely used as creative writing agents.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computation and Language","Computing Research Repository/Computers and Society","Computing Research Repository/Multimedia","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Kh58kDJxU-HXeHiGIWts-4Bc82NIGuXW2yTtpfXewy0","pdfSize":"874407"}
