{"id":"2407.03632","title":"CLASH: Complementary Learning with Neural Architecture Search for Gait\n  Recognition","authors":"Huanzhang Dou, Pengyi Zhang, Yuhan Zhao, Lu Jin, and Xi Li","authorsParsed":[["Dou","Huanzhang",""],["Zhang","Pengyi",""],["Zhao","Yuhan",""],["Jin","Lu",""],["Li","Xi",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 04:51:01 GMT"}],"updateDate":"2024-07-08","timestamp":1720068661000,"abstract":"  Gait recognition, which aims at identifying individuals by their walking\npatterns, has achieved great success based on silhouette. The binary silhouette\nsequence encodes the walking pattern within the sparse boundary representation.\nTherefore, most pixels in the silhouette are under-sensitive to the walking\npattern since the sparse boundary lacks dense spatial-temporal information,\nwhich is suitable to be represented with dense texture. To enhance the\nsensitivity to the walking pattern while maintaining the robustness of\nrecognition, we present a Complementary Learning with neural Architecture\nSearch (CLASH) framework, consisting of walking pattern sensitive gait\ndescriptor named dense spatial-temporal field (DSTF) and neural architecture\nsearch based complementary learning (NCL). Specifically, DSTF transforms the\nrepresentation from the sparse binary boundary into the dense distance-based\ntexture, which is sensitive to the walking pattern at the pixel level. Further,\nNCL presents a task-specific search space for complementary learning, which\nmutually complements the sensitivity of DSTF and the robustness of the\nsilhouette to represent the walking pattern effectively. Extensive experiments\ndemonstrate the effectiveness of the proposed methods under both in-the-lab and\nin-the-wild scenarios. On CASIA-B, we achieve rank-1 accuracy of 98.8%, 96.5%,\nand 89.3% under three conditions. On OU-MVLP, we achieve rank-1 accuracy of\n91.9%. Under the latest in-the-wild datasets, we outperform the latest\nsilhouette-based methods by 16.3% and 19.7% on Gait3D and GREW, respectively.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}