{"id":"2407.01608","title":"Deriva-ML: A Continuous FAIRness Approach to Reproducible Machine\n  Learning Models","authors":"Zhiwei Li, Carl Kesselman, Mike D'Arch, Michael Pazzani, Benjamin\n  Yizing Xu","authorsParsed":[["Li","Zhiwei",""],["Kesselman","Carl",""],["D'Arch","Mike",""],["Pazzani","Michael",""],["Xu","Benjamin Yizing",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 04:42:29 GMT"}],"updateDate":"2024-07-03","timestamp":1719463349000,"abstract":"  Increasingly, artificial intelligence (AI) and machine learning (ML) are used\nin eScience applications [9]. While these approaches have great potential, the\nliterature has shown that ML-based approaches frequently suffer from results\nthat are either incorrect or unreproducible due to mismanagement or misuse of\ndata used for training and validating the models [12, 15]. Recognition of the\nnecessity of high-quality data for correct ML results has led to data-centric\nML approaches that shift the central focus from model development to creation\nof high-quality data sets to train and validate the models [14, 20]. However,\nthere are limited tools and methods available for data-centric approaches to\nexplore and evaluate ML solutions for eScience problems which often require\ncollaborative multidisciplinary teams working with models and data that will\nrapidly evolve as an investigation unfolds [1]. In this paper, we show how data\nmanagement tools based on the principle that all of the data for ML should be\nfindable, accessible, interoperable and reusable (i.e. FAIR [26]) can\nsignificantly improve the quality of data that is used for ML applications.\nWhen combined with best practices that apply these tools to the entire life\ncycle of an ML-based eScience investigation, we can significantly improve the\nability of an eScience team to create correct and reproducible ML solutions. We\npropose an architecture and implementation of such tools and demonstrate\nthrough two use cases how they can be used to improve ML-based eScience\ninvestigations.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Databases","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}