{"id":"2407.21270","title":"Multiple sliding ferroelectricity of rhombohedral-stacked InSe for\n  reconfigurable photovoltaics and imaging applications","authors":"Qingrong Liang, Guozhong Zheng, Liu Yang, Shoujun Zheng","authorsParsed":[["Liang","Qingrong",""],["Zheng","Guozhong",""],["Yang","Liu",""],["Zheng","Shoujun",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 01:30:44 GMT"}],"updateDate":"2024-08-01","timestamp":1722389444000,"abstract":"  Through stacking engineering of two-dimensional (2D) materials, a switchable\ninterface polarization can be generated through interlayer sliding, so called\nsliding ferroelectricity, which is advantageous over the traditional\nferroelectricity due to ultra-thin thickness, high switching speed and low\nfatigue. However, 2D materials with intrinsic sliding ferroelectricity are\nstill rare, with the exception of rhombohedral-stacked MoS2, which limits\nsliding ferroelectricity for practical applications such as high-speed storage,\nphotovoltaic, and neuromorphic computing. Here, we reported the observation of\nsliding ferroelectricity with multiple states in undoped rhombohedral-stacked\nInSe ({\\gamma}-InSe) via dual-frequency resonance tracking piezoresponse force\nmicroscopy, scanning Kelvin probe microscopy and conductive atomic force\nmicroscopy. The tunable bulk photovoltaic effect via the electric field is\nachieved in the graphene/{\\gamma}-InSe/graphene tunneling device with a\nphotovoltaic current density of ~15 mA/cm2, which is attributed to the multiple\nsliding steps in {\\gamma}-InSe according to our theoretical calculations. The\nvdw tunneling device also features a high photo responsivity of ~255 A/W and a\nfast response time for real-time imaging. Our work not only enriches\nrhombohedral-stacked 2D materials for sliding ferroelectricity, but also sheds\nlight on their potential for tunable photovoltaics and imaging applications.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}