{"id":"2407.00925","title":"SIDQL: An Efficient Keyframe Extraction and Motion Reconstruction\n  Framework in Motion Capture","authors":"Xuling Zhang, Ziru Zhang, Yuyang Wang, Lik-hang Lee, Pan Hui","authorsParsed":[["Zhang","Xuling",""],["Zhang","Ziru",""],["Wang","Yuyang",""],["Lee","Lik-hang",""],["Hui","Pan",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 03:16:51 GMT"}],"updateDate":"2024-07-02","timestamp":1719803811000,"abstract":"  Metaverse, which integrates the virtual and physical worlds, has emerged as\nan innovative paradigm for changing people's lifestyles. Motion capture has\nbecome a reliable approach to achieve seamless synchronization of the movements\nbetween avatars and human beings, which plays an important role in diverse\nMetaverse applications. However, due to the continuous growth of data, current\ncommunication systems face a significant challenge of meeting the demand of\nultra-low latency during application. In addition, current methods also have\nshortcomings when selecting keyframes, e.g., relying on recognizing motion\ntypes and artificially selected keyframes. Therefore, the utilization of\nkeyframe extraction and motion reconstruction techniques could be considered a\nfeasible and promising solution. In this work, a new motion reconstruction\nalgorithm is designed in a spherical coordinate system involving location and\nvelocity information. Then, we formalize the keyframe extraction problem into\nan optimization problem to reduce the reconstruction error. Using Deep\nQ-Learning (DQL), the Spherical Interpolation based Deep Q-Learning (SIDQL)\nframework is proposed to generate proper keyframes for reconstructing the\nmotion sequences. We use the CMU database to train and evaluate the framework.\nOur scheme can significantly reduce the data volume and transmission latency\ncompared to various baselines while maintaining a reconstruction error of less\nthan 0.09 when extracting five keyframes.\n","subjects":["Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}