{"id":"2407.12647","title":"Fusion Flow-enhanced Graph Pooling Residual Networks for Unmanned Aerial\n  Vehicles Surveillance in Day and Night Dual Visions","authors":"Alam Noor, Kai Li, Eduardo Tovar, Pei Zhang, Bo Wei","authorsParsed":[["Noor","Alam",""],["Li","Kai",""],["Tovar","Eduardo",""],["Zhang","Pei",""],["Wei","Bo",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:16:23 GMT"}],"updateDate":"2024-07-18","timestamp":1721229383000,"abstract":"  Recognizing unauthorized Unmanned Aerial Vehicles (UAVs) within designated\nno-fly zones throughout the day and night is of paramount importance, where the\nunauthorized UAVs pose a substantial threat to both civil and military aviation\nsafety. However, recognizing UAVs day and night with dual-vision cameras is\nnontrivial, since red-green-blue (RGB) images suffer from a low detection rate\nunder an insufficient light condition, such as on cloudy or stormy days, while\nblack-and-white infrared (IR) images struggle to capture UAVs that overlap with\nthe background at night. In this paper, we propose a new optical flow-assisted\ngraph-pooling residual network (OF-GPRN), which significantly enhances the UAV\ndetection rate in day and night dual visions. The proposed OF-GPRN develops a\nnew optical fusion to remove superfluous backgrounds, which improves RGB/IR\nimaging clarity. Furthermore, OF-GPRN extends optical fusion by incorporating a\ngraph residual split attention network and a feature pyramid, which refines the\nperception of UAVs, leading to a higher success rate in UAV detection. A\ncomprehensive performance evaluation is conducted using a benchmark UAV catch\ndataset. The results indicate that the proposed OF-GPRN elevates the UAV mean\naverage precision (mAP) detection rate to 87.8%, marking a 17.9% advancement\ncompared to the residual graph neural network (ResGCN)-based approach.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}