{"id":"2407.01718","title":"Entropic Optimal Transport Eigenmaps for Nonlinear Alignment and Joint\n  Embedding of High-Dimensional Datasets","authors":"Boris Landa, Yuval Kluger, Rong Ma","authorsParsed":[["Landa","Boris",""],["Kluger","Yuval",""],["Ma","Rong",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:48:55 GMT"}],"updateDate":"2024-07-03","timestamp":1719859735000,"abstract":"  Embedding high-dimensional data into a low-dimensional space is an\nindispensable component of data analysis. In numerous applications, it is\nnecessary to align and jointly embed multiple datasets from different studies\nor experimental conditions. Such datasets may share underlying structures of\ninterest but exhibit individual distortions, resulting in misaligned embeddings\nusing traditional techniques. In this work, we propose \\textit{Entropic Optimal\nTransport (EOT) eigenmaps}, a principled approach for aligning and jointly\nembedding a pair of datasets with theoretical guarantees. Our approach\nleverages the leading singular vectors of the EOT plan matrix between two\ndatasets to extract their shared underlying structure and align the datasets\naccordingly in a common embedding space. We interpret our approach as an\ninter-data variant of the classical Laplacian eigenmaps and diffusion maps\nembeddings, showing that it enjoys many favorable analogous properties. We then\nanalyze a data-generative model where two observed high-dimensional datasets\nshare latent variables on a common low-dimensional manifold, but each dataset\nis subject to data-specific translation, scaling, nuisance structures, and\nnoise. We show that in a high-dimensional asymptotic regime, the EOT plan\nrecovers the shared manifold structure by approximating a kernel function\nevaluated at the locations of the latent variables. Subsequently, we provide a\ngeometric interpretation of our embedding by relating it to the eigenfunctions\nof population-level operators encoding the density and geometry of the shared\nmanifold. Finally, we showcase the performance of our approach for data\nintegration and embedding through simulations and analyses of real-world\nbiological data, demonstrating its advantages over alternative methods in\nchallenging scenarios.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}