{"id":"2407.06127","title":"Better Sampling, towards Better End-to-end Small Object Detection","authors":"Zile Huang, Chong Zhang, Mingyu Jin, Fangyu Wu, Chengzhi Liu, Xiaobo\n  Jin","authorsParsed":[["Huang","Zile",""],["Zhang","Chong",""],["Jin","Mingyu",""],["Wu","Fangyu",""],["Liu","Chengzhi",""],["Jin","Xiaobo",""]],"versions":[{"version":"v1","created":"Fri, 17 May 2024 04:37:44 GMT"}],"updateDate":"2024-07-09","timestamp":1715920664000,"abstract":"  While deep learning-based general object detection has made significant\nstrides in recent years, the effectiveness and efficiency of small object\ndetection remain unsatisfactory. This is primarily attributed not only to the\nlimited characteristics of such small targets but also to the high density and\nmutual overlap among these targets. The existing transformer-based small object\ndetectors do not leverage the gap between accuracy and inference speed. To\naddress challenges, we propose methods enhancing sampling within an end-to-end\nframework. Sample Points Refinement (SPR) constrains localization and\nattention, preserving meaningful interactions in the region of interest and\nfiltering out misleading information. Scale-aligned Target (ST) integrates\nscale information into target confidence, improving classification for small\nobject detection. A task-decoupled Sample Reweighting (SR) mechanism guides\nattention toward challenging positive examples, utilizing a weight generator\nmodule to assess the difficulty and adjust classification loss based on decoder\nlayer outcomes. Comprehensive experiments across various benchmarks reveal that\nour proposed detector excels in detecting small objects. Our model demonstrates\na significant enhancement, achieving a 2.9\\% increase in average precision (AP)\nover the state-of-the-art (SOTA) on the VisDrone dataset and a 1.7\\%\nimprovement on the SODA-D dataset.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}