{"id":"2407.01323","title":"Extending non-adiabatic rate theory to strong electronic couplings in\n  the Marcus inverted regime","authors":"Thomas P Fay","authorsParsed":[["Fay","Thomas P",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 14:29:02 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 08:14:45 GMT"}],"updateDate":"2024-07-19","timestamp":1719844142000,"abstract":"  Electron transfer reactions play an essential role in many chemical and\nbiological processes. Fermi's Golden rule, which assumes that the coupling\nbetween electronic states is small, has formed the foundation of electron\ntransfer rate theory, however in short range electron/energy transfer reactions\nthis coupling can become very large, and therefore Fermi's Golden Rule fails to\nmake even qualitatively accurate rate predictions. In this paper I present a\nsimple modified Golden Rule theory to describe electron transfer in the Marcus\ninverted regime at arbitrarily large electronic coupling strengths. The theory\nis based on an optimal global rotation of the diabatic states, which makes it\ncompatible with existing methods for calculating Golden Rule rates that can\naccount for nuclear quantum effects with anharmonic potentials. Furthermore the\nOptimal Golden Rule (OGR) theory can also combined with analytic theories for\nnon-adiabatic rates, such as Marcus theory and Marcus-Levich-Jortner theory,\noffering clear physical insight into strong electronic coupling effects in\nnon-adiabatic processes. OGR theory is also tested on a large set of spin-boson\nmodels and an anharmonic model against exact quantum dynamics calculations,\nwhere it performs well, correctly predicting rate turnover at large coupling\nstrengths. Finally, an example application to a BODIPY-Anthracene\nphotosensitizer reveals that strong coupling effects inhibit excited state\ncharge recombination in this system, reducing the rate of this process by a\nfactor of four. Overall OGR theory offers a new approach to calculating\nelectron transfer rates at strong couplings, offering new physical insight into\na range of non-adiabatic processes.\n","subjects":["Physics/Chemical Physics","Condensed Matter/Other Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/"}