{"id":"2407.00535","title":"AI-powered multimodal modeling of personalized hemodynamics in aortic\n  stenosis","authors":"Caglar Ozturk, Daniel H. Pak, Luca Rosalia, Debkalpa Goswami, Mary E.\n  Robakowski, Raymond McKay, Christopher T. Nguyen, James S. Duncan, Ellen T.\n  Roche","authorsParsed":[["Ozturk","Caglar",""],["Pak","Daniel H.",""],["Rosalia","Luca",""],["Goswami","Debkalpa",""],["Robakowski","Mary E.",""],["McKay","Raymond",""],["Nguyen","Christopher T.",""],["Duncan","James S.",""],["Roche","Ellen T.",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 21:49:45 GMT"}],"updateDate":"2024-07-02","timestamp":1719697785000,"abstract":"  Aortic stenosis (AS) is the most common valvular heart disease in developed\ncountries. High-fidelity preclinical models can improve AS management by\nenabling therapeutic innovation, early diagnosis, and tailored treatment\nplanning. However, their use is currently limited by complex workflows\nnecessitating lengthy expert-driven manual operations. Here, we propose an\nAI-powered computational framework for accelerated and democratized\npatient-specific modeling of AS hemodynamics from computed tomography. First,\nwe demonstrate that our automated meshing algorithms can generate task-ready\ngeometries for both computational and benchtop simulations with higher accuracy\nand 100 times faster than existing approaches. Then, we show that our approach\ncan be integrated with fluid-structure interaction and soft robotics models to\naccurately recapitulate a broad spectrum of clinical hemodynamic measurements\nof diverse AS patients. The efficiency and reliability of these algorithms make\nthem an ideal complementary tool for personalized high-fidelity modeling of AS\nbiomechanics, hemodynamics, and treatment planning.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}