{"id":"2407.07376","title":"Deep(er) Reconstruction of Imaging Cherenkov Detectors with Swin\n  Transformers and Normalizing Flow Models","authors":"Cristiano Fanelli, James Giroux, Justin Stevens","authorsParsed":[["Fanelli","Cristiano",""],["Giroux","James",""],["Stevens","Justin",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 05:37:02 GMT"}],"updateDate":"2024-07-11","timestamp":1720589822000,"abstract":"  Imaging Cherenkov detectors are crucial for particle identification (PID) in\nnuclear and particle physics experiments. Fast reconstruction algorithms are\nessential for near real-time alignment, calibration, data quality control, and\nefficient analysis. At the future Electron-Ion Collider (EIC), the ePIC\ndetector will feature a dual Ring Imaging Cherenkov (dual-RICH) detector in the\nhadron direction, a Detector of Internally Reflected Cherenkov (DIRC) in the\nbarrel, and a proximity focus RICH in the electron direction. This paper\nfocuses on the DIRC detector, which presents complex hit patterns and is also\nused for PID of pions and kaons in the GlueX experiment at JLab. We present\nDeep(er)RICH, an extension of the seminal DeepRICH work, offering improved and\nfaster PID compared to traditional methods and, for the first time, fast and\naccurate simulation. This advancement addresses a major bottleneck in Cherenkov\ndetector simulations involving photon tracking through complex optical\nelements. Our results leverage advancements in Vision Transformers,\nspecifically hierarchical Swin Transformer and normalizing flows. These methods\nenable direct learning from real data and the reconstruction of complex\ntopologies. We conclude by discussing the implications and future extensions of\nthis work, which can offer capabilities for PID for multiple cutting-edge\nexperiments like the future EIC.\n","subjects":["Physics/Instrumentation and Detectors","Computing Research Repository/Machine Learning","Physics/High Energy Physics - Experiment","Physics/Nuclear Experiment","Physics/Data Analysis, Statistics and Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}