{"id":"2407.17162","title":"Context-aware Multi-task Learning for Pedestrian Intent and Trajectory\n  Prediction","authors":"Farzeen Munir and Tomasz Piotr Kucner","authorsParsed":[["Munir","Farzeen",""],["Kucner","Tomasz Piotr",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 11:06:47 GMT"}],"updateDate":"2024-07-25","timestamp":1721819207000,"abstract":"  The advancement of socially-aware autonomous vehicles hinges on precise\nmodeling of human behavior. Within this broad paradigm, the specific challenge\nlies in accurately predicting pedestrian's trajectory and intention.\nTraditional methodologies have leaned heavily on historical trajectory data,\nfrequently overlooking vital contextual cues such as pedestrian-specific traits\nand environmental factors. Furthermore, there's a notable knowledge gap as\ntrajectory and intention prediction have largely been approached as separate\nproblems, despite their mutual dependence. To bridge this gap, we introduce\nPTINet (Pedestrian Trajectory and Intention Prediction Network), which jointly\nlearns the trajectory and intention prediction by combining past trajectory\nobservations, local contextual features (individual pedestrian behaviors), and\nglobal features (signs, markings etc.). The efficacy of our approach is\nevaluated on widely used public datasets: JAAD and PIE, where it has\ndemonstrated superior performance over existing state-of-the-art models in\ntrajectory and intention prediction. The results from our experiments and\nablation studies robustly validate PTINet's effectiveness in jointly exploring\nintention and trajectory prediction for pedestrian behaviour modelling. The\nexperimental evaluation indicates the advantage of using global and local\ncontextual features for pedestrian trajectory and intention prediction. The\neffectiveness of PTINet in predicting pedestrian behavior paves the way for the\ndevelopment of automated systems capable of seamlessly interacting with\npedestrians in urban settings.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}