{"id":"2407.01915","title":"Unraveling the Trigger Mechanism of Explosive Reconnection in Partially\n  Ionized Solar Plasma","authors":"Abdullah Zafar, Lei Ni, Jun Lin, Ahmad Ali","authorsParsed":[["Zafar","Abdullah",""],["Ni","Lei",""],["Lin","Jun",""],["Ali","Ahmad",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 03:26:03 GMT"}],"updateDate":"2024-07-03","timestamp":1719890763000,"abstract":"  Plasmoid instability is usually accounted for the onset of fast reconnection\nevents observed in astrophysical plasmas. However, the measured reconnection\nrate from observations can be one order of magnitude higher than that derived\nfrom MHD simulations. In this study, we present the results of magnetic\nreconnection in the partially ionized low solar atmosphere based on 2.5D\nmagnetohydrodynamics (MHD) simulations. The whole reconnection process covers\ntwo different fast reconnection phases. In the first phase, the slow\nSweet-Parker reconnection transits to the plasmoid-mediated reconnection, and\nthe reconnection rate reaches about 0.02. In the second phase, a faster\nexplosive reconnection appears, with the reconnection rate reaching above 0.06.\nAt the same time, a sharp decrease in plasma temperature and density at the\nprinciple X-point is observed which is associated with the strong radiative\ncooling, the ejection of hot plasma from the local reconnection region or the\nmotion of principle X-point from hot and denser region to cool and less dense\none along the narrow current sheet. This causes gas pressure depletion and the\nincreasing of magnetic diffusion at the main X-point, resulting in the local\nPetschek-like reconnection and a violent and rapid increase in the reconnection\nrate. This study for the first time reveals a common phenomenon that the\nplasmoid dominated reconnection transits to an explosive faster reconnection\nwith the rate approaching the order of 0.1 in partially ionized plasma in the\nMHD scale.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Plasma Physics","Physics/Space Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}