{"id":"2407.21674","title":"Synthetic Simplicity: Unveiling Bias in Medical Data Augmentation","authors":"Krishan Agyakari Raja Babu, Rachana Sathish, Mrunal Pattanaik and\n  Rahul Venkataramani","authorsParsed":[["Babu","Krishan Agyakari Raja",""],["Sathish","Rachana",""],["Pattanaik","Mrunal",""],["Venkataramani","Rahul",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:14:17 GMT"}],"updateDate":"2024-08-01","timestamp":1722438857000,"abstract":"  Synthetic data is becoming increasingly integral in data-scarce fields such\nas medical imaging, serving as a substitute for real data. However, its\ninherent statistical characteristics can significantly impact downstream tasks,\npotentially compromising deployment performance. In this study, we empirically\ninvestigate this issue and uncover a critical phenomenon: downstream neural\nnetworks often exploit spurious distinctions between real and synthetic data\nwhen there is a strong correlation between the data source and the task label.\nThis exploitation manifests as \\textit{simplicity bias}, where models overly\nrely on superficial features rather than genuine task-related complexities.\nThrough principled experiments, we demonstrate that the source of data (real\nvs.\\ synthetic) can introduce spurious correlating factors leading to poor\nperformance during deployment when the correlation is absent. We first\ndemonstrate this vulnerability on a digit classification task, where the model\nspuriously utilizes the source of data instead of the digit to provide an\ninference. We provide further evidence of this phenomenon in a medical imaging\nproblem related to cardiac view classification in echocardiograms, particularly\ndistinguishing between 2-chamber and 4-chamber views. Given the increasing role\nof utilizing synthetic datasets, we hope that our experiments serve as\neffective guidelines for the utilization of synthetic datasets in model\ntraining.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nLxFkeYaH_CrselB-sWv9p_LjY_5X3YFxsOm6c1kBwc","pdfSize":"1092582"}
