{"id":"2407.14877","title":"Background gravitational waves as signature of the adiabatic expansion\n  of a black body that represents the dark universe","authors":"Cl\\'audio Nassif Cruz and A. C. Amaro de Faria Jr","authorsParsed":[["Cruz","Cláudio Nassif",""],["Faria","A. C. Amaro de","Jr"]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 13:53:39 GMT"}],"updateDate":"2024-07-23","timestamp":1721483619000,"abstract":"  We propose a toy model of a spherical universe made up of an exotic dark gas\nwith temperature $T$ in thermal equilibrium with a black-body in adiabatic\nexpansion. Each particle of this exotic gas mimics a kind of particle of dark\nenergy represented by the vacuum energy, being quantized into virtual particles\nwith extremely small masses that form such gas representng the own tissue of\nthe expanding space-time governed by a negative pressure whose origin is the\nequation of state (EOS) of vacuum, i.e., $p=-\\rho$, where $\\rho$ is the vacuum\nenergy density. So, each vacuum particle occupies a tiny area of space\nso-called Planck area $L_p^{2}$, which represents the minimum area of the whole\nspace-time given by the spherical surface with area $4\\pi R_H^2$, where $R_H$\nis the Hubble radius. We realize that such spherical surface is the surface of\nthe black-body for representing the dark universe as if it were the surface of\nan expanding balloon. Thus, we are able to derive the law of universal\ngravitation, thus leading us to understand the cosmological anti-gravity. We\nestimate the very small order of magnitude of the cosmological constant and the\nacceleration of expansion of the dark sphere. In this toy model, as the dark\nuniverse can be thought of as a large black body, when we obtain its power and\nfrequency of emission of radiation, we find very low values. We conclude that\nsuch radiation and frequency of the black body made up of dark energy is a\nbackground gravitational wave with very low frequency in the order of\n$10^{-17}$Hz due to the slight stretching of the fabric of space-time.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"k7-HK9g9cX3cfz_62QJ-fRGEfQtEe0BRi8424RpMR2g","pdfSize":"191209"}
