{"id":"2407.15056","title":"Lexicase Selection Parameter Analysis: Varying Population Size and Test\n  Case Redundancy with Diagnostic Metrics","authors":"Jose Guadalupe Hernandez, Anil Kumar Saini, Jason H. Moore","authorsParsed":[["Hernandez","Jose Guadalupe",""],["Saini","Anil Kumar",""],["Moore","Jason H.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 04:54:27 GMT"}],"updateDate":"2024-07-23","timestamp":1721537667000,"abstract":"  Lexicase selection is a successful parent selection method in genetic\nprogramming that has outperformed other methods across multiple benchmark\nsuites. Unlike other selection methods that require explicit parameters to\nfunction, such as tournament size in tournament selection, lexicase selection\ndoes not. However, if evolutionary parameters like population size and number\nof generations affect the effectiveness of a selection method, then lexicase's\nperformance may also be impacted by these `hidden' parameters. Here, we study\nhow these hidden parameters affect lexicase's ability to exploit gradients and\nmaintain specialists using diagnostic metrics. By varying the population size\nwith a fixed evaluation budget, we show that smaller populations tend to have\ngreater exploitation capabilities, whereas larger populations tend to maintain\nmore specialists. We also consider the effect redundant test cases have on\nspecialist maintenance, and find that high redundancy may hinder the ability to\noptimize and maintain specialists, even for larger populations. Ultimately, we\nhighlight that population size, evaluation budget, and test cases must be\ncarefully considered for the characteristics of the problem being solved.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SVAb_UVYEV2ocCiP-38FoaJMKvUqdLIVXaeAAvO9aQI","pdfSize":"1460514","objectId":"0x4888c9235c9d9237d5ba73eb29e2b985ec7e6b3abb7b13e698cac5d8221abc0f","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
