{"id":"2407.04217","title":"An Interactive Multi-modal Query Answering System with\n  Retrieval-Augmented Large Language Models","authors":"Mengzhao Wang, Haotian Wu, Xiangyu Ke, Yunjun Gao, Xiaoliang Xu, Lu\n  Chen","authorsParsed":[["Wang","Mengzhao",""],["Wu","Haotian",""],["Ke","Xiangyu",""],["Gao","Yunjun",""],["Xu","Xiaoliang",""],["Chen","Lu",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 02:01:49 GMT"}],"updateDate":"2024-07-08","timestamp":1720144909000,"abstract":"  Retrieval-augmented Large Language Models (LLMs) have reshaped traditional\nquery-answering systems, offering unparalleled user experiences. However,\nexisting retrieval techniques often struggle to handle multi-modal query\ncontexts. In this paper, we present an interactive Multi-modal Query Answering\n(MQA) system, empowered by our newly developed multi-modal retrieval framework\nand navigation graph index, integrated with cutting-edge LLMs. It comprises\nfive core components: Data Preprocessing, Vector Representation, Index\nConstruction, Query Execution, and Answer Generation, all orchestrated by a\ndedicated coordinator to ensure smooth data flow from input to answer\ngeneration. One notable aspect of MQA is its utilization of contrastive\nlearning to assess the significance of different modalities, facilitating\nprecise measurement of multi-modal information similarity. Furthermore, the\nsystem achieves efficient retrieval through our advanced navigation graph\nindex, refined using computational pruning techniques. Another highlight of our\nsystem is its pluggable processing framework, allowing seamless integration of\nembedding models, graph indexes, and LLMs. This flexibility provides users\ndiverse options for gaining insights from their multi-modal knowledge base. A\npreliminary video introduction of MQA is available at\nhttps://youtu.be/xvUuo2ZIqWk.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}