{"id":"2407.08133","title":"Nonverbal Interaction Detection","authors":"Jianan Wei, Tianfei Zhou, Yi Yang, Wenguan Wang","authorsParsed":[["Wei","Jianan",""],["Zhou","Tianfei",""],["Yang","Yi",""],["Wang","Wenguan",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 02:14:06 GMT"},{"version":"v2","created":"Sun, 14 Jul 2024 13:33:57 GMT"}],"updateDate":"2024-07-16","timestamp":1720664046000,"abstract":"  This work addresses a new challenge of understanding human nonverbal\ninteraction in social contexts. Nonverbal signals pervade virtually every\ncommunicative act. Our gestures, facial expressions, postures, gaze, even\nphysical appearance all convey messages, without anything being said. Despite\ntheir critical role in social life, nonverbal signals receive very limited\nattention as compared to the linguistic counterparts, and existing solutions\ntypically examine nonverbal cues in isolation. Our study marks the first\nsystematic effort to enhance the interpretation of multifaceted nonverbal\nsignals. First, we contribute a novel large-scale dataset, called NVI, which is\nmeticulously annotated to include bounding boxes for humans and corresponding\nsocial groups, along with 22 atomic-level nonverbal behaviors under five broad\ninteraction types. Second, we establish a new task NVI-DET for nonverbal\ninteraction detection, which is formalized as identifying triplets in the form\n<individual, group, interaction> from images. Third, we propose a nonverbal\ninteraction detection hypergraph (NVI-DEHR), a new approach that explicitly\nmodels high-order nonverbal interactions using hypergraphs. Central to the\nmodel is a dual multi-scale hypergraph that adeptly addresses\nindividual-to-individual and group-to-group correlations across varying scales,\nfacilitating interactional feature learning and eventually improving\ninteraction prediction. Extensive experiments on NVI show that NVI-DEHR\nimproves various baselines significantly in NVI-DET. It also exhibits leading\nperformance on HOI-DET, confirming its versatility in supporting related tasks\nand strong generalization ability. We hope that our study will offer the\ncommunity new avenues to explore nonverbal signals in more depth.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}