{"id":"2407.10348","title":"Addressing Class Imbalance and Data Limitations in Advanced Node\n  Semiconductor Defect Inspection: A Generative Approach for SEM Images","authors":"Bappaditya Dey, Vic De Ridder, Victor Blanco, Sandip Halder, Bartel\n  Van Waeyenberge","authorsParsed":[["Dey","Bappaditya",""],["De Ridder","Vic",""],["Blanco","Victor",""],["Halder","Sandip",""],["Van Waeyenberge","Bartel",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 22:25:05 GMT"}],"updateDate":"2024-07-16","timestamp":1720995905000,"abstract":"  Precision in identifying nanometer-scale device-killer defects is crucial in\nboth semiconductor research and development as well as in production processes.\nThe effectiveness of existing ML-based approaches in this context is largely\nlimited by the scarcity of data, as the production of real semiconductor wafer\ndata for training these models involves high financial and time costs.\nMoreover, the existing simulation methods fall short of replicating images with\nidentical noise characteristics, surface roughness and stochastic variations at\nadvanced nodes. We propose a method for generating synthetic semiconductor SEM\nimages using a diffusion model within a limited data regime. In contrast to\nimages generated through conventional simulation methods, SEM images generated\nthrough our proposed DL method closely resemble real SEM images, replicating\ntheir noise characteristics and surface roughness adaptively. Our main\ncontributions, which are validated on three different real semiconductor\ndatasets, are: i) proposing a patch-based generative framework utilizing DDPM\nto create SEM images with intended defect classes, addressing challenges\nrelated to class-imbalance and data insufficiency, ii) demonstrating generated\nsynthetic images closely resemble real SEM images acquired from the tool,\npreserving all imaging conditions and metrology characteristics without any\nmetadata supervision, iii) demonstrating a defect detector trained on generated\ndefect dataset, either independently or combined with a limited real dataset,\ncan achieve similar or improved performance on real wafer SEM images during\nvalidation/testing compared to exclusive training on a real defect dataset, iv)\ndemonstrating the ability of the proposed approach to transfer defect types,\ncritical dimensions, and imaging conditions from one specified CD/Pitch and\nmetrology specifications to another, thereby highlighting its versatility.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}