{"id":"2407.07350","title":"Long-Term Fairness in Sequential Multi-Agent Selection with Positive\n  Reinforcement","authors":"Bhagyashree Puranik, Ozgur Guldogan, Upamanyu Madhow, Ramtin Pedarsani","authorsParsed":[["Puranik","Bhagyashree",""],["Guldogan","Ozgur",""],["Madhow","Upamanyu",""],["Pedarsani","Ramtin",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 04:03:23 GMT"}],"updateDate":"2024-07-11","timestamp":1720584203000,"abstract":"  While much of the rapidly growing literature on fair decision-making focuses\non metrics for one-shot decisions, recent work has raised the intriguing\npossibility of designing sequential decision-making to positively impact\nlong-term social fairness. In selection processes such as college admissions or\nhiring, biasing slightly towards applicants from under-represented groups is\nhypothesized to provide positive feedback that increases the pool of\nunder-represented applicants in future selection rounds, thus enhancing\nfairness in the long term. In this paper, we examine this hypothesis and its\nconsequences in a setting in which multiple agents are selecting from a common\npool of applicants. We propose the Multi-agent Fair-Greedy policy, that\nbalances greedy score maximization and fairness. Under this policy, we prove\nthat the resource pool and the admissions converge to a long-term fairness\ntarget set by the agents when the score distributions across the groups in the\npopulation are identical. We provide empirical evidence of existence of\nequilibria under non-identical score distributions through synthetic and\nadapted real-world datasets. We then sound a cautionary note for more complex\napplicant pool evolution models, under which uncoordinated behavior by the\nagents can cause negative reinforcement, leading to a reduction in the fraction\nof under-represented applicants. Our results indicate that, while positive\nreinforcement is a promising mechanism for long-term fairness, policies must be\ndesigned carefully to be robust to variations in the evolution model, with a\nnumber of open issues that remain to be explored by algorithm designers, social\nscientists, and policymakers.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}