{"id":"2407.21548","title":"Blind and robust estimation of adaptive optics point spread function and\n  diffuse halo with sharp-edged objects","authors":"Anthony Berdeu (LESIA, NARIT)","authorsParsed":[["Berdeu","Anthony","","LESIA, NARIT"]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 12:11:41 GMT"}],"updateDate":"2024-08-01","timestamp":1722427901000,"abstract":"  Context . Initially designed to detect and characterise exoplanets, extreme\nadaptive optics (AO) systems open a new window onto the Solar System by\nresolving its small bodies. Nonetheless, their study remains limited by the\naccuracy of the knowledge of the AO-corrected point spread function (AO-PSF)\nthat degrades their image and produces a bright halo, potentially hiding faint\nmoons in their close vicinity. Aims . To overcome the random nature of AO-PSFs,\nI aim to develop a method that blindly recovers the PSF and its faint\nstructured extensions directly into the data of interest, without any prior on\nthe instrument or the object's shape. The objectives are both to deconvolve the\nobject and to properly estimate and remove its surrounding halo to highlight\npotential faint companions. Methods . My method first estimated the PSF core\nvia a parametric model fit, under the assumption of a sharp-edged flat object.\nThen, the resolved object and the PSF extensions were alternatively deconvolved\nwith a robust method, insensitive to model outliers, such as cosmic rays or\nunresolved moons. Finally, the complex halo produced by the AO system was\nmodelled and removed from the data. Results . The method is validated on\nrealistic simulations with an on-sky AO-PSF from the SPHERE/ZIMPOL instrument.\nOn real data, the proposed blind deconvolution algorithm strongly improves the\nimage sharpness and retrieves details on the surface of asteroids. In addition,\ntheir moons are visible in all tested epochs despite important variability in\nturbulence conditions. Conclusions . My method shows the feasibility of\nretrieving the complex features of AO-PSFs directly from the data of interest.\nIt paves the way towards more precise studies of asteroid surfaces and the\ndiscovery and characterisation of Solar System moons in archival data or with\nfuture instruments on extremely large telescopes with ever more complex\nAO-PSFs.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}