{"id":"2407.16483","title":"Joint Resource-Power Allocation and UE Rank Selection in Multi-User MIMO\n  Systems with Linear Transceivers","authors":"K. Pavan Srinath, Alix Jeannerot, and Alvaro Valcarce Rial","authorsParsed":[["Srinath","K. Pavan",""],["Jeannerot","Alix",""],["Rial","Alvaro Valcarce",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 13:56:42 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 10:25:41 GMT"}],"updateDate":"2024-08-02","timestamp":1721743002000,"abstract":"  Next-generation wireless networks aim to deliver data speeds much faster than\n5G. This requires base stations with lots of antennas and a large operating\nbandwidth. These advanced base stations are expected to serve several\nmultiantenna user-equipment (UEs) simultaneously on the same time-frequency\nresources on both the uplink and the downlink. The UE data rates are affected\nby the following three main factors: UE rank, which refers to the number of\ndata layers used by each UE, UE frequency allocation, which refers to the\nassignment of slices of the overall frequency band to use for each UE in an\northogonal frequency-division multiplexing (OFDM) system, and UE power\nallocation/control, which refers to the allocation of power by the base station\nfor data transmission to each UE on the downlink or the power used by each UE\nto send data on the uplink. Since multiple UEs are to be simultaneously served,\nthe type of precoder used for downlink transmission and the type of receiver\nused for uplink reception predominantly influence these three aforementioned\nfactors and the resulting overall UE throughput. This paper addresses the\nproblem of jointly selecting these three parameters specifically when\nzero-forcing (ZF) precoders are used for downlink transmission and linear\nminimum mean square error (LMMSE) receivers are employed for uplink reception.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}