{"id":"2407.06767","title":"Enhancing Robustness and Security in ISAC Network Design: Leveraging\n  Transmissive Reconfigurable Intelligent Surface with RSMA","authors":"Ziwei Liu, Wen Chen, Qingqing Wu, Zhendong Li, Xusheng Zhu, Qiong Wu,\n  and Nan Cheng","authorsParsed":[["Liu","Ziwei",""],["Chen","Wen",""],["Wu","Qingqing",""],["Li","Zhendong",""],["Zhu","Xusheng",""],["Wu","Qiong",""],["Cheng","Nan",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 11:35:02 GMT"}],"updateDate":"2024-07-10","timestamp":1720524902000,"abstract":"  In this paper, we propose a novel transmissive reconfigurable intelligent\nsurface transceiver-enhanced robust and secure integrated sensing and\ncommunication network. A time-division sensing communication mechanism is\ndesigned for the scenario, which enables communication and sensing to share\nwireless resources. To address the interference management problem and hinder\neavesdropping, we implement rate-splitting multiple access (RSMA), where the\ncommon stream is designed as a useful signal and an artificial noise, while\ntaking into account the imperfect channel state information and modeling the\nchannel for the illegal users in a fine-grained manner as well as giving an\nupper bound on the error. We introduce the secrecy outage probability and\nconstruct an optimization problem with secrecy sum-rate as the objective\nfunctions to optimize the common stream beamforming matrix, the private stream\nbeamforming matrix and the timeslot duration variable. Due to the coupling of\nthe optimization variables and the infinity of the error set, the proposed\nproblem is a nonconvex optimization problem that cannot be solved directly. In\norder to address the above challenges, the block coordinate descent-based\nsecond-order cone programming algorithm is used to decouple the optimization\nvariables and solving the problem. Specifically, the problem is decoupled into\ntwo subproblems concerning the common stream beamforming matrix, the private\nstream beamforming matrix, and the timeslot duration variable, which are solved\nby alternating optimization until convergence is reached. To solve the problem,\nS-procedure, Bernstein's inequality and successive convex approximation are\nemployed to deal with the objective function and non-convex constraints.\nNumerical simulation results verify the superiority of the proposed scheme in\nimproving the secrecy energy efficiency and the Cram\\'{e}r-Rao boundary.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}