{"id":"2407.15181","title":"Compliant Lattice Modulations Enable Anomalous Elasticity in Ni-Mn-Ga\n  Martensite","authors":"Krist\\'yna Rep\\v{c}ek (1), Pavla Stoklasov\\'a (1), Tom\\'a\\v{s} Grabec\n  (1), Petr Sedl\\'ak (1), Juraj Olej\\v{n}\\'ak (2), Mariia Vinogradova (3),\n  Alexei Sozinov (3), Petr Ve\\v{r}t\\'at (4), Ladislav Straka (4), Oleg Heczko\n  (4), Hanu\\v{s} Seiner (1) ((1) Institute of Thermomechanics, Czech Academy of\n  Sciences, Prague, (2) Faculty of Nuclear Sciences and Physical Engineering,\n  Czech Technical University in Prague, (3) Material Physics Laboratory,\n  Lappeenranta-Lahti University of Technology (LUT), Lappeenranta, (4) FZU -\n  Institute of Physics, Czech Academy of Sciences, Prague)","authorsParsed":[["Repček","Kristýna",""],["Stoklasová","Pavla",""],["Grabec","Tomáš",""],["Sedlák","Petr",""],["Olejňák","Juraj",""],["Vinogradova","Mariia",""],["Sozinov","Alexei",""],["Veřtát","Petr",""],["Straka","Ladislav",""],["Heczko","Oleg",""],["Seiner","Hanuš",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 14:41:44 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 09:56:01 GMT"}],"updateDate":"2024-08-01","timestamp":1721572904000,"abstract":"  High mobility of twin boundaries in modulated martensites of Ni-Mn-Ga-based\nferromagnetic shape memory alloys holds a promise for unique magnetomechanical\napplications. This feature has not been fully understood so far, and in\nparticular it has yet not been unveiled what makes the lattice mechanics of\nmodulated Ni-Mn-Ga specifically different from other martensitic alloys. Here,\nresults of dedicated laser-ultrasonic measurements on hierarchically twinned\nfive-layer modulated (10 M) crystals fill this gap. Using a combination of\ntransient grating spectroscopy and laser-baser resonant ultrasound\nspectroscopy, it is confirmed that there is a shear elastic instability in the\nlattice, being significantly stronger than in any other martensitic material\nand also than what the first-principles calculations for Ni-Mn-Ga predict. The\nexperimental results reveal that the instability is directly related to the\nlattice modulations. A lattice-scale mechanism of dynamic faulting of the\nmodulation sequence that explains this behavior is proposed; this mechanism can\nexplain the extraordinary mobility of twin boundaries in 10 M.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}