{"id":"2407.09602","title":"Real-time gravitational-wave inference for binary neutron stars using\n  machine learning","authors":"Maximilian Dax, Stephen R. Green, Jonathan Gair, Nihar Gupte, Michael\n  P\\\"urrer, Vivien Raymond, Jonas Wildberger, Jakob H. Macke, Alessandra\n  Buonanno, Bernhard Sch\\\"olkopf","authorsParsed":[["Dax","Maximilian",""],["Green","Stephen R.",""],["Gair","Jonathan",""],["Gupte","Nihar",""],["Pürrer","Michael",""],["Raymond","Vivien",""],["Wildberger","Jonas",""],["Macke","Jakob H.",""],["Buonanno","Alessandra",""],["Schölkopf","Bernhard",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 18:00:02 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 13:00:54 GMT"}],"updateDate":"2024-08-05","timestamp":1720807202000,"abstract":"  Mergers of binary neutron stars (BNSs) emit signals in both the\ngravitational-wave (GW) and electromagnetic (EM) spectra. Famously, the 2017\nmulti-messenger observation of GW170817 led to scientific discoveries across\ncosmology, nuclear physics, and gravity. Central to these results were the sky\nlocalization and distance obtained from GW data, which, in the case of\nGW170817, helped to identify the associated EM transient, AT 2017gfo, 11 hours\nafter the GW signal. Fast analysis of GW data is critical for directing\ntime-sensitive EM observations; however, due to challenges arising from the\nlength and complexity of signals, it is often necessary to make approximations\nthat sacrifice accuracy. Here, we present a machine learning framework that\nperforms complete BNS inference in just one second without making any such\napproximations. Our approach enhances multi-messenger observations by providing\n(i) accurate localization even before the merger; (ii) improved localization\nprecision by $\\sim30\\%$ compared to approximate low-latency methods; and (iii)\ndetailed information on luminosity distance, inclination, and masses, which can\nbe used to prioritize expensive telescope time. Additionally, the flexibility\nand reduced cost of our method open new opportunities for equation-of-state\nstudies. Finally, we demonstrate that our method scales to extremely long\nsignals, up to an hour in length, thus serving as a blueprint for data analysis\nfor next-generation ground- and space-based detectors.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Instrumentation and Methods for Astrophysics","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}