{"id":"2407.12894","title":"Maintenance Strategies for Sewer Pipes with Multi-State Degradation and\n  Deep Reinforcement Learning","authors":"Lisandro A. Jimenez-Roa, Thiago D. Sim\\~ao, Zaharah Bukhsh, Tiedo\n  Tinga, Hajo Molegraaf, Nils Jansen, Marielle Stoelinga","authorsParsed":[["Jimenez-Roa","Lisandro A.",""],["Simão","Thiago D.",""],["Bukhsh","Zaharah",""],["Tinga","Tiedo",""],["Molegraaf","Hajo",""],["Jansen","Nils",""],["Stoelinga","Marielle",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 12:07:07 GMT"}],"updateDate":"2024-07-19","timestamp":1721218027000,"abstract":"  Large-scale infrastructure systems are crucial for societal welfare, and\ntheir effective management requires strategic forecasting and intervention\nmethods that account for various complexities. Our study addresses two\nchallenges within the Prognostics and Health Management (PHM) framework applied\nto sewer assets: modeling pipe degradation across severity levels and\ndeveloping effective maintenance policies. We employ Multi-State Degradation\nModels (MSDM) to represent the stochastic degradation process in sewer pipes\nand use Deep Reinforcement Learning (DRL) to devise maintenance strategies. A\ncase study of a Dutch sewer network exemplifies our methodology. Our findings\ndemonstrate the model's effectiveness in generating intelligent, cost-saving\nmaintenance strategies that surpass heuristics. It adapts its management\nstrategy based on the pipe's age, opting for a passive approach for newer pipes\nand transitioning to active strategies for older ones to prevent failures and\nreduce costs. This research highlights DRL's potential in optimizing\nmaintenance policies. Future research will aim improve the model by\nincorporating partial observability, exploring various reinforcement learning\nalgorithms, and extending this methodology to comprehensive infrastructure\nmanagement.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}