{"id":"2407.03204","title":"Expressive Gaussian Human Avatars from Monocular RGB Video","authors":"Hezhen Hu and Zhiwen Fan and Tianhao Wu and Yihan Xi and Seoyoung Lee\n  and Georgios Pavlakos and Zhangyang Wang","authorsParsed":[["Hu","Hezhen",""],["Fan","Zhiwen",""],["Wu","Tianhao",""],["Xi","Yihan",""],["Lee","Seoyoung",""],["Pavlakos","Georgios",""],["Wang","Zhangyang",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 15:36:27 GMT"}],"updateDate":"2024-07-04","timestamp":1720020987000,"abstract":"  Nuanced expressiveness, particularly through fine-grained hand and facial\nexpressions, is pivotal for enhancing the realism and vitality of digital human\nrepresentations. In this work, we focus on investigating the expressiveness of\nhuman avatars when learned from monocular RGB video; a setting that introduces\nnew challenges in capturing and animating fine-grained details. To this end, we\nintroduce EVA, a drivable human model that meticulously sculpts fine details\nbased on 3D Gaussians and SMPL-X, an expressive parametric human model. Focused\non enhancing expressiveness, our work makes three key contributions. First, we\nhighlight the critical importance of aligning the SMPL-X model with RGB frames\nfor effective avatar learning. Recognizing the limitations of current SMPL-X\nprediction methods for in-the-wild videos, we introduce a plug-and-play module\nthat significantly ameliorates misalignment issues. Second, we propose a\ncontext-aware adaptive density control strategy, which is adaptively adjusting\nthe gradient thresholds to accommodate the varied granularity across body\nparts. Last but not least, we develop a feedback mechanism that predicts\nper-pixel confidence to better guide the learning of 3D Gaussians. Extensive\nexperiments on two benchmarks demonstrate the superiority of our framework both\nquantitatively and qualitatively, especially on the fine-grained hand and\nfacial details. See the project website at \\url{https://evahuman.github.io}\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}