{"id":"2407.08925","title":"Commissioning of a compact multibend achromat lattice: A new 3 GeV\n  synchrotron radiation facility","authors":"Shuhei Obara, Kota Ueshima, Takao Asaka, Yuji Hosaka, Koichi Kan,\n  Nobuyuki Nishimori, Toshitaka Aoki, Hiroyuki Asano, Koichi Haga, Yuto Iba,\n  Akira Ihara, Katsumasa Ito, Taiki Iwashita, Masaya Kadowaki, Rento Kanahama,\n  Hajime Kobayashi, Hideki Kobayashi, Hideo Nishihara, Masaaki Nishikawa,\n  Haruhiko Oikawa, Ryota Saida, Keisuke Sakuraba, Kento Sugimoto, Masahiro\n  Suzuki, Kouki Takahashi, Shunya Takahashi, Tatsuki Tanaka, Tsubasa\n  Tsuchiyama, Risa Yoshioka, Tsuyoshi Aoki, Hideki Dewa, Takahiro Fujita,\n  Morihiro Kawase, Akio Kiyomich, Takashi Hamano, Mitsuhiro Masaki, Takemasa\n  Masuda, Shinichi Matsubara, Kensuke Okada, Choji Saji, Tsutomu Taniuchi,\n  Yukiko Taniuchi, Yosuke Ueda, Hiroshi Yamaguchi, Kenichi Yanagida, Kenji\n  Fukami, Naoyasu Hosoda, Miho Ishii, Toshiro Itoga, Eito Iwai, Tamotsu Magome,\n  Masaya Oishi, Takashi Ohshima, Chikara Kondo, Tatsuyuki Sakurai, Masazumi\n  Shoji, Takashi Sugimoto, Shiro Takano, Kazuhiro Tamura, Takahiro Watanabe,\n  Takato Tomai, Noriyoshi Azumi, Takahiro Inagaki, Hirokazu Maesaka, Sunao\n  Takahashi, Takashi Tanaka, Shinobu Inoue, Hirosuke Kumazawa, Kazuki Moriya,\n  Kohei Sakai, Toshio Seno, Hiroshi Sumitomo, Ryoichi Takesako, Shinichiro\n  Tanaka, Ryo Yamamoto, Kazutoshi Yokomachi, Masamichi Yoshioka, Toru Hara,\n  Sakuo Matsui, Toshihiko Hiraiwa, Hitoshi Tanaka, Hiroyasu Ego","authorsParsed":[["Obara","Shuhei",""],["Ueshima","Kota",""],["Asaka","Takao",""],["Hosaka","Yuji",""],["Kan","Koichi",""],["Nishimori","Nobuyuki",""],["Aoki","Toshitaka",""],["Asano","Hiroyuki",""],["Haga","Koichi",""],["Iba","Yuto",""],["Ihara","Akira",""],["Ito","Katsumasa",""],["Iwashita","Taiki",""],["Kadowaki","Masaya",""],["Kanahama","Rento",""],["Kobayashi","Hajime",""],["Kobayashi","Hideki",""],["Nishihara","Hideo",""],["Nishikawa","Masaaki",""],["Oikawa","Haruhiko",""],["Saida","Ryota",""],["Sakuraba","Keisuke",""],["Sugimoto","Kento",""],["Suzuki","Masahiro",""],["Takahashi","Kouki",""],["Takahashi","Shunya",""],["Tanaka","Tatsuki",""],["Tsuchiyama","Tsubasa",""],["Yoshioka","Risa",""],["Aoki","Tsuyoshi",""],["Dewa","Hideki",""],["Fujita","Takahiro",""],["Kawase","Morihiro",""],["Kiyomich","Akio",""],["Hamano","Takashi",""],["Masaki","Mitsuhiro",""],["Masuda","Takemasa",""],["Matsubara","Shinichi",""],["Okada","Kensuke",""],["Saji","Choji",""],["Taniuchi","Tsutomu",""],["Taniuchi","Yukiko",""],["Ueda","Yosuke",""],["Yamaguchi","Hiroshi",""],["Yanagida","Kenichi",""],["Fukami","Kenji",""],["Hosoda","Naoyasu",""],["Ishii","Miho",""],["Itoga","Toshiro",""],["Iwai","Eito",""],["Magome","Tamotsu",""],["Oishi","Masaya",""],["Ohshima","Takashi",""],["Kondo","Chikara",""],["Sakurai","Tatsuyuki",""],["Shoji","Masazumi",""],["Sugimoto","Takashi",""],["Takano","Shiro",""],["Tamura","Kazuhiro",""],["Watanabe","Takahiro",""],["Tomai","Takato",""],["Azumi","Noriyoshi",""],["Inagaki","Takahiro",""],["Maesaka","Hirokazu",""],["Takahashi","Sunao",""],["Tanaka","Takashi",""],["Inoue","Shinobu",""],["Kumazawa","Hirosuke",""],["Moriya","Kazuki",""],["Sakai","Kohei",""],["Seno","Toshio",""],["Sumitomo","Hiroshi",""],["Takesako","Ryoichi",""],["Tanaka","Shinichiro",""],["Yamamoto","Ryo",""],["Yokomachi","Kazutoshi",""],["Yoshioka","Masamichi",""],["Hara","Toru",""],["Matsui","Sakuo",""],["Hiraiwa","Toshihiko",""],["Tanaka","Hitoshi",""],["Ego","Hiroyasu",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 02:17:31 GMT"}],"updateDate":"2024-07-15","timestamp":1720750651000,"abstract":"  NanoTerasu, a new 3 GeV synchrotron light source in Japan, began user\noperation in April 2024. It provides high-brilliance soft to tender X-rays and\ncovers a wide spectral range from ultraviolet to tender X-rays. Its compact\nstorage ring with a circumference of 349 m is based on a four-bend achromat\nlattice to provide two straight sections in each cell for insertion devices\nwith a natural horizontal emittance of 1.14 nm rad, which is small enough for\nsoft X-rays users. The NanoTerasu accelerator incorporates several innovative\ntechnologies, including a full-energy injector C-band linear accelerator with a\nlength of 110 m, an in-vacuum off-axis injection system, a four-bend achromat\nwith B-Q combined bending magnets, and a TM020 mode accelerating cavity with\nbuilt-in higher-order-mode dampers in the storage ring. This paper presents the\naccelerator machine commissioning over a half-year period and our\nmodel-consistent ring optics correction. The first user operation with a stored\nbeam current of 160 mA is also reported. We summarize the storage ring\nparameters obtained from the commissioning. This is helpful for estimating the\neffective optical properties of synchrotron radiation at NanoTerasu.\n","subjects":["Physics/Accelerator Physics","Physics/High Energy Physics - Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}