{"id":"2407.11724","title":"Compressive Electron Backscatter Diffraction Imaging","authors":"Zo\\\"e Broad, Alex W. Robinson, Jack Wells, Daniel Nicholls, Amirafshar\n  Moshtaghpour, Angus I. Kirkland, Nigel D. Browning","authorsParsed":[["Broad","Zoë",""],["Robinson","Alex W.",""],["Wells","Jack",""],["Nicholls","Daniel",""],["Moshtaghpour","Amirafshar",""],["Kirkland","Angus I.",""],["Browning","Nigel D.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 13:43:08 GMT"}],"updateDate":"2024-07-17","timestamp":1721137388000,"abstract":"  Electron backscatter diffraction (EBSD) has developed over the last few\ndecades into a valuable crystallographic characterisation method for a wide\nrange of sample types. Despite these advances, issues such as the complexity of\nsample preparation, relatively slow acquisition, and damage in beam-sensitive\nsamples, still limit the quantity and quality of interpretable data that can be\nobtained. To mitigate these issues, here we propose a method based on the\nsubsampling of probe positions and subsequent reconstruction of an incomplete\ndataset. The missing probe locations (or pixels in the image) are recovered via\nan inpainting process using a dictionary-learning based method called\nbeta-process factor analysis (BPFA). To investigate the robustness of both our\ninpainting method and Hough-based indexing, we simulate subsampled and noisy\nEBSD datasets from a real fully sampled Ni-superalloy dataset for different\nsubsampling ratios of probe positions using both Gaussian and Poisson noise\nmodels. We find that zero solution pixel detection (inpainting un-indexed\npixels) enables higher quality reconstructions to be obtained. Numerical tests\nconfirm high quality reconstruction of band contrast and inverse pole figure\nmaps from only 10% of the probe positions, with the potential to reduce this to\n5% if only inverse pole figure maps are needed. These results show the\npotential application of this method in EBSD, allowing for faster analysis and\nextending the use of this technique to beam sensitive materials.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}