{"id":"2407.09769","title":"Coronal magnetic field and emission properties of small-scale bright and\n  faint loops in the quiet Sun","authors":"Maria S. Madjarska, Thomas Wiegelmann, Pascal D\\'emoulin, Klaus\n  Galsgaard","authorsParsed":[["Madjarska","Maria S.",""],["Wiegelmann","Thomas",""],["Démoulin","Pascal",""],["Galsgaard","Klaus",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 04:28:16 GMT"}],"updateDate":"2024-07-16","timestamp":1720844896000,"abstract":"  The present study provides statistical information on the coronal magnetic\nfield and intensity properties of small-scale bright and faint loops in the\nquiet Sun. We aim to quantitatively investigate the morphological and\ntopological properties of the coronal magnetic field in bright and faint\nsmall-scale loops, with the former known as coronal bright points (CBPs). We\nanalyse 126 small-scale loops using quasi-temporal imaging and line-of-sight\nmagnetic field observations. We employ a recently developed automatic tool that\nuses a linear magneto-hydro-static model to compute the magnetic field in the\nsolar atmosphere and automatically match individual magnetic field lines with\nsmall-scale loops. For most of the loops, we automatically obtain an excellent\nagreement of the magnetic field lines from the LMHS model and the loops seen in\nAIA 193 A. One stand-out result is that the magnetic field is non-potential. We\nobtain the typical ranges of loop heights, lengths, intensities, mean magnetic\nfield strength along the loops and at loop tops, and magnetic field strength at\nloop footpoints. We find that loops below the classic chromospheric height of\n1.5 Mm are flatter suggesting that non-magnetic forces (one of which is the\nplasma pressure) play an important role below this height. We find a strong\ncorrelation (Pearson coefficient of 0.9) between loop heights and lengths. The\naverage intensity along the loops correlates stronger with the average magnetic\nfield along the loops than with the field strength at loop tops. The latter\ncorrelation indicates that the energy release in the loops is more likely\nlinked to the average magnetic field along the loops than the field strength on\nthe loop tops. In other words, the energy is probably released all along the\nloops, but not just at the loop top. This result is consistent with the recent\nbenchmarking radiative 3D MHD model of N\\'obrega-Siberio etal.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NKYH6SHGC-lQilIpXWtIgOaXjHpF_MxkGehbXxITxAg","pdfSize":"9393823"}
