{"id":"2407.13453","title":"A uniquely solvable and positivity-preserving finite difference scheme\n  for the Flory-Huggins-Cahn-Hilliard equation with dynamical boundary\n  condition","authors":"Yunzhuo Guo, Cheng Wang, Steven M. Wise, Zhengru Zhang","authorsParsed":[["Guo","Yunzhuo",""],["Wang","Cheng",""],["Wise","Steven M.",""],["Zhang","Zhengru",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 12:31:20 GMT"}],"updateDate":"2024-07-19","timestamp":1721305880000,"abstract":"  In this paper we propose and analyze a finite difference numerical scheme for\nthe Flory-Huggins-Cahn-Hilliard equation with dynamical boundary condition. The\nsingular logarithmic potential is included in the Flory-Huggins energy\nexpansion. Meanwhile, a dynamical evolution equation for the boundary profile\ncorresponds to a lower-dimensional singular energy potential. In turn, a\ntheoretical analysis for the coupled system becomes very challenging, since it\ncontains nonlinear and singular energy potentials for both the interior region\nand on the boundary. In the numerical design, a convex splitting approach is\napplied to the chemical potential associated with the energy both at the\ninterior region and on the boundary: implicit treatments for the singular and\nlogarithmic terms, as well as the surface diffusion terms, combined with an\nexplicit treatment for the concave expansive term. In addition, the discrete\nboundary condition for the phase variable is coupled with the evolutionary\nequation of the boundary profile. The resulting numerical system turns out to\nbe highly nonlinear, singular and coupled. A careful finite difference\napproximation and convexity analysis reveals that such a numerical system could\nbe represented as a minimization of a discrete numerical energy functional,\nwhich contains both the interior and boundary integrals. More importantly, all\nthe singular terms correspond to a discrete convex functional. As a result, a\nunique solvability and positivity-preserving analysis could be theoretically\njustified, based on the subtle fact that the singular nature of the logarithmic\nterms around the singular limit values prevent the numerical solutions reaching\nthese values. The total energy stability analysis could be established by a\ncareful estimate over the finite difference inner product. Some numerical\nresults are presented in this article.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"00JoGWU2rDGRdZN7ItOFdgSB3jR_Sm-ojAgEEtDQWHI","pdfSize":"982014"}
