{"id":"2407.09524","title":"Geometric Understanding of Discriminability and Transferability for\n  Visual Domain Adaptation","authors":"You-Wei Luo, Chuan-Xian Ren, Xiao-Lin Xu, Qingshan Liu","authorsParsed":[["Luo","You-Wei",""],["Ren","Chuan-Xian",""],["Xu","Xiao-Lin",""],["Liu","Qingshan",""]],"versions":[{"version":"v1","created":"Mon, 24 Jun 2024 13:31:08 GMT"}],"updateDate":"2024-07-16","timestamp":1719235868000,"abstract":"  To overcome the restriction of identical distribution assumption, invariant\nrepresentation learning for unsupervised domain adaptation (UDA) has made\nsignificant advances in computer vision and pattern recognition communities. In\nUDA scenario, the training and test data belong to different domains while the\ntask model is learned to be invariant. Recently, empirical connections between\ntransferability and discriminability have received increasing attention, which\nis the key to understanding the invariant representations. However, theoretical\nstudy of these abilities and in-depth analysis of the learned feature\nstructures are unexplored yet. In this work, we systematically analyze the\nessentials of transferability and discriminability from the geometric\nperspective. Our theoretical results provide insights into understanding the\nco-regularization relation and prove the possibility of learning these\nabilities. From methodology aspect, the abilities are formulated as geometric\nproperties between domain/cluster subspaces (i.e., orthogonality and\nequivalence) and characterized as the relation between the norms/ranks of\nmultiple matrices. Two optimization-friendly learning principles are derived,\nwhich also ensure some intuitive explanations. Moreover, a feasible range for\nthe co-regularization parameters is deduced to balance the learning of\ngeometric structures. Based on the theoretical results, a geometry-oriented\nmodel is proposed for enhancing the transferability and discriminability via\nnuclear norm optimization. Extensive experiment results validate the\neffectiveness of the proposed model in empirical applications, and verify that\nthe geometric abilities can be sufficiently learned in the derived feasible\nrange.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}