{"id":"2407.11116","title":"Electron phonon coupling in the topological heavy fermion model of\n  twisted bilayer graphene","authors":"Yi-Jie Wang, Geng-Dong Zhou, Biao Lian, and Zhi-Da Song","authorsParsed":[["Wang","Yi-Jie",""],["Zhou","Geng-Dong",""],["Lian","Biao",""],["Song","Zhi-Da",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-17","timestamp":1721066401000,"abstract":"  Flat bands in magic-angle twisted bilayer graphene serve as the arena where\nexotic correlation physics unfolds. Previous studies have shown that phonons,\nthrough mediating an effective electron-electron interaction, can play a\ncrucial role in determining various electronic phases. In this study, we\nproject the full electron-phonon coupling vertex, derived from microscopic\ntight-binding lattice calculations, onto the basis of the topological heavy\nfermion model [Song and Bernevig, PRL 129, 047601 (2022)], and identify the\nsignificance of each phonon mode. With phonon fields integrated out, an on-site\nanti-Hund's interaction $\\hat{H}_{\\rm A}$ on the moir\\'e-scale local\n$f$-orbitals is obtained, with strengths 1 to 4 meV. We solve the\nphonon-induced multiplet splittings, and then elaborate on phonon-favored\nsymmetry-breaking orders at even-integer fillings. Through systematic\nself-consistent Hartree-Fock calculations, we uncover a tight competition\nbetween $\\Gamma$-phonon-favored orbital orders, $K$-phonon-favored inter-valley\ncoherent orders, and the kinetic and Coulomb-favored orders. A Hund's\ninteraction $\\hat{H}_{\\rm H}$ with strengths 1 to 3 meV, which originates from\nthe carbon atom Hubbard, and partly counteracts the effect of $\\hat{H}_{\\rm\nA}$, is also discussed. In the end, we explore the possibility of finding an\nexotic Dirac semi-metal at the charge-neutrality point which is formed solely\nby $c$-electrons, while $f$-impurities exhibit a symmetric Mott gap by forming\nnon-degenerate singlets under $\\hat{H}_{\\rm A,H}$. Experimental features that\ndistinguish such a state are discussed.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PHX5nYLQSKZeVXD8cdEAc72wv9fwbsK3wqyPKU1SptA","pdfSize":"2323766"}
