{"id":"2407.05770","title":"A global view on star formation: The GLOSTAR Galactic plane survey X.\n  Galactic HII region catalog using radio recombination lines","authors":"S. Khan, M. R. Rugel, A. Brunthaler, K. M. Menten, F. Wyrowski, J. S.\n  Urquhart, Y. Gong, A. Y. Yang, H. Nguyen, R. Dokara, S. A. Dzib, S.-N. X.\n  Medina, G. N. Ortiz-Le\\'on, J. D. Pandian, H. Beuther, V. S. Veena, S.\n  Neupane, A. Cheema, W. Reich, and N. Roy","authorsParsed":[["Khan","S.",""],["Rugel","M. R.",""],["Brunthaler","A.",""],["Menten","K. M.",""],["Wyrowski","F.",""],["Urquhart","J. S.",""],["Gong","Y.",""],["Yang","A. Y.",""],["Nguyen","H.",""],["Dokara","R.",""],["Dzib","S. A.",""],["Medina","S. -N. X.",""],["Ortiz-León","G. N.",""],["Pandian","J. D.",""],["Beuther","H.",""],["Veena","V. S.",""],["Neupane","S.",""],["Cheema","A.",""],["Reich","W.",""],["Roy","N.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 09:26:41 GMT"}],"updateDate":"2024-09-04","timestamp":1720430801000,"abstract":"  Studies of Galactic HII regions are of crucial importance for studying star\nformation and the evolution of the interstellar medium. Gaining an insight into\ntheir physical characteristics contributes to a more comprehensive\nunderstanding of these phenomena. The GLOSTAR project aims to provide a GLObal\nview on STAR formation in the Milky Way by performing an unbiased and sensitive\nsurvey. This is achieved by using the extremely wideband (4{-}8 GHz) C-band\nreceiver of the Karl G. Jansky Very Large Array and the Effelsberg 100 m\ntelescope. Using radio recombination lines observed in the GLOSTAR survey with\nthe VLA in D-configuration with a typical line sensitivity of 1{\\sigma} {\\sim}\n3.0 mJy beam{^-1} at {\\sim} 5 km s{^-1} and an angular resolution of 25\", we\ncataloged 244 individual Galactic HII regions and derived their physical\nproperties. We examined the mid-infrared (MIR) morphology of these HII regions\nand find that a significant portion of them exhibit a bubble-like morphology in\nthe GLIMPSE 8 {\\mu}m emission. We also searched for associations with the dust\ncontinuum and sources of methanol maser emission, other tracers of young\nstellar objects, and find that 48\\% and 14\\% of our HII regions, respectively,\nare coextensive with those. We measured the electron temperature for a large\nsample of HII regions within Galactocentric distances spanning from 1.6 to 13.1\nkpc and derived the Galactic electron temperature gradient as {\\sim} 372 {\\pm}\n28 K kpc{^-1} with an intercept of 4248 {\\pm} 161 K, which is consistent with\nprevious studies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}