{"id":"2407.15620","title":"Dual Test-time Training for Out-of-distribution Recommender System","authors":"Xihong Yang, Yiqi Wang, Jin Chen, Wenqi Fan, Xiangyu Zhao, En Zhu,\n  Xinwang Liu, Defu Lian","authorsParsed":[["Yang","Xihong",""],["Wang","Yiqi",""],["Chen","Jin",""],["Fan","Wenqi",""],["Zhao","Xiangyu",""],["Zhu","En",""],["Liu","Xinwang",""],["Lian","Defu",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 13:27:51 GMT"}],"updateDate":"2024-07-23","timestamp":1721654871000,"abstract":"  Deep learning has been widely applied in recommender systems, which has\nachieved revolutionary progress recently. However, most existing learning-based\nmethods assume that the user and item distributions remain unchanged between\nthe training phase and the test phase. However, the distribution of user and\nitem features can naturally shift in real-world scenarios, potentially\nresulting in a substantial decrease in recommendation performance. This\nphenomenon can be formulated as an Out-Of-Distribution (OOD) recommendation\nproblem. To address this challenge, we propose a novel Dual Test-Time-Training\nframework for OOD Recommendation, termed DT3OR. In DT3OR, we incorporate a\nmodel adaptation mechanism during the test-time phase to carefully update the\nrecommendation model, allowing the model to specially adapt to the shifting\nuser and item features. To be specific, we propose a self-distillation task and\na contrastive task to assist the model learning both the user's invariant\ninterest preferences and the variant user/item characteristics during the\ntest-time phase, thus facilitating a smooth adaptation to the shifting\nfeatures. Furthermore, we provide theoretical analysis to support the rationale\nbehind our dual test-time training framework. To the best of our knowledge,\nthis paper is the first work to address OOD recommendation via a\ntest-time-training strategy. We conduct experiments on three datasets with\nvarious backbones. Comprehensive experimental results have demonstrated the\neffectiveness of DT3OR compared to other state-of-the-art baselines.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}