{"id":"2407.20221","title":"Multilevel polynomial partitioning and semialgebraic hypergraphs:\n  regularity, Tur\\'an, and Zarankiewicz results","authors":"Jonathan Tidor and Hung-Hsun Hans Yu","authorsParsed":[["Tidor","Jonathan",""],["Yu","Hung-Hsun Hans",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 17:56:42 GMT"},{"version":"v2","created":"Fri, 6 Sep 2024 16:14:23 GMT"}],"updateDate":"2024-09-09","timestamp":1722275802000,"abstract":"  We prove three main results about semialgebraic hypergraphs. First, we prove\nan optimal and oblivious regularity lemma. Fox, Pach, and Suk proved that the\nclass of $k$-uniform semialgebraic hypergraphs satisfies a very strong\nregularity lemma where the vertex set can be partitioned into\n$\\mathrm{poly}(1/\\varepsilon)$ parts so that all but an $\\varepsilon$-fraction\nof $k$-tuples of parts are homogeneous (either complete or empty). Our result\nimproves the number of parts in the partition to $O_{d,k}((D/\\varepsilon)^{d})$\nwhere $d$ is the dimension of the ambient space and $D$ is a measure of the\ncomplexity of the hypergraph; additionally, the partition is oblivious to the\nedge set of the hypergraph. We give examples that show that the dependence on\nboth $\\varepsilon$ and $D$ is optimal.\n  From this regularity lemma we deduce the best-known Tur\\'an-type result for\nsemialgebraic hypergraphs. Third, we prove a Zarankiewicz-type result for\nsemialgebraic hypergraphs. Previously Fox, Pach, Sheffer, Suk, and Zahl showed\nthat a $K_{u,u}$-free semialgebraic graph on $N$ vertices has at most\n$O_{d,D,u}(N^{2d/(d+1)+o(1)})$ edges and Do extended this result to\n$K_{u,\\ldots,u}^{(k)}$-free semialgebraic hypergraphs. We improve upon both of\nthese results by removing the $o(1)$ in the exponent and making the dependence\non $D$ and $u$ explicit and polynomial.\n  All three of these results follow from a novel ``multilevel polynomial\npartitioning scheme'' that efficiently partitions a point set\n$P\\subset\\mathbb{R}^d$ via low-complexity semialgebraic pieces. We prove this\nresult using the polynomial method over varieties as developed by Walsh which\nextends the real polynomial partitioning technique of Guth and Katz.\n  We give additional applications to the unit distance problem, the\nErd\\H{o}s--Hajnal problem for semialgebraic graphs, and property testing of\nsemialgebraic hypergraphs.\n","subjects":["Mathematics/Combinatorics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}