{"id":"2407.04972","title":"Effect of sweep angle on three-dimensional vortex dynamics over plunging\n  wings","authors":"Alex Cavanagh, Chandan Bose and Kiran Ramesh","authorsParsed":[["Cavanagh","Alex",""],["Bose","Chandan",""],["Ramesh","Kiran",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 06:42:57 GMT"}],"updateDate":"2024-07-09","timestamp":1720248177000,"abstract":"  The effects of sweep angle and reduced frequency on the leading-edge vortex\n(LEV) structure over flapping swept wings in the Reynolds number ($Re$) range\nof $\\mathbf{O}(10^4)$ are yet to be completely understood. With increasing\ninterest in designing bio-inspired micro-air-vehicles (MAVs), understanding LEV\ndynamics in such scenarios is imperative. This study investigates the effects\nof three different sweep angles ($\\Lambda = 0^\\circ$, $30^\\circ$ and\n$60^\\circ$) on LEV dynamics through high-fidelity improved delayed detached\neddy simulation (IDDES) to analyze the underlying flow physics. Plunge ramp\nkinematics at two different reduced frequencies ($k = 0.05$ and $0.4$) are\nstudied to investigate the unsteady motion effects on LEV characteristics. The\nleading-edge suction parameter (LESP) concept is applied to determine LEV\ninitiation, and the results are verified against flow field visualization for\nswept-wing geometries. The force partitioning method (FPM) is used to\ninvestigate the spanwise lift distribution resulting from the LEV. Distinct\npeaks in the lift coefficient occur for the high reduced frequency case due to\nthe impulse-like plunging acceleration. This causes the LEV to detach from the\nleading edge more quickly and convect faster, significantly affecting the lift\ngenerated by the wing. As reduced frequency increases, the LEV breakdown\nmechanism switches from vortex bursting to LEV leg-induced instabilities. These\nresults provide insights into the complex vortex structures surrounding swept\nwings at $Re = 20,000$, and the impact both sweep angle and reduced frequency\nhave on the lift contribution of these flow features.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}