{"id":"2407.06772","title":"Revealing the evanescent components in Kronecker-product based\n  codebooks: insights and implications","authors":"Jun Yang, Yijian Chen, Yunqi Sun, Yuan Si, Hongkang Yu, Shujuan Zhang\n  and Zhaohua Lu","authorsParsed":[["Yang","Jun",""],["Chen","Yijian",""],["Sun","Yunqi",""],["Si","Yuan",""],["Yu","Hongkang",""],["Zhang","Shujuan",""],["Lu","Zhaohua",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 11:43:27 GMT"}],"updateDate":"2024-07-10","timestamp":1720525407000,"abstract":"  The orthogonal bases of discrete Fourier transform (DFT) has been recognized\nas the standard spatial-domain bases for Type I, Type II and enhanced Type II\ncodewords by the 3rd Generation Partnership Project (3GPP). For uniform planar\narrays, these spatial-domain bases are derived as the Kronecker product of\none-dimensional DFT bases. Theoretically, each spatial basis corresponds to a\nbeam directed towards a specific angle of departure and the set of bases\nrepresent the orthogonal beams that cover the front hemisphere of an array.\nWhile the Kronecker-product based precoding scheme facilitates the concise\nindexing of a codeword in the codebooks through precoding matrix indicators\n(PMIs) in channel state information feedback, it introduces redundant spatial\nbeams characterized by high spatial-frequency components. This paper\ninvestigates the presence of codewords representing high spatial-frequency\ncomponents within the Kronecker-product based codebooks. Through theoretical\nanalysis and simulations, we confirm the redundancy of these codewords in MIMO\ncommunications, advocating for their removal from the codebooks to enhance\nsystem performance. Several topics relevant to the high spatial components are\nalso involved in the discussion. Practical suggestions regarding future\nstandard design are provided based on our theoretical analysis and simulation\nresults.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}