{"id":"2407.19150","title":"RoSE-Opt: Robust and Efficient Analog Circuit Parameter Optimization\n  with Knowledge-infused Reinforcement Learning","authors":"Weidong Cao, Jian Gao, Tianrui Ma, Rui Ma, Mouhacine Benosman, Xuan\n  Zhang","authorsParsed":[["Cao","Weidong",""],["Gao","Jian",""],["Ma","Tianrui",""],["Ma","Rui",""],["Benosman","Mouhacine",""],["Zhang","Xuan",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 02:32:45 GMT"}],"updateDate":"2024-07-30","timestamp":1722047565000,"abstract":"  This paper proposes a learning framework, RoSE-Opt, to achieve robust and\nefficient analog circuit parameter optimization. RoSE-Opt has two important\nfeatures. First, it incorporates key domain knowledge of analog circuit design,\nsuch as circuit topology, couplings between circuit specifications, and\nvariations of process, supply voltage, and temperature, into the learning loop.\nThis strategy facilitates the training of an artificial agent capable of\nachieving design goals by identifying device parameters that are optimal and\nrobust. Second, it exploits a two-level optimization method, that is,\nintegrating Bayesian optimization (BO) with reinforcement learning (RL) to\nimprove sample efficiency. In particular, BO is used for a coarse yet quick\nsearch of an initial starting point for optimization. This sets a solid\nfoundation to efficiently train the RL agent with fewer samples. Experimental\nevaluations on benchmarking circuits show promising sample efficiency,\nextraordinary figure-of-merit in terms of design efficiency and design success\nrate, and Pareto optimality in circuit performance of our framework, compared\nto previous methods. Furthermore, this work thoroughly studies the performance\nof different RL optimization algorithms, such as Deep Deterministic Policy\nGradients (DDPG) with an off-policy learning mechanism and Proximal Policy\nOptimization (PPO) with an on-policy learning mechanism. This investigation\nprovides users with guidance on choosing the appropriate RL algorithms to\noptimize the device parameters of analog circuits. Finally, our study also\ndemonstrates RoSE-Opt's promise in parasitic-aware device optimization for\nanalog circuits. In summary, our work reports a knowledge-infused BO-RL design\nautomation framework for reliable and efficient optimization of analog\ncircuits' device parameters.\n","subjects":["Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wHjNJz8nw7VgNs3lbvdf4Hhyf0p3gSrvB_AvfUHonho","pdfSize":"14616784"}
