{"id":"2407.19617","title":"AgEval: A Benchmark for Zero-Shot and Few-Shot Plant Stress Phenotyping\n  with Multimodal LLMs","authors":"Muhammad Arbab Arshad, Talukder Zaki Jubery, Tirtho Roy, Rim Nassiri,\n  Asheesh K. Singh, Arti Singh, Chinmay Hegde, Baskar Ganapathysubramanian,\n  Aditya Balu, Adarsh Krishnamurthy, Soumik Sarkar","authorsParsed":[["Arshad","Muhammad Arbab",""],["Jubery","Talukder Zaki",""],["Roy","Tirtho",""],["Nassiri","Rim",""],["Singh","Asheesh K.",""],["Singh","Arti",""],["Hegde","Chinmay",""],["Ganapathysubramanian","Baskar",""],["Balu","Aditya",""],["Krishnamurthy","Adarsh",""],["Sarkar","Soumik",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 00:39:51 GMT"}],"updateDate":"2024-07-30","timestamp":1722213591000,"abstract":"  Plant stress phenotyping traditionally relies on expert assessments and\nspecialized models, limiting scalability in agriculture. Recent advances in\nmultimodal large language models (LLMs) offer potential solutions to this\nchallenge. We present AgEval, a benchmark comprising 12 diverse plant stress\nphenotyping tasks, to evaluate these models' capabilities. Our study assesses\nzero-shot and few-shot in-context learning performance of state-of-the-art\nmodels, including Claude, GPT, Gemini, and LLaVA. Results show significant\nperformance improvements with few-shot learning, with F1 scores increasing from\n46.24% to 73.37% in 8-shot identification for the best-performing model.\nFew-shot examples from other classes in the dataset have negligible or negative\nimpacts, although having the exact category example helps to increase\nperformance by 15.38%. We also quantify the consistency of model performance\nacross different classes within each task, finding that the coefficient of\nvariance (CV) ranges from 26.02% to 58.03% across models, implying that subject\nmatter expertise is needed - of 'difficult' classes - to achieve reliability in\nperformance. AgEval establishes baseline metrics for multimodal LLMs in\nagricultural applications, offering insights into their promise for enhancing\nplant stress phenotyping at scale. Benchmark and code can be accessed at:\nhttps://anonymous.4open.science/r/AgEval/\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}