{"id":"2407.20242","title":"The Threats of Embodied Multimodal LLMs: Jailbreaking Robotic\n  Manipulation in the Physical World","authors":"Hangtao Zhang, Chenyu Zhu, Xianlong Wang, Ziqi Zhou, Yichen Wang, Lulu\n  Xue, Minghui Li, Shengshan Hu, Leo Yu Zhang","authorsParsed":[["Zhang","Hangtao",""],["Zhu","Chenyu",""],["Wang","Xianlong",""],["Zhou","Ziqi",""],["Wang","Yichen",""],["Xue","Lulu",""],["Li","Minghui",""],["Hu","Shengshan",""],["Zhang","Leo Yu",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 13:13:16 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 16:08:06 GMT"}],"updateDate":"2024-08-16","timestamp":1721135596000,"abstract":"  Embodied artificial intelligence (AI) represents an artificial intelligence\nsystem that interacts with the physical world through sensors and actuators,\nseamlessly integrating perception and action. This design enables AI to learn\nfrom and operate within complex, real-world environments. Large Language Models\n(LLMs) deeply explore language instructions, playing a crucial role in devising\nplans for complex tasks. Consequently, they have progressively shown immense\npotential in empowering embodied AI, with LLM-based embodied AI emerging as a\nfocal point of research within the community. It is foreseeable that, over the\nnext decade, LLM-based embodied AI robots are expected to proliferate widely,\nbecoming commonplace in homes and industries. However, a critical safety issue\nthat has long been hiding in plain sight is: could LLM-based embodied AI\nperpetrate harmful behaviors? Our research investigates for the first time how\nto induce threatening actions in embodied AI, confirming the severe risks posed\nby these soon-to-be-marketed robots, which starkly contravene Asimov's Three\nLaws of Robotics and threaten human safety. Specifically, we formulate the\nconcept of embodied AI jailbreaking and expose three critical security\nvulnerabilities: first, jailbreaking robotics through compromised LLM; second,\nsafety misalignment between action and language spaces; and third, deceptive\nprompts leading to unaware hazardous behaviors. We also analyze potential\nmitigation measures and advocate for community awareness regarding the safety\nof embodied AI applications in the physical world.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}