{"id":"2407.05090","title":"Automatically Analyzing Performance Issues in Android Apps: How Far Are\n  We?","authors":"Dianshu Liao, Shidong Pan, Siyuan Yang, Yitong Wang, Yanjie Zhao,\n  Zhenchang Xing, Xiaoyu Sun","authorsParsed":[["Liao","Dianshu",""],["Pan","Shidong",""],["Yang","Siyuan",""],["Wang","Yitong",""],["Zhao","Yanjie",""],["Xing","Zhenchang",""],["Sun","Xiaoyu",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 14:43:40 GMT"}],"updateDate":"2024-07-09","timestamp":1720277020000,"abstract":"  Performance plays a critical role in ensuring the smooth operation of any\nmobile application, directly influencing user engagement and retention. Android\napplications are no exception. However, unlike functionality issues,\nperformance issues are more challenging to discover as their root causes are\nsophisticated and typically emerge under specific payloads. To tackle this\nproblem, researchers have dedicated substantial efforts to proposing automatic\napproaches for understanding, detecting, and resolving performance issues.\nDespite these endeavors, it still remains unknown what the status quo of\nAndroid performance analysis is, and whether existing approaches can indeed\naccurately reflect real performance issues. To fill this research gap, we\nconducted a systematic literature review followed by an explanatory study to\nexplore relevant studies and real-world challenges. Our findings reveal that\ncurrent tools have limited capabilities, covering only 17.50% of the\nperformance issues. Additionally, existing datasets encompass only 27.50% of\nthe issues and are very limited in size. We also show real-world issue\npatterns, underscoring the huge gap between the identified techniques and\npractical concerns. Furthermore, possible solutions are provided to guide\nfuture research towards achieving effective performance issue detection and\nresolution.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}