{"id":"2407.19370","title":"ClickDiff: Click to Induce Semantic Contact Map for Controllable Grasp\n  Generation with Diffusion Models","authors":"Peiming Li, Ziyi Wang, Mengyuan Liu, Hong Liu, Chen Chen","authorsParsed":[["Li","Peiming",""],["Wang","Ziyi",""],["Liu","Mengyuan",""],["Liu","Hong",""],["Chen","Chen",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 02:42:29 GMT"}],"updateDate":"2024-07-30","timestamp":1722134549000,"abstract":"  Grasp generation aims to create complex hand-object interactions with a\nspecified object. While traditional approaches for hand generation have\nprimarily focused on visibility and diversity under scene constraints, they\ntend to overlook the fine-grained hand-object interactions such as contacts,\nresulting in inaccurate and undesired grasps. To address these challenges, we\npropose a controllable grasp generation task and introduce ClickDiff, a\ncontrollable conditional generation model that leverages a fine-grained\nSemantic Contact Map (SCM). Particularly when synthesizing interactive grasps,\nthe method enables the precise control of grasp synthesis through either\nuser-specified or algorithmically predicted Semantic Contact Map. Specifically,\nto optimally utilize contact supervision constraints and to accurately model\nthe complex physical structure of hands, we propose a Dual Generation\nFramework. Within this framework, the Semantic Conditional Module generates\nreasonable contact maps based on fine-grained contact information, while the\nContact Conditional Module utilizes contact maps alongside object point clouds\nto generate realistic grasps. We evaluate the evaluation criteria applicable to\ncontrollable grasp generation. Both unimanual and bimanual generation\nexperiments on GRAB and ARCTIC datasets verify the validity of our proposed\nmethod, demonstrating the efficacy and robustness of ClickDiff, even with\npreviously unseen objects. Our code is available at\nhttps://github.com/adventurer-w/ClickDiff.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}