{"id":"2407.21604","title":"MicroMIL: Graph-based Contextual Multiple Instance Learning for Patient\n  Diagnosis Using Microscopy Images","authors":"JongWoo Kim and Bryan Wong and YoungSin Ko and MunYong Yi","authorsParsed":[["Kim","JongWoo",""],["Wong","Bryan",""],["Ko","YoungSin",""],["Yi","MunYong",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 13:38:47 GMT"}],"updateDate":"2024-08-01","timestamp":1722433127000,"abstract":"  Current histopathology research has primarily focused on using whole-slide\nimages (WSIs) produced by scanners with weakly-supervised multiple instance\nlearning (MIL). However, WSIs are costly, memory-intensive, and require\nextensive analysis time. As an alternative, microscopy-based analysis offers\ncost and memory efficiency, though microscopy images face issues with unknown\nabsolute positions and redundant images due to multiple captures from the\nsubjective perspectives of pathologists. To this end, we introduce MicroMIL, a\nweakly-supervised MIL framework specifically built to address these challenges\nby dynamically clustering images using deep cluster embedding (DCE) and Gumbel\nSoftmax for representative image extraction. Graph edges are then constructed\nfrom the upper triangular similarity matrix, with nodes connected to their most\nsimilar neighbors, and a graph neural network (GNN) is utilized to capture\nlocal and diverse areas of contextual information. Unlike existing graph-based\nMIL methods designed for WSIs that require absolute positions, MicroMIL\nefficiently handles the graph edges without this need. Extensive evaluations on\nreal-world colon cancer (Seegene) and public BreakHis datasets demonstrate that\nMicroMIL outperforms state-of-the-art (SOTA) methods, offering a robust and\nefficient solution for patient diagnosis using microscopy images. The code is\navailable at https://anonymous.4open.science/r/MicroMIL-6C7C\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}