{"id":"2407.10903","title":"Hedging Beyond the Mean: A Distributional Reinforcement Learning\n  Perspective for Hedging Portfolios with Structured Products","authors":"Anil Sharma, Freeman Chen, Jaesun Noh, Julio DeJesus, Mario Schlener","authorsParsed":[["Sharma","Anil",""],["Chen","Freeman",""],["Noh","Jaesun",""],["DeJesus","Julio",""],["Schlener","Mario",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:54:43 GMT"}],"updateDate":"2024-07-16","timestamp":1721062483000,"abstract":"  Research in quantitative finance has demonstrated that reinforcement learning\n(RL) methods have delivered promising outcomes in the context of hedging\nfinancial portfolios. For example, hedging a portfolio of European options\nusing RL achieves better $PnL$ distribution than the trading hedging strategies\nlike Delta neutral and Delta-Gamma neutral [Cao et. al. 2020]. There is great\nattention given to the hedging of vanilla options, however, very little is\nmentioned on hedging a portfolio of structured products such as Autocallable\nnotes. Hedging structured products is much more complex and the traditional RL\napproaches tend to fail in this context due to the underlying complexity of\nthese products. These are more complicated due to presence of several barriers\nand coupon payments, and having a longer maturity date (from $7$ years to a\ndecade), etc. In this direction, we propose a distributional RL based method to\nhedge a portfolio containing an Autocallable structured note. We will\ndemonstrate our RL hedging strategy using American and Digital options as\nhedging instruments. Through several empirical analysis, we will show that\ndistributional RL provides better $PnL$ distribution than traditional\napproaches and learns a better policy depicting lower value-at-risk ($VaR$) and\nconditional value-at-risk ($CVaR$), showcasing the potential for enhanced risk\nmanagement.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"noyciUT1HLjsCiWmCPGH9fAX2hlT9u1FJqIOBEZsreY","pdfSize":"2427223"}
