{"id":"2407.18250","title":"Yukawa-Lorentz symmetry of interacting non-Hermitian birefringent Dirac\n  fermions","authors":"Sk Asrap Murshed, Bitan Roy","authorsParsed":[["Murshed","Sk Asrap",""],["Roy","Bitan",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 17:59:37 GMT"}],"updateDate":"2024-07-26","timestamp":1721930377000,"abstract":"  The energy spectra of linearly dispersing gapless spin-3/2 Dirac fermions\ndisplay birefringence, featuring two effective Fermi velocities, thus breaking\nthe space-time Lorentz symmetry. Here, we consider a non-Hermitian (NH)\ngeneralization of this scenario by introducing a masslike anti-Hermitian\nbirefringent Dirac operator to its Hermitian counterpart. The resulting NH\noperator shows real eigenvalue spectra over an extended NH parameter regime,\nand a combination of non-spatial and discrete rotational symmetries protects\nthe gapless nature of such quasiparticles. However, at the brink of dynamic\nmass generation, triggered by Hubbardlike local interactions, the birefringent\nparameter always vanishes under coarse grain due to Yukawa-type interactions\nwith scalar bosonic order-parameter fluctuations. The resulting quantum\ncritical state is, therefore, described by two decoupled copies of spin-1/2\nDirac fermions with a unique terminal Fermi velocity, which is equal to the\nbosonic order-parameter velocity, thereby fostering an emergent space-time\nLorentz symmetry. Furthermore, depending on the internal algebra between the\nanti-Hermitian birefringent Dirac operator and the candidate mass order, the\nsystem achieves the emergent Yukawa-Lorentz symmetry either by maintaining its\nnon-Hermiticity or by recovering a full Hermiticity. We discuss the resulting\nquantum critical phenomena and possible microscopic realizations of the\nproposed scenarios.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TttES1hcoJK3rfj1yJSNSCYxqeap9oxnGqKasXKK1PQ","pdfSize":"578907"}
