{"id":"2407.06558","title":"Sampling-Based Attack for Centrality Disruption in Complex Networks","authors":"Fariba Afrin Irany, Soumya Sarakar, Animesh Mukherjee, Sanjukta\n  Bhowmick","authorsParsed":[["Irany","Fariba Afrin",""],["Sarakar","Soumya",""],["Mukherjee","Animesh",""],["Bhowmick","Sanjukta",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 05:23:21 GMT"}],"updateDate":"2024-07-10","timestamp":1720502601000,"abstract":"  Many mobile networks are represented as graphs to obtain insight to their\nconnectivity and transmission properties. Among these properties centrality\nresilience, that is, how well centralities, such as closeness and betweennesss,\nare maintained under attacks is a critical factor for proper functioning of a\nnetwork. In this paper, we study the centrality resilience of complex networks\nby developing attack models to disrupt the rank of the top path-based\ncentrality vertices. To develop our attack models, we extend the concept of\nrich clubs of influential vertices to the more general framework of scattered\nrich clubs. We define scattered rich clubs as dense subgraphs of high\ncentrality vertices that are spread (scattered) across the network. Finding\nscattered rich clubs, although of polynomial time complexity, is extremely\nexpensive computationally. We use snowball sampling to identify these important\nsubstructures as well as to identify which edges to target in our proposed\nattack models. Our results over a set of real world networks demonstrate that\nour proposed algorithm is effective in finding the single or scattered rich\nclubs efficiently and in successfully disrupting the centrality rankings of the\nnetwork. To summarize, we propose sampling-based attack models for testing the\nresilience of networks with respect to centrality rankings. As part of this\nprocess, we introduce scattered rich clubs, a generalized form of the rich club\nmodel, efficient algorithms to detect them, and demonstrate their relation to\nnetwork resilience.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}