{"id":"2407.02805","title":"Efficient DNN-Powered Software with Fair Sparse Models","authors":"Xuanqi Gao, Weipeng Jiang, Juan Zhai, Shiqing Ma, Xiaoyu Zhang, Chao\n  Shen","authorsParsed":[["Gao","Xuanqi",""],["Jiang","Weipeng",""],["Zhai","Juan",""],["Ma","Shiqing",""],["Zhang","Xiaoyu",""],["Shen","Chao",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 04:52:28 GMT"}],"updateDate":"2024-07-04","timestamp":1719982348000,"abstract":"  With the emergence of the Software 3.0 era, there is a growing trend of\ncompressing and integrating large models into software systems, with\nsignificant societal implications. Regrettably, in numerous instances, model\ncompression techniques impact the fairness performance of these models and thus\nthe ethical behavior of DNN-powered software. One of the most notable example\nis the Lottery Ticket Hypothesis (LTH), a prevailing model pruning approach.\nThis paper demonstrates that fairness issue of LTHbased pruning arises from\nboth its subnetwork selection and training procedures, highlighting the\ninadequacy of existing remedies. To address this, we propose a novel pruning\nframework, Ballot, which employs a novel conflict-detection-based subnetwork\nselection to find accurate and fair subnetworks, coupled with a refined\ntraining process to attain a high-performance model, thereby improving the\nfairness of DNN-powered software. By means of this procedure, Ballot improves\nthe fairness of pruning by 38.00%, 33.91%, 17.96%, and 35.82% compared to\nstate-of-the-art baselines, namely Magnitude Pruning, Standard LTH,\nSafeCompress, and FairScratch respectively, based on our evaluation of five\npopular datasets and three widely used models. Our code is available at\nhttps://anonymous.4open.science/r/Ballot-506E.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ESJLdzy80Uvu49-wJT-937wu6XMUpizuSH0wZKcd4fY","pdfSize":"1745661","objectId":"0xb08100b15dbb38fd43ef660841ee29a4881ccaf4fa08e14b2a7f5f107ddd5b17","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
