{"id":"2407.10087","title":"Progress and Perspectives on Weak-value Amplification","authors":"Liang Xu and Lijian Zhang","authorsParsed":[["Xu","Liang",""],["Zhang","Lijian",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 05:26:53 GMT"}],"updateDate":"2024-07-16","timestamp":1720934813000,"abstract":"  Weak-value amplification (WVA) is a metrological protocol that effectively\namplifies ultra-small physical effects, making it highly applicable in the\nfields of quantum sensing and metrology. However, the amplification effect is\nachieved through post-selection, which leads to a significant decrease in\nsignal intensity. Consequently, there is a heated debate regarding the\ntrade-off between the amplification effect and the success probability of\npost-selection, questioning whether WVA surpasses conventional measurement (CM)\nin terms of measurement precision. Extensive research indicates that the\nspecific theoretical assumptions and experimental conditions play crucial roles\nin determining the respective advantages of WVA and CM. WVA provides new\nperspectives for recognizing the important role of post-selection in precision\nmetrology. It demonstrates significant advantages in two aspects: (i) WVA based\non the phase space interaction provides feasible strategies to practically\nachieve the Heisenberg-scaling precision using only classical resources. (ii)\nWVA exhibits robustness against certain types of technical noise and\nimperfections of detectors. Moreover, WVA allows for various modifications to\nextend the applicable scope and enhance the metrological performance in\ncorresponding situations. Despite substantial progress in recent years, the\ninherent connection between the advantages of WVA and its unique features\nremains incompletely understood. In this paper, we systematically review the\nrecent advances in the WVA scheme, with a particular focus on the ultimate\nprecision of WVA under diverse conditions. Our objective is to provide a\ncomprehensive perspective on the benefits of WVA in precision measurement and\nfacilitate the realization of its full potential.\n","subjects":["Physics/Quantum Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/"}