{"id":"2407.02595","title":"Towards an Innate Cell-Environment Nanothermometer","authors":"Cristina Carrizo, Gianluca D\\' Agostino, Graham Spicer, Jaime\n  Fern\\'andez de C\\'ordoba, Rub\\'en Ahijado Guzm\\'an, Clara Maria Garcia-Abad,\n  Aitor Rivas, Ruth Matesanz, Ana O\\~na and Sebastian A. Thompson","authorsParsed":[["Carrizo","Cristina",""],["Agostino","Gianluca D\\'",""],["Spicer","Graham",""],["de Córdoba","Jaime Fernández",""],["Guzmán","Rubén Ahijado",""],["Garcia-Abad","Clara Maria",""],["Rivas","Aitor",""],["Matesanz","Ruth",""],["Oña","Ana",""],["Thompson","Sebastian A.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 18:33:02 GMT"}],"updateDate":"2024-07-04","timestamp":1719945182000,"abstract":"  Based on the PubMed database, there are around 260 manuscripts describing\nnanothermometers. These research articles detail the synthesis, performance,\nand application of intracellular nanothermometers. This intracellular\nprevalence is due to the significant importance, complexity, and utility of the\nintracellular compartments for understanding cell metabolism and disease\ntreatment. However, in recent years, the extracellular environment of the cell\nhas emerged as a crucial factor in medicine, particularly in hyperthermia and\nimmunotherapy. Despite this, we have not seen evidence in the literature\ndescribing the utilization or performance of a nanothermometer designed for\nextracellular temperature measurements. This oversight not only neglects the\npotential for measuring extracellular temperature but also fails to address the\nextracellular environment of the cell. Here, we introduce a nanothermometer\ndesigned specifically for measuring extracellular temperature by directly\nconverting serum proteins into nanothermometers (either unmodified or labeled\nwith the clinically approved dye Fluorescein). Additionally, leveraging the\nextracellular localization of these nanothermometers, we demonstrate (1) the\nenhancement of their temperature sensitivity by combining them with gold\nnanorods, and (2) their capability to generate damage and disrupt the plasma\nmembrane, thus opening the door to their use as photodynamic therapy agents. We\nfirmly believe that these advancements represent not only a broadening of the\napplications of nanothermometry but also a pioneering step in showcasing the\nability of nanothermometers to induce cell death.\n","subjects":["Physics/Biological Physics","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}