{"id":"2407.13282","title":"Imaging pulsar census of the Galactic Plane using MWA VCS data","authors":"S.Sett, M.Sokolowski, E.Lenc and N.D.R.Bhat","authorsParsed":[["Sett","S.",""],["Sokolowski","M.",""],["Lenc","E.",""],["Bhat","N. D. R.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:34:15 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 02:59:09 GMT"}],"updateDate":"2024-08-05","timestamp":1721291655000,"abstract":"  Traditional pulsar surveys have primarily employed time-domain periodicity\nsearches. However, these methods are susceptible to effects like scattering,\neclipses and orbital motion. At lower radio frequencies (<= 300 MHz), factors\nsuch as dispersion measure and pulse broadening become more prominent, reducing\nthe detection sensitivity. On the other hand, image domain searches for pulsars\nare not limited by these effects and can extend the parameter space to regions\ninaccessible to traditional search techniques. Therefore, we have developed a\npipeline to form 1-second full Stokes images from offline correlated high\ntime-resolution data from the Murchison Widefield Array (MWA). This led to the\ndevelopment of image-based methodologies to identify new pulsar candidates. In\nthis paper, we applied these methodologies to perform a low-frequency\nimage-based pulsar census of the Galactic Plane ( 12 MWA observations, covering\n~6000 deg^2 sky ). This work focuses on the detection of the known pulsar\npopulation which were present in the observed region of the sky using both\nimage-based and beamformed methods. This resulted in the detection of 83 known\npulsars, with 16 pulsars found only in Stokes I images but not in periodicity\nsearches applied in beamformed data. Notably, for 14 pulsars these are the\nfirst reported low-frequency detections. This underscores the importance of\nimage-based searches for pulsars that may be undetectable in time-series data,\ndue to scattering and/or dispersive smearing at low frequencies. This\nhighlights the importance of low-frequency flux density measurements in\nrefining pulsar spectral models and investigating the spectral turnover of\npulsars at low frequencies.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}