{"id":"2407.10169","title":"DRPC: Distributed Reinforcement Learning Approach for Scalable Resource\n  Provisioning in Container-based Clusters","authors":"Haoyu Bai, Minxian Xu, Kejiang Ye, Rajkumar Buyya, Chengzhong Xu","authorsParsed":[["Bai","Haoyu",""],["Xu","Minxian",""],["Ye","Kejiang",""],["Buyya","Rajkumar",""],["Xu","Chengzhong",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 11:48:07 GMT"}],"updateDate":"2024-07-16","timestamp":1720957687000,"abstract":"  Microservices have transformed monolithic applications into lightweight,\nself-contained, and isolated application components, establishing themselves as\na dominant paradigm for application development and deployment in public clouds\nsuch as Google and Alibaba. Autoscaling emerges as an efficient strategy for\nmanaging resources allocated to microservices' replicas. However, the dynamic\nand intricate dependencies within microservice chains present challenges to the\neffective management of scaled microservices. Additionally, the centralized\nautoscaling approach can encounter scalability issues, especially in the\nmanagement of large-scale microservice-based clusters. To address these\nchallenges and enhance scalability, we propose an innovative distributed\nresource provisioning approach for microservices based on the Twin Delayed Deep\nDeterministic Policy Gradient algorithm. This approach enables effective\nautoscaling decisions and decentralizes responsibilities from a central node to\ndistributed nodes. Comparative results with state-of-the-art approaches,\nobtained from a realistic testbed and traces, indicate that our approach\nreduces the average response time by 15% and the number of failed requests by\n24%, validating improved scalability as the number of requests increases.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hOwR_HoEQB8A0CCQUziFMrkuJx_siZksKXVlVsguyRA","pdfSize":"1636778"}
