{"id":"2407.03023","title":"Hall Coulomb drag induced by electron-electron skew scattering","authors":"Yonatan Messica, Dmitri B. Gutman","authorsParsed":[["Messica","Yonatan",""],["Gutman","Dmitri B.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 11:34:45 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 15:33:13 GMT"}],"updateDate":"2024-09-18","timestamp":1720006485000,"abstract":"  We study the influence of spin-orbit interaction on electron-electron\nscattering in the Coulomb drag setup. We study a setup made of a\ntime-reversal-symmetry-broken Weyl semimetal (WSM) layer and a normal metal\nlayer. The interlayer drag force consists of two components. The first one is\nconventional and is parallel to the relative electronic boost velocity between\nthe layers. This part of the drag tends to equilibrate the momentum\ndistribution in the two layers, analogous to shear viscosity in hydrodynamics.\nIn the WSM layer, the shift of the Fermi surface is not parallel to the\nelectric field, due to skew scattering in the WSM. This induces a Hall current\nin the normal metal via the conventional component of the drag force. The\nsecond component of the drag force is perpendicular to the boost velocity in\nthe Weyl semimetal and arises from interlayer e-e skew scattering, which\nresults from two types of processes. The first process is an interference\nbetween electron-electron and electron-disorder scattering. The second process\nis due to the side jumps in electron-electron collisions in an external\nelectric field. Both the parallel and perpendicular components of the drag are\nimportant for the anomalous Hall drag conductivity. On the other hand, for the\nHall drag resistivity, the contribution from the parallel friction is partially\ncancelled in a broad temperature regime. This work provides insight into the\nmicroscopic mechanisms of Hall-like friction in electronic fluids.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}