{"id":"2407.21518","title":"Detection of Dimethyl Ether in the Central Region of the MWC 480\n  Protoplanetary Disk","authors":"Yoshihide Yamato, Yuri Aikawa, Viviana V. Guzm\\'an, Kenji Furuya,\n  Shota Notsu, Gianni Cataldi, Karin I. \\\"Oberg, Chunhua Qi, Charles J. Law,\n  Jane Huang, Richard Teague, Romane Le Gal","authorsParsed":[["Yamato","Yoshihide",""],["Aikawa","Yuri",""],["Guzmán","Viviana V.",""],["Furuya","Kenji",""],["Notsu","Shota",""],["Cataldi","Gianni",""],["Öberg","Karin I.",""],["Qi","Chunhua",""],["Law","Charles J.",""],["Huang","Jane",""],["Teague","Richard",""],["Gal","Romane Le",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 10:39:26 GMT"}],"updateDate":"2024-08-01","timestamp":1722422366000,"abstract":"  Characterizing the chemistry of complex organic molecules (COMs) at the epoch\nof planet formation provides insights into the chemical evolution of the\ninterstellar medium (ISM) and the origin of organic materials in our Solar\nSystem. We report a detection of dimethyl ether (CH$_3$OCH$_3$) in the disk\naround the Herbig Ae star MWC 480 with the sensitive Atacama Large\nMillimeter/submillimeter Array observations. This is the first detection of\nCH$_3$OCH$_3$ in a non-transitional Class II disk. The spatially unresolved,\ncompact (${\\lesssim}$25 au in radius) nature, the broad line width ($\\sim$30 km\ns$^{-1}$), and the high excitation temperature (${\\sim}$200 K) indicate\nsublimation of COMs in the warm inner disk. Despite the detection of\nCH$_3$OCH$_3$, methanol (CH$_3$OH), the most abundant COM in the ISM, has not\nbeen detected, from which we constrain the column density ratio of\nCH$_3$OCH$_3$/CH$_3$OH ${\\gtrsim}$7. This high ratio may indicate the\nreprocessing of COMs during the disk phase, as well as the effect of the\nphysical structure in the inner disk. We also find that this ratio is higher\nthan in COM-rich transition disks recently discovered. This may indicate that,\nin the full disk of MWC 480, COMs have experienced substantial chemical\nreprocessing in the innermost region, while the COM emission in the transition\ndisks predominantly traces the inherited ice sublimating at the dust cavity\nedge located at larger radii (${\\gtrsim}$20 au).\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}