{"id":"2407.14605","title":"ESCAPE: Energy-based Selective Adaptive Correction for\n  Out-of-distribution 3D Human Pose Estimation","authors":"Luke Bidulka, Mohsen Gholami, Jiannan Zheng, Martin J. McKeown, Z.\n  Jane Wang","authorsParsed":[["Bidulka","Luke",""],["Gholami","Mohsen",""],["Zheng","Jiannan",""],["McKeown","Martin J.",""],["Wang","Z. Jane",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 18:01:26 GMT"}],"updateDate":"2024-07-23","timestamp":1721412086000,"abstract":"  Despite recent advances in human pose estimation (HPE), poor generalization\nto out-of-distribution (OOD) data remains a difficult problem. While previous\nworks have proposed Test-Time Adaptation (TTA) to bridge the train-test domain\ngap by refining network parameters at inference, the absence of ground-truth\nannotations makes it highly challenging and existing methods typically increase\ninference times by one or more orders of magnitude. We observe that 1) not\nevery test time sample is OOD, and 2) HPE errors are significantly larger on\ndistal keypoints (wrist, ankle). To this end, we propose ESCAPE: a lightweight\ncorrection and selective adaptation framework which applies a fast,\nforward-pass correction on most data while reserving costly TTA for OOD data.\nThe free energy function is introduced to separate OOD samples from incoming\ndata and a correction network is trained to estimate the errors of pretrained\nbackbone HPE predictions on the distal keypoints. For OOD samples, we propose a\nnovel self-consistency adaptation loss to update the correction network by\nleveraging the constraining relationship between distal keypoints and proximal\nkeypoints (shoulders, hips), via a second ``reverse\" network. ESCAPE improves\nthe distal MPJPE of five popular HPE models by up to 7% on unseen data,\nachieves state-of-the-art results on two popular HPE benchmarks, and is\nsignificantly faster than existing adaptation methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GP0rbUF_dIb4feHA_V2xkNoXDkHg3D8zhtfFmceCuKE","pdfSize":"6344265"}
