{"id":"2407.16661","title":"Regenerative Ulam-von Neumann Algorithm: An Innovative Markov chain\n  Monte Carlo Method for Matrix Inversion","authors":"Soumyadip Ghosh, Lior Horesh, Vassilis Kalantzis, Yingdong Lu, Tomasz\n  Nowicki","authorsParsed":[["Ghosh","Soumyadip",""],["Horesh","Lior",""],["Kalantzis","Vassilis",""],["Lu","Yingdong",""],["Nowicki","Tomasz",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:25:02 GMT"},{"version":"v2","created":"Sat, 17 Aug 2024 01:32:44 GMT"}],"updateDate":"2024-08-20","timestamp":1721755502000,"abstract":"  This paper presents an extension of the classical Ulan-von Neumann Markov\nchain Monte-Carlo algorithm for the computation of the matrix inverse. The\nalgorithm presented in this paper, termed as \\emph{regenerative Ulam-von\nNeumann algorithm}, utilizes the regenerative structure of classical,\nnon-truncated Neumann series defined by a non-singular matrix and produces an\nunbiased estimator of the matrix inverse. Furthermore, the accuracy of the\nproposed algorithm depends on a single parameter that controls the total number\nof Markov transitions simulated thus avoiding the challenge of balancing\nbetween the total number of Markov chain replications and its corresponding\nlength as in the classical Ulam-von Neumann algorithm. To efficiently utilize\nthe Markov chain transition samples in the calculation of the regenerative\nquantities, the proposed algorithm quantifies automatically the contribution of\neach Markov transition to all regenerative quantities by a carefully designed\nupdating scheme that utilized three separate matrices containing the current\nweights, total weights, and regenerative cycle count, respectively. A\nprobabilistic analysis of the performance of the algorithm, including the\nvariance of the estimator, is provided. Finally, numerical experiments verify\nthe qualitative effectiveness of the proposed scheme.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Computational Complexity","Computing Research Repository/Discrete Mathematics","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}