{"id":"2407.07950","title":"Rel-A.I.: An Interaction-Centered Approach To Measuring Human-LM\n  Reliance","authors":"Kaitlyn Zhou, Jena D. Hwang, Xiang Ren, Nouha Dziri, Dan Jurafsky, and\n  Maarten Sap","authorsParsed":[["Zhou","Kaitlyn",""],["Hwang","Jena D.",""],["Ren","Xiang",""],["Dziri","Nouha",""],["Jurafsky","Dan",""],["Sap","Maarten",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:00:05 GMT"}],"updateDate":"2024-07-12","timestamp":1720634405000,"abstract":"  The reconfiguration of human-LM interactions from simple sentence completions\nto complex, multi-domain, humanlike engagements necessitates new methodologies\nto understand how humans choose to rely on LMs. In our work, we contend that\nreliance is influenced by numerous factors within the interactional context of\na generation, a departure from prior work that used verbalized confidence\n(e.g., \"I'm certain the answer is...\") as the key determinant of reliance.\nHere, we introduce Rel-A.I., an in situ, system-level evaluation approach to\nmeasure human reliance on LM-generated epistemic markers (e.g., \"I think\nit's..\", \"Undoubtedly it's...\"). Using this methodology, we measure reliance\nrates in three emergent human-LM interaction settings: long-term interactions,\nanthropomorphic generations, and variable subject matter. Our findings reveal\nthat reliance is not solely based on verbalized confidence but is significantly\naffected by other features of the interaction context. Prior interactions,\nanthropomorphic cues, and subject domain all contribute to reliance\nvariability. An expression such as, \"I'm pretty sure it's...\", can vary up to\n20% in reliance frequency depending on its interactional context. Our work\nunderscores the importance of context in understanding human reliance and\noffers future designers and researchers with a methodology to conduct such\nmeasurements.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}