{"id":"2407.06798","title":"It Cannot Be Right If It Was Written by AI: On Lawyers' Preferences of\n  Documents Perceived as Authored by an LLM vs a Human","authors":"Jakub Harasta, Tereza Novotn\\'a, Jaromir Savelka","authorsParsed":[["Harasta","Jakub",""],["Novotná","Tereza",""],["Savelka","Jaromir",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 12:11:25 GMT"}],"updateDate":"2024-07-10","timestamp":1720527085000,"abstract":"  Large Language Models (LLMs) enable a future in which certain types of legal\ndocuments may be generated automatically. This has a great potential to\nstreamline legal processes, lower the cost of legal services, and dramatically\nincrease access to justice. While many researchers focus their efforts on\nproposing and evaluating LLM-based applications supporting tasks in the legal\ndomain, there is a notable lack of investigations into how legal professionals\nperceive content if they believe it has been generated by an LLM. Yet, this is\na critical point as over-reliance or unfounded skepticism may influence whether\nsuch documents bring about appropriate legal consequences. This study is the\nnecessary analysis in the context of the ongoing transition towards mature\ngenerative AI systems. Specifically, we examined whether the perception of\nlegal documents' by lawyers (n=75) varies based on their assumed origin\n(human-crafted vs AI-generated). The participants evaluated the documents\nfocusing on their correctness and language quality. Our analysis revealed a\nclear preference for documents perceived as crafted by a human over those\nbelieved to be generated by AI. At the same time, most of the participants are\nexpecting the future in which documents will be generated automatically. These\nfindings could be leveraged by legal practitioners, policy makers and\nlegislators to implement and adopt legal document generation technology\nresponsibly, and to fuel the necessary discussions into how legal processes\nshould be updated to reflect the recent technological developments.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}