{"id":"2407.12255","title":"Dual-Hybrid Attention Network for Specular Highlight Removal","authors":"Xiaojiao Guo, Xuhang Chen, Shenghong Luo, Shuqiang Wang, Chi-Man Pun","authorsParsed":[["Guo","Xiaojiao",""],["Chen","Xuhang",""],["Luo","Shenghong",""],["Wang","Shuqiang",""],["Pun","Chi-Man",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 01:52:41 GMT"}],"updateDate":"2024-07-18","timestamp":1721181161000,"abstract":"  Specular highlight removal plays a pivotal role in multimedia applications,\nas it enhances the quality and interpretability of images and videos,\nultimately improving the performance of downstream tasks such as content-based\nretrieval, object recognition, and scene understanding. Despite significant\nadvances in deep learning-based methods, current state-of-the-art approaches\noften rely on additional priors or supervision, limiting their practicality and\ngeneralization capability. In this paper, we propose the Dual-Hybrid Attention\nNetwork for Specular Highlight Removal (DHAN-SHR), an end-to-end network that\nintroduces novel hybrid attention mechanisms to effectively capture and process\ninformation across different scales and domains without relying on additional\npriors or supervision. DHAN-SHR consists of two key components: the Adaptive\nLocal Hybrid-Domain Dual Attention Transformer (L-HD-DAT) and the Adaptive\nGlobal Dual Attention Transformer (G-DAT). The L-HD-DAT captures local\ninter-channel and inter-pixel dependencies while incorporating spectral domain\nfeatures, enabling the network to effectively model the complex interactions\nbetween specular highlights and the underlying surface properties. The G-DAT\nmodels global inter-channel relationships and long-distance pixel dependencies,\nallowing the network to propagate contextual information across the entire\nimage and generate more coherent and consistent highlight-free results. To\nevaluate the performance of DHAN-SHR and facilitate future research in this\narea, we compile a large-scale benchmark dataset comprising a diverse range of\nimages with varying levels of specular highlights. Through extensive\nexperiments, we demonstrate that DHAN-SHR outperforms 18 state-of-the-art\nmethods both quantitatively and qualitatively, setting a new standard for\nspecular highlight removal in multimedia applications.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}