{"id":"2407.05621","title":"EA4RCA:Efficient AIE accelerator design framework for Regular\n  Communication-Avoiding Algorithm","authors":"W. B. Zhang, Y. Q. Liu, T. H. Zang, Z. S. Bao","authorsParsed":[["Zhang","W. B.",""],["Liu","Y. Q.",""],["Zang","T. H.",""],["Bao","Z. S.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 05:29:18 GMT"},{"version":"v2","created":"Tue, 9 Jul 2024 03:11:16 GMT"}],"updateDate":"2024-07-10","timestamp":1720416558000,"abstract":"  With the introduction of the Adaptive Intelligence Engine (AIE), the Versal\nAdaptive Compute Acceleration Platform (Versal ACAP) has garnered great\nattention. However, the current focus of Vitis Libraries and limited research\nhas mainly been on how to invoke AIE modules, without delving into a thorough\ndiscussion on effectively utilizing AIE in its typical use cases. As a result,\nthe widespread adoption of Versal ACAP has been restricted. The Communication\nAvoidance (CA) algorithm is considered a typical application within the AIE\narchitecture. Nevertheless, the effective utilization of AIE in CA applications\nremains an area that requires further exploration. We propose a top-down\ncustomized design framework, EA4RCA(Efficient AIE accelerator design framework\nfor regular Communication-Avoid Algorithm), specifically tailored for CA\nalgorithms with regular communication patterns, and equipped with AIE Graph\nCode Generator software to accelerate the AIE design process. The primary\nobjective of this framework is to maximize the performance of AIE while\nincorporating high-speed data streaming services. Experiments show that for the\nRCA algorithm Filter2D and Matrix Multiple (MM) with lower communication\nrequirements and the RCA algorithm FFT with higher communication requirements,\nthe accelerators implemented by the RA4RCA framework achieve the highest\nthroughput improvements of 22.19x, 1.05x and 3.88x compared with the current\nhighest performance acceleration scheme (SOTA), and the highest energy\nefficiency improvements of 6.11x, 1.30x and 7.00x.\n","subjects":["Computing Research Repository/Hardware Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}