{"id":"2407.02518","title":"INDICT: Code Generation with Internal Dialogues of Critiques for Both\n  Security and Helpfulness","authors":"Hung Le, Yingbo Zhou, Caiming Xiong, Silvio Savarese, Doyen Sahoo","authorsParsed":[["Le","Hung",""],["Zhou","Yingbo",""],["Xiong","Caiming",""],["Savarese","Silvio",""],["Sahoo","Doyen",""]],"versions":[{"version":"v1","created":"Sun, 23 Jun 2024 15:55:07 GMT"}],"updateDate":"2024-07-04","timestamp":1719158107000,"abstract":"  Large language models (LLMs) for code are typically trained to align with\nnatural language instructions to closely follow their intentions and\nrequirements. However, in many practical scenarios, it becomes increasingly\nchallenging for these models to navigate the intricate boundary between\nhelpfulness and safety, especially against highly complex yet potentially\nmalicious instructions. In this work, we introduce INDICT: a new framework that\nempowers LLMs with Internal Dialogues of Critiques for both safety and\nhelpfulness guidance. The internal dialogue is a dual cooperative system\nbetween a safety-driven critic and a helpfulness-driven critic. Each critic\nprovides analysis against the given task and corresponding generated response,\nequipped with external knowledge queried through relevant code snippets and\ntools like web search and code interpreter. We engage the dual critic system in\nboth code generation stage as well as code execution stage, providing\npreemptive and post-hoc guidance respectively to LLMs. We evaluated INDICT on 8\ndiverse tasks across 8 programming languages from 5 benchmarks, using LLMs from\n7B to 70B parameters. We observed that our approach can provide an advanced\nlevel of critiques of both safety and helpfulness analysis, significantly\nimproving the quality of output codes ($+10\\%$ absolute improvements in all\nmodels).\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Cryptography and Security","Computing Research Repository/Multiagent Systems","Computing Research Repository/Programming Languages"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ORTp-WUxpKtNTsy5ScdXGF5IftG1uvYWhAKs7KhsYYM","pdfSize":"2625048"}
