{"id":"2407.15395","title":"FAST-GSC: Fast and Adaptive Semantic Transmission for Generative\n  Semantic Communication","authors":"Yiru Wang, Wanting Yang, Zehui Xiong, Yuping Zhao, Shiwen Mao, Tony Q.\n  S. Quek, H. Vincent Poor","authorsParsed":[["Wang","Yiru",""],["Yang","Wanting",""],["Xiong","Zehui",""],["Zhao","Yuping",""],["Mao","Shiwen",""],["Quek","Tony Q. S.",""],["Poor","H. Vincent",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 05:45:14 GMT"}],"updateDate":"2024-07-23","timestamp":1721627114000,"abstract":"  The rapidly evolving field of generative artificial intelligence technology\nhas introduced innovative approaches for developing semantic communication\n(SemCom) frameworks, leading to the emergence of a new paradigm-generative\nSemCom (GSC). However, the complex processes involved in semantic extraction\nand generative inference may result in considerable latency in\nresource-constrained scenarios. To tackle these issues, we introduce a new GSC\nframework that involves fast and adaptive semantic transmission (FAST-GSC).\nThis framework incorporates one innovative communication mechanism and two\nenhancement strategies at the transmitter and receiver, respectively. Aiming to\nreduce task latency, our communication mechanism enables fast semantic\ntransmission by parallelizing the processes of semantic extraction at the\ntransmitter and inference at the receiver. Preliminary evaluations indicate\nthat while this mechanism effectively reduces task latency, it could\npotentially compromise task performance. To address this issue, we propose two\nadditional methods for enhancement. First, at the transmitter, we employ\nreinforcement learning to discern the intrinsic temporal dependencies among the\nsemantic units and design their extraction and transmission sequence\naccordingly. Second, at the receiver, we design a semantic difference\ncalculation module and propose a sequential conditional denoising approach to\nalleviate the stringent immediacy requirement for the reception of semantic\nfeatures. Extensive experiments demonstrate that our proposed architecture\nachieves a performance score comparable to the conventional GSC architecture\nwhile realizing a 52% reduction in residual task latency that extends beyond\nthe fixed inference duration.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}