{"id":"2407.14688","title":"Phase transitions and cluster structures of the new finite range\n  Lennard-Jones like model","authors":"Omar-Farouk Adesida, Sebastian Havens, Livia B. Partay","authorsParsed":[["Adesida","Omar-Farouk",""],["Havens","Sebastian",""],["Partay","Livia B.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 22:11:30 GMT"}],"updateDate":"2024-07-23","timestamp":1721427090000,"abstract":"  In the current work we revisit the pair-potential recently proposed by Wang\net al. (Phys. Chem. Chem. Phys. 10624, 22, 2020) as a well defined finite-range\nalternative to the widely used Lennard-Jones interaction model. The advantage\nof their proposed potential is that it not only goes smoothly to zero at the\ncutoff distance, hence eliminating inconsistencies caused by different\ntreatments of the truncation, but with changing the range of the potential, it\nis capable of describing soft matter-like behaviour as well as traditional\n\"Lennard-Jones-like\" properties. We used the nested sampling method to perform\nan unbiased sampling of the potential energy surface, and mapped the\npressure-temperature phase diagram of a range of truncation distances. We found\nthat the interplay between the location of the energy minimum and interaction\nrange has a complex and strong effect on both the structural and thermodynamic\nproperties of the condensed phases. We discuss the appearance of the\nliquid-vapour co-existence line and critical point at longer interaction\nranges, as well as the relatively small changes in the melting line. We present\nthe ground state diagram, demonstrating that different close-packed polytypic\nphases appear to be global minima for the model at different pressure and\ncutoff values, similar to what had been shown in case of the Lennard-Jones\nmodel. Finally, we compare the lowest energy structure of some of the N < 60\nclusters to that of the known minima of Lennard-Jones and Morse potential,\nusing different cutoff values, revealing a behaviour closely resembling that of\nthe Morse clusters.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}