{"id":"2407.05655","title":"Constrained Online Recursive Source Separation Framework for Real-time\n  Electrophysiological Signal Processing","authors":"Yao Li, Haowen Zhao, Yunfei Liu, Xu Zhang","authorsParsed":[["Li","Yao",""],["Zhao","Haowen",""],["Liu","Yunfei",""],["Zhang","Xu",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 06:29:16 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 02:34:31 GMT"},{"version":"v3","created":"Tue, 3 Sep 2024 08:05:55 GMT"}],"updateDate":"2024-09-04","timestamp":1720420156000,"abstract":"  Electrophysiological signal processing often requires blind source separation\n(BSS) techniques due to the nature of mixing source signals. However, its\ncomplex computational demands make real-time applicability challenging. In this\nstudy, we propose a Constrained Online Recursive Source Separation (CORSS)\nframework for real time electrophysiological signals processing. With a\nstepwise recursive unmixing matrix learning rule, the algorithm achieves\nreal-time updates with minimal computational overhead. By incorporating prior\ninformation of target signals to optimize the cost function, the algorithm\nconverges more readily to ideal sources, yielding more accurate results. Two\ndownstream tasks, real-time surface electromyogram (sEMG) decomposition and\nreal-time respiratory intent monitoring based on diaphragmatic electromyogram\n(sEMGdi) extraction, were employed to assess the efficacy of our method. The\nresults demonstrated superior performance compared to alternative methods,\nachieving a matching rate of 96.00% for the sEMG decomposition task and 98.12%\nfor the sEMGdi extraction task. Our method also exhibits minimal time delay\nduring computation, reflecting its streamlined updating rule as well as\nexcellent real-time capabilities, with only 12.5ms delay when the block size is\n0.1s, demonstrates strong performance for real-time processing. Our work shows\ngreat significance for applications in real-time human-computer interaction and\nclinical monitoring.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}