{"id":"2407.20995","title":"Generalized Multivariate Functional Additive Mixed Models for Location,\n  Scale, and Shape","authors":"Alexander Volkmann, Nikolaus Umlauf, Sonja Greven","authorsParsed":[["Volkmann","Alexander",""],["Umlauf","Nikolaus",""],["Greven","Sonja",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 17:31:17 GMT"}],"updateDate":"2024-07-31","timestamp":1722360677000,"abstract":"  We propose a flexible regression framework to model the conditional\ndistribution of multilevel generalized multivariate functional data of\npotentially mixed type, e.g. binary and continuous data. We make pointwise\nparametric distributional assumptions for each dimension of the multivariate\nfunctional data and model each distributional parameter as an additive function\nof covariates. The dependency between the different outcomes and, for\nmultilevel functional data, also between different functions within a level is\nmodelled by shared latent multivariate Gaussian processes. For a parsimonious\nrepresentation of the latent processes, (generalized) multivariate functional\nprincipal components are estimated from the data and used as an empirical basis\nfor these latent processes in the regression framework. Our modular two-step\napproach is very general and can easily incorporate new developments in the\nestimation of functional principal components for all types of (generalized)\nfunctional data. Flexible additive covariate effects for scalar or even\nfunctional covariates are available and are estimated in a Bayesian framework.\nWe provide an easy-to-use implementation in the accompanying R package 'gmfamm'\non CRAN and conduct a simulation study to confirm the validity of our\nregression framework and estimation strategy. The proposed multivariate\nfunctional model is applied to four dimensional traffic data in Berlin, which\nconsists of the hourly numbers and mean speed of cars and trucks at different\nlocations.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/"}