{"id":"2407.05332","title":"Experimental investigation of direct non-Hermitian measurement and\n  uncertainty relation towards high-dimensional quantum domain","authors":"Yi-Tao Wang, Zhao-An Wang, Zhi-Peng Li, Xiao-Dong Zeng, Jia-Ming Ren,\n  Wei Liu, Yuan-Ze Yang, Nai-Jie Guo, Lin-Ke Xie, Jun-You Liu, Yu-Hang Ma,\n  Jian-Shun Tang, Chengjie Zhang, Chuan-Feng Li, Guang-Can Guo","authorsParsed":[["Wang","Yi-Tao",""],["Wang","Zhao-An",""],["Li","Zhi-Peng",""],["Zeng","Xiao-Dong",""],["Ren","Jia-Ming",""],["Liu","Wei",""],["Yang","Yuan-Ze",""],["Guo","Nai-Jie",""],["Xie","Lin-Ke",""],["Liu","Jun-You",""],["Ma","Yu-Hang",""],["Tang","Jian-Shun",""],["Zhang","Chengjie",""],["Li","Chuan-Feng",""],["Guo","Guang-Can",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 11:20:27 GMT"}],"updateDate":"2024-07-09","timestamp":1720351227000,"abstract":"  Non-Hermitian dynamics in quantum systems have unveiled novel phenomena, yet\nthe implementation of valid non-Hermitian quantum measurement remains a\nchallenge, because a universal quantum projective mechanism on the complete but\nskewed non-Hermitian eigenstates is not explicit in experiment. This limitation\nhinders the direct acquisition of non-Hermitian observable statistics (e.g.,\nnon-Hermitian population dynamics), also constrains investigations of\nnon-Hermitian quantum measurement properties such as uncertainty relation.\nHere, we address these challenges by presenting a non-Hermitian projective\nprotocol and investigating the non-Hermitian uncertainty relation. We derive\nthe uncertainty relation for pseudo-Hermitian (PH) observables that is\ngeneralized beyond the Hermitian ones. We then investigate the projective\nproperties of general quantum states onto complete non-Hermitian eigenvectors,\nand present a quantum simulating method to apply the valid non-Hermitian\nprojective measurement on a direct-sum dilated space. Subsequently, we\nexperimentally construct a quantum simulator in the quantum optical circuit and\nrealize the 3-dimensional non-Hermitian quantum measurement on the\nsingle-photon qutrit. Employing this platform, we explore the uncertainty\nrelation experimentally with different PH metrics. Our non-Hermitian quantum\nmeasurement method is state-independent and outputs directly the non-Hermitian\nquantum projective statistics, paving the way for studies of extensive\nnon-Hermitian observable in quantum domain.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}