{"id":"2407.14216","title":"X-Shooting ULLYSES: Massive stars at low metallicity VII. Stellar and\n  wind properties of B supergiants in the Small Magellanic Cloud","authors":"M. Bernini-Peron, A.A.C. Sander, V. Ramachandran, L.M. Oskinova, J.S.\n  Vink, O. Verhamme, F. Najarro, J. Josiek, S.A. Brands, P.A. Crowther, V.M.A.\n  G\\'omez-Gonz\\'alez, A.C. Gormaz-Matamala, C. Hawcroft, R. Kuiper, L. Mahy,\n  W.L.F. Marcolino, L.P. Martins, A. Mehner, T.N. Parsons, D. Pauli, T. Shenar,\n  A. Schootemeijer, H. Todt, J.Th. van Loon, and the XShootU collaboration","authorsParsed":[["Bernini-Peron","M.",""],["Sander","A. A. C.",""],["Ramachandran","V.",""],["Oskinova","L. M.",""],["Vink","J. S.",""],["Verhamme","O.",""],["Najarro","F.",""],["Josiek","J.",""],["Brands","S. A.",""],["Crowther","P. A.",""],["Gómez-González","V. M. A.",""],["Gormaz-Matamala","A. C.",""],["Hawcroft","C.",""],["Kuiper","R.",""],["Mahy","L.",""],["Marcolino","W. L. F.",""],["Martins","L. P.",""],["Mehner","A.",""],["Parsons","T. N.",""],["Pauli","D.",""],["Shenar","T.",""],["Schootemeijer","A.",""],["Todt","H.",""],["van Loon","J. Th.",""],["collaboration","the XShootU",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 11:25:05 GMT"}],"updateDate":"2024-07-22","timestamp":1721388305000,"abstract":"  Context. B supergiants (BSGs) represent an important connection between the\nmain sequence and more extreme evolutionary stages of massive stars.\nAdditionally, lying toward the cool end of the hot star regime, determining\ntheir wind properties is crucial to constrain the evolution and feedback of\nmassive stars as, for instance, they might manifest the bi-stability jump\nphenomenon. Aims. We undertake a detailed analysis of a representative sample\nof 18 Small Magellanic Cloud (SMC) BSGs within the ULLYSES and XShootU\ndatasets. Our UV and optical analysis spans BSGs from B0 to B8 - covering the\nbi-stability jump region. We aim to evaluate their evolutionary status and\nverify what their wind properties say about the bi-stability jump in a\nlow-metallicity environment. Methods. We used the CMFGEN to model the spectra\nand photometry (from UV to infrared) of our sample. We compare our results with\ndifferent evolutionary models, with previous determinations in the literature\nof OB stars, and with diverging mass-loss recipes at the bi-stability jump.\nAdditionally, we provide the first BSG models in the SMC including X-rays.\nResults. (i) Within a single-stellar evolution framework, the evolutionary\nstatus of early BSGs seem less clear than that of late BSGs, which agree with\nH-shell burning models. (ii) UV analysis shows evidence that BSGs contain\nX-rays in their atmospheres, for which we provide constraints. In general, we\nfind higher X-ray luminosity (close to the standard log(L_X/L) ~ -7) for early\nBSGs. For cooler BSGs, lower values are preferred, log(L_X/L) ~ -8.5. (iii) The\nobtained mass-loss rates suggest neither a jump nor a monotonic decrease with\ntemperature. Instead, a rather constant trend is observed, which is at odds\nwith the increase found for Galactic BSGs. (iv) The wind velocity behavior with\ntemperature shows a sharp drop at ~19 kK, similar to what is observed for\nGalactic BSGs.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}