{"id":"2407.18719","title":"ALMA-IMF XV: The core mass function in the high-mass star-formation\n  regime","authors":"F. Louvet, P. Sanhueza, A. Stutz, A. Men'shchikov, F. Motte, R.\n  Galv\\'an-Madrid, S. Bontemps, Y. Pouteau, A. Ginsburg, T. Csengeri, J. Di\n  Francesco, P. Dell'Ova, M. Gonz\\'alez, P. Didelon, J. Braine, N. Cunningham,\n  B. Thomasson, P. Lesaffre, P. Hennebelle, M. Bonfand, A. Gusdorf, R. H.\n  \\'Alverez-Guti\\'errez, T. Nony, G. Busquet, F. Olguin, L. Bronfman, J.\n  Salinas, M. Fernandez-Lopez, E. Moraux, H.L. Liu, X. Lu, V. Huei-Ru, A.\n  Towner, M. Valeille-Manet, N. Brouillet, F. Herpin, B. Lefloch, T. Baug, L.\n  Maud, A. Lopez-Sepulcre and B. Svodoba","authorsParsed":[["Louvet","F.",""],["Sanhueza","P.",""],["Stutz","A.",""],["Men'shchikov","A.",""],["Motte","F.",""],["Galván-Madrid","R.",""],["Bontemps","S.",""],["Pouteau","Y.",""],["Ginsburg","A.",""],["Csengeri","T.",""],["Di Francesco","J.",""],["Dell'Ova","P.",""],["González","M.",""],["Didelon","P.",""],["Braine","J.",""],["Cunningham","N.",""],["Thomasson","B.",""],["Lesaffre","P.",""],["Hennebelle","P.",""],["Bonfand","M.",""],["Gusdorf","A.",""],["Álverez-Gutiérrez","R. H.",""],["Nony","T.",""],["Busquet","G.",""],["Olguin","F.",""],["Bronfman","L.",""],["Salinas","J.",""],["Fernandez-Lopez","M.",""],["Moraux","E.",""],["Liu","H. L.",""],["Lu","X.",""],["Huei-Ru","V.",""],["Towner","A.",""],["Valeille-Manet","M.",""],["Brouillet","N.",""],["Herpin","F.",""],["Lefloch","B.",""],["Baug","T.",""],["Maud","L.",""],["Lopez-Sepulcre","A.",""],["Svodoba","B.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 13:10:32 GMT"}],"updateDate":"2024-07-29","timestamp":1721999432000,"abstract":"  The stellar initial mass function (IMF) is critical to our understanding of\nstar formation and the effects of young stars on their environment. On large\nscales, it enables us to use tracers such as UV or Halpha emission to estimate\nthe star formation rate of a system and interpret unresolved star clusters\nacross the universe. So far, there is little firm evidence of large-scale\nvariations of the IMF, which is thus generally considered universal. Stars form\nfrom cores and it is now possible to estimate core masses and compare the core\nmass function (CMF) with the IMF, which it presumably produces. The goal of the\nALMA-IMF large program is to measure the core mass function at high linear\nresolution (2700 au) in 15 typical Milky Way protoclusters spanning a mass\nrange of 2500 to 32700 Msun. In this work, we used two different core\nextraction algorithms to extract about 680 gravitationally bound cores from\nthese 15 protoclusters. We adopt per core temperature using the temperature\nestimate from the PPMAP Bayesian method. A power-law fit to the CMF of the\nsub-sample of cores above the 1.64 Msun completeness limit, 330 cores, through\nthe maximum likelihood estimate technique yields a slope of 1.97 +/- 0.06,\nsignificantly flatter than the 2.35 Salpeter slope. Assuming a self-similar\nmapping between the CMF and the IMF, this result implies that these 15\nhigh-mass protoclusters will generate atypical IMFs. This sample is the largest\nto date produced and analysed self-consistently, derived at matched physical\nresolution, with per-core temperature estimates and cores as massive as 150\nMsun. We provide the raw source extraction catalogues and the source derived\nsize, temperature, mass, and spectral indices in the 15 protoclusters.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}