{"id":"2407.04304","title":"Observational prospects of self-interacting scalar superradiance with\n  next-generation gravitational-wave detectors","authors":"Spencer Collaviti, Ling Sun, Marios Galanis, Masha Baryakhtar","authorsParsed":[["Collaviti","Spencer",""],["Sun","Ling",""],["Galanis","Marios",""],["Baryakhtar","Masha",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 07:16:15 GMT"}],"updateDate":"2024-07-08","timestamp":1720163775000,"abstract":"  Current- and next-generation gravitational-wave observatories may reveal new,\nultralight bosons. Through the superradiance process, these theoretical\nparticle candidates can form clouds around astrophysical black holes and result\nin detectable gravitational-wave radiation. In the absence of detections,\nconstraints$-$contingent on astrophysical assumptions$-$have been derived using\nLIGO-Virgo-KAGRA data on boson masses. However, the searches for ultralight\nscalars to date have not adequately considered self-interactions between\nparticles. Self-interactions that significantly alter superradiance dynamics\nare generically present for many scalar models, including axion-like dark\nmatter candidates and string axions. We implement the most complete treatment\nof particle self-interactions available to determine the gravitational-wave\nsignatures expected from superradiant scalar clouds and revisit the constraints\nobtained in a past gravitational-wave search targeting the black hole in Cygnus\nX-1. We also project the reach of next-generation gravitational-wave\nobservatories to scalar particle parameter space in the mass-coupling plane. We\nfind that while proposed observatories have insufficient reach to\nself-interactions that can halt black hole spin-down, next-generation\nobservatories are essential for expanding the search beyond gravitational\nparameter space and can reach a mass and interaction scale of $\\sim\n10^{-13}-10^{-12}$ eV/c$^2$ and $\\gtrsim 10^{17}$ GeV, respectively.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}