{"id":"2407.19550","title":"Disentangling left-handed and right-handed neutrino effects in $B_c \\to\n  \\tau \\bar{\\nu}_\\tau$ decay","authors":"Quan-Yi Hu","authorsParsed":[["Hu","Quan-Yi",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 18:06:30 GMT"}],"updateDate":"2024-07-30","timestamp":1722189990000,"abstract":"  Inspired by the anomalies in $B\\to D^{(*)} \\tau \\bar{\\nu}_\\tau$ decay, in\nthis work, we carefully study the influence of the most general dimension-six\neffective operators involving right-handed neutrinos on the four cascade decays\n$B_c \\to \\tau(\\to \\nu_\\tau h ) \\bar{\\nu}_\\tau $ ($h=\\pi,\\rho$) and $B_c \\to\n\\tau(\\to \\nu_\\tau \\ell \\bar{\\nu}_\\ell) \\bar{\\nu}_\\tau $ ($\\ell =\\mu, e$). We\ncalculate for the first time the analytical results of the distributions of the\ndifferential decay rates of these cascade decays with respect to the energy of\nthe charged particles in the final state. We select a total of 13 new physics\nbenchmark points, among which 9 are derived from the effect of purely\nleft-handed neutrinos, and the other 4 are from the effect of purely\nright-handed neutrinos. We find that the benchmark points BP4, BP6, BP9, BP11,\nand BP13 can significantly increase the values of these distributions while the\nBP3 causes a sharp decrease in these distributions. The end-point behavior of\nthe differential distribution $d\\Gamma/dE_\\pi$ can be used to disentangle the\neffects of left-handed and right-handed neutrinos. Finally, in order to\neliminate the uncertainties brought by the CKM matrix element $V_{cb}$ and the\ndecay constant $f_{B_c}$, we introduce the normalized distributions\n$d\\Gamma/(\\Gamma dE_a)$ ($a=\\pi,\\rho,\\mu,e$), which are only sensitive to the\nright-handed neutrinos. We find that in each normalized distribution there\nexists a fixed point that is not related to any dimension-six effective\noperators considered in this work.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}