{"id":"2407.21323","title":"STANet: A Novel Spatio-Temporal Aggregation Network for Depression\n  Classification with Small and Unbalanced FMRI Data","authors":"Wei Zhang, Weiming Zeng, Hongyu Chen, Jie Liu, Hongjie Yan, Kaile\n  Zhang, Ran Tao, Wai Ting Siok, Nizhuan Wang","authorsParsed":[["Zhang","Wei",""],["Zeng","Weiming",""],["Chen","Hongyu",""],["Liu","Jie",""],["Yan","Hongjie",""],["Zhang","Kaile",""],["Tao","Ran",""],["Siok","Wai Ting",""],["Wang","Nizhuan",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 04:06:47 GMT"}],"updateDate":"2024-08-01","timestamp":1722398807000,"abstract":"  Accurate diagnosis of depression is crucial for timely implementation of\noptimal treatments, preventing complications and reducing the risk of suicide.\nTraditional methods rely on self-report questionnaires and clinical assessment,\nlacking objective biomarkers. Combining fMRI with artificial intelligence can\nenhance depression diagnosis by integrating neuroimaging indicators. However,\nthe specificity of fMRI acquisition for depression often results in unbalanced\nand small datasets, challenging the sensitivity and accuracy of classification\nmodels. In this study, we propose the Spatio-Temporal Aggregation Network\n(STANet) for diagnosing depression by integrating CNN and RNN to capture both\ntemporal and spatial features of brain activity. STANet comprises the following\nsteps:(1) Aggregate spatio-temporal information via ICA. (2) Utilize\nmulti-scale deep convolution to capture detailed features. (3) Balance data\nusing the SMOTE to generate new samples for minority classes. (4) Employ the\nAFGRU classifier, which combines Fourier transformation with GRU, to capture\nlong-term dependencies, with an adaptive weight assignment mechanism to enhance\nmodel generalization. The experimental results demonstrate that STANet achieves\nsuperior depression diagnostic performance with 82.38% accuracy and a 90.72%\nAUC. The STFA module enhances classification by capturing deeper features at\nmultiple scales. The AFGRU classifier, with adaptive weights and stacked GRU,\nattains higher accuracy and AUC. SMOTE outperforms other oversampling methods.\nAdditionally, spatio-temporal aggregated features achieve better performance\ncompared to using only temporal or spatial features. STANet outperforms\ntraditional or deep learning classifiers, and functional connectivity-based\nclassifiers, as demonstrated by ten-fold cross-validation.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}