{"id":"2407.08160","title":"Harnessing quantum light for microscopic biomechanical imaging of cells\n  and tissues","authors":"Tian Li, Vsevolod Cheburkanov, Vladislav V. Yakovlev, Girish S.\n  Agarwal, and Marlan O. Scully","authorsParsed":[["Li","Tian",""],["Cheburkanov","Vsevolod",""],["Yakovlev","Vladislav V.",""],["Agarwal","Girish S.",""],["Scully","Marlan O.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 03:25:51 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 21:10:05 GMT"}],"updateDate":"2024-08-23","timestamp":1720668351000,"abstract":"  The biomechanical properties of cells and tissues play an important role in\nour fundamental understanding of the structures and functions of biological\nsystems at both the cellular and subcellular levels. Recently, Brillouin\nmicroscopy, which offers a label-free spectroscopic means of assessing\nviscoelastic properties in vivo, has emerged as a powerful way to interrogate\nthose properties on a microscopic level in living tissues. However,\nsusceptibility to photo-damage and photo-bleaching, particularly when\nhigh-intensity laser beams are used to induce Brillouin scattering, poses a\nsignificant challenge. This article introduces a transformative approach\ndesigned to mitigate photo-damage in biological and biomedical studies,\nenabling non-destructive, label-free assessments of mechanical properties in\nlive biological samples. By leveraging quantum-light-enhanced stimulated\nBrillouin scattering (SBS) imaging contrast, the signal-to-noise ratio is\nsignificantly elevated, thereby increasing sample viability and extending\ninterrogation times without compromising the integrity of living samples. The\ntangible impact of this novel methodology is evidenced by a notable three-fold\nincrease in sample viability observed after subjecting the samples to three\nhours of continuous squeezed-light illumination, surpassing the traditional\ncoherent light-based approaches. The quantum-enhanced SBS imaging holds promise\nacross diverse fields, such as cancer biology and neuroscience where preserving\nsample vitality is of paramount significance. By mitigating concerns regarding\nphoto-damage and photo-bleaching associated with high-intensity lasers, this\ntechnological breakthrough expands our horizons for exploring the mechanical\nproperties of live biological systems, paving the way for a new era of research\nand clinical applications.\n","subjects":["Physics/Quantum Physics","Physics/Biological Physics","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}