{"id":"2407.02227","title":"Interplay between MRI-based axon diameter and myelination estimates in\n  macaque and human brain","authors":"Ting Gong, Chiara Maffei, Evan Dann, Hong-Hsi Lee, Hansol Lee, Jean C.\n  Augustinack, Susie Y. Huang, Suzanne N. Haber, Anastasia Yendiki","authorsParsed":[["Gong","Ting",""],["Maffei","Chiara",""],["Dann","Evan",""],["Lee","Hong-Hsi",""],["Lee","Hansol",""],["Augustinack","Jean C.",""],["Huang","Susie Y.",""],["Haber","Suzanne N.",""],["Yendiki","Anastasia",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 12:52:13 GMT"}],"updateDate":"2024-07-03","timestamp":1719924733000,"abstract":"  Axon diameter and myelin thickness are closely related microstructural tissue\nproperties that affect the conduction velocity of action potentials in the\nnervous system. Imaging them non-invasively with MRI-based methods is thus\nvaluable for studying brain microstructure and function. However, the\nrelationship between MRI-based axon diameter and myelination measures has not\nbeen investigated across the brain, mainly due to methodological limitations in\nestimating axon diameters. In recent years, studies using ultra-high gradient\nstrength diffusion MRI (dMRI) have demonstrated improved estimation of axon\ndiameter across white-matter (WM) tracts in the human brain, making such\ninvestigations feasible. In this study, we aim to investigate relationships\nbetween tissue microstructure properties with MRI-based methods and compare the\nimaging findings to histological evidence from the literature. We collected\ndMRI with ultra-high gradient strength and multi-echo spin-echo MRI on ex vivo\nmacaque and human brain samples on a preclinical scanner. From these data, we\nestimated axon diameter, intra-axonal signal fraction, myelin water fraction\n(MWF) and aggregate g-ratio and investigated their correlations. We found that\nthe microstructural imaging parameters exhibited consistent patterns across WM\ntracts and species. Overall, the findings suggest that MRI-based axon geometry\nand myelination measures can provide complementary information about fiber\nmorphology, and the relationships between these measures agree with prior\nhistological evidence.\n","subjects":["Physics/Medical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}