{"id":"2407.01289","title":"Representations of quadratic Heisenberg-Weyl algebras and polynomials in\n  the fourth Painlev\\'e transcendent","authors":"Ian Marquette","authorsParsed":[["Marquette","Ian",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:43:22 GMT"}],"updateDate":"2024-07-02","timestamp":1719841402000,"abstract":"  We provide new insights into the solvability property of an Hamiltonian\ninvolving of the fourth Painlev\\'e transcendent and its derivatives. This\nHamiltonian is third order shape invariant and can also be interpreted within\nthe context of second supersymmetric quantum mechanics. In addition, this\nHamiltonian admits third order lowering and raising operators. We will consider\nthe case when this Hamiltonian is irreducible i.e. when no special solutions\nexist for given parameters $\\alpha$ and $\\beta$ of the fourth Painlev\\'e\ntranscendent $P_{IV}(x,\\alpha,\\beta)$. This means that the Hamiltonian does not\nadmit a potential in terms of rational functions ( or hypergeometric type of\nspecial functions ) for those parameters. In such irreducible case, the ladder\noperators are involving the fourth Painlev\\'e transcendent and its derivative.\nAn important case for which this occurs is when the second parameter (i.e.\n$\\beta$) of the fourth Painlev\\'e transcendent $P_{IV}(x,\\alpha,\\beta)$ is\nstrictly positive i.e. $\\beta>0$. This Hamiltonian has been studied for all\nhierarchies of rational solutions that comes in three families connected to the\ngeneralised Hermite and Okamoto polynomials. The explicit form of ladder, the\nassociated wavefunctions involving exceptional orthogonal polynomials and\nrecurrence relations were also completed described. Here, we develop a\ndescription of the induced representations based on various commutator\nidentities for highest and lowest weight type representations for the\nirreducible case. We also provide for such representations new formula\nconcerning the explicit form of the related excited states from point of view\nof the Schrodinger equation as two variables polynomials that involve the\nfourth Painlev\\'e transcendent and its derivative.\n","subjects":["Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}