{"id":"2407.10031","title":"Long-Horizon Planning for Multi-Agent Robots in Partially Observable\n  Environments","authors":"Siddharth Nayak, Adelmo Morrison Orozco, Marina Ten Have, Vittal\n  Thirumalai, Jackson Zhang, Darren Chen, Aditya Kapoor, Eric Robinson, Karthik\n  Gopalakrishnan, James Harrison, Brian Ichter, Anuj Mahajan, Hamsa\n  Balakrishnan","authorsParsed":[["Nayak","Siddharth",""],["Orozco","Adelmo Morrison",""],["Have","Marina Ten",""],["Thirumalai","Vittal",""],["Zhang","Jackson",""],["Chen","Darren",""],["Kapoor","Aditya",""],["Robinson","Eric",""],["Gopalakrishnan","Karthik",""],["Harrison","James",""],["Ichter","Brian",""],["Mahajan","Anuj",""],["Balakrishnan","Hamsa",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 00:12:44 GMT"}],"updateDate":"2024-07-16","timestamp":1720915964000,"abstract":"  The ability of Language Models (LMs) to understand natural language makes\nthem a powerful tool for parsing human instructions into task plans for\nautonomous robots. Unlike traditional planning methods that rely on\ndomain-specific knowledge and handcrafted rules, LMs generalize from diverse\ndata and adapt to various tasks with minimal tuning, acting as a compressed\nknowledge base. However, LMs in their standard form face challenges with\nlong-horizon tasks, particularly in partially observable multi-agent settings.\nWe propose an LM-based Long-Horizon Planner for Multi-Agent Robotics (LLaMAR),\na cognitive architecture for planning that achieves state-of-the-art results in\nlong-horizon tasks within partially observable environments. LLaMAR employs a\nplan-act-correct-verify framework, allowing self-correction from action\nexecution feedback without relying on oracles or simulators. Additionally, we\npresent MAP-THOR, a comprehensive test suite encompassing household tasks of\nvarying complexity within the AI2-THOR environment. Experiments show that\nLLaMAR achieves a 30% higher success rate compared to other state-of-the-art\nLM-based multi-agent planners.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by/4.0/"}