{"id":"2407.02494","title":"Time transient Simulations via Finite Element Network Analysis:\n  Theoretical Formulation and Numerical Validation","authors":"Mehdi Jokar, Siddharth Nair, Fabio Semperlotti","authorsParsed":[["Jokar","Mehdi",""],["Nair","Siddharth",""],["Semperlotti","Fabio",""]],"versions":[{"version":"v1","created":"Fri, 12 Apr 2024 03:15:01 GMT"}],"updateDate":"2024-07-04","timestamp":1712891701000,"abstract":"  This paper extends the finite element network analysis (FENA) to include a\ndynamic time-transient formulation. FENA was initially formulated in the\ncontext of the linear static analysis of 1D and 2D elastic structures. By\nintroducing the concept of super finite network element, this paper provides\nthe necessary foundation to extend FENA to linear time-transient simulations\nfor both homogeneous and inhomogeneous domains. The concept of neural network\nconcatenation, originally formulated to combine networks representative of\ndifferent structural components in space, is extended to the time domain.\nNetwork concatenation in time enables training neural network models based on\ndata available in a limited time frame and then using the trained networks to\nsimulate the system evolution beyond the initial time window characteristic of\nthe training data set. The proposed methodology is validated by applying FENA\nto the transient simulation of one-dimensional structural elements (such as\nrods and beams) and by comparing the results with either analytical or finite\nelement solutions. Results confirm that FENA accurately predicts the dynamic\nresponse of the physical system and, while introducing an error on the order of\n1% (compared to analytical or computational solutions of the governing\ndifferential equations), it is capable of delivering extreme computational\nefficiency.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"JZARYMewmYscmV291_S1Mb63yevUS61umj6z2kVAqFs","pdfSize":"8819909"}
