{"id":"2407.14330","title":"Straightforward Layer-wise Pruning for More Efficient Visual Adaptation","authors":"Ruizi Han and Jinglei Tang","authorsParsed":[["Han","Ruizi",""],["Tang","Jinglei",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 14:10:35 GMT"}],"updateDate":"2024-07-22","timestamp":1721398235000,"abstract":"  Parameter-efficient transfer learning (PETL) aims to adapt large pre-trained\nmodels using limited parameters. While most PETL approaches update the added\nparameters and freeze pre-trained weights during training, the minimal impact\nof task-specific deep layers on cross-domain data poses a challenge as PETL\ncannot modify them, resulting in redundant model structures. Structural pruning\neffectively reduces model redundancy; however, common pruning methods often\nlead to an excessive increase in stored parameters due to varying pruning\nstructures based on pruning rates and data. Recognizing the storage parameter\nvolume issue, we propose a Straightforward layer-wise pruning method, called\nSLS, for pruning PETL-transferred models. By evaluating parameters from a\nfeature perspective of each layer and utilizing clustering metrics to assess\ncurrent parameters based on clustering phenomena in low-dimensional space\nobtained through t-SNE, SLS facilitates informed pruning decisions. Our study\nreveals that layer-wise pruning, with a focus on storing pruning indices,\naddresses storage volume concerns. Notably, mainstream Layer-wise pruning\nmethods may not be suitable for assessing layer importance in PETL-transferred\nmodels, where the majority of parameters are pre-trained and have limited\nrelevance to downstream datasets. Comparative analysis against state-of-the-art\nPETL methods demonstrates that the pruned model achieved a notable balance\nbetween model throughput and accuracy. Moreover, SLS effectively reduces\nstorage overhead arising from varying pruned structures while enhancing the\naccuracy and speed of pruned models compared to conventional pruning methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}