{"id":"2407.09944","title":"Compact Millimeter-Wave Antenna Array for 5G and Beyond: Design and\n  Over-The-Air (OTA) Measurements Using Compact Antenna Test Range (CATR)","authors":"Abdul Jabbar, Jalil Ur-Rehman Kazim, Mahmoud A. Shawky, Muhammad Ali\n  Imran, Qammer Abbasi, and Masood Ur-Rehman","authorsParsed":[["Jabbar","Abdul",""],["Kazim","Jalil Ur-Rehman",""],["Shawky","Mahmoud A.",""],["Imran","Muhammad Ali",""],["Abbasi","Qammer",""],["Ur-Rehman","Masood",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 16:58:44 GMT"}],"updateDate":"2024-07-16","timestamp":1720889924000,"abstract":"  This paper presents the design and comprehensive measurements of a compact\nhigh-gain 32 element planar antenna array covering the n257 (26.5-29.5 GHz)\nmillimeter wave (mmWave) band. First an 8-element quasi-uniform linear array is\ndesigned using a series-fed topology with fan shaped beams for\npoint-to-multipoint connectivity followed by a compact corporate series feed\nnetwork to design high-gain directive array for point-to-point connectivity.\nThe radiation patterns of both antenna arrays in the azimuth and elevation\nplanes are measured across a 180 degrees span using an over-the-air (OTA)\ncompact antenna test range (CATR) system with a single rotary positioner.\nMoreover the procedure for quantifying and measuring the gain of mmWave antenna\narrays is demonstrated in detail. The peak measured gain of the planar array is\n18.45 dBi at 28.5 GHz while the half-power beamwidth of the planar array in the\nelevation and azimuth planes varies between 11 to 13 degrees, and 23-27 degrees\nrespectively within the 26.5-29.5 GHz range. The measurement results match well\nwith the simulations. The designed antenna array is suitable for various\nemerging 5G and beyond mmWave applications such as fixed wireless access,\nmmWave near-field focusing, high-resolution radar systems, and the\ncharacterization of mmWave path loss and channel sounding in diverse indoor\nenvironments and smart factories.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}