{"id":"2407.03605","title":"Orthogonal Constrained Minimization with Tensor $\\ell_{2,p}$\n  Regularization for HSI Denoising and Destriping","authors":"Xiaoxia Liu, Shijie Yu, Jian Lu, Xiaojun Chen","authorsParsed":[["Liu","Xiaoxia",""],["Yu","Shijie",""],["Lu","Jian",""],["Chen","Xiaojun",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 03:33:19 GMT"}],"updateDate":"2024-07-08","timestamp":1720063999000,"abstract":"  Hyperspectral images (HSIs) are often contaminated by a mixture of noises\nsuch as Gaussian noise, dead lines, stripes, and so on. In this paper, we\npropose a novel approach for HSI denoising and destriping, called NLTL2p, which\nconsists of an orthogonal constrained minimization model and an iterative\nalgorithm with convergence guarantees. The model of the proposed NLTL2p\napproach is built based on a new sparsity-enhanced Nonlocal Low-rank Tensor\nregularization and a tensor $\\ell_{2,p}$ norm with $p\\in(0,1)$. The low-rank\nconstraints for HSI denoising utilize the spatial nonlocal self-similarity and\nspectral correlation of HSIs and are formulated based on independent\nhigher-order singular value decomposition with sparsity enhancement on its core\ntensor to prompt more low-rankness. The tensor $\\ell_{2,p}$ norm for HSI\ndestriping is extended from the matrix $\\ell_{2,p}$ norm. A proximal block\ncoordinate descent algorithm is proposed in the NLTL2p approach to solve the\nresulting nonconvex nonsmooth minimization with orthogonal constraints. We show\nany accumulation point of the sequence generated by the proposed algorithm\nconverges to a first-order stationary point, which is defined using three\nequalities of substationarity, symmetry, and feasibility for orthogonal\nconstraints. In the numerical experiments, we compare the proposed method with\nstate-of-the-art methods including a deep learning based method, and test the\nmethods on both simulated and real HSI datasets. Our proposed NLTL2p method\ndemonstrates outperformance in terms of metrics such as mean peak\nsignal-to-noise ratio as well as visual quality.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}