{"id":"2407.09477","title":"Integer programs with nearly totally unimodular matrices: the cographic\n  case","authors":"Manuel Aprile and Samuel Fiorini and Gwena\\\"el Joret and Stefan Kober\n  and Micha{\\l} T. Seweryn and Stefan Weltge and Yelena Yuditsky","authorsParsed":[["Aprile","Manuel",""],["Fiorini","Samuel",""],["Joret","Gwenaël",""],["Kober","Stefan",""],["Seweryn","Michał T.",""],["Weltge","Stefan",""],["Yuditsky","Yelena",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 17:59:15 GMT"}],"updateDate":"2024-07-15","timestamp":1720807155000,"abstract":"  It is a notorious open question whether integer programs (IPs), with an\ninteger coefficient matrix $M$ whose subdeterminants are all bounded by a\nconstant $\\Delta$ in absolute value, can be solved in polynomial time. We\nanswer this question in the affirmative if we further require that, by removing\na constant number of rows and columns from $M$, one obtains a submatrix $A$\nthat is the transpose of a network matrix.\n  Our approach focuses on the case where $A$ arises from $M$ after removing $k$\nrows only, where $k$ is a constant. We achieve our result in two main steps,\nthe first related to the theory of IPs and the second related to graph minor\ntheory.\n  First, we derive a strong proximity result for the case where $A$ is a\ngeneral totally unimodular matrix: Given an optimal solution of the linear\nprogramming relaxation, an optimal solution to the IP can be obtained by\nfinding a constant number of augmentations by circuits of $[A\\; I]$.\n  Second, for the case where $A$ is transpose of a network matrix, we\nreformulate the problem as a maximum constrained integer potential problem on a\ngraph $G$. We observe that if $G$ is $2$-connected, then it has no rooted\n$K_{2,t}$-minor for $t = \\Omega(k \\Delta)$. We leverage this to obtain a\ntree-decomposition of $G$ into highly structured graphs for which we can solve\nthe problem locally. This allows us to solve the global problem via dynamic\nprogramming.\n","subjects":["Mathematics/Combinatorics","Computing Research Repository/Discrete Mathematics","Computing Research Repository/Data Structures and Algorithms","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}