{"id":"2407.20155","title":"GsPINN: A novel fast Green kernel solver based on symmetric\n  Physics-Informed neural networks","authors":"Xiaopei Jiao, Fansheng Xiong","authorsParsed":[["Jiao","Xiaopei",""],["Xiong","Fansheng",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 16:32:46 GMT"}],"updateDate":"2024-07-30","timestamp":1722270766000,"abstract":"  Ever since deep learning was introduced in the calculation of partial\ndifferential equation (PDE), there has been a lot of interests on real time\nresponse of system where the kernel function plays an important role. As a\npopular tool in recent years, physics-informed neural networks (PINNs) was\nproposed to perform a mesh-free, semi-supervised learning with high\nflexibility. This paper explores the integration of Lie symmetry groups with\ndeep learning techniques to enhance the numerical solutions of fundamental\nsolution in PDE. We propose a novel approach that combines the strengths of\nPINN and Lie group theory to address the computational inefficiencies in\ntraditional methods. By incorporating the linearized symmetric condition (LSC)\nderived from Lie symmetries into PINNs, we introduce a new type of residual\nloss with lower order of derivative needed to calculate. This integration\nallows for significant reductions in computational costs and improvements in\nsolution precision. Numerical simulation shows that our method can achieve up\nto a 50\\% reduction in training time while maintaining good accuracy.\nAdditionally, we provide a general theoretical framework to identify invariant\ninfinitesimal generators for arbitrary Cauchy problems. This unsupervised\nalgorithm does not require prior numerical solutions, making it both practical\nand efficient for various applications. Our contributions demonstrate the\npotential of combining symmetry analysis with deep learning to advance the\nfield of scientific machine learning.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}