{"id":"2407.12628","title":"On the Fundamental Trade-Offs of Time-Frequency Resource Distribution in\n  OFDMA ISAC","authors":"Xiao-Yang Wang, Shaoshi Yang, Kaitao Meng, Hou-Yu Zhai, Christos\n  Masouros","authorsParsed":[["Wang","Xiao-Yang",""],["Yang","Shaoshi",""],["Meng","Kaitao",""],["Zhai","Hou-Yu",""],["Masouros","Christos",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:55:41 GMT"}],"updateDate":"2024-07-18","timestamp":1721228141000,"abstract":"  Integrated sensing and communications (ISAC) is widely recognized as a\npivotal and emerging technology for the next-generation mobile communication\nsystems. However, how to optimize the time-frequency domain radio resource\ndistribution for both communications and sensing, especially in scenarios where\nconflicting priorities emerge, becomes a crucial and challenging issue. In\nresponse to this problem, we first formulate the theoretical relationship\nbetween frequency domain subcarrier distribution and the range Cram\\'er-Rao\nbound (CRB), and time domain sensing symbol distribution and the velocity CRB,\nas well as between subcarrier distribution and achievable communication rates\nin narrowband systems. Based on the derived range and velocity CRB expressions,\nthe subcarrier and sensing symbol distribution schemes with the optimal and the\nworst sensing performance are respectively identified under both single-user\nequipment (single-UE) and multi-UE orthogonal frequency-division multiple\naccess (OFDMA) ISAC systems. Furthermore, it is demonstrated that the impact of\nsubcarrier distribution on achievable communication rates in synchronous\nnarrowband OFDMA ISAC systems is marginal. This insight reveals that the\nconstraints associated with subcarrier distribution optimization for achievable\nrates can be released. To substantiate our analysis, we present simulation\nresults that demonstrate the performance advantages of the proposed\ndistribution schemes.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}