{"id":"2407.17802","title":"Sample Enrichment via Temporary Operations on Subsequences for\n  Sequential Recommendation","authors":"Shu Chen, Jinwei Luo, Weike Pan, Jiangxing Yu, Xin Huang and Zhong\n  Ming","authorsParsed":[["Chen","Shu",""],["Luo","Jinwei",""],["Pan","Weike",""],["Yu","Jiangxing",""],["Huang","Xin",""],["Ming","Zhong",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 06:22:08 GMT"}],"updateDate":"2024-07-26","timestamp":1721888528000,"abstract":"  Sequential recommendation leverages interaction sequences to predict\nforthcoming user behaviors, crucial for crafting personalized recommendations.\nHowever, the true preferences of a user are inherently complex and\nhigh-dimensional, while the observed data is merely a simplified and\nlow-dimensional projection of the rich preferences, which often leads to\nprevalent issues like data sparsity and inaccurate model training. To learn\ntrue preferences from the sparse data, most existing works endeavor to\nintroduce some extra information or design some ingenious models. Although they\nhave shown to be effective, extra information usually increases the cost of\ndata collection, and complex models may result in difficulty in deployment.\nInnovatively, we avoid the use of extra information or alterations to the\nmodel; instead, we fill the transformation space between the observed data and\nthe underlying preferences with randomness. Specifically, we propose a novel\nmodel-agnostic and highly generic framework for sequential recommendation\ncalled sample enrichment via temporary operations on subsequences (SETO), which\ntemporarily and separately enriches the transformation space via sequence\nenhancement operations with rationality constraints in training. The\ntransformation space not only exists in the process from input samples to\npreferences but also in preferences to target samples. We highlight our SETO's\neffectiveness and versatility over multiple representative and state-of-the-art\nsequential recommendation models (including six single-domain sequential models\nand two cross-domain sequential models) across multiple real-world datasets\n(including three single-domain datasets, three cross-domain datasets and a\nlarge-scale industry dataset).\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}