{"id":"2407.21350","title":"Comparative analysis of structural, elastic, electronic, phonon, thermal\n  and optical properties of two $\\text{Na}_6\\text{Ge}_2\\text{Se}_6$ phases from\n  first principles calculations","authors":"Qi Zhang, Amitava Choudhury, Aleksandr Chernatynskiy","authorsParsed":[["Zhang","Qi",""],["Choudhury","Amitava",""],["Chernatynskiy","Aleksandr",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 05:42:22 GMT"}],"updateDate":"2024-08-01","timestamp":1722404542000,"abstract":"  The demand for new alkali metal chalcogenide materials is continuously\nincreasing due to their potential applications across various technological\nfields. Recently, a new compound, $\\text{Na}_6\\text{Ge}_2\\text{Se}_6$, was\ncomputationally predicted, representing a new phase distinct from the\nexperimentally observed $\\text{Na}_6\\text{Ge}_2\\text{Se}_6$ reported in 1985.\nNotably, this newly predicted phase displays a lower total energy compared to\nthe previously known experimental phase, as determined by first-principles\ncalculations. In this study, we undertake a thorough comparative analysis of\nthe structural, elastic, electronic, phonon, thermal, and optical properties of\nthese two $\\text{Na}_6\\text{Ge}_2\\text{Se}_6$ phases. Our results show that\nboth phases meet mechanical and dynamical stability criteria. The electronic\nband structure analysis confirms the semiconducting nature of both materials,\nwith a 2.97 eV indirect band gap for the predicted phase and a 2.93 eV direct\nband gap for the observed phase. Optically, both phases exhibit strong\nabsorption in the ultraviolet region. Thermal properties analysis reveals that\nthe predicted phase is more thermodynamically stable below 907 K, while the\nobserved phase shows greater thermodynamic stability above this temperature.\n","subjects":["Condensed Matter/Materials Science","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"N0WfPayQy9SzjCo9r_oZbXWg3Y2wtjw3eGwuIXUjejw","pdfSize":"6364321"}
