{"id":"2407.12956","title":"Strategies for CT Reconstruction using Diffusion Posterior Sampling with\n  a Nonlinear Model","authors":"Xiao Jiang, Shudong Li, Peiqing Teng, Grace Gang, and J. Webster\n  Stayman","authorsParsed":[["Jiang","Xiao",""],["Li","Shudong",""],["Teng","Peiqing",""],["Gang","Grace",""],["Stayman","J. Webster",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 18:56:46 GMT"}],"updateDate":"2024-07-19","timestamp":1721242606000,"abstract":"  Diffusion Posterior Sampling(DPS) methodology is a novel framework that\npermits nonlinear CT reconstruction by integrating a diffusion prior and an\nanalytic physical system model, allowing for one-time training for different\napplications. However, baseline DPS can struggle with large variability,\nhallucinations, and slow reconstruction. This work introduces a number of\nstrategies designed to enhance the stability and efficiency of DPS CT\nreconstruction. Specifically, jumpstart sampling allows one to skip many\nreverse time steps, significantly reducing the reconstruction time as well as\nthe sampling variability. Additionally, the likelihood update is modified to\nsimplify the Jacobian computation and improve data consistency more\nefficiently. Finally, a hyperparameter sweep is conducted to investigate the\neffects of parameter tuning and to optimize the overall reconstruction\nperformance. Simulation studies demonstrated that the proposed DPS technique\nachieves up to 46.72% PSNR and 51.50% SSIM enhancement in a low-mAs setting,\nand an over 31.43% variability reduction in a sparse-view setting. Moreover,\nreconstruction time is sped up from >23.5 s/slice to <1.5 s/slice. In a\nphysical data study, the proposed DPS exhibits robustness on an anthropomorphic\nphantom reconstruction which does not strictly follow the prior distribution.\nQuantitative analysis demonstrates that the proposed DPS can accommodate\nvarious dose levels and number of views. With 10% dose, only a 5.60% and 4.84%\nreduction of PSNR and SSIM was observed for the proposed approach. Both\nsimulation and phantom studies demonstrate that the proposed method can\nsignificantly improve reconstruction accuracy and reduce computational costs,\ngreatly enhancing the practicality of DPS CT reconstruction.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Physics/Medical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}