{"id":"2407.17627","title":"What makes a steady flow to favour kinematic magnetic field generation:\n  A statistical analysis","authors":"Francisco Stefano de Almeida, Roman Chertovskih, S\\'ilvio Gama and Rui\n  Gon\\c{c}alves","authorsParsed":[["de Almeida","Francisco Stefano",""],["Chertovskih","Roman",""],["Gama","Sílvio",""],["Gonçalves","Rui",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 20:35:19 GMT"}],"updateDate":"2024-07-26","timestamp":1721853319000,"abstract":"  To advance our understanding of the magnetohydrodynamic (MHD) processes in\nliquid metals, in this paper we propose an approach combining the classical\nmethods in the dynamo theory based on numerical simulations of the partial\ndifferential equations governing the evolution of the magnetic field with the\nstatistical methods. In this study, we intend to answer the following\n``optimization'' question: Can we find a statistical explanation what makes a\nflow to favour magnetic field generation in the linear regime (i.e. the\nkinematic dynamo is considered), where the Lorenz force is neglected? The flow\nis assumed to be steady and incompressible, and the magnetic field generation\nis governed by the magnetic induction equation. The behaviour of its solution\nis determined by the dominant (i.e. with the largest real part) eigenvalue of\nthe magnetic induction operator. Considering an ensemble of 2193 randomly\ngenerated flows, we solved the kinematic dynamo problem and performed an\nattempt to find a correlation between the dominant eigenvalue and the standard\nquantities used in hydrodynamics -- vorticity and kinetic helicity. We have\nfound that there is no visible relation between the property of the flow to be\na kinematic dynamo and these quantities. This enables us to conclude that the\nproblem requires a more elaborated approach to ``recognize'' if the flow is a\ndynamo or not; we plan to solve it using contemporary data-driven approach\nbased on deep neural networks.\n","subjects":["Physics/Fluid Dynamics","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}