{"id":"2407.01576","title":"The Future of Aerial Communications: A Survey of IRS-Enhanced UAV\n  Communication Technologies","authors":"Zina Chkirbene, Ala Gouissem, Ridha Hamila, Devrim Unal","authorsParsed":[["Chkirbene","Zina",""],["Gouissem","Ala",""],["Hamila","Ridha",""],["Unal","Devrim",""]],"versions":[{"version":"v1","created":"Sun, 2 Jun 2024 09:58:53 GMT"}],"updateDate":"2024-07-03","timestamp":1717322333000,"abstract":"  The advent of Intelligent Reflecting Surfaces (IRS) and Unmanned Aerial\nVehicles (UAVs) is setting a new benchmark in the field of wireless\ncommunications. IRS, with their groundbreaking ability to manipulate\nelectromagnetic waves, have opened avenues for substantial enhancements in\nsignal quality, network efficiency, and spectral usage. These surfaces\ndynamically reconfigure the propagation environment, leading to optimized\nsignal paths and reduced interference. Concurrently, UAVs have emerged as\ndynamic, versatile elements within communication networks, offering high\nmobility and the ability to access and enhance coverage in areas where\ntraditional, fixed infrastructure falls short. This paper presents a\ncomprehensive survey on the synergistic integration of IRS and UAVs in wireless\nnetworks, highlighting how this innovative combination substantially boosts\nnetwork performance, particularly in terms of security, energy efficiency, and\nreliability. The versatility of UAVs, combined with the signal-manipulating\nprowess of IRS, creates a potent solution for overcoming the limitations of\nconventional communication setups, especially in challenging and underserved\nenvironments. Furthermore, the survey delves into the cutting-edge realm of\nMachine Learning (ML), exploring its role in the strategic deployment and\noperational optimization of UAVs equipped with IRS. The paper also underscores\nthe latest research and practical advancements in this field, providing\ninsights into real-world applications and experimental setups. It concludes by\ndiscussing the future prospects and potential directions for this emerging\ntechnology, positioning the IRS-UAV integration as a transformative force in\nthe landscape of next-generation wireless\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SnEK7mL--ybZktOXDBDv37Pi1RCWUs5kA9hJKD1BkJg","pdfSize":"143644","objectId":"0x8a06f04576aca49d40612af9af9ca9e0dc7c23ce4fa686f014e8528e2c1613ae","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
