{"id":"2407.15688","title":"AI-Driven Fast and Early Detection of IoT Botnet Threats: A\n  Comprehensive Network Traffic Analysis Approach","authors":"Abdelaziz Amara korba, Aleddine Diaf, and Yacine Ghamri-Doudane","authorsParsed":[["korba","Abdelaziz Amara",""],["Diaf","Aleddine",""],["Ghamri-Doudane","Yacine",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:54:40 GMT"}],"updateDate":"2024-07-23","timestamp":1721660080000,"abstract":"  In the rapidly evolving landscape of cyber threats targeting the Internet of\nThings (IoT) ecosystem, and in light of the surge in botnet-driven Distributed\nDenial of Service (DDoS) and brute force attacks, this study focuses on the\nearly detection of IoT bots. It specifically addresses the detection of stealth\nbot communication that precedes and orchestrates attacks. This study proposes a\ncomprehensive methodology for analyzing IoT network traffic, including\nconsiderations for both unidirectional and bidirectional flow, as well as\npacket formats. It explores a wide spectrum of network features critical for\nrepresenting network traffic and characterizing benign IoT traffic patterns\neffectively. Moreover, it delves into the modeling of traffic using various\nsemi-supervised learning techniques. Through extensive experimentation with the\nIoT-23 dataset - a comprehensive collection featuring diverse botnet types and\ntraffic scenarios - we have demonstrated the feasibility of detecting botnet\ntraffic corresponding to different operations and types of bots, specifically\nfocusing on stealth command and control (C2) communications. The results\nobtained have demonstrated the feasibility of identifying C2 communication with\na 100% success rate through packet-based methods and 94% via flow based\napproaches, with a false positive rate of 1.53%.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mzvtcTtl_XCwhryQZ805MAB3C14veChlpJZLlp5y4WQ","pdfSize":"739142"}
