{"id":"2407.10652","title":"Cutting Through the Clutter: The Potential of LLMs for Efficient\n  Filtration in Systematic Literature Reviews","authors":"Lucas Joos, Daniel A. Keim, Maximilian T. Fischer","authorsParsed":[["Joos","Lucas",""],["Keim","Daniel A.",""],["Fischer","Maximilian T.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 12:13:53 GMT"}],"updateDate":"2024-07-16","timestamp":1721045633000,"abstract":"  In academic research, systematic literature reviews are foundational and\nhighly relevant, yet tedious to create due to the high volume of publications\nand labor-intensive processes involved. Systematic selection of relevant papers\nthrough conventional means like keyword-based filtering techniques can\nsometimes be inadequate, plagued by semantic ambiguities and inconsistent\nterminology, which can lead to sub-optimal outcomes. To mitigate the required\nextensive manual filtering, we explore and evaluate the potential of using\nLarge Language Models (LLMs) to enhance the efficiency, speed, and precision of\nliterature review filtering, reducing the amount of manual screening required.\nBy using models as classification agents acting on a structured database only,\nwe prevent common problems inherent in LLMs, such as hallucinations. We\nevaluate the real-world performance of such a setup during the construction of\na recent literature survey paper with initially more than 8.3k potentially\nrelevant articles under consideration and compare this with human performance\non the same dataset. Our findings indicate that employing advanced LLMs like\nGPT-4o, Claude 3.5 Sonnet, Gemini 1.5 Flash, or Llama3 with simple prompting\ncan significantly reduce the time required for literature filtering - from\nusually weeks of manual research to only a few minutes. Simultaneously, we\ncrucially show that false negatives can indeed be controlled through a\nconsensus scheme, achieving recalls >98.8% at or even beyond the typical human\nerror threshold, thereby also providing for more accurate and relevant articles\nselected. Our research not only demonstrates a substantial improvement in the\nmethodology of literature reviews but also sets the stage for further\nintegration and extensive future applications of responsible AI in academic\nresearch practices.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Digital Libraries","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}