{"id":"2407.08458","title":"Joint Optimization of Age of Information and Energy Consumption in\n  NR-V2X System based on Deep Reinforcement Learning","authors":"Shulin Song, Zheng Zhang, Qiong Wu, Qiang Fan and Pingyi Fan","authorsParsed":[["Song","Shulin",""],["Zhang","Zheng",""],["Wu","Qiong",""],["Fan","Qiang",""],["Fan","Pingyi",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 12:54:38 GMT"}],"updateDate":"2024-07-12","timestamp":1720702478000,"abstract":"  Autonomous driving may be the most important application scenario of next\ngeneration, the development of wireless access technologies enabling reliable\nand low-latency vehicle communication becomes crucial. To address this, 3GPP\nhas developed Vehicle-to-Everything (V2X) specifications based on 5G New Radio\n(NR) technology, where Mode 2 Side-Link (SL) communication resembles Mode 4 in\nLTE-V2X, allowing direct communication between vehicles. This supplements SL\ncommunication in LTE-V2X and represents the latest advancement in cellular V2X\n(C-V2X) with improved performance of NR-V2X. However, in NR-V2X Mode 2,\nresource collisions still occur, and thus degrade the age of information (AOI).\nTherefore, a interference cancellation method is employed to mitigate this\nimpact by combining NR-V2X with Non-Orthogonal multiple access (NOMA)\ntechnology. In NR-V2X, when vehicles select smaller resource reservation\ninterval (RRI), higher-frequency transmissions take ore energy to reduce AoI.\nHence, it is important to jointly consider AoI and communication energy\nconsumption based on NR-V2X communication. Then, we formulate such an\noptimization problem and employ the Deep Reinforcement Learning (DRL) algorithm\nto compute the optimal transmission RRI and transmission power for each\ntransmitting vehicle to reduce the energy consumption of each transmitting\nvehicle and the AoI of each receiving vehicle. Extensive simulations have\ndemonstrated the performance of our proposed algorithm.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}