{"id":"2407.09383","title":"SynCOM: An Empirical Model for High-Resolution Simulations of Transient\n  Solar Wind Flows","authors":"Valmir P. Moraes Filho, Vadim M. Uritsky, Barbara J. Thompson, Sarah\n  E. Gibson, Craig E. DeForest","authorsParsed":[["Filho","Valmir P. Moraes",""],["Uritsky","Vadim M.",""],["Thompson","Barbara J.",""],["Gibson","Sarah E.",""],["DeForest","Craig E.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 16:05:29 GMT"}],"updateDate":"2024-07-15","timestamp":1720800329000,"abstract":"  The Synthetic Corona Outflow Model (SynCOM), an empirical model, simulates\nthe solar corona's dynamics to match high-resolution observations, providing a\nuseful resource for testing velocity measurement algorithms. SynCOM generates\nsynthetic images depicting radial variability in polarized brightness and\nincludes stochastic elements for plasma outflows and instrumental noise. It\nemploys a predefined flow velocity probability distribution and an adjustable\nsignal-to-noise ratio to evaluate different data analysis methods for coronal\nflows. By adjusting parameters to match specific coronal and instrumental\nconditions, SynCOM offers a platform to assess these methods for determining\ncoronal velocity and acceleration. Validating these measurements would help to\nunderstand solar wind origins and support missions such as the Polarimeter to\nUnify the Corona and Heliosphere (PUNCH). In this study, we demonstrate how\nSynCOM can be employed to assess the precision and performance of two different\nflow tracking methods. By providing a ground-truth based on observational data,\nwe highlight the importance of SynCOM in confirming observational standards for\ndetecting coronal flows.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"G2fuZIYC9opmoKZfA5NAfZ_ZIFrE6m70NNHGMoFjuhI","pdfSize":"19752617","objectId":"0xd0d18d99d26749e076b4c8678109363c61e2d64d8711d89763cd76bf9fc0ac85","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
