{"id":"2407.00803","title":"Controlling Face's Frame generation in StyleGAN's latent space\n  operations: Modifying faces to deceive our memory","authors":"Agust\\'in Roca and Nicol\\'as Ignacio Britos","authorsParsed":[["Roca","Agustín",""],["Britos","Nicolás Ignacio",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 19:10:22 GMT"}],"updateDate":"2024-07-02","timestamp":1719774622000,"abstract":"  Innocence Project is a non-profitable organization that works in reducing\nwrongful convictions. In collaboration with Laboratorio de Sue\\~no y Memoria\nfrom Instituto Tecnol\\'ogico de Buenos Aires (ITBA), they are studying human\nmemory in the context of face identification. They have a strong hypothesis\nstating that human memory heavily relies in face's frame to recognize faces. If\nthis is proved, it could mean that face recognition in police lineups couldn't\nbe trusted, as they may lead to wrongful convictions. This study uses\nexperiments in order to try to prove this using faces with different\nproperties, such as eyes size, but maintaining its frame as much as possible.\n  In this project, we continue the work from a previous project that provided\nthe basic tool to generate realistic faces using StyleGAN2. We take a deep dive\ninto the internals of this tool to make full use of StyleGAN2 functionalities,\nwhile also adding more features, such as modifying certain of its attributes,\nincluding mouth-opening or eye-opening.\n  As the usage of this tool heavily relies on maintaining the face-frame, we\ndevelop a way to identify the face-frame of each image and a function to\ncompare it to the output of the neural network after applying some operations.\n  We conclude that the face-frame is maintained when modifying eye-opening or\nmouth opening. When modifying vertical face orientation, gender, age and smile,\nhave a considerable impact on its frame variation. And finally, the horizontal\nface orientation shows a major impact on the face-frame. This way, the Lab may\napply some operations being confident that the face-frame won't significantly\nchange, making them viable to be used to deceive subjects' memories.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"uxAWt4vHcDT2vditSy15NBUr5ezri1_dLjqRyrdqAYs","pdfSize":"44328843"}
