{"id":"2407.14258","title":"An Optimal Control Framework for Airborne Wind Energy Systems with a\n  Flexible Tether","authors":"Omid Heydarnia, Jolan Wauters, Tom Lefebvre, and Guillaume Crevecoeur","authorsParsed":[["Heydarnia","Omid",""],["Wauters","Jolan",""],["Lefebvre","Tom",""],["Crevecoeur","Guillaume",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 12:36:49 GMT"}],"updateDate":"2024-07-22","timestamp":1721392609000,"abstract":"  In this work, we establish an optimal control framework for airborne wind\nenergy systems (AWESs) with flexible tethers. The AWES configuration,\nconsisting of a six-degree-of-freedom aircraft, a flexible tether, and a winch,\nis formulated as an index-1 differential-algebraic system of equations (DAE).\nWe achieve this by adopting a minimal coordinate representation that uses Euler\nangles to characterize the aircraft's attitude and employing a quasi-static\napproach for the tether. The presented method contrasts with other recent\noptimization studies that use an index-3 DAE approach. By doing so, our\napproach avoids related inconsistency condition problems. We use a homotopy\nstrategy to solve the optimal control problem that ultimately generates optimal\ntrajectories of the AWES with a flexible tether. We furthermore compare with a\nrigid tether model by investigating the resulting mechanical powers and tether\nforces. Simulation results demonstrate the efficacy of the presented\nmethodology and the necessity to incorporate the flexibility of the tether when\nsolving the optimal control problem.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"b-RM9q6S3HFY67C9oZcJm3Kp0fJYzyOsfwLd0PzaFDc","pdfSize":"3896194","objectId":"0xda6afa0256ef93bf00576efc11fb28f9a2e0c1bd5da373d005f5e0364396bdc6","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
