{"id":"2407.08556","title":"Enhancing 3D Planetary Atmosphere Simulations with a Surrogate Radiative\n  Transfer Model","authors":"Tara P. A. Tahseen, Jo\\~ao M. Mendon\\c{c}a, Kai Hou Yip and Ingo P.\n  Waldmann","authorsParsed":[["Tahseen","Tara P. A.",""],["Mendonça","João M.",""],["Yip","Kai Hou",""],["Waldmann","Ingo P.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:39:59 GMT"}],"updateDate":"2024-07-12","timestamp":1720708799000,"abstract":"  This work introduces an approach to enhancing the computational efficiency of\n3D atmospheric simulations by integrating a machine-learned surrogate model\ninto the OASIS global circulation model (GCM). Traditional GCMs, which are\nbased on repeatedly numerically integrating physical equations governing\natmospheric processes across a series of time-steps, are time-intensive,\nleading to compromises in spatial and temporal resolution of simulations. This\nresearch improves upon this limitation, enabling higher resolution simulations\nwithin practical timeframes. Speeding up 3D simulations holds significant\nimplications in multiple domains. Firstly, it facilitates the integration of 3D\nmodels into exoplanet inference pipelines, allowing for robust characterisation\nof exoplanets from a previously unseen wealth of data anticipated from JWST and\npost-JWST instruments. Secondly, acceleration of 3D models will enable higher\nresolution atmospheric simulations of Earth and Solar System planets, enabling\nmore detailed insights into their atmospheric physics and chemistry. Our method\nreplaces the radiative transfer module in OASIS with a recurrent neural\nnetwork-based model trained on simulation inputs and outputs. Radiative\ntransfer is typically one of the slowest components of a GCM, thus providing\nthe largest scope for overall model speed-up. The surrogate model was trained\nand tested on the specific test case of the Venusian atmosphere, to benchmark\nthe utility of this approach in the case of non-terrestrial atmospheres. This\napproach yields promising results, with the surrogate-integrated GCM\ndemonstrating above 99.0% accuracy and 101 factor GPU speed-up of the entire\nsimulation compared to using the matched original GCM under Venus-like\nconditions.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"eGM6MVVfodMvc8Ptv-TaOYfmyfNb2V3gFFaRD6kv4M4","pdfSize":"1900017","objectId":"0xcada016b39d4171023978441b85af8ab6ab63a893184891a9e43ea1bebef2fe4","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
