{"id":"2407.02877","title":"Resource Allocation Design for Next-Generation Multiple Access: A\n  Tutorial Overview","authors":"Zhiqiang Wei and Dongfang Xu and Shuangyang Li and Shenghui Song and\n  Derrick Wing Kwan Ng and Giuseppe Caire","authorsParsed":[["Wei","Zhiqiang",""],["Xu","Dongfang",""],["Li","Shuangyang",""],["Song","Shenghui",""],["Ng","Derrick Wing Kwan",""],["Caire","Giuseppe",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 07:45:39 GMT"}],"updateDate":"2024-07-04","timestamp":1719992739000,"abstract":"  Multiple access is the cornerstone technology for each generation of wireless\ncellular networks and resource allocation design plays a crucial role in\nmultiple access. In this paper, we present a comprehensive tutorial overview\nfor junior researchers in this field, aiming to offer a foundational guide for\nresource allocation design in the context of next-generation multiple access\n(NGMA). Initially, we identify three types of channels in future wireless\ncellular networks over which NGMA will be implemented, namely: natural\nchannels, reconfigurable channels, and functional channels. Natural channels\nare traditional uplink and downlink communication channels; reconfigurable\nchannels are defined as channels that can be proactively reshaped via emerging\nplatforms or techniques, such as intelligent reflecting surface (IRS), unmanned\naerial vehicle (UAV), and movable/fluid antenna (M/FA); and functional channels\nsupport not only communication but also other functionalities simultaneously,\nwith typical examples including integrated sensing and communication (ISAC) and\njoint computing and communication (JCAC) channels. Then, we introduce NGMA\nmodels applicable to these three types of channels that cover most of the\npractical communication scenarios of future wireless communications.\nSubsequently, we articulate the key optimization technical challenges inherent\nin the resource allocation design for NGMA, categorizing them into\nrate-oriented, power-oriented, and reliability-oriented resource allocation\ndesigns. The corresponding optimization approaches for solving the formulated\nresource allocation design problems are then presented. Finally, simulation\nresults are presented and discussed to elucidate the practical implications and\ninsights derived from resource allocation designs in NGMA.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}