{"id":"2407.10028","title":"Time-Integrated Spike-Timing-Dependent-Plasticity","authors":"William Gebhardt and Alexander G. Ororbia","authorsParsed":[["Gebhardt","William",""],["Ororbia","Alexander G.",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 23:52:22 GMT"}],"updateDate":"2024-07-16","timestamp":1720914742000,"abstract":"  In this work, we propose time-integrated spike-timing-dependent plasticity\n(TI-STDP), a mathematical model of synaptic plasticity that allows spiking\nneural networks to continuously adapt to sensory input streams in an\nunsupervised fashion. Notably, we theoretically establish and formally prove\nkey properties related to the synaptic adjustment mechanics that underwrite\nTI-STDP. Empirically, we demonstrate the efficacy of TI-STDP in simulations of\njointly learning deeper spiking neural networks that process input digit pixel\npatterns, at both full image and patch-levels, comparing to two powerful\nhistorical instantations of STDP; trace-based STDP (TR-STDP) and event-based\npost-synaptic STDP (EV-STDP). Usefully, we demonstrate that not only are all\nforms of STDP capable of meaningfully adapting the synaptic efficacies of a\nmulti-layer biophysical architecture, but that TI-STDP is notably able to do so\nwithout requiring the tracking of a large window of pre- and post-synaptic\nspike timings, the maintenance of additional parameterized traces, or the\nrestriction of synaptic plasticity changes to occur within very narrow windows\nof time. This means that our findings show that TI-STDP can efficiently embody\nthe benefits of models such as canonical STDP, TR-STDP, and EV-STDP without\ntheir costs or drawbacks. Usefully, our results further demonstrate the promise\nof using a spike-correlation scheme such as TI-STDP in conducting credit\nassignment in discrete pulse-based neuromorphic models, particularly those than\nacquire a lower-level distributed representation jointly with an upper-level,\nmore abstract representation that self-organizes to cluster based on inherent\ncross-pattern similarities. We further demonstrate TI-STDP's effectiveness in\nadapting a simple neuronal circuit that learns a simple bi-level, part-whole\nhierarchy from sensory input patterns.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}