{"id":"2407.20091","title":"Trainability maximization using estimation of distribution algorithms\n  assisted by surrogate modelling for quantum architecture search","authors":"Vicente P. Soloviev and Vedran Dunjko and Concha Bielza and Pedro\n  Larra\\~naga and Hao Wang","authorsParsed":[["Soloviev","Vicente P.",""],["Dunjko","Vedran",""],["Bielza","Concha",""],["Larrañaga","Pedro",""],["Wang","Hao",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:22:39 GMT"}],"updateDate":"2024-07-30","timestamp":1722266559000,"abstract":"  Quantum architecture search (QAS) involves optimizing both the quantum\nparametric circuit configuration but also its parameters for a variational\nquantum algorithm. Thus, the problem is known to be multi-level as the\nperformance of a given architecture is unknown until its parameters are tuned\nusing classical routines. Moreover, the task becomes even more complicated\nsince well-known trainability issues, e.g., barren plateaus (BPs), can occur.\nIn this paper, we aim to achieve two improvements in QAS: (1) to reduce the\nnumber of measurements by an online surrogate model of the evaluation process\nthat aggressively discards architectures of poor performance; (2) to avoid\ntraining the circuits when BPs are present. To detect the presence of the BPs,\nwe employed a recently developed metric, information content, which only\nrequires measuring the energy values of a small set of parameters to estimate\nthe magnitude of cost function's gradient. The main idea of this proposal is to\nleverage a recently developed metric which can be used to detect the onset of\nvanishing gradients to ensure the overall search avoids such unfavorable\nregions. We experimentally validate our proposal for the variational quantum\neigensolver and showcase that our algorithm is able to find solutions that have\nbeen previously proposed in the literature for the Hamiltonians; but also to\noutperform the state of the art when initializing the method from the set of\narchitectures proposed in the literature. The results suggest that the proposed\nmethodology could be used in environments where it is desired to improve the\ntrainability of known architectures while maintaining good performance.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}