{"id":"2407.11356","title":"The Devil is in the Statistics: Mitigating and Exploiting Statistics\n  Difference for Generalizable Semi-supervised Medical Image Segmentation","authors":"Muyang Qiu, Jian Zhang, Lei Qi, Qian Yu, Yinghuan Shi, Yang Gao","authorsParsed":[["Qiu","Muyang",""],["Zhang","Jian",""],["Qi","Lei",""],["Yu","Qian",""],["Shi","Yinghuan",""],["Gao","Yang",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 03:41:48 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 12:58:29 GMT"}],"updateDate":"2024-08-02","timestamp":1721101308000,"abstract":"  Despite the recent success of domain generalization in medical image\nsegmentation, voxel-wise annotation for all source domains remains a huge\nburden. Semi-supervised domain generalization has been proposed very recently\nto combat this challenge by leveraging limited labeled data along with abundant\nunlabeled data collected from multiple medical institutions, depending on\nprecisely harnessing unlabeled data while improving generalization\nsimultaneously. In this work, we observe that domain shifts between medical\ninstitutions cause disparate feature statistics, which significantly\ndeteriorates pseudo-label quality due to an unexpected normalization process.\nNevertheless, this phenomenon could be exploited to facilitate unseen domain\ngeneralization. Therefore, we propose 1) multiple statistics-individual\nbranches to mitigate the impact of domain shifts for reliable pseudo-labels and\n2) one statistics-aggregated branch for domain-invariant feature learning.\nFurthermore, to simulate unseen domains with statistics difference, we approach\nthis from two aspects, i.e., a perturbation with histogram matching at image\nlevel and a random batch normalization selection strategy at feature level,\nproducing diverse statistics to expand the training distribution. Evaluation\nresults on three medical image datasets demonstrate the effectiveness of our\nmethod compared with recent SOTA methods. The code is available at\nhttps://github.com/qiumuyang/SIAB.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Szfxbv0zoaU7dgwLQLYYgiiPZfsuFdReeCKOYhFjKqg","pdfSize":"4631527","objectId":"0xeef81bb915311f59d0d0929c94c4aff02b44f405210605ac6adae72a448191ba","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
