{"id":"2407.05267","title":"DTR: A Unified Deep Tensor Representation Framework for Multimedia Data\n  Recovery","authors":"Ting-Wei Zhou, Xi-Le Zhao, Jian-Li Wang, Yi-Si Luo, Min Wang,\n  Xiao-Xuan Bai, and Hong Yan","authorsParsed":[["Zhou","Ting-Wei",""],["Zhao","Xi-Le",""],["Wang","Jian-Li",""],["Luo","Yi-Si",""],["Wang","Min",""],["Bai","Xiao-Xuan",""],["Yan","Hong",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 05:44:40 GMT"}],"updateDate":"2024-07-09","timestamp":1720331080000,"abstract":"  Recently, the transform-based tensor representation has attracted increasing\nattention in multimedia data (e.g., images and videos) recovery problems, which\nconsists of two indispensable components, i.e., transform and characterization.\nPreviously, the development of transform-based tensor representation mainly\nfocuses on the transform aspect. Although several attempts consider using\nshallow matrix factorization (e.g., singular value decomposition and negative\nmatrix factorization) to characterize the frontal slices of transformed tensor\n(termed as latent tensor), the faithful characterization aspect is\nunderexplored. To address this issue, we propose a unified Deep Tensor\nRepresentation (termed as DTR) framework by synergistically combining the deep\nlatent generative module and the deep transform module. Especially, the deep\nlatent generative module can faithfully generate the latent tensor as compared\nwith shallow matrix factorization. The new DTR framework not only allows us to\nbetter understand the classic shallow representations, but also leads us to\nexplore new representation. To examine the representation ability of the\nproposed DTR, we consider the representative multi-dimensional data recovery\ntask and suggest an unsupervised DTR-based multi-dimensional data recovery\nmodel. Extensive experiments demonstrate that DTR achieves superior performance\ncompared to state-of-the-art methods in both quantitative and qualitative\naspects, especially for fine details recovery.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}