{"id":"2407.13551","title":"Decoding the interaction mediators from landscape-induced spatial\n  patterns","authors":"E.H. Colombo, L. Defaveri, C. Anteneodo","authorsParsed":[["Colombo","E. H.",""],["Defaveri","L.",""],["Anteneodo","C.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 14:25:18 GMT"}],"updateDate":"2024-07-19","timestamp":1721312718000,"abstract":"  Interactions between organisms are mediated by an intricate network of\nphysico-chemical substances and other organisms. Understanding the dynamics of\nmediators and how they shape the population spatial distribution is key to\npredict ecological outcomes and how they would be transformed by changes in\nenvironmental constraints. However, due to the inherent complexity involved,\nthis task is often unfeasible, from the empirical and theoretical perspectives.\nIn this paper, we make progress in addressing this central issue, creating a\nbridge that provides a two-way connection between the features of the ensemble\nof underlying mediators and the wrinkles in the population density induced by a\nlandscape defect (or spatial perturbation). The bridge is constructed by\napplying the Feynman-Vernon decomposition, which disentangles the influences\namong the focal population and the mediators in a compact way. This is achieved\nthough an interaction kernel, which effectively incorporates the mediators'\ndegrees of freedom, explaining the emergence of nonlocal influence between\nindividuals, an ad hoc assumption in modeling population dynamics. Concrete\nexamples are worked out and reveal the complexity behind a possible top-down\ninference procedure.\n","subjects":["Quantitative Biology/Populations and Evolution","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9qLGqYAbrCEi8Z87CYmMx0gapoTkcFNFIbc_19sHRHM","pdfSize":"1221219","objectId":"0x5b14d23c944544afeb99e50d68f4eec57d077e6e9e07d4bdc90c9b6e2ef6e263","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
