{"id":"2407.19269","title":"A Bayesian Approach Toward Robust Multidimensional Ellipsoid-Specific\n  Fitting","authors":"Zhao Mingyang, Jia Xiaohong, Ma Lei, Shi Yuke, Jiang Jingen, Li\n  Qizhai, Yan Dong-Ming, Huang Tiejun","authorsParsed":[["Mingyang","Zhao",""],["Xiaohong","Jia",""],["Lei","Ma",""],["Yuke","Shi",""],["Jingen","Jiang",""],["Qizhai","Li",""],["Dong-Ming","Yan",""],["Tiejun","Huang",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 14:31:51 GMT"}],"updateDate":"2024-07-30","timestamp":1722090711000,"abstract":"  This work presents a novel and effective method for fitting multidimensional\nellipsoids to scattered data in the contamination of noise and outliers. We\napproach the problem as a Bayesian parameter estimate process and maximize the\nposterior probability of a certain ellipsoidal solution given the data. We\nestablish a more robust correlation between these points based on the\npredictive distribution within the Bayesian framework. We incorporate a uniform\nprior distribution to constrain the search for primitive parameters within an\nellipsoidal domain, ensuring ellipsoid-specific results regardless of inputs.\nWe then establish the connection between measurement point and model data via\nBayes' rule to enhance the method's robustness against noise. Due to\nindependent of spatial dimensions, the proposed method not only delivers\nhigh-quality fittings to challenging elongated ellipsoids but also generalizes\nwell to multidimensional spaces. To address outlier disturbances, often\noverlooked by previous approaches, we further introduce a uniform distribution\non top of the predictive distribution to significantly enhance the algorithm's\nrobustness against outliers. We introduce an {\\epsilon}-accelerated technique\nto expedite the convergence of EM considerably. To the best of our knowledge,\nthis is the first comprehensive method capable of performing multidimensional\nellipsoid specific fitting within the Bayesian optimization paradigm under\ndiverse disturbances. We evaluate it across lower and higher dimensional spaces\nin the presence of heavy noise, outliers, and substantial variations in axis\nratios. Also, we apply it to a wide range of practical applications such as\nmicroscopy cell counting, 3D reconstruction, geometric shape approximation, and\nmagnetometer calibration tasks.\n","subjects":["Statistics/Methodology","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"g9hp0Tf_JGllQxuK-5E8Ao8KrH_M_pRxRVNw3Hyfy-I","pdfSize":"14568655"}
