{"id":"2407.04256","title":"Dynamics of Heatwave Intensification over the Indian Region","authors":"Lekshmi S, Rajib Chattopadhyay, D.S. Pai","authorsParsed":[["S","Lekshmi",""],["Chattopadhyay","Rajib",""],["Pai","D. S.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 04:58:04 GMT"}],"updateDate":"2024-07-08","timestamp":1720155484000,"abstract":"  In a warming world, heatwaves over India have become intense and are causing\nsevere health impacts. Studies have identified the presence of amplified Rossby\nwaves and their association with the intensification of heatwaves. Earlier\nstudies have identified two dominant modes of temperature variability in India\nand their possible role in the development of dry (mode 1) and moist (mode 2)\nheatwaves. These modes are associated with midlatitude Rossby waves intruding\nover the Indian region. However the role of regional forcing and the\nteleconnection behind the intensification of the heatwaves over India is\nmissing. The present study has analyzed the dynamical mechanisms for the\nregional intensification of the circulation features associated with the\ndominant moist heatwave mode (mode 2). Considering the predominant barotropic\nnature of the observed circulation features of the mode, a simple barotropic\nvorticity equation model forced with extratropical and regional vorticity\nsources is used to understand the intensification of the heat waves. It was\nfound that a wave response initiated by a cyclonic vorticity over the Bay of\nBengal superimposes with the mid-latitude anticyclonic vorticity generated\nRossby waves intruding over India. This superimposition results in the\namplification and persistence of the anticyclonic vorticity phase over the\nNorthwest Indian region, leading to the intensification of circulation. It was\nalso found that the barotropically forced intensified circulation leads to the\nintensification of the heat stress. Under a climate change scenario, different\ncirculation regimes, characterized by zonal stationary wave number and jet\nspeed, which can favor the intensification are also identified.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}