{"id":"2407.11529","title":"Cross-Phase Mutual Learning Framework for Pulmonary Embolism\n  Identification on Non-Contrast CT Scans","authors":"Bizhe Bai, Yan-Jie Zhou, Yujian Hu, Tony C. W. Mok, Yilang Xiang, Le\n  Lu, Hongkun Zhang, Minfeng Xu","authorsParsed":[["Bai","Bizhe",""],["Zhou","Yan-Jie",""],["Hu","Yujian",""],["Mok","Tony C. W.",""],["Xiang","Yilang",""],["Lu","Le",""],["Zhang","Hongkun",""],["Xu","Minfeng",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 09:29:33 GMT"}],"updateDate":"2024-07-17","timestamp":1721122173000,"abstract":"  Pulmonary embolism (PE) is a life-threatening condition where rapid and\naccurate diagnosis is imperative yet difficult due to predominantly atypical\nsymptomatology. Computed tomography pulmonary angiography (CTPA) is\nacknowledged as the gold standard imaging tool in clinics, yet it can be\ncontraindicated for emergency department (ED) patients and represents an\nonerous procedure, thus necessitating PE identification through non-contrast CT\n(NCT) scans. In this work, we explore the feasibility of applying a\ndeep-learning approach to NCT scans for PE identification. We propose a novel\nCross-Phase Mutual learNing framework (CPMN) that fosters knowledge transfer\nfrom CTPA to NCT, while concurrently conducting embolism segmentation and\nabnormality classification in a multi-task manner. The proposed CPMN leverages\nthe Inter-Feature Alignment (IFA) strategy that enhances spatial contiguity and\nmutual learning between the dual-pathway network, while the Intra-Feature\nDiscrepancy (IFD) strategy can facilitate precise segmentation of PE against\ncomplex backgrounds for single-pathway networks. For a comprehensive assessment\nof the proposed approach, a large-scale dual-phase dataset containing 334 PE\npatients and 1,105 normal subjects has been established. Experimental results\ndemonstrate that CPMN achieves the leading identification performance, which is\n95.4\\% and 99.6\\% in patient-level sensitivity and specificity on NCT scans,\nindicating the potential of our approach as an economical, accessible, and\nprecise tool for PE identification in clinical practice.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}