{"id":"2407.06828","title":"ZTF SN Ia DR2: The spectral diversity of Type Ia supernovae in a\n  volume-limited sample","authors":"U. Burgaz, K. Maguire, G. Dimitriadis, L. Harvey, R. Senzel, J.\n  Sollerman, J. Nordin, L. Galbany, M. Rigault, M. Smith, A. Goobar, J.\n  Johansson, P. Rosnet, M. Amenouche, M. Deckers, S. Dhawan, M. Ginolin, Y.-L.\n  Kim, A. A. Miller, T. E. Muller-Bravo, P. E. Nugent, J. H. Terwel, R. Dekany,\n  A. Drake, M. J. Graham, S. L. Groom, M. M. Kasliwal, S. R. Kulkarni, K.\n  Nolan, G. Nir, R. L. Riddle, B. Rusholme, Y. Sharma","authorsParsed":[["Burgaz","U.",""],["Maguire","K.",""],["Dimitriadis","G.",""],["Harvey","L.",""],["Senzel","R.",""],["Sollerman","J.",""],["Nordin","J.",""],["Galbany","L.",""],["Rigault","M.",""],["Smith","M.",""],["Goobar","A.",""],["Johansson","J.",""],["Rosnet","P.",""],["Amenouche","M.",""],["Deckers","M.",""],["Dhawan","S.",""],["Ginolin","M.",""],["Kim","Y. -L.",""],["Miller","A. A.",""],["Muller-Bravo","T. E.",""],["Nugent","P. E.",""],["Terwel","J. H.",""],["Dekany","R.",""],["Drake","A.",""],["Graham","M. J.",""],["Groom","S. L.",""],["Kasliwal","M. M.",""],["Kulkarni","S. R.",""],["Nolan","K.",""],["Nir","G.",""],["Riddle","R. L.",""],["Rusholme","B.",""],["Sharma","Y.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 13:01:15 GMT"}],"updateDate":"2024-07-10","timestamp":1720530075000,"abstract":"  More than 3000 spectroscopically confirmed Type Ia supernovae (SNe Ia) are\npresented in the Zwicky Transient Facility SN Ia Data Release 2 (ZTF DR2). In\nthis paper, we detail the spectral properties of 482 SNe Ia near maximum light,\nup to a redshift limit of $z$ $\\leq$ 0.06. We measure the velocities and\npseudo-equivalent widths (pEW) of key spectral features (Si II $\\lambda$5972\nand Si II $\\lambda$6355) and investigate the relation between the properties of\nthe spectral features and the photometric properties from the SALT2 light-curve\nparameters as a function of spectroscopic sub-class. We discuss the\nnon-negligible impact of host galaxy contamination on SN Ia spectral\nclassifications, as well as investigate the accuracy of spectral template\nmatching of the ZTF DR2 sample. We define a new subclass of underluminous SNe\nIa (`04gs-like') that lie spectroscopically between normal SNe Ia and\ntransitional 86G-like SNe Ia (stronger Si II $\\lambda$5972 than normal SNe Ia\nbut significantly weaker Ti II features than `86G-like' SNe). We model these\n`04gs-like' SN Ia spectra using the radiative-transfer spectral synthesis code\ntardis and show that cooler temperatures alone are unable to explain their\nspectra; some changes in elemental abundances are also required. However, the\nbroad continuity in spectral properties seen from bright (`91T-like') to faint\nnormal SN Ia, including the transitional and 91bg-like SNe Ia, suggests that\nvariations within a single explosion model may be able to explain their\nbehaviour.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ffEdkl1AQV2HnIkKpfgHRmU9UxumNn5sQgAqQl2NVcg","pdfSize":"1786366"}
