{"id":"2407.02229","title":"LaMoD: Latent Motion Diffusion Model For Myocardial Strain Generation","authors":"Jiarui Xing, Nivetha Jayakumar, Nian Wu, Yu Wang, Frederick H.\n  Epstein, Miaomiao Zhang","authorsParsed":[["Xing","Jiarui",""],["Jayakumar","Nivetha",""],["Wu","Nian",""],["Wang","Yu",""],["Epstein","Frederick H.",""],["Zhang","Miaomiao",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 12:54:32 GMT"}],"updateDate":"2024-07-03","timestamp":1719924872000,"abstract":"  Motion and deformation analysis of cardiac magnetic resonance (CMR) imaging\nvideos is crucial for assessing myocardial strain of patients with abnormal\nheart functions. Recent advances in deep learning-based image registration\nalgorithms have shown promising results in predicting motion fields from\nroutinely acquired CMR sequences. However, their accuracy often diminishes in\nregions with subtle appearance change, with errors propagating over time.\nAdvanced imaging techniques, such as displacement encoding with stimulated\nechoes (DENSE) CMR, offer highly accurate and reproducible motion data but\nrequire additional image acquisition, which poses challenges in busy clinical\nflows. In this paper, we introduce a novel Latent Motion Diffusion model\n(LaMoD) to predict highly accurate DENSE motions from standard CMR videos. More\nspecifically, our method first employs an encoder from a pre-trained\nregistration network that learns latent motion features (also considered as\ndeformation-based shape features) from image sequences. Supervised by the\nground-truth motion provided by DENSE, LaMoD then leverages a probabilistic\nlatent diffusion model to reconstruct accurate motion from these extracted\nfeatures. Experimental results demonstrate that our proposed method, LaMoD,\nsignificantly improves the accuracy of motion analysis in standard CMR images;\nhence improving myocardial strain analysis in clinical settings for cardiac\npatients. Our code will be publicly available on upon acceptance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AS9s4W2kFUaXeqh1Hc314EZyKi808xg1LnNRlZM6CyA","pdfSize":"7118117"}
