{"id":"2407.18912","title":"Validating the clustering predictions of empirical models with the\n  FLAMINGO simulations","authors":"Sergio Contreras, Raul E. Angulo, Jon\\'as Chaves-Montero, Roi Kugel,\n  Matthieu Schaller, Joop Schaye","authorsParsed":[["Contreras","Sergio",""],["Angulo","Raul E.",""],["Chaves-Montero","Jonás",""],["Kugel","Roi",""],["Schaller","Matthieu",""],["Schaye","Joop",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:59:53 GMT"}],"updateDate":"2024-07-29","timestamp":1722016793000,"abstract":"  Context. Mock galaxy catalogues are essential for correctly interpreting\ncurrent and future generations of galaxy surveys. Despite their significance in\ngalaxy formation and cosmology, little to no work has been done to validate the\npredictions of these mocks for high-order clustering statistics.\n  Aims. We compare the predicting power of the latest generation of empirical\nmodels used in the creation of mock galaxy catalogues: a 13-parameter Halo\nOccupation Distribution (HOD) and an extension of the SubHalo Abundance\nMatching technique (SHAMe).\n  Methods. We build GalaxyEmu-Planck, an emulator that makes precise\npredictions for the two-point correlation function, galaxy-galaxy lensing\n(restricted to distances greater than 1 $h^{-1} {\\rm Mpc}$ to avoid baryonic\neffects), and other high-order statistics resulting from the evaluation of\nSHAMe and HOD models.\n  Results. We evaluate the precision of GalaxyEmu-Planck using two galaxy\nsamples extracted from the FLAMINGO hydrodynamical simulation that mimic the\nproperties of DESI-BGS and BOSS galaxies, finding that the emulator reproduces\nall the predicted statistics precisely. The HOD showed comparable performance\nwhen fitting galaxy clustering and galaxy-galaxy lensing. In contrast, the\nSHAMe model showed better predictions for higher-order statistics, especially\nregarding the galaxy assembly bias. We also tested the performance of the\nmodels after removing some of their extensions, finding that we can withdraw\ntwo of the HOD parameters without a loss of performance.\n  Conclusions. The results of this paper validate the current generation of\nempirical models as a way to reproduce galaxy clustering, galaxy-galaxy lensing\nand other high-order statistics. The excellent performance of the SHAMe model\nwith a small number of free parameters suggests that it is a valid method to\nextract cosmological constraints from galaxy clustering.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}