{"id":"2407.15631","title":"A Diffusion Model for Simulation Ready Coronary Anatomy with\n  Morpho-skeletal Control","authors":"Karim Kadry, Shreya Gupta, Jonas Sogbadji, Michiel Schaap, Kersten\n  Petersen, Takuya Mizukami, Carlos Collet, Farhad R. Nezami, and Elazer R.\n  Edelman","authorsParsed":[["Kadry","Karim",""],["Gupta","Shreya",""],["Sogbadji","Jonas",""],["Schaap","Michiel",""],["Petersen","Kersten",""],["Mizukami","Takuya",""],["Collet","Carlos",""],["Nezami","Farhad R.",""],["Edelman","Elazer R.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 13:44:06 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 14:51:18 GMT"}],"updateDate":"2024-07-24","timestamp":1721655846000,"abstract":"  Virtual interventions enable the physics-based simulation of device\ndeployment within coronary arteries. This framework allows for counterfactual\nreasoning by deploying the same device in different arterial anatomies.\nHowever, current methods to create such counterfactual arteries face a\ntrade-off between controllability and realism. In this study, we investigate\nhow Latent Diffusion Models (LDMs) can custom synthesize coronary anatomy for\nvirtual intervention studies based on mid-level anatomic constraints such as\ntopological validity, local morphological shape, and global skeletal structure.\nWe also extend diffusion model guidance strategies to the context of\nmorpho-skeletal conditioning and propose a novel guidance method for continuous\nattributes that adaptively updates the negative guiding condition throughout\nsampling. Our framework enables the generation and editing of coronary anatomy\nin a controllable manner, allowing device designers to derive mechanistic\ninsights regarding anatomic variation and simulated device deployment.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oBYMVgZQ4SmnD8zrN5JQoEsu5ToLL0NbWFklhGGFZgM","pdfSize":"14937209"}
