{"id":"2407.05161","title":"A Survey of Datasets for Information Diffusion Tasks","authors":"Fuxia Guo, Xiaowen Wang, Yanwei Xie, Zehao Wang, Jingqiu Li, Lanjun\n  Wang","authorsParsed":[["Guo","Fuxia",""],["Wang","Xiaowen",""],["Xie","Yanwei",""],["Wang","Zehao",""],["Li","Jingqiu",""],["Wang","Lanjun",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 19:38:41 GMT"}],"updateDate":"2024-07-09","timestamp":1720294721000,"abstract":"  Information diffusion across various new media platforms gradually influences\nperceptions, decisions, and social behaviors of individual users. In\ncommunication studies, the famous Five W's of Communication model (5W Model)\nhas displayed the process of information diffusion clearly. At present,\nalthough plenty of studies and corresponding datasets about information\ndiffusion have emerged, a systematic categorization of tasks and an integration\nof datasets are still lacking. To address this gap, we survey a systematic\ntaxonomy of information diffusion tasks and datasets based on the \"5W Model\"\nframework. We first categorize the information diffusion tasks into ten\nsubtasks with definitions and datasets analysis, from three main tasks of\ninformation diffusion prediction, social bot detection, and misinformation\ndetection. We also collect the publicly available dataset repository of\ninformation diffusion tasks with the available links and compare them based on\nsix attributes affiliated to users and content: user information, social\nnetwork, bot label, propagation content, propagation network, and veracity\nlabel. In addition, we discuss the limitations and future directions of current\ndatasets and research topics to advance the future development of information\ndiffusion. The dataset repository can be accessed at our website\nhttps://github.com/fuxiaG/Information-Diffusion-Datasets.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}