{"id":"2407.18684","title":"Constraining modified gravity scenarios with the 6dFGS and SDSS galaxy\n  peculiar velocity datasets","authors":"Stuart Lyall, Chris Blake, Ryan J. Turner","authorsParsed":[["Lyall","Stuart",""],["Blake","Chris",""],["Turner","Ryan J.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 12:04:09 GMT"}],"updateDate":"2024-07-29","timestamp":1721995449000,"abstract":"  The detailed nature of dark energy remains a mystery, leaving the possibility\nthat its effects might be explained by changes to the laws of gravity on large\nscales. The peculiar velocities of galaxies directly trace the strength of\ngravity on cosmic scales and provide a means to further constrain such models.\nWe generate constraints on different scenarios of gravitational physics by\nmeasuring peculiar velocity and galaxy clustering two-point correlations, using\nredshifts and distances from the 6-degree Field Galaxy Survey and the Sloan\nDigital Sky Survey Peculiar Velocity samples, and fitting them against models\ncharacteristic of different cosmologies. Our best-fitting results are all found\nto be in statistical agreement with General Relativity, in which context we\nmeasure the low-redshift growth of structure to be $f\\sigma_8 =\n0.329^{+0.081}_{-0.083}$, consistent with the prediction of the standard\n$\\Lambda$CDM model. We also fit the modified gravity scenarios of\nDvali-Gabadadze-Porrati (nDGP) and a Hu-Sawicki model of $f(R)$ gravity,\nfinding the $2\\sigma$ limit of their characteristic parameters to be\n$r_cH_0/c>6.987$ and $-\\log_{10}(|f_{R0}|)>4.703$, respectively. These\nconstraints are comparable to other literature values, though it should be\nnoted that they are significantly affected by the prior adopted for their\ncharacteristic parameters. When applied to much larger upcoming peculiar\nvelocity surveys such as DESI, this method will place rapidly-improving\nconstraints on modified gravity models of cosmic expansion and growth.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}