{"id":"2407.13571","title":"New Capability to Look Up an ASL Sign from a Video Example","authors":"Carol Neidle, Augustine Opoku, Carey Ballard, Yang Zhou, Xiaoxiao He,\n  Gregory Dimitriadis, Dimitris Metaxas","authorsParsed":[["Neidle","Carol",""],["Opoku","Augustine",""],["Ballard","Carey",""],["Zhou","Yang",""],["He","Xiaoxiao",""],["Dimitriadis","Gregory",""],["Metaxas","Dimitris",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 15:14:35 GMT"}],"updateDate":"2024-07-19","timestamp":1721315675000,"abstract":"  Looking up an unknown sign in an ASL dictionary can be difficult. Most ASL\ndictionaries are organized based on English glosses, despite the fact that (1)\nthere is no convention for assigning English-based glosses to ASL signs; and\n(2) there is no 1-1 correspondence between ASL signs and English words.\nFurthermore, what if the user does not know either the meaning of the target\nsign or its possible English translation(s)? Some ASL dictionaries enable\nsearching through specification of articulatory properties, such as handshapes,\nlocations, movement properties, etc. However, this is a cumbersome process and\ndoes not always result in successful lookup. Here we describe a new system,\npublicly shared on the Web, to enable lookup of a video of an ASL sign (e.g., a\nwebcam recording or a clip from a continuous signing video). The user submits a\nvideo for analysis and is presented with the five most likely sign matches, in\ndecreasing order of likelihood, so that the user can confirm the selection and\nthen be taken to our ASLLRP Sign Bank entry for that sign. Furthermore, this\nvideo lookup is also integrated into our newest version of SignStream(R)\nsoftware to facilitate linguistic annotation of ASL video data, enabling the\nuser to directly look up a sign in the video being annotated, and, upon\nconfirmation of the match, to directly enter into the annotation the gloss and\nfeatures of that sign, greatly increasing the efficiency and consistency of\nlinguistic annotations of ASL video data.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}