{"id":"2407.15893","title":"Cascaded two-stage feature clustering and selection via separability and\n  consistency in fuzzy decision systems","authors":"Yuepeng Chen, Weiping Ding, Hengrong Ju, Jiashuang Huang, and Tao Yin","authorsParsed":[["Chen","Yuepeng",""],["Ding","Weiping",""],["Ju","Hengrong",""],["Huang","Jiashuang",""],["Yin","Tao",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 02:44:32 GMT"}],"updateDate":"2024-07-24","timestamp":1721616272000,"abstract":"  Feature selection is a vital technique in machine learning, as it can reduce\ncomputational complexity, improve model performance, and mitigate the risk of\noverfitting. However, the increasing complexity and dimensionality of datasets\npose significant challenges in the selection of features. Focusing on these\nchallenges, this paper proposes a cascaded two-stage feature clustering and\nselection algorithm for fuzzy decision systems. In the first stage, we reduce\nthe search space by clustering relevant features and addressing inter-feature\nredundancy. In the second stage, a clustering-based sequentially forward\nselection method that explores the global and local structure of data is\npresented. We propose a novel metric for assessing the significance of\nfeatures, which considers both global separability and local consistency.\nGlobal separability measures the degree of intra-class cohesion and inter-class\nseparation based on fuzzy membership, providing a comprehensive understanding\nof data separability. Meanwhile, local consistency leverages the fuzzy\nneighborhood rough set model to capture uncertainty and fuzziness in the data.\nThe effectiveness of our proposed algorithm is evaluated through experiments\nconducted on 18 public datasets and a real-world schizophrenia dataset. The\nexperiment results demonstrate our algorithm's superiority over benchmarking\nalgorithms in both classification accuracy and the number of selected features.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}