{"id":"2407.04506","title":"Balancing Operator's Risk Averseness in Model Predictive Control of a\n  Reservoir System","authors":"Ja-Ho Koo (1 and 2), Edo Abraham (2), Andreja Jonoski (1), and Dimitri\n  P. Solomatine (1 and 2) ((1) Department of Hydroinformatics and\n  Socio-Technical Innovation, IHE Delft, (2) Department of Water Management,\n  Faculty of Civil Engineering and Geosciences, Delft University of Technology)","authorsParsed":[["Koo","Ja-Ho","","1 and 2"],["Abraham","Edo","","1 and 2"],["Jonoski","Andreja","","1 and 2"],["Solomatine","Dimitri P.","","1 and 2"]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 13:45:40 GMT"}],"updateDate":"2024-07-08","timestamp":1720187140000,"abstract":"  Model Predictive Control (MPC) is an optimal control strategy suited for\nflood control of water resources infrastructure. Despite many studies on\nreservoir flood control and their theoretical contribution, optimisation\nmethodologies have not been widely applied in real-time operation due to\ndisparities between research assumptions and practical requirements. First,\ntacit objectives such as minimising the magnitude and frequency of changes in\nthe existing outflow schedule are considered important in practice, but these\nare nonlinear and challenging to formulate to suit all conditions.\nIncorporating these objectives transforms the problem into a multi-objective\nnonlinear optimisation problem that is difficult to solve online. Second, it is\nreasonable to assume that the weights and parameters are not stationary because\nthe preference varies depending on the state of the system. To overcome these\nlimitations, we propose a framework that converts the original intractable\nproblem into parameterized linear MPC problems with dynamic optimisation of\nweights and parameters. This is done by introducing a model-based learning\nconcept under the assumption of the dynamic nature of the operator's\npreference. We refer to this framework as Parameterised Dynamic MPC (PD-MPC).\nThe effectiveness of this framework is demonstrated through a numerical\nexperiment for the Daecheong multipurpose reservoir in South Korea. We find\nthat PD-MPC outperforms `standard' MPC-based designs without a dynamic\noptimisation process under the same uncertain inflows.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}