{"id":"2407.14510","title":"A Review on Response Strategies in Infrastructure Network Restoration","authors":"Subhojit Biswas, Bahar Cavdar, Joseph Geunes","authorsParsed":[["Biswas","Subhojit",""],["Cavdar","Bahar",""],["Geunes","Joseph",""]],"versions":[{"version":"v1","created":"Thu, 6 Jun 2024 20:47:44 GMT"}],"updateDate":"2024-07-23","timestamp":1717706864000,"abstract":"  This paper reviews the literature on response strategies for restoring\ninfrastructure networks in the aftermath of a disaster. Our motivation for this\nreview is twofold. First, the frequency and magnitude of natural and man-made\ndisasters (e.g., wild fires, tornadoes, global pandemics, terrorist attacks)\nhave been increasing. These events disrupt the operation of infrastructure\nnetworks, preventing the delivery of vital goods and services such as power and\nfood. Therefore, it is critical to understand the state-of-the-art in\nresponding to network disruptions in order to develop efficient strategies to\nmitigate their impacts. Second, it is critical to enable timely decisions in a\nrapidly changing and unpredictable environment while accounting for numerous\ninterrelated factors. Because the vast majority of response decision problems\nare computationally challenging, quickly finding solutions that are compatible\nwith real-time decision making is a difficult task. Hence, it is important to\nunderstand the nature of response activities and decisions, as well as the\navailable solution methodologies and inherent trade-offs between computation\ntime and solution quality. We review quantitative response methodologies\ndeveloped for infrastructure network restoration, classifying relevant studies\nbased on the properties of the underlying network. In particular, we focus on\nresource allocation, scheduling, routing and repair efforts within the domain\nof power, road, and water, oil and gas network restoration. We also discuss\nopen research questions and future research directions.\n","subjects":["Physics/Physics and Society","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}