{"id":"2407.18342","title":"MicroOpt: Model-driven Slice Resource Optimization in 5G and Beyond\n  Networks","authors":"Muhammad Sulaiman, Mahdieh Ahmadi, Bo Sun, Niloy Saha, Mohammad A.\n  Salahuddin, Raouf Boutaba, Aladdin Saleh","authorsParsed":[["Sulaiman","Muhammad",""],["Ahmadi","Mahdieh",""],["Sun","Bo",""],["Saha","Niloy",""],["Salahuddin","Mohammad A.",""],["Boutaba","Raouf",""],["Saleh","Aladdin",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 19:06:24 GMT"}],"updateDate":"2024-07-29","timestamp":1721934384000,"abstract":"  A pivotal attribute of 5G networks is their capability to cater to diverse\napplication requirements. This is achieved by creating logically isolated\nvirtual networks, or slices, with distinct service level agreements (SLAs)\ntailored to specific use cases. However, efficiently allocating resources to\nmaintain slice SLA is challenging due to varying traffic and QoS requirements.\nTraditional peak traffic-based resource allocation leads to over-provisioning,\nas actual traffic rarely peaks. Additionally, the complex relationship between\nresource allocation and QoS in end-to-end slices spanning different network\nsegments makes conventional optimization techniques impractical. Existing\napproaches in this domain use network models or simulations and various\noptimization methods but struggle with optimality, tractability, and\ngeneralizability across different slice types. In this paper, we propose\nMicroOpt, a novel framework that leverages a differentiable neural\nnetwork-based slice model with gradient descent for resource optimization and\nLagrangian decomposition for QoS constraint satisfaction. We evaluate MicroOpt\nagainst two state-of-the-art approaches using an open-source 5G testbed with\nreal-world traffic traces. Our results demonstrate up to 21.9% improvement in\nresource allocation compared to these approaches across various scenarios,\nincluding different QoS thresholds and dynamic slice traffic.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}