{"id":"2407.21693","title":"TransferTOD: A Generalizable Chinese Multi-Domain Task-Oriented Dialogue\n  System with Transfer Capabilities","authors":"Ming Zhang, Caishuang Huang, Yilong Wu, Shichun Liu, Huiyuan Zheng,\n  Yurui Dong, Yujiong Shen, Shihan Dou, Jun Zhao, Junjie Ye, Qi Zhang, Tao Gui,\n  and Xuanjing Huang","authorsParsed":[["Zhang","Ming",""],["Huang","Caishuang",""],["Wu","Yilong",""],["Liu","Shichun",""],["Zheng","Huiyuan",""],["Dong","Yurui",""],["Shen","Yujiong",""],["Dou","Shihan",""],["Zhao","Jun",""],["Ye","Junjie",""],["Zhang","Qi",""],["Gui","Tao",""],["Huang","Xuanjing",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:38:15 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 13:42:20 GMT"}],"updateDate":"2024-08-08","timestamp":1722440295000,"abstract":"  Task-oriented dialogue (TOD) systems aim to efficiently handle task-oriented\nconversations, including information collection. How to utilize TOD accurately,\nefficiently and effectively for information collection has always been a\ncritical and challenging task. Recent studies have demonstrated that Large\nLanguage Models (LLMs) excel in dialogue, instruction generation, and\nreasoning, and can significantly enhance the performance of TOD through\nfine-tuning. However, current datasets primarily cater to user-led systems and\nare limited to predefined specific scenarios and slots, thereby necessitating\nimprovements in the proactiveness, diversity, and capabilities of TOD. In this\nstudy, we present a detailed multi-domain task-oriented data construction\nprocess for conversations, and a Chinese dialogue dataset generated based on\nthis process, TransferTOD, which authentically simulates human-computer\ndialogues in 30 popular life service scenarios. Leveraging this dataset, we\ntrained a model called TransferTOD-7B using full-parameter fine-tuning,\nshowcasing notable abilities in slot filling and questioning. Our work has\ndemonstrated its strong generalization capabilities in various downstream\nscenarios, significantly enhancing both data utilization efficiency and system\nperformance. The data is released in\nhttps://github.com/KongLongGeFDU/TransferTOD.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}