{"id":"2407.16975","title":"On the Parameter Identifiability of Partially Observed Linear Causal\n  Models","authors":"Xinshuai Dong and Ignavier Ng and Biwei Huang and Yuewen Sun and\n  Songyao Jin and Roberto Legaspi and Peter Spirtes and Kun Zhang","authorsParsed":[["Dong","Xinshuai",""],["Ng","Ignavier",""],["Huang","Biwei",""],["Sun","Yuewen",""],["Jin","Songyao",""],["Legaspi","Roberto",""],["Spirtes","Peter",""],["Zhang","Kun",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 03:43:55 GMT"}],"updateDate":"2024-07-25","timestamp":1721792635000,"abstract":"  Linear causal models are important tools for modeling causal dependencies and\nyet in practice, only a subset of the variables can be observed. In this paper,\nwe examine the parameter identifiability of these models by investigating\nwhether the edge coefficients can be recovered given the causal structure and\npartially observed data. Our setting is more general than that of prior\nresearch - we allow all variables, including both observed and latent ones, to\nbe flexibly related, and we consider the coefficients of all edges, whereas\nmost existing works focus only on the edges between observed variables.\nTheoretically, we identify three types of indeterminacy for the parameters in\npartially observed linear causal models. We then provide graphical conditions\nthat are sufficient for all parameters to be identifiable and show that some of\nthem are provably necessary. Methodologically, we propose a novel\nlikelihood-based parameter estimation method that addresses the variance\nindeterminacy of latent variables in a specific way and can asymptotically\nrecover the underlying parameters up to trivial indeterminacy. Empirical\nstudies on both synthetic and real-world datasets validate our identifiability\ntheory and the effectiveness of the proposed method in the finite-sample\nregime.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}