{"id":"2407.00998","title":"Opportunities for Shape-based Optimization of Link Traversal Queries","authors":"Bryan-Elliott Tam, Ruben Taelman, Pieter Colpaert and Ruben Verborgh","authorsParsed":[["Tam","Bryan-Elliott",""],["Taelman","Ruben",""],["Colpaert","Pieter",""],["Verborgh","Ruben",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 06:26:34 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 14:28:43 GMT"}],"updateDate":"2024-09-02","timestamp":1719815194000,"abstract":"  Data on the web is naturally unindexed and decentralized. Centralizing web\ndata, especially personal data, raises ethical and legal concerns. Yet,\ncompared to centralized query approaches, decentralization-friendly\nalternatives such as Link Traversal Query Processing (LTQP) are significantly\nless performant and understood. The two main difficulties of LTQP are the lack\nof apriori information about data sources and the high number of HTTP requests.\nExploring decentralized-friendly ways to document unindexed networks of data\nsources could lead to solutions to alleviate those difficulties. RDF data\nshapes are widely used to validate linked data documents, therefore, it is\nworthwhile to investigate their potential for LTQP optimization. In our work,\nwe built an early version of a source selection algorithm for LTQP using RDF\ndata shape mappings with linked data documents and measured its performance in\na realistic setup. In this article, we present our algorithm and early results,\nthus, opening opportunities for further research for shape-based optimization\nof link traversal queries. Our initial experiments show that with little\nmaintenance and work from the server, our method can reduce up to 80% the\nexecution time and 97% the number of links traversed during realistic queries.\nGiven our early results and the descriptive power of RDF data shapes it would\nbe worthwhile to investigate non-heuristic-based query planning using RDF\nshapes.\n","subjects":["Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lZdM4t_UPUpWaK-xt8MseB59nb1XCUFekMnIwCSPa8s","pdfSize":"866819"}
