{"id":"2407.06099","title":"Physics-Informed Machine Learning Towards A Real-Time Spacecraft Thermal\n  Simulator","authors":"Manaswin Oddiraju, Zaki Hasnain, Saptarshi Bandyopadhyay, Eric Sunada,\n  Souma Chowdhury","authorsParsed":[["Oddiraju","Manaswin",""],["Hasnain","Zaki",""],["Bandyopadhyay","Saptarshi",""],["Sunada","Eric",""],["Chowdhury","Souma",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 16:38:52 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 16:59:17 GMT"}],"updateDate":"2024-09-06","timestamp":1720456732000,"abstract":"  Modeling thermal states for complex space missions, such as the surface\nexploration of airless bodies, requires high computation, whether used in\nground-based analysis for spacecraft design or during onboard reasoning for\nautonomous operations. For example, a finite-element thermal model with\nhundreds of elements can take significant time to simulate, which makes it\nunsuitable for onboard reasoning during time-sensitive scenarios such as\ndescent and landing, proximity operations, or in-space assembly. Further, the\nlack of fast and accurate thermal modeling drives thermal designs to be more\nconservative and leads to spacecraft with larger mass and higher power budgets.\nThe emerging paradigm of physics-informed machine learning (PIML) presents a\nclass of hybrid modeling architectures that address this challenge by combining\nsimplified physics models with machine learning (ML) models resulting in models\nwhich maintain both interpretability and robustness. Such techniques enable\ndesigns with reduced mass and power through onboard thermal-state estimation\nand control and may lead to improved onboard handling of off-nominal states,\nincluding unplanned down-time. The PIML model or hybrid model presented here\nconsists of a neural network which predicts reduced nodalizations (distribution\nand size of coarse mesh) given on-orbit thermal load conditions, and\nsubsequently a (relatively coarse) finite-difference model operates on this\nmesh to predict thermal states. We compare the computational performance and\naccuracy of the hybrid model to a data-driven neural net model, and a\nhigh-fidelity finite-difference model of a prototype Earth-orbiting small\nspacecraft. The PIML based active nodalization approach provides significantly\nbetter generalization than the neural net model and coarse mesh model, while\nreducing computing cost by up to 1.7x compared to the high-fidelity model.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}