{"id":"2407.02815","title":"Optimization of End-to-End AoI in Edge-Enabled Vehicular Fog Systems: A\n  Dueling-DQN Approach","authors":"Seifu Birhanu Tadele, Binayak Kar, Frezer Guteta Wakgra, and Asif\n  Uddin Khan","authorsParsed":[["Tadele","Seifu Birhanu",""],["Kar","Binayak",""],["Wakgra","Frezer Guteta",""],["Khan","Asif Uddin",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 05:27:14 GMT"}],"updateDate":"2024-07-04","timestamp":1719984434000,"abstract":"  In real-time status update services for the Internet of Things (IoT), the\ntimely dissemination of information requiring timely updates is crucial to\nmaintaining its relevance. Failing to keep up with these updates results in\noutdated information. The age of information (AoI) serves as a metric to\nquantify the freshness of information. The Existing works to optimize AoI\nprimarily focus on the transmission time from the information source to the\nmonitor, neglecting the transmission time from the monitor to the destination.\nThis oversight significantly impacts information freshness and subsequently\naffects decision-making accuracy. To address this gap, we designed an\nedge-enabled vehicular fog system to lighten the computational burden on IoT\ndevices. We examined how information transmission and request-response times\ninfluence end-to-end AoI. As a solution, we proposed Dueling-Deep Queue Network\n(dueling-DQN), a deep reinforcement learning (DRL)-based algorithm and compared\nits performance with DQN policy and analytical results. Our simulation results\ndemonstrate that the proposed dueling-DQN algorithm outperforms both DQN and\nanalytical methods, highlighting its effectiveness in improving real-time\nsystem information freshness. Considering the complete end-to-end transmission\nprocess, our optimization approach can improve decision-making performance and\noverall system efficiency.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uCmmQp9C2gPRsroe0jajqm2tjZZnyUP5h0NJez1bPzw","pdfSize":"2509417","objectId":"0x957387963559e9b2c479b9d71c9bb3509ca667a93bab392ede68e0a23e2f668a","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
