{"id":"2407.12600","title":"Finite Element-based Nonlinear Dynamic Optimization of Nanomechanical\n  Resonators","authors":"Zichao Li, Farbod Alijani, Ali Sarafraz, Minxing Xu, Richard A. Norte,\n  Alejandro M. Aragon, and Peter G. Steeneken","authorsParsed":[["Li","Zichao",""],["Alijani","Farbod",""],["Sarafraz","Ali",""],["Xu","Minxing",""],["Norte","Richard A.",""],["Aragon","Alejandro M.",""],["Steeneken","Peter G.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:27:29 GMT"}],"updateDate":"2024-07-18","timestamp":1721226449000,"abstract":"  Nonlinear dynamic simulations of mechanical resonators have been facilitated\nby the advent of computational techniques that generate nonlinear reduced order\nmodels (ROMs) using the finite element (FE) method. However, designing devices\nwith specific nonlinear characteristics remains inefficient since it requires\nmanual adjustment of the design parameters and can result in suboptimal\ndesigns. Here, we integrate an FE-based nonlinear ROM technique with a\nderivative-free optimization algorithm to enable the design of nonlinear\nmechanical resonators. The resulting methodology is used to optimize the\nsupport design of high-stress nanomechanical Si3N4 string resonators, in the\npresence of conflicting objectives such as simultaneous enhancement of Q-factor\nand nonlinear Duffing constant. To that end, we generate Pareto frontiers that\nhighlight the trade-offs between optimization objectives and validate the\nresults both numerically and experimentally. To further demonstrate the\ncapability of multi-objective optimization for practical design challenges, we\nsimultaneously optimize the design of nanoresonators for three key\nfigure-of-merits in resonant sensing: power consumption, sensitivity and\nresponse time. The presented methodology can facilitate and accelerate\ndesigning (nano)mechanical resonators with optimized performance for a wide\nvariety of applications.\n","subjects":["Physics/Applied Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}