{"id":"2407.12060","title":"Decoding Dmrt1: Insights into vertebrate sex determination and gonadal\n  sex differentiation","authors":"Barbora Augstenov\\'a, Wen-Juan Ma","authorsParsed":[["Augstenová","Barbora",""],["Ma","Wen-Juan",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 12:55:32 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 09:43:30 GMT"}],"updateDate":"2024-08-09","timestamp":1721048132000,"abstract":"  Dmrt1 is pivotal in testis formation and function by interacting with genes\ncrucial for Sertoli cell differentiation, such as Sox9. It represses\nfemale-determining pathways and ovarian formation by silencing Foxl2. Across\n127 vertebrate species, Dmrt1 exhibits sexually dimorphic expression, prior to\nand during gonadal sex differentiation and in adult testes, implicating its\nrole in master regulation of sex determination and gonadal sex differentiation.\nDmrt1 emerges as a master sex-determining gene in one fish, frog, chicken and\nreptile. Recent studies suggest epigenetic regulation of Dmrt1 in its promoter\nmethylation and transposable element insertion introducing epigenetic\nmodification to cis-regulatory elements, alongside non-coding RNA involvement,\nin a wide spectrum of sex-determining mechanisms. Additionally, alternative\nsplicing of Dmrt1 was found in all vertebrate groups except amphibians. Dmrt1\nhas evolved many lineage-specific isoforms (ranging from 2 to 10) but has no\nsex-specific splicing variants in any taxa, which is in sharp contrast to the\nconstitutional sex-specific splicing of Dsx in insects. Future research should\nfocus on understanding the molecular basis of environmental sex determination\nfrom a broader taxon, and the molecular basis of epigenetic regulation. It is\nalso essential to understand why and how multiple alternative splicing variants\nof Dmrt1 evolve and the specific roles each isoform plays in sex determination\nand gonadal sex differentiation, as well as the significant differences in the\nmolecular mechanisms and functions of alternative splicing between Dmrt1 in\nvertebrates and sex-specific splicing of Dsx in insects. Understanding the\ndifferences could provide deeper insights into the evolution of sex-determining\nmechanisms between vertebrates and insects.\n","subjects":["Quantitative Biology/Quantitative Methods","Quantitative Biology/Cell Behavior","Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}