{"id":"2407.20607","title":"Efficient Channel Estimation for Millimeter Wave and Terahertz Systems\n  Enabled by Integrated Super-resolution Sensing and Communication","authors":"Jingran Xu, Huizhi Wang, Yong Zeng, Xiaoli Xu, Qingqing Wu, Fei Yang,\n  Yan Chen, Abbas Jamalipour","authorsParsed":[["Xu","Jingran",""],["Wang","Huizhi",""],["Zeng","Yong",""],["Xu","Xiaoli",""],["Wu","Qingqing",""],["Yang","Fei",""],["Chen","Yan",""],["Jamalipour","Abbas",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 07:33:11 GMT"}],"updateDate":"2024-07-31","timestamp":1722324791000,"abstract":"  Integrated super-resolution sensing and communication (ISSAC) has emerged as\na promising technology to achieve extremely high precision sensing for those\nkey parameters, such as the angles of the sensing targets. In this paper, we\npropose an efficient channel estimation scheme enabled by ISSAC for millimeter\nwave (mmWave) and TeraHertz (THz) systems with a hybrid analog/digital\nbeamforming architecture, where both the pilot overhead and the cost of radio\nfrequency (RF) chains are significantly reduced. The key idea is to exploit the\nfact that subspace-based super-resolution algorithms such as multiple signal\nclassification (MUSIC) can estimate channel parameters accurately without\nrequiring dedicate a priori known pilots. In particular, the proposed method\nconsists of two stages. First, the angles of the multi-path channel components\nare estimated in a pilot-free manner during the transmission of data symbols.\nSecond, the multi-path channel coefficients are estimated with very few pilots.\nCompared to conventional channel estimation schemes that rely solely on channel\ntraining, our approach requires the estimation of much fewer parameters in the\nsecond stage. Furthermore, with channel multi-path angles obtained, the\nbeamforming gain can be achieved when pilots are sent to estimate the channel\npath gains. To comprehensively investigate the performance of the proposed\nscheme, we consider both the basic line-of-sight (LoS) channels and more\ngeneral multi-path channels. We compare the performance of the minimum mean\nsquare error (MMSE) of channel estimation and the resulting beamforming gains\nof our proposed scheme with the traditional scheme that rely exclusively on\nchannel training. It is demonstrated that our proposed method significantly\noutperforms the benchmarking scheme. Simulation results are presented to\nvalidate our theoretical findings.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}