{"id":"2407.02642","title":"Your Clean Graphene is Still Not Clean","authors":"Ondrej Dyck, Aisha Okmi, Kai Xiao, Sidong Lei, Andrew R. Lupini,\n  Stephen Jesse","authorsParsed":[["Dyck","Ondrej",""],["Okmi","Aisha",""],["Xiao","Kai",""],["Lei","Sidong",""],["Lupini","Andrew R.",""],["Jesse","Stephen",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 20:15:14 GMT"}],"updateDate":"2024-07-04","timestamp":1719951314000,"abstract":"  Efforts aimed at scaling fabrication processes to the level of single atoms,\ndubbed atom-by-atom fabrication or atomic fabrication, invariably encounter the\nobstacle of atomic scale cleanliness. When considering atomic fabrication,\ncleanliness of the base material and purity of the source reservoir from which\natomic structures will be built are invariable constraints imposed by laws of\nphysics and chemistry. As obvious as such statements may be, and regardless of\nthe inevitable consequences for successful atomic fabrication, there is a\npoignant lack of understanding of the \"dirt\" (contamination/impurities). Here,\nwe examine hydrocarbon contamination on graphene. Graphene has formed the base\nsubstrate for many e-beam-based atomic fabrication studies and many strategies\nfor cleaning graphene have been presented in the literature. One popular method\nis heating to high temperatures (>500 {\\deg}C). It is usually inferred that\nvolatile hydrocarbons evaporate into the microscope vacuum system leaving\nbehind pristine graphene. Here, we show through direct image intensity analysis\nthat what appears to be clean graphene can be coated with a thin layer of\ndynamically diffusing hydrocarbons. This result holds significant implications\nfor approaches to e-beam based atomic fabrication, updates the conceptual model\nof e-beam induced hydrocarbon deposition, and may extend to hot surfaces\ngenerally.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"CQFERMqg64o1DeY5ZqF1HI5lKrf1VNO77JiXtHhHKeI","pdfSize":"45929398"}
