{"id":"2407.21531","title":"Can LLMs \"Reason\" in Music? An Evaluation of LLMs' Capability of Music\n  Understanding and Generation","authors":"Ziya Zhou, Yuhang Wu, Zhiyue Wu, Xinyue Zhang, Ruibin Yuan, Yinghao\n  Ma, Lu Wang, Emmanouil Benetos, Wei Xue, Yike Guo","authorsParsed":[["Zhou","Ziya",""],["Wu","Yuhang",""],["Wu","Zhiyue",""],["Zhang","Xinyue",""],["Yuan","Ruibin",""],["Ma","Yinghao",""],["Wang","Lu",""],["Benetos","Emmanouil",""],["Xue","Wei",""],["Guo","Yike",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 11:29:46 GMT"}],"updateDate":"2024-08-01","timestamp":1722425386000,"abstract":"  Symbolic Music, akin to language, can be encoded in discrete symbols. Recent\nresearch has extended the application of large language models (LLMs) such as\nGPT-4 and Llama2 to the symbolic music domain including understanding and\ngeneration. Yet scant research explores the details of how these LLMs perform\non advanced music understanding and conditioned generation, especially from the\nmulti-step reasoning perspective, which is a critical aspect in the\nconditioned, editable, and interactive human-computer co-creation process. This\nstudy conducts a thorough investigation of LLMs' capability and limitations in\nsymbolic music processing. We identify that current LLMs exhibit poor\nperformance in song-level multi-step music reasoning, and typically fail to\nleverage learned music knowledge when addressing complex musical tasks. An\nanalysis of LLMs' responses highlights distinctly their pros and cons. Our\nfindings suggest achieving advanced musical capability is not intrinsically\nobtained by LLMs, and future research should focus more on bridging the gap\nbetween music knowledge and reasoning, to improve the co-creation experience\nfor musicians.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Computation and Language","Computing Research Repository/Multimedia","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}