{"id":"2407.20772","title":"Edge Learning Based Collaborative Automatic Modulation Classification\n  for Hierarchical Cognitive Radio Networks","authors":"Peihao Dong, Chaowei He, Shen Gao, Fuhui Zhou, Qihui Wu","authorsParsed":[["Dong","Peihao",""],["He","Chaowei",""],["Gao","Shen",""],["Zhou","Fuhui",""],["Wu","Qihui",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 12:16:37 GMT"}],"updateDate":"2024-07-31","timestamp":1722341797000,"abstract":"  In hierarchical cognitive radio networks, edge or cloud servers utilize the\ndata collected by edge devices for modulation classification, which, however,\nis faced with problems of the computation load, transmission overhead, and data\nprivacy. In this article, an edge learning (EL) based framework jointly\nmobilizing the edge device and the edge server for intelligent co-inference is\nproposed to realize the collaborative automatic modulation classification\n(C-AMC) between them. A spectrum semantic compression neural network is\ndesigned for the edge device to compress the collected raw data into a compact\nsemantic embedding that is then sent to the edge server via the wireless\nchannel. On the edge server side, a modulation classification neural network\ncombining the bidirectional long-short term memory and attention structures is\nelaborated to determine the modulation type from the noisy semantic embedding.\nThe C-AMC framework decently balances the computation resources of both sides\nwhile avoiding the high transmission overhead and data privacy leakage. Both\nthe offline and online training procedures of the C-AMC framework are\nelaborated. The compression strategy of the C-AMC framework is also developed\nto further facilitate the deployment, especially for the resource-constrained\nedge device. Simulation results show the superiority of the EL-based C-AMC\nframework in terms of the classification accuracy, computational complexity,\nand the data compression rate as well as reveal useful insights paving the\npractical implementation.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}