{"id":"2407.06632","title":"Optoionic Impedance Spectroscopy (OIS): a model-less technique for\n  in-situ electrochemical characterization of mixed ionic electronic conductors","authors":"Paul Nizet, Francesco Chiabrera, Yunqing Tang, Nerea Alayo, Beatrice\n  Laurenti, Federico Baiutti, Alex Morata, Albert Taranc\\'on","authorsParsed":[["Nizet","Paul",""],["Chiabrera","Francesco",""],["Tang","Yunqing",""],["Alayo","Nerea",""],["Laurenti","Beatrice",""],["Baiutti","Federico",""],["Morata","Alex",""],["Tarancón","Albert",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 07:58:19 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 07:27:30 GMT"}],"updateDate":"2024-07-11","timestamp":1720511899000,"abstract":"  Functional properties of mixed ionic electronic conductors (MIECs) can be\nradically modified by (de)insertion of mobile charged defects. A complete\ncontrol of this dynamic behaviour has multiple applications in a myriad of\nfields including advanced computing, data processing, sensing or energy\nconversion. However, the effect of different MIECs state-of-charge is not fully\nunderstood yet and there is a lack of strategies for fully controlling the\ndefect content in a material. In this work we present a model-less technique to\ncharacterize ionic defect concentration and ionic insertion kinetics in MIEC\nmaterials: Optoionic Impedance Spectroscopy (OIS). The proof of concept and\nadvantages of OIS are demonstrated by studying the oxygen (de)insertion in thin\nfilms of hole-doped perovskite oxides. Ion migration into/out of the studied\nmaterials is achieved by the application of an electrochemical potential,\nachieving stable and reversible modification of its optical properties. By\ntracking the dynamic variation of optical properties depending on the gating\nconditions, OIS enables to extract electrochemical parameters involved in the\nelectrochromic process. The results demonstrate the capability of the technique\nto effectively characterize the kinetics of single- and even multi- layer\nsystems. The technique can be employed for studying underlying mechanisms of\nthe response characteristics of MIEC-based devices.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}