{"id":"2407.09694","title":"Divide and Fuse: Body Part Mesh Recovery from Partially Visible Human\n  Images","authors":"Tianyu Luan, Zhongpai Gao, Luyuan Xie, Abhishek Sharma, Hao Ding,\n  Benjamin Planche, Meng Zheng, Ange Lou, Terrence Chen, Junsong Yuan, and\n  Ziyan Wu","authorsParsed":[["Luan","Tianyu",""],["Gao","Zhongpai",""],["Xie","Luyuan",""],["Sharma","Abhishek",""],["Ding","Hao",""],["Planche","Benjamin",""],["Zheng","Meng",""],["Lou","Ange",""],["Chen","Terrence",""],["Yuan","Junsong",""],["Wu","Ziyan",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 21:29:11 GMT"}],"updateDate":"2024-07-16","timestamp":1720819751000,"abstract":"  We introduce a novel bottom-up approach for human body mesh reconstruction,\nspecifically designed to address the challenges posed by partial visibility and\nocclusion in input images. Traditional top-down methods, relying on whole-body\nparametric models like SMPL, falter when only a small part of the human is\nvisible, as they require visibility of most of the human body for accurate mesh\nreconstruction. To overcome this limitation, our method employs a \"Divide and\nFuse (D&F)\" strategy, reconstructing human body parts independently before\nfusing them, thereby ensuring robustness against occlusions. We design Human\nPart Parametric Models (HPPM) that independently reconstruct the mesh from a\nfew shape and global-location parameters, without inter-part dependency. A\nspecially designed fusion module then seamlessly integrates the reconstructed\nparts, even when only a few are visible. We harness a large volume of\nground-truth SMPL data to train our parametric mesh models. To facilitate the\ntraining and evaluation of our method, we have established benchmark datasets\nfeaturing images of partially visible humans with HPPM annotations. Our\nexperiments, conducted on these benchmark datasets, demonstrate the\neffectiveness of our D&F method, particularly in scenarios with substantial\ninvisibility, where traditional approaches struggle to maintain reconstruction\nquality.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}