{"id":"2407.11173","title":"Approximate Bayesian inference for high-resolution spatial\n  disaggregation using alternative data sources","authors":"Anis Pakrashi, Arnab Hazra, Sooraj M Raveendran, and Krishnachandran\n  Balakrishnan","authorsParsed":[["Pakrashi","Anis",""],["Hazra","Arnab",""],["Raveendran","Sooraj M",""],["Balakrishnan","Krishnachandran",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:50:08 GMT"}],"updateDate":"2024-07-17","timestamp":1721069408000,"abstract":"  This paper addresses the challenge of obtaining precise demographic\ninformation at a fine-grained spatial level, a necessity for planning localized\npublic services such as water distribution networks, or understanding local\nhuman impacts on the ecosystem. While population sizes are commonly available\nfor large administrative areas, such as wards in India, practical applications\noften demand knowledge of population density at smaller spatial scales. We\nexplore the integration of alternative data sources, specifically\nsatellite-derived products, including land cover, land use, street density,\nbuilding heights, vegetation coverage, and drainage density. Using a case study\nfocused on Bangalore City, India, with a ward-level population dataset for 198\nwards and satellite-derived sources covering 786,702 pixels at a resolution of\n30mX30m, we propose a semiparametric Bayesian spatial regression model for\nobtaining pixel-level population estimates. Given the high dimensionality of\nthe problem, exact Bayesian inference is deemed impractical; we discuss an\napproximate Bayesian inference scheme based on the recently proposed\nmax-and-smooth approach, a combination of Laplace approximation and Markov\nchain Monte Carlo. A simulation study validates the reasonable performance of\nour inferential approach. Mapping pixel-level estimates to the ward level\ndemonstrates the effectiveness of our method in capturing the spatial\ndistribution of population sizes. While our case study focuses on a demographic\napplication, the methodology developed here readily applies to count-type\nspatial datasets from various scientific disciplines, where high-resolution\nalternative data sources are available.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}