{"id":"2407.12014","title":"Surprising Performances of Students with Autism in Classroom with NAO\n  Robot","authors":"Qin Yang, Huan Lu, Dandan Liang, Shengrong Gong, and Huanghao Feng","authorsParsed":[["Yang","Qin",""],["Lu","Huan",""],["Liang","Dandan",""],["Gong","Shengrong",""],["Feng","Huanghao",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 01:04:58 GMT"}],"updateDate":"2024-07-18","timestamp":1719450298000,"abstract":"  Autism is a developmental disorder that manifests in early childhood and\npersists throughout life, profoundly affecting social behavior and hindering\nthe acquisition of learning and social skills in those diagnosed. As\ntechnological advancements progress, an increasing array of technologies is\nbeing utilized to support the education of students with Autism Spectrum\nDisorder (ASD), aiming to improve their educational outcomes and social\ncapabilities. Numerous studies on autism intervention have highlighted the\neffectiveness of social robots in behavioral treatments. However, research on\nthe integration of social robots into classroom settings for children with\nautism remains sparse. This paper describes the design and implementation of a\ngroup experiment in a collective classroom setting mediated by the NAO robot.\nThe experiment involved special education teachers and the NAO robot\ncollaboratively conducting classroom activities, aiming to foster a dynamic\nlearning environment through interactions among teachers, the robot, and\nstudents. Conducted in a special education school, this experiment served as a\nfoundational study in anticipation of extended robot-assisted classroom\nsessions. Data from the experiment suggest that ASD students in classrooms\nequipped with the NAO robot exhibited notably better performance compared to\nthose in regular classrooms. The humanoid features and body language of the NAO\nrobot captivated the students' attention, particularly during talent shows and\ncommand tasks, where students demonstrated heightened engagement and a decrease\nin stereotypical repetitive behaviors and irrelevant minor movements commonly\nobserved in regular settings. Our preliminary findings indicate that the NAO\nrobot significantly enhances focus and classroom engagement among students with\nASD, potentially improving educational performance and fostering better social\nbehaviors.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}