{"id":"2407.17397","title":"Kinetic theory applied to pressure-controlled shear flows of\n  frictionless spheres between rigid, bumpy planes","authors":"Dalila Vescovi, Astrid S. de Wijn, Graham L.W. Cross, Diego Berzi","authorsParsed":[["Vescovi","Dalila",""],["de Wijn","Astrid S.",""],["Cross","Graham L. W.",""],["Berzi","Diego",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 16:20:37 GMT"}],"updateDate":"2024-07-25","timestamp":1721838037000,"abstract":"  We numerically investigate, through discrete element simulations, the steady\nflow of identical, frictionless spheres sheared between two parallel, bumpy\nplanes in the absence of gravity and under a fixed normal load. We measure the\nspatial distributions of solid volume fraction, mean velocity, intensity of\nagitation and stresses, and confirm previous results on the validity of the\nequation of state and the viscosity predicted by the kinetic theory of granular\ngases. In a first, we also directly measure the spatial distributions of the\ndiffusivity and the rate of collisional dissipation of the fluctuation kinetic\nenergy, and successfully test the associated constitutive relations of the\nkinetic theory. We then phrase and numerically integrate a system of\ndifferential equations governing the flow, with suitable boundary conditions,\nand show a remarkable qualitative and quantitative agreement with the results\nof the discrete simulations in terms of the dependence of the profiles of the\nhydrodynamic fields, the ratio of shear stress-to-pressure and the gap between\nthe bumpy planes on the coefficient of collisional restitution, the imposed\nload and the bumpiness of the planes. Finally, we propose a criterion to\npredict, on the basis of the solution of the boundary-valued problem, the\ncritical value of the imposed load above which crystallization may occur. This\nnotably reproduces what we observe in the discrete simulations.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}