{"id":"2407.11401","title":"EndoFinder: Online Image Retrieval for Explainable Colorectal Polyp\n  Diagnosis","authors":"Ruijie Yang, Yan Zhu, Peiyao Fu, Yizhe Zhang, Zhihua Wang, Quanlin Li,\n  Pinghong Zhou, Xian Yang and Shuo Wang","authorsParsed":[["Yang","Ruijie",""],["Zhu","Yan",""],["Fu","Peiyao",""],["Zhang","Yizhe",""],["Wang","Zhihua",""],["Li","Quanlin",""],["Zhou","Pinghong",""],["Yang","Xian",""],["Wang","Shuo",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 05:40:17 GMT"}],"updateDate":"2024-07-17","timestamp":1721108417000,"abstract":"  Determining the necessity of resecting malignant polyps during colonoscopy\nscreen is crucial for patient outcomes, yet challenging due to the\ntime-consuming and costly nature of histopathology examination. While deep\nlearning-based classification models have shown promise in achieving optical\nbiopsy with endoscopic images, they often suffer from a lack of explainability.\nTo overcome this limitation, we introduce EndoFinder, a content-based image\nretrieval framework to find the 'digital twin' polyp in the reference database\ngiven a newly detected polyp. The clinical semantics of the new polyp can be\ninferred referring to the matched ones. EndoFinder pioneers a polyp-aware image\nencoder that is pre-trained on a large polyp dataset in a self-supervised way,\nmerging masked image modeling with contrastive learning. This results in a\ngeneric embedding space ready for different downstream clinical tasks based on\nimage retrieval. We validate the framework on polyp re-identification and\noptical biopsy tasks, with extensive experiments demonstrating that EndoFinder\nnot only achieves explainable diagnostics but also matches the performance of\nsupervised classification models. EndoFinder's reliance on image retrieval has\nthe potential to support diverse downstream decision-making tasks during\nreal-time colonoscopy procedures.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"M85-HjBEQFVP0gGVByEOe2HwOIXawARzjtKTp8mRfhM","pdfSize":"7578337"}
