{"id":"2407.04812","title":"Active-Controlled Trial Design for HIV Prevention Trials with a\n  Counterfactual Placebo","authors":"Fei Gao and Holly Janes and Susan Buchbinder and Deborah Donnell","authorsParsed":[["Gao","Fei",""],["Janes","Holly",""],["Buchbinder","Susan",""],["Donnell","Deborah",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 18:49:50 GMT"}],"updateDate":"2024-07-09","timestamp":1720205390000,"abstract":"  In the quest for enhanced HIV prevention methods, the advent of\nantiretroviral drugs as pre-exposure prophylaxis (PrEP) has marked a\nsignificant stride forward. However, the ethical challenges in conducting\nplacebo-controlled trials for new PrEP agents against a backdrop of highly\neffective existing PrEP options necessitates innovative approaches. This\nmanuscript delves into the design and implementation of active-controlled\ntrials that incorporate a counterfactual placebo estimate - a theoretical\nestimate of what HIV incidence would have been without effective prevention. We\nintroduce a novel statistical framework for regulatory approval of new PrEP\nagents, predicated on the assumption of an available and consistent\ncounterfactual placebo estimate. Our approach aims to assess the absolute\nefficacy (i.e., against placebo) of the new PrEP agent relative to the absolute\nefficacy of the active control. We propose a two-step procedure for hypothesis\ntesting and further develop an approach that addresses potential biases\ninherent in non-randomized comparison to counterfactual placebos. By exploring\ndifferent scenarios with moderately and highly effective active controls and\ncounterfactual placebo estimates from various sources, we demonstrate how our\ndesign can significantly reduce sample sizes compared to traditional\nnon-inferiority trials and offer a robust framework for evaluating new PrEP\nagents. This work contributes to the methodological repertoire for HIV\nprevention trials and underscores the importance of adaptability in the face of\nethical and practical challenges.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}