{"id":"2407.07289","title":"Deformable Feature Alignment and Refinement for Moving Infrared\n  Dim-small Target Detection","authors":"Dengyan Luo, Yanping Xiang, Hu Wang, Luping Ji, Shuai Li and Mao Ye","authorsParsed":[["Luo","Dengyan",""],["Xiang","Yanping",""],["Wang","Hu",""],["Ji","Luping",""],["Li","Shuai",""],["Ye","Mao",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 00:42:25 GMT"}],"updateDate":"2024-07-11","timestamp":1720572145000,"abstract":"  The detection of moving infrared dim-small targets has been a challenging and\nprevalent research topic. The current state-of-the-art methods are mainly based\non ConvLSTM to aggregate information from adjacent frames to facilitate the\ndetection of the current frame. However, these methods implicitly utilize\nmotion information only in the training stage and fail to explicitly explore\nmotion compensation, resulting in poor performance in the case of a video\nsequence including large motion. In this paper, we propose a Deformable Feature\nAlignment and Refinement (DFAR) method based on deformable convolution to\nexplicitly use motion context in both the training and inference stages.\nSpecifically, a Temporal Deformable Alignment (TDA) module based on the\ndesigned Dilated Convolution Attention Fusion (DCAF) block is developed to\nexplicitly align the adjacent frames with the current frame at the feature\nlevel. Then, the feature refinement module adaptively fuses the aligned\nfeatures and further aggregates useful spatio-temporal information by means of\nthe proposed Attention-guided Deformable Fusion (AGDF) block. In addition, to\nimprove the alignment of adjacent frames with the current frame, we extend the\ntraditional loss function by introducing a new motion compensation loss.\nExtensive experimental results demonstrate that the proposed DFAR method\nachieves the state-of-the-art performance on two benchmark datasets including\nDAUB and IRDST.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}