{"id":"2407.16528","title":"Analysis of 3GPP and Ray-Tracing Based Channel Model for 5G Industrial\n  Network Planning","authors":"Gurjot Singh Bhatia, Yoann Corre, Linus Thrybom, M. Di Renzo","authorsParsed":[["Bhatia","Gurjot Singh",""],["Corre","Yoann",""],["Thrybom","Linus",""],["Di Renzo","M.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:40:29 GMT"}],"updateDate":"2024-07-24","timestamp":1721745629000,"abstract":"  Appropriate channel models tailored to the specific needs of industrial\nenvironments are crucial for the 5G private industrial network design and\nguiding deployment strategies. This paper scrutinizes the applicability of\n3GPP's channel model for industrial scenarios. The challenges in accurately\nmodeling industrial channels are addressed, and a refinement strategy is\nproposed employing a ray-tracing (RT) based channel model calibrated with\ncontinuous-wave received power measurements collected in a manufacturing\nfacility in Sweden. The calibration helps the RT model achieve a root mean\nsquare error (RMSE) and standard deviation of less than 7 dB. The 3GPP and the\ncalibrated RT model are statistically compared with the measurements, and the\ncoverage maps of both models are also analyzed. The calibrated RT model is used\nto simulate the network deployment in the factory to satisfy the reference\nsignal received power (RSRP) requirement. The deployment performance is\ncompared with the prediction from the 3GPP model in terms of the RSRP coverage\nmap and coverage rate. Evaluation of deployment performance provides crucial\ninsights into the efficacy of various channel modeling techniques for\noptimizing 5G industrial network planning.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rIZeYDlCf8QX2YEmORuaVjpta7GikONru4X4r4veuF4","pdfSize":"19383132","objectId":"0xe4420cf3499b7a8b0448a3f45436dd3f11aeaef564637ff3e6b4d8e73059ccaf","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
