{"id":"2407.04203","title":"HCS-TNAS: Hybrid Constraint-driven Semi-supervised Transformer-NAS for\n  Ultrasound Image Segmentation","authors":"Renqi Chen, Xinzhe Zheng, Haoyang Su, Kehan Wu","authorsParsed":[["Chen","Renqi",""],["Zheng","Xinzhe",""],["Su","Haoyang",""],["Wu","Kehan",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 01:02:12 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 08:27:14 GMT"}],"updateDate":"2024-08-19","timestamp":1720141332000,"abstract":"  Precise ultrasound segmentation is vital for clinicians to provide\ncomprehensive diagnoses. However, developing a model that accurately segments\nultrasound images is challenging due to the images' low quality and the\nscarcity of extensive labeled data. This results in two main solutions: (1)\noptimizing multi-scale feature representations, and (2) increasing resistance\nto data dependency. The first approach necessitates an advanced network\narchitecture, but a handcrafted network is knowledge-intensive and often yields\nlimited improvement. In contrast, neural architecture search (NAS) can more\neasily attain optimal performance, albeit with significant computational costs.\nRegarding the second issue, semi-supervised learning (SSL) is an established\nmethod, but combining it with complex NAS faces the risk of overfitting to a\nfew labeled samples without extra constraints. Therefore, we introduce a hybrid\nconstraint-driven semi-supervised Transformer-NAS (HCS-TNAS), balancing both\nsolutions for segmentation. HCS-TNAS includes an Efficient NAS-ViT module for\nmulti-scale token search before ViT's attention calculation, effectively\ncapturing contextual and local information with lower computational costs, and\na hybrid SSL framework that adds network independence and contrastive learning\nto the optimization for solving data dependency. By further developing a\nstage-wise optimization strategy, a rational network structure is identified.\nExperiments on public datasets show that HCS-TNAS achieves state-of-the-art\nperformance, pushing the limit of ultrasound segmentation.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}