{"id":"2407.00300","title":"On the near soliton dynamics for the 2D cubic Zakharov-Kuznetsov\n  equations","authors":"Gong Chen, Yang Lan and Xu Yuan","authorsParsed":[["Chen","Gong",""],["Lan","Yang",""],["Yuan","Xu",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 03:45:37 GMT"}],"updateDate":"2024-07-02","timestamp":1719632737000,"abstract":"  In this article, we consider the Cauchy problem for the cubic (mass-critical)\nZakharov-Kuznetsov equations in dimension two: $$\\partial_t\nu+\\partial_{x_1}(\\Delta u+u^3)=0,\\quad (t,x)\\in [0,\\infty)\\times\n\\mathbb{R}^{2}.$$ For initial data in $H^1$ close to the soliton with a\nsuitable space-decay property, we fully describe the asymptotic behavior of the\ncorresponding solution. More precisely, for such initial data, we show that\nonly three possible behaviors can occur: 1) The solution leaves a tube near\nsoliton in finite time; 2) the solution blows up in finite time; 3) the\nsolution is global and locally converges to a soliton. In addition, we show\nthat for initial data near a soliton with non-positive energy and above the\nthreshold mass, the corresponding solution will blow up as described in Case 2.\n  Our proof is inspired by the techniques developed for mass-critical\ngeneralized Korteweg-de Vries equation (gKdV) equation in a similar context by\nMartel-Merle-Rapha\\\"el. More precisely, our proof relies on refined modulation\nestimates and a modified energy-virial Lyapunov functional. The primary\nchallenge in our problem is the lack of coercivity of the Schr\\\"odinger\noperator which appears in the virial-type estimate. To overcome the difficulty,\nwe apply a transform, which was first introduced in Kenig-Martel [13], to\nperform the virial computations after converting the original problem to the\nadjoint one. Th coercivity of the Schr\\\"odinger operator in the adjoint problem\nhas been numerically verified by Farah-Holmer-Roudenko-Yang [9].\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"Op2Ac9Fdm8IAYI2nEhNRyTYO6D_EfnW6FxTVNbSws3k","pdfSize":"971821"}
