{"id":"2407.07943","title":"Holographic Hagedorn Temperature: Strong Coupling, Flavor and\n  $\\theta$-angle Effects","authors":"Francesco Bigazzi, Tommaso Canneti, Aldo L. Cotrone, Jos\\'e Manuel\n  Pen\\'in","authorsParsed":[["Bigazzi","Francesco",""],["Canneti","Tommaso",""],["Cotrone","Aldo L.",""],["Penín","José Manuel",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:00:02 GMT"}],"updateDate":"2024-07-12","timestamp":1720634402000,"abstract":"  We study the Hagedorn temperature $T_H$ of strongly coupled quantum field\ntheories admitting a holographic string or M-theory description in various\nregimes and scenarios.\n  In the first part of the paper we propose a ``thermal scalar'' effective\napproach to the calculation of $T_H$ in eleven-dimensional supergravity. The\nproposal allows to extend the existing results for $T_H$ to the strongly\ncoupled string regime, i.e. to a previously unexplored regime of field theory\nparameters where the number of colors $N$ is smaller than (some power of) the\n't Hooft coupling $\\lambda$. We can thus extend the existing results for the\n$\\alpha'$ expansion of the ABJM model, which have a spectacular agreement with\npredictions from integrability, in a different direction in parameter space. In\nparticular, we explicitate the first non-perturbative corrections. We also\napply the formalism to the Witten-Yang-Mills model, finding that the result for\nthe ratio of $T_H$ with the deconfinement temperature is in the same ballpark\nof the lattice one for pure Yang-Mills. Within the same model, we study the\ndependence of the Hagedorn temperature on the $\\theta$-angle.\n  In the second part of the paper we analyze the effect of dynamical flavors on\n$T_H$ in confining theories. By studying the few available examples of regular\nbackgrounds dual to confining theories with flavors, we find that generally the\neffects of flavors is to reduce the value of $T_H$ in units of the square root\nof the confining string tension. The effect turns out to be milder than the\nanalogous reduction of the critical temperature for deconfinement when the\nlatter is known.\n","subjects":["Physics/High Energy Physics - Theory","Physics/High Energy Physics - Lattice"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}