{"id":"2407.17171","title":"Deep Learning Reduced Order Modelling on Parametric and Data driven\n  domains","authors":"Martina Buka\\v{c} (1), Iva Manojlovi\\'c (2), Boris Muha (3), Domagoj\n  Vlah (2) ((1) University of Notre Dame, Notre Dame, IN, (2) University of\n  Zagreb Faculty of Electrical Engineering and Computing, (3) Department of\n  Mathematics, Faculty of Science, University of Zagreb)","authorsParsed":[["Bukač","Martina",""],["Manojlović","Iva",""],["Muha","Boris",""],["Vlah","Domagoj",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 11:22:09 GMT"}],"updateDate":"2024-07-25","timestamp":1721820129000,"abstract":"  Partial differential equations (PDEs) are extensively utilized for modeling\nvarious physical phenomena. These equations often depend on certain parameters,\nnecessitating either the identification of optimal parameters or solving the\nequation across multiple parameters to understand how a structure might react\nunder different conditions. Performing an exhaustive search over the parameter\nspace requires solving the PDE multiple times, which is generally impractical.\nTo address this challenge, Reduced Order Models (ROMs) are constructed from a\nsnapshot dataset comprising parameter-solution pairs. ROMs facilitate the rapid\nsolving of PDEs for new parameters.\n  Recently, Deep Learning ROMs (DL-ROMs) have been introduced as a new method\nto obtain ROM. Additionally, the PDE of interest may depend on the domain,\nwhich can be characterized by parameters or measurements and may evolve with\nthe system, requiring parametrization for ROM construction. In this paper, we\ndevelop a Deep-ROM capable of extracting and efficiently utilizing domain\nparametrization. Unlike traditional domain parametrization methods, our\napproach does not require user-defined control points and can effectively\nhandle domains with varying numbers of components. Moreover, our model can\nderive meaningful parametrization even when a domain mesh is unavailable, a\ncommon scenario in biomedical applications. Our work leverages Deep Neural\nNetworks to effectively reduce the dimensionality of the PDE and the domain\ncharacteristic function.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}