{"id":"2407.07183","title":"Atom interferometry in an Einstein Elevator","authors":"Celia Pelluet and Romain Arguel and Martin Rabault and Vincent Jarlaud\n  and Clement Metayer and Brynle Barrett and Philippe Bouyer and Baptiste\n  Battelier","authorsParsed":[["Pelluet","Celia",""],["Arguel","Romain",""],["Rabault","Martin",""],["Jarlaud","Vincent",""],["Metayer","Clement",""],["Barrett","Brynle",""],["Bouyer","Philippe",""],["Battelier","Baptiste",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 18:53:11 GMT"}],"updateDate":"2024-07-11","timestamp":1720551191000,"abstract":"  Recent advances in atom interferometry have led to the development of quantum\ninertial sensors with outstanding performance in terms of sensitivity,\naccuracy, and long-term stability. For ground-based implementations, these\nsensors are ultimately limited by the free-fall height of atomic fountains\nrequired to interrogate the atoms over extended timescales. This limitation can\nbe overcome in Space and in unique ``microgravity'' facilities such as drop\ntowers or free-falling aircraft. These facilities require large investments,\nlong development times, and place stringent constraints on instruments that\nfurther limit their widespread use. The available ``up time'' for experiments\nis also quite low, making extended studies challenging. In this work, we\npresent a new approach in which atom interferometry is performed in a\nlaboratory-scale Einstein Elevator. Our experiment is mounted to a moving\nplatform that mimics the vertical free-fall trajectory every 13.5 seconds. With\na total interrogation time of $2T = 200$ ms, we demonstrate an acceleration\nsensitivity of $6 \\times 10^{-7}$ m/s$^{2}$ per shot, limited primarily by the\ntemperature of our atomic samples. We further demonstrate the capability to\nperform long-term statistical studies by operating the Einstein Elevator over\nseveral days with high reproducibility. These represent state-of-the-art\nresults achieved in microgravity and further demonstrates the potential of\nquantum inertial sensors in Space. Our microgravity platform is both an\nalternative to large atomic fountains and a versatile facility to prepare\nfuture Space missions.\n","subjects":["Physics/Atomic Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}