{"id":"2407.15832","title":"Non-minimally coupled gravity as a physically viable fit to DESI 2024\n  BAO","authors":"Gen Ye, Matteo Martinelli, Bin Hu, Alessandra Silvestri","authorsParsed":[["Ye","Gen",""],["Martinelli","Matteo",""],["Hu","Bin",""],["Silvestri","Alessandra",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 17:50:31 GMT"}],"updateDate":"2024-07-23","timestamp":1721670631000,"abstract":"  The recent measurements of baryon acoustic oscillations (BAO) from the DESI\ncollaboration have presented an indication for dynamical dark energy, when\nadopting the $(w_0,w_a)$ parametrization of the equation of state. The\nassociated posterior constraints imply a crossing of the phantom divide. The\nlatter, however, has profound theoretical implications because not all models\ncan do so without developing incurable instabilities. Simple quintessence\nmodels of dark energy, for instance, would be ruled out if such a crossing is\nconfirmed. We perform a non-parametric reconstruction of the equation of state,\nand confirm that crossing of the phantom divide is required by the DESI BAO\ndata. We then explore the theory space of Horndeski gravity employing a\nreconstruction method based on the effective field theory of dark energy, and\nshow that for most of the models it is still difficult to safely cross the\ndivide. We identify non-minimal coupling to gravity as the key modification\nwhich sustains a stable phantom crossing in the general Horndeski theory space\nand fits DESI observations. Guided by these insights, we propose the\n\\textit{Thawing Gravity} model which has the same number of parameters as\n$w_0w_a$CDM and naturally realizes non-minimal coupling when dark energy\nbecomes non-negligible. \\textit{Thawing Gravity} improves the fit over\n$\\Lambda$CDM for DESI BAO, CMB as well as type Ia Supernovae.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}