{"id":"2407.19564","title":"Forecast-PEFT: Parameter-Efficient Fine-Tuning for Pre-trained Motion\n  Forecasting Models","authors":"Jifeng Wang, Kaouther Messaoud, Yuejiang Liu, Juergen Gall, Alexandre\n  Alahi","authorsParsed":[["Wang","Jifeng",""],["Messaoud","Kaouther",""],["Liu","Yuejiang",""],["Gall","Juergen",""],["Alahi","Alexandre",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 19:18:59 GMT"}],"updateDate":"2024-07-30","timestamp":1722194339000,"abstract":"  Recent progress in motion forecasting has been substantially driven by\nself-supervised pre-training. However, adapting pre-trained models for specific\ndownstream tasks, especially motion prediction, through extensive fine-tuning\nis often inefficient. This inefficiency arises because motion prediction\nclosely aligns with the masked pre-training tasks, and traditional full\nfine-tuning methods fail to fully leverage this alignment. To address this, we\nintroduce Forecast-PEFT, a fine-tuning strategy that freezes the majority of\nthe model's parameters, focusing adjustments on newly introduced prompts and\nadapters. This approach not only preserves the pre-learned representations but\nalso significantly reduces the number of parameters that need retraining,\nthereby enhancing efficiency. This tailored strategy, supplemented by our\nmethod's capability to efficiently adapt to different datasets, enhances model\nefficiency and ensures robust performance across datasets without the need for\nextensive retraining. Our experiments show that Forecast-PEFT outperforms\ntraditional full fine-tuning methods in motion prediction tasks, achieving\nhigher accuracy with only 17% of the trainable parameters typically required.\nMoreover, our comprehensive adaptation, Forecast-FT, further improves\nprediction performance, evidencing up to a 9.6% enhancement over conventional\nbaseline methods. Code will be available at\nhttps://github.com/csjfwang/Forecast-PEFT.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}