{"id":"2407.17359","title":"Simulated [CII] in high-z galaxies","authors":"N. Mu\\~noz-Elgueta, F. Arrigoni Battaia, G. Kauffmann, R. Pakmor, S.\n  Walch, A. Obreja, L. Buhlmann","authorsParsed":[["Muñoz-Elgueta","N.",""],["Battaia","F. Arrigoni",""],["Kauffmann","G.",""],["Pakmor","R.",""],["Walch","S.",""],["Obreja","A.",""],["Buhlmann","L.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 15:30:49 GMT"}],"updateDate":"2024-07-25","timestamp":1721835049000,"abstract":"  Extended [CII] emission on tens of kpc, also known as a [CII] halo, is being\ncurrently reported around z$\\sim$4-6 star-forming galaxies, especially thanks\nto the statistics of the ALPINE survey. The [CII] emission is expected to trace\ndense cold gas in the inner CGM of these galaxies. The origin of this emission\nis still debated. In this paper, we present a post-processing model applied to\nIllustris-TNG50 star-forming galaxies at $z\\sim$4-6, and we compare our results\nwith the ALPINE observations. By incorporating C$^{+}$ abundances derived from\nUV background and young stars as radiation sources, we generate mock\nobservations, from which we extract surface-brightness (SB) profiles. We found\nthat our model predicts similar [CII] emission values on galactic scales as the\nobservations, providing validation for our approach. However, we find that the\npredicted [CII] emission in the inner circumgalactic medium (CGM) falls below\nthe observed values by a factor of $\\sim$10. We discuss several model\nlimitations that may contribute to this discrepancy. We also find discrepancies\nwith observations when comparing SB profiles of low and high-SFR galaxies.\nUnlike the observations, simulations exhibit no discernible difference in the\nextended [CII] emission between the two subsamples. This discrepancy may\nreflect shortcomings in feedback model of the simulation. Finally, our analysis\nsuggests that the extended [CII] emission is likely a result of both gas from\nsatellite galaxies and outflows from central galaxies, with satellites playing\na dominant role within 0.6$<$R/R$_{\\rm vir}<$1. A firm estimate of the\nimportance of each contribution is beyond the scope of the current simulations.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"vMRBuAr9hyZKdlSZBaaJ15g0E8oLZkT19blROC5e3jY","pdfSize":"2576070"}
