{"id":"2407.01593","title":"neuROSym: Deployment and Evaluation of a ROS-based Neuro-Symbolic Model\n  for Human Motion Prediction","authors":"Sariah Mghames, Luca Castri, Marc Hanheide, Nicola Bellotto","authorsParsed":[["Mghames","Sariah",""],["Castri","Luca",""],["Hanheide","Marc",""],["Bellotto","Nicola",""]],"versions":[{"version":"v1","created":"Mon, 24 Jun 2024 11:13:06 GMT"}],"updateDate":"2024-07-03","timestamp":1719227586000,"abstract":"  Autonomous mobile robots can rely on several human motion detection and\nprediction systems for safe and efficient navigation in human environments, but\nthe underline model architectures can have different impacts on the\ntrustworthiness of the robot in the real world. Among existing solutions for\ncontext-aware human motion prediction, some approaches have shown the benefit\nof integrating symbolic knowledge with state-of-the-art neural networks. In\nparticular, a recent neuro-symbolic architecture (NeuroSyM) has successfully\nembedded context with a Qualitative Trajectory Calculus (QTC) for spatial\ninteractions representation. This work achieved better performance than\nneural-only baseline architectures on offline datasets. In this paper, we\nextend the original architecture to provide neuROSym, a ROS package for robot\ndeployment in real-world scenarios, which can run, visualise, and evaluate\nprevious neural-only and neuro-symbolic models for motion prediction online. We\nevaluated these models, NeuroSyM and a baseline SGAN, on a TIAGo robot in two\nscenarios with different human motion patterns. We assessed accuracy and\nruntime performance of the prediction models, showing a general improvement in\ncase our neuro-symbolic architecture is used. We make the neuROSym package1\npublicly available to the robotics community.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"jWnKoSqK4vcz9rxgJfq_otBZ592hlGf22ZsIshjVP4c","pdfSize":"1515897"}
