{"id":"2407.02491","title":"Enhancing Automotive User Experience with Dynamic Service Orchestration\n  for Software Defined Vehicles","authors":"Pierre Laclau (Heudiasyc), St\\'ephane Bonnet (Heudiasyc), Bertrand\n  Ducourthial (Heudiasyc), Xiaoting Li, Trista Lin","authorsParsed":[["Laclau","Pierre","","Heudiasyc"],["Bonnet","Stéphane","","Heudiasyc"],["Ducourthial","Bertrand","","Heudiasyc"],["Li","Xiaoting",""],["Lin","Trista",""]],"versions":[{"version":"v1","created":"Mon, 18 Mar 2024 10:29:43 GMT"}],"updateDate":"2024-07-04","timestamp":1710757783000,"abstract":"  With the increasing demand for dynamic behaviors in automotive use cases,\nSoftware Defined Vehicles (SDVs) have emerged as a promising solution by\nbringing dynamic onboard service management capabilities. While users may\nrequest a wide range of services during vehicle operation, background tasks\nsuch as cooperative Vehicle-to-Everything (V2X) services can activate\non-the-fly in response to real-time road conditions. In this dynamic\nenvironment, the efficient allocation of onboard resources becomes a complex\nchallenge, in order to meet mixed-criticality onboard Quality-of-Service (QoS)\nnetwork requirements while ensuring an optimal user experience. Additionally,\nthe ever-evolving real-time network connectivity and computational availability\nconditions further complicate the process. In this context, we present a\ndynamic resource-based onboard service orchestration algorithm that considers\nreal-time in-vehicle and V2X network health, along with onboard resource\nconstraints, to select degraded modes for onboard applications and maximize\nuser experience. To enable dynamic orchestration, we introduce the concept of\nAutomotive eXperience Integrity Level (AXIL) which expresses a runtime priority\nfor non-safety-critical applications. This algorithm produces near-optimal\nsolutions while significantly reducing execution time compared to\nstraightforward methods as demonstrated by simulation results. With this\napproach, we aim to enable efficient onboard execution for a user\nexperience-focused service orchestration.\n","subjects":["Computing Research Repository/Multiagent Systems","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}