{"id":"2407.19656","title":"Exploring quantum sensing for fine-grained liquid recognition","authors":"Yuechun Jiao, Jinlian Hu, Zitong Lan, Fusang Zhang, Jie Xiong, Jingxu\n  Bai, Zhaoxin Chang, Yuqi Su, Beihong Jin, Daqing Zhang, Jianming Zhao,\n  Suotang Jia","authorsParsed":[["Jiao","Yuechun",""],["Hu","Jinlian",""],["Lan","Zitong",""],["Zhang","Fusang",""],["Xiong","Jie",""],["Bai","Jingxu",""],["Chang","Zhaoxin",""],["Su","Yuqi",""],["Jin","Beihong",""],["Zhang","Daqing",""],["Zhao","Jianming",""],["Jia","Suotang",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 02:40:34 GMT"}],"updateDate":"2024-07-30","timestamp":1722220834000,"abstract":"  Recent years have witnessed the use of pervasive wireless signals (e.g.,\nWi-Fi, RFID, and mmWave) for sensing purposes. Due to its non-intrusive\ncharacteristic, wireless sensing plays an important role in various intelligent\nsensing applications. However, limited by the inherent thermal noise of RF\ntransceivers, the sensing granularity of existing wireless sensing systems are\nstill coarse, limiting their adoption for fine-grained sensing applications. In\nthis paper, we introduce the quantum receiver, which does not contain\ntraditional electronic components such as mixers, amplifiers, and\nanalog-to-digital converters (ADCs) to wireless sensing systems, significantly\nreducing the source of thermal noise. By taking non-intrusive liquid\nrecognition as an application example, we show the superior performance of\nquantum wireless sensing. By leveraging the unique property of quantum\nreceiver, we propose a novel double-ratio method to address several well-known\nchallenges in liquid recognition, eliminating the effect of liquid volume,\ndevice-target distance and container. We implement the quantum sensing\nprototype and evaluate the liquid recognition performance comprehensively. The\nresults show that our system is able to recognize 17 commonly seen liquids,\nincluding very similar ones~(e.g., Pepsi and Coke) at an accuracy higher than\n99.9\\%. For milk expiration monitoring, our system is able to achieve an\naccuracy of 99.0\\% for pH value measurements at a granularity of 0.1, which is\nmuch finer than that required for expiration monitoring.\n","subjects":["Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DBxlRwloW0Am8bo44Y1eW1fvMdtMqLo_m8TP4JqinRI","pdfSize":"1590170"}
