{"id":"2407.10470","title":"Forecast of strongly lensed supernovae rates in the China Space Station\n  Telescope surveys","authors":"Jiang Dong, Yiping Shu, Guoliang Li, Xinzhong Er, Bin Hu, Youhua Xu","authorsParsed":[["Dong","Jiang",""],["Shu","Yiping",""],["Li","Guoliang",""],["Er","Xinzhong",""],["Hu","Bin",""],["Xu","Youhua",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 06:56:49 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 04:07:03 GMT"}],"updateDate":"2024-09-16","timestamp":1721026609000,"abstract":"  Strong gravitationally lensed supernovae (SNe) are a powerful probe for\ncosmology and stellar physics. The relative time delays between lensed SN\nimages provide an independent way of measuring a fundamental cosmological\nparameter -- the Hubble constant -- , the value of which is currently under\ndebate. The time delays also serve as a ``time machine'', offering a unique\nopportunity to capture the extremely early phase of the SN explosion, which can\nbe used to constrain the SN progenitor and explosion mechanism. Although there\nare only a handful of strongly lensed SN discoveries so far, which greatly\nhinders scientific applications, the sample size is expected to grow\nsubstantially with next-generation surveys. In this work, we investigate the\ncapability of detecting strongly lensed SNe with the China Space Station\nTelescope (CSST), a two-meter space telescope to be launched around 2026.\nThrough Monte Carlo simulations, we predict that CSST can detect 1008.53 and\n51.78 strongly lensed SNe from its Wide Field Survey (WFS, covering 17,500\ndeg$^2$) and Deep Field Survey (DFS, covering 400 deg$^2$) over the course of\nten years. In both surveys, about 35\\% of the events involve Type Ia SNe as the\nbackground sources. Our results suggest that the WFS and DFS of CSST, although\nnot designed or optimized for discovering transients, can still make a great\ncontribution to the strongly lensed SNe studies.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}