{"id":"2407.13346","title":"Integrated Design and Fabrication of Pneumatic Soft Robot Actuators in a\n  Single Casting Step","authors":"Afonso Silva, Diogo Fonseca, Diogo M. Neto, Mihail Babcinschi, Pedro\n  Neto","authorsParsed":[["Silva","Afonso",""],["Fonseca","Diogo",""],["Neto","Diogo M.",""],["Babcinschi","Mihail",""],["Neto","Pedro",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:46:15 GMT"}],"updateDate":"2024-07-19","timestamp":1721295975000,"abstract":"  Bio-inspired soft robots have already shown the ability to handle uncertainty\nand adapt to unstructured environments. However, their availability is\npartially restricted by time-consuming, costly and highly supervised\ndesign-fabrication processes, often based on resource intensive iterative\nworkflows. Here, we propose an integrated approach targeting the design and\nfabrication of pneumatic soft actuators in a single casting step. Molds and\nsacrificial water-soluble hollow cores are printed using fused filament\nfabrication (FFF). A heated water circuit accelerates the dissolution of the\ncore's material and guarantees its complete removal from the actuator walls,\nwhile the actuator's mechanical operability is defined through finite element\nanalysis (FEA). This enables the fabrication of actuators with non-uniform\ncross sections under minimal supervision, thereby reducing the number of\niterations necessary during the design and fabrication processes. Three\nactuators capable of bending and linear motion were designed, fabricated,\nintegrated and demonstrated as three different bio-inspired soft robots, an\nearthworm-inspired robot, a four-legged robot, and a robotic gripper. We\ndemonstrate the availability, versatility and effectiveness of the proposed\nmethods, contributing to accelerating the design and fabrication of soft\nrobots. This study represents a step toward increasing the accessibility of\nsoft robots to people at a lower cost.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}