{"id":"2407.14239","title":"KoMA: Knowledge-driven Multi-agent Framework for Autonomous Driving with\n  Large Language Models","authors":"Kemou Jiang, Xuan Cai, Zhiyong Cui, Aoyong Li, Yilong Ren, Haiyang Yu,\n  Hao Yang, Daocheng Fu, Licheng Wen, and Pinlong Cai","authorsParsed":[["Jiang","Kemou",""],["Cai","Xuan",""],["Cui","Zhiyong",""],["Li","Aoyong",""],["Ren","Yilong",""],["Yu","Haiyang",""],["Yang","Hao",""],["Fu","Daocheng",""],["Wen","Licheng",""],["Cai","Pinlong",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 12:13:08 GMT"}],"updateDate":"2024-07-22","timestamp":1721391188000,"abstract":"  Large language models (LLMs) as autonomous agents offer a novel avenue for\ntackling real-world challenges through a knowledge-driven manner. These\nLLM-enhanced methodologies excel in generalization and interpretability.\nHowever, the complexity of driving tasks often necessitates the collaboration\nof multiple, heterogeneous agents, underscoring the need for such LLM-driven\nagents to engage in cooperative knowledge sharing and cognitive synergy.\nDespite the promise of LLMs, current applications predominantly center around\nsingle agent scenarios. To broaden the horizons of knowledge-driven strategies\nand bolster the generalization capabilities of autonomous agents, we propose\nthe KoMA framework consisting of multi-agent interaction, multi-step planning,\nshared-memory, and ranking-based reflection modules to enhance multi-agents'\ndecision-making in complex driving scenarios. Based on the framework's\ngenerated text descriptions of driving scenarios, the multi-agent interaction\nmodule enables LLM agents to analyze and infer the intentions of surrounding\nvehicles, akin to human cognition. The multi-step planning module enables LLM\nagents to analyze and obtain final action decisions layer by layer to ensure\nconsistent goals for short-term action decisions. The shared memory module can\naccumulate collective experience to make superior decisions, and the\nranking-based reflection module can evaluate and improve agent behavior with\nthe aim of enhancing driving safety and efficiency. The KoMA framework not only\nenhances the robustness and adaptability of autonomous driving agents but also\nsignificantly elevates their generalization capabilities across diverse\nscenarios. Empirical results demonstrate the superiority of our approach over\ntraditional methods, particularly in its ability to handle complex,\nunpredictable driving environments without extensive retraining.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}