{"id":"2407.16128","title":"Advancing Brain Imaging Analysis Step-by-step via Progressive Self-paced\n  Learning","authors":"Yanwu Yang, Hairui Chen, Jiesi Hu, Xutao Guo, Ting Ma","authorsParsed":[["Yang","Yanwu",""],["Chen","Hairui",""],["Hu","Jiesi",""],["Guo","Xutao",""],["Ma","Ting",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 02:26:04 GMT"}],"updateDate":"2024-07-24","timestamp":1721701564000,"abstract":"  Recent advancements in deep learning have shifted the development of brain\nimaging analysis. However, several challenges remain, such as heterogeneity,\nindividual variations, and the contradiction between the high dimensionality\nand small size of brain imaging datasets. These issues complicate the learning\nprocess, preventing models from capturing intrinsic, meaningful patterns and\npotentially leading to suboptimal performance due to biases and overfitting.\nCurriculum learning (CL) presents a promising solution by organizing training\nexamples from simple to complex, mimicking the human learning process, and\npotentially fostering the development of more robust and accurate models.\nDespite its potential, the inherent limitations posed by small initial training\ndatasets present significant challenges, including overfitting and poor\ngeneralization. In this paper, we introduce the Progressive Self-Paced\nDistillation (PSPD) framework, employing an adaptive and progressive pacing and\ndistillation mechanism. This allows for dynamic curriculum adjustments based on\nthe states of both past and present models. The past model serves as a teacher,\nguiding the current model with gradually refined curriculum knowledge and\nhelping prevent the loss of previously acquired knowledge. We validate PSPD's\nefficacy and adaptability across various convolutional neural networks using\nthe Alzheimer's Disease Neuroimaging Initiative (ADNI) dataset, underscoring\nits superiority in enhancing model performance and generalization capabilities.\nThe source code for this approach will be released at\nhttps://github.com/Hrychen7/PSPD.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}