{"id":"2407.13133","title":"FocusDiffuser: Perceiving Local Disparities for Camouflaged Object\n  Detection","authors":"Jianwei Zhao, Xin Li, Fan Yang, Qiang Zhai, Ao Luo, Zicheng Jiao, and\n  Hong Cheng","authorsParsed":[["Zhao","Jianwei",""],["Li","Xin",""],["Yang","Fan",""],["Zhai","Qiang",""],["Luo","Ao",""],["Jiao","Zicheng",""],["Cheng","Hong",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 03:45:12 GMT"}],"updateDate":"2024-07-19","timestamp":1721274312000,"abstract":"  Detecting objects seamlessly blended into their surroundings represents a\ncomplex task for both human cognitive capabilities and advanced artificial\nintelligence algorithms. Currently, the majority of methodologies for detecting\ncamouflaged objects mainly focus on utilizing discriminative models with\nvarious unique designs. However, it has been observed that generative models,\nsuch as Stable Diffusion, possess stronger capabilities for understanding\nvarious objects in complex environments; Yet their potential for the cognition\nand detection of camouflaged objects has not been extensively explored. In this\nstudy, we present a novel denoising diffusion model, namely FocusDiffuser, to\ninvestigate how generative models can enhance the detection and interpretation\nof camouflaged objects. We believe that the secret to spotting camouflaged\nobjects lies in catching the subtle nuances in details. Consequently, our\nFocusDiffuser innovatively integrates specialized enhancements, notably the\nBoundary-Driven LookUp (BDLU) module and Cyclic Positioning (CP) module, to\nelevate standard diffusion models, significantly boosting the detail-oriented\nanalytical capabilities. Our experiments demonstrate that FocusDiffuser, from a\ngenerative perspective, effectively addresses the challenge of camouflaged\nobject detection, surpassing leading models on benchmarks like CAMO, COD10K and\nNC4K.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}