{"id":"2407.18276","title":"Rome was Not Built in a Single Step: Hierarchical Prompting for\n  LLM-based Chip Design","authors":"Andre Nakkab, Sai Qian Zhang, Ramesh Karri, Siddharth Garg","authorsParsed":[["Nakkab","Andre",""],["Zhang","Sai Qian",""],["Karri","Ramesh",""],["Garg","Siddharth",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 21:18:31 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 04:43:05 GMT"},{"version":"v3","created":"Mon, 9 Sep 2024 20:01:22 GMT"}],"updateDate":"2024-09-11","timestamp":1721769511000,"abstract":"  Large Language Models (LLMs) are effective in computer hardware synthesis via\nhardware description language (HDL) generation. However, LLM-assisted\napproaches for HDL generation struggle when handling complex tasks. We\nintroduce a suite of hierarchical prompting techniques which facilitate\nefficient stepwise design methods, and develop a generalizable automation\npipeline for the process. To evaluate these techniques, we present a benchmark\nset of hardware designs which have solutions with or without architectural\nhierarchy. Using these benchmarks, we compare various open-source and\nproprietary LLMs, including our own fine-tuned Code Llama-Verilog model. Our\nhierarchical methods automatically produce successful designs for complex\nhardware modules that standard flat prompting methods cannot achieve, allowing\nsmaller open-source LLMs to compete with large proprietary models. Hierarchical\nprompting reduces HDL generation time and yields savings on LLM costs. Our\nexperiments detail which LLMs are capable of which applications, and how to\napply hierarchical methods in various modes. We explore case studies of\ngenerating complex cores using automatic scripted hierarchical prompts,\nincluding the first-ever LLM-designed processor with no human feedback. Tools\nfor the Recurrent Optimization via Machine Editing (ROME) method can be found\nat https://github.com/ajn313/ROME-LLM\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}