{"id":"2407.21439","title":"MLLM Is a Strong Reranker: Advancing Multimodal Retrieval-augmented\n  Generation via Knowledge-enhanced Reranking and Noise-injected Training","authors":"Zhanpeng Chen, Chengjin Xu, Yiyan Qi, Jian Guo","authorsParsed":[["Chen","Zhanpeng",""],["Xu","Chengjin",""],["Qi","Yiyan",""],["Guo","Jian",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 08:43:17 GMT"}],"updateDate":"2024-08-01","timestamp":1722415397000,"abstract":"  Multimodal Large Language Models (MLLMs) have demonstrated remarkable\ncapabilities in processing and generating content across multiple data\nmodalities, including text, images, audio, and video. However, a significant\ndrawback of MLLMs is their reliance on static training data, leading to\noutdated information and limited contextual awareness. This static nature\nhampers their ability to provide accurate, up-to-date responses, particularly\nin dynamic or rapidly evolving contexts. Integrating Multimodal\nRetrieval-augmented Generation (Multimodal RAG) offers a promising solution,\nbut the system would inevitably encounter the multi-granularity noisy\ncorrespondence (MNC) problem, which involves two types of noise: coarse-grained\n(query-caption) and fine-grained (query-image). This noise hinders accurate\nretrieval and generation. In this work, we propose \\textbf{RagLLaVA}, a novel\nframework with knowledge-enhanced reranking and noise-injected training, to\naddress these limitations. We instruction-tune the MLLM with a simple yet\neffective instruction template to induce its ranking ability and serve it as a\nreranker to precisely filter the top-k retrieved images. For generation, we\ninject visual noise during training at the data and token levels to enhance the\ngenerator's robustness. Extensive experiments are conducted on the subsets of\ntwo datasets that require retrieving and reasoning over images to answer a\ngiven query. Our results demonstrate the superiority of RagLLaVA in retrieving\naccurately and generating robustly. Code and models are available at\nhttps://github.com/IDEA-FinAI/RagLLaVA.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}