{"id":"2407.07991","title":"Entanglement of photonic modes from a continuously driven two-level\n  system","authors":"Jiaying Yang, Ingrid Strandberg, Alejandro Vivas-Viana, Akshay\n  Gaikwad, Claudia Castillo-Moreno, Anton Frisk Kockum, Muhammad Asad Ullah,\n  Carlos Sanchez Munoz, Axel Martin Eriksson, and Simone Gasparinetti","authorsParsed":[["Yang","Jiaying",""],["Strandberg","Ingrid",""],["Vivas-Viana","Alejandro",""],["Gaikwad","Akshay",""],["Castillo-Moreno","Claudia",""],["Kockum","Anton Frisk",""],["Ullah","Muhammad Asad",""],["Munoz","Carlos Sanchez",""],["Eriksson","Axel Martin",""],["Gasparinetti","Simone",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:48:41 GMT"}],"updateDate":"2024-07-12","timestamp":1720637321000,"abstract":"  The ability to generate entangled states of light is a key primitive for\nquantum communication and distributed quantum computation. Continuously driven\nsources, including those based on spontaneous parametric downconversion, are\nusually probabilistic, whereas deterministic sources require accurate timing of\nthe control fields. Here, we experimentally generate entangled photonic modes\nby continuously exciting a quantum emitter, a superconducting qubit, with a\ncoherent drive, taking advantage of mode matching in the time and frequency\ndomain. Using joint quantum state tomography and logarithmic negativity, we\nshow that entanglement is generated between modes extracted from the two\nsidebands of the resonance fluorescence spectrum. Because the entangled\nphotonic modes are perfectly orthogonal, they can be transferred into distinct\nquantum memories. Our approach can be utilized to distribute entanglement at a\nhigh rate in various physical platforms, with applications in waveguide quantum\nelectrodynamics, distributed quantum computing, and quantum networks.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"JHhhq624oIsUz15fycQbqaBnULuibE-XZTByzzkWJyg","pdfSize":"19043835"}
