{"id":"2407.02003","title":"Policy Changes and Growth Slowdown: Assessing the Lost Decade of the\n  Latin American Miracle","authors":"Emiliano Toni, Pablo Paniagua, and Patricio \\'Ordenes","authorsParsed":[["Toni","Emiliano",""],["Paniagua","Pablo",""],["Órdenes","Patricio",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 07:22:26 GMT"}],"updateDate":"2024-07-03","timestamp":1719904946000,"abstract":"  The Latin American region has suffered an economic slowdown since the end of\nthe commodities boom. Within this context, Chile was the poster child of\neconomic growth and development up until 2014. Since then, Chile has also been\ntrapped in a decade of slow economic growth. Chile's sudden slowdown and recent\ngrowth path divergence have posed a puzzle for economic growth and development\neconomics. This paper examines this slowdown from an empirical perspective and\ndetermines how much can be attributed to internal and external causes. Using a\nsynthetic control approach and a structural time series Bayesian estimation,\nour findings suggest that at least two-thirds of the Chilean slowdown is\nattributable to internal causes driven by a policy regime change in 2014, with\nexternal factors playing a secondary role. The net effect of this set of\ninternal reforms resulted in a nearly 10% reduction in real GDP per capita over\nfive years and led to a 1.8% decline in average GDP growth rates from 2015 to\n2019. Our results are consistent with the literature that establishes that\nexternal shocks can explain only a small fraction of the poor economic\nperformance of developing countries, suggesting that internal factors are the\nprimary source of subpar performance. This research sheds light on the\npotential effects of policy regime shifts in economic growth, thus providing\nvaluable insights for development economics and, more specifically, emerging\neconomies.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"sgfS_NetVnb5KFXJ_MuhgMjx7mEJnrdf5Vxk3_-m1Do","pdfSize":"1546428","objectId":"0x0495264859154570dbdd510148b9ea6830cbb79a1bfdb33b3e5db5a7d84fb411","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
