{"id":"2407.12973","title":"Temporal Label Hierachical Network for Compound Emotion Recognition","authors":"Sunan Li and Hailun Lian and Cheng Lu and Yan Zhao and Tianhua Qi and\n  Hao Yang and Yuan Zong and Wenming Zheng","authorsParsed":[["Li","Sunan",""],["Lian","Hailun",""],["Lu","Cheng",""],["Zhao","Yan",""],["Qi","Tianhua",""],["Yang","Hao",""],["Zong","Yuan",""],["Zheng","Wenming",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 19:38:44 GMT"}],"updateDate":"2024-07-19","timestamp":1721245124000,"abstract":"  The emotion recognition has attracted more attention in recent decades.\nAlthough significant progress has been made in the recognition technology of\nthe seven basic emotions, existing methods are still hard to tackle compound\nemotion recognition that occurred commonly in practical application. This\narticle introduces our achievements in the 7th Field Emotion Behavior Analysis\n(ABAW) competition. In the competition, we selected pre trained ResNet18 and\nTransformer, which have been widely validated, as the basic network framework.\nConsidering the continuity of emotions over time, we propose a time pyramid\nstructure network for frame level emotion prediction. Furthermore. At the same\ntime, in order to address the lack of data in composite emotion recognition, we\nutilized fine-grained labels from the DFEW database to construct training data\nfor emotion categories in competitions. Taking into account the characteristics\nof valence arousal of various complex emotions, we constructed a classification\nframework from coarse to fine in the label space.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HiP4qtYqvdqhNrYPdMAiONgozQzWPWdJUqF-0qhpB-0","pdfSize":"526554","objectId":"0x420946383583ac9d2fa5c9860c1f632a63283cd2b82966772e48598d35f68191","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
