{"id":"2407.06786","title":"A Back-End Electronics Based on Fiber Communication for Small to\n  Medium-Scale Physics Experiments","authors":"Jianguo Liu, Yu Wang, Changqing Feng, Shubin Liu, Qian Chen","authorsParsed":[["Liu","Jianguo",""],["Wang","Yu",""],["Feng","Changqing",""],["Liu","Shubin",""],["Chen","Qian",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 11:57:32 GMT"}],"updateDate":"2024-07-10","timestamp":1720526252000,"abstract":"  Many small and medium-sized physics experiments are being conducted\nworldwide. These experiments have similar requirements for readout electronics,\nespecially the back-end electronics. Some experiments need a trigger logic\nunit(TLU) to provide timing and synchronous control signals. This paper\nintroduces a back-end electronics design for small and medium-sized physics\nexperiments; it adopts a daughter-motherboard structure integrated TLU function\nto provide greater flexibility. Different interfaces and protocols can be\nflexibly selected according to data bandwidth requirements. It supports 32\noptical fiber interfaces based on a field-programmable gate array (FPGA) of\nnormal IOs with 400Mbps of data bandwidth for each channel. At the same time,\nit supports 16 high-speed communication interfaces based on GTX port with\nseveral Gbps data bandwidth of each channel. For the TLU function, this design\nhas 8 HDMI interfaces and one RJ45 interface to provide synchronous triggers\nand other control signals, and it has six analog LEMOs and four digital LEMOs\nto accept asynchronous signals from an external source. These design\nspecifications can meet the needs of most small and medium-sized experiments.\nThis set of back-end electronics has been successfully used in experiments such\nas PandaX-III, VLAST, and moungraphy. Moreover, it has successfully conducted\nbeam tests with a readout of the data of VLAST detectors at CERN.\n","subjects":["Physics/Instrumentation and Detectors"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}