{"id":"2407.16142","title":"Diffusion Models as Optimizers for Efficient Planning in Offline RL","authors":"Renming Huang, Yunqiang Pei, Guoqing Wang, Yangming Zhang, Yang Yang,\n  Peng Wang and Hengtao Shen","authorsParsed":[["Huang","Renming",""],["Pei","Yunqiang",""],["Wang","Guoqing",""],["Zhang","Yangming",""],["Yang","Yang",""],["Wang","Peng",""],["Shen","Hengtao",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 03:00:01 GMT"}],"updateDate":"2024-07-24","timestamp":1721703601000,"abstract":"  Diffusion models have shown strong competitiveness in offline reinforcement\nlearning tasks by formulating decision-making as sequential generation.\nHowever, the practicality of these methods is limited due to the lengthy\ninference processes they require. In this paper, we address this problem by\ndecomposing the sampling process of diffusion models into two decoupled\nsubprocesses: 1) generating a feasible trajectory, which is a time-consuming\nprocess, and 2) optimizing the trajectory. With this decomposition approach, we\nare able to partially separate efficiency and quality factors, enabling us to\nsimultaneously gain efficiency advantages and ensure quality assurance. We\npropose the Trajectory Diffuser, which utilizes a faster autoregressive model\nto handle the generation of feasible trajectories while retaining the\ntrajectory optimization process of diffusion models. This allows us to achieve\nmore efficient planning without sacrificing capability. To evaluate the\neffectiveness and efficiency of the Trajectory Diffuser, we conduct experiments\non the D4RL benchmarks. The results demonstrate that our method achieves $\\it\n3$-$\\it 10 \\times$ faster inference speed compared to previous sequence\nmodeling methods, while also outperforming them in terms of overall\nperformance. https://github.com/RenMing-Huang/TrajectoryDiffuser\n  Keywords: Reinforcement Learning and Efficient Planning and Diffusion Model\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}