{"id":"2407.15724","title":"Beyond Size and Class Balance: Alpha as a New Dataset Quality Metric for\n  Deep Learning","authors":"Josiah Couch, Rima Arnaout, Ramy Arnaout","authorsParsed":[["Couch","Josiah",""],["Arnaout","Rima",""],["Arnaout","Ramy",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:28:51 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 21:20:53 GMT"}],"updateDate":"2024-08-02","timestamp":1721662131000,"abstract":"  In deep learning, achieving high performance on image classification tasks\nrequires diverse training sets. However, the current best\npractice$\\unicode{x2013}$maximizing dataset size and class\nbalance$\\unicode{x2013}$does not guarantee dataset diversity. We hypothesized\nthat, for a given model architecture, model performance can be improved by\nmaximizing diversity more directly. To test this hypothesis, we introduce a\ncomprehensive framework of diversity measures from ecology that generalizes\nfamiliar quantities like Shannon entropy by accounting for similarities among\nimages. (Size and class balance emerge as special cases.) Analyzing thousands\nof subsets from seven medical datasets showed that the best correlates of\nperformance were not size or class balance but $A$$\\unicode{x2013}$\"big\nalpha\"$\\unicode{x2013}$a set of generalized entropy measures interpreted as the\neffective number of image-class pairs in the dataset, after accounting for\nimage similarities. One of these, $A_0$, explained 67% of the variance in\nbalanced accuracy, vs. 54% for class balance and just 39% for size. The best\npair of measures was size-plus-$A_1$ (79%), which outperformed\nsize-plus-class-balance (74%). Subsets with the largest $A_0$ performed up to\n16% better than those with the largest size (median improvement, 8%). We\npropose maximizing $A$ as a way to improve deep learning performance in medical\nimaging.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}