{"id":"2407.13718","title":"Characterizing hydrogel behavior under compression with gel-freezing\n  osmometry","authors":"Yanxia Feng and Dominic Gerber and Stefanie Heyden and Martin Kr\\\"oger\n  and Eric R. Dufresne and Lucio Isa and Robert W. Style","authorsParsed":[["Feng","Yanxia",""],["Gerber","Dominic",""],["Heyden","Stefanie",""],["Kröger","Martin",""],["Dufresne","Eric R.",""],["Isa","Lucio",""],["Style","Robert W.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:17:12 GMT"}],"updateDate":"2024-07-19","timestamp":1721323032000,"abstract":"  Hydrogels are particularly versatile materials that are widely found in both\nNature and industry. One key reason for this versatility is their high water\ncontent, which lets them dramatically change their volume and many of their\nmechanical properties -- often by orders of magnitude -- as they swell and dry\nout. Currently, we lack techniques that can precisely characterize how these\nproperties change with water content. To overcome this challenge, here we\ndevelop Gel-Freezing Osmometry (GelFrO): an extension of freezing-point\nosmometry. We show how GelFrO can measure a hydrogel's mechanical response to\ncompression and osmotic pressure, while only using small, $O(100\\mu$L$)$\nsamples. Because the technique allows measurement of properties over an\nunusually wide range of water contents, it allows us to accurately test\ntheoretical predictions. We find simple, power-law behavior for both mechanical\nresponse to compression, and osmotic pressure, while these are not\nwell-captured by classical Flory-Huggins theory. We interpret this power-law\nbehavior as a hallmark of a microscopic fractal structure of the gel's polymer\nnetwork, and propose a simple way to connect the gel's fractal dimension to its\nmechanical and osmotic properties. This connection is supported by observations\nof hydrogel microstructures using small-angle x-ray scattering. Finally, our\nresults motivate us to propose an updated constitutive model describing\nhydrogel swelling, and mechanical response.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}