{"id":"2407.19056","title":"OfficeBench: Benchmarking Language Agents across Multiple Applications\n  for Office Automation","authors":"Zilong Wang, Yuedong Cui, Li Zhong, Zimin Zhang, Da Yin, Bill Yuchen\n  Lin, Jingbo Shang","authorsParsed":[["Wang","Zilong",""],["Cui","Yuedong",""],["Zhong","Li",""],["Zhang","Zimin",""],["Yin","Da",""],["Lin","Bill Yuchen",""],["Shang","Jingbo",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 19:27:17 GMT"}],"updateDate":"2024-07-30","timestamp":1722022037000,"abstract":"  Office automation significantly enhances human productivity by automatically\nfinishing routine tasks in the workflow. Beyond the basic information\nextraction studied in much of the prior document AI literature, the office\nautomation research should be extended to more realistic office tasks which\nrequire to integrate various information sources in the office system and\nproduce outputs through a series of decision-making processes. We introduce\nOfficeBench, one of the first office automation benchmarks for evaluating\ncurrent LLM agents' capability to address office tasks in realistic office\nworkflows. OfficeBench requires LLM agents to perform feasible long-horizon\nplanning, proficiently switch between applications in a timely manner, and\naccurately ground their actions within a large combined action space, based on\nthe contextual demands of the workflow. Applying our customized evaluation\nmethods on each task, we find that GPT-4 Omni achieves the highest pass rate of\n47.00%, demonstrating a decent performance in handling office tasks. However,\nthis is still far below the human performance and accuracy standards required\nby real-world office workflows. We further observe that most issues are related\nto operation redundancy and hallucinations, as well as limitations in switching\nbetween multiple applications, which may provide valuable insights for\ndeveloping effective agent frameworks for office automation.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}