{"id":"2407.16143","title":"Hermitian and non-Hermitian topology in active matter","authors":"Kazuki Sone, Kazuki Yokomizo, Kyogo Kawaguchi, Yuto Ashida","authorsParsed":[["Sone","Kazuki",""],["Yokomizo","Kazuki",""],["Kawaguchi","Kyogo",""],["Ashida","Yuto",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 03:05:07 GMT"}],"updateDate":"2024-07-24","timestamp":1721703907000,"abstract":"  Self-propulsion is a quintessential aspect of biological systems, which can\ninduce nonequilibrium phenomena that have no counterparts in passive systems.\nMotivated by biophysical interest together with recent advances in experimental\ntechniques, active matter has been a rapidly developing field in physics.\nMeanwhile, over the past few decades, topology has played a crucial role to\nunderstand certain robust properties appearing in condensed matter systems. For\ninstance, the nontrivial topology of band structures leads to the notion of\ntopological insulators, where one can find robust gapless edge modes protected\nby the bulk band topology. We here review recent progress in an\ninterdisciplinary area of research at the intersection of these two fields.\nSpecifically, we give brief introductions to active matter and band topology in\nHermitian systems, and then explain how the notion of band topology can be\nextended to nonequilibrium (and thus non-Hermitian) systems including active\nmatter. We review recent studies that have demonstrated the intimate\nconnections between active matter and topological materials, where exotic\ntopological phenomena that are unfeasible in passive systems have been found. A\npossible extension of the band topology to nonlinear systems is also briefly\ndiscussed. Active matter can thus provide an ideal playground to explore\ntopological phenomena in qualitatively new realms beyond conservative linear\nsystems.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Statistical Mechanics","Physics/Biological Physics","Physics/Classical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}