{"id":"2407.08865","title":"Single-Image Shadow Removal Using Deep Learning: A Comprehensive Survey","authors":"Laniqng Guo, Chong Wang, Yufei Wang, Siyu Huang, Wenhan Yang, Alex C.\n  Kot, Bihan Wen","authorsParsed":[["Guo","Laniqng",""],["Wang","Chong",""],["Wang","Yufei",""],["Huang","Siyu",""],["Yang","Wenhan",""],["Kot","Alex C.",""],["Wen","Bihan",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 20:58:38 GMT"}],"updateDate":"2024-07-15","timestamp":1720731518000,"abstract":"  Shadow removal aims at restoring the image content within shadow regions,\npursuing a uniform distribution of illumination that is consistent between\nshadow and non-shadow regions. {Comparing to other image restoration tasks,\nthere are two unique challenges in shadow removal:} 1) The patterns of shadows\nare arbitrary, varied, and often have highly complex trace structures, making\n``trace-less'' image recovery difficult. 2) The degradation caused by shadows\nis spatially non-uniform, resulting in inconsistencies in illumination and\ncolor between shadow and non-shadow areas. Recent developments in this field\nare primarily driven by deep learning-based solutions, employing a variety of\nlearning strategies, network architectures, loss functions, and training data.\nNevertheless, a thorough and insightful review of deep learning-based shadow\nremoval techniques is still lacking. In this paper, we are the first to provide\na comprehensive survey to cover various aspects ranging from technical details\nto applications. We highlight the major advancements in deep learning-based\nsingle-image shadow removal methods, thoroughly review previous research across\nvarious categories, and provide insights into the historical progression of\nthese developments. Additionally, we summarize performance comparisons both\nquantitatively and qualitatively. Beyond the technical aspects of shadow\nremoval methods, we also explore potential future directions for this field.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}