{"id":"2407.02718","title":"Wave propagation through a spacetime containing thin concentric shells\n  of matter","authors":"Rub\\'en O. Acu\\~na-C\\'ardenas, Olivier Sarbach, Luca Tessieri","authorsParsed":[["Acuña-Cárdenas","Rubén O.",""],["Sarbach","Olivier",""],["Tessieri","Luca",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 23:57:26 GMT"}],"updateDate":"2024-07-04","timestamp":1719964646000,"abstract":"  We investigate the transmission of scalar, electromagnetic, and linearized\nodd-parity gravitational waves in a static spacetime characterized by a\nspherical distribution of matter in the form of thin concentric equidistant\nshells of equal mass. These shells connect Schwarzschild spacetimes of\ndifferent masses between themselves, and they satisfy the Israel junction\nconditions with a polytropic-type equation of state for the surface\nenergy-momentum tensor. We assume that the central region has zero mass, and we\nverify that the resulting spacetime is stable with respect to small\nperturbations of the shell radii as long as the gravitational field is\nsufficiently weak.\n  We focus on the transmission of monochromatic waves emitted from the center\nand propagating through a succession of $N$ shells. To this purpose, we neglect\nthe self-gravity of the waves and solve the Regge-Wheeler equation in the weak\nfield limit of the background field. Analytical expressions for the\ntransmission and reflection coefficients are obtained and their dependency on\nthe frequency, the number of shells and their mutual distance is analyzed. In\nparticular, in the high-frequency limit, we observe that the reflection\ncoefficient decays with the fourth power of the frequency. Increasing the\nnumber of shells initially produces oscillations in the transmission\ncoefficient; however, as $N$ grows, this coefficient rapidly stabilizes at a\nconstant positive value. We attribute this property to the fact that\nreflections are mainly determined by the surface density of the shells, which\ndecreases as the inverse square of their radii.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}