{"id":"2407.13014","title":"High-Contrast Imaging at First-Light of the GMT: The Preliminary Design\n  of GMagAO-X","authors":"Jared R. Males, Laird M. Close, Sebastiaan Y. Haffert, Maggie Y.\n  Kautz, Doug Kelly, Adam Fletcher, Thomas Salanski, Olivier Durney, Jamison\n  Noenickx, John Ford, Victor Gasho, Logan Pearce, Jay Kueny, Olivier Guyon,\n  Alycia Weinberger, Brendan Bowler, Adam Kraus, Natasha Batalha","authorsParsed":[["Males","Jared R.",""],["Close","Laird M.",""],["Haffert","Sebastiaan Y.",""],["Kautz","Maggie Y.",""],["Kelly","Doug",""],["Fletcher","Adam",""],["Salanski","Thomas",""],["Durney","Olivier",""],["Noenickx","Jamison",""],["Ford","John",""],["Gasho","Victor",""],["Pearce","Logan",""],["Kueny","Jay",""],["Guyon","Olivier",""],["Weinberger","Alycia",""],["Bowler","Brendan",""],["Kraus","Adam",""],["Batalha","Natasha",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 21:06:39 GMT"}],"updateDate":"2024-07-19","timestamp":1721250399000,"abstract":"  We present the preliminary design of GMagAO-X, the first-light high-contrast\nimager planned for the Giant Magellan Telescope. GMagAO-X will realize the\nrevolutionary increase in spatial resolution and sensitivity provided by the 25\nm GMT. It will enable, for the first time, the spectroscopic characterization\nof nearby potentially habitable terrestrial exoplanets orbiting late-type\nstars. Additional science cases include: reflected light characterization of\nmature giant planets; measurement of young extrasolar giant planet variability;\ncharacterization of circumstellar disks at unprecedented spatial resolution;\ncharacterization of benchmark stellar atmospheres at high spectral resolution;\nand mapping of resolved objects such as giant stars and asteroids. These, and\nmany more, science cases will be enabled by a 21,000 actuator extreme adaptive\noptics system, a coronagraphic wavefront control system, and a suite of imagers\nand spectrographs. We will review the science-driven performance requirements\nfor GMagAO-X, which include achieving a Strehl ratio of 70% at 800 nm on 8th\nmag and brighter stars, and post-processed characterization at astrophysical\nflux-ratios of 1e-7 at 4 lambda/D (26 mas at 800 nm) separation. We will\nprovide an overview of the resulting mechanical, optical, and software designs\noptimized to deliver this performance. We will also discuss the interfaces to\nthe GMT itself, and the concept of operations. We will present an overview of\nour end-to-end performance modeling and simulations, including the control of\nsegment phasing, as well as an overview of prototype lab demonstrations.\nFinally, we will review the results of Preliminary Design Review held in\nFebruary, 2024.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GJNoIUNx2MB3QGzH4AgoW1jYVjhADzcHyOS0RnN6wJc","pdfSize":"11495944","objectId":"0x24fb80c807e8d697d37db894cdad74cf3d16a0d0ee155a30d1064c6dff5dfc32","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
