{"id":"2407.08480","title":"Magic silicon dioxide for widely tunable integrated photonics","authors":"Bruno Lopez-Rodriguez, Naresh Sharma, Zizheng Li, Roald van der Kolk,\n  Jasper van der Boom, Thomas Scholte, Jin Chang, Simon Groblacher and Iman\n  Esmaeil Zadeh","authorsParsed":[["Lopez-Rodriguez","Bruno",""],["Sharma","Naresh",""],["Li","Zizheng",""],["van der Kolk","Roald",""],["van der Boom","Jasper",""],["Scholte","Thomas",""],["Chang","Jin",""],["Groblacher","Simon",""],["Zadeh","Iman Esmaeil",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 13:13:24 GMT"}],"updateDate":"2024-07-12","timestamp":1720703604000,"abstract":"  Integrated photonic circuits have transformed data communication, biosensing,\nand light detection and ranging, and hold wide-ranging potential for optical\ncomputing, optical imaging and signal processing. These applications often\nrequire tunable and reconfigurable photonic components, most commonly\naccomplished through the thermo-optic effect. However, the resulting tuning\nwindow is limited for standard optical materials such as silicon dioxide and\nsilicon nitride. Most importantly, bidirectional thermal tuning on a single\nplatform has not been realized. For the first time, we show that by tuning and\noptimizing the deposition conditions in inductively-coupled plasma chemical\nvapor deposition (ICPCVD) of silicon dioxide, this material can be used to\ndeterministically tune the thermo-optic properties of optical devices without\nintroducing significant losses. We demonstrate that we can deterministically\nintegrate positive and negative wavelength shifts on a single chip, validated\non amorphous silicon carbide (a-SiC), silicon nitride (SiN) and\nsilicon-on-insulator (SOI) platforms. We observe up to a 10-fold improvement of\nthe thermo-optic tunability and, in addition, demonstrate athermal ring\nresonators with shifts as low as 1.5 pm/{\\deg}C. This enables the fabrication\nof a novel tunable coupled ring optical waveguide (CROW) requiring only a\nsingle heater. In addition, the low-temperature deposition of our silicon\ndioxide cladding can be combined with lift-off to isolate the optical devices\nresulting in a decrease in thermal crosstalk by at least two orders of\nmagnitude. Our method paves the way for novel photonic architectures\nincorporating bidirectional thermo-optic tunability.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}