{"id":"2407.03090","title":"Simulating anharmonic crystals: Lights and shadows of first-principles\n  approaches","authors":"Lorenzo Monacelli","authorsParsed":[["Monacelli","Lorenzo",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 13:30:51 GMT"}],"updateDate":"2024-07-04","timestamp":1720013451000,"abstract":"  Understanding and simulating the thermodynamic and dynamical properties of\nmaterials affected by strong ionic anharmonicity is a central challenge in\nmaterial science. Two powerful methodologies have emerged as frontrunners in\nthis exploration: the Self-Consistent Harmonic Approximation (SCHA) with its\ncounterpart, Self-Consistent Phonons (SCP), and the Temperature-Dependent\nEffective Potential (TDEP). Despite their widespread use, the limitations of\nthese methods are often overlooked, and the absence of a formal derivation for\nthe TDEP has led to significant missteps that hamper its predictive accuracy.\n  Here, the theoretical foundations of both SCHA and TDEP are revised,\nunveiling their profound interconnection. This work introduces formal\nderivation for TDEP, dispelling misconceptions about how to improve its\naccuracy and refining best practices. The perturbative limit of these methods\nuncovers that both SCHA and TDEP fall short in reproducing the lowest-order\nperturbative free energy. While TDEP excels in providing an exact treatment of\nthe static susceptibility, its dynamical extension violates the perturbative\nregime by overcounting anharmonicity. Conversely, SCHA delivers an approximate\nstatic susceptibility but maintains correct static and dynamic response\nfunctions within the perturbative limit.\n  This work introduces a corrective strategy for TDEP's dynamical extension to\naddress these shortcomings. All the claims provided here are benchmarked\nagainst the exact (numerical) solution on a simple one-dimensional anharmonic\npotential.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Statistical Mechanics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}