{"id":"2407.19434","title":"FINER++: Building a Family of Variable-periodic Functions for Activating\n  Implicit Neural Representation","authors":"Hao Zhu, Zhen Liu, Qi Zhang, Jingde Fu, Weibing Deng, Zhan Ma, Yanwen\n  Guo, Xun Cao","authorsParsed":[["Zhu","Hao",""],["Liu","Zhen",""],["Zhang","Qi",""],["Fu","Jingde",""],["Deng","Weibing",""],["Ma","Zhan",""],["Guo","Yanwen",""],["Cao","Xun",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 09:24:57 GMT"}],"updateDate":"2024-07-30","timestamp":1722158697000,"abstract":"  Implicit Neural Representation (INR), which utilizes a neural network to map\ncoordinate inputs to corresponding attributes, is causing a revolution in the\nfield of signal processing. However, current INR techniques suffer from the\n\"frequency\"-specified spectral bias and capacity-convergence gap, resulting in\nimperfect performance when representing complex signals with multiple\n\"frequencies\". We have identified that both of these two characteristics could\nbe handled by increasing the utilization of definition domain in current\nactivation functions, for which we propose the FINER++ framework by extending\nexisting periodic/non-periodic activation functions to variable-periodic ones.\nBy initializing the bias of the neural network with different ranges,\nsub-functions with various frequencies in the variable-periodic function are\nselected for activation. Consequently, the supported frequency set can be\nflexibly tuned, leading to improved performance in signal representation. We\ndemonstrate the generalization and capabilities of FINER++ with different\nactivation function backbones (Sine, Gauss. and Wavelet) and various tasks (2D\nimage fitting, 3D signed distance field representation, 5D neural radiance\nfields optimization and streamable INR transmission), and we show that it\nimproves existing INRs. Project page: {https://liuzhen0212.github.io/finerpp/}\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}