{"id":"2407.16042","title":"Towards an effective two-orbital description of Nickelate physics","authors":"Alpesh Sheth, Claudine LaCroix, S\\'ebastien Burdin","authorsParsed":[["Sheth","Alpesh",""],["LaCroix","Claudine",""],["Burdin","Sébastien",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 20:38:35 GMT"}],"updateDate":"2024-07-24","timestamp":1721680715000,"abstract":"  Layered Nickelates have emerged as promising candidates for high-temperature\nsuperconductivity, drawing parallels to the well-studied Cuprates. This study\nprovides a robust theoretical framework to understand the electronic structure\nof these materials, particularly focusing on the role of effective orbitals and\nthe emergence of extra Fermi pocket. Using a multi-orbital model that takes\ninto account the essential symmetries and interactions of the involved orbitals\n($5d_{z^2}$, $3d_{z^2}$, $3d_{x^2-y^2}$, $2p_x$, $2p_y$, $2p_z$), we\ninvestigated the impact of the Nickel $3d_{z^2}$ orbital on the Fermi surface\nand the conditions that favor the emergence of a secondary Fermi surface\npocket. Our findings reveal that the $3d_{z^2}$ orbital, through its exchange\ninteractions with the rare-earth layer, can modify the Fermi surface, thus\nacting as a crucial element in the electronic structure. We develop an\neffective two-orbital model applicable to both $RNiO_3$ and $RNiO_2$ families,\nexplaining the sensitivity of the Fermi surface to apical Oxygen presence and\nhigh-pressure environments. This model captures the evolution of the Fermi\nsurface and predicts susceptibility features analogous to those observed in\nCuprate superconductors. We observe a peak in Lindhard susceptibility in these\nNickelate systems at wave vector $\\mathbf{q} = (\\pi, \\pi)$, similar to the\nCuprates. This peak can be tuned by pressure and doping.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}