{"id":"2407.21341","title":"High-throughput 3D shape completion of potato tubers on a harvester","authors":"Pieter M. Blok, Federico Magistri, Cyrill Stachniss, Haozhou Wang,\n  James Burridge, Wei Guo","authorsParsed":[["Blok","Pieter M.",""],["Magistri","Federico",""],["Stachniss","Cyrill",""],["Wang","Haozhou",""],["Burridge","James",""],["Guo","Wei",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 05:15:24 GMT"}],"updateDate":"2024-08-01","timestamp":1722402924000,"abstract":"  Potato yield is an important metric for farmers to further optimize their\ncultivation practices. Potato yield can be estimated on a harvester using an\nRGB-D camera that can estimate the three-dimensional (3D) volume of individual\npotato tubers. A challenge, however, is that the 3D shape derived from RGB-D\nimages is only partially completed, underestimating the actual volume. To\naddress this issue, we developed a 3D shape completion network, called CoRe++,\nwhich can complete the 3D shape from RGB-D images. CoRe++ is a deep learning\nnetwork that consists of a convolutional encoder and a decoder. The encoder\ncompresses RGB-D images into latent vectors that are used by the decoder to\ncomplete the 3D shape using the deep signed distance field network (DeepSDF).\nTo evaluate our CoRe++ network, we collected partial and complete 3D point\nclouds of 339 potato tubers on an operational harvester in Japan. On the 1425\nRGB-D images in the test set (representing 51 unique potato tubers), our\nnetwork achieved a completion accuracy of 2.8 mm on average. For volumetric\nestimation, the root mean squared error (RMSE) was 22.6 ml, and this was better\nthan the RMSE of the linear regression (31.1 ml) and the base model (36.9 ml).\nWe found that the RMSE can be further reduced to 18.2 ml when performing the 3D\nshape completion in the center of the RGB-D image. With an average 3D shape\ncompletion time of 10 milliseconds per tuber, we can conclude that CoRe++ is\nboth fast and accurate enough to be implemented on an operational harvester for\nhigh-throughput potato yield estimation. Our code, network weights and dataset\nare publicly available at\nhttps://github.com/UTokyo-FieldPhenomics-Lab/corepp.git.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"FDE8S7TBc_ssKLpmJFJuk1zpXxO8jl7QFr-Y9KYvY6U","pdfSize":"27262201"}
