{"id":"2407.16542","title":"Data-driven Koopman operator predictions of turbulent dynamics in models\n  of shear flows","authors":"C. Ricardo Constante-Amores, Andrew J. Fox, Carlos E. P\\'erez De\n  Jes\\'us and Michael D. Graham","authorsParsed":[["Constante-Amores","C. Ricardo",""],["Fox","Andrew J.",""],["De Jesús","Carlos E. Pérez",""],["Graham","Michael D.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:54:10 GMT"}],"updateDate":"2024-07-24","timestamp":1721746450000,"abstract":"  The Koopman operator enables the analysis of nonlinear dynamical systems\nthrough a linear perspective by describing time evolution in the\ninfinite-dimensional space of observables. Here this formalism is applied to\nshear flows, specifically the minimal flow unit plane Couette flow and a\nnine-dimensional model of turbulent shear flow between infinite parallel\nfree-slip walls under a sinusoidal body force (Moehlis et al., New J. Phys. 6,\n56 (2004)). We identify a finite set of observables and approximate the Koopman\noperator using neural networks, following the method developed by\nConstante-Amores et al., Chaos, 34(4), 043119 (2024). Then the time evolution\nis determined with a method here denoted as \"Projected Koopman Dynamics\". Using\na high-dimensional approximate Koopman operator directly for the plane Couette\nsystem is computationally infeasible due to the high state space dimension of\ndirect numerical simulations (DNS). However, the long-term dynamics of the\ndissipative Navier-Stokes equations are expected to live on a lower-dimensional\ninvariant manifold. Motivated by this fact, we perform dimension reduction on\nthe DNS data with a variant of the IRMAE-WD (implicit rank-minimizing\nautoencoder-weight decay) autoencoder (Zeng et al., MLST 5(2), 025053 (2024))\nbefore applying the Koopman approach. We compare the performance of data-driven\nstate space (neural ordinary differential equation) and Projected Koopman\nDynamics approaches in manifold coordinates for plane Couette flow. Projected\nKoopman Dynamics effectively captures the chaotic behavior of Couette flow and\nthe nine-dimensional model, excelling in both short-term tracking and long-term\nstatistical analysis, outperforming other frameworks applied to these shear\nflows.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"I0ce6vT621rLgxtyMoiTGiK6ooUvNm7S9d-ecnCmT8I","pdfSize":"6264538","objectId":"0x4841463358f1d907076c5dd838172b6df4d928c4f1eb65d63208f373798981d0","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
