{"id":"2407.16027","title":"Characterization of a modified clinical linear accelerator for\n  ultra-high dose rate electron beam delivery","authors":"Umberto Deut, Aurora Camperi, Cristiano Cavicchi, Roberto Cirio,\n  Emanuele Data, Elisabetta Durisi, Veronica Ferrero, Arianna Ferro, Simona\n  Giordanengo, Oscar A. Mart\\`i Villarreal, Felix Mas Milian, Elisabetta\n  Medina, Diango M. Montalvan Olivares, Franco Mostardi, Valeria Monti, Roberto\n  Sacchi, Edoardo Salmeri, Anna Vignati","authorsParsed":[["Deut","Umberto",""],["Camperi","Aurora",""],["Cavicchi","Cristiano",""],["Cirio","Roberto",""],["Data","Emanuele",""],["Durisi","Elisabetta",""],["Ferrero","Veronica",""],["Ferro","Arianna",""],["Giordanengo","Simona",""],["Villarreal","Oscar A. Martì",""],["Milian","Felix Mas",""],["Medina","Elisabetta",""],["Olivares","Diango M. Montalvan",""],["Mostardi","Franco",""],["Monti","Valeria",""],["Sacchi","Roberto",""],["Salmeri","Edoardo",""],["Vignati","Anna",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 20:07:22 GMT"}],"updateDate":"2024-07-24","timestamp":1721678842000,"abstract":"  Irradiations at Ultra High Dose Rate (UHDR) regimes, exceeding 40 Gy/s in\nsingle fractions lasting less than 200 ms, have shown an equivalent antitumor\neffect compared to conventional radio-therapy with reduced harm to normal\ntissues. This work details the hardware and software modi-fications implemented\nto deliver 10 MeV UHDR electron beams with a Linear Accelerator Elekta SL 18 MV\nand the beam characteristics obtained. GafChromic EBT XD films and an Advanced\nMarkus chamber were used for the dosimetry characterization, while a silicon\nsensor assessed the machine's beam pulses stability and repeatability. Dose per\npulse, average dose rate and instantaneous dose rate in the pulse were\nevaluated for four experimental settings, varying the source-to-surface\ndis-tance and the beam collimation, i.e. with and without the use of a\ncylindrical applicator. Results showed dose per pulse from 0.6 Gy to a few tens\nof Gy and average dose rate up to 300 Gy/s. The obtained results demonstrate\nthe possibility to perform in-vitro radiobiology experiments and test of new\ntechnologies for beam monitoring and dosimetry at the upgraded LINAC, thus\ncontributing to the electron UHDR research field.\n","subjects":["Physics/Medical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}