{"id":"2407.05131","title":"RULE: Reliable Multimodal RAG for Factuality in Medical Vision Language\n  Models","authors":"Peng Xia and Kangyu Zhu and Haoran Li and Hongtu Zhu and Yun Li and\n  Gang Li and Linjun Zhang and Huaxiu Yao","authorsParsed":[["Xia","Peng",""],["Zhu","Kangyu",""],["Li","Haoran",""],["Zhu","Hongtu",""],["Li","Yun",""],["Li","Gang",""],["Zhang","Linjun",""],["Yao","Huaxiu",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 16:45:07 GMT"}],"updateDate":"2024-07-09","timestamp":1720284307000,"abstract":"  The recent emergence of Medical Large Vision Language Models (Med-LVLMs) has\nenhanced medical diagnosis. However, current Med-LVLMs frequently encounter\nfactual issues, often generating responses that do not align with established\nmedical facts. Retrieval-Augmented Generation (RAG), which utilizes external\nknowledge, can improve the factual accuracy of these models but introduces two\nmajor challenges. First, limited retrieved contexts might not cover all\nnecessary information, while excessive retrieval can introduce irrelevant and\ninaccurate references, interfering with the model's generation. Second, in\ncases where the model originally responds correctly, applying RAG can lead to\nan over-reliance on retrieved contexts, resulting in incorrect answers. To\naddress these issues, we propose RULE, which consists of two components. First,\nwe introduce a provably effective strategy for controlling factuality risk\nthrough the calibrated selection of the number of retrieved contexts. Second,\nbased on samples where over-reliance on retrieved contexts led to errors, we\ncurate a preference dataset to fine-tune the model, balancing its dependence on\ninherent knowledge and retrieved contexts for generation. We demonstrate the\neffectiveness of RULE on three medical VQA datasets, achieving an average\nimprovement of 20.8% in factual accuracy. We publicly release our benchmark and\ncode in https://github.com/richard-peng-xia/RULE.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}