{"id":"2407.21586","title":"Adaptive Mix for Semi-Supervised Medical Image Segmentation","authors":"Zhiqiang Shen, Peng Cao, Junming Su, Jinzhu Yang, Osmar R. Zaiane","authorsParsed":[["Shen","Zhiqiang",""],["Cao","Peng",""],["Su","Junming",""],["Yang","Jinzhu",""],["Zaiane","Osmar R.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 13:19:39 GMT"}],"updateDate":"2024-08-01","timestamp":1722431979000,"abstract":"  Mix-up is a key technique for consistency regularization-based\nsemi-supervised learning methods, generating strong-perturbed samples for\nstrong-weak pseudo-supervision. Existing mix-up operations are performed either\nrandomly or with predefined rules, such as replacing low-confidence patches\nwith high-confidence ones. The former lacks control over the perturbation\ndegree, leading to overfitting on randomly perturbed samples, while the latter\ntends to generate images with trivial perturbations, both of which limit the\neffectiveness of consistency learning. This paper aims to answer the following\nquestion: How can image mix-up perturbation be adaptively performed during\ntraining? To this end, we propose an Adaptive Mix algorithm (AdaMix) for image\nmix-up in a self-paced learning manner. Given that, in general, a model's\nperformance gradually improves during training, AdaMix is equipped with a\nself-paced curriculum that, in the initial training stage, provides relatively\nsimple perturbed samples and then gradually increases the difficulty of\nperturbed images by adaptively controlling the perturbation degree based on the\nmodel's learning state estimated by a self-paced regularize. We develop three\nframeworks with our AdaMix, i.e., AdaMix-ST, AdaMix-MT, and AdaMix-CT, for\nsemi-supervised medical image segmentation. Extensive experiments on three\npublic datasets, including both 2D and 3D modalities, show that the proposed\nframeworks are capable of achieving superior performance. For example, compared\nwith the state-of-the-art, AdaMix-CT achieves relative improvements of 2.62% in\nDice and 48.25% in average surface distance on the ACDC dataset with 10%\nlabeled data. The results demonstrate that mix-up operations with dynamically\nadjusted perturbation strength based on the segmentation model's state can\nsignificantly enhance the effectiveness of consistency regularization.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}