{"id":"2407.20969","title":"Distributed Symmetric Key Establishment: a Scalable Quantum-Safe Key\n  Distribution Protocol","authors":"Jie Lin (1 and 2), Hoi-Kwong Lo (1 and 2), Jacob Johannsson (1 and 2),\n  Mattia Montagna (1), Manfred von Willich (1) ((1) Quantum Bridge Technologies\n  Inc., (2) Department of Electrical and Computer Engineering, University of\n  Toronto)","authorsParsed":[["Lin","Jie","","1 and 2"],["Lo","Hoi-Kwong","","1 and 2"],["Johannsson","Jacob","","1 and 2"],["Montagna","Mattia",""],["von Willich","Manfred",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 16:55:17 GMT"}],"updateDate":"2024-07-31","timestamp":1722358517000,"abstract":"  Pre-shared keys (PSK) have been widely used in network security. Nonetheless,\nexisting PSK solutions are not scalable. Moreover, whenever a new user joins a\nnetwork, PSK requires an existing user to get a new key before they are able to\ncommunicate with the new user. The key issue is how to distribute the PSK\nbetween different users. Here, we solve this problem by proposing a new\nprotocol called Distributed Symmetric Key Establishment (DSKE). DSKE has the\nadvantage of being scalable. Unlike standard public key infrastructure (PKI)\nwhich relies on computational assumptions, DSKE provides information-theoretic\nsecurity in a universally composable security framework. Specifically, we prove\nthe security (correctness and confidentiality) and robustness of this protocol\nagainst a computationally unbounded adversary, who additionally may have fully\ncompromised a bounded number of the intermediaries and can eavesdrop on all\ncommunication. DSKE also achieves distributed trust through secret sharing.\n  We present several implementations of DSKE in real environments, such as\nproviding client services to link encryptors, network encryptors, and mobile\nphones, as well as the implementation of intermediaries, called Security Hubs,\nand associated test data as evidence for its versatility. As DSKE is highly\nscalable in a network setting with no distance limit, it is expected to be a\ncost-effective quantum-safe cryptographic solution to the network security\nthreat presented by quantum computers.\n","subjects":["Computing Research Repository/Cryptography and Security","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}