{"id":"2407.03676","title":"Out-of-Plane Polarization from Spin Reflection Induces Field-Free\n  Spin-Orbit Torque Switching in Structures with Canted NiO Interfacial Moments","authors":"Zhe Zhang, Zhuoyi Li, Yuzhe Chen, Fangyuan Zhu, Yu Yan, Yao Li, Liang\n  He, Jun Du, Rong Zhang, Jing Wu, Xianyang Lu, Yongbing Xu","authorsParsed":[["Zhang","Zhe",""],["Li","Zhuoyi",""],["Chen","Yuzhe",""],["Zhu","Fangyuan",""],["Yan","Yu",""],["Li","Yao",""],["He","Liang",""],["Du","Jun",""],["Zhang","Rong",""],["Wu","Jing",""],["Lu","Xianyang",""],["Xu","Yongbing",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 06:46:35 GMT"}],"updateDate":"2024-07-08","timestamp":1720075595000,"abstract":"  Realizing deterministic current-induced spin-orbit torque (SOT) magnetization\nswitching, especially in systems exhibiting perpendicular magnetic anisotropy\n(PMA), typically requires the application of a collinear in-plane field, posing\na challenging problem. In this study, we successfully achieve field-free SOT\nswitching in the CoFeB/MgO system. In a Ta/CoFeB/MgO/NiO/Ta structure, spin\nreflection at the NiO interface, characterized by noncollinear spin structures\nwith canted magnetization, generates a spin current with an out-of-plane spin\npolarization {\\sigma}z. We confirm the contribution of {\\sigma}z to the\nfield-free SOT switching through measurements of the shift effect in the\nout-of-plane magnetization hysteresis loops under different currents. The\nincorporation of NiO as an antiferromagnetic insulator, mitigates the current\nshunting effect and ensures excellent thermal stability of the device. The\nsample with 0.8 nm MgO and 2 nm NiO demonstrates an impressive optimal\nswitching ratio approaching 100% without an in-plane field. This breakthrough\nin the CoFeB/MgO system promises significant applications in spintronics,\nadvancing us closer to realizing innovative technologies.\n","subjects":["Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}