{"id":"2407.00201","title":"Deconvolving Complex Neuronal Networks into Interpretable Task-Specific\n  Connectomes","authors":"Yifan Wang and Vikram Ravindra and Ananth Grama","authorsParsed":[["Wang","Yifan",""],["Ravindra","Vikram",""],["Grama","Ananth",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 19:13:48 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 15:37:54 GMT"}],"updateDate":"2024-07-04","timestamp":1719602028000,"abstract":"  Task-specific functional MRI (fMRI) images provide excellent modalities for\nstudying the neuronal basis of cognitive processes. We use fMRI data to\nformulate and solve the problem of deconvolving task-specific aggregate\nneuronal networks into a set of basic building blocks called canonical\nnetworks, to use these networks for functional characterization, and to\ncharacterize the physiological basis of these responses by mapping them to\nregions of the brain. Our results show excellent task-specificity of canonical\nnetworks, i.e., the expression of a small number of canonical networks can be\nused to accurately predict tasks; generalizability across cohorts, i.e.,\ncanonical networks are conserved across diverse populations, studies, and\nacquisition protocols; and that canonical networks have strong anatomical and\nphysiological basis. From a methods perspective, the problem of identifying\nthese canonical networks poses challenges rooted in the high dimensionality,\nsmall sample size, acquisition variability, and noise. Our deconvolution\ntechnique is based on non-negative matrix factorization (NMF) that identifies\ncanonical networks as factors of a suitably constructed matrix. We demonstrate\nthat our method scales to large datasets, yields stable and accurate factors,\nand is robust to noise.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OsyQAd29UYByLOIfdXXb1o-A3ScIp1wMhMsdInjQPaA","pdfSize":"4588339"}
