{"id":"2407.08592","title":"Multi-Threshold AoII-Optimum Sampling Policies for CTMC Information\n  Sources","authors":"Ismail Cosandal, Nail Akar, Sennur Ulukus","authorsParsed":[["Cosandal","Ismail",""],["Akar","Nail",""],["Ulukus","Sennur",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 15:15:15 GMT"}],"updateDate":"2024-07-12","timestamp":1720710915000,"abstract":"  We study push-based sampling and transmission policies for a status update\nsystem consisting of a general finite-state continuous-time Markov chain (CTMC)\ninformation source with known dynamics, with the goal of minimizing the average\nage of incorrect information (AoII). The problem setting we investigate\ninvolves an exponentially distributed delay channel for transmissions and a\nconstraint on the average sampling rate. We first show that the optimum\nsampling and transmission policy is a 'multi-threshold policy', where the\nthresholds depend on both the estimation value and the state of the original\nprocess, and sampling and transmission need to be initiated when the\ninstantaneous AoII exceeds the corresponding threshold, called the estimation-\nand state-aware transmission (ESAT) policy. Subsequently, we formulate the\nproblem of finding the thresholds as a constrained semi-Markov decision process\n(CSMDP) and the Lagrangian approach. Additionally, we propose two lower\ncomplexity sub-optimum policies, namely the estimation-aware transmission (EAT)\npolicy, and the single-threshold (ST) policy, for which it is possible to\nobtain these thresholds for CTMCs with relatively larger number of states. The\nunderlying CSMDP formulation relies on the 'multi-regime phase-type' (MRPH)\ndistribution which is a generalization of the well-known phase-type\ndistribution, which allows us to obtain the distribution of time until\nabsorption in a CTMC whose transition rates change with respect to time in a\npiece-wise manner. The effectiveness of the proposed ESAT, EAT and ST sampling\nand transmission policies are shown through numerical examples, along with\ncomparisons with a baseline scheme that transmits packets according to a\nPoisson process in out-of-sync periods.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Signal Processing","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}