{"id":"2407.01626","title":"SPARKLE: Enhancing SPARQL Generation with Direct KG Integration in\n  Decoding","authors":"Jaebok Lee and Hyeonjeong Shin","authorsParsed":[["Lee","Jaebok",""],["Shin","Hyeonjeong",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 06:43:11 GMT"}],"updateDate":"2024-07-03","timestamp":1719643391000,"abstract":"  Existing KBQA methods have traditionally relied on multi-stage methodologies,\ninvolving tasks such as entity linking, subgraph retrieval and query structure\ngeneration. However, multi-stage approaches are dependent on the accuracy of\npreceding steps, leading to cascading errors and increased inference time.\nAlthough a few studies have explored the use of end-to-end models, they often\nsuffer from lower accuracy and generate inoperative query that is not supported\nby the underlying data. Furthermore, most prior approaches are limited to the\nstatic training data, potentially overlooking the evolving nature of knowledge\nbases over time. To address these challenges, we present a novel end-to-end\nnatural language to SPARQL framework, SPARKLE. Notably SPARKLE leverages the\nstructure of knowledge base directly during the decoding, effectively\nintegrating knowledge into the query generation. Our study reveals that simply\nreferencing knowledge base during inference significantly reduces the\noccurrence of inexecutable query generations. SPARKLE achieves new\nstate-of-the-art results on SimpleQuestions-Wiki and highest F1 score on LCQuAD\n1.0 (among models not using gold entities), while getting slightly lower result\non the WebQSP dataset. Finally, we demonstrate SPARKLE's fast inference speed\nand its ability to adapt when the knowledge base differs between the training\nand inference stages.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}