{"id":"2407.18304","title":"A novel numerical method for mixed-frame multigroup\n  radiation-hydrodynamics with GPU acceleration implemented in the QUOKKA code","authors":"Chong-Chong He (ANU), Benjamin D. Wibking (MSU), Mark R. Krumholz\n  (ANU)","authorsParsed":[["He","Chong-Chong","","ANU"],["Wibking","Benjamin D.","","MSU"],["Krumholz","Mark R.","","ANU"]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-29","timestamp":1721930403000,"abstract":"  Mixed-frame formulations of radiation-hydrodynamics (RHD), where the\nradiation quantities are computed in an inertial frame but matter quantities\nare in a comoving frame, are advantageous because they admit algorithms that\nconserve energy and momentum to machine precision and combine more naturally\nwith adaptive mesh techniques, since unlike pure comoving-frame methods they do\nnot face the problem that radiation quantities must change frame every time a\ncell is refined or coarsened. However, implementing multigroup RHD in a\nmixed-frame formulation presents challenges due to the complexity of handling\nfrequency-dependent interactions and the Doppler shift of radiation boundaries.\nIn this paper, we introduce a novel method for multigroup RHD that integrates a\nmixed-frame formulation with a piecewise powerlaw approximation for frequency\ndependence within groups. This approach ensures the exact conservation of total\nenergy and momentum while effectively managing the Lorentz transformation of\ngroup boundaries and evaluation of group-averaged opacities. Our method takes\nadvantage of the locality of matter-radiation coupling, allowing the source\nterm for $N_g$ frequency groups to be handled with simple equations with a\nsparse Jacobian matrix of size $N_g + 1$, which can be inverted with $O(N_g)$\ncomplexity. This results in a computational complexity that scales linearly\nwith $N_g$ and requires no more communication than a pure hydrodynamics update,\nmaking it highly efficient for massively parallel and GPU-based systems. We\nimplement our method in the GPU-accelerated RHD code QUOKKA and demonstrate\nthat it passes a wide range of numerical tests. We demonstrate that the\npiecewise powerlaw method shows significant advantages over traditional opacity\naveraging methods for handling rapidly variable opacities with modest frequency\nresolution.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Plasma Physics","Physics/Space Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}