{"id":"2407.06527","title":"Low-dose, high-resolution CT of infant-sized lungs via propagation-based\n  phase contrast","authors":"James A. Pollock, Kaye Morgan, Linda C. P. Croton, Emily J. Pryor,\n  Kelly J. Crossley, Christopher J. Hall, Daniel Hausermann, Anton Maksimenko,\n  Stuart B. Hooper, Marcus J. Kitchen","authorsParsed":[["Pollock","James A.",""],["Morgan","Kaye",""],["Croton","Linda C. P.",""],["Pryor","Emily J.",""],["Crossley","Kelly J.",""],["Hall","Christopher J.",""],["Hausermann","Daniel",""],["Maksimenko","Anton",""],["Hooper","Stuart B.",""],["Kitchen","Marcus J.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 03:54:10 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 04:48:36 GMT"}],"updateDate":"2024-07-24","timestamp":1720497250000,"abstract":"  Many lung diseases require detailed visualisation for accurate diagnosis and\ntreatment. High-resolution computed tomography (CT) is the gold-standard\ntechnique for non-invasive lung disease detection, but it presents a risk to\nthe patient through the relatively high ionising radiation dose required.\nUtilising the X-ray phase information may allow improvements in image\nresolution at equal or lower radiation levels than current clinical imaging.\nPropagation-based phase-contrast imaging requires minimal adaption of existing\nmedical systems, and is well suited to lung imaging due to the strong phase\ngradients introduced by the lung-air material interfaces. Herein,\npropagation-based phase contrast CT is demonstrated for large animals, namely\nlambs, as a model for paediatric patients, using monochromatic radiation and a\nphoton-counting detector at the Imaging and Medical Beamline of the Australian\nSynchrotron. Image quality, normalised against radiation dose, was optimised as\na function of the beam energy and propagation distance, with the optimal\nconditions used to test the available image quality at very low radiation dose.\nThe resulting CT images demonstrate superior resolution to existing\nhigh-resolution CT systems, pushing dose to the quantum limit to comply with\ncurrent Australian guidelines for infant chest CT exposure of\n$<2.5\\:\\text{mSv}$ effective dose. Constituent raw projections are shown to\nhave significant proportions of pixels with zero photon counts that would\ncreate severe information loss in conventional CT. Phase retrieval enabled\nclear visualisation of minor lung airways at doses up to 1,225$\\pm$31\\% times\nlower than conventional CT reconstruction, at a voxel size of just\n75$\\mathrm{\\mu}$m.\n","subjects":["Physics/Medical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}