{"id":"2407.16773","title":"Fading ergodicity","authors":"Maksymilian Kliczkowski, Rafa{\\l} \\'Swi\\k{e}tek, Miroslav Hopjan, Lev\n  Vidmar","authorsParsed":[["Kliczkowski","Maksymilian",""],["Świętek","Rafał",""],["Hopjan","Miroslav",""],["Vidmar","Lev",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 18:12:29 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 12:56:23 GMT"}],"updateDate":"2024-08-06","timestamp":1721758349000,"abstract":"  Eigenstate thermalization hypothesis (ETH) represents a breakthrough in\nmany-body physics since it allows to link thermalization of physical\nobservables with the applicability of random matrix theory (RMT). Recent years\nwere also extremely fruitful in exploring possible counterexamples to\nthermalization, ranging, among others, from integrability, single-particle\nchaos, many-body localization, many-body scars, to Hilbert-space fragmentation.\nIn all these cases the conventional ETH is violated. However, it remains\nelusive how the conventional ETH breaks down when one approaches the boundaries\nof ergodicity, and whether the range of validity of the conventional ETH\ncoincides with the validity of RMT-like spectral statistics. Here we bridge\nthis gap and we introduce a scenario of the ETH breakdown in many-body quantum\nsystems, dubbed fading ergodicity regime, which establishes a link between the\nconventional ETH and non-ergodic behavior. We conjecture this scenario to be\nrelevant for the description of finite many-body systems at the boundaries of\nergodicity, and we provide numerical and analytical arguments for its validity\nin the quantum sun model of ergodicity breaking phase transition. For the\nlatter, we provide evidence that the breakdown of the conventional ETH is not\nassociated with the breakdown of the RMT-like spectral statistics.\n","subjects":["Condensed Matter/Statistical Mechanics","Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Strongly Correlated Electrons","Physics/High Energy Physics - Theory","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}