{"id":"2407.11199","title":"Algorithms for College Admissions Decision Support: Impacts of Policy\n  Change and Inherent Variability","authors":"Jinsook Lee, Emma Harvey, Joyce Zhou, Nikhil Garg, Thorsten Joachims,\n  Rene F. Kizilcec","authorsParsed":[["Lee","Jinsook",""],["Harvey","Emma",""],["Zhou","Joyce",""],["Garg","Nikhil",""],["Joachims","Thorsten",""],["Kizilcec","Rene F.",""]],"versions":[{"version":"v1","created":"Mon, 24 Jun 2024 14:59:30 GMT"}],"updateDate":"2024-07-17","timestamp":1719241170000,"abstract":"  Each year, selective American colleges sort through tens of thousands of\napplications to identify a first-year class that displays both academic merit\nand diversity. In the 2023-2024 admissions cycle, these colleges faced\nunprecedented challenges. First, the number of applications has been steadily\ngrowing. Second, test-optional policies that have remained in place since the\nCOVID-19 pandemic limit access to key information historically predictive of\nacademic success. Most recently, longstanding debates over affirmative action\nculminated in the Supreme Court banning race-conscious admissions. Colleges\nhave explored machine learning (ML) models to address the issues of scale and\nmissing test scores, often via ranking algorithms intended to focus on 'top'\napplicants. However, the Court's ruling will force changes to these models,\nwhich were able to consider race as a factor in ranking. There is currently a\npoor understanding of how these mandated changes will shape applicant ranking\nalgorithms, and, by extension, admitted classes. We seek to address this by\nquantifying the impact of different admission policies on the applications\nprioritized for review. We show that removing race data from a developed\napplicant ranking algorithm reduces the diversity of the top-ranked pool\nwithout meaningfully increasing the academic merit of that pool. We\ncontextualize this impact by showing that excluding data on applicant race has\na greater impact than excluding other potentially informative variables like\nintended majors. Finally, we measure the impact of policy change on individuals\nby comparing the arbitrariness in applicant rank attributable to policy change\nto the arbitrariness attributable to randomness. We find that any given policy\nhas a high degree of arbitrariness and that removing race data from the ranking\nalgorithm increases arbitrariness in outcomes for most applicants.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"faBIQCbbv0MPhcNzfOOAWWQbJaGR7X051yb5ZZdPNGU","pdfSize":"1126567","objectId":"0x9a1aa27e79b46f7d01836e98c721d4f869c36043d7e331bfb5a37af50728a705","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
