{"id":"2407.17187","title":"Two black widow pulsars in the optical and X-rays","authors":"A.V. Bobakov, A. Yu. Kirichenko, S. V. Zharikov, A. V. Karpova, D. A.\n  Zyuzin, Yu. A. Shibanov, R. E. Mennickent and D. Garcia-\\'Alvarez","authorsParsed":[["Bobakov","A. V.",""],["Kirichenko","A. Yu.",""],["Zharikov","S. V.",""],["Karpova","A. V.",""],["Zyuzin","D. A.",""],["Shibanov","Yu. A.",""],["Mennickent","R. E.",""],["Garcia-Álvarez","D.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 11:45:10 GMT"}],"updateDate":"2024-07-25","timestamp":1721821510000,"abstract":"  Context. Two millisecond pulsars, PSR J1513$-$2550 and PSR J2017$-$1614, with\nspin periods of about 2.1 and 2.3 ms were recently discovered in the radio and\n$\\gamma$-rays and classified as black widow pulsars in tight binary stellar\nsystems with orbital periods of about 4.3 and 2.3 h. Aims. Our goals are to\nreveal fundamental parameters of both systems and their binary components using\nmulti-wavelength observations. Methods. We carried out the first time-series\nmulti-band optical photometry of the objects with the 2.1-metre telescope of\nthe Observatorio Astron\\'omico Nacional San Pedro M\\'artir, the 6.5-metre\n\\magel-1 telescope, and the 10.4-metre Gran Telescopio Canarias. To derive the\nparameters of both systems, we fitted the obtained light curves with a model\nassuming heating of the companion by the pulsar. We also analysed archival\nX-ray data obtained with the XMM-Newton observatory. Results. For the first\ntime, we firmly identified J1513$-$2550 in the optical and both pulsars in\nX-rays. The optical light curves of both systems have a single peak per orbital\nperiod with peak-to-peak amplitude of $\\gtrsim2$ magnitudes. The J2017$-$1614\nlight curves are symmetric, while J1513$-$2550 demonstrates strong asymmetry\nwhose nature remains unclear. Conclusions. We constrained the orbital\ninclinations, pulsar masses, companion temperatures and masses, as well as the\ndistances to both systems. We also conclude that J2017$-$1614 may contain a\nmassive neutron star of 2.4$\\pm$0.6 M$_{\\odot}$. The X-ray spectra of both\nsources can be fitted by power laws with parameters typical for black widow\nsystems.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}