{"id":"2407.09162","title":"Exploring State Space and Reasoning by Elimination in Tsetlin Machines","authors":"Ahmed K. Kadhim, Ole-Christoffer Granmo, Lei Jiao, Rishad Shafik","authorsParsed":[["Kadhim","Ahmed K.",""],["Granmo","Ole-Christoffer",""],["Jiao","Lei",""],["Shafik","Rishad",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 10:58:01 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 09:42:34 GMT"}],"updateDate":"2024-07-18","timestamp":1720781881000,"abstract":"  The Tsetlin Machine (TM) has gained significant attention in Machine Learning\n(ML). By employing logical fundamentals, it facilitates pattern learning and\nrepresentation, offering an alternative approach for developing comprehensible\nArtificial Intelligence (AI) with a specific focus on pattern classification in\nthe form of conjunctive clauses. In the domain of Natural Language Processing\n(NLP), TM is utilised to construct word embedding and describe target words\nusing clauses. To enhance the descriptive capacity of these clauses, we study\nthe concept of Reasoning by Elimination (RbE) in clauses' formulation, which\ninvolves incorporating feature negations to provide a more comprehensive\nrepresentation. In more detail, this paper employs the Tsetlin Machine\nAuto-Encoder (TM-AE) architecture to generate dense word vectors, aiming at\ncapturing contextual information by extracting feature-dense vectors for a\ngiven vocabulary. Thereafter, the principle of RbE is explored to improve\ndescriptivity and optimise the performance of the TM. Specifically, the\nspecificity parameter s and the voting margin parameter T are leveraged to\nregulate feature distribution in the state space, resulting in a dense\nrepresentation of information for each clause. In addition, we investigate the\nstate spaces of TM-AE, especially for the forgotten/excluded features.\nEmpirical investigations on artificially generated data, the IMDB dataset, and\nthe 20 Newsgroups dataset showcase the robustness of the TM, with accuracy\nreaching 90.62\\% for the IMDB.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}