{"id":"2407.05619","title":"AIRA: A Low-cost IR-based Approach Towards Autonomous Precision Drone\n  Landing and NLOS Indoor Navigation","authors":"Yanchen Liu, Minghui Zhao, Kaiyuan Hou, Junxi Xia, Charlie Carver,\n  Stephen Xia, Xia Zhou and Xiaofan Jiang","authorsParsed":[["Liu","Yanchen",""],["Zhao","Minghui",""],["Hou","Kaiyuan",""],["Xia","Junxi",""],["Carver","Charlie",""],["Xia","Stephen",""],["Zhou","Xia",""],["Jiang","Xiaofan",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 05:15:33 GMT"}],"updateDate":"2024-07-09","timestamp":1720415733000,"abstract":"  Automatic drone landing is an important step for achieving fully autonomous\ndrones. Although there are many works that leverage GPS, video, wireless\nsignals, and active acoustic sensing to perform precise landing, autonomous\ndrone landing remains an unsolved challenge for palm-sized microdrones that may\nnot be able to support the high computational requirements of vision, wireless,\nor active audio sensing. We propose AIRA, a low-cost infrared light-based\nplatform that targets precise and efficient landing of low-resource\nmicrodrones. AIRA consists of an infrared light bulb at the landing station\nalong with an energy efficient hardware photodiode (PD) sensing platform at the\nbottom of the drone. AIRA costs under 83 USD, while achieving comparable\nperformance to existing vision-based methods at a fraction of the energy cost.\nAIRA requires only three PDs without any complex pattern recognition models to\naccurately land the drone, under $10$cm of error, from up to $11.1$ meters\naway, compared to camera-based methods that require recognizing complex markers\nusing high resolution images with a range of only up to $1.2$ meters from the\nsame height. Moreover, we demonstrate that AIRA can accurately guide drones in\nlow light and partial non line of sight scenarios, which are difficult for\ntraditional vision-based approaches.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}