{"id":"2407.01260","title":"DeepiSign-G: Generic Watermark to Stamp Hidden DNN Parameters for\n  Self-contained Tracking","authors":"Alsharif Abuadbba, Nicholas Rhodes, Kristen Moore, Bushra Sabir, Shuo\n  Wang, Yansong Gao","authorsParsed":[["Abuadbba","Alsharif",""],["Rhodes","Nicholas",""],["Moore","Kristen",""],["Sabir","Bushra",""],["Wang","Shuo",""],["Gao","Yansong",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:15:38 GMT"}],"updateDate":"2024-07-02","timestamp":1719839738000,"abstract":"  Deep learning solutions in critical domains like autonomous vehicles, facial\nrecognition, and sentiment analysis require caution due to the severe\nconsequences of errors. Research shows these models are vulnerable to\nadversarial attacks, such as data poisoning and neural trojaning, which can\ncovertly manipulate model behavior, compromising reliability and safety.\nCurrent defense strategies like watermarking have limitations: they fail to\ndetect all model modifications and primarily focus on attacks on CNNs in the\nimage domain, neglecting other critical architectures like RNNs.\n  To address these gaps, we introduce DeepiSign-G, a versatile watermarking\napproach designed for comprehensive verification of leading DNN architectures,\nincluding CNNs and RNNs. DeepiSign-G enhances model security by embedding an\ninvisible watermark within the Walsh-Hadamard transform coefficients of the\nmodel's parameters. This watermark is highly sensitive and fragile, ensuring\nprompt detection of any modifications. Unlike traditional hashing techniques,\nDeepiSign-G allows substantial metadata incorporation directly within the\nmodel, enabling detailed, self-contained tracking and verification.\n  We demonstrate DeepiSign-G's applicability across various architectures,\nincluding CNN models (VGG, ResNets, DenseNet) and RNNs (Text sentiment\nclassifier). We experiment with four popular datasets: VGG Face, CIFAR10, GTSRB\nTraffic Sign, and Large Movie Review. We also evaluate DeepiSign-G under five\npotential attacks. Our comprehensive evaluation confirms that DeepiSign-G\neffectively detects these attacks without compromising CNN and RNN model\nperformance, highlighting its efficacy as a robust security measure for deep\nlearning applications. Detection of integrity breaches is nearly perfect, while\nhiding only a bit in approximately 1% of the Walsh-Hadamard coefficients.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}