{"id":"2407.04096","title":"Strong nebular emissions associated with MgII absorptions detected in\n  the SDSS spectra of background quasars","authors":"Labanya Kumar Guha, Raghunathan Srianand","authorsParsed":[["Guha","Labanya Kumar",""],["Srianand","Raghunathan",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 18:00:08 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 11:33:14 GMT"}],"updateDate":"2024-07-25","timestamp":1720116008000,"abstract":"  We present long-slit spectroscopic observations of 40 Galaxy On Top Of\nQuasars (GOTOQs) at ${0.37 \\leqslant z \\leqslant 1.01}$ using the South African\nLarge Telescope. Using this and available photometric data, we measure the\nimpact parameters of the foreground galaxies to be in the range of 3$-$16 kpc\nwith a median value of 8.6 kpc. This is the largest sample of galaxies\nproducing MgII absorption at such low impact parameters. These quasar-galaxy\npairs are ideal for probing the disk-halo interface. At such impact parameters,\nwe do not find any significant anti-correlation between rest equivalent width\n(REW) of CaII, MnII, FeII, MgII, and MgI absorptions and impact parameters.\nThese sight lines are typically redder than those of strong MgII absorbers,\nwith the color excess, E(B$-$V) for our sample ranging from $-$0.191 to 0.422,\nwith a median value of 0.058. In the E(B$-$V) vs. W$_{3935}$ plane, GOTOQs\noccupy the same region as CaII absorbers. For a given E(B$-$V), we find larger\nW$_{3935}$ than what has been found in the Milky Way, probably due to a smaller\ndust-to-gas ratio in GOTOQs. Galaxy parameters could be measured for twelve\ncases, and their properties seem to follow the trends found for strong MgII\nabsorbers. Measuring the host galaxy properties for the full sample using HST\nphotometry or AO-assisted ground-based imaging is important to gain insights\ninto the relationship between the stellar mass of galaxies and the metal line\nREW distributions at low impact parameters.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}