{"id":"2407.20873","title":"CCAT: Prime-Cam Optics Overview and Status Update","authors":"Zachary B. Huber, Lawrence T. Lin, Eve M. Vavagiakis, Rodrigo G.\n  Freundt, Victoria Butler, Scott C. Chapman, Steve K. Choi, Abigail T. Crites,\n  Cody J. Duell, Patricio A. Gallardo, Anthony I. Huber, Ben Keller, Alicia\n  Middleton, Michael D. Niemack, Thomas Nikola, John Orlowski-Scherer, Ema\n  Smith, Gordon Stacey, Samantha Walker, Bugao Zou","authorsParsed":[["Huber","Zachary B.",""],["Lin","Lawrence T.",""],["Vavagiakis","Eve M.",""],["Freundt","Rodrigo G.",""],["Butler","Victoria",""],["Chapman","Scott C.",""],["Choi","Steve K.",""],["Crites","Abigail T.",""],["Duell","Cody J.",""],["Gallardo","Patricio A.",""],["Huber","Anthony I.",""],["Keller","Ben",""],["Middleton","Alicia",""],["Niemack","Michael D.",""],["Nikola","Thomas",""],["Orlowski-Scherer","John",""],["Smith","Ema",""],["Stacey","Gordon",""],["Walker","Samantha",""],["Zou","Bugao",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 14:52:23 GMT"}],"updateDate":"2024-07-31","timestamp":1722351143000,"abstract":"  Prime-Cam is a first-generation science instrument for the CCAT Observatory's\nsix-meter aperture Fred Young Submillimeter Telescope (FYST). FYST's\ncrossed-Dragone design provides high optical throughput to take advantage of\nits unique site at 5600 m on Cerro Chajnantor in Chile's Atacama Desert to\nreach mapping speeds over ten times greater than current and near-term\nsubmillimeter experiments. Housing up to seven independent instrument modules\nin its 1.8-meter diameter cryostat, Prime-Cam will combine broadband\npolarization-sensitive modules and spectrometer modules designed for\nobservations in several frequency windows between 210 GHz and 850 GHz to study\na wide range of astrophysical questions from Big Bang cosmology to the\nformation of stars and galaxies in the Epoch of Reionization and beyond. In\norder to cover this range of frequencies and observation modes, each of the\nmodules contains a set of cold reimaging optics that is optimized for the\nscience goals of that module. These optical setups include several filters,\nthree or four anti-reflection-coated silicon lenses, and a Lyot stop to control\nthe field of view and illumination of the primary mirror, satisfy a series of\nmechanical constraints, and maximize optical performance within each passband.\nWe summarize the design considerations and trade-offs for the optics in these\nmodules and provide a status update on the fabrication of the Prime-Cam\nreceiver and the design of its 1 K and 100 mK thermal BUSs.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}