{"id":"2407.11413","title":"Distributed Prescribed-Time Convex Optimization: Cascade Design and\n  Time-Varying Gain Approach","authors":"Gewei Zuo, Lijun Zhu, Yujuan Wang and Zhiyong Chen","authorsParsed":[["Zuo","Gewei",""],["Zhu","Lijun",""],["Wang","Yujuan",""],["Chen","Zhiyong",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 06:00:39 GMT"}],"updateDate":"2024-07-17","timestamp":1721109639000,"abstract":"  In this paper, we address the distributed prescribed-time convex optimization\n(DPTCO) problem for a class of nonlinear multi-agent systems (MASs) under\nundirected connected graph. A cascade design framework is proposed such that\nthe DPTCO implementation is divided into two parts: distributed optimal\ntrajectory generator design and local reference trajectory tracking controller\ndesign. The DPTCO problem is then transformed into the prescribed-time\nstabilization problem of a cascaded system. Changing Lyapunov function method\nand time-varying state transformation method together with the sufficient\nconditions are proposed to prove the prescribed-time stabilization of the\ncascaded system as well as the uniform boundedness of internal signals in the\nclosed-loop systems. The proposed framework is then utilized to solve robust\nDPTCO problem for a class of chain-integrator MASs with external disturbances\nby constructing a novel variables and exploiting the property of time-varying\ngains. The proposed framework is further utilized to solve the adaptive DPTCO\nproblem for a class of strict-feedback MASs with parameter uncertainty, in\nwhich backstepping method with prescribed-time dynamic filter is adopted. The\ndescending power state transformation is introduced to compensate the growth of\nincreasing rate induced by the derivative of time-varying gains in recursive\nsteps and the high-order derivative of local reference trajectory is not\nrequired. Finally, theoretical results are verified by two numerical examples.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}