{"id":"2407.16022","title":"Color Refinement for Relational Structures","authors":"Benjamin Scheidt, Nicole Schweikardt","authorsParsed":[["Scheidt","Benjamin",""],["Schweikardt","Nicole",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 19:57:19 GMT"}],"updateDate":"2024-07-24","timestamp":1721678239000,"abstract":"  Color Refinement, also known as Naive Vertex Classification, is a classical\nmethod to distinguish graphs by iteratively computing a coloring of their\nvertices. While it is mainly used as an imperfect way to test for isomorphism,\nthe algorithm permeated many other, seemingly unrelated, areas of computer\nscience. The method is algorithmically simple, and it has a well-understood\ndistinguishing power: It is logically characterized by Cai, F\\\"urer and\nImmerman (1992), who showed that it distinguishes precisely those graphs that\ncan be distinguished by a sentence of first-order logic with counting\nquantifiers and only two variables. A combinatorial characterization is given\nby Dvo\\v{r}\\'ak (2010), who shows that it distinguishes precisely those graphs\nthat can be distinguished by the number of homomorphisms from some tree.\n  In this paper, we introduce Relational Color Refinement (RCR, for short), a\ngeneralization of the Color Refinement method from graphs to arbitrary\nrelational structures, whose distinguishing power admits the equivalent\ncombinatorial and logical characterizations as Color Refinement has on graphs:\nWe show that RCR distinguishes precisely those structures that can be\ndistinguished by the number of homomorphisms from an acyclic relational\nstructure. Further, we show that RCR distinguishes precisely those structures\nthat can be distinguished by a sentence of the guarded fragment of first-order\nlogic with counting quantifiers.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Discrete Mathematics","Computing Research Repository/Logic in Computer Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}