{"id":"2407.06317","title":"Enhanced Safety in Autonomous Driving: Integrating Latent State\n  Diffusion Model for End-to-End Navigation","authors":"Detian Chu, Linyuan Bai, Jianuo Huang, Zhenlong Fang, Peng Zhang, Wei\n  Kang, Haifeng Lin","authorsParsed":[["Chu","Detian",""],["Bai","Linyuan",""],["Huang","Jianuo",""],["Fang","Zhenlong",""],["Zhang","Peng",""],["Kang","Wei",""],["Lin","Haifeng",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:32:40 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 01:18:19 GMT"},{"version":"v3","created":"Tue, 16 Jul 2024 17:07:34 GMT"},{"version":"v4","created":"Wed, 17 Jul 2024 04:30:57 GMT"}],"updateDate":"2024-07-18","timestamp":1720463560000,"abstract":"  With the advancement of autonomous driving, ensuring safety during motion\nplanning and navigation is becoming more and more important. However, most\nend-to-end planning methods suffer from a lack of safety. This research\naddresses the safety issue in the control optimization problem of autonomous\ndriving, formulated as Constrained Markov Decision Processes (CMDPs). We\npropose a novel, model-based approach for policy optimization, utilizing a\nconditional Value-at-Risk based Soft Actor Critic to manage constraints in\ncomplex, high-dimensional state spaces effectively. Our method introduces a\nworst-case actor to guide safe exploration, ensuring rigorous adherence to\nsafety requirements even in unpredictable scenarios. The policy optimization\nemploys the Augmented Lagrangian method and leverages latent diffusion models\nto predict and simulate future trajectories. This dual approach not only aids\nin navigating environments safely but also refines the policy's performance by\nintegrating distribution modeling to account for environmental uncertainties.\nEmpirical evaluations conducted in both simulated and real environment\ndemonstrate that our approach outperforms existing methods in terms of safety,\nefficiency, and decision-making capabilities.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}