{"id":"2407.07392","title":"Malicious Path Manipulations via Exploitation of Representation\n  Vulnerabilities of Vision-Language Navigation Systems","authors":"Chashi Mahiul Islam, Shaeke Salman, Montasir Shams, Xiuwen Liu, and\n  Piyush Kumar","authorsParsed":[["Islam","Chashi Mahiul",""],["Salman","Shaeke",""],["Shams","Montasir",""],["Liu","Xiuwen",""],["Kumar","Piyush",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 06:32:58 GMT"}],"updateDate":"2024-07-11","timestamp":1720593178000,"abstract":"  Building on the unprecedented capabilities of large language models for\ncommand understanding and zero-shot recognition of multi-modal vision-language\ntransformers, visual language navigation (VLN) has emerged as an effective way\nto address multiple fundamental challenges toward a natural language interface\nto robot navigation. However, such vision-language models are inherently\nvulnerable due to the lack of semantic meaning of the underlying embedding\nspace. Using a recently developed gradient based optimization procedure, we\ndemonstrate that images can be modified imperceptibly to match the\nrepresentation of totally different images and unrelated texts for a\nvision-language model. Building on this, we develop algorithms that can\nadversarially modify a minimal number of images so that the robot will follow a\nroute of choice for commands that require a number of landmarks. We demonstrate\nthat experimentally using a recently proposed VLN system; for a given\nnavigation command, a robot can be made to follow drastically different routes.\nWe also develop an efficient algorithm to detect such malicious modifications\nreliably based on the fact that the adversarially modified images have much\nhigher sensitivity to added Gaussian noise than the original images.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}