{"id":"2407.07987","title":"Leptophilic ALPs with TWIST data for polarized muon decays","authors":"Ankita Budhraja, Samadrita Mukherjee, Sahana Narasimha","authorsParsed":[["Budhraja","Ankita",""],["Mukherjee","Samadrita",""],["Narasimha","Sahana",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:40:09 GMT"}],"updateDate":"2024-07-12","timestamp":1720636809000,"abstract":"  We study the production of axion-like particles (ALPs) in association with\nelectrons and neutrinos in the muon decay process. For this purpose, we compute\nthe decay width of the muon to a four-body channel using a $d=7$ effective\noperator that couples the ALP to the Standard model fermions, namely leptons\nand neutrinos. Assuming a dominant coupling of the ALP to the dark sector, we\nonly consider ALP decays to invisible final states. To obtain constraints on\nour model using the existing measurements, we leverage data from the TRIUMF\nWeak Interaction Symmetry Test (TWIST) experiment and obtain bounds on the\nALP-lepton coupling for masses in the range of $0 < m_{\\phi} < m_{\\mu}/4$, as\nallowed by kinematics. Using the precision of current TWIST measurements, we\nobtain an order of magnitude estimation necessary for future searches to\nfurther constrain the parameter space for such a setup. Furthermore, we find\nthat keeping realistic considerations, the new physics contribution can\npossibly be enhanced even with a minimalistic modification to the fiducial area\nused in the experiment potentially allowing for stringer constraints. At the\nend, in an attempt to relax the assumption that ALP decays to invisible only,\nwe also investigate its stability and find potential longevity within collider\nenvironments for the mass range considered in this study.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BM_erGrI1t_RzSd9g98Zfjr58Jpnvor5oJKd35DTCFc","pdfSize":"693698"}
