{"id":"2407.16597","title":"Inference of rankings planted in random tournaments","authors":"Dmitriy Kunisky, Daniel A. Spielman, Xifan Yu","authorsParsed":[["Kunisky","Dmitriy",""],["Spielman","Daniel A.",""],["Yu","Xifan",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 15:59:52 GMT"}],"updateDate":"2024-07-24","timestamp":1721750392000,"abstract":"  We consider the problem of inferring an unknown ranking of $n$ items from a\nrandom tournament on $n$ vertices whose edge directions are correlated with the\nranking. We establish, in terms of the strength of these correlations, the\ncomputational and statistical thresholds for detection (deciding whether an\nobserved tournament is purely random or drawn correlated with a hidden ranking)\nand recovery (estimating the hidden ranking with small error in Spearman's\nfootrule or Kendall's tau metric on permutations). Notably, we find that this\nproblem provides a new instance of a detection-recovery gap: solving the\ndetection problem requires much weaker correlations than solving the recovery\nproblem. In establishing these thresholds, we also identify simple algorithms\nfor detection (thresholding a degree 2 polynomial) and recovery (outputting a\nranking by the number of \"wins\" of a tournament vertex, i.e., the out-degree)\nthat achieve optimal performance up to constants in the correlation strength.\nFor detection, we find that the above low-degree polynomial algorithm is\nsuperior to a natural spectral algorithm. We also find that, whenever it is\npossible to achieve strong recovery (i.e., to estimate with vanishing error in\nthe above metrics) of the hidden ranking, then the above \"Ranking By Wins\"\nalgorithm not only does so, but also outputs a close approximation of the\nmaximum likelihood estimator, a task that is NP-hard in the worst case.\n","subjects":["Mathematics/Statistics Theory","Computing Research Repository/Computational Complexity","Computing Research Repository/Data Structures and Algorithms","Mathematics/Combinatorics","Mathematics/Probability","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}