{"id":"2407.13523","title":"A Security Assessment tool for Quantum Threat Analysis","authors":"Basel Halak, Cristian Sebastian Csete, Edward Joyce, Jack Papaioannou,\n  Alexandre Pires, Jin Soma, Betul Gokkaya and Michael Murphy","authorsParsed":[["Halak","Basel",""],["Csete","Cristian Sebastian",""],["Joyce","Edward",""],["Papaioannou","Jack",""],["Pires","Alexandre",""],["Soma","Jin",""],["Gokkaya","Betul",""],["Murphy","Michael",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 13:58:34 GMT"}],"updateDate":"2024-07-19","timestamp":1721311114000,"abstract":"  The rapid advancement of quantum computing poses a significant threat to many\ncurrent security algorithms used for secure communication, digital\nauthentication, and information encryption. A sufficiently powerful quantum\ncomputer could potentially exploit vulnerabilities in these algorithms,\nrendering data in transit insecure. This threat is expected to materialize\nwithin the next 20 years. Immediate transition to quantum-resilient\ncryptographic schemes is crucial, primarily to mitigate store-now-decrypt-later\nattacks and to ensure the security of products with decade-long operational\nlives. This transition requires a systematic approach to identifying and\nupgrading vulnerable cryptographic implementations. This work developed a\nquantum assessment tool for organizations, providing tailored recommendations\nfor transitioning their security protocols into a post-quantum world. The work\nincluded a systematic evaluation of the proposed solution using qualitative\nfeedback from network administrators and cybersecurity experts. This feedback\nwas used to refine the accuracy and usability of the assessment process. The\nresults demonstrate its effectiveness and usefulness in helping organizations\nprepare for quantum computing threats. The assessment tool is publicly\navailable at (https://quantum-watch.soton.ac.uk).\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"VFP8oKp53gr6UJFHD5a1OQo1Po_qREwMy1zlzAE5jsw","pdfSize":"1318492"}
