{"id":"2407.19719","title":"Revolutionizing Urban Safety Perception Assessments: Integrating\n  Multimodal Large Language Models with Street View Images","authors":"Jiaxin Zhang, Yunqin Li, Tomohiro Fukuda, Bowen Wang","authorsParsed":[["Zhang","Jiaxin",""],["Li","Yunqin",""],["Fukuda","Tomohiro",""],["Wang","Bowen",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 06:03:13 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 12:29:47 GMT"}],"updateDate":"2024-08-06","timestamp":1722232993000,"abstract":"  Measuring urban safety perception is an important and complex task that\ntraditionally relies heavily on human resources. This process often involves\nextensive field surveys, manual data collection, and subjective assessments,\nwhich can be time-consuming, costly, and sometimes inconsistent. Street View\nImages (SVIs), along with deep learning methods, provide a way to realize\nlarge-scale urban safety detection. However, achieving this goal often requires\nextensive human annotation to train safety ranking models, and the\narchitectural differences between cities hinder the transferability of these\nmodels. Thus, a fully automated method for conducting safety evaluations is\nessential. Recent advances in multimodal large language models (MLLMs) have\ndemonstrated powerful reasoning and analytical capabilities. Cutting-edge\nmodels, e.g., GPT-4 have shown surprising performance in many tasks. We\nemployed these models for urban safety ranking on a human-annotated anchor set\nand validated that the results from MLLMs align closely with human perceptions.\nAdditionally, we proposed a method based on the pre-trained Contrastive\nLanguage-Image Pre-training (CLIP) feature and K-Nearest Neighbors (K-NN)\nretrieval to quickly assess the safety index of the entire city. Experimental\nresults show that our method outperforms existing training needed deep learning\napproaches, achieving efficient and accurate urban safety evaluations. The\nproposed automation for urban safety perception assessment is a valuable tool\nfor city planners, policymakers, and researchers aiming to improve urban\nenvironments.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"b7cBll-3HXtsW4BZxIIGll-subJqciOLn2LgOEl-jZo","pdfSize":"12203830"}
