{"id":"2407.13162","title":"A Master-Follower Teleoperation System for Robotic Catheterization:\n  Design, Characterization, and Tracking Control","authors":"Ali A. Nazari, Jeremy Catania, Soroush Sadeghian, Amir Jalali, Houman\n  Masnavi, Farrokh Janabi-Sharifi, Kourosh Zareinia","authorsParsed":[["Nazari","Ali A.",""],["Catania","Jeremy",""],["Sadeghian","Soroush",""],["Jalali","Amir",""],["Masnavi","Houman",""],["Janabi-Sharifi","Farrokh",""],["Zareinia","Kourosh",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 05:06:48 GMT"}],"updateDate":"2024-07-19","timestamp":1721279208000,"abstract":"  Minimally invasive robotic surgery has gained significant attention over the\npast two decades. Telerobotic systems, combined with robot-mediated minimally\ninvasive techniques, have enabled surgeons and clinicians to mitigate radiation\nexposure for medical staff and extend medical services to remote and\nhard-to-reach areas. To enhance these services, teleoperated robotic surgery\nsystems incorporating master and follower devices should offer transparency,\nenabling surgeons and clinicians to remotely experience a force interaction\nsimilar to the one the follower device experiences with patients' bodies. This\npaper presents the design and development of a three-degree-of-freedom\nmaster-follower teleoperated system for robotic catheterization. To resemble\nmanual intervention by clinicians, the follower device features a\ngrip-insert-release mechanism to eliminate catheter buckling and torsion during\noperation. The bidirectionally navigable ablation catheter is statically\ncharacterized for force-interactive medical interventions. The system's\nperformance is evaluated through approaching and open-loop path tracking over\ntypical circular, infinity-like, and spiral paths. Path tracking errors are\npresented as mean Euclidean error (MEE) and mean absolute error (MAE). The MEE\nranges from 0.64 cm (infinity-like path) to 1.53 cm (spiral path). The MAE also\nranges from 0.81 cm (infinity-like path) to 1.92 cm (spiral path). The results\nindicate that while the system's precision and accuracy with an open-loop\ncontroller meet the design targets, closed-loop controllers are necessary to\naddress the catheter's hysteresis and dead zone, and system nonlinearities.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}