{"id":"2407.18651","title":"Casimir-Lifshitz force with graphene: theory versus experiment, role of\n  spatial non-locality and of losses","authors":"Pablo Rodriguez-Lopez, Mauro Antezza","authorsParsed":[["Rodriguez-Lopez","Pablo",""],["Antezza","Mauro",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 10:38:03 GMT"}],"updateDate":"2024-07-29","timestamp":1721990283000,"abstract":"  We calculate the Casimir-Lifshitz force (CLF) between a metallic sphere and a\ngraphene-coated SiO$_2$ plane and compare our finding with the experiment and\ntheory by M. Liu \\emph{et al.}, PRL {\\bf 126}, 206802 (2021), where a non-local\nand lossless model for the graphene conductivity (GC) has been used and shown\nto be compatible with the experimental results. Recently, that conductivity\nmodel has been shown to be not correctly regularized [arXiv:2403.02279], to\npredict nonphysical results in the non-local regime, and being correct only in\nits local limit, where its expression is identical to the local Kubo\nconductivity model (once also losses are introduced). To compare the\nexperimental results with the correctly regularized Kubo theory and to clarify\nthe effective role played by the graphene non-locality and losses in that\nexperiment, we calculated the CLF using three different models for the GC: the\ncorrect general non-local Kubo model, the local Kubo model, and the\nnon-regularized and lossless model used by M. Liu \\emph{et al.}. For the\nparameters of the experiment, the predictions for the Casimir-Lifshitz force\nusing the three models are practically identical, implying that, for the\nexperiment, both non-local and lossy effects in the GC are negligible. This\nexplains why the GC model used in M. Liu \\emph{et al.} provides results in\nagreement with the experiment. We find that the experiment cannot distinguish\nbetween the Drude and Plasma prescriptions. Our findings are relevant for\npresent and future comparisons with experimental measurement of the\nCasimir-Lifshitz force involving graphene structures. Indeed, we show that an\nextremely simple local Kubo model, explicitly depending on Dirac mass, chemical\npotential, losses and temperature, is largely enough for a totally\ncomprehensive comparison with typical experimental configurations.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}