{"id":"2407.18040","title":"Quadrupolar Excitons in MoSe2 Bilayers","authors":"Jakub Jasi\\'nski, Joakim Hagel, Samuel Brem, Edith Wietek, Takashi\n  Taniguchi, Kenji Watanabe, Alexey Chernikov, Nicolas Bruyant, Mateusz Dyksik,\n  Alessandro Surrente, Micha{\\l} Baranowski, Duncan K. Maude, Ermin Malic, and\n  Paulina P{\\l}ochocka","authorsParsed":[["Jasiński","Jakub",""],["Hagel","Joakim",""],["Brem","Samuel",""],["Wietek","Edith",""],["Taniguchi","Takashi",""],["Watanabe","Kenji",""],["Chernikov","Alexey",""],["Bruyant","Nicolas",""],["Dyksik","Mateusz",""],["Surrente","Alessandro",""],["Baranowski","Michał",""],["Maude","Duncan K.",""],["Malic","Ermin",""],["Płochocka","Paulina",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 13:38:31 GMT"}],"updateDate":"2024-07-26","timestamp":1721914711000,"abstract":"  The quest for platforms to generate and control exotic excitonic states has\ngreatly benefited from the advent of transition metal dichalcogenide (TMD)\nmonolayers and their heterostructures. Among the unconventional excitonic\nstates, quadrupolar excitons - a hybridized combination of two dipolar excitons\nwith anti-aligned dipole moments - are of great interest for applications in\nquantum simulations and for the investigation of many-body physics. Here, we\nunambiguously demonstrate for the first time in natural MoSe$_2$ homobilayers\nthe emergence of quadrupolar excitons, whose energy shifts quadratically in\nelectric field. In contrast to, so far reported trilayer systems hosting\nquadrupolar excitons, MoSe$_2$ homobilayers have many advantages, a stronger\ninterlayer hybridization, cleaner potential landscapes and inherent stability\nwith respect to moir\\'e potentials or post-stacking reconstruction. Our\nexperimental observations are complemented by many-particle theory calculations\noffering microscopic insights in the formation of quadrupole excitons. Our\nresults suggest TMD homobilayers as ideal platform for the engineering of\nexcitonic states and their interaction with light and thus candidate for\ncarrying out on-chip simulations.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"eRZFXFplVNIoeIHbfm1zFapc9yZlPAm_11LFbjMS-HQ","pdfSize":"16623428"}
