{"id":"2407.20514","title":"The Future of International Data Transfers: Managing Legal Risk with a\n  User-Held Data Model","authors":"Paulius Jurcys, Marcelo Corrales Compagnucci and Mark Fenwick","authorsParsed":[["Jurcys","Paulius",""],["Compagnucci","Marcelo Corrales",""],["Fenwick","Mark",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 03:15:36 GMT"}],"updateDate":"2024-07-31","timestamp":1722309336000,"abstract":"  The General Data Protection Regulation contains a blanket prohibition on the\ntransfer of personal data outside of the European Economic Area unless strict\nrequirements are met. The rationale for this provision is to protect personal\ndata and data subject rights by restricting data transfers to countries that\nmay not have the same level of protection as the EEA. However, the ubiquitous\nand permeable character of new technologies such as cloud computing, and the\nincreased inter connectivity between societies, has made international data\ntransfers the norm and not the exception. The Schrems II case and subsequent\nregulatory developments have further raised the bar for companies to comply\nwith complex and, often, opaque rules. Many firms are, therefore, pursuing\ntechnology-based solutions in order to mitigate this new legal risk. These\nemerging technological alternatives reduce the need for open-ended cross-border\ntransfers and the practical challenges and legal risk that such transfers\ncreate after Schrems. This article examines one such alternative, namely a\nuser-held data model. This approach takes advantage of personal data clouds\nthat allows data subjects to store their data locally and in a more\ndecentralised manner, thus decreasing the need for cross-border transfers and\noffering end-users the possibility of greater control over their data.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XtjgzA-T5WpOSDef5l3PrpHlwgBbQSE_knT5Bl9CItc","pdfSize":"11631469"}
