{"id":"2407.10445","title":"Backdoor Attacks against Image-to-Image Networks","authors":"Wenbo Jiang and Hongwei Li and Jiaming He and Rui Zhang and Guowen Xu\n  and Tianwei Zhang and Rongxing Lu","authorsParsed":[["Jiang","Wenbo",""],["Li","Hongwei",""],["He","Jiaming",""],["Zhang","Rui",""],["Xu","Guowen",""],["Zhang","Tianwei",""],["Lu","Rongxing",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 05:14:17 GMT"}],"updateDate":"2024-07-16","timestamp":1721020457000,"abstract":"  Recently, deep learning-based Image-to-Image (I2I) networks have become the\npredominant choice for I2I tasks such as image super-resolution and denoising.\nDespite their remarkable performance, the backdoor vulnerability of I2I\nnetworks has not been explored. To fill this research gap, we conduct a\ncomprehensive investigation on the susceptibility of I2I networks to backdoor\nattacks. Specifically, we propose a novel backdoor attack technique, where the\ncompromised I2I network behaves normally on clean input images, yet outputs a\npredefined image of the adversary for malicious input images containing the\ntrigger. To achieve this I2I backdoor attack, we propose a targeted universal\nadversarial perturbation (UAP) generation algorithm for I2I networks, where the\ngenerated UAP is used as the backdoor trigger. Additionally, in the backdoor\ntraining process that contains the main task and the backdoor task, multi-task\nlearning (MTL) with dynamic weighting methods is employed to accelerate\nconvergence rates. In addition to attacking I2I tasks, we extend our I2I\nbackdoor to attack downstream tasks, including image classification and object\ndetection. Extensive experiments demonstrate the effectiveness of the I2I\nbackdoor on state-of-the-art I2I network architectures, as well as the\nrobustness against different mainstream backdoor defenses.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}