{"id":"2407.20281","title":"NeuSemSlice: Towards Effective DNN Model Maintenance via Neuron-level\n  Semantic Slicing","authors":"Shide Zhou and Tianlin Li and Yihao Huang and Ling Shi and Kailong\n  Wang and Yang Liu and Haoyu Wang","authorsParsed":[["Zhou","Shide",""],["Li","Tianlin",""],["Huang","Yihao",""],["Shi","Ling",""],["Wang","Kailong",""],["Liu","Yang",""],["Wang","Haoyu",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 03:19:13 GMT"}],"updateDate":"2024-07-31","timestamp":1721963953000,"abstract":"  Deep Neural networks (DNNs), extensively applied across diverse disciplines,\nare characterized by their integrated and monolithic architectures, setting\nthem apart from conventional software systems. This architectural difference\nintroduces particular challenges to maintenance tasks, such as model\nrestructuring (e.g., model compression), re-adaptation (e.g., fitting new\nsamples), and incremental development (e.g., continual knowledge accumulation).\nPrior research addresses these challenges by identifying task-critical neuron\nlayers, and dividing neural networks into semantically-similar sequential\nmodules. However, such layer-level approaches fail to precisely identify and\nmanipulate neuron-level semantic components, restricting their applicability to\nfiner-grained model maintenance tasks. In this work, we implement NeuSemSlice,\na novel framework that introduces the semantic slicing technique to effectively\nidentify critical neuron-level semantic components in DNN models for\nsemantic-aware model maintenance tasks. Specifically, semantic slicing\nidentifies, categorizes and merges critical neurons across different categories\nand layers according to their semantic similarity, enabling their flexibility\nand effectiveness in the subsequent tasks. For semantic-aware model maintenance\ntasks, we provide a series of novel strategies based on semantic slicing to\nenhance NeuSemSlice. They include semantic components (i.e., critical neurons)\npreservation for model restructuring, critical neuron tuning for model\nre-adaptation, and non-critical neuron training for model incremental\ndevelopment. A thorough evaluation has demonstrated that NeuSemSlice\nsignificantly outperforms baselines in all three tasks.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}