{"id":"2407.15777","title":"Optimization complexity and resource minimization of emitter-based\n  photonic graph state generation protocols","authors":"Evangelia Takou, Edwin Barnes, Sophia E. Economou","authorsParsed":[["Takou","Evangelia",""],["Barnes","Edwin",""],["Economou","Sophia E.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 16:29:52 GMT"}],"updateDate":"2024-07-23","timestamp":1721665792000,"abstract":"  Photonic graph states are important for measurement- and fusion-based quantum\ncomputing, quantum networks, and sensing. They can in principle be generated\ndeterministically by using emitters to create the requisite entanglement.\nFinding ways to minimize the number of entangling gates between emitters and\nunderstanding the overall optimization complexity of such protocols is crucial\nfor practical implementations. Here, we address these issues using graph theory\nconcepts. We develop optimizers that minimize the number of entangling gates,\nreducing them by up to 75$\\%$ compared to naive schemes for moderately sized\nrandom graphs. While the complexity of optimizing emitter-emitter CNOT counts\nis likely NP-hard, we are able to develop heuristics based on strong\nconnections between graph transformations and the optimization of stabilizer\ncircuits. These patterns allow us to process large graphs and still achieve a\nreduction of up to $66\\%$ in emitter CNOTs, without relying on subtle metrics\nsuch as edge density. We find the optimal emission orderings and circuits to\nprepare unencoded and encoded repeater graph states of any size, achieving\nglobal minimization of emitter and CNOT resources despite the average\nNP-hardness of both optimization problems. We further study the locally\nequivalent orbit of graphs. Although enumerating orbits is $\\#$P complete for\narbitrary graphs, we analytically calculate the size of the orbit of repeater\ngraphs and find a procedure to generate the orbit for any repeater size.\nFinally, we inspect the entangling gate cost of preparing any graph from a\ngiven orbit and show that we can achieve the same optimal CNOT count across the\norbit.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}