{"id":"2407.11052","title":"Revisiting, Benchmarking and Understanding Unsupervised Graph Domain\n  Adaptation","authors":"Meihan Liu, Zhen Zhang, Jiachen Tang, Jiajun Bu, Bingsheng He, Sheng\n  Zhou","authorsParsed":[["Liu","Meihan",""],["Zhang","Zhen",""],["Tang","Jiachen",""],["Bu","Jiajun",""],["He","Bingsheng",""],["Zhou","Sheng",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 06:44:09 GMT"}],"updateDate":"2024-07-17","timestamp":1720507449000,"abstract":"  Unsupervised Graph Domain Adaptation (UGDA) involves the transfer of\nknowledge from a label-rich source graph to an unlabeled target graph under\ndomain discrepancies. Despite the proliferation of methods designed for this\nemerging task, the lack of standard experimental settings and fair performance\ncomparisons makes it challenging to understand which and when models perform\nwell across different scenarios. To fill this gap, we present the first\ncomprehensive benchmark for unsupervised graph domain adaptation named\nGDABench, which encompasses 16 algorithms across 5 datasets with 74 adaptation\ntasks. Through extensive experiments, we observe that the performance of\ncurrent UGDA models varies significantly across different datasets and\nadaptation scenarios. Specifically, we recognize that when the source and\ntarget graphs face significant distribution shifts, it is imperative to\nformulate strategies to effectively address and mitigate graph structural\nshifts. We also find that with appropriate neighbourhood aggregation\nmechanisms, simple GNN variants can even surpass state-of-the-art UGDA\nbaselines. To facilitate reproducibility, we have developed an easy-to-use\nlibrary PyGDA for training and evaluating existing UGDA methods, providing a\nstandardized platform in this community. Our source codes and datasets can be\nfound at: https://github.com/pygda-team/pygda.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"F3zc41dp3JZcHqkVTWseDVY5cpsWQ5SwaK1ZpH6Ta24","pdfSize":"1080755"}
