{"id":"2407.11320","title":"A2E: Attribute-based Anonymity-Enhanced Authentication for Accessing\n  Driverless Taxi Service","authors":"Yanwei Gong and Xiaolin Chang and Jelena Mi\\v{s}i\\'c and Vojislav B.\n  Mi\\v{s}i\\'c","authorsParsed":[["Gong","Yanwei",""],["Chang","Xiaolin",""],["Mišić","Jelena",""],["Mišić","Vojislav B.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 02:22:26 GMT"},{"version":"v2","created":"Sat, 20 Jul 2024 04:51:51 GMT"}],"updateDate":"2024-07-23","timestamp":1721096546000,"abstract":"  Driverless vehicle as a taxi is gaining more attention due to its potential\nto enhance urban transportation efficiency. However, both unforeseen incidents\nled by unsupervised physical users' driverless taxi (DT) rides and personalized\nneeds of users when riding in a DT necessitate the authentication of user\nidentity and attributes. Moreover, safeguarding user identity privacy and\nquickly tracing malicious users if necessary to enhance the adoption of DTs\nremains a challenge. This paper proposes a novel Attribute-based Anonymity\nEnhanced (A2E) authentication scheme for users to access DT service. From the\nsecurity aspect, A2E has attribute verifiability, which is achieved by\ndesigning a user attribute credential based on redactable signature. Meanwhile,\nthis attribute credential also satisfies unlinkability and unforgeability. In\naddition, A2E has enhanced anonymity, which is achieved by designing a\ndecentralized credential issuance mechanism utilizing ring signature and secret\nsharing, safeguarding user attributes from association with anonymous\nidentities. Moreover, this mechanism provides traceability and non-frameability\nto users. From the performance aspect, A2E causes low overhead when tracing\nmalicious users and updating credentials. Besides, both scalability and\nlightweight are satisfied, which contributes to A2E's practicability. We\nconduct security analysis and performance evaluation to the security and\nperformance capabilities of A2E.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}