{"id":"2407.00289","title":"Personalised Outfit Recommendation via History-aware Transformers","authors":"David Jung, Julien Monteil, Philip Schulz, Volodymyr Vaskovych","authorsParsed":[["Jung","David",""],["Monteil","Julien",""],["Schulz","Philip",""],["Vaskovych","Volodymyr",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 02:58:44 GMT"}],"updateDate":"2024-07-02","timestamp":1719629924000,"abstract":"  We present the history-aware transformer (HAT), a transformer-based model\nthat uses shoppers' purchase history to personalise outfit predictions. The aim\nof this work is to recommend outfits that are internally coherent while\nmatching an individual shopper's style and taste. To achieve this, we stack two\ntransformer models, one that produces outfit representations and another one\nthat processes the history of purchased outfits for a given shopper. We use\nthese models to score an outfit's compatibility in the context of a shopper's\npreferences as inferred from their previous purchases. During training, the\nmodel learns to discriminate between purchased and random outfits using 3\nlosses: the focal loss for outfit compatibility typically used in the\nliterature, a contrastive loss to bring closer learned outfit embeddings from a\nshopper's history, and an adaptive margin loss to facilitate learning from weak\nnegatives. Together, these losses enable the model to make personalised\nrecommendations based on a shopper's purchase history.\n  Our experiments on the IQON3000 and Polyvore datasets show that HAT\noutperforms strong baselines on the outfit Compatibility Prediction (CP) and\nthe Fill In The Blank (FITB) tasks. The model improves AUC for the CP hard task\nby 15.7% (IQON3000) and 19.4% (Polyvore) compared to previous SOTA results. It\nfurther improves accuracy on the FITB hard task by 6.5% and 9.7%, respectively.\nWe provide ablation studies on the personalisation, constrastive loss, and\nadaptive margin loss that highlight the importance of these modelling choices.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Information Theory","Computing Research Repository/Systems and Control","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}