{"id":"2407.17360","title":"Si/AlN p-n heterojunction interfaced with ultrathin SiO2","authors":"Haris Naeem Abbasi, Jie Zhou, Ding Wang, Ping Wang, Yi Lu, Jiarui\n  Gong, Dong Liu, Yang Liu, Ranveer Singh, Zetian Mi, and Zhenqiang Ma","authorsParsed":[["Abbasi","Haris Naeem",""],["Zhou","Jie",""],["Wang","Ding",""],["Wang","Ping",""],["Lu","Yi",""],["Gong","Jiarui",""],["Liu","Dong",""],["Liu","Yang",""],["Singh","Ranveer",""],["Mi","Zetian",""],["Ma","Zhenqiang",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 15:37:44 GMT"}],"updateDate":"2024-07-25","timestamp":1721835464000,"abstract":"  Ultra-wide bandgap (UWBG) materials hold immense potential for high-power RF\nelectronics and deep ultraviolet photonics. Among these, AlGaN emerges as a\npromising candidate, offering a tunable bandgap from 3.4 eV (GaN) to 6.2 eV\n(AlN) and remarkable material characteristics. However, achieving efficient\np-type doping in high aluminum composition AlGaN remains a formidable\nchallenge. This study presents an alternative approach to address this issue by\nfabricating a p+Si/n-AlN/n+AlGaN heterojunction structure by following the\nsemiconductor grafting technique. High-resolution X-ray diffraction (HR-XRD)\nconfirmed the high crystalline quality of the AlN/AlGaN layers, with a full\nwidth at half maximum (FWHM) of 0.16 degrees for the AlGaN (0002) peak. Atomic\nforce microscopy (AFM) analysis revealed that the AlN surface exhibited a\nsmooth topography with a roughness of 1.9 nm. Furthermore, the transferred Si\nsurface demonstrated an even finer smoothness, with a roughness of 0.545 nm.\nX-ray photoelectron spectroscopy (XPS) measurements demonstrated a type-I\nheterojunction with a valence band offset of 3.63 eV and a conduction band\noffset of 1.32 eV. The pn diode devices exhibited a linear current-voltage\n(I-V) characteristic, an ideality factor of 1.92, and a rectification ratio of\n3.3e4, with a turn-on voltage of 3.9 V, indicating effective p-n\nheterojunction. Temperature-dependent I-V measurements showed stable operation\nup to 90C. The heterojunction's high-quality interface and electrical\nperformance showcase its potential for advanced AlGaN-based optoelectronic and\nelectronic devices.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}