{"id":"2407.04254","title":"A Complex-Coefficient Voltage Control for Virtual Synchronous Generators\n  for Dynamic Enhancement and Power-Voltage Decoupling","authors":"Jingzhe Xu, Weihua Zhou, Behrooz Bahrani","authorsParsed":[["Xu","Jingzhe",""],["Zhou","Weihua",""],["Bahrani","Behrooz",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 04:55:55 GMT"}],"updateDate":"2024-07-08","timestamp":1720155355000,"abstract":"  As electric power systems evolve towards decarbonization, the transition to\ninverter-based resources (IBRs) presents challenges to grid stability,\nnecessitating innovative control solutions. Virtual synchronous generator (VSG)\nemerges as a prominent solution. However, conventional VSGs are prone to\ninstability in strong grids, slow voltage regulation, and coupled power-voltage\nresponse. To address these issues, this paper introduces an advanced VSG\ncontrol strategy. A novel analysis of the VSG control dynamics is presented\nthrough a second-order closed-loop complex single-input single-output system,\nemploying a vectorized geometrical pole analysis technique for enhanced voltage\nstability and dynamics. The proposed comprehensive controller design mitigates\nissues related to control interacted subsynchronous resonance and $dq\n\\leftrightarrow 3\\phi$ transformation-induced voltage-coupled power transients,\nachieving improved system robustness and simplified control tuning. Key\ncontributions include a two-fold design: optimized voltage transition\ncharacteristics through direct pole placement and transient power overshoot\ncorrection via a compensator. Validated by simulation and experiments, the\nfindings offer a pragmatic solution for integrating VSG technology into\ndecarbonizing power systems, ensuring reliability and efficiency.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"pj6xp3-cNdgu81U5MM0c3v3ZNUdBjStHtbJV5OJZRA0","pdfSize":"8529793"}
