{"id":"2407.18278","title":"Talking Wikidata: Communication patterns and their impact on community\n  engagement in collaborative knowledge graphs","authors":"Elisavet Koutsiana, Ioannis Reklos, Kholoud Saad Alghamdi, Nitisha\n  Jain, Albert Mero\\~no-Pe\\~nuela, Elena Simperl","authorsParsed":[["Koutsiana","Elisavet",""],["Reklos","Ioannis",""],["Alghamdi","Kholoud Saad",""],["Jain","Nitisha",""],["Meroño-Peñuela","Albert",""],["Simperl","Elena",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 05:55:19 GMT"}],"updateDate":"2024-07-29","timestamp":1721800519000,"abstract":"  We study collaboration patterns of Wikidata, one of the world's largest\ncollaborative knowledge graph communities. Wikidata lacks long-term engagement\nwith a small group of priceless members, 0.8%, to be responsible for 80% of\ncontributions. Therefore, it is essential to investigate their behavioural\npatterns and find ways to enhance their contributions and participation.\nPrevious studies have highlighted the importance of discussions among\ncontributors in understanding these patterns. To investigate this, we analyzed\nall the discussions on Wikidata and used a mixed methods approach, including\nstatistical tests, network analysis, and text and graph embedding\nrepresentations. Our research showed that the interactions between Wikidata\neditors form a small world network where the content of a post influences the\ncontinuity of conversations. We also found that the account age of Wikidata\nmembers and their conversations are significant factors in their long-term\nengagement with the project. Our findings can benefit the Wikidata community by\nhelping them improve their practices to increase contributions and enhance\nlong-term participation.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UO4cENel9BBaCl5ZvbFaOxXKNOGGKQrf62fK2jf029c","pdfSize":"2494633"}
