{"id":"2407.09681","title":"The ALMA-CRISTAL survey: Dust temperature and physical conditions of the\n  interstellar medium in a typical galaxy at z=5.66","authors":"V. Villanueva, R. Herrera-Camus, J. Gonzalez-Lopez, M. Aravena, R. J.\n  Assef, Mauricio Baeza-Garay, L. Barcos-Mu\\~noz, S. Bovino, R. A. A. Bowler,\n  E. da Cunha, I. De Looze, T. Diaz-Santos, A. Ferrara, N. Foerster-Schreiber,\n  H. Algera, R. Iked, M. Killi, I. Mitsuhashi, T. Naab, M. Relano, J. Spilker,\n  M. Solimano, M. Palla, S.H. Price, A. Posses, K. Tadaki, K. Telikova, and H.\n  \\\"Ubler","authorsParsed":[["Villanueva","V.",""],["Herrera-Camus","R.",""],["Gonzalez-Lopez","J.",""],["Aravena","M.",""],["Assef","R. J.",""],["Baeza-Garay","Mauricio",""],["Barcos-Muñoz","L.",""],["Bovino","S.",""],["Bowler","R. A. A.",""],["da Cunha","E.",""],["De Looze","I.",""],["Diaz-Santos","T.",""],["Ferrara","A.",""],["Foerster-Schreiber","N.",""],["Algera","H.",""],["Iked","R.",""],["Killi","M.",""],["Mitsuhashi","I.",""],["Naab","T.",""],["Relano","M.",""],["Spilker","J.",""],["Solimano","M.",""],["Palla","M.",""],["Price","S. H.",""],["Posses","A.",""],["Tadaki","K.",""],["Telikova","K.",""],["Übler","H.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 20:31:18 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 08:42:29 GMT"},{"version":"v3","created":"Wed, 17 Jul 2024 13:55:15 GMT"},{"version":"v4","created":"Fri, 13 Sep 2024 09:49:31 GMT"}],"updateDate":"2024-09-16","timestamp":1720816278000,"abstract":"  We present new $\\lambda_{\\rm rest}=77$ $\\mu$m dust continuum observations\nfrom the ALMA of HZ10 (CRISTAL-22), a dusty main-sequence galaxy at $z$=5.66 as\npart of the [CII] Resolved Ism in STar-forming Alma Large program, CRISTAL. The\nhigh angular resolution of the ALMA Band 7 and new Band 9 data($\\sim{0}''.4$)\nreveals the complex structure of HZ10, which comprises two main components\n(HZ10-C and HZ10-W) and a bridge-like dusty emission between them (the Bridge).\nWe model the dust spectral energy distribution (SED) to constrain the physical\nconditions of the interstellar medium (ISM) and its variations among the\ndifferent components identified in HZ10. We find that HZ10-W (the more\nUV-obscured component) has an SED dust temperature of $T_{\\rm\nSED}$$\\sim$51.2$\\pm13.1$ K; this is $\\sim$5 K higher (although still\nconsistent) than that of the central component and previous global estimations\nfor HZ10. Our new ALMA data allow us to reduce by a factor of $\\sim$2.3 the\nuncertainties of global $T_{\\rm SED}$ measurements compared to previous\nstudies. Interestingly, HZ10-W shows a lower [CII]/FIR ratio compared to the\nother two components (although still within the uncertainties), suggesting a\nharder radiation field destroying polycyclic aromatic hydrocarbon associated\nwith [CII] emission (e.g., active galactic nuclei or young stellar\npopulations). While HZ10-C appears to follow the tight IRX-$\\beta_{\\rm UV}$\nrelation seen in local UV-selected starburst galaxies and high-$z$ star-forming\ngalaxies, we find that both HZ10-W and the Bridge depart from this relation and\nare well described by dust-screen models with holes in front of a hard UV\nradiation field. This suggests that the UV emission (likely from young stellar\npopulations) is strongly attenuated in the more dusty components of the HZ10\nsystem.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dpgYPagTxnXSrK8nbmF0BHpeAmuIKPOsVs-I3KV8SkE","pdfSize":"2410115"}
