{"id":"2407.16787","title":"A Relativistic Scalar Model for Fractional Interaction between Dark\n  Matter and Gravity","authors":"Francesco Benetti, Andrea Lapi, Giovanni Gandolfi, Stefano Liberati","authorsParsed":[["Benetti","Francesco",""],["Lapi","Andrea",""],["Gandolfi","Giovanni",""],["Liberati","Stefano",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 18:40:00 GMT"}],"updateDate":"2024-07-25","timestamp":1721760000000,"abstract":"  In a series of recent papers we put forward a ``fractional gravity''\nframework striking an intermediate course between a modified gravity theory and\nan exotic dark matter (DM) scenario, which envisages the DM component in\nvirialized halos to feel a non-local interaction mediated by gravity. The\nremarkable success of this model in reproducing several aspects of DM\nphenomenology motivates us to look for a general relativistic extension.\nSpecifically, we propose a theory, dubbed Relativistic Scalar Fractional\nGravity or RSFG, in which the trace of the DM stress-energy tensor couples to\nthe scalar curvature via a non-local operator constructed with a fractional\npower of the d'Alembertian. We derive the field equations starting from an\naction principle, and then we investigate their weak field limit, demonstrating\nthat in the Newtonian approximation the fractional gravity setup of our\nprevious works is recovered. We compute the first-order post-Newtonian\nparameter $\\gamma$ and its relation with weak lensing, showing that although in\nRSFG the former deviates from its GR values of unity, the latter is unaffected.\nWe also perform a standard scalar-vector-tensor-decomposition of RSFG in the\nweak field limit, to highlight that gravitational waves propagate at the speed\nof light, though also an additional scalar mode becomes dynamical. Finally, we\nderive the modified conservation laws of the DM stress energy tensor in RSFG,\nshowing that a new non-local force emerges, and hence that the DM fluid\ndeviates from the geodesic solutions of the field equations.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}