{"id":"2407.13596","title":"EarthMarker: Visual Prompt Learning for Region-level and Point-level\n  Remote Sensing Imagery Comprehension","authors":"Wei Zhang, Miaoxin Cai, Tong Zhang, Jun Li, Yin Zhuang, and Xuerui Mao","authorsParsed":[["Zhang","Wei",""],["Cai","Miaoxin",""],["Zhang","Tong",""],["Li","Jun",""],["Zhuang","Yin",""],["Mao","Xuerui",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 15:35:00 GMT"},{"version":"v2","created":"Sat, 20 Jul 2024 10:20:28 GMT"}],"updateDate":"2024-07-23","timestamp":1721316900000,"abstract":"  Recent advances in visual prompting in the natural image area have allowed\nusers to interact with artificial intelligence (AI) tools through various\nvisual marks such as box, point, and free-form shapes. However, due to the\nsignificant difference between the natural and remote sensing (RS) images,\nexisting visual prompting models face challenges in RS scenarios. Moreover, RS\nMLLMs mainly focus on interpreting image-level RS data and only support\ninteraction with language instruction, restricting flexibility applications in\nthe real world. To address those limitations, the first visual prompting model\nnamed EarthMarker is proposed, which excels in image-level, region-level, and\npoint-level RS imagery interpretation. Specifically, the visual prompts\nalongside images and text instruction input into the large language model\n(LLM), adapt models toward specific predictions and tasks. Subsequently, a\nsharing visual encoding method is introduced to refine multi-scale image\nfeatures and visual prompt information uniformly. Furthermore, to endow the\nEarthMarker with versatile multi-granularity visual perception abilities, the\ncross-domain phased learning strategy is developed, and the disjoint parameters\nare optimized in a lightweight manner by leveraging both the natural and RS\ndomain-specific knowledge. In addition, to tackle the lack of RS visual\nprompting data, a dataset named RSVP featuring multi-modal fine-grained visual\nprompting instruction is constructed. Extensive experiments are conducted to\ndemonstrate the proposed EarthMarker's competitive performance, representing a\nsignificant advance in multi-granularity RS imagery interpretation under the\nvisual prompting learning framework.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}