{"id":"2407.17181","title":"Trans2Unet: Neural fusion for Nuclei Semantic Segmentation","authors":"Dinh-Phu Tran, Quoc-Anh Nguyen, Van-Truong Pham, Thi-Thao Tran","authorsParsed":[["Tran","Dinh-Phu",""],["Nguyen","Quoc-Anh",""],["Pham","Van-Truong",""],["Tran","Thi-Thao",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 11:32:33 GMT"}],"updateDate":"2024-07-25","timestamp":1721820753000,"abstract":"  Nuclei segmentation, despite its fundamental role in histopathological image\nanalysis, is still a challenge work. The main challenge of this task is the\nexistence of overlapping areas, which makes separating independent nuclei more\ncomplicated. In this paper, we propose a new two-branch architecture by\ncombining the Unet and TransUnet networks for nuclei segmentation task. In the\nproposed architecture, namely Trans2Unet, the input image is first sent into\nthe Unet branch whose the last convolution layer is removed. This branch makes\nthe network combine features from different spatial regions of the input image\nand localizes more precisely the regions of interest. The input image is also\nfed into the second branch. In the second branch, which is called TransUnet\nbranch, the input image will be divided into patches of images. With Vision\ntransformer (ViT) in architecture, TransUnet can serve as a powerful encoder\nfor medical image segmentation tasks and enhance image details by recovering\nlocalized spatial information. To boost up Trans2Unet efficiency and\nperformance, we proposed to infuse TransUnet with a computational-efficient\nvariation called \"Waterfall\" Atrous Spatial Pooling with Skip Connection\n(WASP-KC) module, which is inspired by the \"Waterfall\" Atrous Spatial Pooling\n(WASP) module. Experiment results on the 2018 Data Science Bowl benchmark show\nthe effectiveness and performance of the proposed architecture while compared\nwith previous segmentation models.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Bahl1rciPMsaKQe7d0idCgWShNeeKJov-yuClaHVBXo","pdfSize":"991969"}
