{"id":"2407.00686","title":"Exploring the Evolution of Nonlinear Electrodynamics in the Universe: A\n  Dynamical Systems Approach","authors":"Ricardo Garc\\'ia-Salcedo, Isidro G\\'omez-Vargas, Tame Gonz\\'alez,\n  Vicent Martinez-Badenes, Israel Quiros","authorsParsed":[["García-Salcedo","Ricardo",""],["Gómez-Vargas","Isidro",""],["González","Tame",""],["Martinez-Badenes","Vicent",""],["Quiros","Israel",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 12:51:11 GMT"}],"updateDate":"2024-09-05","timestamp":1719751871000,"abstract":"  This paper investigates the dynamics of cosmological models incorporating\nnonlinear electrodynamics (NLED), focusing on their stability and causality. We\nexplore two specific NLED models: the Power-Law and Rational Lagrangians. We\nassess these models' viability in describing the universe's evolution using\ndynamical systems theory and Bayesian inference. We present the theoretical\nframework of NLED coupled with general relativity, followed by an analysis of\nthe stability and causality through the squared sound speed of the NLED\nLagrangians. We then conduct a detailed dynamical analysis to identify the\nuniverse's evolution with this matter content. Our results show that the\nPower-Law Lagrangian model transitions through various cosmological phases from\na Maxwell radiation-dominated state to a matter-dominated state. For the\nRational Lagrangian model, including the Maxwell term, stable and causal\nbehavior is observed within specific parameter ranges, with critical points\nindicating the evolutionary pathways of the universe. To validate our\ntheoretical findings, we perform Bayesian parameter estimation using a\ncomprehensive set of observational data, including cosmic chronometers, Baryon\nAcoustic Oscillation (BAO) measurements, and Type Ia Supernovae (SNeIa). The\nestimated parameters for both models align with expected values for the current\nuniverse, particularly the matter density $\\Omega_m$ and the Hubble parameter\n$h$. However, the parameters $\\alpha$ and $b$ are not tightly constrained\nwithin the prior ranges. Our model comparison strongly favors the $\\Lambda$CDM\nmodel over the NLED models for late-universe observations, as the NLED model\ndoes not exhibit a cosmological constant behavior. Our results highlight the\nneed for further refinement and exploration of NLED-based cosmological models\nto fully integrate them into the standard cosmological framework.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}