{"id":"2407.19171","title":"Assessing Spatial Disparities: A Bayesian Linear Regression Approach","authors":"Kyle Lin Wu and Sudipto Banerjee","authorsParsed":[["Wu","Kyle Lin",""],["Banerjee","Sudipto",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 04:57:49 GMT"}],"updateDate":"2024-07-30","timestamp":1722056269000,"abstract":"  Epidemiological investigations of regionally aggregated spatial data often\ninvolve detecting spatial health disparities between neighboring regions on a\nmap of disease mortality or incidence rates. Analyzing such data introduces\nspatial dependence among the health outcomes and seeks to report statistically\nsignificant spatial disparities by delineating boundaries that separate\nneighboring regions with widely disparate health outcomes. However, current\nstatistical methods are often inadequate for appropriately defining what\nconstitutes a spatial disparity and for constructing rankings of posterior\nprobabilities that are robust under changes to such a definition. More\nspecifically, non-parametric Bayesian approaches endow spatial effects with\ndiscrete probability distributions using Dirichlet processes, or\ngeneralizations thereof, and rely upon computationally intensive methods for\ninferring on weakly identified parameters. In this manuscript, we introduce a\nBayesian linear regression framework to detect spatial health disparities. This\nenables us to exploit Bayesian conjugate posterior distributions in a more\naccessible manner and accelerate computation significantly over existing\nBayesian non-parametric approaches. Simulation experiments conducted over a\ncounty map of the entire United States demonstrate the effectiveness of our\nmethod and we apply our method to a data set from the Institute of Health\nMetrics and Evaluation (IHME) on age-standardized US county-level estimates of\nmortality rates across tracheal, bronchus, and lung cancer.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"q3OItyNo9L6UBhiVllFx_jIKgqWy-COJKwevzY3LEtI","pdfSize":"19441875"}
