{"id":"2407.11022","title":"Texture tomography with high angular resolution utilizing sparsity","authors":"Mads Carlsen and Florencia Malamud and Peter Modregger and Anna\n  Wildeis and Markus Hartmann and Robert Brandt and Andreas Menzel and Marianne\n  Liebi","authorsParsed":[["Carlsen","Mads",""],["Malamud","Florencia",""],["Modregger","Peter",""],["Wildeis","Anna",""],["Hartmann","Markus",""],["Brandt","Robert",""],["Menzel","Andreas",""],["Liebi","Marianne",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 19:52:11 GMT"}],"updateDate":"2024-07-17","timestamp":1719863531000,"abstract":"  We demonstrate a novel approach to the reconstruction of scanning probe x-ray\ndiffraction tomography data with anisotropic poly crystalline samples. The\nmethod involves reconstructing a voxel map containing an orientation\ndistribution function in each voxel of an extended 3D sample. This method\ndiffers from existing approaches by not relying on a peak-finding and is\ntherefore applicable to sample systems consisting of small and highly mosaic\ncrystalline domains that are not handled well by existing methods. Samples of\ninterest include bio-minerals and a range of small-graines microstructures\ncommon in engineering metals. By choosing a particular kind of basis functions,\nwe can effectively utilize non-negativity in orientation-space for samples with\nsparse texture. This enables us to achieve stable solutions at high angular\nresolutions where the problem would otherwise be under determined. We\ndemonstrate the new approach using data from a shot peened martensite sample\nwhere we are able to map the twinning micro structure in the interior of a bulk\nsample without resolving the individual lattice domains. We also demonstrate\nthe approach on a piece of gastropods shell with a mosaic micro structure.\n","subjects":["Condensed Matter/Materials Science","Physics/Data Analysis, Statistics and Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}