{"id":"2407.19182","title":"Secular aberration drift in stellar proper motions: An additional term\n  due to the change in line-of-sight direction","authors":"Niu Liu, Zi Zhu, Jia-Cheng Liu","authorsParsed":[["Liu","Niu",""],["Zhu","Zi",""],["Liu","Jia-Cheng",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 05:45:37 GMT"}],"updateDate":"2024-07-30","timestamp":1722059137000,"abstract":"  The motion of the barycenter of the Solar System (SSB), the origin of the\nInternational Celestial Reference System, causes a directional displacement\nknown as secular aberration. The secular aberration drift caused by the\ngalactocentric acceleration of the SSB has been modeled in the third generation\nof the International Celestial Reference Frame. We aim to address another\nsecular aberration drift effect due to the change in the line-of-sight\ndirection and study its implications for stellar proper motions. A complete\nformula of secular aberration drift is derived, and its influence on stellar\nproper motion is computed based on the astrometric data in \\textit{Gaia} Data\nRelease 3. We found that the secular aberration drift due to the change in the\nline-of-sight direction tends to decrease the observed proper motions for stars\nwith galactic longitudes between $0^{\\circ}$ and $180^{\\circ}$, and increase\nthe observed proper motion for stars in the remaining region. If this secular\naberration drift effect is ignored, it will induce an additional proper motion\nof $>1\\,\\mathrm{mas\\,yr^{-1}}$ for 84 stars and $>0.02\\,\\mathrm{mas\\,yr^{-1}}$\nfor 5\\,944\\,879 stars, which is comparable to or several times greater than the\ntypical formal uncertainty of the \\textit{Gaia} proper motion measurements at\n$G<13$. The secular aberration drift due to the change in the line-of-sight\ndirection and the acceleration of the SSB should be modeled to make the stellar\nreference frame consistent with the extragalactic reference frame.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}