{"id":"2407.14588","title":"Forecasts and Statistical Insights for Line Intensity Mapping\n  Cross-Correlations: A Case Study with 21cm x [CII]","authors":"Hannah Fronenberg and Adrian Liu","authorsParsed":[["Fronenberg","Hannah",""],["Liu","Adrian",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-23","timestamp":1721412000000,"abstract":"  Intensity mapping -- the large-scale mapping of selected spectral lines\nwithout resolving individual sources -- is quickly emerging as an efficient way\nto conduct large cosmological surveys. Multiple surveys covering a variety of\nlines (such as the hydrogen 21cm hyperfine line, CO rotational lines, and [CII]\nfine structure lines, among others) are either observing or will soon be\nonline, promising a panchromatic view of our Universe over a broad redshift\nrange. With multiple lines potentially covering the same volume,\ncross-correlations have become an attractive prospect, both for probing the\nunderlying astrophysics and for mitigating observational systematics. For\nexample, cross correlating 21cm and [CII] intensity maps during reionization\ncould reveal the characteristic scale of ionized bubbles around the first\ngalaxies, while simultaneously providing a convenient way to reduce independent\nforeground contaminants between the two surveys. However, many of the desirable\nproperties of cross-correlations in principle emerge only under ideal\nconditions, such as infinite ensemble averages. In this paper, we construct an\nend-to-end pipeline for analyzing intensity mapping cross-correlations,\nenabling instrumental effects, foreground residuals, and analysis choices to be\npropagated through Monte Carlo simulations to a set of rigorous error\nproperties, including error covariances, window functions, and full probability\ndistributions for power spectrum estimates. We use this framework to critically\nexamine the applicability of simplifying assumptions such as the independence\nand Gaussianity of power spectrum errors. As worked examples, we forecast the\nsensitivity of near-term and futuristic 21cm-[CII] cross-correlation\nmeasurements, providing recommendations for survey design.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}