{"id":"2407.07236","title":"A blazar in the epoch of reionization","authors":"Eduardo Banados, Emmanuel Momjian, Thomas Connor, Silvia Belladitta,\n  Roberto Decarli, Chiara Mazzucchelli, Bram P. Venemans, Fabian Walter, Feige\n  Wang, Zhang-Liang Xie, Aaron J. Barth, Anna-Christina Eilers, Xiaohui Fan,\n  Yana Khusanova, Jan-Torge Schindler, Daniel Stern, Jinyi Yang, Irham Taufik\n  Andika, Chris Carilli, Emanuele P. Farina, Andrew Fabian, Joseph F. Hennawi,\n  Antonio Pensabene, Sofia Rojas-Ruiz","authorsParsed":[["Banados","Eduardo",""],["Momjian","Emmanuel",""],["Connor","Thomas",""],["Belladitta","Silvia",""],["Decarli","Roberto",""],["Mazzucchelli","Chiara",""],["Venemans","Bram P.",""],["Walter","Fabian",""],["Wang","Feige",""],["Xie","Zhang-Liang",""],["Barth","Aaron J.",""],["Eilers","Anna-Christina",""],["Fan","Xiaohui",""],["Khusanova","Yana",""],["Schindler","Jan-Torge",""],["Stern","Daniel",""],["Yang","Jinyi",""],["Andika","Irham Taufik",""],["Carilli","Chris",""],["Farina","Emanuele P.",""],["Fabian","Andrew",""],["Hennawi","Joseph F.",""],["Pensabene","Antonio",""],["Rojas-Ruiz","Sofia",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 21:23:51 GMT"}],"updateDate":"2024-07-11","timestamp":1720560231000,"abstract":"  Relativistic jets are thought to play a crucial role in the formation of\nmassive galaxies and supermassive black holes. Here we report multi-wavelength\nand multi-epoch observations of the quasar VLASSJ0410-0139 at redshift z=7,\npowered by a 7e8 solar-mass black hole. Its radio variability, X-ray\nproperties, and compact radio emission on parsec scales reveal that J0410-0139\nis a blazar with a relativistic jet aligned with our line of sight. This\nblazar's existence implies that many more similar (unaligned) jetted sources\nmust exist at z=7. One scenario is that we observe an intrinsically low-power\nradio jet, but we see it at high luminosity due to relativistic beaming\neffects. In this case, a large fraction (>80%) of the UV bright quasars must\nhave a similar jet to match the number density expected from the UV quasar\nluminosity function. These jets can enhance the growth of supermassive black\nholes and substantially affect their host galaxies. However, the implications\nwould be even more severe if the quasar belongs to the top 10% radio luminous\nquasars, as measured if the beaming enhancement is less than a factor of 10-15.\nIn this scenario, there should be hundreds to thousands of radio-quiet quasars\nat z=7 with intrinsic properties similar to J0410-0139 -- in strong tension\nwith the number density of bright quasars derived from their UV luminosity\nfunction. To reconcile these results, most black hole growth at z=7 must happen\nin an obscured phase, as some models predict. The existence of supermassive\nblack holes in the epoch of reionization is facilitated by significant\njet-enhanced or obscured super-Eddington accretion.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}