{"id":"2407.16593","title":"A Comparative Study on Patient Language across Therapeutic Domains for\n  Effective Patient Voice Classification in Online Health Discussions","authors":"Giorgos Lysandrou, Roma English Owen, Vanja Popovic, Grant Le Brun,\n  Aryo Pradipta Gema, Beatrice Alex, Elizabeth A. L. Fairley","authorsParsed":[["Lysandrou","Giorgos",""],["Owen","Roma English",""],["Popovic","Vanja",""],["Brun","Grant Le",""],["Gema","Aryo Pradipta",""],["Alex","Beatrice",""],["Fairley","Elizabeth A. L.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 15:51:46 GMT"}],"updateDate":"2024-07-24","timestamp":1721749906000,"abstract":"  There exists an invisible barrier between healthcare professionals'\nperception of a patient's clinical experience and the reality. This barrier may\nbe induced by the environment that hinders patients from sharing their\nexperiences openly with healthcare professionals. As patients are observed to\ndiscuss and exchange knowledge more candidly on social media, valuable insights\ncan be leveraged from these platforms. However, the abundance of non-patient\nposts on social media necessitates filtering out such irrelevant content to\ndistinguish the genuine voices of patients, a task we refer to as patient voice\nclassification. In this study, we analyse the importance of linguistic\ncharacteristics in accurately classifying patient voices. Our findings\nunderscore the essential role of linguistic and statistical text similarity\nanalysis in identifying common patterns among patient groups. These results\nallude to even starker differences in the way patients express themselves at a\ndisease level and across various therapeutic domains. Additionally, we\nfine-tuned a pre-trained Language Model on the combined datasets with similar\nlinguistic patterns, resulting in a highly accurate automatic patient voice\nclassification. Being the pioneering study on the topic, our focus on\nextracting authentic patient experiences from social media stands as a crucial\nstep towards advancing healthcare standards and fostering a patient-centric\napproach.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"XOwYDk-iNrxzcSnytS6WVkGz1IhmMh7LLuYS_OC76WY","pdfSize":"820869","objectId":"0xaa03dce0d260d0a74a29136e162c7ba2b176c7bcd000951f934757ea6c9b3f0a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
