{"id":"2407.15328","title":"Iterative Ensemble Training with Anti-Gradient Control for Mitigating\n  Memorization in Diffusion Models","authors":"Xiao Liu, Xiaoliu Guan, Yu Wu, Jiaxu Miao","authorsParsed":[["Liu","Xiao",""],["Guan","Xiaoliu",""],["Wu","Yu",""],["Miao","Jiaxu",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 02:19:30 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 13:58:55 GMT"}],"updateDate":"2024-08-01","timestamp":1721614770000,"abstract":"  Diffusion models, known for their tremendous ability to generate novel and\nhigh-quality samples, have recently raised concerns due to their data\nmemorization behavior, which poses privacy risks. Recent approaches for memory\nmitigation either only focused on the text modality problem in cross-modal\ngeneration tasks or utilized data augmentation strategies. In this paper, we\npropose a novel training framework for diffusion models from the perspective of\nvisual modality, which is more generic and fundamental for mitigating\nmemorization. To facilitate forgetting of stored information in diffusion model\nparameters, we propose an iterative ensemble training strategy by splitting the\ndata into multiple shards for training multiple models and intermittently\naggregating these model parameters. Moreover, practical analysis of losses\nillustrates that the training loss for easily memorable images tends to be\nobviously lower. Thus, we propose an anti-gradient control method to exclude\nthe sample with a lower loss value from the current mini-batch to avoid\nmemorizing. Extensive experiments and analysis on four datasets are conducted\nto illustrate the effectiveness of our method, and results show that our method\nsuccessfully reduces memory capacity while even improving the performance\nslightly. Moreover, to save the computing cost, we successfully apply our\nmethod to fine-tune the well-trained diffusion models by limited epochs,\ndemonstrating the applicability of our method. Code is available in\nhttps://github.com/liuxiao-guan/IET_AGC.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}