{"id":"2407.06994","title":"The Evolution of Accreting Population III Stars at 10$^{-6}$-10$^3$\n  M$_\\odot$/yr","authors":"Devesh Nandal, Lorenz Zwick, Daniel J. Whalen, Lucio Mayer, Sylvia\n  Ekstr\\\"om, Georges Meynet","authorsParsed":[["Nandal","Devesh",""],["Zwick","Lorenz",""],["Whalen","Daniel J.",""],["Mayer","Lucio",""],["Ekström","Sylvia",""],["Meynet","Georges",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 16:10:06 GMT"}],"updateDate":"2024-07-11","timestamp":1720541406000,"abstract":"  The first stars formed over five orders of magnitude in mass by accretion in\nprimordial dark matter halos. We study the evolution of massive, very massive\nand supermassive primordial (Pop III) stars over nine orders of magnitude in\naccretion rate. We use the stellar evolution code GENEC to evolve accreting Pop\nIII stars from 10$^{-6}$ - 10$^3$ M$_\\odot$/yr and study how these rates\ndetermine final masses. The stars are evolved until either the end of central\nSi burning or until they encounter the general relativistic instability (GRI).\nWe also examine how metallicity affects the evolution of the stars. At rates\nbelow $2.5 x 10^{-5}$ M$_\\odot$/yr the final mass of the star falls below that\nrequired for pair-instability supernovae. The minimum rate required to produce\nblack holes with masses above 250 M$_\\odot$ is $5 x 10^{-5}$ M$_\\odot$/yr, well\nwithin the range of infall rates found in numerical simulations of halos that\ncool via H$_2$, $10^{-3}$ M$_\\odot$/yr. At rates of $5 x 10^{-5}$ M$_\\odot$/yr\nto $4 x 10^{-2}$ \\Ms\\ yr$^{-1}$, like those expected for halos cooling by both\nH$_2$ and Ly-alpha, the star collapses after Si burning. At higher accretion\nrates the GRI triggers the collapse of the star during central H burning. Stars\nthat grow at above these rates are cool red hypergiants with effective\ntemperatures $log(T_{\\text{eff}}) = 3.8$ and luminosities that can reach\n10$^{10.5}$ L$_\\odot$. At accretion rates of 100 - 1000 M$_\\odot$/yr the gas\nencounters the general relativistic instability prior to the onset of central\nhydrogen burning and collapses to a black hole with a mass of 10$^6$ M$_\\odot$\nwithout ever having become a star. We reveal for the first time the critical\ntransition rate in accretion above which catastrophic baryon collapse, like\nthat which can occur during galaxy collisions in the high-redshift Universe,\nproduces supermassive black holes via dark collapse.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-dfyLgTNqjZjEr5sWIASODBEFX2TA9ed4axx0H2M-fc","pdfSize":"18085185"}
