{"id":"2407.11419","title":"TeethDreamer: 3D Teeth Reconstruction from Five Intra-oral Photographs","authors":"Chenfan Xu, Zhentao Liu, Yuan Liu, Yulong Dou, Jiamin Wu, Jiepeng\n  Wang, Minjiao Wang, Dinggang Shen, Zhiming Cui","authorsParsed":[["Xu","Chenfan",""],["Liu","Zhentao",""],["Liu","Yuan",""],["Dou","Yulong",""],["Wu","Jiamin",""],["Wang","Jiepeng",""],["Wang","Minjiao",""],["Shen","Dinggang",""],["Cui","Zhiming",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 06:24:32 GMT"}],"updateDate":"2024-07-17","timestamp":1721111072000,"abstract":"  Orthodontic treatment usually requires regular face-to-face examinations to\nmonitor dental conditions of the patients. When in-person diagnosis is not\nfeasible, an alternative is to utilize five intra-oral photographs for remote\ndental monitoring. However, it lacks of 3D information, and how to reconstruct\n3D dental models from such sparse view photographs is a challenging problem. In\nthis study, we propose a 3D teeth reconstruction framework, named TeethDreamer,\naiming to restore the shape and position of the upper and lower teeth. Given\nfive intra-oral photographs, our approach first leverages a large diffusion\nmodel's prior knowledge to generate novel multi-view images with known poses to\naddress sparse inputs and then reconstructs high-quality 3D teeth models by\nneural surface reconstruction. To ensure the 3D consistency across generated\nviews, we integrate a 3D-aware feature attention mechanism in the reverse\ndiffusion process. Moreover, a geometry-aware normal loss is incorporated into\nthe teeth reconstruction process to enhance geometry accuracy. Extensive\nexperiments demonstrate the superiority of our method over current\nstate-of-the-arts, giving the potential to monitor orthodontic treatment\nremotely. Our code is available at\nhttps://github.com/ShanghaiTech-IMPACT/TeethDreamer\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}