{"id":"2407.17935","title":"Pfaffian structure of the eigenvector overlap for the symplectic Ginibre\n  ensemble","authors":"Gernot Akemann, Sung-Soo Byun, Kohei Noda","authorsParsed":[["Akemann","Gernot",""],["Byun","Sung-Soo",""],["Noda","Kohei",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 10:47:59 GMT"}],"updateDate":"2024-07-26","timestamp":1721904479000,"abstract":"  We study the integrable structure and scaling limits of the conditioned\neigenvector overlap of the symplectic Ginibre ensemble of Gaussian\nnon-Hermitian random matrices with independent quaternion elements. The average\nof the overlap matrix elements constructed from left and right eigenvectors,\nconditioned to $x$, are derived in terms of a Pfaffian determinant. Regarded as\na two-dimensional Coulomb gas with the Neumann boundary condition along the\nreal axis, it contains a kernel of skew-orthogonal polynomials with respect to\nthe weight function\n$\\omega^{(\\mathrm{over})}(z)=|z-\\overline{x}|^2(1+|z-x|^2)e^{-2|z|^2}$,\nincluding a non-trivial insertion of a point charge. The mean off-diagonal\noverlap is related to the diagonal (self-)overlap by a transposition, in\nanalogy to the complex Ginibre ensemble. For $x$ conditioned to the real line,\nextending previous results at $x=0$, we determine the skew-orthogonal\npolynomials and their skew-kernel with respect to\n$\\omega^{(\\mathrm{over})}(z)$. This is done in two steps and involves a\nChristoffel perturbation of the weight\n$\\omega^{(\\mathrm{over})}(z)=|z-\\overline{x}|^2\\omega^{(\\mathrm{pre})}(z)$, by\ncomputing first the corresponding quantities for the unperturbed weight\n$\\omega^{(\\mathrm{pre})}(z)$. Its kernel is shown to satisfy a differential\nequation at finite matrix size $N$. This allows us to take different large-$N$\nlimits, where we distinguish bulk and edge regime along the real axis. The\nlimiting mean diagonal overlaps and corresponding eigenvalue correlation\nfunctions of the point processes with respect to $\\omega^{(\\mathrm{over})}(z)$\nare determined. We also examine the effect on the planar orthogonal polynomials\nwhen changing the variance in $\\omega^{(\\mathrm{pre})}(z)$, as this appears in\nthe eigenvector statistics of the complex Ginibre ensemble.\n","subjects":["Physics/Mathematical Physics","Condensed Matter/Statistical Mechanics","Mathematics/Mathematical Physics","Mathematics/Probability"],"license":"http://creativecommons.org/licenses/by/4.0/"}