{"id":"2407.14002","title":"Derandomized Truncated D-vine Copula Knockoffs with e-values to control\n  the false discovery rate","authors":"Alejandro Rom\\'an V\\'asquez, Jos\\'e Ulises M\\'arquez Urbina, Graciela\n  Gonz\\'alez Far\\'ias, Gabriel Escarela","authorsParsed":[["Vásquez","Alejandro Román",""],["Urbina","José Ulises Márquez",""],["Farías","Graciela González",""],["Escarela","Gabriel",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 03:22:58 GMT"}],"updateDate":"2024-07-22","timestamp":1721359378000,"abstract":"  The Model-X knockoffs is a practical methodology for variable selection,\nwhich stands out from other selection strategies since it allows for the\ncontrol of the false discovery rate (FDR), relying on finite-sample guarantees.\nIn this article, we propose a Truncated D-vine Copula Knockoffs (TDCK)\nalgorithm for sampling approximate knockoffs from complex multivariate\ndistributions. Our algorithm enhances and improves features of previous\nattempts to sample knockoffs under the multivariate setting, with the three\nmain contributions being: 1) the truncation of the D-vine copula, which reduces\nthe dependence between the original variables and their corresponding\nknockoffs, improving the statistical power; 2) the employment of a\nstraightforward non-parametric formulation for marginal transformations,\neliminating the need for a specific parametric family or a kernel density\nestimator; 3) the use of the \"rvinecopulib'' R package offers better\nflexibility than the existing fitting vine copula knockoff methods. To\neliminate the randomness in distinct realizations resulting in different sets\nof selected variables, we wrap the TDCK method with an existing derandomizing\nprocedure for knockoffs, leading to a Derandomized Truncated D-vine Copula\nKnockoffs with e-values (DTDCKe) procedure. We demonstrate the robustness of\nthe DTDCKe procedure under various scenarios with extensive simulation studies.\nWe further illustrate its efficacy using a gene expression dataset, showing it\nachieves a more reliable gene selection than other competing methods, when the\nfindings are compared with those of a meta-analysis. The results indicate that\nour Truncated D-vine copula approach is robust and has superior power,\nrepresenting an appealing approach for variable selection in different\nmultivariate applications, particularly in gene expression analysis.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}