{"id":"2407.19369","title":"Magnon Confinement on the Two-Dimensional Penrose Lattice:\n  Perpendicular-Space Analysis of the Dynamic Structure Factor","authors":"Shoji Yamamoto and Takashi Inoue","authorsParsed":[["Yamamoto","Shoji",""],["Inoue","Takashi",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 02:37:34 GMT"}],"updateDate":"2024-08-05","timestamp":1722134254000,"abstract":"  Employing the spin-wave formalism within and beyond the harmonic-oscillator\napproximation, we study the dynamic structure factors of spin-$\\frac{1}{2}$\nnearest-neighbor quantum Heisenberg antiferromagnets on two-dimensional\nquasiperiodic lattices with particular emphasis on a magnetic analog to the\nwell-known confined states of a hopping Hamiltonian for independent electrons\non a two-dimensional Penrose lattice. We present comprehensive calculations on\nthe $\\mathbf{C}_{5\\mathrm{v}}$ Penrose tiling in comparison with the\n$\\mathbf{C}_{8\\mathrm{v}}$ Ammann-Beenker tiling, revealing their decagonal and\noctagonal antiferromagnetic microstructures. Their dynamic spin structure\nfactors both exhibit linear soft modes emergent at magnetic Bragg wavevectors\nand have nearly or fairly flat scattering bands, signifying magnetic\nexcitations localized in some way, at several different energies in a\nself-similar manner. In particular, the lowest-lying highly flat mode is\ndistinctive of the Penrose lattice, which is mediated by its unique\nantiferromagnons confined within tricoordinated sites only, unlike their\nitinerant electron counterparts involving pentacoordinated as well as\ntricoordinated sites. Bringing harmonic antiferromagnons into higher-order\nquantum interaction splits the lowest-lying nearly flat scattering band in two,\neach mediated by further confined antiferromagnons, which is fully demonstrated\nand throughly visualized in the perpendicular as well as real spaces. We\ndisclose superconfined antiferromagnons on the two-dimensional Penrose lattice.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}