{"id":"2407.12545","title":"Conspiracy theories and where to find them on TikTok","authors":"Francesco Corso, Francesco Pierri, Gianmarco De Francisci Morales","authorsParsed":[["Corso","Francesco",""],["Pierri","Francesco",""],["Morales","Gianmarco De Francisci",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 13:28:11 GMT"}],"updateDate":"2024-07-18","timestamp":1721222891000,"abstract":"  TikTok has skyrocketed in popularity over recent years, especially among\nyounger audiences, thanks to its viral trends and social challenges. However,\nconcerns have been raised about the potential of this platform to promote and\namplify online harmful and dangerous content. Leveraging the official TikTok\nResearch API and collecting a longitudinal dataset of 1.5M videos shared in the\nUS over a period of 3 years, our study analyzes the presence of videos\npromoting conspiracy theories, providing a lower-bound estimate of their\nprevalence (approximately 0.1% of all videos) and assessing the effects of the\nnew Creator Program, which provides new ways for creators to monetize, on the\nsupply of conspiratorial content. We evaluate the capabilities of\nstate-of-the-art open Large Language Models to identify conspiracy theories\nafter extracting audio transcriptions of videos, finding that they can detect\nharmful content with high precision but with overall performance comparable to\nfine-tuned traditional language models such as RoBERTa. Our findings are\ninstrumental for content moderation strategies that aim to understand and\nmitigate the spread of harmful content on rapidly evolving social media\nplatforms like TikTok.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3aRUkbGZHhcsolJtYu-NCSDwJxPHz6KJzuD0ZHxiw60","pdfSize":"1152859","objectId":"0x2f1c0e90f22cbd06196e3764df5a39bc4ab3cafe2e43a130a1c3d05dda3a9065","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
