{"id":"2407.14420","title":"Large electrically and chemically tunable Rashba-Dresselhaus effects in\n  Ferroelectric CsGeX$_3$ (X=Cl, Br, I) perovskites","authors":"Abduljelili Popoola, Nikhilesh Maity, Ravi Kashikar, S. Lisenkov, I.\n  Ponomareva","authorsParsed":[["Popoola","Abduljelili",""],["Maity","Nikhilesh",""],["Kashikar","Ravi",""],["Lisenkov","S.",""],["Ponomareva","I.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:43:33 GMT"}],"updateDate":"2024-07-22","timestamp":1721403813000,"abstract":"  Rashba-Dresselhaus effects, which originate from spin-orbit coupling and\nallow for spin manipulations, are actively explored in materials following the\npursuit of spintronics and quantum computing. However, materials that possess\npractically significant Rashba-Dresselhaus effects often contain toxic elements\nand offer little opportunity for tunability of the effects. We used\nfirst-principles simulations to reveal that the recently discovered halide\nferroelectrics in the CsGeX$_3$ (X=Cl, Br, I) family possess large and tunable\nRashba-Dresselhaus effects. In particular, they give origin to the spin\nsplitting of up to 171meV in valence band of CsGeI$_3$. The value is chemically\ntunable and can decrease by 25% and 70% for CsGeBr$_3$ and CsGeCl$_3$,\nrespectively. Such chemical tunability could result in engineering of desired\nvalues through solid solution technique. Application of electric field was\nfound to result in structural changes that could both decrease and increase\nspin splitting leading to electrical tunability of the effect. In the vicinity\nof conduction and valence band extrema, the spin textures are mostly of Rashba\ntype which is promising for spin-to-charge conversion applications. The spin\ndirections are coupled with the polarization direction leading to\nRashba-ferroelectricity co-functionality. Our work identifies lead-free\nperovskite halides as excellent candidates for spin-based applications and is\nlikely to stimulate further research in this direction.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}