{"id":"2407.07561","title":"FLAIR: Feeding via Long-horizon AcquIsition of Realistic dishes","authors":"Rajat Kumar Jenamani, Priya Sundaresan, Maram Sakr, Tapomayukh\n  Bhattacharjee, Dorsa Sadigh","authorsParsed":[["Jenamani","Rajat Kumar",""],["Sundaresan","Priya",""],["Sakr","Maram",""],["Bhattacharjee","Tapomayukh",""],["Sadigh","Dorsa",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 11:38:57 GMT"}],"updateDate":"2024-07-11","timestamp":1720611537000,"abstract":"  Robot-assisted feeding has the potential to improve the quality of life for\nindividuals with mobility limitations who are unable to feed themselves\nindependently. However, there exists a large gap between the homogeneous,\ncurated plates existing feeding systems can handle, and truly in-the-wild\nmeals. Feeding realistic plates is immensely challenging due to the sheer range\nof food items that a robot may encounter, each requiring specialized\nmanipulation strategies which must be sequenced over a long horizon to feed an\nentire meal. An assistive feeding system should not only be able to sequence\ndifferent strategies efficiently in order to feed an entire meal, but also be\nmindful of user preferences given the personalized nature of the task. We\naddress this with FLAIR, a system for long-horizon feeding which leverages the\ncommonsense and few-shot reasoning capabilities of foundation models, along\nwith a library of parameterized skills, to plan and execute user-preferred and\nefficient bite sequences. In real-world evaluations across 6 realistic plates,\nwe find that FLAIR can effectively tap into a varied library of skills for\nefficient food pickup, while adhering to the diverse preferences of 42\nparticipants without mobility limitations as evaluated in a user study. We\ndemonstrate the seamless integration of FLAIR with existing bite transfer\nmethods [19, 28], and deploy it across 2 institutions and 3 robots,\nillustrating its adaptability. Finally, we illustrate the real-world efficacy\nof our system by successfully feeding a care recipient with severe mobility\nlimitations. Supplementary materials and videos can be found at:\nhttps://emprise.cs.cornell.edu/flair .\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"D7R7cRGs6IXQR_k6dViBvB00d11cGU41z0LtdS-fnyM","pdfSize":"20598139","objectId":"0xa42b85e262bad8107f8ed5d55e0f4a405fa246bab81d07d58ee4d1834feb1ee5","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
