{"id":"2407.21539","title":"Unsteady slip pulses under spatially-varying prestress","authors":"Anna Pomyalov and Eran Bouchbinder","authorsParsed":[["Pomyalov","Anna",""],["Bouchbinder","Eran",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 11:53:29 GMT"}],"updateDate":"2024-08-01","timestamp":1722426809000,"abstract":"  It was recently established that self-healing slip pulses under uniform\nprestress $\\tau_b$ are unstable frictional rupture modes, i.e., they either\nslowly expand/decay with time t. Furthermore, their dynamics were shown to\nfollow a reduced-dimensionality description corresponding to a special $L(c)$\nline in a plane defined by the pulse propagation velocity $c(t)$ and size\n$L(t)$. Yet, uniform prestress is rather the exception than the rule in natural\nfaults. We study the effects of a spatially-varying prestress $\\tau_b(x)$ on 2D\nslip pulses, initially generated under a uniform $\\tau_b$ along a\nrate-and-state friction fault. We consider periodic and constant-gradient\nprestress $\\tau_b(x)$ around the reference uniform $\\tau_b$. For a periodic\n$\\tau_b(x)$, pulses either sustain and form quasi-limit cycles in the $L-c$\nplane or decay predominantly monotonically along the $L(c)$ line, depending on\nthe instability index of the initial pulse and the properties of the periodic\n$\\tau_b(x)$. For a constant-gradient $\\tau_b(x)$, expanding/decaying pulses\nclosely follow the $L(c)$ line, with systematic shifts determined by the sign\nand magnitude of the gradient. We also find that a spatially-varying\n$\\tau_b(x)$ can revert the expanding/decaying nature of the initial reference\npulse. Finally, we show that a constant-gradient $\\tau_b(x)$, of sufficient\nmagnitude and specific sign, can lead to the nucleation of a back-propagating\nrupture at the healing tail of the initial pulse, generating a bilateral\ncrack-like rupture. This pulse-to-crack transition, along with the\nabove-described effects, demonstrate that rich rupture dynamics merge from a\nsimple, nonuniform prestress. Furthermore, we show that as long as pulses\nexist, their dynamics are related to the special $L(c)$ line, providing an\neffective, reduced-dimensionality description of unsteady slip pulses under\nspatially-varying prestress.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Soft Condensed Matter","Nonlinear Sciences/Pattern Formation and Solitons","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}