{"id":"2407.14710","title":"Universally Harmonizing Differential Privacy Mechanisms for Federated\n  Learning: Boosting Accuracy and Convergence","authors":"Shuya Feng, Meisam Mohammady, Hanbin Hong, Shenao Yan, Ashish Kundu,\n  Binghui Wang, Yuan Hong","authorsParsed":[["Feng","Shuya",""],["Mohammady","Meisam",""],["Hong","Hanbin",""],["Yan","Shenao",""],["Kundu","Ashish",""],["Wang","Binghui",""],["Hong","Yuan",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 00:11:59 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 01:15:40 GMT"}],"updateDate":"2024-07-25","timestamp":1721434319000,"abstract":"  Differentially private federated learning (DP-FL) is a promising technique\nfor collaborative model training while ensuring provable privacy for clients.\nHowever, optimizing the tradeoff between privacy and accuracy remains a\ncritical challenge. To our best knowledge, we propose the first DP-FL framework\n(namely UDP-FL), which universally harmonizes any randomization mechanism\n(e.g., an optimal one) with the Gaussian Moments Accountant (viz. DP-SGD) to\nsignificantly boost accuracy and convergence. Specifically, UDP-FL demonstrates\nenhanced model performance by mitigating the reliance on Gaussian noise. The\nkey mediator variable in this transformation is the R\\'enyi Differential\nPrivacy notion, which is carefully used to harmonize privacy budgets. We also\npropose an innovative method to theoretically analyze the convergence for DP-FL\n(including our UDP-FL ) based on mode connectivity analysis. Moreover, we\nevaluate our UDP-FL through extensive experiments benchmarked against\nstate-of-the-art (SOTA) methods, demonstrating superior performance on both\nprivacy guarantees and model performance. Notably, UDP-FL exhibits substantial\nresilience against different inference attacks, indicating a significant\nadvance in safeguarding sensitive data in federated learning environments.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}