{"id":"2407.07274","title":"Angular anisotropy of secondary neutron spectra in $^{232}$Th+n","authors":"V.M. Maslov","authorsParsed":[["Maslov","V. M.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 11:27:50 GMT"}],"updateDate":"2024-07-11","timestamp":1720438070000,"abstract":"  Neutron emission spectra (NES) of $^{232}$Th+n interaction provide strong\nevidence of angular anisotropy of secondary neutron emission, another evidence\nmight be predicted in $^{232}$Th%(n,F)% prompt fission neutron spectra (PFNS).\nIn case of NES observed angular anisotropy is presumably due to angular\ndependence of elastic scattering, direct excitation of collective levels and\npreequilibrium emission of (n,nX) neutrons. In $^{232}$Th+n direct excitation\ndata analysis, ground state band levels are coupled within rigid rotator model,\nwhile those of beta bands, gamma bands and octupole band theta are coupled\nwithin soft deformable rotator model. NES of $^{232}$Th+n at En of 6, 12, 14,\n18 MeV exhaustively described. The net effect of these procedures for En up to\n20 MeV is the adequate approximation of angular distributions of\n$^{232}$Th$(n,nX)$ first neutron inelastic scattering in continuum, which\ncorresponds to U of 1.2-6 MeV excitations of $^{232}$Th.\n  The contribution of $^{232}$Th$(n,F)$ PFNS to the NES is exceptionally low.\nPFNS anisotropy occurs because some portion of $(n,nX)$ neutrons might be\ninvolved in exclusive prefission neutron spectra. In $^{232}$Th$(n,xnf)$\nreactions PFNS demonstrate different response to forward and backward (n,xnf)\nneutron emission relative to the incident neutron momentum, when compared with\n$^{235}$U$(n,xnf)$ or 239Pu(n,xnf) reactions. Average energy of (n,xnf)\nneutrons depends on the neutron emission angle theta, i.e. fission cross\nsection, prompt neutron number and total kinetic energy are shown to vary with\nthe angle theta as well. Exclusive neutron spectra ($n,xnf)$ at theta equal to\n90 degrees are consistent with observed $^{232}$Th$(n,F)$ and\n$^{232}$Th$(n,xn)$ reaction cross sections within En from 1 to 20 MeV energy\nrange.\n","subjects":["Physics/Nuclear Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}