{"id":"2407.12538","title":"High Frequency Matters: Uncertainty Guided Image Compression with\n  Wavelet Diffusion","authors":"Juan Song, Jiaxiang He, Mingtao Feng, Keyan Wang, Yunsong Li and Ajmal\n  Mian","authorsParsed":[["Song","Juan",""],["He","Jiaxiang",""],["Feng","Mingtao",""],["Wang","Keyan",""],["Li","Yunsong",""],["Mian","Ajmal",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 13:21:31 GMT"}],"updateDate":"2024-07-18","timestamp":1721222491000,"abstract":"  Diffusion probabilistic models have recently achieved remarkable success in\ngenerating high-quality images. However, balancing high perceptual quality and\nlow distortion remains challenging in image compression applications. To\naddress this issue, we propose an efficient Uncertainty-Guided image\ncompression approach with wavelet Diffusion (UGDiff). Our approach focuses on\nhigh frequency compression via the wavelet transform, since high frequency\ncomponents are crucial for reconstructing image details. We introduce a wavelet\nconditional diffusion model for high frequency prediction, followed by a\nresidual codec that compresses and transmits prediction residuals to the\ndecoder. This diffusion prediction-then-residual compression paradigm\neffectively addresses the low fidelity issue common in direct reconstructions\nby existing diffusion models. Considering the uncertainty from the random\nsampling of the diffusion model, we further design an uncertainty-weighted\nrate-distortion (R-D) loss tailored for residual compression, providing a more\nrational trade-off between rate and distortion. Comprehensive experiments on\ntwo benchmark datasets validate the effectiveness of UGDiff, surpassing\nstate-of-the-art image compression methods in R-D performance, perceptual\nquality, subjective quality, and inference time. Our code is available at:\nhttps://github.com/hejiaxiang1/Wavelet-Diffusion/tree/main\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}