{"id":"2407.02685","title":"Open Panoramic Segmentation","authors":"Junwei Zheng, Ruiping Liu, Yufan Chen, Kunyu Peng, Chengzhi Wu, Kailun\n  Yang, Jiaming Zhang, and Rainer Stiefelhagen","authorsParsed":[["Zheng","Junwei",""],["Liu","Ruiping",""],["Chen","Yufan",""],["Peng","Kunyu",""],["Wu","Chengzhi",""],["Yang","Kailun",""],["Zhang","Jiaming",""],["Stiefelhagen","Rainer",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 22:00:32 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 22:29:05 GMT"}],"updateDate":"2024-07-15","timestamp":1719957632000,"abstract":"  Panoramic images, capturing a 360{\\deg} field of view (FoV), encompass\nomnidirectional spatial information crucial for scene understanding. However,\nit is not only costly to obtain training-sufficient dense-annotated panoramas\nbut also application-restricted when training models in a close-vocabulary\nsetting. To tackle this problem, in this work, we define a new task termed Open\nPanoramic Segmentation (OPS), where models are trained with FoV-restricted\npinhole images in the source domain in an open-vocabulary setting while\nevaluated with FoV-open panoramic images in the target domain, enabling the\nzero-shot open panoramic semantic segmentation ability of models. Moreover, we\npropose a model named OOOPS with a Deformable Adapter Network (DAN), which\nsignificantly improves zero-shot panoramic semantic segmentation performance.\nTo further enhance the distortion-aware modeling ability from the pinhole\nsource domain, we propose a novel data augmentation method called Random\nEquirectangular Projection (RERP) which is specifically designed to address\nobject deformations in advance. Surpassing other state-of-the-art\nopen-vocabulary semantic segmentation approaches, a remarkable performance\nboost on three panoramic datasets, WildPASS, Stanford2D3D, and Matterport3D,\nproves the effectiveness of our proposed OOOPS model with RERP on the OPS task,\nespecially +2.2% on outdoor WildPASS and +2.4% mIoU on indoor Stanford2D3D. The\nsource code is publicly available at\nhttps://junweizheng93.github.io/publications/OPS/OPS.html.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}