{"id":"2407.13111","title":"PG-Attack: A Precision-Guided Adversarial Attack Framework Against\n  Vision Foundation Models for Autonomous Driving","authors":"Jiyuan Fu, Zhaoyu Chen, Kaixun Jiang, Haijing Guo, Shuyong Gao,\n  Wenqiang Zhang","authorsParsed":[["Fu","Jiyuan",""],["Chen","Zhaoyu",""],["Jiang","Kaixun",""],["Guo","Haijing",""],["Gao","Shuyong",""],["Zhang","Wenqiang",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 02:39:31 GMT"}],"updateDate":"2024-07-19","timestamp":1721270371000,"abstract":"  Vision foundation models are increasingly employed in autonomous driving\nsystems due to their advanced capabilities. However, these models are\nsusceptible to adversarial attacks, posing significant risks to the reliability\nand safety of autonomous vehicles. Adversaries can exploit these\nvulnerabilities to manipulate the vehicle's perception of its surroundings,\nleading to erroneous decisions and potentially catastrophic consequences. To\naddress this challenge, we propose a novel Precision-Guided Adversarial Attack\n(PG-Attack) framework that combines two techniques: Precision Mask Perturbation\nAttack (PMP-Attack) and Deceptive Text Patch Attack (DTP-Attack). PMP-Attack\nprecisely targets the attack region to minimize the overall perturbation while\nmaximizing its impact on the target object's representation in the model's\nfeature space. DTP-Attack introduces deceptive text patches that disrupt the\nmodel's understanding of the scene, further enhancing the attack's\neffectiveness. Our experiments demonstrate that PG-Attack successfully deceives\na variety of advanced multi-modal large models, including GPT-4V, Qwen-VL, and\nimp-V1. Additionally, we won First-Place in the CVPR 2024 Workshop Challenge:\nBlack-box Adversarial Attacks on Vision Foundation Models and codes are\navailable at https://github.com/fuhaha824/PG-Attack.\n","subjects":["Computing Research Repository/Multimedia","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}