{"id":"2407.13095","title":"Audio-visual Generalized Zero-shot Learning the Easy Way","authors":"Shentong Mo, Pedro Morgado","authorsParsed":[["Mo","Shentong",""],["Morgado","Pedro",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 01:57:16 GMT"}],"updateDate":"2024-07-19","timestamp":1721267836000,"abstract":"  Audio-visual generalized zero-shot learning is a rapidly advancing domain\nthat seeks to understand the intricate relations between audio and visual cues\nwithin videos. The overarching goal is to leverage insights from seen classes\nto identify instances from previously unseen ones. Prior approaches primarily\nutilized synchronized auto-encoders to reconstruct audio-visual attributes,\nwhich were informed by cross-attention transformers and projected text\nembeddings. However, these methods fell short of effectively capturing the\nintricate relationship between cross-modal features and class-label embeddings\ninherent in pre-trained language-aligned embeddings. To circumvent these\nbottlenecks, we introduce a simple yet effective framework for Easy\nAudio-Visual Generalized Zero-shot Learning, named EZ-AVGZL, that aligns\naudio-visual embeddings with transformed text representations. It utilizes a\nsingle supervised text audio-visual contrastive loss to learn an alignment\nbetween audio-visual and textual modalities, moving away from the conventional\napproach of reconstructing cross-modal features and text embeddings. Our key\ninsight is that while class name embeddings are well aligned with\nlanguage-based audio-visual features, they don't provide sufficient class\nseparation to be useful for zero-shot learning. To address this, our method\nleverages differential optimization to transform class embeddings into a more\ndiscriminative space while preserving the semantic structure of language\nrepresentations. We conduct extensive experiments on VGGSound-GZSL, UCF-GZSL,\nand ActivityNet-GZSL benchmarks. Our results demonstrate that our EZ-AVGZL\nachieves state-of-the-art performance in audio-visual generalized zero-shot\nlearning.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Computing Research Repository/Multimedia","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}