{"id":"2407.13814","title":"Building Population-Informed Priors for Bayesian Inference Using\n  Data-Consistent Stochastic Inversion","authors":"Rebekah D. White, John D. Jakeman, Tim Wildey, Troy Butler","authorsParsed":[["White","Rebekah D.",""],["Jakeman","John D.",""],["Wildey","Tim",""],["Butler","Troy",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:37:10 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 17:35:12 GMT"}],"updateDate":"2024-07-23","timestamp":1721320630000,"abstract":"  Bayesian inference provides a powerful tool for leveraging observational data\nto inform model predictions and uncertainties. However, when such data is\nlimited, Bayesian inference may not adequately constrain uncertainty without\nthe use of highly informative priors. Common approaches for constructing\ninformative priors typically rely on either assumptions or knowledge of the\nunderlying physics, which may not be available in all scenarios. In this work,\nwe consider the scenario where data are available on a population of\nassets/individuals, which occurs in many problem domains such as biomedical or\ndigital twin applications, and leverage this population-level data to\nsystematically constrain the Bayesian prior and subsequently improve\nindividualized inferences. The approach proposed in this paper is based upon a\nrecently developed technique known as data-consistent inversion (DCI) for\nconstructing a pullback probability measure. Succinctly, we utilize DCI to\nbuild population-informed priors for subsequent Bayesian inference on\nindividuals. While the approach is general and applies to nonlinear maps and\narbitrary priors, we prove that for linear inverse problems with Gaussian\npriors, the population-informed prior produces an increase in the information\ngain as measured by the determinant and trace of the inverse posterior\ncovariance. We also demonstrate that the Kullback-Leibler divergence often\nimproves with high probability. Numerical results, including linear-Gaussian\nexamples and one inspired by digital twins for additively manufactured assets,\nindicate that there is significant value in using these population-informed\npriors.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"g6iFJSwx8vV2QOAKzawKRh7ImY84hSrTIyxdyFBhi68","pdfSize":"2286601","objectId":"0x19adb7483d31e21054987e6491ab1830327c8a26235b37c7264a7b2c2a5b35c2","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
