{"id":"2407.02958","title":"Finding Spanning Trees with Perfect Matchings","authors":"Krist\\'of B\\'erczi, Tam\\'as Kir\\'aly, Yusuke Kobayashi, Yutaro\n  Yamaguchi, Yu Yokoi","authorsParsed":[["Bérczi","Kristóf",""],["Király","Tamás",""],["Kobayashi","Yusuke",""],["Yamaguchi","Yutaro",""],["Yokoi","Yu",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 09:52:00 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 07:27:54 GMT"}],"updateDate":"2024-07-12","timestamp":1720000320000,"abstract":"  We investigate the tractability of a simple fusion of two fundamental\nstructures on graphs, a spanning tree and a perfect matching. Specifically, we\nconsider the following problem: given an edge-weighted graph, find a\nminimum-weight spanning tree among those containing a perfect matching. On the\npositive side, we design a simple greedy algorithm for the case when the graph\nis complete (or complete bipartite) and the edge weights take at most two\nvalues. On the negative side, the problem is NP-hard even when the graph is\ncomplete (or complete bipartite) and the edge weights take at most three\nvalues, or when the graph is cubic, planar, and bipartite and the edge weights\ntake at most two values.\n  We also consider an interesting variant. We call a tree strongly balanced if\non one side of the bipartition of the vertex set with respect to the tree, all\nbut one of the vertices have degree $2$ and the remaining one is a leaf. This\nproperty is a sufficient condition for a tree to have a perfect matching, which\nenjoys an additional property. When the underlying graph is bipartite, strongly\nbalanced spanning trees can be written as matroid intersection, and this fact\nwas recently utilized to design an approximation algorithm for some kind of\nconnectivity augmentation problem. The natural question is its tractability in\nnonbipartite graphs. As a negative answer, it turns out NP-hard to test whether\na given graph has a strongly balanced spanning tree or not even when the graph\nis subcubic and planar.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Mathematics/Combinatorics"],"license":"http://creativecommons.org/licenses/by/4.0/"}