{"id":"2407.10299","title":"Follow the Rules: Reasoning for Video Anomaly Detection with Large\n  Language Models","authors":"Yuchen Yang, Kwonjoon Lee, Behzad Dariush, Yinzhi Cao, Shao-Yuan Lo","authorsParsed":[["Yang","Yuchen",""],["Lee","Kwonjoon",""],["Dariush","Behzad",""],["Cao","Yinzhi",""],["Lo","Shao-Yuan",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 19:23:12 GMT"},{"version":"v2","created":"Sat, 20 Jul 2024 07:56:47 GMT"}],"updateDate":"2024-07-23","timestamp":1720984992000,"abstract":"  Video Anomaly Detection (VAD) is crucial for applications such as security\nsurveillance and autonomous driving. However, existing VAD methods provide\nlittle rationale behind detection, hindering public trust in real-world\ndeployments. In this paper, we approach VAD with a reasoning framework.\nAlthough Large Language Models (LLMs) have shown revolutionary reasoning\nability, we find that their direct use falls short of VAD. Specifically, the\nimplicit knowledge pre-trained in LLMs focuses on general context and thus may\nnot apply to every specific real-world VAD scenario, leading to inflexibility\nand inaccuracy. To address this, we propose AnomalyRuler, a novel rule-based\nreasoning framework for VAD with LLMs. AnomalyRuler comprises two main stages:\ninduction and deduction. In the induction stage, the LLM is fed with few-shot\nnormal reference samples and then summarizes these normal patterns to induce a\nset of rules for detecting anomalies. The deduction stage follows the induced\nrules to spot anomalous frames in test videos. Additionally, we design rule\naggregation, perception smoothing, and robust reasoning strategies to further\nenhance AnomalyRuler's robustness. AnomalyRuler is the first reasoning approach\nfor the one-class VAD task, which requires only few-normal-shot prompting\nwithout the need for full-shot training, thereby enabling fast adaption to\nvarious VAD scenarios. Comprehensive experiments across four VAD benchmarks\ndemonstrate AnomalyRuler's state-of-the-art detection performance and reasoning\nability. AnomalyRuler is open-source and available at:\nhttps://github.com/Yuchen413/AnomalyRuler\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}