{"id":"2407.15072","title":"Identification of new gold lines in the 350 to 1000 nm spectral region\n  using laser produced plasmas","authors":"M. Charlwood, S. Chaurasia, M. McCann, C. Ballance, D. Riley and F. P.\n  Keenan","authorsParsed":[["Charlwood","M.",""],["Chaurasia","S.",""],["McCann","M.",""],["Ballance","C.",""],["Riley","D.",""],["Keenan","F. P.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 06:19:36 GMT"}],"updateDate":"2024-07-23","timestamp":1721542776000,"abstract":"  We present results from a pilot study, using a laser-produced plasma, to\nidentify new lines in the 350 to 1000 nm spectral region for the r-process\nelement gold (Au), of relevance to studies of neutron star mergers. This was\nachieved via optical-IR spectroscopy of a laser-produced Au plasma, with an Au\ntarget of high purity (99.95 %) and a low vacuum pressure to remove any air\ncontamination from the experimental spectra. Our data were recorded with a\nspectrometer of 750 mm focal length and 1200 lines mm-1 grating, yielding a\nresolution of 0.04 nm. We find 54 lines not previously identified and which are\nnot due to the impurities (principally copper (Cu) and silver (Ag)) in our Au\nsample. Of these 54 lines, we provisionally match 21 strong transitions to\ntheoretical results from collisional-radiative models that include energy\nlevels derived from atomic structure calculations up to the 6s level. Some of\nthe remaining 33 unidentified lines in our spectra are also strong and may be\ndue to transitions involving energy levels which are higher-lying than those in\nour plasma models. Nevertheless, our experiments demonstrate that\nlaser-produced plasmas are well suited to the identification of transitions in\nr-process elements, with the method applicable to spectra ranging from UV to IR\nwavelengths.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Atomic Physics","Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}