{"id":"2407.11523","title":"Improved Belief Propagation Decoding Algorithms for Surface Codes","authors":"Jiahan Chen, Zhengzhong Yi, Zhipeng Liang, Xuan Wang","authorsParsed":[["Chen","Jiahan",""],["Yi","Zhengzhong",""],["Liang","Zhipeng",""],["Wang","Xuan",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 09:03:06 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 17:25:55 GMT"},{"version":"v3","created":"Sat, 3 Aug 2024 05:45:27 GMT"}],"updateDate":"2024-08-06","timestamp":1721120586000,"abstract":"  Quantum error correction is crucial for universal fault-tolerant quantum\ncomputing. Highly accurate and low-time-complexity decoding algorithms play an\nindispensable role in making sure quantum error correction works. Among\nexisting decoding algorithms, belief propagation (BP) is notable for its nearly\nlinear time complexity and general applicability to stabilizer codes. However,\nBP's decoding accuracy without post-processing is unsatisfactory in most\nsituations. This article focuses on improving the decoding accuracy of BP over\nGF(4) for surface codes. We first propose Momentum-BP and AdaGrad-BP, inspired\nby machine learning optimization techniques, to reduce oscillation in message\nupdating and break the symmetric trapping sets. We further propose EWAInit-BP,\nwhich adaptively updates initial probabilities and provides a 1 to 3 orders of\nmagnitude improvement over traditional BP for planar surface code, toric code,\nand XZZX surface code without any post-processing method, showing high decoding\naccuracy even under parallel scheduling. The theoretical $O(1)$ time complexity\nunder parallel scheduling and high accuracy of EWAInit-BP make it a promising\ncandidate for high-precision real-time decoders. Meanwhile, the ideas of the\nMomentum-BP, AdaGrad-BP and EWAInit-BP provide promising approaches to improve\nthe decoding accuracy of BP to get rid of its reliance on post-processing.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}