{"id":"2407.09010","title":"Estimation of projection effects in the polar magnetic field\n  measurements from the ecliptic view","authors":"Sanjay Gosain and Han Uitenbroek","authorsParsed":[["Gosain","Sanjay",""],["Uitenbroek","Han",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 06:01:02 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 17:01:14 GMT"}],"updateDate":"2024-07-26","timestamp":1720764062000,"abstract":"  The distribution and evolution of the magnetic field at the solar poles\nthrough a solar cycle is an important parameter in understanding the solar\ndynamo. The accurate observations of the polar magnetic flux is very\nchallenging from the ecliptic view, mainly due to (a) geometric foreshortening\nwhich limits the spatial resolution, and (b) the oblique view of predominantly\nvertical magnetic flux elements, which presents rather small line-of-sight\ncomponent of the magnetic field towards the ecliptic. Due to these effects the\npolar magnetic flux is poorly measured. Depending upon the measurement\ntechnique, longitudinal versus full vector field measurement, where the latter\nis extremely sensitive to the SNR achieved and azimuth disamiguation problem,\nthe polar magnetic flux measurements could be underestimated or overestimated.\nTo estimate the extent of systematic errors in magetic flux measurements at the\nsolar poles due to aforementioned projection effects we use MHD simulations of\nquiet sun network as a reference solar atmosphere. Using the numerical model of\nthe solar atmosphere we simulate the observations from the ecliptic as well as\nfrom out-of-ecliptic vantage points, such as from a solar polar orbit at\nvarious heliographic latitudes. Using these simulated observations we make an\nassessment of the systematic errors in our measurements of the magnetic flux\ndue to projection effects and the extent of under- or over estimation. We\nsuggest that such effects could contribute to reported missing open magnetic\nflux in the heliosphere and that the multi-viewpoint observations from\nout-of-the-ecliptic plane together with innovative Compact Doppler\nMagnetographs provide the best bet for the future measurements.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8NEiHjWsFEW_J90MvZ5FUJ8EQgtN5XNtjOFkmfXQiYc","pdfSize":"2091570","objectId":"0x77e4bd771727661d2ff6e29e35f5b35d253210e51a3cfb8bb9b08c0109e9b60d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
