{"id":"2407.00384","title":"A Markovian description of the multi-level source function and its\n  application to the Lyman series in the Sun","authors":"K. Krikova, T. M. D. Pereira","authorsParsed":[["Krikova","K.",""],["Pereira","T. M. D.",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 09:51:52 GMT"}],"updateDate":"2024-07-02","timestamp":1719654712000,"abstract":"  Aims. We introduce a new method to calculate and interpret indirect\ntransition rates populating atomic levels using Markov chain theory. Indirect\ntransition rates are essential to evaluate interlocking in a multi-level source\nfunction, which quantifies all the processes that add and remove photons from a\nspectral line. A better understanding of the multi-level source function is\ncentral to interpret optically thick spectral line formation in stellar\natmospheres, especially outside local thermodynamical equilibrium (LTE).\nMethods. We compute the level populations from a hydrogen model atom in\nstatistical equilibrium, using the solar FALC model, a 1D static atmosphere.\nFrom the transition rates, we reconstruct the multi-level source function using\nour new method and compare it with existing methods to build the source\nfunction. We focus on the Lyman series lines and analyze the different\ncontributions to the source functions and synthetic spectra. Results. Absorbing\nMarkov chains can represent the level-ratio solution of the statistical\nequilibrium equation and can therefore be used to calculate the indirect\ntransition rates between the upper and lower levels of an atomic transition.\nOur description of the multi-level source function allows a more physical\ninterpretation of its individual terms, particularly a quantitative view of\ninterlocking. For the Lyman lines in the FALC atmosphere, we find that\ninterlocking becomes increasingly important with order in the series, with\nLy-{\\alpha} showing very little, but Ly-\\b{eta} nearly 50% and Ly-{\\gamma}\nabout 60% contribution coming from interlocking. In some cases, this view seems\nopposed to the conventional wisdom that these lines are mostly scattering, and\nwe discuss the reasons why.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Qc53VSPbnkQnVjPvS7zvDhVlFP9Xnq_gcD7AxzduHSE","pdfSize":"663660"}
