{"id":"2407.07281","title":"Decentralized Droop-based Finite-Control-Set Model Predictive Control of\n  Inverter-based Resources in Islanded AC Microgrid","authors":"Ayobami Olajube, Koto Omiloli, Satish Vedula and Olugbenga Anubi","authorsParsed":[["Olajube","Ayobami",""],["Omiloli","Koto",""],["Vedula","Satish",""],["Anubi","Olugbenga",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 00:13:20 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 18:16:54 GMT"}],"updateDate":"2024-07-31","timestamp":1720570400000,"abstract":"  This paper presents an improved droop control method to ensure effective\npower sharing, voltage regulation, and frequency stabilization of\ninverter-based resources (IBRs) connected in parallel in an islanded AC\nmicrogrid. In the contemporary droop control algorithm, the distance between\nconnected inverters affects the effectiveness of the active power-frequency and\nthe reactive power-voltage droop characteristics which results in poor power\nsharing at the primary level of the microgrid. That is, high impedance\nemanating from long transmission lines results in instability, poor voltage\ntracking, and ineffective frequency regulation. Hence, in this work, we use a\nfinite-control-set model predictive controller (FCS-MPC) in the inner loop,\nwhich gives efficient voltage tracking, good frequency regulation, and faster\nperformance response. FCS-MPC is easy to implement in fast switching converters\nand does not suffer from computational burden unlike the continuous-set MPC and\nis also devoid of issues of multiple-loop, parameter variation, and slow\nresponse associated with conventional droop control methods. We derived the\ncondition for bounded stability for the FCS-MPC and the proposed method is\ntested via a numerical simulation on three IBRs. The results show effective\npower sharing, capacitor voltage tracking, and efficient frequency regulation\nwith reduced oscillations to changes in load.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"F9PNjJmJ-mbooO2orCvkmryWrJ6wgex7L5lP1nBVRD4","pdfSize":"1300610"}
