{"id":"2407.21125","title":"A Dataset for Multi-intensity Continuous Human Activity Recognition\n  through Passive Sensing","authors":"Argha Sen, Anirban Das, Swadhin Pradhan, Sandip Chakraborty","authorsParsed":[["Sen","Argha",""],["Das","Anirban",""],["Pradhan","Swadhin",""],["Chakraborty","Sandip",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 18:35:08 GMT"}],"updateDate":"2024-08-01","timestamp":1722364508000,"abstract":"  Human activity recognition (HAR) is essential in healthcare, elder care,\nsecurity, and human-computer interaction. The use of precise sensor data to\nidentify activities passively and continuously makes HAR accessible and\nubiquitous. Specifically, millimeter wave (mmWave) radar is promising for\npassive and continuous HAR due to its ability to penetrate non-metallic\nmaterials and provide high-resolution wireless sensing. Although mmWave sensors\nare effective at capturing macro-scale activities, like exercising, they fail\nto capture micro-scale activities, such as typing. In this paper, we introduce\nmmDoppler, a novel dataset that utilizes off-the-shelf (COTS) mmWave radar in\norder to capture both macro and micro-scale human movements using a\nmachine-learning driven signal processing pipeline. The dataset includes seven\nsubjects performing 19 distinct activities and employs adaptive doppler\nresolution to enhance activity recognition. By adjusting the radar's doppler\nresolution based on the activity type, our system captures subtle movements\nmore precisely. mmDoppler includes range-doppler heatmaps, offering detailed\nmotion dynamics, with data collected in a controlled environment with single as\nwell as multiple subjects performing activities simultaneously. The dataset\naims to bridge the gap in HAR systems by providing a more comprehensive and\ndetailed resource for improving the robustness and accuracy of mmWave radar\nactivity recognition.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"XOcru9v5fXVOYOe4JwqQqYar_iiitKmeNrIldmO1BuU","pdfSize":"7728564"}
