{"id":"2407.08343","title":"Many wrong models approach to localize an odor source in turbulence:\n  introducing the weighted Bayesian update","authors":"Lorenzo Piro, Robin A. Heinonen, Massimo Cencini, Luca Biferale","authorsParsed":[["Piro","Lorenzo",""],["Heinonen","Robin A.",""],["Cencini","Massimo",""],["Biferale","Luca",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 09:47:50 GMT"}],"updateDate":"2024-07-12","timestamp":1720691270000,"abstract":"  The problem of locating an odor source in turbulent environments is central\nto key applications such as environmental monitoring and disaster response. We\naddress this challenge by designing an algorithm based on Bayesian inference,\nwhich uses odor measurements from an ensemble of static sensors to estimate the\nsource position through a stochastic model of the environment. Given the\npractical impossibility of achieving a fully consistent turbulent model and\nguaranteeing convergence to the correct solution, we propose a method to rank\n'many wrong models' and to blend their predictions. We evaluate our weighted\nBayesian update algorithm by its ability to estimate the source location with\npredefined accuracy and/or within a specified time frame, and compare it to\nstandard Monte Carlo sampling methods. To demonstrate the robustness and\npotential applications of both approaches under realistic environmental\nconditions, we use high-quality direct numerical simulations of the\nNavier-Stokes equations to mimic the transport of odors in the atmospheric\nboundary layer. Despite minimal prior information about the source and\nenvironmental conditions, our proposed approach consistently proves to be more\naccurate, reliable, and robust than Monte Carlo methods, thus showing promise\nas a new tool for addressing the odor source localization problem in real-world\nscenarios.\n","subjects":["Physics/Fluid Dynamics","Physics/Atmospheric and Oceanic Physics","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ybj_a6d5aTrcMPgrUfu6H5FhlYc27Fh2sBVWzIbtDcw","pdfSize":"2025841"}
