{"id":"2407.14020","title":"NeuroBind: Towards Unified Multimodal Representations for Neural Signals","authors":"Fengyu Yang, Chao Feng, Daniel Wang, Tianye Wang, Ziyao Zeng, Zhiyang\n  Xu, Hyoungseob Park, Pengliang Ji, Hanbin Zhao, Yuanning Li, Alex Wong","authorsParsed":[["Yang","Fengyu",""],["Feng","Chao",""],["Wang","Daniel",""],["Wang","Tianye",""],["Zeng","Ziyao",""],["Xu","Zhiyang",""],["Park","Hyoungseob",""],["Ji","Pengliang",""],["Zhao","Hanbin",""],["Li","Yuanning",""],["Wong","Alex",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 04:42:52 GMT"}],"updateDate":"2024-07-22","timestamp":1721364172000,"abstract":"  Understanding neural activity and information representation is crucial for\nadvancing knowledge of brain function and cognition. Neural activity, measured\nthrough techniques like electrophysiology and neuroimaging, reflects various\naspects of information processing. Recent advances in deep neural networks\noffer new approaches to analyzing these signals using pre-trained models.\nHowever, challenges arise due to discrepancies between different neural signal\nmodalities and the limited scale of high-quality neural data. To address these\nchallenges, we present NeuroBind, a general representation that unifies\nmultiple brain signal types, including EEG, fMRI, calcium imaging, and spiking\ndata. To achieve this, we align neural signals in these image-paired neural\ndatasets to pre-trained vision-language embeddings. Neurobind is the first\nmodel that studies different neural modalities interconnectedly and is able to\nleverage high-resource modality models for various neuroscience tasks. We also\nshowed that by combining information from different neural signal modalities,\nNeuroBind enhances downstream performance, demonstrating the effectiveness of\nthe complementary strengths of different neural modalities. As a result, we can\nleverage multiple types of neural signals mapped to the same space to improve\ndownstream tasks, and demonstrate the complementary strengths of different\nneural modalities. This approach holds significant potential for advancing\nneuroscience research, improving AI systems, and developing neuroprosthetics\nand brain-computer interfaces.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}