{"id":"2407.07574","title":"The neutral gas phase nearest to supermassive black holes","authors":"Wing-Fai Thi and Padelis Papadopoulos","authorsParsed":[["Thi","Wing-Fai",""],["Papadopoulos","Padelis",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 12:05:18 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 14:14:30 GMT"},{"version":"v3","created":"Mon, 12 Aug 2024 13:51:01 GMT"}],"updateDate":"2024-08-14","timestamp":1720613118000,"abstract":"  Broad Line Regions (BLRs) are known to contain gravitationally-bound gas\nwithin r~(few) 10^2-10^3 Schwarszchild radii (Rs) near supermassive black holes\n(SMBHs) in Active Galactic Nuclei (AGNs). Photo-ionized by strong non-stellar\nAGN continuum, this gas emits luminous ultraviolet/optical/near-infrared lines\nfrom ionized hydrogen (and other multi-ionized atoms) that have the widest\nvelocity profiles observed in galaxies, uniquely indicating the deep\ngravitational wells of SMBHs. Nearly all BLR studies focus on its ionized gas\nphase (hereafter BLR+), with typical masses of only a few 10-100 M_Sun, despite\nstrong indications of neutral BLR gas reservoirs (hereafter BLR0) with\nM_BLR0~10^{5-6} M_Sun. We used the photoionization code CLOUDY, with its\nchemistry augmented using three-body reactions, to explore 1-D models of\ndustless BLRs, focusing on the BLR0 conditions, and the abundances of its most\nprevalent neutral atoms and molecules. A neutral-atom-) and molecule-rich BLR0\ngas phase is found underlying the BLR+, the latter occupying only a thin outer\nlayer of AGN-irradiated gas column densities, while the former contains the\nbulk of the BLR gas mass. Atomic carbon and oxygen as well as the CO molecule\ncan reach substantial abundances in the BLR0, while their lines at infrared and\nsubmillimeter wavelengths can yield new probes of the BLR physical conditions\nand dynamics, unhindered by the dust absorption from outer AGN tori that\nreadily absorb the BLR+ optical/far-ultraviolet (FUV) lines. We find that\nneutral-atom-rich neutral-atom-rich and even molecule-rich gas can exist in the\nBLR0. The corresponding spectral lines from neutral atoms and molecules promise\na new spectral window of gas dynamics in the vicinity of~SMBHs unhindered by\ndust absorption. This may even offer the prospect of conducting novel tests of\ngeneral relativity in strongly curved spacetimes.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZouuD9A0XfVvQrZN5vnAYTE6ho4NMezlxaIyp5G4fDQ","pdfSize":"650095"}
