{"id":"2407.21509","title":"Radio observations of the 2022 outburst of the transitional Z-Atoll\n  source XTE J1701-462","authors":"K. V. S. Gasealahwe, I. M. Monageng, R. P. Fender, P. A. Woudt, A. K.\n  Hughes, S. E. Motta, J. van den Eijnden, P. Saikia, E. Tremou","authorsParsed":[["Gasealahwe","K. V. S.",""],["Monageng","I. M.",""],["Fender","R. P.",""],["Woudt","P. A.",""],["Hughes","A. K.",""],["Motta","S. E.",""],["Eijnden","J. van den",""],["Saikia","P.",""],["Tremou","E.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 10:27:29 GMT"}],"updateDate":"2024-08-01","timestamp":1722421649000,"abstract":"  XTE J1701-462 is a neutron star low mass X-ray binary (NS LMXB) discovered in\n2006 as the first system to demonstrate unambiguously that the `Atoll' and `Z'\nclasses of accreting neutron stars are separated by accretion rate. Radio\nobservations during the 2006/7 outburst provided evidence for the formation of\na relativistic jet, as now expected for all accreting neutron star and black\nhole X-ray binaries at high accretion rates. The source entered a new outburst\nin 2022, and we report 29 observations made with the MeerKAT radio telescope.\nThe first radio detection was on the 16th September 2022, we continued\ndetecting the source until mid-December 2022. Thereafter, establishing radio\nupper limits till 25 March 2023. We present the radio analysis alongside\nanalysis of contemporaneous X-ray observations from MAXI. The radio light curve\nshows evidence for at least three flare-like events over the first hundred\ndays, the most luminous of which has an associated minimum energy of\n$1\\times10^{38}$ erg. We provide a detailed comparison with the 2006/7\noutburst, and demonstrate that we detected radio emission from the source for\nconsiderably longer in the more recent outburst, although this is probably a\nfunction of sampling. We further constrain the radio emission from the source\nto have a polarisation of less than 9% at the time of 2022 IXPE detection of\nX-ray polarisation. Finally, we place the source in the radio -- X-ray plane,\ndemonstrating that when detected in radio it sits in a comparable region of\nparameter space to the other Z-sources.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}