{"id":"2407.14053","title":"DirectL: Efficient Radiance Fields Rendering for 3D Light Field Displays","authors":"Zongyuan Yang, Baolin Liu, Yingde Song, Yongping Xiong, Lan Yi, Zhaohe\n  Zhang, Xunbo Yu","authorsParsed":[["Yang","Zongyuan",""],["Liu","Baolin",""],["Song","Yingde",""],["Xiong","Yongping",""],["Yi","Lan",""],["Zhang","Zhaohe",""],["Yu","Xunbo",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 06:29:37 GMT"}],"updateDate":"2024-07-22","timestamp":1721370577000,"abstract":"  Autostereoscopic display, despite decades of development, has not achieved\nextensive application, primarily due to the daunting challenge of 3D content\ncreation for non-specialists. The emergence of Radiance Field as an innovative\n3D representation has markedly revolutionized the domains of 3D reconstruction\nand generation. This technology greatly simplifies 3D content creation for\ncommon users, broadening the applicability of Light Field Displays (LFDs).\nHowever, the combination of these two fields remains largely unexplored. The\nstandard paradigm to create optimal content for parallax-based light field\ndisplays demands rendering at least 45 slightly shifted views preferably at\nhigh resolution per frame, a substantial hurdle for real-time rendering. We\nintroduce DirectL, a novel rendering paradigm for Radiance Fields on 3D\ndisplays. We thoroughly analyze the interweaved mapping of spatial rays to\nscreen subpixels, precisely determine the light rays entering the human eye,\nand propose subpixel repurposing to significantly reduce the pixel count\nrequired for rendering. Tailored for the two predominant radiance\nfields--Neural Radiance Fields (NeRFs) and 3D Gaussian Splatting (3DGS), we\npropose corresponding optimized rendering pipelines that directly render the\nlight field images instead of multi-view images. Extensive experiments across\nvarious displays and user study demonstrate that DirectL accelerates rendering\nby up to 40 times compared to the standard paradigm without sacrificing visual\nquality. Its rendering process-only modification allows seamless integration\ninto subsequent radiance field tasks. Finally, we integrate DirectL into\ndiverse applications, showcasing the stunning visual experiences and the\nsynergy between LFDs and Radiance Fields, which unveils tremendous potential\nfor commercialization applications. \\href{direct-l.github.io}{\\textbf{Project\nHomepage}\n","subjects":["Computing Research Repository/Graphics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}