{"id":"2407.05959","title":"Time Series Dataset for Modeling and Forecasting of $N_2O$ in Wastewater\n  Treatment","authors":"Laura Debel Hansen, Anju Rani, Mikkel Algren Stokholm-Bjerregaard,\n  Peter Alexander Stentoft, Daniel Ortiz Arroyo and Petar Durdevic","authorsParsed":[["Hansen","Laura Debel",""],["Rani","Anju",""],["Stokholm-Bjerregaard","Mikkel Algren",""],["Stentoft","Peter Alexander",""],["Arroyo","Daniel Ortiz",""],["Durdevic","Petar",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 13:58:48 GMT"}],"updateDate":"2024-07-09","timestamp":1720447128000,"abstract":"  In this paper, we present two years of high-resolution nitrous oxide ($N_2O$)\nmeasurements for time series modeling and forecasting in wastewater treatment\nplants (WWTP). The dataset comprises frequent, real-time measurements from a\nfull-scale WWTP, with a sample interval of 2 minutes, making it ideal for\ndeveloping models for real-time operation and control. This comprehensive\nbio-chemical dataset includes detailed influent and effluent parameters,\noperational conditions, and environmental factors. Unlike existing datasets, it\naddresses the unique challenges of modeling $N_2O$, a potent greenhouse gas,\nproviding a valuable resource for researchers to enhance predictive accuracy\nand control strategies in wastewater treatment processes. Additionally, this\ndataset significantly contributes to the fields of machine learning and deep\nlearning time series forecasting by serving as a benchmark that mirrors the\ncomplexities of real-world processes, thus facilitating advancements in these\ndomains. We provide a detailed description of the dataset along with a\nstatistical analysis to highlight its characteristics, such as nonstationarity,\nnonnormality, seasonality, heteroscedasticity, structural breaks, asymmetric\ndistributions, and intermittency, which are common in many real-world time\nseries datasets and pose challenges for forecasting models.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}