{"id":"2407.03498","title":"Impact of Financial Literacy on Investment Decisions and Stock Market\n  Participation using Extreme Learning Machines","authors":"Gunbir Singh Baveja, Aaryavir Verma","authorsParsed":[["Baveja","Gunbir Singh",""],["Verma","Aaryavir",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 20:55:15 GMT"},{"version":"v2","created":"Sat, 13 Jul 2024 09:06:47 GMT"}],"updateDate":"2024-07-16","timestamp":1720040115000,"abstract":"  The stock market has become an increasingly popular investment option among\nnew generations, with individuals exploring more complex assets. This rise in\nretail investors' participation necessitates a deeper understanding of the\ndriving factors behind this trend and the role of financial literacy in\nenhancing investment decisions. This study aims to investigate how financial\nliteracy influences financial decision-making and stock market participation.\nBy identifying key barriers and motivators, the findings can provide valuable\ninsights for individuals and policymakers to promote informed investing\npractices. Our research is qualitative in nature, utilizing data collected from\nsocial media platforms to analyze real-time investor behavior and attitudes.\nThis approach allows us to capture the nuanced ways in which financial literacy\nimpacts investment choices and participation in the stock market. The findings\nindicate that financial literacy plays a critical role in stock market\nparticipation and financial decision-making. Key barriers to participation\ninclude low financial literacy, while increased financial knowledge enhances\ninvestment confidence and decision-making. Additionally, behavioral finance\nfactors and susceptibility to financial scams are significantly influenced by\nlevels of financial literacy. These results underscore the importance of\ntargeted financial education programs to improve financial literacy and empower\nindividuals to participate effectively in the stock market.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by/4.0/"}