{"id":"2407.21280","title":"Wireless-Powered Mobile Crowdsensing Enhanced by UAV-Mounted RIS: Joint\n  Transmission, Compression, and Trajectory Design","authors":"Yongqing Xu and Haoqing Qi and Zhiqin Wang and Xiang Zhang and Yong Li\n  and Tony Q.S. Quek","authorsParsed":[["Xu","Yongqing",""],["Qi","Haoqing",""],["Wang","Zhiqin",""],["Zhang","Xiang",""],["Li","Yong",""],["Quek","Tony Q. S.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 02:04:11 GMT"}],"updateDate":"2024-08-01","timestamp":1722391451000,"abstract":"  Mobile crowdsensing (MCS) enables data collection from massive devices to\nachieve a wide sensing range. Wireless power transfer (WPT) is a promising\nparadigm for prolonging the operation time of MCS systems by sustainably\ntransferring power to distributed devices. However, the efficiency of WPT\nsignificantly deteriorates when the channel conditions are poor. Unmanned\naerial vehicles (UAVs) and reconfigurable intelligent surfaces (RISs) can serve\nas active or passive relays to enhance the efficiency of WPT in unfavourable\npropagation environments. Therefore, to explore the potential of jointly\ndeploying UAVs and RISs to enhance transmission efficiency, we propose a novel\ntransmission framework for the WPT-assisted MCS systems, which is enhanced by a\nUAV-mounted RIS. Subsequently, under different compression schemes, two\noptimization problems are formulated to maximize the weighted sum of the data\nuploaded by the user equipments (UEs) by jointly designing the WPT and\nuploading time, the beamforming matrics, the CPU cycles, and the UAV\ntrajectory. A block coordinate descent (BCD) algorithm based on the closed-form\nbeamforming designs and the successive convex approximation (SCA) algorithm is\nproposed to solve the formulated problems. Furthermore, to highlight the\ninsight of the gains brought by the compression schemes, we analyze the energy\nefficiencies of compression schemes and confirm that the gains gradually reduce\nwith the increasing power used for compression. Simulation results demonstrate\nthat the amount of collected data can be effectively increased in\nwireless-powered MCS systems.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}