{"id":"2407.11812","title":"DFDRNN: A dual-feature based neural network for drug repositioning","authors":"Enqiang Zhu, Xiang Li, Chanjuan Liu, Nikhil R. Pal","authorsParsed":[["Zhu","Enqiang",""],["Li","Xiang",""],["Liu","Chanjuan",""],["Pal","Nikhil R.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:02:18 GMT"}],"updateDate":"2024-07-17","timestamp":1721142138000,"abstract":"  Drug repositioning is an economically efficient strategy used to discover new\nindications for existing drugs beyond their original approvals, expanding their\napplicability and usage to address challenges in disease treatment. In recent\nyears, deep-learning techniques for drug repositioning have gained much\nattention. While most deep learning-based research methods focus on encoding\ndrugs and diseases by extracting feature information from neighbors in the\nnetwork, they often pay little attention to the potential relationships between\nthe features of drugs and diseases, leading to imprecise encoding of drugs and\ndiseases. To address this, we design a dual-feature drug repositioning neural\nnetwork (DFDRNN) model to achieve precise encoding of drugs and diseases.\nDFDRNN uses two features to represent drugs and diseases: the similarity\nfeature and the association feature. The model incorporates a self-attention\nmechanism to design two dual-feature extraction modules for achieving precisely\nencoding of drugs and diseases: the intra-domain dual-feature extraction\n(IntraDDFE) module and the inter-domain dual-feature extraction (InterDDFE)\nmodule. The IntraDDFE module extracts features from a single domain (drug or\ndisease domain), while the InterDDFE module extracts features from the mixed\ndomain (drug and disease domain). In particular, the feature is changed by\nInterDDFE, ensuring a precise encoding of drugs and diseases. Finally, a\ncross-dual-domain decoder is designed to predict drug-disease associations in\nboth the drug and disease domains. Compared to six state-of-the-art methods,\nDFDRNN outperforms others on four benchmark datasets, with an average AUROC of\n0.946 and an average AUPR of 0.597.\n","subjects":["Computing Research Repository/Machine Learning","Quantitative Biology/Quantitative Methods"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}