{"id":"2407.03768","title":"Two-dimensional to bulk crossover of the WSe$_2$ electronic band\n  structure","authors":"Patrick Le F\\`evre (SSOLEIL, IPR), Rapha\\\"el Salazar (SSOLEIL),\n  Matthieu Jamet (SPINTEC), Fran\\c{c}ois Bertran (SSOLEIL), Chiara Bigi\n  (SSOLEIL), Abdelkarim Ourghi (C2N), C\\'eline Vergnaud (SPINTEC), Aki\n  Pulkkinen, Jan Minar, Thomas Jaouen (IPR), Julien Rault (SSOLEIL)","authorsParsed":[["Fèvre","Patrick Le","","SSOLEIL, IPR"],["Salazar","Raphaël","","SSOLEIL"],["Jamet","Matthieu","","SPINTEC"],["Bertran","François","","SSOLEIL"],["Bigi","Chiara","","SSOLEIL"],["Ourghi","Abdelkarim","","C2N"],["Vergnaud","Céline","","SPINTEC"],["Pulkkinen","Aki","","IPR"],["Minar","Jan","","IPR"],["Jaouen","Thomas","","IPR"],["Rault","Julien","","SSOLEIL"]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 09:26:53 GMT"}],"updateDate":"2024-07-08","timestamp":1720085213000,"abstract":"  Transition Metal Dichalcogenides (TMD) are layered materials obtained by\nstacking two-dimensional sheets weakly bonded by van der Waals interactions. In\nbulk TMD, band dispersions are observed in the direction normal to the sheet\nplane (z-direction) due to the hybridization of out-of-plane orbitals but no\nkz-dispersion is expected at the single-layer limit. Using angle-resolved\nphotoemission spectroscopy, we precisely address the two-dimensional to\nthree-dimensional crossover of the electronic band structure of epitaxial\nWSe$_2$ thin films. Increasing number of discrete electronic states appears in\ngiven kz-ranges while increasing the number of layers. The continuous bulk\ndispersion is nearly retrieved for 6-sheet films. These results are reproduced\nby calculations going from a relatively simple tight-binding model to a\nsophisticated KKR-Green's function calculation. This two-dimensional system is\nhence used as a benchmark to compare different theoretical approaches.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}