{"id":"2407.21363","title":"ESIQA: Perceptual Quality Assessment of Vision-Pro-based Egocentric\n  Spatial Images","authors":"Xilei Zhu, Liu Yang, Huiyu Duan, Xiongkuo Min, Guangtao Zhai, Patrick\n  Le Callet","authorsParsed":[["Zhu","Xilei",""],["Yang","Liu",""],["Duan","Huiyu",""],["Min","Xiongkuo",""],["Zhai","Guangtao",""],["Callet","Patrick Le",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 06:20:21 GMT"}],"updateDate":"2024-08-01","timestamp":1722406821000,"abstract":"  With the development of eXtended Reality (XR), head-mounted shooting and\ndisplay technology have experienced significant advancement and gained\nconsiderable attention. Egocentric spatial images and videos are emerging as a\ncompelling form of stereoscopic XR content. Different from traditional 2D\nimages, egocentric spatial images present challenges for perceptual quality\nassessment due to their special shooting, processing methods, and stereoscopic\ncharacteristics. However, the corresponding image quality assessment (IQA)\nresearch for egocentric spatial images is still lacking. In this paper, we\nestablish the Egocentric Spatial Images Quality Assessment Database (ESIQAD),\nthe first IQA database dedicated for egocentric spatial images as far as we\nknow. Our ESIQAD includes 500 egocentric spatial images, containing 400 images\ncaptured with the Apple Vision Pro and 100 images generated via an iPhone's\n\"Spatial Camera\" app. The corresponding mean opinion scores (MOSs) are\ncollected under three viewing modes, including 2D display, 3D-window display,\nand 3D-immersive display. Furthermore, based on our database, we conduct a\nbenchmark experiment and evaluate the performance of 22 state-of-the-art IQA\nmodels under three different viewing modes. We hope this research can\nfacilitate future IQA research on egocentric spatial images. The database is\navailable at https://github.com/IntMeGroup/ESIQA.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}