{"id":"2407.12383","title":"Reliable and Efficient Concept Erasure of Text-to-Image Diffusion Models","authors":"Chao Gong, Kai Chen, Zhipeng Wei, Jingjing Chen, Yu-Gang Jiang","authorsParsed":[["Gong","Chao",""],["Chen","Kai",""],["Wei","Zhipeng",""],["Chen","Jingjing",""],["Jiang","Yu-Gang",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 08:04:28 GMT"}],"updateDate":"2024-07-18","timestamp":1721203468000,"abstract":"  Text-to-image models encounter safety issues, including concerns related to\ncopyright and Not-Safe-For-Work (NSFW) content. Despite several methods have\nbeen proposed for erasing inappropriate concepts from diffusion models, they\noften exhibit incomplete erasure, consume a lot of computing resources, and\ninadvertently damage generation ability. In this work, we introduce Reliable\nand Efficient Concept Erasure (RECE), a novel approach that modifies the model\nin 3 seconds without necessitating additional fine-tuning. Specifically, RECE\nefficiently leverages a closed-form solution to derive new target embeddings,\nwhich are capable of regenerating erased concepts within the unlearned model.\nTo mitigate inappropriate content potentially represented by derived\nembeddings, RECE further aligns them with harmless concepts in cross-attention\nlayers. The derivation and erasure of new representation embeddings are\nconducted iteratively to achieve a thorough erasure of inappropriate concepts.\nBesides, to preserve the model's generation ability, RECE introduces an\nadditional regularization term during the derivation process, resulting in\nminimizing the impact on unrelated concepts during the erasure process. All the\nprocesses above are in closed-form, guaranteeing extremely efficient erasure in\nonly 3 seconds. Benchmarking against previous approaches, our method achieves\nmore efficient and thorough erasure with minor damage to original generation\nability and demonstrates enhanced robustness against red-teaming tools. Code is\navailable at \\url{https://github.com/CharlesGong12/RECE}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}