{"id":"2407.03750","title":"GriDB: Scaling Blockchain Database via Sharding and Off-Chain\n  Cross-Shard Mechanism","authors":"Zicong Hong, Song Guo, Enyuan Zhou, Wuhui Chen, Huawei Huang, Albert\n  Zomaya","authorsParsed":[["Hong","Zicong",""],["Guo","Song",""],["Zhou","Enyuan",""],["Chen","Wuhui",""],["Huang","Huawei",""],["Zomaya","Albert",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 08:59:44 GMT"}],"updateDate":"2024-07-08","timestamp":1720083584000,"abstract":"  Blockchain databases have attracted widespread attention but suffer from poor\nscalability due to underlying non-scalable blockchains. While blockchain\nsharding is necessary for a scalable blockchain database, it poses a new\nchallenge named on-chain cross-shard database services. Each cross-shard\ndatabase service (e.g., cross-shard queries or inter-shard load balancing)\ninvolves massive cross-shard data exchanges, while the existing cross-shard\nmechanisms need to process each cross-shard data exchange via the consensus of\nall nodes in the related shards (i.e., on-chain) to resist a Byzantine\nenvironment of blockchain, which eliminates sharding benefits. To tackle the\nchallenge, this paper presents GriDB, the first scalable blockchain database,\nby designing a novel off-chain cross-shard mechanism for efficient cross-shard\ndatabase services. Borrowing the idea of off-chain payments, GriDB delegates\nmassive cross-shard data exchange to a few nodes, each of which is randomly\npicked from a different shard. Considering the Byzantine environment, the\nuntrusted delegates cooperate to generate succinct proof for cross-shard data\nexchanges, while the consensus is only responsible for the low-cost proof\nverification. However, different from payments, the database services'\nverification has more requirements (e.g., completeness, correctness, freshness,\nand availability); thus, we introduce several new authenticated data structures\n(ADS). Particularly, we utilize consensus to extend the threat model and reduce\nthe complexity of traditional accumulator-based ADS for verifiable cross-shard\nqueries with a rich set of relational operators. Moreover, we study the\nnecessity of inter-shard load balancing for a scalable blockchain database and\ndesign an off-chain and live approach for both efficiency and availability\nduring balancing.\n","subjects":["Computing Research Repository/Databases"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}