{"id":"2407.16810","title":"Light-induced quantum tunnelling current in graphene","authors":"Mohamed Sennary, Jalil Shah, Mingrui Yuan, Ahmed Mahjoub, Vladimir\n  Pervak, Nikolay Golubev and Mohammed Hassan","authorsParsed":[["Sennary","Mohamed",""],["Shah","Jalil",""],["Yuan","Mingrui",""],["Mahjoub","Ahmed",""],["Pervak","Vladimir",""],["Golubev","Nikolay",""],["Hassan","Mohammed",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 19:34:50 GMT"}],"updateDate":"2024-07-25","timestamp":1721763290000,"abstract":"  In the last decade, advancements in attosecond spectroscopy have allowed us\nto study electron motion dynamics in condensed matter. The access to these\nelectron dynamics and, consequently, its control by an ultrafast light field\npaves the way for establishing ultrafast optoelectronics. Here, we report the\ngeneration of light-induced quantum tunnelling current in graphene\nphototransistors by ultrafast laser pulses in an ambient environment. This\ntunnelling effect provides access to the instantaneous field-driven current to\ndemonstrate the current switching (ON and OFF) on a 630 attosecond (1.6\npetahertz speed). Moreover, we controlled the tunnelling current and enhanced\nthe graphene phototransistor conductivity by controlling the density of the\nphotoexcited charge carriers at different pump laser powers. Furthermore, we\nexploited this capability to demonstrate various logic gates. The demonstrated\nlight-induced tunnelling current and ultrafast switching were attained under\nstandard room temperature and pressure conditions. Therefore, the presented\nscientific advancement in this work is at the technology readiness level\nsuitable for its immediate integration into the development of ultrafast,\nnearly six orders of magnitude faster, optical transistors, lightwave\nelectronics, and optical quantum computers.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Applied Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0ZdC11DXmN9FlOVQ_DOBfas_1eXF1XWqV-o9T45mpxU","pdfSize":"1758296","objectId":"0xfa043a36046bd31924767bf8372edfebfe7c3a30a935be3e83e64102d53453d4","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
