{"id":"2407.19519","title":"Fatigue life prediction at mesoscopic scale of samples containing\n  casting defects: A novel energy based non-local model","authors":"Arjun Kalkur Matpadi Raghavendra, Vincent Maurel, Lionel Marcin, Henry\n  Proudhon","authorsParsed":[["Raghavendra","Arjun Kalkur Matpadi",""],["Maurel","Vincent",""],["Marcin","Lionel",""],["Proudhon","Henry",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 15:57:40 GMT"}],"updateDate":"2024-07-30","timestamp":1722182260000,"abstract":"  Fatigue failure driven by stress gradients associated to casting defects was\nstudied in two cast nickel-based superalloys. The experimental campaign\nrevealed complex damage phenomena linked to spongeous shrinkages, characterized\nby their intricate arrangement of defects in the material medium, forming\ndefect clusters. Multiple cracks were observed to initiate from defect volumes,\ncoalescing with neighboring void surfaces along crystallographic planes.\nDefects were characterized using X-ray computed tomography, and image-based\nfinite element (FE) models were constructed as digital representations of each\nexperimental sample explicitly containing all real casting defects. Numerical\nsimulations of these FE models under the same conditions as the experiments\nrevealed that tortuous defects contain small ligaments where very high local\nstresses develop. These ligaments initiate early cracks, but due to the limited\nstressed volumes, these cracks do not drive the life of the material. A\nthorough comparison of simulations with experiments led to the development of\nan original method to define stressed volumes and address small ligaments.\nFinally, a novel energy-based non-local model was proposed, using two\nparameters to predict the fatigue lives of samples containing casting defects\nat the mesoscopic scale. The model was validated against samples with varying\nporosity levels, sizes, and geometries, accurately predicting fatigue lives\nwithin a factor of 3 compared to experimental results. This new approach\ngeneralizes the application of non-local methods to real casting defects by\nconsidering their shape and stressed volumes to estimate fatigue properties.\n","subjects":["Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7DwdcDi9WNg7ncZnZtGRGUNzVz-Haqo8kATqoEZLmyc","pdfSize":"30647829"}
