{"id":"2407.04913","title":"Tilted Disk Precession and Negative Superhumps in HS 2325+8205: A\n  Multi-Window Analysis","authors":"Qi-Bin Sun, Sheng-Bang Qian, Li-Ying Zhu, Qin-Mei Li, Min-Yu Li and\n  Ping Li","authorsParsed":[["Sun","Qi-Bin",""],["Qian","Sheng-Bang",""],["Zhu","Li-Ying",""],["Li","Qin-Mei",""],["Li","Min-Yu",""],["Li","Ping",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 01:37:16 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 14:00:21 GMT"}],"updateDate":"2024-08-23","timestamp":1720229836000,"abstract":"  Tilted disk precession exists in different objects. Negative superhumps\n(NSHs) in cataclysmic variable stars (CVs) are believed to arise from the\ninteraction between the reverse precession of a tilted disk and the streams\nfrom the secondary star.Utilizing TESS photometry, we present a comprehensive\ninvestigation into the tilted disk precession and NSHs in the dwarf nova (DN)\nHS 2325+8205, employing eclipse minima, eclipse depths, NSH frequencies, and\nNSH amplitudes and the correlation between them as the windows. We identified\nNSHs with a period of 0.185671(17) days in HS 2325+8205. The NSH frequency\nexhibits variability with a period of 3.943(9) days, akin to the tilted disk\nprecession period validated in novae-like stars (NLs, SDSS J0812) and\nintermediate polars (IPs, TV Col).The O-C of eclipse minima were similarly\nfound to vary cyclically in period 4.135(5) days, characterized by a faster\nrise than fall. Furthermore, the NSH amplitude exhibits complex and diverse\nvariations, which may be linked to changes in the disk radius, mass transfer\nrate, and the apparent area of the hot spot. For the first time in DNe, we\nobserve bi-periodic variations in eclipse depth (P1= 4.131(4) d and P2=\n2.065(2) d ~ Pprec/2), resembling those seen in IPs, suggesting that variations\nwith P2 are not attributable to an accretion curtain, as previously suspected.\nMoreover, NSH amplitude and eclipse depth decrease with increasing NSH\nfrequency, while NSH amplitude correlates positively with eclipse depth.These\ncomplex variations observed across multiple observational windows provide\nsubstantial evidence for understanding of tilted disk precession and NSHs.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}