{"id":"2407.18269","title":"LaMAGIC: Language-Model-based Topology Generation for Analog Integrated\n  Circuits","authors":"Chen-Chia Chang, Yikang Shen, Shaoze Fan, Jing Li, Shun Zhang,\n  Ningyuan Cao, Yiran Chen and Xin Zhang","authorsParsed":[["Chang","Chen-Chia",""],["Shen","Yikang",""],["Fan","Shaoze",""],["Li","Jing",""],["Zhang","Shun",""],["Cao","Ningyuan",""],["Chen","Yiran",""],["Zhang","Xin",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 22:51:41 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 08:07:43 GMT"}],"updateDate":"2024-08-30","timestamp":1721429501000,"abstract":"  In the realm of electronic and electrical engineering, automation of analog\ncircuit is increasingly vital given the complexity and customized requirements\nof modern applications. However, existing methods only develop search-based\nalgorithms that require many simulation iterations to design a custom circuit\ntopology, which is usually a time-consuming process. To this end, we introduce\nLaMAGIC, a pioneering language model-based topology generation model that\nleverages supervised finetuning for automated analog circuit design. LaMAGIC\ncan efficiently generate an optimized circuit design from the custom\nspecification in a single pass. Our approach involves a meticulous development\nand analysis of various input and output formulations for circuit. These\nformulations can ensure canonical representations of circuits and align with\nthe autoregressive nature of LMs to effectively addressing the challenges of\nrepresenting analog circuits as graphs. The experimental results show that\nLaMAGIC achieves a success rate of up to 96\\% under a strict tolerance of 0.01.\nWe also examine the scalability and adaptability of LaMAGIC, specifically\ntesting its performance on more complex circuits. Our findings reveal the\nenhanced effectiveness of our adjacency matrix-based circuit formulation with\nfloating-point input, suggesting its suitability for handling intricate circuit\ndesigns. This research not only demonstrates the potential of language models\nin graph generation, but also builds a foundational framework for future\nexplorations in automated analog circuit design.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zy8_Y8guk2CDtfdGDV_gCuKm1SZKP8IlzCHfWuwmQTg","pdfSize":"695776"}
