{"id":"2407.13952","title":"Knowledge Distillation Approaches for Accurate and Efficient Recommender\n  System","authors":"SeongKu Kang","authorsParsed":[["Kang","SeongKu",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 00:01:18 GMT"}],"updateDate":"2024-07-22","timestamp":1721347278000,"abstract":"  Despite its breakthrough in classification problems, Knowledge distillation\n(KD) to recommendation models and ranking problems has not been studied well in\nthe previous literature. This dissertation is devoted to developing knowledge\ndistillation methods for recommender systems to fully improve the performance\nof a compact model. We propose novel distillation methods designed for\nrecommender systems. The proposed methods are categorized according to their\nknowledge sources as follows: (1) Latent knowledge: we propose two methods that\ntransfer latent knowledge of user/item representation. They effectively\ntransfer knowledge of niche tastes with a balanced distillation strategy that\nprevents the KD process from being biased towards a small number of large\npreference groups. Also, we propose a new method that transfers user/item\nrelations in the representation space. The proposed method selectively\ntransfers essential relations considering the limited capacity of the compact\nmodel. (2) Ranking knowledge: we propose three methods that transfer ranking\nknowledge from the recommendation results. They formulate the KD process as a\nranking matching problem and transfer the knowledge via a listwise learning\nstrategy. Further, we present a new learning framework that compresses the\nranking knowledge of heterogeneous recommendation models. The proposed\nframework is developed to ease the computational burdens of model ensemble\nwhich is a dominant solution for many recommendation applications. We validate\nthe benefit of our proposed methods and frameworks through extensive\nexperiments. To summarize, this dissertation sheds light on knowledge\ndistillation approaches for a better accuracy-efficiency trade-off of the\nrecommendation models.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}