{"id":"2407.06111","title":"Enhancing the Prediction of Glass Dynamics by Incorporating the\n  Direction of Deviation from Equilibrium Positions","authors":"Xiao Jiang, Zean Tian, Kenli Li, Wangyu Hu","authorsParsed":[["Jiang","Xiao",""],["Tian","Zean",""],["Li","Kenli",""],["Hu","Wangyu",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 16:48:26 GMT"},{"version":"v2","created":"Tue, 9 Jul 2024 18:41:44 GMT"}],"updateDate":"2024-07-11","timestamp":1720457306000,"abstract":"  Elucidating the intricate relationship between the structure and dynamics in\nthe context of the glass transition has been a persistent challenge. Machine\nlearning (ML) has emerged as a pivotal tool, offering novel pathways to predict\ndynamic behaviors from structural descriptors. Notably, recent research has\nhighlighted that the distance between the initial particle positions between\nthe equilibrium positions substantially enhances the prediction of glassy\ndynamics. However, these methodologies have been limited in their ability to\ncapture the directional aspects of these deviations from the equilibrium\npositions, which are crucial for a comprehensive understanding of the complex\nparticle interactions within the cage dynamics. Therefore, this paper\nintroduces a novel structural parameter: the vectorial displacement of\nparticles from their initial configuration to their equilibrium positions.\nRecognizing the inadequacy of current ML models in effectively handling such\nvectorial parameters, we have developed an Equivariance-Constrained Invariant\nGraph Neural Network (EIGNN). This innovative model not only bolsters the\ndescriptive capacity of conventional rotation-invariant models but also\nstreamlines the computational demands associated with rotation-equivariant\ngraph neural networks. Our rigorous experimental validation on 3D glassy system\nfrom GlassBench dataset has yielded compelling evidence that the EIGNN model\nsignificantly enhance the correlation between structural representation and\ndynamic properties.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}