{"id":"2407.09312","title":"Detailed Mapping of the Galactic Disk Structure in the Solar\n  Neighborhood through LAMOST K Dwarfs","authors":"Xi-Can Tang, Hao Tian, Jing Li, Bing-qiu Chen, Yi-Rong Chen, Chao Liu,\n  Dan Qiu","authorsParsed":[["Tang","Xi-Can",""],["Tian","Hao",""],["Li","Jing",""],["Chen","Bing-qiu",""],["Chen","Yi-Rong",""],["Liu","Chao",""],["Qiu","Dan",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 14:52:48 GMT"}],"updateDate":"2024-07-15","timestamp":1720795968000,"abstract":"  The Galactic disk is one of the main components of the Milky Way, which\ncontributes most of the luminosity. Its structure is essential for\nunderstanding the formation and evolution of the Milky Way. Using 174,443\nK-type dwarf stars observed by both LAMOST and Gaia DR3, we study the disk\ndensity profile in the local volume within 1,200 pc. In the azimuthal\ndimension, we find strong asymmetric signal of the thin disk. The surface\ndensity and the scale height of the southern disk significantly change versus\nthe azimuthal angle at the same galactocentric distance $R$. Meanwhile, in the\nvertical dimension, the scale height of the northern disk has quite different\ntrend than that of the southern one. The scale height of the southern disk\nshows a decreasing trend with $\\phi\\sim-2.5^\\circ$, and change to an increasing\none with $\\phi\\sim5.0^\\deg$. Meanwhile, the scale height of the northern disk\nhas a consistently smaller increase. Finally, we divide the entire sample into\nthree subsamples based on metallicity and all three subsamples show significant\nnon-axisymmetric and north-south asymmetric signals in the Galactic disk.\nFurthermore, we find that the scale height of the metal-poor ([Fe/H] $<$ -0.4\ndex) subsample in the northern disk is greater than that of the metal-rich\n([Fe/H] $>$ -0.1 dex) subsample. However, in the southern disk, the scale\nheight exhibits varying relationships across different metallicity slices.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}