{"id":"2407.20846","title":"Precise Transit Photometry Using TESS II: Revisiting 28 Additional\n  Transiting Systems With Updated Physical Properties","authors":"Suman Saha","authorsParsed":[["Saha","Suman",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 14:24:50 GMT"}],"updateDate":"2024-07-31","timestamp":1722349490000,"abstract":"  Precise physical properties of the known transiting exoplanets are essential\nfor their precise atmospheric characterization using modern and upcoming\ninstruments. Leveraging the large volume of high SNR photometric follow-up data\nfrom TESS, highly precise physical properties can be estimated for these\nsystems, especially for those discovered using ground-based instruments prior\nto the TESS mission. In this work, I have used the publicly available TESS\nfollow-up data for 28 transiting systems with 10 $<$ V$_{mag}$ $<$ 10.5, with\nan aim to update their known physical properties. The observed lightcurves have\nbeen analysed by implementing a state-of-the-art critical noise treatment\nalgorithm to effectively reduce both time-correlated and un-correlated noise\ncomponents, using sophisticated techniques like wavelet denoising and\nGaussian-process regression. Compared with the previous studies, the estimated\ntransit parameters are found to be more precise for most of the targets,\nincluding a few cases where a larger space-based instrument like Spitzer,\nKepler or CHEOPS has been used in the previous study. The large volume of\ntransit observations used for each target has also resulted in a more accurate\nestimation of the physical properties, as this overcomes any error in parameter\nestimations from bias present in a smaller volume of data. Thus, comparing with\nthe literature values, statistically significant improvements in the known\nphysical properties of several targeted systems have been reported from this\nwork. The large volume of transit timing information from the analyses was also\nused to search for Transit Timing Variation trends in these targets, which has\nresulted in no significant detection.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}