{"id":"2407.18525","title":"Is larger always better? Evaluating and prompting large language models\n  for non-generative medical tasks","authors":"Yinghao Zhu, Junyi Gao, Zixiang Wang, Weibin Liao, Xiaochen Zheng,\n  Lifang Liang, Yasha Wang, Chengwei Pan, Ewen M. Harrison, Liantao Ma","authorsParsed":[["Zhu","Yinghao",""],["Gao","Junyi",""],["Wang","Zixiang",""],["Liao","Weibin",""],["Zheng","Xiaochen",""],["Liang","Lifang",""],["Wang","Yasha",""],["Pan","Chengwei",""],["Harrison","Ewen M.",""],["Ma","Liantao",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 06:09:10 GMT"}],"updateDate":"2024-07-29","timestamp":1721974150000,"abstract":"  The use of Large Language Models (LLMs) in medicine is growing, but their\nability to handle both structured Electronic Health Record (EHR) data and\nunstructured clinical notes is not well-studied. This study benchmarks various\nmodels, including GPT-based LLMs, BERT-based models, and traditional clinical\npredictive models, for non-generative medical tasks utilizing renowned\ndatasets. We assessed 14 language models (9 GPT-based and 5 BERT-based) and 7\ntraditional predictive models using the MIMIC dataset (ICU patient records) and\nthe TJH dataset (early COVID-19 EHR data), focusing on tasks such as mortality\nand readmission prediction, disease hierarchy reconstruction, and biomedical\nsentence matching, comparing both zero-shot and finetuned performance. Results\nindicated that LLMs exhibited robust zero-shot predictive capabilities on\nstructured EHR data when using well-designed prompting strategies, frequently\nsurpassing traditional models. However, for unstructured medical texts, LLMs\ndid not outperform finetuned BERT models, which excelled in both supervised and\nunsupervised tasks. Consequently, while LLMs are effective for zero-shot\nlearning on structured data, finetuned BERT models are more suitable for\nunstructured texts, underscoring the importance of selecting models based on\nspecific task requirements and data characteristics to optimize the application\nof NLP technology in healthcare.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}