{"id":"2407.11420","title":"iKalibr: Unified Targetless Spatiotemporal Calibration for Resilient\n  Integrated Inertial Systems","authors":"Shuolong Chen, Xingxing Li, Shengyu Li, Yuxuan Zhou, Xiaoteng Yang","authorsParsed":[["Chen","Shuolong",""],["Li","Xingxing",""],["Li","Shengyu",""],["Zhou","Yuxuan",""],["Yang","Xiaoteng",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 06:26:30 GMT"}],"updateDate":"2024-07-17","timestamp":1721111190000,"abstract":"  The integrated inertial system, typically integrating an IMU and an\nexteroceptive sensor such as radar, LiDAR, and camera, has been widely accepted\nand applied in modern robotic applications for ego-motion estimation, motion\ncontrol, or autonomous exploration. To improve system accuracy, robustness, and\nfurther usability, both multiple and various sensors are generally resiliently\nintegrated, which benefits the system performance regarding failure tolerance,\nperception capability, and environment compatibility. For such systems,\naccurate and consistent spatiotemporal calibration is required to maintain a\nunique spatiotemporal framework for multi-sensor fusion. Considering most\nexisting calibration methods (i) are generally oriented to specific integrated\ninertial systems, (ii) often only focus on spatial determination, (iii) usually\nrequire artificial targets, lacking convenience and usability, we propose\niKalibr: a unified targetless spatiotemporal calibration framework for\nresilient integrated inertial systems, which overcomes the above issues, and\nenables both accurate and consistent calibration. Altogether four commonly\nemployed sensors are supported in iKalibr currently, namely IMU, radar, LiDAR,\nand camera. The proposed method starts with a rigorous and efficient dynamic\ninitialization, where all parameters in the estimator would be accurately\nrecovered. Following that, several continuous-time-based batch optimizations\nwould be carried out to refine initialized parameters to global optimal ones.\nSufficient real-world experiments were conducted to verify the feasibility and\nevaluate the calibration performance of iKalibr. The results demonstrate that\niKalibr can achieve accurate resilient spatiotemporal calibration. We\nopen-source our implementations at (https://github.com/Unsigned-Long/iKalibr)\nto benefit the research community.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}