{"id":"2407.05194","title":"LLMCloudHunter: Harnessing LLMs for Automated Extraction of Detection\n  Rules from Cloud-Based CTI","authors":"Yuval Schwartz, Lavi Benshimol, Dudu Mimran, Yuval Elovici, Asaf\n  Shabtai","authorsParsed":[["Schwartz","Yuval",""],["Benshimol","Lavi",""],["Mimran","Dudu",""],["Elovici","Yuval",""],["Shabtai","Asaf",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 21:43:35 GMT"}],"updateDate":"2024-07-09","timestamp":1720302215000,"abstract":"  As the number and sophistication of cyber attacks have increased, threat\nhunting has become a critical aspect of active security, enabling proactive\ndetection and mitigation of threats before they cause significant harm.\nOpen-source cyber threat intelligence (OS-CTI) is a valuable resource for\nthreat hunters, however, it often comes in unstructured formats that require\nfurther manual analysis. Previous studies aimed at automating OSCTI analysis\nare limited since (1) they failed to provide actionable outputs, (2) they did\nnot take advantage of images present in OSCTI sources, and (3) they focused on\non-premises environments, overlooking the growing importance of cloud\nenvironments. To address these gaps, we propose LLMCloudHunter, a novel\nframework that leverages large language models (LLMs) to automatically generate\ngeneric-signature detection rule candidates from textual and visual OSCTI data.\nWe evaluated the quality of the rules generated by the proposed framework using\n12 annotated real-world cloud threat reports. The results show that our\nframework achieved a precision of 92% and recall of 98% for the task of\naccurately extracting API calls made by the threat actor and a precision of 99%\nwith a recall of 98% for IoCs. Additionally, 99.18% of the generated detection\nrule candidates were successfully compiled and converted into Splunk queries.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}