{"id":"2407.07841","title":"Benchmarking Embedding Aggregation Methods in Computational Pathology: A\n  Clinical Data Perspective","authors":"Shengjia Chen, Gabriele Campanella, Abdulkadir Elmas, Aryeh Stock,\n  Jennifer Zeng, Alexandros D. Polydorides, Adam J. Schoenfeld, Kuan-lin Huang,\n  Jane Houldsworth, Chad Vanderbilt, Thomas J. Fuchs","authorsParsed":[["Chen","Shengjia",""],["Campanella","Gabriele",""],["Elmas","Abdulkadir",""],["Stock","Aryeh",""],["Zeng","Jennifer",""],["Polydorides","Alexandros D.",""],["Schoenfeld","Adam J.",""],["Huang","Kuan-lin",""],["Houldsworth","Jane",""],["Vanderbilt","Chad",""],["Fuchs","Thomas J.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 17:00:57 GMT"}],"updateDate":"2024-07-11","timestamp":1720630857000,"abstract":"  Recent advances in artificial intelligence (AI), in particular\nself-supervised learning of foundation models (FMs), are revolutionizing\nmedical imaging and computational pathology (CPath). A constant challenge in\nthe analysis of digital Whole Slide Images (WSIs) is the problem of aggregating\ntens of thousands of tile-level image embeddings to a slide-level\nrepresentation. Due to the prevalent use of datasets created for genomic\nresearch, such as TCGA, for method development, the performance of these\ntechniques on diagnostic slides from clinical practice has been inadequately\nexplored. This study conducts a thorough benchmarking analysis of ten\nslide-level aggregation techniques across nine clinically relevant tasks,\nincluding diagnostic assessment, biomarker classification, and outcome\nprediction. The results yield following key insights: (1) Embeddings derived\nfrom domain-specific (histological images) FMs outperform those from generic\nImageNet-based models across aggregation methods. (2) Spatial-aware aggregators\nenhance the performance significantly when using ImageNet pre-trained models\nbut not when using FMs. (3) No single model excels in all tasks and\nspatially-aware models do not show general superiority as it would be expected.\nThese findings underscore the need for more adaptable and universally\napplicable aggregation techniques, guiding future research towards tools that\nbetter meet the evolving needs of clinical-AI in pathology. The code used in\nthis work is available at\n\\url{https://github.com/fuchs-lab-public/CPath_SABenchmark}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}