{"id":"2407.01242","title":"Bernstein duality revisited: frequency-dependent selection, coordinated\n  mutation and opposing environments","authors":"Fernando Cordero, Sebastian Hummel, Gr\\'egoire V\\'echambre","authorsParsed":[["Cordero","Fernando",""],["Hummel","Sebastian",""],["Véchambre","Grégoire",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 12:39:14 GMT"}],"updateDate":"2024-07-02","timestamp":1719837554000,"abstract":"  Population models usually come in pairs; one process describes forward\nevolution (e.g. type composition) and the other describes backward evolution\n(e.g. lines of descent). These processes are often linked by a formal\nrelationship known as duality. Ideally, one of the two processes is easier to\nanalyze, and the duality relation is so simple that properties of the more\ninvolved process can be inferred from the simpler one. This is the case when\nthe forward process admits a moment dual. Unfortunately, moment duality seems\nto be the exception rather than the rule. Various approaches have been used to\nanalyze models in the absence of a moment dual, one of them is based on\nBernstein duality and another one on Siegmund duality. As a rule of thumb, the\nfirst approach seems to work well whenever the ancestral processes are positive\nrecurrent; the second one, in contrast, works well in situations where the\nancestral structures can grow to infinity (in size). The second approach was\nrecently used to provide a full characterization of the long-term behavior of a\nbroad class of $\\Lambda$-Wright--Fisher processes subject to\nfrequency-dependent selection and opposing environments. In this paper, we use\nthe first approach to complete the picture, i.e. we describe the long-term\nbehavior of a different class of $\\Lambda$-Wright--Fisher processes, which\ncovers many of the cases that were not covered by the aforementioned result\n(the two classes intersect, but none is a proper subset of the other one).\nMoreover, we extend the notion of Bernstein duality to cases with (single and\ncoordinated) mutations {and environmental selection}, and we use it to show\nergodic properties of the process.\n","subjects":["Mathematics/Probability","Quantitative Biology/Populations and Evolution"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}