{"id":"2407.19820","title":"ActivityCLIP: Enhancing Group Activity Recognition by Mining\n  Complementary Information from Text to Supplement Image Modality","authors":"Guoliang Xu, Jianqin Yin, Feng Zhou, Yonghao Dang","authorsParsed":[["Xu","Guoliang",""],["Yin","Jianqin",""],["Zhou","Feng",""],["Dang","Yonghao",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 09:14:02 GMT"}],"updateDate":"2024-07-30","timestamp":1722244442000,"abstract":"  Previous methods usually only extract the image modality's information to\nrecognize group activity. However, mining image information is approaching\nsaturation, making it difficult to extract richer information. Therefore,\nextracting complementary information from other modalities to supplement image\ninformation has become increasingly important. In fact, action labels provide\nclear text information to express the action's semantics, which existing\nmethods often overlook. Thus, we propose ActivityCLIP, a plug-and-play method\nfor mining the text information contained in the action labels to supplement\nthe image information for enhancing group activity recognition. ActivityCLIP\nconsists of text and image branches, where the text branch is plugged into the\nimage branch (The off-the-shelf image-based method). The text branch includes\nImage2Text and relation modeling modules. Specifically, we propose the\nknowledge transfer module, Image2Text, which adapts image information into text\ninformation extracted by CLIP via knowledge distillation. Further, to keep our\nmethod convenient, we add fewer trainable parameters based on the relation\nmodule of the image branch to model interaction relation in the text branch. To\nshow our method's generality, we replicate three representative methods by\nActivityCLIP, which adds only limited trainable parameters, achieving favorable\nperformance improvements for each method. We also conduct extensive ablation\nstudies and compare our method with state-of-the-art methods to demonstrate the\neffectiveness of ActivityCLIP.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}