{"id":"2407.19507","title":"WeCromCL: Weakly Supervised Cross-Modality Contrastive Learning for\n  Transcription-only Supervised Text Spotting","authors":"Jingjing Wu, Zhengyao Fang, Pengyuan Lyu, Chengquan Zhang, Fanglin\n  Chen, Guangming Lu, Wenjie Pei","authorsParsed":[["Wu","Jingjing",""],["Fang","Zhengyao",""],["Lyu","Pengyuan",""],["Zhang","Chengquan",""],["Chen","Fanglin",""],["Lu","Guangming",""],["Pei","Wenjie",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 14:58:07 GMT"}],"updateDate":"2024-07-30","timestamp":1722178687000,"abstract":"  Transcription-only Supervised Text Spotting aims to learn text spotters\nrelying only on transcriptions but no text boundaries for supervision, thus\neliminating expensive boundary annotation. The crux of this task lies in\nlocating each transcription in scene text images without location annotations.\nIn this work, we formulate this challenging problem as a Weakly Supervised\nCross-modality Contrastive Learning problem, and design a simple yet effective\nmodel dubbed WeCromCL that is able to detect each transcription in a scene\nimage in a weakly supervised manner. Unlike typical methods for cross-modality\ncontrastive learning that focus on modeling the holistic semantic correlation\nbetween an entire image and a text description, our WeCromCL conducts atomistic\ncontrastive learning to model the character-wise appearance consistency between\na text transcription and its correlated region in a scene image to detect an\nanchor point for the transcription in a weakly supervised manner. The detected\nanchor points by WeCromCL are further used as pseudo location labels to guide\nthe learning of text spotting. Extensive experiments on four challenging\nbenchmarks demonstrate the superior performance of our model over other\nmethods. Code will be released.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}