{"id":"2407.14983","title":"Deep Learning CT Image Restoration using System Blur and Noise Models","authors":"Yijie Yuan, Grace J. Gang, J. Webster Stayman","authorsParsed":[["Yuan","Yijie",""],["Gang","Grace J.",""],["Stayman","J. Webster",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 21:17:35 GMT"}],"updateDate":"2024-07-23","timestamp":1721510255000,"abstract":"  The restoration of images affected by blur and noise has been widely studied\nand has broad potential for applications including in medical imaging\nmodalities like computed tomography (CT). Although the blur and noise in CT\nimages can be attributed to a variety of system factors, these image properties\ncan often be modeled and predicted accurately and used in classical restoration\napproaches for deconvolution and denoising. In classical approaches,\nsimultaneous deconvolution and denoising can be challenging and often represent\ncompeting goals. Recently, deep learning approaches have demonstrated the\npotential to enhance image quality beyond classic limits; however, most deep\nlearning models attempt a blind restoration problem and base their restoration\non image inputs alone without direct knowledge of the image noise and blur\nproperties. In this work, we present a method that leverages both degraded\nimage inputs and a characterization of the system blur and noise to combine\nmodeling and deep learning approaches. Different methods to integrate these\nauxiliary inputs are presented. Namely, an input-variant and a weight-variant\napproach wherein the auxiliary inputs are incorporated as a parameter vector\nbefore and after the convolutional block, respectively, allowing easy\nintegration into any CNN architecture. The proposed model shows superior\nperformance compared to baseline models lacking auxiliary inputs. Evaluations\nare based on the average Peak Signal-to-Noise Ratio (PSNR), selected examples\nof good and poor performance for varying approaches, and an input space\nanalysis to assess the effect of different noise and blur on performance.\nResults demonstrate the efficacy of providing a deep learning model with\nauxiliary inputs, representing system blur and noise characteristics, to\nenhance the performance of the model in image restoration tasks.\n","subjects":["Physics/Medical Physics","Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}