{"id":"2407.01566","title":"A Contextual Online Learning Theory of Brokerage","authors":"Fran\\c{c}ois Bachoc, Tommaso Cesari, Roberto Colomboni","authorsParsed":[["Bachoc","François",""],["Cesari","Tommaso",""],["Colomboni","Roberto",""]],"versions":[{"version":"v1","created":"Wed, 22 May 2024 18:38:05 GMT"}],"updateDate":"2024-07-03","timestamp":1716403085000,"abstract":"  We study the role of contextual information in the online learning problem of\nbrokerage between traders. At each round, two traders arrive with secret\nvaluations about an asset they wish to trade. The broker suggests a trading\nprice based on contextual data about the asset. Then, the traders decide to buy\nor sell depending on whether their valuations are higher or lower than the\nbrokerage price.\n  We assume the market value of traded assets is an unknown linear function of\na $d$-dimensional vector representing the contextual information available to\nthe broker. Additionally, we model traders' valuations as independent bounded\nzero-mean perturbations of the asset's market value, allowing for potentially\ndifferent unknown distributions across traders and time steps. Consistently\nwith the existing online learning literature, we evaluate the performance of a\nlearning algorithm with the regret with respect to the gain from trade. If the\nnoise distributions admit densities bounded by some constant $L$, then, for any\ntime horizon $T$:\n  - If the agents' valuations are revealed after each interaction, we provide\nan algorithm achieving $O ( L d \\ln T )$ regret, and show a corresponding\nmatching lower bound of $\\Omega( Ld \\ln T )$.\n  - If only their willingness to sell or buy at the proposed price is revealed\nafter each interaction, we provide an algorithm achieving $O(\\sqrt{LdT \\ln T\n})$ regret, and show that this rate is optimal (up to logarithmic factors), via\na lower bound of $\\Omega(\\sqrt{LdT})$.\n  To complete the picture, we show that if the bounded density assumption is\nlifted, then the problem becomes unlearnable, even with full feedback.\n","subjects":["Quantitative Finance/Computational Finance","Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}