{"id":"2407.18118","title":"Multipath Identification and Mitigation with FDA-MIMO Radar","authors":"Yizhen Jia, Jie Cheng, Wen-Qin Wang, Hui Chen","authorsParsed":[["Jia","Yizhen",""],["Cheng","Jie",""],["Wang","Wen-Qin",""],["Chen","Hui",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 15:25:37 GMT"}],"updateDate":"2024-07-26","timestamp":1721921137000,"abstract":"  In smart city development, the automatic detection of structures and vehicles\nwithin urban or suburban areas via array radar (airborne or vehicle platforms)\nbecomes crucial. However, the inescapable multipath effect adversely affects\nthe radar's capability to detect and track targets. Frequency Diversity Array\n(FDA)-MIMO radar offers innovative solutions in mitigating multipath due to its\nfrequency flexibility and waveform diversity traits amongst array elements.\nHence, utilizing FDA-MIMO radar, this research proposes a multipath\ndiscrimination and suppression strategy to augment target detection and\nsuppress false alarms. The primary advancement is the transformation of\nconventional multipath suppression into a multipath recognition issue, thereby\nenabling multipath components from single-frame echo data to be separated\nwithout prior knowledge. By offsetting the distance steering vectors of\ndifferent objects to be detected, the accurate spectral information\ncorresponding to the current distance unit can be extracted during spatial\nspectrum estimation. The direct and multipath components are differentiated\ndepending on whether the transmitting and receiving angles match. Additionally,\nto mitigate high-order multipath, the echo intensity of multipath components is\nreduced via joint optimization of array transmit weighting and frequency\nincrement. The numerical results show that the proposed algorithm can identify\nmultipath at different distances in both single-target and multi-target\nscenarios, which is superior to the general MIMO radar.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}