{"id":"2407.21497","title":"Mitral Regurgitation Recogniton based on Unsupervised\n  Out-of-Distribution Detection with Residual Diffusion Amplification","authors":"Zhe Liu, Xiliang Zhu, Tong Han, Yuhao Huang, Jian Wang, Lian Liu, Fang\n  Wang, Dong Ni, Zhongshan Gou, Xin Yang","authorsParsed":[["Liu","Zhe",""],["Zhu","Xiliang",""],["Han","Tong",""],["Huang","Yuhao",""],["Wang","Jian",""],["Liu","Lian",""],["Wang","Fang",""],["Ni","Dong",""],["Gou","Zhongshan",""],["Yang","Xin",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 10:11:57 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 02:14:37 GMT"}],"updateDate":"2024-09-19","timestamp":1722420717000,"abstract":"  Mitral regurgitation (MR) is a serious heart valve disease. Early and\naccurate diagnosis of MR via ultrasound video is critical for timely clinical\ndecision-making and surgical intervention. However, manual MR diagnosis heavily\nrelies on the operator's experience, which may cause misdiagnosis and\ninter-observer variability. Since MR data is limited and has large intra-class\nvariability, we propose an unsupervised out-of-distribution (OOD) detection\nmethod to identify MR rather than building a deep classifier. To our knowledge,\nwe are the first to explore OOD in MR ultrasound videos. Our method consists of\na feature extractor, a feature reconstruction model, and a residual\naccumulation amplification algorithm. The feature extractor obtains features\nfrom the video clips and feeds them into the feature reconstruction model to\nrestore the original features. The residual accumulation amplification\nalgorithm then iteratively performs noise feature reconstruction, amplifying\nthe reconstructed error of OOD features. This algorithm is straightforward yet\nefficient and can seamlessly integrate as a plug-and-play component in\nreconstruction-based OOD detection methods. We validated the proposed method on\na large ultrasound dataset containing 893 non-MR and 267 MR videos.\nExperimental results show that our OOD detection method can effectively\nidentify MR samples.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}