{"id":"2407.20328","title":"Statistical Estimates of the Binary Properties of Rotational Variables","authors":"Anya Phillips and C.S. Kochanek","authorsParsed":[["Phillips","Anya",""],["Kochanek","C. S.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-31","timestamp":1722276003000,"abstract":"  We present a model to estimate the average primary masses, companion mass\nranges, the inclination limit for recognizing a rotational variable, and the\nprimary mass spreads for populations of binary stars. The model fits a\npopulation's binary mass function distribution and allows for a probability\nthat some mass functions are incorrectly estimated. Using tests with synthetic\ndata, we assess the model's sensitivity to each parameter, finding that we are\nmost sensitive to the average primary mass and the minimum companion mass, with\nless sensitivity to the inclination limit and little to no sensitivity to the\nprimary mass spread. We apply the model to five populations of binary spotted\nrotational variables identified in ASAS-SN, computing their binary mass\nfunctions using RV data from APOGEE. Their average primary mass estimates are\nconsistent with our expectations based on their CMD locations ($\\sim0.75\nM_{\\odot}$ for lower main sequence primaries and $\\sim 0.9$--$1.2 M_{\\odot}$\nfor RS CVn and sub-subgiants). Their companion mass range estimates allow\ncompanion masses down to $M_2/M_1\\simeq0.1$, although the main sequence\npopulation may have a higher minimum mass fraction ($\\sim0.4$). We see weak\nevidence of an inclination limit $\\gtrsim50^{\\circ}$ for the main sequence and\nsub-subgiant groups and no evidence of an inclination limit in the other\ngroups. No groups show strong evidence for a preferred primary mass spread. We\nconclude by demonstrating that the approach will provide significantly better\nestimates of the primary mass and the minimum mass ratio and reasonable\nsensitivity to the inclination limit with 10 times as many systems.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"JYHRTdqlgaMiHpa2hpvbVCVR5LSoimiKkM3r6l3avZU","pdfSize":"905841"}
