{"id":"2407.07406","title":"Weakly-supervised Medical Image Segmentation with Gaze Annotations","authors":"Yuan Zhong, Chenhui Tang, Yumeng Yang, Ruoxi Qi, Kang Zhou, Yuqi Gong,\n  Pheng Ann Heng, Janet H. Hsiao, Qi Dou","authorsParsed":[["Zhong","Yuan",""],["Tang","Chenhui",""],["Yang","Yumeng",""],["Qi","Ruoxi",""],["Zhou","Kang",""],["Gong","Yuqi",""],["Heng","Pheng Ann",""],["Hsiao","Janet H.",""],["Dou","Qi",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 07:07:58 GMT"}],"updateDate":"2024-07-11","timestamp":1720595278000,"abstract":"  Eye gaze that reveals human observational patterns has increasingly been\nincorporated into solutions for vision tasks. Despite recent explorations on\nleveraging gaze to aid deep networks, few studies exploit gaze as an efficient\nannotation approach for medical image segmentation which typically entails\nheavy annotating costs. In this paper, we propose to collect dense weak\nsupervision for medical image segmentation with a gaze annotation scheme. To\ntrain with gaze, we propose a multi-level framework that trains multiple\nnetworks from discriminative human attention, simulated with a set of\npseudo-masks derived by applying hierarchical thresholds on gaze heatmaps.\nFurthermore, to mitigate gaze noise, a cross-level consistency is exploited to\nregularize overfitting noisy labels, steering models toward clean patterns\nlearned by peer networks. The proposed method is validated on two public\nmedical datasets of polyp and prostate segmentation tasks. We contribute a\nhigh-quality gaze dataset entitled GazeMedSeg as an extension to the popular\nmedical segmentation datasets. To the best of our knowledge, this is the first\ngaze dataset for medical image segmentation. Our experiments demonstrate that\ngaze annotation outperforms previous label-efficient annotation schemes in\nterms of both performance and annotation time. Our collected gaze data and code\nare available at: https://github.com/med-air/GazeMedSeg.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}