{"id":"2407.20203","title":"Privileged Reinforcement and Communication Learning for Distributed,\n  Bandwidth-limited Multi-robot Exploration","authors":"Yixiao Ma, Jingsong Liang, Yuhong Cao, Derek Ming Siang Tan, Guillaume\n  Sartoretti","authorsParsed":[["Ma","Yixiao",""],["Liang","Jingsong",""],["Cao","Yuhong",""],["Tan","Derek Ming Siang",""],["Sartoretti","Guillaume",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 17:34:55 GMT"}],"updateDate":"2024-07-30","timestamp":1722274495000,"abstract":"  Communication bandwidth is an important consideration in multi-robot\nexploration, where information exchange among robots is critical. While\nexisting methods typically aim to reduce communication throughput, they either\nrequire significant computation or significantly compromise exploration\nefficiency. In this work, we propose a deep reinforcement learning framework\nbased on communication and privileged reinforcement learning to achieve a\nsignificant reduction in bandwidth consumption, while minimally sacrificing\nexploration efficiency. Specifically, our approach allows robots to learn to\nembed the most salient information from their individual belief (partial map)\nover the environment into fixed-sized messages. Robots then reason about their\nown belief as well as received messages to distributedly explore the\nenvironment while avoiding redundant work. In doing so, we employ privileged\nlearning and learned attention mechanisms to endow the critic (i.e., teacher)\nnetwork with ground truth map knowledge to effectively guide the policy (i.e.,\nstudent) network during training. Compared to relevant baselines, our model\nallows the team to reduce communication by up to two orders of magnitude, while\nonly sacrificing a marginal 2.4\\% in total travel distance, paving the way for\nefficient, distributed multi-robot exploration in bandwidth-limited scenarios.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}