{"id":"2407.19401","title":"Complete Security and Privacy for AI Inference in Decentralized Systems","authors":"Hongyang Zhang and Yue Zhao and Claudio Angione and Harry Yang and\n  James Buban and Ahmad Farhan and Fielding Johnston and Patrick Colangelo","authorsParsed":[["Zhang","Hongyang",""],["Zhao","Yue",""],["Angione","Claudio",""],["Yang","Harry",""],["Buban","James",""],["Farhan","Ahmad",""],["Johnston","Fielding",""],["Colangelo","Patrick",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 05:09:17 GMT"}],"updateDate":"2024-07-30","timestamp":1722143357000,"abstract":"  The need for data security and model integrity has been accentuated by the\nrapid adoption of AI and ML in data-driven domains including healthcare,\nfinance, and security. Large models are crucial for tasks like diagnosing\ndiseases and forecasting finances but tend to be delicate and not very\nscalable. Decentralized systems solve this issue by distributing the workload\nand reducing central points of failure. Yet, data and processes spread across\ndifferent nodes can be at risk of unauthorized access, especially when they\ninvolve sensitive information. Nesa solves these challenges with a\ncomprehensive framework using multiple techniques to protect data and model\noutputs. This includes zero-knowledge proofs for secure model verification. The\nframework also introduces consensus-based verification checks for consistent\noutputs across nodes and confirms model integrity. Split Learning divides\nmodels into segments processed by different nodes for data privacy by\npreventing full data access at any single point. For hardware-based security,\ntrusted execution environments are used to protect data and computations within\nsecure zones. Nesa's state-of-the-art proofs and principles demonstrate the\nframework's effectiveness, making it a promising approach for securely\ndemocratizing artificial intelligence.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}