{"id":"2407.02659","title":"LLMs Plagiarize: Ensuring Responsible Sourcing of Large Language Model\n  Training Data Through Knowledge Graph Comparison","authors":"Devam Mondal, Carlo Lipizzi","authorsParsed":[["Mondal","Devam",""],["Lipizzi","Carlo",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 20:49:21 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 15:13:26 GMT"}],"updateDate":"2024-08-05","timestamp":1719953361000,"abstract":"  In light of recent legal allegations brought by publishers, newspapers, and\nother creators of copyrighted corpora against large language model developers\nwho use their copyrighted materials for training or fine-tuning purposes, we\npropose a novel system, a variant of a plagiarism detection system, that\nassesses whether a knowledge source has been used in the training or\nfine-tuning of a large language model. Unlike current methods, we utilize an\napproach that uses Resource Description Framework (RDF) triples to create\nknowledge graphs from both a source document and an LLM continuation of that\ndocument. These graphs are then analyzed with respect to content using cosine\nsimilarity and with respect to structure using a normalized version of graph\nedit distance that shows the degree of isomorphism. Unlike traditional\nplagiarism systems that focus on content matching and keyword identification\nbetween a source and a target corpus, our approach enables a broader and more\naccurate evaluation of similarity between a source document and LLM\ncontinuation by focusing on relationships between ideas and their organization\nwith regards to others. Additionally, our approach does not require access to\nLLM metrics like perplexity that may be unavailable in closed large language\nmodel \"black-box\" systems, as well as the training corpus. We thus assess\nwhether an LLM has \"plagiarized\" a corpus in its continuation through\nsimilarity measures. A prototype of our system will be found on a hyperlinked\nGitHub repository.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RHvZ_6jivVrfJR7VX1W3YKDsQ1T04clnVzD0lCjQlNI","pdfSize":"560375","objectId":"0xacd9da110f93f33cf053752d7d1f65b6afa9dc259a5f764511172622ffd428ad","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
