{"id":"2407.08520","title":"Enhancing context models for point cloud geometry compression with\n  context feature residuals and multi-loss","authors":"Chang Sun, Hui Yuan, Shuai Li, Xin Lu, and Raouf Hamzaoui","authorsParsed":[["Sun","Chang",""],["Yuan","Hui",""],["Li","Shuai",""],["Lu","Xin",""],["Hamzaoui","Raouf",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:08:37 GMT"}],"updateDate":"2024-07-12","timestamp":1720706917000,"abstract":"  In point cloud geometry compression, context models usually use the one-hot\nencoding of node occupancy as the label, and the cross-entropy between the\none-hot encoding and the probability distribution predicted by the context\nmodel as the loss function. However, this approach has two main weaknesses.\nFirst, the differences between contexts of different nodes are not significant,\nmaking it difficult for the context model to accurately predict the probability\ndistribution of node occupancy. Second, as the one-hot encoding is not the\nactual probability distribution of node occupancy, the cross-entropy loss\nfunction is inaccurate. To address these problems, we propose a general\nstructure that can enhance existing context models. We introduce the context\nfeature residuals into the context model to amplify the differences between\ncontexts. We also add a multi-layer perception branch, that uses the mean\nsquared error between its output and node occupancy as a loss function to\nprovide accurate gradients in backpropagation. We validate our method by\nshowing that it can improve the performance of an octree-based model\n(OctAttention) and a voxel-based model (VoxelDNN) on the object point cloud\ndatasets MPEG 8i and MVUB, as well as the LiDAR point cloud dataset\nSemanticKITTI.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}