{"id":"2407.07935","title":"All-optical method to directly measure the pressure-volume-temperature\n  equation of state of fluids in the diamond anvil cell","authors":"J.E. Proctor, C.E.A. Robertson, L.J. Jones, J. Phillips, K. Watson, Y.\n  Dabburi and B. Moss","authorsParsed":[["Proctor","J. E.",""],["Robertson","C. E. A.",""],["Jones","L. J.",""],["Phillips","J.",""],["Watson","K.",""],["Dabburi","Y.",""],["Moss","B.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 17:33:57 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 11:12:28 GMT"}],"updateDate":"2024-08-16","timestamp":1720632837000,"abstract":"  We have developed a new all-optical method to directly measure the\npressure-volume-temperature (PVT) equation of state (EOS) of fluids and\ntransparent solids in the diamond anvil high pressure cell by measuring the\nvolume of the sample chamber. Our method combines confocal microscopy and white\nlight interference with a new analysis method which exploits the mutual\ndependence of sample density and refractive index: Experimentally, the\nrefractive index determines the measured sample chamber thickness (and\ntherefore the measured sample volume/density), yet the sample density is by far\nthe dominant factor in determining the variation in refractive index with\npressure. Our analysis method allows us to obtain a set of values for the\ndensity and refractive index which are mutually consistent, and agree with the\nexperimental data within error. We have conducted proof-of-concept experiments\non a variety of samples (H$_{2}$O, CH$_{4}$, C$_{2}$H$_{6}$, C$_{3}$H$_{8}$,\nKCl and NaCl) at ambient temperature, and at high temperatures up to just above\n500 K. Our proof-of-concept data demonstrate that our method is able to\nreproduce known fluid and solid EOS within error. Furthermore, we demonstrate\nthat our method allows us to directly and routinely measure the PVT EOS of\nsimple fluids at GPa pressures up to, at least, 514 K (the highest temperature\nreached in our study). A reasonable estimation of the known sources of error in\nour volume determinations indicates that the error is currently $\\pm$ 2.7% at\nhigh temperature, and that it is feasible to reduce it to ca. $\\pm$ 1% in\nfuture work.\n","subjects":["Condensed Matter/Other Condensed Matter","Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}