{"id":"2407.18683","title":"RRO: A Regularized Routing Optimization Algorithm for Enhanced\n  Throughput and Low Latency with Efficient Complexity","authors":"David Zenati, Tzalik Maimon, Kobi Cohen","authorsParsed":[["Zenati","David",""],["Maimon","Tzalik",""],["Cohen","Kobi",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 12:03:19 GMT"}],"updateDate":"2024-07-29","timestamp":1721995399000,"abstract":"  In the rapidly evolving landscape of wireless networks, achieving enhanced\nthroughput with low latency for data transmission is crucial for future\ncommunication systems. While low complexity OSPF-type solutions have shown\neffectiveness in lightly-loaded networks, they often falter in the face of\nincreasing congestion. Recent approaches have suggested utilizing backpressure\nand deep learning techniques for route optimization. However, these approaches\nface challenges due to their high implementation and computational complexity,\nsurpassing the capabilities of networks with limited hardware devices.\n  A key challenge is developing algorithms that improve throughput and reduce\nlatency while keeping complexity levels compatible with OSPF. In this\ncollaborative research between Ben-Gurion University and Ceragon Networks Ltd.,\nwe address this challenge by developing a novel approach, dubbed Regularized\nRouting Optimization (RRO). The RRO algorithm offers both distributed and\ncentralized implementations with low complexity, making it suitable for\nintegration into 5G and beyond technologies, where no significant changes to\nthe existing protocols are needed. It increases throughput while ensuring\nlatency remains sufficiently low through regularized optimization. We analyze\nthe computational complexity of RRO and prove that it converges with a level of\ncomplexity comparable to OSPF. Extensive simulation results across diverse\nnetwork topologies demonstrate that RRO significantly outperforms existing\nmethods.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}