{"id":"2407.16418","title":"Accelerating Learned Video Compression via Low-Resolution Representation\n  Learning","authors":"Zidian Qiu, Zongyao He, Zhi Jin","authorsParsed":[["Qiu","Zidian",""],["He","Zongyao",""],["Jin","Zhi",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 12:02:57 GMT"}],"updateDate":"2024-07-24","timestamp":1721736177000,"abstract":"  In recent years, the field of learned video compression has witnessed rapid\nadvancement, exemplified by the latest neural video codecs DCVC-DC that has\noutperformed the upcoming next-generation codec ECM in terms of compression\nratio. Despite this, learned video compression frameworks often exhibit low\nencoding and decoding speeds primarily due to their increased computational\ncomplexity and unnecessary high-resolution spatial operations, which hugely\nhinder their applications in reality. In this work, we introduce an\nefficiency-optimized framework for learned video compression that focuses on\nlow-resolution representation learning, aiming to significantly enhance the\nencoding and decoding speeds. Firstly, we diminish the computational load by\nreducing the resolution of inter-frame propagated features obtained from reused\nfeatures of decoded frames, including I-frames. We implement a joint training\nstrategy for both the I-frame and P-frame models, further improving the\ncompression ratio. Secondly, our approach efficiently leverages multi-frame\npriors for parameter prediction, minimizing computation at the decoding end.\nThirdly, we revisit the application of the Online Encoder Update (OEU) strategy\nfor high-resolution sequences, achieving notable improvements in compression\nratio without compromising decoding efficiency. Our efficiency-optimized\nframework has significantly improved the balance between compression ratio and\nspeed for learned video compression. In comparison to traditional codecs, our\nmethod achieves performance levels on par with the low-decay P configuration of\nthe H.266 reference software VTM. Furthermore, when contrasted with DCVC-HEM,\nour approach delivers a comparable compression ratio while boosting encoding\nand decoding speeds by a factor of 3 and 7, respectively. On RTX 2080Ti, our\nmethod can decode each 1080p frame under 100ms.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}