{"id":"2407.14946","title":"Microstructure-Dependent Particulate Filtration using Multifunctional\n  Metallic Nanowire Foams","authors":"James Malloy, Erin Marlowe, Christopher J. Jensen, Isaac S. Liu,\n  Thomas Hulse, Anne F. Murray, Daniel Bryan, Thomas G. Denes, Dustin A.\n  Gilbert, Gen Yin, and Kai Liu","authorsParsed":[["Malloy","James",""],["Marlowe","Erin",""],["Jensen","Christopher J.",""],["Liu","Isaac S.",""],["Hulse","Thomas",""],["Murray","Anne F.",""],["Bryan","Daniel",""],["Denes","Thomas G.",""],["Gilbert","Dustin A.",""],["Yin","Gen",""],["Liu","Kai",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 17:45:29 GMT"}],"updateDate":"2024-08-16","timestamp":1721497529000,"abstract":"  The COVID-19 pandemic has shown the urgent need for the development of\nefficient, durable, reusable and recyclable filtration media for the\ndeep-submicron size range. Here we demonstrate a multifunctional filtration\nplatform using porous metallic nanowire foams that are efficient, robust,\nantimicrobial, and reusable, with the potential to further guard against\nmultiple hazards. We have investigated the foam microstructures, detailing how\nthe growth parameters influence the overall surface area and characteristic\nfeature size, as well as the effects of the microstructures on the filtration\nperformance. Nanogranules deposited on the nanowires during electrodeposition\nare found to greatly increase the surface area, up to 20 m$^{2}$/g.\nSurprisingly, in the high surface area regime, the overall surface area gained\nfrom the nanogranules has little correlation with the improvement in capture\nefficiency. However, nanowire density and diameter play a significant role in\nthe capture efficiency of PM$_{0.3}$ particles, as do the surface roughness of\nthe nanowire fibers and their characteristic feature sizes. Antimicrobial tests\non the Cu foams show a >99.9995% inactivation efficiency after contacting the\nfoams for 30 seconds. These results demonstrate promising directions to achieve\na highly efficient multifunctional filtration platform with optimized\nmicrostructures.\n","subjects":["Physics/Applied Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}