{"id":"2407.05720","title":"Comparison of robot morphologies and base positioning for welding\n  applications","authors":"Nicolas Gautier, Yves Guillermit, Yazid Sebsadji, Mathieu Porez (LS2N,\n  LS2N - \\'equipe ReV), Damien Chablat (LS2N, LS2N - \\'equipe RoMas)","authorsParsed":[["Gautier","Nicolas","","LS2N,\n  LS2N - équipe ReV"],["Guillermit","Yves","","LS2N,\n  LS2N - équipe ReV"],["Sebsadji","Yazid","","LS2N,\n  LS2N - équipe ReV"],["Porez","Mathieu","","LS2N,\n  LS2N - équipe ReV"],["Chablat","Damien","","LS2N, LS2N - équipe RoMas"]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 08:24:31 GMT"}],"updateDate":"2024-07-09","timestamp":1720427071000,"abstract":"  This article undertakes a comprehensive examination of two distinct robot\nmorphologies: the PUMA-type arm (Programmable Universal Machine for Assembly)\nand the UR-type robot (Universal Robots). The primary aim of this comparative\nanalysis is to assess their respective performances within the specialized\ndomain of welding, focusing on predefined industrial application scenarios.\nThese scenarios encompass a range of geometrical components earmarked for\nwelding, along with specified welding paths, spatial constraints, and welding\nmethodologies reflective of real-world scenarios encountered by manual welders.\nThe case studies presented in this research serve as illustrative examples of\nWeez-U Welding practices, providing insights into the practical implications of\nemploying different robot morphologies. Moreover, this study distinguishes\nbetween various base positions for the robot, thereby aiding welders in\nselecting the optimal base placement aligned with their specific welding\nobjectives. By offering such insights, this research facilitates the selection\nof the most suitable architecture for this particular range of trajectories,\nthus optimizing welding efficiency and effectiveness. A departure from\nconventional methodologies, this study goes beyond merely considering\nsingularities and also delves into the analysis of collisions between the robot\nand its environment, contingent upon the robot's posture. This holistic\napproach offers a more nuanced understanding of the challenges and\nconsiderations inherent in deploying robotic welding systems, providing\nvaluable insights for practitioners and researchers alike in the field of\nrobotic welding technology.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}