{"id":"2407.02699","title":"Alcock-Paczy\\'nski effect on void-finding: Implications for void-galaxy\n  cross-correlation modelling","authors":"Sla{\\dj}ana Radinovi\\'c, Hans A. Winther, Seshadri Nadathur, Will J.\n  Percival, Enrique Paillas, Tristan Sohrab Fraser, Elena Massara, Alex\n  Woodfinden","authorsParsed":[["Radinović","Slađana",""],["Winther","Hans A.",""],["Nadathur","Seshadri",""],["Percival","Will J.",""],["Paillas","Enrique",""],["Fraser","Tristan Sohrab",""],["Massara","Elena",""],["Woodfinden","Alex",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 22:44:07 GMT"}],"updateDate":"2024-07-04","timestamp":1719960247000,"abstract":"  Under the assumption of statistical isotropy, and in the absence of\ndirectional selection effects, a stack of voids is expected to be spherically\nsymmetric, which makes it an excellent object to use for an Alcock-Paczy\\'nski\n(AP) test. This is commonly done using the void-galaxy cross-correlation\nfunction (CCF), which has emerged as a competitive probe, especially in\ncombination with the galaxy-galaxy auto correlation function. Current studies\nof the AP effect around voids assume that the void centre positions transform\nunder the choice of fiducial cosmology in the same way as galaxy positions. We\nshow that this assumption, though prevalent in the literature, is complicated\nby the response of void-finding algorithms to shifts in tracer positions. Using\nstretched simulation boxes to emulate the AP effect, we investigate how the\nvoid-galaxy CCF changes under AP, revealing an additional effect imprinted in\nthe CCF that must be accounted for. The effect comes from the response of void\nfinders to the distorted tracer field, reducing the amplitude of the AP signal\nin the CCF, and thus depends on the specific void finding algorithm used. We\npresent results for four different void finding packages: $\\texttt{revolver}$,\n$\\texttt{vide}$, $\\texttt{voxel}$, and the spherical void finder in the\n$\\texttt{Pylians3}$ library, demonstrating how incorrect treatment of the AP\neffect results in biases in the recovered parameters for all of them. Finally,\nwe propose a method to alleviate this issue without resorting to complex and\nfinder-specific modelling of the void finder response to AP.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}