{"id":"2407.01173","title":"Combining pre- and post-recombination new physics to address\n  cosmological tensions: case study with varying electron mass and a\n  sign-switching cosmological constant","authors":"Yo Toda, William Giar\\`e, Emre \\\"Oz\\\"ulker, Eleonora Di Valentino,\n  Sunny Vagnozzi","authorsParsed":[["Toda","Yo",""],["Giarè","William",""],["Özülker","Emre",""],["Di Valentino","Eleonora",""],["Vagnozzi","Sunny",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 10:51:36 GMT"}],"updateDate":"2024-08-12","timestamp":1719831096000,"abstract":"  It has recently been argued that the Hubble tension may call for a\ncombination of both pre- and post-recombination new physics. Motivated by these\nconsiderations, we provide one of the first concrete case studies aimed at\nconstructing such a viable combination. We consider models that have\nindividually worked best on either end of recombination so far: a spatially\nuniform time-varying electron mass leading to earlier recombination (also\nadding non-zero spatial curvature), and a sign-switching cosmological constant\ninducing an AdS-to-dS transition within the $\\Lambda_{\\rm s}$CDM model. When\nconfronted against Cosmic Microwave Background (CMB), Baryon Acoustic\nOscillations, and Type Ia Supernovae data, we show that no combination of these\ningredients can successfully solve the Hubble tension. We find that the matter\ndensity parameter $\\Omega_m$ plays a critical role, driving important physical\nscales in opposite directions: the AdS-to-dS transition requires a larger\n$\\Omega_m$ to maintain the CMB acoustic scale fixed, whereas the varying\nelectron mass requires a smaller $\\Omega_m$ to maintain the redshift of\nmatter-radiation equality fixed. Despite the overall failure, we use our\nresults to draw general model-building lessons, highlighting the importance of\nassessing tension-solving directions in the parameter space of new physics\nparameters and how these correlate with shifts in other standard parameters,\nwhile underscoring the crucial role of $\\Omega_m$ in this sense.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}