{"id":"2407.00949","title":"SpectralKAN: Kolmogorov-Arnold Network for Hyperspectral Images Change\n  Detection","authors":"Yanheng Wang, Xiaohan Yu, Yongsheng Gao, Jianjun Sha, Jian Wang,\n  Lianru Gao, Yonggang Zhang, Xianhui Rong","authorsParsed":[["Wang","Yanheng",""],["Yu","Xiaohan",""],["Gao","Yongsheng",""],["Sha","Jianjun",""],["Wang","Jian",""],["Gao","Lianru",""],["Zhang","Yonggang",""],["Rong","Xianhui",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 04:09:24 GMT"}],"updateDate":"2024-07-02","timestamp":1719806964000,"abstract":"  It has been verified that deep learning methods, including convolutional\nneural networks (CNNs), graph neural networks (GNNs), and transformers, can\naccurately extract features from hyperspectral images (HSIs). These algorithms\nperform exceptionally well on HSIs change detection (HSIs-CD). However, the\ndownside of these impressive results is the enormous number of parameters,\nFLOPs, GPU memory, training and test times required. In this paper, we propose\nan spectral Kolmogorov-Arnold Network for HSIs-CD (SpectralKAN). SpectralKAN\nrepresent a multivariate continuous function with a composition of activation\nfunctions to extract HSIs feature and classification. These activation\nfunctions are b-spline functions with different parameters that can simulate\nvarious functions. In SpectralKAN, a KAN encoder is proposed to enhance\ncomputational efficiency for HSIs. And a spatial-spectral KAN encoder is\nintroduced, where the spatial KAN encoder extracts spatial features and\ncompresses the spatial dimensions from patch size to one. The spectral KAN\nencoder then extracts spectral features and classifies them into changed and\nunchanged categories. We use five HSIs-CD datasets to verify the effectiveness\nof SpectralKAN. Experimental verification has shown that SpectralKAN maintains\nhigh HSIs-CD accuracy while requiring fewer parameters, FLOPs, GPU memory,\ntraining and testing times, thereby increasing the efficiency of HSIs-CD. The\ncode will be available at https://github.com/yanhengwang-heu/SpectralKAN.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}