{"id":"2407.05141","title":"Impact of Network Topology on Byzantine Resilience in Decentralized\n  Federated Learning","authors":"Siddhartha Bhattacharya, Daniel Helo, Joshua Siegel","authorsParsed":[["Bhattacharya","Siddhartha",""],["Helo","Daniel",""],["Siegel","Joshua",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 17:47:44 GMT"}],"updateDate":"2024-07-09","timestamp":1720288064000,"abstract":"  Federated learning (FL) enables a collaborative environment for training\nmachine learning models without sharing training data between users. This is\ntypically achieved by aggregating model gradients on a central server.\nDecentralized federated learning is a rising paradigm that enables users to\ncollaboratively train machine learning models in a peer-to-peer manner, without\nthe need for a central aggregation server. However, before applying\ndecentralized FL in real-world use training environments, nodes that deviate\nfrom the FL process (Byzantine nodes) must be considered when selecting an\naggregation function. Recent research has focused on Byzantine-robust\naggregation for client-server or fully connected networks, but has not yet\nevaluated such aggregation schemes for complex topologies possible with\ndecentralized FL. Thus, the need for empirical evidence of Byzantine robustness\nin differing network topologies is evident. This work investigates the effects\nof state-of-the-art Byzantine-robust aggregation methods in complex,\nlarge-scale network structures. We find that state-of-the-art Byzantine robust\naggregation strategies are not resilient within large non-fully connected\nnetworks. As such, our findings point the field towards the development of\ntopology-aware aggregation schemes, especially necessary within the context of\nlarge scale real-world deployment.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lA1e4Rx1Ms2ZnYK06eWGRVJXxVrfk2bEHKHq-PQp2Bo","pdfSize":"2514325"}
