{"id":"2407.04553","title":"The Nature of the High-energy Gamma-Ray Radiation Associated with the\n  High-redshift Blazar B3 1343+451","authors":"Fan Wu, Wen Hu, Benzhong Dai","authorsParsed":[["Wu","Fan",""],["Hu","Wen",""],["Dai","Benzhong",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 14:37:02 GMT"}],"updateDate":"2024-07-08","timestamp":1720190222000,"abstract":"  High-redshift blazars are the most powerful extragalactic astrophysical\nsources ever detected in the high-energy gamma-ray band. In this study, we\npresent a temporal and spectral analysis of the high-redshift blazar B3\n1343+451 based on 14 years of Fermi-LAT observations, spanning from 2008 August\n4 to 2022 June 6 (MJD 54686-59733). We extract a seven-day binned $\\gamma$-ray\nlight curve in the energy range 0.1--500 GeV and identify seven outburst\nperiods with a peak flux of $>4.32\\times10^{-7} \\rm ph \\cdot cm^{-2} \\cdot\ns^{-1}$. The highest seven day flux (above 100 MeV) reaches\n$(8.06\\pm0.56)\\times10^{-7} \\rm erg \\ cm^{-2} \\ s^{-1}$ on MJD = 56,177.16,\nwhich is 10 times higher than the flux in the quiescent period. To understand\nthe properties of distant blazar jets, we employ a standard one-zone leptonic\nscenario and model the multiwavelength spectral energy distributions of one\nquiescent and seven flaring periods. We find that the $\\gamma$-ray spectrum is\nbetter reproduced if we assume that the dissipation region of the jet, $R_{\\rm\ndiss}$, is located within the molecular torus, where infrared emission is the\ndominant external photon field. We infer that the jets in higher-redshift\nblazars have larger power and kinetic energy, where the kinetic energy is\nsignificantly greater than the radiation power, and the jet production\nefficiency suggests that we need to lower the accretion efficiency. These\nresults imply that B3 1343+451 may have a standard thin disk surrounding its\nmassive black hole, and the jets of B3 1343+451 may not be fully explained by\nthe Blandford--Payne process.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}