{"id":"2407.06138","title":"Laser-scanning of induction-melted Al alloys: are they representative of\n  additively manufactured ones?","authors":"Zhaoxuan Ge, Sebastian Calderon, S. Mohadeseh Taheri-Mousavi","authorsParsed":[["Ge","Zhaoxuan",""],["Calderon","Sebastian",""],["Taheri-Mousavi","S. Mohadeseh",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:12:08 GMT"}],"updateDate":"2024-07-09","timestamp":1720458728000,"abstract":"  The bottleneck of alloy design for powder-based additive manufacturing (AM)\nresides in powder production-an expensive and time-consuming process hindering\nthe rapid closed-loop design iterations. This study analyzed an expedited\nexperimental workflow, i.e., multipath laser scanning of induction-melted\nsamples, to mimic rapid solidification of AM to serve as an alternative\napproach to downselect from the design space. Using Al-Ni-Zr-Er model alloy, we\ncompared the microstructural features between the laser-scanned sample and the\nlaser powder bed fusion (LPBF) one. Our results showed that the microstructure\nmorphology is the same for both samples. SEM (< x12000 magnification) shows\ndifferences in Zr and Er distribution justified by the repeated reheating for\nadditional layers in the 3D-printed sample. Nonetheless, phase distribution was\nnearly the same at a high magnification scale under STEM (> x80000). Phase\nsizes were also compared -- the laser-scanned sample resembles 3D-printed with\nan average size difference of 15% in Al grain, 14% in Al-Ni-Er ternary\nprecipitates, and 4% in L12 nanoprecipitates. Cooling rates for the two samples\nwere estimated by Rosenthal equation. The higher rate of the 3D-printed sample\ncompared with that of the laser-scanned sample explains its slightly finer\nphases. The mechanical properties of the two samples were evaluated by\nmicrohardness tests. The hardness of the laser-scanned sample was found to be\n21% less than that of the 3D-printed sample. The potential reasons were\ndiscussed. The study also showed that a similar difference in hardness was\nobserved when the experiments were repeated on a printable benchmark Al alloy\nshowcasing only 1% absolute error. Thus, laser-scanned samples can serve as a\npredictor of the hardness of LPBF samples, and their highly similar\nmicrostructure at high magnification allows their applications in rapid\nscreening tests.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}