{"id":"2407.07656","title":"Co-designing heterogeneous models: a distributed systems approach","authors":"Marius-Constantin Ilau, Tristan Caulfield, David Pym","authorsParsed":[["Ilau","Marius-Constantin",""],["Caulfield","Tristan",""],["Pym","David",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 13:35:38 GMT"}],"updateDate":"2024-07-11","timestamp":1720618538000,"abstract":"  The nature of information security has been, and probably will continue to\nbe, marked by the asymmetric competition of attackers and defenders over the\ncontrol of an uncertain environment. The reduction of this degree of\nuncertainty via an increase in understanding of that environment is a primary\nobjective for both sides. Models are useful tools in this context because they\nprovide a way to understand and experiment with their targets without the usual\noperational constraints. However, given the technological and social\nadvancements of today, the object of modelling has increased in complexity.\nSuch objects are no longer singular entities, but heterogeneous socio-technical\nsystems interlinked to form large-scale ecosystems. Furthermore, the underlying\ncomponents of a system might be based on very different epistemic assumptions\nand methodologies for construction and use. Naturally, consistent, rigorous\nreasoning about such systems is hard, but necessary for achieving both security\nand resilience. The goal of this paper is to present a modelling approach\ntailored for heterogeneous systems based on three elements: an inferentialist\ninterpretation of what a model is, a distributed systems metaphor to structure\nthat interpretation and a co-design cycle to describe the practical design and\nconstruction of the model. The underlying idea is that an open world\ninterpretation, supported by a formal, yet generic abstraction facilitating\nknowledge translation and providing properties for structured reasoning and,\nused in practice according to the co-design cycle could lead to models that are\nmore likely to achieve their pre-stated goals. We explore the suitability of\nthis method in the context of three different security-oriented models: a\nphysical data loss model, an organisational recovery under ransomware model and\nan surge capacity trauma unit model.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}