{"id":"2407.06068","title":"Systematic time-coarse graining for driven quantum systems","authors":"Leon Bello, Wentao Fan, Aditya Gandotra, Hakan E. T\\\"ureci","authorsParsed":[["Bello","Leon",""],["Fan","Wentao",""],["Gandotra","Aditya",""],["Türeci","Hakan E.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 16:11:52 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 23:15:15 GMT"}],"updateDate":"2024-08-02","timestamp":1720455112000,"abstract":"  Many recent advancements in quantum computing leverage strong drives on\nnonlinear systems for state preparation, signal amplification, or gate\noperation. However, the interplay within such strongly driven system introduces\nmulti-scale dynamics that affects the long-time behavior of the system in\nnon-trivial ways that are very difficult to model. Therefore, the analysis of\nthese systems often relies on effective Hamiltonian models that introduce\nadditional nonlinear processes which approximate the long-time dynamics so that\nhighly oscillatory terms may be ignored. However, the removal of such high\nfrequency transitions can only be performed rigorously within a systematic\nframework of time-coarse graining, which is a fundamentally irreversible\noperation. This implies that standard approaches with unitary effective models\ncannot accurately capture the long-time behavior of strongly driven nonlinear\nquantum systems in general. We introduce a systematic perturbation theory for\nobtaining the complete non-unitary effective model of the time-coarse grained\n(TCG) dynamics of a driven quantum system to any order in the coupling\nstrengths. We derive a closed-form analytical formula for both unitary and\nnon-unitary contributions, in the form of an effective Hamiltonian and\nnon-unitary (pseudo-)dissipators. Remarkably, even though the effective theory\npresumes unitary time evolution at the microscopic level, the time-coarse\ngrained dynamics is found to follow a non-unitary time evolution in general.\nThis occurs even when there is no open heat reservoir for the system to become\nentangled with or dissipate into. We demonstrate the effectiveness of the new\nmethod using several typical models of driven nonlinear systems in\nsuperconducting circuits, and show that it generalizes and improves on existing\nmethods by providing more accurate results and explaining phenomena that have\nnot been accounted for.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}