{"id":"2407.10536","title":"An experimental evaluation of Siamese Neural Networks for robot\n  localization using omnidirectional imaging in indoor environments","authors":"J.J.Cabrera, V. Rom\\'an, A. Gil, O. Reinoso and L. Pay\\'a","authorsParsed":[["Cabrera","J. J.",""],["Román","V.",""],["Gil","A.",""],["Reinoso","O.",""],["Payá","L.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 08:44:37 GMT"}],"updateDate":"2024-07-16","timestamp":1721033077000,"abstract":"  The objective of this paper is to address the localization problem using\nomnidirectional images captured by a catadioptric vision system mounted on the\nrobot. For this purpose, we explore the potential of Siamese Neural Networks\nfor modeling indoor environments using panoramic images as the unique source of\ninformation. Siamese Neural Networks are characterized by their ability to\ngenerate a similarity function between two input data, in this case, between\ntwo panoramic images. In this study, Siamese Neural Networks composed of two\nConvolutional Neural Networks (CNNs) are used. The output of each CNN is a\ndescriptor which is used to characterize each image. The dissimilarity of the\nimages is computed by measuring the distance between these descriptors. This\nfact makes Siamese Neural Networks particularly suitable to perform image\nretrieval tasks. First, we evaluate an initial task strongly related to\nlocalization that consists in detecting whether two images have been captured\nin the same or in different rooms. Next, we assess Siamese Neural Networks in\nthe context of a global localization problem. The results outperform previous\ntechniques for solving the localization task using the COLD-Freiburg dataset,\nin a variety of lighting conditions, specially when using images captured in\ncloudy and night conditions.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GrHh-KL_ktpcW4W99F1NVlmCqOAMjRqcr2tk3pA8MVE","pdfSize":"1344978","objectId":"0x3dbd3084a17995f58b540192630dfcaa1f3a38dfbbd52cb86b5d637ecf0d59d8","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
