{"id":"2407.16414","title":"The enhancement of Gaussian mixture modelling as an application to the\n  coherent WaveBurst algorithm in the search for short gravitational wave\n  transients","authors":"Leigh Smith, Sayantan Ghosh, Jiyoon Sun, V. Gayathri, Ik Siong Heng,\n  Archana Pai","authorsParsed":[["Smith","Leigh",""],["Ghosh","Sayantan",""],["Sun","Jiyoon",""],["Gayathri","V.",""],["Heng","Ik Siong",""],["Pai","Archana",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 11:58:10 GMT"}],"updateDate":"2024-07-24","timestamp":1721735890000,"abstract":"  We present an enhanced method for the application of Gaussian Mixture\nModelling (GMM) to the coherent WaveBurst (cWB) algorithm in the search for\nshort-duration gravitational wave (GW) transients. The supervised Machine\nLearning method of GMM allows for the multi-dimensional distributions of noise\nand signal to be modelled over a set of representative attributes, which aids\nin the classification of GW signals against noise transients (glitches) in the\ndata. We demonstrate that updating the approach to model construction\neliminates bias previously seen in the GMM analysis, increasing the robustness\nand sensitivity of the analysis over a wider range of burst source populations.\nThe enhanced methodology is applied to the generic burst all-sky short search\nin the LIGO-Virgo full third observing run (O3), marking the first application\nof GMM to the 3 detector Livingston-Hanford-Virgo network. For both 2- and 3-\ndetector networks, we observe comparable sensitivities to an array of generic\nsignal morphologies, with significant sensitivity improvements to waveforms in\nthe low Quality factor parameter space at false alarm rates of 1 per 100 years.\nThis proves that GMM can effectively mitigate blip glitches, which are one of\nthe most problematic sources of noise for un-modelled GW searches. The cWB-GMM\nsearch recovers similar numbers of compact binary coalescence (CBC) events as\nother cWB post-production methods, and concludes on no new gravitational wave\ndetection after known CBC events are removed.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}