{"id":"2407.14920","title":"RoIPoly: Vectorized Building Outline Extraction Using Vertex and Logit\n  Embeddings","authors":"Weiqin Jiao, Hao Cheng, Claudio Persello, George Vosselman","authorsParsed":[["Jiao","Weiqin",""],["Cheng","Hao",""],["Persello","Claudio",""],["Vosselman","George",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 16:12:51 GMT"}],"updateDate":"2024-07-23","timestamp":1721491971000,"abstract":"  Polygonal building outlines are crucial for geographic and cartographic\napplications. The existing approaches for outline extraction from aerial or\nsatellite imagery are typically decomposed into subtasks, e.g., building\nmasking and vectorization, or treat this task as a sequence-to-sequence\nprediction of ordered vertices. The former lacks efficiency, and the latter\noften generates redundant vertices, both resulting in suboptimal performance.\nTo handle these issues, we propose a novel Region-of-Interest (RoI) query-based\napproach called RoIPoly. Specifically, we formulate each vertex as a query and\nconstrain the query attention on the most relevant regions of a potential\nbuilding, yielding reduced computational overhead and more efficient vertex\nlevel interaction. Moreover, we introduce a novel learnable logit embedding to\nfacilitate vertex classification on the attention map; thus, no post-processing\nis needed for redundant vertex removal. We evaluated our method on the\nvectorized building outline extraction dataset CrowdAI and the 2D floorplan\nreconstruction dataset Structured3D. On the CrowdAI dataset, RoIPoly with a\nResNet50 backbone outperforms existing methods with the same or better\nbackbones on most MS-COCO metrics, especially on small buildings, and achieves\ncompetitive results in polygon quality and vertex redundancy without any\npost-processing. On the Structured3D dataset, our method achieves the\nsecond-best performance on most metrics among existing methods dedicated to 2D\nfloorplan reconstruction, demonstrating our cross-domain generalization\ncapability. The code will be released upon acceptance of this paper.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}