{"id":"2407.07014","title":"An Attempt to Devise a Pairwise Ising-Type Maximum Entropy Model\n  Integrated Cost Function for Optimizing SNN Deployment","authors":"Wanhong Huang","authorsParsed":[["Huang","Wanhong",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 16:33:43 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 00:15:32 GMT"}],"updateDate":"2024-07-12","timestamp":1720542823000,"abstract":"  The deployment process of a spiking neural network (SNN) often involves\npartitioning the neural network and mapping these partitions onto processing\nunits within the neuromorphic hardware. Finding optimal deployment schemes is\nan NP-hard problem. Optimizing these schemes presents challenges, particular in\ndevising computationally effective cost functions optimization objectives such\nas communication time consumption and energy efficiency. These objectives\nrequire consideration of network dynamics shaped by neuron activity patterns,\ndemanding intricate mathematical analyses or simulations for integrating them\ninto a cost model for SNN development.\n  Our approach focuses on network dynamics, which are hardware-independent and\ncan be modeled separately from specific hardware configurations. We employ a\npairwise Ising-type maximum entropy model, which is a model show effective in\naccurately capturing pairwise correlations among system components in a\ncollaborative system. On top of this model, we incorporates hardware and\nnetwork structure-specific factors to devise a cost function.\n  We conducted an extremely preliminary investigation using the SpiNNaker\nmachine. We show that the ising model training can also be computationally\ncomplex. Currently, we lack sufficient evidence to substantiate the\neffectiveness of our proposed methods. Further efforts is needed to explore\nintegrating network dynamics into SNN deployment.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}