{"id":"2407.06939","title":"Towards Open-World Mobile Manipulation in Homes: Lessons from the\n  Neurips 2023 HomeRobot Open Vocabulary Mobile Manipulation Challenge","authors":"Sriram Yenamandra, Arun Ramachandran, Mukul Khanna, Karmesh Yadav, Jay\n  Vakil, Andrew Melnik, Michael B\\\"uttner, Leon Harz, Lyon Brown, Gora Chand\n  Nandi, Arjun PS, Gaurav Kumar Yadav, Rahul Kala, Robert Haschke, Yang Luo,\n  Jinxin Zhu, Yansen Han, Bingyi Lu, Xuan Gu, Qinyuan Liu, Yaping Zhao, Qiting\n  Ye, Chenxiao Dou, Yansong Chua, Volodymyr Kuzma, Vladyslav Humennyy, Ruslan\n  Partsey, Jonathan Francis, Devendra Singh Chaplot, Gunjan Chhablani,\n  Alexander Clegg, Theophile Gervet, Vidhi Jain, Ram Ramrakhya, Andrew Szot,\n  Austin Wang, Tsung-Yen Yang, Aaron Edsinger, Charlie Kemp, Binit Shah, Zsolt\n  Kira, Dhruv Batra, Roozbeh Mottaghi, Yonatan Bisk, Chris Paxton","authorsParsed":[["Yenamandra","Sriram",""],["Ramachandran","Arun",""],["Khanna","Mukul",""],["Yadav","Karmesh",""],["Vakil","Jay",""],["Melnik","Andrew",""],["Büttner","Michael",""],["Harz","Leon",""],["Brown","Lyon",""],["Nandi","Gora Chand",""],["PS","Arjun",""],["Yadav","Gaurav Kumar",""],["Kala","Rahul",""],["Haschke","Robert",""],["Luo","Yang",""],["Zhu","Jinxin",""],["Han","Yansen",""],["Lu","Bingyi",""],["Gu","Xuan",""],["Liu","Qinyuan",""],["Zhao","Yaping",""],["Ye","Qiting",""],["Dou","Chenxiao",""],["Chua","Yansong",""],["Kuzma","Volodymyr",""],["Humennyy","Vladyslav",""],["Partsey","Ruslan",""],["Francis","Jonathan",""],["Chaplot","Devendra Singh",""],["Chhablani","Gunjan",""],["Clegg","Alexander",""],["Gervet","Theophile",""],["Jain","Vidhi",""],["Ramrakhya","Ram",""],["Szot","Andrew",""],["Wang","Austin",""],["Yang","Tsung-Yen",""],["Edsinger","Aaron",""],["Kemp","Charlie",""],["Shah","Binit",""],["Kira","Zsolt",""],["Batra","Dhruv",""],["Mottaghi","Roozbeh",""],["Bisk","Yonatan",""],["Paxton","Chris",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 15:15:01 GMT"}],"updateDate":"2024-07-10","timestamp":1720538101000,"abstract":"  In order to develop robots that can effectively serve as versatile and\ncapable home assistants, it is crucial for them to reliably perceive and\ninteract with a wide variety of objects across diverse environments. To this\nend, we proposed Open Vocabulary Mobile Manipulation as a key benchmark task\nfor robotics: finding any object in a novel environment and placing it on any\nreceptacle surface within that environment. We organized a NeurIPS 2023\ncompetition featuring both simulation and real-world components to evaluate\nsolutions to this task. Our baselines on the most challenging version of this\ntask, using real perception in simulation, achieved only an 0.8% success rate;\nby the end of the competition, the best participants achieved an 10.8\\% success\nrate, a 13x improvement. We observed that the most successful teams employed a\nvariety of methods, yet two common threads emerged among the best solutions:\nenhancing error detection and recovery, and improving the integration of\nperception with decision-making processes. In this paper, we detail the results\nand methodologies used, both in simulation and real-world settings. We discuss\nthe lessons learned and their implications for future research. Additionally,\nwe compare performance in real and simulated environments, emphasizing the\nnecessity for robust generalization to novel settings.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}