{"id":"2407.15161","title":"FFHFlow: A Flow-based Variational Approach for Multi-fingered Grasp\n  Synthesis in Real Time","authors":"Qian Feng, Jianxiang Feng, Zhaopeng Chen, Rudolph Triebel, Alois Knoll","authorsParsed":[["Feng","Qian",""],["Feng","Jianxiang",""],["Chen","Zhaopeng",""],["Triebel","Rudolph",""],["Knoll","Alois",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 13:33:08 GMT"}],"updateDate":"2024-07-23","timestamp":1721568788000,"abstract":"  Synthesizing diverse and accurate grasps with multi-fingered hands is an\nimportant yet challenging task in robotics. Previous efforts focusing on\ngenerative modeling have fallen short of precisely capturing the multi-modal,\nhigh-dimensional grasp distribution. To address this, we propose exploiting a\nspecial kind of Deep Generative Model (DGM) based on Normalizing Flows (NFs),\nan expressive model for learning complex probability distributions.\nSpecifically, we first observed an encouraging improvement in diversity by\ndirectly applying a single conditional NFs (cNFs), dubbed FFHFlow-cnf, to learn\na grasp distribution conditioned on the incomplete point cloud. However, we\nalso recognized limited performance gains due to restricted expressivity in the\nlatent space. This motivated us to develop a novel flow-based d Deep Latent\nVariable Model (DLVM), namely FFHFlow-lvm, which facilitates more reasonable\nlatent features, leading to both diverse and accurate grasp synthesis for\nunseen objects. Unlike Variational Autoencoders (VAEs), the proposed DLVM\ncounteracts typical pitfalls such as mode collapse and mis-specified priors by\nleveraging two cNFs for the prior and likelihood distributions, which are\nusually restricted to being isotropic Gaussian. Comprehensive experiments in\nsimulation and real-robot scenarios demonstrate that our method generates more\naccurate and diverse grasps than the VAE baselines. Additionally, a run-time\ncomparison is conducted to reveal its high potential for real-time\napplications.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XXRy42lhH2wIkO4oHbITqFJs2Wv6-szzBxX_dC1TraQ","pdfSize":"8696449"}
