{"id":"2407.00188","title":"A Novel Labeled Human Voice Signal Dataset for Misbehavior Detection","authors":"Ali Raza (Department of Software Engineering The University Of Lahore,\n  Lahore, Pakistan), Faizan Younas (Department of Computer Science &\n  Information Technology, The University Of Lahore, Lahore, Pakistan)","authorsParsed":[["Raza","Ali","","Department of Software Engineering The University Of Lahore,\n  Lahore, Pakistan"],["Younas","Faizan","","Department of Computer Science &\n  Information Technology, The University Of Lahore, Lahore, Pakistan"]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 18:55:07 GMT"}],"updateDate":"2024-07-08","timestamp":1719600907000,"abstract":"  Voice signal classification based on human behaviours involves analyzing\nvarious aspects of speech patterns and delivery styles. In this study, a\nreal-time dataset collection is performed where participants are instructed to\nspeak twelve psychology questions in two distinct manners: first, in a harsh\nvoice, which is categorized as \"misbehaved\"; and second, in a polite manner,\ncategorized as \"normal\". These classifications are crucial in understanding how\ndifferent vocal behaviours affect the interpretation and classification of\nvoice signals. This research highlights the significance of voice tone and\ndelivery in automated machine-learning systems for voice analysis and\nrecognition. This research contributes to the broader field of voice signal\nanalysis by elucidating the impact of human behaviour on the perception and\ncategorization of voice signals, thereby enhancing the development of more\naccurate and context-aware voice recognition technologies.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Tfq7xdlcrKp8L5b1IQjTKxXmTM_MwQGkFA4-PZg-yuw","pdfSize":"251797"}
