{"id":"2407.17368","title":"Magnetoelectric phase control at domain-wall-like epitaxial oxide\n  multilayers","authors":"Elzbieta Gradauskaite, Chia-Jung Yang, Shovon Pal, Manfred Fiebig,\n  Morgan Trassin","authorsParsed":[["Gradauskaite","Elzbieta",""],["Yang","Chia-Jung",""],["Pal","Shovon",""],["Fiebig","Manfred",""],["Trassin","Morgan",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 15:45:37 GMT"}],"updateDate":"2024-07-25","timestamp":1721835937000,"abstract":"  Ferroelectric domain walls are nanoscale objects that can be created,\npositioned, and erased on demand. They often embody functional properties that\nare distinct from the surrounding bulk material. Enhanced conductivity, for\ninstance, is observed at charged ferroelectric domain walls. Regrettably,\ndomain walls of this type are scarce because of the energetically unfavorable\nelectrostatics. This hinders the current technological development of\ndomain-wall nanoelectronics. Here we overcome this constraint by creating\nrobust domain-wall-like objects in epitaxial oxide heterostructures. We design\ncharged head-to-head (HH) and tail-to-tail (TT) junctions with two\nferroelectric layers (BaTiO$_{3}$ and BiFeO$_{3}$) that have opposing\nout-of-plane polarization. To test domain-wall-like functionalities, we insert\nan ultrathin ferromagnetic La$_{0.7}$Sr$_{0.3}$MnO$_{3}$ layer into the\njunctions. The interfacial electron or hole accumulation at the interfaces, set\nby the HH and TT polarization configurations, respectively, controls the LSMO\nconductivity and magnetization. We thus propose that trilayers reminiscent of\nartificial domain walls provide magnetoelectric functionality and may\nconstitute an important building block in the design of oxide-based electronic\ndevices.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NS400ORcxjImrePKic4SJt1LbjeB0iI_ct-yavb2Kko","pdfSize":"1230386"}
