{"id":"2407.09056","title":"A Novel Quantum Realization of Jet Clustering in High-Energy Physics\n  Experiments","authors":"Yongfeng Zhu, Weifeng Zhuang, Chen Qian, Yunheng Ma, Dong E. Liu,\n  Manqi Ruan, Chen Zhou","authorsParsed":[["Zhu","Yongfeng",""],["Zhuang","Weifeng",""],["Qian","Chen",""],["Ma","Yunheng",""],["Liu","Dong E.",""],["Ruan","Manqi",""],["Zhou","Chen",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 07:26:22 GMT"}],"updateDate":"2024-07-15","timestamp":1720769182000,"abstract":"  Exploring the application of quantum technologies to fundamental sciences\nholds the key to fostering innovation for both sides. In high-energy particle\ncollisions, quarks and gluons are produced and immediately form collimated\nparticle sprays known as jets. Accurate jet clustering is crucial as it retains\nthe information of the originating quark or gluon and forms the basis for\nstudying properties of the Higgs boson, which underlies teh mechanism of mass\ngeneration for subatomic particles. For the first time, by mapping collision\nevents into graphs--with particles as nodes and their angular separations as\nedges--we realize jet clustering using the Quantum Approximate Optimization\nAlgorithm (QAOA), a hybrid quantum-classical algorithm for addressing classical\ncombinatorial optimization problems with available quantum resources. Our\nresults, derived from 30 qubits on quantum computer simulator and 6 qubits on\nquantum computer hardware, demonstrate that jet clustering performance with\nQAOA is comparable with or even better than classical algorithms for a\nsmall-sized problem. This study highlights the feasibility of quantum computing\nto revolutionize jet clustering, bringing the practical application of quantum\ncomputing in high-energy physics experiments one step closer.\n","subjects":["Physics/Quantum Physics","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"GgIKLBiTd0I54lYj-gOB1_8eW0PULU81Dq8OSwO1uKE","pdfSize":"1785080"}
