{"id":"2407.17398","title":"3D Question Answering for City Scene Understanding","authors":"Penglei Sun, Yaoxian Song, Xiang Liu, Xiaofei Yang, Qiang Wang,\n  Tiefeng Li, Yang Yang, and Xiaowen Chu","authorsParsed":[["Sun","Penglei",""],["Song","Yaoxian",""],["Liu","Xiang",""],["Yang","Xiaofei",""],["Wang","Qiang",""],["Li","Tiefeng",""],["Yang","Yang",""],["Chu","Xiaowen",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 16:22:27 GMT"}],"updateDate":"2024-07-25","timestamp":1721838147000,"abstract":"  3D multimodal question answering (MQA) plays a crucial role in scene\nunderstanding by enabling intelligent agents to comprehend their surroundings\nin 3D environments. While existing research has primarily focused on indoor\nhousehold tasks and outdoor roadside autonomous driving tasks, there has been\nlimited exploration of city-level scene understanding tasks. Furthermore,\nexisting research faces challenges in understanding city scenes, due to the\nabsence of spatial semantic information and human-environment interaction\ninformation at the city level.To address these challenges, we investigate 3D\nMQA from both dataset and method perspectives. From the dataset perspective, we\nintroduce a novel 3D MQA dataset named City-3DQA for city-level scene\nunderstanding, which is the first dataset to incorporate scene semantic and\nhuman-environment interactive tasks within the city. From the method\nperspective, we propose a Scene graph enhanced City-level Understanding method\n(Sg-CityU), which utilizes the scene graph to introduce the spatial semantic. A\nnew benchmark is reported and our proposed Sg-CityU achieves accuracy of 63.94\n% and 63.76 % in different settings of City-3DQA. Compared to indoor 3D MQA\nmethods and zero-shot using advanced large language models (LLMs), Sg-CityU\ndemonstrates state-of-the-art (SOTA) performance in robustness and\ngeneralization.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}