{"id":"2407.09350","title":"Heterogeneous integration of amorphous silicon carbide on thin film\n  lithium niobate","authors":"Zizheng Li, Naresh Sharma, Bruno Lopez-Rodriguez, Roald van der Kolk,\n  Thomas Scholte, Hugo Voncken, Jasper van der Boom, Simon Gr\\\"oblacher, and\n  Iman Esmaeil Zadeh","authorsParsed":[["Li","Zizheng",""],["Sharma","Naresh",""],["Lopez-Rodriguez","Bruno",""],["van der Kolk","Roald",""],["Scholte","Thomas",""],["Voncken","Hugo",""],["van der Boom","Jasper",""],["Gröblacher","Simon",""],["Zadeh","Iman Esmaeil",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 15:24:16 GMT"}],"updateDate":"2024-07-15","timestamp":1720797856000,"abstract":"  In the past decade, lithium niobate (LiNbO3 or LN) photonics, thanks to its\nheat-free and fast electro-optical modulation, second-order non-linearities and\nlow loss, has been extensively investigated. Despite numerous demonstrations of\nhigh-performance LN photonics, processing lithium niobate remains challenging\nand suffers from incompatibilities with standard complementary metal-oxide\nsemiconductor (CMOS) fabrication lines, limiting its scalability. Silicon\ncarbide (SiC) is an emerging material platform with a high refractive index, a\nlarge non-linear Kerr coefficient, and a promising candidate for heterogeneous\nintegration with LN photonics. Current approaches of SiC/LN integration require\ntransfer-bonding techniques, which are time-consuming, expensive, and lack\nprecision in layer thickness. Here we show that amorphous silicon carbide\n(a-SiC), deposited using inductively coupled plasma enhanced chemical vapor\ndeposition (ICPCVD) at low temperatures (< 165 C), can be conveniently\nintegrated with LiNbO3 and processed to form high-performance photonics. Most\nimportantly, the fabrication only involves a standard, silicon-compatible,\nreactive ion etching step and leaves the LiNbO3 intact, hence its compatibility\nwith standard foundry processes. As a proof-of-principle, we fabricated\nwaveguides and ring resonators on the developed a-SiC/LN platform and achieved\nintrinsic quality factors higher than 106,000 and resonance electro-optic\ntunability of 3.4 pm/V with 3 mm tuning length. We showcase the possibility of\ndense integration by fabricating and testing ring resonators with 40um radius\nwithout a noticeable loss penalty. Our platform offers a CMOS-compatible and\nscalable approach for implementation of future fast electro-optic modulators\nand reconfigurable photonic circuits as well as nonlinear processes which can\nbenefit from involving both second and third-order nonlinearities.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}