{"id":"2407.05338","title":"A Blueprint for Auditing Generative AI","authors":"Jakob Mokander and Justin Curl and Mihir Kshirsagar","authorsParsed":[["Mokander","Jakob",""],["Curl","Justin",""],["Kshirsagar","Mihir",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 11:56:54 GMT"}],"updateDate":"2024-07-09","timestamp":1720353414000,"abstract":"  The widespread use of generative AI systems is coupled with significant\nethical and social challenges. As a result, policymakers, academic researchers,\nand social advocacy groups have all called for such systems to be audited.\nHowever, existing auditing procedures fail to address the governance challenges\nposed by generative AI systems, which display emergent capabilities and are\nadaptable to a wide range of downstream tasks. In this chapter, we address that\ngap by outlining a novel blueprint for how to audit such systems. Specifically,\nwe propose a three-layered approach, whereby governance audits (of technology\nproviders that design and disseminate generative AI systems), model audits (of\ngenerative AI systems after pre-training but prior to their release), and\napplication audits (of applications based on top of generative AI systems)\ncomplement and inform each other. We show how audits on these three levels,\nwhen conducted in a structured and coordinated manner, can be a feasible and\neffective mechanism for identifying and managing some of the ethical and social\nrisks posed by generative AI systems. That said, it is important to remain\nrealistic about what auditing can reasonably be expected to achieve. For this\nreason, the chapter also discusses the limitations not only of our\nthree-layered approach but also of the prospect of auditing generative AI\nsystems at all. Ultimately, this chapter seeks to expand the methodological\ntoolkit available to technology providers and policymakers who wish to analyse\nand evaluate generative AI systems from technical, ethical, and legal\nperspectives.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}