{"id":"2407.10050","title":"Entropy Increasing Numerical Methods for Prediction of Reversible and\n  Irreversible Heating in Supercapacitors","authors":"Jie Ding and Xiang Ji and Shenggao Zhou","authorsParsed":[["Ding","Jie",""],["Ji","Xiang",""],["Zhou","Shenggao",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 02:26:35 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 08:42:43 GMT"},{"version":"v3","created":"Sun, 15 Sep 2024 14:25:00 GMT"}],"updateDate":"2024-09-17","timestamp":1720923995000,"abstract":"  Accurate characterization of entropy plays a pivotal role in capturing\nreversible and irreversible heating in supercapacitors during\ncharging/discharging cycles. However, numerical methods that can faithfully\ncapture entropy variation in supercapacitors are still in lack. This work\ndevelops first-order and second-order finite-volume schemes for the prediction\nof non-isothermal electrokinetics in supercapacitors. Semi-implicit\ndiscretization that decouples temperature from ionic concentrations and\nelectric potential results in an efficient first-order accurate scheme. Its\nnumerical analysis theoretically establishes the unique solvability of the\nnonlinear scheme with the existence of positive ionic concentrations and\ntemperature at discrete level. To obtain an entropy-increasing second-order\nscheme, a modified Crank-Nicolson approach is proposed for discretization of\nthe logarithm of both temperature and ionic concentrations, which is employed\nto enforce numerical positivity. Moreover, numerical analysis rigorously\ndemonstrates that both first-order and second-order schemes are able to\nunconditionally preserve ionic mass conservation and original entropy increase\nfor a closed, thermally insulated supercapacitor. Extensive numerical\nsimulations show that the proposed schemes have expected accuracy and robust\nperformance in preserving the desired properties. Temperature oscillation in\nthe charging/discharging processes is successfully predicted, unraveling a\nquadratic scaling law of temperature rising slope against voltage scanning\nrate. It is also demonstrated that the variation of ionic entropy contribution,\nwhich is the underlying mechanism responsible for reversible heating, is\nfaithfully captured. Our work provides a promising tool in predicting\nreversible and irreversible heating in supercapacitors.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}