{"id":"2407.21690","title":"Experimentally probing Landauer's principle in the quantum many-body\n  regime","authors":"Stefan Aimet, Mohammadamin Tajik, Gabrielle Tournaire, Philipp\n  Sch\\\"uttelkopf, Jo\\~ao Sabino, Spyros Sotiriadis, Giacomo Guarnieri, J\\\"org\n  Schmiedmayer, Jens Eisert","authorsParsed":[["Aimet","Stefan",""],["Tajik","Mohammadamin",""],["Tournaire","Gabrielle",""],["Schüttelkopf","Philipp",""],["Sabino","João",""],["Sotiriadis","Spyros",""],["Guarnieri","Giacomo",""],["Schmiedmayer","Jörg",""],["Eisert","Jens",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:37:06 GMT"}],"updateDate":"2024-08-05","timestamp":1722440226000,"abstract":"  Landauer's principle bridges information theory and thermodynamics by linking\nthe entropy change of a system during a process to the average energy\ndissipated to its environment. Although typically discussed in the context of\nerasing a single bit of information, Landauer's principle can be generalised to\ncharacterise irreversibility in out-of-equilibrium processes, such as those\ninvolving complex quantum many-body systems. Specifically, the relationship\nbetween the entropy change of the system and the energy dissipated to its\nenvironment can be decomposed into changes in quantum mutual information and a\ndifference in relative entropies of the environment. Here we experimentally\nprobe Landauer's principle in the quantum many-body regime using a quantum\nfield simulator of ultracold Bose gases. Employing a dynamical tomographic\nreconstruction scheme, we track the temporal evolution of the quantum field\nfollowing a global mass quench from a Klein-Gordon to a Tomonaga-Luttinger\nliquid model and analyse the information-theoretic contributions to Landauer's\nprinciple for various system-environment partitions of the composite system.\nOur results agree with theoretical predictions, interpreted using a\nsemi-classical quasiparticle picture. Our work demonstrates the potential of\nultracold atom-based quantum field simulators to experimentally investigate\nquantum thermodynamics.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Quantum Gases","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"g82XrIhpKe2GWNL4GIKWLOETW_F8otK_4M8-A1VA5w4","pdfSize":"1784883","objectId":"0x5e3e24168f161efa171bf8e13b0853421cdea6b627056db4a8a09790e78ce172","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
