{"id":"2407.13324","title":"A millisecond pulsar position determined to 0.2 milliarcsecond precision\n  with VLBI","authors":"Hao Ding, Adam T. Deller, Paulo C. C. Freire, Leonid Petrov","authorsParsed":[["Ding","Hao",""],["Deller","Adam T.",""],["Freire","Paulo C. C.",""],["Petrov","Leonid",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:24:07 GMT"}],"updateDate":"2024-07-19","timestamp":1721294647000,"abstract":"  Precise millisecond pulsar (MSP) positions determined with very long baseline\ninterferometry (VLBI) hold the key to building the connection between the\nkinematic and dynamic reference frames respectively used by VLBI and pulsar\ntiming. The frame connection would provide an important pathway to examining\nthe planetary ephemerides used in pulsar timing, and potentially enhancing the\nsensitivities of pulsar timing arrays used to detect stochastic\ngravitational-wave background at nano-Hz regime. We aim at significantly\nimproving the VLBI-based MSP position from its current $\\gtrsim1\\,$mas\nprecision level by reducing the two dominant components in the positional\nuncertainty -- the propagation-related uncertainty and the uncertainty\nresulting from the frequency-dependent core shifts of the reference sources. We\nintroduce a new differential astrometry strategy of using multiple calibrators\nobserved at several widely separated frequencies, which we call PINPT\n(Phase-screen Interpolation plus frequeNcy-dePendent core shifT correction;\nread as \"pinpoint\") for brevity. The strategy allows determination of the\ncore-shift and mitigates the impact of residual delay in the atmosphere. We\nimplemented the strategy on PSR J2222-0137, an MSP well constrained\nastrometrically with VLBI and pulsar timing. Using the PINPT strategy, we\ndetermined core shifts for 4 AGNs around PSR J2222-0137, and derived a\nVLBI-based pulsar position with uncertainty of 0.17 mas and 0.32 mas in right\nascension and declination, respectively, approaching the uncertainty level of\nthe best-determined timing-based MSP positions. The realization of the PINPT\nstrategy promises a factor-of-5 positional precision enhancement (over\nconventional VLBI astrometry) for all kinds of compact radio sources observed\nat $\\lesssim2$ GHz, including most fast radio bursts.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}