{"id":"2407.13646","title":"Beyond Dropout: Robust Convolutional Neural Networks Based on Local\n  Feature Masking","authors":"Yunpeng Gong and Chuangliang Zhang and Yongjie Hou and Lifei Chen and\n  Min Jiang","authorsParsed":[["Gong","Yunpeng",""],["Zhang","Chuangliang",""],["Hou","Yongjie",""],["Chen","Lifei",""],["Jiang","Min",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:25:16 GMT"}],"updateDate":"2024-07-19","timestamp":1721319916000,"abstract":"  In the contemporary of deep learning, where models often grapple with the\nchallenge of simultaneously achieving robustness against adversarial attacks\nand strong generalization capabilities, this study introduces an innovative\nLocal Feature Masking (LFM) strategy aimed at fortifying the performance of\nConvolutional Neural Networks (CNNs) on both fronts. During the training phase,\nwe strategically incorporate random feature masking in the shallow layers of\nCNNs, effectively alleviating overfitting issues, thereby enhancing the model's\ngeneralization ability and bolstering its resilience to adversarial attacks.\nLFM compels the network to adapt by leveraging remaining features to compensate\nfor the absence of certain semantic features, nurturing a more elastic feature\nlearning mechanism. The efficacy of LFM is substantiated through a series of\nquantitative and qualitative assessments, collectively showcasing a consistent\nand significant improvement in CNN's generalization ability and resistance\nagainst adversarial attacks--a phenomenon not observed in current and prior\nmethodologies. The seamless integration of LFM into established CNN frameworks\nunderscores its potential to advance both generalization and adversarial\nrobustness within the deep learning paradigm. Through comprehensive\nexperiments, including robust person re-identification baseline generalization\nexperiments and adversarial attack experiments, we demonstrate the substantial\nenhancements offered by LFM in addressing the aforementioned challenges. This\ncontribution represents a noteworthy stride in advancing robust neural network\narchitectures.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"A3254lkJQ53vBrCMGFWsNKUL2eXem1qUozfHeZO27vQ","pdfSize":"1010811","objectId":"0xa7e25f85bd434adbe30851010c477f822650799fd35c1ff83e69b7afcb6db11d","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
