{"id":"2407.10286","title":"The inadequacy of the $\\rho$-T curve for phase transitions in the\n  presence of magnetic fields","authors":"Shengnan Zhang, Zhong Fang, Hongming Weng and Quansheng Wu","authorsParsed":[["Zhang","Shengnan",""],["Fang","Zhong",""],["Weng","Hongming",""],["Wu","Quansheng",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-16","timestamp":1720980001000,"abstract":"  The $\\rho(T)$ curve is traditionally employed to discern metallic,\nsemiconductor, and insulating behaviors in materials, with any deviations often\ninterpreted as indicative of phase transitions. However, does this\ninterpretation hold under the influence of a magnetic field? Our research\naddresses this critical question by reevaluating the $\\rho(T)$ curve in the\npresence of magnetic field. We uncover that metal-insulator shifts and\nreentrant metallic states may not indicate true phase transitions but rather\noriginate from the scaling behavior of magnetoresistance, influenced by\nmagnetic field and temperature through a power-law dependence. Employing\nadvanced first-principles calculations and the Boltzmann method, we analyzed\nthe magnetoresistance of SiP$_2$ and NbP across a range of conditions,\nsuccessfully explaining not only the reentrant behavior observed in experiments\nbut also resolving the discrepancies in magnetoresistance behavior reported by\ndifferent research groups. These findings challenge the conventional use of the\n$\\rho(T)$ curve as a straightforward indicator of phase transitions under\nmagnetic conditions, highlighting the essential need to exclude typical\nmagnetoresistance effects due to the Lorentz force before confirming such\ntransitions. This novel insight reshapes our understanding of complex material\nproperties in magnetic fields and sets a new precedent for the interpretation\nof transport phenomena in condensed matter physics.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}