{"id":"2407.14406","title":"The VLT/ERIS vortex coronagraph: design, pointing control, and on-sky\n  performance","authors":"Gilles Orban de Xivry, Olivier Absil, Robert J. De Rosa, Markus J.\n  Bonse, Felix Dannert, Jean Hayoz, Paolo Grani, Alfio Puglisi, Andrea\n  Baruffolo, Bernardo Salasnich, Ric Davies, Adrian M. Glauser, Elsa Huby,\n  Matthew Kenworthy, Sascha P. Quanz, William Taylor, and G\\'erard Zins","authorsParsed":[["de Xivry","Gilles Orban",""],["Absil","Olivier",""],["De Rosa","Robert J.",""],["Bonse","Markus J.",""],["Dannert","Felix",""],["Hayoz","Jean",""],["Grani","Paolo",""],["Puglisi","Alfio",""],["Baruffolo","Andrea",""],["Salasnich","Bernardo",""],["Davies","Ric",""],["Glauser","Adrian M.",""],["Huby","Elsa",""],["Kenworthy","Matthew",""],["Quanz","Sascha P.",""],["Taylor","William",""],["Zins","Gérard",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:34:13 GMT"}],"updateDate":"2024-07-22","timestamp":1721403253000,"abstract":"  The Enhanced Resolution Imager and Spectrograph (ERIS) is the new\nnear-infrared instrument at the VLT-UT4. ERIS replaces and extends the\nobservational capabilities formerly provided by SINFONI and NACO: integral\nfield spectroscopy at 1 - 2.5 $\\mu$m, imaging at 1 - 5 $\\mu$m with several\noptions for high-contrast imaging, and long-slit spectroscopy. In particular, a\nvortex coronagraph is now available for high contrast observations at L and M\nband. It is implemented using annular groove (or vortex) phase masks (one for\neach of the L and M bands) in a focal plane, and a Lyot stop in a downstream\npupil plane. The vortex coronagraph has a discovery space starting already at\n$\\sim$1$\\lambda/D$, and works well in broadbands. However, to reach its optimal\nperformance, it is critical to correct for slow pointing errors onto the vortex\nphase mask, which mandates a dedicated pointing control strategy. To do so, a\ncontrol loop based on the QACITS algorithm has been developed and commissioned\nfor ERIS. Good pointing stability is now regularly achieved with errors between\n0.01 and 0.02 $\\lambda/D$ and a correction rate of 0.2 Hz. In this\ncontribution, we first review the design of the ERIS vortex coronagraph. We\nthen detail the implementation of the QACITS algorithm describing the entire\nobserving sequence, including the calibration steps, the initial centering, and\nthe stabilization during the observing template. We then discuss performance\nbased on commissioning data in terms of pointing accuracy and stability.\nFinally, we present post-processed contrast curves obtained during\ncommissioning and compare them with NACO vortex data, showing a significant\nimprovement of about 1 mag at all separations.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"n5p6xspNtdvXhX29Nj22ZepRl5a68zfGctetdg8Ih1Y","pdfSize":"3167837","objectId":"0x56d3d74ffe9c93b2457cf7cc43ca37efc3ca7518691046e95eb6c8586efa8813","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
