{"id":"2407.10528","title":"Local Action-Guided Motion Diffusion Model for Text-to-Motion Generation","authors":"Peng Jin, Hao Li, Zesen Cheng, Kehan Li, Runyi Yu, Chang Liu,\n  Xiangyang Ji, Li Yuan, Jie Chen","authorsParsed":[["Jin","Peng",""],["Li","Hao",""],["Cheng","Zesen",""],["Li","Kehan",""],["Yu","Runyi",""],["Liu","Chang",""],["Ji","Xiangyang",""],["Yuan","Li",""],["Chen","Jie",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 08:35:00 GMT"}],"updateDate":"2024-07-16","timestamp":1721032500000,"abstract":"  Text-to-motion generation requires not only grounding local actions in\nlanguage but also seamlessly blending these individual actions to synthesize\ndiverse and realistic global motions. However, existing motion generation\nmethods primarily focus on the direct synthesis of global motions while\nneglecting the importance of generating and controlling local actions. In this\npaper, we propose the local action-guided motion diffusion model, which\nfacilitates global motion generation by utilizing local actions as fine-grained\ncontrol signals. Specifically, we provide an automated method for reference\nlocal action sampling and leverage graph attention networks to assess the\nguiding weight of each local action in the overall motion synthesis. During the\ndiffusion process for synthesizing global motion, we calculate the local-action\ngradient to provide conditional guidance. This local-to-global paradigm reduces\nthe complexity associated with direct global motion generation and promotes\nmotion diversity via sampling diverse actions as conditions. Extensive\nexperiments on two human motion datasets, i.e., HumanML3D and KIT, demonstrate\nthe effectiveness of our method. Furthermore, our method provides flexibility\nin seamlessly combining various local actions and continuous guiding weight\nadjustment, accommodating diverse user preferences, which may hold potential\nsignificance for the community. The project page is available at\nhttps://jpthu17.github.io/GuidedMotion-project/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}