{"id":"2407.03668","title":"Reliable Projection Based Unsupervised Learning for Semi-Definite QCQP\n  with Application of Beamforming Optimization","authors":"Xiucheng Wang and Qi Qiu and Nan Cheng","authorsParsed":[["Wang","Xiucheng",""],["Qiu","Qi",""],["Cheng","Nan",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 06:26:01 GMT"},{"version":"v2","created":"Tue, 9 Jul 2024 07:22:42 GMT"}],"updateDate":"2024-07-10","timestamp":1720074361000,"abstract":"  In this paper, we investigate a special class of quadratic-constrained\nquadratic programming (QCQP) with semi-definite constraints. Traditionally,\nsince such a problem is non-convex and N-hard, the neural network (NN) is\nregarded as a promising method to obtain a high-performing solution. However,\ndue to the inherent prediction error, it is challenging to ensure all solution\noutput by the NN is feasible. Although some existing methods propose some naive\nmethods, they only focus on reducing the constraint violation probability,\nwhere not all solutions are feasibly guaranteed. To deal with the above\nchallenge, in this paper a computing efficient and reliable projection is\nproposed, where all solution output by the NN are ensured to be feasible.\nMoreover, unsupervised learning is used, so the NN can be trained effectively\nand efficiently without labels. Theoretically, the solution of the NN after\nprojection is proven to be feasible, and we also prove the projection method\ncan enhance the convergence performance and speed of the NN. To evaluate our\nproposed method, the quality of service (QoS)-contained beamforming scenario is\nstudied, where the simulation results show the proposed method can achieve\nhigh-performance which is competitive with the lower bound.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}