{"id":"2407.04303","title":"Transmission spectroscopy of CF$_4$ molecules in intense x-ray fields","authors":"Rui Jin, Adam Fouda, Alexander Magunia, Yeonsig Nam, Marc Rebholz,\n  Alberto De Fanis, Kai Li, Gilles Doumy, Thomas M. Baumann, Michael Straub,\n  Sergey Usenko, Yevheniy Ovcharenko, Tommaso Mazza, Jacobo Monta\\~no, Marcus\n  Ag{\\aa}ker, Maria Novella Piancastelli, Marc Simon, Jan-Erik Rubensson,\n  Michael Meyer, Linda Young, Christian Ott, and Thomas Pfeifer","authorsParsed":[["Jin","Rui",""],["Fouda","Adam",""],["Magunia","Alexander",""],["Nam","Yeonsig",""],["Rebholz","Marc",""],["De Fanis","Alberto",""],["Li","Kai",""],["Doumy","Gilles",""],["Baumann","Thomas M.",""],["Straub","Michael",""],["Usenko","Sergey",""],["Ovcharenko","Yevheniy",""],["Mazza","Tommaso",""],["Montaño","Jacobo",""],["Agåker","Marcus",""],["Piancastelli","Maria Novella",""],["Simon","Marc",""],["Rubensson","Jan-Erik",""],["Meyer","Michael",""],["Young","Linda",""],["Ott","Christian",""],["Pfeifer","Thomas",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 07:12:43 GMT"}],"updateDate":"2024-07-08","timestamp":1720163563000,"abstract":"  The nonlinear interaction of x-rays with matter is at the heart of\nunderstanding and controlling ultrafast molecular dynamics from an\natom-specific viewpoint, providing new scientific and analytical opportunities\nto explore the structure and dynamics of small quantum systems. At increasingly\nhigh x-ray intensity, the sensitivity of ultrashort x-ray pulses to specific\nelectronic states and emerging short-lived transient intermediates is of\nparticular relevance for our understanding of fundamental multi-photon\nabsorption processes. In this work, intense x-ray free-electron laser (XFEL)\npulses at the European XFEL (EuXFEL) are combined with a gas cell and grating\nspectrometer for a high-intensity transmission spectroscopy study of\nmultiphoton-induced ultrafast molecular fragmentation dynamics in CF$_4$. This\napproach unlocks the direct intra-pulse observation of transient fragments,\nincluding neutral atoms, by their characteristic absorption lines in the\ntransmitted broad-band x-ray spectrum. The dynamics with and without initially\nproducing fluorine K-shell holes are studied by tuning the central photon\nenergy. The absorption spectra are measured at different FEL intensities to\nobserve nonlinear effects. Transient isolated fluorine atoms and ions are\nspectroscopically recorded within the ultrashort pulse duration of few tens of\nfemtoseconds. An isosbestic point that signifies the correlated transition\nbetween intact neutral CF$_4$ molecules and charged atomic fragments is\nobserved near the fluorine K-edge. The dissociation dynamics and the\nmultiphoton absorption-induced dynamics encoded in the spectra are\ntheoretically interpreted. Overall, this study demonstrates the potential of\nhigh-intensity x-ray transmission spectroscopy to study ultrafast molecular\ndynamics with sensitivity to specific intermediate species and their electronic\nstructure.\n","subjects":["Physics/Atomic Physics","Physics/Chemical Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}