{"id":"2407.08643","title":"JADES -- The Rosetta Stone of JWST-discovered AGN: deciphering the\n  intriguing nature of early AGN","authors":"Ignas Juod\\v{z}balis, Xihan Ji, Roberto Maiolino, Francesco D'Eugenio,\n  Jan Scholtz, Guido Risaliti, Andrew C. Fabian, Giovanni Mazzolari, Roberto\n  Gilli, Isabella Prandoni, Santiago Arribas, Andrew J. Bunker, Stefano\n  Carniani, St\\'ephane Charlot, Emma Curtis-Lake, Anna de Graaff, Kevin\n  Hainline, Eleonora Parlanti, Michele Perna, Pablo G. P\\'erez-Gonz\\'alez,\n  Brant Robertson, Sandro Tacchella, Hannah \\\"Ubler, Christina C. Williams,\n  Chris Willott, Joris Witstok","authorsParsed":[["Juodžbalis","Ignas",""],["Ji","Xihan",""],["Maiolino","Roberto",""],["D'Eugenio","Francesco",""],["Scholtz","Jan",""],["Risaliti","Guido",""],["Fabian","Andrew C.",""],["Mazzolari","Giovanni",""],["Gilli","Roberto",""],["Prandoni","Isabella",""],["Arribas","Santiago",""],["Bunker","Andrew J.",""],["Carniani","Stefano",""],["Charlot","Stéphane",""],["Curtis-Lake","Emma",""],["de Graaff","Anna",""],["Hainline","Kevin",""],["Parlanti","Eleonora",""],["Perna","Michele",""],["Pérez-González","Pablo G.",""],["Robertson","Brant",""],["Tacchella","Sandro",""],["Übler","Hannah",""],["Williams","Christina C.",""],["Willott","Chris",""],["Witstok","Joris",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 16:23:28 GMT"}],"updateDate":"2024-07-12","timestamp":1720715008000,"abstract":"  JWST has discovered a large population of Active Galactic Nuclei (AGN) at\nhigh redshift. Many of these newly discovered AGN have broad permitted lines\n(typically H$\\alpha$), but are extremely weak in the X-rays. Here we present\nthe NIRSpec spectrum of the most extreme of these objects, GN-28074, an AGN at\n$z=2.26$ with prominent Balmer, Paschen and \\HeI broad lines, and with the\nhighest limit on the bolometric to X-ray luminosity ratio among all\nspectroscopically confirmed AGN in GOODS. This source is also characterized by\na mid-IR excess, most likely associated with the AGN torus' hot dust. The high\nbolometric luminosity and moderate redshift of this AGN allow us to explore its\nproperties more in depth relative to other JWST-discovered AGN. The NIRSpec\nspectrum reveals prominent, slightly blueshifted absorption of H$\\alpha$,\nH$\\beta$ and \\HeI$\\lambda$10830. The Balmer absorption lines require gas with\ndensities of $n_{\\rm H}> 10^8~{\\rm cm}^{-3}$, inconsistent with an ISM origin,\nbut fully consistent with clouds in the Broad Line Region (BLR). This finding\nsuggests that at least part of the X-ray weakness is due to high (Compton\nthick) X-ray absorption by (dust-free) clouds in the BLR, or in its outer,\nslowly outflowing regions. GN-28074 is also extremely radio-weak. The radio\nweakness can also be explained in terms of absorption, as the inferred density\nof the clouds responsible for H$\\alpha$ absorption makes them optically thick\nto radio emission through free-free absorption. Alternatively, in this and\nother JWST-discovered AGN, the nuclear magnetic field may have not developed\nproperly yet, resulting both in intrinsically weak radio emission and also lack\nof hot corona, hence intrinsic X-ray weakness. Finally, we show that recently\nproposed scenarios, invoking hyper-dense and ultra-metal-poor outflows or Raman\nscattering to explain the broad H$\\alpha$, are completely ruled out.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}