{"id":"2407.09676","title":"An efficient algorithm to compute the minimum free energy of interacting\n  nucleic acid strands","authors":"Ahmed Shalaby, Damien Woods","authorsParsed":[["Shalaby","Ahmed",""],["Woods","Damien",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 20:17:02 GMT"}],"updateDate":"2024-07-16","timestamp":1720815422000,"abstract":"  The information-encoding molecules RNA and DNA form a combinatorially large\nset of secondary structures through nucleic acid base pairing. Thermodynamic\nprediction algorithms predict favoured, or minimum free energy (MFE), secondary\nstructures, and can assign an equilibrium probability to any structure via the\npartition function: a Boltzman-weighted sum over the set of secondary\nstructures. MFE is NP-hard in the presence pseudoknots, base pairings that\nviolate a restricted planarity condition. However, unpseudoknotted structures\nare amenable to dynamic programming: for a single DNA/RNA strand there are\npolynomial time algorithms for MFE and partition function. For multiple\nstrands, the problem is more complicated due to entropic penalties. Dirks et al\n[SICOMP Review; 2007] showed that for O(1) strands, with N bases, there is a\npolynomial time in N partition function algorithm, however their technique did\nnot generalise to MFE which they left open. We give the first polynomial time\n(O(N^4)) algorithm for unpseudoknotted multiple (O(1)) strand MFE, answering\nthe open problem from Dirks et al. The challenge lies in considering rotational\nsymmetry of secondary structures, a feature not immediately amenable to dynamic\nprogramming algorithms. Our proof has two main technical contributions: First,\na polynomial upper bound on the number of symmetric secondary structures to be\nconsidered when computing rotational symmetry penalties. Second, that bound is\nleveraged by a backtracking algorithm to find the MFE in an exponential space\nof contenders. Our MFE algorithm has the same asymptotic run time as Dirks et\nal's partition function algorithm, suggesting efficient handling of rotational\nsymmetry, although higher space complexity. It also seems reasonably tight in\nthe number of strands since Codon, Hajiaghayi & Thachuk [DNA27, 2021] have\nshown that unpseudoknotted MFE is NP-hard for O(N) strands.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Computational Complexity","Computing Research Repository/Discrete Mathematics","Physics/Biological Physics","Quantitative Biology/Biomolecules"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}