{"id":"2407.21367","title":"Blink: Fast Automated Design of Run-Time Power Monitors on FPGA-Based\n  Computing Platforms","authors":"Andrea Galimberti, Michele Piccoli, Davide Zoni","authorsParsed":[["Galimberti","Andrea",""],["Piccoli","Michele",""],["Zoni","Davide",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 06:31:41 GMT"}],"updateDate":"2024-08-01","timestamp":1722407501000,"abstract":"  The current over-provisioned heterogeneous multi-cores require effective\nrun-time optimization strategies, and the run-time power monitoring subsystem\nis paramount for their success. Several state-of-the-art methodologies address\nthe design of a run-time power monitoring infrastructure for generic computing\nplatforms. However, the power model's training requires time-consuming\ngate-level simulations that, coupled with the ever-increasing complexity of the\nmodern heterogeneous platforms, dramatically hinder the usability of such\nsolutions. This paper introduces Blink, a scalable framework for the fast and\nautomated design of run-time power monitoring infrastructures targeting\ncomputing platforms implemented on FPGA. Blink optimizes the time-to-solution\nto deliver the run-time power monitoring infrastructure by replacing\ntraditional methodologies' gate-level simulations and power trace computations\nwith behavioral simulations and direct power trace measurements. Applying Blink\nto multiple designs mixing a set of HLS-generated accelerators from a\nstate-of-the-art benchmark suite demonstrates an average time-to-solution\nspeedup of 18 times without affecting the quality of the run-time power\nestimates.\n","subjects":["Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"p227gJunl4g25O3iTPHVjBGStiV-oiKYP5fdu4zHiMU","pdfSize":"226416","objectId":"0x7c03dbf563dcb4b39759bf53e5d9ec845de22a597fe3bb8b0cbc4c8713ef3b4c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
