{"id":"2407.12501","title":"EmoFace: Audio-driven Emotional 3D Face Animation","authors":"Chang Liu, Qunfen Lin, Zijiao Zeng, Ye Pan","authorsParsed":[["Liu","Chang",""],["Lin","Qunfen",""],["Zeng","Zijiao",""],["Pan","Ye",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 11:32:16 GMT"}],"updateDate":"2024-08-06","timestamp":1721215936000,"abstract":"  Audio-driven emotional 3D face animation aims to generate emotionally\nexpressive talking heads with synchronized lip movements. However, previous\nresearch has often overlooked the influence of diverse emotions on facial\nexpressions or proved unsuitable for driving MetaHuman models. In response to\nthis deficiency, we introduce EmoFace, a novel audio-driven methodology for\ncreating facial animations with vivid emotional dynamics. Our approach can\ngenerate facial expressions with multiple emotions, and has the ability to\ngenerate random yet natural blinks and eye movements, while maintaining\naccurate lip synchronization. We propose independent speech encoders and\nemotion encoders to learn the relationship between audio, emotion and\ncorresponding facial controller rigs, and finally map into the sequence of\ncontroller values. Additionally, we introduce two post-processing techniques\ndedicated to enhancing the authenticity of the animation, particularly in\nblinks and eye movements. Furthermore, recognizing the scarcity of emotional\naudio-visual data suitable for MetaHuman model manipulation, we contribute an\nemotional audio-visual dataset and derive control parameters for each frames.\nOur proposed methodology can be applied in producing dialogues animations of\nnon-playable characters (NPCs) in video games, and driving avatars in virtual\nreality environments. Our further quantitative and qualitative experiments, as\nwell as an user study comparing with existing researches show that our approach\ndemonstrates superior results in driving 3D facial models. The code and sample\ndata are available at https://github.com/SJTU-Lucy/EmoFace.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}