{"id":"2407.16017","title":"Energy-dependent and energy-integrated two-moment general-relativistic\n  neutrino transport simulations of hypermassive neutron star","authors":"Patrick Chi-Kit Cheong, Francois Foucart, Matthew D. Duez, Arthur\n  Offermans, Nishad Muhammed, Pavan Chawhan","authorsParsed":[["Cheong","Patrick Chi-Kit",""],["Foucart","Francois",""],["Duez","Matthew D.",""],["Offermans","Arthur",""],["Muhammed","Nishad",""],["Chawhan","Pavan",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 19:48:11 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 12:06:30 GMT"}],"updateDate":"2024-07-25","timestamp":1721677691000,"abstract":"  We compare two-moment based \\emph{energy-dependent} and 3 variants of\n\\emph{energy-integrated} neutrino transport general-relativistic\nmagnetohydrodynamics simulations of hypermassive neutron star. To study the\nimpacts due to the choice of the neutrino transport schemes, we perform\nsimulations with the same setups and input neutrino microphysics. We show that\nthe main differences between energy-dependent and energy-integrated neutrino\ntransport are found in the disk and ejecta properties, as well as in the\nneutrino signals. The properties of the disk surrounding the neutron star and\nthe ejecta in energy-dependent transport are very different from the ones\nobtained using energy-integrated schemes. Specifically, in the energy-dependent\ncase, the disk is more neutron-rich at early times, and becomes geometrically\nthicker at later times. In addition, the ejecta is more massive, and on average\nmore neutron-rich in the energy-dependent simulations. Moreover, the average\nneutrino energies and luminosities are about 30\\% higher. Energy-dependent\nneutrino transport is necessary if one wants to better model the neutrino\nsignals and matter outflows from neutron star merger remnants via numerical\nsimulations.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}