{"id":"2407.20195","title":"Accelerated Primal-Dual Proximal Gradient Splitting Methods for\n  Convex-Concave Saddle-Point Problems","authors":"Hao Luo","authorsParsed":[["Luo","Hao",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 17:21:20 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 08:37:31 GMT"},{"version":"v3","created":"Tue, 3 Sep 2024 08:43:39 GMT"}],"updateDate":"2024-09-04","timestamp":1722273680000,"abstract":"  In this paper, based a novel primal-dual dynamical model with adaptive\nscaling parameters and Bregman divergences, we propose new accelerated\nprimal-dual proximal gradient splitting methods for solving bilinear\nsaddle-point problems with provable optimal nonergodic convergence rates. For\nthe first, using the spectral analysis, we show that a naive extension of\nacceleration model for unconstrained optimization problems to a quadratic game\nis unstable. Motivated by this, we present an accelerated primal-dual hybrid\ngradient (APDHG) flow which combines acceleration with careful velocity\ncorrection. To work with non-Euclidean distances, we also equip our APDHG model\nwith general Bregman divergences and prove the exponential decay of a Lyapunov\nfunction. Then, new primal-dual splitting methods are developed based on proper\nsemi-implicit Euler schemes of the continuous model, and the theoretical\nconvergence rates are nonergodic and optimal with respect to the matrix\nnorms,\\, Lipschitz constants and convexity parameters. Thanks to the primal and\ndual scaling parameters, both the algorithm designing and convergence analysis\ncover automatically the convex and (partially) strongly convex objectives.\nMoreover, the use of Bregman divergences not only unifies the standard\nEuclidean distances and general cases in an elegant way, but also makes our\nmethods more flexible and adaptive to problem-dependent metrics.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}