{"id":"2407.20459","title":"Excavating Vulnerabilities Lurking in Multi-Factor Authentication\n  Protocols: A Systematic Security Analysis","authors":"Ang Kok Wee, Eyasu Getahun Chekole, Jianying Zhou","authorsParsed":[["Wee","Ang Kok",""],["Chekole","Eyasu Getahun",""],["Zhou","Jianying",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 23:37:38 GMT"}],"updateDate":"2024-07-31","timestamp":1722296258000,"abstract":"  Nowadays, cyberattacks are growing exponentially, causing havoc to Internet\nusers. In particular, authentication attacks constitute the major attack vector\nwhere intruders impersonate legitimate users to maliciously access systems or\nresources. Traditional single-factor authentication (SFA) protocols are often\nbypassed by side-channel and other attack techniques, hence they are no longer\nsufficient to the current authentication requirements. To alleviate this\nproblem, multi-factor authentication (MFA) protocols have been widely adopted\nrecently, which helps to raise the security bar against imposters. Although MFA\nis generally considered more robust and secure than SFA, it may not always\nguarantee enhanced security and efficiency. This is because, critical security\nvulnerabilities and performance problems may still arise due to design or\nimplementation flaws of the protocols. Such vulnerabilities are often left\nunnoticed until they are exploited by attackers. Therefore, the main objective\nof this work is identifying such vulnerabilities in existing MFA protocols by\nsystematically analysing their designs and constructions. To this end, we first\nform a set of security evaluation criteria, encompassing both existing and\nnewly introduced ones, which we believe are very critical for the security of\nMFA protocols. Then, we thoroughly review several MFA protocols across\ndifferent domains. Subsequently, we revisit and thoroughly analyze the design\nand construction of the protocols to identify potential vulnerabilities.\nConsequently, we manage to identify critical vulnerabilities in ten of the MFA\nprotocols investigated. We thoroughly discuss the identified vulnerabilities in\neach protocol and devise relevant mitigation strategies. We also consolidate\nthe performance information of those protocols to show the runtime and storage\ncost when employing varying number of authentication factors.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JiLBayQd387ho-efvq2b01BmbSKoxoib5eM5gm5Ga3I","pdfSize":"2242843"}
