{"id":"2407.00478","title":"Knowledge-Aware Parsimony Learning: A Perspective from Relational Graphs","authors":"Quanming Yao and Yongqi Zhang and Yaqing Wang and Nan Yin and James\n  Kwok and Qiang Yang","authorsParsed":[["Yao","Quanming",""],["Zhang","Yongqi",""],["Wang","Yaqing",""],["Yin","Nan",""],["Kwok","James",""],["Yang","Qiang",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 15:52:37 GMT"}],"updateDate":"2024-07-02","timestamp":1719676357000,"abstract":"  The scaling law, a strategy that involves the brute-force scaling of the\ntraining dataset and learnable parameters, has become a prevalent approach for\ndeveloping stronger learning models. In this paper, we examine its rationale in\nterms of learning from relational graphs. We demonstrate that directly adhering\nto such a scaling law does not necessarily yield stronger models due to\narchitectural incompatibility and representation bottlenecks. To tackle this\nchallenge, we propose a novel framework for learning from relational graphs via\nknowledge-aware parsimony learning. Our method draws inspiration from the\nduality between data and knowledge inherent in these graphs. Specifically, we\nfirst extract knowledge (like symbolic logic and physical laws) during the\nlearning process, and then apply combinatorial generalization to the task at\nhand. This extracted knowledge serves as the ``building blocks'' for achieving\nparsimony learning. By applying this philosophy to architecture, parameters,\nand inference, we can effectively achieve versatile, sample-efficient, and\ninterpretable learning. Experimental results show that our proposed framework\nsurpasses methods that strictly follow the traditional scaling-up roadmap. This\nhighlights the importance of incorporating knowledge in the development of\nnext-generation learning technologies.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hTg1JKIE1yo1rdrdV7bf9LsbWT32w_QMuW9SVbiCVyE","pdfSize":"3727846","objectId":"0xbda10db5edbdb6d55714a9459ae075f55f2647411aba784024f4d8dae75e31e5","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
