{"id":"2407.10072","title":"Advances in the Simulation and Modeling of Complex Systems using\n  Dynamical Graph Grammars","authors":"Eric Medwedeff and Eric Mjolsness","authorsParsed":[["Medwedeff","Eric",""],["Mjolsness","Eric",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 04:19:26 GMT"}],"updateDate":"2024-07-16","timestamp":1720930766000,"abstract":"  The Dynamical Graph Grammar (DGG) formalism can describe complex system\ndynamics with graphs that are mapped into a master equation. An exact\nstochastic simulation algorithm may be used, but it is slow for large systems.\nTo overcome this problem, an approximate spatial stochastic/deterministic\nsimulation algorithm, which uses spatial decomposition of the system's\ntime-evolution operator through an expanded cell complex (ECC), was previously\ndeveloped and implemented for a cortical microtubule array (CMA) model. Here,\ncomputational efficiency is improved at the cost of introducing errors confined\nto interactions between adjacent subdomains of different dimensions, realized\nas some events occurring out of order. A rule instances to domains mapping\nfunction $\\phi$, ensures the errors are local. This approach has been further\nrefined and generalized in this work. Additional efficiency is achieved by\nmaintaining an incrementally updated match data structure for all possible rule\nmatches. The API has been redesigned to support DGG rules in general, rather\nthan for one specific model. To demonstrate these improvements in the\nalgorithm, we have developed the Dynamical Graph Grammar Modeling Library\n(DGGML) and a DGG model for the periclinal face of the plant cell CMA. This\nmodel explores the effects of face shape and boundary conditions on local and\nglobal alignment. For a rectangular face, different boundary conditions\nreorient the array between the long and short axes. The periclinal CMA DGG\ndemonstrates the flexibility and utility of DGGML, and these new methods\nhighlight DGGs' potential for testing, screening, or generating hypotheses to\nexplain emergent phenomena.\n","subjects":["Quantitative Biology/Quantitative Methods","Physics/Biological Physics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SHzBw9yZAutMXirO2BCv4vHGpqh47hDM9uYiFDd5oQk","pdfSize":"5585617"}
