{"id":"2407.17877","title":"Advancing 3D Point Cloud Understanding through Deep Transfer Learning: A\n  Comprehensive Survey","authors":"Shahab Saquib Sohail, Yassine Himeur, Hamza Kheddar, Abbes Amira,\n  Fodil Fadli, Shadi Atalla, Abigail Copiaco and Wathiq Mansoor","authorsParsed":[["Sohail","Shahab Saquib",""],["Himeur","Yassine",""],["Kheddar","Hamza",""],["Amira","Abbes",""],["Fadli","Fodil",""],["Atalla","Shadi",""],["Copiaco","Abigail",""],["Mansoor","Wathiq",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 08:47:27 GMT"}],"updateDate":"2024-07-26","timestamp":1721897247000,"abstract":"  The 3D point cloud (3DPC) has significantly evolved and benefited from the\nadvance of deep learning (DL). However, the latter faces various issues,\nincluding the lack of data or annotated data, the existence of a significant\ngap between training data and test data, and the requirement for high\ncomputational resources. To that end, deep transfer learning (DTL), which\ndecreases dependency and costs by utilizing knowledge gained from a source\ndata/task in training a target data/task, has been widely investigated.\nNumerous DTL frameworks have been suggested for aligning point clouds obtained\nfrom several scans of the same scene. Additionally, DA, which is a subset of\nDTL, has been modified to enhance the point cloud data's quality by dealing\nwith noise and missing points. Ultimately, fine-tuning and DA approaches have\ndemonstrated their effectiveness in addressing the distinct difficulties\ninherent in point cloud data. This paper presents the first review shedding\nlight on this aspect. it provides a comprehensive overview of the latest\ntechniques for understanding 3DPC using DTL and domain adaptation (DA).\nAccordingly, DTL's background is first presented along with the datasets and\nevaluation metrics. A well-defined taxonomy is introduced, and detailed\ncomparisons are presented, considering different aspects such as different\nknowledge transfer strategies, and performance. The paper covers various\napplications, such as 3DPC object detection, semantic labeling, segmentation,\nclassification, registration, downsampling/upsampling, and denoising.\nFurthermore, the article discusses the advantages and limitations of the\npresented frameworks, identifies open challenges, and suggests potential\nresearch directions.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LtjwvFLfX5EbcZr4X6XSHfQ0ycUba7-XlDxPRG43WMk","pdfSize":"5814082"}
