{"id":"2407.02144","title":"Conversations in the dark: cross-correlating birefringence and LSS to\n  constrain axions","authors":"S. Arcari, N. Bartolo, A. Greco, A. Gruppuso, M. Lattanzi and P.\n  Natoli","authorsParsed":[["Arcari","S.",""],["Bartolo","N.",""],["Greco","A.",""],["Gruppuso","A.",""],["Lattanzi","M.",""],["Natoli","P.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 10:38:08 GMT"}],"updateDate":"2024-07-03","timestamp":1719916688000,"abstract":"  Unveiling the dark sector of the Universe is one of the leading efforts in\ntheoretical physics. Among the many models proposed, axions and axion-like\nparticles stand out due to their solid theoretical foundation, capacity to\ncontribute significantly to both dark matter and dark energy, and potential to\naddress the small-scale crisis of $\\Lambda$CDM. Moreover, these pseudo-scalar\nfields couple to the electromagnetic sector through a Chern-Simons\nparity-violating term, leading to a rotation of the plane of linearly polarized\nwaves, namely cosmic birefringence. We explore the impact of the\naxion-parameters on anisotropic birefringence and study, for the first time,\nits cross-correlation with the spatial distribution of galaxies, focusing on\nultralight axions with masses $10^{-33}\\,{\\rm eV}\\le m_\\phi\\le10^{-28}\\,{\\rm\neV}$. Through this novel approach, we investigate the axion-parameter space in\nthe mass $m_\\phi$ and initial misalignment angle $\\theta_i$, within the\nframework of early dark energy models, and constrain the axion-photon coupling\n$g_{\\phi\\gamma}$ required to achieve unity in the signal-to-noise ratio of the\nunderlying cross-correlation, computed with the instrument specifications of\nEuclid and forthcoming CMB-polarization data. Our findings reveal that for\nmasses below $10^{-32}\\,{\\rm eV}$ and initial misalignment angles greater in\nabsolute value than $\\pi/4$, the signal-to-noise ratio not only exceeds unity\nbut also surpasses that achievable from the auto-correlation of birefringence\nalone (up to a factor 7), highlighting the informative potential of this new\nprobe. Additionally, given the late-time evolution of these low-mass axions,\nthe signal stems from the epoch of reionization, providing an excellent tool to\nsingle out the birefringence generated during this period.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}