{"id":"2407.10492","title":"Explosive percolation in finite dimensions","authors":"Ming Li, Junfeng Wang, and Youjin Deng","authorsParsed":[["Li","Ming",""],["Wang","Junfeng",""],["Deng","Youjin",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 07:32:51 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 14:50:53 GMT"}],"updateDate":"2024-09-20","timestamp":1721028771000,"abstract":"  Explosive percolation (EP) has received significant research attention due to\nits rich and anomalous phenomena near criticality. In our recent study [Phys.\nRev. Lett. 130, 147101 (2023)], we demonstrated that the correct critical\nbehaviors of EP in infinite dimensions (complete graph) can be accurately\nextracted using the event-based method, with finite-size scaling behaviors\nstill described by the standard finite-size scaling theory. We perform an\nextensive simulation of EPs on hypercubic lattices ranging from dimensions\n$d=2$ to $6$, and find that the critical behaviors consistently obey the\nstandard finite-size scaling theory. Consequently, we obtain a high-precision\ndetermination of the percolation thresholds and critical exponents, revealing\nthat EPs governed by the product and sum rules belong to different universality\nclasses. Remarkably, despite the mean of the dynamic pseudocritical point\n$\\mathcal{T}_L$ deviating from the infinite-lattice criticality by a distance\ndetermined by the $d$-dependent correlation-length exponent, $\\mathcal{T}_L$\nfollows a normal (Gaussian) distribution across all dimensions, with a standard\ndeviation proportional to $1/\\sqrt{V}$, where $V$ denotes the system volume. A\ntheoretical argument associated with the central-limit theorem is further\nproposed to understand the probability distribution of $\\mathcal{T}_L$. These\nfindings offer a comprehensive understanding of critical behaviors in EPs\nacross various dimensions, revealing a different dimension-dependence compared\nto standard bond percolation.\n","subjects":["Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}