{"id":"2407.14321","title":"Multimodal Misinformation Detection using Large Vision-Language Models","authors":"Sahar Tahmasebi, Eric M\\\"uller-Budack and Ralph Ewerth","authorsParsed":[["Tahmasebi","Sahar",""],["Müller-Budack","Eric",""],["Ewerth","Ralph",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:57:11 GMT"}],"updateDate":"2024-07-22","timestamp":1721397431000,"abstract":"  The increasing proliferation of misinformation and its alarming impact have\nmotivated both industry and academia to develop approaches for misinformation\ndetection and fact checking. Recent advances on large language models (LLMs)\nhave shown remarkable performance in various tasks, but whether and how LLMs\ncould help with misinformation detection remains relatively underexplored. Most\nof existing state-of-the-art approaches either do not consider evidence and\nsolely focus on claim related features or assume the evidence to be provided.\nFew approaches consider evidence retrieval as part of the misinformation\ndetection but rely on fine-tuning models. In this paper, we investigate the\npotential of LLMs for misinformation detection in a zero-shot setting. We\nincorporate an evidence retrieval component into the process as it is crucial\nto gather pertinent information from various sources to detect the veracity of\nclaims. To this end, we propose a novel re-ranking approach for multimodal\nevidence retrieval using both LLMs and large vision-language models (LVLM). The\nretrieved evidence samples (images and texts) serve as the input for an\nLVLM-based approach for multimodal fact verification (LVLM4FV). To enable a\nfair evaluation, we address the issue of incomplete ground truth for evidence\nsamples in an existing evidence retrieval dataset by annotating a more complete\nset of evidence samples for both image and text retrieval. Our experimental\nresults on two datasets demonstrate the superiority of the proposed approach in\nboth evidence retrieval and fact verification tasks and also better\ngeneralization capability across dataset compared to the supervised baseline.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4ZRY79mS4MDbVVFq0Hxh7uWQD3ihU32t633lrbbDAzU","pdfSize":"7913970"}
