{"id":"2407.12658","title":"FastSAM-3DSlicer: A 3D-Slicer Extension for 3D Volumetric Segment\n  Anything Model with Uncertainty Quantification","authors":"Yiqing Shen, Xinyuan Shao, Blanca Inigo Romillo, David Dreizin,\n  Mathias Unberath","authorsParsed":[["Shen","Yiqing",""],["Shao","Xinyuan",""],["Romillo","Blanca Inigo",""],["Dreizin","David",""],["Unberath","Mathias",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:42:15 GMT"}],"updateDate":"2024-07-18","timestamp":1721230935000,"abstract":"  Accurate segmentation of anatomical structures and pathological regions in\nmedical images is crucial for diagnosis, treatment planning, and disease\nmonitoring. While the Segment Anything Model (SAM) and its variants have\ndemonstrated impressive interactive segmentation capabilities on image types\nnot seen during training without the need for domain adaptation or retraining,\ntheir practical application in volumetric 3D medical imaging workflows has been\nhindered by the lack of a user-friendly interface. To address this challenge,\nwe introduce FastSAM-3DSlicer, a 3D Slicer extension that integrates both 2D\nand 3D SAM models, including SAM-Med2D, MedSAM, SAM-Med3D, and FastSAM-3D.\nBuilding on the well-established open-source 3D Slicer platform, our extension\nenables efficient, real-time segmentation of 3D volumetric medical images, with\nseamless interaction and visualization. By automating the handling of raw image\ndata, user prompts, and segmented masks, FastSAM-3DSlicer provides a\nstreamlined, user-friendly interface that can be easily incorporated into\nmedical image analysis workflows. Performance evaluations reveal that the\nFastSAM-3DSlicer extension running FastSAM-3D achieves low inference times of\nonly 1.09 seconds per volume on CPU and 0.73 seconds per volume on GPU, making\nit well-suited for real-time interactive segmentation. Moreover, we introduce\nan uncertainty quantification scheme that leverages the rapid inference\ncapabilities of FastSAM-3D for practical implementation, further enhancing its\nreliability and applicability in medical settings. FastSAM-3DSlicer offers an\ninteractive platform and user interface for 2D and 3D interactive volumetric\nmedical image segmentation, offering a powerful combination of efficiency,\nprecision, and ease of use with SAMs. The source code and a video demonstration\nare publicly available at https://github.com/arcadelab/FastSAM3D_slicer.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}