{"id":"2407.09706","title":"Multi-Provider Resource Scheduling in Massive MIMO Radio Access Networks","authors":"Qing An, Divyanshu Pandey, Rahman Doost-Mohammady, Ashutosh Sabharwal,\n  Srinivas Shakkottai","authorsParsed":[["An","Qing",""],["Pandey","Divyanshu",""],["Doost-Mohammady","Rahman",""],["Sabharwal","Ashutosh",""],["Shakkottai","Srinivas",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 22:14:28 GMT"}],"updateDate":"2024-07-16","timestamp":1720822468000,"abstract":"  An important aspect of 5G networks is the development of Radio Access Network\n(RAN) slicing, a concept wherein the virtualized infrastructure of wireless\nnetworks is subdivided into slices (or enterprises), tailored to fulfill\nspecific use-cases. A key focus in this context is the efficient radio resource\nallocation to meet various enterprises' service-level agreements (SLAs). In\nthis work, we introduce a channel-aware and SLA-aware RAN slicing framework for\nmassive multiple input multiple output (MIMO) networks where resource\nallocation extends to incorporate the spatial dimension available through\nbeamforming. Essentially, the same time-frequency resource block (RB) can be\nshared across multiple users through multiple antennas. Notably, certain\nenterprises, particularly those operating critical infrastructure, necessitate\ndedicated RB allocation, denoted as private networks, to ensure security.\nConversely, some enterprises would allow resource sharing with others in the\npublic network to maintain network performance while minimizing capital\nexpenditure. Building upon this understanding, the proposed scheduler comprises\nscheduling schemes under both scenarios: where different slices share the same\nset of RBs, and where they require exclusivity of allocated RBs. We validate\nthe efficacy of our proposed schedulers through simulation by utilizing a\nchannel data set collected from a real-world massive MIMO testbed. Our\nassessments demonstrate that resource sharing across slices using our approach\ncan lead up to 60.9% reduction in RB usage compared to other approaches.\nMoreover, our proposed schedulers exhibit significantly enhanced operational\nefficiency, with significantly faster running time compared to exhaustive\ngreedy approaches while meeting the stringent 5G sub-millisecond-level latency\nrequirement.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}