{"id":"2407.16356","title":"Heralded High-Dimensional Photon-Photon Quantum Gate","authors":"Zhi-Feng Liu, Zhi-Cheng Ren, Pei Wan, Wen-Zheng Zhu, Zi-Mo Cheng, Jing\n  Wang, Yu-Peng Shi, Han-Bing Xi, Marcus Huber, Nicolai Friis, Xiaoqin Gao,\n  Xi-Lin Wang, Hui-Tian Wang","authorsParsed":[["Liu","Zhi-Feng",""],["Ren","Zhi-Cheng",""],["Wan","Pei",""],["Zhu","Wen-Zheng",""],["Cheng","Zi-Mo",""],["Wang","Jing",""],["Shi","Yu-Peng",""],["Xi","Han-Bing",""],["Huber","Marcus",""],["Friis","Nicolai",""],["Gao","Xiaoqin",""],["Wang","Xi-Lin",""],["Wang","Hui-Tian",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 10:00:12 GMT"}],"updateDate":"2024-07-24","timestamp":1721728812000,"abstract":"  High-dimensional encoding of quantum information holds the potential to\ngreatly increase the computational power of existing devices by enlarging the\naccessible state space for fixed register size and by reducing the number of\nrequired entangling gates. However, qudit-based quantum computation remains far\nless developed than conventional qubit-based approaches, in particular for\nphotons, which represent natural multi-level information carriers that play a\ncrucial role in the development of quantum networks. A major obstacle for\nrealizing quantum gates between two individual photons is the restriction of\ndirect interaction between photons in linear media. In particular, essential\nlogic components for quantum operations such as native qudit-qudit entangling\ngates are still missing for optical quantum information processing. Here we\naddress this challenge by presenting a protocol for realizing an entangling\ngate -- the controlled phase-flip (CPF) gate -- for two photonic qudits in\narbitrary dimension. We experimentally demonstrate this protocol by realizing a\nfour-dimensional qudit-qudit CPF gate, whose decomposition would require at\nleast 13 two-qubit entangling gates. Our photonic qudits are encoded in orbital\nangular momentum (OAM) and we have developed a new active high-precision\nphase-locking technology to construct a high-dimensional OAM beam splitter that\nincreases the stability of the CPF gate, resulting in a process fidelity within\na range of $ [0.64 \\pm 0.01, 0.82 \\pm 0.01]$. Our experiment represents a\nsignificant advance for high-dimensional optical quantum information processing\nand has the potential for wider applications beyond optical system.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eo5lcFMM4uejppoLXazkEZurkx53rTAGsKMTbEikwTA","pdfSize":"1774484"}
