{"id":"2407.03990","title":"Autoencoded Image Compression for Secure and Fast Transmission","authors":"Aryan Kashyap Naveen and Sunil Thunga and Anuhya Murki and Mahati A\n  Kalale and Shriya Anil","authorsParsed":[["Naveen","Aryan Kashyap",""],["Thunga","Sunil",""],["Murki","Anuhya",""],["Kalale","Mahati A",""],["Anil","Shriya",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 15:07:39 GMT"}],"updateDate":"2024-07-08","timestamp":1720105659000,"abstract":"  With an exponential growth in the use of digital image data, the need for\nefficient transmission methods has become imperative. Traditional image\ncompression techniques often sacrifice image fidelity for reduced file sizes,\npresenting a challenge in maintaining both quality and efficiency. They also\ntend to compromise on security, leaving images vulnerable to threats such as\nman-in-the-middle attacks. This paper proposes an autoencoder architecture for\nimage compression so as to not only help in dimensionality reduction but also\ninherently encrypt the images. The paper also introduces the use of a composite\nloss function that combines reconstruction loss and residual loss for improved\nperformance. The autoencoder architecture is designed to achieve optimal\ndimensionality reduction and regeneration accuracy while safeguarding the\ncompressed data during transmission or storage. Images regenerated by the\nautoencoder are evaluated against three key metrics: reconstruction quality,\ncompression ratio, and one-way delay during image transfer. The experiments\nreveal that the proposed architecture achieves an SSIM of 97.5% over the\nregenerated images and an average latency reduction of 87.5%, indicating its\neffectiveness as a secure and efficient solution for compressed image transfer.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"svils50_F1kxW2ibwcKaVCUfWNUeZmywNfDzvrQlAwg","pdfSize":"4568398"}
