{"id":"2407.08120","title":"Spectroastrometry and Reverberation Mapping (SARM) of Active Galactic\n  Nuclei. I. The H$\\beta$ Broad-line Region Structure and Black Hole Mass of\n  Five Quasars","authors":"Yan-Rong Li, Chen Hu, Zhu-Heng Yao, Yong-Jie Chen, Hua-Rui Bai, Sen\n  Yang, Pu Du, Feng-Na Fang, Yi-Xin Fu, Jun-Rong Liu, Yue-Chang Peng, Yu-Yang\n  Songsheng, Yi-Lin Wang, Ming Xiao, Shuo Zhai, Hartmut Winkler, Jin-Ming Bai,\n  Luis C. Ho, Romain G. Petrov, Jesus Aceituno, Jian-Min Wang","authorsParsed":[["Li","Yan-Rong",""],["Hu","Chen",""],["Yao","Zhu-Heng",""],["Chen","Yong-Jie",""],["Bai","Hua-Rui",""],["Yang","Sen",""],["Du","Pu",""],["Fang","Feng-Na",""],["Fu","Yi-Xin",""],["Liu","Jun-Rong",""],["Peng","Yue-Chang",""],["Songsheng","Yu-Yang",""],["Wang","Yi-Lin",""],["Xiao","Ming",""],["Zhai","Shuo",""],["Winkler","Hartmut",""],["Bai","Jin-Ming",""],["Ho","Luis C.",""],["Petrov","Romain G.",""],["Aceituno","Jesus",""],["Wang","Jian-Min",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 01:40:14 GMT"}],"updateDate":"2024-07-12","timestamp":1720662014000,"abstract":"  We conduct a reverberation mapping (RM) campaign to spectroscopically monitor\na sample of selected bright active galactic nuclei with large anticipated\nbroad-line region (BLR) sizes adequate for spectroastrometric observations by\nthe GRAVITY instrument on the Very Large Telescope Interferometer. We report\nthe first results for five objects, IC 4329A, Mrk 335, Mrk 509, Mrk 1239, and\nPDS 456, among which Mrk 1239 and PDS 456 are for the first time\nspectroscopically monitored. We obtain multi-year monitoring data and perform\nmulti-component spectral decomposition to extract the broad H$\\beta$ profiles.\nWe detect significant time lags between the H$\\beta$ and continuum variations,\ngenerally obeying the previously established BLR size-luminosity relation.\nVelocity-resolved H$\\beta$ time lags illustrate diverse, possibly evolving BLR\nkinematics. We further measure the H$\\beta$ line widths from mean and rms\nspectra and the resulting virial products show good consistency among different\nseasons. Adopting a unity virial factor and the full width at half maximum of\nthe broad H$\\beta$ line from the mean spectrum as the measure of velocity, the\nobtained black hole mass averaged over seasons is $\\log\nM_\\bullet/M_\\odot=8.02_{-0.14}^{+0.09}$, $6.92_{-0.12}^{+0.12}$,\n$8.01_{-0.25}^{+0.16}$, $7.44_{-0.14}^{+0.13}$, and $8.59_{-0.11}^{+0.07}$ for\nthe five objects, respectively. The black hole mass estimations using other\nline width measures are also reported (up to the virial factors). For objects\nwith previous RM campaigns, our mass estimates are in agreement with earlier\nresults. In a companion paper, we will employ BLR dynamical modeling to\ndirectly infer the black hole mass and thereby determine the virial factors.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}