{"id":"2407.10919","title":"Non-Reciprocal Response in Silicon Photonic Resonators Integrated with\n  2D CuCrP2S6 at Short-Wave Infrared","authors":"Ghada Dushaq, Srinivasa R. Tamalampudi, and Mahmoud Rasras","authorsParsed":[["Dushaq","Ghada",""],["Tamalampudi","Srinivasa R.",""],["Rasras","Mahmoud",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:20:32 GMT"}],"updateDate":"2024-07-16","timestamp":1721064032000,"abstract":"  Achieving non-reciprocal optical behavior in integrated photonics with high\nefficiency has long been a challenge. Here, we demonstrate a non-reciprocal\nmagneto-optic response by integrating multilayer 2D CuCrP2S6 (CCPS) onto\nsilicon micro ring resonators (MRRs).Under an applied magnetic field, the CCPS\nintralayer ferromagnetic ordering, characterized by easy-plane\nmagneto-crystalline anisotropy, induces asymmetrical modal responses in the\nclockwise (CW)and counterclockwise (CCW) light propagation directions. The\nproposed configuration achieves a low insertion loss of 0.15 dB and a high\nisolation ratio of 28 dB at 1550 nm. Notably, it exhibits a significant\nresonance wavelength splitting of 0.4 nm between the counter propagation\ndirections, supporting a 50 GHz optical bandwidth. Operating directly in the\ntransverse electric (TE) mode, it aligns with the main polarization used in\nsilicon photonics circuit, eliminating the need for additional polarization\nmanagement. The device is ultra-compact, with 2D flake interaction length\nranging from 22 um to 55 um and a thickness between 39 nm and 62 nm. Its\noperation range covers the entire C-band with a bandwidth of up to 100 nm.\nThese attributes make our hybrid CCPS/Si device ideal for advanced\nnon-reciprocal optical applications in the short-wave infrared (SWIR)spectrum,\ncrucial for enhancing the resilience of optical systems against\nback-reflections.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}