{"id":"2407.06241","title":"SimPal: Towards a Meta-Conversational Framework to Understand Teacher's\n  Instructional Goals for K-12 Physics","authors":"Effat Farhana, Souvika Sarkar, Ralph Knipper, Indrani Dey, Hari\n  Narayanan, Sadhana Puntambekar, Shubhra Kanti Karmaker (Santu)","authorsParsed":[["Farhana","Effat","","Santu"],["Sarkar","Souvika","","Santu"],["Knipper","Ralph","","Santu"],["Dey","Indrani","","Santu"],["Narayanan","Hari","","Santu"],["Puntambekar","Sadhana","","Santu"],["Karmaker","Shubhra Kanti","","Santu"]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 05:42:59 GMT"}],"updateDate":"2024-07-10","timestamp":1720417379000,"abstract":"  Simulations are widely used to teach science in grade schools. These\nsimulations are often augmented with a conversational artificial intelligence\n(AI) agent to provide real-time scaffolding support for students conducting\nexperiments using the simulations. AI agents are highly tailored for each\nsimulation, with a predesigned set of Instructional Goals (IGs), making it\ndifficult for teachers to adjust IGs as the agent may no longer align with the\nrevised IGs. Additionally, teachers are hesitant to adopt new third-party\nsimulations for the same reasons. In this research, we introduce SimPal, a\nLarge Language Model (LLM) based meta-conversational agent, to solve this\nmisalignment issue between a pre-trained conversational AI agent and the\nconstantly evolving pedagogy of instructors. Through natural conversation with\nSimPal, teachers first explain their desired IGs, based on which SimPal\nidentifies a set of relevant physical variables and their relationships to\ncreate symbolic representations of the desired IGs. The symbolic\nrepresentations can then be leveraged to design prompts for the original AI\nagent to yield better alignment with the desired IGs. We empirically evaluated\nSimPal using two LLMs, ChatGPT-3.5 and PaLM 2, on 63 Physics simulations from\nPhET and Golabz. Additionally, we examined the impact of different prompting\ntechniques on LLM's performance by utilizing the TELeR taxonomy to identify\nrelevant physical variables for the IGs. Our findings showed that SimPal can do\nthis task with a high degree of accuracy when provided with a well-defined\nprompt.\n","subjects":["Physics/Physics Education"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8XlNpFZ6zfBKh5ygrj0gqM7R_iSUMjqalI8Rtmu3Sok","pdfSize":"534944"}
