{"id":"2407.02706","title":"Pushing the Boundary: Specialising Deep Configuration Performance\n  Learning","authors":"Jingzhi Gong","authorsParsed":[["Gong","Jingzhi",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 22:59:19 GMT"}],"updateDate":"2024-07-04","timestamp":1719961159000,"abstract":"  Software systems often have numerous configuration options that can be\nadjusted to meet different performance requirements. However, understanding the\ncombined impact of these options on performance is often challenging,\nespecially with limited real-world data. To tackle this issue, deep learning\ntechniques have gained popularity due to their ability to capture complex\nrelationships even with limited samples. This thesis begins with a systematic\nliterature review of deep learning techniques in configuration performance\nmodeling, analyzing 85 primary papers out of 948 searched papers. It identifies\nknowledge gaps and sets three objectives for the thesis. The first knowledge\ngap is the lack of understanding about which encoding scheme is better and in\nwhat circumstances. To address this, the thesis conducts an empirical study\ncomparing three popular encoding schemes. Actionable suggestions are provided\nto support more reliable decisions. Another knowledge gap is the sparsity\ninherited from the configuration landscape. To handle this, the thesis proposes\na model-agnostic and sparsity-robust framework called DaL, which uses a\n\"divide-and-learn\" approach. DaL outperforms state-of-the-art approaches in\naccuracy improvement across various real-world systems. The thesis also\naddresses the limitation of predicting under static environments by proposing a\nsequential meta-learning framework called SeMPL. Unlike traditional\nmeta-learning frameworks, SeMPL trains meta-environments in a specialized\norder, resulting in significantly improved prediction accuracy in\nmulti-environment scenarios. Overall, the thesis identifies and addresses\ncritical knowledge gaps in deep performance learning, significantly advancing\nthe accuracy of performance prediction.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}