{"id":"2407.00054","title":"Agile Free-Form Signal Filtering with a Chaotic-Cavity-Backed Non-Local\n  Programmable Metasurface","authors":"Fabian T. Faul, Laurent Cronier, Ali Alhulaymi, A. Douglas Stone,\n  Philipp del Hougne","authorsParsed":[["Faul","Fabian T.",""],["Cronier","Laurent",""],["Alhulaymi","Ali",""],["Stone","A. Douglas",""],["del Hougne","Philipp",""]],"versions":[{"version":"v1","created":"Fri, 14 Jun 2024 18:17:43 GMT"},{"version":"v2","created":"Sat, 6 Jul 2024 11:44:09 GMT"}],"updateDate":"2024-07-09","timestamp":1718389063000,"abstract":"  Filter synthesis is an inverse problem that is traditionally approached\nrationally by considering spatially disjoint resonators, approximating them as\nlumped elements, and engineering the coupling of selected pairs. This approach\nstrongly limits the design space, making it challenging to build extremely\ntunable filters. Here, we demonstrate agile free-form signal filtering with an\nalternative purely-optimization-based design paradigm using a programmable\nsystem with many spatially overlapping modes. We back a programmable metallic\nmetasurface with a quasi-2D chaotic cavity, inducing strong non-local\ninteractions between all meta-elements and the connected ports. Thereby, the\nmetasurface efficiently controls the transfer function between the ports. Our\nall-metallic device has unique advantages: ultra-wideband (UWB) tunability\n(7.5-13.5GHz), low loss, compactness, guaranteed linearity under high\nsignal-power levels. First, we experimentally confirm theoretical predictions\nabout reflectionless and transmissionless scattering modes; we also\nexperimentally observe transmissionless exceptional points. Second, we impose\ndiverse types of transfer function zeros at desired frequencies within an UWB\nrange. Third, we achieve low-loss reflectionless programmable signal routing.\nFourth, we investigate the trade-off between routing fidelity and bandwidth,\nachieving 20dB discrimination over 10MHz bandwidth. Fifth, we demonstrate UWB\ntunable multi-band filters that reject (<-24dB) or pass (>-1dB) signals in\nspecified bands whose centers, widths and number are reprogrammable.\n","subjects":["Physics/Applied Physics","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}