{"id":"2407.10604","title":"Muon-induced collisional flavor instability in core-collapse supernova","authors":"Jiabao Liu, Hiroki Nagakura, Ryuichiro Akaho, Akira Ito, Masamichi\n  Zaizen, Shun Furusawa, Shoichi Yamada","authorsParsed":[["Liu","Jiabao",""],["Nagakura","Hiroki",""],["Akaho","Ryuichiro",""],["Ito","Akira",""],["Zaizen","Masamichi",""],["Furusawa","Shun",""],["Yamada","Shoichi",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 10:27:27 GMT"}],"updateDate":"2024-07-17","timestamp":1721039247000,"abstract":"  Neutrinos are known to undergo flavor conversion among their three flavors.\nIn the theoretical modeling of core-collapse supernova (CCSN), there has been a\ngreat deal of attention to recent discoveries of a new type of neutrino flavor\nconversions, namely collisional flavor instability (CFI), in which the\ninstability is induced by the flavor-dependent decoherence due to the disparity\nof neutrino-matter interactions among flavors. In this paper, we study how the\nappearance of on-shell muons and associated neutrino-matter interactions can\nimpact CFIs based on linear stability analysis of flavor conversions. Some\nstriking results emerge from the present study. First, we analytically show\nthat breaking beta- and pair equilibrium is a necessary condition to trigger\nCFIs. This also indicates that CFIs with on-shell muons could appear in $e\n\\tau$ and $\\mu \\tau$ neutrino mixing sectors in very high-density region\n($\\gtrsim 10^{13} {\\rm g/cm^{3}}$), exhibiting a possibility of large impacts\nof CFIs on CCSN. Second, resonance-like CFIs, having a much higher growth rate\nthan normal CFIs, can be triggered by muons. The resonance point of CFIs is\ndifferent between $e \\tau$ and $\\mu \\tau$ sectors; the former (latter) occurs\nat $\\mu_{e (\\mu)} = \\mu_{n} - \\mu_{p}$, where $\\mu_{i}$ denotes the chemical\npotential of $i$ constitute ($n$ and $p$ represent neutrons and protons,\nrespectively). Our result suggests that the non-linear evolution of CFI with\non-shell muons would induce flavor conversions with the complex interplay among\nall three different neutrino-mixing sectors.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}