{"id":"2407.09811","title":"CellAgent: An LLM-driven Multi-Agent Framework for Automated Single-cell\n  Data Analysis","authors":"Yihang Xiao, Jinyi Liu, Yan Zheng, Xiaohan Xie, Jianye Hao, Mingzhi\n  Li, Ruitao Wang, Fei Ni, Yuxiao Li, Jintian Luo, Shaoqing Jiao, Jiajie Peng","authorsParsed":[["Xiao","Yihang",""],["Liu","Jinyi",""],["Zheng","Yan",""],["Xie","Xiaohan",""],["Hao","Jianye",""],["Li","Mingzhi",""],["Wang","Ruitao",""],["Ni","Fei",""],["Li","Yuxiao",""],["Luo","Jintian",""],["Jiao","Shaoqing",""],["Peng","Jiajie",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 09:14:50 GMT"}],"updateDate":"2024-07-16","timestamp":1720862090000,"abstract":"  Single-cell RNA sequencing (scRNA-seq) data analysis is crucial for\nbiological research, as it enables the precise characterization of cellular\nheterogeneity. However, manual manipulation of various tools to achieve desired\noutcomes can be labor-intensive for researchers. To address this, we introduce\nCellAgent (http://cell.agent4science.cn/), an LLM-driven multi-agent framework,\nspecifically designed for the automatic processing and execution of scRNA-seq\ndata analysis tasks, providing high-quality results with no human intervention.\nFirstly, to adapt general LLMs to the biological field, CellAgent constructs\nLLM-driven biological expert roles - planner, executor, and evaluator - each\nwith specific responsibilities. Then, CellAgent introduces a hierarchical\ndecision-making mechanism to coordinate these biological experts, effectively\ndriving the planning and step-by-step execution of complex data analysis tasks.\nFurthermore, we propose a self-iterative optimization mechanism, enabling\nCellAgent to autonomously evaluate and optimize solutions, thereby guaranteeing\noutput quality. We evaluate CellAgent on a comprehensive benchmark dataset\nencompassing dozens of tissues and hundreds of distinct cell types. Evaluation\nresults consistently show that CellAgent effectively identifies the most\nsuitable tools and hyperparameters for single-cell analysis tasks, achieving\noptimal performance. This automated framework dramatically reduces the workload\nfor science data analyses, bringing us into the \"Agent for Science\" era.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Quantitative Biology/Genomics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}