{"id":"2407.08362","title":"STAL: Spike Threshold Adaptive Learning Encoder for Classification of\n  Pain-Related Biosignal Data","authors":"Freek Hens and Mohammad Mahdi Dehshibi and Leila Bagheriye and Mahyar\n  Shahsavari and Ana Tajadura-Jim\\'enez","authorsParsed":[["Hens","Freek",""],["Dehshibi","Mohammad Mahdi",""],["Bagheriye","Leila",""],["Shahsavari","Mahyar",""],["Tajadura-Jiménez","Ana",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 10:15:52 GMT"}],"updateDate":"2024-07-12","timestamp":1720692952000,"abstract":"  This paper presents the first application of spiking neural networks (SNNs)\nfor the classification of chronic lower back pain (CLBP) using the EmoPain\ndataset. Our work has two main contributions. We introduce Spike Threshold\nAdaptive Learning (STAL), a trainable encoder that effectively converts\ncontinuous biosignals into spike trains. Additionally, we propose an ensemble\nof Spiking Recurrent Neural Network (SRNN) classifiers for the multi-stream\nprocessing of sEMG and IMU data. To tackle the challenges of small sample size\nand class imbalance, we implement minority over-sampling with weighted sample\nreplacement during batch creation. Our method achieves outstanding performance\nwith an accuracy of 80.43%, AUC of 67.90%, F1 score of 52.60%, and Matthews\nCorrelation Coefficient (MCC) of 0.437, surpassing traditional rate-based and\nlatency-based encoding methods. The STAL encoder shows superior performance in\npreserving temporal dynamics and adapting to signal characteristics.\nImportantly, our approach (STAL-SRNN) outperforms the best deep learning method\nin terms of MCC, indicating better balanced class prediction. This research\ncontributes to the development of neuromorphic computing for biosignal\nanalysis. It holds promise for energy-efficient, wearable solutions in chronic\npain management.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YlHoxflAtwU4aS2o4iLf-YV4L67ZrqS3yhSxsX2Ys9E","pdfSize":"2712978"}
