{"id":"2407.11226","title":"VVV catalog of ab-type RR Lyrae in the inner Galactic bulge","authors":"M. Zoccali, C. Quezada, R. Contreras Ramos, E. Valenti, A.\n  Valenzuela-Navarro, J. Olivares Carvajal, A. Rojas Arriagada, J. H. Minniti,\n  F. Gran, and M. De Leo","authorsParsed":[["Zoccali","M.",""],["Quezada","C.",""],["Ramos","R. Contreras",""],["Valenti","E.",""],["Valenzuela-Navarro","A.",""],["Carvajal","J. Olivares",""],["Arriagada","A. Rojas",""],["Minniti","J. H.",""],["Gran","F.",""],["De Leo","M.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 20:24:52 GMT"}],"updateDate":"2024-09-18","timestamp":1721075092000,"abstract":"  Context. Observational evidence has accumulated in the past years, showing\nthat the Galactic bulge includes two populations, a metal poor and a metal rich\none that, in addition to a different metallicity, show different alpha over\niron abundances, spatial distribution, and kinematics. While the metal rich,\nbarred component has been fairly well characterized, the metal poor, spheroidal\ncomponent has been more elusive and harder to describe. RR Lyrae variables are\nclean tracers of the old bulge component, and they are, on average, more metal\npoor than red clump stars.\n  Aims. In the present paper, we provide a new catalog of 16488 ab type RR\nLyrae variables in the bulge region within -10<l<10 and -2.8<b<2.8, extracted\nfrom multi epoch PSF photometry performed on VISTA Variable in the Via Lactea\nsurvey data. We used the catalog to constrain the shape of the old, metal poor,\nbulge stellar population.\n  Methods. The identification of ab type RR Lyrae among a large sample of\ncandidate variables of different types has been performed via a combination of\na Random Forest classifier and visual inspection... [abridged]\n  Results. We use the present catalog to derive the shape of their distribution\naround the Galactic Center, resulting in an elongated spheroid with projected\naxis ratio b/a~0.7 and inclination angle ~20 degrees. We discuss how\nobservational biases such as errors on the distances and a non-uniform sampling\nin longitude, affect both the present measurements and previous ones,\nespecially those based on red clump stars... [abridged]\n  Conclusions. We publish a high purity RRab sample for future studies of the\noldest Galactic bulge population, close to the midplane. We explore different\nchoices for the period-luminosity-metallicity relation, highlighting how some\nof them introduce spurious trends of distances with either period or\nmetallicity, or both... [abridged]\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"6G_4EdayjzsimkHe1NpYfXTDpBc-Eev-W0A665OveNc","pdfSize":"7712305"}
