{"id":"2407.04213","title":"Pathfinder: Exploring Path Diversity for Assessing Internet Censorship\n  Inconsistency","authors":"Xiaoqin Liang, Guannan Liu, Lin Jin, Shuai Hao, Haining Wang","authorsParsed":[["Liang","Xiaoqin",""],["Liu","Guannan",""],["Jin","Lin",""],["Hao","Shuai",""],["Wang","Haining",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 01:48:31 GMT"}],"updateDate":"2024-07-08","timestamp":1720144111000,"abstract":"  Internet censorship is typically enforced by authorities to achieve\ninformation control for a certain group of Internet users. So far existing\ncensorship studies have primarily focused on country-level characterization\nbecause (1) in many cases, censorship is enabled by governments with nationwide\npolicies and (2) it is usually hard to control how the probing packets are\nrouted to trigger censorship in different networks inside a country. However,\nthe deployment and implementation of censorship could be highly diverse at the\nISP level. In this paper, we investigate Internet censorship from a different\nperspective by scrutinizing the diverse censorship deployment inside a country.\nSpecifically, by leveraging an end-to-end measurement framework, we deploy\nmultiple geo-distributed back-end control servers to explore various paths from\none single vantage point. The generated traffic with the same domain but\ndifferent control servers' IPs could be forced to traverse different transit\nnetworks, thereby being examined by different censorship devices if present.\nThrough our large-scale experiments and in-depth investigation, we reveal that\nthe diversity of Internet censorship caused by different routing paths inside a\ncountry is prevalent, implying that (1) the implementations of centralized\ncensorship are commonly incomplete or flawed and (2) decentralized censorship\nis also common. Moreover, we identify that different hosting platforms also\nresult in inconsistent censorship activities due to different peering\nrelationships with the ISPs in a country. Finally, we present extensive case\nstudies in detail to illustrate the configurations that lead to censorship\ninconsistency and explore the causes.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/"}