{"id":"2407.02424","title":"A Pattern Language for Machine Learning Tasks","authors":"Benjamin Rodatz, Ian Fan, Tuomas Laakkonen, Neil John Ortega, Thomas\n  Hoffman, Vincent Wang-Mascianica","authorsParsed":[["Rodatz","Benjamin",""],["Fan","Ian",""],["Laakkonen","Tuomas",""],["Ortega","Neil John",""],["Hoffman","Thomas",""],["Wang-Mascianica","Vincent",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 16:50:27 GMT"}],"updateDate":"2024-07-03","timestamp":1719939027000,"abstract":"  Idealised as universal approximators, learners such as neural networks can be\nviewed as \"variable functions\" that may become one of a range of concrete\nfunctions after training. In the same way that equations constrain the possible\nvalues of variables in algebra, we may view objective functions as constraints\non the behaviour of learners. We extract the equivalences perfectly optimised\nobjective functions impose, calling them \"tasks\". For these tasks, we develop a\nformal graphical language that allows us to: (1) separate the core tasks of a\nbehaviour from its implementation details; (2) reason about and design\nbehaviours model-agnostically; and (3) simply describe and unify approaches in\nmachine learning across domains.\n  As proof-of-concept, we design a novel task that enables converting\nclassifiers into generative models we call \"manipulators\", which we implement\nby directly translating task specifications into code. The resulting models\nexhibit capabilities such as style transfer and interpretable latent-space\nediting, without the need for custom architectures, adversarial training or\nrandom sampling. We formally relate the behaviour of manipulators to GANs, and\nempirically demonstrate their competitive performance with VAEs. We report on\nexperiments across vision and language domains aiming to characterise\nmanipulators as approximate Bayesian inversions of discriminative classifiers.\n","subjects":["Computing Research Repository/Machine Learning","Mathematics/Category Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Kax2yDo_teHtSyZ4zxu1b0P9o2UYIGJGCfC-UxyTI5c","pdfSize":"1909044"}
