{"id":"2407.16182","title":"No Re-Train, More Gain: Upgrading Backbones with Diffusion Model for\n  Few-Shot Segmentation","authors":"Shuai Chen, Fanman Meng, Chenhao Wu, Haoran Wei, Runtong Zhang, Qingbo\n  Wu, Linfeng Xu, Hongliang Li","authorsParsed":[["Chen","Shuai",""],["Meng","Fanman",""],["Wu","Chenhao",""],["Wei","Haoran",""],["Zhang","Runtong",""],["Wu","Qingbo",""],["Xu","Linfeng",""],["Li","Hongliang",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 05:09:07 GMT"}],"updateDate":"2024-07-24","timestamp":1721711347000,"abstract":"  Few-Shot Segmentation (FSS) aims to segment novel classes using only a few\nannotated images. Despite considerable process under pixel-wise support\nannotation, current FSS methods still face three issues: the inflexibility of\nbackbone upgrade without re-training, the inability to uniformly handle various\ntypes of annotations (e.g., scribble, bounding box, mask and text), and the\ndifficulty in accommodating different annotation quantity. To address these\nissues simultaneously, we propose DiffUp, a novel FSS method that\nconceptualizes the FSS task as a conditional generative problem using a\ndiffusion process. For the first issue, we introduce a backbone-agnostic\nfeature transformation module that converts different segmentation cues into\nunified coarse priors, facilitating seamless backbone upgrade without\nre-training. For the second issue, due to the varying granularity of\ntransformed priors from diverse annotation types, we conceptualize these\nmulti-granular transformed priors as analogous to noisy intermediates at\ndifferent steps of a diffusion model. This is implemented via a\nself-conditioned modulation block coupled with a dual-level quality modulation\nbranch. For the third issue, we incorporates an uncertainty-aware information\nfusion module that harmonizing the variability across zero-shot, one-shot and\nmany-shot scenarios. Evaluated through rigorous benchmarks, DiffUp\nsignificantly outperforms existing FSS models in terms of flexibility and\naccuracy.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}