{"id":"2407.20928","title":"UniProcessor: A Text-induced Unified Low-level Image Processor","authors":"Huiyu Duan, Xiongkuo Min, Sijing Wu, Wei Shen, Guangtao Zhai","authorsParsed":[["Duan","Huiyu",""],["Min","Xiongkuo",""],["Wu","Sijing",""],["Shen","Wei",""],["Zhai","Guangtao",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 16:06:39 GMT"}],"updateDate":"2024-07-31","timestamp":1722355599000,"abstract":"  Image processing, including image restoration, image enhancement, etc.,\ninvolves generating a high-quality clean image from a degraded input. Deep\nlearning-based methods have shown superior performance for various image\nprocessing tasks in terms of single-task conditions. However, they require to\ntrain separate models for different degradations and levels, which limits the\ngeneralization abilities of these models and restricts their applications in\nreal-world. In this paper, we propose a text-induced unified image processor\nfor low-level vision tasks, termed UniProcessor, which can effectively process\nvarious degradation types and levels, and support multimodal control.\nSpecifically, our UniProcessor encodes degradation-specific information with\nthe subject prompt and process degradations with the manipulation prompt. These\ncontext control features are injected into the UniProcessor backbone via\ncross-attention to control the processing procedure. For automatic\nsubject-prompt generation, we further build a vision-language model for\ngeneral-purpose low-level degradation perception via instruction tuning\ntechniques. Our UniProcessor covers 30 degradation types, and extensive\nexperiments demonstrate that our UniProcessor can well process these\ndegradations without additional training or tuning and outperforms other\ncompeting methods. Moreover, with the help of degradation-aware context\ncontrol, our UniProcessor first shows the ability to individually handle a\nsingle distortion in an image with multiple degradations.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}