{"id":"2407.12972","title":"Deep Learning for Quantitative Dynamic Fragmentation Analysis","authors":"Erwin Cazares and Brian E. Schuster","authorsParsed":[["Cazares","Erwin",""],["Schuster","Brian E.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 19:35:57 GMT"}],"updateDate":"2024-07-19","timestamp":1721244957000,"abstract":"  We have developed an image-based convolutional neural network (CNN) that is\napplicable for quantitative time-resolved measurements of the fragmentation\nbehavior of opaque brittle materials using ultra-high speed optical imaging.\nThis model extends previous work on the U-net model, where we trained binary, 3\nand 5 class models using supervised learning on experimentally measured dynamic\nfracture experiments on various opaque structural ceramic materials that were\nadhered on transparent polymer (polycarbonate or acrylic) backing materials.\nFull details of the experimental investigations are outside the scope of this\nmanuscript but briefly, several different ceramics were loaded using spatially\nand time-varying mechanical loads to induce inelastic deformation and fracture\nprocesses that were recorded at frequencies as high as 5 MHz using high speed\noptical imaging. These experiments provided a rich and diverse dataset that\nincludes many of the common fracture modes found in static and dynamic fracture\nincluding cone cracking, median cracking, comminution, and combined complex\nfailure modes that involve effectively simultaneous activation and propagation\nof multiple fragmentation modes. While the training data presented here was\nobtained from dynamic fragmentation experiments, this study is applicable to\nstatic loading of these materials as the crack speeds typically higher a\nkilometer per second in these materials are on the order of 1-10 km/s\nregardless of the loading rate. We believe the methodologies presented here\nwill be useful in quantifying the failure processes in structural materials for\nprotection applications and can be used for direct validation of engineering\nmodels used in design.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"F3FSJEn3WLdGM7A0M58n9c_2fMMCwiAcUTXnwzIncOg","pdfSize":"3424431"}
