{"id":"2407.20336","title":"Sun Off, Lights On: Photorealistic Monocular Nighttime Simulation for\n  Robust Semantic Perception","authors":"Konstantinos Tzevelekakis, Shutong Zhang, Luc Van Gool, Christos\n  Sakaridis","authorsParsed":[["Tzevelekakis","Konstantinos",""],["Zhang","Shutong",""],["Van Gool","Luc",""],["Sakaridis","Christos",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:00:09 GMT"}],"updateDate":"2024-07-31","timestamp":1722276009000,"abstract":"  Nighttime scenes are hard to semantically perceive with learned models and\nannotate for humans. Thus, realistic synthetic nighttime data become all the\nmore important for learning robust semantic perception at night, thanks to\ntheir accurate and cheap semantic annotations. However, existing data-driven or\nhand-crafted techniques for generating nighttime images from daytime\ncounterparts suffer from poor realism. The reason is the complex interaction of\nhighly spatially varying nighttime illumination, which differs drastically from\nits daytime counterpart, with objects of spatially varying materials in the\nscene, happening in 3D and being very hard to capture with such 2D approaches.\nThe above 3D interaction and illumination shift have proven equally hard to\nmodel in the literature, as opposed to other conditions such as fog or rain.\nOur method, named Sun Off, Lights On (SOLO), is the first to perform nighttime\nsimulation on single images in a photorealistic fashion by operating in 3D. It\nfirst explicitly estimates the 3D geometry, the materials and the locations of\nlight sources of the scene from the input daytime image and relights the scene\nby probabilistically instantiating light sources in a way that accounts for\ntheir semantics and then running standard ray tracing. Not only is the visual\nquality and photorealism of our nighttime images superior to competing\napproaches including diffusion models, but the former images are also proven\nmore beneficial for semantic nighttime segmentation in day-to-night adaptation.\nCode and data will be made publicly available.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}