{"id":"2407.04561","title":"Wireless Spectrum in Rural Farmlands: Status, Challenges and\n  Opportunities","authors":"Mukaram Shahid, Kunal Das, Taimoor Ul Islam, Christ Somiah, Daji Qiao,\n  Arsalan Ahmad, Jimming Song, Zhengyuan Zhu, Sarath Babu, Yong Guan, Tusher\n  Chakraborty, Suraj Jog, Ranveer Chandra, Hongwei Zhang","authorsParsed":[["Shahid","Mukaram",""],["Das","Kunal",""],["Islam","Taimoor Ul",""],["Somiah","Christ",""],["Qiao","Daji",""],["Ahmad","Arsalan",""],["Song","Jimming",""],["Zhu","Zhengyuan",""],["Babu","Sarath",""],["Guan","Yong",""],["Chakraborty","Tusher",""],["Jog","Suraj",""],["Chandra","Ranveer",""],["Zhang","Hongwei",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 14:48:25 GMT"}],"updateDate":"2024-07-08","timestamp":1720190905000,"abstract":"  Due to factors such as low population density and expansive geographical\ndistances, network deployment falls behind in rural regions, leading to a\nbroadband divide. Wireless spectrum serves as the blood and flesh of wireless\ncommunications. Shared white spaces such as those in the TVWS and CBRS spectrum\nbands offer opportunities to expand connectivity, innovate, and provide\naffordable access to high-speed Internet in under-served areas without\nadditional cost to expensive licensed spectrum. However, the current methods to\nutilize these white spaces are inefficient due to very conservative models and\nspectrum policies, causing under-utilization of valuable spectrum resources.\nThis hampers the full potential of innovative wireless technologies that could\nbenefit farmers, small Internet Service Providers (ISPs) or Mobile Network\nOperators (MNOs) operating in rural regions. This study explores the challenges\nfaced by farmers and service providers when using shared spectrum bands to\ndeploy their networks while ensuring maximum system performance and minimizing\ninterference with other users. Additionally, we discuss how spatiotemporal\nspectrum models, in conjunction with database-driven spectrum-sharing\nsolutions, can enhance the allocation and management of spectrum resources,\nultimately improving the efficiency and reliability of wireless networks\noperating in shared spectrum bands.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}