{"id":"2407.05019","title":"Quantum algorithm for partial differential equations of non-conservative\n  systems with spatially varying parameters","authors":"Yuki Sato, Hiroyuki Tezuka, Ruho Kondo, Naoki Yamamoto","authorsParsed":[["Sato","Yuki",""],["Tezuka","Hiroyuki",""],["Kondo","Ruho",""],["Yamamoto","Naoki",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 09:23:04 GMT"}],"updateDate":"2024-07-09","timestamp":1720257784000,"abstract":"  Partial differential equations (PDEs) are crucial for modeling various\nphysical phenomena such as heat transfer, fluid flow, and electromagnetic\nwaves. In computer-aided engineering (CAE), the ability to handle fine\nresolutions and large computational models is essential for improving product\nperformance and reducing development costs. However, solving large-scale PDEs,\nparticularly for systems with spatially varying material properties, poses\nsignificant computational challenges. In this paper, we propose a quantum\nalgorithm for solving second-order linear PDEs of non-conservative systems with\nspatially varying parameters, using the linear combination of Hamiltonian\nsimulation (LCHS) method. Our approach transforms those PDEs into ordinary\ndifferential equations represented by qubit operators, through spatial\ndiscretization using the finite difference method. Then, we provide an\nalgorithm that efficiently constructs the operator corresponding to the\nspatially varying parameters of PDEs via a logic minimization technique, which\nreduces the number of terms and subsequently the circuit depth. We also develop\na scalable method for realizing a quantum circuit for LCHS, using a\ntensor-network-based technique, specifically a matrix product state (MPS). We\nvalidate our method with applications to the acoustic equation with spatially\nvarying parameters and the dissipative heat equation. Our approach includes a\ndetailed recipe for constructing quantum circuits for PDEs, leveraging\nefficient encoding of spatially varying parameters of PDEs and scalable\nimplementation of LCHS, which we believe marks a significant step towards\nadvancing quantum computing's role in solving practical engineering problems.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}