{"id":"2407.11617","title":"Feature interpretability in BCIs: exploring the role of network\n  lateralization","authors":"Juliana Gonzalez-Astudillo and Fabrizio De Vico Fallani","authorsParsed":[["Gonzalez-Astudillo","Juliana",""],["Fallani","Fabrizio De Vico",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 11:27:39 GMT"}],"updateDate":"2024-07-17","timestamp":1721129259000,"abstract":"  Brain-computer interfaces (BCIs) enable users to interact with the external\nworld using brain activity. Despite their potential in neuroscience and\nindustry, BCI performance remains inconsistent in noninvasive applications,\noften prioritizing algorithms that achieve high classification accuracies while\nmasking the neural mechanisms driving that performance. In this study, we\ninvestigated the interpretability of features derived from brain network\nlateralization, benchmarking against widely used techniques like power spectrum\ndensity (PSD), common spatial pattern (CSP), and Riemannian geometry. We\nfocused on the spatial distribution of the functional connectivity within and\nbetween hemispheres during motor imagery tasks, introducing network-based\nmetrics such as integration and segregation. Evaluating these metrics across\nmultiple EEG-based BCI datasets, our findings reveal that network\nlateralization offers neurophysiological plausible insights, characterized by\nstronger lateralization in sensorimotor and frontal areas contralateral to\nimagined movements. While these lateralization features did not outperform CSP\nand Riemannian geometry in terms of classification accuracy, they demonstrated\ncompetitive performance against PSD alone and provided biologically relevant\ninterpretation. This study underscores the potential of brain network\nlateralization as a new feature to be integrated in motor imagery-based BCIs\nfor enhancing the interpretability of noninvasive applications.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KQ65lAuERtPgKqVONw0mhE9lSz1kLwQaoIy1Miakz0U","pdfSize":"19742576"}
