{"id":"2407.12469","title":"Inverse participation ratio and entanglement of edge states in HgTe\n  quantum wells in a finite strip geometry","authors":"Manuel Calixto and Octavio Casta\\~nos","authorsParsed":[["Calixto","Manuel",""],["Castaños","Octavio",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 10:46:19 GMT"}],"updateDate":"2024-07-18","timestamp":1721213179000,"abstract":"  Localization and entanglement properties of edge states of HgTe quantum wells\nin a finite strip geometry of width $L$ are studied under quantum information\nconcepts such as: 1) inverse participation ratio (IPR), which measures\nlocalization, and 2) entropies of the reduced density matrix (RDM) for the spin\nsector, which measures quantum correlations due to the spin-orbit coupling\n(SOC). Qualitative and quantitative information on the edge states energies and\nwavefunctions is extracted from analytic and numerical Hamiltonian\ndiagonalization approaches. The previously observed exponential decay of the\nenergy gap with $L$ and its modulations is confirmed and nontrivial\nconsequences of the strip width and Rashba terms on the charge conductance are\nalso reviewed. Analysis of the structure of the edge-state wave functions in\nterms of spin, momentum $k_x$ in the $x$-direction and position $y$, evidences\nthe spin polarization structure of edge states at the boundaries. An IPR\nanalysis reveals that the valence edge states show maximum localization on the\nboundaries for certain values of the momenta $k_x$ in the vicinity of the\n$\\Gamma$ point. The edge-state wave packets participate of less and less\nmomenta as we approach to the boundaries $y=0,L$ (and also the center $y=L/2$,\nfor some of them) of the strip. A study of the RDM to the spin sector of edge\nstates sheds complementary information on the structure of spin probabilities\nin $(k_x,y)$ space, giving clear location of extremal values. The purity and\nentropies of the RDM inform on the regions $(k_x,y)$ where the spin sector is\nmore and less entangled with the rest of the system, due to SOC.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}