{"id":"2407.12985","title":"Examining partial ergodicity as a predictor of star formation departures\n  from the galactic main sequence in isolated galaxies","authors":"Fraser M. Smith and Robert J. Thacker","authorsParsed":[["Smith","Fraser M.",""],["Thacker","Robert J.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 20:06:41 GMT"}],"updateDate":"2024-07-19","timestamp":1721246801000,"abstract":"  Lacking the ability to follow individual galaxies on cosmological timescales,\nour understanding of individual galaxy evolution is broadly inferred from\npopulation trends and behaviours. In its most prohibitive form, this approach\nassumes that galactic star formation properties exhibit ergodicity, so that\nindividual galaxy evolution can be statistically inferred via ensemble\nbehaviours. The validity of this assumption is tested through the use of\nobservationally motivated simulations of isolated galaxies. The suite of\nsimulated galaxies is statistically constructed to match observed galaxy\nproperties by using kernel density estimation to create structural parameter\ndistributions, augmented by theoretical relationships where necessary. We also\ntest the impact of different physical processes, such as stellar winds or the\npresence of halo substructure on the star formation behaviour. We consider the\nsubtleties involved in constraining ergodic properties, such as the distinction\nbetween stationarity imposed by stellar wind feedback and truly ergodic\nbehaviour. However, without sufficient variability in star formation\nproperties, individual galaxies are unable to explore the full parameter space.\nWhile, as expected, full ergodicity appears to be ruled out, we find reasonable\nevidence for partial ergodicity, where averaging over mass-selected subsets of\ngalaxies more broadly resembles time averages, where the average largest\ndeviation across physical scenarios is 0.20 dex. As far as we are aware, this\nthe first time partial ergodicity has been considered in an astronomical\ncontext, and provides a promising statistical concept. Despite morphological\nchanges introduced by close encounters with dark matter substructure, subhaloes\nare not found to significantly increase deviations from ergodic assumptions.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}