{"id":"2407.20388","title":"Constraints on non-unitary neutrino mixing in light of atmospheric and\n  reactor neutrino data","authors":"Tetiana Kozynets, Philipp Eller, Alan Zander, Manuel Ettengruber, D.\n  Jason Koskinen","authorsParsed":[["Kozynets","Tetiana",""],["Eller","Philipp",""],["Zander","Alan",""],["Ettengruber","Manuel",""],["Koskinen","D. Jason",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 19:26:32 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 18:31:13 GMT"}],"updateDate":"2024-09-19","timestamp":1722281192000,"abstract":"  While the origin of neutrino masses remains unknown, several key neutrino\nmass generation models result in a non-unitary three-neutrino mixing matrix. To\nput such models to test, the deviations of the mixing matrix from unitarity can\nbe measured directly through neutrino oscillation experiments. In this study,\nwe perform a Bayesian analysis of the non-unitary mixing model using the recent\npublic data from atmospheric and reactor neutrino experiments - namely\nIceCube-DeepCore, Daya Bay, and KamLAND. The novelty of our approach compared\nto the preceding global fits for non-unitarity is in the detailed treatment of\nthe atmospheric neutrino data, which for the first time includes the relevant\nflux and detector systematic uncertainties. From the Bayesian posteriors on the\nindividual mixing matrix elements, we derive the non-unitarity constraints in\nthe form of normalisations and closures of the mixing matrix rows and columns.\nWe find comparable constraints for electron and tau row normalisations as other\nsimilar studies in literature, and additionally reveal strong correlations\nbetween muon and tau row constraints induced by the atmospheric systematic\nuncertainties. We find that the current data is well described by both unitary\nand non-unitary mixing models, with a strong preference for the unitary mixing\nindicated by the Bayes factor. With the upcoming IceCube-Upgrade and JUNO\ndetectors, both featuring superior energy resolution compared to the current\natmospheric and reactor neutrino experiments, our constraints on the row\nnormalisations are expected to improve by a factor of 2 (2.5) in the tau (muon)\nsector and by nearly 25% in the electron sector. In the future, our approach\ncan be expanded to include solar and long-baseline neutrino experiments, with\nthe aim to provide more stringent constraints while keeping track of the\nnuisance parameters that may be degenerate with non-unitarity.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}