{"id":"2407.07309","title":"Coordinated JWST Imaging of Three Distance Indicators in a SN Host\n  Galaxy and an Estimate of the TRGB Color Dependence","authors":"Taylor J. Hoyt, In Sung Jang, Wendy L. Freedman, Barry F. Madore,\n  Abigail J. Lee, Kayla A. Owens","authorsParsed":[["Hoyt","Taylor J.",""],["Jang","In Sung",""],["Freedman","Wendy L.",""],["Madore","Barry F.",""],["Lee","Abigail J.",""],["Owens","Kayla A.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 02:09:37 GMT"}],"updateDate":"2024-07-11","timestamp":1720577377000,"abstract":"  Boasting a 6.5m mirror in space, JWST can increase by several times the\nnumber of supernovae (SNe) to which a redshift-independent distance has been\nmeasured with a precision distance indicator (e.g., TRGB or Cepheids); the\nlimited number of such SN calibrators currently dominates the uncertainty\nbudget in distance ladder Hubble constant (H0) experiments. JWST/NIRCAM imaging\nof the Virgo Cluster galaxy NGC4536 is used here to preview JWST program\nGO-1995, which aims to measure H0 using three stellar distance indicators\n(Cepheids, TRGB, JAGB/carbon stars). Each population of distance indicator was\nhere successfully detected -- with sufficiently large number statistics,\nwell-measured fluxes, and characteristic distributions consistent with ingoing\nexpectations -- so as to confirm that we can acquire distances from each method\nprecise to about 0.05mag (statistical uncertainty only). We leverage\noverlapping HST imaging to identify TRGB stars, cross-match them with the JWST\nphotometry, and present a preliminary constraint on the slope of the TRGB's\nF115W-(F115W}-F444W) relation equal to -0.99 +/- 0.16 mag/mag. This slope is\nconsistent with prior slope measurements in the similar 2MASS J-band, as well\nas with predictions from the BASTI isochrone suite. We use the new TRGB slope\nestimate to flatten the two-dimensional TRGB feature and measure a (blinded)\nTRGB distance relative to a set of fiducial TRGB colors, intended to represent\nthe absolute fiducial calibrations expected from geometric anchors such as\nNGC4258 and the Magellanic Clouds. In doing so, we empirically demonstrate that\nthe TRGB can be used as a standardizable candle at the IR wavelengths\naccessible with JWST.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}