{"id":"2407.01775","title":"Tayler-Spruit dynamo in stably stratified rotating fluids: Application\n  to proto-magnetars","authors":"Paul Barr\\`ere, J\\'er\\^ome Guilet, Rapha\\\"el Raynaud, Alexis\n  Reboul-Salze","authorsParsed":[["Barrère","Paul",""],["Guilet","Jérôme",""],["Raynaud","Raphaël",""],["Reboul-Salze","Alexis",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 20:09:09 GMT"}],"updateDate":"2024-07-03","timestamp":1719864549000,"abstract":"  The formation of highly magnetized young neutron stars, called magnetars, is\nstill a strongly debated question. A promising scenario invokes the\namplification of the magnetic field by the Tayler-Spruit dynamo in a\nproto-neutron star (PNS) spun up by fallback. Barr\\`ere et al. 2023 supports\nthis scenario by demonstrating that this dynamo can generate magnetar-like\nmagnetic fields in stably stratified Boussinesq models of a PNS interior. To\nfurther investigate the Tayler-Spruit dynamo, we perform 3D-MHD numerical\nsimulations with the MagIC code varying the ratio between the\nBrunt-V\\\"ais\\\"al\\\"a frequency and the rotation rate. We first demonstrate that\na self-sustained dynamo process can be maintained for a Brunt-V\\\"ais\\\"al\\\"a\nfrequency about 4 times higher than the angular rotation frequency. The\ngenerated magnetic fields and angular momentum transport follow the analytical\nscaling laws of Fuller et al. 2019, which confirms our previous results. We\nalso report for the first time the existence of an intermittent Tayler-Spruit\ndynamo. For a typical PNS Brunt-V\\\"ais\\\"al\\\"a frequency of $10^{3}\\,{\\rm\ns}^{-1}$, the axisymmetric toroidal and dipolar magnetic fields range between\n$1.2\\times 10^{15}-2\\times 10^{16}\\,{\\rm G}$ and $1.4\\times 10^{13}-3\\times\n10^{15}\\,{\\rm G}$, for rotation periods of $1-10\\,{\\rm ms}$. Thus, our results\nprovide numerical evidence that our scenario can explain the formation of\nmagnetars. As the Tayler-Spruit dynamo is often invoked for the angular\nmomentum transport in stellar radiative zones, our results are also of\nparticular importance in this field and we provide a calibration of the Fuller\net al.'s prescription based on our simulations, with a dimensionless\nnormalisation factor of the order of $10^{-2}$.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wgDcQ2o4dIgNMRp3QOctglLQlEUB-cRe698iUYtzq0o","pdfSize":"12582501"}
