{"id":"2407.20445","title":"Futga: Towards Fine-grained Music Understanding through\n  Temporally-enhanced Generative Augmentation","authors":"Junda Wu, Zachary Novack, Amit Namburi, Jiaheng Dai, Hao-Wen Dong,\n  Zhouhang Xie, Carol Chen, Julian McAuley","authorsParsed":[["Wu","Junda",""],["Novack","Zachary",""],["Namburi","Amit",""],["Dai","Jiaheng",""],["Dong","Hao-Wen",""],["Xie","Zhouhang",""],["Chen","Carol",""],["McAuley","Julian",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 22:53:32 GMT"}],"updateDate":"2024-07-31","timestamp":1722293612000,"abstract":"  Existing music captioning methods are limited to generating concise global\ndescriptions of short music clips, which fail to capture fine-grained musical\ncharacteristics and time-aware musical changes. To address these limitations,\nwe propose FUTGA, a model equipped with fined-grained music understanding\ncapabilities through learning from generative augmentation with temporal\ncompositions. We leverage existing music caption datasets and large language\nmodels (LLMs) to synthesize fine-grained music captions with structural\ndescriptions and time boundaries for full-length songs. Augmented by the\nproposed synthetic dataset, FUTGA is enabled to identify the music's temporal\nchanges at key transition points and their musical functions, as well as\ngenerate detailed descriptions for each music segment. We further introduce a\nfull-length music caption dataset generated by FUTGA, as the augmentation of\nthe MusicCaps and the Song Describer datasets. We evaluate the automatically\ngenerated captions on several downstream tasks, including music generation and\nretrieval. The experiments demonstrate the quality of the generated captions\nand the better performance in various downstream tasks achieved by the proposed\nmusic captioning approach. Our code and datasets can be found in\n\\href{https://huggingface.co/JoshuaW1997/FUTGA}{\\textcolor{blue}{https://huggingface.co/JoshuaW1997/FUTGA}}.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}