{"id":"2407.06789","title":"A NICER View of the Nearest and Brightest Millisecond Pulsar: PSR\n  J0437$\\unicode{x2013}$4715","authors":"Devarshi Choudhury, Tuomo Salmi, Serena Vinciguerra, Thomas E. Riley,\n  Yves Kini, Anna L. Watts, Bas Dorsman, Slavko Bogdanov, Sebastien Guillot,\n  Paul S. Ray, Daniel J. Reardon, Ronald A. Remillard, Anna V. Bilous, Daniela\n  Huppenkothen, James M. Lattimer, Nathan Rutherford, Zaven Arzoumanian, Keith\n  C. Gendreau, Sharon M. Morsink, Wynn C. G. Ho","authorsParsed":[["Choudhury","Devarshi",""],["Salmi","Tuomo",""],["Vinciguerra","Serena",""],["Riley","Thomas E.",""],["Kini","Yves",""],["Watts","Anna L.",""],["Dorsman","Bas",""],["Bogdanov","Slavko",""],["Guillot","Sebastien",""],["Ray","Paul S.",""],["Reardon","Daniel J.",""],["Remillard","Ronald A.",""],["Bilous","Anna V.",""],["Huppenkothen","Daniela",""],["Lattimer","James M.",""],["Rutherford","Nathan",""],["Arzoumanian","Zaven",""],["Gendreau","Keith C.",""],["Morsink","Sharon M.",""],["Ho","Wynn C. G.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 12:00:43 GMT"}],"updateDate":"2024-09-04","timestamp":1720526443000,"abstract":"  We report Bayesian inference of the mass, radius and hot X-ray emitting\nregion properties - using data from the Neutron Star Interior Composition\nExploreR (NICER) - for the brightest rotation-powered millisecond X-ray pulsar\nPSR J0437$\\unicode{x2013}$4715. Our modeling is conditional on informative\ntight priors on mass, distance and binary inclination obtained from radio\npulsar timing using the Parkes Pulsar Timing Array (PPTA) (Reardon et al.\n2024), and we use NICER background models to constrain the non-source\nbackground, cross-checking with data from XMM-Newton. We assume two distinct\nhot emitting regions, and various parameterized hot region geometries that are\ndefined in terms of overlapping circles; while simplified, these capture many\nof the possibilities suggested by detailed modeling of return current heating.\nFor the preferred model identified by our analysis we infer a mass of $M =\n1.418 \\pm 0.037$ M$_\\odot$ (largely informed by the PPTA mass prior) and an\nequatorial radius of $R = 11.36^{+0.95}_{-0.63}$ km, each reported as the\nposterior credible interval bounded by the 16% and 84% quantiles. This radius\nfavors softer dense matter equations of state and is highly consistent with\nconstraints derived from gravitational wave measurements of neutron star binary\nmergers. The hot regions are inferred to be non-antipodal, and hence\ninconsistent with a pure centered dipole magnetic field.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics","Physics/Nuclear Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}