{"id":"2407.01799","title":"Disentangling individual-level from location-based income uncovers\n  socioeconomic preferential mobility and impacts segregation estimates","authors":"Marc Duran-Sala, Anandu Koikkalethu Balachandran, Marta Morandini,\n  Timur Naushirvanov, Adarsh Prabhakaran, Andrew Renninger and Mattia Mazzoli","authorsParsed":[["Duran-Sala","Marc",""],["Balachandran","Anandu Koikkalethu",""],["Morandini","Marta",""],["Naushirvanov","Timur",""],["Prabhakaran","Adarsh",""],["Renninger","Andrew",""],["Mazzoli","Mattia",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 20:56:39 GMT"}],"updateDate":"2024-07-03","timestamp":1719867399000,"abstract":"  Segregation encodes information about society, such as social cohesion,\nmixing, and inequality. However, most past and current studies tackled\nsocioeconomic (SE) segregation by analyzing static aggregated mobility\nnetworks, often without considering further individual features beyond income\nand, most importantly, without distinguishing individual-level from\nlocation-based income. Accessing individual-level income may help mapping\nmacroscopic behavior into more granular mobility patterns, hence impacting\nsegregation estimates. Here we combine a mobile phone dataset of daily mobility\nflows across Spanish districts stratified and adjusted by age, gender and\nincome with census data of districts median income. We build mobility-based SE\nassortativity matrices for multiple demographics and observe mobility patterns\nof three income groups with respect to location-based SE classes. We find that\nSE assortativity differs when isolating the mobility of specific income groups:\nwe observe that groups prefer to visit areas with higher average income than\ntheir own, which we call preferential mobility. Our analysis suggests\nsubstantial differences between weekdays and weekends SE assortativity by age\nclass, with weekends characterized by higher SE assortativity. Our modeling\napproach shows that the radiation model, which typically performs best at\nreproducing inter-municipal population mobility, best fits middle income and\nmiddle-aged flows, while performing worse on young and low income groups. Our\ndouble-sided approach, focusing on assortativity patterns and mobility\nmodeling, suggests that state of the art mobility models fail at capturing\npreferential mobility behavior. Overall, our work indicates that mobility\nmodels considering the interplay of SE preferential behavior, age and gender\ngaps may sensibly improve the state of the art models performance.\n","subjects":["Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}