{"id":"2407.01092","title":"Kolmogorov-Arnold Convolutions: Design Principles and Empirical Studies","authors":"Ivan Drokin","authorsParsed":[["Drokin","Ivan",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:49:33 GMT"}],"updateDate":"2024-07-02","timestamp":1719823773000,"abstract":"  The emergence of Kolmogorov-Arnold Networks (KANs) has sparked significant\ninterest and debate within the scientific community. This paper explores the\napplication of KANs in the domain of computer vision (CV). We examine the\nconvolutional version of KANs, considering various nonlinearity options beyond\nsplines, such as Wavelet transforms and a range of polynomials. We propose a\nparameter-efficient design for Kolmogorov-Arnold convolutional layers and a\nparameter-efficient finetuning algorithm for pre-trained KAN models, as well as\nKAN convolutional versions of self-attention and focal modulation layers. We\nprovide empirical evaluations conducted on MNIST, CIFAR10, CIFAR100, Tiny\nImageNet, ImageNet1k, and HAM10000 datasets for image classification tasks.\nAdditionally, we explore segmentation tasks, proposing U-Net-like architectures\nwith KAN convolutions, and achieving state-of-the-art results on BUSI, GlaS,\nand CVC datasets. We summarized all of our findings in a preliminary design\nguide of KAN convolutional models for computer vision tasks. Furthermore, we\ninvestigate regularization techniques for KANs. All experimental code and\nimplementations of convolutional layers and models, pre-trained on ImageNet1k\nweights are available on GitHub via this\nhttps://github.com/IvanDrokin/torch-conv-kan\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_Z0pV2nsI8i_vmtxj9iJ0E52j8XZ6bT7KDjiEM42p1k","pdfSize":"2777729","objectId":"0x026e6a4c8aab098c70312e9b0e92e33f8f4ed09bd3e5a10ceb30af79353ae5a7","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
