{"id":"2407.15932","title":"The Effect of Donor Star Rejuvenation on Common Envelope Evolution","authors":"C. Landri, P. M. Ricker, M. Renzo, S. Rau, and A. Vigna-G\\'omez","authorsParsed":[["Landri","C.",""],["Ricker","P. M.",""],["Renzo","M.",""],["Rau","S.",""],["Vigna-Gómez","A.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-24","timestamp":1721671203000,"abstract":"  In close binary star systems, common envelope evolution may occur after a\nprevious phase of mass transfer. Some isolated formation channels for double\nneutron star binaries suggest that the donor of common envelope evolution was\nthe accretor of a previous phase of stable mass transfer. Accretion should\nsubstantially alter the structure of the donor, particularly by steepening the\ndensity gradient at the core-envelope interface and rejuvenating the star. We\nstudy the common envelope evolution of a donor that was the accretor of a\nprevious phase of stable mass transfer and has a rejuvenated structure. We\nperform 3D hydrodynamics simulations of the common envelope evolution of a 18\n$M_\\odot$ supergiant with a 1.4 $M_\\odot$ companion using rejuvenated and\nnon-rejuvenated 1D stellar models for the donor. We compare the two simulations\nto characterize the effect of the rejuvenation on the outcome of the common\nenvelope phase and the shape of the ejecta. We find that accounting for a\nprevious phase of mass transfer reduces the duration of the inspiral phase by a\nfactor of two, likely due to the different structure in the outer layers of the\ndonor. In the rejuvenated case, the simulations show more equatorially\nconcentrated and asymmetric ejecta, though both cases display evidence for the\nformation of a pressure-supported thick circumbinary disk. During the dynamical\ninspiral phase, the impact of rejuvenation on the unbinding of the envelope is\nunclear; we find that rejuvenation decreases the amount of unbound mass by\n20$\\%$ to 40$\\%$ depending on the energy criterion used.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"B9JSGx6yYeDjc3f-RNCiBMB9ofq8If6Q73aQrHOmpOY","pdfSize":"12882107"}
