{"id":"2407.13063","title":"Smart polymer solution and thermal conductivity: How important is an\n  exact polymer conformation?","authors":"Mokter M. Chowdhury, Robinson Cortes-Huerto, and Debashish Mukherji","authorsParsed":[["Chowdhury","Mokter M.",""],["Cortes-Huerto","Robinson",""],["Mukherji","Debashish",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 00:13:12 GMT"}],"updateDate":"2024-07-19","timestamp":1721261592000,"abstract":"  Heat management in devices is a key to their efficiency and longevity. Here,\nthermal switches (TS) are of great importance because of their ability to\ntransition between different thermal conductivity $\\kappa$ states. While\ntraditional TS are bulky and slow, recent experiments have suggested \"smart\"\nresponsive (bio--inspired) polymers as their fast alternatives. One example is\npoly(N--isopropylacrylamide) (PNIPAM) in water, where $\\kappa$ drops suddenly\naround a temperature $T_{\\ell} \\simeq 305$ K when a PNIPAM undergoes a\ncoil--to--globule transition. At a first glance, this may suggest that the\nchange in polymer conformation has a direct influence on TS. However, it may be\npresumptuous to trivially \"only\" link conformations with TS, especially because\nmany complex microscopic details control macroscopic conformational transition.\nMotivated by this, we study TS in \"smart\" polymers using generic simulations.\nAs the test cases, we investigate two different modes of polymer collapse using\nexternal stimuli, i.e., changing $T$ and cosolvent mole fraction $x_{\\rm c}$.\nCollapse upon increasing $T$ shows a direct correlation between the\nconformation and $\\kappa$ switching, while no correlation is observed in the\nlatter case. These results suggest that the (co--)solvent--monomer interactions\nplay a greater important role than the exact conformation in dictating TS.\nWhile some results are compared with the available experiments, possible future\ndirections are also highlighted.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}