{"id":"2407.20093","title":"Inherent spin-orbit locking in topological bound state in the continuum\n  lasing","authors":"Jiajun Wang, Xinhao Wang, Zhaochen Wu, Xingqi Zhao, Shunben Wu, Lei\n  Shi, Yuri Kivshar, Jian Zi","authorsParsed":[["Wang","Jiajun",""],["Wang","Xinhao",""],["Wu","Zhaochen",""],["Zhao","Xingqi",""],["Wu","Shunben",""],["Shi","Lei",""],["Kivshar","Yuri",""],["Zi","Jian",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:23:09 GMT"}],"updateDate":"2024-07-30","timestamp":1722266589000,"abstract":"  Bound states in the continuum (BICs) are exotic optical topological\nsingularities that defy the typical radiation within the continuum of radiative\nmodes and carry topological polarization vortices in momentum space. Enabling\nultrahigh quality factors, BICs have been applied in realizing lasing and\nBose-Einstein condensation via micro-/nano- photonic structures, and their\nmomentum-space vortex topologies have been exploited in passive systems,\nrevealing novel spin-orbit photonic effects. However, as representative\ntopological properties, the spin-orbit-related phenemona of BICs in active\nsystems have not yet been explored. Here, we demonstrate the inherent\nspin-orbit locking in topological BIC lasing. Utilizing photonic crystal (PhC)\nslabs with square (C4v) and triangular (C6v) lattices, we achieve distinct\nspin-orbit locking combinations in topological BIC lasing of +1 and -2\ntopological charges. These BIC lasing profiles manifest as vortex and\nhigh-order anti-vortex polarization configurations, directly tied to the\ntopological properties of BICs. Our experimental results directly reveal the\nspin-orbit locking phenomena through momentum-space spin-dependent\nself-interference patterns and real-space spin separations of the lasing\nemissions. This study not only highlights the inherent spin-orbit-locking\nbehaviours of topological BIC lasing but also opens new possibilities for\ndynamically switchable orbital angular momentum (OAM) lasing by controlling\nphotonic spin, presenting significant potential for advancements in topological\nphotonic source applications.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}