{"id":"2407.07433","title":"Controllable Navigation Instruction Generation with Chain of Thought\n  Prompting","authors":"Xianghao Kong, Jinyu Chen, Wenguan Wang, Hang Su, Xiaolin Hu, Yi Yang,\n  Si Liu","authorsParsed":[["Kong","Xianghao",""],["Chen","Jinyu",""],["Wang","Wenguan",""],["Su","Hang",""],["Hu","Xiaolin",""],["Yang","Yi",""],["Liu","Si",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 07:37:20 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 10:09:34 GMT"}],"updateDate":"2024-07-17","timestamp":1720597040000,"abstract":"  Instruction generation is a vital and multidisciplinary research area with\nbroad applications. Existing instruction generation models are limited to\ngenerating instructions in a single style from a particular dataset, and the\nstyle and content of generated instructions cannot be controlled. Moreover,\nmost existing instruction generation methods also disregard the spatial\nmodeling of the navigation environment. Leveraging the capabilities of Large\nLanguage Models (LLMs), we propose C-Instructor, which utilizes the\nchain-of-thought-style prompt for style-controllable and content-controllable\ninstruction generation. Firstly, we propose a Chain of Thought with Landmarks\n(CoTL) mechanism, which guides the LLM to identify key landmarks and then\ngenerate complete instructions. CoTL renders generated instructions more\naccessible to follow and offers greater controllability over the manipulation\nof landmark objects. Furthermore, we present a Spatial Topology Modeling Task\nto facilitate the understanding of the spatial structure of the environment.\nFinally, we introduce a Style-Mixed Training policy, harnessing the prior\nknowledge of LLMs to enable style control for instruction generation based on\ndifferent prompts within a single model instance. Extensive experiments\ndemonstrate that instructions generated by C-Instructor outperform those\ngenerated by previous methods in text metrics, navigation guidance evaluation,\nand user studies.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"GV4E_SRbHh4eEcDhL4B9sR-aor0BcNhnafiw30DvAu8","pdfSize":"3310007","objectId":"0x667494d03f82a86b561d911c8cdf824ac10f99d52aaeaa0f4e7150134662447f","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
