{"id":"2407.03512","title":"The Art of the Steal: Purloining Deep Learning Models Developed for an\n  Ultrasound Scanner to a Competitor Machine","authors":"Ufuk Soylu and Varun Chandrasekeran and Michael L. Oelze","authorsParsed":[["Soylu","Ufuk",""],["Chandrasekeran","Varun",""],["Oelze","Michael L.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 21:19:13 GMT"}],"updateDate":"2024-07-08","timestamp":1720041553000,"abstract":"  A transfer function approach has recently proven effective for calibrating\ndeep learning (DL) algorithms in quantitative ultrasound (QUS), addressing data\nshifts at both the acquisition and machine levels. Expanding on this approach,\nwe develop a strategy to 'steal' the functionality of a DL model from one\nultrasound machine and implement it on another, in the context of QUS. This\ndemonstrates the ease with which the functionality of a DL model can be\ntransferred between machines, highlighting the security risks associated with\ndeploying such models in a commercial scanner for clinical use. The proposed\nmethod is a black-box unsupervised domain adaptation technique that integrates\nthe transfer function approach with an iterative schema. It does not utilize\nany information related to model internals of the victim machine but it solely\nrelies on the availability of input-output interface. Additionally, we assume\nthe availability of unlabelled data from the testing machine, i.e., the\nperpetrator machine. This scenario could become commonplace as companies begin\ndeploying their DL functionalities for clinical use. Competing companies might\nacquire the victim machine and, through the input-output interface, replicate\nthe functionality onto their own machines. In the experiments, we used a\nSonixOne and a Verasonics machine. The victim model was trained on SonixOne\ndata, and its functionality was then transferred to the Verasonics machine. The\nproposed method successfully transferred the functionality to the Verasonics\nmachine, achieving a remarkable 98\\% classification accuracy in a binary\ndecision task. This study underscores the need to establish security measures\nprior to deploying DL models in clinical settings.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}