{"id":"2407.12587","title":"On the dynamical Lie algebras of quantum approximate optimization\n  algorithms","authors":"Jonathan Allcock, Miklos Santha, Pei Yuan, Shengyu Zhang","authorsParsed":[["Allcock","Jonathan",""],["Santha","Miklos",""],["Yuan","Pei",""],["Zhang","Shengyu",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:12:30 GMT"}],"updateDate":"2024-07-18","timestamp":1721225550000,"abstract":"  Dynamical Lie algebras (DLAs) have emerged as a valuable tool in the study of\nparameterized quantum circuits, helping to characterize both their\nexpressiveness and trainability. In particular, the absence or presence of\nbarren plateaus (BPs) -- flat regions in parameter space that prevent the\nefficient training of variational quantum algorithms -- has recently been shown\nto be intimately related to quantities derived from the associated DLA.\n  In this work, we investigate DLAs for the quantum approximate optimization\nalgorithm (QAOA), one of the most studied variational quantum algorithms for\nsolving graph MaxCut and other combinatorial optimization problems. While DLAs\nfor QAOA circuits have been studied before, existing results have either been\nbased on numerical evidence, or else correspond to DLA generators specifically\nchosen to be universal for quantum computation on a subspace of states. We\ninitiate an analytical study of barren plateaus and other statistics of QAOA\nalgorithms, and give bounds on the dimensions of the corresponding DLAs and\ntheir centers for general graphs. We then focus on the $n$-vertex cycle and\ncomplete graphs. For the cycle graph we give an explicit basis, identify its\ndecomposition into the direct sum of a $2$-dimensional center and a semisimple\ncomponent isomorphic to $n-1$ copies of $su(2)$. We give an explicit basis for\nthis isomorphism, and a closed-form expression for the variance of the cost\nfunction, proving the absence of BPs. For the complete graph we prove that the\ndimension of the DLA is $O(n^3)$ and give an explicit basis for the DLA.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}