{"id":"2407.13271","title":"Identifying Smart Contract Security Issues in Code Snippets from Stack\n  Overflow","authors":"Jiachi Chen, Chong Chen, Jiang Hu, John Grundy, Yanlin Wang, Ting\n  Chen, Zibin Zheng","authorsParsed":[["Chen","Jiachi",""],["Chen","Chong",""],["Hu","Jiang",""],["Grundy","John",""],["Wang","Yanlin",""],["Chen","Ting",""],["Zheng","Zibin",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:25:16 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 09:47:31 GMT"}],"updateDate":"2024-07-24","timestamp":1721291116000,"abstract":"  Smart contract developers frequently seek solutions to developmental\nchallenges on Q&A platforms such as Stack Overflow (SO). Although community\nresponses often provide viable solutions, the embedded code snippets can also\ncontain hidden vulnerabilities. Integrating such code directly into smart\ncontracts may make them susceptible to malicious attacks. We conducted an\nonline survey and received 74 responses from smart contract developers. The\nresults of this survey indicate that the majority (86.4%) of participants do\nnot sufficiently consider security when reusing SO code snippets. Despite the\nexistence of various tools designed to detect vulnerabilities in smart\ncontracts, these tools are typically developed for analyzing fully-completed\nsmart contracts and thus are ineffective for analyzing typical code snippets as\nfound on SO. We introduce SOChecker, the first tool designed to identify\npotential vulnerabilities in incomplete SO smart contract code snippets.\nSOChecker first leverages a fine-tuned Llama2 model for code completion,\nfollowed by the application of symbolic execution methods for vulnerability\ndetection. Our experimental results, derived from a dataset comprising 897 code\nsnippets collected from smart contract-related SO posts, demonstrate that\nSOChecker achieves an F1 score of 68.2%, greatly surpassing GPT-3.5 and GPT-4\n(20.9% and 33.2% F1 Scores respectively). Our findings underscore the need to\nimprove the security of code snippets from Q&A websites.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}