{"id":"2407.12582","title":"Embracing Events and Frames with Hierarchical Feature Refinement Network\n  for Object Detection","authors":"Hu Cao, Zehua Zhang, Yan Xia, Xinyi Li, Jiahao Xia, Guang Chen, Alois\n  Knoll","authorsParsed":[["Cao","Hu",""],["Zhang","Zehua",""],["Xia","Yan",""],["Li","Xinyi",""],["Xia","Jiahao",""],["Chen","Guang",""],["Knoll","Alois",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:09:46 GMT"}],"updateDate":"2024-07-18","timestamp":1721225386000,"abstract":"  In frame-based vision, object detection faces substantial performance\ndegradation under challenging conditions due to the limited sensing capability\nof conventional cameras. Event cameras output sparse and asynchronous events,\nproviding a potential solution to solve these problems. However, effectively\nfusing two heterogeneous modalities remains an open issue. In this work, we\npropose a novel hierarchical feature refinement network for event-frame fusion.\nThe core concept is the design of the coarse-to-fine fusion module, denoted as\nthe cross-modality adaptive feature refinement (CAFR) module. In the initial\nphase, the bidirectional cross-modality interaction (BCI) part facilitates\ninformation bridging from two distinct sources. Subsequently, the features are\nfurther refined by aligning the channel-level mean and variance in the two-fold\nadaptive feature refinement (TAFR) part. We conducted extensive experiments on\ntwo benchmarks: the low-resolution PKU-DDD17-Car dataset and the\nhigh-resolution DSEC dataset. Experimental results show that our method\nsurpasses the state-of-the-art by an impressive margin of $\\textbf{8.0}\\%$ on\nthe DSEC dataset. Besides, our method exhibits significantly better robustness\n(\\textbf{69.5}\\% versus \\textbf{38.7}\\%) when introducing 15 different\ncorruption types to the frame images. The code can be found at the link\n(https://github.com/HuCaoFighting/FRN).\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"fVHOuW-YGkpbpaC3sKLlNhlXX6__OoZ3mIyC1nnhomY","pdfSize":"8277801","objectId":"0xaccc6e6f523665a28dae4fc245c2b8122f47bbae7c27f514119f9cc53c2bb0c6","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
