{"id":"2407.00283","title":"Gravitational waveforms from periodic orbits around a quantum-corrected\n  black hole","authors":"Sen Yang, Yu-Peng Zhang, Tao Zhu, Li Zhao, and Yu-Xiao Liu","authorsParsed":[["Yang","Sen",""],["Zhang","Yu-Peng",""],["Zhu","Tao",""],["Zhao","Li",""],["Liu","Yu-Xiao",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 02:25:32 GMT"}],"updateDate":"2024-07-02","timestamp":1719627932000,"abstract":"  Extreme mass-ratio inspirals are crucial sources for future space-based\ngravitational wave detections. Gravitational waveforms emitted by extreme\nmass-ratio inspirals are closely related to the orbital dynamics of small\ncelestial objects, which vary with the underlying spacetime geometry. Despite\nthe tremendous success of general relativity, there are unsolved issues such as\nsingularities in both black holes and cosmology. Loop quantum gravity, a theory\naddressing these singularity problems, offers a framework for regular black\nholes. In this paper, we focus on periodic orbits of a small celestial object\naround a supermassive quantum-corrected black hole in loop quantum gravity and\ncompute the corresponding gravitational waveforms. We view the small celestial\nobject as a massive test particle and obtain its four-velocity and effective\npotential. Our results indicate that the quantum parameter $\\hat{\\alpha}$\ninfluences the shape of the effective potential. We explore the effects of\nquantum corrections on marginally bound orbits, innermost stable circular\norbits, and other periodic orbits. Using the numerical kludge scheme, we\nfurther explore the gravitational waveforms of the small celestial object along\ndifferent periodic orbits. The waveforms exhibit distinct zoom and whirl phases\nin a complete orbital period, closely tied to the quantum parameter\n$\\hat{\\alpha}$. We also perform a spectral analysis of the gravitational waves\nfrom these periodic orbits and assess their detectability. With the steady\nprogress of space-based gravitational wave detection programs, our findings\nwill contribute to utilizing extreme mass-ratio inspirals to test and\nunderstand the properties of quantum-corrected black holes.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}