{"id":"2407.13201","title":"$\\mu$Drive: User-Controlled Autonomous Driving","authors":"Kun Wang, Christopher M. Poskitt, Yang Sun, Jun Sun, Jingyi Wang, Peng\n  Cheng, Jiming Chen","authorsParsed":[["Wang","Kun",""],["Poskitt","Christopher M.",""],["Sun","Yang",""],["Sun","Jun",""],["Wang","Jingyi",""],["Cheng","Peng",""],["Chen","Jiming",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 06:36:33 GMT"}],"updateDate":"2024-07-19","timestamp":1721284593000,"abstract":"  Autonomous Vehicles (AVs) rely on sophisticated Autonomous Driving Systems\n(ADSs) to provide passengers a satisfying and safe journey. The individual\npreferences of riders plays a crucial role in shaping the perception of safety\nand comfort while they are in the car. Existing ADSs, however, lack mechanisms\nto systematically capture and integrate rider preferences into their planning\nmodules. To bridge this gap, we propose $\\mu$Drive, an event-based\nDomain-Specific Language (DSL) designed for specifying autonomous vehicle\nbehaviour. $\\mu$Drive enables users to express their preferences through rules\ntriggered by contextual events, such as encountering obstacles or navigating\ncomplex traffic situations. These rules dynamically adjust the parameter\nsettings of the ADS planning module, facilitating seamless integration of rider\npreferences into the driving plan. In our evaluation, we demonstrate the\nfeasibility and efficacy of $\\mu$Drive by integrating it with the Apollo ADS\nframework. Our findings show that users can effectively influence Apollo's\nplanning through $\\mu$Drive, assisting ADS in achieving improved compliance\nwith traffic regulations. The response time for $\\mu$Drive commands remains\nconsistently at the second or millisecond level. This suggests that $\\mu$Drive\nmay help pave the way to more personalizsed and user-centric AV experiences.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}