{"id":"2407.06805","title":"Quantifying \"just-right\" APC inactivation for colorectal cancer\n  initiation","authors":"Meritxell Brunet Guasch, Nathalie Feeley, Ignacio Soriano, Steve\n  Thorn, Ian Tomlinson, Michael D. Nicholson, Tibor Antal","authorsParsed":[["Guasch","Meritxell Brunet",""],["Feeley","Nathalie",""],["Soriano","Ignacio",""],["Thorn","Steve",""],["Tomlinson","Ian",""],["Nicholson","Michael D.",""],["Antal","Tibor",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 12:24:01 GMT"}],"updateDate":"2024-07-10","timestamp":1720527841000,"abstract":"  Dysregulation of the tumour suppressor gene Adenomatous Polyposis Coli (APC)\nis a canonical step in colorectal cancer development. Curiously, most\ncolorectal tumours carry biallelic mutations that result in only partial loss\nof APC function, suggesting that a \"just-right\" level of APC inactivation, and\nhence Wnt signalling, provides the optimal conditions for tumorigenesis.\nMutational processes act variably across the APC gene, which could contribute\nto the bias against complete APC inactivation. Thus the selective consequences\nof partial APC loss are unclear. Here we propose a mathematical model to\nquantify the tumorigenic effect of biallelic APC genotypes, controlling for\nsomatic mutational processes. Analysing sequence data from >2500 colorectal\ncancers, we find that APC genotypes resulting in partial protein function\nconfer about 50 times higher probability of progressing to cancer compared to\ncomplete APC inactivation. The optimal inactivation level varies with\nanatomical location and additional mutations of Wnt pathway regulators. We use\nthis context dependency to assess the regulatory effect of secondary Wnt\ndrivers in combination with APC in vivo, and provide evidence that mutant AMER1\ncombines with APC genotypes that lead to relatively low Wnt. The fitness\nlandscape of APC inactivation is consistent across microsatellite unstable and\nPOLE-deficient colorectal cancers and tumours in patients with Familial\nAdenomatous Polyposis, suggesting a general \"just-right\" optimum, and pointing\nto Wnt hyperactivation as a potential cancer vulnerability.\n","subjects":["Quantitative Biology/Quantitative Methods","Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by/4.0/"}