{"id":"2407.17606","title":"A Flexible Data Acquisition System Architecture for the Nab Experiment","authors":"D. G. Mathews, H. Acharya, C. B. Crawford, M. H. Gervais, A. P.\n  Jezghani, M. McCrea, A. Nelsen, A. Atencio, N. Birge, L. J. Broussard, J. H.\n  Choi, F. M. Gonzalez, H. Li, N. Macsai, A. Mendelsohn, R. R. Mammei, G. V.\n  Riley, R. A. Whitehead","authorsParsed":[["Mathews","D. G.",""],["Acharya","H.",""],["Crawford","C. B.",""],["Gervais","M. H.",""],["Jezghani","A. P.",""],["McCrea","M.",""],["Nelsen","A.",""],["Atencio","A.",""],["Birge","N.",""],["Broussard","L. J.",""],["Choi","J. H.",""],["Gonzalez","F. M.",""],["Li","H.",""],["Macsai","N.",""],["Mendelsohn","A.",""],["Mammei","R. R.",""],["Riley","G. V.",""],["Whitehead","R. A.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 19:34:09 GMT"}],"updateDate":"2024-07-26","timestamp":1721849649000,"abstract":"  The Nab experiment will measure the electron-neutrino correlation and Fierz\ninterference term in free neutron beta decay to test the Standard Model and\nprobe Beyond the Standard Model Physics. Using National Instrument's PXIe-5171\nReconfigurable Oscilloscope module, we have developed a data acquisition system\nthat is not only capable of meeting Nab's specifications, but flexible enough\nto be adapted in situ as the experimental environment dictates. The L1 and L2\ntrigger logic can be reconfigured to optimize the system for coincidence event\ndetection at runtime through configuration files and LabVIEW controls. This\nsystem is capable of identifying L1 triggers at at least $1$ MHz, while reading\nout a peak signal rate of approximately $2$ GB/s. During commissioning, the\nsystem ran at a sustained readout rate of $400$ MB/s of signal data originating\nfrom roughly $6$ kHz L2 triggers, well within the peak performance of the\nsystem.\n","subjects":["Physics/Instrumentation and Detectors","Physics/Nuclear Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}