{"id":"2407.11311","title":"Harnessing an elastic flow instability to improve the kinetic\n  performance of chromatographic columns","authors":"Fabrice Gritti, Emily Y. Chen, Sujit S. Datta","authorsParsed":[["Gritti","Fabrice",""],["Chen","Emily Y.",""],["Datta","Sujit S.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 01:54:43 GMT"}],"updateDate":"2024-07-17","timestamp":1721094883000,"abstract":"  Despite decades of research and development, the optimal efficiency of\nslurry-packed HPLC columns is still hindered by inherent long-range flow\nheterogeneity from the wall to the central bulk region of these columns. Here,\nwe show an example of how this issue can be addressed through the\nstraightforward addition of a semidilute amount (500~ppm) of a large, flexible,\nsynthetic polymer (18~MDa partially hydrolyzed polyacrylamide, HPAM) to the\nmobile phase (1\\% NaCl aqueous solution) during operation of a 4.6 mm $\\times$\n300 mm column packed with 10~$\\mu$m BEH$^{\\mathrm{TM}}$ 125~\\AA \\ Particles.\nAddition of the polymer imparts elasticity to the mobile phase, causing the\nflow in the interparticle pore space to become unstable above a threshold flow\nrate. We verify the development of this elastic flow instability using pressure\ndrop measurements of the friction factor versus Reynolds number. In prior work,\nwe showed that this flow instability is characterized by large spatiotemporal\nfluctuations in the pore-scale flow velocities that may promote analyte\ndispersion across the column. Axial dispersion measurements of the quasi\nnon-retained tracer thiourea confirm this possibility: they unequivocally\nreveal that operating above the onset of the instability improves column\nefficiency by significantly reducing peak asymmetry. These experiments thereby\nprovide a proof-of-concept demonstration that elastic flow instabilities can be\nharnessed to mitigate the negative impact of trans-column flow heterogeneities\non the efficiency of slurry-packed HPLC columns. While this approach has its\nown inherent limitations and constraints, our work lays the groundwork for\nfuture targeted development of polymers that can impart elasticity when\ndissolved in commonly used liquid chromatography mobile phases, and can thereby\ngenerate elastic flow instabilities to help improve the resolution of HPLC\ncolumns.\n","subjects":["Physics/Fluid Dynamics","Condensed Matter/Soft Condensed Matter","Nonlinear Sciences/Chaotic Dynamics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QXSFVjgKvv5XXfKVeSu8puRj59dH1Jbtj1_JNuLRsPY","pdfSize":"884193"}
