{"id":"2407.10910","title":"DataDream: Few-shot Guided Dataset Generation","authors":"Jae Myung Kim, Jessica Bader, Stephan Alaniz, Cordelia Schmid, Zeynep\n  Akata","authorsParsed":[["Kim","Jae Myung",""],["Bader","Jessica",""],["Alaniz","Stephan",""],["Schmid","Cordelia",""],["Akata","Zeynep",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:10:31 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 13:15:01 GMT"}],"updateDate":"2024-07-17","timestamp":1721063431000,"abstract":"  While text-to-image diffusion models have been shown to achieve\nstate-of-the-art results in image synthesis, they have yet to prove their\neffectiveness in downstream applications. Previous work has proposed to\ngenerate data for image classifier training given limited real data access.\nHowever, these methods struggle to generate in-distribution images or depict\nfine-grained features, thereby hindering the generalization of classification\nmodels trained on synthetic datasets. We propose DataDream, a framework for\nsynthesizing classification datasets that more faithfully represents the real\ndata distribution when guided by few-shot examples of the target classes.\nDataDream fine-tunes LoRA weights for the image generation model on the few\nreal images before generating the training data using the adapted model. We\nthen fine-tune LoRA weights for CLIP using the synthetic data to improve\ndownstream image classification over previous approaches on a large variety of\ndatasets. We demonstrate the efficacy of DataDream through extensive\nexperiments, surpassing state-of-the-art classification accuracy with few-shot\ndata across 7 out of 10 datasets, while being competitive on the other 3.\nAdditionally, we provide insights into the impact of various factors, such as\nthe number of real-shot and generated images as well as the fine-tuning compute\non model performance. The code is available at\nhttps://github.com/ExplainableML/DataDream.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}