{"id":"2407.20780","title":"Enhancement of the vortex ratchet effect in superconductor open\n  nanotubes and nanopetals","authors":"Rodrigo H. de Bragan\\c{c}a, Igor Bogush, Oleksandr V. Dobrovolskiy,\n  Vladimir M. Fomin","authorsParsed":[["de Bragança","Rodrigo H.",""],["Bogush","Igor",""],["Dobrovolskiy","Oleksandr V.",""],["Fomin","Vladimir M.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 12:33:40 GMT"}],"updateDate":"2024-07-31","timestamp":1722342820000,"abstract":"  Advancements in the fabrication of superconducting 3D nanostructures, along\nwith the creation of artificial pinning sites, pave the way to novel\napplications and enhancement of nanosensors, bolometers, and quantum\ninterferometers. The dynamics of magnetic flux quanta (Abrikosov vortices) in\n3D nanoarchitectures reveal a rich palette of phenomena unseen in planar\ncounterparts. Here, we consider two types of superconductor 3D nanostructures\n-- open nanotubes and nanopetals -- carrying an azimuthal transport current in\na homogeneous external magnetic field. The complex 3D geometry of the\nstructures induces an inhomogeneity of the magnetic field and makes the\nvortices to move along preferred paths. By introducing a lattice of asymmetric\npinning sites along these paths, we realize a non-reciprocal flux transport and\nstudy a vortex ratchet effect, which is revealed to be stronger than in the\nrespective planar (unrolled) membranes. The enhancement of the vortex ratchet\neffect becomes apparent via a factor-of-two difference in the depinning current\nunder the current reversal, and it is attributed to the\ninhomogeneous-field-induced vortex channeling through the areas containing the\nasymmetric pinning sites. Our results demonstrate that the ratchet efficiency\ncan be enhanced via extending a superconducting film into the third dimension,\nwithout increase in the number of asymmetric pinning sites.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}