{"id":"2407.12576","title":"IICPilot: An Intelligent Integrated Circuit Backend Design Framework\n  Using Open EDA","authors":"Zesong Jiang, Qing Zhang, Cheng Liu, Long Cheng, Huawei Li, Xiaowei Li","authorsParsed":[["Jiang","Zesong",""],["Zhang","Qing",""],["Liu","Cheng",""],["Cheng","Long",""],["Li","Huawei",""],["Li","Xiaowei",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:02:01 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 03:15:10 GMT"}],"updateDate":"2024-08-29","timestamp":1721224921000,"abstract":"  Open-source EDA tools are rapidly advancing, fostering collaboration,\ninnovation, and knowledge sharing within the EDA community. However, the\ngrowing complexity of these tools, characterized by numerous design parameters\nand heuristics, poses a significant barrier to their widespread adoption. This\ncomplexity is particularly pronounced in integrated circuit (IC) backend\ndesigns, which place substantial demands on engineers' expertise in EDA tools.\nTo tackle this challenge, we introduce IICPilot, an intelligent IC backend\ndesign system based on LLM technology. IICPilot automates various backend\ndesign procedures, including script generation, EDA tool invocation, design\nspace exploration of EDA parameters, container-based computing resource\nallocation, and exception management. By automating these tasks, IICPilot\nsignificantly lowers the barrier to entry for open-source EDA tools.\nSpecifically, IICPilot utilizes LangChain's multi-agent framework to\nefficiently handle distinct design tasks, enabling flexible enhancements\nindependently. Moreover, IICPilot separates the backend design workflow from\nspecific open-source EDA tools through a unified EDA calling interface. This\napproach allows seamless integration with different open-source EDA tools like\nOpenROAD and iEDA, streamlining the backend design and optimization across the\nEDA tools.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"7m0NpZbRRDbytyatHR51GhsBzqhWjuk0yNpRgvq_D8Q","pdfSize":"998908","objectId":"0xce44c721f4bbb9786fc360b66a77521aeca0a6d24715354dd892ee8be93f97a6","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
