{"id":"2407.00739","title":"Central oxygen abundances in the spiral galaxies of the MaNGA survey:\n  Galaxies with central starbursts","authors":"L.S. Pilyugin, G. Tautvaisiene","authorsParsed":[["Pilyugin","L. S.",""],["Tautvaisiene","G.",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 16:03:20 GMT"}],"updateDate":"2024-07-02","timestamp":1719763400000,"abstract":"  We examine whether there are deviations of the local central oxygen\nabundances in spiral galaxies from the general metallicity gradients. We\ncompare the values of the central intersect oxygen abundances estimated from\nthe metallicity gradient based on the integral field unit (IFU) spectroscopy\nfrom the Mapping Nearby Galaxies at the Apache Point Observatory (MaNGA) survey\nand the local central oxygen abundances obtained from the single-fibre\nobservations from the Sloan Digital Sky Survey (SDSS). Special attention is\nplaced on galaxies with recent and currently ongoing central starbursts (cSB\ngalaxies). We selected a sample of 30 cSB galaxies from our total sample of 381\nMaNGA galaxies, using the decrease in the Dn4000 index (a stellar age\nindicator) in the circumnuclear region as the selection criterion. We found\nthat the local central oxygen abundances follow the general metallicity\ngradients in the galaxies well and agree with the central intersect abundances\nwithin uncertainties of the central abundances determinations. Starbursts in\nthe centres of cSB galaxies do not produce noticeable oxygen enrichments. The\ncentral starbursts imply that an appreciable amount of gas is present at the\ncentres of cSB galaxies. The gas at the centre of galaxy can serve not only as\na raw material for the star formation, but also as a fuel for the activity of\nthe galactic nucleus (AGN). We found that the AGN is the main source of the\nionising radiation at the centres of six cSB galaxies in our sample.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}