{"id":"2407.03409","title":"From Halos to Galaxies. IX. Estimate of Halo Assembly History for SDSS\n  Galaxy Groups","authors":"Cheqiu Lyu, Yingjie Peng, Yipeng Jing, Xiaohu Yang, Luis C. Ho, Alvio\n  Renzini, Dingyi Zhao, Filippo Mannucci, Houjun Mo, Kai Wang, Bitao Wang,\n  Bingxiao Xu, Jing Dou, Anna R. Gallazzi, Qiusheng Gu, Roberto Maiolino, Enci\n  Wang, Feng Yuan","authorsParsed":[["Lyu","Cheqiu",""],["Peng","Yingjie",""],["Jing","Yipeng",""],["Yang","Xiaohu",""],["Ho","Luis C.",""],["Renzini","Alvio",""],["Zhao","Dingyi",""],["Mannucci","Filippo",""],["Mo","Houjun",""],["Wang","Kai",""],["Wang","Bitao",""],["Xu","Bingxiao",""],["Dou","Jing",""],["Gallazzi","Anna R.",""],["Gu","Qiusheng",""],["Maiolino","Roberto",""],["Wang","Enci",""],["Yuan","Feng",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-08","timestamp":1720029603000,"abstract":"  The properties of the galaxies are tightly connected to their host halo mass\nand halo assembly history. Accurate measurement of the halo assembly history in\nobservation is challenging but crucial to the understanding of galaxy formation\nand evolution. The stellar-to-halo mass ratio ($M_*/M_{\\mathrm{h}}$) for the\ncentrals has often been used to indicate the halo assembly time\n$t_{\\mathrm{h,50}}$ of the group, where $t_{\\mathrm{h,50}}$ is the lookback\ntime at which a halo has assembled half of its present-day virial mass. Using\nmock data from the semi-analytic models, we find that $M_*/M_{\\mathrm{h}}$\nshows a significant scatter with $t_{\\mathrm{h,50}}$, with a strong systematic\ndifference between the group with a star-forming central (blue group) and\npassive central (red group). To improve the accuracy, we develop\nmachine-learning models to estimate $t_{\\mathrm{h,50}}$ for galaxy groups using\nonly observable quantities in the mocks. Since star-formation quenching will\ndecouple the co-growth of the dark matter and baryon, we train our models\nseparately for blue and red groups. Our models have successfully recovered\n$t_{\\mathrm{h,50}}$, within an accuracy of $\\sim$ 1.09 Gyr. With careful\ncalibrations of individual observable quantities in the mocks with SDSS\nobservations, we apply the trained models to the SDSS Yang et al. groups and\nderive the $t_{\\mathrm{h,50}}$ for each group for the first time. The derived\nSDSS $t_{\\mathrm{h,50}}$ distributions are in good agreement with that in the\nmocks, in particular for blue groups. The derived halo assembly history,\ntogether with the halo mass, make an important step forward in studying the\nhalo-galaxy connections in observation.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}