{"id":"2407.02464","title":"Reliable Confidence Intervals for Information Retrieval Evaluation Using\n  Generative A.I","authors":"Harrie Oosterhuis, Rolf Jagerman, Zhen Qin, Xuanhui Wang, Michael\n  Bendersky","authorsParsed":[["Oosterhuis","Harrie",""],["Jagerman","Rolf",""],["Qin","Zhen",""],["Wang","Xuanhui",""],["Bendersky","Michael",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 17:44:00 GMT"}],"updateDate":"2024-07-03","timestamp":1719942240000,"abstract":"  The traditional evaluation of information retrieval (IR) systems is generally\nvery costly as it requires manual relevance annotation from human experts.\nRecent advancements in generative artificial intelligence -- specifically large\nlanguage models (LLMs) -- can generate relevance annotations at an enormous\nscale with relatively small computational costs. Potentially, this could\nalleviate the costs traditionally associated with IR evaluation and make it\napplicable to numerous low-resource applications. However, generated relevance\nannotations are not immune to (systematic) errors, and as a result, directly\nusing them for evaluation produces unreliable results.\n  In this work, we propose two methods based on prediction-powered inference\nand conformal risk control that utilize computer-generated relevance\nannotations to place reliable confidence intervals (CIs) around IR evaluation\nmetrics. Our proposed methods require a small number of reliable annotations\nfrom which the methods can statistically analyze the errors in the generated\nannotations. Using this information, we can place CIs around evaluation metrics\nwith strong theoretical guarantees. Unlike existing approaches, our conformal\nrisk control method is specifically designed for ranking metrics and can vary\nits CIs per query and document. Our experimental results show that our CIs\naccurately capture both the variance and bias in evaluation based on LLM\nannotations, better than the typical empirical bootstrapping estimates. We hope\nour contributions bring reliable evaluation to the many IR applications where\nthis was traditionally infeasible.\n","subjects":["Computing Research Repository/Information Retrieval","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}