{"id":"2407.14680","title":"An Efficient Quantum Euclidean Similarity Algorithm for Worldwide\n  Localization","authors":"Ahmed Shokry and Moustafa Youssef","authorsParsed":[["Shokry","Ahmed",""],["Youssef","Moustafa",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 21:52:49 GMT"}],"updateDate":"2024-07-23","timestamp":1721425969000,"abstract":"  Fingerprinting techniques are widely used for localization because of their\naccuracy, especially in the presence of wireless channel noise. However, the\nfingerprinting techniques require significant storage and running time, which\nis a concern when implementing such systems on a global worldwide scale.\n  In this paper, we propose an efficient quantum Euclidean similarity algorithm\nfor wireless localization systems. The proposed quantum algorithm offers\nexponentially improved complexity compared to its classical counterpart and\neven the state-of-the-art quantum localization systems, in terms of both\nstorage space and running time. The basic idea is to entangle the test received\nsignal strength (RSS) vector with the fingerprint vectors at different\nlocations and perform the similarity calculation in parallel to all fingerprint\nlocations. We give the details of how to construct the quantum fingerprint, how\nto encode the RSS measurements in quantum particles, and finally; present the\nquantum algorithm for calculating the Euclidean similarity between the online\nRSS measurements and the fingerprint ones.\n  Implementation and evaluation of our algorithm in a real testbed using a real\nIBM quantum machine as well as a simulation for a larger testbed confirm its\nability to correctly obtain the estimated location with an exponential\nenhancement in both time and space compared to the traditional classical\nfingerprinting techniques and the state-of-the-art quantum localization\ntechniques.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WZamHpsQ_enpG7E48NyOVqNeaQmjz91PcRX6FHwWlag","pdfSize":"947018","objectId":"0x5dacdb87bd373cdd19fae4f32956ed64853bdc4686a518dc0f9ad20b1a7ae141","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
