{"id":"2407.11767","title":"ITI-IQA: a Toolbox for Heterogeneous Univariate and Multivariate Missing\n  Data Imputation Quality Assessment","authors":"Pedro Pons-Su\\~ner, Laura Arnal, J.Ram\\'on Navarro-Cerd\\'an,\n  Fran\\c{c}ois Signol","authorsParsed":[["Pons-Suñer","Pedro",""],["Arnal","Laura",""],["Navarro-Cerdán","J. Ramón",""],["Signol","François",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:26:46 GMT"}],"updateDate":"2024-07-17","timestamp":1721140006000,"abstract":"  Missing values are a major challenge in most data science projects working on\nreal data. To avoid losing valuable information, imputation methods are used to\nfill in missing values with estimates, allowing the preservation of samples or\nvariables that would otherwise be discarded. However, if the process is not\nwell controlled, imputation can generate spurious values that introduce\nuncertainty and bias into the learning process. The abundance of univariate and\nmultivariate imputation techniques, along with the complex trade-off between\ndata reliability and preservation, makes it difficult to determine the best\ncourse of action to tackle missing values. In this work, we present ITI-IQA\n(Imputation Quality Assessment), a set of utilities designed to assess the\nreliability of various imputation methods, select the best imputer for any\nfeature or group of features, and filter out features that do not meet quality\ncriteria. Statistical tests are conducted to evaluate the suitability of every\ntested imputer, ensuring that no new biases are introduced during the\nimputation phase. The result is a trainable pipeline of filters and imputation\nmethods that streamlines the process of dealing with missing data, supporting\ndifferent data types: continuous, discrete, binary, and categorical. The\ntoolbox also includes a suite of diagnosing methods and graphical tools to\ncheck measurements and results during and after handling missing data.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}