{"id":"2407.07175","title":"Adaptive Backstepping and Non-singular Sliding Mode Control for\n  Quadrotor UAVs with Unknown Time-varying Uncertainties","authors":"Arezo Shevidi and Hashim A. Hashim","authorsParsed":[["Shevidi","Arezo",""],["Hashim","Hashim A.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 18:41:22 GMT"},{"version":"v2","created":"Sat, 13 Jul 2024 12:38:22 GMT"}],"updateDate":"2024-07-16","timestamp":1720550482000,"abstract":"  This paper presents a novel quaternion-based nonsingular control system for\nunderactuated vertical-take-off and landing (VTOL) Unmanned Aerial Vehicles\n(UAVs). Position and attitude tracking is challenging regarding singularity and\naccuracy. Quaternion-based Adaptive Backstepping Control (QABC) is developed to\ntackle the underactuated issues of UAV control systems in a cascaded way.\nLeveraging the virtual control (auxiliary control) developed in the QABC,\ndesired attitude components and required thrust are produced. Afterwards, we\npropose Quaternion-based Sliding Mode Control (QASMC) to enhance the stability\nand mitigate chattering issues. The sliding surface is modified to avoid\nsingularity compared to conventional SMC. To improve the robustness of\ncontrollers, the control parameters are updated using adaptation laws.\nFurthermore, the asymptotic stability of translational and rotational dynamics\nis guaranteed by utilizing Lyapunov stability and Barbalet Lemma. Finally, the\ncomprehensive comparison results are provided to verify the effectiveness of\nthe proposed controllers in the presence of unknown time-varying parameter\nuncertainties and significant initial errors. Keywords: Non-singular Sliding\nMode Control, Adaptive Backstepping Control, Unit-quaternion, Drones, Unmanned\nAerial Vehicles, Asymptotic Stability, Position and Orientation Control\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Robotics","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}