{"id":"2407.03695","title":"M^3:Manipulation Mask Manufacturer for Arbitrary-Scale Super-Resolution\n  Mask","authors":"Xinyu Yang, Xiaochen Ma, Xuekang Zhu, Bo Du, Lei Su, Bingkui Tong,\n  Zeyu Lei, Jizhe Zhou","authorsParsed":[["Yang","Xinyu",""],["Ma","Xiaochen",""],["Zhu","Xuekang",""],["Du","Bo",""],["Su","Lei",""],["Tong","Bingkui",""],["Lei","Zeyu",""],["Zhou","Jizhe",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 07:30:41 GMT"}],"updateDate":"2024-07-08","timestamp":1720078241000,"abstract":"  In the field of image manipulation localization (IML), the small quantity and\npoor quality of existing datasets have always been major issues. A dataset\ncontaining various types of manipulations will greatly help improve the\naccuracy of IML models. Images on the internet (such as those on Baidu Tieba's\nPS Bar) are manipulated using various techniques, and creating a dataset from\nthese images will significantly enrich the types of manipulations in our data.\nHowever, images on the internet suffer from resolution and clarity issues, and\nthe masks obtained by simply subtracting the manipulated image from the\noriginal contain various noises. These noises are difficult to remove,\nrendering the masks unusable for IML models. Inspired by the field of change\ndetection, we treat the original and manipulated images as changes over time\nfor the same image and view the data generation task as a change detection\ntask. However, due to clarity issues between images, conventional change\ndetection models perform poorly. Therefore, we introduced a super-resolution\nmodule and proposed the Manipulation Mask Manufacturer (MMM) framework. It\nenhances the resolution of both the original and tampered images, thereby\nimproving image details for better comparison. Simultaneously, the framework\nconverts the original and tampered images into feature embeddings and\nconcatenates them, effectively modeling the context. Additionally, we created\nthe Manipulation Mask Manufacturer Dataset (MMMD), a dataset that covers a wide\nrange of manipulation techniques. We aim to contribute to the fields of image\nforensics and manipulation detection by providing more realistic manipulation\ndata through MMM and MMMD. Detailed information about MMMD and the download\nlink can be found at: the code and datasets will be made available.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}