{"id":"2407.12534","title":"RIS-Based Self-Interference Cancellation for Full-Duplex Broadband\n  Transmission","authors":"Jiayan Wu, Wenchi Cheng, Jianyu Wang, Jingqing Wang, and Wei Zhang","authorsParsed":[["Wu","Jiayan",""],["Cheng","Wenchi",""],["Wang","Jianyu",""],["Wang","Jingqing",""],["Zhang","Wei",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 13:15:57 GMT"}],"updateDate":"2024-07-18","timestamp":1721222157000,"abstract":"  Full-duplex (FD) is an attractive technology that can significantly boost the\nthroughput of wireless communications. However, it is limited by the severe\nself-interference (SI) from the transmitter to the local receiver. In this\npaper, we propose a new SI cancellation (SIC) scheme based on reconfigurable\nintelligent surface (RIS), where small RISs are deployed inside FD devices to\nenhance SIC capability and system capacity under frequencyselective fading\nchannels. The novel scheme can not only address the challenges associated with\nSIC but also improve the overall performance. We first analyze the near-field\nbehavior of the RIS and then formulate an optimization problem to maximize the\nSIC capability by controlling the reflection coefficients (RCs) of the RIS and\nallocating the transmit power of the device. The problem is solved with\nalternate optimization (AO) algorithm in three cases: ideal case, where both\nthe amplitude and phase of each RIS unit cell can be controlled independently\nand continuously, continuous phases, where the phase of each RIS unit cell can\nbe controlled independently, while the amplitude is fixed to one, and discrete\nphases, where the RC of each RIS unit cell can only take discrete values and\nthese discrete values are equally spaced on the unit circle. For the ideal\ncase, the closed-form solution to RC is derived with Karush-Kuhn-Tucker (KKT)\nconditions. Based on Riemannian conjugate gradient (RCG) algorithm, we optimize\nthe RC for the case of continuous phases and then extend the solution to the\ncase of discrete phases by the nearest point projection (NPP) method.\nSimulation results are given to validate the performance of our proposed SIC\nscheme.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}