{"id":"2407.02644","title":"Example-Based Automatic Migration of Continuous Integration Systems","authors":"Dhia Elhaq Rzig, Alaa Houerbi, Chungha Sung and Foyzul Hassan","authorsParsed":[["Rzig","Dhia Elhaq",""],["Houerbi","Alaa",""],["Sung","Chungha",""],["Hassan","Foyzul",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 20:19:21 GMT"}],"updateDate":"2024-07-04","timestamp":1719951561000,"abstract":"  Continuous Integration (CI) is a widely adopted practice for faster code\nchange integration and testing. Developers often migrate between CI systems in\npursuit of features like matrix building or better logging. However, this\nmigration is effort intensive and error-prone owing to limited knowledge of the\nnew CI system and its syntax. Moreover, these migrations require multiple\niterations and significant time to achieve stability in the new CI system, and\nthere is insufficient support for the automatic migration of CI configurations.\n  To mitigate this, we propose a novel approach for CI system's automatic\nmigration: CIMig. Our approach utilizes Example-Based mining, where it extracts\ntranslation rules and configuration patterns from existing migration examples,\nand employs them to reproduce this migration in new contexts. To empirically\nvalidate and evaluate our approach, we apply it to the migration between Travis\nCI and GitHub Actions. We gathered learnings from 1001 projects, and then\napplied them to migrate an evaluation set of 251 projects. This helped us\nperform a qualitative and quantitative evaluation of CIMig, and we\ncontextualize our results by comparing them with those of the manual-rule-based\nGitHub Actions Importer. Furthermore, our tool generated files that were rated\nfavorably by developers and saved them an average of 42.4 minutes over the\nmanual migration of these same projects. Our learning-based approach is also\nmore flexible, as proven by our ability to apply it to migrate GitHub Actions\nfiles to Travis, which GitHub Actions Importer can not do. We believe CIMig is\nthe first approach of its kin to migrate CI systems and can be applied to other\nsoftware configuration system migrations. Our replication package is available\nat [5].\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}