{"id":"2407.00837","title":"Towards Robust Speech Representation Learning for Thousands of Languages","authors":"William Chen, Wangyou Zhang, Yifan Peng, Xinjian Li, Jinchuan Tian,\n  Jiatong Shi, Xuankai Chang, Soumi Maiti, Karen Livescu, Shinji Watanabe","authorsParsed":[["Chen","William",""],["Zhang","Wangyou",""],["Peng","Yifan",""],["Li","Xinjian",""],["Tian","Jinchuan",""],["Shi","Jiatong",""],["Chang","Xuankai",""],["Maiti","Soumi",""],["Livescu","Karen",""],["Watanabe","Shinji",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 21:40:26 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 17:23:44 GMT"}],"updateDate":"2024-07-03","timestamp":1719783626000,"abstract":"  Self-supervised learning (SSL) has helped extend speech technologies to more\nlanguages by reducing the need for labeled data. However, models are still far\nfrom supporting the world's 7000+ languages. We propose XEUS, a Cross-lingual\nEncoder for Universal Speech, trained on over 1 million hours of data across\n4057 languages, extending the language coverage of SSL models 4-fold. We\ncombine 1 million hours of speech from existing publicly accessible corpora\nwith a newly created corpus of 7400+ hours from 4057 languages, which will be\npublicly released. To handle the diverse conditions of multilingual speech\ndata, we augment the typical SSL masked prediction approach with a novel\ndereverberation objective, increasing robustness. We evaluate XEUS on several\nbenchmarks, and show that it consistently outperforms or achieves comparable\nresults to state-of-the-art (SOTA) SSL models across a variety of tasks. XEUS\nsets a new SOTA on the ML-SUPERB benchmark: it outperforms MMS 1B and w2v-BERT\n2.0 v2 by 0.8% and 4.4% respectively, despite having less parameters or\npre-training data. Checkpoints, code, and data are found in\nhttps://www.wavlab.org/activities/2024/xeus/.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}