{"id":"2407.19237","title":"Nonlinear spectral analysis extracts harmonics from land-atmosphere\n  fluxes","authors":"Leonard Schulz, J\\\"urgen Vollmer, Miguel D. Mahecha, Karin Mora","authorsParsed":[["Schulz","Leonard",""],["Vollmer","Jürgen",""],["Mahecha","Miguel D.",""],["Mora","Karin",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 11:51:34 GMT"}],"updateDate":"2024-07-30","timestamp":1722081094000,"abstract":"  Understanding the dynamics of the land-atmosphere exchange of CO$_2$ is key\nto advance our predictive capacities of the coupled climate-carbon feedback\nsystem.\n  In essence, the net vegetation flux is the difference of the uptake of CO$_2$\nvia photosynthesis and the release of CO$_2$ via respiration, while the system\nis driven by periodic processes at different time-scales.\n  The complexity of the underlying dynamics poses challenges to classical\ndecomposition methods focused on maximizing data variance, such as singular\nspectrum analysis.\n  Here, we explore whether nonlinear data-driven methods can better separate\nperiodic patterns and their harmonics from noise and stochastic variability.\n  We find that Nonlinear Laplacian Spectral Analysis (NLSA) outperforms the\nlinear method and detects multiple relevant harmonics. However, these harmonics\nare not detected in the presence of substantial measurement irregularities.\n  In summary, the NLSA approach can be used to both extract the seasonal cycle\nmore accurately than linear methods, but likewise detect irregular signals\nresulting from irregular land-atmosphere interactions or measurement failures.\nImproving the detection capabilities of time-series decomposition is essential\nfor improving land-atmosphere interactions models that should operate\naccurately on any time scale.\n","subjects":["Mathematics/Dynamical Systems","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NrJFPAjvykfQZYNwrYgmkDNjqA-5eOGph-ytJENcC0s","pdfSize":"9691728","objectId":"0x9c5bbd37c50446d751e7c40b0022b4524184dd38b78d05ea1ea41bd570356f0a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
