{"id":"2407.00870","title":"Roleplay-doh: Enabling Domain-Experts to Create LLM-simulated Patients\n  via Eliciting and Adhering to Principles","authors":"Ryan Louie, Ananjan Nandi, William Fang, Cheng Chang, Emma Brunskill,\n  Diyi Yang","authorsParsed":[["Louie","Ryan",""],["Nandi","Ananjan",""],["Fang","William",""],["Chang","Cheng",""],["Brunskill","Emma",""],["Yang","Diyi",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 00:43:02 GMT"},{"version":"v2","created":"Sun, 14 Jul 2024 22:35:34 GMT"}],"updateDate":"2024-07-16","timestamp":1719794582000,"abstract":"  Recent works leverage LLMs to roleplay realistic social scenarios, aiding\nnovices in practicing their social skills. However, simulating sensitive\ninteractions, such as in mental health, is challenging. Privacy concerns\nrestrict data access, and collecting expert feedback, although vital, is\nlaborious. To address this, we develop Roleplay-doh, a novel human-LLM\ncollaboration pipeline that elicits qualitative feedback from a domain-expert,\nwhich is transformed into a set of principles, or natural language rules, that\ngovern an LLM-prompted roleplay. We apply this pipeline to enable senior mental\nhealth supporters to create customized AI patients for simulated practice\npartners for novice counselors. After uncovering issues in GPT-4 simulations\nnot adhering to expert-defined principles, we also introduce a novel\nprinciple-adherence prompting pipeline which shows 30% improvements in response\nquality and principle following for the downstream task. Via a user study with\n25 counseling experts, we demonstrate that the pipeline makes it easy and\neffective to create AI patients that more faithfully resemble real patients, as\njudged by creators and third-party counselors. See our project website at\nhttps://roleplay-doh.github.io/ for code and data.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}