{"id":"2407.04515","title":"A Novel Portable and Wearable Broadband Near-Infrared Spectroscopy\n  Device for In-Vivo Oxygenation and Metabolism Measurements","authors":"Musa Talati, Frederic Lange, Dimitrios Airantzis, Danial Chitnis,\n  Temisan Illukwe, Darshana Gopal, Paola Pinti, Niccole Ranaei-Zamani, Olayinka\n  Kowobari, Sara Hillman, Dimitrios Siassakos, Anna David, Subhabrata Mitra and\n  Ilias Tachtsidis","authorsParsed":[["Talati","Musa",""],["Lange","Frederic",""],["Airantzis","Dimitrios",""],["Chitnis","Danial",""],["Illukwe","Temisan",""],["Gopal","Darshana",""],["Pinti","Paola",""],["Ranaei-Zamani","Niccole",""],["Kowobari","Olayinka",""],["Hillman","Sara",""],["Siassakos","Dimitrios",""],["David","Anna",""],["Mitra","Subhabrata",""],["Tachtsidis","Ilias",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 13:56:44 GMT"}],"updateDate":"2024-07-08","timestamp":1720187804000,"abstract":"  Broadband NIRS (bNIRS) is an extension of fNIRS that provides the same\nassessment of oxygenation biomarkers along with a valuable marker for oxygen\nmetabolism at a cellular level, the oxidation state of cytochrome-c-oxidase\n(oxCCO). bNIRS implements many (100s) NIR wavelengths in the full NIR spectrum\nto address this and provide insight to tissue energetics. To supply these many\nwavelengths of light, broadband sources are required, and spectrometers are\nemployed to distinguish power per wavelength. Current multi-channel bNIRS\ninstruments are bulky and only semi-portable due to technological limitations.\nWe propose a design for a bNIRS device that has been miniaturized to allow for\nportable use. This design leverages the innovations in photonic devices that\nhave created a new line of microspectrometers and broadband NIR high-power\nLEDs; the Hamamatsu SMD-type spectrometer C14384MA and the Ushio SMBBIR45-1100\nLED. This first-of-itskind device, referred to as microCYRIL (after its two\npredecessors CYRIL and miniCYRIL), has been developed for oxygenation and\nmetabolism measurements with dual channel operation. To verify functionality,\nconcentration changes in oxygenated (HbO2) and deoxygenated (HHb) haemoglobin\nand oxCCO were successfully tracked during a cuff-induced venous and arterial\nocclusion.\n","subjects":["Physics/Medical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}