{"id":"2407.10297","title":"CoSTAP: Clutter Suppression in Co-Pulsing FDA-STAP","authors":"Wanghan Lv and Kumar Vijay Mishra","authorsParsed":[["Lv","Wanghan",""],["Mishra","Kumar Vijay",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 19:21:33 GMT"}],"updateDate":"2024-07-16","timestamp":1720984893000,"abstract":"  Range-dependent clutter suppression poses significant challenges in airborne\nfrequency diverse array (FDA) radar, where resolving range ambiguity is\nparticularly difficult. Traditional space-time adaptive processing (STAP)\ntechniques used for clutter mitigation in FDA radars operate in the physical\ndomain defined by first-order statistics. In this paper, unlike conventional\nairborne uniform FDA, we introduce a space-time-range adaptive processing\n(STRAP) method to exploit second-order statistics for clutter suppression in\nthe newly proposed co-pulsing FDA radar. This approach utilizes co-prime\nfrequency offsets (FOs) across the elements of a co-prime array, with each\nelement transmitting at a non-uniform co-prime pulse repetition interval\n(C-Cube). By incorporating second-order statistics from the co-array domain,\nthe co-pulsing STRAP or CoSTAP benefits from increased degrees of freedom\n(DoFs) and low computational cost while maintaining strong clutter suppression\ncapabilities. However, this approach also introduces significant computational\nburdens in the coarray domain. To address this, we propose an approximate\nmethod for three-dimensional (3-D) clutter subspace estimation using discrete\nprolate spheroidal sequences (DPSS) to balance clutter suppression performance\nand computational cost. We first develop a 3-D clutter rank evaluation\ncriterion to exploit the geometry of 3-D clutter in a general scenario.\nFollowing this, we present a clutter subspace rejection method to mitigate the\neffects of interference such as jammer. Compared to existing FDA-STAP\nalgorithms, our proposed CoSTAP method offers superior clutter suppression\nperformance, lower computational complexity, and enhanced robustness to\ninterference. Numerical experiments validate the effectiveness and advantages\nof our method.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}