{"id":"2407.06358","title":"MiraData: A Large-Scale Video Dataset with Long Durations and Structured\n  Captions","authors":"Xuan Ju, Yiming Gao, Zhaoyang Zhang, Ziyang Yuan, Xintao Wang, Ailing\n  Zeng, Yu Xiong, Qiang Xu, Ying Shan","authorsParsed":[["Ju","Xuan",""],["Gao","Yiming",""],["Zhang","Zhaoyang",""],["Yuan","Ziyang",""],["Wang","Xintao",""],["Zeng","Ailing",""],["Xiong","Yu",""],["Xu","Qiang",""],["Shan","Ying",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 19:58:59 GMT"}],"updateDate":"2024-07-10","timestamp":1720468739000,"abstract":"  Sora's high-motion intensity and long consistent videos have significantly\nimpacted the field of video generation, attracting unprecedented attention.\nHowever, existing publicly available datasets are inadequate for generating\nSora-like videos, as they mainly contain short videos with low motion intensity\nand brief captions. To address these issues, we propose MiraData, a\nhigh-quality video dataset that surpasses previous ones in video duration,\ncaption detail, motion strength, and visual quality. We curate MiraData from\ndiverse, manually selected sources and meticulously process the data to obtain\nsemantically consistent clips. GPT-4V is employed to annotate structured\ncaptions, providing detailed descriptions from four different perspectives\nalong with a summarized dense caption. To better assess temporal consistency\nand motion intensity in video generation, we introduce MiraBench, which\nenhances existing benchmarks by adding 3D consistency and tracking-based motion\nstrength metrics. MiraBench includes 150 evaluation prompts and 17 metrics\ncovering temporal consistency, motion strength, 3D consistency, visual quality,\ntext-video alignment, and distribution similarity. To demonstrate the utility\nand effectiveness of MiraData, we conduct experiments using our DiT-based video\ngeneration model, MiraDiT. The experimental results on MiraBench demonstrate\nthe superiority of MiraData, especially in motion strength.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}