{"id":"2407.09003","title":"Enhancing Few-Shot Stock Trend Prediction with Large Language Models","authors":"Yiqi Deng, Xingwei He, Jiahao Hu, Siu-Ming Yiu","authorsParsed":[["Deng","Yiqi",""],["He","Xingwei",""],["Hu","Jiahao",""],["Yiu","Siu-Ming",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 05:43:11 GMT"}],"updateDate":"2024-07-15","timestamp":1720762991000,"abstract":"  The goal of stock trend prediction is to forecast future market movements for\ninformed investment decisions. Existing methods mostly focus on predicting\nstock trends with supervised models trained on extensive annotated data.\nHowever, human annotation can be resource-intensive and the annotated data are\nnot readily available. Inspired by the impressive few-shot capability of Large\nLanguage Models (LLMs), we propose using LLMs in a few-shot setting to overcome\nthe scarcity of labeled data and make prediction more feasible to investors.\nPrevious works typically merge multiple financial news for predicting stock\ntrends, causing two significant problems when using LLMs: (1) Merged news\ncontains noise, and (2) it may exceed LLMs' input limits, leading to\nperformance degradation. To overcome these issues, we propose a two-step method\n'denoising-then-voting'. Specifically, we introduce an `Irrelevant' category,\nand predict stock trends for individual news instead of merged news. Then we\naggregate these predictions using majority voting. The proposed method offers\ntwo advantages: (1) Classifying noisy news as irrelevant removes its impact on\nthe final prediction. (2) Predicting for individual news mitigates LLMs' input\nlength limits. Our method achieves 66.59% accuracy in S&P 500, 62.17% in\nCSI-100, and 61.17% in HK stock prediction, outperforming the standard few-shot\ncounterparts by around 7%, 4%, and 4%. Furthermore, our proposed method\nperforms on par with state-of-the-art supervised methods.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"7OeLtM0Y4eVOWNd4ofcFwlWmF-TWTIa64Lm9si0bz5M","pdfSize":"2425225"}
