{"id":"2407.17521","title":"CORT: Class-Oriented Real-time Tracking for Embedded Systems","authors":"Edoardo Cittadini, Alessandro De Siena, and Giorgio Buttazzo","authorsParsed":[["Cittadini","Edoardo",""],["De Siena","Alessandro",""],["Buttazzo","Giorgio",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 09:12:17 GMT"}],"updateDate":"2024-07-26","timestamp":1721466737000,"abstract":"  The ever-increasing use of artificial intelligence in autonomous systems has\nsignificantly contributed to advance the research on multi-object tracking,\nadopted in several real-time applications (e.g., autonomous driving,\nsurveillance drones, robotics) to localize and follow the trajectory of\nmultiple objects moving in front of a camera. Current tracking algorithms can\nbe divided into two main categories: some approaches introduce complex\nheuristics and re-identification models to improve the tracking accuracy and\nreduce the number of identification switches, without particular attention to\nthe timing performance, whereas other approaches are aimed at reducing response\ntimes by removing the re-identification phase, thus penalizing the tracking\naccuracy. This work proposes a new approach to multi-class object tracking that\nallows achieving smaller and more predictable execution times, without\npenalizing the tracking performance. The idea is to reduce the problem of\nmatching predictions with detections into smaller sub-problems by splitting the\nHungarian matrix by class and invoking the second re-identification stage only\nwhen strictly necessary for a smaller number of elements. The proposed solution\nwas evaluated in complex urban scenarios with several objects of different\ntypes (as cars, trucks, bikes, and pedestrians), showing the effectiveness of\nthe multi-class approach with respect to state of the art trackers.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}