{"id":"2407.01419","title":"Neurovascular Segmentation in sOCT with Deep Learning and Synthetic\n  Training Data","authors":"Etienne Chollet, Ya\\\"el Balbastre, Chiara Mauri, Caroline Magnain,\n  Bruce Fischl, Hui Wang","authorsParsed":[["Chollet","Etienne",""],["Balbastre","Yaël",""],["Mauri","Chiara",""],["Magnain","Caroline",""],["Fischl","Bruce",""],["Wang","Hui",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 16:09:07 GMT"}],"updateDate":"2024-07-02","timestamp":1719850147000,"abstract":"  Microvascular anatomy is known to be involved in various neurological\ndisorders. However, understanding these disorders is hindered by the lack of\nimaging modalities capable of capturing the comprehensive three-dimensional\nvascular network structure at microscopic resolution. With a lateral resolution\nof $<=$20 {\\textmu}m and ability to reconstruct large tissue blocks up to tens\nof cubic centimeters, serial-section optical coherence tomography (sOCT) is\nwell suited for this task. This method uses intrinsic optical properties to\nvisualize the vessels and therefore does not possess a specific contrast, which\ncomplicates the extraction of accurate vascular models. The performance of\ntraditional vessel segmentation methods is heavily degraded in the presence of\nsubstantial noise and imaging artifacts and is sensitive to domain shifts,\nwhile convolutional neural networks (CNNs) require extensive labeled data and\nare also sensitive the precise intensity characteristics of the data that they\nare trained on. Building on the emerging field of synthesis-based training,\nthis study demonstrates a synthesis engine for neurovascular segmentation in\nsOCT images. Characterized by minimal priors and high variance sampling, our\nhighly generalizable method tested on five distinct sOCT acquisitions\neliminates the need for manual annotations while attaining human-level\nprecision. Our approach comprises two phases: label synthesis and\nlabel-to-image transformation. We demonstrate the efficacy of the former by\ncomparing it to several more realistic sets of training labels, and the latter\nby an ablation study of synthetic noise and artifact models.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-H6z-A3lUhv0jnSGttgn4sRTB97e4KEvXFtf2Q1Vz3A","pdfSize":"29742477"}
