{"id":"2407.08022","title":"Deep Reinforcement Learning for Sequential Combinatorial Auctions","authors":"Sai Srivatsa Ravindranath, Zhe Feng, Di Wang, Manzil Zaheer, Aranyak\n  Mehta, David C. Parkes","authorsParsed":[["Ravindranath","Sai Srivatsa",""],["Feng","Zhe",""],["Wang","Di",""],["Zaheer","Manzil",""],["Mehta","Aranyak",""],["Parkes","David C.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 20:00:22 GMT"}],"updateDate":"2024-07-12","timestamp":1720641622000,"abstract":"  Revenue-optimal auction design is a challenging problem with significant\ntheoretical and practical implications. Sequential auction mechanisms, known\nfor their simplicity and strong strategyproofness guarantees, are often limited\nby theoretical results that are largely existential, except for certain\nrestrictive settings. Although traditional reinforcement learning methods such\nas Proximal Policy Optimization (PPO) and Soft Actor-Critic (SAC) are\napplicable in this domain, they struggle with computational demands and\nconvergence issues when dealing with large and continuous action spaces. In\nlight of this and recognizing that we can model transitions differentiable for\nour settings, we propose using a new reinforcement learning framework tailored\nfor sequential combinatorial auctions that leverages first-order gradients. Our\nextensive evaluations show that our approach achieves significant improvement\nin revenue over both analytical baselines and standard reinforcement learning\nalgorithms. Furthermore, we scale our approach to scenarios involving up to 50\nagents and 50 items, demonstrating its applicability in complex, real-world\nauction settings. As such, this work advances the computational tools available\nfor auction design and contributes to bridging the gap between theoretical\nresults and practical implementations in sequential auction design.\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}