{"id":"2407.01311","title":"Elastic scattering at $\\sqrt{s} = 6$ GeV up to $ \\sqrt{s} = 13$ TeV\n  (proton-proton; proton-antiproton; proton-neutron)","authors":"O.V. Selyugin","authorsParsed":[["Selyugin","O. V.",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 00:40:13 GMT"}],"updateDate":"2024-07-02","timestamp":1719362413000,"abstract":"  In the framework of the Regge-eikonal model of hadron interaction, based on\nthe analyticity of the scattering amplitude with taking into account the hadron\nstructure, the simultaneous analysis is carried out of the 90 sets of data.\nThese sets include the data obtained at low energies ($\\sqrt{s} > 3.6 $ GeV and\nat high energies at FNAL, ISR, $S\\bar{p}pS$, TEVATRON and LHC with 4326\nexperimental points, including the polarization data of analysing power. The\nenergy and momentum transfer dependence of separate sets of data is analyzed on\nthe basis of the eikonalized Born amplitude with taking into account two\nadditional anomalous terms. Different origins of the nonlinear behavior of the\nslope of the scattering amplitude are compared. No contribution of hard-Pomeron\nin the elastic hadron scattering is shown. However, the importance of Odderon's\ncontribution is presented. The form and energy dependence of different terms of\nthe cross-even and cross-odd parts of the elastic nucleon-nucleon scattering\namplitude is determined in the framework of the High Energy Generalize\nStructure (HEGS) model. In the framework of the HEGS model, using the\nelectromagnetic and gravitomagnetic form factors, the differential cross\nsections in the Coulomb Nuclear Interference (CNI) region and at large momentum\ntransfer are described well in a wide energy region simultaneously. It is shown\nthat the cross-even part includes the soft pomeron growing like $\\ln^{2}(s)$\nand an additional term with a large slope and with and with energy dependence\n$\\ln^2(s)$. The cross-odd part includes the maximal odderon term and an\nadditional oscillation term with $\\ln(s)$. It is shown that both additional\nterms are proportional to charge distributions but the maximal odderon term is\nproportional to matter distributions.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"qmm0jo3aMVGX8ZOu1PWM2_6H_V8SCju9NKNJJipUd-0","pdfSize":"1113865","objectId":"0x4e7689c772a129fe9ef877671afa118e66d377c3d5686ea0ac4f9f6099a5bddd","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
