{"id":"2407.17075","title":"SAFETY-J: Evaluating Safety with Critique","authors":"Yixiu Liu and Yuxiang Zheng and Shijie Xia and Jiajun Li and Yi Tu and\n  Chaoling Song and Pengfei Liu","authorsParsed":[["Liu","Yixiu",""],["Zheng","Yuxiang",""],["Xia","Shijie",""],["Li","Jiajun",""],["Tu","Yi",""],["Song","Chaoling",""],["Liu","Pengfei",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 08:04:00 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 07:50:46 GMT"},{"version":"v3","created":"Tue, 13 Aug 2024 10:59:17 GMT"}],"updateDate":"2024-08-14","timestamp":1721808240000,"abstract":"  The deployment of Large Language Models (LLMs) in content generation raises\nsignificant safety concerns, particularly regarding the transparency and\ninterpretability of content evaluations. Current methods, primarily focused on\nbinary safety classifications, lack mechanisms for detailed critique, limiting\ntheir utility for model improvement and user trust. To address these\nlimitations, we introduce SAFETY-J, a bilingual generative safety evaluator for\nEnglish and Chinese with critique-based judgment. SAFETY-J utilizes a robust\ntraining dataset that includes diverse dialogues and augmented query-response\npairs to assess safety across various scenarios comprehensively. We establish\nan automated meta-evaluation benchmark that objectively assesses the quality of\ncritiques with minimal human intervention, facilitating scalable and continuous\nimprovement. Additionally, SAFETY-J employs an iterative preference learning\ntechnique to dynamically refine safety assessments based on meta-evaluations\nand critiques. Our evaluations demonstrate that SAFETY-J provides more nuanced\nand accurate safety evaluations, thereby enhancing both critique quality and\npredictive reliability in complex content scenarios. To facilitate further\nresearch and application, we open-source SAFETY-J's training protocols,\ndatasets, and code at https://github.com/GAIR-NLP/Safety-J.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}