{"id":"2407.13896","title":"Data-Algorithm-Architecture Co-Optimization for Fair Neural Networks on\n  Skin Lesion Dataset","authors":"Yi Sheng, Junhuan Yang, Jinyang Li, James Alaina, Xiaowei Xu, Yiyu\n  Shi, Jingtong Hu, Weiwen Jiang, Lei Yang","authorsParsed":[["Sheng","Yi",""],["Yang","Junhuan",""],["Li","Jinyang",""],["Alaina","James",""],["Xu","Xiaowei",""],["Shi","Yiyu",""],["Hu","Jingtong",""],["Jiang","Weiwen",""],["Yang","Lei",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 20:49:57 GMT"}],"updateDate":"2024-07-22","timestamp":1721335797000,"abstract":"  As Artificial Intelligence (AI) increasingly integrates into our daily lives,\nfairness has emerged as a critical concern, particularly in medical AI, where\ndatasets often reflect inherent biases due to social factors like the\nunderrepresentation of marginalized communities and socioeconomic barriers to\ndata collection. Traditional approaches to mitigating these biases have focused\non data augmentation and the development of fairness-aware training algorithms.\nHowever, this paper argues that the architecture of neural networks, a core\ncomponent of Machine Learning (ML), plays a crucial role in ensuring fairness.\nWe demonstrate that addressing fairness effectively requires a holistic\napproach that simultaneously considers data, algorithms, and architecture.\nUtilizing Automated ML (AutoML) technology, specifically Neural Architecture\nSearch (NAS), we introduce a novel framework, BiaslessNAS, designed to achieve\nfair outcomes in analyzing skin lesion datasets. BiaslessNAS incorporates\nfairness considerations at every stage of the NAS process, leading to the\nidentification of neural networks that are not only more accurate but also\nsignificantly fairer. Our experiments show that BiaslessNAS achieves a 2.55%\nincrease in accuracy and a 65.50% improvement in fairness compared to\ntraditional NAS methods, underscoring the importance of integrating fairness\ninto neural network architecture for better outcomes in medical AI\napplications.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Pgwk8U77hhXtjR5hOQ--Y8TwkQC41Rghjgpl24iTO7Y","pdfSize":"742742","objectId":"0x43260e5a6bad91f2e9f17977fb975d582fb5dbda8a078b2efdf225fd067f2658","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
