{"id":"2407.09405","title":"Inflationary Initial Conditions for the Cosmological Gravitational Wave\n  Background","authors":"Lorenzo Valbusa Dall'Armi, Alina Mierna, Sabino Matarrese and Angelo\n  Ricciardone","authorsParsed":[["Dall'Armi","Lorenzo Valbusa",""],["Mierna","Alina",""],["Matarrese","Sabino",""],["Ricciardone","Angelo",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 16:31:25 GMT"}],"updateDate":"2024-07-15","timestamp":1720801885000,"abstract":"  The initial conditions on the anisotropies of the stochastic\ngravitational-wave background of cosmological origin (CGWB) largely depend on\nthe mechanism that generates the gravitational waves. Since the CGWB is\nexpected to be non-thermal, the computation of the initial conditions could be\nmore challenging w.r.t. the Cosmic Microwave Background (CMB), whose\ninteractions with other particles in the early Universe lead to a blackbody\nspectrum. In this paper, we show that the initial conditions for the\ncosmological background generated by quantum fluctuations of the metric during\ninflation deviate from adiabaticity. These primordial gravitational waves are\nindeed generated by quantum fluctuations of two independent degrees of freedom\n(the two polarization states of the gravitons). Furthermore, the CGWB plays a\nnegligible role in the Einstein's equations, because its energy density is\nsubdominant w.r.t. ordinary matter. Therefore, the only possible way to compute\nthe initial conditions for inflationary gravitons is to perturb the\nenergy-momentum tensor of the gravitational field defined in terms of the\nsmall-scale tensor perturbation of the metric. This new and self-consistent\napproach shows that a large, non-adiabatic initial condition is present even\nduring the single-field inflation. Such a contribution enhances the total\nangular power spectrum of the CGWB compared to the standard adiabatic case,\nincreasing also the sensitivity of the anisotropies to the presence of\nrelativistic and decoupled particles in the early Universe. In this work we\nhave also proved that our findings are quite general and apply to both\nsingle-field inflation and other scenarios in which the CGWB is generated by\nthe quantum fluctuations of the metric, like the curvaton.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}