{"id":"2407.13008","title":"More data than you want, less data than you need: machine learning\n  approaches to starlight subtraction with MagAO-X","authors":"Joseph D. Long, Jared R. Males, Laird M. Close, Olivier Guyon,\n  Sebastiaan Y. Haffert, Alycia J. Weinberger, Jay Kueny, Kyle Van Gorkom, Eden\n  McEwen, Logan Pearce, Maggie Kautz, Jialin Li, Jennifer Lumbres, Alexander\n  Hedglen, Lauren Schatz, Avalon McLeod, Isabella Doty, Warren B. Foster,\n  Roswell Roberts, Katie Twitchell","authorsParsed":[["Long","Joseph D.",""],["Males","Jared R.",""],["Close","Laird M.",""],["Guyon","Olivier",""],["Haffert","Sebastiaan Y.",""],["Weinberger","Alycia J.",""],["Kueny","Jay",""],["Van Gorkom","Kyle",""],["McEwen","Eden",""],["Pearce","Logan",""],["Kautz","Maggie",""],["Li","Jialin",""],["Lumbres","Jennifer",""],["Hedglen","Alexander",""],["Schatz","Lauren",""],["McLeod","Avalon",""],["Doty","Isabella",""],["Foster","Warren B.",""],["Roberts","Roswell",""],["Twitchell","Katie",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 20:58:04 GMT"}],"updateDate":"2024-07-19","timestamp":1721249884000,"abstract":"  High-contrast imaging data analysis depends on removing residual starlight\nfrom the host star to reveal planets and disks. Most observers do this with\nprincipal components analysis (i.e. KLIP) using modes computed from the science\nimages themselves. These modes may not be orthogonal to planet and disk\nsignals, leading to over-subtraction. The wavefront sensor data recorded during\nthe observation provide an independent signal with which to predict the\ninstrument point-spread function (PSF). MagAO-X is an extreme adaptive optics\n(ExAO) system for the 6.5-meter Magellan Clay telescope and a technology\npathfinder for ExAO with GMagAO-X on the upcoming Giant Magellan Telescope.\nMagAO-X is designed to save all sensor information, including kHz-speed\nwavefront measurements. Our software and compressed data formats were designed\nto record the millions of training samples required for machine learning with\nhigh throughput. The large volume of image and sensor data lets us learn a PSF\nmodel incorporating all the information available. This will eventually allow\nus to probe smaller star-planet separations at greater sensitivities, which\nwill be needed for rocky planet imaging.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}