{"id":"2407.03713","title":"Compositions of the Hercules-Aquila Cloud and Virgo Over-density","authors":"Dashuang Ye, Cuihua Du, Mingji Deng, Jiwei Liao, Yang Huang, Jianrong\n  Shi, Jun Ma","authorsParsed":[["Ye","Dashuang",""],["Du","Cuihua",""],["Deng","Mingji",""],["Liao","Jiwei",""],["Huang","Yang",""],["Shi","Jianrong",""],["Ma","Jun",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 08:01:43 GMT"}],"updateDate":"2024-07-08","timestamp":1720080103000,"abstract":"  Based on a sample of K giant from Large sky Area Multi-Object fiber\nSpectroscopic Telescope (LAMOST) Data Release 8 and a sample of RR Lyrae (RRL)\nfrom \\textit{Gaia} Data Release 3, we investigate the compositions of the\nHercules-Aquila Cloud (HAC) and Virgo Over-density (VOD) and their collective\ncontribution to the tilt and triaxiality of the stellar halo\n($r\\,\\textless\\,40\\,{\\rm kpc}$) as well as two breaks at $\\approx15\\,{\\rm kpc}$\nand 30\\,kpc. We apply the Gaussian mixture model (GMM) to divide the stellar\nhalo into the isotropic component and the radially biased anisotropic\ncomponent, namely Gaia-Sausage-Enceladus (GSE), and find that both HAC and VOD\nare dominated by the GSE debris stars with weights of $0.67^{+0.09}_{-0.07}$\nand $0.57^{+0.07}_{-0.06}$, respectively. In addition, using the K giants with\norbital parameters, we identify the member stars of known substructures,\nincluding GSE, Sagittarius (Sgr), Helmi Streams, Sequoia, Thamnos, Pontus,\nWukong, and Metal-weak Thick Disk (MWTD), to probe the compositions of\nlow-eccentricity stars in the HAC and VOD regions. In density fittings of the\nRRL sample, we note that the absence of HAC and VOD has a weak effect on the\nshape of halo. Finally, we find that the radially biased anisotropic halo\ncontributes majorly to the stellar halo that can be modelled with a tilted\ntriaxial ellipsoid and a doubly broken power law with breaking radii at\n$18.08^{+2.04}_{-3.22}\\,{\\rm kpc}$ and $33.03^{+1.30}_{-1.21}\\,{\\rm kpc}$. This\nhas important significance for understanding the status of large diffuse\nover-densities in the Milky Way.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}