{"id":"2407.11163","title":"Exact Label Recovery in Euclidean Random Graphs","authors":"Julia Gaudio, Charlie Guan, Xiaochun Niu, Ermin Wei","authorsParsed":[["Gaudio","Julia",""],["Guan","Charlie",""],["Niu","Xiaochun",""],["Wei","Ermin",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:34:40 GMT"}],"updateDate":"2024-07-17","timestamp":1721068480000,"abstract":"  In this paper, we propose a family of label recovery problems on weighted\nEuclidean random graphs. The vertices of a graph are embedded in $\\mathbb{R}^d$\naccording to a Poisson point process, and are assigned to a discrete community\nlabel. Our goal is to infer the vertex labels, given edge weights whose\ndistributions depend on the vertex labels as well as their geometric positions.\nOur general model provides a geometric extension of popular graph and matrix\nproblems, including submatrix localization and $\\mathbb{Z}_2$-synchronization,\nand includes the Geometric Stochastic Block Model (proposed by Sankararaman and\nBaccelli) as a special case. We study the fundamental limits of exact recovery\nof the vertex labels. Under a mild distinctness of distributions assumption, we\ndetermine the information-theoretic threshold for exact label recovery, in\nterms of a Chernoff-Hellinger divergence criterion. Impossibility of recovery\nbelow the threshold is proven by a unified analysis using a Cram\\'er lower\nbound. Achievability above the threshold is proven via an efficient two-phase\nalgorithm, where the first phase computes an almost-exact labeling through a\nlocal propagation scheme, while the second phase refines the labels. The\ninformation-theoretic threshold is dictated by the performance of the so-called\ngenie estimator, which decodes the label of a single vertex given all the other\nlabels. This shows that our proposed models exhibit the local-to-global\namplification phenomenon.\n","subjects":["Computing Research Repository/Social and Information Networks","Mathematics/Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}