{"id":"2407.00042","title":"Module control of network analysis in psychopathology","authors":"Chunyu Pan, Quan Zhang, Yue Zhu, Shengzhou Kong, Juan Liu, Changsheng\n  Zhang, Fei Wang, Xizhe Zhang","authorsParsed":[["Pan","Chunyu",""],["Zhang","Quan",""],["Zhu","Yue",""],["Kong","Shengzhou",""],["Liu","Juan",""],["Zhang","Changsheng",""],["Wang","Fei",""],["Zhang","Xizhe",""]],"versions":[{"version":"v1","created":"Thu, 30 May 2024 14:19:02 GMT"}],"updateDate":"2024-07-02","timestamp":1717078742000,"abstract":"  The network approach to characterizing psychopathology departs from\ntraditional latent categorical and dimensional approaches. Causal interplay\namong symptoms contributed to dynamic psychopathology system. Therefore,\nanalyzing the symptom clusters is critical for understanding mental disorders.\nFurthermore, despite extensive research studying the topological features of\nsymptom networks, the control relationships between symptoms remain largely\nunclear. Here, we present a novel systematizing concept, module control, to\nanalyze the control principle of the symptom network at a module level. We\nintroduce Module Control Network (MCN) to identify key modules that regulate\nthe network's behavior. By applying our approach to a multivariate\npsychological dataset, we discover that non-emotional modules, such as\nsleep-related and stress-related modules, are the primary controlling modules\nin the symptom network. Our findings indicate that module control can expose\ncentral symptom cluster governing psychopathology network, offering novel\ninsights into the underlying mechanisms of mental disorders and individualized\napproach to psychological interventions.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Social and Information Networks","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}