{"id":"2407.14289","title":"Neuromuscular Modeling for Locomotion with Wearable Assistive Robots --\n  A primer","authors":"Mohamed Irfan Refai, Huawei Wang, Antonio Gogeascoechea, Rafael\n  Ornelas Kobayashi, Lucas A. Gaudio, Federica Damonte, Guillaume Durandau,\n  Herman van der Kooij, Utku S. Yavuz, Massimo Sartori","authorsParsed":[["Refai","Mohamed Irfan",""],["Wang","Huawei",""],["Gogeascoechea","Antonio",""],["Kobayashi","Rafael Ornelas",""],["Gaudio","Lucas A.",""],["Damonte","Federica",""],["Durandau","Guillaume",""],["van der Kooij","Herman",""],["Yavuz","Utku S.",""],["Sartori","Massimo",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:18:39 GMT"}],"updateDate":"2024-07-22","timestamp":1721395119000,"abstract":"  Wearable assistive robots (WR) for the lower extremity are extensively\ndocumented in literature. Various interfaces have been designed to control\nthese devices during gait and balance activities. However, achieving seamless\nand intuitive control requires accurate modeling of the human\nneuromusculoskeletal (NMSK) system. Such modeling enables WR to anticipate user\nintentions and determine the necessary joint assistance. Despite the existence\nof controllers interfacing with the NMSK system, robust and generalizable\ntechniques across different tasks remain scarce. Designing these novel\ncontrollers necessitates the combined expertise of neurophysiologists, who\nunderstand the physiology of movement initiation and generation, and\nbiomechatronic engineers, who design and control devices that assist movement.\nThis paper aims to bridge the gaps between these fields by presenting a primer\non key concepts and the current state of the science in each area. We present\nthree main sections: the neuromechanics of locomotion, neuromechanical models\nof movement, and existing neuromechanical controllers used in WR. Through these\nsections, we provide a comprehensive overview of seminal studies in the field,\nfacilitating collaboration between neurophysiologists and biomechatronic\nengineers for future advances in wearable robotics for locomotion.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"HdLJUslbQtGgYzMFTiPZLMZ_1gwuEfqWAy7J_qbqwmg","pdfSize":"3681098"}
