{"id":"2407.12550","title":"UniTE: A Survey and Unified Pipeline for Pre-training ST Trajectory\n  Embeddings","authors":"Yan Lin, Zeyu Zhou, Yicheng Liu, Haochen Lv, Haomin Wen, Tianyi Li,\n  Yushuai Li, Christian S. Jensen, Shengnan Guo, Youfang Lin, Huaiyu Wan","authorsParsed":[["Lin","Yan",""],["Zhou","Zeyu",""],["Liu","Yicheng",""],["Lv","Haochen",""],["Wen","Haomin",""],["Li","Tianyi",""],["Li","Yushuai",""],["Jensen","Christian S.",""],["Guo","Shengnan",""],["Lin","Youfang",""],["Wan","Huaiyu",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 13:31:13 GMT"}],"updateDate":"2024-07-18","timestamp":1721223073000,"abstract":"  Spatio-temporal (ST) trajectories are sequences of timestamped locations,\nwhich enable a variety of analyses that in turn enable important real-world\napplications. It is common to map trajectories to vectors, called embeddings,\nbefore subsequent analyses. Thus, the qualities of embeddings are very\nimportant. Methods for pre-training embeddings, which leverage unlabeled\ntrajectories for training universal embeddings, have shown promising\napplicability across different tasks, thus attracting considerable interest.\nHowever, research progress on this topic faces two key challenges: a lack of a\ncomprehensive overview of existing methods, resulting in several related\nmethods not being well-recognized, and the absence of a unified pipeline,\ncomplicating the development new methods and the analysis of methods.\n  To overcome these obstacles and advance the field of pre-training of\ntrajectory embeddings, we present UniTE, a survey and a unified pipeline for\nthis domain. In doing so, we present a comprehensive list of existing methods\nfor pre-training trajectory embeddings, which includes methods that either\nexplicitly or implicitly employ pre-training techniques. Further, we present a\nunified and modular pipeline with publicly available underlying code,\nsimplifying the process of constructing and evaluating methods for pre-training\ntrajectory embeddings. Additionally, we contribute a selection of experimental\nresults using the proposed pipeline on real-world datasets.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}