{"id":"2407.00549","title":"MIMO-NOMA Enabled Sectorized Cylindrical Massive Antenna Array for HAPS\n  with Spatially Correlated Channels","authors":"Rozita Shafie, Mohammad Javad Omidi, Omid Abbasi, Halim Yanikomeroglu","authorsParsed":[["Shafie","Rozita",""],["Omidi","Mohammad Javad",""],["Abbasi","Omid",""],["Yanikomeroglu","Halim",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 00:37:56 GMT"}],"updateDate":"2024-07-02","timestamp":1719707876000,"abstract":"  The high altitude platform station (HAPS) technology is garnering significant\ninterest as a viable technology for serving as base stations in communication\nnetworks. However, HAPS faces the challenge of high spatial correlation among\nadjacent users' channel gains which is due to the dominant line-of-sight (LoS)\npath between HAPS and terrestrial users. Furthermore, there is a spatial\ncorrelation among antenna elements of HAPS that depends on the propagation\nenvironment and the distance between elements of the antenna array. This paper\npresents an antenna architecture for HAPS and considers the mentioned issues by\ncharacterizing the channel gain and the spatial correlation matrix of the HAPS.\nWe propose a cylindrical antenna for HAPS that utilizes vertical uniform linear\narray (ULA) sectors. Moreover, to address the issue of high spatial correlation\namong users, the non-orthogonal multiple access (NOMA) clustering method is\nproposed. An algorithm is also developed to allocate power among users to\nmaximize both spectral efficiency and energy efficiency while meeting quality\nof service (QoS) and successive interference cancellation (SIC) conditions.\nFinally, simulation results indicate that the spatial correlation has a\nsignificant impact on spectral efficiency and energy efficiency in multiple\nantenna HAPS systems.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"WvDtKcklacvwPuGD1b7dcaYwSQGPOzwJq1-qbt1JYjQ","pdfSize":"968346"}
