{"id":"2407.19025","title":"Adaptive Target Tracking Using Retrospective Cost Input Estimation","authors":"Shashank Verma, Sneha Sanjeevini, E. Dogan Sumer, and Dennis S.\n  Bernstein","authorsParsed":[["Verma","Shashank",""],["Sanjeevini","Sneha",""],["Sumer","E. Dogan",""],["Bernstein","Dennis S.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:08:30 GMT"}],"updateDate":"2024-08-05","timestamp":1722017310000,"abstract":"  Target tracking of surrounding vehicles is essential for collision avoidance\nin autonomous vehicles. Our approach to target tracking is based on causal\nnumerical differentiation on relative position data to estimate relative\nvelocity and acceleration. Causal numerical differentiation is useful for a\nwide range of estimation and control problems with application to robotics and\nautonomous systems. The present paper extends prior work on causal numerical\ndifferentiation based on retrospective cost input estimation (RCIE). Since the\nvariance of the input-estimation error and its correlation with the\nstate-estimation error (the sum of the variance and the correlation is denoted\nas $\\widetilde{V}$) used in the Kalman filter update are unknown, the present\npaper considers an adaptive discrete-time Kalman filter, where\n$\\widetilde{V}_k$ is updated at each time step $k$ to minimize the difference\nbetween the sample variance of the innovations and the variance of the\ninnovations given by the Kalman filter. The performance of this approach is\nshown to reach the performance of numerical differentiation based on RCIE with\nthe best possible fixed value of $\\widetilde{V}_k$. The proposed method thus\neliminates the need to determine the best possible fixed value for\n$\\widetilde{V}_k$. Finally, RCIE with an adaptive Kalman filter is applied to\ntarget tracking of a vehicle using simulated data from CarSim.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}