{"id":"2407.16435","title":"On Deep Learning for computing the Dynamic Initial Margin and Margin\n  Value Adjustment","authors":"Joel P. Villarino and \\'Alvaro Leitao","authorsParsed":[["Villarino","Joel P.",""],["Leitao","Álvaro",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 12:35:17 GMT"}],"updateDate":"2024-07-24","timestamp":1721738117000,"abstract":"  The present work addresses the challenge of training neural networks for\nDynamic Initial Margin (DIM) computation in counterparty credit risk, a task\ntraditionally burdened by the high costs associated with generating training\ndatasets through nested Monte Carlo (MC) simulations. By condensing the initial\nmarket state variables into an input vector, determined through an interest\nrate model and a parsimonious parameterization of the current interest rate\nterm structure, we construct a training dataset where labels are noisy but\nunbiased DIM samples derived from single MC paths. A multi-output neural\nnetwork structure is employed to handle DIM as a time-dependent function,\nfacilitating training across a mesh of monitoring times. The methodology offers\nsignificant advantages: it reduces the dataset generation cost to a single MC\nexecution and parameterizes the neural network by initial market state\nvariables, obviating the need for repeated training. Experimental results\ndemonstrate the approach's convergence properties and robustness across\ndifferent interest rate models (Vasicek and Hull-White) and portfolio\ncomplexities, validating its general applicability and efficiency in more\nrealistic scenarios.\n","subjects":["Quantitative Finance/Computational Finance","Quantitative Finance/Risk Management"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sHxKUowDU07xad0eUITqt_aW_EG3NYzV4DTNgpbYdZ4","pdfSize":"1351484","objectId":"0x4f9ef80aa7f08c3f5425174c4a977bc0457e730af753ea1250fb8a285cbadd2d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
