{"id":"2407.07707","title":"Group Projected Subspace Pursuit for Block Sparse Signal Reconstruction:\n  Convergence Analysis and Applications","authors":"Roy Y. He and Haixia Liu and Hao Liu","authorsParsed":[["He","Roy Y.",""],["Liu","Haixia",""],["Liu","Hao",""]],"versions":[{"version":"v1","created":"Sat, 1 Jun 2024 08:48:06 GMT"},{"version":"v2","created":"Sun, 14 Jul 2024 03:18:43 GMT"}],"updateDate":"2024-07-16","timestamp":1717231686000,"abstract":"  In this paper, we present a convergence analysis of the Group Projected\nSubspace Pursuit (GPSP) algorithm proposed by He et al. [HKL+23] (Group\nProjected subspace pursuit for IDENTification of variable coefficient\ndifferential equations (GP-IDENT), Journal of Computational Physics, 494,\n112526) and extend its application to general tasks of block sparse signal\nrecovery. We prove that when the sampling matrix satisfies the Block Restricted\nIsometry Property (BRIP) with a sufficiently small Block Restricted Isometry\nConstant (BRIC), GPSP exactly recovers the true block sparse signals. When the\nobservations are noisy, this convergence property of GPSP remains valid if the\nmagnitude of true signal is sufficiently large. GPSP selects the features by\nsubspace projection criterion (SPC) for candidate inclusion and response\nmagnitude criterion (RMC) for candidate exclusion. We compare these criteria\nwith counterparts of other state-of-the-art greedy algorithms. Our theoretical\nanalysis and numerical ablation studies reveal that SPC is critical to the\nsuperior performances of GPSP, and that RMC can enhance the robustness of\nfeature identification when observations contain noises. We test and compare\nGPSP with other methods in diverse settings, including heterogeneous random\nblock matrices, inexact observations, face recognition, and PDE identification.\nWe find that GPSP outperforms the other algorithms in most cases for various\nlevels of block sparsity and block sizes, justifying its effectiveness for\ngeneral applications.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory","Mathematics/Optimization and Control","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}