{"id":"2407.05523","title":"Negative Results of Image Processing for Identifying Duplicate Questions\n  on Stack Overflow","authors":"Faiz Ahmed, Suprakash Datta, Maleknaz Nayebi","authorsParsed":[["Ahmed","Faiz",""],["Datta","Suprakash",""],["Nayebi","Maleknaz",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 00:14:21 GMT"}],"updateDate":"2024-07-09","timestamp":1720397661000,"abstract":"  In the rapidly evolving landscape of developer communities, Q&A platforms\nserve as crucial resources for crowdsourcing developers' knowledge. A notable\ntrend is the increasing use of images to convey complex queries more\neffectively. However, the current state-of-the-art method of duplicate question\ndetection has not kept pace with this shift, which predominantly concentrates\non text-based analysis. Inspired by advancements in image processing and\nnumerous studies in software engineering illustrating the promising future of\nimage-based communication on social coding platforms, we delved into\nimage-based techniques for identifying duplicate questions on Stack Overflow.\nWhen focusing solely on text analysis of Stack Overflow questions and omitting\nthe use of images, our automated models overlook a significant aspect of the\nquestion. Previous research has demonstrated the complementary nature of images\nto text. To address this, we implemented two methods of image analysis: first,\nintegrating the text from images into the question text, and second, evaluating\nthe images based on their visual content using image captions. After a rigorous\nevaluation of our model, it became evident that the efficiency improvements\nachieved were relatively modest, approximately an average of 1%. This marginal\nenhancement falls short of what could be deemed a substantial impact. As an\nencouraging aspect, our work lays the foundation for easy replication and\nhypothesis validation, allowing future research to build upon our approach.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3Z9KVyneaqa5DX9DqcG9DNU1qA9Tbum3CL_TDkf-q84","pdfSize":"1170679"}
