{"id":"2407.13148","title":"A universal mechanism for optically addressable solid-state spin pairs","authors":"Islay O. Robertson, Benjamin Whitefield, Sam C. Scholten, Priya Singh,\n  Alexander J. Healey, Philipp Reineck, Mehran Kianinia, David A. Broadway,\n  Igor Aharonovich, Jean-Philippe Tetienne","authorsParsed":[["Robertson","Islay O.",""],["Whitefield","Benjamin",""],["Scholten","Sam C.",""],["Singh","Priya",""],["Healey","Alexander J.",""],["Reineck","Philipp",""],["Kianinia","Mehran",""],["Broadway","David A.",""],["Aharonovich","Igor",""],["Tetienne","Jean-Philippe",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 04:28:33 GMT"}],"updateDate":"2024-07-19","timestamp":1721276913000,"abstract":"  Optically detected magnetic resonance (ODMR) has been observed from emitters\nin hexagonal boron nitride across a broad range of wavelengths, but so far an\nunderstanding of their microscopic structure and the physical origin of ODMR\nhas been lacking. Here we perform comprehensive measurements and modelling of\nthe spin-resolved photodynamics of ensembles and single emitters, and uncover a\nuniversal model that accounts, and provides an intuitive physical explanation,\nfor all key experimental features. The model assumes a pair of nearby point\ndefects -- a primary optically active defect and a secondary defect. Charge\ntransfer between the two defects creates a metastable weakly coupled spin pair\nwith ODMR naturally arising from selection rules. Our optical-spin defect pair\n(OSDP) model resolves several previously open questions including the\nasymmetric envelope of the Rabi oscillations, the large variability in ODMR\ncontrast amplitude and sign, and the wide spread in emission wavelength. It may\nalso explain similar phenomena observed in other wide bandgap semiconductors\nsuch as GaN. The presented framework will be instrumental in guiding future\ntheoretical and experimental efforts to study and engineer solid-state spin\npairs and unlock their potential for quantum technology applications.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}