{"id":"2407.08505","title":"JWST/NIRSpec insights into the circumnuclear region of Arp 220: A\n  detailed kinematic study","authors":"L. Ulivi, M. Perna, I. Lamperti, S. Arribas, G. Cresci, B. Rodr\\'iguez\n  Del Pino, T. Boeker, A. J. Bunker, M. Ceci, S. Charlot, F. D Eugenio, K.\n  Fahrion, R. Maiolino, A. Marconi, M. Pereira-Santaella","authorsParsed":[["Ulivi","L.",""],["Perna","M.",""],["Lamperti","I.",""],["Arribas","S.",""],["Cresci","G.",""],["Del Pino","B. Rodríguez",""],["Boeker","T.",""],["Bunker","A. J.",""],["Ceci","M.",""],["Charlot","S.",""],["Eugenio","F. D",""],["Fahrion","K.",""],["Maiolino","R.",""],["Marconi","A.",""],["Pereira-Santaella","M.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 13:40:30 GMT"}],"updateDate":"2024-07-12","timestamp":1720705230000,"abstract":"  The study of starburst and AGN feedback is crucial for understanding the\nregulation of star formation and the evolution of galaxies across cosmic time.\nArp 220, the closest ultraluminous infrared galaxy (ULIRG), is in an advanced\nphase of a major merger with two distinct nuclei, and shows evidence of\nmulti-phase (molecular, ionised, neutral) and multi-scale (from < 0.1 to > 5\nkpc) outflows. Therefore, it represents an ideal system for investigating\noutflow mechanisms and feedback phenomena in detail. Using new JWST NIRSpec IFU\nobservations, we investigate the spatially resolved gaseous (in both ionized\nand hot molecular phases) and stellar kinematics in the innermost 1 kpc. We\ndecouple the different gas kinematic components through multi-Gaussian fitting,\nidentifying distinct multi-phase outflows associated with the two nuclei, with\nvelocities up to $\\sim$ 1000 km/s. We compute the mass ($\\sim 10^7$ M$_\\odot$),\nmass outflow rate ($\\sim 20$ M$_\\odot$/yr) and energetics ($\\dot E_{out}\\sim\n10^{42}$ erg/s) for each outflow, finding that the ionized and hot molecular\noutflowing gas contribute around 2-30% to the total mass and the energy of the\noutflows, as inferred from the combination of multi-wavelength information. We\ndiscuss the possible origin of the outflows, finding no compelling evidence to\nprefer a starburst or AGN driven scenario. Regardless of their nature, outflows\nin Arp 220 propagate in multiple directions from parsec to kiloparsec scales,\npotentially impacting a significant portion of the host galaxy. This contrasts\nwith isolated systems where outflows typically follow a more collimated path,\nand do not affect the interstellar medium throughout the entire galaxy. This\nstudy highlights the importance of investigating merging systems with\nmulti-wavelength facilities, including JWST/NIRSpec IFS, to obtain a\ncomprehensive understanding of feedback mechanisms in galaxy evolution.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"wV97UUCHlejRvvV6Np3bGu2bncelTCwBFwS1XLMksc0","pdfSize":"16645614"}
