{"id":"2407.02370","title":"Investigating Event-Based Cameras for Video Frame Interpolation in\n  Sports","authors":"Antoine Deckyvere, Anthony Cioppa, Silvio Giancola, Bernard Ghanem,\n  Marc Van Droogenbroeck","authorsParsed":[["Deckyvere","Antoine",""],["Cioppa","Anthony",""],["Giancola","Silvio",""],["Ghanem","Bernard",""],["Van Droogenbroeck","Marc",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 15:39:08 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 08:32:51 GMT"}],"updateDate":"2024-07-04","timestamp":1719934748000,"abstract":"  Slow-motion replays provide a thrilling perspective on pivotal moments within\nsports games, offering a fresh and captivating visual experience. However,\ncapturing slow-motion footage typically demands high-tech, expensive cameras\nand infrastructures. Deep learning Video Frame Interpolation (VFI) techniques\nhave emerged as a promising avenue, capable of generating high-speed footage\nfrom regular camera feeds. Moreover, the utilization of event-based cameras has\nrecently gathered attention as they provide valuable motion information between\nframes, further enhancing the VFI performances. In this work, we present a\nfirst investigation of event-based VFI models for generating sports slow-motion\nvideos. Particularly, we design and implement a bi-camera recording setup,\nincluding an RGB and an event-based camera to capture sports videos, to\ntemporally align and spatially register both cameras. Our experimental\nvalidation demonstrates that TimeLens, an off-the-shelf event-based VFI model,\ncan effectively generate slow-motion footage for sports videos. This first\ninvestigation underscores the practical utility of event-based cameras in\nproducing sports slow-motion content and lays the groundwork for future\nresearch endeavors in this domain.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IgH1vfb1LWosmw3xnrhZ_eeI_bki7lYORMbqReE23a0","pdfSize":"11879713"}
