{"id":"2407.06276","title":"Four no-go theorems on the existence of spin and orbital angular\n  momentum of massless bosons","authors":"Eric Palmerduca and Hong Qin","authorsParsed":[["Palmerduca","Eric",""],["Qin","Hong",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:00:10 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 07:29:34 GMT"}],"updateDate":"2024-07-19","timestamp":1720461610000,"abstract":"  Over the past thirty years there has been an ever-increasing interest in the\nso-called orbital angular momentum (OAM) of light, driven in large part by its\ndiverse range of applications, from new imaging techniques to optical tweezers.\nHowever, there are fundamental theoretical issues with splitting the photon\nangular momentum operator into spin (SAM) and orbital angular momentum parts.\nWhile such an SAM-OAM splitting is simple and unambiguous for massive\nparticles, there are many different proposed splittings for massless photons\nand no consensus about which is correct. Moreover, it has been explicitly shown\nthat most of the proposed SAM and OAM operators do not satisfy the defining\ncommutation relations of angular momentum operators and are thus not legitimate\nsplittings. Here we prove that it is generally impossible to split the total\nangular momentum operator of massless bosons, like photons and gravitons, into\nspin and orbital parts. We show that the obstruction to such a splitting can be\nunderstood as both geometric and topological. We prove two additional no-go\ntheorems which generalize this result, in particular showing that there are no\nSAM-OAM splittings even if (1) the SAM operator is allowed to represent\nnon-internal symmetries or (2) if one allows the SAM and OAM operators to\ngenerate non-$\\mathrm{SO}(3)$ symmetries. We show how gauge redundant\ndescriptions of massless particles can suggest SAM-OAM splittings which are\ninvalid once gauge-invariance is imposed.\n","subjects":["Physics/Mathematical Physics","Physics/High Energy Physics - Theory","Mathematics/Mathematical Physics","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}