{"id":"2407.14716","title":"Improved constraint on Higgs boson self-couplings with quartic and cubic\n  power dependence in the cross section","authors":"Hai Tao Li, Zong-Guo Si, Jian Wang, Xiao Zhang, Dan Zhao","authorsParsed":[["Li","Hai Tao",""],["Si","Zong-Guo",""],["Wang","Jian",""],["Zhang","Xiao",""],["Zhao","Dan",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 01:00:55 GMT"}],"updateDate":"2024-07-23","timestamp":1721437255000,"abstract":"  Precise information on the Higgs boson self-couplings provides the foundation\nfor unveiling the electroweak symmetry breaking mechanism. Due to the scarcity\nof Higgs boson pair events at the LHC, only loose limits have been obtained.\nThis is based on the assumption that the cross section is a quadratic function\nof the trilinear Higgs self-coupling in the $\\kappa$ framework. However, if\nhigher-order corrections of virtual Higgs bosons are included, the function\nform would dramatically change. In particular, new quartic and cubic power\ndependence on the trilinear Higgs self-coupling would appear. To get this new\nfunction form, we have performed a specialized renormalization procedure\nsuitable for tracking all the Higgs self-couplings in each calculation step.\nMoreover, we introduce renormalization of the scaling parameter in the $\\kappa$\nframework to ensure the cancellation of all ultraviolet divergences. With the\nnew function forms of the cross sections in both the gluon-gluon fusion and\nvector boson fusion channels, the upper limit of\n$\\kappa_{\\lambda_3}=\\lambda_{\\rm 3H}/\\lambda_{\\rm 3H}^{\\rm SM}$ by the ATLAS\n(CMS) collaboration is reduced from 6.6 (6.49) to 5.4 (5.37). However, it is\nstill hard to extract a meaningful constraint on the quartic Higgs\nself-coupling $\\lambda_{\\rm 4H}$ from Higgs boson pair production data. We also\npresent the invariant mass distributions of the Higgs boson pair at different\nvalues of $\\kappa_{\\lambda}$, which could help to set optimal cuts in the\nexperimental analysis.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}