{"id":"2407.07395","title":"Standard compliant video coding using low complexity, switchable neural\n  wrappers","authors":"Yueyu Hu, Chenhao Zhang, Onur G. Guleryuz, Debargha Mukherjee, Yao\n  Wang","authorsParsed":[["Hu","Yueyu",""],["Zhang","Chenhao",""],["Guleryuz","Onur G.",""],["Mukherjee","Debargha",""],["Wang","Yao",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 06:36:45 GMT"}],"updateDate":"2024-07-11","timestamp":1720593405000,"abstract":"  The proliferation of high resolution videos posts great storage and bandwidth\npressure on cloud video services, driving the development of next-generation\nvideo codecs. Despite great progress made in neural video coding, existing\napproaches are still far from economical deployment considering the complexity\nand rate-distortion performance tradeoff. To clear the roadblocks for neural\nvideo coding, in this paper we propose a new framework featuring standard\ncompatibility, high performance, and low decoding complexity. We employ a set\nof jointly optimized neural pre- and post-processors, wrapping a standard video\ncodec, to encode videos at different resolutions. The rate-distorion optimal\ndownsampling ratio is signaled to the decoder at the per-sequence level for\neach target rate. We design a low complexity neural post-processor architecture\nthat can handle different upsampling ratios. The change of resolution exploits\nthe spatial redundancy in high-resolution videos, while the neural wrapper\nfurther achieves rate-distortion performance improvement through end-to-end\noptimization with a codec proxy. Our light-weight post-processor architecture\nhas a complexity of 516 MACs / pixel, and achieves 9.3% BD-Rate reduction over\nVVC on the UVG dataset, and 6.4% on AOM CTC Class A1. Our approach has the\npotential to further advance the performance of the latest video coding\nstandards using neural processing with minimal added complexity.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}