{"id":"2407.20847","title":"Public vs Private Bodies: Who Should Run Advanced AI Evaluations and\n  Audits? A Three-Step Logic Based on Case Studies of High-Risk Industries","authors":"Merlin Stein, Milan Gandhi, Theresa Kriecherbauer, Amin Oueslati and\n  Robert Trager","authorsParsed":[["Stein","Merlin",""],["Gandhi","Milan",""],["Kriecherbauer","Theresa",""],["Oueslati","Amin",""],["Trager","Robert",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 14:25:08 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 18:11:53 GMT"}],"updateDate":"2024-09-05","timestamp":1722349508000,"abstract":"  Artificial Intelligence (AI) Safety Institutes and governments worldwide are\ndeciding whether they evaluate and audit advanced AI themselves, support a\nprivate auditor ecosystem or do both. Auditing regimes have been established in\na wide range of industry contexts to monitor and evaluate firms' compliance\nwith regulation. Auditing is a necessary governance tool to understand and\nmanage the risks of a technology. This paper draws from nine such regimes to\ninform (i) who should audit which parts of advanced AI; and (ii) how much\ncapacity public bodies may need to audit advanced AI effectively. First, the\neffective responsibility distribution between public and private auditors\ndepends heavily on specific industry and audit conditions. On the basis of\nadvanced AI's risk profile, the sensitivity of information involved in the\nauditing process, and the high costs of verifying safety and benefit claims of\nAI Labs, we recommend that public bodies become directly involved in safety\ncritical, especially gray- and white-box, AI model evaluations. Governance and\nsecurity audits, which are well-established in other industry contexts, as well\nas black-box model evaluations, may be more efficiently provided by a private\nmarket of evaluators and auditors under public oversight. Secondly, to\neffectively fulfill their role in advanced AI audits, public bodies need\nextensive access to models and facilities. Public bodies' capacity should scale\nwith the industry's risk level, size and market concentration, potentially\nrequiring 100s of employees for auditing in large jurisdictions like the EU or\nUS, like in nuclear safety and life sciences.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"b2tEv9FWOBlpQ2LvJv0qKC5-cNo75ywgkXOD04oBXEo","pdfSize":"2721889","objectId":"0x638699c0a28f74682a28fda75c3713cb1720cc46b7b6a5dc417c5061c086e0ff","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
