{"id":"2407.05696","title":"Closed-loop measurement in atom interferometer gyroscope with\n  velocity-dependent phase dispersion compensation","authors":"Tomoya Sato, Naoki Nishimura, Naoki Kaku, Sotatsu Otabe, Takuya\n  Kawasaki, Toshiyuki Hosoya, Mikio Kozuma","authorsParsed":[["Sato","Tomoya",""],["Nishimura","Naoki",""],["Kaku","Naoki",""],["Otabe","Sotatsu",""],["Kawasaki","Takuya",""],["Hosoya","Toshiyuki",""],["Kozuma","Mikio",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 07:58:36 GMT"}],"updateDate":"2024-07-09","timestamp":1720425516000,"abstract":"  Atom interferometer-based gyroscopes are expected to have a wide range of\napplications due to their high sensitivity. However, their dynamic range is\nlimited by dephasing caused by velocity-dependent Sagnac phase shift in\ncombination with the velocity distribution of the atoms, restricting\nmeasurements of large angular velocities. In this study, we present a method\nfor restoring the contrast deterioration in rotation rate measurements with\ninterferometer gyroscopes using atomic beams. Our findings confirm that by\nintroducing the pseudo-rotation effect with appropriate two-photon detunings\nfor Raman lights in the interferometer, it is possible to effectively cancel\nthe rotation of all atoms in the velocity distribution of the beam.\nConsequently, the contrast is unaffected by the rotation. Furthermore, we\napplied this method to an interferometer gyroscope with counterpropagating\natomic beams sharing the same Raman lights. We also found that the rotation\nrate of the system can be estimated through the detunings points where the\nphase difference between the two interferometers is zero. This approach ensures\nthat the scale factor of the atom interferometer gyroscope is independent of\nthe velocity fluctuation of the atomic beam. We demonstrate our technique using\nthe interferometer gyroscope of thermal atomic beams of rubidium-87, achieving\na measurement of rotation rate of $\\mathrm{{1.0}^{\\circ}/s}$ even with an\nacceleration of 0.68$\\mathrm{m/s^2}$ on a three-axis rotation table. This\nsimple and robust dispersion compensation method with Raman light detuning\nbenefits dynamic rotation-rate measurements in field applications such as the\ninertial navigation of vehicles.\n","subjects":["Physics/Atomic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}