{"id":"2407.15915","title":"Mildly Super-Eddington Accretion Onto Slowly-Spinning Black Holes\n  Explains the X-Ray Weakness of the Little Red Dots","authors":"Fabio Pacucci, Ramesh Narayan","authorsParsed":[["Pacucci","Fabio",""],["Narayan","Ramesh",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-24","timestamp":1721671200000,"abstract":"  JWST has revealed a population of low-luminosity AGN at $z>4$ in compact, red\nhosts (the \"Little Red Dots\", or LRDs), which are largely undetected in X-rays.\nWe investigate this phenomenon using GRRMHD simulations of super-Eddington\naccretion onto a SMBH with $M_\\bullet=10^7 \\,\\rm M_\\odot$ at $z\\sim6$,\nrepresenting the median population; the SEDs that we obtain are intrinsically\nX-ray weak. The highest levels of X-ray weakness occur in SMBHs accreting at\nmildly super-Eddington rates ($1.4<f_{\\rm Edd}<4$) with zero spin, viewed at\nangles $>30^\\circ$ from the pole. X-ray bolometric corrections in the observed\n$2-10$ keV band reach $\\sim10^4$ at $z=6$, $\\sim5$ times higher than the\nhighest constraint from X-ray stacking. Most SEDs exhibit $\\alpha_{\\rm ox}$\nvalues outside standard ranges, with X-ray weakness increasing with optical-UV\nluminosity; they are also extraordinarily steep and soft in the X-rays (median\nphoton index $\\Gamma=3.1$, mode of $\\Gamma=4.4$). SEDs strong in the X-rays\nhave harder spectra with a high-energy bump when viewed near the hot ($>10^8$\nK) and highly-relativistic jet, whereas X-ray weak SEDs lack this feature.\nViewing a SMBH within $10^\\circ$ of its pole, where beaming enhances the X-ray\nemission, has a $\\sim1.5\\%$ probability, matching the LRD X-ray detection rate.\nNext-generation observatories like AXIS will detect X-ray weak LRDs at $z\\sim6$\nfrom any viewing angle. Although many SMBHs in the LRDs are already estimated\nto accrete at super-Eddington rates, our model explains $50\\%$ of their\npopulation by requiring that their masses are overestimated by a mere factor of\n$\\sim3$. In summary, we suggest that LRDs host slowly spinning SMBHs accreting\nat mildly super-Eddington rates, with large covering factors and broad emission\nlines enhanced by strong winds, providing a self-consistent explanation for\ntheir X-ray weakness and complementing other models.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}