{"id":"2407.00465","title":"Characterizing Continual Learning Scenarios and Strategies for Audio\n  Analysis","authors":"Ruchi Bhatt, Pratibha Kumari, Dwarikanath Mahapatra, Abdulmotaleb El\n  Saddik and Mukesh Saini","authorsParsed":[["Bhatt","Ruchi",""],["Kumari","Pratibha",""],["Mahapatra","Dwarikanath",""],["Saddik","Abdulmotaleb El",""],["Saini","Mukesh",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 15:21:20 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 07:57:18 GMT"}],"updateDate":"2024-07-29","timestamp":1719674480000,"abstract":"  Audio analysis is useful in many application scenarios. The state-of-the-art\naudio analysis approaches assume the data distribution at training and\ndeployment time will be the same. However, due to various real-life challenges,\nthe data may encounter drift in its distribution or can encounter new classes\nin the late future. Thus, a one-time trained model might not perform\nadequately. Continual learning (CL) approaches are devised to handle such\nchanges in data distribution. There have been a few attempts to use CL\napproaches for audio analysis. Yet, there is a lack of a systematic evaluation\nframework. In this paper, we create a comprehensive CL dataset and characterize\nCL approaches for audio-based monitoring tasks. We have investigated the\nfollowing CL and non-CL approaches: EWC, LwF, SI, GEM, A-GEM, GDumb, Replay,\nNaive, Cumulative, and Joint training. The study is very beneficial for\nresearchers and practitioners working in the area of audio analysis for\ndeveloping adaptive models. We observed that Replay achieved better results\nthan other methods in the DCASE challenge data. It achieved an accuracy of\n70.12% for the domain incremental scenario and an accuracy of 96.98% for the\nclass incremental scenario.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}