{"id":"2407.16151","title":"Optimal camera-robot pose estimation in linear time from points and\n  lines","authors":"Guangyang Zeng, Biqiang Mu, Qingcheng Zeng, Yuchen Song, Chulin Dai,\n  Guodong Shi, and Junfeng Wu","authorsParsed":[["Zeng","Guangyang",""],["Mu","Biqiang",""],["Zeng","Qingcheng",""],["Song","Yuchen",""],["Dai","Chulin",""],["Shi","Guodong",""],["Wu","Junfeng",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 03:27:27 GMT"}],"updateDate":"2024-07-24","timestamp":1721705247000,"abstract":"  Camera pose estimation is a fundamental problem in robotics. This paper\nfocuses on two issues of interest: First, point and line features have\ncomplementary advantages, and it is of great value to design a uniform\nalgorithm that can fuse them effectively; Second, with the development of\nmodern front-end techniques, a large number of features can exist in a single\nimage, which presents a potential for highly accurate robot pose estimation.\nWith these observations, we propose AOPnP(L), an optimal linear-time\ncamera-robot pose estimation algorithm from points and lines. Specifically, we\nrepresent a line with two distinct points on it and unify the noise model for\npoint and line measurements where noises are added to 2D points in the image.\nBy utilizing Plucker coordinates for line parameterization, we formulate a\nmaximum likelihood (ML) problem for combined point and line measurements. To\noptimally solve the ML problem, AOPnP(L) adopts a two-step estimation scheme.\nIn the first step, a consistent estimate that can converge to the true pose is\ndevised by virtue of bias elimination. In the second step, a single\nGauss-Newton iteration is executed to refine the initial estimate. AOPnP(L)\nfeatures theoretical optimality in the sense that its mean squared error\nconverges to the Cramer-Rao lower bound. Moreover, it owns a linear time\ncomplexity. These properties make it well-suited for precision-demanding and\nreal-time robot pose estimation. Extensive experiments are conducted to\nvalidate our theoretical developments and demonstrate the superiority of\nAOPnP(L) in both static localization and dynamic odometry systems.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}