{"id":"2407.01651","title":"Phase-field modeling of dendritic growth with gas bubbles in the\n  solidification of binary alloys","authors":"Chengjie Zhan, Zhenhua Chai, Dongke Sun, Baochang Shi, Shaoning Geng,\n  Ping Jiang","authorsParsed":[["Zhan","Chengjie",""],["Chai","Zhenhua",""],["Sun","Dongke",""],["Shi","Baochang",""],["Geng","Shaoning",""],["Jiang","Ping",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 11:35:50 GMT"}],"updateDate":"2024-07-03","timestamp":1719833750000,"abstract":"  In this work, a phase-field model is developed for the dendritic growth with\ngas bubbles in the solidification of binary alloys. In this model, a total free\nenergy for the complex gas-liquid-dendrite system is proposed through\nconsidering the interactions of gas bubbles, liquid melt and solid dendrites,\nand it can reduce to the energy for gas-liquid flows in the region far from the\nsolid phase, while degenerate to the energy for thermosolutal dendritic growth\nwhen the gas bubble disappears. The governing equations are usually obtained by\nminimizing the total free energy, but here some modifications are made to\nimprove the capacity of the conservative phase-field equation for gas bubbles\nand convection-diffusion equation for solute transfer. Additionally, through\nthe asymptotic analysis of the thin-interface limit, the present general\nphase-field model for alloy solidification can match the corresponding free\nboundary problem, and it is identical to the commonly used models under a\nspecific choice of model parameters. Furthermore, to describe the fluid flow,\nthe incompressible Navier-Stokes equations are adopted in the entire domain\nincluding gas, liquid, and solid regions, where the fluid-structure interaction\nis considered by a simple diffuse-interface method. To test the present\nphase-field model, the lattice Boltzmann method is used to study several\nproblems of gas-liquid flows, dendritic growth as well as the solidification in\npresence of gas bubbles, and a good performance of the present model for such\ncomplex problems is observed.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}