{"id":"2407.08281","title":"eUDEVS: Executable UML with DEVS Theory of Modeling and Simulation","authors":"Jos\\'e L. Risco-Mart\\'in, J. M. Cruz, Saurabh Mittal and Bernard P.\n  Zeigler","authorsParsed":[["Risco-Martín","José L.",""],["Cruz","J. M.",""],["Mittal","Saurabh",""],["Zeigler","Bernard P.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 08:29:46 GMT"}],"updateDate":"2024-07-12","timestamp":1720686586000,"abstract":"  Modeling and Simulation (M&S) for system design and prototyping is practiced\ntoday both in the industry and academia. M&S are two different areas altogether\nand have specific objectives. However, most of the times these two separate\nareas are taken together. The developed code is tightly woven around both the\nmodel and the underlying simulator that executes it. This constraints both the\nmodel development and the simulation engine that impacts scalability of the\ndeveloped code. Furthermore, a lot of time is spent in development of a model\nbecause it needs both domain knowledge and simulation techniques, which also\nrequires communication among users and developers. Unified Modeling Language\n(UML) is widely accepted in the industry, whereas Discrete Event Specification\n(DEVS) based modeling that separates the model and the simulator, provides a\ncleaner methodology to develop models and is much used in academia. DEVS today\nis used by engineers who understand discrete event modeling at a much detailed\nlevel and are able to translate requirements to DEVS modeling code. There have\nbeen earlier efforts to integrate UML and DEVS but they haven't succeeded in\nproviding a transformation mechanism due to inherent differences in these two\nmodeling paradigms. This paper presents an integrated approach towards\ncrosstransformations between UML and DEVS using the proposed eUDEVS, which\nstands for executable UML based on DEVS. Further, we will also show that the\nobtained DEVS models belong to a specific class of DEVS models called Finite\nDeterministic DEVS (FD-DEVS) that is available as a W3C XML Schema in XFD-DEVS.\nWe also put the proposed eUDEVS in a much larger unifying framework called DEVS\nUnified Process that allows bifurcated model-continuity based lifecycle\nmethodology for systems M&S. Finally, we demonstrate the laid concepts with a\ncomplete example.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"jm3UCIj3Ecm9dIWvN3LHEyNvVYlCxPrjqRVsEe-pgrc","pdfSize":"1087634","objectId":"0xcb7869e89cf5e13cfbbc25f499be8bb3eada228006d1b91dd3e1e141bbc31631","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
