{"id":"2407.20935","title":"$T\\bar{a}laGen:$ A System for Automatic $T\\bar{a}la$ Identification and\n  Generation","authors":"Rahul Bapusaheb Kodag, Himanshu Jindal, Vipul Arora","authorsParsed":[["Kodag","Rahul Bapusaheb",""],["Jindal","Himanshu",""],["Arora","Vipul",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 16:15:50 GMT"}],"updateDate":"2024-08-02","timestamp":1722356150000,"abstract":"  In Hindustani classical music, the tabla plays an important role as a\nrhythmic backbone and accompaniment. In applications like computer-based music\nanalysis, learning singing, and learning musical instruments, tabla stroke\ntranscription, $t\\bar{a}la$ identification, and generation are crucial. This\npaper proposes a comprehensive system aimed at addressing these challenges. For\ntabla stroke transcription, we propose a novel approach based on model-agnostic\nmeta-learning (MAML) that facilitates the accurate identification of tabla\nstrokes using minimal data. Leveraging these transcriptions, the system\nintroduces two novel $t\\bar{a}la$ identification methods based on the sequence\nanalysis of tabla strokes. \\par Furthermore, the paper proposes a framework for\n$t\\bar{a}la$ generation to bridge traditional and modern learning methods. This\nframework utilizes finite state transducers (FST) and linear time-invariant\n(LTI) filters to generate $t\\bar{a}las$ with real-time tempo control through\nuser interaction, enhancing practice sessions and musical education.\nExperimental evaluations on tabla solo and concert datasets demonstrate the\nsystem's exceptional performance on real-world data and its ability to\noutperform existing methods. Additionally, the proposed $t\\bar{a}la$\nidentification methods surpass state-of-the-art techniques. The contributions\nof this paper include a combined approach to tabla stroke transcription,\ninnovative $t\\bar{a}la$ identification techniques, and a robust framework for\n$t\\bar{a}la$ generation that handles the rhythmic complexities of Hindustani\nmusic.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"-rP4xwW4in1BiMqjPbhwoBThIiSubVOLAeMOdJQCxoY","pdfSize":"696394","objectId":"0xfb4bef76bd71255f2a22431b5c0f5ae634b5fa3c2503bc45cf8bd8a7a92336f5","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
