{"id":"2407.17148","title":"Exact and asymptotic dissipative spectral form factor for elliptic\n  Ginibre unitary ensemble","authors":"Sunidhi Sen, Santosh Kumar","authorsParsed":[["Sen","Sunidhi",""],["Kumar","Santosh",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 10:44:03 GMT"}],"updateDate":"2024-07-25","timestamp":1721817843000,"abstract":"  The dissipative spectral form factor (DSFF) has recently emerged as a\ndiagnostic tool for assessing non-integrability or chaos in non-Hermitian\nsystems. It extends the concept of the spectral form factor (SFF), a widely\nused measure for similar investigations in Hermitian systems. In this study, we\nconcentrate on the elliptic Ginibre unitary ensemble (eGinUE), which\ninterpolates between the non-Hermitian limit of Ginibre unitary ensemble\n(GinUE) and the Hermitian limit of Gaussian unitary ensemble (GUE) by varying a\nsymmetry parameter. We derive exact finite-dimension expression and\nlarge-dimension approximation for the DSFF of eGinUE. A key finding of this\nwork is a compelling ``scaling relationship\" between the DSFF of eGinUE and\nthat of the GUE or GinUE. This scaling relationship also reveals a previously\nunobserved connection between the DSFF of GinUE and the SFF of GUE. The DSFF\nfor eGinUE displays a \\emph{dip-ramp-plateau} structure in the GinUE and GUE\nlimits, as well as in the crossover region, with differences in time scales\nthat are well-explained by the aforementioned scaling relationship.\nAdditionally, depending on the symmetry regime within the crossover, we provide\nvarious estimates for the Thouless time ($T_\\mathrm{Th}$) and Heisenberg time\n($T_\\mathrm{H}$), which correspond to the dip-ramp and ramp-plateau\ntransitions, respectively. Our analytical results are compared with Monte Carlo\nsimulations of the eGinUE random matrix model, showing excellent agreement.\n","subjects":["Condensed Matter/Statistical Mechanics","Physics/High Energy Physics - Theory","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Nonlinear Sciences/Chaotic Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}