{"id":"2407.14793","title":"QoS Aware Mixed-Criticality Task Scheduling in Vehicular Edge Cloud\n  System","authors":"Suvarthi Sarkar, Aditya Trivedi, Ritish Bansal, Aryabartta Sahu","authorsParsed":[["Sarkar","Suvarthi",""],["Trivedi","Aditya",""],["Bansal","Ritish",""],["Sahu","Aryabartta",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 07:45:20 GMT"}],"updateDate":"2024-07-23","timestamp":1721461520000,"abstract":"  Modern-day cars are equipped with numerous cameras and sensors, typically\nintegrated with advanced decision-control systems that enable the vehicle to\nperceive its surroundings and navigate autonomously. Efficient processing of\ndata from sensors, lidars, radars and cameras is quite computationally\nintensive and can not be done with good accuracy using less capable onboard\nresources. In order to deal with this problem, some computation requirements\n(also referred as tasks) are offloaded to infrastructure or executed in\nparallel in both autonomous vehicle (AV) and infrastructure to enhance\naccuracy. The infrastructure comprises base stations, a centralized cloud, and\na CS. Base stations (BSs) execute tasks in collaboration with a significantly\nmore powerful centralized cloud, while the centralised scheduler (CS) centrally\nschedules all the tasks. The base station receives tasks from multiple AVs,\neach with varying deadlines, criticality, and locations. Our main goal is to\nmaximize the profit of the infrastructure by (a) minimizing the number of drop\ntasks, (b) minimizing the distance cost for task offloading, and (c) minimizing\nthe energy usage of BSs.\n  In this work, we proposed efficient approaches to schedule the collection of\ntasks to the BSs, by employing a hybrid scheduling approach where tasks from\nAVs get allocated to nearby base stations if the nearby BSs are lightly loaded,\notherwise AVs send the task to CS for allocation. The CS maximizes the profit\nby following strategies: (a) selection of BS considering distance and energy\nconsumption, (b) when task load is moderate or low, highly critical tasks run\nat favourable utilisation, and (c) low-critical tasks are dropped to free up\nresources for executing high-critical tasks. Based on our experiments, proposed\napproaches improved the QoS provided by up to 25% compared to the\nstate-of-the-art approach in real-life datasets.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}