{"id":"2407.08432","title":"Subgroup-Specific Risk-Controlled Dose Estimation in Radiotherapy","authors":"Paul Fischer, Hannah Willms, Moritz Schneider, Daniela Thorwarth,\n  Michael Muehlebach, Christian F. Baumgartner","authorsParsed":[["Fischer","Paul",""],["Willms","Hannah",""],["Schneider","Moritz",""],["Thorwarth","Daniela",""],["Muehlebach","Michael",""],["Baumgartner","Christian F.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 12:12:55 GMT"}],"updateDate":"2024-07-12","timestamp":1720699975000,"abstract":"  Cancer remains a leading cause of death, highlighting the importance of\neffective radiotherapy (RT). Magnetic resonance-guided linear accelerators\n(MR-Linacs) enable imaging during RT, allowing for inter-fraction, and perhaps\neven intra-fraction, adjustments of treatment plans. However, achieving this\nrequires fast and accurate dose calculations. While Monte Carlo simulations\noffer accuracy, they are computationally intensive. Deep learning frameworks\nshow promise, yet lack uncertainty quantification crucial for high-risk\napplications like RT. Risk-controlling prediction sets (RCPS) offer\nmodel-agnostic uncertainty quantification with mathematical guarantees.\nHowever, we show that naive application of RCPS may lead to only certain\nsubgroups such as the image background being risk-controlled. In this work, we\nextend RCPS to provide prediction intervals with coverage guarantees for\nmultiple subgroups with unknown subgroup membership at test time. We evaluate\nour algorithm on real clinical planing volumes from five different anatomical\nregions and show that our novel subgroup RCPS (SG-RCPS) algorithm leads to\nprediction intervals that jointly control the risk for multiple subgroups. In\nparticular, our method controls the risk of the crucial voxels along the\nradiation beam significantly better than conventional RCPS.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}