{"id":"2407.00090","title":"Fickian Insights Using Probability Theory as Logic","authors":"Peter E. Price Jr","authorsParsed":[["Price","Peter E.","Jr"]],"versions":[{"version":"v1","created":"Tue, 25 Jun 2024 19:12:43 GMT"}],"updateDate":"2024-07-02","timestamp":1719342763000,"abstract":"  In Clearing Up Mysteries -- The Original Goal (Maximum Entropy and Bayesian\nMethods: Cambridge, England, 1988 Springer, pp. 1-27) Jaynes derived Fick's Law\nfor a dilute binary solution from Bayes' Theorem by considering,\nprobabilistically, the motion of dilute solute molecules. Modifying Jaynes'\nprior, changing the frame of reference, and allowing for multicomponent\nsystems, one can follow Jaynes' logic to arrive at several expressions for the\ndiffusion coefficient that are widely used in application to solvent-polymer\nsystems. These results, however, do not generally satisfy required conditions\nover the full concentration range. This limitation is resolved by considering\nthe joint motion of all components in the solution with the inclusion of known\nphysical constraints. Doing so, one arrives at a new set of constitutive\nequations for binary and multicomponent diffusion that include Darken's form as\na limit and provide means to characterize inter-species correlations, removing\nthe need for the ad hoc modifications of the thermodynamic term or substitution\nof bulk compositions with local compositions that have been proposed in the\nliterature. In binary systems, the Bayesian expression for the mutual diffusion\ncoefficient provides explicit limits on non-ideal mutual diffusion behavior,\ngiven component self-diffusion coefficients, that can be attributed to\ninter-species correlation versus stronger intra- and inter-species clustering.\nApplications of the model to published data for a set of binary systems are\npresented, along with pointers to further directions for research.\n","subjects":["Condensed Matter/Statistical Mechanics","Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"VicM54ypWalpKAhB1FYMroPFxC2QiXopLF1jeab5qZU","pdfSize":"2686641","objectId":"0x535ee87408b65bf445e95e56dce573e965406d63d9602b3b9fdf7f3fc093ac59","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
