{"id":"2407.18157","title":"Enhanced Privacy Bound for Shuffle Model with Personalized Privacy","authors":"Yixuan Liu, Yuhan Liu, Li Xiong, Yujie Gu, Hong Chen","authorsParsed":[["Liu","Yixuan",""],["Liu","Yuhan",""],["Xiong","Li",""],["Gu","Yujie",""],["Chen","Hong",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 16:11:56 GMT"}],"updateDate":"2024-07-26","timestamp":1721923916000,"abstract":"  The shuffle model of Differential Privacy (DP) is an enhanced privacy\nprotocol which introduces an intermediate trusted server between local users\nand a central data curator. It significantly amplifies the central DP guarantee\nby anonymizing and shuffling the local randomized data. Yet, deriving a tight\nprivacy bound is challenging due to its complicated randomization protocol.\nWhile most existing work are focused on unified local privacy settings, this\nwork focuses on deriving the central privacy bound for a more practical setting\nwhere personalized local privacy is required by each user. To bound the privacy\nafter shuffling, we first need to capture the probability of each user\ngenerating clones of the neighboring data points. Second, we need to quantify\nthe indistinguishability between two distributions of the number of clones on\nneighboring datasets. Existing works either inaccurately capture the\nprobability, or underestimate the indistinguishability between neighboring\ndatasets. Motivated by this, we develop a more precise analysis, which yields a\ngeneral and tighter bound for arbitrary DP mechanisms. Firstly, we derive the\nclone-generating probability by hypothesis testing %from a randomizer-specific\nperspective, which leads to a more accurate characterization of the\nprobability. Secondly, we analyze the indistinguishability in the context of\n$f$-DP, where the convexity of the distributions is leveraged to achieve a\ntighter privacy bound. Theoretical and numerical results demonstrate that our\nbound remarkably outperforms the existing results in the literature.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/"}