{"id":"2407.03593","title":"Green Multigrid Network","authors":"Ye Lin, Young Ju Lee and Jiwei Jia","authorsParsed":[["Lin","Ye",""],["Lee","Young Ju",""],["Jia","Jiwei",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 03:02:10 GMT"}],"updateDate":"2024-07-08","timestamp":1720062130000,"abstract":"  GreenLearning networks (GL) directly learn Green's function in physical\nspace, making them an interpretable model for capturing unknown solution\noperators of partial differential equations (PDEs). For many PDEs, the\ncorresponding Green's function exhibits asymptotic smoothness. In this paper,\nwe propose a framework named Green Multigrid networks (GreenMGNet), an operator\nlearning algorithm designed for a class of asymptotically smooth Green's\nfunctions.\n  Compared with the pioneering GL, the new framework presents itself with\nbetter accuracy and efficiency, thereby achieving a significant improvement.\nGreenMGNet is composed of two technical novelties. First, Green's function is\nmodeled as a piecewise function to take into account its singular behavior in\nsome parts of the hyperplane. Such piecewise function is then approximated by a\nneural network with augmented output(AugNN) so that it can capture singularity\naccurately. Second, the asymptotic smoothness property of Green's function is\nused to leverage the Multi-Level Multi-Integration (MLMI) algorithm for both\nthe training and inference stages. Several test cases of operator learning are\npresented to demonstrate the accuracy and effectiveness of the proposed method.\nOn average, GreenMGNet achieves $3.8\\%$ to $39.15\\%$ accuracy improvement. To\nmatch the accuracy level of GL, GreenMGNet requires only about $10\\%$ of the\nfull grid data, resulting in a $55.9\\%$ and $92.5\\%$ reduction in training time\nand GPU memory cost for one-dimensional test problems, and a $37.7\\%$ and\n$62.5\\%$ reduction for two-dimensional test problems.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}