{"id":"2407.02767","title":"Comparison of Short-Range Order in GeSn Grown by Molecular Beam Epitaxy\n  and Chemical Vapor Deposition","authors":"Shang Liu, Yunfan Liang, Haochen Zhao, Nirosh M. Eldose, Jin-Hee Bae,\n  Omar Concepcion, Xiaochen Jin, Shunda Chen, Ilias Bikmukhametov, Austin Akey,\n  Cory T. Cline, Alejandra Cuervo Covian, Xiaoxin Wang, Tianshu Li, Yuping\n  Zeng, Dan Buca, Shui-Qing Yu, Gregory J. Salamo, Shengbai Zhang, Jifeng Liu","authorsParsed":[["Liu","Shang",""],["Liang","Yunfan",""],["Zhao","Haochen",""],["Eldose","Nirosh M.",""],["Bae","Jin-Hee",""],["Concepcion","Omar",""],["Jin","Xiaochen",""],["Chen","Shunda",""],["Bikmukhametov","Ilias",""],["Akey","Austin",""],["Cline","Cory T.",""],["Covian","Alejandra Cuervo",""],["Wang","Xiaoxin",""],["Li","Tianshu",""],["Zeng","Yuping",""],["Buca","Dan",""],["Yu","Shui-Qing",""],["Salamo","Gregory J.",""],["Zhang","Shengbai",""],["Liu","Jifeng",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 02:52:09 GMT"}],"updateDate":"2024-07-04","timestamp":1719975129000,"abstract":"  Atomic short-range order (SRO) in direct-bandgap GeSn for infrared photonics\nhas recently attracted attention due to its notable impact on band structures.\nHowever, the SRO in GeSn thin films grown by different methods have hardly been\ncompared. This paper compares SRO in GeSn thin films of similar compositions\ngrown by molecular beam epitaxy (MBE) and chemical vapor deposition (CVD) using\natom probe tomography. An $\\sim$15% stronger preference for Sn-Sn 1$^{st}$\nnearest neighbor (1NN) is observed in MBE GeSn than CVD GeSn for both thin film\nand quantum well samples with Sn composition ranging from 7 to 20%.\nInterestingly, samples grown by different deposition tools under the same\nmethod (either MBE or CVD) showed remarkable consistency in Sn-Sn 1NN SRO,\nwhile MBE vs. CVD showed clear differences. Supported by theoretical modeling,\nwe consider that this difference in SRO originates from the impact of surface\ntermination, where MBE surfaces are exposed to ultrahigh vacuum while CVD\nsurfaces are terminated by H to a good extent. This finding not only suggests\nengineering surface termination or surfactants during the growth as a potential\napproach to control SRO in GeSn, but also provides insight into the underlying\nreasons for very different growth temperature between MBE and CVD that directly\nimpact the strain relaxation behavior.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}