{"id":"2407.16947","title":"Subspace Constrained Variational Bayesian Inference for Structured\n  Compressive Sensing with a Dynamic Grid","authors":"An Liu, Yufan Zhou, Wenkang Xu","authorsParsed":[["Liu","An",""],["Zhou","Yufan",""],["Xu","Wenkang",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 02:30:21 GMT"}],"updateDate":"2024-07-25","timestamp":1721788221000,"abstract":"  We investigate the problem of recovering a structured sparse signal from a\nlinear observation model with an uncertain dynamic grid in the sensing matrix.\nThe state-of-the-art expectation maximization based compressed sensing (EM-CS)\nmethods, such as turbo compressed sensing (Turbo-CS) and turbo variational\nBayesian inference (Turbo-VBI), have a relatively slow convergence speed due to\nthe double-loop iterations between the E-step and M-step. Moreover, each inner\niteration in the E-step involves a high-dimensional matrix inverse in general,\nwhich is unacceptable for problems with large signal dimensions or real-time\ncalculation requirements. Although there are some attempts to avoid the\nhigh-dimensional matrix inverse by majorization minimization, the convergence\nspeed and accuracy are often sacrificed. To better address this problem, we\npropose an alternating estimation framework based on a novel subspace\nconstrained VBI (SC-VBI) method, in which the high-dimensional matrix inverse\nis replaced by a low-dimensional subspace constrained matrix inverse (with the\ndimension equal to the sparsity level). We further prove the convergence of the\nSC-VBI to a stationary solution of the Kullback-Leibler divergence minimization\nproblem. Simulations demonstrate that the proposed SC-VBI algorithm can achieve\na much better tradeoff between complexity per iteration, convergence speed, and\nperformance compared to the state-of-the-art algorithms.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}