{"id":"2407.16883","title":"A Standardized Machine-readable Dataset Documentation Format for\n  Responsible AI","authors":"Nitisha Jain, Mubashara Akhtar, Joan Giner-Miguelez, Rajat Shinde,\n  Joaquin Vanschoren, Steffen Vogler, Sujata Goswami, Yuhan Rao, Tim Santos,\n  Luis Oala, Michalis Karamousadakis, Manil Maskey, Pierre Marcenac, Costanza\n  Conforti, Michael Kuchnik, Lora Aroyo, Omar Benjelloun, Elena Simperl","authorsParsed":[["Jain","Nitisha",""],["Akhtar","Mubashara",""],["Giner-Miguelez","Joan",""],["Shinde","Rajat",""],["Vanschoren","Joaquin",""],["Vogler","Steffen",""],["Goswami","Sujata",""],["Rao","Yuhan",""],["Santos","Tim",""],["Oala","Luis",""],["Karamousadakis","Michalis",""],["Maskey","Manil",""],["Marcenac","Pierre",""],["Conforti","Costanza",""],["Kuchnik","Michael",""],["Aroyo","Lora",""],["Benjelloun","Omar",""],["Simperl","Elena",""]],"versions":[{"version":"v1","created":"Tue, 4 Jun 2024 16:40:14 GMT"}],"updateDate":"2024-07-25","timestamp":1717519214000,"abstract":"  Data is critical to advancing AI technologies, yet its quality and\ndocumentation remain significant challenges, leading to adverse downstream\neffects (e.g., potential biases) in AI applications. This paper addresses these\nissues by introducing Croissant-RAI, a machine-readable metadata format\ndesigned to enhance the discoverability, interoperability, and trustworthiness\nof AI datasets. Croissant-RAI extends the Croissant metadata format and builds\nupon existing responsible AI (RAI) documentation frameworks, offering a\nstandardized set of attributes and practices to facilitate community-wide\nadoption. Leveraging established web-publishing practices, such as Schema.org,\nCroissant-RAI enables dataset users to easily find and utilize RAI metadata\nregardless of the platform on which the datasets are published. Furthermore, it\nis seamlessly integrated into major data search engines, repositories, and\nmachine learning frameworks, streamlining the reading and writing of\nresponsible AI metadata within practitioners' existing workflows. Croissant-RAI\nwas developed through a community-led effort. It has been designed to be\nadaptable to evolving documentation requirements and is supported by a Python\nlibrary and a visual editor.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Databases","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}