{"id":"2407.14429","title":"Dataset Distillation in Medical Imaging: A Feasibility Study","authors":"Muyang Li, Can Cui, Quan Liu, Ruining Deng, Tianyuan Yao, Marilyn\n  Lionts, Yuankai Huo","authorsParsed":[["Li","Muyang",""],["Cui","Can",""],["Liu","Quan",""],["Deng","Ruining",""],["Yao","Tianyuan",""],["Lionts","Marilyn",""],["Huo","Yuankai",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:59:04 GMT"}],"updateDate":"2024-07-22","timestamp":1721404744000,"abstract":"  Data sharing in the medical image analysis field has potential yet remains\nunderappreciated. The aim is often to share datasets efficiently with other\nsites to train models effectively. One possible solution is to avoid\ntransferring the entire dataset while still achieving similar model\nperformance. Recent progress in data distillation within computer science\noffers promising prospects for sharing medical data efficiently without\nsignificantly compromising model effectiveness. However, it remains uncertain\nwhether these methods would be applicable to medical imaging, since medical and\nnatural images are distinct fields. Moreover, it is intriguing to consider what\nlevel of performance could be achieved with these methods. To answer these\nquestions, we conduct investigations on a variety of leading data distillation\nmethods, in different contexts of medical imaging. We evaluate the feasibility\nof these methods with extensive experiments in two aspects: 1) Assess the\nimpact of data distillation across multiple datasets characterized by minor or\ngreat variations. 2) Explore the indicator to predict the distillation\nperformance. Our extensive experiments across multiple medical datasets reveal\nthat data distillation can significantly reduce dataset size while maintaining\ncomparable model performance to that achieved with the full dataset, suggesting\nthat a small, representative sample of images can serve as a reliable indicator\nof distillation success. This study demonstrates that data distillation is a\nviable method for efficient and secure medical data sharing, with the potential\nto facilitate enhanced collaborative research and clinical applications.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}