{"id":"2407.01267","title":"Generalized Orbicular (m,n,o) T-Spherical Fuzzy Sets with Hamacher\n  Aggregation Operators and Application to Multi-Criteria Group Decision Making","authors":"Yasir Akhtar, Mehboob Ali, Miin-Shen Yang","authorsParsed":[["Akhtar","Yasir",""],["Ali","Mehboob",""],["Yang","Miin-Shen",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:19:47 GMT"}],"updateDate":"2024-07-02","timestamp":1719839987000,"abstract":"  This paper introduces a novel approach to enhance uncertainty representation,\noffering decision-makers a more comprehensive perspective for improved\ndecision-making outcomes. We propose Generalized Orbicular (m,n,o) T-Spherical\nFuzzy Set (GO-TSFS), a flexible extension of existing fuzzy set models\nincluding Globular T-spherical fuzzy sets (G-TSFSs), T-spherical fuzzy sets\n(T-SFSs), (p,q,r) Spherical fuzzy sets, and (p,q) Quasirung orthopair fuzzy\nsets (QOFSs). The framework employs three adjustable parameters m, n, and o to\nfinely tune the influence of membership degrees, allowing for adaptable\nweighting of various degrees of membership. By utilizing spheres to represent\nmembership, indeterminacy, and non-membership levels, the model enhances\naccuracy in depicting vague, ambiguous, and imprecise data. Building upon the\nfoundation of GO-TSFSs, we introduce essential set operations and algebraic\noperations for GO-TSF Values (GO-TSFVs). Moreover, we also develop score\nfunctions, accuracy functions, and basic distance measures such as Hamming and\nEuclidean distances to further enhance the analytical capabilities of the\nframework. Additionally, we propose GO-TSF Hamacher Weighted Averaging\n(GO-TSFHWA) and GO-TSFH Weighted Geometric (GO-TSFHWG), aggregation operators\ntailored for our proposed sets. To demonstrate the practical applicability of\nour approach, we apply our proposed aggregation operators namely GO-TSFHWA and\nGO-TSFHWG to solve a Multi-Criteria Group Decision Making (MCGDM) problem,\nspecifically for selecting the most suitable e-commerce online shopping\nplatform from the top-rated options. Sensitivity analysis is also conducted to\nvalidate the reliability and efficacy of our results, affirming the utility and\nrobustness of the proposed methodology in real-world decision-making scenarios.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rUOVko1N-Onp_iAj3BXzWwGRLTExR9NGRPHkCbs-7TI","pdfSize":"2960233"}
