{"id":"2407.13220","title":"MEDIC: Zero-shot Music Editing with Disentangled Inversion Control","authors":"Huadai Liu, Jialei Wang, Rongjie Huang, Yang Liu, Jiayang Xu, Zhou\n  Zhao","authorsParsed":[["Liu","Huadai",""],["Wang","Jialei",""],["Huang","Rongjie",""],["Liu","Yang",""],["Xu","Jiayang",""],["Zhao","Zhou",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 07:05:43 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 11:29:51 GMT"}],"updateDate":"2024-08-21","timestamp":1721286343000,"abstract":"  Text-guided diffusion models catalyze a paradigm shift in audio generation,\nfacilitating the adaptability of source audio to conform to specific textual\nprompts. Recent advancements introduce inversion techniques, like DDIM\ninversion, to zero-shot editing, exploiting pre-trained diffusion models for\naudio modification. Nonetheless, our investigation exposes that DDIM inversion\nsuffers from an accumulation of errors across each diffusion step, undermining\nits efficacy. And the lack of attention control hinders the fine-grained\nmanipulations of music. To counteract these limitations, we introduce the\n\\textit{Disentangled Inversion} technique, which is designed to disentangle the\ndiffusion process into triple branches, thereby magnifying their individual\ncapabilities for both precise editing and preservation. Furthermore, we propose\nthe \\textit{Harmonized Attention Control} framework, which unifies the mutual\nself-attention and cross-attention with an additional Harmonic Branch to\nachieve the desired composition and structural information in the target music.\nCollectively, these innovations comprise the \\textit{Disentangled Inversion\nControl (DIC)} framework, enabling accurate music editing whilst safeguarding\nstructural integrity. To benchmark audio editing efficacy, we introduce\n\\textit{ZoME-Bench}, a comprehensive music editing benchmark hosting 1,100\nsamples spread across 10 distinct editing categories, which facilitates both\nzero-shot and instruction-based music editing tasks. Our method demonstrates\nunparalleled performance in edit fidelity and essential content preservation,\noutperforming contemporary state-of-the-art inversion techniques.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Sound"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"8WayDDTlOO7a5zioZ7fzuxySzkk3ju-UueNRk4crjM0","pdfSize":"7290038"}
