{"id":"2407.18360","title":"Organizational Effectiveness: A New Strategy to Leverage Multisite\n  Randomized Trials for Valid Assessment","authors":"Guanglei Hong (University of Chicago), Jonah Deutsch (Mathematica),\n  Peter Kress (Mathematica), Jose Eos Trinidad (University of\n  California-Berkeley), Zhengyan Xu (University of Pennsylvania)","authorsParsed":[["Hong","Guanglei","","University of Chicago"],["Deutsch","Jonah","","Mathematica"],["Kress","Peter","","Mathematica"],["Trinidad","Jose Eos","","University of\n  California-Berkeley"],["Xu","Zhengyan","","University of Pennsylvania"]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 19:50:33 GMT"}],"updateDate":"2024-07-29","timestamp":1721937033000,"abstract":"  In education, health, and human services, an intervention program is usually\nimplemented by many local organizations. Determining which organizations are\nmore effective is essential for theoretically characterizing effective\npractices and for intervening to enhance the capacity of ineffective\norganizations. In multisite randomized trials, site-specific intention-to-treat\n(ITT) effects are likely invalid indicators for organizational effectiveness\nand may lead to inequitable decisions. This is because sites differ in their\nlocal ecological conditions including client composition, alternative programs,\nand community context. Applying the potential outcomes framework, this study\nproposes a mathematical definition for the relative effectiveness of an\norganization. The estimand contrasts the performance of a focal organization\nwith those that share the features of its local ecological conditions. The\nidentification relies on relatively weak assumptions by leveraging observed\ncontrol group outcomes that capture the confounding impacts of alternative\nprograms and community context. We propose a two-step mixed-effects modeling\n(2SME) procedure. Simulations demonstrate significant improvements when\ncompared with site-specific ITT analyses or analyses that only adjust for\nbetween-site differences in the observed baseline participant composition. We\nillustrate its use through an evaluation of the relative effectiveness of\nindividual Job Corps centers by reanalyzing data from the National Job Corps\nStudy, a multisite randomized trial that included 100 Job Corps centers\nnationwide serving disadvantaged youths. The new strategy promises to alleviate\nconsequential misclassifications of some of the most effective Job Corps\ncenters as least effective and vice versa.\n","subjects":["Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}