{"id":"2407.14242","title":"Continual Panoptic Perception: Towards Multi-modal Incremental\n  Interpretation of Remote Sensing Images","authors":"Bo Yuan, Danpei Zhao, Zhuoran Liu, Wentao Li, Tian Li","authorsParsed":[["Yuan","Bo",""],["Zhao","Danpei",""],["Liu","Zhuoran",""],["Li","Wentao",""],["Li","Tian",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 12:22:32 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 13:30:33 GMT"}],"updateDate":"2024-07-26","timestamp":1721391752000,"abstract":"  Continual learning (CL) breaks off the one-way training manner and enables a\nmodel to adapt to new data, semantics and tasks continuously. However, current\nCL methods mainly focus on single tasks. Besides, CL models are plagued by\ncatastrophic forgetting and semantic drift since the lack of old data, which\noften occurs in remote-sensing interpretation due to the intricate fine-grained\nsemantics. In this paper, we propose Continual Panoptic Perception (CPP), a\nunified continual learning model that leverages multi-task joint learning\ncovering pixel-level classification, instance-level segmentation and\nimage-level perception for universal interpretation in remote sensing images.\nConcretely, we propose a collaborative cross-modal encoder (CCE) to extract the\ninput image features, which supports pixel classification and caption\ngeneration synchronously. To inherit the knowledge from the old model without\nexemplar memory, we propose a task-interactive knowledge distillation (TKD)\nmethod, which leverages cross-modal optimization and task-asymmetric\npseudo-labeling (TPL) to alleviate catastrophic forgetting. Furthermore, we\nalso propose a joint optimization mechanism to achieve end-to-end multi-modal\npanoptic perception. Experimental results on the fine-grained panoptic\nperception dataset validate the effectiveness of the proposed model, and also\nprove that joint optimization can boost sub-task CL efficiency with over 13\\%\nrelative improvement on panoptic quality.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}