{"id":"2407.09094","title":"Beyond Image Prior: Embedding Noise Prior into Conditional Denoising\n  Transformer","authors":"Yuanfei Huang and Hua Huang","authorsParsed":[["Huang","Yuanfei",""],["Huang","Hua",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 08:43:11 GMT"}],"updateDate":"2024-07-15","timestamp":1720773791000,"abstract":"  Existing learning-based denoising methods typically train models to\ngeneralize the image prior from large-scale datasets, suffering from the\nvariability in noise distributions encountered in real-world scenarios. In this\nwork, we propose a new perspective on the denoising challenge by highlighting\nthe distinct separation between noise and image priors. This insight forms the\nbasis for our development of conditional optimization framework, designed to\novercome the constraints of traditional denoising framework. To this end, we\nintroduce a Locally Noise Prior Estimation (LoNPE) algorithm, which accurately\nestimates the noise prior directly from a single raw noisy image. This\nestimation acts as an explicit prior representation of the camera sensor's\nimaging environment, distinct from the image prior of scenes. Additionally, we\ndesign an auxiliary learnable LoNPE network tailored for practical application\nto sRGB noisy images. Leveraging the estimated noise prior, we present a novel\nConditional Denoising Transformer (Condformer), by incorporating the noise\nprior into a conditional self-attention mechanism. This integration allows the\nCondformer to segment the optimization process into multiple explicit\nsubspaces, significantly enhancing the model's generalization and flexibility.\nExtensive experimental evaluations on both synthetic and real-world datasets,\ndemonstrate that the proposed method achieves superior performance over current\nstate-of-the-art methods. The source code is available at\nhttps://github.com/YuanfeiHuang/Condformer.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}