{"id":"2407.02556","title":"Carbon and Iron Deficiencies in Quiescent Galaxies at z=1-3 from\n  JWST-SUSPENSE: Implications for the Formation Histories of Massive Galaxies","authors":"Aliza G. Beverage, Martje Slob, Mariska Kriek, Charlie Conroy,\n  Guillermo Barro, Rachel Bezanson, Gabriel Brammer, Chloe M. Cheng, Anna de\n  Graaff, Natascha M. F\\\"orster Schreiber, Marijn Franx, Brian Lorenz, Pavel E.\n  Mancera Pi\\~na, Danilo Marchesini, Adam Muzzin, Andrew B. Newman, Sedona H.\n  Price, Alice E. Shapley, Mauro Stefanon, Katherine A. Suess, Pieter van\n  Dokkum, David Weinberg, Daniel R. Weisz","authorsParsed":[["Beverage","Aliza G.",""],["Slob","Martje",""],["Kriek","Mariska",""],["Conroy","Charlie",""],["Barro","Guillermo",""],["Bezanson","Rachel",""],["Brammer","Gabriel",""],["Cheng","Chloe M.",""],["de Graaff","Anna",""],["Schreiber","Natascha M. Förster",""],["Franx","Marijn",""],["Lorenz","Brian",""],["Piña","Pavel E. Mancera",""],["Marchesini","Danilo",""],["Muzzin","Adam",""],["Newman","Andrew B.",""],["Price","Sedona H.",""],["Shapley","Alice E.",""],["Stefanon","Mauro",""],["Suess","Katherine A.",""],["van Dokkum","Pieter",""],["Weinberg","David",""],["Weisz","Daniel R.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-04","timestamp":1719943200000,"abstract":"  We present the stellar metallicities and multi-element abundances (C, Mg, Si,\nCa, Ti, Cr, and Fe) of 15 massive (log M/M$_\\odot$=10.2-11.2) quiescent\ngalaxies at z=1-3, derived from ultradeep JWST-SUSPENSE spectra. Compared to\nquiescent galaxies at z~0, these galaxies exhibit a deficiency of 0.25 dex in\n[C/H], 0.16 dex in [Fe/H], and 0.07 dex in [Mg/H], implying rapid formation and\nquenching before significant enrichment from asymptotic giant branch stars and\nType Ia supernovae. Additionally, we find that galaxies that form at higher\nredshift have higher [Mg/Fe] and lower [Fe/H] and [Mg/H], irrespective of their\nobserved redshift. The evolution in [Fe/H] and [C/H] is therefore primarily\nexplained by lower redshift samples naturally including galaxies with longer\nstar-formation timescales. On the other hand, the lower [Mg/H] can be explained\nby galaxies forming at earlier epochs expelling larger gas reservoirs during\ntheir quenching phase. Consequently, the mass-metallicity relation, primarily\nreflecting [Mg/H], is also lower at z=1-3 compared to the lower redshift\nrelation, though the slopes are similar. Finally, we compare our results to\nstandard stellar population modeling approaches employing solar abundance\npatterns and non-parametric star-formation histories (using Prospector). Our\nSSP-equivalent ages agree with the mass-weighted ages from Prospector, while\nthe metallicities disagree significantly. Nonetheless, the metallicities better\nreflect [Fe/H] than total [Z/H]. We also find that star-formation timescales\ninferred from elemental abundances are significantly shorter than those from\nProspector, and we discuss the resulting implications for the early formation\nof massive galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}