{"id":"2407.00315","title":"Learning Unsupervised Gaze Representation via Eye Mask Driven\n  Information Bottleneck","authors":"Yangzhou Jiang, Yinxin Lin, Yaoming Wang, Teng Li, Bilian Ke, Bingbing\n  Ni","authorsParsed":[["Jiang","Yangzhou",""],["Lin","Yinxin",""],["Wang","Yaoming",""],["Li","Teng",""],["Ke","Bilian",""],["Ni","Bingbing",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 04:35:08 GMT"}],"updateDate":"2024-07-02","timestamp":1719635708000,"abstract":"  Appearance-based supervised methods with full-face image input have made\ntremendous advances in recent gaze estimation tasks. However, intensive human\nannotation requirement inhibits current methods from achieving industrial level\naccuracy and robustness. Although current unsupervised pre-training frameworks\nhave achieved success in many image recognition tasks, due to the deep coupling\nbetween facial and eye features, such frameworks are still deficient in\nextracting useful gaze features from full-face. To alleviate above limitations,\nthis work proposes a novel unsupervised/self-supervised gaze pre-training\nframework, which forces the full-face branch to learn a low dimensional gaze\nembedding without gaze annotations, through collaborative feature contrast and\nsqueeze modules. In the heart of this framework is an alternating\neye-attended/unattended masking training scheme, which squeezes gaze-related\ninformation from full-face branch into an eye-masked auto-encoder through an\ninjection bottleneck design that successfully encourages the model to pays more\nattention to gaze direction rather than facial textures only, while still\nadopting the eye self-reconstruction objective. In the same time, a novel\neye/gaze-related information contrastive loss has been designed to further\nboost the learned representation by forcing the model to focus on eye-centered\nregions. Extensive experimental results on several gaze benchmarks demonstrate\nthat the proposed scheme achieves superior performances over unsupervised\nstate-of-the-art.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}