{"id":"2407.20832","title":"Multi-Fidelity Bayesian Optimisation of Wind Farm Wake Steering using\n  Wake Models and Large Eddy Simulations","authors":"Andrew Mole and Sylvain Laizet","authorsParsed":[["Mole","Andrew",""],["Laizet","Sylvain",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 14:03:56 GMT"}],"updateDate":"2024-07-31","timestamp":1722348236000,"abstract":"  Improving the power output from wind farms is vital in transitioning to\nrenewable electricity generation. However, in wind farms, wind turbines often\noperate in the wake of other turbines, leading to a reduction in the wind speed\nand the resulting power output whilst also increasing fatigue. By using wake\nsteering strategies to control the wake behind each turbine, the total wind\nfarm power output can be increased. To find optimal yaw configurations,\ntypically analytical wake models have been utilised to model the interactions\nbetween the wind turbines through the flow field. In this work we show that,\nfor full wind farms, higher-fidelity computational fluid dynamics simulations,\nin the form of large eddy simulations, are able to find more optimal yaw\nconfigurations than analytical wake models. This is because they capture and\nexploit more of the physics involved in the interactions between the multiple\nturbine wakes and the atmospheric boundary layer. As large eddy simulations are\nmuch more expensive to run than analytical wake models, a multi-fidelity\nBayesian optimisation framework is introduced. This implements a multi-fidelity\nsurrogate model, that is able to capture the non-linear relationship between\nthe analytical wake models and the large eddy simulations, and a multi-fidelity\nacquisition function to determine the configuration and fidelity of each\noptimisation iteration. This allows for fewer configurations to be evaluated\nwith the more expensive large eddy simulations than a single-fidelity\noptimisation, whilst producing comparable optimisation results. The same total\nwind farm power improvements can then be found for a reduced computational\ncost.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}