{"id":"2407.02561","title":"Constraints on real space representations of Chern bands","authors":"Qingchen Li, Junkai Dong, Patrick J. Ledwith, and Eslam Khalaf","authorsParsed":[["Li","Qingchen",""],["Dong","Junkai",""],["Ledwith","Patrick J.",""],["Khalaf","Eslam",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 18:00:01 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 00:16:35 GMT"}],"updateDate":"2024-07-25","timestamp":1719943201000,"abstract":"  A Chern band is characterized by a Wannier obstruction indicating the absence\nof a basis of complete, orthogonal, and exponentially-localized states. Here,\nwe study the properties of real space bases of a Chern band obtained by\nrelaxing either exponential localization or orthogonality and completeness.\nThis yields two distinct real space representations of a band with Chern number\n$C$: (i) a basis of complete orthogonal Wannier states which decay as power-law\nand (ii) a basis of exponentially-localized overcomplete non-orthogonal\ncoherent states. For (i), we show that the power-law tail only depends on the\nChern number and provide an explicit gauge choice leading to the universal\nasymptotic $w({\\boldsymbol r}) \\approx \\frac{C e^{-i C \\varphi_{\\boldsymbol\nr}}}{2\\pi |{\\boldsymbol r}|^2}$ up to a normalized Bloch-periodic spinor. For\n(ii), we prove a rigorous lower bound on the spatial spread that can always be\nsaturated for ideal bands. We provide an explicit construction of the maximally\nlocalized coherent state by mapping the problem to a dual Landau level problem\nwhere the Berry curvature and trace of the quantum metric take the roles of an\neffective magnetic field and scalar potential, respectively. Our coherent state\nresult rigorously bounds the spatial spread of any localized state constructed\nas a linear superposition of wavefunctions within the Chern band. Remarkably,\nwe find that such bound does not generically scale with the Chern number and\nprovide an explicit example of an exponentially localized state in a Chern $C$\nband whose size does not increase with $|C|$. Our results show that band\ntopology can be encoded in a real space description and set the stage for a\nsystematic study of interaction effects in topological bands in real space.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iCKN0sHaX-h9-jxjgik84YiwBZ7C0DRD65ptwJa60WQ","pdfSize":"2069133"}
