{"id":"2407.13147","title":"DFMSD: Dual Feature Masking Stage-wise Knowledge Distillation for Object\n  Detection","authors":"Zhourui Zhang, Jun Li, Zhijian Wu, Jifeng Shen, Jianhua Xu","authorsParsed":[["Zhang","Zhourui",""],["Li","Jun",""],["Wu","Zhijian",""],["Shen","Jifeng",""],["Xu","Jianhua",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 04:19:14 GMT"}],"updateDate":"2024-07-19","timestamp":1721276354000,"abstract":"  In recent years, current mainstream feature masking distillation methods\nmainly function by reconstructing selectively masked regions of a student\nnetwork from the feature maps of a teacher network. In these methods, attention\nmechanisms can help to identify spatially important regions and crucial\nobject-aware channel clues, such that the reconstructed features are encoded\nwith sufficient discriminative and representational power similar to teacher\nfeatures. However, previous feature-masking distillation methods mainly address\nhomogeneous knowledge distillation without fully taking into account the\nheterogeneous knowledge distillation scenario. In particular, the huge\ndiscrepancy between the teacher and the student frameworks within the\nheterogeneous distillation paradigm is detrimental to feature masking, leading\nto deteriorating reconstructed student features. In this study, a novel dual\nfeature-masking heterogeneous distillation framework termed DFMSD is proposed\nfor object detection. More specifically, a stage-wise adaptation learning\nmodule is incorporated into the dual feature-masking framework, and thus the\nstudent model can be progressively adapted to the teacher models for bridging\nthe gap between heterogeneous networks. Furthermore, a masking enhancement\nstrategy is combined with stage-wise learning such that object-aware masking\nregions are adaptively strengthened to improve feature-masking reconstruction.\nIn addition, semantic alignment is performed at each Feature Pyramid Network\n(FPN) layer between the teacher and the student networks for generating\nconsistent feature distributions. Our experiments for the object detection task\ndemonstrate the promise of our approach, suggesting that DFMSD outperforms both\nthe state-of-the-art heterogeneous and homogeneous distillation methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}