{"id":"2407.00190","title":"Origin of the Anisotropic Beer-Lambert Law from Dichroism and\n  Birefringence in $\\beta$-Ga$_2$O$_3$","authors":"Md Mohsinur Rahman Adnan, Mathias Schubert, Roberto C. Myers","authorsParsed":[["Adnan","Md Mohsinur Rahman",""],["Schubert","Mathias",""],["Myers","Roberto C.",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 19:00:14 GMT"}],"updateDate":"2024-07-02","timestamp":1719601214000,"abstract":"  The anisotropic optical absorption edge of $\\beta$-Ga$_2$O$_3$ follows a\nmodified Beer-Lambert law having two effective absorption coefficients. The\nabsorption coefficient of linearly polarized light reduces to the least\nabsorbing direction beyond a critical penetration depth, which itself depends\non polarization and wavelength. To understand this behavior, a Stokes vector\nanalysis is performed to track the polarization state as a function of depth.\nThe weakening of the absorption coefficient is associated with a gradual shift\nof linear polarization to the least absorbing crystallographic direction in the\nplane, which is along the a-exciton within the (010) plane or along the\nb-exciton in the (001) plane. We show that strong linear dichroism near the\noptical absorption edge causes this shift in $\\beta$-Ga$_2$O$_3$, which arises\nfrom the anisotropy and spectral splitting of the physical absorbers i.e.,\nexcitons. The linear polarization shift is accompanied by a variation in the\nellipticity due to the birefringence of $\\beta$-Ga$_2$O$_3$. Analysis of the\nphase relationship between the incoming electric field to that at a certain\ndepth reveals the phase speed as an effective refractive index, which varies\nalong different crystallographic directions. The critical penetration depth is\nshown to be correlated with the depth at which the ellipticity is maximal.\nThus, the anisotropic Beer-Lambert law arises from the interplay of both the\ndichroic and birefringent properties of $\\beta$-Ga$_2$O$_3$.\n","subjects":["Condensed Matter/Materials Science","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}