{"id":"2407.00864","title":"BattOpt: Optimal Facility Planning for Electric Vehicle Battery\n  Recycling","authors":"Matthew Brun, Xu Andy Sun","authorsParsed":[["Brun","Matthew",""],["Sun","Xu Andy",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 00:17:12 GMT"}],"updateDate":"2024-07-02","timestamp":1719793032000,"abstract":"  The electric vehicle (EV) battery supply chain will face challenges in\nsourcing scarce, expensive minerals required for manufacturing and in disposing\nof hazardous retired batteries. Integrating recycling technology into the\nsupply chain has the potential to alleviate these issues; however, players in\nthe battery market must design investment plans for recycling facilities. In\nthis paper, we propose a two-stage stochastic optimization model for computing\nminimum cost recycling capacity decisions, in which retired batteries are\nrecycled and recovered materials are used to manufacture new batteries. The\nmodel is a separable concave minimization subject to linear constraints, a\nclass for which we design a new finitely convergent global optimization\nalgorithm based on piecewise linear approximation that solves up to 10x faster\nthan comparable algorithms. We propose an equivalent reformulation of the model\nthat reduces the total number of variables by introducing integrality\nconstraints. The reformulation can also be solved by our global algorithm with\ndrastically reduced solve times. We detail a cut grouping strategy for Benders'\ndecomposition in the second stage which improves convergence relative to\nsingle-cut and multi-cut implementations. To produce a set of second-stage\nscenarios, we design an approach for generating time-series projections for new\nbattery demand, retired battery supply, and material costs. Analysis of the\noptimal solutions shows that effective investment in recycling can reduce\nbattery manufacturing costs by 22% and reduce environmental impacts by up to\n7%.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}