{"id":"2407.09549","title":"How Stable is Stable Diffusion under Recursive InPainting (RIP)?","authors":"Javier Conde, Miguel Gonz\\'alez, Gonzalo Mart\\'inez, Fernando Moral,\n  Elena Merino-G\\'omez, Pedro Reviriego","authorsParsed":[["Conde","Javier",""],["González","Miguel",""],["Martínez","Gonzalo",""],["Moral","Fernando",""],["Merino-Gómez","Elena",""],["Reviriego","Pedro",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 14:15:59 GMT"}],"updateDate":"2024-07-23","timestamp":1719497759000,"abstract":"  Generative Artificial Intelligence image models have achieved outstanding\nperformance in text-to-image generation and other tasks, such as inpainting\nthat completes images with missing fragments. The performance of inpainting can\nbe accurately measured by taking an image, removing some fragments, performing\nthe inpainting to restore them, and comparing the results with the original\nimage. Interestingly, inpainting can also be applied recursively, starting from\nan image, removing some parts, applying inpainting to reconstruct the image,\nand then starting the inpainting process again on the reconstructed image, and\nso forth. This process of recursively applying inpainting can lead to an image\nthat is similar or completely different from the original one, depending on the\nfragments that are removed and the ability of the model to reconstruct them.\nIntuitively, stability, understood as the capability to recover an image that\nis similar to the original one even after many recursive inpainting operations,\nis a desirable feature and can be used as an additional performance metric for\ninpainting. The concept of stability is also being studied in the context of\nrecursive training of generative AI models with their own data. Recursive\ninpainting is an inference-only recursive process whose understanding may\ncomplement ongoing efforts to study the behavior of generative AI models under\ntraining recursion. In this paper, the impact of recursive inpainting is\nstudied for one of the most widely used image models: Stable Diffusion. The\nresults show that recursive inpainting can lead to image collapse, so ending\nwith a nonmeaningful image, and that the outcome depends on several factors\nsuch as the type of image, the size of the inpainting masks, and the number of\niterations.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LHCqT1ovYIId-b5oevuRpibbywAg5fYoviDCyscMf_Y","pdfSize":"49702112"}
