{"id":"2407.21142","title":"Candidate Distant Trans-Neptunian Objects Detected by the New Horizons\n  Subaru TNO Survey","authors":"Wesley C. Fraser, Simon B. Porter, Lowell Peltier, JJ Kavelaars, Anne\n  J. Verbiscer, Marc W. Buie, S. Alan Stern, John R. Spencer, Susan D.\n  Benecchi, Tsuyoshi Terai, Takashi Ito, Fumi Yoshida, David W. Gerdes, Kevin\n  J. Napier, Hsing Wen Lin, Stephen D. J. Gwyn, Hayden Smotherman, Sebastien\n  Fabbro, Kelsi N. Singer, Amanda M. Alexander, Ko Arimatsu, Maria E. Banks,\n  Veronica J. Bray, Mohamed Ramy El-Maarry, Chelsea L. Ferrell, Tetsuharu Fuse,\n  Florian Glass, Timothy R. Holt, Peng Hong, Ryo Ishimaru, Perianne E. Johnson,\n  Tod R. Lauer, Rodrigo Leiva, Patryk S. Lykawka, Raphael Marschall, Jorge I.\n  N\\'u\\~nez, Marc Postman, Eric Quirico, Alyssa R. Rhoden, Anna M. Simpson,\n  Paul Schenk, Michael F. Skrutskie, Andrew J. Steffl, Henry Throop","authorsParsed":[["Fraser","Wesley C.",""],["Porter","Simon B.",""],["Peltier","Lowell",""],["Kavelaars","JJ",""],["Verbiscer","Anne J.",""],["Buie","Marc W.",""],["Stern","S. Alan",""],["Spencer","John R.",""],["Benecchi","Susan D.",""],["Terai","Tsuyoshi",""],["Ito","Takashi",""],["Yoshida","Fumi",""],["Gerdes","David W.",""],["Napier","Kevin J.",""],["Lin","Hsing Wen",""],["Gwyn","Stephen D. J.",""],["Smotherman","Hayden",""],["Fabbro","Sebastien",""],["Singer","Kelsi N.",""],["Alexander","Amanda M.",""],["Arimatsu","Ko",""],["Banks","Maria E.",""],["Bray","Veronica J.",""],["El-Maarry","Mohamed Ramy",""],["Ferrell","Chelsea L.",""],["Fuse","Tetsuharu",""],["Glass","Florian",""],["Holt","Timothy R.",""],["Hong","Peng",""],["Ishimaru","Ryo",""],["Johnson","Perianne E.",""],["Lauer","Tod R.",""],["Leiva","Rodrigo",""],["Lykawka","Patryk S.",""],["Marschall","Raphael",""],["Núñez","Jorge I.",""],["Postman","Marc",""],["Quirico","Eric",""],["Rhoden","Alyssa R.",""],["Simpson","Anna M.",""],["Schenk","Paul",""],["Skrutskie","Michael F.",""],["Steffl","Andrew J.",""],["Throop","Henry",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 19:15:49 GMT"}],"updateDate":"2024-08-01","timestamp":1722366949000,"abstract":"  We report the detection of 239 trans-Neptunian Objects discovered through the\non-going New Horizons survey for distant minor bodies being performed with the\nHyper Suprime-Cam mosaic imager on the Subaru Telescope. These objects were\ndiscovered in images acquired with either the r2 or the recently commissioned\nEB-gri filter using shift and stack routines. Due to the extremely high stellar\ndensity of the search region down stream of the spacecraft, new machine\nlearning techniques had to be developed to manage the extremely high false\npositive rate of bogus candidates produced from the shift and stack routines.\nWe report discoveries as faint as r2$\\sim26.5$. We highlight an overabundance\nof objects found at heliocentric distances $R\\gtrsim70$~au compared to\nexpectations from modelling of the known outer Solar System. If confirmed,\nthese objects betray the presence of a heretofore unrecognized abundance of\ndistant objects that can help explain a number of other observations that\notherwise remain at odds with the known Kuiper Belt, including detections of\nserendipitous stellar occultations, and recent results from the Student Dust\nCounter on-board the New Horizons spacecraft.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}