{"id":"2407.08380","title":"Digital twins to alleviate the need for real field data in vision-based\n  vehicle speed detection systems","authors":"Antonio Hern\\'andez Mart\\'inez, Iv\\'an Garc\\'ia Daza, Carlos\n  Fern\\'andez L\\'opez, David Fern\\'andez Llorca","authorsParsed":[["Martínez","Antonio Hernández",""],["Daza","Iván García",""],["López","Carlos Fernández",""],["Llorca","David Fernández",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 10:41:20 GMT"}],"updateDate":"2024-07-12","timestamp":1720694480000,"abstract":"  Accurate vision-based speed estimation is much more cost-effective than\ntraditional methods based on radar or LiDAR. However, it is also challenging\ndue to the limitations of perspective projection on a discrete sensor, as well\nas the high sensitivity to calibration, lighting and weather conditions.\nInterestingly, deep learning approaches (which dominate the field of computer\nvision) are very limited in this context due to the lack of available data.\nIndeed, obtaining video sequences of real road traffic with accurate speed\nvalues associated with each vehicle is very complex and costly, and the number\nof available datasets is very limited. Recently, some approaches are focusing\non the use of synthetic data. However, it is still unclear how models trained\non synthetic data can be effectively applied to real world conditions. In this\nwork, we propose the use of digital-twins using CARLA simulator to generate a\nlarge dataset representative of a specific real-world camera. The synthetic\ndataset contains a large variability of vehicle types, colours, speeds,\nlighting and weather conditions. A 3D CNN model is trained on the digital twin\nand tested on the real sequences. Unlike previous approaches that generate\nmulti-camera sequences, we found that the gap between the the real and the\nvirtual conditions is a key factor in obtaining low speed estimation errors.\nEven with a preliminary approach, the mean absolute error obtained remains\nbelow 3km/h.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}