{"id":"2407.18906","title":"A Scalable Quantum Non-local Neural Network for Image Classification","authors":"Sparsh Gupta and Debanjan Konar and Vaneet Aggarwal","authorsParsed":[["Gupta","Sparsh",""],["Konar","Debanjan",""],["Aggarwal","Vaneet",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:58:57 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 02:22:05 GMT"}],"updateDate":"2024-08-23","timestamp":1722016737000,"abstract":"  Non-local operations play a crucial role in computer vision enabling the\ncapture of long-range dependencies through weighted sums of features across the\ninput, surpassing the constraints of traditional convolution operations that\nfocus solely on local neighborhoods. Non-local operations typically require\ncomputing pairwise relationships between all elements in a set, leading to\nquadratic complexity in terms of time and memory. Due to the high computational\nand memory demands, scaling non-local neural networks to large-scale problems\ncan be challenging. This article introduces a hybrid quantum-classical scalable\nnon-local neural network, referred to as Quantum Non-Local Neural Network\n(QNL-Net), to enhance pattern recognition. The proposed QNL-Net relies on\ninherent quantum parallelism to allow the simultaneous processing of a large\nnumber of input features enabling more efficient computations in\nquantum-enhanced feature space and involving pairwise relationships through\nquantum entanglement. We benchmark our proposed QNL-Net with other quantum\ncounterparts to binary classification with datasets MNIST and CIFAR-10. The\nsimulation findings showcase our QNL-Net achieves cutting-edge accuracy levels\nin binary image classification among quantum classifiers while utilizing fewer\nqubits.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Theory","Computing Research Repository/Machine Learning","Mathematics/Information Theory","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}