{"id":"2407.07646","title":"A Practical Guide to Transcranial Ultrasonic Stimulation from the\n  IFCN-endorsed ITRUSST Consortium","authors":"Keith R Murphy, Tulika Nandi, Benjamin Kop, Takahiro Osada, W Apoutou\n  N'Djin, Maximilian Lueckel, Kevin A Caulfield, Anton Fomenko, Hartwig R\n  Siebner, Yoshikazu Ugawa, Lennart Verhagen, Sven Bestmann, Eleanor Martin,\n  Kim Butts Pauly, Elsa Fouragnan, Til Ole Bergmann","authorsParsed":[["Murphy","Keith R",""],["Nandi","Tulika",""],["Kop","Benjamin",""],["Osada","Takahiro",""],["N'Djin","W Apoutou",""],["Lueckel","Maximilian",""],["Caulfield","Kevin A",""],["Fomenko","Anton",""],["Siebner","Hartwig R",""],["Ugawa","Yoshikazu",""],["Verhagen","Lennart",""],["Bestmann","Sven",""],["Martin","Eleanor",""],["Pauly","Kim Butts",""],["Fouragnan","Elsa",""],["Bergmann","Til Ole",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 13:28:02 GMT"}],"updateDate":"2024-07-11","timestamp":1720618082000,"abstract":"  Low-intensity Transcranial Ultrasonic Stimulation (TUS) is a non-invasive\nbrain stimulation technique enabling cortical and deep brain targeting with\nunprecedented spatial accuracy. Given the high rate of adoption by new users\nwith varying levels of expertise and interdisciplinary backgrounds, practical\nguidelines are needed to ensure state-of-the-art TUS application and\nreproducible outcomes. Therefore, the International Transcranial Ultrasonic\nStimulation Safety and Standards (ITRUSST) consortium has formed a\nsubcommittee, endorsed by the International Federation of Clinical\nNeurophysiology (IFCN), to develop recommendations for best practice in TUS\napplications in humans. The practical guide presented here provides a brief\nintroduction into ultrasound physics and sonication parameters. It explains the\nrequirements of TUS lab equipment and transducer selection and discusses\nexperimental design and procedures alongside potential confounds and control\nconditions. Finally, the guide elaborates on essential steps of application\nplanning for stimulation safety and efficacy, as well as considerations when\ncombining TUS with neuroimaging, electrophysiology, or other brain stimulation\ntechniques. We hope that this practical guide to TUS will assist both novice\nand experienced users in planning and conducting high-quality studies and\nprovide a solid foundation for further advancements in this promising field.\n","subjects":["Physics/Medical Physics","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}