{"id":"2407.04983","title":"The need to refine the standard recombination theory and the Hubble\n  tension problem","authors":"A.V. Shepelev","authorsParsed":[["Shepelev","A. V.",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 07:23:14 GMT"}],"updateDate":"2024-07-09","timestamp":1720250594000,"abstract":"  Over the past decades, cosmology has become largely based on experimental\ndata, the most important sources of which are studies of the cosmic microwave\nbackground (CMB). CMB is present in the Universe since the very first moments\nof its existence, and the features of CMB recorded now reflect the fundamental\nprocesses of the evolution of the Universe. These processes cause a weak\nanisotropy of CMB, which is no more than 0.01 percent. The structure of\nanisotropy, which is interpreted on the basis of a sufficiently detailed\nstandard theory of primary recombination, allows us to establish the most\nimportant cosmological parameters. One of these parameters is the Hubble\nconstant (more precisely, the Hubble parameter). However, the difference\nbetween the value of the Hubble constant, obtained from the results of the\nPlanck mission, and obtained from independent local measurements, is 10%. Such\na big difference is called the Hubble tension problem, and is an important\nproblem of cosmology. The interpretation of the Planck measurements (as well as\nthe interpretation of WMAP results, where a close value of the Hubble constant\nis obtained) is critically based on the predictions of the standard\nrecombination theory. This work shows that the recombination rate is higher\nthan predicted by standard theory and is caused by the excitation of the\nkinetic degrees of freedom of hydrogen atoms, which is ignored by standard\ntheory. The calculations performed demonstrate that taking into account this\nprocess leads to a good coincidence of the values of the Hubble constant\nobtained from the results of the Planck experiment and local measurements.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"NdLiqEksSzNvdeSfslUPOTrGrhqETLWzQyMf3oNv7AY","pdfSize":"439273"}
