{"id":"2407.20469","title":"Efficient, gigapixel-scale, aberration-free whole slide scanner using\n  angular ptychographic imaging with closed-form solution","authors":"Shi Zhao, Haowen Zhou, Siyu Lin, Ruizhi Cao, Changhuei Yang","authorsParsed":[["Zhao","Shi",""],["Zhou","Haowen",""],["Lin","Siyu",""],["Cao","Ruizhi",""],["Yang","Changhuei",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 23:59:47 GMT"}],"updateDate":"2024-07-31","timestamp":1722297587000,"abstract":"  Whole slide imaging provides a wide field-of-view (FOV) across cross-sections\nof biopsy or surgery samples, significantly facilitating pathological analysis\nand clinical diagnosis. Such high-quality images that enable detailed\nvisualization of cellular and tissue structures are essential for effective\npatient care and treatment planning. To obtain such high-quality images for\npathology applications, there is a need for scanners with high spatial\nbandwidth products, free from aberrations, and without the requirement for\nz-scanning. Here we report a whole slide imaging system based on angular\nptychographic imaging with a closed-form solution (WSI-APIC), which offers\nefficient, tens-of-gigapixels, large-FOV, aberration-free imaging. WSI-APIC\nutilizes oblique incoherent illumination for initial high-level segmentation,\nthereby bypassing unnecessary scanning of the background regions and enhancing\nimage acquisition efficiency. A GPU-accelerated APIC algorithm analytically\nreconstructs phase images with effective digital aberration corrections and\nimproved optical resolutions. Moreover, an auto-stitching technique based on\nscale-invariant feature transform ensures the seamless concatenation of whole\nslide phase images. In our experiment, WSI-APIC achieved an optical resolution\nof 772 nm using a 10x/0.25 NA objective lens and captures 80-gigapixel\naberration-free phase images for a standard 76.2 mm x 25.4 mm microscopic\nslide.\n","subjects":["Physics/Optics","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}