{"id":"2407.14311","title":"A Bayesian joint model of multiple longitudinal and categorical outcomes\n  with application to multiple myeloma using permutation-based variable\n  importance","authors":"Danilo Alvares and Jessica K. Barrett and Fran\\c{c}ois Mercier and\n  Jochen Schulze and Sean Yiu and Felipe Castro and Spyros Roumpanis and Yajing\n  Zhu","authorsParsed":[["Alvares","Danilo",""],["Barrett","Jessica K.",""],["Mercier","François",""],["Schulze","Jochen",""],["Yiu","Sean",""],["Castro","Felipe",""],["Roumpanis","Spyros",""],["Zhu","Yajing",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:44:28 GMT"}],"updateDate":"2024-07-22","timestamp":1721396668000,"abstract":"  Joint models have proven to be an effective approach for uncovering\npotentially hidden connections between various types of outcomes, mainly\ncontinuous, time-to-event, and binary. Typically, longitudinal continuous\noutcomes are characterized by linear mixed-effects models, survival outcomes\nare described by proportional hazards models, and the link between outcomes are\ncaptured by shared random effects. Other modeling variations include\ngeneralized linear mixed-effects models for longitudinal data and logistic\nregression when a binary outcome is present, rather than time until an event of\ninterest. However, in a clinical research setting, one might be interested in\nmodeling the physician's chosen treatment based on the patient's medical\nhistory in order to identify prognostic factors. In this situation, there are\noften multiple treatment options, requiring the use of a multiclass\nclassification approach. Inspired by this context, we develop a Bayesian joint\nmodel for longitudinal and categorical data. In particular, our motivation\ncomes from a multiple myeloma study, in which biomarkers display nonlinear\ntrajectories that are well captured through bi-exponential submodels, where\npatient-level information is shared with the categorical submodel. We also\npresent a variable importance strategy for ranking prognostic factors. We apply\nour proposal and a competing model to the multiple myeloma data, compare the\nvariable importance and inferential results for both models, and illustrate\npatient-level interpretations using our joint model.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0B3IURvlk8R9R9E0du1L13nhmAAKQnqqnkufP-sRqSc","pdfSize":"978672"}
