{"id":"2407.08886","title":"Semi-Supervised Multi-Task Learning Based Framework for Power System\n  Security Assessment","authors":"Muhy Eddin Za'ter, Amirhossein Sajadi, Bri-Mathias Hodge","authorsParsed":[["Za'ter","Muhy Eddin",""],["Sajadi","Amirhossein",""],["Hodge","Bri-Mathias",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 22:42:53 GMT"}],"updateDate":"2024-07-15","timestamp":1720737773000,"abstract":"  This paper develops a novel machine learning-based framework using\nSemi-Supervised Multi-Task Learning (SS-MTL) for power system dynamic security\nassessment that is accurate, reliable, and aware of topological changes. The\nlearning algorithm underlying the proposed framework integrates conditional\nmasked encoders and employs multi-task learning for classification-aware\nfeature representation, which improves the accuracy and scalability to larger\nsystems. Additionally, this framework incorporates a confidence measure for its\npredictions, enhancing its reliability and interpretability. A topological\nsimilarity index has also been incorporated to add topological awareness to the\nframework. Various experiments on the IEEE 68-bus system were conducted to\nvalidate the proposed method, employing two distinct database generation\ntechniques to generate the required data to train the machine learning\nalgorithm. The results demonstrate that our algorithm outperforms existing\nstate-of-the-art machine learning based techniques for security assessment in\nterms of accuracy and robustness. Finally, our work underscores the value of\nemploying auto-encoders for security assessment, highlighting improvements in\naccuracy, reliability, and robustness. All datasets and codes used have been\nmade publicly available to ensure reproducibility and transparency.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7CjZCSaxjkpkM-ZX4ASkiLw_5ABo7mrK5NgrY5feWqg","pdfSize":"2436356"}
