{"id":"2407.02507","title":"On foundations for deductive mathematics","authors":"Frank Quinn","authorsParsed":[["Quinn","Frank",""]],"versions":[{"version":"v1","created":"Tue, 18 Jun 2024 01:44:00 GMT"}],"updateDate":"2024-07-04","timestamp":1718675040000,"abstract":"  This article was motivated by the discovery of a potential new foundation for\nmainstream mathematics. The goals are to clarify the relationships between\nprimitives, foundations, and deductive practice; to understand how to determine\nwhat is, or isn't, a foundation; and get clues as to how a foundation can be\noptimized for effective human use.\n  For this we turn to history and professional practice of the subject. We have\nno asperations to Philosophy.\n  The first section gives a short abstract discussion, focusing on the\nsignificance of consistency. The next briefly describes foundations, explicit\nand implicit, at a few key periods in mathematical history. We see, for\nexample, that at the primitive level human intuitions are essential, but can be\nproblematic. We also see that traditional axiomatic set theories,\nZermillo-Fraenkel-Choice (ZFC) in particular, are not quite consistent with\nmainstream practice. The final section sketches the proposed new foundation and\ngives the basic argument that it is uniquely qualified to be considered {the}\nfoundation of mainstream deductive mathematics. The ``coherent limit axiom''\ncharacterizes the new theory among ZFC-like theories. This axiom plays a role\nin recursion, but is implicitly assumed in mainstream work so does not provide\nnew leverage there. In principle it should settle set-theory questions such as\nthe continuum hypothesis.\n","subjects":["Mathematics/History and Overview","Mathematics/Logic"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_Gg2DxSGHjyEPhJE-BE0mi8vJLF0umhCKfWsWmxguzM","pdfSize":"218187","objectId":"0xdee1592ed5d6298b61ff44f761674ee2b6ab280a14c16c92612d9ad974854607","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
