{"id":"2407.12788","title":"SS-ADA: A Semi-Supervised Active Domain Adaptation Framework for\n  Semantic Segmentation","authors":"Weihao Yan, Yeqiang Qian, Yueyuan Li, Tao Li, Chunxiang Wang, Ming\n  Yang","authorsParsed":[["Yan","Weihao",""],["Qian","Yeqiang",""],["Li","Yueyuan",""],["Li","Tao",""],["Wang","Chunxiang",""],["Yang","Ming",""]],"versions":[{"version":"v1","created":"Mon, 17 Jun 2024 13:40:42 GMT"}],"updateDate":"2024-07-19","timestamp":1718631642000,"abstract":"  Semantic segmentation plays an important role in intelligent vehicles,\nproviding pixel-level semantic information about the environment. However, the\nlabeling budget is expensive and time-consuming when semantic segmentation\nmodel is applied to new driving scenarios. To reduce the costs, semi-supervised\nsemantic segmentation methods have been proposed to leverage large quantities\nof unlabeled images. Despite this, their performance still falls short of the\naccuracy required for practical applications, which is typically achieved by\nsupervised learning. A significant shortcoming is that they typically select\nunlabeled images for annotation randomly, neglecting the assessment of sample\nvalue for model training. In this paper, we propose a novel semi-supervised\nactive domain adaptation (SS-ADA) framework for semantic segmentation that\nemploys an image-level acquisition strategy. SS-ADA integrates active learning\ninto semi-supervised semantic segmentation to achieve the accuracy of\nsupervised learning with a limited amount of labeled data from the target\ndomain. Additionally, we design an IoU-based class weighting strategy to\nalleviate the class imbalance problem using annotations from active learning.\nWe conducted extensive experiments on synthetic-to-real and real-to-real domain\nadaptation settings. The results demonstrate the effectiveness of our method.\nSS-ADA can achieve or even surpass the accuracy of its supervised learning\ncounterpart with only 25% of the target labeled data when using a real-time\nsegmentation model. The code for SS-ADA is available at\nhttps://github.com/ywher/SS-ADA.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}