{"id":"2407.09852","title":"Free-form Grid Structure Form Finding based on Machine Learning and\n  Multi-objective Optimisation","authors":"Yiping Meng, Yiming Sun","authorsParsed":[["Meng","Yiping",""],["Sun","Yiming",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 11:22:12 GMT"}],"updateDate":"2024-07-16","timestamp":1720869732000,"abstract":"  Free-form structural forms are widely used to design spatial structures for\ntheir irregular spatial morphology. Current free-form form-finding methods\ncannot adequately meet the material properties, structural requirements or\nconstruction conditions, which brings the deviation between the initial 3D\ngeometric design model and the constructed free-form structure. Thus, the main\nfocus of this paper is to improve the rationality of free-form morphology\nconsidering multiple objectives in line with the characteristics and\nconstraints of material. In this paper, glued laminated timber is selected as a\ncase. Firstly, machine learning is adopted based on the predictive capability.\nBy selecting a free-form timber grid structure and following the principles of\nNURBS, the free-form structure is simplified into free-form curves. The\ntransformer is selected to train and predict the curvatures of the curves\nconsidering the material characteristics. After predicting the curvatures, the\ncurves are transformed into vectors consisting of control points, weights, and\nknot vectors. To ensure the constructability and robustness of the structure,\nminimising the mass of the structure, stress and strain energy are the\noptimisation objectives. Two parameters (weight and the z-coordinate of the\ncontrol points) of the free-from morphology are extracted as the variables of\nthe free-form morphology to conduct the optimisation. The evaluation algorithm\nwas selected as the optimal tool due to its capability to optimise multiple\nparameters. While optimising the two variables, the mechanical performance\nevaluation indexes such as the maximum displacement in the z-direction are\ndemonstrated in the 60th step. The optimisation results for structure mass,\nstress and strain energy after 60 steps show the tendency of oscillation\nconvergence, which indicates the efficiency of the proposal multi-objective\noptimisation.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"yoetj-CMCnx2kE6V0c4uWbOjdG-yC9-dcFWToAuA06k","pdfSize":"6245731"}
