{"id":"2407.03210","title":"Combining AI Control Systems and Human Decision Support via Robustness\n  and Criticality","authors":"Walt Woods, Alexander Grushin, Simon Khan, Alvaro Velasquez","authorsParsed":[["Woods","Walt",""],["Grushin","Alexander",""],["Khan","Simon",""],["Velasquez","Alvaro",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 15:38:57 GMT"}],"updateDate":"2024-07-04","timestamp":1720021137000,"abstract":"  AI-enabled capabilities are reaching the requisite level of maturity to be\ndeployed in the real world, yet do not always make correct or safe decisions.\nOne way of addressing these concerns is to leverage AI control systems\nalongside and in support of human decisions, relying on the AI control system\nin safe situations while calling on a human co-decider for critical situations.\nWe extend a methodology for adversarial explanations (AE) to state-of-the-art\nreinforcement learning frameworks, including MuZero. Multiple improvements to\nthe base agent architecture are proposed. We demonstrate how this technology\nhas two applications: for intelligent decision tools and to enhance training /\nlearning frameworks. In a decision support context, adversarial explanations\nhelp a user make the correct decision by highlighting those contextual factors\nthat would need to change for a different AI-recommended decision. As another\nbenefit of adversarial explanations, we show that the learned AI control system\ndemonstrates robustness against adversarial tampering. Additionally, we\nsupplement AE by introducing strategically similar autoencoders (SSAs) to help\nusers identify and understand all salient factors being considered by the AI\nsystem. In a training / learning framework, this technology can improve both\nthe AI's decisions and explanations through human interaction. Finally, to\nidentify when AI decisions would most benefit from human oversight, we tie this\ncombined system to our prior art on statistically verified analyses of the\ncriticality of decisions at any point in time.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}