{"id":"2407.18788","title":"Switching, Amplifying, and Chirping Diode Lasers with Current Pulses for\n  High Bandwidth Quantum Technologies","authors":"Gianni Buser","authorsParsed":[["Buser","Gianni",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 14:50:09 GMT"}],"updateDate":"2024-07-29","timestamp":1722005409000,"abstract":"  A series of simple and low-cost devices for switching, amplifying, and\nchirping diode lasers based on current modulation are presented. Direct\nmodulation of diode laser currents is rarely sufficient to establish precise\namplitude and phase control over light, as its effects on these parameters are\nnot independent. These devices overcome this limitation by exploiting amplifier\nsaturation and dramatically outperform commonly used external modulators in key\nfigures of merit for quantum technological applications. Semiconductor optical\namplifiers operated on either rubidium D line are recast as intensity switches\nand shown to achieve ON:OFF ratios $>10^6$ in as little as 50 ns. Current is\nswitched to a 795 nm wavelength (Rb D1) tapered amplifier to produce optical\npulses of few nanosecond duration and peak powers of 3 W at a similar\nextinction ratio. Fast rf pulses are applied directly to a laser diode to shift\nits emission frequency by up to 300 MHz in either direction and at a maximum\nchirp rate of 150 MHz/ns. Finally, the latter components are combined, yielding\na system that produces watt-level optical pulses with arbitrary frequency\nchirps in the given range and <2% residual intensity variation, all within 65\nns upon asynchronous demand. Such systems have broad application in atomic,\nmolecular, and optical physics, and are of particular interest to fast\nexperiments simultaneously requiring high power and low noise, for example\nquantum memory experiments with atomic vapors.\n","subjects":["Physics/Optics","Physics/Instrumentation and Detectors","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"V5Qz8De-OknAKZobZNaoE1EJ8-LcP0T_Ifg6alFVo1A","pdfSize":"816059"}
