{"id":"2407.20598","title":"Navigation-grade interferometric air-core antiresonant fibre optic\n  gyroscope with enhanced thermal stability","authors":"Maochun Li, Shoufei Gao, Yizhi Sun, Xiaoming Zhao, Wei Luo, Qingbo Hu,\n  Hao Chen, Helin Wu, Fei Hui, Yingying Wang, Miao Yan, and Wei Ding","authorsParsed":[["Li","Maochun",""],["Gao","Shoufei",""],["Sun","Yizhi",""],["Zhao","Xiaoming",""],["Luo","Wei",""],["Hu","Qingbo",""],["Chen","Hao",""],["Wu","Helin",""],["Hui","Fei",""],["Wang","Yingying",""],["Yan","Miao",""],["Ding","Wei",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 07:18:04 GMT"}],"updateDate":"2024-07-31","timestamp":1722323884000,"abstract":"  We present a groundbreaking navigation-grade interferometric air-core fibre\noptic gyroscope (IFOG) using a quadrupolar-wound coil of four-tube truncated\ndouble nested antiresonant nodeless fibre (tDNANF). This state-of-the-art\ntDNANF simultaneously achieves low loss, low bend loss, single-spatial-mode\noperation, and exceptional linear polarization purity over a broad wavelength\nrange. Our 469 m tDNANF coil demonstrated a polarization extinction ratio (PER)\nof ~20 dB when illuminated by an amplified spontaneous emission (ASE) source\nspanning 1525-1565 nm. Under these conditions, the gyro archives an angular\nrandom walk (ARW) of 0.0038 deg h-1/2 and a bias-stability (BS) drift over 8500\ns of 0.0014 deg h-1, marking the first instance of navigation-grade performance\nin air-core FOGs. Additionally, we validated the low thermal sensitivity of\nair-core FOGs, with reductions of 9.24/10.68/6.82 compared to that of\nconventional polarization-maintaining solid-core FOGs of the same size across\nvarious temperature ranges. These results represent a significant step towards\nlong-standing promise of high-precision inertial navigation applications with\nsuperior environmental adaptability.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}