{"id":"2407.17276","title":"SoK: Bridging Trust into the Blockchain. A Systematic Review on On-Chain\n  Identity","authors":"Awid Vaziry, Kaustabh Barman, Patrick Herbke","authorsParsed":[["Vaziry","Awid",""],["Barman","Kaustabh",""],["Herbke","Patrick",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 13:42:46 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 05:06:44 GMT"}],"updateDate":"2024-07-26","timestamp":1721828566000,"abstract":"  The ongoing regulation of blockchain-based services and applications requires\nthe identification of users who are issuing transactions on the blockchain.\nThis systematic review explores the current status, identifies research gaps,\nand outlines future research directions for establishing trusted and\nprivacy-compliant identities on the blockchain (on-chain identity). A\nsystematic search term was applied across various scientific databases,\ncollecting 2232 potentially relevant research papers. These papers were\nnarrowed down in two methodologically executed steps to 98 and finally to 13\nrelevant sources. The relevant articles were then systematically analyzed based\non a set of screening questions. The results of the selected studies have\nprovided insightful findings on the mechanisms of on-chain identities. On-chain\nidentities are established using zero-knowledge proofs, public key\ninfrastructure/certificates, and web of trust approaches. The technologies and\narchitectures used by the authors are also highlighted. Trust has emerged as a\nkey research gap, manifesting in two ways: firstly, a gap in how to trust the\ndigital identity representation of a physical human; secondly, a gap in how to\ntrust identity providers that issue identity confirmations on-chain. Potential\nfuture research avenues are suggested to help fill the current gaps in\nestablishing trust and on-chain identities.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Computers and Society","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}