{"id":"2407.12912","title":"Topological Kondo semimetal and insulator in AB-stacked heterobilayer\n  transition metal dichalcogenides","authors":"Daniele Guerci, Kevin P. Lucht, Valentin Cr\\'epel, Jennifer Cano, J.\n  H. Pixley and Andrew J. Millis","authorsParsed":[["Guerci","Daniele",""],["Lucht","Kevin P.",""],["Crépel","Valentin",""],["Cano","Jennifer",""],["Pixley","J. H.",""],["Millis","Andrew J.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-19","timestamp":1721239201000,"abstract":"  Recent experiments reported the realization of a heavy Fermi liquid in\nAB-stacked MoTe$_2$/WSe$_2$ heterobilayers. In this paper we show that the\nAB-stacked heterobilayer configuration is particularly suited to realize\ntopological Kondo semimetal and topological Kondo insulator ground states at a\ndoping of two holes per moir\\'e unit cell. The small lattice mismatch between\nthe MoTe$_2$ and WSe$_2$ monolayers and the different bandwidths of their\nhighest lying moir\\'e valence bands means that, in the experimentally relevant\nrange of hole dopings, the MoTe$_2$ layer is effectively a Mott insulator with\nonly low-lying magnetic excitations Kondo-coupled to more itinerant electrons\nin the WSe$_2$. The crucial consequence of the AB-stacking configuration is\nthat the interlayer tunnelling connects orbitals of opposite parity in the two\nlayers, leading to a chiral Kondo coupling. We show that the chiral Kondo\ncoupling favors a topological Kondo semimetal at filling $\\nu=1+1$, with a\nnon-quantized spin Hall conductance arising from edge modes, whose spectrum and\noverlap with bulk states we determine. We further show that a spatially random\nstrain field that locally breaks the rotation symmetry can convert the Kondo\nsemimetal to a narrow gap topological Kondo insulator featuring a quantized\nspin Hall conductance.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}