{"id":"2407.11087","title":"Restore-RWKV: Efficient and Effective Medical Image Restoration with\n  RWKV","authors":"Zhiwen Yang and Hui Zhang and Dan Zhao and Bingzheng Wei and Yan Xu","authorsParsed":[["Yang","Zhiwen",""],["Zhang","Hui",""],["Zhao","Dan",""],["Wei","Bingzheng",""],["Xu","Yan",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 12:22:05 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 05:46:54 GMT"}],"updateDate":"2024-08-01","timestamp":1720959725000,"abstract":"  Transformers have revolutionized medical image restoration, but the quadratic\ncomplexity still poses limitations for their application to high-resolution\nmedical images. The recent advent of RWKV in the NLP field has attracted much\nattention as it can process long sequences efficiently. To leverage its\nadvanced design, we propose Restore-RWKV, the first RWKV-based model for\nmedical image restoration. Since the original RWKV model is designed for 1D\nsequences, we make two necessary modifications for modeling spatial relations\nin 2D images. First, we present a recurrent WKV (Re-WKV) attention mechanism\nthat captures global dependencies with linear computational complexity. Re-WKV\nincorporates bidirectional attention as basic for a global receptive field and\nrecurrent attention to effectively model 2D dependencies from various scan\ndirections. Second, we develop an omnidirectional token shift (Omni-Shift)\nlayer that enhances local dependencies by shifting tokens from all directions\nand across a wide context range. These adaptations make the proposed\nRestore-RWKV an efficient and effective model for medical image restoration.\nExtensive experiments demonstrate that Restore-RWKV achieves superior\nperformance across various medical image restoration tasks, including MRI image\nsuper-resolution, CT image denoising, PET image synthesis, and all-in-one\nmedical image restoration. Code is available at:\n\\href{https://github.com/Yaziwel/Restore-RWKV.git}{https://github.com/Yaziwel/Restore-RWKV}.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}