{"id":"2407.14328","title":"Modality-Order Matters! A Novel Hierarchical Feature Fusion Method for\n  CoSAm: A Code-Switched Autism Corpus","authors":"Mohd Mujtaba Akhtar, Girish, Muskaan Singh, Orchid Chetia Phukan","authorsParsed":[["Akhtar","Mohd Mujtaba",""],["Girish","",""],["Singh","Muskaan",""],["Phukan","Orchid Chetia",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 14:06:01 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 11:56:22 GMT"}],"updateDate":"2024-07-24","timestamp":1721397961000,"abstract":"  Autism Spectrum Disorder (ASD) is a complex neuro-developmental challenge,\npresenting a spectrum of difficulties in social interaction, communication, and\nthe expression of repetitive behaviors in different situations. This increasing\nprevalence underscores the importance of ASD as a major public health concern\nand the need for comprehensive research initiatives to advance our\nunderstanding of the disorder and its early detection methods. This study\nintroduces a novel hierarchical feature fusion method aimed at enhancing the\nearly detection of ASD in children through the analysis of code-switched speech\n(English and Hindi). Employing advanced audio processing techniques, the\nresearch integrates acoustic, paralinguistic, and linguistic information using\nTransformer Encoders. This innovative fusion strategy is designed to improve\nclassification robustness and accuracy, crucial for early and precise ASD\nidentification. The methodology involves collecting a code-switched speech\ncorpus, CoSAm, from children diagnosed with ASD and a matched control group.\nThe dataset comprises 61 voice recordings from 30 children diagnosed with ASD\nand 31 from neurotypical children, aged between 3 and 13 years, resulting in a\ntotal of 159.75 minutes of voice recordings. The feature analysis focuses on\nMFCCs and extensive statistical attributes to capture speech pattern\nvariability and complexity. The best model performance is achieved using a\nhierarchical fusion technique with an accuracy of 98.75% using a combination of\nacoustic and linguistic features first, followed by paralinguistic features in\na hierarchical manner.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}