{"id":"2407.09968","title":"The radiative torque spin-up efficiency of ballistic dust grain\n  aggregates","authors":"Jonathan A. J\\\"ager, Stefan Reissl, Ralf S. Klessen","authorsParsed":[["Jäger","Jonathan A.",""],["Reissl","Stefan",""],["Klessen","Ralf S.",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 18:17:30 GMT"}],"updateDate":"2024-07-16","timestamp":1720894650000,"abstract":"  Aims. Understanding the rotational dynamics of interstellar dust grains is\nquintessential for the analysis of the observed dust polarization signal. We\naim to constrain the set of parameters for an accurate description of the\nrotational spin-up process of ballistic dust grain aggregates driven by\nradiative torques (RATs).\n  Methods. We model the dust grains as complex fractal aggregates grown by the\nballistic aggregation of uniform spherical particles (monomers) of different\nsizes. A broad variation of dust materials, shapes, and sizes are studied in\nthe presence of different radiation sources.\n  Results. We find that the canonical parametrization for the torque efficiency\noverestimates the maximal angular velocity $\\omega_{\\mathrm{RAT}}$ caused by\nRATs of grain aggregates, and to resolve this problem we propose a new\nparametrization which predicts $\\omega_{\\mathrm{RAT}}$ more accurately. We find\nthat RATs are strongest for larger grains with smaller monomer-density, this\nmanifests as size and monomer-density dependence in the constant part of the\nparametrization. Following the constant part, the parametrization has two\npower-laws with different slopes, which retain the universality for all grain\nsizes. The maximum grain rotation does not scale linearly with radiation\nstrength, due to different drag mechanisms dominating depending on grain\nmaterial and environment. The angular velocity $\\omega_{\\mathrm{RAT}}$ of\nindividual single dust grains has a wide distribution and may even differ from\nthe mean by up to two orders of magnitude.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}