{"id":"2407.17305","title":"Continual Learning in Bio-plausible Spiking Neural Networks with Hebbian\n  and Spike Timing Dependent Plasticity: A Survey and Perspective","authors":"Ali Safa","authorsParsed":[["Safa","Ali",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 14:20:59 GMT"}],"updateDate":"2024-07-25","timestamp":1721830859000,"abstract":"  Recently, the use bio-plausible learning techniques such as Hebbian and\nSpike-Timing-Dependent Plasticity (STDP) have drawn significant attention for\nthe design of compute-efficient AI systems that can continuously learn on-line\nat the edge. A key differentiating factor regarding this emerging class of\nneuromorphic continual learning system lies in the fact that learning must be\ncarried using a data stream received in its natural order, as opposed to\nconventional gradient-based offline training where a static training dataset is\nassumed available a priori and randomly shuffled to make the training set\nindependent and identically distributed (i.i.d). In contrast, the emerging\nclass of neuromorphic continual learning systems covered in this survey must\nlearn to integrate new information on the fly in a non-i.i.d manner, which\nmakes these systems subject to catastrophic forgetting. In order to build the\nnext generation of neuromorphic AI systems that can continuously learn at the\nedge, a growing number of research groups are studying the use of bio-plausible\nHebbian neural network architectures and Spiking Neural Networks (SNNs)\nequipped with STDP learning. However, since this research field is still\nemerging, there is a need for providing a holistic view of the different\napproaches proposed in literature so far. To this end, this survey covers a\nnumber of recent works in the field of neuromorphic continual learning;\nprovides background theory to help interested researchers to quickly learn the\nkey concepts; and discusses important future research questions in light of the\ndifferent works covered in this paper. It is hoped that this survey will\ncontribute towards future research in the field of neuromorphic continual\nlearning.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"olvFGkbEG9MXnKqO7RYQhrW4sL4lijetNb8p9Sdg3Kg","pdfSize":"2268733"}
