{"id":"2407.08817","title":"CommRad: Context-Aware Sensing-Driven Millimeter-Wave Networks","authors":"Ish Kumar Jain, Suriyaa MM, Dinesh Bharadia","authorsParsed":[["Jain","Ish Kumar",""],["MM","Suriyaa",""],["Bharadia","Dinesh",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 18:56:01 GMT"}],"updateDate":"2024-07-15","timestamp":1720724161000,"abstract":"  Millimeter-wave (mmWave) technology is pivotal for next-generation wireless\nnetworks, enabling high-data-rate and low-latency applications such as\nautonomous vehicles and XR streaming. However, maintaining directional mmWave\nlinks in dynamic mobile environments is challenging due to mobility-induced\ndisruptions and blockage. While effective, the current 5G NR beam training\nmethods incur significant overhead and scalability issues in multi-user\nscenarios. To address this, we introduce CommRad, a sensing-driven solution\nincorporating a radar sensor at the base station to track mobile users and\nmaintain directional beams even under blockages. While radar provides\nhigh-resolution object tracking, it suffers from a fundamental challenge of\nlack of context, i.e., it cannot discern which objects in the environment\nrepresent active users, reflectors, or blockers. To obtain this contextual\nawareness, CommRad unites wireless sensing capabilities of bi-static radio\ncommunication with the mono-static radar sensor, allowing radios to provide\ninitial context to radar sensors. Subsequently, the radar aids in user tracking\nand sustains mobile links even in obstructed scenarios, resulting in robust and\nhigh-throughput directional connections for all mobile users at all times. We\nevaluate this collaborative radar-radio framework using a 28 GHz mmWave testbed\nintegrated with a radar sensor in various indoor and outdoor scenarios,\ndemonstrating a 2.5x improvement in median throughput compared to a\nnon-collaborative baseline.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4oQ2x6pLRIbaM6_Q6EdLiO1xhaHSYNClanYEjCIPN5w","pdfSize":"2767144"}
