{"id":"2407.02675","title":"Depth-Aware Endoscopic Video Inpainting","authors":"Francis Xiatian Zhang, Shuang Chen, Xianghua Xie, Hubert P. H. Shum","authorsParsed":[["Zhang","Francis Xiatian",""],["Chen","Shuang",""],["Xie","Xianghua",""],["Shum","Hubert P. H.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 21:28:36 GMT"}],"updateDate":"2024-07-04","timestamp":1719955716000,"abstract":"  Video inpainting fills in corrupted video content with plausible\nreplacements. While recent advances in endoscopic video inpainting have shown\npotential for enhancing the quality of endoscopic videos, they mainly repair 2D\nvisual information without effectively preserving crucial 3D spatial details\nfor clinical reference. Depth-aware inpainting methods attempt to preserve\nthese details by incorporating depth information. Still, in endoscopic\ncontexts, they face challenges including reliance on pre-acquired depth maps,\nless effective fusion designs, and ignorance of the fidelity of 3D spatial\ndetails. To address them, we introduce a novel Depth-aware Endoscopic Video\nInpainting (DAEVI) framework. It features a Spatial-Temporal Guided Depth\nEstimation module for direct depth estimation from visual features, a Bi-Modal\nPaired Channel Fusion module for effective channel-by-channel fusion of visual\nand depth information, and a Depth Enhanced Discriminator to assess the\nfidelity of the RGB-D sequence comprised of the inpainted frames and estimated\ndepth images. Experimental evaluations on established benchmarks demonstrate\nour framework's superiority, achieving a 2% improvement in PSNR and a 6%\nreduction in MSE compared to state-of-the-art methods. Qualitative analyses\nfurther validate its enhanced ability to inpaint fine details, highlighting the\nbenefits of integrating depth information into endoscopic inpainting.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rcXtsa_deYcgCWblYlvAA_eepjR_QNcPBaayk9Ol9fw","pdfSize":"21294971"}
