{"id":"2407.15298","title":"Understanding cell populations sharing information through the\n  environment, as reinforcement learning","authors":"Masaki Kato, Tetsuya J. Kobayashi","authorsParsed":[["Kato","Masaki",""],["Kobayashi","Tetsuya J.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 23:52:30 GMT"}],"updateDate":"2024-07-23","timestamp":1721605950000,"abstract":"  Collective migration is a phenomenon observed in various biological systems,\nwhere the cooperation of multiple cells leads to complex functions beyond\nindividual capabilities, such as in immunity and development. A distinctive\nexample is cell populations that not only ascend attractant gradient\noriginating from targets, such as damaged tissue, but also actively modify the\ngradient, through their own production and degradation. While the optimality of\nsingle-cell information processing has been extensively studied, the optimality\nof the collective information processing that includes gradient sensing and\ngradient generation, remains underexplored. In this study, we formulated a cell\npopulation that produces and degrades an attractant while exploring the\nenvironment as an agent population performing distributed reinforcement\nlearning. We demonstrated the existence of optimal couplings between gradient\nsensing and gradient generation, showing that the optimal gradient generation\nqualitatively differs depending on whether the gradient sensing is logarithmic\nor linear. The derived dynamics have a structure homogeneous to the\nKeller-Segel model, suggesting that cell populations might be learning.\nAdditionally, we showed that the distributed information processing structure\nof the agent population enables a proportion of the population to robustly\naccumulate at the target. Our results provide a quantitative foundation for\nunderstanding the collective information processing mediated by attractants in\nextracellular environments.\n","subjects":["Quantitative Biology/Cell Behavior","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}