{"id":"2407.11845","title":"Asymmetric Kinematics in Young Clusters: The {\\lambda} Ori Cluster","authors":"Joseph J. Armstrong, Jonathan C. Tan","authorsParsed":[["Armstrong","Joseph J.",""],["Tan","Jonathan C.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:28:43 GMT"}],"updateDate":"2024-07-17","timestamp":1721143723000,"abstract":"  Context. Most stars form in clusters or associations but only a small number\nof these groups are expected to remain bound for longer than a few Myr. Once\nstar formation has ended and the molecular gas around young stellar objects has\nbeen expelled via feedback processes, most initially bound young clusters lose\nthe majority of their binding mass and begin to disperse into the Galactic\nfield. Aims. This process can be investigated by analysing the structure and\nkinematic trends in nearby young clusters, particularly expansion, the\ntell-tale sign that a cluster is no longer gravitationally bound but is\ndispersing into the field. Methods. We combine Gaia DR3 5-parameter astrometry\nwith calibrated radial velocities for members of the nearby young cluster\n{\\lambda} Ori (Collinder 69). Results. We characterise the plane-of-sky\nsubstructure of the cluster using the Q-parameter and Angular Dispersion\nparameter. We find evidence that the cluster contains significant substructure,\nbut that this is preferentially located away from the central cluster core,\nwhich is smooth and likely remains bound. We find strong evidence for expansion\nin {\\lambda} Ori in the plane-of-sky using a number of metrics, but also that\nthe trends are asymmetric at the 5{\\sigma} significance level. with the maximum\nrate of expansion being directed nearly parallel to the Galactic plane. We then\ninvert the maximum rate of expansion of 0.144^{+0.003}_{-0.003} kms^{-1}pc^{-1}\nto give an expansion timescale of 6.944^{+0.148}_{-0.142} Myr, which is\nslightly larger than typical literature age estimates for the cluster. We also\nfind asymmetry in the velocity dispersion, potential signatures of cluster\nrotation, and calculate kinematic ages for individual cluster members by\ntracing their motion back in time to their closest approach to the cluster\ncenter.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}