{"id":"2407.03709","title":"Measuring stellar surface rotation and activity with the PLATO mission\n  -- I. Strategy and application to simulated light curves","authors":"S.N. Breton, A.F Lanza, S. Messina, I. Pagano, L. Bugnet, E. Corsaro,\n  R.A. Garc\\'ia, S. Mathur, A.R.G Santos, S. Aigrain, L. Amard, A.S. Brun, L.\n  Degott, Q. Noraz, D.B. Palakkatharappil, E. Panetier, A. Strugarek, K.\n  Belkacem, M.-J Goupil, R.M. Ouazzani, J. Philidet, C. Reni\\'e, and O. Roth","authorsParsed":[["Breton","S. N.",""],["Lanza","A. F",""],["Messina","S.",""],["Pagano","I.",""],["Bugnet","L.",""],["Corsaro","E.",""],["García","R. A.",""],["Mathur","S.",""],["Santos","A. R. G",""],["Aigrain","S.",""],["Amard","L.",""],["Brun","A. S.",""],["Degott","L.",""],["Noraz","Q.",""],["Palakkatharappil","D. B.",""],["Panetier","E.",""],["Strugarek","A.",""],["Belkacem","K.",""],["Goupil","M. -J",""],["Ouazzani","R. M.",""],["Philidet","J.",""],["Renié","C.",""],["Roth","O.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 07:54:31 GMT"}],"updateDate":"2024-07-08","timestamp":1720079671000,"abstract":"  The Planetary Transits and Oscillations of stars mission (PLATO) will allow\nus to measure surface rotation and monitor photometric activity of tens of\nthousands of main sequence solar-type and subgiant stars. This paper is the\nfirst of a series dedicated to the preparation of the analysis of stellar\nsurface rotation and photospheric activity with the near-future PLATO data. We\ndescribe in this work the strategy that will be implemented in the PLATO\npipeline to measure stellar surface rotation, photometric activity, and\nlong-term modulations. The algorithms are applied on both noise-free and noisy\nsimulations of solar-type stars, which include activity cycles, latitudinal\ndifferential rotation, and spot evolution. PLATO simulated systematics are\nincluded in the noisy light curves. We show that surface rotation periods can\nbe recovered with confidence for most of the stars with only six months of\nobservations and that the {recovery rate} of the analysis significantly\nimproves as additional observations are collected. This means that the first\nPLATO data release will already provide a substantial set of measurements for\nthis quantity, with a significant refinement on their quality as the instrument\nobtains longer light curves. Measuring the Schwabe-like magnetic activity cycle\nduring the mission will require that the same field be observed over a\nsignificant timescale (more than four years). Nevertheless, PLATO will provide\na vast and robust sample of solar-type stars with constraints on the\nactivity-cycle length. Such a sample is lacking from previous missions\ndedicated to space photometry.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}