{"id":"2407.14252","title":"Effect of environmental noise on charge diffusion in DNA: Towards\n  modeling its potential epigenetic impact in live processes","authors":"Mirko Rossini, Ole Ammerpohl, Reiner Siebert, Joachim Ankerhold","authorsParsed":[["Rossini","Mirko",""],["Ammerpohl","Ole",""],["Siebert","Reiner",""],["Ankerhold","Joachim",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 12:32:17 GMT"}],"updateDate":"2024-07-22","timestamp":1721392337000,"abstract":"  Charge diffusion through desoxyribonucleic acid (DNA) is a physico-chemical\nphenomenon that on the one hand is being explored for technological purposes,\non the other hand is applied by nature for various informational processes in\nlife. With regard to the latter, increasing experimental and theoretical\nevidence indicates that charge diffusion through DNA is involved in basic steps\nof DNA replication and repair, as well as regulation of gene expression via\nepigenetic mechanisms such as DNA methylation or DNA binding of proteins. From\nthe physics point of view, DNA supports a metallic-like behavior with\nlong-range charge mobility. Nevertheless, particularly considering a living\nenvironment, charge mobility in DNA needs to take into account omnipresent\nnoise and disorder. Here, we analyze quantum diffusion of single charges along\nDNA-inspired two-dimensional tight-binding lattices in presence of different\nsources of intrinsic and environmental fluctuations. It is shown that\ndouble-strand lattices, parametrized according to atomistic calculations of DNA\nsequences, offer a complex network of pathways between sites and may give rise\nto long-distance coherence phenomena. These effects strongly depend on carrier\ntype (electrons, holes), the energetic profile of the lattice (composition) as\nwell as the type of noise and disorder. Of particular interest are spatially\ncorrelated low-frequency fluctuations which may support coherent charge\ntransfer over distances of a few sites. Our results may trigger further\nexperimental activities aiming at investigating charge mobility in DNA both in\nthe native in-vivo context as well as on artificial platforms.\n","subjects":["Physics/Biological Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}