{"id":"2407.12292","title":"Any Target Can be Offense: Adversarial Example Generation via\n  Generalized Latent Infection","authors":"Youheng Sun, Shengming Yuan, Xuanhan Wang, Lianli Gao, Jingkuan Song","authorsParsed":[["Sun","Youheng",""],["Yuan","Shengming",""],["Wang","Xuanhan",""],["Gao","Lianli",""],["Song","Jingkuan",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 03:24:09 GMT"}],"updateDate":"2024-07-18","timestamp":1721186649000,"abstract":"  Targeted adversarial attack, which aims to mislead a model to recognize any\nimage as a target object by imperceptible perturbations, has become a\nmainstream tool for vulnerability assessment of deep neural networks (DNNs).\nSince existing targeted attackers only learn to attack known target classes,\nthey cannot generalize well to unknown classes. To tackle this issue, we\npropose $\\bf{G}$eneralized $\\bf{A}$dversarial attac$\\bf{KER}$ ($\\bf{GAKer}$),\nwhich is able to construct adversarial examples to any target class. The core\nidea behind GAKer is to craft a latently infected representation during\nadversarial example generation. To this end, the extracted latent\nrepresentations of the target object are first injected into intermediate\nfeatures of an input image in an adversarial generator. Then, the generator is\noptimized to ensure visual consistency with the input image while being close\nto the target object in the feature space. Since the GAKer is class-agnostic\nyet model-agnostic, it can be regarded as a general tool that not only reveals\nthe vulnerability of more DNNs but also identifies deficiencies of DNNs in a\nwider range of classes. Extensive experiments have demonstrated the\neffectiveness of our proposed method in generating adversarial examples for\nboth known and unknown classes. Notably, compared with other generative\nmethods, our method achieves an approximately $14.13\\%$ higher attack success\nrate for unknown classes and an approximately $4.23\\%$ higher success rate for\nknown classes. Our code is available in https://github.com/VL-Group/GAKer.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}