{"id":"2407.13160","title":"Droplet breakup and size distribution in an airstream -- effect of\n  inertia","authors":"Someshwar Sanjay Ade, Pavan Kumar Kirar, Lakshmana Dora Chandrala and\n  Kirti Chandra Sahu","authorsParsed":[["Ade","Someshwar Sanjay",""],["Kirar","Pavan Kumar",""],["Chandrala","Lakshmana Dora",""],["Sahu","Kirti Chandra",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 05:00:30 GMT"}],"updateDate":"2024-07-19","timestamp":1721278830000,"abstract":"  We experimentally investigate the morphology and breakup of a droplet as it\ndescends freely from a height and encounters an airstream. The size\ndistributions of the child droplets are analysed using high-speed shadowgraphy\nand in-line holography techniques. We found that a droplet falling from various\nheights exhibits shape oscillations due to the intricate interplay between\ninertia and surface tension forces, leading to significant variations in the\nradial deformation of the droplet, influencing the breakup dynamics under an\nidentical airstream condition. Specifically, the droplet undergoes vibrational\nbreakup when introduced at a location slightly above the air nozzle. In\ncontrast, as the release height of the droplet increases, keeping the Weber\nnumber defined based on the velocity of the airstream fixed, a dynamic\ninterplay between the inertia of the droplet and the aerodynamic flow field\ncomes into play, resulting in a sequence of breakup modes transitioning from\nvibrational breakup to retracting bag breakup, bag breakup, bag-stamen,\nretracting bag-stamen breakup, and eventually returning to vibrational breakup.\nOur experiments also reveal that the size distribution resulting from\nretracting bag breakup primarily arises from rim and node fragmentation,\nleading to a bimodal distribution. In contrast, bag and bag-stamen breakups\nyield a tri-modal size distribution due to the combined contributions of bag,\nrim, and node breakup mechanisms. Furthermore, we utilize a theoretical model\nthat incorporates the effective Weber number, considering different release\nheights. This model accurately predicts the size distribution of the child\ndroplets resulting from the various breakup modes observed in our experiments.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BPVRPeWr4ItIxbNN7J5XspKlDrgCImvAydJenF9DE8Q","pdfSize":"4125093"}
