{"id":"2407.07829","title":"Disentangled Representation Learning through Geometry Preservation with\n  the Gromov-Monge Gap","authors":"Th\\'eo Uscidda, Luca Eyring, Karsten Roth, Fabian Theis, Zeynep Akata,\n  Marco Cuturi","authorsParsed":[["Uscidda","Théo",""],["Eyring","Luca",""],["Roth","Karsten",""],["Theis","Fabian",""],["Akata","Zeynep",""],["Cuturi","Marco",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 16:51:32 GMT"}],"updateDate":"2024-07-11","timestamp":1720630292000,"abstract":"  Learning disentangled representations in an unsupervised manner is a\nfundamental challenge in machine learning. Solving it may unlock other\nproblems, such as generalization, interpretability, or fairness. While\nremarkably difficult to solve in general, recent works have shown that\ndisentanglement is provably achievable under additional assumptions that can\nleverage geometrical constraints, such as local isometry. To use these\ninsights, we propose a novel perspective on disentangled representation\nlearning built on quadratic optimal transport. Specifically, we formulate the\nproblem in the Gromov-Monge setting, which seeks isometric mappings between\ndistributions supported on different spaces. We propose the Gromov-Monge-Gap\n(GMG), a regularizer that quantifies the geometry-preservation of an arbitrary\npush-forward map between two distributions supported on different spaces. We\ndemonstrate the effectiveness of GMG regularization for disentanglement on four\nstandard benchmarks. Moreover, we show that geometry preservation can even\nencourage unsupervised disentanglement without the standard reconstruction\nobjective - making the underlying model decoder-free, and promising a more\npractically viable and scalable perspective on unsupervised disentanglement.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MK8Y7prxTtEiJCKV9FyUO5hwRpA78nJvy7RTLio9F50","pdfSize":"1283875"}
