{"id":"2407.14292","title":"Adaptive Frequency Enhancement Network for Single Image Deraining","authors":"Fei Yan, Yuhong He, Keyu Chen, En Cheng and Jikang Ma","authorsParsed":[["Yan","Fei",""],["He","Yuhong",""],["Chen","Keyu",""],["Cheng","En",""],["Ma","Jikang",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:24:05 GMT"}],"updateDate":"2024-07-22","timestamp":1721395445000,"abstract":"  Image deraining aims to improve the visibility of images damaged by rainy\nconditions, targeting the removal of degradation elements such as rain streaks,\nraindrops, and rain accumulation. While numerous single image deraining methods\nhave shown promising results in image enhancement within the spatial domain,\nreal-world rain degradation often causes uneven damage across an image's entire\nfrequency spectrum, posing challenges for these methods in enhancing different\nfrequency components. In this paper, we introduce a novel end-to-end Adaptive\nFrequency Enhancement Network (AFENet) specifically for single image deraining\nthat adaptively enhances images across various frequencies. We employ\nconvolutions of different scales to adaptively decompose image frequency bands,\nintroduce a feature enhancement module to boost the features of different\nfrequency components and present a novel interaction module for interchanging\nand merging information from various frequency branches. Simultaneously, we\npropose a feature aggregation module that efficiently and adaptively fuses\nfeatures from different frequency bands, facilitating enhancements across the\nentire frequency spectrum. This approach empowers the deraining network to\neliminate diverse and complex rainy patterns and to reconstruct image details\naccurately. Extensive experiments on both real and synthetic scenes demonstrate\nthat our method not only achieves visually appealing enhancement results but\nalso surpasses existing methods in performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}