{"id":"2407.20692","title":"GPU-based data processing for speeding-up correlation plenoptic imaging","authors":"Francesca Santoro and Isabella Petrelli and Gianlorenzo Massaro and\n  George Filios and Francesco V. Pepe and Leonardo Amoruso and Maria Ieronimaki\n  and Samuel Burri and Edoardo Charbon and Paul Mos and Arin Ulku and Michael\n  Wayne and Cristoforo Abbattista and Claudio Bruschini and Milena D'Angelo","authorsParsed":[["Santoro","Francesca",""],["Petrelli","Isabella",""],["Massaro","Gianlorenzo",""],["Filios","George",""],["Pepe","Francesco V.",""],["Amoruso","Leonardo",""],["Ieronimaki","Maria",""],["Burri","Samuel",""],["Charbon","Edoardo",""],["Mos","Paul",""],["Ulku","Arin",""],["Wayne","Michael",""],["Abbattista","Cristoforo",""],["Bruschini","Claudio",""],["D'Angelo","Milena",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 09:41:06 GMT"}],"updateDate":"2024-07-31","timestamp":1722332466000,"abstract":"  Correlation Plenoptic Imaging (CPI) is a novel technological imaging modality\nenabling to overcome drawbacks of standard plenoptic devices, while preserving\ntheir advantages. However, a major challenge in view of real-time application\nof CPI is related with the relevant amount of required frames and the\nconsequent computational-intensive processing algorithm. In this work, we\ndescribe the design and implementation of an optimized processing algorithm\nthat is portable to an efficient computational environment and exploits the\nhighly parallel algorithm offered by GPUs. Improvements by a factor ranging\nfrom 20x, for correlation measurement, to 500x, for refocusing, are\ndemonstrated. Exploration of the relation between the improvement in\nperformance achieved and actual GPU capabilities, also indicates the\nfeasibility of near-real time processing capability, opening up to the\npotential use of CPI for practical real-time application.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XUj9AVJWh7xwW4WuV9yITSrktQUrcIhAnYIzDT3F1ec","pdfSize":"1670469"}
