{"id":"2407.19512","title":"Large-scale cervical precancerous screening via AI-assisted cytology\n  whole slide image analysis","authors":"Honglin Li, Yusuan Sun, Chenglu Zhu, Yunlong Zhang, Shichuan Zhang,\n  Zhongyi Shui, Pingyi Chen, Jingxiong Li, Sunyi Zheng, Can Cui, Lin Yang","authorsParsed":[["Li","Honglin",""],["Sun","Yusuan",""],["Zhu","Chenglu",""],["Zhang","Yunlong",""],["Zhang","Shichuan",""],["Shui","Zhongyi",""],["Chen","Pingyi",""],["Li","Jingxiong",""],["Zheng","Sunyi",""],["Cui","Can",""],["Yang","Lin",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 15:29:07 GMT"}],"updateDate":"2024-07-30","timestamp":1722180547000,"abstract":"  Cervical Cancer continues to be the leading gynecological malignancy, posing\na persistent threat to women's health on a global scale. Early screening via\ncytology Whole Slide Image (WSI) diagnosis is critical to prevent this Cancer\nprogression and improve survival rate, but pathologist's single test suffers\ninevitable false negative due to the immense number of cells that need to be\nreviewed within a WSI. Though computer-aided automated diagnostic models can\nserve as strong complement for pathologists, their effectiveness is hampered by\nthe paucity of extensive and detailed annotations, coupled with the limited\ninterpretability and robustness. These factors significantly hinder their\npractical applicability and reliability in clinical settings. To tackle these\nchallenges, we develop an AI approach, which is a Scalable Technology for\nRobust and Interpretable Diagnosis built on Extensive data (STRIDE) of cervical\ncytology. STRIDE addresses the bottleneck of limited annotations by integrating\npatient-level labels with a small portion of cell-level labels through an\nend-to-end training strategy, facilitating scalable learning across extensive\ndatasets. To further improve the robustness to real-world domain shifts of\ncytology slide-making and imaging, STRIDE employs color adversarial samples\ntraining that mimic staining and imaging variations. Lastly, to achieve\npathologist-level interpretability for the trustworthiness in clinical\nsettings, STRIDE can generate explanatory textual descriptions that simulates\npathologists' diagnostic processes by cell image feature and textual\ndescription alignment. Conducting extensive experiments and evaluations in 183\nmedical centers with a dataset of 341,889 WSIs and 0.1 billion cells from\ncervical cytology patients, STRIDE has demonstrated a remarkable superiority\nover previous state-of-the-art techniques.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}