{"id":"2407.10493","title":"Towards a multi-physics multi-scale approach of deep geothermal\n  exploration","authors":"M. Darnet (BRGM), S. Vedrine (BRGM), F. Bretaudeau (BRGM), S. Marc\n  (BRGM), L. Capar (BRGM), Joshua Pwavodi (ITES), G. Marquis (ITES), A.\n  Montegud (CGG), J. Formento (CGG), V. Maurer (ES G\\'eothermie), C. Glass (ES\n  G\\'eothermie), E. Delmais (ES G\\'eothermie), A. Genter (ES G\\'eothermie)","authorsParsed":[["Darnet","M.","","BRGM"],["Vedrine","S.","","BRGM"],["Bretaudeau","F.","","BRGM"],["Marc","S.","","BRGM"],["Capar","L.","","BRGM"],["Pwavodi","Joshua","","ITES"],["Marquis","G.","","ITES"],["Montegud","A.","","CGG"],["Formento","J.","","CGG"],["Maurer","V.","","ES Géothermie"],["Glass","C.","","ES\n  Géothermie"],["Delmais","E.","","ES Géothermie"],["Genter","A.","","ES Géothermie"]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 07:34:25 GMT"}],"updateDate":"2024-07-16","timestamp":1721028865000,"abstract":"  A wide range of geophysical methods is used for the exploration of deep\ngeothermal resources. It aimsat characterizing the deep fractured network and\nits capacity for fluid/heat extraction. This relieshowever on the capacity of\ngeophysical techniques to 1) image the geometry of the fractured networkbut\nalso 2) characterize the petro-physical properties of the fracture network and\nmatrix. The challengeis however that the geophysical inverse problem is\nill-posed and multi-scale.To overcome these challenges, we propose here to take\na multi-physics and multi-scale approach of thegeophysical/petro-physical\ninverse problem. To do so, we are developing iteratively petro-physical\nandgeophysical models that can explain the observables at the different scales.\nIn this paper, we report outthe results of the first iteration phase of this\nresearch project that consists in building an initial petrophysical model from\nwell logs and prior geological knowledge, and single-domain inversion\nofgeophysical data. We applied this methodology to the Upper Rhine Graben where\na wealth ofknowledge and dataset on deep fractured formations are available.\n","subjects":["Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}