{"id":"2407.18020","title":"Non-thermal radio emission in Sakurai's Object","authors":"Marcin Hajduk, Peter A. M. van Hoof, Albert A. Zijlstra, Griet Van de\n  Steene, Stefan Kimeswenger, Daniela Barr\\'ia, Daniel Tafoya, and Jes\\'us A.\n  Toal\\'a","authorsParsed":[["Hajduk","Marcin",""],["van Hoof","Peter A. M.",""],["Zijlstra","Albert A.",""],["Van de Steene","Griet",""],["Kimeswenger","Stefan",""],["Barría","Daniela",""],["Tafoya","Daniel",""],["Toalá","Jesús A.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 13:14:11 GMT"}],"updateDate":"2024-08-14","timestamp":1721913251000,"abstract":"  The very late thermal pulse (VLTP) affects the evolution of $\\sim$20\\% of\n1--8\\,$\\mathrm M_\\odot$ stars, repeating the last phases of the red giant\nwithin a few years and leading to the formation of a new, but hydrogen-poor\nnebula within the old planetary nebula (PN). The strong dust formation in the\nlatter obscures the optical and near-infrared radiation of the star. We aimed\nto determine the reheating timescale of the central star in Sakurai's object,\nwhich is an important constraint for the poorly understood VLTP evolution. We\nobserved the radio continuum emission of Sakurai's object for almost 20 years\nfrom 2004 to 2023. Continuous, multi-frequency observations proved to be\nessential to distinguish between phases dominated by photoionization and shock\nionization. The flux density fluctuates by more than a factor 40 within months\nto years. The spectral index remained negative between 2006 and 2017 and is\nclose to zero since 2019. The emission region is barely resolved since 2021.\nNon-thermal radio emission observed from 2004 to 2017 traces shocks induced by\nwind interactions due to discrete mass-loss events. Thermal emission dominates\nduring the period 2019--2023 and may indicate photoionization of the nebula by\nthe central star.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}