{"id":"2407.00808","title":"Exploring a Physics-Informed Decision Transformer for Distribution\n  System Restoration: Methodology and Performance Analysis","authors":"Hong Zhao, Jin Wei-Kocsis, Adel Heidari Akhijahani, and Karen L\n  Butler-Purry","authorsParsed":[["Zhao","Hong",""],["Wei-Kocsis","Jin",""],["Akhijahani","Adel Heidari",""],["Butler-Purry","Karen L",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 19:27:06 GMT"}],"updateDate":"2024-07-02","timestamp":1719775626000,"abstract":"  Driven by advancements in sensing and computing, deep reinforcement learning\n(DRL)-based methods have demonstrated significant potential in effectively\ntackling distribution system restoration (DSR) challenges under uncertain\noperational scenarios. However, the data-intensive nature of DRL poses\nobstacles in achieving satisfactory DSR solutions for large-scale, complex\ndistribution systems. Inspired by the transformative impact of emerging\nfoundation models, including large language models (LLMs), across various\ndomains, this paper explores an innovative approach harnessing LLMs' powerful\ncomputing capabilities to address scalability challenges inherent in\nconventional DRL methods for solving DSR. To our knowledge, this study\nrepresents the first exploration of foundation models, including LLMs, in\nrevolutionizing conventional DRL applications in power system operations. Our\ncontributions are twofold: 1) introducing a novel LLM-powered Physics-Informed\nDecision Transformer (PIDT) framework that leverages LLMs to transform\nconventional DRL methods for DSR operations, and 2) conducting comparative\nstudies to assess the performance of the proposed LLM-powered PIDT framework at\nits initial development stage for solving DSR problems. While our primary focus\nin this paper is on DSR operations, the proposed PIDT framework can be\ngeneralized to optimize sequential decision-making across various power system\noperations.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}