{"id":"2407.03137","title":"X-Shooting ULLYSES: Massive stars at low metallicity. IV. Spectral\n  analysis methods and exemplary results for O stars","authors":"A.A.C. Sander, J.-C. Bouret, M. Bernini-Peron, J. Puls, F. Backs, S.R.\n  Berlanas, J.M. Bestenlehner, S.A. Brands, A. Herrero, F. Martins, O. Maryeva,\n  D. Pauli, V. Ramachandran, P.A. Crowther, V.M.A. G\\'omez-Gonz\\'alez, A.C.\n  Gormaz-Matamala, W.-R. Hamann, D.J. Hillier, R. Kuiper, C.J.K. Larkin, R.R.\n  Lefever, A. Mehner, F. Najarro, L.M. Oskinova, E.C. Sch\\\"osser, T. Shenar, H.\n  Todt, A. ud-Doula, J.S. Vink","authorsParsed":[["Sander","A. A. C.",""],["Bouret","J. -C.",""],["Bernini-Peron","M.",""],["Puls","J.",""],["Backs","F.",""],["Berlanas","S. R.",""],["Bestenlehner","J. M.",""],["Brands","S. A.",""],["Herrero","A.",""],["Martins","F.",""],["Maryeva","O.",""],["Pauli","D.",""],["Ramachandran","V.",""],["Crowther","P. A.",""],["Gómez-González","V. M. A.",""],["Gormaz-Matamala","A. C.",""],["Hamann","W. -R.",""],["Hillier","D. J.",""],["Kuiper","R.",""],["Larkin","C. J. K.",""],["Lefever","R. R.",""],["Mehner","A.",""],["Najarro","F.",""],["Oskinova","L. M.",""],["Schösser","E. C.",""],["Shenar","T.",""],["Todt","H.",""],["ud-Doula","A.",""],["Vink","J. S.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 14:17:09 GMT"},{"version":"v2","created":"Sun, 1 Sep 2024 16:02:49 GMT"}],"updateDate":"2024-09-04","timestamp":1720016229000,"abstract":"  CONTEXT: The spectral analysis of hot, massive stars is a fundamental\nastrophysical method to obtain their intrinsic properties and their feedback.\nQuantitative spectroscopy for hot, massive stars requires detailed numerical\nmodeling of the atmosphere and an iterative treatment to obtain the best\nsolution within a given framework. AIMS: We present an overview of different\ntechniques for the quantitative spectroscopy of hot stars employed within the\nX-Shooting ULLYSES collaboration, from grid-based approaches to tailored fits.\nBy performing a blind test, we gain an overview about the similarities and\ndifferences of the resulting parameters. Our study aims to provide an overview\nof the parameter spread caused by different approaches. METHODS: For three\ndifferent stars from the sample (SMC O5 star AzV 377, LMC O7 star Sk -69 50,\nand LMC O9 star Sk -66 171), we employ different atmosphere codes (CMFGEN,\nFastwind, PoWR) and strategies to determine their best-fitting model. For our\nanalyses, UV and optical spectra are used to derive the properties with some\nmethods relying purely on optical data for comparison. To determine the overall\nspectral energy distribution, we further employ additional photometry from the\nliterature. RESULTS: Effective temperatures for each of three sample stars\nagree within 3 kK while the differences in log g can be up to 0.2 dex.\nLuminosity differences of up to 0.1 dex result from different reddening\nassumptions, which seem to be larger for the methods employing a genetic\nalgorithm. All sample stars are nitrogen-enriched. CONCLUSIONS: We find a\nreasonable agreement between the different methods. Tailored fitting tends to\nbe able to minimize discrepancies obtained with more course or automatized\ntreatments. UV spectral data is essential for the determination of realistic\nwind parameters. For one target (Sk -69 50), we find clear indications of an\nevolved status.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}