{"id":"2407.04544","title":"Arbitrary Waveform Generated Metasurface: A New Paradigm for Direct\n  Modulation and Beamforming Decoupling","authors":"Xuehui Dong, Bokai Lai, Rujing Xiong, Jianan Zhang, Miyu Feng, Tiebin\n  Mi, Robert Caiming Qiu","authorsParsed":[["Dong","Xuehui",""],["Lai","Bokai",""],["Xiong","Rujing",""],["Zhang","Jianan",""],["Feng","Miyu",""],["Mi","Tiebin",""],["Qiu","Robert Caiming",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 14:30:11 GMT"},{"version":"v2","created":"Mon, 8 Jul 2024 13:51:23 GMT"},{"version":"v3","created":"Wed, 24 Jul 2024 06:44:33 GMT"}],"updateDate":"2024-07-25","timestamp":1720189811000,"abstract":"  Information Metasurface, also known as reconfigurable intelligent surface\n(RIS) has gained significant attention owing to its impressive abilities in\nelectromagnetic (EM) wave manipulation with simple structures. Numerous studies\nfocus on achieving efficient and versatile information transmission using RIS\nacross various fields like wireless communication, radar detection, integrated\nsensing, and communications, among others. Previous studies demonstrate diverse\napproaches to achieve reflection modulation by utilizing the superposition of\nthe quantified reflection coefficient (RC) of each unit but suffer from the\ncomputing complexity of codebook sequence, the safety of communication, and the\nflexibility of modulation. To address these challenges, we introduce a novel\nconcept of information metasurface, namely AWG-RIS, which is capable of\nindependently producing arbitrary baseband waveforms and beam patterns through\na design that decouples magnitude and phase, without changing the beam pattern.\nThe AWG-RIS functions as a reflection mixer, directly embedding the intended\nsignal into the incoming EM waves. Subsequently, we developed an analysis\nframework and introduced the waveform factor and beamforming factor into the\nnew model, offering theoretical support for the transition from the control\nsignal to the outgoing electromagnetic wave. Additionally, we unveil the\nworld's first prototype showcasing passive arbitrary waveform generation while\nmaintaining the beam pattern unaltered. Leveraging the decoupling of direct\nmodulation and beamforming, we explore additional applications in several\ndomains relative to traditional RISs. Finally, we present experiments that\nconfirm the generation of arbitrary waveforms and particular spectrograms.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}