{"id":"2407.01713","title":"Enhancing inflationary model predictions via refined slow-roll dynamics","authors":"Debottam Nandi (University of Delhi), Simran Yadav (University of\n  Delhi), Manjeet Kaur (University of Delhi)","authorsParsed":[["Nandi","Debottam","","University of Delhi"],["Yadav","Simran","","University of\n  Delhi"],["Kaur","Manjeet","","University of Delhi"]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:41:04 GMT"},{"version":"v2","created":"Sun, 14 Jul 2024 07:14:28 GMT"}],"updateDate":"2024-07-16","timestamp":1719859264000,"abstract":"  The inflationary paradigm not only addresses early Universe puzzles but also\naligns well with the observational constraints, with slow-roll inflationary\nmodels fitting best. Evaluating these model predictions requires considering\nboth slow-roll inflationary dynamics and the subsequent reheating epoch. This\ninvolves the quantitative analysis that takes into account the effective\nequation of state (EoS) and duration of reheating, connecting these with the\nperturbations generated deep during the inflationary era. Given the\ncomplexities involved, many approximations are often used for simplification.\nHowever, as future observations are expected to improve the accuracy of these\nobservables significantly, this work takes a different approach. Instead of\nrelying on approximations, we consider the near-accurate solutions of\ninflationary models and compare our results with the pre-existing ones. It\nmainly incorporates two improvements: the first is the accurate dynamics of the\nslow-roll evolution, and, thus, the end of inflation; and the second is the\nhigher-order slow-roll corrections to the perturbed observables. Our findings\nindicate that, by implementing these corrections, the theoretical predictions\nimprove significantly. It also indicates that seemingly minor corrections can\nhave significant effects on the perturbed observables, and these refined\npredictions can be compared with future observations to potentially rule out\nmodels and help resolve the degeneracy problem of the inflationary paradigm.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}