{"id":"2407.21282","title":"FedBChain: A Blockchain-enabled Federated Learning Framework for\n  Improving DeepConvLSTM with Comparative Strategy Insights","authors":"Gaoxuan Li, Chern Hong Lim, Qiyao Ma, Xinyu Tang, Hwa Hui Tew, Fan\n  Ding, and Xuewen Luo","authorsParsed":[["Li","Gaoxuan",""],["Lim","Chern Hong",""],["Ma","Qiyao",""],["Tang","Xinyu",""],["Tew","Hwa Hui",""],["Ding","Fan",""],["Luo","Xuewen",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 02:12:05 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 07:00:13 GMT"}],"updateDate":"2024-08-08","timestamp":1722391925000,"abstract":"  Recent research in the field of Human Activity Recognition has shown that an\nimprovement in prediction performance can be achieved by reducing the number of\nLSTM layers. However, this kind of enhancement is only significant on\nmonolithic architectures, and when it runs on large-scale distributed training,\ndata security and privacy issues will be reconsidered, and its prediction\nperformance is unknown. In this paper, we introduce a novel framework:\nFedBChain, which integrates the federated learning paradigm based on a modified\nDeepConvLSTM architecture with a single LSTM layer. This framework performs\ncomparative tests of prediction performance on three different real-world\ndatasets based on three different hidden layer units (128, 256, and 512)\ncombined with five different federated learning strategies, respectively. The\nresults show that our architecture has significant improvements in Precision,\nRecall and F1-score compared to the centralized training approach on all\ndatasets with all hidden layer units for all strategies: FedAvg strategy\nimproves on average by 4.54%, FedProx improves on average by 4.57%,\nFedTrimmedAvg improves on average by 4.35%, Krum improves by 4.18% on average,\nand FedAvgM improves by 4.46% on average. Based on our results, it can be seen\nthat FedBChain not only improves in performance, but also guarantees the\nsecurity and privacy of user data compared to centralized training methods\nduring the training process. The code for our experiments is publicly available\n(https://github.com/Glen909/FedBChain).\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}