{"id":"2407.16295","title":"Manifoldchain: Maximizing Blockchain Throughput via Bandwidth-Clustered\n  Sharding","authors":"Chunjiang Che, Songze Li, Xuechao Wang","authorsParsed":[["Che","Chunjiang",""],["Li","Songze",""],["Wang","Xuechao",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 08:52:51 GMT"}],"updateDate":"2024-07-24","timestamp":1721724771000,"abstract":"  Bandwidth limitation is the major bottleneck that hinders scaling throughput\nof proof-of-work blockchains. To guarantee security, the mining rate of the\nblockchain is determined by the miners with the lowest bandwidth, resulting in\nan inefficient bandwidth utilization among fast miners. We propose\nManifoldchain, an innovative blockchain sharding protocol that alleviates the\nimpact of slow miners to maximize blockchain throughput. Manifoldchain utilizes\na bandwidth-clustered shard formation mechanism that groups miners with similar\nbandwidths into the same shard. Consequently, this approach enables us to set\nan optimal mining rate for each shard based on its bandwidth, effectively\nreducing the waiting time caused by slow miners. Nevertheless, the adversary\ncould corrupt miners with similar bandwidths, thereby concentrating hashing\npower and potentially creating an adversarial majority within a single shard.\nTo counter this adversarial strategy, we introduce sharing mining, allowing the\nhonest mining power of the entire network to participate in the secure ledger\nformation of each shard, thereby achieving the same level of security as an\nunsharded blockchain. Additionally, we introduce an asynchronous atomic\ncommitment mechanism to ensure transaction atomicity across shards with various\nmining rates. Our theoretical analysis demonstrates that Manifoldchain scales\nlinearly in throughput with the increase in shard numbers and inversely with\nnetwork delay in each shard. We implement a full system prototype of\nManifoldchain, comprehensively evaluated on both simulated and real-world\ntestbeds. These experiments validate its vertical scalability with network\nbandwidth and horizontal scalability with network size, achieving a substantial\nimprovement of 186% in throughput over baseline sharding protocols, for\nscenarios where bandwidths of miners range from 5Mbps to 60Mbps.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}