{"id":"2407.17559","title":"Pulling order back from the brink of disorder: Observation of a nodal\n  line spin liquid and fluctuation stabilized order in K$_2$IrCl$_6$","authors":"Qiaochu Wang, Alberto de la Torre, Jose A. Rodriguez-Rivera, Andrey A.\n  Podlesnyak, Wei Tian, Adam A. Aczel, Masaaki Matsuda, Philip J. Ryan,\n  Jong-Woo Kim, Jeffrey G. Rau, Kemp W. Plumb","authorsParsed":[["Wang","Qiaochu",""],["de la Torre","Alberto",""],["Rodriguez-Rivera","Jose A.",""],["Podlesnyak","Andrey A.",""],["Tian","Wei",""],["Aczel","Adam A.",""],["Matsuda","Masaaki",""],["Ryan","Philip J.",""],["Kim","Jong-Woo",""],["Rau","Jeffrey G.",""],["Plumb","Kemp W.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-26","timestamp":1721844003000,"abstract":"  Competing interactions in frustrated magnets can give rise to highly\ndegenerate ground states from which correlated liquid-like states of matter\noften emerge. The scaling of this degeneracy influences the ultimate ground\nstate, with extensive degeneracies potentially yielding quantum spin liquids,\nwhile sub-extensive or smaller degeneracies yield static orders. A longstanding\nproblem is to understand how ordered states precipitate from this degenerate\nmanifold and what echoes of the degeneracy survive ordering. Here, we use\nneutron scattering to experimentally demonstrate a new \"nodal line\" spin\nliquid, where spins collectively fluctuate within a sub-extensive manifold\nspanning one-dimensional lines in reciprocal space. Realized in the spin-orbit\ncoupled, face-centered cubic iridate K$_2$IrCl$_6$, we show that the\nsub-extensive degeneracy is robust, but remains susceptible to fluctuations or\nlonger range interactions which cooperate to select a magnetic order at low\ntemperatures. Proximity to the nodal line spin liquid influences the ordered\nstate, enhancing the effects of quantum fluctuations and stabilizing it through\nthe opening of a large spin-wave gap. Our results demonstrate quantum\nfluctuations can act counter-intuitively in frustrated materials: instead of\ndestabilizing ordering, at the brink of the nodal spin liquid they can act to\nstabilize it and dictate its low-energy physics.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"f5t9rrRybfZVup3kv0Ih-JwWp5VjgbtnsPMdyEPRgM4","pdfSize":"7087076"}
