{"id":"2407.10155","title":"A Nan\\c{c}ay Radio Telescope study of the hyperactive repeating FRB\n  20220912A","authors":"David C. Konijn, Dant\\'e M. Hewitt, Jason W. T. Hessels, Isma\\\"el\n  Cognard, Jeff Huang, Omar S. Ould-Boukattine, Pragya Chawla, Kenzie Nimmo,\n  Mark P. Snelders, Akshatha Gopinath, Ninisha Manaswini","authorsParsed":[["Konijn","David C.",""],["Hewitt","Danté M.",""],["Hessels","Jason W. T.",""],["Cognard","Ismaël",""],["Huang","Jeff",""],["Ould-Boukattine","Omar S.",""],["Chawla","Pragya",""],["Nimmo","Kenzie",""],["Snelders","Mark P.",""],["Gopinath","Akshatha",""],["Manaswini","Ninisha",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 10:55:07 GMT"}],"updateDate":"2024-07-16","timestamp":1720954507000,"abstract":"  The repeating fast radio burst source FRB 20220912A was remarkably active in\nthe weeks after its discovery. Here we report 696 bursts detected with the\nNan\\c{c}ay Radio Telescope (NRT) as part of the Extragalactic Coherent Light\nfrom Astrophysical Transients (\\'ECLAT) monitoring campaign. We present 68\nobservations, conducted from October 2022 to April 2023, with a total duration\nof 61 hours and an event rate peaking at $75^{+10}_{-9}$ bursts per hour above\na fluence threshold of 0.59 Jy ms in the $1.2-1.7$-GHz band. Most bursts in the\nsample occur towards the bottom of the observing band. They follow a bimodal\nwait-time distribution, with peaks at 33.4 ms and 67.0 s. We find a roughly\nconstant dispersion measure (DM) over time ($\\delta$DM $\\lesssim$ 2 pc\ncm$^{-3}$) when taking into account `sad-trombone' drift, with a mean drift\nrate of $-8.8 $MHz ms$^{-1}$. Nonetheless, we confirm small $\\sim0.3$ pc\ncm$^{-3}$ DM variations using microshot structure, while finding that\nmicrostructure is rare in our sample -- despite the 16 $\\mu$s time resolution\nof the data. The cumulative spectral energy distribution shows more high-energy\nbursts ($E_\\nu \\gtrsim 10^{31}$ erg/Hz) than would be expected from a simple\npower-law distribution. The burst rate per observation appears Poissonian, but\nthe full set of observations is better modelled by a Weibull distribution,\nshowing clustering. We discuss the various observational similarities that FRB\n20220912A shares with other (hyper)active repeaters, which as a group are\nbeginning to show a common set of phenomenological traits that provide multiple\nuseful dimensions for their quantitative comparison and modelling.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IJu-PWHwlIIqbM3fJh7FmTMu3znoe-Ov-D_rgbhwWw4","pdfSize":"6255965"}
