{"id":"2407.17182","title":"Solving the Electrical Impedance Tomography Problem with a DeepONet Type\n  Neural Network: Theory and Application","authors":"Anuj Abhishek and Thilo Strauss","authorsParsed":[["Abhishek","Anuj",""],["Strauss","Thilo",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 11:34:24 GMT"}],"updateDate":"2024-07-25","timestamp":1721820864000,"abstract":"  In this work, we consider the non-invasive medical imaging modality of\nElectrical Impedance Tomography, where the problem is to recover the\nconductivity in a medium from a set of data that arises out of a\ncurrent-to-voltage map (Neumann-to-Dirichlet operator) defined on the boundary\nof the medium. We formulate this inverse problem as an operator-learning\nproblem where the goal is to learn the implicitly defined operator-to-function\nmap between the space of Neumann-to-Dirichlet operators to the space of\nadmissible conductivities. Subsequently, we use an operator-learning\narchitecture, popularly called DeepONets, to learn this operator-to-function\nmap. Thus far, most of the operator learning architectures have been\nimplemented to learn operators between function spaces. In this work, we\ngeneralize the earlier works and use a DeepONet to actually {learn an\noperator-to-function} map. We provide a Universal Approximation Theorem type\nresult which guarantees that this implicitly defined operator-to-function map\nbetween the space of Neumann-to-Dirichlet operator to the space of conductivity\nfunction can be approximated to an arbitrary degree using such a DeepONet.\nFurthermore, we provide a computational implementation of our proposed approach\nand compare it against a standard baseline. We show that the proposed approach\nachieves good reconstructions and outperforms the baseline method in our\nexperiments.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"l5x1oT7OJYlyVwOKg-XWG8aCHRR7yRCX8SCDCH0KKbk","pdfSize":"842002"}
