{"id":"2407.12653","title":"Adaptive Finite Blocklength for Low Access Delay in 6G Wireless Networks","authors":"Yixin Zhang, Wenchi Cheng, and Wei Zhang","authorsParsed":[["Zhang","Yixin",""],["Cheng","Wenchi",""],["Zhang","Wei",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:34:55 GMT"}],"updateDate":"2024-07-18","timestamp":1721230495000,"abstract":"  As the number of real-time applications with ultra-low delay requirements\nquickly grows, massive ultra-reliable and low-latency communication (mURLLC)\nhas been proposed to provide a wide range of delay-sensitive services for the\nsixth generation (6G) wireless networks. However, it is difficult to meet the\nstringent delay demand of massive connectivity with existing grant-based (GB)\nrandom access and fixed frame structure in long-term evolution (LTE) and the\nfifth generation (5G) new radio (NR) systems. To solve this problem, in this\npaper we propose the new grant-free (GF) based adaptive blocklength scheme for\nshort packet transmission to reduce the access delay. We develop the adaptive\nblocklength framework where the blocklength can be adaptively changed according\nto the real-time load, to revise the traditional non-flexible frame structure\nwhich impacts the delay performance. Taking the features of mURLLC into\nconsideration, we analyze the GF random access procedure, packet arrival\nbehavior, packet collision, and packet transmission error in the finite\nblocklength (FB) regime. On this basis, we derive the closed-form expression of\nsuccessful access and transmission probability and give the GF-based status\nupdate model. Then, we propose the access delay minimization problem that\njointly considers queuing delay and transmission delay to reduce the overall\naccess delay. With the alternating optimization algorithm, we obtain the\noptimal blocklength of each packet, thus forming the corresponding adaptive\nblocklength scheme for mURLLC. Simulation results verify the correctness of\ntheoretical results and show that our proposed adaptive blocklength scheme can\nsignificantly reduce the access delay compared with that of LTE and 5G NR\nsystems.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}