{"id":"2407.02985","title":"Spatiotemporal patterns in the active cyclic Potts model","authors":"Hiroshi Noguchi and Jean-Baptiste Fournier","authorsParsed":[["Noguchi","Hiroshi",""],["Fournier","Jean-Baptiste",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 10:31:37 GMT"}],"updateDate":"2024-07-04","timestamp":1720002697000,"abstract":"  The nonequilibrium dynamics of a cycling three state Potts model is studied\non a square lattice using Monte Carlo simulations and continuum theory. This\nmodel is relevant to chemical reactions on a catalytic surface and to molecular\ntransport across a membrane. Several characteristic modes are formed depending\non the flipping energies between successive states and the contact energies\nbetween neighboring sites. Under cyclic symmetry conditions, cycling\nhomogeneous phases and spiral waves form at low and high flipping energies,\nrespectively. In the intermediate flipping energy regime, these two modes\ncoexist temporally in small systems and/or at low contact energies. Under\nasymmetric conditions, we observed small biphasic domains exhibiting\namoeba-like locomotion and temporal coexistence of spiral waves and a dominant\nnon-cyclic one-state phase. An increase in the flipping energy between two\nsuccessive states, say state 0 and state 1, while keeping the other flipping\nenergies constant, induces the formation of the third phase (state 2), owing to\nthe suppression of the nucleation of state 0 domains. Under asymmetric\nconditions regarding the contact energies, two different modes can appear\ndepending on the initial state, due to a hysteresis phenomenon.\n","subjects":["Condensed Matter/Statistical Mechanics","Nonlinear Sciences/Pattern Formation and Solitons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"R3ANqY2NJLbelHJd_8oCHqmnnkRCf2pamFrl8_QQkug","pdfSize":"1698982","objectId":"0x63aabca93744d5c63c99df22a4397f6c09d115e025b111f6fd6749dc87fa44ba","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
