{"id":"2407.01438","title":"Instrument Overview of Taurus: A Balloon-borne CMB and Dust Polarization\n  Experiment","authors":"Jared L. May, Alexandre E. Adler, Jason E. Austermann, Steven J.\n  Benton, Rick Bihary, Malcolm Durkin, Shannon M. Duff, Jeffrey P. Filippini,\n  Aurelien A. Fraisse, Thomas J.L.J. Gascard, Sho M. Gibbs, Suren Gourapura,\n  Jon E. Gudmundsson, John W. Hartley, Johannes Hubmayr, William C. Jones,\n  Steven Li, Johanna M. Nagy, Kate Okun, Ivan L. Padilla, L. Javier Romualdez,\n  Simon Tartakovsky, Michael R. Vissers","authorsParsed":[["May","Jared L.",""],["Adler","Alexandre E.",""],["Austermann","Jason E.",""],["Benton","Steven J.",""],["Bihary","Rick",""],["Durkin","Malcolm",""],["Duff","Shannon M.",""],["Filippini","Jeffrey P.",""],["Fraisse","Aurelien A.",""],["Gascard","Thomas J. L. J.",""],["Gibbs","Sho M.",""],["Gourapura","Suren",""],["Gudmundsson","Jon E.",""],["Hartley","John W.",""],["Hubmayr","Johannes",""],["Jones","William C.",""],["Li","Steven",""],["Nagy","Johanna M.",""],["Okun","Kate",""],["Padilla","Ivan L.",""],["Romualdez","L. Javier",""],["Tartakovsky","Simon",""],["Vissers","Michael R.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 16:32:21 GMT"},{"version":"v2","created":"Sat, 13 Jul 2024 15:13:06 GMT"}],"updateDate":"2024-07-16","timestamp":1719851541000,"abstract":"  Taurus is a balloon-borne cosmic microwave background (CMB) experiment\noptimized to map the E-mode polarization and Galactic foregrounds at the\nlargest angular scales ($\\ell$ $\\lt$ 30) and improve measurements of the\noptical depth to reionization ($\\tau$). This will pave the way for improved\nmeasurements of the sum of neutrino masses in combination with high-resolution\nCMB data while also testing the $\\Lambda CDM$ model on large angular scales and\nproviding high-frequency maps of polarized dust foregrounds to the CMB\ncommunity. These measurements take advantage of the low-loading environment\nfound in the stratosphere and are enabled by NASA's super-pressure balloon\nplatform, which provides access to 70% of the sky with a launch from Wanaka,\nNew Zealand. Here we describe a general overview of Taurus, with an emphasis on\nthe instrument design. Taurus will employ more than 10,000 100 mK transition\nedge sensor bolometers distributed across two low-frequency (150, 220 GHz) and\none high-frequency (280, 350 GHz) dichroic receivers. The liquid helium\ncryostat housing the detectors and optics is supported by a lightweight\ngondola. The payload is designed to meet the challenges in mass, power, and\nthermal control posed by the super-pressure platform. The instrument and scan\nstrategy are optimized for rigorous control of instrumental systematics,\nenabling high-fidelity linear polarization measurements on the largest angular\nscales.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}