{"id":"2407.12229","title":"Laugh Now Cry Later: Controlling Time-Varying Emotional States of\n  Flow-Matching-Based Zero-Shot Text-to-Speech","authors":"Haibin Wu, Xiaofei Wang, Sefik Emre Eskimez, Manthan Thakker, Daniel\n  Tompkins, Chung-Hsien Tsai, Canrun Li, Zhen Xiao, Sheng Zhao, Jinyu Li,\n  Naoyuki Kanda","authorsParsed":[["Wu","Haibin",""],["Wang","Xiaofei",""],["Eskimez","Sefik Emre",""],["Thakker","Manthan",""],["Tompkins","Daniel",""],["Tsai","Chung-Hsien",""],["Li","Canrun",""],["Xiao","Zhen",""],["Zhao","Sheng",""],["Li","Jinyu",""],["Kanda","Naoyuki",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 00:54:15 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 10:40:11 GMT"}],"updateDate":"2024-09-18","timestamp":1721177655000,"abstract":"  People change their tones of voice, often accompanied by nonverbal\nvocalizations (NVs) such as laughter and cries, to convey rich emotions.\nHowever, most text-to-speech (TTS) systems lack the capability to generate\nspeech with rich emotions, including NVs. This paper introduces EmoCtrl-TTS, an\nemotion-controllable zero-shot TTS that can generate highly emotional speech\nwith NVs for any speaker. EmoCtrl-TTS leverages arousal and valence values, as\nwell as laughter embeddings, to condition the flow-matching-based zero-shot\nTTS. To achieve high-quality emotional speech generation, EmoCtrl-TTS is\ntrained using more than 27,000 hours of expressive data curated based on\npseudo-labeling. Comprehensive evaluations demonstrate that EmoCtrl-TTS excels\nin mimicking the emotions of audio prompts in speech-to-speech translation\nscenarios. We also show that EmoCtrl-TTS can capture emotion changes, express\nstrong emotions, and generate various NVs in zero-shot TTS. See\nhttps://aka.ms/emoctrl-tts for demo samples.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}