{"id":"2407.06918","title":"Identity-enabled CDMA LiDAR for massively parallel ranging with a\n  single-element receiver","authors":"Yixiu Shen, Zi Heng Lim, Guangya Zhou","authorsParsed":[["Shen","Yixiu",""],["Lim","Zi Heng",""],["Zhou","Guangya",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 14:53:52 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 13:03:43 GMT"}],"updateDate":"2024-07-11","timestamp":1720536832000,"abstract":"  Light detection and ranging (LiDAR) have emerged as a crucial tool for\nhigh-resolution 3D imaging, particularly in autonomous vehicles, remote\nsensing, and augmented reality. However, the increasing demand for faster\nacquisition speed and higher resolution in LiDAR systems has highlighted the\nlimitations of traditional mechanical scanning methods. This study introduces a\nnovel wavelength-multiplexed code-division multiple access (CDMA) parallel\nlaser ranging approach with a single-pixel receiver to address these\nchallenges. By leveraging the unique properties of Gold-sequences in a\ndirect-sequence spread spectrum (DSSS) framework, our design enables\ncomprehensive parallelization in detection and ranging activities to\nsignificantly enhance system efficiency and user capacity. The proposed coaxial\narchitecture simplifies hardware requirements using a single avalanche\nphotodiode (APD) for multi-reception, reducing susceptibility to ambient noise\nand external interferences. We demonstrate 3D imaging at 5 m and 10 m, and the\nexperimental results highlight the capability of our CDMA LiDAR system to\nachieve 40 parallel ranging channels with centimeter-level depth resolution and\nan angular resolution of 0.03 degree. Furthermore, our system allows for user\nidentification modulation, enabling identity-based ranging among different\nusers. The robustness of our proposed system against interference and speckle\nnoise and near-far signal problems, combined with its potential for\nminiaturization and integration into chip-scale optics, presents a promising\navenue to develop high-performance, compact LiDAR systems suitable for\ncommercial applications.\n","subjects":["Physics/Optics","Electrical Engineering and Systems Science/Image and Video Processing","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}