{"id":"2407.20621","title":"Four $\\mathbb{S}\\mathbb{T}\\mathbb{U}$ Black Holes Shadows","authors":"Yassine Sekhmani, Dhruba Jyoti Gogoi, Ratbay Myrzakulov, Giuseppe\n  Gaetano Luciano and Javlon Rayimbaev","authorsParsed":[["Sekhmani","Yassine",""],["Gogoi","Dhruba Jyoti",""],["Myrzakulov","Ratbay",""],["Luciano","Giuseppe Gaetano",""],["Rayimbaev","Javlon",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 07:55:26 GMT"}],"updateDate":"2024-07-31","timestamp":1722326126000,"abstract":"  In this work, we examine the optical behaviors and thermodynamic phase\nstructures using shadow analysis for four $\\mathbb{S}\\mathbb{T}\\mathbb{U}$\nblack holes. The study is conducted for four cases of charge configurations on\nthe parameter space $\\mathcal{M}\\left(q_1,q_2,q_3,q_4\\right)$. As a matter of\nfact, both the electric charge as a parameter and the parameter space\n$\\mathcal{M}\\left(q_1,q_2,q_3,q_4\\right)$ affect the geometry of the black hole\nshadow, particularly the size of the shadow. We also introduce a constraint on\nthe charge of the black hole from the observational results of the M87$^\\star$\n{\\color{black}and Sgr A$^\\star$} shadow. Furthermore, we show that the electric\ncharge and the parameter space $\\mathcal{M}\\left(q_1,q_2,q_3,q_4\\right)$ have a\nnon-trivial impact on the variation of the energy emission rate. Interestingly\nenough, we find novel scenarios in which the evaporation is slower, which\ncauses the lifetime of the black holes to be considerably elongated. On the\nother side, the phase structure of four $\\mathbb{S}\\mathbb{T}\\mathbb{U}$ black\nholes is explored for two cases of electric charge configuration. The findings\nshow a perfect correlation between the shadow and event horizon radii. This\ncorrelation is, in fact, helpful in discovering the phase transition in terms\nof the shadow radius. In addition, the microstructure is being analyzed in\nterms of shadow analysis, providing similar behavior to the ordinary situation\nof the Ruppeiner formalism.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}