{"id":"2407.11111","title":"Scalable Networking of Neutral-Atom Qubits: Nanofiber-Based Approach for\n  Multiprocessor Fault-Tolerant Quantum Computer","authors":"Shinichi Sunami, Shiro Tamiya, Ryotaro Inoue, Hayata Yamasaki, Akihisa\n  Goban","authorsParsed":[["Sunami","Shinichi",""],["Tamiya","Shiro",""],["Inoue","Ryotaro",""],["Yamasaki","Hayata",""],["Goban","Akihisa",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-17","timestamp":1721066400000,"abstract":"  Neutral atoms are among the leading platforms toward realizing fault-tolerant\nquantum computation (FTQC). However, scaling up a single neutral-atom device\nbeyond $\\sim 10^4$ atoms to meet the demands of FTQC for practical applications\nremains a challenge. To overcome this challenge, we clarify the criteria and\ntechnological requirements for further scaling based on multiple neutral atom\nquantum processing units (QPUs) connected through photonic networking links.\nOur quantitative analysis shows that nanofiber optical cavities have the\npotential as an efficient atom-photon interface to enable fast entanglement\ngeneration between atoms in distinct neutral-atom modules, allowing multiple\nneutral-atom QPUs to operate cooperatively without sacrificing computational\nspeed. Using state-of-the-art millimeter-scale nanofiber cavities with the\nfinesse of thousands, over a hundred atoms can be coupled to the cavity mode\nwith an optical tweezer array, with expected single-atom cooperativity\nexceeding 100 for telecom-band transition of ytterbium atoms. This enables\nefficient time-multiplexed entanglement generation with a predicted Bell pair\ngeneration rate of 100 kHz while maintaining a small footprint for channel\nmultiplexing. These proposals and results indicate a promising pathway for\nbuilding large-scale multiprocessor fault-tolerant quantum computers using\nneutral atoms, nanofiber optical cavities, and fiber-optic networks.\n","subjects":["Physics/Quantum Physics","Physics/Atomic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}