{"id":"2407.05805","title":"Computational Complexity-Constrained Spectral Efficiency Analysis for 6G\n  Waveforms","authors":"Saulo Queiroz, Jo\\~ao P. Vilela, Benjamin Koon Kei Ng, Chan-Tong Lam,\n  and Edmundo Monteiro","authorsParsed":[["Queiroz","Saulo",""],["Vilela","João P.",""],["Ng","Benjamin Koon Kei",""],["Lam","Chan-Tong",""],["Monteiro","Edmundo",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 10:31:58 GMT"}],"updateDate":"2024-07-09","timestamp":1720434718000,"abstract":"  In this work, we present a tutorial on how to account for the computational\ntime complexity overhead of signal processing in the spectral efficiency (SE)\nanalysis of wireless waveforms. Our methodology is particularly relevant in\nscenarios where achieving higher SE entails a penalty in complexity, a common\ntrade-off present in 6G candidate waveforms. We consider that SE derives from\nthe data rate, which is impacted by time-dependent overheads. Thus, neglecting\nthe computational complexity overhead in the SE analysis grants an unfair\nadvantage to more computationally complex waveforms, as they require larger\ncomputational resources to meet a signal processing runtime below the symbol\nperiod. We demonstrate our points with two case studies. In the first, we refer\nto IEEE 802.11a-compliant baseband processors from the literature to show that\ntheir runtime significantly impacts the SE perceived by upper layers. In the\nsecond case study, we show that waveforms considered less efficient in terms of\nSE can outperform their more computationally expensive counterparts if provided\nwith equivalent high-performance computational resources. Based on these cases,\nwe believe our tutorial can address the comparative SE analysis of waveforms\nthat operate under different computational resource constraints.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Computational Complexity","Computing Research Repository/Performance"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}