{"id":"2407.13401","title":"Cooperative Integrated Sensing and Communication Networks: Analysis and\n  Distributed Design","authors":"Bowen Wang, Hongyu Li, Fan Liu, Ziyang Cheng, and Shanpu Shen","authorsParsed":[["Wang","Bowen",""],["Li","Hongyu",""],["Liu","Fan",""],["Cheng","Ziyang",""],["Shen","Shanpu",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 11:09:43 GMT"}],"updateDate":"2024-07-19","timestamp":1721300983000,"abstract":"  This paper proposes a cooperative integrated sensing and communication\nnetwork (Co-ISACNet) adopting hybrid beamforming (HBF) architecture, which\nimproves both radar sensing and communication performance. The main\ncontributions of this work are four-fold. First, we introduce a novel\ncooperative sensing method for the considered Co-ISACNet, followed by a\ncomprehensive analysis of this method. This analysis mathematically verifies\nthe benefits of Co-ISACNet and provides insightful design guidelines. Second,\nto show the benefits of Co-ISACNet, we propose to jointly design the HBF to\nmaximize the network communication capacity while satisfying the constraint of\nbeampattern similarity for radar sensing, which results in a highly dimensional\nand non-convex problem. Third, to facilitate the joint design, we propose a\nnovel distributed optimization framework based on proximal gradient and\nalternating direction method of multipliers, namely PANDA. Fourth, we further\nadopt the proposed PANDA framework to solve the joint HBF design problem for\nthe Co-ISACNet. By using the proposed PANDA framework, all access points (APs)\noptimize the HBF in parallel, where each AP only requires local channel state\ninformation and limited message exchange among the APs. Such framework reduces\nsignificantly the computational complexity and thus has pronounced benefits in\npractical scenarios. Simulation results verify the effectiveness of the\nproposed algorithm compared with the conventional centralized algorithm and\nshow the remarkable performance improvement of radar sensing and communication\nby deploying Co-ISACNet.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}