{"id":"2407.10195","title":"V2I-Calib: A Novel Calibration Approach for Collaborative Vehicle and\n  Infrastructure LiDAR Systems","authors":"Qianxin Qu, Yijin Xiong, Guipeng Zhang, Xin Wu, Xiaohan Gao, Xin Gao,\n  Hanyu Li, Shichun Guo, and Guoying Zhang","authorsParsed":[["Qu","Qianxin",""],["Xiong","Yijin",""],["Zhang","Guipeng",""],["Wu","Xin",""],["Gao","Xiaohan",""],["Gao","Xin",""],["Li","Hanyu",""],["Guo","Shichun",""],["Zhang","Guoying",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 13:34:00 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 07:26:55 GMT"}],"updateDate":"2024-09-19","timestamp":1720964040000,"abstract":"  Cooperative LiDAR systems integrating vehicles and road infrastructure,\ntermed V2I calibration, exhibit substantial potential, yet their deployment\nencounters numerous challenges. A pivotal aspect of ensuring data accuracy and\nconsistency across such systems involves the calibration of LiDAR units across\nheterogeneous vehicular and infrastructural endpoints. This necessitates the\ndevelopment of calibration methods that are both real-time and robust,\nparticularly those that can ensure robust performance in urban canyon scenarios\nwithout relying on initial positioning values. Accordingly, this paper\nintroduces a novel approach to V2I calibration, leveraging spatial association\ninformation among perceived objects. Central to this method is the innovative\nOverall Intersection over Union (oIoU) metric, which quantifies the correlation\nbetween targets identified by vehicle and infrastructure systems, thereby\nfacilitating the real-time monitoring of calibration results. Our approach\ninvolves identifying common targets within the perception results of vehicle\nand infrastructure LiDAR systems through the construction of an affinity\nmatrix. These common targets then form the basis for the calculation and\noptimization of extrinsic parameters. Comparative and ablation studies\nconducted using the DAIR-V2X dataset substantiate the superiority of our\napproach. For further insights and resources, our project repository is\naccessible at https://github.com/MassimoQu/v2i-calib.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}