{"id":"2407.11746","title":"Adjoint-based assimilation of sparse time-averaged velocity data in\n  large-eddy simulations","authors":"Justin Plogmann, Oliver Brenner, Patrick Jenny","authorsParsed":[["Plogmann","Justin",""],["Brenner","Oliver",""],["Jenny","Patrick",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:12:35 GMT"}],"updateDate":"2024-07-17","timestamp":1721139155000,"abstract":"  The need for accurate and fast scale-resolving simulations of fluid flows,\nwhere turbulent dispersion is a crucial physical feature, is evident.\nLarge-eddy simulations (LES) are computationally more affordable than direct\nnumerical simulations, but their accuracy depends on sub-grid scale models and\nthe quality of the computational mesh. In order to compensate related errors, a\ndata assimilation approach for LES is devised in this work.\n  The presented method is based on variational assimilation of sparse\ntime-averaged velocity reference data through a stationary corrective forcing\nterm in the LES momentum equation working with the time-averaged LES momentum\nequation allows to employ a stationary discrete adjoint method. Therefore, the\nstationary forcing in the unsteady LES momentum equation is iteratively updated\nwithin the gradient-based optimization framework in conjunction with the\nadjoint gradient. The implementation is based on a three-dimensional LES solver\nin OpenFOAM, which is extended to allow the computation of adjoint quantities\nand, ultimately, the adjoint gradient.\n  Efficacy of the proposed framework is demonstrated for turbulent flow over\nperiodic hills and around a square cylinder. Coarse meshes are leveraged to\nfurther enhance the speed of the optimization procedure. Time- and\nspanwise-averaged velocity reference data from high-fidelity simulations is\ntaken from the literature.\n  Our results demonstrate that adjoint-based assimilation of averaged velocity\nenables the optimization of the mean flow, vortex shedding frequency (i.e.,\nStrouhal number), and turbulent kinetic energy. This highlights the superiority\nof scale-resolving simulations such as LES over simulations based on the\n(unsteady) Reynolds-averaged equations.\n","subjects":["Physics/Fluid Dynamics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"DgUVWCnLQjdFUwRDkz7UBmyCsOTFTofhwiGlsL4TKGY","pdfSize":"1247489"}
