{"id":"2407.11524","title":"Enhancement of adhesion strength in viscoelastic unsteady contacts","authors":"Cosimo Mandriota, Nicola Menga, Giuseppe Carbone","authorsParsed":[["Mandriota","Cosimo",""],["Menga","Nicola",""],["Carbone","Giuseppe",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 09:05:53 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 10:53:14 GMT"}],"updateDate":"2024-08-30","timestamp":1721120753000,"abstract":"  We present a general energy approach to study the unsteady adhesive contact\nof viscoelastic materials. Under the assumption of infinitely short-range\nadhesive interactions, we exploit the principle of virtual work to generalize\nGriffith local energy balance at contact edges to the case of a non\nconservative (viscoelastic) material, subjected to a generic contact time\nhistory. We apply the proposed energy balance criterion to study the approach\nretraction motion of a rigid sphere in contact with a viscoelastic halfspace. A\nstrong interplay between adhesion and viscoelastic hysteretic losses is\nreported which can lead to strongly increased adhesion strength, depending on\nthe loading history. Specifically, two different mechanisms are found to govern\nthe increase of pulloff force during either approach retraction cycles and\napproach, full relaxation, retraction tests. In the former case, hysteretic\nlosses occurring close to the circular perimeter of the contact play a major\nrole, significantly enhancing the energy release rate. In the latter case,\ninstead, the pulloff enhancement mostly depends on the glassy response of the\nwhole (bulk) material which, triggered by the fast retraction after relaxation,\nleads to a sort of frozen state and results in a flat punch like detachment\nmechanism (i.e., constant contact area). In this case, the JKR theory of\nadhesive contact cannot be invoked to relate the observed pulloff force to the\neffective adhesion energy, i.e. the energy release rate G, and strongly\noverestimates it. Therefore, a rigorous mathematical procedure is also proposed\nto correctly calculate the energy release rate in viscoelastic dissipative\ncontacts.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"xas_fpNL_VOagq-lzbpKix7Lych5wBx-pZei_2Q10tc","pdfSize":"4288046"}
