{"id":"2407.06370","title":"An extreme thermal cycling reliability test of ATLAS ITk Strips barrel\n  modules","authors":"A. Tishelman-Charny, A. Affolder, F. Capocasa, E. Duden, V. Fadeyev,\n  M. Gignac, C. Helling, H. Herde, J. Johnson, D. Lynn, M. Morii, A. Mitra, L.\n  Poley, G. Sciolla, S. Stucci, P. Sharma, G. Van Nieuwenhuizen, E. Wallin, A.\n  Wang and S. Wonsak","authorsParsed":[["Tishelman-Charny","A.",""],["Affolder","A.",""],["Capocasa","F.",""],["Duden","E.",""],["Fadeyev","V.",""],["Gignac","M.",""],["Helling","C.",""],["Herde","H.",""],["Johnson","J.",""],["Lynn","D.",""],["Morii","M.",""],["Mitra","A.",""],["Poley","L.",""],["Sciolla","G.",""],["Stucci","S.",""],["Sharma","P.",""],["Van Nieuwenhuizen","G.",""],["Wallin","E.",""],["Wang","A.",""],["Wonsak","S.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 20:23:59 GMT"}],"updateDate":"2024-07-10","timestamp":1720470239000,"abstract":"  At the end of Run 3 of the Large Hadron Collider (LHC), the accelerator\ncomplex will be upgraded to the High-Luminosity LHC (HL-LHC) in order to\nincrease the total amount of data provided to its experiments. To cope with the\nincreased rates of data, radiation, and pileup, the ATLAS detector will undergo\na substantial upgrade, including a replacement of the Inner Detector with a\nfuture Inner Tracker, called the ITk. The ITk will be composed of pixel and\nstrip sub-detectors, where the strips portion will be composed of 17,888\nsilicon strip detector modules. During the HL-LHC running period, the ITk will\nbe cooled and warmed a number of times from about ${-35}^\\circ$C to room\ntemperature as part of the operational cycle, including warm-ups during yearly\nshutdowns. To ensure ITk Strips modules are functional after these expected\ntemperature changes, and to ensure modules are mechanically robust, each module\nmust undergo ten thermal cycles and pass a set of electrical and mechanical\ncriteria before it is placed on a local support structure. This paper describes\nthe thermal cycling Quality Control (QC) procedure, and results from the barrel\npre-production phase (about 5% of the production volume). Additionally, in\norder to assess the headroom of the nominal QC procedure of 10 cycles and to\nensure modules don't begin failing soon after, four representative ITk Strips\nbarrel modules were thermally cycled 100 times - this study is also described.\n","subjects":["Physics/Instrumentation and Detectors","Physics/High Energy Physics - Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}