{"id":"2407.16337","title":"STATE: A Robust ATE Estimator of Heavy-Tailed Metrics for Variance\n  Reduction in Online Controlled Experiments","authors":"Hao Zhou, Kun Sun, Shaoming Li, Yangfeng Fan, Guibin Jiang, Jiaqi\n  Zheng, Tao Li","authorsParsed":[["Zhou","Hao",""],["Sun","Kun",""],["Li","Shaoming",""],["Fan","Yangfeng",""],["Jiang","Guibin",""],["Zheng","Jiaqi",""],["Li","Tao",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 09:35:59 GMT"}],"updateDate":"2024-07-24","timestamp":1721727359000,"abstract":"  Online controlled experiments play a crucial role in enabling data-driven\ndecisions across a wide range of companies. Variance reduction is an effective\ntechnique to improve the sensitivity of experiments, achieving higher\nstatistical power while using fewer samples and shorter experimental periods.\nHowever, typical variance reduction methods (e.g., regression-adjusted\nestimators) are built upon the intuitional assumption of Gaussian distributions\nand cannot properly characterize the real business metrics with heavy-tailed\ndistributions. Furthermore, outliers diminish the correlation between\npre-experiment covariates and outcome metrics, greatly limiting the\neffectiveness of variance reduction.\n  In this paper, we develop a novel framework that integrates the Student's\nt-distribution with machine learning tools to fit heavy-tailed metrics and\nconstruct a robust average treatment effect estimator in online controlled\nexperiments, which we call STATE. By adopting a variational EM method to\noptimize the loglikehood function, we can infer a robust solution that greatly\neliminates the negative impact of outliers and achieves significant variance\nreduction. Moreover, we extend the STATE method from count metrics to ratio\nmetrics by utilizing linear transformation that preserves unbiased estimation,\nwhose variance reduction is more complex but less investigated in existing\nworks. Finally, both simulations on synthetic data and long-term empirical\nresults on Meituan experiment platform demonstrate the effectiveness of our\nmethod. Compared with the state-of-the-art estimators (CUPAC/MLRATE), STATE\nachieves over 50% variance reduction, indicating it can reach the same\nstatistical power with only half of the observations, or half the experimental\nduration.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}