{"id":"2407.04441","title":"Decoupling NO production and UV emission intensity over the E-H mode\n  transition in a low-pressure inductively coupled plasma device","authors":"Lars Sch\\\"ucke, Angie Natalia Torres Segura, Ihor Korolov, Peter\n  Awakowicz and Andrew R. Gibson","authorsParsed":[["Schücke","Lars",""],["Segura","Angie Natalia Torres",""],["Korolov","Ihor",""],["Awakowicz","Peter",""],["Gibson","Andrew R.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 11:46:43 GMT"}],"updateDate":"2024-07-08","timestamp":1720180003000,"abstract":"  A low-pressure double-inductively coupled plasma device is used to study the\nfundamental plasma parameters, plasma chemistry, and UV photon emission from\nthe first excited state of nitric oxide, NO(A), in gas mixtures of nitrogen and\noxygen. In addition to the gas mixture, rf power and gas pressure are varied,\nand the E-H mode transition of the inductively coupled plasma is studied\nspecifically. The gas temperature and UV photon emission are measured by\noptical emission spectroscopy (OES), the absolute density of the nitric oxide\nelectronic ground state by laser-induced fluorescence (LIF), as well as\nelectron density and electron temperature by a multipole resonance probe (MRP).\nA simple collisional-radiative model for UV emission from NO(A) is developed,\nwhich takes the measured densities of ground state nitric oxide and electrons,\nas well as the electron temperature and neutral gas temperature, as input\nparameters. The results reveal the links between the absolute densities of\nground state nitric oxide, the excitation of this species driven by electron\nimpact and collisions with nitrogen metastables, quenching of the nitrogen\nmetastables, and the resulting UV photon emission rate. The density of ground\nstate nitric oxide is shown to increase with power, while the discharge remains\nin E-mode, and to decrease significantly with the transition into H-mode, when\nsufficient rf power is deposited in the discharge. Despite the lower densities\nof ground state nitric oxide in H-mode, the UV photon emission intensity\nincreases continuously with higher rf powers and over the E-H transition. This\neffect is shown to be caused by increased excitation of NO(A) by nitrogen\nmetastables in H-mode, which is sufficient to overcompensate the decrease in\nground state nitric oxide density.\n","subjects":["Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}