{"id":"2407.16854","title":"Impacts of National Cultures on Managerial Decisions of Engaging in Core\n  Earnings Management","authors":"Muhammad Rofiqul Islam, Abdullah Al Mehdi","authorsParsed":[["Islam","Muhammad Rofiqul",""],["Mehdi","Abdullah Al",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 21:41:40 GMT"}],"updateDate":"2024-07-25","timestamp":1721770900000,"abstract":"  This study investigates the impact of Hofstede's cultural dimensions on\nabnormal core earnings management in multiple national cultural contexts. We\nemploy an Ordinary Least Squares (OLS) regression model with abnormal core\nearnings as the dependent variable. The independent variables analyzed include\nHofstede's dimensions: Power Distance Index (PDI), Individualism (IDV),\nMasculinity (MAS), and Uncertainty Avoidance Index (UAI). Our findings reveal\nthat individualism is positively associated with abnormal core earnings,\nsuggesting that cultures characterized by high individualism may encourage\npractices that inflate earnings due to the prominence of personal achievement\nand rewards. In contrast, masculinity negatively correlates with abnormal core\nearnings, indicating that the risk-taking attributes associated with masculine\ncultures may deter earnings management. Interestingly, uncertainty avoidance is\npositively linked to abnormal core earnings, supporting the notion that\nmanagers tend to engage more in earnings management to minimize fluctuations in\nfinancial reports in cultures with high uncertainty avoidance. The relationship\nbetween power distance and abnormal core earnings is found to be\nnon-significant, indicating no substantial effect in this context. These\nfindings contribute to the literature on cultural influences in financial\nreporting, providing valuable insights for policymakers and multinational firms\nconcerning the cultural contexts within which financial decisions and reporting\noccur.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/"}