{"id":"2407.15645","title":"Psychometric Alignment: Capturing Human Knowledge Distributions via\n  Language Models","authors":"Joy He-Yueya, Wanjing Anya Ma, Kanishk Gandhi, Benjamin W. Domingue,\n  Emma Brunskill, Noah D. Goodman","authorsParsed":[["He-Yueya","Joy",""],["Ma","Wanjing Anya",""],["Gandhi","Kanishk",""],["Domingue","Benjamin W.",""],["Brunskill","Emma",""],["Goodman","Noah D.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:02:59 GMT"}],"updateDate":"2024-07-23","timestamp":1721656979000,"abstract":"  Language models (LMs) are increasingly used to simulate human-like responses\nin scenarios where accurately mimicking a population's behavior can guide\ndecision-making, such as in developing educational materials and designing\npublic policies. The objective of these simulations is for LMs to capture the\nvariations in human responses, rather than merely providing the expected\ncorrect answers. Prior work has shown that LMs often generate unrealistically\naccurate responses, but there are no established metrics to quantify how\nclosely the knowledge distribution of LMs aligns with that of humans. To\naddress this, we introduce \"psychometric alignment,\" a metric that measures the\nextent to which LMs reflect human knowledge distribution. Assessing this\nalignment involves collecting responses from both LMs and humans to the same\nset of test items and using Item Response Theory to analyze the differences in\nitem functioning between the groups. We demonstrate that our metric can capture\nimportant variations in populations that traditional metrics, like differences\nin accuracy, fail to capture. We apply this metric to assess existing LMs for\ntheir alignment with human knowledge distributions across three real-world\ndomains. We find significant misalignment between LMs and human populations,\nthough using persona-based prompts can improve alignment. Interestingly,\nsmaller LMs tend to achieve greater psychometric alignment than larger LMs.\nFurther, training LMs on human response data from the target distribution\nenhances their psychometric alignment on unseen test items, but the\neffectiveness of such training varies across domains.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}