{"id":"2407.13598","title":"KNOWNET: Guided Health Information Seeking from LLMs via Knowledge Graph\n  Integration","authors":"Youfu Yan, Yu Hou, Yongkang Xiao, Rui Zhang, and Qianwen Wang","authorsParsed":[["Yan","Youfu",""],["Hou","Yu",""],["Xiao","Yongkang",""],["Zhang","Rui",""],["Wang","Qianwen",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 15:37:27 GMT"}],"updateDate":"2024-07-19","timestamp":1721317047000,"abstract":"  The increasing reliance on Large Language Models (LLMs) for health\ninformation seeking can pose severe risks due to the potential for\nmisinformation and the complexity of these topics. This paper introduces\nKNOWNET a visualization system that integrates LLMs with Knowledge Graphs (KG)\nto provide enhanced accuracy and structured exploration. Specifically, for\nenhanced accuracy, KNOWNET extracts triples (e.g., entities and their\nrelations) from LLM outputs and maps them into the validated information and\nsupported evidence in external KGs. For structured exploration, KNOWNET\nprovides next-step recommendations based on the neighborhood of the currently\nexplored entities in KGs, aiming to guide a comprehensive understanding without\noverlooking critical aspects. To enable reasoning with both the structured data\nin KGs and the unstructured outputs from LLMs, KNOWNET conceptualizes the\nunderstanding of a subject as the gradual construction of graph visualization.\nA progressive graph visualization is introduced to monitor past inquiries, and\nbridge the current query with the exploration history and next-step\nrecommendations. We demonstrate the effectiveness of our system via use cases\nand expert interviews.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"unhPhlUMwmcCtkRd3g-5bqjEj3AA6vHdufJvqKH36JU","pdfSize":"4578426","objectId":"0x2173939178541c821c5cfca267b5860dd1e6cc363bc518880c35e87d2a6e1ca0","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
