{"id":"2407.09169","title":"Tensor networks enable the calculation of turbulence probability\n  distributions","authors":"Nikita Gourianov, Peyman Givi, Dieter Jaksch, Stephen B. Pope","authorsParsed":[["Gourianov","Nikita",""],["Givi","Peyman",""],["Jaksch","Dieter",""],["Pope","Stephen B.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 11:06:57 GMT"}],"updateDate":"2024-07-15","timestamp":1720782417000,"abstract":"  Predicting the dynamics of turbulent fluid flows has long been a central goal\nof science and engineering. Yet, even with modern computing technology,\naccurate simulation of all but the simplest turbulent flow-fields remains\nimpossible: the fields are too chaotic and multi-scaled to directly store them\nin memory and perform time-evolution. An alternative is to treat turbulence\n$\\textit{probabilistically}$, viewing flow properties as random variables\ndistributed according to joint probability density functions (PDFs). Turbulence\nPDFs are neither chaotic nor multi-scale, but are still challenging to simulate\ndue to their high dimensionality. Here we show how to overcome the\ndimensionality problem by parameterising turbulence PDFs into an extremely\ncompressed format known as a \"tensor network\" (TN). The TN paradigm enables\nsimulations on single CPU cores that would otherwise be impractical even with\nsupercomputers: for a $5+1$ dimensional PDF of a chemically reactive turbulent\nflow, we achieve reductions in memory and computational costs by factors of\n$\\mathcal{O}(10^6)$ and $\\mathcal{O}(10^3)$, respectively, compared to standard\nfinite difference algorithms. A future path is opened towards something\nheretofore regarded as infeasible: directly simulating high-dimensional PDFs of\nboth turbulent flows and other chaotic systems that are useful to describe\nprobabilistically.\n","subjects":["Physics/Fluid Dynamics","Nonlinear Sciences/Chaotic Dynamics","Physics/Computational Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}