{"id":"2407.14625","title":"Benchmarking deep learning models for bearing fault diagnosis using the\n  CWRU dataset: A multi-label approach","authors":"Rodrigo Kobashikawa Rosa, Danilo Braga, Danilo Silva","authorsParsed":[["Rosa","Rodrigo Kobashikawa",""],["Braga","Danilo",""],["Silva","Danilo",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 18:50:12 GMT"}],"updateDate":"2024-07-23","timestamp":1721415012000,"abstract":"  This paper proposes a novel approach for modeling the problem of fault\ndiagnosis using the Case Western Reserve University (CWRU) bearing fault\ndataset. Although the dataset is considered a standard reference for testing\nnew algorithms, the typical dataset division suffers from data leakage, as\nshown by Hendriks et al. (2022) and Abburi et al. (2023), leading to papers\nreporting over-optimistic results. While their proposed division significantly\nmitigates this issue, it does not eliminate it entirely. Moreover, their\nproposed multi-class classification task can still lead to an unrealistic\nscenario by excluding the possibility of more than one fault type occurring at\nthe same or different locations. As advocated in this paper, a multi-label\nformulation (detecting the presence of each type of fault for each location)\ncan solve both issues, leading to a scenario closer to reality. Additionally,\nthis approach mitigates the heavy class imbalance of the CWRU dataset, where\nfaulty cases appear much more frequently than healthy cases, even though the\nopposite is more likely to occur in practice. A multi-label formulation also\nenables a more precise evaluation using prevalence-independent evaluation\nmetrics for binary classification, such as the ROC curve. Finally, this paper\nproposes a more realistic dataset division that allows for more diversity in\nthe training dataset while keeping the division free from data leakage. The\nresults show that this new division can significantly improve performance while\nenabling a fine-grained error analysis. As an application of our approach, a\ncomparative benchmark is performed using several state-of-the-art deep learning\nmodels applied to 1D and 2D signal representations in time and/or frequency\ndomains.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}