{"id":"2407.00685","title":"Comet C/2012 S1 (ISON) crossing the Jupiter orbit","authors":"Margarita Safonova, Noah Brosch, Shai Kaspi, David Polishook, R.\n  Michael Rich, Firoza Sutaria and Jayant Murthy","authorsParsed":[["Safonova","Margarita",""],["Brosch","Noah",""],["Kaspi","Shai",""],["Polishook","David",""],["Rich","R. Michael",""],["Sutaria","Firoza",""],["Murthy","Jayant",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 12:47:27 GMT"}],"updateDate":"2024-07-02","timestamp":1719751647000,"abstract":"  We report results of intensive time-resolved imaging photometry and synoptic\ndeep imaging of the comet C/2012 S1 (ISON) performed in February 2013. The data\nwere obtained at the Wise Observatory in Israel (WO), at the Himalayan Chandra\nTelescope (HCT) in India, and at the Polaris Observatory Association in\nCalifornia, USA. During this period, the comet's heliocentric distance changed\nfrom 4.9 to 4.6 AU, just within the orbit of Jupiter. We analyze these early\nimages in an attempt to determine the nuclear rotation period, assuming that at\nthese relatively large heliocentric distances it would be possible to detect\nthe photometric modulation of a rotating nucleus against an underdeveloped\ncoma. Since this is not evident in our February 2013 data, with more than 400\nindependent photometric measurements analyzed, we can only set upper limits of\n0.05 mag for periodic brightness modulations. We discuss (and discount) a\npossible brightening event (minor outburst) that occurred on $15-16$ February\n2013.\n  We also present deep synoptic images of the comet, obtained by combining our\nexposures for each night, and analyze them. We find that during the period of\nour observations the comet exhibited a $\\sim$$30^{\\prime\\prime}\\simeq 60000$-km\ntail with no substructures visible and that this appearance did not change\nthroughout our campaign.\n  The comet, as indicated by a single spectroscopic measurement obtained during\nthis observation period, showed a dust coma reflecting the solar light. Our\nobservations indicate that during February 2013, comet ISON was relatively\nquiet, with the dust coma presumably hiding any light modulation by a spinning\nnucleus.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}