{"id":"2407.05717","title":"A New Framework for Nonlinear Kalman Filters","authors":"Shida Jiang, Junzhe Shi, Scott Moura","authorsParsed":[["Jiang","Shida",""],["Shi","Junzhe",""],["Moura","Scott",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 08:21:22 GMT"},{"version":"v2","created":"Sun, 28 Jul 2024 02:30:51 GMT"},{"version":"v3","created":"Wed, 11 Sep 2024 07:17:31 GMT"},{"version":"v4","created":"Fri, 13 Sep 2024 00:57:44 GMT"}],"updateDate":"2024-09-16","timestamp":1720426882000,"abstract":"  The Kalman filter (KF) is a state estimation algorithm that optimally\ncombines system knowledge and measurements to minimize the mean squared error\nof the estimated states. While KF was initially designed for linear systems,\nnumerous extensions of it, such as extended Kalman filter (EKF), unscented\nKalman filter (UKF), cubature Kalman filter (CKF), etc., have been proposed for\nnonlinear systems. Although different types of nonlinear KFs have different\npros and cons, they all use the same framework of linear KF, which, according\nto what we found in this paper, tends to give overconfident and less accurate\nstate estimations when the measurement functions are nonlinear. Therefore, in\nthis study, we designed a new framework for nonlinear KFs and showed\ntheoretically and empirically that the new framework estimates the states and\ncovariance matrix more accurately than the old one. The new framework was\ntested on four different nonlinear KFs and five different tasks, showcasing its\nability to reduce the estimation errors by several orders of magnitude in\nlow-measurement-noise conditions, with only about a 10 to 90% increase in\ncomputational time. All types of nonlinear KFs can benefit from the new\nframework, and the benefit will increase as the sensors become more and more\naccurate in the future. As an example, EKF, the simplest nonlinear KF that was\npreviously believed to work poorly for strongly nonlinear systems, can now\nprovide fast and fairly accurate state estimations with the help of the new\nframework. The codes are available at\nhttps://github.com/Shida-Jiang/A-new-framework-for-nonlinear-Kalman-filters.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}