{"id":"2407.02475","title":"Database Systems Course: Service Learning Project","authors":"Sherri WeitlHarms","authorsParsed":[["WeitlHarms","Sherri",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 17:53:29 GMT"}],"updateDate":"2024-07-03","timestamp":1719942809000,"abstract":"  This paper describes a service learning project used in an upper-level and\ngraduate-level database systems course. Students complete a small database\nproject for a real client. The final product must match the client\nspecification and needs, and include the database design and the final working\ndatabase system with embedded user documentation. The solution must be\nimplemented in a way to make it as easy to use as possible for the client.\nStudents are expected to conduct professional meetings with their clients to\nunderstand the project, analyze the project's requirements, as well as design\nand implement the solution to the project. Students must have each milestone\napproved before starting the next phase of the project.\n  The student learning objectives of a database system semester project are to:\nanalyze a client's information system problem and determine the requirements\nfor the solution; design a suitable database solution to the problem; use\nsoftware design and development tools to design and develop a solution to the\nproblem; communicate and interact with a client on a professional level;\nprepare effective documentation for both non-technical and technical software\nusers; and interact ethically with all persons involved with a project. The\nbroader impact objectives of a database system semester project are to: provide\nneeded database solutions for organizations and businesses in the local area;\nprovide a resume and portfolio-building opportunity for the students; provide a\nmeasure for assessing how well the program meets it mission; provide a\nmechanism for implementing service-based learning; provide a mechanism for\noutreach to local-area organizations and businesses; and provide a\nstarting-point for undergraduate research projects.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}