{"id":"2407.15261","title":"Pandora's Box Problem Over Time","authors":"Georgios Amanatidis, Federico Fusco, Rebecca Reiffenh\\\"auser, Artem\n  Tsikiridis","authorsParsed":[["Amanatidis","Georgios",""],["Fusco","Federico",""],["Reiffenhäuser","Rebecca",""],["Tsikiridis","Artem",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 20:28:36 GMT"}],"updateDate":"2024-07-23","timestamp":1721593716000,"abstract":"  The Pandora's Box problem models the search for the best alternative when\nevaluation is costly. In its simplest variant, a decision maker is presented\nwith $n$ boxes, each associated with a cost of inspection and a distribution\nover the reward hidden within. The decision maker inspects a subset of these\nboxes one after the other, in a possibly adaptive ordering, and obtains as\nutility the difference between the largest reward uncovered and the sum of the\ninspection costs. While this classic version of the problem is well understood\n(Weitzman 1979), recent years have seen a flourishing of the literature on\nvariants of the problem. In this paper, we introduce a general framework -- the\nPandora's Box Over Time problem -- that captures a wide range of variants where\ntime plays a role, e.g., as it might constrain the schedules of exploration and\ninfluence both costs and rewards. In the Pandora's Box Over Time problem, each\nbox is characterized by time-dependent rewards and costs, and inspecting it\nmight require a box-specific processing time. Moreover, once a box is\ninspected, its reward may deteriorate over time, possibly differently for each\nbox. Our main result is an efficient $21.3$-approximation to the optimal\nstrategy, which is NP-hard to compute in general. We further obtain improved\nresults for the natural special cases where boxes have no processing time, or\nwhen costs and reward distributions do not depend on time (but rewards may\ndeteriorate after inspecting).\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Data Structures and Algorithms","Mathematics/Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}