{"id":"2407.08921","title":"Observational bounds on a possible electron-to-proton mass ratio\n  variation and constraints in the lepton-specific 2HDM","authors":"R. G. Albuquerque, R. F. L. Holanda, I. E. T. R. Mendon\\c{c}a and P.\n  S. Rodrigues da Silva","authorsParsed":[["Albuquerque","R. G.",""],["Holanda","R. F. L.",""],["Mendonça","I. E. T. R.",""],["da Silva","P. S. Rodrigues",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 02:03:33 GMT"}],"updateDate":"2024-07-15","timestamp":1720749813000,"abstract":"  In this work, we test a possible redshift variation of the electron-to-proton\nmass ratio, $\\mu = m_e/m_p$, directly from galaxy cluster gas mass fraction\nmeasurements and type Ia Supernovae observations. Our analysis is completely\nindependent of any cosmological model. Our result reveals no variation of $\\mu$\nwithin 1 $\\sigma$ confidence level. From the point of view of Particle Physics,\nwe can use the precision on these results to constrain the parameter space of\nmodels beyond the Standard Model of electroweak interactions. We exemplify this\nby focusing in a specific Two Higgs Doublet model (2HDM), where the second\nscalar doublet couples exclusively to leptons. An important parameter in the\nmodel concerns the ratio between its vacuum expectation values, defined by\n$\\tan\\beta$. In our approach we can constrain the inverse parameter\n(cot$\\beta$) to an optimal value, (tan$\\beta)^{-1}=$ 0.02127 $\\pm$ 0.0029, with\nthe largest vacuum expectation value for 2HDM, $v_2$, estimated at around\n240.033 $\\pm$ 0.21~GeV. Also, by taking into account the $(g-2)_\\mu$\ndiscrepancy found between theory and experiment, we can reduce the validity\nregion for this model and establish bounds on the scalar masses, in the light\nof our findings from galaxy clusters data for $\\mu$. This study contributes\nvaluable insights to the understanding of Particle Physics and Astrophysics\ninterface, establishing a new interplay between data from large scale structure\nof the Universe and subatomic Physics.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RhZtPOBuY-p2b1Iv5HrexWVudamHhpKoF8bj02I_bD4","pdfSize":"1154749","objectId":"0xda0df851965247251b2a5c362b205b4c1a016964159310e696111ce9845d51a7","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
