{"id":"2407.04404","title":"Fixed and Movable Antenna Technology for 6G Integrated Sensing and\n  Communication","authors":"Yong Zeng and Zhenjun Dong and Huizhi Wang and Lipeng Zhu and Ziyao\n  Hong and Qingji Jiang and Dongming Wang and Shi Jin and Rui Zhang","authorsParsed":[["Zeng","Yong",""],["Dong","Zhenjun",""],["Wang","Huizhi",""],["Zhu","Lipeng",""],["Hong","Ziyao",""],["Jiang","Qingji",""],["Wang","Dongming",""],["Jin","Shi",""],["Zhang","Rui",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 10:39:30 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 13:46:01 GMT"}],"updateDate":"2024-07-17","timestamp":1720175970000,"abstract":"  By deploying antenna arrays at the transmitter/receiver to provide additional\nspatial-domain degrees of freedom (DoFs), multi-antenna technology greatly\nimproves the reliability and efficiency of wireless communication. Meanwhile,\nthe application of multi-antenna technology in the radar field has achieved\nspatial angle resolution and improved sensing DoF, thus significantly enhancing\nwireless sensing performance. However, wireless communication and radar sensing\nhave undergone independent development over the past few decades. As a result,\nalthough multi-antenna technology has dramatically advanced in these two fields\nseparately, it has not been deeply integrated by exploiting their synergy. A\nnew opportunity to fill up this gap arises as the integration of sensing and\ncommunication has been identified as one of the typical usage scenarios of the\n6G communication network. Motivated by the above, this article aims to explore\nthe multi-antenna technology for 6G ISAC, with the focus on its future\ndevelopment trends such as continuous expansion of antenna array scale, more\ndiverse array architectures, and more flexible antenna designs. First, we\nintroduce several new and promising antenna architectures, including the\ncentralized antenna architectures based on traditional compact arrays or\nemerging sparse arrays, the distributed antenna architectures exemplified by\nthe cell-free massive MIMO, and the movable/fluid antennas with flexible\npositions and/or orientations in a given 3D space. Next, for each antenna\narchitecture mentioned above, we present the corresponding far-field/near-field\nchannel models and analyze the communication and sensing performance. Finally,\nwe summarize the characteristics of different antenna architectures and look\nforward to new ideas for solving the difficulties in acquiring CSI caused by\nthe continuous expansion of antenna array scale and flexible antenna designs.\n","subjects":["Computing Research Repository/Hardware Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}