{"id":"2407.07736","title":"Prediction of Frequency-Dependent Optical Spectrum for Solid Materials:\n  A Multi-Output & Multi-Fidelity Machine Learning Approach","authors":"Akram Ibrahim and Can Ataca","authorsParsed":[["Ibrahim","Akram",""],["Ataca","Can",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:06:59 GMT"}],"updateDate":"2024-07-11","timestamp":1720624019000,"abstract":"  The frequency-dependent optical spectrum is pivotal for a broad range of\napplications, from material characterization to optoelectronics and energy\nharvesting. Data-driven surrogate models, trained on density functional theory\n(DFT) data, have effectively alleviated the scalability limitations of DFT\nwhile preserving its chemical accuracy, expediting material discovery. However,\nprevailing machine learning (ML) efforts often focus on scalar properties such\nas the band gap, overlooking the complexities of optical spectra. In this work,\nwe employ deep graph neural networks (GNNs) to predict the frequency-dependent\ncomplex-valued dielectric function across the infrared, visible, and\nultraviolet spectra directly from crystal structures. We explore multiple\narchitectures for multi-output spectral representation of the dielectric\nfunction and utilize various multi-fidelity learning strategies, such as\ntransfer learning and fidelity embedding, to address the challenges associated\nwith the scarcity of high-fidelity DFT data. Additionally, we model key solar\ncell absorption efficiency metrics, demonstrating that learning these\nparameters is enhanced when integrated through a learning bias within the\nlearning of the frequency-dependent absorption coefficient. This study\ndemonstrates that leveraging multi-output and multi-fidelity ML techniques\nenables accurate predictions of optical spectra from crystal structures,\nproviding a versatile tool for rapidly screening materials for optoelectronics,\noptical sensing, and solar energy applications across an extensive frequency\nspectrum.\n","subjects":["Physics/Chemical Physics","Condensed Matter/Materials Science","Physics/Computational Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"738_L6RtUOSCTh-tffRljJSgfPmFyOV4AGB1Jg-jgFk","pdfSize":"26784054"}
