{"id":"2407.18130","title":"Carbon enrichment in APOGEE disk stars as evidence of mass transfer in\n  binaries","authors":"Steve Foster, Ricardo P. Schiavon, Denise B. de Castro, Sara\n  Lucatello, Christine Daher, Zephyr Penoyre, Adrian Price-Whelan, Carles\n  Badenes, JJ. G. Fern\\'andez-Trincado, D. A. Garc\\'ia-Hern\\'andez, Jon\n  Holtzman, Henrik J\\\"onsson, and Matthew Shetrone","authorsParsed":[["Foster","Steve",""],["Schiavon","Ricardo P.",""],["de Castro","Denise B.",""],["Lucatello","Sara",""],["Daher","Christine",""],["Penoyre","Zephyr",""],["Price-Whelan","Adrian",""],["Badenes","Carles",""],["Fernández-Trincado","JJ. G.",""],["García-Hernández","D. A.",""],["Holtzman","Jon",""],["Jönsson","Henrik",""],["Shetrone","Matthew",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 15:37:02 GMT"}],"updateDate":"2024-07-26","timestamp":1721921822000,"abstract":"  Carbon abundances in first-ascent giant stars are usually lower than those of\ntheir main-sequence counterparts. At moderate metallicities, stellar evolution\nof single stars cannot account for the existence of red-giant branch stars with\nenhanced carbon abundances. The phenomenon is usually interpreted as resulting\nfrom past mass transfer from an evolved binary companion now in the white dwarf\nevolutionary stage. Aims: We aim to confirm the links between [C/O]\nenhancement, s-process element enhancement and binary fraction using\nlarge-scale catalogues of stellar abundances and probable binary stars.\nMethods: We use a large data set from the 17 data release of the\nSDSS-IV/APOGEE~2 survey to identify carbon-enhanced stars in the Galactic disk.\nWe identify a continuum of carbon enrichment throughout three different\nsub-populations of disk stars and explore links between the degree of carbon\nenrichment and binary frequency, metallicity and chemical compositions.\nResults: We verify a clear correlation between binary frequency and enhancement\nin the abundances of both carbon and cerium, lending support to the scenario\nwhereby carbon-enhanced stars are the result of mass transfer by an evolved\nbinary companion. In addition, we identify clustering in the carbon abundances\nof high-$\\alpha$ disk stars, suggesting that those on the high metallicity end\nare likely younger, in agreement with theoretical predictions for the presence\nof a starburst population following the gas-rich merger of the\nGaia-Enceladus/Sausage system.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}