{"id":"2407.12066","title":"Temporally Grounding Instructional Diagrams in Unconstrained Videos","authors":"Jiahao Zhang, Frederic Z. Zhang, Cristian Rodriguez, Yizhak\n  Ben-Shabat, Anoop Cherian, Stephen Gould","authorsParsed":[["Zhang","Jiahao",""],["Zhang","Frederic Z.",""],["Rodriguez","Cristian",""],["Ben-Shabat","Yizhak",""],["Cherian","Anoop",""],["Gould","Stephen",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 05:44:30 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 04:31:46 GMT"},{"version":"v3","created":"Tue, 30 Jul 2024 23:52:41 GMT"}],"updateDate":"2024-08-02","timestamp":1721108670000,"abstract":"  We study the challenging problem of simultaneously localizing a sequence of\nqueries in the form of instructional diagrams in a video. This requires\nunderstanding not only the individual queries but also their\ninterrelationships. However, most existing methods focus on grounding one query\nat a time, ignoring the inherent structures among queries such as the general\nmutual exclusiveness and the temporal order. Consequently, the predicted\ntimespans of different step diagrams may overlap considerably or violate the\ntemporal order, thus harming the accuracy. In this paper, we tackle this issue\nby simultaneously grounding a sequence of step diagrams. Specifically, we\npropose composite queries, constructed by exhaustively pairing up the visual\ncontent features of the step diagrams and a fixed number of learnable\npositional embeddings. Our insight is that self-attention among composite\nqueries carrying different content features suppress each other to reduce\ntimespan overlaps in predictions, while the cross-attention corrects the\ntemporal misalignment via content and position joint guidance. We demonstrate\nthe effectiveness of our approach on the IAW dataset for grounding step\ndiagrams and the YouCook2 benchmark for grounding natural language queries,\nsignificantly outperforming existing methods while simultaneously grounding\nmultiple queries.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}