{"id":"2407.16546","title":"Dust rings trap protoplanets on eccentric orbits and get consumed by\n  them","authors":"David A. Velasco-Romero, Fr\\'ed\\'eric S. Masset, Alessandro\n  Morbidelli, Pablo Ben\\'itez-Llambay, Leonardo Krapp and Elena Lega","authorsParsed":[["Velasco-Romero","David A.",""],["Masset","Frédéric S.",""],["Morbidelli","Alessandro",""],["Benítez-Llambay","Pablo",""],["Krapp","Leonardo",""],["Lega","Elena",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:55:54 GMT"}],"updateDate":"2024-07-24","timestamp":1721746554000,"abstract":"  We study the orbital evolution and mass growth of protoplanets with masses $M\n\\in [0.1-8]$~M$_\\oplus$ in the vicinity of a dusty ring, using\nthree-dimensional numerical simulations with a two-fluid model and\nnested-meshes. We find two stable, eccentric orbits that lock the planet in the\nring vicinity, thereby inhibiting its migration and allowing it to accrete dust\nfrom the ring. One of these orbits has an eccentricity comparable to the aspect\nratio of the gaseous disc and has its periastron within the ring, enabling\nintermittent accretion during each pass. The other orbit has a smaller\neccentricity and an apoastron slightly inside the ring. A planet locked at the\nouter orbit efficiently accretes from the ring and can reach the critical mass\nfor runaway gas accretion on timescales $\\gtrsim 10^5$ yr (for a 10~M$_\\oplus$\ndust ring at 10~au) while a planet locked at the inner orbit has a slower\ngrowth and might not supersede the super-Earth stage over the disc lifetime.\nWhile in our runs a low-mass embryo forming within the ring eventually joins\nthe outer orbit, it is likely that the path taken depends on the specific\ndetails of the ring. The trapping on the outer orbit arises from an\nintermittent, strong thermal force at each passage through the ring, where the\naccretion rate spikes. It is insensitive to uncertainties that plague models\nconsidering planets trapped on circular orbits in rings. It is highly robust\nand could allow a growing planet to follow an expanding ring over large\ndistances.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}