{"id":"2407.09538","title":"A Dynamic Systems Approach to Modelling Human-Machine Rhythm Interaction","authors":"Zhongju Yuan, Wannes Van Ransbeeck, Geraint Wiggins, Dick Botteldooren","authorsParsed":[["Yuan","Zhongju",""],["Van Ransbeeck","Wannes",""],["Wiggins","Geraint",""],["Botteldooren","Dick",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 10:07:20 GMT"}],"updateDate":"2024-07-16","timestamp":1719396440000,"abstract":"  In exploring the simulation of human rhythmic perception and synchronization\ncapabilities, this study introduces a computational model inspired by the\nphysical and biological processes underlying rhythm processing. Utilizing a\nreservoir computing framework that simulates the function of cerebellum, the\nmodel features a dual-neuron classification and incorporates parameters to\nmodulate information transfer, reflecting biological neural network\ncharacteristics. Our findings demonstrate the model's ability to accurately\nperceive and adapt to rhythmic patterns within the human perceptible range,\nexhibiting behavior closely aligned with human rhythm interaction. By\nincorporating fine-tuning mechanisms and delay-feedback, the model enables\ncontinuous learning and precise rhythm prediction. The introduction of\ncustomized settings further enhances its capacity to stimulate diverse human\nrhythmic behaviors, underscoring the potential of this architecture in temporal\ncognitive task modeling and the study of rhythm synchronization and prediction\nin artificial and biological systems. Therefore, our model is capable of\ntransparently modelling cognitive theories that elucidate the dynamic processes\nby which the brain generates rhythm-related behavior.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}