{"id":"2407.21452","title":"Navigating Beyond Instructions: Vision-and-Language Navigation in\n  Obstructed Environments","authors":"Haodong Hong and Sen Wang and Zi Huang and Qi Wu and Jiajun Liu","authorsParsed":[["Hong","Haodong",""],["Wang","Sen",""],["Huang","Zi",""],["Wu","Qi",""],["Liu","Jiajun",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 08:55:57 GMT"}],"updateDate":"2024-08-01","timestamp":1722416157000,"abstract":"  Real-world navigation often involves dealing with unexpected obstructions\nsuch as closed doors, moved objects, and unpredictable entities. However,\nmainstream Vision-and-Language Navigation (VLN) tasks typically assume\ninstructions perfectly align with the fixed and predefined navigation graphs\nwithout any obstructions. This assumption overlooks potential discrepancies in\nactual navigation graphs and given instructions, which can cause major failures\nfor both indoor and outdoor agents. To address this issue, we integrate diverse\nobstructions into the R2R dataset by modifying both the navigation graphs and\nvisual observations, introducing an innovative dataset and task, R2R with\nUNexpected Obstructions (R2R-UNO). R2R-UNO contains various types and numbers\nof path obstructions to generate instruction-reality mismatches for VLN\nresearch. Experiments on R2R-UNO reveal that state-of-the-art VLN methods\ninevitably encounter significant challenges when facing such mismatches,\nindicating that they rigidly follow instructions rather than navigate\nadaptively. Therefore, we propose a novel method called ObVLN (Obstructed VLN),\nwhich includes a curriculum training strategy and virtual graph construction to\nhelp agents effectively adapt to obstructed environments. Empirical results\nshow that ObVLN not only maintains robust performance in unobstructed scenarios\nbut also achieves a substantial performance advantage with unexpected\nobstructions.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}