{"id":"2407.01346","title":"Early Commissioning Results of Slit Mask Integral Field Units on the\n  Southern African Large Telescope","authors":"Sabyasachi Chattopadhyaya, Matthew A. Bershady","authorsParsed":[["Chattopadhyaya","Sabyasachi",""],["Bershady","Matthew A.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:00:15 GMT"}],"updateDate":"2024-07-02","timestamp":1719846015000,"abstract":"  Three fibre feed integral field units (IFUs), called Slit Mask IFUs (SMI),\nare being developed in the SAAO fibre-lab for the Robert Stobie Spectrograph\n(RSS). The smaller, 200 micron fibre IFU (SMI-200) has 309 x 0.9 arcsec\ndiameter spatial elements covering an elongated hexagonal footprint of 18\n$\\times$ 23 arcsec is now being commissioned. The larger, 300 (400) micron\nfibre IFU, SMI-300 (SMI-400), has 221 $\\times$ 1.35 arcsec (178 $\\times$ 1.8\narcsec) diameter spatial elements covering an on-sky area of 18 $\\times$ 29 sq.\narcsec (21 $\\times$ 44 sq. arcsec). In all SMI units there are two groups of 13\nfibres offset by roughly 50 arcsec on either side of the primary array to\nsample sky. SMI-200 provides a median spectral resolution of 2400 at\nH$\\upalpha$ wavelengths in a low resolution mode simultaneously covering 370 to\n740 nm. At a higher grating angles the SMI-200 delivers spectral resolution up\nto 10,000. A future red spectrograph arm for RSS will extend the simultaneous\nwavelength coverage up to 900 nm at a median resolution of 6000 for the same\nIFU. With this upcoming red arm and with the fibre-fed, near-infrared\nspectrograph NIRWALS on SALT, SMI-300 enables wavelength coverage from blue to\nNIR wavelengths at the same spatial resolution and footprint. The SMI units are\ninserted in the same fashion as the existing long-slit cassettes at the SALT\nfocal plane. Prismatic fold mirrors direct the focal plane into the fibre IFU\nand then back into the RSS collimator after the fibres are routed 180 deg\nwithin the cassette and formatted into a pseudo-slit. Fold-prisms ensure that\nthe spectrograph collimator continues to see the same focal plane. In this\npaper we report the laboratory characterization and on-sky\ncommissioning-performance of the first Slit Mask IFU, SMI-200.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}