{"id":"2407.20173","title":"Purification and correction of quantum channels by commutation-derived\n  quantum filters","authors":"Sowmitra Das, Jinzhao Sun, Michael Hanks, B\\'alint Koczor, M. S. Kim","authorsParsed":[["Das","Sowmitra",""],["Sun","Jinzhao",""],["Hanks","Michael",""],["Koczor","Bálint",""],["Kim","M. S.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 17:01:48 GMT"}],"updateDate":"2024-07-30","timestamp":1722272508000,"abstract":"  Reducing the effect of errors is essential for reliable quantum computation.\nQuantum error mitigation (QEM) and quantum error correction (QEC) are two\nframeworks that have been proposed to address this task, each with its\nrespective challenges: sampling costs and inability to recover the state for\nQEM, and qubit overheads for QEC. In this work, we combine ideas from these two\nframeworks and introduce an information-theoretic machinery called a quantum\nfilter that can purify or correct quantum channels. We provide an explicit\nconstruction of a filter that can correct arbitrary types of noise in an\n$n$-qubit Clifford circuit using $2n$ ancillary qubits based on a\ncommutation-derived error detection circuit. We also show that this filtering\nscheme can partially purify noise in non-Clifford gates (e.g. T and CCZ gates).\nIn contrast to QEC, this scheme works in an error-reduction sense because it\ndoes not require prior encoding of the input state into a QEC code and requires\nonly a single instance of the target channel. Under the assumptions of clean\nancillary qubits, this scheme overcomes the exponential sampling overhead in\nQEM because it can deterministically correct the error channel without\ndiscarding any result. We further propose an ancilla-efficient Pauli filter\nwhich can remove nearly all the low-weight Pauli components of the error\nchannel in a Clifford circuit using only 2 ancillary qubits similar to flag\nerror correction codes. We prove that for local depolarising noise, this filter\ncan achieve a quadratic reduction in the {average} infidelity of the channel.\nThe Pauli filter can also be used to convert an unbiased error channel into a\ncompletely biased error channel and thus is compatible with biased-noise QEC\ncodes which have high code capacity. These examples demonstrate the utility of\nthe quantum filter as an efficient error-reduction technique.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8AUJ1ciyr_QxKtTwJI1nQGrOvUT3EJl9UxBbt1QeE8A","pdfSize":"1093234"}
