{"id":"2407.13181","title":"Training-Free Large Model Priors for Multiple-in-One Image Restoration","authors":"Xuanhua He, Lang Li, Yingying Wang, Hui Zheng, Ke Cao, Keyu Yan, Rui\n  Li, Chengjun Xie, Jie Zhang, Man Zhou","authorsParsed":[["He","Xuanhua",""],["Li","Lang",""],["Wang","Yingying",""],["Zheng","Hui",""],["Cao","Ke",""],["Yan","Keyu",""],["Li","Rui",""],["Xie","Chengjun",""],["Zhang","Jie",""],["Zhou","Man",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 05:40:32 GMT"}],"updateDate":"2024-07-19","timestamp":1721281232000,"abstract":"  Image restoration aims to reconstruct the latent clear images from their\ndegraded versions. Despite the notable achievement, existing methods\npredominantly focus on handling specific degradation types and thus require\nspecialized models, impeding real-world applications in dynamic degradation\nscenarios. To address this issue, we propose Large Model Driven Image\nRestoration framework (LMDIR), a novel multiple-in-one image restoration\nparadigm that leverages the generic priors from large multi-modal language\nmodels (MMLMs) and the pretrained diffusion models. In detail, LMDIR integrates\nthree key prior knowledges: 1) global degradation knowledge from MMLMs, 2)\nscene-aware contextual descriptions generated by MMLMs, and 3) fine-grained\nhigh-quality reference images synthesized by diffusion models guided by MMLM\ndescriptions. Standing on above priors, our architecture comprises a\nquery-based prompt encoder, degradation-aware transformer block injecting\nglobal degradation knowledge, content-aware transformer block incorporating\nscene description, and reference-based transformer block incorporating\nfine-grained image priors. This design facilitates single-stage training\nparadigm to address various degradations while supporting both automatic and\nuser-guided restoration. Extensive experiments demonstrate that our designed\nmethod outperforms state-of-the-art competitors on multiple evaluation\nbenchmarks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}