{"id":"2407.01905","title":"Enhancing Multi-Class Anomaly Detection via Diffusion Refinement with\n  Dual Conditioning","authors":"Jiawei Zhan, Jinxiang Lai, Bin-Bin Gao, Jun Liu, Xiaochen Chen,\n  Chengjie Wang","authorsParsed":[["Zhan","Jiawei",""],["Lai","Jinxiang",""],["Gao","Bin-Bin",""],["Liu","Jun",""],["Chen","Xiaochen",""],["Wang","Chengjie",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 03:09:40 GMT"}],"updateDate":"2024-07-03","timestamp":1719889780000,"abstract":"  Anomaly detection, the technique of identifying abnormal samples using only\nnormal samples, has attracted widespread interest in industry. Existing\none-model-per-category methods often struggle with limited generalization\ncapabilities due to their focus on a single category, and can fail when\nencountering variations in product. Recent feature reconstruction methods, as\nrepresentatives in one-model-all-categories schemes, face challenges including\nreconstructing anomalous samples and blurry reconstructions. In this paper, we\ncreatively combine a diffusion model and a transformer for multi-class anomaly\ndetection. This approach leverages diffusion to obtain high-frequency\ninformation for refinement, greatly alleviating the blurry reconstruction\nproblem while maintaining the sampling efficiency of the reverse diffusion\nprocess. The task is transformed into image inpainting to disconnect the\ninput-output correlation, thereby mitigating the \"identical shortcuts\" problem\nand avoiding the model from reconstructing anomalous samples. Besides, we\nintroduce category-awareness using dual conditioning to ensure the accuracy of\nprediction and reconstruction in the reverse diffusion process, preventing\nexcessive deviation from the target category, thus effectively enabling\nmulti-class anomaly detection. Futhermore, Spatio-temporal fusion is also\nemployed to fuse heatmaps predicted at different timesteps and scales,\nenhancing the performance of multi-class anomaly detection. Extensive\nexperiments on benchmark datasets demonstrate the superior performance and\nexceptional multi-class anomaly detection capabilities of our proposed method\ncompared to others.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}