{"id":"2407.02674","title":"Elevated UV luminosity density at Cosmic Dawn explained by non-evolving,\n  weakly-mass dependent star formation efficiency","authors":"Robert Feldmann, Michael Boylan-Kolchin, James S. Bullock, Onur\n  \\c{C}atmabacak, Claude-Andr\\'e Faucher-Gigu\\`ere, Christopher C. Hayward,\n  Du\\v{s}an Kere\\v{s}, Alexandres Lazar, Lichen Liang, Jorge Moreno, Pascal A.\n  Oesch, Eliot Quataert, Xuejian Shen, Guochao Sun","authorsParsed":[["Feldmann","Robert",""],["Boylan-Kolchin","Michael",""],["Bullock","James S.",""],["Çatmabacak","Onur",""],["Faucher-Giguère","Claude-André",""],["Hayward","Christopher C.",""],["Kereš","Dušan",""],["Lazar","Alexandres",""],["Liang","Lichen",""],["Moreno","Jorge",""],["Oesch","Pascal A.",""],["Quataert","Eliot",""],["Shen","Xuejian",""],["Sun","Guochao",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 21:27:55 GMT"}],"updateDate":"2024-07-04","timestamp":1719955675000,"abstract":"  Recent observations with the James Webb Space Telescope (JWST) have uncovered\nunexpectedly high cosmic star formation activity in the early Universe, mere\nhundreds of millions of years after the Big Bang. These observations are often\nunderstood to reflect an evolutionary shift in star formation efficiency (SFE)\ncaused by changing galactic conditions during these early epochs. We present\nFIREbox-HR, a high-resolution, cosmological hydrodynamical simulation from the\nFeedback in Realistic Environments project, which offers insights into the SFE\nof galaxies during the first billion years of cosmic time. FIREbox-HR\nre-simulates the cosmic volume (L = 22.1 cMpc) of the original FIREbox run with\neight times higher mass resolution (m_b ~ 7800 M_sun), but with identical\nphysics, down to z ~ 6. FIREbox-HR predicts ultraviolet (UV) luminosity\nfunctions in good agreement with available observational data. The simulation\nalso successfully reproduces the observed cosmic UV luminosity density at z ~ 6\n- 14, demonstrating that relatively high star formation activity in the early\nUniverse is a natural outcome of the baryonic processes encoded in the FIRE-2\nmodel. According to FIREbox-HR, the SFE - halo mass relation for intermediate\nmass halos (M_halo ~ 10^9 - 10^11 M_sun) does not significantly evolve with\nredshift and is only weakly mass-dependent. These properties of the SFE - halo\nmass relation lead to a larger contribution from lower mass halos at higher z,\ndriving the gradual evolution of the observed cosmic UV luminosity density. A\ntheoretical model based on the SFE - halo mass relation inferred from\nFIREbox-HR allows us to explore implications for galaxy evolution. Future\nobservations of UV faint galaxies at z > 12 will provide an opportunity to\nfurther test these predictions and deepen our understanding of star formation\nduring Cosmic Dawn.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}