{"id":"2407.07524","title":"Graph Permutation Entropy: Extensions to the Continuous Case, A step\n  towards Ordinal Deep Learning, and More","authors":"Om Roy, Avalon Campbell-Cousins, John Stewart Fabila Carrasco, Mario A\n  Parra, Javier Escudero","authorsParsed":[["Roy","Om",""],["Campbell-Cousins","Avalon",""],["Carrasco","John Stewart Fabila",""],["Parra","Mario A",""],["Escudero","Javier",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 10:23:17 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 15:56:19 GMT"}],"updateDate":"2024-07-12","timestamp":1720606997000,"abstract":"  Nonlinear dynamics play an important role in the analysis of signals. A\npopular, readily interpretable nonlinear measure is Permutation Entropy. It has\nrecently been extended for the analysis of graph signals, thus providing a\nframework for non-linear analysis of data sampled on irregular domains. Here,\nwe introduce a continuous version of Permutation Entropy, extend it to the\ngraph domain, and develop a ordinal activation function akin to the one of\nneural networks. This is a step towards Ordinal Deep Learning, a potentially\neffective and very recently posited concept. We also formally extend ordinal\ncontrasts to the graph domain. Continuous versions of ordinal contrasts of\nlength 3 are also introduced and their advantage is shown in experiments. We\nalso integrate specific contrasts for the analysis of images and show that it\ngeneralizes well to the graph domain allowing a representation of images,\nrepresented as graph signals, in a plane similar to the entropy-complexity one.\nApplications to synthetic data, including fractal patterns and popular\nnon-linear maps, and real-life MRI data show the validity of these novel\nextensions and potential benefits over the state of the art. By extending very\nrecent concepts related to permutation entropy to the graph domain, we expect\nto accelerate the development of more graph-based entropy methods to enable\nnonlinear analysis of a broader kind of data and establishing relationships\nwith emerging ideas in data science.\n","subjects":["Nonlinear Sciences/Chaotic Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}