{"id":"2407.04331","title":"MuseBarControl: Enhancing Fine-Grained Control in Symbolic Music\n  Generation through Pre-Training and Counterfactual Loss","authors":"Yangyang Shu, Haiming Xu, Ziqin Zhou, Anton van den Hengel, Lingqiao\n  Liu","authorsParsed":[["Shu","Yangyang",""],["Xu","Haiming",""],["Zhou","Ziqin",""],["Hengel","Anton van den",""],["Liu","Lingqiao",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 08:08:22 GMT"}],"updateDate":"2024-07-08","timestamp":1720166902000,"abstract":"  Automatically generating symbolic music-music scores tailored to specific\nhuman needs-can be highly beneficial for musicians and enthusiasts. Recent\nstudies have shown promising results using extensive datasets and advanced\ntransformer architectures. However, these state-of-the-art models generally\noffer only basic control over aspects like tempo and style for the entire\ncomposition, lacking the ability to manage finer details, such as control at\nthe level of individual bars. While fine-tuning a pre-trained symbolic music\ngeneration model might seem like a straightforward method for achieving this\nfiner control, our research indicates challenges in this approach. The model\noften fails to respond adequately to new, fine-grained bar-level control\nsignals. To address this, we propose two innovative solutions. First, we\nintroduce a pre-training task designed to link control signals directly with\ncorresponding musical tokens, which helps in achieving a more effective\ninitialization for subsequent fine-tuning. Second, we implement a novel\ncounterfactual loss that promotes better alignment between the generated music\nand the control prompts. Together, these techniques significantly enhance our\nability to control music generation at the bar level, showing a 13.06\\%\nimprovement over conventional methods. Our subjective evaluations also confirm\nthat this enhanced control does not compromise the musical quality of the\noriginal pre-trained generative model.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}