{"id":"2407.15642","title":"Cinemo: Consistent and Controllable Image Animation with Motion\n  Diffusion Models","authors":"Xin Ma, Yaohui Wang, Gengyun Jia, Xinyuan Chen, Yuan-Fang Li, Cunjian\n  Chen, Yu Qiao","authorsParsed":[["Ma","Xin",""],["Wang","Yaohui",""],["Jia","Gengyun",""],["Chen","Xinyuan",""],["Li","Yuan-Fang",""],["Chen","Cunjian",""],["Qiao","Yu",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:00:03 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 01:35:07 GMT"}],"updateDate":"2024-07-24","timestamp":1721656803000,"abstract":"  Diffusion models have achieved great progress in image animation due to\npowerful generative capabilities. However, maintaining spatio-temporal\nconsistency with detailed information from the input static image over time\n(e.g., style, background, and object of the input static image) and ensuring\nsmoothness in animated video narratives guided by textual prompts still remains\nchallenging. In this paper, we introduce Cinemo, a novel image animation\napproach towards achieving better motion controllability, as well as stronger\ntemporal consistency and smoothness. In general, we propose three effective\nstrategies at the training and inference stages of Cinemo to accomplish our\ngoal. At the training stage, Cinemo focuses on learning the distribution of\nmotion residuals, rather than directly predicting subsequent via a motion\ndiffusion model. Additionally, a structural similarity index-based strategy is\nproposed to enable Cinemo to have better controllability of motion intensity.\nAt the inference stage, a noise refinement technique based on discrete cosine\ntransformation is introduced to mitigate sudden motion changes. Such three\nstrategies enable Cinemo to produce highly consistent, smooth, and\nmotion-controllable results. Compared to previous methods, Cinemo offers\nsimpler and more precise user controllability. Extensive experiments against\nseveral state-of-the-art methods, including both commercial tools and research\napproaches, across multiple metrics, demonstrate the effectiveness and\nsuperiority of our proposed approach.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}