{"id":"2407.09569","title":"Constraining Parameters for the Accelerating Universe in\n  $f(R,\\mathcal{L}_{m})$ Gravity","authors":"Y. Kalpana Devi, S.A. Narawade, B. Mishra","authorsParsed":[["Devi","Y. Kalpana",""],["Narawade","S. A.",""],["Mishra","B.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 07:12:13 GMT"}],"updateDate":"2024-07-16","timestamp":1720509133000,"abstract":"  In the paper, we present an accelerating cosmological model in\n$f(R,\\mathcal{L}_{m})$ gravity with the parameter constrained through the\ncosmological data sets. At the beginning, we have employed a functional form of\n$f(R,\\mathcal{L}_{m}) =\\frac{R}{2}+\\alpha R^2+\\mathcal{L}_{m}^\\beta$, where\n$\\alpha$ and $\\beta$ are model parameters. This model is well motivated from\nthe Starobinsky model in $f(R)$ gravity and the power law form of\n$f(\\mathcal{L}_{m})$. The Hubble parameter has been derived with some algebraic\nmanipulation and constrained by Hubble data and Pantheon$^{+}$ data. With the\nconstraint parameters, present value of deceleration parameter has been\nobtained to as $q_{0}\\approx-0.63$ with the transition at $z_{t}\\approx0.7$. It\nshows the early deceleration and late time acceleration behaviour. The present\nvalue of other geometric parameters such as the jerk and snap parameter are\nobtained to be $j_{0}\\approx0.78$ and $s_{0}\\approx 0.1$ respectively. The\nstate finder diagnostic test gives the quintessence behaviour at present and\nconverging to $\\Lambda$CDM at late times. Moreover the $Om(z)$ diagnostics\ngives negative slope which shows that the model favours the state finder\ndiagnostic result. Also the current age of Universe has been obtained as,\n$t_{0} = 13.64~~Gyrs$. The equation of state parameter also shows the\nquintessence behaviour. Based on the present analysis, it indicates that the\n$f(R,\\mathcal{L}_{m})$ gravitational theory may be another alternative to study\nthe dark energy models.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}