{"id":"2407.09998","title":"Improved models for ideal Fermi gas and ideal Bose gas using quantum\n  phase space","authors":"Rivo Herivola Manjakamanana Ravelonjato, Ravo Tokiniaina Ranaivoson,\n  Raoelina Andriambololona, Roland Raboanary, Naivo Rabesiranana, Solofoarisina\n  Chrysante Wilfrid","authorsParsed":[["Ravelonjato","Rivo Herivola Manjakamanana",""],["Ranaivoson","Ravo Tokiniaina",""],["Andriambololona","Raoelina",""],["Raboanary","Roland",""],["Rabesiranana","Naivo",""],["Wilfrid","Solofoarisina Chrysante",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 20:45:41 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 08:08:04 GMT"}],"updateDate":"2024-07-31","timestamp":1720903541000,"abstract":"  The current models of ideal Fermi gas and ideal Bose gas are often considered\nas compatible with quantum theory. In this work, however, it is shown that\nimprovements should be introduced into these models to take into account the\nquantum nature of phase space related to the uncertainty principle. The\nconstruction of the improved models is based on the use of the concepts of\nphase space representation of quantum mechanics and quantum phase space that\nwere introduced and developed recently. Hamiltonian operator of a gas particle\nand its eigenstates are firstly determined and the use of quantum statistical\nmechanics leads to the deduction of the thermodynamics properties of the ideal\ngas itself. The explicit expressions of thermodynamic quantities such as the\ngrand canonical potential, the thermodynamic particles number, the internal\nenergy and the pressure as well as the state equations, corresponding to the\nimproved models, are established for both bosons and fermions. The corrections\nintroduced by these expressions are expected to be particularly significant at\nlow temperature and for confined volume. They permit in particular to highlight\nthe existence of quantum shape and size effects. It is also shown that the\nthermodynamics functions and variables are directly related to the momenta\nquantum statistical variances. Well-known relations corresponding to classic al\nideal gas model can be retrieved from the improved models as asymptotic limits\nat high temperature and for large volume.\n","subjects":["Condensed Matter/Quantum Gases","Condensed Matter/Statistical Mechanics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}