{"id":"2407.05293","title":"Wideband Beamforming with RIS: A Unified Framework via Space-Frequency\n  Transformation","authors":"Xiaowei Qian, Xiaoling Hu, Chenxi Liu, Mugen Peng","authorsParsed":[["Qian","Xiaowei",""],["Hu","Xiaoling",""],["Liu","Chenxi",""],["Peng","Mugen",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 07:23:22 GMT"}],"updateDate":"2024-07-09","timestamp":1720337002000,"abstract":"  The spectrum shift from the sub-6G band to the high-frequency band has posed\nan ever-increasing demand on the paradigm shift from narrowband beamforming to\nwideband beamforming. Despite recent research efforts, the problem of wideband\nbeamforming design is particularly challenging in reconfigurable intelligent\nsurface (RIS)-assisted systems, due to that RIS is not capable of performing\nfrequency-dependent phase shift, therefore inducing high signal processing\ncomplexity. In this paper, we propose a simple-yet-efficient wideband\nbeamforming design for RIS-assisted systems, in which a transmitter sends\nwideband signals to a desired target, through the aid of the RIS. In our\nproposed design, we exploit space-frequency Fourier transformation and\nstationary phase method to yield an approximate closed-form solution of the RIS\nphase shifts which significantly reduces the signal processing complexity,\ncompared to the existing approaches. The obtained solution is then used to\ngenerate a large and flat beampattern over the desired frequency band. Through\nnumerical results, we validate the effectiveness of our proposed beamforming\ndesign and demonstrate how it can improve system performances in terms of\ncommunication rate and sensing resolution. Beyond generating the flat\nbeampattern, we highlight that our proposed design is capable of mimicking any\ndesired beampattern by matching the RIS phase shift with the amplitude\nmodulation function, thus providing valuable insights into the design of novel\nwideband beamforming for RIS-assisted systems.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}