{"id":"2407.21050","title":"Artificial Intelligence in Extracting Diagnostic Data from Dental\n  Records","authors":"Yao-Shun Chuang, Chun-Teh Lee, Oluwabunmi Tokede, Guo-Hao Lin, Ryan\n  Brandon, Trung Duong Tran, Xiaoqian Jiang, Muhammad F. Walji","authorsParsed":[["Chuang","Yao-Shun",""],["Lee","Chun-Teh",""],["Tokede","Oluwabunmi",""],["Lin","Guo-Hao",""],["Brandon","Ryan",""],["Tran","Trung Duong",""],["Jiang","Xiaoqian",""],["Walji","Muhammad F.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 04:05:48 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 23:38:35 GMT"}],"updateDate":"2024-08-14","timestamp":1721707548000,"abstract":"  This research addresses the issue of missing structured data in dental\nrecords by extracting diagnostic information from unstructured text. The\nupdated periodontology classification system's complexity has increased\nincomplete or missing structured diagnoses. To tackle this, we use advanced AI\nand NLP methods, leveraging GPT-4 to generate synthetic notes for fine-tuning a\nRoBERTa model. This significantly enhances the model's ability to understand\nmedical and dental language. We evaluated the model using 120 randomly selected\nclinical notes from two datasets, demonstrating its improved diagnostic\nextraction accuracy. The results showed high accuracy in diagnosing periodontal\nstatus, stage, and grade, with Site 1 scoring 0.99 and Site 2 scoring 0.98. In\nthe subtype category, Site 2 achieved perfect scores, outperforming Site 1.\nThis method enhances extraction accuracy and broadens its use across dental\ncontexts. The study underscores AI and NLP's transformative impact on\nhealthcare delivery and management. Integrating AI and NLP technologies\nenhances documentation and simplifies administrative tasks by precisely\nextracting complex clinical information. This approach effectively addresses\nchallenges in dental diagnostics. Using synthetic training data from LLMs\noptimizes the training process, improving accuracy and efficiency in\nidentifying periodontal diagnoses from clinical notes. This innovative method\nholds promise for broader healthcare applications, potentially improving\npatient care quality.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}