{"id":"2407.01521","title":"Improving Diffusion Inverse Problem Solving with Decoupled Noise\n  Annealing","authors":"Bingliang Zhang, Wenda Chu, Julius Berner, Chenlin Meng, Anima\n  Anandkumar, Yang Song","authorsParsed":[["Zhang","Bingliang",""],["Chu","Wenda",""],["Berner","Julius",""],["Meng","Chenlin",""],["Anandkumar","Anima",""],["Song","Yang",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 17:59:23 GMT"}],"updateDate":"2024-07-02","timestamp":1719856763000,"abstract":"  Diffusion models have recently achieved success in solving Bayesian inverse\nproblems with learned data priors. Current methods build on top of the\ndiffusion sampling process, where each denoising step makes small modifications\nto samples from the previous step. However, this process struggles to correct\nerrors from earlier sampling steps, leading to worse performance in complicated\nnonlinear inverse problems, such as phase retrieval. To address this challenge,\nwe propose a new method called Decoupled Annealing Posterior Sampling (DAPS)\nthat relies on a novel noise annealing process. Specifically, we decouple\nconsecutive steps in a diffusion sampling trajectory, allowing them to vary\nconsiderably from one another while ensuring their time-marginals anneal to the\ntrue posterior as we reduce noise levels. This approach enables the exploration\nof a larger solution space, improving the success rate for accurate\nreconstructions. We demonstrate that DAPS significantly improves sample quality\nand stability across multiple image restoration tasks, particularly in\ncomplicated nonlinear inverse problems. For example, we achieve a PSNR of\n30.72dB on the FFHQ 256 dataset for phase retrieval, which is an improvement of\n9.12dB compared to existing methods.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}