{"id":"2407.18106","title":"Phase-resolved Spectroscopy of Low-frequency Quasi-periodic Oscillations\n  from the Newly Discovered Black Hole X-ray Binary Swift J1727.8-1613","authors":"Qing-Cang Shui, Shu Zhang, Jiang-Qiang Peng, Shuang-Nan Zhang, Yu-Peng\n  Chen, Long Ji, Ling-Da Kong, Hua Feng, Zhuo-Li Yu, Peng-Ju Wang, Zhi Chang,\n  Hong-Xing Yin, Jin-Lu Qu, Lian Tao, Ming-Yu Ge, Liang Zhang, Jian Li","authorsParsed":[["Shui","Qing-Cang",""],["Zhang","Shu",""],["Peng","Jiang-Qiang",""],["Zhang","Shuang-Nan",""],["Chen","Yu-Peng",""],["Ji","Long",""],["Kong","Ling-Da",""],["Feng","Hua",""],["Yu","Zhuo-Li",""],["Wang","Peng-Ju",""],["Chang","Zhi",""],["Yin","Hong-Xing",""],["Qu","Jin-Lu",""],["Tao","Lian",""],["Ge","Ming-Yu",""],["Zhang","Liang",""],["Li","Jian",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 15:09:24 GMT"}],"updateDate":"2024-07-26","timestamp":1721920164000,"abstract":"  Low-frequency quasi-periodic oscillations (LFQPOs) are commonly observed in\nX-ray light curves of black hole X-ray binaries (BHXRBs); however, their origin\nremains a topic of debate. In order to thoroughly investigate variations in\nspectral properties on the QPO timescale, we utilized the Hilbert-Huang\ntransform technique to conduct phase-resolved spectroscopy across a broad\nenergy band for LFQPOs in the newly discovered BHXRB Swift J1727.8-1613. This\nis achieved through quasi-simultaneous observations from Neutron star Interior\nComposition ExploreR (NICER), Nuclear Spectroscopic Telescope ARray (NuSTAR),\nand Hard X-ray Modulation Telescope (Insight-HXMT). Our analysis reveals that\nboth the non-thermal and disk-blackbody components exhibit variations on the\nQPO timescale, with the former dominating the QPO variability. For the spectral\nparameters, we observe modulation of the disk temperature, spectral indices,\nand reflection fraction with the QPO phase with high statistical significance\n(>5\\sigma). Notably, the variation in the disk temperature is found to precede\nthe variations in the non-thermal and disk fluxes by ~0.4-0.5 QPO cycles. We\nsuggest that these findings offer further evidence that the type-C QPO\nvariability is a result of geometric effects of the accretion flow.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"atFrDbFZyWR_lBfqh6Sxp30Yostv71S6oA5JC_6qmU4","pdfSize":"2223124","objectId":"0x50be26734c4f44a9c549ee50e4ebf128ab2bbcfb8b7f88ab17a6a36e8fd0c9e5","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
