{"id":"2407.07374","title":"DuInNet: Dual-Modality Feature Interaction for Point Cloud Completion","authors":"Xinpu Liu, Baolin Hou, Hanyun Wang, Ke Xu, Jianwei Wan, Yulan Guo","authorsParsed":[["Liu","Xinpu",""],["Hou","Baolin",""],["Wang","Hanyun",""],["Xu","Ke",""],["Wan","Jianwei",""],["Guo","Yulan",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 05:19:40 GMT"}],"updateDate":"2024-07-11","timestamp":1720588780000,"abstract":"  To further promote the development of multimodal point cloud completion, we\ncontribute a large-scale multimodal point cloud completion benchmark\nModelNet-MPC with richer shape categories and more diverse test data, which\ncontains nearly 400,000 pairs of high-quality point clouds and rendered images\nof 40 categories. Besides the fully supervised point cloud completion task, two\nadditional tasks including denoising completion and zero-shot learning\ncompletion are proposed in ModelNet-MPC, to simulate real-world scenarios and\nverify the robustness to noise and the transfer ability across categories of\ncurrent methods. Meanwhile, considering that existing multimodal completion\npipelines usually adopt a unidirectional fusion mechanism and ignore the shape\nprior contained in the image modality, we propose a Dual-Modality Feature\nInteraction Network (DuInNet) in this paper. DuInNet iteratively interacts\nfeatures between point clouds and images to learn both geometric and texture\ncharacteristics of shapes with the dual feature interactor. To adapt to\nspecific tasks such as fully supervised, denoising, and zero-shot learning\npoint cloud completions, an adaptive point generator is proposed to generate\ncomplete point clouds in blocks with different weights for these two\nmodalities. Extensive experiments on the ShapeNet-ViPC and ModelNet-MPC\nbenchmarks demonstrate that DuInNet exhibits superiority, robustness and\ntransfer ability in all completion tasks over state-of-the-art methods. The\ncode and dataset will be available soon.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}