{"id":"2407.13036","title":"ColorMAE: Exploring data-independent masking strategies in Masked\n  AutoEncoders","authors":"Carlos Hinojosa, Shuming Liu, Bernard Ghanem","authorsParsed":[["Hinojosa","Carlos",""],["Liu","Shuming",""],["Ghanem","Bernard",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 22:04:00 GMT"}],"updateDate":"2024-07-19","timestamp":1721253840000,"abstract":"  Masked AutoEncoders (MAE) have emerged as a robust self-supervised framework,\noffering remarkable performance across a wide range of downstream tasks. To\nincrease the difficulty of the pretext task and learn richer visual\nrepresentations, existing works have focused on replacing standard random\nmasking with more sophisticated strategies, such as adversarial-guided and\nteacher-guided masking. However, these strategies depend on the input data thus\ncommonly increasing the model complexity and requiring additional calculations\nto generate the mask patterns. This raises the question: Can we enhance MAE\nperformance beyond random masking without relying on input data or incurring\nadditional computational costs? In this work, we introduce a simple yet\neffective data-independent method, termed ColorMAE, which generates different\nbinary mask patterns by filtering random noise. Drawing inspiration from color\nnoise in image processing, we explore four types of filters to yield mask\npatterns with different spatial and semantic priors. ColorMAE requires no\nadditional learnable parameters or computational overhead in the network, yet\nit significantly enhances the learned representations. We provide a\ncomprehensive empirical evaluation, demonstrating our strategy's superiority in\ndownstream tasks compared to random masking. Notably, we report an improvement\nof 2.72 in mIoU in semantic segmentation tasks relative to baseline MAE\nimplementations.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}