{"id":"2407.15358","title":"PRIME: Blind Multispectral Unmixing Using Virtual Quantum Prism and\n  Convex Geometry","authors":"Chia-Hsiang Lin and Jhao-Ting Lin","authorsParsed":[["Lin","Chia-Hsiang",""],["Lin","Jhao-Ting",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 03:58:24 GMT"}],"updateDate":"2024-07-23","timestamp":1721620704000,"abstract":"  Multispectral unmixing (MU) is critical due to the inevitable mixed pixel\nphenomenon caused by the limited spatial resolution of typical multispectral\nimages in remote sensing. However, MU mathematically corresponds to the\nunderdetermined blind source separation problem, thus highly challenging,\npreventing researchers from tackling it. Previous MU works all ignore the\nunderdetermined issue, and merely consider scenarios with more bands than\nsources. This work attempts to resolve the underdetermined issue by further\nconducting the light-splitting task using a network-inspired virtual prism, and\nas this task is challenging, we achieve so by incorporating the very advanced\nquantum feature extraction techniques. We emphasize that the prism is virtual\n(allowing us to fix the spectral response as a simple deterministic matrix), so\nthe virtual hyperspectral image (HSI) it generates has no need to correspond to\nsome real hyperspectral sensor; in other words, it is good enough as long as\nthe virtual HSI satisfies some fundamental properties of light splitting (e.g.,\nnon-negativity and continuity). With the above virtual quantum prism, we know\nthat the virtual HSI is expected to possess some desired simplex structure.\nThis allows us to adopt the convex geometry to unmix the spectra, followed by\ndownsampling the pure spectra back to the multispectral domain, thereby\nachieving MU. Experimental evidence shows great potential of our MU algorithm,\ntermed as prism-inspired multispectral endmember extraction (PRIME).\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}