{"id":"2407.21756","title":"Topological Woodward-Hoffmann classification for cycloadditions in\n  polycyclic aromatic azomethine ylides","authors":"Juan Li, Amir Mirzanejad, Wen-Han Dong, Kun Liu, Marcus Richter,\n  Xiao-Ye Wang, Reinhard Berger, Shixuan Du, Willi Auw\\\"arter, Johannes V.\n  Barth, Ji Ma, Klaus M\\\"ullen, Xinliang Feng, Jia-Tao Sun, Lukas Muechler,\n  Carlos-Andres Palma","authorsParsed":[["Li","Juan",""],["Mirzanejad","Amir",""],["Dong","Wen-Han",""],["Liu","Kun",""],["Richter","Marcus",""],["Wang","Xiao-Ye",""],["Berger","Reinhard",""],["Du","Shixuan",""],["Auwärter","Willi",""],["Barth","Johannes V.",""],["Ma","Ji",""],["Müllen","Klaus",""],["Feng","Xinliang",""],["Sun","Jia-Tao",""],["Muechler","Lukas",""],["Palma","Carlos-Andres",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 17:19:09 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 15:48:57 GMT"}],"updateDate":"2024-08-02","timestamp":1722446349000,"abstract":"  The study of cycloaddition mechanisms is central to the fabrication of\nextended sp2 carbon nanostructures. Reaction modeling in this context has\nfocused mostly on putative, energetically preferred, exothermic products with\nlimited consideration for symmetry allowed or forbidden mechanistic effects.\nHere, we introduce a scheme for classifying symmetry-forbidden reaction\ncoordinates in Woodward-Hoffmann correlation diagrams. Topological classifiers\ngrant access to the study of reaction pathways and correlation diagrams in the\nsame footing, for the purpose of elucidating mechanisms and products of\npolycyclic aromatic azomethine ylide (PAMY) cycloadditions with\npentacene-yielding polycyclic aromatic hydrocarbons with an isoindole core in\nthe solid-state and on surfaces as characterized by mass spectrometry and\nscanning tunneling microscopy, respectively. By means of a tight-binding\nreaction model and density functional theory (DFT) we find\ntopologically-allowed pathways if a product is endothermic, and\ntopologically-forbidden if a product is exothermic. Our work unveils\ntopological classification as a crucial element for reaction modeling for\nnanographene engineering, and highlights its fundamental role in the design of\ncycloadditions in on-surface and solid-state chemical reactions, while\nunderscoring that exothermic pathways can be topologically-forbidden.\n","subjects":["Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}