{"id":"2407.02662","title":"Supporters and Skeptics: LLM-based Analysis of Engagement with Mental\n  Health (Mis)Information Content on Video-sharing Platforms","authors":"Viet Cuong Nguyen, Mini Jain, Abhijat Chauhan, Heather Jaime Soled,\n  Santiago Alvarez Lesmes, Zihang Li, Michael L. Birnbaum, Sunny X. Tang,\n  Srijan Kumar, Munmun De Choudhury","authorsParsed":[["Nguyen","Viet Cuong",""],["Jain","Mini",""],["Chauhan","Abhijat",""],["Soled","Heather Jaime",""],["Lesmes","Santiago Alvarez",""],["Li","Zihang",""],["Birnbaum","Michael L.",""],["Tang","Sunny X.",""],["Kumar","Srijan",""],["De Choudhury","Munmun",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 20:51:06 GMT"}],"updateDate":"2024-07-04","timestamp":1719953466000,"abstract":"  Over one in five adults in the US lives with a mental illness. In the face of\na shortage of mental health professionals and offline resources, online\nshort-form video content has grown to serve as a crucial conduit for\ndisseminating mental health help and resources. However, the ease of content\ncreation and access also contributes to the spread of misinformation, posing\nrisks to accurate diagnosis and treatment. Detecting and understanding\nengagement with such content is crucial to mitigating their harmful effects on\npublic health. We perform the first quantitative study of the phenomenon using\nYouTube Shorts and Bitchute as the sites of study. We contribute MentalMisinfo,\na novel labeled mental health misinformation (MHMisinfo) dataset of 739 videos\n(639 from Youtube and 100 from Bitchute) and 135372 comments in total, using an\nexpert-driven annotation schema. We first found that few-shot in-context\nlearning with large language models (LLMs) are effective in detecting MHMisinfo\nvideos. Next, we discover distinct and potentially alarming linguistic patterns\nin how audiences engage with MHMisinfo videos through commentary on both\nvideo-sharing platforms. Across the two platforms, comments could exacerbate\nprevailing stigma with some groups showing heightened susceptibility to and\nalignment with MHMisinfo. We discuss technical and public health-driven\nadaptive solutions to tackling the \"epidemic\" of mental health misinformation\nonline.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Computation and Language","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"kRG_xEp48nWx8qdrcdyjZmiHCjy6BrFJ1891Nqjm5Og","pdfSize":"858318"}
