{"id":"2407.11060","title":"A review of graph neural network applications in mechanics-related\n  domains","authors":"Yingxue Zhao, Haoran Li, Haosu Zhou, Hamid Reza Attar, Tobias Pfaff,\n  Nan Li","authorsParsed":[["Zhao","Yingxue",""],["Li","Haoran",""],["Zhou","Haosu",""],["Attar","Hamid Reza",""],["Pfaff","Tobias",""],["Li","Nan",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:39:03 GMT"}],"updateDate":"2024-07-17","timestamp":1720625943000,"abstract":"  Mechanics-related problems often present unique challenges in achieving\naccurate geometric and physical representations, particularly for non-uniform\nstructures. Graph neural networks (GNNs) have emerged as a promising tool to\ntackle these challenges by adeptly learning from graph data with irregular\nunderlying structures. Consequently, recent years have witnessed a surge in\ncomplex mechanics-related applications inspired by the advancements of GNNs.\nDespite this process, there is a notable absence of a systematic review\naddressing the recent advancement of GNNs in solving mechanics-related\nproblems. To bridge this gap, this review article aims to provide an in-depth\noverview of the GNN applications in mechanics-related domains while identifying\nkey challenges and outlining potential future research directions. In this\nreview article, we begin by introducing the fundamental algorithms of GNNs that\nare widely employed in mechanics-related applications. We provide a concise\nexplanation of their underlying principles to establish a solid understanding\nthat will serve as a basis for exploring the applications of GNNs in\nmechanics-related domains. The scope of this paper is intended to cover the\ncategorisation of literature into solid mechanics, fluid mechanics, and\ninterdisciplinary mechanics-related domains, providing a comprehensive summary\nof graph representation methodologies, GNN architectures, and further\ndiscussions in their respective subdomains. Additionally, open data and source\ncodes relevant to these applications are summarised for the convenience of\nfuture researchers. This article promotes an interdisciplinary integration of\nGNNs and mechanics and provides a guide for researchers interested in applying\nGNNs to solve complex mechanics-related problems.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}