{"id":"2407.10257","title":"Drag conductance induced by neutral-mode localization in fractional\n  quantum Hall junctions","authors":"Jinhong Park, Moshe Goldstein, Yuval Gefen, Alexander D. Mirlin, and\n  Jukka I. V\\\"ayrynen","authorsParsed":[["Park","Jinhong",""],["Goldstein","Moshe",""],["Gefen","Yuval",""],["Mirlin","Alexander D.",""],["Väyrynen","Jukka I.",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 15:50:41 GMT"}],"updateDate":"2024-07-19","timestamp":1720972241000,"abstract":"  A junction of two 2/3 fractional quantum Hall (FQH) edges, with no charge\ntunneling between them, may exhibit Anderson localization of neutral modes.\nManifestations of such localization in transport properties of the junction are\nexplored. There are two competing localization channels, ``neutral-mode\nsuperconductivity'' and ``neutral-mode backscattering''. Localization in any of\nthese channels leads to an effective theory of the junction that is\ncharacteristic for FQH effect of bosons, with a minimal integer excitation\ncharge equal to two, and with elementary quasiparticle charge equal to 2/3.\nThese values can be measured by studying shot noise in tunneling experiments.\nUnder the assumption of ballistic transport in the arms connecting the junction\nto contacts, the two-terminal conductance of the junction is found to be 4/3\nfor the former localization channel and 1/3 for the latter. The four-terminal\nconductance matrix reveals in this regime a strong quantized drag between the\nedges induced by neutral-mode localization. The two localization channels lead\nto opposite signs of the drag conductance, equal to $\\pm 1/4$, which can also\nbe interpreted as a special type of Andreev scattering. Coherent random\ntunneling in arms of the device (which are segments of 2/3 edges) leads to\nstrong mesoscopic fluctuations of the conductance matrix. In the case of fully\nequilibrated arms, transport via the junction is insensitive to neutral-mode\nlocalization: The two-terminal conductance is quantized to 2/3 and the drag is\nabsent.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mOs_ETO4ayBapfwJZBIxQ794vqp1aRoc_MfbLGVA0iA","pdfSize":"827288"}
