{"id":"2407.00623","title":"Consistency Purification: Effective and Efficient Diffusion Purification\n  towards Certified Robustness","authors":"Yiquan Li, Zhongzhu Chen, Kun Jin, Jiongxiao Wang, Bo Li, Chaowei Xiao","authorsParsed":[["Li","Yiquan",""],["Chen","Zhongzhu",""],["Jin","Kun",""],["Wang","Jiongxiao",""],["Li","Bo",""],["Xiao","Chaowei",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 08:34:35 GMT"}],"updateDate":"2024-07-02","timestamp":1719736475000,"abstract":"  Diffusion Purification, purifying noised images with diffusion models, has\nbeen widely used for enhancing certified robustness via randomized smoothing.\nHowever, existing frameworks often grapple with the balance between efficiency\nand effectiveness. While the Denoising Diffusion Probabilistic Model (DDPM)\noffers an efficient single-step purification, it falls short in ensuring\npurified images reside on the data manifold. Conversely, the Stochastic\nDiffusion Model effectively places purified images on the data manifold but\ndemands solving cumbersome stochastic differential equations, while its\nderivative, the Probability Flow Ordinary Differential Equation (PF-ODE),\nthough solving simpler ordinary differential equations, still requires multiple\ncomputational steps. In this work, we demonstrated that an ideal purification\npipeline should generate the purified images on the data manifold that are as\nmuch semantically aligned to the original images for effectiveness in one step\nfor efficiency. Therefore, we introduced Consistency Purification, an\nefficiency-effectiveness Pareto superior purifier compared to the previous\nwork. Consistency Purification employs the consistency model, a one-step\ngenerative model distilled from PF-ODE, thus can generate on-manifold purified\nimages with a single network evaluation. However, the consistency model is\ndesigned not for purification thus it does not inherently ensure semantic\nalignment between purified and original images. To resolve this issue, we\nfurther refine it through Consistency Fine-tuning with LPIPS loss, which\nenables more aligned semantic meaning while keeping the purified images on data\nmanifold. Our comprehensive experiments demonstrate that our Consistency\nPurification framework achieves state-of the-art certified robustness and\nefficiency compared to baseline methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}