{"id":"2407.15658","title":"Anisotropy of the zigzag order in the Kitaev honeycomb magnet\n  $\\alpha$-RuBr$_3$","authors":"John S. Pearce, David A. S. Kaib, Zeyu Ma, Danrui Ni, R. J. Cava,\n  Roser Valenti, Radu Coldea, and Amalia I. Coldea","authorsParsed":[["Pearce","John S.",""],["Kaib","David A. S.",""],["Ma","Zeyu",""],["Ni","Danrui",""],["Cava","R. J.",""],["Valenti","Roser",""],["Coldea","Radu",""],["Coldea","Amalia I.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:18:30 GMT"}],"updateDate":"2024-07-23","timestamp":1721657910000,"abstract":"  Kitaev materials often order magnetically at low temperatures due to the\npresence of non-Kitaev interactions. Torque magnetometry is a very sensitive\ntechnique for probing the magnetic anisotropy, which is critical in\nunderstanding the magnetic ground state. In this work, we report detailed\nsingle-crystal torque measurements in the proposed Kitaev candidate honeycomb\nmagnet $\\alpha$-RuBr$_3$, which displays zigzag order below 34 K. Based on\nangular-dependent torque studies in magnetic fields up to 16 T rotated in the\nplane normal to the honeycomb layers, we find an easy-plane anisotropy with a\ntemperature dependence of the torque amplitude following closely the behaviour\nof the powder magnetic susceptibility. The torque for field rotated in the\nhoneycomb plane has a clear six-fold periodicity with a saw-tooth shape,\nreflecting the three-fold symmetry of the crystal structure and stabilization\nof different zigzag domains depending on the field orientation, with a torque\namplitude that follows an order parameter form inside the zigzag phase. By\ncomparing experimental data with theoretical calculations we identify the\nrelevant anisotropic interactions and the role of the competition between\ndifferent zigzag domains in this candidate Kitaev material.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}