{"id":"2407.02279","title":"How to Boost Any Loss Function","authors":"Richard Nock and Yishay Mansour","authorsParsed":[["Nock","Richard",""],["Mansour","Yishay",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 14:08:23 GMT"}],"updateDate":"2024-07-03","timestamp":1719929303000,"abstract":"  Boosting is a highly successful ML-born optimization setting in which one is\nrequired to computationally efficiently learn arbitrarily good models based on\nthe access to a weak learner oracle, providing classifiers performing at least\nslightly differently from random guessing. A key difference with gradient-based\noptimization is that boosting's original model does not requires access to\nfirst order information about a loss, yet the decades long history of boosting\nhas quickly evolved it into a first order optimization setting -- sometimes\neven wrongfully \\textit{defining} it as such. Owing to recent progress\nextending gradient-based optimization to use only a loss' zeroth ($0^{th}$)\norder information to learn, this begs the question: what loss functions can be\nefficiently optimized with boosting and what is the information really needed\nfor boosting to meet the \\textit{original} boosting blueprint's requirements?\n  We provide a constructive formal answer essentially showing that \\textit{any}\nloss function can be optimized with boosting and thus boosting can achieve a\nfeat not yet known to be possible in the classical $0^{th}$ order setting,\nsince loss functions are not required to be be convex, nor differentiable or\nLipschitz -- and in fact not required to be continuous either. Some tools we\nuse are rooted in quantum calculus, the mathematical field -- not to be\nconfounded with quantum computation -- that studies calculus without passing to\nthe limit, and thus without using first order information.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jrXQnbekL0ghpyJ0FSAMMePkHRgEN5JWf1w10SURmCg","pdfSize":"1571421","objectId":"0xa2bedd4dddaa9cf4ea005b211ceb7527117993bf3df41575eba63365ded1948a","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
