{"id":"2407.00250","title":"Mind the Gap: Analyzing Lacunae with Transformer-Based Transcription","authors":"Jaydeep Borkar and David A. Smith","authorsParsed":[["Borkar","Jaydeep",""],["Smith","David A.",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 22:52:39 GMT"}],"updateDate":"2024-07-02","timestamp":1719615159000,"abstract":"  Historical documents frequently suffer from damage and inconsistencies,\nincluding missing or illegible text resulting from issues such as holes, ink\nproblems, and storage damage. These missing portions or gaps are referred to as\nlacunae. In this study, we employ transformer-based optical character\nrecognition (OCR) models trained on synthetic data containing lacunae in a\nsupervised manner. We demonstrate their effectiveness in detecting and\nrestoring lacunae, achieving a success rate of 65%, compared to a base model\nlacking knowledge of lacunae, which achieves only 5% restoration. Additionally,\nwe investigate the mechanistic properties of the model, such as the log\nprobability of transcription, which can identify lacunae and other errors\n(e.g., mistranscriptions due to complex writing or ink issues) in line images\nwithout directly inspecting the image. This capability could be valuable for\nscholars seeking to distinguish images containing lacunae or errors from clean\nones. Although we explore the potential of attention mechanisms in flagging\nlacunae and transcription errors, our findings suggest it is not a significant\nfactor. Our work highlights a promising direction in utilizing\ntransformer-based OCR models for restoring or analyzing damaged historical\ndocuments.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uYzKm4j6WzuwyfnzUp3gs8HSl-e6TmDxAgtpEUP2iMQ","pdfSize":"488497","objectId":"0x808b4df2963a1c714ce3f5d66d2e983391e9685fc95c502f125fde865c78e3e8","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
