{"id":"2407.21356","title":"Air-blood interface engineered microfluidic device to mimic shear rate\n  gradient induced human bleeding model","authors":"Shobhit Das, Shilpi Pandey, Oliver Hayden","authorsParsed":[["Das","Shobhit",""],["Pandey","Shilpi",""],["Hayden","Oliver",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 05:56:32 GMT"}],"updateDate":"2024-08-01","timestamp":1722405392000,"abstract":"  Microfluidic technology has emerged as a powerful tool for studying complex\nbiological processes with enhanced precision and control. A microfluidic chip\nwas designed to emulate human-like microvascular networks with precise control\nover channel geometry and flow conditions. By simulating blood flow dynamics\nduring bleeding events, we successfully observed the real-time interactions of\nplatelets and their aggregation induced by shear rate gradient at the wound\nsite. Platelet dynamics is primarily influenced by physico-mechanical condition\nof blood vessels with pathophysiological condition of blood at close proximity\nof vascular injury site. This microfluidic platform facilitated the\ninvestigation of platelet adhesion, activation, and clot formation, providing a\nunique opportunity to study the spatiotemporal dynamics of platelet aggregation\nand blood clot. Our findings shed light on the intricate mechanisms underlying\nthrombus formation and platelet-mediated aggregation, offering a more accurate\nand dynamic representation of human haemostasis compared to traditional animal\nmodels. In the conventional approach, the human bleeding model is tried on\nmouse due to anatomy and pathological similarities between mouse and humans.\nThis study will simplify and standardize the blood and vasculature conditions.\nThe microfluidic-based replication of the bleeding model holds significant\npromise in advancing our understanding of clotting disorders and wound healing\nprocesses. Furthermore, it paves the way for targeted therapeutic interventions\nin managing bleeding disorders and enhancing clinical strategies for promoting\nefficient wound closure. Ultimately, this study demonstrates the potential of\nmicrofluidics to revolutionize haemostasis research and opens up new avenues\nfor the development of personalized medicine approaches in the field of\nclotting disorders.\n","subjects":["Physics/Biological Physics","Quantitative Biology/Cell Behavior","Quantitative Biology/Tissues and Organs"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"4M58AJcLKq3nfaZWvEdPe2BXq-LwYmWR7NVBy3CV3YU","pdfSize":"785353"}
