{"id":"2407.14586","title":"Universal scaling solution for a rigidity transition: renormalization\n  group flows near the upper critical dimension","authors":"Stephen J. Thornton, Danilo B. Liarte, Itai Cohen, James P. Sethna","authorsParsed":[["Thornton","Stephen J.",""],["Liarte","Danilo B.",""],["Cohen","Itai",""],["Sethna","James P.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 18:00:00 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 14:36:45 GMT"}],"updateDate":"2024-08-14","timestamp":1721412000000,"abstract":"  Rigidity transitions induced by the formation of system-spanning disordered\nrigid clusters, like the jamming transition, can be well-described in most\nphysically relevant dimensions by mean-field theories. A dynamical mean-field\ntheory commonly used to study these transitions, the coherent potential\napproximation (CPA), shows logarithmic corrections in $2$ dimensions. By\nsolving the theory in arbitrary dimensions and extracting the universal scaling\npredictions, we show that these logarithmic corrections are a symptom of an\nupper critical dimension $d_{u}=2$, below which the critical exponents are\nmodified. We recapitulate Ken Wilson's phenomenology of the\n$(4-\\epsilon)$-dimensional Ising model, but with the upper critical dimension\nreduced to $2$. We interpret this using normal form theory as a transcritical\nbifurcation in the RG flows and extract the universal nonlinear coefficients to\nmake explicit predictions for the behavior near $2$ dimensions. This\nbifurcation is driven by a variable that is dangerously irrelevant in all\ndimensions $d>2$ which incorporates the physics of long-wavelength phonons and\nlow-frequency elastic dissipation. We derive universal scaling functions from\nthe CPA sufficient to predict all linear response in randomly diluted isotropic\nelastic systems in all dimensions.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}