{"id":"2407.04771","title":"The SLACS strong lens sample, debiased","authors":"Alessandro Sonnenfeld (1) ((1) Shanghai Jiao Tong University)","authorsParsed":[["Sonnenfeld","Alessandro","","Shanghai Jiao Tong University"]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-09","timestamp":1720202401000,"abstract":"  Strong gravitational lensing observations can provide extremely valuable\ninformation on the structure of galaxies, but their interpretation is made\ndifficult by selection effects, which, if not accounted for, introduce a bias\nbetween the properties of strong lens galaxies and those of the general\npopulation. A rigorous treatment of the strong lensing bias requires, in\nprinciple, to fully forward model the lens selection process. However, doing so\nfor existing lens surveys is prohibitively difficult. With this work we propose\na practical solution to the problem: using an empirical model to capture the\nmost complex aspects of the lens finding process, and constraining it directly\nfrom the data together with the properties of the lens population. We applied\nthis method to real data from the SLACS sample of strong lenses. Assuming a\npower-law density profile, we recovered the mass distribution of the parent\npopulation of galaxies from which the SLACS lenses were drawn. We found that\nearly-type galaxies with a stellar mass of $\\log{M_*/M_\\odot}=11.3$ and average\nsize have a median projected mass enclosed within a $5$~kpc aperture of\n$\\log{M_5/M_\\odot}=11.332\\pm0.013$, and an average logarithmic density slope of\n$\\gamma=1.99\\pm0.03$. These values are respectively $0.02$~dex and $0.1$ lower\nthan inferred when ignoring selection effects. According to our model, most of\nthe bias is due to the prioritisation of SLACS follow-up observations based on\nthe measured velocity dispersion. As a result, the strong lensing bias in\n$\\gamma$ reduces to $\\sim0.01$ when controlling for stellar velocity\ndispersion.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}