{"id":"2407.17317","title":"Asymmetries in asymptotic giant branch stars and their winds. I. From 3D\n  RHD models to synthetic observables","authors":"Joachim Wiegert, Bernd Freytag, Susanne H\\\"ofner","authorsParsed":[["Wiegert","Joachim",""],["Freytag","Bernd",""],["Höfner","Susanne",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 14:39:37 GMT"}],"updateDate":"2024-07-25","timestamp":1721831977000,"abstract":"  [Abridged] AGB stars are significant contributors to the metal enrichment of\nthe interstellar medium. In this paper, we adapted models from advanced RHD\nsimulations as input for radiative transfer software to create synthetic\nobservables. A major goal is to describe an AGB star's non-sphericity and to\nsimulate its effects on the surrounding dusty envelope. We developed tools to\ntranslate models of an AGB star and its dust-driven wind from simulations with\nCO5BOLD into the format used by RADMC-3D. We preserved the asymmetric shape of\nthe star by including it as a `dust species' and by using temperature data\ncomputed in CO5BOLD. Circumstellar dust is included using Mg2SiO4 opacity data\nwith spatially dependent grain sizes. We compared images and SEDs created with\nRADMC-3D of a model with similar output made with a spherically symmetric star.\nOur CO5BOLD model features substantial and clumpy dust formation just above 3.4\nau from the grid centre, and large-scale structures due to giant convection\ncells are visible on the stellar surface. With the properties of VLTI as a\nbasis, we have created simple synthetic observables. Such optical\ninterferometers should be able to detect these dust clouds. We find that it is\nimportant to include asymmetric stellar models since they even affect the SEDs.\nEffects on flux levels can be linked to the clumpiness of the circumstellar\ndust and the angle-dependent illumination resulting from temperature variations\non the stellar surface causes shifts in the wavelengths of the flux maximum.\nThe methods presented here are an important step towards producing realistic\nsynthetic observables and testing predictions of advanced 3D RHD models. Taking\nthe angle-dependence of SEDs as a proxy for temporal variations in unresolved\ndata, we conclude that not all variability observed in AGB stars should be\ninterpreted as global changes in the sense of spherical models.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}