{"id":"2407.03727","title":"Direct prediction of saturated neoclassical tearing modes in slab using\n  an equilibrium approach","authors":"Erol Balkovic, Joaquim Loizu, Jonathan P. Graves, Yi-Min Huang,\n  Christopher B. Smiet","authorsParsed":[["Balkovic","Erol",""],["Loizu","Joaquim",""],["Graves","Jonathan P.",""],["Huang","Yi-Min",""],["Smiet","Christopher B.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 08:21:04 GMT"}],"updateDate":"2024-07-08","timestamp":1720081264000,"abstract":"  We demonstrate for the first time that the nonlinear saturation of\nneoclassical tearing modes (NTMs) can be found directly using a variational\nprinciple based on Taylor relaxation, without needing to simulate the\nintermediate, resistivity-dependent dynamics. As in previous investigations of\nclassical tearing mode saturation (Loizu et al. 2020; Loizu & Bonfiglio 2023),\nwe make use of SPEC (Hudson et al. 2012), an equilibrium solver based on the\nvariational principle of the Multi-Region relaxed MHD, featuring stepped\npressure profiles and arbitrary magnetic topology. We work in slab geometry and\nemploy a simple bootstrap current model $J_\\textrm{bs} = C \\nabla p$ to study\nthe bootstrap-driven tearing modes, scanning over the asymptotic matching\nparameter $\\Delta'$ and the bootstrap current strength. Saturated island widths\nproduced by SPEC agree well with the predictions of an initial value resistive\nMHD code (Huang & Bhattacharjee 2016) while being orders of magnitude faster to\ncalculate. Additionally, we observe good agreement with a simple analytical\nModified Rutherford Equation, without requiring any fitting coefficients. The\nmatch is obtained for both linearly unstable classical tearing modes in the\npresence of bootstrap current, and neoclassical tearing modes, which are\nlinearly stable but nonlinear-unstable due to the effects of the bootstrap\ncurrent\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}