{"id":"2407.16021","title":"Pavement Fatigue Crack Detection and Severity Classification Based on\n  Convolutional Neural Network","authors":"Zhen Wang and Dylan G. Ildefonzo and Linbing Wang","authorsParsed":[["Wang","Zhen",""],["Ildefonzo","Dylan G.",""],["Wang","Linbing",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 19:56:03 GMT"}],"updateDate":"2024-07-24","timestamp":1721678163000,"abstract":"  Due to the varying intensity of pavement cracks, the complexity of\ntopological structure, and the noise of texture background, image\nclassification for asphalt pavement cracking has proven to be a challenging\nproblem. Fatigue cracking, also known as alligator cracking, is one of the\ncommon distresses of asphalt pavement. It is thus important to detect and\nmonitor the condition of alligator cracking on roadway pavements. Most research\nin this area has typically focused on pixel-level detection of cracking using\nlimited datasets. A novel deep convolutional neural network that can achieve\ntwo objectives is proposed. The first objective of the proposed neural network\nis to classify presence of fatigue cracking based on pavement surface images.\nThe second objective is to classify the fatigue cracking severity level based\non the Distress Identification Manual (DIM) standard. In this paper, a databank\nof 4484 high-resolution pavement surface images is established in which images\nare taken locally in the Town of Blacksburg, Virginia, USA. In the data\npre-preparation, over 4000 images are labeled into 4 categories manually\naccording to DIM standards. A four-layer convolutional neural network model is\nthen built to achieve the goal of classification of images by pavement crack\nseverity category. The trained model reached the highest accuracy among all\nexisting methods. After only 30 epochs of training, the model achieved a crack\nexistence classification accuracy of 96.23% and a severity level classification\naccuracy of 96.74%. After 20 epochs of training, the model achieved a pavement\nmarking presence classification accuracy of 97.64%.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}