{"id":"2407.01142","title":"Integrated feature analysis for deep learning interpretation and class\n  activation maps","authors":"Yanli Li, Tahereh Hassanzadeh, Denis P. Shamonin, Monique Reijnierse,\n  Annette H.M. van der Helm-van Mil and Berend C. Stoel","authorsParsed":[["Li","Yanli",""],["Hassanzadeh","Tahereh",""],["Shamonin","Denis P.",""],["Reijnierse","Monique",""],["Mil","Annette H. M. van der Helm-van",""],["Stoel","Berend C.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 10:10:57 GMT"}],"updateDate":"2024-07-02","timestamp":1719828657000,"abstract":"  Understanding the decisions of deep learning (DL) models is essential for the\nacceptance of DL to risk-sensitive applications. Although methods, like class\nactivation maps (CAMs), give a glimpse into the black box, they do miss some\ncrucial information, thereby limiting its interpretability and merely providing\nthe considered locations of objects. To provide more insight into the models\nand the influence of datasets, we propose an integrated feature analysis\nmethod, which consists of feature distribution analysis and feature\ndecomposition, to look closer into the intermediate features extracted by DL\nmodels. This integrated feature analysis could provide information on\noverfitting, confounders, outliers in datasets, model redundancies and\nprincipal features extracted by the models, and provide distribution\ninformation to form a common intensity scale, which are missing in current CAM\nalgorithms. The integrated feature analysis was applied to eight different\ndatasets for general validation: photographs of handwritten digits, two\ndatasets of natural images and five medical datasets, including skin\nphotography, ultrasound, CT, X-rays and MRIs. The method was evaluated by\ncalculating the consistency between the CAMs average class activation levels\nand the logits of the model. Based on the eight datasets, the correlation\ncoefficients through our method were all very close to 100%, and based on the\nfeature decomposition, 5%-25% of features could generate equally informative\nsaliency maps and obtain the same model performances as using all features.\nThis proves the reliability of the integrated feature analysis. As the proposed\nmethods rely on very few assumptions, this is a step towards better model\ninterpretation and a useful extension to existing CAM algorithms. Codes:\nhttps://github.com/YanliLi27/IFA\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}