{"id":"2407.12806","title":"Advanced Mathematical Modelling for Energy-Efficient Data Transmission\n  and Fusion in Wireless Sensor Networks","authors":"Komal","authorsParsed":[["Komal","",""]],"versions":[{"version":"v1","created":"Tue, 25 Jun 2024 11:56:43 GMT"}],"updateDate":"2024-07-19","timestamp":1719316603000,"abstract":"  Wireless Sensor Networks (WSNs) are indispensable for data-intensive\napplications, necessitating efficient energy management and robust data fusion\ntechniques. This paper proposes an integrated framework leveraging fuzzy logic\nand backpropagation neural networks (BPNN) to enhance energy efficiency and\ndata accuracy in WSNs. The model focuses on optimizing Cluster Head (CH)\nselection using fuzzy logic, considering parameters such as energy levels,\nproximity to the base station, and local density centrality. A Minimum Spanning\nTree (MST) algorithm is employed for energy-efficient data transmission from\nsensor nodes to CHs, minimizing energy consumption during data routing.\nBPNN-based data fusion at CHs reduces redundant data transmissions to the base\nstation, thereby optimizing energy utilization and enhancing overall network\nperformance. Simulation results demonstrate substantial improvements over\nconventional methods, including a 30% increase in network longevity, 25%\nimprovement in data accuracy, and a 40% reduction in energy consumption. These\ngains are attributed to the intelligent CH selection strategy enabled by fuzzy\nlogic, which ensures efficient resource allocation and minimizes energy\nwastage. The effectiveness of the proposed approach is validated through\ncomprehensive simulations, showcasing its ability to prolong network lifetime,\nmaintain data integrity, and improve energy efficiency. The integration of\nfuzzy logic and BPNN not only addresses the challenges of energy management and\ndata fusion in WSNs but also provides a scalable and adaptable framework for\nfuture applications requiring reliable and sustainable sensor network\noperations. The source code is available at\nhttps://github.com/hikomal/BPNN_WSN.git\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}