{"id":"2407.07633","title":"Few-Shot Domain Adaptive Object Detection for Microscopic Images","authors":"Sumayya Inayat, Nimra Dilawar, Waqas Sultani, Mohsen Ali","authorsParsed":[["Inayat","Sumayya",""],["Dilawar","Nimra",""],["Sultani","Waqas",""],["Ali","Mohsen",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 13:11:58 GMT"}],"updateDate":"2024-07-11","timestamp":1720617118000,"abstract":"  In recent years, numerous domain adaptive strategies have been proposed to\nhelp deep learning models overcome the challenges posed by domain shift.\nHowever, even unsupervised domain adaptive strategies still require a large\namount of target data. Medical imaging datasets are often characterized by\nclass imbalance and scarcity of labeled and unlabeled data. Few-shot domain\nadaptive object detection (FSDAOD) addresses the challenge of adapting object\ndetectors to target domains with limited labeled data. Existing works struggle\nwith randomly selected target domain images that may not accurately represent\nthe real population, resulting in overfitting to small validation sets and poor\ngeneralization to larger test sets. Medical datasets exhibit high class\nimbalance and background similarity, leading to increased false positives and\nlower mean Average Precision (map) in target domains. To overcome these\nchallenges, we propose a novel FSDAOD strategy for microscopic imaging. Our\ncontributions include a domain adaptive class balancing strategy for few-shot\nscenarios, multi-layer instance-level inter and intra-domain alignment to\nenhance similarity between class instances regardless of domain, and an\ninstance-level classification loss applied in the middle layers of the object\ndetector to enforce feature retention necessary for correct classification\nacross domains. Extensive experimental results with competitive baselines\ndemonstrate the effectiveness of our approach, achieving state-of-the-art\nresults on two public microscopic datasets. Code available at\nhttps://github.co/intelligentMachinesLab/few-shot-domain-adaptive-microscopy\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"zXNc_iWikKeZrgTxmO94DA4n4rLGFjogVJxmgjj0ZmA","pdfSize":"9366346"}
