{"id":"2407.17903","title":"The operationally ready full three-dimensional magnetohydrodynamic (3D\n  MHD) model from the Sun to Earth: COCONUT+Icarus","authors":"Tinatin Baratashvili, Michaela Brchnelova, Luis Linan, Andrea Lani,\n  Stefaan Poedts","authorsParsed":[["Baratashvili","Tinatin",""],["Brchnelova","Michaela",""],["Linan","Luis",""],["Lani","Andrea",""],["Poedts","Stefaan",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 09:47:56 GMT"}],"updateDate":"2024-07-26","timestamp":1721900876000,"abstract":"  Solar wind modelling has become a crucial area of study due to the increased\ndependence of modern society on technology, navigation, and power systems.\nAccurate space weather forecasts can predict upcoming threats to Earth's\ngeospace. In this study, we examine a novel full magnetohydrodynamic (MHD)\nchain from the Sun to Earth. The goal of this study is to demonstrate the\ncapabilities of the full MHD modelling chain from the Sun to Earth by\nfinalising the implementation of the full MHD coronal model into the COolfluid\nCOroNa UnsTructured (COCONUT) model and coupling it to the MHD heliospheric\nmodel Icarus. The resulting coronal model has significant advantages compared\nto the pre-existing polytropic alternative, as it models a more realistic\nbi-modal wind, which is crucial for heliospheric studies.\n  In this study, only thermal conduction, radiative losses, and approximated\ncoronal heating function were considered in the energy equation. A realistic\nspecific heat ratio was applied. The output of the coronal model was used to\nonset the 3D MHD heliospheric model Icarus. A minimum solar activity case was\nchosen as the first test case for the full MHD model. The numerically simulated\ndata in the corona and the heliosphere were compared to observational products.\nWe present a first attempt to obtain the full MHD chain from the Sun to Earth\nwith COCONUT and Icarus. The coronal model has been upgraded to a full MHD\nmodel for a realistic bi-modal solar wind configuration. The approximated\nheating functions have modelled the wind reasonably well, but simple\napproximations are not enough to obtain a realistic density-speed balance or\nrealistic features in the low corona and farther, near the outer boundary. The\nfull MHD model was computed in 1.06 h on 180 cores of the Genius cluster of the\nVlaams Supercomputing Center, which is only 1.8 times longer than the\npolytropic simulation.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Physics/Space Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}