{"id":"2407.19006","title":"Observations of phosphorus-bearing molecules in the interstellar medium","authors":"Francesco Fontani (1 and 2 and 3) ((1) INAF-Osservatorio Astrofisico\n  di Arcetri, Italy, (2) Max-Planck Institute for Extraterrestrial Physics\n  (MPE), Germany, (3) LERMA, Observatoire de Paris, France)","authorsParsed":[["Fontani","Francesco","","1 and 2 and 3"]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:00:02 GMT"}],"updateDate":"2024-07-30","timestamp":1722016802000,"abstract":"  The chemistry of phosphorus (31P) in space is particularly significant due to\nthe key role it plays in biochemistry on Earth. Utilising radio and infrared\nspectroscopic observations, several key phosphorus-containing molecules have\nbeen detected in interstellar clouds, circumstellar shells, and even\nextragalactic sources. Among these, phosphorus nitride (PN) was the first\nP-bearing molecule detected in space, and still is the species detected in the\nlargest number of sources. Phosphorus oxide (PO) and phosphine (PH3) were also\ncrucial species due to their role both in chemical networks and in forming\nbiogenic compounds. The still limited high-angular resolution observations\nperformed so far are shading light on the geometrical distribution of these\nmolecules, which represent crucial insights on their formation processes.\nObservations have also highlighted the challenges and complexities associated\nwith detecting and understanding phosphorus chemistry in space, owing to the\nlow elemental abundance of P relative to other elements. This review article\nprovides a state-of-art picture of the observational results obtained so far on\nphosphorus compounds in the interstellar medium. Special attention is given to\nstar-forming regions, and to their implications for our understanding of\nprebiotic chemistry and the potential for life beyond Earth. Our knowledge of\nthe dominant formation and destruction pathways of the most abundant species\nhas improved, but critical questions remain open, among which: what is (are)\nthe main phosphorus carrier(s) in space? Upcoming facilities will offer new\nopportunities to both detect new phosphorus-bearing molecules and enlarge the\nnumber of sources in which the chemistry of P can be studied. The synergy\nbetween observations, models, laboratory experiments, and computational works\nis mandatory to progress in this field.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}