{"id":"2407.08069","title":"Herding Unmasked: Insights into Cryptocurrencies, Stocks and US ETFs","authors":"An Pham Ngoc Nguyen, Thomas Conlon, Martin Crane, Marija Bezbradica","authorsParsed":[["Nguyen","An Pham Ngoc",""],["Conlon","Thomas",""],["Crane","Martin",""],["Bezbradica","Marija",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 22:09:20 GMT"}],"updateDate":"2024-07-12","timestamp":1720649360000,"abstract":"  Herding behavior has become a familiar phenomenon to investors, carrying the\npotential danger of both undervaluing and overvaluing assets, while also\nthreatening market stability. This study contributes to the literature on\nherding behavior by using a more recent dataset to cover the most impactful\nevents of recent years. To our knowledge, this is the first study examining\nherding behavior across three different types of investment vehicle.\nFurthermore, this is also the first study observing herding at a community\n(subset) level. Specifically, we first explore this phenomenon in each separate\ntype of investment vehicle, namely stocks, US ETFs and cryptocurrencies, using\nthe widely recognized Cross Sectional Absolute Deviation (CSAD) model. We find\nsimilar herding patterns between stocks and US ETFs, while these traditional\nassets reveal a distinction from cryptocurrencies. Subsequently, the same\nexperiment is implemented on a combination of all three investment vehicle\ntypes. For a deeper investigation, we adopt graph-based techniques such as\nMinimum Spanning Tree (MST) and Louvain community detection to partition the\ngiven combination into smaller subsets whose assets are most similar to each\nother, then seek to detect the herding behavior on each subset. We find that\nherding behavior exists at all times across all types of investment vehicle at\na subset level, although the herding might not manifest at the superset level.\nAdditionally, this herding behavior tends to stem from specific events that\nsolely impact that subset of assets. Given these findings, investors can\nconstruct an appropriate investment strategy composed of their choice of\ninvestment vehicles they are interested in.\n","subjects":["Quantitative Finance/Mathematical Finance","Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QJowy-RrtxslIe6nGqZa8lqMnqUfbNvPZeDsS5Q1Jts","pdfSize":"4734643"}
