{"id":"2407.08185","title":"Automatic Generation of Web Censorship Probe Lists","authors":"Jenny Tang, Leo Alvarez, Arjun Brar, Nguyen Phong Hoang, Nicolas\n  Christin","authorsParsed":[["Tang","Jenny",""],["Alvarez","Leo",""],["Brar","Arjun",""],["Hoang","Nguyen Phong",""],["Christin","Nicolas",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 05:04:52 GMT"}],"updateDate":"2024-07-12","timestamp":1720674292000,"abstract":"  Domain probe lists--used to determine which URLs to probe for Web\ncensorship--play a critical role in Internet censorship measurement studies.\nIndeed, the size and accuracy of the domain probe list limits the set of\ncensored pages that can be detected; inaccurate lists can lead to an incomplete\nview of the censorship landscape or biased results. Previous efforts to\ngenerate domain probe lists have been mostly manual or crowdsourced. This\napproach is time-consuming, prone to errors, and does not scale well to the\never-changing censorship landscape.\n  In this paper, we explore methods for automatically generating probe lists\nthat are both comprehensive and up-to-date for Web censorship measurement. We\nstart from an initial set of 139,957 unique URLs from various existing test\nlists consisting of pages from a variety of languages to generate new candidate\npages. By analyzing content from these URLs (i.e., performing topic and keyword\nextraction), expanding these topics, and using them as a feed to search\nengines, our method produces 119,255 new URLs across 35,147 domains. We then\ntest the new candidate pages by attempting to access each URL from servers in\neleven different global locations over a span of four months to check for their\nconnectivity and potential signs of censorship. Our measurements reveal that\nour method discovered over 1,400 domains--not present in the original\ndataset--we suspect to be blocked. In short, automatically updating probe lists\nis possible, and can help further automate censorship measurements at scale.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Computation and Language","Computing Research Repository/Computers and Society","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"O0jY2cI_bTCB5G5p0OxpQwI1sHWbEjsj4LK98ulGhn8","pdfSize":"736184","objectId":"0xf52540cc74942e1e175c73ef3482246ac658e94be341870e5e70db09288ca5a7","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
