{"id":"2407.11196","title":"Stationary CT Imaging of Intracranial Hemorrhage with Diffusion\n  Posterior Sampling Reconstruction","authors":"Alejandro Lopez-Montes, Thomas McSkimming, Anthony Skeats, Chris\n  Delnooz, Brian Gonzales, Wojciech Zbijewski, and Alejandro Sisniega","authorsParsed":[["Lopez-Montes","Alejandro",""],["McSkimming","Thomas",""],["Skeats","Anthony",""],["Delnooz","Chris",""],["Gonzales","Brian",""],["Zbijewski","Wojciech",""],["Sisniega","Alejandro",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 19:30:26 GMT"}],"updateDate":"2024-07-17","timestamp":1721071826000,"abstract":"  Diffusion Posterior Sampling (DPS) can be used in Computed Tomography (CT)\nreconstruction by leveraging diffusion-based generative models for\nunconditional image synthesis while matching the observations (data) of a CT\nscan. Of particular interest is its application in scenarios involving sparse\nor limited angular sampling, where conventional reconstruction algorithms are\noften insufficient. We developed a DPS algorithm for 3D reconstruction from a\nstationary CT (sCT) portable brain stroke imaging unit based on a multi-x-ray\nsource array (MXA) of 31 x-ray tubes and a curved area detector. In this\nconfiguration, conventional reconstruction e.g., Penalized Weighted Least\nSquares (PWLS) with a Huber edge-preserving penalty, suffers from severe\ndirectional undersampling artifacts. The proposed DPS integrates a\ntwo-dimensional diffusion model, acting on image slices, coupled to sCT data\nconsistency and volumetric regularization terms to enable 3D reconstruction\nrobust to noise and incomplete sampling. To reduce the computational burden of\nDPS, stochastic contraction with PWLS initialization was used to decrease the\nnumber of diffusion steps. The validation studies involved simulations of\nanthropomorphic brain phantoms with synthetic bleeds and experimental data from\nan sCT bench. In simulations, DPS achieved ~130% reduction of directional\nartifacts compared to PWLS and 30% better recovery of lesion shape (DICE\ncoefficient). Benchtop studies demonstrated enhanced visualization of brain\nfeatures in a Kyoto Kagaku head phantom. The proposed DPS achieved improved\nvisualization of intracranial hemorrhage and brain morphology compared to\nconventional model-based reconstruction for the highly undersampled sCT system.\n","subjects":["Physics/Medical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}