{"id":"2407.14779","title":"Do Generative AI Models Output Harm while Representing Non-Western\n  Cultures: Evidence from A Community-Centered Approach","authors":"Sourojit Ghosh, Pranav Narayanan Venkit, Sanjana Gautam, Shomir\n  Wilson, Aylin Caliskan","authorsParsed":[["Ghosh","Sourojit",""],["Venkit","Pranav Narayanan",""],["Gautam","Sanjana",""],["Wilson","Shomir",""],["Caliskan","Aylin",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 07:01:37 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 17:25:26 GMT"},{"version":"v3","created":"Sat, 3 Aug 2024 21:49:57 GMT"}],"updateDate":"2024-08-06","timestamp":1721458897000,"abstract":"  Our research investigates the impact of Generative Artificial Intelligence\n(GAI) models, specifically text-to-image generators (T2Is), on the\nrepresentation of non-Western cultures, with a focus on Indian contexts.\nDespite the transformative potential of T2Is in content creation, concerns have\narisen regarding biases that may lead to misrepresentations and\nmarginalizations. Through a community-centered approach and grounded theory\nanalysis of 5 focus groups from diverse Indian subcultures, we explore how T2I\noutputs to English prompts depict Indian culture and its subcultures,\nuncovering novel representational harms such as exoticism and cultural\nmisappropriation. These findings highlight the urgent need for inclusive and\nculturally sensitive T2I systems. We propose design guidelines informed by a\nsociotechnical perspective, aiming to address these issues and contribute to\nthe development of more equitable and representative GAI technologies globally.\nOur work also underscores the necessity of adopting a community-centered\napproach to comprehend the sociotechnical dynamics of these models,\ncomplementing existing work in this space while identifying and addressing the\npotential negative repercussions and harms that may arise when these models are\ndeployed on a global scale.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}