{"id":"2407.16746","title":"Exo-NINJA at Subaru: fiber-fed spectro-imaging of exoplanets and\n  circumstellar disks at R$\\sim$4000","authors":"Mona El Morsy, Julien Lozi, Olivier Guyon, Thayne Currie, S\\'ebastien\n  Vievard, Julia Bryant, Chihiro Tokoku, Vincent Deo, Kyohoon Ahn, Fred Crous,\n  Adeline Haobing Wang, Zinat Mahol Sathi","authorsParsed":[["Morsy","Mona El",""],["Lozi","Julien",""],["Guyon","Olivier",""],["Currie","Thayne",""],["Vievard","Sébastien",""],["Bryant","Julia",""],["Tokoku","Chihiro",""],["Deo","Vincent",""],["Ahn","Kyohoon",""],["Crous","Fred",""],["Wang","Adeline Haobing",""],["Sathi","Zinat Mahol",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-25","timestamp":1721757600000,"abstract":"  Exo-NINJA will realize nearIR R$\\sim$4000 diffraction-limited narrow-field\nspectro-imaging for characterization of exoplanets and circumstellar disk\nstructures. It uniquely combines mid-R spectroscopy, high throughput, and\nspatial resolution, in contrast to CHARIS, which does spectro-imaging, and\nREACH, which is single-point (no spatial resolution). Exo-NINJA's\nspectro-imaging at the telescope diffraction limit will characterize exoplanet\natmospheres, detect and map (spatially and spectrally) gas accretion on\nprotoplanets, and also detect exoplanets at small angular separation\n($\\lambda$/D) from their host star by spectro-astrometry. Exo-NINJA will link\ntwo instruments at the Subaru Telescope using a high-throughput hexagonal\nmulti-mode fiber bundle (hexabundle). The fiber coupling resides between the\nhigh contrast imaging system SCExAO, which combines ExAO and coronagraph, and\nthe medium-resolution spectrograph NINJA (R$=$4000 at JHK bands). Exo-NINJA\nwill provide an end-to-end throughput of 20% compared to the 1.5% obtained with\nREACH. Exo-NINJA is scheduled for implementation on the Subaru Telescope's\nNasIR platform in 2025; we will present a concise overview of its future\ninstallation, laboratory tests such as the throughput and focal ratio\ndegradation (FRD) performance of optical fiber imaging hexabundles, in the NIR\nand the trade-offs for fiber choices for the NINJA-SCExAO hexabundle fiber\ncable, and the expected on sky performance.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}