{"id":"2407.13714","title":"Mapping Inter-City Trade Networks to Maximum Entropy Models using\n  Electronic Invoice Data","authors":"Cesar I. N. Sampaio Filho, Rilder S. Pires, Humberto A. Carmona,\n  Jos\\'e S. Andrade Jr","authorsParsed":[["Filho","Cesar I. N. Sampaio",""],["Pires","Rilder S.",""],["Carmona","Humberto A.",""],["Andrade","José S.","Jr"]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:10:59 GMT"}],"updateDate":"2024-07-19","timestamp":1721322659000,"abstract":"  We analyze the network of transactions among cities based on the electronic\ninvoice database for the municipalities in the Cear\\'a state, Brazil. It\nconsists of approximately 3.7 billion records, registered during the period\nbetween the years 2016 to 2019. All the transactions are grouped in a unique\ndataset and represented as an asymmetrical adjacency matrix corresponding to a\ndirected graph with connections weighted by the number of transactions among\ncities. Due to the large size of Cear\\'a state, its unequal distribution of\nwealth, and spatially heterogeneous population, we initially determine\ncommunities of cities based on their mutual intensity of trades and verify to\nwhich extent their economic interests reflect a community cohesiveness. For the\nfirst task, we use the Infomap algorithm to detect the partition which provides\nthe shortest description length and captures the optimal community structure of\nthe network in terms of its associated flow dynamics. Surprisingly, the\npartition identified has five modules, whose two-dimensional geographical\nprojections are all simply-connected domains. We proceed with the analysis of\ntraded products by building bipartite structures represented in terms of\nadjacency matrices between municipalities and products, considering selling and\nbuying. Using the revealed comparative advantage (RCA) concept, we define a\nnon-monetary and binary activity index that can distinguish the RCA of a city\nin a class of goods or services as evidenced by trade flows. Finally, through\nthe pairwise Maximum Entropy Model, we can associate to the largest communities\ntheir corresponding binary Ising-like Hamiltonian models. In an analogy with\ncritical phenomena, our results reveal that each community operates at a\n\"temperature\" that is close to the corresponding \"critical point\", suggesting a\nhigh degree of \"economic cohesiveness\" in its trade network of cities.\n","subjects":["Physics/Physics and Society","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/"}