{"id":"2407.19216","title":"EaTVul: ChatGPT-based Evasion Attack Against Software Vulnerability\n  Detection","authors":"Shigang Liu, Di Cao, Junae Kim, Tamas Abraham, Paul Montague, Seyit\n  Camtepe, Jun Zhang, and Yang Xiang","authorsParsed":[["Liu","Shigang",""],["Cao","Di",""],["Kim","Junae",""],["Abraham","Tamas",""],["Montague","Paul",""],["Camtepe","Seyit",""],["Zhang","Jun",""],["Xiang","Yang",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 09:04:54 GMT"}],"updateDate":"2024-07-30","timestamp":1722071094000,"abstract":"  Recently, deep learning has demonstrated promising results in enhancing the\naccuracy of vulnerability detection and identifying vulnerabilities in\nsoftware. However, these techniques are still vulnerable to attacks.\nAdversarial examples can exploit vulnerabilities within deep neural networks,\nposing a significant threat to system security. This study showcases the\nsusceptibility of deep learning models to adversarial attacks, which can\nachieve 100% attack success rate (refer to Table 5). The proposed method,\nEaTVul, encompasses six stages: identification of important samples using\nsupport vector machines, identification of important features using the\nattention mechanism, generation of adversarial data based on these features\nusing ChatGPT, preparation of an adversarial attack pool, selection of seed\ndata using a fuzzy genetic algorithm, and the execution of an evasion attack.\nExtensive experiments demonstrate the effectiveness of EaTVul, achieving an\nattack success rate of more than 83% when the snippet size is greater than 2.\nFurthermore, in most cases with a snippet size of 4, EaTVul achieves a 100%\nattack success rate. The findings of this research emphasize the necessity of\nrobust defenses against adversarial attacks in software vulnerability\ndetection.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}