{"id":"2407.02527","title":"Crystal-field effects in the formation of Wigner-molecule supercrystals\n  in moir\\'e TMD superlattices","authors":"Constantine Yannouleas, Uzi Landman","authorsParsed":[["Yannouleas","Constantine",""],["Landman","Uzi",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 04:35:42 GMT"}],"updateDate":"2024-07-04","timestamp":1719722142000,"abstract":"  For moir\\'e bilayer TMD superlattices, full-configuration-interaction (FCI)\ncalculations are presented that take into account both the\nintra-moir\\'e-quantum-dot (MQD) charge-carrier Coulombic interactions, as well\nas the crystal-field effect from the surrounding moir\\'e pockets\n(inter-moir\\'e-QD interactions). Such FCI calculations enable an effective\ncomputational embedding strategy and allow for a complete interpretation of the\ncounterintuitive experimental observations reported recently in the context of\nmoir\\'e TMD superlattices at integer fillings $\\nu=2$ and 4. Two novel states\nof matter are reported: (i) a genuinely quantum-mechanical supercrystal of {\\it\nsliding\\/} Wigner molecules (WMs) for unstrained moir\\'e TMD materials (when\nthe crystal field is commensurate with the trilobal symmetry of the confining\npotential in each embedded MQD) and (ii) a supercrystal of {\\it pinned\\/}\nWigner molecules when strain is involved and the crystal field is\nincommensurate with the trilobal symmetry of the confining potential in each\nembedded MQD. The case of $\\nu=3$ is an exception, in that both unstrained and\nstrained cases produce a supercrystal of pinned WMs, which is due to the\ncongruence of intrinsic (that of the WM) and external (that of the confining\npotential of the MQD) $C_3$ point-group symmetries. Furthermore, it is shown\nthat the unrestricted Hartree-Fock approach fails to describe the supercrystal\nof sliding WMs in the unstrained case, providing a qualitative agreement only\nin the case of a supercrystal of pinned WMs\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}