{"id":"2407.12301","title":"The defect energy formalism for CALPHAD thermodynamics of dilute point\n  defects: Theory","authors":"Amir M. Orvati Movaffagh and Adetoye Adekoya and Sara Kadkhodaei","authorsParsed":[["Movaffagh","Amir M. Orvati",""],["Adekoya","Adetoye",""],["Kadkhodaei","Sara",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 03:48:23 GMT"}],"updateDate":"2024-07-18","timestamp":1721188103000,"abstract":"  The thermodynamics of point defects is crucial for determining the functional\nproperties of materials. Defect stability is typically assessed using\ngrand-canonical defect formation energy, which requires deducing the\nequilibrium chemical potential or Fermi level. This process is complicated by\nthe interplay of chemical potential and Fermi level and their dependence on\ncomposition and temperature. The grand-canonical formation energy is added to\nthe bulk Gibbs energy, creating a defect-centric framework where each new\ndefect state needs a distinct Gibbs energy formulation. The CALPHAD method\noffers a more flexible alternative by integrating defect energies into the\ntotal Gibbs energy model, allowing easier extrapolation to complex\ncompositions. CALPHAD unifies the analysis of chemically and electronically\ndriven defects using chemical composition as the primary variable. However, the\nCompound Energy Formalism (CEF) used in CALPHAD has limitations, such as a lack\nof clear connections between defect formation energies and Gibbs energy\nparameters and an exponential increase in complexity with added chemical or\ncharge variations. We present the theoretical derivation of the Defect Energy\nFormalism (DEF), which overcomes CEF limitations by establishing explicit\nrelationships between absolute defect energies - independent of chemical\npotential and Fermi level - and the Gibbs energy parameters of defective\ncompounds. This results in a first-principles model for dilute defects,\neliminating the need for model fitting to experimental or simulation data. DEF\nreduces the complexity of CEF by applying the superposition of absolute defect\nenergies, making it feasible for modeling multi-component and chemically\ncomplex compounds. This paper presents a formal derivation of DEF and offers\nguidelines for its application, promising more accurate and efficient\nthermodynamic modeling of defective materials.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}