{"id":"2407.17490","title":"AMEX: Android Multi-annotation Expo Dataset for Mobile GUI Agents","authors":"Yuxiang Chai, Siyuan Huang, Yazhe Niu, Han Xiao, Liang Liu, Dingyu\n  Zhang, Peng Gao, Shuai Ren, Hongsheng Li","authorsParsed":[["Chai","Yuxiang",""],["Huang","Siyuan",""],["Niu","Yazhe",""],["Xiao","Han",""],["Liu","Liang",""],["Zhang","Dingyu",""],["Gao","Peng",""],["Ren","Shuai",""],["Li","Hongsheng",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 17:59:58 GMT"}],"updateDate":"2024-07-26","timestamp":1720029598000,"abstract":"  AI agents have drawn increasing attention mostly on their ability to perceive\nenvironments, understand tasks, and autonomously achieve goals. To advance\nresearch on AI agents in mobile scenarios, we introduce the Android\nMulti-annotation EXpo (AMEX), a comprehensive, large-scale dataset designed for\ngeneralist mobile GUI-control agents. Their capabilities of completing complex\ntasks by directly interacting with the graphical user interface (GUI) on mobile\ndevices are trained and evaluated with the proposed dataset. AMEX comprises\nover 104K high-resolution screenshots from 110 popular mobile applications,\nwhich are annotated at multiple levels. Unlike existing mobile device-control\ndatasets, e.g., MoTIF, AitW, etc., AMEX includes three levels of annotations:\nGUI interactive element grounding, GUI screen and element functionality\ndescriptions, and complex natural language instructions, each averaging 13\nsteps with stepwise GUI-action chains. We develop this dataset from a more\ninstructive and detailed perspective, complementing the general settings of\nexisting datasets. Additionally, we develop a baseline model SPHINX Agent and\ncompare its performance across state-of-the-art agents trained on other\ndatasets. To facilitate further research, we open-source our dataset, models,\nand relevant evaluation tools. The project is available at\nhttps://yuxiangchai.github.io/AMEX/\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Rku2KrzwM7fKt-MGw3p0pzExsXmRFMbnlG8j_MzQ6y0","pdfSize":"15861878"}
