{"id":"2407.10961","title":"Galaxy cluster matter profiles: I. Self-similarity and mass calibration","authors":"A. Singh, J. J. Mohr, C. T. Davies, S. Bocquet, S. Grandis, M. Klein,\n  J. L. Marshall, M. Aguena, S. S. Allam, O. Alves, F. Andrade-Oliveira, D.\n  Bacon, S. Bhargava, D. Brooks, A. Carnero Rosell, J. Carretero, M. Costanzi,\n  L. N. da Costa, M. E. S. Pereira, S. Desai, H. T. Diehl, P. Doel, S. Everett,\n  B. Flaugher, J. Frieman, J. Garc\\'ia-Bellido, E. Gaztanaga, R. A. Gruendl, G.\n  Gutierrez, D. L. Hollowood, K. Honscheid, D. J. James, K. Kuehn, M. Lima, J.\n  Mena-Fern\\'andez, F. Menanteau, R. Miquel, J. Myles, A. Pieres, A. K. Romer,\n  S. Samuroff, E. Sanchez, D. Sanchez Cid, I. Sevilla-Noarbe, M. Smith, E.\n  Suchyta, M. E. C. Swanson, G. Tarle, C. To, D. L. Tucker, V. Vikram, N.\n  Weaverdyck and P. Wiseman","authorsParsed":[["Singh","A.",""],["Mohr","J. J.",""],["Davies","C. T.",""],["Bocquet","S.",""],["Grandis","S.",""],["Klein","M.",""],["Marshall","J. L.",""],["Aguena","M.",""],["Allam","S. S.",""],["Alves","O.",""],["Andrade-Oliveira","F.",""],["Bacon","D.",""],["Bhargava","S.",""],["Brooks","D.",""],["Rosell","A. Carnero",""],["Carretero","J.",""],["Costanzi","M.",""],["da Costa","L. N.",""],["Pereira","M. E. S.",""],["Desai","S.",""],["Diehl","H. T.",""],["Doel","P.",""],["Everett","S.",""],["Flaugher","B.",""],["Frieman","J.",""],["García-Bellido","J.",""],["Gaztanaga","E.",""],["Gruendl","R. A.",""],["Gutierrez","G.",""],["Hollowood","D. L.",""],["Honscheid","K.",""],["James","D. J.",""],["Kuehn","K.",""],["Lima","M.",""],["Mena-Fernández","J.",""],["Menanteau","F.",""],["Miquel","R.",""],["Myles","J.",""],["Pieres","A.",""],["Romer","A. K.",""],["Samuroff","S.",""],["Sanchez","E.",""],["Cid","D. Sanchez",""],["Sevilla-Noarbe","I.",""],["Smith","M.",""],["Suchyta","E.",""],["Swanson","M. E. C.",""],["Tarle","G.",""],["To","C.",""],["Tucker","D. L.",""],["Vikram","V.",""],["Weaverdyck","N.",""],["Wiseman","P.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:57:02 GMT"}],"updateDate":"2024-07-16","timestamp":1721066222000,"abstract":"  We present a study of the weak lensing matter profiles of 698 South Pole\nTelescope (SPT) thermal Sunyaev-Zel'dovich effect (tSZE) selected galaxy\nclusters in the redshift range $0.25 <z< 0.94$ that have associated weak\ngravitational lensing shear profiles from the Dark Energy Survey (DES). When\nrescaled to account for the mass dependent size and the redshift dependent\ndensity, this SPT cluster sample when averaged within bins of redshift and tSZE\ndetection significance shows a lower dispersion in the matter profiles than the\nunscaled versions. Galaxy clusters from hydrodynamical simulations also exhibit\nmatter profiles that suggest a high degree of self-similarity, with RMS\nvariation among the rescaled average matter profiles improving by a factor of\n$\\approx$6 with redshift and $\\approx$23 with mass in comparison to the\nunscaled average matter profiles. We employ this regularity in a new Bayesian\nmethod for weak lensing mass calibration, simultaneously constraining\nrichness-mass and tSZE detection significance-mass relations using average,\nrescaled cluster matter profiles. We validate the method using realistic mock\ndatasets and present scaling relation constraints for the SPT$\\times$DES\nsample, where we constrain the amplitude, mass trend, redshift trend, and\nintrinsic scatter. Our scaling relation results are in agreement with the mass\ncalibration derived from the recent cosmological analysis of the SPT$\\times$DES\ndata based on a cluster-by-cluster lensing calibration. Our new mass\ncalibration technique offers higher efficiency when compared to the single\ncluster calibration technique. In addition, the average rescaled matter\nprofiles offer high signal-to-noise constraints on the shape of real cluster\nprofiles which is in good agreement with the $\\Lambda$CDM model.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}