{"id":"2407.06423","title":"InsightBench: Evaluating Business Analytics Agents Through Multi-Step\n  Insight Generation","authors":"Gaurav Sahu, Abhay Puri, Juan Rodriguez, Alexandre Drouin, Perouz\n  Taslakian, Valentina Zantedeschi, Alexandre Lacoste, David Vazquez, Nicolas\n  Chapados, Christopher Pal, Sai Rajeswar Mudumba, Issam Hadj Laradji","authorsParsed":[["Sahu","Gaurav",""],["Puri","Abhay",""],["Rodriguez","Juan",""],["Drouin","Alexandre",""],["Taslakian","Perouz",""],["Zantedeschi","Valentina",""],["Lacoste","Alexandre",""],["Vazquez","David",""],["Chapados","Nicolas",""],["Pal","Christopher",""],["Mudumba","Sai Rajeswar",""],["Laradji","Issam Hadj",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 22:06:09 GMT"}],"updateDate":"2024-07-10","timestamp":1720476369000,"abstract":"  Data analytics is essential for extracting valuable insights from data that\ncan assist organizations in making effective decisions. We introduce\nInsightBench, a benchmark dataset with three key features. First, it consists\nof 31 datasets representing diverse business use cases such as finance and\nincident management, each accompanied by a carefully curated set of insights\nplanted in the datasets. Second, unlike existing benchmarks focusing on\nanswering single queries, InsightBench evaluates agents based on their ability\nto perform end-to-end data analytics, including formulating questions,\ninterpreting answers, and generating a summary of insights and actionable\nsteps. Third, we conducted comprehensive quality assurance to ensure that each\ndataset in the benchmark had clear goals and included relevant and meaningful\nquestions and analysis. Furthermore, we implement a two-way evaluation\nmechanism using LLaMA-3-Eval as an effective, open-source evaluator method to\nassess agents' ability to extract insights. We also propose AgentPoirot, our\nbaseline data analysis agent capable of performing end-to-end data analytics.\nOur evaluation on InsightBench shows that AgentPoirot outperforms existing\napproaches (such as Pandas Agent) that focus on resolving single queries. We\nalso compare the performance of open- and closed-source LLMs and various\nevaluation strategies. Overall, this benchmark serves as a testbed to motivate\nfurther development in comprehensive data analytics and can be accessed here:\nhttps://github.com/ServiceNow/insight-bench.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pDOg0O69marAKsXeVVk_hJxgO995L6d7O4OzcpvlDBU","pdfSize":"3849372"}
