{"id":"2407.21140","title":"Projected Entangled Pair States with flexible geometry","authors":"Siddhartha Patra, Sukhbinder Singh, Rom\\'an Or\\'us","authorsParsed":[["Patra","Siddhartha",""],["Singh","Sukhbinder",""],["Orús","Román",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 19:03:52 GMT"}],"updateDate":"2024-08-01","timestamp":1722366232000,"abstract":"  Projected Entangled Pair States (PEPS) are a class of quantum many-body\nstates that generalize Matrix Product States for one-dimensional systems to\nhigher dimensions. In recent years, PEPS have advanced understanding of\nstrongly correlated systems, especially in two dimensions, e.g., quantum spin\nliquids. Typically described by tensor networks on regular lattices (e.g.,\nsquare, cubic), PEPS have also been adapted for irregular graphs, however, the\ncomputational cost becomes prohibitive for dense graphs with large vertex\ndegrees. In this paper, we present a PEPS algorithm to simulate low-energy\nstates and dynamics defined on arbitrary, fluctuating, and densely connected\ngraphs. We introduce a cut-off, $\\kappa \\in \\mathbb{N}$, to constrain the\nvertex degree of the PEPS to a set but tunable value, which is enforced in the\noptimization by applying a simple edge-deletion rule, allowing the geometry of\nthe PEPS to change and adapt dynamically to the system's correlation structure.\nWe benchmark our flexible PEPS algorithm with simulations of classical spin\nglasses and quantum annealing on densely connected graphs with hundreds of\nspins, and also study the impact of tuning $\\kappa$ when simulating a uniform\nquantum spin model on a regular (square) lattice. Our work opens the way to\napply tensor network algorithms to arbitrary, even fluctuating, background\ngeometries.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Statistical Mechanics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"pa4NTqGpnqLe3Phgl6ruT_W-yVE2PhhXUQBdtt6_Q5E","pdfSize":"2164985"}
