{"id":"2407.15404","title":"Accurate estimation of interfacial thermal conductance between silicon\n  and diamond enabled by a machine learning interatomic potential","authors":"Ali Rajabpour, Bohayra Mortazavi, Pedram Mirchi, Julien El Hajj,\n  Yangyu Guo, Xiaoying Zhuang, Samy Merabia","authorsParsed":[["Rajabpour","Ali",""],["Mortazavi","Bohayra",""],["Mirchi","Pedram",""],["Hajj","Julien El",""],["Guo","Yangyu",""],["Zhuang","Xiaoying",""],["Merabia","Samy",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 06:14:00 GMT"}],"updateDate":"2024-07-23","timestamp":1721628840000,"abstract":"  Thermal management at silicon-diamond interface is critical for advancing\nhigh-performance electronic and optoelectronic devices. In this study, we\ncalculate the interfacial thermal conductance between silicon and diamond using\nmachine learning (ML) interatomic potentials trained on density functional\ntheory (DFT) data. Using non-equilibrium molecular dynamics (NEMD) simulations,\nwe compute the interfacial thermal conductance (ITC) for various system sizes.\nOur results show a closer agreement with experimental data than those obtained\nusing traditional semi-empirical potentials such as Tersoff and Brenner which\noverestimate ITC by a factor of about 3. In addition, we analyze the\nfrequency-dependent heat transfer spectrum, providing insights into the\ncontributions of different phonon modes to the interfacial thermal conductance.\nThe ML potential accurately captures the phonon dispersion relations and\nlifetimes, in good agreement with DFT calculations and experimental\nobservations. It is shown that the Tersoff potential predicts higher phonon\ngroup velocities and phonon lifetimes compared to the DFT results. Furthermore,\nit predicts higher interfacial bonding strength, which is consistent with\nhigher interfacial thermal conductance as compared to the ML potential. This\nstudy highlights the use of the ML interatomic potential to improve the\naccuracy and computational efficiency of thermal transport simulations in\ncomplex material systems.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}