{"id":"2407.12562","title":"A primary quantum current standard based on the Josephson and the\n  quantum Hall effects","authors":"Sophie Djordjevic, Ralf Behr and W. Poirier","authorsParsed":[["Djordjevic","Sophie",""],["Behr","Ralf",""],["Poirier","W.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 13:45:41 GMT"}],"updateDate":"2024-07-18","timestamp":1721223941000,"abstract":"  The new definition of the ampere calls for a quantum current standard able to\ndeliver a flow of elementary charges per second controlled with a relative\nuncertainty of one part in $10^8$. Despite many efforts, nanodevices handling\nelectrons one by one have never been able to demonstrate such an accuracy. The\nalternative route based on applying Ohm's law to the Josephson voltage and\nquantum Hall standards recently reached the target uncertainty but this was at\nthe expense of the application of error corrections, hampering simplicity and\nfurther improvement. As a result, national metrology institutes still lack an\noperational quantum current standard. Here, we present a new quantum current\ngenerator, combining both quantum standards and a superconducting cryogenic\namplifier, free of error correction, which provides quantized currents driven\nby the Josephson microwave signal. We show that it can realize the ampere\ndefinition with the target uncertainty over a range extended from mA down to\n$\\mu$A and improve end-user current measurements, which are up to now a hundred\ntimes less accurate. Other prospects include measuring large resistances using\nthe new current standard in conjunction with a quantum voltmeter and, by\nexploiting its low-noise performances, bridging the gap with the lower currents\nof other quantum current sources.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Other Condensed Matter","Physics/Instrumentation and Detectors","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}