{"id":"2407.06281","title":"Reconciling M/L Ratios Across Cosmic Time: a Concordance IMF for Massive\n  Galaxies","authors":"Pieter van Dokkum, Charlie Conroy","authorsParsed":[["van Dokkum","Pieter",""],["Conroy","Charlie",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:00:16 GMT"},{"version":"v2","created":"Sat, 7 Sep 2024 13:10:18 GMT"}],"updateDate":"2024-09-10","timestamp":1720461616000,"abstract":"  The stellar initial mass function (IMF) is thought to be bottom-heavy in the\ncores of the most massive galaxies, with an excess of low mass stars compared\nto the Milky Way. However, studies of the kinematics of quiescent galaxies at\n2<z<5 find M/L ratios that indicate lighter IMFs. Light IMFs have also been\nproposed for the unexpected populations of luminous galaxies that JWST has\nuncovered at z>7, to reduce tensions with galaxy formation models. Here we\nexplore 'ski slope' IMFs that are simultaneously bottom-heavy, with a steep\nslope at low stellar masses, and top-heavy, with a shallow slope at high\nmasses. We derive a form of the IMF for massive galaxies that is consistent\nwith measurements in the local universe and yet produces relatively low M/L\nratios at high redshift. This concordance IMF has slopes\n$\\gamma_1=2.40\\pm0.09$, $\\gamma_2=2.00\\pm0.14$, and $\\gamma_3=1.85\\pm0.11$ in\nthe regimes 0.08-0.5 Msun, 0.5-1 Msun, and >1 Msun respectively. The IMF\nparameter $\\alpha$, the mass excess compared to a Milky Way IMF, ranges from\n$\\log(\\alpha)\\approx+0.3$ for present-day galaxies to $\\log(\\alpha)\\approx-0.1$\nfor their star forming progenitors. The concordance IMF applies only to the\ncentral regions of the most massive galaxies, with velocity dispersions ~300\nkm/s, and their progenitors. However, it can be generalized using a\npreviously-measured relation between $\\alpha$ and $\\sigma$. We arrive at the\nfollowing modification to the Kroupa (2001) IMF for galaxies with\n$\\sigma\\gtrsim 160$ km/s: $\\gamma_1\\approx1.3+4.3\\log\\sigma_{160}$;\n$\\gamma_2\\approx2.3-1.2\\log\\sigma_{160}$; and\n$\\gamma_3\\approx2.3-1.7\\log\\sigma_{160}$, with $\\sigma_{160}=\\sigma/160$ km/s.\nIf galaxies grow primarily inside-out, so that velocity dispersions are\nrelatively stable, these relations should also hold at high redshift.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}