{"id":"2407.14211","title":"Advanced Predictive Modeling for Enhanced Mortality Prediction in ICU\n  Stroke Patients Using Clinical Data","authors":"Armin Abdollahi and Negin Ashrafi and Maryam Pishgar","authorsParsed":[["Abdollahi","Armin",""],["Ashrafi","Negin",""],["Pishgar","Maryam",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 11:17:42 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 23:41:47 GMT"}],"updateDate":"2024-09-04","timestamp":1721387862000,"abstract":"  Background: Stroke is second-leading cause of disability and death among\nadults. Approximately 17 million people suffer from a stroke annually, with\nabout 85% being ischemic strokes. Predicting mortality of ischemic stroke\npatients in intensive care unit (ICU) is crucial for optimizing treatment\nstrategies, allocating resources, and improving survival rates. Methods: We\nacquired data on ICU ischemic stroke patients from MIMIC-IV database, including\ndiagnoses, vital signs, laboratory tests, medications, procedures, treatments,\nand clinical notes. Stroke patients were randomly divided into training (70%,\nn=2441), test (15%, n=523), and validation (15%, n=523) sets. To address data\nimbalances, we applied Synthetic Minority Over-sampling Technique (SMOTE). We\nselected 30 features for model development, significantly reducing feature\nnumber from 1095 used in the best study. We developed a deep learning model to\nassess mortality risk and implemented several baseline machine learning models\nfor comparison. Results: XGB-DL model, combining XGBoost for feature selection\nand deep learning, effectively minimized false positives. Model's AUROC\nimproved from 0.865 (95% CI: 0.821 - 0.905) on first day to 0.903 (95% CI:\n0.868 - 0.936) by fourth day using data from 3,646 ICU mortality patients in\nthe MIMIC-IV database with 0.945 AUROC (95% CI: 0.944 - 0.947) during training.\nAlthough other ML models also performed well in terms of AUROC, we chose Deep\nLearning for its higher specificity. Conclusions: Through enhanced feature\nselection and data cleaning, proposed model demonstrates a 13% AUROC\nimprovement compared to existing models while reducing feature number from 1095\nin previous studies to 30.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8u5opw_Ly2Y8AFW2gKZCi3eMnY_z1biS3jqmlqfknf8","pdfSize":"2880815","objectId":"0x66189303958ca87e3dbd4f52e8dd49af6c3f4b758e4eb9d20f1338eb08af550a","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
