{"id":"2407.16430","title":"Rethinking Out-of-Distribution Detection on Imbalanced Data Distribution","authors":"Kai Liu, Zhihang Fu, Sheng Jin, Chao Chen, Ze Chen, Rongxin Jiang, Fan\n  Zhou, Yaowu Chen, Jieping Ye","authorsParsed":[["Liu","Kai",""],["Fu","Zhihang",""],["Jin","Sheng",""],["Chen","Chao",""],["Chen","Ze",""],["Jiang","Rongxin",""],["Zhou","Fan",""],["Chen","Yaowu",""],["Ye","Jieping",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 12:28:59 GMT"}],"updateDate":"2024-07-24","timestamp":1721737739000,"abstract":"  Detecting and rejecting unknown out-of-distribution (OOD) samples is critical\nfor deployed neural networks to void unreliable predictions. In real-world\nscenarios, however, the efficacy of existing OOD detection methods is often\nimpeded by the inherent imbalance of in-distribution (ID) data, which causes\nsignificant performance decline. Through statistical observations, we have\nidentified two common challenges faced by different OOD detectors:\nmisidentifying tail class ID samples as OOD, while erroneously predicting OOD\nsamples as head class from ID. To explain this phenomenon, we introduce a\ngeneralized statistical framework, termed ImOOD, to formulate the OOD detection\nproblem on imbalanced data distribution. Consequently, the theoretical analysis\nreveals that there exists a class-aware bias item between balanced and\nimbalanced OOD detection, which contributes to the performance gap. Building\nupon this finding, we present a unified training-time regularization technique\nto mitigate the bias and boost imbalanced OOD detectors across architecture\ndesigns. Our theoretically grounded method translates into consistent\nimprovements on the representative CIFAR10-LT, CIFAR100-LT, and ImageNet-LT\nbenchmarks against several state-of-the-art OOD detection approaches. Code will\nbe made public soon.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RCMEm-7NFqGnbAObGxKza6etWN9uTUiXbpNVjAQFt44","pdfSize":"654293"}
