{"id":"2407.15570","title":"Hybrid STAR-RIS Enabled Integrated Sensing and Communication","authors":"Zehra Yigit, Ertugrul Basar","authorsParsed":[["Yigit","Zehra",""],["Basar","Ertugrul",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 11:55:39 GMT"}],"updateDate":"2024-07-23","timestamp":1721649339000,"abstract":"  Integrated sensing and communication (ISAC) is recognized as one of the key\nenabling technologies for sixth-generation (6G) wireless communication\nnetworks, facilitating diverse emerging applications and services in an energy\nand cost-efficient manner. This paper proposes a multi-user multi-target ISAC\nsystem to enable full-space coverage for communication and sensing tasks. The\nproposed system employs a hybrid simultaneous transmission and reflection\nreconfigurable intelligent surface (STAR-RIS) comprising active transmissive\nand passive reflective elements. In the proposed scheme, the passive reflective\nelements support communication and sensing links for nearby communication users\nand sensing targets, while low-power active transmissive elements are deployed\nto improve sensing performance and overcome high path attenuation due to\nmulti-hop transmission for remote targets. Moreover, to optimize the\ntransmissive/reflective coefficients of the hybrid STAR-RIS, a semi-definite\nrelaxation (SDR)-based algorithm is proposed. Furthermore, to evaluate sensing\nperformance, signal-to-interference-noise ratio (SINR) and Cramer-Rao bound\n(CRB) metrics have been derived and investigated via conducting extensive\ncomputer simulations.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eC9d-zg7h3Nu2GA8f0czuBguBOjwSpk4LOs-Mp2ULAM","pdfSize":"5060808","objectId":"0xbf058d43d67560d9ccc4a0f2ba00dea54af5dff3c3ed1a55d2eb08a6d9410119","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
