{"id":"2407.13545","title":"DiffuX2CT: Diffusion Learning to Reconstruct CT Images from Biplanar\n  X-Rays","authors":"Xuhui Liu, Zhi Qiao, Runkun Liu, Hong Li, Juan Zhang, Xiantong Zhen,\n  Zhen Qian, Baochang Zhang","authorsParsed":[["Liu","Xuhui",""],["Qiao","Zhi",""],["Liu","Runkun",""],["Li","Hong",""],["Zhang","Juan",""],["Zhen","Xiantong",""],["Qian","Zhen",""],["Zhang","Baochang",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 14:20:04 GMT"}],"updateDate":"2024-07-19","timestamp":1721312404000,"abstract":"  Computed tomography (CT) is widely utilized in clinical settings because it\ndelivers detailed 3D images of the human body. However, performing CT scans is\nnot always feasible due to radiation exposure and limitations in certain\nsurgical environments. As an alternative, reconstructing CT images from\nultra-sparse X-rays offers a valuable solution and has gained significant\ninterest in scientific research and medical applications. However, it presents\ngreat challenges as it is inherently an ill-posed problem, often compromised by\nartifacts resulting from overlapping structures in X-ray images. In this paper,\nwe propose DiffuX2CT, which models CT reconstruction from orthogonal biplanar\nX-rays as a conditional diffusion process. DiffuX2CT is established with a 3D\nglobal coherence denoising model with a new, implicit conditioning mechanism.\nWe realize the conditioning mechanism by a newly designed tri-plane decoupling\ngenerator and an implicit neural decoder. By doing so, DiffuX2CT achieves\nstructure-controllable reconstruction, which enables 3D structural information\nto be recovered from 2D X-rays, therefore producing faithful textures in CT\nimages. As an extra contribution, we collect a real-world lumbar CT dataset,\ncalled LumbarV, as a new benchmark to verify the clinical significance and\nperformance of CT reconstruction from X-rays. Extensive experiments on this\ndataset and three more publicly available datasets demonstrate the\neffectiveness of our proposal.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}