{"id":"2407.18858","title":"HADES: Detecting Active Directory Attacks via Whole Network Provenance\n  Analytics","authors":"Qi Liu, Kaibin Bao, Wajih Ul Hassan, Veit Hagenmeyer","authorsParsed":[["Liu","Qi",""],["Bao","Kaibin",""],["Hassan","Wajih Ul",""],["Hagenmeyer","Veit",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 16:46:29 GMT"}],"updateDate":"2024-07-29","timestamp":1722012389000,"abstract":"  Due to its crucial role in identity and access management in modern\nenterprise networks, Active Directory (AD) is a top target of Advanced\nPersistence Threat (APT) actors. Conventional intrusion detection systems (IDS)\nexcel at identifying malicious behaviors caused by malware, but often fail to\ndetect stealthy attacks launched by APT actors. Recent advance in\nprovenance-based IDS (PIDS) shows promises by exposing malicious system\nactivities in causal attack graphs. However, existing approaches are restricted\nto intra-machine tracing, and unable to reveal the scope of attackers'\ntraversal inside a network. We propose HADES, the first PIDS capable of\nperforming accurate causality-based cross-machine tracing by leveraging a novel\nconcept called logon session based execution partitioning to overcome several\nchallenges in cross-machine tracing. We design HADES as an efficient on-demand\ntracing system, which performs whole-network tracing only when it first\nidentifies an authentication anomaly signifying an ongoing AD attack, for which\nwe introduce a novel lightweight authentication anomaly detection model rooted\nin our extensive analysis of AD attacks. To triage attack alerts, we present a\nnew algorithm integrating two key insights we identified in AD attacks. Our\nevaluations show that HADES outperforms both popular open source detection\nsystems and a prominent commercial AD attack detector.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pfroEldugnXAyfQcEyifLyA4ivL589IzxvkxlvNVN-0","pdfSize":"2333131"}
