{"id":"2407.02043","title":"Concise and Precise Context Compression for Tool-Using Language Models","authors":"Yang Xu, Yunlong Feng, Honglin Mu, Yutai Hou, Yitong Li, Xinghao Wang,\n  Wanjun Zhong, Zhongyang Li, Dandan Tu, Qingfu Zhu, Min Zhang, Wanxiang Che","authorsParsed":[["Xu","Yang",""],["Feng","Yunlong",""],["Mu","Honglin",""],["Hou","Yutai",""],["Li","Yitong",""],["Wang","Xinghao",""],["Zhong","Wanjun",""],["Li","Zhongyang",""],["Tu","Dandan",""],["Zhu","Qingfu",""],["Zhang","Min",""],["Che","Wanxiang",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 08:17:00 GMT"}],"updateDate":"2024-07-03","timestamp":1719908220000,"abstract":"  Through reading the documentation in the context, tool-using language models\ncan dynamically extend their capability using external tools. The cost is that\nwe have to input lengthy documentation every time the model needs to use the\ntool, occupying the input window as well as slowing down the decoding process.\n  Given the progress in general-purpose compression, soft context compression\nis a suitable approach to alleviate the problem. However, when compressing tool\ndocumentation, existing methods suffer from the weaknesses of key information\nloss (specifically, tool/parameter name errors) and difficulty in adjusting the\nlength of compressed sequences based on documentation lengths.\n  To address these problems, we propose two strategies for compressing tool\ndocumentation into concise and precise summary sequences for tool-using\nlanguage models. 1) Selective compression strategy mitigates key information\nloss by deliberately retaining key information as raw text tokens. 2) Block\ncompression strategy involves dividing tool documentation into short chunks and\nthen employing a fixed-length compression model to achieve variable-length\ncompression. This strategy facilitates the flexible adjustment of the\ncompression ratio.\n  Results on API-Bank and APIBench show that our approach reaches a performance\ncomparable to the upper-bound baseline under up to 16x compression ratio.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}