{"id":"2407.20765","title":"Integrating audiological datasets via federated merging of Auditory\n  Profiles","authors":"Samira Saak, Dirk Oetting, Birger Kollmeier, Mareike Buhl","authorsParsed":[["Saak","Samira",""],["Oetting","Dirk",""],["Kollmeier","Birger",""],["Buhl","Mareike",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 12:08:44 GMT"}],"updateDate":"2024-07-31","timestamp":1722341324000,"abstract":"  Audiological datasets contain valuable knowledge about hearing loss in\npatients, which can be uncovered using data-driven, federated learning\ntechniques. Our previous approach summarized patient information from one\naudiological dataset into distinct Auditory Profiles (APs). To cover the\ncomplete audiological patient population, however, patient patterns must be\nanalyzed across multiple, separated datasets, and finally, be integrated into a\ncombined set of APs. This study aimed at extending the existing profile\ngeneration pipeline with an AP merging step, enabling the combination of APs\nfrom different datasets based on their similarity across audiological measures.\nThe 13 previously generated APs (NA=595) were merged with 31 newly generated\nAPs from a second dataset (NB=1272) using a similarity score derived from the\noverlapping densities of common features across the two datasets. To ensure\nclinical applicability, random forest models were created for various\nscenarios, encompassing different combinations of audiological measures. A new\nset with 13 combined APs is proposed, providing well-separable profiles, which\nstill capture detailed patient information from various test outcome\ncombinations. The classification performance across these profiles is\nsatisfactory. The best performance was achieved using a combination of loudness\nscaling, audiogram and speech test information, while single measures performed\nworst. The enhanced profile generation pipeline demonstrates the feasibility of\ncombining APs across datasets, which should generalize to all datasets and\ncould lead to an interpretable population-based profile set in the future. The\nclassification models maintain clinical applicability. Hence, even if only\nsmartphone-based measures are available, a given patient can be classified into\nan appropriate AP.\n","subjects":["Physics/Medical Physics","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/"}