{"id":"2407.07152","title":"Evidence for large baryonic feedback at low and intermediate redshifts\n  from kinematic Sunyaev-Zel'dovich observations with ACT and DESI photometric\n  galaxies","authors":"B. Hadzhiyska, S. Ferraro, B. Ried Guachalla, E. Schaan, J. Aguilar,\n  N. Battaglia, J. R. Bond, D. Brooks, E. Calabrese, S. K. Choi, T. Claybaugh,\n  W. R. Coulton, K. Dawson, M. Devlin, B. Dey, P. Doel, A. J. Duivenvoorden, J.\n  Dunkley, G. S. Farren, A. Font-Ribera, J. E. Forero-Romero, P. A. Gallardo,\n  E. Gazta\\~naga, S. Gontcho Gontcho, M. Gralla, L. Le Guillou, G. Gutierrez,\n  J. Guy, J. C. Hill, R. Hlo\\v{z}ek, K. Honscheid, S. Juneau, T. Kisner, A.\n  Kremin, M. Landriau, R. H. Liu, T. Louis, N. MacCrann, A. de Macorra, M.\n  Madhavacheril, M. Manera, A. Meisner, R. Miquel, K. Moodley, J. Moustakas, T.\n  Mroczkowski, S. Naess, J. Newman, M. D. Niemack, G. Niz, L. Page, N.\n  Palanque-Delabrouille, B. Partridge, W. J. Percival, F. Prada, F. J. Qu, G.\n  Rossi, E. Sanchez, D. Schlegel, M. Schubnell, N. Sehgal, H. Seo, C. Sif\\'on,\n  D. Spergel, D. Sprayberry, S. Staggs, G. Tarl\\'e, C. Vargas, E. M.\n  Vavagiakis, B. A. Weaver, E. J. Wollack, R. Zhou, H. Zou","authorsParsed":[["Hadzhiyska","B.",""],["Ferraro","S.",""],["Guachalla","B. Ried",""],["Schaan","E.",""],["Aguilar","J.",""],["Battaglia","N.",""],["Bond","J. R.",""],["Brooks","D.",""],["Calabrese","E.",""],["Choi","S. K.",""],["Claybaugh","T.",""],["Coulton","W. R.",""],["Dawson","K.",""],["Devlin","M.",""],["Dey","B.",""],["Doel","P.",""],["Duivenvoorden","A. J.",""],["Dunkley","J.",""],["Farren","G. S.",""],["Font-Ribera","A.",""],["Forero-Romero","J. E.",""],["Gallardo","P. A.",""],["Gaztañaga","E.",""],["Gontcho","S. Gontcho",""],["Gralla","M.",""],["Guillou","L. Le",""],["Gutierrez","G.",""],["Guy","J.",""],["Hill","J. C.",""],["Hložek","R.",""],["Honscheid","K.",""],["Juneau","S.",""],["Kisner","T.",""],["Kremin","A.",""],["Landriau","M.",""],["Liu","R. H.",""],["Louis","T.",""],["MacCrann","N.",""],["de Macorra","A.",""],["Madhavacheril","M.",""],["Manera","M.",""],["Meisner","A.",""],["Miquel","R.",""],["Moodley","K.",""],["Moustakas","J.",""],["Mroczkowski","T.",""],["Naess","S.",""],["Newman","J.",""],["Niemack","M. D.",""],["Niz","G.",""],["Page","L.",""],["Palanque-Delabrouille","N.",""],["Partridge","B.",""],["Percival","W. J.",""],["Prada","F.",""],["Qu","F. J.",""],["Rossi","G.",""],["Sanchez","E.",""],["Schlegel","D.",""],["Schubnell","M.",""],["Sehgal","N.",""],["Seo","H.",""],["Sifón","C.",""],["Spergel","D.",""],["Sprayberry","D.",""],["Staggs","S.",""],["Tarlé","G.",""],["Vargas","C.",""],["Vavagiakis","E. M.",""],["Weaver","B. A.",""],["Wollack","E. J.",""],["Zhou","R.",""],["Zou","H.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-11","timestamp":1720548003000,"abstract":"  Recent advances in cosmological observations have provided an unprecedented\nopportunity to investigate the distribution of baryons relative to the\nunderlying matter. In this work, we robustly show that the gas is much more\nextended than the dark matter at 40$\\sigma$ and the amount of baryonic feedback\nat $z \\lesssim 1$ strongly disfavors low-feedback models such as that of\nstate-of-the-art hydrodynamical simulation IllustrisTNG compared with\nhigh-feedback models such as that of the original Illustris simulation. This\nhas important implications for bridging the gap between theory and observations\nand understanding galaxy formation and evolution. Furthermore, a better grasp\nof the baryon-dark matter link is critical to future cosmological analyses,\nwhich are currently impeded by our limited knowledge of baryonic feedback.\nHere, we measure the kinematic Sunyaev-Zel'dovich (kSZ) effect from the Atacama\nCosmology Telescope (ACT), stacked on the luminous red galaxy (LRG) sample of\nthe Dark Energy Spectroscopic Instrument (DESI) imaging survey. This is the\nfirst analysis to use photometric redshifts for reconstructing galaxy\nvelocities. Due to the large number of galaxies comprising the DESI imaging\nsurvey, this is the highest signal-to-noise stacked kSZ measurement to date: we\ndetect the signal at 13$\\sigma$ and find that the gas is more spread out than\nthe dark matter at $\\sim$40$\\sigma$. Our work opens up the possibility to\nrecalibrate large hydrodynamical simulations using the kSZ effect. In addition,\nour findings point towards a way of alleviating inconsistencies between weak\nlensing surveys and cosmic microwave background (CMB) experiments such as the\n`low $S_8$' tension, and shed light on long-standing enigmas in astrophysics\nsuch as the `missing baryon' problem.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}