{"id":"2407.19516","title":"An Investigation of the Test-Retest Reliability of the miniPXI","authors":"Aqeel Haider, G\\\"unter Wallner, Kathrin Gerling, Vero Vanden Abeele","authorsParsed":[["Haider","Aqeel",""],["Wallner","Günter",""],["Gerling","Kathrin",""],["Abeele","Vero Vanden",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 15:52:14 GMT"}],"updateDate":"2024-07-30","timestamp":1722181934000,"abstract":"  Repeated measurements of player experience are crucial in games user\nresearch, assessing how different designs evolve over time. However, this\nnecessitates lightweight measurement instruments that are fit for the purpose.\nIn this study, we conduct an examination of the test-retest reliability of the\n\\emph{miniPXI} -- a short variant of the \\emph{Player Experience Inventory}\n(\\emph{PXI}), an established measure for measuring player experience. We\nanalyzed test-retest reliability by leveraging four games involving 100\nparticipants, comparing it with four established multi-item measures and\nsingle-item indicators such as the Net Promoter Score (\\emph{NPS}) and overall\nenjoyment. The findings show mixed outcomes; the \\emph{miniPXI} demonstrated\nvarying levels of test-retest reliability. Some constructs showed good to\nmoderate reliability, while others were less consistent. On the other hand,\nmulti-item measures exhibited moderate to good test-retest reliability,\ndemonstrating their effectiveness in measuring player experiences over time.\nAdditionally, the employed single-item indicators (\\emph{NPS} and overall\nenjoyment) demonstrated good reliability. The results of our study highlight\nthe complexity of player experience evaluations over time, utilizing single and\nmultiple items per construct measures. We conclude that single-item measures\nmay not be appropriate for long-term investigations of more complex PX\ndimensions and provide practical considerations for the applicability of such\nmeasures in repeated measurements.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}