{"id":"2407.06606","title":"Tailored Design of Audio-Visual Speech Recognition Models using\n  Branchformers","authors":"David Gimeno-G\\'omez and Carlos-D. Mart\\'inez-Hinarejos","authorsParsed":[["Gimeno-Gómez","David",""],["Martínez-Hinarejos","Carlos-D.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 07:15:56 GMT"}],"updateDate":"2024-07-10","timestamp":1720509356000,"abstract":"  Recent advances in Audio-Visual Speech Recognition (AVSR) have led to\nunprecedented achievements in the field, improving the robustness of this type\nof system in adverse, noisy environments. In most cases, this task has been\naddressed through the design of models composed of two independent encoders,\neach dedicated to a specific modality. However, while recent works have\nexplored unified audio-visual encoders, determining the optimal cross-modal\narchitecture remains an ongoing challenge. Furthermore, such approaches often\nrely on models comprising vast amounts of parameters and high computational\ncost training processes. In this paper, we aim to bridge this research gap by\nintroducing a novel audio-visual framework. Our proposed method constitutes, to\nthe best of our knowledge, the first attempt to harness the flexibility and\ninterpretability offered by encoder architectures, such as the Branchformer, in\nthe design of parameter-efficient AVSR systems. To be more precise, the\nproposed framework consists of two steps: first, estimating audio- and\nvideo-only systems, and then designing a tailored audio-visual unified encoder\nbased on the layer-level branch scores provided by the modality-specific\nmodels. Extensive experiments on English and Spanish AVSR benchmarks covering\nmultiple data conditions and scenarios demonstrated the effectiveness of our\nproposed method. Results reflect how our tailored AVSR system is able to reach\nstate-of-the-art recognition rates while significantly reducing the model\ncomplexity w.r.t. the prevalent approach in the field. Code and pre-trained\nmodels are available at https://github.com/david-gimeno/tailored-avsr.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"CKYtEZmNdPi55WJE4HSnyZqg2UPRzj6ZLdMNT_j3CGs","pdfSize":"873521"}
