{"id":"2407.01888","title":"PO-MSCKF: An Efficient Visual-Inertial Odometry by Reconstructing the\n  Multi-State Constrained Kalman Filter with the Pose-only Theory","authors":"Du Xueyu, Zhang Lilian, Liu Ruochen, Wang Maosong, Wu Wenqi and Mao\n  Jun","authorsParsed":[["Xueyu","Du",""],["Lilian","Zhang",""],["Ruochen","Liu",""],["Maosong","Wang",""],["Wenqi","Wu",""],["Jun","Mao",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 02:18:35 GMT"}],"updateDate":"2024-07-03","timestamp":1719886715000,"abstract":"  Efficient Visual-Inertial Odometry (VIO) is crucial for payload-constrained\nrobots. Though modern optimization-based algorithms have achieved superior\naccuracy, the MSCKF-based VIO algorithms are still widely demanded for their\nefficient and consistent performance. As MSCKF is built upon the conventional\nmulti-view geometry, the measured residuals are not only related to the state\nerrors but also related to the feature position errors. To apply EKF fusion, a\nprojection process is required to remove the feature position error from the\nobservation model, which can lead to model and accuracy degradation. To obtain\nan efficient visual-inertial fusion model, while also preserving the model\nconsistency, we propose to reconstruct the MSCKF VIO with the novel Pose-Only\n(PO) multi-view geometry description. In the newly constructed filter, we have\nmodeled PO reprojection residuals, which are solely related to the motion\nstates and thus overcome the requirements of space projection. Moreover, the\nnew filter does not require any feature position information, which removes the\ncomputational cost and linearization errors brought in by the 3D reconstruction\nprocedure. We have conducted comprehensive experiments on multiple datasets,\nwhere the proposed method has shown accuracy improvements and consistent\nperformance in challenging sequences.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}