{"id":"2407.17357","title":"How optimal control of polar sea-ice depends on its tipping points","authors":"Parvathi Kooloth, Jian Lu, Craig Bakker, Derek DeSantis and Adam Rupe","authorsParsed":[["Kooloth","Parvathi",""],["Lu","Jian",""],["Bakker","Craig",""],["DeSantis","Derek",""],["Rupe","Adam",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 15:29:20 GMT"}],"updateDate":"2024-07-25","timestamp":1721834960000,"abstract":"  Several Earth system components are at a high risk of undergoing rapid and\nirreversible qualitative changes or `tipping', due to increasing climate\nwarming. Potential tipping elements include Arctic sea-ice, Atlantic meridional\noverturning circulation, and tropical coral reefs. Amidst such immediate\nconcerns, it has become necessary to investigate the feasibility of arresting\nor even reversing the crossing of tipping thresholds using feedback control. In\nthis paper, we study the control of an idealized diffusive energy balance model\n(EBM) for the Earth's climate; this model has two tipping points due to strong\nco-albedo feedback. One of these tipping points is a `small icecap' instability\nresponsible for a rapid transition to an ice-free climate state under\nincreasing greenhouse gas (GHG) forcing. We develop an optimal control strategy\nfor the EBM under different climate forcing scenarios with the goal of\nreversing sea ice loss while minimizing costs. We find that effective control\nis achievable for such a system, but the cost of reversing sea-ice loss nearly\nquadruples for an initial state that has just tipped as compared to a state\nbefore reaching the tipping point. We also show that thermal inertia may delay\ntipping leading to an overshoot of the critical GHG forcing threshold. This may\noffer a short intervention window (overshoot window) during which the control\nrequired to reverse sea-ice loss only scales linearly with intervention time.\nWhile systems with larger system inertia may have longer overshoot windows,\nthis increased elbow room comes with a steeper rise in the requisite control\nonce the intervention is delayed past this window. Additionally, we find that\nthe requisite control to restore sea-ice is localized in the polar region.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}