{"id":"2407.14973","title":"EPOCHS I. The Discovery and Star Forming Properties of Galaxies in the\n  Epoch of Reionization at $6.5 < z < 18$ with PEARLS and Public JWST data","authors":"Christopher J. Conselice, Nathan Adams, Thomas Harvey, Duncan Austin,\n  Leonardo Ferreira, Katherine Ormerod, Qiao Duan, James Trussler, Qiong Li,\n  Ignas Juodzbalis, Lewi Westcott, Honor Harris, Louise T. C. Seeyave, Asa F.\n  L. Bluck, Rogier A. Windhorst, Rachana Bhatawdekar, Dan Coe, Seth H. Cohen,\n  Cheng Cheng, Simon P. Driver, Brenda Frye, Lukas J. Furtak, Norman A. Grogin,\n  Nimish P. Hathi, Benne W. Holwerda, Rolf A. Jansen, Anton M. Koekemoer,\n  Madeline A. Marshall, Mario Nonino, Aaron Robotham, Jake Summers, Stephen M.\n  Wilkins, Christopher N. A. Willmer, Haojing Yan, Adi Zitrin","authorsParsed":[["Conselice","Christopher J.",""],["Adams","Nathan",""],["Harvey","Thomas",""],["Austin","Duncan",""],["Ferreira","Leonardo",""],["Ormerod","Katherine",""],["Duan","Qiao",""],["Trussler","James",""],["Li","Qiong",""],["Juodzbalis","Ignas",""],["Westcott","Lewi",""],["Harris","Honor",""],["Seeyave","Louise T. C.",""],["Bluck","Asa F. L.",""],["Windhorst","Rogier A.",""],["Bhatawdekar","Rachana",""],["Coe","Dan",""],["Cohen","Seth H.",""],["Cheng","Cheng",""],["Driver","Simon P.",""],["Frye","Brenda",""],["Furtak","Lukas J.",""],["Grogin","Norman A.",""],["Hathi","Nimish P.",""],["Holwerda","Benne W.",""],["Jansen","Rolf A.",""],["Koekemoer","Anton M.",""],["Marshall","Madeline A.",""],["Nonino","Mario",""],["Robotham","Aaron",""],["Summers","Jake",""],["Wilkins","Stephen M.",""],["Willmer","Christopher N. A.",""],["Yan","Haojing",""],["Zitrin","Adi",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 20:18:59 GMT"}],"updateDate":"2024-07-23","timestamp":1721506739000,"abstract":"  We present in this paper the discovery, properties, and a catalog of 1165\nhigh redshift $6.5 < z < 18$ galaxies found in deep JWST NIRCam imaging from\nthe GTO PEARLS survey combined with data from JWST public fields. We describe\nour bespoke homogeneous reduction process and our analysis of these areas\nincluding the NEP, CEERS, GLASS, NGDEEP, JADES, and ERO SMACS-0723 fields with\nover 214 arcmin$^{2}$ imaged to depths of $\\sim 30$ mag. We describe our\nrigorous methods for identifying these galaxies, involving the use of\nLyman-break strength, detection significance criteria, visual inspection, and\nintegrated photometric redshifts probability distributions predominately at\nhigh redshift. Our sample is a robust and highly pure collection of distant\ngalaxies from which we also remove brown dwarf stars, and calculate\ncompleteness and contamination from simulations. We include a summary of the\nbasic properties of these $z > 6.5$ galaxies, including their redshift\ndistributions, UV absolute magnitudes, and star formation rates. Our study of\nthese young galaxies reveals a wide range of stellar population properties as\nseen in their colors and SED fits which we compare to stellar population\nmodels, indicating a range of star formation histories, dust, AGN and/or\nnebular emission. We find a strong trend exists between stellar mass and\n$(U-V)$ color, as well as the existence of the `main-sequence' of star\nformation for galaxies as early as $z \\sim 12$. This indicates that stellar\nmass, or an underlying variable correlating with stellar mass, is driving\ngalaxy formation, in agreement with simulation predictions. We also discover\nultra-high redshift candidates at $z > 12$ in our sample and describe their\nproperties. Finally, we note a significant observed excess of galaxies compared\nto models at $z > 12$, revealing a tension between predictions and our\nobservations.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NOEsHCjbPzPiQ6SnrdENo0cUQZrqXIAd7kyUJu28JlE","pdfSize":"8776455"}
