{"id":"2407.01975","title":"Imposing Constraints on Driver Hamiltonians and Mixing Operators: From\n  Theory to Practical Implementation","authors":"Hannes Leipold, Federico M. Spedalieri, Stuart Hadfield, Eleanor\n  Rieffel","authorsParsed":[["Leipold","Hannes",""],["Spedalieri","Federico M.",""],["Hadfield","Stuart",""],["Rieffel","Eleanor",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 06:23:02 GMT"}],"updateDate":"2024-07-03","timestamp":1719901382000,"abstract":"  Constructing Driver Hamiltonians and Mixing Operators such that they satisfy\nconstraints is an important ansatz construction for quantum algorithms. We give\ngeneral algebraic expressions for finding Hamiltonian terms and analogously\nunitary primitives, that satisfy constraint embeddings and use these to give\ncomplexity characterizations of the related problems. Finding operators that\nenforce classical constraints is proven to be NP-Complete in the general case;\nalgorithmic procedures with worse-case polynomial runtime to find any operators\nwith a constant locality bound, applicable for many constraints. We then give\nalgorithmic procedures to turn these algebraic primitives into Hamiltonian\ndrivers and unitary mixers that can be used for Constrained Quantum Annealing\n(CQA) and Quantum Alternating Operator Ansatz (QAOA) constructions by tackling\npractical problems related to finding an appropriate set of reduced generators\nand defining corresponding drivers and mixers accordingly. We then apply these\nconcepts to the construction of ansaetze for 1-in-3 SAT instances. We consider\nthe ordinary x-mixer QAOA, a novel QAOA approach based on the maximally\ndisjoint subset, and a QAOA approach based on the disjoint subset as well as\nhigher order constraint satisfaction terms. We empirically benchmark these\napproaches on instances sized between 12 and 22, showing the best relative\nperformance for the tailored ansaetze and that exponential curve fits on the\nresults are consistent with a quadratic speedup by utilizing alternative\nansaetze to the x-mixer. We provide very general algorithmic prescriptions for\nfinding driver or mixing terms that satisfy embedded constraints that can be\nutilized to probe quantum speedups for constraints problems with linear,\nquadratic, or even higher order polynomial constraints.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}