{"id":"2407.05812","title":"Anomalous behaviour of transport properties in a supercooled\n  water-glycerol mixture","authors":"Alberto Zaragoza, Rajat Kumar, Jose Mart\\'in Roca, Prabir Khatua,\n  Valeria Molinero, Fr\\'ed\\'eric Caupin and Chantal Valeriani","authorsParsed":[["Zaragoza","Alberto",""],["Kumar","Rajat",""],["Roca","Jose Martín",""],["Khatua","Prabir",""],["Molinero","Valeria",""],["Caupin","Frédéric",""],["Valeriani","Chantal",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 10:49:36 GMT"}],"updateDate":"2024-07-09","timestamp":1720435776000,"abstract":"  Glycerol acts as a natural cryoprotectant by depressing the temperature of\nice nucleation and slowing down the dynamics of water mixtures. In this work we\ncharacterize dynamics -- diffusion, viscosity, and hydrogen-bond dynamics -- as\nwell as density anomaly and structure of water mixtures with 1\\% to 50\\% w/w\nglycerol at low temperatures via molecular dynamics simulations using all-atom\nand coarse-grained models. Simulations reveal distinct violations of the\nStokes-Einsten relation in the low temperature regime for water and glycerol.\nDeviations are positive for water at all concentrations, and positive for\nglycerol in very dilute solutions but turning negative in concentrated ones.\nThe all-atom and coarse-grained models reveal an unexpected crossover in the\ndynamics of the 1% and 10 % w/w glycerol at the lowest simulated temperatures.\nThis crossover manifests in the diffusion coefficients of water and glycerol,\nas well as in the viscosity and lifetime of hydrogen-bonds in water. We\ninterpret that the crossover originates on the opposing dependence with\nglycerol concentration of the two factors controlling the solution's slow-down:\nthe increase in tetrahedrally coordinated water and the dynamics and clustering\nof the glycerol molecules. We anticipate that this dynamic crossover will also\noccur for solution of water with other polyols.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}