{"id":"2407.04826","title":"Multi-strategy Based Quantum Cost Reduction of Quantum Boolean Circuits","authors":"Taghreed Ahmed and Ahmed Younes and and Islam Elkabani","authorsParsed":[["Ahmed","Taghreed",""],["Younes","Ahmed",""],["Elkabani","and Islam",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 19:25:46 GMT"}],"updateDate":"2024-07-09","timestamp":1720207546000,"abstract":"  The construction of quantum computers is based on the synthesis of low-cost\nquantum circuits. The quantum circuit of any Boolean function expressed in a\nPositive Polarity Reed-Muller $PPRM$ expansion can be synthesized using\nMultiple-Control Toffoli ($MCT$) gates. This paper proposes two algorithms to\nconstruct a quantum circuit for any Boolean function expressed in a Positive\nPolarity Reed-Muller $PPRM$ expansion. The Boolean function can be expressed\nwith various algebraic forms, so there are different quantum circuits can be\nsynthesized for the Boolean function based on its algebraic form. The proposed\nalgorithms aim to map the $MCT$ gates into the $NCV$ gates for any quantum\ncircuit by generating a simple algebraic form for the Boolean function. The\nfirst algorithm generates a special algebraic form for any Boolean function by\nrearrangement of terms of the Boolean function according to a predefined degree\nof term $d_{term}$, then synthesizes the corresponding quantum circuit. The\nsecond algorithm applies the decomposition methods to decompose $MCT$ circuit\ninto its elementary gates followed by applying a set of simplification rules to\nsimplify and optimize the synthesized quantum circuit. The proposed algorithms\nachieve a reduction in the quantum cost of synthesized quantum circuits when\ncompared with relevant work in literature. The proposed algorithms synthesize\nquantum circuits that can applied on IBM quantum computer.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Emerging Technologies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}