{"id":"2407.15657","title":"Anisotropic magnetic interactions in a candidate Kitaev spin liquid\n  close to a metal-insulator transition","authors":"Zeyu Ma, Danrui Ni, David A. S. Kaib, Kylie MacFarquharson, John S.\n  Pearce, Robert J. Cava, Roser Valenti, Radu Coldea, and Amalia I. Coldea","authorsParsed":[["Ma","Zeyu",""],["Ni","Danrui",""],["Kaib","David A. S.",""],["MacFarquharson","Kylie",""],["Pearce","John S.",""],["Cava","Robert J.",""],["Valenti","Roser",""],["Coldea","Radu",""],["Coldea","Amalia I.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:18:18 GMT"}],"updateDate":"2024-07-23","timestamp":1721657898000,"abstract":"  In the Kitaev honeycomb model, spins coupled by strongly-frustrated\nanisotropic interactions do not order at low temperature but instead form a\nquantum spin liquid with spin fractionalization into Majorana fermions and\nstatic fluxes. The realization of such a model in crystalline materials could\nlead to major breakthroughs in understanding entangled quantum states, however\nachieving this in practice is a very challenging task. The recently synthesized\nhoneycomb material RuI$_3$ shows no long-range magnetic order down to the\nlowest probed temperatures and has been theoretically proposed as a quantum\nspin liquid candidate material on the verge of an insulator to metal\ntransition. Here we report a comprehensive study of the magnetic anisotropy in\nun-twinned single crystals via torque magnetometry and detect clear signatures\nof strongly anisotropic and frustrated magnetic interactions. We attribute the\ndevelopment of sawtooth and six-fold torque signal to strongly anisotropic,\nbond-dependent magnetic interactions by comparing to theoretical calculations.\nAs a function of magnetic field strength at low temperatures, torque shows an\nunusual non-parabolic dependence suggestive of a proximity to a field-induced\ntransition. Thus, RuI$_3$, without signatures of long-range magnetic order,\ndisplays key hallmarks of an exciting new candidate for extended Kitaev\nmagnetism with enhanced quantum fluctuations.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}