{"id":"2407.05068","title":"On the Simple Divisibility Restrictions by Polynomial Equation a n+bn=cn\n  Itself in Fermat Last Theorem for Integer/Complex/Quaternion Triples","authors":"Sandor Kristyan","authorsParsed":[["Kristyan","Sandor",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 13:10:26 GMT"}],"updateDate":"2024-07-09","timestamp":1720271426000,"abstract":"  The divisibility restrictions in the famous equation a n+bn=cn in Fermat Last\nTheorem (FLT, 1637) is analyzed how it selects out many triples to be Fermat\ntriple (i.e. solutions) if n greater than 2, decreasing the cardinality of\nFermat triples. In our analysis, the restriction on positive integer (PI)\nsolutions ((a,b,c,n) up to the point when there is no more) is not along with\nrestriction on power n in PI as decreasing sets {PI } containing {odd}\ncontaining {primes} containing {regular primes}, etc. as in the literature, but\nwith respect to exclusion of more and more c in PI as increasing sets {primes\np} in {p k} in {PI}. The divisibility and co-prime property in Fermat equation\nis analyzed in relation to exclusion of solutions, and the effect of\nsimultaneous values of gcd(a,b,c), gcd(a+b,cn), gcd(c-a,bn) and gcd(c-b,an) on\nthe decrease of cardinality of solutions is exhibited. Again, our derivation\nfocuses mainly on the variable c rather than on variable n, oppositely to the\nliterature in which the FLT is historically separated via the values of power\nn. Among the most famous are the known, about 2500 years old, existing\nPythagorean triples (a,b,c,n=2) and the first milestones as the proved cases\n(of non-existence as n=3 by Gauss and later by Euler (1753) and n=4 by Fermat)\nless than 400 years ago. As it is known, Wiles has proved the FLT in 1995 in an\nabstract roundabout way. The n<0, n:=1/m, as well as complex and quaternion\n(a,b,c) cases focusing on Pythagoreans are commented. Odd powers FLT over\nquaternions breaks.\n","subjects":["Mathematics/General Mathematics"],"license":"http://creativecommons.org/licenses/by/4.0/"}