{"id":"2407.05356","title":"Extended mean-field control problems with Poissonian common noise:\n  Stochastic maximum principle and Hamiltonian-Jacobi-Bellman equation","authors":"Lijun Bo, Jingfei Wang, Xiaoli Wei, Xiang Yu","authorsParsed":[["Bo","Lijun",""],["Wang","Jingfei",""],["Wei","Xiaoli",""],["Yu","Xiang",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 13:19:11 GMT"}],"updateDate":"2024-07-09","timestamp":1720358351000,"abstract":"  This paper studies the extended mean-field control problems with\nstate-control joint law dependence and Poissonian common noise. We develop the\nstochastic maximum principle (SMP) and establish the connection to the\nHamiltonian-Jacobi-Bellman (HJB) equation on the Wasserstein space. The\npresence of the conditional joint law in the McKean-Vlasov dynamics and its\ndiscontinuity caused by the Poissonian common noise bring us new technical\nchallenges. To develop the SMP when the control domain is not necessarily\nconvex, we first consider a strong relaxed control formulation that allows us\nto perform the first-order variation. We also propose the technique of\nextension transformation to overcome the compatibility issues arising from the\njoint law in the relaxed control formulation. By further establishing the\nequivalence between the relaxed control formulation and the strict control\nformulation, we obtain the SMP for the original problem in the strict control\nformulation. In the part to investigate the HJB equation, we formulate an\nauxiliary control problem subjecting to a controlled measure-valued dynamics\nwith Poisson jumps, which allows us to derive the HJB equation of the original\nproblem through an equivalence argument. We also show the connection between\nthe SMP and HJB equation and give an illustrative example of linear quadratic\nextended mean-field control with Poissonian common noise.\n","subjects":["Mathematics/Optimization and Control","Mathematics/Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}