{"id":"2407.18967","title":"GroupCDL: Interpretable Denoising and Compressed Sensing MRI via Learned\n  Group-Sparsity and Circulant Attention","authors":"Nikola Janjusevic, Amirhossein Khalilian-Gourtani, Adeen Flinker, Li\n  Feng, Yao Wang","authorsParsed":[["Janjusevic","Nikola",""],["Khalilian-Gourtani","Amirhossein",""],["Flinker","Adeen",""],["Feng","Li",""],["Wang","Yao",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 20:00:21 GMT"}],"updateDate":"2024-07-30","timestamp":1721419221000,"abstract":"  Nonlocal self-similarity within images has become an increasingly popular\nprior in deep-learning models. Despite their successful image restoration\nperformance, such models remain largely uninterpretable due to their black-box\nconstruction. Our previous studies have shown that interpretable construction\nof a fully convolutional denoiser (CDLNet), with performance on par with\nstate-of-the-art black-box counterparts, is achievable by unrolling a\nconvolutional dictionary learning algorithm. In this manuscript, we seek an\ninterpretable construction of a convolutional network with a nonlocal\nself-similarity prior that performs on par with black-box nonlocal models. We\nshow that such an architecture can be effectively achieved by upgrading the L1\nsparsity prior (soft-thresholding) of CDLNet to an image-adaptive\ngroup-sparsity prior (group-thresholding). The proposed learned\ngroup-thresholding makes use of nonlocal attention to perform spatially varying\nsoft-thresholding on the latent representation. To enable effective training\nand inference on large images with global artifacts, we propose a novel\ncirculant-sparse attention. We achieve competitive natural-image denoising\nperformance compared to black-box nonlocal DNNs and transformers. The\ninterpretable construction of our network allows for a straightforward\nextension to Compressed Sensing MRI (CS-MRI), yielding state-of-the-art\nperformance. Lastly, we show robustness to noise-level mismatches between\ntraining and inference for denoising and CS-MRI reconstruction.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}