{"id":"2407.17021","title":"The EU-US Data Privacy Framework: Is the Dragon Eating its Own Tail?","authors":"Marcelo Corrales Compagnucci","authorsParsed":[["Compagnucci","Marcelo Corrales",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 06:00:47 GMT"}],"updateDate":"2024-07-25","timestamp":1721800847000,"abstract":"  The European Commission adequacy decision on the EU US Data Privacy\nFramework, adopted on July 10th, 2023, marks a crucial moment in transatlantic\ndata protection. Following an Executive Order issued by President Biden in\nOctober 2022, this decision confirms that the United States meets European\nUnion standards for personal data protection. The decision extends to all\ntransfers from the European Economic Area to US entities participating in the\nframework, promoting privacy rights while facilitating data exchange. Key\naspects include oversight of US public authorities access to transferred data,\nthe introduction of a dual tier redress mechanism, and granting new rights to\nEU individuals, encompassing data access and rectification. However, the\nframework presents both promise and challenges in health data transfers. While\nstreamlining exchange and aligning legal standards, it grapples with the\ncomplexities of divergent privacy laws. The recent bill for the introduction of\na US federal privacy law emphasizes the urgent need for ongoing reform.\nLingering concerns persist regarding the framework resilience, especially amid\npotential legal battles before the Court of Justice of the EU. The history of\ntransatlantic data transfers between the EU and the US is riddled with\nvulnerabilities, reminiscent of the Ouroboros, an ancient symbol of a serpent\nor dragon eating its own tail, hinting at the looming possibility of the\nframework facing invalidation once again. This article delves into the main\nrequirements of the framework and offers insights on how healthcare\norganizations can navigate it effectively.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lY_maSle42jEbTDprqvi9d4TlsGijEkuFD88ovWt2hU","pdfSize":"475042"}
