{"id":"2407.06112","title":"Enhancing Language Model Rationality with Bi-Directional Deliberation\n  Reasoning","authors":"Yadong Zhang, Shaoguang Mao, Wenshan Wu, Yan Xia, Tao Ge, Man Lan,\n  Furu Wei","authorsParsed":[["Zhang","Yadong",""],["Mao","Shaoguang",""],["Wu","Wenshan",""],["Xia","Yan",""],["Ge","Tao",""],["Lan","Man",""],["Wei","Furu",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 16:48:48 GMT"}],"updateDate":"2024-07-09","timestamp":1720457328000,"abstract":"  This paper introduces BI-Directional DEliberation Reasoning (BIDDER), a novel\nreasoning approach to enhance the decision rationality of language models.\nTraditional reasoning methods typically rely on historical information and\nemploy uni-directional (left-to-right) reasoning strategy. This lack of\nbi-directional deliberation reasoning results in limited awareness of potential\nfuture outcomes and insufficient integration of historical context, leading to\nsuboptimal decisions. BIDDER addresses this gap by incorporating principles of\nrational decision-making, specifically managing uncertainty and predicting\nexpected utility. Our approach involves three key processes: Inferring hidden\nstates to represent uncertain information in the decision-making process from\nhistorical data; Using these hidden states to predict future potential states\nand potential outcomes; Integrating historical information (past contexts) and\nlong-term outcomes (future contexts) to inform reasoning. By leveraging\nbi-directional reasoning, BIDDER ensures thorough exploration of both past and\nfuture contexts, leading to more informed and rational decisions. We tested\nBIDDER's effectiveness in two well-defined scenarios: Poker (Limit Texas\nHold'em) and Negotiation. Our experiments demonstrate that BIDDER significantly\nimproves the decision-making capabilities of LLMs and LLM agents.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}