{"id":"2407.06882","title":"DL-Chain: Scalable and Stable Blockchain Sharding with High Concurrency\n  via Dual-Layer Consensus","authors":"You Lin, Mingzhe Li, Qingsong Wei, Yong Liu, Siow Mong Rick Goh, and\n  Jin Zhang","authorsParsed":[["Lin","You",""],["Li","Mingzhe",""],["Wei","Qingsong",""],["Liu","Yong",""],["Goh","Siow Mong Rick",""],["Zhang","Jin",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 14:10:47 GMT"}],"updateDate":"2024-07-10","timestamp":1720534247000,"abstract":"  Sharding enhances blockchain scalability by partitioning nodes into multiple\ngroups for concurrent transaction processing. Configuring a large number of\n\\emph{small shards} helps improve the transaction concurrency of a sharding\nsystem. However, it increases the fraction of malicious nodes within each\nshard, easily leading to shard corruption and jeopardizing system security.\nSome existing works have attempted to improve concurrency by reducing the shard\nsize while maintaining security. However, they often require frequent and\ntime-consuming recovery of corrupted shards, leading to severe system\nstagnation. Also, they usually require network-wide consensus to guarantee\nsecurity, which limits scalability.\n  To address these issues, we propose DL-Chain, a blockchain sharding system\nthat can securely provide \\emph{high concurrency with stable and scalable\nperformance.} Our core idea is a \\underline{D}ual-\\underline{L}ayer\narchitecture and consensus, which consists of numerous smaller proposer shards\n(PSs) for transaction processing and multiple larger finalizer committees (FCs)\nfor transaction finalization. To avoid system stagnation and thus guarantee\nstable performance, we ensure PSs' liveness even if they are corrupted through\nthe cooperation of PSs and FCs, thus eliminating the recovery process of\ncorrupted PSs. To better trade-off security and scalability, we fine-tune the\nFCs to enable multiple FCs to coexist securely. As a result, DL-Chain allows a\nlarger fraction of malicious nodes in each PS ($<1/2$) and thus can securely\nconfigure smaller shards for boosted stable and scalable concurrency.\nEvaluation results show that DL-Chain achieves up to 10 times improvement in\nthroughput compared to existing solutions and provides stable concurrency with\nup to 2,550 nodes.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}