{"id":"2407.15227","title":"A Community-Centric Perspective for Characterizing and Detecting\n  Anti-Asian Violence-Provoking Speech","authors":"Gaurav Verma, Rynaa Grover, Jiawei Zhou, Binny Mathew, Jordan Kraemer,\n  Munmun De Choudhury, Srijan Kumar","authorsParsed":[["Verma","Gaurav",""],["Grover","Rynaa",""],["Zhou","Jiawei",""],["Mathew","Binny",""],["Kraemer","Jordan",""],["De Choudhury","Munmun",""],["Kumar","Srijan",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 17:27:17 GMT"}],"updateDate":"2024-07-23","timestamp":1721582837000,"abstract":"  Violence-provoking speech -- speech that implicitly or explicitly promotes\nviolence against the members of the targeted community, contributed to a\nmassive surge in anti-Asian crimes during the pandemic. While previous works\nhave characterized and built tools for detecting other forms of harmful speech,\nlike fear speech and hate speech, our work takes a community-centric approach\nto studying anti-Asian violence-provoking speech. Using data from ~420k Twitter\nposts spanning a 3-year duration (January 1, 2020 to February 1, 2023), we\ndevelop a codebook to characterize anti-Asian violence-provoking speech and\ncollect a community-crowdsourced dataset to facilitate its large-scale\ndetection using state-of-the-art classifiers. We contrast the capabilities of\nnatural language processing classifiers, ranging from BERT-based to LLM-based\nclassifiers, in detecting violence-provoking speech with their capabilities to\ndetect anti-Asian hateful speech. In contrast to prior work that has\ndemonstrated the effectiveness of such classifiers in detecting hateful speech\n($F_1 = 0.89$), our work shows that accurate and reliable detection of\nviolence-provoking speech is a challenging task ($F_1 = 0.69$). We discuss the\nimplications of our findings, particularly the need for proactive interventions\nto support Asian communities during public health crises. The resources related\nto the study are available at\nhttps://claws-lab.github.io/violence-provoking-speech/.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}