{"id":"2407.18547","title":"Mechanism Design for Locating Facilities with Capacities with\n  Insufficient Resources","authors":"Gennaro Auricchio and Harry J. Clough and Jie Zhang","authorsParsed":[["Auricchio","Gennaro",""],["Clough","Harry J.",""],["Zhang","Jie",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 06:55:26 GMT"}],"updateDate":"2024-07-29","timestamp":1721976926000,"abstract":"  This paper explores the Mechanism Design aspects of the $m$-Capacitated\nFacility Location Problem where the total facility capacity is less than the\nnumber of agents. Following the framework outlined by Aziz et al., the Social\nWelfare of the facility location is determined through a\nFirst-Come-First-Served (FCFS) game, in which agents compete once the facility\npositions are established. When the number of facilities is $m > 1$, the Nash\nEquilibrium (NE) of the FCFS game is not unique, making the utility of the\nagents and the concept of truthfulness unclear. To tackle these issues, we\nconsider absolutely truthful mechanisms, i.e. mechanisms that prevent agents\nfrom misreporting regardless of the strategies used during the FCFS game. We\ncombine this stricter truthfulness requirement with the notion of Equilibrium\nStable (ES) mechanisms, which are mechanisms whose Social Welfare does not\ndepend on the NE of the FCFS game. We demonstrate that the class of percentile\nmechanisms is absolutely truthful and identify the conditions under which they\nare ES. We also show that the approximation ratio of each ES percentile\nmechanism is bounded and determine its value. Notably, when all the facilities\nhave the same capacity and the number of agents is sufficiently large, it is\npossible to achieve an approximation ratio smaller than $1+\\frac{1}{2m-1}$.\nFinally, we extend our study to encompass higher-dimensional problems. Within\nthis framework, we demonstrate that the class of ES percentile mechanisms is\neven more restricted and characterize the mechanisms that are both ES and\nabsolutely truthful. We further support our findings by empirically evaluating\nthe performance of the mechanisms when the agents are the samples of a\ndistribution.\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QUrmU3IZSEgrygfabxt2NGWxYQzKaW8QRjBNNK1XigU","pdfSize":"1619137"}
