{"id":"2407.14083","title":"The end-to-end simulator of the ATHENA X-IFU Cryogenic AntiCoincidence\n  detector (CryoAC)","authors":"Matteo D'Andrea, Claudio Macculi, Simone Lotti, Luigi Piro, Andrea\n  Argan, Gabriele Minervini, Guido Torrioli, Fabio Chiarello, Lorenzo Ferrari\n  Barusso, Flavio Gatti, Manuela Rigano","authorsParsed":[["D'Andrea","Matteo",""],["Macculi","Claudio",""],["Lotti","Simone",""],["Piro","Luigi",""],["Argan","Andrea",""],["Minervini","Gabriele",""],["Torrioli","Guido",""],["Chiarello","Fabio",""],["Barusso","Lorenzo Ferrari",""],["Gatti","Flavio",""],["Rigano","Manuela",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 07:38:19 GMT"}],"updateDate":"2024-07-22","timestamp":1721374699000,"abstract":"  The X-IFU is one of the two instruments of ATHENA, the next ESA large X-ray\nobservatory. It is a cryogenic spectrometer based on an array of TES\nmicrocalorimeters. To reduce the particle background, the TES array works in\ncombination with a Cryogenic AntiCoincidence detector (CryoAC). The CryoAC is a\n4-pixel detector, based on ~1 cm2 silicon absorbers sensed by Ir/Au TES. It is\nrequired to have a wide energy bandwidth (from 20 keV to ~1 MeV), high\nefficiency (< 0.014% missed particles), low dead-time (< 1%) and good\ntime-tagging accuracy (10 us at 1 sigma). An end-to-end simulator of the CryoAC\ndetector has been developed both for design and performance assessment,\nconsisting of several modules. First, the in-flight flux of background\nparticles is evaluated by Geant4 simulations. Then, the current flow in the TES\nis evaluated by solving the electro-thermal equations of microcalorimeters, and\nthe detector output signal is generated by simulating the SQUID FLL dynamics.\nFinally, the output is analyzed by a high-efficiency trigger algorithm,\nproducing the simulated CryoAC telemetry. Here, we present in detail this\nend-to-end simulator, and how we are using it to define the new CryoAC baseline\nconfiguration in the new Athena context.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}