{"id":"2407.21527","title":"Photometric properties of classical bulge and pseudo-bulge galaxies at\n  $0.5\\le z<1.0$","authors":"Jia Hu, Qifan Cui, Lan Wang, Wenxiang Pei and Junqiang Ge","authorsParsed":[["Hu","Jia",""],["Cui","Qifan",""],["Wang","Lan",""],["Pei","Wenxiang",""],["Ge","Junqiang",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 11:11:21 GMT"}],"updateDate":"2024-08-01","timestamp":1722424281000,"abstract":"  We compare the photometric properties and specific star formation rate (sSFR)\nof classical and pseudo-bulge galaxies with $M_* \\ge 10^{9.5} \\rm M_{\\odot}$ at\n$0.5\\le z<1.0$, selected from all five CANDELS fields. We also compare these\nproperties of bulge galaxies at lower redshift selected from MaNGA survey (Hu\net al. 2024). This paper aims to study the properties of galaxies with\nclassical and pseudo-bulges at intermediate redshift, to compare the\ndifferences between different bulge types, and to understand the evolution of\nbulges with redshift. Galaxies are classified into classical bulge and\npseudo-bulge samples according to the S$\\mathrm{\\acute{e}}$rsic index n of the\nbulge component based on results of two-component decomposition of galaxies, as\nwell as the position of bulges on the Kormendy diagram. For the 105 classical\nbulge and 86 pseudo-bulge galaxies selected, we compare their size, luminosity,\nand sSFR of various components. At given stellar mass, most classical bulge\ngalaxies have smaller effective radii, larger $B/T$, brighter and relatively\nlarger bulges, and less active star formation than pseudo-bulge galaxies.\nBesides, the two types of galaxies have larger differences in sSFR at large\nradii than at the central region at both low and mid-redshifts. The differences\nbetween properties of the two types of bulge galaxies are in general smaller at\nmid-redshift than at low redshift, indicating that they are evolving to more\ndistinct populations towards the local universe. Bulge type is correlated with\nthe properties of their outer disks, and the correlation is already present at\nredshift as high as $0.5<z<1$.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}