{"id":"2407.17699","title":"SOK: Blockchain for Provenance","authors":"Asma Jodeiri Akbarfam, Hoda Maleki","authorsParsed":[["Akbarfam","Asma Jodeiri",""],["Maleki","Hoda",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 01:46:49 GMT"}],"updateDate":"2024-07-26","timestamp":1721872009000,"abstract":"  Provenance, which traces data from its creation to manipulation, is crucial\nfor ensuring data integrity, reliability, and trustworthiness. It is valuable\nfor single-user applications, collaboration within organizations, and across\norganizations. Blockchain technology has become a popular choice for\nimplementing provenance due to its distributed, transparent, and immutable\nnature. Numerous studies on blockchain designs are specifically dedicated to\nprovenance, and specialize in this area. Our goal is to provide a new\nperspective in blockchain based provenance field by identifying the challenges\nfaced and suggesting future research directions. In this paper, we categorize\nthe problem statement into three main research questions to investigate key\nissues comprehensively and propose a new outlook on the use of blockchains. The\nfirst focuses on challenges in non-collaborative, single-source environments,\nthe second examines implications in collaborative environments and different\ndomains such as supply chain, scientific collaboration and digital forensic,\nand the last one analyzes communication and data exchange challenges between\norganizations using different blockchains. The interconnected nature of these\nresearch questions ensures a thorough exploration of provenance requirements,\nleading to more effective and secure systems. After analyzing the requirements\nof provenance in different environments, we provide future design\nconsiderations for provenance-based blockchains, including blockchain type,\nquery mechanisms, provenance capture methods, and domain-specific\nconsiderations. We also discuss future work and possible extensions in this\nfield.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"vbA_ReLaXxouaPiVN90YNls42S6BB5M3RJEmPF5iHhw","pdfSize":"755356"}
