{"id":"2407.10649","title":"APC: Adaptive Patch Contrast for Weakly Supervised Semantic Segmentation","authors":"Wangyu Wu, Tianhong Dai, Zhenhong Chen, Xiaowei Huang, Fei Ma, Jimin\n  Xiao","authorsParsed":[["Wu","Wangyu",""],["Dai","Tianhong",""],["Chen","Zhenhong",""],["Huang","Xiaowei",""],["Ma","Fei",""],["Xiao","Jimin",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 12:10:05 GMT"}],"updateDate":"2024-07-16","timestamp":1721045405000,"abstract":"  Weakly Supervised Semantic Segmentation (WSSS) using only image-level labels\nhas gained significant attention due to its cost-effectiveness. The typical\nframework involves using image-level labels as training data to generate\npixel-level pseudo-labels with refinements. Recently, methods based on Vision\nTransformers (ViT) have demonstrated superior capabilities in generating\nreliable pseudo-labels, particularly in recognizing complete object regions,\ncompared to CNN methods. However, current ViT-based approaches have some\nlimitations in the use of patch embeddings, being prone to being dominated by\ncertain abnormal patches, as well as many multi-stage methods being\ntime-consuming and lengthy in training, thus lacking efficiency. Therefore, in\nthis paper, we introduce a novel ViT-based WSSS method named \\textit{Adaptive\nPatch Contrast} (APC) that significantly enhances patch embedding learning for\nimproved segmentation effectiveness. APC utilizes an Adaptive-K Pooling (AKP)\nlayer to address the limitations of previous max pooling selection methods.\nAdditionally, we propose a Patch Contrastive Learning (PCL) to enhance patch\nembeddings, thereby further improving the final results. Furthermore, we\nimprove upon the existing multi-stage training framework without CAM by\ntransforming it into an end-to-end single-stage training approach, thereby\nenhancing training efficiency. The experimental results show that our approach\nis effective and efficient, outperforming other state-of-the-art WSSS methods\non the PASCAL VOC 2012 and MS COCO 2014 dataset within a shorter training\nduration.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}