{"id":"2407.14214","title":"Domain Adaptation for Industrial Time-series Forecasting via\n  Counterfactual Inference","authors":"Chao Min, Guoquan Wen, Jiangru Yuan, Jun Yi, Xing Guo","authorsParsed":[["Min","Chao",""],["Wen","Guoquan",""],["Yuan","Jiangru",""],["Yi","Jun",""],["Guo","Xing",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 11:19:43 GMT"}],"updateDate":"2024-07-22","timestamp":1721387983000,"abstract":"  Industrial time-series, as a structural data responds to production process\ninformation, can be utilized to perform data-driven decision-making for\neffective monitoring of industrial production process. However, there are some\nchallenges for time-series forecasting in industry, e.g., predicting few-shot\ncaused by data shortage, and decision-confusing caused by unknown treatment\npolicy. To cope with the problems, we propose a novel causal domain adaptation\nframework, Causal Domain Adaptation (CDA) forecaster to improve the performance\non the interested domain with limited data (target). Firstly, we analyze the\ncausality existing along with treatments, and thus ensure the shared causality\nover time. Subsequently, we propose an answer-based attention mechanism to\nachieve domain-invariant representation by the shared causality in both\ndomains. Then, a novel domain-adaptation is built to model treatments and\noutcomes jointly training on source and target domain. The main insights are\nthat our designed answer-based attention mechanism allows the target domain to\nleverage the existed causality in source time-series even with different\ntreatments, and our forecaster can predict the counterfactual outcome of\nindustrial time-series, meaning a guidance in production process. Compared with\ncommonly baselines, our method on real-world and synthetic oilfield datasets\ndemonstrates the effectiveness in across-domain prediction and the practicality\nin guiding production process\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}