{"id":"2407.16340","title":"Analysis of soot formation in a lab-scale Rich-Quench-Lean combustor\n  using LES with tabulated chemistry","authors":"Leonardo Pachano, Abhijit Kalbhor, Daniel Mira, Jeroen van Oijen","authorsParsed":[["Pachano","Leonardo",""],["Kalbhor","Abhijit",""],["Mira","Daniel",""],["van Oijen","Jeroen",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 09:41:03 GMT"}],"updateDate":"2024-07-24","timestamp":1721727663000,"abstract":"  A numerical study of the effects of air dilution on soot formation and\nparticle dynamics in a lab-scale rich-quench-lean (RQL) combustor is presented\nusing large-eddy simulations (LES) with tabulated chemistry. The modelling\napproach comprises a flamelet generated manifold (FGM) turbulent combustion\nmodel and an efficient discrete sectional method with clustering of sections\n(CDSM) to model soot formation. Three operating conditions are studied\nincluding a reference case without secondary air dilution and two cases with\nvarying air dilution levels. For the latter, the split between primary and\ndilution air is varied from 80:20 to 60:40 expressed in percentage values. The\nstudy aims to investigate the effect of air dilution on the formation and\noxidation of soot for various air splits using a direct comparison with the\navailable experimental data. The results show a good correlation between\npredicted flame topology and spatial distribution of the soot volume fraction\nwith the experimental observations. The introduction of air dilution is found\nto limit the production of soot with a more drastic reduction for the 40%\ndilution case compared to the 20% condition. Predicted particle size\ndistributions (PSD) from the case without secondary air dilution correlate well\nwith scanning mobility particle sizer (SMPS) measurements although fewer and\nsmaller particles are predicted with air dilution. Leaner mixtures and enhanced\noxidation, resulting from the interaction with air dilution jets, favor the\ndecrease in soot formation.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"9lokbMcavrZP0x-SZo56LsHJy7ZpBqTstqNORQVlwro","pdfSize":"3771972","objectId":"0x63243da7dd8ad20f7ce30492ca6b272b124dffa6c1de4f53f4f3474a9fa56ccd","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
