{"id":"2407.18558","title":"PANDORA: The Open-Source, Structurally Elastic Humanoid Robot","authors":"Connor W. Herron, Alexander J. Fuge, Benjamin C. Beiter, Zachary J.\n  Fuge, Nicholas J. Tremaroli, Stephen Welch, Maxwell Stelmack, Madeline\n  Kogelis, Philip Hancock, Ivan Fischman Ekman Simoes, Christian Runyon, Isaac\n  Pressgrove, Alexander Leonessa","authorsParsed":[["Herron","Connor W.",""],["Fuge","Alexander J.",""],["Beiter","Benjamin C.",""],["Fuge","Zachary J.",""],["Tremaroli","Nicholas J.",""],["Welch","Stephen",""],["Stelmack","Maxwell",""],["Kogelis","Madeline",""],["Hancock","Philip",""],["Simoes","Ivan Fischman Ekman",""],["Runyon","Christian",""],["Pressgrove","Isaac",""],["Leonessa","Alexander",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 07:15:24 GMT"}],"updateDate":"2024-07-29","timestamp":1721978124000,"abstract":"  In this work, the novel, open-source humanoid robot, PANDORA, is presented\nwhere a majority of the structural elements are manufactured using 3D-printed\ncompliant materials. As opposed to contemporary approaches that incorporate the\nelastic element into the actuator mechanisms, PANDORA is designed to be\ncompliant under load, or in other words, structurally elastic. This design\napproach lowers manufacturing cost and time, design complexity, and assembly\ntime while introducing controls challenges in state estimation, joint and\nwhole-body control. This work features an in-depth description on the\nmechanical and electrical subsystems including details regarding additive\nmanufacturing benefits and drawbacks, usage and placement of sensors, and\nnetworking between devices. In addition, the design of structural elastic\ncomponents and their effects on overall performance from an estimation and\ncontrol perspective are discussed. Finally, results are presented which\ndemonstrate the robot completing a robust balancing objective in the presence\nof disturbances and stepping behaviors.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}