{"id":"2407.14035","title":"The Existence and Distribution of Photon Spheres Near Spherically\n  Symmetric Black Holes -- A Geometric Analysis","authors":"Chen-Kai Qiao","authorsParsed":[["Qiao","Chen-Kai",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 05:19:04 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 17:45:51 GMT"}],"updateDate":"2024-08-02","timestamp":1721366344000,"abstract":"  Photon sphere has attracted significant attention since the discovery of\nblack hole shadow images by Event Horizon Telescope. Recently, a number of\nstudies have highlighted that the number of photon spheres and their\ndistributions near black holes are strongly constrained by black hole\nproperties. Specifically, for black holes with event horizons and proper\nasymptotic behaviors, the number of stable and unstable photon spheres\nsatisfies the relation $n_{\\text{stable}} - n_{\\text{unstable}} = -1$. In this\nstudy, we provide a novel proof on this relation using a completely new\ngeometric approach, in which the stable and unstable photon spheres are\ndetermined by Gaussian curvature and geodesic curvature in the optical geometry\nof black hole spacetimes. Firstly, we demonstrated the existence of photon\nspheres near black holes with proper asymptotic behaviors (asymptotically flat\nblack holes, asymptotically de-Sitter and anti-de-Sitter black holes).\nSubsequently, we proved that the stable and unstable photon spheres near black\nholes must be one-to-one alternatively separated from each other, such that\neach unstable photon sphere is sandwiched between two stable photon spheres\n(and each stable photon sphere is sandwiched between two unstable photon\nspheres). Our analysis in this study is limited to the spherically symmetric\nblack hole spacetime (with the spacetime metric\n$ds^{2}=g_{tt}dt^{2}+g_{rr}dr^{2}+g_{\\theta\\theta}d\\theta^{2}+g_{\\phi\\phi}d\\phi^{2}$).\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}