{"id":"2407.03340","title":"A Multi-Modal Explainability Approach for Human-Aware Robots in\n  Multi-Party Conversation","authors":"Iveta Be\\v{c}kov\\'a, \\v{S}tefan P\\'oco\\v{s}, Giulia Belgiovine, Marco\n  Matarese, Alessandra Sciutti, Carlo Mazzola","authorsParsed":[["Bečková","Iveta",""],["Pócoš","Štefan",""],["Belgiovine","Giulia",""],["Matarese","Marco",""],["Sciutti","Alessandra",""],["Mazzola","Carlo",""]],"versions":[{"version":"v1","created":"Mon, 20 May 2024 13:09:32 GMT"}],"updateDate":"2024-07-08","timestamp":1716210572000,"abstract":"  The addressee estimation (understanding to whom somebody is talking) is a\nfundamental task for human activity recognition in multi-party conversation\nscenarios. Specifically, in the field of human-robot interaction, it becomes\neven more crucial to enable social robots to participate in such interactive\ncontexts. However, it is usually implemented as a binary classification task,\nrestricting the robot's capability to estimate whether it was addressed and\nlimiting its interactive skills. For a social robot to gain the trust of\nhumans, it is also important to manifest a certain level of transparency and\nexplainability. Explainable artificial intelligence thus plays a significant\nrole in the current machine learning applications and models, to provide\nexplanations for their decisions besides excellent performance. In our work, we\na) present an addressee estimation model with improved performance in\ncomparison with the previous SOTA; b) further modify this model to include\ninherently explainable attention-based segments; c) implement the explainable\naddressee estimation as part of a modular cognitive architecture for\nmulti-party conversation in an iCub robot; d) propose several ways to\nincorporate explainability and transparency in the aforementioned architecture;\nand e) perform a pilot user study to analyze the effect of various explanations\non how human participants perceive the robot.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning","Computing Research Repository/Robotics","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}