{"id":"2407.13546","title":"Treatment-control comparisons in platform trials including\n  non-concurrent controls","authors":"Marta Bofill Roig, Pavla Krotka, Katharina Hees, Franz Koenig, Dominic\n  Magirr, Peter Jacko, Tom Parke, Martin Posch","authorsParsed":[["Roig","Marta Bofill",""],["Krotka","Pavla",""],["Hees","Katharina",""],["Koenig","Franz",""],["Magirr","Dominic",""],["Jacko","Peter",""],["Parke","Tom",""],["Posch","Martin",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 14:20:28 GMT"}],"updateDate":"2024-07-19","timestamp":1721312428000,"abstract":"  Shared controls in platform trials comprise concurrent and non-concurrent\ncontrols. For a given experimental arm, non-concurrent controls refer to data\nfrom patients allocated to the control arm before the arm enters the trial. The\nuse of non-concurrent controls in the analysis is attractive because it may\nincrease the trial's power of testing treatment differences while decreasing\nthe sample size. However, since arms are added sequentially in the trial,\nrandomization occurs at different times, which can introduce bias in the\nestimates due to time trends. In this article, we present methods to\nincorporate non-concurrent control data in treatment-control comparisons,\nallowing for time trends. We focus mainly on frequentist approaches that model\nthe time trend and Bayesian strategies that limit the borrowing level depending\non the heterogeneity between concurrent and non-concurrent controls. We examine\nthe impact of time trends, overlap between experimental treatment arms and\nentry times of arms in the trial on the operating characteristics of treatment\neffect estimators for each method under different patterns for the time trends.\nWe argue under which conditions the methods lead to type 1 error control and\ndiscuss the gain in power compared to trials only using concurrent controls by\nmeans of a simulation study in which methods are compared.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}