{"id":"2407.17328","title":"DarSwin-Unet: Distortion Aware Encoder-Decoder Architecture","authors":"Akshaya Athwale, Ichrak Shili, \\'Emile Bergeron, Ola Ahmad and\n  Jean-Fran\\c{c}ois Lalonde","authorsParsed":[["Athwale","Akshaya",""],["Shili","Ichrak",""],["Bergeron","Émile",""],["Ahmad","Ola",""],["Lalonde","Jean-François",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 14:52:18 GMT"}],"updateDate":"2024-07-25","timestamp":1721832738000,"abstract":"  Wide-angle fisheye images are becoming increasingly common for perception\ntasks in applications such as robotics, security, and mobility (e.g. drones,\navionics). However, current models often either ignore the distortions in\nwide-angle images or are not suitable to perform pixel-level tasks. In this\npaper, we present an encoder-decoder model based on a radial transformer\narchitecture that adapts to distortions in wide-angle lenses by leveraging the\nphysical characteristics defined by the radial distortion profile. In contrast\nto the original model, which only performs classification tasks, we introduce a\nU-Net architecture, DarSwin-Unet, designed for pixel level tasks. Furthermore,\nwe propose a novel strategy that minimizes sparsity when sampling the image for\ncreating its input tokens. Our approach enhances the model capability to handle\npixel-level tasks in wide-angle fisheye images, making it more effective for\nreal-world applications. Compared to other baselines, DarSwin-Unet achieves the\nbest results across different datasets, with significant gains when trained on\nbounded levels of distortions (very low, low, medium, and high) and tested on\nall, including out-of-distribution distortions. We demonstrate its performance\non depth estimation and show through extensive experiments that DarSwin-Unet\ncan perform zero-shot adaptation to unseen distortions of different wide-angle\nlenses.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}