{"id":"2407.00404","title":"The Uneven Impact of Mobility on the Segregation of Native and\n  Foreign-born Individuals","authors":"Yuan Liao, Jorge Gil, Sonia Yeh, Rafael H. M. Pereira, Laura\n  Alessandretti","authorsParsed":[["Liao","Yuan",""],["Gil","Jorge",""],["Yeh","Sonia",""],["Pereira","Rafael H. M.",""],["Alessandretti","Laura",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 11:16:34 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 08:47:46 GMT"}],"updateDate":"2024-07-25","timestamp":1719659794000,"abstract":"  Segregation is a key challenge in promoting more diverse and inclusive\ncities. Research based on smartphone data has revealed that segregation can\nextend beyond residential areas into everyday activities like visiting shops\nand restaurants. The impact of these activities on segregation, however, is\nunclear. Some studies suggest that they promote mixing, while others indicate\nthey reinforce segregation. Here, we elucidate how day-to-day mobility shapes\noverall segregation levels, looking at the distinctive segregation experienced\nby native and foreign-born individuals. Our study is based on ~320,000\nsmartphone trajectories collected in Sweden, where immigration creates profound\ndivides. We find that while mobility levels generally promote mixing for\nnative-born individuals, foreign-born individuals remain segregated in their\nout-of-home activities. Using counterfactual simulations, we show that this\nheterogeneous effect of mobility on experienced segregation results mainly from\ntwo mechanisms: homophily and limited travel, i.e., foreign-born individuals\n(i) prefer destinations visited by similar individuals, and (ii) have limited\nmobility ranges. We show that homophily plays a minor role, while limited\nmobility, associated with reduced transport access, limits opportunities for\nforeign-born to diversify their encounters. Our findings reconcile conflicting\nliterature and suggest that enhancing transport accessibility in foreign-born\nareas could reduce social segregation.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}