{"id":"2407.03055","title":"Investigation of injector-coupled combustion dynamics in a\n  methane-oxygen combustor using large eddy simulation and dynamic mode\n  decomposition","authors":"Abhishek Sharma, Ashoke De, Sunil Kumar","authorsParsed":[["Sharma","Abhishek",""],["De","Ashoke",""],["Kumar","Sunil",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 12:24:06 GMT"}],"updateDate":"2024-07-04","timestamp":1720009446000,"abstract":"  This paper uses a reactive flow large eddy simulation (LES) and decomposition\ntechniques to study combustion instabilities in a methane-oxygen combustor.\nThis work examines two case scenarios to elucidate the significance of\ninjector-chamber frequency coupling as the cause of thermo-acoustic\ninstability. Initial investigation in a well-known benchmark case of the\ncontinuously variable resonance combustor (CVRC) reports the potential\ninstability mechanisms and the role of injector-chamber frequency coupling in\nthermo-acoustic instability. Subsequently, the multi-element rocket combustor\ncase study identifies the critical resonant modes and highlights potential\nfrequency coupling between the injector and the chamber region. The interplay\nbetween longitudinal pressure oscillations in the oxidizer post and transverse\npressure waves in the chamber is responsible for the enhanced pressure dynamics\nin the combustor. The present work uses the dynamic mode decomposition (DMD)\ntechnique to reveal the evolution of acoustic modes in injector and chamber for\nCVRC and multi-element combustor. The dominant pressure mode forms found by DMD\nanalysis also showcase the role of injector-chamber frequency coupling in\namplified combustion dynamics. The results demonstrate how the predominant\ncause of combustion instability in rocket combustors can be effectively\ndetermined using the high-fidelity LES framework in conjunction with the modal\ndecomposition technique.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}