{"id":"2407.12211","title":"On the Calibration of Epistemic Uncertainty: Principles, Paradoxes and\n  Conflictual Loss","authors":"Mohammed Fellaji, Fr\\'ed\\'eric Pennerath, Brieuc Conan-Guez and Miguel\n  Couceiro","authorsParsed":[["Fellaji","Mohammed",""],["Pennerath","Frédéric",""],["Conan-Guez","Brieuc",""],["Couceiro","Miguel",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 23:21:28 GMT"}],"updateDate":"2024-07-18","timestamp":1721172088000,"abstract":"  The calibration of predictive distributions has been widely studied in deep\nlearning, but the same cannot be said about the more specific epistemic\nuncertainty as produced by Deep Ensembles, Bayesian Deep Networks, or\nEvidential Deep Networks. Although measurable, this form of uncertainty is\ndifficult to calibrate on an objective basis as it depends on the prior for\nwhich a variety of choices exist. Nevertheless, epistemic uncertainty must in\nall cases satisfy two formal requirements: first, it must decrease when the\ntraining dataset gets larger and, second, it must increase when the model\nexpressiveness grows. Despite these expectations, our experimental study shows\nthat on several reference datasets and models, measures of epistemic\nuncertainty violate these requirements, sometimes presenting trends completely\nopposite to those expected. These paradoxes between expectation and reality\nraise the question of the true utility of epistemic uncertainty as estimated by\nthese models. A formal argument suggests that this disagreement is due to a\npoor approximation of the posterior distribution rather than to a flaw in the\nmeasure itself. Based on this observation, we propose a regularization function\nfor deep ensembles, called conflictual loss in line with the above\nrequirements. We emphasize its strengths by showing experimentally that it\nrestores both requirements of epistemic uncertainty, without sacrificing either\nthe performance or the calibration of the deep ensembles.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}