{"id":"2407.10979","title":"Diffusion Model-based Incentive Mechanism with Prospect Theory for Edge\n  AIGC Services in 6G IoT","authors":"Jinbo Wen, Jiangtian Nie, Yue Zhong, Changyan Yi, Xiaohuan Li,\n  Jiangming Jin, Yang Zhang, and Dusit Niyato","authorsParsed":[["Wen","Jinbo",""],["Nie","Jiangtian",""],["Zhong","Yue",""],["Yi","Changyan",""],["Li","Xiaohuan",""],["Jin","Jiangming",""],["Zhang","Yang",""],["Niyato","Dusit",""]],"versions":[{"version":"v1","created":"Mon, 10 Jun 2024 15:01:50 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 08:26:33 GMT"}],"updateDate":"2024-07-26","timestamp":1718031710000,"abstract":"  The fusion of the Internet of Things (IoT) with Sixth-Generation (6G)\ntechnology has significant potential to revolutionize the IoT landscape. With\nthe ultra-reliable and low-latency communication capabilities of 6G, 6G-IoT\nnetworks can transmit high-quality and diverse data to enhance edge learning.\nArtificial Intelligence-Generated Content (AIGC) harnesses advanced AI\nalgorithms to automatically generate various types of content. The emergence of\nedge AIGC integrates with edge networks, facilitating real-time provision of\ncustomized AIGC services by deploying AIGC models on edge devices. However, the\ncurrent practice of edge devices as AIGC Service Providers (ASPs) lacks\nincentives, hindering the sustainable provision of high-quality edge AIGC\nservices amidst information asymmetry. In this paper, we develop a user-centric\nincentive mechanism framework for edge AIGC services in 6G-IoT networks.\nSpecifically, we first propose a contract theory model for incentivizing ASPs\nto provide AIGC services to clients. Recognizing the irrationality of clients\ntowards personalized AIGC services, we utilize Prospect Theory (PT) to capture\ntheir subjective utility better. Furthermore, we adopt the diffusion-based soft\nactor-critic algorithm to generate the optimal contract design under PT,\noutperforming traditional deep reinforcement learning algorithms. Our numerical\nresults demonstrate the effectiveness of the proposed scheme.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}