{"id":"2407.08682","title":"Jet Tagging with More-Interaction Particle Transformer","authors":"Yifan Wu, Kun Wang, Congqiao Li, Huilin Qu, Jingya Zhu","authorsParsed":[["Wu","Yifan",""],["Wang","Kun",""],["Li","Congqiao",""],["Qu","Huilin",""],["Zhu","Jingya",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:14:52 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 01:51:31 GMT"}],"updateDate":"2024-08-20","timestamp":1720718092000,"abstract":"  In this study, we introduce the More-Interaction Particle Transformer\n(MIParT), a novel deep learning neural network designed for jet tagging. This\nframework incorporates our own design, the More-Interaction Attention (MIA)\nmechanism, which increases the dimensionality of particle interaction\nembeddings. We tested MIParT using the top tagging and quark-gluon datasets.\nOur results show that MIParT not only matches the accuracy and AUC of\nLorentzNet and a series of Lorentz-equivariant methods, but also significantly\noutperforms the ParT model in background rejection. Specifically, it improves\nbackground rejection by approximately 25% at a 30% signal efficiency on the top\ntagging dataset and by 3% on the quark-gluon dataset. Additionally, MIParT\nrequires only 30% of the parameters and 53% of the computational complexity\nneeded by ParT, proving that high performance can be achieved with reduced\nmodel complexity. For very large datasets, we double the dimension of particle\nembeddings, referring to this variant as MIParT-Large (MIParT-L). We find that\nMIParT-L can further capitalize on the knowledge from large datasets. From a\nmodel pre-trained on the 100M JetClass dataset, the background rejection\nperformance of the fine-tuned MIParT-L improved by 39% on the top tagging\ndataset and by 6% on the quark-gluon dataset, surpassing that of the fine-tuned\nParT. Specifically, the background rejection of fine-tuned MIParT-L improved by\nan additional 2% compared to the fine-tuned ParT. The results suggest that\nMIParT has the potential to advance efficiency benchmarks for jet tagging and\nevent identification in particle physics.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5HRDFKQ1jntvK-sZVsc8eirW2To5RIDqpPfUKcs36WM","pdfSize":"675303"}
