{"id":"2407.21716","title":"Revisiting the fundamental metallicity relation with observation and\n  simulation","authors":"Chengyu Ma, Kai Wang, Enci Wang, Yingjie Peng, Haochen Jiang, Haoran\n  Yu, Cheng Jia, Zeyu Chen, Haixin Li, Xu Kong","authorsParsed":[["Ma","Chengyu",""],["Wang","Kai",""],["Wang","Enci",""],["Peng","Yingjie",""],["Jiang","Haochen",""],["Yu","Haoran",""],["Jia","Cheng",""],["Chen","Zeyu",""],["Li","Haixin",""],["Kong","Xu",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 16:07:42 GMT"}],"updateDate":"2024-08-09","timestamp":1722442062000,"abstract":"  The gas-phase metallicity of galaxies is regulated by multiple astrophysical\nprocesses, which makes it a crucial diagnostic of galaxy formation and\nevolution. Beyond the fundamental mass-metallicity relation, a debate about the\nsecondary galaxy property to predict the metallicity of galaxies arises.\nMotivated by this, we systematically examine the relationship between gas-phase\nmetallicity and other galaxy properties, i.e. star formation rate (SFR) and\ngalaxy size, in addition to stellar mass in both observation and simulation. We\nutilize the data from the MaNGA (Mapping Nearby Galaxies at Apache Point\nObservatory) survey and the TNG50 simulations. We find that the combination of\n$M_*/R_{\\rm e}^\\beta$ with $\\beta\\sim 0.6-1$ is in much stronger correlation to\nthe metallicity than stellar mass alone, regardless of whether the SFR is\nincluded or not, in both observation and simulation. This indicates that galaxy\nsize plays a more important role in determining gas-phase metallicity of\ngalaxies than SFR. In addition, the TNG simulation predicts that the SFR,\nalthough being a subdominant role, becomes increasingly important in high-$z$\nuniverse. Finally, we speculate that SFR modulates metallicity on the temporal\ndimension, synchronized with time-varying gas inflows, and galaxy size\nregulates metallicity on the spatial dimension by affecting the gravitational\npotential and the mass loading factor.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}