{"id":"2407.10671","title":"Qwen2 Technical Report","authors":"An Yang, Baosong Yang, Binyuan Hui, Bo Zheng, Bowen Yu, Chang Zhou,\n  Chengpeng Li, Chengyuan Li, Dayiheng Liu, Fei Huang, Guanting Dong, Haoran\n  Wei, Huan Lin, Jialong Tang, Jialin Wang, Jian Yang, Jianhong Tu, Jianwei\n  Zhang, Jianxin Ma, Jianxin Yang, Jin Xu, Jingren Zhou, Jinze Bai, Jinzheng\n  He, Junyang Lin, Kai Dang, Keming Lu, Keqin Chen, Kexin Yang, Mei Li,\n  Mingfeng Xue, Na Ni, Pei Zhang, Peng Wang, Ru Peng, Rui Men, Ruize Gao, Runji\n  Lin, Shijie Wang, Shuai Bai, Sinan Tan, Tianhang Zhu, Tianhao Li, Tianyu Liu,\n  Wenbin Ge, Xiaodong Deng, Xiaohuan Zhou, Xingzhang Ren, Xinyu Zhang, Xipin\n  Wei, Xuancheng Ren, Xuejing Liu, Yang Fan, Yang Yao, Yichang Zhang, Yu Wan,\n  Yunfei Chu, Yuqiong Liu, Zeyu Cui, Zhenru Zhang, Zhifang Guo, Zhihao Fan","authorsParsed":[["Yang","An",""],["Yang","Baosong",""],["Hui","Binyuan",""],["Zheng","Bo",""],["Yu","Bowen",""],["Zhou","Chang",""],["Li","Chengpeng",""],["Li","Chengyuan",""],["Liu","Dayiheng",""],["Huang","Fei",""],["Dong","Guanting",""],["Wei","Haoran",""],["Lin","Huan",""],["Tang","Jialong",""],["Wang","Jialin",""],["Yang","Jian",""],["Tu","Jianhong",""],["Zhang","Jianwei",""],["Ma","Jianxin",""],["Yang","Jianxin",""],["Xu","Jin",""],["Zhou","Jingren",""],["Bai","Jinze",""],["He","Jinzheng",""],["Lin","Junyang",""],["Dang","Kai",""],["Lu","Keming",""],["Chen","Keqin",""],["Yang","Kexin",""],["Li","Mei",""],["Xue","Mingfeng",""],["Ni","Na",""],["Zhang","Pei",""],["Wang","Peng",""],["Peng","Ru",""],["Men","Rui",""],["Gao","Ruize",""],["Lin","Runji",""],["Wang","Shijie",""],["Bai","Shuai",""],["Tan","Sinan",""],["Zhu","Tianhang",""],["Li","Tianhao",""],["Liu","Tianyu",""],["Ge","Wenbin",""],["Deng","Xiaodong",""],["Zhou","Xiaohuan",""],["Ren","Xingzhang",""],["Zhang","Xinyu",""],["Wei","Xipin",""],["Ren","Xuancheng",""],["Liu","Xuejing",""],["Fan","Yang",""],["Yao","Yang",""],["Zhang","Yichang",""],["Wan","Yu",""],["Chu","Yunfei",""],["Liu","Yuqiong",""],["Cui","Zeyu",""],["Zhang","Zhenru",""],["Guo","Zhifang",""],["Fan","Zhihao",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 12:35:42 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 16:29:30 GMT"},{"version":"v3","created":"Thu, 18 Jul 2024 02:39:24 GMT"},{"version":"v4","created":"Tue, 10 Sep 2024 13:25:53 GMT"}],"updateDate":"2024-09-11","timestamp":1721046942000,"abstract":"  This report introduces the Qwen2 series, the latest addition to our large\nlanguage models and large multimodal models. We release a comprehensive suite\nof foundational and instruction-tuned language models, encompassing a parameter\nrange from 0.5 to 72 billion, featuring dense models and a Mixture-of-Experts\nmodel. Qwen2 surpasses most prior open-weight models, including its predecessor\nQwen1.5, and exhibits competitive performance relative to proprietary models\nacross diverse benchmarks on language understanding, generation, multilingual\nproficiency, coding, mathematics, and reasoning.\n  The flagship model, Qwen2-72B, showcases remarkable performance: 84.2 on\nMMLU, 37.9 on GPQA, 64.6 on HumanEval, 89.5 on GSM8K, and 82.4 on BBH as a base\nlanguage model. The instruction-tuned variant, Qwen2-72B-Instruct, attains 9.1\non MT-Bench, 48.1 on Arena-Hard, and 35.7 on LiveCodeBench. Moreover, Qwen2\ndemonstrates robust multilingual capabilities, proficient in approximately 30\nlanguages, spanning English, Chinese, Spanish, French, German, Arabic, Russian,\nKorean, Japanese, Thai, Vietnamese, and more, underscoring its versatility and\nglobal reach.\n  To foster community innovation and accessibility, we have made the Qwen2\nmodel weights openly available on Hugging Face and ModelScope, and the\nsupplementary materials including example code on GitHub. These platforms also\ninclude resources for quantization, fine-tuning, and deployment, facilitating a\nwide range of applications and research endeavors.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}