{"id":"2407.01258","title":"Physics-Inspired Deep Learning and Transferable Models for Bridge Scour\n  Prediction","authors":"Negin Yousefpour, Bo Wang","authorsParsed":[["Yousefpour","Negin",""],["Wang","Bo",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:08:09 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 03:55:11 GMT"},{"version":"v3","created":"Tue, 10 Sep 2024 03:07:19 GMT"}],"updateDate":"2024-09-11","timestamp":1719839289000,"abstract":"  This paper introduces scour physics-inspired neural networks (SPINNs), a\nhybrid physics-data-driven framework for bridge scour prediction using deep\nlearning. SPINNs integrate physics-based, empirical equations into deep neural\nnetworks and are trained using site-specific historical scour monitoring data.\nLong-short Term Memory Network (LSTM) and Convolutional Neural Network (CNN)\nare considered as the base deep learning (DL) models. We also explore\ntransferable/general models, trained by aggregating datasets from a cluster of\nbridges, versus the site/bridge-specific models. Despite variation in\nperformance, SPINNs outperformed pure data-driven models in the majority of\ncases. In some bridge cases, SPINN reduced forecasting errors by up to 50\npercent. The pure data-driven models showed better transferability compared to\nhybrid models. The transferable DL models particularly proved effective for\nbridges with limited data. In addition, the calibrated time-dependent empirical\nequations derived from SPINNs showed great potential for maximum scour depth\nestimation, providing more accurate predictions compared to commonly used\nHEC-18 model. Comparing SPINNs with traditional empirical models indicates\nsubstantial improvements in scour prediction accuracy. This study can pave the\nway for further exploration of physics-inspired machine learning methods for\nscour prediction.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}