{"id":"2407.11768","title":"Independent Set Reconfiguration Under Bounded-Hop Token","authors":"Hiroki Hatano, Naoki Kitamura, Taisuke Izumi, Takehiro Ito, Toshimitsu\n  Masuzawa","authorsParsed":[["Hatano","Hiroki",""],["Kitamura","Naoki",""],["Izumi","Taisuke",""],["Ito","Takehiro",""],["Masuzawa","Toshimitsu",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:28:18 GMT"}],"updateDate":"2024-07-17","timestamp":1721140098000,"abstract":"  The independent set reconfiguration problem (ISReconf) is the problem of\ndetermining, for given independent sets I_s and I_t of a graph G, whether I_s\ncan be transformed into I_t by repeatedly applying a prescribed reconfiguration\nrule that transforms an independent set to another. As reconfiguration rules\nfor the ISReconf, the Token Sliding (TS) model and the Token Jumping (TJ) model\nare commonly considered. While the TJ model admits the addition of any vertex\n(as far as the addition yields an independent set), the TS model admits the\naddition of only a neighbor of the removed vertex. It is known that the\ncomplexity status of the ISReconf differs between the TS and TJ models for some\ngraph classes.\n  In this paper, we analyze how changes in reconfiguration rules affect the\ncomputational complexity of reconfiguration problems. To this end, we\ngeneralize the TS and TJ models to a unified reconfiguration rule, called the\nk-Jump model, which admits the addition of a vertex within distance k from the\nremoved vertex. Then, the TS and TJ models are the 1-Jump and D(G)-Jump models,\nrespectively, where D(G) denotes the diameter of a connected graph G. We give\nthe following three results: First, we show that the computational complexity\nof the ISReconf under the k-Jump model for general graphs is equivalent for all\nk >= 3. Second, we present a polynomial-time algorithm to solve the ISReconf\nunder the 2-Jump model for split graphs. We note that the ISReconf under the\n1-Jump (i.e., TS) model is PSPACE-complete for split graphs, and hence the\ncomplexity status of the ISReconf differs between k = 1 and k = 2. Third, we\nconsider the optimization variant of the ISReconf, which computes the minimum\nnumber of steps of any transformation between Is and It. We prove that this\noptimization variant under the k-Jump model is NP-complete for chordal graphs\nof diameter at most 2k + 1, for any k >=3.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}