{"id":"2407.09540","title":"Prompting Whole Slide Image Based Genetic Biomarker Prediction","authors":"Ling Zhang, Boxiang Yun, Xingran Xie, Qingli Li, Xinxing Li, Yan Wang","authorsParsed":[["Zhang","Ling",""],["Yun","Boxiang",""],["Xie","Xingran",""],["Li","Qingli",""],["Li","Xinxing",""],["Wang","Yan",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 11:05:46 GMT"}],"updateDate":"2024-07-16","timestamp":1719399946000,"abstract":"  Prediction of genetic biomarkers, e.g., microsatellite instability and BRAF\nin colorectal cancer is crucial for clinical decision making. In this paper, we\npropose a whole slide image (WSI) based genetic biomarker prediction method via\nprompting techniques. Our work aims at addressing the following challenges: (1)\nextracting foreground instances related to genetic biomarkers from gigapixel\nWSIs, and (2) the interaction among the fine-grained pathological components in\nWSIs.Specifically, we leverage large language models to generate medical\nprompts that serve as prior knowledge in extracting instances associated with\ngenetic biomarkers. We adopt a coarse-to-fine approach to mine biomarker\ninformation within the tumor microenvironment. This involves extracting\ninstances related to genetic biomarkers using coarse medical prior knowledge,\ngrouping pathology instances into fine-grained pathological components and\nmining their interactions. Experimental results on two colorectal cancer\ndatasets show the superiority of our method, achieving 91.49% in AUC for MSI\nclassification. The analysis further shows the clinical interpretability of our\nmethod. Code is publicly available at\nhttps://github.com/DeepMed-Lab-ECNU/PromptBio.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Quantitative Biology/Tissues and Organs"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4E3J6Mv4aSvkDhQTG4fYg9MK89YoGuTRydya3C1Z5HI","pdfSize":"1465472"}
