{"id":"2407.11115","title":"Q-Balls in the presence of attractive force","authors":"Yu Hamada, Kiyoharu Kawana, TaeHun Kim, Philip Lu","authorsParsed":[["Hamada","Yu",""],["Kawana","Kiyoharu",""],["Kim","TaeHun",""],["Lu","Philip",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:00:01 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 02:30:37 GMT"}],"updateDate":"2024-09-04","timestamp":1721066401000,"abstract":"  Q-balls are non-topological solitons in field theories whose stability is\ntypically guaranteed by the existence of a global conserved charge. A classic\nrealization is the Friedberg-Lee-Sirlin (FLS) Q-ball in a two-scalar system\nwhere a real scalar $\\chi$ triggers symmetry breaking and confines a complex\nscalar $\\Phi$ with a global $U(1)$ symmetry. A quartic interaction $\\kappa\n\\chi^2|\\Phi|^2$ with $\\kappa>0$ is usually considered to produce a nontrivial\nQ-ball configuration, and this repulsive force contributes to its stability. On\nthe other hand, the attractive cubic interaction $\\Lambda \\chi |\\Phi|^2$ is\ngenerally allowed in a renormalizable theory and could induce an instability.\nIn this paper, we study the behavior of the Q-ball under the influence of this\nattractive force which has been overlooked. We find approximate Q-ball\nsolutions in the limit of weak and moderate force couplings using the thin-wall\nand thick-wall approximations respectively. Our analytical results are\nconsistent with numerical simulations and predict the parameter dependencies of\nthe maximum charge. A crucial difference with the ordinary FLS Q-ball is the\nexistence of the maximum charge beyond which the Q-ball solution is classically\nunstable. Such a limitation of the charge fundamentally affects Q-ball\nformation in the early Universe and could plausibly lead to the formation of\nprimordial black holes.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}