{"id":"2407.03915","title":"On the nature of the 2.4 hr-period eclipsing cataclysmic variable W2 in\n  47 Tuc","authors":"R. Amato, N. La Palombara, M. Imbrogno, G. L. Israel, P. Esposito, D.\n  de Martino, N. A. Webb, R. Iaria","authorsParsed":[["Amato","R.",""],["La Palombara","N.",""],["Imbrogno","M.",""],["Israel","G. L.",""],["Esposito","P.",""],["de Martino","D.",""],["Webb","N. A.",""],["Iaria","R.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 13:20:52 GMT"}],"updateDate":"2024-09-18","timestamp":1720099252000,"abstract":"  W2 (CXOGlb J002415.8-720436) is a cataclysmic variable (CV) in the Galactic\nglobular cluster 47 Tucanae. Its modulation was discovered within the CATS@BAR\nproject. The source shows all the properties of magnetic CVs, but whether it is\na polar or an intermediate polar is still a matter of debate. This paper\ninvestigates the spectral and temporal properties of the source, using all\narchival X-ray data from Chandra and eROSITA Early Data Release, to establish\nwhether the source falls within the category of polars or intermediate polars.\nWe fitted Chandra archival spectra with three different models: a power law, a\nbremsstrahlung and an optically thin thermal plasma. We also explored the\ntemporal properties of the source with searches for pulsations with a power\nspectral density analysis and a Rayleigh test ($Z_n^2$). W2 displays a mean\nluminosity of $\\sim 10^{32}$ erg s$^{-1}$ over a 20-year span, despite lower\nvalues in a few epochs. The source is not detected in the latest observation,\ntaken with Chandra in 2022, and we infer an X-ray luminosity $\\leq 7 \\times\n10^{31}$ erg s$^{-1}$. The source spectral shape does not change over time and\ncan be equally well fitted with each of the three models, with a best-fit\nphoton index of 1.6 for the power law and best-fit temperatures of 10 keV for\nboth the bremsstrahlung and the thermal plasma models. We confirm the\npreviously detected period of 8649 s, ascribed to the binary orbital period,\nand found a cycle-to-cycle variability associated with this periodicity. No\nother significant pulsation is detected. Considering the source orbital period,\nluminosity, spectral characteristics, long-term evolution and strong\ncycle-to-cycle variability, we suggest that W2 is a magnetic CV of the polar\ntype.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}