{"id":"2407.10830","title":"Almost-Linear Time Algorithms for Decremental Graphs: Min-Cost Flow and\n  More via Duality","authors":"Jan van den Brand and Li Chen and Rasmus Kyng and Yang P. Liu and\n  Simon Meierhans and Maximilian Probst Gutenberg and Sushant Sachdeva","authorsParsed":[["Brand","Jan van den",""],["Chen","Li",""],["Kyng","Rasmus",""],["Liu","Yang P.",""],["Meierhans","Simon",""],["Gutenberg","Maximilian Probst",""],["Sachdeva","Sushant",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 15:42:54 GMT"}],"updateDate":"2024-07-16","timestamp":1721058174000,"abstract":"  We give the first almost-linear total time algorithm for deciding if a flow\nof cost at most $F$ still exists in a directed graph, with edge costs and\ncapacities, undergoing decremental updates, i.e., edge deletions, capacity\ndecreases, and cost increases. This implies almost-linear time algorithms for\napproximating the minimum-cost flow value and $s$-$t$ distance on such\ndecremental graphs. Our framework additionally allows us to maintain\ndecremental strongly connected components in almost-linear time\ndeterministically. These algorithms also improve over the current best known\nruntimes for statically computing minimum-cost flow, in both the randomized and\ndeterministic settings.\n  We obtain our algorithms by taking the dual perspective, which yields\ncut-based algorithms. More precisely, our algorithm computes the flow via a\nsequence of $m^{1+o(1)}$ dynamic min-ratio cut problems, the dual analog of the\ndynamic min-ratio cycle problem that underlies recent fast algorithms for\nminimum-cost flow. Our main technical contribution is a new data structure that\nreturns an approximately optimal min-ratio cut in amortized $m^{o(1)}$ time by\nmaintaining a tree-cut sparsifier. This is achieved by devising a new algorithm\nto maintain the dynamic expander hierarchy of [Goranci-R\\\"{a}cke-Saranurak-Tan,\nSODA 2021] that also works in capacitated graphs. All our algorithms are\ndeterministc, though they can be sped up further using randomized techniques\nwhile still working against an adaptive adversary.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}