{"id":"2407.08603","title":"Magnetic, thermodynamic and dynamical properties of the\n  three-dimensional fermionic Hubbard model: a comprehensive Monte Carlo study","authors":"Yu-Feng Song, Youjin Deng, Yuan-Yao He","authorsParsed":[["Song","Yu-Feng",""],["Deng","Youjin",""],["He","Yuan-Yao",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 15:29:21 GMT"}],"updateDate":"2024-07-12","timestamp":1720711761000,"abstract":"  The interplay between quantum and thermal fluctuations can induce rich\nphenomena at finite temperatures in strongly correlated fermion systems. Here\nwe report a {\\it numerically exact} auxiliary-field quantum Monte Carlo (AFQMC)\nstudy for the finite-temperature properties of three-dimensional repulsive\nHubbard model at half filling. We concentrate on the complete\ntemperature-interaction strength phase diagram of the model, which contains the\nlow-temperature antiferromagnetic (AFM) long-range ordered phase and\nmetal-insulator crossover (MIC) in the paramagnetic phase. Enabling access to\nunprecedented system sizes up to $20^3$, we achieve highly accurate results of\nthe N\\'{e}el transition temperature for representative values of on-site\ninteraction $U$ via finite-size analysis of AFM structure factor. To\nquantitatively characterize the MIC above the N\\'{e}el transition, we have\ndeveloped fully new techniques allowing to compute the thermal entropy versus\n$U$ at fixed temperature and to directly calculate the $U$-derivative of double\noccupancy in AFQMC simulations. Then combining variously thermodynamic and\ndynamical observables, we establish an efficient scheme to precisely determine\nthe boundaries for the MIC by cross-checking different observables. We also\ndemonstrate the temperature dependence of many commonly used observables. Away\nfrom half filling, we explore the behavior of the sign problem and AFM spin\ncorrelation versus hole doping, and demonstrate the persistance of N\\'{e}el AFM\nordered phase to finite doping with limited results.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Quantum Gases"],"license":"http://creativecommons.org/licenses/by/4.0/"}