{"id":"2407.12497","title":"Cell-Free Massive MIMO Surveillance of Multiple Untrusted Communication\n  Links","authors":"Zahra Mobini, Hien Quoc Ngo, Michail Matthaiou, and Lajos Hanzo","authorsParsed":[["Mobini","Zahra",""],["Ngo","Hien Quoc",""],["Matthaiou","Michail",""],["Hanzo","Lajos",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 11:25:25 GMT"}],"updateDate":"2024-07-18","timestamp":1721215525000,"abstract":"  A cell-free massive multiple-input multiple-output (CF-mMIMO) system is\nconsidered for enhancing the monitoring performance of wireless surveillance,\nwhere a large number of distributed multi-antenna aided legitimate monitoring\nnodes (MNs) proactively monitor multiple distributed untrusted communication\nlinks. We consider two types of MNs whose task is to either observe the\nuntrusted transmitters or jam the untrusted receivers. We first analyze the\nperformance of CF-mMIMO surveillance relying on both maximum ratio (MR) and\npartial zero-forcing (PZF) combining schemes and derive closed-form expressions\nfor the monitoring success probability (MSP) of the MNs. We then propose a\njoint optimization technique that designs the MN mode assignment, power\ncontrol, and MN-weighting coefficient control to enhance the MSP based on the\nlong-term statistical channel state information knowledge. This challenging\nproblem is effectively transformed into tractable forms and efficient\nalgorithms are proposed for solving them. Numerical results show that our\nproposed CF-mMIMO surveillance system considerably improves the monitoring\nperformance with respect to a full-duplex co-located massive MIMO proactive\nmonitoring system. More particularly, when the untrusted pairs are distributed\nover a wide area and use the MR combining, the proposed solution provides\nnearly a thirty-fold improvement in the minimum MSP over the co-located massive\nMIMO baseline, and forty-fold improvement, when the PZF combining is employed.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7Vb9n731fnJ0EKagAa86-wPmBN5zm5x5hxb9XxBcJNA","pdfSize":"1740002"}
