{"id":"2407.14041","title":"Not All Noises Are Created Equally:Diffusion Noise Selection and\n  Optimization","authors":"Zipeng Qi, Lichen Bai, Haoyi Xiong, Zeke Xie","authorsParsed":[["Qi","Zipeng",""],["Bai","Lichen",""],["Xiong","Haoyi",""],["Xie","Zeke",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 05:36:22 GMT"},{"version":"v2","created":"Sat, 27 Jul 2024 14:22:56 GMT"}],"updateDate":"2024-07-30","timestamp":1721367382000,"abstract":"  Diffusion models that can generate high-quality data from randomly sampled\nGaussian noises have become the mainstream generative method in both academia\nand industry. Are randomly sampled Gaussian noises equally good for diffusion\nmodels? While a large body of works tried to understand and improve diffusion\nmodels, previous works overlooked the possibility to select or optimize the\nsampled noise the possibility of selecting or optimizing sampled noises for\nimproving diffusion models. In this paper, we mainly made three contributions.\nFirst, we report that not all noises are created equally for diffusion models.\nWe are the first to hypothesize and empirically observe that the generation\nquality of diffusion models significantly depend on the noise inversion\nstability. This naturally provides us a noise selection method according to the\ninversion stability. Second, we further propose a novel noise optimization\nmethod that actively enhances the inversion stability of arbitrary given\nnoises. Our method is the first one that works on noise space to generally\nimprove generated results without fine-tuning diffusion models. Third, our\nextensive experiments demonstrate that the proposed noise selection and noise\noptimization methods both significantly improve representative diffusion\nmodels, such as SDXL and SDXL-turbo, in terms of human preference and other\nobjective evaluation metrics. For example, the human preference winning rates\nof noise selection and noise optimization over the baselines can be up to 57%\nand 72.5%, respectively, on DrawBench.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}