{"id":"2407.09411","title":"Ambiguous Resonances in Multipulse Quantum Sensing with Nitrogen Vacancy\n  Centers","authors":"Lucas Tsunaki, Anmol Singh, Kseniia Volkova, Sergei Trofimov, Tommaso\n  Pregnolato, Tim Schr\\\"oder, Boris Naydenov","authorsParsed":[["Tsunaki","Lucas",""],["Singh","Anmol",""],["Volkova","Kseniia",""],["Trofimov","Sergei",""],["Pregnolato","Tommaso",""],["Schröder","Tim",""],["Naydenov","Boris",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 16:35:36 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 09:02:14 GMT"}],"updateDate":"2024-07-26","timestamp":1720802136000,"abstract":"  Dynamical decoupling multipulse sequences can be applied to solid state spins\nfor sensing weak oscillating fields from nearby single nuclear spins. By\nperiodically reversing the probing system's evolution, other noises are\ncounteracted and filtered out over the total evolution. However, the technique\nis subject to intricate interactions resulting in additional resonant\nresponses, which can be misinterpreted with the actual signal intended to be\nmeasured. We experimentally characterized three of these effects present in\nsingle nitrogen vacancy centers in diamond, where we also developed a numerical\nsimulations model without rotating wave approximations, showing robust\ncorrelation to the experimental data. Regarding centers with the $^{15}$N\nnitrogen isotope, we observed that a small misalignment in the bias magnetic\nfield causes the precession of the nitrogen nuclear spin to be sensed by the\nelectronic spin of the center. Another studied case of ambiguous resonances\ncomes from the coupling with lattice $^{13}$C nuclei, where we reconstructed\nthe interaction Hamiltonian based on echo modulation frequencies and used this\nHamiltonian to simulate multipulse sequences. Finally, we also measured and\nsimulated the effects from the free evolution of the quantum system during\nfinite pulse durations. Due to the large data volume and the strong dependency\nof these ambiguous resonances with specific experimental parameters, we provide\na simulations dataset with a user-friendly graphical interface, where users can\ncompare simulations with their own experimental data for spectral\ndisambiguation. Although focused with nitrogen vacancy centers and dynamical\ndecoupling sequences, these results and the developed model can potentially be\napplied to other solid state spins and quantum sensing techniques.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Other Condensed Matter"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"spE7RHOT_0fcI_j2rpTehvjzPBasVO8fK-fEQnpR0Rs","pdfSize":"1711036"}
