{"id":"2407.01349","title":"PanopticRecon: Leverage Open-vocabulary Instance Segmentation for\n  Zero-shot Panoptic Reconstruction","authors":"Xuan Yu, Yili Liu, Chenrui Han, Sitong Mao, Shunbo Zhou, Rong Xiong,\n  Yiyi Liao, Yue Wang","authorsParsed":[["Yu","Xuan",""],["Liu","Yili",""],["Han","Chenrui",""],["Mao","Sitong",""],["Zhou","Shunbo",""],["Xiong","Rong",""],["Liao","Yiyi",""],["Wang","Yue",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:06:04 GMT"}],"updateDate":"2024-07-02","timestamp":1719846364000,"abstract":"  Panoptic reconstruction is a challenging task in 3D scene understanding.\nHowever, most existing methods heavily rely on pre-trained semantic\nsegmentation models and known 3D object bounding boxes for 3D panoptic\nsegmentation, which is not available for in-the-wild scenes. In this paper, we\npropose a novel zero-shot panoptic reconstruction method from RGB-D images of\nscenes. For zero-shot segmentation, we leverage open-vocabulary instance\nsegmentation, but it has to face partial labeling and instance association\nchallenges. We tackle both challenges by propagating partial labels with the\naid of dense generalized features and building a 3D instance graph for\nassociating 2D instance IDs. Specifically, we exploit partial labels to learn a\nclassifier for generalized semantic features to provide complete labels for\nscenes with dense distilled features. Moreover, we formulate instance\nassociation as a 3D instance graph segmentation problem, allowing us to fully\nutilize the scene geometry prior and all 2D instance masks to infer global\nunique pseudo 3D instance ID. Our method outperforms state-of-the-art methods\non the indoor dataset ScanNet V2 and the outdoor dataset KITTI-360,\ndemonstrating the effectiveness of our graph segmentation method and\nreconstruction network.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/"}