{"id":"2407.00299","title":"Human-Agent Joint Learning for Efficient Robot Manipulation Skill\n  Acquisition","authors":"Shengcheng Luo, Quanquan Peng, Jun Lv, Kaiwen Hong, Katherine Rose\n  Driggs-Campbell, Cewu Lu, Yong-Lu Li","authorsParsed":[["Luo","Shengcheng",""],["Peng","Quanquan",""],["Lv","Jun",""],["Hong","Kaiwen",""],["Driggs-Campbell","Katherine Rose",""],["Lu","Cewu",""],["Li","Yong-Lu",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 03:37:29 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 11:15:11 GMT"}],"updateDate":"2024-07-04","timestamp":1719632249000,"abstract":"  Employing a teleoperation system for gathering demonstrations offers the\npotential for more efficient learning of robot manipulation. However,\nteleoperating a robot arm equipped with a dexterous hand or gripper, via a\nteleoperation system poses significant challenges due to its high\ndimensionality, complex motions, and differences in physiological structure.\n  In this study, we introduce a novel system for joint learning between human\noperators and robots, that enables human operators to share control of a robot\nend-effector with a learned assistive agent, facilitating simultaneous human\ndemonstration collection and robot manipulation teaching. In this setup, as\ndata accumulates, the assistive agent gradually learns. Consequently, less\nhuman effort and attention are required, enhancing the efficiency of the data\ncollection process. It also allows the human operator to adjust the control\nratio to achieve a trade-off between manual and automated control.\n  We conducted experiments in both simulated environments and physical\nreal-world settings. Through user studies and quantitative evaluations, it is\nevident that the proposed system could enhance data collection efficiency and\nreduce the need for human adaptation while ensuring the collected data is of\nsufficient quality for downstream tasks. Videos are available at\nhttps://norweig1an.github.io/human-agent-joint-learning.github.io/.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}