{"id":"2407.15477","title":"Evolution of current and pressure driven instabilities in relativistic\n  jets","authors":"M. Musso, G. Bodo, G. Mamatsashvili, P. Rossi, A. Mignone","authorsParsed":[["Musso","M.",""],["Bodo","G.",""],["Mamatsashvili","G.",""],["Rossi","P.",""],["Mignone","A.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 08:41:06 GMT"}],"updateDate":"2024-07-23","timestamp":1721637666000,"abstract":"  Instabilities in relativistic magnetized jets are thought to be deeply\nconnected to their energy dissipation properties and to the consequent\nacceleration of the non-thermal emitting relativistic particles. Instabilities\nlead to the development of small scale dissipative structures, in which\nmagnetic energy is converted in other forms. In this paper we present\nthree-dimensional numerical simulations of the instability evolution in highly\nmagnetized plasma columns, considering different kinds of equilibria. In fact,\nthe hoop stresses related to the azimuthal component of magnetic field can be\nbalanced either by the magnetic pressure gradient (force-free equilibria, FF)\nor by the thermal pressure gradient (pressure-balanced equilibria, PB) or by a\ncombination of the two. FF equilibria are prone to current-driven instabilities\n(CDI), while PB equilibria are prone to pressure-driven instabilities (PDI). We\nperform a global linear stability analysis, from which we derive the different\ninstability properties in the two regimes, showing that PDI have larger growth\nrates and are also unstable for high wavenumbers. The numerical simulations of\nthe non-linear instability evolution show similar phases of evolution in which\nthe formation of strong current sheets is followed by a turbulent quasi\nsteady-state. PDI are however characterized by a faster evolution, by the\nformation of smaller scale dissipative structures and larger magnetic energy\ndissipation.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Zlkgt2h0AJ0jIxucYZxefpLob4kJQpOL6atVswwbYwk","pdfSize":"11064178"}
