{"id":"2407.07061","title":"Internet of Agents: Weaving a Web of Heterogeneous Agents for\n  Collaborative Intelligence","authors":"Weize Chen, Ziming You, Ran Li, Yitong Guan, Chen Qian, Chenyang Zhao,\n  Cheng Yang, Ruobing Xie, Zhiyuan Liu, Maosong Sun","authorsParsed":[["Chen","Weize",""],["You","Ziming",""],["Li","Ran",""],["Guan","Yitong",""],["Qian","Chen",""],["Zhao","Chenyang",""],["Yang","Cheng",""],["Xie","Ruobing",""],["Liu","Zhiyuan",""],["Sun","Maosong",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 17:33:24 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 15:57:21 GMT"}],"updateDate":"2024-07-11","timestamp":1720546404000,"abstract":"  The rapid advancement of large language models (LLMs) has paved the way for\nthe development of highly capable autonomous agents. However, existing\nmulti-agent frameworks often struggle with integrating diverse capable\nthird-party agents due to reliance on agents defined within their own\necosystems. They also face challenges in simulating distributed environments,\nas most frameworks are limited to single-device setups. Furthermore, these\nframeworks often rely on hard-coded communication pipelines, limiting their\nadaptability to dynamic task requirements. Inspired by the concept of the\nInternet, we propose the Internet of Agents (IoA), a novel framework that\naddresses these limitations by providing a flexible and scalable platform for\nLLM-based multi-agent collaboration. IoA introduces an agent integration\nprotocol, an instant-messaging-like architecture design, and dynamic mechanisms\nfor agent teaming and conversation flow control. Through extensive experiments\non general assistant tasks, embodied AI tasks, and retrieval-augmented\ngeneration benchmarks, we demonstrate that IoA consistently outperforms\nstate-of-the-art baselines, showcasing its ability to facilitate effective\ncollaboration among heterogeneous agents. IoA represents a step towards linking\ndiverse agents in an Internet-like environment, where agents can seamlessly\ncollaborate to achieve greater intelligence and capabilities. Our codebase has\nbeen released at \\url{https://github.com/OpenBMB/IoA}.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}