{"id":"2407.19703","title":"Efficient Byzantine-Robust and Provably Privacy-Preserving Federated\n  Learning","authors":"Chenfei Nie (1), Qiang Li (1), Yuxin Yang (1 and 2), Yuede Ji (3),\n  Binghui Wang (2) ((1) College of Computer Science and Technology, Jilin\n  University, (2) Department of Computer Science, Illinois Institute of\n  Technology, (3) Department of Computer Science and Engineering, University of\n  Texas at Arlington)","authorsParsed":[["Nie","Chenfei","","1 and 2"],["Li","Qiang","","1 and 2"],["Yang","Yuxin","","1 and 2"],["Ji","Yuede",""],["Wang","Binghui",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 04:55:30 GMT"}],"updateDate":"2024-07-30","timestamp":1722228930000,"abstract":"  Federated learning (FL) is an emerging distributed learning paradigm without\nsharing participating clients' private data. However, existing works show that\nFL is vulnerable to both Byzantine (security) attacks and data reconstruction\n(privacy) attacks. Almost all the existing FL defenses only address one of the\ntwo attacks. A few defenses address the two attacks, but they are not efficient\nand effective enough. We propose BPFL, an efficient Byzantine-robust and\nprovably privacy-preserving FL method that addresses all the issues.\nSpecifically, we draw on state-of-the-art Byzantine-robust FL methods and use\nsimilarity metrics to measure the robustness of each participating client in\nFL. The validity of clients are formulated as circuit constraints on similarity\nmetrics and verified via a zero-knowledge proof. Moreover, the client models\nare masked by a shared random vector, which is generated based on homomorphic\nencryption. In doing so, the server receives the masked client models rather\nthan the true ones, which are proven to be private. BPFL is also efficient due\nto the usage of non-interactive zero-knowledge proof. Experimental results on\nvarious datasets show that our BPFL is efficient, Byzantine-robust, and\nprivacy-preserving.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}