{"id":"2407.11955","title":"A Transformer-based Approach for Augmenting Software Engineering\n  Chatbots Datasets","authors":"Ahmad Abdellatif, Khaled Badran, Diego Elias Costa, Emad Shihab","authorsParsed":[["Abdellatif","Ahmad",""],["Badran","Khaled",""],["Costa","Diego Elias",""],["Shihab","Emad",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 17:48:44 GMT"}],"updateDate":"2024-07-17","timestamp":1721152124000,"abstract":"  Background: The adoption of chatbots into software development tasks has\nbecome increasingly popular among practitioners, driven by the advantages of\ncost reduction and acceleration of the software development process. Chatbots\nunderstand users' queries through the Natural Language Understanding component\n(NLU). To yield reasonable performance, NLUs have to be trained with extensive,\nhigh-quality datasets, that express a multitude of ways users may interact with\nchatbots. However, previous studies show that creating a high-quality training\ndataset for software engineering chatbots is expensive in terms of both\nresources and time. Aims: Therefore, in this paper, we present an automated\ntransformer-based approach to augment software engineering chatbot datasets.\nMethod: Our approach combines traditional natural language processing\ntechniques with the BART transformer to augment a dataset by generating queries\nthrough synonym replacement and paraphrasing. We evaluate the impact of using\nthe augmentation approach on the Rasa NLU's performance using three software\nengineering datasets. Results: Overall, the augmentation approach shows\npromising results in improving the Rasa's performance, augmenting queries with\nvarying sentence structures while preserving their original semantics.\nFurthermore, it increases Rasa's confidence in its intent classification for\nthe correctly classified intents. Conclusions: We believe that our study helps\npractitioners improve the performance of their chatbots and guides future\nresearch to propose augmentation techniques for SE chatbots.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/"}