{"id":"2407.02831","title":"Robust optimal investment and consumption strategies with portfolio\n  constraints and stochastic environment","authors":"Len Patrick Dominic M. Garces and Yang Shen","authorsParsed":[["Garces","Len Patrick Dominic M.",""],["Shen","Yang",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 06:18:36 GMT"}],"updateDate":"2024-07-04","timestamp":1719987516000,"abstract":"  We investigate a continuous-time investment-consumption problem with model\nuncertainty in a general diffusion-based market with random model coefficients.\nWe assume that a power utility investor is ambiguity-averse, with the\npreference to robustness captured by the homothetic multiplier robust\nspecification, and the investor's investment and consumption strategies are\nconstrained to closed convex sets. To solve this constrained robust control\nproblem, we employ the stochastic Hamilton-Jacobi-Bellman-Isaacs equations,\nbackward stochastic differential equations, and bounded mean oscillation\nmartingale theory. Furthermore, we show the investor incurs (non-negative)\nutility loss, i.e. the loss in welfare, if model uncertainty is ignored. When\nthe model coefficients are deterministic, we establish formally the\nrelationship between the investor's robustness preference and the robust\noptimal investment-consumption strategy and the value function, and the impact\nof investment and consumption constraints on the investor's robust optimal\ninvestment-consumption strategy and value function. Extensive numerical\nexperiments highlight the significant impact of ambiguity aversion, consumption\nand investment constraints, on the investor's robust optimal\ninvestment-consumption strategy, utility loss, and value function. Key findings\ninclude: 1) short-selling restriction always reduces the investor's utility\nloss when model uncertainty is ignored; 2) the effect of consumption\nconstraints on utility loss is more delicate and relies on the investor's risk\naversion level.\n","subjects":["Quantitative Finance/Portfolio Management","Mathematics/Optimization and Control","Quantitative Finance/Mathematical Finance"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}