{"id":"2407.14140","title":"A Secure and Efficient Distributed Semantic Communication System for\n  Heterogeneous Internet of Things Devices","authors":"Weihao Zeng, Xinyu Xu, Qianyun Zhang, Jiting Shi, Zhijin Qin, Zhenyu\n  Guan","authorsParsed":[["Zeng","Weihao",""],["Xu","Xinyu",""],["Zhang","Qianyun",""],["Shi","Jiting",""],["Qin","Zhijin",""],["Guan","Zhenyu",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 09:09:12 GMT"}],"updateDate":"2024-07-22","timestamp":1721380152000,"abstract":"  Semantic communications have emerged as a promising solution to address the\nchallenge of efficient communication in rapidly evolving and increasingly\ncomplex Internet of Things (IoT) networks. However, protecting the security of\nsemantic communication systems within the distributed and heterogeneous IoT\nnetworks is critical issues that need to be addressed. We develop a secure and\nefficient distributed semantic communication system in IoT scenarios, focusing\non three aspects: secure system maintenance, efficient system update, and\nprivacy-preserving system usage. Firstly, we propose a blockchain-based\ninteraction framework that ensures the integrity, authentication, and\navailability of interactions among IoT devices to securely maintain system.\nThis framework includes a novel digital signature verification mechanism\ndesigned for semantic communications, enabling secure and efficient\ninteractions with semantic communications. Secondly, to improve the efficiency\nof interactions, we develop a flexible semantic communication scheme that\nleverages compressed semantic knowledge bases. This scheme reduces the data\nexchange required for system update and is adapt to dynamic task requirements\nand the diversity of device capabilities. Thirdly, we exploit the integration\nof differential privacy into semantic communications. We analyze the\nimplementation of differential privacy taking into account the lossy nature of\nsemantic communications and wireless channel distortions. An joint\nmodel-channel noise mechanism is introduced to achieve differential privacy\npreservation in semantic communications without compromising the system's\nfunctionality. Experiments show that the system is able to achieve integrity,\navailability, efficiency and the preservation of privacy.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}