{"id":"2407.14817","title":"Accretion regions of meteorite parent bodies inferred from a\n  two-endmember isotopic mixing model","authors":"Kang Shuai, Hejiu Hui, Li-Yong Zhou, Weiqiang Li","authorsParsed":[["Shuai","Kang",""],["Hui","Hejiu",""],["Zhou","Li-Yong",""],["Li","Weiqiang",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 09:27:35 GMT"}],"updateDate":"2024-07-23","timestamp":1721467655000,"abstract":"  The diverse isotopic anomalies of meteorites demonstrate that the\nprotoplanetary disk was composed of components from different stellar sources,\nwhich mixed in the disk and formed the planetary bodies. However, the origin of\nthe accretion materials of different planetary bodies and the cosmochemical\nrelationship between these bodies remain ambiguous. The noncarbonaceous (NC)\nplanetary bodies originate from the inner solar system and have isotopic\ncompositions distinct from those of the carbonaceous (CC) bodies. We combined\nCa, Ti, Cr, Fe, Ni, Mo, and Ru isotopic anomalies to develop a quantitative\ntwo-endmember mixing model of the NC bodies. Correlations of the isotopic\nanomalies of different elements with different cosmochemical behaviors\noriginate from the mixing of two common endmembers. Using this mixing model, we\ncalculated the isotopic anomalies of NC bodies for all the considered isotopes,\nincluding the isotopic anomalies that are difficult to measure or have been\naltered by spallation processes. The mixing proportion between the two\nendmembers in each NC body has been calculated as a cosmochemical parameter,\nwhich represents the compositional relationship of the accretion materials\nbetween the NC bodies. Using the calculated mixing proportions, the feeding\nzones of the NC bodies could be estimated. The estimated feeding zones of NC\nbodies indicate a large population of interlopers in the main asteroid belt and\nan indigenous origin of Vesta. The feeding zones estimated in different planet\nformation scenarios indicate that the orbits of Jupiter and Saturn during\nformation of terrestrial planets were likely to be more circular than their\ncurrent ones.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}