{"id":"2407.03746","title":"Monolithic convex limiting and implicit pseudo-time stepping for\n  calculating steady-state solutions of the Euler equations","authors":"Paul Moujaes and Dmitri Kuzmin","authorsParsed":[["Moujaes","Paul",""],["Kuzmin","Dmitri",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 08:58:00 GMT"}],"updateDate":"2024-07-08","timestamp":1720083480000,"abstract":"  In this work, we use the monolithic convex limiting (MCL) methodology to\nenforce relevant inequality constraints in implicit finite element\ndiscretizations of the compressible Euler equations. In this context,\npreservation of invariant domains follows from positivity preservation for\nintermediate states of the density and internal energy. To avoid spurious\noscillations, we additionally impose local maximum principles on intermediate\nstates of the density, velocity components, and specific total energy. For the\nbackward Euler time stepping, we show the invariant domain preserving (IDP)\nproperty of the fully discrete MCL scheme by constructing a fixed-point\niteration that is IDP and converges under a strong time step restriction. Our\niterative solver for the nonlinear discrete problem employs a more efficient\nfixed-point iteration. The matrix of the associated linear system is a robust\nlow-order Jacobian approximation that exploits the homogeneity property of the\nflux function. The limited antidiffusive terms are treated explicitly. We use\npositivity preservation as a stopping criterion for nonlinear iterations. The\nfirst iteration yields the solution of a linearized semi-implicit problem. This\nsolution possesses the discrete conservation property but is generally not IDP.\nFurther iterations are performed if any non-IDP states are detected. The\nexistence of an IDP limit is guaranteed by our analysis. To facilitate\nconvergence to steady-state solutions, we perform adaptive explicit\nunderrelaxation at the end of each time step. The calculation of appropriate\nrelaxation factors is based on an approximate minimization of nodal entropy\nresiduals. The performance of proposed algorithms and alternative solution\nstrategies is illustrated by the convergence history for standard\ntwo-dimensional test problems.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}