{"id":"2407.16592","title":"Existence of stationary measures for partially damped SDEs with generic,\n  Euler-type nonlinearities","authors":"Jacob Bedrossian and Alex Blumenthal and Keagan Callis and Kyle Liss","authorsParsed":[["Bedrossian","Jacob",""],["Blumenthal","Alex",""],["Callis","Keagan",""],["Liss","Kyle",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 15:49:03 GMT"}],"updateDate":"2024-07-24","timestamp":1721749743000,"abstract":"  We study nonlinear energy transfer and the existence of stationary measures\nin a class of degenerately forced SDEs on $\\mathbb R^d$ with a quadratic,\nconservative nonlinearity $B(x,x)$ constrained to possess various properties\ncommon to finite-dimensional fluid models and a linear damping term $-Ax$ that\nacts only on a proper subset of phase space in the sense that\n$\\mathrm{dim}(\\mathrm{ker}A) \\gg 1$. Existence of a stationary measure is\nstraightforward if $\\mathrm{ker}A = \\{0\\}$, but when the kernel of $A$ is\nnontrivial a stationary measure can exist only if the nonlinearity transfers\nenough energy from the undamped modes to the damped modes. We develop a set of\nsufficient dynamical conditions on $B$ that guarantees the existence of a\nstationary measure and prove that they hold ``generically'' within our\nconstraint class of nonlinearities provided that $\\mathrm{dim}(\\mathrm{ker}A) <\n2d/3$ and the stochastic forcing acts directly on at least two degrees of\nfreedom. We also show that the restriction $\\mathrm{dim}(\\mathrm{ker}A) < 2d/3$\ncan be removed if one allows the nonlinearity to change by a small amount at\ndiscrete times. In particular, for a Markov chain obtained by evolving our SDE\non approximately unit random time intervals and slightly perturbing the\nnonlinearity within our constraint class at each timestep, we prove that there\nexists a stationary measure whenever just a single mode is damped.\n","subjects":["Mathematics/Probability","Mathematics/Analysis of PDEs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}