{"id":"2407.14486","title":"Explainable Post hoc Portfolio Management Financial Policy of a Deep\n  Reinforcement Learning agent","authors":"Alejandra de la Rica Escudero, Eduardo C. Garrido-Merchan, Maria\n  Coronado-Vaca","authorsParsed":[["Escudero","Alejandra de la Rica",""],["Garrido-Merchan","Eduardo C.",""],["Coronado-Vaca","Maria",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 17:40:39 GMT"}],"updateDate":"2024-07-22","timestamp":1721410839000,"abstract":"  Financial portfolio management investment policies computed quantitatively by\nmodern portfolio theory techniques like the Markowitz model rely on a set on\nassumptions that are not supported by data in high volatility markets. Hence,\nquantitative researchers are looking for alternative models to tackle this\nproblem. Concretely, portfolio management is a problem that has been\nsuccessfully addressed recently by Deep Reinforcement Learning (DRL)\napproaches. In particular, DRL algorithms train an agent by estimating the\ndistribution of the expected reward of every action performed by an agent given\nany financial state in a simulator. However, these methods rely on Deep Neural\nNetworks model to represent such a distribution, that although they are\nuniversal approximator models, they cannot explain its behaviour, given by a\nset of parameters that are not interpretable. Critically, financial investors\npolicies require predictions to be interpretable, so DRL agents are not suited\nto follow a particular policy or explain their actions. In this work, we\ndeveloped a novel Explainable Deep Reinforcement Learning (XDRL) approach for\nportfolio management, integrating the Proximal Policy Optimization (PPO) with\nthe model agnostic explainable techniques of feature importance, SHAP and LIME\nto enhance transparency in prediction time. By executing our methodology, we\ncan interpret in prediction time the actions of the agent to assess whether\nthey follow the requisites of an investment policy or to assess the risk of\nfollowing the agent suggestions. To the best of our knowledge, our proposed\napproach is the first explainable post hoc portfolio management financial\npolicy of a DRL agent. We empirically illustrate our methodology by\nsuccessfully identifying key features influencing investment decisions, which\ndemonstrate the ability to explain the agent actions in prediction time.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Artificial Intelligence","Quantitative Finance/Portfolio Management"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}