{"id":"2407.01469","title":"Unrolling Plug-and-Play Gradient Graph Laplacian Regularizer for Image\n  Restoration","authors":"Jianghe Cai, Gene Cheung, Fei Chen","authorsParsed":[["Cai","Jianghe",""],["Cheung","Gene",""],["Chen","Fei",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 17:01:30 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 03:12:59 GMT"}],"updateDate":"2024-07-26","timestamp":1719853290000,"abstract":"  Generic deep learning (DL) networks for image restoration like denoising and\ninterpolation lack mathematical interpretability, require voluminous training\ndata to tune a large parameter set, and are fragile in the face of covariate\nshift. To address these shortcomings, we build interpretable networks by\nunrolling variants of a graph-based optimization algorithm of different\ncomplexities. Specifically, for a general linear image formation model, we\nfirst formulate a convex quadratic programming (QP) problem with a new\n$\\ell_2$-norm graph smoothness prior called gradient graph Laplacian\nregularizer (GGLR) that promotes piecewise planar (PWP) signal reconstruction.\nTo solve the posed unconstrained QP problem, instead of computing a linear\nsystem solution straightforwardly, we introduce a variable number of auxiliary\nvariables and correspondingly design a family of ADMM algorithms. We then\nunroll them into variable-complexity feed-forward networks, amenable to\nparameter tuning via back-propagation. More complex unrolled networks require\nmore labeled data to train more parameters, but have better overall\nperformance. The unrolled networks contain periodic insertions of a graph\nlearning module, akin to a self-attention mechanism in a transformer\narchitecture, to learn pairwise similarity structure inherent in data.\nExperimental results show that our unrolled networks perform competitively to\ngeneric DL networks in image restoration quality while using only a tiny\nfraction of parameters, and demonstrate improved robustness to covariate shift.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}