{"id":"2407.01894","title":"Adaptive Modality Balanced Online Knowledge Distillation for\n  Brain-Eye-Computer based Dim Object Detection","authors":"Zixing Li, Chao Yan, Zhen Lan, Xiaojia Xiang, Han Zhou, Jun Lai,\n  Dengqing Tang","authorsParsed":[["Li","Zixing",""],["Yan","Chao",""],["Lan","Zhen",""],["Xiang","Xiaojia",""],["Zhou","Han",""],["Lai","Jun",""],["Tang","Dengqing",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 02:30:23 GMT"},{"version":"v2","created":"Mon, 8 Jul 2024 08:50:00 GMT"}],"updateDate":"2024-07-09","timestamp":1719887423000,"abstract":"  Advanced cognition can be extracted from the human brain using brain-computer\ninterfaces. Integrating these interfaces with computer vision techniques, which\npossess efficient feature extraction capabilities, can achieve more robust and\naccurate detection of dim targets in aerial images. However, existing target\ndetection methods primarily concentrate on homogeneous data, lacking efficient\nand versatile processing capabilities for heterogeneous multimodal data. In\nthis paper, we first build a brain-eye-computer based object detection system\nfor aerial images under few-shot conditions. This system detects suspicious\ntargets using region proposal networks, evokes the event-related potential\n(ERP) signal in electroencephalogram (EEG) through the eye-tracking-based slow\nserial visual presentation (ESSVP) paradigm, and constructs the EEG-image data\npairs with eye movement data. Then, an adaptive modality balanced online\nknowledge distillation (AMBOKD) method is proposed to recognize dim objects\nwith the EEG-image data. AMBOKD fuses EEG and image features using a multi-head\nattention module, establishing a new modality with comprehensive features. To\nenhance the performance and robust capability of the fusion modality,\nsimultaneous training and mutual learning between modalities are enabled by\nend-to-end online knowledge distillation. During the learning process, an\nadaptive modality balancing module is proposed to ensure multimodal equilibrium\nby dynamically adjusting the weights of the importance and the training\ngradients across various modalities. The effectiveness and superiority of our\nmethod are demonstrated by comparing it with existing state-of-the-art methods.\nAdditionally, experiments conducted on public datasets and system validations\nin real-world scenarios demonstrate the reliability and practicality of the\nproposed system and the designed method.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}