{"id":"2407.15700","title":"A Life-long Learning Intrusion Detection System for 6G-Enabled IoV","authors":"Abdelaziz Amara korba, Souad Sebaa, Malik Mabrouki, Yacine\n  Ghamri-Doudane, and Karima Benatchba","authorsParsed":[["korba","Abdelaziz Amara",""],["Sebaa","Souad",""],["Mabrouki","Malik",""],["Ghamri-Doudane","Yacine",""],["Benatchba","Karima",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:07:27 GMT"}],"updateDate":"2024-07-23","timestamp":1721660847000,"abstract":"  The introduction of 6G technology into the Internet of Vehicles (IoV)\npromises to revolutionize connectivity with ultra-high data rates and seamless\nnetwork coverage. However, this technological leap also brings significant\nchallenges, particularly for the dynamic and diverse IoV landscape, which must\nmeet the rigorous reliability and security requirements of 6G networks.\nFurthermore, integrating 6G will likely increase the IoV's susceptibility to a\nspectrum of emerging cyber threats. Therefore, it is crucial for security\nmechanisms to dynamically adapt and learn new attack patterns, keeping pace\nwith the rapid evolution and diversification of these threats - a capability\ncurrently lacking in existing systems. This paper presents a novel intrusion\ndetection system leveraging the paradigm of life-long (or continual) learning.\nOur methodology combines class-incremental learning with federated learning, an\napproach ideally suited to the distributed nature of the IoV. This strategy\neffectively harnesses the collective intelligence of Connected and Automated\nVehicles (CAVs) and edge computing capabilities to train the detection system.\nTo the best of our knowledge, this study is the first to synergize\nclass-incremental learning with federated learning specifically for cyber\nattack detection. Through comprehensive experiments on a recent network traffic\ndataset, our system has exhibited a robust adaptability in learning new cyber\nattack patterns, while effectively retaining knowledge of previously\nencountered ones. Additionally, it has proven to maintain high accuracy and a\nlow false positive rate.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}