{"id":"2407.01654","title":"A thermodynamically consistent phase-field lattice Boltzmann method for\n  two-phase electrohydrodynamic flows","authors":"Fang Xiong, Lei Wang, Jiangxu Huang, Kang Luo","authorsParsed":[["Xiong","Fang",""],["Wang","Lei",""],["Huang","Jiangxu",""],["Luo","Kang",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:04:32 GMT"}],"updateDate":"2024-07-03","timestamp":1719839072000,"abstract":"  In this work, we aim to develop a phase-field based lattice Boltzmann (LB)\nmethod for simulating two-phase electrohydrodynamics (EHD) flows, which allows\nfor different properties (densities, viscosities, conductivity and\npermittivity) of each phase while maintaining thermodynamic consistency. To\nthis end, we first present a theoretical analysis on the two-phase EHD flows by\nusing the Onsager's variational principle, which is an extension of Rayleigh's\nprinciple of least energy dissipation and, naturally, guarantees thermodynamic\nconsistency. It shows that the governing equations of the model include the\nhydrodynamic equations, Cahn-Hilliard equation coupled with additional\nelectrical effect, and the full Poisson-Nernst-Planck electrokinetic equations.\nAfter that, a coupled lattice Boltzmann (LB) scheme is constructed for\nsimulating two-phase EHD flows. In particular, in order to handle two-phase EHD\nflows with a relatively larger electric permittivity ratio, we also introduce a\ndelicately designed discrete forcing term into the LB equation for\nelectrostatic field. Moreover, some numerical examples including two-phase EHD\nflows in planar layers and charge diffusion of a Gaussian bell are simulated\nwith the developed LB method. It is shown that our numerical scheme shares a\nsecond-order convergence rate in space in predicting electric potential and\ncharge density. Finally, we used the current model to simulate the deformation\nof a droplet under an electric field and the dynamics of droplet detachment in\nreversed electrowetting. Our numerical results align well with the theoretic\nsolutions, and the available experimental/numerical data, demonstrating that\nthe proposed method is feasible for simulating two-phase EHD flows.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}