{"id":"2407.06845","title":"Digging into the Interior of Hot Cores with ALMA (DIHCA). IV.\n  Fragmentation in High-mass Star-Forming Clumps","authors":"Kosuke Ishihara, Patricio Sanhueza, Fumitaka Nakamura, Masao Saito,\n  Huei-Ru V. Chen, Shanghuo Li, Fernando Olguin, Kotomi Taniguchi, Kaho Morii,\n  Xing Lu, Qiuyi Luo, Takeshi Sakai, Qizhou Zhang","authorsParsed":[["Ishihara","Kosuke",""],["Sanhueza","Patricio",""],["Nakamura","Fumitaka",""],["Saito","Masao",""],["Chen","Huei-Ru V.",""],["Li","Shanghuo",""],["Olguin","Fernando",""],["Taniguchi","Kotomi",""],["Morii","Kaho",""],["Lu","Xing",""],["Luo","Qiuyi",""],["Sakai","Takeshi",""],["Zhang","Qizhou",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 13:26:32 GMT"}],"updateDate":"2024-07-10","timestamp":1720531592000,"abstract":"  Fragmentation contributes to the formation and evolution of stars.\nObservationally, high-mass stars are known to form multiple-star systems,\npreferentially in cluster environments. Theoretically, Jeans instability has\nbeen suggested to determine characteristic fragmentation scales, and thermal or\nturbulent motion in the parental gas clump mainly contributes to the\ninstability. To search for such a characteristic fragmentation scale, we have\nanalyzed ALMA 1.33 mm continuum observations toward 30 high-mass star-forming\nclumps taken by the Digging into the Interior of Hot Cores with ALMA (DIHCA)\nsurvey. We have identified 573 cores using the dendrogram algorithm and\nmeasured the separation of cores by using the Minimum Spanning Tree (MST)\ntechnique. The core separation corrected by projection effects has a\ndistribution peaked around 5800 au. In order to remove biases produced by\ndifferent distances and sensitivities, we further smooth the images to a common\nphysical scale and perform completeness tests. Our careful analysis finds a\ncharacteristic fragmentation scale of $\\sim$7000 au, comparable to the thermal\nJeans length of the clumps. We conclude that thermal Jeans fragmentation plays\na dominant role in determining the clump fragmentation in high-mass\nstar-forming regions, without the need of invoking turbulent Jeans\nfragmentation.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}