{"id":"2407.12468","title":"Search Engines, LLMs or Both? Evaluating Information Seeking Strategies\n  for Answering Health Questions","authors":"Marcos Fern\\'andez-Pichel and Juan C. Pichel and David E. Losada","authorsParsed":[["Fernández-Pichel","Marcos",""],["Pichel","Juan C.",""],["Losada","David E.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 10:40:39 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 10:11:09 GMT"}],"updateDate":"2024-07-19","timestamp":1721212839000,"abstract":"  Search engines have traditionally served as primary tools for information\nseeking. However, the new Large Language Models (LLMs) have recently\ndemonstrated remarkable capabilities in multiple tasks and, specifically, their\nadoption as question answering systems is becoming increasingly prevalent. It\nis expected that LLM-based conversational systems and traditional web engines\nwill continue to coexist in the future, supporting end users in various ways.\nBut there is a need for more scientific research on the effectiveness of both\ntypes of systems in facilitating accurate information seeking. In this study,\nwe focus on their merits in answering health questions. We conducted an\nextensive study comparing different web search engines, LLMs and\nretrieval-augmented (RAG) approaches. Our research reveals intriguing\nconclusions. For example, we observed that the quality of webpages potentially\nresponding to a health question does not decline as we navigate further down\nthe ranked lists. However, according to our evaluation, web engines are less\naccurate than LLMs in finding correct answers to health questions. On the other\nhand, LLMs are quite sensitive to the input prompts, and we also found out that\nRAG leads to highly effective information seeking methods.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bjLdGlCoEBzykC7v3gtGX7aMj30W6C9vS9Tb7guoCoM","pdfSize":"982610"}
