{"id":"2407.20354","title":"Extrinsic Dielectric Response due to Domain Wall Motion in Ferroelectric\n  BaTiO$_3$","authors":"Ashok Gurung (1), Mohammad Fatin Ishtiyaq (2), S. Pamir Alpay (1 and\n  2), John Mangeri (3), Serge Nakhmanson (1 and 2) ((1) Department of Physics,\n  University of Connecticut, Storrs, Connecticut, USA, (2) Department of\n  Materials Science & Engineering, and Institute of Materials Science,\n  University of Connecticut, Storrs, Connecticut, USA (3) Center for\n  Atomic-scale Materials Design (CAMD), Department of Physics, Technical\n  University of Denmark, Kongens Lyngby, Denmark)","authorsParsed":[["Gurung","Ashok","","1 and\n  2"],["Ishtiyaq","Mohammad Fatin","","1 and\n  2"],["Alpay","S. Pamir","","1 and\n  2"],["Mangeri","John","","1 and 2"],["Nakhmanson","Serge","","1 and 2"]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:10:08 GMT"}],"updateDate":"2024-07-31","timestamp":1722276608000,"abstract":"  BaTiO$_3$ (BTO) is a prototypical perovskite ferroelectric, whose dielectric\npermittivity and loss spectra -- which are strongly temperature and frequency\ndependent -- include contributions from inhomogeneous polarization patterns,\nwith polar domain walls (DWs) being the most common types. In order to\nelucidate how DWs influence dielectric response, we utilized a continuum\napproach based on the Landau-Ginzburg theory to model field-dependent\nproperties of polydomain tetragonal phase of BTO near room temperature and\nabove. A system with 180$^\\circ$ DWs was evaluated as a case study, with both\nposition-resolved and volume-averaged dielectric susceptibility and loss\ncomputed at different temperatures for a range of applied field frequencies and\namplitudes. Our results demonstrate that cooperative dipole fluctuations in the\nvicinity of the DW provide a large (extrinsic) contribution to the system\ndielectric response relative to the intrinsic contribution stemming from within\nthe domain. Dynamics of the DW profile fluctuations under applied field can be\nrepresented by a combination of breathing and sliding vibrational motions, with\neach exhibiting distinct dependence on the field frequency and amplitude. The\nimplications of this behavior are important for understanding and improving\ncontrol of coupled functional properties in ferroelectric materials, including\ntheir dielectric, electromechanical, and electrooptical responses. Furthermore,\nthis investigation provides a computational benchmark for future studies and\ncan be readily extended to other topological polarization patterns in\nferroelectrics.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}