{"id":"2407.18647","title":"Towards unveiling the large-scale nature of gravity with the wavelet\n  scattering transform","authors":"Georgios Valogiannis, Francisco Villaescusa-Navarro and Marco Baldi","authorsParsed":[["Valogiannis","Georgios",""],["Villaescusa-Navarro","Francisco",""],["Baldi","Marco",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 10:29:15 GMT"}],"updateDate":"2024-07-29","timestamp":1721989755000,"abstract":"  We present the first application of the Wavelet Scattering Transform (WST) in\norder to constrain the nature of gravity using the three-dimensional (3D)\nlarge-scale structure of the universe. Utilizing the Quijote-MG N-body\nsimulations, we can reliably model the 3D matter overdensity field for the f(R)\nHu-Sawicki modified gravity (MG) model down to $k_{\\rm max}=0.5$ h/Mpc.\nCombining these simulations with the Quijote $\\nu$CDM collection, we then\nconduct a Fisher forecast of the marginalized constraints obtained on gravity\nusing the WST coefficients and the matter power spectrum at redshift z=0. Our\nresults demonstrate that the WST substantially improves upon the 1$\\sigma$\nerror obtained on the parameter that captures deviations from standard General\nRelativity (GR), yielding a tenfold improvement compared to the corresponding\nmatter power spectrum result. At the same time, the WST also enhances the\nprecision on the $\\Lambda$CDM parameters and the sum of neutrino masses, by\nfactors of 1.2-3.4 compared to the matter power spectrum, respectively. Despite\nthe overall reduction in the WST performance when we focus on larger scales, it\nstill provides a relatively $4.5\\times$ tighter 1$\\sigma$ error for the MG\nparameter at $k_{\\rm max}=0.2$ h/Mpc, highlighting its great sensitivity to the\nunderlying gravity theory. This first proof-of-concept study reaffirms the\nconstraining properties of the WST technique and paves the way for exciting\nfuture applications in order to perform precise large-scale tests of gravity\nwith the new generation of cutting-edge cosmological data.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology","Physics/Data Analysis, Statistics and Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}