{"id":"2407.12706","title":"Multiple Access Integrated Adaptive Finite Blocklength for Ultra-Low\n  Delay in 6G Wireless Networks","authors":"Yixin Zhang, Wenchi Cheng, and Wei Zhang","authorsParsed":[["Zhang","Yixin",""],["Cheng","Wenchi",""],["Zhang","Wei",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 16:28:23 GMT"}],"updateDate":"2024-07-18","timestamp":1721233703000,"abstract":"  Facing the dramatic increase of real-time applications and time-sensitive\nservices, large-scale ultra-low delay requirements are put forward for the\nsixth generation (6G) wireless networks. To support massive ultra-reliable and\nlow-latency communications (mURLLC), in this paper we propose an adaptive\nfinite blocklength framework to reduce the over-the-air delay for short packet\ntransmissions with multiple-access and delay-bounded demands. In particular, we\nfirst give the specified over-the-air delay model. Then, we reveal the tradeoff\nrelationship among queuing delay, transmission delay, and the number of\nretransmissions along with the change of finite blocklength, as well as\nformulate the adaptive blocklength framework. Based on the adaptive blocklength\nframework and associated with grant-free (GF) access protocol, we formulate the\naverage over-the-air delay minimization problem, where the blocklength can be\nadaptively changed in terms of transmission time interval (TTI) design and\nbandwidth allocation to achieve the optimal tradeoff and obtain its minimum\nover-the-air delay. We develop the cooperative multi-agent deep Q-network\n(M-DQN) scheme with a grouping mechanism to efficiently solve the average\nover-the-air delay minimization problem. Numerical results validate our\nproposed adaptive blocklength scheme outperforms corresponding schemes in\nlong-term evolution (LTE) and the fifth generation (5G) new radio (NR).\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}