{"id":"2407.10648","title":"Back to Newton's Laws: Learning Vision-based Agile Flight via\n  Differentiable Physics","authors":"Yuang Zhang, Yu Hu, Yunlong Song, Danping Zou, Weiyao Lin","authorsParsed":[["Zhang","Yuang",""],["Hu","Yu",""],["Song","Yunlong",""],["Zou","Danping",""],["Lin","Weiyao",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 12:08:53 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 03:41:08 GMT"}],"updateDate":"2024-07-17","timestamp":1721045333000,"abstract":"  Swarm navigation in cluttered environments is a grand challenge in robotics.\nThis work combines deep learning with first-principle physics through\ndifferentiable simulation to enable autonomous navigation of multiple aerial\nrobots through complex environments at high speed. Our approach optimizes a\nneural network control policy directly by backpropagating loss gradients\nthrough the robot simulation using a simple point-mass physics model and a\ndepth rendering engine. Despite this simplicity, our method excels in\nchallenging tasks for both multi-agent and single-agent applications with\nzero-shot sim-to-real transfer. In multi-agent scenarios, our system\ndemonstrates self-organized behavior, enabling autonomous coordination without\ncommunication or centralized planning - an achievement not seen in existing\ntraditional or learning-based methods. In single-agent scenarios, our system\nachieves a 90% success rate in navigating through complex environments,\nsignificantly surpassing the 60% success rate of the previous state-of-the-art\napproach. Our system can operate without state estimation and adapt to dynamic\nobstacles. In real-world forest environments, it navigates at speeds up to 20\nm/s, doubling the speed of previous imitation learning-based solutions.\nNotably, all these capabilities are deployed on a budget-friendly $21 computer,\ncosting less than 5% of a GPU-equipped board used in existing systems. Video\ndemonstrations are available at https://youtu.be/LKg9hJqc2cc.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/"}