{"id":"2407.20321","title":"Entropy and Spectrum of Near-Extremal Black Holes: semiclassical brane\n  solutions to non-perturbative problems","authors":"Sergio Hern\\'andez-Cuenca","authorsParsed":[["Hernández-Cuenca","Sergio",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:00:00 GMT"},{"version":"v2","created":"Mon, 16 Sep 2024 13:19:37 GMT"}],"updateDate":"2024-09-17","timestamp":1722276000000,"abstract":"  The black hole entropy has been observed to generically turn negative at\nexponentially low temperatures $T\\sim e^{-S_0}$ in the extremal\nBekenstein-Hawking entropy $S_0$, a seeming pathology often attributed to\nmissing non-perturbative effects. In fact, we show that this negativity must\nhappen for any effective theory of quantum gravity with an ensemble\ndescription. To do so, we identify the usual gravitational entropy as an\nannealed entropy $S_a$, and prove that this quantity gives $S_0$ at extremality\nif and only if the ground-state energy is protected by supersymmetry, and\ndiverges negatively otherwise. The actual thermodynamically-behaved quantity is\nthe average or quenched entropy $S_q$, whose calculation is poorly understood\nin gravity: it involves replica wormholes in a regime where the topological\nexpansion breaks down. Using matrix integrals we find new instanton saddles\nthat dominate gravitational correlators at $T\\sim e^{-S_0}$ and are dual to\nsemiclassical wormholes involving dynamical branes. These brane solutions give\nthe leading contribution to any black hole very near extremality, and a duality\nwith matrix ensembles would not make sense without them. In the non-BPS case,\nthey are required to make $S_q$ non-negative and also enhance the negativity of\n$S_a$, both effects consistent with matrix integrals evaluated exactly. Our\ninstanton results are tested against the on-shell action of D3-branes dual to\nmultiply wrapped Wilson loops in $\\mathcal{N}=4$ super-YM, and a precise match\nis found. Our analysis of low-energy random matrix spectra also explains the\norigin of spectral gaps in supersymmetric theories, not only when there are BPS\nstates at zero energy, but also for purely non-BPS supermultiplets. In the\nformer, our prediction for the gap in terms of the degeneracy of BPS states\nagrees with the R-charge scaling in gapped multiplets of $\\mathcal{N}=2$\nsuper-JT gravity.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}