{"id":"2407.14820","title":"Dreamer: Dual-RIS-aided Imager in Complementary Modes","authors":"Fuhai Wang, Yunlong Huang, Zhanbo Feng, Rujing Xiong, Zhe Li, Chun\n  Wang, Tiebin Mi, Robert Caiming Qiu, Zenan Ling","authorsParsed":[["Wang","Fuhai",""],["Huang","Yunlong",""],["Feng","Zhanbo",""],["Xiong","Rujing",""],["Li","Zhe",""],["Wang","Chun",""],["Mi","Tiebin",""],["Qiu","Robert Caiming",""],["Ling","Zenan",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 09:41:21 GMT"}],"updateDate":"2024-07-23","timestamp":1721468481000,"abstract":"  Reconfigurable intelligent surfaces (RISs) have emerged as a promising\nauxiliary technology for radio frequency imaging. However, existing works face\nchallenges of faint and intricate back-scattered waves and the restricted\nfield-of-view (FoV), both resulting from complex target structures and a\nlimited number of antennas. The synergistic benefits of multi-RIS-aided imaging\nhold promise for addressing these challenges. Here, we propose a dual-RIS-aided\nimaging system, Dreamer, which operates collaboratively in complementary modes\n(reflection-mode and transmission-mode). Dreamer significantly expands the FoV\nand enhances perception by deploying dual-RIS across various spatial and\nmeasurement patterns. Specifically, we perform a fine-grained analysis of how\nradio-frequency (RF) signals encode scene information in the scattered object\nmodeling. Based on this modeling, we design illumination strategies to balance\nspatial resolution and observation scale, and implement a prototype system in a\ntypical indoor environment. Moreover, we design a novel artificial neural\nnetwork with a CNN-external-attention mechanism to translate RF signals into\nhigh-resolution images of human contours. Our approach achieves an impressive\nSSIM score exceeding 0.83, validating its effectiveness in broadening\nperception modes and enhancing imaging capabilities. The code to reproduce our\nresults is available at https://github.com/fuhaiwang/Dreamer.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}