{"id":"2407.07097","title":"Do SETI Optimists Have a Fine-Tuning Problem?","authors":"David Kipping and Geraint Lewis","authorsParsed":[["Kipping","David",""],["Lewis","Geraint",""]],"versions":[{"version":"v1","created":"Fri, 14 Jun 2024 13:21:48 GMT"}],"updateDate":"2024-07-11","timestamp":1718371308000,"abstract":"  In ecological systems, be it a garden or a galaxy, populations evolve from\nsome initial value (say zero) up to a steady state equilibrium, when the mean\nnumber of births and deaths per unit time are equal. This equilibrium point is\na function of the birth and death rates, as well as the carrying capacity of\nthe ecological system itself. The growth curve is S-shaped, saturating at the\ncarrying capacity for large birth-to-death rate ratios and tending to zero at\nthe other end. We argue that our astronomical observations appear inconsistent\nwith a cosmos saturated with ETIs, and thus SETI optimists are left presuming\nthat the true population is somewhere along the transitional part of this\nS-curve. Since the birth and death rates are a-priori unbounded, we argue that\nthis presents a fine-tuning problem. Further, we show that if the\nbirth-to-death rate ratio is assumed to have a log-uniform prior distribution,\nthen the probability distribution of the ecological filling fraction is\nbi-modal - peaking at zero and unity. Indeed, the resulting distribution is\nformally the classic Haldane prior, conceived to describe the prior expectation\nof a Bernoulli experiment, such as a technological intelligence developing (or\nnot) on a given world. Our results formally connect the Drake Equation to the\nbirth-death formalism, the treatment of ecological carrying capacity and their\nconnection to the Haldane perspective.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Physics/Popular Physics","Quantitative Biology/Populations and Evolution"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}