{"id":"2407.12274","title":"MDPE: A Multimodal Deception Dataset with Personality and Emotional\n  Characteristics","authors":"Cong Cai, Shan Liang, Xuefei Liu, Kang Zhu, Zhengqi Wen, Jianhua Tao,\n  Heng Xie, Jizhou Cui, Yiming Ma, Zhenhua Cheng, Hanzhe Xu, Ruibo Fu, Bin Liu,\n  Yongwei Li","authorsParsed":[["Cai","Cong",""],["Liang","Shan",""],["Liu","Xuefei",""],["Zhu","Kang",""],["Wen","Zhengqi",""],["Tao","Jianhua",""],["Xie","Heng",""],["Cui","Jizhou",""],["Ma","Yiming",""],["Cheng","Zhenhua",""],["Xu","Hanzhe",""],["Fu","Ruibo",""],["Liu","Bin",""],["Li","Yongwei",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 02:44:26 GMT"}],"updateDate":"2024-07-18","timestamp":1721184266000,"abstract":"  Deception detection has garnered increasing attention in recent years due to\nthe significant growth of digital media and heightened ethical and security\nconcerns. It has been extensively studied using multimodal methods, including\nvideo, audio, and text. In addition, individual differences in deception\nproduction and detection are believed to play a crucial role.Although some\nstudies have utilized individual information such as personality traits to\nenhance the performance of deception detection, current systems remain limited,\npartly due to a lack of sufficient datasets for evaluating performance. To\naddress this issue, we introduce a multimodal deception dataset MDPE. Besides\ndeception features, this dataset also includes individual differences\ninformation in personality and emotional expression characteristics. It can\nexplore the impact of individual differences on deception behavior. It\ncomprises over 104 hours of deception and emotional videos from 193 subjects.\nFurthermore, we conducted numerous experiments to provide valuable insights for\nfuture deception detection research. MDPE not only supports deception\ndetection, but also provides conditions for tasks such as personality\nrecognition and emotion recognition, and can even study the relationships\nbetween them. We believe that MDPE will become a valuable resource for\npromoting research in the field of affective computing.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"pPshBCWMC79cTtFUPdK4dyenFZED5TyISsGhbHpiAAY","pdfSize":"6110023"}
