{"id":"2407.00534","title":"Blockchain based Decentralized Petition System","authors":"Jagdeep Kaur, Kevin Antony, Nikhil Pujar and Ankit Jha","authorsParsed":[["Kaur","Jagdeep",""],["Antony","Kevin",""],["Pujar","Nikhil",""],["Jha","Ankit",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 21:44:35 GMT"}],"updateDate":"2024-07-02","timestamp":1719697475000,"abstract":"  A decentralized online petition system enables individuals or groups to\ncreate, sign, and share petitions without a central authority. Using blockchain\ntechnology, these systems ensure the integrity and transparency of the petition\nprocess by recording every signature or action on the blockchain, making\nalterations or deletions impossible. This provides a permanent, tamper-proof\nrecord of the petition's progress. Such systems allow users to bypass\ntraditional intermediaries like government or social media platforms, fostering\nmore democratic and transparent decision-making.\n  This paper reviews research on petition systems, highlighting the\nshortcomings of existing systems such as lack of accountability, vulnerability\nto hacking, and security issues. The proposed blockchain-based implementation\naims to overcome these challenges. Decentralized voting systems have garnered\ninterest recently due to their potential to provide secure and transparent\nvoting platforms without intermediaries, addressing issues like voter fraud,\nmanipulation, and trust in the electoral process.\n  We propose a decentralized voting system web application using blockchain\ntechnology to ensure the integrity and security of the voting process. This\nsystem aims to provide a transparent, decentralized decision-making process\nthat counts every vote while eliminating the need for centralized authorities.\nThe paper presents an overview of the system architecture, design\nconsiderations, and implementation details, along with the potential benefits\nand limitations.\n  Finally, we discuss future research directions, examining the technical\naspects of the application, including underlying algorithms and protocols. Our\nresearch aims to enhance the integrity and accessibility of democratic\nprocesses, improve security, and ensure fairness, transparency, and\ntamper-proofness.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}