{"id":"2407.07109","title":"Fibonacci--Theodorus Spiral and its properties","authors":"Michael R. Bacon, Charles K. Cook, Rigoberto Fl\\'orez, Robinson A.\n  Higuita, Florian Luca, and Jos\\'e L. Ram\\'irez","authorsParsed":[["Bacon","Michael R.",""],["Cook","Charles K.",""],["Flórez","Rigoberto",""],["Higuita","Robinson A.",""],["Luca","Florian",""],["Ramírez","José L.",""]],"versions":[{"version":"v1","created":"Mon, 24 Jun 2024 17:19:48 GMT"},{"version":"v2","created":"Sun, 8 Sep 2024 22:31:04 GMT"}],"updateDate":"2024-09-10","timestamp":1719249588000,"abstract":"  Inspired by the ancient spiral constructed by the greek philosopher Theodorus\nwhich is based on concatenated right triangles, we have created a spiral. In\nthis spiral, called \\emph{Fibonacci--Theodorus}, the sides of the triangles\nhave lengths corresponding to Fibonacci numbers. Towards the end of the paper,\nwe present a generalized method applicable to second-order recurrence\nrelations.\n  Our exploration of the Fibonacci--Theodorus spiral aims to address a variety\nof questions, showcasing its unique properties and behaviors. For example, we\nstudy topics such as area, perimeter, and angles. Notably, we establish a\nrelationship between the ratio of two consecutive areas and the golden ratio, a\npattern that extends to angles sharing a common vertex. Furthermore, we present\nsome asymptotic results. For instance, we demonstrate that the sum of the first\n$n$ areas comprising the spiral approaches a multiple of the sum of the initial\n$n$ Fibonacci numbers. Moreover, we provide a sequence of open problems related\nto all spiral worked in this paper.\n  Finally, in his work Hahn, Hahn observed a potential connection between the\ngolden ratio and the ratio of areas between spines of lengths $\\sqrt{F_{n+1}}$\nand $\\sqrt{F_{n+2}-1}$ and the areas between spines of lengths $\\sqrt{F_{n}}$\nand $\\sqrt{F_{n+1}-1}$ in the Theodorus spiral. However, no formal proof has\nbeen provided in his work. In this paper, we provide a proof for Hahn's\nconjecture.\n","subjects":["Mathematics/General Mathematics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}