{"id":"2407.08475","title":"Investigating Public Fine-Tuning Datasets: A Complex Review of Current\n  Practices from a Construction Perspective","authors":"Runyuan Ma, Wei Li, Fukai Shang","authorsParsed":[["Ma","Runyuan",""],["Li","Wei",""],["Shang","Fukai",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 13:11:16 GMT"}],"updateDate":"2024-07-12","timestamp":1720703476000,"abstract":"  With the rapid development of the large model domain, research related to\nfine-tuning has concurrently seen significant advancement, given that\nfine-tuning is a constituent part of the training process for large-scale\nmodels. Data engineering plays a fundamental role in the training process of\nmodels, which includes data infrastructure, data processing, etc. Data during\nfine-tuning likewise forms the base for large models. In order to embrace the\npower and explore new possibilities of fine-tuning datasets, this paper reviews\ncurrent public fine-tuning datasets from the perspective of data construction.\nAn overview of public fine-tuning datasets from two sides: evolution and\ntaxonomy, is provided in this review, aiming to chart the development\ntrajectory. Construction techniques and methods for public fine-tuning datasets\nof Large Language Models (LLMs), including data generation and data\naugmentation among others, are detailed. This elaboration follows the\naforementioned taxonomy, specifically across demonstration, comparison, and\ngeneralist categories. Additionally, a category tree of data generation\ntechniques has been abstracted in our review to assist researchers in gaining a\ndeeper understanding of fine-tuning datasets from the construction dimension.\nOur review also summarizes the construction features in different data\npreparation phases of current practices in this field, aiming to provide a\ncomprehensive overview and inform future research. Fine-tuning dataset\npractices, encompassing various data modalities, are also discussed from a\nconstruction perspective in our review. Towards the end of the article, we\noffer insights and considerations regarding the future construction and\ndevelopments of fine-tuning datasets.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}