{"id":"2407.21445","title":"Advanced Techniques for High-Performance Fock Matrix Construction on GPU\n  Clusters","authors":"Elise Palethorpe, Ryan Stocks, and Giuseppe M. J. Barca","authorsParsed":[["Palethorpe","Elise",""],["Stocks","Ryan",""],["Barca","Giuseppe M. J.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 08:49:06 GMT"}],"updateDate":"2024-08-01","timestamp":1722415746000,"abstract":"  This Article presents two optimized multi-GPU algorithms for Fock matrix\nconstruction, building on the work of Ufimtsev et al. and Barca et al. The\nnovel algorithms, opt-UM and opt-Brc, introduce significant enhancements,\nincluding improved integral screening, exploitation of sparsity and symmetry, a\nlinear scaling exchange matrix assembly algorithm, and extended capabilities\nfor Hartree-Fock caculations up to $f$-type angular momentum functions. Opt-Brc\nexcels for smaller systems and for highly contracted triple-$\\zeta$ basis sets,\nwhile opt-UM is advantageous for large molecular systems. Performance\nbenchmarks on NVIDIA A100 GPUs show that our algorithms in the EXtreme-scale\nElectronic Structure System (EXESS), when combined, outperform all current GPU\nand CPU Fock build implementations in TeraChem, QUICK, GPU4PySCF, LibIntX,\nORCA, and Q-Chem. The implementations were benchmarked on linear and globular\nsystems and average speed ups across three double-$\\zeta$ basis sets of\n1.5$\\times$, 5.2$\\times$, and 8.5$\\times$ were observed compared to TeraChem,\nGPU4PySCF, and QUICK respectively. Strong scaling analysis reveals over 91%\nparallel efficiency on four GPUs for opt-Brc, making it typically faster for\nmulti-GPU execution. Single-compute-node comparisons with CPU-based software\nlike ORCA and Q-Chem show speedups of up to 42$\\times$ and 31$\\times$,\nrespectively, enhancing power efficiency by up to 18$\\times$.\n","subjects":["Physics/Computational Physics","Condensed Matter/Materials Science","Physics/Chemical Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"hKJZFzOacT1TMhqA-uk3z56iWFXc_5R1CM96E5hAPzE","pdfSize":"5877299"}
