{"id":"2407.21462","title":"On the use of calibration data in error-aware compilation techniques for\n  NISQ devices","authors":"Handy Kurniawan, Laura Rodr\\'iguez-Soriano, Daniele Cuomo, Carmen G.\n  Almudever and Francisco Garc\\'ia Herrero","authorsParsed":[["Kurniawan","Handy",""],["Rodríguez-Soriano","Laura",""],["Cuomo","Daniele",""],["Almudever","Carmen G.",""],["Herrero","Francisco García",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 09:20:31 GMT"}],"updateDate":"2024-08-01","timestamp":1722417631000,"abstract":"  Reliably executing quantum algorithms on noisy intermediate-scale quantum\n(NISQ) devices is challenging, as they are severely constrained and prone to\nerrors. Efficient quantum circuit compilation techniques are therefore crucial\nfor overcoming their limitations and dealing with their high error rates. These\ntechniques consider the quantum hardware restrictions, such as the limited\nqubit connectivity, and perform some transformations to the original circuit\nthat can be executed on a given quantum processor. Certain compilation methods\nuse error information based on calibration data to further improve the success\nprobability or the fidelity of the circuit to be run. However, it is uncertain\nto what extent incorporating calibration information in the compilation process\ncan enhance the circuit performance. For instance, considering the most recent\nerror data provided by vendors after calibrating the processor might not be\nfunctional enough as quantum systems are subject to drift, making the latest\ncalibration data obsolete within minutes. In this paper, we explore how\ndifferent usage of calibration data impacts the circuit fidelity, by using\nseveral compilation techniques and quantum processors (IBM Perth and Brisbane).\nTo this aim, we implemented a framework that incorporates some of the\nstate-of-the-art noise-aware and non-noise-aware compilation techniques and\nallows the user to perform fair comparisons under similar processor conditions.\nOur experiments yield valuable insights into the effects of noise-aware\nmethodologies and the employment of calibration data. The main finding is that\npre-processing historical calibration data can improve fidelity when real-time\ncalibration data is not available due to factors such as cloud service latency\nand waiting queues between compilation and execution on the quantum backend.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}