{"id":"2407.09030","title":"CAMP: Continuous and Adaptive Learning Model in Pathology","authors":"Anh Tien Nguyen, Keunho Byeon, Kyungeun Kim, Boram Song, Seoung Wan\n  Chae, Jin Tae Kwak","authorsParsed":[["Nguyen","Anh Tien",""],["Byeon","Keunho",""],["Kim","Kyungeun",""],["Song","Boram",""],["Chae","Seoung Wan",""],["Kwak","Jin Tae",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 06:45:37 GMT"}],"updateDate":"2024-07-15","timestamp":1720766737000,"abstract":"  There exist numerous diagnostic tasks in pathology. Conventional\ncomputational pathology formulates and tackles them as independent and\nindividual image classification problems, thereby resulting in computational\ninefficiency and high costs. To address the challenges, we propose a generic,\nunified, and universal framework, called a continuous and adaptive learning\nmodel in pathology (CAMP), for pathology image classification. CAMP is a\ngenerative, efficient, and adaptive classification model that can continuously\nadapt to any classification task by leveraging pathology-specific prior\nknowledge and learning taskspecific knowledge with minimal computational cost\nand without forgetting the knowledge from the existing tasks. We evaluated CAMP\non 22 datasets, including 1,171,526 patches and 11,811 pathology slides, across\n17 classification tasks. CAMP achieves state-of-theart classification\nperformance on a wide range of datasets and tasks at both patch- and\nslide-levels and reduces up to 94% of computation time and 85% of storage\nmemory in comparison to the conventional classification models. Our results\ndemonstrate that CAMP can offer a fundamental transformation in pathology image\nclassification, paving the way for the fully digitized and computerized\npathology practice.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zJ40kp32V98aEwE7EJt-6JPEOQK4Va0xQCukv1AuZYA","pdfSize":"28202010"}
