{"id":"2407.12932","title":"Efficient and accurate force replay in cosmological-baryonic simulations","authors":"Arpit Arora, Robyn Sanderson, Christopher Regan, Nicol\\'as\n  Garavito-Camargo, Emily Bregou, Nondh Panithanpaisal, Andrew Wetzel, Emily C.\n  Cunningham, Sarah R. Loebman, Adriana Dropulic, and Nora Shipp","authorsParsed":[["Arora","Arpit",""],["Sanderson","Robyn",""],["Regan","Christopher",""],["Garavito-Camargo","Nicolás",""],["Bregou","Emily",""],["Panithanpaisal","Nondh",""],["Wetzel","Andrew",""],["Cunningham","Emily C.",""],["Loebman","Sarah R.",""],["Dropulic","Adriana",""],["Shipp","Nora",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 18:05:06 GMT"}],"updateDate":"2024-07-19","timestamp":1721239506000,"abstract":"  We construct time-evolving gravitational potential models for a Milky\nWay-mass galaxy from the FIRE-2 suite of cosmological-baryonic simulations\nusing basis function expansions. These models capture the angular variation\nwith spherical harmonics for the halo and azimuthal harmonics for the disk, and\nthe radial or meridional plane variation with splines. We fit low-order\nexpansions (4 angular/harmonic terms) to the galaxy's potential for each\nsnapshot, spaced roughly 25 Myr apart, over the last 4 Gyr of its evolution,\nthen extract the forces at discrete times and interpolate them between adjacent\nsnapshots for forward orbit integration. Our method reconstructs the forces\nfelt by simulation particles with high fidelity, with 95% of both stars and\ndark matter, outside of self-gravitating subhalos, exhibiting errors $\\leq4\\%$\nin both the disk and the halo. Imposing symmetry on the model systematically\nincreases these errors, particularly for disk particles, which show greater\nsensitivity to imposed symmetries. The majority of orbits recovered using the\nmodels exhibit positional errors $\\leq10\\%$ for 2-3 orbital periods, with\nhigher errors for orbits that spend more time near the galactic center.\nApproximate integrals of motion are retrieved with high accuracy even with a\nlarger potential sampling interval of 200 Myr. After 4 Gyr of integration, 43%\nand 70% of orbits have total energy and angular momentum errors within 10%,\nrespectively. Consequently, there is higher reliability in orbital shape\nparameters such as pericenters and apocenters, with errors $\\sim10\\%$ even\nafter multiple orbital periods. These techniques have diverse applications,\nincluding studying satellite disruption in cosmological contexts.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}