{"id":"2407.15666","title":"Particle Based Inference for Continuous-Discrete State Space Models","authors":"Christopher Stanton, Alexandros Beskos","authorsParsed":[["Stanton","Christopher",""],["Beskos","Alexandros",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:28:55 GMT"}],"updateDate":"2024-07-23","timestamp":1721658535000,"abstract":"  This article develops a methodology allowing application of the complete\nmachinery of particle-based inference methods upon what we call the class of\ncontinuous-discrete State Space Models (CD-SSMs). Such models correspond to a\nlatent continuous-time It\\^o diffusion process which is observed with noise at\ndiscrete time instances. Due to the continuous-time nature of the hidden\nsignal, standard Feynman-Kac formulations and their accompanying particle-based\napproximations have to overcome several challenges, arising mainly due to the\nfollowing considerations: (i) finite-time transition densities of the signal\nare typically intractable; (ii) ancestors of sampled signals are determined\nw.p.~1, thus cannot be resampled; (iii) diffusivity parameters given a sampled\nsignal yield Dirac distributions. We overcome all above issues by introducing a\nframework based on carefully designed proposals and transformations thereof.\nThat is, we obtain new expressions for the Feynman-Kac model that accommodate\nthe effects of a continuous-time signal and overcome induced degeneracies. The\nconstructed formulations will enable use of the full range of particle-based\nalgorithms for CD-SSMs: for filtering/smoothing and parameter inference,\nwhether online or offline. Our framework is compatible with guided proposals in\nthe filtering steps that are essential for efficient algorithmic performance in\nthe presence of informative observations or in higher dimensions, and is\napplicable for a very general class of CD-SSMs, including the case when the\nsignal is modelled as a hypo-elliptic diffusion. Our methods can be immediately\nincorporated to available software packages for particle-based algorithms.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JFtZjNP6COv_cpyV553tzU3JVVumvV2LAMJKB5PY-mA","pdfSize":"348803"}
