{"id":"2407.07196","title":"Large Language Models for Wearable Sensor-Based Human Activity\n  Recognition, Health Monitoring, and Behavioral Modeling: A Survey of Early\n  Trends, Datasets, and Challenges","authors":"Emilio Ferrara","authorsParsed":[["Ferrara","Emilio",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 19:25:32 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 19:19:29 GMT"}],"updateDate":"2024-08-02","timestamp":1720553132000,"abstract":"  The proliferation of wearable technology enables the generation of vast\namounts of sensor data, offering significant opportunities for advancements in\nhealth monitoring, activity recognition, and personalized medicine. However,\nthe complexity and volume of this data present substantial challenges in data\nmodeling and analysis, which have been tamed with approaches spanning time\nseries modeling to deep learning techniques. The latest frontier in this domain\nis the adoption of Large Language Models (LLMs), such as GPT-4 and Llama, for\ndata analysis, modeling, understanding, and generation of human behavior\nthrough the lens of wearable sensor data. This survey explores current trends\nand challenges in applying LLMs for sensor-based human activity recognition and\nbehavior modeling. We discuss the nature of wearable sensors data, the\ncapabilities and limitations of LLMs to model them and their integration with\ntraditional machine learning techniques. We also identify key challenges,\nincluding data quality, computational requirements, interpretability, and\nprivacy concerns. By examining case studies and successful applications, we\nhighlight the potential of LLMs in enhancing the analysis and interpretation of\nwearable sensors data. Finally, we propose future directions for research,\nemphasizing the need for improved preprocessing techniques, more efficient and\nscalable models, and interdisciplinary collaboration. This survey aims to\nprovide a comprehensive overview of the intersection between wearable sensors\ndata and LLMs, offering insights into the current state and future prospects of\nthis emerging field.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PN1V_hxo06njb-DHGF6eACnkF_Auc1srrCo9R8X9mUE","pdfSize":"353422"}
