{"id":"2407.06850","title":"Lattice-tunable substituted iron garnets for low-temperature magnonics","authors":"William Legrand, Yana Kemna, Stefan Sch\\\"aren, Hanchen Wang, Davit\n  Petrosyan, Luise Siegl, Richard Schlitz, Michaela Lammel, Pietro Gambardella","authorsParsed":[["Legrand","William",""],["Kemna","Yana",""],["Schären","Stefan",""],["Wang","Hanchen",""],["Petrosyan","Davit",""],["Siegl","Luise",""],["Schlitz","Richard",""],["Lammel","Michaela",""],["Gambardella","Pietro",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 13:34:17 GMT"}],"updateDate":"2024-07-10","timestamp":1720532057000,"abstract":"  The magnetic resonance of iron garnets is at the heart of rich physics and\nprovides a crucial technology used inside microwave components. A barrier still\nstands in the way of integrated cryogenic devices with iron garnets, because\ntheir epitaxy requires paramagnetic substrates that cause large microwave\nlosses at low temperatures. Finding alternative combinations of substrates and\nmagnetic garnets is thus essential to enabling cryogenic integrated magnonics.\nWith this motivation, we develop a new approach to the synthesis of epitaxial\ngarnet films, based on the co-sputtering of binary oxides, enabling a precise\nand continuous tuning of the iron garnet composition. By substituting a\ncontrolled proportion of the iron with additional yttrium, we obtain\nY$_{3}$(Y$_{x}$Fe$_{5-x}$)O$_{12}$ films of high crystalline quality that can\nbe lattice-matched to yttrium scandium gallium garnet (YSGG), a diamagnetic\nsubstrate suitable for low-temperature applications. Ferromagnetic resonance\nperformed at low temperatures confirms the elimination of substrate\nparamagnetism losses on YSGG. We also show that the\nY$_{3}$(Y$_{x}$Fe$_{5-x}$)O$_{12}$ system can be matched to other substrates,\nsuch as gadolinium yttrium scandium gallium garnet and gadolinium scandium\ngallium garnet. Additionally, we demonstrate that Bi-substituted films of\n(Bi$_{0.8}$Y$_{2.2}$)Fe$_{5}$O$_{12}$ also offer ideal lattice matching to YSGG\nfor low-temperature magnetic resonance. The present approach of controlled\nsubstitutions in iron garnets to obtain ideal lattice matching with diamagnetic\nsubstrates opens a very promising pathway to magnonic devices operating in\nlow-temperature environments.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"11hrk6L0t-mOa7SA8k-WYhLamVNNE8qiBlMcp4lMjDY","pdfSize":"13476198"}
