{"id":"2407.06186","title":"Earable and Wrist-worn Setup for Accurate Step Counting Utilizing\n  Body-Area Electrostatic Sensing","authors":"Sizhen Bian and Rakita Strahinja and Philipp Schilk and Cl\\'enin\n  Marc-Andr\\'e and Silvano Cortesi and Elio Reinschmidt and Kanika Dheman and\n  Michele Magno","authorsParsed":[["Bian","Sizhen",""],["Strahinja","Rakita",""],["Schilk","Philipp",""],["Marc-André","Clénin",""],["Cortesi","Silvano",""],["Reinschmidt","Elio",""],["Dheman","Kanika",""],["Magno","Michele",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:58:54 GMT"}],"updateDate":"2024-07-09","timestamp":1720461534000,"abstract":"  Step-counting has been widely implemented in wrist-worn devices and is\naccepted by end users as a quantitative indicator of everyday exercise.\nHowever, existing counting approach (mostly on wrist-worn setup) lacks\nrobustness and thus introduces inaccuracy issues in certain scenarios like\nbrief intermittent walking bouts and random arm motions or static arm status\nwhile walking (no clear correlation of motion pattern between arm and leg).\nThis paper proposes a low-power step-counting solution utilizing the body area\nelectric field acquired by a novel electrostatic sensing unit, consuming only\n87.3 $\\mu$W of power, hoping to strengthen the robustness of current dominant\nsolution. We designed two wearable devices for on-the-wrist and in-the-ear\ndeployment and collected body-area electric field-derived motion signals from\nten volunteers. Four walking scenarios are considered: in the parking\nlot/shopping center with/without pushing the shopping trolley. The\nstep-counting accuracy from the prototypes shows better accuracy than the\ncommercial wrist-worn devices (e.g.,96% of the wrist- and ear-worn prototype\nvs. 66% of the Fitbit when walking in the shopping center while pushing a\nshopping trolley). We finally discussed the potential and limitations of\nsensing body-area electric fields for wrist-worn and ear-worn step-counting and\nbeyond.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"weyO2TjWKN3E-SDJWU78fclZYMcYPn-ONM0KIp8ldVM","pdfSize":"2298052"}
