{"id":"2407.02319","title":"Catalogue of $C$-paired spin-valley locking in antiferromagnetic systems","authors":"Mengli Hu, Xingkai Cheng, Zhenqiao Huang, Junwei Liu","authorsParsed":[["Hu","Mengli",""],["Cheng","Xingkai",""],["Huang","Zhenqiao",""],["Liu","Junwei",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 14:50:59 GMT"}],"updateDate":"2024-07-03","timestamp":1719931859000,"abstract":"  Antiferromagnetic materials (AFMs) have been gaining lots of attentions due\nto its great potential in spintronics devices and the recently discovered novel\nspin structure in the momentum space, i.e., $C$-paired spin-valley or\nspin-momentum locking (CSVL), where spins and valleys/momenta are locked to\neach other due to the crystal symmetry guaranteeing zero magnetization. Here,\nwe systematically studied CSVLs and proposed a general theory and algorithm\nusing little co-group and coset representatives, which reveals that 12\nelementary kinds of CSVLs, determined by the geometric relation of spins and\nvalleys and the essential symmetry guaranteeing zero magnetization, are\nsufficient to fully represent all possible CSVLs. By combining the proposed\nalgorithm and high-throughput first-principles calculations, we predicted 38\nmagnetic point groups and identified 140 experimentally verified AFMs that can\nrealize CSVL. Besides predicting new materials, our theory can naturally reveal\nunderlying mechanisms of CSVLs' responses to external fields. As an example,\ntwo qualitatively different types of piezomagnetism via occupation imbalance or\nspin tilting were predicted in RuO$_2$. The algorithm and conclusions can be\ndirectly extended to the locking between valley/momentum and any other\npseudo-vector degree of freedom, e.g. Berry curvature, as exemplified in\nRuO$_2$, and the proposed concept and methodology can be straightforwardly\napplied to other symmetry groups such as spin space group.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}