{"id":"2407.04163","title":"The IACOB project XII. A new grid of northern standards for the spectral\n  classification of B-type stars","authors":"Ignacio Negueruela (Alicante), Sergio Sim\\'on-D\\'iaz, Abel de Burgos\n  (IAC, ULL), Alba Casasbuenas (NOT, ULL), Paul G. Beck (IAC, ULL)","authorsParsed":[["Negueruela","Ignacio","","Alicante"],["Simón-Díaz","Sergio","","IAC, ULL"],["de Burgos","Abel","","IAC, ULL"],["Casasbuenas","Alba","","NOT, ULL"],["Beck","Paul G.","","IAC, ULL"]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 21:36:43 GMT"}],"updateDate":"2024-07-08","timestamp":1720129003000,"abstract":"  With the advent of large spectroscopic surveys, automated stellar parameter\ndetermination has become commonplace. Nevertheless, spectral classification\nstill offers a quick and useful alternative for obtaining parameter estimates\nfor large samples of spectra of varying quality. We present a new atlas of\nstellar spectra covering the B-type range, with the intention of providing\ndetailed classification criteria valid for modern spectra and improving the\ngrid of reliable standards. This new grid will be used in future works to\nprovide classification criteria beyond the classical classification range and\naddressing, in particular, the use of Gaia/RVS spectra. We analysed historical\nstandards by means of multiple high-resolution spectra, marking out problematic\ncases and complementing the grid with a new set of reliable comparators. We\nthen elaborated on a new set of classification criteria based on high-quality\nR=4000 spectra. Our new classification grid is much thicker than any previous\nset of standards, presenting a high degree of self-consistency. Although it is\nbased entirely on morphological criteria, the grid demonstrates a much better\ncorrelation with different physical parameters. The new grid can be used to\nstudy classification criteria in other spectral ranges, providing a valuable\ntool for the study of B-type stars that covers a very wide range of\ntemperatures, luminosities, and stellar masses. The very process of\nclassification also offers valuable insights into stellar evolution.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}