{"id":"2407.14772","title":"Subgraph Clustering and Atom Learning for Improved Image Classification","authors":"Aryan Singh, Pepijn Van de Ven, Ciar\\'an Eising, Patrick Denny","authorsParsed":[["Singh","Aryan",""],["Van de Ven","Pepijn",""],["Eising","Ciarán",""],["Denny","Patrick",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 06:32:00 GMT"}],"updateDate":"2024-07-23","timestamp":1721457120000,"abstract":"  In this study, we present the Graph Sub-Graph Network (GSN), a novel hybrid\nimage classification model merging the strengths of Convolutional Neural\nNetworks (CNNs) for feature extraction and Graph Neural Networks (GNNs) for\nstructural modeling. GSN employs k-means clustering to group graph nodes into\nclusters, facilitating the creation of subgraphs. These subgraphs are then\nutilized to learn representative `atoms` for dictionary learning, enabling the\nidentification of sparse, class-distinguishable features. This integrated\napproach is particularly relevant in domains like medical imaging, where\ndiscerning subtle feature differences is crucial for accurate classification.\n  To evaluate the performance of our proposed GSN, we conducted experiments on\nbenchmark datasets, including PascalVOC and HAM10000. Our results demonstrate\nthe efficacy of our model in optimizing dictionary configurations across varied\nclasses, which contributes to its effectiveness in medical classification\ntasks. This performance enhancement is primarily attributed to the integration\nof CNNs, GNNs, and graph learning techniques, which collectively improve the\nhandling of datasets with limited labeled examples. Specifically, our\nexperiments show that the model achieves a higher accuracy on benchmark\ndatasets such as Pascal VOC and HAM10000 compared to conventional CNN\napproaches.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nR_8N6wj-2x4B0mtClLqp2f0srnIsXKN--nw3MBiUa4","pdfSize":"2603595"}
