{"id":"2407.20860","title":"The PARSEC view of star formation in galaxy centres: from protoclusters\n  to star clusters in an early-type spiral","authors":"Almudena Prieto, Gladis Magris C., Gustavo Bruzual, Juan A.\n  Fern\\'andez-Ontiveros and Andreas Burkert","authorsParsed":[["Prieto","Almudena",""],["C.","Gladis Magris",""],["Bruzual","Gustavo",""],["Fernández-Ontiveros","Juan A.",""],["Burkert","Andreas",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 14:35:32 GMT"}],"updateDate":"2024-07-31","timestamp":1722350132000,"abstract":"  Understanding star formation in galaxies requires resolving the physical\nscale on which star formation often occurs: the scale of star clusters. We\npresent a multiwavelength, eight-parsec resolution study of star formation in\nthe circumnuclear star cluster and molecular gas rings of the early-type spiral\nNGC 1386. The cluster ring formed simultaneously ~ 4 Myr ago. The clusters have\nsimilar properties in terms of mass and star formation rate, resembling those\nof H II regions in the Milky Way disc. The molecular CO gas resolves into long\nfilaments, which define a secondary ring detached from the cluster ring. Most\nclusters are in CO voids. Their separation with respect the CO filaments is\nreminiscent of that seen in galaxy spiral arms. By analogy, we propose that a\ndensity wave through the disc of this galaxy may have produced this gap in the\ncentral kpc. The CO filaments fragment into strings of dense, unresolved clouds\nwith no evidence of a stellar counterpart. These clouds may be the sites of a\nfuture population of clusters in the ring. The free-fall time of these clouds,\n~ 10 Myr, is close to the orbital time of the CO ring. This coincidence could\nlead to a synchronous bursting ring, as is the case for the current ring. The\ninward spiralling morphology of the CO filaments and co-spatiality with\nequivalent kpc-scale dust filaments are suggestive of their role as matter\ncarriers from the galaxy outskirts to feed the molecular ring and a moderate\nactive nucleus.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}