{"id":"2407.10774","title":"Multi-Objective Optimization and Multi-Criteria Decision-Making Approach\n  to Design Multi-Tubular Packed-Bed Membrane Reactor in Oxidative\n  Dehydrogenation of Ethane","authors":"Seyed Reza Nabavi, Zhiyuan Wang, Mar\\'ia Laura Rodr\\'iguez","authorsParsed":[["Nabavi","Seyed Reza",""],["Wang","Zhiyuan",""],["Rodríguez","María Laura",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 14:54:55 GMT"}],"updateDate":"2024-07-16","timestamp":1721055295000,"abstract":"  Ethylene is a crucial chemical in manufacturing numerous consumer products.\nIn recent years, the oxidative dehydrogenation of ethane (ODHE) technique has\ngarnered significant interest as a means for ethylene production due to its\nhigh ethylene selectivity and energy efficiency, the availability of ethane as\na feedstock, and catalysts that can improve the performance of the process.\nThis work delves into determining the optimal operating conditions for the ODHE\nprocess within a multi-tubular packed-bed membrane reactor by formulating and\nresolving multi-objective optimization (MOO) problems. The elitist\nnon-dominated sorting genetic algorithm II (NSGA-II) method is employed in\nconjunction with three different multi-criteria decision-making (MCDM) methods:\n(i) technique for order of preference by similarity to ideal solution (TOPSIS),\n(ii) preference ranking on the basis of ideal-average distance (PROBID), and\n(iii) simple additive weighting (SAW), to solve the MOO problems, obtain the\noptimal Pareto frontier, and recommend one solution for ultimate\nimplementation. Through this approach, this work elucidates the trade-offs\nbetween conflicting objectives, deepens the comprehension of their\ninterrelationships, and underscores the effects of decision variables on the\noptimization objectives. Consequently, this work provides practitioners with\nthe insights needed for informed decision-making in the ODHE process operation.\n","subjects":["Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}