{"id":"2407.02340","title":"RVISA: Reasoning and Verification for Implicit Sentiment Analysis","authors":"Wenna Lai, Haoran Xie, Guandong Xu, Qing Li","authorsParsed":[["Lai","Wenna",""],["Xie","Haoran",""],["Xu","Guandong",""],["Li","Qing",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 15:07:54 GMT"}],"updateDate":"2024-07-03","timestamp":1719932874000,"abstract":"  With an increasing social demand for fine-grained sentiment analysis (SA),\nimplicit sentiment analysis (ISA) poses a significant challenge with the\nabsence of salient cue words in expressions. It necessitates reliable reasoning\nto understand how the sentiment is aroused and thus determine implicit\nsentiments. In the era of Large Language Models (LLMs), Encoder-Decoder (ED)\nLLMs have gained popularity to serve as backbone models for SA applications,\nconsidering impressive text comprehension and reasoning ability among diverse\ntasks. On the other hand, Decoder-only (DO) LLMs exhibit superior natural\nlanguage generation and in-context learning capabilities. However, their\nresponses may contain misleading or inaccurate information. To identify\nimplicit sentiment with reliable reasoning, this study proposes RVISA, a\ntwo-stage reasoning framework that harnesses the generation ability of DO LLMs\nand the reasoning ability of ED LLMs to train an enhanced reasoner.\nSpecifically, we adopt three-hop reasoning prompting to explicitly furnish\nsentiment elements as cues. The generated rationales are utilized to fine-tune\nan ED LLM into a skilled reasoner. Additionally, we develop a straightforward\nyet effective verification mechanism to ensure the reliability of the reasoning\nlearning. We evaluated the proposed method on two benchmark datasets and\nachieved state-of-the-art results in ISA performance.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"TYtagoyOt2PJ0H0-L3dMD7EZtKfAkJL3ZcPKos55Psg","pdfSize":"5512578"}
