{"id":"2407.18085","title":"On the Design of Ethereum Data Availability Sampling: A Comprehensive\n  Simulation Study","authors":"Arunima Chaudhuri, Sudipta Basak, Csaba Kiraly, Dmitriy Ryajov,\n  Leonardo Bautista-Gomez","authorsParsed":[["Chaudhuri","Arunima",""],["Basak","Sudipta",""],["Kiraly","Csaba",""],["Ryajov","Dmitriy",""],["Bautista-Gomez","Leonardo",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 14:47:41 GMT"}],"updateDate":"2024-07-26","timestamp":1721918861000,"abstract":"  This paper presents an in-depth exploration of Data Availability Sampling\n(DAS) and sharding mechanisms within decentralized systems through\nsimulation-based analysis. DAS, a pivotal concept in blockchain technology and\ndecentralized networks, is thoroughly examined to unravel its intricacies and\nassess its impact on system performance. Through the development of a simulator\ntailored explicitly for DAS, we embark on a comprehensive investigation into\nthe parameters that influence system behavior and efficiency. A series of\nexperiments are conducted within the simulated environment to validate\ntheoretical formulations and dissect the interplay of DAS parameters. This\nincludes an exploration of approaches such as custody by row, variations in\nvalidators per node, and malicious nodes. The outcomes of these experiments\nfurnish insights into the efficacy of DAS protocols and pave the way for the\nformulation of optimization strategies geared towards enhancing decentralized\nnetwork performance. Moreover, the findings serve as guidelines for future\nresearch endeavors, offering a nuanced understanding of the complexities\ninherent in decentralized systems. This study not only contributes to the\ntheoretical understanding of DAS but also offers practical implications for the\ndesign, implementation, and optimization of decentralized systems.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}