{"id":"2407.19200","title":"On Behalf of the Stakeholders: Trends in NLP Model Interpretability in\n  the Era of LLMs","authors":"Nitay Calderon, Roi Reichart","authorsParsed":[["Calderon","Nitay",""],["Reichart","Roi",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 08:00:27 GMT"}],"updateDate":"2024-07-30","timestamp":1722067227000,"abstract":"  Recent advancements in NLP systems, particularly with the introduction of\nLLMs, have led to widespread adoption of these systems by a broad spectrum of\nusers across various domains, impacting decision-making, the job market,\nsociety, and scientific research. This surge in usage has led to an explosion\nin NLP model interpretability and analysis research, accompanied by numerous\ntechnical surveys. Yet, these surveys often overlook the needs and perspectives\nof explanation stakeholders. In this paper, we address three fundamental\nquestions: Why do we need interpretability, what are we interpreting, and how?\nBy exploring these questions, we examine existing interpretability paradigms,\ntheir properties, and their relevance to different stakeholders. We further\nexplore the practical implications of these paradigms by analyzing trends from\nthe past decade across multiple research fields. To this end, we retrieved\nthousands of papers and employed an LLM to characterize them. Our analysis\nreveals significant disparities between NLP developers and non-developer users,\nas well as between research fields, underscoring the diverse needs of\nstakeholders. For example, explanations of internal model components are rarely\nused outside the NLP field. We hope this paper informs the future design,\ndevelopment, and application of methods that align with the objectives and\nrequirements of various stakeholders.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"EFxDdXfb40-PeuSqzvnQ2OgfyAK2UkbAyO4kCAcYv9A","pdfSize":"1188657","objectId":"0xed94ba3e73bc3bbcd55b02f06730c34c8d50038284dc9100f6fa8ee13f1e9421","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
