{"id":"2407.02482","title":"Boosting Consistency in Story Visualization with Rich-Contextual\n  Conditional Diffusion Models","authors":"Fei Shen, Hu Ye, Sibo Liu, Jun Zhang, Cong Wang, Xiao Han, Wei Yang","authorsParsed":[["Shen","Fei",""],["Ye","Hu",""],["Liu","Sibo",""],["Zhang","Jun",""],["Wang","Cong",""],["Han","Xiao",""],["Yang","Wei",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 17:58:07 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 18:17:01 GMT"}],"updateDate":"2024-07-08","timestamp":1719943087000,"abstract":"  Recent research showcases the considerable potential of conditional diffusion\nmodels for generating consistent stories. However, current methods, which\npredominantly generate stories in an autoregressive and excessively\ncaption-dependent manner, often underrate the contextual consistency and\nrelevance of frames during sequential generation. To address this, we propose a\nnovel Rich-contextual Conditional Diffusion Models (RCDMs), a two-stage\napproach designed to enhance story generation's semantic consistency and\ntemporal consistency. Specifically, in the first stage, the frame-prior\ntransformer diffusion model is presented to predict the frame semantic\nembedding of the unknown clip by aligning the semantic correlations between the\ncaptions and frames of the known clip. The second stage establishes a robust\nmodel with rich contextual conditions, including reference images of the known\nclip, the predicted frame semantic embedding of the unknown clip, and text\nembeddings of all captions. By jointly injecting these rich contextual\nconditions at the image and feature levels, RCDMs can generate semantic and\ntemporal consistency stories. Moreover, RCDMs can generate consistent stories\nwith a single forward inference compared to autoregressive models. Our\nqualitative and quantitative results demonstrate that our proposed RCDMs\noutperform in challenging scenarios. The code and model will be available at\nhttps://github.com/muzishen/RCDMs.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}