{"id":"2407.06161","title":"Magnetic dipole ${\\gamma}$-ray strength functions in the crossover from\n  spherical to deformed neodymium isotopes","authors":"A. Mercenne, P. Fanto, W. Ryssens, Y. Alhassid","authorsParsed":[["Mercenne","A.",""],["Fanto","P.",""],["Ryssens","W.",""],["Alhassid","Y.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:36:00 GMT"}],"updateDate":"2024-07-09","timestamp":1720460160000,"abstract":"  We calculate the magnetic dipole $\\gamma$-ray strength functions in a chain\nof even-mass neodymium isotopes $^{144-152}$Nd in the framework of the\nconfiguration-interaction (CI) shell model. We infer the strength function by\napplying the maximum entropy method (MEM) to the exact imaginary-time response\nfunction calculated with the shell-model Monte Carlo (SMMC) method. The success\nof the MEM depends on the choice of a good strength function as a prior\ndistribution. We investigate two choices for the prior strength function: the\nstatic path approximation (SPA) and the quasiparticle random-phase\napproximation (QRPA). We find that the QRPA is a better approximation at low\ntemperatures (i.e., near the ground state), while the SPA is a better choice at\nfinite temperatures. We identify a low-energy enhancement (LEE) in the MEM\ndeexcitation $M1$ strength functions of the even-mass neodymium isotopes and\ncompare with recent experimental results for the total deexcitation\n$\\gamma$-ray strength functions. The LEE is already seen in the SPA strength\nfunction but not in the QRPA strength function, indicating the importance of\nlarge-amplitude static fluctuations around the mean field in reproducing the\nLEE. Our method is currently the only one which can reproduce LEE in heavy\nopen-shell nuclei where conventional CI shell model calculations are\nprohibited. With the onset of deformation as number of neutrons increases along\nthe chain of neodymium isotopes, we observe that some of the LEE strength\ntransfers to a low-energy excitation, which we interpret as a\nfinite-temperature \"scissors\" mode. We also observe a finite-temperature\nspin-flip mode.\n","subjects":["Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}