{"id":"2407.10578","title":"Multifrequency polarimetry of High-Synchrotron Peaked blazars probes the\n  shape of their jets","authors":"F. Bolis, E. Sobacchi, F. Tavecchio","authorsParsed":[["Bolis","F.",""],["Sobacchi","E.",""],["Tavecchio","F.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 09:56:41 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 11:55:12 GMT"}],"updateDate":"2024-08-12","timestamp":1721037401000,"abstract":"  Multifrequency polarimetry is emerging as a powerful probe of blazar jets,\nespecially due to the advent of the Imaging X-ray Polarimetry Explorer (IXPE)\nspace observatory. We study the polarization of High-Synchrotron Peaked (HSP)\nblazars, where both optical and X-ray emission can be attributed to synchrotron\nradiation from a population of non-thermal electrons. We adopt an axisymmetric\nstationary force-free jet model, where the electromagnetic fields are\ndetermined by the jet shape. When the jet is nearly parabolic, the X-ray\npolarization degree is $\\Pi_{\\rm X}\\sim 15-50\\%$, and the optical polarization\ndegree is $\\Pi_{\\rm O}\\sim 5-25\\%$. The polarization degree is strongly\nchromatic, as $\\Pi_{\\rm X}/\\Pi_{\\rm O}\\sim 2-9$. The chromaticity is due to the\nsoftening of the electron distribution at high energies, and is much stronger\nthan for a uniform magnetic field. The Electric Vector Position Angle (EVPA) is\naligned with the projection of the jet axis on the plane of the sky. These\nresults compare very well with multifrequency polarimetric observations of HSP\nblazars. Instead, when the jet is nearly cylindrical, the polarization degree\nis large and weakly chromatic (we find $\\Pi_{\\rm X}\\sim 70\\%$ and $\\Pi_{\\rm\nO}\\sim 60\\%$, close to the expected values for a uniform magnetic field). The\nEVPA is perpendicular to the projection of the jet axis on the plane of the\nsky. Then, a cylindrical geometry is practically ruled out by current\nobservations. The polarization degree and the EVPA may be less sensitive to the\nspecific particle acceleration process (e.g.,~magnetic reconnection or shocks)\nthan previously thought.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oshF3YrK__vt_6kl89-vc4NpelFrZlciPC09jECDdv0","pdfSize":"593488","objectId":"0x5010a9eedf2a81d752e2b2e7359628da88fa59ec403b7bf5f96a7b4db5d81448","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
