{"id":"2407.06206","title":"The Impact of an XAI-Augmented Approach on Binary Classification with\n  Scarce Data","authors":"Ximing Wen, Rosina O. Weber, Anik Sen, Darryl Hannan, Steven C.\n  Nesbit, Vincent Chan, Alberto Goffi, Michael Morris, John C. Hunninghake,\n  Nicholas E. Villalobos, Edward Kim, Christopher J. MacLellan","authorsParsed":[["Wen","Ximing",""],["Weber","Rosina O.",""],["Sen","Anik",""],["Hannan","Darryl",""],["Nesbit","Steven C.",""],["Chan","Vincent",""],["Goffi","Alberto",""],["Morris","Michael",""],["Hunninghake","John C.",""],["Villalobos","Nicholas E.",""],["Kim","Edward",""],["MacLellan","Christopher J.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 21:09:31 GMT"}],"updateDate":"2024-07-10","timestamp":1719868171000,"abstract":"  Point-of-Care Ultrasound (POCUS) is the practice of clinicians conducting and\ninterpreting ultrasound scans right at the patient's bedside. However, the\nexpertise needed to interpret these images is considerable and may not always\nbe present in emergency situations. This reality makes algorithms such as\nmachine learning classifiers extremely valuable to augment human decisions.\nPOCUS devices are becoming available at a reasonable cost in the size of a\nmobile phone. The challenge of turning POCUS devices into life-saving tools is\nthat interpretation of ultrasound images requires specialist training and\nexperience. Unfortunately, the difficulty to obtain positive training images\nrepresents an important obstacle to building efficient and accurate\nclassifiers. Hence, the problem we try to investigate is how to explore\nstrategies to increase accuracy of classifiers trained with scarce data. We\nhypothesize that training with a few data instances may not suffice for\nclassifiers to generalize causing them to overfit. Our approach uses an\nExplainable AI-Augmented approach to help the algorithm learn more from less\nand potentially help the classifier better generalize.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}