{"id":"2407.14112","title":"Large Language Model Enabled Semantic Communication Systems","authors":"Zhenyi Wang, Li Zou, Shengyun Wei, Feifan Liao, Jia Zhuo, Haibo Mi,\n  Rongxuan Lai","authorsParsed":[["Wang","Zhenyi",""],["Zou","Li",""],["Wei","Shengyun",""],["Liao","Feifan",""],["Zhuo","Jia",""],["Mi","Haibo",""],["Lai","Rongxuan",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 08:29:23 GMT"}],"updateDate":"2024-07-22","timestamp":1721377763000,"abstract":"  Large language models (LLMs) have recently demonstrated state-of-the-art\nperformance across various natural language processing (NLP) tasks, achieving\nnear-human levels in multiple language understanding challenges and aligning\nclosely with the core principles of semantic communication. Inspired by LLMs'\nadvancements in semantic processing, we propose an innovative LLM-enabled\nsemantic communication system framework, named LLM-SC, that applies LLMs\ndirectly to the physical layer coding and decoding for the first time. By\nanalyzing the relationship between the training process of LLMs and the\noptimization objectives of semantic communication, we propose training a\nsemantic encoder through LLMs' tokenizer training and establishing a semantic\nknowledge base via the LLMs' unsupervised pre-training process. This knowledge\nbase aids in constructing the optimal decoder by providing the prior\nprobability of the transmitted language sequence. Based on this foundation, we\nderive the optimal decoding criterion for the receiver and introduce the beam\nsearch algorithm to further reduce the complexity. Furthermore, we assert that\nexisting LLMs can be employed directly for LLM-SC without additional\nre-training or fine-tuning. Simulation results demonstrate that LLM-SC\noutperforms classical DeepSC at signal-to-noise ratios (SNR) exceeding 3 dB,\nenabling error-free transmission of semantic information under high SNR, which\nis unattainable by DeepSC. In addition to semantic-level performance, LLM-SC\ndemonstrates compatibility with technical-level performance, achieving\napproximately 8 dB coding gain for a bit error ratio (BER) of $10^{-3}$ without\nany channel coding while maintaining the same joint source-channel coding rate\nas traditional communication systems.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}