{"id":"2407.21088","title":"Hydrogen Diffusion in Magnesium Using Machine Learning Potentials","authors":"Andrea Angeletti, Luca Leoni, Dario Massa, Luca Pasquini, Stefanos\n  Papanikolaou and Cesare Franchini","authorsParsed":[["Angeletti","Andrea",""],["Leoni","Luca",""],["Massa","Dario",""],["Pasquini","Luca",""],["Papanikolaou","Stefanos",""],["Franchini","Cesare",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 15:05:01 GMT"}],"updateDate":"2024-08-01","timestamp":1722351901000,"abstract":"  Understanding and accurately predicting hydrogen diffusion in materials is\nchallenging due to the complex interactions between hydrogen defects and the\ncrystal lattice. These interactions span large length and time scales, making\nthem difficult to address with standard ab initio techniques. This work\naddresses this challenge by employing accelerated machine learning (ML)\nmolecular dynamics simulations through active learning. We conduct a\ncomparative study of different ML-based interatomic potential schemes,\nincluding VASP, MACE, and CHGNet, utilizing various training strategies such as\non-the-fly learning, pre-trained universal models, and fine-tuning. We obtain\nan optimal hydrogen diffusion coefficient value of \\(2.1 \\cdot 10^{-8}\\)\nm\\(^2\\)/s at 673 K in MgH\\(_{0.06}\\), which aligns exceptionally well with\nexperimental results, underlining the efficacy and accuracy of ML-assisted\nmethodologies in the context of diffusive dynamics. Particularly, our procedure\nsignificantly reduces the computational effort associated with traditional\ntransition state calculations or ad-hoc designed interatomic potentials. The\nresults highlight the limitations of pre-trained universal solutions for\ndefective materials and how they can be improved by fine-tuning. Specifically,\nfine-tuning the models on a database produced during on-the-fly training of\nVASP ML force field allows the retrieving of DFT-level accuracy at a fraction\nof the computational cost.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Other Condensed Matter","Physics/Chemical Physics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}