{"id":"2407.03588","title":"FDS: Feedback-guided Domain Synthesis with Multi-Source Conditional\n  Diffusion Models for Domain Generalization","authors":"Mehrdad Noori, Milad Cheraghalikhani, Ali Bahri, Gustavo Adolfo Vargas\n  Hakim, David Osowiechi, Moslem Yazdanpanah, Ismail Ben Ayed, Christian\n  Desrosiers","authorsParsed":[["Noori","Mehrdad",""],["Cheraghalikhani","Milad",""],["Bahri","Ali",""],["Hakim","Gustavo Adolfo Vargas",""],["Osowiechi","David",""],["Yazdanpanah","Moslem",""],["Ayed","Ismail Ben",""],["Desrosiers","Christian",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 02:45:29 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 16:26:41 GMT"}],"updateDate":"2024-07-25","timestamp":1720061129000,"abstract":"  Domain Generalization techniques aim to enhance model robustness by\nsimulating novel data distributions during training, typically through various\naugmentation or stylization strategies. However, these methods frequently\nsuffer from limited control over the diversity of generated images and lack\nassurance that these images span distinct distributions. To address these\nchallenges, we propose FDS, Feedback-guided Domain Synthesis, a novel strategy\nthat employs diffusion models to synthesize novel, pseudo-domains by training a\nsingle model on all source domains and performing domain mixing based on\nlearned features. By incorporating images that pose classification challenges\nto models trained on original samples, alongside the original dataset, we\nensure the generation of a training set that spans a broad distribution\nspectrum. Our comprehensive evaluations demonstrate that this methodology sets\nnew benchmarks in domain generalization performance across a range of\nchallenging datasets, effectively managing diverse types of domain shifts. The\nimplementation is available at: \\url{https://github.com/Mehrdad-Noori/FDS.git}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}