{"id":"2407.00682","title":"UWBAD: Towards Effective and Imperceptible Jamming Attacks Against UWB\n  Ranging Systems with COTS Chips","authors":"Yuqiao Yang, Zhongjie Wu, Yongzhao Zhang, Ting Chen, Jun Li, Jie Yang,\n  Wenhao Liu, Xiaosong Zhang, Ruicong Shi, Jingwei Li, Yu Jiang, Zhuo Su","authorsParsed":[["Yang","Yuqiao",""],["Wu","Zhongjie",""],["Zhang","Yongzhao",""],["Chen","Ting",""],["Li","Jun",""],["Yang","Jie",""],["Liu","Wenhao",""],["Zhang","Xiaosong",""],["Shi","Ruicong",""],["Li","Jingwei",""],["Jiang","Yu",""],["Su","Zhuo",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 12:42:11 GMT"}],"updateDate":"2024-07-02","timestamp":1719751331000,"abstract":"  UWB ranging systems have been adopted in many critical and security sensitive\napplications due to its precise positioning and secure ranging capabilities. We\npresent a practical jamming attack, namely UWBAD, against commercial UWB\nranging systems, which exploits the vulnerability of the adoption of the\nnormalized cross-correlation process in UWB ranging and can selectively and\nquickly block ranging sessions without prior knowledge of the configurations of\nthe victim devices, potentially leading to severe consequences such as property\nloss, unauthorized access, or vehicle theft. UWBAD achieves more effective and\nless imperceptible jamming due to: (i) it efficiently blocks every ranging\nsession by leveraging the field-level jamming, thereby exerting a tangible\nimpact on commercial UWB ranging systems, and (ii) the compact, reactive, and\nselective system design based on COTS UWB chips, making it affordable and less\nimperceptible. We successfully conducted real attacks against commercial UWB\nranging systems from the three largest UWB chip vendors on the market, e.g.,\nApple, NXP, and Qorvo. We reported our findings to Apple, related Original\nEquipment Manufacturers (OEM), and the Automotive Security Research Group,\ntriggering internal security incident response procedures at Volkswagen, Audi,\nBosch, and NXP. As of the writing of this paper, the related OEM has\nacknowledged this vulnerability in their automotive systems and has offered a\n$5,000 reward as a bounty.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}