{"id":"2407.09723","title":"Buffer-less Gallium Nitride High Electron Mobility Heterostructures on\n  Silicon","authors":"Saptarsi Ghosh, Martin Frentrup, Alexander M. Hinz, James W. Pomeroy,\n  Daniel Field, David J. Wallis, Martin Kuball, and Rachel A. Oliver","authorsParsed":[["Ghosh","Saptarsi",""],["Frentrup","Martin",""],["Hinz","Alexander M.",""],["Pomeroy","James W.",""],["Field","Daniel",""],["Wallis","David J.",""],["Kuball","Martin",""],["Oliver","Rachel A.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 23:39:37 GMT"}],"updateDate":"2024-07-16","timestamp":1720827577000,"abstract":"  Thick metamorphic buffers are perceived to be indispensable for the\nheteroepitaxial integration of III-V semiconductors on silicon substrates with\nlarge thermal expansion and lattice mismatches. However, III-nitride buffers in\nconventional GaN-on-Si high electron mobility transistor (HEMT)\nheterostructures impose a substantial thermal resistance, throttling heat\nextraction, which reduces device efficiency and lifetime. Herein, bypassing the\nbuffer, we demonstrate the direct growth of GaN after the AlN nucleation layer\non silicon by metal-organic vapor phase epitaxy (MOVPE). By varying reactor\npressure, we modulate the growth stress in the submicron epilayers and realise\nthreading dislocation densities similar to that in thick buffered structures.\nWe achieve a GaN-to-substrate thermal resistance of (11(+/-)4) ((m^2)K(GW^-1)),\nan order of magnitude reduction over conventional designs on silicon and one of\nthe lowest on any non-native substrate. AlGaN/AlN/GaN heterojunctions on this\nplatform show a characteristic 2D electron gas (2DEG), the room-temperature\nHall-effect mobility of which, at over 2000 (cm^2/(V-s)), rivals the\nbest-reported values. The low-temperature magnetoresistance of this 2DEG shows\nclear Shubnikov-de-Haas oscillations, a quantum lifetime > 0.180 ps, and\ntell-tale signatures of spin-splitting. These results may establish a new\nparadigm for nitride HEMTs, potentially accelerating applications from\nenergy-efficient transistors to fundamental investigations on electron dynamics\nin this 2D wide-bandgap system.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nL3oauZuDAEajEK3iol561r7vYYpTO2eJu_gZ7Z4wTI","pdfSize":"2715476"}
