{"id":"2407.19543","title":"Global Optimization via Quadratic Disjunctive Programming for Water\n  Networks Design with Energy Recovery","authors":"Carolina Trist\\'an, Marcos Fallanza, Raquel Ib\\'a\\~nez, Ignacio E.\n  Grossmann, and David E. Bernal","authorsParsed":[["Tristán","Carolina",""],["Fallanza","Marcos",""],["Ibáñez","Raquel",""],["Grossmann","Ignacio E.",""],["Bernal","David E.",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 17:26:55 GMT"}],"updateDate":"2024-07-30","timestamp":1722187615000,"abstract":"  Generalized disjunctive programming (GDP) models with bilinear and concave\nconstraints, often seen in water network design, are challenging optimization\nproblems. This work proposes quadratic and piecewise linear approximations for\nnonlinear terms to reformulate GDP models into quadratic GDP (QGDP) models that\nsuitable solvers may solve more efficiently. We illustrate the benefits of the\nquadratic reformulation with a water treatment network design problem in which\nnonconvexities arise from bilinear terms in the mixers' mass balances and\nconcave investment cost functions of treatment units. Given the similarities\nwith water network design problems, we suggest quadratic approximation for the\nGDP model for the optimal design of a large-scale reverse electrodialysis (RED)\nprocess. This power technology can recover energy from salinity differences\nbetween by-product streams of the water sector, such as desalination brine\nmixed with regenerated wastewater effluents. The solver Gurobi excels in\nhandling QGDP problems, but weighing the problem's precision and tractability\nbalance is crucial. The piecewise linear approximation yields more accurate,\nyet larger QGDP models that may require longer optimization times in\nlarge-scale process synthesis problems.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"JwW029B2IKKYVwOaNXti5IaWlAv6TtHKuqYicn6zB70","pdfSize":"88427"}
