{"id":"2407.16567","title":"CASTRO -- Efficient constrained sampling method for material and\n  chemical experimental design","authors":"Christina Schenk, Maciej Haranczyk","authorsParsed":[["Schenk","Christina",""],["Haranczyk","Maciej",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 15:21:30 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 07:45:04 GMT"}],"updateDate":"2024-07-30","timestamp":1721748090000,"abstract":"  The exploration of multicomponent material composition space requires\nsignificant time and financial investments, necessitating efficient use of\nresources for statistically relevant compositions. This article introduces a\nnovel methodology, implemented in the open-source CASTRO (ConstrAined\nSequential laTin hypeRcube sampling methOd) software package, to overcome\nequality-mixture constraints and ensure comprehensive design space coverage.\nOur approach leverages Latin hypercube sampling (LHS) and LHS with\nmultidimensional uniformity (LHSMDU) using a divide-and-conquer strategy to\nmanage high-dimensional problems effectively. By incorporating previous\nexperimental knowledge within a limited budget, our method strategically\nrecommends a feasible number of experiments to explore the design space. We\nvalidate our methodology with two examples: a four-dimensional problem with\nnear-uniform distributions and a nine-dimensional problem with additional\nmixture constraints, yielding specific component distributions. Our constrained\nsequential LHS or LHSMDU approach enables thorough design space exploration,\nproving robustness for experimental design. This research not only advances\nmaterial science but also offers promising solutions for efficiency challenges\nin pharmaceuticals and chemicals. CASTRO and the case studies are available for\nfree download on GitHub.\n","subjects":["Statistics/Computation","Condensed Matter/Materials Science","Physics/Data Analysis, Statistics and Probability","Statistics/Applications","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"0tSY0yy_9WPqauInBqILM_o9pefnyCVvA9Bd7koJdUM","pdfSize":"1251642"}
