{"id":"2407.01624","title":"Guided Trajectory Generation with Diffusion Models for Offline\n  Model-based Optimization","authors":"Taeyoung Yun, Sujin Yun, Jaewoo Lee, and Jinkyoo Park","authorsParsed":[["Yun","Taeyoung",""],["Yun","Sujin",""],["Lee","Jaewoo",""],["Park","Jinkyoo",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 06:12:36 GMT"}],"updateDate":"2024-07-03","timestamp":1719641556000,"abstract":"  Optimizing complex and high-dimensional black-box functions is ubiquitous in\nscience and engineering fields. Unfortunately, the online evaluation of these\nfunctions is restricted due to time and safety constraints in most cases. In\noffline model-based optimization (MBO), we aim to find a design that maximizes\nthe target function using only a pre-existing offline dataset. While prior\nmethods consider forward or inverse approaches to address the problem, these\napproaches are limited by conservatism and the difficulty of learning highly\nmulti-modal mappings. Recently, there has been an emerging paradigm of learning\nto improve solutions with synthetic trajectories constructed from the offline\ndataset. In this paper, we introduce a novel conditional generative modeling\napproach to produce trajectories toward high-scoring regions. First, we\nconstruct synthetic trajectories toward high-scoring regions using the dataset\nwhile injecting locality bias for consistent improvement directions. Then, we\ntrain a conditional diffusion model to generate trajectories conditioned on\ntheir scores. Lastly, we sample multiple trajectories from the trained model\nwith guidance to explore high-scoring regions beyond the dataset and select\nhigh-fidelity designs among generated trajectories with the proxy function.\nExtensive experiment results demonstrate that our method outperforms\ncompetitive baselines on Design-Bench and its practical variants. The code is\npublicly available in \\texttt{https://github.com/dbsxodud-11/GTG}.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4dcW1--yuM9TnYbTHv_u6hvT7ae08fkGNgt3k18biiQ","pdfSize":"7284107","objectId":"0xa309f29ddd5d9319295278ee6dc12aa465292ab6b79a9ac0f0cfe57edd4cbd6b","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
