{"id":"2407.09627","title":"A JWST/MIRI analysis of the ice distribution and PAH emission in the\n  protoplanetary disk HH 48 NE","authors":"J. A. Sturm, M. K. McClure, D. Harsono, J. B. Bergner, E. Dartois, A.\n  C. A. Boogert, M. A. Cordiner, M. N. Drozdovskaya, S. Ioppolo, C. J. Law, D.\n  C. Lis, B. A. McGuire, G. J. Melnick, J. A. Noble, K. I. \\\"Oberg, M. E.\n  Palumbo, Y. J. Pendleton, G. Perotti, W. R. M. Rocha, R. G. Urso, E. F. van\n  Dishoeck","authorsParsed":[["Sturm","J. A.",""],["McClure","M. K.",""],["Harsono","D.",""],["Bergner","J. B.",""],["Dartois","E.",""],["Boogert","A. C. A.",""],["Cordiner","M. A.",""],["Drozdovskaya","M. N.",""],["Ioppolo","S.",""],["Law","C. J.",""],["Lis","D. C.",""],["McGuire","B. A.",""],["Melnick","G. J.",""],["Noble","J. A.",""],["Öberg","K. I.",""],["Palumbo","M. E.",""],["Pendleton","Y. J.",""],["Perotti","G.",""],["Rocha","W. R. M.",""],["Urso","R. G.",""],["van Dishoeck","E. F.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 18:29:38 GMT"}],"updateDate":"2024-09-04","timestamp":1720808978000,"abstract":"  Ice-coated dust grains provide the main reservoir of volatiles that play an\nimportant role in planet formation processes and may become incorporated into\nplanetary atmospheres. However, due to observational challenges, the ice\nabundance distribution in protoplanetary disks is not well constrained. We\npresent JWST/MIRI observations of the edge-on disk HH 48 NE carried out as part\nof the IRS program Ice Age. We detect CO$_2$, NH$_3$, H$_2$O and tentatively\nCH$_4$ and NH$_4^+$. Radiative transfer models suggest that ice absorption\nfeatures are produced predominantly in the 50-100 au region of the disk. The\nCO$_2$ feature at 15 micron probes a region closer to the midplane (z/r =\n0.1-0.15) than the corresponding feature at 4.3 micron (z/r = 0.2-0.6), but all\nobservations trace regions significantly above the midplane reservoirs where we\nexpect the bulk of the ice mass to be located. Ices must reach a high scale\nheight (z/r ~ 0.6; corresponding to modeled dust extinction Av ~ 0.1), in order\nto be consistent with the observed vertical distribution of the peak ice\noptical depths. The weakness of the CO$_2$ feature at 15 micron relative to the\n4.3 micron feature and the red emission wing of the 4.3 micron CO$_2$ feature\nare both consistent with ices being located at high elevation in the disk. The\nretrieved NH$_3$ abundance and the upper limit on the CH$_3$OH abundance\nrelative to H$_2$O are significantly lower than those in the interstellar\nmedium (ISM), but consistent with cometary observations. Full wavelength\ncoverage is required to properly study the abundance distribution of ices in\ndisks. To explain the presence of ices at high disk altitudes, we propose two\npossible scenarios: a disk wind that entrains sufficient amounts of dust, thus\nblocking part of the stellar UV radiation, or vertical mixing that cycles\nenough ices into the upper disk layers to balance ice photodesorption.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}