{"id":"2407.08838","title":"Deep Learning for Network Anomaly Detection under Data Contamination:\n  Evaluating Robustness and Mitigating Performance Degradation","authors":"D'Jeff K. Nkashama, Jordan Masakuna F\\'elicien, Arian Soltani,\n  Jean-Charles Verdier, Pierre-Martin Tardif, Marc Frappier, Froduald Kabanza","authorsParsed":[["Nkashama","D'Jeff K.",""],["Félicien","Jordan Masakuna",""],["Soltani","Arian",""],["Verdier","Jean-Charles",""],["Tardif","Pierre-Martin",""],["Frappier","Marc",""],["Kabanza","Froduald",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 19:47:37 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 23:09:04 GMT"}],"updateDate":"2024-09-16","timestamp":1720727257000,"abstract":"  Deep learning (DL) has emerged as a crucial tool in network anomaly detection\n(NAD) for cybersecurity. While DL models for anomaly detection excel at\nextracting features and learning patterns from data, they are vulnerable to\ndata contamination -- the inadvertent inclusion of attack-related data in\ntraining sets presumed benign. This study evaluates the robustness of six\nunsupervised DL algorithms against data contamination using our proposed\nevaluation protocol. Results demonstrate significant performance degradation in\nstate-of-the-art anomaly detection algorithms when exposed to contaminated\ndata, highlighting the critical need for self-protection mechanisms in DL-based\nNAD models. To mitigate this vulnerability, we propose an enhanced auto-encoder\nwith a constrained latent representation, allowing normal data to cluster more\ndensely around a learnable center in the latent space. Our evaluation reveals\nthat this approach exhibits improved resistance to data contamination compared\nto existing methods, offering a promising direction for more robust NAD\nsystems.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Cryptography and Security","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/"}