{"id":"2407.15402","title":"Tackling Selfish Clients in Federated Learning","authors":"Andrea Augello, Ashish Gupta, Giuseppe Lo Re and Sajal K. Das","authorsParsed":[["Augello","Andrea",""],["Gupta","Ashish",""],["Re","Giuseppe Lo",""],["Das","Sajal K.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 06:08:13 GMT"}],"updateDate":"2024-07-23","timestamp":1721628493000,"abstract":"  Federated Learning (FL) is a distributed machine learning paradigm\nfacilitating participants to collaboratively train a model without revealing\ntheir local data. However, when FL is deployed into the wild, some intelligent\nclients can deliberately deviate from the standard training process to make the\nglobal model inclined toward their local model, thereby prioritizing their\nlocal data distribution. We refer to this novel category of misbehaving clients\nas selfish. In this paper, we propose a Robust aggregation strategy for FL\nserver to mitigate the effect of Selfishness (in short RFL-Self). RFL-Self\nincorporates an innovative method to recover (or estimate) the true updates of\nselfish clients from the received ones, leveraging robust statistics (median of\nnorms) of the updates at every round. By including the recovered updates in\naggregation, our strategy offers strong robustness against selfishness. Our\nexperimental results, obtained on MNIST and CIFAR-10 datasets, demonstrate that\njust 2% of clients behaving selfishly can decrease the accuracy by up to 36%,\nand RFL-Self can mitigate that effect without degrading the global model\nperformance.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"XWYx4FDaA20jKKKT3kGQF-tWnXyOqoiCXdUqBbLVPfM","pdfSize":"709569","objectId":"0xd1dda44aea1d305304a5649948d031ca08f9968bf96a63cf7becab6aa4a2149b","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
