{"id":"2407.01533","title":"Organizational transformation: The impact of servant leadership on work\n  ethic culture with burnout as a mediating factor in the hospitality industry","authors":"Darul Wiyono, Rinaldi Tanjung, Hedi Setiadi, Sri Marini, Yayan\n  Sugiarto","authorsParsed":[["Wiyono","Darul",""],["Tanjung","Rinaldi",""],["Setiadi","Hedi",""],["Marini","Sri",""],["Sugiarto","Yayan",""]],"versions":[{"version":"v1","created":"Tue, 27 Feb 2024 00:51:07 GMT"}],"updateDate":"2024-07-03","timestamp":1708995067000,"abstract":"  Orientation: The study explores the connections among servant leadership,\nburnout, and work ethic culture in organizations. It aims to provide a detailed\nunderstanding of how servant leadership influences work ethic culture,\nespecially by considering the role of burnout. Research Purpose: This study\naims to understand how servant leadership influences work ethic culture and\nexplore the mediating role of burnout in this relationship. Motivation for the\nStudy: This study wants to fill gaps in our understanding of how servant\nleadership, burnout, and work ethic culture are connected. It seeks to add\nuseful insights to what we already know from previous research. Research\nApproach/Design and Method: The study, using surveys and statistics, examines\nthe links between servant leadership, burnout, and work ethic culture in 113\nhotels in Bandung, Indonesia, with 339 participants. A 183-sample, chosen with\na 0.05 margin of error, underwent SEM-PLS analysis using SmartPLS 3.0. Main\nFindings: The key findings underscore that servant leadership exerts a positive\ninfluence on work ethic culture, and burnout plays a pivotal mediating role in\nthis dynamic. The results shed light on the intricate dynamics shaping\norganizational cultures. Practical/Managerial Implications: The findings aid\norganizations in forming supportive leadership policies, promoting employee\nwell-being, and fostering ethical work culture. Managers can apply these\ninsights to enhance leadership practices and reduce burnout impact.\nContribution/Value-Add: This study clarifies the connection between servant\nleadership, burnout, and work ethic culture. The findings offer insights for\nfuture research and practical actions in organizational leadership.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}