{"id":"2407.06590","title":"Revolutionizing Battery Disassembly: The Design and Implementation of a\n  Battery Disassembly Autonomous Mobile Manipulator Robot(BEAM-1)","authors":"Yanlong Peng, Zhigang Wang, Yisheng Zhang, Shengmin Zhang, Nan Cai,\n  Fan Wu, Ming Chen","authorsParsed":[["Peng","Yanlong",""],["Wang","Zhigang",""],["Zhang","Yisheng",""],["Zhang","Shengmin",""],["Cai","Nan",""],["Wu","Fan",""],["Chen","Ming",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 06:44:20 GMT"}],"updateDate":"2024-07-10","timestamp":1720507460000,"abstract":"  The efficient disassembly of end-of-life electric vehicle batteries(EOL-EVBs)\nis crucial for green manufacturing and sustainable development. The current\npre-programmed disassembly conducted by the Autonomous Mobile Manipulator\nRobot(AMMR) struggles to meet the disassembly requirements in dynamic\nenvironments, complex scenarios, and unstructured processes. In this paper, we\npropose a Battery Disassembly AMMR(BEAM-1) system based on NeuralSymbolic AI.\nIt detects the environmental state by leveraging a combination of multi-sensors\nand neural predicates and then translates this information into a\nquasi-symbolic space. In real-time, it identifies the optimal sequence of\naction primitives through LLM-heuristic tree search, ensuring high-precision\nexecution of these primitives. Additionally, it employs positional speculative\nsampling using intuitive networks and achieves the disassembly of various bolt\ntypes with a meticulously designed end-effector. Importantly, BEAM-1 is a\ncontinuously learning embodied intelligence system capable of subjective\nreasoning like a human, and possessing intuition. A large number of real scene\nexperiments have proved that it can autonomously perceive, decide, and execute\nto complete the continuous disassembly of bolts in multiple, multi-category,\nand complex situations, with a success rate of 98.78%. This research attempts\nto use NeuroSymbolic AI to give robots real autonomous reasoning, planning, and\nlearning capabilities. BEAM-1 realizes the revolution of battery disassembly.\nIts framework can be easily ported to any robotic system to realize different\napplication scenarios, which provides a ground-breaking idea for the design and\nimplementation of future embodied intelligent robotic systems.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}