{"id":"2407.12215","title":"Generalization of the Fano and Non-Fano Index Coding Instances","authors":"Arman Sharififar, Parastoo Sadeghi, Neda Aboutorab","authorsParsed":[["Sharififar","Arman",""],["Sadeghi","Parastoo",""],["Aboutorab","Neda",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 23:39:04 GMT"}],"updateDate":"2024-07-18","timestamp":1721173144000,"abstract":"  Matroid theory is fundamentally connected with index coding and network\ncoding problems. In fact, the reliance of linear index coding and network\ncoding rates on the characteristic of a field has been demonstrated by using\nthe two well-known matroid instances, namely the Fano and non-Fano matroids.\nThis established the insufficiency of linear coding, one of the fundamental\ntheorems in both index coding and network coding. While the Fano matroid is\nlinearly representable only over fields with characteristic two, the non-Fano\ninstance is linearly representable only over fields with odd characteristic.\nFor fields with arbitrary characteristic $p$, the Fano and non-Fano matroids\nwere extended to new classes of matroid instances whose linear representations\nare dependent on fields with characteristic $p$. However, these matroids have\nnot been well appreciated nor cited in the fields of network coding and index\ncoding. In this paper, we first reintroduce these matroids in a more structured\nway. Then, we provide a completely independent alternative proof with the main\nadvantage of using only matrix manipulation rather than complex concepts in\nnumber theory and matroid theory. In this new proof, it is shown that while the\nclass $p$-Fano matroid instances are linearly representable only over fields\nwith characteristic $p$, the class $p$-non-Fano instances are representable\nover fields with any characteristic other than characteristic $p$. Finally,\nfollowing the properties of the class $p$-Fano and $p$-non-Fano matroid\ninstances, we characterize two new classes of index coding instances,\nrespectively, referred to as the class $p$-Fano and $p$-non-Fano index coding,\neach with a size of $p^2 + 4p + 3$.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}