{"id":"2407.00684","title":"The Nash-MTL-STCN for Prestack Three-Parameter Inversion","authors":"Yingtian Liu, Yong Li, Huating Li, Junheng Peng, Zhangquan Liao, Wen\n  Feng","authorsParsed":[["Liu","Yingtian",""],["Li","Yong",""],["Li","Huating",""],["Peng","Junheng",""],["Liao","Zhangquan",""],["Feng","Wen",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 12:46:03 GMT"}],"updateDate":"2024-07-02","timestamp":1719751563000,"abstract":"  Deep learning (DL) techniques have been widely used in prestack\nthree-parameter inversion to address its ill-posed problems. Among these DL\ntechniques, Multi-task learning (MTL) methods can simultaneously train multiple\ntasks, thereby enhancing model generalization and predictive performance.\nHowever, existing MTL methods typically adopt heuristic or non-heuristic\napproaches to jointly update the gradient of each task, leading to gradient\nconflicts between different tasks and reducing inversion accuracy. To address\nthis issue, we propose a semi-supervised temporal convolutional network (STCN)\nbased on Nash equilibrium (Nash-MTL-STCN). Firstly, temporal convolutional\nnetworks (TCN) with non-causal convolution and convolutional neural networks\n(CNNs) are used as multi-task layers to extract the shared features from\npartial angle stack seismic data, with CNNs serving as the single-task layer.\nSubsequently, the feature mechanism is utilized to extract shared features in\nthe multi-task layer through hierarchical processing, and the gradient\ncombination of these shared features is treated as a Nash game for strategy\noptimization and joint updates. Ultimately, the overall utility of the\nthree-parameter is maximized, and gradient conflicts are alleviated. In\naddition, to enhance the network's generalization and stability, we have\nincorporated geophysical forward modeling and low-frequency models into the\nnetwork. Experimental results demonstrate that the proposed method overcomes\nthe gradient conflict issue of the conventional MTL methods with constant\nweights (CW) and achieves higher precision than four widely used non-heuristic\nMTL methods. Further field data experiments also validate the method's\neffectiveness.\n","subjects":["Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}