{"id":"2407.20075","title":"Haldane model on the Sierpi\\'nski gasket","authors":"Zebedeus Osseweijer, Lumen Eek, Anouar Moustaj, Mikael Fremling and\n  Cristiane Morais Smith","authorsParsed":[["Osseweijer","Zebedeus",""],["Eek","Lumen",""],["Moustaj","Anouar",""],["Fremling","Mikael",""],["Smith","Cristiane Morais",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:02:22 GMT"}],"updateDate":"2024-07-30","timestamp":1722265342000,"abstract":"  We investigate the topological phases of the Haldane model on the\nSierpi\\'nski gasket. As a consequence of the fractal geometry, multiple fractal\ngaps arise. Additionally, a flat band appears, and due to a complex\nnext-nearest neighbour hopping, this band splits and multiple topological\nflux-induced gaps emerge. Owing to the fractal nature of the model,\nconventional momentum-space topological invariants cannot be used. Therefore,\nwe characterise the system's topology in terms of a real-space Chern number. In\naddition, we verify the robustness of the topological states to disorder.\nFinally, we present phase diagrams for both a fractal gap and a flux-induced\ngap. Previous work on a similar system claims that fractality \"squeezes\" the\nwell-known Haldane phase diagram. However, this result arises because a doubled\nsystem was considered with two Sierpi\\'nski gaskets glued together. We consider\nonly a single copy of the Sierpi\\'nski gasket, keeping global self-similarity.\nIn contrast with these previous results, we find intricate and complex patterns\nin the phase diagram of this single fractal. Our work shows that the fractality\nof the model greatly influences the phase space of these structures, and can\ndrive topological phases in the multitude of fractal and flux-induced gaps,\nproviding a richer platform than a conventional integer dimensional geometry.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}