{"id":"2407.20259","title":"A length-scale insensitive cohesive phase-field interface model:\n  application to concurrent bulk and interface fracture simulation in\n  Lithium-ion battery materials","authors":"Wan-Xin Chen, Xiang-Long Peng, Jian-Ying Wu, Orkun Furat, Volker\n  Schmidt, Bai-Xiang Xu","authorsParsed":[["Chen","Wan-Xin",""],["Peng","Xiang-Long",""],["Wu","Jian-Ying",""],["Furat","Orkun",""],["Schmidt","Volker",""],["Xu","Bai-Xiang",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 08:45:58 GMT"}],"updateDate":"2024-07-31","timestamp":1721810758000,"abstract":"  A new cohesive phase-field (CPF) interface fracture model is proposed on the\nbasis of the Euler-Lagrange equation of the phase-field theory and the\ninterface fracture energy check w.r.t. that of the cohesive zone model. It\nemploys an exponential function for the interpolation of fracture energy\nbetween the bulk phase and the interface, while the effective interface\nfracture energy $\\tilde{G}_i$ is derived in such a way that the integrated\nphase-field fracture energy across the diffusive interface region remains\nconsistent with the sharp interface fracture energy $G_i$ defined in the\nclassical cohesive zone model. This consistency is the key to ensure that the\nnumerical results remain insensitive to the choice of length-scale parameters,\nparticularly the regularized interface thickness $L$ and the regularized\nfracture surface thickness $b$. By employing this energy consistency check,\nvarious CPF interface models in the literature are reviewed. Besides the\nlength-scale insensitivity, the proposed CPF interface model offers further\nadvantages. Thanks to the fact that the exponential interpolation function can\nbe obtained conveniently from the relaxation solution of an Allen-Cahn\nequation, the proposed CPF model is advantageous over other models with high\nflexibility in handling structures containing complicated interface topology.\nIn order to demonstrate this merit and to check the length-scale insensitivity\nin multiphysics context, the proposed CPF interface model is employed further\nto derive a thermodynamically consistent chemo-mechanical model relevant to\nLithium-ion battery materials. Finite element simulation results of the\nconcurrent bulk and interface fracture in polycrystalline electrode particles,\nreconstructed from images with segmented interfaces, confirm the expected\ncomputational advantages and the length-scale insensitivity in chemo-mechanical\ncontext.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}