{"id":"2407.21517","title":"A Simple Low-bit Quantization Framework for Video Snapshot Compressive\n  Imaging","authors":"Miao Cao, Lishun Wang, Huan Wang, Xin Yuan","authorsParsed":[["Cao","Miao",""],["Wang","Lishun",""],["Wang","Huan",""],["Yuan","Xin",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 10:38:11 GMT"}],"updateDate":"2024-08-01","timestamp":1722422291000,"abstract":"  Video Snapshot Compressive Imaging (SCI) aims to use a low-speed 2D camera to\ncapture high-speed scene as snapshot compressed measurements, followed by a\nreconstruction algorithm to reconstruct the high-speed video frames.\nState-of-the-art (SOTA) deep learning-based algorithms have achieved impressive\nperformance, yet with heavy computational workload. Network quantization is a\npromising way to reduce computational cost. However, a direct low-bit\nquantization will bring large performance drop. To address this challenge, in\nthis paper, we propose a simple low-bit quantization framework (dubbed Q-SCI)\nfor the end-to-end deep learning-based video SCI reconstruction methods which\nusually consist of a feature extraction, feature enhancement, and video\nreconstruction module. Specifically, we first design a high-quality feature\nextraction module and a precise video reconstruction module to extract and\npropagate high-quality features in the low-bit quantized model. In addition, to\nalleviate the information distortion of the Transformer branch in the quantized\nfeature enhancement module, we introduce a shift operation on the query and key\ndistributions to further bridge the performance gap. Comprehensive experimental\nresults manifest that our Q-SCI framework can achieve superior performance,\ne.g., 4-bit quantized EfficientSCI-S derived by our Q-SCI framework can\ntheoretically accelerate the real-valued EfficientSCI-S by 7.8X with only 2.3%\nperformance gap on the simulation testing datasets. Code is available at\nhttps://github.com/mcao92/QuantizedSCI.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}