{"id":"2407.11737","title":"A $\\sim 43$ GeV $\\gamma$-ray line signature in the directions of a group\n  of nearby massive galaxy clusters","authors":"Yi-Zhong Fan, Zhao-Qiang Shen, Yun-Feng Liang, Xiang Li, Kai-Kai Duan,\n  Zi-Qing Xia, Xiao-Yuan Huang, Lei Feng, Qiang Yuan","authorsParsed":[["Fan","Yi-Zhong",""],["Shen","Zhao-Qiang",""],["Liang","Yun-Feng",""],["Li","Xiang",""],["Duan","Kai-Kai",""],["Xia","Zi-Qing",""],["Huang","Xiao-Yuan",""],["Feng","Lei",""],["Yuan","Qiang",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:05:33 GMT"}],"updateDate":"2024-07-17","timestamp":1721138733000,"abstract":"  As the largest gravitationally bound objects in the Universe, galaxy clusters\nhave provided the first piece of evidence for the presence of dark matter and\nmay be suitable targets for indirect dark matter searches. Among various\nsignals, the GeV-TeV $\\gamma$-ray line has been taken as the smoking-gun signal\nof the dark matter annihilation/decay since no known astrophysical/physical\nprocess(es) could generate such a peculiar spectrum. With 15.5 years of\nFermi-LAT P8R3 publicly available data, we search for the $\\gamma$-ray line\nemission in the directions of a group of 13 nearby massive galaxy clusters with\nan unbinned likelihood analysis. A $\\gamma$-ray line signal at $\\sim 43.2$ GeV\nhas a net TS value of $\\approx 30$ if we only take into account the data in the\ndirections of Virgo, Fornax and Ophiuchus clusters, three massive clusters with\nthe highest J-factors expected to generate the dark matter annihilation signal.\nThe signal still presents when the data of other 10 nearby massive clusters\nhave also been included, though the TS value decreases to $\\approx 21$ likely\nbecause of their lower signal-to-noise ratios. The absence of this signal in\nthe inner Galaxy disfavors both the instrumental effect and the canonical dark\nmatter annihilation interpretation, and a more sophisticated dark matter model\nor very peculiar astrophysical scenario might be needed. This $\\gamma$-ray line\nsignal, if intrinsic, could be unambiguously verified by the Very Large Area\n$\\gamma$-ray Space Telescope in its first two years of performance.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}