{"id":"2407.13112","title":"Improvement of Applicability in Student Performance Prediction Based on\n  Transfer Learning","authors":"Yan Zhao","authorsParsed":[["Zhao","Yan",""]],"versions":[{"version":"v1","created":"Sat, 1 Jun 2024 13:09:05 GMT"}],"updateDate":"2024-07-19","timestamp":1717247345000,"abstract":"  Predicting student performance under varying data distributions is a\nchallenging task. This study proposes a method to improve prediction accuracy\nby employing transfer learning techniques on the dataset with varying\ndistributions. Using datasets from mathematics and Portuguese language courses,\nthe model was trained and evaluated to enhance its generalization ability and\nprediction accuracy. The datasets used in this study were sourced from Kaggle,\ncomprising a variety of attributes such as demographic details, social factors,\nand academic performance. The methodology involves using an Artificial Neural\nNetwork (ANN) combined with transfer learning, where some layer weights were\nprogressively frozen, and the remaining layers were fine-tuned. Experimental\nresults demonstrated that this approach excels in reducing Root Mean Square\nError (RMSE) and Mean Absolute Error (MAE), while improving the coefficient of\ndetermination (R2). The model was initially trained on a subset with a larger\nsample size and subsequently fine-tuned on another subset. This method\neffectively facilitated knowledge transfer, enhancing model performance on\ntasks with limited data. The results demonstrate that freezing more layers\nimproves performance for complex and noisy data, whereas freezing fewer layers\nis more effective for simpler and larger datasets. This study highlights the\npotential of transfer learning in predicting student performance and suggests\nfuture research to explore domain adaptation techniques for unlabeled datasets.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}