{"id":"2407.00878","title":"A Robust Power Model Training Framework for Cloud Native Runtime Energy\n  Metric Exporter","authors":"Sunyanan Choochotkaew, Chen Wang, Huamin Chen, Tatsuhiro Chiba,\n  Marcelo Amaral, Eun Kyung Lee, Tamar Eilam","authorsParsed":[["Choochotkaew","Sunyanan",""],["Wang","Chen",""],["Chen","Huamin",""],["Chiba","Tatsuhiro",""],["Amaral","Marcelo",""],["Lee","Eun Kyung",""],["Eilam","Tamar",""]],"versions":[{"version":"v1","created":"Wed, 10 Apr 2024 02:20:29 GMT"}],"updateDate":"2024-07-02","timestamp":1712715629000,"abstract":"  Estimating power consumption in modern Cloud environments is essential for\ncarbon quantification toward green computing. Specifically, it is important to\nproperly account for the power consumed by each of the running applications,\nwhich are packaged as containers. This paper examines multiple challenges\nassociated with this goal. The first challenge is that multiple customers are\nsharing the same hardware platform (multi-tenancy), where information on the\nphysical servers is mostly obscured. The second challenge is the overhead in\npower consumption that the Cloud platform control plane induces. This paper\naddresses these challenges and introduces a novel pipeline framework for power\nmodel training. This allows versatile power consumption approximation of\nindividual containers on the basis of available performance counters and other\nmetrics. The proposed model utilizes machine learning techniques to predict the\npower consumed by the control plane and associated processes, and uses it for\nisolating the power consumed by the user containers, from the server power\nconsumption. To determine how well the prediction results in an isolation, we\nintroduce a metric termed isolation goodness. Applying the proposed power model\ndoes not require online power measurements, nor does it need information on the\nphysical servers, configuration, or information on other tenants sharing the\nsame machine. The results of cross-workload, cross-platform experiments\ndemonstrated the higher accuracy of the proposed model when predicting power\nconsumption of unseen containers on unknown platforms, including on virtual\nmachines.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"pejyrmeezTmoI4uZK7LCkBYSYuiuo3E3rK3hyERrUDE","pdfSize":"2623453"}
