{"id":"2407.13156","title":"Quantum Key Distribution Routing Protocol in Quantum Networks: Overview\n  and Challenges","authors":"Pankaj Kumar, Neel Kanth Kundu, and Binayak Kar","authorsParsed":[["Kumar","Pankaj",""],["Kundu","Neel Kanth",""],["Kar","Binayak",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 04:46:32 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 02:18:08 GMT"}],"updateDate":"2024-07-29","timestamp":1721277992000,"abstract":"  The use of quantum cryptography in everyday applications has gained attention\nin both industrial and academic fields. Due to advancements in quantum\nelectronics, practical quantum devices are already available in the market, and\nready for wider use. Quantum Key Distribution (QKD) is a crucial aspect of\nquantum cryptography, which involves generating and distributing symmetric\ncryptographic keys between geographically separated users using principles of\nquantum physics. Many successful QKD networks have been established to test\ndifferent solutions. The objective of this paper is to delve into the potential\nof utilizing established routing design techniques in the context of quantum\nkey distribution, a field distinguished by its unique properties rooted in the\nprinciples of quantum mechanics. However, the implementation of these\ntechniques poses substantial challenges, including quantum memory decoherence,\nkey rate generation, latency delays, inherent noise in quantum systems, limited\ncommunication ranges, and the necessity for highly specialized hardware. This\npaper conducts an in-depth examination of essential research pertaining to the\ndesign methodologies for quantum key distribution. It also explores the\nfundamental aspects of quantum routing and the associated properties inherent\nto quantum QKD. This paper elucidates the necessary steps for constructing\nefficient and resilient QKD networks. In summarizing the techniques relevant to\nQKD networking and routing, including their underlying principles, protocols,\nand challenges, this paper sheds light on potential applications and delineates\nfuture research directions in this burgeoning field.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}