{"id":"2407.17937","title":"Resonant excitation of Kelvin waves by interactions of subtropical\n  Rossby waves and the zonal mean flow","authors":"Katharina M. Holube, Frank Lunkeit, Sergiy Vasylkevych, Nedjeljka\n  \\v{Z}agar","authorsParsed":[["Holube","Katharina M.",""],["Lunkeit","Frank",""],["Vasylkevych","Sergiy",""],["Žagar","Nedjeljka",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 10:54:33 GMT"},{"version":"v2","created":"Sat, 24 Aug 2024 15:20:59 GMT"}],"updateDate":"2024-08-27","timestamp":1721904873000,"abstract":"  Equatorial Kelvin waves can be affected by subtropical Rossby wave dynamics.\nPrevious research has demonstrated the Kelvin wave growth in response to\nsubtropical forcing and the resonant growth due to eddy momentum flux\nconvergence. However, the relative importance of the wave-mean flow and\nwave-wave interactions for the Kelvin wave growth compared to the direct wave\nexcitation by the external forcing has not been made clear. This study\ndemonstrates the resonant Kelvin wave excitation by interactions of subtropical\nRossby waves and the mean flow using a spherical shallow-water model. The use\nof Hough harmonics as basis functions makes Rossby and Kelvin waves prognostic\nvariables of the model and allows the quantification of terms contributing to\ntheir tendencies in physical and wave space. The simulations show that Kelvin\nwaves are resonantly excited by interactions of Rossby waves and the balanced\nzonal mean flow in the subtropics, provided the Rossby and Kelvin wave\nfrequencies, which are modified by the mean flow, match. The resonance\nmechanism is substantiated by analytical expressions. The Kelvin wave\ntendencies are caused by velocity and depth tendencies: The velocity tendencies\ndue to the meridional advection of zonal mean velocity can be outweighed by the\nzonal advection of Rossby wave velocity or by the depth tendencies due to\nRossby wave divergence. Identifying the resonant excitation mechanism in data\nshould contribute to the quantification of Kelvin wave variability originating\nin the subtropics.\n","subjects":["Physics/Fluid Dynamics","Physics/Atmospheric and Oceanic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}