{"id":"2407.00476","title":"Large Language Models for Power Scheduling: A User-Centric Approach","authors":"Thomas Mongaillard, Samson Lasaulce, Othman Hicheur, Chao Zhang, Lina\n  Bariah, Vineeth S. Varma, Hang Zou, Qiyang Zhao, Merouane Debbah","authorsParsed":[["Mongaillard","Thomas",""],["Lasaulce","Samson",""],["Hicheur","Othman",""],["Zhang","Chao",""],["Bariah","Lina",""],["Varma","Vineeth S.",""],["Zou","Hang",""],["Zhao","Qiyang",""],["Debbah","Merouane",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 15:47:28 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 10:26:02 GMT"}],"updateDate":"2024-07-22","timestamp":1719676048000,"abstract":"  While traditional optimization and scheduling schemes are designed to meet\nfixed, predefined system requirements, future systems are moving toward\nuser-driven approaches and personalized services, aiming to achieve high\nquality-of-experience (QoE) and flexibility. This challenge is particularly\npronounced in wireless and digitalized energy networks, where users'\nrequirements have largely not been taken into consideration due to the lack of\na common language between users and machines. The emergence of powerful large\nlanguage models (LLMs) marks a radical departure from traditional\nsystem-centric methods into more advanced user-centric approaches by providing\na natural communication interface between users and devices. In this paper, for\nthe first time, we introduce a novel architecture for resource scheduling\nproblems by constructing three LLM agents to convert an arbitrary user's voice\nrequest (VRQ) into a resource allocation vector. Specifically, we design an LLM\nintent recognition agent to translate the request into an optimization problem\n(OP), an LLM OP parameter identification agent, and an LLM OP solving agent. To\nevaluate system performance, we construct a database of typical VRQs in the\ncontext of electric vehicle (EV) charging. As a proof of concept, we primarily\nuse Llama 3 8B. Through testing with different prompt engineering scenarios,\nthe obtained results demonstrate the efficiency of the proposed architecture.\nThe conducted performance analysis allows key insights to be extracted. For\ninstance, having a larger set of candidate OPs to model the real-world problem\nmight degrade the final performance because of a higher recognition/OP\nclassification noise level. All results and codes are open source.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}