{"id":"2407.13420","title":"Exploring End-to-end Differentiable Neural Charged Particle Tracking --\n  A Loss Landscape Perspective","authors":"Tobias Kortus, Ralf Keidel, Nicolas R. Gauger (for the Bergen pCT\n  Collaboration)","authorsParsed":[["Kortus","Tobias","","for the Bergen pCT\n  Collaboration"],["Keidel","Ralf","","for the Bergen pCT\n  Collaboration"],["Gauger","Nicolas R.","","for the Bergen pCT\n  Collaboration"]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 11:42:58 GMT"}],"updateDate":"2024-07-19","timestamp":1721302978000,"abstract":"  Measurement and analysis of high energetic particles for scientific, medical\nor industrial applications is a complex procedure, requiring the design of\nsophisticated detector and data processing systems. The development of adaptive\nand differentiable software pipelines using a combination of conventional and\nmachine learning algorithms is therefore getting ever more important to\noptimize and operate the system efficiently while maintaining end-to-end (E2E)\ndifferentiability. We propose for the application of charged particle tracking\nan E2E differentiable decision-focused learning scheme using graph neural\nnetworks with combinatorial components solving a linear assignment problem for\neach detector layer. We demonstrate empirically that including differentiable\nvariations of discrete assignment operations allows for efficient network\noptimization, working better or on par with approaches that lack E2E\ndifferentiability. In additional studies, we dive deeper into the optimization\nprocess and provide further insights from a loss landscape perspective. We\ndemonstrate that while both methods converge into similar performing, globally\nwell-connected regions, they suffer under substantial predictive instability\nacross initialization and optimization methods, which can have unpredictable\nconsequences on the performance of downstream tasks such as image\nreconstruction. We also point out a dependency between the interpolation factor\nof the gradient estimator and the prediction stability of the model, suggesting\nthe choice of sufficiently small values. Given the strong global connectivity\nof learned solutions and the excellent training performance, we argue that E2E\ndifferentiability provides, besides the general availability of gradient\ninformation, an important tool for robust particle tracking to mitigate\nprediction instabilities by favoring solutions that perform well on downstream\ntasks.\n","subjects":["Physics/Computational Physics","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}