{"id":"2407.06056","title":"Stranger Danger! Identifying and Avoiding Unpredictable Pedestrians in\n  RL-based Social Robot Navigation","authors":"Sara Pohland, Alvin Tan, Prabal Dutta, and Claire Tomlin","authorsParsed":[["Pohland","Sara",""],["Tan","Alvin",""],["Dutta","Prabal",""],["Tomlin","Claire",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 15:58:33 GMT"}],"updateDate":"2024-08-14","timestamp":1720454313000,"abstract":"  Reinforcement learning (RL) methods for social robot navigation show great\nsuccess navigating robots through large crowds of people, but the performance\nof these learning-based methods tends to degrade in particularly challenging or\nunfamiliar situations due to the models' dependency on representative training\ndata. To ensure human safety and comfort, it is critical that these algorithms\nhandle uncommon cases appropriately, but the low frequency and wide diversity\nof such situations present a significant challenge for these data-driven\nmethods. To overcome this challenge, we propose modifications to the learning\nprocess that encourage these RL policies to maintain additional caution in\nunfamiliar situations. Specifically, we improve the Socially Attentive\nReinforcement Learning (SARL) policy by (1) modifying the training process to\nsystematically introduce deviations into a pedestrian model, (2) updating the\nvalue network to estimate and utilize pedestrian-unpredictability features, and\n(3) implementing a reward function to learn an effective response to pedestrian\nunpredictability. Compared to the original SARL policy, our modified policy\nmaintains similar navigation times and path lengths, while reducing the number\nof collisions by 82% and reducing the proportion of time spent in the\npedestrians' personal space by up to 19 percentage points for the most\ndifficult cases. We also describe how to apply these modifications to other RL\npolicies and demonstrate that some key high-level behaviors of our approach\ntransfer to a physical robot.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}