{"id":"2407.05908","title":"Realization of Z$_2$ topological photonic insulators made from\n  multilayer transition metal dichalcogenides","authors":"Tommi Isoniemi, Paul Bouteyre, Xuerong Hu, Fedor Benimetskiy, Yue\n  Wang, Maurice S. Skolnick, Dmitry N. Krizhanovskii, Alexander I. Tartakovskii","authorsParsed":[["Isoniemi","Tommi",""],["Bouteyre","Paul",""],["Hu","Xuerong",""],["Benimetskiy","Fedor",""],["Wang","Yue",""],["Skolnick","Maurice S.",""],["Krizhanovskii","Dmitry N.",""],["Tartakovskii","Alexander I.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 13:13:10 GMT"}],"updateDate":"2024-07-09","timestamp":1720444390000,"abstract":"  Monolayers of semiconducting transition metal dichalcogenides (TMDs) have\nlong attracted interest for their intriguing optical and electronic properties.\nRecently TMDs in their quasi-bulk form have started to show considerable\npromise for nanophotonics thanks to their high refractive indices, large\noptical anisotropy, wide transparency windows reaching to the visible, and\nrobust room temperature excitons promising for nonlinear optics. Adherence of\nTMD layers to any substrate via van der Waals forces is a further key enabler\nfor nanofabrication of sophisticated photonic structures requiring\nheterointegration. Here, we capitalize on these attractive properties and\nrealize topological spin-Hall photonic lattices made of arrays of triangular\nnanoholes in 50 to 100 nm thick WS$_2$ flakes exfoliated on SiO$_2$/Si\nsubstrates. High quality structures are achieved taking advantage of\nanisotropic dry etching dictated by the crystal axes of WS$_2$. Reflectance\nmeasurements at room temperature show a photonic gap opening in the\nnear-infrared in trivial and topological phases. Unidirectional propagation\nalong the domain interface is demonstrated in real space via circularly\npolarized laser excitation in samples with both zigzag and armchair domain\nboundaries. Finite-difference time-domain simulations are used to interpret\noptical spectroscopy results. Our work opens the way for future sophisticated\nnanophotonic devices based on the layered (van der Waals) materials platform.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}