{"id":"2407.01563","title":"NaviSlim: Adaptive Context-Aware Navigation and Sensing via Dynamic\n  Slimmable Networks","authors":"Tim Johnsen, Marco Levorato","authorsParsed":[["Johnsen","Tim",""],["Levorato","Marco",""]],"versions":[{"version":"v1","created":"Thu, 16 May 2024 01:18:52 GMT"}],"updateDate":"2024-07-03","timestamp":1715822332000,"abstract":"  Small-scale autonomous airborne vehicles, such as micro-drones, are expected\nto be a central component of a broad spectrum of applications ranging from\nexploration to surveillance and delivery. This class of vehicles is\ncharacterized by severe constraints in computing power and energy reservoir,\nwhich impairs their ability to support the complex state-of-the-art neural\nmodels needed for autonomous operations. The main contribution of this paper is\na new class of neural navigation models -- NaviSlim -- capable of adapting the\namount of resources spent on computing and sensing in response to the current\ncontext (i.e., difficulty of the environment, current trajectory, and\nnavigation goals). Specifically, NaviSlim is designed as a gated slimmable\nneural network architecture that, different from existing slimmable networks,\ncan dynamically select a slimming factor to autonomously scale model\ncomplexity, which consequently optimizes execution time and energy consumption.\nMoreover, different from existing sensor fusion approaches, NaviSlim can\ndynamically select power levels of onboard sensors to autonomously reduce power\nand time spent during sensor acquisition, without the need to switch between\ndifferent neural networks. By means of extensive training and testing on the\nrobust simulation environment Microsoft AirSim, we evaluate our NaviSlim models\non scenarios with varying difficulty and a test set that showed a dynamic\nreduced model complexity on average between 57-92%, and between 61-80% sensor\nutilization, as compared to static neural networks designed to match computing\nand sensing of that required by the most difficult scenario.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"rWrjXdTIg5HVTNut5Gh44IWbdZjmuZN6Oh-4HaViihg","pdfSize":"2984070"}
