{"id":"2407.12322","title":"Frequency Guidance Matters: Skeletal Action Recognition by\n  Frequency-Aware Mixed Transformer","authors":"Wenhan Wu, Ce Zheng, Zihao Yang, Chen Chen, Srijan Das, Aidong Lu","authorsParsed":[["Wu","Wenhan",""],["Zheng","Ce",""],["Yang","Zihao",""],["Chen","Chen",""],["Das","Srijan",""],["Lu","Aidong",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 05:47:27 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 13:04:21 GMT"},{"version":"v3","created":"Mon, 29 Jul 2024 18:03:50 GMT"}],"updateDate":"2024-07-31","timestamp":1721195247000,"abstract":"  Recently, transformers have demonstrated great potential for modeling\nlong-term dependencies from skeleton sequences and thereby gained\never-increasing attention in skeleton action recognition. However, the existing\ntransformer-based approaches heavily rely on the naive attention mechanism for\ncapturing the spatiotemporal features, which falls short in learning\ndiscriminative representations that exhibit similar motion patterns. To address\nthis challenge, we introduce the Frequency-aware Mixed Transformer\n(FreqMixFormer), specifically designed for recognizing similar skeletal actions\nwith subtle discriminative motions. First, we introduce a frequency-aware\nattention module to unweave skeleton frequency representations by embedding\njoint features into frequency attention maps, aiming to distinguish the\ndiscriminative movements based on their frequency coefficients. Subsequently,\nwe develop a mixed transformer architecture to incorporate spatial features\nwith frequency features to model the comprehensive frequency-spatial patterns.\nAdditionally, a temporal transformer is proposed to extract the global\ncorrelations across frames. Extensive experiments show that FreqMiXFormer\noutperforms SOTA on 3 popular skeleton action recognition datasets, including\nNTU RGB+D, NTU RGB+D 120, and NW-UCLA datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}