{"id":"2407.17520","title":"Lead Free Perovskites","authors":"May Ming","authorsParsed":[["Ming","May",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 22:11:34 GMT"},{"version":"v2","created":"Sat, 17 Aug 2024 15:07:01 GMT"}],"updateDate":"2024-08-20","timestamp":1721254294000,"abstract":"  One of the most viable renewable energies is solar power because of its\nversatility, reliability, and abundance. In the market, a majority of the solar\npanels are made from silicon wafers. These solar panels have an efficiency of\n26.4 percent and can last more than 25 years. The perovskite solar cell is a\nrelatively new type of solar technology that has a similar maximum efficiency\nand much cheaper costs, the only downside is that it is less stable and the\nmost efficient type uses lead. The name perovskite refers to the crystal\nstructure with an ABX3 formula of the perovskite layer of the cell. All\nmaterials possess a property called a band gap. The smaller the band gap the\nmore conductive the material, but this does not necessarily mean that the\nsmaller the band gap the better the solar cell. The Shockley-Queisser limit\nprovides the optimal band gap in terms of efficiency for a single junction\nsolar cell which is 1.34 eV for single junction cells. This research focuses on\ntuning the band gap of lead-free perovskites through B-site cation replacement.\nThrough this investigation, the optical band gaps of tin and lead perovskites\nwere re-established. However, the copper-based perovskite disagrees with\nexisting DFT calculations. Additionally, the mixed tin and copper perovskite in\nthis experiment contradicts the intuitive prediction.\n","subjects":["Condensed Matter/Materials Science","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"7eSjqASSQ2LcSgFi0EcT_mhPalO4o0JoSJxiq6lhI-U","pdfSize":"1606226","objectId":"0x9e62eb0283b31042075a97f813f24ea48f13f8dfc8c50a183c68526828493251","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
