{"id":"2407.15630","title":"Euclidean wormholes in holographic RG flows","authors":"Jeevan Chandra","authorsParsed":[["Chandra","Jeevan",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 13:43:47 GMT"}],"updateDate":"2024-07-23","timestamp":1721655827000,"abstract":"  We describe a one-parameter family of Euclidean wormhole solutions with the\ntopology of a compact hyperbolic space times an interval in Einstein gravity\nminimally coupled to a massless scalar field in AdS$_{d+1}$ commonly referred\nto as Einstein-dilaton gravity. These solutions are locally described by the\nsame metric and dilaton profile as the single-boundary Janus domain wall\nsolutions in the same theory which are usually studied in the context of\nholographic RG flows. The wormholes compute the averaged product of partition\nfunctions of CFTs on either boundary deformed by different marginal couplings\nto the scalar operator dual to the dilaton. We observe that the renormalised\nvolumes of these wormholes increase monotonically with the difference in the\nmarginal couplings on the boundary thereby showing that the pair of CFTs on the\nboundaries get increasingly decorrelated as the difference in the marginal\ncouplings increases. We use the partition functions of the three-dimensional\nwormhole solutions to determine the variance of the OPE data of local operators\nbetween the marginally deformed 2d CFTs and quantify how the variance decays\nwith the difference in marginal couplings. In addition, a family of wormholes\nsourced by a thin shell of dust determine how the variance of the matrix\nelements of the dual line defect decays with the difference in marginal\ncouplings. Applying the GKPW dictionary to wormholes, we compute averages of\nintegrated dilaton correlators treating the wormhole amplitude as a functional\nof the dilaton sources. We observe that the crossed two-point correlators with\na dilaton insertion on either boundary decay montonically with the difference\nin marginal couplings consistent with the observation that the CFTs\nincreasingly decorrelate as the difference in marginal couplings grows.\n","subjects":["Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}