{"id":"2407.02845","title":"FedPot: A Quality-Aware Collaborative and Incentivized Honeypot-Based\n  Detector for Smart Grid Networks","authors":"Abdullatif Albaseer, Nima Abdi, Mohamed Abdallah, Marwa Qaraqe, and\n  Saif Alkuwari","authorsParsed":[["Albaseer","Abdullatif",""],["Abdi","Nima",""],["Abdallah","Mohamed",""],["Qaraqe","Marwa",""],["Alkuwari","Saif",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 06:47:21 GMT"}],"updateDate":"2024-07-04","timestamp":1719989241000,"abstract":"  Honeypot technologies provide an effective defense strategy for the\nIndustrial Internet of Things (IIoT), particularly in enhancing the Advanced\nMetering Infrastructure's (AMI) security by bolstering the network intrusion\ndetection system. For this security paradigm to be fully realized, it\nnecessitates the active participation of small-scale power suppliers (SPSs) in\nimplementing honeypots and engaging in collaborative data sharing with\ntraditional power retailers (TPRs). To motivate this interaction, TPRs\nincentivize data sharing with tangible rewards. However, without access to an\nSPS's confidential data, it is daunting for TPRs to validate shared data,\nthereby risking SPSs' privacy and increasing sharing costs due to voluminous\nhoneypot logs. These challenges can be resolved by utilizing Federated Learning\n(FL), a distributed machine learning (ML) technique that allows for model\ntraining without data relocation. However, the conventional FL algorithm lacks\nthe requisite functionality for both the security defense model and the rewards\nsystem of the AMI network. This work presents two solutions: first, an enhanced\nand cost-efficient FedAvg algorithm incorporating a novel data quality measure,\nand second, FedPot, the development of an effective security model with a fair\nincentives mechanism under an FL architecture. Accordingly, SPSs are limited to\nsharing the ML model they learn after efficiently measuring their local data\nquality, whereas TPRs can verify the participants' uploaded models and fairly\ncompensate each participant for their contributions through rewards. Simulation\nresults, drawn from realistic mircorgrid network log datasets, demonstrate that\nthe proposed solutions outperform state-of-the-art techniques by enhancing the\nsecurity model and guaranteeing fair reward distributions.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/"}