{"id":"2407.18050","title":"Travel time and energy dissipation minima in heterogeneous subsurface\n  flows","authors":"Scott K. Hansen and Daniel O'Malley","authorsParsed":[["Hansen","Scott K.",""],["O'Malley","Daniel",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 14:02:43 GMT"}],"updateDate":"2024-07-26","timestamp":1721916163000,"abstract":"  We establish a number of results concerning conditions for minimum energy\ndissipation and advective travel time in porous and fractured media. First, we\nestablish a pair of converse results concerning fluid motion along a streamline\nbetween two points of fixed head: the minimal advective time is achieved under\nconditions of constant energy dissipation, and minimal energy dissipation is\nachieved under conditions of constant velocity along the streamline (implying\nhomogeneous conductivity in the vicinity of the streamline). We also show\ndirectly by means of variational methods that minimum advection time along a\nstreamline with a given average conductivity is achieved when the conductivity\nis constant. Finally, we turn our attention to minimum advection time and\nenergy dissipation in parallel and sequential fracture systems governed by the\ncubic law: for which fracture cross-section and conductivity are intimately\nlinked. We show that, as in porous domains, flow partitioning between different\npathways always acts to minimize system energy dissipation. Finally, we\nconsider minimum advection time as a function of aperture distribution in a\nsequence of fracture segments. We show that, for a fixed average aperture, a\nuniform-aperture system displays the shortest advection time. However, we also\nshow that any sufficiently small small perturbations in aperture away from\nuniformity always act to reduce advection time.\n","subjects":["Physics/Fluid Dynamics","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}