{"id":"2407.15152","title":"SNNGX: Securing Spiking Neural Networks with Genetic XOR Encryption on\n  RRAM-based Neuromorphic Accelerator","authors":"Kwunhang Wong, Songqi Wang, Wei Huang, Xinyuan Zhang, Yangu He, Karl\n  M.H. Lai, Yuzhong Jiao, Ning Lin, Xiaojuan Qi, Xiaoming Chen and Zhongrui\n  Wang","authorsParsed":[["Wong","Kwunhang",""],["Wang","Songqi",""],["Huang","Wei",""],["Zhang","Xinyuan",""],["He","Yangu",""],["Lai","Karl M. H.",""],["Jiao","Yuzhong",""],["Lin","Ning",""],["Qi","Xiaojuan",""],["Chen","Xiaoming",""],["Wang","Zhongrui",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 13:08:05 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 10:20:30 GMT"}],"updateDate":"2024-08-27","timestamp":1721567285000,"abstract":"  Biologically plausible Spiking Neural Networks (SNNs), characterized by spike\nsparsity, are growing tremendous attention over intellectual edge devices and\ncritical bio-medical applications as compared to artificial neural networks\n(ANNs). However, there is a considerable risk from malicious attempts to\nextract white-box information (i.e., weights) from SNNs, as attackers could\nexploit well-trained SNNs for profit and white-box adversarial concerns. There\nis a dire need for intellectual property (IP) protective measures. In this\npaper, we present a novel secure software-hardware co-designed RRAM-based\nneuromorphic accelerator for protecting the IP of SNNs. Software-wise, we\ndesign a tailored genetic algorithm with classic XOR encryption to target the\nleast number of weights that need encryption. From a hardware perspective, we\ndevelop a low-energy decryption module, meticulously designed to provide zero\ndecryption latency. Extensive results from various datasets, including NMNIST,\nDVSGesture, EEGMMIDB, Braille Letter, and SHD, demonstrate that our proposed\nmethod effectively secures SNNs by encrypting a minimal fraction of stealthy\nweights, only 0.00005% to 0.016% weight bits. Additionally, it achieves a\nsubstantial reduction in energy consumption, ranging from x59 to x6780, and\nsignificantly lowers decryption latency, ranging from x175 to x4250. Moreover,\nour method requires as little as one sample per class in dataset for encryption\nand addresses hessian/gradient-based search insensitive problems. This strategy\noffers a highly efficient and flexible solution for securing SNNs in diverse\napplications.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}