{"id":"2407.10482","title":"NGP-RT: Fusing Multi-Level Hash Features with Lightweight Attention for\n  Real-Time Novel View Synthesis","authors":"Yubin Hu, Xiaoyang Guo, Yang Xiao, Jingwei Huang, and Yong-Jin Liu","authorsParsed":[["Hu","Yubin",""],["Guo","Xiaoyang",""],["Xiao","Yang",""],["Huang","Jingwei",""],["Liu","Yong-Jin",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 07:08:03 GMT"}],"updateDate":"2024-07-16","timestamp":1721027283000,"abstract":"  This paper presents NGP-RT, a novel approach for enhancing the rendering\nspeed of Instant-NGP to achieve real-time novel view synthesis. As a classic\nNeRF-based method, Instant-NGP stores implicit features in multi-level grids or\nhash tables and applies a shallow MLP to convert the implicit features into\nexplicit colors and densities. Although it achieves fast training speed, there\nis still a lot of room for improvement in its rendering speed due to the\nper-point MLP executions for implicit multi-level feature aggregation,\nespecially for real-time applications. To address this challenge, our proposed\nNGP-RT explicitly stores colors and densities as hash features, and leverages a\nlightweight attention mechanism to disambiguate the hash collisions instead of\nusing computationally intensive MLP. At the rendering stage, NGP-RT\nincorporates a pre-computed occupancy distance grid into the ray marching\nstrategy to inform the distance to the nearest occupied voxel, thereby reducing\nthe number of marching points and global memory access. Experimental results\nshow that on the challenging Mip-NeRF360 dataset, NGP-RT achieves better\nrendering quality than previous NeRF-based methods, achieving 108 fps at 1080p\nresolution on a single Nvidia RTX 3090 GPU. Our approach is promising for\nNeRF-based real-time applications that require efficient and high-quality\nrendering.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"jy0XyiSp7GLxq22wYQcVUwjDJU_J-0H4R6qLnS_eFJQ","pdfSize":"28551640"}
