{"id":"2407.01328","title":"CSFNet: A Cosine Similarity Fusion Network for Real-Time RGB-X Semantic\n  Segmentation of Driving Scenes","authors":"Danial Qashqai, Emad Mousavian, Shahriar Baradaran Shokouhi, Sattar\n  Mirzakuchaki","authorsParsed":[["Qashqai","Danial",""],["Mousavian","Emad",""],["Shokouhi","Shahriar Baradaran",""],["Mirzakuchaki","Sattar",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 14:34:32 GMT"}],"updateDate":"2024-07-02","timestamp":1719844472000,"abstract":"  Semantic segmentation, as a crucial component of complex visual\ninterpretation, plays a fundamental role in autonomous vehicle vision systems.\nRecent studies have significantly improved the accuracy of semantic\nsegmentation by exploiting complementary information and developing multimodal\nmethods. Despite the gains in accuracy, multimodal semantic segmentation\nmethods suffer from high computational complexity and low inference speed.\nTherefore, it is a challenging task to implement multimodal methods in driving\napplications. To address this problem, we propose the Cosine Similarity Fusion\nNetwork (CSFNet) as a real-time RGB-X semantic segmentation model.\nSpecifically, we design a Cosine Similarity Attention Fusion Module (CS-AFM)\nthat effectively rectifies and fuses features of two modalities. The CS-AFM\nmodule leverages cross-modal similarity to achieve high generalization ability.\nBy enhancing the fusion of cross-modal features at lower levels, CS-AFM paves\nthe way for the use of a single-branch network at higher levels. Therefore, we\nuse dual and single-branch architectures in an encoder, along with an efficient\ncontext module and a lightweight decoder for fast and accurate predictions. To\nverify the effectiveness of CSFNet, we use the Cityscapes, MFNet, and ZJU\ndatasets for the RGB-D/T/P semantic segmentation. According to the results,\nCSFNet has competitive accuracy with state-of-the-art methods while being\nstate-of-the-art in terms of speed among multimodal semantic segmentation\nmodels. It also achieves high efficiency due to its low parameter count and\ncomputational complexity. The source code for CSFNet will be available at\nhttps://github.com/Danial-Qashqai/CSFNet.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}