{"id":"2407.14543","title":"Towards consistency of rule-based explainer and black box model --\n  fusion of rule induction and XAI-based feature importance","authors":"Micha{\\l} Kozielski, Marek Sikora, {\\L}ukasz Wawrowski","authorsParsed":[["Kozielski","Michał",""],["Sikora","Marek",""],["Wawrowski","Łukasz",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 07:56:29 GMT"}],"updateDate":"2024-07-23","timestamp":1721116589000,"abstract":"  Rule-based models offer a human-understandable representation, i.e. they are\ninterpretable. For this reason, they are used to explain the decisions of\nnon-interpretable complex models, referred to as black box models. The\ngeneration of such explanations involves the approximation of a black box model\nby a rule-based model. To date, however, it has not been investigated whether\nthe rule-based model makes decisions in the same way as the black box model it\napproximates. Decision making in the same way is understood in this work as the\nconsistency of decisions and the consistency of the most important attributes\nused for decision making. This study proposes a novel approach ensuring that\nthe rule-based surrogate model mimics the performance of the black box model.\nThe proposed solution performs an explanation fusion involving rule generation\nand taking into account the feature importance determined by the selected XAI\nmethods for the black box model being explained. The result of the method can\nbe both global and local rule-based explanations. The quality of the proposed\nsolution was verified by extensive analysis on 30 tabular benchmark datasets\nrepresenting classification problems. Evaluation included comparison with the\nreference method and an illustrative case study. In addition, the paper\ndiscusses the possible pathways for the application of the rule-based approach\nin XAI and how rule-based explanations, including the proposed method, meet the\nuser perspective and requirements for both content and presentation. The\nsoftware created and a detailed report containing the full experimental results\nare available on the GitHub repository\n(https://github.com/ruleminer/FI-rules4XAI ).\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}