{"id":"2407.13687","title":"Dynamic Pricing in Securities Lending Market: Application in Revenue\n  Optimization for an Agent Lender Portfolio","authors":"Jing Xu, Yung-Cheng Hsu, William Biscarri","authorsParsed":[["Xu","Jing",""],["Hsu","Yung-Cheng",""],["Biscarri","William",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:42:37 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 19:46:54 GMT"}],"updateDate":"2024-07-23","timestamp":1721324557000,"abstract":"  Securities lending is an important part of the financial market structure,\nwhere agent lenders help long term institutional investors to lend out their\nsecurities to short sellers in exchange for a lending fee. Agent lenders within\nthe market seek to optimize revenue by lending out securities at the highest\nrate possible. Typically, this rate is set by hard-coded business rules or\nstandard supervised machine learning models. These approaches are often\ndifficult to scale and are not adaptive to changing market conditions. Unlike a\ntraditional stock exchange with a centralized limit order book, the securities\nlending market is organized similarly to an e-commerce marketplace, where agent\nlenders and borrowers can transact at any agreed price in a bilateral fashion.\nThis similarity suggests that the use of typical methods for addressing dynamic\npricing problems in e-commerce could be effective in the securities lending\nmarket. We show that existing contextual bandit frameworks can be successfully\nutilized in the securities lending market. Using offline evaluation on real\nhistorical data, we show that the contextual bandit approach can consistently\noutperform typical approaches by at least 15% in terms of total revenue\ngenerated.\n","subjects":["Quantitative Finance/Trading and Market Microstructure","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"D172HaNcpN4HnBlRb5jj09u6XMRic5dv70Yk8YH_mJY","pdfSize":"610488","objectId":"0x8123139aa285ff2cfc308f161840ac76d5cfe52fce7cc1439c9be1f2f5a0ef39","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
