{"id":"2407.10953","title":"MMM: Multilingual Mutual Reinforcement Effect Mix Datasets & Test with\n  Open-domain Information Extraction Large Language Models","authors":"Chengguang Gan, Qingyu Yin, Xinyang He, Hanjun Wei, Yunhao Liang,\n  Younghun Lim, Shijian Wang, Hexiang Huang, Qinghao Zhang, Shiwen Ni,\n  Tatsunori Mori","authorsParsed":[["Gan","Chengguang",""],["Yin","Qingyu",""],["He","Xinyang",""],["Wei","Hanjun",""],["Liang","Yunhao",""],["Lim","Younghun",""],["Wang","Shijian",""],["Huang","Hexiang",""],["Zhang","Qinghao",""],["Ni","Shiwen",""],["Mori","Tatsunori",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:50:43 GMT"},{"version":"v2","created":"Sat, 17 Aug 2024 06:59:05 GMT"}],"updateDate":"2024-08-20","timestamp":1721065843000,"abstract":"  The Mutual Reinforcement Effect (MRE) represents a promising avenue in\ninformation extraction and multitasking research. Nevertheless, its\napplicability has been constrained due to the exclusive availability of MRE mix\ndatasets in Japanese, thereby limiting comprehensive exploration by the global\nresearch community. To address this limitation, we introduce a Multilingual MRE\nmix dataset (MMM) that encompasses 21 sub-datasets in English, Japanese, and\nChinese. In this paper, we also propose a method for dataset translation\nassisted by Large Language Models (LLMs), which significantly reduces the\nmanual annotation time required for dataset construction by leveraging LLMs to\ntranslate the original Japanese datasets. Additionally, we have enriched the\ndataset by incorporating open-domain Named Entity Recognition (NER) and\nsentence classification tasks. Utilizing this expanded dataset, we developed a\nunified input-output framework to train an Open-domain Information Extraction\nLarge Language Model (OIELLM). The OIELLM model demonstrates the capability to\neffectively process novel MMM datasets, exhibiting significant improvements in\nperformance.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}