{"id":"2407.15610","title":"A two-step model to study the inclusivity's distribution of Italian\n  early childhood education and care services","authors":"Angela Andreella and Gaia Bertarelli and Federico Caldura and Stefano\n  Campostrini","authorsParsed":[["Andreella","Angela",""],["Bertarelli","Gaia",""],["Caldura","Federico",""],["Campostrini","Stefano",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 13:08:48 GMT"}],"updateDate":"2024-07-23","timestamp":1721653728000,"abstract":"  This study investigates how to define and measure inclusivity in Italy's\nearly childhood education and care (ECEC) services, bringing to light the gap\nbetween legislative principles and local/regional applications. The Italian\nlegislative decree n. 65/2017 prescribes inclusivity in ECEC, defined as being\nopen to all children and indicating it as a top priority. To delve into this\nconcept, we propose a two-step model. First, a latent trait model estimates an\ninclusivity index as a latent variable. Then, a mixed quantile model examines\nthe distribution of this novel latent inclusivity index across Italian regions.\nOur findings reveal a substantial variation in inclusivity across Italy. In\naddition, a proper indicator based on the latent inclusivity index defined in\nthe first step is provided at the NUTS-3 level using the empirical best\npredictor approach. From our analysis, public facilities demonstrate a higher\nlevel of inclusivity compared to their private counterparts. Despite these\nchallenges, we are compelled to identify positive scenarios that can serve as\nmodels for regions facing more critical situations. Besides its methodological\nadvancement, this paper provides policymakers and stakeholders with an evident\ncall to action, offering valuable insights into the inclusivity landscape of\nItalian ECEC services. It underscores the urgent need to standardize the\naccessibility characteristics of ECEC services throughout Italy to ensure\nequitable access for all children.\n","subjects":["Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}