{"id":"2407.05256","title":"Unlocking Textual and Visual Wisdom: Open-Vocabulary 3D Object Detection\n  Enhanced by Comprehensive Guidance from Text and Image","authors":"Pengkun Jiao, Na Zhao, Jingjing Chen, Yu-Gang Jiang","authorsParsed":[["Jiao","Pengkun",""],["Zhao","Na",""],["Chen","Jingjing",""],["Jiang","Yu-Gang",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 04:50:04 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 16:50:09 GMT"}],"updateDate":"2024-07-18","timestamp":1720327804000,"abstract":"  Open-vocabulary 3D object detection (OV-3DDet) aims to localize and recognize\nboth seen and previously unseen object categories within any new 3D scene.\nWhile language and vision foundation models have achieved success in handling\nvarious open-vocabulary tasks with abundant training data, OV-3DDet faces a\nsignificant challenge due to the limited availability of training data.\nAlthough some pioneering efforts have integrated vision-language models (VLM)\nknowledge into OV-3DDet learning, the full potential of these foundational\nmodels has yet to be fully exploited. In this paper, we unlock the textual and\nvisual wisdom to tackle the open-vocabulary 3D detection task by leveraging the\nlanguage and vision foundation models. We leverage a vision foundation model to\nprovide image-wise guidance for discovering novel classes in 3D scenes.\nSpecifically, we utilize a object detection vision foundation model to enable\nthe zero-shot discovery of objects in images, which serves as the initial seeds\nand filtering guidance to identify novel 3D objects. Additionally, to align the\n3D space with the powerful vision-language space, we introduce a hierarchical\nalignment approach, where the 3D feature space is aligned with the\nvision-language feature space using a pre-trained VLM at the instance,\ncategory, and scene levels. Through extensive experimentation, we demonstrate\nsignificant improvements in accuracy and generalization, highlighting the\npotential of foundation models in advancing open-vocabulary 3D object detection\nin real-world scenarios.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HEtpIV8Aiqapmirq2hJDa8TWqAP2mlnX4-20U3DKsLI","pdfSize":"5019621"}
