{"id":"2407.05247","title":"An efficient pipeline to compute patient-specific cerebral aneurysm wall\n  tension","authors":"Mostafa Jamshidian, Benjamin Zwick, Arosha S Dissanayake, Adam Wittek,\n  Timothy J Phillips, Stephen Honeybul, Graeme J Hankey, Karol Miller","authorsParsed":[["Jamshidian","Mostafa",""],["Zwick","Benjamin",""],["Dissanayake","Arosha S",""],["Wittek","Adam",""],["Phillips","Timothy J",""],["Honeybul","Stephen",""],["Hankey","Graeme J",""],["Miller","Karol",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 03:34:30 GMT"}],"updateDate":"2024-07-09","timestamp":1720323270000,"abstract":"  Cerebral aneurysm rupture, leading to subarachnoid hemorrhage with a high\nmortality rate, disproportionately affects younger populations, resulting in a\nsignificant loss of productive life years. A significant proportion of these\ndeaths is due to aneurysmal re-bleeding within the first three days following\nthe initial bleed, prior to treatment. While early aneurysm treatment is\nrecommended, there is no consensus on the ideal timing, and emergency treatment\noffers only an incremental benefit at a significant cost. Although various\nmultivariable prediction models have been proposed to provide personalized risk\nassessments, no validated patient-specific predictor is available to\nrationalize emergency treatment. Furthermore, no model has yet incorporated\nemerging computational biomechanics-based biomarkers such as wall tension. In\nthis paper, we proposed and validated an efficient semi-automatic pipeline to\ncompute patient-specific cerebral aneurysm wall tension as a potential\nbiomarker for the likelihood of re-bleeding. Our pipeline uses the patient's\ncomputed tomography angiography (CTA) image obtained at the time of\nsubarachnoid hemorrhage diagnosis to create a patient-specific biomechanical\nmodel of the cerebral aneurysm using the finite element method. A distinctive\nfeature of our approach is the straightforward model creation and wall tension\ncomputation using shell finite elements, without requiring patient-specific\nmaterial properties or aneurysm wall thickness. Our non-invasive,\npatient-specific method for cerebral aneurysm wall tension can potentially\nprovide individualized risk prediction and enhance clinical decision-making.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}