{"id":"2407.07506","title":"Generative AI for RF Sensing in IoT systems","authors":"Li Wang, Chao Zhang, Qiyang Zhao, Hang Zou, Samson Lasaulce, Giuseppe\n  Valenzise, Zhuo He, and Merouane Debbah","authorsParsed":[["Wang","Li",""],["Zhang","Chao",""],["Zhao","Qiyang",""],["Zou","Hang",""],["Lasaulce","Samson",""],["Valenzise","Giuseppe",""],["He","Zhuo",""],["Debbah","Merouane",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 09:51:44 GMT"}],"updateDate":"2024-07-11","timestamp":1720605104000,"abstract":"  The development of wireless sensing technologies, using signals such as\nWi-Fi, infrared, and RF to gather environmental data, has significantly\nadvanced within Internet of Things (IoT) systems. Among these, Radio Frequency\n(RF) sensing stands out for its cost-effective and non-intrusive monitoring of\nhuman activities and environmental changes. However, traditional RF sensing\nmethods face significant challenges, including noise, interference, incomplete\ndata, and high deployment costs, which limit their effectiveness and\nscalability. This paper investigates the potential of Generative AI (GenAI) to\novercome these limitations within the IoT ecosystem. We provide a comprehensive\nreview of state-of-the-art GenAI techniques, focusing on their application to\nRF sensing problems. By generating high-quality synthetic data, enhancing\nsignal quality, and integrating multi-modal data, GenAI offers robust solutions\nfor RF environment reconstruction, localization, and imaging. Additionally,\nGenAI's ability to generalize enables IoT devices to adapt to new environments\nand unseen tasks, improving their efficiency and performance. The main\ncontributions of this article include a detailed analysis of the challenges in\nRF sensing, the presentation of innovative GenAI-based solutions, and the\nproposal of a unified framework for diverse RF sensing tasks. Through case\nstudies, we demonstrate the effectiveness of integrating GenAI models, leading\nto advanced, scalable, and intelligent IoT systems.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"t7bE7hoXEDwIZJKfe5Dji79W8Hs58FII9Je7S2uHp-0","pdfSize":"1209896"}
