{"id":"2407.08532","title":"Tactics, Techniques, and Procedures (TTPs) in Interpreted Malware: A\n  Zero-Shot Generation with Large Language Models","authors":"Ying Zhang, Xiaoyan Zhou, Hui Wen, Wenjia Niu, Jiqiang Liu, Haining\n  Wang, Qiang Li","authorsParsed":[["Zhang","Ying",""],["Zhou","Xiaoyan",""],["Wen","Hui",""],["Niu","Wenjia",""],["Liu","Jiqiang",""],["Wang","Haining",""],["Li","Qiang",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:18:41 GMT"}],"updateDate":"2024-07-12","timestamp":1720707521000,"abstract":"  Nowadays, the open-source software (OSS) ecosystem suffers from security\nthreats of software supply chain (SSC) attacks. Interpreted OSS malware plays a\nvital role in SSC attacks, as criminals have an arsenal of attack vectors to\ndeceive users into installing malware and executing malicious activities. In\nthis paper, we introduce tactics, techniques, and procedures (TTPs) proposed by\nMITRE ATT\\&CK into the interpreted malware analysis to characterize different\nphases of an attack lifecycle. Specifically, we propose GENTTP, a zero-shot\napproach to extracting a TTP of an interpreted malware package. GENTTP\nleverages large language models (LLMs) to automatically generate a TTP, where\nthe input is a malicious package, and the output is a deceptive tactic and an\nexecution tactic of attack vectors. To validate the effectiveness of GENTTP, we\ncollect two datasets for evaluation: a dataset with ground truth labels and a\nlarge dataset in the wild. Experimental results show that GENTTP can generate\nTTPs with high accuracy and efficiency. To demonstrate GENTTP's benefits, we\nbuild an LLM-based Chatbot from 3,700+ PyPI malware's TTPs. We further conduct\na quantitative analysis of malware's TTPs at a large scale. Our main findings\ninclude: (1) many OSS malicious packages share a relatively stable TTP, even\nwith the increasing emergence of malware and attack campaigns, (2) a TTP\nreflects characteristics of a malware-based attack, and (3) an attacker's\nintent behind the malware is linked to a TTP.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}