{"id":"2407.08132","title":"DMM: Disparity-guided Multispectral Mamba for Oriented Object Detection\n  in Remote Sensing","authors":"Minghang Zhou, Tianyu Li, Chaofan Qiao, Dongyu Xie, Guoqing Wang,\n  Ningjuan Ruan, Lin Mei, Yang Yang","authorsParsed":[["Zhou","Minghang",""],["Li","Tianyu",""],["Qiao","Chaofan",""],["Xie","Dongyu",""],["Wang","Guoqing",""],["Ruan","Ningjuan",""],["Mei","Lin",""],["Yang","Yang",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 02:09:59 GMT"}],"updateDate":"2024-07-12","timestamp":1720663799000,"abstract":"  Multispectral oriented object detection faces challenges due to both\ninter-modal and intra-modal discrepancies. Recent studies often rely on\ntransformer-based models to address these issues and achieve cross-modal fusion\ndetection. However, the quadratic computational complexity of transformers\nlimits their performance. Inspired by the efficiency and lower complexity of\nMamba in long sequence tasks, we propose Disparity-guided Multispectral Mamba\n(DMM), a multispectral oriented object detection framework comprised of a\nDisparity-guided Cross-modal Fusion Mamba (DCFM) module, a Multi-scale\nTarget-aware Attention (MTA) module, and a Target-Prior Aware (TPA) auxiliary\ntask. The DCFM module leverages disparity information between modalities to\nadaptively merge features from RGB and IR images, mitigating inter-modal\nconflicts. The MTA module aims to enhance feature representation by focusing on\nrelevant target regions within the RGB modality, addressing intra-modal\nvariations. The TPA auxiliary task utilizes single-modal labels to guide the\noptimization of the MTA module, ensuring it focuses on targets and their local\ncontext. Extensive experiments on the DroneVehicle and VEDAI datasets\ndemonstrate the effectiveness of our method, which outperforms state-of-the-art\nmethods while maintaining computational efficiency. Code will be available at\nhttps://github.com/Another-0/DMM.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}