{"id":"2407.13318","title":"A new approach to delegate signing rights to proxy signers using\n  isogeny-based cryptography","authors":"Kunal Dey and Somnath Kumar and Vikas Srivastava and Sumit Kumar\n  Debnath","authorsParsed":[["Dey","Kunal",""],["Kumar","Somnath",""],["Srivastava","Vikas",""],["Debnath","Sumit Kumar",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:19:19 GMT"}],"updateDate":"2024-07-19","timestamp":1721294359000,"abstract":"  E-governance is a two-way protocol through which one can use government\nservices, share data and request information. It refers to the use of\ncommunication and information technologies to provide government services to\npublic in an efficient and fast manner. In addition, any document submitted to\nthe e-Government system must be authenticated by a government officer using a\ndigital signature scheme. In the context of digital signatures, the proxy\nsignature is an important cryptographic primitive that allows the original\nsigner to delegate signing authority to another signer (proxy signer). The\nproxy signature has a number of important applications in the e-government\nsystem. There are now a large amount of proxy signature schemes. The security\nof most of them relies on the following hard problems: the discrete logarithm\nproblem and the factorization of integers problem. However, a large-scale\nquantum computer can solve them in polynomial time due to Shor's algorithm. As\na consequence, there is a need for a quantum computer-resistant proxy signature\nto secure e-governance system from quantum adversaries. In this work, we\npropose the first post-quantum isogeny based proxy signature scheme CSI-PS\n(commutative supersingular isogeny proxy signature). Our construction is proven\nto be uf-cma secure under the hardness of the group action inverse problem\n(GAIP) based on isogeny.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}