{"id":"2407.08585","title":"HACMan++: Spatially-Grounded Motion Primitives for Manipulation","authors":"Bowen Jiang, Yilin Wu, Wenxuan Zhou, Chris Paxton, David Held","authorsParsed":[["Jiang","Bowen",""],["Wu","Yilin",""],["Zhou","Wenxuan",""],["Paxton","Chris",""],["Held","David",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 15:10:14 GMT"}],"updateDate":"2024-07-12","timestamp":1720710614000,"abstract":"  Although end-to-end robot learning has shown some success for robot\nmanipulation, the learned policies are often not sufficiently robust to\nvariations in object pose or geometry. To improve the policy generalization, we\nintroduce spatially-grounded parameterized motion primitives in our method\nHACMan++. Specifically, we propose an action representation consisting of three\ncomponents: what primitive type (such as grasp or push) to execute, where the\nprimitive will be grounded (e.g. where the gripper will make contact with the\nworld), and how the primitive motion is executed, such as parameters specifying\nthe push direction or grasp orientation. These three components define a novel\ndiscrete-continuous action space for reinforcement learning. Our framework\nenables robot agents to learn to chain diverse motion primitives together and\nselect appropriate primitive parameters to complete long-horizon manipulation\ntasks. By grounding the primitives on a spatial location in the environment,\nour method is able to effectively generalize across object shape and pose\nvariations. Our approach significantly outperforms existing methods,\nparticularly in complex scenarios demanding both high-level sequential\nreasoning and object generalization. With zero-shot sim-to-real transfer, our\npolicy succeeds in challenging real-world manipulation tasks, with\ngeneralization to unseen objects. Videos can be found on the project website:\nhttps://sgmp-rss2024.github.io.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}