{"id":"2407.20123","title":"Context-Aware CSI Tracking and Path Loss Prediction Using Machine\n  Learning and Dynamical Systems","authors":"Anis Hamadouche and Mathini Sellathurai","authorsParsed":[["Hamadouche","Anis",""],["Sellathurai","Mathini",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:53:51 GMT"}],"updateDate":"2024-07-30","timestamp":1722268431000,"abstract":"  In this paper, we present an advanced model for Channel State Information\n(CSI) tracking, leveraging a dynamical system approach to adapt CSI dynamically\nbased on exogenous contextual information. This methodology allows for\ncontinuous updates to the Channel Knowledge Map (CKM), enhancing communication\nreliability and responsiveness in dynamic environments. To generate realistic\nand comprehensive datasets for training and evaluation, we developed a new\nMATLAB simulator that models radio wave propagation in urban environments. We\naddress the challenge of real-time CKM adaptation using online learning of the\nKoopman operator, a technique that forecasts channel behaviour by exploiting\ndynamical system properties. Our approach supports real-time updates with high\naccuracy and efficiency, as demonstrated by experiments with varying window\nsizes for the Koopman Autoencoder model. A window size of 100 was found to\noffer the best balance between prediction accuracy (RMSE: 1.8323 +- 1.1071,\nMAE: 0.3780 +- 0.2221) and computational efficiency (training time: 231.1 +-\n82.5 ms, prediction time: 109.0 +- 55.7 ms). Additionally, we introduce a\nmoving window mechanism to address privacy and security concerns by updating\nthe Koopman operator within the window and purging input data thereafter,\nminimising data retention and storage risks. This ensures the CKM remains\naccurate and relevant while maintaining stringent data privacy standards. Our\nfindings suggest that this approach can significantly improve the resilience\nand security of communication systems, making them highly adaptable to\nenvironmental changes without compromising user privacy.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BPJs4zJQN2-OlrvNsftv7h9zZlFw5sabUbQp7RgoEOg","pdfSize":"1087620","objectId":"0xc66dec50fa7cd44c2fed032bed36efc78b38ef01a678c937457ba0fbe7e27039","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
