{"id":"2407.13194","title":"Robust Multivariate Time Series Forecasting against Intra- and\n  Inter-Series Transitional Shift","authors":"Hui He, Qi Zhang, Kun Yi, Xiaojun Xue, Shoujin Wang, Liang Hu and\n  Longbing Cao","authorsParsed":[["He","Hui",""],["Zhang","Qi",""],["Yi","Kun",""],["Xue","Xiaojun",""],["Wang","Shoujin",""],["Hu","Liang",""],["Cao","Longbing",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 06:16:03 GMT"}],"updateDate":"2024-07-19","timestamp":1721283363000,"abstract":"  The non-stationary nature of real-world Multivariate Time Series (MTS) data\npresents forecasting models with a formidable challenge of the time-variant\ndistribution of time series, referred to as distribution shift. Existing\nstudies on the distribution shift mostly adhere to adaptive normalization\ntechniques for alleviating temporal mean and covariance shifts or time-variant\nmodeling for capturing temporal shifts. Despite improving model generalization,\nthese normalization-based methods often assume a time-invariant transition\nbetween outputs and inputs but disregard specific intra-/inter-series\ncorrelations, while time-variant models overlook the intrinsic causes of the\ndistribution shift. This limits model expressiveness and interpretability of\ntackling the distribution shift for MTS forecasting. To mitigate such a\ndilemma, we present a unified Probabilistic Graphical Model to Jointly\ncapturing intra-/inter-series correlations and modeling the time-variant\ntransitional distribution, and instantiate a neural framework called JointPGM\nfor non-stationary MTS forecasting. Specifically, JointPGM first employs\nmultiple Fourier basis functions to learn dynamic time factors and designs two\ndistinct learners: intra-series and inter-series learners. The intra-series\nlearner effectively captures temporal dynamics by utilizing temporal gates,\nwhile the inter-series learner explicitly models spatial dynamics through\nmulti-hop propagation, incorporating Gumbel-softmax sampling. These two types\nof series dynamics are subsequently fused into a latent variable, which is\ninversely employed to infer time factors, generate final prediction, and\nperform reconstruction. We validate the effectiveness and efficiency of\nJointPGM through extensive experiments on six highly non-stationary MTS\ndatasets, achieving state-of-the-art forecasting performance of MTS\nforecasting.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}