{"id":"2407.00382","title":"Towards Universal Mesh Movement Networks","authors":"Mingrui Zhang and Chunyang Wang and Stephan Kramer and Joseph G.\n  Wallwork and Siyi Li and Jiancheng Liu and Xiang Chen and Matthew D. Piggott","authorsParsed":[["Zhang","Mingrui",""],["Wang","Chunyang",""],["Kramer","Stephan",""],["Wallwork","Joseph G.",""],["Li","Siyi",""],["Liu","Jiancheng",""],["Chen","Xiang",""],["Piggott","Matthew D.",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 09:35:12 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 03:22:04 GMT"}],"updateDate":"2024-07-03","timestamp":1719653712000,"abstract":"  Solving complex Partial Differential Equations (PDEs) accurately and\nefficiently is an essential and challenging problem in all scientific and\nengineering disciplines. Mesh movement methods provide the capability to\nimprove the accuracy of the numerical solution without increasing the overall\nmesh degree of freedom count. Conventional sophisticated mesh movement methods\nare extremely expensive and struggle to handle scenarios with complex boundary\ngeometries. However, existing learning-based methods require re-training from\nscratch given a different PDE type or boundary geometry, which limits their\napplicability, and also often suffer from robustness issues in the form of\ninverted elements. In this paper, we introduce the Universal Mesh Movement\nNetwork (UM2N), which -- once trained -- can be applied in a non-intrusive,\nzero-shot manner to move meshes with different size distributions and\nstructures, for solvers applicable to different PDE types and boundary\ngeometries. UM2N consists of a Graph Transformer (GT) encoder for extracting\nfeatures and a Graph Attention Network (GAT) based decoder for moving the mesh.\nWe evaluate our method on advection and Navier-Stokes based examples, as well\nas a real-world tsunami simulation case. Our method outperforms existing\nlearning-based mesh movement methods in terms of the benchmarks described\nabove. In comparison to the conventional sophisticated Monge-Amp\\`ere\nPDE-solver based method, our approach not only significantly accelerates mesh\nmovement, but also proves effective in scenarios where the conventional method\nfails. Our project page is at https://erizmr.github.io/UM2N/.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QxjIrEDRevDgQP_hDjo96B21zR0WVFahGXTrsuLH1tg","pdfSize":"13951563"}
