{"id":"2407.06049","title":"On the Consistency of Dynamic Wetting Boundary Conditions for the\n  Navier-Stokes-Cahn-Hilliard Equations","authors":"T. H. B. Demont, S. K. F. Stoter, C. Diddens, E. H. van Brummelen","authorsParsed":[["Demont","T. H. B.",""],["Stoter","S. K. F.",""],["Diddens","C.",""],["van Brummelen","E. H.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 15:53:02 GMT"}],"updateDate":"2024-07-09","timestamp":1720453982000,"abstract":"  We investigate the limiting behavior of the Navier-Stokes-Cahn-Hilliard model\nfor binary-fluid flows as the diffuse-interface thickness passes to zero, in\nthe presence of fluid-fluid-solid contact lines. Allowing for motion of such\ncontact lines relative to the solid substrate is required to adequately model\nmulti-phase and multi-species fluid transport past and through solid media.\nEven though diffuse-interface models provide an inherent slip mechanism through\nthe mobility-induced diffusion, this slip vanishes as the interface thickness\nand mobility parameter tend to zero in the so-called sharp-interface limit. The\nobjective of this work is to present dynamic wetting and generalized Navier\nboundary conditions for diffuse-interface models that are consistent in the\nsharp-interface limit. We concentrate our analysis on the prototypical\nbinary-fluid Couette-flow problems. To verify the consistency of the\ndiffuse-interface model in the limit of vanishing interface thickness, we\nprovide reference limit solutions of a corresponding sharp-interface model. For\nparameter values both at and away from the critical viscosity ratio, we present\nand compare the results of both the diffuse- and sharp-interface models. The\nclose match between both model results indicates that the considered test case\nlends itself well as a benchmark for further research.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}