{"id":"2407.16323","title":"Two Results on LPT: A Near-Linear Time Algorithm and Parcel Delivery\n  using Drones","authors":"L. Sunil Chandran, Rishikesh Gajjala, Shravan Mehra, Saladi Rahul","authorsParsed":[["Chandran","L. Sunil",""],["Gajjala","Rishikesh",""],["Mehra","Shravan",""],["Rahul","Saladi",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 09:19:11 GMT"}],"updateDate":"2024-07-24","timestamp":1721726351000,"abstract":"  The focus of this paper is to increase our understanding of the Longest\nProcessing Time First (LPT) heuristic. LPT is a classical heuristic for the\nfundamental problem of uniform machine scheduling. For different machine\nspeeds, LPT was first considered by Gonzalez et al (SIAM J. Computing, 1977).\nSince then, extensive work has been done to improve the approximation factor of\nthe LPT heuristic. However, all known implementations of the LPT heuristic take\n$O(mn)$ time, where $m$ is the number of machines and $n$ is the number of\njobs. In this work, we come up with the first near-linear time implementation\nfor LPT. Specifically, the running time is $O((n+m)(\\log^2{m}+\\log{n}))$.\nSomewhat surprisingly, the result is obtained by mapping the problem to dynamic\nmaintenance of lower envelope of lines, which has been well studied in the\ncomputational geometry community.\n  Our second contribution is to analyze the performance of LPT for the Drones\nWarehouse Problem (DWP), which is a natural generalization of the uniform\nmachine scheduling problem motivated by drone-based parcel delivery from a\nwarehouse. In this problem, a warehouse has multiple drones and wants to\ndeliver parcels to several customers. Each drone picks a parcel from the\nwarehouse, delivers it, and returns to the warehouse (where it can also get\ncharged). The speeds and battery lives of the drones could be different, and\ndue to the limited battery life, each drone has a bounded range in which it can\ndeliver parcels. The goal is to assign parcels to the drones so that the time\ntaken to deliver all the parcels is minimized. We prove that the natural\napproach of solving this problem via the LPT heuristic has an approximation\nfactor of $\\phi$, where $\\phi \\approx 1.62$ is the golden ratio.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Computational Geometry","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jwTXDw6UDiaSqPyDWJQ_Mn-PApWIqGHTq0KjS_SqNcU","pdfSize":"502543"}
