{"id":"2407.13513","title":"Instance Selection for Dynamic Algorithm Configuration with\n  Reinforcement Learning: Improving Generalization","authors":"Carolin Benjamins, Gjorgjina Cenikj, Ana Nikolikj, Aditya Mohan, Tome\n  Eftimov, Marius Lindauer","authorsParsed":[["Benjamins","Carolin",""],["Cenikj","Gjorgjina",""],["Nikolikj","Ana",""],["Mohan","Aditya",""],["Eftimov","Tome",""],["Lindauer","Marius",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 13:44:43 GMT"}],"updateDate":"2024-07-19","timestamp":1721310283000,"abstract":"  Dynamic Algorithm Configuration (DAC) addresses the challenge of dynamically\nsetting hyperparameters of an algorithm for a diverse set of instances rather\nthan focusing solely on individual tasks. Agents trained with Deep\nReinforcement Learning (RL) offer a pathway to solve such settings. However,\nthe limited generalization performance of these agents has significantly\nhindered the application in DAC. Our hypothesis is that a potential bias in the\ntraining instances limits generalization capabilities. We take a step towards\nmitigating this by selecting a representative subset of training instances to\novercome overrepresentation and then retraining the agent on this subset to\nimprove its generalization performance. For constructing the meta-features for\nthe subset selection, we particularly account for the dynamic nature of the RL\nagent by computing time series features on trajectories of actions and rewards\ngenerated by the agent's interaction with the environment. Through empirical\nevaluations on the Sigmoid and CMA-ES benchmarks from the standard benchmark\nlibrary for DAC, called DACBench, we discuss the potentials of our selection\ntechnique compared to training on the entire instance set. Our results\nhighlight the efficacy of instance selection in refining DAC policies for\ndiverse instance spaces.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"HL0Jo8-tWzbsp2bToDHQyY4xy-Oysksc_ASa7Bku8AQ","pdfSize":"891758"}
