{"id":"2407.19780","title":"Kibble-Zurek behavior in a topological phase transition with a quadratic\n  band crossing","authors":"Huan Yuan, Jinyi Zhang, Shuai Chen and Xiaotian Nie","authorsParsed":[["Yuan","Huan",""],["Zhang","Jinyi",""],["Chen","Shuai",""],["Nie","Xiaotian",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 08:22:46 GMT"}],"updateDate":"2024-07-30","timestamp":1722241366000,"abstract":"  Kibble-Zurek (KZ) mechanism describes the scaling behavior when driving a\nsystem across a continuous symmetry-breaking transition. Previous studies have\nshown that the KZ-like scaling behavior also lies in the topological\ntransitions in the Qi-Wu-Zhang model (2D) and the Su-Schrieffer-Heeger model\n(1D), although symmetry breaking does not exist here. Both models with linear\nband crossings give that $\\nu=1$ and $z=1$. We wonder whether different\ncritical exponents can be acquired in topological transitions beyond linear\nband crossing. In this work, we look into the KZ behavior in a topological 2D\ncheckerboard lattice with a quadratic band crossing. We investigate from dual\nperspectives: momentum distribution of the Berry curvature in clean systems for\nsimplicity, and real-space analysis of domain-like local Chern marker\nconfigurations in disordered systems, which is a more intuitive analog to\nconventional KZ description. In equilibrium, we find the correlation length\ndiverges with a power $\\nu\\simeq 1/2$. Then, by slowly quenching the system\nacross the topological phase transition, we find that the freeze-out time\n$t_\\mathrm{f}$ and the unfrozen length scale $\\xi(t_\\mathrm{f})$ both satisfy\nthe KZ scaling, verifying $z\\simeq 2$. We subsequently explore KZ behavior in\ntopological phase transitions with other higher-order band crossing and find\nthe relationship between the critical exponents and the order. Our results\nextend the understanding of the KZ mechanism and non-equilibrium topological\nphase transitions.\n","subjects":["Condensed Matter/Statistical Mechanics","Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Quantum Gases","Condensed Matter/Strongly Correlated Electrons","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}