{"id":"2407.17801","title":"EEG-SSM: Leveraging State-Space Model for Dementia Detection","authors":"Xuan-The Tran, Linh Le, Quoc Toan Nguyen, Thomas Do and Chin-Teng Lin","authorsParsed":[["Tran","Xuan-The",""],["Le","Linh",""],["Nguyen","Quoc Toan",""],["Do","Thomas",""],["Lin","Chin-Teng",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 06:20:03 GMT"}],"updateDate":"2024-07-26","timestamp":1721888403000,"abstract":"  State-space models (SSMs) have garnered attention for effectively processing\nlong data sequences, reducing the need to segment time series into shorter\nintervals for model training and inference. Traditionally, SSMs capture only\nthe temporal dynamics of time series data, omitting the equally critical\nspectral features. This study introduces EEG-SSM, a novel state-space\nmodel-based approach for dementia classification using EEG data. Our model\nfeatures two primary innovations: EEG-SSM temporal and EEG-SSM spectral\ncomponents. The temporal component is designed to efficiently process EEG\nsequences of varying lengths, while the spectral component enhances the model\nby integrating frequency-domain information from EEG signals. The synergy of\nthese components allows EEG-SSM to adeptly manage the complexities of\nmultivariate EEG data, significantly improving accuracy and stability across\ndifferent temporal resolutions. Demonstrating a remarkable 91.0 percent\naccuracy in classifying Healthy Control (HC), Frontotemporal Dementia (FTD),\nand Alzheimer's Disease (AD) groups, EEG-SSM outperforms existing models on the\nsame dataset. The development of EEG-SSM represents an improvement in the use\nof state-space models for screening dementia, offering more precise and\ncost-effective tools for clinical neuroscience.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"h2RXswVyTUxPv4Oxgqj86ROZdl38lDO58rg1stUEKZY","pdfSize":"780544"}
