{"id":"2407.20787","title":"The Interplay Between Collisionless Magnetic Reconnection and Turbulence","authors":"J. E. Stawarz, P. A. Mu\\~noz, N. Bessho, R. Bandyopadhyay, T. K. M.\n  Nakamura, S. Eriksson, D. Graham, J. B\\\"uchner, A. Chasapis, J. F. Drake, M.\n  A. Shay, R. E. Ergun, H. Hasegawa, Yu. V. Khotyaintsev, M. Swisdak, F. Wilder","authorsParsed":[["Stawarz","J. E.",""],["Muñoz","P. A.",""],["Bessho","N.",""],["Bandyopadhyay","R.",""],["Nakamura","T. K. M.",""],["Eriksson","S.",""],["Graham","D.",""],["Büchner","J.",""],["Chasapis","A.",""],["Drake","J. F.",""],["Shay","M. A.",""],["Ergun","R. E.",""],["Hasegawa","H.",""],["Khotyaintsev","Yu. V.",""],["Swisdak","M.",""],["Wilder","F.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 12:45:20 GMT"}],"updateDate":"2024-07-31","timestamp":1722343520000,"abstract":"  Alongside magnetic reconnection, turbulence is another fundamental nonlinear\nplasma phenomenon that plays a key role in energy transport and conversion in\nspace and astrophysical plasmas. From a numerical, theoretical, and\nobservational point of view there is a long history of exploring the interplay\nbetween these two phenomena in space plasma environments; however, recent\nhigh-resolution, multi-spacecraft observations have ushered in a new era of\nunderstanding this complex topic. The interplay between reconnection and\nturbulence is both complex and multifaceted, and can be viewed through a number\nof different interrelated lenses - including turbulence acting to generate\ncurrent sheets that undergo magnetic reconnection (turbulence-driven\nreconnection), magnetic reconnection driving turbulent dynamics in an\nenvironment (reconnection-driven turbulence) or acting as an intermediate step\nin the excitation of turbulence, and the random diffusive/dispersive nature of\nmagnetic field lines embedded in turbulent fluctuations enabling so-called\nstochastic reconnection. In this paper, we review the current state of\nknowledge on these different facets of the interplay between turbulence and\nreconnection in the context of collisionless plasmas, such as those found in\nmany near-Earth astrophysical environments, from a theoretical, numerical, and\nobservational perspective. Particular focus is given to several key regions in\nEarth's magnetosphere - Earth's magnetosheath, magnetotail, and\nKelvin-Helmholtz vortices on the magnetopause flanks - where NASA's\nMagnetospheric Multiscale mission has been providing new insights on the topic.\n","subjects":["Physics/Space Physics","Astrophysics/Solar and Stellar Astrophysics","Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}