{"id":"2407.21600","title":"Robust Simultaneous Multislice MRI Reconstruction Using Deep Generative\n  Priors","authors":"Shoujin Huang, Guanxiong Luo, Yuwan Wang, Kexin Yang, Lingyan Zhang,\n  Jingzhe Liu, Hua Guo, Min Wang, Mengye Lyu","authorsParsed":[["Huang","Shoujin",""],["Luo","Guanxiong",""],["Wang","Yuwan",""],["Yang","Kexin",""],["Zhang","Lingyan",""],["Liu","Jingzhe",""],["Guo","Hua",""],["Wang","Min",""],["Lyu","Mengye",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 13:34:14 GMT"}],"updateDate":"2024-08-01","timestamp":1722432854000,"abstract":"  Simultaneous multislice (SMS) imaging is a powerful technique for\naccelerating magnetic resonance imaging (MRI) acquisitions. However, SMS\nreconstruction remains challenging due to the complex signal interactions\nbetween and within the excited slices. This study presents a robust SMS MRI\nreconstruction method using deep generative priors. Starting from Gaussian\nnoise, we leverage denoising diffusion probabilistic models (DDPM) to gradually\nrecover the individual slices through reverse diffusion iterations while\nimposing data consistency from the measured k-space under readout concatenation\nframework. The posterior sampling procedure is designed such that the DDPM\ntraining can be performed on single-slice images without special adjustments\nfor SMS tasks. Additionally, our method integrates a low-frequency enhancement\n(LFE) module to address a practical issue that SMS-accelerated fast spin echo\n(FSE) and echo-planar imaging (EPI) sequences cannot easily embed\nautocalibration signals. Extensive experiments demonstrate that our approach\nconsistently outperforms existing methods and generalizes well to unseen\ndatasets. The code is available at https://github.com/Solor-pikachu/ROGER after\nthe review process.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Signal Processing","Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"tP9bT3yFWi8bXQbL883gAtZukoB2f9NV6eVKbOGfa8g","pdfSize":"17435234"}
