{"id":"2407.07822","title":"Overview Results of JWST Observations of Star-Forming Clusters in the\n  Extreme Outer Galaxy","authors":"Natsuko Izumi, Michael E. Ressler, Ryan M. Lau, Patrick M. Koch, Masao\n  Saito, Naoto Kobayashi and Chikako Yasui","authorsParsed":[["Izumi","Natsuko",""],["Ressler","Michael E.",""],["Lau","Ryan M.",""],["Koch","Patrick M.",""],["Saito","Masao",""],["Kobayashi","Naoto",""],["Yasui","Chikako",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 16:47:38 GMT"}],"updateDate":"2024-07-11","timestamp":1720630058000,"abstract":"  The extreme outer Galaxy (EOG), which we define as the region of the Milky\nWay with a galactocentric radius of more than 18 kpc, provides an excellent\nopportunity to study star formation in an environment significantly different\nfrom that in the solar neighborhood because of its lower metallicity and lower\ngas density. We carried out near- and mid-infrared (NIR and MIR) imaging\nobservations toward two star-forming clusters located in the EOG using JWST\nNIRCam and MIRI with nine filters: F115W, F150W, F200W, F350W, F405N, F444W,\nF770W, F1280W, and F2100W. In this paper, we present an overview of the\nobservations, data reduction, and initial results. The NIR sensitivity is\napproximately 10--80 times better than our previous observation with the Subaru\n8.2 m telescope. Accordingly, the mass detection limit reaches to about\n0.01--0.05 $M_\\odot$, which is about 10 times better than the previous\nobservations. At MIR wavelengths, the high sensitivity and resolution data\nenable us to resolve individual young stellar objects in such a distant region\nfor the first time. The mass detection limit at MIR F770W filter reaches about\n0.1--0.3 $M_\\odot$. With these new observations, we have identified components\nof the clusters that previous surveys did not detect, including class 0\ncandidates, outflow/jet components, and distinctive nebular structures. These\ndata will enable us to investigate the properties of star formation in the EOG\nat the same depth of detail as previous observations of star formation in the\nsolar neighborhood.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}