{"id":"2407.07947","title":"Minimum-entropy constraints on galactic potentials","authors":"Leandro Beraldo e Silva and Monica Valluri and Eugene Vasiliev and\n  Kohei Hattori and Walter de Siqueira Pedra and Kathryne J. Daniel","authorsParsed":[["Silva","Leandro Beraldo e",""],["Valluri","Monica",""],["Vasiliev","Eugene",""],["Hattori","Kohei",""],["Pedra","Walter de Siqueira",""],["Daniel","Kathryne J.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-12","timestamp":1720634403000,"abstract":"  A tracer sample in a gravitational potential, starting from a generic initial\ncondition, phase-mixes towards a stationary state. This evolution is\naccompanied by an entropy increase, and the final state is characterized by a\ndistribution function (DF) that depends only on integrals of motion (Jeans\ntheorem). In terms of angle-action variables, the final state is uniform in\nangles (high entropy) and maximally clustered in actions (low entropy). We\npresent a method exploring this fact to constrain a gravitational potential\nusing a sample that is stationary in it. We estimate the entropy in the action\nspace of trial potentials and recover the true potential by minimizing this\nentropy. This method avoids assuming a known DF, and may be applicable to other\nsets of integrals. We provide expressions for the entropy of DFs depending on\nenergy, $f(E)$, energy and angular momentum, $f(E,L)$, or three actions,\n$f(\\vec{J})$, and investigate the bias and fluctuations in their estimates. We\nshow that the method correctly recovers the potential parameters for spherical\nand axisymmetric potentials. We also present a methodology to characterize the\nposterior probability distribution of the parameters with an Approximate\nBayesian Computation, and indicate a pathway for application to observational\ndata. Using $N=10^4$ tracers with $20\\%$-uncertainties in the 6D coordinates,\nwe recover the flattening parameter $q$ of an axisymmetric potential with\n$\\sigma_q/q\\sim 10\\%$.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"I_rpR--tiWJX9Cpg_S8llY4hL_rRLTERo2IxK7ojHPU","pdfSize":"2320581","objectId":"0x741c14b2c9d4b725f6121aef2fa80bfb72061e7953f0bf30274831e8e9a67109","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
