{"id":"2407.14933","title":"Consent in Crisis: The Rapid Decline of the AI Data Commons","authors":"Shayne Longpre, Robert Mahari, Ariel Lee, Campbell Lund, Hamidah\n  Oderinwale, William Brannon, Nayan Saxena, Naana Obeng-Marnu, Tobin South,\n  Cole Hunter, Kevin Klyman, Christopher Klamm, Hailey Schoelkopf, Nikhil\n  Singh, Manuel Cherep, Ahmad Anis, An Dinh, Caroline Chitongo, Da Yin, Damien\n  Sileo, Deividas Mataciunas, Diganta Misra, Emad Alghamdi, Enrico Shippole,\n  Jianguo Zhang, Joanna Materzynska, Kun Qian, Kush Tiwary, Lester Miranda,\n  Manan Dey, Minnie Liang, Mohammed Hamdy, Niklas Muennighoff, Seonghyeon Ye,\n  Seungone Kim, Shrestha Mohanty, Vipul Gupta, Vivek Sharma, Vu Minh Chien,\n  Xuhui Zhou, Yizhi Li, Caiming Xiong, Luis Villa, Stella Biderman, Hanlin Li,\n  Daphne Ippolito, Sara Hooker, Jad Kabbara, Sandy Pentland","authorsParsed":[["Longpre","Shayne",""],["Mahari","Robert",""],["Lee","Ariel",""],["Lund","Campbell",""],["Oderinwale","Hamidah",""],["Brannon","William",""],["Saxena","Nayan",""],["Obeng-Marnu","Naana",""],["South","Tobin",""],["Hunter","Cole",""],["Klyman","Kevin",""],["Klamm","Christopher",""],["Schoelkopf","Hailey",""],["Singh","Nikhil",""],["Cherep","Manuel",""],["Anis","Ahmad",""],["Dinh","An",""],["Chitongo","Caroline",""],["Yin","Da",""],["Sileo","Damien",""],["Mataciunas","Deividas",""],["Misra","Diganta",""],["Alghamdi","Emad",""],["Shippole","Enrico",""],["Zhang","Jianguo",""],["Materzynska","Joanna",""],["Qian","Kun",""],["Tiwary","Kush",""],["Miranda","Lester",""],["Dey","Manan",""],["Liang","Minnie",""],["Hamdy","Mohammed",""],["Muennighoff","Niklas",""],["Ye","Seonghyeon",""],["Kim","Seungone",""],["Mohanty","Shrestha",""],["Gupta","Vipul",""],["Sharma","Vivek",""],["Chien","Vu Minh",""],["Zhou","Xuhui",""],["Li","Yizhi",""],["Xiong","Caiming",""],["Villa","Luis",""],["Biderman","Stella",""],["Li","Hanlin",""],["Ippolito","Daphne",""],["Hooker","Sara",""],["Kabbara","Jad",""],["Pentland","Sandy",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 16:50:18 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 16:52:51 GMT"}],"updateDate":"2024-07-25","timestamp":1721494218000,"abstract":"  General-purpose artificial intelligence (AI) systems are built on massive\nswathes of public web data, assembled into corpora such as C4, RefinedWeb, and\nDolma. To our knowledge, we conduct the first, large-scale, longitudinal audit\nof the consent protocols for the web domains underlying AI training corpora.\nOur audit of 14,000 web domains provides an expansive view of crawlable web\ndata and how codified data use preferences are changing over time. We observe a\nproliferation of AI-specific clauses to limit use, acute differences in\nrestrictions on AI developers, as well as general inconsistencies between\nwebsites' expressed intentions in their Terms of Service and their robots.txt.\nWe diagnose these as symptoms of ineffective web protocols, not designed to\ncope with the widespread re-purposing of the internet for AI. Our longitudinal\nanalyses show that in a single year (2023-2024) there has been a rapid\ncrescendo of data restrictions from web sources, rendering ~5%+ of all tokens\nin C4, or 28%+ of the most actively maintained, critical sources in C4, fully\nrestricted from use. For Terms of Service crawling restrictions, a full 45% of\nC4 is now restricted. If respected or enforced, these restrictions are rapidly\nbiasing the diversity, freshness, and scaling laws for general-purpose AI\nsystems. We hope to illustrate the emerging crises in data consent, for both\ndevelopers and creators. The foreclosure of much of the open web will impact\nnot only commercial AI, but also non-commercial AI and academic research.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}