{"id":"2407.10680","title":"Friedkin-Johnsen Model for Opinion Dynamics on Signed Graphs","authors":"Xiaotian Zhou, Haoxin Sun, Wanyue Xu, Wei Li, and Zhongzhi Zhang","authorsParsed":[["Zhou","Xiaotian",""],["Sun","Haoxin",""],["Xu","Wanyue",""],["Li","Wei",""],["Zhang","Zhongzhi",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 12:55:44 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 11:42:24 GMT"}],"updateDate":"2024-07-18","timestamp":1721048144000,"abstract":"  A signed graph offers richer information than an unsigned graph, since it\ndescribes both collaborative and competitive relationships in social networks.\nIn this paper, we study opinion dynamics on a signed graph, based on the\nFriedkin-Johnsen model. We first interpret the equilibrium opinion in terms of\na defined random walk on an augmented signed graph, by representing the\nequilibrium opinion of every node as a combination of all nodes' internal\nopinions, with the coefficient of the internal opinion for each node being the\ndifference of two absorbing probabilities. We then quantify some relevant\nsocial phenomena and express them in terms of the $\\ell_2$ norms of vectors. We\nalso design a nearly-linear time signed Laplacian solver for assessing these\nquantities, by establishing a connection between the absorbing probability of\nrandom walks on a signed graph and that on an associated unsigned graph. We\nfurther study the opinion optimization problem by changing the initial opinions\nof a fixed number of nodes, which can be optimally solved in cubic time. We\nprovide a nearly-linear time algorithm with error guarantee to approximately\nsolve the problem. Finally, we execute extensive experiments on sixteen\nreal-life signed networks, which show that both of our algorithms are effective\nand efficient, and are scalable to massive graphs with over 20 million nodes.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}