{"id":"2407.16533","title":"HAPFI: History-Aware Planning based on Fused Information","authors":"Sujin Jeon, Suyeon Shin, Byoung-Tak Zhang","authorsParsed":[["Jeon","Sujin",""],["Shin","Suyeon",""],["Zhang","Byoung-Tak",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:46:07 GMT"}],"updateDate":"2024-07-24","timestamp":1721745967000,"abstract":"  Embodied Instruction Following (EIF) is a task of planning a long sequence of\nsub-goals given high-level natural language instructions, such as \"Rinse a\nslice of lettuce and place on the white table next to the fork\". To\nsuccessfully execute these long-term horizon tasks, we argue that an agent must\nconsider its past, i.e., historical data, when making decisions in each step.\nNevertheless, recent approaches in EIF often neglects the knowledge from\nhistorical data and also do not effectively utilize information across the\nmodalities. To this end, we propose History-Aware Planning based on Fused\nInformation (HAPFI), effectively leveraging the historical data from diverse\nmodalities that agents collect while interacting with the environment.\nSpecifically, HAPFI integrates multiple modalities, including historical RGB\nobservations, bounding boxes, sub-goals, and high-level instructions, by\neffectively fusing modalities via our Mutually Attentive Fusion method. Through\nexperiments with diverse comparisons, we show that an agent utilizing\nhistorical multi-modal information surpasses all the compared methods that\nneglect the historical data in terms of action planning capability, enabling\nthe generation of well-informed action plans for the next step. Moreover, we\nprovided qualitative evidence highlighting the significance of leveraging\nhistorical multi-modal data, particularly in scenarios where the agent\nencounters intermediate failures, showcasing its robust re-planning\ncapabilities.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}