{"id":"2407.16875","title":"PathwayBench: Assessing Routability of Pedestrian Pathway Networks\n  Inferred from Multi-City Imagery","authors":"Yuxiang Zhang, Bill Howe, Sachin Mehta, Nicholas-J Bolten, Anat Caspi","authorsParsed":[["Zhang","Yuxiang",""],["Howe","Bill",""],["Mehta","Sachin",""],["Bolten","Nicholas-J",""],["Caspi","Anat",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 22:47:32 GMT"}],"updateDate":"2024-07-25","timestamp":1721774852000,"abstract":"  Applications to support pedestrian mobility in urban areas require a\ncomplete, and routable graph representation of the built environment. Globally\navailable information, including aerial imagery provides a scalable source for\nconstructing these path networks, but the associated learning problem is\nchallenging: Relative to road network pathways, pedestrian network pathways are\nnarrower, more frequently disconnected, often visually and materially variable\nin smaller areas, and their boundaries are broken up by driveway incursions,\nalleyways, marked or unmarked crossings through roadways. Existing algorithms\nto extract pedestrian pathway network graphs are inconsistently evaluated and\ntend to ignore routability, making it difficult to assess utility for mobility\napplications: Even if all path segments are available, discontinuities could\ndramatically and arbitrarily shift the overall path taken by a pedestrian. In\nthis paper, we describe a first standard benchmark for the pedestrian pathway\ngraph extraction problem, comprising the largest available dataset equipped\nwith manually vetted ground truth annotations (covering $3,000 km^2$ land area\nin regions from 8 cities), and a family of evaluation metrics centering\nroutability and downstream utility. By partitioning the data into polygons at\nthe scale of individual intersections, we compute local routability as an\nefficient proxy for global routability. We consider multiple measures of\npolygon-level routability and compare predicted measures with ground truth to\nconstruct evaluation metrics. Using these metrics, we show that this benchmark\ncan surface strengths and weaknesses of existing methods that are hidden by\nsimple edge-counting metrics over single-region datasets used in prior work,\nrepresenting a challenging, high-impact problem in computer vision and machine\nlearning.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}