{"id":"2407.19467","title":"Enhancing Taobao Display Advertising with Multimodal Representations:\n  Challenges, Approaches and Insights","authors":"Xiang-Rong Sheng, Feifan Yang, Litong Gong, Biao Wang, Zhangming Chan,\n  Yujing Zhang, Yueyao Cheng, Yong-Nan Zhu, Tiezheng Ge, Han Zhu, Yuning Jiang,\n  Jian Xu, Bo Zheng","authorsParsed":[["Sheng","Xiang-Rong",""],["Yang","Feifan",""],["Gong","Litong",""],["Wang","Biao",""],["Chan","Zhangming",""],["Zhang","Yujing",""],["Cheng","Yueyao",""],["Zhu","Yong-Nan",""],["Ge","Tiezheng",""],["Zhu","Han",""],["Jiang","Yuning",""],["Xu","Jian",""],["Zheng","Bo",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 11:36:47 GMT"}],"updateDate":"2024-07-30","timestamp":1722166607000,"abstract":"  Despite the recognized potential of multimodal data to improve model\naccuracy, many large-scale industrial recommendation systems, including Taobao\ndisplay advertising system, predominantly depend on sparse ID features in their\nmodels. In this work, we explore approaches to leverage multimodal data to\nenhance the recommendation accuracy. We start from identifying the key\nchallenges in adopting multimodal data in a manner that is both effective and\ncost-efficient for industrial systems. To address these challenges, we\nintroduce a two-phase framework, including: 1) the pre-training of multimodal\nrepresentations to capture semantic similarity, and 2) the integration of these\nrepresentations with existing ID-based models. Furthermore, we detail the\narchitecture of our production system, which is designed to facilitate the\ndeployment of multimodal representations. Since the integration of multimodal\nrepresentations in mid-2023, we have observed significant performance\nimprovements in Taobao display advertising system. We believe that the insights\nwe have gathered will serve as a valuable resource for practitioners seeking to\nleverage multimodal data in their systems.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}