{"id":"2407.13468","title":"A simple approach to rotationally invariant machine learning of avector\n  quantity","authors":"Jakub Martinka, Marek Pederzoli, Mario Barbatti, Pavlo O. Dral and\n  Ji\\v{r}\\'i Pittner","authorsParsed":[["Martinka","Jakub",""],["Pederzoli","Marek",""],["Barbatti","Mario",""],["Dral","Pavlo O.",""],["Pittner","Jiří",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 12:42:08 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 13:49:00 GMT"}],"updateDate":"2024-07-24","timestamp":1721306528000,"abstract":"  Unlike with the energy, which is a scalar property, machine learning (ML)\npredictions of vector or tensor properties poses the additional challenge of\nachieving proper invariance (covariance) with respect to molecular rotation. If\nthe properties cannot be obtained by differentiation, other appropriate methods\nshould be applied to retain the covariance. There have been several approaches\nsuggested to properly treat this issue. For nonadiabatic couplings and\npolarizabilities, for example, it was possible to construct virtual quantities\nfrom which the above tensorial properties are obtained by differentiation and\nthus guarantee the covariance. Here we propose a simpler alternative technique,\nwhich does not require construction of auxiliary properties or application of\nspecial equivariant ML techniques. We suggest a three-step approach, using the\nmolecular tensor of inertia. In the first step, the molecule is rotated using\nthe eigenvectors of this tensor to its principal axes. In the second step, the\nML procedure predicts the vector property relative to this orientation, based\non a training set where all vector properties were in this same coordinate\nsystem. As third step, it remains to transform the ML estimate of the vector\nproperty back to the original orientation. This rotate-predict-rotate (RPR)\nprocedure should thus guarantee proper covariance of a vector property and is\ntrivially extensible also to tensors such as polarizability. The PRP procedure\nhas an advantage that the accurate models can be trained very fast for\nthousands of molecular configurations which might be beneficial where many\ntrainings are required (e.g., in active learning). We have implemented the RPR\ntechnique, using the MLatom and Newton-X programs for ML and MD and performed\nits assessment on the dipole moment along MD trajectories of\n1,2-dichloroethane.\n","subjects":["Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}