{"id":"2407.19097","title":"NARVis: Neural Accelerated Rendering for Real-Time Scientific Point\n  Cloud Visualization","authors":"Srinidhi Hegde, Kaur Kullman, Thomas Grubb, Leslie Lait, Stephen\n  Guimond, Matthias Zwicker","authorsParsed":[["Hegde","Srinidhi",""],["Kullman","Kaur",""],["Grubb","Thomas",""],["Lait","Leslie",""],["Guimond","Stephen",""],["Zwicker","Matthias",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 21:21:13 GMT"}],"updateDate":"2024-07-30","timestamp":1722028873000,"abstract":"  Exploring scientific datasets with billions of samples in real-time\nvisualization presents a challenge - balancing high-fidelity rendering with\nspeed. This work introduces a novel renderer - Neural Accelerated Renderer\n(NAR), that uses the neural deferred rendering framework to visualize\nlarge-scale scientific point cloud data. NAR augments a real-time point cloud\nrendering pipeline with high-quality neural post-processing, making the\napproach ideal for interactive visualization at scale. Specifically, we train a\nneural network to learn the point cloud geometry from a high-performance\nmulti-stream rasterizer and capture the desired postprocessing effects from a\nconventional high-quality renderer. We demonstrate the effectiveness of NAR by\nvisualizing complex multidimensional Lagrangian flow fields and photometric\nscans of a large terrain and compare the renderings against the\nstate-of-the-art high-quality renderers. Through extensive evaluation, we\ndemonstrate that NAR prioritizes speed and scalability while retaining high\nvisual fidelity. We achieve competitive frame rates of $>$ 126 fps for\ninteractive rendering of $>$ 350M points (i.e., an effective throughput of $>$\n44 billion points per second) using $\\sim$12 GB of memory on RTX 2080 Ti GPU.\nFurthermore, we show that NAR is generalizable across different point clouds\nwith similar visualization needs and the desired post-processing effects could\nbe obtained with substantial high quality even at lower resolutions of the\noriginal point cloud, further reducing the memory requirements.\n","subjects":["Computing Research Repository/Graphics","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"y5cdZm44bSZL2RJcl3C8Ly8MULXL8Eo1Jz-B0pprF6U","pdfSize":"36121438","objectId":"0x8decf04b08141825c471578cf530884f451cab481fd7a9d02d644ff71e357e24","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
