{"id":"2407.04735","title":"Loop Quantum Gravity and CMB Anisotropy","authors":"S. Davood Sadatian, Amir Sabouri, Zahra Davari","authorsParsed":[["Sadatian","S. Davood",""],["Sabouri","Amir",""],["Davari","Zahra",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 10:34:49 GMT"}],"updateDate":"2024-07-09","timestamp":1719830089000,"abstract":"  Recent satellite observations have revealed significant anisotropy in the\ncosmic microwave background (CMB) radiation, a phenomenon that had previously\nbeen detected but received limited attention due to its subtlety. With the\nadvent of more precise measurements from satellites, the extent of this\nanisotropy has become increasingly apparent. This paper examines the CMB\nradiation by reviewing past research on the causes of CMB anisotropy and\npresents a new model to explain the observed temperature anisotropy and the\nanisotropy in the correlation function between temperature and E-mode\npolarization in the CMB radiation. The proposed model is based on a\nmodified-generalized Compton scattering approach incorporating Loop Quantum\nGravity (LQG). We begin by describing the generalized Compton scattering and\nthen discuss the CMB radiation in the context of processes occurring at the\nlast scattering surface. Our findings are derived from the latest observational\ndata from the Planck satellite (2018). In our model, besides the parameters\navailable in the Planck data for the standard model ($\\Lambda$CDM), we\nintroduce two novel parameters: $\\delta_{L}$, the density of cosmic electrons,\nand $M^2$, a parameter related to the modified-generalized Compton scattering\neffects. The results indicate that, based on the 2018 Planck data, small values\nwere obtained for $\\delta_{L}$ and $M^{2}$, $\\delta_{L}=1.63\\pm0.08(10^{-13})$\nand $M^2=2.28\\pm0.34(10^{-4})$), showing no significant deviation from the\nstandard model. Moreover, increasing the values of $\\delta_{L}$ and $M^{2}$\nleads to an increase in the range of fluctuations in the CMB temperature\nanisotropy power spectrum and the correlation function between temperature and\nE-mode polarization for multipoles $l<500$ until the first peak.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}