{"id":"2407.10555","title":"Encoded probabilistic imaginary-time evolution on a trapped-ion quantum\n  computer for ground and excited states of spin qubits","authors":"Hirofumi Nishi and Yuki Takei and Taichi Kosugi and Shunsuke Mieda and\n  Yutaka Natsume and Takeshi Aoyagi and Yu-ichiro Matsushita","authorsParsed":[["Nishi","Hirofumi",""],["Takei","Yuki",""],["Kosugi","Taichi",""],["Mieda","Shunsuke",""],["Natsume","Yutaka",""],["Aoyagi","Takeshi",""],["Matsushita","Yu-ichiro",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 09:07:54 GMT"}],"updateDate":"2024-07-16","timestamp":1721034474000,"abstract":"  In this study, we employed a quantum computer to solve a low-energy effective\nHamiltonian for spin defects in diamond (so-called NV centre) and wurtzite-type\naluminium nitride, which are anticipated to be qubits. The probabilistic\nimaginary-time evolution (PITE) method, designed for use in a fault-tolerant\nquantum computer (FTQC) era, was employed to calculate the ground and excited\nstates of the spin singlet state, as represented by the effective Hamiltonian.\nIt is difficult to compute the spin singlet state correctly using density\nfunctional theory (DFT), which should be described by multiple Slater\ndeterminants. To mitigate the effects of quantum errors inherent in current\nquantum computers, we implemented a $[[ n+2,n,2 ]]$ quantum error detection\n(QED) code called the Iceberg code. Despite the inevitable destruction of the\nencoded state resulting from the measurement of the ancilla qubit at each PITE\nstep, we were able to successfully re-encode and recover the logical success\nstate. In the implementation of the PITE, it was observed that the effective\nHamiltonian comprises large components of the diagonal part and a relatively\nsmall non-diagonal part, which is frequently the case with quantum chemistry\ncalculations. An efficient implementation of Hamiltonian simulations, in which\nthe diagonal components dominate, was developed on a quantum computer based on\nthe second-order Trotter-Suzuki decomposition. This is the first instance of an\nencoded PITE circuit being executed on a trapped-ion quantum computer. Our\nresults demonstrate that QED effectively reduces quantum errors and that we\nsuccessfully obtained both the ground and excited states of the spin singlet\nstate. Our demonstration clearly manifests that Zr$_{\\rm Al}$V$_{\\rm N}$,\nTi$_{\\rm Al}$V$_{\\rm N}$, and Hf$_{\\rm Al}$V$_{\\rm N}$ defects have a high\npotential as spin qubits for quantum sensors.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}