{"id":"2407.11806","title":"MaskedHLS: Domain-Specific High-Level Synthesis of Masked Cryptographic\n  Designs","authors":"Nilotpola Sarma, Anuj Singh Thakur, and Chandan Karfa","authorsParsed":[["Sarma","Nilotpola",""],["Thakur","Anuj Singh",""],["Karfa","Chandan",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:57:15 GMT"}],"updateDate":"2024-07-17","timestamp":1721141835000,"abstract":"  The design and synthesis of masked cryptographic hardware implementations\nthat are secure against power side-channel attacks (PSCAs) in the presence of\nglitches is a challenging task. High-Level Synthesis (HLS) is a promising\ntechnique for generating masked hardware directly from masked software,\noffering opportunities for design space exploration. However, conventional HLS\ntools make modifications that alter the guarantee against PSCA security via\nmasking, resulting in an insecure RTL. Moreover, existing HLS tools can't place\nregisters at designated places and balance parallel paths in a cryptographic\ndesign which is needed to stop glitch propagation. This paper introduces a\ndomain-specific HLS approach tailored to obtain a PSCA secure masked hardware\nimplementation directly from a masked software implementation. It places the\nregisters at specific locations required by the glitch-robust masking gadgets,\nresulting in a secure RTL. Moreover, our tool automatically balances parallel\npaths and facilitates a reduction in latency while preserving the PSCA security\nguaranteed by masking. Experimental results with the PRESENT Cipher's S-box and\nAES Canright's S-box masked with four state-of-the-art gadgets, show that\nMaskedHLS produces RTLs with 73.9% decrease in registers and 45.7% decrease in\nlatency on an average} compared to manual register insertions. The PSCA\nsecurity of the MaskedHLS generated RTLs is also shown with TVLA test.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}