{"id":"2407.00779","title":"Towards Faster Matrix Diagonalization with Graph Isomorphism Networks\n  and the AlphaZero Framework","authors":"Geigh Zollicoffer, Kshitij Bhatta, Manish Bhattarai, Phil Romero,\n  Christian F. A. Negre, Anders M. N. Niklasson, Adetokunbo Adedoyin","authorsParsed":[["Zollicoffer","Geigh",""],["Bhatta","Kshitij",""],["Bhattarai","Manish",""],["Romero","Phil",""],["Negre","Christian F. A.",""],["Niklasson","Anders M. N.",""],["Adedoyin","Adetokunbo",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 17:45:01 GMT"}],"updateDate":"2024-07-02","timestamp":1719769501000,"abstract":"  In this paper, we introduce innovative approaches for accelerating the Jacobi\nmethod for matrix diagonalization, specifically through the formulation of\nlarge matrix diagonalization as a Semi-Markov Decision Process and small matrix\ndiagonalization as a Markov Decision Process. Furthermore, we examine the\npotential of utilizing scalable architecture between different-sized matrices.\nDuring a short training period, our method discovered a significant reduction\nin the number of steps required for diagonalization and exhibited efficient\ninference capabilities. Importantly, this approach demonstrated possible\nscalability to large-sized matrices, indicating its potential for wide-ranging\napplicability. Upon training completion, we obtain action-state probabilities\nand transition graphs, which depict transitions between different states. These\noutputs not only provide insights into the diagonalization process but also\npave the way for cost savings pertinent to large-scale matrices. The\nadvancements made in this research enhance the efficacy and scalability of\nmatrix diagonalization, pushing for new possibilities for deployment in\npractical applications in scientific and engineering domains.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}