{"id":"2407.19284","title":"Optimizing Synthetic Data for Enhanced Pancreatic Tumor Segmentation","authors":"Linkai Peng, Zheyuan Zhang, Gorkem Durak, Frank H. Miller, Alpay\n  Medetalibeyoglu, Michael B. Wallace, and Ulas Bagci","authorsParsed":[["Peng","Linkai",""],["Zhang","Zheyuan",""],["Durak","Gorkem",""],["Miller","Frank H.",""],["Medetalibeyoglu","Alpay",""],["Wallace","Michael B.",""],["Bagci","Ulas",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 15:38:07 GMT"}],"updateDate":"2024-07-30","timestamp":1722094687000,"abstract":"  Pancreatic cancer remains one of the leading causes of cancer-related\nmortality worldwide. Precise segmentation of pancreatic tumors from medical\nimages is a bottleneck for effective clinical decision-making. However,\nachieving a high accuracy is often limited by the small size and availability\nof real patient data for training deep learning models. Recent approaches have\nemployed synthetic data generation to augment training datasets. While\npromising, these methods may not yet meet the performance benchmarks required\nfor real-world clinical use. This study critically evaluates the limitations of\nexisting generative-AI based frameworks for pancreatic tumor segmentation. We\nconduct a series of experiments to investigate the impact of synthetic\n\\textit{tumor size} and \\textit{boundary definition} precision on model\nperformance. Our findings demonstrate that: (1) strategically selecting a\ncombination of synthetic tumor sizes is crucial for optimal segmentation\noutcomes, and (2) generating synthetic tumors with precise boundaries\nsignificantly improves model accuracy. These insights highlight the importance\nof utilizing refined synthetic data augmentation for enhancing the clinical\nutility of segmentation models in pancreatic cancer decision making including\ndiagnosis, prognosis, and treatment plans. Our code will be available at\nhttps://github.com/lkpengcs/SynTumorAnalyzer.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}