{"id":"2407.14591","title":"DanceQ: High-performance library for number conserving bases","authors":"Robin Sch\\\"afer and David J. Luitz","authorsParsed":[["Schäfer","Robin",""],["Luitz","David J.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-23","timestamp":1721412001000,"abstract":"  The complexity of quantum many-body problems scales exponentially with the\nsize of the system, rendering any finite size scaling analysis a formidable\nchallenge. This is particularly true for methods based on the full\nrepresentation of the wave function, where one simply accepts the enormous\nHilbert space dimensions and performs linear algebra operations, e.g., for\nfinding the ground state of the Hamiltonian. If the system satisfies an\nunderlying symmetry where an operator with degenerate spectrum commutes with\nthe Hamiltonian, it can be block-diagonalized, thus reducing the complexity at\nthe expense of additional bookkeeping. At the most basic level, required for\nKrylov space techniques (like the Lanczos algorithm) it is necessary to\nimplement a matrix-vector product of a block of the Hamiltonian with arbitrary\nblock-wavefunctions, potentially without holding the Hamiltonian block in\nmemory. An efficient implementation of this operation requires the calculation\nof the position of an arbitrary basis vector in the canonical ordering of the\nbasis of the block. We present here an elegant and powerful, multi-dimensional\napproach to this problem for the $U(1)$ symmetry appearing in problems with\nparticle number conservation. Our divide-and-conquer algorithm uses multiple\nsubsystems and hence generalizes previous approaches to make them scalable. In\naddition to the theoretical presentation of our algorithm, we provide DanceQ, a\nflexible and modern - header only - C++20 implementation to manipulate,\nenumerate, and map to its index any basis state in a given particle number\nsector as open source software under https://DanceQ.gitlab.io/danceq.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}