{"id":"2407.14758","title":"DISCO: Embodied Navigation and Interaction via Differentiable Scene\n  Semantics and Dual-level Control","authors":"Xinyu Xu, Shengcheng Luo, Yanchao Yang, Yong-Lu Li, Cewu Lu","authorsParsed":[["Xu","Xinyu",""],["Luo","Shengcheng",""],["Yang","Yanchao",""],["Li","Yong-Lu",""],["Lu","Cewu",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 05:39:28 GMT"}],"updateDate":"2024-07-23","timestamp":1721453968000,"abstract":"  Building a general-purpose intelligent home-assistant agent skilled in\ndiverse tasks by human commands is a long-term blueprint of embodied AI\nresearch, which poses requirements on task planning, environment modeling, and\nobject interaction. In this work, we study primitive mobile manipulations for\nembodied agents, i.e. how to navigate and interact based on an instructed\nverb-noun pair. We propose DISCO, which features non-trivial advancements in\ncontextualized scene modeling and efficient controls. In particular, DISCO\nincorporates differentiable scene representations of rich semantics in object\nand affordance, which is dynamically learned on the fly and facilitates\nnavigation planning. Besides, we propose dual-level coarse-to-fine action\ncontrols leveraging both global and local cues to accomplish mobile\nmanipulation tasks efficiently. DISCO easily integrates into embodied tasks\nsuch as embodied instruction following. To validate our approach, we take the\nALFRED benchmark of large-scale long-horizon vision-language navigation and\ninteraction tasks as a test bed. In extensive experiments, we make\ncomprehensive evaluations and demonstrate that DISCO outperforms the art by a\nsizable +8.6% success rate margin in unseen scenes, even without step-by-step\ninstructions. Our code is publicly released at\nhttps://github.com/AllenXuuu/DISCO.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"SXUtxupcTT4qbsTG7qmyk9ykOk_hBdHeLSa7_qCBnAA","pdfSize":"1853347"}
