{"id":"2407.03333","title":"C-ShipGen: A Conditional Guided Diffusion Model for Parametric Ship Hull\n  Design","authors":"Noah J. Bagazinski, Faez Ahmed","authorsParsed":[["Bagazinski","Noah J.",""],["Ahmed","Faez",""]],"versions":[{"version":"v1","created":"Fri, 10 May 2024 01:10:49 GMT"}],"updateDate":"2024-07-08","timestamp":1715303449000,"abstract":"  Ship design is a complex design process that may take a team of naval\narchitects many years to complete. Improving the ship design process can lead\nto significant cost savings, while still delivering high-quality designs to\ncustomers. A new technology for ship hull design is diffusion models, a type of\ngenerative artificial intelligence. Prior work with diffusion models for ship\nhull design created high-quality ship hulls with reduced drag and larger\ndisplaced volumes. However, the work could not generate hulls that meet\nspecific design constraints. This paper proposes a conditional diffusion model\nthat generates hull designs given specific constraints, such as the desired\nprincipal dimensions of the hull. In addition, this diffusion model leverages\nthe gradients from a total resistance regression model to create low-resistance\ndesigns. Five design test cases compared the diffusion model to a design\noptimization algorithm to create hull designs with low resistance. In all five\ntest cases, the diffusion model was shown to create diverse designs with a\ntotal resistance less than the optimized hull, having resistance reductions\nover 25%. The diffusion model also generated these designs without retraining.\nThis work can significantly reduce the design cycle time of ships by creating\nhigh-quality hulls that meet user requirements with a data-driven approach.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MBx1Ac-0QCDYuvVrKvbtn0BBwwqH7BTqlp4hDnEzOb0","pdfSize":"1954366"}
