{"id":"2407.16324","title":"Ultrabroadband thin-film lithium tantalate modulator for high-speed\n  communications","authors":"Chengli Wang, Dengyang Fang, Alexander Kotz, Grigory Lihachev, Mikhail\n  Churaev, Zihan Li, Adrian Schwarzenberger, Xin Ou, Christian Koos and Tobias\n  Kippenberg","authorsParsed":[["Wang","Chengli",""],["Fang","Dengyang",""],["Kotz","Alexander",""],["Lihachev","Grigory",""],["Churaev","Mikhail",""],["Li","Zihan",""],["Schwarzenberger","Adrian",""],["Ou","Xin",""],["Koos","Christian",""],["Kippenberg","Tobias",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 09:20:46 GMT"}],"updateDate":"2024-07-24","timestamp":1721726446000,"abstract":"  The continuous growth of global data traffic over the past three decades,\nalong with advances in disaggregated computing architectures, presents\nsignificant challenges for optical transceivers in communication networks and\nhigh-performance computing systems. Specifically, there is a growing need to\nsignificantly increase data rates while reducing energy consumption and cost.\nHigh-performance optical modulators based on materials such as InP, thin-film\nlithium niobate (LiNbO3), or plasmonics have been developed, with LiNbO3\nexcelling in high-speed and low-voltage modulation. Nonetheless, the widespread\nindustrial adoption of thin film LiNbO3 remains compounded by the rather high\ncost of the underlying 'on insulator' substrates -- in sharp contrast to\nsilicon photonics, which can benefit from strong synergies with high-volume\napplications in conventional microelectronics. Here, we demonstrate an\nintegrated 110 GHz modulator using thin-film lithium tantalate (LiTaO3) -- a\nmaterial platform that is already commercially used for millimeter-wave filters\nand that can hence build upon technological and economic synergies with\nexisting high-volume applications to offer scalable low-cost manufacturing. We\nshow that the LiTaO3 photonic integrated circuit based modulator can support\n176 GBd PAM8 transmission at net data rates exceeding 400 Gbit/s, while\nexhibiting a lower bias drift compared to LiNbO3. Moreover, we show that using\nsilver electrodes can reduce microwave losses compared to previously employed\ngold electrodes. Our demonstration positions LiTaO3 modulator as a novel and\nhighly promising integration platform for next-generation high-speed,\nenergy-efficient, and cost-effective transceivers.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}