{"id":"2407.06466","title":"Increased risk of type I errors for detecting heterogeneity of treatment\n  effects in cluster-randomized trials using mixed-effect models","authors":"Noorie Hyun, Abisola E. Idu, Andrea J. Cook, Jennifer F. Bobb","authorsParsed":[["Hyun","Noorie",""],["Idu","Abisola E.",""],["Cook","Andrea J.",""],["Bobb","Jennifer F.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 00:08:51 GMT"}],"updateDate":"2024-07-10","timestamp":1720483731000,"abstract":"  Evaluating heterogeneity of treatment effects (HTE) across subgroups is\ncommon in both randomized trials and observational studies. Although several\nstatistical challenges of HTE analyses including low statistical power and\nmultiple comparisons are widely acknowledged, issues arising for clustered\ndata, including cluster randomized trials (CRTs), have received less attention.\nNotably, the potential for model misspecification is increased given the\ncomplex clustering structure (e.g., due to correlation among individuals within\na subgroup and cluster), which could impact inference and type 1 errors. To\nillicit this issue, we conducted a simulation study to evaluate the performance\nof common analytic approaches for testing the presence of HTE for continuous,\nbinary, and count outcomes: generalized linear mixed models (GLMM) and\ngeneralized estimating equations (GEE) including interaction terms between\ntreatment group and subgroup. We found that standard GLMM analyses that assume\na common correlation of participants within clusters can lead to severely\nelevated type 1 error rates of up to 47.2% compared to the 5% nominal level if\nthe within-cluster correlation varies across subgroups. A flexible GLMM, which\nallows subgroup-specific within-cluster correlations, achieved the nominal type\n1 error rate, as did GEE (though rates were slightly elevated even with as many\nas 50 clusters). Applying the methods to a real-world CRT using the count\noutcome utilization of healthcare, we found a large impact of the model\nspecification on inference: the standard GLMM yielded highly significant\ninteraction by sex (P=0.01), whereas the interaction was non-statistically\nsignificant under the flexible GLMM and GEE (P=0.64 and 0.93, respectively). We\nrecommend that HTE analyses using GLMM account for within-subgroup correlation\nto avoid anti-conservative inference.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}