{"id":"2407.06897","title":"Discovery of a barium blue straggler star in M67 and sighting of its WD\n  companion*","authors":"Harshit Pal, Annapurni Subramaniam, Arumalla B. S. Reddy, Vikrant V.\n  Jadhav","authorsParsed":[["Pal","Harshit",""],["Subramaniam","Annapurni",""],["Reddy","Arumalla B. S.",""],["Jadhav","Vikrant V.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 14:30:09 GMT"}],"updateDate":"2024-07-10","timestamp":1720535409000,"abstract":"  We report the discovery of a barium blue straggler star (BSS) in M67,\nexhibiting enhancements in slow neutron-capture ($s$-) process elements.\nSpectroscopic analysis of two BSSs (WOCS\\,9005 \\& WOCS\\,1020) and 4 stars\nlocated near the main-sequence turn-off using GALAH spectra, showed that\nWOCS\\,9005 has a significantly high abundance of the s-process elements\n([Ba/Fe] = 0.75$\\pm$0.08, [Y/Fe] = 1.09$\\pm$0.07, [La/Fe] = 0.65$\\pm$0.06). The\nBSS (WOCS\\,9005) is a spectroscopic binary with a known period, eccentricity\nand a suspected white dwarf (WD) companion with a kinematic mass of 0.5\nM$_\\odot$. The first `sighting' of the WD in this barium BSS is achieved\nthrough multi-wavelength spectral energy distribution (SED) with the crucial\nfar-UV data from the UVIT/\\textit{AstroSat}. The parameters of the hot and cool\ncompanions are derived using binary fits of the SED using two combinations of\nmodels, yielding a WD with T$_{eff}$ in the range 9750--15250 K. Considering\nthe kinematic mass limit, the cooling age of the WD is estimated as $\\sim$ 60\nMyr. The observed enhancements are attributed to a mass transfer (MT) from a\ncompanion asymptotic giant branch star, now a WD. We estimate the accreted mass\nto be 0.15 M$_{\\odot}$, through wind accretion, which increased the envelope\nmass from 0.45 M$_{\\odot}$. The detection of chemical enhancement, as well as\nthe sighting of WD in this system have been possible due to the recent MT in\nthis binary, as suggested by the young WD.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}