{"id":"2407.19152","title":"IllustrisTNG in the HSC-SSP: No Shortage of Thin Disk Galaxies in TNG50","authors":"Dewang Xu, Hua Gao, Connor Bottrell, Hassen M. Yesuf, Jingjing Shi","authorsParsed":[["Xu","Dewang",""],["Gao","Hua",""],["Bottrell","Connor",""],["Yesuf","Hassen M.",""],["Shi","Jingjing",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 02:47:09 GMT"}],"updateDate":"2024-07-30","timestamp":1722048429000,"abstract":"  We perform a thorough analysis of the projected shapes of nearby galaxies in\nboth observations and cosmological simulations. We implement a forward-modeling\napproach to overcome the limitations in previous studies which hinder accurate\ncomparisons between observations and simulations. We measure axis ratios of\n$z=0$ (snapshot 99) TNG50 galaxies from their synthetic Hyper Suprime-Cam\nSubaru Strategic Program (HSC-SSP) images and compare them with those obtained\nfrom real HSC-SSP images of a matched galaxy sample. Remarkably, the comparison\nshows excellent agreement between observations and the TNG50 simulation.\nSpecifically, for galaxies with stellar masses $10\\leq \\log\n(M_{\\star}/M_{\\odot}) \\leq 11.5$, we find $\\lesssim 0.1\\sigma$ tensions between\nthe observation and the simulation, whereas previous studies found $\\gtrsim\n10\\sigma$ tensions due to lack of thin galaxies in simulations. We reveal that\nlow-mass galaxies ($M_{\\star}\\lesssim 10^{9.5}$) in TNG50 are thicker than\ntheir observed counterparts in HSC-SSP and attribute this to the spurious\ndynamical heating effects that artificially puff up galaxies. We also find that\ndespite the overall broad agreement, TNG50 galaxies are more concentrated than\nthe HSC-SSP ones at the low- and high-mass end of the stellar mass range of\n$9.0\\leq \\log (M_{\\star}/M_{\\odot}) \\leq 11.2$ and are less concentrated at\nintermediate stellar masses. But we argue that the higher concentrations of the\nlow-mass TNG50 galaxies are not likely the cause of their thicker/rounder\nappearances. Our study underscores the critical importance of conducting mock\nobservations of simulations and applying consistent measurement methodologies\nto facilitate proper comparison with observations.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vonuHjgwePFrOO9IQnQR9J6HKmS1W5-bNPi8iN3elVg","pdfSize":"1327220"}
