{"id":"2407.06707","title":"Peering above the clouds of the warm Neptune GJ 436b with CRIRES+","authors":"Natalie Grasser, Ignas A. G. Snellen, Rico Landman, Dar\\'io Gonz\\'alez\n  Picos, Siddharth Gandhi","authorsParsed":[["Grasser","Natalie",""],["Snellen","Ignas A. G.",""],["Landman","Rico",""],["Picos","Darío González",""],["Gandhi","Siddharth",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 09:34:53 GMT"}],"updateDate":"2024-08-21","timestamp":1720517693000,"abstract":"  Exoplanets with masses between Earth and Neptune are amongst the most\ncommonly observed, yet their properties are poorly constrained. Their\ntransmission spectra are often featureless, which indicate either high-altitude\nclouds or a high atmospheric metallicity. The archetypical warm Neptune GJ 436b\nis such a planet showing a flat transmission spectrum in observations with the\nHubble Space Telescope (HST). Ground-based high-resolution spectroscopy (HRS)\neffectively probes exoplanet atmospheres at higher altitudes and can therefore\nbe more sensitive to absorption coming from above potential cloud decks. In\nthis paper we aim to investigate this for the exoplanet GJ 436b. We present new\nCRIRES+ HRS transit data of GJ 436b. Three transits were observed, but since\ntwo were during bad weather conditions, only one transit was analyzed. The\nradiative transfer code petitRADTRANS was used to create atmospheric models for\ncross-correlation and signal-injection purposes, including absorption from\nH$_2$O, CH$_4$, and CO. No transmission signals were detected, but atmospheric\nconstraints can be derived. Injection of artificial transmission signals\nindicate that if GJ 436b would have a cloud deck at pressures P>10 mbar and a\n<300$\\times$ solar metallicity, these CRIRES+ observations should have resulted\nin a detection. We estimate that the constraints presented here from one\nground-based HRS transit are slightly better than those obtained with four HST\ntransits. Combining HRS data from multiple transits is an interesting avenue\nfor future studies of exoplanets with high-altitude clouds.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MlPy04VYNKd5_8TVAFgVdpO3hQitFbuRqeUBRKKrRtc","pdfSize":"1379562"}
