{"id":"2407.04224","title":"PA-LOCO: Learning Perturbation-Adaptive Locomotion for Quadruped Robots","authors":"Zhiyuan Xiao, Xinyu Zhang, Xiang Zhou, and Qingrui Zhang","authorsParsed":[["Xiao","Zhiyuan",""],["Zhang","Xinyu",""],["Zhou","Xiang",""],["Zhang","Qingrui",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 02:37:32 GMT"}],"updateDate":"2024-07-08","timestamp":1720147052000,"abstract":"  Numerous locomotion controllers have been designed based on Reinforcement\nLearning (RL) to facilitate blind quadrupedal locomotion traversing challenging\nterrains. Nevertheless, locomotion control is still a challenging task for\nquadruped robots traversing diverse terrains amidst unforeseen disturbances.\nRecently, privileged learning has been employed to learn reliable and robust\nquadrupedal locomotion over various terrains based on a teacher-student\narchitecture. However, its one-encoder structure is not adequate in addressing\nexternal force perturbations. The student policy would experience inevitable\nperformance degradation due to the feature embedding discrepancy between the\nfeature encoder of the teacher policy and the one of the student policy. Hence,\nthis paper presents a privileged learning framework with multiple feature\nencoders and a residual policy network for robust and reliable quadruped\nlocomotion subject to various external perturbations. The multi-encoder\nstructure can decouple latent features from different privileged information,\nultimately leading to enhanced performance of the learned policy in terms of\nrobustness, stability, and reliability. The efficiency of the proposed feature\nencoding module is analyzed in depth using extensive simulation data. The\nintroduction of the residual policy network helps mitigate the performance\ndegradation experienced by the student policy that attempts to clone the\nbehaviors of a teacher policy. The proposed framework is evaluated on a Unitree\nGO1 robot, showcasing its performance enhancement over the state-of-the-art\nprivileged learning algorithm through extensive experiments conducted on\ndiverse terrains. Ablation studies are conducted to illustrate the efficiency\nof the residual policy network.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}