{"id":"2407.14638","title":"Metasurface Energy Harvesters: State-of-the-Art Designs and Their\n  Potential for Energy Sustainable Reconfigurable Intelligent Surfaces","authors":"Alireza Ghaneizadeh, Panagiotis Gavriilidis, Mojtaba Joodaki, George\n  C. Alexandropoulos","authorsParsed":[["Ghaneizadeh","Alireza",""],["Gavriilidis","Panagiotis",""],["Joodaki","Mojtaba",""],["Alexandropoulos","George C.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 19:17:26 GMT"}],"updateDate":"2024-07-23","timestamp":1721416646000,"abstract":"  Metasurface Energy Harvesters (MEHs) have emerged as a prominent enabler of\nhighly efficient Radio Frequency (RF) energy harvesters. This survey delves\ninto the fundamentals of the MEH technology, providing a comprehensive overview\nof their working principle, unit cell designs and prototypes over various\nfrequency bands, as well as state-of-the art modes of operation. Inspired by\nthe recent academic and industrial interest on Reconfigurable Intelligent\nSurfaces (RISs)for the upcoming sixth-Generation (6G) of wireless networks, we\nstudy the interplay between this technology and MEHs aiming for energy\nsustainable RISs power by metasurface-based RF energy harvesting. We present a\nnovel hybrid unit cell design capable of simultaneous energy harvesting and\n1-bit tunable reflection whose dual-functional response is validated via\nfull-wave simulations. Then, we conduct a comparative collection of real-world\nmeasurements for ambient RF power levels and power consumption budgets of\nreflective RISs to unveil the potential for a self-sustainable RIS via ambient\nRF energy harvesting. The paper is concluded with an elaborative discussion on\nopen design challenges and future research directions for MEHs and energy\nsustainable hybrid RISs.\n","subjects":["Computing Research Repository/Emerging Technologies","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Signal Processing","Electrical Engineering and Systems Science/Systems and Control","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}