{"id":"2407.16873","title":"Fostering Microservice Maintainability Assurance through a Comprehensive\n  Framework","authors":"Amr S. Abdelfattah","authorsParsed":[["Abdelfattah","Amr S.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 22:45:29 GMT"}],"updateDate":"2024-07-25","timestamp":1721774729000,"abstract":"  Cloud-native systems represent a significant leap in constructing scalable,\nlarge systems, employing microservice architecture as a key element in\ndeveloping distributed systems through self-contained components. However, the\ndecentralized nature of these systems, characterized by separate source codes\nand deployments, introduces challenges in assessing system qualities.\nMicroservice-based systems, with their inherent complexity and the need for\ncoordinated changes across multiple microservices, lack established best\npractices and guidelines, leading to difficulties in constructing and\ncomprehending the holistic system view. This gap can result in performance\ndegradation and increased maintenance costs, potentially requiring system\nrefactoring. The main goal of this project is to offer maintainability\nassurance for microservice practitioners. It introduces an automated assessment\nframework tailored to microservice architecture, enhancing practitioners'\nunderstanding and analytical capabilities of the multiple system perspectives.\nThe framework addresses various granularity levels, from artifacts to\nconstructing holistic views of static and dynamic system characteristics. It\nintegrates diverse perspectives, encompassing human-centric elements like\narchitectural visualization and automated evaluations, including coupling\ndetection, testing coverage measurement, and semantic clone identification.\nValidation studies involving practitioners demonstrate the framework's\neffectiveness in addressing diverse quality and maintainability issues,\nrevealing insights not apparent when analyzing individual microservices in\nisolation.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hRyZdIKKpyKhdHQj7hFUnWAl6mRYv0ZlAec1-zddT-c","pdfSize":"1541173"}
