{"id":"2407.13669","title":"Projection-based model-order reduction for unstructured meshes with\n  graph autoencoders","authors":"Liam K. Magargal, Parisa Khodabakhshi, Steven N. Rodriguez, Justin W.\n  Jaworski, John G. Michopoulos","authorsParsed":[["Magargal","Liam K.",""],["Khodabakhshi","Parisa",""],["Rodriguez","Steven N.",""],["Jaworski","Justin W.",""],["Michopoulos","John G.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:44:16 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 14:38:53 GMT"}],"updateDate":"2024-07-22","timestamp":1721321056000,"abstract":"  This paper presents a graph autoencoder architecture capable of performing\nprojection-based model-order reduction (PMOR) on advection-dominated flows\nmodeled by unstructured meshes. The autoencoder is coupled with the time\nintegration scheme from a traditional deep least-squares Petrov-Galerkin\nprojection and provides the first deployment of a graph autoencoder into a PMOR\nframework. The presented graph autoencoder is constructed with a two-part\nprocess that consists of (1) generating a hierarchy of reduced graphs to\nemulate the compressive abilities of convolutional neural networks (CNNs) and\n(2) training a message passing operation at each step in the hierarchy of\nreduced graphs to emulate the filtering process of a CNN. The resulting\nframework provides improved flexibility over traditional CNN-based autoencoders\nbecause it is extendable to unstructured meshes. To highlight the capabilities\nof the proposed framework, which is named geometric deep least-squares\nPetrov-Galerkin (GD-LSPG), we benchmark the method on a one-dimensional\nBurgers' equation problem with a structured mesh and demonstrate the\nflexibility of GD-LSPG by deploying it to a two-dimensional Euler equations\nmodel that uses an unstructured mesh. The proposed framework provides\nconsiderable improvement in accuracy for very low-dimensional latent spaces in\ncomparison with traditional affine projections.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}