{"id":"2407.04722","title":"A GPT-based Code Review System for Programming Language Learning","authors":"Lee Dong-Kyu","authorsParsed":[["Dong-Kyu","Lee",""]],"versions":[{"version":"v1","created":"Fri, 21 Jun 2024 12:16:01 GMT"}],"updateDate":"2024-07-09","timestamp":1718972161000,"abstract":"  The increasing demand for programming language education and growing class\nsizes require immediate and personalized feedback. However, traditional code\nreview methods have limitations in providing this level of feedback. As the\ncapabilities of Large Language Models (LLMs) like GPT for generating accurate\nsolutions and timely code reviews are verified, this research proposes a system\nthat employs GPT-4 to offer learner-friendly code reviews and minimize the risk\nof AI-assist cheating.\n  To provide learner-friendly code reviews, a dataset was collected from an\nonline judge system, and this dataset was utilized to develop and enhance the\nsystem's prompts. In addition, to minimize AI-assist cheating, the system flow\nwas designed to provide code reviews only for code submitted by a learner, and\na feature that highlights code lines to fix was added. After the initial system\nwas deployed on the web, software education experts conducted usability test.\nBased on the results, improvement strategies were developed to improve code\nreview and code correctness check module, thereby enhancing the system.\n  The improved system underwent evaluation by software education experts based\non four criteria: strict code correctness checks, response time, lower API call\ncosts, and the quality of code reviews. The results demonstrated a performance\nto accurately identify error types, shorten response times, lower API call\ncosts, and maintain high-quality code reviews without major issues. Feedback\nfrom participants affirmed the tool's suitability for teaching programming to\nprimary and secondary school students. Given these benefits, the system is\nanticipated to be a efficient learning tool in programming language learning\nfor educational settings.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"BuX5UNR6mLzvidxPR9d_mPB9QaqYBdwUsh4A1c-i8Z0","pdfSize":"1564122"}
