{"id":"2407.07004","title":"Empirical analysis of Binding Precedent efficiency in the Brazilian\n  Supreme Court via Similar Case Retrieval","authors":"Rapha\\\"el Tinarrage, Henrique Ennes, Lucas E. Resck, Lucas T. Gomes,\n  Jean R. Ponciano, Jorge Poco","authorsParsed":[["Tinarrage","Raphaël",""],["Ennes","Henrique",""],["Resck","Lucas E.",""],["Gomes","Lucas T.",""],["Ponciano","Jean R.",""],["Poco","Jorge",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 16:17:16 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 18:20:45 GMT"}],"updateDate":"2024-07-25","timestamp":1720541836000,"abstract":"  Binding precedents (S\\'umulas Vinculantes) constitute a juridical instrument\nunique to the Brazilian legal system and whose objectives include the\nprotection of the Federal Supreme Court against repetitive demands. Studies of\nthe effectiveness of these instruments in decreasing the Court's exposure to\nsimilar cases, however, indicate that they tend to fail in such a direction,\nwith some of the binding precedents seemingly creating new demands. We\nempirically assess the legal impact of five binding precedents, 11, 14, 17, 26\nand 37, at the highest court level through their effects on the legal subjects\nthey address. This analysis is only possible through the comparison of the\nCourt's ruling about the precedents' themes before they are created, which\nmeans that these decisions should be detected through techniques of Similar\nCase Retrieval. The contributions of this article are therefore twofold: on the\nmathematical side, we compare the uses of different methods of Natural Language\nProcessing -- TF-IDF, LSTM, BERT, and regex -- for Similar Case Retrieval,\nwhereas on the legal side, we contrast the inefficiency of these binding\nprecedents with a set of hypotheses that may justify their repeated usage. We\nobserve that the deep learning models performed significantly worse in the\nspecific Similar Case Retrieval task and that the reasons for binding\nprecedents to fail in responding to repetitive demand are heterogeneous and\ncase-dependent, making it impossible to single out a specific cause.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}