{"id":"2407.08557","title":"Asgard/NOTT: First lab assembly and experimental results","authors":"G. Garreau, A. Bigioli, R. Laugier, B. La Torre, M-A. Martinod, K.\n  Missiaen, J. Morren, G. Raskin, M. Salman, S. Gross, M. Ireland, A. P. Jo\\'o,\n  L. Labadie, S. Madden, A. Mazzoli, G. Medgyesi, A. Sanny, A. Taras, B.\n  Vandenbussche, and D. Defr\\`ere","authorsParsed":[["Garreau","G.",""],["Bigioli","A.",""],["Laugier","R.",""],["La Torre","B.",""],["Martinod","M-A.",""],["Missiaen","K.",""],["Morren","J.",""],["Raskin","G.",""],["Salman","M.",""],["Gross","S.",""],["Ireland","M.",""],["Joó","A. P.",""],["Labadie","L.",""],["Madden","S.",""],["Mazzoli","A.",""],["Medgyesi","G.",""],["Sanny","A.",""],["Taras","A.",""],["Vandenbussche","B.",""],["Defrère","D.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:41:49 GMT"}],"updateDate":"2024-07-12","timestamp":1720708909000,"abstract":"  Asgard/NOTT is an ERC-funded project hosted at KU Leuven and is part of a new\nvisitor instrumental suite, called Asgard, under preparation for the Very Large\nTelescope Interferometer (VLTI). Leveraging nulling capabilities and the long\nVLTI baselines, it is optimized for high-contrast imaging of the snow line\nregion around young nearby main-sequence stars. This will enable the\ncharacterization of the atmosphere of young giant exoplanets and warm/hot\nexozodiacal dust with spectroscopy in the L'-band (3.5-4.0$\\mu$m). In this\nwork, we present the first lab assembly of the instrument done at KU Leuven and\nthe technical solutions to tackle the challenge of performing nulling in the\nmid-infrared despite the thermal background. The opto-mechanical design of the\nwarm optics and the injection system for the photonic chip are described. The\nalignment procedure used to assemble the system is also presented. Finally, the\nfirst experimental results, including fringes and null measurements, are given\nand confirm the adequacy of the bench to test and optimize the Asgard/NOTT\ninstrument.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}