{"id":"2407.07673","title":"Towards Adaptive Pseudo-label Learning for Semi-Supervised Temporal\n  Action Localization","authors":"Feixiang Zhou, Bryan Williams, and Hossein Rahmani","authorsParsed":[["Zhou","Feixiang",""],["Williams","Bryan",""],["Rahmani","Hossein",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 14:00:19 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 08:36:55 GMT"},{"version":"v3","created":"Wed, 24 Jul 2024 20:39:47 GMT"}],"updateDate":"2024-07-26","timestamp":1720620019000,"abstract":"  Alleviating noisy pseudo labels remains a key challenge in Semi-Supervised\nTemporal Action Localization (SS-TAL). Existing methods often filter pseudo\nlabels based on strict conditions, but they typically assess classification and\nlocalization quality separately, leading to suboptimal pseudo-label ranking and\nselection. In particular, there might be inaccurate pseudo labels within\nselected positives, alongside reliable counterparts erroneously assigned to\nnegatives. To tackle these problems, we propose a novel Adaptive Pseudo-label\nLearning (APL) framework to facilitate better pseudo-label selection.\nSpecifically, to improve the ranking quality, Adaptive Label Quality Assessment\n(ALQA) is proposed to jointly learn classification confidence and localization\nreliability, followed by dynamically selecting pseudo labels based on the joint\nscore. Additionally, we propose an Instance-level Consistency Discriminator\n(ICD) for eliminating ambiguous positives and mining potential positives\nsimultaneously based on inter-instance intrinsic consistency, thereby leading\nto a more precise selection. We further introduce a general unsupervised\nAction-aware Contrastive Pre-training (ACP) to enhance the discrimination both\nwithin actions and between actions and backgrounds, which benefits SS-TAL.\nExtensive experiments on THUMOS14 and ActivityNet v1.3 demonstrate that our\nmethod achieves state-of-the-art performance under various semi-supervised\nsettings.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}