{"id":"2407.17489","title":"Collective Attention in Human-AI Teams","authors":"Josie Zvelebilova and Saiph Savage and Christoph Riedl","authorsParsed":[["Zvelebilova","Josie",""],["Savage","Saiph",""],["Riedl","Christoph",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 13:46:00 GMT"}],"updateDate":"2024-07-26","timestamp":1720014360000,"abstract":"  How does the presence of an AI assistant affect the collective attention of a\nteam? We study 20 human teams of 3-4 individuals paired with one voice-only AI\nassistant during a challenging puzzle task. Teams are randomly assigned to an\nAI assistant with a human- or robotic-sounding voice that provides either\nhelpful or misleading information about the task. Treating each individual AI\ninterjection as a treatment intervention, we identify the causal effects of the\nAI on dynamic group processes involving language use. Our findings demonstrate\nthat the AI significantly affects what teams discuss, how they discuss it, and\nthe alignment of their mental models. Teams adopt AI-introduced language for\nboth terms directly related to the task and for peripheral terms, even when\nthey (a) recognize the unhelpful nature of the AI, (b) do not consider the AI a\ngenuine team member, and (c) do not trust the AI. The process of language\nadaptation appears to be automatic, despite doubts about the AI's competence.\nThe presence of an AI assistant significantly impacts team collective attention\nby modulating various aspects of shared cognition. This study contributes to\nhuman-AI teaming research by highlighting collective attention as a central\nmechanism through which AI systems in team settings influence team performance.\nUnderstanding this mechanism will help CSCW researchers design AI systems that\nenhance team collective intelligence by optimizing collective attention.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/"}