{"id":"2407.01076","title":"Orbital origin of magnetic moment enhancement induced by charge density\n  wave in kagome FeGe","authors":"Shulun Han, Linyang Li, Chi Sin Tang, Qi Wang, Lingfeng Zhang,\n  Caozheng Diao, Mingwen Zhao, Shuo Sun, Lijun Tian, Mark B. H. Breese,\n  Chuanbing Cai, Milorad V. Milosevic, Yanpeng Qi, Andrew T. S. Wee, Xinmao Yin","authorsParsed":[["Han","Shulun",""],["Li","Linyang",""],["Tang","Chi Sin",""],["Wang","Qi",""],["Zhang","Lingfeng",""],["Diao","Caozheng",""],["Zhao","Mingwen",""],["Sun","Shuo",""],["Tian","Lijun",""],["Breese","Mark B. H.",""],["Cai","Chuanbing",""],["Milosevic","Milorad V.",""],["Qi","Yanpeng",""],["Wee","Andrew T. S.",""],["Yin","Xinmao",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:28:44 GMT"}],"updateDate":"2024-07-02","timestamp":1719822524000,"abstract":"  Interactions among various electronic states such as CDW, magnetism, and\nsuperconductivity are of high significance in strongly correlated systems.\nWhile significant progress has been made in understanding the relationship\nbetween CDW and superconductivity, the interplay between CDW and magnetic order\nremains largely elusive. Kagome lattices, which intertwine nontrivial topology,\ncharge order, and magnetism, offer an ideal platform for such studies. The\nkagome magnet FeGe, hosting the unique coupling between CDW and magnetism, has\nrecently garnered considerable attention in that respect. Here we reveal the\nsignificant role of the orbital coupling effect during the CDW phase\ntransition, highlighting the orbital origin of the magnetic moment enhancement\nin FeGe. Our X ray absorption experiments and first principles calculations\nilluminate the temperature dependent behavior of Fe3d_Ge4p orbital\nhybridization and corroborate its pivotal impact on the magnetic properties of\nFeGe. These findings introduce an orbital dimension to the correlation between\ncharge and magnetic degrees of freedom, advancing our understanding of the\nintriguing quantum phases resulting from this interplay.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}