{"id":"2407.20254","title":"EEGMamba: Bidirectional State Space Models with Mixture of Experts for\n  EEG Classification","authors":"Yiyu Gui, MingZhi Chen, Yuqi Su, Guibo Luo, Yuchao Yang","authorsParsed":[["Gui","Yiyu",""],["Chen","MingZhi",""],["Su","Yuqi",""],["Luo","Guibo",""],["Yang","Yuchao",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 11:15:47 GMT"}],"updateDate":"2024-07-31","timestamp":1721474147000,"abstract":"  In recent years, with the development of deep learning, electroencephalogram\n(EEG) classification networks have achieved certain progress. Transformer-based\nmodels can perform well in capturing long-term dependencies in EEG signals.\nHowever, their quadratic computational complexity leads to significant\ncomputational overhead. Moreover, most EEG classification models are only\nsuitable for single tasks, showing poor generalization capabilities across\ndifferent tasks and further unable to handle EEG data from various tasks\nsimultaneously due to variations in signal length and the number of channels.\nIn this paper, we introduce a universal EEG classification network named\nEEGMamba, which seamlessly integrates the Spatio-Temporal-Adaptive\n(ST-Adaptive) module, Bidirectional Mamba, and Mixture of Experts (MoE) into a\nunified framework for multiple tasks. The proposed ST-Adaptive module performs\nunified feature extraction on EEG signals of different lengths and channel\ncounts through spatio-adaptive convolution and incorporates a class token to\nachieve temporal-adaptability. Moreover, we design a bidirectional Mamba\nparticularly suitable for EEG signals for further feature extraction, balancing\nhigh accuracy and fast inference speed in processing long EEG signals. In order\nto better process EEG data for different tasks, we introduce Task-aware MoE\nwith a universal expert, achieving the capture of both differences and\ncommonalities between EEG data from different tasks. We test our model on eight\npublicly available EEG datasets, and experimental results demonstrate its\nsuperior performance in four types of tasks: seizure detection, emotion\nrecognition, sleep stage classification, and motor imagery. The code is set to\nbe released soon.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}