{"id":"2407.13314","title":"NIRVAR: Network Informed Restricted Vector Autoregression","authors":"Brendan Martin, Francesco Sanna Passino, Mihai Cucuringu, Alessandra\n  Luati","authorsParsed":[["Martin","Brendan",""],["Passino","Francesco Sanna",""],["Cucuringu","Mihai",""],["Luati","Alessandra",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:16:03 GMT"},{"version":"v2","created":"Mon, 19 Aug 2024 19:43:17 GMT"}],"updateDate":"2024-08-21","timestamp":1721294163000,"abstract":"  High-dimensional panels of time series arise in many scientific disciplines\nsuch as neuroscience, finance, and macroeconomics. Often, co-movements within\ngroups of the panel components occur. Extracting these groupings from the data\nprovides a course-grained description of the complex system in question and can\ninform subsequent prediction tasks. We develop a novel methodology to model\nsuch a panel as a restricted vector autoregressive process, where the\ncoefficient matrix is the weighted adjacency matrix of a stochastic block\nmodel. This network time series model, which we call the Network Informed\nRestricted Vector Autoregression (NIRVAR) model, yields a coefficient matrix\nthat has a sparse block-diagonal structure. We propose an estimation procedure\nthat embeds each panel component in a low-dimensional latent space and clusters\nthe embedded points to recover the blocks of the coefficient matrix. Crucially,\nthe method allows for network-based time series modelling when the underlying\nnetwork is unobserved. We derive the bias, consistency and asymptotic normality\nof the NIRVAR estimator. Simulation studies suggest that the NIRVAR estimated\nembedded points are Gaussian distributed around the ground truth latent\npositions. On three applications to finance, macroeconomics, and transportation\nsystems, NIRVAR outperforms competing models in terms of prediction and\nprovides interpretable results regarding group recovery.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/"}