{"id":"2407.20090","title":"Infrared Small Target Detection based on Adjustable Sensitivity Strategy\n  and Multi-Scale Fusion","authors":"Jinmiao Zhao, Zelin Shi, Chuang Yu, Yunpeng Liu","authorsParsed":[["Zhao","Jinmiao",""],["Shi","Zelin",""],["Yu","Chuang",""],["Liu","Yunpeng",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:22:02 GMT"}],"updateDate":"2024-07-30","timestamp":1722266522000,"abstract":"  Recently, deep learning-based single-frame infrared small target (SIRST)\ndetection technology has made significant progress. However, existing infrared\nsmall target detection methods are often optimized for a fixed image\nresolution, a single wavelength, or a specific imaging system, limiting their\nbreadth and flexibility in practical applications. Therefore, we propose a\nrefined infrared small target detection scheme based on an adjustable\nsensitivity (AS) strategy and multi-scale fusion. Specifically, a multi-scale\nmodel fusion framework based on multi-scale direction-aware network (MSDA-Net)\nis constructed, which uses input images of multiple scales to train multiple\nmodels and fuses them. Multi-scale fusion helps characterize the shape, edge,\nand texture features of the target from different scales, making the model more\naccurate and reliable in locating the target. At the same time, we fully\nconsider the characteristics of the infrared small target detection task and\nconstruct an edge enhancement difficulty mining (EEDM) loss. The EEDM loss\nhelps alleviate the problem of category imbalance and guides the network to pay\nmore attention to difficult target areas and edge features during training. In\naddition, we propose an adjustable sensitivity strategy for post-processing.\nThis strategy significantly improves the detection rate of infrared small\ntargets while ensuring segmentation accuracy. Extensive experimental results\nshow that the proposed scheme achieves the best performance. Notably, this\nscheme won the first prize in the PRCV 2024 wide-area infrared small target\ndetection competition.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}