{"id":"2407.01979","title":"Unveiling Global Interactive Patterns across Graphs: Towards\n  Interpretable Graph Neural Networks","authors":"Yuwen Wang, Shunyu Liu, Tongya Zheng, Kaixuan Chen, Mingli Song","authorsParsed":[["Wang","Yuwen",""],["Liu","Shunyu",""],["Zheng","Tongya",""],["Chen","Kaixuan",""],["Song","Mingli",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 06:31:13 GMT"}],"updateDate":"2024-07-03","timestamp":1719901873000,"abstract":"  Graph Neural Networks (GNNs) have emerged as a prominent framework for graph\nmining, leading to significant advances across various domains. Stemmed from\nthe node-wise representations of GNNs, existing explanation studies have\nembraced the subgraph-specific viewpoint that attributes the decision results\nto the salient features and local structures of nodes. However, graph-level\ntasks necessitate long-range dependencies and global interactions for advanced\nGNNs, deviating significantly from subgraph-specific explanations. To bridge\nthis gap, this paper proposes a novel intrinsically interpretable scheme for\ngraph classification, termed as Global Interactive Pattern (GIP) learning,\nwhich introduces learnable global interactive patterns to explicitly interpret\ndecisions. GIP first tackles the complexity of interpretation by clustering\nnumerous nodes using a constrained graph clustering module. Then, it matches\nthe coarsened global interactive instance with a batch of self-interpretable\ngraph prototypes, thereby facilitating a transparent graph-level reasoning\nprocess. Extensive experiments conducted on both synthetic and real-world\nbenchmarks demonstrate that the proposed GIP yields significantly superior\ninterpretability and competitive performance to~the state-of-the-art\ncounterparts. Our code will be made publicly available.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}