{"id":"2407.05197","title":"A Generalized Transformer-based Radio Link Failure Prediction Framework\n  in 5G RANs","authors":"Kazi Hasan, Thomas Trappenberg, Israat Haque","authorsParsed":[["Hasan","Kazi",""],["Trappenberg","Thomas",""],["Haque","Israat",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 21:57:23 GMT"}],"updateDate":"2024-07-09","timestamp":1720303043000,"abstract":"  Radio link failure (RLF) prediction system in Radio Access Networks (RANs) is\ncritical for ensuring seamless communication and meeting the stringent\nrequirements of high data rates, low latency, and improved reliability in 5G\nnetworks. However, weather conditions such as precipitation, humidity,\ntemperature, and wind impact these communication links. Usually, historical\nradio link Key Performance Indicators (KPIs) and their surrounding weather\nstation observations are utilized for building learning-based RLF prediction\nmodels. However, such models must be capable of learning the spatial weather\ncontext in a dynamic RAN and effectively encoding time series KPIs with the\nweather observation data. Existing works fail to incorporate both of these\nessential design aspects of the prediction models. This paper fills the gap by\nproposing GenTrap, a novel RLF prediction framework that introduces a graph\nneural network (GNN)-based learnable weather effect aggregation module and\nemploys state-of-the-art time series transformer as the temporal feature\nextractor for radio link failure prediction. The proposed aggregation method of\nGenTrap can be integrated into any existing prediction model to achieve better\nperformance and generalizability. We evaluate GenTrap on two real-world\ndatasets (rural and urban) with 2.6 million KPI data points and show that\nGenTrap offers a significantly higher F1-score (0.93 for rural and 0.79 for\nurban) compared to its counterparts while possessing generalization capability.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}