{"id":"2407.04952","title":"Granular Privacy Control for Geolocation with Vision Language Models","authors":"Ethan Mendes, Yang Chen, James Hays, Sauvik Das, Wei Xu, Alan Ritter","authorsParsed":[["Mendes","Ethan",""],["Chen","Yang",""],["Hays","James",""],["Das","Sauvik",""],["Xu","Wei",""],["Ritter","Alan",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 04:06:55 GMT"}],"updateDate":"2024-07-09","timestamp":1720238815000,"abstract":"  Vision Language Models (VLMs) are rapidly advancing in their capability to\nanswer information-seeking questions. As these models are widely deployed in\nconsumer applications, they could lead to new privacy risks due to emergent\nabilities to identify people in photos, geolocate images, etc. As we\ndemonstrate, somewhat surprisingly, current open-source and proprietary VLMs\nare very capable image geolocators, making widespread geolocation with VLMs an\nimmediate privacy risk, rather than merely a theoretical future concern. As a\nfirst step to address this challenge, we develop a new benchmark, GPTGeoChat,\nto test the ability of VLMs to moderate geolocation dialogues with users. We\ncollect a set of 1,000 image geolocation conversations between in-house\nannotators and GPT-4v, which are annotated with the granularity of location\ninformation revealed at each turn. Using this new dataset, we evaluate the\nability of various VLMs to moderate GPT-4v geolocation conversations by\ndetermining when too much location information has been revealed. We find that\ncustom fine-tuned models perform on par with prompted API-based models when\nidentifying leaked location information at the country or city level; however,\nfine-tuning on supervised data appears to be needed to accurately moderate\nfiner granularities, such as the name of a restaurant or building.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"cNi9uVqN1NxsJhbRA7lH5QbeGt9UG8XRg-ET5lz3d_I","pdfSize":"32010365"}
