{"id":"2407.17924","title":"Inherent structural descriptors via machine learning","authors":"Emanuele Telari, Antonio Tinti, Manoj Settem, Morgan Rees, Henry\n  Hoddinott, Malcom Dearg, Bernd von Issendorff, Georg Held, Thomas J.A.\n  Slater, Richard E. Palmer, Luca Maragliano, Riccardo Ferrando, Alberto\n  Giacomello","authorsParsed":[["Telari","Emanuele",""],["Tinti","Antonio",""],["Settem","Manoj",""],["Rees","Morgan",""],["Hoddinott","Henry",""],["Dearg","Malcom",""],["von Issendorff","Bernd",""],["Held","Georg",""],["Slater","Thomas J. A.",""],["Palmer","Richard E.",""],["Maragliano","Luca",""],["Ferrando","Riccardo",""],["Giacomello","Alberto",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 10:24:09 GMT"}],"updateDate":"2024-07-26","timestamp":1721903049000,"abstract":"  Finding proper collective variables for complex systems and processes is one\nof the most challenging tasks in simulations, which limits the interpretation\nof experimental and simulated data and the application of enhanced sampling\ntechniques. Here, we propose a machine learning approach able to distill few,\nphysically relevant variables by associating instantaneous configurations of\nthe system to their corresponding inherent structures as defined in liquids\ntheory. We apply this approach to the challenging case of structural\ntransitions in nanoclusters, managing to characterize and explore the\nstructural complexity of an experimentally relevant system constituted by 147\ngold atoms. Our inherent-structure variables are shown to be effective at\ncomputing complex free-energy landscapes, transition rates, and at describing\nnon-equilibrium melting and freezing processes. The effectiveness of this\nmachine learning strategy guided by the generally-applicable concept of\ninherent structures shows promise to devise collective variables for a vast\nrange of systems, including liquids, glasses, and proteins.\n","subjects":["Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}