{"id":"2407.09580","title":"Don't Fear Peculiar Activation Functions: EUAF and Beyond","authors":"Qianchao Wang (1), Shijun Zhang (2), Dong Zeng (3), Zhaoheng Xie (4),\n  Hengtao Guo (5), Feng-Lei Fan (1) and Tieyong Zeng (1) ((1) Center of\n  Mathematical Artificial Intelligence, Department of Mathematics, The Chinese\n  University of Hong Kong, Hong Kong, China, (2) Department of Applied\n  Mathematics, The Hong Kong Polytechnic University, Hong Kong, China, (3)\n  Department of Biomedical Engineering, Southern Medical University, Guangzhou,\n  China, (4) Institute of Medical Technology, Peking University Health Science\n  Center, Peking University, Beijing, China, (5) Independent Researcher,\n  Seattle, WA, US)","authorsParsed":[["Wang","Qianchao",""],["Zhang","Shijun",""],["Zeng","Dong",""],["Xie","Zhaoheng",""],["Guo","Hengtao",""],["Fan","Feng-Lei",""],["Zeng","Tieyong",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 03:57:25 GMT"}],"updateDate":"2024-07-16","timestamp":1720756645000,"abstract":"  In this paper, we propose a new super-expressive activation function called\nthe Parametric Elementary Universal Activation Function (PEUAF). We demonstrate\nthe effectiveness of PEUAF through systematic and comprehensive experiments on\nvarious industrial and image datasets, including CIFAR10, Tiny-ImageNet, and\nImageNet. Moreover, we significantly generalize the family of super-expressive\nactivation functions, whose existence has been demonstrated in several recent\nworks by showing that any continuous function can be approximated to any\ndesired accuracy by a fixed-size network with a specific super-expressive\nactivation function. Specifically, our work addresses two major bottlenecks in\nimpeding the development of super-expressive activation functions: the limited\nidentification of super-expressive functions, which raises doubts about their\nbroad applicability, and their often peculiar forms, which lead to skepticism\nregarding their scalability and practicality in real-world applications.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}