{"id":"2407.16832","title":"Real-time risk estimation for active road safety: Leveraging Waymo AV\n  sensor data with hierarchical Bayesian extreme value models","authors":"Mohammad Anis, Sixu Li, Srinivas R. Geedipally, Yang Zhou, and\n  Dominique Lord","authorsParsed":[["Anis","Mohammad",""],["Li","Sixu",""],["Geedipally","Srinivas R.",""],["Zhou","Yang",""],["Lord","Dominique",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 20:46:18 GMT"}],"updateDate":"2024-07-25","timestamp":1721767578000,"abstract":"  This study develops a real-time framework for estimating the risk of\nnear-misses by using high-fidelity two-dimensional (2D) risk indicator\ntime-to-collision (TTC), which is calculated from high-resolution data\ncollected by autonomous vehicles (AVs). The framework utilizes extreme value\ntheory (EVT) to derive near-miss risk based on observed TTC data. Most existing\nstudies employ a generalized extreme value (GEV) distribution for specific\nsites and conflict types and often overlook individual vehicle dynamics\nheterogeneity. This framework is versatile across various highway geometries\nand can encompass vehicle dynamics and fidelity by incorporating covariates\nsuch as speed, acceleration, steering angle, and heading. This makes the risk\nestimation framework suitable for dynamic, real-world traffic environments. The\ndataset for this study is derived from Waymo perception data, encompassing six\nsites across three cities: San Francisco, Phoenix, and Los Angeles. Vehicle\ntrajectory data were extracted from the dataset, and near-miss frequencies were\ncalculated using high-fidelity 2D TTC. The crash risk was derived from observed\nnear misses using four hierarchical Bayesian GEV models, explicitly focusing on\nconflicting pairs as block minima (BM), which revealed that crash risk varies\nacross pairs.The proposed framework is efficient using a hierarchical Bayesian\nstructure random parameter (HBSRP) model, offering superior statistical\nperformance and flexibility by accounting for unobserved heterogeneity across\nsites. The study identifies and quantifies that the most hazardous conditions\ninvolve conflicting vehicle speeds and rapid acceleration and deceleration,\nsignificantly increasing crash risk in urban arterials.\n","subjects":["Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}