{"id":"2407.08198","title":"Dynamical critical behavior of the two-dimensional three-state Potts\n  model","authors":"Erol Vatansever, Gerard T. Barkema, Nikolaos G. Fytas","authorsParsed":[["Vatansever","Erol",""],["Barkema","Gerard T.",""],["Fytas","Nikolaos G.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 05:40:44 GMT"}],"updateDate":"2024-07-24","timestamp":1720676444000,"abstract":"  We investigate the dynamical critical behavior of the two-dimensional\nthree-state Potts model with single spin-flip dynamics in equilibrium. We focus\non the mean-squared deviation of the magnetization $M$ (MSD$_{M}$) as a\nfunction of time, as well as on the autocorrelation function of $M$. Our\nsimulations reveal the existence of two crossover behaviors at times $\\tau_1\n\\sim L^{z_1}$ and $\\tau_2 \\sim L^{z_2}$, separating three dynamical regimes.\nMSD$_{M}$ appears to shift from ordinary diffusion in the first regime, to\nanomalous diffusion in the second, and finally to be constant in the third\nregime. The magnetization autocorrelation function on the other hand is found\nto fluctuate between exponential decay, stretched-exponential decay, and then\nagain exponential decay along these three regimes. This behavior is in\nagreement with the one reported recently for the two-dimensional Ising\nferromagnet [Phys. Rev. E {\\bf 108}, 034118 (2023)], indicating that the\nexistence of two dynamic critical exponents is not a peculiarity of the Ising\nmodel itself. A comparison of both MSD$_{M}$ and the magnetization's\nautocorrelation function suggests that within our numerical accuracy the\nexponents $z_1$ and $z_2$ are shared between the Ising and three-state Potts\nmodels at least for the particular case of single spin-flip dynamics studied\nhere, even though their equilibrium universality classes are clearly distinct.\nContinuity of MSD$_{M}$ requires that $\\alpha (z_2 - z_1) = \\gamma/\\nu - z_1$,\nin which $\\alpha$ is the anomalous exponent in the intermediate regime. Since\nthe ratio $\\gamma/\\nu$ is not shared between the two models, it follows that\n$\\alpha$ is not shared either, an aspect well verified in our simulations.\nFinally, we also discuss the relevance of our main findings using another\nuseful observable, namely the line magnetization $M_{l}$.\n","subjects":["Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}