{"id":"2407.13467","title":"Personal Data Transfers to Non-EEA Domains: A Tool for Citizens and An\n  Analysis on Italian Public Administration Websites","authors":"Lorenzo Laudadio, Antonio Vetr\\`o, Riccardo Coppola, Juan Carlos De\n  Martin, Marco Torchiano","authorsParsed":[["Laudadio","Lorenzo",""],["Vetrò","Antonio",""],["Coppola","Riccardo",""],["De Martin","Juan Carlos",""],["Torchiano","Marco",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 12:41:44 GMT"}],"updateDate":"2024-07-19","timestamp":1721306504000,"abstract":"  Six years after the entry into force of the GDPR, European companies and\norganizations still have difficulties complying with it: the amount of fines\nissued by the European data protection authorities is continuously increasing.\nPersonal data transfers are no exception. In this work we analyse the personal\ndata transfers from more than 20000 Italian Public Administration (PA) entities\nto third countries. We developed \"Minos\", a user-friendly application which\nallows to navigate the web while recording HTTP requests. Then, we used the\nback-end of Minos to automate the analysis. We found that about 14% of the PAs\nwebsites transferred data out of the European Economic Area (EEA). This number\nis an underestimation because only visits to the home pages were object of the\nanalysis. The top 3 destinations of the data transfers are Amazon, Google and\nFonticons, accounting for about the 70% of the bad requests. The most recurrent\nservices which are the object of the requests are cloud computing services and\ncontent delivery networks (CDNs). Our results highlight that, in Italy, a\nrelevant portion of public administrations websites transfers personal data to\nnon EEA countries. In terms of technology policy, these results stress the need\nfor further incentives to improve the PA digital infrastructures. Finally,\nwhile working on refinements of Minos, the version here described is openly\navailable on Zenodo: it can be helpful to a variety of actors (citizens,\nresearchers, activists, policy makers) to increase awareness and enlarge the\ninvestigation.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"03ErYDIyFY5btznflRbIdMkbuHwZ0gMwmJ3cPaGvKQA","pdfSize":"103294"}
