{"id":"2407.02333","title":"Why do LLaVA Vision-Language Models Reply to Images in English?","authors":"Musashi Hinck, Carolin Holtermann, Matthew Lyle Olson, Florian\n  Schneider, Sungduk Yu, Anahita Bhiwandiwalla, Anne Lauscher, Shaoyen Tseng,\n  Vasudev Lal","authorsParsed":[["Hinck","Musashi",""],["Holtermann","Carolin",""],["Olson","Matthew Lyle",""],["Schneider","Florian",""],["Yu","Sungduk",""],["Bhiwandiwalla","Anahita",""],["Lauscher","Anne",""],["Tseng","Shaoyen",""],["Lal","Vasudev",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 15:01:55 GMT"}],"updateDate":"2024-07-03","timestamp":1719932515000,"abstract":"  We uncover a surprising multilingual bias occurring in a popular class of\nmultimodal vision-language models (VLMs). Including an image in the query to a\nLLaVA-style VLM significantly increases the likelihood of the model returning\nan English response, regardless of the language of the query. This paper\ninvestigates the causes of this loss with a two-pronged approach that combines\nextensive ablation of the design space with a mechanistic analysis of the\nmodels' internal representations of image and text inputs. Both approaches\nindicate that the issue stems in the language modelling component of the LLaVA\nmodel. Statistically, we find that switching the language backbone for a\nbilingual language model has the strongest effect on reducing this error.\nMechanistically, we provide compelling evidence that visual inputs are not\nmapped to a similar space as text ones, and that intervening on intermediary\nattention layers can reduce this bias. Our findings provide important insights\nto researchers and engineers seeking to understand the crossover between\nmultimodal and multilingual spaces, and contribute to the goal of developing\ncapable and inclusive VLMs for non-English contexts.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}