{"id":"2407.20952","title":"Atmospheric characterization of the super-Jupiter HIP 99770 b with KPIC","authors":"Yapeng Zhang, Jerry W. Xuan, Dimitri Mawet, Jason J. Wang, Chih-Chun\n  Hsu, Jean-Bapiste Ruffio, Heather A. Knutson, Julie Inglis, Geoffrey A.\n  Blake, Yayaati Chachan, Katelyn Horstman, Ashley Baker, Randall Bartos,\n  Benjamin Calvin, Sylvain Cetre, Jacques-Robert Delorme, Greg Doppmann, Daniel\n  Echeverri, Luke Finnerty, Michael P. Fitzgerald, Nemanja Jovanovic, Joshua\n  Liberman, Ronald A. L\\'opez, Evan Morris, Jacklyn Pezzato, Ben Sappey, Tobias\n  Schofield, Andrew Skemer, J. Kent Wallace, Ji Wang, Clarissa R. Do \\'O","authorsParsed":[["Zhang","Yapeng",""],["Xuan","Jerry W.",""],["Mawet","Dimitri",""],["Wang","Jason J.",""],["Hsu","Chih-Chun",""],["Ruffio","Jean-Bapiste",""],["Knutson","Heather A.",""],["Inglis","Julie",""],["Blake","Geoffrey A.",""],["Chachan","Yayaati",""],["Horstman","Katelyn",""],["Baker","Ashley",""],["Bartos","Randall",""],["Calvin","Benjamin",""],["Cetre","Sylvain",""],["Delorme","Jacques-Robert",""],["Doppmann","Greg",""],["Echeverri","Daniel",""],["Finnerty","Luke",""],["Fitzgerald","Michael P.",""],["Jovanovic","Nemanja",""],["Liberman","Joshua",""],["López","Ronald A.",""],["Morris","Evan",""],["Pezzato","Jacklyn",""],["Sappey","Ben",""],["Schofield","Tobias",""],["Skemer","Andrew",""],["Wallace","J. Kent",""],["Wang","Ji",""],["Ó","Clarissa R. Do",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 16:28:10 GMT"}],"updateDate":"2024-07-31","timestamp":1722356890000,"abstract":"  Young, self-luminous super-Jovian companions discovered by direct imaging\nprovide a challenging test of planet formation and evolution theories. By\nspectroscopically characterizing the atmospheric compositions of these\nsuper-Jupiters, we can constrain their formation histories. Here we present\nstudies of the recently discovered HIP 99770 b, a 16 MJup high-contrast\ncompanion on a 17 au orbit, using the fiber-fed high-resolution spectrograph\nKPIC (R~35,000) on the Keck II telescope. Our K-band observations led to\ndetections of H2O and CO in the atmosphere of HIP 99770 b. We carried out free\nretrieval analyses using petitRADTRANS to measure its chemical abundances,\nincluding the metallicity and C/O ratio, projected rotation velocity (vsini),\nand radial velocity (RV). We found that the companion's atmosphere has\nC/O=0.55(-0.04/+0.06) and [M/H]=0.26(-0.23/+0.24) (1{\\sigma} confidence\nintervals), values consistent with those of the Sun and with a companion\nformation via gravitational instability or core accretion. The projected\nrotation velocity < 7.8 km/s is small relative to other directly imaged\ncompanions with similar masses and ages. This may imply a near pole-on\norientation or effective magnetic braking by a circumplanetary disk. In\naddition, we added the companion-to-primary relative RV measurement to the\norbital fitting and obtained updated constraints on orbital parameters.\nDetailed characterization of super-Jovian companions within 20 au like HIP\n99770 b is critical for understanding the formation histories of this\npopulation.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}