{"id":"2407.12242","title":"Parameter Generation of Quantum Approximate Optimization Algorithm with\n  Diffusion Model","authors":"Fanxu Meng and Xiangzhen Zhou","authorsParsed":[["Meng","Fanxu",""],["Zhou","Xiangzhen",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 01:18:27 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 16:19:55 GMT"},{"version":"v3","created":"Fri, 19 Jul 2024 01:10:45 GMT"}],"updateDate":"2024-07-22","timestamp":1721179107000,"abstract":"  Quantum computing presents a compelling prospect for revolutionizing the\nfield of combinatorial optimization, in virtue of the unique attributes of\nquantum mechanics such as superposition and entanglement. The Quantum\nApproximate Optimization Algorithm (QAOA), which is a variational hybrid\nquantum-classical algorithm, stands out as leading proposals to efficiently\nsolve the Max-Cut problem, a representative example of combinatorial\noptimization. However, its promised advantages strongly rely on parameters\ninitialization strategy, a critical aspect due to the non-convex and complex\noptimization landscapes characterized by low-quality local minima issues.\nTherefore, in this work, we formulate the problem of finding good initial\nparameters as a generative task in which the generative machine learning model,\nspecifically the denoising diffusion probabilistic model (DDPM), is trained to\ngenerate high-performing initial parameters for QAOA. The diffusion model is\ncapable of learning the distribution of high-performing parameters and then\nsynthesizing new parameters closer to optimal ones. Experiments with various\nsized Max-Cut problem instances demonstrate that our diffusion process\nconsistently enhances QAOA effectiveness compared to random parameters\ninitialization. Moreover, our framework indicates the capacity of training on\nsmall, classically simulatable problem instances, aiming at extrapolating to\nlarger instances to reduce quantum computational resource overhead.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}