{"id":"2407.10135","title":"FSD-BEV: Foreground Self-Distillation for Multi-view 3D Object Detection","authors":"Zheng Jiang, Jinqing Zhang, Yanan Zhang, Qingjie Liu, Zhenghui Hu,\n  Baohui Wang, Yunhong Wang","authorsParsed":[["Jiang","Zheng",""],["Zhang","Jinqing",""],["Zhang","Yanan",""],["Liu","Qingjie",""],["Hu","Zhenghui",""],["Wang","Baohui",""],["Wang","Yunhong",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 09:39:44 GMT"}],"updateDate":"2024-07-16","timestamp":1720949984000,"abstract":"  Although multi-view 3D object detection based on the Bird's-Eye-View (BEV)\nparadigm has garnered widespread attention as an economical and\ndeployment-friendly perception solution for autonomous driving, there is still\na performance gap compared to LiDAR-based methods. In recent years, several\ncross-modal distillation methods have been proposed to transfer beneficial\ninformation from teacher models to student models, with the aim of enhancing\nperformance. However, these methods face challenges due to discrepancies in\nfeature distribution originating from different data modalities and network\nstructures, making knowledge transfer exceptionally challenging. In this paper,\nwe propose a Foreground Self-Distillation (FSD) scheme that effectively avoids\nthe issue of distribution discrepancies, maintaining remarkable distillation\neffects without the need for pre-trained teacher models or cumbersome\ndistillation strategies. Additionally, we design two Point Cloud\nIntensification (PCI) strategies to compensate for the sparsity of point clouds\nby frame combination and pseudo point assignment. Finally, we develop a\nMulti-Scale Foreground Enhancement (MSFE) module to extract and fuse\nmulti-scale foreground features by predicted elliptical Gaussian heatmap,\nfurther improving the model's performance. We integrate all the above\ninnovations into a unified framework named FSD-BEV. Extensive experiments on\nthe nuScenes dataset exhibit that FSD-BEV achieves state-of-the-art\nperformance, highlighting its effectiveness. The code and models are available\nat: https://github.com/CocoBoom/fsd-bev.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}