{"id":"2407.09915","title":"Automatic Parallel Tempering Markov Chain Monte Carlo with Nii-C","authors":"Sheng Jin, Wenxin Jiang, Dong-Hong Wu","authorsParsed":[["Jin","Sheng",""],["Jiang","Wenxin",""],["Wu","Dong-Hong",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 15:18:51 GMT"}],"updateDate":"2024-07-16","timestamp":1720883931000,"abstract":"  Due to the high dimensionality or multimodality that is common in modern\nastronomy, sampling Bayesian posteriors can be challenging. Several publicly\navailable codes based on different sampling algorithms can solve these complex\nmodels, but the execution of the code is not always efficient or fast enough.\nThe article introduces a C language general-purpose code, Nii-C\n(https://github.com/shengjin/nii-c.git), that implements a framework of\nAutomatic Parallel Tempering Markov Chain Monte Carlo. Automatic in this\ncontext means that the parameters that ensure an efficient parallel tempering\nprocess can be set by a control system during the initial stages of a sampling\nprocess. The auto-tuned parameters consist of two parts, the temperature\nladders of all parallel tempering Markov chains and the proposal distributions\nfor all model parameters across all parallel tempering chains. In order to\nreduce dependencies in the compilation process and increase the code's\nexecution speed, Nii-C code is constructed entirely in the C language and\nparallelised using the Message-Passing Interface protocol to optimise the\nefficiency of parallel sampling. These implementations facilitate rapid\nconvergence in the sampling of high-dimensional and multi-modal distributions,\nas well as expeditious code execution time. The Nii-C code can be used in\nvarious research areas to trace complex distributions due to its high sampling\nefficiency and quick execution speed. This article presents a few applications\nof the Nii-C code.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Statistics/Computation"],"license":"http://creativecommons.org/licenses/by/4.0/"}