{"id":"2407.15348","title":"A Novel Hybrid Digital and Analog Laser Synchronization System","authors":"Mingwen Zhu, Shangsu Ding, Tianwei Jiang, Jianming Shang, Song Yu, Bin\n  Luo","authorsParsed":[["Zhu","Mingwen",""],["Ding","Shangsu",""],["Jiang","Tianwei",""],["Shang","Jianming",""],["Yu","Song",""],["Luo","Bin",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 03:17:23 GMT"}],"updateDate":"2024-07-23","timestamp":1721618243000,"abstract":"  Laser synchronization is a technique that locks the wavelength of a\nfree-running laser to that of the reference laser, thereby enabling synchronous\nchanges in the wavelengths of the two lasers. This technique is of crucial\nimportance in both scientific and industrial applications. Conventional\nsynchronization systems, whether digital or analog, have intrinsic limitations\nin terms of accuracy or bandwidth. The hybrid \"digital + analog\" system can\naddress this shortcoming. However, all above systems face the challenge of\nachieving an both high locking accuracy and low structural complexity\nsimultaneously. This paper presents a hybrid \"digital + analog\" laser\nsynchronization system with low-complexity and high-performance. In the digital\npart, we proposed a electric intensity locking method based on a band-pass\nfilter, which realizes the fluctuation of frequency offset between a single\nfrequency laser (SFL) and a mode-locked laser (MLL) less than 350 kHz in 24\nhours. Following the incorporation of the analog control component, frequency\nfluctuation is less than 2.5 Hz in 24 hours. By synchronizing two SFLs to a\nrepetition-frequency locked MLL, we achieve indirect synchronization between\nSFLs with a frequency offset of 10.6 GHz and fluctuation less than 5 Hz in 24\nhours, demonstrating robust long- and short-term stability. Since the MLL is\nemployed as a reference, the system can be utilized for cross-band indirect\nsynchronization of multiple lasers. Based on the synchronization system, we\npropose a photonic-assisted microwave frequency identification scheme, which\nhas detection error of less than 0.6 MHz. The high performance of the\nsynchronization system enables the proposed frequency identification scheme to\nachieve high measurement accuracy and a theoretically large frequency range.\n","subjects":["Physics/Optics","Physics/Instrumentation and Detectors"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}