{"id":"2407.10484","title":"Understanding Matrix Function Normalizations in Covariance Pooling\n  through the Lens of Riemannian Geometry","authors":"Ziheng Chen, Yue Song, Xiao-Jun Wu, Gaowen Liu, Nicu Sebe","authorsParsed":[["Chen","Ziheng",""],["Song","Yue",""],["Wu","Xiao-Jun",""],["Liu","Gaowen",""],["Sebe","Nicu",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 07:11:44 GMT"},{"version":"v2","created":"Sat, 20 Jul 2024 08:11:10 GMT"}],"updateDate":"2024-07-23","timestamp":1721027504000,"abstract":"  Global Covariance Pooling (GCP) has been demonstrated to improve the\nperformance of Deep Neural Networks (DNNs) by exploiting second-order\nstatistics of high-level representations. GCP typically performs classification\nof the covariance matrices by applying matrix function normalization, such as\nmatrix logarithm or power, followed by a Euclidean classifier. However,\ncovariance matrices inherently lie in a Riemannian manifold, known as the\nSymmetric Positive Definite (SPD) manifold. The current literature does not\nprovide a satisfactory explanation of why Euclidean classifiers can be applied\ndirectly to Riemannian features after the normalization of the matrix power. To\nmitigate this gap, this paper provides a comprehensive and unified\nunderstanding of the matrix logarithm and power from a Riemannian geometry\nperspective. The underlying mechanism of matrix functions in GCP is interpreted\nfrom two perspectives: one based on tangent classifiers (Euclidean classifiers\non the tangent space) and the other based on Riemannian classifiers. Via\ntheoretical analysis and empirical validation through extensive experiments on\nfine-grained and large-scale visual classification datasets, we conclude that\nthe working mechanism of the matrix functions should be attributed to the\nRiemannian classifiers they implicitly respect.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"JndDDGFgst1GdcAnUoq9pAbhBbHHyO4lXyK20j_4WkM","pdfSize":"1935736"}
