{"id":"2407.14148","title":"Predicting Grain Boundary Segregation in Magnesium Alloys: An\n  Atomistically Informed Machine Learning Approach","authors":"Zhuocheng Xie, Achraf Atila, Julien Gu\\'enol\\'e, Sandra Korte-Kerzel,\n  Talal Al-Samman, Ulrich Kerzel","authorsParsed":[["Xie","Zhuocheng",""],["Atila","Achraf",""],["Guénolé","Julien",""],["Korte-Kerzel","Sandra",""],["Al-Samman","Talal",""],["Kerzel","Ulrich",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 09:27:39 GMT"}],"updateDate":"2024-07-22","timestamp":1721381259000,"abstract":"  Grain boundary (GB) segregation in magnesium (Mg) substantially influences\nits mechanical properties and performance. Atomic-scale modelling, typically\nusing ab-initio or semi-empirical approaches, has mainly focused on GB\nsegregation at highly symmetric GBs in Mg alloys, often failing to capture the\ndiversity of local atomic environments and segregation energies, resulting in\ninaccurate structure-property predictions. This study employs atomistic\nsimulations and machine learning models to systematically investigate the\nsegregation behavior of common solute elements in polycrystalline Mg at both\nground state and finite temperatures. The machine learning models accurately\npredict segregation thermodynamics by incorporating energetic and structural\ndescriptors. We found that segregation energy and vibrational free energy\nfollow skew-normal distributions, with hydrostatic stress, an indicator of\nexcess free volume, emerging as an important factor influencing segregation\ntendency. The local atomic environment's flexibility, quantified by flexibility\nvolume, is also crucial in predicting GB segregation. Comparing the grain\nboundary solute concentrations calculated via the Langmuir-McLean isotherm with\nexperimental data, we identified a pronounced segregation tendency for Nd,\nhighlighting its potential for GB engineering in Mg alloys. This work\ndemonstrates the powerful synergy of atomistic simulations and machine\nlearning, paving the way for designing advanced lightweight Mg alloys with\ntailored properties.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}