{"id":"2407.21394","title":"Force Sensing Guided Artery-Vein Segmentation via Sequential Ultrasound\n  Images","authors":"Yimeng Geng, Gaofeng Meng, Mingcong Chen, Guanglin Cao, Mingyang Zhao,\n  Jianbo Zhao, Hongbin Liu","authorsParsed":[["Geng","Yimeng",""],["Meng","Gaofeng",""],["Chen","Mingcong",""],["Cao","Guanglin",""],["Zhao","Mingyang",""],["Zhao","Jianbo",""],["Liu","Hongbin",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 07:32:18 GMT"}],"updateDate":"2024-08-01","timestamp":1722411138000,"abstract":"  Accurate identification of arteries and veins in ultrasound images is crucial\nfor vascular examinations and interventions in robotics-assisted surgeries.\nHowever, current methods for ultrasound vessel segmentation face challenges in\ndistinguishing between arteries and veins due to their morphological\nsimilarities. To address this challenge, this study introduces a novel force\nsensing guided segmentation approach to enhance artery-vein segmentation\naccuracy by leveraging their distinct deformability. Our proposed method\nutilizes force magnitude to identify key frames with the most significant\nvascular deformation in a sequence of ultrasound images. These key frames are\nthen integrated with the current frame through attention mechanisms, with\nweights assigned in accordance with force magnitude. Our proposed force sensing\nguided framework can be seamlessly integrated into various segmentation\nnetworks and achieves significant performance improvements in multiple U-shaped\nnetworks such as U-Net, Swin-unet and Transunet. Furthermore, we contribute the\nfirst multimodal ultrasound artery-vein segmentation dataset, Mus-V, which\nencompasses both force and image data simultaneously. The dataset comprises\n3114 ultrasound images of carotid and femoral vessels extracted from 105\nvideos, with corresponding force data recorded by the force sensor mounted on\nthe US probe. Our code and dataset will be publicly available.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"8JPEcJrSSvtzObZyUuYG3u8W9v0jYTY0SAupisy2-Eo","pdfSize":"1626832","objectId":"0x0fc3c6820ec7ce90bd736b5858fdac95a8db1c3967c47f596b6ad0ba7fe1032d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
