{"id":"2407.03088","title":"The sudden death of quantum advantage in correlation generations","authors":"Weixiao Sun and Fuchuan Wei and Yuguo Shao and Zhaohui Wei","authorsParsed":[["Sun","Weixiao",""],["Wei","Fuchuan",""],["Shao","Yuguo",""],["Wei","Zhaohui",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 13:22:53 GMT"}],"updateDate":"2024-07-04","timestamp":1720012973000,"abstract":"  As quantum error corrections still cannot be realized physically, quantum\nnoise is the most profound obstacle to the implementations of large-scale\nquantum algorithms or quantum schemes. It has been well-known that if a quantum\ncomputer suffers from too strong quantum noise, its running can be easily\nsimulated by a classical computer, making the quantum advantage impossible.\nGenerally speaking, however, the dynamical process that how quantum noise of\nvarying strengths from 0 to a fatal level impacts and destroys quantum\nadvantage has not been understood well. Undoubtedly, achieving this will be\nextremely valuable for us to understand the power of noisy intermediate-scale\nquantum computers. Meanwhile, correlation generation is a precious theoretical\nmodel of information processing tasks in which the quantum advantage can be\nprecisely quantified. Here we show that this model also provides us a valuable\ninsight into understanding the impact of noise on quantum advantage.\nParticularly, we will rigorously prove that when the strength of quantum noise\ncontinuously goes up from 0, the quantum advantage gradually declines, and\neventually fades away completely. Surprisingly, in some cases we observe an\nunexpected phenomenon we call the sudden death of the quantum advantage, i.e.,\nwhen the strength of quantum noise exceeds a certain point, the quantum\nadvantage disappears suddenly from a non-negligible level. This interesting\nphenomenon reveals the tremendous harm of noise to quantum information\nprocessing tasks from a new viewpoint.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}