{"id":"2407.10613","title":"Global destabilization of drift-tearing mode with coupling to\n  discretized electron drift-wave instability","authors":"J. Bao, W. L. Zhang, Z. Lin, H. S. Cai, D. J. Liu, H. T. Chen, C.\n  Dong, J. T. Cao and D. Li","authorsParsed":[["Bao","J.",""],["Zhang","W. L.",""],["Lin","Z.",""],["Cai","H. S.",""],["Liu","D. J.",""],["Chen","H. T.",""],["Dong","C.",""],["Cao","J. T.",""],["Li","D.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 10:53:40 GMT"}],"updateDate":"2024-07-16","timestamp":1721040820000,"abstract":"  The global linear behaviors of 2/1 DTM in the collisional regime are\ninvestigated based on a concisely resistive drift-MHD model. Besides DTM, extra\nnormal modes including EDW and SAW are coupled together and destabilized in\ndifferent parameter regimes by considering resistivity in this system. The EVP\napproach is applied for solving the eigenstate spectra with the distribution of\nall unstable solutions. It is found that in the small EDD frequency (omega_*e)\nregime, DTM growth rate agrees well with local theory that is reduced with\nincreasing omega_*e. However, when omega_*e exceeds a critical threshold\nomega_*crit, the strongly linear coupling between DTM and other discretized EDW\ninstabilities happens so that the free energies from current and pressure\nchannels can be released together and thus enhance the DTM, of which growth\nrate increases with increasing omega_*e and deviates from local theory results\nqualitatively. Correspondingly, a cross-scale mode structure forms with mixed\npolarization, namely, phi perturbation is dominated by electrostatic polarized\nshort-wavelength oscillation as EDW instability character, and A_para\nperturbation remains typical tearing mode solution of Alfvenic polarized\nmacroscopic structure. Within omega_*e > omega_*crit, the additional IDD causes\nphi oscillating structure to shift towards small density gradient domain, which\ncancels the extra drive from ion channel and thus DTM growth rate is\ninsensitive to IDD frequency. Compared to EDD effects, the IDD effect alone\nwith zero-omega_*e only leads to the stabilization of RTM that shows agreements\nbetween global simulation and local theory, which is no longer the condition\nfor DTM regime. These results are useful for clarifying the DTM global\nproperties with underlying physics mechanisms, which occurs in the regime of\nomega_*e >> gamma_c that is relevant to nowadays tokamak discharges with hot\nplasmas.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"-Jvsu8NdG2IqRRncPtreRQAuWU_mbgO3wPPkvML0rm0","pdfSize":"4398105"}
