{"id":"2407.02382","title":"Light-SLAM: A Robust Deep-Learning Visual SLAM System Based on LightGlue\n  under Challenging Lighting Conditions","authors":"Zhiqi Zhao, Chang Wu, Xiaotong Kong, Zejie Lv, Xiaoqi Du and Qiyan Li","authorsParsed":[["Zhao","Zhiqi",""],["Wu","Chang",""],["Kong","Xiaotong",""],["Lv","Zejie",""],["Du","Xiaoqi",""],["Li","Qiyan",""]],"versions":[{"version":"v1","created":"Fri, 10 May 2024 10:54:03 GMT"}],"updateDate":"2024-07-03","timestamp":1715338443000,"abstract":"  Simultaneous Localization and Mapping (SLAM) has become a critical technology\nfor intelligent transportation systems and autonomous robots and is widely used\nin autonomous driving. However, traditional manual feature-based methods in\nchallenging lighting environments make it difficult to ensure robustness and\naccuracy. Some deep learning-based methods show potential but still have\nsignificant drawbacks. To address this problem, we propose a novel hybrid\nsystem for visual SLAM based on the LightGlue deep learning network. It uses\ndeep local feature descriptors to replace traditional hand-crafted features and\na more efficient and accurate deep network to achieve fast and precise feature\nmatching. Thus, we use the robustness of deep learning to improve the whole\nsystem. We have combined traditional geometry-based approaches to introduce a\ncomplete visual SLAM system for monocular, binocular, and RGB-D sensors. We\nthoroughly tested the proposed system on four public datasets: KITTI, EuRoC,\nTUM, and 4Season, as well as on actual campus scenes. The experimental results\nshow that the proposed method exhibits better accuracy and robustness in\nadapting to low-light and strongly light-varying environments than traditional\nmanual features and deep learning-based methods. It can also run on GPU in real\ntime.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}