{"id":"2407.19386","title":"Multilevel Tau preconditioners for symmetrized multilevel Toeplitz\n  systems with applications to solving space fractional diffusion equations","authors":"Congcong Li and Sean Hon","authorsParsed":[["Li","Congcong",""],["Hon","Sean",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 04:04:05 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 03:26:02 GMT"}],"updateDate":"2024-09-05","timestamp":1722139445000,"abstract":"  In this work, we develop a novel multilevel Tau matrix-based preconditioned\nmethod for a class of non-symmetric multilevel Toeplitz systems. This method\nnot only accounts for but also improves upon an ideal preconditioner pioneered\nby [J. Pestana. Preconditioners for symmetrized Toeplitz and multilevel\nToeplitz matrices. SIAM J. Matrix Anal. Appl., 40(3):870-887, 2019]. The ideal\npreconditioning approach was primarily examined numerically in that study, and\nan effective implementation was not included. To address these issues, we first\nrigorously show in this study that this ideal preconditioner can indeed achieve\noptimal convergence when employing the MINRES method, with a convergence rate\nis that independent of the mesh size. Then, building on this preconditioner, we\ndevelop a practical and optimal preconditioned MINRES method. To further\nillustrate its applicability and develop a fast implementation strategy, we\nconsider solving Riemann-Liouville fractional diffusion equations as an\napplication. Specifically, following standard discretization on the equation,\nthe resultant linear system is a non-symmetric multilevel Toeplitz system,\naffirming the applicability of our preconditioning method. Through a simple\nsymmetrization strategy, we transform the original linear system into a\nsymmetric multilevel Hankel system. Subsequently, we propose a symmetric\npositive definite multilevel Tau preconditioner for the symmetrized system,\nwhich can be efficiently implemented using discrete sine transforms.\nTheoretically, we demonstrate that mesh-independent convergence can be\nachieved. In particular, we prove that the eigenvalues of the preconditioned\nmatrix are bounded within disjoint intervals containing $\\pm 1$, without any\noutliers. Numerical examples are provided to critically discuss the results,\nshowcase the spectral distribution, and support the efficacy of our strategy.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}