{"id":"2407.07871","title":"Enhancing HNSW Index for Real-Time Updates: Addressing Unreachable\n  Points and Performance Degradation","authors":"Wentao Xiao, Yueyang Zhan, Rui Xi, Mengshu Hou, Jianming Liao","authorsParsed":[["Xiao","Wentao",""],["Zhan","Yueyang",""],["Xi","Rui",""],["Hou","Mengshu",""],["Liao","Jianming",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 17:37:15 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 14:23:35 GMT"}],"updateDate":"2024-07-16","timestamp":1720633035000,"abstract":"  The approximate nearest neighbor search (ANNS) is a fundamental and essential\ncomponent in data mining and information retrieval, with graph-based\nmethodologies demonstrating superior performance compared to alternative\napproaches. Extensive research efforts have been dedicated to improving search\nefficiency by developing various graph-based indices, such as HNSW\n(Hierarchical Navigable Small World). However, the performance of HNSW and most\ngraph-based indices become unacceptable when faced with a large number of\nreal-time deletions, insertions, and updates. Furthermore, during update\noperations, HNSW can result in some data points becoming unreachable, a\nsituation we refer to as the `unreachable points phenomenon'. This phenomenon\ncould significantly affect the search accuracy of the graph in certain\nsituations.\n  To address these issues, we present efficient measures to overcome the\nshortcomings of HNSW, specifically addressing poor performance over long\nperiods of delete and update operations and resolving the issues caused by the\nunreachable points phenomenon. Our proposed MN-RU algorithm effectively\nimproves update efficiency and suppresses the growth rate of unreachable\npoints, ensuring better overall performance and maintaining the integrity of\nthe graph. Our results demonstrate that our methods outperform existing\napproaches. Furthermore, since our methods are based on HNSW, they can be\neasily integrated with existing indices widely used in the industrial field,\nmaking them practical for future real-world applications. Code is available at\n\\url{https://github.com/xwt1/MN-RU.git}\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}