{"id":"2407.11077","title":"Deep reinforcement learning with symmetric data augmentation applied for\n  aircraft lateral attitude tracking control","authors":"Yifei Li and Erik-jan van Kampen","authorsParsed":[["Li","Yifei",""],["van Kampen","Erik-jan",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 08:20:11 GMT"}],"updateDate":"2024-07-17","timestamp":1720858811000,"abstract":"  Symmetry is an essential property in some dynamical systems that can be\nexploited for state transition prediction and control policy optimization. This\npaper develops two symmetry-integrated Reinforcement Learning (RL) algorithms\nbased on standard Deep Deterministic Policy Gradient (DDPG),which leverage\nenvironment symmetry to augment explored transition samples of a Markov\nDecision Process(MDP). The firstly developed algorithm is named as Deep\nDeterministic Policy Gradient with Symmetric Data Augmentation (DDPG-SDA),\nwhich enriches dataset of standard DDPG algorithm by symmetric data\naugmentation method under symmetry assumption of a dynamical system. To further\nimprove sample utilization efficiency, the second developed RL algorithm\nincorporates one extra critic network, which is independently trained with\naugmented dataset. A two-step approximate policy iteration method is proposed\nto integrate training for two critic networks and one actor network. The\nresulting RL algorithm is named as Deep Deterministic Policy Gradient with\nSymmetric Critic Augmentation (DDPG-SCA). Simulation results demonstrate\nenhanced sample efficiency and tracking performance of developed two RL\nalgorithms in aircraft lateral tracking control task.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5A-eLiqbGT9YY0ubYA73NKuK-nkwQZRvsHA6WcuD_Ys","pdfSize":"1146397","objectId":"0x427fba0458bc9f5d4b62d077fb0da33f2998f7acbc2195b7daf63b74be37d77a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
