{"id":"2407.17417","title":"Can Watermarking Large Language Models Prevent Copyrighted Text\n  Generation and Hide Training Data?","authors":"Michael-Andrei Panaitescu-Liess, Zora Che, Bang An, Yuancheng Xu,\n  Pankayaraj Pathmanathan, Souradip Chakraborty, Sicheng Zhu, Tom Goldstein,\n  Furong Huang","authorsParsed":[["Panaitescu-Liess","Michael-Andrei",""],["Che","Zora",""],["An","Bang",""],["Xu","Yuancheng",""],["Pathmanathan","Pankayaraj",""],["Chakraborty","Souradip",""],["Zhu","Sicheng",""],["Goldstein","Tom",""],["Huang","Furong",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 16:53:09 GMT"}],"updateDate":"2024-07-25","timestamp":1721839989000,"abstract":"  Large Language Models (LLMs) have demonstrated impressive capabilities in\ngenerating diverse and contextually rich text. However, concerns regarding\ncopyright infringement arise as LLMs may inadvertently produce copyrighted\nmaterial. In this paper, we first investigate the effectiveness of watermarking\nLLMs as a deterrent against the generation of copyrighted texts. Through\ntheoretical analysis and empirical evaluation, we demonstrate that\nincorporating watermarks into LLMs significantly reduces the likelihood of\ngenerating copyrighted content, thereby addressing a critical concern in the\ndeployment of LLMs. Additionally, we explore the impact of watermarking on\nMembership Inference Attacks (MIAs), which aim to discern whether a sample was\npart of the pretraining dataset and may be used to detect copyright violations.\nSurprisingly, we find that watermarking adversely affects the success rate of\nMIAs, complicating the task of detecting copyrighted text in the pretraining\ndataset. Finally, we propose an adaptive technique to improve the success rate\nof a recent MIA under watermarking. Our findings underscore the importance of\ndeveloping adaptive methods to study critical problems in LLMs with potential\nlegal implications.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}