{"id":"2407.01760","title":"Designing Machine Learning Tools to Characterize Multistationarity of\n  Fully Open Reaction Networks","authors":"Shenghao Yao and AmirHosein Sadeghimanesh and Matthew England","authorsParsed":[["Yao","Shenghao",""],["Sadeghimanesh","AmirHosein",""],["England","Matthew",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 19:50:38 GMT"}],"updateDate":"2024-07-03","timestamp":1719863438000,"abstract":"  We present the first use of machine learning tools to predict\nmultistationarity of reaction networks.\n  Chemical Reaction Networks (CRNs) are the mathematical formulation of how the\nquantities associated to a set of species (molecules, proteins, cells, or\nanimals) vary as time passes with respect to their interactions with each\nother. Their mathematics does not describe just chemical reactions but many\nother areas of the life sciences such as ecology, epidemiology, and population\ndynamics. We say a CRN is at a steady state when the concentration (or number)\nof species do not vary anymore. Some CRNs do not attain a steady state while\nsome others may have more than one possible steady state. The CRNs in the later\ngroup are called multistationary. Multistationarity is an important property,\ne.g. switch-like behaviour in cells needs multistationarity to occur. Existing\nalgorithms to detect whether a CRN is multistationary or not are either\nextremely expensive or restricted in the type of CRNs they can be used on,\nmotivating a new machine learning approach.\n  We address the problem of representing variable-length CRN data to machine\nlearning models by developing a new graph representation of CRNs for use with\ngraph learning algorithms. We contribute a large dataset of labelled fully open\nCRNs whose production necessitated the development of new CRN theory. Then we\npresent experimental results on the training and testing of a graph attention\nnetwork model on this dataset, showing excellent levels of performance. We\nfinish by testing the model predictions on validation data produced\nindependently, demonstrating generalisability of the model to different types\nof CRN.\n","subjects":["Quantitative Biology/Molecular Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}