{"id":"2407.07404","title":"Inoculating solid-state homogeneous precipitation by impurity atoms\n  through a spinodal decomposition like pathway","authors":"Shiwei Pan, Chunan Li, Hanne-Sofie S{\\o}reide, Dongdong Zhao,\n  Constantinos Hatzoglou, Feng Qian, Long-Qing Chen, Yanjun Li","authorsParsed":[["Pan","Shiwei",""],["Li","Chunan",""],["Søreide","Hanne-Sofie",""],["Zhao","Dongdong",""],["Hatzoglou","Constantinos",""],["Qian","Feng",""],["Chen","Long-Qing",""],["Li","Yanjun",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 07:04:30 GMT"}],"updateDate":"2024-07-11","timestamp":1720595070000,"abstract":"  Solid-state homogeneous precipitation of nano-sized precipitates is one of\nthe most effective processes to strengthen metal alloys, where the final\ndensity and size distribution of precipitates are largely controlled by the\nprecipitation kinetics. Here, we report a strategy to inoculate the homogeneous\nprecipitation of coherent precipitates to enhance the precipitation\nstrengthening. Using the technologically important dilute Al-Zr alloys as an\nexample, we demonstrate that an addition of a trace level of economical and\nreadily available, non-L1$_{2}$ phase forming impurity atoms, X (X= Sn, Sb, Bi\nor Cd) and Si, can significantly enhance the diffusivity of Zr atoms and\noverturn the precipitation of L1$_{2}$-structured Al$_{3}$Zr nanoparticles from\nthe classical homogeneous nucleation and growth pathway into a nonclassical\nnucleation pathway: Al$_{3}$Zr forms through the spontaneous formation of\nnano-scale local concentration fluctuations of Zr atoms on Zr-X(-Si)-vacancy\nclusters followed by a continuous increase of the concentration and chemical\nshort-range ordering (CSRO). Such an impurity atoms induced heterogeneous\nnucleation based on a \"spinodal decomposition like\" mechanism dramatically\naccelerates the precipitation kinetics, leading to an order of magnitude higher\nnumber density of precipitates and a record high hardening efficiency of solute\nZr atoms. By formulating the generalized selection principles for inoculating\nimpurity elements, this inoculation strategy should be extendable to a broader\nrange of materials to further explore the precipitation strengthening\npotentials.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}