{"id":"2407.02057","title":"HC-GLAD: Dual Hyperbolic Contrastive Learning for Unsupervised\n  Graph-Level Anomaly Detection","authors":"Yali Fu, Jindong Li, Jiahong Liu, Qianli Xing, Qi Wang, Irwin King","authorsParsed":[["Fu","Yali",""],["Li","Jindong",""],["Liu","Jiahong",""],["Xing","Qianli",""],["Wang","Qi",""],["King","Irwin",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 08:38:32 GMT"}],"updateDate":"2024-07-03","timestamp":1719909512000,"abstract":"  Unsupervised graph-level anomaly detection (UGAD) has garnered increasing\nattention in recent years due to its significance. However, most existing\nmethods only rely on traditional graph neural networks to explore pairwise\nrelationships but such kind of pairwise edges are not enough to describe\nmultifaceted relationships involving anomaly. There is an emergency need to\nexploit node group information which plays a crucial role in UGAD. In addition,\nmost previous works ignore the global underlying properties (e.g., hierarchy\nand power-law structure) which are common in real-world graph datasets and\ntherefore are indispensable factors on UGAD task. In this paper, we propose a\nnovel Dual Hyperbolic Contrastive Learning for Unsupervised Graph-Level Anomaly\nDetection (HC-GLAD in short). To exploit node group connections, we construct\nhypergraphs based on gold motifs and subsequently perform hypergraph\nconvolution. Furthermore, to preserve the hierarchy of real-world graphs, we\nintroduce hyperbolic geometry into this field and conduct both graph and\nhypergraph embedding learning in hyperbolic space with hyperboloid model. To\nthe best of our knowledge, this is the first work to simultaneously apply\nhypergraph with node group connections and hyperbolic geometry into this field.\nExtensive experiments on several real world datasets of different fields\ndemonstrate the superiority of HC-GLAD on UGAD task. The code is available at\nhttps://github.com/Yali-F/HC-GLAD.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}