{"id":"2407.02290","title":"A systematic comparison of measures for k-anonymity in networks","authors":"Rachel G. de Jong, Mark P. J. van der Loo, Frank W. Takes","authorsParsed":[["de Jong","Rachel G.",""],["van der Loo","Mark P. J.",""],["Takes","Frank W.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 14:25:25 GMT"}],"updateDate":"2024-07-03","timestamp":1719930325000,"abstract":"  Privacy-aware sharing of network data is a difficult task due to the\ninterconnectedness of individuals in networks. An important part of this\nproblem is the inherently difficult question of how in a particular situation\nthe privacy of an individual node should be measured. To that end, in this\npaper we propose a set of aspects that one should consider when choosing a\nmeasure for privacy. These aspects include the type of desired privacy and\nattacker scenario against which the measure protects, utility of the data, the\ntype of desired output, and the computational complexity of the chosen measure.\nBased on these aspects, we provide a systematic overview of existing approaches\nin the literature. We then focus on a set of measures that ultimately enables\nour objective: sharing the anonymized full network dataset with limited\ndisclosure risk. The considered measures, each based on the concept of\nk-anonymity, account for the structure of the surroundings of a certain node\nand differ in completeness and reach of the structural information taken into\naccount. We present a comprehensive theoretical characterization as well as\ncomparative empirical experiments on a wide range of real-world network\ndatasets with up to millions of edges. We find that the choice of the measure\nhas an enormous effect on aforementioned aspects. Most interestingly, we find\nthat the most effective measures consider a greater node vicinity, yet utilize\nminimal structural information and thus use minimal computational resources.\nThis finding has important implications for researchers and practitioners, who\nmay, based on the recommendations given in this paper, make an informed choice\non how to safely share large-scale network data in a privacy-aware manner.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UUnflDq69BtmOdhjzhuKMOQXTgAM24R38-tmQfbfVpo","pdfSize":"1659371"}
