{"id":"2407.20937","title":"EAR: Edge-Aware Reconstruction of 3-D vertebrae structures from\n  bi-planar X-ray images","authors":"Lixing Tan, Shuang Song, Yaofeng He, Kangneng Zhou, Tong Lu and Ruoxiu\n  Xiao","authorsParsed":[["Tan","Lixing",""],["Song","Shuang",""],["He","Yaofeng",""],["Zhou","Kangneng",""],["Lu","Tong",""],["Xiao","Ruoxiu",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 16:19:14 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 01:27:39 GMT"}],"updateDate":"2024-08-06","timestamp":1722356354000,"abstract":"  X-ray images ease the diagnosis and treatment process due to their rapid\nimaging speed and high resolution. However, due to the projection process of\nX-ray imaging, much spatial information has been lost. To accurately provide\nefficient spinal morphological and structural information, reconstructing the\n3-D structures of the spine from the 2-D X-ray images is essential. It is\nchallenging for current reconstruction methods to preserve the edge information\nand local shapes of the asymmetrical vertebrae structures. In this study, we\npropose a new Edge-Aware Reconstruction network (EAR) to focus on the\nperformance improvement of the edge information and vertebrae shapes. In our\nnetwork, by using the auto-encoder architecture as the backbone, the edge\nattention module and frequency enhancement module are proposed to strengthen\nthe perception of the edge reconstruction. Meanwhile, we also combine four loss\nterms, including reconstruction loss, edge loss, frequency loss and projection\nloss. The proposed method is evaluated using three publicly accessible datasets\nand compared with four state-of-the-art models. The proposed method is superior\nto other methods and achieves 25.32%, 15.32%, 86.44%, 80.13%, 23.7612 and\n0.3014 with regard to MSE, MAE, Dice, SSIM, PSNR and frequency distance. Due to\nthe end-to-end and accurate reconstruction process, EAR can provide sufficient\n3-D spatial information and precise preoperative surgical planning guidance.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}