{"id":"2407.14499","title":"Discover-then-Name: Task-Agnostic Concept Bottlenecks via Automated\n  Concept Discovery","authors":"Sukrut Rao, Sweta Mahajan, Moritz B\\\"ohle, Bernt Schiele","authorsParsed":[["Rao","Sukrut",""],["Mahajan","Sweta",""],["Böhle","Moritz",""],["Schiele","Bernt",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 17:50:11 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 14:50:01 GMT"}],"updateDate":"2024-08-13","timestamp":1721411411000,"abstract":"  Concept Bottleneck Models (CBMs) have recently been proposed to address the\n'black-box' problem of deep neural networks, by first mapping images to a\nhuman-understandable concept space and then linearly combining concepts for\nclassification. Such models typically require first coming up with a set of\nconcepts relevant to the task and then aligning the representations of a\nfeature extractor to map to these concepts. However, even with powerful\nfoundational feature extractors like CLIP, there are no guarantees that the\nspecified concepts are detectable. In this work, we leverage recent advances in\nmechanistic interpretability and propose a novel CBM approach -- called\nDiscover-then-Name-CBM (DN-CBM) -- that inverts the typical paradigm: instead\nof pre-selecting concepts based on the downstream classification task, we use\nsparse autoencoders to first discover concepts learnt by the model, and then\nname them and train linear probes for classification. Our concept extraction\nstrategy is efficient, since it is agnostic to the downstream task, and uses\nconcepts already known to the model. We perform a comprehensive evaluation\nacross multiple datasets and CLIP architectures and show that our method yields\nsemantically meaningful concepts, assigns appropriate names to them that make\nthem easy to interpret, and yields performant and interpretable CBMs. Code\navailable at https://github.com/neuroexplicit-saar/discover-then-name.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}