{"id":"2407.03616","title":"When can weak latent factors be statistically inferred?","authors":"Jianqing Fan, Yuling Yan, Yuheng Zheng","authorsParsed":[["Fan","Jianqing",""],["Yan","Yuling",""],["Zheng","Yuheng",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 03:59:52 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 16:03:53 GMT"}],"updateDate":"2024-07-15","timestamp":1720065592000,"abstract":"  This article establishes a new and comprehensive estimation and inference\ntheory for principal component analysis (PCA) under the weak factor model that\nallow for cross-sectional dependent idiosyncratic components under nearly\nminimal the factor strength relative to the noise level or signal-to-noise\nratio. Our theory is applicable regardless of the relative growth rate between\nthe cross-sectional dimension $N$ and temporal dimension $T$. This more\nrealistic assumption and noticeable result requires completely new technical\ndevice, as the commonly-used leave-one-out trick is no longer applicable to the\ncase with cross-sectional dependence. Another notable advancement of our theory\nis on PCA inference $ - $ for example, under the regime where $N\\asymp T$, we\nshow that the asymptotic normality for the PCA-based estimator holds as long as\nthe signal-to-noise ratio (SNR) grows faster than a polynomial rate of $\\log\nN$. This finding significantly surpasses prior work that required a polynomial\nrate of $N$. Our theory is entirely non-asymptotic, offering finite-sample\ncharacterizations for both the estimation error and the uncertainty level of\nstatistical inference. A notable technical innovation is our closed-form\nfirst-order approximation of PCA-based estimator, which paves the way for\nvarious statistical tests. Furthermore, we apply our theories to design\neasy-to-implement statistics for validating whether given factors fall in the\nlinear spans of unknown latent factors, testing structural breaks in the factor\nloadings for an individual unit, checking whether two units have the same risk\nexposures, and constructing confidence intervals for systematic risks. Our\nempirical studies uncover insightful correlations between our test results and\neconomic cycles.\n","subjects":["Statistics/Methodology","Economics/Econometrics","Mathematics/Statistics Theory","Quantitative Finance/Statistical Finance","Statistics/Machine Learning","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}