{"id":"2407.20796","title":"Linear mixed modelling of federated data when only the mean, covariance,\n  and sample size are available","authors":"Marie Analiz April Limpoco, Christel Faes, Niel Hens","authorsParsed":[["Limpoco","Marie Analiz April",""],["Faes","Christel",""],["Hens","Niel",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 12:58:32 GMT"}],"updateDate":"2024-07-31","timestamp":1722344312000,"abstract":"  In medical research, individual-level patient data provide invaluable\ninformation, but the patients' right to confidentiality remains of utmost\npriority. This poses a huge challenge when estimating statistical models such\nas linear mixed models, which is an extension of linear regression models that\ncan account for potential heterogeneity whenever data come from different data\nproviders. Federated learning algorithms tackle this hurdle by estimating\nparameters without retrieving individual-level data. Instead, iterative\ncommunication of parameter estimate updates between the data providers and\nanalyst is required. In this paper, we propose an alternative framework to\nfederated learning algorithms for fitting linear mixed models. Specifically,\nour approach only requires the mean, covariance, and sample size of multiple\ncovariates from different data providers once. Using the principle of\nstatistical sufficiency within the framework of likelihood as theoretical\nsupport, this proposed framework achieves estimates identical to those derived\nfrom actual individual-level data. We demonstrate this approach through real\ndata on 15 068 patient records from 70 clinics at the Children's Hospital of\nPennsylvania (CHOP). Assuming that each clinic only shares summary statistics\nonce, we model the COVID-19 PCR test cycle threshold as a function of patient\ninformation. Simplicity, communication efficiency, and wider scope of\nimplementation in any statistical software distinguish our approach from\nexisting strategies in the literature.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/"}