{"id":"2407.10669","title":"Probing-Enhanced Stochastic Programming","authors":"Zhichao Ma and Youngdae Kim and Jeff Linderoth and James R. Luedtke\n  and Logan R. Matthews","authorsParsed":[["Ma","Zhichao",""],["Kim","Youngdae",""],["Linderoth","Jeff",""],["Luedtke","James R.",""],["Matthews","Logan R.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 12:34:18 GMT"}],"updateDate":"2024-07-16","timestamp":1721046858000,"abstract":"  We consider a two-stage stochastic decision problem where the decision-maker\nhas the opportunity to obtain information about the distribution of the random\nvariables $\\xi$ that appear in the problem through a set of discrete actions\nthat we refer to as \\emph{probing}. Probing components of a random vector\n$\\eta$ that is jointly-distributed with $\\xi$ allows the decision-maker to\nlearn about the conditional distribution of $\\xi$ given the observed components\nof $\\eta$. We propose a three-stage optimization model for this problem, where\nin the first stage some components of $\\eta$ are chosen to be observed, and\ndecisions in subsequent stages must be consistent with the obtained\ninformation. In the case that $\\eta$ and $\\xi$ have finite support, Goel and\nGrossmann gave a mixed-integer programming (MIP) formulation of this problem\nwhose size is proportional to the square of cardinality of the sample space of\nthe random variables. We propose to solve the model using bounds obtained from\nan information-based relaxation, combined with a branching scheme that enforces\nthe consistency of decisions with observed information. The branch-and-bound\napproach can naturally be combined with sampling in order to estimate both\nlower and upper bounds on the optimal solution value and does not require\n$\\eta$ or $\\xi$ to have finite support. We conduct a computational study of our\nmethod on instances of a stochastic facility location and sizing problem with\nthe option to probe customers to learn about their demands before building\nfacilities. We find that on instances with finite support, our approach scales\nsignificantly better than the MIP formulation and also demonstrate that our\nmethod can compute statistical bounds on instances with continuous\ndistributions that improve upon the perfect information bounds.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LIdivtiOlgNxskD7QSJqQz7CBvHTKVyhSoV2qnb1sHY","pdfSize":"676997","objectId":"0x74450dd8a1fff3d5b4e6d14266ae7bac82fa6373f38d5d2ad4f231ebc8fc098e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
