{"id":"2407.00036","title":"LiveData -- A Worldwide Data Mesh for Stratified Data","authors":"Simone Bocca, Amarsanaa Ganbold, Tsolmon Zundui","authorsParsed":[["Bocca","Simone",""],["Ganbold","Amarsanaa",""],["Zundui","Tsolmon",""]],"versions":[{"version":"v1","created":"Mon, 27 May 2024 09:29:54 GMT"}],"updateDate":"2024-07-02","timestamp":1716802194000,"abstract":"  Data reuse is fundamental for reducing the data integration effort required\nto build data supporting new applications, especially in data scarcity\ncontexts. However, data reuse requires to deal with data heterogeneity, which\nis always present in data coming from different sources. Such heterogeneity\nappears at different levels, like the language used by the data, the structure\nof the information it represents, and the data types and formats adopted by the\ndatasets. Despite the valuable insights gained by reusing data across contexts,\ndealing with data heterogeneity is still a high price to pay. Additionally,\ndata reuse is hampered by the lack of data distribution infrastructures\nsupporting the production and distribution of quality and interoperable data.\nThese issues affecting data reuse are amplified considering cross-country data\nreuse, where geographical and cultural differences are more pronounced. In this\npaper, we propose LiveData, a cross-country data distribution network handling\nhigh quality and diversity-aware data. LiveData is composed by different nodes\nhaving an architecture providing components for the generation and distribution\nof a new type of data, where heterogeneity is transformed into information\ndiversity and considered as a feature, explicitly defined and used to satisfy\nthe data users purposes. This paper presents the specification of the LiveData\nnetwork, by defining the architecture and the type of data handled by its\nnodes. This specification is currently being used to implement a concrete use\ncase for data reuse and integration between the University of Trento (Italy)\nand the National University of Mongolia.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"QTslKJpmoVJlhHYFIASbg1QzcJtlemaH_4eTiAP3aj4","pdfSize":"345295","objectId":"0x38659840f8cac6516b97729546ea96fb44bc4686b6c0f47cb8426555ebc65ff6","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
