{"id":"2407.05563","title":"LLMBox: A Comprehensive Library for Large Language Models","authors":"Tianyi Tang, Yiwen Hu, Bingqian Li, Wenyang Luo, Zijing Qin, Haoxiang\n  Sun, Jiapeng Wang, Shiyi Xu, Xiaoxue Cheng, Geyang Guo, Han Peng, Bowen\n  Zheng, Yiru Tang, Yingqian Min, Yushuo Chen, Jie Chen, Yuanqian Zhao, Luran\n  Ding, Yuhao Wang, Zican Dong, Chunxuan Xia, Junyi Li, Kun Zhou, Wayne Xin\n  Zhao, Ji-Rong Wen","authorsParsed":[["Tang","Tianyi",""],["Hu","Yiwen",""],["Li","Bingqian",""],["Luo","Wenyang",""],["Qin","Zijing",""],["Sun","Haoxiang",""],["Wang","Jiapeng",""],["Xu","Shiyi",""],["Cheng","Xiaoxue",""],["Guo","Geyang",""],["Peng","Han",""],["Zheng","Bowen",""],["Tang","Yiru",""],["Min","Yingqian",""],["Chen","Yushuo",""],["Chen","Jie",""],["Zhao","Yuanqian",""],["Ding","Luran",""],["Wang","Yuhao",""],["Dong","Zican",""],["Xia","Chunxuan",""],["Li","Junyi",""],["Zhou","Kun",""],["Zhao","Wayne Xin",""],["Wen","Ji-Rong",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 02:39:33 GMT"}],"updateDate":"2024-07-09","timestamp":1720406373000,"abstract":"  To facilitate the research on large language models (LLMs), this paper\npresents a comprehensive and unified library, LLMBox, to ease the development,\nuse, and evaluation of LLMs. This library is featured with three main merits:\n(1) a unified data interface that supports the flexible implementation of\nvarious training strategies, (2) a comprehensive evaluation that covers\nextensive tasks, datasets, and models, and (3) more practical consideration,\nespecially on user-friendliness and efficiency. With our library, users can\neasily reproduce existing methods, train new models, and conduct comprehensive\nperformance comparisons. To rigorously test LLMBox, we conduct extensive\nexperiments in a diverse coverage of evaluation settings, and experimental\nresults demonstrate the effectiveness and efficiency of our library in\nsupporting various implementations related to LLMs. The detailed introduction\nand usage guidance can be found at https://github.com/RUCAIBox/LLMBox.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}