{"id":"2407.05099","title":"Equilibrium Strategies of Carbon Emission Reduction in Agricultural\n  Product Supply Chain under Carbon Sink Trading","authors":"Tingting Meng, Yukun Cheng, Xujin Pu, and Rui Li","authorsParsed":[["Meng","Tingting",""],["Cheng","Yukun",""],["Pu","Xujin",""],["Li","Rui",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 15:02:27 GMT"}],"updateDate":"2024-07-09","timestamp":1720278147000,"abstract":"  As global climate change and environmental issues escalate, carbon reduction\nhas emerged as a paramount global concern. Agriculture accounts for\napproximately 30% of global greenhouse gas emissions, making carbon reduction\nin this sector crucial for attaining global emission targets. Carbon sink\ntrading serves as a supplementary mechanism to achieve carbon peaking and\nneutrality, helping to lower the rate ofcarbon emissions. However, practical\nprojects and research in the field of carbon sink trading are not enough\ncurrently. This work aims to thoroughly explore the cooperative models between\nfarmers and retailers within the context of agricultural carbon sink trading,\nas well as the optimal decisions on the efforts to reduce carbon emission for\nboth parties under different cooperative models. To this end, we delve into\nthree distinct cooperative frameworks: the decentralized, the Stackelberg, and\nthe centralized models, each accompanied by a corresponding differentialgame\nmodel. The Hamilton-Jacobi-Bellman equation is utilized to investigate the\nequilibrium strategies of each participant under these three cooperative\nmodels, respectively. Furthermore, we conducte numerical simulations to analyze\nthe carbon emission reduction efforts of farmers and retailers, the carbon\nemission reduction level of the agricultural supply chain, and the overall\nprofits of the supply chain. We also compare scenarios with and without carbon\nsink trading to provide a comprehensive assessment. The numerical results\nindicate that the centralized modelexcels in all aspects, followed by the\nStackelberg model, with the decentralized model showing the weakest\nperformance. Additionally, carbon sink trading can significantly increase the\nprofits of the participants under each cooperative model.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}