{"id":"2407.08662","title":"Uncertainty Estimation of Large Language Models in Medical Question\n  Answering","authors":"Jiaxin Wu, Yizhou Yu, Hong-Yu Zhou","authorsParsed":[["Wu","Jiaxin",""],["Yu","Yizhou",""],["Zhou","Hong-Yu",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 16:51:33 GMT"}],"updateDate":"2024-07-12","timestamp":1720716693000,"abstract":"  Large Language Models (LLMs) show promise for natural language generation in\nhealthcare, but risk hallucinating factually incorrect information. Deploying\nLLMs for medical question answering necessitates reliable uncertainty\nestimation (UE) methods to detect hallucinations. In this work, we benchmark\npopular UE methods with different model sizes on medical question-answering\ndatasets. Our results show that current approaches generally perform poorly in\nthis domain, highlighting the challenge of UE for medical applications. We also\nobserve that larger models tend to yield better results, suggesting a\ncorrelation between model size and the reliability of UE. To address these\nchallenges, we propose Two-phase Verification, a probability-free Uncertainty\nEstimation approach. First, an LLM generates a step-by-step explanation\nalongside its initial answer, followed by formulating verification questions to\ncheck the factual claims in the explanation. The model then answers these\nquestions twice: first independently, and then referencing the explanation.\nInconsistencies between the two sets of answers measure the uncertainty in the\noriginal response. We evaluate our approach on three biomedical\nquestion-answering datasets using Llama 2 Chat models and compare it against\nthe benchmarked baseline methods. The results show that our Two-phase\nVerification method achieves the best overall accuracy and stability across\nvarious datasets and model sizes, and its performance scales as the model size\nincreases.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MYe4lvk5Ua7CuPFwkUSlt_8nldjStmqQGZ2YPg5iCYk","pdfSize":"915811"}
