{"id":"2407.01950","title":"LDP: A Local Diffusion Planner for Efficient Robot Navigation and\n  Collision Avoidance","authors":"Wenhao Yu, Jie Peng, Huanyu Yang, Junrui Zhang, Yifan Duan, Jianmin Ji\n  and Yanyong Zhang","authorsParsed":[["Yu","Wenhao",""],["Peng","Jie",""],["Yang","Huanyu",""],["Zhang","Junrui",""],["Duan","Yifan",""],["Ji","Jianmin",""],["Zhang","Yanyong",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 04:53:35 GMT"}],"updateDate":"2024-07-03","timestamp":1719896015000,"abstract":"  The conditional diffusion model has been demonstrated as an efficient tool\nfor learning robot policies, owing to its advancement to accurately model the\nconditional distribution of policies. The intricate nature of real-world\nscenarios, characterized by dynamic obstacles and maze-like structures,\nunderscores the complexity of robot local navigation decision-making as a\nconditional distribution problem. Nevertheless, leveraging the diffusion model\nfor robot local navigation is not trivial and encounters several under-explored\nchallenges: (1) Data Urgency. The complex conditional distribution in local\nnavigation needs training data to include diverse policy in diverse real-world\nscenarios; (2) Myopic Observation. Due to the diversity of the perception\nscenarios, diffusion decisions based on the local perspective of robots may\nprove suboptimal for completing the entire task, as they often lack foresight.\nIn certain scenarios requiring detours, the robot may become trapped. To\naddress these issues, our approach begins with an exploration of a diverse data\ngeneration mechanism that encompasses multiple agents exhibiting distinct\npreferences through target selection informed by integrated global-local\ninsights. Then, based on this diverse training data, a diffusion agent is\nobtained, capable of excellent collision avoidance in diverse scenarios.\nSubsequently, we augment our Local Diffusion Planner, also known as LDP by\nincorporating global observations in a lightweight manner. This enhancement\nbroadens the observational scope of LDP, effectively mitigating the risk of\nbecoming ensnared in local optima and promoting more robust navigational\ndecisions.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}