{"id":"2407.01583","title":"Optimal Low-Depth Quantum Signal-Processing Phase Estimation","authors":"Yulong Dong, Jonathan A. Gross, Murphy Yuezhen Niu","authorsParsed":[["Dong","Yulong",""],["Gross","Jonathan A.",""],["Niu","Murphy Yuezhen",""]],"versions":[{"version":"v1","created":"Mon, 17 Jun 2024 10:33:52 GMT"}],"updateDate":"2024-07-03","timestamp":1718620432000,"abstract":"  Quantum effects like entanglement and coherent amplification can be used to\ndrastically enhance the accuracy of quantum parameter estimation beyond\nclassical limits. However, challenges such as decoherence and time-dependent\nerrors hinder Heisenberg-limited amplification. We introduce Quantum\nSignal-Processing Phase Estimation algorithms that are robust against these\nchallenges and achieve optimal performance as dictated by the Cram\\'{e}r-Rao\nbound. These algorithms use quantum signal transformation to decouple\ninterdependent phase parameters into largely orthogonal ones, ensuring that\ntime-dependent errors in one do not compromise the accuracy of learning the\nother. Combining provably optimal classical estimation with near-optimal\nquantum circuit design, our approach achieves an unprecedented standard\ndeviation accuracy of $10^{-4}$ radians for estimating unwanted swap angles in\nsuperconducting two-qubit experiments, using low-depth ($<10$) circuits. This\nrepresents up to two orders of magnitude improvement over existing methods.\nTheoretically and numerically, we demonstrate the optimality of our algorithm\nagainst time-dependent phase errors, observing that the variance of the\ntime-sensitive parameter $\\varphi$ scales faster than the asymptotic Heisenberg\nscaling in the small-depth regime. Our results are rigorously validated against\nthe quantum Fisher information, confirming our protocol's ability to achieve\nunmatched precision for two-qubit gate learning.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis","Physics/Data Analysis, Statistics and Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}