{"id":"2407.13852","title":"SecureVAX: A Blockchain-Enabled Secure Vaccine Passport System","authors":"Debendranath Das, Sushmita Ruj and Subhamoy Maitra","authorsParsed":[["Das","Debendranath",""],["Ruj","Sushmita",""],["Maitra","Subhamoy",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 18:45:43 GMT"}],"updateDate":"2024-07-22","timestamp":1721328343000,"abstract":"  A vaccine passport serves as documentary proof, providing passport holders\nwith greater freedom while roaming around during pandemics. It confirms\nvaccination against certain infectious diseases like COVID-19, Ebola, and flu.\nThe key challenges faced by the digital vaccine passport system include\npassport forgery, unauthorized data access, and inaccurate information input by\nvaccination centers. Privacy concerns also need to be addressed to ensure that\nthe user's personal identification information (PII) is not compromised.\nAdditionally, it is necessary to track vaccine vials or doses to verify their\nauthenticity, prevent misuse and illegal sales, as well as to restrict the\nillicit distribution of vaccines. To address these challenges, we propose a\nBlockchain-Enabled Secure Vaccine Passport System, leveraging the power of\nsmart contracts. Our solution integrates off-chain and on-chain cryptographic\ncomputations, facilitating secure communication among various entities. We have\nutilized the InterPlanetary File System (IPFS) to store encrypted vaccine\npassports of citizens securely. Our prototype is built on the Ethereum\nplatform, with smart contracts deployed on the Sepolia Test network, allowing\nfor performance evaluation and validation of the system's effectiveness. By\ncombining IPFS as a distributed data storage platform and Ethereum as a\nblockchain platform, our solution paves the way for secure, efficient, and\nglobally interoperable vaccine passport management, supporting comprehensive\nvaccination initiatives worldwide.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Emerging Technologies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}