{"id":"2407.06518","title":"Graph Neural Networks and Deep Reinforcement Learning Based Resource\n  Allocation for V2X Communications","authors":"Maoxin Ji, Qiong Wu, Pingyi Fan, Nan Cheng, Wen Chen, Jiangzhou Wang,\n  Khaled B. Letaief","authorsParsed":[["Ji","Maoxin",""],["Wu","Qiong",""],["Fan","Pingyi",""],["Cheng","Nan",""],["Chen","Wen",""],["Wang","Jiangzhou",""],["Letaief","Khaled B.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 03:14:11 GMT"}],"updateDate":"2024-07-10","timestamp":1720494851000,"abstract":"  In the rapidly evolving landscape of Internet of Vehicles (IoV) technology,\nCellular Vehicle-to-Everything (C-V2X) communication has attracted much\nattention due to its superior performance in coverage, latency, and throughput.\nResource allocation within C-V2X is crucial for ensuring the transmission of\nsafety information and meeting the stringent requirements for ultra-low latency\nand high reliability in Vehicle-to-Vehicle (V2V) communication. This paper\nproposes a method that integrates Graph Neural Networks (GNN) with Deep\nReinforcement Learning (DRL) to address this challenge. By constructing a\ndynamic graph with communication links as nodes and employing the Graph Sample\nand Aggregation (GraphSAGE) model to adapt to changes in graph structure, the\nmodel aims to ensure a high success rate for V2V communication while minimizing\ninterference on Vehicle-to-Infrastructure (V2I) links, thereby ensuring the\nsuccessful transmission of V2V link information and maintaining high\ntransmission rates for V2I links. The proposed method retains the global\nfeature learning capabilities of GNN and supports distributed network\ndeployment, allowing vehicles to extract low-dimensional features that include\nstructural information from the graph network based on local observations and\nto make independent resource allocation decisions. Simulation results indicate\nthat the introduction of GNN, with a modest increase in computational load,\neffectively enhances the decision-making quality of agents, demonstrating\nsuperiority to other methods. This study not only provides a theoretically\nefficient resource allocation strategy for V2V and V2I communications but also\npaves a new technical path for resource management in practical IoV\nenvironments.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}