{"id":"2407.19053","title":"A Study of Using Multimodal LLMs for Non-Crash Functional Bug Detection\n  in Android Apps","authors":"Bangyan Ju, Jin Yang, Tingting Yu, Tamerlan Abdullayev, Yuanyuan Wu,\n  Dingbang Wang, Yu Zhao","authorsParsed":[["Ju","Bangyan",""],["Yang","Jin",""],["Yu","Tingting",""],["Abdullayev","Tamerlan",""],["Wu","Yuanyuan",""],["Wang","Dingbang",""],["Zhao","Yu",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 19:18:35 GMT"}],"updateDate":"2024-07-30","timestamp":1722021515000,"abstract":"  Numerous approaches employing various strategies have been developed to test\nthe graphical user interfaces (GUIs) of mobile apps. However, traditional GUI\ntesting techniques, such as random and model-based testing, primarily focus on\ngenerating test sequences that excel in achieving high code coverage but often\nfail to act as effective test oracles for non-crash functional (NCF) bug\ndetection. To tackle these limitations, this study empirically investigates the\ncapability of leveraging large language models (LLMs) to be test oracles to\ndetect NCF bugs in Android apps. Our intuition is that the training corpora of\nLLMs, encompassing extensive mobile app usage and bug report descriptions,\nenable them with the domain knowledge relevant to NCF bug detection. We\nconducted a comprehensive empirical study to explore the effectiveness of LLMs\nas test oracles for detecting NCF bugs in Android apps on 71 well-documented\nNCF bugs. The results demonstrated that LLMs achieve a 49% bug detection rate,\noutperforming existing tools for detecting NCF bugs in Android apps.\nAdditionally, by leveraging LLMs to be test oracles, we successfully detected\n24 previously unknown NCF bugs in 64 Android apps, with four of these bugs\nbeing confirmed or fixed. However, we also identified limitations of LLMs,\nprimarily related to performance degradation, inherent randomness, and false\npositives. Our study highlights the potential of leveraging LLMs as test\noracles for Android NCF bug detection and suggests directions for future\nresearch.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/"}