{"id":"2407.14740","title":"Attention-based SIC Ordering and Power Allocation for Non-orthogonal\n  Multiple Access Networks","authors":"Liang Huang, Bincheng Zhu, Runkai Nan, Kaikai Chi, Yuan Wu","authorsParsed":[["Huang","Liang",""],["Zhu","Bincheng",""],["Nan","Runkai",""],["Chi","Kaikai",""],["Wu","Yuan",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 03:36:43 GMT"}],"updateDate":"2024-07-23","timestamp":1721446603000,"abstract":"  Non-orthogonal multiple access (NOMA) emerges as a superior technology for\nenhancing spectral efficiency compared to orthogonal multiple access. In NOMA\nnetworks, successive interference cancellation (SIC) plays a crucial role in\ndecoding user signals sequentially. The challenge lies in the joint\noptimization of SIC ordering and power allocation, due to the factorial nature\nof ordering combinations. This study introduces an innovative solution, the\nAttention-based SIC Ordering and Power Allocation (ASOPA) framework, targeting\nan uplink NOMA network with dynamic SIC ordering. ASOPA aims to maximize\nweighted proportional fairness by employing deep reinforcement learning,\nstrategically decomposing the problem into two manageable subproblems: SIC\nordering optimization and optimal power allocation. Our approach utilizes an\nattention-based neural network, which processes instantaneous channel gains and\nuser weights to determine the SIC decoding sequence for each user. Once the SIC\nordering is established, the power allocation subproblem transforms into a\nconvex optimization problem, enabling efficient calculation. Extensive\nsimulations validate ASOPA's efficacy, demonstrating a performance closely\nparalleling the exhaustive method, with over 97% confidence in normalized\nnetwork utility. Notably, ASOPA maintains a low execution latency of\napproximately 50 milliseconds in a ten-user NOMA network, aligning with static\nSIC ordering algorithms. Furthermore, ASOPA demonstrates superior performance\nin various NOMA network configurations, including scenarios with imperfect\nchannel state information, multiple base stations, and multiple-antenna setups.\nSuch results underscore ASOPA's robustness and effectiveness, highlighting its\nability to excel across various NOMA network environments. The complete source\ncode for ASOPA is accessible at https://github.com/Jil-Menzerna/ASOPA.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}