{"id":"2407.11520","title":"The CARMENES search for exoplanets around M dwarfs. Revisiting the GJ\n  581 multi-planetary system with new Doppler measurements from CARMENES,\n  HARPS, and HIRES","authors":"A. von Stauffenberg, T. Trifonov, A. Quirrenbach, S. Reffert, A.\n  Kaminski, S. Dreizler, I. Ribas, A. Reiners, M. K\\\"urster, J. D. Twicken, D.\n  Rapetti, J. A. Caballero, P. J. Amado, V. J. S. B\\'ejar, C. Cifuentes, S.\n  G\\'ongora, A. P. Hatzes, Th. Henning, D. Montes, J. C. Morales, and A.\n  Schweitzer","authorsParsed":[["von Stauffenberg","A.",""],["Trifonov","T.",""],["Quirrenbach","A.",""],["Reffert","S.",""],["Kaminski","A.",""],["Dreizler","S.",""],["Ribas","I.",""],["Reiners","A.",""],["Kürster","M.",""],["Twicken","J. D.",""],["Rapetti","D.",""],["Caballero","J. A.",""],["Amado","P. J.",""],["Béjar","V. J. S.",""],["Cifuentes","C.",""],["Góngora","S.",""],["Hatzes","A. P.",""],["Henning","Th.",""],["Montes","D.",""],["Morales","J. C.",""],["Schweitzer","A.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 08:59:52 GMT"}],"updateDate":"2024-07-18","timestamp":1721120392000,"abstract":"  GJ 581 is a nearby M dwarf known to host a packed multiple planet system with\n2 super-Earths and a Neptune-mass planet. We present new orbital analyses of\nthe system, utilizing recent RV data obtained from the CARMENES spectrograph\ncombined with newly reprocessed archival data from the HARPS and HIRES\nspectrographs. Our aim was to analyze the post-discovery spectroscopic data of\nGJ 581, which were obtained with CARMENES. In addition, we used publicly\navailable HIRES and HARPS spectroscopic data to seek evidence of the known and\ndisputed exoplanets in this system. We aimed to investigate the stellar\nactivity of GJ 581 and update the planetary system's orbital parameters using\nstate-of-the-art numerical models and techniques. We performed a periodogram\nanalysis of the available precise CARMENES, HIRES, and HARPS RVs and of stellar\nactivity indicators. We conducted detailed orbital analyses by testing various\norbital configurations consistent with the RV data. We studied the posterior\nprobability distribution of the parameters fit to the data and explored the\nlong-term stability and overall orbital dynamics of the system. We refined the\norbital parameters of the system using the most precise and complete set of\nDoppler data available. Consistent with the existing literature, we confirm\nthat the system is unequivocally composed of only 3 planets detectable in the\npresent data, dismissing the putative planet GJ 581 d as an artifact of stellar\nactivity. Our N-body fit reveals that the system's inclination is i $=$ 47.0\ndeg, which implies that the planets could be up to 30% more massive than their\npreviously reported minimum masses. Furthermore, we report that the system\nexhibits long-term stability, as indicated by the posterior probability\ndistribution, characterized by secular dynamical interactions without the\ninvolvement of mean motion resonances.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}