{"id":"2407.17094","title":"Resource Allocation for 5G-UAV Based Emergency Wireless Communications","authors":"Zhuohui Yao, Wenchi Cheng, Wei Zhang, Hailin Zhang","authorsParsed":[["Yao","Zhuohui",""],["Cheng","Wenchi",""],["Zhang","Wei",""],["Zhang","Hailin",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 08:42:34 GMT"}],"updateDate":"2024-07-25","timestamp":1721810554000,"abstract":"  For unforeseen natural disasters, such as earthquakes, hurricanes, and\nfloods, etc., the traditional communication infrastructure is unavailable or\nseriously disrupted along with persistent secondary disasters. Under such\ncircumstances, it is highly demanded to deploy emergency wireless communication\n(EWC) networks to restore connectivity in accident/incident areas. The emerging\nfifth-generation (5G)/beyond-5G (B5G) wireless communication system, like\nunmanned aerial vehicle (UAV) assisted networks and intelligent reflecting\nsurface (IRS) based communication systems, are expected to be designed or\nre-farmed for supporting temporary high quality communications in post-disaster\nareas. However, the channel characteristics of post-disaster areas quickly\nchange as the secondary disaster resulted topographical changes, imposing new\nbut critical challenges for EWC networks. In this paper, we propose a novel\nheterogeneous $\\mathcal{F}$ composite fading channel model for EWC networks\nwhich accurately models and characterizes the composite fading channel with\nreflectors, path-loss exponent, fading, and shadowing parameters in 5G-UAV\nbased EWC networks. Based on the model, we develop the optimal power allocation\nscheme with the simple closed-form expression and the numerical results based\noptimal joint bandwidth-power allocation scheme. We derive the corresponding\ncapacities and compare the energy efficiency between IRS and traditional relay\nbased 5G-UAVs. Numerical results show that the new heterogeneous\nFisher-Snedecor $\\mathcal{F}$ composite fading channel adapted resource\nallocation schemes can achieve higher capacity and energy efficiency than those\nof traditional channel model adapted resource allocation schemes, thus\nproviding better communications service for post-disaster areas.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}