{"id":"2407.09066","title":"Physical encryption and decryption for secure data transmission in\n  optical networks leveraging the temporal Talbot effect and microwave\n  photonics","authors":"Chulun Lin, Taixia Shi, Yiqing Liu, Yang Chen","authorsParsed":[["Lin","Chulun",""],["Shi","Taixia",""],["Liu","Yiqing",""],["Chen","Yang",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 07:40:22 GMT"}],"updateDate":"2024-07-15","timestamp":1720770022000,"abstract":"  A novel microwave photonic scheme for secure data transmission in optical\nnetworks is proposed. The security of the scheme is guaranteed by physical\nencryption and decryption via the temporal Talbot effect in dispersive mediums.\nFirst, the original data is randomized in the digital domain by performing an\nexclusive OR operation using a random matrix. Subsequently, a time-varying\nmulti-tone electrical signal, which represents the randomized data matrix, is\nmodulated onto an optical carrier. The optical signal after modulation is then\nphase-modulated by a temporal Talbot array illuminator (TAI) signal, and the\noptical signal after discrete quadratic phase modulation will lose its original\nappearance in the frequency domain and be further dispersed in the first\ndispersive medium. Due to the dispersion that does not match the TAI signal\nexactly, the waveform after the first dispersive medium is a noise-like signal.\nHence, the physical encryption of the original data is successfully achieved.\nAs the optical signal passes a second dispersive medium that makes the total\ndispersion match the TAI signal, the temporal waveform of the noise-like signal\nafter photodetection is transformed into pulses. \"1\" and \"0\" in the randomized\ndata matrix are represented through the presence and absence of pulses, and the\nphysical decryption is achieved. By further processing the recovered data\nmatrix using the random matrix, the original data can be recovered. The\nphysical layer security of the proposed scheme and its fiber transmission\ncapability are demonstrated. 8-Gbit/s data is transmitted, encrypted, and\ndecrypted using two dispersive mediums and an optical fiber of 10 to 200 km,\nand error-free transmission is achieved. Many factors that affect the\nencryption, decryption, and transmission performance of the system have been\nanalyzed.\n","subjects":["Physics/Optics","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}