{"id":"2407.08424","title":"Semantic Feature Division Multiple Access for Multi-user Digital\n  Interference Networks","authors":"Shuai Ma, Chuanhui Zhang, Bin Shen, Youlong Wu, Hang Li, Shiyin Li,\n  Guangming Shi, and Naofal Al-Dhahir","authorsParsed":[["Ma","Shuai",""],["Zhang","Chuanhui",""],["Shen","Bin",""],["Wu","Youlong",""],["Li","Hang",""],["Li","Shiyin",""],["Shi","Guangming",""],["Al-Dhahir","Naofal",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 12:03:56 GMT"}],"updateDate":"2024-07-12","timestamp":1720699436000,"abstract":"  With the ever-increasing user density and quality of service (QoS) demand,5G\nnetworks with limited spectrum resources are facing massive access challenges.\nTo address these challenges, in this paper, we propose a novel discrete\nsemantic feature division multiple access (SFDMA) paradigm for multi-user\ndigital interference networks. Specifically, by utilizing deep learning\ntechnology, SFDMA extracts multi-user semantic information into discrete\nrepresentations in distinguishable semantic subspaces, which enables multiple\nusers to transmit simultaneously over the same time-frequency resources.\nFurthermore, based on a robust information bottleneck, we design a SFDMA based\nmulti-user digital semantic interference network for inference tasks, which can\nachieve approximate orthogonal transmission. Moreover, we propose a SFDMA based\nmulti-user digital semantic interference network for image reconstruction\ntasks, where the discrete outputs of the semantic encoders of the users are\napproximately orthogonal, which significantly reduces multi-user interference.\nFurthermore, we propose an Alpha-Beta-Gamma (ABG) formula for semantic\ncommunications, which is the first theoretical relationship between inference\naccuracy and transmission power. Then, we derive adaptive power control methods\nwith closed-form expressions for inference tasks. Extensive simulations verify\nthe effectiveness and superiority of the proposed SFDMA.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}