{"id":"2407.13754","title":"On the consistency of rotation curves and spatially integrated HI flux\n  profiles","authors":"Tariq Yasin, Harry Desmond","authorsParsed":[["Yasin","Tariq",""],["Desmond","Harry",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:55:08 GMT"}],"updateDate":"2024-07-19","timestamp":1721325308000,"abstract":"  Resolved rotation curves (RCs) are the gold-standard measurements for\ninferring dark matter distributions in $\\Lambda$CDM and testing alternative\ntheories of dynamics in galaxies. However they are expensive to obtain, making\nthem prohibitive for large galaxy samples and at higher redshift. Spatially\nintegrated HI flux profiles are more accessible and present the information in\na different form, but -- except in a highly compressed form, as linewidths --\nhave not so far been compared in detail with RCs or employed for dynamical\ninferences. Here we study the consistency of RCs and HI surface density\nprofiles from SPARC with spatially integrated HI flux profiles from ALFALFA, by\ncombining the resolved properties in a forward model for the flux profile. We\ndefine a new metric for asymmetry in the flux profiles, enabling us to cleanly\nidentify those unsuitable for our axisymmetric method. Among all SPARC galaxies\nthe agreement between RCs and flux profiles is satisfactory within the\nlimitations of the data -- with most galaxies having an uncertainty normalised\nmean squared error (MSE) below 10 -- while no galaxy deemed symmetric has a MSE\nabove 1.2. Most cases of good agreement prefer a HI gas dispersion\n$\\sigma_{\\mathrm{HI}}$ of ~13 km/s, consistent with resolved studies of gas\ndispersion from the literature. These results open the door for spatially\nintegrated HI flux profiles to be used as proxies for spatially resolved\ndynamics, including a robust appraisal of the degree of asymmetry.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}