{"id":"2407.19631","title":"\"A Good Bot Always Knows Its Limitations\": Assessing Autonomous System\n  Decision-making Competencies through Factorized Machine Self-confidence","authors":"Brett Israelsen, Nisar R. Ahmed, Matthew Aitken, Eric W. Frew, Dale A.\n  Lawrence, Brian M. Argrow","authorsParsed":[["Israelsen","Brett",""],["Ahmed","Nisar R.",""],["Aitken","Matthew",""],["Frew","Eric W.",""],["Lawrence","Dale A.",""],["Argrow","Brian M.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 01:22:04 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 17:10:43 GMT"}],"updateDate":"2024-08-05","timestamp":1722216124000,"abstract":"  How can intelligent machines assess their competencies in completing tasks?\nThis question has come into focus for autonomous systems that algorithmically\nreason and make decisions under uncertainty. It is argued here that machine\nself-confidence - a form of meta-reasoning based on self-assessments of an\nagent's knowledge about the state of the world and itself, as well as its\nability to reason about and execute tasks - leads to many eminently computable\nand useful competency indicators for such agents. This paper presents a\nculmination of work on this concept in the form of a computational framework\ncalled Factorized Machine Self-confidence (FaMSeC), which provides a holistic\nengineering-focused description of factors driving an algorithmic\ndecision-making process, including: outcome assessment, solver quality, model\nquality, alignment quality, and past experience. In FaMSeC, self confidence\nindicators are derived from hierarchical `problem-solving statistics' embedded\nwithin broad classes of probabilistic decision-making algorithms such as Markov\ndecision processes. The problem-solving statistics are obtained by evaluating\nand grading probabilistic exceedance margins with respect to given competency\nstandards, which are specified for each of the various decision-making\ncompetency factors by the informee (e.g. a non-expert user or an expert system\ndesigner). This approach allows `algorithmic goodness of fit' evaluations to be\neasily incorporated into the design of many kinds of autonomous agents in the\nform of human-interpretable competency self-assessment reports. Detailed\ndescriptions and application examples for a Markov decision process agent show\nhow two of the FaMSeC factors (outcome assessment and solver quality) can be\ncomputed and reported for a range of possible tasking contexts through novel\nuse of meta-utility functions, behavior simulations, and surrogate prediction\nmodels.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}