{"id":"2407.09753","title":"Biased Backpressure Routing Using Link Features and Graph Neural\n  Networks","authors":"Zhongyuan Zhao, Bojan Radoji\\v{c}i\\'c, Gunjan Verma, Ananthram Swami,\n  Santiago Segarra","authorsParsed":[["Zhao","Zhongyuan",""],["Radojičić","Bojan",""],["Verma","Gunjan",""],["Swami","Ananthram",""],["Segarra","Santiago",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 03:09:22 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 20:57:17 GMT"}],"updateDate":"2024-09-16","timestamp":1720840162000,"abstract":"  To reduce the latency of Backpressure (BP) routing in wireless multi-hop\nnetworks, we propose to enhance the existing shortest path-biased BP (SP-BP)\nand sojourn time-based backlog metrics, since they introduce no additional time\nstep-wise signaling overhead to the basic BP. Rather than relying on\nhop-distance, we introduce a new edge-weighted shortest path bias built on the\nscheduling duty cycle of wireless links, which can be predicted by a graph\nconvolutional neural network based on the topology and traffic of wireless\nnetworks. Additionally, we tackle three long-standing challenges associated\nwith SP-BP: optimal bias scaling, efficient bias maintenance, and integration\nof delay awareness. Our proposed solutions inherit the throughput optimality of\nthe basic BP, as well as its practical advantages of low complexity and fully\ndistributed implementation. Our approaches rely on common link features and\nintroduces only a one-time constant overhead to previous SP-BP schemes, or a\none-time overhead linear in the network size to the basic BP. Numerical\nexperiments show that our solutions can effectively address the major drawbacks\nof slow startup, random walk, and the last packet problem in basic BP,\nimproving the end-to-end delay of existing low-overhead BP algorithms under\nvarious settings of network traffic, interference, and mobility.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}