{"id":"2407.14830","title":"Metal-silicate mixing in planetesimal collisions","authors":"Kang Shuai, Christoph M. Sch\\\"afer, Christoph Burger, Hejiu Hui","authorsParsed":[["Shuai","Kang",""],["Schäfer","Christoph M.",""],["Burger","Christoph",""],["Hui","Hejiu",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 10:17:31 GMT"}],"updateDate":"2024-07-23","timestamp":1721470651000,"abstract":"  Impacts between differentiated planetesimals are ubiquitous in protoplanetary\ndiscs and may mix materials from the core, mantle, and crust of planetesimals,\nthus forming stony-iron meteorites. The surface composition of the asteroid\n(16) Psyche represents a mixture of metal and non-metal components. However,\nthe velocities, angles, and outcome regimes of impacts that mixed metal and\nsilicate from different layers of planetesimals are debated. Our aim is to\ninvestigate the impacts between planetesimals that can mix large amounts of\nmetal and silicate, and the mechanism of stony-iron meteorite formation. We\nused smooth particle hydrodynamics to simulate the impacts between\ndifferentiated planetesimals with various initial conditions that span\ndifferent outcome regimes. In our simulations, the material strength was\nincluded and the effects of the states of planetesimal cores were studied.\nUsing a statistical approach, we quantitatively analysed the distributions of\nmetal and silicate after impacts. Our simulations modelled the mass, depth, and\nsources of the metal-silicate mixture in different impact conditions. Our\nresults suggest that the molten cores in planetesimals could facilitate mixing\nof metal and silicate. Large amounts of the metal-silicate mixture could be\nproduced by low-energy accretional impacts and high-energy erosive impacts in\nthe largest impact remnant, and by hit-and-run and erosive impacts in the\nsecond-largest impact remnant. After impact, most of the metal-silicate mixture\nwas buried at depth, consistent with the low cooling rates of stony-iron\nmeteorites. Our results indicate that mesosiderites potentially formed in an\nerosive impact, while pallasites potentially formed in an accretional or\nhit-and-run impact. The mixing of metal and non-metal components on Psyche may\nalso be the result of impacts.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}