{"id":"2407.13030","title":"Socially Assistive Robot in Sexual Health: Group and Individual\n  Student-Robot Interaction Activities Promoting Disclosure, Learning and\n  Positive Attitudes","authors":"Anna-Maria Velentza (1 and 2), Efthymia Kefalouka (1) and Nikolaos\n  Fachantidis (1 and 2) ((1) School of Educational & Social Policies,\n  University of Macedonia, GR, (2) Laboratory of Informatics and Robotics\n  Applications in Education and Society (LIRES), University of Macedonia, GR)","authorsParsed":[["Velentza","Anna-Maria","","1 and 2"],["Kefalouka","Efthymia","","1 and 2"],["Fachantidis","Nikolaos","","1 and 2"]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 21:36:21 GMT"}],"updateDate":"2024-07-19","timestamp":1721252181000,"abstract":"  Comprehensive sex education (SE) is crucial in promoting sexual health and\nresponsible behavior among students, particularly in elementary schools.\nDespite its significance, teaching SE can be challenging due to students'\nattitudes, shyness, and emotional barriers. Socially assistive robots (SARs)\nsometimes are perceived as more trustworthy than humans, based on research\nshowing that they are not anticipated as judgmental. Inspired by those\nevidences, this study aims to assess the success of a SAR as a facilitator for\nSE lessons for elementary school students. This study conducted two experiments\nto assess the effectiveness of a SAR in facilitating SE education for\nelementary school students. We conducted two experiments, a) a group activity\nin the school classroom where the Nao robot gave a SE lecture, and we evaluated\nhow much information the students acquired from the lecture, and b) an\nindividual activity where the students interacted 1:1 with the robot, and we\nevaluated their attitudes towards the subject of SE, and if they felt\ncomfortable to ask SE related questions to the robot. Data collected from pre-\nand post-questionnaires, as well as video annotations, revealed that the SAR\nsignificantly improved students' attitudes toward SE. Furthermore, students\nwere more open to asking SE-related questions to the robot than their human\nteacher. The study emphasized specific SAR characteristics, such as embodiment\nand non-judgmental behavior, as key factors contributing to their effectiveness\nin supporting SE education, paving the way for innovative and effective\napproaches to sexual education in schools.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}