{"id":"2407.20483","title":"Extragalactic Stellar Tidal Streams in the Dark Energy Survey","authors":"Juan Miro-Carretero, David Martinez-Delgado, Maria A. Gomez-Flechoso,\n  Andrew Cooper, Mohammad Akhlaghi, Giuseppe Donatiello, Konrad Kuijken, Dmitry\n  Makarov, Seppo Laine, Santi Roca-Fabrega","authorsParsed":[["Miro-Carretero","Juan",""],["Martinez-Delgado","David",""],["Gomez-Flechoso","Maria A.",""],["Cooper","Andrew",""],["Akhlaghi","Mohammad",""],["Donatiello","Giuseppe",""],["Kuijken","Konrad",""],["Makarov","Dmitry",""],["Laine","Seppo",""],["Roca-Fabrega","Santi",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 01:05:56 GMT"}],"updateDate":"2024-07-31","timestamp":1722301556000,"abstract":"  Stellar tidal streams are a key tracer of galaxy evolution and have the\npotential to provide an indirect means for tracing dark matter. For the Local\nGroup, many diffuse substructures have been identified and their link to galaxy\nevolution has been traced. However, an analysis of a larger sample is required\nto better probe the frequency and characteristics of these streams to verify\nthe predictions of the Lambda-CDM model and its implementation in cosmological\nsimulations. For that purpose, we are carrying out the first systematic survey\nof faint stellar debris from tidally disrupted dwarf satellites around nearby\ngalaxies up to a distance of 100 Mpc. In this paper, we present a catalogue\nwith the results of the first harvest of stellar tidal streams found by visual\ninspection in deep images of ~ 700 galaxies from the Dark Energy Survey (DES).\nWe include a photometric characterisation of the streams obtained by measuring\ntheir surface brightnesses and colours. We found a total of 63 streams in our\nsample at distances between 40 and 100 Mpc, including 59 which were not\npreviously reported. We measured their average surface brightness for the grz\nbands, to be 28.35+/-0.20, 27.81+/-0.13 and 27.62+/-0.09 mag arcsec^-2,\nrespectively. By applying a statistical analysis to our findings, we obtained a\nstream detection frequency of 9.1% +/- 1.1% , in agreement with previous\nstudies. We identified stream progenitors in 5-14% of our stream sample,\ndepending on the confidence level. The first catalogue of streams in the Local\nUniverse presented here will be complemented by future stream surveys within\nthe Stellar Stream Legacy Survey. In this work we have learnt that the faintest\nmeasured stream surface brightness can be significantly brighter than the\nsurface brightness limit of an image measured at pixel level, mainly due to\ncorrelated noise present in the images.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}