{"id":"2407.05447","title":"Spatzformer: An Efficient Reconfigurable Dual-Core RISC-V V Cluster for\n  Mixed Scalar-Vector Workloads","authors":"Matteo Perotti, Michele Raeber, Mattia Sinigaglia, Matheus Cavalcante,\n  Davide Rossi, Luca Benini","authorsParsed":[["Perotti","Matteo",""],["Raeber","Michele",""],["Sinigaglia","Mattia",""],["Cavalcante","Matheus",""],["Rossi","Davide",""],["Benini","Luca",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 17:15:36 GMT"}],"updateDate":"2024-07-09","timestamp":1720372536000,"abstract":"  Multi-core vector processor architectures excel in handling computationally\nintensive vectorizable tasks but struggle to achieve optimal resource\nutilization when facing sequential and control tasks that cannot be vectorized.\nThis work presents Spatzformer, the first reconfigurable RISC-V V (RVV)\narchitecture developed from a baseline open-source dual-core cluster based on\nSnitch scalar cores augmented with compact Spatz vector units. Spatzformer\noperates in two distinct modes: split mode, working as a dual-core vector\narchitecture to handle vectorizable tasks concurrently, and merge mode, where\ntwo vector units are driven by a single scalar core, allowing the remaining\nscalar core to handle non-vectorizable control tasks. We implement Spatzformer\nin a 12-nm technology node and characterize the cost of the added architectural\nreconfigurability. We show that merge mode accelerates mixed scalar-vector\nkernels by up to 1.8x compared to split mode. Moreover, it accelerates the\nvector kernels that require fine-grained synchronization (such as FFT) by up to\n20% with respect to the baseline. The reconfigurability features do not degrade\nthe architecture's maximum frequency (1.2GHz, TT, 0.8V, 25C) and have a\nnegligible area impact (+1.4%), with a worst-case energy efficiency drop of\nonly 7% with respect to the non-reconfigurable baseline.\n","subjects":["Computing Research Repository/Hardware Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}