{"id":"2407.02297","title":"Systematics in ETG Mass Profile Modelling: Strong Lensing & Stellar\n  Dynamics","authors":"Carlos R. Melo-Carneiro (1), Cristina Furlanetto (1), Ana L.\n  Chies-Santos (1) ((1) UFRGS, Porto Alegre, Brazil)","authorsParsed":[["Melo-Carneiro","Carlos R.","","UFRGS, Porto Alegre, Brazil"],["Furlanetto","Cristina","","UFRGS, Porto Alegre, Brazil"],["Chies-Santos","Ana L.","","UFRGS, Porto Alegre, Brazil"]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 14:30:28 GMT"}],"updateDate":"2024-07-03","timestamp":1719930628000,"abstract":"  Strong gravitational lensing and stellar dynamics are independent and\npowerful methods to probe the total gravitational potential of galaxies, and\nthus, their total mass profile. However, inherent degeneracies in the\nindividual models makes it difficult to obtain a full understanding of the\ndistribution of baryons and dark matter (DM), although such degeneracies might\nbe broken by the combination of these two tracers, leading to more reliable\nmeasurements of the mass distribution of the lens galaxy. We use mock data from\nIllustrisTNG50 to compare how dynamical-only, lens-only, and joint modelling\ncan constrain the mass distribution of early-type galaxies (ETGs). The joint\nmodel consistently outperforms the other models, achivieng a $2\\%$ accuracy in\nrecovering the total mass within $2.5R_\\text{eff}$. The Einstein radius is\nrobustly recovered for both lens-only and joint models, with the first showing\na median fractional error of $-5\\%$ and the latter a fractional error\nconsistent with zero. The stellar mass-to-light ratio and total mass density\nslope are well recovered by all models. In particular, the dynamical-only model\nachieves an accuracy of $1\\%$ for the stellar mass-to-light ratio, while the\naccuracy of the mass density slope is typically of the order of $5\\%$ for all\nmodels. However, all models struggle to constrain integrated quantities\ninvolving DM and the halo parameters. Nevertheless, imposing more restrictive\nassumptions on the DM halo, such as fixing the scale radius, could alleviate\nsome of the issues. Finally, we verify that the number of kinematical\nconstraints ($15, 35, 55$ bins) on the kinematical map does not impact the\nmodels outcomes.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}