{"id":"2407.06816","title":"Probing a quantum spin liquid with equilibrium and non-equilibrium hole\n  dynamics","authors":"J. H. Nyhegn, K. Knakkergaard Nielsen, and G. M. Bruun","authorsParsed":[["Nyhegn","J. H.",""],["Nielsen","K. Knakkergaard",""],["Bruun","G. M.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 12:49:09 GMT"}],"updateDate":"2024-07-10","timestamp":1720529349000,"abstract":"  The properties and experimental identification of quantum spin liquids (QSL)\nremains an important topic with many fundamental questions. Here, we explore\nthe dynamics of a single charge dopant (hole) in a $t$-$J_{1}$-$J_{2}$ model on\na square lattice, which realises a gapless $\\mathbb{Z}_2$ QSL at half-filling.\nUsing a field theory approach based on the parton construction, which includes\nan infinite number of scatterings between the low-energy quasiparticle\nexcitations of the QSL via a self-consistent Born approximation, we calculate\nboth the equilibrium and non-equilibrium properties of the hole for weak and\nstrong interactions. Quasiparticle branches as well as string-like excitations\nof the hole are identified, and we furthermore explore the time-dependent\nspreading of a hole throughout the QSL after it has been injected at a given\nlattice site. The final ballistic expension speed is shown to exhibit a\nnon-monotonic behavior as a quantum phase transition between an\nantiferromagnetic (AFM) and the QSL phase is crossed, which is caused by a\nqualitative change in the fundamental kinematics of the interactions between\nthe hole and the surrounding spins. Our results demonstrate how charge dopants\ncan be used as a quantum probe for QSLs and are directly relevant to optical\nlattice experiments with single site resolution, as well as the rapidly\nincreasingly number of new quanum materials such as transition metal\ndichacogenides.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/"}