{"id":"2407.16100","title":"Koopman Analytical Modeling of Position and Attitude Dynamics: a Case\n  Study for Quadrotor Control","authors":"Simone Martini, Kimon P. Valavanis, Margareta Stefanovic","authorsParsed":[["Martini","Simone",""],["Valavanis","Kimon P.",""],["Stefanovic","Margareta",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 00:01:14 GMT"}],"updateDate":"2024-07-24","timestamp":1721692874000,"abstract":"  This research presents a novel, analytical, Koopman Operator based\nformulation for position and attitude dynamics which can be used to derive\ncontrol strategies for underactuated systems. Compared to data driven Koopman\nbased techniques, the analytical approach presented in this work is model based\nand allows for an exact linear representation of the original nonlinear\nposition and attitude dynamics. In fact, the resulting infinite dimensional\nmodel, defined in the lifted state space, is linear in the autonomous component\nand state dependent in the control. A boundary study is carried on to define\nthe range of validity of the finite truncation of the Koopman based model\nfollowed by a controllability and stabilizability analysis to show the\nfeasibility of employing the derived model for control system design. Compared\nto existing literature formulation, the presented model results in a better\napproximation of the original dyanmics using a more compact truncation of the\nlifted state space. Moreover, the model is derived using the Koopman approach\non the entirety of the dynamics and does not require the need of angular\nvelocity dynamic compensation. A case study involving an underactuated\nquadrotor unmanned aerial vehicle (UAV) is provided to show that, for practical\nuse, a truncated subset of the infinite dimensional model, embeds most of the\noriginal nonlinear dynamics and can be used to design linear control strategies\nin the lifted space which results in nonlinear controllers in the original\nstate space. The main advantages of the presented approach reside in the\neffective use of linear control strategies for nonlinear plats and the solution\nof the underactuation problem employing a single control loop.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}