{"id":"2407.07739","title":"UAV-assisted Unbiased Hierarchical Federated Learning: Performance and\n  Convergence Analysis","authors":"Ruslan Zhagypar, Nour Kouzayha, Hesham ElSawy, Hayssam Dahrouj, Tareq\n  Y. Al-Naffouri","authorsParsed":[["Zhagypar","Ruslan",""],["Kouzayha","Nour",""],["ElSawy","Hesham",""],["Dahrouj","Hayssam",""],["Al-Naffouri","Tareq Y.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 06:23:01 GMT"}],"updateDate":"2024-07-11","timestamp":1720160581000,"abstract":"  The development of the sixth generation (6G) of wireless networks is bound to\nstreamline the transition of computation and learning towards the edge of the\nnetwork. Hierarchical federated learning (HFL) becomes, therefore, a key\nparadigm to distribute learning across edge devices to reach global\nintelligence. In HFL, each edge device trains a local model using its\nrespective data and transmits the updated model parameters to an edge server\nfor local aggregation. The edge server, then, transmits the locally aggregated\nparameters to a central server for global model aggregation. The unreliability\nof communication channels at the edge and backhaul links, however, remains a\nbottleneck in assessing the true benefit of HFL-empowered systems. To this end,\nthis paper proposes an unbiased HFL algorithm for unmanned aerial vehicle\n(UAV)-assisted wireless networks that counteracts the impact of unreliable\nchannels by adjusting the update weights during local and global aggregations\nat UAVs and terrestrial base stations (BS), respectively. To best characterize\nthe unreliability of the channels involved in HFL, we adopt tools from\nstochastic geometry to determine the success probabilities of the local and\nglobal model parameter transmissions. Accounting for such metrics in the\nproposed HFL algorithm aims at removing the bias towards devices with better\nchannel conditions in the context of the considered UAV-assisted network.. The\npaper further examines the theoretical convergence guarantee of the proposed\nunbiased UAV-assisted HFL algorithm under adverse channel conditions. One of\nthe developed approach's additional benefits is that it allows for optimizing\nand designing the system parameters, e.g., the number of UAVs and their\ncorresponding heights. The paper results particularly highlight the\neffectiveness of the proposed unbiased HFL scheme as compared to conventional\nFL and HFL algorithms.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Machine Learning","Computing Research Repository/Networking and Internet Architecture","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}