{"id":"2407.06557","title":"Comparison of Optimizers for Fault Isolation and Diagnostics of Control\n  Rod Drives","authors":"Ark Ifeanyi and Jamie Coble","authorsParsed":[["Ifeanyi","Ark",""],["Coble","Jamie",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 05:21:04 GMT"}],"updateDate":"2024-07-15","timestamp":1720502464000,"abstract":"  This paper explores the optimization of fault detection and diagnostics (FDD)\nin the Control Rod Drive System (CRDS) of GE-Hitachi's BWRX-300 small modular\nreactor (SMR), focusing on the electrically powered fine motion control rod\ndrive (FMCRD) servomotors. Leveraging the coordinated motion of multiple FMCRDs\nfor control rod adjustments, the study proposes a deep learning approach,\nutilizing one-dimensional convolutional neural network (1D CNN)-based\nautoencoders for anomaly detection and encoder-decoder structured 1D CNN\nclassifiers for fault classification. Simulink models simulate normal and fault\noperations, monitoring electric current and electromagnetic torque. The\ntraining of the fault isolation and fault classification models is optimized.\nVarious optimizers, including Adaptive Moment Estimation (Adam), Nesterov Adam\n(Nadam), Stochastic Gradient Descent (SGD), and Root Mean Square Propagation\n(RMSProp), are evaluated, with Nadam demonstrating a relatively superior\nperformance across the isolation and classification tasks due to its adaptive\ngradient and Nesterov components. The research underscores the importance of\nconsidering the number of runs (each run has a different set of initial model\nparameters) as a hyperparameter during empirical optimizer comparisons and\ncontributes insights crucial for enhancing FDD in SMR control systems and for\nthe application of 1D CNN to FDD.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5MI9ZX5zREdOEWLsmQF6-x5sEYbJJiwQiMjJSL_zBCY","pdfSize":"1539136"}
