{"id":"2407.01757","title":"Distributed Instruments for Planetary Surface Science: Scientific\n  Opportunities and Technology Feasibility","authors":"Federico Rossi and Robert C. Anderson and Saptarshi Bandyopadhyay and\n  Erik Brandon and Ashish Goel and Joshua Vander Hook and Michael Mischna and\n  Michaela Villarreal and Mark Wronkiewicz","authorsParsed":[["Rossi","Federico",""],["Anderson","Robert C.",""],["Bandyopadhyay","Saptarshi",""],["Brandon","Erik",""],["Goel","Ashish",""],["Hook","Joshua Vander",""],["Mischna","Michael",""],["Villarreal","Michaela",""],["Wronkiewicz","Mark",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 19:41:41 GMT"}],"updateDate":"2024-07-03","timestamp":1719862901000,"abstract":"  In this paper, we assess the scientific promise and technology feasibility of\ndistributed instruments for planetary science. A distributed instrument is an\ninstrument designed to collect spatially and temporally correlated data from\nmultiple networked, geographically distributed point sensors. Distributed\ninstruments are ubiquitous in Earth science, where they are routinely employed\nfor weather and climate science, seismic studies and resource prospecting, and\ndetection of industrial emissions. However, to date, their adoption in\nplanetary surface science has been minimal. It is natural to ask whether this\nlack of adoption is driven by low potential to address high-priority questions\nin planetary science; immature technology; or both. To address this question,\nwe survey high-priority planetary science questions that are uniquely\nwell-suited to distributed instruments. We identify four areas of research\nwhere distributed instruments hold promise to unlock answers that are largely\ninaccessible to monolithic sensors, namely, weather and climate studies of\nMars; localization of seismic events on rocky and icy bodies; localization of\ntrace gas emissions, primarily on Mars; and magnetometry studies of internal\ncomposition. Next, we survey enabling technologies for distributed sensors and\nassess their maturity. We identify sensor placement (including descent and\nlanding on planetary surfaces), power, and instrument autonomy as three key\nareas requiring further investment to enable future distributed instruments.\nOverall, this work shows that distributed instruments hold great promise for\nplanetary science, and paves the way for follow-on studies of future\ndistributed instruments for Solar System in-situ science.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics","Computing Research Repository/Multiagent Systems","Physics/Atmospheric and Oceanic Physics","Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}