{"id":"2407.06612","title":"AI-based Automatic Segmentation of Prostate on Multi-modality Images: A\n  Review","authors":"Rui Jin, Derun Li, Dehui Xiang, Lei Zhang, Hailing Zhou, Fei Shi,\n  Weifang Zhu, Jing Cai, Tao Peng, Xinjian Chen","authorsParsed":[["Jin","Rui",""],["Li","Derun",""],["Xiang","Dehui",""],["Zhang","Lei",""],["Zhou","Hailing",""],["Shi","Fei",""],["Zhu","Weifang",""],["Cai","Jing",""],["Peng","Tao",""],["Chen","Xinjian",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 07:36:18 GMT"}],"updateDate":"2024-07-10","timestamp":1720510578000,"abstract":"  Prostate cancer represents a major threat to health. Early detection is vital\nin reducing the mortality rate among prostate cancer patients. One approach\ninvolves using multi-modality (CT, MRI, US, etc.) computer-aided diagnosis\n(CAD) systems for the prostate region. However, prostate segmentation is\nchallenging due to imperfections in the images and the prostate's complex\ntissue structure. The advent of precision medicine and a significant increase\nin clinical capacity have spurred the need for various data-driven tasks in the\nfield of medical imaging. Recently, numerous machine learning and data mining\ntools have been integrated into various medical areas, including image\nsegmentation. This article proposes a new classification method that\ndifferentiates supervision types, either in number or kind, during the training\nphase. Subsequently, we conducted a survey on artificial intelligence\n(AI)-based automatic prostate segmentation methods, examining the advantages\nand limitations of each. Additionally, we introduce variants of evaluation\nmetrics for the verification and performance assessment of the segmentation\nmethod and summarize the current challenges. Finally, future research\ndirections and development trends are discussed, reflecting the outcomes of our\nliterature survey, suggesting high-precision detection and treatment of\nprostate cancer as a promising avenue.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}