{"id":"2407.21421","title":"Axion-like Particle Effects on Photon Polarization in High-Energy\n  Astrophysics","authors":"Giorgio Galanti","authorsParsed":[["Galanti","Giorgio",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 08:15:21 GMT"}],"updateDate":"2024-08-01","timestamp":1722413721000,"abstract":"  In this review, we present a self-contained introduction to axion-like\nparticles (ALPs) with a particular focus on their effects on photon\npolarization: both theoretical and phenomenological aspects are discussed. We\nderive the photon survival probability in the presence of photon--ALP\ninteraction, the corresponding final photon degree of linear polarization, and\nthe polarization angle in a wide energy interval. The presented results can be\ntested by current and planned missions such as IXPE (already operative), eXTP,\nXL-Calibur, NGXP, XPP in the X-ray band and like COSI (approved to launch),\ne-ASTROGAM, and AMEGO in the high-energy range. Specifically, we describe\nALP-induced polarization effects on several astrophysical sources, such as\ngalaxy clusters, blazars, and gamma-ray bursts, and we discuss their real\ndetectability. In particular, galaxy clusters appear as very good observational\ntargets in this respect. Moreover, in the very-high-energy (VHE) band, we\ndiscuss a peculiar ALP signature in photon polarization, in principle capable\nof proving the ALP existence. Unfortunately, present technologies cannot detect\nphoton polarization up to such high energies, but the observational capability\nof the latter ALP signature in the VHE band could represent an interesting\nchallenge for the future. As a matter of fact, the aim of this review is to\nshow new ways to make progress in the physics of ALPs, thanks to their effects\non photon polarization, a topic that has aroused less interest in the past, but\nwhich is now timely with the advent of many new polarimetric missions.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}