{"id":"2407.15717","title":"Harmonizing Flows: Leveraging normalizing flows for unsupervised and\n  source-free MRI harmonization","authors":"Farzad Beizaee, Gregory A. Lodygensky, Chris L. Adamson, Deanne K.\n  Thompso, Jeanie L.Y. Cheon, Alicia J. Spittl. Peter J. Anderso, Christian\n  Desrosier, Jose Dolz","authorsParsed":[["Beizaee","Farzad",""],["Lodygensky","Gregory A.",""],["Adamson","Chris L.",""],["Thompso","Deanne K.",""],["Cheon","Jeanie L. Y.",""],["Anderso","Alicia J. Spittl. Peter J.",""],["Desrosier","Christian",""],["Dolz","Jose",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:22:08 GMT"}],"updateDate":"2024-07-23","timestamp":1721661728000,"abstract":"  Lack of standardization and various intrinsic parameters for magnetic\nresonance (MR) image acquisition results in heterogeneous images across\ndifferent sites and devices, which adversely affects the generalization of deep\nneural networks. To alleviate this issue, this work proposes a novel\nunsupervised harmonization framework that leverages normalizing flows to align\nMR images, thereby emulating the distribution of a source domain. The proposed\nstrategy comprises three key steps. Initially, a normalizing flow network is\ntrained to capture the distribution characteristics of the source domain. Then,\nwe train a shallow harmonizer network to reconstruct images from the source\ndomain via their augmented counterparts. Finally, during inference, the\nharmonizer network is updated to ensure that the output images conform to the\nlearned source domain distribution, as modeled by the normalizing flow network.\nOur approach, which is unsupervised, source-free, and task-agnostic is assessed\nin the context of both adults and neonatal cross-domain brain MRI segmentation,\nas well as neonatal brain age estimation, demonstrating its generalizability\nacross tasks and population demographics. The results underscore its superior\nperformance compared to existing methodologies. The code is available at\nhttps://github.com/farzad-bz/Harmonizing-Flows\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"FER2d3_mTQb0DBE36jXCZ_yDvMJw2dgzhQXvLTMFsJY","pdfSize":"2442108"}
