{"id":"2407.07803","title":"Identifying feedback directions in the mechanisms driving self-sustained\n  thermoacoustic instability in a single-element rocket combustor","authors":"Somnath De, Praveen Kasthuri, Matthew E. Harvazinski, Rohan Gejji,\n  William Anderson, and R. I. Sujith","authorsParsed":[["De","Somnath",""],["Kasthuri","Praveen",""],["Harvazinski","Matthew E.",""],["Gejji","Rohan",""],["Anderson","William",""],["Sujith","R. I.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 16:21:45 GMT"}],"updateDate":"2024-07-11","timestamp":1720628505000,"abstract":"  The occurrence of high frequency (>1000 Hz) thermoacoustic instability (TAI)\nsustained by mutual feedback among the acoustic field, heat release rate\noscillations, and hydrodynamic oscillations poses severe challenges to the\noperation and structural integrity of rocket engines. Hence, quantifying the\ndiffering levels of feedback between these variables can help uncover the\nunderlying mechanisms behind such high frequency TAI, enabling redesign of\ncombustors to mitigate TAI. However, so far, no concrete method exists to\ndecipher the varying levels of mutual feedback during high-frequency TAI. In\nthe present study, we holistically investigate the mutual influence based on\nthe spatiotemporal directionality among acoustic pressure, heat release rate,\nhydrodynamic and thermal oscillations during TAI of a single-element rocket\nengine combustor. Using symbolic transfer entropy (STE), we identify the\nspatiotemporal direction of feedback interactions between those primary\nvariables when acoustic waves significantly emerge during TAI. We unveil the\ninfluence of vorticity dynamics at the fuel collar (or the propellant splitter\nplate) as the primary stimulant over the heat release rate fluctuations to\nrapidly amplify the amplitude of the acoustic field. Further, depending on the\nquantification of the degree of the mutual information (i.e., the net direction\nof information), we identify the switches in dominating the thermoacoustic\ndriving between the variables during TAI, each representing a distinct\nmechanism of a thermoacoustic state. Additionally, from this quantification, we\nanalyze the relative dominance of the variables and rank-order the mutual\nfeedback according to their impact on driving TAI.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"EpYXiOpkVp0L_a6f3PVnq9JkTkJr4JpastlouqKkMhU","pdfSize":"5207985"}
