{"id":"2407.13274","title":"Aligning Explanations for Recommendation with Rating and Feature via\n  Maximizing Mutual Information","authors":"Yurou Zhao, Yiding Sun, Ruidong Han, Fei Jiang, Lu Guan, Xiang Li, Wei\n  Lin, Weizhi Ma, Jiaxin Mao","authorsParsed":[["Zhao","Yurou",""],["Sun","Yiding",""],["Han","Ruidong",""],["Jiang","Fei",""],["Guan","Lu",""],["Li","Xiang",""],["Lin","Wei",""],["Ma","Weizhi",""],["Mao","Jiaxin",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:29:55 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 23:28:47 GMT"}],"updateDate":"2024-08-22","timestamp":1721291395000,"abstract":"  Providing natural language-based explanations to justify recommendations\nhelps to improve users' satisfaction and gain users' trust. However, as current\nexplanation generation methods are commonly trained with an objective to mimic\nexisting user reviews, the generated explanations are often not aligned with\nthe predicted ratings or some important features of the recommended items, and\nthus, are suboptimal in helping users make informed decision on the\nrecommendation platform. To tackle this problem, we propose a flexible\nmodel-agnostic method named MMI (Maximizing Mutual Information) framework to\nenhance the alignment between the generated natural language explanations and\nthe predicted rating/important item features. Specifically, we propose to use\nmutual information (MI) as a measure for the alignment and train a neural MI\nestimator. Then, we treat a well-trained explanation generation model as the\nbackbone model and further fine-tune it through reinforcement learning with\nguidance from the MI estimator, which rewards a generated explanation that is\nmore aligned with the predicted rating or a pre-defined feature of the\nrecommended item. Experiments on three datasets demonstrate that our MMI\nframework can boost different backbone models, enabling them to outperform\nexisting baselines in terms of alignment with predicted ratings and item\nfeatures. Additionally, user studies verify that MI-enhanced explanations\nindeed facilitate users' decisions and are favorable compared with other\nbaselines due to their better alignment properties.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}