{"id":"2407.16768","title":"Towards efficient machine-learning-based reduction of the cosmic-ray\n  induced background in X-ray imaging detectors: increasing context awareness","authors":"Artem Poliszczuk, Dan Wilkins, Steven W. Allen, Eric D. Miller, Tanmoy\n  Chattopadhyay, Benjamin Schneider, Julien Eric Darve, Marshall Bautz, Abe\n  Falcone, Richard Foster, Catherine E. Grant, Sven Herrmann, Ralph Kraft, R.\n  Glenn Morris, Paul Nulsen, Peter Orel, Gerrit Schellenberger, Haley R.\n  Stueber","authorsParsed":[["Poliszczuk","Artem",""],["Wilkins","Dan",""],["Allen","Steven W.",""],["Miller","Eric D.",""],["Chattopadhyay","Tanmoy",""],["Schneider","Benjamin",""],["Darve","Julien Eric",""],["Bautz","Marshall",""],["Falcone","Abe",""],["Foster","Richard",""],["Grant","Catherine E.",""],["Herrmann","Sven",""],["Kraft","Ralph",""],["Morris","R. Glenn",""],["Nulsen","Paul",""],["Orel","Peter",""],["Schellenberger","Gerrit",""],["Stueber","Haley R.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 18:03:18 GMT"}],"updateDate":"2024-07-25","timestamp":1721757798000,"abstract":"  Traditional cosmic ray filtering algorithms used in X-ray imaging detectors\naboard space telescopes perform event reconstruction based on the properties of\nactivated pixels above a certain energy threshold, within 3x3 or 5x5 pixel\nsliding windows. This approach can reject up to 98% of the cosmic ray\nbackground. However, the remaining unrejected background constitutes a\nsignificant impediment to studies of low surface brightness objects, which are\nespecially prevalent in the high-redshift universe. The main limitation of the\ntraditional filtering algorithms is their ignorance of the long-range\ncontextual information present in image frames. This becomes particularly\nproblematic when analyzing signals created by secondary particles produced\nduring interactions of cosmic rays with body of the detector. Such signals may\nlook identical to the energy deposition left by X-ray photons, when one\nconsiders only the properties within the small sliding window. Additional\ninformation is present, however, in the spatial and energy correlations between\nsignals in different parts of the frame, which can be accessed by modern\nmachine learning (ML) techniques. In this work, we continue the development of\nan ML-based pipeline for cosmic ray background mitigation. Our latest method\nconsist of two stages: first, a frame classification neural network is used to\ncreate class activation maps (CAM), localizing all events within the frame;\nsecond, after event reconstruction, a random forest classifier, using features\nobtained from CAMs, is used to separate X-ray and cosmic ray features. The\nmethod delivers >40% relative improvement over traditional filtering in\nbackground rejection in standard 0.3-10keV energy range, at the expense of only\na small (<2%) level of lost X-ray signal. Our method also provides a convenient\nway to tune the cosmic ray rejection threshold to adapt to a user's specific\nscientific needs.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}