{"id":"2407.20429","title":"Galaxies and Their Environment at $z \\gtrsim 10$ -- I: Primordial\n  Chemical Enrichment, Accretion, Cooling, and Virialization of Gas in Dark\n  Matter Halos","authors":"William M. Hicks, Michael L. Norman, Azton I. Wells, and James O.\n  Bordner","authorsParsed":[["Hicks","William M.",""],["Norman","Michael L.",""],["Wells","Azton I.",""],["Bordner","James O.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 21:39:48 GMT"}],"updateDate":"2024-07-31","timestamp":1722289188000,"abstract":"  Recent observations made using the James Webb Space Telescope have identified\na number of high-redshift galaxies that are unexpectedly luminous. In light of\nthis, it is clear that a more detailed understanding of the high redshift,\npre-reionization universe is required for us to obtain the complete story of\ngalaxy formation. This study is the first in a series that seeks to tell the\nstory of galaxy formation at $z \\gtrsim 10$ using a suite of large-scale\nadaptive mesh refinement cosmological simulations. Our\nmachine-learning-accelerated surrogate model for Population III star formation\nand feedback, StarNet, gives us an unprecedented ability to obtain physically\naccurate, inhomogeneous chemical initial conditions for a statistically\nsignificant number of galaxies. We find that of the 12,423 halos in the mass\nrange of $10^6\\,\\,M_\\odot < M_\\mathrm{vir} < 10^9\\,\\, M_\\odot$ that form in our\nfiducial simulation, $16\\%$ are chemically enriched by Population III\nsupernovae by $z\\sim12$. We then profile and compare various cooling processes\nat the centers of halos, and find a complete absence of atomic cooling halos.\nAll of our halos with central cooling gas are dominated by H$_2$ cooling, metal\ncooling, or a mixture of the two, even in the presence of a strong\nH$_2$-photodissociating Lyman-Werner background. We also find that gas\naccretion through the virial radius is not driven by cooling. We find that gas\nvirialization in halos with $M_\\mathrm{vir}\\gtrsim10^7\\,\\,M_\\odot$ is supported\nby bulk turbulent flows, and that thermal energy accounts for only a small\nfraction of the total kinetic energy. Because of this, the mean gas temperature\nis well below the virial temperature for these halos. We then compute the mass\nof gas that is available for Population II star formation, and infer star\nformation rates for each potential star-forming halo.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}