{"id":"2407.08347","title":"GUI-based Pedicle Screw Planning on Fluoroscopic Images Utilizing\n  Vertebral Segmentation","authors":"Vivek Maik, Aparna Purayath, Durga R, Manojkumar Lakshmanan,\n  Mohanasankar Sivaprakasm","authorsParsed":[["Maik","Vivek",""],["Purayath","Aparna",""],["R","Durga",""],["Lakshmanan","Manojkumar",""],["Sivaprakasm","Mohanasankar",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 09:55:42 GMT"}],"updateDate":"2024-07-12","timestamp":1720691742000,"abstract":"  The proposed work establishes a novel Graphical User Interface (GUI)\nframework, primarily designed for intraoperative pedicle screw planning.\nCurrent planning workflow in Image Guided Surgeries primarily relies on\npre-operative CT planning. Intraoperative CT planning can be time-consuming and\nexpensive and thus is not a common practice. In situations where efficiency and\ncost-effectiveness are paramount, planning to utilize fluoroscopic images\nacquired for image registration emerges as the optimal choice. The methodology\nproposed in this study employs a simulated 3D pedicle screw to calculate its\ncoronal and sagittal projections for pedicle screw planning using\nanterior-posterior (AP) and lateral (LP) images. The initialization and\nplacement of pedicle screw is computed by utilizing the bounding box of\nvertebral segmentation, which is obtained by the application of enhanced\nYOLOv5. The GUI front end includes functionality that allows surgeons or\nmedical practitioners to efficiently choose, set up, and dynamically maneuver\nthe pedicle screw on AP and LP images. This is based on a novel feature called\nsynchronous planning, which involves correlating pedicle screws from the\ncoronal and sagittal planes. This correlation utilizes projective\ncorrespondence to ensure that any movement of the pedicle screw in either the\nAP or LP image will be reflected in the other image. The proposed GUI framework\nis a time-efficient and cost-effective tool for synchronizing and planning the\nmovement of pedicle screws during intraoperative surgical procedures.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}