{"id":"2407.04583","title":"Unbalanced optimal transport for stochastic particle tracking","authors":"Kairui Hao, Atharva Hans, Pavlos Vlachos, Ilias Bilionis","authorsParsed":[["Hao","Kairui",""],["Hans","Atharva",""],["Vlachos","Pavlos",""],["Bilionis","Ilias",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 15:27:54 GMT"}],"updateDate":"2024-07-08","timestamp":1720193274000,"abstract":"  Non-invasive flow measurement techniques, such as particle tracking\nvelocimetry, resolve 3D velocity fields by pairing tracer particle positions in\nsuccessive time steps. These trajectories are crucial for evaluating physical\nquantities like vorticity, shear stress, pressure, and coherent structures.\nTraditional approaches deterministically reconstruct particle positions and\nextract particle tracks using tracking algorithms. However, reliable track\nestimation is challenging due to measurement noise caused by high particle\ndensity, particle image overlap, and falsely reconstructed 3D particle\npositions. To overcome this challenge, probabilistic approaches quantify the\nepistemic uncertainty in particle positions, typically using a Gaussian\nprobability distribution. However, the standard deterministic tracking\nalgorithms relying on nearest-neighbor search do not directly extend to the\nprobabilistic setting. Moreover, such algorithms do not necessarily find\nglobally consistent solutions robust to reconstruction errors. This paper aims\nto develop a globally consistent nearest-neighborhood algorithm that robustly\nextracts stochastic particle tracks from the reconstructed Gaussian particle\ndistributions in all frames. Our tracking algorithm relies on the unbalanced\noptimal transport theory in the metric space of Gaussian measures.\nSpecifically, we optimize a binary transport plan for efficiently moving the\nGaussian distributions of reconstructed particle positions between time frames.\nWe achieve this by computing the partial Wasserstein distance in the metric\nspace of Gaussian measures. Our tracking algorithm is robust to position\nreconstruction errors since it automatically detects the number of particles\nthat should be matched through hyperparameter optimization. Finally, we\nvalidate our method using an in vitro flow experiment using a 3D-printed\ncerebral aneurysm.\n","subjects":["Physics/Data Analysis, Statistics and Probability","Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}