{"id":"2407.19376","title":"CIDER: Counterfactual-Invariant Diffusion-based GNN Explainer for Causal\n  Subgraph Inference","authors":"Qibin Zhang, Chengshang Lyu, Lingxi Chen, Qiqi Jin, Luonan Chen","authorsParsed":[["Zhang","Qibin",""],["Lyu","Chengshang",""],["Chen","Lingxi",""],["Jin","Qiqi",""],["Chen","Luonan",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 03:23:02 GMT"}],"updateDate":"2024-07-30","timestamp":1722136982000,"abstract":"  Inferring causal links or subgraphs corresponding to a specific phenotype or\nlabel based solely on measured data is an important yet challenging task, which\nis also different from inferring causal nodes. While Graph Neural Network (GNN)\nExplainers have shown potential in subgraph identification, existing methods\nwith GNN often offer associative rather than causal insights. This lack of\ntransparency and explainability hinders our understanding of their results and\nalso underlying mechanisms. To address this issue, we propose a novel method of\ncausal link/subgraph inference, called CIDER: Counterfactual-Invariant\nDiffusion-based GNN ExplaineR, by implementing both counterfactual and\ndiffusion implementations. In other words, it is a model-agnostic and\ntask-agnostic framework for generating causal explanations based on a\ncounterfactual-invariant and diffusion process, which provides not only causal\nsubgraphs due to counterfactual implementation but reliable causal links due to\nthe diffusion process. Specifically, CIDER is first formulated as an inference\ntask that generatively provides the two distributions of one causal subgraph\nand another spurious subgraph. Then, to enhance the reliability, we further\nmodel the CIDER framework as a diffusion process. Thus, using the causal\nsubgraph distribution, we can explicitly quantify the contribution of each\nsubgraph to a phenotype/label in a counterfactual manner, representing each\nsubgraph's causal strength. From a causality perspective, CIDER is an\ninterventional causal method, different from traditional association studies or\nobservational causal approaches, and can also reduce the effects of unobserved\nconfounders. We evaluate CIDER on both synthetic and real-world datasets, which\nall demonstrate the superiority of CIDER over state-of-the-art methods.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}