{"id":"2407.21422","title":"Generalized Tampered Scene Text Detection in the era of Generative AI","authors":"Chenfan Qu, Yiwu Zhong, Fengjun Guo and Lianwen Jin","authorsParsed":[["Qu","Chenfan",""],["Zhong","Yiwu",""],["Guo","Fengjun",""],["Jin","Lianwen",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 08:17:23 GMT"}],"updateDate":"2024-08-01","timestamp":1722413843000,"abstract":"  The rapid advancements of generative AI have fueled the potential of\ngenerative text image editing while simultaneously escalating the threat of\nmisinformation spreading. However, existing forensics methods struggle to\ndetect unseen forgery types that they have not been trained on, leaving the\ndevelopment of a model capable of generalized detection of tampered scene text\nas an unresolved issue. To tackle this, we propose a novel task: open-set\ntampered scene text detection, which evaluates forensics models on their\nability to identify both seen and previously unseen forgery types. We have\ncurated a comprehensive, high-quality dataset, featuring the texts tampered by\neight text editing models, to thoroughly assess the open-set generalization\ncapabilities. Further, we introduce a novel and effective pre-training paradigm\nthat subtly alters the texture of selected texts within an image and trains the\nmodel to identify these regions. This approach not only mitigates the scarcity\nof high-quality training data but also enhances models' fine-grained perception\nand open-set generalization abilities. Additionally, we present DAF, a novel\nframework that improves open-set generalization by distinguishing between the\nfeatures of authentic and tampered text, rather than focusing solely on the\ntampered text's features. Our extensive experiments validate the remarkable\nefficacy of our methods. For example, our zero-shot performance can even beat\nthe previous state-of-the-art full-shot model by a large margin. Our dataset\nand code will be open-source.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}