{"id":"2407.01256","title":"From Coupling to Resilience: Quantifying the Impact of Interconnection\n  in Energy Carrier Grids","authors":"Rico Schrage, Astrid Nie{\\ss}e","authorsParsed":[["Schrage","Rico",""],["Nieße","Astrid",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:06:29 GMT"}],"updateDate":"2024-07-02","timestamp":1719839189000,"abstract":"  Due to the increasing share of renewable energy resources and the emergence\nof couplings of different energy carrier grids, which may support the\nelectricity networks by providing additional flexibility, conducting research\non the properties of multi-energy systems is necessary. Primarily to keep\nstable grid operation and provide efficient planning, the resilience of such\nsystems against low-probability, high-impact events is central. Previous\nsteady-state resilience studies of electricity grids also involved\ninvestigating the topological attributes from a complex network theory\nperspective. However, this work aims to determine the influence of complex\ntopological attributes on the resilience of coupled energy grids. To achieve\nthis, we set up a Monte Carlo simulation to calculate the load-shedding\nperformance indicator for the grids when affected by high-impact events. This\nindicator is used to calculate resilience metrics, which express the influence\nof the grids on each other. The metrics are the base to search for correlations\nbetween centrality/vitality metrics and the resilience impact metric. We apply\nour method to a case study based on a benchmark electricity grid. Our results\nshow that, first, our impact metric is feasible for determining the influences\nof the network on each other. Second, we show that increasing coupling\ndensities can lead to lower resilience in single-carrier grids. Third, it is\napparent that centrality influences the impact of the grid components'\nresilience.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}