{"id":"2407.09017","title":"AI-Driven Guided Response for Security Operation Centers with Microsoft\n  Copilot for Security","authors":"Scott Freitas, Jovan Kalajdjieski, Amir Gharib, Robert McCann","authorsParsed":[["Freitas","Scott",""],["Kalajdjieski","Jovan",""],["Gharib","Amir",""],["McCann","Robert",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 06:10:01 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 00:18:19 GMT"},{"version":"v3","created":"Wed, 24 Jul 2024 01:15:20 GMT"}],"updateDate":"2024-07-25","timestamp":1720764601000,"abstract":"  Security operation centers contend with a constant stream of security\nincidents, ranging from straightforward to highly complex. To address this, we\ndeveloped Copilot Guided Response (CGR), an industry-scale ML architecture that\nguides security analysts across three key tasks -- (1) investigation, providing\nessential historical context by identifying similar incidents; (2) triaging to\nascertain the nature of the incident -- whether it is a true positive, false\npositive, or benign positive; and (3) remediation, recommending tailored\ncontainment actions. CGR is integrated into the Microsoft Defender XDR product\nand deployed worldwide, generating millions of recommendations across thousands\nof customers. Our extensive evaluation, incorporating internal evaluation,\ncollaboration with security experts, and customer feedback, demonstrates that\nCGR delivers high-quality recommendations across all three tasks. We provide a\ncomprehensive overview of the CGR architecture, setting a precedent as the\nfirst cybersecurity company to openly discuss these capabilities in such depth.\nAdditionally, we GUIDE, the largest public collection of real-world security\nincidents, spanning 13M evidences across 1M annotated incidents. By enabling\nresearchers and practitioners to conduct research on real-world data, GUIDE\nadvances the state of cybersecurity and supports the development of\nnext-generation machine learning systems.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Cryptography and Security","Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}