{"id":"2407.10784","title":"AdapTable: Test-Time Adaptation for Tabular Data via Shift-Aware\n  Uncertainty Calibrator and Label Distribution Handler","authors":"Changhun Kim, Taewon Kim, Seungyeon Woo, June Yong Yang, Eunho Yang","authorsParsed":[["Kim","Changhun",""],["Kim","Taewon",""],["Woo","Seungyeon",""],["Yang","June Yong",""],["Yang","Eunho",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 15:02:53 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 05:01:17 GMT"},{"version":"v3","created":"Mon, 26 Aug 2024 04:58:15 GMT"}],"updateDate":"2024-08-27","timestamp":1721055773000,"abstract":"  In real-world scenarios, tabular data often suffer from distribution shifts\nthat threaten the performance of machine learning models. Despite its\nprevalence and importance, handling distribution shifts in the tabular domain\nremains underexplored due to the inherent challenges within the tabular data\nitself. In this sense, test-time adaptation (TTA) offers a promising solution\nby adapting models to target data without accessing source data, crucial for\nprivacy-sensitive tabular domains. However, existing TTA methods either 1)\noverlook the nature of tabular distribution shifts, often involving label\ndistribution shifts, or 2) impose architectural constraints on the model,\nleading to a lack of applicability. To this end, we propose AdapTable, a novel\nTTA framework for tabular data. AdapTable operates in two stages: 1)\ncalibrating model predictions using a shift-aware uncertainty calibrator, and\n2) adjusting these predictions to match the target label distribution with a\nlabel distribution handler. We validate the effectiveness of AdapTable through\ntheoretical analysis and extensive experiments on various distribution shift\nscenarios. Our results demonstrate AdapTable's ability to handle various\nreal-world distribution shifts, achieving up to a 16% improvement on the HELOC\ndataset.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}