{"id":"2407.06815","title":"Searching Accretion-Enhanced Dark Matter Annihilation Signals in the\n  Galactic Centre","authors":"Mei-Wen Yang, Zhi-Qi Guo, Xiao-Yi Luo, Zhao-Qiang Shen, Zi-Qing Xia,\n  Chih-Ting Lu, Yue-Lin Sming Tsai and Yi-Zhong Fan","authorsParsed":[["Yang","Mei-Wen",""],["Guo","Zhi-Qi",""],["Luo","Xiao-Yi",""],["Shen","Zhao-Qiang",""],["Xia","Zi-Qing",""],["Lu","Chih-Ting",""],["Tsai","Yue-Lin Sming",""],["Fan","Yi-Zhong",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 12:45:36 GMT"},{"version":"v2","created":"Sun, 15 Sep 2024 13:38:47 GMT"}],"updateDate":"2024-09-17","timestamp":1720529136000,"abstract":"  This study reanalyzes the detection prospects of dark matter (DM)\nannihilation signals in the Galactic Center, focusing on velocity-dependent\ndynamics within a spike density near the supermassive black hole\n(Sgr~A$^{\\star}$). We investigate three annihilation processes -- $p$-wave,\nresonance, and forbidden annihilation -- under semi-relativistic velocities,\nleveraging gamma-ray data from Fermi and DAMPE telescopes. Our analysis\nintegrates a fermionic DM model with an electroweak axion-like particle (ALP)\nportal, exploring annihilation into two or four photons. Employing a\ncomprehensive six-dimensional integration, we precisely calculate DM-induced\ngamma-ray fluxes near Sgr~A$^{\\star}$, incorporating velocity and positional\ndependencies in the annihilation cross-section and photon yield spectra. Our\nfindings highlight scenarios of resonance and forbidden annihilation, where the\nlarger ALP-DM-DM coupling constant $C_{a\\chi\\chi}$ can affect spike density,\npotentially yielding detectable gamma-ray line spectra within Fermi and DAMPE\nenergy resolution. We set upper limits for $C_{a\\chi\\chi}$ across these\nscenarios, offering insights into the detectability and spectral\ncharacteristics of DM annihilation signals from the Galactic Center.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}