{"id":"2407.06274","title":"Probing populations of dark stellar remnants in the globular clusters 47\n  Tuc and Terzan 5 using pulsar timing","authors":"Peter J. Smith, Vincent H\\'enault-Brunet, Nolan Dickson, Mark Gieles,\n  Holger Baumgardt","authorsParsed":[["Smith","Peter J.",""],["Hénault-Brunet","Vincent",""],["Dickson","Nolan",""],["Gieles","Mark",""],["Baumgardt","Holger",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:00:06 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 16:41:27 GMT"}],"updateDate":"2024-08-28","timestamp":1720461606000,"abstract":"  We present a new method to combine multimass equilibrium dynamical models and\npulsar timing data to constrain the mass distribution and remnant populations\nof Milky Way globular clusters (GCs). We first apply this method to 47 Tuc, a\ncluster for which there exists an abundance of stellar kinematic data and which\nis also host to a large population of millisecond pulsars. We demonstrate that\nthe pulsar timing data allow us to place strong constraints on the overall mass\ndistribution and remnant populations even without fitting on stellar\nkinematics. Our models favor a small population of stellar-mass BHs in this\ncluster (with a total mass of $446^{+75}_{-72} \\mathrm{M_\\odot}$), arguing\nagainst the need for a large ($ > 2000 \\ \\mathrm{M_\\odot}$) central\nintermediate-mass black hole. We then apply the method to Terzan 5, a heavily\nobscured bulge cluster which hosts the largest population of millisecond\npulsars of any Milky Way GC and for which the collection of conventional\nstellar kinematic data is very limited. We improve existing constraints on the\nmass distribution and structural parameters of this cluster and place stringent\nconstraints on its black hole content, finding an upper limit on the mass in\nBHs of $\\sim 4000 \\ \\mathrm{M_\\odot}$. This method allows us to probe the\ncentral dynamics of GCs even in the absence of stellar kinematic data and can\nbe easily applied to other GCs with pulsar timing data, for which datasets will\ncontinue to grow with the next generation of radio telescopes.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}