{"id":"2407.04160","title":"X-ray polarization: A view deep inside cosmic ray driven turbulence and\n  particle acceleration in supernova remnants","authors":"Andrei.M. Bykov, Sergei.M. Osipov, Yury.A. Uvarov, Donald.C. Ellison,\n  Patrick Slane","authorsParsed":[["Bykov","Andrei. M.",""],["Osipov","Sergei. M.",""],["Uvarov","Yury. A.",""],["Ellison","Donald. C.",""],["Slane","Patrick",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 21:27:50 GMT"}],"updateDate":"2024-07-08","timestamp":1720128470000,"abstract":"  We show here that highly polarized X-ray synchrotron radiation from young\nsupernova remnants (SNRs) can be modeled within the framework of diffusive\nshock acceleration (DSA) and nonlinear magnetic turbulence generation.Cosmic\nray acceleration by SNR shocks to very high energies requires efficient\nmagnetic turbulence amplification in the shock precursor.As the strong\nturbulence generated by Bell's instability far upstream from the viscous\nsubshock convects through the subshock, nonlinear dynamical effects on the\ncompressible fluctuations produce a downstream layer filled with strong\nanisotropic turbulence with predominantly radial magnetic fields.The\nsynchrotron radiation from shock accelerated electrons in the turbulent\ndownstream layer has a high degree of polarization shown to be consistent with\nrecent observations of young SNRs by IXPE.In the case of Tycho's SNR, the\nmeasured X-ray radiation constrains the thickness of the energy containing\ninterval and the amplitude of cosmic ray driven magnetic turbulence, as well as\nthe maximal energy of accelerated protons.The preferential direction of the\nX-ray polarization depends sensitively on the SNR shock velocity and the\nambient density.A unique feature of our model is the sensitive dependence of\nthe degree and direction of X-ray polarization on the spatial overlap between\nregions of amplified magnetic turbulence and TeV electron populations.While\nthis overlap occurs on scales orders of magnitude below the resolution of\nIXPE,its polarization measurement allows testing of turbulent plasma processes\non unprecedented scales.The mechanism of formation of highly polarized X-ray\nsynchrotron radiation in fast shocks with high level of anisotropic turbulent\nmagnetic field preferentially directed along the shock normal may be applied to\nother systems like shocks produced by black hole jets.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}