{"id":"2407.09955","title":"LFFR: Logistic Function For (single-output) Regression","authors":"John Chiang","authorsParsed":[["Chiang","John",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 17:33:49 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 20:35:05 GMT"}],"updateDate":"2024-08-01","timestamp":1720892029000,"abstract":"  Privacy-preserving regression in machine learning is a crucial area of\nresearch, aimed at enabling the use of powerful machine learning techniques\nwhile protecting individuals' privacy. In this paper, we implement\nprivacy-preserving regression training using data encrypted under a fully\nhomomorphic encryption scheme. We first examine the common linear regression\nalgorithm and propose a (simplified) fixed Hessian for linear regression\ntraining, which can be applied for any datasets even not normalized into the\nrange $[0, 1]$. We also generalize this constant Hessian matrix to the ridge\nregression version, namely linear regression which includes a regularization\nterm to penalize large coefficients. However, our main contribution is to\ndevelop a novel and efficient algorithm called LFFR for homomorphic regression\nusing the logistic function, which could model more complex relations between\ninput values and output prediction in comparison with linear regression. We\nalso find a constant simplified Hessian to train our LFFR algorithm using the\nNewton-like method and compare it against to with our new fixed Hessian linear\nregression training over two real-world datasets. We suggest normalizing not\nonly the data but also the target predictions even for the original linear\nregression used in a privacy-preserving manner, which is helpful to remain\nweights in a small range, say $[-5, +5]$ good for refreshing ciphertext setting\nparameters, and avoid tuning the regularization parameter $\\lambda$ via cross\nvalidation. The linear regression with normalized predictions could be a viable\nalternative to ridge regression.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}