{"id":"2407.01519","title":"DiffIR2VR-Zero: Zero-Shot Video Restoration with Diffusion-based Image\n  Restoration Models","authors":"Chang-Han Yeh, Chin-Yang Lin, Zhixiang Wang, Chi-Wei Hsiao, Ting-Hsuan\n  Chen, Yu-Lun Liu","authorsParsed":[["Yeh","Chang-Han",""],["Lin","Chin-Yang",""],["Wang","Zhixiang",""],["Hsiao","Chi-Wei",""],["Chen","Ting-Hsuan",""],["Liu","Yu-Lun",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 17:59:12 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 16:25:53 GMT"}],"updateDate":"2024-07-22","timestamp":1719856752000,"abstract":"  This paper introduces a method for zero-shot video restoration using\npre-trained image restoration diffusion models. Traditional video restoration\nmethods often need retraining for different settings and struggle with limited\ngeneralization across various degradation types and datasets. Our approach uses\na hierarchical token merging strategy for keyframes and local frames, combined\nwith a hybrid correspondence mechanism that blends optical flow and\nfeature-based nearest neighbor matching (latent merging). We show that our\nmethod not only achieves top performance in zero-shot video restoration but\nalso significantly surpasses trained models in generalization across diverse\ndatasets and extreme degradations (8$\\times$ super-resolution and high-standard\ndeviation video denoising). We present evidence through quantitative metrics\nand visual comparisons on various challenging datasets. Additionally, our\ntechnique works with any 2D restoration diffusion model, offering a versatile\nand powerful tool for video enhancement tasks without extensive retraining.\nThis research leads to more efficient and widely applicable video restoration\ntechnologies, supporting advancements in fields that require high-quality video\noutput. See our project page for video results at\nhttps://jimmycv07.github.io/DiffIR2VR_web/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}