{"id":"2407.11210","title":"Wind Tunnel Testing and Modeling Implications of an Advanced Turbine\n  Cascade","authors":"Sharath Sathish","authorsParsed":[["Sathish","Sharath",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 19:51:51 GMT"}],"updateDate":"2024-07-17","timestamp":1721073111000,"abstract":"  This paper describes the extensive Wind Tunnel (WT) linear cascade testing\ncampaign carried out on a constant section turbine blade developed for low\nsubsonic applications. Comprehensive experimental program was designed to\ndetermine the aerodynamic behaviour of this blade under a wide range of varying\ngeometrical like Pitch to Chord Ratio, Stagger Angle and Aerodynamic like\nReynolds Roughness, Mach number, Incidence angle conditions. In addition to the\nclassical Two-Dimensional (2D) measurements, targeted Three-Dimensional (3D)\nsurveys have been performed to complement the 2D results, allowing to draw\nsupplementary conclusions as to the behaviour of the considered blade in\nthree-dimensions. The performed experiments predominantly covered the\ntransitional and beginning of a fully turbulent flow regime (maximum Re is 2.5\nmillion). Post processing of experimental results were done in view of\nexploitation and judgment of some key aerodynamic aspects; parameters such as\nprofile section load distribution, loss coefficient and flow deviation angle.\nAlongside with confirmation of the design targets, a parallel goal pursued in\nthe current WT testing, was to get a more accurate idea as to the predictive\ncapabilities of the employed CFD tools (CFX and MISES) under the basic flow\ncondition generated in the WT. The aim was to get a global picture, as to the\nlevel of agreement that can be reached by the used design tools while\naccounting for the afore-mentioned design, operational variables. The obtained\nmeasurement results clearly indicated the success of the design in achieving\nthe pre-set targets. The paper further provides a detailed discussion on the\nidentified discrepancies, measurement versus predictions, of the key parameters\nat the geometric, aerodynamic design as well as off-design conditions.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}