{"id":"2407.20095","title":"Crafting Generative Art through Genetic Improvement: Managing Creative\n  Outputs in Diverse Fitness Landscapes","authors":"Erik M. Fredericks, Denton Bobeldyk, Jared M. Moore","authorsParsed":[["Fredericks","Erik M.",""],["Bobeldyk","Denton",""],["Moore","Jared M.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:24:29 GMT"}],"updateDate":"2024-07-30","timestamp":1722266669000,"abstract":"  Generative art is a rules-driven approach to creating artistic outputs in\nvarious mediums. For example, a fluid simulation can govern the flow of colored\npixels across a digital display or a rectangle placement algorithm can yield a\nMondrian-style painting. Previously, we investigated how genetic improvement, a\nsub-field of genetic programming, can automatically create and optimize\ngenerative art drawing programs. One challenge of applying genetic improvement\nto generative art is defining fitness functions and their interaction in a\nmany-objective evolutionary algorithm such as Lexicase selection. Here, we\nassess the impact of each fitness function in terms of the their individual\neffects on generated images, characteristics of generated programs, and impact\nof bloat on this specific domain. Furthermore, we have added an additional\nfitness function that uses a classifier for mimicking a human's assessment as\nto whether an output is considered as \"art.\" This classifier is trained on a\ndataset of input images resembling the glitch art aesthetic that we aim to\ncreate. Our experimental results show that with few fitness functions,\nindividual generative techniques sweep across populations. Moreover, we found\nthat compositions tended to be driven by one technique with our current fitness\nfunctions. Lastly, we show that our classifier is best suited for filtering out\nnoisy images, ideally leading towards more outputs relevant to user preference.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}