{"id":"2407.07126","title":"A 3D Pancreatic Cancer Model with Integrated Optical Sensors for\n  Noninvasive Metabolism Monitoring and Drug Screening","authors":"Anna Chiara Siciliano, Stefania Forciniti, Valentina Onesto, Helena\n  Iuele, Donatella Delle Cave, Federica Carnevali, Giuseppe Gigli, Enza\n  Lonardo, Loretta L. del Mercato","authorsParsed":[["Siciliano","Anna Chiara",""],["Forciniti","Stefania",""],["Onesto","Valentina",""],["Iuele","Helena",""],["Cave","Donatella Delle",""],["Carnevali","Federica",""],["Gigli","Giuseppe",""],["Lonardo","Enza",""],["del Mercato","Loretta L.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 07:51:47 GMT"}],"updateDate":"2024-07-11","timestamp":1720511507000,"abstract":"  A distinct feature of pancreatic ductal adenocarcinoma (PDAC) is a prominent\ntumor microenvironment (TME) with remarkable cellular and spatial heterogeneity\nthat meaningfully impacts disease biology and treatment resistance. The dynamic\ncrosstalk between cancer cells and the dense stromal compartment leads to\nspatially and temporally heterogeneous metabolic alterations, such as acidic pH\nthat contributes to drug resistance in PDAC. Thus, monitoring the extracellular\npH metabolic fluctuations within the TME is crucial to predict and to quantify\nanticancer drug efficacy. Here, a simple and reliable alginate-based 3D PDAC\nmodel embedding ratiometric optical pH sensors and cocultures of tumor (AsPC-1)\nand stromal cells for simultaneously monitoring metabolic pH variations and\nquantify drug response is presented. By means of time-lapse confocal laser\nscanning microscopy (CLSM) coupled with a fully automated computational\nanalysis, the extracellular pH metabolic variations are monitored and\nquantified over time during drug testing with gemcitabine, folfirinox, and\npaclitaxel, commonly used in PDAC therapy. In particular, the extracellular\nacidification is more pronounced after drugs treatment, resulting in increased\nantitumor effect correlated with apoptotic cell death. These findings highlight\nthe importance of studying the influence of cellular metabolic mechanisms on\ntumor response to therapy in 3D tumor models, this being crucial for the\ndevelopment of personalized medicine approaches.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}