{"id":"2407.00831","title":"Symplectic double groupoids and the generalized K\\\"ahler potential","authors":"Daniel \\'Alvarez, Marco Gualtieri, Yucong Jiang","authorsParsed":[["Álvarez","Daniel",""],["Gualtieri","Marco",""],["Jiang","Yucong",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 20:57:18 GMT"}],"updateDate":"2024-07-02","timestamp":1719781038000,"abstract":"  A description of the fundamental degrees of freedom underlying a generalized\nK\\\"ahler manifold, which separates its holomorphic moduli from the space of\ncompatible metrics in a similar way to the K\\\"ahler case, has been sought since\nits discovery in 1984. In this paper, we describe a full solution to this\nproblem for arbitrary generalized K\\\"ahler manifolds, which involves the new\nconcept of a holomorphic symplectic Morita 2-equivalence between double\nsymplectic groupoids, equipped with a Lagrangian bisection of its real\nsymplectic core. Essentially, any generalized K\\\"ahler manifold has an\nassociated holomorphic symplectic manifold of quadruple dimension and equipped\nwith an anti-holomorphic involution; the metric is determined by a Lagrangian\nsubmanifold of its fixed point locus. This finally resolves affirmatively a\nlong-standing conjecture by physicists concerning the existence of a\ngeneralized K\\\"ahler potential.\n  We demonstrate the theory by constructing explicitly the above Morita\n2-equivalence and Lagrangian bisection for the well-known generalized K\\\"ahler\nstructures on compact even-dimensional semisimple Lie groups, which have until\nnow escaped such analysis. We construct the required holomorphic symplectic\nmanifolds by expressing them as moduli spaces of flat connections on surfaces\nwith decorated boundary, through a quasi-Hamiltonian reduction.\n","subjects":["Mathematics/Differential Geometry","Physics/High Energy Physics - Theory","Mathematics/Category Theory","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}