{"id":"2407.16442","title":"CHANG-ES XXXII: Spatially Resolved Thermal/Nonthermal Separation from\n  Radio Data Alone -- New Probes into NGC 3044 and NGC 5775","authors":"Judith Irwin, Tanden Cook, Michael Stein, Ralf-Juergen Dettmar, Volker\n  Heesen, Q. Daniel Wang, Theresa Wiegert, Yelena Stein, and Carlos Vargas","authorsParsed":[["Irwin","Judith",""],["Cook","Tanden",""],["Stein","Michael",""],["Dettmar","Ralf-Juergen",""],["Heesen","Volker",""],["Wang","Q. Daniel",""],["Wiegert","Theresa",""],["Stein","Yelena",""],["Vargas","Carlos",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 12:52:56 GMT"}],"updateDate":"2024-07-24","timestamp":1721739176000,"abstract":"  We have carried out spatially resolved thermal/nonthermal separation on two\nedge-on galaxies, NGC~3044 and NGC~5775, using only radio data. Narrow-band\nimaging within a frequency band that is almost contiguous from 1.25 to 7.02 GHz\n(L-band, S-band and C-band) has allowed us to fit spectra and construct\nthermal, nonthermal, and nonthermal spectral index maps. This method does not\nrequire any ancillary H$\\alpha$ and infrared data, or reliance on dust\ncorrections that are challenging in edge-on galaxies. For NGC~3044, at 15\narcsec resolution, we find a median thermal fraction of $\\sim\\, 13$\\% with an\nestimated uncertainty in this fraction of $\\sim\\, 50$\\% at 4.13 GHz. This\ncompares well with the H$\\alpha$ mixture method results. We uncovered evidence\nfor a vertical outflow feature reaching at least $z\\,\\sim\\,3.5$ kpc in\nprojection above the plane, reminiscent of M82's starburst wind. For the higher\nSFR galaxy, NGC~5775 at 12 arcsec resolution, we find a median thermal fraction\nof 44\\% at 4.13 GHz with an estimated error on this fraction of 17\\%. Both\ngalaxies show a change of slope (flattening) in L-band. These results suggest\nthat a radio-only method for separating thermal from nonthermal emission is not\nonly feasible, but able to reveal new features that might otherwise be obscured\nin edge-on disks.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}