{"id":"2407.05379","title":"AiGAS-dEVL: An Adaptive Incremental Neural Gas Model for Drifting Data\n  Streams under Extreme Verification Latency","authors":"Maria Arostegi, Miren Nekane Bilbao, Jesus L. Lobo, Javier Del Ser","authorsParsed":[["Arostegi","Maria",""],["Bilbao","Miren Nekane",""],["Lobo","Jesus L.",""],["Del Ser","Javier",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 14:04:57 GMT"}],"updateDate":"2024-07-09","timestamp":1720361097000,"abstract":"  The ever-growing speed at which data are generated nowadays, together with\nthe substantial cost of labeling processes cause Machine Learning models to\nface scenarios in which data are partially labeled. The extreme case where such\na supervision is indefinitely unavailable is referred to as extreme\nverification latency. On the other hand, in streaming setups data flows are\naffected by exogenous factors that yield non-stationarities in the patterns\n(concept drift), compelling models learned incrementally from the data streams\nto adapt their modeled knowledge to the concepts within the stream. In this\nwork we address the casuistry in which these two conditions occur together, by\nwhich adaptation mechanisms to accommodate drifts within the stream are\nchallenged by the lack of supervision, requiring further mechanisms to track\nthe evolution of concepts in the absence of verification. To this end we\npropose a novel approach, AiGAS-dEVL (Adaptive Incremental neural GAS model for\ndrifting Streams under Extreme Verification Latency), which relies on growing\nneural gas to characterize the distributions of all concepts detected within\nthe stream over time. Our approach exposes that the online analysis of the\nbehavior of these prototypical points over time facilitates the definition of\nthe evolution of concepts in the feature space, the detection of changes in\ntheir behavior, and the design of adaptation policies to mitigate the effect of\nsuch changes in the model. We assess the performance of AiGAS-dEVL over several\nsynthetic datasets, comparing it to that of state-of-the-art approaches\nproposed in the recent past to tackle this stream learning setup. Our results\nreveal that AiGAS-dEVL performs competitively with respect to the rest of\nbaselines, exhibiting a superior adaptability over several datasets in the\nbenchmark while ensuring a simple and interpretable instance-based adaptation\nstrategy.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}