{"id":"2407.03568","title":"When LLM Meets Hypergraph: A Sociological Analysis on Personality via\n  Online Social Networks","authors":"Zhiyao Shu, Xiangguo Sun, Hong Cheng","authorsParsed":[["Shu","Zhiyao",""],["Sun","Xiangguo",""],["Cheng","Hong",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 01:43:52 GMT"}],"updateDate":"2024-07-08","timestamp":1720057432000,"abstract":"  Individual personalities significantly influence our perceptions, decisions,\nand social interactions, which is particularly crucial for gaining insights\ninto human behavior patterns in online social network analysis. Many\npsychological studies have observed that personalities are strongly reflected\nin their social behaviors and social environments. In light of these problems,\nthis paper proposes a sociological analysis framework for one's personality in\nan environment-based view instead of individual-level data mining.\nSpecifically, to comprehensively understand an individual's behavior from\nlow-quality records, we leverage the powerful associative ability of LLMs by\ndesigning an effective prompt. In this way, LLMs can integrate various\nscattered information with their external knowledge to generate higher-quality\nprofiles, which can significantly improve the personality analysis performance.\nTo explore the interactive mechanism behind the users and their online\nenvironments, we design an effective hypergraph neural network where the\nhypergraph nodes are users and the hyperedges in the hypergraph are social\nenvironments. We offer a useful dataset with user profile data, personality\ntraits, and several detected environments from the real-world social platform.\nTo the best of our knowledge, this is the first network-based dataset\ncontaining both hypergraph structure and social information, which could push\nforward future research in this area further. By employing the framework on\nthis dataset, we can effectively capture the nuances of individual\npersonalities and their online behaviors, leading to a deeper understanding of\nhuman interactions in the digital world.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}