{"id":"2407.19996","title":"Reproducibility Study of \"ITI-GEN: Inclusive Text-to-Image Generation\"","authors":"Daniel Gallo Fern\\'andez, R\\u{a}zvan-Andrei Matisan, Alejandro Monroy\n  Mu\\~noz, Janusz Partyka","authorsParsed":[["Fernández","Daniel Gallo",""],["Matisan","Răzvan-Andrei",""],["Muñoz","Alejandro Monroy",""],["Partyka","Janusz",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:27:44 GMT"}],"updateDate":"2024-07-30","timestamp":1722259664000,"abstract":"  Text-to-image generative models often present issues regarding fairness with\nrespect to certain sensitive attributes, such as gender or skin tone. This\nstudy aims to reproduce the results presented in \"ITI-GEN: Inclusive\nText-to-Image Generation\" by Zhang et al. (2023a), which introduces a model to\nimprove inclusiveness in these kinds of models. We show that most of the claims\nmade by the authors about ITI-GEN hold: it improves the diversity and quality\nof generated images, it is scalable to different domains, it has plug-and-play\ncapabilities, and it is efficient from a computational point of view. However,\nITI-GEN sometimes uses undesired attributes as proxy features and it is unable\nto disentangle some pairs of (correlated) attributes such as gender and\nbaldness. In addition, when the number of considered attributes increases, the\ntraining time grows exponentially and ITI-GEN struggles to generate inclusive\nimages for all elements in the joint distribution. To solve these issues, we\npropose using Hard Prompt Search with negative prompting, a method that does\nnot require training and that handles negation better than vanilla Hard Prompt\nSearch. Nonetheless, Hard Prompt Search (with or without negative prompting)\ncannot be used for continuous attributes that are hard to express in natural\nlanguage, an area where ITI-GEN excels as it is guided by images during\ntraining. Finally, we propose combining ITI-GEN and Hard Prompt Search with\nnegative prompting.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}