{"id":"2407.15513","title":"Optical Micromanipulation of Soft Materials: Applications in Devices and\n  Technologies","authors":"Sanatan Halder, Debojit Chanda, Dibyendu Mondal, Sandip Kundu, and\n  Manas Khan","authorsParsed":[["Halder","Sanatan",""],["Chanda","Debojit",""],["Mondal","Dibyendu",""],["Kundu","Sandip",""],["Khan","Manas",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 09:58:56 GMT"}],"updateDate":"2024-07-23","timestamp":1721642336000,"abstract":"  Since its invention by Arthur Ashkin and colleagues at Bell Labs in the\n1970s, optical micromanipulation, also known as optical tweezers or laser\ntweezers, has evolved remarkably to become one of the most convenient and\nversatile tools for studying soft materials, including biological systems.\nArthur Ashkin received the Nobel Prize in Physics in 2018 for enabling these\nextraordinary scientific advancements. Essentially, a focused laser beam is\nused to apply and measure minuscule forces from a few piconewtons to\nfemtonewtons by utilizing light-matter interaction at mesoscopic length scales.\nCombined with advanced microscopy and position-sensing techniques, optical\nmicromanipulations enable us to investigate diverse aspects of functional soft\nmaterials. These include studying mechanical responses through force-elongation\nmeasurements, examining the structural properties of complex fluids employing\nmicrorheology, analyzing chemical compositions using spectroscopy, and sorting\ncells through single-cell analysis. Furthermore, it is utilized in various\nsoft-matter-based devices, such as laser scissors and optical motors in\nmicrofluidic channels. This chapter presents an overview of optical\nmicromanipulation techniques by describing fundamental theories and explaining\nthe design considerations of conventional single-trap and dual-trap setups as\nwell as recent improvisations. We further discuss their capabilities and\napplications in probing exotic soft-matter systems and in developing widely\nutilized devices and technologies based on functional soft materials.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Applied Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ChdRVvHcVXLANlceVl_WB0N2H3rEM28Y-qd665oY6Po","pdfSize":"32469351"}
