{"id":"2407.12151","title":"Revisiting AGN Placement on the BPT Diagram: A Spectral Decomposition\n  Approach","authors":"Hossen Teimoorinia, Sara Shishehchi, Finn Archinuk, Joanna Woo, Robert\n  Bickley, Ping Lin, Zhonglin Hu, Emile Petit","authorsParsed":[["Teimoorinia","Hossen",""],["Shishehchi","Sara",""],["Archinuk","Finn",""],["Woo","Joanna",""],["Bickley","Robert",""],["Lin","Ping",""],["Hu","Zhonglin",""],["Petit","Emile",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 20:12:29 GMT"}],"updateDate":"2024-07-18","timestamp":1721160749000,"abstract":"  Traditional single-fibre spectroscopy provides a single galaxy spectrum,\nforming the basis for crucial parameter estimation. However, its accuracy can\nbe compromised by various sources of contamination, such as the prominent\n\\Ha~emission line originating from both Star-Forming (SF) regions and\nnon-Star-Forming regions (NonSF), including Active Galactic Nuclei (AGN). The\npotential to dissect a spectrum into its SF and NonSF constituents holds the\npromise of significantly enhancing precision in parameter estimates. In\ncontrast, Integral Field Unit (IFU) surveys present a solution to minimize\ncontamination. These surveys examine spatially localized regions within\ngalaxies, reducing the impact of mixed sources. Although an IFU survey's\nresulting spectrum covers a smaller region of a galaxy than single-fibre\nspectroscopy, it can still encompass a blend of heterogeneous sources. Our\nstudy introduces an innovative model informed by insights from the MaNGA IFU\nsurvey. This model enables the decomposition of galaxy spectra, including those\nfrom the Sloan Digital Sky Survey (SDSS), into SF and NonSF components.\nApplying our model to these survey datasets produces two distinct spectra, one\nfor SF and another for NonSF components, while conserving flux across\nwavelength bins. When these decomposed spectra are visualized on a BPT diagram,\ninteresting patterns emerge. There is a significant shift in the placement of\nthe NonSF decomposed spectra, as well as the emergence of two distinct clusters\nin the LINER and Seyfert regions. This shift highlights the key role of SF\n`contamination' in influencing the positioning of NonSF spectra within the BPT\ndiagram.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}