{"id":"2407.18889","title":"On the Pros and Cons of Active Learning for Moral Preference Elicitation","authors":"Vijay Keswani, Vincent Conitzer, Hoda Heidari, Jana Schaich Borg, and\n  Walter Sinnott-Armstrong","authorsParsed":[["Keswani","Vijay",""],["Conitzer","Vincent",""],["Heidari","Hoda",""],["Borg","Jana Schaich",""],["Sinnott-Armstrong","Walter",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:40:52 GMT"}],"updateDate":"2024-07-29","timestamp":1722015652000,"abstract":"  Computational preference elicitation methods are tools used to learn people's\npreferences quantitatively in a given context. Recent works on preference\nelicitation advocate for active learning as an efficient method to iteratively\nconstruct queries (framed as comparisons between context-specific cases) that\nare likely to be most informative about an agent's underlying preferences. In\nthis work, we argue that the use of active learning for moral preference\nelicitation relies on certain assumptions about the underlying moral\npreferences, which can be violated in practice. Specifically, we highlight the\nfollowing common assumptions (a) preferences are stable over time and not\nsensitive to the sequence of presented queries, (b) the appropriate hypothesis\nclass is chosen to model moral preferences, and (c) noise in the agent's\nresponses is limited. While these assumptions can be appropriate for preference\nelicitation in certain domains, prior research on moral psychology suggests\nthey may not be valid for moral judgments. Through a synthetic simulation of\npreferences that violate the above assumptions, we observe that active learning\ncan have similar or worse performance than a basic random query selection\nmethod in certain settings. Yet, simulation results also demonstrate that\nactive learning can still be viable if the degree of instability or noise is\nrelatively small and when the agent's preferences can be approximately\nrepresented with the hypothesis class used for learning. Our study highlights\nthe nuances associated with effective moral preference elicitation in practice\nand advocates for the cautious use of active learning as a methodology to learn\nmoral preferences.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rvLAia2jzK5BiQ93KfPmKMWBo-SM1aVTLE5VXJfKRqY","pdfSize":"3659083"}
