{"id":"2407.21024","title":"An Autonomous GIS Agent Framework for Geospatial Data Retrieval","authors":"Huan Ning, Zhenlong Li, Temitope Akinboyewa, M. Naser Lessani","authorsParsed":[["Ning","Huan",""],["Li","Zhenlong",""],["Akinboyewa","Temitope",""],["Lessani","M. Naser",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 14:23:57 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 15:32:43 GMT"}],"updateDate":"2024-08-09","timestamp":1720880637000,"abstract":"  Powered by the emerging large language models (LLMs), autonomous geographic\ninformation systems (GIS) agents have the potential to accomplish spatial\nanalyses and cartographic tasks. However, a research gap exists to support\nfully autonomous GIS agents: how to enable agents to discover and download the\nnecessary data for geospatial analyses. This study proposes an autonomous GIS\nagent framework capable of retrieving required geospatial data by generating,\nexecuting, and debugging programs. The framework utilizes the LLM as the\ndecision-maker, selects the appropriate data source (s) from a pre-defined\nsource list, and fetches the data from the chosen source. Each data source has\na handbook that records the metadata and technical details for data retrieval.\nThe proposed framework is designed in a plug-and-play style to ensure\nflexibility and extensibility. Human users or autonomous data scrawlers can add\nnew data sources by adding new handbooks. We developed a prototype agent based\non the framework, released as a QGIS plugin (GeoData Retrieve Agent) and a\nPython program. Experiment results demonstrate its capability of retrieving\ndata from various sources including OpenStreetMap, administrative boundaries\nand demographic data from the US Census Bureau, satellite basemaps from ESRI\nWorld Imagery, global digital elevation model (DEM) from OpenTopography.org,\nweather data from a commercial provider, the COVID-19 cases from the NYTimes\nGitHub. Our study is among the first attempts to develop an autonomous\ngeospatial data retrieval agent.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PBX_vtkjdgl2B9mYr6Hvz9MAPKpSYwK6y3s6_StQLb0","pdfSize":"1517109"}
