{"id":"2407.01597","title":"Machine learning driven high-resolution Raman spectral generation for\n  accurate molecular feature recognition","authors":"Vikas Yadav, Abhay Kumar Tiwari, Soumik Siddhanta","authorsParsed":[["Yadav","Vikas",""],["Tiwari","Abhay Kumar",""],["Siddhanta","Soumik",""]],"versions":[{"version":"v1","created":"Tue, 25 Jun 2024 11:04:48 GMT"}],"updateDate":"2024-07-03","timestamp":1719313488000,"abstract":"  Through the probing of light-matter interactions, Raman spectroscopy provides\ninvaluable insights into the composition, structure, and dynamics of materials,\nand obtaining such data from portable and cheap instruments is of immense\npractical relevance. Here, we propose the integration of a Generative\nAdversarial Network (GAN) with low-resolution Raman spectroscopy with a\nportable hand-held spectrometer to facilitate concurrent spectral analysis and\ncompound classification. Portable spectrometers generally have a lower\nresolution, and the Raman signal is usually buried under the background noise.\nThe GAN-based model could not only generate high-resolution data but also\nreduced the spectral noise significantly. The generated data was used further\nto train an Artificial Neural Network (ANN)-based model for the classification\nof organic and pharmaceutical drug molecules. The high-resolution generated\nRaman data was subsequently used for spectral barcoding for identification of\nthe pharmaceutical drugs. GAN also demonstrated enhanced robustness in\nextracting weak signals compared to conventional noise removal methods. This\nintegrated system holds the potential for achieving accurate and real-time\nmonitoring of noisy inputs to obtain high throughput output, thereby opening\nnew avenues for applications in different domains. This synergy between\nspectroscopy and machine learning (ML) facilitates improved data processing,\nnoise reduction, and feature extraction and opens avenues for predictive\nmodeling and automated decision-making using cost-effective portable devices.\n","subjects":["Physics/Chemical Physics","Physics/Applied Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"JwY7N9fUsMGfZwhnY0Kz4xSIr3X8cS_kdLnL74463Aw","pdfSize":"1599815"}
