{"id":"2407.09575","title":"Design of an 8-Channel 40 GS/s 20 mW/Ch Waveform Sampling ASIC in 65 nm\n  CMOS","authors":"Jinseo Park, Evan Angelico, Andrew Arzac, Davide Braga, Ahan Datta,\n  Troy England, Camden Ertley, Farah Fahim, Henry J. Frisch, Mary Heintz, Eric\n  Oberla, Nathaniel J. Pastika, Hector D. Rico-Aniles, Paul M. Rubinov, Xiaoran\n  Wang, Yui Man Richmond Yeung, Tom N. Zimmerman","authorsParsed":[["Park","Jinseo",""],["Angelico","Evan",""],["Arzac","Andrew",""],["Braga","Davide",""],["Datta","Ahan",""],["England","Troy",""],["Ertley","Camden",""],["Fahim","Farah",""],["Frisch","Henry J.",""],["Heintz","Mary",""],["Oberla","Eric",""],["Pastika","Nathaniel J.",""],["Rico-Aniles","Hector D.",""],["Rubinov","Paul M.",""],["Wang","Xiaoran",""],["Yeung","Yui Man Richmond",""],["Zimmerman","Tom N.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 20:06:07 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 18:19:26 GMT"}],"updateDate":"2024-07-19","timestamp":1720728367000,"abstract":"  1 ps timing resolution is the entry point to signature based searches relying\non secondary/tertiary vertices and particle identification. We describe a\npreliminary design for PSEC5, an 8-channel 40 GS/s waveform-sampling ASIC in\nthe TSMC 65 nm process targetting 1 ps resolution at 20 mW power per channel.\nEach channel consists of four fast and one slow switched capacitor arrays\n(SCA), allowing ps time resolution combined with a long effective buffer. Each\nfast SCA is 1.6 ns long and has a nominal sampling rate of 40 GS/s. The slow\nSCA is 204.8 ns long and samples at 5 GS/s. Recording of the analog data for\neach channel is triggered by a fast discriminator capable of multiple\ntriggering during the window of the slow SCA. To achieve a large dynamic range,\nlow leakage, and high bandwidth, the SCA sampling switches are implemented as\n2.5 V nMOSFETs controlled by 1.2 V shift registers. Stored analog data are\ndigitized by an external ADC at 10 bits or better. Specifications on\noperational parameters include a 4 GHz analog bandwidth and a dead time of 20\nmicroseconds, corresponding to a 50 kHz readout rate, determined by the choice\nof the external ADC.\n","subjects":["Physics/Instrumentation and Detectors","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/"}