{"id":"2407.20945","title":"Physically-consistent Multi-band Massive MIMO Systems: A Radio Resource\n  Management Model","authors":"Nuwan Balasuriya, Amine Mezghani, and Ekram Hossain","authorsParsed":[["Balasuriya","Nuwan",""],["Mezghani","Amine",""],["Hossain","Ekram",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 16:25:18 GMT"}],"updateDate":"2024-07-31","timestamp":1722356718000,"abstract":"  Massive multiple-input multiple-output (mMIMO) antenna systems and inter-band\ncarrier aggregation (CA)-enabled multi-band communication are two key\ntechnologies to achieve very high data rates in beyond fifth generation (B5G)\nwireless systems. We propose a joint optimization framework for such systems\nwhere the mMIMO antenna spacing selection, precoder optimization, optimum\nsub-carrier selection and optimum power allocation are carried out\nsimultaneously. We harness the bandwidth gain existing in a tightly coupled\nbase station mMIMO antenna system to avoid sophisticated, non-practical antenna\nsystems for multi-band operation. In particular, we analyze a multi-band\ncommunication system using a circuit-theoretic model to consider physical\ncharacteristics of a tightly coupled antenna array, and formulate a joint\noptimization problem to maximize the sum-rate. As part of the optimization, we\nalso propose a novel block iterative water-filling-based sub-carrier selection\nand power allocation optimization algorithm for the multi-band mMIMO system. A\nnovel sub-carrier windowing-based sub-carrier selection scheme is also proposed\nwhich considers the physical constraints (hardware limitation) at the mobile\nuser devices. We carryout the optimizations in two ways: (i) to optimize the\nantenna spacing selection in an offline manner, and (ii) to select antenna\nelements from a dense array dynamically. Via computer simulations, we\nillustrate superior bandwidth gains present in the tightly-coupled colinear and\nrectangular planar antenna arrays, compared to the loosely-coupled or\ntightly-coupled parallel arrays. We further show the optimum sum-rate\nperformance of the proposed optimization-based framework under various power\nallocation schemes and various user capability scenarios.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}