{"id":"2407.12695","title":"Highly Efficient Parallel Row-Layered Min-Sum MDPC Decoder for McEliece\n  Cryptosystem","authors":"Jiaxuan Cai and Xinmiao Zhang","authorsParsed":[["Cai","Jiaxuan",""],["Zhang","Xinmiao",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 16:19:42 GMT"}],"updateDate":"2024-07-18","timestamp":1721233182000,"abstract":"  The medium-density parity-check (MDPC) code-based McEliece cryptosystem\nremains a finalist of the post-quantum cryptography standard. The Min-sum\ndecoding algorithm achieves better performance-complexity tradeoff than other\nalgorithms for MDPC codes. However, the prior Min-sum MDPC decoder requires\nlarge memories, whose complexity dominates the overall complexity. Besides, its\nactual achievable parallelism is limited. This paper has four contributions:\nFor the first time, the row-layered scheduling scheme is exploited to\nsubstantially reduce the memory requirement of MDPC decoders; A low-complexity\nscheme is developed to mitigate the performance loss caused by finite precision\nrepresentation of the messages and high column weights of MDPC codes in\nrow-layered decoding; Constraints are added to the parity check matrix\nconstruction to enable effective parallel processing with negligible impacts on\nthe decoder performance and resilience towards attacks; A novel parity check\nmatrix division scheme for highly efficient parallel processing is proposed and\nthe corresponding parallel row-layered decoder architecture is designed. The\nnumber of clock cycles for each decoding iteration is reduced by a factor of L\nusing the proposed L-parallel decoder with very small memory overhead. For an\nexample 2-parallel decoder, the proposed design leads to 26% less memory\nrequirement and 70% latency reduction compared to the prior decoder.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Hardware Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}