{"id":"2407.15158","title":"HERGen: Elevating Radiology Report Generation with Longitudinal Data","authors":"Fuying Wang, Shenghui Du, Lequan Yu","authorsParsed":[["Wang","Fuying",""],["Du","Shenghui",""],["Yu","Lequan",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 13:29:16 GMT"}],"updateDate":"2024-07-23","timestamp":1721568556000,"abstract":"  Radiology reports provide detailed descriptions of medical imaging integrated\nwith patients' medical histories, while report writing is traditionally\nlabor-intensive, increasing radiologists' workload and the risk of diagnostic\nerrors. Recent efforts in automating this process seek to mitigate these issues\nby enhancing accuracy and clinical efficiency. Emerging research in automating\nthis process promises to alleviate these challenges by reducing errors and\nstreamlining clinical workflows. However, existing automated approaches are\nbased on a single timestamp and often neglect the critical temporal aspect of\npatients' imaging histories, which is essential for accurate longitudinal\nanalysis. To address this gap, we propose a novel History Enhanced Radiology\nReport Generation (HERGen) framework that employs a employs a group causal\ntransformer to efficiently integrate longitudinal data across patient visits.\nOur approach not only allows for comprehensive analysis of varied historical\ndata but also improves the quality of generated reports through an auxiliary\ncontrastive objective that aligns image sequences with their corresponding\nreports. More importantly, we introduce a curriculum learning-based strategy to\nadeptly handle the inherent complexity of longitudinal radiology data and thus\nstabilize the optimization of our framework. The extensive evaluations across\nthree datasets demonstrate that our framework surpasses existing methods in\ngenerating accurate radiology reports and effectively predicting disease\nprogression from medical images.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}