{"id":"2407.20627","title":"A simple numerical model of the water bottle flipping experiment","authors":"Julie Nassoy, Margot Nguyen Huu, L\\'eon Rembotte (LP2N, CRPP),\n  Jean-Baptiste Trebbia (LP2N), Pierre Nassoy (LP2N)","authorsParsed":[["Nassoy","Julie","","LP2N, CRPP"],["Huu","Margot Nguyen","","LP2N, CRPP"],["Rembotte","Léon","","LP2N, CRPP"],["Trebbia","Jean-Baptiste","","LP2N"],["Nassoy","Pierre","","LP2N"]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 08:03:49 GMT"}],"updateDate":"2024-07-31","timestamp":1722326629000,"abstract":"  The water bottle flip experiment is a recreational, non-conventional\nillustration of the conservation of angular moment. When a bottle partially\nfilled with water is thrown in a rotational motion, water redistributes\nthroughout the bottle, resulting in an increase of moment of inertia and thus\nto a decrease in angular velocity, which increases the probability of it\nfalling upright on a table as compared with a bottle filled with ice. The\ninvestigation of this phenomenom is accessible to undergraduate students and\nshould allow them to gain better understanding of combined translational and\nrotational motions in classical mechanics. In addition to reporting a series of\ndetailed experiments and analyzing them using standard image analysis, we\nprovide a simple theoretical framework and subsequent numerical implementation\nbased on the decomposition of the water volume into thin slices of a rigid body\nthat are subjected to fictitious forces in the non-inertial frame of the\nspinning bottle. This model allows us to capture quantitatively the main\nexperimental findings, including the angular velocity slow-down for a given\nrange of water filling fractions. Finally, we discuss additionnal\ncounter-intuitive effects that contribute to bottle stabilization on landing.\n","subjects":["Physics/Popular Physics","Physics/Classical Physics","Physics/Physics Education"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}