{"id":"2407.12611","title":"Deep Mutual Learning among Partially Labeled Datasets for Multi-Organ\n  Segmentation","authors":"Xiaoyu Liu, Linhao Qu, Ziyue Xie, Yonghong Shi, and Zhijian Song","authorsParsed":[["Liu","Xiaoyu",""],["Qu","Linhao",""],["Xie","Ziyue",""],["Shi","Yonghong",""],["Song","Zhijian",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:41:25 GMT"}],"updateDate":"2024-07-18","timestamp":1721227285000,"abstract":"  The task of labeling multiple organs for segmentation is a complex and\ntime-consuming process, resulting in a scarcity of comprehensively labeled\nmulti-organ datasets while the emergence of numerous partially labeled\ndatasets. Current methods are inadequate in effectively utilizing the\nsupervised information available from these datasets, thereby impeding the\nprogress in improving the segmentation accuracy. This paper proposes a\ntwo-stage multi-organ segmentation method based on mutual learning, aiming to\nimprove multi-organ segmentation performance by complementing information among\npartially labeled datasets. In the first stage, each partial-organ segmentation\nmodel utilizes the non-overlapping organ labels from different datasets and the\ndistinct organ features extracted by different models, introducing additional\nmutual difference learning to generate higher quality pseudo labels for\nunlabeled organs. In the second stage, each full-organ segmentation model is\nsupervised by fully labeled datasets with pseudo labels and leverages true\nlabels from other datasets, while dynamically sharing accurate features across\ndifferent models, introducing additional mutual similarity learning to enhance\nmulti-organ segmentation performance. Extensive experiments were conducted on\nnine datasets that included the head and neck, chest, abdomen, and pelvis. The\nresults indicate that our method has achieved SOTA performance in segmentation\ntasks that rely on partial labels, and the ablation studies have thoroughly\nconfirmed the efficacy of the mutual learning mechanism.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"idP0vsevW5k2ALclsCmUcuHxDEVq8BMDVZWEktaTDGM","pdfSize":"6937530","objectId":"0x57742369d66fcce86218aa7fb4bc016195580ab86146e9bf06055b0e27c4c295","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
