{"id":"2407.10375","title":"Axisymmetric displacement flows in fluid-driven fractures","authors":"Sri Savya Tanikella, Emilie Dressaire","authorsParsed":[["Tanikella","Sri Savya",""],["Dressaire","Emilie",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 00:56:57 GMT"}],"updateDate":"2024-07-16","timestamp":1721005017000,"abstract":"  Displacement flows are common in hydraulic fracturing, as fracking fluids of\ndifferent composition are injected sequentially in the fracture. The injection\nof an immiscible fluid at the center of a liquid-filled fracture results in the\ngrowth of the fracture and the outward displacement of the interface between\nthe two liquids. We study the dynamics of the fluid-driven fracture which is\ncontrolled by the competition between viscous, elastic, and toughness-related\nstresses. We use a model experiment to characterize the dynamics of the\nfracture for a range of mechanical properties of the fractured material and\nfracturing fluids. We form the liquid-filled pre-fracture in an elastic brittle\nmatrix of gelatin. The displacing liquid is then injected. We record the radius\nand aperture of the fracture, and the position of the interface between the two\nliquids. In a typical experiment, the axisymmetric radial viscous flow is\naccommodated by the elastic deformation and fracturing of the matrix. We model\nthe coupling between elastic deformation, viscous dissipation, and fracture\npropagation and recover the two fracturing regimes identified for single fluid\ninjection. For the viscous-dominated and toughness-dominated regimes, we derive\nscaling equations that describe the crack growth due to a displacement flow and\nshow the influence of the pre-existing fracture on the crack dynamics through a\nfinite initial volume and an average viscosity of the fluid in the fracture.\n","subjects":["Physics/Fluid Dynamics","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"D53HX8WqNa64kVO7l7b8nKFBzjdq8mP-0YsWuFQHoz8","pdfSize":"4912565"}
