{"id":"2407.04302","title":"Fair Federated Data Clustering through Personalization: Bridging the Gap\n  between Diverse Data Distributions","authors":"Shivam Gupta, Tarushi, Tsering Wangzes, Shweta Jain","authorsParsed":[["Gupta","Shivam",""],["Tarushi","",""],["Wangzes","Tsering",""],["Jain","Shweta",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 07:10:26 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 08:35:33 GMT"}],"updateDate":"2024-07-15","timestamp":1720163426000,"abstract":"  The rapid growth of data from edge devices has catalyzed the performance of\nmachine learning algorithms. However, the data generated resides at client\ndevices thus there are majorly two challenge faced by traditional machine\nlearning paradigms - centralization of data for training and secondly for most\nthe generated data the class labels are missing and there is very poor\nincentives to clients to manually label their data owing to high cost and lack\nof expertise. To overcome these issues, there have been initial attempts to\nhandle unlabelled data in a privacy preserving distributed manner using\nunsupervised federated data clustering. The goal is partition the data\navailable on clients into $k$ partitions (called clusters) without actual\nexchange of data. Most of the existing algorithms are highly dependent on data\ndistribution patterns across clients or are computationally expensive.\nFurthermore, due to presence of skewed nature of data across clients in most of\npractical scenarios existing models might result in clients suffering high\nclustering cost making them reluctant to participate in federated process. To\nthis, we are first to introduce the idea of personalization in federated\nclustering. The goal is achieve balance between achieving lower clustering cost\nand at same time achieving uniform cost across clients. We propose p-FClus that\naddresses these goal in a single round of communication between server and\nclients. We validate the efficacy of p-FClus against variety of federated\ndatasets showcasing it's data independence nature, applicability to any finite\n$\\ell$-norm, while simultaneously achieving lower cost and variance.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}