{"id":"2407.04613","title":"Thermal and mechanical study of a parametrised cryostat model for\n  optical characterisation of upcoming CMB experiments","authors":"Thomas J.L.J. Gascard, Yi Wang, Jon E. Gudmundsson, Eve M. Vavagiakis,\n  Cody J. Duell, Zachary B. Huber, Lawrence T. Lin, Michael D. Niemack and\n  Rodrigo G. Freundt","authorsParsed":[["Gascard","Thomas J. L. J.",""],["Wang","Yi",""],["Gudmundsson","Jon E.",""],["Vavagiakis","Eve M.",""],["Duell","Cody J.",""],["Huber","Zachary B.",""],["Lin","Lawrence T.",""],["Niemack","Michael D.",""],["Freundt","Rodrigo G.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 16:09:53 GMT"}],"updateDate":"2024-07-08","timestamp":1720195793000,"abstract":"  Current and future experiments observing the cosmic microwave background\nrequire a detailed understanding of optical performance at cryogenic\ntemperatures. Pre-deployment analysis of optics can be performed in\ncustom-engineered cryogenic test beds, such as Mod-Cam, a first light camera\nfor the CCAT project. This work presents studies of the mechanical and thermal\nperformance of CryoSim, a model of a generic cylindrical 4-K cryostat cooled\nwith a commercial pulse tube cryocooler that can be used to characterise\noptical components and full reimaging optical systems. CryoSim is extensively\nparametrised, allowing the joint analysis and optimisation of mechanical and\nthermal performance via finite element methods. Results from this model are\nvalidated against measured cooldown data of the Mod-Cam cryostat. Due to the\nextensive parametrisation of the model, significant modifications of the\ncryostat geometry may be implemented to be representative of any system the\nscientific community may desire, and validation of thermal and mechanical\nperformance can be carried out rapidly.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}