{"id":"2407.03355","title":"Advancing Visual Computing in Materials Science (Shonan Seminar 189)","authors":"Christoph Heinzl, Renata Georgia Raidou, Kristi Potter, Yuriko\n  Takeshima, Mike Kirby, Guillermo Requena","authorsParsed":[["Heinzl","Christoph",""],["Raidou","Renata Georgia",""],["Potter","Kristi",""],["Takeshima","Yuriko",""],["Kirby","Mike",""],["Requena","Guillermo",""]],"versions":[{"version":"v1","created":"Thu, 20 Jun 2024 10:27:50 GMT"}],"updateDate":"2024-07-08","timestamp":1718879270000,"abstract":"  Materials science has a significant impact on society and its quality of\nlife, e.g., through the development of safer, more durable, more economical,\nenvironmentally friendly, and sustainable materials. Visual computing in\nmaterials science integrates computer science disciplines from image\nprocessing, visualization, computer graphics, pattern recognition, computer\nvision, virtual and augmented reality, machine learning, to human-computer\ninteraction, to support the acquisition, analysis, and synthesis of (visual)\nmaterials science data with computer resources. Therefore, visual computing may\nprovide fundamentally new insights into materials science problems by\nfacilitating the understanding, discovery, design, and usage of complex\nmaterial systems. This seminar is considered as a follow-up of the Dagstuhl\nSeminar 19151 Visual Computing in Materials Sciences, held in April 2019. Since\nthen, the field has kept evolving and many novel challenges have emerged, with\nregard to more traditional topics in visual computing, such as topology\nanalysis or image processing and analysis, to recently emerging topics, such as\nuncertainty and ensemble analysis, and to the integration of new research\ndisciplines and exploratory technologies, such machine learning and immersive\nanalytics. With the current seminar, we target to strengthen and extend the\ncollaboration between the domains of visual computing and materials science\n(and across visual computing disciplines), by foreseeing challenges and\nidentifying novel directions of interdisciplinary work. We brought visual\ncomputing and visualization experts from academia, research centers, and\nindustry together with domain experts, to uncover the overlaps of visual\ncomputing and materials science and to discover yet-unsolved challenges, on\nwhich we can collaborate to achieve a higher societal impact.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}