{"id":"2407.18071","title":"Intergalactic-Absorption Confounding Circumgalactic Observations","authors":"Itai Bromberg, Kartick C.Sarkar, Orly Gnat, and Yuval Brinboim","authorsParsed":[["Bromberg","Itai",""],["Sarkar","Kartick C.",""],["Gnat","Orly",""],["Brinboim","Yuval",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 14:26:16 GMT"}],"updateDate":"2024-07-26","timestamp":1721917576000,"abstract":"  The origin of warm ions in the circum-galactic medium (CGM) surrounding\nmassive galaxies remains a mystery. In this paper, we argue that a significant\nfraction of the observed warm-ion columns may arise in the intergalactic medium\n(IGM) surrounding galactic halos. We use a simple spherical collapse model of\nthe dark matter (DM) halos and their baryonic content to compute the evolving\nion fractions within and outside virial halos. We show that the photoionized\nIGM may produce a thick blanket of warm ions around the CGM, thereby\ncontaminating CGM observations. We find that the IGM contributes $> 75\\%$ of\nthe total \\ion{O}{6} column densities in halos with virial masses exceeding a\nfew times $10^{11}~M_\\odot$, and that it may dominate the \\ion{O}{6} absorption\neven for lower mass-halos, depending on the impact parameter. We compare our\nresults with observations and find that our simplified model reproduces the\noverall \\ion{O}{6} columns as well as their trend with the impact parameter and\nhalo mass. We show that observed warm ion columns may be completely dominated\nby the IGM envelopes, consistent with CGM$^2$ data. We, therefore, suggest that\ntheoretical interpretations of CGM-survey observations must consider the\npossible contribution of the surrounding IGM. Although our simplified model\nsuggests that it may be possible to kinematically distinguish between CGM and\nIGM origins through the absorption line profiles, this distinction is likely\nunfeasible in realistic astrophysical halos, due to the complex velocity\nstructure in the multi-phased CGM.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}