{"id":"2407.05554","title":"PANS: Probabilistic Airway Navigation System for Real-time Robust\n  Bronchoscope Localization","authors":"Qingyao Tian, Zhen Chen, Huai Liao, Xinyan Huang, Bingyu Yang, Lujie\n  Li, Hongbin Liu","authorsParsed":[["Tian","Qingyao",""],["Chen","Zhen",""],["Liao","Huai",""],["Huang","Xinyan",""],["Yang","Bingyu",""],["Li","Lujie",""],["Liu","Hongbin",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 02:13:41 GMT"}],"updateDate":"2024-07-09","timestamp":1720404821000,"abstract":"  Accurate bronchoscope localization is essential for pulmonary interventions,\nby providing six degrees of freedom (DOF) in airway navigation. However, the\nrobustness of current vision-based methods is often compromised in clinical\npractice, and they struggle to perform in real-time and to generalize across\ncases unseen during training. To overcome these challenges, we propose a novel\nProbabilistic Airway Navigation System (PANS), leveraging Monte-Carlo method\nwith pose hypotheses and likelihoods to achieve robust and real-time\nbronchoscope localization. Specifically, our PANS incorporates diverse visual\nrepresentations (\\textit{e.g.}, odometry and landmarks) by leveraging two key\nmodules, including the Depth-based Motion Inference (DMI) and the Bronchial\nSemantic Analysis (BSA). To generate the pose hypotheses of bronchoscope for\nPANS, we devise the DMI to accurately propagate the estimation of pose\nhypotheses over time. Moreover, to estimate the accurate pose likelihood, we\ndevise the BSA module by effectively distinguishing between similar bronchial\nregions in endoscopic images, along with a novel metric to assess the\ncongruence between estimated depth maps and the segmented airway structure.\nUnder this probabilistic formulation, our PANS is capable of achieving the\n6-DOF bronchoscope localization with superior accuracy and robustness.\nExtensive experiments on the collected pulmonary intervention dataset\ncomprising 10 clinical cases confirm the advantage of our PANS over\nstate-of-the-arts, in terms of both robustness and generalization in localizing\ndeeper airway branches and the efficiency of real-time inference. The proposed\nPANS reveals its potential to be a reliable tool in the operating room,\npromising to enhance the quality and safety of pulmonary interventions.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}