{"id":"2407.12209","title":"A question of personalities: evolution of viscous and wind-driven\n  protoplanetary discs in the presence of dead zones","authors":"Simin Tong, Richard Alexander and Giovanni Rosotti","authorsParsed":[["Tong","Simin",""],["Alexander","Richard",""],["Rosotti","Giovanni",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 23:06:22 GMT"}],"updateDate":"2024-07-18","timestamp":1721171182000,"abstract":"  Whether the angular momentum of protoplanetary discs is redistributed by\nviscosity or extracted by magnetised winds is a long-standing question.\nDemographic indicators, such as gas disc sizes and stellar accretion rates,\nhave been proposed as ways of distinguishing between these two mechanisms. In\nthis paper, we implement one-dimensional gas simulations to study the evolution\nof \"hybrid\" protoplanetary discs simultaneously driven by viscosity and\nmagnetised winds, with dead zones present. We explore how the variations of\ndisc properties, including initial disc sizes, dead zone sizes and angular\nmomentum transport efficiency, affect stellar accretion rates, disc surface\ndensity profiles, disc sizes, disc lifetimes, and cumulative mass loss by\ndifferent processes. Our models show that the expansion of the gas disc size\ncan be sustained when the majority of angular momentum is removed by the\nmagnetised wind for individual protoplanetary discs. However, when we can only\nobserve discs via demographic screenshots, the variation of disc sizes with\ntime is possibly diminished by the disc \"personalities\", by which we mean the\nvariations of initial disc properties among different discs. Our \"hybrid\"\nmodels re-assess association of the two demographic indicators with mechanisms\nresponsible for angular momentum transport and suggest additional diagnostics\nare required to assist the differentiation.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}