{"id":"2407.11657","title":"Hyperfine structure of the methanol molecule as traced by Class I\n  methanol masers","authors":"I. I. Agafonova, O. S. Bayandina, Y. Gong, C. Henkel, Kee-Tae Kim, M.\n  G. Kozlov, B. Lankhaar, S. A. Levshakov, K. M. Menten, W. Ubachs, I. E.\n  Val'tts, W. Yang","authorsParsed":[["Agafonova","I. I.",""],["Bayandina","O. S.",""],["Gong","Y.",""],["Henkel","C.",""],["Kim","Kee-Tae",""],["Kozlov","M. G.",""],["Lankhaar","B.",""],["Levshakov","S. A.",""],["Menten","K. M.",""],["Ubachs","W.",""],["Val'tts","I. E.",""],["Yang","W.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 12:24:26 GMT"}],"updateDate":"2024-07-17","timestamp":1721132666000,"abstract":"  We present results on simultaneous observations of Class~I methanol masers at\n25, 36, and 44 GHz towards 22 Galactic targets carried out with the Effelsberg\n100-m telescope. The study investigates relations between the hyperfine (HF)\nstructure of the torsion-rotation transitions in CH3OH and maser activity. By\nanalyzing the radial velocity shifts between different maser lines together\nwith the patterns of the HF structure based on laboratory measurements and\nquantum-chemical calculations, we find that in any source only one specific HF\ntransition forms the maser emission and that this transition changes from\nsource to source. The physical conditions leading to this selective behavior\nare still unclear. Using accurate laboratory rest frequencies for the 25 GHz\ntransitions, we have refined the centre frequencies for the HF multiplets at\n36, 44, and 95 GHz: f_36 = (36169.2488 +/- 0.0002_stat +/- 0.0004_sys) MHz.\nf_44 = (44069.4176 +/- 0.0002_stat +/- 0.0004_sys) MHz, and f_95 = (95169.4414\n+/- 0.0003_stat +/- 0.0004_sys) MHz. Comparison with previous observations of\n44 GHz masers performed 6-10 years ago with a Korean 21-m KVN telescope towards\nthe same targets confirms the kinematic stability of Class~I maser line\nprofiles during this time interval and reveals a systematic radial velocity\nshift of 0.013 +/- 0.005 km/s between the two telescopes.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}