{"id":"2407.20681","title":"Investigating Mass Reduction Capabilities of Additive Manufacturing\n  through the Re-Design of a Space-Based Mirror","authors":"Rhys Tuck (1), Younes Chahid (1), Greg Lister (1), Katherine Morris\n  (1), James Carruthers (1), Mat Beardsley (2), Michael Harris (2), Michal\n  Matukiewicz (2), Simon G. Alcock (3), Ioana-Theodora Nistea (3) and Carolyn\n  Atkins (1)","authorsParsed":[["Tuck","Rhys",""],["Chahid","Younes",""],["Lister","Greg",""],["Morris","Katherine",""],["Carruthers","James",""],["Beardsley","Mat",""],["Harris","Michael",""],["Matukiewicz","Michal",""],["Alcock","Simon G.",""],["Nistea","Ioana-Theodora",""],["Atkins","Carolyn",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 09:22:14 GMT"}],"updateDate":"2024-07-31","timestamp":1722331334000,"abstract":"  Additive manufacture (AM) involves creating a part layer by layer and is a\nrapidly evolving manufacturing process. It has multiple strengths that apply to\nspace-based optics, such as the ability to consolidate multiple parts into one,\nreducing the number of interfaces. The process also allows for greater mass\nreduction, making parts more cost-effective to launch, achieved by optimising\nthe shape for intended use or creating intricate geometries like lattices.\nHowever, previous studies have highlighted issues associated with the AM\nprocess. For example, when trying to achieve high-precision optical surfaces on\nAM parts, the latticing on the underside of mirrors can provide insufficient\nsupport during machining, resulting in the quilting effect.\n  This paper builds on previous work and explores such challenges further. This\nwill be implemented by investigating ways to apply AM to a deployable mirror\nfrom a CubeSat project called A-DOT. The reflective surface has a spherical\nradius of curvature of 682 mm and approximate external dimensions of 106 mm x\n83 mm. The aim is to produce two mirrors that will take full advantage of AM\ndesign benefits and account for the challenges in printing and machining a\nnear-net shape. The designs will have reduced mass by using selected internal\nlattice designs and topology-optimised connection points, resulting in two\nmirrors with mass reduction targets of 50% and 70%. Once printed in aluminium\nusing laser powder bed fusion, the reflective surface will be created using\nsingle point diamond turning. Finally, an evaluation of the dimensional\naccuracy will be conducted, using interferometry, to quantify the performance\nof the reflective surface.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Pmhs5yaQD2AmqqaNJyiyRz4ybumhGcgiGaivtFyS9Rk","pdfSize":"24027269"}
