{"id":"2407.02059","title":"Unconventional p-wave and finite-momentum superconductivity induced by\n  altermagnetism through the formation of Bogoliubov Fermi surface","authors":"SeungBeom Hong and Moon Jip Park and Kyoung-Min Kim","authorsParsed":[["Hong","SeungBeom",""],["Park","Moon Jip",""],["Kim","Kyoung-Min",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 08:44:30 GMT"}],"updateDate":"2024-07-04","timestamp":1719909870000,"abstract":"  Altermagnet is an exotic class of magnetic materials wherein the Fermi\nsurface exhibits a momentum-dependent spin-splitting while maintaining a net\nzero magnetization. Previous studies have shown that this distinctive\nspin-splitting can induce chiral p-wave superconductors or Fulde-Ferrell\nsuperconducting states carrying finite momentum. However, the underlying\nmechanisms of such unconventional superconductivities remain incompletely\nunderstood. Here, we propose that the formation of the Bogoliubov Fermi surface\nthrough the exchange field can play a significant role in such phenomena.\nThrough a systematic self-consistent mean-field analysis on the extended\nattractive Hubbard model combined with the d-wave spin-splitting induced by the\nexchange field, as observed in RuO2, we demonstrate that the formation of the\nBogoliubov Fermi surface suppresses conventional spin-singlet superconducting\nstates with s-wave characteristics. In contrast, the chiral p-wave state\nmaintains a fully gapped spectrum without the Fermi surface, thereby becoming\nthe ground state in the strong field regime. In the intermediate regime, we\nfind that the Fulde-Ferrell state becomes the predominant state through the\noptimization of available channels for Cooper pairing. Moreover, we illustrate\nhow the prevalence of the chiral p-wave and Fulde-Ferrell states over the\ns-wave state changes under the variation of the field strength or chemical\npotential. Our findings provide valuable insights into potential pathways for\nrealizing sought-after topological p-wave superconductivity and finite momentum\npairing facilitated by altermagnetism.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}