{"id":"2407.05529","title":"Behind the Deepfake: 8% Create; 90% Concerned. Surveying public exposure\n  to and perceptions of deepfakes in the UK","authors":"Tvesha Sippy, Florence Enock, Jonathan Bright, Helen Z. Margetts","authorsParsed":[["Sippy","Tvesha",""],["Enock","Florence",""],["Bright","Jonathan",""],["Margetts","Helen Z.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 00:22:51 GMT"}],"updateDate":"2024-07-09","timestamp":1720398171000,"abstract":"  This article examines public exposure to and perceptions of deepfakes based\non insights from a nationally representative survey of 1403 UK adults. The\nsurvey is one of the first of its kind since recent improvements in deepfake\ntechnology and widespread adoption of political deepfakes. The findings reveal\nthree key insights. First, on average, 15% of people report exposure to harmful\ndeepfakes, including deepfake pornography, deepfake frauds/scams and other\npotentially harmful deepfakes such as those that spread health/religious\nmisinformation/propaganda. In terms of common targets, exposure to deepfakes\nfeaturing celebrities was 50.2%, whereas those featuring politicians was 34.1%.\nAnd 5.7% of respondents recall exposure to a selection of high profile\npolitical deepfakes in the UK. Second, while exposure to harmful deepfakes was\nrelatively low, awareness of and fears about deepfakes were high (and women\nwere significantly more likely to report experiencing such fears than men). As\nwith fears, general concerns about the spread of deepfakes were also high;\n90.4% of the respondents were either very concerned or somewhat concerned about\nthis issue. Most respondents (at least 91.8%) were concerned that deepfakes\ncould add to online child sexual abuse material, increase distrust in\ninformation and manipulate public opinion. Third, while awareness about\ndeepfakes was high, usage of deepfake tools was relatively low (8%). Most\nrespondents were not confident about their detection abilities and were\ntrustful of audiovisual content online. Our work highlights how the problem of\ndeepfakes has become embedded in public consciousness in just a few years; it\nalso highlights the need for media literacy programmes and other policy\ninterventions to address the spread of harmful deepfakes.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}