{"id":"2407.16988","title":"DreamCar: Leveraging Car-specific Prior for in-the-wild 3D Car\n  Reconstruction","authors":"Xiaobiao Du, Haiyang Sun, Ming Lu, Tianqing Zhu, Xin Yu","authorsParsed":[["Du","Xiaobiao",""],["Sun","Haiyang",""],["Lu","Ming",""],["Zhu","Tianqing",""],["Yu","Xin",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 04:13:43 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 01:16:47 GMT"}],"updateDate":"2024-07-31","timestamp":1721794423000,"abstract":"  Self-driving industries usually employ professional artists to build\nexquisite 3D cars. However, it is expensive to craft large-scale digital\nassets. Since there are already numerous datasets available that contain a vast\nnumber of images of cars, we focus on reconstructing high-quality 3D car models\nfrom these datasets. However, these datasets only contain one side of cars in\nthe forward-moving scene. We try to use the existing generative models to\nprovide more supervision information, but they struggle to generalize well in\ncars since they are trained on synthetic datasets not car-specific. In\naddition, The reconstructed 3D car texture misaligns due to a large error in\ncamera pose estimation when dealing with in-the-wild images. These restrictions\nmake it challenging for previous methods to reconstruct complete 3D cars. To\naddress these problems, we propose a novel method, named DreamCar, which can\nreconstruct high-quality 3D cars given a few images even a single image. To\ngeneralize the generative model, we collect a car dataset, named Car360, with\nover 5,600 vehicles. With this dataset, we make the generative model more\nrobust to cars. We use this generative prior specific to the car to guide its\nreconstruction via Score Distillation Sampling. To further complement the\nsupervision information, we utilize the geometric and appearance symmetry of\ncars. Finally, we propose a pose optimization method that rectifies poses to\ntackle texture misalignment. Extensive experiments demonstrate that our method\nsignificantly outperforms existing methods in reconstructing high-quality 3D\ncars. \\href{https://xiaobiaodu.github.io/dreamcar-project/}{Our code is\navailable.}\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JE3wVLW4y4oIkrENrkoAeuV-OqLx6svdYll33itb_is","pdfSize":"5352880"}
