{"id":"2407.05727","title":"Low velocity streams inside the planetary nebula H 2-18. A 3D\n  photoionization and kinematical reconstruction","authors":"K. Gesicki, A. Zijlstra, M. Hajduk, A. Iwanowska, K. Grzesiak, K.\n  Lisiecki and J. Lipinski","authorsParsed":[["Gesicki","K.",""],["Zijlstra","A.",""],["Hajduk","M.",""],["Iwanowska","A.",""],["Grzesiak","K.",""],["Lisiecki","K.",""],["Lipinski","J.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 08:29:21 GMT"}],"updateDate":"2024-08-28","timestamp":1720427361000,"abstract":"  Aims. Numerous planetary nebulae show complicated inner structures not\nobviously explained. For one such object we undertake a detailed 3D\nphotoionization and kinematical model analysis for a better understanding of\nthe underlying shaping processes. Methods. We obtained 2D ARGUS/IFU\nspectroscopy covering the whole nebula in selected, representative emission\nlines. A 3D photoionization modelling was used to compute images and line\nprofiles. Comparison of the observations with the models was used to fine-tune\nthe model details. This predicts the approximate nebular 3D structure and\nkinematics. Results. We found that within a cylindrical outer nebula there is a\nhidden, very dense, bar-like or cylindrical inner structure. Both features are\nco-axial and are inclined to the sky by 40 deg. A wide asymmetric one-sided\nplume attached to one end of the bar is proposed to be a flat structure. All\nnebular components share the same kinematics, with an isotropic velocity field\nwhich monotonically increases with distance from the star before reaching a\nplateau. The relatively low velocities indicate that the observed shapes do not\nrequire particularly energetic processes and there is no indication for the\ncurrent presence of a jet. The 3D model reproduces the observed line ratios and\nthe detailed structure of the object significantly better than previous models.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}