{"id":"2407.19004","title":"Weighing The Options: The Unseen Companion in LAMOST J2354 is Likely a\n  Massive White Dwarf","authors":"M. A. Tucker, A. J. Wheeler, D. M. Rowan, M. E. Huber","authorsParsed":[["Tucker","M. A.",""],["Wheeler","A. J.",""],["Rowan","D. M.",""],["Huber","M. E.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-30","timestamp":1722016801000,"abstract":"  LAMOST J235456.73+335625 (J2354) is a binary system hosting a $\\sim 0.7~\\rm\nM_\\odot$ K dwarf and a $\\sim 1.4~\\rm M_\\odot$ dark companion, supposedly a\nneutron star, in a 0.48d orbit. Here we present high- and low-resolution\nspectroscopy to better constrain the properties of the system. The\nlow-resolution spectrum confirms that the luminous star is a slightly\nmetal-poor K dwarf and strengthens the limits on any optical flux from the\ndimmer companion. We use the high-resolution spectra to measure atmospheric\nparameters ($T_{\\rm eff}$, $\\log g$, [Fe/H], $v_{\\rm rot}\\sin i$) and\nabundances for 8 elements for the K dwarf. We refine the mass of the compact\nobject to $M_{\\rm co} \\sim 1.3~\\rm M_\\odot$ with a minimum mass of $M_{\\rm co,\nmin} = 1.23\\pm0.04~\\rm M_\\odot$. The expected overabundance of\nintermediate-mass elements from the incident supernova ejecta is not detected\nin the K-dwarf atmosphere. This contrasts with known binaries hosting neutron\nstars where almost all companions show evidence for polluting material. Moving\nthe neutron-star progenitor further from the K-dwarf at the time of explosion\nto minimize atmospheric pollution requires a finely-tuned kick to produce the\ncurrent orbital separation of $\\sim 3.3~\\rm R_\\odot$. Instead, we find that a\nmassive white dwarf with a cooling age of $\\gtrsim 3~$Gyr satisfies all\nobservational constraints. The system likely experienced two common-envelope\nphases leading to its current state because the white dwarf progenitor was\nmassive enough to ignite He-shell burning. The system will become a cataclysmic\nvariable in the distant future when the K-dwarf evolves off of the main\nsequence. These short-period high-$q$ binaries represent an intriguing\nformation pathway for compact double white dwarf binaries and thermonuclear\nsupernovae. An ultraviolet spectrum is the most promising avenue for directly\ndetecting the white dwarf companion.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Dpe4l7LNq4O4_MlrWB9xl8lbwRYYrf3nkp-yqDnvSOU","pdfSize":"1211101"}
