{"id":"2407.01374","title":"Bridging the Gap: Transfer Learning from English PLMs to Malaysian\n  English","authors":"Mohan Raj Chanthran, Lay-Ki Soon, Huey Fang Ong, Bhawani Selvaretnam","authorsParsed":[["Chanthran","Mohan Raj",""],["Soon","Lay-Ki",""],["Ong","Huey Fang",""],["Selvaretnam","Bhawani",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:26:03 GMT"}],"updateDate":"2024-07-02","timestamp":1719847563000,"abstract":"  Malaysian English is a low resource creole language, where it carries the\nelements of Malay, Chinese, and Tamil languages, in addition to Standard\nEnglish. Named Entity Recognition (NER) models underperform when capturing\nentities from Malaysian English text due to its distinctive morphosyntactic\nadaptations, semantic features and code-switching (mixing English and Malay).\nConsidering these gaps, we introduce MENmBERT and MENBERT, a pre-trained\nlanguage model with contextual understanding, specifically tailored for\nMalaysian English. We have fine-tuned MENmBERT and MENBERT using manually\nannotated entities and relations from the Malaysian English News Article (MEN)\nDataset. This fine-tuning process allows the PLM to learn representations that\ncapture the nuances of Malaysian English relevant for NER and RE tasks.\nMENmBERT achieved a 1.52\\% and 26.27\\% improvement on NER and RE tasks\nrespectively compared to the bert-base-multilingual-cased model. Although the\noverall performance of NER does not have a significant improvement, our further\nanalysis shows that there is a significant improvement when evaluated by the 12\nentity labels. These findings suggest that pre-training language models on\nlanguage-specific and geographically-focused corpora can be a promising\napproach for improving NER performance in low-resource settings. The dataset\nand code published in this paper provide valuable resources for NLP research\nwork focusing on Malaysian English.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}