{"id":"2407.12378","title":"StoX-Net: Stochastic Processing of Partial Sums for Efficient In-Memory\n  Computing DNN Accelerators","authors":"Ethan G Rogers, Sohan Salahuddin Mugdho, Kshemal Kshemendra Gupte, and\n  Cheng Wang","authorsParsed":[["Rogers","Ethan G",""],["Mugdho","Sohan Salahuddin",""],["Gupte","Kshemal Kshemendra",""],["Wang","Cheng",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 07:56:43 GMT"}],"updateDate":"2024-07-18","timestamp":1721203003000,"abstract":"  Crossbar-based in-memory computing (IMC) has emerged as a promising platform\nfor hardware acceleration of deep neural networks (DNNs). However, the energy\nand latency of IMC systems are dominated by the large overhead of the\nperipheral analog-to-digital converters (ADCs). To address such ADC bottleneck,\nhere we propose to implement stochastic processing of array-level partial sums\n(PS) for efficient IMC. Leveraging the probabilistic switching of spin-orbit\ntorque magnetic tunnel junctions, the proposed PS processing eliminates the\ncostly ADC, achieving significant improvement in energy and area efficiency. To\nmitigate accuracy loss, we develop PS-quantization-aware training that enables\nbackward propagation across stochastic PS. Furthermore, a novel scheme with an\ninhomogeneous sampling length of the stochastic conversion is proposed. When\nrunning ResNet20 on the CIFAR-10 dataset, our architecture-to-algorithm\nco-design demonstrates up to 22x, 30x, and 142x improvement in energy, latency,\nand area, respectively, compared to IMC with standard ADC. Our optimized design\nconfiguration using stochastic PS achieved 666x (111x) improvement in\nEnergy-Delay-Product compared to IMC with full precision ADC (sparse low-bit\nADC), while maintaining near-software accuracy at various benchmark\nclassification tasks.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jfYtGCOXgIqvK3htlXZ7fLSRDhi6pnR0A_JiDtmwEMQ","pdfSize":"4797159","objectId":"0x2ab2165cd4734526b4cbfc1dfeddaf7f1894f3200b9febc36ab570f32e8c7ffd","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
