{"id":"2407.15377","title":"Replicable Bandits for Digital Health Interventions","authors":"Kelly W. Zhang, Nowell Closser, Anna L. Trella, Susan A. Murphy","authorsParsed":[["Zhang","Kelly W.",""],["Closser","Nowell",""],["Trella","Anna L.",""],["Murphy","Susan A.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 04:57:51 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 10:44:16 GMT"}],"updateDate":"2024-08-19","timestamp":1721624271000,"abstract":"  Adaptive treatment assignment algorithms, such as bandit and reinforcement\nlearning algorithms, are increasingly used in digital health intervention\nclinical trials. Causal inference and related data analyses are critical for\nevaluating digital health interventions, deciding how to refine the\nintervention, and deciding whether to roll-out the intervention more broadly.\nHowever the replicability of these analyses has received relatively little\nattention. This work investigates the replicability of statistical analyses\nfrom trials deploying adaptive treatment assignment algorithms. We demonstrate\nthat many standard statistical estimators can be inconsistent and fail to be\nreplicable across repetitions of the clinical trial, even as the sample size\ngrows large. We show that this non-replicability is intimately related to\nproperties of the adaptive algorithm itself. We introduce a formal definition\nof a \"replicable bandit algorithm\" and prove that under such algorithms, a wide\nvariety of common statistical analyses are guaranteed to be consistent. We\npresent both theoretical results and simulation studies based on a mobile\nhealth oral health self-care intervention. Our findings underscore the\nimportance of designing adaptive algorithms with replicability in mind,\nespecially for settings like digital health where deployment decisions rely\nheavily on replicated evidence. We conclude by discussing open questions on the\nconnections between algorithm design, statistical inference, and experimental\nreplicability.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"MtkS2cF7xC6lHyV5fWqtFQxZUmRPqKPzB8q6FVau0OU","pdfSize":"942559","objectId":"0xca50321da940d802287469e22506ff08ce4325c4dd9ce928263640289b6f4271","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
