{"id":"2407.20723","title":"Design of High-speed readout electronics for the DarkSHINE\n  electromagnetic calorimeter","authors":"Yihan Guo, Shu Li, Kun Liu, Yang Liu, Yongqi Tan, Jiannan Tang, Weihao\n  Wu, Haijun Yang, Zhiyu Zhao, Wei Zhi and Zhizhen Zhou","authorsParsed":[["Guo","Yihan",""],["Li","Shu",""],["Liu","Kun",""],["Liu","Yang",""],["Tan","Yongqi",""],["Tang","Jiannan",""],["Wu","Weihao",""],["Yang","Haijun",""],["Zhao","Zhiyu",""],["Zhi","Wei",""],["Zhou","Zhizhen",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 10:36:02 GMT"}],"updateDate":"2024-07-31","timestamp":1722335762000,"abstract":"  The DarkSHINE experiment aims to search for dark photons by measuring the\nenergy loss of the electrons recoiled from fixed-target. Its electromagnetic\ncalorimeter is primarily responsible for accurately reconstructing the energy\nof the recoil electrons and bremsstrahlung photons. The performance of the\nelectromagnetic calorimeter is crucial, as its energy measurement precision\ndirectly determines the sensitivity to the search for dark photons. The\nDarkSHINE electromagnetic calorimeter uses LYSO crystals to form a fully\nabsorptive electromagnetic calorimeter. It utilizes SiPMs to detect\nscintillation light in the crystals, and its readout electronics system deduces\nthe deposited energy in the crystals by measuring the number of photoelectric\nsignals generated by the SiPMs. The DarkSHINE electromagnetic calorimeter aims\nto operate at an event rate of 1-10 MHz, detecting energies ranging from 1 MeV\nto 1 GeV. To meet the requirements of high energy measurement precision, high\nevent rate, and large dynamic range, we have researched and designed a readout\nelectronics system based on dual-channel high-speed ADCs and a customized DAQ.\nThe front-end amplification part of this system uses low-noise trans-impedance\namplifiers to achieve high-precision waveform amplification. It successfully\nachieves a dynamic range up to a thousandfold through a double-gain readout\nscheme. The digital part uses 1 GSPS high-speed ADCs to achieve non-dead-time,\nhigh-precision waveform digitization. The DAQ part uses JESD204B high-speed\nserial protocol to read out the signal from ADC, and transmit it to PC software\nfor processing and storage. Test results show a signal-to-noise ratio greater\nthan 66 dBFS and an ENOB greater than 10.6 bits. Energy spectra measurements\nhave been conducted using LYSO crystals and SiPMs, and an energy resolution of\n5.96% at the 2.6 MeV gamma peak of Th-232 has been achieved.\n","subjects":["Physics/Instrumentation and Detectors","Physics/High Energy Physics - Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}