{"id":"2407.15605","title":"Probing Fine-Grained Action Understanding and Cross-View Generalization\n  of Foundation Models","authors":"Thinesh Thiyakesan Ponbagavathi and Kunyu Peng and Alina Roitberg","authorsParsed":[["Ponbagavathi","Thinesh Thiyakesan",""],["Peng","Kunyu",""],["Roitberg","Alina",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 12:59:57 GMT"}],"updateDate":"2024-07-23","timestamp":1721653197000,"abstract":"  Foundation models (FMs) are large neural networks trained on broad datasets,\nexcelling in downstream tasks with minimal fine-tuning. Human activity\nrecognition in video has advanced with FMs, driven by competition among\ndifferent architectures. However, high accuracies on standard benchmarks can\ndraw an artificially rosy picture, as they often overlook real-world factors\nlike changing camera perspectives. Popular benchmarks, mostly from YouTube or\nmovies, offer diverse views but only coarse actions, which are insufficient for\nuse-cases needing fine-grained, domain-specific actions. Domain-specific\ndatasets (e.g., for industrial assembly) typically use data from limited static\nperspectives. This paper empirically evaluates how perspective changes affect\ndifferent FMs in fine-grained human activity recognition. We compare multiple\nbackbone architectures and design choices, including image- and video- based\nmodels, and various strategies for temporal information fusion, including\ncommonly used score averaging and more novel attention-based temporal\naggregation mechanisms. This is the first systematic study of different\nfoundation models and specific design choices for human activity recognition\nfrom unknown views, conducted with the goal to provide guidance for backbone-\nand temporal- fusion scheme selection. Code and models will be made publicly\navailable to the community.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lqyeyhxeztKMKIfasQ7h_asV1dWtzt_O3ziZ_wzTvi8","pdfSize":"4261655","objectId":"0xac39854a6e4e5f5330469c8a579836f34de0ef68367ff2d19419e41604554ab0","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
