{"id":"2407.01560","title":"3DMeshNet: A Three-Dimensional Differential Neural Network for\n  Structured Mesh Generation","authors":"Jiaming Peng, Xinhai Chen, Jie Liu","authorsParsed":[["Peng","Jiaming",""],["Chen","Xinhai",""],["Liu","Jie",""]],"versions":[{"version":"v1","created":"Tue, 7 May 2024 13:07:07 GMT"}],"updateDate":"2024-07-03","timestamp":1715087227000,"abstract":"  Mesh generation is a crucial step in numerical simulations, significantly\nimpacting simulation accuracy and efficiency. However, generating meshes\nremains time-consuming and requires expensive computational resources. In this\npaper, we propose a novel method, 3DMeshNet, for three-dimensional structured\nmesh generation. The method embeds the meshing-related differential equations\ninto the loss function of neural networks, formulating the meshing task as an\nunsupervised optimization problem. It takes geometric points as input to learn\nthe potential mapping between parametric and computational domains. After\nsuitable offline training, 3DMeshNet can efficiently output a three-dimensional\nstructured mesh with a user-defined number of quadrilateral/hexahedral cells\nthrough the feed-forward neural prediction. To enhance training stability and\naccelerate convergence, we integrate loss function reweighting through weight\nadjustments and gradient projection alongside applying finite difference\nmethods to streamline derivative computations in the loss. Experiments on\ndifferent cases show that 3DMeshNet is robust and fast. It outperforms neural\nnetwork-based methods and yields superior meshes compared to traditional mesh\npartitioning methods. 3DMeshNet significantly reduces training times by up to\n85% compared to other neural network-based approaches and lowers meshing\noverhead by 4 to 8 times relative to traditional meshing methods.\n","subjects":["Computing Research Repository/Graphics","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}