{"id":"2407.12441","title":"Dynamics of discrete solitons in the fractional discrete nonlinear\n  Schr\\\"odinger equation with the quasi-Riesz derivative","authors":"Ming Zhong, Boris A. Malomed, and Zhenya Yan","authorsParsed":[["Zhong","Ming",""],["Malomed","Boris A.",""],["Yan","Zhenya",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 09:52:18 GMT"}],"updateDate":"2024-09-04","timestamp":1721209938000,"abstract":"  We elaborate a fractional discrete nonlinear Schr\\\"{o}dinger (FDNLS) equation\nbased on an appropriately modified definition of the Riesz fractional\nderivative, which is characterized by its L\\'{e}vy index (LI). This FDNLS\nequation represents a novel discrete system, in which the nearest-neighbor\ncoupling is combined with long-range interactions, that decay as the inverse\nsquare of the separation between lattice sites. The system may be realized as\nan array of parallel quasi-one-dimensional Bose-Einstein condensates composed\nof atoms or small molecules carrying, respectively, a permanent magnetic or\nelectric dipole moment. The dispersion relation (DR) for lattice waves and the\ncorresponding propagation band in the system's linear spectrum are found in an\nexact form for all values of LI. The DR is consistent with the continuum limit,\ndiffering in the range of wavenumbers. Formation of single-site and two-site\ndiscrete solitons is explored, starting from the anti-continuum limit and\ncontinuing the analysis in the numerical form up to the existence boundary of\nthe discrete solitons. Stability of the solitons is identified in terms of\neigenvalues for small perturbations, and verified in direct simulations.\nMobility of the discrete solitons is considered too, by means of an estimate of\nthe system's Peierls-Nabarro potential barrier, and with the help of direct\nsimulations. Collisions between persistently moving discrete solitons are also\nstudied.\n","subjects":["Nonlinear Sciences/Pattern Formation and Solitons","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Physics/Computational Physics","Physics/Optics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}