{"id":"2407.03924","title":"TwinLab: a framework for data-efficient training of non-intrusive\n  reduced-order models for digital twins","authors":"Maximilian Kannapinn, Michael Sch\\\"afer, Oliver Weeger","authorsParsed":[["Kannapinn","Maximilian",""],["Schäfer","Michael",""],["Weeger","Oliver",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 13:37:13 GMT"}],"updateDate":"2024-07-08","timestamp":1720100233000,"abstract":"  Purpose: Simulation-based digital twins represent an effort to provide\nhigh-accuracy real-time insights into operational physical processes. However,\nthe computation time of many multi-physical simulation models is far from\nreal-time. It might even exceed sensible time frames to produce sufficient data\nfor training data-driven reduced-order models. This study presents TwinLab, a\nframework for data-efficient, yet accurate training of neural-ODE type\nreduced-order models with only two data sets. Design/methodology/approach:\nCorrelations between test errors of reduced-order models and distinct features\nof corresponding training data are investigated. Having found the single best\ndata sets for training, a second data set is sought with the help of similarity\nand error measures to enrich the training process effectively. Findings: Adding\na suitable second training data set in the training process reduces the test\nerror by up to 49% compared to the best base reduced-order model trained only\nwith one data set. Such a second training data set should at least yield a good\nreduced-order model on its own and exhibit higher levels of dissimilarity to\nthe base training data set regarding the respective excitation signal.\nMoreover, the base reduced-order model should have elevated test errors on the\nsecond data set. The relative error of the time series ranges from 0.18% to\n0.49%. Prediction speed-ups of up to a factor of 36,000 are observed.\nOriginality: The proposed computational framework facilitates the automated,\ndata-efficient extraction of non-intrusive reduced-order models for digital\ntwins from existing simulation models, independent of the simulation software.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Dynamical Systems"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}