{"id":"2407.10920","title":"Benchmarking Vision Language Models for Cultural Understanding","authors":"Shravan Nayak, Kanishk Jain, Rabiul Awal, Siva Reddy, Sjoerd van\n  Steenkiste, Lisa Anne Hendricks, Karolina Sta\\'nczak, Aishwarya Agrawal","authorsParsed":[["Nayak","Shravan",""],["Jain","Kanishk",""],["Awal","Rabiul",""],["Reddy","Siva",""],["van Steenkiste","Sjoerd",""],["Hendricks","Lisa Anne",""],["Stańczak","Karolina",""],["Agrawal","Aishwarya",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:21:41 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 17:49:16 GMT"}],"updateDate":"2024-07-19","timestamp":1721064101000,"abstract":"  Foundation models and vision-language pre-training have notably advanced\nVision Language Models (VLMs), enabling multimodal processing of visual and\nlinguistic data. However, their performance has been typically assessed on\ngeneral scene understanding - recognizing objects, attributes, and actions -\nrather than cultural comprehension. This study introduces CulturalVQA, a visual\nquestion-answering benchmark aimed at assessing VLM's geo-diverse cultural\nunderstanding. We curate a collection of 2,378 image-question pairs with 1-5\nanswers per question representing cultures from 11 countries across 5\ncontinents. The questions probe understanding of various facets of culture such\nas clothing, food, drinks, rituals, and traditions. Benchmarking VLMs on\nCulturalVQA, including GPT-4V and Gemini, reveals disparity in their level of\ncultural understanding across regions, with strong cultural understanding\ncapabilities for North America while significantly lower performance for\nAfrica. We observe disparity in their performance across cultural facets too,\nwith clothing, rituals, and traditions seeing higher performances than food and\ndrink. These disparities help us identify areas where VLMs lack cultural\nunderstanding and demonstrate the potential of CulturalVQA as a comprehensive\nevaluation set for gauging VLM progress in understanding diverse cultures.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}