{"id":"2407.13588","title":"Robust Calibration of Large Vision-Language Adapters","authors":"Balamurali Murugesan, Julio Silva-Rodriguez, Ismail Ben Ayed, and Jose\n  Dolz","authorsParsed":[["Murugesan","Balamurali",""],["Silva-Rodriguez","Julio",""],["Ayed","Ismail Ben",""],["Dolz","Jose",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 15:27:56 GMT"}],"updateDate":"2024-07-19","timestamp":1721316476000,"abstract":"  This paper addresses the critical issue of miscalibration in CLIP-based model\nadaptation, particularly in the challenging scenario of out-of-distribution\n(OOD) samples, which has been overlooked in the existing literature on CLIP\nadaptation. We empirically demonstrate that popular CLIP adaptation approaches,\nsuch as Adapters, Prompt Learning, and Test-Time Adaptation, substantially\ndegrade the calibration capabilities of the zero-shot baseline in the presence\nof distributional drift. We identify the increase in logit ranges as the\nunderlying cause of miscalibration of CLIP adaptation methods, contrasting with\nprevious work on calibrating fully-supervised models. Motivated by these\nobservations, we present a simple and model-agnostic solution to mitigate\nmiscalibration, by scaling the logit range of each sample to its zero-shot\nprediction logits. We explore three different alternatives to achieve this,\nwhich can be either integrated during adaptation or directly used at inference\ntime. Comprehensive experiments on popular OOD classification benchmarks\ndemonstrate the effectiveness of the proposed approaches in mitigating\nmiscalibration while maintaining discriminative performance, whose improvements\nare consistent across the three families of these increasingly popular\napproaches. The code is publicly available at:\nhttps://github.com/Bala93/CLIPCalib\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cfCfHNCmRQdj-8HUL7syqn9irFkOzAuw3ysJQfTc_kc","pdfSize":"5946424","objectId":"0x9801ee9ae0b93a931da4f072fa4324a9fd97e45795637e94b2cc01ea52888e7b","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
