{"id":"2407.18137","title":"XS-VID: An Extremely Small Video Object Detection Dataset","authors":"Jiahao Guo, Ziyang Xu, Lianjun Wu, Fei Gao, Wenyu Liu, Xinggang Wang","authorsParsed":[["Guo","Jiahao",""],["Xu","Ziyang",""],["Wu","Lianjun",""],["Gao","Fei",""],["Liu","Wenyu",""],["Wang","Xinggang",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 15:42:46 GMT"}],"updateDate":"2024-07-26","timestamp":1721922166000,"abstract":"  Small Video Object Detection (SVOD) is a crucial subfield in modern computer\nvision, essential for early object discovery and detection. However, existing\nSVOD datasets are scarce and suffer from issues such as insufficiently small\nobjects, limited object categories, and lack of scene diversity, leading to\nunitary application scenarios for corresponding methods. To address this gap,\nwe develop the XS-VID dataset, which comprises aerial data from various periods\nand scenes, and annotates eight major object categories. To further evaluate\nexisting methods for detecting extremely small objects, XS-VID extensively\ncollects three types of objects with smaller pixel areas: extremely small\n(\\textit{es}, $0\\sim12^2$), relatively small (\\textit{rs}, $12^2\\sim20^2$), and\ngenerally small (\\textit{gs}, $20^2\\sim32^2$). XS-VID offers unprecedented\nbreadth and depth in covering and quantifying minuscule objects, significantly\nenriching the scene and object diversity in the dataset. Extensive validations\non XS-VID and the publicly available VisDrone2019VID dataset show that existing\nmethods struggle with small object detection and significantly underperform\ncompared to general object detectors. Leveraging the strengths of previous\nmethods and addressing their weaknesses, we propose YOLOFT, which enhances\nlocal feature associations and integrates temporal motion features,\nsignificantly improving the accuracy and stability of SVOD. Our datasets and\nbenchmarks are available at \\url{https://gjhhust.github.io/XS-VID/}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}