{"id":"2407.14715","title":"Analytic Structure of Stationary Flows of an Ideal Fluid with a\n  Stagnation Point","authors":"Aleksander Danielski","authorsParsed":[["Danielski","Aleksander",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 00:50:23 GMT"}],"updateDate":"2024-07-23","timestamp":1721436623000,"abstract":"  The flow of an ideal fluid possesses a remarkable property: despite limited\nregularity of the velocity field, its particle trajectories are analytic\ncurves. In our previous work, this fact was used to introduce the structure of\nan analytic Banach manifold in the set of 2D stationary flows having no\nstagnation points. The main feature of our description was to regard the\nstationary flow as a collection of its analytic flow lines, parameterized\nnon-analytically by values of the stream function $\\psi$.\n  In this work, we adapt this description to the case of 2D stationary flows\nwhich have a single elliptic stagnation point. Namely, we consider flows in a\ndomain bounded by the graph of analytic function $\\rho = b(\\varphi)$, where\n$(\\rho,\\varphi)$ are polar coordinates centred at the origin. The position $p$\nof the stagnation point is an unknown and must be included in the solution. In\npolar coordinates $(r,\\theta)$ centred at $p$, the flow lines are described by\ngraphs of $r=a(\\psi,\\theta)$, where $a$ is a `partially-analytic' function\n(analytic in $\\theta$, of finite regularity in $\\psi$). The equation of\nstationary flow $\\Delta \\psi = F(\\psi)$ is transformed to the quasilinear\nelliptic equation $\\Xi(a) = F(\\psi)$ for the flow lines. The analysis is\ncomplicated by the fact that the ellipticity of $\\Xi$ degenerates at the\nstagnation point.\n  We introduce function spaces for the partially-analytic family of flow lines,\nmodelled on the weighted Kondratev spaces, appropriate for the degenerate\nsetting. The equation of stationary flow is thus regarded as an analytic\noperator equation in complex Banach spaces, with local solution given by the\nimplicit function theorem. In particular, we show that near the circular flow\nof constant vorticity, the equation has unique solution $p, a(\\psi,\\theta)$\ndepending analytically on parameters $b(\\varphi)$ and $F(\\psi)$.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KxIeVCpeTRZt21t0m0nw0jgBsj2rAh9qklbaFTX6Mhw","pdfSize":"349626","objectId":"0xd097cb0fbe339dc7b8f4152dd36591dd37268be0f8856ba2b6173335403b7069","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
