{"id":"2407.02816","title":"Large and Small Deviations for Statistical Sequence Matching","authors":"Lin Zhou, Qianyun Wang, Jingjing Wang, Lin Bai and Alfred O. Hero","authorsParsed":[["Zhou","Lin",""],["Wang","Qianyun",""],["Wang","Jingjing",""],["Bai","Lin",""],["Hero","Alfred O.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 05:37:17 GMT"}],"updateDate":"2024-07-04","timestamp":1719985037000,"abstract":"  We revisit the problem of statistical sequence matching between two databases\nof sequences initiated by Unnikrishnan (TIT 2015) and derive theoretical\nperformance guarantees for the generalized likelihood ratio test (GLRT). We\nfirst consider the case where the number of matched pairs of sequences between\nthe databases is known. In this case, the task is to accurately find the\nmatched pairs of sequences among all possible matches between the sequences in\nthe two databases. We analyze the performance of the GLRT by Unnikrishnan and\nexplicitly characterize the tradeoff between the mismatch and false reject\nprobabilities under each hypothesis in both large and small deviations regimes.\nFurthermore, we demonstrate the optimality of Unnikrishnan's GLRT test under\nthe generalized Neyman-Person criterion for both regimes and illustrate our\ntheoretical results via numerical examples. Subsequently, we generalize our\nachievability analyses to the case where the number of matched pairs is\nunknown, and an additional error probability needs to be considered. When one\nof the two databases contains a single sequence, the problem of statistical\nsequence matching specializes to the problem of multiple classification\nintroduced by Gutman (TIT 1989). For this special case, our result for the\nsmall deviations regime strengthens previous result of Zhou, Tan and Motani\n(Information and Inference 2020) by removing unnecessary conditions on the\ngenerating distributions.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}