{"id":"2407.17642","title":"SMA-Hyper: Spatiotemporal Multi-View Fusion Hypergraph Learning for\n  Traffic Accident Prediction","authors":"Xiaowei Gao, James Haworth, Ilya Ilyankou, Xianghui Zhang, Tao Cheng,\n  Stephen Law, Huanfa Chen","authorsParsed":[["Gao","Xiaowei",""],["Haworth","James",""],["Ilyankou","Ilya",""],["Zhang","Xianghui",""],["Cheng","Tao",""],["Law","Stephen",""],["Chen","Huanfa",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 21:10:34 GMT"}],"updateDate":"2024-07-26","timestamp":1721855434000,"abstract":"  Predicting traffic accidents is the key to sustainable city management, which\nrequires effective address of the dynamic and complex spatiotemporal\ncharacteristics of cities. Current data-driven models often struggle with data\nsparsity and typically overlook the integration of diverse urban data sources\nand the high-order dependencies within them. Additionally, they frequently rely\non predefined topologies or weights, limiting their adaptability in\nspatiotemporal predictions. To address these issues, we introduce the\nSpatiotemporal Multiview Adaptive HyperGraph Learning (SMA-Hyper) model, a\ndynamic deep learning framework designed for traffic accident prediction.\nBuilding on previous research, this innovative model incorporates dual adaptive\nspatiotemporal graph learning mechanisms that enable high-order cross-regional\nlearning through hypergraphs and dynamic adaptation to evolving urban data. It\nalso utilises contrastive learning to enhance global and local data\nrepresentations in sparse datasets and employs an advance attention mechanism\nto fuse multiple views of accident data and urban functional features, thereby\nenriching the contextual understanding of risk factors. Extensive testing on\nthe London traffic accident dataset demonstrates that the SMA-Hyper model\nsignificantly outperforms baseline models across various temporal horizons and\nmultistep outputs, affirming the effectiveness of its multiview fusion and\nadaptive learning strategies. The interpretability of the results further\nunderscores its potential to improve urban traffic management and safety by\nleveraging complex spatiotemporal urban data, offering a scalable framework\nadaptable to diverse urban environments.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"51GdWVX4jWSS5VD-UVvlF3YT7KPN-3Ky6p1uqCr-Hj0","pdfSize":"7437176"}
