{"id":"2407.13295","title":"Excitation and manipulation of super cavity solitons in multi-stable\n  passive Kerr resonators","authors":"Pengxiang Wang, Jianxing Pan, Tianye Huang, Shengbo Xu, Ran Xia,\n  Julien Fatome, Bertrand Kibler, Carlos Mas-Arabi and Gang Xu","authorsParsed":[["Wang","Pengxiang",""],["Pan","Jianxing",""],["Huang","Tianye",""],["Xu","Shengbo",""],["Xia","Ran",""],["Fatome","Julien",""],["Kibler","Bertrand",""],["Mas-Arabi","Carlos",""],["Xu","Gang",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:53:20 GMT"}],"updateDate":"2024-07-19","timestamp":1721292800000,"abstract":"  We report on the theoretical analysis as well as the numerical simulations\nabout the nonlinear dynamics of cavity solitons in a passive Kerr resonator\noperating in the multistable regime under the condition of a sufficiently\nstrong pump. In this regime, the adjacent tilted cavity resonances might\noverlap, thus leading to the co-existence of combinatory states of temporal\ncavity solitons and the extended modulation instability patterns. Very\ninterestingly, the cavity in the regime of multistablity may sustain distinct\nfamilies of cavity solitons, vividly termed as super cavity solitons with much\nhigher intensity and broader spectra if compared with those in the conventional\nbi-stable regime. The description of such complex cavity dynamics in the\nmultstable regime requires either the infinite-dimensional Ikeda map, or the\nderived mean-field coupled Lugiato-Lefever equations by involving the\ncontributing cavity resonances. With the latter model, for the first time, we\nrevealed the existence of different orders of super cavity solitons, whose\nstationary solutions were obtained by using the Newton-Raphson algorithm. Along\nthis line, with the continuation calculation, we have plotted the Hopf /\nsaddle-node bifurcation curves, thus identifying the existing map of the stable\nand breathing (super) cavity solitons. With this defined parameter space, we\nhave proposed an efficient method to excite and switch the super cavity\nsolitons by adding an appropriate intensity (or phase) perturbation on the\npump. Such deterministic cavity soliton manipulation technique is demonstrated\nto underpin the multi-level coding, which may enable the large capacity\nall-optical buffering based on the passive fiber ring cavities.\n","subjects":["Physics/Optics","Nonlinear Sciences/Pattern Formation and Solitons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}