{"id":"2407.21530","title":"Data Contamination Report from the 2024 CONDA Shared Task","authors":"Oscar Sainz, Iker Garc\\'ia-Ferrero, Alon Jacovi, Jon Ander Campos,\n  Yanai Elazar, Eneko Agirre, Yoav Goldberg, Wei-Lin Chen, Jenny Chim, Leshem\n  Choshen, Luca D'Amico-Wong, Melissa Dell, Run-Ze Fan, Shahriar Golchin,\n  Yucheng Li, Pengfei Liu, Bhavish Pahwa, Ameya Prabhu, Suryansh Sharma, Emily\n  Silcock, Kateryna Solonko, David Stap, Mihai Surdeanu, Yu-Min Tseng, Vishaal\n  Udandarao, Zengzhi Wang, Ruijie Xu, Jinglin Yang","authorsParsed":[["Sainz","Oscar",""],["García-Ferrero","Iker",""],["Jacovi","Alon",""],["Campos","Jon Ander",""],["Elazar","Yanai",""],["Agirre","Eneko",""],["Goldberg","Yoav",""],["Chen","Wei-Lin",""],["Chim","Jenny",""],["Choshen","Leshem",""],["D'Amico-Wong","Luca",""],["Dell","Melissa",""],["Fan","Run-Ze",""],["Golchin","Shahriar",""],["Li","Yucheng",""],["Liu","Pengfei",""],["Pahwa","Bhavish",""],["Prabhu","Ameya",""],["Sharma","Suryansh",""],["Silcock","Emily",""],["Solonko","Kateryna",""],["Stap","David",""],["Surdeanu","Mihai",""],["Tseng","Yu-Min",""],["Udandarao","Vishaal",""],["Wang","Zengzhi",""],["Xu","Ruijie",""],["Yang","Jinglin",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 11:26:57 GMT"},{"version":"v2","created":"Sun, 4 Aug 2024 05:53:25 GMT"}],"updateDate":"2024-08-06","timestamp":1722425217000,"abstract":"  The 1st Workshop on Data Contamination (CONDA 2024) focuses on all relevant\naspects of data contamination in natural language processing, where data\ncontamination is understood as situations where evaluation data is included in\npre-training corpora used to train large scale models, compromising evaluation\nresults. The workshop fostered a shared task to collect evidence on data\ncontamination in current available datasets and models. The goal of the shared\ntask and associated database is to assist the community in understanding the\nextent of the problem and to assist researchers in avoiding reporting\nevaluation results on known contaminated resources. The shared task provides a\nstructured, centralized public database for the collection of contamination\nevidence, open to contributions from the community via GitHub pool requests.\nThis first compilation paper is based on 566 reported entries over 91\ncontaminated sources from a total of 23 contributors. The details of the\nindividual contamination events are available in the platform. The platform\ncontinues to be online, open to contributions from the community.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}