{"id":"2407.18492","title":"Neural Modulation Alteration to Positive and Negative Emotions in\n  Depressed Patients: Insights from fMRI Using Positive/Negative Emotion Atlas","authors":"Yu Feng, Weiming Zeng, Yifan Xie, Hongyu Chen, Lei Wang, Yingying\n  Wang, Hongjie Yan, Kaile Zhang, Ran Tao, Wai Ting Siok, Nizhuan Wang","authorsParsed":[["Feng","Yu",""],["Zeng","Weiming",""],["Xie","Yifan",""],["Chen","Hongyu",""],["Wang","Lei",""],["Wang","Yingying",""],["Yan","Hongjie",""],["Zhang","Kaile",""],["Tao","Ran",""],["Siok","Wai Ting",""],["Wang","Nizhuan",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 03:52:08 GMT"}],"updateDate":"2024-07-29","timestamp":1721965928000,"abstract":"  Background: Although it has been noticed that depressed patients show\ndifferences in processing emotions, the precise neural modulation mechanisms of\npositive and negative emotions remain elusive. FMRI is a cutting-edge medical\nimaging technology renowned for its high spatial resolution and dynamic\ntemporal information, making it particularly suitable for the neural dynamics\nof depression research. Methods: To address this gap, our study firstly\nleveraged fMRI to delineate activated regions associated with positive and\nnegative emotions in healthy individuals, resulting in the creation of positive\nemotion atlas (PEA) and negative emotion atlas (NEA). Subsequently, we examined\nneuroimaging changes in depression patients using these atlases and evaluated\ntheir diagnostic performance based on machine learning. Results: Our findings\ndemonstrate that the classification accuracy of depressed patients based on PEA\nand NEA exceeded 0.70, a notable improvement compared to the whole-brain\natlases. Furthermore, ALFF analysis unveiled significant differences between\ndepressed patients and healthy controls in eight functional clusters during the\nNEA, focusing on the left cuneus, cingulate gyrus, and superior parietal\nlobule. In contrast, the PEA revealed more pronounced differences across\nfifteen clusters, involving the right fusiform gyrus, parahippocampal gyrus,\nand inferior parietal lobule. Limitations: Due to the limited sample size and\nsubtypes of depressed patients, the efficacy may need further validation in\nfuture. Conclusions: These findings emphasize the complex interplay between\nemotion modulation and depression, showcasing significant alterations in both\nPEA and NEA among depression patients. This research enhances our understanding\nof emotion modulation in depression, with implications for diagnosis and\ntreatment evaluation.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}