{"id":"2407.00143","title":"InfoNCE: Identifying the Gap Between Theory and Practice","authors":"Evgenia Rusak, Patrik Reizinger, Attila Juhos, Oliver Bringmann,\n  Roland S. Zimmermann, Wieland Brendel","authorsParsed":[["Rusak","Evgenia",""],["Reizinger","Patrik",""],["Juhos","Attila",""],["Bringmann","Oliver",""],["Zimmermann","Roland S.",""],["Brendel","Wieland",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 16:08:26 GMT"}],"updateDate":"2024-07-02","timestamp":1719590906000,"abstract":"  Previous theoretical work on contrastive learning (CL) with InfoNCE showed\nthat, under certain assumptions, the learned representations uncover the\nground-truth latent factors. We argue these theories overlook crucial aspects\nof how CL is deployed in practice. Specifically, they assume that within a\npositive pair, all latent factors either vary to a similar extent, or that some\ndo not vary at all. However, in practice, positive pairs are often generated\nusing augmentations such as strong cropping to just a few pixels. Hence, a more\nrealistic assumption is that all latent factors change, with a continuum of\nvariability across these factors. We introduce AnInfoNCE, a generalization of\nInfoNCE that can provably uncover the latent factors in this anisotropic\nsetting, broadly generalizing previous identifiability results in CL. We\nvalidate our identifiability results in controlled experiments and show that\nAnInfoNCE increases the recovery of previously collapsed information in CIFAR10\nand ImageNet, albeit at the cost of downstream accuracy. Additionally, we\nexplore and discuss further mismatches between theoretical assumptions and\npractical implementations, including extensions to hard negative mining and\nloss ensembles.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lNq_g3gzwm-Ueb6wD8XYoiB-iHFgxuIMLxCvr_SUgSI","pdfSize":"4216140","objectId":"0x98269fde72243c36fe48b8bd95cbb2f7958b77bd55f267668eb1d0dc2e5070f8","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
