{"id":"2407.06140","title":"Hard X-rays from the deep solar atmosphere. An unusual UV burst with\n  flare properties","authors":"L. P. Chitta, I. G. Hannah, L. Fletcher, H. S. Hudson, P. R. Young, S.\n  Krucker, H. Peter","authorsParsed":[["Chitta","L. P.",""],["Hannah","I. G.",""],["Fletcher","L.",""],["Hudson","H. S.",""],["Young","P. R.",""],["Krucker","S.",""],["Peter","H.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:14:29 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 07:45:17 GMT"}],"updateDate":"2024-08-06","timestamp":1720458869000,"abstract":"  Explosive transient events occur throughout the solar atmosphere. The\ndiffering manifestations range from coronal mass ejections to Ellerman bombs.\nThe former may have negligible signatures in the lower atmosphere, and the\nlatter may have negligible nonthermal emissions such as hard X-radiation. A\nsolar flare generally involves a broad range of emission signatures. Using a\nsuite of four space-borne telescopes, we report a solar event that combines\naspects of simple UV bursts and hard X-ray emitting flares at the same time.\nThe event is a compact C-class flare in active region AR11861,\nSOL2013-10-12T00:30. By fitting a combined isothermal and nonthermal model to\nthe hard X-ray spectrum, we inferred plasma temperatures in excess of 15\\,MK\nand a nonthermal power of about $3\\times10^{27}$\\,erg\\,s$^{-1}$ in this event.\nDespite these high temperatures and evidence for nonthermal particles, the\nflare was mostly confined to the chromosphere. However, the event lacked clear\nsignatures of UV spectral lines, such as the Fe\\,{\\sc xii} 1349\\,\\AA\\ and\nFe\\,{\\sc xxi} 1354\\,\\AA\\ emission lines, which are characteristic of emission\nfrom hotter plasma with a temperature over 1\\,MK. Moreover, the event exhibited\nvery limited signatures in the extreme-UV wavelengths. Our study indicates that\na UV burst -- hard X-ray flare hybrid phenomenon exists in the low solar\natmosphere. Plasma that heats to high temperatures coupled with particle\nacceleration by magnetic energy that is released directly in the lower\natmosphere sheds light on the nature of active region core heating and on\ninferences of flare signatures.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Plasma Physics","Physics/Space Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}