{"id":"2407.02151","title":"Labeling Sentences with Symbolic and Deictic Gestures via Semantic\n  Similarity","authors":"Ariel Gjaci, Carmine Tommaso Recchiuto, and Antonio Sgorbissa","authorsParsed":[["Gjaci","Ariel",""],["Recchiuto","Carmine Tommaso",""],["Sgorbissa","Antonio",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 10:50:01 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 11:24:18 GMT"}],"updateDate":"2024-07-04","timestamp":1719917401000,"abstract":"  Co-speech gesture generation on artificial agents has gained attention\nrecently, mainly when it is based on data-driven models. However, end-to-end\nmethods often fail to generate co-speech gestures related to semantics with\nspecific forms, i.e., Symbolic and Deictic gestures. In this work, we identify\nwhich words in a sentence are contextually related to Symbolic and Deictic\ngestures. Firstly, we appropriately chose 12 gestures recognized by people from\nthe Italian culture, which different humanoid robots can reproduce. Then, we\nimplemented two rule-based algorithms to label sentences with Symbolic and\nDeictic gestures. The rules depend on the semantic similarity scores computed\nwith the RoBerta model between sentences that heuristically represent gestures\nand sub-sentences inside an objective sentence that artificial agents have to\npronounce. We also implemented a baseline algorithm that assigns gestures\nwithout computing similarity scores. Finally, to validate the results, we asked\n30 persons to label a set of sentences with Deictic and Symbolic gestures\nthrough a Graphical User Interface (GUI), and we compared the labels with the\nones produced by our algorithms. For this scope, we computed Average Precision\n(AP) and Intersection Over Union (IOU) scores, and we evaluated the Average\nComputational Time (ACT). Our results show that semantic similarity scores are\nuseful for finding Symbolic and Deictic gestures in utterances.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}