{"id":"2407.12273","title":"GRIDS: Grouped Multiple-Degradation Restoration with Image Degradation\n  Similarity","authors":"Shuo Cao, Yihao Liu, Wenlong Zhang, Yu Qiao and Chao Dong","authorsParsed":[["Cao","Shuo",""],["Liu","Yihao",""],["Zhang","Wenlong",""],["Qiao","Yu",""],["Dong","Chao",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 02:43:32 GMT"}],"updateDate":"2024-07-18","timestamp":1721184212000,"abstract":"  Traditional single-task image restoration methods excel in handling specific\ndegradation types but struggle with multiple degradations. To address this\nlimitation, we propose Grouped Restoration with Image Degradation Similarity\n(GRIDS), a novel approach that harmonizes the competing objectives inherent in\nmultiple-degradation restoration. We first introduce a quantitative method for\nassessing relationships between image degradations using statistical modeling\nof deep degradation representations. This analysis facilitates the strategic\ngrouping of similar tasks, enhancing both the efficiency and effectiveness of\nthe restoration process. Based on the degradation similarity, GRIDS divides\nrestoration tasks into one of the optimal groups, where tasks within the same\ngroup are highly correlated. For instance, GRIDS effectively groups 11\ndegradation types into 4 cohesive groups. Trained models within each group show\nsignificant improvements, with an average improvement of 0.09dB over\nsingle-task upper bound models and 2.24dB over the mix-training baseline model.\nGRIDS incorporates an adaptive model selection mechanism for inference,\nautomatically selecting the appropriate grouped-training model based on the\ninput degradation. This mechanism is particularly useful for real-world\nscenarios with unknown degradations as it does not rely on explicit degradation\nclassification modules. Furthermore, our method can predict model\ngeneralization ability without the need for network inference, providing\nvaluable insights for practitioners.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}