{"id":"2407.01684","title":"Scattering amplitudes in the Randall-Sundrum model with brane-localized\n  curvature terms","authors":"R. Sekhar Chivukula, Kirtimaan A. Mohan, Dipan Sengupta, Elizabeth H.\n  Simmons, Xing Wang","authorsParsed":[["Chivukula","R. Sekhar",""],["Mohan","Kirtimaan A.",""],["Sengupta","Dipan",""],["Simmons","Elizabeth H.",""],["Wang","Xing",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:00:27 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 09:39:01 GMT"}],"updateDate":"2024-07-18","timestamp":1719856827000,"abstract":"  In this paper we investigate the scattering amplitudes of spin-2 Kaluza-Klein\n(KK) states in Randall-Sundrum models with brane-localized curvature terms. We\nshow that the presence of brane-localized curvature interactions modifies the\nproperties of (4D) scalar fluctuations of the metric, resulting in scattering\namplitudes of the massive spin-2 KK states which grow as ${\\cal O}(s^3)$\ninstead of ${\\cal O}(s)$. We discuss the constraints on the size of the\nbrane-localized curvature interactions based on the consistency of the\nSturm-Liouville mode systems of the spin-2 and spin-0 metric fluctuations. We\nconnect the properties of the scattering amplitudes to the diffeomorphism\ninvariance of the compactified KK theory with brane-localized curvature\ninteractions. We verify that the scattering amplitudes involving\nbrane-localized external sources (matter) are diffeomorphism-invariant, but\nshow that those for matter localized at an arbitrary point in the bulk are not.\nWe demonstrate that, in Feynman gauge, the spin-0 Goldstone bosons\ncorresponding to helicity-0 states of the massive spin-2 KK bosons behave as a\ntower of Galileons, and that it is their interactions that produce the\nhigh-energy behavior of the scattering amplitudes. We also outline the\ncorrespondence between our results and those in the Dvali-Gabadadze-Porrati\n(DGP) model. In an appendix we discuss the analogous issue in extra-dimensional\ngauge theory, and show that the presence of a brane-localized gauge\nkinetic-energy term does not change the high-energy behavior of corresponding\nKK vector boson scattering amplitudes.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}