{"id":"2407.06625","title":"Binding Contexts as Partitionable Multisets in Abella","authors":"Terrance Gray (University of Minnesota), Gopalan Nadathur (University\n  of Minnesota)","authorsParsed":[["Gray","Terrance","","University of Minnesota"],["Nadathur","Gopalan","","University\n  of Minnesota"]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 07:51:49 GMT"}],"updateDate":"2024-07-10","timestamp":1720511509000,"abstract":"  When reasoning about formal objects whose structures involve binding, it is\noften necessary to analyze expressions relative to a context that associates\ntypes, values, and other related attributes with variables that appear free in\nthe expressions. We refer to such associations as binding contexts. Reasoning\ntasks also require properties such as the shape and uniqueness of associations\nconcerning binding contexts to be made explicit. The Abella proof assistant,\nwhich supports a higher-order treatment of syntactic constructs, provides a\nsimple and elegant way to describe such contexts from which their properties\ncan be extracted. This mechanism is based at the outset on viewing binding\ncontexts as ordered sequences of associations. However, when dealing with\nobject systems that embody notions of linearity, it becomes necessary to treat\nbinding contexts more generally as partitionable multisets. We show how to\nadapt the original Abella encoding to encompass such a generalization. The key\nidea in this adaptation is to base the definition of a binding context on a\nmapping to an underlying ordered sequence of associations. We further show that\nproperties that hold with the ordered sequence view can be lifted to the\ngeneralized definition of binding contexts and that this lifting can, in fact,\nbe automated. These ideas find use in the extension currently under development\nof the two-level logic approach of Abella to a setting where linear logic is\nused as the specification logic.\n","subjects":["Computing Research Repository/Logic in Computer Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}