{"id":"2407.03342","title":"Prototype Analysis in Hopfield Networks with Hebbian Learning","authors":"Hayden McAlister, Anthony Robins, Lech Szymanski","authorsParsed":[["McAlister","Hayden",""],["Robins","Anthony",""],["Szymanski","Lech",""]],"versions":[{"version":"v1","created":"Wed, 29 May 2024 01:03:48 GMT"}],"updateDate":"2024-07-08","timestamp":1716944628000,"abstract":"  We discuss prototype formation in the Hopfield network. Typically, Hebbian\nlearning with highly correlated states leads to degraded memory performance. We\nshow this type of learning can lead to prototype formation, where unlearned\nstates emerge as representatives of large correlated subsets of states,\nalleviating capacity woes. This process has similarities to prototype learning\nin human cognition. We provide a substantial literature review of prototype\nlearning in associative memories, covering contributions from psychology,\nstatistical physics, and computer science. We analyze prototype formation from\na theoretical perspective and derive a stability condition for these states\nbased on the number of examples of the prototype presented for learning, the\nnoise in those examples, and the number of non-example states presented. The\nstability condition is used to construct a probability of stability for a\nprototype state as the factors of stability change. We also note similarities\nto traditional network analysis, allowing us to find a prototype capacity. We\ncorroborate these expectations of prototype formation with experiments using a\nsimple Hopfield network with standard Hebbian learning. We extend our\nexperiments to a Hopfield network trained on data with multiple prototypes and\nfind the network is capable of stabilizing multiple prototypes concurrently. We\nmeasure the basins of attraction of the multiple prototype states, finding\nattractor strength grows with the number of examples and the agreement of\nexamples. We link the stability and dominance of prototype states to the energy\nprofile of these states, particularly when comparing the profile shape to\ntarget states or other spurious states.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Condensed Matter/Disordered Systems and Neural Networks","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}