{"id":"2407.05459","title":"Hiring for An Uncertain Task: Joint Design of Information and Contracts","authors":"Matteo Castiglioni, Junjie Chen","authorsParsed":[["Castiglioni","Matteo",""],["Chen","Junjie",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 18:10:00 GMT"}],"updateDate":"2024-07-09","timestamp":1720375800000,"abstract":"  In this paper, we initiate the computational problem of jointly designing\ninformation and contracts. We consider three possible classes of contracts with\ndecreasing flexibility and increasing simplicity: ambiguous contracts, menus of\nexplicit contracts and explicit single contract. Ambiguous contracts allow the\nprincipal to conceal the applied payment schemes through a contract that\ndepends on the unknown state of nature, while explicit contracts reveal the\ncontract prior to the agent's decision. Our results show a trade-off between\nthe simplicity of the contracts and the computational complexity of the joint\ndesign. Indeed, we show that an approximately-optimal mechanism with ambiguous\ncontracts can be computed in polynomial time. However, they are convoluted\nmechanisms and not well-suited for some real-world scenarios. Conversely,\nexplicit menus of contracts and single contracts are simpler mechanisms, but\nthey cannot be computed efficiently. In particular, we show that computing the\noptimal mechanism with explicit menus of contracts and single contracts is\nAPX-Hard. We also characterize the structure of optimal mechanisms.\nInterestingly, direct mechanisms are optimal for both the most flexible\nambiguous contracts and the least flexible explicit single contract, but they\nare suboptimal for that with menus of contracts. Finally, motivated by our\nhardness results, we turn our attention to menus of linear contracts and single\nlinear contracts. We show that both the problem of computing the optimal\nmechanism with an explicit menu of linear contracts and an explicit single\nlinear contract admits an FPTAS.\n","subjects":["Computing Research Repository/Computer Science and Game Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}