{"id":"2407.20342","title":"Dynamically emergent correlations in bosons via quantum resetting","authors":"Manas Kulkarni, Satya N. Majumdar, Sanjib Sabhapandit","authorsParsed":[["Kulkarni","Manas",""],["Majumdar","Satya N.",""],["Sabhapandit","Sanjib",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:00:35 GMT"}],"updateDate":"2024-07-31","timestamp":1722276035000,"abstract":"  We study the nonequilibrium stationary state (NESS) induced by quantum\nresetting of a system of $N$ noninteracting bosons in a harmonic trap. Our\nprotocol consists of preparing initially the system in the ground state of a\nharmonic oscillator centered at $+a$, followed by a rapid quench where the\ncenter is shifted to $-a$ and the system is allowed to evolve unitarily up to a\nrandom Poissonian time $\\tau$ distributed via $r\\, e^{-r\\, \\tau}$. Then the\ntrap center is reset to $+a$ again and the system is assumed to cool\ninstantaneously to the initial ground state. The system is again allowed to\nevolve unitarily in the trap centered at $-a$ up to a random time, and the\nprocedure is repeated. Under repeated resetting, the system reaches a NESS\nwhere the positions of bosons get $\\rm{\\textit{strongly correlated}}$ due to\nsimultaneous resetting induced by the trap. We fully characterize the steady\nstate by analytically computing several physical observables such as the\naverage density, extreme value statistics, order and gap statistics, and also\nthe distribution of the number of particles in a region $[-L,L]$, known as the\nfull counting statistics (FCS). In particular, we show that in the large $N$\nlimit, the scaling function describing the FCS exhibits a striking feature: it\nis supported over a nontrivial finite interval, and moreover is discontinuous\nat an interior point of the support. Our results are supported by numerical\nsimulations. This is a rare example of a strongly correlated quantum many-body\nNESS where various observables can be exactly computed.\n","subjects":["Condensed Matter/Quantum Gases","Condensed Matter/Statistical Mechanics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}