{"id":"2407.00974","title":"Strong Field Optical Hall Effect in 2D Weyl Semimetal","authors":"M. Umar Farooq, Arqum Hashmi, Mizuki Tani, Kazuhiro Yabana, Kenichi L.\n  Ishikawa, Li Huang, and Tomohito Otobe","authorsParsed":[["Farooq","M. Umar",""],["Hashmi","Arqum",""],["Tani","Mizuki",""],["Yabana","Kazuhiro",""],["Ishikawa","Kenichi L.",""],["Huang","Li",""],["Otobe","Tomohito",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 05:23:10 GMT"}],"updateDate":"2024-07-02","timestamp":1719811390000,"abstract":"  The study of interplay between the geometric nature of Bloch electrons and\ntransverse responses under strong field offers new opportunities for\noptoelectronic applications. Here, we present a comprehensive study of the\nstrong-field response of Weyl Dirac nodes in bilayer T'-WTe2 using\ntime-dependent first-principles formalism. The electron dynamics is explored\nfocusing on the mid-infrared frequency, ranging from the perturbative to\nnonperturbative regime. In the nonperturbative regime, the high-harmonic\ngeneration (HHG) spectra under a strong field clearly exhibit a plateau and\nenergy cutoffs for both longitudinal and anomalous Hall (transverse) currents,\nwith the latter being due to the large interband Berry curvature of the\nWeyl-Dirac semimetal. For the longitudinal harmonics, the intraband\ncontributions increase with intensity, resulting in a complex interplay between\ninterband polarization and intraband motions. Remarkably, if we take a\ncomprehensive all-band perspective enabled by time-dependent density functional\ncalculations, the anomalous Hall responses are purely attributed to the\ninterband processes, even in the nonperturbative regime, thus Hall HHG can be\ncrucial to understand the carrier dynamics. Our findings suggest that HHG\nassociated with the ultrafast strong-field driven electron dynamics holds\nimmense potential for exploring the nonlinear high Hall responses in Weyl\nsemimetal.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}