{"id":"2407.16388","title":"Anwendung von Causal-Discovery-Algorithmen zur Root-Cause-Analyse in der\n  Fahrzeugmontage","authors":"Lucas Possner, Lukas Bahr, Leonard Roehl, Christoph Wehner, Sophie\n  Groeger","authorsParsed":[["Possner","Lucas",""],["Bahr","Lukas",""],["Roehl","Leonard",""],["Wehner","Christoph",""],["Groeger","Sophie",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 11:22:33 GMT"}],"updateDate":"2024-07-24","timestamp":1721733753000,"abstract":"  Root Cause Analysis (RCA) is a quality management method that aims to\nsystematically investigate and identify the cause-and-effect relationships of\nproblems and their underlying causes. Traditional methods are based on the\nanalysis of problems by subject matter experts. In modern production processes,\nlarge amounts of data are collected. For this reason, increasingly\ncomputer-aided and data-driven methods are used for RCA. One of these methods\nare Causal Discovery Algorithms (CDA). This publication demonstrates the\napplication of CDA on data from the assembly of a leading automotive\nmanufacturer. The algorithms used learn the causal structure between the\ncharacteristics of the manufactured vehicles, the ergonomics and the temporal\nscope of the involved assembly processes, and quality-relevant product features\nbased on representative data. This publication compares various CDAs in terms\nof their suitability in the context of quality management. For this purpose,\nthe causal structures learned by the algorithms as well as their runtime are\ncompared. This publication provides a contribution to quality management and\ndemonstrates how CDAs can be used for RCA in assembly processes.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C3JIqcb3cUcGdpbTwzPD1MgKN-QnvmnCAfA8MZPhD1c","pdfSize":"572305","objectId":"0x640d970fb6dc8baa13cdd15152fac1f6d6d9c2cf015d72f10ca779ef7231f175","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
