{"id":"2407.11785","title":"Defining 'Good': Evaluation Framework for Synthetic Smart Meter Data","authors":"Sheng Chai, Gus Chadney, Charlot Avery, Phil Grunewald, Pascal Van\n  Hentenryck, Priya L. Donti","authorsParsed":[["Chai","Sheng",""],["Chadney","Gus",""],["Avery","Charlot",""],["Grunewald","Phil",""],["Van Hentenryck","Pascal",""],["Donti","Priya L.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:41:27 GMT"}],"updateDate":"2024-07-17","timestamp":1721140887000,"abstract":"  Access to granular demand data is essential for the net zero transition; it\nallows for accurate profiling and active demand management as our reliance on\nvariable renewable generation increases. However, public release of this data\nis often impossible due to privacy concerns. Good quality synthetic data can\ncircumnavigate this issue. Despite significant research on generating synthetic\nsmart meter data, there is still insufficient work on creating a consistent\nevaluation framework. In this paper, we investigate how common frameworks used\nby other industries leveraging synthetic data, can be applied to synthetic\nsmart meter data, such as fidelity, utility and privacy. We also recommend\nspecific metrics to ensure that defining aspects of smart meter data are\npreserved and test the extent to which privacy can be protected using\ndifferential privacy. We show that standard privacy attack methods like\nreconstruction or membership inference attacks are inadequate for assessing\nprivacy risks of smart meter datasets. We propose an improved method by\ninjecting training data with implausible outliers, then launching privacy\nattacks directly on these outliers. The choice of $\\epsilon$ (a metric of\nprivacy loss) significantly impacts privacy risk, highlighting the necessity of\nperforming these explicit privacy tests when making trade-offs between fidelity\nand privacy.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}