{"id":"2407.16614","title":"Mobile Technology: A Panacea to Food Insecurity In Nigeria -- A Case\n  Study of SELL HARVEST Application","authors":"Mudathir Muhammad Salahudeen, Muhammad Auwal Mukhtar, Saadu Salihu\n  Abubakar, Salawu I.S","authorsParsed":[["Salahudeen","Mudathir Muhammad",""],["Mukhtar","Muhammad Auwal",""],["Abubakar","Saadu Salihu",""],["S","Salawu I.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 16:21:52 GMT"}],"updateDate":"2024-07-24","timestamp":1721751712000,"abstract":"  Over time, agriculture is the most consistent activity, and it evolves every\nday. It contributes to a vast majority of the Gross Domestic Product (GDP) of\nNigeria but as ironic as it may be, there is still hunger in significant parts\nof the country due to low productivity in the agricultural sector and\ncomparison to the geometric population growth. During the first half of 2022,\nagriculture contributed about 23% of the country's GDP while the industry and\nservices sector had a share of the remaining 77%. This showed that with the\nhigh rate of agricultural activities, Nigeria has not achieved food security\nfor the teeming population. and more productivity levels can be attained.\nTechnology can/will assist Nigeria in overcoming global poverty and hunger\nquicker in both rural and urban areas. Today, there are many types of\nagricultural technologies available for farmers all over the world to increase\nproductivity. Major technological advancements include indoor vertical farming,\nautomation, robotics, livestock technology, modern greenhouse practices,\nprecision agriculture, artificial intelligence, and blockchain. Mobile phones\nhave one of the highest adoption rates of technologies developed within the\nlast century. Digitalization will bring consumers and farmers closer together\nto access the shortest supply chain possible and reduce rural poverty and\nhunger. The paper will review the different agricultural technologies and\npropose a mobile solution, code Sell Harvest, to make farming more sustainable\nand secure food.\n  Keywords: Sell Harvest, Agriculture, Technology, Artificial Intelligence, and\nDigital Farming.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Emerging Technologies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}