{"id":"2407.21415","title":"In situ Qubit Frequency Tuning Circuit for Scalable Superconducting\n  Quantum Computing: Scheme and Experiment","authors":"Lei Jiang, Yu Xu, Shaowei Li, Zhiguang Yan, Ming Gong, Tao Rong,\n  Chenyin Sun, Tianzuo Sun, Tao Jiang, Hui Deng, Chen Zha, Jin Lin, Fusheng\n  Chen, Qingling Zhu, Yangsen Ye, Hao Rong, Kai Yan, Sirui Cao, Yuan Li,\n  Shaojun Guo, Haoran Qian, Yisen Hu, Yulin Wu, Yuhuai Li, Gang Wu, Xueshen\n  Wang, Shijian Wang, Wenhui Cao, Yeru Wang, Jinjin Li, Cheng-Zhi Peng, Xiaobo\n  Zhu, and Jian-Wei Pan","authorsParsed":[["Jiang","Lei",""],["Xu","Yu",""],["Li","Shaowei",""],["Yan","Zhiguang",""],["Gong","Ming",""],["Rong","Tao",""],["Sun","Chenyin",""],["Sun","Tianzuo",""],["Jiang","Tao",""],["Deng","Hui",""],["Zha","Chen",""],["Lin","Jin",""],["Chen","Fusheng",""],["Zhu","Qingling",""],["Ye","Yangsen",""],["Rong","Hao",""],["Yan","Kai",""],["Cao","Sirui",""],["Li","Yuan",""],["Guo","Shaojun",""],["Qian","Haoran",""],["Hu","Yisen",""],["Wu","Yulin",""],["Li","Yuhuai",""],["Wu","Gang",""],["Wang","Xueshen",""],["Wang","Shijian",""],["Cao","Wenhui",""],["Wang","Yeru",""],["Li","Jinjin",""],["Peng","Cheng-Zhi",""],["Zhu","Xiaobo",""],["Pan","Jian-Wei",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 08:02:20 GMT"}],"updateDate":"2024-08-01","timestamp":1722412940000,"abstract":"  Frequency tunable qubit plays a significant role for scalable superconducting\nquantum processors. The state-of-the-art room-temperature electronics for\ntuning qubit frequency suffers from unscalable limit, such as heating problem,\nlinear growth of control cables, etc. Here we propose a scalable scheme to tune\nthe qubit frequency by using in situ superconducting circuit, which is based on\nradio frequency superconducting quantum interference device (rf-SQUID). We\ndemonstrate both theoretically and experimentally that the qubit frequency\ncould be modulated by inputting several single pulses into rf-SQUID. Compared\nwith the traditional scheme, our scheme not only solves the heating problem,\nbut also provides the potential to exponentially reduce the number of cables\ninside the dilute refrigerator and the room-temperature electronics resource\nfor tuning qubit frequency, which is achieved by a time-division-multiplex\n(TDM) scheme combining rf-SQUID with switch arrays. With such TDM scheme, the\nnumber of cables could be reduced from the usual $\\sim 3n$ to $\\sim\n\\log_2{(3n)} + 1$ for two-dimensional quantum processors comprising $n$ qubits\nand $\\sim 2n$ couplers. Our work paves the way for large-scale control of\nsuperconducting quantum processor.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}