{"id":"2407.11125","title":"On the universality of star formation efficiency in galaxies","authors":"Ava Polzin, Andrey V. Kravtsov, Vadim A. Semenov, Nickolay Y. Gnedin","authorsParsed":[["Polzin","Ava",""],["Kravtsov","Andrey V.",""],["Semenov","Vadim A.",""],["Gnedin","Nickolay Y.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-17","timestamp":1721066401000,"abstract":"  We analyze high-resolution hydrodynamics simulations of an isolated disk\ndwarf galaxy with an explicit model for unresolved turbulence and\nturbulence-based star formation prescription. We examine the characteristic\nvalues of the star formation efficiency per free-fall time,\n$\\epsilon_\\mathrm{ff}$, and its variations with local environment properties,\nsuch as metallicity, UV flux, and surface density. We show that the star\nformation efficiency per free-fall time in $\\approx 10$ pc star-forming regions\nof the simulated disks has values in the range $\\epsilon_\\mathrm{ff}\\approx\n0.01-0.1$, similar to observational estimates, with no trend with metallicity\nand only a weak trend with the UV flux. Likewise, $\\epsilon_{\\rm ff}$ estimated\nusing projected patches of 500 pc size does not vary with metallicity and shows\nonly a weak trend with average UV flux and gas surface density. The\ncharacteristic values of $\\epsilon_\\mathrm{ff}\\approx 0.01-0.1$ arise naturally\nin the simulations via the combined effect of dynamical gas compression and\nensuing stellar feedback that injects thermal and turbulent energy. The\ncompression and feedback regulate the virial parameter, $\\alpha_\\mathrm{vir}$,\nin star-forming regions, limiting it to $\\alpha_\\mathrm{vir}\\approx 3-10$.\nTurbulence plays an important role in the universality of\n$\\epsilon_\\mathrm{ff}$ because turbulent energy and its dissipation are not\nsensitive to metallicity and UV flux that affect thermal energy. Our results\nindicate that the universality of observational estimates of\n$\\epsilon_\\mathrm{ff}$ can be plausibly explained by the turbulence-driven and\nfeedback-regulated properties of star-forming regions.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}