{"id":"2407.15110","title":"Practical multi-fidelity machine learning: fusion of deterministic and\n  Bayesian models","authors":"Jiaxiang Yi, Ji Cheng, Miguel A. Bessa","authorsParsed":[["Yi","Jiaxiang",""],["Cheng","Ji",""],["Bessa","Miguel A.",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 10:40:50 GMT"}],"updateDate":"2024-07-23","timestamp":1721558450000,"abstract":"  Multi-fidelity machine learning methods address the accuracy-efficiency\ntrade-off by integrating scarce, resource-intensive high-fidelity data with\nabundant but less accurate low-fidelity data. We propose a practical\nmulti-fidelity strategy for problems spanning low- and high-dimensional\ndomains, integrating a non-probabilistic regression model for the low-fidelity\nwith a Bayesian model for the high-fidelity. The models are trained in a\nstaggered scheme, where the low-fidelity model is transfer-learned to the\nhigh-fidelity data and a Bayesian model is trained for the residual. This\nthree-model strategy -- deterministic low-fidelity, transfer learning, and\nBayesian residual -- leads to a prediction that includes uncertainty\nquantification both for noisy and noiseless multi-fidelity data. The strategy\nis general and unifies the topic, highlighting the expressivity trade-off\nbetween the transfer-learning and Bayesian models (a complex transfer-learning\nmodel leads to a simpler Bayesian model, and vice versa). We propose modeling\nchoices for two scenarios, and argue in favor of using a linear\ntransfer-learning model that fuses 1) kernel ridge regression for low-fidelity\nwith Gaussian processes for high-fidelity; or 2) deep neural network for\nlow-fidelity with a Bayesian neural network for high-fidelity. We demonstrate\nthe effectiveness and efficiency of the proposed strategies and contrast them\nwith the state-of-the-art based on various numerical examples. The simplicity\nof these formulations makes them practical for a broad scope of future\nengineering applications.\n","subjects":["Computing Research Repository/Machine Learning","Mathematics/Probability","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}