{"id":"2407.15730","title":"Neural-based Video Compression on Solar Dynamics Observatory Images","authors":"Atefeh Khoshkhahtinat, Ali Zafari, Piyush M. Mehta, Nasser M.\n  Nasrabadi, Barbara J. Thompson, Michael S. F. Kirk, Daniel da Silva","authorsParsed":[["Khoshkhahtinat","Atefeh",""],["Zafari","Ali",""],["Mehta","Piyush M.",""],["Nasrabadi","Nasser M.",""],["Thompson","Barbara J.",""],["Kirk","Michael S. F.",""],["da Silva","Daniel",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 21:24:25 GMT"}],"updateDate":"2024-07-23","timestamp":1720819465000,"abstract":"  NASA's Solar Dynamics Observatory (SDO) mission collects extensive data to\nmonitor the Sun's daily activity. In the realm of space mission design, data\ncompression plays a crucial role in addressing the challenges posed by limited\ntelemetry rates. The primary objective of data compression is to facilitate\nefficient data management and transmission to work within the constrained\nbandwidth, thereby ensuring that essential information is captured while\noptimizing the utilization of available resources. This paper introduces a\nneural video compression technique that achieves a high compression ratio for\nthe SDO's image data collection. The proposed approach focuses on leveraging\nboth temporal and spatial redundancies in the data, leading to a more efficient\ncompression. In this work, we introduce an architecture based on the\nTransformer model, which is specifically designed to capture both local and\nglobal information from input images in an effective and efficient manner.\nAdditionally, our network is equipped with an entropy model that can accurately\nmodel the probability distribution of the latent representations and improves\nthe speed of the entropy decoding step. The entropy model leverages a\nchannel-dependent approach and utilizes checkerboard-shaped local and global\nspatial contexts. By combining the Transformer-based video compression network\nwith our entropy model, the proposed compression algorithm demonstrates\nsuperior performance over traditional video codecs like H.264 and H.265, as\nconfirmed by our experimental results.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Astrophysics/Instrumentation and Methods for Astrophysics","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}