{"id":"2407.15943","title":"Closing the gap: secular evolution of bar-induced dark gaps in presence\n  of thick discs","authors":"Soumavo Ghosh, Dimitri A. Gadotti, Francesca Fragkoudi, Vighnesh\n  Nagpal, Paola Di Matteo, Virginia Cuomo","authorsParsed":[["Ghosh","Soumavo",""],["Gadotti","Dimitri A.",""],["Fragkoudi","Francesca",""],["Nagpal","Vighnesh",""],["Di Matteo","Paola",""],["Cuomo","Virginia",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:00:12 GMT"}],"updateDate":"2024-07-24","timestamp":1721671212000,"abstract":"  The presence of dark gaps, a preferential light deficit along the bar minor\naxis, is observationally well known. The properties of dark gaps are thought to\nbe associated with the properties of bars, and their spatial locations are\noften associated with bar resonances. However, a systematic study, testing the\nrobustness and universality of these assumptions, is still largely missing.\nHere, we investigate the formation and evolution of bar-induced dark gaps using\na suite of N-body models of (kinematically cold) thin and (kinematically hot)\nthick discs with varying thick disc mass fraction, and different thin-to-thick\ndisc geometry. We find that dark gaps are a natural consequence of the trapping\nof disc stars by the bar. The properties of dark gaps (such as strength and\nextent) are well correlated with the properties of bars. For stronger dark\ngaps, the fractional mass loss along the bar minor axis can reach up to ~60-80\npercent of the initial mass contained, which is redistributed within the bar.\nThese trends hold true irrespective of the mass fraction in the thick disc and\nthe assumed disc geometry. In all our models harbouring slow bars, none of the\nresonances (corotation, Inner Lindblad resonance, and 4:1 ultra-harmonic\nresonance) associated with the bar correspond to the location of dark gaps,\nthereby suggesting that the location of dark gaps is not a universal proxy for\nthese bar resonances, in contrast with earlier studies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}