{"id":"2407.01106","title":"Indirect social influence and diffusion of innovations: An experimental\n  approach","authors":"Manuel Miranda, Mar\\'ia Pereda, Angel S\\'anchez, Ernesto Estrada","authorsParsed":[["Miranda","Manuel",""],["Pereda","María",""],["Sánchez","Angel",""],["Estrada","Ernesto",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 09:18:21 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 07:12:46 GMT"},{"version":"v3","created":"Fri, 5 Jul 2024 08:23:24 GMT"}],"updateDate":"2024-07-08","timestamp":1719825501000,"abstract":"  A fundamental feature for understanding the diffusion of innovations through\na social group is the manner in which we are influenced by our own social\ninteractions. It is usually assumed that only direct interactions, those that\nform our social network, determine the dynamics of adopting innovations. Here,\nwe put this assumption to the test by experimentally and theoretically studying\nthe role of direct and indirect influences in the adoption of innovations. We\nperform experiments specifically designed to capture the influence that an\nindividual receives from their direct social ties as well as from those\nsocially close to them, as a function of the separation they have in their\nsocial network. The results of 21 experimental sessions with more than 590\nparticipants show that the rate of adoption of an innovation is significantly\ninfluenced not only by our nearest neighbors but also by the second and third\nlevels of influences an adopter has. Using a mathematical model that accounts\nfor both direct and indirect interactions in a network, we fit the experimental\nresults and determine the way in which influences decay with social distance.\nThe results indicate that the strength of peer pressure on an adopter coming\nfrom its second and third circles of influence is approximately 2/3 and 1/3,\nrespectively, relative to their closest neighbors. Our results strongly suggest\nthat innovation adoption is a complex process in which an individual feels\nsignificant pressure not only from their direct ties but also by those socially\nclose to them.\n","subjects":["Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"avgXb381YLZgYb45-5o-3DQPfcbgnY93ABZZ6MvUz6c","pdfSize":"4016632"}
