{"id":"2407.18832","title":"Accurate and Scalable Detection and Investigation of Cyber Persistence\n  Threats","authors":"Qi Liu, Muhammad Shoaib, Mati Ur Rehman, Kaibin Bao, Veit Hagenmeyer,\n  Wajih Ul Hassan","authorsParsed":[["Liu","Qi",""],["Shoaib","Muhammad",""],["Rehman","Mati Ur",""],["Bao","Kaibin",""],["Hagenmeyer","Veit",""],["Hassan","Wajih Ul",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 15:51:49 GMT"}],"updateDate":"2024-07-29","timestamp":1722009109000,"abstract":"  In Advanced Persistent Threat (APT) attacks, achieving stealthy persistence\nwithin target systems is often crucial for an attacker's success. This\npersistence allows adversaries to maintain prolonged access, often evading\ndetection mechanisms. Recognizing its pivotal role in the APT lifecycle, this\npaper introduces Cyber Persistence Detector (CPD), a novel system dedicated to\ndetecting cyber persistence through provenance analytics. CPD is founded on the\ninsight that persistent operations typically manifest in two phases: the\n\"persistence setup\" and the subsequent \"persistence execution\". By causally\nrelating these phases, we enhance our ability to detect persistent threats.\nFirst, CPD discerns setups signaling an impending persistent threat and then\ntraces processes linked to remote connections to identify persistence execution\nactivities. A key feature of our system is the introduction of\npseudo-dependency edges (pseudo-edges), which effectively connect these\ndisjoint phases using data provenance analysis, and expert-guided edges, which\nenable faster tracing and reduced log size. These edges empower us to detect\npersistence threats accurately and efficiently. Moreover, we propose a novel\nalert triage algorithm that further reduces false positives associated with\npersistence threats. Evaluations conducted on well-known datasets demonstrate\nthat our system reduces the average false positive rate by 93% compared to\nstate-of-the-art methods.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}