{"id":"2407.02803","title":"KnobCF: Uncertainty-aware Knob Tuning","authors":"Yu Yan, Junfang Huang, Hongzhi Wang, Jian Geng, Kaixin Zhang, Tao Yu","authorsParsed":[["Yan","Yu",""],["Huang","Junfang",""],["Wang","Hongzhi",""],["Geng","Jian",""],["Zhang","Kaixin",""],["Yu","Tao",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 04:21:01 GMT"}],"updateDate":"2024-07-04","timestamp":1719980461000,"abstract":"  The knob tuning aims to optimize database performance by searching for the\nmost effective knob configuration under a certain workload. Existing works\nsuffer two significant problems. On the one hand, there exist multiple similar\neven useless evaluations of knob tuning even with the diverse searching methods\nbecause of the different sensitivities of knobs on a certain workload. On the\nother hand, the single evaluation of knob configurations may bring\noverestimation or underestimation because of the query uncertainty performance.\nTo solve the above problems, we propose a decoupled query uncertainty-aware\nknob classifier, called KnobCF, to enhance the knob tuning. Our method has\nthree significant contributions: (1) We propose a novel concept of the\nuncertainty-aware knob configuration estimation to enhance the knob tuning\nprocess. (2) We provide an effective few-shot uncertainty knob estimator\nwithout extra time consumption in training data collection, which has a high\ntime efficiency in practical tuning tasks. (3) Our method provides a general\nframework that could be easily deployed in any knob tuning task because we make\nno changes to the knob tuners and the database management system. Our\nexperiments on four open-source benchmarks demonstrate that our method\neffectively reduces useless evaluations and improves the tuning results.\nEspecially in TPCC, our method achieves competitive tuning results with only\n60% to 70% time consumption compared to the full workload evaluations.\n","subjects":["Computing Research Repository/Databases"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}