{"id":"2407.12128","title":"Distribution Alignment for Fully Test-Time Adaptation with Dynamic\n  Online Data Streams","authors":"Ziqiang Wang, Zhixiang Chi, Yanan Wu, Li Gu, Zhi Liu, Konstantinos\n  Plataniotis, Yang Wang","authorsParsed":[["Wang","Ziqiang",""],["Chi","Zhixiang",""],["Wu","Yanan",""],["Gu","Li",""],["Liu","Zhi",""],["Plataniotis","Konstantinos",""],["Wang","Yang",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 19:33:23 GMT"}],"updateDate":"2024-07-18","timestamp":1721158403000,"abstract":"  Given a model trained on source data, Test-Time Adaptation (TTA) enables\nadaptation and inference in test data streams with domain shifts from the\nsource. Current methods predominantly optimize the model for each incoming test\ndata batch using self-training loss. While these methods yield commendable\nresults in ideal test data streams, where batches are independently and\nidentically sampled from the target distribution, they falter under more\npractical test data streams that are not independent and identically\ndistributed (non-i.i.d.). The data batches in a non-i.i.d. stream display\nprominent label shifts relative to each other. It leads to conflicting\noptimization objectives among batches during the TTA process. Given the\ninherent risks of adapting the source model to unpredictable test-time\ndistributions, we reverse the adaptation process and propose a novel\nDistribution Alignment loss for TTA. This loss guides the distributions of\ntest-time features back towards the source distributions, which ensures\ncompatibility with the well-trained source model and eliminates the pitfalls\nassociated with conflicting optimization objectives. Moreover, we devise a\ndomain shift detection mechanism to extend the success of our proposed TTA\nmethod in the continual domain shift scenarios. Our extensive experiments\nvalidate the logic and efficacy of our method. On six benchmark datasets, we\nsurpass existing methods in non-i.i.d. scenarios and maintain competitive\nperformance under the ideal i.i.d. assumption.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}