{"id":"2407.21792","title":"Safetywashing: Do AI Safety Benchmarks Actually Measure Safety Progress?","authors":"Richard Ren, Steven Basart, Adam Khoja, Alice Gatti, Long Phan, Xuwang\n  Yin, Mantas Mazeika, Alexander Pan, Gabriel Mukobi, Ryan H. Kim, Stephen\n  Fitz, Dan Hendrycks","authorsParsed":[["Ren","Richard",""],["Basart","Steven",""],["Khoja","Adam",""],["Gatti","Alice",""],["Phan","Long",""],["Yin","Xuwang",""],["Mazeika","Mantas",""],["Pan","Alexander",""],["Mukobi","Gabriel",""],["Kim","Ryan H.",""],["Fitz","Stephen",""],["Hendrycks","Dan",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 17:59:24 GMT"}],"updateDate":"2024-08-01","timestamp":1722448764000,"abstract":"  As artificial intelligence systems grow more powerful, there has been\nincreasing interest in \"AI safety\" research to address emerging and future\nrisks. However, the field of AI safety remains poorly defined and\ninconsistently measured, leading to confusion about how researchers can\ncontribute. This lack of clarity is compounded by the unclear relationship\nbetween AI safety benchmarks and upstream general capabilities (e.g., general\nknowledge and reasoning). To address these issues, we conduct a comprehensive\nmeta-analysis of AI safety benchmarks, empirically analyzing their correlation\nwith general capabilities across dozens of models and providing a survey of\nexisting directions in AI safety. Our findings reveal that many safety\nbenchmarks highly correlate with upstream model capabilities, potentially\nenabling \"safetywashing\" -- where capability improvements are misrepresented as\nsafety advancements. Based on these findings, we propose an empirical\nfoundation for developing more meaningful safety metrics and define AI safety\nin a machine learning research context as a set of clearly delineated research\ngoals that are empirically separable from generic capabilities advancements. In\ndoing so, we aim to provide a more rigorous framework for AI safety research,\nadvancing the science of safety evaluations and clarifying the path towards\nmeasurable progress.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}