{"id":"2407.20338","title":"Realizaiton of high-fidelity perfect entangler between remote\n  superconducting quantum processors","authors":"Juan Song, Shuang Yang, Pei Liu, Guang-Ming Xue, Zhen-Yu Mi, Wen-Gang\n  Zhang, Fei Yan, Yi-Rong Jin, and Hai-Feng Yu","authorsParsed":[["Song","Juan",""],["Yang","Shuang",""],["Liu","Pei",""],["Xue","Guang-Ming",""],["Mi","Zhen-Yu",""],["Zhang","Wen-Gang",""],["Yan","Fei",""],["Jin","Yi-Rong",""],["Yu","Hai-Feng",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:00:12 GMT"}],"updateDate":"2024-07-31","timestamp":1722276012000,"abstract":"  Building large-scale quantum computers from smaller modules offers a solution\nto many formidable scientific and engineering challenges. Nevertheless,\nengineering high-fidelity interconnects between modules remains challenging. In\nrecent years, quantum state transfer (QST) has provided a way to establish\nentanglement between two separately packaged quantum devices. However, QST is\nnot a unitary gate, thus cannot be directly inserted into a quantum circuit,\nwhich is widely used in recent quantum computation studies. Here we report a\ndemonstration of a direct CNOT gate realized by the cross resonance (CR) effect\nbetween two remotely packaged quantum devices connected by a microwave cable.\nWe achieve a CNOT gate with fidelity as high as $99.15 \\pm 0.02\\%$. The quality\nof the CNOT gate is verified by cross-entropy benchmarking (XEB) and further\nconfirmed by demonstrating Bell-inequality violation. This work provides a new\nmethod to realize remote two-qubit gates. Our method can be used not only to\nachieve distributed quantum computing but also to enrich the topology of\nsuperconducting quantum chips with jumper lines connecting distant qubits. This\nadvancement gives superconducting qubits broader application prospects in the\nfields of quantum computing and quantum simulation.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}