{"id":"2407.08197","title":"Exploring the nature of the jetted hybrid AGNs: PKS 2004-447, 3C 286 and\n  PKS 0440-00 through the SED modeling","authors":"Jessica Luna-Cervantes, Andrea Tramacere, Erika Ben\\'itez","authorsParsed":[["Luna-Cervantes","Jessica",""],["Tramacere","Andrea",""],["Benítez","Erika",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 05:39:32 GMT"}],"updateDate":"2024-07-12","timestamp":1720676372000,"abstract":"  In this work, we explore the connection of three jetted $\\gamma-$loud AGNs\nclasses: Compact Steep-Spectrum Sources (CSS), Narrow-Line Seyfert 1 (NLS1),\nand Flat-Spectrum Radio Quasars, through the modeling of the spectral energy\ndistribution (SED). We selected two sources identified as CSS/NLS1 hybrids, PKS\n2004-440 and 3C 286. Additionally, we included the source PKS 0440-00,\ninitially classified as an FSRQ in the first Fermi-LAT catalog, but recently\nreclassified as an NLS1. We present the results of their broadband SED modeling\nusing a one-zone leptonic synchrotron-self Compton (SSC)+external Compton (EC)\nmodel. By exploring the parameter space and investigating the disk-jet\nconnection in these sources, we analyze their classification in a\nmodel-dependent way. Our findings reveal that modeling PKS 2004-447 at\nrelatively large angles, as expected for CSS, results in an SSC-dominated\ninverse Compton emission. In contrast, at low observing angles, the inverse\nCompton emission is dominated by external photon fields. Both scenarios result\nin a jet with a low radiative power. For 3C 286 we found that using a one-zone\nmodel limits the jet viewing angle to $\\sim7^{\\circ}$, mainly due to its impact\non the $\\gamma$-ray emission. Our model results show a magnetically dominated\njet, consistent with $\\gamma$-CSS sources. Our results suggest that PKS\n0440-00, can be classified as a powerful $\\gamma-$NLS1, characterized by high\naccretion power and a jet dominated by bulk motion, similar to FSRQs.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"nWHHYmqfsQWC_popR_kmBsy3RKwnQta-dJFcokyYUV0","pdfSize":"5807296"}
