{"id":"2407.09452","title":"Beyond the instanton gas approach: dominant thimbles approximation for\n  the Hubbard model","authors":"Maksim Ulybyshev, Fakher F. Assaad","authorsParsed":[["Ulybyshev","Maksim",""],["Assaad","Fakher F.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 17:37:28 GMT"}],"updateDate":"2024-07-15","timestamp":1720805848000,"abstract":"  To each complex saddle point of an action, one can attach a Lefschetz thimble\non which the imaginary part of the action is constant. Cauchy theorem states\nthat summation over a set of thimbles produces the exact result. This\nreorganization of the path integral, is an appealing starting point for various\napproximations: In the realm of auxiliary quantum Monte Carlo methods it\nprovides a framework to alleviate the negative sign problem. Here, we suggest\nto constrain the integration to the \\textit{dominant} thimbles: the thimbles\nattached to the saddle points with the largest statistical weight. For the\nHubbard model, in a formulation where the the Hubbard Stratonovitch field\ncouples to the charge, this provides a \\textit{symmetry} consistent\napproximation to the physics of the Hubbard model: constraining the integration\ndomain does not explicitly break a symmetry. We can test this approach for the\nHubbard model at half-filling on a bipartite lattice. The paper builds on the\npreviously developed instanton gas approach, where an exhaustive saddle point\napproximation was constructed. We present results, showing that the dominant\nthimbles approximation provides results that are in remarkable agreement with\nthe exact results for various fermionic observables including spin and charge\norder parameters and single electron spectral functions. We discuss\nimplications of our results for simulations away of half filling.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Physics/High Energy Physics - Lattice","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}