{"id":"2407.19155","title":"Debiased Graph Poisoning Attack via Contrastive Surrogate Objective","authors":"Kanghoon Yoon, Yeonjun In, Namkyeong Lee, Kibum Kim, Chanyoung Park","authorsParsed":[["Yoon","Kanghoon",""],["In","Yeonjun",""],["Lee","Namkyeong",""],["Kim","Kibum",""],["Park","Chanyoung",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 03:20:03 GMT"}],"updateDate":"2024-07-30","timestamp":1722050403000,"abstract":"  Graph neural networks (GNN) are vulnerable to adversarial attacks, which aim\nto degrade the performance of GNNs through imperceptible changes on the graph.\nHowever, we find that in fact the prevalent meta-gradient-based attacks, which\nutilizes the gradient of the loss w.r.t the adjacency matrix, are biased\ntowards training nodes. That is, their meta-gradient is determined by a\ntraining procedure of the surrogate model, which is solely trained on the\ntraining nodes. This bias manifests as an uneven perturbation, connecting two\nnodes when at least one of them is a labeled node, i.e., training node, while\nit is unlikely to connect two unlabeled nodes. However, these biased attack\napproaches are sub-optimal as they do not consider flipping edges between two\nunlabeled nodes at all. This means that they miss the potential attacked edges\nbetween unlabeled nodes that significantly alter the representation of a node.\nIn this paper, we investigate the meta-gradients to uncover the root cause of\nthe uneven perturbations of existing attacks. Based on our analysis, we propose\na Meta-gradient-based attack method using contrastive surrogate objective\n(Metacon), which alleviates the bias in meta-gradient using a new surrogate\nloss. We conduct extensive experiments to show that Metacon outperforms\nexisting meta gradient-based attack methods through benchmark datasets, while\nshowing that alleviating the bias towards training nodes is effective in\nattacking the graph structure.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}