{"id":"2407.05307","title":"Edge-guided and Cross-scale Feature Fusion Network for Efficient\n  Multi-contrast MRI Super-Resolution","authors":"Zhiyuan Yang, Bo Zhang, Zhiqiang Zeng and Si Yong Yeo","authorsParsed":[["Yang","Zhiyuan",""],["Zhang","Bo",""],["Zeng","Zhiqiang",""],["Yeo","Si Yong",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 09:19:55 GMT"},{"version":"v2","created":"Sun, 25 Aug 2024 00:55:25 GMT"}],"updateDate":"2024-08-27","timestamp":1720343995000,"abstract":"  In recent years, MRI super-resolution techniques have achieved great success,\nespecially multi-contrast methods that extract texture information from\nreference images to guide the super-resolution reconstruction. However, current\nmethods primarily focus on texture similarities at the same scale, neglecting\ncross-scale similarities that provide comprehensive information. Moreover, the\nmisalignment between features of different scales impedes effective aggregation\nof information flow. To address the limitations, we propose a novel edge-guided\nand cross-scale feature fusion network, namely ECFNet. Specifically, we develop\na pipeline consisting of the deformable convolution and the cross-attention\ntransformer to align features of different scales. The cross-scale fusion\nstrategy fully integrates the texture information from different scales,\nsignificantly enhancing the super-resolution. In addition, a novel structure\ninformation collaboration module is developed to guide the super-resolution\nreconstruction with implicit structure priors. The structure information\nenables the network to focus on high-frequency components of the image,\nresulting in sharper details. Extensive experiments on the IXI and BraTS2020\ndatasets demonstrate that our method achieves state-of-the-art performance\ncompared to other multi-contrast MRI super-resolution methods, and our method\nis robust in terms of different super-resolution scales. We would like to\nrelease our code and pre-trained model after the paper is accepted.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}