{"id":"2407.18450","title":"Textile Anomaly Detection: Evaluation of the State-of-the-Art for\n  Automated Quality Inspection of Carpet","authors":"Briony Forsberg, Dr Henry Williams, Prof Bruce MacDonald, Tracy Chen,\n  Dr Kirstine Hulse","authorsParsed":[["Forsberg","Briony",""],["Williams","Dr Henry",""],["MacDonald","Prof Bruce",""],["Chen","Tracy",""],["Hulse","Dr Kirstine",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 01:13:59 GMT"}],"updateDate":"2024-07-29","timestamp":1721956439000,"abstract":"  In this study, state-of-the-art unsupervised detection models were evaluated\nfor the purpose of automated anomaly inspection of wool carpets. A custom\ndataset of four unique types of carpet textures was created to thoroughly test\nthe models and their robustness in detecting subtle anomalies in complex\ntextures. Due to the requirements of an inline inspection system in a\nmanufacturing use case, the metrics of importance in this study were accuracy\nin detecting anomalous areas, the number of false detections, and the inference\ntimes of each model for real-time performance. Of the evaluated models, the\nstudent-teacher network based methods were found on average to yield the\nhighest detection accuracy and lowest false detection rates. When trained on a\nmulti-class dataset the models were found to yield comparable if not better\nresults than single-class training. Finally, in terms of detection speed, with\nexception to the generative model, all other evaluated models were found to\nhave comparable inference times on a GPU, with an average of 0.16s per image.\nOn a CPU, most of these models typically produced results between 1.5 to 2\ntimes the respective GPU inference times.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"xyEWZ_P3LeWIjFnbnb4Utiy73zcw8HFV_HGK7hlXKvc","pdfSize":"8571823"}
