{"id":"2407.12483","title":"Towards AI-Powered Video Assistant Referee System (VARS) for Association\n  Football","authors":"Jan Held, Anthony Cioppa, Silvio Giancola, Abdullah Hamdi, Christel\n  Devue, Bernard Ghanem and Marc Van Droogenbroeck","authorsParsed":[["Held","Jan",""],["Cioppa","Anthony",""],["Giancola","Silvio",""],["Hamdi","Abdullah",""],["Devue","Christel",""],["Ghanem","Bernard",""],["Van Droogenbroeck","Marc",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 11:09:03 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 07:18:23 GMT"}],"updateDate":"2024-07-19","timestamp":1721214543000,"abstract":"  Over the past decade, the technology used by referees in football has\nimproved substantially, enhancing the fairness and accuracy of decisions. This\nprogress has culminated in the implementation of the Video Assistant Referee\n(VAR), an innovation that enables backstage referees to review incidents on the\npitch from multiple points of view. However, the VAR is currently limited to\nprofessional leagues due to its expensive infrastructure and the lack of\nreferees worldwide. In this paper, we present the semi-automated Video\nAssistant Referee System (VARS) that leverages the latest findings in\nmulti-view video analysis. VARS sets a new state-of-the-art on the\nSoccerNet-MVFoul dataset, a multi-view video dataset of football fouls. Our\nVARS achieves a new state-of-the-art on the SoccerNet-MVFoul dataset by\nrecognizing the type of foul in 50% of instances and the appropriate sanction\nin 46% of cases. Finally, we conducted a comparative study to investigate human\nperformance in classifying fouls and their corresponding severity and compared\nthese findings to our VARS. The results of our study highlight the potential of\nour VARS to reach human performance and support football refereeing across all\nlevels of professional and amateur federations.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5IjVJ7CbiqZo-9tZWAcGye7ldzYFBBnZXbLFa39COag","pdfSize":"10395700","objectId":"0x5b026b481a8d3724ea023e723b70d582c229b2e960a15efbcdf37b05c6b95ef9","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
