{"id":"2407.20797","title":"Witnessing Disorder in Quantum Magnets","authors":"Snigdh Sabharwal, Tokuro Shimokawa, Nic Shannon","authorsParsed":[["Sabharwal","Snigdh",""],["Shimokawa","Tokuro",""],["Shannon","Nic",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 13:00:37 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 15:19:19 GMT"}],"updateDate":"2024-08-01","timestamp":1722344437000,"abstract":"  There are no clean samples in nature. Therefore, when we come to discuss the\nentanglement properties of quantum materials, the effects of disorder must be\ntaken into account. This question is of particular interest for high-entangled\nstates, such as quantum spin liquids, which lie outside the Landau paradigm for\nclassifying phases of matter. In this work, we explore what\nexperimentally-accessible measures, in the form of concurrence, residual tangle\nand quantum Fisher information, can teach us about the entanglement in the\npresence of disorder. As a representative example, we consider the\nTomonaga-Luttinger liquids (TLL) and disorder-driven random singlet (RS) states\nfound in antiferromagnetic quantum spin chains. Using quantum Fisher\ninformation and residual tangle, we demonstrate that both TLL and RS states\nexhibit multi-partite entanglement. In the case of the RS state, we attribute\nthis to entanglement localized below a crossover length scale. We further show\nthat the order of disorder average matters in calculating measures like\nconcurrence, and that this can lead to false inferences when interpreting\nexperiment. None the less, correctly interpreted, these witnesses provide\nuseful information about the effects of disorder. We explore how information\nabout the central charge of the TLL can be extracted from the low-temperature\nbehavior of concurrence, and conjecture that this analysis can be extended to\nthe effective central charge of the RS state. Finally, we establish how RS and\nTLL states can be distinguished through the growth of multi-partite\nentanglement, as witnessed by the equal-time structure factor. These results\nestablish that, used carefully, experiments based on entanglement witnesses can\nprovide important information about quantum spin systems in the presence of\ndisorder.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Disordered Systems and Neural Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}