{"id":"2407.14464","title":"AttentNet: Fully Convolutional 3D Attention for Lung Nodule Detection","authors":"Majedaldein Almahasneh, Xianghua Xie, and Adeline Paiement","authorsParsed":[["Almahasneh","Majedaldein",""],["Xie","Xianghua",""],["Paiement","Adeline",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 17:06:27 GMT"}],"updateDate":"2024-07-22","timestamp":1721408787000,"abstract":"  Motivated by the increasing popularity of attention mechanisms, we observe\nthat popular convolutional (conv.) attention models like Squeeze-and-Excite\n(SE) and Convolutional Block Attention Module (CBAM) rely on expensive\nmulti-layer perception (MLP) layers. These MLP layers significantly increase\ncomputational complexity, making such models less applicable to 3D image\ncontexts, where data dimensionality and computational costs are higher. In 3D\nmedical imaging, such as 3D pulmonary CT scans, efficient processing is crucial\ndue to the large data volume. Traditional 2D attention generalized to 3D\nincreases the computational load, creating demand for more efficient attention\nmechanisms for 3D tasks. We investigate the possibility of incorporating fully\nconvolutional (conv.) attention in 3D context. We present two 3D fully conv.\nattention blocks, demonstrating their effectiveness in 3D context. Using\npulmonary CT scans for 3D lung nodule detection, we present AttentNet, an\nautomated lung nodule detection framework from CT images, performing detection\nas an ensemble of two stages, candidate proposal and false positive (FP)\nreduction. We compare the proposed 3D attention blocks to popular 2D conv.\nattention methods generalized to 3D modules and to self-attention units. For\nthe FP reduction stage, we also use a joint analysis approach to aggregate\nspatial information from different contextual levels. We use LUNA-16 lung\nnodule detection dataset to demonstrate the benefits of the proposed fully\nconv. attention blocks compared to baseline popular lung nodule detection\nmethods when no attention is used. Our work does not aim at achieving\nstate-of-the-art results in the lung nodule detection task, rather to\ndemonstrate the benefits of incorporating fully conv. attention within a 3D\ncontext.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}