{"id":"2407.06314","title":"Personality Analysis for Social Media Users using Arabic language and\n  its Effect on Sentiment Analysis","authors":"Mokhaiber Dandash, Masoud Asadpour","authorsParsed":[["Dandash","Mokhaiber",""],["Asadpour","Masoud",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:27:54 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 04:14:59 GMT"},{"version":"v3","created":"Mon, 22 Jul 2024 19:27:20 GMT"}],"updateDate":"2024-07-24","timestamp":1720463274000,"abstract":"  Social media is heading towards more and more personalization, where\nindividuals reveal their beliefs, interests, habits, and activities, simply\noffering glimpses into their personality traits. This study, explores the\ncorrelation between the use of Arabic language on twitter, personality traits\nand its impact on sentiment analysis. We indicated the personality traits of\nusers based on the information extracted from their profile activities, and the\ncontent of their tweets. Our analysis incorporated linguistic features, profile\nstatistics (including gender, age, bio, etc.), as well as additional features\nlike emoticons. To obtain personality data, we crawled the timelines and\nprofiles of users who took the 16personalities test in Arabic on\n16personalities.com. Our dataset, \"AraPers\", comprised 3,250 users who shared\ntheir personality results on twitter. We implemented various machine learning\ntechniques, to reveal personality traits and developed a dedicated model for\nthis purpose, achieving a 74.86% accuracy rate with BERT, analysis of this\ndataset proved that linguistic features, profile features and derived model can\nbe used to differentiate between different personality traits. Furthermore, our\nfindings demonstrated that personality affect sentiment in social media. This\nresearch contributes to the ongoing efforts in developing robust understanding\nof the relation between human behaviour on social media and personality\nfeatures for real-world applications, such as political discourse analysis, and\npublic opinion tracking.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}