{"id":"2407.15482","title":"Quantum three-rotor problem in the identity representation","authors":"Govind S. Krishnaswami and Himalaya Senapati","authorsParsed":[["Krishnaswami","Govind S.",""],["Senapati","Himalaya",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 08:51:39 GMT"}],"updateDate":"2024-07-23","timestamp":1721638299000,"abstract":"  The quantum three-rotor problem concerns the dynamics of three equally\nmassive particles moving on a circle subject to pairwise attractive cosine\npotentials and can model coupled Josephson junctions. Classically, it displays\norder-chaos-order behavior with increasing energy. The quantum system admits a\ndimensionless coupling with semiclassical behavior at strong coupling. We study\nstationary states with periodic `relative' wave functions. Perturbative and\nharmonic approximations capture the spectrum at weak coupling and that of\nlow-lying states at strong coupling. More generally, the cumulative\ndistribution of energy levels obtained by numerical diagonalization is\nwell-described by a Weyl-like semiclassical estimate. However, the system has\nan $S_3 \\times \\mathbb{Z}_2$ symmetry that is obscured when working with\nrelative angles. By exploiting a basis for invariant states, we obtain the\npurified spectrum in the identity representation. To uncover universal quantum\nhallmarks of chaos, we partition the spectrum into energy windows where the\nclassical motion is regular, mixed or chaotic and unfold each separately. At\nstrong coupling, we find striking signatures of transitions between regularity\nand chaos: spacing distributions morph from Poisson to Wigner-Dyson while the\nnumber variance shifts from linear to logarithmic behavior at small lengths.\nSome nonuniversal features are also examined. For instance, the number variance\nsaturates and oscillates at large lengths for strong coupling while deviations\nfrom Poisson spacings at asymptotically low and high energies are\nwell-explained by purified quantum harmonic and free-rotor spectra at strong\nand weak coupling. Interestingly, the degeneracy of free-rotor levels admits an\nelegant formula that we deduce using properties of Eisenstein primes.\n","subjects":["Nonlinear Sciences/Chaotic Dynamics","Physics/Mathematical Physics","Mathematics/Dynamical Systems","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}