{"id":"2407.11118","title":"Tight lower bound on the error exponent of classical-quantum channels","authors":"Joseph M. Renes","authorsParsed":[["Renes","Joseph M.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:00:01 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 11:26:49 GMT"}],"updateDate":"2024-07-22","timestamp":1721066401000,"abstract":"  A fundamental quantity of interest in Shannon theory, classical or quantum,\nis the error exponent of a given channel $W$ and rate $R$: the constant\n$E(W,R)$ which governs the exponential decay of decoding error when using ever\nlarger optimal codes of fixed rate $R$ to communicate over ever more\n(memoryless) instances of a given channel $W$. Nearly matching lower and upper\nbounds are well-known for classical channels. Here I show a lower bound on the\nerror exponent of communication over arbitrary classical-quantum (CQ) channels\nwhich matches Dalai's sphere-packing upper bound [IEEE TIT 59, 8027 (2013)] for\nrates above a critical value, exactly analogous to the case of classical\nchannels. This proves a conjecture made by Holevo in his investigation of the\nproblem [IEEE TIT 46, 2256 (2000)].\n  Unlike the classical case, however, the argument does not proceed via a\nrefined analysis of a suitable decoder, but instead by leveraging a bound by\nHayashi on the error exponent of the cryptographic task of privacy\namplification [CMP 333, 335 (2015)]. This bound is then related to the coding\nproblem via tight entropic uncertainty relations and Gallager's method of\nconstructing capacity-achieving parity-check codes for arbitrary channels.\nAlong the way, I find a lower bound on the error exponent of the task of\ncompression of classical information relative to quantum side information that\nmatches the sphere-packing upper bound of Cheng et al. [IEEE TIT 67, 902\n(2021)]. In turn, the polynomial prefactors to the sphere-packing bound found\nby Cheng et al. may be translated to the privacy amplification problem,\nsharpening a recent result by Li, Yao, and Hayashi [IEEE TIT 69, 1680 (2023)],\nat least for linear randomness extractors.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}