{"id":"2407.03874","title":"Force-Matching Based Polarizable and Non-Polarizable Force Fields for\n  Perovskite and Non-Perovskite Phases of CsPbI$_3$","authors":"C. Vona (1), M. Dankl (1), A. Boziki (1), M. P. Bircher (1) and U.\n  Rothlisberger ((1) Laboratory of Computational Chemistry and Biochemistry,\n  Ecole Polytechnique F\\`ed\\`erale deLausanne (EPFL), CH-1015 Lausanne,\n  Switzerland)","authorsParsed":[["Vona","C.",""],["Dankl","M.",""],["Boziki","A.",""],["Bircher","M. P.",""],["Rothlisberger","U.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 12:13:09 GMT"}],"updateDate":"2024-07-08","timestamp":1720095189000,"abstract":"  Lead halide perovskites have emerged as highly efficient solar cell\nmaterials. However, to date, the most promising members of this class are\npolymorphs, in which a wide-band gap $\\delta$ phase competes with the\nphotoactive perovskite $\\alpha$ form, and the intrinsic physical interactions\nthat stabilize one phase over the other are currently not well understood.\nClassical molecular dynamics simulations based on suitably parameterized force\nfields (FF) enable computational studies over broad temperature (and pressure)\nranges and can help to identify the underlying factors that govern relative\nphase stability at the atomic level. In this article, we present a polarizable\n(pol) as well as a non-polarizable (npol) FF for the all-inorganic lead halide\nmaterial CsPbI$_3$ as a prototype system exhibiting a $\\delta$/$\\alpha$\npolymorphism. Both npol and pol FFs have been determined using a force-matching\napproach based on reference data from first-principles molecular dynamics\nsimulations over a wide range of temperatures. While both FFs are able to\ndescribe the perovskite as well as the non-perovskite phase, finer structural\ndetails as well as the relative phase stability are better reproduced with the\npolarizable version. A comparison of these ab initio-derived interatomic\npotentials allows direct insights into the physical origin of the interactions\nthat govern the interplay between the two competing phases. It turns out that\nexplicit polarization is the essential factor that stabilizes the strongly\nanisotropic $\\delta$ phase over the high symmetry perovskite $\\alpha$ phase at\nlower temperatures. This fundamental difference between $\\alpha$ and $\\delta$\nphase appears universal and might thus also hold for other perovskite compounds\nwith $\\delta$/$\\alpha$ polymorphism and thus provide rational guidance for\nsynthetic efforts to stabilize the photoactive perovskite phase at room\ntemperature.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}