{"id":"2407.21022","title":"A Comprehensive Survey on Retrieval Methods in Recommender Systems","authors":"Junjie Huang, Jizheng Chen, Jianghao Lin, Jiarui Qin, Ziming Feng,\n  Weinan Zhang, Yong Yu","authorsParsed":[["Huang","Junjie",""],["Chen","Jizheng",""],["Lin","Jianghao",""],["Qin","Jiarui",""],["Feng","Ziming",""],["Zhang","Weinan",""],["Yu","Yong",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 07:09:59 GMT"}],"updateDate":"2024-08-01","timestamp":1720681799000,"abstract":"  In an era dominated by information overload, effective recommender systems\nare essential for managing the deluge of data across digital platforms.\nMulti-stage cascade ranking systems are widely used in the industry, with\nretrieval and ranking being two typical stages. Retrieval methods sift through\nvast candidates to filter out irrelevant items, while ranking methods\nprioritize these candidates to present the most relevant items to users. Unlike\nstudies focusing on the ranking stage, this survey explores the critical yet\noften overlooked retrieval stage of recommender systems. To achieve precise and\nefficient personalized retrieval, we summarize existing work in three key\nareas: improving similarity computation between user and item, enhancing\nindexing mechanisms for efficient retrieval, and optimizing training methods of\nretrieval. We also provide a comprehensive set of benchmarking experiments on\nthree public datasets. Furthermore, we highlight current industrial\napplications through a case study on retrieval practices at a specific company,\ncovering the entire retrieval process and online serving, along with practical\nimplications and challenges. By detailing the retrieval stage, which is\nfundamental for effective recommendation, this survey aims to bridge the\nexisting knowledge gap and serve as a cornerstone for researchers interested in\noptimizing this critical component of cascade recommender systems.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}