{"id":"2407.10262","title":"Warm inflation in a Universe with a Weylian boundary","authors":"Teodora M. Matei, Tiberiu Harko","authorsParsed":[["Matei","Teodora M.",""],["Harko","Tiberiu",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 15:59:19 GMT"}],"updateDate":"2024-07-16","timestamp":1720972759000,"abstract":"  We investigate the influence of boundary terms in the warm inflationary\nscenario, by considering that in the Einstein-Hilbert action the boundary can\nbe described in terms of a Weyl-type geometry. The gravitational action, as\nwell as the field equations, are thus extended to include new geometrical\nterms, coming from the non-metric nature of the boundary, and depending on the\nWeyl vector, and its covariant derivatives. We investigate the effects of these\nnew boundary terms by considering the warm inflationary scenario of the early\nevolution of the Universe, in the presence of a scalar field. We obtain the\ngeneralized Friedmann equations in the Universe with a Weylian boundary by\nconsidering the Friedmann-Lemaitre-Robertson-Walker metric. We consider the\nsimultaneous decay of the scalar field, and of the creation of radiation, by\nappropriately splitting the general conservation equation through the\nintroduction of the dissipation coefficient, which can depend on both the\nscalar field, and the Weyl vector. We consider three distinct warm inflationary\nmodels, in which the dissipation coefficients are chosen as different functions\nof the scalar field and of the Weyl vector. The numerical solutions of the\ncosmological evolution equations show that the radiation is created during the\nvery early phases of expansion, and, after the radiation reaches its maximum\nvalue, the transition from an accelerating inflationary phase to a decelerating\none takes place. Moreover, it turns out that the the Weyl vector, describing\nthe boundary effects on the cosmological evolution, plays a significant role\nduring the process of radiation creation.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}