{"id":"2407.00268","title":"Exploring the Core-galaxy Connection","authors":"Isabele Souza Vit\\'orio, Michael Buehlmann, Eve Kovacs, Patricia\n  Larsen, Nicholas Frontiere, Katrin Heitmann","authorsParsed":[["Vitório","Isabele Souza",""],["Buehlmann","Michael",""],["Kovacs","Eve",""],["Larsen","Patricia",""],["Frontiere","Nicholas",""],["Heitmann","Katrin",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 00:51:47 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 20:40:16 GMT"}],"updateDate":"2024-07-08","timestamp":1719622307000,"abstract":"  Halo core tracking is a novel concept designed to efficiently follow halo\nsubstructure in large simulations. We have recently developed this concept in\ngravity-only simulations to investigate the galaxy-halo connection in the\ncontext of empirical and semi-analytic models. Here, we incorporate information\nfrom hydrodynamics simulations, with an emphasis on establishing a connection\nbetween cores and galaxies. We compare cores across gravity-only, adiabatic\nhydrodynamics, and subgrid hydrodynamics simulations with the same initial\nphases. We demonstrate that cores are stable entities whose halo-centric radial\nprofiles match across the simulations. We further develop a methodology that\nuses merging and infall mass cuts to group cores in the hydrodynamics\nsimulation, creating on average, a one-to-one match to corresponding galaxies.\nWe apply this methodology to cores from the gravity-only simulation, thus\ncreating a proxy for galaxies which approximate the populations from the\nhydrodynamics simulation. Our results pave the way to incorporate inputs from\nsmaller-scale hydrodynamics simulations directly into large-scale gravity-only\nruns in a principled manner.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zxUJq0T1xHumz5sY5xLcos2cnF2kj2mXbvtQO6XsHrg","pdfSize":"3132581","objectId":"0x43c0050a7ae32743724bf655faa72c04ecefe57fef4aeb109524ae02df29aed0","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
