{"id":"2407.15776","title":"In Search of Quantum Advantage: Estimating the Number of Shots in\n  Quantum Kernel Methods","authors":"Artur Miroszewski, Marco Fellous Asiani, Jakub Mielczarek, Bertrand Le\n  Saux, Jakub Nalepa","authorsParsed":[["Miroszewski","Artur",""],["Asiani","Marco Fellous",""],["Mielczarek","Jakub",""],["Saux","Bertrand Le",""],["Nalepa","Jakub",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 16:29:35 GMT"}],"updateDate":"2024-07-23","timestamp":1721665775000,"abstract":"  Quantum Machine Learning (QML) has gathered significant attention through\napproaches like Quantum Kernel Machines. While these methods hold considerable\npromise, their quantum nature presents inherent challenges. One major challenge\nis the limited resolution of estimated kernel values caused by the finite\nnumber of circuit runs performed on a quantum device. In this study, we propose\na comprehensive system of rules and heuristics for estimating the required\nnumber of circuit runs in quantum kernel methods. We introduce two critical\neffects that necessitate an increased measurement precision through additional\ncircuit runs: the spread effect and the concentration effect. The effects are\nanalyzed in the context of fidelity and projected quantum kernels. To address\nthese phenomena, we develop an approach for estimating desired precision of\nkernel values, which, in turn, is translated into the number of circuit runs.\nOur methodology is validated through extensive numerical simulations, focusing\non the problem of exponential value concentration. We stress that quantum\nkernel methods should not only be considered from the machine learning\nperformance perspective, but also from the context of the resource consumption.\nThe results provide insights into the possible benefits of quantum kernel\nmethods, offering a guidance for their application in quantum machine learning\ntasks.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YX-tWozaaRO2s0snm9Mq_LDnUaGMoZq609vABSNceeQ","pdfSize":"1864332"}
