{"id":"2407.01134","title":"Polarization spontaneous and piezo: fundamentals and their\n  implementation in ab initio calculations","authors":"Pawel Strak, Pawel Kempisty, Konrad Sakowski, Jacek Piechota, Izabella\n  Grzegory, Eva Monroy, Agata Kaminska, Stanislaw Krukowski","authorsParsed":[["Strak","Pawel",""],["Kempisty","Pawel",""],["Sakowski","Konrad",""],["Piechota","Jacek",""],["Grzegory","Izabella",""],["Monroy","Eva",""],["Kaminska","Agata",""],["Krukowski","Stanislaw",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 09:58:10 GMT"}],"updateDate":"2024-07-02","timestamp":1719827890000,"abstract":"  Fundamental properties of spontaneous and piezo polarization are reformulated\nand critically reviewed. It was demonstrated that Landau definition of\npolarization as a dipole density could be used to the infinite systems. The\ndifference between the bulk polarization and surface polarity are distinguished\nthus creating clear identification of both components. The local model of\nspontaneous polarization was created and used to calculate spontaneous\npolarization as the electric dipole density. It was shown that the proposed\nlocal model correctly predicts c-axis spontaneous polarization values of the\nnitride wurtzite semiconductors. It was also shown that the proposed model\npredicts zero polarization in the plane perpendicular to the c-axis, in\naccordance with symmetry requirements. In addition, the model results are in\naccordance with polarization equal to zero for zinc blende lattice. These data\nconfirm the basic correctness of the proposed model. The spontaneous\npolarization values obtained for all wurtzite III nitrides (BN, AlN, GaN and\nInN) are in basic agreement with the earlier calculations using Berry phase and\nslab models of Bernardini et al. {Bernardini et al. Phys Rev B 56 (2001) R10024\n& 63 (2001) 193201} but not with Dreyer et al. {Dreyer et al. Phys. Rev X 6\n(2016) 021038}. Wurtzite nitride superlattices ab initio calculations were\nperformed to derive polarization-induced fields in the coherently strained\nlattices showing good agreement with the polarization values. The strained\nsuperlattice data were used to determine the piezoelectric parameters of\nwurtzite nitrides obtaining the values that were in basic agreement with the\nearlier data. Zinc blende superlattices were also modeled using ab initio\ncalculations showing results that are in agreement with the absence of\npolarization of all nitrides in zinc blende symmetry.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Other Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}