{"id":"2407.02383","title":"Long-range crossed Andreev reflection in topological insulator nanowires\n  proximitized by Nb","authors":"Junya Feng, Henry F. Legg, Mahasweta Bagchi, Daniel Loss, Jelena\n  Klinovaja, Yoichi Ando","authorsParsed":[["Feng","Junya",""],["Legg","Henry F.",""],["Bagchi","Mahasweta",""],["Loss","Daniel",""],["Klinovaja","Jelena",""],["Ando","Yoichi",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 15:55:00 GMT"}],"updateDate":"2024-07-03","timestamp":1719935700000,"abstract":"  Crossed Andreev reflection (CAR) is a nonlocal transport phenomenon that\ncreates/detects Cooper-pair correlations between distant places. It is also the\nbasis of Cooper-pair splitting to generate remote entanglement. Although CAR\nhas been extensively studied in semiconductors proximity-coupled to a\nsuperconductor, it has been very difficult to observe it in a topological\ninsulator (TI). Here we report the first observation of CAR in a proximitized\nTI nanowire (TINW). We performed local and nonlocal conductance spectroscopy on\nmesoscopic TINW devices in which superconducting (Nb) and metallic (Pt/Au)\ncontacts are made on a bulk-insulating TINW. The local conductance detected a\nhard gap, accompanied by the appearance of Andreev bound states that can reach\nzero-bias, while a negative nonlocal conductance was occasionally observed upon\nsweeping the chemical potential, giving evidence for CAR. Surprisingly, the CAR\nsignal was detected even over 1.5 $\\mu$m, which implies that pair correlations\nextend over a length scale much longer than the expected superconducting\ncoherence length of either Nb or the proximitised TINW. Such a long-range CAR\neffect is possibly due to an intricate role of disorder in proximitized\nnanowires. Also, our 0.9-$\\mu$m device presented a decent Cooper-pair splitting\nefficiency of up to 0.5.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}