{"id":"2407.13246","title":"STS MICCAI 2023 Challenge: Grand challenge on 2D and 3D semi-supervised\n  tooth segmentation","authors":"Yaqi Wang, Yifan Zhang, Xiaodiao Chen, Shuai Wang, Dahong Qian, Fan\n  Ye, Feng Xu, Hongyuan Zhang, Qianni Zhang, Chengyu Wu, Yunxiang Li, Weiwei\n  Cui, Shan Luo, Chengkai Wang, Tianhao Li, Yi Liu, Xiang Feng, Huiyu Zhou,\n  Dongyun Liu, Qixuan Wang, Zhouhao Lin, Wei Song, Yuanlin Li, Bing Wang,\n  Chunshi Wang, Qiupu Chen, Mingqian Li","authorsParsed":[["Wang","Yaqi",""],["Zhang","Yifan",""],["Chen","Xiaodiao",""],["Wang","Shuai",""],["Qian","Dahong",""],["Ye","Fan",""],["Xu","Feng",""],["Zhang","Hongyuan",""],["Zhang","Qianni",""],["Wu","Chengyu",""],["Li","Yunxiang",""],["Cui","Weiwei",""],["Luo","Shan",""],["Wang","Chengkai",""],["Li","Tianhao",""],["Liu","Yi",""],["Feng","Xiang",""],["Zhou","Huiyu",""],["Liu","Dongyun",""],["Wang","Qixuan",""],["Lin","Zhouhao",""],["Song","Wei",""],["Li","Yuanlin",""],["Wang","Bing",""],["Wang","Chunshi",""],["Chen","Qiupu",""],["Li","Mingqian",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:00:08 GMT"}],"updateDate":"2024-07-19","timestamp":1721289608000,"abstract":"  Computer-aided design (CAD) tools are increasingly popular in modern dental\npractice, particularly for treatment planning or comprehensive prognosis\nevaluation. In particular, the 2D panoramic X-ray image efficiently detects\ninvisible caries, impacted teeth and supernumerary teeth in children, while the\n3D dental cone beam computed tomography (CBCT) is widely used in orthodontics\nand endodontics due to its low radiation dose. However, there is no open-access\n2D public dataset for children's teeth and no open 3D dental CBCT dataset,\nwhich limits the development of automatic algorithms for segmenting teeth and\nanalyzing diseases. The Semi-supervised Teeth Segmentation (STS) Challenge, a\npioneering event in tooth segmentation, was held as a part of the MICCAI 2023\nToothFairy Workshop on the Alibaba Tianchi platform. This challenge aims to\ninvestigate effective semi-supervised tooth segmentation algorithms to advance\nthe field of dentistry. In this challenge, we provide two modalities including\nthe 2D panoramic X-ray images and the 3D CBCT tooth volumes. In Task 1, the\ngoal was to segment tooth regions in panoramic X-ray images of both adult and\npediatric teeth. Task 2 involved segmenting tooth sections using CBCT volumes.\nLimited labelled images with mostly unlabelled ones were provided in this\nchallenge prompt using semi-supervised algorithms for training. In the\npreliminary round, the challenge received registration and result submission by\n434 teams, with 64 advancing to the final round. This paper summarizes the\ndiverse methods employed by the top-ranking teams in the STS MICCAI 2023\nChallenge.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}