{"id":"2407.10423","title":"Assessing the Impact of Network Quality-of-Service on Metaverse Virtual\n  Reality User Experience","authors":"Rahul Dev Tripathi, Minzhao Lyu, Vijay Sivaraman","authorsParsed":[["Tripathi","Rahul Dev",""],["Lyu","Minzhao",""],["Sivaraman","Vijay",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 03:57:01 GMT"}],"updateDate":"2024-07-16","timestamp":1721015821000,"abstract":"  Metaverse virtual reality (VR) applications enable users to socialise, work,\nentertain, and study online with immersive experiences beyond the classic\nPC-based interactions. While the 360-degree immersion enables users to be fully\nengaged in a virtual scenario, suboptimal Quality-of-Experience (QoE) like\npoorly displayed 3D graphics, disruptive loading time, or motion lagging caused\nby degraded network Quality-of-Service (QoS) can be perceived by users much\nworse (such as dizziness) than a monitor visualisation. This paper empirically\nmeasures user QoE of metaverse VR caused by network QoS. Specifically, by\nfocusing on both public social hubs and private user-created events in three\npopular metaverse VR applications (Rec Room, VRChat and MultiverseVR), we first\nidentify three metrics, including environment freeze level, peripheral content\nloading time, and control response time, that describe metaverse user\nexperience. By tuning three network QoS parameters (bandwidth, latency, and\npacket loss), we benchmark each QoE metric's level from excellent to\nunplayable. Key insights are revealed, such as freeze of metaverse virtual\nenvironment is resilient to latency but sensitive to packet loss, and private\nuser-created events demand better network conditions than public social hubs,\nproviding a reference for ISPs to optimise their network QoS for superlative\nmetaverse user experience.\n","subjects":["Computing Research Repository/Performance","Computing Research Repository/Emerging Technologies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}