{"id":"2407.02616","title":"Deep Learning Based Apparent Diffusion Coefficient Map Generation from\n  Multi-parametric MR Images for Patients with Diffuse Gliomas","authors":"Zach Eidex, Mojtaba Safari, Jacob Wynne, Richard L.J. Qiu, Tonghe\n  Wang, David Viar Hernandez, Hui-Kuo Shu, Hui Mao, Xiaofeng Yang","authorsParsed":[["Eidex","Zach",""],["Safari","Mojtaba",""],["Wynne","Jacob",""],["Qiu","Richard L. J.",""],["Wang","Tonghe",""],["Hernandez","David Viar",""],["Shu","Hui-Kuo",""],["Mao","Hui",""],["Yang","Xiaofeng",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 19:08:40 GMT"},{"version":"v2","created":"Thu, 4 Jul 2024 13:36:16 GMT"}],"updateDate":"2024-07-08","timestamp":1719947320000,"abstract":"  Purpose: Apparent diffusion coefficient (ADC) maps derived from diffusion\nweighted (DWI) MRI provides functional measurements about the water molecules\nin tissues. However, DWI is time consuming and very susceptible to image\nartifacts, leading to inaccurate ADC measurements. This study aims to develop a\ndeep learning framework to synthesize ADC maps from multi-parametric MR images.\nMethods: We proposed the multiparametric residual vision transformer model\n(MPR-ViT) that leverages the long-range context of ViT layers along with the\nprecision of convolutional operators. Residual blocks throughout the network\nsignificantly increasing the representational power of the model. The MPR-ViT\nmodel was applied to T1w and T2- fluid attenuated inversion recovery images of\n501 glioma cases from a publicly available dataset including preprocessed ADC\nmaps. Selected patients were divided into training (N=400), validation (N=50)\nand test (N=51) sets, respectively. Using the preprocessed ADC maps as ground\ntruth, model performance was evaluated and compared against the Vision\nConvolutional Transformer (VCT) and residual vision transformer (ResViT)\nmodels. Results: The results are as follows using T1w + T2-FLAIR MRI as inputs:\nMPR-ViT - PSNR: 31.0 +/- 2.1, MSE: 0.009 +/- 0.0005, SSIM: 0.950 +/- 0.015. In\naddition, ablation studies showed the relative impact on performance of each\ninput sequence. Both qualitative and quantitative results indicate that the\nproposed MR- ViT model performs favorably against the ground truth data.\nConclusion: We show that high-quality ADC maps can be synthesized from\nstructural MRI using a MPR- VCT model. Our predicted images show better\nconformality to the ground truth volume than ResViT and VCT predictions. These\nhigh-quality synthetic ADC maps would be particularly useful for disease\ndiagnosis and intervention, especially when ADC maps have artifacts or are\nunavailable.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}