{"id":"2407.18632","title":"Robust VAEs via Generating Process of Noise Augmented Data","authors":"Hiroo Irobe, Wataru Aoki, Kimihiro Yamazaki, Yuhui Zhang, Takumi\n  Nakagawa, Hiroki Waida, Yuichiro Wada, and Takafumi Kanamori","authorsParsed":[["Irobe","Hiroo",""],["Aoki","Wataru",""],["Yamazaki","Kimihiro",""],["Zhang","Yuhui",""],["Nakagawa","Takumi",""],["Waida","Hiroki",""],["Wada","Yuichiro",""],["Kanamori","Takafumi",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 09:55:34 GMT"}],"updateDate":"2024-07-29","timestamp":1721987734000,"abstract":"  Advancing defensive mechanisms against adversarial attacks in generative\nmodels is a critical research topic in machine learning. Our study focuses on a\nspecific type of generative models - Variational Auto-Encoders (VAEs). Contrary\nto common beliefs and existing literature which suggest that noise injection\ntowards training data can make models more robust, our preliminary experiments\nrevealed that naive usage of noise augmentation technique did not substantially\nimprove VAE robustness. In fact, it even degraded the quality of learned\nrepresentations, making VAEs more susceptible to adversarial perturbations.\nThis paper introduces a novel framework that enhances robustness by\nregularizing the latent space divergence between original and noise-augmented\ndata. Through incorporating a paired probabilistic prior into the standard\nvariational lower bound, our method significantly boosts defense against\nadversarial attacks. Our empirical evaluations demonstrate that this approach,\ntermed Robust Augmented Variational Auto-ENcoder (RAVEN), yields superior\nperformance in resisting adversarial inputs on widely-recognized benchmark\ndatasets.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kQEugskbxDTQzU_XHvcr9BZrLI8r-5YLeXfS3RThCXo","pdfSize":"1020769","objectId":"0x411a1279d5eee03d81cedf40109afecd785ba3db869d63ae94c7123ff66b4d72","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
