{"id":"2407.00033","title":"Uncovering cognitive taskonomy through transfer learning in masked\n  autoencoder-based fMRI reconstruction","authors":"Youzhi Qu, Junfeng Xia, Xinyao Jian, Wendu Li, Kaining Peng, Zhichao\n  Liang, Haiyan Wu, Quanying Liu","authorsParsed":[["Qu","Youzhi",""],["Xia","Junfeng",""],["Jian","Xinyao",""],["Li","Wendu",""],["Peng","Kaining",""],["Liang","Zhichao",""],["Wu","Haiyan",""],["Liu","Quanying",""]],"versions":[{"version":"v1","created":"Fri, 24 May 2024 09:29:16 GMT"}],"updateDate":"2024-07-02","timestamp":1716542956000,"abstract":"  Data reconstruction is a widely used pre-training task to learn the\ngeneralized features for many downstream tasks. Although reconstruction tasks\nhave been applied to neural signal completion and denoising, neural signal\nreconstruction is less studied. Here, we employ the masked autoencoder (MAE)\nmodel to reconstruct functional magnetic resonance imaging (fMRI) data, and\nutilize a transfer learning framework to obtain the cognitive taskonomy, a\nmatrix to quantify the similarity between cognitive tasks. Our experimental\nresults demonstrate that the MAE model effectively captures the temporal\ndynamics patterns and interactions within the brain regions, enabling robust\ncross-subject fMRI signal reconstruction. The cognitive taskonomy derived from\nthe transfer learning framework reveals the relationships among cognitive\ntasks, highlighting subtask correlations within motor tasks and similarities\nbetween emotion, social, and gambling tasks. Our study suggests that the fMRI\nreconstruction with MAE model can uncover the latent representation and the\nobtained taskonomy offers guidance for selecting source tasks in neural\ndecoding tasks for improving the decoding performance on target tasks.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"j0eoN8tUZQYUNIhBjZvYdQELY5e-QqJfUFfg9yex_oc","pdfSize":"5410457"}
