{"id":"2407.08170","title":"Peculiarities of measured dependencies of strength of spin-orbit\n  interaction and anisotropy field on current density in FeCoB nanomagnet","authors":"Vadym Zayets","authorsParsed":[["Zayets","Vadym",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 04:20:56 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 01:44:23 GMT"}],"updateDate":"2024-07-25","timestamp":1720671656000,"abstract":"  We present a novel method for measuring the modulation of magnetic anisotropy\nand the strength of spin-orbit interaction by an electrical current in\nnanomagnets. Our systematic study explores the current dependencies of these\nproperties across a variety of nanomagnets with different structures,\ncompositions, and sizes, providing unprecedented insights into the complex\nphysical origins of this effect. We identified two distinct contributions to\nthe observed current modulation: one proportional to the current and the other\nto the square of the current. The squared-current contribution, originating\nfrom the Spin Hall effect, uniquely accumulates strength with an increasing\nnumber of interfaces, resulting in exceptionally large current modulation of\nmagnetic anisotropy and spin-orbit interaction in multi-layer nanomagnets.\nConversely, the linear-current contribution stems from the Ordinary and\nAnomalous Hall effects and exhibits opposite polarity at different interfaces,\nmaking it significant only in asymmetrical single-layer nanomagnets. The\nsquared-current contribution induces substantial anisotropy field changes, up\nto 30-50$\\%$ at typical MRAM recording currents, leading to thermally-activated\nmagnetization reversal and data recording. The linear-current contribution,\nwhile smaller, is effective for parametric magnetization reversal, providing\nsufficient modulation for efficient data recording through resonance\nmechanisms. This finding highlights the complex nature of spin accumulation and\nspin dynamics at the nanoscale, presenting an opportunity for further\noptimization of data recording in MRAM technology.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"e7M5DmDCUYoOz3BCqamfwJZjWvsC0rf2B8ByNgOh3ak","pdfSize":"247409"}
