{"id":"2407.19414","title":"Appformer: A Novel Framework for Mobile App Usage Prediction Leveraging\n  Progressive Multi-Modal Data Fusion and Feature Extraction","authors":"Chuike Sun, Junzhou Chen, Yue Zhao, Hao Han, Ruihai Jing, Guang Tan,\n  and Di Wu","authorsParsed":[["Sun","Chuike",""],["Chen","Junzhou",""],["Zhao","Yue",""],["Han","Hao",""],["Jing","Ruihai",""],["Tan","Guang",""],["Wu","Di",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 06:41:31 GMT"}],"updateDate":"2024-07-30","timestamp":1722148891000,"abstract":"  This article presents Appformer, a novel mobile application prediction\nframework inspired by the efficiency of Transformer-like architectures in\nprocessing sequential data through self-attention mechanisms. Combining a\nMulti-Modal Data Progressive Fusion Module with a sophisticated Feature\nExtraction Module, Appformer leverages the synergies of multi-modal data fusion\nand data mining techniques while maintaining user privacy. The framework\nemploys Points of Interest (POIs) associated with base stations, optimizing\nthem through comprehensive comparative experiments to identify the most\neffective clustering method. These refined inputs are seamlessly integrated\ninto the initial phases of cross-modal data fusion, where temporal units are\nencoded via word embeddings and subsequently merged in later stages. The\nFeature Extraction Module, employing Transformer-like architectures specialized\nfor time series analysis, adeptly distils comprehensive features. It\nmeticulously fine-tunes the outputs from the fusion module, facilitating the\nextraction of high-calibre, multi-modal features, thus guaranteeing a robust\nand efficient extraction process. Extensive experimental validation confirms\nAppformer's effectiveness, attaining state-of-the-art (SOTA) metrics in mobile\napp usage prediction, thereby signifying a notable progression in this field.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Uyie02J2psZgpnm8ZciogC9gIRMh__gnZnsqano4dZo","pdfSize":"1785951"}
