{"id":"2407.21691","title":"Explainable Artificial Intelligence for Quantifying Interfering and\n  High-Risk Behaviors in Autism Spectrum Disorder in a Real-World Classroom\n  Environment Using Privacy-Preserving Video Analysis","authors":"Barun Das, Conor Anderson, Tania Villavicencio, Johanna Lantz, Jenny\n  Foster, Theresa Hamlin, Ali Bahrami Rad, Gari D. Clifford, Hyeokhyen Kwon","authorsParsed":[["Das","Barun",""],["Anderson","Conor",""],["Villavicencio","Tania",""],["Lantz","Johanna",""],["Foster","Jenny",""],["Hamlin","Theresa",""],["Rad","Ali Bahrami",""],["Clifford","Gari D.",""],["Kwon","Hyeokhyen",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:37:52 GMT"}],"updateDate":"2024-08-01","timestamp":1722440272000,"abstract":"  Rapid identification and accurate documentation of interfering and high-risk\nbehaviors in ASD, such as aggression, self-injury, disruption, and restricted\nrepetitive behaviors, are important in daily classroom environments for\ntracking intervention effectiveness and allocating appropriate resources to\nmanage care needs. However, having a staff dedicated solely to observing is\ncostly and uncommon in most educational settings. Recently, multiple research\nstudies have explored developing automated, continuous, and objective tools\nusing machine learning models to quantify behaviors in ASD. However, the\nmajority of the work was conducted under a controlled environment and has not\nbeen validated for real-world conditions. In this work, we demonstrate that the\nlatest advances in video-based group activity recognition techniques can\nquantify behaviors in ASD in real-world activities in classroom environments\nwhile preserving privacy. Our explainable model could detect the episode of\nproblem behaviors with a 77% F1-score and capture distinctive behavior features\nin different types of behaviors in ASD. To the best of our knowledge, this is\nthe first work that shows the promise of objectively quantifying behaviors in\nASD in a real-world environment, which is an important step toward the\ndevelopment of a practical tool that can ease the burden of data collection for\nclassroom staff.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"USN6aJfWFpLKrDGs6a6GhPXXdLOVvpegv9PqmWtCFB0","pdfSize":"3974045"}
