{"id":"2407.00082","title":"Adapting Job Recommendations to User Preference Drift with\n  Behavioral-Semantic Fusion Learning","authors":"Xiao Han, Chen Zhu, Xiao Hu, Chuan Qin, Xiangyu Zhao, Hengshu Zhu","authorsParsed":[["Han","Xiao",""],["Zhu","Chen",""],["Hu","Xiao",""],["Qin","Chuan",""],["Zhao","Xiangyu",""],["Zhu","Hengshu",""]],"versions":[{"version":"v1","created":"Mon, 24 Jun 2024 14:38:04 GMT"}],"updateDate":"2024-07-02","timestamp":1719239884000,"abstract":"  Job recommender systems are crucial for aligning job opportunities with\njob-seekers in online job-seeking. However, users tend to adjust their job\npreferences to secure employment opportunities continually, which limits the\nperformance of job recommendations. The inherent frequency of preference drift\nposes a challenge to promptly and precisely capture user preferences. To\naddress this issue, we propose a novel session-based framework, BISTRO, to\ntimely model user preference through fusion learning of semantic and behavioral\ninformation. Specifically, BISTRO is composed of three stages: 1)\ncoarse-grained semantic clustering, 2) fine-grained job preference extraction,\nand 3) personalized top-$k$ job recommendation. Initially, BISTRO segments the\nuser interaction sequence into sessions and leverages session-based semantic\nclustering to achieve broad identification of person-job matching.\nSubsequently, we design a hypergraph wavelet learning method to capture the\nnuanced job preference drift. To mitigate the effect of noise in interactions\ncaused by frequent preference drift, we innovatively propose an adaptive\nwavelet filtering technique to remove noisy interaction. Finally, a recurrent\nneural network is utilized to analyze session-based interaction for inferring\npersonalized preferences. Extensive experiments on three real-world offline\nrecruitment datasets demonstrate the significant performances of our framework.\nSignificantly, BISTRO also excels in online experiments, affirming its\neffectiveness in live recruitment settings. This dual success underscores the\nrobustness and adaptability of BISTRO. The source code is available at\nhttps://github.com/Applied-Machine-Learning-Lab/BISTRO.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"y8BOlurc5nalmc6zF2fJg9wUv5780EcVahK5smbW1d8","pdfSize":"11413456"}
