{"id":"2407.18509","title":"Shadow, ISCO, Quasinormal modes, Hawking spectrum, Weak Gravitational\n  lensing, and parameter estimation of a Schwarzschild Black Hole Surrounded by\n  a Dehnen Type Dark Matter Halo","authors":"Sohan Kumar Jha","authorsParsed":[["Jha","Sohan Kumar",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 04:33:49 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 06:26:04 GMT"}],"updateDate":"2024-08-13","timestamp":1721968429000,"abstract":"  We consider \\s black hole (BH) embedded in a Dehnen-$(1,4,0)$ type dark\nmatter halo (DDM) with two additional parameters - core radius $r_s$ and core\ndensity $\\rs$ apart from mass $M$. We analyze the event horizon, photon orbits,\nand ISCO around DDM BHs and emphasize the impact of DDM parameters on them. Our\nstudy reveals that the presence of dark matter (DM) favourably impacts the\nradii of photon orbits, the innermost stable circular orbit (ISCO), and the\nevent horizon. We find the expressions for specific energy and angular momentum\nfor massive particles in time-like geodesics around DDM BH and investigate\ntheir dependence on DDM parameters. We display BH shadows for various values of\ncore density and radius that reveal larger shadows cast by a \\s BH surrounded\nby DDM (SDDM) than a \\s BH in vacuum (SV). We then move on to study quasinormal\nmodes (QNMs) with the help of the $6th$ order WKB method, the greybody factor\nusing the semi-analytic bounds method, and the Hawking spectrum for scalar and\nelectromagnetic perturbations. Core density and radius are found to have a\nsignificant impact on QNMs. Since QNMs for scalar and electromagnetic\nperturbations differ significantly, we can differentiate the two based on QNM\nobservation. The greybody factor increases with core density and radius,\nwhereas, the power emitted as Hawking radiation is adversely impacted by the\npresence of DM. We then study the weak gravitational lensing using the\nGauss-Bonnet theorem and obtain the deflection angle with higher-order\ncorrection terms. Here, we see the deflection angle gets enhanced due to DM.\nFinally, we use bounds on the deviation from \\s, $\\delta$, reported by EHT for\n$M87^*$, Keck, and VLTI observatories for $Sgr A^*$ to gauge the viability of\nour model. Our model is found to be concordant with observations. This leads to\nthe possibility of our galactic center being surrounded by DDM.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}