{"id":"2407.19614","title":"Multi-GPU RI-HF Energies and Analytic Gradients $-$ Towards High\n  Throughput Ab Initio Molecular Dynamics","authors":"Ryan Stocks, Elise Palethorpe and Giuseppe M. J. Barca","authorsParsed":[["Stocks","Ryan",""],["Palethorpe","Elise",""],["Barca","Giuseppe M. J.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 00:14:10 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 05:27:59 GMT"}],"updateDate":"2024-07-31","timestamp":1722212050000,"abstract":"  This article presents an optimized algorithm and implementation for\ncalculating resolution-of-the-identity Hartree-Fock (RI-HF) energies and\nanalytic gradients using multiple Graphics Processing Units (GPUs). The\nalgorithm is especially designed for high throughput \\emph{ab initio} molecular\ndynamics simulations of small and medium size molecules (10-100 atoms). Key\ninnovations of this work include the exploitation of multi-GPU parallelism and\na workload balancing scheme that efficiently distributes computational tasks\namong GPUs. Our implementation also employs techniques for symmetry\nutilization, integral screening and leveraging sparsity to optimize memory\nusage and computational efficiency. Computational results show that the\nimplementation achieves significant performance improvements, including over\n$3\\times$ speedups in single GPU AIMD throughput compared to previous\nGPU-accelerated RI-HF and traditional HF methods. Furthermore, utilizing\nmultiple GPUs can provide super-linear speedup when the additional aggregate\nGPU memory allows for the storage of decompressed three-center integrals.\nAdditionally, we report strong scaling efficiencies for systems up to 1000\nbasis functions and demonstrate practical applications through extensive\nperformance benchmarks on up to quadruple-$\\zeta$ primary basis sets, achieving\nfloating-point performance of up to 47\\% of the theoretical peak on a\n4$\\times$A100 GPU node.\n","subjects":["Physics/Computational Physics","Condensed Matter/Materials Science","Physics/Chemical Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"M5VKziilTZfx1CyXYR880Pb7_svNEY4BKCV33yO2PuA","pdfSize":"1780584"}
