{"id":"2407.18294","title":"The First Billion Years in Seconds: An Effective Model for the 21-cm\n  Signal with Population III Stars","authors":"Hector Afonso G. Cruz, Julian B. Munoz, Nashwan Sabti, Marc\n  Kamionkowski","authorsParsed":[["Cruz","Hector Afonso G.",""],["Munoz","Julian B.",""],["Sabti","Nashwan",""],["Kamionkowski","Marc",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-29","timestamp":1721930400000,"abstract":"  Observations of the 21-cm signal are opening a window to the cosmic-dawn\nepoch, when the first stars formed. These observations are usually interpreted\nwith semi-numerical or hydrodynamical simulations, which are often\ncomputationally intensive and inflexible to changes in cosmological or\nastrophysical effects. Here, we present an effective, fully analytic model for\nthe impact of the first stars on the 21-cm signal, using the modular code\nZeus21. Zeus21 employs an analytic prescription of the star formation rate\ndensity (SFRD) to recover the fully nonlinear and nonlocal correlations of\nradiative fields that determine the 21-cm signal. We introduce the earliest\nPopulation III (Pop III) stars residing in low-mass molecular-cooling galaxies\nin Zeus21, with distinct spectra from later Pop II stars. We also\nself-consistently model feedback in the form of $H_2$-dissociating Lyman-Werner\n(LW) radiation, as well as dark matter-baryon relative velocities, both of\nwhich suppress star formation in the lowest-mass halos. LW feedback produces a\nscale-dependence on the SFRD fluctuations, due to the long mean free path of LW\nphotons. Relative velocities give rise to \"wiggles\" in the spatial distribution\nof the 21-cm signal; we present an improved calculation of the shape of these\nvelocity-induced acoustic oscillations, showing they remain a standard ruler at\ncosmic dawn. Our improved version of Zeus21 predicts the 21-cm global signal\nand power spectra in agreement with simulations at the $\\sim 10\\%$ level, yet\nis at least three orders of magnitude faster. This public code represents a\nstep towards efficient and flexible parameter inference at cosmic dawn,\nallowing us to predict the first billion years of the universe in mere seconds.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}