{"id":"2407.17178","title":"Irradiation effect and binary radio pulsars with giant companions","authors":"Shunyi Lan, Xiangcun Meng","authorsParsed":[["Lan","Shunyi",""],["Meng","Xiangcun",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 11:26:47 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 01:27:04 GMT"}],"updateDate":"2024-07-30","timestamp":1721820407000,"abstract":"  Pulsars are neutron stars that rotate rapidly. Most of the pulsars in binary\nsystems tend to spin faster than those in isolation. According to binary\nevolution theory, radio pulsars in binary systems can have various types of\ncompanion stars. However, binary radio pulsars with giant stars, helium stars,\nand black holes as companions are lacking so far. We aim to investigate the\npossible parameter space of binary radio pulsars with giant companions. We used\nthe MESA stellar evolution code to consider the effect of irradiation in binary\nevolution and evolved a series of binary models. We present the potential\nphysical properties of binary radio pulsars with giant star companions in the\nframework of the classical recycling scenario and the irradiation model. We\nfound that the parameter space of binary radio pulsars with giant companions\ncan be greatly expanded by the effect of irradiation. Moreover, when\nirradiation is strong enough, submillisecond pulsars might be accompanied by\ngiant companion stars. We also demonstrate a correlation between the timescale\nof the binary system as a low-mass X-ray binary and the irradiation efficiency.\nThe birthrate problem between millisecond pulsars and low-mass X-ray binaries\nmight not be resolved by the irradiation effect. A more detailed binary\npopulation synthesis is necessary. Our findings may offer guidance for\nobservers that wish to locate binary radio pulsars with giant companions or\nsubmillisecond pulsars.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}