{"id":"2407.11486","title":"An efficient framework based on large foundation model for cervical\n  cytopathology whole slide image screening","authors":"Jialong Huang, Gaojie Li, Shichao Kan, Jianfeng Liu, Yixiong Liang","authorsParsed":[["Huang","Jialong",""],["Li","Gaojie",""],["Kan","Shichao",""],["Liu","Jianfeng",""],["Liang","Yixiong",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 08:21:54 GMT"}],"updateDate":"2024-07-17","timestamp":1721118114000,"abstract":"  Current cervical cytopathology whole slide image (WSI) screening primarily\nrelies on detection-based approaches, which are limited in performance due to\nthe expense and time-consuming annotation process. Multiple Instance Learning\n(MIL), a weakly supervised approach that relies solely on bag-level labels, can\neffectively alleviate these challenges. Nonetheless, MIL commonly employs\nfrozen pretrained models or self-supervised learning for feature extraction,\nwhich suffers from low efficacy or inefficiency. In this paper, we propose an\nefficient framework for cervical cytopathology WSI classification using only\nWSI-level labels through unsupervised and weakly supervised learning. Given the\nsparse and dispersed nature of abnormal cells within cytopathological WSIs, we\npropose a strategy that leverages the pretrained foundation model to filter the\ntop$k$ high-risk patches. Subsequently, we suggest parameter-efficient\nfine-tuning (PEFT) of a large foundation model using contrastive learning on\nthe filtered patches to enhance its representation ability for task-specific\nsignals. By training only the added linear adapters, we enhance the learning of\npatch-level features with substantially reduced time and memory consumption.\nExperiments conducted on the CSD and FNAC 2019 datasets demonstrate that the\nproposed method enhances the performance of various MIL methods and achieves\nstate-of-the-art (SOTA) performance. The code and trained models are publicly\navailable at https://github.com/CVIU-CSU/TCT-InfoNCE.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}