{"id":"2407.15544","title":"Shell mergers in the late stages of massive star evolution: new insight\n  from 3D hydrodynamic simulations","authors":"Federico Rizzuti, Raphael Hirschi, Vishnu Varma, William David Arnett,\n  Cyril Georgy, Casey Meakin, Miroslav Moc\\'ak, Alexander St. John Murphy,\n  Thomas Rauscher","authorsParsed":[["Rizzuti","Federico",""],["Hirschi","Raphael",""],["Varma","Vishnu",""],["Arnett","William David",""],["Georgy","Cyril",""],["Meakin","Casey",""],["Mocák","Miroslav",""],["Murphy","Alexander St. John",""],["Rauscher","Thomas",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 11:09:25 GMT"}],"updateDate":"2024-07-23","timestamp":1721646565000,"abstract":"  One-dimensional (1D) stellar evolution models are widely used across various\nastrophysical fields, however they are still dominated by important\nuncertainties that deeply affect their predictive power. Among those, the\nmerging of independent convective regions is a poorly understood phenomenon\npredicted by some 1D models but whose occurrence and impact in real stars\nremain very uncertain. Being an intrinsically multi-D phenomenon, it is\nchallenging to predict the exact behaviour of shell mergers with 1D models. In\nthis work, we conduct a detailed investigation of a multiple shell merging\nevent in a 20 M$_\\odot$ star using 3D hydrodynamic simulations. Making use of\nthe active tracers for composition and the nuclear network included in the 3D\nmodel, we study the merging not only from a dynamical standpoint but also\nconsidering its nucleosynthesis and energy generation. Our simulations confirm\nthe occurrence of the merging also in 3D, but reveal significant differences\nfrom the 1D case. Specifically, we identify entrainment and the erosion of\nstable regions as the main mechanisms that drive the merging, we predict much\nfaster convective velocities compared to the mixing-length-theory velocities,\nand observe multiple burning phases within the same merged shell, with\nimportant effects for the chemical composition of the star, which presents a\nstrongly asymmetric (dipolar) distribution. We expect that these differences\nwill have important effects on the final structure of massive stars and thus\ntheir final collapse dynamics and possible supernova explosion, subsequently\naffecting the resulting nucleosynthesis and remnant.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}