{"id":"2407.08765","title":"Approximating G(t)/GI/1 queues with deep learning","authors":"Eliran Sherzer, Opher Baron, Dmitry Krass and Yehezkel Resheff","authorsParsed":[["Sherzer","Eliran",""],["Baron","Opher",""],["Krass","Dmitry",""],["Resheff","Yehezkel",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 05:25:45 GMT"}],"updateDate":"2024-07-15","timestamp":1720675545000,"abstract":"  In this paper, we apply a supervised machine-learning approach to solve a\nfundamental problem in queueing theory: estimating the transient distribution\nof the number in the system for a G(t)/GI/1. We develop a neural network\nmechanism that provides a fast and accurate predictor of these distributions\nfor moderate horizon lengths and practical settings. It is based on using a\nRecurrent Neural Network (RNN) architecture based on the first several moments\nof the time-dependant inter-arrival and the stationary service time\ndistributions; we call it the Moment-Based Recurrent Neural Network (RNN)\nmethod (MBRNN ). Our empirical study suggests MBRNN requires only the first\nfour inter-arrival and service time moments. We use simulation to generate a\nsubstantial training dataset and present a thorough performance evaluation to\nexamine the accuracy of our method using two different test sets. We show that\neven under the configuration with the worst performance errors, the mean number\nof customers over the entire timeline has an error of less than 3%. While\nsimulation modeling can achieve high accuracy, the advantage of the MBRNN over\nsimulation is runtime, while the MBRNN analyzes hundreds of systems within a\nfraction of a second. This paper focuses on a G(t)/GI/1; however, the MBRNN\napproach demonstrated here can be extended to other queueing systems, as the\ntraining data labeling is based on simulations (which can be applied to more\ncomplex systems) and the training is based on deep learning, which can capture\nvery complex time sequence tasks. In summary, the MBRNN can potentially\nrevolutionize our ability to perform transient analyses of queueing systems.\n","subjects":["Computing Research Repository/Machine Learning","Mathematics/Probability"],"license":"http://creativecommons.org/licenses/by/4.0/"}