{"id":"2407.19914","title":"Sentiment Analysis of Lithuanian Online Reviews Using Large Language\n  Models","authors":"Brigita Vileikyt\\.e and Mantas Luko\\v{s}evi\\v{c}ius and Lukas\n  Stankevi\\v{c}ius","authorsParsed":[["Vileikytė","Brigita",""],["Lukoševičius","Mantas",""],["Stankevičius","Lukas",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 11:44:21 GMT"}],"updateDate":"2024-07-30","timestamp":1722253461000,"abstract":"  Sentiment analysis is a widely researched area within Natural Language\nProcessing (NLP), attracting significant interest due to the advent of\nautomated solutions. Despite this, the task remains challenging because of the\ninherent complexity of languages and the subjective nature of sentiments. It is\neven more challenging for less-studied and less-resourced languages such as\nLithuanian. Our review of existing Lithuanian NLP research reveals that\ntraditional machine learning methods and classification algorithms have limited\neffectiveness for the task. In this work, we address sentiment analysis of\nLithuanian five-star-based online reviews from multiple domains that we collect\nand clean. We apply transformer models to this task for the first time,\nexploring the capabilities of pre-trained multilingual Large Language Models\n(LLMs), specifically focusing on fine-tuning BERT and T5 models. Given the\ninherent difficulty of the task, the fine-tuned models perform quite well,\nespecially when the sentiments themselves are less ambiguous: 80.74% and 89.61%\ntesting recognition accuracy of the most popular one- and five-star reviews\nrespectively. They significantly outperform current commercial state-of-the-art\ngeneral-purpose LLM GPT-4. We openly share our fine-tuned LLMs online.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eZIYukGt-6XMHNK_2z3-p-6D4oTlU-mB4NDlvo3qJX0","pdfSize":"359827","objectId":"0x7852d56fbcf79617351733aa1d82db95b8ba394dd458dee4204235827d15d9de","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
