{"id":"2407.09089","title":"Lomics: Generation of Pathways and Gene Sets using Large Language Models\n  for Transcriptomic Analysis","authors":"Chun-Ka Wong, Ali Choo, Eugene C. C. Cheng, Wing-Chun San, Kelvin\n  Chak-Kong Cheng, Yee-Man Lau, Minqing Lin, Fei Li, Wei-Hao Liang, Song-Yan\n  Liao, Kwong-Man Ng, Ivan Fan-Ngai Hung, Hung-Fat Tse, Jason Wing-Hon Wong","authorsParsed":[["Wong","Chun-Ka",""],["Choo","Ali",""],["Cheng","Eugene C. C.",""],["San","Wing-Chun",""],["Cheng","Kelvin Chak-Kong",""],["Lau","Yee-Man",""],["Lin","Minqing",""],["Li","Fei",""],["Liang","Wei-Hao",""],["Liao","Song-Yan",""],["Ng","Kwong-Man",""],["Hung","Ivan Fan-Ngai",""],["Tse","Hung-Fat",""],["Wong","Jason Wing-Hon",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 08:34:45 GMT"}],"updateDate":"2024-07-15","timestamp":1720773285000,"abstract":"  Interrogation of biological pathways is an integral part of omics data\nanalysis. Large language models (LLMs) enable the generation of custom pathways\nand gene sets tailored to specific scientific questions. These targeted sets\nare significantly smaller than traditional pathway enrichment analysis\nlibraries, reducing multiple hypothesis testing and potentially enhancing\nstatistical power. Lomics (Large Language Models for Omics Studies) v1.0 is a\npython-based bioinformatics toolkit that streamlines the generation of pathways\nand gene sets for transcriptomic analysis. It operates in three steps: 1)\nderiving relevant pathways based on the researcher's scientific question, 2)\ngenerating valid gene sets for each pathway, and 3) outputting the results as\n.GMX files. Lomics also provides explanations for pathway selections.\nConsistency and accuracy are ensured through iterative processes, JSON format\nvalidation, and HUGO Gene Nomenclature Committee (HGNC) gene symbol\nverification. Lomics serves as a foundation for integrating LLMs into omics\nresearch, potentially improving the specificity and efficiency of pathway\nanalysis.\n","subjects":["Quantitative Biology/Molecular Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}