{"id":"2407.16620","title":"The role of meridional flow in the generation of solar/stellar magnetic\n  fields and cycles","authors":"Vindya Vashishth, Bidya Binay Karak","authorsParsed":[["Vashishth","Vindya",""],["Karak","Bidya Binay",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 16:30:54 GMT"}],"updateDate":"2024-07-24","timestamp":1721752254000,"abstract":"  Meridional flow is crucial in generating the solar poloidal magnetic field by\nfacilitating the poleward transport of the field from the decayed Bipolar\nMagnetic Regions (BMRs). As the meridional circulation changes with the stellar\nrotation rate, the properties of stellar magnetic cycles are expected to be\ninfluenced by this flow. In this study, we explore the role of meridional flow\nin generating magnetic fields in Sun and sun-like stars using STABLE, Surface\nflux Transport And Babcock-Leighton, dynamo model. We find that a moderate\nmeridional flow increases the polar field by efficiently driving the trailing\npolarity flux toward the pole, while a strong flow tends to transport both\npolarities of BMRs poleward, potentially reducing the polar field. Our findings\nare in perfect agreement with what one can expect from the surface flux\ntransport model. Similarly, the toroidal field initially increases with\nmoderate flow speeds and then decreases after a certain value. This trend is\ndue to the competitive effects of shearing and diffusion. Furthermore, our\nstudy highlights the impact of meridional flow on the cycle strength and\nduration in stellar cycles. By including the meridional flow from a mean-field\nhydrodynamics model in STABLE, we show that the magnetic field strength\ninitially increases with the stellar rotation rate and then declines in rapidly\nrotating stars, offering an explanation of the observed variation of stellar\nmagnetic field with rotation rate.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}