{"id":"2407.14936","title":"EidetiCom: A Cross-modal Brain-Computer Semantic Communication Paradigm\n  for Decoding Visual Perception","authors":"Linfeng Zheng, Peilin Chen, Shiqi Wang","authorsParsed":[["Zheng","Linfeng",""],["Chen","Peilin",""],["Wang","Shiqi",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 17:03:23 GMT"}],"updateDate":"2024-07-23","timestamp":1721495003000,"abstract":"  Brain-computer interface (BCI) facilitates direct communication between the\nhuman brain and external systems by utilizing brain signals, eliminating the\nneed for conventional communication methods such as speaking, writing, or\ntyping. Nevertheless, the continuous generation of brain signals in BCI\nframeworks poses challenges for efficient storage and real-time transmission.\nWhile considering the human brain as a semantic source, the meaningful\ninformation associated with cognitive activities often gets obscured by\nsubstantial noise present in acquired brain signals, resulting in abundant\nredundancy. In this paper, we propose a cross-modal brain-computer semantic\ncommunication paradigm, named EidetiCom, for decoding visual perception under\nlimited-bandwidth constraint. The framework consists of three hierarchical\nlayers, each responsible for compressing the semantic information of brain\nsignals into representative features. These low-dimensional compact features\nare transmitted and converted into semantically meaningful representations at\nthe receiver side, serving three distinct tasks for decoding visual perception:\nbrain signal-based visual classification, brain-to-caption translation, and\nbrain-to-image generation, in a scalable manner. Through extensive qualitative\nand quantitative experiments, we demonstrate that the proposed paradigm\nfacilitates the semantic communication under low bit rate conditions ranging\nfrom 0.017 to 0.192 bits-per-sample, achieving high-quality semantic\nreconstruction and highlighting its potential for efficient storage and\nreal-time communication of brain recordings in BCI applications, such as\neidetic memory storage and assistive communication for patients.\n","subjects":["Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}