{"id":"2407.14298","title":"Deep learning-driven likelihood-free parameter inference for 21-cm\n  forest observations","authors":"Tian-Yang Sun, Yue Shao, Yichao Li, Yidong Xu, Xin Zhang","authorsParsed":[["Sun","Tian-Yang",""],["Shao","Yue",""],["Li","Yichao",""],["Xu","Yidong",""],["Zhang","Xin",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:30:40 GMT"}],"updateDate":"2024-07-22","timestamp":1721395840000,"abstract":"  The hyperfine structure absorption lines of neutral hydrogen in spectra of\nhigh-redshift radio sources, known collectively as the 21-cm forest, have been\ndemonstrated as a sensitive probe to the small-scale structures governed by the\ndark matter (DM) properties, as well as the thermal history of the\nintergalactic medium regulated by the first galaxies during the epoch of\nreionization. By statistically analyzing these spectral features, the\none-dimensional (1D) power spectrum of the 21-cm forest can effectively break\nthe parameter degeneracies and constrain the properties of both DM and the\nfirst galaxies. However, conventional parameter inference methods face\nchallenges due to computationally expensive simulations for 21-cm forest and\nthe non-Gaussian signal characteristics. To address these issues, we introduce\ngenerative normalizing flows for data augmentation and inference normalizing\nflows for parameters estimation. This approach efficiently estimates parameters\nfrom minimally simulated datasets with non-Gaussian signals. Using simulated\ndata from the upcoming Square Kilometre Array (SKA), we demonstrate the ability\nof the deep learning-driven likelihood-free approach to generate accurate\nposterior distributions, providing a robust and efficient tool for probing DM\nand the cosmic heating history using the 1D power spectrum of 21-cm forest in\nthe era of SKA. This methodology is adaptable for scientific analyses with\nother unevenly distributed data.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}