{"id":"2407.04123","title":"A multi-wavelength study of Galactic H II regions with extended emission","authors":"Jyotirmoy Dey, Jagadheep D. Pandian, Dharam V. Lal, Michael R. Rugel,\n  Andreas Brunthaler, Karl M. Menten, Friedrich Wyrowski, Nirupam Roy, Sergio\n  A. Dzib, Sac-Nict\\'e X. Medina, Sarwar Khan, Rohit Dokara","authorsParsed":[["Dey","Jyotirmoy",""],["Pandian","Jagadheep D.",""],["Lal","Dharam V.",""],["Rugel","Michael R.",""],["Brunthaler","Andreas",""],["Menten","Karl M.",""],["Wyrowski","Friedrich",""],["Roy","Nirupam",""],["Dzib","Sergio A.",""],["Medina","Sac-Nicté X.",""],["Khan","Sarwar",""],["Dokara","Rohit",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 18:51:07 GMT"}],"updateDate":"2024-09-19","timestamp":1720119067000,"abstract":"  H II regions are the signposts of massive ($M\\geq\\,8\\,M_\\odot$) star-forming\nsites in our Galaxy. It has been observed that the ionizing photon rate\ninferred from the radio continuum emission of H II regions is significantly\nlower ($\\sim$ 90%) than that inferred from far-infrared fluxes measured by\nIRAS. This discrepancy in the ionizing photon rates may arise due to there\nbeing significant amounts of dust within the H II regions or the presence of\nextended emission that is undetected by high-resolution radio interferometric\nobservations. Here, we study a sample of eight compact and ultracompact H II\nregions with extended emission to explore its role in resolving the\ndiscrepancy. We have used observations at the uGMRT (1.25-1.45 GHz) and data\nfrom the GLOSTAR survey (4-8 GHz) to estimate the ionizing photon rate from the\nradio continuum emission. We have also estimated the ionizing photon rate from\nthe infrared luminosity by fitting a spectral energy distribution function to\nthe infrared data from the GLIMPSE, MIPSGAL, and Hi-GAL surveys. The excellent\nsensitivity of the radio observations to extended emission allows us to\ninvestigate the actual fraction of ionizing photons that are absorbed by dust\nin compact and ultracompact H II regions. Barring one source, we find a direct\nassociation between the radio continuum emission from the compact and diffuse\ncomponents of the H II region. Our study shows that the ionizing photon rates\nestimated using the radio and infrared data are within reasonable agreement\n(5-28%) if we include the extended emission. We also find multiple candidate\nionizing stars in all our sources, and the ionizing photon rates from the radio\nobservations and candidate stars are in reasonable agreement.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}