{"id":"2407.13863","title":"A Closer Look at GAN Priors: Exploiting Intermediate Features for\n  Enhanced Model Inversion Attacks","authors":"Yixiang Qiu, Hao Fang, Hongyao Yu, Bin Chen, MeiKang Qiu, Shu-Tao Xia","authorsParsed":[["Qiu","Yixiang",""],["Fang","Hao",""],["Yu","Hongyao",""],["Chen","Bin",""],["Qiu","MeiKang",""],["Xia","Shu-Tao",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 19:16:22 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 09:58:19 GMT"},{"version":"v3","created":"Sat, 27 Jul 2024 15:14:29 GMT"},{"version":"v4","created":"Fri, 13 Sep 2024 09:36:36 GMT"}],"updateDate":"2024-09-16","timestamp":1721330182000,"abstract":"  Model Inversion (MI) attacks aim to reconstruct privacy-sensitive training\ndata from released models by utilizing output information, raising extensive\nconcerns about the security of Deep Neural Networks (DNNs). Recent advances in\ngenerative adversarial networks (GANs) have contributed significantly to the\nimproved performance of MI attacks due to their powerful ability to generate\nrealistic images with high fidelity and appropriate semantics. However,\nprevious MI attacks have solely disclosed private information in the latent\nspace of GAN priors, limiting their semantic extraction and transferability\nacross multiple target models and datasets. To address this challenge, we\npropose a novel method, Intermediate Features enhanced Generative Model\nInversion (IF-GMI), which disassembles the GAN structure and exploits features\nbetween intermediate blocks. This allows us to extend the optimization space\nfrom latent code to intermediate features with enhanced expressive\ncapabilities. To prevent GAN priors from generating unrealistic images, we\napply a L1 ball constraint to the optimization process. Experiments on multiple\nbenchmarks demonstrate that our method significantly outperforms previous\napproaches and achieves state-of-the-art results under various settings,\nespecially in the out-of-distribution (OOD) scenario. Our code is available at:\nhttps://github.com/final-solution/IF-GMI\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}