{"id":"2407.08274","title":"Explainability of Sub-Field Level Crop Yield Prediction using Remote\n  Sensing","authors":"Hiba Najjar, Miro Miranda, Marlon Nuske, Ribana Roscher, Andreas\n  Dengel","authorsParsed":[["Najjar","Hiba",""],["Miranda","Miro",""],["Nuske","Marlon",""],["Roscher","Ribana",""],["Dengel","Andreas",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 08:23:46 GMT"}],"updateDate":"2024-07-12","timestamp":1720686226000,"abstract":"  Crop yield forecasting plays a significant role in addressing growing\nconcerns about food security and guiding decision-making for policymakers and\nfarmers. When deep learning is employed, understanding the learning and\ndecision-making processes of the models, as well as their interaction with the\ninput data, is crucial for establishing trust in the models and gaining insight\ninto their reliability. In this study, we focus on the task of crop yield\nprediction, specifically for soybean, wheat, and rapeseed crops in Argentina,\nUruguay, and Germany. Our goal is to develop and explain predictive models for\nthese crops, using a large dataset of satellite images, additional data\nmodalities, and crop yield maps. We employ a long short-term memory network and\ninvestigate the impact of using different temporal samplings of the satellite\ndata and the benefit of adding more relevant modalities. For model\nexplainability, we utilize feature attribution methods to quantify input\nfeature contributions, identify critical growth stages, analyze yield\nvariability at the field level, and explain less accurate predictions.\n  The modeling results show an improvement when adding more modalities or using\nall available instances of satellite data. The explainability results reveal\ndistinct feature importance patterns for each crop and region. We further found\nthat the most influential growth stages on the prediction are dependent on the\ntemporal sampling of the input data. We demonstrated how these critical growth\nstages, which hold significant agronomic value, closely align with the existing\nliterature in agronomy and crop development biology.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}