{"id":"2407.14385","title":"Natural convection in the cytoplasm: Theoretical predictions of\n  buoyancy-driven flows inside a cell","authors":"Nikhil Desai, Weida Liao, Eric Lauga","authorsParsed":[["Desai","Nikhil",""],["Liao","Weida",""],["Lauga","Eric",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:11:45 GMT"}],"updateDate":"2024-07-22","timestamp":1721401905000,"abstract":"  The existence of temperature gradients within eukaryotic cells has been\npostulated as a source of natural convection in the cytoplasm, i.e. bulk fluid\nmotion as a result of temperature-difference-induced density gradients. Recent\ncomputations have predicted that a temperature differential of $\\Delta T\n\\approx 1$ K between the cell nucleus and the cell membrane could be strong\nenough to drive significant intracellular material transport. We use numerical\ncomputations and theoretical calculations to revisit this problem in order to\nfurther understand the impact of temperature gradients on flow generation and\nadvective transport within cells. Surprisingly, our computations yield flows\nthat are an order of magnitude weaker than those obtained previously for the\nsame relative size and position of the nucleus with respect to the cell\nmembrane. To understand this discrepancy, we develop a semi-analytical solution\nof the convective flow inside a model cell using a bi-spherical coordinate\nframework, for the case of an axisymmetric cell geometry (i.e. when the\ndisplacement of the nucleus from the cell centre is aligned with gravity). We\nalso calculate exact solutions for the flow when the nucleus is located\nconcentrically inside the cell. The results from both theoretical analyses\nagree with our numerical results, thus providing a robust estimate of the\nstrength of cytoplasmic natural convection and demonstrating that these are\nmuch weaker than previously predicted. Finally, we investigate the ability of\nthe aforementioned flows to redistribute solute within a cell. Our calculations\nreveal that, in all but unrealistic cases, cytoplasmic convection has a\nnegligible contribution toward enhancing the diffusion-dominated mass transfer\nof cellular material.\n","subjects":["Physics/Fluid Dynamics","Condensed Matter/Soft Condensed Matter","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3NTrVOHxO3qLd1K26w6AR6wuXicy5wdXiFkzOvp3yQQ","pdfSize":"10320048"}
