{"id":"2407.13071","title":"Analysing the Public Discourse around OpenAI's Text-To-Video Model\n  'Sora' using Topic Modeling","authors":"Vatsal Vinay Parikh","authorsParsed":[["Parikh","Vatsal Vinay",""]],"versions":[{"version":"v1","created":"Thu, 30 May 2024 01:55:30 GMT"}],"updateDate":"2024-07-19","timestamp":1717034130000,"abstract":"  The recent introduction of OpenAI's text-to-video model Sora has sparked\nwidespread public discourse across online communities. This study aims to\nuncover the dominant themes and narratives surrounding Sora by conducting topic\nmodeling analysis on a corpus of 1,827 Reddit comments from five relevant\nsubreddits (r/OpenAI, r/technology, r/singularity, r/vfx, and r/ChatGPT). The\ncomments were collected over a two-month period following Sora's announcement\nin February 2024. After preprocessing the data, Latent Dirichlet Allocation\n(LDA) was employed to extract four key topics: 1) AI Impact and Trends in Sora\nDiscussions, 2) Public Opinion and Concerns about Sora, 3) Artistic Expression\nand Video Creation with Sora, and 4) Sora's Applications in Media and\nEntertainment. Visualizations including word clouds, bar charts, and t-SNE\nclustering provided insights into the importance of topic keywords and the\ndistribution of comments across topics. The results highlight prominent\nnarratives around Sora's potential impact on industries and employment, public\nsentiment and ethical concerns, creative applications, and use cases in the\nmedia and entertainment sectors. While limited to Reddit data within a specific\ntimeframe, this study offers a framework for understanding public perceptions\nof emerging generative AI technologies through online discourse analysis.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"2PWSIjYPZEicep4rkjtwBL36mCooLQQy-g0NT16hRXo","pdfSize":"531102","objectId":"0xedfa778f793e23aec80060c9c017c92b03e2480399afff1855a98077e024556b","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
