{"id":"2407.00955","title":"Task-oriented Over-the-air Computation for Edge-device Co-inference with\n  Balanced Classification Accuracy","authors":"Xiang Jiao, Dingzhu Wen, Guangxu Zhu, Wei Jiang, Wu Luo, Yuanming Shi","authorsParsed":[["Jiao","Xiang",""],["Wen","Dingzhu",""],["Zhu","Guangxu",""],["Jiang","Wei",""],["Luo","Wu",""],["Shi","Yuanming",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 04:17:32 GMT"}],"updateDate":"2024-07-02","timestamp":1719807452000,"abstract":"  Edge-device co-inference, which concerns the cooperation between edge devices\nand an edge server for completing inference tasks over wireless networks, has\nbeen a promising technique for enabling various kinds of intelligent services\nat the network edge, e.g., auto-driving. In this paradigm, the concerned design\nobjective of the network shifts from the traditional communication throughput\nto the effective and efficient execution of the inference task underpinned by\nthe network, measured by, e.g., the inference accuracy and latency. In this\npaper, a task-oriented over-the-air computation scheme is proposed for a\nmultidevice artificial intelligence system. Particularly, a novel tractable\ninference accuracy metric is proposed for classification tasks, which is called\nminimum pair-wise discriminant gain. Unlike prior work measuring the average of\nall class pairs in feature space, it measures the minimum distance of all class\npairs. By maximizing the minimum pair-wise discriminant gain instead of its\naverage counterpart, any pair of classes can be better separated in the feature\nspace, and thus leading to a balanced and improved inference accuracy for all\nclasses. Besides, this paper jointly optimizes the minimum discriminant gain of\nall feature elements instead of separately maximizing that of each element in\nthe existing designs. As a result, the transmit power can be adaptively\nallocated to the feature elements according to their different contributions to\nthe inference accuracy, opening an extra degree of freedom to improve inference\nperformance. Extensive experiments are conducted using a concrete use case of\nhuman motion recognition to verify the superiority of the proposed design over\nthe benchmarking scheme.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}