{"id":"2407.20543","title":"Local-Data-Hiding and Causal Inseparability: Probing Indefinite Causal\n  Structures with Cryptographic Primitives","authors":"Sahil Gopalkrishna Naik, Samrat Sen, Ram Krishna Patra, Ananya\n  Chakraborty, Mir Alimuddin, Manik Banik, Pratik Ghosal","authorsParsed":[["Naik","Sahil Gopalkrishna",""],["Sen","Samrat",""],["Patra","Ram Krishna",""],["Chakraborty","Ananya",""],["Alimuddin","Mir",""],["Banik","Manik",""],["Ghosal","Pratik",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 04:54:03 GMT"}],"updateDate":"2024-07-31","timestamp":1722315243000,"abstract":"  Formulation of physical theories typically assumes a definite causal\nstructure -- either static or dynamic -- among the set of physical events.\nRecent studies, however, suggest the possibility of indefiniteness in causal\nstructure, which emerges as a novel information primitive offering advantages\nin various protocols. In this work, we explore utilities of this new primitive\nin cryptographic applications. To this aim, we propose a task called\nlocal-data-hiding, where a referee distributes encrypted messages among distant\nparties in such a way that the parties individually remain completely ignorant\nabout the messages, and thus try to decrypt their respective messages through\nmutual collaboration. As we demonstrate, agents embedded in an indefinite\ncausal structure can outperform their counterparts operating in a definite\ncausal background. Considering the bipartite local-bit-hiding (LBH) task, we\nestablish a strict duality between its optimal success probability and the\noptimal violation of a causal inequality obtained from the\nguess-your-neighbour's-input game. This, in turn, provides a way forward to\nobtain Tsirelson-type bounds for causal inequalities. Furthermore, similar to\nPeres's separability criterion, we derive a necessary criterion for quantum\nprocesses to be useful in the LBH task. We then report an intriguing\nsuper-activation phenomenon, where two quantum processes, each individually not\nuseful for the LBH task, become useful when used together. We also analyze the\nutility of causal indefiniteness arising in classical setups and show its\nadvantages in multipartite variants of the local-data-hiding task. Along with\nestablishing new cryptographic applications our study illuminates various\nunexplored aspects of causal indefiniteness, and welcomes further studies on\nthis new information primitive.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RO9Lcq9u_MBFndaJYEG2_JygcAUyVaR6vH6iiJZRpe4","pdfSize":"1002898","objectId":"0x7eda5f7cb40472846740f5e6e5e066bc07e8a30b52cdd8df92ae75aba0238dd7","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
