{"id":"2407.12415","title":"Not All Frequencies Are Created Equal:Towards a Dynamic Fusion of\n  Frequencies in Time-Series Forecasting","authors":"Xingyu Zhang, Siyu Zhao, Zeen Song, Huijie Guo, Jianqi Zhang, Changwen\n  Zheng, Wenwen Qiang","authorsParsed":[["Zhang","Xingyu",""],["Zhao","Siyu",""],["Song","Zeen",""],["Guo","Huijie",""],["Zhang","Jianqi",""],["Zheng","Changwen",""],["Qiang","Wenwen",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 08:54:41 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 09:27:25 GMT"}],"updateDate":"2024-07-19","timestamp":1721206481000,"abstract":"  Long-term time series forecasting is a long-standing challenge in various\napplications. A central issue in time series forecasting is that methods should\nexpressively capture long-term dependency. Furthermore, time series forecasting\nmethods should be flexible when applied to different scenarios. Although\nFourier analysis offers an alternative to effectively capture reusable and\nperiodic patterns to achieve long-term forecasting in different scenarios,\nexisting methods often assume high-frequency components represent noise and\nshould be discarded in time series forecasting. However, we conduct a series of\nmotivation experiments and discover that the role of certain frequencies varies\ndepending on the scenarios. In some scenarios, removing high-frequency\ncomponents from the original time series can improve the forecasting\nperformance, while in others scenarios, removing them is harmful to forecasting\nperformance. Therefore, it is necessary to treat the frequencies differently\naccording to specific scenarios. To achieve this, we first reformulate the time\nseries forecasting problem as learning a transfer function of each frequency in\nthe Fourier domain. Further, we design Frequency Dynamic Fusion (FreDF), which\nindividually predicts each Fourier component, and dynamically fuses the output\nof different frequencies. Moreover, we provide a novel insight into the\ngeneralization ability of time series forecasting and propose the\ngeneralization bound of time series forecasting. Then we prove FreDF has a\nlower bound, indicating that FreDF has better generalization ability. Extensive\nexperiments conducted on multiple benchmark datasets and ablation studies\ndemonstrate the effectiveness of FreDF.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}