{"id":"2407.16073","title":"KaPQA: Knowledge-Augmented Product Question-Answering","authors":"Swetha Eppalapally, Daksh Dangi, Chaithra Bhat, Ankita Gupta, Ruiyi\n  Zhang, Shubham Agarwal, Karishma Bagga, Seunghyun Yoon, Nedim Lipka, Ryan A.\n  Rossi, Franck Dernoncourt","authorsParsed":[["Eppalapally","Swetha",""],["Dangi","Daksh",""],["Bhat","Chaithra",""],["Gupta","Ankita",""],["Zhang","Ruiyi",""],["Agarwal","Shubham",""],["Bagga","Karishma",""],["Yoon","Seunghyun",""],["Lipka","Nedim",""],["Rossi","Ryan A.",""],["Dernoncourt","Franck",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 22:14:56 GMT"}],"updateDate":"2024-07-24","timestamp":1721686496000,"abstract":"  Question-answering for domain-specific applications has recently attracted\nmuch interest due to the latest advancements in large language models (LLMs).\nHowever, accurately assessing the performance of these applications remains a\nchallenge, mainly due to the lack of suitable benchmarks that effectively\nsimulate real-world scenarios. To address this challenge, we introduce two\nproduct question-answering (QA) datasets focused on Adobe Acrobat and Photoshop\nproducts to help evaluate the performance of existing models on domain-specific\nproduct QA tasks. Additionally, we propose a novel knowledge-driven RAG-QA\nframework to enhance the performance of the models in the product QA task. Our\nexperiments demonstrated that inducing domain knowledge through query\nreformulation allowed for increased retrieval and generative performance when\ncompared to standard RAG-QA methods. This improvement, however, is slight, and\nthus illustrates the challenge posed by the datasets introduced.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"7LYRTs--3NUM7HFU2KXIC_MnAzrAdkPb2JLC6ssWVOM","pdfSize":"1439760","objectId":"0x48b996dad04dd1243800229068a293bbe64b2731a63a049ea06ed68b4661107c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
