{"id":"2407.18476","title":"Transmission characteristics of millimeter and sub-terahertz channels\n  through spatially ripple plasma sheath layers","authors":"Wenbo Liu, Peian Li, Da Li, Daniel M. Mittleman, Jianjun Ma","authorsParsed":[["Liu","Wenbo",""],["Li","Peian",""],["Li","Da",""],["Mittleman","Daniel M.",""],["Ma","Jianjun",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 02:58:53 GMT"}],"updateDate":"2024-07-29","timestamp":1721962733000,"abstract":"  The propagation of millimeter wave (MMW) and sub-terahertz (THz) signals\nthrough plasma sheaths is a critical concern for maintaining communication with\nhypersonic vehicles, yet the impact of complex plasma structures on these\nhigh-frequency channels remains insufficiently understood. In this work, we aim\nto characterize the transmission properties of MMW and sub-THz waves through\nplasma sheaths with various density profiles and ripple structures, addressing\nthe gap in knowledge regarding the effects of plasma inhomogeneities on signal\npropagation. We employ an approach combining Inductively Coupled Plasma (ICP)\ndata with transfer matrix methods (TMM) to model propagation through both flat\nand rippled plasma layers. Our findings reveal that ripple structures in plasma\nsheaths significantly affect channel performance, with periodic ripples\nreducing cutoff frequency and introducing frequency-selective behavior, while\nrandom ripples cause more unpredictable transmission characteristics. Our\nresults explore the impact of the arrangement of plasma density layers and the\nparameters of ripple structures (period and amplitude) on channel transmission,\ngroup velocity dispersion, and angular dependence of wave propagation. These\nresults provide crucial insights for the design and optimization of\ncommunication systems for hypersonic vehicles, potentially enabling the\ndevelopment of adaptive technologies capable of maintaining reliable\ncommunication in complex plasma environments.\n","subjects":["Physics/Plasma Physics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FSlGx0XUEEPhm515_5RWfkdic1SvTRr7prQT2SIZhDA","pdfSize":"3994984"}
