{"id":"2407.12771","title":"The Role of Network and Identity in the Diffusion of Hashtags","authors":"Aparna Ananthasubramaniam, Yufei Zhu, David Jurgens, Daniel Romero","authorsParsed":[["Ananthasubramaniam","Aparna",""],["Zhu","Yufei",""],["Jurgens","David",""],["Romero","Daniel",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 17:51:49 GMT"}],"updateDate":"2024-07-18","timestamp":1721238709000,"abstract":"  Although the spread of behaviors is influenced by many social factors,\nexisting literature tends to study the effects of single factors -- most often,\nproperties of the social network -- on the final cascade. In order to move\ntowards a more integrated view of cascades, this paper offers the first\ncomprehensive investigation into the role of two social factors in the\ndiffusion of 1,337 popular hashtags representing the production of novel\nculture on Twitter: 1) the topology of the Twitter social network and 2)\nperformance of each user's probable demographic identity. Here, we show that\ncascades are best modeled using a combination of network and identity, rather\nthan either factor alone. This combined model best reproduces a composite index\nof ten cascade properties across all 1,337 hashtags. However, there is\nimportant heterogeneity in what social factors are required to reproduce\ndifferent properties of hashtag cascades. For instance, while a combined\nnetwork+identity model best predicts the popularity of cascades, a network-only\nmodel has better performance in predicting cascade growth and an identity-only\nmodel in adopter composition. We are able to predict what type of hashtag is\nbest modeled by each combination of features and use this to further improve\nperformance. Additionally, consistent with prior literature on the combined\nnetwork+identity model most outperforms the single-factor counterfactuals among\nhashtags used for expressing racial or regional identity, stance-taking,\ntalking about sports, or variants of existing cultural trends with very slow-\nor fast-growing communicative need. In sum, our results imply the utility of\nmulti-factor models in predicting cascades, in order to account for the varied\nways in which network, identity, and other social factors play a role in the\ndiffusion of hashtags on Twitter.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Computation and Language","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"dqSIxlI6uIwPU3COmzA3kPnLO8hxNrPMFKDORcWbBRM","pdfSize":"1282171","objectId":"0xff3985c76e5b2f043fcff25e650cfd2cb9008627601e53931d7d613aeda74ff2","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
