{"id":"2407.03200","title":"SegVG: Transferring Object Bounding Box to Segmentation for Visual\n  Grounding","authors":"Weitai Kang, Gaowen Liu, Mubarak Shah, Yan Yan","authorsParsed":[["Kang","Weitai",""],["Liu","Gaowen",""],["Shah","Mubarak",""],["Yan","Yan",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 15:30:45 GMT"},{"version":"v2","created":"Sat, 6 Jul 2024 15:18:37 GMT"}],"updateDate":"2024-07-09","timestamp":1720020645000,"abstract":"  Different from Object Detection, Visual Grounding deals with detecting a\nbounding box for each text-image pair. This one box for each text-image data\nprovides sparse supervision signals. Although previous works achieve impressive\nresults, their passive utilization of annotation, i.e. the sole use of the box\nannotation as regression ground truth, results in a suboptimal performance. In\nthis paper, we present SegVG, a novel method transfers the box-level annotation\nas Segmentation signals to provide an additional pixel-level supervision for\nVisual Grounding. Specifically, we propose the Multi-layer Multi-task\nEncoder-Decoder as the target grounding stage, where we learn a regression\nquery and multiple segmentation queries to ground the target by regression and\nsegmentation of the box in each decoding layer, respectively. This approach\nallows us to iteratively exploit the annotation as signals for both box-level\nregression and pixel-level segmentation. Moreover, as the backbones are\ntypically initialized by pretrained parameters learned from unimodal tasks and\nthe queries for both regression and segmentation are static learnable\nembeddings, a domain discrepancy remains among these three types of features,\nwhich impairs subsequent target grounding. To mitigate this discrepancy, we\nintroduce the Triple Alignment module, where the query, text, and vision tokens\nare triangularly updated to share the same space by triple attention mechanism.\nExtensive experiments on five widely used datasets validate our\nstate-of-the-art (SOTA) performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}