{"id":"2407.01808","title":"Toward Wireless System and Circuit Co-Design for the Internet of\n  Self-Adaptive Things","authors":"Diptashree Das, Mohammad Abdi, Minghan Liu, Marvin Onabajo and\n  Francesco Restuccia","authorsParsed":[["Das","Diptashree",""],["Abdi","Mohammad",""],["Liu","Minghan",""],["Onabajo","Marvin",""],["Restuccia","Francesco",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 21:13:48 GMT"}],"updateDate":"2024-07-03","timestamp":1719868428000,"abstract":"  The deployment of a growing number of devices in Internet of Things (IoT)\nnetworks implies that uninterrupted and seamless adaptation of wireless\ncommunication parameters (e.g., carrier frequency, bandwidth and modulation)\nwill become essential. To utilize wireless devices capable of switching several\ncommunication parameters requires real-time self-optimizations at the radio\nfrequency integrated circuit (RFIC) level based on system level performance\nmetrics during the processing of complex modulated signals. This article\nintroduces a novel design verification approach for reconfigurable RFICs based\non end-to-end wireless system-level performance metrics while operating in a\ndynamically changing communication environment. In contrast to prior work, this\nframework includes two modules that simulate a wireless channel and decode\nwaveforms. These are connected to circuit-level modules that capture device-\nand circuit-level non-idealities of RFICs for design validation and\noptimization, such as transistor noises, intermodulation/harmonic distortions,\nand memory effects from parasitic capacitances. We demonstrate this framework\nwith a receiver (RX) consisting of a reconfigurable complementary metal-oxide\nsemiconductor (CMOS) low-noise amplifier (LNA) designed at the transistor\nlevel, a behavioral model of a mixer, and an ideal filter model. The seamless\nintegration between system-level wireless models with circuit-level and\nbehavioral models (such as VerilogA-based models) for RFIC blocks enables to\npreemptively evaluate circuit and system designs, and to optimize for different\ncommunication scenarios with adaptive circuits having extensive tuning ranges.\nAn exemplary case study is presented, in which simulation results reveal that\nthe LNA power consumption can be reduced up to 16x depending on system-level\nrequirements.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WEO3vqAsl7stfp71fFPzVGxqdPwLlFH_J9Q9DPzsKO4","pdfSize":"5727644","objectId":"0x511ac3b6d300a865ecc7fdd1c15959fe0a36128dd9950a18d4b8830cf1b1fd8b","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
