{"id":"2407.13268","title":"Mixture of Experts based Multi-task Supervise Learning from Crowds","authors":"Tao Han, Huaixuan Shi, Xinyi Ding, Xiao Ma, Huamao Gu and Yili Fang","authorsParsed":[["Han","Tao",""],["Shi","Huaixuan",""],["Ding","Xinyi",""],["Ma","Xiao",""],["Gu","Huamao",""],["Fang","Yili",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 08:21:31 GMT"}],"updateDate":"2024-07-19","timestamp":1721290891000,"abstract":"  Existing truth inference methods in crowdsourcing aim to map redundant labels\nand items to the ground truth. They treat the ground truth as hidden variables\nand use statistical or deep learning-based worker behavior models to infer the\nground truth. However, worker behavior models that rely on ground truth hidden\nvariables overlook workers' behavior at the item feature level, leading to\nimprecise characterizations and negatively impacting the quality of truth\ninference. This paper proposes a new paradigm of multi-task supervised learning\nfrom crowds, which eliminates the need for modeling of items's ground truth in\nworker behavior models. Within this paradigm, we propose a worker behavior\nmodel at the item feature level called Mixture of Experts based Multi-task\nSupervised Learning from Crowds (MMLC). Two truth inference strategies are\nproposed within MMLC. The first strategy, named MMLC-owf, utilizes clustering\nmethods in the worker spectral space to identify the projection vector of the\noracle worker. Subsequently, the labels generated based on this vector are\nconsidered as the inferred truth. The second strategy, called MMLC-df, employs\nthe MMLC model to fill the crowdsourced data, which can enhance the\neffectiveness of existing truth inference methods. Experimental results\ndemonstrate that MMLC-owf outperforms state-of-the-art methods and MMLC-df\nenhances the quality of existing truth inference methods.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}