{"id":"2407.19233","title":"Exchangeable arrays and integrable systems for characteristic\n  polynomials of random matrices","authors":"Theodoros Assiotis, Mustafa Alper Gunes, Jonathan P. Keating, Fei Wei","authorsParsed":[["Assiotis","Theodoros",""],["Gunes","Mustafa Alper",""],["Keating","Jonathan P.",""],["Wei","Fei",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 11:32:24 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 12:34:01 GMT"}],"updateDate":"2024-08-21","timestamp":1722079944000,"abstract":"  The joint moments of the derivatives of the characteristic polynomial of a\nrandom unitary matrix, and also a variant of the characteristic polynomial that\nis real on the unit circle, in the large matrix size limit, have been studied\nintensively in the past twenty five years, partly in relation to conjectural\nconnections to the Riemann zeta-function and Hardy's function. We completely\nsettle the most general version of the problem of convergence of these joint\nmoments, after they are suitably rescaled, for an arbitrary number of\nderivatives and with arbitrary positive real exponents. Our approach relies on\na hidden, higher-order exchangeable structure, that of an exchangeable array.\nUsing these probabilistic techniques, we then give a combinatorial formula for\nthe leading order coefficient in the asymptotics of the joint moments, when the\npower on the characteristic polynomial itself is a positive real number and the\nexponents of the derivatives are integers, in terms of a finite number of\nfinite-dimensional integrals which are explicitly computable. Finally, we\ndevelop a method, based on a class of Hankel determinants shifted by\npartitions, that allows us to give an exact representation of all these joint\nmoments, for finite matrix size, in terms of derivatives of Painlev\\'e V\ntranscendents, and then for the leading order coefficient in the large-matrix\nlimit in terms of derivatives of solutions of the $\\sigma$-Painlev\\'e III'\nequation. Equivalently, we can represent all the joint moments of power sum\nlinear statistics of a certain determinantal point process behind this problem\nin terms of derivatives of $\\sigma$-Painlev\\'e III' transcendents. This gives\nan efficient way to compute all these quantities explicitly. Our methods can be\nused to obtain analogous results for a number of other models sharing the same\nfeatures.\n","subjects":["Mathematics/Probability","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Mathematics/Number Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RLC_07KAUPQezuxe2JRb1I6wYspNfcK7hJ-1CFgKB1A","pdfSize":"641533"}
