{"id":"2407.21577","title":"Multi-Site Class-Incremental Learning with Weighted Experts in\n  Echocardiography","authors":"Kit M. Bransby and Woo-jin Cho Kim and Jorge Oliveira and Alex Thorley\n  and Arian Beqiri and Alberto Gomez and Agisilaos Chartsias","authorsParsed":[["Bransby","Kit M.",""],["Kim","Woo-jin Cho",""],["Oliveira","Jorge",""],["Thorley","Alex",""],["Beqiri","Arian",""],["Gomez","Alberto",""],["Chartsias","Agisilaos",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 13:05:32 GMT"}],"updateDate":"2024-08-01","timestamp":1722431132000,"abstract":"  Building an echocardiography view classifier that maintains performance in\nreal-life cases requires diverse multi-site data, and frequent updates with\nnewly available data to mitigate model drift. Simply fine-tuning on new\ndatasets results in \"catastrophic forgetting\", and cannot adapt to variations\nof view labels between sites. Alternatively, collecting all data on a single\nserver and re-training may not be feasible as data sharing agreements may\nrestrict image transfer, or datasets may only become available at different\ntimes. Furthermore, time and cost associated with re-training grows with every\nnew dataset. We propose a class-incremental learning method which learns an\nexpert network for each dataset, and combines all expert networks with a score\nfusion model. The influence of ``unqualified experts'' is minimised by\nweighting each contribution with a learnt in-distribution score. These weights\npromote transparency as the contribution of each expert is known during\ninference. Instead of using the original images, we use learned features from\neach dataset, which are easier to share and raise fewer licensing and privacy\nconcerns. We validate our work on six datasets from multiple sites,\ndemonstrating significant reductions in training time while improving view\nclassification performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1bGdjNf3_Vwawv8gNROtlWcprJqaFes0fiOrojTCZDo","pdfSize":"1796615"}
