{"id":"2407.00098","title":"Scalable, Trustworthy Generative Model for Virtual Multi-Staining from\n  H&E Whole Slide Images","authors":"Mehdi Ounissi, Ilias Sarbout, Jean-Pierre Hugot, Christine\n  Martinez-Vinson, Dominique Berrebi and Daniel Racoceanu","authorsParsed":[["Ounissi","Mehdi",""],["Sarbout","Ilias",""],["Hugot","Jean-Pierre",""],["Martinez-Vinson","Christine",""],["Berrebi","Dominique",""],["Racoceanu","Daniel",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 21:52:05 GMT"}],"updateDate":"2024-07-02","timestamp":1719438725000,"abstract":"  Chemical staining methods are dependable but require extensive time,\nexpensive chemicals, and raise environmental concerns. These challenges\nhighlight the need for alternative solutions like virtual staining, which\naccelerates the diagnostic process and enhances stain application flexibility.\nGenerative AI technologies are pivotal in addressing these issues. However, the\nhigh-stakes nature of healthcare decisions, especially in computational\npathology, complicates the adoption of these tools due to their opaque\nprocesses. Our work introduces the use of generative AI for virtual staining,\naiming to enhance performance, trustworthiness, scalability, and adaptability\nin computational pathology. The methodology centers on a singular H&E encoder\nsupporting multiple stain decoders. This design focuses on critical regions in\nthe latent space of H&E, enabling precise synthetic stain generation. Our\nmethod, tested to generate 8 different stains from a single H&E slide, offers\nscalability by loading only necessary model components during production. We\nintegrate label-free knowledge in training, using loss functions and\nregularization to minimize artifacts, thus improving paired/unpaired virtual\nstaining accuracy. To build trust, we use real-time self-inspection with\ndiscriminators for each stain type, providing pathologists with confidence\nheat-maps. Automatic quality checks on new H&E slides ensure conformity to the\ntrained distribution, ensuring accurate synthetic stains. Recognizing\npathologists' challenges with new technologies, we have developed an\nopen-source, cloud-based system, that allows easy virtual staining of H&E\nslides through a browser, addressing hardware/software issues and facilitating\nreal-time user feedback. We also curated a novel dataset of 8 paired H&E/stains\nrelated to pediatric Crohn's disease, comprising 480 WSIs to further stimulate\ncomputational pathology research.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}