{"id":"2407.13053","title":"E2Vec: Feature Embedding with Temporal Information for Analyzing Student\n  Actions in E-Book Systems","authors":"Yuma Miyazaki, Valdemar \\v{S}v\\'abensk\\'y, Yuta Taniguchi, Fumiya\n  Okubo, Tsubasa Minematsu, Atsushi Shimada","authorsParsed":[["Miyazaki","Yuma",""],["Švábenský","Valdemar",""],["Taniguchi","Yuta",""],["Okubo","Fumiya",""],["Minematsu","Tsubasa",""],["Shimada","Atsushi",""]],"versions":[{"version":"v1","created":"Fri, 24 May 2024 10:17:43 GMT"}],"updateDate":"2024-07-19","timestamp":1716545863000,"abstract":"  Digital textbook (e-book) systems record student interactions with textbooks\nas a sequence of events called EventStream data. In the past, researchers\nextracted meaningful features from EventStream, and utilized them as inputs for\ndownstream tasks such as grade prediction and modeling of student behavior.\nPrevious research evaluated models that mainly used statistical-based features\nderived from EventStream logs, such as the number of operation types or access\nfrequencies. While these features are useful for providing certain insights,\nthey lack temporal information that captures fine-grained differences in\nlearning behaviors among different students. This study proposes E2Vec, a novel\nfeature representation method based on word embeddings. The proposed method\nregards operation logs and their time intervals for each student as a string\nsequence of characters and generates a student vector of learning activity\nfeatures that incorporates time information. We applied fastText to generate an\nembedding vector for each of 305 students in a dataset from two years of\ncomputer science courses. Then, we investigated the effectiveness of E2Vec in\nan at-risk detection task, demonstrating potential for generalizability and\nperformance.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"k7ztsgtn1UHhMTTTHHYGgxPt97DG5kinIhIB0DF1fXE","pdfSize":"1392135","objectId":"0x328da2ae9df90b1746f39ff9eef831821d1e08178162b79df516dea17c9f2aae","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
