{"id":"2407.03650","title":"Reviewers of Educational Immersive and Extended Reality (XR)\n  experiences: Who is creating these reviews and why?","authors":"Sophie McKenzie, Shaun Bangay, Maria Nicholas, Adam Cardilini, Majeet\n  Singh","authorsParsed":[["McKenzie","Sophie",""],["Bangay","Shaun",""],["Nicholas","Maria",""],["Cardilini","Adam",""],["Singh","Majeet",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 05:45:56 GMT"}],"updateDate":"2024-07-08","timestamp":1720071956000,"abstract":"  This paper presents a scoping review of literature to examine who is\nreviewing educational immersive or extended reality - eduXR experiences and\nwhy. EduXR experiences in augmented, virtual or mixed reality take many forms,\nfrom supporting manual training, engaging learners in conservation, to provide\nopportunities for social connection. For users of eduXR, reviews of an\nexperience can provide information that helps them determine whether it will\nmeet their learning needs or not. The source of the review, that is, who they\nare and why they have conducted the review, is critical in helping the user\njudge the reviews quality and relevance. At present, there is no settled review\nsystem in place for eduXR, though relevant frameworks exist for serious games\nreview with relevance and overlap for some, but not all, eduXR experiences.\nWhile some authors have engaged in preparing a detailed review structure for\neduXR, there remains a need for a clear and simple way for users of eduXR to\nknow details about reviewers, e.g., who and why, to help make it easier for\nusers to identify relevant reviews and gain useful insight about eduXR\nexperiences. To help address this issue, we conducted a scoping review asking\nthe question; Who is creating eduXR reviews, and why? We identified 16 papers\nthat present an academic evaluation on the review process of eduXR reviews. The\n16 papers were analysed, coding for who themes and why themes over two separate\ncycles, using thematic analysis. An analysis looked to examine what we know\nregarding who is providing the reviews, and why, to help us to understand what\nenables, inhibits and what is yet unknown about how the eduXR community goes\nabout making informed choices regarding the eduXR experiences they engage with.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"bYF-FPm1JcLe5IAyTk-QFYGumhiTZJHjpMbBX4FDJ1s","pdfSize":"402380"}
