{"id":"2407.04530","title":"A spatial-correlated multitask linear mixed-effects model for imaging\n  genetics","authors":"Zhibin Pu and Shufei Ge","authorsParsed":[["Pu","Zhibin",""],["Ge","Shufei",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 14:18:07 GMT"}],"updateDate":"2024-07-08","timestamp":1720189087000,"abstract":"  Imaging genetics aims to uncover the hidden relationship between imaging\nquantitative traits (QTs) and genetic markers (e.g. single nucleotide\npolymorphism (SNP)), and brings valuable insights into the pathogenesis of\ncomplex diseases, such as cancers and cognitive disorders (e.g. the Alzheimer's\nDisease). However, most linear models in imaging genetics didn't explicitly\nmodel the inner relationship among QTs, which might miss some potential\nefficiency gains from information borrowing across brain regions. In this work,\nwe developed a novel Bayesian regression framework for identifying significant\nassociations between QTs and genetic markers while explicitly modeling spatial\ndependency between QTs, with the main contributions as follows. Firstly, we\ndeveloped a spatial-correlated multitask linear mixed-effects model (LMM) to\naccount for dependencies between QTs. We incorporated a population-level mixed\neffects term into the model, taking full advantage of the dependent structure\nof brain imaging-derived QTs. Secondly, we implemented the model in the\nBayesian framework and derived a Markov chain Monte Carlo (MCMC) algorithm to\nachieve the model inference. Further, we incorporated the MCMC samples with the\nCauchy combination test (CCT) to examine the association between SNPs and QTs,\nwhich avoided computationally intractable multi-test issues. The simulation\nstudies indicated improved power of our proposed model compared to classic\nmodels where inner dependencies of QTs were not modeled. We also applied the\nnew spatial model to an imaging dataset obtained from the Alzheimer's Disease\nNeuroimaging Initiative (ADNI) database.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"cu2JXIESPp9GnfRv7JMPA5W8cJ3O_SKJEu9Ojlp5LCU","pdfSize":"3014522"}
