{"id":"2407.14984","title":"Enhancing Microgrid Performance Prediction with Attention-based Deep\n  Learning Models","authors":"Vinod Kumar Maddineni, Naga Babu Koganti and Praveen Damacharla","authorsParsed":[["Maddineni","Vinod Kumar",""],["Koganti","Naga Babu",""],["Damacharla","Praveen",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 21:24:11 GMT"}],"updateDate":"2024-07-23","timestamp":1721510651000,"abstract":"  In this research, an effort is made to address microgrid systems' operational\nchallenges, characterized by power oscillations that eventually contribute to\ngrid instability. An integrated strategy is proposed, leveraging the strengths\nof convolutional and Gated Recurrent Unit (GRU) layers. This approach is aimed\nat effectively extracting temporal data from energy datasets to improve the\nprecision of microgrid behavior forecasts. Additionally, an attention layer is\nemployed to underscore significant features within the time-series data,\noptimizing the forecasting process. The framework is anchored by a Multi-Layer\nPerceptron (MLP) model, which is tasked with comprehensive load forecasting and\nthe identification of abnormal grid behaviors. Our methodology underwent\nrigorous evaluation using the Micro-grid Tariff Assessment Tool dataset, with\nRoot Mean Square Error (RMSE), Mean Absolute Error (MAE), and the coefficient\nof determination (r2-score) serving as the primary metrics. The approach\ndemonstrated exemplary performance, evidenced by a MAE of 0.39, RMSE of 0.28,\nand an r2-score of 98.89\\% in load forecasting, along with near-perfect zero\nstate prediction accuracy (approximately 99.9\\%). Significantly outperforming\nconventional machine learning models such as support vector regression and\nrandom forest regression, our model's streamlined architecture is particularly\nsuitable for real-time applications, thereby facilitating more effective and\nreliable microgrid management.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}