{"id":"2407.07434","title":"Aging-Resistant Wideband Precoding in 5G and Beyond Using 3D\n  Convolutional Neural Networks","authors":"Alejandro Villena-Rodriguez, Francisco J. Mart\\'in-Vega, Gerardo\n  G\\'omez, Mari Carmen Aguayo-Torres and Georges Kaddoum","authorsParsed":[["Villena-Rodriguez","Alejandro",""],["Martín-Vega","Francisco J.",""],["Gómez","Gerardo",""],["Aguayo-Torres","Mari Carmen",""],["Kaddoum","Georges",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 07:40:40 GMT"}],"updateDate":"2024-07-11","timestamp":1720597240000,"abstract":"  To meet the ever-increasing demand for higher data rates, 5G and 6G\ntechnologies are shifting transceivers to higher carrier frequencies, to\nsupport wider bandwidths and more antenna elements. Nevertheless, this solution\nposes several key challenges: i) increasing the carrier frequency and bandwidth\nleads to greater channel frequency selectivity in time and frequency domains,\nand ii) the greater the number of antennas the greater the the pilot overhead\nfor channel estimation and the more prohibitively complex it becomes to\ndetermine the optimal precoding matrix. This paper presents two deep-learning\nframeworks to solve these issues. Firstly, we propose a 3D convolutional neural\nnetwork (CNN) that is based on image super-resolution and captures the\ncorrelations between the transmitting and receiving antennas and the frequency\ndomains to combat frequency selectivity. Secondly, we devise a deep\nlearning-based framework to combat the time selectivity of the channel that\ntreats channel aging as a distortion that can be mitigated through deep\nlearning-based image restoration techniques. Simulation results show that\ncombining both frameworks leads to a significant improvement in performance\ncompared to existing techniques with little increase in complexity.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}