{"id":"2407.12648","title":"Blind Beamforming for Coverage Enhancement with Intelligent Reflecting\n  Surface","authors":"Fan Xu, Jiawei Yao, Wenhai Lai, Kaiming Shen, Xin Li, Xin Chen,\n  Zhi-Quan Luo","authorsParsed":[["Xu","Fan",""],["Yao","Jiawei",""],["Lai","Wenhai",""],["Shen","Kaiming",""],["Li","Xin",""],["Chen","Xin",""],["Luo","Zhi-Quan",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:16:42 GMT"}],"updateDate":"2024-07-18","timestamp":1721229402000,"abstract":"  Conventional policy for configuring an intelligent reflecting surface (IRS)\ntypically requires channel state information (CSI), thus incurring substantial\noverhead costs and facing incompatibility with the current network protocols.\nThis paper proposes a blind beamforming strategy in the absence of CSI, aiming\nto boost the minimum signal-to-noise ratio (SNR) among all the receiver\npositions, namely the coverage enhancement. Although some existing works\nalready consider the IRS-assisted coverage enhancement without CSI, they assume\ncertain position-channel models through which the channels can be recovered\nfrom the geographic locations. In contrast, our approach solely relies on the\nreceived signal power data, not assuming any position-channel model. We examine\nthe achievability and converse of the proposed blind beamforming method. If the\nIRS has $N$ reflective elements and there are $U$ receiver positions, then our\nmethod guarantees the minimum SNR of $\\Omega(N^2/U)$ -- which is fairly close\nto the upper bound $O(N+N^2\\sqrt{\\ln (NU)}/\\sqrt[4]{U})$. Aside from the\nsimulation results, we justify the practical use of blind beamforming in a\nfield test at 2.6 GHz. According to the real-world experiment, the proposed\nblind beamforming method boosts the minimum SNR across seven random positions\nin a conference room by 18.22 dB, while the position-based method yields a\nboost of 12.08 dB.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}