{"id":"2407.13720","title":"Design of a Thomson scattering diagnostic for the SMART tokamak","authors":"M. Kaur, A. Diallo, B. LeBlanc, J. Segado-Fernandez, E. Viezzer, Roger\n  Huxford, A. Mancini, D. J. Cruz-Zabala, M. Podesta, J. W. Berkery, and M.\n  Garcia-Munoz","authorsParsed":[["Kaur","M.",""],["Diallo","A.",""],["LeBlanc","B.",""],["Segado-Fernandez","J.",""],["Viezzer","E.",""],["Huxford","Roger",""],["Mancini","A.",""],["Cruz-Zabala","D. J.",""],["Podesta","M.",""],["Berkery","J. W.",""],["Garcia-Munoz","M.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:20:38 GMT"}],"updateDate":"2024-07-19","timestamp":1721323238000,"abstract":"  We describe the design of a Thomson scattering (TS) diagnostic to be used on\nthe SMall Aspect Ratio Tokamak (SMART). SMART is a spherical tokamak being\ncommissioned in Spain that aims to explore positive triangularity (PT) and\nnegative triangularity (NT) plasma scenarios at a low aspect ratio. The SMART\nTS diagnostic is designed to enable a wide range of electron temperature (1 eV\nto 1 keV) and density (0.5 - 10 $\\times 10^{19} ~\\rm{m^{ - 3}}$) measurements.\nA 2Joule laser operating at 1064 nm will be used to probe the electron\ntemperature and density of the plasma. The laser is capable of operating in the\nburst mode at 1kHz, 2kHz, and 4kHz to investigate fast phenomena or at $30$ Hz\nto study 1 sec (or more) long discharges. The scattered light will be collected\nover an angular range of 60-120 degrees at 28 spatial points in the midplane\ncovering the core region and edge plasma on both the low-field side (LFS) and\nthe high-field side (HFS). Simulation data is used to determine the optimum\nlocation of Thomson scattering measurement points to effectively resolve the\nedge pedestal in the LFS and HFS regions under different triangularity\nconditions. Each scattering signal will be spectrally resolved on five\nwavelength channels of a polychromator to obtain the electron temperature\nmeasurement. We will also present a method to monitor in-situ laser alignment\nin the core during calibrations and plasma operations.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vJ8xqizQNZYtm3ZQBNpBLyc1MrnUCkZ_RLTx4THSJj0","pdfSize":"3736476"}
