{"id":"2407.04425","title":"Exploring wetting dynamics of water nanodroplet on nano-textured\n  surfaces: atomistic insights","authors":"Ilemona S. Omeje, Djafar Iabbaden, Patrick Ganster, and Tatiana E.\n  Itina","authorsParsed":[["Omeje","Ilemona S.",""],["Iabbaden","Djafar",""],["Ganster","Patrick",""],["Itina","Tatiana E.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 11:18:11 GMT"}],"updateDate":"2024-07-08","timestamp":1720178291000,"abstract":"  The static and dynamic wetting behaviors of a water nanodroplet are\ninvestigated on flat and structured titanium (Ti) surfaces by using a fully\natomistic simulation. Firstly, the results obtained for a water nanodroplet on\na flat Ti surface agree with the static contact angle reported in the\nliterature. Furthermore, to unveil the mechanisms of the water nanodroplet\nbehavior on nano-textured surfaces, we analyze the impact of the roughness\nfactors, the structure period, and sizes compared to the nanodroplet diameter.\nThe introduction of the surface roughness produces an inhomogeneous spreading\nof the nanodroplet. The degree of roughness and the specific dimensions of the\nsurface grooves determine these wetting processes. Surfaces with larger grooves\nand spacing tend to support more extensive spreading, while those with narrower\ngrooves and higher roughness limit spreading. The obtained results also\ndemonstrate damping in droplet vibrations accompanied by a gradual decrease in\nthe dynamic contact angle of water nanodroplets on both flat and rough Ti\nsurfaces, indicating a transition to a hydrophobic state. This effect is caused\nby the atomic bonding of water atoms to the surface ones and is shown to\nstrongly depend on the surface roughness factors. The simulation results\nprovide atomiclevel insights into the wetting mechanisms on surfaces featuring\nnanometric and sub-micrometric roughness, typically induced by femtosecond\nlaser processing.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}