{"id":"2407.01756","title":"Radiative decay of muonic molecules in resonance states","authors":"Takuma Yamashita, Kazuhiro Yasuda, Yasushi Kino","authorsParsed":[["Yamashita","Takuma",""],["Yasuda","Kazuhiro",""],["Kino","Yasushi",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 19:35:06 GMT"},{"version":"v2","created":"Tue, 9 Jul 2024 17:01:21 GMT"},{"version":"v3","created":"Thu, 18 Jul 2024 07:27:58 GMT"}],"updateDate":"2024-07-19","timestamp":1719862506000,"abstract":"  In this study, we theoretically investigated x-ray spectra from the radiative\ndecay of muonic deuterium molecules dd$\\mu$ in resonance states, which plays an\nimportant role in a new kinetic model of muon catalyzed fusion ($\\mu$CF). The\nresonance states are Feshbach resonances located below the d$\\mu$($n=2$) + d\nthreshold energy and radiatively decay into the continuum or bound states. The\nx-ray spectra having characteristic shapes according to the radial distribution\nof the two nuclei are obtained using precise three-body wave functions. We\ncarefully examined the convergence of the x-ray spectra and achieved agreements\nbetween the length- and velocity-gauge calculations. We revealed a\nnon-adiabatic kinetic energy distribution of the decay fragments, indicating\nthat the radiative decay becomes a heating source of muonic atoms. We also\ninvestigated the decay branch that directly results in bound-state muonic\nmolecules. Some resonance states dd$\\mu^\\ast$ and dt$\\mu^\\ast$ are found to\nhave high branching ratios to the bound state where intramolecular nuclear\nfusion occurs. The formation of the muonic molecules in the bound states from\nmetastable muonic atoms can be a fast track in the $\\mu$CF cycle which skips a\nslow path to form the bound state from the ground-state muonic atoms and\nincreases the $\\mu$CF cycle rate. Although the spectra from the radiative\ndecays are located in the energy range of $1.5$--$1.997$ keV, which is close to\nthe K$\\alpha$ x-ray of 1.997 keV from muonic deuterium atoms, state-of-the-art\nmicrocalorimeters can distinguish them.\n","subjects":["Physics/Atomic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}