{"id":"2407.20295","title":"Warped multifidelity Gaussian processes for data fusion of skewed\n  environmental data","authors":"Pietro Colombo, and Claire Miller and Xiaochen Yang and Ruth O'Donnell\n  and Paolo Maranzano","authorsParsed":[["Colombo","Pietro",""],["Miller","Claire",""],["Yang","Xiaochen",""],["O'Donnell","Ruth",""],["Maranzano","Paolo",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 10:02:31 GMT"}],"updateDate":"2024-07-31","timestamp":1722160951000,"abstract":"  Understanding the dynamics of climate variables is paramount for numerous\nsectors, like energy and environmental monitoring. This study focuses on the\ncritical need for a precise mapping of environmental variables for national or\nregional monitoring networks, a task notably challenging when dealing with\nskewed data. To address this issue, we propose a novel data fusion approach,\nthe \\textit{warped multifidelity Gaussian process} (WMFGP). The method performs\nprediction using multiple time-series, accommodating varying reliability and\nresolutions and effectively handling skewness. In an extended simulation\nexperiment the benefits and the limitations of the methods are explored, while\nas a case study, we focused on the wind speed monitored by the network of ARPA\nLombardia, one of the regional environmental agencies operting in Italy. ARPA\ngrapples with data gaps, and due to the connection between wind speed and air\nquality, it struggles with an effective air quality management. We illustrate\nthe efficacy of our approach in filling the wind speed data gaps through two\nextensive simulation experiments. The case study provides more informative wind\nspeed predictions crucial for predicting air pollutant concentrations,\nenhancing network maintenance, and advancing understanding of relevant\nmeteorological and climatic phenomena.\n","subjects":["Statistics/Applications","Statistics/Computation","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AcAG5YXNuHiHCZKXSOCvI_O2jNWDoWfJIZzItt5tg5M","pdfSize":"1250003"}
