{"id":"2407.11078","title":"Overcoming Catastrophic Forgetting in Federated Class-Incremental\n  Learning via Federated Global Twin Generator","authors":"Thinh Nguyen, Khoa D Doan, Binh T. Nguyen, Danh Le-Phuoc, Kok-Seng\n  Wong","authorsParsed":[["Nguyen","Thinh",""],["Doan","Khoa D",""],["Nguyen","Binh T.",""],["Le-Phuoc","Danh",""],["Wong","Kok-Seng",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 08:23:21 GMT"}],"updateDate":"2024-07-17","timestamp":1720859001000,"abstract":"  Federated Class-Incremental Learning (FCIL) increasingly becomes important in\nthe decentralized setting, where it enables multiple participants to\ncollaboratively train a global model to perform well on a sequence of tasks\nwithout sharing their private data. In FCIL, conventional Federated Learning\nalgorithms such as FedAVG often suffer from catastrophic forgetting, resulting\nin significant performance declines on earlier tasks. Recent works, based on\ngenerative models, produce synthetic images to help mitigate this issue across\nall classes, but these approaches' testing accuracy on previous classes is\nstill much lower than recent classes, i.e., having better plasticity than\nstability. To overcome these issues, this paper presents Federated Global Twin\nGenerator (FedGTG), an FCIL framework that exploits privacy-preserving\ngenerative-model training on the global side without accessing client data.\nSpecifically, the server trains a data generator and a feature generator to\ncreate two types of information from all seen classes, and then it sends the\nsynthetic data to the client side. The clients then use\nfeature-direction-controlling losses to make the local models retain knowledge\nand learn new tasks well. We extensively analyze the robustness of FedGTG on\nnatural images, as well as its ability to converge to flat local minima and\nachieve better-predicting confidence (calibration). Experimental results on\nCIFAR-10, CIFAR-100, and tiny-ImageNet demonstrate the improvements in accuracy\nand forgetting measures of FedGTG compared to previous frameworks.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"umeWAToOljJhWx45mkrMUdtAQi85F82zDAyoEZOWI8o","pdfSize":"4199222"}
