{"id":"2407.03451","title":"The Role of Privacy Guarantees in Voluntary Donation of Private Data for\n  Altruistic Goals","authors":"Ruizhe Wang, Roberta De Viti, Aarushi Dubey, Elissa M. Redmiles","authorsParsed":[["Wang","Ruizhe",""],["De Viti","Roberta",""],["Dubey","Aarushi",""],["Redmiles","Elissa M.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:50:48 GMT"}],"updateDate":"2024-07-08","timestamp":1720032648000,"abstract":"  Voluntary donation of private information for altruistic purposes, such as\nadvancing research, is common. However, concerns about data misuse and leakage\nmay deter individuals from donating their information. While prior research has\nindicated that Privacy Enhancement Technologies (PETs) can alleviate these\nconcerns, the extent to which these techniques influence willingness to donate\ndata remains unclear.\n  This study conducts a vignette survey (N=485) to examine people's willingness\nto donate medical data for developing new treatments under four privacy\nguarantees: data expiration, anonymization, use restriction, and access\ncontrol. The study explores two mechanisms for verifying these guarantees:\nself-auditing and expert auditing, and evaluates the impact on two types of\ndata recipient entities: for-profit and non-profit institutions.\n  Our findings reveal that the type of entity collecting data strongly\ninfluences respondents' privacy expectations, which in part influence their\nwillingness to donate data. Respondents have such high expectations of the\nprivacy provided by non-profit entities that explicitly stating the privacy\nprotections provided makes little adjustment to those expectations. In\ncontrast, statements about privacy bring respondents' expectations of the\nprivacy provided by for-profit entities nearly in-line with non-profit\nexpectations. We highlight the risks of these respective results as well as the\nneed for future research to better align technical community and end-user\nperceptions about the effectiveness of auditing PETs and to effectively set\nexpectations about the efficacy of PETs in the face of end-user concerns about\ndata breaches.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}