{"id":"2407.12898","title":"JWST reveals a rapid and strong day side variability of 55 Cancri e","authors":"J. A. Patel, A. Brandeker, D. Kitzmann, D. J. M. Petit dit de la\n  Roche, A. Bello-Arufe, K. Heng, E. Meier Vald\\'es, C. M. Persson, M. Zhang,\n  B. -O. Demory, V. Bourrier, A. Deline, D. Ehrenreich, M. Fridlund, R. Hu, M.\n  Lendl, A. V. Oza, Y. Alibert, M. J. Hooton","authorsParsed":[["Patel","J. A.",""],["Brandeker","A.",""],["Kitzmann","D.",""],["de la Roche","D. J. M. Petit dit",""],["Bello-Arufe","A.",""],["Heng","K.",""],["Valdés","E. Meier",""],["Persson","C. M.",""],["Zhang","M.",""],["Demory","B. -O.",""],["Bourrier","V.",""],["Deline","A.",""],["Ehrenreich","D.",""],["Fridlund","M.",""],["Hu","R.",""],["Lendl","M.",""],["Oza","A. V.",""],["Alibert","Y.",""],["Hooton","M. J.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 17:53:15 GMT"}],"updateDate":"2024-07-19","timestamp":1721238795000,"abstract":"  The nature of the close-in rocky planet 55 Cnc e is puzzling despite having\nbeen observed extensively. Its optical and infrared occultation depths show\ntemporal variability, in addition to a phase curve variability observed in the\noptical. We wish to explore the possibility that the variability originates\nfrom the planet being in a 3:2 spin-orbit resonance, thus showing different\nsides during occultations. We proposed and were awarded Cycle 1 time at the\nJames Webb Space Telescope (JWST) to test this hypothesis. JWST/NIRCam observed\nfive occultations (secondary eclipses), of which four were observed within a\nweek, of the planet simultaneously at 2.1 and 4.5 {\\mu}m. While the former\ngives band-integrated photometry, the latter provides a spectrum between\n3.9-5.0 {\\mu}m. We find that the occultation depths in both bandpasses are\nhighly variable and change between a non-detection (-5 +/- 6 ppm and 7 +/- 9\nppm) to 96 +/- 8 ppm and 119 (+34) (-19) ppm at 2.1 {\\mu}m and 4.5 {\\mu}m,\nrespectively. Interestingly, the variations in both bandpasses are not\ncorrelated and do not support the 3:2 spin-orbit resonance explanation. The\nmeasured brightness temperature at 4.5 {\\mu}m varies between 873-2256 K and is\nlower than the expected dayside temperature of bare rock with no heat\nre-distribution (2500 K) which is indicative of an atmosphere. Our atmospheric\nretrieval analysis of occultation depth spectra at 4.5 {\\mu}m finds that\ndifferent visits statistically favour various atmospheric scenarios including a\nthin outgassed CO/CO2 atmosphere and a silicate rock vapour atmosphere. Some\nvisits even support a flat line model. The observed variability could be\nexplained by stochastic outgassing of CO/CO2, which is also hinted by\nretrievals. Alternatively, the variability, observed at both 2.1 and 4.5\n{\\mu}m, could be the result of a circumstellar patchy dust torus generated by\nvolcanism on the planet.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GQ81tC3C1OcEs4aCgGG45vT4UwgRfeHa8LpbEh59fnI","pdfSize":"8694824"}
