{"id":"2407.12640","title":"Profiling quantum circuits for their efficient execution on single- and\n  multi-core architectures","authors":"Medina Bandic, Pablo le Henaff, Anabel Ovide, Pau Escofet, Sahar Ben\n  Rached, Santiago Rodrigo, Hans van Someren, Sergi Abadal, Eduard Alarcon,\n  Carmen G. Almudever, Sebastian Feld","authorsParsed":[["Bandic","Medina",""],["Henaff","Pablo le",""],["Ovide","Anabel",""],["Escofet","Pau",""],["Rached","Sahar Ben",""],["Rodrigo","Santiago",""],["van Someren","Hans",""],["Abadal","Sergi",""],["Alarcon","Eduard",""],["Almudever","Carmen G.",""],["Feld","Sebastian",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:08:50 GMT"}],"updateDate":"2024-07-18","timestamp":1721228930000,"abstract":"  Application-specific quantum computers offer the most efficient means to\ntackle problems intractable by classical computers. Realizing these\narchitectures necessitates a deep understanding of quantum circuit properties\nand their relationship to execution outcomes on quantum devices. Our study aims\nto perform for the first time a rigorous examination of quantum circuits by\nintroducing graph theory-based metrics extracted from their qubit interaction\ngraph and gate dependency graph alongside conventional parameters describing\nthe circuit itself. This methodology facilitates a comprehensive analysis and\nclustering of quantum circuits. Furthermore, it uncovers a connection between\nparameters rooted in both qubit interaction and gate dependency graphs, and the\nperformance metrics for quantum circuit mapping, across a range of established\nquantum device and mapping configurations. Among the various device\nconfigurations, we particularly emphasize modular (i.e., multi-core) quantum\ncomputing architectures due to their high potential as a viable solution for\nquantum device scalability. This thorough analysis will help us to: i) identify\nkey attributes of quantum circuits that affect the quantum circuit mapping\nperformance metrics; ii) predict the performance on a specific chip for similar\ncircuit structures; iii) determine preferable combinations of mapping\ntechniques and hardware setups for specific circuits; and iv) define\nrepresentative benchmark sets by clustering similarly structured circuits.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Emerging Technologies","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}