{"id":"2407.19863","title":"Before and After Blockchain: Development and Principles of Distributed\n  Fault-Tolerant Consensus","authors":"Huanyu Wu, Chentao Yue, Yixuan Fan, Yonghui Li, Lei Zhang","authorsParsed":[["Wu","Huanyu",""],["Yue","Chentao",""],["Fan","Yixuan",""],["Li","Yonghui",""],["Zhang","Lei",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 10:32:38 GMT"},{"version":"v2","created":"Sat, 3 Aug 2024 16:31:36 GMT"}],"updateDate":"2024-08-06","timestamp":1722249158000,"abstract":"  The concept of distributed consensus gained widespread attention following\nthe publication of \"Byzantine Generals Problem\" by Leslie Lamport in the 1980s.\nThis research topic has been active and extensively studied over the last four\ndecades, particularly since the advent of blockchain technology in 2009.\nBlockchain technology employs Proof-of-X (PoX) or Byzantine-fault-tolerant\n(BFT) systems, where all participants follow a protocol to achieve a common\nstate (i.e., consistency) eventually. However, because PoX consensus such as\nProof-of-Work is is resource-intensive with high power consumption, most\npermissioned blockchains employ BFT to achieve consistency. In this article, we\nprovide an introduction to the fundamental principles and history of\ndistributed consensus. We then explore the well-known fault-tolerant state\nmachine replication (SMR) in partially synchronous networks, as well as\nconsensus protocols in asynchronous models and recently proposed DAG-based\nconsensus. Additionally, we examine the relationship between BFT consensus and\nblockchain technology and discuss the following questions: What is the history\nand evolution of BFT? Why are BFT protocols designed in the way they are and\nwhat core components do they use? What is the connection between BFT and\nblockchain technology, and what are the driving needs for future BFT research?\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}