{"id":"2407.05575","title":"Towards Reflected Object Detection: A Benchmark","authors":"Zhongtian Wang, You Wu, Hui Zhou, and Shuiwang Li","authorsParsed":[["Wang","Zhongtian",""],["Wu","You",""],["Zhou","Hui",""],["Li","Shuiwang",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 03:16:05 GMT"}],"updateDate":"2024-07-09","timestamp":1720408565000,"abstract":"  Object detection has greatly improved over the past decade thanks to advances\nin deep learning and large-scale datasets. However, detecting objects reflected\nin surfaces remains an underexplored area. Reflective surfaces are ubiquitous\nin daily life, appearing in homes, offices, public spaces, and natural\nenvironments. Accurate detection and interpretation of reflected objects are\nessential for various applications. This paper addresses this gap by\nintroducing a extensive benchmark specifically designed for Reflected Object\nDetection. Our Reflected Object Detection Dataset (RODD) features a diverse\ncollection of images showcasing reflected objects in various contexts,\nproviding standard annotations for both real and reflected objects. This\ndistinguishes it from traditional object detection benchmarks. RODD encompasses\n10 categories and includes 21,059 images of real and reflected objects across\ndifferent backgrounds, complete with standard bounding box annotations and the\nclassification of objects as real or reflected. Additionally, we present\nbaseline results by adapting five state-of-the-art object detection models to\naddress this challenging task. Experimental results underscore the limitations\nof existing methods when applied to reflected object detection, highlighting\nthe need for specialized approaches. By releasing RODD, we aim to support and\nadvance future research on detecting reflected objects. Dataset and code are\navailable at: https: //github.com/Tqybu-hans/RODD.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}