{"id":"2407.12079","title":"New insights into the internal structure of GJ 1214 b informed by JWST","authors":"Matthew C. Nixon, Anjali A. A. Piette, Eliza M.-R. Kempton, Peter Gao,\n  Jacob L. Bean, Maria E. Steinrueck, Alexandra S. Mahajan, Jason D. Eastman,\n  Michael Zhang and Leslie A. Rogers","authorsParsed":[["Nixon","Matthew C.",""],["Piette","Anjali A. A.",""],["Kempton","Eliza M. -R.",""],["Gao","Peter",""],["Bean","Jacob L.",""],["Steinrueck","Maria E.",""],["Mahajan","Alexandra S.",""],["Eastman","Jason D.",""],["Zhang","Michael",""],["Rogers","Leslie A.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-18","timestamp":1721152800000,"abstract":"  Recent JWST observations of the sub-Neptune GJ 1214 b suggest that it hosts a\nhigh-metallicity (>100x solar), hazy atmosphere. Emission spectra of the planet\nshow molecular absorption features, most likely due to atmospheric H2O. In\nlight of this new information, we conduct a thorough reevaluation of the\nplanet's internal structure. We consider interior models with mixed H/He/H2O\nenvelopes of varying composition, informed by atmospheric constraints from the\nJWST phase curve, in order to determine possible bulk compositions and internal\nstructures. Self-consistent atmospheric models consistent with the JWST\nobservations are used to set boundary conditions for the interior. We find that\na total envelope mass fraction of at least 8.1% is required to explain the\nplanet's mass and radius. Regardless of H2O content, the maximum H/He mass\nfraction of the planet is 5.8%. We find that a 1:1 ice-to-rock ratio along with\n3.4-4.8% H/He is also a permissible solution. In addition, we consider a pure\nH2O (steam) envelope and find that such a scenario is possible, albeit with a\nhigh ice-to-rock ratio of at least 3.76:1, which may be unrealistic from a\nplanet formation standpoint. We discuss possible formation pathways for the\ndifferent internal structures that are consistent with observations. Since our\nresults depend strongly on the atmospheric composition and haze properties,\nmore precise observations of the planet's atmosphere would allow for further\nconstraints on its internal structure. This type of analysis can be applied to\nany sub-Neptune with atmospheric constraints to better understand its interior.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}