{"id":"2407.05363","title":"Multi-branch Collaborative Learning Network for 3D Visual Grounding","authors":"Zhipeng Qian, Yiwei Ma, Zhekai Lin, Jiayi Ji, Xiawu Zheng, Xiaoshuai\n  Sun, Rongrong Ji","authorsParsed":[["Qian","Zhipeng",""],["Ma","Yiwei",""],["Lin","Zhekai",""],["Ji","Jiayi",""],["Zheng","Xiawu",""],["Sun","Xiaoshuai",""],["Ji","Rongrong",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 13:27:14 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 11:31:50 GMT"}],"updateDate":"2024-07-11","timestamp":1720358834000,"abstract":"  3D referring expression comprehension (3DREC) and segmentation (3DRES) have\noverlapping objectives, indicating their potential for collaboration. However,\nexisting collaborative approaches predominantly depend on the results of one\ntask to make predictions for the other, limiting effective collaboration. We\nargue that employing separate branches for 3DREC and 3DRES tasks enhances the\nmodel's capacity to learn specific information for each task, enabling them to\nacquire complementary knowledge. Thus, we propose the MCLN framework, which\nincludes independent branches for 3DREC and 3DRES tasks. This enables dedicated\nexploration of each task and effective coordination between the branches.\nFurthermore, to facilitate mutual reinforcement between these branches, we\nintroduce a Relative Superpoint Aggregation (RSA) module and an Adaptive Soft\nAlignment (ASA) module. These modules significantly contribute to the precise\nalignment of prediction results from the two branches, directing the module to\nallocate increased attention to key positions. Comprehensive experimental\nevaluation demonstrates that our proposed method achieves state-of-the-art\nperformance on both the 3DREC and 3DRES tasks, with an increase of 2.05% in\nAcc@0.5 for 3DREC and 3.96% in mIoU for 3DRES.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}