{"id":"2407.18947","title":"Real-Time Coupled Cluster Theory with Approximate Triples","authors":"Zhe Wang (1), H{\\aa}kon Emil Kristiansen (2), Thomas Bondo Pedersen\n  (2) and T. Daniel Crawford (1) ((1) Department of Chemistry, Virginia Tech,\n  Blacksburg, USA (2) Hylleraas Centre for Quantum Molecular Sciences,\n  Department of Chemistry, University of Oslo, Oslo, Norway)","authorsParsed":[["Wang","Zhe",""],["Kristiansen","Håkon Emil",""],["Pedersen","Thomas Bondo",""],["Crawford","T. Daniel",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 15:10:26 GMT"}],"updateDate":"2024-07-30","timestamp":1720710626000,"abstract":"  The formalism of real-time (RT) methods has been well-established during\nrecent years, while no inclusion beyond the double excitation has been\ndiscussed. In this article, we introduce an implementation of real-time coupled\ncluster singles, doubles and approximate triples (CC3) method to explore the\npotential of a high excitation level. The CC3 method is well-known for its\nadvantages in calculating dynamic properties and combining with the response\ntheory. It is a well-qualified candidate for handling the interaction between\nthe system and the applied field, and therefore suitable for a RT\nimplementation. The derivation and implementation are first demonstrated\nfollowing applications on calculating frequency-dependent properties. Terms\nwith triples are calculated and added upon the existing CCSD equations, giving\nthe method a formally $N^{7}$ scaling. The Graphics Processing Unit (GPU)\naccelerated implementation is utilized to reduce the computational cost. It is\nbeen verified that the GPU implementation can speed up the calculation by up to\na factor of 17 for water cluster test cases. Additionally, the single-precision\narithmetic is used and compared to the conventional double-precision\narithmetic. No significant difference is found in the polarizabilities and $G'$\ntensor results, but a higher percentage error for the first\nhyperpolarizabilities is observed. Compared to the linear response (LR) CC3\nresults, the percentage errors of RT-CC3 polarizabilities and RT-CC3 first\nhyperpolarizabilities are under 0.1% and 1%, respectively for the\n$H_2O$/cc-pVDZ test case. Furthermore, a discussion on the calculation of\npolarizabilities is included, which compares RT-CC3 with RT-CCSD and\ntime-dependent nonorthogonal orbital-optimized coupled cluster doubles\n(TDNOCCD), in order to examine the performance of RT-CC3 and the\norbital-optimization effect using a group of ten-electron systems.\n","subjects":["Physics/Chemical Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}