{"id":"2407.09051","title":"DroneMOT: Drone-based Multi-Object Tracking Considering Detection\n  Difficulties and Simultaneous Moving of Drones and Objects","authors":"Peng Wang, Yongcai Wang, Deying Li","authorsParsed":[["Wang","Peng",""],["Wang","Yongcai",""],["Li","Deying",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 07:18:18 GMT"}],"updateDate":"2024-07-15","timestamp":1720768698000,"abstract":"  Multi-object tracking (MOT) on static platforms, such as by surveillance\ncameras, has achieved significant progress, with various paradigms providing\nattractive performances. However, the effectiveness of traditional MOT methods\nis significantly reduced when it comes to dynamic platforms like drones. This\ndecrease is attributed to the distinctive challenges in the MOT-on-drone\nscenario: (1) objects are generally small in the image plane, blurred, and\nfrequently occluded, making them challenging to detect and recognize; (2)\ndrones move and see objects from different angles, causing the unreliability of\nthe predicted positions and feature embeddings of the objects. This paper\nproposes DroneMOT, which firstly proposes a Dual-domain Integrated Attention\n(DIA) module that considers the fast movements of drones to enhance the\ndrone-based object detection and feature embedding for small-sized, blurred,\nand occluded objects. Then, an innovative Motion-Driven Association (MDA)\nscheme is introduced, considering the concurrent movements of both the drone\nand the objects. Within MDA, an Adaptive Feature Synchronization (AFS)\ntechnique is presented to update the object features seen from different\nangles. Additionally, a Dual Motion-based Prediction (DMP) method is employed\nto forecast the object positions. Finally, both the refined feature embeddings\nand the predicted positions are integrated to enhance the object association.\nComprehensive evaluations on VisDrone2019-MOT and UAVDT datasets show that\nDroneMOT provides substantial performance improvements over the\nstate-of-the-art in the domain of MOT on drones.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}