{"id":"2407.11459","title":"RIMformer: An End-to-End Transformer for FMCW Radar Interference\n  Mitigation","authors":"Ziang Zhang, Guangzhi Chen, Youlong Weng, Shunchuan Yang, Zhiyu Jia\n  and Jingxuan Chen","authorsParsed":[["Zhang","Ziang",""],["Chen","Guangzhi",""],["Weng","Youlong",""],["Yang","Shunchuan",""],["Jia","Zhiyu",""],["Chen","Jingxuan",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 07:51:20 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 05:01:27 GMT"}],"updateDate":"2024-07-18","timestamp":1721116280000,"abstract":"  Frequency-modulated continuous-wave (FMCW) radar plays a pivotal role in the\nfield of remote sensing. The increasing degree of FMCW radar deployment has\nincreased the mutual interference, which weakens the detection capabilities of\nradars and threatens reliability and safety of systems. In this paper, a novel\nFMCW radar interference mitigation (RIM) method, termed as RIMformer, is\nproposed by using an end-to-end Transformer-based structure. In the RIMformer,\na dual multi-head self-attention mechanism is proposed to capture the\ncorrelations among the distinct distance elements of intermediate frequency\n(IF) signals. Additionally, an improved convolutional block is integrated to\nharness the power of convolution for extracting local features. The\narchitecture is designed to process time-domain IF signals in an end-to-end\nmanner, thereby avoiding the need for additional manual data processing steps.\nThe improved decoder structure ensures the parallelization of the network to\nincrease its computational efficiency. Simulation and measurement experiments\nare carried out to validate the accuracy and effectiveness of the proposed\nmethod. The results show that the proposed RIMformer can effectively mitigate\ninterference and restore the target signals.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}