{"id":"2407.09799","title":"The disc origin of the Milky Way bulge: On the high velocity dispersion\n  of metal-rich stars at low latitude","authors":"Tristan Boin, Paola Di Matteo, Sergey Khoperskov, Francesca Fragkoudi,\n  Soumavo Ghosh, Fran\\c{c}oise Combes, Misha Haywood and David Katz","authorsParsed":[["Boin","Tristan",""],["Di Matteo","Paola",""],["Khoperskov","Sergey",""],["Fragkoudi","Francesca",""],["Ghosh","Soumavo",""],["Combes","Françoise",""],["Haywood","Misha",""],["Katz","David",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 08:03:31 GMT"}],"updateDate":"2024-07-16","timestamp":1720857811000,"abstract":"  Previous studies of the chemo-kinematic properties of stars in the Galactic\nbulge have revealed a puzzling trend. Along the bulge minor axis, and close to\nthe Galactic plane, metal-rich stars display a higher line-of-sight velocity\ndispersion compared to metal-poor stars, while at higher latitudes metal-rich\nstars have lower velocity dispersions than metal-poor stars, similar to what is\nfound in the Galactic disc. In this work, we re-examine this issue, by studying\nthe dependence of line-of-sight velocity dispersions on metallicity and\nlatitude in the latest APOGEE Data Release 17, confirming the results of\nprevious works. We then analyse an N-body simulation of a Milky Way-like\ngalaxy, also taking into account observational biases introduced by the APOGEE\nselection function. We show that the inversion in the line-of-sight velocity\ndispersion-latitude relation observed in the Galactic bulge can be reproduced\nby our model. We show that this inversion is a natural consequence of a\nscenario in which the bulge is a boxy/peanut-shaped structure, whose metal-rich\nand metal-poor stars mainly originate from the thin and thick disc of the Milky\nWay, respectively. Due to their cold kinematics, metal-rich, thin disc stars,\nare efficiently trapped in the boxy/peanut bulge, and, at low latitudes, show a\nstrong barred morphology, which results in high velocity dispersions which are\nlarger than those attained by the metal-poor populations. Extremely metal-rich\nstars in the Galactic bulge, which have received renewed attention in the\nliterature, do follow the same trends as those of the metal-rich populations.\nThe line-of-sight velocity-latitude relation observed in the Galactic bulge for\nmetal-poor and metal-rich stars are thus both an effect of the intrinsic nature\nof the Galactic bulge and of the angle at which we observe it from the Sun.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}