{"id":"2407.01995","title":"Suppression of noise in separation estimation of optical sources with\n  spatial-mode demultiplexing","authors":"Fattah Sakuldee, and {\\L}ukasz Rudnicki","authorsParsed":[["Sakuldee","Fattah",""],["Rudnicki","Łukasz",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 07:08:26 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 16:06:37 GMT"}],"updateDate":"2024-07-23","timestamp":1719904106000,"abstract":"  Spatial mode demultiplexing was proved to be a successful tool for estimation\nof the separation between incoherent sources, allowing for sensitivity much\nbelow the Rayleigh limit. However, with the presence of measurement's noise,\nsuperresolution brought by this technique deteriorates rapidly. On a formal\nground, this can be seen in terms of, so called, Rayleigh curse known from\ndirect imaging, which while being absent for ideal spatial mode demultiplexing,\ngoes back in a noisy scenario. In this article, we develop a formal procedure\nto suppress the destructive effect of the noise, proposing a procedure\neffectively working as an error correction. For noise models given by a random\nunitary channel generated by a polynomial of creation and annihilation\noperators, we demonstrate that perfect noise decoupling can be reached by\nrepeating the mode demultiplexers and intervening them by a group of rotations,\nin the limit of a large number of repetitions and small noise strength. For a\nspecial case of displacement noise, our solution is simplified: by using the\ndemultiplexer twice, and interlacing it by a parity operator, given that the\nnoise configuration is frozen between the first and the second step, a perfect\ndecoupling can be achieved. This allows for a recovery of superresolution for a\nspecial class of noise generated by displacement operators. Furthermore, for a\nstrong noise correlation between these two steps, our protocol provides an\nimproved measurement resolution.\n","subjects":["Physics/Quantum Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/"}