{"id":"2407.19961","title":"Prichain II: CloudGuardian Cloud Security Proposal with Blockchain","authors":"Rodrigo Craveiro Rodrigues, Pedro Miguel Calhau Mateus, Valderi Reis\n  Quietinho Leithardt","authorsParsed":[["Rodrigues","Rodrigo Craveiro",""],["Mateus","Pedro Miguel Calhau",""],["Leithardt","Valderi Reis Quietinho",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 12:52:27 GMT"}],"updateDate":"2024-07-30","timestamp":1722257547000,"abstract":"  With the advancement of cloud computing, data storage, and security have\nbecome crucial. The growing adoption of cloud services by companies,\naccompanied by increased threats from cybersecurity, highlights the importance\nof privacy and ownership of user data. Between 2022 and 2023, there has been an\nincrease of around 48% in cloud security threats, emphasizing the urgent need\nfor strong security solutions. To face these challenges, in this project, we\npropose integrating the Ethereum network's blockchain technology with a\ndatabase located in the PostgreSQL cloud. The proposed solution aims to provide\nbidirectional data synchronization and strict control of access mechanisms.\nBlockchain technology ensures immutability and transparency of transactions,\nwhile PostgreSQL provides efficient and scalable storage. Through rigorous\ntesting in an adaptive traffic control scenario, the results obtained indicate\nthat this solution offers a significantly high level of security due to the\ndecentralization of data, confirming that this solution is effective, and\nmaking it a powerful new option to improve security in cloud environments. In\nconclusion, the solution proposed in this project not only increases\ninformation security but also demonstrates the practical feasibility of\nintegrating blockchain with cloud relational databases. This two-way alignment\nimproves protection against cyberattacks and ensures that user data is\nprotected from unauthorized access and malicious changes.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/"}