{"id":"2407.04246","title":"Conformally covariant probabilities, operator product expansions, and\n  logarithmic correlations in two-dimensional critical percolation","authors":"Federico Camia, Yu Feng","authorsParsed":[["Camia","Federico",""],["Feng","Yu",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 04:18:05 GMT"}],"updateDate":"2024-07-08","timestamp":1720153085000,"abstract":"  The large-scale behavior of two-dimensional critical percolation is expected\nto be described by a conformal field theory (CFT). Moreover, this putative\npercolation CFT is believed to be of the logarithmic type, exhibiting\nlogarithmic corrections to the most commonly encountered and studied behavior\nof CFT correlations.\n  It was recently shown by the first author [Cam24] that critical connection\nprobabilities, when appropriately rescaled, have a well-defined and conformally\ncovariant scaling limit and therefore behave like CFT correlation functions.\nWhile constructing a full-fledged percolation CFT is still an open problem, in\nthis paper we prove various CFT features of the scaling limit of\ntwo-dimensional critical percolation.\n  We identify several connectivity events, including arm-events and the events\nthat a vertex is pivotal or belongs to the percolation backbone, whose\nprobabilities have conformally covariant scaling limits and can be interpreted\nas CFT correlation functions.\n  For some of the probabilities mentioned above, we prove asymptotic expansions\nthat can be interpreted as CFT operator product expansions (OPEs) and provide\nrigorous versions of CFT fusion rules.\n  In some of the probabilities mentioned above, we identify logarithmic\nsingularities, providing the first rigorous confirmation of similar predictions\nmade in the physics literature and establishing the logarithmic nature of the\nputative percolation CFT.\n  The latter result is particularly interesting because, while logarithmic CFTs\nare more complex and less studied than ordinary CFTs, they have attracted\nconsiderable attention in recent years due to their role in the analysis of\nimportant physical models and phenomena, such as, besides percolation, the\nWess-Zumino-Witten (WZW) model, the quantum Hall effect, disordered critical\nsystems, self-avoiding polymers, and the Fortuin-Kasteleyn (FK) model.\n","subjects":["Physics/Mathematical Physics","Mathematics/Mathematical Physics","Mathematics/Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}