{"id":"2407.19139","title":"Multi-Expert Adaptive Selection: Task-Balancing for All-in-One Image\n  Restoration","authors":"Xiaoyan Yu, Shen Zhou, Huafeng Li and Liehuang Zhu","authorsParsed":[["Yu","Xiaoyan",""],["Zhou","Shen",""],["Li","Huafeng",""],["Zhu","Liehuang",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 01:13:07 GMT"}],"updateDate":"2024-07-30","timestamp":1722042787000,"abstract":"  The use of a single image restoration framework to achieve multi-task image\nrestoration has garnered significant attention from researchers. However,\nseveral practical challenges remain, including meeting the specific and\nsimultaneous demands of different tasks, balancing relationships between tasks,\nand effectively utilizing task correlations in model design. To address these\nchallenges, this paper explores a multi-expert adaptive selection mechanism. We\nbegin by designing a feature representation method that accounts for both the\npixel channel level and the global level, encompassing low-frequency and\nhigh-frequency components of the image. Based on this method, we construct a\nmulti-expert selection and ensemble scheme. This scheme adaptively selects the\nmost suitable expert from the expert library according to the content of the\ninput image and the prompts of the current task. It not only meets the\nindividualized needs of different tasks but also achieves balance and\noptimization across tasks. By sharing experts, our design promotes\ninterconnections between different tasks, thereby enhancing overall performance\nand resource utilization. Additionally, the multi-expert mechanism effectively\neliminates irrelevant experts, reducing interference from them and further\nimproving the effectiveness and accuracy of image restoration. Experimental\nresults demonstrate that our proposed method is both effective and superior to\nexisting approaches, highlighting its potential for practical applications in\nmulti-task image restoration.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}