{"id":"2407.19724","title":"Constructing artificial life and materials scientists with accelerated\n  AI using Deep AndersoNN","authors":"Saleem Abdul Fattah Ahmed Al Dajani, David Keyes","authorsParsed":[["Dajani","Saleem Abdul Fattah Ahmed Al",""],["Keyes","David",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 06:12:47 GMT"}],"updateDate":"2024-07-30","timestamp":1722233567000,"abstract":"  Deep AndersoNN accelerates AI by exploiting the continuum limit as the number\nof explicit layers in a neural network approaches infinity and can be taken as\na single implicit layer, known as a deep equilibrium model. Solving for deep\nequilibrium model parameters reduces to a nonlinear fixed point iteration\nproblem, enabling the use of vector-to-vector iterative solvers and windowing\ntechniques, such as Anderson extrapolation, for accelerating convergence to the\nfixed point deep equilibrium. Here we show that Deep AndersoNN achieves up to\nan order of magnitude of speed-up in training and inference. The method is\ndemonstrated on density functional theory results for industrial applications\nby constructing artificial life and materials `scientists' capable of\nclassifying drugs as strongly or weakly polar, metal-organic frameworks by pore\nsize, and crystalline materials as metals, semiconductors, and insulators,\nusing graph images of node-neighbor representations transformed from atom-bond\nnetworks. Results exhibit accuracy up to 98\\% and showcase synergy between Deep\nAndersoNN and machine learning capabilities of modern computing architectures,\nsuch as GPUs, for accelerated computational life and materials science by\nquickly identifying structure-property relationships. This paves the way for\nsaving up to 90\\% of compute required for AI, reducing its carbon footprint by\nup to 60 gigatons per year by 2030, and scaling above memory limits of explicit\nneural networks in life and materials science, and beyond.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}