{"id":"2407.18626","title":"Every Part Matters: Integrity Verification of Scientific Figures Based\n  on Multimodal Large Language Models","authors":"Xiang Shi, Jiawei Liu, Yinpeng Liu, Qikai Cheng, Wei Lu","authorsParsed":[["Shi","Xiang",""],["Liu","Jiawei",""],["Liu","Yinpeng",""],["Cheng","Qikai",""],["Lu","Wei",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 09:35:36 GMT"}],"updateDate":"2024-07-29","timestamp":1721986536000,"abstract":"  This paper tackles a key issue in the interpretation of scientific figures:\nthe fine-grained alignment of text and figures. It advances beyond prior\nresearch that primarily dealt with straightforward, data-driven visualizations\nsuch as bar and pie charts and only offered a basic understanding of diagrams\nthrough captioning and classification. We introduce a novel task, Figure\nIntegrity Verification, designed to evaluate the precision of technologies in\naligning textual knowledge with visual elements in scientific figures. To\nsupport this, we develop a semi-automated method for constructing a large-scale\ndataset, Figure-seg, specifically designed for this task. Additionally, we\npropose an innovative framework, Every Part Matters (EPM), which leverages\nMultimodal Large Language Models (MLLMs) to not only incrementally improve the\nalignment and verification of text-figure integrity but also enhance integrity\nthrough analogical reasoning. Our comprehensive experiments show that these\ninnovations substantially improve upon existing methods, allowing for more\nprecise and thorough analysis of complex scientific figures. This progress not\nonly enhances our understanding of multimodal technologies but also stimulates\nfurther research and practical applications across fields requiring the\naccurate interpretation of complex visual data.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Digital Libraries","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}