{"id":"2407.10442","title":"Inference at the data's edge: Gaussian processes for modeling and\n  inference under model-dependency, poor overlap, and extrapolation","authors":"Soonhong Cho, Doeun Kim, Chad Hazlett","authorsParsed":[["Cho","Soonhong",""],["Kim","Doeun",""],["Hazlett","Chad",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 05:09:50 GMT"}],"updateDate":"2024-07-16","timestamp":1721020190000,"abstract":"  The Gaussian Process (GP) is a highly flexible non-linear regression approach\nthat provides a principled approach to handling our uncertainty over predicted\n(counterfactual) values. It does so by computing a posterior distribution over\npredicted point as a function of a chosen model space and the observed data, in\ncontrast to conventional approaches that effectively compute uncertainty\nestimates conditionally on placing full faith in a fitted model. This is\nespecially valuable under conditions of extrapolation or weak overlap, where\nmodel dependency poses a severe threat. We first offer an accessible\nexplanation of GPs, and provide an implementation suitable to social science\ninference problems. In doing so we reduce the number of user-chosen\nhyperparameters from three to zero. We then illustrate the settings in which\nGPs can be most valuable: those where conventional approaches have poor\nproperties due to model-dependency/extrapolation in data-sparse regions.\nSpecifically, we apply it to (i) comparisons in which treated and control\ngroups have poor covariate overlap; (ii) interrupted time-series designs, where\nmodels are fitted prior to an event by extrapolated after it; and (iii)\nregression discontinuity, which depends on model estimates taken at or just\nbeyond the edge of their supporting data.\n","subjects":["Statistics/Methodology","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1y-zAyUC4eZqiX5eN_Kjr4FLrwfyUipm2M4D-xOLfVE","pdfSize":"8949365","objectId":"0xd8fde1a590f8b3a3d991680dd1c1c86ff17ac9e99918476ebdb2a6e62b900ddc","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
