{"id":"2407.02838","title":"Designing Superionic Conductors Using Tetrahedrally Packed Structures","authors":"Tomoyasu Yokoyama, Kazuhide Ichikawa, Takuya Naruse, Kosei Ohura,\n  Yukihiro Kaneko","authorsParsed":[["Yokoyama","Tomoyasu",""],["Ichikawa","Kazuhide",""],["Naruse","Takuya",""],["Ohura","Kosei",""],["Kaneko","Yukihiro",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 06:34:40 GMT"},{"version":"v2","created":"Sat, 6 Jul 2024 07:44:17 GMT"}],"updateDate":"2024-07-09","timestamp":1719988480000,"abstract":"  In the pursuit of advanced energy storage solutions, the crystal structure of\nionic conductors plays a pivotal role in facilitating ion transport. The\nconventional structural design principle that compounds with the body-centered\ncubic (BCC) anionic frameworks have high ionic conductivity is well known. We\nhave extended the conventional design principle by uncovering that many of the\nanionic frameworks of Ag-ion conductors are characterized by tetrahedrally\npacked (TP) structures. Leveraging our findings, we have virtually screened TP\nframework compounds, uncovering their intrinsic potential for superior ionic\nconductivity through first-principles molecular dynamics simulations. Our\ndesign principle is applicable to Ag$^+$ and other mobile ions, including\nLi$^+$ and F$^-$. We proposed the Met2Ion method to generate ionic crystal\nstructures using metal crystal structures as templates and demonstrated that\nnew ionic conductors with TP frameworks can be discovered. This work paves the\nway for the discovery and development of next-generation energy storage\nmaterials with enhanced performance.\n","subjects":["Condensed Matter/Materials Science","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mVfF8q7M6PMYu8LuV-htzNjcr97ABWCCoRbOzdTvuZQ","pdfSize":"19693797","objectId":"0x6016720144546f12768c2f00cc3e3b06e8256449ee0b1e125a129e5f8957538b","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
