{"id":"2407.05592","title":"An Experimental Comparison of Transfer Learning against Self-supervised\n  Learning","authors":"Zehui Zhao, Laith Alzubaidi, Jinglan Zhang, Ye Duan, Usman Naseem,\n  Yuantong Gu","authorsParsed":[["Zhao","Zehui",""],["Alzubaidi","Laith",""],["Zhang","Jinglan",""],["Duan","Ye",""],["Naseem","Usman",""],["Gu","Yuantong",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 04:14:52 GMT"}],"updateDate":"2024-07-09","timestamp":1720412092000,"abstract":"  Recently, transfer learning and self-supervised learning have gained\nsignificant attention within the medical field due to their ability to mitigate\nthe challenges posed by limited data availability, improve model\ngeneralisation, and reduce computational expenses. Transfer learning and\nself-supervised learning hold immense potential for advancing medical research.\nHowever, it is crucial to recognise that transfer learning and self-supervised\nlearning architectures exhibit distinct advantages and limitations, manifesting\nvariations in accuracy, training speed, and robustness. This paper compares the\nperformance and robustness of transfer learning and self-supervised learning in\nthe medical field. Specifically, we pre-trained two models using the same\nsource domain datasets with different pre-training methods and evaluated them\non small-sized medical datasets to identify the factors influencing their final\nperformance. We tested data with several common issues in medical domains, such\nas data imbalance, data scarcity, and domain mismatch, through comparison\nexperiments to understand their impact on specific pre-trained models. Finally,\nwe provide recommendations to help users apply transfer learning and\nself-supervised learning methods in medical areas, and build more convenient\nand efficient deployment strategies.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9LBzth2XbvxEOBWwrd1mdhX3RQsk3dr2DqeMd_JJ-uc","pdfSize":"11270754"}
