{"id":"2407.03877","title":"Multiway Cuts with a Choice of Representatives","authors":"Krist\\'of B\\'erczi, Tam\\'as Kir\\'aly, Daniel P. Szabo","authorsParsed":[["Bérczi","Kristóf",""],["Király","Tamás",""],["Szabo","Daniel P.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 12:14:37 GMT"}],"updateDate":"2024-07-08","timestamp":1720095277000,"abstract":"  In this paper, we study several generalizations of multiway cut where the\nterminals can be chosen as \\emph{representatives} from sets of\n\\emph{candidates} $T_1,\\ldots,T_q$. In this setting, one is allowed to choose\nthese representatives so that the minimum-weight cut separating these sets\n\\emph{via their representatives} is as small as possible. We distinguish\ndifferent cases depending on (A) whether the representative of a candidate set\nhas to be separated from the other candidate sets completely or only from the\nrepresentatives, and (B) whether there is a single representative for each\ncandidate set or the choice of representative is independent for each pair of\ncandidate sets. For fixed $q$, we give approximation algorithms for each of\nthese problems that match the best known approximation guarantee for multiway\ncut. Our technical contribution is a new extension of the CKR relaxation that\npreserves approximation guarantees. For general $q$, we show $o(\\log\nq)$-inapproximability for all cases where the choice of representatives may\ndepend on the pair of candidate sets, as well as for the case where the goal is\nto separate a fixed node from a single representative from each candidate set.\nAs a positive result, we give a $2$-approximation algorithm for the case where\nwe need to choose a single representative from each candidate set. This is a\ngeneralization of the $(2-2/k)$-approximation for k-cut, and we can solve it by\nrelating the tree case to optimization over a gammoid.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}