{"id":"2407.07665","title":"The Solar and Geomagnetic Storms in May 2024: A Flash Data Report","authors":"Hisashi Hayakawa, Yusuke Ebihara, Alexander Mishev, Sergey Koldobskiy,\n  Kanya Kusano, Sabrina Bechet, Seiji Yashiro, Kazumasa Iwai, Atsuki Shinbori,\n  Kalevi Mursula, Fusa Miyake, Daikou Shiota, Marcos V. D. Silveira, Robert\n  Stuart, Denny M. Oliveira, Sachiko Akiyama, Kouji Ohnishi, Yoshizumi Miyoshi","authorsParsed":[["Hayakawa","Hisashi",""],["Ebihara","Yusuke",""],["Mishev","Alexander",""],["Koldobskiy","Sergey",""],["Kusano","Kanya",""],["Bechet","Sabrina",""],["Yashiro","Seiji",""],["Iwai","Kazumasa",""],["Shinbori","Atsuki",""],["Mursula","Kalevi",""],["Miyake","Fusa",""],["Shiota","Daikou",""],["Silveira","Marcos V. D.",""],["Stuart","Robert",""],["Oliveira","Denny M.",""],["Akiyama","Sachiko",""],["Ohnishi","Kouji",""],["Miyoshi","Yoshizumi",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 13:44:50 GMT"}],"updateDate":"2024-07-11","timestamp":1720619090000,"abstract":"  In May 2024, the scientific community observed intense solar eruptions that\nresulted in an extreme geomagnetic storm and auroral extension, highlighting\nthe need to document and quantify these events. This study mainly focuses on\ntheir quantification. The source active region (AR 13664) evolved from 113 to\n2761 millionths of the solar hemisphere between 4 May and 14 May 2024. AR\n13664's magnetic free energy surpassed 1033 erg on 7 May 2024, triggering 12\nX-class flares. Multiple interplanetary coronal mass ejections (ICMEs) came out\nfrom this AR, accelerating solar energetic particles toward Earth. At least\nfour ICMEs seemingly piled up to disturb the interplanetary space, according to\nthe satellite data and interplanetary scintillation data. The shock arrival at\n17:05 UT on 10 May 2024 significantly compressed the magnetosphere down to ~\n5.04 R_E, and triggered a deep Forbush decrease. GOES satellite data and\nground-based neutron monitors confirmed a ground-level enhancement from 2 UT to\n10 UT on 11 May 2024. The ICMEs induced extreme geomagnetic storms, peaking at\na Dst index of -412 nT at 2 UT on 11 May 2024, marking the sixth-largest storm\nsince 1957. The AE and AL indices showed extreme auroral extensions that\nlocated the AE/AL stations into the polar cap. We gathered auroral records at\nthat time and reconstructed the equatorward boundary of the visual auroral oval\nto 29.8{\\deg} invariant latitude. We compared naked-eye and camera auroral\nvisibility, providing critical caveats on their difference. We also confirmed\nglobal enhancements of storm-enhanced density of the ionosphere.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Physics/Space Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}