{"id":"2407.20975","title":"Transfer Learning for Multi-material Classification of Transition Metal\n  Dichalcogenides with Atomic Force Microscopy","authors":"Isaiah A. Moses, Wesley F. Reinhart","authorsParsed":[["Moses","Isaiah A.",""],["Reinhart","Wesley F.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 17:06:42 GMT"}],"updateDate":"2024-07-31","timestamp":1722359202000,"abstract":"  Deep learning models are widely used for the data-driven design of materials\nbased on atomic force microscopy (AFM) and other scanning probe microscopy.\nThese tools enhance efficiency in inverse design and characterization of\nmaterials. However, limited and imbalanced experimental materials data\ntypically available is a major challenge. Also important is the need to\ninterpret trained models, which have typically been complex enough to be\nuninterpretable by humans. Here, we present a systemic evaluation of transfer\nlearning strategies to accommodate low-data scenarios in materials synthesis\nand a model latent feature analysis to draw connections to the\nhuman-interpretable characteristics of the samples. Our models show accurate\npredictions in five classes of transition metal dichalcogenides (TMDs)\n(MoS$_2$, WS$_2$, WSe$_2$, MoSe$_2$, and Mo-WSe$_2$) with up to 89$\\%$ accuracy\non held-out test samples. Analysis of the latent features reveals a correlation\nwith physical characteristics such as grain density, DoG blob, and local\nvariation. The transfer learning optimization modality and the exploration of\nthe correlation between the latent and physical features provide important\nframeworks that can be applied to other classes of materials beyond TMDs to\nenhance the models' performance and explainability which can accelerate the\ninverse design of materials for technological applications.\n","subjects":["Condensed Matter/Materials Science","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BjX9ZbKLAtDzwetD0y-0w1GY9q1YY5iBGSfPd3BlBOE","pdfSize":"3236305"}
