{"id":"2407.10548","title":"Fluid Antenna Multiple Access Assisted Integrated Data and Energy\n  Transfer: Outage and Multiplexing Gain Analysis","authors":"Xiao Lin, Yizhe Zhao, Halvin Yang, Jie Hu, Kai-Kit Wong","authorsParsed":[["Lin","Xiao",""],["Zhao","Yizhe",""],["Yang","Halvin",""],["Hu","Jie",""],["Wong","Kai-Kit",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 08:58:00 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 07:54:36 GMT"}],"updateDate":"2024-08-02","timestamp":1721033880000,"abstract":"  Fluid antenna multiple access (FAMA) exploits the spatial opportunities in\nwireless channels to overcome multiuser interference by position (a.k.a.~port)\nswitching, which can achieve better performance compared to traditional fixed\nmultiple-input multiple-output (MIMO) systems. Additionally, integrated data\nand energy transfer (IDET) is capable of providing both wireless data transfer\n(WDT) and wireless energy transfer (WET) services towards low-power devices. In\nthis paper, a FAMA-assisted IDET system is investigated, where a base station\n(BS) equipped with $N$ fixed antennas provides dedicated IDET services towards\n$N$ user equipments (UEs). Each UE is equipped with a single fluid antenna,\nwhile the power splitting (PS) approach is conceived for coordinating WDT and\nWET. The outage probabilities of both WDT and WET are derived and approximated\ninto closed-forms, where the fluid antenna (FA) at each UE selects the optimal\nport to achieve the maximum signal-to-interference-plus-noise ratio (SINR) or\nthe energy harvesting power (EHP). The IDET outage probabilities are defined\nand subsequently derived and approximated into closed-forms. Further,\nmultiplexing gains of the proposed system are defined and analyzed to evaluate\nthe performace. Numerical results validate the theoretical analysis, while also\nillustrate that the trade-off is achieved between WDT and WET performance by\nexploiting different port selection strategies. Furthermore, the number of UEs\nshould be optimized to achieve better IDET performance of the system.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}