{"id":"2407.19969","title":"The CARMENES search for exoplanets around M dwarfs: Magnesium and\n  silicon abundances of K7-M5.5 stars","authors":"H. M. Tabernero, Y. Shan, J. A. Caballero, C. Duque-Arribas, D.\n  Montes, J. I. Gonz\\'alez Hern\\'andez, M. R. Zapatero Osorio, A. Schweitzer,\n  Th. Henning, M. Cort\\'es-Contreras, A. Quirrenbach, P. J. Amado, A. Reiners,\n  I. Ribas, G. Bergond, J. C. Morales","authorsParsed":[["Tabernero","H. M.",""],["Shan","Y.",""],["Caballero","J. A.",""],["Duque-Arribas","C.",""],["Montes","D.",""],["Hernández","J. I. González",""],["Osorio","M. R. Zapatero",""],["Schweitzer","A.",""],["Henning","Th.",""],["Cortés-Contreras","M.",""],["Quirrenbach","A.",""],["Amado","P. J.",""],["Reiners","A.",""],["Ribas","I.",""],["Bergond","G.",""],["Morales","J. C.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:00:53 GMT"}],"updateDate":"2024-07-30","timestamp":1722258053000,"abstract":"  We present the abundances of magnesium (Mg) and silicon (Si) for 314 dwarf\nstars with spectral types in the interval K7.0-M5.5 (Teff range ~4200-3050 K)\nobserved with the CARMENES high-resolution spectrograph at the 3.5 m telescope\nat the Calar Alto Observatory. Our analysis employs the BT-Settl model\natmospheres, the radiative transfer code Turbospectrum, and a state-of-the-art\nselection of atomic and molecular data. These Mg and Si abundances are critical\nfor understanding both the chemical evolution and assembly of the Milky Way and\nthe formation and composition of rocky planets. Our chemical abundances show a\nline-to-line scatter at the level of 0.1 dex for all studied spectral types.\nThe typical error bar of our chemical abundance measurements is +- 0.11 dex\n(Mg) and +- 0.16 dex (Si) for all spectral types based on the comparison of the\nresults obtained for stellar components of multiple systems. The derived\nabundances are consistent with the galactic evolution trends and observed\nchemical abundance distribution of earlier FGK-type stars in the solar\nneighbourhood. Besides, our analysis provides compatible abundances for stars\nin multiple systems. In addition, we studied the abundances of different\ngalactic stellar populations. In this paper, we also explore the relation of\nthe Mg and Si abundances of stars with and without known planets.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}