{"id":"2407.17518","title":"Driving pattern interpretation based on action phases clustering","authors":"Xue Yao, Simeon C. Calvert, Serge P. Hoogendoorn","authorsParsed":[["Yao","Xue",""],["Calvert","Simeon C.",""],["Hoogendoorn","Serge P.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 10:40:23 GMT"}],"updateDate":"2024-07-26","timestamp":1721212823000,"abstract":"  Current approaches to identifying driving heterogeneity face challenges in\ncomprehending fundamental patterns from the perspective of underlying driving\nbehavior mechanisms. The concept of Action phases was proposed in our previous\nwork, capturing the diversity of driving characteristics with physical\nmeanings. This study presents a novel framework to further interpret driving\npatterns by classifying Action phases in an unsupervised manner. In this\nframework, a Resampling and Downsampling Method (RDM) is first applied to\nstandardize the length of Action phases. Then the clustering calibration\nprocedure including ''Feature Selection'', ''Clustering Analysis'',\n''Difference/Similarity Evaluation'', and ''Action phases Re-extraction'' is\niteratively applied until all differences among clusters and similarities\nwithin clusters reach the pre-determined criteria. Application of the framework\nusing real-world datasets revealed six driving patterns in the I80 dataset,\nlabeled as ''Catch up'', ''Keep away'', and ''Maintain distance'', with both\n''Stable'' and ''Unstable'' states. Notably, Unstable patterns are more\nnumerous than Stable ones. ''Maintain distance'' is the most common among\nStable patterns. These observations align with the dynamic nature of driving.\nTwo patterns ''Stable keep away'' and ''Unstable catch up'' are missing in the\nUS101 dataset, which is in line with our expectations as this dataset was\npreviously shown to have less heterogeneity. This demonstrates the potential of\ndriving patterns in describing driving heterogeneity. The proposed framework\npromises advantages in addressing label scarcity in supervised learning and\nenhancing tasks such as driving behavior modeling and driving trajectory\nprediction.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Robotics","Statistics/Applications","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}