{"id":"2407.05472","title":"Stability of (sub)critical non-local spatial branching processes with\n  and without immigration","authors":"Emma Horton, Andreas E. Kyprianou, Pedro Mart\\'in-Ch\\'avez, Ellen\n  Powell, Victor Rivero","authorsParsed":[["Horton","Emma",""],["Kyprianou","Andreas E.",""],["Martín-Chávez","Pedro",""],["Powell","Ellen",""],["Rivero","Victor",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 19:07:27 GMT"}],"updateDate":"2024-07-09","timestamp":1720379247000,"abstract":"  We consider the setting of either a general non-local branching particle\nprocess or a general non-local superprocess, in both cases, with and without\nimmigration. Under the assumption that the mean semigroup has a\nPerron-Frobenious type behaviour for the immigrated mass, as well as the\nexistence of second moments, we consider necessary and sufficient conditions\nthat ensure limiting distributional stability. More precisely, our first main\ncontribution pertains to proving the asymptotic Kolmogorov survival probability\nand Yaglom limit for critical non-local branching particle systems and\nsuperprocesses under a second moment assumption on the offspring distribution.\nOur results improve on existing literature by removing the requirement of\nbounded offspring in the particle setting [21] and generalising [43] to allow\nfor non-local branching mechanisms. Our second main contribution pertains to\nthe stability of both critical and sub-critical non-local branching particle\nsystems and superprocesses with immigration. At criticality, we show that the\nscaled process converges to a Gamma distribution under a necessary and\nsufficient integral test. At subcriticality we show stability of the process,\nalso subject to an integral test. In these cases, our results complement\nclassical results for (continuous-time) Galton-Watson processes with\nimmigration and continuous-state branching processes with immigration; see\n[22,40,42,48,51], among others. In the setting of superprocesses, the only work\nwe know of at this level of generality is summarised in [34]. The proofs of our\nresults, both with and without immigration, appeal to similar technical\napproaches and accordingly, we include the results together in this paper.\n","subjects":["Mathematics/Probability"],"license":"http://creativecommons.org/licenses/by/4.0/"}