{"id":"2407.11853","title":"A Case for Application-Aware Space Radiation Tolerance in Orbital\n  Computing","authors":"Meiqi Wang and Han Qiu and Longnv Xu and Di Wang and Yuanjie Li and\n  Tianwei Zhang and Jun Liu and Hewu Li","authorsParsed":[["Wang","Meiqi",""],["Qiu","Han",""],["Xu","Longnv",""],["Wang","Di",""],["Li","Yuanjie",""],["Zhang","Tianwei",""],["Liu","Jun",""],["Li","Hewu",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:35:11 GMT"}],"updateDate":"2024-07-17","timestamp":1721144111000,"abstract":"  We are witnessing a surge in the use of commercial off-the-shelf (COTS)\nhardware for cost-effective in-orbit computing, such as deep neural network\n(DNN) based on-satellite sensor data processing, Earth object detection, and\ntask decision.However, once exposed to harsh space environments, COTS hardware\nis vulnerable to cosmic radiation and suffers from exhaustive single-event\nupsets (SEUs) and multi-unit upsets (MCUs), both threatening the functionality\nand correctness of in-orbit computing.Existing hardware and system software\nprotections against radiation are expensive for resource-constrained COTS\nnanosatellites and overwhelming for upper-layer applications due to their\nrequirement for heavy resource redundancy and frequent reboots. Instead, we\nmake a case for cost-effective space radiation tolerance using application\ndomain knowledge. Our solution for the on-satellite DNN tasks, \\name, exploits\nthe uneven SEU/MCU sensitivity across DNN layers and MCUs' spatial correlation\nfor lightweight radiation-tolerant in-orbit AI computing. Our extensive\nexperiments using Chaohu-1 SAR satellite payloads and a hardware-in-the-loop,\nreal data-driven space radiation emulator validate that RedNet can suppress the\ninfluence of radiation errors to $\\approx$ 0 and accelerate the on-satellite\nDNN inference speed by 8.4%-33.0% at negligible extra costs.\n","subjects":["Computing Research Repository/Emerging Technologies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}