{"id":"2407.09436","title":"A novel direct Helmholtz solver in inhomogeneous media based on the\n  operator Fourier transform functional calculus","authors":"Max Cubillos and Edwin Jimenez","authorsParsed":[["Cubillos","Max",""],["Jimenez","Edwin",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 17:13:21 GMT"}],"updateDate":"2024-07-15","timestamp":1720804401000,"abstract":"  This article presents novel numerical algorithms based on pseudodifferential\noperators ($\\Psi$DO) for fast, direct solution of the Helmholtz equation in\none-, two- and three-dimensional inhomogeneous unbounded media. The proposed\napproach relies on an Operator Fourier Transform (OFT) representation of\n$\\Psi$DO which frame the problem of computing the inverse Helmholtz operator,\nwith a spatially-dependent wave speed, in terms of two sequential applications\nof an inverse square root $\\Psi$DO. The OFT representation of the action of the\nsquare root $\\Psi$DO, in turn, can be effected as a superposition of solutions\nof a pseudo-temporal initial-boundary-value problem for a paraxial equation.\nThe OFT framework offers several advantages over traditional direct and\niterative approaches for the solution of the Helmholtz equation. The operator\nintegral transform is amenable to standard quadrature methods and the required\npseudo-temporal paraxial equation solutions can be obtained using any suitable\nnumerical method. A specialized quadrature is derived to evaluate the OFT\nefficiently and an alternating direction implicit method, used in conjunction\nwith standard finite differences, is used to solve the requisite component\nparaxial equation problems. Numerical studies, in 1, 2, and 3 spatial\ndimensions, are presented to confirm the expected OFT-based Helmholtz solver\nconvergence rate. In addition, the efficiency and versatility of our proposed\napproach is demonstrated by tackling nontrivial wave propagation problems,\nincluding 2D plane wave scattering from a geometrically complex inhomogeneity,\n3D scattering from turbulent channel flow and plane wave transmission through a\nspherically-symmetric gradient-index acoustic lens. All computations, even the\nlatter lens problem which involves solving the Helmholtz equation with more\nthan one billion complex unknowns, are performed in a single workstation.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}