{"id":"2407.08581","title":"Operator Origin of Anomalous Dimensions in de Sitter Space","authors":"Timothy Cohen, Daniel Green, and Yiwen Huang","authorsParsed":[["Cohen","Timothy",""],["Green","Daniel",""],["Huang","Yiwen",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 15:07:02 GMT"}],"updateDate":"2024-07-12","timestamp":1720710422000,"abstract":"  The late time limit of the power spectrum for heavy (principal series) fields\nin de Sitter space yields a series of polynomial terms with complex scaling\ndimensions. Such scaling behavior is expected to result from an associated\noperator with a complex dimension. In a free theory, these complex dimensions\nare known to match the constraints imposed by unitarity on the space of states.\nYet, perturbative corrections to the scaling behavior of operators are naively\ninconsistent with unitary evolution of the quantum fields in dS. This paper\ndemonstrates how to compute one-loop corrections to the scaling dimensions that\nappear in the two point function from the field theory description in terms of\nlocal operators. We first show how to evaluate these anomalous dimensions using\nMellin space, which has the feature that it naturally accommodates a scaleless\nregulator. We then explore the consequences for the Soft de Sitter Effective\nTheory (SdSET) description that emerges in the long wavelength limit. Carefully\nmatching between the UV and SdSET descriptions requires the introduction of\nnovel non-dynamical \"operators\" in the effective theory. This is not only\nnecessary to reproduce results extracted from the K\\\"all\\'en-Lehmann\nrepresentation (that use the space of unitary states directly), but it is also\nrequired by general arguments that invoke positivity.\n","subjects":["Physics/High Energy Physics - Theory","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SoTW83_PgN0ZJbZJOxabCTKQVN_W_jIzqLfuEXLCZ40","pdfSize":"932529"}
