{"id":"2407.21103","title":"The MillenniumTNG Project: Impact of massive neutrinos on the cosmic\n  large-scale structure and the distribution of galaxies","authors":"C\\'esar Hern\\'andez-Aguayo, Volker Springel, Sownak Bose, Carlos\n  Frenk, Adrian Jenkins, Monica Barrera, Fulvio Ferlito, R\\\"udiger Pakmor,\n  Simon D. M. White, Lars Hernquist, Ana Maria Delgado, Rahul Kannan, Boryana\n  Hadzhiyska","authorsParsed":[["Hernández-Aguayo","César",""],["Springel","Volker",""],["Bose","Sownak",""],["Frenk","Carlos",""],["Jenkins","Adrian",""],["Barrera","Monica",""],["Ferlito","Fulvio",""],["Pakmor","Rüdiger",""],["White","Simon D. M.",""],["Hernquist","Lars",""],["Delgado","Ana Maria",""],["Kannan","Rahul",""],["Hadzhiyska","Boryana",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 18:00:04 GMT"}],"updateDate":"2024-08-01","timestamp":1722362404000,"abstract":"  We discuss the cold dark matter plus massive neutrinos simulations of the\nMillenniumTNG (MTNG) project, which aim to improve understanding of how well\nongoing and future large-scale galaxy surveys will measure neutrino masses. Our\nlargest simulations, $3000\\,{\\rm Mpc}$ on a side, use $10240^3$ particles of\nmass $m_{p} = 6.66\\times 10^{8}\\,h^{-1}{\\rm M}_\\odot$ to represent cold dark\nmatter, and $2560^3$ to represent a population of neutrinos with summed mass\n$M_\\nu = 100\\,{\\rm meV}$. Smaller volume runs with $\\sim 630\\,{\\rm Mpc}$ also\ninclude cases with $M_\\nu = 0\\,\\textrm{and}\\, 300\\,{\\rm meV}$. All simulations\nare carried out twice using the paired-and-fixed technique for cosmic variance\nreduction. We evolve the neutrino component using the particle-based $\\delta f$\nimportance sampling method, which greatly reduces shot noise in the neutrino\ndensity field. In addition, we modify the GADGET-4 code to account both for the\ninfluence of relativistic and mildly relativistic components on the expansion\nrate and for non-Newtonian effects on the largest represented simulation\nscales. This allows us to quantify accurately the impact of neutrinos on basic\nstatistical measures of nonlinear structure formation, such as the matter power\nspectrum and the halo mass function. We use semi-analytic models of galaxy\nformation to predict the galaxy population and its clustering properties as a\nfunction of summed neutrino mass, finding significant ($\\sim 10\\%$) impacts on\nthe cosmic star formation rate history, the galaxy mass function, and the\nclustering strength. This offers the prospect of identifying combinations of\nsummary statistics that are optimally sensitive to the neutrino mass.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cEeU5-h24lgP3aakRGgK1PxwPaJCoyfyc94Rv_UlunE","pdfSize":"3424481"}
