{"id":"2407.12244","title":"Efficient condensation on spiked surfaces with superhydrophobic and\n  superhydrophilic coatings","authors":"Kai-Xin Hu, Yin-Jiang Chen, Bin-Wei Tang","authorsParsed":[["Hu","Kai-Xin",""],["Chen","Yin-Jiang",""],["Tang","Bin-Wei",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 01:21:55 GMT"}],"updateDate":"2024-07-18","timestamp":1721179315000,"abstract":"  Steam condensation on the surface of a solid is a widely observed mode of\nenergy transfer in nature and various industrial applications. The condensation\nefficiency is closely related to the material properties and geometric\nmorphology of the solid surface, as well as the method of liquid removal.\nDespite many surface modification strategies at the micro and nano levels\nhaving been employed to enhance steam condensation, understanding how to\nregulate steam condensation and liquid removal on complex surface morphologies\nremains incomplete. Here, we report a method that uses superhydrophilic and\nsuperhydrophobic coatings as well as spiked surfaces to achieve efficient steam\ncondensation and rapid removal of the liquid. We reveal that on a copper plate\nwith millimeter-scale spikes, hydrophobic spiked surfaces facilitate the\ndropwise condensation, while hydrophilic bottom grooves promote liquid\nspreading, and the suction in capillary gaps can promptly remove the condensate\nliquid. This method achieves a high condensation efficiency without relying on\ngravity. Additionally, we demonstrate that the condensation on spiked surfaces\nhas a significant suction effect, as it continuously attracts the steam flow,\nthereby altering the flow direction. This finding provides a new approach for\nefficient steam condensation technology and opens up a promising pathway for\nproviding circulation power and improving condensation efficiency in\nphase-change heat transfer devices such as heat pipes.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Applied Physics","Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}