{"id":"2407.18507","title":"Feasibility study of upper atmosphere density measurement on the ISS by\n  observations of the CXB transmitted through the Earth rim","authors":"Takumi Kishimoto, Kumiko K. Nobukawa, Ayaki Takeda, Takeshi G. Tsuru,\n  Satoru Katsuda, Nakazawa Kazuhiro, Koji Mori, Masayoshi Nobukawa, Hiroyuki\n  Uchida, Yoshihisa Kawabe, Satoru Kuwano, Eisuke Kurogi, Yamato Ito, Yuma Aoki","authorsParsed":[["Kishimoto","Takumi",""],["Nobukawa","Kumiko K.",""],["Takeda","Ayaki",""],["Tsuru","Takeshi G.",""],["Katsuda","Satoru",""],["Kazuhiro","Nakazawa",""],["Mori","Koji",""],["Nobukawa","Masayoshi",""],["Uchida","Hiroyuki",""],["Kawabe","Yoshihisa",""],["Kuwano","Satoru",""],["Kurogi","Eisuke",""],["Ito","Yamato",""],["Aoki","Yuma",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 04:31:29 GMT"}],"updateDate":"2024-07-29","timestamp":1721968289000,"abstract":"  Measurements of the upper atmosphere at ~100 km are important to investigate\nclimate change, space weather forecasting, and the interaction between the Sun\nand the Earth. Atmospheric occultations of cosmic X-ray sources are an\neffective technique to measure the neutral density in the upper atmosphere. We\nare developing the instrument SUIM dedicated to continuous observations of\natmospheric occultations. SUIM will be mounted on a platform on the exterior of\nthe International Space Station for six months and pointed at the Earth's rim\nto observe atmospheric absorption of the cosmic X-ray background (CXB). In this\npaper, we conducted a feasibility study of SUIM by estimating the CXB\nstatistics and the fraction of the non-X-ray background (NXB) in the observed\ndata. The estimated CXB statistics are enough to evaluate the atmospheric\nabsorption of CXB for every 15 km of altitude. On the other hand, the NXB will\nbe dominant in the X-ray spectra of SUIM. Assuming that the NXB per detection\narea of SUIM is comparable to that of the soft X-ray Imager onboard Hitomi, the\nNXB level will be much higher than the CXB one and account for ~80% of the\ntotal SUIM spectra.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oYyEyVh4Lby_8biSDtVrxojGpCcNbngsOotOo2XJHHw","pdfSize":"633190"}
