{"id":"2407.04689","title":"RAM: Retrieval-Based Affordance Transfer for Generalizable Zero-Shot\n  Robotic Manipulation","authors":"Yuxuan Kuang, Junjie Ye, Haoran Geng, Jiageng Mao, Congyue Deng,\n  Leonidas Guibas, He Wang, Yue Wang","authorsParsed":[["Kuang","Yuxuan",""],["Ye","Junjie",""],["Geng","Haoran",""],["Mao","Jiageng",""],["Deng","Congyue",""],["Guibas","Leonidas",""],["Wang","He",""],["Wang","Yue",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 17:50:38 GMT"}],"updateDate":"2024-07-08","timestamp":1720201838000,"abstract":"  This work proposes a retrieve-and-transfer framework for zero-shot robotic\nmanipulation, dubbed RAM, featuring generalizability across various objects,\nenvironments, and embodiments. Unlike existing approaches that learn\nmanipulation from expensive in-domain demonstrations, RAM capitalizes on a\nretrieval-based affordance transfer paradigm to acquire versatile manipulation\ncapabilities from abundant out-of-domain data. First, RAM extracts unified\naffordance at scale from diverse sources of demonstrations including robotic\ndata, human-object interaction (HOI) data, and custom data to construct a\ncomprehensive affordance memory. Then given a language instruction, RAM\nhierarchically retrieves the most similar demonstration from the affordance\nmemory and transfers such out-of-domain 2D affordance to in-domain 3D\nexecutable affordance in a zero-shot and embodiment-agnostic manner. Extensive\nsimulation and real-world evaluations demonstrate that our RAM consistently\noutperforms existing works in diverse daily tasks. Additionally, RAM shows\nsignificant potential for downstream applications such as automatic and\nefficient data collection, one-shot visual imitation, and LLM/VLM-integrated\nlong-horizon manipulation. For more details, please check our website at\nhttps://yxkryptonite.github.io/RAM/.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}