{"id":"2407.13950","title":"A time-parallel multiple-shooting method for large-scale quantum optimal\n  control","authors":"N. Anders Petersson, Stefanie G\\\"unther, Seung Whan Chung","authorsParsed":[["Petersson","N. Anders",""],["Günther","Stefanie",""],["Chung","Seung Whan",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 23:57:26 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 16:25:44 GMT"}],"updateDate":"2024-07-25","timestamp":1721347046000,"abstract":"  Quantum optimal control plays a crucial role in quantum computing by\nproviding the interface between compiler and hardware. Solving the optimal\ncontrol problem is particularly challenging for multi-qubit gates, due to the\nexponential growth in computational complexity with the system's dimensionality\nand the deterioration of optimization convergence. To ameliorate the\ncomputational complexity of time-integration, this paper introduces a\nmultiple-shooting approach in which the time domain is divided into multiple\nwindows and the intermediate states at window boundaries are treated as\nadditional optimization variables. This enables parallel computation of state\nevolution across time-windows, significantly accelerating objective function\nand gradient evaluations. Since the initial state matrix in each window is only\nguaranteed to be unitary upon convergence of the optimization algorithm, the\nconventional gate trace infidelity is replaced by a generalized infidelity that\nis convex for non-unitary state matrices. Continuity of the state across window\nboundaries is enforced by equality constraints. A quadratic penalty\noptimization method is used to solve the constrained optimal control problem,\nand an efficient adjoint technique is employed to calculate the gradients in\neach iteration. We demonstrate the effectiveness of the proposed method through\nnumerical experiments on quantum Fourier transform gates in systems with 2, 3,\nand 4 qubits, noting a speedup of 80x for evaluating the gradient in the\n4-qubit case, highlighting the method's potential for optimizing control pulses\nin multi-qubit quantum systems.\n","subjects":["Physics/Quantum Physics","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"yVX1quDkSf9fzYhb5Q040ThW539cUmJd32UvXxlF6N4","pdfSize":"900852"}
