{"id":"2407.08907","title":"Tightly-Coupled LiDAR-IMU-Wheel Odometry with an Online Neural Kinematic\n  Model Learning via Factor Graph Optimization","authors":"Taku Okawara, Kenji Koide, Shuji Oishi, Masashi Yokozuka, Atsuhiko\n  Banno, Kentaro Uno and Kazuya Yoshida","authorsParsed":[["Okawara","Taku",""],["Koide","Kenji",""],["Oishi","Shuji",""],["Yokozuka","Masashi",""],["Banno","Atsuhiko",""],["Uno","Kentaro",""],["Yoshida","Kazuya",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 00:57:36 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 08:08:18 GMT"}],"updateDate":"2024-07-16","timestamp":1720745856000,"abstract":"  Environments lacking geometric features (e.g., tunnels and long straight\ncorridors) are challenging for LiDAR-based odometry algorithms because LiDAR\npoint clouds degenerate in such environments. For wheeled robots, a wheel\nkinematic model (i.e., wheel odometry) can improve the reliability of the\nodometry estimation. However, the kinematic model suffers from complex motions\n(e.g., wheel slippage, lateral movement) in the case of skid-steering robots\nparticularly because this robot model rotates by skidding its wheels.\nFurthermore, these errors change nonlinearly when the wheel slippage is large\n(e.g., drifting) and are subject to terrain-dependent parameters. To\nsimultaneously tackle point cloud degeneration and the kinematic model errors,\nwe developed a LiDAR-IMU-wheel odometry algorithm incorporating online training\nof a neural network that learns the kinematic model of wheeled robots with\nnonlinearity. We propose to train the neural network online on a factor graph\nalong with robot states, allowing the learning-based kinematic model to adapt\nto the current terrain condition. The proposed method jointly solves online\ntraining of the neural network and LiDARIMUwheel odometry on a unified factor\ngraph to retain the consistency of all those constraints. Through experiments,\nwe first verified that the proposed network adapted to a changing environment,\nresulting in an accurate odometry estimation across different environments.We\nthen confirmed that the proposed odometry estimation algorithm was robust\nagainst point cloud degeneration and nonlinearity (e.g., large wheel slippage\nby drifting) of the kinematic model.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}