{"id":"2407.20346","title":"Local Friendliness Polytopes In Multipartite Scenarios","authors":"Marwan Haddara and Eric G. Cavalcanti","authorsParsed":[["Haddara","Marwan",""],["Cavalcanti","Eric G.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:01:05 GMT"}],"updateDate":"2024-07-31","timestamp":1722276065000,"abstract":"  Recently the Local Friendliness (LF) no-go theorem has gained a lot of\nattention, owing to its deep foundational implications. This no-go theorem\napplies to scenarios which combine Bell experiments with Wigner's friend-type\nset ups, containing space-like separated superobservers who are assumed to be\ncapable of performing quantum operations on a local observer, also known as\ntheir \"friend\". Analogously to the hypothesis of local hidden variables in Bell\nscenarios, a set of assumptions termed \"Local Friendliness\" constrains the\nspace of probabilistic behaviours accessible to the superobservers to be a\nparticular subset of the no-signalling polytope in such scenarios. It has\nadditionally been shown, that there are scenarios where the set of behaviours\ncompatible with Local Friendliness is strictly larger than the Bell-local\npolytope, while in some scenarios those sets are equal. In this work, we\ncomplete the picture by identifying all the canonical Local Friendliness\nscenarios, with arbitrary but finite numbers of superobservers, friends,\nmeasurements and outcomes, where the set of LF correlations admits a local\nhidden variable model, and where they do not. Our proof is constructive in the\nsense that we also demonstrate how a local hidden variable model can be\nconstructed, given a behaviour compatible with LF in the appropriate scenarios.\nWhile our principal motivation is the foundational question of better\nunderstanding the constraints from Local Friendliness, the same inequalities\nconstraining LF polytopes have been shown to arise in a priori unrelated\ncontexts of device-independent information processing. Our results may thus\nfind use in those research areas as well.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}