{"id":"2407.08332","title":"Risk Analysis of Passive Portfolios","authors":"Sourish Das","authorsParsed":[["Das","Sourish",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 09:29:39 GMT"}],"updateDate":"2024-07-12","timestamp":1720690179000,"abstract":"  In this work, we present an alternative passive investment strategy. The\npassive investment philosophy comes from the Efficient Market Hypothesis (EMH),\nand its adoption is widespread. If EMH is true, one cannot outperform market by\nactively managing their portfolio for a long time. Also, it requires little to\nno intervention. People can buy an exchange-traded fund (ETF) with a long-term\nperspective. As the economy grows over time, one expects the ETF to grow. For\nexample, in India, one can invest in NETF, which suppose to mimic the Nifty50\nreturn. However, the weights of the Nifty 50 index are based on market\ncapitalisation. These weights are not necessarily optimal for the investor. In\nthis work, we present that volatility risk and extreme risk measures of the\nNifty50 portfolio are uniformly larger than Markowitz's optimal portfolio.\nHowever, common people can't create an optimised portfolio. So we proposed an\nalternative passive investment strategy of an equal-weight portfolio. We show\nthat if one pushes the maximum weight of the portfolio towards equal weight,\nthe idiosyncratic risk of the portfolio would be minimal. The empirical\nevidence indicates that the risk profile of an equal-weight portfolio is\nsimilar to that of Markowitz's optimal portfolio. Hence instead of buying\nNifty50 ETFs, one should equally invest in the stocks of Nifty50 to achieve a\nuniformly better risk profile than the Nifty 50 ETF portfolio. We also present\nan analysis of how portfolios perform to idiosyncratic events like the Russian\ninvasion of Ukraine. We found that the equal weight portfolio has a uniformly\nlower risk than the Nifty 50 portfolio before and during the Russia-Ukraine\nwar. All codes are available on GitHub\n(\\url{https://github.com/sourish-cmi/quant/tree/main/Chap_Risk_Anal_of_Passive_Portfolio}).\n","subjects":["Quantitative Finance/Statistical Finance"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xeWTiolkHYm5RAzl1Q1FucfKdI96N7vr5-y9VShnxeQ","pdfSize":"820919"}
