{"id":"2407.06577","title":"Topologically controlled synthesis of active colloidal bipeds","authors":"Jonas Elschner, Farzaneh Farrokhzad, Piotr Ku\\'swik, Maciej Urbaniak,\n  Feliks Stobiecki, Sapida Akhundzada, Arno Ehresmann, Daniel de las Heras and\n  Thomas M. Fischer","authorsParsed":[["Elschner","Jonas",""],["Farrokhzad","Farzaneh",""],["Kuświk","Piotr",""],["Urbaniak","Maciej",""],["Stobiecki","Feliks",""],["Akhundzada","Sapida",""],["Ehresmann","Arno",""],["Heras","Daniel de las",""],["Fischer","Thomas M.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 06:11:38 GMT"}],"updateDate":"2024-07-10","timestamp":1720505498000,"abstract":"  Topological growth control allows to produce a narrow distribution of\noutgrown colloidal rods with defined and adjustable length. We use an external\nmagnetic field to assemble paramagnetic colloidal spheres into colloidal rods\nof a chosen length. The rods reside above ametamorphic hexagonalmagnetic\npattern. The periodic repetition of specific loops of the orientation of an\napplied external field renders paramagnetic colloidal particles and their\nassemblies into active bipeds that walk on the pattern. The metamorphic\npatterns allow the robust and controlled polymerization of single colloids to\nbipeds of a desired length. The colloids are exposed to this fixed external\ncontrol loop that causes multiple simultaneous responses: Small bipeds and\nsingle colloidal particles interpret the external magnetic loop as an order to\nwalk toward the active zone, where they assemble and polymerize. Outgrown\nbipeds interpret the same loop as an order to walk away from the active zone.\nThe topological transition occurs solely for the growing biped and nothing is\nchanged in the environment nor in the magnetic control loop. As in many\nbiological systems the decision of a biped that reached its outgrown length to\nwalk away from the reaction site is made internally, not externally.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}