{"id":"2407.05847","title":"Diffusive shock acceleration in relativistic, oblique shocks","authors":"Allard Jan van Marle, Artem Bohdan, Anabella Araudo, Fabien Casse,\n  Alexandre Marcowith","authorsParsed":[["van Marle","Allard Jan",""],["Bohdan","Artem",""],["Araudo","Anabella",""],["Casse","Fabien",""],["Marcowith","Alexandre",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 11:50:03 GMT"}],"updateDate":"2024-07-09","timestamp":1720439403000,"abstract":"  Cosmic rays are charged particles that are accelerated to relativistic speeds\nby astrophysical shocks. Numerical models have been successful in confirming\nthe acceleration process for (quasi-)parallel shocks, which have the magnetic\nfield aligned with the direction of the shock motion. However, the process is\nless clear when it comes to (quasi-)perpendicular shocks, where the field makes\na large angle with the shock-normal. For such shocks, the angle between the\nmagnetic field and flow ensures that only highly energetic particles can travel\nupstream at all, reducing the upstream current. This process is further\ninhibited for relativistic shocks, since the shock can become superluminal when\nthe required particle velocity exceeds the speed of light, effectively\ninhibiting any upstream particle flow. In order to determine whether such\nshocks can accelerate particles, we use the particle-in-cell (PIC) method to\ndetermine what fraction of particles gets reflected initially at the shock. We\nthen use this as input for a new simulation that combines the PIC method with\ngrid-based magnetohydrodynamics to follow the acceleration (if any) of the\nparticles over a larger time-period in a two-dimensional grid. We find that\nquasi-perpendicular, relativistic shocks are capable of accelerating particles\nthrough the DSA process, provided that the shock has a sufficiently high\nAlfvenic Mach number.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}