{"id":"2407.18560","title":"On the Number of Observation Nodes in Boolean Networks","authors":"Liangjie Sun, Wai-Ki Ching, Tatsuya Akutsu","authorsParsed":[["Sun","Liangjie",""],["Ching","Wai-Ki",""],["Akutsu","Tatsuya",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 07:17:27 GMT"}],"updateDate":"2024-07-29","timestamp":1721978247000,"abstract":"  A Boolean network (BN) is called observable if any initial state can be\nuniquely determined from the output sequence. In the existing literature on\nobservability of BNs, there is almost no research on the relationship between\nthe number of observation nodes and the observability of BNs, which is an\nimportant and practical issue. In this paper, we mainly focus on three types of\nBNs with $n$ nodes (i.e., $K$-AND-OR-BNs, $K$-XOR-BNs, and $K$-NC-BNs, where\n$K$ is the number of input nodes for each node and NC means nested canalyzing)\nand study the upper and lower bounds of the number of observation nodes for\nthese BNs. First, we develop a novel technique using information entropy to\nderive a general lower bound of the number of observation nodes, and conclude\nthat the number of observation nodes cannot be smaller than\n$\\left[(1-K)+\\frac{2^{K}-1}{2^{K}}\\log_{2}(2^{K}-1)\\right]n$ to ensure that any\n$K$-AND-OR-BN is observable, and similarly, some lower bound is also obtained\nfor $K$-NC-BNs. Then for any type of BN, we also develop two new techniques to\ninfer the general lower bounds, using counting identical states at time 1 and\ncounting the number of fixed points, respectively. On the other hand, we derive\nnontrivial upper bounds of the number of observation nodes by combinatorial\nanalysis of several types of BNs. Specifically, we indicate that\n$\\left(\\frac{2^{K}-K-1}{2^{K}-1}\\right)n,~1$, and $\\lceil \\frac{n}{K}\\rceil$\nare the best case upper bounds for $K$-AND-OR-BNs, $K$-XOR-BNs, and $K$-NC-BN,\nrespectively.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}