{"id":"2407.19214","title":"QEEGNet: Quantum Machine Learning for Enhanced Electroencephalography\n  Encoding","authors":"Chi-Sheng Chen, Samuel Yen-Chi Chen, Aidan Hung-Wen Tsai and Chun-Shu\n  Wei","authorsParsed":[["Chen","Chi-Sheng",""],["Chen","Samuel Yen-Chi",""],["Tsai","Aidan Hung-Wen",""],["Wei","Chun-Shu",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 08:54:02 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 07:42:30 GMT"}],"updateDate":"2024-07-31","timestamp":1722070442000,"abstract":"  Electroencephalography (EEG) is a critical tool in neuroscience and clinical\npractice for monitoring and analyzing brain activity. Traditional neural\nnetwork models, such as EEGNet, have achieved considerable success in decoding\nEEG signals but often struggle with the complexity and high dimensionality of\nthe data. Recent advances in quantum computing present new opportunities to\nenhance machine learning models through quantum machine learning (QML)\ntechniques. In this paper, we introduce Quantum-EEGNet (QEEGNet), a novel\nhybrid neural network that integrates quantum computing with the classical\nEEGNet architecture to improve EEG encoding and analysis, as a forward-looking\napproach, acknowledging that the results might not always surpass traditional\nmethods but it shows its potential. QEEGNet incorporates quantum layers within\nthe neural network, allowing it to capture more intricate patterns in EEG data\nand potentially offering computational advantages. We evaluate QEEGNet on a\nbenchmark EEG dataset, BCI Competition IV 2a, demonstrating that it\nconsistently outperforms traditional EEGNet on most of the subjects and other\nrobustness to noise. Our results highlight the significant potential of\nquantum-enhanced neural networks in EEG analysis, suggesting new directions for\nboth research and practical applications in the field.\n","subjects":["Quantitative Biology/Neurons and Cognition","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}