{"id":"2407.05156","title":"Science Using Single-Pulse Exploration with Combined Telescopes\n  (SUSPECT) I. The mode-switching, flaring, and single-pulse morphology of PSR\n  B1822-09","authors":"F. Jankowski (1), J.-M. Griessmeier (1 and 2), M. Surnis (3), G.\n  Theureau (1 and 2 and 4), J. Petri (5) ((1) CNRS Orleans, (2) Observatoire\n  Radioastronomique de Nancay, (3) IISER Bhopal, (4) Observatoire de Paris, (5)\n  Universite de Strasbourg)","authorsParsed":[["Jankowski","F.","","1 and 2"],["Griessmeier","J. -M.","","1 and 2"],["Surnis","M.","","1 and 2 and 4"],["Theureau","G.","","1 and 2 and 4"],["Petri","J.",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 19:07:52 GMT"}],"updateDate":"2024-07-09","timestamp":1720292872000,"abstract":"  Aims. We aim to elucidate the pulsar radio emission by studying several\nsingle-pulse phenomena, how they relate to each other, and how they evolve with\nobserving frequency. We intend to inspire models for the pulsar radio emission\nand fast radio bursts.\n  Methods. We set up an observing programme called the SUSPECT project running\nat the Nancay Radio Observatory telescopes in France (10 - 85 MHz, 110 - 240\nMHz, 1 - 3.5 GHz) and the upgraded Giant Metrewave Radio Telescope (uGMRT) in\nIndia. In this first paper, we focus on high-sensitivity data obtained of PSR\nB1822-09 with the uGMRT between 550 and 750 MHz. The pulsar has precursor (PC),\nmain pulse (MP), and interpulse (IP) emission, and exhibits mode-switching. We\npresent its single-pulse stacks, investigate its mode-switching using a hidden\nMarkov switching model, and analyse its single-pulse morphology.\n  Results. PSR B1822-09's pulse profile decomposes into seven components. We\nshow that its mode-switching is well described using a hidden Markov switching\nmodel. The pulsar exhibits at least three stable emission modes, one of which\nis a newly discovered bright flaring mode. We confirm that the PC and MP switch\nsynchronously to each other, and both asynchronously to the IP, indicating\ninformation transfer between the polar caps. Additionally, we performed a\nfluctuation spectral analysis and discovered three fluctuation features in its\nquiescent Q-mode emission, one of which is well known. We conclude that it is\nlongitude-stationary amplitude modulation. Finally, we visually classified the\nsingle-pulses into four categories. We found extensive 0.2 - 0.4 ms\nmicrostructure in the PC with a typical quasi-periodicity of 0.8 ms. There is\nlow-level PC activity during the Q-mode, indicating mode mixing. We discovered\nlow-intensity square-like pulses and extremely bright pulses in the MP, which\nsuggest bursting.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}