{"id":"2407.08952","title":"Detect, Investigate, Judge and Determine: A Novel LLM-based Framework\n  for Few-shot Fake News Detection","authors":"Ye Liu, Jiajun Zhu, Kai Zhang, Haoyu Tang, Yanghai Zhang, Xukai Liu,\n  Qi Liu, Enhong Chen","authorsParsed":[["Liu","Ye",""],["Zhu","Jiajun",""],["Zhang","Kai",""],["Tang","Haoyu",""],["Zhang","Yanghai",""],["Liu","Xukai",""],["Liu","Qi",""],["Chen","Enhong",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 03:15:01 GMT"}],"updateDate":"2024-07-15","timestamp":1720754101000,"abstract":"  Few-Shot Fake News Detection (FS-FND) aims to distinguish inaccurate news\nfrom real ones in extremely low-resource scenarios. This task has garnered\nincreased attention due to the widespread dissemination and harmful impact of\nfake news on social media. Large Language Models (LLMs) have demonstrated\ncompetitive performance with the help of their rich prior knowledge and\nexcellent in-context learning abilities. However, existing methods face\nsignificant limitations, such as the Understanding Ambiguity and Information\nScarcity, which significantly undermine the potential of LLMs. To address these\nshortcomings, we propose a Dual-perspective Augmented Fake News Detection\n(DAFND) model, designed to enhance LLMs from both inside and outside\nperspectives. Specifically, DAFND first identifies the keywords of each news\narticle through a Detection Module. Subsequently, DAFND creatively designs an\nInvestigation Module to retrieve inside and outside valuable information\nconcerning to the current news, followed by another Judge Module to derive its\nrespective two prediction results. Finally, a Determination Module further\nintegrates these two predictions and derives the final result. Extensive\nexperiments on two publicly available datasets show the efficacy of our\nproposed method, particularly in low-resource settings.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}