{"id":"2407.12300","title":"A Unified Model of Congestion Games with Priorities: Two-Sided Markets\n  with Ties, Finite and Non-Affine Delay Functions, and Pure Nash Equilibria","authors":"Kenjiro Takazawa","authorsParsed":[["Takazawa","Kenjiro",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 03:44:16 GMT"}],"updateDate":"2024-07-18","timestamp":1721187856000,"abstract":"  The study of equilibrium concepts in congestion games and two-sided markets\nwith ties has been a primary topic in game theory, economics, and computer\nscience. Ackermann, Goldberg, Mirrokni, R\\\"oglin, V\\\"ocking (2008) gave a\ncommon generalization of these two models, in which a player more prioritized\nby a resource produces an infinite delay on less prioritized players. While\npresenting several theorems on pure Nash equilibria in this model, Ackermann et\nal.\\ posed an open problem of how to design a model in which more prioritized\nplayers produce a large but finite delay on less prioritized players. In this\npaper, we present a positive solution to this open problem by combining the\nmodel of Ackermann et al.\\ with a generalized model of congestion games due to\nBil\\`o and Vinci (2023). In the model of Bil\\`o and Vinci, the more prioritized\nplayers produce a finite delay on the less prioritized players, while the delay\nfunctions are of a specific kind of affine function, and all resources have the\nsame priorities. By unifying these two models, we achieve a model in which the\ndelay functions may be finite and non-affine, and the priorities of the\nresources may be distinct. We prove some positive results on the existence and\ncomputability of pure Nash equilibria in our model, which extend those for the\nprevious models and support the validity of our model.\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Discrete Mathematics","Computing Research Repository/Data Structures and Algorithms","Mathematics/Combinatorics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6mV_YNhWEmP4X2JvI9xfWQ3urklJzObPmCM5VUDpgq0","pdfSize":"276149"}
