{"id":"2407.16931","title":"ScholarChemQA: Unveiling the Power of Language Models in Chemical\n  Research Question Answering","authors":"Xiuying Chen, Tairan Wang, Taicheng Guo, Kehan Guo, Juexiao Zhou,\n  Haoyang Li, Mingchen Zhuge, J\\\"urgen Schmidhuber, Xin Gao, Xiangliang Zhang","authorsParsed":[["Chen","Xiuying",""],["Wang","Tairan",""],["Guo","Taicheng",""],["Guo","Kehan",""],["Zhou","Juexiao",""],["Li","Haoyang",""],["Zhuge","Mingchen",""],["Schmidhuber","Jürgen",""],["Gao","Xin",""],["Zhang","Xiangliang",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 01:46:55 GMT"}],"updateDate":"2024-07-25","timestamp":1721785615000,"abstract":"  Question Answering (QA) effectively evaluates language models' reasoning and\nknowledge depth. While QA datasets are plentiful in areas like general domain\nand biomedicine, academic chemistry is less explored. Chemical QA plays a\ncrucial role in both education and research by effectively translating complex\nchemical information into readily understandable format. Addressing this gap,\nwe introduce ScholarChemQA, a large-scale QA dataset constructed from chemical\npapers. This dataset reflects typical real-world challenges, including an\nimbalanced data distribution and a substantial amount of unlabeled data that\ncan be potentially useful. Correspondingly, we introduce a QAMatch model,\nspecifically designed to effectively answer chemical questions by fully\nleveraging our collected data. We first address the issue of imbalanced label\ndistribution by re-weighting the instance-wise loss based on the inverse\nfrequency of each class, ensuring minority classes are not dominated by\nmajority ones during optimization. Next, we utilize the unlabeled data to\nenrich the learning process, generating a variety of augmentations based on a\nSoftMix operation and ensuring their predictions align with the same target,\ni.e., pseudo-labels. To ensure the quality of the pseudo-labels, we propose a\ncalibration procedure aimed at closely aligning the pseudo-label estimates of\nindividual samples with a desired ground truth distribution. Experiments show\nthat our QAMatch significantly outperforms the recent similar-scale baselines\nand Large Language Models (LLMs) not only on our ScholarChemQA dataset but also\non four benchmark datasets. We hope our benchmark and model can facilitate and\npromote more research on chemical QA.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}