{"id":"2407.16486","title":"Design of diffractive neural networks solving different classification\n  problems at different wavelengths","authors":"Georgy A. Motz, Leonid L. Doskolovich, Daniil V. Soshnikov, Egor V.\n  Byzov, Evgeni A. Bezus, Nikita V. Golovastikov, Dmitry A. Bykov","authorsParsed":[["Motz","Georgy A.",""],["Doskolovich","Leonid L.",""],["Soshnikov","Daniil V.",""],["Byzov","Egor V.",""],["Bezus","Evgeni A.",""],["Golovastikov","Nikita V.",""],["Bykov","Dmitry A.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:00:33 GMT"}],"updateDate":"2024-07-24","timestamp":1721743233000,"abstract":"  We consider the problem of designing a diffractive neural network (DNN)\nconsisting of a set of sequentially placed phase diffractive optical elements\n(DOEs) and intended for the optical solution of several given classification\nproblems at different operating wavelengths, so that each classification\nproblem is solved at the corresponding wavelength. The problem of calculating\nthe DNN is formulated as the problem of minimizing a functional that depends on\nthe functions of the diffractive microrelief height of the DOEs constituting\nthe DNN and represents the error in solving the given classification problems\nat the operating wavelengths. We obtain explicit and compact expressions for\nthe derivatives of this functional and, using them, formulate a gradient method\nfor the DNN calculation. Using this method, we design DNNs for solving the\nfollowing three classification problems at three different wavelengths: the\nproblem of classifying handwritten digits from the MNIST database, the problem\nof classifying fashion products from the Fashion MNIST database, and the\nproblem of classifying ten handwritten letters from the EMNIST database. The\npresented simulation results of the designed DNNs demonstrate high performance\nof the proposed method.\n","subjects":["Physics/Optics","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}