{"id":"2407.08858","title":"Microbial and Viral Ecology Analysis for Metagenomic Data","authors":"James C. Kosmopoulos and Karthik Anantharaman","authorsParsed":[["Kosmopoulos","James C.",""],["Anantharaman","Karthik",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 20:45:36 GMT"}],"updateDate":"2024-07-15","timestamp":1720730736000,"abstract":"  The explosion in known microbial diversity in the last two decades has made\nit abundantly clear that microbes in the environment do not exist in isolation;\nthey are members of communities. Accordingly, omics approaches such as\nmetagenomics have revealed that interactions between diverse groups of\ncommunity members such as archaea, bacteria, and viruses (bacteriophage) are\ncommon and have significant impacts on entire microbiomes. Thus, to have a\nwell-developed understanding of microbes as they naturally exist in the\nenvironment, biological entities of all kinds must be studied together. While\nnumerous protocols for metagenome analysis exist, comprehensive published\nprotocols for the simultaneous analysis of viruses and prokaryotes together are\nscarce. Further, as bioinformatic methods for microbiology rapidly advance,\nexisting metagenomic tools and pipelines require frequent reevaluation. This\nensures the adherence of best practices for microbiome and metagenomic data\nanalysis. Here, we offer an expansive approach for the joint analysis of bulk\nsequence data from a mixed microbial community (metagenomes) and viral-sized\nfraction communities (viromes). This chapter serves as a beginner's-level guide\nfor researchers with limited bioinformatics expertise who wish to engage in\nmulti-scale metagenome and virome analyses. We cover steps from initial study\ndesign to sequence read processing, metagenome assembly, quality control, virus\nidentification, microbial and viral genome binning, taxonomic characterization,\nspecies-level clustering, and host-virus predictions. We also provide the\nbioinformatic scripts used in our workflow for reuse in one's own computational\nmethods. Lastly, we discuss additional approaches a researcher can take after\nprocessing data with this workflow.\n","subjects":["Quantitative Biology/Quantitative Methods","Quantitative Biology/Genomics"],"license":"http://creativecommons.org/licenses/by/4.0/"}