{"id":"2407.05273","title":"A natural explanation of the VPOS from multistate Scalar Field Dark\n  Matter","authors":"Tula Bernal and Tonatiuh Matos","authorsParsed":[["Bernal","Tula",""],["Matos","Tonatiuh",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 06:12:03 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 15:48:40 GMT"}],"updateDate":"2024-08-22","timestamp":1720332723000,"abstract":"  Observations with the Gaia satellite have confirmed that the satellite\ngalaxies of the Milky Way are not distributed as homogeneously as expected. The\nsame occurs in galaxies such as Andromeda and Centaurus A, where satellite\ngalaxies around their host galaxies have been observed to have orbits aligned\nperpendicular to the galactic plane of the host galaxy. This problem is known\nfor the Milky Way as Vast Polar Structure (VPOS). The Scalar Field Dark Matter\nField (SFDM), also known as Ultralight-, Fuzzy-, BEC-, Axion-dark matter,\nproposes dark matter is a scalar field, which in the non-relativistic limit\nfollows the Schr\\\"odinger equation coupled to the Poisson equation. Although\nthe SF here is classical, the Schr\\\"odinger equation contains a ground and\nexcited states as part of its nature. In this work, we show that such quantum\ncharacter of the SFDM can naturally explain the VPOS observed in galaxies. By\ntaking into account the finite temperature corrections for a complex,\nself-interacting SF at very early epochs of the Universe, we show that with the\nground and first excited states in the Newtonian limit, we can fit the rotation\ncurves of the galaxies. With the best-fit parameters obtained, we can explain\nthe VPOS. We do this with particular galaxies, such as the Milky Way,\nAndromeda, Centaurus A, and six other galaxies whose satellites have been\nobserved. This result shows that the multistate SFDM is not distributed\nhomogeneously around the galaxy, and therefore might explain the anisotropic\ndistribution of the satellite galaxies. According to this result, this could be\na general characteristic of the galaxies in the Universe. Finally, we also show\nhow the scale of each galaxy depends on a parameter that is determined by the\nfinal temperature of the SF of the galaxy halo under study. This explains why\ndifferent galaxies with SFDM give different values of the mass of the SF.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}