{"id":"2407.15914","title":"Studying the 3d Ising surface CFTs on the fuzzy sphere","authors":"Zheng Zhou and Yijian Zou","authorsParsed":[["Zhou","Zheng",""],["Zou","Yijian",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:00:00 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 12:22:38 GMT"},{"version":"v3","created":"Sun, 4 Aug 2024 19:53:04 GMT"},{"version":"v4","created":"Fri, 16 Aug 2024 18:45:39 GMT"}],"updateDate":"2024-08-20","timestamp":1721671200000,"abstract":"  Boundaries not only are fundamental elements in nearly all realistic physical\nsystems, but also greatly enrich the structure of quantum field theories. In\nthis paper, we demonstrate that conformal field theory (CFT) with a boundary,\nknown as surface CFT in three dimensions, can be studied with the setup of\nfuzzy sphere. We consider the example of surface criticality of the 3D Ising\nCFT. We propose two schemes by cutting a boundary in the orbital space or the\nreal space to realise the ordinary and the normal surface CFTs on the fuzzy\nsphere. We obtain the operator spectra through state-operator correspondence.\nWe observe integer spacing of the conformal multiplets, and thus provide direct\nevidence of conformal symmetry. We identify the ordinary surface primary $o$,\nthe displacement operator $\\mathrm{D}$ and their conformal descendants and\nextract their scaling dimensions. We also study the one-point and two-point\ncorrelation functions and extract the bulk-to-surface OPE coefficients, some of\nwhich are reported for the first time. In addition, using the overlap of the\nbulk CFT state and the polarised state, we calculate the boundary central\ncharges of the 3D Ising surface CFTs non-perturbatively. Other conformal data\nobtained in this way also agrees with prior methods.\n","subjects":["Physics/High Energy Physics - Theory","Condensed Matter/Statistical Mechanics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}