{"id":"2407.12591","title":"Theoretical study of the influence of the photosynthetic membrane on\n  B800-B850 energy transfer within the peripheral light-harvesting complex LH2","authors":"Chawntell Kulkarni, Hallmann \\'Oskar Gestsson, Lorenzo Cupellini,\n  Benedetta Mennucci, Alexandra Olaya-Castro","authorsParsed":[["Kulkarni","Chawntell",""],["Gestsson","Hallmann Óskar",""],["Cupellini","Lorenzo",""],["Mennucci","Benedetta",""],["Olaya-Castro","Alexandra",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:13:33 GMT"}],"updateDate":"2024-07-18","timestamp":1721225613000,"abstract":"  Photosynthetic organisms rely on a network of light-harvesting\nprotein-pigment complexes to efficiently absorb sunlight and transfer\nexcitation energy to reaction center proteins for charge separation. In\nphotosynthetic purple bacteria, these complexes are embedded in the cell\nmembrane, where lipid composition affects their clustering and inter-complex\nenergy transfer. However, the lipid bilayer's impact on intra-complex\nexcitation dynamics is less understood. Recent experiments compared\nphoto-excitation dynamics in detergent-isolated light harvesting complex 2\n(LH2) to LH2 embedded in membrane discs mimicking the biological environment,\nrevealing differences in spectra and intra-complex energy transfer rates. We\nuse available quantum chemical and spectroscopy data to develop a complementary\ntheoretical study on the excitonic structure and intra-complex energy transfer\nkinetics of the LH2 from photosynthetic purple bacteria Rhodoblastus\nacidophilus in two conditions: LH2 in a membrane environment and\ndetergent-isolated LH2. Dark excitonic states crucial for B800-B850 energy\ntransfer within LH2 are found to be more delocalised in the membrane model.\nUsing non-perturbative and generalised F\\\"orster calculations, it is shown that\nthe increased quantum delocalisation leads to a B800 to B850 transfer rate 30%\nfaster than in the detergent-isolated complex, consistent with experimental\nresults. We identify the main energy transfer pathways in each environment and\nshow how differences in the B800 to B850 transfer rate stem from changes in\nLH2's electronic properties when embedded in the membrane. By considering\nquasi-static variations of electronic excitation energies in LH2, we show that\nthe broadening of the B800 to B850 transfer rate distribution is affected by\nlipid composition. We argue that the variation in broadening could indicate a\nspeed-accuracy trade-off, common in biological systems.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}