{"id":"2407.09956","title":"Reggae: A Parametric Tuner for PBJam, and a Visualization Tool for Red\n  Giant Oscillation Spectra","authors":"J. M. Joel Ong and Martin B. Nielsen and Emily J. Hatt and Guy R.\n  Davies","authorsParsed":[["Ong","J. M. Joel",""],["Nielsen","Martin B.",""],["Hatt","Emily J.",""],["Davies","Guy R.",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 17:47:59 GMT"}],"updateDate":"2024-07-16","timestamp":1720892879000,"abstract":"  The upcoming second release of PBJam -- a software instrument for fitting\nnormal modes (\"peakbagging\") -- supplements the simple power-spectrum model\nused in the first version to additionally constrain other features. Dipole\n($\\ell = 1$) modes, which had been excluded in the initial version of the tool,\nare now specifically included. The primary samples of the PLATO mission consist\nmainly of main-sequence and subgiant stars, so PBjam implements a single\nparameterisation of dipole mixed-mode frequencies that reduces to pure p-modes\nin the former, and is suitable for use with the latter, outside the red-giant\n\"asymptotic\" regime. In keeping with the overall philosophy of PBjam's design,\nPBjam 2 will specify prior distributions on these parameters empirically,\nthrough predetermined values found for existing samples of solar-like\noscillators. While the red-giant asymptotic regime has been extensively\ncharacterised observationally, the nonasymptotic construction for subgiants\nhere has not, requiring us to construct this prior sample ourselves. To assist\nin this task, we built a tool -- Reggae -- to manually fine-tune and fit the\ndipole-mode model, and check the quality of both our initial guesses and fitted\nsolutions. We have found it very helpful both for these tuning and\nvisualisation tasks, and also as a didactic aid to understanding the dipole\nmixed-mode parameters. Moreover, no other tools currently exist for performing\nthese tasks in the nonasymptotic parameterisation considered here. As such, we\nrelease Reggae publicly in advance of this update to PBjam, as we believe the\ncommunity will benefit from access to such a visualisation tool. This will also\nassist future users of PBjam in devising ad-hoc prior constraints on the\nmixed-mode parameters, should they wish to perform mode identification for\nanomalous stars.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}