{"id":"2407.17176","title":"The Gravitational-wave Optical Transient Observer (GOTO)","authors":"Martin J. Dyer, Kendall Ackley, Felipe Jim\\'enez-Ibarra, Joseph Lyman,\n  Krzysztof Ulaczyk, Danny Steeghs, Duncan K. Galloway, Vik S. Dhillon, Paul\n  O'Brien, Gavin Ramsay, Kanthanakorn Noysena, Rubina Kotak, Rene Breton, Laura\n  Nuttall, Enric Pall\\'e, Don Pollacco, Tom Killestein, Amit Kumar, David\n  O'Neill, Lisa Kelsey, Ben Godson, Dan Jarvis","authorsParsed":[["Dyer","Martin J.",""],["Ackley","Kendall",""],["Jiménez-Ibarra","Felipe",""],["Lyman","Joseph",""],["Ulaczyk","Krzysztof",""],["Steeghs","Danny",""],["Galloway","Duncan K.",""],["Dhillon","Vik S.",""],["O'Brien","Paul",""],["Ramsay","Gavin",""],["Noysena","Kanthanakorn",""],["Kotak","Rubina",""],["Breton","Rene",""],["Nuttall","Laura",""],["Pallé","Enric",""],["Pollacco","Don",""],["Killestein","Tom",""],["Kumar","Amit",""],["O'Neill","David",""],["Kelsey","Lisa",""],["Godson","Ben",""],["Jarvis","Dan",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 11:25:38 GMT"}],"updateDate":"2024-07-25","timestamp":1721820338000,"abstract":"  The Gravitational-wave Optical Transient Observer (GOTO) is a project\ndedicated to identifying optical counter-parts to gravitational-wave detections\nusing a network of dedicated, wide-field telescopes. After almost a decade of\ndesign, construction, and commissioning work, the GOTO network is now fully\noperational with two antipodal sites: La Palma in the Canary Islands and Siding\nSpring in Australia. Both sites host two independent robotic mounts, each with\na field-of-view of 44 square degrees formed by an array of eight 40 cm\ntelescopes, resulting in an instantaneous 88 square degree field-of-view per\nsite. All four telescopes operate as a single integrated network, with the\nultimate aim of surveying the entire sky every 2-3 days and allowing\nnear-24-hour response to transient events within a minute of their detection.\nIn the modern era of transient astronomy, automated telescopes like GOTO form a\nvital link between multi-messenger discovery facilities and in-depth follow-up\nby larger telescopes. GOTO is already producing a wide range of scientific\nresults, assisted by an efficient discovery pipeline and a successful citizen\nscience project: Kilonova Seekers.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}