{"id":"2407.01522","title":"A diagrammatic language for the Causaloid framework","authors":"Nitica Sakharwade, Lucien Hardy","authorsParsed":[["Sakharwade","Nitica",""],["Hardy","Lucien",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 17:59:23 GMT"}],"updateDate":"2024-07-02","timestamp":1719856763000,"abstract":"  The Causaloid framework is an operational approach aimed to house both the\nradical aspects of General Relativity -- dynamic causal structure, and Quantum\nTheory -- indefiniteness, to provide a scaffolding that might be suitable for\nQuantum Gravity by providing a landscape of theories that allow for indefinite\ncausal structure. One may consider it as a generalisation of generalised\nprobability theories (or GPTs) where a priori regions are not assumed to have\nany given causal relationship, to incorporate the possibility of indefinite\ncausal structure. Since its conception, there have been many advances in the\nfield of indefinite causal structure mostly stemming from the work of\nChiribella et al. on the quantum switch and supermaps and from Oreshkov et al.\non causal inequalities and process matrices. These approaches have systems\nmoving along wires and use Hilbert space structure. They violate the standard\ncausality constraints of Quantum Theory and, in this sense, can be regarded as\npost-quantum. The Causaloid approach does not necessarily have systems moving\nalong wires or Hilbert spaces. This is the first paper in a trilogy of papers\naiming to close the gap between the Causaloid (that allows for GPTs) and\npost-quantum studies that employ Hilbert spaces. To do so in the present paper,\nwe provide a diagrammatic language for the Causaloid framework along with new\nterminology for the three levels of physical compression (called Tomographic,\nCompositional, and Meta compression).\n","subjects":["Physics/Quantum Physics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aAyoPiW59AOu37cifSTxKPe3u-Z4ygSqHvGHnNTp4VM","pdfSize":"771260"}
