{"id":"2407.13677","title":"PASTA: Controllable Part-Aware Shape Generation with Autoregressive\n  Transformers","authors":"Songlin Li, Despoina Paschalidou, Leonidas Guibas","authorsParsed":[["Li","Songlin",""],["Paschalidou","Despoina",""],["Guibas","Leonidas",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:52:45 GMT"}],"updateDate":"2024-07-19","timestamp":1721321565000,"abstract":"  The increased demand for tools that automate the 3D content creation process\nled to tremendous progress in deep generative models that can generate diverse\n3D objects of high fidelity. In this paper, we present PASTA, an autoregressive\ntransformer architecture for generating high quality 3D shapes. PASTA comprises\ntwo main components: An autoregressive transformer that generates objects as a\nsequence of cuboidal primitives and a blending network, implemented with a\ntransformer decoder that composes the sequences of cuboids and synthesizes high\nquality meshes for each object. Our model is trained in two stages: First we\ntrain our autoregressive generative model using only annotated cuboidal parts\nas supervision and next, we train our blending network using explicit 3D\nsupervision, in the form of watertight meshes. Evaluations on various ShapeNet\nobjects showcase the ability of our model to perform shape generation from\ndiverse inputs \\eg from scratch, from a partial object, from text and images,\nas well size-guided generation, by explicitly conditioning on a bounding box\nthat defines the object's boundaries. Moreover, as our model considers the\nunderlying part-based structure of a 3D object, we are able to select a\nspecific part and produce shapes with meaningful variations of this part. As\nevidenced by our experiments, our model generates 3D shapes that are both more\nrealistic and diverse than existing part-based and non part-based methods,\nwhile at the same time is simpler to implement and train.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Graphics","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}