{"id":"2407.16277","title":"When, Where, and What? A Novel Benchmark for Accident Anticipation and\n  Localization with Large Language Models","authors":"Haicheng Liao, Yongkang Li, Chengyue Wang, Yanchen Guan, KaHou Tam,\n  Chunlin Tian, Li Li, Chengzhong Xu, Zhenning Li","authorsParsed":[["Liao","Haicheng",""],["Li","Yongkang",""],["Wang","Chengyue",""],["Guan","Yanchen",""],["Tam","KaHou",""],["Tian","Chunlin",""],["Li","Li",""],["Xu","Chengzhong",""],["Li","Zhenning",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 08:29:49 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 06:00:08 GMT"}],"updateDate":"2024-07-29","timestamp":1721723389000,"abstract":"  As autonomous driving systems increasingly become part of daily\ntransportation, the ability to accurately anticipate and mitigate potential\ntraffic accidents is paramount. Traditional accident anticipation models\nprimarily utilizing dashcam videos are adept at predicting when an accident may\noccur but fall short in localizing the incident and identifying involved\nentities. Addressing this gap, this study introduces a novel framework that\nintegrates Large Language Models (LLMs) to enhance predictive capabilities\nacross multiple dimensions--what, when, and where accidents might occur. We\ndevelop an innovative chain-based attention mechanism that dynamically adjusts\nto prioritize high-risk elements within complex driving scenes. This mechanism\nis complemented by a three-stage model that processes outputs from smaller\nmodels into detailed multimodal inputs for LLMs, thus enabling a more nuanced\nunderstanding of traffic dynamics. Empirical validation on the DAD, CCD, and\nA3D datasets demonstrates superior performance in Average Precision (AP) and\nMean Time-To-Accident (mTTA), establishing new benchmarks for accident\nprediction technology. Our approach not only advances the technological\nframework for autonomous driving safety but also enhances human-AI interaction,\nmaking predictive insights generated by autonomous systems more intuitive and\nactionable.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}