{"id":"2407.10848","title":"On the Spectral Efficiency of Multi-user Holographic MIMO Uplink\n  Transmission","authors":"Mengyu Qian, Li You, Xiang-Gen Xia, Xiqi Gao","authorsParsed":[["Qian","Mengyu",""],["You","Li",""],["Xia","Xiang-Gen",""],["Gao","Xiqi",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:00:34 GMT"}],"updateDate":"2024-07-30","timestamp":1721059234000,"abstract":"  With antenna spacing much less than half a wavelength in confined space,\nholographic multiple-input multiple-output (HMIMO) technology presents a\npromising frontier in next-generation mobile communication. We delve into the\nresearch of the multi-user uplink transmission with both the base station and\nthe users equipped with holographic planar arrays. To begin, we construct an\nHMIMO channel model utilizing electromagnetic field equations, accompanied by a\ncolored noise model that accounts for both electromagnetic interference and\nhardware noise. Since this model is continuous, we approximate it within a\nfinite-dimensional space spanned by Fourier space series, which can be defined\nas the communication mode functions. We show that this channel model samples\nGreen's function in the wavenumber domain in different communication modes.\nSubsequently, we tackle the challenging task of maximizing the spectral\nefficiency (SE) of the system, which involves optimizing the continuous current\ndensity function (CDF) for each user. Using the aforementioned approximation\nmodel, we transform the optimization variables into expansion coefficients of\nthe CDFs on a finite-dimensional space, for which we propose an iterative\nwater-filling algorithm. Simulation results illustrate the efficacy of the\nproposed algorithm in enhancing the system SE and show the influence of the\ncolored noise and the system parameters on the SE.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}