{"id":"2407.13758","title":"Inducing topological flat bands in bilayer graphene with electric and\n  magnetic superlattices","authors":"Daniel Seleznev, Jennifer Cano, David Vanderbilt","authorsParsed":[["Seleznev","Daniel",""],["Cano","Jennifer",""],["Vanderbilt","David",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:56:16 GMT"}],"updateDate":"2024-07-19","timestamp":1721325376000,"abstract":"  It was recently argued that Bernal stacked bilayer graphene (BLG) exposed to\na 2D superlattice (SL) potential exhibits a variety of intriguing behaviors\n[Ghorashi et al., Phys. Rev. Lett. 130, 196201 (2023)]. Chief among them is the\nappearance of flat Chern bands that are favorable to the appearance of\nfractional Chern insulator states. Here, we explore the application of\nspatially periodic out-of-plane orbital magnetic fields to the model of\nGhorashi et al. to find additional means of inducing flat Chern bands. We focus\non fields that vary on length scales much larger than the atomic spacing in\nBLG, generating what we refer to as magnetic SLs. The magnetic SLs we\ninvestigate either introduce no net magnetic flux to the SL unit cell, or a\nsingle quantum of flux. We find that magnetic SLs acting on their own can\ninduce topological flat bands, but richer behavior, such as the appearance of\nflat and generic bands with high Chern numbers, can be observed when the\nmagnetic SLs act in conjunction with commensurate electric SLs. Finally, we\npropose a method of generating unit-flux-quantum magnetic SLs along with\nconcomitant electric SLs. The magnetic SL is generated by periodic arrays of\nflux vortices originating from type II superconductors, while the electric SL\narises due to a magnetic SL-induced charge density on the surface of a\nmagnetoelectric material. Tuning the vortex lattice and the magnetoelectric\ncoupling permits control of both SLs, and we study their effects on the band\nstructure of BLG.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}