{"id":"2407.04558","title":"Convex roofs witnessing Kirkwood-Dirac nonpositivity","authors":"Christopher Langrenez and Stephan De Bi\\`evre and David R.M.\n  Arvidsson-Shukur","authorsParsed":[["Langrenez","Christopher",""],["De Bièvre","Stephan",""],["Arvidsson-Shukur","David R. M.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 14:47:32 GMT"}],"updateDate":"2024-07-08","timestamp":1720190852000,"abstract":"  Given two observables $A$ and $B$, one can associate to every quantum state a\nKirkwood-Dirac (KD) quasiprobability distribution. KD distributions are like\njoint classical probabilities except that they can have negative or nonreal\nvalues, which are associated to nonclassical features of the state. In the last\ndecade, KD distributions have come to the forefront as a versatile tool to\ninvestigate and construct quantum advantages and nonclassical phenomena. KD\ndistributions are also used to determine quantum-classical boundaries. To do\nso, one must have witnesses for when a state is KD nonpositive. Previous works\nhave established a relation between the uncertainty of a pure state with\nrespect to the eigenbases of $A$ and $B$ and KD positivity. If this\n$\\textit{support uncertainty}$ is large, the state cannot be KD positive. Here,\nwe construct two witnesses for KD nonpositivity for general mixed states. Our\nfirst witness is the convex roof of the support uncertainty; it is not\nfaithful, but it extends to the convex hull of pure KD-positive states the\nrelation between KD positivity and small support uncertainty. Our other witness\nis the convex roof of the total KD nonpositivity, which provides a faithful\nwitness for the convex hull of the pure KD-positive states. This implies that\nthe convex roof of the total nonpositivity captures the nonpositive nature of\nthe KD distribution at the underlying pure state level.\n","subjects":["Physics/Quantum Physics","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ECozqex18_18bMeI1654QS2DmzuzrDXvrv4CIPvg3B8","pdfSize":"253779"}
