{"id":"2407.14838","title":"Retrieval Augmented Generation Integrated Large Language Models in Smart\n  Contract Vulnerability Detection","authors":"Jeffy Yu","authorsParsed":[["Yu","Jeffy",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 10:46:42 GMT"}],"updateDate":"2024-07-23","timestamp":1721472402000,"abstract":"  The rapid growth of Decentralized Finance (DeFi) has been accompanied by\nsubstantial financial losses due to smart contract vulnerabilities,\nunderscoring the critical need for effective security auditing. With attacks\nbecoming more frequent, the necessity and demand for auditing services has\nescalated. This especially creates a financial burden for independent\ndevelopers and small businesses, who often have limited available funding for\nthese services. Our study builds upon existing frameworks by integrating\nRetrieval-Augmented Generation (RAG) with large language models (LLMs),\nspecifically employing GPT-4-1106 for its 128k token context window. We\nconstruct a vector store of 830 known vulnerable contracts, leveraging Pinecone\nfor vector storage, OpenAI's text-embedding-ada-002 for embeddings, and\nLangChain to construct the RAG-LLM pipeline. Prompts were designed to provide a\nbinary answer for vulnerability detection. We first test 52 smart contracts 40\ntimes each against a provided vulnerability type, verifying the replicability\nand consistency of the RAG-LLM. Encouraging results were observed, with a 62.7%\nsuccess rate in guided detection of vulnerabilities. Second, we challenge the\nmodel under a \"blind\" audit setup, without the vulnerability type provided in\nthe prompt, wherein 219 contracts undergo 40 tests each. This setup evaluates\nthe general vulnerability detection capabilities without hinted context\nassistance. Under these conditions, a 60.71% success rate was observed. While\nthe results are promising, we still emphasize the need for human auditing at\nthis time. We provide this study as a proof of concept for a cost-effective\nsmart contract auditing process, moving towards democratic access to security.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_eyGsPT1gdYh4CK0IJ9BtIFwBi2TISfVNWPAsvp1Le4","pdfSize":"835596"}
