{"id":"2407.00453","title":"PerSEval: Assessing Personalization in Text Summarizers","authors":"Sourish Dasgupta, Ankush Chander, Parth Borad, Isha Motiyani, Tanmoy\n  Chakraborty","authorsParsed":[["Dasgupta","Sourish",""],["Chander","Ankush",""],["Borad","Parth",""],["Motiyani","Isha",""],["Chakraborty","Tanmoy",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 14:37:36 GMT"}],"updateDate":"2024-07-02","timestamp":1719671856000,"abstract":"  Personalized summarization models cater to individuals' subjective\nunderstanding of saliency, as represented by their reading history and current\ntopics of attention. Existing personalized text summarizers are primarily\nevaluated based on accuracy measures such as BLEU, ROUGE, and METEOR. However,\na recent study argued that accuracy measures are inadequate for evaluating the\ndegree of personalization of these models and proposed EGISES, the first metric\nto evaluate personalized text summaries. It was suggested that accuracy is a\nseparate aspect and should be evaluated standalone. In this paper, we challenge\nthe necessity of an accuracy leaderboard, suggesting that relying on\naccuracy-based aggregated results might lead to misleading conclusions. To\nsupport this, we delve deeper into EGISES, demonstrating both theoretically and\nempirically that it measures the degree of responsiveness, a necessary but not\nsufficient condition for degree-of-personalization. We subsequently propose\nPerSEval, a novel measure that satisfies the required sufficiency condition.\nBased on the benchmarking of ten SOTA summarization models on the PENS dataset,\nwe empirically establish that -- (i) PerSEval is reliable w.r.t human-judgment\ncorrelation (Pearson's r = 0.73; Spearman's $\\rho$ = 0.62; Kendall's $\\tau$ =\n0.42), (ii) PerSEval has high rank-stability, (iii) PerSEval as a rank-measure\nis not entailed by EGISES-based ranking, and (iv) PerSEval can be a standalone\nrank-measure without the need of any aggregated ranking.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GMNBK7kUSBrwjRGZk0y-QFnhAaDetPn9CNv3BPZZ8Qc","pdfSize":"1522369"}
