{"id":"2407.00412","title":"C-MASS: Combinatorial Mobility-Aware Sensor Scheduling for Collaborative\n  Perception with Second-Order Topology Approximation","authors":"Yukuan Jia, Yuxuan Sun, Ruiqing Mao, Zhaojun Nan, Sheng Zhou, Zhisheng\n  Niu","authorsParsed":[["Jia","Yukuan",""],["Sun","Yuxuan",""],["Mao","Ruiqing",""],["Nan","Zhaojun",""],["Zhou","Sheng",""],["Niu","Zhisheng",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 11:33:53 GMT"}],"updateDate":"2024-07-02","timestamp":1719660833000,"abstract":"  Collaborative Perception (CP) has been a promising solution to address\nocclusions in the traffic environment by sharing sensor data among\ncollaborative vehicles (CoV) via vehicle-to-everything (V2X) network. With\nlimited wireless bandwidth, CP necessitates task-oriented and receiver-aware\nsensor scheduling to prioritize important and complementary sensor data.\nHowever, due to vehicular mobility, it is challenging and costly to obtain the\nup-to-date perception topology, i.e., whether a combination of CoVs can jointly\ndetect an object. In this paper, we propose a combinatorial mobility-aware\nsensor scheduling (C-MASS) framework for CP with minimal communication\noverhead. Specifically, detections are replayed with sensor data from\nindividual CoVs and pairs of CoVs to maintain an empirical perception topology\nup to the second order, which approximately represents the complete perception\ntopology. A hybrid greedy algorithm is then proposed to solve a variant of the\nbudgeted maximum coverage problem with a worst-case performance guarantee. The\nC-MASS scheduling algorithm adapts the greedy algorithm by incorporating the\ntopological uncertainty and the unexplored time of CoVs to balance exploration\nand exploitation, addressing the mobility challenge. Extensive numerical\nexperiments demonstrate the near-optimality of the proposed C-MASS framework in\nboth edge-assisted and distributed CP configurations. The weighted recall\nimprovements over object-level CP are 5.8% and 4.2%, respectively. Compared to\ndistance-based and area-based greedy heuristics, the gaps to the offline\noptimal solutions are reduced by up to 75% and 71%, respectively.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Information Theory","Computing Research Repository/Multiagent Systems","Computing Research Repository/Networking and Internet Architecture","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}