{"id":"2407.16830","title":"New design paradigm for highly efficient and low noise photodetector","authors":"Sagar Chowdhury, Rituraj, Srini Krishnamurthy, Vidya Praveen\n  Bhallamudi","authorsParsed":[["Chowdhury","Sagar",""],["Rituraj","",""],["Krishnamurthy","Srini",""],["Bhallamudi","Vidya Praveen",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 20:40:18 GMT"}],"updateDate":"2024-07-25","timestamp":1721767218000,"abstract":"  Achieving high quantum efficiency (QE) with low dark count is essential for\nhighly sensitive photodetectors (PDs), including single photon avalanche\ndetectors (SPADs). However, high QE requires a thicker absorber region, which\nleads to high dark current and noise, which in turn affects the detectivity of\nPDs and the photodetection efficiency and dark count of SPADs.The holy grail of\nphotodetector and avalanche photodiode designs is to achieve highest QE with\nthinnest absorber and still enable large avalanche to gain as needed. We have\ndeveloped a new design paradigm which exploits the coupling between dielectric\nMie resonance and transverse propagating waves in thin layers. The Mie\nresonance launches the incident light at an angle in an ultrathin absorber, and\nwhen coupled to transverse waves, the light propagates laterally and is fully\nabsorbed owing to the longer optical path. Consequently, with appropriate\nchoice of materials for a chosen wavelength, a high absorption(~90%) within\ntypically <100 nm absorber thickness is possible. For illustration, we apply\nour approach to design Si-based detector operating at 810 nm and InGaAs-based\ndetector operating at 1550 nm and predict that the dark current at room\ntemperature is reduced at least by two orders of magnitude. In addition, the\nlateral distances are often in a few microns and hence these designs can\npotentially enable avalanching for a large optical gain.\n","subjects":["Physics/Applied Physics","Physics/Optics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"77sKSbjV_8P1YS4AiQU0yG0GuLt4Ylhan9alRuUHFo0","pdfSize":"853387"}
