{"id":"2407.14036","title":"Ultra-compact beam steering nanolasers","authors":"Xinghong Chen, Mingxuan Gu, Jiankai Tang, Yungang Sang, Bingrui Xiang,\n  Kong Zhang, Guanjie Zhang, Xingyuan Wang, Xuhan Guo, Linjie Zhou, Wengang Wu,\n  Yifei Mao","authorsParsed":[["Chen","Xinghong",""],["Gu","Mingxuan",""],["Tang","Jiankai",""],["Sang","Yungang",""],["Xiang","Bingrui",""],["Zhang","Kong",""],["Zhang","Guanjie",""],["Wang","Xingyuan",""],["Guo","Xuhan",""],["Zhou","Linjie",""],["Wu","Wengang",""],["Mao","Yifei",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 05:19:31 GMT"}],"updateDate":"2024-07-22","timestamp":1721366371000,"abstract":"  The miniaturization and integration of beam steering devices have\nconsistently been the focus of the field. Conventional methods alter the\neigenmode of the optical cavity by regulating the refractive index. Due to the\nweak nonlinear effect of the optical system, the device must be sufficiently\nlarge to achieve sufficient light modulation. The effective method for\nminiaturizing beam steering devices currently in use is based on metasurfaces.\nHowever, this type of device necessitates the input of a laser source, which\nprecludes the simultaneous generation and control of light in a single device.\nHere we propose a miniaturized beam steering device that employs mode selection\nbetween different bound states in the continuum (BIC) states through phase\nchange material. The device is capable of simultaneously achieving both light\ngeneration and beam steering (33{\\deg}) in a single device with a size of only\n25 {\\mu}m and with a low threshold of 8.9 kW cm-2. Furthermore,it is possible\nto achieve a significant degree of dynamic wavelength tunability, with a range\nextending up to 296 nm. This method achieves high-efficient regulation of light\nproperties by dynamically controlling the system's topological charge,\ncircumventing the problem of weak nonlinearity in traditional methods.\nFurthermore, the integration of phase change materials with nanolasers enables\nthe direct alteration of lasing properties, which provides a novel idea for\ndynamic light control. The device process scheme based on phase change\nmaterials is straightforward, direct, and highly compatible, which will be\nadvantageous for its intended application.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}