{"id":"2407.21448","title":"Accelerating Image Super-Resolution Networks with Pixel-Level\n  Classification","authors":"Jinho Jeong, Jinwoo Kim, Younghyun Jo, Seon Joo Kim","authorsParsed":[["Jeong","Jinho",""],["Kim","Jinwoo",""],["Jo","Younghyun",""],["Kim","Seon Joo",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 08:53:10 GMT"}],"updateDate":"2024-08-01","timestamp":1722415990000,"abstract":"  In recent times, the need for effective super-resolution (SR) techniques has\nsurged, especially for large-scale images ranging 2K to 8K resolutions. For\nDNN-based SISR, decomposing images into overlapping patches is typically\nnecessary due to computational constraints. In such patch-decomposing scheme,\none can allocate computational resources differently based on each patch's\ndifficulty to further improve efficiency while maintaining SR performance.\nHowever, this approach has a limitation: computational resources is uniformly\nallocated within a patch, leading to lower efficiency when the patch contain\npixels with varying levels of restoration difficulty. To address the issue, we\npropose the Pixel-level Classifier for Single Image Super-Resolution (PCSR), a\nnovel method designed to distribute computational resources adaptively at the\npixel level. A PCSR model comprises a backbone, a pixel-level classifier, and a\nset of pixel-level upsamplers with varying capacities. The pixel-level\nclassifier assigns each pixel to an appropriate upsampler based on its\nrestoration difficulty, thereby optimizing computational resource usage. Our\nmethod allows for performance and computational cost balance during inference\nwithout re-training. Our experiments demonstrate PCSR's advantage over existing\npatch-distributing methods in PSNR-FLOP trade-offs across different backbone\nmodels and benchmarks. The code is available at\nhttps://github.com/3587jjh/PCSR.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}