{"id":"2407.15996","title":"A Statistical Analysis of Crab Pulsar Giant Pulse Rates","authors":"Graham M. Doskoch, Andrea Basuroski, Kriisa Halley, Avinash Sookram,\n  Iliomar Rodriguez-Ramos, Valmik Nahata, Zahi Rahman, Maureen Zhang, Ashish\n  Uhlmann, Abby Lynch, Natalia Lewandowska, Nohely Miranda, Ann Schmiedekamp,\n  Carl Schmiedekamp, Maura A. McLaughlin, Daniel E. Reichart, Joshua B.\n  Haislip, Vladimir V. Kouprianov, Steve White, Frank Ghigo, Sue Ann Heatherly","authorsParsed":[["Doskoch","Graham M.",""],["Basuroski","Andrea",""],["Halley","Kriisa",""],["Sookram","Avinash",""],["Rodriguez-Ramos","Iliomar",""],["Nahata","Valmik",""],["Rahman","Zahi",""],["Zhang","Maureen",""],["Uhlmann","Ashish",""],["Lynch","Abby",""],["Lewandowska","Natalia",""],["Miranda","Nohely",""],["Schmiedekamp","Ann",""],["Schmiedekamp","Carl",""],["McLaughlin","Maura A.",""],["Reichart","Daniel E.",""],["Haislip","Joshua B.",""],["Kouprianov","Vladimir V.",""],["White","Steve",""],["Ghigo","Frank",""],["Heatherly","Sue Ann",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 19:08:56 GMT"}],"updateDate":"2024-07-24","timestamp":1721675336000,"abstract":"  A small number of pulsars are known to emit giant pulses, single pulses much\nbrighter than average. Among these is PSR J0534+2200, also known as the Crab\npulsar, a young pulsar with high giant pulse rates. Long-term monitoring of the\nCrab pulsar presents an excellent opportunity to perform statistical studies of\nits giant pulses and the processes affecting them, potentially providing\ninsight into the behavior of other neutron stars that emit bright single\npulses. Here, we present an analysis of a set of 24,985 Crab giant pulses\nobtained from 88 hours of daily observations at a center frequency of 1.55 GHz\nby the 20-meter telescope at the Green Bank Observatory, spread over 461 days.\nWe study the effects of refractive scintillation at higher frequencies than\nprevious studies and compare methods of correcting for this effect. We also\nsearch for deterministic patterns seen in other single-pulse sources, possible\nperiodicities seen in several rotating radio transients and fast radio bursts,\nand clustering of giant pulses like that seen in the repeating fast radio burst\nFRB121102.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}