{"id":"2407.17565","title":"Periodicity significance testing with null-signal templates:\n  reassessment of PTF's SMBH binary candidates","authors":"Jakob Robnik, Adrian E. Bayer, Maria Charisi, Zolt\\'an Haiman, Allison\n  Lin and Uro\\v{s} Seljak","authorsParsed":[["Robnik","Jakob",""],["Bayer","Adrian E.",""],["Charisi","Maria",""],["Haiman","Zoltán",""],["Lin","Allison",""],["Seljak","Uroš",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 18:00:09 GMT"}],"updateDate":"2024-07-26","timestamp":1721844009000,"abstract":"  Periodograms are widely employed for identifying periodicity in time series\ndata, yet they often struggle to accurately quantify the statistical\nsignificance of detected periodic signals when the data complexity precludes\nreliable simulations. We develop a data-driven approach to address this\nchallenge by introducing a null-signal template (NST). The NST is created by\ncarefully randomizing the period of each cycle in the periodogram template,\nrendering it non-periodic. It has the same frequentist properties as a periodic\nsignal template regardless of the noise probability distribution, and we show\nwith simulations that the distribution of false positives is the same as with\nthe original periodic template, regardless of the underlying data. Thus,\nperforming a periodicity search with the NST acts as an effective simulation of\nthe null (no-signal) hypothesis, without having to simulate the noise\nproperties of the data. We apply the NST method to the supermassive black hole\nbinaries (SMBHB) search in the Palomar Transient Factory (PTF), where Charisi\net al. had previously proposed 33 high signal to (white) noise candidates\nutilizing simulations to quantify their significance. Our approach reveals that\nthese simulations do not capture the complexity of the real data. There are no\nstatistically significant periodic signal detections above the non-periodic\nbackground. To improve the search sensitivity we introduce a Gaussian\nquadrature based algorithm for the Bayes Factor with correlated noise as a test\nstatistic, in contrast to the standard signal to white noise. We show with\nsimulations that this improves sensitivity to true signals by more than an\norder of magnitude. However, using the Bayes Factor approach also results in no\nstatistically significant detections in the PTF data.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Instrumentation and Methods for Astrophysics","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fmpPn2o0nUoq4sqh24lIqEdFXbubIFtxnKKbwRVIUbc","pdfSize":"2112639"}
