{"id":"2407.13100","title":"Participatory Approaches in AI Development and Governance: A Principled\n  Approach","authors":"Ambreesh Parthasarathy, Aditya Phalnikar, Ameen Jauhar, Dhruv\n  Somayajula, Gokul S Krishnan, Balaraman Ravindran","authorsParsed":[["Parthasarathy","Ambreesh",""],["Phalnikar","Aditya",""],["Jauhar","Ameen",""],["Somayajula","Dhruv",""],["Krishnan","Gokul S",""],["Ravindran","Balaraman",""]],"versions":[{"version":"v1","created":"Mon, 3 Jun 2024 09:49:42 GMT"}],"updateDate":"2024-07-19","timestamp":1717408182000,"abstract":"  The widespread adoption of Artificial Intelligence (AI) technologies in the\npublic and private sectors has resulted in them significantly impacting the\nlives of people in new and unexpected ways. In this context, it becomes\nimportant to inquire how their design, development and deployment takes place.\nUpon this inquiry, it is seen that persons who will be impacted by the\ndeployment of these systems have little to no say in how they are developed.\nSeeing this as a lacuna, this research study advances the premise that a\nparticipatory approach is beneficial (both practically and normatively) to\nbuilding and using more responsible, safe, and human-centric AI systems.\nNormatively, it enhances the fairness of the process and empowers citizens in\nvoicing concerns to systems that may heavily impact their lives. Practically,\nit provides developers with new avenues of information which will be beneficial\nto them in improving the quality of the AI algorithm. The paper advances this\nargument first, by describing the life cycle of an AI system; second, by\nidentifying criteria which may be used to identify relevant stakeholders for a\nparticipatory exercise; and third, by mapping relevant stakeholders to\ndifferent stages of AI lifecycle. This paper forms the first part of a two-part\nseries on participatory governance in AI. The second paper will expand upon and\nconcretise the principles developed in this paper and apply the same to actual\nuse cases of AI systems.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}