{"id":"2407.00719","title":"A Whole-Process Certifiably Robust Aggregation Method Against Backdoor\n  Attacks in Federated Learning","authors":"Anqi Zhou, Yezheng Liu, Yidong Chai, Hongyi Zhu, Xinyue Ge, Yuanchun\n  Jiang, Meng Wang","authorsParsed":[["Zhou","Anqi",""],["Liu","Yezheng",""],["Chai","Yidong",""],["Zhu","Hongyi",""],["Ge","Xinyue",""],["Jiang","Yuanchun",""],["Wang","Meng",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 15:00:49 GMT"}],"updateDate":"2024-07-02","timestamp":1719759649000,"abstract":"  Federated Learning (FL) has garnered widespread adoption across various\ndomains such as finance, healthcare, and cybersecurity. Nonetheless, FL remains\nunder significant threat from backdoor attacks, wherein malicious actors insert\ntriggers into trained models, enabling them to perform certain tasks while\nstill meeting FL's primary objectives. In response, robust aggregation methods\nhave been proposed, which can be divided into three types: ex-ante, ex-durante,\nand ex-post methods. Given the complementary nature of these methods, combining\nall three types is promising yet unexplored. Such a combination is non-trivial\nbecause it requires leveraging their advantages while overcoming their\ndisadvantages. Our study proposes a novel whole-process certifiably robust\naggregation (WPCRA) method for FL, which enhances robustness against backdoor\nattacks across three phases: ex-ante, ex-durante, and ex-post. Moreover, since\nthe current geometric median estimation method fails to consider differences\namong clients, we propose a novel weighted geometric median estimation\nalgorithm (WGME). This algorithm estimates the geometric median of model\nupdates from clients based on each client's weight, further improving the\nrobustness of WPCRA against backdoor attacks. We also theoretically prove that\nWPCRA offers improved certified robustness guarantees with a larger certified\nradius. We evaluate the advantages of our methods based on the task of loan\nstatus prediction. Comparison with baselines shows that our methods\nsignificantly improve FL's robustness against backdoor attacks. This study\ncontributes to the literature with a novel WPCRA method and a novel WGME\nalgorithm. Our code is available at https://github.com/brick-brick/WPCRAM.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}