{"id":"2407.19552","title":"Filamentary mass accretion towards the high-mass protobinary system\n  G11.92-0.61 MM2","authors":"S. Zhang, C. J. Cyganowski, J. D. Henshaw, C. L. Brogan, T. R. Hunter,\n  R. Friesen, I. A. Bonnell, S. Viti","authorsParsed":[["Zhang","S.",""],["Cyganowski","C. J.",""],["Henshaw","J. D.",""],["Brogan","C. L.",""],["Hunter","T. R.",""],["Friesen","R.",""],["Bonnell","I. A.",""],["Viti","S.",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 18:19:48 GMT"}],"updateDate":"2024-07-30","timestamp":1722190788000,"abstract":"  We present deep, sub-arcsecond ($\\sim$2000 AU) resolution ALMA 0.82 mm\nobservations of the former high-mass prestellar core candidate G11.92-0.61 MM2,\nrecently shown to be an $\\sim$500 AU-separation protobinary. Our observations\nshow that G11.92-0.61 MM2, located in the G11.92-0.61 protocluster, lies on a\nfilamentary structure traced by 0.82 mm continuum and N$_2$H$^+$(4-3) emission.\nThe N$_2$H$^+$(4-3) spectra are multi-peaked, indicative of multiple velocity\ncomponents along the line of sight. To analyse the gas kinematics, we performed\npixel-by-pixel Gaussian decomposition of the N$_2$H$^+$ spectra using SCOUSEPY\nand hierarchical clustering of the extracted velocity components using ACORNS.\nSeventy velocity- and position-coherent clusters (called \"trees\") are\nidentified in the N$_2$H$^+$-emitting gas, with the 8 largest trees accounting\nfor >60% of the fitted velocity components. The primary tree, with $\\sim$20% of\nthe fitted velocity components, displays a roughly north-south velocity\ngradient along the filamentary structure traced by the 0.82 mm continuum.\nAnalysing a $\\sim$0.17 pc-long substructure, we interpret its velocity gradient\nof $\\sim$10.5 km s$^{-1}$pc$^{-1}$ as tracing filamentary accretion towards MM2\nand estimate a mass inflow rate of $\\sim$1.8$\\times10^{-4}$ to\n1.2$\\times10^{-3}$ M$_\\odot$ yr$^{-1}$. Based on the recent detection of a\nbipolar molecular outflow associated with MM2, accretion onto the protobinary\nis ongoing, likely fed by the larger-scale filamentary accretion flows. If 50%\nof the filamentary inflow reaches the protostars, each member of the\nprotobinary would attain a mass of 8 M$_\\odot$ within $\\sim1.6\\times$10$^5$ yr,\ncomparable to the combined timescale of the 70 $\\mu$m- and MIR-weak phases\nderived for ATLASGAL-TOP100 massive clumps using chemical clocks.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}