{"id":"2407.14634","title":"Informational Health --Toward the Reduction of Risks in the Information\n  Space","authors":"Fujio Toriumi, Tatsuhiko Yamamoto","authorsParsed":[["Toriumi","Fujio",""],["Yamamoto","Tatsuhiko",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 19:12:05 GMT"}],"updateDate":"2024-07-23","timestamp":1721416325000,"abstract":"  The modern information society, markedly influenced by the advent of the\ninternet and subsequent developments such as WEB 2.0, has seen an explosive\nincrease in information availability, fundamentally altering human interaction\nwith information spaces. This transformation has facilitated not only\nunprecedented access to information but has also raised significant challenges,\nparticularly highlighted by the spread of ``fake news'' during critical events\nlike the 2016 U.S. presidential election and the COVID-19 pandemic. The latter\nevent underscored the dangers of an ``infodemic,'' where the large amount of\ninformation made distinguishing between factual and non-factual content\ndifficult, thereby complicating public health responses and posing risks to\ndemocratic processes. In response to these challenges, this paper introduces\nthe concept of ``informational health,'' drawing an analogy between dietary\nhabits and information consumption. It argues that just as balanced diets are\ncrucial for physical health, well-considered nformation behavior is essential\nfor maintaining a healthy information environment. This paper proposes three\nstrategies for fostering informational health: literacy education,\nvisualization of meta-information, and informational health assessments. These\nstrategies aim to empower users and platforms to navigate and enhance the\ninformation ecosystem effectively. By focusing on long-term informational\nwell-being, we highlight the necessity of addressing the social risks inherent\nin the current attention economy, advocating for a paradigm shift towards a\nmore sustainable information consumption model.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0fX31-ANJQWI4rUESEob_Nxep0EmXc91dMhtEiMltdo","pdfSize":"121734"}
