{"id":"2407.10938","title":"Comparing AI versus Optimization Workflows for Simulation-Based\n  Inference of Spatial-Stochastic Systems","authors":"Michael A. Ramirez-Sierra, Thomas R. Sokolowski","authorsParsed":[["Ramirez-Sierra","Michael A.",""],["Sokolowski","Thomas R.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:37:03 GMT"}],"updateDate":"2024-07-16","timestamp":1721065023000,"abstract":"  Model parameter inference is a universal problem across science. This\nchallenge is particularly pronounced in developmental biology, where faithful\nmechanistic descriptions require spatial-stochastic models with numerous\nparameters, yet quantitative empirical data often lack sufficient granularity\ndue to experimental limitations. Parameterizing such complex models thus\nnecessitates methods that elaborate on classical Bayesian inference by\nincorporating notions of optimality and goal-orientation through\nlow-dimensional objective functions that quantitatively capture the target\nbehavior of the underlying system. In this study, we contrast two such\ninference workflows and apply them to biophysics-inspired spatial-stochastic\nmodels. Technically, both workflows are simulation-based inference (SBI)\nmethods. The first method leverages a modern deep-learning technique known as\nsequential neural posterior estimation (SNPE), while the second is based on a\nclassical optimization technique called simulated annealing (SA). We evaluate\nthese workflows by inferring the parameters of two complementary models for the\ninner cell mass (ICM) lineage differentiation in the blastocyst-stage mouse\nembryo. This developmental biology system serves as a paradigmatic example of a\nhighly robust and reproducible cell-fate proportioning process that\nself-organizes under strongly stochastic conditions, such as intrinsic\nbiochemical noise and cell-cell signaling delays. Our results indicate that\nwhile both methods largely agree in their predictions, the modern SBI workflow\nprovides substantially richer inferred distributions at an equivalent\ncomputational cost. We identify the computational scenarios that favor the\nmodern SBI method over its classical counterpart. Finally, we propose a\nplausible approach to integrate these two methods, thereby synergistically\nexploiting their parameter space exploration capabilities.\n","subjects":["Physics/Biological Physics","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/"}