{"id":"2407.20672","title":"Orientational disorder and molecular correlations in hybrid\n  organic-inorganic perovskites: From fundamental insights to technological\n  applications","authors":"Carlos Escorihuela-Sayalero, Ares Sanuy, Luis Carlos Pardo, Claudio\n  Cazorla","authorsParsed":[["Escorihuela-Sayalero","Carlos",""],["Sanuy","Ares",""],["Pardo","Luis Carlos",""],["Cazorla","Claudio",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 09:09:50 GMT"}],"updateDate":"2024-07-31","timestamp":1722330590000,"abstract":"  Hybrid organic-inorganic perovskites (HOIP) have emerged in recent years as\nhighly promising semiconducting materials for a wide range of optoelectronic\nand energy applications. Nevertheless, the rotational dynamics of the organic\ncomponents and many molecule interdependencies, which may strongly impact the\nfunctional properties of HOIP, are not yet fully understood. In this study, we\nquantitatively analyze the orientational disorder and molecular correlations in\nthe archetypal perovskite CH$_{3}$NH$_{3}$PbI$_{3}$ (MAPI) by performing\ncomprehensive molecular dynamics simulations and entropy calculations. We found\nthat, in addition to the usual vibrational and orientational contributions,\nrigid molecular rotations around the C-N axis and correlations between\nneighboring molecules noticeably contribute to the entropy increment associated\nwith the temperature-induced order-disorder phase transition in MAPI, $\\Delta\nS_{t}$. Molecular conformational changes are equally infrequent in the low-$T$\nordered and high-$T$ disordered phases and have a null effect on $\\Delta\nS_{t}$. Conversely, the couplings between the angular and vibrational degrees\nof freedom are substantially reinforced in the high-$T$ disordered phase and\nsignificantly counteract the phase-transition entropy increase resulting from\nother factors. Furthermore, the tendency for neighboring molecules to be\norientationally ordered is markedly local, consequently inhibiting the\nformation of extensive polar nanodomains both at low and high temperatures.\nThis theoretical investigation not only advances the fundamental knowledge of\nHOIP but also establishes physically insightful connections with contemporary\ntechnological applications like photovoltaics and solid-state cooling.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}