{"id":"2407.12137","title":"Combining data from multiple sources for urban travel mode choice\n  modelling","authors":"Maciej Grzenda, Marcin Luckner, Jakub Zawieska, Przemys{\\l}aw Wrona","authorsParsed":[["Grzenda","Maciej",""],["Luckner","Marcin",""],["Zawieska","Jakub",""],["Wrona","Przemysław",""]],"versions":[{"version":"v1","created":"Wed, 15 May 2024 16:41:53 GMT"}],"updateDate":"2024-07-18","timestamp":1715791313000,"abstract":"  Demand for sustainable mobility is particularly high in urban areas. Hence,\nthere is a growing need to predict when people will decide to use different\ntravel modes with an emphasis on environmentally friendly travel modes. As\ntravel mode choice (TMC) is influenced by multiple factors, in a growing number\nof cases machine learning methods are used to predict travel mode choices given\nrespondent and journey features. Typically, travel diaries are used to provide\ncore relevant data. However, other features such as attributes of mode\nalternatives including, but not limited to travel times, and, in the case of\npublic transport (PT), also walking distances have a major impact on whether a\nperson decides to use a travel mode of interest.\n  Hence, in this work, we propose an architecture of a software platform\nperforming the data fusion combining data documenting journeys with the\nfeatures calculated to summarise transport options available for these\njourneys, built environment and environmental factors such as weather\nconditions possibly influencing travel mode decisions. Furthermore, we propose\nvarious novel features, many of which we show to be among the most important\nfor TMC prediction. We propose how stream processing engines and other Big Data\nsystems can be used for their calculation.\n  The data processed by the platform is used to develop machine learning models\npredicting travel mode choices. To validate the platform, we propose ablation\nstudies investigating the importance of individual feature subsets calculated\nby it and their impact on the TMC models built with them. In our experiments,\nwe combine survey data, GPS traces, weather and pollution time series,\ntransport model data, and spatial data of the built environment. The growth in\nthe accuracy of TMC models built with the additional features is up to 18.2%\ncompared to the use of core survey data only.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"5hAkumKYZ_Mt8l03I0RKozHnuJ9TevIHmXPvw3zG4wM","pdfSize":"2977105"}
