{"id":"2407.01707","title":"Humidity-Aware Model Predictive Control for Residential Air\n  Conditioning: A Field Study","authors":"Elias N. Pergantis, Parveen Dhillon, Levi D. Reyes Premer, Alex H.\n  Lee, Davide Ziviani, Kevin J. Kircher","authorsParsed":[["Pergantis","Elias N.",""],["Dhillon","Parveen",""],["Premer","Levi D. Reyes",""],["Lee","Alex H.",""],["Ziviani","Davide",""],["Kircher","Kevin J.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:32:52 GMT"},{"version":"v2","created":"Sun, 15 Sep 2024 15:12:05 GMT"}],"updateDate":"2024-09-17","timestamp":1719858772000,"abstract":"  Model predictive control of residential air conditioning could reduce energy\ncosts and greenhouse gas emissions while maintaining or improving occupants'\nthermal comfort. However, most approaches to predictive air conditioning\ncontrol either do not model indoor humidity or treat it as constant. This\nsimplification stems from challenges with modeling indoor humidity dynamics,\nparticularly the high-order, nonlinear equations that govern heat and mass\ntransfer between the air conditioner's evaporator coil and the indoor air. This\npaper develops a machine-learning approach to modeling indoor humidity dynamics\nthat is suitable for real-world deployment at scale. This study then\ninvestigates the value of humidity modeling in four field tests of predictive\ncontrol in an occupied house. The four field tests evaluate two different\nbuilding models: One with constant humidity and one with time-varying humidity.\nEach modeling approach is tested in two different predictive controllers: One\nthat focuses on reducing energy costs and one that focuses on constraining\nelectric power below a utility-specified threshold. The two models lead to\nsimilar performance for reducing energy costs. Combining the results of this\nstudy and a prior heating study of the same house, the estimated year-round\nenergy cost savings were $340-497 or 22-31% (95% confidence intervals); these\nsavings were consistent across both humidity models. However, in the demand\nresponse tests, the simplifying assumption of constant humidity led to far more\nfrequent and severe violations of the power constraint. These results suggest\nthat accurate building models are important for nonlinear objectives, such as\nreducing or constraining peak demand, while for linear objectives such as\nreducing energy costs or emissions, model accuracy is less important.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}