{"id":"2407.15363","title":"Blueprinting the Cloud: Unifying and Automatically Optimizing Cloud Data\n  Infrastructures with BRAD -- Extended Version","authors":"Geoffrey X. Yu, Ziniu Wu, Ferdi Kossmann, Tianyu Li, Markos Markakis,\n  Amadou Ngom, Samuel Madden, Tim Kraska","authorsParsed":[["Yu","Geoffrey X.",""],["Wu","Ziniu",""],["Kossmann","Ferdi",""],["Li","Tianyu",""],["Markakis","Markos",""],["Ngom","Amadou",""],["Madden","Samuel",""],["Kraska","Tim",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 04:09:32 GMT"}],"updateDate":"2024-07-31","timestamp":1721621372000,"abstract":"  Modern organizations manage their data with a wide variety of specialized\ncloud database engines (e.g., Aurora, BigQuery, etc.). However, designing and\nmanaging such infrastructures is hard. Developers must consider many possible\ndesigns with non-obvious performance consequences; moreover, current software\nabstractions tightly couple applications to specific systems (e.g., with\nengine-specific clients), making it difficult to change after initial\ndeployment. A better solution would virtualize cloud data management, allowing\ndevelopers to declaratively specify their workload requirements and rely on\nautomated solutions to design and manage the physical realization. In this\npaper, we present a technique called blueprint planning that achieves this\nvision. The key idea is to project data infrastructure design decisions into a\nunified design space (blueprints). We then systematically search over candidate\nblueprints using cost-based optimization, leveraging learned models to predict\nthe utility of a blueprint on the workload. We use this technique to build\nBRAD, the first cloud data virtualization system. BRAD users issue queries to a\nsingle SQL interface that can be backed by multiple cloud database services.\nBRAD automatically selects the most suitable engine for each query, provisions\nand manages resources to minimize costs, and evolves the infrastructure to\nadapt to workload shifts. Our evaluation shows that BRAD meet user-defined\nperformance targets and improve cost-savings by 1.6-13x compared to serverless\nauto-scaling or HTAP systems.\n","subjects":["Computing Research Repository/Databases"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}