{"id":"2407.14754","title":"Representing Topological Self-Similarity Using Fractal Feature Maps for\n  Accurate Segmentation of Tubular Structures","authors":"Jiaxing Huang, Yanfeng Zhou, Yaoru Luo, Guole Liu, Heng Guo, Ge Yang","authorsParsed":[["Huang","Jiaxing",""],["Zhou","Yanfeng",""],["Luo","Yaoru",""],["Liu","Guole",""],["Guo","Heng",""],["Yang","Ge",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 05:22:59 GMT"}],"updateDate":"2024-07-23","timestamp":1721452979000,"abstract":"  Accurate segmentation of long and thin tubular structures is required in a\nwide variety of areas such as biology, medicine, and remote sensing. The\ncomplex topology and geometry of such structures often pose significant\ntechnical challenges. A fundamental property of such structures is their\ntopological self-similarity, which can be quantified by fractal features such\nas fractal dimension (FD). In this study, we incorporate fractal features into\na deep learning model by extending FD to the pixel-level using a sliding window\ntechnique. The resulting fractal feature maps (FFMs) are then incorporated as\nadditional input to the model and additional weight in the loss function to\nenhance segmentation performance by utilizing the topological self-similarity.\nMoreover, we extend the U-Net architecture by incorporating an edge decoder and\na skeleton decoder to improve boundary accuracy and skeletal continuity of\nsegmentation, respectively. Extensive experiments on five tubular structure\ndatasets validate the effectiveness and robustness of our approach.\nFurthermore, the integration of FFMs with other popular segmentation models\nsuch as HR-Net also yields performance enhancement, suggesting FFM can be\nincorporated as a plug-in module with different model architectures. Code and\ndata are openly accessible at\nhttps://github.com/cbmi-group/FFM-Multi-Decoder-Network.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}