{"id":"2407.05692","title":"Global realisation of magnetic fields as 1$\\frac{1}{2}$D Hamiltonian\n  systems","authors":"Nathan Duignan, David Perrella, David Pfefferl\\'e","authorsParsed":[["Duignan","Nathan",""],["Perrella","David",""],["Pfefferlé","David",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 07:47:22 GMT"}],"updateDate":"2024-07-09","timestamp":1720424842000,"abstract":"  The paper reviews the notion of $n+\\frac{1}{2}$D non-autonomous Hamiltonian\nsystems, portraying their dynamics as the flow of the Reeb field related to a\nclosed two-form of maximal rank on a cosymplectic manifold, and naturally\ndecomposing into time-like and Hamiltonian components. The paper then\ninvestigates the conditions under which the field-line dynamics of a\n(tangential) divergence-free vector field on a connected compact three-manifold\n(possibly with boundary) diffeomorphic to a trivial fibre bundle over the\ncircle can be conversely identified as a non-autonomous $1\\frac{1}{2}$D\nHamiltonian system. Under the assumption that the field is transverse to a\nglobal compact Poincar\\'e section, an adaptation of Moser's trick shows that\nall such fields are locally-Hamiltonian. A full identification is established\nupon further assuming that the Poincar\\'e sections are planar, which crucially\nimplies (together with Dirichlet boundary conditions) that the cohomology class\nof the generating closed one-forms on each section is constant. By reviewing\nthe classification of fibre bundles over the circle using the monodromy\nrepresentation, it is remarked that as soon as the Poincar\\'e section of an\nalleged field is diffeomorphic to a disk or an annulus, the domain is\nnecessarily diffeomorphic to a solid or hollow torus, and thus its field-line\ndynamics can always be identified as a non-autonomous Hamiltonian system.\n","subjects":["Physics/Mathematical Physics","Mathematics/Dynamical Systems","Mathematics/Mathematical Physics","Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LRAK75zGW-x5HM7wtRV73dryicFDJMLezmD2PX86ys4","pdfSize":"932382"}
