{"id":"2407.04963","title":"Towards Context-Aware Emotion Recognition Debiasing from a Causal\n  Demystification Perspective via De-confounded Training","authors":"Dingkang Yang, Kun Yang, Haopeng Kuang, Zhaoyu Chen, Yuzheng Wang,\n  Lihua Zhang","authorsParsed":[["Yang","Dingkang",""],["Yang","Kun",""],["Kuang","Haopeng",""],["Chen","Zhaoyu",""],["Wang","Yuzheng",""],["Zhang","Lihua",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 05:29:02 GMT"}],"updateDate":"2024-07-09","timestamp":1720243742000,"abstract":"  Understanding emotions from diverse contexts has received widespread\nattention in computer vision communities. The core philosophy of Context-Aware\nEmotion Recognition (CAER) is to provide valuable semantic cues for recognizing\nthe emotions of target persons by leveraging rich contextual information.\nCurrent approaches invariably focus on designing sophisticated structures to\nextract perceptually critical representations from contexts. Nevertheless, a\nlong-neglected dilemma is that a severe context bias in existing datasets\nresults in an unbalanced distribution of emotional states among different\ncontexts, causing biased visual representation learning. From a causal\ndemystification perspective, the harmful bias is identified as a confounder\nthat misleads existing models to learn spurious correlations based on\nlikelihood estimation, limiting the models' performance. To address the issue,\nwe embrace causal inference to disentangle the models from the impact of such\nbias, and formulate the causalities among variables in the CAER task via a\ncustomized causal graph. Subsequently, we present a Contextual Causal\nIntervention Module (CCIM) to de-confound the confounder, which is built upon\nbackdoor adjustment theory to facilitate seeking approximate causal effects\nduring model training. As a plug-and-play component, CCIM can easily integrate\nwith existing approaches and bring significant improvements. Systematic\nexperiments on three datasets demonstrate the effectiveness of our CCIM.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}