{"id":"2407.05589","title":"Improving the trainability of VQE on NISQ computers for solving\n  portfolio optimization using convex interpolation","authors":"Shengbin Wang, Guihui Li, Zhaoyun Chen, Peng Wang, Menghan Dou,\n  Haiyong Zheng, Zhimin Wang, Yongjian Gu, Yu-Chun Wu, Guo-Ping Guo","authorsParsed":[["Wang","Shengbin",""],["Li","Guihui",""],["Chen","Zhaoyun",""],["Wang","Peng",""],["Dou","Menghan",""],["Zheng","Haiyong",""],["Wang","Zhimin",""],["Gu","Yongjian",""],["Wu","Yu-Chun",""],["Guo","Guo-Ping",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 03:51:54 GMT"}],"updateDate":"2024-07-09","timestamp":1720410714000,"abstract":"  Solving combinatorial optimization problems using variational quantum\nalgorithms (VQAs) represents one of the most promising applications in the NISQ\nera. However, the limited trainability of VQAs could hinder their scalability\nto large problem sizes. In this paper, we improve the trainability of\nvariational quantum eigensolver (VQE) by utilizing convex interpolation to\nsolve portfolio optimization. The idea is inspired by the observation that the\nDicke state possesses an inherent clustering property. Consequently, the energy\nof a state with a larger Hamming distance from the ground state intuitively\nresults in a greater energy gap away from the ground state energy in the\noverall distribution trend. Based on convex interpolation, the location of the\nground state can be evaluated by learning the property of a small subset of\nbasis states in the Hilbert space. This enlightens naturally the proposals of\nthe strategies of close-to-solution initialization, regular cost function\nlandscape, and recursive ansatz equilibrium partition. The successfully\nimplementation of a $40$-qubit experiment using only $10$ superconducting\nqubits demonstrates the effectiveness of our proposals. Furthermore, the\nquantum inspiration has also spurred the development of a prototype greedy\nalgorithm. Extensive numerical simulations indicate that the hybridization of\nVQE and greedy algorithms achieves a mutual complementarity, combining the\nadvantages of both global and local optimization methods. Our proposals can be\nextended to improve the trainability for solving other large-scale\ncombinatorial optimization problems that are widely used in real applications,\npaving the way to unleash quantum advantages of NISQ computers in the near\nfuture.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}