{"id":"2407.11651","title":"Fluid Antenna Grouping Index Modulation Design for MIMO Systems","authors":"Xinghao Guo, Yin Xu, Dazhi He, Cixiao Zhang, Wenjun Zhang, Yi-yan Wu","authorsParsed":[["Guo","Xinghao",""],["Xu","Yin",""],["He","Dazhi",""],["Zhang","Cixiao",""],["Zhang","Wenjun",""],["Wu","Yi-yan",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 12:17:41 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 13:03:45 GMT"},{"version":"v3","created":"Sat, 17 Aug 2024 01:55:25 GMT"}],"updateDate":"2024-08-20","timestamp":1721132261000,"abstract":"  Index modulation (IM) significantly enhances the spectral efficiency of fluid\nantennas (FAs) enabled multiple-input multiple-output (MIMO) systems, which is\nnamed FA-IM. However, due to the dense distribution of ports on the FA, the\nwireless channel exhibits a high spatial correlation, leading to severe\nperformance degradation in the existing FA-IM-assisted MIMO systems. To tackle\nthis issue, this paper proposes a novel fluid antenna grouping index modulation\n(FA-GIM) scheme to mitigate the high correlation between the activated ports.\nSpecifically, considering the characteristics of the FA two-dimensional (2D)\nsurface structure and the spatially correlated channel model in FA-assisted\nMIMO systems, a block grouping method is adopted, where adjacent ports are\nassigned to the same group. Consequently, different groups independently\nperform port index selection and constellation symbol mapping, with only one\nport being activated within each group during each transmission interval. Then,\na closed-form average bit error probability (ABEP) upper bound for the proposed\nscheme is derived. Numerical results show that, compared to state-of-the-art\nschemes, the proposed FA-GIM scheme consistently achieves significant bit error\nrate (BER) performance gains under various conditions. The proposed scheme is\nboth efficient and robust, enhancing the performance of FA-assisted MIMO\nsystems.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}