{"id":"2407.10622","title":"Reevaluating the cosmological redshift: insights into inhomogeneities\n  and irreversible processes","authors":"P. Tremblin and G. Chabrier","authorsParsed":[["Tremblin","P.",""],["Chabrier","G.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 11:13:50 GMT"}],"updateDate":"2024-09-18","timestamp":1721042030000,"abstract":"  Understanding the expansion of the Universe remains a profound challenge in\nfundamental physics. The complexity of solving General Relativity equations in\nthe presence of intricate, inhomogeneous flows has compelled cosmological\nmodels to rely on perturbation theory in a homogeneous FLRW background. This\napproach accounts for a redshift of light encompassing contributions from both\nthe cosmological background expansion along the photon's trajectory and Doppler\neffects at emission due to peculiar motions. However, this computation of the\nredshift is not covariant, as it hinges on specific coordinate choices that may\ndistort physical interpretations of the relativity of motion. In this study, we\nshow that peculiar motions, when tracing the dynamics along time-like\ngeodesics, must contribute to the redshift of light through a local volume\nexpansion factor, in addition to the background expansion. By employing a\ncovariant approach to redshift calculation, we address the central question of\nwhether the cosmological principle alone guarantees that the averaged local\nvolume expansion factor matches the background expansion. We establish that\nthis holds true only in scenarii characterized by a reversible evolution of the\nUniverse, where inhomogeneous expansion and compression modes mutually\ncompensate. In the presence of irreversible processes, such as the dissipation\nof large-scale compression modes through matter virialization and associated\nentropy production, the averaged expansion factor becomes dominated by\nexpansion in voids that cannot be compensated anymore by compression in\nvirialized structures. Our approach shows that entropy production due to\nirreversible processes during the formation of structures plays the same role\nas an effective, time-dependent cosmological constant, i.e. dynamical dark\nenergy, without the need to invoke new unknown physics.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aESHgPZWM9f5d7yNb674OfPO10MRAiICmyaQWg8yjz0","pdfSize":"579369","objectId":"0xb00285849823a9da6c0213b8e3b896a11fa25bbfa0b86d35cbbae5a8ddc0775c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
