{"id":"2407.04381","title":"Multi-Branch Auxiliary Fusion YOLO with Re-parameterization\n  Heterogeneous Convolutional for accurate object detection","authors":"Zhiqiang Yang, Qiu Guan, Keer Zhao, Jianmin Yang, Xinli Xu, Haixia\n  Long, Ying Tang","authorsParsed":[["Yang","Zhiqiang",""],["Guan","Qiu",""],["Zhao","Keer",""],["Yang","Jianmin",""],["Xu","Xinli",""],["Long","Haixia",""],["Tang","Ying",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 09:35:30 GMT"}],"updateDate":"2024-07-08","timestamp":1720172130000,"abstract":"  Due to the effective performance of multi-scale feature fusion, Path\nAggregation FPN (PAFPN) is widely employed in YOLO detectors. However, it\ncannot efficiently and adaptively integrate high-level semantic information\nwith low-level spatial information simultaneously. We propose a new model named\nMAF-YOLO in this paper, which is a novel object detection framework with a\nversatile neck named Multi-Branch Auxiliary FPN (MAFPN). Within MAFPN, the\nSuperficial Assisted Fusion (SAF) module is designed to combine the output of\nthe backbone with the neck, preserving an optimal level of shallow information\nto facilitate subsequent learning. Meanwhile, the Advanced Assisted Fusion\n(AAF) module deeply embedded within the neck conveys a more diverse range of\ngradient information to the output layer.\n  Furthermore, our proposed Re-parameterized Heterogeneous Efficient Layer\nAggregation Network (RepHELAN) module ensures that both the overall model\narchitecture and convolutional design embrace the utilization of heterogeneous\nlarge convolution kernels. Therefore, this guarantees the preservation of\ninformation related to small targets while simultaneously achieving the\nmulti-scale receptive field. Finally, taking the nano version of MAF-YOLO for\nexample, it can achieve 42.4% AP on COCO with only 3.76M learnable parameters\nand 10.51G FLOPs, and approximately outperforms YOLOv8n by about 5.1%. The\nsource code of this work is available at:\nhttps://github.com/yang-0201/MAF-YOLO.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}