{"id":"2407.08420","title":"Skin Effect of Nonlinear Optical Responses in Antiferromagnets","authors":"Hang Zhou, Rui-Chun Xiao, Shu-Hui Zhang, Wei Gan, Hui Han, Hong-Miao\n  Zhao, Wenjian Lu, Changjin Zhang, Yuping Sun, Hui Li, Ding-Fu Shao","authorsParsed":[["Zhou","Hang",""],["Xiao","Rui-Chun",""],["Zhang","Shu-Hui",""],["Gan","Wei",""],["Han","Hui",""],["Zhao","Hong-Miao",""],["Lu","Wenjian",""],["Zhang","Changjin",""],["Sun","Yuping",""],["Li","Hui",""],["Shao","Ding-Fu",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 11:57:47 GMT"},{"version":"v2","created":"Sat, 31 Aug 2024 06:40:32 GMT"}],"updateDate":"2024-09-04","timestamp":1720699067000,"abstract":"  Nonlinear optics plays important roles in the research of fundamental physics\nand the applications of high-performance optoelectronic devices. The bulk\nnonlinear optical responses arise from the uniform light absorption in\nnoncentrosymmetric crystals, and hence are usually considered to be the\ncollective phenomena of all atoms. Here we show, in contrast to this common\nexpectation, the nonlinear optical responses in antiferromagnets can be\nselectively accumulated near the surfaces, representing a skin effect. This is\nbecause the inversion symmetry, despite being broken globally by magnetism, is\nbarely violated locally deeply inside these antiferromagnets. Using A-type\nlayered antiferromagnets as the representatives, we predict that the\nspatial-dependent nonlinear optical responses, such as bulk photovoltaic effect\n(BPVE) and second harmonic generation (SHG), are notable in the top- and\nbottom-most layers and decay rapidly when moving away from the surfaces. Such a\nphenomenon is strongly associated with the antiferromagnetism and exists in a\nbroad range of antiferromagnets composed of centrosymmetric sublattices,\noffering promising device applications using these antiferromagnets. Our work\nuncovers a previously overlooked property of nonlinear optical responses and\nopens new opportunities for high-performance antiferromagnetic optospintronics.\n","subjects":["Condensed Matter/Materials Science","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gJyQLIscBDONrPF5CB59VtGxytktdbyZFBDUKA5iPIY","pdfSize":"1476379"}
