{"id":"2407.20072","title":"Generative Diffusion Model Bootstraps Zero-shot Classification of Fetal\n  Ultrasound Images In Underrepresented African Populations","authors":"Fangyijie Wang, Kevin Whelan, Gu\\'enol\\'e Silvestre, Kathleen M.\n  Curran","authorsParsed":[["Wang","Fangyijie",""],["Whelan","Kevin",""],["Silvestre","Guénolé",""],["Curran","Kathleen M.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 14:57:29 GMT"}],"updateDate":"2024-07-30","timestamp":1722265049000,"abstract":"  Developing robust deep learning models for fetal ultrasound image analysis\nrequires comprehensive, high-quality datasets to effectively learn informative\ndata representations within the domain. However, the scarcity of labelled\nultrasound images poses substantial challenges, especially in low-resource\nsettings. To tackle this challenge, we leverage synthetic data to enhance the\ngeneralizability of deep learning models. This study proposes a diffusion-based\nmethod, Fetal Ultrasound LoRA (FU-LoRA), which involves fine-tuning latent\ndiffusion models using the LoRA technique to generate synthetic fetal\nultrasound images. These synthetic images are integrated into a hybrid dataset\nthat combines real-world and synthetic images to improve the performance of\nzero-shot classifiers in low-resource settings. Our experimental results on\nfetal ultrasound images from African cohorts demonstrate that FU-LoRA\noutperforms the baseline method by a 13.73% increase in zero-shot\nclassification accuracy. Furthermore, FU-LoRA achieves the highest accuracy of\n82.40%, the highest F-score of 86.54%, and the highest AUC of 89.78%. It\ndemonstrates that the FU-LoRA method is effective in the zero-shot\nclassification of fetal ultrasound images in low-resource settings. Our code\nand data are publicly accessible on https://github.com/13204942/FU-LoRA.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"whA5fu5pSdP6zoCtWwnrSWSv27aeua0zZFrVkHm4KhI","pdfSize":"1326364"}
