{"id":"2407.15938","title":"Large dark matter content and steep metallicity profile predicted for\n  Ultra-Diffuse Galaxies formed in high-spin halos","authors":"Jos\\'e A. Benavides, Laura V. Sales, Mario. G. Abadi, Mark\n  Vogelsberger, Federico Marinacci and Lars Hernquist","authorsParsed":[["Benavides","José A.",""],["Sales","Laura V.",""],["Abadi","Mario. G.",""],["Vogelsberger","Mark",""],["Marinacci","Federico",""],["Hernquist","Lars",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:00:05 GMT"}],"updateDate":"2024-07-24","timestamp":1721671205000,"abstract":"  We study the stellar properties of a sample of simulated ultra-diffuse\ngalaxies (UDGs) with stellar mass $M_\\star=10^{7.5}$ - $10^{9} ~\n\\rm{M_{\\odot}}$, selected from the TNG50 simulation, where UDGs form mainly in\nhigh-spin dwarf-mass halos. We divide our sample into star-forming and quenched\nUDGs, finding good agreement with the stellar assembly history measured in\nobservations. Star-forming UDGs and quenched UDGs with $M_\\star \\geq 10^8\\; \\rm\nM_\\odot$ in our sample are particularly inefficient at forming stars, having\n$2$ - $10$ times less stellar mass than non-UDGs for the same virial mass halo.\nThese results are consistent with recent mass inferences in UDG samples and\nsuggest that the most inefficient UDGs arise from a late assembly of the dark\nmatter mass followed by a stellar growth that is comparatively slower (for\nstar-forming UDGs) or that was interrupted due to environmental removal of the\ngas (for quenched UDGs). Regardless of efficiency, UDGs are $60\\%$ poorer in\n[Fe/H] than the population of non-UDGs at a fixed stellar mass, with the most\nextreme objects having metal content consistent with the simulated\nmass-metallicity relation at $z \\sim 2$. Quenched UDGs stop their star\nformation in shorter timescales than non-UDGs of similar mass and are, as a\nconsequence, alpha-enhanced with respect to non-UDGs. We identify metallicity\nprofiles in UDGs as a potential avenue to distinguish between different\nformation paths for these galaxies, where gentle formation as a result of\nhigh-spin halos would present well-defined declining metallicity radial\nprofiles while powerful-outflows or tidal stripping formation models would lead\nto flatter or constant metallicity as a function of radius due\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Bt64V0r3kis001li5FPYHHUuTbJDsr3dSuX3ZfJGGU4","pdfSize":"7737737","objectId":"0x3c63c4912f62d816408f74ba72fb682487b3eea6bf3538e3f2b9c5c2967305ce","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
