{"id":"2407.19776","title":"Advancement of metal oxide nanomaterials on agri-food fronts","authors":"Georges Dubourg, Zoran Pavlovi\\'c, Branimir Bajac, Manil Kukkar, Nina\n  Fin\\v{c}ur, Zorica Novakovi\\'c, Marko Radovi\\'c","authorsParsed":[["Dubourg","Georges",""],["Pavlović","Zoran",""],["Bajac","Branimir",""],["Kukkar","Manil",""],["Finčur","Nina",""],["Novaković","Zorica",""],["Radović","Marko",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 08:20:04 GMT"}],"updateDate":"2024-07-30","timestamp":1722241204000,"abstract":"  The application of metal oxide nanomaterials (MOx NMs) in the agrifood\nindustry offers innovative solutions that can facilitate a paradigm shift in a\nsector that is currently facing challenges in meeting the growing requirements\nfor food production, while safeguarding the environment from the impacts of\ncurrent agriculture practices. This review comprehensively illustrates recent\nadvancements and applications of MOx for sustainable practices in the food and\nagricultural industries and environmental preservation. Relevant published data\npoint out that MOx NMs can be tailored for specific properties, enabling\nadvanced design concepts with improved features for various applications in the\nagrifood industry. Applications include nano-agrochemical formulation, control\nof food quality through nanosensors, and smart food packaging. Furthermore,\nrecent research suggests MOx's vital role in addressing environmental\nchallenges by removing toxic elements from contaminated soil and water. This\nmitigates the environmental effects of widespread agrichemical use and creates\na more favorable environment for plant growth. The review also discusses\npotential barriers, particularly regarding MOx toxicity and risk evaluation.\nFundamental concerns about possible adverse effects on human health and the\nenvironment must be addressed to establish an appropriate regulatory framework\nfor nano metal oxide-based food and agricultural products.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"8207tA1WlJovicx6NPZIbg2lv6LzsiDcdDzIszwgI8w","pdfSize":"1736405"}
