{"id":"2407.16423","title":"Magneto-optical Control of Ordering Kinetics and Vacancy Behavior in\n  Fe-Al Thin Films Quenched by Laser","authors":"I. Yu. Pashenkin, D. A. Tatarskiy, S. A. Churin, A. N. Nechay, M. N.\n  Drozdov, M. V. Sapozhnikov, and N. I. Polushkin","authorsParsed":[["Pashenkin","I. Yu.",""],["Tatarskiy","D. A.",""],["Churin","S. A.",""],["Nechay","A. N.",""],["Drozdov","M. N.",""],["Sapozhnikov","M. V.",""],["Polushkin","N. I.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 12:19:23 GMT"}],"updateDate":"2024-07-24","timestamp":1721737163000,"abstract":"  One of issues arising in materials science is a behavior of non-equilibrium\npoint defects in the atomic lattice, which defines the rates of chemical\nreactions and relaxation processes as well as affects the physical properties\nof solids. It was previously predicted that melting and rapid solidification of\nmetals and alloys provides a vacancy concentration in the quenched material,\nwhich can be comparable to that quantity at the point of melting. Here, we\nexperimentally explore the vacancy behavior in thin films of the\nquasi-equiatomic Fe-Al alloy subjected to nanosecond laser annealing with\nintensities up to film ablation. The effects of laser irradiation are studied\nby monitoring magneto-optically the ordering kinetics in the alloy at the very\nablation edge, within a narrow (micron-scale) ring-shaped region around the\nablation zone. Quantitatively, the vacancy supersaturation in the quenched\nalloy has been estimated by fitting a simulated temporal evolution of the\nlong-range chemical order to the obtained experimental data. Laser quenching\n(LQ) of alloys and single-element materials would be a tool for obtaining novel\nphase states within a small volume of the crystal.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZySyVOZieRFauEUAqlLWHt8EKj4UeGtl-0V71NcbAHc","pdfSize":"1184557"}
