{"id":"2407.07220","title":"Reference-based Controllable Scene Stylization with Gaussian Splatting","authors":"Yiqun Mei, Jiacong Xu, Vishal M. Patel","authorsParsed":[["Mei","Yiqun",""],["Xu","Jiacong",""],["Patel","Vishal M.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 20:30:29 GMT"}],"updateDate":"2024-07-11","timestamp":1720557029000,"abstract":"  Referenced-based scene stylization that edits the appearance based on a\ncontent-aligned reference image is an emerging research area. Starting with a\npretrained neural radiance field (NeRF), existing methods typically learn a\nnovel appearance that matches the given style. Despite their effectiveness,\nthey inherently suffer from time-consuming volume rendering, and thus are\nimpractical for many real-time applications. In this work, we propose ReGS,\nwhich adapts 3D Gaussian Splatting (3DGS) for reference-based stylization to\nenable real-time stylized view synthesis. Editing the appearance of a\npretrained 3DGS is challenging as it uses discrete Gaussians as 3D\nrepresentation, which tightly bind appearance with geometry. Simply optimizing\nthe appearance as prior methods do is often insufficient for modeling\ncontinuous textures in the given reference image. To address this challenge, we\npropose a novel texture-guided control mechanism that adaptively adjusts local\nresponsible Gaussians to a new geometric arrangement, serving for desired\ntexture details. The proposed process is guided by texture clues for effective\nappearance editing, and regularized by scene depth for preserving original\ngeometric structure. With these novel designs, we show ReGs can produce\nstate-of-the-art stylization results that respect the reference texture while\nembracing real-time rendering speed for free-view navigation.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"e0XmPe08qOEGr86dVa1zHOWKbfsr8X8Dj73gUlRUSHE","pdfSize":"10493271"}
