{"id":"2407.20662","title":"DocXPand-25k: a large and diverse benchmark dataset for identity\n  documents analysis","authors":"Julien Lerouge, Guillaume Betmont, Thomas Bres, Evgeny Stepankevich,\n  Alexis Berg\\`es","authorsParsed":[["Lerouge","Julien",""],["Betmont","Guillaume",""],["Bres","Thomas",""],["Stepankevich","Evgeny",""],["Bergès","Alexis",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 08:55:27 GMT"}],"updateDate":"2024-07-31","timestamp":1722329727000,"abstract":"  Identity document (ID) image analysis has become essential for many online\nservices, like bank account opening or insurance subscription. In recent years,\nmuch research has been conducted on subjects like document localization, text\nrecognition and fraud detection, to achieve a level of accuracy reliable enough\nto automatize identity verification. However, there are only a few available\ndatasets to benchmark ID analysis methods, mainly because of privacy\nrestrictions, security requirements and legal reasons.\n  In this paper, we present the DocXPand-25k dataset, which consists of 24,994\nrichly labeled IDs images, generated using custom-made vectorial templates\nrepresenting nine fictitious ID designs, including four identity cards, two\nresidence permits and three passports designs. These synthetic IDs feature\nartificially generated personal information (names, dates, identifiers, faces,\nbarcodes, ...), and present a rich diversity in the visual layouts and textual\ncontents.\n  We collected about 5.8k diverse backgrounds coming from real-world photos,\nscans and screenshots of IDs to guarantee the variety of the backgrounds. The\nsoftware we wrote to generate these images has been published\n(https://github.com/QuickSign/docxpand/) under the terms of the MIT license,\nand our dataset has been published\n(https://github.com/QuickSign/docxpand/releases/tag/v1.0.0) under the terms of\nthe CC-BY-NC-SA 4.0 License.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"94d0eRR2Ql-E1lawfTN9YWwj2hxAe5T3rkYmO_OqlV0","pdfSize":"25030567","objectId":"0xe6d5f97f9917741599dad6dc6447cedabd84d96d3b1af8e3d8d830f0b4f7242f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
