{"id":"2407.03906","title":"Color-map recommendation for MR relaxometry maps","authors":"Miha Fuderer, Barbara Wichtmann, Fabio Crameri, Nandita M. deSouza,\n  Bettina Bae{\\ss}ler, Vikas Gulani, Meiyun Wang, Dirk Poot, Ruud de Boer, Matt\n  Cashmore, Wolter de Graaf, Kathryn E. Keenan, Dan Ma, Carolin Pirkl, Nico\n  Sollmann, Sebastian Weing\\\"artner, Stefano Mandija, Xavier Golay","authorsParsed":[["Fuderer","Miha",""],["Wichtmann","Barbara",""],["Crameri","Fabio",""],["deSouza","Nandita M.",""],["Baeßler","Bettina",""],["Gulani","Vikas",""],["Wang","Meiyun",""],["Poot","Dirk",""],["de Boer","Ruud",""],["Cashmore","Matt",""],["de Graaf","Wolter",""],["Keenan","Kathryn E.",""],["Ma","Dan",""],["Pirkl","Carolin",""],["Sollmann","Nico",""],["Weingärtner","Sebastian",""],["Mandija","Stefano",""],["Golay","Xavier",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 13:02:27 GMT"}],"updateDate":"2024-07-08","timestamp":1720098147000,"abstract":"  Purpose: To harmonize the use of color for MR relaxometry maps and therefore\nrecommend the use of specific color-maps for representing T1 and T2 maps.\nMethods: Perceptually linearized color-maps were chosen to have similar color\nsettings as those proposed by Griswold et al. in 2018. A Delphi process,\npolling the opinion of a panel of 81 experts, was used to generate consensus on\nthe suitability of these maps. Results: Consensus was reached on the\nsuitability of the logarithm-processed Lipari color-map for T1 and the\nlogarithm-processed Navia color-map for T2. There was consensus on color bars\nbeing mandatory and on the use of a specific value indicating invalidity. There\nwas no consensus on whether the ranges should be fixed per anatomy. Conclusion:\nThe authors recommend the use of the logarithm-processed Lipari color map for\ndisplaying quantitative T1 maps and R1 maps; likewise, the authors recommend\nthe logarithm-processed Navia color-map for displaying T2, T2*, R2 and R2*\nmaps.\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}