{"id":"2407.10327","title":"Learning Unlabeled Clients Divergence via Anchor Model Aggregation for\n  Federated Semi-supervised Learning","authors":"Marawan Elbatel, Hualiang Wang, Jixiang Chen, Hao Wang, Xiaomeng Li","authorsParsed":[["Elbatel","Marawan",""],["Wang","Hualiang",""],["Chen","Jixiang",""],["Wang","Hao",""],["Li","Xiaomeng",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 20:50:40 GMT"}],"updateDate":"2024-07-16","timestamp":1720990240000,"abstract":"  Federated semi-supervised learning (FedSemi) refers to scenarios where there\nmay be clients with fully labeled data, clients with partially labeled, and\neven fully unlabeled clients while preserving data privacy. However, challenges\narise from client drift due to undefined heterogeneous class distributions and\nerroneous pseudo-labels. Existing FedSemi methods typically fail to aggregate\nmodels from unlabeled clients due to their inherent unreliability, thus\noverlooking unique information from their heterogeneous data distribution,\nleading to sub-optimal results. In this paper, we enable unlabeled client\naggregation through SemiAnAgg, a novel Semi-supervised Anchor-Based federated\nAggregation. SemiAnAgg learns unlabeled client contributions via an anchor\nmodel, effectively harnessing their informative value. Our key idea is that by\nfeeding local client data to the same global model and the same consistently\ninitialized anchor model (i.e., random model), we can measure the importance of\neach unlabeled client accordingly. Extensive experiments demonstrate that\nSemiAnAgg achieves new state-of-the-art results on four widely used FedSemi\nbenchmarks, leading to substantial performance improvements: a 9% increase in\naccuracy on CIFAR-100 and a 7.6% improvement in recall on the medical dataset\nISIC-18, compared with prior state-of-the-art. Code is available at:\nhttps://github.com/xmed-lab/SemiAnAgg.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}