{"id":"2407.09814","title":"Unexpected Lack of Ferromagnetic Fluctuations Despite Ferromagnetic\n  Substrate, with Commensurate Antiferromagnetic Fluctuations","authors":"Mohsen Shahbazi, Mohammad Ali Maleki","authorsParsed":[["Shahbazi","Mohsen",""],["Maleki","Mohammad Ali",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 09:20:19 GMT"}],"updateDate":"2024-07-16","timestamp":1720862419000,"abstract":"  We investigate the presence of anti-ferromagnetic fluctuations in the\nlongitudinal and transversal spin susceptibilities of a square lattice. The\ninclusion of both first and second neighbour hopping terms, along with exchange\ncoupling, induces anti-ferromagnetic fluctuations over a finite range of\nfillings in both longitudinal and transversal static spin susceptibilities. The\nexchange field causes a splitting of the energy bands, resulting in two Van\nHove singularities where the Fermi surface topology changes as the filling\npasses through these points. In the absence of on-site Hubbard interaction, we\nobserve incommensurate anti-ferromagnetic fluctuations between the two Van Hove\nfillings. Beyond the second Van Hove singularity at $ n=1.03 $, commensurate\nanti-ferromagnetic fluctuations dominate in both longitudinal and transversal\nspin susceptibilities. When incorporating a finite Hubbard interaction\nstrength, $ U $, we find that the commensurate anti-ferromagnetic fluctuations\nare preserved in both longitudinal and transversal dressed spin\nsusceptibilities. However anti-ferromagnetic fluctuations vanish beyond a\ncritical value of the Hubbard coupling strength, $ U_{c} $. Despite the\nexchange field can be induced by a ferromagnetic substrate, we do not observe\nany ferromagnetic fluctuations in the system.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Other Condensed Matter"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"aGaucCb7NxRkF2Bp5lAdQW4F0hduyGnoJB5-jbibytQ","pdfSize":"637114"}
