{"id":"2407.16193","title":"CloudFixer: Test-Time Adaptation for 3D Point Clouds via\n  Diffusion-Guided Geometric Transformation","authors":"Hajin Shim, Changhun Kim, Eunho Yang","authorsParsed":[["Shim","Hajin",""],["Kim","Changhun",""],["Yang","Eunho",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 05:35:04 GMT"}],"updateDate":"2024-07-24","timestamp":1721712904000,"abstract":"  3D point clouds captured from real-world sensors frequently encompass noisy\npoints due to various obstacles, such as occlusion, limited resolution, and\nvariations in scale. These challenges hinder the deployment of pre-trained\npoint cloud recognition models trained on clean point clouds, leading to\nsignificant performance degradation. While test-time adaptation (TTA)\nstrategies have shown promising results on this issue in the 2D domain, their\napplication to 3D point clouds remains under-explored. Among TTA methods, an\ninput adaptation approach, which directly converts test instances to the source\ndomain using a pre-trained diffusion model, has been proposed in the 2D domain.\nDespite its robust TTA performance in practical situations, naively adopting\nthis into the 3D domain may be suboptimal due to the neglect of inherent\nproperties of point clouds, and its prohibitive computational cost. Motivated\nby these limitations, we propose CloudFixer, a test-time input adaptation\nmethod tailored for 3D point clouds, employing a pre-trained diffusion model.\nSpecifically, CloudFixer optimizes geometric transformation parameters with\ncarefully designed objectives that leverage the geometric properties of point\nclouds. We also substantially improve computational efficiency by avoiding\nbackpropagation through the diffusion model and a prohibitive generation\nprocess. Furthermore, we propose an online model adaptation strategy by\naligning the original model prediction with that of the adapted input.\nExtensive experiments showcase the superiority of CloudFixer over various TTA\nbaselines, excelling in handling common corruptions and natural distribution\nshifts across diverse real-world scenarios. Our code is available at\nhttps://github.com/shimazing/CloudFixer\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}