{"id":"2407.07835","title":"RoBus: A Multimodal Dataset for Controllable Road Networks and Building\n  Layouts Generation","authors":"Tao Li, Ruihang Li, Huangnan Zheng, Shanding Ye, Shijian Li, Zhijie\n  Pan","authorsParsed":[["Li","Tao",""],["Li","Ruihang",""],["Zheng","Huangnan",""],["Ye","Shanding",""],["Li","Shijian",""],["Pan","Zhijie",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 16:55:01 GMT"}],"updateDate":"2024-07-11","timestamp":1720630501000,"abstract":"  Automated 3D city generation, focusing on road networks and building layouts,\nis in high demand for applications in urban design, multimedia games and\nautonomous driving simulations. The surge of generative AI facilitates\ndesigning city layouts based on deep learning models. However, the lack of\nhigh-quality datasets and benchmarks hinders the progress of these data-driven\nmethods in generating road networks and building layouts. Furthermore, few\nstudies consider urban characteristics, which generally take graphics as\nanalysis objects and are crucial for practical applications, to control the\ngenerative process. To alleviate these problems, we introduce a multimodal\ndataset with accompanying evaluation metrics for controllable generation of\nRoad networks and Building layouts (RoBus), which is the first and largest\nopen-source dataset in city generation so far. RoBus dataset is formatted as\nimages, graphics and texts, with $72,400$ paired samples that cover around\n$80,000km^2$ globally. We analyze the RoBus dataset statistically and validate\nthe effectiveness against existing road networks and building layouts\ngeneration methods. Additionally, we design new baselines that incorporate\nurban characteristics, such as road orientation and building density, in the\nprocess of generating road networks and building layouts using the RoBus\ndataset, enhancing the practicality of automated urban design. The RoBus\ndataset and related codes are published at\nhttps://github.com/tourlics/RoBus_Dataset.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}