{"id":"2407.13742","title":"CellularLint: A Systematic Approach to Identify Inconsistent Behavior in\n  Cellular Network Specifications","authors":"Mirza Masfiqur Rahman, Imtiaz Karim, Elisa Bertino","authorsParsed":[["Rahman","Mirza Masfiqur",""],["Karim","Imtiaz",""],["Bertino","Elisa",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:48:46 GMT"}],"updateDate":"2024-07-19","timestamp":1721324926000,"abstract":"  In recent years, there has been a growing focus on scrutinizing the security\nof cellular networks, often attributing security vulnerabilities to issues in\nthe underlying protocol design descriptions. These protocol design\nspecifications, typically extensive documents that are thousands of pages long,\ncan harbor inaccuracies, underspecifications, implicit assumptions, and\ninternal inconsistencies. In light of the evolving landscape, we introduce\nCellularLint--a semi-automatic framework for inconsistency detection within the\nstandards of 4G and 5G, capitalizing on a suite of natural language processing\ntechniques. Our proposed method uses a revamped few-shot learning mechanism on\ndomain-adapted large language models. Pre-trained on a vast corpus of cellular\nnetwork protocols, this method enables CellularLint to simultaneously detect\ninconsistencies at various levels of semantics and practical use cases. In\ndoing so, CellularLint significantly advances the automated analysis of\nprotocol specifications in a scalable fashion. In our investigation, we focused\non the Non-Access Stratum (NAS) and the security specifications of 4G and 5G\nnetworks, ultimately uncovering 157 inconsistencies with 82.67% accuracy. After\nverification of these inconsistencies on open-source implementations and 17\ncommercial devices, we confirm that they indeed have a substantial impact on\ndesign decisions, potentially leading to concerns related to privacy,\nintegrity, availability, and interoperability.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fOIRMQQDq84mYQVly_IUwWlTD4_YpsS4xjGJs8SoYFU","pdfSize":"2917603"}
