{"id":"2407.07522","title":"Cross-flow oscillations of a circular cylinder with mechanically coupled\n  rotation","authors":"Alessandro Nitti, Giovanni De Cillis, Marco .D. de Tullio","authorsParsed":[["Nitti","Alessandro",""],["De Cillis","Giovanni",""],["de Tullio","Marco . D.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 10:20:41 GMT"}],"updateDate":"2024-07-11","timestamp":1720606841000,"abstract":"  Flow-Induced Vibrations (FIV) of an elastically mounted circular cylinder are\ninvestigated by means of two-dimensional simulations. A mechanical coupling\nbetween cross-flow translation and rotation provides a single degree-of-freedom\nsystem in which the coupled rotational oscillations affect the fluid-structure\ndynamics. The structural response of this system is investigated exploring the\ndesign space spanned by reduced velocity, coupling radius, and phase density\nratio. The kinematic coupling introduces the rotation-induced shear layer\nmodifications, as well as an equivalent inertia effect connected to the\ncoupling force. Such a computational campaign is carried out by means of direct\nnumerical simulations with immersed boundary forcing at a Reynolds number equal\nto 100. The investigated system exhibits the wake-body synchronisation features\ntypical of lock-in for non-rotating cylinders. However, the kinematic coupling\nprovides a novel FIV scenario, in which the oscillation amplitude is magnified\nin the locked configurations with respect to the forced rotation case.\nFurthermore, it is found a significant widening of the reduced velocity domain\nwhere the lock-in condition takes place. In view of the proposed analyses, it\nis determined that the coupled rotation guarantees the phase alignment between\nlift and displacement necessary to sustain the lock-in condition, making the\noscillation amplitude grow indefinitely with the reduced velocity. This is\ninherently achieved due to the rotational shear layer and the added mass\ncontribution, which prevent the exact match between oscillation frequency and\nsystem natural frequency in vacuum. The outcomes of this study might\npotentially lead to innovative water energy harvesters offering larger power\noutputs and extended optimal operating regions.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"vW55rrkWAjOt4J2pjUao2sgHylhA-7ims-0m8z9nFLA","pdfSize":"1829767"}
