{"id":"2407.04815","title":"NSD-DIL: Null-Shot Deblurring Using Deep Identity Learning","authors":"Sree Rama Vamsidhar S and Rama Krishna Gorthi (Indian Institute of\n  Technology (IIT) Tirupati, India)","authorsParsed":[["S","Sree Rama Vamsidhar","","Indian Institute of\n  Technology"],["Gorthi","Rama Krishna","","Indian Institute of\n  Technology"]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 18:56:31 GMT"}],"updateDate":"2024-09-13","timestamp":1720205791000,"abstract":"  In this paper, we propose to reformulate the blind image deblurring task to\ndirectly learn an inverse of the degradation model using a deep linear network.\nWe introduce Deep Identity Learning (DIL), a novel learning strategy that\nincludes a dedicated regularization term based on the properties of linear\nsystems, to exploit the identity relation between the degradation and inverse\ndegradation models. The salient aspect of our proposed framework is it neither\nrelies on a deblurring dataset nor a single input blurred image (like Polyblur,\na self-supervised method). Since it is purely image-data-independent, we term\nour model as Null-Shot deblurring Using Deep Identity Learning (NSD-DIL). We\nalso provide an explicit representation of the learned deep linear network in a\nmatrix form, called Deep Restoration Kernel (DRK) for deblurring task. The\nproposed framework detours the typical degradation kernel estimation step\ninvolved in most of the existing blind deblurring solutions by the proposition\nof our Random Kernel Gallery (RKG) dataset. In this work, we focus on the\nrestoration of mild blur images, generated by small out-of-focus, lens blur, or\nslight camera motion, which often occurs in real images. Our experiments show\nthat the proposed method outperforms both traditional and deep learning based\ndeblurring methods, with at least an order of 100 lesser computational\nresources. The proposed NSD-DIL method can be effortlessly extended to the\nImage Super-Resolution (ISR) task as well to restore the low-resolution images\nwith fine details. The NSD-DIL model and its kernel form representation (DRK)\nare lightweight yet robust and restore the mild blur input in a fraction of a\nsecond. Hence, more suitable for wide real-time applications.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}