{"id":"2407.21490","title":"Explainable and Controllable Motion Curve Guided Cardiac Ultrasound\n  Video Generation","authors":"Junxuan Yu, Rusi Chen, Yongsong Zhou, Yanlin Chen, Yaofei Duan, Yuhao\n  Huang, Han Zhou, Tan Tao, Xin Yang, Dong Ni","authorsParsed":[["Yu","Junxuan",""],["Chen","Rusi",""],["Zhou","Yongsong",""],["Chen","Yanlin",""],["Duan","Yaofei",""],["Huang","Yuhao",""],["Zhou","Han",""],["Tao","Tan",""],["Yang","Xin",""],["Ni","Dong",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 09:59:20 GMT"}],"updateDate":"2024-08-01","timestamp":1722419960000,"abstract":"  Echocardiography video is a primary modality for diagnosing heart diseases,\nbut the limited data poses challenges for both clinical teaching and machine\nlearning training. Recently, video generative models have emerged as a\npromising strategy to alleviate this issue. However, previous methods often\nrelied on holistic conditions during generation, hindering the flexible\nmovement control over specific cardiac structures. In this context, we propose\nan explainable and controllable method for echocardiography video generation,\ntaking an initial frame and a motion curve as guidance. Our contributions are\nthree-fold. First, we extract motion information from each heart substructure\nto construct motion curves, enabling the diffusion model to synthesize\ncustomized echocardiography videos by modifying these curves. Second, we\npropose the structure-to-motion alignment module, which can map semantic\nfeatures onto motion curves across cardiac structures. Third, The\nposition-aware attention mechanism is designed to enhance video consistency\nutilizing Gaussian masks with structural position information. Extensive\nexperiments on three echocardiography datasets show that our method outperforms\nothers regarding fidelity and consistency. The full code will be released at\nhttps://github.com/mlmi-2024-72/ECM.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}