{"id":"2407.00195","title":"Fast X-ray/IR observations of the black hole transient\n  Swift~J1753.5--0127: from an IR lead to a very long jet lag","authors":"Alberto Ulgiati, Federico Maria Vincentelli, Piergiorgio Casella,\n  Alexandra Veledina, Thomas Maccarone, David Russell, Phil Uttley, Filippo\n  Ambrosino, Maria Cristina Baglio, Matteo Imbrogno, Andrea Melandri, Sara\n  Elisa Motta, Kiran O'Brien, Andrea Sanna, Tariq Shahbaz, Diego Altamirano,\n  Rob Fender, Dipankar Maitra, Julien Malzac","authorsParsed":[["Ulgiati","Alberto",""],["Vincentelli","Federico Maria",""],["Casella","Piergiorgio",""],["Veledina","Alexandra",""],["Maccarone","Thomas",""],["Russell","David",""],["Uttley","Phil",""],["Ambrosino","Filippo",""],["Baglio","Maria Cristina",""],["Imbrogno","Matteo",""],["Melandri","Andrea",""],["Motta","Sara Elisa",""],["O'Brien","Kiran",""],["Sanna","Andrea",""],["Shahbaz","Tariq",""],["Altamirano","Diego",""],["Fender","Rob",""],["Maitra","Dipankar",""],["Malzac","Julien",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 19:06:58 GMT"}],"updateDate":"2024-07-02","timestamp":1719601618000,"abstract":"  We report on two epochs of simultaneous near-infrared (IR) and X-ray\nobservations with a sub-second time resolution of the low mass X-ray binary\nblack hole candidate Swift J1753.5--0127 during its long 2005--2016 outburst.\nData were collected strictly simultaneously with VLT/ISAAC (K$_{S}$ band, 2.2\n$\\mu m$) and RXTE (2-15 keV) or \\textit{XMM-Newton} (0.7-10 keV). A clear\ncorrelation between the X-ray and the IR variable emission is found during both\nepochs but with very different properties. In the first epoch, the near-IR\nvariability leads the X-ray by $ \\sim 130 \\, ms$. This is the opposite of what\nis usually observed in similar systems. The correlation is more complex in the\nsecond epoch, with both anti-correlation and correlations at negative and\npositive lags. Frequency-resolved Fourier analysis allows us to identify two\nmain components in the complex structure of the phase lags: the first\ncomponent, characterised by a few seconds near-IR lag at low frequencies, is\nconsistent with a combination of disc reprocessing and a magnetised hot flow;\nthe second component is identified at high frequencies by a near-IR lag of\n$\\approx$0.7 s. Given the similarities of this second component with the\nwell-known constant optical/near-IR jet lag observed in other black hole\ntransients, we tentatively interpret this feature as a signature of a\nlonger-than-usual jet lag. We discuss the possible implications of measuring\nsuch a long jet lag in a radio-quiet black hole transient.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}