{"id":"2407.12983","title":"Lopsidedness in Early-Type Galaxies: the role of the $m=1$ multipole in\n  Isophote Fitting and Strong Lens Modelling","authors":"Aristeidis Amvrosiadis, James W. Nightingale, Qiuhan He, Andrew\n  Robertson, Samuel C. Lange, Carlos S. Frenk, Shaun Cole, Richard Massey,\n  Adriano Poci","authorsParsed":[["Amvrosiadis","Aristeidis",""],["Nightingale","James W.",""],["He","Qiuhan",""],["Robertson","Andrew",""],["Lange","Samuel C.",""],["Frenk","Carlos S.",""],["Cole","Shaun",""],["Massey","Richard",""],["Poci","Adriano",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 20:02:14 GMT"}],"updateDate":"2024-07-19","timestamp":1721246534000,"abstract":"  The surface brightness distribution of massive early-type galaxies (ETGs)\noften deviates from a perfectly elliptical shape. To capture these deviations\nin their isophotes during an ellipse fitting analysis, Fourier modes of order\n$m = 3, 4$ are often used. In such analyses the centre of each ellipse is\ntreated as a free parameter, which may result in offsets from the centre of\nlight, particularly for ellipses in the outer regions. This complexity is not\ncurrently accounted for in the mass models used in either strong gravitational\nlensing or galactic dynamical studies. In this work, we adopt a different\napproach, using the $m=1$ Fourier mode to account for this complexity while\nkeeping the centres of all perturbed ellipses fixed, showing that it fits the\ndata equally well. We applied our method to the distribution of light emission\nto a sample of ETGs from the MASSIVE survey and found that the majority have\nlow $m_1$ amplitudes, below 2 percent. Five out of the 30 galaxies we analysed\nhave high $m_1$ amplitudes, ranging from 2 to 10 percent in the outer parts ($R\n\\gtrsim 3$ kpc), all of which have a physically associated companion. Based on\nour findings, we advocate the use of the $m=1$ multipole in the mass models\nused in strong lensing and dynamical studies, particularly for galaxies with\nrecent or ongoing interactions.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}