{"id":"2407.13751","title":"Temporal Representation Learning for Stock Similarities and Its\n  Applications in Investment Management","authors":"Yoontae Hwang, Stefan Zohren, Yongjae Lee","authorsParsed":[["Hwang","Yoontae",""],["Zohren","Stefan",""],["Lee","Yongjae",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:54:13 GMT"}],"updateDate":"2024-07-19","timestamp":1721325253000,"abstract":"  In the era of rapid globalization and digitalization, accurate identification\nof similar stocks has become increasingly challenging due to the non-stationary\nnature of financial markets and the ambiguity in conventional regional and\nsector classifications. To address these challenges, we examine SimStock, a\nnovel temporal self-supervised learning framework that combines techniques from\nself-supervised learning (SSL) and temporal domain generalization to learn\nrobust and informative representations of financial time series data. The\nprimary focus of our study is to understand the similarities between stocks\nfrom a broader perspective, considering the complex dynamics of the global\nfinancial landscape. We conduct extensive experiments on four real-world\ndatasets with thousands of stocks and demonstrate the effectiveness of SimStock\nin finding similar stocks, outperforming existing methods. The practical\nutility of SimStock is showcased through its application to various investment\nstrategies, such as pairs trading, index tracking, and portfolio optimization,\nwhere it leads to superior performance compared to conventional methods. Our\nfindings empirically examine the potential of data-driven approach to enhance\ninvestment decision-making and risk management practices by leveraging the\npower of temporal self-supervised learning in the face of the ever-changing\nglobal financial landscape.\n","subjects":["Quantitative Finance/Computational Finance","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}