{"id":"2407.09717","title":"Deep-TEMPEST: Using Deep Learning to Eavesdrop on HDMI from its\n  Unintended Electromagnetic Emanations","authors":"Santiago Fern\\'andez, Emilio Mart\\'inez, Gabriel Varela, Pablo Mus\\'e,\n  Federico Larroca","authorsParsed":[["Fernández","Santiago",""],["Martínez","Emilio",""],["Varela","Gabriel",""],["Musé","Pablo",""],["Larroca","Federico",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 23:07:37 GMT"}],"updateDate":"2024-07-16","timestamp":1720825657000,"abstract":"  In this work, we address the problem of eavesdropping on digital video\ndisplays by analyzing the electromagnetic waves that unintentionally emanate\nfrom the cables and connectors, particularly HDMI. This problem is known as\nTEMPEST. Compared to the analog case (VGA), the digital case is harder due to a\n10-bit encoding that results in a much larger bandwidth and non-linear mapping\nbetween the observed signal and the pixel's intensity. As a result,\neavesdropping systems designed for the analog case obtain unclear and\ndifficult-to-read images when applied to digital video. The proposed solution\nis to recast the problem as an inverse problem and train a deep learning module\nto map the observed electromagnetic signal back to the displayed image.\nHowever, this approach still requires a detailed mathematical analysis of the\nsignal, firstly to determine the frequency at which to tune but also to produce\ntraining samples without actually needing a real TEMPEST setup. This saves time\nand avoids the need to obtain these samples, especially if several\nconfigurations are being considered. Our focus is on improving the average\nCharacter Error Rate in text, and our system improves this rate by over 60\npercentage points compared to previous available implementations. The proposed\nsystem is based on widely available Software Defined Radio and is fully\nopen-source, seamlessly integrated into the popular GNU Radio framework. We\nalso share the dataset we generated for training, which comprises both\nsimulated and over 1000 real captures. Finally, we discuss some countermeasures\nto minimize the potential risk of being eavesdropped by systems designed based\non similar principles.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}