{"id":"2407.09594","title":"Effects of Subhalos on Interpreting Highly Magnified Sources Near\n  Lensing Caustics","authors":"Lingyuan Ji and Liang Dai","authorsParsed":[["Ji","Lingyuan",""],["Dai","Liang",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-16","timestamp":1720807200000,"abstract":"  Large magnification factors near gravitational lensing caustics of galaxy\ncluster lenses allow the study of individual stars or compact stellar\nassociations at cosmological distances. We study how the presence of\nsub-galactic subhalos, an inevitable consequence of cold dark matter, can alter\nthe property of caustics and hence change the interpretation of highly\nmagnified sources that lie atop them. First, we consider a galaxy cluster halo\npopulated with subhalos sampled from a realistic subhalo mass function\ncalibrated to $N$-body simulations. Then, we compare a semi-analytical\napproximation and an adaptive ray-shooting method which we employ to quantify\nthe property of the caustics. As a case study, we investigate Earendel, a $z =\n6.2$ candidate of magnified single or multiple star system with a lone lensed\nimage atop the critical curve in the Sunrise Arc. We find that the source size\nconstraint ($\\lesssim 0.3\\, \\mathrm{pc}$) previously derived from macro lens\nmodels should be relaxed by a factor of a few to ten when subhalos are\naccounted for, therefore allowing the possibility of a compact star cluster.\nThe subhalos could introduce an astrometric perturbation that is $\\lesssim\n0.5''$, which does not contradict observation. These conclusions are largely\nrobust to changes in the subhalo population. Subhalos therefore should be\nseriously accounted for when interpreting the astrophysical nature of similar\nhighly magnified sources uncovered in recent high-$z$ observations.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}