{"id":"2407.12559","title":"Fractional Wannier Orbitals and Tight-Binding Gauge Fields for Kitaev\n  Honeycomb Superlattices with Flat Majorana Bands","authors":"K. B. Yogendra, G. Baskaran, Tanmoy Das","authorsParsed":[["Yogendra","K. B.",""],["Baskaran","G.",""],["Das","Tanmoy",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 13:44:39 GMT"}],"updateDate":"2024-08-13","timestamp":1721223879000,"abstract":"  Fractional excitations offer vast potential for both fundamental physics and\nquantum technologies. However, their dynamics under the influence of gauge\nfields pose a significant challenge to conventional models. Here, we\ninvestigate the evolution of low-energy Majorana dispersions across various\ncrystalline phases of the \\pi-flux in the Kitaev spin model on a honeycomb\nlattice. We develop an effective tight-binding description for these low-energy\nMajorana fermions, introducing a gauge potential through a superexchange-like\ninteraction that systematically eliminates the high-energy spectrum. We\nidentify conditions under which this superexchange interaction acts as a Z2\ngauge field, governing the tight-binding hopping of Majorana Wannier orbitals.\nOur study reveals an intriguing phase transition between two non-trivial\ntopological phases characterized by gapless flat-band (extensive) degeneracy.\nTo further explore flat band physics, we introduce a mean-field theory\ndescribing a gauge-invariant Majorana density-wave order within these bands.\nThe resulting split Chern bands facilitate the partial filling of Chern bands,\neffectively leading to fractional Chern states. Our work, encompassing both the\ngauge-mediated tight-binding model and the mean-field theory, opens doors for\nfuture exploration of $U(1)$, $SU(N)$ gauge-mediated tight-binding approach to\nother fractional or entangled Wannier excitations.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Superconductivity","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"P_gOvZEgM0v207dzi1k05H_EtLZV2lXGn-lxTppQ3P4","pdfSize":"1613878","objectId":"0x93f451619543887fa72055fed79bdc23190e2b1ef001ee0714bbcd5a12c9adf4","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
