{"id":"2407.05193","title":"CBM: Curriculum by Masking","authors":"Andrei Jarca, Florinel-Alin Croitoru, Radu Tudor Ionescu","authorsParsed":[["Jarca","Andrei",""],["Croitoru","Florinel-Alin",""],["Ionescu","Radu Tudor",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 21:35:18 GMT"},{"version":"v2","created":"Tue, 9 Jul 2024 09:40:38 GMT"}],"updateDate":"2024-07-10","timestamp":1720301718000,"abstract":"  We propose Curriculum by Masking (CBM), a novel state-of-the-art curriculum\nlearning strategy that effectively creates an easy-to-hard training schedule\nvia patch (token) masking, offering significant accuracy improvements over the\nconventional training regime and previous curriculum learning (CL) methods. CBM\nleverages gradient magnitudes to prioritize the masking of salient image\nregions via a novel masking algorithm and a novel masking block. Our approach\nenables controlling sample difficulty via the patch masking ratio, generating\nan effective easy-to-hard curriculum by gradually introducing harder samples as\ntraining progresses. CBM operates with two easily configurable parameters, i.e.\nthe number of patches and the curriculum schedule, making it a versatile\ncurriculum learning approach for object recognition and detection. We conduct\nexperiments with various neural architectures, ranging from convolutional\nnetworks to vision transformers, on five benchmark data sets (CIFAR-10,\nCIFAR-100, ImageNet, Food-101 and PASCAL VOC), to compare CBM with conventional\nas well as curriculum-based training regimes. Our results reveal the\nsuperiority of our strategy compared with the state-of-the-art curriculum\nlearning regimes. We also observe improvements in transfer learning contexts,\nwhere CBM surpasses previous work by considerable margins in terms of accuracy.\nWe release our code for free non-commercial use at\nhttps://github.com/CroitoruAlin/CBM.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}