{"id":"2407.09018","title":"AUITestAgent: Automatic Requirements Oriented GUI Function Testing","authors":"Yongxiang Hu, Xuan Wang, Yingchuan Wang, Yu Zhang, Shiyu Guo, Chaoyi\n  Chen, Xin Wang, Yangfan Zhou","authorsParsed":[["Hu","Yongxiang",""],["Wang","Xuan",""],["Wang","Yingchuan",""],["Zhang","Yu",""],["Guo","Shiyu",""],["Chen","Chaoyi",""],["Wang","Xin",""],["Zhou","Yangfan",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 06:14:46 GMT"}],"updateDate":"2024-07-15","timestamp":1720764886000,"abstract":"  The Graphical User Interface (GUI) is how users interact with mobile apps. To\nensure it functions properly, testing engineers have to make sure it functions\nas intended, based on test requirements that are typically written in natural\nlanguage. While widely adopted manual testing and script-based methods are\neffective, they demand substantial effort due to the vast number of GUI pages\nand rapid iterations in modern mobile apps. This paper introduces AUITestAgent,\nthe first automatic, natural language-driven GUI testing tool for mobile apps,\ncapable of fully automating the entire process of GUI interaction and function\nverification. Since test requirements typically contain interaction commands\nand verification oracles. AUITestAgent can extract GUI interactions from test\nrequirements via dynamically organized agents. Then, AUITestAgent employs a\nmulti-dimensional data extraction strategy to retrieve data relevant to the\ntest requirements from the interaction trace and perform verification.\nExperiments on customized benchmarks demonstrate that AUITestAgent outperforms\nexisting tools in the quality of generated GUI interactions and achieved the\naccuracy of verifications of 94%. Moreover, field deployment in Meituan has\nshown AUITestAgent's practical usability, with it detecting 4 new functional\nbugs during 10 regression tests in two months.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}