{"id":"2407.17225","title":"Asymmetry Analysis of Bilateral Shapes","authors":"Kanti V. Mardia, Xiangyu Wu, John T. Kent, Colin R. Goodall, Balvinder\n  S. Khambay","authorsParsed":[["Mardia","Kanti V.",""],["Wu","Xiangyu",""],["Kent","John T.",""],["Goodall","Colin R.",""],["Khambay","Balvinder S.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 12:25:23 GMT"}],"updateDate":"2024-07-25","timestamp":1721823923000,"abstract":"  Many biological objects possess bilateral symmetry about a midline or\nmidplane, up to a ``noise'' term. This paper uses landmark-based methods to\nmeasure departures from bilateral symmetry, especially for the two-group\nproblem where one group is more asymmetric than the other. In this paper, we\nformulate our work in the framework of size-and-shape analysis including\nregistration via rigid body motion. Our starting point is a vector of\nelementary asymmetry features defined at the individual landmark coordinates\nfor each object. We introduce two approaches for testing. In the first, the\nelementary features are combined into a scalar composite asymmetry measure for\neach object. Then standard univariate tests can be used to compare the two\ngroups. In the second approach, a univariate test statistic is constructed for\neach elementary feature. The maximum of these statistics lead to an overall\ntest statistic to compare the two groups and we then provide a technique to\nextract the important features from the landmark data. Our methodology is\nillustrated on a pre-registered smile dataset collected to assess the success\nof cleft lip surgery on human subjects. The asymmetry in a group of cleft lip\nsubjects is compared to a group of normal subjects, and statistically\nsignificant differences have been found by univariate tests in the first\napproach. Further, our feature extraction method leads to an anatomically\nplausible set of landmarks for medical applications.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}