{"id":"2407.03323","title":"FFT-acceleration and stabilization of the 3D Marching-on-in-Time\n  Contrast Current Density Volume Integral Equation for scattering from high\n  contrast dielectrics","authors":"Petrus W.N. van Diepen, Martijn C. van Beurden, Roeland J. Dilz","authorsParsed":[["van Diepen","Petrus W. N.",""],["van Beurden","Martijn C.",""],["Dilz","Roeland J.",""]],"versions":[{"version":"v1","created":"Tue, 23 Apr 2024 15:24:49 GMT"}],"updateDate":"2024-07-10","timestamp":1713885889000,"abstract":"  An implicit causal space-time Galerkin scheme applied to the contrast current\ndensity volume integral equation gives rise to a marching-on-in-time scheme\nknown as the MOT-JVIE, which is accelerated and stabilized via a fully embedded\nFIR filter to compute the electromagnetic scattering from high permittivity\ndielectric objects discretized with over a million voxels. A review of two\ndifferent acceleration approaches previously developed for two-dimensional\ntime-domain surface integral equations based on fast Fourier transforms (FFTs),\nleads to an understanding why these schemes obtain the same order of\nacceleration and the extension of this FFT-acceleration to the\nthree-dimensional MOT-JVIE. The positive definite stability analysis (PDSA) for\nthe MOT-JVIE shows that the number of voxels for a stable MOT-JVIE\ndiscretization is restricted by the finite precision of the matrix elements.\nThe application of the PDSA provides the insight that stability can be enforced\nthrough regularization, at the cost of accuracy. To minimize the impact in\naccuracy, FIR-regularization is introduced, which is based on low group-delay\nlinear-phase high-pass FIR-filters. We demonstrate the capabilities of the\nFFT-accelerated FIR-regularized MOT-JVIE for a number of numerical experiments\nwith high permittivity dielectric scatterers.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}