{"id":"2407.05455","title":"Quantum Supercriticality in the Ising Model and Rydberg Atom Array","authors":"Junsen Wang, Enze Lv, Xinyang Li, Yuliang Jin and Wei Li","authorsParsed":[["Wang","Junsen",""],["Lv","Enze",""],["Li","Xinyang",""],["Jin","Yuliang",""],["Li","Wei",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 17:52:02 GMT"}],"updateDate":"2024-07-09","timestamp":1720374722000,"abstract":"  Supercriticality, featured with universal scaling behaviors, emerges as an\nintriguing phenomenon proximate to the classical liquid-gas critical point. In\nthis study, we extend this significant concept to quantum many-body systems\nnear the quantum critical point (QCP), employing tensor network calculations\nand scaling analyses of the Ising model and Rydberg atom array. The\nsupercritical, fluid-like, quantum states are found to be strongly fluctuating\nand highly entangled, as characterized by the universal scalings in\nsusceptibility $\\chi_z \\sim (h_x-h_x^c)^{-\\gamma}$, correlation length $\\xi\n\\sim (h_x-h_x^c)^{-\\nu}$, fidelity susceptibility $\\chi_F \\sim (h_x -\nh_x^c)^{d\\nu - 2}$, and entanglement entropy $S_{\\rm E} \\sim \\ln{(h_x -\nh_x^c)}$. Here, $\\gamma$ and $\\nu$ represent critical exponents, $d$ is the\ndimension of the system, and $h_x^c$ is the critical transverse field of the\nIsing QCP. The universal scaling behaviors are revealed in the regime enclosed\nby two quantum supercritical crossover lines in the longitudinal-transverse\nfield ($h_z$-$h_x$) plane, $|h_z| \\propto (h_x - h_x^c)^{\\beta + \\gamma}$\nrelating to critical exponents $\\beta$ and $\\gamma$, where the response\nfunctions, measures of entanglement, and fidelity susceptibility reach their\nmaxima. We propose that Rydberg atom arrays and quantum Ising magnets provide\navailable platforms for exploring emergent supercritical phenomena and\nidentifying the universal scalings. The present work establishes a foundation\nfor exploring quantum supercriticality in magnetic systems and through quantum\nsimulations.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Quantum Gases","Condensed Matter/Statistical Mechanics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}