{"id":"2407.15643","title":"Link Polarity Prediction from Sparse and Noisy Labels via Multiscale\n  Social Balance","authors":"Marco Minici, Federico Cinus, Francesco Bonchi and Giuseppe Manco","authorsParsed":[["Minici","Marco",""],["Cinus","Federico",""],["Bonchi","Francesco",""],["Manco","Giuseppe",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:02:28 GMT"}],"updateDate":"2024-07-23","timestamp":1721656948000,"abstract":"  Signed Graph Neural Networks (SGNNs) have recently gained attention as an\neffective tool for several learning tasks on signed networks, i.e., graphs\nwhere edges have an associated polarity. One of these tasks is to predict the\npolarity of the links for which this information is missing, starting from the\nnetwork structure and the other available polarities. However, when the\navailable polarities are few and potentially noisy, such a task becomes\nchallenging.\n  In this work, we devise a semi-supervised learning framework that builds\naround the novel concept of \\emph{multiscale social balance} to improve the\nprediction of link polarities in settings characterized by limited data\nquantity and quality. Our model-agnostic approach can seamlessly integrate with\nany SGNN architecture, dynamically reweighting the importance of each data\nsample while making strategic use of the structural information from unlabeled\nedges combined with social balance theory.\n  Empirical validation demonstrates that our approach outperforms established\nbaseline models, effectively addressing the limitations imposed by noisy and\nsparse data. This result underlines the benefits of incorporating multiscale\nsocial balance into SGNNs, opening new avenues for robust and accurate\npredictions in signed network analysis.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"Qk59DtBb4vpShkdka6bKB9a1gzF3Kdd_PoWZsjxuClg","pdfSize":"1552918"}
