{"id":"2407.18080","title":"Electrically activated W-doped VO2 films for reli-able, large-area,\n  broadband THz waves modulators","authors":"Eduard-Nicolae Sirjita, Alexandre Boulle, Jean-Christophe Orlianges,\n  Richard Mayet, Aur\\'elien Debelle, Lionel Thom\\'e, Maggy Colas, Julie\n  Cornette and Aurelian Crunteanu","authorsParsed":[["Sirjita","Eduard-Nicolae",""],["Boulle","Alexandre",""],["Orlianges","Jean-Christophe",""],["Mayet","Richard",""],["Debelle","Aurélien",""],["Thomé","Lionel",""],["Colas","Maggy",""],["Cornette","Julie",""],["Crunteanu","Aurelian",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 14:39:15 GMT"}],"updateDate":"2024-07-26","timestamp":1721918355000,"abstract":"  THz amplitude modulators and switches are considered to be the main building\nblocks of future THz communication systems. Despite rapid progress, modulation\nand switching devices in this electromagnetic spectrum lag far behind other\nfrequency ranges. Currently, THz modu-lators face major challenges in\nconsistently producing high modulations depths over large frequency bands.\nMoreover, a convenient integration for practical applications requires that the\nmodulation/switching properties can be electrically controlled. Devices\nfulfilling all these con-ditions remain to be demonstrated. In this work we\nshow that W-doped VO2 films grown by direct-current magnetron sputtering can be\nefficiently used for the development reliable, large-area, broadband THz waves\nmodulators. We demonstrate that W doping not only permits to tune the insulator\nto metal transition (IMT) temperature of VO2, but also, most importantly, to\ncontrol the topology of the electrically activated transition. In situ /\noperando X-ray diffraction and Raman spectroscopy characterizations of the\ndevices, coupled with standard resistivi-ty measurements and time-domain THz\nspectroscopy, unambiguously demonstrate that the changes in the spatial\ndistribution of the IMT is due to structural distortions induced by W doping.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}