{"id":"2407.19931","title":"FMO-LC-TDDFTB method for excited states of large molecular assemblies in\n  the strong light-matter coupling regime","authors":"Richard Einsele, Luca Nils Philipp, Roland Mitri\\'c","authorsParsed":[["Einsele","Richard",""],["Philipp","Luca Nils",""],["Mitrić","Roland",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 12:07:03 GMT"}],"updateDate":"2024-07-30","timestamp":1722254823000,"abstract":"  We present a new methodology to calculate the strong light-matter coupling\nbetween photonic modes in microcavities and large molecular aggregates that\nconsist of hundreds of molecular fragments. To this end, we combine our\nfragment molecular orbital long-range corrected time-dependent density\nfunctional tight-binding methodology with a generalized Tavis-Cummings\nHamiltonian. We employ an excitonic Hamiltonian, which is built from a\nquasi-diabatic basis that is constructed from locally excited and\ncharge-transfer states of all molecular fragments. In order to calculate\npolaritonic states, we extend our quasi-diabatic basis to include photonic\nstates of a microcavity and derive and implement the couplings between the\nlocally excited states and the cavity states and built a Tavis-Cummings\nHamiltonian that incorporates the intermolecular excitonic couplings.\nSubsequently, we demonstrate the capability of our methodology by simulating\nthe influence of the electric field polarization on the polaritonic spectra for\na tetracene aggregate of 125 monomers. Furthermore, we investigate the\ndependence of the splitting of the upper and lower polaritonic branches on the\nsystem size by comparing the spectra of three different tetracene clusters. In\naddition, we investigate the polariton dispersion of a large tetracene\naggregate for electric field polarizations in the x, y and z direction. Our new\nmethodology can facilitate the future study of exciton dynamics in complex\nmolecular systems, which consist of up to hundreds of molecules, that are\ninfluenced by strong light-matter coupling to microcavities.\n","subjects":["Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}