{"id":"2407.08745","title":"Evolutionary Computation for the Design and Enrichment of\n  General-Purpose Artificial Intelligence Systems: Survey and Prospects","authors":"Javier Poyatos, Javier Del Ser, Salvador Garcia, Hisao Ishibuchi,\n  Daniel Molina, Isaac Triguero, Bing Xue, Xin Yao and Francisco Herrera","authorsParsed":[["Poyatos","Javier",""],["Del Ser","Javier",""],["Garcia","Salvador",""],["Ishibuchi","Hisao",""],["Molina","Daniel",""],["Triguero","Isaac",""],["Xue","Bing",""],["Yao","Xin",""],["Herrera","Francisco",""]],"versions":[{"version":"v1","created":"Mon, 3 Jun 2024 15:47:17 GMT"}],"updateDate":"2024-07-15","timestamp":1717429637000,"abstract":"  In Artificial Intelligence, there is an increasing demand for adaptive models\ncapable of dealing with a diverse spectrum of learning tasks, surpassing the\nlimitations of systems devised to cope with a single task. The recent emergence\nof General-Purpose Artificial Intelligence Systems (GPAIS) poses model\nconfiguration and adaptability challenges at far greater complexity scales than\nthe optimal design of traditional Machine Learning models. Evolutionary\nComputation (EC) has been a useful tool for both the design and optimization of\nMachine Learning models, endowing them with the capability to configure and/or\nadapt themselves to the task under consideration. Therefore, their application\nto GPAIS is a natural choice. This paper aims to analyze the role of EC in the\nfield of GPAIS, exploring the use of EC for their design or enrichment. We also\nmatch GPAIS properties to Machine Learning areas in which EC has had a notable\ncontribution, highlighting recent milestones of EC for GPAIS. Furthermore, we\ndiscuss the challenges of harnessing the benefits of EC for GPAIS, presenting\ndifferent strategies to both design and improve GPAIS with EC, covering\ntangential areas, identifying research niches, and outlining potential research\ndirections for EC and GPAIS.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"5U-O6PvsoCQppz-ucsbny-svg43Vy4UEp8kdkpzdcIM","pdfSize":"1287057"}
