{"id":"2407.21710","title":"Microscopic model for aging of biocondensates","authors":"Hugo Le Roy, and Paolo De Los Rios","authorsParsed":[["Roy","Hugo Le",""],["Rios","Paolo De Los",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 16:01:16 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 11:05:53 GMT"}],"updateDate":"2024-08-02","timestamp":1722441676000,"abstract":"  Biomolecular condensates are membraneless compartments in the cell that are\ninvolved in a wide diversity of biological processes. These phase-separated\ndroplets usually exhibit a viscoelastic mechanical response. A behavior\nrationalized by modeling the complex molecules that make up a condensate as\nstickers and spacers, which assemble into a network-like structure. The proper\nfunctioning of biocondensates requires precise control over their composition,\nsize, and mechanical response. For example, several neurodegenerative diseases\nare associated with dysfunctional condensates that solidify over a long period\nof time (days) until they become solid. A phenomenon usually described as\naging. The emergence of such a long timescale of evolution from microscopic\nevents, as well as the associated microscopic reorganization leading to aging,\nremains mostly an open question. In this article, we explore the connection\nbetween the mechanical properties of the condensates and their microscopic\nstructure. We propose a minimal model for the dynamic of stickers and spacers,\nand show that entropy minimization of spacers leads to an attractive force\nbetween stickers. Our system displays a surprisingly slow relaxation toward\nequilibrium, reminiscent of glassy systems and consistent with the\nliquid-to-solid transition observed. To explain this behavior, we study the\nclustering dynamic of stickers and successfully explain the origin of glassy\nrelaxation.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZeoQPFkDP6jgpVZoPvQfdDOu6nH6l6dGvG0iNOv94iM","pdfSize":"2293351"}
