{"id":"2407.06560","title":"TCKIN: A Novel Integrated Network Model for Predicting Mortality Risk in\n  Sepsis Patients","authors":"Fanglin Dong","authorsParsed":[["Dong","Fanglin",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 05:37:50 GMT"}],"updateDate":"2024-07-10","timestamp":1720503470000,"abstract":"  Sepsis poses a major global health threat, accounting for millions of deaths\nannually and significant economic costs. Accurate predictions of mortality risk\nin sepsis patients facilitate the efficient allocation of medical resources,\nthereby enhancing patient survival and quality of life. Through precise risk\nassessments, healthcare facilities can effectively distribute intensive care\nbeds, medical equipment, and staff, ensuring high-risk patients receive timely\nand appropriate care. Early identification and intervention significantly\ndecrease mortality rates and improve patient outcomes. Current methods\ntypically utilize only one type of data--either constant, temporal, or ICD\ncodes. This study introduces the Time-Constant KAN Integrated Network(TCKIN),\nan innovative model that enhances the accuracy of sepsis mortality risk\npredictions by integrating both temporal and constant data from electronic\nhealth records and ICD codes. Validated against the MIMIC-III and MIMIC-IV\ndatasets, TCKIN surpasses existing machine learning and deep learning methods\nin accuracy, sensitivity, and specificity. Notably, TCKIN achieved AUCs of\n87.76% and 88.07%, demonstrating superior capability in identifying high-risk\npatients. Additionally, TCKIN effectively combats the prevalent issue of data\nimbalance in clinical settings, improving the detection of patients at elevated\nrisk of mortality and facilitating timely interventions. These results confirm\nthe model's effectiveness and its potential to transform patient management and\ntreatment optimization in clinical practice. With this advanced risk assessment\ntool, healthcare providers can devise more tailored treatment plans, optimize\nresource utilization, and ultimately enhance survival rates and quality of life\nfor sepsis patients.\n","subjects":["Statistics/Applications","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}