{"id":"2407.12445","title":"A Comprehensive Sustainable Framework for Machine Learning and\n  Artificial Intelligence","authors":"Roberto Pagliari, Peter Hill, Po-Yu Chen, Maciej Dabrowny, Tingsheng\n  Tan, Francois Buet-Golfouse","authorsParsed":[["Pagliari","Roberto",""],["Hill","Peter",""],["Chen","Po-Yu",""],["Dabrowny","Maciej",""],["Tan","Tingsheng",""],["Buet-Golfouse","Francois",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 09:54:19 GMT"}],"updateDate":"2024-07-18","timestamp":1721210059000,"abstract":"  In financial applications, regulations or best practices often lead to\nspecific requirements in machine learning relating to four key pillars:\nfairness, privacy, interpretability and greenhouse gas emissions. These all sit\nin the broader context of sustainability in AI, an emerging practical AI topic.\nHowever, although these pillars have been individually addressed by past\nliterature, none of these works have considered all the pillars. There are\ninherent trade-offs between each of the pillars (for example, accuracy vs\nfairness or accuracy vs privacy), making it even more important to consider\nthem together. This paper outlines a new framework for Sustainable Machine\nLearning and proposes FPIG, a general AI pipeline that allows for these\ncritical topics to be considered simultaneously to learn the trade-offs between\nthe pillars better. Based on the FPIG framework, we propose a meta-learning\nalgorithm to estimate the four key pillars given a dataset summary, model\narchitecture, and hyperparameters before model training. This algorithm allows\nusers to select the optimal model architecture for a given dataset and a given\nset of user requirements on the pillars. We illustrate the trade-offs under the\nFPIG model on three classical datasets and demonstrate the meta-learning\napproach with an example of real-world datasets and models with different\ninterpretability, showcasing how it can aid model selection.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SYmpGrb2fkHyq1LLNDFRvm2QNIi_WaSrAodTDGHRcUQ","pdfSize":"1162354"}
