{"id":"2407.18424","title":"Model-driven Heart Rate Estimation and Heart Murmur Detection based on\n  Phonocardiogram","authors":"Jingping Nie, Ran Liu, Behrooz Mahasseni, Erdrin Azemi, and Vikramjit\n  Mitra","authorsParsed":[["Nie","Jingping",""],["Liu","Ran",""],["Mahasseni","Behrooz",""],["Azemi","Erdrin",""],["Mitra","Vikramjit",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 22:56:21 GMT"}],"updateDate":"2024-07-29","timestamp":1721948181000,"abstract":"  Acoustic signals are crucial for health monitoring, particularly heart sounds\nwhich provide essential data like heart rate and detect cardiac anomalies such\nas murmurs. This study utilizes a publicly available phonocardiogram (PCG)\ndataset to estimate heart rate using model-driven methods and extends the\nbest-performing model to a multi-task learning (MTL) framework for simultaneous\nheart rate estimation and murmur detection. Heart rate estimates are derived\nusing a sliding window technique on heart sound snippets, analyzed with a\ncombination of acoustic features (Mel spectrogram, cepstral coefficients, power\nspectral density, root mean square energy). Our findings indicate that a 2D\nconvolutional neural network (\\textbf{\\texttt{2dCNN}}) is most effective for\nheart rate estimation, achieving a mean absolute error (MAE) of 1.312 bpm. We\nsystematically investigate the impact of different feature combinations and\nfind that utilizing all four features yields the best results. The MTL model\n(\\textbf{\\texttt{2dCNN-MTL}}) achieves accuracy over 95% in murmur detection,\nsurpassing existing models, while maintaining an MAE of 1.636 bpm in heart rate\nestimation, satisfying the requirements stated by Association for the\nAdvancement of Medical Instrumentation (AAMI).\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8X7AfqUyYblaNQlSI2Cql9dUIFJHExKDwUa7Ps4Jus8","pdfSize":"2241288","objectId":"0x25d33d8e88c60858369acd4db6f777a746dc276914d28b4a25365aa06e8e3321","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
