{"id":"2407.00185","title":"Shape optimization of non-matching isogeometric shells with moving\n  intersections","authors":"Han Zhao, John T. Hwang, J. S. Chen","authorsParsed":[["Zhao","Han",""],["Hwang","John T.",""],["Chen","J. S.",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 18:43:59 GMT"}],"updateDate":"2024-07-02","timestamp":1719600239000,"abstract":"  While shape optimization using isogeometric shells exhibits appealing\nfeatures by integrating design geometries and analysis models, challenges arise\nwhen addressing computer-aided design (CAD) geometries comprised of multiple\nnon-uniform rational B-splines (NURBS) patches, which are common in practice.\nThe intractability stems from surface intersections within these CAD models. In\nthis paper, we develop an approach for shape optimization of non-matching\nisogeometric shells incorporating intersection movement. Separately\nparametrized NURBS surfaces are modeled using Kirchhoff--Love shell theory and\ncoupled using a penalty-based formulation. The optimization scheme allows shell\npatches to move without preserving relative location with other members during\nthe shape optimization. This flexibility is achieved through an implicit state\nfunction, and analytical sensitivities are derived for the relative movement of\nshell patches. The introduction of differentiable intersections expands the\ndesign space and overcomes challenges associated with large mesh distortion,\nparticularly when optimal shapes involve significant movement of patch\nintersections in physical space. Throughout optimization iterations, all\nmembers within the shell structures maintain the NURBS geometry representation,\nenabling efficient integration of analysis and design models. The optimization\napproach leverages the multilevel design concept by selecting a refined model\nfor accurate analysis from a coarse design model while maintaining the same\ngeometry. We adopt several example problems to verify the effectiveness of the\nproposed scheme and demonstrate its applicability to the optimization of the\ninternal stiffeners of an aircraft wing.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}