{"id":"2407.15944","title":"Unextendible entanglement of quantum channels","authors":"Vishal Singh, Mark M. Wilde","authorsParsed":[["Singh","Vishal",""],["Wilde","Mark M.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:00:17 GMT"}],"updateDate":"2024-07-24","timestamp":1721671217000,"abstract":"  Quantum communication relies on the existence of high quality quantum\nchannels to exchange information. In practice, however, all communication links\nare affected by noise from the environment. Here we investigate the ability of\nquantum channels to perform quantum communication tasks by restricting the\nparticipants to use only local operations and one-way classical communication\n(one-way LOCC) along with the available quantum channel. In particular, a\nchannel can be used to distill a highly entangled state between two parties,\nwhich further enables quantum or private communication. In this work, we invoke\nthe framework of superchannels to study the distillation of a resourceful\nquantum state, such as a maximally entangled state or a private state, using\nmultiple instances of a point-to-point quantum channel. We use the idea of\n$k$-extendibility to obtain a semidefinite relaxation of the set of one-way\nLOCC superchannels and define a class of entanglement measures for quantum\nchannels that decrease monotonically under such superchannels; therefore these\nmeasures, dubbed collectively the ``unextendible entanglement of a channel'',\nyield upper bounds on several communication-theoretic quantities of interest in\nthe regimes of resource distillation and zero error. We then generalize the\nformalism of $k$-extendibility to bipartite superchannels, thus obtaining\nfunctions that are monotone under two-extendible superchannels. This allows us\nto analyze probabilistic distillation of ebits or secret key bits from a\nbipartite state when using a resourceful quantum channel. Moreover, we propose\nsemidefinite programs to evaluate several of these quantities, providing a\ncomputationally feasible method of comparison between quantum channels for\nresource distillation.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}