{"id":"2407.05910","title":"Enhancing Vision-Language Models with Scene Graphs for Traffic Accident\n  Understanding","authors":"Aaron Lohner, Francesco Compagno, Jonathan Francis, Alessandro\n  Oltramari","authorsParsed":[["Lohner","Aaron",""],["Compagno","Francesco",""],["Francis","Jonathan",""],["Oltramari","Alessandro",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 13:15:11 GMT"}],"updateDate":"2024-07-09","timestamp":1720444511000,"abstract":"  Recognizing a traffic accident is an essential part of any autonomous driving\nor road monitoring system. An accident can appear in a wide variety of forms,\nand understanding what type of accident is taking place may be useful to\nprevent it from reoccurring. The task of being able to classify a traffic scene\nas a specific type of accident is the focus of this work. We approach the\nproblem by likening a traffic scene to a graph, where objects such as cars can\nbe represented as nodes, and relative distances and directions between them as\nedges. This representation of an accident can be referred to as a scene graph,\nand is used as input for an accident classifier. Better results can be obtained\nwith a classifier that fuses the scene graph input with representations from\nvision and language. This work introduces a multi-stage, multimodal pipeline to\npre-process videos of traffic accidents, encode them as scene graphs, and align\nthis representation with vision and language modalities for accident\nclassification. When trained on 4 classes, our method achieves a balanced\naccuracy score of 57.77% on an (unbalanced) subset of the popular Detection of\nTraffic Anomaly (DoTA) benchmark, representing an increase of close to 5\npercentage points from the case where scene graph information is not taken into\naccount.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}