{"id":"2407.01460","title":"How Clustering Affects the Convergence of Decentralized Optimization\n  over Networks: A Monte-Carlo-based Approach","authors":"Mohammadreza Doostmohammadian, Shahaboddin Kharazmi, Hamid R. Rabiee","authorsParsed":[["Doostmohammadian","Mohammadreza",""],["Kharazmi","Shahaboddin",""],["Rabiee","Hamid R.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 16:55:05 GMT"}],"updateDate":"2024-07-02","timestamp":1719852905000,"abstract":"  Decentralized algorithms have gained substantial interest owing to\nadvancements in cloud computing, Internet of Things (IoT), intelligent\ntransportation networks, and parallel processing over sensor networks. The\nconvergence of such algorithms is directly related to specific properties of\nthe underlying network topology. Specifically, the clustering coefficient is\nknown to affect, for example, the controllability/observability and the\nepidemic growth over networks. In this work, we study the effects of the\nclustering coefficient on the convergence rate of networked optimization\napproaches. In this regard, we model the structure of large-scale distributed\nsystems by random scale-free (SF) and clustered scale-free (CSF) networks and\ncompare the convergence rate by tuning the network clustering coefficient. This\nis done by keeping other relevant network properties (such as power-law degree\ndistribution, number of links, and average degree) unchanged. Monte-Carlo-based\nsimulations are used to compare the convergence rate over many trials of SF\ngraph topologies. Furthermore, to study the convergence rate over real case\nstudies, we compare the clustering coefficient of some real-world networks with\nthe eigenspectrum of the underlying network (as a measure of convergence rate).\nThe results interestingly show higher convergence rate over low-clustered\nnetworks. This is significant as one can improve the learning rate of many\nexisting decentralized machine-learning scenarios by tuning the network\nclustering.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_eYwDif2snWevBWupQrcel7Ht5R2YvYDTJdQ0RiBD6E","pdfSize":"678797"}
