{"id":"2407.15663","title":"MSSPlace: Multi-Sensor Place Recognition with Visual and Text Semantics","authors":"Alexander Melekhin, Dmitry Yudin, Ilia Petryashin, Vitaly Bezuglyj","authorsParsed":[["Melekhin","Alexander",""],["Yudin","Dmitry",""],["Petryashin","Ilia",""],["Bezuglyj","Vitaly",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:24:56 GMT"}],"updateDate":"2024-07-23","timestamp":1721658296000,"abstract":"  Place recognition is a challenging task in computer vision, crucial for\nenabling autonomous vehicles and robots to navigate previously visited\nenvironments. While significant progress has been made in learnable multimodal\nmethods that combine onboard camera images and LiDAR point clouds, the full\npotential of these methods remains largely unexplored in localization\napplications. In this paper, we study the impact of leveraging a multi-camera\nsetup and integrating diverse data sources for multimodal place recognition,\nincorporating explicit visual semantics and text descriptions. Our proposed\nmethod named MSSPlace utilizes images from multiple cameras, LiDAR point\nclouds, semantic segmentation masks, and text annotations to generate\ncomprehensive place descriptors. We employ a late fusion approach to integrate\nthese modalities, providing a unified representation. Through extensive\nexperiments on the Oxford RobotCar and NCLT datasets, we systematically analyze\nthe impact of each data source on the overall quality of place descriptors. Our\nexperiments demonstrate that combining data from multiple sensors significantly\nimproves place recognition model performance compared to single modality\napproaches and leads to state-of-the-art quality. We also show that separate\nusage of visual or textual semantics (which are more compact representations of\nsensory data) can achieve promising results in place recognition. The code for\nour method is publicly available: https://github.com/alexmelekhin/MSSPlace\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"19YWjE2Dr1kf4AjxG8P1Apk-RBru9QZkkuTr25S_Ok8","pdfSize":"8359907"}
