{"id":"2407.02859","title":"Spatially Coherent 3D Distributions of HI and CO in the Milky Way","authors":"Laurin S\\\"oding, Gordian Edenhofer, Torsten A. En{\\ss}lin, Philipp\n  Frank, Ralf Kissmann, Vo Hong Minh Phan, Andr\\'es Ram\\'irez, Hanieh\n  Zhandinejad, Philipp Mertsch","authorsParsed":[["Söding","Laurin",""],["Edenhofer","Gordian",""],["Enßlin","Torsten A.",""],["Frank","Philipp",""],["Kissmann","Ralf",""],["Phan","Vo Hong Minh",""],["Ramírez","Andrés",""],["Zhandinejad","Hanieh",""],["Mertsch","Philipp",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 07:18:31 GMT"}],"updateDate":"2024-07-04","timestamp":1719991111000,"abstract":"  The spatial distribution of the gaseous components of the Milky Way is of\ngreat importance for a number of different fields, e.g. Galactic structure,\nstar formation and cosmic rays. However, obtaining distance information to\ngaseous clouds in the interstellar medium from Doppler-shifted line emission is\nnotoriously difficult given our unique vantage point in the Galaxy. It requires\nprecise knowledge of gas velocities and generally suffers from distance\nambiguities.\n  Previous works often assumed the optically thin limit (no absorption), a\nfixed velocity field, and lack resolution overall. We aim to overcome these\nissues and improve previous reconstructions of the gaseous constituents of the\ninterstellar medium of the Galaxy.\n  We use 3D Gaussian processes to model correlations in the interstellar\nmedium, including correlations between different lines of sight, and enforce a\nspatially coherent structure in the prior. For modelling the transport of\nradiation from the emitting gas to us as observers, we take absorption effects\ninto account. A special numerical grid ensures high resolution nearby. We infer\nthe spatial distributions of HI, CO, their emission line-widths, and the\nGalactic velocity field in a joint Bayesian inference. We further constrain\nthese fields with complementary data from Galactic masers and young stellar\nobject clusters.\n  Our main result consists of a set of samples that implicitly contain\nstatistical uncertainties. The resulting maps are spatially coherent and\nreproduce the data with high fidelity. We confirm previous findings regarding\nthe warping and flaring of the Galactic disc. A comparison with 3D dust maps\nreveals a good agreement on scales larger than approximately 400 pc. While our\nresults are not free of artefacts, they present a big step forward in obtaining\nhigh quality 3D maps of the interstellar medium.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}