{"id":"2407.20711","title":"Information index augmented eRG to model vaccination behaviour: A case\n  study of COVID-19 in the US","authors":"Bruno Buonomo, Alessandra D'Alise, Rossella Della Marca, Francesco\n  Sannino","authorsParsed":[["Buonomo","Bruno",""],["D'Alise","Alessandra",""],["Della Marca","Rossella",""],["Sannino","Francesco",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 10:11:45 GMT"}],"updateDate":"2024-07-31","timestamp":1722334305000,"abstract":"  Recent pandemics triggered the development of a number of mathematical models\nand computational tools apt at curbing the socio-economic impact of these and\nfuture pandemics. The need to acquire solid estimates from the data led to the\nintroduction of effective approaches such as the \\emph{epidemiological\nRenormalization Group} (eRG). A recognized relevant factor impacting the\nevolution of pandemics is the feedback stemming from individuals' choices. The\nlatter can be taken into account via the \\textit{information index} which\naccommodates the information--induced perception regarding the status of the\ndisease and the memory of past spread. We, therefore, show how to augment the\neRG by means of the information index. We first develop the {\\it behavioural}\nversion of the eRG and then test it against the US vaccination campaign for\nCOVID-19. We find that the behavioural augmented eRG improves the description\nof the pandemic dynamics of the US divisions for which the epidemic peak occurs\nafter the start of the vaccination campaign. Our results strengthen the\nrelevance of taking into account the human behaviour component when modelling\npandemic evolution. To inform public health policies, the model can be readily\nemployed to investigate the socio-epidemiological dynamics, including\nvaccination campaigns, for other regions of the world.\n","subjects":["Quantitative Biology/Populations and Evolution","Mathematics/Dynamical Systems","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qq-KyEnTatdZPF7fT-uBIMcLHD-7yv4mlD7VYbF7LJQ","pdfSize":"675378"}
