{"id":"2407.13924","title":"Preparing Fermilab to Carry Out the P5 Plan","authors":"Giorgio Bellettini","authorsParsed":[["Bellettini","Giorgio",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 22:26:14 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 23:18:58 GMT"}],"updateDate":"2024-08-01","timestamp":1721341574000,"abstract":"  In the past several years, Fermi National Accelerator Laboratory (Fermilab)\nhas suffered a number of troublesome setbacks. In some cases, failures to\nrespond effectively have only made things worse, resulting in the current\ncrisis atmosphere at the laboratory. This is reflected in part in the poorly\nrated performance appraisals (or PEMP) that the DOE provides to the lab every\nyear. Three entities are currently responsible for supporting, managing,\noperating, and leading the lab: the Department of Energy (DOE), Fermi Research\nAlliance (FRA), and the Laboratory Director Office. Two recent events provide\nopportunities for interested parties to reverse the recent decline: the release\nin December 2023 of the P5 Report and the DOE decision to rebid the Management\n& Operating (M&O) contract. The P5 Report a decadal update of recommendations\nfor US particle physics, includes an ambitious and positive roadmap for\nprojects and activities at Fermilab. Carrying out the P5 plan successfully,\nhowever, will also require addressing many of the other problems currently\nbesetting the lab. The selection of a new M&O contractor is under the\nresponsibility of the Deputy Director for Operations of the DOE Office of\nScience Dr. Juston Fontaine. A new M&O Contractor would replace FRA and name a\nnew Director effective January 1, 2025. A new management team, one hopes, would\nbe motivated to solve problems and would enjoy a honeymoon period, enabling\nthem to make positive changes more easily. Stimulated by these recent\ndevelopments, the authors of this document, all present or past employees,\nconvened confidentially in order to collect testimonials on a series of events\nsymptomatic of the lab problems, to provide constructive criticism and offer\npossible solutions. This document summarizes this work.\n","subjects":["Physics/Accelerator Physics","Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}