{"id":"2407.00983","title":"FairMedFM: Fairness Benchmarking for Medical Imaging Foundation Models","authors":"Ruinan Jin, Zikang Xu, Yuan Zhong, Qiongsong Yao, Qi Dou, S. Kevin\n  Zhou, Xiaoxiao Li","authorsParsed":[["Jin","Ruinan",""],["Xu","Zikang",""],["Zhong","Yuan",""],["Yao","Qiongsong",""],["Dou","Qi",""],["Zhou","S. Kevin",""],["Li","Xiaoxiao",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 05:47:58 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 16:37:36 GMT"}],"updateDate":"2024-07-04","timestamp":1719812878000,"abstract":"  The advent of foundation models (FMs) in healthcare offers unprecedented\nopportunities to enhance medical diagnostics through automated classification\nand segmentation tasks. However, these models also raise significant concerns\nabout their fairness, especially when applied to diverse and underrepresented\npopulations in healthcare applications. Currently, there is a lack of\ncomprehensive benchmarks, standardized pipelines, and easily adaptable\nlibraries to evaluate and understand the fairness performance of FMs in medical\nimaging, leading to considerable challenges in formulating and implementing\nsolutions that ensure equitable outcomes across diverse patient populations. To\nfill this gap, we introduce FairMedFM, a fairness benchmark for FM research in\nmedical imaging.FairMedFM integrates with 17 popular medical imaging datasets,\nencompassing different modalities, dimensionalities, and sensitive attributes.\nIt explores 20 widely used FMs, with various usages such as zero-shot learning,\nlinear probing, parameter-efficient fine-tuning, and prompting in various\ndownstream tasks -- classification and segmentation. Our exhaustive analysis\nevaluates the fairness performance over different evaluation metrics from\nmultiple perspectives, revealing the existence of bias, varied utility-fairness\ntrade-offs on different FMs, consistent disparities on the same datasets\nregardless FMs, and limited effectiveness of existing unfairness mitigation\nmethods. Checkout FairMedFM's project page and open-sourced codebase, which\nsupports extendible functionalities and applications as well as inclusive for\nstudies on FMs in medical imaging over the long term.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}