{"id":"2407.00915","title":"The differences in the origination and properties of the near-Earth\n  solar wind between solar cycles 23 and 24","authors":"Xinzheng Shi, Hui Fu, Zhenghua Huang, Limei Yan, Chi Ma, Chenxi\n  Huangfu, Hongqiang Song, and Lidong Xia","authorsParsed":[["Shi","Xinzheng",""],["Fu","Hui",""],["Huang","Zhenghua",""],["Yan","Limei",""],["Ma","Chi",""],["Huangfu","Chenxi",""],["Song","Hongqiang",""],["Xia","Lidong",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 02:42:16 GMT"}],"updateDate":"2024-07-02","timestamp":1719801736000,"abstract":"  The dependence of the sources and properties of the near-Earth solar wind on\nsolar cycle activity is an important issue in solar and space physics. We use\nthe improved two-step mapping procedure that takes into account the initial\nacceleration processes to trace the near-Earth solar winds back to their source\nregions from 1999 to 2020, covering solar cycles (SCs) 23 and 24. Then the\nsolar wind is categorized into coronal hole (CH), active region (AR), and quiet\nSun (QS) solar wind based on the source region types. We find that the\nproportions of CH and AR (QS) wind during SC 23 are higher (lower) than those\nduring SC 24. During solar maximum and declining phases, the magnetic field\nstrength, speed, helium abundance (AHe), and charge states of all three types\nof solar wind during SC 23 are generally higher than those during SC 24. During\nsolar minimum, these parameters of solar wind are generally lower during SC 23\nthan those during SC 24. There is a significant decrease in the charge states\nof all three types of solar wind during the solar minimum of SC 23. The present\nstatistical results demonstrate that the sources and properties of the solar\nwind are both influenced by solar cycle amplitude. The temperatures of AR, QS,\nand CH regions exhibit significant difference at low altitudes, whereas they\nare almost uniform at high altitudes.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}