{"id":"2407.06799","title":"Investigating the Kinetic Effects on Current Gradient-Driven\n  Instabilities of Electron Current Layers via Particle-in-Cell Simulations","authors":"Sushmita Mishra, Gurudatt Gaur, Bhavesh G. Patel","authorsParsed":[["Mishra","Sushmita",""],["Gaur","Gurudatt",""],["Patel","Bhavesh G.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 12:11:34 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 06:30:41 GMT"},{"version":"v3","created":"Mon, 26 Aug 2024 13:35:21 GMT"}],"updateDate":"2024-08-27","timestamp":1720527094000,"abstract":"  Electron current layers form in various natural and laboratory plasmas and\nare susceptible to several instabilities. Tearing, driven by current gradients,\nstands out as a prominent instability in these layers and is considered a\npotential mechanism for magnetic reconnection in collisionless regimes.\nElectron inertia serves as a non-ideal factor causing magnetic field lines to\nbreak and subsequently reconnect. Another mode driven by current gradients,\nknown as the surface-preserving mode, maintains magnetic field topology. We\ninvestigated the kinetic effects on these modes in the presence of finite\nelectron temperatures using two-dimensional particle-in-cell simulations\n(implemented with the OSIRIS codebase). Temperature stabilizes the tearing mode\nto a large extent, except at low temperatures, due to increased electron Larmor\nradius and subsequent magnetic field diffusion. Introducing uniform guide\nfields revealed that growth rates decrease at higher temperatures due to\nreduced plasma beta. Conversely, for the surface-preserving mode, growth rates\nincrease with temperature, likely due to enhanced electron flow velocities.\nMixed modes, where both tearing and surface-preserving modes coexist, exhibit\nasymmetric structures characteristic of asymmetric magnetic reconnection.\nFinally, we propose future research directions building upon our findings.\n","subjects":["Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}