{"id":"2407.01623","title":"Uncertainty estimation in satellite precipitation spatial prediction by\n  combining distributional regression algorithms","authors":"Georgia Papacharalampous, Hristos Tyralis, Nikolaos Doulamis,\n  Anastasios Doulamis","authorsParsed":[["Papacharalampous","Georgia",""],["Tyralis","Hristos",""],["Doulamis","Nikolaos",""],["Doulamis","Anastasios",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 05:58:00 GMT"}],"updateDate":"2024-07-03","timestamp":1719640680000,"abstract":"  To facilitate effective decision-making, gridded satellite precipitation\nproducts should include uncertainty estimates. Machine learning has been\nproposed for issuing such estimates. However, most existing algorithms for this\npurpose rely on quantile regression. Distributional regression offers distinct\nadvantages over quantile regression, including the ability to model\nintermittency as well as a stronger ability to extrapolate beyond the training\ndata, which is critical for predicting extreme precipitation. In this work, we\nintroduce the concept of distributional regression for the engineering task of\ncreating precipitation datasets through data merging. Building upon this\nconcept, we propose new ensemble learning methods that can be valuable not only\nfor spatial prediction but also for prediction problems in general. These\nmethods exploit conditional zero-adjusted probability distributions estimated\nwith generalized additive models for location, scale, and shape (GAMLSS),\nspline-based GAMLSS and distributional regression forests as well as their\nensembles (stacking based on quantile regression, and equal-weight averaging).\nTo identify the most effective methods for our specific problem, we compared\nthem to benchmarks using a large, multi-source precipitation dataset. Stacking\nemerged as the most successful strategy. Three specific stacking methods\nachieved the best performance based on the quantile scoring rule, although the\nranking of these methods varied across quantile levels. This suggests that a\ntask-specific combination of multiple algorithms could yield significant\nbenefits.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Applications","Statistics/Methodology","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}