{"id":"2407.07173","title":"LuSEE-Night power requirements and power generation strategy","authors":"Benjamin R.B. Saliwanchik, Sven Herrmann, Ivan Kotov, Paul O'Connor,\n  Maxim Potekhin, An\\v{z}e Slosar, and Stuart Bale","authorsParsed":[["Saliwanchik","Benjamin R. B.",""],["Herrmann","Sven",""],["Kotov","Ivan",""],["O'Connor","Paul",""],["Potekhin","Maxim",""],["Slosar","Anže",""],["Bale","Stuart",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 18:37:26 GMT"}],"updateDate":"2024-07-11","timestamp":1720550246000,"abstract":"  The Lunar Surface Electromagnetics Experiment at Night (LuSEE-Night) is a\nproject designed to investigate the feasibility of observing the Cosmic Dark\nAges using an instrument on the lunar far-side. LuSEE-Night will measure the\nredshifted 21 cm transition of neutral hydrogen over a frequency range of\n0.1-50 MHz, covering the redshift range 27 < z < 1100. The LuSEE-Night\ninstrument is a radio frequency spectrometer, consisting of four horizontal\nmonopole antennas, arranged to give wide zenith-pointing beams with two\northogonal linear polarizations. This combination of polarization, spectral,\nand angular sensitivity will be necessary to separate the cosmological signal\nfrom significantly stronger foreground emissions. LuSEE-Night will observe in\ndrift scan during lunar night while the moon shields it from radio frequency\ninterference from both the Earth and sun, and will transmit science and\ntelemetry data back to Earth via an orbital relay during the lunar day.\nLuSEE-Night will have to operate in a challenging environment: its electronics\nmust operate under hard radiation, the instrument must be thermally isolated\nduring the cold 100~K lunar night, and have a thermal rejection path to survive\nthe 390~K daytime temperature, and its photovoltaic and battery systems must\nprovide sufficient power to operate during two weeks of lunar night.\nFurthermore, the instrument spectrometer must be powered throughout the lunar\nnight using only a 7~kWh battery, due to mass limitations. Here we describe the\npower generation, storage, and delivery subsystems of the LuSEE-Night\ninstrument, and the simulations which were performed to design the power\nsubsystems and ensure instrument survival and operation throughout the long\nlunar night. We also describe the Concept of Operations (ConOps) developed for\nthe LuSEE-Night mission, which derives from the power management simulations.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NXLuIyUMi5ZKggJVuLGrwTNMUlnmZLB62NDxzDTUETM","pdfSize":"4923548"}
