{"id":"2407.10731","title":"Unitary tetrahedron quantum gates","authors":"Vivek Kumar Singh, Akash Sinha, Pramod Padmanabhan, Vladimir Korepin","authorsParsed":[["Singh","Vivek Kumar",""],["Sinha","Akash",""],["Padmanabhan","Pramod",""],["Korepin","Vladimir",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 13:58:33 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 14:10:55 GMT"}],"updateDate":"2024-07-26","timestamp":1721051913000,"abstract":"  Quantum simulations of many-body systems using 2-qubit Yang-Baxter gates\noffer a benchmark for quantum hardware. This can be extended to the higher\ndimensional case with $n$-qubit generalisations of Yang-Baxter gates called\n$n$-simplex operators. Such multi-qubit gates potentially lead to shallower and\nmore efficient quantum circuits as well. Finding them amounts to identifying\nunitary solutions of the $n$-simplex equations, the building blocks of higher\ndimensional integrable systems. These are a set of highly non-linear and over\ndetermined system of equations making it notoriously hard to solve even when\nthe local Hilbert spaces are spanned by qubits. We systematically overcome this\nfor higher simplex operators constructed using two methods: from Clifford\nalgebras and by lifting Yang-Baxter operators. The $n=3$ or the tetrahedron\ncase is analyzed in detail. For the qubit case our methods produce 13\ninequivalent families of unitary tetrahedron operators. 12 of these families\nare obtained by appending the 5 unitary families of 4 by 4 constant Yang-Baxter\noperators of Dye-Hietarinta, with a single qubit operator. As applications,\nuniversal sets of single, two and three qubit gates are realized using such\nunitary tetrahedron operators. The ideas presented in this work can be\nnaturally extended to the higher simplex cases.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Statistical Mechanics","Physics/High Energy Physics - Theory","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Nonlinear Sciences/Exactly Solvable and Integrable Systems"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}