{"id":"2407.15321","title":"Hierarchical Homogeneity-Based Superpixel Segmentation: Application to\n  Hyperspectral Image Analysis","authors":"Luciano Carvalho Ayres, S\\'ergio Jos\\'e Melo de Almeida, Jos\\'e Carlos\n  Moreira Bermudez, Ricardo Augusto Borsoi","authorsParsed":[["Ayres","Luciano Carvalho",""],["de Almeida","Sérgio José Melo",""],["Bermudez","José Carlos Moreira",""],["Borsoi","Ricardo Augusto",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 01:20:32 GMT"}],"updateDate":"2024-07-23","timestamp":1721611232000,"abstract":"  Hyperspectral image (HI) analysis approaches have recently become\nincreasingly complex and sophisticated. Recently, the combination of\nspectral-spatial information and superpixel techniques have addressed some\nhyperspectral data issues, such as the higher spatial variability of spectral\nsignatures and dimensionality of the data. However, most existing superpixel\napproaches do not account for specific HI characteristics resulting from its\nhigh spectral dimension. In this work, we propose a multiscale superpixel\nmethod that is computationally efficient for processing hyperspectral data. The\nSimple Linear Iterative Clustering (SLIC) oversegmentation algorithm, on which\nthe technique is based, has been extended hierarchically. Using a novel robust\nhomogeneity testing, the proposed hierarchical approach leads to superpixels of\nvariable sizes but with higher spectral homogeneity when compared to the\nclassical SLIC segmentation. For validation, the proposed homogeneity-based\nhierarchical method was applied as a preprocessing step in the spectral\nunmixing and classification tasks carried out using, respectively, the\nMultiscale sparse Unmixing Algorithm (MUA) and the CNN-Enhanced Graph\nConvolutional Network (CEGCN) methods. Simulation results with both synthetic\nand real data show that the technique is competitive with state-of-the-art\nsolutions.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}