{"id":"2407.12428","title":"Context-Aware Fuzzing for Robustness Enhancement of Deep Learning Models","authors":"Haipeng Wang, Zhengyuan Wei, Qilin Zhou, Wing-Kwong Chan","authorsParsed":[["Wang","Haipeng",""],["Wei","Zhengyuan",""],["Zhou","Qilin",""],["Chan","Wing-Kwong",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 09:31:10 GMT"}],"updateDate":"2024-07-18","timestamp":1721208670000,"abstract":"  In the testing-retraining pipeline for enhancing the robustness property of\ndeep learning (DL) models, many state-of-the-art robustness-oriented fuzzing\ntechniques are metric-oriented. The pipeline generates adversarial examples as\ntest cases via such a DL testing technique and retrains the DL model under test\nwith test suites that contain these test cases. On the one hand, the strategies\nof these fuzzing techniques tightly integrate the key characteristics of their\ntesting metrics. On the other hand, they are often unaware of whether their\ngenerated test cases are different from the samples surrounding these test\ncases and whether there are relevant test cases of other seeds when generating\nthe current one. We propose a novel testing metric called Contextual Confidence\n(CC). CC measures a test case through the surrounding samples of a test case in\nterms of their mean probability predicted to the prediction label of the test\ncase. Based on this metric, we further propose a novel fuzzing technique Clover\nas a DL testing technique for the pipeline. In each fuzzing round, Clover first\nfinds a set of seeds whose labels are the same as the label of the seed under\nfuzzing. At the same time, it locates the corresponding test case that achieves\nthe highest CC values among the existing test cases of each seed in this set of\nseeds and shares the same prediction label as the existing test case of the\nseed under fuzzing that achieves the highest CC value. Clover computes the\npiece of difference between each such pair of a seed and a test case. It\nincrementally applies these pieces of differences to perturb the current test\ncase of the seed under fuzzing that achieves the highest CC value and to\nperturb the resulting samples along the gradient to generate new test cases for\nthe seed under fuzzing.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}