{"id":"2407.17460","title":"SoNIC: Safe Social Navigation with Adaptive Conformal Inference and\n  Constrained Reinforcement Learning","authors":"Jianpeng Yao, Xiaopan Zhang, Yu Xia, Zejin Wang, Amit K.\n  Roy-Chowdhury, Jiachen Li","authorsParsed":[["Yao","Jianpeng",""],["Zhang","Xiaopan",""],["Xia","Yu",""],["Wang","Zejin",""],["Roy-Chowdhury","Amit K.",""],["Li","Jiachen",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 17:57:21 GMT"}],"updateDate":"2024-07-25","timestamp":1721843841000,"abstract":"  Reinforcement Learning (RL) has enabled social robots to generate\ntrajectories without human-designed rules or interventions, which makes it more\neffective than hard-coded systems for generalizing to complex real-world\nscenarios. However, social navigation is a safety-critical task that requires\nrobots to avoid collisions with pedestrians while previous RL-based solutions\nfall short in safety performance in complex environments. To enhance the safety\nof RL policies, to the best of our knowledge, we propose the first algorithm,\nSoNIC, that integrates adaptive conformal inference (ACI) with constrained\nreinforcement learning (CRL) to learn safe policies for social navigation. More\nspecifically, our method augments RL observations with ACI-generated\nnonconformity scores and provides explicit guidance for agents to leverage the\nuncertainty metrics to avoid safety-critical areas by incorporating safety\nconstraints with spatial relaxation. Our method outperforms state-of-the-art\nbaselines in terms of both safety and adherence to social norms by a large\nmargin and demonstrates much stronger robustness to out-of-distribution\nscenarios. Our code and video demos are available on our project website:\nhttps://sonic-social-nav.github.io/.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}