{"id":"2407.21712","title":"Adaptive Retrieval-Augmented Generation for Conversational Systems","authors":"Xi Wang, Procheta Sen, Ruizhe Li, Emine Yilmaz","authorsParsed":[["Wang","Xi",""],["Sen","Procheta",""],["Li","Ruizhe",""],["Yilmaz","Emine",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 16:04:03 GMT"}],"updateDate":"2024-08-01","timestamp":1722441843000,"abstract":"  Despite the success of integrating large language models into the development\nof conversational systems, many studies have shown the effectiveness of\nretrieving and augmenting external knowledge for informative responses. Hence,\nmany existing studies commonly assume the always need for Retrieval Augmented\nGeneration (RAG) in a conversational system without explicit control. This\nraises a research question about such a necessity. In this study, we propose to\ninvestigate the need for each turn of system response to be augmented with\nexternal knowledge. In particular, by leveraging human judgements on the binary\nchoice of adaptive augmentation, we develop RAGate, a gating model, which\nmodels conversation context and relevant inputs to predict if a conversational\nsystem requires RAG for improved responses. We conduct extensive experiments on\ndevising and applying RAGate to conversational models and well-rounded analyses\nof different conversational scenarios. Our experimental results and analysis\nindicate the effective application of RAGate in RAG-based conversational\nsystems in identifying system responses for appropriate RAG with high-quality\nresponses and a high generation confidence. This study also identifies the\ncorrelation between the generation's confidence level and the relevance of the\naugmented knowledge.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"VWb_RBICppsnNvTvOb0cNLOUxmYuDGEJxpQvRM7_RBI","pdfSize":"564437"}
