{"id":"2407.06294","title":"Beyond theory driven discovery: hot random search and datum derived\n  structures","authors":"Chris J. Pickard","authorsParsed":[["Pickard","Chris J.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:04:59 GMT"}],"updateDate":"2024-07-10","timestamp":1720461899000,"abstract":"  Data driven methods have transformed the prospects of the computational\nchemical sciences, with machine learned interatomic potentials (MLIPs) speeding\nup calculations by several orders of magnitude. I reflect on theory driven, as\nopposed to data driven, discovery based on ab initio random structure searching\n(AIRSS), and then introduce two methods which exploit machine learning\nacceleration. I show how long high throughput anneals, between direct\nstructural relaxation, enabled by ephemeral data derived potentials (EDDPs),\ncan be incorporated into AIRSS to bias the sampling of challenging systems\ntowards low energy configurations. Hot AIRSS (hot-AIRSS) preserves the parallel\nadvantage of random search, while allowing much more complex systems to be\ntackled. This is demonstrated through searches for complex boron structures in\nlarge unit cells. I then show how low energy carbon structures can be directly\ngenerated from a single, experimentally determined, diamond structure. An\nextension to the generation of random sensible structures, candidates are\nstochastically generated and then optimised to minimise the difference between\nthe EDDP environment vector and that of the reference diamond structure. The\ndistance-based cost function is captured in an actively learned EDDP. Graphite,\nsmall nanotubes and caged, fullerene-like, structures emerge from searches\nusing this potential, along with a rich variety of tetrahedral framework\nstructures. Using the same approach, the pyrope, Mg$_3$Al$_2$(SiO$_4$)$_3$,\ngarnet structure is recovered from a low energy AIRSS structure generated in a\nsmaller unit cell with a different chemical composition. The relationship of\nthis approach to modern diffusion model based generative methods is discussed.\n","subjects":["Physics/Computational Physics","Condensed Matter/Materials Science","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cfEaLW1evlaYT5v0W4kjBL6vG-rrrH8xFwMn7y0W3Bk","pdfSize":"14908800"}
