{"id":"2407.08822","title":"FedMedICL: Towards Holistic Evaluation of Distribution Shifts in\n  Federated Medical Imaging","authors":"Kumail Alhamoud, Yasir Ghunaim, Motasem Alfarra, Thomas Hartvigsen,\n  Philip Torr, Bernard Ghanem, Adel Bibi, Marzyeh Ghassemi","authorsParsed":[["Alhamoud","Kumail",""],["Ghunaim","Yasir",""],["Alfarra","Motasem",""],["Hartvigsen","Thomas",""],["Torr","Philip",""],["Ghanem","Bernard",""],["Bibi","Adel",""],["Ghassemi","Marzyeh",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 19:12:23 GMT"}],"updateDate":"2024-07-15","timestamp":1720725143000,"abstract":"  For medical imaging AI models to be clinically impactful, they must\ngeneralize. However, this goal is hindered by (i) diverse types of distribution\nshifts, such as temporal, demographic, and label shifts, and (ii) limited\ndiversity in datasets that are siloed within single medical institutions. While\nthese limitations have spurred interest in federated learning, current\nevaluation benchmarks fail to evaluate different shifts simultaneously.\nHowever, in real healthcare settings, multiple types of shifts co-exist, yet\ntheir impact on medical imaging performance remains unstudied. In response, we\nintroduce FedMedICL, a unified framework and benchmark to holistically evaluate\nfederated medical imaging challenges, simultaneously capturing label,\ndemographic, and temporal distribution shifts. We comprehensively evaluate\nseveral popular methods on six diverse medical imaging datasets (totaling 550\nGPU hours). Furthermore, we use FedMedICL to simulate COVID-19 propagation\nacross hospitals and evaluate whether methods can adapt to pandemic changes in\ndisease prevalence. We find that a simple batch balancing technique surpasses\nadvanced methods in average performance across FedMedICL experiments. This\nfinding questions the applicability of results from previous, narrow benchmarks\nin real-world medical settings.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}