{"id":"2407.07368","title":"Data-driven Bayesian State Estimation with Compressed Measurement of\n  Model-free Process using Semi-supervised Learning","authors":"Anubhab Ghosh, Yonina C. Eldar, Saikat Chatterjee","authorsParsed":[["Ghosh","Anubhab",""],["Eldar","Yonina C.",""],["Chatterjee","Saikat",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 05:03:48 GMT"}],"updateDate":"2024-07-11","timestamp":1720587828000,"abstract":"  The research topic is: data-driven Bayesian state estimation with compressed\nmeasurement (BSCM) of model-free process, say for a (causal) tracking\napplication. The dimension of the temporal measurement vector is lower than the\ndimension of the temporal state vector to be estimated. Hence the state\nestimation problem is an underdetermined inverse problem. The state-space-model\n(SSM) of the underlying dynamical process is assumed to be unknown and hence,\nwe use the terminology 'model-free process'. In absence of the SSM, we can not\nemploy traditional model-driven methods like Kalman Filter (KF) and Particle\nFilter (PF) and instead require data-driven methods. We first experimentally\nshow that two existing unsupervised learning-based data-driven methods fail to\naddress the BSCM problem for model-free process; they are data-driven nonlinear\nstate estimation (DANSE) method and deep Markov model (DMM) method. The\nunsupervised learning uses unlabelled data comprised of only noisy\nmeasurements. While DANSE provides a good predictive performance to model the\ntemporal measurement data as time-series, its unsupervised learning lacks a\nregularization for state estimation. We then investigate use of a\nsemi-supervised learning approach, and develop a semi-supervised learning-based\nDANSE method, referred to as SemiDANSE. In the semi-supervised learning, we use\na limited amount of labelled data along-with a large amount of unlabelled data,\nand that helps to bring the desired regularization for BSCM problem in the\nabsence of SSM. The labelled data means pairwise measurement-and-state data.\nUsing three chaotic dynamical systems (or processes) with nonlinear SSMs as\nbenchmark, we show that the data-driven SemiDANSE provides competitive\nperformance for BSCM against three SSM-informed methods - a hybrid method\ncalled KalmanNet, and two traditional model-driven methods called extended KF\nand unscented KF.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}