{"id":"2407.01927","title":"TTSlow: Slow Down Text-to-Speech with Efficiency Robustness Evaluations","authors":"Xiaoxue Gao, Yiming Chen, Xianghu Yue, Yu Tsao and Nancy F. Chen","authorsParsed":[["Gao","Xiaoxue",""],["Chen","Yiming",""],["Yue","Xianghu",""],["Tsao","Yu",""],["Chen","Nancy F.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 03:43:56 GMT"}],"updateDate":"2024-07-03","timestamp":1719891836000,"abstract":"  Text-to-speech (TTS) has been extensively studied for generating high-quality\nspeech with textual inputs, playing a crucial role in various real-time\napplications. For real-world deployment, ensuring stable and timely generation\nin TTS models against minor input perturbations is of paramount importance.\nTherefore, evaluating the robustness of TTS models against such perturbations,\ncommonly known as adversarial attacks, is highly desirable. In this paper, we\npropose TTSlow, a novel adversarial approach specifically tailored to slow down\nthe speech generation process in TTS systems. To induce long TTS waiting time,\nwe design novel efficiency-oriented adversarial loss to encourage endless\ngeneration process. TTSlow encompasses two attack strategies targeting both\ntext inputs and speaker embedding. Specifically, we propose TTSlow-text, which\nutilizes a combination of homoglyphs-based and swap-based perturbations, along\nwith TTSlow-spk, which employs a gradient optimization attack approach for\nspeaker embedding. TTSlow serves as the first attack approach targeting a wide\nrange of TTS models, including autoregressive and non-autoregressive TTS ones,\nthereby advancing exploration in audio security. Extensive experiments are\nconducted to evaluate the inference efficiency of TTS models, and in-depth\nanalysis of generated speech intelligibility is performed using Gemini. The\nresults demonstrate that TTSlow can effectively slow down two TTS models across\nthree publicly available datasets. We are committed to releasing the source\ncode upon acceptance, facilitating further research and benchmarking in this\ndomain.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"fhwD8tLQyVhUt2P9GkjqVSa_YimTJg5kbNQ-gKrxMb4","pdfSize":"10396251","objectId":"0x54f6c3ed192a39d048005c637beb33a1b023809d035866264fb8ea7e5fbf78ad","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
