{"id":"2407.19086","title":"Super Resolution for Renewable Energy Resource Data With Wind From\n  Reanalysis Data (Sup3rWind) and Application to Ukraine","authors":"Brandon N. Benton, Grant Buster, Pavlo Pinchuk, Andrew Glaws, Ryan N.\n  King, Galen Maclaurin, Ilya Chernyakhovskiy","authorsParsed":[["Benton","Brandon N.",""],["Buster","Grant",""],["Pinchuk","Pavlo",""],["Glaws","Andrew",""],["King","Ryan N.",""],["Maclaurin","Galen",""],["Chernyakhovskiy","Ilya",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 21:07:17 GMT"}],"updateDate":"2024-07-30","timestamp":1722028037000,"abstract":"  With an increasing share of the electricity grid relying on wind to provide\ngenerating capacity and energy, there is an expanding global need for\nhistorically accurate high-resolution wind data. Conventional downscaling\nmethods for generating these data have a high computational burden and require\nextensive tuning for historical accuracy. In this work, we present a novel deep\nlearning-based spatiotemporal downscaling method, using generative adversarial\nnetworks (GANs), for generating historically accurate high-resolution wind\nresource data from the European Centre for Medium-Range Weather Forecasting\nReanalysis version 5 data (ERA5). We achieve results comparable in historical\naccuracy and spatiotemporal variability to conventional downscaling by training\na GAN model with ERA5 low-resolution input and high-resolution targets from the\nWind Integration National Dataset, while reducing computational costs over\ndynamical downscaling by two orders of magnitude. Spatiotemporal\ncross-validation shows low error and high correlations with observations and\nexcellent agreement with holdout data across distributions of physical metrics.\nWe apply this approach to downscale 30-km hourly ERA5 data to 2-km 5-minute\nwind data for January 2000 through December 2023 at multiple hub heights over\nEastern Europe. Uncertainty is estimated over the period with observational\ndata by additionally downscaling the members of the European Centre for\nMedium-Range Weather Forecasting Ensemble of Data Assimilations. Comparisons\nagainst observational data from the Meteorological Assimilation Data Ingest\nSystem and multiple wind farms show comparable performance to the CONUS\nvalidation. This 24-year data record is the first member of the super\nresolution for renewable energy resource data with wind from reanalysis data\ndataset (Sup3rWind).\n","subjects":["Physics/Atmospheric and Oceanic Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"x9nnhWG7a1kG4uYhxL2lLK_4fnFsPvuD_lJH3qQ9bOY","pdfSize":"4825337"}
