{"id":"2407.20224","title":"Can Editing LLMs Inject Harm?","authors":"Canyu Chen, Baixiang Huang, Zekun Li, Zhaorun Chen, Shiyang Lai,\n  Xiongxiao Xu, Jia-Chen Gu, Jindong Gu, Huaxiu Yao, Chaowei Xiao, Xifeng Yan,\n  William Yang Wang, Philip Torr, Dawn Song, Kai Shu","authorsParsed":[["Chen","Canyu",""],["Huang","Baixiang",""],["Li","Zekun",""],["Chen","Zhaorun",""],["Lai","Shiyang",""],["Xu","Xiongxiao",""],["Gu","Jia-Chen",""],["Gu","Jindong",""],["Yao","Huaxiu",""],["Xiao","Chaowei",""],["Yan","Xifeng",""],["Wang","William Yang",""],["Torr","Philip",""],["Song","Dawn",""],["Shu","Kai",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 17:58:06 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 17:57:20 GMT"},{"version":"v3","created":"Fri, 16 Aug 2024 19:43:03 GMT"}],"updateDate":"2024-08-20","timestamp":1722275886000,"abstract":"  Knowledge editing has been increasingly adopted to correct the false or\noutdated knowledge in Large Language Models (LLMs). Meanwhile, one critical but\nunder-explored question is: can knowledge editing be used to inject harm into\nLLMs? In this paper, we propose to reformulate knowledge editing as a new type\nof safety threat for LLMs, namely Editing Attack, and conduct a systematic\ninvestigation with a newly constructed dataset EditAttack. Specifically, we\nfocus on two typical safety risks of Editing Attack including Misinformation\nInjection and Bias Injection. For the risk of misinformation injection, we\nfirst categorize it into commonsense misinformation injection and long-tail\nmisinformation injection. Then, we find that editing attacks can inject both\ntypes of misinformation into LLMs, and the effectiveness is particularly high\nfor commonsense misinformation injection. For the risk of bias injection, we\ndiscover that not only can biased sentences be injected into LLMs with high\neffectiveness, but also one single biased sentence injection can cause a bias\nincrease in general outputs of LLMs, which are even highly irrelevant to the\ninjected sentence, indicating a catastrophic impact on the overall fairness of\nLLMs. Then, we further illustrate the high stealthiness of editing attacks,\nmeasured by their impact on the general knowledge and reasoning capacities of\nLLMs, and show the hardness of defending editing attacks with empirical\nevidence. Our discoveries demonstrate the emerging misuse risks of knowledge\nediting techniques on compromising the safety alignment of LLMs and the\nfeasibility of disseminating misinformation or bias with LLMs as new channels.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}