{"id":"2407.00676","title":"Instruct-IPT: All-in-One Image Processing Transformer via Weight\n  Modulation","authors":"Yuchuan Tian, Jianhong Han, Hanting Chen, Yuanyuan Xi, Guoyang Zhang,\n  Jie Hu, Chao Xu, Yunhe Wang","authorsParsed":[["Tian","Yuchuan",""],["Han","Jianhong",""],["Chen","Hanting",""],["Xi","Yuanyuan",""],["Zhang","Guoyang",""],["Hu","Jie",""],["Xu","Chao",""],["Wang","Yunhe",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 12:13:34 GMT"}],"updateDate":"2024-07-02","timestamp":1719749614000,"abstract":"  Due to the unaffordable size and intensive computation costs of low-level\nvision models, All-in-One models that are designed to address a handful of\nlow-level vision tasks simultaneously have been popular. However, existing\nAll-in-One models are limited in terms of the range of tasks and performance.\nTo overcome these limitations, we propose Instruct-IPT -- an All-in-One Image\nProcessing Transformer that could effectively address manifold image\nrestoration tasks with large inter-task gaps, such as denoising, deblurring,\nderaining, dehazing, and desnowing. Rather than popular feature adaptation\nmethods, we propose weight modulation that adapts weights to specific tasks.\nFirstly, we figure out task-sensitive weights via a toy experiment and\nintroduce task-specific biases on top of them. Secondly, we conduct rank\nanalysis for a good compression strategy and perform low-rank decomposition on\nthe biases. Thirdly, we propose synchronous training that updates the\ntask-general backbone model and the task-specific biases simultaneously. In\nthis way, the model is instructed to learn general and task-specific knowledge.\nVia our simple yet effective method that instructs the IPT to be task experts,\nInstruct-IPT could better cooperate between tasks with distinct characteristics\nat humble costs. Further, we propose to maneuver Instruct-IPT with text\ninstructions for better user interfaces. We have conducted experiments on\nInstruct-IPT to demonstrate the effectiveness of our method on manifold tasks,\nand we have effectively extended our method to diffusion denoisers as well. The\ncode is available at https://github.com/huawei-noah/Pretrained-IPT.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}