{"id":"2407.00222","title":"Synthesis and characterization of the novel breathing pyrochlore\n  compound Ba3Tm2Zn5O11","authors":"Lalit Yadav, Rabindranath Bag, Ramesh Dhakal, Stephen M. Winter,\n  Jeffrey G. Rau, Alexander I. Kolesnikov, Andrey A. Podlesnyak, Craig M.\n  Brown, Nicholas P. Butch, David Graf, Michel J.P. Gingras, Sara Haravifard","authorsParsed":[["Yadav","Lalit",""],["Bag","Rabindranath",""],["Dhakal","Ramesh",""],["Winter","Stephen M.",""],["Rau","Jeffrey G.",""],["Kolesnikov","Alexander I.",""],["Podlesnyak","Andrey A.",""],["Brown","Craig M.",""],["Butch","Nicholas P.",""],["Graf","David",""],["Gingras","Michel J. P.",""],["Haravifard","Sara",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 20:28:35 GMT"}],"updateDate":"2024-07-02","timestamp":1719606515000,"abstract":"  In this study, a novel material from the rare-earth based breathing\npyrochlore family, Ba3Tm2Zn5O11, was successfully synthesized. Powder X-ray\ndiffraction and high-resolution powder neutron diffraction confirmed phase\npurity and crystal structure, while thermogravimetric analysis revealed\nincongruent melting behavior compared to its counterpart, Ba3Yb2Zn5O11.\nHigh-quality single crystals of Ba3Tm2Zn5O11 were grown using the traveling\nsolvent floating zone technique and assessed using Laue diffractometer and\nsingle crystal X-ray diffraction. Thermodynamic characterization indicated\nparamagnetic behavior down to 0.05 K, and inelastic neutron scattering\nmeasurements identified distinct crystal electric field bands. Additional\nlow-energy excitation studies on single crystals revealed dispersionless bands\nat 0.8 and 1 meV. Computed phonon dispersions from first principles\ncalculations ruled out phonons as the source of these modes, further\nillustrating the puzzling and unique properties of Ba3Tm2Zn5O11.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}