{"id":"2407.08106","title":"SGLC: Semantic Graph-Guided Coarse-Fine-Refine Full Loop Closing for\n  LiDAR SLAM","authors":"Neng Wang, Xieyuanli Chen, Chenghao Shi, Zhiqiang Zheng, Hongshan Yu,\n  Huimin Lu","authorsParsed":[["Wang","Neng",""],["Chen","Xieyuanli",""],["Shi","Chenghao",""],["Zheng","Zhiqiang",""],["Yu","Hongshan",""],["Lu","Huimin",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 00:45:04 GMT"}],"updateDate":"2024-07-12","timestamp":1720658704000,"abstract":"  Loop closing is a crucial component in SLAM that helps eliminate accumulated\nerrors through two main steps: loop detection and loop pose correction. The\nfirst step determines whether loop closing should be performed, while the\nsecond estimates the 6-DoF pose to correct odometry drift. Current methods\nmostly focus on developing robust descriptors for loop closure detection, often\nneglecting loop pose estimation. A few methods that do include pose estimation\neither suffer from low accuracy or incur high computational costs. To tackle\nthis problem, we introduce SGLC, a real-time semantic graph-guided full loop\nclosing method, with robust loop closure detection and 6-DoF pose estimation\ncapabilities. SGLC takes into account the distinct characteristics of\nforeground and background points. For foreground instances, it builds a\nsemantic graph that not only abstracts point cloud representation for fast\ndescriptor generation and matching but also guides the subsequent loop\nverification and initial pose estimation. Background points, meanwhile, are\nexploited to provide more geometric features for scan-wise descriptor\nconstruction and stable planar information for further pose refinement. Loop\npose estimation employs a coarse-fine-refine registration scheme that considers\nthe alignment of both instance points and background points, offering high\nefficiency and accuracy. We evaluate the loop closing performance of SGLC\nthrough extensive experiments on the KITTI and KITTI-360 datasets,\ndemonstrating its superiority over existing state-of-the-art methods.\nAdditionally, we integrate SGLC into a SLAM system, eliminating accumulated\nerrors and improving overall SLAM performance. The implementation of SGLC will\nbe released at https://github.com/nubot-nudt/SGLC.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}