{"id":"2407.17185","title":"Vertical impact of a water jet on a hot plate from a growing drop to\n  spray formation","authors":"Aur\\'elien Goerlinger, Alice Germa, Farzam Zoueshtiagh, Alexis\n  Duchesne","authorsParsed":[["Goerlinger","Aurélien",""],["Germa","Alice",""],["Zoueshtiagh","Farzam",""],["Duchesne","Alexis",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 11:43:04 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 07:42:34 GMT"}],"updateDate":"2024-07-26","timestamp":1721821384000,"abstract":"  In this article, we experimentally investigate the impact of a submillimetric\nwater jet on a horizontal surface heated well above the \"static\" Leidenfrost\ntemperature of water. We observe the transition from a regime where a single\ndrop grows at the impingement point to a regime of spray formation. The main\ncontrol parameter appears to be the jet Weber number ($\\We$). The first regime\npersists until $\\We \\lesssim 30$ whereas the spray formation occurs for $\\We\n\\gtrsim 40$. Surprisingly, we found no influence of the hot plate's temperature\non the reported phenomena. We particularly focus on the second regime, where\nthe liquid jet spreads on the plate, forming a liquid sheet that eventually\nlifts off and breaks into droplets. We characterized this regime by the radius\n$r_c$ of the liquid sheet when it is still in contact with the plate and the\nangle of ejection $\\theta$ of the droplets. We further examine the ejected\ndroplets by characterizing their speed and sizes. Simple models are proposed to\npredict the dependencies and order of magnitudes of $r_c$ and $\\theta$. We also\naim to predict the critical Weber number at which the transition between the\ntwo regimes occurs. Our models show reasonable agreement with our experimental\ndata. Finally, we compare the energy transferred from the jet to the droplets\nwith results reported in the literature for impacts on unheated surfaces,\nfinding a difference of nearly a factor 2.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Aq3RwnkPrZHxXB1gxoQz_3SbJXA3vzpDAtfF-I4BkfE","pdfSize":"1889557","objectId":"0x409c4ae5ad5fc4e2330dfb6bd6b8825b66cd8a72aff9ef5664fcb286853aba40","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
