{"id":"2407.02498","title":"A New Classification of Clustering-based for Different Problems in\n  Different Wireless Ad-hoc Networks","authors":"Adda Boualem, Marwane Ayaida, Hichem Sedjelmaci, Chaimaa Khalfi,\n  Kamilia Brahimi, Bochra Khelil and Sanaa Bouchama","authorsParsed":[["Boualem","Adda",""],["Ayaida","Marwane",""],["Sedjelmaci","Hichem",""],["Khalfi","Chaimaa",""],["Brahimi","Kamilia",""],["Khelil","Bochra",""],["Bouchama","Sanaa",""]],"versions":[{"version":"v1","created":"Tue, 28 May 2024 15:52:07 GMT"}],"updateDate":"2024-07-04","timestamp":1716911527000,"abstract":"  Ad-hoc networks are specifically designed to facilitate communication in\nenvironments where establishing a dedicated network infrastructure is\nexceedingly complex or impractical. The integration of clustering concepts into\nvarious ad-hoc network scenarios, including Wireless Sensor Networks (WSN),\nMobile Ad-hoc Networks (MANET), Vehicular Ad-hoc Networks (VANET),\nDelay-Tolerant Networks (DTN), Wireless Ad-hoc Networks (WANET), Underwater\nWireless Sensor Networks (UWSN), Unmanned Aerial Vehicle Networks (UAV),\ncommonly known as \"drones,\" Space Networks (SN), and Satellite Networks (TN),\npresents abundant opportunities for refining strategies in event tracking and\narea monitoring across both deterministic and uncertain environments. This\npaper conducts a comparative analysis of diverse proposed strategies leveraging\nclustering concepts to address coverage challenges within deterministic and\nuncertain environments. As a result, it addresses current and future challenges\ninherent in clustering-based WANET, elucidating the merits, shortcomings, and\nweaknesses of clustering models. Lastly, it identifies potential avenues for\naddressing coverage issues in existing and emerging technologies.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}