{"id":"2407.14492","title":"Adaptive Uncertainty Quantification for Scenario-based Control Using\n  Meta-learning of Bayesian Neural Networks","authors":"Yajie Bao and Javad Mohammadpour Velni","authorsParsed":[["Bao","Yajie",""],["Velni","Javad Mohammadpour",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 17:44:40 GMT"}],"updateDate":"2024-07-22","timestamp":1721411080000,"abstract":"  Scenario-based optimization and control has proven to be an efficient\napproach to account for system uncertainty. In particular, the performance of\nscenario-based model predictive control (MPC) schemes depends on the accuracy\nof uncertainty quantification. However, current learning- and scenario-based\nMPC (sMPC) approaches employ a single timeinvariant probabilistic model\n(learned offline), which may not accurately describe time-varying\nuncertainties. Instead, this paper presents a model-agnostic meta-learning\n(MAML) of Bayesian neural networks (BNN) for adaptive uncertainty\nquantification that would be subsequently used for adaptive-scenario-tree model\npredictive control design of nonlinear systems with unknown dynamics to enhance\ncontrol performance. In particular, the proposed approach learns both a global\nBNN model and an updating law to refine the BNN model. At each time step, the\nupdating law transforms the global BNN model into more precise local BNN models\nin real time. The adapted local model is then used to generate scenarios for\nsMPC design at each time step. A probabilistic safety certificate is\nincorporated in the scenario generation to ensure that the trajectories of the\ngenerated scenarios contain the real trajectory of the system and that all the\nscenarios adhere to the constraints with a high probability. Experiments using\nclosed-loop simulations of a numerical example demonstrate that the proposed\napproach can improve the performance of scenario-based MPC compared to using\nonly one BNN model learned offline for all time steps.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}