{"id":"2407.07727","title":"Thermoelectric cooling of a finite reservoir coupled to a quantum dot","authors":"Stephanie Matern, Saulo V. Moreira, Peter Samuelsson, Martin Leijnse","authorsParsed":[["Matern","Stephanie",""],["Moreira","Saulo V.",""],["Samuelsson","Peter",""],["Leijnse","Martin",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 14:59:01 GMT"}],"updateDate":"2024-07-11","timestamp":1720623541000,"abstract":"  We investigate non-equilibrium transport of charge and heat through an\ninteracting quantum dot coupled to a finite electron reservoir. Both the\nquantum dot and the finite reservoir are coupled to conventional electric\ncontacts, i.e., infinite electron reservoirs, between which a bias voltage can\nbe applied. We develop a phenomenological description of the system, combining\na rate equation for transport through the quantum dot with standard linear\nresponse expressions for transport between the finite and infinite reservoirs.\nThe finite reservoir is assumed to be in a quasi-equilibrium state with\ntime-dependent chemical potential and temperature which we solve for\nself-consistently. We show that the finite reservoir can have a large impact on\nthe stationary state transport properties, including a shift and broadening of\nthe Coulomb diamond edges. We also demonstrate that there is a region around\nthe conductance lines where a heat current flows out of the finite reservoir.\nOur results reveal the dependence of the temperature that can be reached by\nthis thermoelectric cooling on the system parameters, in particular the\ncoupling between the finite and infinite reservoirs and additional heat\ncurrents induced by electron-phonon couplings, and can thus serve as a guide to\nexperiments on quantum dot-enabled thermoelectric cooling of finite electron\nreservoirs. Finally, we study the full dynamics of the system, with a\nparticular focus on the timescales involved in the thermoelectric cooling.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8XpdQ2FvM6wmKwkEF9Mp_Bw1DxbIfLUXXhFqaqSkuy4","pdfSize":"661710"}
