{"id":"2407.11893","title":"Urban mobility and learning: analyzing the influence of commuting time\n  on students' GPA at Politecnico di Milano","authors":"Arianna Burzacchi and Lidia Rossi and Tommaso Agasisti and Anna Maria\n  Paganoni and Simone Vantini","authorsParsed":[["Burzacchi","Arianna",""],["Rossi","Lidia",""],["Agasisti","Tommaso",""],["Paganoni","Anna Maria",""],["Vantini","Simone",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 16:21:38 GMT"}],"updateDate":"2024-07-17","timestamp":1721146898000,"abstract":"  Despite its crucial role in students' daily lives, commuting time remains an\nunderexplored dimension in higher education research. To address this gap, this\nstudy focuses on challenges that students face in urban environments and\ninvestigates the impact of commuting time on the academic performance of\nfirst-year bachelor students of Politecnico di Milano, Italy. This research\nemploys an innovative two-step methodology. In the initial phase, machine\nlearning algorithms trained on privacy-preserving GPS data from anonymous users\nare used to construct accessibility maps to the university and to obtain an\nestimate of students' commuting times. In the subsequent phase, authors utilize\npolynomial linear mixed-effects models and investigate the factors influencing\nstudents' academic performance, with a particular emphasis on commuting time.\nNotably, this investigation incorporates a causal framework, which enables the\nestablishment of causal relationships between commuting time and academic\noutcomes. The findings underscore the significant impact of travel time on\nstudents' performance and may support policies and implications aiming at\nimproving students' educational experience in metropolitan areas. The study's\ninnovation lies both in its exploration of a relatively uncharted factor and\nthe novel methodologies applied in both phases.\n","subjects":["Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}