{"id":"2407.15543","title":"Rapid formation of binary asteroid systems post rotational failure: a\n  recipe for making atypically shaped satellites","authors":"John Wimarsson, Zhen Xiang, Fabio Ferrari, Martin Jutzi, Gustavo\n  Madeira, Sabina D. Raducan, Paul S\\'anchez","authorsParsed":[["Wimarsson","John",""],["Xiang","Zhen",""],["Ferrari","Fabio",""],["Jutzi","Martin",""],["Madeira","Gustavo",""],["Raducan","Sabina D.",""],["Sánchez","Paul",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 11:08:55 GMT"}],"updateDate":"2024-07-23","timestamp":1721646535000,"abstract":"  Binary asteroid formation is a highly complex process, which has been\nhighlighted with recent observations of satellites with unexpected shapes, such\nas the oblate Dimorphos by the NASA DART mission and the contact binary Selam\nby NASA's Lucy mission. There is no clear consensus on which dynamical\nmechanisms determine the final shape of these objects. In turn, we explore a\nformation pathway where spin-up and rotational failure of a rubble pile\nasteroid lead to mass-shedding and a wide circumasteroidal debris disk in which\nthe satellite forms. Using a combination of smooth-particle hydrodynamical and\nN-body simulations, we study the dynamical evolution in detail. We find that a\ndebris disk containing matter corresponding to a few percent of the primary\nasteroid mass extending beyond the fluid Roche limit can consistently form both\noblate and bilobate satellites via a series of tidal encounters with the\nprimary body and mergers with other gravitational aggregates. Principally,\nsatellites end up prolate (elongated) and on synchronous orbits, accreting\nmainly in a radial direction while tides from the primary asteroid keep the\nshape intact. However, close encounters and mergers can break the orbital\nstate, leading to orbital migration and deformation. Satellite-satellite\nimpacts occurring in this regime have lower impact velocities than\nmerger-driven moon formation in e.g. planetary rings, leading to soft impacts\nbetween differently sized, non-spherical bodies. The resulting post-merger\nshape of the satellite is highly dependent on the impact geometry. Only moons\nhaving experienced a prior mild or catastrophic tidal disruption during a close\nencounter with the primary asteroid can become oblate spheroids, which is\nconsistent with the predominantly prolate observed population of binary\nasteroid satellites.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XkJpnJNZpKIvaTe4dYYaJqOMJahQdakXQYMZu5J3_0k","pdfSize":"6355491"}
