{"id":"2407.08265","title":"Coordinate-Aware Thermal Infrared Tracking Via Natural Language Modeling","authors":"Miao Yan, Ping Zhang, Haofei Zhang, Ruqian Hao, Juanxiu Liu, Xiaoyang\n  Wang, Lin Liu","authorsParsed":[["Yan","Miao",""],["Zhang","Ping",""],["Zhang","Haofei",""],["Hao","Ruqian",""],["Liu","Juanxiu",""],["Wang","Xiaoyang",""],["Liu","Lin",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 08:06:31 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 08:53:00 GMT"},{"version":"v3","created":"Fri, 26 Jul 2024 06:59:00 GMT"}],"updateDate":"2024-07-29","timestamp":1720685191000,"abstract":"  Thermal infrared (TIR) tracking is pivotal in computer vision tasks due to\nits all-weather imaging capability. Traditional tracking methods predominantly\nrely on hand-crafted features, and while deep learning has introduced\ncorrelation filtering techniques, these are often constrained by rudimentary\ncorrelation operations. Furthermore, transformer-based approaches tend to\noverlook temporal and coordinate information, which is critical for TIR\ntracking that lacks texture and color information. In this paper, to address\nthese issues, we apply natural language modeling to TIR tracking and propose a\ncoordinate-aware thermal infrared tracking model called NLMTrack, which\nenhances the utilization of coordinate and temporal information. NLMTrack\napplies an encoder that unifies feature extraction and feature fusion, which\nsimplifies the TIR tracking pipeline. To address the challenge of low detail\nand low contrast in TIR images, on the one hand, we design a multi-level\nprogressive fusion module that enhances the semantic representation and\nincorporates multi-scale features. On the other hand, the decoder combines the\nTIR features and the coordinate sequence features using a causal transformer to\ngenerate the target sequence step by step. Moreover, we explore an adaptive\nloss aimed at elevating tracking accuracy and a simple template update strategy\nto accommodate the target's appearance variations. Experiments show that\nNLMTrack achieves state-of-the-art performance on multiple benchmarks. The Code\nis publicly available at \\url{https://github.com/ELOESZHANG/NLMTrack}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}