{"id":"2407.12621","title":"Distinguishing Isotropic and Anisotropic Signals for X-ray Total\n  Scattering using Machine Learning","authors":"Danielle N. Alverson, Daniel Olds, Megan M. Butala","authorsParsed":[["Alverson","Danielle N.",""],["Olds","Daniel",""],["Butala","Megan M.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:49:08 GMT"}],"updateDate":"2024-07-18","timestamp":1721227748000,"abstract":"  Understanding structure-property relationships is essential for advancing\ntechnologies based on thin films. X-ray pair distribution function (PDF)\nanalysis can access relevant atomic structure details spanning local-, mid-,\nand long-range order. While X-ray PDF has been adapted for thin films on\namorphous substrates, measurements on single crystal substrates are necessary\nto accurately determine structure origins for some thin film materials,\nespecially those for which the substrate changes the accessible structure and\nproperties. However, when measuring films on single crystal substrates, high\nintensity anisotropic Bragg spots saturate 2D detector images, overshadowing\nthe thin films' isotropic scattering signal. This renders previous data\nprocessing methods for films on amorphous substrates unsuitable for films on\nsingle crystal substrates. To address this measurement need, we developed\nIsoDAT2D, an innovative data processing approach using unsupervised machine\nlearning algorithms. The program combines non-negative matrix factorization and\nhierarchical agglomerative clustering to separate thin film and single crystal\nsubstrate X-ray scattering signals. We use SimDAT2D, a program we developed to\ngenerate synthetic thin film data, to validate IsoDAT2D. We also use IsoDAT2D\nto isolate X-ray total scattering signal from a thin film on a single crystal\nsubstrate. The resulting PDF data are compared to similar data processed using\nprevious methods, demonstrating superior performance relative to substrate\nsubtraction with a single crystal substrate and similar performance to\nsubstrate subtraction from an amorphous substrate. With IsoDAT2D, there are new\nopportunities to expand PDF to a wider variety of thin films, including those\non single crystal substrates, with which new structure-property relationships\ncan be elucidated to enable fundamental understanding and technological\nadvances.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}