{"id":"2407.06373","title":"Enhancing super-resolution ultrasound localisation through multi-frame\n  deconvolution exploiting spatiotemporal coherence","authors":"Su Yan, Clotilde Vi\\'e, Marcelo Lerendegui, Herman Verinaz-Jadan,\n  Jipeng Yan, Martina Tashkova, James Burn, Bingxue Wang, Gary Frost, Kevin G.\n  Murphy, Meng-Xing Tang","authorsParsed":[["Yan","Su",""],["Vié","Clotilde",""],["Lerendegui","Marcelo",""],["Verinaz-Jadan","Herman",""],["Yan","Jipeng",""],["Tashkova","Martina",""],["Burn","James",""],["Wang","Bingxue",""],["Frost","Gary",""],["Murphy","Kevin G.",""],["Tang","Meng-Xing",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 20:35:52 GMT"}],"updateDate":"2024-07-10","timestamp":1720470952000,"abstract":"  Super-resolution ultrasound imaging through microbubble (MB) localisation and\ntracking, also known as ultrasound localisation microscopy, allows non-invasive\nsub-diffraction resolution imaging of microvasculature in animals and humans.\nThe number of MBs localised from the acquired contrast-enhanced ultrasound\n(CEUS) images and the localisation precision directly influence the quality of\nthe resulting super-resolution microvasculature images. However, non-negligible\nnoise present in the CEUS images can make localising MBs challenging. To\nenhance the MB localisation performance, we propose a Multi-Frame Deconvolution\n(MF-Decon) framework that can exploit the spatiotemporal coherence inherent in\nthe CEUS data, with new spatial and temporal regularisers designed based on\ntotal variation (TV) and regularisation by denoising (RED). Based on the\nMF-Decon framework, we introduce two novel methods: MF-Decon with spatial and\ntemporal TVs (MF-Decon+3DTV) and MF-Decon with spatial RED and temporal TV\n(MF-Decon+RED+TV). Results from in silico simulations indicate that our methods\noutperform two widely used methods using deconvolution or normalised\ncross-correlation across all evaluation metrics, including precision, recall,\n$F_1$ score, mean and standard localisation errors. In particular, our methods\nimprove MB localisation precision by up to 39% and recall by up to 12%.\nSuper-resolution microvasculature maps generated with our methods on a publicly\navailable in vivo rat brain dataset show less noise, better contrast, higher\nresolution and more vessel structures.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"2kM1n0PvlXtCGg1uKlZFKwXlv-zUPdZh6loJLCD9-Ss","pdfSize":"45263125"}
