{"id":"2407.11445","title":"Ground electrical and electromagnetic methods for deep mineral\n  exploration -- results from the SEEMS DEEP project","authors":"Mathieu Darnet (BRGM), Bitnarae Kim (BRGM), Simon Vedrine (BRGM),\n  Jacques Deparis (BRGM), Francois Bretaudeau (BRGM), Julien Gance, Fabrice\n  Vermeersch, Catherine Truffert (BRGM), Uula Autio (GKT), Jochen Kamm (GKT),\n  Cedric Patzer (GKT), Thomas Kalscheuer (SGU), Suvi Heinonen (GKT)","authorsParsed":[["Darnet","Mathieu","","BRGM"],["Kim","Bitnarae","","BRGM"],["Vedrine","Simon","","BRGM"],["Deparis","Jacques","","BRGM"],["Bretaudeau","Francois","","BRGM"],["Gance","Julien","","BRGM"],["Vermeersch","Fabrice","","BRGM"],["Truffert","Catherine","","BRGM"],["Autio","Uula","","GKT"],["Kamm","Jochen","","GKT"],["Patzer","Cedric","","GKT"],["Kalscheuer","Thomas","","SGU"],["Heinonen","Suvi","","GKT"]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 07:24:14 GMT"}],"updateDate":"2024-07-17","timestamp":1721114654000,"abstract":"  The transition towards carbon neutral transportation and energy sources\nincreases the global demand for mineral raw materials while easy-to-find\nnear-surface (\\< 200 m) ore deposits are unlikely discovered in well-explored\nareas such as Europe. In order to increase the mineral exploration success\nrate, the project SEEMS DEEP (SEismic and ElectroMagnetic methodS for DEEP\nmineral exploration) develops geophysical deep exploration workflow capable of\nimaging the bedrock from the surface down to several kilometres depth. In this\npaper, we present first results from ground electrical and electromagnetic\nsurveys conducted at the SEEM DEEP geological test site, namely the Koillismaa\nLayered Intrusion Complex in north-eastern Finland. Here, a 1.7 km long hole\ndrilled by GTK intersected mafic-ultramafic rocks with anomalous electrical and\nchargeability properties at ~1400 m depth, making it an interesting case study\nto test the ability of such technologies for imaging resistivity and\nchargeability contrasts at several kilometre depth.\n","subjects":["Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}