{"id":"2407.07889","title":"AdaptiGraph: Material-Adaptive Graph-Based Neural Dynamics for Robotic\n  Manipulation","authors":"Kaifeng Zhang, Baoyu Li, Kris Hauser, Yunzhu Li","authorsParsed":[["Zhang","Kaifeng",""],["Li","Baoyu",""],["Hauser","Kris",""],["Li","Yunzhu",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 17:57:04 GMT"}],"updateDate":"2024-07-11","timestamp":1720634224000,"abstract":"  Predictive models are a crucial component of many robotic systems. Yet,\nconstructing accurate predictive models for a variety of deformable objects,\nespecially those with unknown physical properties, remains a significant\nchallenge. This paper introduces AdaptiGraph, a learning-based dynamics\nmodeling approach that enables robots to predict, adapt to, and control a wide\narray of challenging deformable materials with unknown physical properties.\nAdaptiGraph leverages the highly flexible graph-based neural dynamics (GBND)\nframework, which represents material bits as particles and employs a graph\nneural network (GNN) to predict particle motion. Its key innovation is a\nunified physical property-conditioned GBND model capable of predicting the\nmotions of diverse materials with varying physical properties without\nretraining. Upon encountering new materials during online deployment,\nAdaptiGraph utilizes a physical property optimization process for a few-shot\nadaptation of the model, enhancing its fit to the observed interaction data.\nThe adapted models can precisely simulate the dynamics and predict the motion\nof various deformable materials, such as ropes, granular media, rigid boxes,\nand cloth, while adapting to different physical properties, including\nstiffness, granular size, and center of pressure. On prediction and\nmanipulation tasks involving a diverse set of real-world deformable objects,\nour method exhibits superior prediction accuracy and task proficiency over\nnon-material-conditioned and non-adaptive models. The project page is available\nat https://robopil.github.io/adaptigraph/ .\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}