{"id":"2407.18394","title":"Identifying quantum resources in encoded computations","authors":"Jack Davis, Nicolas Fabre, Ulysse Chabaud","authorsParsed":[["Davis","Jack",""],["Fabre","Nicolas",""],["Chabaud","Ulysse",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 21:01:18 GMT"}],"updateDate":"2024-07-29","timestamp":1721941278000,"abstract":"  What is the origin of quantum computational advantage? Providing answers to\nthis far-reaching question amounts to identifying the key properties, or\nquantum resources, that distinguish quantum computers from their classical\ncounterparts, with direct applications to the development of quantum devices.\nThe advent of universal quantum computers, however, relies on error-correcting\ncodes to protect fragile logical quantum information by robustly encoding it\ninto symmetric states of a quantum physical system. Such encodings make the\ntask of resource identification more difficult, as what constitutes a resource\nfrom the logical and physical points of view can differ significantly. Here we\nintroduce a general framework which allows us to correctly identify quantum\nresources in encoded computations, based on phase-space techniques. For a given\nquantum code, our construction provides a Wigner function that accounts for how\nthe symmetries of the code space are contained within the transformations of\nthe physical space, resulting in an object capable of describing the logical\ncontent of any physical state, both within and outside the code space. We\nillustrate our general construction with the Gottesman--Kitaev--Preskill\nencoding of qudits with odd dimension. The resulting Wigner function, which we\ncall the Zak-Gross Wigner function, is shown to correctly identify quantum\nresources through its phase-space negativity. For instance, it is positive for\nencoded stabilizer states and negative for the bosonic vacuum. We further prove\nseveral properties, including that its negativity provides a measure of magic\nfor the logical content of a state, and that its marginals are modular\nmeasurement distributions associated to conjugate Zak patches.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}