{"id":"2407.19461","title":"Automated Detection of Satellite Trails in Ground-Based Observations\n  Using U-Net and Hough Transform","authors":"F. Stoppa, P.J. Groot, R. Stuik, P. Vreeswijk, S. Bloemen, D.L.A.\n  Pieterse, P.A. Woudt","authorsParsed":[["Stoppa","F.",""],["Groot","P. J.",""],["Stuik","R.",""],["Vreeswijk","P.",""],["Bloemen","S.",""],["Pieterse","D. L. A.",""],["Woudt","P. A.",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 10:49:04 GMT"}],"updateDate":"2024-07-30","timestamp":1722163744000,"abstract":"  The expansion of satellite constellations poses a significant challenge to\noptical ground-based astronomical observations, as satellite trails degrade\nobservational data and compromise research quality. Addressing these challenges\nrequires developing robust detection methods to enhance data processing\npipelines, creating a reliable approach for detecting and analyzing satellite\ntrails that can be easily reproduced and applied by other observatories and\ndata processing groups. Our method, called ASTA (Automated Satellite Tracking\nfor Astronomy), combines deep learning and computer vision techniques for\neffective satellite trail detection. It employs a U-Net based deep learning\nnetwork to initially detect trails, followed by a Probabilistic Hough Transform\nto refine the output. ASTA's U-Net model was trained on a dataset with manually\nlabelled full-field MeerLICHT images prepared using the LABKIT annotation tool,\nensuring high-quality and precise annotations. This annotation process was\ncrucial for the model to learn and generalize the characteristics of satellite\ntrails effectively. Furthermore, the user-friendly LABKIT tool facilitated\nquick and efficient data refinements, streamlining the overall model\ndevelopment process. ASTA's performance was evaluated on a test set of 20,000\nimage patches, both with and without satellite trails, to rigorously assess its\nprecision and recall. Additionally, ASTA was applied to approximately 200,000\nfull-field MeerLICHT images, demonstrating its effectiveness in identifying and\ncharacterizing satellite trails. The software's results were validated by\ncross-referencing detected trails with known public satellite catalogs,\nconfirming its reliability and showcasing its ability to uncover previously\nuntracked objects.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}