{"id":"2407.06458","title":"Soli-enabled Noncontact Heart Rate Detection for Sleep and Meditation\n  Tracking","authors":"Luzhou Xu, Jaime Lien, Haiguang Li, Nicholas Gillian, Rajeev Nongpiur,\n  Jihan Li, Qian Zhang, Jian Cui, David Jorgensen, Adam Bernstein, Lauren\n  Bedal, Eiji Hayashi, Jin Yamanaka, Alex Lee, Jian Wang, D Shin, Ivan\n  Poupyrev, Trausti Thormundsson, Anupam Pathak, Shwetak Patel","authorsParsed":[["Xu","Luzhou",""],["Lien","Jaime",""],["Li","Haiguang",""],["Gillian","Nicholas",""],["Nongpiur","Rajeev",""],["Li","Jihan",""],["Zhang","Qian",""],["Cui","Jian",""],["Jorgensen","David",""],["Bernstein","Adam",""],["Bedal","Lauren",""],["Hayashi","Eiji",""],["Yamanaka","Jin",""],["Lee","Alex",""],["Wang","Jian",""],["Shin","D",""],["Poupyrev","Ivan",""],["Thormundsson","Trausti",""],["Pathak","Anupam",""],["Patel","Shwetak",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 23:44:24 GMT"}],"updateDate":"2024-07-10","timestamp":1720482264000,"abstract":"  Heart rate (HR) is a crucial physiological signal that can be used to monitor\nhealth and fitness. Traditional methods for measuring HR require wearable\ndevices, which can be inconvenient or uncomfortable, especially during sleep\nand meditation. Noncontact HR detection methods employing microwave radar can\nbe a promising alternative. However, the existing approaches in the literature\nusually use high-gain antennas and require the sensor to face the user's chest\nor back, making them difficult to integrate into a portable device and\nunsuitable for sleep and meditation tracking applications. This study presents\na novel approach for noncontact HR detection using a miniaturized Soli radar\nchip embedded in a portable device (Google Nest Hub). The chip has a $6.5\n\\mbox{ mm} \\times 5 \\mbox{ mm} \\times 0.9 \\mbox{ mm}$ dimension and can be\neasily integrated into various devices. The proposed approach utilizes advanced\nsignal processing and machine learning techniques to extract HRs from radar\nsignals. The approach is validated on a sleep dataset (62 users, 498 hours) and\na meditation dataset (114 users, 1131 minutes). The approach achieves a mean\nabsolute error (MAE) of $1.69$ bpm and a mean absolute percentage error (MAPE)\nof $2.67\\%$ on the sleep dataset. On the meditation dataset, the approach\nachieves an MAE of $1.05$ bpm and a MAPE of $1.56\\%$. The recall rates for the\ntwo datasets are $88.53\\%$ and $98.16\\%$, respectively. This study represents\nthe first application of the noncontact HR detection technology to sleep and\nmeditation tracking, offering a promising alternative to wearable devices for\nHR monitoring during sleep and meditation.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9HPfSMQbSYNG6HZ5TDWSeG6A4N0UeoiYuttMl2uQVOI","pdfSize":"1079699"}
