{"id":"2407.10209","title":"Vector Field Attention for Deformable Image Registration","authors":"Yihao Liu, Junyu Chen, Lianrui Zuo, Aaron Carass, Jerry L. Prince","authorsParsed":[["Liu","Yihao",""],["Chen","Junyu",""],["Zuo","Lianrui",""],["Carass","Aaron",""],["Prince","Jerry L.",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 14:06:58 GMT"}],"updateDate":"2024-07-16","timestamp":1720966018000,"abstract":"  Deformable image registration establishes non-linear spatial correspondences\nbetween fixed and moving images. Deep learning-based deformable registration\nmethods have been widely studied in recent years due to their speed advantage\nover traditional algorithms as well as their better accuracy. Most existing\ndeep learning-based methods require neural networks to encode location\ninformation in their feature maps and predict displacement or deformation\nfields though convolutional or fully connected layers from these\nhigh-dimensional feature maps. In this work, we present Vector Field Attention\n(VFA), a novel framework that enhances the efficiency of the existing network\ndesign by enabling direct retrieval of location correspondences. VFA uses\nneural networks to extract multi-resolution feature maps from the fixed and\nmoving images and then retrieves pixel-level correspondences based on feature\nsimilarity. The retrieval is achieved with a novel attention module without the\nneed of learnable parameters. VFA is trained end-to-end in either a supervised\nor unsupervised manner. We evaluated VFA for intra- and inter-modality\nregistration and for unsupervised and semi-supervised registration using public\ndatasets, and we also evaluated it on the Learn2Reg challenge. Experimental\nresults demonstrate the superior performance of VFA compared to existing\nmethods. The source code of VFA is publicly available at\nhttps://github.com/yihao6/vfa/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}