{"id":"2407.07538","title":"An epidemical model with nonlocal spatial infections","authors":"Su Yang, Weiqi Chu, Panayotis Kevrekidis","authorsParsed":[["Yang","Su",""],["Chu","Weiqi",""],["Kevrekidis","Panayotis",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 10:58:30 GMT"}],"updateDate":"2024-07-11","timestamp":1720609110000,"abstract":"  The SIR model is one of the most prototypical compartmental models in\nepidemiology. Generalizing this ordinary differential equation (ODE) framework\ninto a spatially distributed partial differential equation (PDE) model is a\nconsiderable challenge. In the present work, we extend a recently proposed\nmodel based on nearest-neighbor spatial interactions by one of the authors\nin~\\cite{vaziry2022modelling} towards a nonlocal, nonlinear PDE variant of the\nSIR prototype. We then seek to develop a set of tools that provide insights for\nthis PDE framework. Stationary states and their stability analysis offer a\nperspective on the early spatial growth of the infection. Evolutionary\ncomputational dynamics enable visualization of the spatio-temporal progression\nof infection and recovery, allowing for an appreciation of the effect of\nvarying parameters of the nonlocal kernel, such as, e.g., its width parameter.\nThese features are explored in both one- and two-dimensional settings. At a\nmodel-reduction level, we develop a sequence of interpretable moment-based\ndiagnostics to observe how these reflect the total number of infections, the\nepidemic's epicenter, and its spread. Finally, we propose a data-driven\nmethodology based on the sparse identification of nonlinear dynamics (SINDy) to\nidentify approximate closed-form dynamical equations for such quantities. These\napproaches may pave the way for further spatio-temporal studies, enabling the\nquantification of epidemics.\n","subjects":["Quantitative Biology/Quantitative Methods","Nonlinear Sciences/Pattern Formation and Solitons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}