{"id":"2407.19801","title":"Twisted electron impact elastic cross sections of polyatomic molecules:\n  All active electron multicentered approach","authors":"Raul Sheldon Pinto and Rakesh Choubisa","authorsParsed":[["Pinto","Raul Sheldon",""],["Choubisa","Rakesh",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 08:56:08 GMT"},{"version":"v2","created":"Wed, 11 Sep 2024 11:47:40 GMT"},{"version":"v3","created":"Sat, 14 Sep 2024 06:58:03 GMT"}],"updateDate":"2024-09-17","timestamp":1722243368000,"abstract":"  The methodology and computation of absolute elastic differential and integral\n(total) cross-sections of polyatomic molecules by twisted electron beam (Bessel\nBeam) impact is presented with $CO_2$ as an example. The target molecule is\nmodeled using multicentered wavefunctions with the correlation consistent\nquadruple zeta basis set cc-pVQZ and optimized by the post-Hartree-Fock Coupled\nCluster CCSD method. The electron density is obtained as a function of spatial\ncoordinates and is used to calculate the elastic form factor while considering\nthe active role of all electrons in the molecule. Coulomb direct potentials are\nused for the interactions of the incident beam with all electrons and nuclei in\nthe First Born Approximation. Orientation averaging of the differential\ncross-section is performed to mimic experimental situations. The cross sections\nare calculated at intermediate energies ranging from 300eV to 1keV. The\nproposed methodology could be applied to any polyatomic molecule. The\ninteractions of Bessel beams (Twisted Electron Beam) with topological charges\n$m_l$ = 1, 2, and 3 are analyzed. The average over-impact parameters of the\ndifferential cross-sections representing the beam's interaction with a large\nnumber of uniformly transversely distributed molecules are also studied and\npresented. Finally, the molecules' Integral elastic cross-section (ICS) by\nplane waves and twisted beams is calculated and presented.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"hGkccLOz1Ydm8rx8B1jiSlkuSiArNUa9Hii5vJU4s2o","pdfSize":"528841"}
