{"id":"2407.08856","title":"Direct Measurement of Microwave Loss in Nb Films for Superconducting\n  Qubits","authors":"B. Abdisatarov, D. Bafia, A. Murthy, G. Eremeev, H. E. Elsayed-Ali, J.\n  Lee, A. Netepenko, C. P. A. Carlos, S. Leith, G. J. Rosaz, A. Romanenko, A.\n  Grassellino","authorsParsed":[["Abdisatarov","B.",""],["Bafia","D.",""],["Murthy","A.",""],["Eremeev","G.",""],["Elsayed-Ali","H. E.",""],["Lee","J.",""],["Netepenko","A.",""],["Carlos","C. P. A.",""],["Leith","S.",""],["Rosaz","G. J.",""],["Romanenko","A.",""],["Grassellino","A.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 20:43:45 GMT"}],"updateDate":"2024-07-15","timestamp":1720730625000,"abstract":"  Niobium films are a key component in modern two-dimensional superconducting\nqubits, yet their contribution to the total qubit decay rate is not fully\nunderstood. The presence of different layers of materials and interfaces makes\nit difficult to identify the dominant loss channels in present two-dimensional\nqubit designs. In this paper we present the first study which directly\ncorrelates measurements of RF losses in such films to material parameters by\ninvestigating a high-power impulse magnetron sputtered (HiPIMS) film atop a\nthree-dimensional niobium superconducting radiofrequency (SRF) resonator. By\nusing a 3D SRF structure, we are able to isolate the niobium film loss from\nother contributions. Our findings indicate that microwave dissipation in the\nHiPIMS-prepared niobium films, within the quantum regime, resembles that of\nrecord-high intrinsic quality factor of bulk niobium SRF cavities, with\nlifetimes extending into seconds. Microstructure and impurity level of the\nniobium film do not significantly affect the losses. These results set the\nscale of microwave losses in niobium films and show that niobium losses do not\ndominate the observed coherence times in present two-dimensional\nsuperconducting qubit designs, instead highlighting the dominant role of the\ndielectric oxide in limiting the performance. We can also set a bound for when\nniobium film losses will become a limitation for qubit lifetimes.\n","subjects":["Condensed Matter/Superconductivity","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}