{"id":"2407.01280","title":"Human-Robot Mutual Learning through Affective-Linguistic Interaction and\n  Differential Outcomes Training [Pre-Print]","authors":"Emilia Heikkinen, Elsa Silvennoinen, Imran Khan, Zakaria Lemhaouri,\n  Laura Cohen, Lola Ca\\~namero, and Robert Lowe","authorsParsed":[["Heikkinen","Emilia",""],["Silvennoinen","Elsa",""],["Khan","Imran",""],["Lemhaouri","Zakaria",""],["Cohen","Laura",""],["Cañamero","Lola",""],["Lowe","Robert",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:35:08 GMT"}],"updateDate":"2024-07-02","timestamp":1719840908000,"abstract":"  Owing to the recent success of Large Language Models, Modern A.I has been\nmuch focused on linguistic interactions with humans but less focused on\nnon-linguistic forms of communication between man and machine. In the present\npaper, we test how affective-linguistic communication, in combination with\ndifferential outcomes training, affects mutual learning in a human-robot\ncontext. Taking inspiration from child-caregiver dynamics, our human-robot\ninteraction setup consists of a (simulated) robot attempting to learn how best\nto communicate internal, homeostatically-controlled needs; while a human\n\"caregiver\" attempts to learn the correct object to satisfy the robot's present\ncommunicated need. We studied the effects of i) human training type, and ii)\nrobot reinforcement learning type, to assess mutual learning terminal accuracy\nand rate of learning (as measured by the average reward achieved by the robot).\nOur results find mutual learning between a human and a robot is significantly\nimproved with Differential Outcomes Training (DOT) compared to Non-DOT\n(control) conditions. We find further improvements when the robot uses an\nexploration-exploitation policy selection, compared to purely exploitation\npolicy selection. These findings have implications for utilizing socially\nassistive robots (SAR) in therapeutic contexts, e.g. for cognitive\ninterventions, and educational applications.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sPBeAWt_1mB3HQ3uzUJ1uRd4bQhPUD1pvH9HtoOVDIo","pdfSize":"497424"}
