{"id":"2407.15005","title":"Gravothermal collapse and the diversity of galactic rotation curves","authors":"M. Grant Roberts, Manoj Kaplinghat, Mauro Valli, Hai-Bo Yu","authorsParsed":[["Roberts","M. Grant",""],["Kaplinghat","Manoj",""],["Valli","Mauro",""],["Yu","Hai-Bo",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 23:19:16 GMT"}],"updateDate":"2024-07-23","timestamp":1721517556000,"abstract":"  The rotation curves of spiral galaxies exhibit a great diversity that\nchallenge our understanding of galaxy formation and the nature of dark matter.\nPrevious studies showed that in self-interacting dark matter (SIDM) models with\na cross section per unit mass of $\\sigma/m\\approx{\\cal O}(1)~{\\rm cm^2/g}$, the\npredicted dark matter central densities are a good match to the observed\ndensities in galaxies. In this work, we explore a regime with a larger cross\nsection of $\\sigma/m\\approx20-40~{\\rm cm^2/g}$ in dwarf galactic halos. We will\nshow that such strong dark matter self-interactions can further amplify the\ndiversity of halo densities inherited from their assembly history. High\nconcentration halos can enter the gravothermal collapse phase within $10~{\\rm\nGyr}$, resulting in a high density, while low concentration ones remain in the\nexpansion phase and have a low density. We fit the rotation curves of $14$\nrepresentative low surface brightness galaxies and demonstrate how the large\nrange of observed central densities are naturally accommodated in the strong\nSIDM regime of $\\sigma/m\\approx20-40~{\\rm cm^2/g}$. Galaxies that are outliers\nin the previous studies due to their high halo central densities, are no longer\noutliers in this SIDM regime as their halos would be in the collapse phase. For\ngalaxies with a low density, the SIDM fits are robust to the variation of the\ncross section. Our findings open up a new window for testing gravothermal\ncollapse, the unique signature of strong dark matter self-interactions, and\nexploring broad SIDM model space.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QGl2pp2QOwvG4ETFPNf_53OM2Wyc-FuI_tKei3lJNR0","pdfSize":"6784565"}
