{"id":"2407.01846","title":"Investigating the Segment Anything Foundation Model for Mapping\n  Smallholder Agriculture Field Boundaries Without Training Labels","authors":"Pratyush Tripathy, Kathy Baylis, Kyle Wu, Jyles Watson, Ruizhe Jiang","authorsParsed":[["Tripathy","Pratyush",""],["Baylis","Kathy",""],["Wu","Kyle",""],["Watson","Jyles",""],["Jiang","Ruizhe",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 23:06:02 GMT"}],"updateDate":"2024-07-03","timestamp":1719875162000,"abstract":"  Accurate mapping of agricultural field boundaries is crucial for enhancing\noutcomes like precision agriculture, crop monitoring, and yield estimation.\nHowever, extracting these boundaries from satellite images is challenging,\nespecially for smallholder farms and data-scarce environments. This study\nexplores the Segment Anything Model (SAM) to delineate agricultural field\nboundaries in Bihar, India, using 2-meter resolution SkySat imagery without\nadditional training. We evaluate SAM's performance across three model\ncheckpoints, various input sizes, multi-date satellite images, and\nedge-enhanced imagery. Our results show that SAM correctly identifies about 58%\nof field boundaries, comparable to other approaches requiring extensive\ntraining data. Using different input image sizes improves accuracy, with the\nmost significant improvement observed when using multi-date satellite images.\nThis work establishes proof of concept for using SAM and maximizing its\npotential in agricultural field boundary mapping. Our work highlights SAM's\npotential in delineating agriculture field boundary in training-data scarce\nsettings to enable a wide range of agriculture related analysis.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"_KObxLiawvBpMFGQ1ArmJw3bbQP5qizq5a5Vwdq1-pQ","pdfSize":"33030946","objectId":"0x2c9ae01c17c0858fd1d66e87a112aeee397adfc273c5ce2feb33d21daf06c69f","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
