{"id":"2407.06491","title":"VideoEval: Comprehensive Benchmark Suite for Low-Cost Evaluation of\n  Video Foundation Model","authors":"Xinhao Li, Zhenpeng Huang, Jing Wang, Kunchang Li, Limin Wang","authorsParsed":[["Li","Xinhao",""],["Huang","Zhenpeng",""],["Wang","Jing",""],["Li","Kunchang",""],["Wang","Limin",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 01:49:08 GMT"}],"updateDate":"2024-07-10","timestamp":1720489748000,"abstract":"  With the growth of high-quality data and advancement in visual pre-training\nparadigms, Video Foundation Models (VFMs) have made significant progress\nrecently, demonstrating their remarkable performance on traditional video\nunderstanding benchmarks. However, the existing benchmarks (e.g. Kinetics) and\ntheir evaluation protocols are often limited by relatively poor diversity, high\nevaluation costs, and saturated performance metrics. In this paper, we build a\ncomprehensive benchmark suite to address these issues, namely VideoEval.\nSpecifically, we establish the Video Task Adaption Benchmark (VidTAB) and the\nVideo Embedding Benchmark (VidEB) from two perspectives: evaluating the task\nadaptability of VFMs under few-shot conditions and assessing their\nrepresentation power by directly applying to downstream tasks. With VideoEval,\nwe conduct a large-scale study on 20 popular open-source vision foundation\nmodels. Our study reveals some insightful findings on VFMs: 1) overall, current\nVFMs exhibit weak generalization across diverse tasks, 2) increasing video\ndata, whether labeled or weakly-labeled video-text pairs, does not necessarily\nimprove task performance, 3) the effectiveness of some pre-training paradigms\nmay not be fully validated in previous benchmarks, and 4) combining different\npre-training paradigms can help improve the generalization capabilities. We\nbelieve this study serves as an important complement to the current evaluation\nfor VFMs and offers valuable insights for the future research.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}