{"id":"2407.01781","title":"fVDB: A Deep-Learning Framework for Sparse, Large-Scale, and\n  High-Performance Spatial Intelligence","authors":"Francis Williams, Jiahui Huang, Jonathan Swartz, Gergely Kl\\'ar, Vijay\n  Thakkar, Matthew Cong, Xuanchi Ren, Ruilong Li, Clement Fuji-Tsang, Sanja\n  Fidler, Eftychios Sifakis, Ken Museth","authorsParsed":[["Williams","Francis",""],["Huang","Jiahui",""],["Swartz","Jonathan",""],["Klár","Gergely",""],["Thakkar","Vijay",""],["Cong","Matthew",""],["Ren","Xuanchi",""],["Li","Ruilong",""],["Fuji-Tsang","Clement",""],["Fidler","Sanja",""],["Sifakis","Eftychios",""],["Museth","Ken",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 20:20:33 GMT"}],"updateDate":"2024-07-03","timestamp":1719865233000,"abstract":"  We present fVDB, a novel GPU-optimized framework for deep learning on\nlarge-scale 3D data. fVDB provides a complete set of differentiable primitives\nto build deep learning architectures for common tasks in 3D learning such as\nconvolution, pooling, attention, ray-tracing, meshing, etc.\n  fVDB simultaneously provides a much larger feature set (primitives and\noperators) than established frameworks with no loss in efficiency: our\noperators match or exceed the performance of other frameworks with narrower\nscope. Furthermore, fVDB can process datasets with much larger footprint and\nspatial resolution than prior works, while providing a competitive memory\nfootprint on small inputs. To achieve this combination of versatility and\nperformance, fVDB relies on a single novel VDB index grid acceleration\nstructure paired with several key innovations including GPU accelerated sparse\ngrid construction, convolution using tensorcores, fast ray tracing kernels\nusing a Hierarchical Digital Differential Analyzer algorithm (HDDA), and jagged\ntensors.\n  Our framework is fully integrated with PyTorch enabling interoperability with\nexisting pipelines, and we demonstrate its effectiveness on a number of\nrepresentative tasks such as large-scale point-cloud segmentation, high\nresolution 3D generative modeling, unbounded scale Neural Radiance Fields, and\nlarge-scale point cloud reconstruction.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}