{"id":"2407.11315","title":"COMET: \"Cone of experience\" enhanced large multimodal model for\n  mathematical problem generation","authors":"Sannyuya Liu, Jintian Feng, Zongkai Yang, Yawei Luo, Qian Wan,\n  Xiaoxuan Shen, Jianwen Sun","authorsParsed":[["Liu","Sannyuya",""],["Feng","Jintian",""],["Yang","Zongkai",""],["Luo","Yawei",""],["Wan","Qian",""],["Shen","Xiaoxuan",""],["Sun","Jianwen",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 02:02:16 GMT"}],"updateDate":"2024-07-17","timestamp":1721095336000,"abstract":"  The automatic generation of high-quality mathematical problems is practically\nvaluable in many educational scenarios. Large multimodal model provides a novel\ntechnical approach for the mathematical problem generation because of its wide\nsuccess in cross-modal data scenarios. However, the traditional method of\nseparating problem solving from problem generation and the mainstream\nfine-tuning framework of monotonous data structure with homogeneous training\nobjectives limit the application of large multimodal model in mathematical\nproblem generation. Addressing these challenges, this paper proposes COMET, a\n\"Cone of Experience\" enhanced large multimodal model for mathematical problem\ngeneration. Firstly, from the perspective of mutual ability promotion and\napplication logic, we unify stem generation and problem solving into\nmathematical problem generation. Secondly, a three-stage fine-turning framework\nguided by the \"Cone of Experience\" is proposed. The framework divides the\nfine-tuning data into symbolic experience, iconic experience, and direct\nexperience to draw parallels with experiences in the career growth of teachers.\nSeveral fine-grained data construction and injection methods are designed in\nthis framework. Finally, we construct a Chinese multimodal mathematical problem\ndataset to fill the vacancy of Chinese multimodal data in this field. Combined\nwith objective and subjective indicators, experiments on multiple datasets\nfully verify the effectiveness of the proposed framework and model.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}