{"id":"2407.07853","title":"Progressive Growing of Patch Size: Resource-Efficient Curriculum\n  Learning for Dense Prediction Tasks","authors":"Stefan M. Fischer, Lina Felsner, Richard Osuala, Johannes Kiechle,\n  Daniel M. Lang, Jan C. Peeken and Julia A. Schnabel","authorsParsed":[["Fischer","Stefan M.",""],["Felsner","Lina",""],["Osuala","Richard",""],["Kiechle","Johannes",""],["Lang","Daniel M.",""],["Peeken","Jan C.",""],["Schnabel","Julia A.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 17:14:54 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 07:35:26 GMT"}],"updateDate":"2024-07-12","timestamp":1720631694000,"abstract":"  In this work, we introduce Progressive Growing of Patch Size, a\nresource-efficient implicit curriculum learning approach for dense prediction\ntasks. Our curriculum approach is defined by growing the patch size during\nmodel training, which gradually increases the task's difficulty. We integrated\nour curriculum into the nnU-Net framework and evaluated the methodology on all\n10 tasks of the Medical Segmentation Decathlon. With our approach, we are able\nto substantially reduce runtime, computational costs, and CO2 emissions of\nnetwork training compared to classical constant patch size training. In our\nexperiments, the curriculum approach resulted in improved convergence. We are\nable to outperform standard nnU-Net training, which is trained with constant\npatch size, in terms of Dice Score on 7 out of 10 MSD tasks while only spending\nroughly 50% of the original training runtime. To the best of our knowledge, our\nProgressive Growing of Patch Size is the first successful employment of a\nsample-length curriculum in the form of patch size in the field of computer\nvision. Our code is publicly available at\nhttps://github.com/compai-lab/2024-miccai-fischer.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JCDnLZFMo5KS9uOG045hhODcaMag499aIojZHiBx2v4","pdfSize":"441168","objectId":"0x18577a41726d62e17d82ed4ed9bc8876bc689670f910b1965da1a4c68ac2dfae","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
