{"id":"2407.02406","title":"Observation of a stripe phase in a spin-orbit coupled exciton-polariton\n  Bose-Einstein condensate","authors":"Marcin Muszynski, Pavel Kokhanchik, Darius Urbonas, Piotr Kapuscinski,\n  Przemyslaw Oliwa, Rafal Mirek, Ioannis Georgakilas, Thilo Stoferle, Rainer F.\n  Mahrt, Michael Forster, Ullrich Scherf, Dmitriy Dovzhenko, Rafal Mazur,\n  Przemyslaw Morawiak, Wiktor Piecek, Przemyslaw Kula, Barbara Pietka, Dmitry\n  Solnyshkov, Guillaume Malpuech, Jacek Szczytko","authorsParsed":[["Muszynski","Marcin",""],["Kokhanchik","Pavel",""],["Urbonas","Darius",""],["Kapuscinski","Piotr",""],["Oliwa","Przemyslaw",""],["Mirek","Rafal",""],["Georgakilas","Ioannis",""],["Stoferle","Thilo",""],["Mahrt","Rainer F.",""],["Forster","Michael",""],["Scherf","Ullrich",""],["Dovzhenko","Dmitriy",""],["Mazur","Rafal",""],["Morawiak","Przemyslaw",""],["Piecek","Wiktor",""],["Kula","Przemyslaw",""],["Pietka","Barbara",""],["Solnyshkov","Dmitry",""],["Malpuech","Guillaume",""],["Szczytko","Jacek",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 16:29:21 GMT"}],"updateDate":"2024-07-03","timestamp":1719937761000,"abstract":"  In Bose-Einstein condensates, spin-orbit coupling produces supersolidity. It\nis a peculiar state of matter, which, in addition to the superfluid behaviour\nof weakly interacting Bose condensates, shows a periodic modulation of its\ndensity typical for crystals and called stripe phase. Here, we report the\nfabrication of a new type of samples allowing to achieve room-temperature\nsupersolidity for a quantum fluid of light. The structure is an optical\nmicrocavity filled with a nematic liquid crystal (LC) sandwiched between two\nlayers of the organic polymer MeLPPP. We demonstrate the formation of cavity\nexciton-polaritons in the presence of Rashba-Dresselhaus spin-orbit coupling\n(RDSOC), which is tuned by external voltage controlling the LC birefringence.\nIn the RDSOC regime, we demonstrate exciton-polariton condensation in the two\ndistinct degenerate minima of the dispersion. The condensate real space\ndistribution shows both polarization and density stripes, which stem from the\ninterference between phase-coherent condensate components characterized by\ndifferent wavevectors and polarizations. The possibilities offered by this\nplatform to tune the particle dispersion and to perform full state tomography,\nincluding time-resolved, open wide perspectives for detailed future studies of\nthe static and dynamical behaviour of supersolids and of quantum fluids in\npresence of SOC and topologically non-trivial bands.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Quantum Gases"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}