{"id":"2407.01162","title":"Actuation system of the inertial sensor for high-precision space\n  missions using torsion pendulum","authors":"Fangchao Yang, Yan Zhu, Xiaofei Jin, Yujie Zhao, Shixun Pei, Wei Hong","authorsParsed":[["Yang","Fangchao",""],["Zhu","Yan",""],["Jin","Xiaofei",""],["Zhao","Yujie",""],["Pei","Shixun",""],["Hong","Wei",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 10:31:00 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 07:46:01 GMT"}],"updateDate":"2024-07-11","timestamp":1719829860000,"abstract":"  Precision space inertial sensors are imperative to Earth geodesy missions,\ngravitational wave observations and several fundamental physics experiments in\nspace. In these missions, the residual acceleration noise of the test mass(TM)\ncaused by the forces from inertial sensor components and environment is\nsupposed to be kept below a certain level. As a number of forces contributing\nto residual acceleration are related to actuation system, developing a precise\nactuation system to exclude any erroneous force and obtain an ultra sensitive\nvalue for TM acceleration noise is necessary and essential. However, it is\ndifficult to test the actuation system on ground. In this paper, a torsion\npendulum is established to test the influence of actuation system on TM torque\nnoise and a closed-loop control system combined torsion pendulum and parts of\nactuation modules is designed to assess the performance of actuation control\nalgorithm. The experimental results show that the parameters in an actuation\nsystem will introduce additional torque noise and the maximum noise can reach\nas much as 10^{-13}Nm /Hz^{1/2} at 1 mHz. The stable tracking error for the\nclosed-loop system is about 10^{-7}, indicating that the combination system\nachieves good tracking performance and robustness for TM rotation control in\ndifferent conditions of inertial sensors.\n","subjects":["Physics/Space Physics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}