{"id":"2407.19545","title":"Ambipolar doping of a charge-transfer insulator in the Emery model","authors":"G. Sordi, G. L. Reaney, N. Kowalski, P. S\\'emon, A.-M. S. Tremblay","authorsParsed":[["Sordi","G.",""],["Reaney","G. L.",""],["Kowalski","N.",""],["Sémon","P.",""],["Tremblay","A. -M. S.",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 17:38:03 GMT"}],"updateDate":"2024-07-30","timestamp":1722188283000,"abstract":"  Understanding the similarities and differences between adding or removing\nelectrons from a charge-transfer insulator may provide insights about the\norigin of the electron-hole asymmetry found in cuprates. Here we study with\ncellular dynamical mean-field theory the Emery model set in the charge-transfer\ninsulator regime, and dope it with either electrons or holes. We consider the\nnormal state only and focus on the doping evolution of the orbital character of\nthe dopants and on the nature of the doping driven transition. Regarding the\norbital character of the dopants, we found an electron-hole asymmetry: doped\nelectrons mostly enter the copper orbitals, whereas doped holes mostly enter\nthe oxygen orbitals. Regarding the nature of the doping driven transition, we\nfound no qualitative electron-hole asymmetry: upon either electron or hole\ndoping, there is a two-stage transition from a charge-transfer insulator to a\nstrongly correlated pseudogap and then to a metal. This shows that a strongly\ncorrelated pseudogap is an emergent feature of doped correlated insulators in\ntwo dimensions, in qualitative agreement with recent experiments on ambipolar\nSr$_{1-x}$La$_{x}$CuO$_{2+y}$ cuprate films. Our results indicate that merely\ndoping with holes or electrons a charge-transfer insulator is not sufficient\nfor explaining the electron-hole asymmetry observed in the normal state phase\ndiagram of cuprates. Our work reinforces the view that actual hole-doped\ncuprates are more correlated than their electron-doped counterparts.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}